[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "(25) 5. Āpattibhayavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Saṅghabhedakasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "243"
      },
      ". Ekaṃ ",
      " samayaṃ bhagavā kosambiyaṃ viharati ghositārāme. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ ānandaṃ bhagavā etadavoca – ‘‘api nu taṃ, ānanda, adhikaraṇaṃ vūpasanta’’nti? ‘‘Kuto taṃ, bhante, adhikaraṇaṃ vūpasamissati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vūpasammissati (?)]"
      },
      "! Āyasmato ",
      ", bhante, anuruddhassa bāhiyo nāma saddhivihāriko kevalakappaṃ saṅghabhedāya ṭhito. Tatrāyasmā anuruddho na ekavācikampi bhaṇitabbaṃ maññatī’’ti."
    ],
    "innerText": "243. Ekaṃ samayaṃ bhagavā kosambiyaṃ viharati ghositārāme. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ ānandaṃ bhagavā etadavoca – ‘‘api nu taṃ, ānanda, adhikaraṇaṃ vūpasanta’’nti? ‘‘Kuto taṃ, bhante, adhikaraṇaṃ vūpasamissati [vūpasammissati (?)]! Āyasmato , bhante, anuruddhassa bāhiyo nāma saddhivihāriko kevalakappaṃ saṅghabhedāya ṭhito. Tatrāyasmā anuruddho na ekavācikampi bhaṇitabbaṃ maññatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kadā panānanda, anuruddho saṅghamajjhe adhikaraṇesu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[adhikaraṇesu tesu (ka.)]"
      },
      " voyuñjati! Nanu, ānanda, yāni kānici adhikaraṇāni uppajjanti, sabbāni tāni tumhe ceva vūpasametha sāriputtamoggallānā ca."
    ],
    "innerText": "‘‘Kadā panānanda, anuruddho saṅghamajjhe adhikaraṇesu [adhikaraṇesu tesu (ka.)] voyuñjati! Nanu, ānanda, yāni kānici adhikaraṇāni uppajjanti, sabbāni tāni tumhe ceva vūpasametha sāriputtamoggallānā ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Cattārome, ānanda, atthavase sampassamāno pāpabhikkhu saṅghabhedena nandati. Katame cattāro? Idhānanda, pāpabhikkhu dussīlo hoti pāpadhammo asuci saṅkassarasamācāro paṭicchannakammanto assamaṇo samaṇapaṭiñño abrahmacārī brahmacāripaṭiñño antopūti ",
      " avassuto kasambujāto. Tassa evaṃ hoti – ‘sace kho maṃ bhikkhū jānissanti – dussīlo pāpadhammo asuci saṅkassarasamācāro paṭicchannakammanto assamaṇo samaṇapaṭiñño abrahmacārī brahmacāripaṭiñño antopūti avassuto kasambujātoti, samaggā maṃ santā nāsessanti; vaggā pana maṃ na nāsessantī’ti. Idaṃ, ānanda, paṭhamaṃ atthavasaṃ sampassamāno pāpabhikkhu saṅghabhedena nandati."
    ],
    "innerText": "‘‘Cattārome, ānanda, atthavase sampassamāno pāpabhikkhu saṅghabhedena nandati. Katame cattāro? Idhānanda, pāpabhikkhu dussīlo hoti pāpadhammo asuci saṅkassarasamācāro paṭicchannakammanto assamaṇo samaṇapaṭiñño abrahmacārī brahmacāripaṭiñño antopūti avassuto kasambujāto. Tassa evaṃ hoti – ‘sace kho maṃ bhikkhū jānissanti – dussīlo pāpadhammo asuci saṅkassarasamācāro paṭicchannakammanto assamaṇo samaṇapaṭiñño abrahmacārī brahmacāripaṭiñño antopūti avassuto kasambujātoti, samaggā maṃ santā nāsessanti; vaggā pana maṃ na nāsessantī’ti. Idaṃ, ānanda, paṭhamaṃ atthavasaṃ sampassamāno pāpabhikkhu saṅghabhedena nandati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, ānanda, pāpabhikkhu micchādiṭṭhiko hoti, antaggāhikāya diṭṭhiyā samannāgato. Tassa evaṃ hoti – ‘sace kho maṃ bhikkhū jānissanti – micchādiṭṭhiko antaggāhikāya ",
      " diṭṭhiyā samannāgatoti, samaggā maṃ santā nāsessanti; vaggā pana maṃ na nāsessantī’ti. Idaṃ, ānanda, dutiyaṃ atthavasaṃ sampassamāno pāpabhikkhu saṅghabhedena nandati."
    ],
    "innerText": "‘‘Puna caparaṃ, ānanda, pāpabhikkhu micchādiṭṭhiko hoti, antaggāhikāya diṭṭhiyā samannāgato. Tassa evaṃ hoti – ‘sace kho maṃ bhikkhū jānissanti – micchādiṭṭhiko antaggāhikāya diṭṭhiyā samannāgatoti, samaggā maṃ santā nāsessanti; vaggā pana maṃ na nāsessantī’ti. Idaṃ, ānanda, dutiyaṃ atthavasaṃ sampassamāno pāpabhikkhu saṅghabhedena nandati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna ",
      " caparaṃ, ānanda, pāpabhikkhu micchāājīvo hoti, micchāājīvena ",
      " jīvikaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[jīvitaṃ (syā. kaṃ. pī. ka.)]"
      },
      " kappeti. Tassa evaṃ hoti – ‘sace kho maṃ bhikkhū jānissanti – micchāājīvo micchāājīvena jīvikaṃ kappetīti, samaggā maṃ santā nāsessanti; vaggā pana maṃ na nāsessantī’ti. Idaṃ, ānanda, tatiyaṃ atthavasaṃ sampassamāno pāpabhikkhu saṅghabhedena nandati."
    ],
    "innerText": "‘‘Puna caparaṃ, ānanda, pāpabhikkhu micchāājīvo hoti, micchāājīvena jīvikaṃ [jīvitaṃ (syā. kaṃ. pī. ka.)] kappeti. Tassa evaṃ hoti – ‘sace kho maṃ bhikkhū jānissanti – micchāājīvo micchāājīvena jīvikaṃ kappetīti, samaggā maṃ santā nāsessanti; vaggā pana maṃ na nāsessantī’ti. Idaṃ, ānanda, tatiyaṃ atthavasaṃ sampassamāno pāpabhikkhu saṅghabhedena nandati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, ānanda, pāpabhikkhu lābhakāmo hoti sakkārakāmo anavaññattikāmo. Tassa evaṃ hoti – ‘sace kho maṃ bhikkhū jānissanti – lābhakāmo sakkārakāmo anavaññattikāmoti, samaggā maṃ santā na sakkarissanti na garuṃ karissanti na mānessanti na pūjessanti; vaggā pana maṃ sakkarissanti garuṃ karissanti mānessanti pūjessantī’ti. Idaṃ, ānanda, catutthaṃ atthavasaṃ sampassamāno pāpabhikkhu saṅghabhedena nandati. Ime kho, ānanda, cattāro atthavase sampassamāno pāpabhikkhu saṅghabhedena nandatī’’ti. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Āpattibhayasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "244"
      },
      ". ‘‘Cattārimāni, bhikkhave, āpattibhayāni. Katamāni cattāri? Seyyathāpi, bhikkhave, coraṃ āgucāriṃ gahetvā rañño dasseyyuṃ – ‘ayaṃ te, deva, coro āgucārī. Imassa devo daṇḍaṃ paṇetū’ti. Tamenaṃ rājā evaṃ vadeyya – ‘gacchatha ",
      ", bho, imaṃ purisaṃ daḷhāya rajjuyā pacchābāhaṃ gāḷhabandhanaṃ bandhitvā khuramuṇḍaṃ karitvā kharassarena paṇavena rathikāya rathikaṃ siṅghāṭakena siṅghāṭakaṃ parinetvā dakkhiṇena dvārena nikkhāmetvā dakkhiṇato nagarassa sīsaṃ chindathā’ti. Tamenaṃ rañño purisā daḷhāya rajjuyā ",
      " pacchābāhaṃ gāḷhabandhanaṃ bandhitvā khuramuṇḍaṃ karitvā kharassarena paṇavena rathikāya rathikaṃ siṅghāṭakena siṅghāṭakaṃ parinetvā dakkhiṇena dvārena nikkhāmetvā dakkhiṇato nagarassa sīsaṃ chindeyyuṃ. Tatraññatarassa thalaṭṭhassa purisassa evamassa – ‘pāpakaṃ vata, bho, ayaṃ puriso kammaṃ akāsi gārayhaṃ sīsacchejjaṃ. Yatra hi nāma rañño purisā daḷhāya rajjuyā pacchābāhaṃ gāḷhabandhanaṃ bandhitvā khuramuṇḍaṃ karitvā kharassarena paṇavena rathikāya rathikaṃ siṅghāṭakena siṅghāṭakaṃ parinetvā dakkhiṇena ",
      " dvārena nikkhāmetvā dakkhiṇato nagarassa sīsaṃ chindissanti ",
      "! So vatassāhaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[so vatassāyaṃ (sī.)]"
      },
      " evarūpaṃ pāpakammaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pāpaṃ kammaṃ (sī. pī.)]"
      },
      " na kareyyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[na kareyya (sī.) dī. ni. 1.183 pāḷiyā tadaṭṭhakathāya ca saṃsandetabbaṃ]"
      },
      " gārayhaṃ sīsacchejja’nti. Evamevaṃ kho, bhikkhave, yassa kassaci bhikkhussa vā bhikkhuniyā vā evaṃ tibbā bhayasaññā paccupaṭṭhitā hoti pārājikesu dhammesu. Tassetaṃ pāṭikaṅkhaṃ – anāpanno vā pārājikaṃ dhammaṃ na āpajjissati, āpanno vā pārājikaṃ dhammaṃ yathādhammaṃ paṭikarissati."
    ],
    "innerText": "244. ‘‘Cattārimāni, bhikkhave, āpattibhayāni. Katamāni cattāri? Seyyathāpi, bhikkhave, coraṃ āgucāriṃ gahetvā rañño dasseyyuṃ – ‘ayaṃ te, deva, coro āgucārī. Imassa devo daṇḍaṃ paṇetū’ti. Tamenaṃ rājā evaṃ vadeyya – ‘gacchatha , bho, imaṃ purisaṃ daḷhāya rajjuyā pacchābāhaṃ gāḷhabandhanaṃ bandhitvā khuramuṇḍaṃ karitvā kharassarena paṇavena rathikāya rathikaṃ siṅghāṭakena siṅghāṭakaṃ parinetvā dakkhiṇena dvārena nikkhāmetvā dakkhiṇato nagarassa sīsaṃ chindathā’ti. Tamenaṃ rañño purisā daḷhāya rajjuyā pacchābāhaṃ gāḷhabandhanaṃ bandhitvā khuramuṇḍaṃ karitvā kharassarena paṇavena rathikāya rathikaṃ siṅghāṭakena siṅghāṭakaṃ parinetvā dakkhiṇena dvārena nikkhāmetvā dakkhiṇato nagarassa sīsaṃ chindeyyuṃ. Tatraññatarassa thalaṭṭhassa purisassa evamassa – ‘pāpakaṃ vata, bho, ayaṃ puriso kammaṃ akāsi gārayhaṃ sīsacchejjaṃ. Yatra hi nāma rañño purisā daḷhāya rajjuyā pacchābāhaṃ gāḷhabandhanaṃ bandhitvā khuramuṇḍaṃ karitvā kharassarena paṇavena rathikāya rathikaṃ siṅghāṭakena siṅghāṭakaṃ parinetvā dakkhiṇena dvārena nikkhāmetvā dakkhiṇato nagarassa sīsaṃ chindissanti ! So vatassāhaṃ [so vatassāyaṃ (sī.)] evarūpaṃ pāpakammaṃ [pāpaṃ kammaṃ (sī. pī.)] na kareyyaṃ [na kareyya (sī.) dī. ni. 1.183 pāḷiyā tadaṭṭhakathāya ca saṃsandetabbaṃ] gārayhaṃ sīsacchejja’nti. Evamevaṃ kho, bhikkhave, yassa kassaci bhikkhussa vā bhikkhuniyā vā evaṃ tibbā bhayasaññā paccupaṭṭhitā hoti pārājikesu dhammesu. Tassetaṃ pāṭikaṅkhaṃ – anāpanno vā pārājikaṃ dhammaṃ na āpajjissati, āpanno vā pārājikaṃ dhammaṃ yathādhammaṃ paṭikarissati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, bhikkhave, puriso kāḷavatthaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kāḷakaṃ vatthaṃ (sī. syā. kaṃ. pī.)]"
      },
      " paridhāya kese pakiritvā musalaṃ khandhe āropetvā mahājanakāyaṃ upasaṅkamitvā evaṃ vadeyya – ‘ahaṃ, bhante, pāpakammaṃ akāsiṃ gārayhaṃ mosallaṃ, yena me āyasmanto attamanā honti taṃ karomī’ti. Tatraññatarassa thalaṭṭhassa purisassa evamassa – ‘pāpakaṃ vata, bho, ayaṃ puriso kammaṃ akāsi gārayhaṃ mosallaṃ. Yatra hi nāma kāḷavatthaṃ paridhāya kese pakiritvā musalaṃ khandhe āropetvā mahājanakāyaṃ upasaṅkamitvā evaṃ vakkhati – ‘ahaṃ, bhante, pāpakammaṃ akāsiṃ gārayhaṃ mosallaṃ, yena me āyasmanto ",
      " attamanā honti taṃ karomīti. So ",
      " vatassāhaṃ evarūpaṃ pāpakammaṃ na kareyyaṃ gārayhaṃ mosalla’nti. Evamevaṃ kho, bhikkhave, yassa kassaci bhikkhussa vā bhikkhuniyā vā evaṃ tibbā bhayasaññā paccupaṭṭhitā hoti saṅghādisesesu dhammesu, tassetaṃ pāṭikaṅkhaṃ – anāpanno vā saṅghādisesaṃ dhammaṃ na āpajjissati, āpanno vā saṅghādisesaṃ dhammaṃ yathādhammaṃ paṭikarissati."
    ],
    "innerText": "‘‘Seyyathāpi, bhikkhave, puriso kāḷavatthaṃ [kāḷakaṃ vatthaṃ (sī. syā. kaṃ. pī.)] paridhāya kese pakiritvā musalaṃ khandhe āropetvā mahājanakāyaṃ upasaṅkamitvā evaṃ vadeyya – ‘ahaṃ, bhante, pāpakammaṃ akāsiṃ gārayhaṃ mosallaṃ, yena me āyasmanto attamanā honti taṃ karomī’ti. Tatraññatarassa thalaṭṭhassa purisassa evamassa – ‘pāpakaṃ vata, bho, ayaṃ puriso kammaṃ akāsi gārayhaṃ mosallaṃ. Yatra hi nāma kāḷavatthaṃ paridhāya kese pakiritvā musalaṃ khandhe āropetvā mahājanakāyaṃ upasaṅkamitvā evaṃ vakkhati – ‘ahaṃ, bhante, pāpakammaṃ akāsiṃ gārayhaṃ mosallaṃ, yena me āyasmanto attamanā honti taṃ karomīti. So vatassāhaṃ evarūpaṃ pāpakammaṃ na kareyyaṃ gārayhaṃ mosalla’nti. Evamevaṃ kho, bhikkhave, yassa kassaci bhikkhussa vā bhikkhuniyā vā evaṃ tibbā bhayasaññā paccupaṭṭhitā hoti saṅghādisesesu dhammesu, tassetaṃ pāṭikaṅkhaṃ – anāpanno vā saṅghādisesaṃ dhammaṃ na āpajjissati, āpanno vā saṅghādisesaṃ dhammaṃ yathādhammaṃ paṭikarissati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, bhikkhave, puriso kāḷavatthaṃ paridhāya kese pakiritvā bhasmapuṭaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[assapuṭaṃ (sī. syā. kaṃ. pī.)]"
      },
      " khandhe āropetvā mahājanakāyaṃ upasaṅkamitvā evaṃ vadeyya – ‘ahaṃ, bhante, pāpakammaṃ akāsiṃ gārayhaṃ bhasmapuṭaṃ. Yena me āyasmanto attamanā honti taṃ karomī’ti. Tatraññatarassa thalaṭṭhassa purisassa evamassa – ‘pāpakaṃ vata, bho, ayaṃ puriso kammaṃ akāsi gārayhaṃ bhasmapuṭaṃ. Yatra hi nāma kāḷavatthaṃ paridhāya kese pakiritvā bhasmapuṭaṃ khandhe āropetvā mahājanakāyaṃ upasaṅkamitvā evaṃ vakkhati – ahaṃ, bhante, pāpakammaṃ akāsiṃ gārayhaṃ bhasmapuṭaṃ; yena me āyasmanto attamanā honti taṃ karomīti. So vatassāhaṃ evarūpaṃ pāpakammaṃ na kareyyaṃ gārayhaṃ ",
      " bhasmapuṭa’nti. Evamevaṃ kho, bhikkhave, yassa kassaci bhikkhussa vā bhikkhuniyā vā evaṃ tibbā bhayasaññā paccupaṭṭhitā hoti pācittiyesu dhammesu ",
      ", tassetaṃ pāṭikaṅkhaṃ – anāpanno vā pācittiyaṃ dhammaṃ na āpajjissati, āpanno vā pācittiyaṃ dhammaṃ yathādhammaṃ paṭikarissati."
    ],
    "innerText": "‘‘Seyyathāpi, bhikkhave, puriso kāḷavatthaṃ paridhāya kese pakiritvā bhasmapuṭaṃ [assapuṭaṃ (sī. syā. kaṃ. pī.)] khandhe āropetvā mahājanakāyaṃ upasaṅkamitvā evaṃ vadeyya – ‘ahaṃ, bhante, pāpakammaṃ akāsiṃ gārayhaṃ bhasmapuṭaṃ. Yena me āyasmanto attamanā honti taṃ karomī’ti. Tatraññatarassa thalaṭṭhassa purisassa evamassa – ‘pāpakaṃ vata, bho, ayaṃ puriso kammaṃ akāsi gārayhaṃ bhasmapuṭaṃ. Yatra hi nāma kāḷavatthaṃ paridhāya kese pakiritvā bhasmapuṭaṃ khandhe āropetvā mahājanakāyaṃ upasaṅkamitvā evaṃ vakkhati – ahaṃ, bhante, pāpakammaṃ akāsiṃ gārayhaṃ bhasmapuṭaṃ; yena me āyasmanto attamanā honti taṃ karomīti. So vatassāhaṃ evarūpaṃ pāpakammaṃ na kareyyaṃ gārayhaṃ bhasmapuṭa’nti. Evamevaṃ kho, bhikkhave, yassa kassaci bhikkhussa vā bhikkhuniyā vā evaṃ tibbā bhayasaññā paccupaṭṭhitā hoti pācittiyesu dhammesu , tassetaṃ pāṭikaṅkhaṃ – anāpanno vā pācittiyaṃ dhammaṃ na āpajjissati, āpanno vā pācittiyaṃ dhammaṃ yathādhammaṃ paṭikarissati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, bhikkhave, puriso ",
      " kāḷavatthaṃ paridhāya kese pakiritvā mahājanakāyaṃ upasaṅkamitvā evaṃ vadeyya – ‘ahaṃ, bhante, pāpakammaṃ akāsiṃ gārayhaṃ upavajjaṃ. Yena me āyasmanto attamanā honti taṃ karomī’ti. Tatraññatarassa thalaṭṭhassa purisassa evamassa – ‘pāpakaṃ vata, bho, ayaṃ puriso kammaṃ akāsi gārayhaṃ upavajjaṃ. Yatra hi nāma kāḷavatthaṃ paridhāya kese pakiritvā mahājanakāyaṃ upasaṅkamitvā evaṃ ",
      " vakkhati – ahaṃ, bhante, pāpakammaṃ akāsiṃ gārayhaṃ upavajjaṃ; yena me āyasmanto attamanā honti taṃ karomīti. So vatassāhaṃ evarūpaṃ pāpakammaṃ na kareyyaṃ gārayhaṃ upavajja’nti. Evamevaṃ kho, bhikkhave, yassa kassaci bhikkhussa vā bhikkhuniyā vā evaṃ tibbā bhayasaññā paccupaṭṭhitā hoti pāṭidesanīyesu dhammesu, tassetaṃ pāṭikaṅkhaṃ – anāpanno vā pāṭidesanīyaṃ dhammaṃ na āpajjissati, āpanno vā pāṭidesanīyaṃ dhammaṃ yathādhammaṃ paṭikarissati. Imāni kho, bhikkhave, cattāri āpattibhayānī’’ti. Dutiyaṃ."
    ],
    "innerText": "‘‘Seyyathāpi, bhikkhave, puriso kāḷavatthaṃ paridhāya kese pakiritvā mahājanakāyaṃ upasaṅkamitvā evaṃ vadeyya – ‘ahaṃ, bhante, pāpakammaṃ akāsiṃ gārayhaṃ upavajjaṃ. Yena me āyasmanto attamanā honti taṃ karomī’ti. Tatraññatarassa thalaṭṭhassa purisassa evamassa – ‘pāpakaṃ vata, bho, ayaṃ puriso kammaṃ akāsi gārayhaṃ upavajjaṃ. Yatra hi nāma kāḷavatthaṃ paridhāya kese pakiritvā mahājanakāyaṃ upasaṅkamitvā evaṃ vakkhati – ahaṃ, bhante, pāpakammaṃ akāsiṃ gārayhaṃ upavajjaṃ; yena me āyasmanto attamanā honti taṃ karomīti. So vatassāhaṃ evarūpaṃ pāpakammaṃ na kareyyaṃ gārayhaṃ upavajja’nti. Evamevaṃ kho, bhikkhave, yassa kassaci bhikkhussa vā bhikkhuniyā vā evaṃ tibbā bhayasaññā paccupaṭṭhitā hoti pāṭidesanīyesu dhammesu, tassetaṃ pāṭikaṅkhaṃ – anāpanno vā pāṭidesanīyaṃ dhammaṃ na āpajjissati, āpanno vā pāṭidesanīyaṃ dhammaṃ yathādhammaṃ paṭikarissati. Imāni kho, bhikkhave, cattāri āpattibhayānī’’ti. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Sikkhānisaṃsasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "245"
      },
      ". ‘‘Sikkhānisaṃsamidaṃ, bhikkhave, brahmacariyaṃ vussati paññuttaraṃ vimuttisāraṃ satādhipateyyaṃ. Kathañca, bhikkhave, sikkhānisaṃsaṃ hoti? Idha, bhikkhave, mayā sāvakānaṃ ābhisamācārikā sikkhā paññattā appasannānaṃ pasādāya pasannānaṃ bhiyyobhāvāya. Yathā yathā, bhikkhave, mayā sāvakānaṃ ābhisamācārikā sikkhā paññattā appasannānaṃ pasādāya pasannānaṃ bhiyyobhāvāya tathā tathā so tassā sikkhāya akhaṇḍakārī hoti acchiddakārī ",
      " asabalakārī akammāsakārī, samādāya sikkhati sikkhāpadesu."
    ],
    "innerText": "245. ‘‘Sikkhānisaṃsamidaṃ, bhikkhave, brahmacariyaṃ vussati paññuttaraṃ vimuttisāraṃ satādhipateyyaṃ. Kathañca, bhikkhave, sikkhānisaṃsaṃ hoti? Idha, bhikkhave, mayā sāvakānaṃ ābhisamācārikā sikkhā paññattā appasannānaṃ pasādāya pasannānaṃ bhiyyobhāvāya. Yathā yathā, bhikkhave, mayā sāvakānaṃ ābhisamācārikā sikkhā paññattā appasannānaṃ pasādāya pasannānaṃ bhiyyobhāvāya tathā tathā so tassā sikkhāya akhaṇḍakārī hoti acchiddakārī asabalakārī akammāsakārī, samādāya sikkhati sikkhāpadesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhikkhave, mayā sāvakānaṃ ādibrahmacariyikā sikkhā paññattā sabbaso sammā dukkhakkhayāya. Yathā yathā, bhikkhave, mayā sāvakānaṃ ādibrahmacariyikā sikkhā paññattā sabbaso sammā dukkhakkhayāya tathā tathā so tassā sikkhāya akhaṇḍakārī hoti ",
      " acchiddakārī ",
      " asabalakārī akammāsakārī, samādāya sikkhati sikkhāpadesu. Evaṃ kho, bhikkhave, sikkhānisaṃsaṃ hoti."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, mayā sāvakānaṃ ādibrahmacariyikā sikkhā paññattā sabbaso sammā dukkhakkhayāya. Yathā yathā, bhikkhave, mayā sāvakānaṃ ādibrahmacariyikā sikkhā paññattā sabbaso sammā dukkhakkhayāya tathā tathā so tassā sikkhāya akhaṇḍakārī hoti acchiddakārī asabalakārī akammāsakārī, samādāya sikkhati sikkhāpadesu. Evaṃ kho, bhikkhave, sikkhānisaṃsaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, paññuttaraṃ hoti? Idha, bhikkhave, mayā sāvakānaṃ dhammā desitā sabbaso sammā dukkhakkhayāya. Yathā yathā, bhikkhave, mayā sāvakānaṃ dhammā desitā sabbaso sammā dukkhakkhayāya tathā tathāssa te dhammā paññāya samavekkhitā honti. Evaṃ kho, bhikkhave, paññuttaraṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca ",
      ", bhikkhave, vimuttisāraṃ hoti? Idha, bhikkhave, mayā sāvakānaṃ dhammā desitā sabbaso sammā dukkhakkhayāya. Yathā yathā, bhikkhave, mayā sāvakānaṃ dhammā desitā sabbaso sammā dukkhakkhayāya tathā tathāssa te dhammā vimuttiyā phusitā honti. Evaṃ kho, bhikkhave, vimuttisāraṃ hoti."
    ],
    "innerText": "‘‘Kathañca , bhikkhave, vimuttisāraṃ hoti? Idha, bhikkhave, mayā sāvakānaṃ dhammā desitā sabbaso sammā dukkhakkhayāya. Yathā yathā, bhikkhave, mayā sāvakānaṃ dhammā desitā sabbaso sammā dukkhakkhayāya tathā tathāssa te dhammā vimuttiyā phusitā honti. Evaṃ kho, bhikkhave, vimuttisāraṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, satādhipateyyaṃ hoti? ‘Iti aparipūraṃ vā ābhisamācārikaṃ sikkhaṃ paripūressāmi, paripūraṃ vā ābhisamācārikaṃ sikkhaṃ tattha tattha paññāya anuggahessāmī’ti – ajjhattaṃyeva sati sūpaṭṭhitā hoti. ‘Iti aparipūraṃ vā ādibrahmacariyikaṃ sikkhaṃ paripūressāmi, paripūraṃ vā ādibrahmacariyikaṃ sikkhaṃ tattha tattha paññāya anuggahessāmī’ti – ajjhattaṃyeva sati sūpaṭṭhitā hoti. ‘Iti asamavekkhitaṃ vā ",
      " dhammaṃ paññāya samavekkhissāmi, samavekkhitaṃ vā dhammaṃ tattha tattha paññāya anuggahessāmī’ti – ajjhattaṃyeva sati sūpaṭṭhitā hoti. ‘Iti aphusitaṃ vā dhammaṃ vimuttiyā phusissāmi, phusitaṃ vā dhammaṃ tattha tattha paññāya anuggahessāmī’ti – ajjhattaṃyeva sati sūpaṭṭhitā hoti. Evaṃ kho, bhikkhave, satādhipateyyaṃ hoti. ‘Sikkhānisaṃsamidaṃ, bhikkhave, brahmacariyaṃ vussati paññuttaraṃ vimuttisāraṃ satādhipateyya’nti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vutta’’nti. Tatiyaṃ."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, satādhipateyyaṃ hoti? ‘Iti aparipūraṃ vā ābhisamācārikaṃ sikkhaṃ paripūressāmi, paripūraṃ vā ābhisamācārikaṃ sikkhaṃ tattha tattha paññāya anuggahessāmī’ti – ajjhattaṃyeva sati sūpaṭṭhitā hoti. ‘Iti aparipūraṃ vā ādibrahmacariyikaṃ sikkhaṃ paripūressāmi, paripūraṃ vā ādibrahmacariyikaṃ sikkhaṃ tattha tattha paññāya anuggahessāmī’ti – ajjhattaṃyeva sati sūpaṭṭhitā hoti. ‘Iti asamavekkhitaṃ vā dhammaṃ paññāya samavekkhissāmi, samavekkhitaṃ vā dhammaṃ tattha tattha paññāya anuggahessāmī’ti – ajjhattaṃyeva sati sūpaṭṭhitā hoti. ‘Iti aphusitaṃ vā dhammaṃ vimuttiyā phusissāmi, phusitaṃ vā dhammaṃ tattha tattha paññāya anuggahessāmī’ti – ajjhattaṃyeva sati sūpaṭṭhitā hoti. Evaṃ kho, bhikkhave, satādhipateyyaṃ hoti. ‘Sikkhānisaṃsamidaṃ, bhikkhave, brahmacariyaṃ vussati paññuttaraṃ vimuttisāraṃ satādhipateyya’nti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vutta’’nti. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Seyyāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "246"
      },
      ". ‘‘Catasso imā, bhikkhave, seyyā. Katamā catasso? Petaseyyā, kāmabhogiseyyā ",
      ", sīhaseyyā, tathāgataseyyā. Katamā ",
      " ca, bhikkhave, petaseyyā? Yebhuyyena, bhikkhave, petā uttānā senti; ayaṃ vuccati, bhikkhave, petaseyyā."
    ],
    "innerText": "246. ‘‘Catasso imā, bhikkhave, seyyā. Katamā catasso? Petaseyyā, kāmabhogiseyyā , sīhaseyyā, tathāgataseyyā. Katamā ca, bhikkhave, petaseyyā? Yebhuyyena, bhikkhave, petā uttānā senti; ayaṃ vuccati, bhikkhave, petaseyyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamā ca, bhikkhave, kāmabhogiseyyā? Yebhuyyena, bhikkhave, kāmabhogī vāmena passena senti; ayaṃ vuccati, bhikkhave, kāmabhogiseyyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamā ca, bhikkhave, sīhaseyyā? Sīho ",
      ", bhikkhave, migarājā dakkhiṇena passena seyyaṃ kappeti, pāde pādaṃ accādhāya, antarasatthimhi naṅguṭṭhaṃ anupakkhipitvā. So paṭibujjhitvā purimaṃ kāyaṃ abbhunnāmetvā pacchimaṃ kāyaṃ anuviloketi. Sace, bhikkhave, sīho migarājā kiñci passati kāyassa vikkhittaṃ vā visaṭaṃ vā, tena, bhikkhave, sīho migarājā anattamano hoti. Sace pana, bhikkhave, sīho migarājā na kiñci passati kāyassa vikkhittaṃ vā visaṭaṃ vā, tena ",
      ", bhikkhave, sīho migarājā attamano hoti. Ayaṃ vuccati, bhikkhave, sīhaseyyā."
    ],
    "innerText": "‘‘Katamā ca, bhikkhave, sīhaseyyā? Sīho , bhikkhave, migarājā dakkhiṇena passena seyyaṃ kappeti, pāde pādaṃ accādhāya, antarasatthimhi naṅguṭṭhaṃ anupakkhipitvā. So paṭibujjhitvā purimaṃ kāyaṃ abbhunnāmetvā pacchimaṃ kāyaṃ anuviloketi. Sace, bhikkhave, sīho migarājā kiñci passati kāyassa vikkhittaṃ vā visaṭaṃ vā, tena, bhikkhave, sīho migarājā anattamano hoti. Sace pana, bhikkhave, sīho migarājā na kiñci passati kāyassa vikkhittaṃ vā visaṭaṃ vā, tena , bhikkhave, sīho migarājā attamano hoti. Ayaṃ vuccati, bhikkhave, sīhaseyyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamā ca, bhikkhave, tathāgataseyyā? Idha, bhikkhave, tathāgato vivicceva kāmehi…pe… catutthaṃ jhānaṃ upasampajja viharati. Ayaṃ vuccati, bhikkhave, tathāgataseyyā. Imā kho, bhikkhave, catasso seyyā’’ti. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Thūpārahasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "247"
      },
      ". ‘‘Cattārome, bhikkhave, thūpārahā. Katame cattāro? Tathāgato arahaṃ sammāsambuddho thūpāraho, paccekabuddho thūpāraho, tathāgatasāvako thūpāraho, rājā cakkavattī thūpāraho – ime kho, bhikkhave, cattāro thūpārahā’’ti. Pañcamaṃ."
    ],
    "innerText": "247. ‘‘Cattārome, bhikkhave, thūpārahā. Katame cattāro? Tathāgato arahaṃ sammāsambuddho thūpāraho, paccekabuddho thūpāraho, tathāgatasāvako thūpāraho, rājā cakkavattī thūpāraho – ime kho, bhikkhave, cattāro thūpārahā’’ti. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Paññāvuddhisuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "248"
      },
      ". ‘‘Cattārome ",
      ", bhikkhave, dhammā paññāvuddhiyā saṃvattanti. Katame cattāro? Sappurisasaṃsevo, saddhammasavanaṃ, yonisomanasikāro, dhammānudhammappaṭipatti – ime kho, bhikkhave, cattāro dhammā paññāvuddhiyā saṃvattantī’’ti. Chaṭṭhaṃ."
    ],
    "innerText": "248. ‘‘Cattārome , bhikkhave, dhammā paññāvuddhiyā saṃvattanti. Katame cattāro? Sappurisasaṃsevo, saddhammasavanaṃ, yonisomanasikāro, dhammānudhammappaṭipatti – ime kho, bhikkhave, cattāro dhammā paññāvuddhiyā saṃvattantī’’ti. Chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Bahukārasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "249"
      },
      ". ‘‘Cattārome ",
      ", bhikkhave, dhammā manussabhūtassa bahukārā honti. Katame cattāro? Sappurisasaṃsevo, saddhammasavanaṃ, yonisomanasikāro, dhammānudhammappaṭipatti – ime ",
      " kho, bhikkhave, cattāro dhammā manussabhūtassa bahukārā hontī’’ti. Sattamaṃ."
    ],
    "innerText": "249. ‘‘Cattārome , bhikkhave, dhammā manussabhūtassa bahukārā honti. Katame cattāro? Sappurisasaṃsevo, saddhammasavanaṃ, yonisomanasikāro, dhammānudhammappaṭipatti – ime kho, bhikkhave, cattāro dhammā manussabhūtassa bahukārā hontī’’ti. Sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Paṭhamavohārasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "250"
      },
      ". ‘‘Cattārome, bhikkhave, anariyavohārā. Katame cattāro? Adiṭṭhe diṭṭhavāditā, asute sutavāditā, amute mutavāditā, aviññāte viññātavāditā – ime kho, bhikkhave, cattāro anariyavohārā’’ti. Aṭṭhamaṃ."
    ],
    "innerText": "250. ‘‘Cattārome, bhikkhave, anariyavohārā. Katame cattāro? Adiṭṭhe diṭṭhavāditā, asute sutavāditā, amute mutavāditā, aviññāte viññātavāditā – ime kho, bhikkhave, cattāro anariyavohārā’’ti. Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Dutiyavohārasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "251"
      },
      ". ‘‘Cattārome ",
      ", bhikkhave, ariyavohārā. Katame cattāro? Adiṭṭhe adiṭṭhavāditā, asute asutavāditā, amute amutavāditā, aviññāte aviññātavāditā – ime kho, bhikkhave, cattāro ariyavohārā’’ti. Navamaṃ."
    ],
    "innerText": "251. ‘‘Cattārome , bhikkhave, ariyavohārā. Katame cattāro? Adiṭṭhe adiṭṭhavāditā, asute asutavāditā, amute amutavāditā, aviññāte aviññātavāditā – ime kho, bhikkhave, cattāro ariyavohārā’’ti. Navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Tatiyavohārasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "252"
      },
      ". ‘‘Cattārome, bhikkhave, anariyavohārā. Katame cattāro? Diṭṭhe adiṭṭhavāditā, sute ",
      " asutavāditā, mute amutavāditā, viññāte aviññātavāditā – ime kho, bhikkhave, cattāro anariyavohārā’’ti. Dasamaṃ."
    ],
    "innerText": "252. ‘‘Cattārome, bhikkhave, anariyavohārā. Katame cattāro? Diṭṭhe adiṭṭhavāditā, sute asutavāditā, mute amutavāditā, viññāte aviññātavāditā – ime kho, bhikkhave, cattāro anariyavohārā’’ti. Dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "11. Catutthavohārasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "253"
      },
      ". ‘‘Cattārome, bhikkhave, ariyavohārā. Katame cattāro? Diṭṭhe diṭṭhavāditā, sute sutavāditā, mute mutavāditā, viññāte viññātavāditā – ime kho, bhikkhave, cattāro ariyavohārā’’ti. Ekādasamaṃ."
    ],
    "innerText": "253. ‘‘Cattārome, bhikkhave, ariyavohārā. Katame cattāro? Diṭṭhe diṭṭhavāditā, sute sutavāditā, mute mutavāditā, viññāte viññātavāditā – ime kho, bhikkhave, cattāro ariyavohārā’’ti. Ekādasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Āpattibhayavaggo pañcamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Bhedaāpatti ",
      " sikkhā ca, seyyā thūpārahena ca;"
    ],
    "innerText": "Bhedaāpatti sikkhā ca, seyyā thūpārahena ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Paññāvuddhi bahukārā, vohārā caturo ṭhitāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pañcamapaṇṇāsakaṃ samattaṃ."
  }
]