[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "(17) 2. Āghātavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Paṭhamaāghātapaṭivinayasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "161"
      },
      ". ‘‘Pañcime ",
      ", bhikkhave, āghātapaṭivinayā yattha bhikkhuno uppanno āghāto sabbaso paṭivinetabbo. Katame pañca? Yasmiṃ, bhikkhave, puggale āghāto jāyetha, mettā tasmiṃ puggale bhāvetabbā; evaṃ tasmiṃ puggale āghāto paṭivinetabbo. Yasmiṃ, bhikkhave, puggale āghāto jāyetha, karuṇā tasmiṃ puggale bhāvetabbā; evaṃ tasmiṃ puggale āghāto paṭivinetabbo. Yasmiṃ, bhikkhave, puggale āghāto jāyetha, upekkhā tasmiṃ puggale bhāvetabbā; evaṃ tasmiṃ puggale āghāto paṭivinetabbo. Yasmiṃ, bhikkhave, puggale āghāto jāyetha, asatiamanasikāro tasmiṃ puggale āpajjitabbo; evaṃ tasmiṃ puggale āghāto paṭivinetabbo. Yasmiṃ ",
      ", bhikkhave, puggale āghāto jāyetha, kammassakatā tasmiṃ puggale adhiṭṭhātabbā – ‘kammassako ayamāyasmā kammadāyādo kammayoni kammabandhu kammappaṭisaraṇo, yaṃ kammaṃ karissati kalyāṇaṃ vā pāpakaṃ vā tassa dāyādo bhavissatī’ti; evaṃ tasmiṃ puggale āghāto paṭivinetabbo. Ime kho, bhikkhave, pañca āghātapaṭivinayā, yattha bhikkhuno uppanno āghāto sabbaso paṭivinetabbo’’ti. Paṭhamaṃ."
    ],
    "innerText": "161. ‘‘Pañcime , bhikkhave, āghātapaṭivinayā yattha bhikkhuno uppanno āghāto sabbaso paṭivinetabbo. Katame pañca? Yasmiṃ, bhikkhave, puggale āghāto jāyetha, mettā tasmiṃ puggale bhāvetabbā; evaṃ tasmiṃ puggale āghāto paṭivinetabbo. Yasmiṃ, bhikkhave, puggale āghāto jāyetha, karuṇā tasmiṃ puggale bhāvetabbā; evaṃ tasmiṃ puggale āghāto paṭivinetabbo. Yasmiṃ, bhikkhave, puggale āghāto jāyetha, upekkhā tasmiṃ puggale bhāvetabbā; evaṃ tasmiṃ puggale āghāto paṭivinetabbo. Yasmiṃ, bhikkhave, puggale āghāto jāyetha, asatiamanasikāro tasmiṃ puggale āpajjitabbo; evaṃ tasmiṃ puggale āghāto paṭivinetabbo. Yasmiṃ , bhikkhave, puggale āghāto jāyetha, kammassakatā tasmiṃ puggale adhiṭṭhātabbā – ‘kammassako ayamāyasmā kammadāyādo kammayoni kammabandhu kammappaṭisaraṇo, yaṃ kammaṃ karissati kalyāṇaṃ vā pāpakaṃ vā tassa dāyādo bhavissatī’ti; evaṃ tasmiṃ puggale āghāto paṭivinetabbo. Ime kho, bhikkhave, pañca āghātapaṭivinayā, yattha bhikkhuno uppanno āghāto sabbaso paṭivinetabbo’’ti. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Dutiyaāghātapaṭivinayasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "162"
      },
      ". Tatra ",
      " kho āyasmā sāriputto bhikkhū āmantesi – ‘‘āvuso bhikkhave’’ti. ‘‘Āvuso’’ti kho te bhikkhū āyasmato sāriputtassa paccassosuṃ. Āyasmā sāriputto etadavoca –"
    ],
    "innerText": "162. Tatra kho āyasmā sāriputto bhikkhū āmantesi – ‘‘āvuso bhikkhave’’ti. ‘‘Āvuso’’ti kho te bhikkhū āyasmato sāriputtassa paccassosuṃ. Āyasmā sāriputto etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Pañcime, āvuso, āghātapaṭivinayā ",
      " yattha bhikkhuno uppanno āghāto sabbaso paṭivinetabbo. Katame pañca? Idhāvuso, ekacco puggalo aparisuddhakāyasamācāro hoti parisuddhavacīsamācāro; evarūpepi, āvuso, puggale āghāto paṭivinetabbo. Idha panāvuso, ekacco ",
      " puggalo aparisuddhavacīsamācāro hoti parisuddhakāyasamācāro; evarūpepi, āvuso, puggale āghāto paṭivinetabbo. Idha panāvuso, ekacco puggalo aparisuddhakāyasamācāro hoti aparisuddhavacīsamācāro, labhati ca kālena kālaṃ cetaso vivaraṃ cetaso pasādaṃ; evarūpepi, āvuso, puggale āghāto paṭivinetabbo. Idha panāvuso, ekacco puggalo aparisuddhakāyasamācāro hoti aparisuddhavacīsamācāro, na ca labhati kālena ",
      " kālaṃ cetaso vivaraṃ cetaso pasādaṃ; evarūpepi, āvuso, puggale āghāto paṭivinetabbo. Idha panāvuso, ekacco puggalo parisuddhakāyasamācāro parisuddhavacīsamācāro, labhati ca kālena vā kālaṃ cetaso vivaraṃ cetaso pasādaṃ; evarūpepi, āvuso, puggale āghāto paṭivinetabbo."
    ],
    "innerText": "‘‘Pañcime, āvuso, āghātapaṭivinayā yattha bhikkhuno uppanno āghāto sabbaso paṭivinetabbo. Katame pañca? Idhāvuso, ekacco puggalo aparisuddhakāyasamācāro hoti parisuddhavacīsamācāro; evarūpepi, āvuso, puggale āghāto paṭivinetabbo. Idha panāvuso, ekacco puggalo aparisuddhavacīsamācāro hoti parisuddhakāyasamācāro; evarūpepi, āvuso, puggale āghāto paṭivinetabbo. Idha panāvuso, ekacco puggalo aparisuddhakāyasamācāro hoti aparisuddhavacīsamācāro, labhati ca kālena kālaṃ cetaso vivaraṃ cetaso pasādaṃ; evarūpepi, āvuso, puggale āghāto paṭivinetabbo. Idha panāvuso, ekacco puggalo aparisuddhakāyasamācāro hoti aparisuddhavacīsamācāro, na ca labhati kālena kālaṃ cetaso vivaraṃ cetaso pasādaṃ; evarūpepi, āvuso, puggale āghāto paṭivinetabbo. Idha panāvuso, ekacco puggalo parisuddhakāyasamācāro parisuddhavacīsamācāro, labhati ca kālena vā kālaṃ cetaso vivaraṃ cetaso pasādaṃ; evarūpepi, āvuso, puggale āghāto paṭivinetabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tatrāvuso, yvāyaṃ puggalo aparisuddhakāyasamācāro parisuddhavacīsamācāro, kathaṃ tasmiṃ puggale āghāto paṭivinetabbo? Seyyathāpi, āvuso, bhikkhu paṃsukūliko rathiyāya nantakaṃ disvā vāmena pādena niggaṇhitvā dakkhiṇena pādena pattharitvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vitthāretvā (sī. pī.)]"
      },
      ", yo tattha sāro taṃ paripātetvā ādāya pakkameyya; evamevaṃ khvāvuso, yvāyaṃ puggalo aparisuddhakāyasamācāro parisuddhavacīsamācāro, yāssa aparisuddhakāyasamācāratā na ",
      " sāssa tasmiṃ samaye manasi kātabbā, yā ",
      " ca khvāssa parisuddhavacīsamācāratā sāssa tasmiṃ samaye manasi kātabbā. Evaṃ tasmiṃ puggale āghāto paṭivinetabbo."
    ],
    "innerText": "‘‘Tatrāvuso, yvāyaṃ puggalo aparisuddhakāyasamācāro parisuddhavacīsamācāro, kathaṃ tasmiṃ puggale āghāto paṭivinetabbo? Seyyathāpi, āvuso, bhikkhu paṃsukūliko rathiyāya nantakaṃ disvā vāmena pādena niggaṇhitvā dakkhiṇena pādena pattharitvā [vitthāretvā (sī. pī.)], yo tattha sāro taṃ paripātetvā ādāya pakkameyya; evamevaṃ khvāvuso, yvāyaṃ puggalo aparisuddhakāyasamācāro parisuddhavacīsamācāro, yāssa aparisuddhakāyasamācāratā na sāssa tasmiṃ samaye manasi kātabbā, yā ca khvāssa parisuddhavacīsamācāratā sāssa tasmiṃ samaye manasi kātabbā. Evaṃ tasmiṃ puggale āghāto paṭivinetabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tatrāvuso, yvāyaṃ puggalo aparisuddhavacīsamācāro parisuddhakāyasamācāro, kathaṃ tasmiṃ puggale āghāto paṭivinetabbo? Seyyathāpi, āvuso, pokkharaṇī sevālapaṇakapariyonaddhā. Atha puriso āgaccheyya ghammābhitatto ghammapareto kilanto tasito pipāsito. So taṃ pokkharaṇiṃ ogāhetvā ubhohi hatthehi iticiti ca sevālapaṇakaṃ apaviyūhitvā añjalinā pivitvā pakkameyya. Evamevaṃ kho, āvuso ",
      ", yvāyaṃ puggalo aparisuddhavacīsamācāro parisuddhakāyasamācāro, yāssa aparisuddhavacīsamācāratā na sāssa tasmiṃ samaye manasi kātabbā, yā ca khvāssa parisuddhakāyasamācāratā sāssa tasmiṃ samaye manasi kātabbā. Evaṃ tasmiṃ puggale āghāto paṭivinetabbo."
    ],
    "innerText": "‘‘Tatrāvuso, yvāyaṃ puggalo aparisuddhavacīsamācāro parisuddhakāyasamācāro, kathaṃ tasmiṃ puggale āghāto paṭivinetabbo? Seyyathāpi, āvuso, pokkharaṇī sevālapaṇakapariyonaddhā. Atha puriso āgaccheyya ghammābhitatto ghammapareto kilanto tasito pipāsito. So taṃ pokkharaṇiṃ ogāhetvā ubhohi hatthehi iticiti ca sevālapaṇakaṃ apaviyūhitvā añjalinā pivitvā pakkameyya. Evamevaṃ kho, āvuso , yvāyaṃ puggalo aparisuddhavacīsamācāro parisuddhakāyasamācāro, yāssa aparisuddhavacīsamācāratā na sāssa tasmiṃ samaye manasi kātabbā, yā ca khvāssa parisuddhakāyasamācāratā sāssa tasmiṃ samaye manasi kātabbā. Evaṃ tasmiṃ puggale āghāto paṭivinetabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tatrāvuso, yvāyaṃ puggalo aparisuddhakāyasamācāro aparisuddhavacīsamācāro labhati ca ",
      " kālena kālaṃ cetaso vivaraṃ cetaso pasādaṃ, kathaṃ tasmiṃ puggale āghāto paṭivinetabbo? Seyyathāpi, āvuso, parittaṃ gopade ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[gopadake (sī. syā.)]"
      },
      " udakaṃ. Atha puriso āgaccheyya ghammābhitatto ghammapareto kilanto tasito pipāsito. Tassa evamassa – ‘idaṃ kho parittaṃ gopade udakaṃ. Sacāhaṃ añjalinā vā pivissāmi bhājanena vā khobhessāmipi taṃ ",
      " loḷessāmipi taṃ apeyyampi taṃ karissāmi. Yaṃnūnāhaṃ catukkuṇḍiko ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[catuguṇḍiko (sī.), catukuṇḍiko (syā. kaṃ. pī.), catukoṇḍiko (dī. ni. 3.7)]"
      },
      " nipatitvā gopītakaṃ pivitvā pakkameyya’nti. So catukkuṇḍiko nipatitvā gopītakaṃ pivitvā pakkameyya. Evamevaṃ kho, āvuso, yvāyaṃ puggalo aparisuddhakāyasamācāro aparisuddhavacīsamācāro labhati ca kālena kālaṃ cetaso vivaraṃ cetaso pasādaṃ, yāssa aparisuddhakāyasamācāratā na sāssa tasmiṃ samaye manasi kātabbā; yāpissa aparisuddhavacīsamācāratā na sāpissa tasmiṃ samaye manasi kātabbā. Yañca kho so labhati kālena kālaṃ cetaso vivaraṃ ",
      " cetaso pasādaṃ, tamevassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[tadevassa (sī. syā.)]"
      },
      " tasmiṃ samaye manasi kātabbaṃ. Evaṃ tasmiṃ puggale āghāto paṭivinetabbo."
    ],
    "innerText": "‘‘Tatrāvuso, yvāyaṃ puggalo aparisuddhakāyasamācāro aparisuddhavacīsamācāro labhati ca kālena kālaṃ cetaso vivaraṃ cetaso pasādaṃ, kathaṃ tasmiṃ puggale āghāto paṭivinetabbo? Seyyathāpi, āvuso, parittaṃ gopade [gopadake (sī. syā.)] udakaṃ. Atha puriso āgaccheyya ghammābhitatto ghammapareto kilanto tasito pipāsito. Tassa evamassa – ‘idaṃ kho parittaṃ gopade udakaṃ. Sacāhaṃ añjalinā vā pivissāmi bhājanena vā khobhessāmipi taṃ loḷessāmipi taṃ apeyyampi taṃ karissāmi. Yaṃnūnāhaṃ catukkuṇḍiko [catuguṇḍiko (sī.), catukuṇḍiko (syā. kaṃ. pī.), catukoṇḍiko (dī. ni. 3.7)] nipatitvā gopītakaṃ pivitvā pakkameyya’nti. So catukkuṇḍiko nipatitvā gopītakaṃ pivitvā pakkameyya. Evamevaṃ kho, āvuso, yvāyaṃ puggalo aparisuddhakāyasamācāro aparisuddhavacīsamācāro labhati ca kālena kālaṃ cetaso vivaraṃ cetaso pasādaṃ, yāssa aparisuddhakāyasamācāratā na sāssa tasmiṃ samaye manasi kātabbā; yāpissa aparisuddhavacīsamācāratā na sāpissa tasmiṃ samaye manasi kātabbā. Yañca kho so labhati kālena kālaṃ cetaso vivaraṃ cetaso pasādaṃ, tamevassa [tadevassa (sī. syā.)] tasmiṃ samaye manasi kātabbaṃ. Evaṃ tasmiṃ puggale āghāto paṭivinetabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tatrāvuso ",
      ", yvāyaṃ puggalo aparisuddhakāyasamācāro aparisuddhavacīsamācāro na ca labhati kālena kālaṃ cetaso vivaraṃ cetaso pasādaṃ, kathaṃ tasmiṃ puggale āghāto paṭivinetabbo? Seyyathāpi, āvuso, puriso ābādhiko dukkhito bāḷhagilāno addhānamaggappaṭipanno. Tassa puratopissa dūre gāmo pacchatopissa dūre gāmo. So na labheyya sappāyāni bhojanāni, na labheyya sappāyāni bhesajjāni, na labheyya patirūpaṃ upaṭṭhākaṃ, na labheyya gāmantanāyakaṃ. Tamenaṃ aññataro puriso passeyya addhānamaggappaṭipanno. So tasmiṃ purise kāruññaṃyeva upaṭṭhāpeyya, anuddayaṃyeva upaṭṭhāpeyya, anukampaṃyeva upaṭṭhāpeyya – ‘aho vatāyaṃ puriso labheyya sappāyāni bhojanāni, labheyya sappāyāni bhesajjāni, labheyya patirūpaṃ upaṭṭhākaṃ, labheyya gāmantanāyakaṃ! Taṃ kissa hetu? Māyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ayaṃ (ka.)]"
      },
      " puriso idheva anayabyasanaṃ āpajjī’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[āpajjeyya (ka.)]"
      },
      "! Evamevaṃ kho, āvuso, yvāyaṃ puggalo aparisuddhakāyasamācāro aparisuddhavacīsamācāro na ca labhati kālena kālaṃ cetaso vivaraṃ cetaso pasādaṃ, evarūpepi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[evarūpe (pī.)]"
      },
      ", āvuso, puggale kāruññaṃyeva upaṭṭhāpetabbaṃ anuddayāyeva upaṭṭhāpetabbā anukampāyeva upaṭṭhāpetabbā – ‘aho vata ayamāyasmā kāyaduccaritaṃ pahāya kāyasucaritaṃ bhāveyya, vacīduccaritaṃ pahāya vacīsucaritaṃ bhāveyya, manoduccaritaṃ pahāya manosucaritaṃ bhāveyya ",
      "! Taṃ kissa hetu? Māyaṃ āyasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ayamāyasmā (ka.)]"
      },
      " kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjī’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[upapajjatīti (ka.)]"
      },
      "! Evaṃ tasmiṃ puggale āghāto paṭivinetabbo."
    ],
    "innerText": "‘‘Tatrāvuso , yvāyaṃ puggalo aparisuddhakāyasamācāro aparisuddhavacīsamācāro na ca labhati kālena kālaṃ cetaso vivaraṃ cetaso pasādaṃ, kathaṃ tasmiṃ puggale āghāto paṭivinetabbo? Seyyathāpi, āvuso, puriso ābādhiko dukkhito bāḷhagilāno addhānamaggappaṭipanno. Tassa puratopissa dūre gāmo pacchatopissa dūre gāmo. So na labheyya sappāyāni bhojanāni, na labheyya sappāyāni bhesajjāni, na labheyya patirūpaṃ upaṭṭhākaṃ, na labheyya gāmantanāyakaṃ. Tamenaṃ aññataro puriso passeyya addhānamaggappaṭipanno. So tasmiṃ purise kāruññaṃyeva upaṭṭhāpeyya, anuddayaṃyeva upaṭṭhāpeyya, anukampaṃyeva upaṭṭhāpeyya – ‘aho vatāyaṃ puriso labheyya sappāyāni bhojanāni, labheyya sappāyāni bhesajjāni, labheyya patirūpaṃ upaṭṭhākaṃ, labheyya gāmantanāyakaṃ! Taṃ kissa hetu? Māyaṃ [ayaṃ (ka.)] puriso idheva anayabyasanaṃ āpajjī’ti [āpajjeyya (ka.)]! Evamevaṃ kho, āvuso, yvāyaṃ puggalo aparisuddhakāyasamācāro aparisuddhavacīsamācāro na ca labhati kālena kālaṃ cetaso vivaraṃ cetaso pasādaṃ, evarūpepi [evarūpe (pī.)], āvuso, puggale kāruññaṃyeva upaṭṭhāpetabbaṃ anuddayāyeva upaṭṭhāpetabbā anukampāyeva upaṭṭhāpetabbā – ‘aho vata ayamāyasmā kāyaduccaritaṃ pahāya kāyasucaritaṃ bhāveyya, vacīduccaritaṃ pahāya vacīsucaritaṃ bhāveyya, manoduccaritaṃ pahāya manosucaritaṃ bhāveyya ! Taṃ kissa hetu? Māyaṃ āyasmā [ayamāyasmā (ka.)] kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjī’ti [upapajjatīti (ka.)]! Evaṃ tasmiṃ puggale āghāto paṭivinetabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tatrāvuso ",
      ", yvāyaṃ puggalo parisuddhakāyasamācāro parisuddhavacīsamācāro labhati ca kālena kālaṃ cetaso vivaraṃ cetaso pasādaṃ, kathaṃ tasmiṃ puggale āghāto paṭivinetabbo? Seyyathāpi, āvuso, pokkharaṇī acchodakā sātodakā sītodakā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[acchodikā sātodikā sītodikā (sī.)]"
      },
      " setakā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[setodakā (ka.)]"
      },
      " supatitthā ramaṇīyā nānārukkhehi sañchannā. Atha puriso āgaccheyya ghammābhitatto ghammapareto kilanto tasito pipāsito ",
      ". So taṃ pokkharaṇiṃ ogāhetvā nhātvā ca pivitvā ca paccuttaritvā tattheva rukkhacchāyāya nisīdeyya vā nipajjeyya vā."
    ],
    "innerText": "‘‘Tatrāvuso , yvāyaṃ puggalo parisuddhakāyasamācāro parisuddhavacīsamācāro labhati ca kālena kālaṃ cetaso vivaraṃ cetaso pasādaṃ, kathaṃ tasmiṃ puggale āghāto paṭivinetabbo? Seyyathāpi, āvuso, pokkharaṇī acchodakā sātodakā sītodakā [acchodikā sātodikā sītodikā (sī.)] setakā [setodakā (ka.)] supatitthā ramaṇīyā nānārukkhehi sañchannā. Atha puriso āgaccheyya ghammābhitatto ghammapareto kilanto tasito pipāsito . So taṃ pokkharaṇiṃ ogāhetvā nhātvā ca pivitvā ca paccuttaritvā tattheva rukkhacchāyāya nisīdeyya vā nipajjeyya vā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evamevaṃ kho, āvuso, yvāyaṃ puggalo parisuddhakāyasamācāro parisuddhavacīsamācāro labhati ca kālena kālaṃ cetaso vivaraṃ cetaso pasādaṃ, yāpissa ",
      " parisuddhakāyasamācāratā sāpissa tasmiṃ samaye manasi kātabbā; yāpissa parisuddhavacīsamācāratā sāpissa tasmiṃ samaye manasi kātabbā; yampi labhati kālena kālaṃ cetaso vivaraṃ cetaso pasādaṃ, tampissa tasmiṃ samaye manasi kātabbaṃ. Evaṃ tasmiṃ puggale āghāto paṭivinetabbo. Samantapāsādikaṃ, āvuso, puggalaṃ āgamma cittaṃ pasīdati."
    ],
    "innerText": "Evamevaṃ kho, āvuso, yvāyaṃ puggalo parisuddhakāyasamācāro parisuddhavacīsamācāro labhati ca kālena kālaṃ cetaso vivaraṃ cetaso pasādaṃ, yāpissa parisuddhakāyasamācāratā sāpissa tasmiṃ samaye manasi kātabbā; yāpissa parisuddhavacīsamācāratā sāpissa tasmiṃ samaye manasi kātabbā; yampi labhati kālena kālaṃ cetaso vivaraṃ cetaso pasādaṃ, tampissa tasmiṃ samaye manasi kātabbaṃ. Evaṃ tasmiṃ puggale āghāto paṭivinetabbo. Samantapāsādikaṃ, āvuso, puggalaṃ āgamma cittaṃ pasīdati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ime kho, āvuso, pañca āghātapaṭivinayā, yattha bhikkhuno uppanno āghāto sabbaso paṭivinetabbo’’ti. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Sākacchasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "163"
      },
      ". Tatra kho āyasmā sāriputto bhikkhū āmantesi – ‘‘āvuso bhikkhave’’ti. ‘‘Āvuso’’ti kho te bhikkhū āyasmato sāriputtassa paccassosuṃ. Āyasmā sāriputto etadavoca –"
    ],
    "innerText": "163. Tatra kho āyasmā sāriputto bhikkhū āmantesi – ‘‘āvuso bhikkhave’’ti. ‘‘Āvuso’’ti kho te bhikkhū āyasmato sāriputtassa paccassosuṃ. Āyasmā sāriputto etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[a. ni. 5.65-66]"
      },
      " ‘‘Pañcahāvuso ",
      ", dhammehi samannāgato bhikkhu alaṃ sākaccho sabrahmacārīnaṃ. Katamehi pañcahi? Idhāvuso, bhikkhu attanā ca sīlasampanno hoti, sīlasampadākathāya ca āgataṃ pañhaṃ ",
      " byākattā hoti; attanā ca samādhisampanno hoti, samādhisampadākathāya ca āgataṃ pañhaṃ byākattā hoti; attanā ca paññāsampanno hoti, paññāsampadākathāya ca āgataṃ pañhaṃ byākattā hoti; attanā ca vimuttisampanno hoti, vimuttisampadākathāya ca āgataṃ pañhaṃ byākattā hoti; attanā ca vimuttiñāṇadassanasampanno hoti, vimuttiñāṇadassanasampadākathāya ca āgataṃ pañhaṃ byākattā hoti. Imehi kho, āvuso, pañcahi dhammehi samannāgato bhikkhu alaṃ sākaccho sabrahmacārīna’’nti. Tatiyaṃ."
    ],
    "innerText": "[a. ni. 5.65-66] ‘‘Pañcahāvuso , dhammehi samannāgato bhikkhu alaṃ sākaccho sabrahmacārīnaṃ. Katamehi pañcahi? Idhāvuso, bhikkhu attanā ca sīlasampanno hoti, sīlasampadākathāya ca āgataṃ pañhaṃ byākattā hoti; attanā ca samādhisampanno hoti, samādhisampadākathāya ca āgataṃ pañhaṃ byākattā hoti; attanā ca paññāsampanno hoti, paññāsampadākathāya ca āgataṃ pañhaṃ byākattā hoti; attanā ca vimuttisampanno hoti, vimuttisampadākathāya ca āgataṃ pañhaṃ byākattā hoti; attanā ca vimuttiñāṇadassanasampanno hoti, vimuttiñāṇadassanasampadākathāya ca āgataṃ pañhaṃ byākattā hoti. Imehi kho, āvuso, pañcahi dhammehi samannāgato bhikkhu alaṃ sākaccho sabrahmacārīna’’nti. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Sājīvasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "164"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[a. ni. 5.65]"
      },
      " Tatra ",
      " kho āyasmā sāriputto bhikkhū āmantesi…pe… ‘‘pañcahi, āvuso, dhammehi samannāgato bhikkhu alaṃsājīvo sabrahmacārīnaṃ. Katamehi pañcahi? Idhāvuso, bhikkhu attanā ca sīlasampanno hoti ",
      ", sīlasampadākathāya ca āgataṃ pañhaṃ byākattā hoti; attanā ca samādhisampanno hoti, samādhisampadākathāya ca āgataṃ pañhaṃ byākattā hoti; attanā ca paññāsampanno hoti, paññāsampadākathāya ca āgataṃ pañhaṃ byākattā hoti; attanā ca vimuttisampanno hoti, vimuttisampadākathāya ca āgataṃ pañhaṃ byākattā hoti; attanā ca vimuttiñāṇadassanasampanno hoti, vimuttiñāṇadassanasampadākathāya ca āgataṃ pañhaṃ byākattā hoti. Imehi kho, āvuso, pañcahi dhammehi samannāgato bhikkhu alaṃsājīvo sabrahmacārīna’’nti. Catutthaṃ."
    ],
    "innerText": "164.[a. ni. 5.65] Tatra kho āyasmā sāriputto bhikkhū āmantesi…pe… ‘‘pañcahi, āvuso, dhammehi samannāgato bhikkhu alaṃsājīvo sabrahmacārīnaṃ. Katamehi pañcahi? Idhāvuso, bhikkhu attanā ca sīlasampanno hoti , sīlasampadākathāya ca āgataṃ pañhaṃ byākattā hoti; attanā ca samādhisampanno hoti, samādhisampadākathāya ca āgataṃ pañhaṃ byākattā hoti; attanā ca paññāsampanno hoti, paññāsampadākathāya ca āgataṃ pañhaṃ byākattā hoti; attanā ca vimuttisampanno hoti, vimuttisampadākathāya ca āgataṃ pañhaṃ byākattā hoti; attanā ca vimuttiñāṇadassanasampanno hoti, vimuttiñāṇadassanasampadākathāya ca āgataṃ pañhaṃ byākattā hoti. Imehi kho, āvuso, pañcahi dhammehi samannāgato bhikkhu alaṃsājīvo sabrahmacārīna’’nti. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Pañhapucchāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "165"
      },
      ". Tatra kho āyasmā sāriputto bhikkhū āmantesi…pe… ‘‘yo hi koci, āvuso, paraṃ pañhaṃ pucchati, sabbo so pañcahi ṭhānehi, etesaṃ vā aññatarena. Katamehi pañcahi? Mandattā momūhattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[momuhattā (sī.)]"
      },
      " paraṃ pañhaṃ pucchati, pāpiccho icchāpakato paraṃ pañhaṃ pucchati, paribhavaṃ paraṃ ",
      " pañhaṃ pucchati, aññātukāmo paraṃ pañhaṃ pucchati, atha vā panevaṃcitto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[atha vā pakuppanto (sī. pī.)]"
      },
      " paraṃ pañhaṃ pucchati – ‘sace me pañhaṃ puṭṭho sammadeva byākarissati iccetaṃ kusalaṃ, no ce ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[no ca (syā.)]"
      },
      " me pañhaṃ puṭṭho sammadeva byākarissati ahamassa sammadeva byākarissāmī’ti. Yo hi koci, āvuso, paraṃ pañhaṃ pucchati, sabbo so imehi pañcahi ",
      " ṭhānehi, etesaṃ vā aññatarena. Ahaṃ kho panāvuso, evaṃcitto paraṃ pañhaṃ pucchāmi – ‘sace me pañhaṃ puṭṭho sammadeva byākarissati ",
      " iccetaṃ kusalaṃ, no ce me pañhaṃ puṭṭho sammadeva byākarissati, ahamassa sammadeva byākarissāmī’’ti. Pañcamaṃ."
    ],
    "innerText": "165. Tatra kho āyasmā sāriputto bhikkhū āmantesi…pe… ‘‘yo hi koci, āvuso, paraṃ pañhaṃ pucchati, sabbo so pañcahi ṭhānehi, etesaṃ vā aññatarena. Katamehi pañcahi? Mandattā momūhattā [momuhattā (sī.)] paraṃ pañhaṃ pucchati, pāpiccho icchāpakato paraṃ pañhaṃ pucchati, paribhavaṃ paraṃ pañhaṃ pucchati, aññātukāmo paraṃ pañhaṃ pucchati, atha vā panevaṃcitto [atha vā pakuppanto (sī. pī.)] paraṃ pañhaṃ pucchati – ‘sace me pañhaṃ puṭṭho sammadeva byākarissati iccetaṃ kusalaṃ, no ce [no ca (syā.)] me pañhaṃ puṭṭho sammadeva byākarissati ahamassa sammadeva byākarissāmī’ti. Yo hi koci, āvuso, paraṃ pañhaṃ pucchati, sabbo so imehi pañcahi ṭhānehi, etesaṃ vā aññatarena. Ahaṃ kho panāvuso, evaṃcitto paraṃ pañhaṃ pucchāmi – ‘sace me pañhaṃ puṭṭho sammadeva byākarissati iccetaṃ kusalaṃ, no ce me pañhaṃ puṭṭho sammadeva byākarissati, ahamassa sammadeva byākarissāmī’’ti. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Nirodhasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "166"
      },
      ". Tatra kho āyasmā sāriputto bhikkhū āmantesi…pe… ‘‘idhāvuso, bhikkhu sīlasampanno samādhisampanno paññāsampanno saññāvedayitanirodhaṃ ",
      " samāpajjeyyāpi vuṭṭhaheyyāpi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[samāpajjeyyapi vuṭṭhaheyyapi (sī. syā. kaṃ. pī.)]"
      },
      " – atthetaṃ ṭhānaṃ. No ce diṭṭheva dhamme aññaṃ ārādheyya, atikkammeva kabaḷīkārāhārabhakkhānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kabaḷiṃkārāhārabhakkhānaṃ (sī. syā. kaṃ. pī.)]"
      },
      " devānaṃ sahabyataṃ aññataraṃ manomayaṃ kāyaṃ upapanno saññāvedayitanirodhaṃ samāpajjeyyāpi vuṭṭhaheyyāpi – atthetaṃ ṭhāna’’nti."
    ],
    "innerText": "166. Tatra kho āyasmā sāriputto bhikkhū āmantesi…pe… ‘‘idhāvuso, bhikkhu sīlasampanno samādhisampanno paññāsampanno saññāvedayitanirodhaṃ samāpajjeyyāpi vuṭṭhaheyyāpi [samāpajjeyyapi vuṭṭhaheyyapi (sī. syā. kaṃ. pī.)] – atthetaṃ ṭhānaṃ. No ce diṭṭheva dhamme aññaṃ ārādheyya, atikkammeva kabaḷīkārāhārabhakkhānaṃ [kabaḷiṃkārāhārabhakkhānaṃ (sī. syā. kaṃ. pī.)] devānaṃ sahabyataṃ aññataraṃ manomayaṃ kāyaṃ upapanno saññāvedayitanirodhaṃ samāpajjeyyāpi vuṭṭhaheyyāpi – atthetaṃ ṭhāna’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ vutte āyasmā udāyī āyasmantaṃ sāriputtaṃ etadavoca – ‘‘aṭṭhānaṃ kho etaṃ, āvuso sāriputta, anavakāso yaṃ so bhikkhu atikkammeva kabaḷīkārāhārabhakkhānaṃ devānaṃ sahabyataṃ aññataraṃ manomayaṃ kāyaṃ upapanno saññāvedayitanirodhaṃ samāpajjeyyāpi vuṭṭhaheyyāpi – natthetaṃ ṭhāna’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dutiyampi kho…pe… tatiyampi kho āyasmā ",
      " sāriputto bhikkhū āmantesi – ‘‘idhāvuso, bhikkhu sīlasampanno samādhisampanno paññāsampanno saññāvedayitanirodhaṃ samāpajjeyyāpi vuṭṭhaheyyāpi – atthetaṃ ṭhānaṃ. No ce diṭṭheva dhamme aññaṃ ārādheyya, atikkammeva kabaḷīkārāhārabhakkhānaṃ devānaṃ sahabyataṃ aññataraṃ manomayaṃ kāyaṃ upapanno saññāvedayitanirodhaṃ samāpajjeyyāpi vuṭṭhaheyyāpi – atthetaṃ ṭhāna’’nti."
    ],
    "innerText": "Dutiyampi kho…pe… tatiyampi kho āyasmā sāriputto bhikkhū āmantesi – ‘‘idhāvuso, bhikkhu sīlasampanno samādhisampanno paññāsampanno saññāvedayitanirodhaṃ samāpajjeyyāpi vuṭṭhaheyyāpi – atthetaṃ ṭhānaṃ. No ce diṭṭheva dhamme aññaṃ ārādheyya, atikkammeva kabaḷīkārāhārabhakkhānaṃ devānaṃ sahabyataṃ aññataraṃ manomayaṃ kāyaṃ upapanno saññāvedayitanirodhaṃ samāpajjeyyāpi vuṭṭhaheyyāpi – atthetaṃ ṭhāna’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatiyampi kho āyasmā udāyī āyasmantaṃ sāriputtaṃ etadavoca – ‘‘aṭṭhānaṃ kho etaṃ, āvuso sāriputta ",
      ", anavakāso yaṃ so bhikkhu atikkammeva kabaḷīkārāhārabhakkhānaṃ devānaṃ sahabyataṃ aññataraṃ manomayaṃ kāyaṃ upapanno saññāvedayitanirodhaṃ samāpajjeyyāpi vuṭṭhaheyyāpi – natthetaṃ ṭhāna’’nti."
    ],
    "innerText": "Tatiyampi kho āyasmā udāyī āyasmantaṃ sāriputtaṃ etadavoca – ‘‘aṭṭhānaṃ kho etaṃ, āvuso sāriputta , anavakāso yaṃ so bhikkhu atikkammeva kabaḷīkārāhārabhakkhānaṃ devānaṃ sahabyataṃ aññataraṃ manomayaṃ kāyaṃ upapanno saññāvedayitanirodhaṃ samāpajjeyyāpi vuṭṭhaheyyāpi – natthetaṃ ṭhāna’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " kho āyasmato sāriputtassa etadahosi – ‘‘yāvatatiyakampi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yāvatatiyampi (sī. syā. pī.)]"
      },
      " kho me āyasmā udāyī paṭikkosati, na ca me koci bhikkhu anumodati. Yaṃnūnāhaṃ yena bhagavā tenupasaṅkameyya’’nti. Atha kho āyasmā sāriputto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā sāriputto bhikkhū āmantesi – ‘‘idhāvuso, bhikkhu sīlasampanno samādhisampanno paññāsampanno saññāvedayitanirodhaṃ samāpajjeyyāpi vuṭṭhaheyyāpi – atthetaṃ ṭhānaṃ. No ce diṭṭheva dhamme aññaṃ ",
      " ārādheyya, atikkammeva kabaḷīkārāhārabhakkhānaṃ devānaṃ sahabyataṃ aññataraṃ manomayaṃ kāyaṃ upapanno saññāvedayitanirodhaṃ samāpajjeyyāpi vuṭṭhaheyyāpi – atthetaṃ ṭhāna’’nti."
    ],
    "innerText": "Atha kho āyasmato sāriputtassa etadahosi – ‘‘yāvatatiyakampi [yāvatatiyampi (sī. syā. pī.)] kho me āyasmā udāyī paṭikkosati, na ca me koci bhikkhu anumodati. Yaṃnūnāhaṃ yena bhagavā tenupasaṅkameyya’’nti. Atha kho āyasmā sāriputto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā sāriputto bhikkhū āmantesi – ‘‘idhāvuso, bhikkhu sīlasampanno samādhisampanno paññāsampanno saññāvedayitanirodhaṃ samāpajjeyyāpi vuṭṭhaheyyāpi – atthetaṃ ṭhānaṃ. No ce diṭṭheva dhamme aññaṃ ārādheyya, atikkammeva kabaḷīkārāhārabhakkhānaṃ devānaṃ sahabyataṃ aññataraṃ manomayaṃ kāyaṃ upapanno saññāvedayitanirodhaṃ samāpajjeyyāpi vuṭṭhaheyyāpi – atthetaṃ ṭhāna’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ vutte āyasmā udāyī āyasmantaṃ sāriputtaṃ etadavoca – ‘‘aṭṭhānaṃ kho etaṃ, āvuso sāriputta, anavakāso yaṃ so bhikkhu atikkammeva kabaḷīkārāhārabhakkhānaṃ devānaṃ sahabyataṃ aññataraṃ manomayaṃ kāyaṃ upapanno saññāvedayitanirodhaṃ samāpajjeyyāpi vuṭṭhaheyyāpi – natthetaṃ ṭhāna’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dutiyampi kho…pe… tatiyampi kho āyasmā sāriputto bhikkhū āmantesi – ‘‘idhāvuso, bhikkhu sīlasampanno samādhisampanno paññāsampanno saññāvedayitanirodhaṃ ",
      " samāpajjeyyāpi vuṭṭhaheyyāpi – atthetaṃ ṭhānaṃ ",
      ". No ce diṭṭheva dhamme aññaṃ ārādheyya, atikkammeva kabaḷīkārāhārabhakkhānaṃ devānaṃ sahabyataṃ aññataraṃ manomayaṃ kāyaṃ upapanno saññāvedayitanirodhaṃ samāpajjeyyāpi vuṭṭhaheyyāpi – atthetaṃ ṭhāna’’nti."
    ],
    "innerText": "Dutiyampi kho…pe… tatiyampi kho āyasmā sāriputto bhikkhū āmantesi – ‘‘idhāvuso, bhikkhu sīlasampanno samādhisampanno paññāsampanno saññāvedayitanirodhaṃ samāpajjeyyāpi vuṭṭhaheyyāpi – atthetaṃ ṭhānaṃ . No ce diṭṭheva dhamme aññaṃ ārādheyya, atikkammeva kabaḷīkārāhārabhakkhānaṃ devānaṃ sahabyataṃ aññataraṃ manomayaṃ kāyaṃ upapanno saññāvedayitanirodhaṃ samāpajjeyyāpi vuṭṭhaheyyāpi – atthetaṃ ṭhāna’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tatiyampi kho āyasmā udāyī āyasmantaṃ sāriputtaṃ etadavoca – ‘‘aṭṭhānaṃ kho etaṃ, āvuso sāriputta, anavakāso yaṃ so bhikkhu atikkammeva kabaḷīkārāhārabhakkhānaṃ devānaṃ sahabyataṃ aññataraṃ manomayaṃ kāyaṃ upapanno saññāvedayitanirodhaṃ samāpajjeyyāpi vuṭṭhaheyyāpi – natthetaṃ ṭhāna’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha kho āyasmato sāriputtassa etadahosi – ‘‘bhagavatopi kho me sammukhā āyasmā udāyī yāvatatiyakaṃ paṭikkosati, na ca me koci bhikkhu anumodati. Yaṃnūnāhaṃ tuṇhī assa’’nti. Atha kho āyasmā sāriputto tuṇhī ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " kho bhagavā āyasmantaṃ udāyiṃ āmantesi – ‘‘kaṃ pana tvaṃ, udāyi, manomayaṃ kāyaṃ paccesī’’ti? ‘‘Ye te, bhante, devā arūpino saññāmayā’’ti. ‘‘Kiṃ nu kho tuyhaṃ, udāyi, bālassa abyattassa bhaṇitena! Tvampi nāma bhaṇitabbaṃ maññasī’’ti! Atha kho bhagavā āyasmantaṃ ānandaṃ āmantesi – ‘‘atthi nāma, ānanda, theraṃ bhikkhuṃ vihesiyamānaṃ ajjhupekkhissatha ",
      ". Na hi nāma, ānanda, kāruññampi bhavissati theramhi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[byattamhi (syā. kaṃ. ka.)]"
      },
      " bhikkhumhi vihesiyamānamhī’’ti."
    ],
    "innerText": "Atha kho bhagavā āyasmantaṃ udāyiṃ āmantesi – ‘‘kaṃ pana tvaṃ, udāyi, manomayaṃ kāyaṃ paccesī’’ti? ‘‘Ye te, bhante, devā arūpino saññāmayā’’ti. ‘‘Kiṃ nu kho tuyhaṃ, udāyi, bālassa abyattassa bhaṇitena! Tvampi nāma bhaṇitabbaṃ maññasī’’ti! Atha kho bhagavā āyasmantaṃ ānandaṃ āmantesi – ‘‘atthi nāma, ānanda, theraṃ bhikkhuṃ vihesiyamānaṃ ajjhupekkhissatha . Na hi nāma, ānanda, kāruññampi bhavissati theramhi [byattamhi (syā. kaṃ. ka.)] bhikkhumhi vihesiyamānamhī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho bhagavā bhikkhū āmantesi – ‘‘idha, bhikkhave, bhikkhu sīlasampanno samādhisampanno paññāsampanno saññāvedayitanirodhaṃ samāpajjeyyāpi vuṭṭhaheyyāpi – atthetaṃ ṭhānaṃ. No ce diṭṭheva dhamme aññaṃ ārādheyya ",
      ", atikkammeva kabaḷīkārāhārabhakkhānaṃ devānaṃ sahabyataṃ aññataraṃ manomayaṃ kāyaṃ upapanno saññāvedayitanirodhaṃ samāpajjeyyāpi vuṭṭhaheyyāpi – atthetaṃ ṭhāna’’nti. Idamavoca bhagavā. Idaṃ vatvāna sugato uṭṭhāyāsanā vihāraṃ pāvisi."
    ],
    "innerText": "Atha kho bhagavā bhikkhū āmantesi – ‘‘idha, bhikkhave, bhikkhu sīlasampanno samādhisampanno paññāsampanno saññāvedayitanirodhaṃ samāpajjeyyāpi vuṭṭhaheyyāpi – atthetaṃ ṭhānaṃ. No ce diṭṭheva dhamme aññaṃ ārādheyya , atikkammeva kabaḷīkārāhārabhakkhānaṃ devānaṃ sahabyataṃ aññataraṃ manomayaṃ kāyaṃ upapanno saññāvedayitanirodhaṃ samāpajjeyyāpi vuṭṭhaheyyāpi – atthetaṃ ṭhāna’’nti. Idamavoca bhagavā. Idaṃ vatvāna sugato uṭṭhāyāsanā vihāraṃ pāvisi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " kho āyasmā ānando acirapakkantassa bhagavato yenāyasmā upavāṇo tenupasaṅkami; upasaṅkamitvā āyasmantaṃ upavāṇaṃ etadavoca – ‘‘idhāvuso upavāṇa, aññe there bhikkhū vihesenti. Mayaṃ tena na muccāma. Anacchariyaṃ kho, panetaṃ āvuso upavāṇa, yaṃ bhagavā sāyanhasamayaṃ paṭisallānā vuṭṭhito etadeva ārabbha udāhareyya yathā āyasmantaṃyevettha upavāṇaṃ paṭibhāseyya. Idāneva amhākaṃ sārajjaṃ okkanta’’nti. Atha kho bhagavā sāyanhasamayaṃ paṭisallānā vuṭṭhito yena upaṭṭhānasālā tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Nisajja kho bhagavā āyasmantaṃ upavāṇaṃ etadavoca –"
    ],
    "innerText": "Atha kho āyasmā ānando acirapakkantassa bhagavato yenāyasmā upavāṇo tenupasaṅkami; upasaṅkamitvā āyasmantaṃ upavāṇaṃ etadavoca – ‘‘idhāvuso upavāṇa, aññe there bhikkhū vihesenti. Mayaṃ tena na muccāma. Anacchariyaṃ kho, panetaṃ āvuso upavāṇa, yaṃ bhagavā sāyanhasamayaṃ paṭisallānā vuṭṭhito etadeva ārabbha udāhareyya yathā āyasmantaṃyevettha upavāṇaṃ paṭibhāseyya. Idāneva amhākaṃ sārajjaṃ okkanta’’nti. Atha kho bhagavā sāyanhasamayaṃ paṭisallānā vuṭṭhito yena upaṭṭhānasālā tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Nisajja kho bhagavā āyasmantaṃ upavāṇaṃ etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katīhi nu kho, upavāṇa, dhammehi samannāgato thero bhikkhu sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo cā’’ti? ‘‘Pañcahi, bhante, dhammehi samannāgato thero bhikkhu sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo ca. Katamehi pañcahi? Idha, bhante, thero bhikkhu sīlavā hoti…pe… samādāya sikkhati sikkhāpadesu; bahussuto hoti…pe… diṭṭhiyā suppaṭividdhā; kalyāṇavāco hoti kalyāṇavākkaraṇo poriyā vācāya samannāgato vissaṭṭhāya ",
      " anelagalāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[anelagaḷāya (syā. kaṃ.)]"
      },
      " atthassa viññāpaniyā; catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī; āsavānaṃ ",
      " khayā…pe… sacchikatvā upasampajja viharati. Imehi kho, bhante, pañcahi dhammehi samannāgato thero bhikkhu ",
      " sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo cā’’ti."
    ],
    "innerText": "‘‘Katīhi nu kho, upavāṇa, dhammehi samannāgato thero bhikkhu sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo cā’’ti? ‘‘Pañcahi, bhante, dhammehi samannāgato thero bhikkhu sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo ca. Katamehi pañcahi? Idha, bhante, thero bhikkhu sīlavā hoti…pe… samādāya sikkhati sikkhāpadesu; bahussuto hoti…pe… diṭṭhiyā suppaṭividdhā; kalyāṇavāco hoti kalyāṇavākkaraṇo poriyā vācāya samannāgato vissaṭṭhāya anelagalāya [anelagaḷāya (syā. kaṃ.)] atthassa viññāpaniyā; catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī; āsavānaṃ khayā…pe… sacchikatvā upasampajja viharati. Imehi kho, bhante, pañcahi dhammehi samannāgato thero bhikkhu sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo cā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sādhu ",
      " sādhu, upavāṇa! Imehi kho, upavāṇa, pañcahi dhammehi samannāgato thero bhikkhu sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo ca. Ime ce, upavāṇa, pañca dhammā therassa bhikkhuno na saṃvijjeyyuṃ, taṃ sabrahmacārī na sakkareyyuṃ na garuṃ kareyyuṃ na māneyyuṃ na pūjeyyuṃ khaṇḍiccena pāliccena valittacatāya. Yasmā ca kho, upavāṇa, ime pañca dhammā therassa bhikkhuno saṃvijjanti, tasmā taṃ sabrahmacārī sakkaronti garuṃ karonti mānenti pūjentī’’ti. Chaṭṭhaṃ."
    ],
    "innerText": "‘‘Sādhu sādhu, upavāṇa! Imehi kho, upavāṇa, pañcahi dhammehi samannāgato thero bhikkhu sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo ca. Ime ce, upavāṇa, pañca dhammā therassa bhikkhuno na saṃvijjeyyuṃ, taṃ sabrahmacārī na sakkareyyuṃ na garuṃ kareyyuṃ na māneyyuṃ na pūjeyyuṃ khaṇḍiccena pāliccena valittacatāya. Yasmā ca kho, upavāṇa, ime pañca dhammā therassa bhikkhuno saṃvijjanti, tasmā taṃ sabrahmacārī sakkaronti garuṃ karonti mānenti pūjentī’’ti. Chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Codanāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "167"
      },
      ". Tatra kho āyasmā sāriputto bhikkhū āmantesi – ‘‘codakena, āvuso, bhikkhunā paraṃ codetukāmena pañca dhamme ajjhattaṃ upaṭṭhāpetvā paro codetabbo’’."
    ],
    "innerText": "167. Tatra kho āyasmā sāriputto bhikkhū āmantesi – ‘‘codakena, āvuso, bhikkhunā paraṃ codetukāmena pañca dhamme ajjhattaṃ upaṭṭhāpetvā paro codetabbo’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katame pañca? Kālena vakkhāmi, no akālena; bhūtena vakkhāmi, no abhūtena; saṇhena vakkhāmi, no pharusena; atthasaṃhitena vakkhāmi, no anatthasaṃhitena; mettacitto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mettacittena (sī. pī. ka.) cūḷava. 400 passitabbaṃ]"
      },
      " vakkhāmi, no dosantaro ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[dosantarena (sī. pī. ka.)]"
      },
      ". Codakena, āvuso, bhikkhunā paraṃ codetukāmena ime pañca dhamme ajjhattaṃ upaṭṭhāpetvā paro codetabbo."
    ],
    "innerText": "‘‘Katame pañca? Kālena vakkhāmi, no akālena; bhūtena vakkhāmi, no abhūtena; saṇhena vakkhāmi, no pharusena; atthasaṃhitena vakkhāmi, no anatthasaṃhitena; mettacitto [mettacittena (sī. pī. ka.) cūḷava. 400 passitabbaṃ] vakkhāmi, no dosantaro [dosantarena (sī. pī. ka.)]. Codakena, āvuso, bhikkhunā paraṃ codetukāmena ime pañca dhamme ajjhattaṃ upaṭṭhāpetvā paro codetabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idhāhaṃ ",
      ", āvuso, ekaccaṃ puggalaṃ passāmi akālena codiyamānaṃ no kālena kupitaṃ, abhūtena codiyamānaṃ no bhūtena kupitaṃ, pharusena codiyamānaṃ no saṇhena kupitaṃ, anatthasaṃhitena codiyamānaṃ no atthasaṃhitena kupitaṃ, dosantarena codiyamānaṃ no mettacittena kupitaṃ."
    ],
    "innerText": "‘‘Idhāhaṃ , āvuso, ekaccaṃ puggalaṃ passāmi akālena codiyamānaṃ no kālena kupitaṃ, abhūtena codiyamānaṃ no bhūtena kupitaṃ, pharusena codiyamānaṃ no saṇhena kupitaṃ, anatthasaṃhitena codiyamānaṃ no atthasaṃhitena kupitaṃ, dosantarena codiyamānaṃ no mettacittena kupitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Adhammacuditassa, āvuso, bhikkhuno pañcahākārehi avippaṭisāro upadahātabbo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[upadahitabbo (sī. syā. pī.)]"
      },
      " – ‘akālenāyasmā cudito no kālena ",
      ", alaṃ te avippaṭisārāya; abhūtenāyasmā cudito no bhūtena ",
      ", alaṃ te avippaṭisārāya; pharusenāyasmā cudito no saṇhena, alaṃ te avippaṭisārāya ",
      "; anatthasaṃhitenāyasmā cudito no atthasaṃhitena, alaṃ te avippaṭisārāya; dosantarenāyasmā cudito no mettacittena, alaṃ te avippaṭisārāyā’ti. Adhammacuditassa, āvuso, bhikkhuno imehi pañcahākārehi avippaṭisāro upadahātabbo."
    ],
    "innerText": "‘‘Adhammacuditassa, āvuso, bhikkhuno pañcahākārehi avippaṭisāro upadahātabbo [upadahitabbo (sī. syā. pī.)] – ‘akālenāyasmā cudito no kālena , alaṃ te avippaṭisārāya; abhūtenāyasmā cudito no bhūtena , alaṃ te avippaṭisārāya; pharusenāyasmā cudito no saṇhena, alaṃ te avippaṭisārāya ; anatthasaṃhitenāyasmā cudito no atthasaṃhitena, alaṃ te avippaṭisārāya; dosantarenāyasmā cudito no mettacittena, alaṃ te avippaṭisārāyā’ti. Adhammacuditassa, āvuso, bhikkhuno imehi pañcahākārehi avippaṭisāro upadahātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Adhammacodakassa, āvuso, bhikkhuno pañcahākārehi vippaṭisāro upadahātabbo – ‘akālena te, āvuso, codito ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[cudito (sī. syā. pī.)]"
      },
      " no kālena, alaṃ te vippaṭisārāya; abhūtena te, āvuso, codito no bhūtena, alaṃ te vippaṭisārāya; pharusena te, āvuso, codito no saṇhena, alaṃ te vippaṭisārāya; anatthasaṃhitena te, āvuso, codito no atthasaṃhitena, alaṃ te vippaṭisārāya; dosantarena te, āvuso, codito no mettacittena, alaṃ te vippaṭisārāyā’ti. Adhammacodakassa, āvuso, bhikkhuno imehi pañcahākārehi vippaṭisāro upadahātabbo. Taṃ kissa hetu? Yathā na aññopi bhikkhu ",
      " abhūtena codetabbaṃ maññeyyāti."
    ],
    "innerText": "‘‘Adhammacodakassa, āvuso, bhikkhuno pañcahākārehi vippaṭisāro upadahātabbo – ‘akālena te, āvuso, codito [cudito (sī. syā. pī.)] no kālena, alaṃ te vippaṭisārāya; abhūtena te, āvuso, codito no bhūtena, alaṃ te vippaṭisārāya; pharusena te, āvuso, codito no saṇhena, alaṃ te vippaṭisārāya; anatthasaṃhitena te, āvuso, codito no atthasaṃhitena, alaṃ te vippaṭisārāya; dosantarena te, āvuso, codito no mettacittena, alaṃ te vippaṭisārāyā’ti. Adhammacodakassa, āvuso, bhikkhuno imehi pañcahākārehi vippaṭisāro upadahātabbo. Taṃ kissa hetu? Yathā na aññopi bhikkhu abhūtena codetabbaṃ maññeyyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Idha panāhaṃ, āvuso, ekaccaṃ puggalaṃ passāmi kālena codiyamānaṃ no akālena kupitaṃ, bhūtena codiyamānaṃ no abhūtena kupitaṃ, saṇhena codiyamānaṃ no pharusena kupitaṃ, atthasaṃhitena codiyamānaṃ no anatthasaṃhitena kupitaṃ, mettacittena codiyamānaṃ no dosantarena kupitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Dhammacuditassa, āvuso, bhikkhuno pañcahākārehi vippaṭisāro upadahātabbo – ‘kālenāyasmā cudito no akālena, alaṃ te vippaṭisārāya; bhūtenāyasmā cudito no abhūtena, alaṃ te vippaṭisārāya; saṇhenāyasmā cudito no pharusena, alaṃ te vippaṭisārāya; atthasaṃhitenāyasmā cudito no anatthasaṃhitena, alaṃ te vippaṭisārāya; mettacittenāyasmā cudito no dosantarena, alaṃ te vippaṭisārāyā’ti. Dhammacuditassa ",
      ", āvuso, bhikkhuno imehi pañcahākārehi vippaṭisāro upadahātabbo."
    ],
    "innerText": "‘‘Dhammacuditassa, āvuso, bhikkhuno pañcahākārehi vippaṭisāro upadahātabbo – ‘kālenāyasmā cudito no akālena, alaṃ te vippaṭisārāya; bhūtenāyasmā cudito no abhūtena, alaṃ te vippaṭisārāya; saṇhenāyasmā cudito no pharusena, alaṃ te vippaṭisārāya; atthasaṃhitenāyasmā cudito no anatthasaṃhitena, alaṃ te vippaṭisārāya; mettacittenāyasmā cudito no dosantarena, alaṃ te vippaṭisārāyā’ti. Dhammacuditassa , āvuso, bhikkhuno imehi pañcahākārehi vippaṭisāro upadahātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Dhammacodakassa, āvuso, bhikkhuno pañcahākārehi avippaṭisāro upadahātabbo – ‘kālena te, āvuso, codito no akālena, alaṃ ",
      " te avippaṭisārāya; bhūtena te, āvuso, codito no abhūtena, alaṃ te avippaṭisārāya; saṇhena te, āvuso, codito no ",
      " pharusena, alaṃ te avippaṭisārāya; atthasaṃhitena te, āvuso, codito no anatthasaṃhitena, alaṃ te avippaṭisārāya; mettacittena te, āvuso, codito no dosantarena, alaṃ te avippaṭisārāyā’ti. Dhammacodakassa, āvuso, bhikkhuno imehi pañcahākārehi avippaṭisāro upadahātabbo. Taṃ kissa hetu? Yathā aññopi ",
      " bhikkhu bhūtena coditabbaṃ maññeyyāti."
    ],
    "innerText": "‘‘Dhammacodakassa, āvuso, bhikkhuno pañcahākārehi avippaṭisāro upadahātabbo – ‘kālena te, āvuso, codito no akālena, alaṃ te avippaṭisārāya; bhūtena te, āvuso, codito no abhūtena, alaṃ te avippaṭisārāya; saṇhena te, āvuso, codito no pharusena, alaṃ te avippaṭisārāya; atthasaṃhitena te, āvuso, codito no anatthasaṃhitena, alaṃ te avippaṭisārāya; mettacittena te, āvuso, codito no dosantarena, alaṃ te avippaṭisārāyā’ti. Dhammacodakassa, āvuso, bhikkhuno imehi pañcahākārehi avippaṭisāro upadahātabbo. Taṃ kissa hetu? Yathā aññopi bhikkhu bhūtena coditabbaṃ maññeyyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Cuditena, āvuso, puggalena dvīsu dhammesu patiṭṭhātabbaṃ – sacce ca, akuppe ca. Maṃ cepi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pañcahi (syā. ka.)]"
      },
      ", āvuso, pare codeyyuṃ kālena vā akālena vā bhūtena vā abhūtena vā saṇhena vā pharusena vā atthasaṃhitena vā anatthasaṃhitena vā mettacittā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mettacittena (sī. pī. ka.) ma. ni. 1.227 passitabbaṃ]"
      },
      " vā dosantarā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[dosantarena (sī. pī. ka.)]"
      },
      " vā, ahampi dvīsuyeva dhammesu patiṭṭhaheyyaṃ – sacce ca, akuppe ca. Sace jāneyyaṃ – ‘attheso mayi dhammo’ti, ‘atthī’ti naṃ vadeyyaṃ – ‘saṃvijjateso mayi dhammo’ti. Sace jāneyyaṃ – ‘nattheso mayi dhammo’ti, ‘natthī’ti naṃ vadeyyaṃ – ‘neso dhammo mayi saṃvijjatī’ti."
    ],
    "innerText": "‘‘Cuditena, āvuso, puggalena dvīsu dhammesu patiṭṭhātabbaṃ – sacce ca, akuppe ca. Maṃ cepi [pañcahi (syā. ka.)], āvuso, pare codeyyuṃ kālena vā akālena vā bhūtena vā abhūtena vā saṇhena vā pharusena vā atthasaṃhitena vā anatthasaṃhitena vā mettacittā [mettacittena (sī. pī. ka.) ma. ni. 1.227 passitabbaṃ] vā dosantarā [dosantarena (sī. pī. ka.)] vā, ahampi dvīsuyeva dhammesu patiṭṭhaheyyaṃ – sacce ca, akuppe ca. Sace jāneyyaṃ – ‘attheso mayi dhammo’ti, ‘atthī’ti naṃ vadeyyaṃ – ‘saṃvijjateso mayi dhammo’ti. Sace jāneyyaṃ – ‘nattheso mayi dhammo’ti, ‘natthī’ti naṃ vadeyyaṃ – ‘neso dhammo mayi saṃvijjatī’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evampi kho te ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[evampi kho (ka.)]"
      },
      ", sāriputta, vuccamānā atha ca panidhekacce moghapurisā na padakkhiṇaṃ gaṇhantī’’ti."
    ],
    "innerText": "‘‘Evampi kho te [evampi kho (ka.)], sāriputta, vuccamānā atha ca panidhekacce moghapurisā na padakkhiṇaṃ gaṇhantī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ye te, bhante, puggalā assaddhā jīvikatthā na saddhā ",
      " agārasmā anagāriyaṃ pabbajitā saṭhā māyāvino ketabino ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[keṭubhino (sī. syā. kaṃ. pī.)]"
      },
      " uddhatā unnaḷā capalā mukharā vikiṇṇavācā indriyesu aguttadvārā bhojane amattaññuno jāgariyaṃ ananuyuttā sāmaññe anapekkhavanto sikkhāya na tibbagāravā bāhulikā sāthalikā okkamane pubbaṅgamā paviveke nikkhittadhurā kusītā hīnavīriyā muṭṭhassatino asampajānā asamāhitā vibbhantacittā duppaññā eḷamūgā, te mayā evaṃ vuccamānā na padakkhiṇaṃ gaṇhanti."
    ],
    "innerText": "‘‘Ye te, bhante, puggalā assaddhā jīvikatthā na saddhā agārasmā anagāriyaṃ pabbajitā saṭhā māyāvino ketabino [keṭubhino (sī. syā. kaṃ. pī.)] uddhatā unnaḷā capalā mukharā vikiṇṇavācā indriyesu aguttadvārā bhojane amattaññuno jāgariyaṃ ananuyuttā sāmaññe anapekkhavanto sikkhāya na tibbagāravā bāhulikā sāthalikā okkamane pubbaṅgamā paviveke nikkhittadhurā kusītā hīnavīriyā muṭṭhassatino asampajānā asamāhitā vibbhantacittā duppaññā eḷamūgā, te mayā evaṃ vuccamānā na padakkhiṇaṃ gaṇhanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ye pana te, bhante, kulaputtā ",
      " saddhā agārasmā anagāriyaṃ pabbajitā asaṭhā amāyāvino aketabino anuddhatā anunnaḷā acapalā amukharā avikiṇṇavācā indriyesu guttadvārā bhojane mattaññuno jāgariyaṃ ",
      " anuyuttā sāmaññe apekkhavanto sikkhāya tibbagāravā na bāhulikā na sāthalikā okkamane nikkhittadhurā paviveke pubbaṅgamā āraddhavīriyā ",
      " pahitattā upaṭṭhitassatino sampajānā samāhitā ekaggacittā paññavanto aneḷamūgā, te mayā evaṃ vuccamānā padakkhiṇaṃ gaṇhantīti."
    ],
    "innerText": "‘‘Ye pana te, bhante, kulaputtā saddhā agārasmā anagāriyaṃ pabbajitā asaṭhā amāyāvino aketabino anuddhatā anunnaḷā acapalā amukharā avikiṇṇavācā indriyesu guttadvārā bhojane mattaññuno jāgariyaṃ anuyuttā sāmaññe apekkhavanto sikkhāya tibbagāravā na bāhulikā na sāthalikā okkamane nikkhittadhurā paviveke pubbaṅgamā āraddhavīriyā pahitattā upaṭṭhitassatino sampajānā samāhitā ekaggacittā paññavanto aneḷamūgā, te mayā evaṃ vuccamānā padakkhiṇaṃ gaṇhantīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ye te, sāriputta, puggalā assaddhā jīvikatthā na saddhā agārasmā anagāriyaṃ pabbajitā saṭhā māyāvino ketabino uddhatā unnaḷā capalā mukharā vikiṇṇavācā indriyesu aguttadvārā bhojane amattaññuno jāgariyaṃ ananuyuttā sāmaññe anapekkhavanto sikkhāya na tibbagāravā bāhulikā sāthalikā okkamane pubbaṅgamā paviveke nikkhittadhurā kusītā hīnavīriyā muṭṭhassatino asampajānā asamāhitā vibbhantacittā duppaññā eḷamūgā, tiṭṭhantu te."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ye pana, te sāriputta, kulaputtā saddhā agārasmā anagāriyaṃ pabbajitā asaṭhā amāyāvino aketabino anuddhatā anunnaḷā acapalā amukharā avikiṇṇavācā indriyesu guttadvārā bhojane mattaññuno jāgariyaṃ anuyuttā sāmaññe apekkhavanto sikkhāya tibbagāravā na bāhulikā na sāthalikā okkamane nikkhittadhurā paviveke pubbaṅgamā āraddhavīriyā pahitattā upaṭṭhitassatino sampajānā samāhitā ekaggacittā paññavanto aneḷamūgā, te tvaṃ, sāriputta, vadeyyāsi ",
      ". Ovada, sāriputta ",
      ", sabrahmacārī; anusāsa, sāriputta, sabrahmacārī – ‘asaddhammā vuṭṭhāpetvā saddhamme patiṭṭhāpessāmi sabrahmacārī’ti. Evañhi te, sāriputta, sikkhitabba’’nti. Sattamaṃ."
    ],
    "innerText": "‘‘Ye pana, te sāriputta, kulaputtā saddhā agārasmā anagāriyaṃ pabbajitā asaṭhā amāyāvino aketabino anuddhatā anunnaḷā acapalā amukharā avikiṇṇavācā indriyesu guttadvārā bhojane mattaññuno jāgariyaṃ anuyuttā sāmaññe apekkhavanto sikkhāya tibbagāravā na bāhulikā na sāthalikā okkamane nikkhittadhurā paviveke pubbaṅgamā āraddhavīriyā pahitattā upaṭṭhitassatino sampajānā samāhitā ekaggacittā paññavanto aneḷamūgā, te tvaṃ, sāriputta, vadeyyāsi . Ovada, sāriputta , sabrahmacārī; anusāsa, sāriputta, sabrahmacārī – ‘asaddhammā vuṭṭhāpetvā saddhamme patiṭṭhāpessāmi sabrahmacārī’ti. Evañhi te, sāriputta, sikkhitabba’’nti. Sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Sīlasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "168"
      },
      ". Tatra kho āyasmā sāriputto bhikkhū āmantesi – ‘‘dussīlassa, āvuso, sīlavipannassa hatūpaniso hoti sammāsamādhi; sammāsamādhimhi asati sammāsamādhivipannassa hatūpanisaṃ hoti yathābhūtañāṇadassanaṃ; yathābhūtañāṇadassane asati yathābhūtañāṇadassanavipannassa hatūpaniso hoti nibbidāvirāgo; nibbidāvirāge asati nibbidāvirāgavipannassa hatūpanisaṃ hoti vimuttiñāṇadassanaṃ. Seyyathāpi, āvuso, rukkho sākhāpalāsavipanno. Tassa papaṭikāpi na pāripūriṃ gacchati, tacopi ",
      " …pe… pheggupi… sāropi na pāripūriṃ gacchati. Evamevaṃ kho, āvuso, dussīlassa sīlavipannassa hatūpaniso hoti sammāsamādhi; sammāsamādhimhi ",
      " asati sammāsamādhivipannassa hatūpanisaṃ hoti yathābhūtañāṇadassanaṃ; yathābhūtañāṇadassane asati yathābhūtañāṇadassanavipannassa hatūpaniso hoti nibbidāvirāgo; nibbidāvirāge asati nibbidāvirāgavipannassa hatūpanisaṃ hoti vimuttiñāṇadassanaṃ."
    ],
    "innerText": "168. Tatra kho āyasmā sāriputto bhikkhū āmantesi – ‘‘dussīlassa, āvuso, sīlavipannassa hatūpaniso hoti sammāsamādhi; sammāsamādhimhi asati sammāsamādhivipannassa hatūpanisaṃ hoti yathābhūtañāṇadassanaṃ; yathābhūtañāṇadassane asati yathābhūtañāṇadassanavipannassa hatūpaniso hoti nibbidāvirāgo; nibbidāvirāge asati nibbidāvirāgavipannassa hatūpanisaṃ hoti vimuttiñāṇadassanaṃ. Seyyathāpi, āvuso, rukkho sākhāpalāsavipanno. Tassa papaṭikāpi na pāripūriṃ gacchati, tacopi …pe… pheggupi… sāropi na pāripūriṃ gacchati. Evamevaṃ kho, āvuso, dussīlassa sīlavipannassa hatūpaniso hoti sammāsamādhi; sammāsamādhimhi asati sammāsamādhivipannassa hatūpanisaṃ hoti yathābhūtañāṇadassanaṃ; yathābhūtañāṇadassane asati yathābhūtañāṇadassanavipannassa hatūpaniso hoti nibbidāvirāgo; nibbidāvirāge asati nibbidāvirāgavipannassa hatūpanisaṃ hoti vimuttiñāṇadassanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sīlavato, āvuso, sīlasampannassa upanisasampanno hoti sammāsamādhi; sammāsamādhimhi sati sammāsamādhisampannassa upanisasampannaṃ hoti yathābhūtañāṇadassanaṃ; yathābhūtañāṇadassane sati yathābhūtañāṇadassanasampannassa upanisasampanno hoti nibbidāvirāgo; nibbidāvirāge sati nibbidāvirāgasampannassa upanisasampannaṃ ",
      " hoti vimuttiñāṇadassanaṃ. Seyyathāpi, āvuso, rukkho, sākhāpalāsasampanno. Tassa papaṭikāpi pāripūriṃ gacchati, tacopi…pe… pheggupi… sāropi ",
      " pāripūriṃ gacchati. Evamevaṃ kho, āvuso, sīlavato sīlasampannassa upanisasampanno hoti sammāsamādhi; sammāsamādhimhi sati sammāsamādhisampannassa upanisasampannaṃ hoti yathābhūtañāṇadassanaṃ; yathābhūtañāṇadassane sati yathābhūtañāṇadassanasampannassa upanisasampanno hoti nibbidāvirāgo; nibbidāvirāge sati nibbidāvirāgasampannassa upanisasampannaṃ hoti vimuttiñāṇadassana’’nti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[a. ni. 5.168; 6.50; 7.65]"
      },
      ". Aṭṭhamaṃ."
    ],
    "innerText": "‘‘Sīlavato, āvuso, sīlasampannassa upanisasampanno hoti sammāsamādhi; sammāsamādhimhi sati sammāsamādhisampannassa upanisasampannaṃ hoti yathābhūtañāṇadassanaṃ; yathābhūtañāṇadassane sati yathābhūtañāṇadassanasampannassa upanisasampanno hoti nibbidāvirāgo; nibbidāvirāge sati nibbidāvirāgasampannassa upanisasampannaṃ hoti vimuttiñāṇadassanaṃ. Seyyathāpi, āvuso, rukkho, sākhāpalāsasampanno. Tassa papaṭikāpi pāripūriṃ gacchati, tacopi…pe… pheggupi… sāropi pāripūriṃ gacchati. Evamevaṃ kho, āvuso, sīlavato sīlasampannassa upanisasampanno hoti sammāsamādhi; sammāsamādhimhi sati sammāsamādhisampannassa upanisasampannaṃ hoti yathābhūtañāṇadassanaṃ; yathābhūtañāṇadassane sati yathābhūtañāṇadassanasampannassa upanisasampanno hoti nibbidāvirāgo; nibbidāvirāge sati nibbidāvirāgasampannassa upanisasampannaṃ hoti vimuttiñāṇadassana’’nti [a. ni. 5.168; 6.50; 7.65]. Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Khippanisantisuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "169"
      },
      ". Atha kho āyasmā ānando yenāyasmā sāriputto tenupasaṅkami; upasaṅkamitvā āyasmatā sāriputtena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sārāṇīyaṃ (sī. syā. kaṃ. pī.)]"
      },
      " vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando āyasmantaṃ sāriputtaṃ etadavoca –"
    ],
    "innerText": "169. Atha kho āyasmā ānando yenāyasmā sāriputto tenupasaṅkami; upasaṅkamitvā āyasmatā sāriputtena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ [sārāṇīyaṃ (sī. syā. kaṃ. pī.)] vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando āyasmantaṃ sāriputtaṃ etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kittāvatā nu kho, āvuso sāriputta, bhikkhu khippanisanti ca hoti, kusalesu dhammesu suggahitaggāhī ca, bahuñca gaṇhāti, gahitañcassa nappamussatī’’ti? ‘‘Āyasmā kho ānando bahussuto. Paṭibhātu āyasmantaṃyeva ānanda’’nti. ‘‘Tenahāvuso sāriputta, suṇāhi, sādhukaṃ manasi ",
      " karohi; bhāsissāmī’’ti. ‘‘Evamāvuso’’ti kho āyasmā sāriputto āyasmato ānandassa paccassosi. Āyasmā ānando etadavoca –"
    ],
    "innerText": "‘‘Kittāvatā nu kho, āvuso sāriputta, bhikkhu khippanisanti ca hoti, kusalesu dhammesu suggahitaggāhī ca, bahuñca gaṇhāti, gahitañcassa nappamussatī’’ti? ‘‘Āyasmā kho ānando bahussuto. Paṭibhātu āyasmantaṃyeva ānanda’’nti. ‘‘Tenahāvuso sāriputta, suṇāhi, sādhukaṃ manasi karohi; bhāsissāmī’’ti. ‘‘Evamāvuso’’ti kho āyasmā sāriputto āyasmato ānandassa paccassosi. Āyasmā ānando etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idhāvuso sāriputta, bhikkhu atthakusalo ca hoti, dhammakusalo ca, byañjanakusalo ca ",
      ", niruttikusalo ca, pubbāparakusalo ca. Ettāvatā kho ",
      ", āvuso sāriputta, bhikkhu khippanisanti ca hoti kusalesu dhammesu, suggahitaggāhī ca, bahuñca gaṇhāti, gahitañcassa nappamussatī’’ti. ‘‘Acchariyaṃ, āvuso! Abbhutaṃ, āvuso!! Yāva subhāsitaṃ cidaṃ āyasmatā ānandena. Imehi ca mayaṃ pañcahi dhammehi samannāgataṃ āyasmantaṃ ānandaṃ dhārema – ‘āyasmā ānando atthakusalo dhammakusalo byañjanakusalo niruttikusalo pubbāparakusalo’’’ti. Navamaṃ."
    ],
    "innerText": "‘‘Idhāvuso sāriputta, bhikkhu atthakusalo ca hoti, dhammakusalo ca, byañjanakusalo ca , niruttikusalo ca, pubbāparakusalo ca. Ettāvatā kho , āvuso sāriputta, bhikkhu khippanisanti ca hoti kusalesu dhammesu, suggahitaggāhī ca, bahuñca gaṇhāti, gahitañcassa nappamussatī’’ti. ‘‘Acchariyaṃ, āvuso! Abbhutaṃ, āvuso!! Yāva subhāsitaṃ cidaṃ āyasmatā ānandena. Imehi ca mayaṃ pañcahi dhammehi samannāgataṃ āyasmantaṃ ānandaṃ dhārema – ‘āyasmā ānando atthakusalo dhammakusalo byañjanakusalo niruttikusalo pubbāparakusalo’’’ti. Navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Bhaddajisuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "170"
      },
      ". Ekaṃ ",
      " samayaṃ āyasmā ānando kosambiyaṃ viharati ghositārāme. Atha kho āyasmā bhaddaji yenāyasmā ānando tenupasaṅkami; upasaṅkamitvā āyasmatā ānandena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ bhaddajiṃ āyasmā ānando etadavoca – ‘‘kiṃ nu kho, āvuso bhaddaji, dassanānaṃ aggaṃ, kiṃ savanānaṃ aggaṃ, kiṃ sukhānaṃ aggaṃ, kiṃ saññānaṃ aggaṃ, kiṃ bhavānaṃ agga’’nti?"
    ],
    "innerText": "170. Ekaṃ samayaṃ āyasmā ānando kosambiyaṃ viharati ghositārāme. Atha kho āyasmā bhaddaji yenāyasmā ānando tenupasaṅkami; upasaṅkamitvā āyasmatā ānandena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ bhaddajiṃ āyasmā ānando etadavoca – ‘‘kiṃ nu kho, āvuso bhaddaji, dassanānaṃ aggaṃ, kiṃ savanānaṃ aggaṃ, kiṃ sukhānaṃ aggaṃ, kiṃ saññānaṃ aggaṃ, kiṃ bhavānaṃ agga’’nti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Atthāvuso, brahmā abhibhū anabhibhūto aññadatthudaso vasavattī, yo taṃ brahmānaṃ passati, idaṃ dassanānaṃ aggaṃ. Atthāvuso, ābhassarā nāma devā sukhena abhisannā parisannā. Te kadāci karahaci udānaṃ udānenti – ‘aho sukhaṃ, aho sukha’nti! Yo taṃ saddaṃ suṇāti, idaṃ savanānaṃ aggaṃ. Atthāvuso, subhakiṇhā nāma devā. Te santaṃyeva tusitā sukhaṃ paṭivedenti, idaṃ sukhānaṃ aggaṃ. Atthāvuso, ākiñcaññāyatanūpagā devā, idaṃ saññānaṃ ",
      " aggaṃ. Atthāvuso, nevasaññānāsaññāyatanūpagā devā, idaṃ bhavānaṃ agga’’nti. ‘‘Sameti kho idaṃ āyasmato bhaddajissa, yadidaṃ bahunā janenā’’ti?"
    ],
    "innerText": "‘‘Atthāvuso, brahmā abhibhū anabhibhūto aññadatthudaso vasavattī, yo taṃ brahmānaṃ passati, idaṃ dassanānaṃ aggaṃ. Atthāvuso, ābhassarā nāma devā sukhena abhisannā parisannā. Te kadāci karahaci udānaṃ udānenti – ‘aho sukhaṃ, aho sukha’nti! Yo taṃ saddaṃ suṇāti, idaṃ savanānaṃ aggaṃ. Atthāvuso, subhakiṇhā nāma devā. Te santaṃyeva tusitā sukhaṃ paṭivedenti, idaṃ sukhānaṃ aggaṃ. Atthāvuso, ākiñcaññāyatanūpagā devā, idaṃ saññānaṃ aggaṃ. Atthāvuso, nevasaññānāsaññāyatanūpagā devā, idaṃ bhavānaṃ agga’’nti. ‘‘Sameti kho idaṃ āyasmato bhaddajissa, yadidaṃ bahunā janenā’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Āyasmā ",
      " kho, ānando, bahussuto. Paṭibhātu āyasmantaṃyeva ānanda’’nti. ‘‘Tenahāvuso bhaddaji, suṇāhi, sādhukaṃ manasi karohi; bhāsissāmī’’ti. ‘‘Evamāvuso’’ti kho āyasmā bhaddaji āyasmato ānandassa paccassosi. Āyasmā ānando etadavoca –"
    ],
    "innerText": "‘‘Āyasmā kho, ānando, bahussuto. Paṭibhātu āyasmantaṃyeva ānanda’’nti. ‘‘Tenahāvuso bhaddaji, suṇāhi, sādhukaṃ manasi karohi; bhāsissāmī’’ti. ‘‘Evamāvuso’’ti kho āyasmā bhaddaji āyasmato ānandassa paccassosi. Āyasmā ānando etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yathā ",
      " passato kho, āvuso, anantarā āsavānaṃ khayo hoti, idaṃ dassanānaṃ aggaṃ. Yathā suṇato anantarā āsavānaṃ khayo hoti, idaṃ savanānaṃ aggaṃ. Yathā sukhitassa anantarā āsavānaṃ khayo hoti, idaṃ sukhānaṃ aggaṃ. Yathā saññissa anantarā āsavānaṃ khayo hoti, idaṃ saññānaṃ aggaṃ. Yathā bhūtassa anantarā āsavānaṃ khayo hoti, idaṃ bhavānaṃ agga’’nti. Dasamaṃ."
    ],
    "innerText": "‘‘Yathā passato kho, āvuso, anantarā āsavānaṃ khayo hoti, idaṃ dassanānaṃ aggaṃ. Yathā suṇato anantarā āsavānaṃ khayo hoti, idaṃ savanānaṃ aggaṃ. Yathā sukhitassa anantarā āsavānaṃ khayo hoti, idaṃ sukhānaṃ aggaṃ. Yathā saññissa anantarā āsavānaṃ khayo hoti, idaṃ saññānaṃ aggaṃ. Yathā bhūtassa anantarā āsavānaṃ khayo hoti, idaṃ bhavānaṃ agga’’nti. Dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "children": [
      "Āghātavaggo ",
      " dutiyo."
    ],
    "innerText": "Āghātavaggo dutiyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Dve āghātavinayā, sākacchā sājīvato pañhaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pucchā nirodho codanā, sīlaṃ nisanti bhaddajīti."
  }
]