[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "(8) 3. Apaṇṇakavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Padhānasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "71"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": " . Catūhi"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": ", bhikkhave, dhammehi samannāgato bhikkhu apaṇṇakappaṭipadaṃ paṭipanno hoti, yoni cassa āraddhā hoti āsavānaṃ khayāya. Katamehi catūhi? Idha, bhikkhave, bhikkhu sīlavā hoti, bahussuto hoti, āraddhavīriyo hoti, paññavā hoti. Imehi kho, bhikkhave, catūhi dhammehi samannāgato bhikkhu apaṇṇakappaṭipadaṃ paṭipanno hoti, yoni cassa āraddhā hoti āsavānaṃ khayāyā''ti. Paṭhamaṃ."
      }
    ],
    "innerText": "71 . Catūhi, bhikkhave, dhammehi samannāgato bhikkhu apaṇṇakappaṭipadaṃ paṭipanno hoti, yoni cassa āraddhā hoti āsavānaṃ khayāya. Katamehi catūhi? Idha, bhikkhave, bhikkhu sīlavā hoti, bahussuto hoti, āraddhavīriyo hoti, paññavā hoti. Imehi kho, bhikkhave, catūhi dhammehi samannāgato bhikkhu apaṇṇakappaṭipadaṃ paṭipanno hoti, yoni cassa āraddhā hoti āsavānaṃ khayāyā''ti. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Sammādiṭṭhisuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "72"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": " . ''Catūhi, bhikkhave, dhammehi samannāgato bhikkhu apaṇṇakappaṭipadaṃ paṭipanno hoti, yoni cassa āraddhā hoti āsavānaṃ khayāya. Katamehi"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "catūhi? Nekkhammavitakkena, abyāpādavitakkena, avihiṃsāvitakkena, sammādiṭṭhiyā – imehi kho, bhikkhave, catūhi dhammehi samannāgato bhikkhu"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "apaṇṇakappaṭipadaṃ paṭipanno hoti, yoni cassa āraddhā hoti āsavānaṃ khayāyā''ti. Dutiyaṃ."
      }
    ],
    "innerText": "72 . ''Catūhi, bhikkhave, dhammehi samannāgato bhikkhu apaṇṇakappaṭipadaṃ paṭipanno hoti, yoni cassa āraddhā hoti āsavānaṃ khayāya. Katamehicatūhi? Nekkhammavitakkena, abyāpādavitakkena, avihiṃsāvitakkena, sammādiṭṭhiyā – imehi kho, bhikkhave, catūhi dhammehi samannāgato bhikkhuapaṇṇakappaṭipadaṃ paṭipanno hoti, yoni cassa āraddhā hoti āsavānaṃ khayāyā''ti. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Sappurisasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "73"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": " . Catūhi"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": ", bhikkhave, dhammehi samannāgato asappuriso veditabbo. Katamehi catūhi? Idha, bhikkhave, asappuriso yo hoti parassa avaṇṇo taṃ apuṭṭhopi pātu karoti, ko pana vādo puṭṭhassa! Puṭṭho kho pana pañhābhinīto ahāpetvā alambitvā paripūraṃ viththārena parassa avaṇṇaṃ bhāsitā hoti. Veditabbametaṃ, bhikkhave, asappuriso ayaṃ bhavanti."
      }
    ],
    "innerText": "73 . Catūhi, bhikkhave, dhammehi samannāgato asappuriso veditabbo. Katamehi catūhi? Idha, bhikkhave, asappuriso yo hoti parassa avaṇṇo taṃ apuṭṭhopi pātu karoti, ko pana vādo puṭṭhassa! Puṭṭho kho pana pañhābhinīto ahāpetvā alambitvā paripūraṃ viththārena parassa avaṇṇaṃ bhāsitā hoti. Veditabbametaṃ, bhikkhave, asappuriso ayaṃ bhavanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "''Puna''"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "caparaṃ, bhikkhave, asappuriso yo hoti parassa vaṇṇo taṃ puṭṭhopi na pātu karoti, ko pana vādo apuṭṭhassa! Puṭṭho kho pana paṇhābhinīto hāpetvā lambitvā aparipūraṃ avitthārena parassa vaṇṇaṃ bhāsitā hoti. Veditabbametaṃ, bhikkhave, asappuriso ayaṃ bhavanti."
      }
    ],
    "innerText": "''Puna''caparaṃ, bhikkhave, asappuriso yo hoti parassa vaṇṇo taṃ puṭṭhopi na pātu karoti, ko pana vādo apuṭṭhassa! Puṭṭho kho pana paṇhābhinīto hāpetvā lambitvā aparipūraṃ avitthārena parassa vaṇṇaṃ bhāsitā hoti. Veditabbametaṃ, bhikkhave, asappuriso ayaṃ bhavanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "''Puna caparaṃ, bhikkhave, asappuriso yo hoti attano avaṇo taṃ puṭṭhopi na pātu karoti, ko pana vādo apuṭṭhassa! Puṭṭho kho pana pañhābhinīto hāpetvā lambitvā aparipūraṃ avitthārena attano avaṇṇaṃ bhāsitā hoti. Veditabbametaṃ, bhikkhave, asappuriso ayaṃ bhavanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "''Puna caparaṃ, bhikkhave, asappuriso yo hoti attano vaṇṇo taṃ apuṭṭhopi pātu karoti, ko pana vādo puṭṭhassa! Puṭṭho kho pana pañhābhinīto ahāpetvā alambitvā paripūraṃ viththārena attano"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "vaṇṇaṃ bhāsitā hoti. Veditabbametaṃ, bhikkhave, asappuriso ayaṃ bhavanti. Imehi kho, bhikkhave, catūhi dhammehi samannāgato asappuriso veditabbo."
      }
    ],
    "innerText": "''Puna caparaṃ, bhikkhave, asappuriso yo hoti attano vaṇṇo taṃ apuṭṭhopi pātu karoti, ko pana vādo puṭṭhassa! Puṭṭho kho pana pañhābhinīto ahāpetvā alambitvā paripūraṃ viththārena attanovaṇṇaṃ bhāsitā hoti. Veditabbametaṃ, bhikkhave, asappuriso ayaṃ bhavanti. Imehi kho, bhikkhave, catūhi dhammehi samannāgato asappuriso veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "''Catūhi, bhikkhave, dhammehi samannāgato sappuriso veditabbo. Katamehi catuhi? Idha, bhikkhave, sappuriso yo hoti parassa avaṇṇo taṃ puṭṭhopi na pātu karoti, ko pana vādo apuṭṭhassa! Puṭṭho kho pana pañhābhinīto haapetvā lambitvā aparipūraṃ"
      },
      " avitthārena parassa avaṇṇaṃ bhāsitā hoti. Veditabbametaṃ, bhikkhave, sappuriso ayaṃ bhavanti."
    ],
    "innerText": "''Catūhi, bhikkhave, dhammehi samannāgato sappuriso veditabbo. Katamehi catuhi? Idha, bhikkhave, sappuriso yo hoti parassa avaṇṇo taṃ puṭṭhopi na pātu karoti, ko pana vādo apuṭṭhassa! Puṭṭho kho pana pañhābhinīto haapetvā lambitvā aparipūraṃ avitthārena parassa avaṇṇaṃ bhāsitā hoti. Veditabbametaṃ, bhikkhave, sappuriso ayaṃ bhavanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna ",
      " caparaṃ, bhikkhave, sappuriso yo hoti parassa vaṇṇo taṃ apuṭṭhopi pātu karoti, ko pana vādo puṭṭhassa! Puṭṭho kho pana pañhābhinīto ahāpetvā alambitvā paripūraṃ vitthārena parassa vaṇṇaṃ bhāsitā hoti. Veditabbametaṃ, bhikkhave, sappuriso ayaṃ bhavanti."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, sappuriso yo hoti parassa vaṇṇo taṃ apuṭṭhopi pātu karoti, ko pana vādo puṭṭhassa! Puṭṭho kho pana pañhābhinīto ahāpetvā alambitvā paripūraṃ vitthārena parassa vaṇṇaṃ bhāsitā hoti. Veditabbametaṃ, bhikkhave, sappuriso ayaṃ bhavanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, bhikkhave, sappuriso yo hoti attano avaṇṇo taṃ apuṭṭhopi pātu karoti, ko pana vādo puṭṭhassa! Puṭṭho kho pana pañhābhinīto ahāpetvā alambitvā paripūraṃ vitthārena attano avaṇṇaṃ bhāsitā hoti. Veditabbametaṃ, bhikkhave, sappuriso ayaṃ bhavanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna ",
      " caparaṃ, bhikkhave, sappuriso yo hoti attano vaṇṇo taṃ puṭṭhopi na pātu karoti, ko pana vādo apuṭṭhassa! Puṭṭho kho pana pañhābhinīto hāpetvā lambitvā aparipūraṃ avitthārena attano vaṇṇaṃ bhāsitā hoti. Veditabbametaṃ ",
      ", bhikkhave, sappuriso ayaṃ bhavanti. Imehi kho, bhikkhave, catūhi dhammehi samannāgato sappuriso veditabbo."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, sappuriso yo hoti attano vaṇṇo taṃ puṭṭhopi na pātu karoti, ko pana vādo apuṭṭhassa! Puṭṭho kho pana pañhābhinīto hāpetvā lambitvā aparipūraṃ avitthārena attano vaṇṇaṃ bhāsitā hoti. Veditabbametaṃ , bhikkhave, sappuriso ayaṃ bhavanti. Imehi kho, bhikkhave, catūhi dhammehi samannāgato sappuriso veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Seyyathāpi, bhikkhave, vadhukā yaññadeva rattiṃ vā divaṃ vā ānītā hoti, tāvadevassā tibbaṃ hirottappaṃ paccupaṭṭhitaṃ hoti sassuyāpi sasurepi sāmikepi antamaso dāsakammakaraporisesu. Sā aparena samayena saṃvāsamanvāya vissāsamanvāya sassumpi sasurampi sāmikampi evamāha – ‘apetha, kiṃ pana tumhe jānāthā’ti! Evamevaṃ kho, bhikkhave, idhekacco bhikkhu yaññadeva rattiṃ vā divaṃ vā agārasmā anagāriyaṃ pabbajito hoti, tāvadevassa tibbaṃ hirottappaṃ paccupaṭṭhitaṃ hoti bhikkhūsu bhikkhunīsu upāsakesu upāsikāsu antamaso ārāmikasamaṇuddesesu. So aparena samayena saṃvāsamanvāya vissāsamanvāya ācariyampi upajjhāyampi evamāha – ‘apetha, kiṃ pana tumhe jānāthā’ti! Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘adhunāgatavadhukāsamena cetasā viharissāmā’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Paṭhamaaggasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "74"
      },
      ". ‘‘Cattārimāni, bhikkhave, aggāni. Katamāni cattāri? Sīlaggaṃ, samādhiggaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[samādhaggaṃ (sī. syā. kaṃ)]"
      },
      ", paññāggaṃ, vimuttaggaṃ – imāni kho, bhikkhave, cattāri aggānī’’ti. Catutthaṃ."
    ],
    "innerText": "74. ‘‘Cattārimāni, bhikkhave, aggāni. Katamāni cattāri? Sīlaggaṃ, samādhiggaṃ [samādhaggaṃ (sī. syā. kaṃ)], paññāggaṃ, vimuttaggaṃ – imāni kho, bhikkhave, cattāri aggānī’’ti. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Dutiyaaggasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "75"
      },
      ". ‘‘Cattārimāni ",
      ", bhikkhave, aggāni. Katamāni cattāri? Rūpaggaṃ, vedanāggaṃ, saññāggaṃ, bhavaggaṃ – imāni kho, bhikkhave, cattāri aggānī’’ti. Pañcamaṃ."
    ],
    "innerText": "75. ‘‘Cattārimāni , bhikkhave, aggāni. Katamāni cattāri? Rūpaggaṃ, vedanāggaṃ, saññāggaṃ, bhavaggaṃ – imāni kho, bhikkhave, cattāri aggānī’’ti. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Kusinārasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "76"
      },
      ". Ekaṃ ",
      " samayaṃ bhagavā kusinārāyaṃ viharati upavattane mallānaṃ sālavane antarena yamakasālānaṃ parinibbānasamaye. Tatra kho bhagavā bhikkhū ",
      " āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –"
    ],
    "innerText": "76. Ekaṃ samayaṃ bhagavā kusinārāyaṃ viharati upavattane mallānaṃ sālavane antarena yamakasālānaṃ parinibbānasamaye. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Siyā kho pana, bhikkhave ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[dī. ni. 2.217]"
      },
      ", ekabhikkhussapi kaṅkhā vā vimati vā buddhe vā dhamme vā saṅghe vā magge vā paṭipadāya vā, pucchatha, bhikkhave, mā pacchā vippaṭisārino ahuvattha – ‘sammukhībhūto no satthā ahosi, nāsakkhimha bhagavantaṃ sammukhā paṭipucchitu’’’nti. Evaṃ vutte te bhikkhū tuṇhī ahesuṃ. Dutiyampi kho bhagavā bhikkhū āmantesi – ‘‘siyā kho pana, bhikkhave, ekabhikkhussapi kaṅkhā vā vimati vā buddhe vā dhamme vā saṅghe vā magge vā paṭipadāya vā, pucchatha, bhikkhave, mā pacchā vippaṭisārino ahuvattha – ‘sammukhībhūto no satthā ahosi, nāsakkhimha bhagavantaṃ sammukhā paṭipucchitu’’’nti. Dutiyampi kho te bhikkhū tuṇhī ahesuṃ. Tatiyampi kho bhagavā bhikkhū āmantesi – ‘‘siyā kho pana, bhikkhave, ekabhikkhussapi kaṅkhā vā vimati vā buddhe vā dhamme vā saṅghe vā magge vā paṭipadāya vā, pucchatha, bhikkhave, mā pacchā vippaṭisārino ahuvattha – ‘sammukhībhūto no satthā ahosi, nāsakkhimha bhagavantaṃ sammukhā paṭipucchitu’’’nti. Tatiyampi kho te bhikkhū tuṇhī ahesuṃ."
    ],
    "innerText": "‘‘Siyā kho pana, bhikkhave [dī. ni. 2.217], ekabhikkhussapi kaṅkhā vā vimati vā buddhe vā dhamme vā saṅghe vā magge vā paṭipadāya vā, pucchatha, bhikkhave, mā pacchā vippaṭisārino ahuvattha – ‘sammukhībhūto no satthā ahosi, nāsakkhimha bhagavantaṃ sammukhā paṭipucchitu’’’nti. Evaṃ vutte te bhikkhū tuṇhī ahesuṃ. Dutiyampi kho bhagavā bhikkhū āmantesi – ‘‘siyā kho pana, bhikkhave, ekabhikkhussapi kaṅkhā vā vimati vā buddhe vā dhamme vā saṅghe vā magge vā paṭipadāya vā, pucchatha, bhikkhave, mā pacchā vippaṭisārino ahuvattha – ‘sammukhībhūto no satthā ahosi, nāsakkhimha bhagavantaṃ sammukhā paṭipucchitu’’’nti. Dutiyampi kho te bhikkhū tuṇhī ahesuṃ. Tatiyampi kho bhagavā bhikkhū āmantesi – ‘‘siyā kho pana, bhikkhave, ekabhikkhussapi kaṅkhā vā vimati vā buddhe vā dhamme vā saṅghe vā magge vā paṭipadāya vā, pucchatha, bhikkhave, mā pacchā vippaṭisārino ahuvattha – ‘sammukhībhūto no satthā ahosi, nāsakkhimha bhagavantaṃ sammukhā paṭipucchitu’’’nti. Tatiyampi kho te bhikkhū tuṇhī ahesuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho bhagavā bhikkhū āmantesi – ‘‘siyā kho pana, bhikkhave, satthugāravenapi na puccheyyātha, sahāyakopi, bhikkhave, sahāyakassa ārocetū’’ti. Evaṃ vutte te bhikkhū tuṇhī ahesuṃ. Atha ",
      " kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘acchariyaṃ, bhante, abbhutaṃ, bhante! Evaṃ pasanno ahaṃ, bhante! Natthi imasmiṃ bhikkhusaṅghe ekabhikkhussapi kaṅkhā vā vimati vā buddhe vā dhamme vā saṅghe vā magge vā paṭipadāya vā’’ti."
    ],
    "innerText": "Atha kho bhagavā bhikkhū āmantesi – ‘‘siyā kho pana, bhikkhave, satthugāravenapi na puccheyyātha, sahāyakopi, bhikkhave, sahāyakassa ārocetū’’ti. Evaṃ vutte te bhikkhū tuṇhī ahesuṃ. Atha kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘acchariyaṃ, bhante, abbhutaṃ, bhante! Evaṃ pasanno ahaṃ, bhante! Natthi imasmiṃ bhikkhusaṅghe ekabhikkhussapi kaṅkhā vā vimati vā buddhe vā dhamme vā saṅghe vā magge vā paṭipadāya vā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Pasādā ",
      " kho tvaṃ, ānanda, vadesi. Ñāṇameva hettha, ānanda, tathāgatassa – ‘natthi imasmiṃ bhikkhusaṅghe ekabhikkhussapi kaṅkhā vā vimati vā buddhe vā dhamme vā saṅghe vā magge ",
      " vā paṭipadāya vā’. Imesañhi, ānanda, pañcannaṃ bhikkhusatānaṃ yo pacchimako bhikkhu so sotāpanno avinipātadhammo niyato sambodhiparāyaṇo’’ti. Chaṭṭhaṃ."
    ],
    "innerText": "‘‘Pasādā kho tvaṃ, ānanda, vadesi. Ñāṇameva hettha, ānanda, tathāgatassa – ‘natthi imasmiṃ bhikkhusaṅghe ekabhikkhussapi kaṅkhā vā vimati vā buddhe vā dhamme vā saṅghe vā magge vā paṭipadāya vā’. Imesañhi, ānanda, pañcannaṃ bhikkhusatānaṃ yo pacchimako bhikkhu so sotāpanno avinipātadhammo niyato sambodhiparāyaṇo’’ti. Chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Acinteyyasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "77"
      },
      ". ‘‘Cattārimāni, bhikkhave, acinteyyāni, na cintetabbāni; yāni cintento ummādassa vighātassa bhāgī assa. Katamāni cattāri? Buddhānaṃ, bhikkhave, buddhavisayo acinteyyo, na cintetabbo; yaṃ cintento ummādassa vighātassa bhāgī assa. Jhāyissa, bhikkhave, jhānavisayo acinteyyo, na cintetabbo; yaṃ cintento ummādassa vighātassa bhāgī assa. Kammavipāko, bhikkhave, acinteyyo, na cintetabbo; yaṃ cintento ummādassa vighātassa bhāgī assa. Lokacintā, bhikkhave, acinteyyā, na cintetabbā; yaṃ cintento ummādassa vighātassa bhāgī assa. Imāni kho, bhikkhave, cattāri acinteyyāni, na cintetabbāni; yāni cintento ummādassa vighātassa bhāgī assā’’ti. Sattamaṃ."
    ],
    "innerText": "77. ‘‘Cattārimāni, bhikkhave, acinteyyāni, na cintetabbāni; yāni cintento ummādassa vighātassa bhāgī assa. Katamāni cattāri? Buddhānaṃ, bhikkhave, buddhavisayo acinteyyo, na cintetabbo; yaṃ cintento ummādassa vighātassa bhāgī assa. Jhāyissa, bhikkhave, jhānavisayo acinteyyo, na cintetabbo; yaṃ cintento ummādassa vighātassa bhāgī assa. Kammavipāko, bhikkhave, acinteyyo, na cintetabbo; yaṃ cintento ummādassa vighātassa bhāgī assa. Lokacintā, bhikkhave, acinteyyā, na cintetabbā; yaṃ cintento ummādassa vighātassa bhāgī assa. Imāni kho, bhikkhave, cattāri acinteyyāni, na cintetabbāni; yāni cintento ummādassa vighātassa bhāgī assā’’ti. Sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Dakkhiṇasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "78"
      },
      ". ‘‘Catasso imā, bhikkhave, dakkhiṇā visuddhiyo. Katamā catasso? Atthi, bhikkhave, dakkhiṇā dāyakato visujjhati, no paṭiggāhakato; atthi, bhikkhave, dakkhiṇā paṭiggāhakato visujjhati, no dāyakato; atthi, bhikkhave, dakkhiṇā neva dāyakato visujjhati, no paṭiggāhakato; atthi, bhikkhave, dakkhiṇā dāyakato ceva visujjhati paṭiggāhakato ca."
    ],
    "innerText": "78. ‘‘Catasso imā, bhikkhave, dakkhiṇā visuddhiyo. Katamā catasso? Atthi, bhikkhave, dakkhiṇā dāyakato visujjhati, no paṭiggāhakato; atthi, bhikkhave, dakkhiṇā paṭiggāhakato visujjhati, no dāyakato; atthi, bhikkhave, dakkhiṇā neva dāyakato visujjhati, no paṭiggāhakato; atthi, bhikkhave, dakkhiṇā dāyakato ceva visujjhati paṭiggāhakato ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca ",
      ", bhikkhave, dakkhiṇā dāyakato visujjhati, no paṭiggāhakato? Idha, bhikkhave, dāyako hoti sīlavā kalyāṇadhammo; paṭiggāhakā honti dussīlā pāpadhammā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[paṭiggāhako hoti dussīlo pāpadhammo (syā. kaṃ. ka.) ma. ni. 3.381 oloketabbaṃ]"
      },
      ". Evaṃ kho, bhikkhave, dakkhiṇā dāyakato visujjhati, no paṭiggāhakato."
    ],
    "innerText": "‘‘Kathañca , bhikkhave, dakkhiṇā dāyakato visujjhati, no paṭiggāhakato? Idha, bhikkhave, dāyako hoti sīlavā kalyāṇadhammo; paṭiggāhakā honti dussīlā pāpadhammā [paṭiggāhako hoti dussīlo pāpadhammo (syā. kaṃ. ka.) ma. ni. 3.381 oloketabbaṃ]. Evaṃ kho, bhikkhave, dakkhiṇā dāyakato visujjhati, no paṭiggāhakato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca ",
      ", bhikkhave, dakkhiṇā paṭiggāhakato visujjhati, no dāyakato? Idha, bhikkhave ",
      ", dāyako hoti dussīlo pāpadhammo; paṭiggāhakā honti sīlavanto kalyāṇadhammā. Evaṃ kho, bhikkhave, dakkhiṇā paṭiggāhakato visujjhati, no dāyakato."
    ],
    "innerText": "‘‘Kathañca , bhikkhave, dakkhiṇā paṭiggāhakato visujjhati, no dāyakato? Idha, bhikkhave , dāyako hoti dussīlo pāpadhammo; paṭiggāhakā honti sīlavanto kalyāṇadhammā. Evaṃ kho, bhikkhave, dakkhiṇā paṭiggāhakato visujjhati, no dāyakato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, dakkhiṇā neva dāyakato visujjhati, no paṭiggāhakato? Idha, bhikkhave, dāyako hoti dussīlo pāpadhammo; paṭiggāhakāpi honti dussīlā pāpadhammā. Evaṃ kho, bhikkhave, dakkhiṇā neva dāyakato visujjhati, no paṭiggāhakato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, dakkhiṇā dāyakato ceva visujjhati paṭiggāhakato ca? Idha, bhikkhave, dāyako hoti sīlavā kalyāṇadhammo; paṭiggāhakāpi honti sīlavanto kalyāṇadhammā. Evaṃ kho, bhikkhave, dakkhiṇā dāyakato ceva visujjhati paṭiggāhakato ca. Imā kho, bhikkhave, catasso dakkhiṇā visuddhiyo’’ti. Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Vaṇijjasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "79"
      },
      ". Atha kho āyasmā sāriputto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā sāriputto bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu ko paccayo, yena midhekaccassa tādisāva vaṇijjā payuttā chedagāminī hoti? Ko pana, bhante, hetu ko paccayo, yena midhekaccassa tādisāva vaṇijjā payuttā na yathādhippāyā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yathādhippāyaṃ (sī.)]"
      },
      " hoti? Ko nu kho, bhante hetu ko paccayo, yena midhekaccassa tādisāva vaṇijjā payuttā yathādhippāyā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yathādhippāyaṃ (sī.)]"
      },
      " hoti? Ko pana, bhante, hetu ko paccayo, yena ",
      " midhekaccassa tādisāva vaṇijjā payuttā parādhippāyā hotī’’ti?"
    ],
    "innerText": "79. Atha kho āyasmā sāriputto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā sāriputto bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu ko paccayo, yena midhekaccassa tādisāva vaṇijjā payuttā chedagāminī hoti? Ko pana, bhante, hetu ko paccayo, yena midhekaccassa tādisāva vaṇijjā payuttā na yathādhippāyā [yathādhippāyaṃ (sī.)] hoti? Ko nu kho, bhante hetu ko paccayo, yena midhekaccassa tādisāva vaṇijjā payuttā yathādhippāyā [yathādhippāyaṃ (sī.)] hoti? Ko pana, bhante, hetu ko paccayo, yena midhekaccassa tādisāva vaṇijjā payuttā parādhippāyā hotī’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idha, sāriputta, ekacco samaṇaṃ vā brāhmaṇaṃ vā upasaṅkamitvā pavāreti – ‘vadatu, bhante, paccayenā’ti. So yena ",
      " pavāreti taṃ na deti. So ce tato cuto itthattaṃ āgacchati, so yaññadeva vaṇijjaṃ payojeti, sāssa hoti chedagāminī."
    ],
    "innerText": "‘‘Idha, sāriputta, ekacco samaṇaṃ vā brāhmaṇaṃ vā upasaṅkamitvā pavāreti – ‘vadatu, bhante, paccayenā’ti. So yena pavāreti taṃ na deti. So ce tato cuto itthattaṃ āgacchati, so yaññadeva vaṇijjaṃ payojeti, sāssa hoti chedagāminī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idha ",
      " pana, sāriputta, ekacco samaṇaṃ vā brāhmaṇaṃ vā upasaṅkamitvā pavāreti – ‘vadatu ",
      ", bhante, paccayenā’ti. So yena pavāreti taṃ na yathādhippāyaṃ deti. So ce tato cuto itthattaṃ āgacchati, so yaññadeva vaṇijjaṃ payojeti, sāssa na hoti yathādhippāyā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yathādhippāyaṃ (sī. ka.)]"
      },
      "."
    ],
    "innerText": "‘‘Idha pana, sāriputta, ekacco samaṇaṃ vā brāhmaṇaṃ vā upasaṅkamitvā pavāreti – ‘vadatu , bhante, paccayenā’ti. So yena pavāreti taṃ na yathādhippāyaṃ deti. So ce tato cuto itthattaṃ āgacchati, so yaññadeva vaṇijjaṃ payojeti, sāssa na hoti yathādhippāyā [yathādhippāyaṃ (sī. ka.)]."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idha pana, sāriputta, ekacco samaṇaṃ vā brāhmaṇaṃ vā upasaṅkamitvā pavāreti – ‘vadatu, bhante, paccayenā’ti. So yena pavāreti taṃ yathādhippāyaṃ deti. So ce tato cuto itthattaṃ āgacchati, so yaññadeva vaṇijjaṃ payojeti, sāssa hoti yathādhippāyā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yathādhippāyaṃ (sī. ka.)]"
      },
      "."
    ],
    "innerText": "‘‘Idha pana, sāriputta, ekacco samaṇaṃ vā brāhmaṇaṃ vā upasaṅkamitvā pavāreti – ‘vadatu, bhante, paccayenā’ti. So yena pavāreti taṃ yathādhippāyaṃ deti. So ce tato cuto itthattaṃ āgacchati, so yaññadeva vaṇijjaṃ payojeti, sāssa hoti yathādhippāyā [yathādhippāyaṃ (sī. ka.)]."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idha, sāriputta, ekacco samaṇaṃ vā brāhmaṇaṃ vā upasaṅkamitvā pavāreti – ‘vadatu, bhante, paccayenā’ti. So yena pavāreti taṃ parādhippāyaṃ deti. So ce tato cuto itthattaṃ āgacchati, so yaññadeva vaṇijjaṃ payojeti, sāssa hoti parādhippāyā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[parādhippāyaṃ (ka.)]"
      },
      "."
    ],
    "innerText": "‘‘Idha, sāriputta, ekacco samaṇaṃ vā brāhmaṇaṃ vā upasaṅkamitvā pavāreti – ‘vadatu, bhante, paccayenā’ti. So yena pavāreti taṃ parādhippāyaṃ deti. So ce tato cuto itthattaṃ āgacchati, so yaññadeva vaṇijjaṃ payojeti, sāssa hoti parādhippāyā [parādhippāyaṃ (ka.)]."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ayaṃ kho, sāriputta, hetu ayaṃ paccayo, yena midhekaccassa tādisāva vaṇijjā payuttā chedagāminī hoti. Ayaṃ pana, sāriputta, hetu ayaṃ paccayo, yena midhekaccassa tādisāva vaṇijjā payuttā na yathādhippāyā hoti. Ayaṃ kho pana, sāriputta, hetu ayaṃ paccayo, yena midhekaccassa tādisāva vaṇijjā payuttā yathādhippāyā hoti. Ayaṃ pana, sāriputta, hetu ayaṃ paccayo, yena midhekaccassa tādisāva vaṇijjā ",
      " payuttā parādhippāyā hotī’’ti. Navamaṃ."
    ],
    "innerText": "‘‘Ayaṃ kho, sāriputta, hetu ayaṃ paccayo, yena midhekaccassa tādisāva vaṇijjā payuttā chedagāminī hoti. Ayaṃ pana, sāriputta, hetu ayaṃ paccayo, yena midhekaccassa tādisāva vaṇijjā payuttā na yathādhippāyā hoti. Ayaṃ kho pana, sāriputta, hetu ayaṃ paccayo, yena midhekaccassa tādisāva vaṇijjā payuttā yathādhippāyā hoti. Ayaṃ pana, sāriputta, hetu ayaṃ paccayo, yena midhekaccassa tādisāva vaṇijjā payuttā parādhippāyā hotī’’ti. Navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Kambojasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "80"
      },
      ". Ekaṃ samayaṃ bhagavā kosambiyaṃ viharati ghositārāme. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca –"
    ],
    "innerText": "80. Ekaṃ samayaṃ bhagavā kosambiyaṃ viharati ghositārāme. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ko nu kho, bhante, hetu ko paccayo, yena mātugāmo neva sabhāyaṃ nisīdati, na kammantaṃ payojeti, na kambojaṃ gacchatī’’ti? ‘‘Kodhano, ānanda, mātugāmo; issukī, ānanda, mātugāmo; maccharī ",
      ", ānanda, mātugāmo; duppañño, ānanda, mātugāmo – ayaṃ kho ",
      ", ānanda, hetu ",
      " ayaṃ paccayo, yena mātugāmo neva sabhāyaṃ nisīdati, na kammantaṃ payojeti, na kambojaṃ gacchatī’’ti. Dasamaṃ."
    ],
    "innerText": "‘‘Ko nu kho, bhante, hetu ko paccayo, yena mātugāmo neva sabhāyaṃ nisīdati, na kammantaṃ payojeti, na kambojaṃ gacchatī’’ti? ‘‘Kodhano, ānanda, mātugāmo; issukī, ānanda, mātugāmo; maccharī , ānanda, mātugāmo; duppañño, ānanda, mātugāmo – ayaṃ kho , ānanda, hetu ayaṃ paccayo, yena mātugāmo neva sabhāyaṃ nisīdati, na kammantaṃ payojeti, na kambojaṃ gacchatī’’ti. Dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Apaṇṇakavaggo tatiyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Padhānaṃ diṭṭhisappurisa, vadhukā dve ca honti aggāni;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kusināraacinteyyā, dakkhiṇā ca vaṇijjā kambojanti."
  }
]