[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "2. Nāthavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Senāsanasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "11"
      },
      ". ‘‘Pañcaṅgasamannāgato ",
      ", bhikkhave, bhikkhu pañcaṅgasamannāgataṃ senāsanaṃ sevamāno bhajamāno nacirasseva āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihareyya."
    ],
    "innerText": "11. ‘‘Pañcaṅgasamannāgato , bhikkhave, bhikkhu pañcaṅgasamannāgataṃ senāsanaṃ sevamāno bhajamāno nacirasseva āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihareyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, bhikkhu pañcaṅgasamannāgato hoti? Idha, bhikkhave, bhikkhu saddho hoti; saddahati tathāgatassa bodhiṃ – ‘itipi so bhagavā…pe… bhagavā’ti; appābādho hoti appātaṅko, samavepākiniyā gahaṇiyā samannāgato nātisītāya nāccuṇhāya majjhimāya padhānakkhamāya; asaṭho hoti amāyāvī, yathābhūtaṃ attānaṃ āvikattā satthari vā viññūsu vā sabrahmacārīsu; āraddhavīriyo ",
      " viharati, akusalānaṃ dhammānaṃ pahānāya, kusalānaṃ dhammānaṃ upasampadāya; thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu; paññavā hoti, udayatthagāminiyā paññāya samannāgato ariyāya nibbedhikāya sammā dukkhakkhayagāminiyā. Evaṃ kho, bhikkhave, bhikkhu pañcaṅgasamannāgato hoti."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu pañcaṅgasamannāgato hoti? Idha, bhikkhave, bhikkhu saddho hoti; saddahati tathāgatassa bodhiṃ – ‘itipi so bhagavā…pe… bhagavā’ti; appābādho hoti appātaṅko, samavepākiniyā gahaṇiyā samannāgato nātisītāya nāccuṇhāya majjhimāya padhānakkhamāya; asaṭho hoti amāyāvī, yathābhūtaṃ attānaṃ āvikattā satthari vā viññūsu vā sabrahmacārīsu; āraddhavīriyo viharati, akusalānaṃ dhammānaṃ pahānāya, kusalānaṃ dhammānaṃ upasampadāya; thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu; paññavā hoti, udayatthagāminiyā paññāya samannāgato ariyāya nibbedhikāya sammā dukkhakkhayagāminiyā. Evaṃ kho, bhikkhave, bhikkhu pañcaṅgasamannāgato hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, senāsanaṃ pañcaṅgasamannāgataṃ hoti? Idha, bhikkhave, senāsanaṃ nātidūraṃ hoti nāccāsannaṃ gamanāgamanasampannaṃ divā appākiṇṇaṃ rattiṃ appasaddaṃ appanigghosaṃ appaḍaṃsamakasavātātapasarīsapasamphassaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[appaḍaṃsa… siriṃsapasamphassaṃ (sī. syā. pī.)]"
      },
      "; tasmiṃ kho pana senāsane viharantassa appakasirena uppajjanti cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārā; tasmiṃ kho pana senāsane therā bhikkhū viharanti bahussutā āgatāgamā dhammadharā ",
      " vinayadharā mātikādharā; te kālena kālaṃ upasaṅkamitvā paripucchati paripañhati – ‘idaṃ, bhante, kathaṃ, imassa ko attho’ti; tassa te āyasmanto avivaṭañceva vivaranti anuttānīkatañca uttāniṃ karonti anekavihitesu ca kaṅkhāṭhāniyesu dhammesu kaṅkhaṃ paṭivinodenti. Evaṃ kho, bhikkhave, senāsanaṃ pañcaṅgasamannāgataṃ hoti. Pañcaṅgasamannāgato kho, bhikkhave, bhikkhu pañcaṅgasamannāgataṃ senāsanaṃ sevamāno ",
      " bhajamāno nacirasseva ",
      " āsavānaṃ khayā…pe… sacchikatvā upasampajja vihareyyā’’ti. Paṭhamaṃ."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, senāsanaṃ pañcaṅgasamannāgataṃ hoti? Idha, bhikkhave, senāsanaṃ nātidūraṃ hoti nāccāsannaṃ gamanāgamanasampannaṃ divā appākiṇṇaṃ rattiṃ appasaddaṃ appanigghosaṃ appaḍaṃsamakasavātātapasarīsapasamphassaṃ [appaḍaṃsa… siriṃsapasamphassaṃ (sī. syā. pī.)]; tasmiṃ kho pana senāsane viharantassa appakasirena uppajjanti cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārā; tasmiṃ kho pana senāsane therā bhikkhū viharanti bahussutā āgatāgamā dhammadharā vinayadharā mātikādharā; te kālena kālaṃ upasaṅkamitvā paripucchati paripañhati – ‘idaṃ, bhante, kathaṃ, imassa ko attho’ti; tassa te āyasmanto avivaṭañceva vivaranti anuttānīkatañca uttāniṃ karonti anekavihitesu ca kaṅkhāṭhāniyesu dhammesu kaṅkhaṃ paṭivinodenti. Evaṃ kho, bhikkhave, senāsanaṃ pañcaṅgasamannāgataṃ hoti. Pañcaṅgasamannāgato kho, bhikkhave, bhikkhu pañcaṅgasamannāgataṃ senāsanaṃ sevamāno bhajamāno nacirasseva āsavānaṃ khayā…pe… sacchikatvā upasampajja vihareyyā’’ti. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Pañcaṅgasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "12"
      },
      ". ‘‘Pañcaṅgavippahīno, bhikkhave, bhikkhu pañcaṅgasamannāgato imasmiṃ ",
      " dhammavinaye ‘kevalī vusitavā uttamapuriso’ti vuccati. Kathañca, bhikkhave, bhikkhu pañcaṅgavippahīno hoti? Idha, bhikkhave, bhikkhuno kāmacchando pahīno hoti, byāpādo pahīno hoti, thinamiddhaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[thīnamiddhaṃ (sī. syā. pī.)]"
      },
      " pahīnaṃ hoti, uddhaccakukkuccaṃ pahīnaṃ hoti, vicikicchā pahīnā hoti. Evaṃ kho, bhikkhave, bhikkhu pañcaṅgavippahīno hoti."
    ],
    "innerText": "12. ‘‘Pañcaṅgavippahīno, bhikkhave, bhikkhu pañcaṅgasamannāgato imasmiṃ dhammavinaye ‘kevalī vusitavā uttamapuriso’ti vuccati. Kathañca, bhikkhave, bhikkhu pañcaṅgavippahīno hoti? Idha, bhikkhave, bhikkhuno kāmacchando pahīno hoti, byāpādo pahīno hoti, thinamiddhaṃ [thīnamiddhaṃ (sī. syā. pī.)] pahīnaṃ hoti, uddhaccakukkuccaṃ pahīnaṃ hoti, vicikicchā pahīnā hoti. Evaṃ kho, bhikkhave, bhikkhu pañcaṅgavippahīno hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu pañcaṅgasamannāgato hoti? Idha, bhikkhave, bhikkhu asekhena sīlakkhandhena samannāgato hoti, asekhena samādhikkhandhena samannāgato hoti, asekhena paññākkhandhena samannāgato hoti, asekhena vimuttikkhandhena samannāgato hoti, asekhena vimuttiñāṇadassanakkhandhena samannāgato hoti. Evaṃ kho, bhikkhave, bhikkhu pañcaṅgasamannāgato hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Pañcaṅgavippahīno kho, bhikkhave, bhikkhu pañcaṅgasamannāgato imasmiṃ dhammavinaye ‘kevalī vusitavā uttamapuriso’ti vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kāmacchando ca byāpādo, thinamiddhañca bhikkhuno;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Uddhaccaṃ vicikicchā ca, sabbasova na vijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Asekhena ",
      " ca sīlena, asekhena samādhinā;"
    ],
    "innerText": "‘‘Asekhena ca sīlena, asekhena samādhinā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vimuttiyā ca sampanno, ñāṇena ca tathāvidho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Sa ve pañcaṅgasampanno, pañca aṅge ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pañcaṅgāni (syā.)]"
      },
      " vivajjayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vivajjiya (ka.)]"
      },
      ";"
    ],
    "innerText": "‘‘Sa ve pañcaṅgasampanno, pañca aṅge [pañcaṅgāni (syā.)] vivajjayaṃ [vivajjiya (ka.)];"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Imasmiṃ dhammavinaye, kevalī iti vuccatī’’ti. dutiyaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Saṃyojanasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "13"
      },
      ". ‘‘Dasayimāni ",
      ", bhikkhave, saṃyojanāni. Katamāni dasa? Pañcorambhāgiyāni ",
      " saṃyojanāni, pañcuddhambhāgiyāni saṃyojanāni. Katamāni pañcorambhāgiyāni ",
      " saṃyojanāni? Sakkāyadiṭṭhi, vicikicchā, sīlabbataparāmāso, kāmacchando, byāpādo – imāni pañcorambhāgiyāni saṃyojanāni."
    ],
    "innerText": "13. ‘‘Dasayimāni , bhikkhave, saṃyojanāni. Katamāni dasa? Pañcorambhāgiyāni saṃyojanāni, pañcuddhambhāgiyāni saṃyojanāni. Katamāni pañcorambhāgiyāni saṃyojanāni? Sakkāyadiṭṭhi, vicikicchā, sīlabbataparāmāso, kāmacchando, byāpādo – imāni pañcorambhāgiyāni saṃyojanāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamāni pañcuddhambhāgiyāni saṃyojanāni? Rūparāgo, arūparāgo, māno, uddhaccaṃ, avijjā – imāni pañcuddhambhāgiyāni saṃyojanāni. Imāni kho, bhikkhave, dasa saṃyojanānī’’ti. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Cetokhilasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "14"
      },
      ". ‘‘Yassa kassaci, bhikkhave, bhikkhussa vā bhikkhuniyā vā pañca cetokhilā appahīnā pañca cetasovinibandhā asamucchinnā, tassa yā ratti vā divaso vā āgacchati hāniyeva pāṭikaṅkhā kusalesu dhammesu no vuddhi."
    ],
    "innerText": "14. ‘‘Yassa kassaci, bhikkhave, bhikkhussa vā bhikkhuniyā vā pañca cetokhilā appahīnā pañca cetasovinibandhā asamucchinnā, tassa yā ratti vā divaso vā āgacchati hāniyeva pāṭikaṅkhā kusalesu dhammesu no vuddhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamassa pañca cetokhilā appahīnā honti? Idha, bhikkhave, bhikkhu satthari kaṅkhati vicikicchati nādhimuccati na sampasīdati. Yo so, bhikkhave, bhikkhu satthari kaṅkhati vicikicchati nādhimuccati na sampasīdati, tassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya. Yassa cittaṃ na namati ātappāya anuyogāya sātaccāya ",
      " padhānāya, evamassāyaṃ paṭhamo cetokhilo appahīno hoti."
    ],
    "innerText": "‘‘Katamassa pañca cetokhilā appahīnā honti? Idha, bhikkhave, bhikkhu satthari kaṅkhati vicikicchati nādhimuccati na sampasīdati. Yo so, bhikkhave, bhikkhu satthari kaṅkhati vicikicchati nādhimuccati na sampasīdati, tassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya. Yassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya, evamassāyaṃ paṭhamo cetokhilo appahīno hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhikkhave, bhikkhu dhamme kaṅkhati…pe… saṅghe kaṅkhati… sikkhāya kaṅkhati… sabrahmacārīsu kupito hoti anattamano āhatacitto khilajāto. Yo so, bhikkhave, bhikkhu sabrahmacārīsu kupito hoti anattamano āhatacitto khilajāto, tassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya. Yassa cittaṃ na namati ātappāya ",
      " anuyogāya sātaccāya padhānāya, evamassāyaṃ pañcamo cetokhilo appahīno hoti. Imassa pañca ",
      " cetokhilā appahīnā honti."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, bhikkhu dhamme kaṅkhati…pe… saṅghe kaṅkhati… sikkhāya kaṅkhati… sabrahmacārīsu kupito hoti anattamano āhatacitto khilajāto. Yo so, bhikkhave, bhikkhu sabrahmacārīsu kupito hoti anattamano āhatacitto khilajāto, tassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya. Yassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya, evamassāyaṃ pañcamo cetokhilo appahīno hoti. Imassa pañca cetokhilā appahīnā honti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamassa pañca cetasovinibandhā asamucchinnā honti? Idha, bhikkhave, bhikkhu kāmesu avītarāgo hoti avigatacchando avigatapemo avigatapipāso avigatapariḷāho avigatataṇho. Yo so, bhikkhave, bhikkhu kāmesu avītarāgo hoti avigatacchando avigatapemo avigatapipāso avigatapariḷāho avigatataṇho ",
      ", tassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya. Yassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya, evamassāyaṃ paṭhamo cetasovinibandho asamucchinno hoti."
    ],
    "innerText": "‘‘Katamassa pañca cetasovinibandhā asamucchinnā honti? Idha, bhikkhave, bhikkhu kāmesu avītarāgo hoti avigatacchando avigatapemo avigatapipāso avigatapariḷāho avigatataṇho. Yo so, bhikkhave, bhikkhu kāmesu avītarāgo hoti avigatacchando avigatapemo avigatapipāso avigatapariḷāho avigatataṇho , tassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya. Yassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya, evamassāyaṃ paṭhamo cetasovinibandho asamucchinno hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhikkhave, bhikkhu kāye avītarāgo hoti…pe… rūpe avītarāgo hoti…pe… yāvadatthaṃ udarāvadehakaṃ bhuñjitvā seyyasukhaṃ passasukhaṃ middhasukhaṃ anuyutto viharati… aññataraṃ devanikāyaṃ paṇidhāya brahmacariyaṃ carati – ‘imināhaṃ sīlena vā vatena vā tapena vā brahmacariyena vā devo vā bhavissāmi devaññataro vā’ti. Yo so, bhikkhave, bhikkhu aññataraṃ devanikāyaṃ paṇidhāya brahmacariyaṃ carati – ‘imināhaṃ sīlena vā vatena vā tapena vā brahmacariyena vā devo vā bhavissāmi devaññataro vā’ti, tassa cittaṃ na namati ātappāya ",
      " anuyogāya sātaccāya padhānāya. Yassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya, evamassāyaṃ pañcamo cetasovinibandho asamucchinno hoti. Imassa pañca cetasovinibandhā asamucchinnā honti."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, bhikkhu kāye avītarāgo hoti…pe… rūpe avītarāgo hoti…pe… yāvadatthaṃ udarāvadehakaṃ bhuñjitvā seyyasukhaṃ passasukhaṃ middhasukhaṃ anuyutto viharati… aññataraṃ devanikāyaṃ paṇidhāya brahmacariyaṃ carati – ‘imināhaṃ sīlena vā vatena vā tapena vā brahmacariyena vā devo vā bhavissāmi devaññataro vā’ti. Yo so, bhikkhave, bhikkhu aññataraṃ devanikāyaṃ paṇidhāya brahmacariyaṃ carati – ‘imināhaṃ sīlena vā vatena vā tapena vā brahmacariyena vā devo vā bhavissāmi devaññataro vā’ti, tassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya. Yassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya, evamassāyaṃ pañcamo cetasovinibandho asamucchinno hoti. Imassa pañca cetasovinibandhā asamucchinnā honti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yassa kassaci, bhikkhave, bhikkhussa vā bhikkhuniyā vā ime pañca cetokhilā appahīnā ime pañca ",
      " cetasovinibandhā asamucchinnā, tassa yā ratti vā divaso vā āgacchati hāniyeva pāṭikaṅkhā kusalesu dhammesu no vuddhi."
    ],
    "innerText": "‘‘Yassa kassaci, bhikkhave, bhikkhussa vā bhikkhuniyā vā ime pañca cetokhilā appahīnā ime pañca cetasovinibandhā asamucchinnā, tassa yā ratti vā divaso vā āgacchati hāniyeva pāṭikaṅkhā kusalesu dhammesu no vuddhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, bhikkhave, kāḷapakkhe candassa yā ratti vā divaso vā āgacchati, hāyateva vaṇṇena hāyati maṇḍalena hāyati ābhāya hāyati ārohapariṇāhena; evamevaṃ kho, bhikkhave, yassa kassaci bhikkhussa vā bhikkhuniyā vā ime pañca cetokhilā appahīnā ime ",
      " pañca cetasovinibandhā asamucchinnā, tassa yā ratti vā divaso vā āgacchati hāniyeva pāṭikaṅkhā kusalesu dhammesu no vuddhi."
    ],
    "innerText": "‘‘Seyyathāpi, bhikkhave, kāḷapakkhe candassa yā ratti vā divaso vā āgacchati, hāyateva vaṇṇena hāyati maṇḍalena hāyati ābhāya hāyati ārohapariṇāhena; evamevaṃ kho, bhikkhave, yassa kassaci bhikkhussa vā bhikkhuniyā vā ime pañca cetokhilā appahīnā ime pañca cetasovinibandhā asamucchinnā, tassa yā ratti vā divaso vā āgacchati hāniyeva pāṭikaṅkhā kusalesu dhammesu no vuddhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Yassa kassaci, bhikkhave, bhikkhussa vā bhikkhuniyā vā pañca cetokhilā pahīnā pañca cetasovinibandhā susamucchinnā, tassa yā ratti vā divaso vā āgacchati vuddhiyeva pāṭikaṅkhā kusalesu dhammesu no parihāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamassa ",
      " pañca cetokhilā pahīnā honti? Idha, bhikkhave, bhikkhu satthari na kaṅkhati na vicikicchati, adhimuccati sampasīdati. Yo so, bhikkhave, bhikkhu satthari na kaṅkhati na vicikicchati adhimuccati sampasīdati, tassa cittaṃ namati ātappāya anuyogāya sātaccāya padhānāya. Yassa cittaṃ namati ātappāya anuyogāya sātaccāya padhānāya, evamassāyaṃ paṭhamo cetokhilo pahīno hoti."
    ],
    "innerText": "‘‘Katamassa pañca cetokhilā pahīnā honti? Idha, bhikkhave, bhikkhu satthari na kaṅkhati na vicikicchati, adhimuccati sampasīdati. Yo so, bhikkhave, bhikkhu satthari na kaṅkhati na vicikicchati adhimuccati sampasīdati, tassa cittaṃ namati ātappāya anuyogāya sātaccāya padhānāya. Yassa cittaṃ namati ātappāya anuyogāya sātaccāya padhānāya, evamassāyaṃ paṭhamo cetokhilo pahīno hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhikkhave, bhikkhu dhamme na kaṅkhati…pe… saṅghe na kaṅkhati… sikkhāya na kaṅkhati ",
      "… sabrahmacārīsu na kupito hoti attamano na āhatacitto na khilajāto. Yo so, bhikkhave, bhikkhu sabrahmacārīsu na kupito hoti attamano na āhatacitto na khilajāto ",
      ", tassa cittaṃ namati ātappāya anuyogāya sātaccāya padhānāya. Yassa cittaṃ namati ātappāya anuyogāya sātaccāya padhānāya, evamassāyaṃ pañcamo cetokhilo pahīno hoti. Imassa pañca cetokhilā pahīnā honti."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, bhikkhu dhamme na kaṅkhati…pe… saṅghe na kaṅkhati… sikkhāya na kaṅkhati … sabrahmacārīsu na kupito hoti attamano na āhatacitto na khilajāto. Yo so, bhikkhave, bhikkhu sabrahmacārīsu na kupito hoti attamano na āhatacitto na khilajāto , tassa cittaṃ namati ātappāya anuyogāya sātaccāya padhānāya. Yassa cittaṃ namati ātappāya anuyogāya sātaccāya padhānāya, evamassāyaṃ pañcamo cetokhilo pahīno hoti. Imassa pañca cetokhilā pahīnā honti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamassa pañca cetasovinibandhā susamucchinnā honti? Idha, bhikkhave, bhikkhu kāmesu vītarāgo hoti vigatacchando vigatapemo vigatapipāso vigatapariḷāho vigatataṇho. Yo so, bhikkhave, bhikkhu kāmesu vītarāgo hoti vigatacchando vigatapemo vigatapipāso vigatapariḷāho vigatataṇho, tassa cittaṃ namati ātappāya anuyogāya sātaccāya padhānāya. Yassa cittaṃ namati ātappāya anuyogāya sātaccāya padhānāya, evamassāyaṃ paṭhamo cetasovinibandho susamucchinno hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhikkhave, bhikkhu kāye vītarāgo hoti…pe… rūpe vītarāgo hoti ",
      " …pe… na yāvadatthaṃ udarāvadehakaṃ bhuñjitvā seyyasukhaṃ passasukhaṃ middhasukhaṃ anuyutto viharati, na aññataraṃ devanikāyaṃ paṇidhāya brahmacariyaṃ carati – ‘imināhaṃ sīlena vā vatena vā tapena vā brahmacariyena vā devo vā bhavissāmi devaññataro vā’ti. Yo so, bhikkhave, bhikkhu na aññataraṃ devanikāyaṃ paṇidhāya…pe… devaññataro vāti, tassa cittaṃ namati ātappāya anuyogāya sātaccāya padhānāya. Yassa cittaṃ namati ātappāya anuyogāya sātaccāya padhānāya, evamassāyaṃ pañcamo cetasovinibandho ",
      " susamucchinno hoti. Imassa pañca ",
      " cetasovinibandhā susamucchinnā honti."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, bhikkhu kāye vītarāgo hoti…pe… rūpe vītarāgo hoti …pe… na yāvadatthaṃ udarāvadehakaṃ bhuñjitvā seyyasukhaṃ passasukhaṃ middhasukhaṃ anuyutto viharati, na aññataraṃ devanikāyaṃ paṇidhāya brahmacariyaṃ carati – ‘imināhaṃ sīlena vā vatena vā tapena vā brahmacariyena vā devo vā bhavissāmi devaññataro vā’ti. Yo so, bhikkhave, bhikkhu na aññataraṃ devanikāyaṃ paṇidhāya…pe… devaññataro vāti, tassa cittaṃ namati ātappāya anuyogāya sātaccāya padhānāya. Yassa cittaṃ namati ātappāya anuyogāya sātaccāya padhānāya, evamassāyaṃ pañcamo cetasovinibandho susamucchinno hoti. Imassa pañca cetasovinibandhā susamucchinnā honti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yassa kassaci, bhikkhave, bhikkhussa vā bhikkhuniyā vā ime pañca cetokhilā pahīnā ime pañca cetasovinibandhā susamucchinnā ",
      ", tassa yā ratti vā divaso vā āgacchati vuddhiyeva pāṭikaṅkhā kusalesu dhammesu no parihāni."
    ],
    "innerText": "‘‘Yassa kassaci, bhikkhave, bhikkhussa vā bhikkhuniyā vā ime pañca cetokhilā pahīnā ime pañca cetasovinibandhā susamucchinnā , tassa yā ratti vā divaso vā āgacchati vuddhiyeva pāṭikaṅkhā kusalesu dhammesu no parihāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Seyyathāpi, bhikkhave, juṇhapakkhe candassa yā ratti vā divaso vā āgacchati, vaḍḍhateva vaṇṇena vaḍḍhati maṇḍalena vaḍḍhati ābhāya vaḍḍhati ārohapariṇāhena; evamevaṃ kho, bhikkhave, yassa kassaci bhikkhussa vā bhikkhuniyā vā ime pañca cetokhilā pahīnā ime pañca cetasovinibandhā susamucchinnā, tassa yā ratti vā divaso vā āgacchati vuddhiyeva pāṭikaṅkhā kusalesu dhammesu no parihānī’’ti. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Appamādasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "15"
      },
      ". ‘‘Yāvatā, bhikkhave, sattā apadā vā dvipadā vā catuppadā vā bahuppadā vā rūpino vā arūpino vā saññino vā asaññino vā nevasaññināsaññino vā, tathāgato tesaṃ aggamakkhāyati arahaṃ sammāsambuddho; evamevaṃ kho, bhikkhave, ye keci kusalā dhammā, sabbe te appamādamūlakā appamādasamosaraṇā. Appamādo tesaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[tesaṃ dhammānaṃ (sī. ka.) saṃ. ni. 5.139]"
      },
      " aggamakkhāyati."
    ],
    "innerText": "15. ‘‘Yāvatā, bhikkhave, sattā apadā vā dvipadā vā catuppadā vā bahuppadā vā rūpino vā arūpino vā saññino vā asaññino vā nevasaññināsaññino vā, tathāgato tesaṃ aggamakkhāyati arahaṃ sammāsambuddho; evamevaṃ kho, bhikkhave, ye keci kusalā dhammā, sabbe te appamādamūlakā appamādasamosaraṇā. Appamādo tesaṃ [tesaṃ dhammānaṃ (sī. ka.) saṃ. ni. 5.139] aggamakkhāyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, bhikkhave, yāni kānici jaṅgalānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[jaṅgamānaṃ (sī. pī.) saṃ. ni. 5.139]"
      },
      " pāṇānaṃ padajātāni, sabbāni tāni hatthipade samodhānaṃ gacchanti, hatthipadaṃ tesaṃ aggamakkhāyati, yadidaṃ mahantattena; evamevaṃ kho, bhikkhave ",
      ", ye keci kusalā dhammā, sabbe te appamādamūlakā appamādasamosaraṇā. Appamādo tesaṃ aggamakkhāyati."
    ],
    "innerText": "‘‘Seyyathāpi, bhikkhave, yāni kānici jaṅgalānaṃ [jaṅgamānaṃ (sī. pī.) saṃ. ni. 5.139] pāṇānaṃ padajātāni, sabbāni tāni hatthipade samodhānaṃ gacchanti, hatthipadaṃ tesaṃ aggamakkhāyati, yadidaṃ mahantattena; evamevaṃ kho, bhikkhave , ye keci kusalā dhammā, sabbe te appamādamūlakā appamādasamosaraṇā. Appamādo tesaṃ aggamakkhāyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, bhikkhave, kūṭāgārassa yā kāci gopānasiyo ",
      " sabbā tā kūṭaṅgamā kūṭaninnā kūṭasamosaraṇā, kūṭo tāsaṃ aggamakkhāyati; evamevaṃ kho, bhikkhave, ye keci kusalā dhammā, sabbe te appamādamūlakā appamādasamosaraṇā. Appamādo tesaṃ aggamakkhāyati."
    ],
    "innerText": "‘‘Seyyathāpi, bhikkhave, kūṭāgārassa yā kāci gopānasiyo sabbā tā kūṭaṅgamā kūṭaninnā kūṭasamosaraṇā, kūṭo tāsaṃ aggamakkhāyati; evamevaṃ kho, bhikkhave, ye keci kusalā dhammā, sabbe te appamādamūlakā appamādasamosaraṇā. Appamādo tesaṃ aggamakkhāyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi ",
      ", bhikkhave, ye keci mūlagandhā, kāḷānusāriyaṃ tesaṃ aggamakkhāyati; evamevaṃ kho bhikkhave…pe…."
    ],
    "innerText": "‘‘Seyyathāpi , bhikkhave, ye keci mūlagandhā, kāḷānusāriyaṃ tesaṃ aggamakkhāyati; evamevaṃ kho bhikkhave…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Seyyathāpi, bhikkhave, ye keci sāragandhā, lohitacandanaṃ tesaṃ aggamakkhāyati; evamevaṃ kho bhikkhave…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Seyyathāpi, bhikkhave, ye keci pupphagandhā, vassikaṃ tesaṃ aggamakkhāyati; evamevaṃ kho bhikkhave…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, bhikkhave, ye keci khuddarājāno ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kuḍḍarājāno (sī. syā. pī.), kuṭṭarājāno, kūṭarājāno (ka.) a. ni. 6.53]"
      },
      ", sabbe te rañño cakkavattissa anuyantā bhavanti, rājā tesaṃ cakkavattī aggamakkhāyati; evamevaṃ kho, bhikkhave…pe…."
    ],
    "innerText": "‘‘Seyyathāpi, bhikkhave, ye keci khuddarājāno [kuḍḍarājāno (sī. syā. pī.), kuṭṭarājāno, kūṭarājāno (ka.) a. ni. 6.53], sabbe te rañño cakkavattissa anuyantā bhavanti, rājā tesaṃ cakkavattī aggamakkhāyati; evamevaṃ kho, bhikkhave…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Seyyathāpi, bhikkhave, yā kāci tārakarūpānaṃ pabhā, sabbā tā candappabhāya kalaṃ nāgghanti soḷasiṃ, candappabhā tāsaṃ aggamakkhāyati; evamevaṃ kho, bhikkhave…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, bhikkhave, saradasamaye viddhe vigatavalāhake deve ādicco nabhaṃ abbhussakkamāno ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[abbhussukkamāno (sī.) saṃ. ni. 5.146-148]"
      },
      " sabbaṃ ākāsagataṃ tamagataṃ abhivihacca bhāsate ca tapate ca virocati ca; evamevaṃ kho, bhikkhave…pe…."
    ],
    "innerText": "‘‘Seyyathāpi, bhikkhave, saradasamaye viddhe vigatavalāhake deve ādicco nabhaṃ abbhussakkamāno [abbhussukkamāno (sī.) saṃ. ni. 5.146-148] sabbaṃ ākāsagataṃ tamagataṃ abhivihacca bhāsate ca tapate ca virocati ca; evamevaṃ kho, bhikkhave…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi ",
      ", bhikkhave, yā kāci mahānadiyo, seyyathidaṃ – gaṅgā, yamunā, aciravatī, sarabhū, mahī, sabbā tā samuddaṅgamā samuddaninnā samuddapoṇā samuddapabbhārā, mahāsamuddo tāsaṃ aggamakkhāyati; evamevaṃ kho, bhikkhave, ye keci kusalā dhammā, sabbe te appamādamūlakā appamādasamosaraṇā. Appamādo tesaṃ aggamakkhāyatī’’ti. Pañcamaṃ."
    ],
    "innerText": "‘‘Seyyathāpi , bhikkhave, yā kāci mahānadiyo, seyyathidaṃ – gaṅgā, yamunā, aciravatī, sarabhū, mahī, sabbā tā samuddaṅgamā samuddaninnā samuddapoṇā samuddapabbhārā, mahāsamuddo tāsaṃ aggamakkhāyati; evamevaṃ kho, bhikkhave, ye keci kusalā dhammā, sabbe te appamādamūlakā appamādasamosaraṇā. Appamādo tesaṃ aggamakkhāyatī’’ti. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Āhuneyyasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "16"
      },
      ". ‘‘Dasayime ",
      ", bhikkhave, puggalā āhuneyyā pāhuneyyā dakkhiṇeyyā añjalikaraṇīyā anuttaraṃ puññakkhettaṃ lokassa. Katame dasa? Tathāgato arahaṃ sammāsambuddho, paccekabuddho, ubhatobhāgavimutto, paññāvimutto, kāyasakkhī, diṭṭhippatto, saddhāvimutto, saddhānusārī, dhammānusārī, gotrabhū – ime kho, bhikkhave, dasa puggalā āhuneyyā…pe… anuttaraṃ puññakkhettaṃ lokassā’’ti. Chaṭṭhaṃ."
    ],
    "innerText": "16. ‘‘Dasayime , bhikkhave, puggalā āhuneyyā pāhuneyyā dakkhiṇeyyā añjalikaraṇīyā anuttaraṃ puññakkhettaṃ lokassa. Katame dasa? Tathāgato arahaṃ sammāsambuddho, paccekabuddho, ubhatobhāgavimutto, paññāvimutto, kāyasakkhī, diṭṭhippatto, saddhāvimutto, saddhānusārī, dhammānusārī, gotrabhū – ime kho, bhikkhave, dasa puggalā āhuneyyā…pe… anuttaraṃ puññakkhettaṃ lokassā’’ti. Chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Paṭhamanāthasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "17"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[dī. ni. 3.345, 360]"
      },
      " ‘‘Sanāthā ",
      ", bhikkhave, viharatha, mā anāthā. Dukkhaṃ, bhikkhave, anātho viharati. Dasayime, bhikkhave, nāthakaraṇā dhammā. Katame dasa? Idha, bhikkhave, bhikkhu sīlavā hoti, pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu. Yampi, bhikkhave, bhikkhu sīlavā hoti…pe… samādāya sikkhati sikkhāpadesu, ayampi dhammo nāthakaraṇo."
    ],
    "innerText": "17.[dī. ni. 3.345, 360] ‘‘Sanāthā , bhikkhave, viharatha, mā anāthā. Dukkhaṃ, bhikkhave, anātho viharati. Dasayime, bhikkhave, nāthakaraṇā dhammā. Katame dasa? Idha, bhikkhave, bhikkhu sīlavā hoti, pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu. Yampi, bhikkhave, bhikkhu sīlavā hoti…pe… samādāya sikkhati sikkhāpadesu, ayampi dhammo nāthakaraṇo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhikkhave, bhikkhu bahussuto hoti sutadharo sutasannicayo, ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṃ sabyañjanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sātthā sabyañjanā (sī.)]"
      },
      " kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpāssa dhammā bahussutā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[bahū sutā (?)]"
      },
      " honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā. Yampi, bhikkhave, bhikkhu bahussuto hoti…pe… diṭṭhiyā suppaṭividdhā, ayampi dhammo nāthakaraṇo."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, bhikkhu bahussuto hoti sutadharo sutasannicayo, ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṃ sabyañjanaṃ [sātthā sabyañjanā (sī.)] kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpāssa dhammā bahussutā [bahū sutā (?)] honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā. Yampi, bhikkhave, bhikkhu bahussuto hoti…pe… diṭṭhiyā suppaṭividdhā, ayampi dhammo nāthakaraṇo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhikkhave, bhikkhu kalyāṇamitto hoti kalyāṇasahāyo ",
      " kalyāṇasampavaṅko ",
      ". Yampi, bhikkhave, bhikkhu kalyāṇamitto hoti kalyāṇasahāyo kalyāṇasampavaṅko, ayampi dhammo nāthakaraṇo ",
      "."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, bhikkhu kalyāṇamitto hoti kalyāṇasahāyo kalyāṇasampavaṅko . Yampi, bhikkhave, bhikkhu kalyāṇamitto hoti kalyāṇasahāyo kalyāṇasampavaṅko, ayampi dhammo nāthakaraṇo ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, bhikkhave, bhikkhu suvaco hoti sovacassakaraṇehi dhammehi samannāgato, khamo padakkhiṇaggāhī anusāsaniṃ. Yampi, bhikkhave, bhikkhu suvaco hoti…pe… anusāsaniṃ, ayampi dhammo nāthakaraṇo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, bhikkhave, bhikkhu yāni tāni sabrahmacārīnaṃ uccāvacāni kiṃkaraṇīyāni, tattha dakkho hoti analaso tatrūpāyāya vīmaṃsāya samannāgato, alaṃ kātuṃ alaṃ saṃvidhātuṃ. Yampi, bhikkhave, bhikkhu yāni tāni sabrahmacārīnaṃ…pe… alaṃ kātuṃ alaṃ saṃvidhātuṃ, ayampi dhammo nāthakaraṇo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhikkhave, bhikkhu dhammakāmo hoti piyasamudāhāro, abhidhamme abhivinaye uḷārapāmojjo. Yampi, bhikkhave, bhikkhu dhammakāmo hoti ",
      " piyasamudāhāro, abhidhamme abhivinaye uḷārapāmojjo, ayampi dhammo nāthakaraṇo."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, bhikkhu dhammakāmo hoti piyasamudāhāro, abhidhamme abhivinaye uḷārapāmojjo. Yampi, bhikkhave, bhikkhu dhammakāmo hoti piyasamudāhāro, abhidhamme abhivinaye uḷārapāmojjo, ayampi dhammo nāthakaraṇo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, bhikkhave, bhikkhu āraddhavīriyo viharati akusalānaṃ dhammānaṃ pahānāya, kusalānaṃ dhammānaṃ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. Yampi, bhikkhave, bhikkhu āraddhavīriyo viharati akusalānaṃ dhammānaṃ pahānāya, kusalānaṃ dhammānaṃ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu, ayampi dhammo nāthakaraṇo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna ",
      " caparaṃ, bhikkhave, bhikkhu santuṭṭho hoti itarītaracīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārena. Yampi, bhikkhave, bhikkhu santuṭṭho hoti itarītaracīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārena, ayampi dhammo nāthakaraṇo."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, bhikkhu santuṭṭho hoti itarītaracīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārena. Yampi, bhikkhave, bhikkhu santuṭṭho hoti itarītaracīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārena, ayampi dhammo nāthakaraṇo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhikkhave, bhikkhu satimā hoti ",
      " paramena satinepakkena samannāgato cirakatampi cirabhāsitampi saritā anussaritā. Yampi, bhikkhave, bhikkhu satimā hoti paramena ",
      " satinepakkena samannāgato cirakatampi cirabhāsitampi saritā anussaritā, ayampi dhammo nāthakaraṇo."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, bhikkhu satimā hoti paramena satinepakkena samannāgato cirakatampi cirabhāsitampi saritā anussaritā. Yampi, bhikkhave, bhikkhu satimā hoti paramena satinepakkena samannāgato cirakatampi cirabhāsitampi saritā anussaritā, ayampi dhammo nāthakaraṇo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, bhikkhave, bhikkhu paññavā hoti udayatthagāminiyā paññāya samannāgato ariyāya nibbedhikāya sammā dukkhakkhayagāminiyā. Yampi, bhikkhave, bhikkhu paññavā hoti udayatthagāminiyā paññāya samannāgato ariyāya nibbedhikāya sammā dukkhakkhayagāminiyā, ayampi dhammo nāthakaraṇo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sanāthā, bhikkhave, viharatha, mā anāthā. Dukkhaṃ, bhikkhave, anātho viharati. Ime kho, bhikkhave, dasa nāthakaraṇā dhammā’’ti. Sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Dutiyanāthasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "18"
      },
      ". Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –"
    ],
    "innerText": "18. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sanāthā ",
      ", bhikkhave, viharatha, mā anāthā. Dukkhaṃ, bhikkhave, anātho viharati. Dasayime, bhikkhave, nāthakaraṇā dhammā. Katame dasa? Idha, bhikkhave, bhikkhu sīlavā hoti…pe… samādāya sikkhati sikkhāpadesu. ‘Sīlavā vatāyaṃ bhikkhu pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesū’ti therāpi naṃ bhikkhū vattabbaṃ ",
      " anusāsitabbaṃ maññanti, majjhimāpi bhikkhū… navāpi bhikkhū vattabbaṃ anusāsitabbaṃ maññanti. Tassa therānukampitassa majjhimānukampitassa navānukampitassa vuddhiyeva pāṭikaṅkhā kusalesu dhammesu, no parihāni. Ayampi dhammo nāthakaraṇo."
    ],
    "innerText": "‘‘Sanāthā , bhikkhave, viharatha, mā anāthā. Dukkhaṃ, bhikkhave, anātho viharati. Dasayime, bhikkhave, nāthakaraṇā dhammā. Katame dasa? Idha, bhikkhave, bhikkhu sīlavā hoti…pe… samādāya sikkhati sikkhāpadesu. ‘Sīlavā vatāyaṃ bhikkhu pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesū’ti therāpi naṃ bhikkhū vattabbaṃ anusāsitabbaṃ maññanti, majjhimāpi bhikkhū… navāpi bhikkhū vattabbaṃ anusāsitabbaṃ maññanti. Tassa therānukampitassa majjhimānukampitassa navānukampitassa vuddhiyeva pāṭikaṅkhā kusalesu dhammesu, no parihāni. Ayampi dhammo nāthakaraṇo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhikkhave, bhikkhu bahussuto hoti…pe… diṭṭhiyā suppaṭividdhā. ‘Bahussuto vatāyaṃ bhikkhu sutadharo sutasannicayo, ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā ",
      " sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpāssa dhammā bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā’ti therāpi naṃ bhikkhū vattabbaṃ anusāsitabbaṃ maññanti, majjhimāpi bhikkhū… navāpi bhikkhū vattabbaṃ anusāsitabbaṃ maññanti. Tassa therānukampitassa majjhimānukampitassa navānukampitassa vuddhiyeva pāṭikaṅkhā kusalesu dhammesu, no parihāni. Ayampi dhammo nāthakaraṇo."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, bhikkhu bahussuto hoti…pe… diṭṭhiyā suppaṭividdhā. ‘Bahussuto vatāyaṃ bhikkhu sutadharo sutasannicayo, ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpāssa dhammā bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā’ti therāpi naṃ bhikkhū vattabbaṃ anusāsitabbaṃ maññanti, majjhimāpi bhikkhū… navāpi bhikkhū vattabbaṃ anusāsitabbaṃ maññanti. Tassa therānukampitassa majjhimānukampitassa navānukampitassa vuddhiyeva pāṭikaṅkhā kusalesu dhammesu, no parihāni. Ayampi dhammo nāthakaraṇo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, bhikkhave, bhikkhu kalyāṇamitto hoti kalyāṇasahāyo kalyāṇasampavaṅko. ‘Kalyāṇamitto vatāyaṃ bhikkhu kalyāṇasahāyo kalyāṇasampavaṅko’ti therāpi naṃ bhikkhū vattabbaṃ anusāsitabbaṃ maññanti, majjhimāpi bhikkhū… navāpi bhikkhū vattabbaṃ anusāsitabbaṃ maññanti. Tassa therānukampitassa majjhimānukampitassa navānukampitassa vuddhiyeva pāṭikaṅkhā kusalesu dhammesu, no parihāni. Ayampi dhammo nāthakaraṇo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhikkhave, bhikkhu suvaco hoti sovacassakaraṇehi dhammehi samannāgato, khamo padakkhiṇaggāhī anusāsaniṃ. ‘Suvaco vatāyaṃ bhikkhu sovacassakaraṇehi dhammehi samannāgato, khamo padakkhiṇaggāhī anusāsani’nti therāpi naṃ bhikkhū vattabbaṃ anusāsitabbaṃ ",
      " maññanti, majjhimāpi bhikkhū… navāpi bhikkhū vattabbaṃ anusāsitabbaṃ maññanti. Tassa therānukampitassa majjhimānukampitassa ",
      " navānukampitassa vuddhiyeva pāṭikaṅkhā kusalesu dhammesu, no parihāni. Ayampi dhammo nāthakaraṇo."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, bhikkhu suvaco hoti sovacassakaraṇehi dhammehi samannāgato, khamo padakkhiṇaggāhī anusāsaniṃ. ‘Suvaco vatāyaṃ bhikkhu sovacassakaraṇehi dhammehi samannāgato, khamo padakkhiṇaggāhī anusāsani’nti therāpi naṃ bhikkhū vattabbaṃ anusāsitabbaṃ maññanti, majjhimāpi bhikkhū… navāpi bhikkhū vattabbaṃ anusāsitabbaṃ maññanti. Tassa therānukampitassa majjhimānukampitassa navānukampitassa vuddhiyeva pāṭikaṅkhā kusalesu dhammesu, no parihāni. Ayampi dhammo nāthakaraṇo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhikkhave, bhikkhu yāni tāni sabrahmacārīnaṃ uccāvacāni ",
      " kiṃkaraṇīyāni, tattha dakkho hoti analaso, tatrūpāyāya vīmaṃsāya samannāgato, alaṃ kātuṃ alaṃ saṃvidhātuṃ. ‘Yāni tāni sabrahmacārīnaṃ uccāvacāni kiṃkaraṇīyāni, tattha dakkho vatāyaṃ bhikkhu analaso, tatrūpāyāya vīmaṃsāya samannāgato, alaṃ kātuṃ alaṃ saṃvidhātu’nti therāpi naṃ bhikkhū vattabbaṃ anusāsitabbaṃ maññanti, majjhimāpi bhikkhū… navāpi bhikkhū vattabbaṃ anusāsitabbaṃ maññanti. Tassa therānukampitassa majjhimānukampitassa navānukampitassa vuddhiyeva pāṭikaṅkhā kusalesu dhammesu, no parihāni. Ayampi dhammo nāthakaraṇo."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, bhikkhu yāni tāni sabrahmacārīnaṃ uccāvacāni kiṃkaraṇīyāni, tattha dakkho hoti analaso, tatrūpāyāya vīmaṃsāya samannāgato, alaṃ kātuṃ alaṃ saṃvidhātuṃ. ‘Yāni tāni sabrahmacārīnaṃ uccāvacāni kiṃkaraṇīyāni, tattha dakkho vatāyaṃ bhikkhu analaso, tatrūpāyāya vīmaṃsāya samannāgato, alaṃ kātuṃ alaṃ saṃvidhātu’nti therāpi naṃ bhikkhū vattabbaṃ anusāsitabbaṃ maññanti, majjhimāpi bhikkhū… navāpi bhikkhū vattabbaṃ anusāsitabbaṃ maññanti. Tassa therānukampitassa majjhimānukampitassa navānukampitassa vuddhiyeva pāṭikaṅkhā kusalesu dhammesu, no parihāni. Ayampi dhammo nāthakaraṇo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna ",
      " caparaṃ, bhikkhave, bhikkhu dhammakāmo hoti piyasamudāhāro, abhidhamme abhivinaye uḷārapāmojjo. ‘Dhammakāmo vatāyaṃ bhikkhu piyasamudāhāro, abhidhamme abhivinaye uḷārapāmojjo’ti therāpi naṃ bhikkhū vattabbaṃ anusāsitabbaṃ maññanti, majjhimāpi bhikkhū… navāpi bhikkhū vattabbaṃ anusāsitabbaṃ maññanti. Tassa therānukampitassa majjhimānukampitassa navānukampitassa vuddhiyeva pāṭikaṅkhā kusalesu dhammesu, no parihāni. Ayampi dhammo nāthakaraṇo."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, bhikkhu dhammakāmo hoti piyasamudāhāro, abhidhamme abhivinaye uḷārapāmojjo. ‘Dhammakāmo vatāyaṃ bhikkhu piyasamudāhāro, abhidhamme abhivinaye uḷārapāmojjo’ti therāpi naṃ bhikkhū vattabbaṃ anusāsitabbaṃ maññanti, majjhimāpi bhikkhū… navāpi bhikkhū vattabbaṃ anusāsitabbaṃ maññanti. Tassa therānukampitassa majjhimānukampitassa navānukampitassa vuddhiyeva pāṭikaṅkhā kusalesu dhammesu, no parihāni. Ayampi dhammo nāthakaraṇo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhikkhave, bhikkhu āraddhavīriyo viharati akusalānaṃ dhammānaṃ pahānāya, kusalānaṃ dhammānaṃ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu ‘āraddhavīriyo vatāyaṃ bhikkhu viharati akusalānaṃ dhammānaṃ pahānāya, kusalānaṃ ",
      " dhammānaṃ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesū’ti therāpi naṃ bhikkhū vattabbaṃ anusāsitabbaṃ maññanti, majjhimāpi bhikkhū… navāpi bhikkhū vattabbaṃ anusāsitabbaṃ maññanti ",
      ". Tassa therānukampitassa majjhimānukampitassa navānukampitassa vuddhiyeva pāṭikaṅkhā kusalesu dhammesu, no parihāni. Ayampi dhammo nāthakaraṇo."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, bhikkhu āraddhavīriyo viharati akusalānaṃ dhammānaṃ pahānāya, kusalānaṃ dhammānaṃ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu ‘āraddhavīriyo vatāyaṃ bhikkhu viharati akusalānaṃ dhammānaṃ pahānāya, kusalānaṃ dhammānaṃ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesū’ti therāpi naṃ bhikkhū vattabbaṃ anusāsitabbaṃ maññanti, majjhimāpi bhikkhū… navāpi bhikkhū vattabbaṃ anusāsitabbaṃ maññanti . Tassa therānukampitassa majjhimānukampitassa navānukampitassa vuddhiyeva pāṭikaṅkhā kusalesu dhammesu, no parihāni. Ayampi dhammo nāthakaraṇo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhikkhave, bhikkhu santuṭṭho hoti itarītaracīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārena. ‘Santuṭṭho vatāyaṃ bhikkhu itarītaracīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārenā’ti therāpi ",
      " naṃ bhikkhū vattabbaṃ anusāsitabbaṃ maññanti, majjhimāpi bhikkhū… navāpi bhikkhū vattabbaṃ anusāsitabbaṃ maññanti. Tassa therānukampitassa majjhimānukampitassa navānukampitassa vuddhiyeva pāṭikaṅkhā kusalesu dhammesu, no parihāni. Ayampi dhammo nāthakaraṇo."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, bhikkhu santuṭṭho hoti itarītaracīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārena. ‘Santuṭṭho vatāyaṃ bhikkhu itarītaracīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārenā’ti therāpi naṃ bhikkhū vattabbaṃ anusāsitabbaṃ maññanti, majjhimāpi bhikkhū… navāpi bhikkhū vattabbaṃ anusāsitabbaṃ maññanti. Tassa therānukampitassa majjhimānukampitassa navānukampitassa vuddhiyeva pāṭikaṅkhā kusalesu dhammesu, no parihāni. Ayampi dhammo nāthakaraṇo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, bhikkhave, bhikkhu satimā hoti paramena satinepakkena samannāgato, cirakatampi cirabhāsitampi saritā anussaritā. ‘Satimā vatāyaṃ bhikkhu paramena satinepakkena samannāgato, cirakatampi cirabhāsitampi saritā anussaritā’ti therāpi naṃ bhikkhū vattabbaṃ anusāsitabbaṃ maññanti, majjhimāpi bhikkhū… navāpi bhikkhū vattabbaṃ anusāsitabbaṃ maññanti. Tassa therānukampitassa majjhimānukampitassa navānukampitassa vuddhiyeva pāṭikaṅkhā kusalesu dhammesu, no parihāni. Ayampi dhammo nāthakaraṇo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna ",
      " caparaṃ, bhikkhave, bhikkhu paññavā hoti udayatthagāminiyā paññāya samannāgato ariyāya nibbedhikāya sammā dukkhakkhayagāminiyā. ‘Paññavā vatāyaṃ bhikkhu udayatthagāminiyā paññāya samannāgato ariyāya nibbedhikāya sammā dukkhakkhayagāminiyā’ti therāpi naṃ bhikkhū vattabbaṃ anusāsitabbaṃ maññanti, majjhimāpi bhikkhū… navāpi ",
      " bhikkhū vattabbaṃ anusāsitabbaṃ ",
      " maññanti. Tassa therānukampitassa…pe… no parihāni. Ayampi dhammo nāthakaraṇo."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, bhikkhu paññavā hoti udayatthagāminiyā paññāya samannāgato ariyāya nibbedhikāya sammā dukkhakkhayagāminiyā. ‘Paññavā vatāyaṃ bhikkhu udayatthagāminiyā paññāya samannāgato ariyāya nibbedhikāya sammā dukkhakkhayagāminiyā’ti therāpi naṃ bhikkhū vattabbaṃ anusāsitabbaṃ maññanti, majjhimāpi bhikkhū… navāpi bhikkhū vattabbaṃ anusāsitabbaṃ maññanti. Tassa therānukampitassa…pe… no parihāni. Ayampi dhammo nāthakaraṇo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sanāthā, bhikkhave, viharatha, mā anāthā. Dukkhaṃ, bhikkhave, anātho viharati. Ime kho, bhikkhave, dasa nāthakaraṇā dhammā’’ti. Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṃ abhinandunti. Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Paṭhamaariyāvāsasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "19"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[dī. ni. 3.348, 360]"
      },
      " ‘‘Dasayime, bhikkhave, ariyāvāsā, ye ariyā āvasiṃsu vā āvasanti vā āvasissanti vā. Katame dasa? Idha, bhikkhave, bhikkhu pañcaṅgavippahīno hoti, chaḷaṅgasamannāgato, ekārakkho, caturāpasseno, paṇunnapaccekasacco ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[panuṇṇapaccekasacco (ka.)]"
      },
      ", samavayasaṭṭhesano, anāvilasaṅkappo, passaddhakāyasaṅkhāro, suvimuttacitto, suvimuttapañño. Ime kho, bhikkhave, dasa ariyāvāsā ",
      ", ye ariyā āvasiṃsu vā āvasanti vā āvasissanti vā’’ti. Navamaṃ."
    ],
    "innerText": "19.[dī. ni. 3.348, 360] ‘‘Dasayime, bhikkhave, ariyāvāsā, ye ariyā āvasiṃsu vā āvasanti vā āvasissanti vā. Katame dasa? Idha, bhikkhave, bhikkhu pañcaṅgavippahīno hoti, chaḷaṅgasamannāgato, ekārakkho, caturāpasseno, paṇunnapaccekasacco [panuṇṇapaccekasacco (ka.)], samavayasaṭṭhesano, anāvilasaṅkappo, passaddhakāyasaṅkhāro, suvimuttacitto, suvimuttapañño. Ime kho, bhikkhave, dasa ariyāvāsā , ye ariyā āvasiṃsu vā āvasanti vā āvasissanti vā’’ti. Navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Dutiyaariyāvāsasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "20"
      },
      ". Ekaṃ samayaṃ bhagavā kurūsu viharati kammāsadhammaṃ ",
      " nāma kurūnaṃ nigamo. Tatra kho bhagavā bhikkhū āmantesi…pe…."
    ],
    "innerText": "20. Ekaṃ samayaṃ bhagavā kurūsu viharati kammāsadhammaṃ nāma kurūnaṃ nigamo. Tatra kho bhagavā bhikkhū āmantesi…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Dasayime, bhikkhave, ariyāvāsā, ye ariyā āvasiṃsu vā āvasanti vā āvasissanti vā. Katame dasa? Idha, bhikkhave, bhikkhu pañcaṅgavippahīno hoti, chaḷaṅgasamannāgato ",
      ", ekārakkho, caturāpasseno, paṇunnapaccekasacco, samavayasaṭṭhesano, anāvilasaṅkappo, passaddhakāyasaṅkhāro, suvimuttacitto, suvimuttapañño."
    ],
    "innerText": "‘‘Dasayime, bhikkhave, ariyāvāsā, ye ariyā āvasiṃsu vā āvasanti vā āvasissanti vā. Katame dasa? Idha, bhikkhave, bhikkhu pañcaṅgavippahīno hoti, chaḷaṅgasamannāgato , ekārakkho, caturāpasseno, paṇunnapaccekasacco, samavayasaṭṭhesano, anāvilasaṅkappo, passaddhakāyasaṅkhāro, suvimuttacitto, suvimuttapañño."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, bhikkhu pañcaṅgavippahīno hoti? Idha, bhikkhave, bhikkhuno kāmacchando ",
      " pahīno hoti, byāpādo pahīno hoti, thinamiddhaṃ pahīnaṃ hoti, uddhaccakukkuccaṃ pahīnaṃ hoti, vicikicchā pahīnā hoti. Evaṃ kho, bhikkhave, bhikkhu pañcaṅgavippahīno hoti."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu pañcaṅgavippahīno hoti? Idha, bhikkhave, bhikkhuno kāmacchando pahīno hoti, byāpādo pahīno hoti, thinamiddhaṃ pahīnaṃ hoti, uddhaccakukkuccaṃ pahīnaṃ hoti, vicikicchā pahīnā hoti. Evaṃ kho, bhikkhave, bhikkhu pañcaṅgavippahīno hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu chaḷaṅgasamannāgato hoti? Idha, bhikkhave, bhikkhu cakkhunā rūpaṃ disvā neva sumano hoti na dummano, upekkhako viharati sato sampajāno. Sotena saddaṃ sutvā… ghānena gandhaṃ ghāyitvā… jivhāya rasaṃ sāyitvā… kāyena phoṭṭhabbaṃ phusitvā… manasā dhammaṃ viññāya neva sumano hoti na dummano, upekkhako viharati sato sampajāno. Evaṃ kho, bhikkhave, bhikkhu chaḷaṅgasamannāgato hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu ekārakkho hoti? Idha, bhikkhave, bhikkhu satārakkhena cetasā samannāgato hoti. Evaṃ kho, bhikkhave, bhikkhu ekārakkho hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu caturāpasseno hoti? Idha, bhikkhave, bhikkhu saṅkhāyekaṃ paṭisevati, saṅkhāyekaṃ adhivāseti, saṅkhāyekaṃ parivajjeti, saṅkhāyekaṃ vinodeti. Evaṃ kho, bhikkhave, bhikkhu caturāpasseno hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca ",
      ", bhikkhave, bhikkhu paṇunnapaccekasacco hoti? Idha, bhikkhave, bhikkhuno yāni tāni puthusamaṇabrāhmaṇānaṃ puthupaccekasaccāni, seyyathidaṃ – ‘sassato loko’ti vā, ‘asassato loko’ti vā, ‘antavā loko’ti vā, ‘anantavā loko’ti vā, ‘taṃ jīvaṃ taṃ sarīra’nti vā, ‘aññaṃ jīvaṃ aññaṃ sarīra’nti vā, ‘hoti tathāgato paraṃ maraṇā’ti vā, ‘na hoti tathāgato paraṃ maraṇā’ti vā, ‘hoti ca na ca hoti tathāgato paraṃ maraṇā’ti vā, ‘neva hoti ",
      " na na hoti tathāgato paraṃ maraṇā’ti vā, sabbāni tāni nunnāni honti paṇunnāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[nuṇṇāni honti panuṇṇāni (?)]"
      },
      " cattāni vantāni muttāni pahīnāni paṭinissaṭṭhāni. Evaṃ kho, bhikkhave, bhikkhu paṇunnapaccekasacco hoti."
    ],
    "innerText": "‘‘Kathañca , bhikkhave, bhikkhu paṇunnapaccekasacco hoti? Idha, bhikkhave, bhikkhuno yāni tāni puthusamaṇabrāhmaṇānaṃ puthupaccekasaccāni, seyyathidaṃ – ‘sassato loko’ti vā, ‘asassato loko’ti vā, ‘antavā loko’ti vā, ‘anantavā loko’ti vā, ‘taṃ jīvaṃ taṃ sarīra’nti vā, ‘aññaṃ jīvaṃ aññaṃ sarīra’nti vā, ‘hoti tathāgato paraṃ maraṇā’ti vā, ‘na hoti tathāgato paraṃ maraṇā’ti vā, ‘hoti ca na ca hoti tathāgato paraṃ maraṇā’ti vā, ‘neva hoti na na hoti tathāgato paraṃ maraṇā’ti vā, sabbāni tāni nunnāni honti paṇunnāni [nuṇṇāni honti panuṇṇāni (?)] cattāni vantāni muttāni pahīnāni paṭinissaṭṭhāni. Evaṃ kho, bhikkhave, bhikkhu paṇunnapaccekasacco hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu samavayasaṭṭhesano hoti? Idha, bhikkhave, bhikkhuno kāmesanā pahīnā hoti, bhavesanā pahīnā hoti, brahmacariyesanā paṭippassaddhā. Evaṃ kho, bhikkhave, bhikkhu samavayasaṭṭhesano hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu anāvilasaṅkappo hoti? Idha, bhikkhave, bhikkhuno kāmasaṅkappo pahīno hoti, byāpādasaṅkappo pahīno hoti, vihiṃsāsaṅkappo pahīno hoti. Evaṃ kho, bhikkhave, bhikkhu anāvilasaṅkappo hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu passaddhakāyasaṅkhāro hoti? Idha, bhikkhave, bhikkhu sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharati. Evaṃ kho, bhikkhave, bhikkhu passaddhakāyasaṅkhāro hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu suvimuttacitto hoti? Idha, bhikkhave, bhikkhuno rāgā cittaṃ vimuttaṃ hoti, dosā cittaṃ vimuttaṃ hoti, mohā cittaṃ vimuttaṃ hoti. Evaṃ kho, bhikkhave, bhikkhu suvimuttacitto hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, bhikkhu suvimuttapañño hoti? Idha ",
      ", bhikkhave, bhikkhu ‘rāgo me pahīno ucchinnamūlo tālāvatthukato anabhāvaṃkato āyatiṃ anuppādadhammo’ti pajānāti, doso me pahīno…pe… ‘moho ",
      " me pahīno ",
      " ucchinnamūlo tālāvatthukato anabhāvaṃkato āyatiṃ anuppādadhammo’ti pajānāti. Evaṃ kho, bhikkhave, bhikkhu suvimuttapañño hoti."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu suvimuttapañño hoti? Idha , bhikkhave, bhikkhu ‘rāgo me pahīno ucchinnamūlo tālāvatthukato anabhāvaṃkato āyatiṃ anuppādadhammo’ti pajānāti, doso me pahīno…pe… ‘moho me pahīno ucchinnamūlo tālāvatthukato anabhāvaṃkato āyatiṃ anuppādadhammo’ti pajānāti. Evaṃ kho, bhikkhave, bhikkhu suvimuttapañño hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ye hi keci, bhikkhave, atītamaddhānaṃ ariyā ariyāvāse āvasiṃsu, sabbe te imeva dasa ariyāvāse āvasiṃsu; ye hi keci, bhikkhave, anāgatamaddhānaṃ ariyā ariyāvāse āvasissanti, sabbe te imeva dasa ariyāvāse āvasissanti; ye hi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yepi (?)]"
      },
      " keci, bhikkhave ",
      ", etarahi ariyā ariyāvāse āvasanti, sabbe te imeva dasa ariyāvāse āvasanti. Ime kho, bhikkhave, dasa ariyāvāsā, ye ariyā āvasiṃsu vā āvasanti vā āvasissanti vā’’ti. Dasamaṃ."
    ],
    "innerText": "‘‘Ye hi keci, bhikkhave, atītamaddhānaṃ ariyā ariyāvāse āvasiṃsu, sabbe te imeva dasa ariyāvāse āvasiṃsu; ye hi keci, bhikkhave, anāgatamaddhānaṃ ariyā ariyāvāse āvasissanti, sabbe te imeva dasa ariyāvāse āvasissanti; ye hi [yepi (?)] keci, bhikkhave , etarahi ariyā ariyāvāse āvasanti, sabbe te imeva dasa ariyāvāse āvasanti. Ime kho, bhikkhave, dasa ariyāvāsā, ye ariyā āvasiṃsu vā āvasanti vā āvasissanti vā’’ti. Dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Nāthavaggo dutiyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Senāsanañca pañcaṅgaṃ, saṃyojanākhilena ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Appamādo āhuneyyo, dve nāthā dve ariyāvāsāti."
  }
]