[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "1. Bālavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Bhayasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      ". Tikanipātassa ",
      " paṭhame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhayānī"
      },
      "tiādīsu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhaya"
      },
      "nti cittutrāso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upaddavo"
      },
      "ti anekaggatākāro. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upasaggo"
      },
      "ti upasaṭṭhākāro tattha tattha lagganākāro."
    ],
    "innerText": "1. Tikanipātassa paṭhame bhayānītiādīsu bhayanti cittutrāso. Upaddavoti anekaggatākāro. Upasaggoti upasaṭṭhākāro tattha tattha lagganākāro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tesaṃ evaṃ nānattaṃ veditabbaṃ – pabbatavisamanissitā corā janapadavāsīnaṃ pesenti – ‘‘mayaṃ asukadivase nāma tumhākaṃ gāmaṃ paharissāmā’’ti. Te taṃ pavattiṃ sutakālato paṭṭhāya bhayaṃ ",
      " santāsaṃ āpajjanti. Ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cittutrāso"
      },
      " nāma. ‘‘Yathā no te corā kupitā anatthampi āvaheyyu’’nti hatthasāraṃ gahetvā dvipadacatuppadehi saddhiṃ araññaṃ pavisitvā tattha tattha bhūmiyaṃ nipajjanti ḍaṃsamakasādīhi khajjamānā, gumbantarāni pavisantā khāṇukaṇṭake maddanti. Tesaṃ evaṃ vicarantānaṃ vikkhittabhāvo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anekaggatākāro"
      },
      " nāma. Tato coresu yathāvutte divase anāgacchantesu ‘‘tucchakasāsanaṃ bhavissati, gāmaṃ pavisissāmā’’ti saparikkhārā gāmaṃ pavisanti. Atha tesaṃ paviṭṭhabhāvaṃ ñatvā gāmaṃ parivāretvā dvāre aggiṃ datvā manusse ghātetvā corā sabbaṃ vibhavaṃ vilumpitvā gacchanti. Tesu ghātitāvasesā aggiṃ nibbāpetvā koṭṭhakacchāyābhitticchāyādīsu tattha tattha laggitvā nisīdanti naṭṭhaṃ anusocamānā. Ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upasaṭṭhākāro lagganākāro"
      },
      " nāma."
    ],
    "innerText": "Tesaṃ evaṃ nānattaṃ veditabbaṃ – pabbatavisamanissitā corā janapadavāsīnaṃ pesenti – ‘‘mayaṃ asukadivase nāma tumhākaṃ gāmaṃ paharissāmā’’ti. Te taṃ pavattiṃ sutakālato paṭṭhāya bhayaṃ santāsaṃ āpajjanti. Ayaṃ cittutrāso nāma. ‘‘Yathā no te corā kupitā anatthampi āvaheyyu’’nti hatthasāraṃ gahetvā dvipadacatuppadehi saddhiṃ araññaṃ pavisitvā tattha tattha bhūmiyaṃ nipajjanti ḍaṃsamakasādīhi khajjamānā, gumbantarāni pavisantā khāṇukaṇṭake maddanti. Tesaṃ evaṃ vicarantānaṃ vikkhittabhāvo anekaggatākāro nāma. Tato coresu yathāvutte divase anāgacchantesu ‘‘tucchakasāsanaṃ bhavissati, gāmaṃ pavisissāmā’’ti saparikkhārā gāmaṃ pavisanti. Atha tesaṃ paviṭṭhabhāvaṃ ñatvā gāmaṃ parivāretvā dvāre aggiṃ datvā manusse ghātetvā corā sabbaṃ vibhavaṃ vilumpitvā gacchanti. Tesu ghātitāvasesā aggiṃ nibbāpetvā koṭṭhakacchāyābhitticchāyādīsu tattha tattha laggitvā nisīdanti naṭṭhaṃ anusocamānā. Ayaṃ upasaṭṭhākāro lagganākāro nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Naḷāgārā"
      },
      "ti ",
      " naḷehi channapaṭicchannaagārā. Sesasambhārā panettha rukkhamayā honti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tiṇāgāre"
      },
      "pi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kūṭāgārānī"
      },
      "ti kūṭasaṅgahitāni agārāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ullittāvalittānī"
      },
      "ti anto ca bahi ca littāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nivātānī"
      },
      "ti nivāritavātappavesāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Phusitaggaḷānī"
      },
      "ti chekehi vaḍḍhakīhi katattā ",
      " piṭṭhasaṅghāṭamhi suṭṭhu phusitakavāṭāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pihitavātapānānī"
      },
      "ti yuttavātapānāni. Iminā padadvayena kavāṭavātapānānaṃ niccapihitataṃ akathetvā sampattiyeva kathitā. Icchiticchitakkhaṇe pana tāni pidhīyanti ca vivarīyanti ca."
    ],
    "innerText": "Naḷāgārāti naḷehi channapaṭicchannaagārā. Sesasambhārā panettha rukkhamayā honti. Tiṇāgārepi eseva nayo. Kūṭāgārānīti kūṭasaṅgahitāni agārāni. Ullittāvalittānīti anto ca bahi ca littāni. Nivātānīti nivāritavātappavesāni. Phusitaggaḷānīti chekehi vaḍḍhakīhi katattā piṭṭhasaṅghāṭamhi suṭṭhu phusitakavāṭāni. Pihitavātapānānīti yuttavātapānāni. Iminā padadvayena kavāṭavātapānānaṃ niccapihitataṃ akathetvā sampattiyeva kathitā. Icchiticchitakkhaṇe pana tāni pidhīyanti ca vivarīyanti ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bālato uppajjantī"
      },
      "ti bālameva nissāya uppajjanti. Bālo hi apaṇḍitapuriso rajjaṃ vā oparajjaṃ vā aññaṃ vā pana mahantaṃ ṭhānaṃ patthento katipaye attanā sadise vidhavaputte mahādhutte gahetvā ‘‘etha ahaṃ tumhe issare karissāmī’’ti pabbatagahanādīni nissāya antamante gāme paharanto dāmarikabhāvaṃ jānāpetvā anupubbena nigamepi janapadepi paharati. Manussā gehāni chaḍḍetvā khemaṭṭhānaṃ patthayamānā pakkamanti. Te nissāya vasantā bhikkhūpi bhikkhuniyopi attano attano vasanaṭṭhānāni pahāya pakkamanti. Gatagataṭṭhāne bhikkhāpi senāsanampi dullabhaṃ hoti. Evaṃ catunnampi parisānaṃ bhayaṃ āgatameva hoti. Pabbajjitesupi dve bālā bhikkhū aññamaññaṃ vivādaṃ paṭṭhapetvā codanaṃ ārabhanti. Iti kosambivāsikānaṃ viya mahākalaho uppajjati. Catunnaṃ parisānaṃ bhayaṃ āgatameva hotīti evaṃ yāni kānici bhayāni ",
      " uppajjanti, sabbāni tāni bālato uppajjantīti yathānusandhinā desanaṃ niṭṭhapesi."
    ],
    "innerText": "Bālato uppajjantīti bālameva nissāya uppajjanti. Bālo hi apaṇḍitapuriso rajjaṃ vā oparajjaṃ vā aññaṃ vā pana mahantaṃ ṭhānaṃ patthento katipaye attanā sadise vidhavaputte mahādhutte gahetvā ‘‘etha ahaṃ tumhe issare karissāmī’’ti pabbatagahanādīni nissāya antamante gāme paharanto dāmarikabhāvaṃ jānāpetvā anupubbena nigamepi janapadepi paharati. Manussā gehāni chaḍḍetvā khemaṭṭhānaṃ patthayamānā pakkamanti. Te nissāya vasantā bhikkhūpi bhikkhuniyopi attano attano vasanaṭṭhānāni pahāya pakkamanti. Gatagataṭṭhāne bhikkhāpi senāsanampi dullabhaṃ hoti. Evaṃ catunnampi parisānaṃ bhayaṃ āgatameva hoti. Pabbajjitesupi dve bālā bhikkhū aññamaññaṃ vivādaṃ paṭṭhapetvā codanaṃ ārabhanti. Iti kosambivāsikānaṃ viya mahākalaho uppajjati. Catunnaṃ parisānaṃ bhayaṃ āgatameva hotīti evaṃ yāni kānici bhayāni uppajjanti, sabbāni tāni bālato uppajjantīti yathānusandhinā desanaṃ niṭṭhapesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Lakkhaṇasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "2"
      },
      ". Dutiye ",
      " kāyadvārādipavattaṃ kammaṃ lakkhaṇaṃ sañjānanakāraṇaṃ assāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kammalakkhaṇo. Apadānasobhanī paññā"
      },
      "ti yā paññā nāma apadānena sobhati, bālā ca paṇḍitā ca attano attano cariteneva pākaṭā hontīti attho. Bālena hi gatamaggo rukkhagacchagāmanigamādīni jhāpetvā gacchantassa indaggino gatamaggo viya hoti, jhāmaṭṭhānamattameva aṅgāramasichārikāsamākulaṃ paññāyati. Paṇḍitena gatamaggo kusobbhādayo pūretvā vividhasassasampadaṃ āvahamānena catudīpikameghena gatamaggo viya hoti. Yathā tena gatamagge udakapūrāni ceva vividhasassaphalāphalāni ca tāni tāni ṭhānāni paññāyanti, evaṃ paṇḍitena gatamagge sampattiyova paññāyanti no vipattiyoti. Sesamettha uttānatthameva."
    ],
    "innerText": "2. Dutiye kāyadvārādipavattaṃ kammaṃ lakkhaṇaṃ sañjānanakāraṇaṃ assāti kammalakkhaṇo. Apadānasobhanī paññāti yā paññā nāma apadānena sobhati, bālā ca paṇḍitā ca attano attano cariteneva pākaṭā hontīti attho. Bālena hi gatamaggo rukkhagacchagāmanigamādīni jhāpetvā gacchantassa indaggino gatamaggo viya hoti, jhāmaṭṭhānamattameva aṅgāramasichārikāsamākulaṃ paññāyati. Paṇḍitena gatamaggo kusobbhādayo pūretvā vividhasassasampadaṃ āvahamānena catudīpikameghena gatamaggo viya hoti. Yathā tena gatamagge udakapūrāni ceva vividhasassaphalāphalāni ca tāni tāni ṭhānāni paññāyanti, evaṃ paṇḍitena gatamagge sampattiyova paññāyanti no vipattiyoti. Sesamettha uttānatthameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Cintīsuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "3"
      },
      ". Tatiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bālalakkhaṇānī"
      },
      "ti ‘‘bālo aya’’nti etehi lakkhīyati ñāyatīti bālalakkhaṇāni. Tānevassa sañjānanakāraṇānīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bālanimittāni. Bālāpadānānī"
      },
      "ti bālassa apadānāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Duccintitacintī"
      },
      "ti cintayanto abhijjhābyāpādamicchādassanavasena duccintitameva cinteti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dubbhāsitabhāsī"
      },
      "ti bhāsamānopi musāvādādibhedaṃ dubbhāsitameva bhāsati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dukkaṭakammakārī"
      },
      "ti karontopi pāṇātipātādivasena dukkaṭakammameva karoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṇḍitalakkhaṇānī"
      },
      "tiādi vuttānusāreneva veditabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sucintitacintī"
      },
      "tiādīni cettha manosucaritādīnaṃ vasena yojetabbāni."
    ],
    "innerText": "3. Tatiye bālalakkhaṇānīti ‘‘bālo aya’’nti etehi lakkhīyati ñāyatīti bālalakkhaṇāni. Tānevassa sañjānanakāraṇānīti bālanimittāni. Bālāpadānānīti bālassa apadānāni. Duccintitacintīti cintayanto abhijjhābyāpādamicchādassanavasena duccintitameva cinteti. Dubbhāsitabhāsīti bhāsamānopi musāvādādibhedaṃ dubbhāsitameva bhāsati. Dukkaṭakammakārīti karontopi pāṇātipātādivasena dukkaṭakammameva karoti. Paṇḍitalakkhaṇānītiādi vuttānusāreneva veditabbaṃ. Sucintitacintītiādīni cettha manosucaritādīnaṃ vasena yojetabbāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Accayasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "4"
      },
      ". Catutthe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "accayaṃ accayato na passatī"
      },
      "ti attano aparādhaṃ aparādhato na passati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Accayato disvā yathādhammaṃ nappaṭikarotī"
      },
      "ti ‘‘aparaddhaṃ mayā’’ti ñatvāpi yo dhammo, taṃ na karoti, daṇḍakammaṃ āharitvā accayaṃ na deseti nakkhamāpeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Accayaṃ desentassa yathādhammaṃ nappaṭiggaṇhātī"
      },
      "ti parassa ‘‘viraddhaṃ mayā’’ti ñatvā daṇḍakammaṃ āharitvā khamāpentassa nakkhamati. Sukkapakkho vuttapaṭipakkhato veditabbo."
    ],
    "innerText": "4. Catutthe accayaṃ accayato na passatīti attano aparādhaṃ aparādhato na passati. Accayato disvā yathādhammaṃ nappaṭikarotīti ‘‘aparaddhaṃ mayā’’ti ñatvāpi yo dhammo, taṃ na karoti, daṇḍakammaṃ āharitvā accayaṃ na deseti nakkhamāpeti. Accayaṃ desentassa yathādhammaṃ nappaṭiggaṇhātīti parassa ‘‘viraddhaṃ mayā’’ti ñatvā daṇḍakammaṃ āharitvā khamāpentassa nakkhamati. Sukkapakkho vuttapaṭipakkhato veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Ayonisosuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "5"
      },
      ". Pañcame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ayoniso pañhaṃ kattā hotī"
      },
      "ti ‘‘kati nu kho, udāyi, anussatiṭṭhānānī’’ti vutte ‘‘pubbenivāso anussatiṭṭhānaṃ bhavissatī’’ti cintetvā lāḷudāyitthero viya anupāyacintāya apañhameva pañhanti kattā hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayoniso pañhaṃ vissajjetā hotī"
      },
      "ti evaṃ cintitaṃ pana pañhaṃ vissajjentopi ‘‘idha, bhante, bhikkhu anekavihitaṃ pubbenivāsaṃ anussarati. Seyyathidaṃ, ekampi jāti’’ntiādinā nayena soyeva thero viya ayoniso vissajjetā hoti, apañhameva pañhanti katheti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parimaṇḍalehi padabyañjanehī"
      },
      "ti ettha padameva atthassa byañjanato padabyañjanaṃ. Taṃ akkharapāripūriṃ katvā dasavidhaṃ byañjanabuddhiṃ aparihāpetvā ",
      " vuttaṃ parimaṇḍalaṃ nāma hoti, evarūpehi padabyañjanehīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Siliṭṭhehī"
      },
      "ti padasiliṭṭhatāya siliṭṭhehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upagatehī"
      },
      "ti atthañca kāraṇañca upagatehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nābbhanumoditā"
      },
      "ti evaṃ yoniso sabbaṃ kāraṇasampannaṃ katvāpi vissajjitaṃ parassa pañhaṃ nābhinumodati nābhinandati sāriputtattherassa pañhaṃ lāḷudāyitthero viya. Yathāha –"
    ],
    "innerText": "5. Pañcame ayoniso pañhaṃ kattā hotīti ‘‘kati nu kho, udāyi, anussatiṭṭhānānī’’ti vutte ‘‘pubbenivāso anussatiṭṭhānaṃ bhavissatī’’ti cintetvā lāḷudāyitthero viya anupāyacintāya apañhameva pañhanti kattā hoti. Ayoniso pañhaṃ vissajjetā hotīti evaṃ cintitaṃ pana pañhaṃ vissajjentopi ‘‘idha, bhante, bhikkhu anekavihitaṃ pubbenivāsaṃ anussarati. Seyyathidaṃ, ekampi jāti’’ntiādinā nayena soyeva thero viya ayoniso vissajjetā hoti, apañhameva pañhanti katheti. Parimaṇḍalehi padabyañjanehīti ettha padameva atthassa byañjanato padabyañjanaṃ. Taṃ akkharapāripūriṃ katvā dasavidhaṃ byañjanabuddhiṃ aparihāpetvā vuttaṃ parimaṇḍalaṃ nāma hoti, evarūpehi padabyañjanehīti attho. Siliṭṭhehīti padasiliṭṭhatāya siliṭṭhehi. Upagatehīti atthañca kāraṇañca upagatehi. Nābbhanumoditāti evaṃ yoniso sabbaṃ kāraṇasampannaṃ katvāpi vissajjitaṃ parassa pañhaṃ nābhinumodati nābhinandati sāriputtattherassa pañhaṃ lāḷudāyitthero viya. Yathāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Aṭṭhānaṃ kho etaṃ, āvuso sāriputta, anavakāso, yaṃ so atikkammeva kabaḷīkārāhārabhakkhānaṃ devānaṃ sahabyataṃ aññataraṃ ",
      " manomayaṃ kāyaṃ upapanno saññāvedayitanirodhaṃ samāpajjeyyāpi vuṭṭhaheyyāpi, natthetaṃ ṭhāna’’nti (a. ni. 5.166)."
    ],
    "innerText": "‘‘Aṭṭhānaṃ kho etaṃ, āvuso sāriputta, anavakāso, yaṃ so atikkammeva kabaḷīkārāhārabhakkhānaṃ devānaṃ sahabyataṃ aññataraṃ manomayaṃ kāyaṃ upapanno saññāvedayitanirodhaṃ samāpajjeyyāpi vuṭṭhaheyyāpi, natthetaṃ ṭhāna’’nti (a. ni. 5.166)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yoniso pañhaṃ kattā"
      },
      "tiādīsu ānandatthero viya yonisova pañhaṃ cintetvā yoniso vissajjitā hoti. Thero hi ‘‘kati nu kho, ānanda, anussatiṭṭhānānī’’ti pucchito ‘‘ayaṃ pañho bhavissatī’’ti yoniso cintetvā yoniso vissajjento āha – ‘‘idha, bhante, bhikkhu vivicceva kāmehi…pe… catutthajjhānaṃ upasampajja viharati. Idaṃ, bhante, anussatiṭṭhānaṃ evaṃbhāvitaṃ evaṃbahulīkataṃ diṭṭhadhammasukhavihārāya saṃvattatī’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abbhanumoditā hotī"
      },
      "ti tathāgato viya yoniso abbhanumoditā hoti. Tathāgato hi ānandattherena pañhe vissajjite ‘‘sādhu sādhu, ānanda, tena hi tvaṃ, ānanda, imampi chaṭṭhaṃ anussatiṭṭhānaṃ dhārehi. Idhānanda, bhikkhu satova abhikkamati satova paṭikkamatī’’tiādimāha. Chaṭṭhādīni uttānatthāneva."
    ],
    "innerText": "Yoniso pañhaṃ kattātiādīsu ānandatthero viya yonisova pañhaṃ cintetvā yoniso vissajjitā hoti. Thero hi ‘‘kati nu kho, ānanda, anussatiṭṭhānānī’’ti pucchito ‘‘ayaṃ pañho bhavissatī’’ti yoniso cintetvā yoniso vissajjento āha – ‘‘idha, bhante, bhikkhu vivicceva kāmehi…pe… catutthajjhānaṃ upasampajja viharati. Idaṃ, bhante, anussatiṭṭhānaṃ evaṃbhāvitaṃ evaṃbahulīkataṃ diṭṭhadhammasukhavihārāya saṃvattatī’’ti. Abbhanumoditā hotīti tathāgato viya yoniso abbhanumoditā hoti. Tathāgato hi ānandattherena pañhe vissajjite ‘‘sādhu sādhu, ānanda, tena hi tvaṃ, ānanda, imampi chaṭṭhaṃ anussatiṭṭhānaṃ dhārehi. Idhānanda, bhikkhu satova abhikkamati satova paṭikkamatī’’tiādimāha. Chaṭṭhādīni uttānatthāneva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Khatasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "9"
      },
      ". Navame ",
      " sukkapakkho pubbabhāge dasahipi kusalakammapathehi paricchinno, upari yāva arahattamaggā labbhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bahuñca puññaṃ pasavatī"
      },
      "ti ettha lokiyalokuttaramissakapuññaṃ kathitaṃ."
    ],
    "innerText": "9. Navame sukkapakkho pubbabhāge dasahipi kusalakammapathehi paricchinno, upari yāva arahattamaggā labbhati. Bahuñca puññaṃ pasavatīti ettha lokiyalokuttaramissakapuññaṃ kathitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Malasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "10"
      },
      ". Dasame dussīlabhāvo dussīlyaṃ, dussīlyameva malaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dussīlyamalaṃ"
      },
      ". Kenaṭṭhena malanti? Anudahanaṭṭhena duggandhaṭṭhena kiliṭṭhakaraṇaṭṭhena ca. Tañhi nirayādīsu apāyesu anudahatīti anudahanaṭṭhenapi malaṃ. Tena samannāgato ",
      " puggalo mātāpitūnampi santike bhikkhusaṅghassāpi antare bodhicetiyaṭṭhānesupi jigucchanīyo hoti, sabbadisāsu cassa ‘‘evarūpaṃ kira tena pāpakammaṃ kata’’nti avaṇṇagandho vāyatīti duggandhaṭṭhenapi malaṃ. Tena ca samannāgato puggalo gatagataṭṭhāne upatāpañceva labhati, kāyakammādīni cassa asucīni honti apabhassarānīti ",
      " kiliṭṭhakaraṇaṭṭhenapi malaṃ. Apica taṃ devamanussasampattiyo ceva nibbānasampattiñca milāpetīti milāpanaṭṭhenapi malanti veditabbaṃ. Issāmalamaccheramalesupi eseva nayo."
    ],
    "innerText": "10. Dasame dussīlabhāvo dussīlyaṃ, dussīlyameva malaṃ dussīlyamalaṃ. Kenaṭṭhena malanti? Anudahanaṭṭhena duggandhaṭṭhena kiliṭṭhakaraṇaṭṭhena ca. Tañhi nirayādīsu apāyesu anudahatīti anudahanaṭṭhenapi malaṃ. Tena samannāgato puggalo mātāpitūnampi santike bhikkhusaṅghassāpi antare bodhicetiyaṭṭhānesupi jigucchanīyo hoti, sabbadisāsu cassa ‘‘evarūpaṃ kira tena pāpakammaṃ kata’’nti avaṇṇagandho vāyatīti duggandhaṭṭhenapi malaṃ. Tena ca samannāgato puggalo gatagataṭṭhāne upatāpañceva labhati, kāyakammādīni cassa asucīni honti apabhassarānīti kiliṭṭhakaraṇaṭṭhenapi malaṃ. Apica taṃ devamanussasampattiyo ceva nibbānasampattiñca milāpetīti milāpanaṭṭhenapi malanti veditabbaṃ. Issāmalamaccheramalesupi eseva nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Bālavaggo paṭhamo."
  }
]