[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "3. Puggalavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Samiddhasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "21"
      },
      ". Evaṃ ",
      " me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho āyasmā ca samiddho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[saviṭṭho (sī. syā. kaṃ. pī.)]"
      },
      " āyasmā ca mahākoṭṭhiko ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mahākoṭṭhito (sī. syā. kaṃ. pī.)]"
      },
      " yenāyasmā sāriputto tenupasaṅkamiṃsu; upasaṅkamitvā āyasmatā sāriputtena saddhiṃ sammodiṃsu. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnaṃ kho āyasmantaṃ samiddhaṃ āyasmā sāriputto etadavoca –"
    ],
    "innerText": "21. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho āyasmā ca samiddho [saviṭṭho (sī. syā. kaṃ. pī.)] āyasmā ca mahākoṭṭhiko [mahākoṭṭhito (sī. syā. kaṃ. pī.)] yenāyasmā sāriputto tenupasaṅkamiṃsu; upasaṅkamitvā āyasmatā sāriputtena saddhiṃ sammodiṃsu. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnaṃ kho āyasmantaṃ samiddhaṃ āyasmā sāriputto etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tayome, āvuso samiddha, puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Kāyasakkhī, diṭṭhippatto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[diṭṭhappatto (ka.)]"
      },
      ", saddhāvimutto. Ime kho, āvuso, tayo puggalā santo ",
      " saṃvijjamānā lokasmiṃ. Imesaṃ, āvuso, tiṇṇaṃ puggalānaṃ katamo te puggalo khamati abhikkantataro ca paṇītataro cā’’ti?"
    ],
    "innerText": "‘‘Tayome, āvuso samiddha, puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Kāyasakkhī, diṭṭhippatto [diṭṭhappatto (ka.)], saddhāvimutto. Ime kho, āvuso, tayo puggalā santo saṃvijjamānā lokasmiṃ. Imesaṃ, āvuso, tiṇṇaṃ puggalānaṃ katamo te puggalo khamati abhikkantataro ca paṇītataro cā’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tayome, āvuso sāriputta, puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Kāyasakkhī, diṭṭhippatto, saddhāvimutto. Ime kho, āvuso, tayo puggalā santo saṃvijjamānā lokasmiṃ. Imesaṃ, āvuso, tiṇṇaṃ puggalānaṃ yvāyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yoyaṃ (ka.)]"
      },
      " puggalo saddhāvimutto, ayaṃ me puggalo khamati imesaṃ tiṇṇaṃ puggalānaṃ abhikkantataro ca paṇītataro ca. Taṃ kissa hetu? Imassa, āvuso, puggalassa saddhindriyaṃ adhimatta’’nti."
    ],
    "innerText": "‘‘Tayome, āvuso sāriputta, puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Kāyasakkhī, diṭṭhippatto, saddhāvimutto. Ime kho, āvuso, tayo puggalā santo saṃvijjamānā lokasmiṃ. Imesaṃ, āvuso, tiṇṇaṃ puggalānaṃ yvāyaṃ [yoyaṃ (ka.)] puggalo saddhāvimutto, ayaṃ me puggalo khamati imesaṃ tiṇṇaṃ puggalānaṃ abhikkantataro ca paṇītataro ca. Taṃ kissa hetu? Imassa, āvuso, puggalassa saddhindriyaṃ adhimatta’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho āyasmā sāriputto āyasmantaṃ mahākoṭṭhikaṃ etadavoca – ‘‘tayome, āvuso koṭṭhika, puggalā santo saṃvijjamānā lokasmiṃ ",
      ". Katame tayo? Kāyasakkhī, diṭṭhippatto, saddhāvimutto. Ime kho, āvuso, tayo puggalā santo saṃvijjamānā lokasmiṃ. Imesaṃ ",
      ", āvuso, tiṇṇaṃ puggalānaṃ katamo te puggalo khamati abhikkantataro ca paṇītataro cā’’ti?"
    ],
    "innerText": "Atha kho āyasmā sāriputto āyasmantaṃ mahākoṭṭhikaṃ etadavoca – ‘‘tayome, āvuso koṭṭhika, puggalā santo saṃvijjamānā lokasmiṃ . Katame tayo? Kāyasakkhī, diṭṭhippatto, saddhāvimutto. Ime kho, āvuso, tayo puggalā santo saṃvijjamānā lokasmiṃ. Imesaṃ , āvuso, tiṇṇaṃ puggalānaṃ katamo te puggalo khamati abhikkantataro ca paṇītataro cā’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tayome ",
      ", āvuso sāriputta, puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Kāyasakkhī, diṭṭhippatto, saddhāvimutto. Ime kho, āvuso, tayo puggalā santo saṃvijjamānā lokasmiṃ. Imesaṃ, āvuso, tiṇṇaṃ puggalānaṃ yvāyaṃ puggalo kāyasakkhī, ayaṃ me puggalo khamati imesaṃ tiṇṇaṃ puggalānaṃ abhikkantataro ca paṇītataro ca. Taṃ kissa hetu? Imassa, āvuso, puggalassa samādhindriyaṃ adhimatta’’nti."
    ],
    "innerText": "‘‘Tayome , āvuso sāriputta, puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Kāyasakkhī, diṭṭhippatto, saddhāvimutto. Ime kho, āvuso, tayo puggalā santo saṃvijjamānā lokasmiṃ. Imesaṃ, āvuso, tiṇṇaṃ puggalānaṃ yvāyaṃ puggalo kāyasakkhī, ayaṃ me puggalo khamati imesaṃ tiṇṇaṃ puggalānaṃ abhikkantataro ca paṇītataro ca. Taṃ kissa hetu? Imassa, āvuso, puggalassa samādhindriyaṃ adhimatta’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho āyasmā mahākoṭṭhiko āyasmantaṃ sāriputtaṃ etadavoca – ‘‘tayome, āvuso sāriputta, puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Kāyasakkhī ",
      ", diṭṭhippatto, saddhāvimutto. Ime kho, āvuso, tayo puggalā santo saṃvijjamānā lokasmiṃ. Imesaṃ, āvuso, tiṇṇaṃ puggalānaṃ katamo te puggalo khamati abhikkantataro ca paṇītataro cā’’ti?"
    ],
    "innerText": "Atha kho āyasmā mahākoṭṭhiko āyasmantaṃ sāriputtaṃ etadavoca – ‘‘tayome, āvuso sāriputta, puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Kāyasakkhī , diṭṭhippatto, saddhāvimutto. Ime kho, āvuso, tayo puggalā santo saṃvijjamānā lokasmiṃ. Imesaṃ, āvuso, tiṇṇaṃ puggalānaṃ katamo te puggalo khamati abhikkantataro ca paṇītataro cā’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tayome, āvuso koṭṭhika, puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Kāyasakkhī, diṭṭhippatto, saddhāvimutto. Ime kho, āvuso, tayo puggalā santo saṃvijjamānā lokasmiṃ. Imesaṃ, āvuso, tiṇṇaṃ puggalānaṃ yvāyaṃ puggalo diṭṭhippatto, ayaṃ me puggalo khamati imesaṃ tiṇṇaṃ puggalānaṃ abhikkantataro ca paṇītataro ca. Taṃ kissa hetu? Imassa, āvuso, puggalassa paññindriyaṃ adhimatta’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho āyasmā sāriputto āyasmantañca samiddhaṃ āyasmantañca mahākoṭṭhikaṃ etadavoca – ‘‘byākataṃ kho, āvuso, amhehi sabbeheva yathāsakaṃ paṭibhānaṃ. Āyāmāvuso, yena bhagavā tenupasaṅkamissāma; upasaṅkamitvā bhagavato etamatthaṃ ārocessāma. Yathā no bhagavā byākarissati tathā naṃ dhāressāmā’’ti. ‘‘Evamāvuso’’ti kho āyasmā ca samiddho āyasmā ca mahākoṭṭhiko āyasmato sāriputtassa ",
      " paccassosuṃ. Atha kho āyasmā ca sāriputto āyasmā ca samiddho āyasmā ca mahākoṭṭhiko yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ ",
      " nisinno kho āyasmā sāriputto yāvatako ahosi āyasmatā ca samiddhena āyasmatā ca mahākoṭṭhikena saddhiṃ kathāsallāpo taṃ sabbaṃ ",
      " bhagavato ārocesi."
    ],
    "innerText": "Atha kho āyasmā sāriputto āyasmantañca samiddhaṃ āyasmantañca mahākoṭṭhikaṃ etadavoca – ‘‘byākataṃ kho, āvuso, amhehi sabbeheva yathāsakaṃ paṭibhānaṃ. Āyāmāvuso, yena bhagavā tenupasaṅkamissāma; upasaṅkamitvā bhagavato etamatthaṃ ārocessāma. Yathā no bhagavā byākarissati tathā naṃ dhāressāmā’’ti. ‘‘Evamāvuso’’ti kho āyasmā ca samiddho āyasmā ca mahākoṭṭhiko āyasmato sāriputtassa paccassosuṃ. Atha kho āyasmā ca sāriputto āyasmā ca samiddho āyasmā ca mahākoṭṭhiko yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinno kho āyasmā sāriputto yāvatako ahosi āyasmatā ca samiddhena āyasmatā ca mahākoṭṭhikena saddhiṃ kathāsallāpo taṃ sabbaṃ bhagavato ārocesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Na ",
      " khvettha, sāriputta, sukaraṃ ekaṃsena byākātuṃ – ‘ayaṃ imesaṃ tiṇṇaṃ puggalānaṃ abhikkantataro ca paṇītataro cā’ti. Ṭhānañhetaṃ, sāriputta, vijjati yvāyaṃ puggalo saddhāvimutto svāssa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[svāyaṃ (syā. kaṃ. pī.), soyaṃ (ka.)]"
      },
      " arahattāya paṭipanno, yvāyaṃ puggalo kāyasakkhī svāssa sakadāgāmī vā anāgāmī vā, yo cāyaṃ puggalo diṭṭhippatto sopassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[soyaṃ (ka.)]"
      },
      " sakadāgāmī vā anāgāmī vā."
    ],
    "innerText": "‘‘Na khvettha, sāriputta, sukaraṃ ekaṃsena byākātuṃ – ‘ayaṃ imesaṃ tiṇṇaṃ puggalānaṃ abhikkantataro ca paṇītataro cā’ti. Ṭhānañhetaṃ, sāriputta, vijjati yvāyaṃ puggalo saddhāvimutto svāssa [svāyaṃ (syā. kaṃ. pī.), soyaṃ (ka.)] arahattāya paṭipanno, yvāyaṃ puggalo kāyasakkhī svāssa sakadāgāmī vā anāgāmī vā, yo cāyaṃ puggalo diṭṭhippatto sopassa [soyaṃ (ka.)] sakadāgāmī vā anāgāmī vā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Na khvettha, sāriputta, sukaraṃ ekaṃsena byākātuṃ – ‘ayaṃ imesaṃ tiṇṇaṃ puggalānaṃ abhikkantataro ca paṇītataro cā’ti. Ṭhānañhetaṃ, sāriputta, vijjati yvāyaṃ puggalo kāyasakkhī svāssa arahattāya paṭipanno, yvāyaṃ puggalo saddhāvimutto svāssa sakadāgāmī vā anāgāmī vā, yo cāyaṃ puggalo diṭṭhippatto sopassa sakadāgāmī vā anāgāmī vā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Na khvettha, sāriputta, sukaraṃ ekaṃsena byākātuṃ – ‘ayaṃ imesaṃ tiṇṇaṃ puggalānaṃ abhikkantataro ca paṇītataro cā’ti. Ṭhānañhetaṃ, sāriputta, vijjati yvāyaṃ puggalo diṭṭhippatto svāssa arahattāya paṭipanno, yvāyaṃ puggalo saddhāvimutto svāssa sakadāgāmī vā anāgāmī vā, yo cāyaṃ puggalo kāyasakkhī sopassa sakadāgāmī vā anāgāmī vā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Na khvettha, sāriputta, sukaraṃ ekaṃsena byākātuṃ – ‘ayaṃ imesaṃ tiṇṇaṃ puggalānaṃ abhikkantataro ca paṇītataro cā’’’ti. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Gilānasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "22"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pu. pa. 94]"
      },
      " ‘‘Tayome, bhikkhave, gilānā santo saṃvijjamānā lokasmiṃ. Katame tayo? Idha, bhikkhave, ekacco gilāno labhanto vā sappāyāni bhojanāni alabhanto vā sappāyāni bhojanāni, labhanto vā sappāyāni bhesajjāni ",
      " alabhanto vā sappāyāni bhesajjāni, labhanto vā ",
      " patirūpaṃ upaṭṭhākaṃ alabhanto vā patirūpaṃ upaṭṭhākaṃ neva vuṭṭhāti tamhā ābādhā."
    ],
    "innerText": "22.[pu. pa. 94] ‘‘Tayome, bhikkhave, gilānā santo saṃvijjamānā lokasmiṃ. Katame tayo? Idha, bhikkhave, ekacco gilāno labhanto vā sappāyāni bhojanāni alabhanto vā sappāyāni bhojanāni, labhanto vā sappāyāni bhesajjāni alabhanto vā sappāyāni bhesajjāni, labhanto vā patirūpaṃ upaṭṭhākaṃ alabhanto vā patirūpaṃ upaṭṭhākaṃ neva vuṭṭhāti tamhā ābādhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idha pana, bhikkhave, ekacco gilāno labhanto vā sappāyāni bhojanāni alabhanto vā sappāyāni bhojanāni, labhanto vā sappāyāni bhesajjāni alabhanto vā sappāyāni bhesajjāni ",
      ", labhanto vā patirūpaṃ upaṭṭhākaṃ alabhanto vā patirūpaṃ upaṭṭhākaṃ vuṭṭhāti tamhā ābādhā."
    ],
    "innerText": "‘‘Idha pana, bhikkhave, ekacco gilāno labhanto vā sappāyāni bhojanāni alabhanto vā sappāyāni bhojanāni, labhanto vā sappāyāni bhesajjāni alabhanto vā sappāyāni bhesajjāni , labhanto vā patirūpaṃ upaṭṭhākaṃ alabhanto vā patirūpaṃ upaṭṭhākaṃ vuṭṭhāti tamhā ābādhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Idha pana, bhikkhave, ekacco gilāno labhantova sappāyāni bhojanāni no alabhanto, labhantova sappāyāni bhesajjāni no alabhanto, labhantova patirūpaṃ upaṭṭhākaṃ no alabhanto vuṭṭhāti tamhā ābādhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tatra, bhikkhave, yvāyaṃ gilāno labhantova sappāyāni bhojanāni no alabhanto, labhantova sappāyāni bhesajjāni no alabhanto, labhantova patirūpaṃ upaṭṭhākaṃ no alabhanto vuṭṭhāti tamhā ābādhā, imaṃ kho, bhikkhave, gilānaṃ paṭicca gilānabhattaṃ anuññātaṃ gilānabhesajjaṃ anuññātaṃ gilānupaṭṭhāko anuññāto. Imañca pana, bhikkhave, gilānaṃ paṭicca aññepi gilānā upaṭṭhātabbā. Ime kho, bhikkhave, tayo gilānā santo saṃvijjamānā lokasmiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evamevaṃ kho, bhikkhave, tayome gilānūpamā puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Idha, bhikkhave, ekacco puggalo labhanto vā tathāgataṃ dassanāya alabhanto vā tathāgataṃ dassanāya, labhanto vā tathāgatappaveditaṃ dhammavinayaṃ savanāya alabhanto vā tathāgatappaveditaṃ dhammavinayaṃ ",
      " savanāya neva okkamati niyāmaṃ kusalesu dhammesu sammattaṃ."
    ],
    "innerText": "‘‘Evamevaṃ kho, bhikkhave, tayome gilānūpamā puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Idha, bhikkhave, ekacco puggalo labhanto vā tathāgataṃ dassanāya alabhanto vā tathāgataṃ dassanāya, labhanto vā tathāgatappaveditaṃ dhammavinayaṃ savanāya alabhanto vā tathāgatappaveditaṃ dhammavinayaṃ savanāya neva okkamati niyāmaṃ kusalesu dhammesu sammattaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Idha, pana, bhikkhave, ekacco puggalo labhanto vā tathāgataṃ dassanāya alabhanto vā tathāgataṃ dassanāya, labhanto vā tathāgatappaveditaṃ dhammavinayaṃ savanāya alabhanto vā tathāgatappaveditaṃ dhammavinayaṃ savanāya okkamati niyāmaṃ kusalesu dhammesu sammattaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Idha pana, bhikkhave, ekacco puggalo labhantova tathāgataṃ dassanāya no alabhanto, labhantova tathāgatappaveditaṃ dhammavinayaṃ savanāya no alabhanto okkamati niyāmaṃ kusalesu dhammesu sammattaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tatra ",
      ", bhikkhave, yvāyaṃ puggalo labhantova tathāgataṃ dassanāya no alabhanto, labhantova ",
      " tathāgatappaveditaṃ dhammavinayaṃ savanāya no alabhanto okkamati niyāmaṃ kusalesu dhammesu sammattaṃ, imaṃ kho bhikkhave, puggalaṃ paṭicca dhammadesanā anuññātā. Imañca pana, bhikkhave, puggalaṃ paṭicca aññesampi dhammo desetabbo. ‘‘Ime kho, bhikkhave, tayo gilānūpamā puggalā santo saṃvijjamānā lokasmi’’nti. Dutiyaṃ."
    ],
    "innerText": "‘‘Tatra , bhikkhave, yvāyaṃ puggalo labhantova tathāgataṃ dassanāya no alabhanto, labhantova tathāgatappaveditaṃ dhammavinayaṃ savanāya no alabhanto okkamati niyāmaṃ kusalesu dhammesu sammattaṃ, imaṃ kho bhikkhave, puggalaṃ paṭicca dhammadesanā anuññātā. Imañca pana, bhikkhave, puggalaṃ paṭicca aññesampi dhammo desetabbo. ‘‘Ime kho, bhikkhave, tayo gilānūpamā puggalā santo saṃvijjamānā lokasmi’’nti. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Saṅkhārasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "23"
      },
      ". ‘‘Tayome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Idha, bhikkhave, ekacco puggalo sabyābajjhaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sabyāpajjhaṃ (sabbattha) evamuparipi]"
      },
      " kāyasaṅkhāraṃ abhisaṅkharoti, sabyābajjhaṃ vacīsaṅkhāraṃ abhisaṅkharoti, sabyābajjhaṃ manosaṅkhāraṃ abhisaṅkharoti. So sabyābajjhaṃ kāyasaṅkhāraṃ abhisaṅkharitvā, sabyābajjhaṃ vacīsaṅkhāraṃ abhisaṅkharitvā, sabyābajjhaṃ manosaṅkhāraṃ abhisaṅkharitvā sabyābajjhaṃ lokaṃ upapajjati. Tamenaṃ sabyābajjhaṃ lokaṃ ",
      " upapannaṃ samānaṃ sabyābajjhā phassā phusanti. So sabyābajjhehi phassehi phuṭṭho samāno sabyābajjhaṃ vedanaṃ vedayati ekantadukkhaṃ, seyyathāpi sattā nerayikā."
    ],
    "innerText": "23. ‘‘Tayome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Idha, bhikkhave, ekacco puggalo sabyābajjhaṃ [sabyāpajjhaṃ (sabbattha) evamuparipi] kāyasaṅkhāraṃ abhisaṅkharoti, sabyābajjhaṃ vacīsaṅkhāraṃ abhisaṅkharoti, sabyābajjhaṃ manosaṅkhāraṃ abhisaṅkharoti. So sabyābajjhaṃ kāyasaṅkhāraṃ abhisaṅkharitvā, sabyābajjhaṃ vacīsaṅkhāraṃ abhisaṅkharitvā, sabyābajjhaṃ manosaṅkhāraṃ abhisaṅkharitvā sabyābajjhaṃ lokaṃ upapajjati. Tamenaṃ sabyābajjhaṃ lokaṃ upapannaṃ samānaṃ sabyābajjhā phassā phusanti. So sabyābajjhehi phassehi phuṭṭho samāno sabyābajjhaṃ vedanaṃ vedayati ekantadukkhaṃ, seyyathāpi sattā nerayikā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Idha pana, bhikkhave, ekacco puggalo abyābajjhaṃ kāyasaṅkhāraṃ abhisaṅkharoti, abyābajjhaṃ vacīsaṅkhāraṃ abhisaṅkharoti, abyābajjhaṃ manosaṅkhāraṃ abhisaṅkharoti. So abyābajjhaṃ kāyasaṅkhāraṃ abhisaṅkharitvā, abyābajjhaṃ vacīsaṅkhāraṃ abhisaṅkharitvā, abyābajjhaṃ manosaṅkhāraṃ abhisaṅkharitvā abyābajjhaṃ lokaṃ upapajjati. Tamenaṃ abyābajjhaṃ lokaṃ upapannaṃ samānaṃ abyābajjhā phassā phusanti. So abyābajjhehi phassehi phuṭṭho samāno abyābajjhaṃ vedanaṃ vedayati ekantasukhaṃ, seyyathāpi devā subhakiṇhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idha pana, bhikkhave, ekacco puggalo sabyābajjhampi abyābajjhampi kāyasaṅkhāraṃ abhisaṅkharoti, sabyābajjhampi abyābajjhampi vacīsaṅkhāraṃ abhisaṅkharoti, sabyābajjhampi abyābajjhampi manosaṅkhāraṃ abhisaṅkharoti. So sabyābajjhampi abyābajjhampi kāyasaṅkhāraṃ abhisaṅkharitvā, sabyābajjhampi abyābajjhampi vacīsaṅkhāraṃ abhisaṅkharitvā, sabyābajjhampi abyābajjhampi ",
      " manosaṅkhāraṃ abhisaṅkharitvā sabyābajjhampi abyābajjhampi lokaṃ upapajjati. Tamenaṃ sabyābajjhampi abyābajjhampi lokaṃ ",
      " upapannaṃ samānaṃ sabyābajjhāpi abyābajjhāpi phassā ",
      " phusanti. So sabyābajjhehipi abyābajjhehipi phassehi phuṭṭho samāno sabyābajjhampi abyābajjhampi vedanaṃ vedayati vokiṇṇasukhadukkhaṃ, seyyathāpi manussā ekacce ca devā ekacce ca vinipātikā. Ime kho, bhikkhave, tayo puggalā santo saṃvijjamānā lokasmi’’nti. Tatiyaṃ."
    ],
    "innerText": "‘‘Idha pana, bhikkhave, ekacco puggalo sabyābajjhampi abyābajjhampi kāyasaṅkhāraṃ abhisaṅkharoti, sabyābajjhampi abyābajjhampi vacīsaṅkhāraṃ abhisaṅkharoti, sabyābajjhampi abyābajjhampi manosaṅkhāraṃ abhisaṅkharoti. So sabyābajjhampi abyābajjhampi kāyasaṅkhāraṃ abhisaṅkharitvā, sabyābajjhampi abyābajjhampi vacīsaṅkhāraṃ abhisaṅkharitvā, sabyābajjhampi abyābajjhampi manosaṅkhāraṃ abhisaṅkharitvā sabyābajjhampi abyābajjhampi lokaṃ upapajjati. Tamenaṃ sabyābajjhampi abyābajjhampi lokaṃ upapannaṃ samānaṃ sabyābajjhāpi abyābajjhāpi phassā phusanti. So sabyābajjhehipi abyābajjhehipi phassehi phuṭṭho samāno sabyābajjhampi abyābajjhampi vedanaṃ vedayati vokiṇṇasukhadukkhaṃ, seyyathāpi manussā ekacce ca devā ekacce ca vinipātikā. Ime kho, bhikkhave, tayo puggalā santo saṃvijjamānā lokasmi’’nti. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Bahukārasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "24"
      },
      ". ‘‘Tayome ",
      ", bhikkhave, puggalā puggalassa bahukārā. Katame tayo? Yaṃ, bhikkhave, puggalaṃ āgamma puggalo buddhaṃ saraṇaṃ gato hoti, dhammaṃ saraṇaṃ gato hoti, saṅghaṃ saraṇaṃ gato hoti; ayaṃ, bhikkhave, puggalo imassa puggalassa bahukāro."
    ],
    "innerText": "24. ‘‘Tayome , bhikkhave, puggalā puggalassa bahukārā. Katame tayo? Yaṃ, bhikkhave, puggalaṃ āgamma puggalo buddhaṃ saraṇaṃ gato hoti, dhammaṃ saraṇaṃ gato hoti, saṅghaṃ saraṇaṃ gato hoti; ayaṃ, bhikkhave, puggalo imassa puggalassa bahukāro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, bhikkhave, yaṃ puggalaṃ āgamma puggalo ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhasamudayo’ti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhanirodho’ti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti; ayaṃ, bhikkhave, puggalo imassa puggalassa bahukāro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, bhikkhave, yaṃ puggalaṃ āgamma puggalo āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati; ayaṃ, bhikkhave, puggalo imassa puggalassa bahukāro. Ime kho, bhikkhave, tayo puggalā puggalassa bahukārā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Imehi ca pana, bhikkhave, tīhi puggalehi imassa puggalassa natthañño puggalo bahukāroti vadāmi. Imesaṃ pana, bhikkhave, tiṇṇaṃ puggalānaṃ iminā puggalena na suppatikāraṃ vadāmi, yadidaṃ abhivādanapaccuṭṭhānaañjalikammasāmīcikammacīvarapiṇḍapātasenāsana-gilānapaccayabhesajjaparikkhārānuppadānenā’’ti. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Vajirūpamasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "25"
      },
      ". ‘‘Tayome ",
      ", bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ ",
      ". Katame tayo? Arukūpamacitto puggalo, vijjūpamacitto puggalo, vajirūpamacitto puggalo. Katamo ca, bhikkhave, arukūpamacitto puggalo? Idha, bhikkhave, ekacco puggalo kodhano hoti upāyāsabahulo appampi ",
      " vutto ",
      " samāno abhisajjati kuppati byāpajjati patitthīyati kopañca dosañca appaccayañca pātukaroti. Seyyathāpi, bhikkhave, duṭṭhāruko ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[duṭṭhārukā (sī.)]"
      },
      " kaṭṭhena vā kaṭhalāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kathalāya (syā. kaṃ. ka.), kaṭhalena-kathalena (aṭṭhakathā)]"
      },
      " vā ghaṭṭito ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ghaṭṭitā (sī.)]"
      },
      " bhiyyosomattāya āsavaṃ deti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[assavanoti (sī.)]"
      },
      "; evamevaṃ kho, bhikkhave, idhekacco puggalo kodhano hoti upāyāsabahulo appampi vutto samāno abhisajjati kuppati byāpajjati patitthīyati kopañca dosañca appaccayañca pātukaroti. Ayaṃ vuccati, bhikkhave, arukūpamacitto puggalo."
    ],
    "innerText": "25. ‘‘Tayome , bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ . Katame tayo? Arukūpamacitto puggalo, vijjūpamacitto puggalo, vajirūpamacitto puggalo. Katamo ca, bhikkhave, arukūpamacitto puggalo? Idha, bhikkhave, ekacco puggalo kodhano hoti upāyāsabahulo appampi vutto samāno abhisajjati kuppati byāpajjati patitthīyati kopañca dosañca appaccayañca pātukaroti. Seyyathāpi, bhikkhave, duṭṭhāruko [duṭṭhārukā (sī.)] kaṭṭhena vā kaṭhalāya [kathalāya (syā. kaṃ. ka.), kaṭhalena-kathalena (aṭṭhakathā)] vā ghaṭṭito [ghaṭṭitā (sī.)] bhiyyosomattāya āsavaṃ deti [assavanoti (sī.)]; evamevaṃ kho, bhikkhave, idhekacco puggalo kodhano hoti upāyāsabahulo appampi vutto samāno abhisajjati kuppati byāpajjati patitthīyati kopañca dosañca appaccayañca pātukaroti. Ayaṃ vuccati, bhikkhave, arukūpamacitto puggalo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamo ca, bhikkhave, vijjūpamacitto puggalo? Idha, bhikkhave, ekacco puggalo ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhasamudayo’ti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhanirodho’ti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti. Seyyathāpi bhikkhave, cakkhumā puriso rattandhakāratimisāyaṃ vijjantarikāya rūpāni passeyya; evamevaṃ kho, bhikkhave, idhekacco puggalo ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti…pe… ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti. Ayaṃ vuccati, bhikkhave, vijjūpamacitto puggalo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamo ca, bhikkhave, vajirūpamacitto puggalo? Idha, bhikkhave, ekacco puggalo āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Seyyathāpi, bhikkhave, vajirassa natthi kiñci abhejjaṃ maṇi vā pāsāṇo vā; evamevaṃ kho, bhikkhave, idhekacco puggalo āsavānaṃ khayā…pe… upasampajja viharati. Ayaṃ vuccati, bhikkhave, vajirūpamacitto puggalo. ‘Ime kho, bhikkhave, tayo puggalā santo saṃvijjamānā ",
      " lokasmi’’’nti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pu. pa. 102]"
      },
      ". Pañcamaṃ."
    ],
    "innerText": "‘‘Katamo ca, bhikkhave, vajirūpamacitto puggalo? Idha, bhikkhave, ekacco puggalo āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Seyyathāpi, bhikkhave, vajirassa natthi kiñci abhejjaṃ maṇi vā pāsāṇo vā; evamevaṃ kho, bhikkhave, idhekacco puggalo āsavānaṃ khayā…pe… upasampajja viharati. Ayaṃ vuccati, bhikkhave, vajirūpamacitto puggalo. ‘Ime kho, bhikkhave, tayo puggalā santo saṃvijjamānā lokasmi’’’nti [pu. pa. 102]. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Sevitabbasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "26"
      },
      ". ‘‘Tayome ",
      ", bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Atthi, bhikkhave, puggalo na sevitabbo na bhajitabbo na payirupāsitabbo. Atthi, bhikkhave, puggalo sevitabbo bhajitabbo payirupāsitabbo. Atthi, bhikkhave, puggalo ",
      " sakkatvā garuṃ katvā sevitabbo bhajitabbo payirupāsitabbo. Katamo ca, bhikkhave, puggalo ",
      " na sevitabbo na bhajitabbo na payirupāsitabbo? Idha, bhikkhave, ekacco puggalo hīno hoti sīlena samādhinā paññāya. Evarūpo, bhikkhave, puggalo na sevitabbo na bhajitabbo na payirupāsitabbo aññatra anuddayā aññatra anukampā."
    ],
    "innerText": "26. ‘‘Tayome , bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Atthi, bhikkhave, puggalo na sevitabbo na bhajitabbo na payirupāsitabbo. Atthi, bhikkhave, puggalo sevitabbo bhajitabbo payirupāsitabbo. Atthi, bhikkhave, puggalo sakkatvā garuṃ katvā sevitabbo bhajitabbo payirupāsitabbo. Katamo ca, bhikkhave, puggalo na sevitabbo na bhajitabbo na payirupāsitabbo? Idha, bhikkhave, ekacco puggalo hīno hoti sīlena samādhinā paññāya. Evarūpo, bhikkhave, puggalo na sevitabbo na bhajitabbo na payirupāsitabbo aññatra anuddayā aññatra anukampā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamo ca, bhikkhave, puggalo sevitabbo bhajitabbo payirupāsitabbo? Idha, bhikkhave, ekacco puggalo sadiso hoti sīlena samādhinā paññāya. Evarūpo, bhikkhave, puggalo sevitabbo bhajitabbo payirupāsitabbo. Taṃ kissa hetu? Sīlasāmaññagatānaṃ sataṃ sīlakathā ca no bhavissati, sā ca no pavattinī ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pavattanī (sī. syā. kaṃ. pī.) pu. pa. 122 passitabbaṃ]"
      },
      " bhavissati, sā ca no phāsu bhavissati. Samādhisāmaññagatānaṃ sataṃ samādhikathā ca no bhavissati, sā ca no pavattinī bhavissati, sā ca no phāsu bhavissati. Paññāsāmaññagatānaṃ sataṃ paññākathā ca no bhavissati, sā ca no pavattinī bhavissati, sā ca no phāsu bhavissatīti. Tasmā evarūpo puggalo sevitabbo bhajitabbo payirupāsitabbo."
    ],
    "innerText": "‘‘Katamo ca, bhikkhave, puggalo sevitabbo bhajitabbo payirupāsitabbo? Idha, bhikkhave, ekacco puggalo sadiso hoti sīlena samādhinā paññāya. Evarūpo, bhikkhave, puggalo sevitabbo bhajitabbo payirupāsitabbo. Taṃ kissa hetu? Sīlasāmaññagatānaṃ sataṃ sīlakathā ca no bhavissati, sā ca no pavattinī [pavattanī (sī. syā. kaṃ. pī.) pu. pa. 122 passitabbaṃ] bhavissati, sā ca no phāsu bhavissati. Samādhisāmaññagatānaṃ sataṃ samādhikathā ca no bhavissati, sā ca no pavattinī bhavissati, sā ca no phāsu bhavissati. Paññāsāmaññagatānaṃ sataṃ paññākathā ca no bhavissati, sā ca no pavattinī bhavissati, sā ca no phāsu bhavissatīti. Tasmā evarūpo puggalo sevitabbo bhajitabbo payirupāsitabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamo ca, bhikkhave, puggalo sakkatvā garuṃ katvā sevitabbo bhajitabbo payirupāsitabbo? Idha, bhikkhave ",
      ", ekacco puggalo adhiko hoti sīlena samādhinā paññāya. Evarūpo, bhikkhave, puggalo sakkatvā garuṃ katvā sevitabbo bhajitabbo payirupāsitabbo. Taṃ kissa hetu? Iti aparipūraṃ vā sīlakkhandhaṃ paripūressāmi, paripūraṃ vā sīlakkhandhaṃ tattha tattha paññāya anuggahessāmi; aparipūraṃ vā samādhikkhandhaṃ paripūressāmi, paripūraṃ vā samādhikkhandhaṃ tattha tattha paññāya anuggahessāmi; aparipūraṃ vā paññākkhandhaṃ paripūressāmi, paripūraṃ vā paññākkhandhaṃ tattha tattha paññāya anuggahessāmīti. Tasmā evarūpo puggalo sakkatvā garuṃ katvā sevitabbo bhajitabbo payirupāsitabbo. Ime kho, bhikkhave, tayo puggalā santo saṃvijjamānā lokasmi’’nti."
    ],
    "innerText": "‘‘Katamo ca, bhikkhave, puggalo sakkatvā garuṃ katvā sevitabbo bhajitabbo payirupāsitabbo? Idha, bhikkhave , ekacco puggalo adhiko hoti sīlena samādhinā paññāya. Evarūpo, bhikkhave, puggalo sakkatvā garuṃ katvā sevitabbo bhajitabbo payirupāsitabbo. Taṃ kissa hetu? Iti aparipūraṃ vā sīlakkhandhaṃ paripūressāmi, paripūraṃ vā sīlakkhandhaṃ tattha tattha paññāya anuggahessāmi; aparipūraṃ vā samādhikkhandhaṃ paripūressāmi, paripūraṃ vā samādhikkhandhaṃ tattha tattha paññāya anuggahessāmi; aparipūraṃ vā paññākkhandhaṃ paripūressāmi, paripūraṃ vā paññākkhandhaṃ tattha tattha paññāya anuggahessāmīti. Tasmā evarūpo puggalo sakkatvā garuṃ katvā sevitabbo bhajitabbo payirupāsitabbo. Ime kho, bhikkhave, tayo puggalā santo saṃvijjamānā lokasmi’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Nihīyati ",
      " puriso nihīnasevī,"
    ],
    "innerText": "‘‘Nihīyati puriso nihīnasevī,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Na ca hāyetha kadāci tulyasevī;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Seṭṭhamupanamaṃ udeti khippaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tasmā attano uttariṃ bhajethā’’ti. chaṭṭhaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Jigucchitabbasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "27"
      },
      ". ‘‘Tayome ",
      ", bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Atthi, bhikkhave, puggalo jigucchitabbo na sevitabbo na bhajitabbo na payirupāsitabbo. Atthi, bhikkhave, puggalo ajjhupekkhitabbo na sevitabbo na bhajitabbo na payirupāsitabbo. Atthi, bhikkhave, puggalo sevitabbo bhajitabbo payirupāsitabbo. Katamo ca, bhikkhave, puggalo jigucchitabbo na sevitabbo na bhajitabbo na payirupāsitabbo? Idha ",
      ", bhikkhave, ekacco puggalo dussīlo hoti pāpadhammo asuci saṅkassarasamācāro paṭicchannakammanto, assamaṇo samaṇapaṭiñño, abrahmacārī brahmacāripaṭiñño, antopūti avassuto kasambujāto. Evarūpo, bhikkhave, puggalo jigucchitabbo na sevitabbo na bhajitabbo na payirupāsitabbo. Taṃ kissa hetu? Kiñcāpi, bhikkhave, evarūpassa puggalassa na diṭṭhānugatiṃ āpajjati, atha kho naṃ pāpako kittisaddo abbhuggacchati – ‘pāpamitto purisapuggalo pāpasahāyo pāpasampavaṅko’ti. Seyyathāpi, bhikkhave, ahi gūthagato kiñcāpi na daṃsati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ḍaṃsati (sī. syā.), ḍassati (pī.)]"
      },
      ", atha kho naṃ makkheti; evamevaṃ kho, bhikkhave, kiñcāpi evarūpassa puggalassa na diṭṭhānugatiṃ āpajjati, atha kho naṃ pāpako kittisaddo abbhuggacchati – ‘pāpamitto purisapuggalo pāpasahāyo pāpasampavaṅko’ti. Tasmā evarūpo puggalo jigucchitabbo na sevitabbo na bhajitabbo na payirupāsitabbo."
    ],
    "innerText": "27. ‘‘Tayome , bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Atthi, bhikkhave, puggalo jigucchitabbo na sevitabbo na bhajitabbo na payirupāsitabbo. Atthi, bhikkhave, puggalo ajjhupekkhitabbo na sevitabbo na bhajitabbo na payirupāsitabbo. Atthi, bhikkhave, puggalo sevitabbo bhajitabbo payirupāsitabbo. Katamo ca, bhikkhave, puggalo jigucchitabbo na sevitabbo na bhajitabbo na payirupāsitabbo? Idha , bhikkhave, ekacco puggalo dussīlo hoti pāpadhammo asuci saṅkassarasamācāro paṭicchannakammanto, assamaṇo samaṇapaṭiñño, abrahmacārī brahmacāripaṭiñño, antopūti avassuto kasambujāto. Evarūpo, bhikkhave, puggalo jigucchitabbo na sevitabbo na bhajitabbo na payirupāsitabbo. Taṃ kissa hetu? Kiñcāpi, bhikkhave, evarūpassa puggalassa na diṭṭhānugatiṃ āpajjati, atha kho naṃ pāpako kittisaddo abbhuggacchati – ‘pāpamitto purisapuggalo pāpasahāyo pāpasampavaṅko’ti. Seyyathāpi, bhikkhave, ahi gūthagato kiñcāpi na daṃsati [ḍaṃsati (sī. syā.), ḍassati (pī.)], atha kho naṃ makkheti; evamevaṃ kho, bhikkhave, kiñcāpi evarūpassa puggalassa na diṭṭhānugatiṃ āpajjati, atha kho naṃ pāpako kittisaddo abbhuggacchati – ‘pāpamitto purisapuggalo pāpasahāyo pāpasampavaṅko’ti. Tasmā evarūpo puggalo jigucchitabbo na sevitabbo na bhajitabbo na payirupāsitabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamo ca, bhikkhave, puggalo ajjhupekkhitabbo na sevitabbo na bhajitabbo na payirupāsitabbo? Idha, bhikkhave, ekacco puggalo kodhano hoti upāyāsabahulo ",
      ", appampi vutto samāno abhisajjati kuppati byāpajjati patitthīyati, kopañca dosañca appaccayañca pātukaroti. Seyyathāpi, bhikkhave, duṭṭhāruko kaṭṭhena vā kaṭhalāya vā ghaṭṭito bhiyyosomattāya āsavaṃ deti; evamevaṃ kho, bhikkhave…pe… seyyathāpi, bhikkhave, tindukālātaṃ ",
      " kaṭṭhena ",
      " vā kaṭhalāya vā ghaṭṭitaṃ bhiyyosomattāya cicciṭāyati ciṭiciṭāyati; evamevaṃ kho bhikkhave…pe… seyyathāpi, bhikkhave, gūthakūpo kaṭṭhena vā kaṭhalāya vā ghaṭṭito bhiyyosomattāya duggandho hoti; evamevaṃ kho, bhikkhave, idhekacco puggalo ",
      " kodhano hoti upāyāsabahulo, appampi vutto samāno abhisajjati kuppati byāpajjati patitthīyati, kopañca dosañca appaccayañca pātukaroti. Evarūpo, bhikkhave, puggalo ajjhupekkhitabbo na sevitabbo na bhajitabbo na payirupāsitabbo. Taṃ kissa hetu? Akkoseyyapi maṃ paribhāseyyapi maṃ anatthampi maṃ kareyyāti. Tasmā evarūpo puggalo ajjhupekkhitabbo na sevitabbo na bhajitabbo na payirupāsitabbo."
    ],
    "innerText": "‘‘Katamo ca, bhikkhave, puggalo ajjhupekkhitabbo na sevitabbo na bhajitabbo na payirupāsitabbo? Idha, bhikkhave, ekacco puggalo kodhano hoti upāyāsabahulo , appampi vutto samāno abhisajjati kuppati byāpajjati patitthīyati, kopañca dosañca appaccayañca pātukaroti. Seyyathāpi, bhikkhave, duṭṭhāruko kaṭṭhena vā kaṭhalāya vā ghaṭṭito bhiyyosomattāya āsavaṃ deti; evamevaṃ kho, bhikkhave…pe… seyyathāpi, bhikkhave, tindukālātaṃ kaṭṭhena vā kaṭhalāya vā ghaṭṭitaṃ bhiyyosomattāya cicciṭāyati ciṭiciṭāyati; evamevaṃ kho bhikkhave…pe… seyyathāpi, bhikkhave, gūthakūpo kaṭṭhena vā kaṭhalāya vā ghaṭṭito bhiyyosomattāya duggandho hoti; evamevaṃ kho, bhikkhave, idhekacco puggalo kodhano hoti upāyāsabahulo, appampi vutto samāno abhisajjati kuppati byāpajjati patitthīyati, kopañca dosañca appaccayañca pātukaroti. Evarūpo, bhikkhave, puggalo ajjhupekkhitabbo na sevitabbo na bhajitabbo na payirupāsitabbo. Taṃ kissa hetu? Akkoseyyapi maṃ paribhāseyyapi maṃ anatthampi maṃ kareyyāti. Tasmā evarūpo puggalo ajjhupekkhitabbo na sevitabbo na bhajitabbo na payirupāsitabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamo ca, bhikkhave, puggalo sevitabbo bhajitabbo payirupāsitabbo? Idha, bhikkhave, ekacco puggalo sīlavā hoti kalyāṇadhammo. Evarūpo, bhikkhave, puggalo sevitabbo bhajitabbo payirupāsitabbo. Taṃ kissa hetu? Kiñcāpi, bhikkhave, evarūpassa puggalassa na diṭṭhānugatiṃ āpajjati, atha kho naṃ kalyāṇo kittisaddo abbhuggacchati – ‘kalyāṇamitto purisapuggalo kalyāṇasahāyo kalyāṇasampavaṅko’ti. Tasmā evarūpo puggalo sevitabbo bhajitabbo payirupāsitabbo. ‘Ime kho, bhikkhave, tayo puggalā santo saṃvijjamānā lokasmi’’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Nihīyati ",
      " puriso nihīnasevī,"
    ],
    "innerText": "‘‘Nihīyati puriso nihīnasevī,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Na ca hāyetha kadāci tulyasevī;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Seṭṭhamupanamaṃ udeti khippaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tasmā attano uttariṃ bhajethā’’ti. sattamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Gūthabhāṇīsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "28"
      },
      ". ‘‘Tayome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ ",
      ". Katame tayo? Gūthabhāṇī, pupphabhāṇī, madhubhāṇī. Katamo ca, bhikkhave, puggalo gūthabhāṇī? Idha, bhikkhave, ekacco puggalo sabhaggato vā parisaggato vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sabhāgato vā parisāgato vā (syā. kaṃ.)]"
      },
      " ñātimajjhagato vā pūgamajjhagato vā rājakulamajjhagato vā abhinīto sakkhipuṭṭho – ‘ehambho purisa, yaṃ jānāsi taṃ vadehī’ti. So ",
      " ajānaṃ vā āha ‘jānāmī’ti, jānaṃ vā āha ‘na jānāmī’ti, apassaṃ vā āha ‘passāmī’ti, passaṃ vā āha ‘na ",
      " passāmī’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ma. ni. 1.440; pu. pa. 91]"
      },
      "; iti attahetu vā parahetu vā āmisakiñcikkhahetu vā sampajānamusā bhāsitā hoti. Ayaṃ vuccati, bhikkhave, puggalo gūthabhāṇī."
    ],
    "innerText": "28. ‘‘Tayome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ . Katame tayo? Gūthabhāṇī, pupphabhāṇī, madhubhāṇī. Katamo ca, bhikkhave, puggalo gūthabhāṇī? Idha, bhikkhave, ekacco puggalo sabhaggato vā parisaggato vā [sabhāgato vā parisāgato vā (syā. kaṃ.)] ñātimajjhagato vā pūgamajjhagato vā rājakulamajjhagato vā abhinīto sakkhipuṭṭho – ‘ehambho purisa, yaṃ jānāsi taṃ vadehī’ti. So ajānaṃ vā āha ‘jānāmī’ti, jānaṃ vā āha ‘na jānāmī’ti, apassaṃ vā āha ‘passāmī’ti, passaṃ vā āha ‘na passāmī’ti [ma. ni. 1.440; pu. pa. 91]; iti attahetu vā parahetu vā āmisakiñcikkhahetu vā sampajānamusā bhāsitā hoti. Ayaṃ vuccati, bhikkhave, puggalo gūthabhāṇī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamo ca, bhikkhave, puggalo pupphabhāṇī? Idha, bhikkhave, ekacco puggalo sabhaggato vā parisaggato vā ñātimajjhagato vā pūgamajjhagato vā rājakulamajjhagato vā abhinīto sakkhipuṭṭho – ‘ehambho purisa, yaṃ pajānāsi taṃ vadehī’ti, so ajānaṃ vā āha ‘na jānāmī’ti, jānaṃ vā āha ‘jānāmī’ti, apassaṃ vā āha ‘na passāmī’ti, passaṃ vā āha ‘passāmī’ti; iti attahetu vā parahetu vā āmisakiñcikkhahetu vā na sampajānamusā bhāsitā hoti. Ayaṃ vuccati, bhikkhave, puggalo ",
      " pupphabhāṇī."
    ],
    "innerText": "‘‘Katamo ca, bhikkhave, puggalo pupphabhāṇī? Idha, bhikkhave, ekacco puggalo sabhaggato vā parisaggato vā ñātimajjhagato vā pūgamajjhagato vā rājakulamajjhagato vā abhinīto sakkhipuṭṭho – ‘ehambho purisa, yaṃ pajānāsi taṃ vadehī’ti, so ajānaṃ vā āha ‘na jānāmī’ti, jānaṃ vā āha ‘jānāmī’ti, apassaṃ vā āha ‘na passāmī’ti, passaṃ vā āha ‘passāmī’ti; iti attahetu vā parahetu vā āmisakiñcikkhahetu vā na sampajānamusā bhāsitā hoti. Ayaṃ vuccati, bhikkhave, puggalo pupphabhāṇī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamo ca, bhikkhave, puggalo madhubhāṇī? Idha, bhikkhave, ekacco puggalo pharusaṃ vācaṃ pahāya pharusāya vācāya paṭivirato hoti; yā sā vācā nelā kaṇṇasukhā pemanīyā hadayaṅgamā porī bahujanakantā bahujanamanāpā tathārūpiṃ vācaṃ bhāsitā hoti. Ayaṃ vuccati, bhikkhave, puggalo madhubhāṇī. Ime kho, bhikkhave, tayo puggalā santo saṃvijjamānā lokasmi’’nti. Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Andhasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "29"
      },
      ". ‘‘Tayome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Andho, ekacakkhu, dvicakkhu. Katamo ca, bhikkhave, puggalo andho? Idha, bhikkhave, ekaccassa puggalassa tathārūpaṃ cakkhu na ",
      " hoti yathārūpena cakkhunā anadhigataṃ vā bhogaṃ adhigaccheyya adhigataṃ vā bhogaṃ phātiṃ kareyya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[phātikareyya (sī.)]"
      },
      "; tathārūpampissa cakkhu na hoti yathārūpena cakkhunā kusalākusale dhamme jāneyya, sāvajjānavajje dhamme jāneyya, hīnappaṇīte dhamme jāneyya, kaṇhasukkasappaṭibhāge dhamme jāneyya. Ayaṃ vuccati, bhikkhave, puggalo andho."
    ],
    "innerText": "29. ‘‘Tayome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Andho, ekacakkhu, dvicakkhu. Katamo ca, bhikkhave, puggalo andho? Idha, bhikkhave, ekaccassa puggalassa tathārūpaṃ cakkhu na hoti yathārūpena cakkhunā anadhigataṃ vā bhogaṃ adhigaccheyya adhigataṃ vā bhogaṃ phātiṃ kareyya [phātikareyya (sī.)]; tathārūpampissa cakkhu na hoti yathārūpena cakkhunā kusalākusale dhamme jāneyya, sāvajjānavajje dhamme jāneyya, hīnappaṇīte dhamme jāneyya, kaṇhasukkasappaṭibhāge dhamme jāneyya. Ayaṃ vuccati, bhikkhave, puggalo andho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamo ca, bhikkhave, puggalo ekacakkhu? Idha, bhikkhave, ekaccassa puggalassa tathārūpaṃ ",
      " cakkhu hoti yathārūpena cakkhunā anadhigataṃ vā bhogaṃ ",
      " adhigaccheyya adhigataṃ vā bhogaṃ phātiṃ kareyya; tathārūpaṃ panassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[tathārūpampissa (syā. kaṃ. pī. ka.)]"
      },
      " cakkhu na hoti yathārūpena cakkhunā kusalākusale dhamme jāneyya, sāvajjānavajje dhamme jāneyya, hīnappaṇīte dhamme jāneyya, kaṇhasukkasappaṭibhāge ",
      " dhamme jāneyya. Ayaṃ vuccati, bhikkhave, puggalo ekacakkhu."
    ],
    "innerText": "‘‘Katamo ca, bhikkhave, puggalo ekacakkhu? Idha, bhikkhave, ekaccassa puggalassa tathārūpaṃ cakkhu hoti yathārūpena cakkhunā anadhigataṃ vā bhogaṃ adhigaccheyya adhigataṃ vā bhogaṃ phātiṃ kareyya; tathārūpaṃ panassa [tathārūpampissa (syā. kaṃ. pī. ka.)] cakkhu na hoti yathārūpena cakkhunā kusalākusale dhamme jāneyya, sāvajjānavajje dhamme jāneyya, hīnappaṇīte dhamme jāneyya, kaṇhasukkasappaṭibhāge dhamme jāneyya. Ayaṃ vuccati, bhikkhave, puggalo ekacakkhu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamo ca, bhikkhave, puggalo dvicakkhu? Idha, bhikkhave, ekaccassa puggalassa tathārūpaṃ cakkhu hoti yathārūpena cakkhunā anadhigataṃ vā bhogaṃ adhigaccheyya, adhigataṃ vā bhogaṃ phātiṃ kareyya; tathārūpampissa cakkhu hoti yathārūpena cakkhunā kusalākusale dhamme jāneyya; sāvajjānavajje dhamme jāneyya, hīnappaṇīte dhamme jāneyya, kaṇhasukkasappaṭibhāge dhamme jāneyya. Ayaṃ vuccati, bhikkhave, puggalo dvicakkhu. ‘Ime kho, bhikkhave, tayo puggalā santo saṃvijjamānā lokasmi’’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Na ceva bhogā tathārūpā, na ca puññāni kubbati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ubhayattha kaliggāho, andhassa hatacakkhuno."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Athāparāyaṃ akkhāto, ekacakkhu ca puggalo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Dhammādhammena saṭhoso ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[saṃsaṭṭho (sī. syā. kaṃ. pī.), saṭhoti (ka.)]"
      },
      ", bhogāni pariyesati."
    ],
    "innerText": "Dhammādhammena saṭhoso [saṃsaṭṭho (sī. syā. kaṃ. pī.), saṭhoti (ka.)], bhogāni pariyesati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Theyyena kūṭakammena, musāvādena cūbhayaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "children": [
      "Kusalo hoti saṅghātuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[saṃhātuṃ (syā.)]"
      },
      ", kāmabhogī ca mānavo;"
    ],
    "innerText": "Kusalo hoti saṅghātuṃ [saṃhātuṃ (syā.)], kāmabhogī ca mānavo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ito so nirayaṃ gantvā, ekacakkhu vihaññati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Dvicakkhu pana akkhāto, seṭṭho purisapuggalo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dhammaladdhehi bhogehi, uṭṭhānādhigataṃ dhanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Dadāti ",
      " seṭṭhasaṅkappo, abyaggamānaso naro;"
    ],
    "innerText": "‘‘Dadāti seṭṭhasaṅkappo, abyaggamānaso naro;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Upeti bhaddakaṃ ṭhānaṃ, yattha gantvā na socati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Andhañca ",
      " ekacakkhuñca, ārakā parivajjaye;"
    ],
    "innerText": "‘‘Andhañca ekacakkhuñca, ārakā parivajjaye;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Dvicakkhuṃ ",
      " pana sevetha, seṭṭhaṃ purisapuggala’’nti. navamaṃ;"
    ],
    "innerText": "Dvicakkhuṃ pana sevetha, seṭṭhaṃ purisapuggala’’nti. navamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Avakujjasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "30"
      },
      ". ‘‘Tayome ",
      ", bhikkhave ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pu. pa. 107-108]"
      },
      ", puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Avakujjapañño puggalo, ucchaṅgapañño puggalo, puthupañño puggalo. Katamo ca, bhikkhave, avakujjapañño puggalo? Idha, bhikkhave, ekacco puggalo ārāmaṃ gantā hoti abhikkhaṇaṃ bhikkhūnaṃ santike dhammassavanāya. Tassa bhikkhū dhammaṃ desenti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāsenti. So tasmiṃ āsane nisinno tassā kathāya neva ādiṃ manasi karoti, na majjhaṃ manasi karoti, na pariyosānaṃ manasi karoti; vuṭṭhitopi tamhā āsanā tassā kathāya neva ādiṃ manasi karoti, na majjhaṃ manasi karoti, na pariyosānaṃ manasi karoti. Seyyathāpi, bhikkhave, kumbho nikkujjo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[nikkujjo (sī. pī.)]"
      },
      " tatra udakaṃ āsittaṃ vivaṭṭati, no saṇṭhāti; evamevaṃ kho, bhikkhave, idhekacco puggalo ārāmaṃ gantā hoti abhikkhaṇaṃ bhikkhūnaṃ santike dhammassavanāya. Tassa bhikkhū dhammaṃ desenti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāsenti. So tasmiṃ āsane nisinno tassā kathāya neva ādiṃ manasi karoti, na majjhaṃ manasi karoti, na pariyosānaṃ manasi karoti; vuṭṭhitopi tamhā āsanā tassā kathāya nevādiṃ manasi karoti, na majjhaṃ manasi karoti, na pariyosānaṃ manasi karoti. Ayaṃ vuccati, bhikkhave, avakujjapañño ",
      " puggalo."
    ],
    "innerText": "30. ‘‘Tayome , bhikkhave [pu. pa. 107-108], puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Avakujjapañño puggalo, ucchaṅgapañño puggalo, puthupañño puggalo. Katamo ca, bhikkhave, avakujjapañño puggalo? Idha, bhikkhave, ekacco puggalo ārāmaṃ gantā hoti abhikkhaṇaṃ bhikkhūnaṃ santike dhammassavanāya. Tassa bhikkhū dhammaṃ desenti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāsenti. So tasmiṃ āsane nisinno tassā kathāya neva ādiṃ manasi karoti, na majjhaṃ manasi karoti, na pariyosānaṃ manasi karoti; vuṭṭhitopi tamhā āsanā tassā kathāya neva ādiṃ manasi karoti, na majjhaṃ manasi karoti, na pariyosānaṃ manasi karoti. Seyyathāpi, bhikkhave, kumbho nikkujjo [nikkujjo (sī. pī.)] tatra udakaṃ āsittaṃ vivaṭṭati, no saṇṭhāti; evamevaṃ kho, bhikkhave, idhekacco puggalo ārāmaṃ gantā hoti abhikkhaṇaṃ bhikkhūnaṃ santike dhammassavanāya. Tassa bhikkhū dhammaṃ desenti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāsenti. So tasmiṃ āsane nisinno tassā kathāya neva ādiṃ manasi karoti, na majjhaṃ manasi karoti, na pariyosānaṃ manasi karoti; vuṭṭhitopi tamhā āsanā tassā kathāya nevādiṃ manasi karoti, na majjhaṃ manasi karoti, na pariyosānaṃ manasi karoti. Ayaṃ vuccati, bhikkhave, avakujjapañño puggalo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamo ca, bhikkhave, ucchaṅgapañño puggalo? Idha, bhikkhave, ekacco puggalo ārāmaṃ gantā hoti abhikkhaṇaṃ bhikkhūnaṃ santike dhammassavanāya. Tassa bhikkhū dhammaṃ desenti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāsenti. So tasmiṃ āsane nisinno tassā kathāya ādimpi manasi karoti, majjhampi manasi karoti, pariyosānampi manasi karoti; vuṭṭhito ca kho tamhā āsanā tassā kathāya nevādiṃ manasi karoti, na majjhaṃ manasi karoti, na pariyosānaṃ manasi karoti. Seyyathāpi, bhikkhave, purisassa ucchaṅge nānākhajjakāni ākiṇṇāni – tilā ",
      " taṇḍulā modakā badarā. So tamhā āsanā vuṭṭhahanto ",
      " satisammosā pakireyya ",
      ". Evamevaṃ kho, bhikkhave, idhekacco puggalo ārāmaṃ gantā hoti abhikkhaṇaṃ bhikkhūnaṃ santike dhammassavanāya. Tassa bhikkhū dhammaṃ desenti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāsenti. So tasmiṃ āsane nisinno tassā kathāya ādimpi manasi karoti, majjhampi manasi karoti, pariyosānampi manasi karoti; vuṭṭhito ca kho tamhā āsanā tassā kathāya neva ādiṃ manasi karoti, na majjhaṃ manasi karoti, na pariyosānaṃ manasi karoti. Ayaṃ vuccati, bhikkhave, ucchaṅgapañño puggalo."
    ],
    "innerText": "‘‘Katamo ca, bhikkhave, ucchaṅgapañño puggalo? Idha, bhikkhave, ekacco puggalo ārāmaṃ gantā hoti abhikkhaṇaṃ bhikkhūnaṃ santike dhammassavanāya. Tassa bhikkhū dhammaṃ desenti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāsenti. So tasmiṃ āsane nisinno tassā kathāya ādimpi manasi karoti, majjhampi manasi karoti, pariyosānampi manasi karoti; vuṭṭhito ca kho tamhā āsanā tassā kathāya nevādiṃ manasi karoti, na majjhaṃ manasi karoti, na pariyosānaṃ manasi karoti. Seyyathāpi, bhikkhave, purisassa ucchaṅge nānākhajjakāni ākiṇṇāni – tilā taṇḍulā modakā badarā. So tamhā āsanā vuṭṭhahanto satisammosā pakireyya . Evamevaṃ kho, bhikkhave, idhekacco puggalo ārāmaṃ gantā hoti abhikkhaṇaṃ bhikkhūnaṃ santike dhammassavanāya. Tassa bhikkhū dhammaṃ desenti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāsenti. So tasmiṃ āsane nisinno tassā kathāya ādimpi manasi karoti, majjhampi manasi karoti, pariyosānampi manasi karoti; vuṭṭhito ca kho tamhā āsanā tassā kathāya neva ādiṃ manasi karoti, na majjhaṃ manasi karoti, na pariyosānaṃ manasi karoti. Ayaṃ vuccati, bhikkhave, ucchaṅgapañño puggalo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamo ca, bhikkhave, puthupañño puggalo? Idha, bhikkhave, ekacco puggalo ārāmaṃ gantā hoti abhikkhaṇaṃ bhikkhūnaṃ ",
      " santike dhammassavanāya. Tassa bhikkhū dhammaṃ desenti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāsenti. So tasmiṃ āsane nisinno tassā kathāya ādimpi manasi karoti, majjhampi manasi karoti, pariyosānampi manasi karoti; vuṭṭhitopi tamhā āsanā tassā kathāya ādimpi manasi karoti, majjhampi manasi karoti, pariyosānampi manasi karoti. Seyyathāpi, bhikkhave, kumbho ukkujjo tatra udakaṃ āsittaṃ saṇṭhāti no vivaṭṭati; evamevaṃ kho, bhikkhave, idhekacco puggalo ārāmaṃ gantā hoti abhikkhaṇaṃ bhikkhūnaṃ santike dhammassavanāya. Tassa bhikkhū dhammaṃ desenti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāsenti. So tasmiṃ āsane nisinno tassā kathāya ādimpi manasi karoti, majjhampi manasi karoti, pariyosānampi manasi karoti; vuṭṭhitopi tamhā āsanā tassā kathāya ādimpi manasi karoti, majjhampi manasi karoti, pariyosānampi manasi karoti. Ayaṃ vuccati, bhikkhave, puthupañño puggalo. ‘Ime kho, bhikkhave, tayo puggalā santo saṃvijjamānā lokasmi’’’nti."
    ],
    "innerText": "‘‘Katamo ca, bhikkhave, puthupañño puggalo? Idha, bhikkhave, ekacco puggalo ārāmaṃ gantā hoti abhikkhaṇaṃ bhikkhūnaṃ santike dhammassavanāya. Tassa bhikkhū dhammaṃ desenti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāsenti. So tasmiṃ āsane nisinno tassā kathāya ādimpi manasi karoti, majjhampi manasi karoti, pariyosānampi manasi karoti; vuṭṭhitopi tamhā āsanā tassā kathāya ādimpi manasi karoti, majjhampi manasi karoti, pariyosānampi manasi karoti. Seyyathāpi, bhikkhave, kumbho ukkujjo tatra udakaṃ āsittaṃ saṇṭhāti no vivaṭṭati; evamevaṃ kho, bhikkhave, idhekacco puggalo ārāmaṃ gantā hoti abhikkhaṇaṃ bhikkhūnaṃ santike dhammassavanāya. Tassa bhikkhū dhammaṃ desenti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāsenti. So tasmiṃ āsane nisinno tassā kathāya ādimpi manasi karoti, majjhampi manasi karoti, pariyosānampi manasi karoti; vuṭṭhitopi tamhā āsanā tassā kathāya ādimpi manasi karoti, majjhampi manasi karoti, pariyosānampi manasi karoti. Ayaṃ vuccati, bhikkhave, puthupañño puggalo. ‘Ime kho, bhikkhave, tayo puggalā santo saṃvijjamānā lokasmi’’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Avakujjapañño puriso, dummedho avicakkhaṇo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Abhikkhaṇampi ce hoti, gantā bhikkhūna santike."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Ādiṃ ",
      " kathāya majjhañca, pariyosānañca tādiso;"
    ],
    "innerText": "‘‘Ādiṃ kathāya majjhañca, pariyosānañca tādiso;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Uggahetuṃ na sakkoti, paññā hissa na vijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Ucchaṅgapañño ",
      " puriso, seyyo etena vuccati;"
    ],
    "innerText": "‘‘Ucchaṅgapañño puriso, seyyo etena vuccati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Abhikkhaṇampi ce hoti, gantā bhikkhūna santike."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ādiṃ kathāya majjhañca, pariyosānañca tādiso;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Nisinno āsane tasmiṃ, uggahetvāna byañjanaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Vuṭṭhito nappajānāti, gahitaṃ hissa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[gahitampissa (ka.)]"
      },
      " mussati."
    ],
    "innerText": "Vuṭṭhito nappajānāti, gahitaṃ hissa [gahitampissa (ka.)] mussati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Puthupañño ca puriso, seyyo etehi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[etena (ka.)]"
      },
      " vuccati;"
    ],
    "innerText": "‘‘Puthupañño ca puriso, seyyo etehi [etena (ka.)] vuccati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Abhikkhaṇampi ce hoti, gantā bhikkhūna santike."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ādiṃ kathāya majjhañca, pariyosānañca tādiso;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nisinno āsane tasmiṃ, uggahetvāna byañjanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Dhāreti seṭṭhasaṅkappo, abyaggamānaso naro;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dhammānudhammappaṭipanno, dukkhassantakaro siyā’’ti. dasamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Puggalavaggo tatiyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Samiddha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kāyasakkhi (sī.), saviṭṭha (syā. kaṃ.), seṭṭha (ka.)]"
      },
      " -gilāna-saṅkhārā, bahukārā vajirena ca;"
    ],
    "innerText": "Samiddha [kāyasakkhi (sī.), saviṭṭha (syā. kaṃ.), seṭṭha (ka.)] -gilāna-saṅkhārā, bahukārā vajirena ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sevi-jiguccha-gūthabhāṇī, andho ca avakujjatāti."
  }
]