[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "(17) 2. Paṭipadāvaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Saṃkhittasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "161"
      },
      ". Dutiyassa ",
      " paṭhame sukhapaṭikkhepena dukkhā paṭipajjitabbato paṭipadā etissāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dukkhāpaṭipadā"
      },
      ". Asīghappavattitāya garubhāvena dandhā abhiññā etissāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dandhābhiññā"
      },
      ". Imināva nayena sabbapadesu attho veditabbo."
    ],
    "innerText": "161. Dutiyassa paṭhame sukhapaṭikkhepena dukkhā paṭipajjitabbato paṭipadā etissāti dukkhāpaṭipadā. Asīghappavattitāya garubhāvena dandhā abhiññā etissāti dandhābhiññā. Imināva nayena sabbapadesu attho veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Vitthārasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "162"
      },
      ". Dutiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhikkhaṇa"
      },
      "nti abhiṇhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ānantariya"
      },
      "nti anantaravipākadāyakaṃ maggasamādhiṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āsavānaṃ khayāyā"
      },
      "ti arahattaphalatthāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañcindriyānī"
      },
      "ti vipassanāpañcamakāni pañcindriyāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññindriya"
      },
      "nti hi ettha vipassanāpaññāva paññindriyanti adhippetaṃ. Sesamettha pāḷivasena uttānameva."
    ],
    "innerText": "162. Dutiye abhikkhaṇanti abhiṇhaṃ. Ānantariyanti anantaravipākadāyakaṃ maggasamādhiṃ. Āsavānaṃ khayāyāti arahattaphalatthāya. Pañcindriyānīti vipassanāpañcamakāni pañcindriyāni. Paññindriyanti hi ettha vipassanāpaññāva paññindriyanti adhippetaṃ. Sesamettha pāḷivasena uttānameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Imāsaṃ pana paṭipadānaṃ ayaṃ āvibhāvakathā – idha bhikkhu pubbe akatābhiniveso pubbabhāge rūpapariggahe kilamati, arūpapariggahe kilamati, paccayapariggahe kilamati, tīsu addhāsu kilamati, maggāmagge kilamati. Evaṃ pañcasu ",
      " ṭhānesu kilamanto vipassanaṃ pāpuṇāti. Vipassanaṃ patvāpi udayabbayānupassane, bhaṅgānupassane, bhayatupaṭṭhāne, ādīnavānupassane, nibbidānupassane, muccitukamyatāñāṇe, saṅkhārupekkhāñāṇe, anulomañāṇe, gotrabhuñāṇeti imesu navasu vipassanāñāṇesupi kilamitvāva lokuttaramaggaṃ pāpuṇāti. Tassa so lokuttaramaggo evaṃ dukkhena garubhāvena sacchikatattā dukkhapaṭipado dandhābhiñño nāma jāto. Yo pana pubbabhāge pañcasu ñāṇesu kilamanto aparabhāge navasu vipassanāñāṇesu akilamitvāva maggaṃ sacchikaroti, tassa so maggo evaṃ dukkhena agarubhāvena sacchikatattā dukkhapaṭipado khippābhiñño nāma jāto. Iminā upāyena itarāpi dve veditabbā."
    ],
    "innerText": "Imāsaṃ pana paṭipadānaṃ ayaṃ āvibhāvakathā – idha bhikkhu pubbe akatābhiniveso pubbabhāge rūpapariggahe kilamati, arūpapariggahe kilamati, paccayapariggahe kilamati, tīsu addhāsu kilamati, maggāmagge kilamati. Evaṃ pañcasu ṭhānesu kilamanto vipassanaṃ pāpuṇāti. Vipassanaṃ patvāpi udayabbayānupassane, bhaṅgānupassane, bhayatupaṭṭhāne, ādīnavānupassane, nibbidānupassane, muccitukamyatāñāṇe, saṅkhārupekkhāñāṇe, anulomañāṇe, gotrabhuñāṇeti imesu navasu vipassanāñāṇesupi kilamitvāva lokuttaramaggaṃ pāpuṇāti. Tassa so lokuttaramaggo evaṃ dukkhena garubhāvena sacchikatattā dukkhapaṭipado dandhābhiñño nāma jāto. Yo pana pubbabhāge pañcasu ñāṇesu kilamanto aparabhāge navasu vipassanāñāṇesu akilamitvāva maggaṃ sacchikaroti, tassa so maggo evaṃ dukkhena agarubhāvena sacchikatattā dukkhapaṭipado khippābhiñño nāma jāto. Iminā upāyena itarāpi dve veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Goṇapariyesakaupamāhi ",
      " cetā vibhāvetabbā – ekassa hi purisassa cattāro goṇā palāyitvā aṭaviṃ paviṭṭhā. So sakaṇṭake sagahane vane te pariyesanto gahanamaggeneva kicchena kasirena gantvā gahanaṭṭhāneyeva nilīne goṇepi kicchena kasirena addasa. Eko kicchena gantvā abbhokāse ṭhite khippameva addasa. Aparo abbhokāsamaggena sukhena gantvā gahanaṭṭhāne nilīne kicchena kasirena addasa. Aparo abbhokāsamaggeneva sukhena gantvā abbhokāse ṭhiteyeva khippaṃ addasa. Tattha cattāro goṇā viya cattāro ariyamaggā daṭṭhabbā, goṇapariyesako puriso viya yogāvacaro, gahanamaggena kicchena kasirena ",
      " gamanaṃ viya pubbabhāge pañcasu ñāṇesu kilamato dukkhāpaṭipadā. Gahanaṭṭhāne nilīnānaṃ kiccheneva dassanaṃ viya aparabhāge navasu ñāṇesu kilamantassa ",
      " ariyamaggānaṃ dassanaṃ. Iminā upāyena sesaupamāpi yojetabbā."
    ],
    "innerText": "Goṇapariyesakaupamāhi cetā vibhāvetabbā – ekassa hi purisassa cattāro goṇā palāyitvā aṭaviṃ paviṭṭhā. So sakaṇṭake sagahane vane te pariyesanto gahanamaggeneva kicchena kasirena gantvā gahanaṭṭhāneyeva nilīne goṇepi kicchena kasirena addasa. Eko kicchena gantvā abbhokāse ṭhite khippameva addasa. Aparo abbhokāsamaggena sukhena gantvā gahanaṭṭhāne nilīne kicchena kasirena addasa. Aparo abbhokāsamaggeneva sukhena gantvā abbhokāse ṭhiteyeva khippaṃ addasa. Tattha cattāro goṇā viya cattāro ariyamaggā daṭṭhabbā, goṇapariyesako puriso viya yogāvacaro, gahanamaggena kicchena kasirena gamanaṃ viya pubbabhāge pañcasu ñāṇesu kilamato dukkhāpaṭipadā. Gahanaṭṭhāne nilīnānaṃ kiccheneva dassanaṃ viya aparabhāge navasu ñāṇesu kilamantassa ariyamaggānaṃ dassanaṃ. Iminā upāyena sesaupamāpi yojetabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Asubhasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "163"
      },
      ". Tatiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asubhānupassī kāye viharatī"
      },
      "ti attano karajakāye ‘‘yathā etaṃ, tathā ida’’nti iminā nayena bahiddhā diṭṭhānaṃ dasannaṃ asubhānaṃ upasaṃharaṇavasena asubhānupassī viharati, attano kāyaṃ asubhato paṭikūlato ñāṇena passatīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āhāre paṭikūlasaññī"
      },
      "ti navannaṃ pāṭikulyānaṃ vasena kabaḷīkārāhāre paṭikūlasaññī. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbaloke anabhiratisaññī"
      },
      "ti sabbasmimpi tedhātuke lokasannivāse anabhiratāya ukkaṇṭhitasaññāya samannāgato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbasaṅkhāresu aniccānupassī"
      },
      "ti sabbepi tebhūmakasaṅkhāre aniccato anupassanto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Maraṇasaññā"
      },
      "ti maraṇaṃ ārabbha uppannasaññā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ajjhattaṃ sūpaṭṭhitā hotī"
      },
      "ti niyakajjhatte suṭṭhu upaṭṭhitā hoti. Ettāvatā balavavipassanā kathitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sekhabalānī"
      },
      "ti sikkhanakānaṃ balāni. Sesamettha pāḷivasena uttānameva. ‘‘Asubhānupassī’’tiādīni pana dukkhāya paṭipadāya dassanatthaṃ vuttāni, paṭhamajjhānādīni sukhāya. Asubhādīni hi paṭikūlārammaṇāni, tesu pana pakatiyāva sampiyāyamānaṃ cittaṃ allīyati. Tasmā tāni bhāvento dukkhapaṭipadaṃ paṭipanno nāma hoti. Paṭhamajjhānādīni paṇītasukhāni ",
      ", tasmā tāni paṭipanno sukhapaṭipadaṃ paṭipanno nāma hoti."
    ],
    "innerText": "163. Tatiye asubhānupassī kāye viharatīti attano karajakāye ‘‘yathā etaṃ, tathā ida’’nti iminā nayena bahiddhā diṭṭhānaṃ dasannaṃ asubhānaṃ upasaṃharaṇavasena asubhānupassī viharati, attano kāyaṃ asubhato paṭikūlato ñāṇena passatīti attho. Āhāre paṭikūlasaññīti navannaṃ pāṭikulyānaṃ vasena kabaḷīkārāhāre paṭikūlasaññī. Sabbaloke anabhiratisaññīti sabbasmimpi tedhātuke lokasannivāse anabhiratāya ukkaṇṭhitasaññāya samannāgato. Sabbasaṅkhāresu aniccānupassīti sabbepi tebhūmakasaṅkhāre aniccato anupassanto. Maraṇasaññāti maraṇaṃ ārabbha uppannasaññā. Ajjhattaṃ sūpaṭṭhitā hotīti niyakajjhatte suṭṭhu upaṭṭhitā hoti. Ettāvatā balavavipassanā kathitā. Sekhabalānīti sikkhanakānaṃ balāni. Sesamettha pāḷivasena uttānameva. ‘‘Asubhānupassī’’tiādīni pana dukkhāya paṭipadāya dassanatthaṃ vuttāni, paṭhamajjhānādīni sukhāya. Asubhādīni hi paṭikūlārammaṇāni, tesu pana pakatiyāva sampiyāyamānaṃ cittaṃ allīyati. Tasmā tāni bhāvento dukkhapaṭipadaṃ paṭipanno nāma hoti. Paṭhamajjhānādīni paṇītasukhāni , tasmā tāni paṭipanno sukhapaṭipadaṃ paṭipanno nāma hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ayaṃ panettha sabbasādhāraṇā upamā – saṅgāmāvacarapuriso hi phalakakoṭṭhakaṃ katvā pañcāvudhāni ",
      " sannayhitvā saṅgāmaṃ pavisati, so antarā vissamitukāmo phalakakoṭṭhakaṃ pavisitvā vissamati ceva pānabhojanādīni ca paṭisevati. Tato puna saṅgāmaṃ pavisitvā kammaṃ karoti. Tattha saṅgāmo viya kilesasaṅgāmo daṭṭhabbo, phalakakoṭṭhako viya pañcanissayabalāni, saṅgāmapavisanapuriso viya yogāvacaro, pañcāvudhasannāho viya vipassanāpañcamāni indriyāni, saṅgāmaṃ pavisanakālo viya vipassanāya kammakaraṇakālo, vissamitukāmassa phalakakoṭṭhakaṃ pavisitvā vissamanapānabhojanāni paṭisevanakālo viya ",
      " vipassanāya kammaṃ karontassa cittuppādassa nirassādakkhaṇe pañca balāni nissāya cittaṃ sampahaṃsanakālo, vissamitvā khāditvā pivitvā ca puna saṅgāmassa pavisanakālo viya pañcahi balehi cittaṃ sampahaṃsetvā puna vipassanāya kammaṃ karontassa vivaṭṭetvā arahattaggahaṇakālo veditabbo. Imasmiṃ pana sutte balāni ceva indriyāni ca missakāneva kathitānīti."
    ],
    "innerText": "Ayaṃ panettha sabbasādhāraṇā upamā – saṅgāmāvacarapuriso hi phalakakoṭṭhakaṃ katvā pañcāvudhāni sannayhitvā saṅgāmaṃ pavisati, so antarā vissamitukāmo phalakakoṭṭhakaṃ pavisitvā vissamati ceva pānabhojanādīni ca paṭisevati. Tato puna saṅgāmaṃ pavisitvā kammaṃ karoti. Tattha saṅgāmo viya kilesasaṅgāmo daṭṭhabbo, phalakakoṭṭhako viya pañcanissayabalāni, saṅgāmapavisanapuriso viya yogāvacaro, pañcāvudhasannāho viya vipassanāpañcamāni indriyāni, saṅgāmaṃ pavisanakālo viya vipassanāya kammakaraṇakālo, vissamitukāmassa phalakakoṭṭhakaṃ pavisitvā vissamanapānabhojanāni paṭisevanakālo viya vipassanāya kammaṃ karontassa cittuppādassa nirassādakkhaṇe pañca balāni nissāya cittaṃ sampahaṃsanakālo, vissamitvā khāditvā pivitvā ca puna saṅgāmassa pavisanakālo viya pañcahi balehi cittaṃ sampahaṃsetvā puna vipassanāya kammaṃ karontassa vivaṭṭetvā arahattaggahaṇakālo veditabbo. Imasmiṃ pana sutte balāni ceva indriyāni ca missakāneva kathitānīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Paṭhamakhamasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "164"
      },
      ". Catutthe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "akkhamā"
      },
      "ti anadhivāsikapaṭipadā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khamā"
      },
      "ti adhivāsikapaṭipadā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Damā"
      },
      "ti indriyadamanapaṭipadā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samā"
      },
      "ti akusalavitakkānaṃ vūpasamanapaṭipadā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rosantaṃ paṭirosatī"
      },
      "ti ghaṭṭentaṃ paṭighaṭṭeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhaṇḍantaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭibhaṇḍatī"
      },
      "ti paharantaṃ paṭipaharati. Pañcamachaṭṭhāni uttānatthāneva."
    ],
    "innerText": "164. Catutthe akkhamāti anadhivāsikapaṭipadā. Khamāti adhivāsikapaṭipadā. Damāti indriyadamanapaṭipadā. Samāti akusalavitakkānaṃ vūpasamanapaṭipadā. Rosantaṃ paṭirosatīti ghaṭṭentaṃ paṭighaṭṭeti. Bhaṇḍantaṃpaṭibhaṇḍatīti paharantaṃ paṭipaharati. Pañcamachaṭṭhāni uttānatthāneva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Mahāmoggallānasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "167"
      },
      ". Sattame mahāmoggallānattherassa heṭṭhimā tayo maggā sukhapaṭipadā dandhābhiññā ahesuṃ, arahattamaggo dukkhapaṭipado khippābhiñño. Tasmā evamāha – ‘‘yāyaṃ paṭipadā dukkhā khippābhiññā, imaṃ me paṭipadaṃ āgamma anupādāya āsavehi cittaṃ vimutta’’nti."
    ],
    "innerText": "167. Sattame mahāmoggallānattherassa heṭṭhimā tayo maggā sukhapaṭipadā dandhābhiññā ahesuṃ, arahattamaggo dukkhapaṭipado khippābhiñño. Tasmā evamāha – ‘‘yāyaṃ paṭipadā dukkhā khippābhiññā, imaṃ me paṭipadaṃ āgamma anupādāya āsavehi cittaṃ vimutta’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Sāriputtasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "168"
      },
      ". Aṭṭhame dhammasenāpatittherassa heṭṭhimā tayo maggā sukhapaṭipadā dandhābhiññā, arahattamaggo ",
      " sukhapaṭipado khippābhiñño. Tasmā ‘‘yāyaṃ paṭipadā sukhā khippābhiññā’’ti āha. Imesu pana dvīsupi suttesu missikāva paṭipadā kathitāti veditabbā."
    ],
    "innerText": "168. Aṭṭhame dhammasenāpatittherassa heṭṭhimā tayo maggā sukhapaṭipadā dandhābhiññā, arahattamaggo sukhapaṭipado khippābhiñño. Tasmā ‘‘yāyaṃ paṭipadā sukhā khippābhiññā’’ti āha. Imesu pana dvīsupi suttesu missikāva paṭipadā kathitāti veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Sasaṅkhārasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "169"
      },
      ". Navame paṭhamadutiyapuggalā sukkhavipassakā sasaṅkhārena sappayogena saṅkhāranimittaṃ upaṭṭhapenti. Tesu eko vipassanindriyānaṃ balavattā idheva kilesaparinibbānena parinibbāyati, eko indriyānaṃ dubbalatāya ",
      " idha asakkonto anantare attabhāve tadeva mūlakammaṭṭhānaṃ paṭilabhitvā sasaṅkhārena sappayogena saṅkhāranimittaṃ upaṭṭhapetvā kilesaparinibbānena parinibbāyati, tatiyacatutthā samathayānikā. Tesaṃ eko asaṅkhārena appayogena indriyānaṃ balavattā idheva kilese khepeti, eko indriyānaṃ dubbalattā idha asakkonto anantare attabhāve tadeva mūlakammaṭṭhānaṃ paṭilabhitvā asaṅkhārena appayogena kilese khepetīti veditabbo."
    ],
    "innerText": "169. Navame paṭhamadutiyapuggalā sukkhavipassakā sasaṅkhārena sappayogena saṅkhāranimittaṃ upaṭṭhapenti. Tesu eko vipassanindriyānaṃ balavattā idheva kilesaparinibbānena parinibbāyati, eko indriyānaṃ dubbalatāya idha asakkonto anantare attabhāve tadeva mūlakammaṭṭhānaṃ paṭilabhitvā sasaṅkhārena sappayogena saṅkhāranimittaṃ upaṭṭhapetvā kilesaparinibbānena parinibbāyati, tatiyacatutthā samathayānikā. Tesaṃ eko asaṅkhārena appayogena indriyānaṃ balavattā idheva kilese khepeti, eko indriyānaṃ dubbalattā idha asakkonto anantare attabhāve tadeva mūlakammaṭṭhānaṃ paṭilabhitvā asaṅkhārena appayogena kilese khepetīti veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Yuganaddhasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "170"
      },
      ". Dasame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samathapubbaṅgama"
      },
      "nti samathaṃ pubbaṅgamaṃ purecārikaṃ katvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Maggo sañjāyatī"
      },
      "ti paṭhamo lokuttaramaggo nibbattati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "So"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "taṃ magga"
      },
      "nti ekacittakkhaṇikamaggassa āsevanādīni nāma natthi, dutiyamaggādayo pana uppādento tameva āsevati bhāveti bahulīkarotīti vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vipassanāpubbaṅgama"
      },
      "nti vipassanaṃ pubbaṅgamaṃ purecārikaṃ katvā samathaṃ bhāveti, pakatiyā vipassanālābhī vipassanāya ṭhatvā samādhiṃ uppādetīti attho."
    ],
    "innerText": "170. Dasame samathapubbaṅgamanti samathaṃ pubbaṅgamaṃ purecārikaṃ katvā. Maggo sañjāyatīti paṭhamo lokuttaramaggo nibbattati. Sotaṃ magganti ekacittakkhaṇikamaggassa āsevanādīni nāma natthi, dutiyamaggādayo pana uppādento tameva āsevati bhāveti bahulīkarotīti vuccati. Vipassanāpubbaṅgamanti vipassanaṃ pubbaṅgamaṃ purecārikaṃ katvā samathaṃ bhāveti, pakatiyā vipassanālābhī vipassanāya ṭhatvā samādhiṃ uppādetīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yuganaddhaṃ bhāvetī"
      },
      "ti yuganaddhaṃ katvā bhāveti. Tattha teneva cittena samāpattiṃ samāpajjitvā teneva saṅkhāre sammasituṃ na sakkā. Ayaṃ pana yāvatā samāpattiyo samāpajjati, tāvatā saṅkhāre sammasati. Yāvatā saṅkhāre sammasati, tāvatā samāpattiyo samāpajjati. Kathaṃ? Paṭhamajjhānaṃ samāpajjati, tato vuṭṭhāya saṅkhāre sammasati, saṅkhāre sammasitvā dutiyajjhānaṃ samāpajjati. Tato vuṭṭhāya puna saṅkhāre sammasati. Saṅkhāre sammasitvā ",
      " tatiyajjhānaṃ…pe… nevasaññānāsaññāyatanasamāpattiṃ samāpajjati, tato vuṭṭhāya saṅkhāre sammasati. Evamayaṃ samathavipassanaṃ yuganaddhaṃ bhāveti nāma."
    ],
    "innerText": "Yuganaddhaṃ bhāvetīti yuganaddhaṃ katvā bhāveti. Tattha teneva cittena samāpattiṃ samāpajjitvā teneva saṅkhāre sammasituṃ na sakkā. Ayaṃ pana yāvatā samāpattiyo samāpajjati, tāvatā saṅkhāre sammasati. Yāvatā saṅkhāre sammasati, tāvatā samāpattiyo samāpajjati. Kathaṃ? Paṭhamajjhānaṃ samāpajjati, tato vuṭṭhāya saṅkhāre sammasati, saṅkhāre sammasitvā dutiyajjhānaṃ samāpajjati. Tato vuṭṭhāya puna saṅkhāre sammasati. Saṅkhāre sammasitvā tatiyajjhānaṃ…pe… nevasaññānāsaññāyatanasamāpattiṃ samāpajjati, tato vuṭṭhāya saṅkhāre sammasati. Evamayaṃ samathavipassanaṃ yuganaddhaṃ bhāveti nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammuddhaccaviggahita"
      },
      "nti samathavipassanādhammesu dasavipassanupakkilesasaṅkhātena uddhaccena viggahitaṃ, suggahitanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "So, āvuso, samayo"
      },
      "ti iminā sattannaṃ sappāyānaṃ paṭilābhakālo kathito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yaṃ taṃ citta"
      },
      "nti yasmiṃ samaye taṃ vipassanāvīthiṃ okkamitvā pavattaṃ cittaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ajjhattameva"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "santiṭṭhatī"
      },
      "ti vipassanāvīthiṃ paccottharitvā ",
      " tasmiṃyeva gocarajjhattasaṅkhāte ārammaṇe santiṭṭhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sannisīdatī"
      },
      "ti ārammaṇavasena sammā nisīdati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekodi hotī"
      },
      "ti ekaggaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samādhiyatī"
      },
      "ti sammā ādhiyati suṭṭhapitaṃ hoti. Sesamettha uttānatthameva."
    ],
    "innerText": "Dhammuddhaccaviggahitanti samathavipassanādhammesu dasavipassanupakkilesasaṅkhātena uddhaccena viggahitaṃ, suggahitanti attho. So, āvuso, samayoti iminā sattannaṃ sappāyānaṃ paṭilābhakālo kathito. Yaṃ taṃ cittanti yasmiṃ samaye taṃ vipassanāvīthiṃ okkamitvā pavattaṃ cittaṃ. Ajjhattamevasantiṭṭhatīti vipassanāvīthiṃ paccottharitvā tasmiṃyeva gocarajjhattasaṅkhāte ārammaṇe santiṭṭhati. Sannisīdatīti ārammaṇavasena sammā nisīdati. Ekodi hotīti ekaggaṃ hoti. Samādhiyatīti sammā ādhiyati suṭṭhapitaṃ hoti. Sesamettha uttānatthameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṭipadāvaggo dutiyo."
  }
]