[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "(11) 1. Samaṇasaññāvaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Samaṇasaññāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "101"
      },
      ". ‘‘Tisso ",
      " imā, bhikkhave, samaṇasaññā bhāvitā bahulīkatā satta dhamme paripūrenti. Katamā tisso? Vevaṇṇiyamhi ajjhupagato, parapaṭibaddhā me jīvikā, añño me ākappo karaṇīyoti – imā kho, bhikkhave, tisso samaṇasaññā bhāvitā bahulīkatā satta dhamme paripūrenti."
    ],
    "innerText": "101. ‘‘Tisso imā, bhikkhave, samaṇasaññā bhāvitā bahulīkatā satta dhamme paripūrenti. Katamā tisso? Vevaṇṇiyamhi ajjhupagato, parapaṭibaddhā me jīvikā, añño me ākappo karaṇīyoti – imā kho, bhikkhave, tisso samaṇasaññā bhāvitā bahulīkatā satta dhamme paripūrenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katame satta? Santatakārī ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[satatakārī (syā. pī. ka.)]"
      },
      " hoti santatavutti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[satatavutti (syā. pī.)]"
      },
      " sīlesu, anabhijjhālu hoti, abyāpajjo hoti, anatimānī hoti, sikkhākāmo hoti ",
      ", idamatthaṃtissa hoti jīvitaparikkhāresu, āraddhavīriyo ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[āraddhaviriyo ca (sī. pī.), āraddhaviriyo (syā.)]"
      },
      " viharati. Imā kho, bhikkhave, tisso samaṇasaññā bhāvitā bahulīkatā ime satta dhamme paripūrentī’’ti. Paṭhamaṃ."
    ],
    "innerText": "‘‘Katame satta? Santatakārī [satatakārī (syā. pī. ka.)] hoti santatavutti [satatavutti (syā. pī.)] sīlesu, anabhijjhālu hoti, abyāpajjo hoti, anatimānī hoti, sikkhākāmo hoti , idamatthaṃtissa hoti jīvitaparikkhāresu, āraddhavīriyo ca [āraddhaviriyo ca (sī. pī.), āraddhaviriyo (syā.)] viharati. Imā kho, bhikkhave, tisso samaṇasaññā bhāvitā bahulīkatā ime satta dhamme paripūrentī’’ti. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Bojjhaṅgasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "102"
      },
      ". ‘‘Sattime, bhikkhave, bojjhaṅgā bhāvitā bahulīkatā tisso vijjā paripūrenti. Katame satta? Satisambojjhaṅgo, dhammavicayasambojjhaṅgo, vīriyasambojjhaṅgo, pītisambojjhaṅgo, passaddhisambojjhaṅgo, samādhisambojjhaṅgo, upekkhāsambojjhaṅgo – ime kho, bhikkhave, satta bojjhaṅgā bhāvitā bahulīkatā tisso vijjā paripūrenti. Katamā tisso? Idha, bhikkhave, bhikkhu anekavihitaṃ pubbenivāsaṃ anussarati, seyyathidaṃ – ekampi ",
      " jātiṃ dvepi jātiyo tissopi jātiyo…pe… iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. Dibbena cakkhunā visuddhena atikkantamānusakena…pe… yathākammūpage satte pajānāti ",
      ". Āsavānaṃ khayā…pe… sacchikatvā upasampajja viharati. Ime kho, bhikkhave, satta bojjhaṅgā bhāvitā bahulīkatā imā tisso vijjā paripūrentī’’ti. Dutiyaṃ."
    ],
    "innerText": "102. ‘‘Sattime, bhikkhave, bojjhaṅgā bhāvitā bahulīkatā tisso vijjā paripūrenti. Katame satta? Satisambojjhaṅgo, dhammavicayasambojjhaṅgo, vīriyasambojjhaṅgo, pītisambojjhaṅgo, passaddhisambojjhaṅgo, samādhisambojjhaṅgo, upekkhāsambojjhaṅgo – ime kho, bhikkhave, satta bojjhaṅgā bhāvitā bahulīkatā tisso vijjā paripūrenti. Katamā tisso? Idha, bhikkhave, bhikkhu anekavihitaṃ pubbenivāsaṃ anussarati, seyyathidaṃ – ekampi jātiṃ dvepi jātiyo tissopi jātiyo…pe… iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. Dibbena cakkhunā visuddhena atikkantamānusakena…pe… yathākammūpage satte pajānāti . Āsavānaṃ khayā…pe… sacchikatvā upasampajja viharati. Ime kho, bhikkhave, satta bojjhaṅgā bhāvitā bahulīkatā imā tisso vijjā paripūrentī’’ti. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Micchattasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "103"
      },
      ". ‘‘Micchattaṃ ",
      ", bhikkhave, āgamma virādhanā hoti, no ārādhanā. Kathañca, bhikkhave, micchattaṃ āgamma virādhanā hoti, no ārādhanā? Micchādiṭṭhikassa, bhikkhave, micchāsaṅkappo pahoti, micchāsaṅkappassa micchāvācā pahoti, micchāvācassa micchākammanto ",
      " pahoti, micchākammantassa micchāājīvo pahoti, micchāājīvassa micchāvāyāmo pahoti, micchāvāyāmassa micchāsati pahoti, micchāsatissa micchāsamādhi pahoti, micchāsamādhissa micchāñāṇaṃ pahoti, micchāñāṇissa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[micchāñāṇassa (pī. ka.)]"
      },
      " micchāvimutti pahoti. Evaṃ kho, bhikkhave, micchattaṃ āgamma virādhanā hoti, no ārādhanā."
    ],
    "innerText": "103. ‘‘Micchattaṃ , bhikkhave, āgamma virādhanā hoti, no ārādhanā. Kathañca, bhikkhave, micchattaṃ āgamma virādhanā hoti, no ārādhanā? Micchādiṭṭhikassa, bhikkhave, micchāsaṅkappo pahoti, micchāsaṅkappassa micchāvācā pahoti, micchāvācassa micchākammanto pahoti, micchākammantassa micchāājīvo pahoti, micchāājīvassa micchāvāyāmo pahoti, micchāvāyāmassa micchāsati pahoti, micchāsatissa micchāsamādhi pahoti, micchāsamādhissa micchāñāṇaṃ pahoti, micchāñāṇissa [micchāñāṇassa (pī. ka.)] micchāvimutti pahoti. Evaṃ kho, bhikkhave, micchattaṃ āgamma virādhanā hoti, no ārādhanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sammattaṃ, bhikkhave, āgamma ārādhanā hoti, no virādhanā. Kathañca, bhikkhave, sammattaṃ āgamma ārādhanā hoti, no virādhanā? Sammādiṭṭhikassa, bhikkhave, sammāsaṅkappo pahoti, sammāsaṅkappassa sammāvācā pahoti, sammāvācassa sammākammanto pahoti, sammākammantassa sammāājīvo pahoti, sammāājīvassa sammāvāyāmo pahoti, sammāvāyāmassa sammāsati pahoti, sammāsatissa sammāsamādhi pahoti, sammāsamādhissa ",
      " sammāñāṇaṃ pahoti, sammāñāṇissa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sammāñāṇassa (pī. ka.)]"
      },
      " sammāvimutti pahoti. Evaṃ kho, bhikkhave, sammattaṃ āgamma ārādhanā hoti, no virādhanā’’ti. Tatiyaṃ."
    ],
    "innerText": "‘‘Sammattaṃ, bhikkhave, āgamma ārādhanā hoti, no virādhanā. Kathañca, bhikkhave, sammattaṃ āgamma ārādhanā hoti, no virādhanā? Sammādiṭṭhikassa, bhikkhave, sammāsaṅkappo pahoti, sammāsaṅkappassa sammāvācā pahoti, sammāvācassa sammākammanto pahoti, sammākammantassa sammāājīvo pahoti, sammāājīvassa sammāvāyāmo pahoti, sammāvāyāmassa sammāsati pahoti, sammāsatissa sammāsamādhi pahoti, sammāsamādhissa sammāñāṇaṃ pahoti, sammāñāṇissa [sammāñāṇassa (pī. ka.)] sammāvimutti pahoti. Evaṃ kho, bhikkhave, sammattaṃ āgamma ārādhanā hoti, no virādhanā’’ti. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Bījasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "104"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[a. ni. 1.306; kathā. 708]"
      },
      " ‘‘Micchādiṭṭhikassa, bhikkhave, purisapuggalassa micchāsaṅkappassa micchāvācassa micchākammantassa micchāājīvassa micchāvāyāmassa micchāsatissa micchāsamādhissa micchāñāṇissa micchāvimuttissa yañca kāyakammaṃ yathādiṭṭhi samattaṃ samādinnaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[samādiṇṇaṃ (pī. ka.)]"
      },
      " yañca vacīkammaṃ… yañca manokammaṃ yathādiṭṭhi samattaṃ samādinnaṃ yā ca cetanā yā ca patthanā yo ca ",
      " paṇidhi ye ca saṅkhārā, sabbe te dhammā aniṭṭhāya akantāya amanāpāya ahitāya dukkhāya saṃvattanti. Taṃ kissa hetu? Diṭṭhi hissa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[diṭṭhi hi (sī. syā. pī.)]"
      },
      ", bhikkhave, pāpikā."
    ],
    "innerText": "104.[a. ni. 1.306; kathā. 708] ‘‘Micchādiṭṭhikassa, bhikkhave, purisapuggalassa micchāsaṅkappassa micchāvācassa micchākammantassa micchāājīvassa micchāvāyāmassa micchāsatissa micchāsamādhissa micchāñāṇissa micchāvimuttissa yañca kāyakammaṃ yathādiṭṭhi samattaṃ samādinnaṃ [samādiṇṇaṃ (pī. ka.)] yañca vacīkammaṃ… yañca manokammaṃ yathādiṭṭhi samattaṃ samādinnaṃ yā ca cetanā yā ca patthanā yo ca paṇidhi ye ca saṅkhārā, sabbe te dhammā aniṭṭhāya akantāya amanāpāya ahitāya dukkhāya saṃvattanti. Taṃ kissa hetu? Diṭṭhi hissa [diṭṭhi hi (sī. syā. pī.)], bhikkhave, pāpikā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, bhikkhave, nimbabījaṃ vā kosātakibījaṃ vā tittakālābubījaṃ vā allāya pathaviyā nikkhittaṃ yañceva ",
      " pathavirasaṃ upādiyati yañca āporasaṃ upādiyati ",
      ", sabbaṃ taṃ tittakattāya kaṭukattāya asātattāya saṃvattati. Taṃ kissa hetu? Bījañhi, bhikkhave, pāpakaṃ. Evamevaṃ kho, bhikkhave, micchādiṭṭhikassa purisapuggalassa micchāsaṅkappassa micchāvācassa micchākammantassa micchāājīvassa micchāvāyāmassa micchāsatissa micchāsamādhissa micchāñāṇissa micchāvimuttissa yañceva kāyakammaṃ yathādiṭṭhi samattaṃ samādinnaṃ yañca vacīkammaṃ… yañca manokammaṃ yathādiṭṭhi samattaṃ samādinnaṃ yā ca cetanā yā ca patthanā yo ca paṇidhi ye ca saṅkhārā, sabbe te dhammā aniṭṭhāya akantāya amanāpāya ahitāya dukkhāya saṃvattanti. Taṃ kissa hetu? Diṭṭhi hissa, bhikkhave ",
      ", pāpikā."
    ],
    "innerText": "‘‘Seyyathāpi, bhikkhave, nimbabījaṃ vā kosātakibījaṃ vā tittakālābubījaṃ vā allāya pathaviyā nikkhittaṃ yañceva pathavirasaṃ upādiyati yañca āporasaṃ upādiyati , sabbaṃ taṃ tittakattāya kaṭukattāya asātattāya saṃvattati. Taṃ kissa hetu? Bījañhi, bhikkhave, pāpakaṃ. Evamevaṃ kho, bhikkhave, micchādiṭṭhikassa purisapuggalassa micchāsaṅkappassa micchāvācassa micchākammantassa micchāājīvassa micchāvāyāmassa micchāsatissa micchāsamādhissa micchāñāṇissa micchāvimuttissa yañceva kāyakammaṃ yathādiṭṭhi samattaṃ samādinnaṃ yañca vacīkammaṃ… yañca manokammaṃ yathādiṭṭhi samattaṃ samādinnaṃ yā ca cetanā yā ca patthanā yo ca paṇidhi ye ca saṅkhārā, sabbe te dhammā aniṭṭhāya akantāya amanāpāya ahitāya dukkhāya saṃvattanti. Taṃ kissa hetu? Diṭṭhi hissa, bhikkhave , pāpikā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sammādiṭṭhikassa, bhikkhave, purisapuggalassa sammāsaṅkappassa sammāvācassa sammākammantassa sammāājīvassa sammāvāyāmassa sammāsatissa sammāsamādhissa sammāñāṇissa sammāvimuttissa yañceva kāyakammaṃ yathādiṭṭhi samattaṃ samādinnaṃ yañca vacīkammaṃ yathādiṭṭhi samattaṃ samādinnaṃ yañca manokammaṃ yathādiṭṭhi samattaṃ samādinnaṃ yā ca cetanā yā ca patthanā yo ca paṇidhi ye ca saṅkhārā, sabbe te dhammā iṭṭhāya kantāya manāpāya hitāya sukhāya saṃvattanti. Taṃ kissa hetu? Diṭṭhi hissa, bhikkhave, bhaddikā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, bhikkhave, ucchubījaṃ vā sālibījaṃ vā muddikābījaṃ vā allāya pathaviyā nikkhittaṃ yañca pathavirasaṃ upādiyati yañca āporasaṃ upādiyati sabbaṃ taṃ sātattāya madhurattāya asecanakattāya saṃvattati. Taṃ kissa hetu? Bījañhi bhikkhave, bhaddakaṃ. Evamevaṃ kho, bhikkhave, sammādiṭṭhikassa…pe. ",
      " … sammāvimuttissa yañceva kāyakammaṃ yathādiṭṭhi samattaṃ samādinnaṃ yañca vacīkammaṃ… yañca manokammaṃ yathādiṭṭhi samattaṃ samādinnaṃ yā ca cetanā yā ca patthanā yo ca paṇidhi ye ca saṅkhārā, sabbe te dhammā iṭṭhāya kantāya manāpāya hitāya sukhāya saṃvattanti. Taṃ kissa hetu? Diṭṭhi hissa, bhikkhave, bhaddikā’’ti. Catutthaṃ."
    ],
    "innerText": "‘‘Seyyathāpi, bhikkhave, ucchubījaṃ vā sālibījaṃ vā muddikābījaṃ vā allāya pathaviyā nikkhittaṃ yañca pathavirasaṃ upādiyati yañca āporasaṃ upādiyati sabbaṃ taṃ sātattāya madhurattāya asecanakattāya saṃvattati. Taṃ kissa hetu? Bījañhi bhikkhave, bhaddakaṃ. Evamevaṃ kho, bhikkhave, sammādiṭṭhikassa…pe. … sammāvimuttissa yañceva kāyakammaṃ yathādiṭṭhi samattaṃ samādinnaṃ yañca vacīkammaṃ… yañca manokammaṃ yathādiṭṭhi samattaṃ samādinnaṃ yā ca cetanā yā ca patthanā yo ca paṇidhi ye ca saṅkhārā, sabbe te dhammā iṭṭhāya kantāya manāpāya hitāya sukhāya saṃvattanti. Taṃ kissa hetu? Diṭṭhi hissa, bhikkhave, bhaddikā’’ti. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Vijjāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "105"
      },
      ". ‘‘Avijjā ",
      ", bhikkhave, pubbaṅgamā akusalānaṃ dhammānaṃ samāpattiyā, anvadeva ",
      " ahirikaṃ anottappaṃ. Avijjāgatassa, bhikkhave, aviddasuno micchādiṭṭhi pahoti, micchādiṭṭhikassa micchāsaṅkappo pahoti, micchāsaṅkappassa micchāvācā pahoti, micchāvācassa micchākammanto pahoti, micchākammantassa ",
      " micchāājīvo pahoti, micchāājīvassa micchāvāyāmo pahoti, micchāvāyāmassa micchāsati pahoti, micchāsatissa micchāsamādhi pahoti, micchāsamādhissa micchāñāṇaṃ pahoti, micchāñāṇissa micchāvimutti pahoti."
    ],
    "innerText": "105. ‘‘Avijjā , bhikkhave, pubbaṅgamā akusalānaṃ dhammānaṃ samāpattiyā, anvadeva ahirikaṃ anottappaṃ. Avijjāgatassa, bhikkhave, aviddasuno micchādiṭṭhi pahoti, micchādiṭṭhikassa micchāsaṅkappo pahoti, micchāsaṅkappassa micchāvācā pahoti, micchāvācassa micchākammanto pahoti, micchākammantassa micchāājīvo pahoti, micchāājīvassa micchāvāyāmo pahoti, micchāvāyāmassa micchāsati pahoti, micchāsatissa micchāsamādhi pahoti, micchāsamādhissa micchāñāṇaṃ pahoti, micchāñāṇissa micchāvimutti pahoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Vijjā, bhikkhave, pubbaṅgamā kusalānaṃ dhammānaṃ samāpattiyā, anvadeva hirottappaṃ. Vijjāgatassa, bhikkhave, viddasuno sammādiṭṭhi pahoti, sammādiṭṭhikassa sammāsaṅkappo pahoti, sammāsaṅkappassa sammāvācā pahoti, sammāvācassa sammākammanto pahoti, sammākammantassa sammāājīvo pahoti, sammāājīvassa sammāvāyāmo pahoti, sammāvāyāmassa sammāsati pahoti, sammāsatissa sammāsamādhi pahoti, sammāsamādhissa sammāñāṇaṃ pahoti, sammāñāṇissa sammāvimutti pahotī’’ti. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Nijjarasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "106"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[dī. ni. 3.360]"
      },
      " ‘‘Dasayimāni ",
      ", bhikkhave, nijjaravatthūni. Katamāni dasa? Sammādiṭṭhikassa, bhikkhave, micchādiṭṭhi nijjiṇṇā hoti; ye ca micchādiṭṭhipaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa nijjiṇṇā honti; sammādiṭṭhipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti."
    ],
    "innerText": "106.[dī. ni. 3.360] ‘‘Dasayimāni , bhikkhave, nijjaravatthūni. Katamāni dasa? Sammādiṭṭhikassa, bhikkhave, micchādiṭṭhi nijjiṇṇā hoti; ye ca micchādiṭṭhipaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa nijjiṇṇā honti; sammādiṭṭhipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sammāsaṅkappassa, bhikkhave, micchāsaṅkappo nijjiṇṇo hoti; ye ca micchāsaṅkappapaccayā aneke pāpakā akusalā dhammā ",
      " sambhavanti te cassa nijjiṇṇā honti; sammāsaṅkappapaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti."
    ],
    "innerText": "‘‘Sammāsaṅkappassa, bhikkhave, micchāsaṅkappo nijjiṇṇo hoti; ye ca micchāsaṅkappapaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa nijjiṇṇā honti; sammāsaṅkappapaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sammāvācassa, bhikkhave, micchāvācā nijjiṇṇā hoti; ye ca micchāvācāpaccayā aneke ",
      " pāpakā akusalā dhammā sambhavanti te cassa nijjiṇṇā honti; sammāvācāpaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti."
    ],
    "innerText": "‘‘Sammāvācassa, bhikkhave, micchāvācā nijjiṇṇā hoti; ye ca micchāvācāpaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa nijjiṇṇā honti; sammāvācāpaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sammākammantassa, bhikkhave, micchākammanto nijjiṇṇo hoti; ye ca micchākammantapaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa nijjiṇṇā honti; sammākammantapaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sammāājīvassa ",
      ", bhikkhave, micchāājīvo nijjiṇṇo hoti; ye ca micchāājīvapaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa nijjiṇṇā honti; sammāājīvapaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti."
    ],
    "innerText": "‘‘Sammāājīvassa , bhikkhave, micchāājīvo nijjiṇṇo hoti; ye ca micchāājīvapaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa nijjiṇṇā honti; sammāājīvapaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sammāvāyāmassa, bhikkhave, micchāvāyāmo nijjiṇṇo hoti; ye ca micchāvāyāmapaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa nijjiṇṇā honti; sammāvāyāmapaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sammāsatissa, bhikkhave, micchāsati nijjiṇṇā hoti; ye ca micchāsatipaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa nijjiṇṇā honti; sammāsatipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sammāsamādhissa, bhikkhave, micchāsamādhi nijjiṇṇo hoti; ye ca micchāsamādhipaccayā aneke pāpakā akusalā dhammā sambhavanti ",
      " te cassa nijjiṇṇā honti; sammāsamādhipaccayā ca aneke kusalā ",
      " dhammā bhāvanāpāripūriṃ gacchanti."
    ],
    "innerText": "‘‘Sammāsamādhissa, bhikkhave, micchāsamādhi nijjiṇṇo hoti; ye ca micchāsamādhipaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa nijjiṇṇā honti; sammāsamādhipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sammāñāṇissa, bhikkhave, micchāñāṇaṃ nijjiṇṇaṃ hoti; ye ca micchāñāṇapaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa nijjiṇṇā honti; sammāñāṇapaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sammāvimuttissa, bhikkhave, micchāvimutti nijjiṇṇā hoti; ye ca micchāvimuttipaccayā ",
      " aneke pāpakā akusalā dhammā sambhavanti te cassa nijjiṇṇā honti; sammāvimuttipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti. Imāni kho, bhikkhave, dasa nijjaravatthūnī’’ti. Chaṭṭhaṃ."
    ],
    "innerText": "‘‘Sammāvimuttissa, bhikkhave, micchāvimutti nijjiṇṇā hoti; ye ca micchāvimuttipaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa nijjiṇṇā honti; sammāvimuttipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti. Imāni kho, bhikkhave, dasa nijjaravatthūnī’’ti. Chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Dhovanasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "107"
      },
      ". ‘‘Atthi, bhikkhave, dakkhiṇesu janapadesu dhovanaṃ nāma. Tattha hoti annampi pānampi khajjampi bhojjampi leyyampi peyyampi naccampi gītampi vāditampi. Atthetaṃ, bhikkhave, dhovanaṃ; ‘netaṃ natthī’ti vadāmi. Tañca kho etaṃ, bhikkhave, dhovanaṃ hīnaṃ gammaṃ pothujjanikaṃ anariyaṃ anatthasaṃhitaṃ na nibbidāya na virāgāya ",
      " na nirodhāya na upasamāya na abhiññāya na sambodhāya na nibbānāya saṃvattati."
    ],
    "innerText": "107. ‘‘Atthi, bhikkhave, dakkhiṇesu janapadesu dhovanaṃ nāma. Tattha hoti annampi pānampi khajjampi bhojjampi leyyampi peyyampi naccampi gītampi vāditampi. Atthetaṃ, bhikkhave, dhovanaṃ; ‘netaṃ natthī’ti vadāmi. Tañca kho etaṃ, bhikkhave, dhovanaṃ hīnaṃ gammaṃ pothujjanikaṃ anariyaṃ anatthasaṃhitaṃ na nibbidāya na virāgāya na nirodhāya na upasamāya na abhiññāya na sambodhāya na nibbānāya saṃvattati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ahañca kho, bhikkhave, ariyaṃ dhovanaṃ desessāmi, yaṃ dhovanaṃ ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattati, yaṃ dhovanaṃ āgamma jātidhammā sattā jātiyā parimuccanti, jarādhammā sattā jarāya parimuccanti, maraṇadhammā sattā maraṇena parimuccanti, sokaparidevadukkhadomanassupāyāsadhammā ",
      " sattā sokaparidevadukkhadomanassupāyāsehi parimuccanti. Taṃ suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –"
    ],
    "innerText": "‘‘Ahañca kho, bhikkhave, ariyaṃ dhovanaṃ desessāmi, yaṃ dhovanaṃ ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattati, yaṃ dhovanaṃ āgamma jātidhammā sattā jātiyā parimuccanti, jarādhammā sattā jarāya parimuccanti, maraṇadhammā sattā maraṇena parimuccanti, sokaparidevadukkhadomanassupāyāsadhammā sattā sokaparidevadukkhadomanassupāyāsehi parimuccanti. Taṃ suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamañca taṃ, bhikkhave, ariyaṃ dhovanaṃ, (yaṃ dhovanaṃ) ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[( ) natthi syāmapotthake]"
      },
      " ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya ",
      " sambodhāya nibbānāya saṃvattati, yaṃ dhovanaṃ āgamma jātidhammā sattā jātiyā parimuccanti, jarādhammā sattā jarāya parimuccanti, maraṇadhammā sattā maraṇena parimuccanti, sokaparidevadukkhadomanassupāyāsadhammā sattā sokaparidevadukkhadomanassupāyāsehi parimuccanti?"
    ],
    "innerText": "‘‘Katamañca taṃ, bhikkhave, ariyaṃ dhovanaṃ, (yaṃ dhovanaṃ) [( ) natthi syāmapotthake] ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattati, yaṃ dhovanaṃ āgamma jātidhammā sattā jātiyā parimuccanti, jarādhammā sattā jarāya parimuccanti, maraṇadhammā sattā maraṇena parimuccanti, sokaparidevadukkhadomanassupāyāsadhammā sattā sokaparidevadukkhadomanassupāyāsehi parimuccanti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sammādiṭṭhikassa, bhikkhave, micchādiṭṭhi niddhotā hoti; ye ca micchādiṭṭhipaccayā aneke ",
      " pāpakā akusalā dhammā sambhavanti te cassa niddhotā honti; sammādiṭṭhipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti."
    ],
    "innerText": "‘‘Sammādiṭṭhikassa, bhikkhave, micchādiṭṭhi niddhotā hoti; ye ca micchādiṭṭhipaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa niddhotā honti; sammādiṭṭhipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sammāsaṅkappassa, bhikkhave, micchāsaṅkappo niddhoto hoti…pe… sammāvācassa, bhikkhave, micchāvācā niddhotā hoti… sammākammantassa, bhikkhave, micchākammanto niddhoto hoti… sammāājīvassa, bhikkhave, micchāājīvo niddhoto hoti… sammāvāyāmassa, bhikkhave, micchāvāyāmo niddhoto hoti… sammāsatissa, bhikkhave, micchāsati niddhotā hoti… sammāsamādhissa, bhikkhave, micchāsamādhi niddhoto hoti… sammāñāṇissa, bhikkhave, micchāñāṇaṃ niddhotaṃ hoti…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sammāvimuttissa ",
      ", bhikkhave, micchāvimutti niddhotā hoti; ye ca micchāvimuttipaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa niddhotā honti; sammāvimuttipaccayā ",
      " ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti. Idaṃ kho taṃ, bhikkhave, ariyaṃ dhovanaṃ ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattati, yaṃ dhovanaṃ āgamma jātidhammā sattā jātiyā parimuccanti, jarādhammā sattā jarāya parimuccanti, maraṇadhammā sattā maraṇena parimuccanti, sokaparidevadukkhadomanassupāyāsadhammā sattā sokaparidevadukkhadomanassupāyāsehi parimuccantī’’ti. Sattamaṃ."
    ],
    "innerText": "‘‘Sammāvimuttissa , bhikkhave, micchāvimutti niddhotā hoti; ye ca micchāvimuttipaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa niddhotā honti; sammāvimuttipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti. Idaṃ kho taṃ, bhikkhave, ariyaṃ dhovanaṃ ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattati, yaṃ dhovanaṃ āgamma jātidhammā sattā jātiyā parimuccanti, jarādhammā sattā jarāya parimuccanti, maraṇadhammā sattā maraṇena parimuccanti, sokaparidevadukkhadomanassupāyāsadhammā sattā sokaparidevadukkhadomanassupāyāsehi parimuccantī’’ti. Sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Tikicchakasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "108"
      },
      ". ‘‘Tikicchakā ",
      ", bhikkhave, virecanaṃ denti pittasamuṭṭhānānampi ābādhānaṃ paṭighātāya, semhasamuṭṭhānānampi ābādhānaṃ paṭighātāya, vātasamuṭṭhānānampi ābādhānaṃ paṭighātāya. Atthetaṃ, bhikkhave, virecanaṃ; ‘netaṃ natthī’ti vadāmi. Tañca kho etaṃ, bhikkhave, virecanaṃ sampajjatipi vipajjatipi."
    ],
    "innerText": "108. ‘‘Tikicchakā , bhikkhave, virecanaṃ denti pittasamuṭṭhānānampi ābādhānaṃ paṭighātāya, semhasamuṭṭhānānampi ābādhānaṃ paṭighātāya, vātasamuṭṭhānānampi ābādhānaṃ paṭighātāya. Atthetaṃ, bhikkhave, virecanaṃ; ‘netaṃ natthī’ti vadāmi. Tañca kho etaṃ, bhikkhave, virecanaṃ sampajjatipi vipajjatipi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ahañca kho, bhikkhave, ariyaṃ virecanaṃ desessāmi, yaṃ virecanaṃ sampajjatiyeva no vipajjati, yaṃ virecanaṃ āgamma jātidhammā sattā jātiyā parimuccanti, jarādhammā sattā jarāya parimuccanti, maraṇadhammā sattā maraṇena parimuccanti, sokaparidevadukkhadomanassupāyāsadhammā ",
      " sattā sokaparidevadukkhadomanassupāyāsehi parimuccanti. Taṃ suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –"
    ],
    "innerText": "‘‘Ahañca kho, bhikkhave, ariyaṃ virecanaṃ desessāmi, yaṃ virecanaṃ sampajjatiyeva no vipajjati, yaṃ virecanaṃ āgamma jātidhammā sattā jātiyā parimuccanti, jarādhammā sattā jarāya parimuccanti, maraṇadhammā sattā maraṇena parimuccanti, sokaparidevadukkhadomanassupāyāsadhammā sattā sokaparidevadukkhadomanassupāyāsehi parimuccanti. Taṃ suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamañca taṃ, bhikkhave, ariyaṃ virecanaṃ, yaṃ virecanaṃ sampajjatiyeva no vipajjati, yaṃ virecanaṃ āgamma jātidhammā sattā jātiyā parimuccanti, jarādhammā sattā jarāya parimuccanti, maraṇadhammā sattā maraṇena parimuccanti ",
      ", sokaparidevadukkhadomanassupāyāsadhammā sattā sokaparidevadukkhadomanassupāyāsehi parimuccanti?"
    ],
    "innerText": "‘‘Katamañca taṃ, bhikkhave, ariyaṃ virecanaṃ, yaṃ virecanaṃ sampajjatiyeva no vipajjati, yaṃ virecanaṃ āgamma jātidhammā sattā jātiyā parimuccanti, jarādhammā sattā jarāya parimuccanti, maraṇadhammā sattā maraṇena parimuccanti , sokaparidevadukkhadomanassupāyāsadhammā sattā sokaparidevadukkhadomanassupāyāsehi parimuccanti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sammādiṭṭhikassa, bhikkhave, micchādiṭṭhi virittā hoti; ye ca micchādiṭṭhipaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa virittā honti; sammādiṭṭhipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sammāsaṅkappassa ",
      ", bhikkhave, micchāsaṅkappo viritto hoti…pe… sammāvācassa, bhikkhave, micchāvācā virittā hoti… sammākammantassa, bhikkhave, micchākammanto viritto hoti… sammāājīvassa, bhikkhave, micchāājīvo viritto hoti… sammāvāyāmassa, bhikkhave, micchāvāyāmo viritto hoti… sammāsatissa, bhikkhave, micchāsati virittā hoti… sammāsamādhissa ",
      ", bhikkhave, micchāsamādhi viritto hoti… sammāñāṇissa, bhikkhave, micchāñāṇaṃ virittaṃ hoti…pe…."
    ],
    "innerText": "‘‘Sammāsaṅkappassa , bhikkhave, micchāsaṅkappo viritto hoti…pe… sammāvācassa, bhikkhave, micchāvācā virittā hoti… sammākammantassa, bhikkhave, micchākammanto viritto hoti… sammāājīvassa, bhikkhave, micchāājīvo viritto hoti… sammāvāyāmassa, bhikkhave, micchāvāyāmo viritto hoti… sammāsatissa, bhikkhave, micchāsati virittā hoti… sammāsamādhissa , bhikkhave, micchāsamādhi viritto hoti… sammāñāṇissa, bhikkhave, micchāñāṇaṃ virittaṃ hoti…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sammāvimuttissa, bhikkhave, micchāvimutti virittā hoti; ye ca micchāvimuttipaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa virittā honti; sammāvimuttipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti. Idaṃ kho taṃ, bhikkhave, ariyaṃ virecanaṃ yaṃ virecanaṃ sampajjatiyeva no vipajjati, yaṃ virecanaṃ āgamma jātidhammā sattā jātiyā parimuccanti…pe… sokaparidevadukkhadomanassupāyāsehi parimuccantī’’ti. Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Vamanasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "109"
      },
      ". ‘‘Tikicchakā ",
      ", bhikkhave, vamanaṃ denti pittasamuṭṭhānānampi ābādhānaṃ ",
      " paṭighātāya, semhasamuṭṭhānānampi ābādhānaṃ paṭighātāya, vātasamuṭṭhānānampi ābādhānaṃ paṭighātāya. Atthetaṃ, bhikkhave, vamanaṃ; ‘netaṃ natthī’ti vadāmi. Tañca kho etaṃ, bhikkhave, vamanaṃ sampajjatipi vipajjatipi."
    ],
    "innerText": "109. ‘‘Tikicchakā , bhikkhave, vamanaṃ denti pittasamuṭṭhānānampi ābādhānaṃ paṭighātāya, semhasamuṭṭhānānampi ābādhānaṃ paṭighātāya, vātasamuṭṭhānānampi ābādhānaṃ paṭighātāya. Atthetaṃ, bhikkhave, vamanaṃ; ‘netaṃ natthī’ti vadāmi. Tañca kho etaṃ, bhikkhave, vamanaṃ sampajjatipi vipajjatipi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ahañca kho, bhikkhave, ariyaṃ vamanaṃ desessāmi, yaṃ vamanaṃ sampajjatiyeva no vipajjati, yaṃ vamanaṃ āgamma jātidhammā sattā jātiyā parimuccanti, jarādhammā sattā jarāya parimuccanti, maraṇadhammā sattā maraṇena parimuccanti, sokaparidevadukkhadomanassupāyāsadhammā sattā sokaparidevadukkhadomanassupāyāsehi parimuccanti. Taṃ suṇātha…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamañca taṃ, bhikkhave, ariyaṃ vamanaṃ, yaṃ vamanaṃ sampajjatiyeva no vipajjati, yaṃ vamanaṃ āgamma jātidhammā sattā jātiyā parimuccanti…pe… sokaparidevadukkhadomanassupāyāsadhammā ",
      " sattā sokaparidevadukkhadomanassupāyāsehi parimuccanti?"
    ],
    "innerText": "‘‘Katamañca taṃ, bhikkhave, ariyaṃ vamanaṃ, yaṃ vamanaṃ sampajjatiyeva no vipajjati, yaṃ vamanaṃ āgamma jātidhammā sattā jātiyā parimuccanti…pe… sokaparidevadukkhadomanassupāyāsadhammā sattā sokaparidevadukkhadomanassupāyāsehi parimuccanti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sammādiṭṭhikassa ",
      ", bhikkhave, micchādiṭṭhi vantā hoti; ye ca micchādiṭṭhipaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa vantā honti; sammādiṭṭhipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti."
    ],
    "innerText": "‘‘Sammādiṭṭhikassa , bhikkhave, micchādiṭṭhi vantā hoti; ye ca micchādiṭṭhipaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa vantā honti; sammādiṭṭhipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sammāsaṅkappassa, bhikkhave, micchāsaṅkappo vanto hoti…pe… sammāvācassa, bhikkhave, micchāvācā vantā hoti… sammākammantassa, bhikkhave, micchākammanto vanto hoti… sammāājīvassa bhikkhave, micchāājīvo vanto hoti… sammāvāyāmassa, bhikkhave, micchāvāyāmo vanto hoti… sammāsatissa, bhikkhave, micchāsati vantā hoti… sammāsamādhissa, bhikkhave, micchāsamādhi vanto hoti… sammāñāṇissa, bhikkhave, micchāñāṇaṃ vantaṃ hoti ",
      " …pe…."
    ],
    "innerText": "‘‘Sammāsaṅkappassa, bhikkhave, micchāsaṅkappo vanto hoti…pe… sammāvācassa, bhikkhave, micchāvācā vantā hoti… sammākammantassa, bhikkhave, micchākammanto vanto hoti… sammāājīvassa bhikkhave, micchāājīvo vanto hoti… sammāvāyāmassa, bhikkhave, micchāvāyāmo vanto hoti… sammāsatissa, bhikkhave, micchāsati vantā hoti… sammāsamādhissa, bhikkhave, micchāsamādhi vanto hoti… sammāñāṇissa, bhikkhave, micchāñāṇaṃ vantaṃ hoti …pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sammāvimuttissa ",
      ", bhikkhave, micchāvimutti vantā hoti; ye ca micchāvimuttipaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa vantā honti; sammāvimuttipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti. Idaṃ kho taṃ, bhikkhave, ariyaṃ vamanaṃ yaṃ vamanaṃ sampajjatiyeva no vipajjati, yaṃ vamanaṃ āgamma jātidhammā sattā jātiyā parimuccanti…pe… sokaparidevadukkhadomanassupāyāsehi parimuccantī’’ti. Navamaṃ."
    ],
    "innerText": "‘‘Sammāvimuttissa , bhikkhave, micchāvimutti vantā hoti; ye ca micchāvimuttipaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa vantā honti; sammāvimuttipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti. Idaṃ kho taṃ, bhikkhave, ariyaṃ vamanaṃ yaṃ vamanaṃ sampajjatiyeva no vipajjati, yaṃ vamanaṃ āgamma jātidhammā sattā jātiyā parimuccanti…pe… sokaparidevadukkhadomanassupāyāsehi parimuccantī’’ti. Navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Niddhamanīyasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "110"
      },
      ". ‘‘Dasayime, bhikkhave, niddhamanīyā dhammā. Katame dasa? Sammādiṭṭhikassa, bhikkhave, micchādiṭṭhi niddhantā hoti; ye ca micchādiṭṭhipaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa niddhantā honti; sammādiṭṭhipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti ",
      "."
    ],
    "innerText": "110. ‘‘Dasayime, bhikkhave, niddhamanīyā dhammā. Katame dasa? Sammādiṭṭhikassa, bhikkhave, micchādiṭṭhi niddhantā hoti; ye ca micchādiṭṭhipaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa niddhantā honti; sammādiṭṭhipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sammāsaṅkappassa, bhikkhave, micchāsaṅkappo niddhanto hoti…pe… sammāvācassa bhikkhave, micchāvācā niddhantā hoti… sammākammantassa, bhikkhave, micchākammanto niddhanto hoti… sammāājīvassa, bhikkhave, micchāājīvo niddhanto hoti… sammāvāyāmassa, bhikkhave, micchāvāyāmo niddhanto hoti… sammāsatissa, bhikkhave, micchāsati niddhantā hoti… sammāsamādhissa, bhikkhave, micchāsamādhi niddhanto hoti… sammāñāṇissa, bhikkhave, micchāñāṇaṃ niddhantaṃ hoti…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sammāvimuttissa ",
      ", bhikkhave, micchāvimutti niddhantā hoti; ye ca micchāvimuttipaccayā aneke pāpakā akusalā ",
      " dhammā sambhavanti te cassa niddhantā honti; sammāvimuttipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti. Ime kho, bhikkhave, dasa niddhamanīyā dhammā’’ti. Dasamaṃ."
    ],
    "innerText": "‘‘Sammāvimuttissa , bhikkhave, micchāvimutti niddhantā hoti; ye ca micchāvimuttipaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa niddhantā honti; sammāvimuttipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti. Ime kho, bhikkhave, dasa niddhamanīyā dhammā’’ti. Dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "11. Paṭhamaasekhasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "111"
      },
      ". Atha kho aññataro bhikkhu yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca –"
    ],
    "innerText": "111. Atha kho aññataro bhikkhu yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Asekho ",
      " asekho’ti, bhante, vuccati. Kittāvatā bhante, bhikkhu asekho hotī’’ti? ‘‘Idha, bhikkhu, bhikkhu asekhāya sammādiṭṭhiyā samannāgato hoti, asekhena sammāsaṅkappena samannāgato hoti, asekhāya sammāvācāya samannāgato hoti, asekhena sammākammantena samannāgato hoti, asekhena sammāājīvena samannāgato hoti, asekhena sammāvāyāmena samannāgato hoti, asekhāya sammāsatiyā samannāgato hoti, asekhena sammāsamādhinā samannāgato hoti, asekhena sammāñāṇena samannāgato hoti, asekhāya sammāvimuttiyā samannāgato hoti. Evaṃ kho, bhikkhu, bhikkhu asekho hotī’’ti. Ekādasamaṃ."
    ],
    "innerText": "‘‘‘Asekho asekho’ti, bhante, vuccati. Kittāvatā bhante, bhikkhu asekho hotī’’ti? ‘‘Idha, bhikkhu, bhikkhu asekhāya sammādiṭṭhiyā samannāgato hoti, asekhena sammāsaṅkappena samannāgato hoti, asekhāya sammāvācāya samannāgato hoti, asekhena sammākammantena samannāgato hoti, asekhena sammāājīvena samannāgato hoti, asekhena sammāvāyāmena samannāgato hoti, asekhāya sammāsatiyā samannāgato hoti, asekhena sammāsamādhinā samannāgato hoti, asekhena sammāñāṇena samannāgato hoti, asekhāya sammāvimuttiyā samannāgato hoti. Evaṃ kho, bhikkhu, bhikkhu asekho hotī’’ti. Ekādasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "12. Dutiyaasekhasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "112"
      },
      ". ‘‘Dasayime ",
      ", bhikkhave, asekhiyā dhammā. Katame dasa? Asekhā sammādiṭṭhi, asekho sammāsaṅkappo, asekhā sammāvācā, asekho sammākammanto, asekho sammāājīvo, asekho sammāvāyāmo, asekhā sammāsati, asekho sammāsamādhi, asekhaṃ sammāñāṇaṃ, asekhā sammāvimutti – ime kho, bhikkhave, dasa asekhiyā dhammā’’ti. Dvādasamaṃ."
    ],
    "innerText": "112. ‘‘Dasayime , bhikkhave, asekhiyā dhammā. Katame dasa? Asekhā sammādiṭṭhi, asekho sammāsaṅkappo, asekhā sammāvācā, asekho sammākammanto, asekho sammāājīvo, asekho sammāvāyāmo, asekhā sammāsati, asekho sammāsamādhi, asekhaṃ sammāñāṇaṃ, asekhā sammāvimutti – ime kho, bhikkhave, dasa asekhiyā dhammā’’ti. Dvādasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Samaṇasaññāvaggo paṭhamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Saññā ",
      " bojjhaṅgā micchattaṃ, bījaṃ vijjāya nijjaraṃ;"
    ],
    "innerText": "Saññā bojjhaṅgā micchattaṃ, bījaṃ vijjāya nijjaraṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dhovanaṃ tikicchā vamanaṃ niddhamanaṃ dve asekhāti."
  }
]