[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "2. Anusayavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Kulasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "13"
      },
      ". Dutiyassa tatiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nāla"
      },
      "nti na yuttaṃ nānucchavikaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na manāpenā"
      },
      "ti na manamhi appanakena ākārena nisinnāsanato paccuṭṭhenti, anādarameva dassenti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Santamassa pariguhantī"
      },
      "ti vijjamānampi deyyadhammaṃ etassa niguhanti paṭicchādenti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asakkaccaṃ denti no sakkacca"
      },
      "nti lūkhaṃ vā hotu paṇītaṃ vā, asahatthā acittīkārena denti, no cittīkārena."
    ],
    "innerText": "13. Dutiyassa tatiye nālanti na yuttaṃ nānucchavikaṃ. Na manāpenāti na manamhi appanakena ākārena nisinnāsanato paccuṭṭhenti, anādarameva dassenti. Santamassa pariguhantīti vijjamānampi deyyadhammaṃ etassa niguhanti paṭicchādenti. Asakkaccaṃ denti no sakkaccanti lūkhaṃ vā hotu paṇītaṃ vā, asahatthā acittīkārena denti, no cittīkārena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Puggalasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "14"
      },
      ". Catutthe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ubhatobhāgavimutto"
      },
      "ti dvīhi bhāgehi vimutto, arūpasamāpattiyā rūpakāyato vimutto, maggena nāmakāyato. So catunnaṃ arūpasamāpattīnaṃ ekekato vuṭṭhāya saṅkhāre sammasitvā ",
      " arahattaṃ pattānaṃ catunnaṃ, nirodhā vuṭṭhāya arahattaṃ pattaanāgāmino ca vasena pañcavidho hoti. Pāḷi panettha ‘‘katamo ca puggalo ubhatobhāgavimutto? Idhekacco puggalo aṭṭha vimokkhe kāyena phusitvā viharati, paññāya cassa disvā āsavā parikkhīṇā hontī’’ti (pu. pa. 208) evaṃ aṭṭhavimokkhalābhino vasena āgatā."
    ],
    "innerText": "14. Catutthe ubhatobhāgavimuttoti dvīhi bhāgehi vimutto, arūpasamāpattiyā rūpakāyato vimutto, maggena nāmakāyato. So catunnaṃ arūpasamāpattīnaṃ ekekato vuṭṭhāya saṅkhāre sammasitvā arahattaṃ pattānaṃ catunnaṃ, nirodhā vuṭṭhāya arahattaṃ pattaanāgāmino ca vasena pañcavidho hoti. Pāḷi panettha ‘‘katamo ca puggalo ubhatobhāgavimutto? Idhekacco puggalo aṭṭha vimokkhe kāyena phusitvā viharati, paññāya cassa disvā āsavā parikkhīṇā hontī’’ti (pu. pa. 208) evaṃ aṭṭhavimokkhalābhino vasena āgatā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Paññāya vimuttoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paññāvimutto"
      },
      ". So sukkhavipassako, catūhi jhānehi vuṭṭhāya arahattaṃ pattā cattāro cāti imesaṃ vasena pañcavidho hoti. Pāḷi panettha aṭṭhavimokkhapaṭikkhepavaseneva āgatā. Yathāha – ‘‘na heva kho aṭṭha vimokkhe kāyena phusitvā viharati, paññāya ",
      " cassa disvā āsavā parikkhīṇā honti. Ayaṃ vuccati puggalo paññāvimutto’’ti."
    ],
    "innerText": "Paññāya vimuttoti paññāvimutto. So sukkhavipassako, catūhi jhānehi vuṭṭhāya arahattaṃ pattā cattāro cāti imesaṃ vasena pañcavidho hoti. Pāḷi panettha aṭṭhavimokkhapaṭikkhepavaseneva āgatā. Yathāha – ‘‘na heva kho aṭṭha vimokkhe kāyena phusitvā viharati, paññāya cassa disvā āsavā parikkhīṇā honti. Ayaṃ vuccati puggalo paññāvimutto’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Phuṭṭhantaṃ sacchikatoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāyasakkhī"
      },
      ". So jhānaphassaṃ paṭhamaṃ phusati, pacchā nirodhaṃ nibbānaṃ sacchikaroti. So sotāpattiphalaṭṭhaṃ ādiṃ katvā yāva arahattamaggaṭṭhā chabbidho hoti. Tenāha – ‘‘idhekacco puggalo aṭṭha vimokkhe kāyena phusitvā viharati, paññāya cassa disvā ekacce āsavā parikkhīṇā honti. Ayaṃ vuccati puggalo kāyasakkhī’’ti (pu. pa. 208)."
    ],
    "innerText": "Phuṭṭhantaṃ sacchikatoti kāyasakkhī. So jhānaphassaṃ paṭhamaṃ phusati, pacchā nirodhaṃ nibbānaṃ sacchikaroti. So sotāpattiphalaṭṭhaṃ ādiṃ katvā yāva arahattamaggaṭṭhā chabbidho hoti. Tenāha – ‘‘idhekacco puggalo aṭṭha vimokkhe kāyena phusitvā viharati, paññāya cassa disvā ekacce āsavā parikkhīṇā honti. Ayaṃ vuccati puggalo kāyasakkhī’’ti (pu. pa. 208)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Diṭṭhantaṃ pattoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "diṭṭhippatto"
      },
      ". Tatridaṃ saṅkhepalakkhaṇaṃ – dukkhā saṅkhārā, sukho nirodhoti ñātaṃ hoti diṭṭhaṃ viditaṃ sacchikataṃ phusitaṃ paññāyāti diṭṭhippatto. Vitthārato pana sopi kāyasakkhī viya chabbidho hoti. Tenevāha – ‘‘idhekacco puggalo ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti…pe… ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti, tathāgatappaveditā cassa dhammā paññāya vodiṭṭhā honti vocaritā paññāya…pe… ayaṃ vuccati puggalo diṭṭhippatto’’ti."
    ],
    "innerText": "Diṭṭhantaṃ pattoti diṭṭhippatto. Tatridaṃ saṅkhepalakkhaṇaṃ – dukkhā saṅkhārā, sukho nirodhoti ñātaṃ hoti diṭṭhaṃ viditaṃ sacchikataṃ phusitaṃ paññāyāti diṭṭhippatto. Vitthārato pana sopi kāyasakkhī viya chabbidho hoti. Tenevāha – ‘‘idhekacco puggalo ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti…pe… ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti, tathāgatappaveditā cassa dhammā paññāya vodiṭṭhā honti vocaritā paññāya…pe… ayaṃ vuccati puggalo diṭṭhippatto’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Saddhāya ",
      " vimuttoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saddhāvimutto"
      },
      ". Sopi vuttanayeneva chabbidho hoti. Tenāha – ‘‘idhekacco puggalo ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti…pe… ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti, tathāgatappaveditā cassa dhammā paññāya vodiṭṭhā honti vocaritā paññāya…pe… no ca kho yathādiṭṭhippattassa. Ayaṃ vuccati puggalo saddhāvimutto’’ti. Etassa hi saddhāvimuttassa pubbabhāgamaggakkhaṇe saddahantassa viya okappentassa viya adhimuccantassa viya ca kilesakkhayo hoti, diṭṭhippattassa pubbabhāgamaggakkhaṇe kilesacchedakañāṇaṃ adandhaṃ tikhiṇaṃ sūraṃ hutvā vahati. Tasmā yathā nāma nātitikhiṇena asinā kadaliṃ chindantassa chinnaṭṭhānaṃ maṭṭhaṃ na hoti, asi sīghaṃ na vahati, saddo suyyati, balavataro vāyāmo kātabbo hoti, evarūpā saddhāvimuttassa pubbabhāgamaggabhāvanā. Yathā pana sunisitena asinā kadaliṃ chindantassa chinnaṭṭhānaṃ maṭṭhaṃ hoti, asi sīghaṃ vahati, saddo na suyyati, balavavāyāmakiccaṃ ",
      " na hoti, evarūpā paññāvimuttassa pubbabhāgamaggabhāvanā veditabbā."
    ],
    "innerText": "Saddhāya vimuttoti saddhāvimutto. Sopi vuttanayeneva chabbidho hoti. Tenāha – ‘‘idhekacco puggalo ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti…pe… ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti, tathāgatappaveditā cassa dhammā paññāya vodiṭṭhā honti vocaritā paññāya…pe… no ca kho yathādiṭṭhippattassa. Ayaṃ vuccati puggalo saddhāvimutto’’ti. Etassa hi saddhāvimuttassa pubbabhāgamaggakkhaṇe saddahantassa viya okappentassa viya adhimuccantassa viya ca kilesakkhayo hoti, diṭṭhippattassa pubbabhāgamaggakkhaṇe kilesacchedakañāṇaṃ adandhaṃ tikhiṇaṃ sūraṃ hutvā vahati. Tasmā yathā nāma nātitikhiṇena asinā kadaliṃ chindantassa chinnaṭṭhānaṃ maṭṭhaṃ na hoti, asi sīghaṃ na vahati, saddo suyyati, balavataro vāyāmo kātabbo hoti, evarūpā saddhāvimuttassa pubbabhāgamaggabhāvanā. Yathā pana sunisitena asinā kadaliṃ chindantassa chinnaṭṭhānaṃ maṭṭhaṃ hoti, asi sīghaṃ vahati, saddo na suyyati, balavavāyāmakiccaṃ na hoti, evarūpā paññāvimuttassa pubbabhāgamaggabhāvanā veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dhammaṃ anussaratīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammānusārī"
      },
      ". Dhammoti paññā, paññāpubbaṅgamaṃ maggaṃ bhāvetīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddhānusārimhi"
      },
      "pi eseva nayo. Ubhopete sotāpattimaggaṭṭhāyeva. Vuttampi cetaṃ – ‘‘yassa ",
      " puggalassa sotāpattiphalasacchikiriyāya paṭipannassa paññindriyaṃ adhimattaṃ hoti, paññāvāhiṃ paññāpubbaṅgamaṃ ariyamaggaṃ bhāveti. Ayaṃ vuccati puggalo dhammānusārī. Yassa puggalassa sotāpattiphalasacchikiriyāya paṭipannassa saddhindriyaṃ adhimattaṃ hoti, saddhāvāhiṃ saddhāpubbaṅgamaṃ ariyamaggaṃ bhāveti. Ayaṃ vuccati puggalo saddhānusārī’’ti (pu. pa. 208). Ayamettha saṅkhepo, vitthārato panesā ubhatobhāgavimuttādikathā visuddhimagge (visuddhi. 2.771, 889) paññābhāvanādhikāre vuttā. Tasmā tattha vuttanayeneva veditabbāti."
    ],
    "innerText": "Dhammaṃ anussaratīti dhammānusārī. Dhammoti paññā, paññāpubbaṅgamaṃ maggaṃ bhāvetīti attho. Saddhānusārimhipi eseva nayo. Ubhopete sotāpattimaggaṭṭhāyeva. Vuttampi cetaṃ – ‘‘yassa puggalassa sotāpattiphalasacchikiriyāya paṭipannassa paññindriyaṃ adhimattaṃ hoti, paññāvāhiṃ paññāpubbaṅgamaṃ ariyamaggaṃ bhāveti. Ayaṃ vuccati puggalo dhammānusārī. Yassa puggalassa sotāpattiphalasacchikiriyāya paṭipannassa saddhindriyaṃ adhimattaṃ hoti, saddhāvāhiṃ saddhāpubbaṅgamaṃ ariyamaggaṃ bhāveti. Ayaṃ vuccati puggalo saddhānusārī’’ti (pu. pa. 208). Ayamettha saṅkhepo, vitthārato panesā ubhatobhāgavimuttādikathā visuddhimagge (visuddhi. 2.771, 889) paññābhāvanādhikāre vuttā. Tasmā tattha vuttanayeneva veditabbāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Udakūpamāsuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "15"
      },
      ". Pañcame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "udakūpamā"
      },
      "ti nimujjanādiākāraṃ gahetvā udakena upamitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sakiṃ nimuggo"
      },
      "ti ekavārameva nimuggo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekantakāḷakehī"
      },
      "ti niyatamicchādiṭṭhiṃ sandhāya vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ummujjatī"
      },
      "ti uṭṭhahati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sādhū"
      },
      "ti sobhanā bhaddakā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hāyatiyevā"
      },
      "ti caṅkavāre āsittaudakaṃ viya parihāyateva ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ummujjitvā vipassati viloketī"
      },
      "ti uṭṭhahitvā gantabbadisaṃ vipassati viloketi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pataratī"
      },
      "ti gantabbadisābhimukho tarati nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭigādhappatto hotī"
      },
      "ti uṭṭhāya viloketvā pataritvā ekasmiṃ ṭhāne patiṭṭhāpatto nāma hoti, tiṭṭhati na punāgacchati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tiṇṇo"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pāraṅgato thale tiṭṭhatī"
      },
      "ti sabbakilesoghaṃ taritvā paratīraṃ gantvā nibbānathale patiṭṭhito nāma hoti. Imasmiṃ sutte vaṭṭavivaṭṭaṃ kathitaṃ."
    ],
    "innerText": "15. Pañcame udakūpamāti nimujjanādiākāraṃ gahetvā udakena upamitā. Sakiṃ nimuggoti ekavārameva nimuggo. Ekantakāḷakehīti niyatamicchādiṭṭhiṃ sandhāya vuttaṃ. Ummujjatīti uṭṭhahati. Sādhūti sobhanā bhaddakā. Hāyatiyevāti caṅkavāre āsittaudakaṃ viya parihāyateva . Ummujjitvā vipassati viloketīti uṭṭhahitvā gantabbadisaṃ vipassati viloketi. Pataratīti gantabbadisābhimukho tarati nāma. Paṭigādhappatto hotīti uṭṭhāya viloketvā pataritvā ekasmiṃ ṭhāne patiṭṭhāpatto nāma hoti, tiṭṭhati na punāgacchati. Tiṇṇopāraṅgato thale tiṭṭhatīti sabbakilesoghaṃ taritvā paratīraṃ gantvā nibbānathale patiṭṭhito nāma hoti. Imasmiṃ sutte vaṭṭavivaṭṭaṃ kathitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Aniccānupassīsuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "16"
      },
      ". Chaṭṭhe aniccāti evaṃ paññāya pharanto anupassatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aniccānupassī"
      },
      ". Aniccāti evaṃ saññā assāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aniccasaññī"
      },
      ". Aniccāti evaṃ ñāṇena paṭisaṃveditā assāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aniccapaṭisaṃvedī. Satata"
      },
      "nti sabbakālaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samita"
      },
      "nti yathā ",
      " purimacittena pacchimacittaṃ samitaṃ samupagataṃ ghaṭṭitaṃ hoti, evaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abbokiṇṇa"
      },
      "nti nirantaraṃ aññena cetasā asaṃmissaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cetasā adhimuccamāno"
      },
      "ti cittena sanniṭṭhāpayamāno. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññāya pariyogāhamāno"
      },
      "ti vipassanāñāṇena anupavisamāno."
    ],
    "innerText": "16. Chaṭṭhe aniccāti evaṃ paññāya pharanto anupassatīti aniccānupassī. Aniccāti evaṃ saññā assāti aniccasaññī. Aniccāti evaṃ ñāṇena paṭisaṃveditā assāti aniccapaṭisaṃvedī. Satatanti sabbakālaṃ. Samitanti yathā purimacittena pacchimacittaṃ samitaṃ samupagataṃ ghaṭṭitaṃ hoti, evaṃ. Abbokiṇṇanti nirantaraṃ aññena cetasā asaṃmissaṃ. Cetasā adhimuccamānoti cittena sanniṭṭhāpayamāno. Paññāya pariyogāhamānoti vipassanāñāṇena anupavisamāno."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Apubbaṃ acarima"
      },
      "nti apure apacchā ekakkhaṇeyeva. Idha samasīsī kathito. So catubbidho hoti rogasamasīsī, vedanāsamasīsī, iriyāpathasamasīsī, jīvitasamasīsīti. Tattha yassa aññatarena rogena phuṭṭhassa sato rogavūpasamo ca āsavakkhayo ca ekappahāreneva hoti, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rogasamasīsī"
      },
      " nāma. Yassa pana aññataraṃ vedanaṃ vedayato vedanāvūpasamo ca āsavakkhayo ca ekappahāreneva hoti, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vedanāsamasīsī"
      },
      " nāma. Yassa pana ṭhānādīsu iriyāpathesu aññatarasamaṅgino vipassantassa iriyāpathassa pariyosānañca āsavakkhayo ca ekappahāreneva hoti, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "iriyāpathasamasīsī"
      },
      " nāma. Yassa pana upakkamato vā sarasato vā jīvitapariyādānañca āsavakkhayo ca ekappahāreneva hoti, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jīvitasamasīsī"
      },
      " nāma. Ayamidha adhippeto. Tattha ",
      " kiñcāpi āsavapariyādānaṃ maggacittena, jīvitapariyādānaṃ cuticittena hotīti ubhinnaṃ ekakkhaṇe sambhavo nāma natthi. Yasmā panassa āsavesu khīṇamattesu paccavekkhaṇavārānantarameva jīvitapariyādānaṃ gacchati, antaraṃ na paññāyati, tasmā evaṃ vuttaṃ."
    ],
    "innerText": "Apubbaṃ acarimanti apure apacchā ekakkhaṇeyeva. Idha samasīsī kathito. So catubbidho hoti rogasamasīsī, vedanāsamasīsī, iriyāpathasamasīsī, jīvitasamasīsīti. Tattha yassa aññatarena rogena phuṭṭhassa sato rogavūpasamo ca āsavakkhayo ca ekappahāreneva hoti, ayaṃ rogasamasīsī nāma. Yassa pana aññataraṃ vedanaṃ vedayato vedanāvūpasamo ca āsavakkhayo ca ekappahāreneva hoti, ayaṃ vedanāsamasīsī nāma. Yassa pana ṭhānādīsu iriyāpathesu aññatarasamaṅgino vipassantassa iriyāpathassa pariyosānañca āsavakkhayo ca ekappahāreneva hoti, ayaṃ iriyāpathasamasīsī nāma. Yassa pana upakkamato vā sarasato vā jīvitapariyādānañca āsavakkhayo ca ekappahāreneva hoti, ayaṃ jīvitasamasīsī nāma. Ayamidha adhippeto. Tattha kiñcāpi āsavapariyādānaṃ maggacittena, jīvitapariyādānaṃ cuticittena hotīti ubhinnaṃ ekakkhaṇe sambhavo nāma natthi. Yasmā panassa āsavesu khīṇamattesu paccavekkhaṇavārānantarameva jīvitapariyādānaṃ gacchati, antaraṃ na paññāyati, tasmā evaṃ vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Antarāparinibbāyī"
      },
      "ti ",
      " yo pañcasu suddhāvāsesu yattha katthaci uppanno nibbattakkhaṇe vā thokaṃ atikkamitvā vā vemajjhe ṭhatvā vā arahattaṃ pāpuṇāti, tassetaṃ nāmaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upahaccaparinibbāyī"
      },
      "ti yo tattheva āyuvemajjhaṃ atikkamitvā arahattaṃ pāpuṇāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asaṅkhāraparinibbāyī"
      },
      "ti yo tesaṃyeva puggalānaṃ asaṅkhāreneva appayogena kilese khepeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sasaṅkhāraparinibbāyī"
      },
      "ti yo sasaṅkhārena sappayogena kilese khepeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uddhaṃsoto akaniṭṭhagāmī"
      },
      "ti yo heṭṭhā catūsu suddhāvāsesu yattha katthaci nibbattitvā tato cuto anupubbena akaniṭṭhe uppajjitvā arahattaṃ pāpuṇāti."
    ],
    "innerText": "Antarāparinibbāyīti yo pañcasu suddhāvāsesu yattha katthaci uppanno nibbattakkhaṇe vā thokaṃ atikkamitvā vā vemajjhe ṭhatvā vā arahattaṃ pāpuṇāti, tassetaṃ nāmaṃ. Upahaccaparinibbāyīti yo tattheva āyuvemajjhaṃ atikkamitvā arahattaṃ pāpuṇāti. Asaṅkhāraparinibbāyīti yo tesaṃyeva puggalānaṃ asaṅkhāreneva appayogena kilese khepeti. Sasaṅkhāraparinibbāyīti yo sasaṅkhārena sappayogena kilese khepeti. Uddhaṃsoto akaniṭṭhagāmīti yo heṭṭhā catūsu suddhāvāsesu yattha katthaci nibbattitvā tato cuto anupubbena akaniṭṭhe uppajjitvā arahattaṃ pāpuṇāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7-9. Dukkhānupassīsuttādivaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "17-19"
      },
      ". Sattame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dukkhānupassī"
      },
      "ti pīḷanākāraṃ dukkhato anupassanto. Aṭṭhame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anattānupassī"
      },
      "ti avasavattanākāraṃ anattāti anupassanto. Navame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sukhānupassī"
      },
      "ti sukhanti evaṃ ñāṇena anupassanto."
    ],
    "innerText": "17-19. Sattame dukkhānupassīti pīḷanākāraṃ dukkhato anupassanto. Aṭṭhame anattānupassīti avasavattanākāraṃ anattāti anupassanto. Navame sukhānupassīti sukhanti evaṃ ñāṇena anupassanto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Niddasavatthusuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "20"
      },
      ". Dasame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "niddasavatthūnī"
      },
      "ti niddasādivatthūni, ‘‘niddaso bhikkhu, nibbīso, nittiṃso, niccattālīso, nippaññāso’’ti evaṃ vacanakāraṇāni. Ayaṃ kira pañho titthiyasamaye uppanno. Titthiyā hi dasavassakāle mataṃ nigaṇṭhaṃ niddasoti vadanti. So kira ",
      " puna dasavasso na hoti. Na kevalañca dasavasso, navavassopi ekavassopi na hoti. Eteneva nayena vīsativassādikālepi mataṃ nigaṇṭhaṃ ‘‘nibbīso nittiṃso niccattālīso nippaññāso’’ti vadanti. Āyasmā ānando gāme vicaranto taṃ kathaṃ sutvā vihāraṃ gantvā bhagavato ārocesi. Bhagavā āha – ‘‘na idaṃ, ānanda, titthiyānaṃ adhivacanaṃ, mama sāsane khīṇāsavassetaṃ adhivacanaṃ. Khīṇāsavo hi dasavassakāle parinibbuto puna dasavasso na hoti. Na kevalañca dasavassova, navavassopi…pe… ekavassopi. Na kevalañca ekavassova, ekādasamāsikopi…pe… ekamāsikopi ekamuhuttikopi na hotiyeva’’. Kasmā? Puna paṭisandhiyā abhāvā. Nibbīsādīsupi eseva nayo. Iti bhagavā ‘‘mama sāsane ",
      " khīṇāsavassetaṃ adhivacana’’nti vatvā yehi kāraṇehi niddaso hoti, tāni dassetuṃ imaṃ desanaṃ ārabhi."
    ],
    "innerText": "20. Dasame niddasavatthūnīti niddasādivatthūni, ‘‘niddaso bhikkhu, nibbīso, nittiṃso, niccattālīso, nippaññāso’’ti evaṃ vacanakāraṇāni. Ayaṃ kira pañho titthiyasamaye uppanno. Titthiyā hi dasavassakāle mataṃ nigaṇṭhaṃ niddasoti vadanti. So kira puna dasavasso na hoti. Na kevalañca dasavasso, navavassopi ekavassopi na hoti. Eteneva nayena vīsativassādikālepi mataṃ nigaṇṭhaṃ ‘‘nibbīso nittiṃso niccattālīso nippaññāso’’ti vadanti. Āyasmā ānando gāme vicaranto taṃ kathaṃ sutvā vihāraṃ gantvā bhagavato ārocesi. Bhagavā āha – ‘‘na idaṃ, ānanda, titthiyānaṃ adhivacanaṃ, mama sāsane khīṇāsavassetaṃ adhivacanaṃ. Khīṇāsavo hi dasavassakāle parinibbuto puna dasavasso na hoti. Na kevalañca dasavassova, navavassopi…pe… ekavassopi. Na kevalañca ekavassova, ekādasamāsikopi…pe… ekamāsikopi ekamuhuttikopi na hotiyeva’’. Kasmā? Puna paṭisandhiyā abhāvā. Nibbīsādīsupi eseva nayo. Iti bhagavā ‘‘mama sāsane khīṇāsavassetaṃ adhivacana’’nti vatvā yehi kāraṇehi niddaso hoti, tāni dassetuṃ imaṃ desanaṃ ārabhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "idhā"
      },
      "ti imasmiṃ sāsane. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sikkhāsamādāne tibbacchando hotī"
      },
      "ti sikkhāttayapūraṇe balavacchando hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āyatiñca sikkhāsamādāne avigatapemo"
      },
      "ti anāgate punadivasādīsupi sikkhāpūraṇe avigatapemeneva samannāgato hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammanisantiyā"
      },
      "ti dhammanisāmanāya. Vipassanāyetaṃ adhivacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Icchāvinaye"
      },
      "ti taṇhāvinaye. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭisallāne"
      },
      "ti ekībhāve. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vīriyārambhe"
      },
      "ti kāyikacetasikassa vīriyassa ",
      " pūraṇe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Satinepakke"
      },
      "ti ",
      " satiyañceva nipakabhāve. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Diṭṭhipaṭivedhe"
      },
      "ti maggadassane. Sesaṃ sabbattha uttānamevāti."
    ],
    "innerText": "Tattha idhāti imasmiṃ sāsane. Sikkhāsamādāne tibbacchando hotīti sikkhāttayapūraṇe balavacchando hoti. Āyatiñca sikkhāsamādāne avigatapemoti anāgate punadivasādīsupi sikkhāpūraṇe avigatapemeneva samannāgato hoti. Dhammanisantiyāti dhammanisāmanāya. Vipassanāyetaṃ adhivacanaṃ. Icchāvinayeti taṇhāvinaye. Paṭisallāneti ekībhāve. Vīriyārambheti kāyikacetasikassa vīriyassa pūraṇe. Satinepakketi satiyañceva nipakabhāve. Diṭṭhipaṭivedheti maggadassane. Sesaṃ sabbattha uttānamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Anusayavaggo dutiyo."
  }
]