[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "3. Mahāvaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Sīhanādasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "21"
      },
      ". Tatiyassa ",
      " paṭhame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "visamagate"
      },
      "ti visamaṭṭhānesu gocaresu gate. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅghātaṃ āpādesi"
      },
      "nti ghātaṃ vadhaṃ pāpesiṃ. Tassa hi ussannatejatāya khuddakesu pāṇesu anukampā hoti. Tasmā ye paṭisattubhāvena ",
      " saṇṭhātuṃ sakkhissanti, ye dubbalā palāyitukāmā bhavissanti, te palāyissantīti sīhanādaṃ naditvāva gocarāya pakkamati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tathāgatassetaṃ adhivacana"
      },
      "nti yadi hi sahanatāya hananatāya ca sīho, tathāgato ",
      " hi sabbāni ca iṭṭhāniṭṭhāni sahati, sabbaparappavādino ca vādānaṃ nimmathanena hanati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idamassa hoti sīhanādasmi"
      },
      "nti ayamassa sīhanādo."
    ],
    "innerText": "21. Tatiyassa paṭhame visamagateti visamaṭṭhānesu gocaresu gate. Saṅghātaṃ āpādesinti ghātaṃ vadhaṃ pāpesiṃ. Tassa hi ussannatejatāya khuddakesu pāṇesu anukampā hoti. Tasmā ye paṭisattubhāvena saṇṭhātuṃ sakkhissanti, ye dubbalā palāyitukāmā bhavissanti, te palāyissantīti sīhanādaṃ naditvāva gocarāya pakkamati. Tathāgatassetaṃ adhivacananti yadi hi sahanatāya hananatāya ca sīho, tathāgato hi sabbāni ca iṭṭhāniṭṭhāni sahati, sabbaparappavādino ca vādānaṃ nimmathanena hanati. Idamassa hoti sīhanādasminti ayamassa sīhanādo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tathāgatabalānī"
      },
      "ti aññehi asādhāraṇāni tathāgatasseva balāni. Yathā vā pubbabuddhānaṃ balāni puññasampattiyā āgatāni, tathā āgatabalānītipi attho. Tattha duvidhaṃ tathāgatassa balaṃ kāyabalaṃ ñāṇabalaṃ. Tesu kāyabalaṃ hatthikulānusārena veditabbaṃ. Vuttañhetaṃ porāṇehi –"
    ],
    "innerText": "Tathāgatabalānīti aññehi asādhāraṇāni tathāgatasseva balāni. Yathā vā pubbabuddhānaṃ balāni puññasampattiyā āgatāni, tathā āgatabalānītipi attho. Tattha duvidhaṃ tathāgatassa balaṃ kāyabalaṃ ñāṇabalaṃ. Tesu kāyabalaṃ hatthikulānusārena veditabbaṃ. Vuttañhetaṃ porāṇehi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kālāvakañca gaṅgeyyaṃ, paṇḍaraṃ tambapiṅgalaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Gandhamaṅgalahemañca, uposathachaddantime dasā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Imāni dasa hatthikulāni. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kālāvaka"
      },
      "nti pakatihatthikulaṃ daṭṭhabbaṃ. Yaṃ dasannaṃ purisānaṃ kāyabalaṃ, taṃ ekassa kālāvakassa hatthino. Yaṃ dasannaṃ kālāvakānaṃ balaṃ, taṃ ekassa gaṅgeyyassa. Yaṃ dasannaṃ gaṅgeyyānaṃ, taṃ ekassa paṇḍarassa. Yaṃ dasannaṃ paṇḍarānaṃ, taṃ ekassa tambassa. Yaṃ dasannaṃ tambānaṃ, taṃ ekassa piṅgalassa. Yaṃ dasannaṃ piṅgalānaṃ, taṃ ekassa gandhahatthino. Yaṃ dasannaṃ gandhahatthīnaṃ, taṃ ekassa maṅgalassa. Yaṃ dasannaṃ maṅgalānaṃ, taṃ ekassa hemassa. Yaṃ dasannaṃ hemānaṃ, taṃ ekassa uposathassa. Yaṃ dasannaṃ uposathānaṃ, taṃ ekassa chaddantassa. Yaṃ dasannaṃ chaddantānaṃ, taṃ ekassa tathāgatassa. Nārāyanasaṅghātabalantipi idameva ",
      " vuccati ",
      ". Tadetaṃ pakatihatthigaṇanāya hatthīnaṃ koṭisahassānaṃ, purisagaṇanāya dasannaṃ purisakoṭisahassānaṃ balaṃ hoti. Idaṃ tāva tathāgatassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāyabalaṃ"
      },
      "."
    ],
    "innerText": "Imāni dasa hatthikulāni. Tattha kālāvakanti pakatihatthikulaṃ daṭṭhabbaṃ. Yaṃ dasannaṃ purisānaṃ kāyabalaṃ, taṃ ekassa kālāvakassa hatthino. Yaṃ dasannaṃ kālāvakānaṃ balaṃ, taṃ ekassa gaṅgeyyassa. Yaṃ dasannaṃ gaṅgeyyānaṃ, taṃ ekassa paṇḍarassa. Yaṃ dasannaṃ paṇḍarānaṃ, taṃ ekassa tambassa. Yaṃ dasannaṃ tambānaṃ, taṃ ekassa piṅgalassa. Yaṃ dasannaṃ piṅgalānaṃ, taṃ ekassa gandhahatthino. Yaṃ dasannaṃ gandhahatthīnaṃ, taṃ ekassa maṅgalassa. Yaṃ dasannaṃ maṅgalānaṃ, taṃ ekassa hemassa. Yaṃ dasannaṃ hemānaṃ, taṃ ekassa uposathassa. Yaṃ dasannaṃ uposathānaṃ, taṃ ekassa chaddantassa. Yaṃ dasannaṃ chaddantānaṃ, taṃ ekassa tathāgatassa. Nārāyanasaṅghātabalantipi idameva vuccati . Tadetaṃ pakatihatthigaṇanāya hatthīnaṃ koṭisahassānaṃ, purisagaṇanāya dasannaṃ purisakoṭisahassānaṃ balaṃ hoti. Idaṃ tāva tathāgatassa kāyabalaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ñāṇabalaṃ pana pāḷiyaṃ tāva āgatameva. Dasabalañāṇaṃ, majjhime āgataṃ catuvesārajjañāṇaṃ, aṭṭhasu parisāsu akampanañāṇaṃ, catuyoniparicchedañāṇaṃ, pañcagatiparicchedañāṇaṃ, saṃyuttake (saṃ. ni. 2.33) āgatāni tesattati ñāṇāni sattasattati ñāṇānīti, evaṃ aññānipi anekāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ñāṇabalaṃ"
      },
      " nāma. Idhāpi ñāṇabalameva adhippetaṃ. Ñāṇañhi akampiyaṭṭhena upatthambhanaṭṭhena ca balanti vuttaṃ."
    ],
    "innerText": "Ñāṇabalaṃ pana pāḷiyaṃ tāva āgatameva. Dasabalañāṇaṃ, majjhime āgataṃ catuvesārajjañāṇaṃ, aṭṭhasu parisāsu akampanañāṇaṃ, catuyoniparicchedañāṇaṃ, pañcagatiparicchedañāṇaṃ, saṃyuttake (saṃ. ni. 2.33) āgatāni tesattati ñāṇāni sattasattati ñāṇānīti, evaṃ aññānipi anekāni ñāṇabalaṃ nāma. Idhāpi ñāṇabalameva adhippetaṃ. Ñāṇañhi akampiyaṭṭhena upatthambhanaṭṭhena ca balanti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āsabhaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ṭhāna"
      },
      "nti seṭṭhaṭṭhānaṃ uttamaṭṭhānaṃ. Āsabhā vā pubbabuddhā, tesaṃ ṭhānanti attho. Apica gavasatajeṭṭhako usabho, gavasahassajeṭṭhako vasabho. Vajasatajeṭṭhako vā usabho, vajasahassajeṭṭhako vasabho. Sabbagavaseṭṭho sabbaparissayasaho seto pāsādiko mahābhāravaho asanisatasaddehipi asampakampiyo nisabho, so idha usabhoti adhippeto. Idampi hi tassa pariyāyavacanaṃ. Usabhassa idanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āsabhaṃ. Ṭhāna"
      },
      "nti catūhi pādehi pathaviṃ uppīḷetvā acalaṭṭhānaṃ. Idaṃ pana āsabhaṃ viyāti āsabhaṃ. Yatheva hi nisabhasaṅkhāto usabho usabhabalena samannāgato catūhi pādehi pathaviṃ uppīḷetvā acalaṭṭhānena tiṭṭhati, evaṃ tathāgatopi dasahi tathāgatabalehi samannāgato catūhi vesārajjapādehi aṭṭhaparisapathaviṃ uppīḷetvā sadevake loke kenaci paccatthikena paccāmittena akampiyo acalaṭṭhānena tiṭṭhati. Evaṃ tiṭṭhamāno ca taṃ āsabhaṃ ṭhānaṃ paṭijānāti upagacchati na paccakkhāti attani āropeti. Tena vuttaṃ – ‘‘āsabhaṃ ṭhānaṃ paṭijānātī’’ti."
    ],
    "innerText": "Āsabhaṃṭhānanti seṭṭhaṭṭhānaṃ uttamaṭṭhānaṃ. Āsabhā vā pubbabuddhā, tesaṃ ṭhānanti attho. Apica gavasatajeṭṭhako usabho, gavasahassajeṭṭhako vasabho. Vajasatajeṭṭhako vā usabho, vajasahassajeṭṭhako vasabho. Sabbagavaseṭṭho sabbaparissayasaho seto pāsādiko mahābhāravaho asanisatasaddehipi asampakampiyo nisabho, so idha usabhoti adhippeto. Idampi hi tassa pariyāyavacanaṃ. Usabhassa idanti āsabhaṃ. Ṭhānanti catūhi pādehi pathaviṃ uppīḷetvā acalaṭṭhānaṃ. Idaṃ pana āsabhaṃ viyāti āsabhaṃ. Yatheva hi nisabhasaṅkhāto usabho usabhabalena samannāgato catūhi pādehi pathaviṃ uppīḷetvā acalaṭṭhānena tiṭṭhati, evaṃ tathāgatopi dasahi tathāgatabalehi samannāgato catūhi vesārajjapādehi aṭṭhaparisapathaviṃ uppīḷetvā sadevake loke kenaci paccatthikena paccāmittena akampiyo acalaṭṭhānena tiṭṭhati. Evaṃ tiṭṭhamāno ca taṃ āsabhaṃ ṭhānaṃ paṭijānāti upagacchati na paccakkhāti attani āropeti. Tena vuttaṃ – ‘‘āsabhaṃ ṭhānaṃ paṭijānātī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parisāsū"
      },
      "ti ",
      " aṭṭhasu parisāsu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sīhanādaṃ nadatī"
      },
      "ti seṭṭhanādaṃ nadati, abhītanādaṃ nadati, sīhanādasadisaṃ vā nādaṃ nadati. Tatrāyaṃ upamā – yathā sīho sīhabalena samannāgato sabbattha visārado vigatalomahaṃso sīhanādaṃ nadati, evaṃ tathāgatasīhopi tathāgatabalehi samannāgato aṭṭhasu parisāsu visārado vigatalomahaṃso ‘‘iti ",
      " sakkāyo’’tiādinā nayena nānāvidhadesanāvilāsasampannaṃ sīhanādaṃ nadati. Tena vuttaṃ – ‘‘parisāsu sīhanādaṃ nadatī’’ti."
    ],
    "innerText": "Parisāsūti aṭṭhasu parisāsu. Sīhanādaṃ nadatīti seṭṭhanādaṃ nadati, abhītanādaṃ nadati, sīhanādasadisaṃ vā nādaṃ nadati. Tatrāyaṃ upamā – yathā sīho sīhabalena samannāgato sabbattha visārado vigatalomahaṃso sīhanādaṃ nadati, evaṃ tathāgatasīhopi tathāgatabalehi samannāgato aṭṭhasu parisāsu visārado vigatalomahaṃso ‘‘iti sakkāyo’’tiādinā nayena nānāvidhadesanāvilāsasampannaṃ sīhanādaṃ nadati. Tena vuttaṃ – ‘‘parisāsu sīhanādaṃ nadatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Brahmacakkaṃ pavattetī"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "brahma"
      },
      "nti seṭṭhaṃ uttamaṃ visiṭṭhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cakka"
      },
      "nti dhammacakkaṃ. Taṃ panetaṃ duvidhaṃ hoti paṭivedhañāṇañceva desanāñāṇañca. Tattha paññāpabhāvitaṃ attano ariyaphalāvahaṃ paṭivedhañāṇaṃ, karuṇāpabhāvitaṃ sāvakānaṃ ariyaphalāvahaṃ desanāñāṇaṃ. Tattha paṭivedhañāṇaṃ uppajjamānaṃ uppannanti duvidhaṃ. Tañhi abhinikkhamanato yāva arahattamaggā uppajjamānaṃ, phalakkhaṇe uppannaṃ nāma. Tusitabhavanato vā yāva mahābodhipallaṅke arahattamaggā uppajjamānaṃ, phalakkhaṇe uppannaṃ nāma. Dīpaṅkarato vā paṭṭhāya yāva arahattamaggā uppajjamānaṃ, phalakkhaṇe uppannaṃ nāma. Desanāñāṇampi pavattamānaṃ pavattanti duvidhaṃ. Tañhi yāva aññāsikoṇḍaññassa sotāpattimaggā pavattamānaṃ, phalakkhaṇe pavattaṃ nāma. Tesu paṭivedhañāṇaṃ lokuttaraṃ, desanāñāṇaṃ lokiyaṃ. Ubhayampi panetaṃ aññehi asādhāraṇaṃ, buddhānaṃyeva orasañāṇaṃ."
    ],
    "innerText": "Brahmacakkaṃ pavattetīti ettha brahmanti seṭṭhaṃ uttamaṃ visiṭṭhaṃ. Cakkanti dhammacakkaṃ. Taṃ panetaṃ duvidhaṃ hoti paṭivedhañāṇañceva desanāñāṇañca. Tattha paññāpabhāvitaṃ attano ariyaphalāvahaṃ paṭivedhañāṇaṃ, karuṇāpabhāvitaṃ sāvakānaṃ ariyaphalāvahaṃ desanāñāṇaṃ. Tattha paṭivedhañāṇaṃ uppajjamānaṃ uppannanti duvidhaṃ. Tañhi abhinikkhamanato yāva arahattamaggā uppajjamānaṃ, phalakkhaṇe uppannaṃ nāma. Tusitabhavanato vā yāva mahābodhipallaṅke arahattamaggā uppajjamānaṃ, phalakkhaṇe uppannaṃ nāma. Dīpaṅkarato vā paṭṭhāya yāva arahattamaggā uppajjamānaṃ, phalakkhaṇe uppannaṃ nāma. Desanāñāṇampi pavattamānaṃ pavattanti duvidhaṃ. Tañhi yāva aññāsikoṇḍaññassa sotāpattimaggā pavattamānaṃ, phalakkhaṇe pavattaṃ nāma. Tesu paṭivedhañāṇaṃ lokuttaraṃ, desanāñāṇaṃ lokiyaṃ. Ubhayampi panetaṃ aññehi asādhāraṇaṃ, buddhānaṃyeva orasañāṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni ",
      " yehi dasahi balehi samannāgato tathāgato āsabhaṃ ṭhānaṃ paṭijānāti, tāni vitthārato dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "katamāni dasa? Idha, bhikkhave, tathāgato ṭhānañca ṭhānato"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ṭhānañca ṭhānato"
      },
      "ti kāraṇañca kāraṇato. Kāraṇañhi ",
      " yasmā tattha phalaṃ tiṭṭhati, tadāyattavuttitāya uppajjati ceva pavattati ca, tasmā ṭhānanti vuccati. Taṃ bhagavā ‘‘ye ye dhammā yesaṃ yesaṃ dhammānaṃ hetū paccayā uppādāya, taṃ taṃ ṭhānaṃ. Ye ye dhammā yesaṃ yesaṃ dhammānaṃ na hetū na paccayā uppādāya, taṃ taṃ aṭṭhāna’’nti pajānanto ṭhānañca ṭhānato aṭṭhānañca aṭṭhānato yathābhūtaṃ pajānāti. Abhidhamme panetaṃ ‘‘tattha katamaṃ tathāgatassa ṭhānañca ṭhānato aṭṭhānañca aṭṭhānato yathābhūtaṃ ñāṇa’’ntiādinā (vibha. 809) nayena vitthāritameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yampī"
      },
      "ti yena ñāṇena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idampi, bhikkhave, tathāgatassā"
      },
      "ti idampi ṭhānāṭṭhānañāṇaṃ tathāgatassa tathāgatabalaṃ nāma hotīti attho. Evaṃ sabbapadesu yojanā veditabbā."
    ],
    "innerText": "Idāni yehi dasahi balehi samannāgato tathāgato āsabhaṃ ṭhānaṃ paṭijānāti, tāni vitthārato dassetuṃ katamāni dasa? Idha, bhikkhave, tathāgato ṭhānañca ṭhānatotiādimāha. Tattha ṭhānañca ṭhānatoti kāraṇañca kāraṇato. Kāraṇañhi yasmā tattha phalaṃ tiṭṭhati, tadāyattavuttitāya uppajjati ceva pavattati ca, tasmā ṭhānanti vuccati. Taṃ bhagavā ‘‘ye ye dhammā yesaṃ yesaṃ dhammānaṃ hetū paccayā uppādāya, taṃ taṃ ṭhānaṃ. Ye ye dhammā yesaṃ yesaṃ dhammānaṃ na hetū na paccayā uppādāya, taṃ taṃ aṭṭhāna’’nti pajānanto ṭhānañca ṭhānato aṭṭhānañca aṭṭhānato yathābhūtaṃ pajānāti. Abhidhamme panetaṃ ‘‘tattha katamaṃ tathāgatassa ṭhānañca ṭhānato aṭṭhānañca aṭṭhānato yathābhūtaṃ ñāṇa’’ntiādinā (vibha. 809) nayena vitthāritameva. Yampīti yena ñāṇena. Idampi, bhikkhave, tathāgatassāti idampi ṭhānāṭṭhānañāṇaṃ tathāgatassa tathāgatabalaṃ nāma hotīti attho. Evaṃ sabbapadesu yojanā veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammasamādānāna"
      },
      "nti samādiyitvā katānaṃ kusalākusalakammānaṃ, kammameva vā kammasamādānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ṭhānaso hetuso"
      },
      "ti paccayato ceva ",
      " hetuto ca. Tattha gatiupadhikālapayogā vipākassa ṭhānaṃ, kammaṃ hetu. Imassa pana ñāṇassa vitthārakathā ‘‘atthekaccāni pāpakāni kammasamādānāni gatisampattipaṭibāḷhāni na vipaccantī’’tiādinā (vibha. 810) nayena abhidhamme āgatāyeva."
    ],
    "innerText": "Kammasamādānānanti samādiyitvā katānaṃ kusalākusalakammānaṃ, kammameva vā kammasamādānaṃ. Ṭhānaso hetusoti paccayato ceva hetuto ca. Tattha gatiupadhikālapayogā vipākassa ṭhānaṃ, kammaṃ hetu. Imassa pana ñāṇassa vitthārakathā ‘‘atthekaccāni pāpakāni kammasamādānāni gatisampattipaṭibāḷhāni na vipaccantī’’tiādinā (vibha. 810) nayena abhidhamme āgatāyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbatthagāmini"
      },
      "nti sabbagatigāminiñca agatigāminiñca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭipada"
      },
      "nti maggaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathābhūtaṃ pajānātī"
      },
      "ti bahūsupi manussesu ekameva pāṇaṃ ",
      " ghātentesu ‘‘imassa cetanā nirayagāminī bhavissati, imassa tiracchānayonigāminī’’ti iminā nayena ekavatthusmimpi kusalākusalacetanāsaṅkhātānaṃ paṭipattīnaṃ aviparītato sabhāvaṃ jānāti. Imassapi ca ñāṇassa vitthārakathā ‘‘tattha katamaṃ tathāgatassa sabbatthagāminiṃ paṭipadaṃ yathābhūtaṃ ñāṇaṃ? Idha tathāgato ayaṃ maggo ayaṃ paṭipadā nirayagāminīti pajānātī’’tiādinā (vibha. 811) nayena abhidhamme āgatāyeva."
    ],
    "innerText": "Sabbatthagāmininti sabbagatigāminiñca agatigāminiñca. Paṭipadanti maggaṃ. Yathābhūtaṃ pajānātīti bahūsupi manussesu ekameva pāṇaṃ ghātentesu ‘‘imassa cetanā nirayagāminī bhavissati, imassa tiracchānayonigāminī’’ti iminā nayena ekavatthusmimpi kusalākusalacetanāsaṅkhātānaṃ paṭipattīnaṃ aviparītato sabhāvaṃ jānāti. Imassapi ca ñāṇassa vitthārakathā ‘‘tattha katamaṃ tathāgatassa sabbatthagāminiṃ paṭipadaṃ yathābhūtaṃ ñāṇaṃ? Idha tathāgato ayaṃ maggo ayaṃ paṭipadā nirayagāminīti pajānātī’’tiādinā (vibha. 811) nayena abhidhamme āgatāyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anekadhātu"
      },
      "nti cakkhudhātuādīhi kāmadhātuādīhi vā dhātūhi bahudhātuṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nānādhātu"
      },
      "nti tāsaṃyeva dhātūnaṃ vilakkhaṇatāya nānappakāradhātuṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Loka"
      },
      "nti khandhāyatanadhātulokaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathābhūtaṃ pajānātī"
      },
      "ti tāsaṃ dhātūnaṃ aviparītato sabhāvaṃ paṭivijjhati. Idampi ñāṇaṃ ‘‘tattha katamaṃ tathāgatassa ",
      " anekadhātunānādhātulokaṃ yathābhūtaṃ ñāṇaṃ? Idha tathāgato khandhanānattaṃ pajānātī’’tiādinā nayena abhidhamme vitthāritameva."
    ],
    "innerText": "Anekadhātunti cakkhudhātuādīhi kāmadhātuādīhi vā dhātūhi bahudhātuṃ. Nānādhātunti tāsaṃyeva dhātūnaṃ vilakkhaṇatāya nānappakāradhātuṃ. Lokanti khandhāyatanadhātulokaṃ. Yathābhūtaṃ pajānātīti tāsaṃ dhātūnaṃ aviparītato sabhāvaṃ paṭivijjhati. Idampi ñāṇaṃ ‘‘tattha katamaṃ tathāgatassa anekadhātunānādhātulokaṃ yathābhūtaṃ ñāṇaṃ? Idha tathāgato khandhanānattaṃ pajānātī’’tiādinā nayena abhidhamme vitthāritameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nānādhimuttikata"
      },
      "nti hīnādīhi adhimuttīhi nānādhimuttikabhāvaṃ. Idampi ñāṇaṃ ‘‘tattha katamaṃ tathāgatassa sattānaṃ nānādhimuttikataṃ yathābhūtaṃ ñāṇaṃ? Idha tathāgato pajānāti santi sattā hīnādhimuttikā’’tiādinā nayena abhidhamme vitthāritameva."
    ],
    "innerText": "Nānādhimuttikatanti hīnādīhi adhimuttīhi nānādhimuttikabhāvaṃ. Idampi ñāṇaṃ ‘‘tattha katamaṃ tathāgatassa sattānaṃ nānādhimuttikataṃ yathābhūtaṃ ñāṇaṃ? Idha tathāgato pajānāti santi sattā hīnādhimuttikā’’tiādinā nayena abhidhamme vitthāritameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parasattāna"
      },
      "nti padhānasattānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parapuggalāna"
      },
      "nti tato aññesaṃ hīnasattānaṃ. Ekatthameva vā etaṃ padadvayaṃ, veneyyavasena dvidhā vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Indriyaparopariyatta"
      },
      "nti ",
      " saddhādīnaṃ indriyānaṃ parabhāvañca aparabhāvañca, vuddhiñca hāniñcāti attho. Imassāpi ñāṇassa vitthārakathā ‘‘tattha katamaṃ tathāgatassa parasattānaṃ parapuggalānaṃ indriyaparopariyattaṃ yathābhūtaṃ ñāṇaṃ ",
      "? Idha tathāgato sattānaṃ āsayaṃ pajānātī’’ti (vibha. 814) ādinā nayena abhidhamme āgatāyeva."
    ],
    "innerText": "Parasattānanti padhānasattānaṃ. Parapuggalānanti tato aññesaṃ hīnasattānaṃ. Ekatthameva vā etaṃ padadvayaṃ, veneyyavasena dvidhā vuttaṃ. Indriyaparopariyattanti saddhādīnaṃ indriyānaṃ parabhāvañca aparabhāvañca, vuddhiñca hāniñcāti attho. Imassāpi ñāṇassa vitthārakathā ‘‘tattha katamaṃ tathāgatassa parasattānaṃ parapuggalānaṃ indriyaparopariyattaṃ yathābhūtaṃ ñāṇaṃ ? Idha tathāgato sattānaṃ āsayaṃ pajānātī’’ti (vibha. 814) ādinā nayena abhidhamme āgatāyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jhānavimokkhasamādhisamāpattīna"
      },
      "nti paṭhamādīnaṃ catunnaṃ jhānānaṃ, ‘‘rūpī rūpāni passatī’’tiādīnaṃ aṭṭhannaṃ vimokkhānaṃ, savitakkasavicārādīnaṃ tiṇṇaṃ samādhīnaṃ, paṭhamajjhānasamāpattiādīnañca navannaṃ anupubbasamāpattīnaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṃkilesa"
      },
      "nti hānabhāgiyadhammaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vodāna"
      },
      "nti visesabhāgiyadhammaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vuṭṭhāna"
      },
      "nti ‘‘vodānampi vuṭṭhānaṃ, tamhā tamhā samādhimhā vuṭṭhānampi vuṭṭhāna’’nti (vibha. 828) evaṃ vuttaṃ paguṇajjhānañceva bhavaṅgaphalasamāpattiyo ca. Heṭṭhimaṃ heṭṭhimañhi paguṇajjhānaṃ uparimassa uparimassa padaṭṭhānaṃ hoti, tasmā ‘‘vodānampi vuṭṭhāna’’nti vuttaṃ. Bhavaṅgena pana sabbajjhānehi vuṭṭhānaṃ hoti, phalasamāpattiyā nirodhasamāpattito vuṭṭhānaṃ hoti. Taṃ sandhāya ca ‘‘tamhā tamhā samādhimhā vuṭṭhānampi vuṭṭhāna’’nti vuttaṃ. Idampi ñāṇaṃ ‘‘tattha katamaṃ tathāgatassa jhānavimokkhasamādhisamāpattīnaṃ saṃkilesaṃ vodānaṃ vuṭṭhānaṃ yathābhūtaṃ ñāṇaṃ? ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jhāyī"
      },
      "ti cattāro jhāyī, atthekacco jhāyī sampattiṃyeva samānaṃ vipattīti paccetī’’tiādinā (vibha. 828) nayena abhidhamme vitthāritameva. Sabbañāṇānaṃ ",
      " vitthārakathāya vinicchayo sammohavinodaniyā vibhaṅgaṭṭhakathāya vutto, pubbenivāsānussatidibbacakkhuñāṇakathā visuddhimagge vitthāritā, āsavakkhayakathā heṭṭhā vuttāyevāti."
    ],
    "innerText": "Jhānavimokkhasamādhisamāpattīnanti paṭhamādīnaṃ catunnaṃ jhānānaṃ, ‘‘rūpī rūpāni passatī’’tiādīnaṃ aṭṭhannaṃ vimokkhānaṃ, savitakkasavicārādīnaṃ tiṇṇaṃ samādhīnaṃ, paṭhamajjhānasamāpattiādīnañca navannaṃ anupubbasamāpattīnaṃ. Saṃkilesanti hānabhāgiyadhammaṃ. Vodānanti visesabhāgiyadhammaṃ. Vuṭṭhānanti ‘‘vodānampi vuṭṭhānaṃ, tamhā tamhā samādhimhā vuṭṭhānampi vuṭṭhāna’’nti (vibha. 828) evaṃ vuttaṃ paguṇajjhānañceva bhavaṅgaphalasamāpattiyo ca. Heṭṭhimaṃ heṭṭhimañhi paguṇajjhānaṃ uparimassa uparimassa padaṭṭhānaṃ hoti, tasmā ‘‘vodānampi vuṭṭhāna’’nti vuttaṃ. Bhavaṅgena pana sabbajjhānehi vuṭṭhānaṃ hoti, phalasamāpattiyā nirodhasamāpattito vuṭṭhānaṃ hoti. Taṃ sandhāya ca ‘‘tamhā tamhā samādhimhā vuṭṭhānampi vuṭṭhāna’’nti vuttaṃ. Idampi ñāṇaṃ ‘‘tattha katamaṃ tathāgatassa jhānavimokkhasamādhisamāpattīnaṃ saṃkilesaṃ vodānaṃ vuṭṭhānaṃ yathābhūtaṃ ñāṇaṃ? Jhāyīti cattāro jhāyī, atthekacco jhāyī sampattiṃyeva samānaṃ vipattīti paccetī’’tiādinā (vibha. 828) nayena abhidhamme vitthāritameva. Sabbañāṇānaṃ vitthārakathāya vinicchayo sammohavinodaniyā vibhaṅgaṭṭhakathāya vutto, pubbenivāsānussatidibbacakkhuñāṇakathā visuddhimagge vitthāritā, āsavakkhayakathā heṭṭhā vuttāyevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      " paravādīkathā hoti ‘‘dasabalañāṇaṃ nāma pāṭiyekkaṃ ñāṇaṃ natthi, sabbaññutaññāṇassevāyaṃ pabhedo’’ti. Taṃ na tathā daṭṭhabbaṃ. Aññameva hi dasabalañāṇaṃ, aññaṃ sabbaññutaññāṇaṃ. Dasabalañāṇañhi sakasakakiccameva jānāti, sabbaññutaññāṇaṃ tampi tato avasesampi jānāti. Dasabalañāṇesu hi paṭhamaṃ kāraṇākāraṇameva jānāti, dutiyaṃ kammavipākantarameva, tatiyaṃ kammaparicchedameva, catutthaṃ dhātunānattakāraṇameva, pañcamaṃ sattānaṃ ajjhāsayādhimuttimeva, chaṭṭhaṃ indriyānaṃ tikkhamudubhāvameva, sattamaṃ jhānādīhi saddhiṃ tesaṃ saṃkilesādimeva, aṭṭhamaṃ pubbenivutthakkhandhasantatimeva, navamaṃ sattānaṃ cutipaṭisandhimeva, dasamaṃ saccaparicchedameva. Sabbaññutaññāṇaṃ pana etehi jānitabbañca tato uttariñca pajānāti, etesaṃ pana kiccaṃ na sabbaṃ karoti. Tañhi jhānaṃ hutvā appetuṃ ",
      " na sakkoti, iddhi hutvā vikubbituṃ na sakkoti, maggo hutvā kilese khepetuṃ na sakkoti."
    ],
    "innerText": "Tattha paravādīkathā hoti ‘‘dasabalañāṇaṃ nāma pāṭiyekkaṃ ñāṇaṃ natthi, sabbaññutaññāṇassevāyaṃ pabhedo’’ti. Taṃ na tathā daṭṭhabbaṃ. Aññameva hi dasabalañāṇaṃ, aññaṃ sabbaññutaññāṇaṃ. Dasabalañāṇañhi sakasakakiccameva jānāti, sabbaññutaññāṇaṃ tampi tato avasesampi jānāti. Dasabalañāṇesu hi paṭhamaṃ kāraṇākāraṇameva jānāti, dutiyaṃ kammavipākantarameva, tatiyaṃ kammaparicchedameva, catutthaṃ dhātunānattakāraṇameva, pañcamaṃ sattānaṃ ajjhāsayādhimuttimeva, chaṭṭhaṃ indriyānaṃ tikkhamudubhāvameva, sattamaṃ jhānādīhi saddhiṃ tesaṃ saṃkilesādimeva, aṭṭhamaṃ pubbenivutthakkhandhasantatimeva, navamaṃ sattānaṃ cutipaṭisandhimeva, dasamaṃ saccaparicchedameva. Sabbaññutaññāṇaṃ pana etehi jānitabbañca tato uttariñca pajānāti, etesaṃ pana kiccaṃ na sabbaṃ karoti. Tañhi jhānaṃ hutvā appetuṃ na sakkoti, iddhi hutvā vikubbituṃ na sakkoti, maggo hutvā kilese khepetuṃ na sakkoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Apica paravādī evaṃ pucchitabbo ‘‘dasabalañāṇaṃ nāmetaṃ savitakkasavicāraṃ avitakkavicāramattaṃ avitakkaavicāraṃ, kāmāvacaraṃ rūpāvacaraṃ arūpāvacaraṃ, lokiyaṃ lokuttara’’nti. Jānanto ‘‘paṭipāṭiyā satta ñāṇāni savitakkasavicārānī’’ti vakkhati, ‘‘tato parāni dve avitakkaavicārānī’’ti vakkhati. ‘‘Āsavakkhayañāṇaṃ siyā savitakkasavicāraṃ siyā avitakkavicāramattaṃ, siyā avitakkaavicāra’’nti vakkhati ",
      ". Tathā ‘‘paṭipāṭiyā satta kāmāvacarāni, tato dve rūpāvacarāni, avasāne ekaṃ lokuttara’’nti vakkhati. ‘‘Sabbaññutaññāṇaṃ pana savitakkasavicārameva lokiyamevā’’ti vakkhati."
    ],
    "innerText": "Apica paravādī evaṃ pucchitabbo ‘‘dasabalañāṇaṃ nāmetaṃ savitakkasavicāraṃ avitakkavicāramattaṃ avitakkaavicāraṃ, kāmāvacaraṃ rūpāvacaraṃ arūpāvacaraṃ, lokiyaṃ lokuttara’’nti. Jānanto ‘‘paṭipāṭiyā satta ñāṇāni savitakkasavicārānī’’ti vakkhati, ‘‘tato parāni dve avitakkaavicārānī’’ti vakkhati. ‘‘Āsavakkhayañāṇaṃ siyā savitakkasavicāraṃ siyā avitakkavicāramattaṃ, siyā avitakkaavicāra’’nti vakkhati . Tathā ‘‘paṭipāṭiyā satta kāmāvacarāni, tato dve rūpāvacarāni, avasāne ekaṃ lokuttara’’nti vakkhati. ‘‘Sabbaññutaññāṇaṃ pana savitakkasavicārameva lokiyamevā’’ti vakkhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evamettha anupadavaṇṇanaṃ ñatvā idāni yasmā tathāgato paṭhamaṃyeva ṭhānāṭṭhānañāṇena veneyyasattānaṃ āsavakkhayādhigamassa ceva anadhigamassa ca ṭhānāṭṭhānabhūtaṃ kilesāvaraṇābhāvaṃ passati lokiyasammādiṭṭhiṭṭhānādidassanato niyatamicchādiṭṭhiṭṭhānābhāvadassanato ca. Atha nesaṃ kammavipākañāṇena vipākāvaraṇābhāvaṃ passati tihetukappaṭisandhidassanato, sabbatthagāminipaṭipadāñāṇena kammāvaraṇābhāvaṃ passati ānantariyakammābhāvadassanato. Evamanāvaraṇānaṃ anekadhātunānādhātuñāṇena anukūladhammadesanatthaṃ cariyāvisesaṃ passati dhātuvemattadassanato. Atha nesaṃ nānādhimuttikatañāṇena adhimuttiṃ passati payogaṃ anādiyitvāpi adhimuttivasena dhammadesanatthaṃ. Athevaṃ diṭṭhādhimuttīnaṃ yathāsatti yathābalaṃ dhammaṃ desetuṃ indriyaparopariyattiñāṇena indriyaparopariyattaṃ passati saddhādīnaṃ tikkhamudubhāvadassanato. Evaṃ pariññātindriyaparopariyattā ",
      " pana te sace dūre honti, atha jhānādiñāṇena jhānādīsu vasībhūtattā iddhivisesena te khippaṃ upagacchati. Upagantvā ca nesaṃ pubbenivāsānussatiñāṇena pubbajātibhavaṃ, dibbacakkhānubhāvato pattabbena cetopariyañāṇena sampati cittavisesaṃ ",
      " passanto āsavakkhayañāṇānubhāvena āsavakkhayagāminiyā paṭipadāya vigatasammohattā āsavakkhayāya dhammaṃ deseti. Tasmā iminānukkamena imāni balāni vuttānīti veditabbāni."
    ],
    "innerText": "Evamettha anupadavaṇṇanaṃ ñatvā idāni yasmā tathāgato paṭhamaṃyeva ṭhānāṭṭhānañāṇena veneyyasattānaṃ āsavakkhayādhigamassa ceva anadhigamassa ca ṭhānāṭṭhānabhūtaṃ kilesāvaraṇābhāvaṃ passati lokiyasammādiṭṭhiṭṭhānādidassanato niyatamicchādiṭṭhiṭṭhānābhāvadassanato ca. Atha nesaṃ kammavipākañāṇena vipākāvaraṇābhāvaṃ passati tihetukappaṭisandhidassanato, sabbatthagāminipaṭipadāñāṇena kammāvaraṇābhāvaṃ passati ānantariyakammābhāvadassanato. Evamanāvaraṇānaṃ anekadhātunānādhātuñāṇena anukūladhammadesanatthaṃ cariyāvisesaṃ passati dhātuvemattadassanato. Atha nesaṃ nānādhimuttikatañāṇena adhimuttiṃ passati payogaṃ anādiyitvāpi adhimuttivasena dhammadesanatthaṃ. Athevaṃ diṭṭhādhimuttīnaṃ yathāsatti yathābalaṃ dhammaṃ desetuṃ indriyaparopariyattiñāṇena indriyaparopariyattaṃ passati saddhādīnaṃ tikkhamudubhāvadassanato. Evaṃ pariññātindriyaparopariyattā pana te sace dūre honti, atha jhānādiñāṇena jhānādīsu vasībhūtattā iddhivisesena te khippaṃ upagacchati. Upagantvā ca nesaṃ pubbenivāsānussatiñāṇena pubbajātibhavaṃ, dibbacakkhānubhāvato pattabbena cetopariyañāṇena sampati cittavisesaṃ passanto āsavakkhayañāṇānubhāvena āsavakkhayagāminiyā paṭipadāya vigatasammohattā āsavakkhayāya dhammaṃ deseti. Tasmā iminānukkamena imāni balāni vuttānīti veditabbāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Adhivuttipadasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "22"
      },
      ". Dutiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ye te dhammā"
      },
      "ti ye te dasabalañāṇaṃ sabbaññutaññāṇadhammā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adhivuttipadāna"
      },
      "nti adhivacanapadānaṃ, khandhāyatanadhātudhammānanti attho. Adhivuttiyoti hi adhivacanāni vuccanti, tesaṃ ye padabhūtā desanāya padaṭṭhānattā. Atītā buddhāpi hi ete dhamme kathayiṃsu, anāgatāpi eteva kathayissanti. Tasmā khandhādayo adhivuttipadāni nāma. Tesaṃ adhivuttipadānaṃ. Atha vā bhūtamatthaṃ abhibhavitvā yathāsabhāvato aggahetvā vattanato adhivuttiyoti diṭṭhiyo vuccanti, adhivuttīnaṃ padāni adhivuttipadāni, diṭṭhidīpakāni vacanānīti attho. Tesaṃ adhivuttipadānaṃ diṭṭhivohārānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhiññā sacchikiriyāyā"
      },
      "ti jānitvā paccakkhakaraṇatthāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Visārado"
      },
      "ti ñāṇasomanassappatto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatthā"
      },
      "ti tesu dhammesu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tesaṃ tesaṃ tathā tathā dhammaṃ desetu"
      },
      "nti tesaṃ tesaṃ diṭṭhigatikānaṃ vā itaresaṃ vā āsayaṃ ñatvā tathā tathā dhammaṃ desetuṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hīnaṃ vā hīnanti ñassatī"
      },
      "ti hīnaṃ vā dhammaṃ ‘‘hīno dhammo’’ti jānissati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñāteyya"
      },
      "nti ñātabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Daṭṭheyya"
      },
      "nti daṭṭhabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sacchikareyya"
      },
      "nti sacchikātabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tattha"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tattha yathābhūtañāṇa"
      },
      "nti tesu tesu dhammesu yathāsabhāvañāṇaṃ. Iminā sabbaññutaññāṇaṃ dasseti. Evaṃ sabbaññutaññāṇaṃ dassetvā puna dasabalañāṇaṃ dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dasayimānī"
      },
      "tiādimāha. Dasabalañāṇampi hi tattha tattha yathābhūtañāṇamevāti."
    ],
    "innerText": "22. Dutiye ye te dhammāti ye te dasabalañāṇaṃ sabbaññutaññāṇadhammā. Adhivuttipadānanti adhivacanapadānaṃ, khandhāyatanadhātudhammānanti attho. Adhivuttiyoti hi adhivacanāni vuccanti, tesaṃ ye padabhūtā desanāya padaṭṭhānattā. Atītā buddhāpi hi ete dhamme kathayiṃsu, anāgatāpi eteva kathayissanti. Tasmā khandhādayo adhivuttipadāni nāma. Tesaṃ adhivuttipadānaṃ. Atha vā bhūtamatthaṃ abhibhavitvā yathāsabhāvato aggahetvā vattanato adhivuttiyoti diṭṭhiyo vuccanti, adhivuttīnaṃ padāni adhivuttipadāni, diṭṭhidīpakāni vacanānīti attho. Tesaṃ adhivuttipadānaṃ diṭṭhivohārānaṃ. Abhiññā sacchikiriyāyāti jānitvā paccakkhakaraṇatthāya. Visāradoti ñāṇasomanassappatto. Tatthāti tesu dhammesu tesaṃ tesaṃ tathā tathā dhammaṃ desetunti tesaṃ tesaṃ diṭṭhigatikānaṃ vā itaresaṃ vā āsayaṃ ñatvā tathā tathā dhammaṃ desetuṃ. Hīnaṃ vā hīnanti ñassatīti hīnaṃ vā dhammaṃ ‘‘hīno dhammo’’ti jānissati. Ñāteyyanti ñātabbaṃ. Daṭṭheyyanti daṭṭhabbaṃ. Sacchikareyyanti sacchikātabbaṃ. Tatthatattha yathābhūtañāṇanti tesu tesu dhammesu yathāsabhāvañāṇaṃ. Iminā sabbaññutaññāṇaṃ dasseti. Evaṃ sabbaññutaññāṇaṃ dassetvā puna dasabalañāṇaṃ dassento dasayimānītiādimāha. Dasabalañāṇampi hi tattha tattha yathābhūtañāṇamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Kāyasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "23"
      },
      ". Tatiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āpanno hoti kañcideva desa"
      },
      "nti kañci āpattikoṭṭhāsaṃ āpanno hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anuviccā"
      },
      "ti anupavisitvā pariyogāhetvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāyaduccarita"
      },
      "nti tividhaṃ kāyaduccaritaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vacīduccarita"
      },
      "nti ",
      " catubbidhaṃ vacīduccaritaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāpikā issā"
      },
      "ti lāmikā usūyā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññāya disvā"
      },
      "ti sahavipassanāya maggapaññāya passitvā passitvā pahātabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ijjhatī"
      },
      "ti samijjhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upavāsassā"
      },
      "ti nissāya upasaṅkamitvā vasantassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhibhuyyā"
      },
      "ti ajjhottharitvā ",
      " madditvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Irīyatī"
      },
      "ti vattati. Imasmiṃ sutte sahavipassanāya maggo kathito."
    ],
    "innerText": "23. Tatiye āpanno hoti kañcideva desanti kañci āpattikoṭṭhāsaṃ āpanno hoti. Anuviccāti anupavisitvā pariyogāhetvā. Kāyaduccaritanti tividhaṃ kāyaduccaritaṃ. Vacīduccaritanti catubbidhaṃ vacīduccaritaṃ. Pāpikā issāti lāmikā usūyā. Paññāya disvāti sahavipassanāya maggapaññāya passitvā passitvā pahātabbā. Ijjhatīti samijjhati. Upavāsassāti nissāya upasaṅkamitvā vasantassa. Abhibhuyyāti ajjhottharitvā madditvā. Irīyatīti vattati. Imasmiṃ sutte sahavipassanāya maggo kathito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Mahācundasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "24"
      },
      ". Catutthe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jānāmimaṃ dhamma"
      },
      "nti iminā ñāṇavādassa vadanākāro vutto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhāvitakāyomhī"
      },
      "tiādīhi bhāvanāvādassa. Tatiyavāre dvepi vādā ekato vuttā, tayopi cete arahattameva paṭijānanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aḍḍhavādaṃ vadeyyā"
      },
      "ti aḍḍhohamasmīti vādaṃ vadeyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upanīhātu"
      },
      "nti nīharitvā dātuṃ."
    ],
    "innerText": "24. Catutthe jānāmimaṃ dhammanti iminā ñāṇavādassa vadanākāro vutto. Bhāvitakāyomhītiādīhi bhāvanāvādassa. Tatiyavāre dvepi vādā ekato vuttā, tayopi cete arahattameva paṭijānanti. Aḍḍhavādaṃ vadeyyāti aḍḍhohamasmīti vādaṃ vadeyya. Upanīhātunti nīharitvā dātuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Kasiṇasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "25"
      },
      ". Pañcame sakalaṭṭhena kasiṇāni, tadārammaṇānaṃ dhammānaṃ khettaṭṭhena adhiṭṭhānaṭṭhena vā āyatanānīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kasiṇāyatanāni. Uddha"
      },
      "nti ",
      " upari gagaṇatalābhimukhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adho"
      },
      "ti heṭṭhā bhūmitalābhimukhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tiriya"
      },
      "nti khettamaṇḍalaṃ viya samantā paricchinditvā. Ekacco hi uddhameva kasiṇaṃ vaḍḍheti, ekacco adho, ekacco samantato. Tena tena vā kāraṇena evaṃ pasāreti ālokamiva rūpadassanakāmo. Tena vuttaṃ – ‘‘pathavīkasiṇameko sañjānāti uddhaṃ adho tiriya’’nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Advaya"
      },
      "nti idaṃ pana ekassa aññabhāvānupagamanatthaṃ vuttaṃ. Yathā hi udakaṃ paviṭṭhassa sabbadisāsu udakameva hoti na aññaṃ, evameva pathavīkasiṇaṃ pathavīkasiṇameva hoti. Natthi tassa aññakasiṇasambhedoti. Eseva nayo sabbattha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appamāṇa"
      },
      "nti idaṃ tassa tassa pharaṇaappamāṇavasena vuttaṃ. Tañhi cetasā pharanto sakalameva pharati, ‘‘ayamassa ādi, idaṃ majjha’’nti pamāṇaṃ na gaṇhāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Viññāṇakasiṇa"
      },
      "nti cettha kasiṇugghāṭimākāse pavattaviññāṇaṃ. Tattha kasiṇavasena kasiṇugghāṭimākāse, kasiṇugghāṭimākāsavasena tattha pavattaviññāṇe uddhaṃadhotiriyatā veditabbā. Ayamettha saṅkhepo, kammaṭṭhānabhāvanānayena panetāni pathavīkasiṇādīni vitthārato visuddhimagge (visuddhi. 1.51 ādayo) vuttāneva."
    ],
    "innerText": "25. Pañcame sakalaṭṭhena kasiṇāni, tadārammaṇānaṃ dhammānaṃ khettaṭṭhena adhiṭṭhānaṭṭhena vā āyatanānīti kasiṇāyatanāni. Uddhanti upari gagaṇatalābhimukhaṃ. Adhoti heṭṭhā bhūmitalābhimukhaṃ. Tiriyanti khettamaṇḍalaṃ viya samantā paricchinditvā. Ekacco hi uddhameva kasiṇaṃ vaḍḍheti, ekacco adho, ekacco samantato. Tena tena vā kāraṇena evaṃ pasāreti ālokamiva rūpadassanakāmo. Tena vuttaṃ – ‘‘pathavīkasiṇameko sañjānāti uddhaṃ adho tiriya’’nti. Advayanti idaṃ pana ekassa aññabhāvānupagamanatthaṃ vuttaṃ. Yathā hi udakaṃ paviṭṭhassa sabbadisāsu udakameva hoti na aññaṃ, evameva pathavīkasiṇaṃ pathavīkasiṇameva hoti. Natthi tassa aññakasiṇasambhedoti. Eseva nayo sabbattha. Appamāṇanti idaṃ tassa tassa pharaṇaappamāṇavasena vuttaṃ. Tañhi cetasā pharanto sakalameva pharati, ‘‘ayamassa ādi, idaṃ majjha’’nti pamāṇaṃ na gaṇhāti. Viññāṇakasiṇanti cettha kasiṇugghāṭimākāse pavattaviññāṇaṃ. Tattha kasiṇavasena kasiṇugghāṭimākāse, kasiṇugghāṭimākāsavasena tattha pavattaviññāṇe uddhaṃadhotiriyatā veditabbā. Ayamettha saṅkhepo, kammaṭṭhānabhāvanānayena panetāni pathavīkasiṇādīni vitthārato visuddhimagge (visuddhi. 1.51 ādayo) vuttāneva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Kāḷīsuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "26"
      },
      ". Chaṭṭhe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kumāripañhesū"
      },
      "ti kumārīnaṃ māradhītānaṃ pucchāsu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atthassa"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pattiṃ hadayassa santi"
      },
      "nti dvīhipi padehi arahattameva kathitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sena"
      },
      "nti rāgādikilesasenaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Piyasātarūpa"
      },
      "nti piyajātikesu ca sātajātikesu ca vatthūsu uppajjanato evaṃladdhanāmaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekohaṃ jhāyaṃ sukhamanubodhi"
      },
      "nti evaṃ kilesasenaṃ jinitvā ahaṃ ekakova jhāyanto sukhaṃ anubujjhiṃ sacchiakāsiṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sakkhi"
      },
      "nti sakkhibhāvappattaṃ dhammasakkhiṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na sampajjati kenaci me"
      },
      "ti mayhaṃ kenaci saddhiṃ mittadhammo nāma natthi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pathavīkasiṇasamāpattiparamā kho, bhagini, eke samaṇabrāhmaṇā atthoti abhinibbattesu"
      },
      "nti pathavīkasiṇasamāpattiparamo uttamo atthoti gahetvā abhinibbattesuṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yāvatā kho, bhagini, pathavīkasiṇasamāpattiparamatā"
      },
      "ti yattakā pathavīkasiṇasamāpattiyā uttamakoṭi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tadabhiññāsi bhagavā"
      },
      "ti taṃ bhagavā abhiññāpaññāya abhiññāsi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Assādamaddasā"
      },
      "ti samudayasaccaṃ addasa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ādīnavamaddasā"
      },
      "ti dukkhasaccaṃ addasa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nissaraṇamaddasā"
      },
      "ti nirodhasaccaṃ addasa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Maggāmaggañāṇadassanamaddasā"
      },
      "ti maggasaccaṃ addasa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atthassa pattī"
      },
      "ti etesaṃ catunnaṃ saccānaṃ diṭṭhattā arahattasaṅkhātassa atthassa patti, sabbadarathapariḷāhavūpasantatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hadayassa santī"
      },
      "ti."
    ],
    "innerText": "26. Chaṭṭhe kumāripañhesūti kumārīnaṃ māradhītānaṃ pucchāsu. Atthassapattiṃ hadayassa santinti dvīhipi padehi arahattameva kathitaṃ. Senanti rāgādikilesasenaṃ. Piyasātarūpanti piyajātikesu ca sātajātikesu ca vatthūsu uppajjanato evaṃladdhanāmaṃ. Ekohaṃ jhāyaṃ sukhamanubodhinti evaṃ kilesasenaṃ jinitvā ahaṃ ekakova jhāyanto sukhaṃ anubujjhiṃ sacchiakāsiṃ. Sakkhinti sakkhibhāvappattaṃ dhammasakkhiṃ. Na sampajjati kenaci meti mayhaṃ kenaci saddhiṃ mittadhammo nāma natthi. Pathavīkasiṇasamāpattiparamā kho, bhagini, eke samaṇabrāhmaṇā atthoti abhinibbattesunti pathavīkasiṇasamāpattiparamo uttamo atthoti gahetvā abhinibbattesuṃ. Yāvatā kho, bhagini, pathavīkasiṇasamāpattiparamatāti yattakā pathavīkasiṇasamāpattiyā uttamakoṭi. Tadabhiññāsi bhagavāti taṃ bhagavā abhiññāpaññāya abhiññāsi. Assādamaddasāti samudayasaccaṃ addasa. Ādīnavamaddasāti dukkhasaccaṃ addasa. Nissaraṇamaddasāti nirodhasaccaṃ addasa. Maggāmaggañāṇadassanamaddasāti maggasaccaṃ addasa. Atthassa pattīti etesaṃ catunnaṃ saccānaṃ diṭṭhattā arahattasaṅkhātassa atthassa patti, sabbadarathapariḷāhavūpasantatāya hadayassa santīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Paṭhamamahāpañhasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "27"
      },
      ". Sattame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhijānāthā"
      },
      "ti abhijānitvā paccakkhaṃ katvā viharatha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhiññāyā"
      },
      "ti ",
      " abhijānitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idhā"
      },
      "ti imāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammadesanāya vā dhammadesana"
      },
      "nti yadidaṃ samaṇassa gotamassa dhammadesanāya saddhiṃ amhākaṃ dhammadesanaṃ, amhākaṃ vā dhammadesanāya saddhiṃ samaṇassa gotamassa dhammadesanaṃ ārabbha nānākaraṇaṃ vuccetha, taṃ kiṃ nāmāti vadanti. Dutiyapadepi eseva nayo. Iti te majjhe bhinnasuvaṇṇaṃ viya sāsanena saddhiṃ attano laddhiṃ vacanamattena samadhuraṃ ṭhapayiṃsu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Neva abhinandiṃsū"
      },
      "ti ‘‘evameta’’nti na sampaṭicchiṃsu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nappaṭikkosiṃsū"
      },
      "ti ‘‘na idaṃ eva’’nti nappaṭisedhesuṃ. Kasmā? Te kira ‘‘titthiyā nāma andhasadisā jānitvā vā ajānitvā vā katheyyu’’nti nābhinandiṃsu."
    ],
    "innerText": "27. Sattame abhijānāthāti abhijānitvā paccakkhaṃ katvā viharatha. Abhiññāyāti abhijānitvā. Idhāti imāya. Dhammadesanāya vā dhammadesananti yadidaṃ samaṇassa gotamassa dhammadesanāya saddhiṃ amhākaṃ dhammadesanaṃ, amhākaṃ vā dhammadesanāya saddhiṃ samaṇassa gotamassa dhammadesanaṃ ārabbha nānākaraṇaṃ vuccetha, taṃ kiṃ nāmāti vadanti. Dutiyapadepi eseva nayo. Iti te majjhe bhinnasuvaṇṇaṃ viya sāsanena saddhiṃ attano laddhiṃ vacanamattena samadhuraṃ ṭhapayiṃsu. Neva abhinandiṃsūti ‘‘evameta’’nti na sampaṭicchiṃsu. Nappaṭikkosiṃsūti ‘‘na idaṃ eva’’nti nappaṭisedhesuṃ. Kasmā? Te kira ‘‘titthiyā nāma andhasadisā jānitvā vā ajānitvā vā katheyyu’’nti nābhinandiṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sampāyissantī"
      },
      "ti sampādetvā kathetuṃ na sakkhissanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uttari ca vighāta"
      },
      "nti asampādanato ",
      " uttarimpi dukkhaṃ āpajjissanti. Sampādetvā kathetuṃ asakkontānañhi dukkhaṃ uppajjati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathā taṃ, bhikkhave, avisayasmi"
      },
      "nti ettha ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ta"
      },
      "nti nipātamattaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathā"
      },
      "ti kāraṇavacanaṃ, yasmā avisaye pañhaṃ pucchitā hontīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ito vā pana sutvā"
      },
      "ti ito vā pana mama sāsanato sutvā. Itoti tathāgatatopi tathāgatasāvakatopi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ārādheyyā"
      },
      "ti paritoseyya, aññathā ārādhanaṃ nāma natthīti dasseti."
    ],
    "innerText": "Nasampāyissantīti sampādetvā kathetuṃ na sakkhissanti. Uttari ca vighātanti asampādanato uttarimpi dukkhaṃ āpajjissanti. Sampādetvā kathetuṃ asakkontānañhi dukkhaṃ uppajjati. Yathā taṃ, bhikkhave, avisayasminti ettha ca tanti nipātamattaṃ. Yathāti kāraṇavacanaṃ, yasmā avisaye pañhaṃ pucchitā hontīti attho. Ito vā pana sutvāti ito vā pana mama sāsanato sutvā. Itoti tathāgatatopi tathāgatasāvakatopi. Ārādheyyāti paritoseyya, aññathā ārādhanaṃ nāma natthīti dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekadhamme"
      },
      "ti ",
      " ekasmiṃ dhamme. Iminā uddeso dassito. Parato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "katamasmiṃ ekadhamme"
      },
      "ti iminā pañho dassito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbe sattā āhāraṭṭhitikā"
      },
      "ti idaṃ panettha veyyākaraṇaṃ. Sesesupi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammā nibbindamāno"
      },
      "tiādīsu pana sammā hetunā nayena nibbidānupassanāya nibbindanto ukkaṇṭhanto, virāgānupassanāya virajjanto, paṭisaṅkhānupassanāya muccanassa upāyaṃ katvā vimuccamāno, adhimokkhavasena vā vimuccamāno sanniṭṭhānaṃ kurumānoti attho. Udayabbayehi paricchinditvā pubbantāparantadassanena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammā pariyantadassāvī. Sammadatthaṃ abhisameccā"
      },
      "ti sammā sabhāgatthaṃ ñāṇena abhisamāgantvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dukkhassantakaro hotī"
      },
      "ti sakalavaṭṭadukkhassa pariyantaṃ parivaṭumaṃ karo hoti."
    ],
    "innerText": "Ekadhammeti ekasmiṃ dhamme. Iminā uddeso dassito. Parato katamasmiṃ ekadhammeti iminā pañho dassito. Sabbe sattā āhāraṭṭhitikāti idaṃ panettha veyyākaraṇaṃ. Sesesupi eseva nayo. Sammā nibbindamānotiādīsu pana sammā hetunā nayena nibbidānupassanāya nibbindanto ukkaṇṭhanto, virāgānupassanāya virajjanto, paṭisaṅkhānupassanāya muccanassa upāyaṃ katvā vimuccamāno, adhimokkhavasena vā vimuccamāno sanniṭṭhānaṃ kurumānoti attho. Udayabbayehi paricchinditvā pubbantāparantadassanena sammā pariyantadassāvī. Sammadatthaṃ abhisameccāti sammā sabhāgatthaṃ ñāṇena abhisamāgantvā. Dukkhassantakaro hotīti sakalavaṭṭadukkhassa pariyantaṃ parivaṭumaṃ karo hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbe sattā"
      },
      "ti kāmabhavādīsu ekavokārabhavādīsu ca sabbabhavesu sabbe sattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āhāraṭṭhitikā"
      },
      "ti āhārato ṭhiti etesanti āhāraṭṭhitikā. Iti sabbasattānampi ṭhitihetu āhāro nāma eko dhammo, tasmiṃ ekadhamme. Nanu ca evaṃ sante yaṃ vuttaṃ – ‘‘asaññasattā devā ahetukā anāhārā aphassakā’’tiādi (vibha. 1017), taṃ virujjhatīti. Na virujjhati. Tesañhi jhānaṃ āhāro hoti. Evaṃ santepi ‘‘cattārome, bhikkhave, āhārā’’ti (saṃ. ni. 2.11) idaṃ virujjhatīti. Idampi na virujjhati. Etasmiñhi sutte nippariyāyena āhāralakkhaṇā dhammā āhārāti vuttā, idha pana pariyāyena paccayo ",
      " āhāroti vutto. Sabbadhammānañhi paccayo laddhuṃ vaṭṭati. So ca yaṃ yaṃ phalaṃ janeti, taṃ taṃ āharati nāma. Tasmā āhāroti vuccati. Tenevāha – ‘‘avijjampāhaṃ, bhikkhave, sāhāraṃ vadāmi, no anāhāraṃ. Ko ",
      " ca, bhikkhave, avijjāya āhāro? Pañca nīvaraṇātissa vacanīya’’nti (a. ni. 10.61). Ayaṃ idha adhippeto. Etasmiñhi paccayāhāre gahite pariyāyāhāropi nippariyāyāhāropi sabbo gahitova hoti."
    ],
    "innerText": "Sabbe sattāti kāmabhavādīsu ekavokārabhavādīsu ca sabbabhavesu sabbe sattā. Āhāraṭṭhitikāti āhārato ṭhiti etesanti āhāraṭṭhitikā. Iti sabbasattānampi ṭhitihetu āhāro nāma eko dhammo, tasmiṃ ekadhamme. Nanu ca evaṃ sante yaṃ vuttaṃ – ‘‘asaññasattā devā ahetukā anāhārā aphassakā’’tiādi (vibha. 1017), taṃ virujjhatīti. Na virujjhati. Tesañhi jhānaṃ āhāro hoti. Evaṃ santepi ‘‘cattārome, bhikkhave, āhārā’’ti (saṃ. ni. 2.11) idaṃ virujjhatīti. Idampi na virujjhati. Etasmiñhi sutte nippariyāyena āhāralakkhaṇā dhammā āhārāti vuttā, idha pana pariyāyena paccayo āhāroti vutto. Sabbadhammānañhi paccayo laddhuṃ vaṭṭati. So ca yaṃ yaṃ phalaṃ janeti, taṃ taṃ āharati nāma. Tasmā āhāroti vuccati. Tenevāha – ‘‘avijjampāhaṃ, bhikkhave, sāhāraṃ vadāmi, no anāhāraṃ. Ko ca, bhikkhave, avijjāya āhāro? Pañca nīvaraṇātissa vacanīya’’nti (a. ni. 10.61). Ayaṃ idha adhippeto. Etasmiñhi paccayāhāre gahite pariyāyāhāropi nippariyāyāhāropi sabbo gahitova hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      " asaññībhave paccayāhāro labbhati. Anuppanne hi buddhe titthāyatane pabbajitā vāyokasiṇe parikammaṃ katvā catutthajjhānaṃ nibbattetvā tato vuṭṭhāya ‘‘dhi cittaṃ, dhi vatetaṃ cittaṃ, cittassa nāma abhāvoyeva sādhu. Cittañhi nissāya vadhabandhādipaccayaṃ dukkhaṃ uppajjati. Citte asati nattheta’’nti khantiṃ ruciṃ uppādetvā aparihīnajjhānā kālaṃ katvā asaññībhave nibbattanti. Yo yassa iriyāpatho manussaloke paṇihito ahosi, so tena iriyāpathena nibbattitvā cittarūpasadiso hutvā pañca kappasatāni tiṭṭhati. Ettakaṃ addhānaṃ sayito viya hoti. Evarūpānampi sattānaṃ paccayāhāro labbhati. Te hi yaṃ jhānaṃ bhāvetvā nibbattā, tadeva nesaṃ paccayo hoti. Yathā jiyāvegena khittasaro yāva jiyāvego atthi, tāva gacchati. Evaṃ yāva jhānapaccayo atthi, tāva tiṭṭhanti. Tasmiṃ niṭṭhite khīṇavego viya saro patanti. Cavanakāle ca tesaṃ so rūpakāyo antaradhāyati, kāmāvacarasaññā uppajjati, tena saññuppādena te devā tamhā kāyā cutāti paññāyanti."
    ],
    "innerText": "Tattha asaññībhave paccayāhāro labbhati. Anuppanne hi buddhe titthāyatane pabbajitā vāyokasiṇe parikammaṃ katvā catutthajjhānaṃ nibbattetvā tato vuṭṭhāya ‘‘dhi cittaṃ, dhi vatetaṃ cittaṃ, cittassa nāma abhāvoyeva sādhu. Cittañhi nissāya vadhabandhādipaccayaṃ dukkhaṃ uppajjati. Citte asati nattheta’’nti khantiṃ ruciṃ uppādetvā aparihīnajjhānā kālaṃ katvā asaññībhave nibbattanti. Yo yassa iriyāpatho manussaloke paṇihito ahosi, so tena iriyāpathena nibbattitvā cittarūpasadiso hutvā pañca kappasatāni tiṭṭhati. Ettakaṃ addhānaṃ sayito viya hoti. Evarūpānampi sattānaṃ paccayāhāro labbhati. Te hi yaṃ jhānaṃ bhāvetvā nibbattā, tadeva nesaṃ paccayo hoti. Yathā jiyāvegena khittasaro yāva jiyāvego atthi, tāva gacchati. Evaṃ yāva jhānapaccayo atthi, tāva tiṭṭhanti. Tasmiṃ niṭṭhite khīṇavego viya saro patanti. Cavanakāle ca tesaṃ so rūpakāyo antaradhāyati, kāmāvacarasaññā uppajjati, tena saññuppādena te devā tamhā kāyā cutāti paññāyanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ye pana te nerayikā neva vuṭṭhānaphalūpajīvī, na puññaphalūpajīvīti vuttā, tesaṃ ko āhāroti? Tesaṃ kammameva āhāro ",
      ". Kiṃ pañca āhārā atthīti? Pañca, na pañcāti idaṃ na vattabbaṃ, nanu ‘‘paccayo āhāro’’ti vuttametaṃ. Tasmā yena kammena niraye nibbattanti, tadeva tesaṃ ṭhitipaccayattā āhāro hoti. Yaṃ sandhāya idaṃ vuttaṃ – ‘‘na ca tāva kālaṃ karoti, yāva na taṃ pāpakammaṃ byantī hotī’’ti (ma. ni. 3.250, 268; a. ni. 3.36)."
    ],
    "innerText": "Ye pana te nerayikā neva vuṭṭhānaphalūpajīvī, na puññaphalūpajīvīti vuttā, tesaṃ ko āhāroti? Tesaṃ kammameva āhāro . Kiṃ pañca āhārā atthīti? Pañca, na pañcāti idaṃ na vattabbaṃ, nanu ‘‘paccayo āhāro’’ti vuttametaṃ. Tasmā yena kammena niraye nibbattanti, tadeva tesaṃ ṭhitipaccayattā āhāro hoti. Yaṃ sandhāya idaṃ vuttaṃ – ‘‘na ca tāva kālaṃ karoti, yāva na taṃ pāpakammaṃ byantī hotī’’ti (ma. ni. 3.250, 268; a. ni. 3.36)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kabaḷīkārāhāraṃ ārabbhāpi cettha vivādo na kātabbo. Mukhe uppajjanakheḷopi hi tesaṃ āhārakiccaṃ sādheti. Kheḷo hi niraye dukkhavedanīyo hutvā paccayo hoti, sagge sukhavedaniyo. Iti kāmabhave nippariyāyena cattāro āhārā, rūpārūpabhavesu ṭhapetvā asaññe ",
      " sesānaṃ tayo, asaññānañceva avasesānañca paccayāhāroti iminā ākārena sabbe sattā āhāraṭṭhitikāti veditabbā. Tattha cattāro āhāro yo vā pana koci paccayāhāro dukkhasaccaṃ, āhārasamuṭṭhāpikā purimataṇhā samudayasaccaṃ, ubhinnaṃ appavatti nirodhasaccaṃ, nirodhappajānanā paññā maggasaccanti evaṃ catusaccavasena sabbavāresu yojanā kātabbā."
    ],
    "innerText": "Kabaḷīkārāhāraṃ ārabbhāpi cettha vivādo na kātabbo. Mukhe uppajjanakheḷopi hi tesaṃ āhārakiccaṃ sādheti. Kheḷo hi niraye dukkhavedanīyo hutvā paccayo hoti, sagge sukhavedaniyo. Iti kāmabhave nippariyāyena cattāro āhārā, rūpārūpabhavesu ṭhapetvā asaññe sesānaṃ tayo, asaññānañceva avasesānañca paccayāhāroti iminā ākārena sabbe sattā āhāraṭṭhitikāti veditabbā. Tattha cattāro āhāro yo vā pana koci paccayāhāro dukkhasaccaṃ, āhārasamuṭṭhāpikā purimataṇhā samudayasaccaṃ, ubhinnaṃ appavatti nirodhasaccaṃ, nirodhappajānanā paññā maggasaccanti evaṃ catusaccavasena sabbavāresu yojanā kātabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Dutiyamahāpañhasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "28"
      },
      ". Aṭṭhame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kajaṅgalāya"
      },
      "nti evaṃnāmake nagare. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kajaṅgalā"
      },
      "ti kajaṅgalāvāsino. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahāpañhesū"
      },
      "ti mahantaatthapariggāhakesu pañhesu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathā mettha khāyatī"
      },
      "ti yathā me ettha upaṭṭhāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammā subhāvitacitto"
      },
      "ti hetunā nayena suṭṭhu bhāvitacitto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Eso ceva tassa attho"
      },
      "ti kiñcāpi bhagavatā ‘‘cattāro dhammā’’tiādayo pañhā ‘‘cattāro āhārā’’tiādinā nayena vissajjitā, yasmā pana catūsu āhāresu pariññātesu cattāro satipaṭṭhānā bhāvitā honti, tesu ca bhāvitesu cattāro āhārā pariññātāva honti. Tasmā desanāvilāsena byañjanamevettha nānaṃ, attho pana ekoyeva. Indriyādīsupi eseva nayo. Tena vuttaṃ – ‘‘eso ",
      " ceva tassa attho’’ti. Atthato hi ubhayampetaṃ majjhe bhinnasuvaṇṇamiva hoti."
    ],
    "innerText": "28. Aṭṭhame kajaṅgalāyanti evaṃnāmake nagare. Kajaṅgalāti kajaṅgalāvāsino. Mahāpañhesūti mahantaatthapariggāhakesu pañhesu. Yathā mettha khāyatīti yathā me ettha upaṭṭhāti. Sammā subhāvitacittoti hetunā nayena suṭṭhu bhāvitacitto. Eso ceva tassa atthoti kiñcāpi bhagavatā ‘‘cattāro dhammā’’tiādayo pañhā ‘‘cattāro āhārā’’tiādinā nayena vissajjitā, yasmā pana catūsu āhāresu pariññātesu cattāro satipaṭṭhānā bhāvitā honti, tesu ca bhāvitesu cattāro āhārā pariññātāva honti. Tasmā desanāvilāsena byañjanamevettha nānaṃ, attho pana ekoyeva. Indriyādīsupi eseva nayo. Tena vuttaṃ – ‘‘eso ceva tassa attho’’ti. Atthato hi ubhayampetaṃ majjhe bhinnasuvaṇṇamiva hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Paṭhamakosalasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "29"
      },
      ". Navame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yāvatā"
      },
      "ti yattakā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāsikosalā"
      },
      "ti kāsikosalajanapadā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attheva aññathatta"
      },
      "nti ṭhitassa aññathattaṃ atthiyeva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atthi vipariṇāmo"
      },
      "ti maraṇampi atthiyeva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasmimpi nibbindatī"
      },
      "ti tasmimpi sampattijāte ukkaṇṭhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Agge virajjatī"
      },
      "ti sampattiyā agge kosalarājabhāve virajjati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pageva hīnasmi"
      },
      "nti paṭhamataraṃyeva hīne ittaramanussānaṃ pañca kāmaguṇajāte."
    ],
    "innerText": "29. Navame yāvatāti yattakā. Kāsikosalāti kāsikosalajanapadā. Attheva aññathattanti ṭhitassa aññathattaṃ atthiyeva. Atthi vipariṇāmoti maraṇampi atthiyeva. Tasmimpi nibbindatīti tasmimpi sampattijāte ukkaṇṭhati. Agge virajjatīti sampattiyā agge kosalarājabhāve virajjati. Pageva hīnasminti paṭhamataraṃyeva hīne ittaramanussānaṃ pañca kāmaguṇajāte."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Manomayā"
      },
      "ti jhānamanena nibbattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bārāṇaseyyaka"
      },
      "nti bārāṇasiyaṃ uppannaṃ. Tattha kira kappāsopi mudu, suttakantikāyopi tantavāyāpi chekā, udakampi suci siniddhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ubhatobhāgavimaṭṭha"
      },
      "nti dvīsupi passesu maṭṭhaṃ mudu ",
      " siniddhaṃ khāyati. Catasso paṭipadā lokiyalokuttaramissikā kathitā. Saññāsu paṭhamā kāmāvacarasaññā, dutiyā rūpāvacarasaññā, tatiyā lokuttarasaññā, catutthā ākiñcaññāyatanasaññā. Yasmā pana sā saññā aggāti āgatā, tato paraṃ saññāpaññatti nāma natthi, tasmā agganti vuttā."
    ],
    "innerText": "Manomayāti jhānamanena nibbattā. Bārāṇaseyyakanti bārāṇasiyaṃ uppannaṃ. Tattha kira kappāsopi mudu, suttakantikāyopi tantavāyāpi chekā, udakampi suci siniddhaṃ. Ubhatobhāgavimaṭṭhanti dvīsupi passesu maṭṭhaṃ mudu siniddhaṃ khāyati. Catasso paṭipadā lokiyalokuttaramissikā kathitā. Saññāsu paṭhamā kāmāvacarasaññā, dutiyā rūpāvacarasaññā, tatiyā lokuttarasaññā, catutthā ākiñcaññāyatanasaññā. Yasmā pana sā saññā aggāti āgatā, tato paraṃ saññāpaññatti nāma natthi, tasmā agganti vuttā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bāhirakāna"
      },
      "nti sāsanato bahiddhā pavattānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "No"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cassaṃ no ca me siyā"
      },
      "ti sace ahaṃ atīte na bhavissaṃ, etarahipi me ayaṃ attabhāvo na siyā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na bhavissāmi na me bhavissatī"
      },
      "ti ",
      " sacepi anāgate na bhavissāmi, na ca me kiñci palibodhajātaṃ bhavissati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Agge virajjatī"
      },
      "ti ucchedadiṭṭhiyaṃ virajjati. Ucchedadiṭṭhi hi idha nibbānassa santatāya agganti jātā."
    ],
    "innerText": "Bāhirakānanti sāsanato bahiddhā pavattānaṃ. Nocassaṃ no ca me siyāti sace ahaṃ atīte na bhavissaṃ, etarahipi me ayaṃ attabhāvo na siyā. Na bhavissāmi na me bhavissatīti sacepi anāgate na bhavissāmi, na ca me kiñci palibodhajātaṃ bhavissati. Agge virajjatīti ucchedadiṭṭhiyaṃ virajjati. Ucchedadiṭṭhi hi idha nibbānassa santatāya agganti jātā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paramatthavisuddhi"
      },
      "nti uttamatthavisuddhiṃ. Nevasaññānāsaññāyatanasamāpattiyā etaṃ adhivacanaṃ. Ākiñcaññāyatanañhi vipassanāpadaṭṭhānattā aggaṃ nāma jātaṃ, nevasaññānāsaññāyatanaṃ dīghāyukattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paramadiṭṭhadhammanibbāna"
      },
      "nti imasmiññeva attabhāve paramanibbānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anupādā vimokkho"
      },
      "ti catūhi upādānehi aggahetvā cittassa vimokkho. Arahattassetaṃ nāmaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pariñña"
      },
      "nti samatikkamaṃ. Tattha bhagavā paṭhamajjhānena kāmānaṃ pariññaṃ paññāpeti, arūpāvacarehi rūpānaṃ pariññaṃ paññāpeti, anupādānibbānena vedanānaṃ pariññaṃ paññāpeti. Nibbānañhi sabbavedayitappahānattā vedanānaṃ pariññā nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anupādāparinibbāna"
      },
      "nti apaccayaparinibbānaṃ. Idaṃ pana suttaṃ kathento bhagavā anabhiratipīḷitāni pañca bhikkhusatāni disvā tesaṃ anabhirativinodanatthaṃ kathesi. Tepi anabhiratiṃ vinodetvā desanānusārena ñāṇaṃ pesetvā sotāpannā hutvā aparabhāge vipassanaṃ vaḍḍhetvā arahattaṃ pāpuṇiṃsūti."
    ],
    "innerText": "Paramatthavisuddhinti uttamatthavisuddhiṃ. Nevasaññānāsaññāyatanasamāpattiyā etaṃ adhivacanaṃ. Ākiñcaññāyatanañhi vipassanāpadaṭṭhānattā aggaṃ nāma jātaṃ, nevasaññānāsaññāyatanaṃ dīghāyukattā. Paramadiṭṭhadhammanibbānanti imasmiññeva attabhāve paramanibbānaṃ. Anupādā vimokkhoti catūhi upādānehi aggahetvā cittassa vimokkho. Arahattassetaṃ nāmaṃ. Pariññanti samatikkamaṃ. Tattha bhagavā paṭhamajjhānena kāmānaṃ pariññaṃ paññāpeti, arūpāvacarehi rūpānaṃ pariññaṃ paññāpeti, anupādānibbānena vedanānaṃ pariññaṃ paññāpeti. Nibbānañhi sabbavedayitappahānattā vedanānaṃ pariññā nāma. Anupādāparinibbānanti apaccayaparinibbānaṃ. Idaṃ pana suttaṃ kathento bhagavā anabhiratipīḷitāni pañca bhikkhusatāni disvā tesaṃ anabhirativinodanatthaṃ kathesi. Tepi anabhiratiṃ vinodetvā desanānusārena ñāṇaṃ pesetvā sotāpannā hutvā aparabhāge vipassanaṃ vaḍḍhetvā arahattaṃ pāpuṇiṃsūti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Dutiyakosalasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "30"
      },
      ". Dasame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uyyodhikā nivatto hotī"
      },
      "ti yuddhato nivatto hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Laddhādhippāyo"
      },
      "ti ",
      " mahākosalaraññā kira bimbisārassa dhītaraṃ dentena dvinnaṃ rajjānaṃ antare satasahassuṭṭhāno kāsigāmo nāma dhītu dinno ",
      ". Ajātasattunā pitari mārite mātāpissa rañño viyogasokena nacirasseva matā. Tato rājā pasenadikosalo ‘‘ajātasattunā mātāpitaro māritā, mama pitu santako gāmo’’ti tassatthāya aṭṭaṃ karoti, ajātasattupi ‘‘mama mātu santako’’ti tassa gāmassatthāya. Dvepi mātulabhāgineyyā caturaṅginiṃ senaṃ sannayhitvā yujjhiṃsu. Tattha pasenadikosalo dve vāre ajātasattunā parājito nagarameva pāvisi. Tatiyavāre ‘‘kathaṃ nu kho me jayo bhaveyyā’’ti upassutivasena yujjhitabbākāraṃ ñatvā byūhaṃ racayitvā ubhohi passehi parikkhipitvā ajātasattuṃ gaṇhi. Tāvadeva jayādhippāyassa laddhattā laddhādhippāyo nāma ahosi."
    ],
    "innerText": "30. Dasame uyyodhikā nivatto hotīti yuddhato nivatto hoti. Laddhādhippāyoti mahākosalaraññā kira bimbisārassa dhītaraṃ dentena dvinnaṃ rajjānaṃ antare satasahassuṭṭhāno kāsigāmo nāma dhītu dinno . Ajātasattunā pitari mārite mātāpissa rañño viyogasokena nacirasseva matā. Tato rājā pasenadikosalo ‘‘ajātasattunā mātāpitaro māritā, mama pitu santako gāmo’’ti tassatthāya aṭṭaṃ karoti, ajātasattupi ‘‘mama mātu santako’’ti tassa gāmassatthāya. Dvepi mātulabhāgineyyā caturaṅginiṃ senaṃ sannayhitvā yujjhiṃsu. Tattha pasenadikosalo dve vāre ajātasattunā parājito nagarameva pāvisi. Tatiyavāre ‘‘kathaṃ nu kho me jayo bhaveyyā’’ti upassutivasena yujjhitabbākāraṃ ñatvā byūhaṃ racayitvā ubhohi passehi parikkhipitvā ajātasattuṃ gaṇhi. Tāvadeva jayādhippāyassa laddhattā laddhādhippāyo nāma ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yena"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ārāmo tena pāyāsī"
      },
      "ti bahinagare jayakhandhāvāraṃ nivesetvā ‘‘yāva nagaraṃ alaṅkaronti, tāva dasabalaṃ vandissāmi. Nagaraṃ paviṭṭhakālato paṭṭhāya hi papañco hotī’’ti amaccagaṇaparivuto yenārāmo tena pāyāsi, ārāmaṃ pāvisi. Kasmiṃ kāle pāvisīti? Piṇḍapātappaṭikkantānaṃ bhikkhūnaṃ ovādaṃ datvā sammāsambuddhe gandhakuṭiṃ paviṭṭhe bhikkhusaṅghe ca ovādaṃ sampaṭicchitvā attano attano rattiṭṭhānadivāṭṭhānāni gate. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Caṅkamantī"
      },
      "ti kasmiṃ samaye caṅkamanti? Paṇītabhojanapaccayassa thinamiddhassa vinodanatthaṃ, divā padhānikā vā te. Tādisānañhi pacchābhattaṃ caṅkamitvā nhatvā sarīraṃ utuṃ gāhāpetvā ",
      " nisajja samaṇadhammaṃ karontānaṃ cittaṃ ekaggaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ye te bhikkhū"
      },
      "ti so kira ‘‘kahaṃ satthā kahaṃ sugatoti pariveṇena pariveṇaṃ āgantvā pucchitvāva pavisissāmī’’ti vilokento araññahatthī viya mahācaṅkame caṅkamamāne paṃsukūlike bhikkhū disvā tesaṃ santikaṃ agamāsi. Taṃ sandhāyetaṃ vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dassanakāmā"
      },
      "ti passitukāmā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vihāro"
      },
      "ti gandhakuṭiṃ sandhāya āhaṃsu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ataramāno"
      },
      "ti aturito, saṇikaṃ padapamāṇaṭṭhāne padaṃ nikkhipanto vattaṃ katvā susammaṭṭhaṃ muttajālasinduvārasadisaṃ vālukaṃ avināsentoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ālinda"
      },
      "nti pamukhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aggaḷa"
      },
      "nti kavāṭaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ukkāsitvā"
      },
      "ti ukkāsitasaddaṃ katvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ākoṭehī"
      },
      "ti agganakhena īsakaṃ kuñcikāchiddasamīpe koṭehīti vuttaṃ hoti. Dvāraṃ kira atiupari amanussā, atiheṭṭhā dīghajātikā koṭenti. Tathā akoṭetvā majjhe chiddasamīpe koṭetabbanti idaṃ dvārakoṭanavattanti ",
      " vadanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vivari bhagavā dvāra"
      },
      "nti na bhagavā uṭṭhāya dvāraṃ vivarati, vivaratūti pana hatthaṃ pasāreti. Tato ‘‘bhagavā tumhehi anekakappakoṭīsu dānaṃ dadamānehi na sahatthā dvāravivaraṇakammaṃ kata’’nti sayameva dvāraṃ vivaṭaṃ. Taṃ pana yasmā bhagavato manena vivaṭaṃ, tasmā ‘‘vivari bhagavā dvāra’’nti vattuṃ vaṭṭati."
    ],
    "innerText": "Yenaārāmo tena pāyāsīti bahinagare jayakhandhāvāraṃ nivesetvā ‘‘yāva nagaraṃ alaṅkaronti, tāva dasabalaṃ vandissāmi. Nagaraṃ paviṭṭhakālato paṭṭhāya hi papañco hotī’’ti amaccagaṇaparivuto yenārāmo tena pāyāsi, ārāmaṃ pāvisi. Kasmiṃ kāle pāvisīti? Piṇḍapātappaṭikkantānaṃ bhikkhūnaṃ ovādaṃ datvā sammāsambuddhe gandhakuṭiṃ paviṭṭhe bhikkhusaṅghe ca ovādaṃ sampaṭicchitvā attano attano rattiṭṭhānadivāṭṭhānāni gate. Caṅkamantīti kasmiṃ samaye caṅkamanti? Paṇītabhojanapaccayassa thinamiddhassa vinodanatthaṃ, divā padhānikā vā te. Tādisānañhi pacchābhattaṃ caṅkamitvā nhatvā sarīraṃ utuṃ gāhāpetvā nisajja samaṇadhammaṃ karontānaṃ cittaṃ ekaggaṃ hoti. Ye te bhikkhūti so kira ‘‘kahaṃ satthā kahaṃ sugatoti pariveṇena pariveṇaṃ āgantvā pucchitvāva pavisissāmī’’ti vilokento araññahatthī viya mahācaṅkame caṅkamamāne paṃsukūlike bhikkhū disvā tesaṃ santikaṃ agamāsi. Taṃ sandhāyetaṃ vuttaṃ. Dassanakāmāti passitukāmā. Vihāroti gandhakuṭiṃ sandhāya āhaṃsu. Ataramānoti aturito, saṇikaṃ padapamāṇaṭṭhāne padaṃ nikkhipanto vattaṃ katvā susammaṭṭhaṃ muttajālasinduvārasadisaṃ vālukaṃ avināsentoti attho. Ālindanti pamukhaṃ. Aggaḷanti kavāṭaṃ. Ukkāsitvāti ukkāsitasaddaṃ katvā. Ākoṭehīti agganakhena īsakaṃ kuñcikāchiddasamīpe koṭehīti vuttaṃ hoti. Dvāraṃ kira atiupari amanussā, atiheṭṭhā dīghajātikā koṭenti. Tathā akoṭetvā majjhe chiddasamīpe koṭetabbanti idaṃ dvārakoṭanavattanti vadanti. Vivari bhagavā dvāranti na bhagavā uṭṭhāya dvāraṃ vivarati, vivaratūti pana hatthaṃ pasāreti. Tato ‘‘bhagavā tumhehi anekakappakoṭīsu dānaṃ dadamānehi na sahatthā dvāravivaraṇakammaṃ kata’’nti sayameva dvāraṃ vivaṭaṃ. Taṃ pana yasmā bhagavato manena vivaṭaṃ, tasmā ‘‘vivari bhagavā dvāra’’nti vattuṃ vaṭṭati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mettūpahāra"
      },
      "nti ",
      " mettāsampayuttaṃ kāyikavācasikaupahāraṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kataññuta"
      },
      "nti ayañhi rājā pubbe thūlasarīro ahosi, doṇapākaṃ bhuñjati. Athassa bhagavā divase divase thokaṃ thokaṃ hāpanatthāya –"
    ],
    "innerText": "Mettūpahāranti mettāsampayuttaṃ kāyikavācasikaupahāraṃ. Kataññutanti ayañhi rājā pubbe thūlasarīro ahosi, doṇapākaṃ bhuñjati. Athassa bhagavā divase divase thokaṃ thokaṃ hāpanatthāya –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Manujassa sadā satīmato,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Mattaṃ jānato laddhabhojane;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "children": [
      "Tanukassa ",
      " bhavanti vedanā,"
    ],
    "innerText": "Tanukassa bhavanti vedanā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Saṇikaṃ jīrati āyupālaya’’nti. (saṃ. ni. 1.124) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Imaṃ ovādaṃ adāsi. So imasmiṃ ovāde ṭhatvā divase divase thokaṃ thokaṃ hāpetvā anukkamena nāḷikodanaparamatāya saṇṭhāsi, gattānipissa tanūni thirāni jātāni. Taṃ bhagavatā kataṃ upakāraṃ sandhāya ‘‘kataññutaṃ kho ahaṃ, bhante, kataveditaṃ sampassamāno’’ti āha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ariye ñāye"
      },
      "ti sahavipassanake magge. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vuddhasīlo"
      },
      "ti vaḍḍhitasīlo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ariyasīlo"
      },
      "ti apothujjanikehi sīlehi samannāgato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kusalasīlo"
      },
      "ti anavajjehi sīlehi samannāgato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āraññako"
      },
      "ti jāyamānopi araññe jāto, abhisambujjhamānopi araññe abhisambuddho, devavimānakappāya gandhakuṭiyā vasantopi araññeyeva vasīti dassento evamāha. Sesaṃ sabbattha uttānatthamevāti."
    ],
    "innerText": "Imaṃ ovādaṃ adāsi. So imasmiṃ ovāde ṭhatvā divase divase thokaṃ thokaṃ hāpetvā anukkamena nāḷikodanaparamatāya saṇṭhāsi, gattānipissa tanūni thirāni jātāni. Taṃ bhagavatā kataṃ upakāraṃ sandhāya ‘‘kataññutaṃ kho ahaṃ, bhante, kataveditaṃ sampassamāno’’ti āha. Ariye ñāyeti sahavipassanake magge. Vuddhasīloti vaḍḍhitasīlo. Ariyasīloti apothujjanikehi sīlehi samannāgato. Kusalasīloti anavajjehi sīlehi samannāgato. Āraññakoti jāyamānopi araññe jāto, abhisambujjhamānopi araññe abhisambuddho, devavimānakappāya gandhakuṭiyā vasantopi araññeyeva vasīti dassento evamāha. Sesaṃ sabbattha uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Mahāvaggo tatiyo."
  }
]