[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "4. Cakkavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Cakkasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "31"
      },
      ". Catutthassa ",
      " paṭhame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cakkānī"
      },
      "ti sampattiyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Catucakkaṃ vattatī"
      },
      "ti cattāri sampatticakkāni vattanti ghaṭiyantiyevāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Patirūpadesavāso"
      },
      "ti yattha catasso parisā sandissanti, evarūpe anucchavike dese vāso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sappurisāvassayo"
      },
      "ti buddhādīnaṃ sappurisānaṃ avassayanaṃ sevanaṃ ",
      " bhajanaṃ, na rājānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attasammāpaṇidhī"
      },
      "ti attano sammā ṭhapanaṃ, sace pubbe assaddhādīhi ",
      " samannāgato hoti, tāni pahāya saddhādīsu patiṭṭhāpanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pubbe ca katapuññatā"
      },
      "ti pubbe upacitakusalatā. Idameva cettha pamāṇaṃ. Yena hi ñāṇasampayuttacittena kusalakammaṃ kataṃ hoti, tadeva kusalaṃ taṃ purisaṃ patirūpadese upaneti, sappurise bhajāpeti, so eva ca puggalo attānaṃ sammā ṭhapeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puññakato"
      },
      "ti katapuñño. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sukhañcetaṃdhivattatī"
      },
      "ti sukhañca etaṃ puggalaṃ adhivattati, avattharatīti attho."
    ],
    "innerText": "31. Catutthassa paṭhame cakkānīti sampattiyo. Catucakkaṃ vattatīti cattāri sampatticakkāni vattanti ghaṭiyantiyevāti attho. Patirūpadesavāsoti yattha catasso parisā sandissanti, evarūpe anucchavike dese vāso. Sappurisāvassayoti buddhādīnaṃ sappurisānaṃ avassayanaṃ sevanaṃ bhajanaṃ, na rājānaṃ. Attasammāpaṇidhīti attano sammā ṭhapanaṃ, sace pubbe assaddhādīhi samannāgato hoti, tāni pahāya saddhādīsu patiṭṭhāpanaṃ. Pubbe ca katapuññatāti pubbe upacitakusalatā. Idameva cettha pamāṇaṃ. Yena hi ñāṇasampayuttacittena kusalakammaṃ kataṃ hoti, tadeva kusalaṃ taṃ purisaṃ patirūpadese upaneti, sappurise bhajāpeti, so eva ca puggalo attānaṃ sammā ṭhapeti. Puññakatoti katapuñño. Sukhañcetaṃdhivattatīti sukhañca etaṃ puggalaṃ adhivattati, avattharatīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Saṅgahasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "32"
      },
      ". Dutiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṅgahavatthūnī"
      },
      "ti saṅgaṇhanakāraṇāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dānañcā"
      },
      "tiādīsu ekacco hi dāneneva saṅgaṇhitabbo hoti, tassa dānameva dātabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Peyyavajja"
      },
      "nti piyavacanaṃ. Ekacco hi ‘‘ayaṃ dātabbaṃ nāma deti, ekekena pana vacanena sabbaṃ makkhetvā nāseti, kiṃ tassa dāna’’nti vattā hoti. Ekacco ‘‘ayaṃ kiñcāpi dānaṃ na deti, kathento pana telena viya makkheti. Esa detu vā mā vā, vacanamevassa sahassaṃ agghatī’’ti vattā hoti. Evarūpo puggalo dānaṃ na paccāsīsati, piyavacanameva paccāsīsati. Tassa piyavacanameva vattabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atthacariyā"
      },
      "ti atthavaḍḍhanakathā. Ekacco hi neva dānaṃ, na piyavacanaṃ paccāsīsati, attano hitakathaṃ vaḍḍhikathameva paccāsīsati. Evarūpassa puggalassa ‘‘idaṃ te kātabbaṃ, idaṃ na kātabbaṃ, evarūpo puggalo sevitabbo, evarūpo na sevitabbo’’ti evaṃ atthacariyakathāva kathetabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samānattatā"
      },
      "ti ",
      " samānasukhadukkhabhāvo. Ekacco hi dānādīsu ekampi na paccāsīsati ",
      ", ekāsane nisajjaṃ, ekapallaṅke sayanaṃ, ekato bhojananti evaṃ samānasukhadukkhataṃ paccāsīsati. So sace gahaṭṭhassa jātiyā pabbajitassa sīlena sadiso hoti, tassāyaṃ samānattatā kātabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tattha tattha yathāraha"
      },
      "nti tesu tesu dhammesu yathānucchavikaṃ samānattatāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rathassāṇīva yāyato"
      },
      "ti yathā rathassa gacchato āṇi saṅgaho nāma hoti, sā rathaṃ saṅgaṇhāti, evamime saṅgahā lokaṃ saṅgaṇhanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na mātā puttakāraṇā"
      },
      "ti yadi mātā ete saṅgahe puttassa na kareyya, puttakāraṇā mānaṃ vā pūjaṃ vā na labheyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅgahā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ete"
      },
      "ti upayogavacane paccattaṃ. Saṅgahe eteti vā pāṭho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samavekkhantī"
      },
      "ti sammā pekkhanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāsaṃsā ca bhavantī"
      },
      "ti pasaṃsanīyā ca bhavanti."
    ],
    "innerText": "32. Dutiye saṅgahavatthūnīti saṅgaṇhanakāraṇāni. Dānañcātiādīsu ekacco hi dāneneva saṅgaṇhitabbo hoti, tassa dānameva dātabbaṃ. Peyyavajjanti piyavacanaṃ. Ekacco hi ‘‘ayaṃ dātabbaṃ nāma deti, ekekena pana vacanena sabbaṃ makkhetvā nāseti, kiṃ tassa dāna’’nti vattā hoti. Ekacco ‘‘ayaṃ kiñcāpi dānaṃ na deti, kathento pana telena viya makkheti. Esa detu vā mā vā, vacanamevassa sahassaṃ agghatī’’ti vattā hoti. Evarūpo puggalo dānaṃ na paccāsīsati, piyavacanameva paccāsīsati. Tassa piyavacanameva vattabbaṃ. Atthacariyāti atthavaḍḍhanakathā. Ekacco hi neva dānaṃ, na piyavacanaṃ paccāsīsati, attano hitakathaṃ vaḍḍhikathameva paccāsīsati. Evarūpassa puggalassa ‘‘idaṃ te kātabbaṃ, idaṃ na kātabbaṃ, evarūpo puggalo sevitabbo, evarūpo na sevitabbo’’ti evaṃ atthacariyakathāva kathetabbā. Samānattatāti samānasukhadukkhabhāvo. Ekacco hi dānādīsu ekampi na paccāsīsati , ekāsane nisajjaṃ, ekapallaṅke sayanaṃ, ekato bhojananti evaṃ samānasukhadukkhataṃ paccāsīsati. So sace gahaṭṭhassa jātiyā pabbajitassa sīlena sadiso hoti, tassāyaṃ samānattatā kātabbā. Tattha tattha yathārahanti tesu tesu dhammesu yathānucchavikaṃ samānattatāti attho. Rathassāṇīva yāyatoti yathā rathassa gacchato āṇi saṅgaho nāma hoti, sā rathaṃ saṅgaṇhāti, evamime saṅgahā lokaṃ saṅgaṇhanti. Na mātā puttakāraṇāti yadi mātā ete saṅgahe puttassa na kareyya, puttakāraṇā mānaṃ vā pūjaṃ vā na labheyya. Saṅgahāeteti upayogavacane paccattaṃ. Saṅgahe eteti vā pāṭho. Samavekkhantīti sammā pekkhanti. Pāsaṃsā ca bhavantīti pasaṃsanīyā ca bhavanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Sīhasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "33"
      },
      ". Tatiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sīho"
      },
      "ti cattāro sīhā – tiṇasīho, kāḷasīho, paṇḍusīho, kesarasīhoti. Tesu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tiṇasīho"
      },
      " kapotavaṇṇagāvisadiso tiṇabhakkho ca hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāḷasīho"
      },
      " kāḷagāvisadiso tiṇabhakkhoyeva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṇḍusīho"
      },
      " paṇḍupalāsavaṇṇagāvisadiso maṃsabhakkho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kesarasīho"
      },
      " lākhāparikammakateneva mukhena agganaṅguṭṭhena catūhi ca pādapariyantehi samannāgato, matthakatopissa paṭṭhāya lākhātūlikāya katā viya tisso rājiyo piṭṭhimajjhena gantvā antarasatthimhi dakkhiṇāvattā hutvā ṭhitā. Khandhe panassa satasahassagghanikakambalaparikkhepo viya kesarabhāro hoti, avasesaṭṭhānaṃ parisuddhasālipiṇḍasaṅkhacuṇṇapiṇḍavaṇṇaṃ hoti. Imesu catūsu sīhesu ayaṃ kesarasīho idha adhippeto."
    ],
    "innerText": "33. Tatiye sīhoti cattāro sīhā – tiṇasīho, kāḷasīho, paṇḍusīho, kesarasīhoti. Tesu tiṇasīho kapotavaṇṇagāvisadiso tiṇabhakkho ca hoti. Kāḷasīho kāḷagāvisadiso tiṇabhakkhoyeva. Paṇḍusīho paṇḍupalāsavaṇṇagāvisadiso maṃsabhakkho. Kesarasīho lākhāparikammakateneva mukhena agganaṅguṭṭhena catūhi ca pādapariyantehi samannāgato, matthakatopissa paṭṭhāya lākhātūlikāya katā viya tisso rājiyo piṭṭhimajjhena gantvā antarasatthimhi dakkhiṇāvattā hutvā ṭhitā. Khandhe panassa satasahassagghanikakambalaparikkhepo viya kesarabhāro hoti, avasesaṭṭhānaṃ parisuddhasālipiṇḍasaṅkhacuṇṇapiṇḍavaṇṇaṃ hoti. Imesu catūsu sīhesu ayaṃ kesarasīho idha adhippeto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Migarājā"
      },
      "ti ",
      " sabbamigagaṇassa rājā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āsayā"
      },
      "ti vasanaṭṭhānato, suvaṇṇaguhato vā rajatamaṇiphalikamanosilāguhato vā nikkhamatīti vuttaṃ hoti. Nikkhamamāno panesa catūhi kāraṇehi nikkhamati andhakārapīḷito vā ālokatthāya, uccārapassāvapīḷito vā tesaṃ vissajjanatthāya, jighacchāpīḷito vā gocaratthāya, sambhavapīḷito vā assaddhammapaṭisevanatthāya. Idha pana gocaratthāya nikkhamanto adhippeto."
    ],
    "innerText": "Migarājāti sabbamigagaṇassa rājā. Āsayāti vasanaṭṭhānato, suvaṇṇaguhato vā rajatamaṇiphalikamanosilāguhato vā nikkhamatīti vuttaṃ hoti. Nikkhamamāno panesa catūhi kāraṇehi nikkhamati andhakārapīḷito vā ālokatthāya, uccārapassāvapīḷito vā tesaṃ vissajjanatthāya, jighacchāpīḷito vā gocaratthāya, sambhavapīḷito vā assaddhammapaṭisevanatthāya. Idha pana gocaratthāya nikkhamanto adhippeto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vijambhatī"
      },
      "ti suvaṇṇatale vā rajatamaṇiphalikamanosilātalānaṃ vā aññatarasmiṃ dve pacchimapāde samaṃ patiṭṭhāpetvā purimapāde purato pasāretvā sarīrassa pacchābhāgaṃ ākaḍḍhitvā purimabhāgaṃ ",
      " abhiharitvā piṭṭhiṃ nāmetvā gīvaṃ ukkhipitvā asanisaddaṃ karonto viya nāsapuṭāni pothetvā sarīralaggaṃ rajaṃ vidhunanto vijambhati. Vijambhanabhūmiyañca pana taruṇavacchako viya aparāparaṃ javati, javato panassa sarīraṃ andhakāre paribbhamantaṃ alātaṃ viya khāyati."
    ],
    "innerText": "Vijambhatīti suvaṇṇatale vā rajatamaṇiphalikamanosilātalānaṃ vā aññatarasmiṃ dve pacchimapāde samaṃ patiṭṭhāpetvā purimapāde purato pasāretvā sarīrassa pacchābhāgaṃ ākaḍḍhitvā purimabhāgaṃ abhiharitvā piṭṭhiṃ nāmetvā gīvaṃ ukkhipitvā asanisaddaṃ karonto viya nāsapuṭāni pothetvā sarīralaggaṃ rajaṃ vidhunanto vijambhati. Vijambhanabhūmiyañca pana taruṇavacchako viya aparāparaṃ javati, javato panassa sarīraṃ andhakāre paribbhamantaṃ alātaṃ viya khāyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anuviloketī"
      },
      "ti ",
      " kasmā anuviloketi? Parānuddayatāya. Tasmiṃ kira sīhanādaṃ nadante papātāvāṭādīsu visamaṭṭhānesu carantā hatthigokaṇṇamahiṃsādayo pāṇā papātepi āvāṭepi patanti, tesaṃ anuddayāya anuviloketi. Kiṃ panassa luddassa paramaṃsakhādino anuddayā nāma atthīti? Āma atthi. Tathā hi ‘‘kiṃ me bahūhi ghātitehī’’ti attano ",
      " gocaratthāyāpi khuddake pāṇe na gaṇhāti. Evaṃ anuddayaṃ karoti, vuttampi cetaṃ – ‘‘māhaṃ khuddake pāṇe visamagate saṅghātaṃ āpādesi’’nti (a. ni. 10.21)."
    ],
    "innerText": "Anuviloketīti kasmā anuviloketi? Parānuddayatāya. Tasmiṃ kira sīhanādaṃ nadante papātāvāṭādīsu visamaṭṭhānesu carantā hatthigokaṇṇamahiṃsādayo pāṇā papātepi āvāṭepi patanti, tesaṃ anuddayāya anuviloketi. Kiṃ panassa luddassa paramaṃsakhādino anuddayā nāma atthīti? Āma atthi. Tathā hi ‘‘kiṃ me bahūhi ghātitehī’’ti attano gocaratthāyāpi khuddake pāṇe na gaṇhāti. Evaṃ anuddayaṃ karoti, vuttampi cetaṃ – ‘‘māhaṃ khuddake pāṇe visamagate saṅghātaṃ āpādesi’’nti (a. ni. 10.21)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sīhanādaṃ nadatī"
      },
      "ti tikkhattuṃ tāva abhītanādaṃ nadati. Evañca panassa vijambhanabhūmiyaṃ ṭhatvā nadantassa saddo samantā tiyojanapadesaṃ ekaninnādaṃ karoti, tamassa ninnādaṃ sutvā tiyojanabbhantaragatā dvipadacatuppadagaṇā yathāṭhāne ṭhātuṃ na sakkonti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gocarāya pakkamatī"
      },
      "ti āhāratthāya gacchati. Kathaṃ? So hi vijambhanabhūmiyaṃ ṭhatvā dakkhiṇato vā vāmato vā uppatanto usabhamattaṃ ṭhānaṃ gaṇhāti, uddhaṃ uppatanto cattāripi aṭṭhapi usabhaṭṭhānāni uppatati, same ṭhāne ujukaṃ pakkhandanto soḷasausabhamattampi vīsatiusabhamattampi ṭhānaṃ pakkhandati, thalā vā pabbatā vā pakkhandanto saṭṭhiusabhamattampi asītiusabhamattampi ṭhānaṃ pakkhandati, antarāmagge rukkhaṃ vā pabbataṃ vā disvā taṃ pariharanto vāmato vā dakkhiṇato vā uddhaṃ vā usabhamattaṃ apakkamati. Tatiyaṃ pana sīhanādaṃ naditvā teneva saddhiṃ tiyojane ṭhāne paññāyati, tiyojanaṃ gantvā nivattitvā ṭhito attanova nādassa anunādaṃ suṇāti. Evaṃ sīghena javena pakkamati."
    ],
    "innerText": "Sīhanādaṃ nadatīti tikkhattuṃ tāva abhītanādaṃ nadati. Evañca panassa vijambhanabhūmiyaṃ ṭhatvā nadantassa saddo samantā tiyojanapadesaṃ ekaninnādaṃ karoti, tamassa ninnādaṃ sutvā tiyojanabbhantaragatā dvipadacatuppadagaṇā yathāṭhāne ṭhātuṃ na sakkonti. Gocarāya pakkamatīti āhāratthāya gacchati. Kathaṃ? So hi vijambhanabhūmiyaṃ ṭhatvā dakkhiṇato vā vāmato vā uppatanto usabhamattaṃ ṭhānaṃ gaṇhāti, uddhaṃ uppatanto cattāripi aṭṭhapi usabhaṭṭhānāni uppatati, same ṭhāne ujukaṃ pakkhandanto soḷasausabhamattampi vīsatiusabhamattampi ṭhānaṃ pakkhandati, thalā vā pabbatā vā pakkhandanto saṭṭhiusabhamattampi asītiusabhamattampi ṭhānaṃ pakkhandati, antarāmagge rukkhaṃ vā pabbataṃ vā disvā taṃ pariharanto vāmato vā dakkhiṇato vā uddhaṃ vā usabhamattaṃ apakkamati. Tatiyaṃ pana sīhanādaṃ naditvā teneva saddhiṃ tiyojane ṭhāne paññāyati, tiyojanaṃ gantvā nivattitvā ṭhito attanova nādassa anunādaṃ suṇāti. Evaṃ sīghena javena pakkamati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yebhuyyenā"
      },
      "ti pāyena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhayaṃ santāsaṃ saṃvega"
      },
      "nti sabbaṃ cittutrāsasseva nāmaṃ. Sīhassa hi saddaṃ sutvā bahū bhāyanti, appakā na ",
      " bhāyanti. Ke pana teti? Samasīho hatthājānīyo assājānīyo usabhājānīyo purisājānīyo khīṇāsavoti. Kasmā panete na bhāyantīti? Samasīho tāva ‘‘jātigottakulasūrabhāvehi samānosmī’’ti na bhāyati, hatthājānīyādayo attano ",
      " sakkāyadiṭṭhibalavatāya na bhāyanti, khīṇāsavo sakkāyadiṭṭhiyā pahīnattā na bhāyati."
    ],
    "innerText": "Yebhuyyenāti pāyena. Bhayaṃ santāsaṃ saṃveganti sabbaṃ cittutrāsasseva nāmaṃ. Sīhassa hi saddaṃ sutvā bahū bhāyanti, appakā na bhāyanti. Ke pana teti? Samasīho hatthājānīyo assājānīyo usabhājānīyo purisājānīyo khīṇāsavoti. Kasmā panete na bhāyantīti? Samasīho tāva ‘‘jātigottakulasūrabhāvehi samānosmī’’ti na bhāyati, hatthājānīyādayo attano sakkāyadiṭṭhibalavatāya na bhāyanti, khīṇāsavo sakkāyadiṭṭhiyā pahīnattā na bhāyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bilāsayā"
      },
      "ti ",
      " bile sayantā bilavāsino ahinakulagodhādayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Udakāsayā"
      },
      "ti udakavāsino macchakacchapādayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vanāsayā"
      },
      "ti vanavāsino hatthiassagokaṇṇamigādayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pavisantī"
      },
      "ti ‘‘idāni āgantvā gaṇhissatī’’ti maggaṃ oloketvā pavisanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Daḷhehī"
      },
      "ti thirehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Varattehī"
      },
      "ti cammarajjūhi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahiddhiko"
      },
      "tiādīsu vijambhanabhūmiyaṃ ṭhatvā dakkhiṇapassādīhi usabhamattaṃ, ujuṃ vīsatiusabhamattādilaṅghanavasena mahiddhikatā, sesamigānaṃ adhipatibhāvena mahesakkhatā, samantā tiyojanaṭṭhāne saddaṃ sutvā palāyantānaṃ vasena mahānubhāvatā veditabbā."
    ],
    "innerText": "Bilāsayāti bile sayantā bilavāsino ahinakulagodhādayo. Udakāsayāti udakavāsino macchakacchapādayo. Vanāsayāti vanavāsino hatthiassagokaṇṇamigādayo. Pavisantīti ‘‘idāni āgantvā gaṇhissatī’’ti maggaṃ oloketvā pavisanti. Daḷhehīti thirehi. Varattehīti cammarajjūhi. Mahiddhikotiādīsu vijambhanabhūmiyaṃ ṭhatvā dakkhiṇapassādīhi usabhamattaṃ, ujuṃ vīsatiusabhamattādilaṅghanavasena mahiddhikatā, sesamigānaṃ adhipatibhāvena mahesakkhatā, samantā tiyojanaṭṭhāne saddaṃ sutvā palāyantānaṃ vasena mahānubhāvatā veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evameva kho"
      },
      "ti bhagavā tesu tesu suttantesu tathā tathā attānaṃ kathesi. ‘‘Sīhoti kho, bhikkhave, tathāgatassetaṃ adhivacanaṃ arahato sammāsambuddhassā’’ti (a. ni. 5.99; 10.21) imasmiṃ tāva sutte sīhasadisaṃ attānaṃ kathesi. ‘‘Bhisakko sallakattoti kho, sunakkhatta, tathāgatassetaṃ adhivacana’’nti (ma. ni. 3.65) imasmiṃ ",
      " vejjasadisaṃ, ‘‘brāhmaṇoti kho, bhikkhave, tathāgatassetaṃ adhivacana’’nti (a. ni. 8.85) imasmiṃ brāhmaṇasadisaṃ, ‘‘puriso maggakusaloti kho, tissa, tathāgatassetaṃ adhivacana’’nti (saṃ. ni. 3.84) imasmiṃ maggadesakapurisasadisaṃ, ‘‘rājāhamasmi, selā’’ti (su. ni. 559; ma. ni. 2.399) imasmiṃ rājasadisaṃ. Imasmiṃ pana sutte sīhasadisameva katvā attānaṃ kathento evamāha."
    ],
    "innerText": "Evameva khoti bhagavā tesu tesu suttantesu tathā tathā attānaṃ kathesi. ‘‘Sīhoti kho, bhikkhave, tathāgatassetaṃ adhivacanaṃ arahato sammāsambuddhassā’’ti (a. ni. 5.99; 10.21) imasmiṃ tāva sutte sīhasadisaṃ attānaṃ kathesi. ‘‘Bhisakko sallakattoti kho, sunakkhatta, tathāgatassetaṃ adhivacana’’nti (ma. ni. 3.65) imasmiṃ vejjasadisaṃ, ‘‘brāhmaṇoti kho, bhikkhave, tathāgatassetaṃ adhivacana’’nti (a. ni. 8.85) imasmiṃ brāhmaṇasadisaṃ, ‘‘puriso maggakusaloti kho, tissa, tathāgatassetaṃ adhivacana’’nti (saṃ. ni. 3.84) imasmiṃ maggadesakapurisasadisaṃ, ‘‘rājāhamasmi, selā’’ti (su. ni. 559; ma. ni. 2.399) imasmiṃ rājasadisaṃ. Imasmiṃ pana sutte sīhasadisameva katvā attānaṃ kathento evamāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatrāyaṃ sadisatā – sīhassa kañcanaguhādīsu vasanakālo viya hi tathāgatassa dīpaṅkarapādamūle katābhinīhārassa aparimitakālaṃ pāramiyo pūretvā pacchimabhave paṭisandhiggahaṇena ceva mātukucchito nikkhamanena ca dasasahassilokadhātuṃ kampetvā vuddhimanvāya dibbasampattisadisaṃ sampattiṃ anubhavamānassa tīsu pāsādesu nivāsakālo daṭṭhabbo. Sīhassa kañcanaguhādito nikkhantakālo viya tathāgatassa ekūnatiṃsasaṃvacchare vivaṭena dvārena kaṇḍakaṃ āruyha channasahāyassa nikkhamitvā tīṇi rajjāni atikkamitvā anomānadītīre brahmunā dinnāni kāsāyāni paridahitvā pabbajitassa sattame divase rājagahaṃ gantvā ",
      " tattha ",
      " piṇḍāya caritvā paṇḍavagiripabbhāre katabhattakiccassa sammāsambodhiṃ patvā paṭhamameva magadharaṭṭhaṃ āgamanatthāya yāva rañño paṭiññādānakālo."
    ],
    "innerText": "Tatrāyaṃ sadisatā – sīhassa kañcanaguhādīsu vasanakālo viya hi tathāgatassa dīpaṅkarapādamūle katābhinīhārassa aparimitakālaṃ pāramiyo pūretvā pacchimabhave paṭisandhiggahaṇena ceva mātukucchito nikkhamanena ca dasasahassilokadhātuṃ kampetvā vuddhimanvāya dibbasampattisadisaṃ sampattiṃ anubhavamānassa tīsu pāsādesu nivāsakālo daṭṭhabbo. Sīhassa kañcanaguhādito nikkhantakālo viya tathāgatassa ekūnatiṃsasaṃvacchare vivaṭena dvārena kaṇḍakaṃ āruyha channasahāyassa nikkhamitvā tīṇi rajjāni atikkamitvā anomānadītīre brahmunā dinnāni kāsāyāni paridahitvā pabbajitassa sattame divase rājagahaṃ gantvā tattha piṇḍāya caritvā paṇḍavagiripabbhāre katabhattakiccassa sammāsambodhiṃ patvā paṭhamameva magadharaṭṭhaṃ āgamanatthāya yāva rañño paṭiññādānakālo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sīhassa vijambhanakālo viya tathāgatassa dinnapaṭiññassa āḷārakālāmaupasaṅkamanaṃ ādiṃ katvā yāva sujātāya ",
      " dinnapāyāsassa ekūnapaṇṇāsāya piṇḍehi paribhuttakālo veditabbo. Sīhassa sarīravidhunanaṃ viya sāyanhasamaye sottiyena dinnā aṭṭha tiṇamuṭṭhiyo gahetvā dasasahassacakkavāḷadevatāhi thomiyamānassa gandhādīhi pūjiyamānassa tikkhattuṃ bodhiṃ padakkhiṇaṃ katvā bodhimaṇḍaṃ āruyha cuddasahatthubbedhe ṭhāne tiṇasantharaṃ attharitvā caturaṅgavīriyaṃ adhiṭṭhāya nisinnassa taṃkhaṇaññeva mārabalaṃ vidhametvā tīsu yāmesu tisso vijjā visodhetvā anulomappaṭilomaṃ paṭiccasamuppādamahāsamuddaṃ yamakañāṇamanthanena manthentassa sabbaññutaññāṇe paṭividdhe tadanubhāvena dasasahassilokadhātukampanaṃ veditabbaṃ."
    ],
    "innerText": "Sīhassa vijambhanakālo viya tathāgatassa dinnapaṭiññassa āḷārakālāmaupasaṅkamanaṃ ādiṃ katvā yāva sujātāya dinnapāyāsassa ekūnapaṇṇāsāya piṇḍehi paribhuttakālo veditabbo. Sīhassa sarīravidhunanaṃ viya sāyanhasamaye sottiyena dinnā aṭṭha tiṇamuṭṭhiyo gahetvā dasasahassacakkavāḷadevatāhi thomiyamānassa gandhādīhi pūjiyamānassa tikkhattuṃ bodhiṃ padakkhiṇaṃ katvā bodhimaṇḍaṃ āruyha cuddasahatthubbedhe ṭhāne tiṇasantharaṃ attharitvā caturaṅgavīriyaṃ adhiṭṭhāya nisinnassa taṃkhaṇaññeva mārabalaṃ vidhametvā tīsu yāmesu tisso vijjā visodhetvā anulomappaṭilomaṃ paṭiccasamuppādamahāsamuddaṃ yamakañāṇamanthanena manthentassa sabbaññutaññāṇe paṭividdhe tadanubhāvena dasasahassilokadhātukampanaṃ veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sīhassa catudisāvilokanaṃ viya paṭividdhasabbaññutaññāṇassa sattasattāhaṃ bodhimaṇḍe viharitvā paribhuttamadhupiṇḍikāhārassa ajapālanigrodhamūle mahābrahmuno dhammadesanāyācanaṃ paṭiggahetvā tattha viharantassa ekādasame divase ‘‘sve āsāḷhipuṇṇamā bhavissatī’’ti paccūsasamaye ‘‘kassa nu kho ahaṃ paṭhamaṃ dhammaṃ deseyya’’nti āḷārudakānaṃ kālakatabhāvaṃ ñatvā dhammadesanatthāya pañcavaggiyānaṃ olokanaṃ daṭṭhabbaṃ. Sīhassa gocaratthāya tiyojanaṃ gamanakālo viya attano pattacīvaraṃ ādāya ‘‘pañcavaggiyānaṃ dhammacakkaṃ pavattessāmī’’ti ",
      " pacchābhatte ajapālanigrodhato vuṭṭhitassa aṭṭhārasayojanamaggaṃ gamanakālo."
    ],
    "innerText": "Sīhassa catudisāvilokanaṃ viya paṭividdhasabbaññutaññāṇassa sattasattāhaṃ bodhimaṇḍe viharitvā paribhuttamadhupiṇḍikāhārassa ajapālanigrodhamūle mahābrahmuno dhammadesanāyācanaṃ paṭiggahetvā tattha viharantassa ekādasame divase ‘‘sve āsāḷhipuṇṇamā bhavissatī’’ti paccūsasamaye ‘‘kassa nu kho ahaṃ paṭhamaṃ dhammaṃ deseyya’’nti āḷārudakānaṃ kālakatabhāvaṃ ñatvā dhammadesanatthāya pañcavaggiyānaṃ olokanaṃ daṭṭhabbaṃ. Sīhassa gocaratthāya tiyojanaṃ gamanakālo viya attano pattacīvaraṃ ādāya ‘‘pañcavaggiyānaṃ dhammacakkaṃ pavattessāmī’’ti pacchābhatte ajapālanigrodhato vuṭṭhitassa aṭṭhārasayojanamaggaṃ gamanakālo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sīhassa sīhanādakālo viya tathāgatassa aṭṭhārasayojanamaggaṃ gantvā pañcavaggiye saññāpetvā acalapallaṅke nisinnassa dasahi cakkavāḷasahassehi sannipatitena devagaṇena parivutassa ‘‘dveme, bhikkhave, antā pabbajitena na sevitabbā’’tiādinā nayena dhammacakkappavattanakālo veditabbo. Imasmiṃ ca pana pade desiyamāne tathāgatasīhassa dhammaghoso heṭṭhā avīciṃ upari bhavaggaṃ gahetvā dasasahassilokadhātuṃ paṭicchādesi. Sīhassa saddena khuddakapāṇānaṃ santāsāpajjanakālo ",
      " viya tathāgatassa tīṇi lakkhaṇāni dīpetvā cattāri saccāni soḷasahākārehi saṭṭhiyā ca nayasahassehi vibhajitvā dhammaṃ kathentassa dīghāyukānaṃ devānaṃ ñāṇasantāsassa uppattikālo veditabbo."
    ],
    "innerText": "Sīhassa sīhanādakālo viya tathāgatassa aṭṭhārasayojanamaggaṃ gantvā pañcavaggiye saññāpetvā acalapallaṅke nisinnassa dasahi cakkavāḷasahassehi sannipatitena devagaṇena parivutassa ‘‘dveme, bhikkhave, antā pabbajitena na sevitabbā’’tiādinā nayena dhammacakkappavattanakālo veditabbo. Imasmiṃ ca pana pade desiyamāne tathāgatasīhassa dhammaghoso heṭṭhā avīciṃ upari bhavaggaṃ gahetvā dasasahassilokadhātuṃ paṭicchādesi. Sīhassa saddena khuddakapāṇānaṃ santāsāpajjanakālo viya tathāgatassa tīṇi lakkhaṇāni dīpetvā cattāri saccāni soḷasahākārehi saṭṭhiyā ca nayasahassehi vibhajitvā dhammaṃ kathentassa dīghāyukānaṃ devānaṃ ñāṇasantāsassa uppattikālo veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aparo ",
      " nayo – sīho viya sabbaññutaṃ patto tathāgato, āsayabhūtāya kanakaguhāya nikkhamanaṃ viya gandhakuṭito nikkhamanakālo, vijambhanaṃ viya dhammasabhaṃ upasaṅkamanakālo, disāvilokanaṃ viya parisāvilokanaṃ, sīhanādanadanaṃ viya dhammadesanākālo, gocarāya pakkamanaṃ viya paravādanimmaddanatthāya gamanaṃ."
    ],
    "innerText": "Aparo nayo – sīho viya sabbaññutaṃ patto tathāgato, āsayabhūtāya kanakaguhāya nikkhamanaṃ viya gandhakuṭito nikkhamanakālo, vijambhanaṃ viya dhammasabhaṃ upasaṅkamanakālo, disāvilokanaṃ viya parisāvilokanaṃ, sīhanādanadanaṃ viya dhammadesanākālo, gocarāya pakkamanaṃ viya paravādanimmaddanatthāya gamanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aparo nayo – sīho viya tathāgato, himavantanissitāya kañcanaguhāya nikkhamanaṃ viya ārammaṇavasena nibbānanissitāya ",
      " phalasamāpattiyā vuṭṭhānaṃ, vijambhanaṃ viya paccavekkhaṇañāṇaṃ, disāvilokanaṃ viya veneyyasattavilokanaṃ, sīhanādo viya sampattaparisāya dhammadesanā, gocarāya pakkamanaṃ viya asampattānaṃ veneyyasattānaṃ santikūpasaṅkamanaṃ veditabbaṃ."
    ],
    "innerText": "Aparo nayo – sīho viya tathāgato, himavantanissitāya kañcanaguhāya nikkhamanaṃ viya ārammaṇavasena nibbānanissitāya phalasamāpattiyā vuṭṭhānaṃ, vijambhanaṃ viya paccavekkhaṇañāṇaṃ, disāvilokanaṃ viya veneyyasattavilokanaṃ, sīhanādo viya sampattaparisāya dhammadesanā, gocarāya pakkamanaṃ viya asampattānaṃ veneyyasattānaṃ santikūpasaṅkamanaṃ veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yadā"
      },
      "ti yasmiṃ kāle. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tathāgato"
      },
      "ti heṭṭhā vuttehi aṭṭhahi kāraṇehi tathāgato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Loke"
      },
      "ti sattaloke. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uppajjatī"
      },
      "ti abhinīhārato paṭṭhāya yāva bodhipallaṅkā vā arahattamaggañāṇā vā uppajjati nāma, arahattaphale pana patte uppanno nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Arahaṃ sammāsambuddho"
      },
      "tiādīni visuddhimagge (visuddhi. 1.124 ādayo) buddhānussatiniddese vitthāritāni."
    ],
    "innerText": "Yadāti yasmiṃ kāle. Tathāgatoti heṭṭhā vuttehi aṭṭhahi kāraṇehi tathāgato. Loketi sattaloke. Uppajjatīti abhinīhārato paṭṭhāya yāva bodhipallaṅkā vā arahattamaggañāṇā vā uppajjati nāma, arahattaphale pana patte uppanno nāma. Arahaṃ sammāsambuddhotiādīni visuddhimagge (visuddhi. 1.124 ādayo) buddhānussatiniddese vitthāritāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iti sakkāyo"
      },
      "ti ayaṃ sakkāyo, ettako sakkāyo, na ito bhiyyo sakkāyo atthīti. Ettāvatā sabhāvato sarasato pariyantato paricchedato parivaṭumato sabbepi pañcupādānakkhandhā dassitā honti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iti sakkāyasamudayo"
      },
      "ti ayaṃ sakkāyassa samudayo nāma. Ettāvatā ‘‘āhārasamudayā rūpasamudayo’’tiādi sabbaṃ dassitaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iti sakkāyassa atthaṅgamo"
      },
      "ti ayaṃ sakkāyassa atthaṅgamo. Imināpi ‘‘āhāranirodhā rūpanirodho’’tiādi sabbaṃ dassitaṃ hoti."
    ],
    "innerText": "Iti sakkāyoti ayaṃ sakkāyo, ettako sakkāyo, na ito bhiyyo sakkāyo atthīti. Ettāvatā sabhāvato sarasato pariyantato paricchedato parivaṭumato sabbepi pañcupādānakkhandhā dassitā honti. Iti sakkāyasamudayoti ayaṃ sakkāyassa samudayo nāma. Ettāvatā ‘‘āhārasamudayā rūpasamudayo’’tiādi sabbaṃ dassitaṃ hoti. Iti sakkāyassa atthaṅgamoti ayaṃ sakkāyassa atthaṅgamo. Imināpi ‘‘āhāranirodhā rūpanirodho’’tiādi sabbaṃ dassitaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vaṇṇavanto"
      },
      "ti ",
      " sarīravaṇṇena vaṇṇavanto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammadesanaṃ sutvā"
      },
      "ti pañcasu khandhesu paṇṇāsalakkhaṇappaṭimaṇḍitaṃ tathāgatassa dhammadesanaṃ sutvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yebhuyyenā"
      },
      "ti ",
      " idha ke ṭhapeti? Ariyasāvake deve. Tesaṃ hi khīṇāsavattā cittutrāsabhayampi na uppajjati, saṃviggassa yoniso padhānena pattabbaṃ pattatāya ñāṇasaṃvegopi. Itarāsaṃ pana devatānaṃ ‘‘tāso heso, bhikkhave, anicca’’nti manasikarontānaṃ cittutrāsabhayampi, balavavipassanākāle ñāṇabhayampi uppajjati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bho"
      },
      "ti dhammālapanamattametaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sakkāyapariyāpannā"
      },
      "ti pañcakkhandhapariyāpannā. Iti tesaṃ sammāsambuddhe ",
      " vaṭṭadosaṃ dassetvā tilakkhaṇāhataṃ katvā dhammaṃ desente ñāṇabhayaṃ nāma okkamati."
    ],
    "innerText": "Vaṇṇavantoti sarīravaṇṇena vaṇṇavanto. Dhammadesanaṃ sutvāti pañcasu khandhesu paṇṇāsalakkhaṇappaṭimaṇḍitaṃ tathāgatassa dhammadesanaṃ sutvā. Yebhuyyenāti idha ke ṭhapeti? Ariyasāvake deve. Tesaṃ hi khīṇāsavattā cittutrāsabhayampi na uppajjati, saṃviggassa yoniso padhānena pattabbaṃ pattatāya ñāṇasaṃvegopi. Itarāsaṃ pana devatānaṃ ‘‘tāso heso, bhikkhave, anicca’’nti manasikarontānaṃ cittutrāsabhayampi, balavavipassanākāle ñāṇabhayampi uppajjati. Bhoti dhammālapanamattametaṃ. Sakkāyapariyāpannāti pañcakkhandhapariyāpannā. Iti tesaṃ sammāsambuddhe vaṭṭadosaṃ dassetvā tilakkhaṇāhataṃ katvā dhammaṃ desente ñāṇabhayaṃ nāma okkamati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhiññāyā"
      },
      "ti jānitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammacakka"
      },
      "nti paṭivedhañāṇampi desanāñāṇampi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭivedhañāṇaṃ"
      },
      " nāma yena ñāṇena bodhipallaṅke nisinno cattāri saccāni soḷasahākārehi saṭṭhiyā ca nayasahassehi paṭivijjhi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Desanāñāṇaṃ"
      },
      " nāma yena ñāṇena tiparivaṭṭaṃ dvādasākāraṃ dhammacakkaṃ pavattesi. Ubhayampetaṃ dasabalassa ure jātañāṇameva. Tesu dhammadesanāñāṇaṃ gahetabbaṃ. Taṃ panesa yāva aṭṭhārasabrahmakoṭīhi saddhiṃ aññākoṇḍaññattherassa sotāpattiphalaṃ na uppajjati, tāva pavatteti nāma. Tasmiṃ uppanne pavattitaṃ nāma hotīti veditabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appaṭipuggalo"
      },
      "ti sadisapuggalarahito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yasassino"
      },
      "ti parivārasampannā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tādino"
      },
      "ti ",
      " lābhālābhādīhi ekasadisassa."
    ],
    "innerText": "Abhiññāyāti jānitvā. Dhammacakkanti paṭivedhañāṇampi desanāñāṇampi. Paṭivedhañāṇaṃ nāma yena ñāṇena bodhipallaṅke nisinno cattāri saccāni soḷasahākārehi saṭṭhiyā ca nayasahassehi paṭivijjhi. Desanāñāṇaṃ nāma yena ñāṇena tiparivaṭṭaṃ dvādasākāraṃ dhammacakkaṃ pavattesi. Ubhayampetaṃ dasabalassa ure jātañāṇameva. Tesu dhammadesanāñāṇaṃ gahetabbaṃ. Taṃ panesa yāva aṭṭhārasabrahmakoṭīhi saddhiṃ aññākoṇḍaññattherassa sotāpattiphalaṃ na uppajjati, tāva pavatteti nāma. Tasmiṃ uppanne pavattitaṃ nāma hotīti veditabbaṃ. Appaṭipuggaloti sadisapuggalarahito. Yasassinoti parivārasampannā. Tādinoti lābhālābhādīhi ekasadisassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Pasādasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "34"
      },
      ". Catutthe aggesu pasādā, aggā vā pasādāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aggappasādā"
      },
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yāvatā"
      },
      "ti yattakā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Apadā"
      },
      "ti nippadā ahimacchādayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dvipadā"
      },
      "ti manussapakkhiādayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Catuppadā"
      },
      "ti hatthiassādayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bahuppadā"
      },
      "ti satapadiādayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nevasaññināsaññino"
      },
      "ti bhavagge nibbattasattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aggamakkhāyatī"
      },
      "ti guṇehi aggo uttamo seṭṭhoti akkhāyati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asaṅkhatā"
      },
      "ti nibbānameva gahetvā vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Virāgo"
      },
      "tiādīni nibbānasseva nāmāni. Tañhi āgamma sabbakilesā virajjanti, sabbe rāgamadādayo madā nimmadā honti, abhāvaṃ gacchanti, sabbā pipāsā vinayaṃ upenti, sabbe ālayā ",
      " samugghātaṃ gacchanti, vaṭṭāni upacchijjanti, taṇhā khīyanti, vaṭṭadukkhā nirujjhanti, sabbe pariḷāhā nibbāyanti. Tasmā etāni nāmāni labhati. Sesamettha uttānatthamevāti."
    ],
    "innerText": "34. Catutthe aggesu pasādā, aggā vā pasādāti aggappasādā. Yāvatāti yattakā. Apadāti nippadā ahimacchādayo. Dvipadāti manussapakkhiādayo. Catuppadāti hatthiassādayo. Bahuppadāti satapadiādayo. Nevasaññināsaññinoti bhavagge nibbattasattā. Aggamakkhāyatīti guṇehi aggo uttamo seṭṭhoti akkhāyati. Asaṅkhatāti nibbānameva gahetvā vuttaṃ. Virāgotiādīni nibbānasseva nāmāni. Tañhi āgamma sabbakilesā virajjanti, sabbe rāgamadādayo madā nimmadā honti, abhāvaṃ gacchanti, sabbā pipāsā vinayaṃ upenti, sabbe ālayā samugghātaṃ gacchanti, vaṭṭāni upacchijjanti, taṇhā khīyanti, vaṭṭadukkhā nirujjhanti, sabbe pariḷāhā nibbāyanti. Tasmā etāni nāmāni labhati. Sesamettha uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Vassakārasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "35"
      },
      ". Pañcame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anussaritā"
      },
      "ti anugantvā saritā, aparāparaṃ sarituṃ samatthoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dakkho"
      },
      "ti cheko. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatrupāyāyā"
      },
      "ti ‘‘imasmiṃ kāle imaṃ nāma kattabba’’nti evaṃ tattha tattha upāyabhūtāya ",
      " paññāya samannāgato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anumoditabba"
      },
      "nti abhinanditabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭikkositabba"
      },
      "nti paṭikkhipitabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Neva kho tyāha"
      },
      "nti neva kho te ahaṃ. Kasmā panetaṃ bhagavā nābhinandati, nappaṭikkhipatīti? Lokiyattā nābhinandati ",
      ", lokiyaṃ atthaṃ gahetvā ṭhitattā nappaṭikkosati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bahussa janatā"
      },
      "ti bahu assa janatā. Idañca karaṇatthe sāmivacanaṃ veditabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ariye ñāye"
      },
      "ti sahavipassanake magge. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kalyāṇadhammatā kusaladhammatā"
      },
      "tipi tasseva nāmāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yaṃ vitakka"
      },
      "nti nekkhammavitakkādīsu aññataraṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na taṃ vitakkaṃ vitakketī"
      },
      "ti kāmavitakkādīsu ekampi na vitakketi. Itaraṃ tasseva vevacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vitakkapathe"
      },
      "ti ettha vitakkoyeva vitakkapatho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ahañhi brāhmaṇā"
      },
      "tiādīsu paṭhamanayena khīṇāsavassa sīlañceva bāhusaccañca kathitaṃ, dutiyatatiyehi khīṇāsavassa kiriyavitakkāni ceva kiriyajjhānāni ca, catutthena khīṇāsavabhāvo kathitoti veditabbo."
    ],
    "innerText": "35. Pañcame anussaritāti anugantvā saritā, aparāparaṃ sarituṃ samatthoti attho. Dakkhoti cheko. Tatrupāyāyāti ‘‘imasmiṃ kāle imaṃ nāma kattabba’’nti evaṃ tattha tattha upāyabhūtāya paññāya samannāgato. Anumoditabbanti abhinanditabbaṃ. Paṭikkositabbanti paṭikkhipitabbaṃ. Neva kho tyāhanti neva kho te ahaṃ. Kasmā panetaṃ bhagavā nābhinandati, nappaṭikkhipatīti? Lokiyattā nābhinandati , lokiyaṃ atthaṃ gahetvā ṭhitattā nappaṭikkosati. Bahussa janatāti bahu assa janatā. Idañca karaṇatthe sāmivacanaṃ veditabbaṃ. Ariye ñāyeti sahavipassanake magge. Kalyāṇadhammatā kusaladhammatātipi tasseva nāmāni. Yaṃ vitakkanti nekkhammavitakkādīsu aññataraṃ. Na taṃ vitakkaṃ vitakketīti kāmavitakkādīsu ekampi na vitakketi. Itaraṃ tasseva vevacanaṃ. Vitakkapatheti ettha vitakkoyeva vitakkapatho. Ahañhi brāhmaṇātiādīsu paṭhamanayena khīṇāsavassa sīlañceva bāhusaccañca kathitaṃ, dutiyatatiyehi khīṇāsavassa kiriyavitakkāni ceva kiriyajjhānāni ca, catutthena khīṇāsavabhāvo kathitoti veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Maccupāsappamocana"
      },
      "nti maccupāsā pamocanakaṃ maggaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñāyaṃ dhamma"
      },
      "nti sahavipassanakaṃ maggaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Disvā ca sutvā cā"
      },
      "ti ñāṇeneva passitvā ca suṇitvā ca. Sesamettha uttānameva."
    ],
    "innerText": "Maccupāsappamocananti maccupāsā pamocanakaṃ maggaṃ. Ñāyaṃ dhammanti sahavipassanakaṃ maggaṃ. Disvā ca sutvā cāti ñāṇeneva passitvā ca suṇitvā ca. Sesamettha uttānameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Doṇasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "36"
      },
      ". Chaṭṭhe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "antarā ca ukkaṭṭhaṃ antarā ca setabya"
      },
      "nti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ukkaṭṭhā"
      },
      "ti ukkāhi dhārīyamānāhi māpitattā evaṃladdhavohāraṃ nagaraṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Setabya"
      },
      "nti atīte kassapasammāsambuddhassa jātanagaraṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Antarā"
      },
      "saddo pana kāraṇakhaṇacittavemajjhavivarādīsu vattati. ‘‘Tadantaraṃ ko jāneyya aññatra tathāgatā’’ti ",
      " (a. ni. 6.44; 10.75) ca, ‘‘janā ",
      " saṅgamma mantenti, mañca tañca kimantara’’nti ca ādīsu (saṃ. ni. 1.228) kāraṇe. ‘‘Addasā maṃ, bhante, aññatarā itthī vijjantarikāya bhājanaṃ dhovantī’’tiādīsu (ma. ni. 2.149) khaṇe. ‘‘Yassantarato na santi kopā’’tiādīsu (udā. 20) citte. ‘‘Antarāvosānamāpādī’’tiādīsu vemajjhe. ‘‘Apicāyaṃ tapodā dvinnaṃ mahānirayānaṃ antarikāya āgacchatī’’tiādīsu (pārā. 231) vivare. Svāyamidha vivare vattati. Tasmā ukkaṭṭhāya ca setabyassa ca vivareti evamettha attho daṭṭhabbo. Antarāsaddena pana yuttattā upayogavacanaṃ kataṃ. Īdisesu ca ṭhānesu akkharacintakā ‘‘antarā gāmañca nadiñca yātī’’ti ",
      " evaṃ ekameva antarāsaddaṃ payuñjanti, so dutiyapadenapi yojetabbo hoti, ayojiyamāne upayogavacanaṃ na pāpuṇāti. Idha pana yojetvā eva vutto."
    ],
    "innerText": "36. Chaṭṭhe antarā ca ukkaṭṭhaṃ antarā ca setabyanti ettha ukkaṭṭhāti ukkāhi dhārīyamānāhi māpitattā evaṃladdhavohāraṃ nagaraṃ. Setabyanti atīte kassapasammāsambuddhassa jātanagaraṃ. Antarāsaddo pana kāraṇakhaṇacittavemajjhavivarādīsu vattati. ‘‘Tadantaraṃ ko jāneyya aññatra tathāgatā’’ti (a. ni. 6.44; 10.75) ca, ‘‘janā saṅgamma mantenti, mañca tañca kimantara’’nti ca ādīsu (saṃ. ni. 1.228) kāraṇe. ‘‘Addasā maṃ, bhante, aññatarā itthī vijjantarikāya bhājanaṃ dhovantī’’tiādīsu (ma. ni. 2.149) khaṇe. ‘‘Yassantarato na santi kopā’’tiādīsu (udā. 20) citte. ‘‘Antarāvosānamāpādī’’tiādīsu vemajjhe. ‘‘Apicāyaṃ tapodā dvinnaṃ mahānirayānaṃ antarikāya āgacchatī’’tiādīsu (pārā. 231) vivare. Svāyamidha vivare vattati. Tasmā ukkaṭṭhāya ca setabyassa ca vivareti evamettha attho daṭṭhabbo. Antarāsaddena pana yuttattā upayogavacanaṃ kataṃ. Īdisesu ca ṭhānesu akkharacintakā ‘‘antarā gāmañca nadiñca yātī’’ti evaṃ ekameva antarāsaddaṃ payuñjanti, so dutiyapadenapi yojetabbo hoti, ayojiyamāne upayogavacanaṃ na pāpuṇāti. Idha pana yojetvā eva vutto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Addhānamaggappaṭipanno hotī"
      },
      "ti addhānasaṅkhātaṃ maggaṃ paṭipanno hoti, dīghamagganti attho. Kasmā paṭipannoti? Taṃ divasaṃ kira bhagavā idaṃ addasa ‘‘mayi taṃ maggaṃ paṭipanne doṇo brāhmaṇo mama padacetiyāni passitvā padānupadiko hutvā mama nisinnaṭṭhānaṃ āgantvā pañhaṃ pucchissati. Athassāhaṃ ekaṃ saccadhammaṃ desessāmi ",
      ". Brāhmaṇo tīṇi sāmaññaphalāni paṭivijjhitvā dvādasapadasahassaparimāṇaṃ doṇagajjitaṃ nāma vaṇṇaṃ vatvā mayi parinibbute sakalajambudīpe uppannaṃ mahākalahaṃ vūpasametvā dhātuyo bhājessatī’’ti. Iminā kāraṇena paṭipanno. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Doṇopi sudaṃ brāhmaṇo"
      },
      "ti doṇo brāhmaṇopi tayo vede paguṇe katvā pañcasate māṇavake sippaṃ vācento taṃdivasaṃ pātova uṭṭhāya sarīrapaṭijagganaṃ katvā satagghanakaṃ nivāsetvā pañcasatagghanakaṃ ekaṃsavaragataṃ katvā āmuttayaññasutto rattavaṭṭikā upāhanā ārohitvā pañcasatamāṇavakaparivāro tameva maggaṃ paṭipajji. Taṃ sandhāyetaṃ vuttaṃ."
    ],
    "innerText": "Addhānamaggappaṭipanno hotīti addhānasaṅkhātaṃ maggaṃ paṭipanno hoti, dīghamagganti attho. Kasmā paṭipannoti? Taṃ divasaṃ kira bhagavā idaṃ addasa ‘‘mayi taṃ maggaṃ paṭipanne doṇo brāhmaṇo mama padacetiyāni passitvā padānupadiko hutvā mama nisinnaṭṭhānaṃ āgantvā pañhaṃ pucchissati. Athassāhaṃ ekaṃ saccadhammaṃ desessāmi . Brāhmaṇo tīṇi sāmaññaphalāni paṭivijjhitvā dvādasapadasahassaparimāṇaṃ doṇagajjitaṃ nāma vaṇṇaṃ vatvā mayi parinibbute sakalajambudīpe uppannaṃ mahākalahaṃ vūpasametvā dhātuyo bhājessatī’’ti. Iminā kāraṇena paṭipanno. Doṇopi sudaṃ brāhmaṇoti doṇo brāhmaṇopi tayo vede paguṇe katvā pañcasate māṇavake sippaṃ vācento taṃdivasaṃ pātova uṭṭhāya sarīrapaṭijagganaṃ katvā satagghanakaṃ nivāsetvā pañcasatagghanakaṃ ekaṃsavaragataṃ katvā āmuttayaññasutto rattavaṭṭikā upāhanā ārohitvā pañcasatamāṇavakaparivāro tameva maggaṃ paṭipajji. Taṃ sandhāyetaṃ vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pādesū"
      },
      "ti pādehi akkantaṭṭhānesu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cakkānī"
      },
      "ti lakkhaṇacakkāni. Kiṃ pana bhagavato gacchantassa akkantaṭṭhāne padaṃ paññāyatīti? Na paññāyati ",
      ". Kasmā? Sukhumattā mahābalattā mahājanānuggahena ca. Buddhānañhi sukhumacchavitāya akkantaṭṭhānaṃ tūlapicuno patiṭṭhitaṭṭhānaṃ viya hoti, padavaḷañjo na paññāyati. Yathā ca balavato vātajavasindhavassa paduminipattepi akkantamattameva hoti, evaṃ mahābalatāya tathāgatena akkantaṭṭhānaṃ akkantamattameva hoti, na tattha padavaḷañjo paññāyati. Buddhānañca anupadaṃ mahājanakāyo ",
      " gacchati, tassa satthu padavaḷañjaṃ disvā maddituṃ avisahantassa gamanavicchedo bhaveyya. Tasmā akkantaakkantaṭṭhāne yopi padavaḷañjo bhaveyya, so antaradhāyateva. Doṇo pana brāhmaṇo tathāgatassa adhiṭṭhānavasena passi. Bhagavā hi yassa padacetiyaṃ dassetukāmo hoti, taṃ ārabbha ‘‘asuko nāma passatū’’ti adhiṭṭhāti. Tasmā māgaṇḍiyabrāhmaṇo viya ayampi brāhmaṇo tathāgatassa adhiṭṭhānavasena addasa."
    ],
    "innerText": "Pādesūti pādehi akkantaṭṭhānesu. Cakkānīti lakkhaṇacakkāni. Kiṃ pana bhagavato gacchantassa akkantaṭṭhāne padaṃ paññāyatīti? Na paññāyati . Kasmā? Sukhumattā mahābalattā mahājanānuggahena ca. Buddhānañhi sukhumacchavitāya akkantaṭṭhānaṃ tūlapicuno patiṭṭhitaṭṭhānaṃ viya hoti, padavaḷañjo na paññāyati. Yathā ca balavato vātajavasindhavassa paduminipattepi akkantamattameva hoti, evaṃ mahābalatāya tathāgatena akkantaṭṭhānaṃ akkantamattameva hoti, na tattha padavaḷañjo paññāyati. Buddhānañca anupadaṃ mahājanakāyo gacchati, tassa satthu padavaḷañjaṃ disvā maddituṃ avisahantassa gamanavicchedo bhaveyya. Tasmā akkantaakkantaṭṭhāne yopi padavaḷañjo bhaveyya, so antaradhāyateva. Doṇo pana brāhmaṇo tathāgatassa adhiṭṭhānavasena passi. Bhagavā hi yassa padacetiyaṃ dassetukāmo hoti, taṃ ārabbha ‘‘asuko nāma passatū’’ti adhiṭṭhāti. Tasmā māgaṇḍiyabrāhmaṇo viya ayampi brāhmaṇo tathāgatassa adhiṭṭhānavasena addasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāsādika"
      },
      "nti pasādajanakaṃ. Itaraṃ tasseva vevacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uttamadamathasamathamanuppatta"
      },
      "nti ettha uttamadamatho nāma arahattamaggo, uttamasamatho nāma arahattamaggasamādhi, tadubhayaṃ pattanti attho ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Danta"
      },
      "nti nibbisevanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gutta"
      },
      "nti gopitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṃyatindriya"
      },
      "nti rakkhitindriyaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nāga"
      },
      "nti chandādīhi agacchanato, pahīnakilese puna anāgacchanato, āguṃ akaraṇato, balavantaṭṭhenāti catūhi kāraṇehi nāgaṃ."
    ],
    "innerText": "Pāsādikanti pasādajanakaṃ. Itaraṃ tasseva vevacanaṃ. Uttamadamathasamathamanuppattanti ettha uttamadamatho nāma arahattamaggo, uttamasamatho nāma arahattamaggasamādhi, tadubhayaṃ pattanti attho . Dantanti nibbisevanaṃ. Guttanti gopitaṃ. Saṃyatindriyanti rakkhitindriyaṃ. Nāganti chandādīhi agacchanato, pahīnakilese puna anāgacchanato, āguṃ akaraṇato, balavantaṭṭhenāti catūhi kāraṇehi nāgaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Devo no bhavaṃ bhavissatī"
      },
      "ti ettha ‘‘devo no bhava’’nti ettāvatāpi pucchā niṭṭhitā bhaveyya, ayaṃ pana brāhmaṇo ‘‘anāgate mahesakkho eko devarājā bhavissatī’’ti anāgatavasena pucchāsabhāgeneva kathento evamāha. Bhagavāpissa pucchāsabhāgeneva kathento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na kho ahaṃ, brāhmaṇa, devo bhavissāmī"
      },
      "ti āha. Esa nayo sabbattha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āsavāna"
      },
      "nti ",
      " kāmāsavādīnaṃ catunnaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pahīnā"
      },
      "ti bodhipallaṅke sabbaññutaññāṇādhigameneva pahīnā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anupalitto lokenā"
      },
      "ti taṇhādiṭṭhilepānaṃ pahīnattā saṅkhāralokena anupalitto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Buddho"
      },
      "ti catunnaṃ saccānaṃ buddhattā buddho iti maṃ dhārehi."
    ],
    "innerText": "Devo no bhavaṃ bhavissatīti ettha ‘‘devo no bhava’’nti ettāvatāpi pucchā niṭṭhitā bhaveyya, ayaṃ pana brāhmaṇo ‘‘anāgate mahesakkho eko devarājā bhavissatī’’ti anāgatavasena pucchāsabhāgeneva kathento evamāha. Bhagavāpissa pucchāsabhāgeneva kathento na kho ahaṃ, brāhmaṇa, devo bhavissāmīti āha. Esa nayo sabbattha. Āsavānanti kāmāsavādīnaṃ catunnaṃ. Pahīnāti bodhipallaṅke sabbaññutaññāṇādhigameneva pahīnā. Anupalitto lokenāti taṇhādiṭṭhilepānaṃ pahīnattā saṅkhāralokena anupalitto. Buddhoti catunnaṃ saccānaṃ buddhattā buddho iti maṃ dhārehi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yenā"
      },
      "ti yena āsavena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Devūpapatyassā"
      },
      "ti devūpapatti assa mayhaṃ bhaveyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vihaṅgamo"
      },
      "ti ākāsacaro gandhabbakāyikadevo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Viddhastā"
      },
      "ti ",
      " vidhamitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vinaḷīkatā"
      },
      "ti vigatanaḷā vigatabandhanā katā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vaggū"
      },
      "ti sundaraṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Toyena nupalippatī"
      },
      "ti udakato ratanamattaṃ accuggamma ṭhitaṃ saraṃ sobhayamānaṃ bhamaragaṇaṃ hāsayamānaṃ toyena na lippati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasmā buddhosmi brāhmaṇā"
      },
      "ti desanāpariyosāne tīṇi maggaphalāni pāpuṇitvā dvādasahi padasahassehi doṇagajjitaṃ nāma vaṇṇaṃ kathesi, tathāgate ca parinibbute jambudīpatale uppannaṃ mahākalahaṃ vūpasametvā dhātuyo bhājesīti."
    ],
    "innerText": "Yenāti yena āsavena. Devūpapatyassāti devūpapatti assa mayhaṃ bhaveyya. Vihaṅgamoti ākāsacaro gandhabbakāyikadevo. Viddhastāti vidhamitā. Vinaḷīkatāti vigatanaḷā vigatabandhanā katā. Vaggūti sundaraṃ. Toyena nupalippatīti udakato ratanamattaṃ accuggamma ṭhitaṃ saraṃ sobhayamānaṃ bhamaragaṇaṃ hāsayamānaṃ toyena na lippati. Tasmā buddhosmi brāhmaṇāti desanāpariyosāne tīṇi maggaphalāni pāpuṇitvā dvādasahi padasahassehi doṇagajjitaṃ nāma vaṇṇaṃ kathesi, tathāgate ca parinibbute jambudīpatale uppannaṃ mahākalahaṃ vūpasametvā dhātuyo bhājesīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Aparihāniyasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "37"
      },
      ". Sattame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nibbānasseva santike"
      },
      "ti nibbānasantikeyeva carati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sīle patiṭṭhito"
      },
      "ti pātimokkhasīle patiṭṭhito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vihārī"
      },
      "ti evaṃ viharanto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ātāpī"
      },
      "ti ātāpena vīriyena samannāgato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yogakkhemassā"
      },
      "ti catūhi yogehi khemassa nibbānassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pamāde bhayadassivā"
      },
      "ti pamādaṃ bhayato passanto."
    ],
    "innerText": "37. Sattame nibbānasseva santiketi nibbānasantikeyeva carati. Sīle patiṭṭhitoti pātimokkhasīle patiṭṭhito. Evaṃvihārīti evaṃ viharanto. Ātāpīti ātāpena vīriyena samannāgato. Yogakkhemassāti catūhi yogehi khemassa nibbānassa. Pamāde bhayadassivāti pamādaṃ bhayato passanto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Patilīnasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "38"
      },
      ". Aṭṭhame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "panuṇṇapaccekasacco"
      },
      "ti ‘‘idameva dassanaṃ saccaṃ, idameva sacca’’nti evaṃ pāṭiekkaṃ gahitattā paccekasaṅkhātāni diṭṭhisaccāni panuṇṇāni nīhaṭāni pahīnāni assāti panuṇṇapaccekasacco. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samavayasaṭṭhesano"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avayā"
      },
      "ti anūnā, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṭṭhā"
      },
      "ti vissaṭṭhā, sammā avayā saṭṭhā esanā assāti samavayasaṭṭhesano, sammā vissaṭṭhasabbaesanoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Patilīno"
      },
      "ti nilīno ekībhāvaṃ upagato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puthusamaṇabrāhmaṇāna"
      },
      "nti bahūnaṃ samaṇabrāhmaṇānaṃ. Ettha ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samaṇā"
      },
      "ti pabbajjūpagatā, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "brāhmaṇā"
      },
      "ti bhovādino. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puthupaccekasaccānī"
      },
      "ti bahūni pāṭekkasaccāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nuṇṇānī"
      },
      "ti nīhaṭāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Panuṇṇānī"
      },
      "ti suṭṭhu nīhaṭāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cattānī"
      },
      "ti vissaṭṭhāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vantānī"
      },
      "ti vamitāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Muttānī"
      },
      "ti chinnabandhanāni katāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pahīnānī"
      },
      "ti pajahitāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭinissaṭṭhānī"
      },
      "ti yathā na puna cittaṃ ārohanti, evaṃ paṭinissajjitāni. Sabbānevetāni ",
      " gahitagahaṇassa vissaṭṭhabhāvavevacanāni."
    ],
    "innerText": "38. Aṭṭhame panuṇṇapaccekasaccoti ‘‘idameva dassanaṃ saccaṃ, idameva sacca’’nti evaṃ pāṭiekkaṃ gahitattā paccekasaṅkhātāni diṭṭhisaccāni panuṇṇāni nīhaṭāni pahīnāni assāti panuṇṇapaccekasacco. Samavayasaṭṭhesanoti ettha avayāti anūnā, saṭṭhāti vissaṭṭhā, sammā avayā saṭṭhā esanā assāti samavayasaṭṭhesano, sammā vissaṭṭhasabbaesanoti attho. Patilīnoti nilīno ekībhāvaṃ upagato. Puthusamaṇabrāhmaṇānanti bahūnaṃ samaṇabrāhmaṇānaṃ. Ettha ca samaṇāti pabbajjūpagatā, brāhmaṇāti bhovādino. Puthupaccekasaccānīti bahūni pāṭekkasaccāni. Nuṇṇānīti nīhaṭāni. Panuṇṇānīti suṭṭhu nīhaṭāni. Cattānīti vissaṭṭhāni. Vantānīti vamitāni. Muttānīti chinnabandhanāni katāni. Pahīnānīti pajahitāni. Paṭinissaṭṭhānīti yathā na puna cittaṃ ārohanti, evaṃ paṭinissajjitāni. Sabbānevetāni gahitagahaṇassa vissaṭṭhabhāvavevacanāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāmesanā pahīnā hotī"
      },
      "ti anāgāmimaggena pahīnā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhavesanā"
      },
      " pana arahattamaggena pahīyati. ‘‘Brahmacariyaṃ esissāmi gavesissāmī’’ti evaṃ ",
      " pavattajjhāsayasaṅkhātā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "brahmacariyesanā"
      },
      "pi arahattamaggeneva paṭippassaddhiṃ vūpasamaṃ gacchati. Diṭṭhibrahmacariyesanā pana sotāpattimaggeneva paṭippasambhatīti veditabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ kho, bhikkhave"
      },
      "ti evaṃ catutthajjhānena passaddhakāyasaṅkhāro vūpasantaassāsapassāso nāma hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asmimāno"
      },
      "ti asmīti uppajjanako navavidhamāno."
    ],
    "innerText": "Kāmesanā pahīnā hotīti anāgāmimaggena pahīnā. Bhavesanā pana arahattamaggena pahīyati. ‘‘Brahmacariyaṃ esissāmi gavesissāmī’’ti evaṃ pavattajjhāsayasaṅkhātā brahmacariyesanāpi arahattamaggeneva paṭippassaddhiṃ vūpasamaṃ gacchati. Diṭṭhibrahmacariyesanā pana sotāpattimaggeneva paṭippasambhatīti veditabbā. Evaṃ kho, bhikkhaveti evaṃ catutthajjhānena passaddhakāyasaṅkhāro vūpasantaassāsapassāso nāma hoti. Asmimānoti asmīti uppajjanako navavidhamāno."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Gāthāsu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāmesanā bhavesanā"
      },
      "ti etā dve esanā, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "brahmacariyesanā sahā"
      },
      "ti tāhiyeva saha brahmacariyesanāti tissopi etā. Idha ṭhatvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "esanā paṭinissaṭṭhā"
      },
      "ti iminā padena saddhiṃ yojanā kātabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iti saccaparāmāso, diṭṭhiṭṭhānā samussayā"
      },
      "ti ‘‘iti saccaṃ iti sacca’’nti gahaṇaparāmāso ca diṭṭhisaṅkhātāyeva diṭṭhiṭṭhānā ca ye samussitattā uggantvā ṭhitattā samussayāti vuccanti, te sabbepi. Idha ṭhatvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "diṭṭhiṭṭhānā samūhatā"
      },
      "ti iminā padena saddhiṃ yojanā kātabbā. Kassa pana etā esanā paṭinissaṭṭhā, ete ca diṭṭhiṭṭhānā samūhatāti? ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbarāgavirattassa taṇhākkhayavimuttino"
      },
      ". Yo hi sabbarāgehipi viratto, taṇhākkhaye ca nibbāne pavattāya ",
      " arahattaphalavimuttiyā samannāgato, etassa esanā paṭinissaṭṭhā, diṭṭhiṭṭhānā ca samūhatā ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sa ve santo"
      },
      "ti so evarūpo kilesasantatāya santo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Passaddho"
      },
      "ti dvīhi kāyacittapassaddhīhi passaddho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aparājito"
      },
      "ti sabbakilese jinitvā ṭhitattā kenaci aparājito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mānābhisamayā"
      },
      "ti mānassa pahānābhisamayena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Buddho"
      },
      "ti cattāri saccāni bujjhitvā ṭhito. Iti imasmiṃ suttepi gāthāsupi khīṇāsavova kathitoti."
    ],
    "innerText": "Gāthāsu kāmesanā bhavesanāti etā dve esanā, brahmacariyesanā sahāti tāhiyeva saha brahmacariyesanāti tissopi etā. Idha ṭhatvā esanā paṭinissaṭṭhāti iminā padena saddhiṃ yojanā kātabbā. Iti saccaparāmāso, diṭṭhiṭṭhānā samussayāti ‘‘iti saccaṃ iti sacca’’nti gahaṇaparāmāso ca diṭṭhisaṅkhātāyeva diṭṭhiṭṭhānā ca ye samussitattā uggantvā ṭhitattā samussayāti vuccanti, te sabbepi. Idha ṭhatvā diṭṭhiṭṭhānā samūhatāti iminā padena saddhiṃ yojanā kātabbā. Kassa pana etā esanā paṭinissaṭṭhā, ete ca diṭṭhiṭṭhānā samūhatāti? Sabbarāgavirattassa taṇhākkhayavimuttino. Yo hi sabbarāgehipi viratto, taṇhākkhaye ca nibbāne pavattāya arahattaphalavimuttiyā samannāgato, etassa esanā paṭinissaṭṭhā, diṭṭhiṭṭhānā ca samūhatā . Sa ve santoti so evarūpo kilesasantatāya santo. Passaddhoti dvīhi kāyacittapassaddhīhi passaddho. Aparājitoti sabbakilese jinitvā ṭhitattā kenaci aparājito. Mānābhisamayāti mānassa pahānābhisamayena. Buddhoti cattāri saccāni bujjhitvā ṭhito. Iti imasmiṃ suttepi gāthāsupi khīṇāsavova kathitoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Ujjayasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "39"
      },
      ". Navame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṅghātaṃ āpajjantī"
      },
      "ti vadhaṃ maraṇaṃ āpajjanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Niccadāna"
      },
      "nti salākabhattaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anukulayañña"
      },
      "nti amhākaṃ pitūhi pitāmahehi dinnattā evaṃ kulānukulavasena yajitabbaṃ, dātabbanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Assamedha"
      },
      "ntiādīsu assamettha medhantīti assamedho, dvīhi pariyaññehi yajitabbassa ekavīsatiyūpassa ṭhapetvā bhūmiñca purise ca avasesasabbavibhavadakkhiṇassa yaññassetaṃ adhivacanaṃ. Purisamettha medhantīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "purisamedho,"
      },
      " catūhi ",
      " pariyaññehi yajitabbassa saddhiṃ bhūmiyā assamedhe vuttavibhavadakkhiṇassa yaññassetaṃ adhivacanaṃ. Sammamettha pāsantīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammāpāso,"
      },
      " divase divase sammaṃ khipitvā tassa patitokāse vediṃ katvā saṃhārimehi yūpādīhi sarassatinadiyā nimuggokāsato pabhuti paṭilomaṃ gacchantena yajitabbassa sabbayāgassetaṃ adhivacanaṃ. Vājamettha pivantīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vājapeyyaṃ,"
      },
      " ekena pariyaññena sattarasahi pasūhi yajitabbassa beluvayūpassa sattarasakadakkhiṇassa yaññassetaṃ adhivacanaṃ. Natthi ",
      " ettha aggaḷāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "niraggaḷo"
      },
      ". Navahi pariyaññehi yajitabbassa saddhiṃ bhūmiyā purisehi ca assamedhe vuttavibhavadakkhiṇassa sabbamedhapariyāyanāmassa assamedhavikappassetaṃ adhivacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahārambhā"
      },
      "ti mahākiccā mahākaraṇīyā. Apica pāṇātipātasamārambhassa mahantatāyapi mahārambhāyeva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na te honti mahapphalā"
      },
      "ti ettha niravasesatthe sāvasesarūpanaṃ kataṃ. Tasmā iṭṭhaphalena nipphalāva hontīti attho. Idañca pāṇātipātasamārambhameva sandhāya vuttaṃ. Yaṃ pana tattha antarantarā dānaṃ diyyati, taṃ iminā samārambhena upahatattā mahapphalaṃ na hoti, mandaphalaṃ hotīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Haññare"
      },
      "ti haññanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yajanti anukulaṃ sadā"
      },
      "ti ye aññe anukulaṃ yajanti, pubbapurisehi yiṭṭhattā pacchimapurisāpi yajantīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Seyyo hotī"
      },
      "ti visesova hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na pāpiyo"
      },
      "ti pāpaṃ kiñci na hoti."
    ],
    "innerText": "39. Navame saṅghātaṃ āpajjantīti vadhaṃ maraṇaṃ āpajjanti. Niccadānanti salākabhattaṃ. Anukulayaññanti amhākaṃ pitūhi pitāmahehi dinnattā evaṃ kulānukulavasena yajitabbaṃ, dātabbanti attho. Assamedhantiādīsu assamettha medhantīti assamedho, dvīhi pariyaññehi yajitabbassa ekavīsatiyūpassa ṭhapetvā bhūmiñca purise ca avasesasabbavibhavadakkhiṇassa yaññassetaṃ adhivacanaṃ. Purisamettha medhantīti purisamedho, catūhi pariyaññehi yajitabbassa saddhiṃ bhūmiyā assamedhe vuttavibhavadakkhiṇassa yaññassetaṃ adhivacanaṃ. Sammamettha pāsantīti sammāpāso, divase divase sammaṃ khipitvā tassa patitokāse vediṃ katvā saṃhārimehi yūpādīhi sarassatinadiyā nimuggokāsato pabhuti paṭilomaṃ gacchantena yajitabbassa sabbayāgassetaṃ adhivacanaṃ. Vājamettha pivantīti vājapeyyaṃ, ekena pariyaññena sattarasahi pasūhi yajitabbassa beluvayūpassa sattarasakadakkhiṇassa yaññassetaṃ adhivacanaṃ. Natthi ettha aggaḷāti niraggaḷo. Navahi pariyaññehi yajitabbassa saddhiṃ bhūmiyā purisehi ca assamedhe vuttavibhavadakkhiṇassa sabbamedhapariyāyanāmassa assamedhavikappassetaṃ adhivacanaṃ. Mahārambhāti mahākiccā mahākaraṇīyā. Apica pāṇātipātasamārambhassa mahantatāyapi mahārambhāyeva. Na te honti mahapphalāti ettha niravasesatthe sāvasesarūpanaṃ kataṃ. Tasmā iṭṭhaphalena nipphalāva hontīti attho. Idañca pāṇātipātasamārambhameva sandhāya vuttaṃ. Yaṃ pana tattha antarantarā dānaṃ diyyati, taṃ iminā samārambhena upahatattā mahapphalaṃ na hoti, mandaphalaṃ hotīti attho. Haññareti haññanti. Yajanti anukulaṃ sadāti ye aññe anukulaṃ yajanti, pubbapurisehi yiṭṭhattā pacchimapurisāpi yajantīti attho. Seyyo hotīti visesova hoti. Na pāpiyoti pāpaṃ kiñci na hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Udāyisuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "40"
      },
      ". Dasame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhisaṅkhata"
      },
      "nti rāsikataṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nirārambha"
      },
      "nti pāṇasamārambharahitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yañña"
      },
      "nti deyyadhammaṃ. Tañhi yajitabbattā yaññanti vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kālenā"
      },
      "ti yuttappattakālena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upasaṃyantī"
      },
      "ti upagacchanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kulaṃ gati"
      },
      "nti vaṭṭakulañceva vaṭṭagatiñca atikkantā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yaññassa"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kovidā"
      },
      "ti catubhūmakayaññe kusalā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yaññe"
      },
      "ti pakatidāne. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddhe"
      },
      "ti matakadāne. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Habyaṃ katvā"
      },
      "ti hunitabbaṃ deyyadhammaṃ upakappetvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sukhette brahmacārisū"
      },
      "ti brahmacārisaṅkhāte sukhettamhīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suppatta"
      },
      "nti suṭṭhu pattaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dakkhiṇeyyesu yaṃ kata"
      },
      "nti yaṃ dakkhiṇāya ",
      " anucchavikesu upakappitaṃ, taṃ suhutaṃ suyiṭṭhaṃ suppattanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddho"
      },
      "ti buddhadhammasaṅghaguṇānaṃ saddahanatāya saddho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Muttena cetasā"
      },
      "ti vissaṭṭhena cittena. Imināssa muttacāgaṃ dīpetīti."
    ],
    "innerText": "40. Dasame abhisaṅkhatanti rāsikataṃ. Nirārambhanti pāṇasamārambharahitaṃ. Yaññanti deyyadhammaṃ. Tañhi yajitabbattā yaññanti vuccati. Kālenāti yuttappattakālena. Upasaṃyantīti upagacchanti. Kulaṃ gatinti vaṭṭakulañceva vaṭṭagatiñca atikkantā. Yaññassakovidāti catubhūmakayaññe kusalā. Yaññeti pakatidāne. Saddheti matakadāne. Habyaṃ katvāti hunitabbaṃ deyyadhammaṃ upakappetvā. Sukhette brahmacārisūti brahmacārisaṅkhāte sukhettamhīti attho. Suppattanti suṭṭhu pattaṃ. Dakkhiṇeyyesu yaṃ katanti yaṃ dakkhiṇāya anucchavikesu upakappitaṃ, taṃ suhutaṃ suyiṭṭhaṃ suppattanti attho. Saddhoti buddhadhammasaṅghaguṇānaṃ saddahanatāya saddho. Muttena cetasāti vissaṭṭhena cittena. Imināssa muttacāgaṃ dīpetīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Cakkavaggo catuttho."
  }
]