[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "(24) 4. Āvāsikavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Āvāsikasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "231"
      },
      ". ‘‘Pañcahi ",
      ", bhikkhave, dhammehi samannāgato āvāsiko bhikkhu abhāvanīyo hoti. Katamehi pañcahi? Na ākappasampanno hoti na vattasampanno; na bahussuto hoti na sutadharo; na paṭisallekhitā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sallekhitā (ka. sī.)]"
      },
      " hoti na paṭisallānārāmo; na kalyāṇavāco hoti na kalyāṇavākkaraṇo; duppañño hoti jaḷo eḷamūgo. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu abhāvanīyo hoti."
    ],
    "innerText": "231. ‘‘Pañcahi , bhikkhave, dhammehi samannāgato āvāsiko bhikkhu abhāvanīyo hoti. Katamehi pañcahi? Na ākappasampanno hoti na vattasampanno; na bahussuto hoti na sutadharo; na paṭisallekhitā [sallekhitā (ka. sī.)] hoti na paṭisallānārāmo; na kalyāṇavāco hoti na kalyāṇavākkaraṇo; duppañño hoti jaḷo eḷamūgo. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu abhāvanīyo hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Pañcahi, bhikkhave, dhammehi samannāgato āvāsiko bhikkhu bhāvanīyo hoti. Katamehi pañcahi? Ākappasampanno ",
      " hoti vattasampanno; bahussuto hoti sutadharo; paṭisallekhitā hoti paṭisallānārāmo; kalyāṇavāco hoti kalyāṇavākkaraṇo; paññavā hoti ajaḷo ",
      " aneḷamūgo. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu bhāvanīyo hotī’’ti. Paṭhamaṃ."
    ],
    "innerText": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato āvāsiko bhikkhu bhāvanīyo hoti. Katamehi pañcahi? Ākappasampanno hoti vattasampanno; bahussuto hoti sutadharo; paṭisallekhitā hoti paṭisallānārāmo; kalyāṇavāco hoti kalyāṇavākkaraṇo; paññavā hoti ajaḷo aneḷamūgo. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu bhāvanīyo hotī’’ti. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Piyasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "232"
      },
      ". ‘‘Pañcahi, bhikkhave, dhammehi samannāgato āvāsiko bhikkhu sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo ca."
    ],
    "innerText": "232. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato āvāsiko bhikkhu sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamehi pañcahi? Sīlavā hoti, pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu; bahussuto hoti sutadharo sutasannicayo, ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ ",
      " parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpāssa dhammā bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā ",
      "; kalyāṇavāco hoti kalyāṇavākkaraṇo poriyā vācāya samannāgato vissaṭṭhāya anelagalāya atthassa viññāpaniyā; catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī; āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo cā’’ti. Dutiyaṃ."
    ],
    "innerText": "‘‘Katamehi pañcahi? Sīlavā hoti, pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu; bahussuto hoti sutadharo sutasannicayo, ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpāssa dhammā bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā ; kalyāṇavāco hoti kalyāṇavākkaraṇo poriyā vācāya samannāgato vissaṭṭhāya anelagalāya atthassa viññāpaniyā; catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī; āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo cā’’ti. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Sobhanasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "233"
      },
      ". ‘‘Pañcahi, bhikkhave, dhammehi samannāgato āvāsiko bhikkhu āvāsaṃ sobheti. Katamehi pañcahi? Sīlavā ",
      " hoti…pe… samādāya sikkhati sikkhāpadesu; bahussuto hoti…pe… diṭṭhiyā suppaṭividdhā; kalyāṇavāco hoti kalyāṇavākkaraṇo poriyā vācāya samannāgato vissaṭṭhāya anelagalāya atthassa viññāpaniyā; paṭibalo hoti upasaṅkamante dhammiyā kathāya sandassetuṃ samādapetuṃ samuttejetuṃ sampahaṃsetuṃ; catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu āvāsaṃ sobhetī’’ti. Tatiyaṃ."
    ],
    "innerText": "233. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato āvāsiko bhikkhu āvāsaṃ sobheti. Katamehi pañcahi? Sīlavā hoti…pe… samādāya sikkhati sikkhāpadesu; bahussuto hoti…pe… diṭṭhiyā suppaṭividdhā; kalyāṇavāco hoti kalyāṇavākkaraṇo poriyā vācāya samannāgato vissaṭṭhāya anelagalāya atthassa viññāpaniyā; paṭibalo hoti upasaṅkamante dhammiyā kathāya sandassetuṃ samādapetuṃ samuttejetuṃ sampahaṃsetuṃ; catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu āvāsaṃ sobhetī’’ti. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Bahūpakārasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "234"
      },
      ". ‘‘Pañcahi ",
      ", bhikkhave, dhammehi samannāgato āvāsiko bhikkhu āvāsassa ",
      " bahūpakāro hoti. Katamehi pañcahi? Sīlavā hoti…pe… samādāya sikkhati sikkhāpadesu; bahussuto hoti…pe… diṭṭhiyā suppaṭividdhā; khaṇḍaphullaṃ paṭisaṅkharoti; mahā kho pana bhikkhusaṅgho abhikkanto nānāverajjakā bhikkhū gihīnaṃ upasaṅkamitvā āroceti – ‘mahā kho, āvuso, bhikkhusaṅgho abhikkanto nānāverajjakā bhikkhū, karotha puññāni, samayo puññāni kātu’nti; catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu āvāsassa bahūpakāro hotī’’ti. Catutthaṃ."
    ],
    "innerText": "234. ‘‘Pañcahi , bhikkhave, dhammehi samannāgato āvāsiko bhikkhu āvāsassa bahūpakāro hoti. Katamehi pañcahi? Sīlavā hoti…pe… samādāya sikkhati sikkhāpadesu; bahussuto hoti…pe… diṭṭhiyā suppaṭividdhā; khaṇḍaphullaṃ paṭisaṅkharoti; mahā kho pana bhikkhusaṅgho abhikkanto nānāverajjakā bhikkhū gihīnaṃ upasaṅkamitvā āroceti – ‘mahā kho, āvuso, bhikkhusaṅgho abhikkanto nānāverajjakā bhikkhū, karotha puññāni, samayo puññāni kātu’nti; catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu āvāsassa bahūpakāro hotī’’ti. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Anukampasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "235"
      },
      ". ‘‘Pañcahi ",
      ", bhikkhave, dhammehi samannāgato āvāsiko bhikkhu gihīnaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[gihiṃ (syā.), gihī (katthaci)]"
      },
      " anukampati. Katamehi pañcahi? Adhisīle ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[adhisīlesu (syā.)]"
      },
      " samādapeti; dhammadassane niveseti; gilānake upasaṅkamitvā satiṃ uppādeti – ‘arahaggataṃ āyasmanto ",
      " satiṃ upaṭṭhāpethā’ti; mahā kho pana bhikkhusaṅgho abhikkanto nānāverajjakā bhikkhū gihīnaṃ upasaṅkamitvā āroceti – ‘mahā kho, āvuso, bhikkhusaṅgho abhikkanto nānāverajjakā bhikkhū, karotha puññāni, samayo puññāni kātu’nti; yaṃ kho panassa bhojanaṃ denti lūkhaṃ vā paṇītaṃ vā taṃ attanā paribhuñjati, saddhādeyyaṃ na vinipāteti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu gihīnaṃ anukampatī’’ti. Pañcamaṃ."
    ],
    "innerText": "235. ‘‘Pañcahi , bhikkhave, dhammehi samannāgato āvāsiko bhikkhu gihīnaṃ [gihiṃ (syā.), gihī (katthaci)] anukampati. Katamehi pañcahi? Adhisīle [adhisīlesu (syā.)] samādapeti; dhammadassane niveseti; gilānake upasaṅkamitvā satiṃ uppādeti – ‘arahaggataṃ āyasmanto satiṃ upaṭṭhāpethā’ti; mahā kho pana bhikkhusaṅgho abhikkanto nānāverajjakā bhikkhū gihīnaṃ upasaṅkamitvā āroceti – ‘mahā kho, āvuso, bhikkhusaṅgho abhikkanto nānāverajjakā bhikkhū, karotha puññāni, samayo puññāni kātu’nti; yaṃ kho panassa bhojanaṃ denti lūkhaṃ vā paṇītaṃ vā taṃ attanā paribhuñjati, saddhādeyyaṃ na vinipāteti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu gihīnaṃ anukampatī’’ti. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Paṭhamaavaṇṇārahasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "236"
      },
      ". ‘‘Pañcahi ",
      ", bhikkhave, dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ niraye. Katamehi pañcahi? Ananuvicca apariyogāhetvā avaṇṇārahassa vaṇṇaṃ bhāsati; ananuvicca apariyogāhetvā vaṇṇārahassa avaṇṇaṃ bhāsati; ananuvicca apariyogāhetvā appasādanīye ṭhāne pasādaṃ upadaṃseti; ananuvicca apariyogāhetvā ",
      " pasādanīye ṭhāne appasādaṃ upadaṃseti; saddhādeyyaṃ vinipāteti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ niraye."
    ],
    "innerText": "236. ‘‘Pañcahi , bhikkhave, dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ niraye. Katamehi pañcahi? Ananuvicca apariyogāhetvā avaṇṇārahassa vaṇṇaṃ bhāsati; ananuvicca apariyogāhetvā vaṇṇārahassa avaṇṇaṃ bhāsati; ananuvicca apariyogāhetvā appasādanīye ṭhāne pasādaṃ upadaṃseti; ananuvicca apariyogāhetvā pasādanīye ṭhāne appasādaṃ upadaṃseti; saddhādeyyaṃ vinipāteti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ niraye."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ sagge. Katamehi pañcahi? Anuvicca pariyogāhetvā avaṇṇārahassa avaṇṇaṃ bhāsati; anuvicca pariyogāhetvā vaṇṇārahassa vaṇṇaṃ bhāsati; anuvicca pariyogāhetvā appasādanīye ṭhāne appasādaṃ upadaṃseti; anuvicca pariyogāhetvā pasādanīye ṭhāne pasādaṃ upadaṃseti; saddhādeyyaṃ na vinipāteti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ sagge’’ti. Chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Dutiyaavaṇṇārahasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "237"
      },
      ". ‘‘Pañcahi ",
      ", bhikkhave, dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ niraye. Katamehi pañcahi? Ananuvicca apariyogāhetvā avaṇṇārahassa vaṇṇaṃ bhāsati; ananuvicca apariyogāhetvā vaṇṇārahassa avaṇṇaṃ bhāsati; āvāsamaccharī hoti āvāsapaligedhī; kulamaccharī hoti kulapaligedhī; saddhādeyyaṃ vinipāteti. Imehi ",
      " kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ niraye."
    ],
    "innerText": "237. ‘‘Pañcahi , bhikkhave, dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ niraye. Katamehi pañcahi? Ananuvicca apariyogāhetvā avaṇṇārahassa vaṇṇaṃ bhāsati; ananuvicca apariyogāhetvā vaṇṇārahassa avaṇṇaṃ bhāsati; āvāsamaccharī hoti āvāsapaligedhī; kulamaccharī hoti kulapaligedhī; saddhādeyyaṃ vinipāteti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ niraye."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ sagge. Katamehi pañcahi? Anuvicca pariyogāhetvā avaṇṇārahassa avaṇṇaṃ bhāsati; anuvicca pariyogāhetvā vaṇṇārahassa vaṇṇaṃ bhāsati; na āvāsamaccharī hoti na āvāsapaligedhī; na kulamaccharī hoti na kulapaligedhī; saddhādeyyaṃ na vinipāteti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ sagge’’ti. Sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Tatiyaavaṇṇārahasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "238"
      },
      ". ‘‘Pañcahi, bhikkhave, dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ niraye. Katamehi pañcahi? Ananuvicca apariyogāhetvā ",
      " avaṇṇārahassa vaṇṇaṃ bhāsati; ananuvicca apariyogāhetvā vaṇṇārahassa avaṇṇaṃ bhāsati; āvāsamaccharī hoti; kulamaccharī hoti; lābhamaccharī hoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ niraye."
    ],
    "innerText": "238. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ niraye. Katamehi pañcahi? Ananuvicca apariyogāhetvā avaṇṇārahassa vaṇṇaṃ bhāsati; ananuvicca apariyogāhetvā vaṇṇārahassa avaṇṇaṃ bhāsati; āvāsamaccharī hoti; kulamaccharī hoti; lābhamaccharī hoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ niraye."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Pañcahi, bhikkhave, dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ sagge. Katamehi pañcahi? Anuvicca pariyogāhetvā avaṇṇārahassa avaṇṇaṃ bhāsati; anuvicca pariyogāhetvā vaṇṇārahassa vaṇṇaṃ bhāsati ",
      "; na āvāsamaccharī hoti; na kulamaccharī hoti ",
      "; na lābhamaccharī hoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ sagge’’ti. Aṭṭhamaṃ."
    ],
    "innerText": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ sagge. Katamehi pañcahi? Anuvicca pariyogāhetvā avaṇṇārahassa avaṇṇaṃ bhāsati; anuvicca pariyogāhetvā vaṇṇārahassa vaṇṇaṃ bhāsati ; na āvāsamaccharī hoti; na kulamaccharī hoti ; na lābhamaccharī hoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ sagge’’ti. Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Paṭhamamacchariyasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "239"
      },
      ". ‘‘Pañcahi, bhikkhave, dhammehi ",
      " samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ niraye. Katamehi pañcahi? Āvāsamaccharī hoti; kulamaccharī hoti; lābhamaccharī hoti; vaṇṇamaccharī ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[dhammamaccharī (ka.)]"
      },
      " hoti; saddhādeyyaṃ vinipāteti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ niraye."
    ],
    "innerText": "239. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ niraye. Katamehi pañcahi? Āvāsamaccharī hoti; kulamaccharī hoti; lābhamaccharī hoti; vaṇṇamaccharī [dhammamaccharī (ka.)] hoti; saddhādeyyaṃ vinipāteti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ niraye."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ sagge. Katamehi pañcahi? Na āvāsamaccharī hoti; na kulamaccharī hoti; na lābhamaccharī hoti; na vaṇṇamaccharī hoti; saddhādeyyaṃ na vinipāteti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ sagge’’ti. Navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Dutiyamacchariyasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "240"
      },
      ". ‘‘Pañcahi, bhikkhave, dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ niraye. Katamehi pañcahi? Āvāsamaccharī hoti; kulamaccharī hoti; lābhamaccharī hoti; vaṇṇamaccharī hoti; dhammamaccharī hoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ niraye."
    ],
    "innerText": "240. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ niraye. Katamehi pañcahi? Āvāsamaccharī hoti; kulamaccharī hoti; lābhamaccharī hoti; vaṇṇamaccharī hoti; dhammamaccharī hoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ niraye."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Pañcahi ",
      ", bhikkhave, dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ sagge. Katamehi pañcahi? Na āvāsamaccharī hoti; na kulamaccharī hoti; na lābhamaccharī ",
      " hoti; na vaṇṇamaccharī hoti; na dhammamaccharī hoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ sagge’’ti. Dasamaṃ."
    ],
    "innerText": "‘‘Pañcahi , bhikkhave, dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ sagge. Katamehi pañcahi? Na āvāsamaccharī hoti; na kulamaccharī hoti; na lābhamaccharī hoti; na vaṇṇamaccharī hoti; na dhammamaccharī hoti. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ sagge’’ti. Dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Āvāsikavaggo catuttho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Āvāsiko ",
      " piyo ca sobhano,"
    ],
    "innerText": "Āvāsiko piyo ca sobhano,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Bahūpakāro anukampako ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Tayo avaṇṇārahā ceva,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Macchariyā duvepi cāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yathābhataṃ cāpi avaṇṇagedhā, catukkamacchera pañcamena cāti (sī. syā.) yathābhataṃ avaṇṇañca, catuko macchariyena cāti (ka.)]"
      },
      "."
    ],
    "innerText": "Macchariyā duvepi cāti [yathābhataṃ cāpi avaṇṇagedhā, catukkamacchera pañcamena cāti (sī. syā.) yathābhataṃ avaṇṇañca, catuko macchariyena cāti (ka.)]."
  }
]