[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "(13) 3. Kusināravaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Kusinārasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "124"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": " . Ekaṃ"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "samayaṃ bhagavā kusinārāyaṃ viharati baliharaṇe vanasaṇḍe. Tatra kho bhagavā bhikkhū āmantesi – ''bhikkhavo''ti. ''Bhadante''ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –"
      }
    ],
    "innerText": "124 . Ekaṃsamayaṃ bhagavā kusinārāyaṃ viharati baliharaṇe vanasaṇḍe. Tatra kho bhagavā bhikkhū āmantesi – ''bhikkhavo''ti. ''Bhadante''ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "''Idha, bhikkhave, bhikkhu aññataraṃ gāmaṃ vā nigamaṃ vā upanissāya viharati. Tamenaṃ gahapati vā gahapatiputto vā upasaṅkamitvā svātanāya bhattena nimanteti"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": ", Ākaṅkhamāno, bhikkhave, bhikkhu adhivāseti. So tassā rattiyā accayena pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya yena tassa gahapatissa vā gahapatiputtassa vā nivesanaṃ tenupasaṅkamati; upasaṅkamitvā paññatte āsane nisīdati. Tamenaṃ so gahapati vā gahapatiputto vā paṇītena khādanīyena bhojanīyena sahatthā santappeti sampavāreti."
      }
    ],
    "innerText": "''Idha, bhikkhave, bhikkhu aññataraṃ gāmaṃ vā nigamaṃ vā upanissāya viharati. Tamenaṃ gahapati vā gahapatiputto vā upasaṅkamitvā svātanāya bhattena nimanteti, Ākaṅkhamāno, bhikkhave, bhikkhu adhivāseti. So tassā rattiyā accayena pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya yena tassa gahapatissa vā gahapatiputtassa vā nivesanaṃ tenupasaṅkamati; upasaṅkamitvā paññatte āsane nisīdati. Tamenaṃ so gahapati vā gahapatiputto vā paṇītena khādanīyena bhojanīyena sahatthā santappeti sampavāreti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "''tassa evaṃ hoti – 'sādhu vata myāyaṃ gahapati vā gahapatiputto vā paṇītena khādanīyena bhojanīyena sahatthā santappeti sampavāretī'ti. Evampissa hoti – 'aho vata māyaṃ gahapati vā gahapatiputto vā āyatimpi evarūpena paṇītena khādanīyena bhojanīyena sahatthā santappeyya"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "sampavāreyā'ti! So taṃ piṇḍapātaṃ gathito "
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[gadhito (syā. kaṃ. ka.)]"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": " mucchito ajjhosanno "
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ajjhāpanno (sī. ka.) ajjhopanno (ṭīkā)]"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": " anādīnavadassāvī anissaraṇapañño paribhuñjati. So tattha kāmavitakkampi vitakketi, byāpādavitakkampi vitakketi, vihiṃsāvitakkampi vitakketi. Evarūpassāhaṃ, bhikkhave, bhikkhuno dinnaṃ na mahapphalanti vadāmi. Taṃ kiss me? Pamatto hi, bhikkhave, bhikkhu viharati."
      }
    ],
    "innerText": "''tassa evaṃ hoti – 'sādhu vata myāyaṃ gahapati vā gahapatiputto vā paṇītena khādanīyena bhojanīyena sahatthā santappeti sampavāretī'ti. Evampissa hoti – 'aho vata māyaṃ gahapati vā gahapatiputto vā āyatimpi evarūpena paṇītena khādanīyena bhojanīyena sahatthā santappeyyasampavāreyā'ti! So taṃ piṇḍapātaṃ gathito [gadhito (syā. kaṃ. ka.)] mucchito ajjhosanno [ajjhāpanno (sī. ka.) ajjhopanno (ṭīkā)] anādīnavadassāvī anissaraṇapañño paribhuñjati. So tattha kāmavitakkampi vitakketi, byāpādavitakkampi vitakketi, vihiṃsāvitakkampi vitakketi. Evarūpassāhaṃ, bhikkhave, bhikkhuno dinnaṃ na mahapphalanti vadāmi. Taṃ kiss me? Pamatto hi, bhikkhave, bhikkhu viharati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "''Idha pana, bhikkhave, bhikkhu aññataraṃ gāmaṃ vā nigamaṃ vā upanissāya viharati. Tamenaṃ gahapati vā gahapatiputto vā upasaṅkamitvā svātanāya bhattena nimanteti. Ākaṅkhamāno, bhikkhave, bhikkhu adhivāseti. So tassā rattiyā accayena pubbaṇhasamayaṃ nivāsetvā"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "pattacīvaramādāya yena tassa gahapatissa vā gahapatiputtassa vā nivesanaṃ tenupasaṅkamati; upasaṅkamitvā paññatte āsane nisīdati. Tamenaṃ so gahapati vā gahapatiputto vā paṇītena khādanīyena bhojanīyena sahatthā santappeti sampavāreti."
      }
    ],
    "innerText": "''Idha pana, bhikkhave, bhikkhu aññataraṃ gāmaṃ vā nigamaṃ vā upanissāya viharati. Tamenaṃ gahapati vā gahapatiputto vā upasaṅkamitvā svātanāya bhattena nimanteti. Ākaṅkhamāno, bhikkhave, bhikkhu adhivāseti. So tassā rattiyā accayena pubbaṇhasamayaṃ nivāsetvāpattacīvaramādāya yena tassa gahapatissa vā gahapatiputtassa vā nivesanaṃ tenupasaṅkamati; upasaṅkamitvā paññatte āsane nisīdati. Tamenaṃ so gahapati vā gahapatiputto vā paṇītena khādanīyena bhojanīyena sahatthā santappeti sampavāreti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "''tassa na evaṃ hoti – 'sādhu vata myāyaṃ gahapati vā"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "gahapatiputto vā paṇītena khādanīyena bhojanīyena sahatthā santappeti sampavāretī'ti. Evampissa na hoti – 'aho vata māyaṃ gahapati vā gahapatiputto vā āyatimpi evarūpena paṇītena khādanīyena bhojanīyena sahatthā santappeyya sampavāreyyā'ti! So taṃ piṇḍapātaṃ agathito amucchito anajjhosanno ādīnavadassāvī nissaraṇapañño paribhuñjati. So tattha nekkhammavitakkampi"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "vitakketi, abyāpādavitakkampi vitakketi, avihiṃsāvitakkampi vitakketi. Evarūpassāhaṃ, bhikkhave, bhikkhuno dinnaṃ mahapphalanti"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "vadami. Taṃ kiss me? Appamatto hi, bhikkhave, bhikkhu viharatī''ti. Paṭhamaṃ."
      }
    ],
    "innerText": "''tassa na evaṃ hoti – 'sādhu vata myāyaṃ gahapati vāgahapatiputto vā paṇītena khādanīyena bhojanīyena sahatthā santappeti sampavāretī'ti. Evampissa na hoti – 'aho vata māyaṃ gahapati vā gahapatiputto vā āyatimpi evarūpena paṇītena khādanīyena bhojanīyena sahatthā santappeyya sampavāreyyā'ti! So taṃ piṇḍapātaṃ agathito amucchito anajjhosanno ādīnavadassāvī nissaraṇapañño paribhuñjati. So tattha nekkhammavitakkampivitakketi, abyāpādavitakkampi vitakketi, avihiṃsāvitakkampi vitakketi. Evarūpassāhaṃ, bhikkhave, bhikkhuno dinnaṃ mahapphalantivadami. Taṃ kiss me? Appamatto hi, bhikkhave, bhikkhu viharatī''ti. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Bhaṇḍanasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "125"
      },
      ". ‘‘Yassaṃ, bhikkhave, disāyaṃ bhikkhū bhaṇḍanajātā kalahajātā vivādāpannā aññamaññaṃ mukhasattīhi vitudantā viharanti, manasi kātumpi me esā, bhikkhave, disā na phāsu hoti, pageva gantuṃ! Niṭṭhamettha gacchāmi – ‘addhā te āyasmanto tayo dhamme pajahiṃsu, tayo dhamme bahulamakaṃsu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[bahulīmakaṃsu (syā. kaṃ. pī.)]"
      },
      ". Katame tayo dhamme pajahiṃsu? Nekkhammavitakkaṃ, abyāpādavitakkaṃ, avihiṃsāvitakkaṃ – ime tayo dhamme pajahiṃsu. Katame tayo dhamme bahulamakaṃsu? Kāmavitakkaṃ, byāpādavitakkaṃ, vihiṃsāvitakkaṃ – ime tayo dhamme bahulamakaṃsu’. Yassaṃ, bhikkhave, disāyaṃ bhikkhū bhaṇḍanajātā kalahajātā vivādāpannā aññamaññaṃ mukhasattīhi vitudantā viharanti, manasi kātumpi me esā, bhikkhave, disā na phāsu hoti, pageva gantuṃ! Niṭṭhamettha gacchāmi – ‘addhā te āyasmanto ime tayo dhamme pajahiṃsu, ime tayo dhamme bahulamakaṃsu’’’."
    ],
    "innerText": "125. ‘‘Yassaṃ, bhikkhave, disāyaṃ bhikkhū bhaṇḍanajātā kalahajātā vivādāpannā aññamaññaṃ mukhasattīhi vitudantā viharanti, manasi kātumpi me esā, bhikkhave, disā na phāsu hoti, pageva gantuṃ! Niṭṭhamettha gacchāmi – ‘addhā te āyasmanto tayo dhamme pajahiṃsu, tayo dhamme bahulamakaṃsu [bahulīmakaṃsu (syā. kaṃ. pī.)]. Katame tayo dhamme pajahiṃsu? Nekkhammavitakkaṃ, abyāpādavitakkaṃ, avihiṃsāvitakkaṃ – ime tayo dhamme pajahiṃsu. Katame tayo dhamme bahulamakaṃsu? Kāmavitakkaṃ, byāpādavitakkaṃ, vihiṃsāvitakkaṃ – ime tayo dhamme bahulamakaṃsu’. Yassaṃ, bhikkhave, disāyaṃ bhikkhū bhaṇḍanajātā kalahajātā vivādāpannā aññamaññaṃ mukhasattīhi vitudantā viharanti, manasi kātumpi me esā, bhikkhave, disā na phāsu hoti, pageva gantuṃ! Niṭṭhamettha gacchāmi – ‘addhā te āyasmanto ime tayo dhamme pajahiṃsu, ime tayo dhamme bahulamakaṃsu’’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yassaṃ pana, bhikkhave, disāyaṃ bhikkhū samaggā sammodamānā avivadamānā khīrodakībhūtā aññamaññaṃ piyacakkhūhi sampassantā viharanti, gantumpi me esā, bhikkhave, disā phāsu hoti, pageva manasi kātuṃ! Niṭṭhamettha gacchāmi – ‘addhā te āyasmanto tayo dhamme ",
      " pajahiṃsu, tayo dhamme bahulamakaṃsu. Katame tayo dhamme pajahiṃsu? Kāmavitakkaṃ ",
      ", byāpādavitakkaṃ, vihiṃsāvitakkaṃ – ime tayo dhamme pajahiṃsu. Katame tayo dhamme bahulamakaṃsu? Nekkhammavitakkaṃ, abyāpādavitakkaṃ, avihiṃsāvitakkaṃ – ime tayo dhamme bahulamakaṃsu’. Yassaṃ ",
      ", bhikkhave, disāyaṃ bhikkhū samaggā sammodamānā avivadamānā khīrodakībhūtā aññamaññaṃ piyacakkhūhi sampassantā viharanti, gantumpi me esā, bhikkhave, disā phāsu hoti, pageva manasi kātuṃ! Niṭṭhamettha gacchāmi – ‘addhā te āyasmanto ime tayo dhamme pajahiṃsu, ime tayo dhamme bahulamakaṃsū’’’ti. Dutiyaṃ."
    ],
    "innerText": "‘‘Yassaṃ pana, bhikkhave, disāyaṃ bhikkhū samaggā sammodamānā avivadamānā khīrodakībhūtā aññamaññaṃ piyacakkhūhi sampassantā viharanti, gantumpi me esā, bhikkhave, disā phāsu hoti, pageva manasi kātuṃ! Niṭṭhamettha gacchāmi – ‘addhā te āyasmanto tayo dhamme pajahiṃsu, tayo dhamme bahulamakaṃsu. Katame tayo dhamme pajahiṃsu? Kāmavitakkaṃ , byāpādavitakkaṃ, vihiṃsāvitakkaṃ – ime tayo dhamme pajahiṃsu. Katame tayo dhamme bahulamakaṃsu? Nekkhammavitakkaṃ, abyāpādavitakkaṃ, avihiṃsāvitakkaṃ – ime tayo dhamme bahulamakaṃsu’. Yassaṃ , bhikkhave, disāyaṃ bhikkhū samaggā sammodamānā avivadamānā khīrodakībhūtā aññamaññaṃ piyacakkhūhi sampassantā viharanti, gantumpi me esā, bhikkhave, disā phāsu hoti, pageva manasi kātuṃ! Niṭṭhamettha gacchāmi – ‘addhā te āyasmanto ime tayo dhamme pajahiṃsu, ime tayo dhamme bahulamakaṃsū’’’ti. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Gotamakacetiyasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "126"
      },
      ". Ekaṃ ",
      " samayaṃ bhagavā vesāliyaṃ viharati gotamake cetiye. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –"
    ],
    "innerText": "126. Ekaṃ samayaṃ bhagavā vesāliyaṃ viharati gotamake cetiye. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Abhiññāyāhaṃ, bhikkhave, dhammaṃ desemi, no anabhiññāya. Sanidānāhaṃ, bhikkhave, dhammaṃ desemi, no anidānaṃ. Sappāṭihāriyāhaṃ, bhikkhave, dhammaṃ desemi, no appāṭihāriyaṃ. Tassa mayhaṃ, bhikkhave, abhiññāya dhammaṃ desayato no anabhiññāya, sanidānaṃ dhammaṃ desayato no anidānaṃ, sappāṭihāriyaṃ dhammaṃ desayato no appāṭihāriyaṃ, karaṇīyo ovādo, karaṇīyā anusāsanī. Alañca pana vo, bhikkhave, tuṭṭhiyā, alaṃ attamanatāya, alaṃ somanassāya – ‘sammāsambuddho bhagavā, svākkhāto dhammo, suppaṭipanno saṅgho’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṃ abhinandunti. Imasmiñca pana veyyākaraṇasmiṃ bhaññamāne sahassī lokadhātu akampitthāti. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Bharaṇḍukālāmasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "127"
      },
      ". Ekaṃ samayaṃ bhagavā kosalesu cārikaṃ caramāno yena kapilavatthu tadavasari. Assosi kho mahānāmo sakko – ‘‘bhagavā kira kapilavatthuṃ ",
      " anuppatto’’ti. Atha kho mahānāmo ",
      " sakko yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhitaṃ kho mahānāmaṃ sakkaṃ bhagavā etadavoca –"
    ],
    "innerText": "127. Ekaṃ samayaṃ bhagavā kosalesu cārikaṃ caramāno yena kapilavatthu tadavasari. Assosi kho mahānāmo sakko – ‘‘bhagavā kira kapilavatthuṃ anuppatto’’ti. Atha kho mahānāmo sakko yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhitaṃ kho mahānāmaṃ sakkaṃ bhagavā etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Gaccha, mahānāma, kapilavatthusmiṃ, tathārūpaṃ āvasathaṃ jāna yatthajja mayaṃ ekarattiṃ vihareyyāmā’’ti. ‘‘Evaṃ ",
      ", bhante’’ti kho mahānāmo sakko bhagavato paṭissutvā kapilavatthuṃ pavisitvā kevalakappaṃ kapilavatthuṃ anvāhiṇḍanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[āhiṇḍanto (syā. kaṃ.)]"
      },
      " nāddasa kapilavatthusmiṃ tathārūpaṃ āvasathaṃ yatthajja bhagavā ekarattiṃ vihareyya."
    ],
    "innerText": "‘‘Gaccha, mahānāma, kapilavatthusmiṃ, tathārūpaṃ āvasathaṃ jāna yatthajja mayaṃ ekarattiṃ vihareyyāmā’’ti. ‘‘Evaṃ , bhante’’ti kho mahānāmo sakko bhagavato paṭissutvā kapilavatthuṃ pavisitvā kevalakappaṃ kapilavatthuṃ anvāhiṇḍanto [āhiṇḍanto (syā. kaṃ.)] nāddasa kapilavatthusmiṃ tathārūpaṃ āvasathaṃ yatthajja bhagavā ekarattiṃ vihareyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho mahānāmo sakko yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ etadavoca – ‘‘natthi, bhante, kapilavatthusmiṃ tathārūpo āvasatho ",
      " yatthajja bhagavā ekarattiṃ vihareyya. Ayaṃ, bhante, bharaṇḍu kālāmo bhagavato purāṇasabrahmacārī. Tassajja bhagavā assame ekarattiṃ viharatū’’ti. ‘‘Gaccha, mahānāma, santharaṃ paññapehī’’ti. ‘‘Evaṃ, bhante’’ti kho mahānāmo sakko bhagavato paṭissutvā yena bharaṇḍussa kālāmassa assamo tenupasaṅkami; upasaṅkamitvā santharaṃ paññāpetvā udakaṃ ṭhapetvā pādānaṃ dhovanāya yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ etadavoca – ‘‘santhato, bhante, santhāro, udakaṃ ṭhapitaṃ pādānaṃ dhovanāya. Yassadāni, bhante, bhagavā kālaṃ maññatī’’ti."
    ],
    "innerText": "Atha kho mahānāmo sakko yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ etadavoca – ‘‘natthi, bhante, kapilavatthusmiṃ tathārūpo āvasatho yatthajja bhagavā ekarattiṃ vihareyya. Ayaṃ, bhante, bharaṇḍu kālāmo bhagavato purāṇasabrahmacārī. Tassajja bhagavā assame ekarattiṃ viharatū’’ti. ‘‘Gaccha, mahānāma, santharaṃ paññapehī’’ti. ‘‘Evaṃ, bhante’’ti kho mahānāmo sakko bhagavato paṭissutvā yena bharaṇḍussa kālāmassa assamo tenupasaṅkami; upasaṅkamitvā santharaṃ paññāpetvā udakaṃ ṭhapetvā pādānaṃ dhovanāya yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ etadavoca – ‘‘santhato, bhante, santhāro, udakaṃ ṭhapitaṃ pādānaṃ dhovanāya. Yassadāni, bhante, bhagavā kālaṃ maññatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho bhagavā yena bharaṇḍussa kālāmassa assamo tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Nisajja kho bhagavā pāde pakkhālesi. Atha kho mahānāmassa sakkassa etadahosi – ‘‘akālo kho ajja bhagavantaṃ payirupāsituṃ. Kilanto ",
      " bhagavā. Sve dānāhaṃ bhagavantaṃ payirupāsissāmī’’ti bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi."
    ],
    "innerText": "Atha kho bhagavā yena bharaṇḍussa kālāmassa assamo tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Nisajja kho bhagavā pāde pakkhālesi. Atha kho mahānāmassa sakkassa etadahosi – ‘‘akālo kho ajja bhagavantaṃ payirupāsituṃ. Kilanto bhagavā. Sve dānāhaṃ bhagavantaṃ payirupāsissāmī’’ti bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho mahānāmo sakko tassā rattiyā accayena yena bhagavā tenupasaṅkami; upasaṅkamitvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho mahānāmaṃ sakkaṃ bhagavā etadavoca – ‘‘tayo khome, mahānāma, satthāro santo saṃvijjamānā lokasmiṃ. Katame tayo? Idha, mahānāma, ekacco satthā kāmānaṃ pariññaṃ paññāpeti; na rūpānaṃ pariññaṃ paññāpeti, na vedanānaṃ pariññaṃ paññāpeti. Idha pana, mahānāma, ekacco satthā kāmānaṃ pariññaṃ paññāpeti ",
      ", rūpānaṃ pariññaṃ paññāpeti; na vedanānaṃ ",
      " pariññaṃ paññāpeti. Idha pana, mahānāma, ekacco satthā kāmānaṃ pariññaṃ paññāpeti, rūpānaṃ pariññaṃ paññāpeti, vedanānaṃ pariññaṃ paññāpeti. Ime kho, mahānāma, tayo satthāro santo saṃvijjamānā lokasmiṃ. ‘Imesaṃ, mahānāma, tiṇṇaṃ satthārānaṃ ekā niṭṭhā udāhu puthu niṭṭhā’’’ti?"
    ],
    "innerText": "Atha kho mahānāmo sakko tassā rattiyā accayena yena bhagavā tenupasaṅkami; upasaṅkamitvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho mahānāmaṃ sakkaṃ bhagavā etadavoca – ‘‘tayo khome, mahānāma, satthāro santo saṃvijjamānā lokasmiṃ. Katame tayo? Idha, mahānāma, ekacco satthā kāmānaṃ pariññaṃ paññāpeti; na rūpānaṃ pariññaṃ paññāpeti, na vedanānaṃ pariññaṃ paññāpeti. Idha pana, mahānāma, ekacco satthā kāmānaṃ pariññaṃ paññāpeti , rūpānaṃ pariññaṃ paññāpeti; na vedanānaṃ pariññaṃ paññāpeti. Idha pana, mahānāma, ekacco satthā kāmānaṃ pariññaṃ paññāpeti, rūpānaṃ pariññaṃ paññāpeti, vedanānaṃ pariññaṃ paññāpeti. Ime kho, mahānāma, tayo satthāro santo saṃvijjamānā lokasmiṃ. ‘Imesaṃ, mahānāma, tiṇṇaṃ satthārānaṃ ekā niṭṭhā udāhu puthu niṭṭhā’’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ vutte bharaṇḍu kālāmo mahānāmaṃ sakkaṃ etadavoca – ‘‘ekāti, mahānāma, vadehī’’ti. Evaṃ vutte bhagavā mahānāmaṃ sakkaṃ etadavoca – ‘‘nānāti, mahānāma, vadehī’’ti. Dutiyampi kho bharaṇḍu kālāmo mahānāmaṃ sakkaṃ etadavoca – ‘‘ekāti, mahānāma, vadehī’’ti. Dutiyampi kho bhagavā mahānāmaṃ sakkaṃ etadavoca – ‘‘nānāti, mahānāma, vadehī’’ti. Tatiyampi kho bharaṇḍu kālāmo mahānāmaṃ sakkaṃ etadavoca – ‘‘ekāti, mahānāma ",
      ", vadehī’’ti. Tatiyampi kho bhagavā mahānāmaṃ sakkaṃ ",
      " etadavoca – ‘‘nānāti, mahānāma, vadehī’’ti."
    ],
    "innerText": "Evaṃ vutte bharaṇḍu kālāmo mahānāmaṃ sakkaṃ etadavoca – ‘‘ekāti, mahānāma, vadehī’’ti. Evaṃ vutte bhagavā mahānāmaṃ sakkaṃ etadavoca – ‘‘nānāti, mahānāma, vadehī’’ti. Dutiyampi kho bharaṇḍu kālāmo mahānāmaṃ sakkaṃ etadavoca – ‘‘ekāti, mahānāma, vadehī’’ti. Dutiyampi kho bhagavā mahānāmaṃ sakkaṃ etadavoca – ‘‘nānāti, mahānāma, vadehī’’ti. Tatiyampi kho bharaṇḍu kālāmo mahānāmaṃ sakkaṃ etadavoca – ‘‘ekāti, mahānāma , vadehī’’ti. Tatiyampi kho bhagavā mahānāmaṃ sakkaṃ etadavoca – ‘‘nānāti, mahānāma, vadehī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha kho bharaṇḍu kālāmassa etadahosi – ‘‘mahesakkhassa vatamhi mahānāmassa sakkassa sammukhā samaṇena gotamena yāvatatiyaṃ apasādito. Yaṃnūnāhaṃ kapilavatthumhā pakkameyya’’nti. Atha kho bharaṇḍu kālāmo kapilavatthumhā pakkāmi. Yaṃ kapilavatthumhā pakkāmi tathā pakkantova ahosi na puna paccāgacchīti. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Hatthakasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "128"
      },
      ". Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho hatthako devaputto abhikkantāya rattiyā abhikkantavaṇṇo kevalakappaṃ jetavanaṃ obhāsetvā yena bhagavā tenupasaṅkami; upasaṅkamitvā – ‘‘bhagavato purato ṭhassāmī’’ti osīdatimeva saṃsīdatimeva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[osīdati ceva saṃsīdati ca (sī. pī.), osīdati saṃsīdati (syā. kaṃ.)]"
      },
      ", na sakkoti saṇṭhātuṃ. Seyyathāpi nāma sappi vā telaṃ vā vālukāya āsittaṃ osīdatimeva saṃsīdatimeva, na saṇṭhāti; evamevaṃ hatthako devaputto – ‘‘bhagavato purato ṭhassāmī’’ti osīdatimeva saṃsīdatimeva, na sakkoti saṇṭhātuṃ."
    ],
    "innerText": "128. Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho hatthako devaputto abhikkantāya rattiyā abhikkantavaṇṇo kevalakappaṃ jetavanaṃ obhāsetvā yena bhagavā tenupasaṅkami; upasaṅkamitvā – ‘‘bhagavato purato ṭhassāmī’’ti osīdatimeva saṃsīdatimeva [osīdati ceva saṃsīdati ca (sī. pī.), osīdati saṃsīdati (syā. kaṃ.)], na sakkoti saṇṭhātuṃ. Seyyathāpi nāma sappi vā telaṃ vā vālukāya āsittaṃ osīdatimeva saṃsīdatimeva, na saṇṭhāti; evamevaṃ hatthako devaputto – ‘‘bhagavato purato ṭhassāmī’’ti osīdatimeva saṃsīdatimeva, na sakkoti saṇṭhātuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " kho bhagavā hatthakaṃ devaputtaṃ etadavoca – ‘‘oḷārikaṃ, hatthaka, attabhāvaṃ abhinimmināhī’’ti ",
      ". ‘‘Evaṃ, bhante’’ti, kho hatthako devaputto bhagavato paṭissutvā oḷārikaṃ attabhāvaṃ abhinimminitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhitaṃ kho hatthakaṃ devaputtaṃ bhagavā etadavoca –"
    ],
    "innerText": "Atha kho bhagavā hatthakaṃ devaputtaṃ etadavoca – ‘‘oḷārikaṃ, hatthaka, attabhāvaṃ abhinimmināhī’’ti . ‘‘Evaṃ, bhante’’ti, kho hatthako devaputto bhagavato paṭissutvā oḷārikaṃ attabhāvaṃ abhinimminitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhitaṃ kho hatthakaṃ devaputtaṃ bhagavā etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ye te, hatthaka, dhammā pubbe manussabhūtassa pavattino ahesuṃ, api nu te te dhammā etarahi pavattino’’ti? ‘‘Ye ca me, bhante, dhammā pubbe manussabhūtassa pavattino ahesuṃ, te ca me dhammā etarahi pavattino; ye ca me, bhante, dhammā pubbe manussabhūtassa ",
      " nappavattino ahesuṃ, te ca me dhammā etarahi pavattino. Seyyathāpi, bhante, bhagavā etarahi ākiṇṇo viharati bhikkhūhi bhikkhunīhi upāsakehi upāsikāhi rājūhi ",
      " rājamahāmattehi titthiyehi titthiyasāvakehi; evamevaṃ kho ahaṃ, bhante, ākiṇṇo viharāmi devaputtehi. Dūratopi, bhante, devaputtā āgacchanti hatthakassa devaputtassa santike ‘dhammaṃ sossāmā’ti. Tiṇṇāhaṃ, bhante, dhammānaṃ atitto appaṭivāno kālaṅkato. Katamesaṃ tiṇṇaṃ? Bhagavato ahaṃ, bhante, dassanassa atitto appaṭivāno kālaṅkato; saddhammasavanassāhaṃ, bhante, atitto appaṭivāno kālaṅkato; saṅghassāhaṃ, bhante, upaṭṭhānassa atitto appaṭivāno kālaṅkato. Imesaṃ kho ahaṃ, bhante, tiṇṇaṃ dhammānaṃ atitto appaṭivāno kālaṅkato’’ti."
    ],
    "innerText": "‘‘Ye te, hatthaka, dhammā pubbe manussabhūtassa pavattino ahesuṃ, api nu te te dhammā etarahi pavattino’’ti? ‘‘Ye ca me, bhante, dhammā pubbe manussabhūtassa pavattino ahesuṃ, te ca me dhammā etarahi pavattino; ye ca me, bhante, dhammā pubbe manussabhūtassa nappavattino ahesuṃ, te ca me dhammā etarahi pavattino. Seyyathāpi, bhante, bhagavā etarahi ākiṇṇo viharati bhikkhūhi bhikkhunīhi upāsakehi upāsikāhi rājūhi rājamahāmattehi titthiyehi titthiyasāvakehi; evamevaṃ kho ahaṃ, bhante, ākiṇṇo viharāmi devaputtehi. Dūratopi, bhante, devaputtā āgacchanti hatthakassa devaputtassa santike ‘dhammaṃ sossāmā’ti. Tiṇṇāhaṃ, bhante, dhammānaṃ atitto appaṭivāno kālaṅkato. Katamesaṃ tiṇṇaṃ? Bhagavato ahaṃ, bhante, dassanassa atitto appaṭivāno kālaṅkato; saddhammasavanassāhaṃ, bhante, atitto appaṭivāno kālaṅkato; saṅghassāhaṃ, bhante, upaṭṭhānassa atitto appaṭivāno kālaṅkato. Imesaṃ kho ahaṃ, bhante, tiṇṇaṃ dhammānaṃ atitto appaṭivāno kālaṅkato’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Nāhaṃ bhagavato dassanassa, tittimajjhagā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[titti tittisambhavaṃ (ka.)]"
      },
      " kudācanaṃ;"
    ],
    "innerText": "‘‘Nāhaṃ bhagavato dassanassa, tittimajjhagā [titti tittisambhavaṃ (ka.)] kudācanaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Saṅghassa upaṭṭhānassa, saddhammasavanassa ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Adhisīlaṃ sikkhamāno, saddhammasavane rato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tiṇṇaṃ dhammānaṃ atitto, hatthako avihaṃ gato’’ti. pañcamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Kaṭuviyasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "129"
      },
      ". Ekaṃ samayaṃ bhagavā bārāṇasiyaṃ viharati isipatane migadāye. Atha kho bhagavā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya bārāṇasiṃ piṇḍāya pāvisi. Addasā ",
      " kho bhagavā goyogapilakkhasmiṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[goyogamilakkhasmiṃ (syā. kaṃ. ka.)]"
      },
      " piṇḍāya caramāno ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[caramānaṃ (ka.)]"
      },
      " aññataraṃ bhikkhuṃ rittassādaṃ bāhirassādaṃ muṭṭhassatiṃ ",
      " asampajānaṃ asamāhitaṃ vibbhantacittaṃ pākatindriyaṃ. Disvā taṃ bhikkhuṃ etadavoca ",
      " –"
    ],
    "innerText": "129. Ekaṃ samayaṃ bhagavā bārāṇasiyaṃ viharati isipatane migadāye. Atha kho bhagavā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya bārāṇasiṃ piṇḍāya pāvisi. Addasā kho bhagavā goyogapilakkhasmiṃ [goyogamilakkhasmiṃ (syā. kaṃ. ka.)] piṇḍāya caramāno [caramānaṃ (ka.)] aññataraṃ bhikkhuṃ rittassādaṃ bāhirassādaṃ muṭṭhassatiṃ asampajānaṃ asamāhitaṃ vibbhantacittaṃ pākatindriyaṃ. Disvā taṃ bhikkhuṃ etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Mā kho tvaṃ, bhikkhu, attānaṃ kaṭuviyamakāsi. Taṃ vata bhikkhu kaṭuviyakataṃ attānaṃ āmagandhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[āmagandhe (sī. syā. kaṃ. pī.)]"
      },
      " avassutaṃ makkhikā nānupatissanti nānvāssavissantīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[nānubandhissanti (ka.)]"
      },
      ", netaṃ ṭhānaṃ vijjatī’’ti. Atha kho so bhikkhu bhagavatā iminā ovādena ovadito saṃvegamāpādi. Atha kho bhagavā bārāṇasiyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātapaṭikkanto bhikkhū āmantesi –"
    ],
    "innerText": "‘‘Mā kho tvaṃ, bhikkhu, attānaṃ kaṭuviyamakāsi. Taṃ vata bhikkhu kaṭuviyakataṃ attānaṃ āmagandhena [āmagandhe (sī. syā. kaṃ. pī.)] avassutaṃ makkhikā nānupatissanti nānvāssavissantīti [nānubandhissanti (ka.)], netaṃ ṭhānaṃ vijjatī’’ti. Atha kho so bhikkhu bhagavatā iminā ovādena ovadito saṃvegamāpādi. Atha kho bhagavā bārāṇasiyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātapaṭikkanto bhikkhū āmantesi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idhāhaṃ, bhikkhave, pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya bārāṇasiṃ ",
      " piṇḍāya pāvisiṃ. Addasaṃ kho ahaṃ, bhikkhave, goyogapilakkhasmiṃ piṇḍāya caramāno aññataraṃ bhikkhuṃ rittassādaṃ bāhirassādaṃ muṭṭhassatiṃ asampajānaṃ asamāhitaṃ vibbhantacittaṃ pākatindriyaṃ. Disvā taṃ bhikkhuṃ etadavocaṃ –"
    ],
    "innerText": "‘‘Idhāhaṃ, bhikkhave, pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya bārāṇasiṃ piṇḍāya pāvisiṃ. Addasaṃ kho ahaṃ, bhikkhave, goyogapilakkhasmiṃ piṇḍāya caramāno aññataraṃ bhikkhuṃ rittassādaṃ bāhirassādaṃ muṭṭhassatiṃ asampajānaṃ asamāhitaṃ vibbhantacittaṃ pākatindriyaṃ. Disvā taṃ bhikkhuṃ etadavocaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘‘Mā kho tvaṃ, bhikkhu, attānaṃ kaṭuviyamakāsi. Taṃ vata bhikkhu kaṭuviyakataṃ attānaṃ āmagandhena avassutaṃ makkhikā nānupatissanti nānvāssavissantīti, netaṃ ṭhānaṃ vijjatī’ti. Atha kho, bhikkhave, so bhikkhu mayā iminā ovādena ovadito saṃvegamāpādī’’ti. Evaṃ vutte aññataro bhikkhu bhagavantaṃ etadavoca – ‘‘kiṃ nu kho, bhante, kaṭuviyaṃ? Ko āmagandho? Kā makkhikā’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Abhijjhā kho, bhikkhu, kaṭuviyaṃ; byāpādo āmagandho; pāpakā akusalā vitakkā makkhikā. Taṃ vata, bhikkhu, kaṭuviyakataṃ attānaṃ āmagandhena avassutaṃ makkhikā nānupatissanti nānvāssavissantīti, netaṃ ṭhānaṃ vijjatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Aguttaṃ ",
      " cakkhusotasmiṃ, indriyesu asaṃvutaṃ;"
    ],
    "innerText": "‘‘Aguttaṃ cakkhusotasmiṃ, indriyesu asaṃvutaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Makkhikānupatissanti ",
      ", saṅkappā rāganissitā."
    ],
    "innerText": "Makkhikānupatissanti , saṅkappā rāganissitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Kaṭuviyakato ",
      " bhikkhu, āmagandhe avassuto;"
    ],
    "innerText": "‘‘Kaṭuviyakato bhikkhu, āmagandhe avassuto;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ārakā hoti nibbānā, vighātasseva bhāgavā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Gāme vā yadi vāraññe, aladdhā samathamattano ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[samamattano (sī. syā. kaṃ.), sammamattano (pī.)]"
      },
      ";"
    ],
    "innerText": "‘‘Gāme vā yadi vāraññe, aladdhā samathamattano [samamattano (sī. syā. kaṃ.), sammamattano (pī.)];"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Pareti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[careti (syā. ka.)]"
      },
      " bālo dummedho, makkhikāhi purakkhato."
    ],
    "innerText": "Pareti [careti (syā. ka.)] bālo dummedho, makkhikāhi purakkhato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ye ca sīlena sampannā, paññāyūpasameratā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Upasantā sukhaṃ senti, nāsayitvāna makkhikā’’ti. chaṭṭhaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Paṭhamaanuruddhasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "130"
      },
      ". Atha kho āyasmā anuruddho yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā anuruddho bhagavantaṃ etadavoca – ‘‘idhāhaṃ, bhante, dibbena cakkhunā ",
      " visuddhena atikkantamānusakena yebhuyyena passāmi mātugāmaṃ kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjamānaṃ. Katihi nu kho, bhante, dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjatī’’ti?"
    ],
    "innerText": "130. Atha kho āyasmā anuruddho yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā anuruddho bhagavantaṃ etadavoca – ‘‘idhāhaṃ, bhante, dibbena cakkhunā visuddhena atikkantamānusakena yebhuyyena passāmi mātugāmaṃ kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjamānaṃ. Katihi nu kho, bhante, dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjatī’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tīhi kho, anuruddha, dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. Katamehi tīhi? Idha, anuruddha, mātugāmo pubbaṇhasamayaṃ maccheramalapariyuṭṭhitena cetasā agāraṃ ajjhāvasati, majjhanhikasamayaṃ issāpariyuṭṭhitena cetasā agāraṃ ajjhāvasati, sāyanhasamayaṃ kāmarāgapariyuṭṭhitena cetasā agāraṃ ajjhāvasati ",
      ". Imehi kho, anuruddha, tīhi dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjatī’’ti. Sattamaṃ."
    ],
    "innerText": "‘‘Tīhi kho, anuruddha, dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. Katamehi tīhi? Idha, anuruddha, mātugāmo pubbaṇhasamayaṃ maccheramalapariyuṭṭhitena cetasā agāraṃ ajjhāvasati, majjhanhikasamayaṃ issāpariyuṭṭhitena cetasā agāraṃ ajjhāvasati, sāyanhasamayaṃ kāmarāgapariyuṭṭhitena cetasā agāraṃ ajjhāvasati . Imehi kho, anuruddha, tīhi dhammehi samannāgato mātugāmo kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjatī’’ti. Sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Dutiyaanuruddhasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "131"
      },
      ". Atha kho āyasmā anuruddho yenāyasmā sāriputto tenupasaṅkami; upasaṅkamitvā āyasmatā ",
      " sāriputtena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ",
      " ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā anuruddho āyasmantaṃ sāriputtaṃ etadavoca – ‘‘idhāhaṃ, āvuso sāriputta, dibbena cakkhunā visuddhena atikkantamānusakena sahassaṃ lokaṃ olokemi. Āraddhaṃ kho pana me vīriyaṃ asallīnaṃ, upaṭṭhitā sati asammuṭṭhā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[apammuṭṭhā (sī.), apamuṭṭhā (syā. kaṃ.)]"
      },
      ", passaddho kāyo asāraddho, samāhitaṃ cittaṃ ekaggaṃ. Atha ca pana me nānupādāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[na anupādāya (sī. syā. kaṃ. pī.)]"
      },
      " āsavehi cittaṃ vimuccatī’’ti."
    ],
    "innerText": "131. Atha kho āyasmā anuruddho yenāyasmā sāriputto tenupasaṅkami; upasaṅkamitvā āyasmatā sāriputtena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā anuruddho āyasmantaṃ sāriputtaṃ etadavoca – ‘‘idhāhaṃ, āvuso sāriputta, dibbena cakkhunā visuddhena atikkantamānusakena sahassaṃ lokaṃ olokemi. Āraddhaṃ kho pana me vīriyaṃ asallīnaṃ, upaṭṭhitā sati asammuṭṭhā [apammuṭṭhā (sī.), apamuṭṭhā (syā. kaṃ.)], passaddho kāyo asāraddho, samāhitaṃ cittaṃ ekaggaṃ. Atha ca pana me nānupādāya [na anupādāya (sī. syā. kaṃ. pī.)] āsavehi cittaṃ vimuccatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yaṃ kho te, āvuso anuruddha, evaṃ hoti – ‘ahaṃ dibbena cakkhunā visuddhena atikkantamānusakena sahassaṃ lokaṃ volokemī’ti, idaṃ te mānasmiṃ. Yampi te, āvuso anuruddha, evaṃ hoti – ‘āraddhaṃ kho pana me vīriyaṃ asallīnaṃ, upaṭṭhitā sati asammuṭṭhā, passaddho kāyo asāraddho, samāhitaṃ cittaṃ ekagga’nti, idaṃ te uddhaccasmiṃ. Yampi te, āvuso anuruddha, evaṃ hoti – ‘atha ca pana me nānupādāya āsavehi cittaṃ vimuccatī’ti, idaṃ ",
      " te kukkuccasmiṃ. Sādhu vatāyasmā anuruddho ime tayo dhamme pahāya, ime tayo dhamme amanasikaritvā amatāya dhātuyā cittaṃ upasaṃharatū’’ti."
    ],
    "innerText": "‘‘Yaṃ kho te, āvuso anuruddha, evaṃ hoti – ‘ahaṃ dibbena cakkhunā visuddhena atikkantamānusakena sahassaṃ lokaṃ volokemī’ti, idaṃ te mānasmiṃ. Yampi te, āvuso anuruddha, evaṃ hoti – ‘āraddhaṃ kho pana me vīriyaṃ asallīnaṃ, upaṭṭhitā sati asammuṭṭhā, passaddho kāyo asāraddho, samāhitaṃ cittaṃ ekagga’nti, idaṃ te uddhaccasmiṃ. Yampi te, āvuso anuruddha, evaṃ hoti – ‘atha ca pana me nānupādāya āsavehi cittaṃ vimuccatī’ti, idaṃ te kukkuccasmiṃ. Sādhu vatāyasmā anuruddho ime tayo dhamme pahāya, ime tayo dhamme amanasikaritvā amatāya dhātuyā cittaṃ upasaṃharatū’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho āyasmā anuruddho aparena ",
      " samayena ime tayo dhamme pahāya, ime tayo dhamme amanasikaritvā amatāya dhātuyā cittaṃ upasaṃhari ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[upasaṃhāsi (syā. kaṃ. pī.), upasaṃharati (ka.)]"
      },
      ". Atha kho āyasmā anuruddho eko vūpakaṭṭho appamatto ātāpī pahitatto viharanto nacirasseva – yassatthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti, tadanuttaraṃ – brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihāsi. ‘‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’’ti abbhaññāsi. Aññataro ca panāyasmā anuruddho arahataṃ ahosīti. Aṭṭhamaṃ."
    ],
    "innerText": "Atha kho āyasmā anuruddho aparena samayena ime tayo dhamme pahāya, ime tayo dhamme amanasikaritvā amatāya dhātuyā cittaṃ upasaṃhari [upasaṃhāsi (syā. kaṃ. pī.), upasaṃharati (ka.)]. Atha kho āyasmā anuruddho eko vūpakaṭṭho appamatto ātāpī pahitatto viharanto nacirasseva – yassatthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti, tadanuttaraṃ – brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihāsi. ‘‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’’ti abbhaññāsi. Aññataro ca panāyasmā anuruddho arahataṃ ahosīti. Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Paṭicchannasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "132"
      },
      ". ‘‘Tīṇimāni, bhikkhave, paṭicchannāni āvahanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vahanti (sī. syā. kaṃ. pī.)]"
      },
      ", no vivaṭāni. Katamāni tīṇi? Mātugāmo, bhikkhave, paṭicchanno āvahati, no vivaṭo; brāhmaṇānaṃ, bhikkhave, mantā paṭicchannā āvahanti, no vivaṭā ",
      "; micchādiṭṭhi, bhikkhave, paṭicchannā āvahati, no vivaṭā. Imāni kho, bhikkhave, tīṇi paṭicchannāni āvahanti, no vivaṭāni."
    ],
    "innerText": "132. ‘‘Tīṇimāni, bhikkhave, paṭicchannāni āvahanti [vahanti (sī. syā. kaṃ. pī.)], no vivaṭāni. Katamāni tīṇi? Mātugāmo, bhikkhave, paṭicchanno āvahati, no vivaṭo; brāhmaṇānaṃ, bhikkhave, mantā paṭicchannā āvahanti, no vivaṭā ; micchādiṭṭhi, bhikkhave, paṭicchannā āvahati, no vivaṭā. Imāni kho, bhikkhave, tīṇi paṭicchannāni āvahanti, no vivaṭāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tīṇimāni ",
      ", bhikkhave, vivaṭāni virocanti, no paṭicchannāni. Katamāni tīṇi? Candamaṇḍalaṃ, bhikkhave, vivaṭaṃ virocati, no paṭicchannaṃ; sūriyamaṇḍalaṃ, bhikkhave, vivaṭaṃ virocati, no paṭicchannaṃ; tathāgatappavedito dhammavinayo, bhikkhave, vivaṭo virocati, no paṭicchanno. Imāni kho, bhikkhave, tīṇi vivaṭāni virocanti, no paṭicchannānī’’ti. Navamaṃ."
    ],
    "innerText": "‘‘Tīṇimāni , bhikkhave, vivaṭāni virocanti, no paṭicchannāni. Katamāni tīṇi? Candamaṇḍalaṃ, bhikkhave, vivaṭaṃ virocati, no paṭicchannaṃ; sūriyamaṇḍalaṃ, bhikkhave, vivaṭaṃ virocati, no paṭicchannaṃ; tathāgatappavedito dhammavinayo, bhikkhave, vivaṭo virocati, no paṭicchanno. Imāni kho, bhikkhave, tīṇi vivaṭāni virocanti, no paṭicchannānī’’ti. Navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Lekhasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "133"
      },
      ". ‘‘Tayome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Pāsāṇalekhūpamo puggalo, pathavilekhūpamo puggalo, udakalekhūpamo ",
      " puggalo. Katamo ca, bhikkhave, pāsāṇalekhūpamo puggalo? Idha, bhikkhave, ekacco puggalo abhiṇhaṃ kujjhati. So ca khvassa kodho ",
      " dīgharattaṃ anuseti. Seyyathāpi, bhikkhave, pāsāṇe lekhā na khippaṃ lujjati vātena vā udakena vā, ciraṭṭhitikā hoti; evamevaṃ kho, bhikkhave, idhekacco puggalo abhiṇhaṃ kujjhati. So ca khvassa kodho dīgharattaṃ anuseti. Ayaṃ vuccati, bhikkhave, pāsāṇalekhūpamo puggalo."
    ],
    "innerText": "133. ‘‘Tayome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Pāsāṇalekhūpamo puggalo, pathavilekhūpamo puggalo, udakalekhūpamo puggalo. Katamo ca, bhikkhave, pāsāṇalekhūpamo puggalo? Idha, bhikkhave, ekacco puggalo abhiṇhaṃ kujjhati. So ca khvassa kodho dīgharattaṃ anuseti. Seyyathāpi, bhikkhave, pāsāṇe lekhā na khippaṃ lujjati vātena vā udakena vā, ciraṭṭhitikā hoti; evamevaṃ kho, bhikkhave, idhekacco puggalo abhiṇhaṃ kujjhati. So ca khvassa kodho dīgharattaṃ anuseti. Ayaṃ vuccati, bhikkhave, pāsāṇalekhūpamo puggalo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamo ca, bhikkhave, pathavilekhūpamo puggalo? Idha, bhikkhave, ekacco puggalo abhiṇhaṃ kujjhati. So ca khvassa kodho na dīgharattaṃ anuseti. Seyyathāpi, bhikkhave, pathaviyā lekhā khippaṃ lujjati vātena vā udakena vā, na ciraṭṭhitikā hoti; evamevaṃ kho, bhikkhave, idhekacco puggalo abhiṇhaṃ kujjhati. So ca khvassa kodho na dīgharattaṃ anuseti. Ayaṃ vuccati, bhikkhave, pathavilekhūpamo puggalo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamo ca, bhikkhave, udakalekhūpamo puggalo? Idha, bhikkhave, ekacco puggalo āgāḷhenapi vuccamāno pharusenapi ",
      " vuccamāno amanāpenapi vuccamāno sandhiyatimeva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[… yeva (syā. kaṃ.) … ceva (pī.)]"
      },
      " saṃsandatimeva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[… yeva (syā. kaṃ.) … ceva (pī.)]"
      },
      " sammodatimeva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[… yeva (syā. kaṃ.) … ceva (pī.)]"
      },
      ". Seyyathāpi, bhikkhave, udake lekhā khippaṃyeva paṭivigacchati, na ciraṭṭhitikā hoti; evamevaṃ kho, bhikkhave, idhekacco puggalo āgāḷhenapi vuccamāno pharusenapi vuccamāno amanāpenapi vuccamāno sandhiyatimeva saṃsandatimeva sammodatimeva. Ayaṃ ",
      " vuccati, bhikkhave, udakalekhūpamo puggalo. Ime kho, bhikkhave, tayo puggalā santo saṃvijjamānā lokasmi’’nti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pu. pa. 115]"
      },
      ". Dasamaṃ."
    ],
    "innerText": "‘‘Katamo ca, bhikkhave, udakalekhūpamo puggalo? Idha, bhikkhave, ekacco puggalo āgāḷhenapi vuccamāno pharusenapi vuccamāno amanāpenapi vuccamāno sandhiyatimeva [… yeva (syā. kaṃ.) … ceva (pī.)] saṃsandatimeva [… yeva (syā. kaṃ.) … ceva (pī.)] sammodatimeva [… yeva (syā. kaṃ.) … ceva (pī.)]. Seyyathāpi, bhikkhave, udake lekhā khippaṃyeva paṭivigacchati, na ciraṭṭhitikā hoti; evamevaṃ kho, bhikkhave, idhekacco puggalo āgāḷhenapi vuccamāno pharusenapi vuccamāno amanāpenapi vuccamāno sandhiyatimeva saṃsandatimeva sammodatimeva. Ayaṃ vuccati, bhikkhave, udakalekhūpamo puggalo. Ime kho, bhikkhave, tayo puggalā santo saṃvijjamānā lokasmi’’nti [pu. pa. 115]. Dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Kusināravaggo terasamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Kusinārabhaṇḍanā ",
      " ceva, gotamabharaṇḍuhatthako;"
    ],
    "innerText": "Kusinārabhaṇḍanā ceva, gotamabharaṇḍuhatthako;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kaṭuviyaṃ dve anuruddhā, paṭicchannaṃ lekhena te dasāti."
  }
]