[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "(10) 5. Kakudhavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Paṭhamasampadāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "91"
      },
      ". ‘‘Pañcimā ",
      ", bhikkhave, sampadā. Katamā pañca? Saddhāsampadā, sīlasampadā, sutasampadā, cāgasampadā, paññāsampadā – imā kho, bhikkhave, pañca sampadā’’ti. Paṭhamaṃ."
    ],
    "innerText": "91. ‘‘Pañcimā , bhikkhave, sampadā. Katamā pañca? Saddhāsampadā, sīlasampadā, sutasampadā, cāgasampadā, paññāsampadā – imā kho, bhikkhave, pañca sampadā’’ti. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Dutiyasampadāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "92"
      },
      ". ‘‘Pañcimā ",
      ", bhikkhave, sampadā. Katamā pañca? Sīlasampadā, samādhisampadā, paññāsampadā, vimuttisampadā, vimuttiñāṇadassanasampadā – imā kho, bhikkhave, pañca sampadā’’ti. Dutiyaṃ."
    ],
    "innerText": "92. ‘‘Pañcimā , bhikkhave, sampadā. Katamā pañca? Sīlasampadā, samādhisampadā, paññāsampadā, vimuttisampadā, vimuttiñāṇadassanasampadā – imā kho, bhikkhave, pañca sampadā’’ti. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Byākaraṇasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "93"
      },
      ". ‘‘Pañcimāni, bhikkhave, aññābyākaraṇāni. Katamāni pañca? Mandattā momūhattā aññaṃ byākaroti; pāpiccho icchāpakato aññaṃ byākaroti; ummādā cittakkhepā aññaṃ byākaroti; adhimānena aññaṃ byākaroti; sammadeva aññaṃ byākaroti. Imāni kho, bhikkhave, pañca aññābyākaraṇānī’’ti. Tatiyaṃ."
    ],
    "innerText": "93. ‘‘Pañcimāni, bhikkhave, aññābyākaraṇāni. Katamāni pañca? Mandattā momūhattā aññaṃ byākaroti; pāpiccho icchāpakato aññaṃ byākaroti; ummādā cittakkhepā aññaṃ byākaroti; adhimānena aññaṃ byākaroti; sammadeva aññaṃ byākaroti. Imāni kho, bhikkhave, pañca aññābyākaraṇānī’’ti. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Phāsuvihārasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "94"
      },
      ". ‘‘Pañcime ",
      ", bhikkhave, phāsuvihārā. Katame pañca? Idha, bhikkhave, bhikkhu vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati; vitakkavicārānaṃ vūpasamā…pe… dutiyaṃ jhānaṃ… ",
      " tatiyaṃ jhānaṃ… catutthaṃ jhānaṃ upasampajja viharati; āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Ime kho, bhikkhave, pañca phāsuvihārā’’ti. Catutthaṃ."
    ],
    "innerText": "94. ‘‘Pañcime , bhikkhave, phāsuvihārā. Katame pañca? Idha, bhikkhave, bhikkhu vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati; vitakkavicārānaṃ vūpasamā…pe… dutiyaṃ jhānaṃ… tatiyaṃ jhānaṃ… catutthaṃ jhānaṃ upasampajja viharati; āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Ime kho, bhikkhave, pañca phāsuvihārā’’ti. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Akuppasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "95"
      },
      ". ‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhikkhu nacirasseva akuppaṃ paṭivijjhati. Katamehi pañcahi? Idha ",
      ", bhikkhave, bhikkhu atthapaṭisambhidāpatto hoti, dhammapaṭisambhidāpatto hoti, niruttipaṭisambhidāpatto hoti, paṭibhānapaṭisambhidāpatto hoti, yathāvimuttaṃ cittaṃ paccavekkhati. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu nacirasseva akuppaṃ paṭivijjhatī’’ti. Pañcamaṃ."
    ],
    "innerText": "95. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhikkhu nacirasseva akuppaṃ paṭivijjhati. Katamehi pañcahi? Idha , bhikkhave, bhikkhu atthapaṭisambhidāpatto hoti, dhammapaṭisambhidāpatto hoti, niruttipaṭisambhidāpatto hoti, paṭibhānapaṭisambhidāpatto hoti, yathāvimuttaṃ cittaṃ paccavekkhati. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu nacirasseva akuppaṃ paṭivijjhatī’’ti. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Sutadharasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "96"
      },
      ". ‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhikkhu ānāpānassatiṃ āsevanto nacirasseva akuppaṃ paṭivijjhati. Katamehi pañcahi? Idha, bhikkhave, bhikkhu appaṭṭho hoti appakicco subharo susantoso jīvitaparikkhāresu; appāhāro hoti anodarikattaṃ anuyutto; appamiddho hoti jāgariyaṃ anuyutto; bahussuto hoti sutadharo sutasannicayo, ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpāssa dhammā bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā; yathāvimuttaṃ cittaṃ paccavekkhati. Imehi ",
      " kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu ānāpānassatiṃ āsevanto nacirasseva akuppaṃ paṭivijjhatī’’ti. Chaṭṭhaṃ."
    ],
    "innerText": "96. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhikkhu ānāpānassatiṃ āsevanto nacirasseva akuppaṃ paṭivijjhati. Katamehi pañcahi? Idha, bhikkhave, bhikkhu appaṭṭho hoti appakicco subharo susantoso jīvitaparikkhāresu; appāhāro hoti anodarikattaṃ anuyutto; appamiddho hoti jāgariyaṃ anuyutto; bahussuto hoti sutadharo sutasannicayo, ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpāssa dhammā bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā; yathāvimuttaṃ cittaṃ paccavekkhati. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu ānāpānassatiṃ āsevanto nacirasseva akuppaṃ paṭivijjhatī’’ti. Chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Kathāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "97"
      },
      ". ‘‘Pañcahi ",
      ", bhikkhave, dhammehi samannāgato bhikkhu ānāpānassatiṃ bhāvento nacirasseva akuppaṃ paṭivijjhati. Katamehi pañcahi? Idha, bhikkhave, bhikkhu appaṭṭho hoti appakicco subharo susantoso jīvitaparikkhāresu; appāhāro hoti anodarikattaṃ anuyutto; appamiddho ",
      " hoti jāgariyaṃ anuyutto; yāyaṃ kathā ābhisallekhikā cetovivaraṇasappāyā, seyyathidaṃ – appicchakathā…pe… vimuttiñāṇadassanakathā, evarūpiyā kathāya nikāmalābhī hoti akicchalābhī akasiralābhī; yathāvimuttaṃ cittaṃ paccavekkhati. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu ānāpānassatiṃ bhāvento nacirasseva akuppaṃ paṭivijjhatī’’ti. Sattamaṃ."
    ],
    "innerText": "97. ‘‘Pañcahi , bhikkhave, dhammehi samannāgato bhikkhu ānāpānassatiṃ bhāvento nacirasseva akuppaṃ paṭivijjhati. Katamehi pañcahi? Idha, bhikkhave, bhikkhu appaṭṭho hoti appakicco subharo susantoso jīvitaparikkhāresu; appāhāro hoti anodarikattaṃ anuyutto; appamiddho hoti jāgariyaṃ anuyutto; yāyaṃ kathā ābhisallekhikā cetovivaraṇasappāyā, seyyathidaṃ – appicchakathā…pe… vimuttiñāṇadassanakathā, evarūpiyā kathāya nikāmalābhī hoti akicchalābhī akasiralābhī; yathāvimuttaṃ cittaṃ paccavekkhati. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu ānāpānassatiṃ bhāvento nacirasseva akuppaṃ paṭivijjhatī’’ti. Sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Āraññakasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "98"
      },
      ". ‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhikkhu ānāpānassatiṃ bahulīkaronto nacirasseva akuppaṃ paṭivijjhati. Katamehi pañcahi? Idha, bhikkhave, bhikkhu appaṭṭho hoti appakicco subharo susantoso jīvitaparikkhāresu; appāhāro hoti anodarikattaṃ anuyutto; appamiddho hoti jāgariyaṃ anuyutto; āraññako hoti pantasenāsano; yathāvimuttaṃ cittaṃ paccavekkhati. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato ",
      " bhikkhu ānāpānassatiṃ bahulīkaronto nacirasseva akuppaṃ paṭivijjhatī’’ti. Aṭṭhamaṃ."
    ],
    "innerText": "98. ‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhikkhu ānāpānassatiṃ bahulīkaronto nacirasseva akuppaṃ paṭivijjhati. Katamehi pañcahi? Idha, bhikkhave, bhikkhu appaṭṭho hoti appakicco subharo susantoso jīvitaparikkhāresu; appāhāro hoti anodarikattaṃ anuyutto; appamiddho hoti jāgariyaṃ anuyutto; āraññako hoti pantasenāsano; yathāvimuttaṃ cittaṃ paccavekkhati. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu ānāpānassatiṃ bahulīkaronto nacirasseva akuppaṃ paṭivijjhatī’’ti. Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Sīhasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "99"
      },
      ". ‘‘Sīho, bhikkhave, migarājā sāyanhasamayaṃ āsayā nikkhamati; āsayā nikkhamitvā vijambhati; vijambhitvā samantā catuddisaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[catuddisā (syā. kaṃ. pī. ka.) a. ni. 4.33; saṃ. ni. 3.78 passitabbaṃ]"
      },
      " anuviloketi; samantā catuddisaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[catuddisā (syā. kaṃ. pī. ka.) a. ni. 4.33; saṃ. ni. 3.78 passitabbaṃ]"
      },
      " anuviloketvā tikkhattuṃ sīhanādaṃ nadati; tikkhattuṃ sīhanādaṃ naditvā gocarāya pakkamati. So hatthissa cepi pahāraṃ deti, sakkaccaññeva pahāraṃ deti, no asakkaccaṃ; mahiṃsassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mahisassa (sī. syā. kaṃ. pī.)]"
      },
      " cepi pahāraṃ deti, sakkaccaññeva pahāraṃ deti, no asakkaccaṃ; gavassa cepi pahāraṃ deti, sakkaccaññeva pahāraṃ deti, no asakkaccaṃ; dīpissa cepi ",
      " pahāraṃ deti, sakkaccaññeva pahāraṃ deti ",
      ", no asakkaccaṃ; khuddakānañcepi ",
      " pāṇānaṃ pahāraṃ deti antamaso sasabiḷārānampi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sasabiḷārānaṃ (ka.)]"
      },
      ", sakkaccaññeva pahāraṃ deti, no asakkaccaṃ. Taṃ kissa hetu? ‘Mā me yoggapatho nassā’ti."
    ],
    "innerText": "99. ‘‘Sīho, bhikkhave, migarājā sāyanhasamayaṃ āsayā nikkhamati; āsayā nikkhamitvā vijambhati; vijambhitvā samantā catuddisaṃ [catuddisā (syā. kaṃ. pī. ka.) a. ni. 4.33; saṃ. ni. 3.78 passitabbaṃ] anuviloketi; samantā catuddisaṃ [catuddisā (syā. kaṃ. pī. ka.) a. ni. 4.33; saṃ. ni. 3.78 passitabbaṃ] anuviloketvā tikkhattuṃ sīhanādaṃ nadati; tikkhattuṃ sīhanādaṃ naditvā gocarāya pakkamati. So hatthissa cepi pahāraṃ deti, sakkaccaññeva pahāraṃ deti, no asakkaccaṃ; mahiṃsassa [mahisassa (sī. syā. kaṃ. pī.)] cepi pahāraṃ deti, sakkaccaññeva pahāraṃ deti, no asakkaccaṃ; gavassa cepi pahāraṃ deti, sakkaccaññeva pahāraṃ deti, no asakkaccaṃ; dīpissa cepi pahāraṃ deti, sakkaccaññeva pahāraṃ deti , no asakkaccaṃ; khuddakānañcepi pāṇānaṃ pahāraṃ deti antamaso sasabiḷārānampi [sasabiḷārānaṃ (ka.)], sakkaccaññeva pahāraṃ deti, no asakkaccaṃ. Taṃ kissa hetu? ‘Mā me yoggapatho nassā’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sīhoti kho, bhikkhave, tathāgatassetaṃ adhivacanaṃ arahato sammāsambuddhassa. Yaṃ kho, bhikkhave, tathāgato parisāya dhammaṃ deseti, idamassa hoti sīhanādasmiṃ. Bhikkhūnañcepi, bhikkhave, tathāgato dhammaṃ deseti, sakkaccaññeva tathāgato dhammaṃ deseti, no asakkaccaṃ; bhikkhunīnañcepi, bhikkhave, tathāgato dhammaṃ deseti, sakkaccaññeva tathāgato dhammaṃ deseti, no asakkaccaṃ; upāsakānañcepi, bhikkhave, tathāgato dhammaṃ deseti, sakkaccaññeva ",
      " tathāgato dhammaṃ deseti, no asakkaccaṃ; upāsikānañcepi, bhikkhave, tathāgato dhammaṃ deseti, sakkaccaññeva tathāgato dhammaṃ deseti, no asakkaccaṃ; puthujjanānañcepi, bhikkhave, tathāgato dhammaṃ deseti antamaso annabhāranesādānampi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[annabhāranesādānaṃ (ka.)]"
      },
      ", sakkaccaññeva tathāgato dhammaṃ deseti, no asakkaccaṃ. Taṃ kissa hetu? Dhammagaru, bhikkhave, tathāgato dhammagāravo’’ti. Navamaṃ."
    ],
    "innerText": "‘‘Sīhoti kho, bhikkhave, tathāgatassetaṃ adhivacanaṃ arahato sammāsambuddhassa. Yaṃ kho, bhikkhave, tathāgato parisāya dhammaṃ deseti, idamassa hoti sīhanādasmiṃ. Bhikkhūnañcepi, bhikkhave, tathāgato dhammaṃ deseti, sakkaccaññeva tathāgato dhammaṃ deseti, no asakkaccaṃ; bhikkhunīnañcepi, bhikkhave, tathāgato dhammaṃ deseti, sakkaccaññeva tathāgato dhammaṃ deseti, no asakkaccaṃ; upāsakānañcepi, bhikkhave, tathāgato dhammaṃ deseti, sakkaccaññeva tathāgato dhammaṃ deseti, no asakkaccaṃ; upāsikānañcepi, bhikkhave, tathāgato dhammaṃ deseti, sakkaccaññeva tathāgato dhammaṃ deseti, no asakkaccaṃ; puthujjanānañcepi, bhikkhave, tathāgato dhammaṃ deseti antamaso annabhāranesādānampi [annabhāranesādānaṃ (ka.)], sakkaccaññeva tathāgato dhammaṃ deseti, no asakkaccaṃ. Taṃ kissa hetu? Dhammagaru, bhikkhave, tathāgato dhammagāravo’’ti. Navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Kakudhatherasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "100"
      },
      ". Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā kosambiyaṃ viharati ghositārāme. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[cūḷava. 333, 341]"
      },
      " Tena kho pana samayena kakudho nāma koliyaputto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[koḷīyaputto (sī. syā. ka.)]"
      },
      " āyasmato mahāmoggallānassa upaṭṭhāko adhunākālaṅkato aññataraṃ manomayaṃ kāyaṃ upapanno. Tassa evarūpo attabhāvapaṭilābho hoti – seyyathāpi nāma dve vā tīṇi vā māgadhakāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[māgadhikāni (sī. pī. ka.)]"
      },
      " gāmakkhettāni. So tena attabhāvapaṭilābhena neva attānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[nevattānaṃ byābādheti (sī.)]"
      },
      " no paraṃ byābādheti."
    ],
    "innerText": "100. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā kosambiyaṃ viharati ghositārāme. [cūḷava. 333, 341] Tena kho pana samayena kakudho nāma koliyaputto [koḷīyaputto (sī. syā. ka.)] āyasmato mahāmoggallānassa upaṭṭhāko adhunākālaṅkato aññataraṃ manomayaṃ kāyaṃ upapanno. Tassa evarūpo attabhāvapaṭilābho hoti – seyyathāpi nāma dve vā tīṇi vā māgadhakāni [māgadhikāni (sī. pī. ka.)] gāmakkhettāni. So tena attabhāvapaṭilābhena neva attānaṃ [nevattānaṃ byābādheti (sī.)] no paraṃ byābādheti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho kakudho devaputto yenāyasmā mahāmoggallāno tenupasaṅkami; upasaṅkamitvā āyasmantaṃ mahāmoggallānaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhito ",
      " kho kakudho devaputto āyasmantaṃ mahāmoggallānaṃ ",
      " etadavoca – ‘‘devadattassa, bhante, evarūpaṃ icchāgataṃ uppajji – ‘ahaṃ bhikkhusaṅghaṃ pariharissāmī’ti. Sahacittuppādā ca, bhante, devadatto tassā iddhiyā parihīno’’ti. Idamavoca kakudho devaputto. Idaṃ vatvā āyasmantaṃ mahāmoggallānaṃ abhivādetvā padakkhiṇaṃ katvā tatthevantaradhāyi."
    ],
    "innerText": "Atha kho kakudho devaputto yenāyasmā mahāmoggallāno tenupasaṅkami; upasaṅkamitvā āyasmantaṃ mahāmoggallānaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhito kho kakudho devaputto āyasmantaṃ mahāmoggallānaṃ etadavoca – ‘‘devadattassa, bhante, evarūpaṃ icchāgataṃ uppajji – ‘ahaṃ bhikkhusaṅghaṃ pariharissāmī’ti. Sahacittuppādā ca, bhante, devadatto tassā iddhiyā parihīno’’ti. Idamavoca kakudho devaputto. Idaṃ vatvā āyasmantaṃ mahāmoggallānaṃ abhivādetvā padakkhiṇaṃ katvā tatthevantaradhāyi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " kho āyasmā mahāmoggallāno yena bhagavā tenupasaṅkami ",
      "; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā mahāmoggallāno bhagavantaṃ etadavoca –"
    ],
    "innerText": "Atha kho āyasmā mahāmoggallāno yena bhagavā tenupasaṅkami ; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā mahāmoggallāno bhagavantaṃ etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kakudho nāma, bhante, koliyaputto mamaṃ upaṭṭhāko adhunākālaṅkato aññataraṃ manomayaṃ kāyaṃ upapanno hoti. Tassa evarūpo attabhāvapaṭilābho – seyyathāpi nāma dve vā tīṇi vā māgadhakāni gāmakkhettāni. So tena attabhāvapaṭilābhena neva attānaṃ no paraṃ byābādheti. Atha kho, bhante, kakudho devaputto yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhito kho, bhante, kakudho devaputto maṃ etadavoca – ‘devadattassa, bhante, evarūpaṃ icchāgataṃ uppajji – ahaṃ bhikkhusaṅghaṃ pariharissāmīti. Sahacittuppādā ca, bhante, devadatto tassā iddhiyā parihīno’ti. Idamavoca, bhante, kakudho devaputto. Idaṃ vatvā maṃ abhivādetvā padakkhiṇaṃ katvā tatthevantaradhāyī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kiṃ pana te, moggallāna, kakudho devaputto cetasā ceto paricca vidito – ‘yaṃ kiñci kakudho devaputto bhāsati sabbaṃ taṃ tatheva hoti, no aññathā’’’ti? ‘‘Cetasā ceto paricca vidito me, bhante, kakudho devaputto – ‘yaṃ kiñci kakudho devaputto bhāsati sabbaṃ taṃ tatheva hoti, no aññathā’’’ti. ‘‘Rakkhassetaṃ, moggallāna, vācaṃ! (Rakkhassetaṃ, moggallāna, vācaṃ) ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[( ) sī. syā. kaṃ. pī. potthakesu natthi cūḷava. 333 pana sabbatthapi dissatiyeva]"
      },
      "! Idāni so moghapuriso attanāva attānaṃ pātukarissati ",
      "."
    ],
    "innerText": "‘‘Kiṃ pana te, moggallāna, kakudho devaputto cetasā ceto paricca vidito – ‘yaṃ kiñci kakudho devaputto bhāsati sabbaṃ taṃ tatheva hoti, no aññathā’’’ti? ‘‘Cetasā ceto paricca vidito me, bhante, kakudho devaputto – ‘yaṃ kiñci kakudho devaputto bhāsati sabbaṃ taṃ tatheva hoti, no aññathā’’’ti. ‘‘Rakkhassetaṃ, moggallāna, vācaṃ! (Rakkhassetaṃ, moggallāna, vācaṃ) [( ) sī. syā. kaṃ. pī. potthakesu natthi cūḷava. 333 pana sabbatthapi dissatiyeva]! Idāni so moghapuriso attanāva attānaṃ pātukarissati ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Pañcime, moggallāna, satthāro santo saṃvijjamānā lokasmiṃ. Katame pañca? Idha ",
      ", moggallāna, ekacco satthā aparisuddhasīlo samāno ‘parisuddhasīlomhī’ti paṭijānāti ‘parisuddhaṃ me sīlaṃ pariyodātaṃ ",
      " asaṃkiliṭṭha’nti. Tamenaṃ sāvakā evaṃ jānanti – ‘ayaṃ kho bhavaṃ satthā aparisuddhasīlo samāno parisuddhasīlomhī’ti paṭijānāti ‘parisuddhaṃ me sīlaṃ pariyodātaṃ asaṃkiliṭṭha’nti. Mayañceva kho pana gihīnaṃ āroceyyāma, nāssassa manāpaṃ. Yaṃ kho panassa amanāpaṃ, kathaṃ naṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kathaṃ nu taṃ (sī.), kathaṃ nu (syā. kaṃ. pī. ka.), kathaṃ taṃ (katthaci)]"
      },
      " mayaṃ tena samudācareyyāma – ‘sammannati kho pana cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārena; yaṃ tumo karissati tumova tena paññāyissatī’ti ",
      ". Evarūpaṃ kho, moggallāna, satthāraṃ sāvakā sīlato rakkhanti; evarūpo ca pana satthā sāvakehi sīlato rakkhaṃ paccāsīsati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[paccāsiṃsati (sī. syā. kaṃ. pī.)]"
      },
      "."
    ],
    "innerText": "‘‘Pañcime, moggallāna, satthāro santo saṃvijjamānā lokasmiṃ. Katame pañca? Idha , moggallāna, ekacco satthā aparisuddhasīlo samāno ‘parisuddhasīlomhī’ti paṭijānāti ‘parisuddhaṃ me sīlaṃ pariyodātaṃ asaṃkiliṭṭha’nti. Tamenaṃ sāvakā evaṃ jānanti – ‘ayaṃ kho bhavaṃ satthā aparisuddhasīlo samāno parisuddhasīlomhī’ti paṭijānāti ‘parisuddhaṃ me sīlaṃ pariyodātaṃ asaṃkiliṭṭha’nti. Mayañceva kho pana gihīnaṃ āroceyyāma, nāssassa manāpaṃ. Yaṃ kho panassa amanāpaṃ, kathaṃ naṃ [kathaṃ nu taṃ (sī.), kathaṃ nu (syā. kaṃ. pī. ka.), kathaṃ taṃ (katthaci)] mayaṃ tena samudācareyyāma – ‘sammannati kho pana cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārena; yaṃ tumo karissati tumova tena paññāyissatī’ti . Evarūpaṃ kho, moggallāna, satthāraṃ sāvakā sīlato rakkhanti; evarūpo ca pana satthā sāvakehi sīlato rakkhaṃ paccāsīsati [paccāsiṃsati (sī. syā. kaṃ. pī.)]."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, moggallāna, idhekacco satthā aparisuddhājīvo samāno ‘parisuddhājīvomhī’ti paṭijānāti ‘parisuddho me ājīvo pariyodāto asaṃkiliṭṭho’ti. Tamenaṃ sāvakā evaṃ jānanti – ‘ayaṃ kho bhavaṃ satthā aparisuddhājīvo samāno parisuddhājīvomhī’ti paṭijānāti ‘parisuddho me ājīvo pariyodāto asaṃkiliṭṭho’ti. Mayañceva kho pana gihīnaṃ āroceyyāma, nāssassa manāpaṃ. Yaṃ kho panassa amanāpaṃ, kathaṃ naṃ mayaṃ tena samudācareyyāma – ‘sammannati kho pana cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārena; yaṃ tumo karissati tumova tena paññāyissatī’ti. Evarūpaṃ kho, moggallāna, satthāraṃ sāvakā ājīvato rakkhanti; evarūpo ca pana satthā sāvakehi ājīvato rakkhaṃ paccāsīsati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, moggallāna, idhekacco satthā aparisuddhadhammadesano samāno ‘parisuddhadhammadesanomhī’ti paṭijānāti ‘parisuddhā me dhammadesanā pariyodātā asaṃkiliṭṭhā’ti. Tamenaṃ sāvakā evaṃ jānanti – ‘ayaṃ kho bhavaṃ satthā aparisuddhadhammadesano samāno parisuddhadhammadesanomhī’ti ",
      " paṭijānāti ‘parisuddhā me dhammadesanā pariyodātā asaṃkiliṭṭhā’ti. Mayañceva kho pana gihīnaṃ āroceyyāma, nāssassa manāpaṃ. Yaṃ kho panassa amanāpaṃ, kathaṃ naṃ mayaṃ tena samudācareyyāma – ‘sammannati kho pana cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārena; yaṃ ",
      " tumo karissati tumova tena paññāyissatī’ti. Evarūpaṃ kho, moggallāna, satthāraṃ sāvakā dhammadesanato rakkhanti ",
      "; evarūpo ca pana satthā sāvakehi dhammadesanato rakkhaṃ paccāsīsati."
    ],
    "innerText": "‘‘Puna caparaṃ, moggallāna, idhekacco satthā aparisuddhadhammadesano samāno ‘parisuddhadhammadesanomhī’ti paṭijānāti ‘parisuddhā me dhammadesanā pariyodātā asaṃkiliṭṭhā’ti. Tamenaṃ sāvakā evaṃ jānanti – ‘ayaṃ kho bhavaṃ satthā aparisuddhadhammadesano samāno parisuddhadhammadesanomhī’ti paṭijānāti ‘parisuddhā me dhammadesanā pariyodātā asaṃkiliṭṭhā’ti. Mayañceva kho pana gihīnaṃ āroceyyāma, nāssassa manāpaṃ. Yaṃ kho panassa amanāpaṃ, kathaṃ naṃ mayaṃ tena samudācareyyāma – ‘sammannati kho pana cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārena; yaṃ tumo karissati tumova tena paññāyissatī’ti. Evarūpaṃ kho, moggallāna, satthāraṃ sāvakā dhammadesanato rakkhanti ; evarūpo ca pana satthā sāvakehi dhammadesanato rakkhaṃ paccāsīsati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, moggallāna, idhekacco satthā aparisuddhaveyyākaraṇo samāno ‘parisuddhaveyyākaraṇomhī’ti paṭijānāti ‘parisuddhaṃ me veyyākaraṇaṃ pariyodātaṃ asaṃkiliṭṭha’nti. Tamenaṃ sāvakā evaṃ jānanti – ‘ayaṃ kho bhavaṃ satthā aparisuddhaveyyākaraṇo samāno parisuddhaveyyākaraṇomhī’ti paṭijānāti ‘parisuddhaṃ me veyyākaraṇaṃ pariyodātaṃ asaṃkiliṭṭha’nti. Mayañceva kho pana gihīnaṃ āroceyyāma, nāssassa manāpaṃ ",
      ". Yaṃ kho panassa amanāpaṃ, kathaṃ naṃ mayaṃ tena samudācareyyāma – ‘sammannati kho pana cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārena; yaṃ tumo karissati tumova tena paññāyissatī’ti. Evarūpaṃ kho, moggallāna, satthāraṃ sāvakā veyyākaraṇato rakkhanti; evarūpo ca pana satthā sāvakehi veyyākaraṇato rakkhaṃ paccāsīsati."
    ],
    "innerText": "‘‘Puna caparaṃ, moggallāna, idhekacco satthā aparisuddhaveyyākaraṇo samāno ‘parisuddhaveyyākaraṇomhī’ti paṭijānāti ‘parisuddhaṃ me veyyākaraṇaṃ pariyodātaṃ asaṃkiliṭṭha’nti. Tamenaṃ sāvakā evaṃ jānanti – ‘ayaṃ kho bhavaṃ satthā aparisuddhaveyyākaraṇo samāno parisuddhaveyyākaraṇomhī’ti paṭijānāti ‘parisuddhaṃ me veyyākaraṇaṃ pariyodātaṃ asaṃkiliṭṭha’nti. Mayañceva kho pana gihīnaṃ āroceyyāma, nāssassa manāpaṃ . Yaṃ kho panassa amanāpaṃ, kathaṃ naṃ mayaṃ tena samudācareyyāma – ‘sammannati kho pana cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārena; yaṃ tumo karissati tumova tena paññāyissatī’ti. Evarūpaṃ kho, moggallāna, satthāraṃ sāvakā veyyākaraṇato rakkhanti; evarūpo ca pana satthā sāvakehi veyyākaraṇato rakkhaṃ paccāsīsati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, moggallāna, idhekacco satthā aparisuddhañāṇadassano samāno ‘parisuddhañāṇadassanomhī’ti paṭijānāti ‘parisuddhaṃ me ñāṇadassanaṃ pariyodātaṃ asaṃkiliṭṭha’nti. Tamenaṃ sāvakā evaṃ jānanti – ‘ayaṃ kho bhavaṃ satthā aparisuddhañāṇadassano samāno parisuddhañāṇadassanomhī’ti paṭijānāti ‘parisuddhaṃ me ñāṇadassanaṃ pariyodātaṃ asaṃkiliṭṭha’nti. Mayañceva kho pana gihīnaṃ āroceyyāma, nāssassa manāpaṃ. Yaṃ kho panassa amanāpaṃ, kathaṃ naṃ mayaṃ tena samudācareyyāma ",
      " – ‘sammannati kho pana cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārena; yaṃ tumo karissati tumova tena paññāyissatī’ti. Evarūpaṃ kho, moggallāna, satthāraṃ sāvakā ñāṇadassanato rakkhanti; evarūpo ca pana satthā sāvakehi ñāṇadassanato rakkhaṃ paccāsīsati. Ime kho, moggallāna, pañca satthāro santo saṃvijjamānā lokasmiṃ."
    ],
    "innerText": "‘‘Puna caparaṃ, moggallāna, idhekacco satthā aparisuddhañāṇadassano samāno ‘parisuddhañāṇadassanomhī’ti paṭijānāti ‘parisuddhaṃ me ñāṇadassanaṃ pariyodātaṃ asaṃkiliṭṭha’nti. Tamenaṃ sāvakā evaṃ jānanti – ‘ayaṃ kho bhavaṃ satthā aparisuddhañāṇadassano samāno parisuddhañāṇadassanomhī’ti paṭijānāti ‘parisuddhaṃ me ñāṇadassanaṃ pariyodātaṃ asaṃkiliṭṭha’nti. Mayañceva kho pana gihīnaṃ āroceyyāma, nāssassa manāpaṃ. Yaṃ kho panassa amanāpaṃ, kathaṃ naṃ mayaṃ tena samudācareyyāma – ‘sammannati kho pana cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārena; yaṃ tumo karissati tumova tena paññāyissatī’ti. Evarūpaṃ kho, moggallāna, satthāraṃ sāvakā ñāṇadassanato rakkhanti; evarūpo ca pana satthā sāvakehi ñāṇadassanato rakkhaṃ paccāsīsati. Ime kho, moggallāna, pañca satthāro santo saṃvijjamānā lokasmiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ahaṃ kho pana, moggallāna, parisuddhasīlo samāno ‘parisuddhasīlomhī’ti paṭijānāmi ‘parisuddhaṃ me sīlaṃ pariyodātaṃ asaṃkiliṭṭha’nti. Na ca maṃ sāvakā sīlato rakkhanti, na cāhaṃ sāvakehi sīlato rakkhaṃ paccāsīsāmi. Parisuddhājīvo samāno ‘parisuddhājīvomhī’ti paṭijānāmi ‘parisuddho me ājīvo pariyodāto asaṃkiliṭṭho’ti. Na ca maṃ sāvakā ",
      " ājīvato rakkhanti, na cāhaṃ sāvakehi ājīvato ",
      " rakkhaṃ paccāsīsāmi. Parisuddhadhammadesano samāno ‘parisuddhadhammadesanomhī’ti paṭijānāmi ‘parisuddhā me dhammadesanā pariyodātā asaṃkiliṭṭhā’ti. Na ca maṃ sāvakā dhammadesanato rakkhanti, na cāhaṃ sāvakehi dhammadesanato rakkhaṃ paccāsīsāmi. Parisuddhaveyyākaraṇo samāno ‘parisuddhaveyyākaraṇomhī’ti paṭijānāmi ‘parisuddhaṃ me veyyākaraṇaṃ pariyodātaṃ asaṃkiliṭṭha’nti. Na ca maṃ sāvakā veyyākaraṇato rakkhanti, na cāhaṃ sāvakehi veyyākaraṇato rakkhaṃ paccāsīsāmi. Parisuddhañāṇadassano samāno ‘parisuddhañāṇadassanomhī’ti paṭijānāmi ‘parisuddhaṃ me ñāṇadassanaṃ ",
      " pariyodātaṃ asaṃkiliṭṭha’nti. Na ca maṃ sāvakā ñāṇadassanato rakkhanti, na cāhaṃ sāvakehi ñāṇadassanato rakkhaṃ paccāsīsāmī’’ti. Dasamaṃ."
    ],
    "innerText": "‘‘Ahaṃ kho pana, moggallāna, parisuddhasīlo samāno ‘parisuddhasīlomhī’ti paṭijānāmi ‘parisuddhaṃ me sīlaṃ pariyodātaṃ asaṃkiliṭṭha’nti. Na ca maṃ sāvakā sīlato rakkhanti, na cāhaṃ sāvakehi sīlato rakkhaṃ paccāsīsāmi. Parisuddhājīvo samāno ‘parisuddhājīvomhī’ti paṭijānāmi ‘parisuddho me ājīvo pariyodāto asaṃkiliṭṭho’ti. Na ca maṃ sāvakā ājīvato rakkhanti, na cāhaṃ sāvakehi ājīvato rakkhaṃ paccāsīsāmi. Parisuddhadhammadesano samāno ‘parisuddhadhammadesanomhī’ti paṭijānāmi ‘parisuddhā me dhammadesanā pariyodātā asaṃkiliṭṭhā’ti. Na ca maṃ sāvakā dhammadesanato rakkhanti, na cāhaṃ sāvakehi dhammadesanato rakkhaṃ paccāsīsāmi. Parisuddhaveyyākaraṇo samāno ‘parisuddhaveyyākaraṇomhī’ti paṭijānāmi ‘parisuddhaṃ me veyyākaraṇaṃ pariyodātaṃ asaṃkiliṭṭha’nti. Na ca maṃ sāvakā veyyākaraṇato rakkhanti, na cāhaṃ sāvakehi veyyākaraṇato rakkhaṃ paccāsīsāmi. Parisuddhañāṇadassano samāno ‘parisuddhañāṇadassanomhī’ti paṭijānāmi ‘parisuddhaṃ me ñāṇadassanaṃ pariyodātaṃ asaṃkiliṭṭha’nti. Na ca maṃ sāvakā ñāṇadassanato rakkhanti, na cāhaṃ sāvakehi ñāṇadassanato rakkhaṃ paccāsīsāmī’’ti. Dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Kakudhavaggo pañcamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Dve ",
      " sampadā byākaraṇaṃ, phāsu akuppapañcamaṃ;"
    ],
    "innerText": "Dve sampadā byākaraṇaṃ, phāsu akuppapañcamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sutaṃ kathā āraññako, sīho ca kakudho dasāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dutiyapaṇṇāsakaṃ samattaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "3. Tatiyapaṇṇāsakaṃ"
  }
]