[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "(10) 5. Loṇakapallavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Accāyikasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "93"
      },
      ". ‘‘Tīṇimāni ",
      ", bhikkhave, kassakassa gahapatissa accāyikāni karaṇīyāni. Katamāni tīṇi? Idha, bhikkhave, kassako gahapati sīghaṃ sīghaṃ khettaṃ sukaṭṭhaṃ karoti sumatikataṃ. Sīghaṃ sīghaṃ khettaṃ sukaṭṭhaṃ karitvā ",
      " sumatikataṃ sīghaṃ sīghaṃ bījāni patiṭṭhāpeti. Sīghaṃ sīghaṃ bījāni patiṭṭhāpetvā sīghaṃ sīghaṃ udakaṃ abhinetipi ",
      " apanetipi. Imāni kho, bhikkhave, tīṇi kassakassa gahapatissa accāyikāni karaṇīyāni. Tassa kho taṃ, bhikkhave, kassakassa gahapatissa natthi sā iddhi vā ānubhāvo vā – ‘ajjeva me dhaññāni jāyantu, sveva gabbhīni hontu, uttarasveva paccantū’ti. Atha kho, bhikkhave, hoti so samayo yaṃ tassa kassakassa gahapatissa tāni dhaññāni utupariṇāmīni jāyantipi gabbhīnipi honti paccantipi."
    ],
    "innerText": "93. ‘‘Tīṇimāni , bhikkhave, kassakassa gahapatissa accāyikāni karaṇīyāni. Katamāni tīṇi? Idha, bhikkhave, kassako gahapati sīghaṃ sīghaṃ khettaṃ sukaṭṭhaṃ karoti sumatikataṃ. Sīghaṃ sīghaṃ khettaṃ sukaṭṭhaṃ karitvā sumatikataṃ sīghaṃ sīghaṃ bījāni patiṭṭhāpeti. Sīghaṃ sīghaṃ bījāni patiṭṭhāpetvā sīghaṃ sīghaṃ udakaṃ abhinetipi apanetipi. Imāni kho, bhikkhave, tīṇi kassakassa gahapatissa accāyikāni karaṇīyāni. Tassa kho taṃ, bhikkhave, kassakassa gahapatissa natthi sā iddhi vā ānubhāvo vā – ‘ajjeva me dhaññāni jāyantu, sveva gabbhīni hontu, uttarasveva paccantū’ti. Atha kho, bhikkhave, hoti so samayo yaṃ tassa kassakassa gahapatissa tāni dhaññāni utupariṇāmīni jāyantipi gabbhīnipi honti paccantipi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Evamevaṃ kho, bhikkhave, tīṇimāni bhikkhussa accāyikāni karaṇīyāni. Katamāni tīṇi? Adhisīlasikkhāsamādānaṃ, adhicittasikkhāsamādānaṃ, adhipaññāsikkhāsamādānaṃ – imāni kho, bhikkhave, tīṇi bhikkhussa accāyikāni karaṇīyāni. Tassa kho taṃ, bhikkhave, bhikkhuno natthi sā iddhi vā anubhāvo vā – ‘ajjeva me anupādāya āsavehi cittaṃ vimuccatu sve vā uttarasve vā’ti. Atha kho, bhikkhave, hoti so samayo yaṃ tassa bhikkhuno adhisīlampi sikkhato adhicittampi sikkhato adhipaññampi sikkhato anupādāya āsavehi cittaṃ vimuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘tibbo no chando bhavissati adhisīlasikkhāsamādāne, tibbo chando bhavissati adhicittasikkhāsamādāne ",
      ", tibbo chando bhavissati adhipaññāsikkhāsamādāne’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Paṭhamaṃ."
    ],
    "innerText": "‘‘Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘tibbo no chando bhavissati adhisīlasikkhāsamādāne, tibbo chando bhavissati adhicittasikkhāsamādāne , tibbo chando bhavissati adhipaññāsikkhāsamādāne’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Pavivekasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "94"
      },
      ". ‘‘Tīṇimāni ",
      ", bhikkhave, aññatitthiyā paribbājakā pavivekāni paññāpenti. Katamāni tīṇi? Cīvarapavivekaṃ, piṇḍapātapavivekaṃ, senāsanapavivekaṃ."
    ],
    "innerText": "94. ‘‘Tīṇimāni , bhikkhave, aññatitthiyā paribbājakā pavivekāni paññāpenti. Katamāni tīṇi? Cīvarapavivekaṃ, piṇḍapātapavivekaṃ, senāsanapavivekaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tatridaṃ, bhikkhave, aññatitthiyā paribbājakā cīvarapavivekasmiṃ paññāpenti, sāṇānipi dhārenti, masāṇānipi dhārenti, chavadussānipi dhārenti, paṃsukūlānipi dhārenti, tirīṭānipi dhārenti, ajinampi dhārenti, ajinakkhipampi dhārenti, kusacīrampi dhārenti, vākacīrampi dhārenti, phalakacīrampi dhārenti, kesakambalampi dhārenti, vālakambalampi dhārenti ",
      ", ulūkapakkhikampi ",
      " dhārenti. Idaṃ kho, bhikkhave, aññatitthiyā paribbājakā cīvarapavivekasmiṃ paññāpenti."
    ],
    "innerText": "‘‘Tatridaṃ, bhikkhave, aññatitthiyā paribbājakā cīvarapavivekasmiṃ paññāpenti, sāṇānipi dhārenti, masāṇānipi dhārenti, chavadussānipi dhārenti, paṃsukūlānipi dhārenti, tirīṭānipi dhārenti, ajinampi dhārenti, ajinakkhipampi dhārenti, kusacīrampi dhārenti, vākacīrampi dhārenti, phalakacīrampi dhārenti, kesakambalampi dhārenti, vālakambalampi dhārenti , ulūkapakkhikampi dhārenti. Idaṃ kho, bhikkhave, aññatitthiyā paribbājakā cīvarapavivekasmiṃ paññāpenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tatridaṃ, bhikkhave, aññatitthiyā paribbājakā piṇḍapātapavivekasmiṃ paññāpenti. Sākabhakkhāpi honti, sāmākabhakkhāpi honti, nīvārabhakkhāpi honti, daddulabhakkhāpi honti, haṭabhakkhāpi honti, kaṇabhakkhāpi honti, ācāmabhakkhāpi honti, piññākabhakkhāpi honti, tiṇabhakkhāpi honti, gomayabhakkhāpi honti, vanamūlaphalāhārā yāpenti pavattaphalabhojī. Idaṃ kho, bhikkhave, aññatitthiyā paribbājakā piṇḍapātapavivekasmiṃ paññāpenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tatridaṃ, bhikkhave, aññatitthiyā paribbājakā senāsanapavivekasmiṃ paññāpenti araññaṃ rukkhamūlaṃ susānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[rukkhamūlaṃ bhusāgāraṃ susānaṃ (ka.)]"
      },
      " vanapatthaṃ abbhokāsaṃ palālapuñjaṃ bhusāgāraṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[suññāgāraṃ (ka.)]"
      },
      ". Idaṃ kho, bhikkhave, aññatitthiyā paribbājakā senāsanapavivekasmiṃ paññāpenti. Imāni kho, bhikkhave, tīṇi ",
      " aññatitthiyā paribbājakā pavivekāni paññāpenti."
    ],
    "innerText": "‘‘Tatridaṃ, bhikkhave, aññatitthiyā paribbājakā senāsanapavivekasmiṃ paññāpenti araññaṃ rukkhamūlaṃ susānaṃ [rukkhamūlaṃ bhusāgāraṃ susānaṃ (ka.)] vanapatthaṃ abbhokāsaṃ palālapuñjaṃ bhusāgāraṃ [suññāgāraṃ (ka.)]. Idaṃ kho, bhikkhave, aññatitthiyā paribbājakā senāsanapavivekasmiṃ paññāpenti. Imāni kho, bhikkhave, tīṇi aññatitthiyā paribbājakā pavivekāni paññāpenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tīṇi kho panimāni, bhikkhave, imasmiṃ dhammavinaye bhikkhuno pavivekāni. Katamāni tīṇi? Idha, bhikkhave, bhikkhu sīlavā ca hoti, dussīlyañcassa pahīnaṃ hoti, tena ca vivitto hoti; sammādiṭṭhiko ca hoti, micchādiṭṭhi cassa pahīnā hoti, tāya ca vivitto hoti; khīṇāsavo ca hoti, āsavā cassa pahīnā honti, tehi ca vivitto hoti ",
      ". Yato kho, bhikkhave, bhikkhu sīlavā hoti, dussīlyañcassa pahīnaṃ hoti, tena ca vivitto hoti; sammādiṭṭhiko ca hoti, micchādiṭṭhi cassa pahīnā hoti, tāya ca vivitto hoti; khīṇāsavo ca hoti, āsavā cassa pahīnā honti, tehi ca vivitto hoti. Ayaṃ vuccati, bhikkhave, ‘bhikkhu aggappatto sārappatto suddho sāre patiṭṭhito’’’."
    ],
    "innerText": "‘‘Tīṇi kho panimāni, bhikkhave, imasmiṃ dhammavinaye bhikkhuno pavivekāni. Katamāni tīṇi? Idha, bhikkhave, bhikkhu sīlavā ca hoti, dussīlyañcassa pahīnaṃ hoti, tena ca vivitto hoti; sammādiṭṭhiko ca hoti, micchādiṭṭhi cassa pahīnā hoti, tāya ca vivitto hoti; khīṇāsavo ca hoti, āsavā cassa pahīnā honti, tehi ca vivitto hoti . Yato kho, bhikkhave, bhikkhu sīlavā hoti, dussīlyañcassa pahīnaṃ hoti, tena ca vivitto hoti; sammādiṭṭhiko ca hoti, micchādiṭṭhi cassa pahīnā hoti, tāya ca vivitto hoti; khīṇāsavo ca hoti, āsavā cassa pahīnā honti, tehi ca vivitto hoti. Ayaṃ vuccati, bhikkhave, ‘bhikkhu aggappatto sārappatto suddho sāre patiṭṭhito’’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, bhikkhave, kassakassa gahapatissa sampannaṃ sālikkhettaṃ. Tamenaṃ kassako gahapati sīghaṃ sīghaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sīghasīghaṃ (sī. syā. kaṃ. pī.)]"
      },
      " lavāpeyya. Sīghaṃ sīghaṃ lavāpetvā sīghaṃ sīghaṃ saṅgharāpeyya. Sīghaṃ sīghaṃ saṅgharāpetvā sīghaṃ sīghaṃ ",
      " ubbahāpeyya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ubbāhāpeyya (syā. kaṃ.)]"
      },
      ". Sīghaṃ sīghaṃ ubbahāpetvā sīghaṃ sīghaṃ puñjaṃ kārāpeyya. Sīghaṃ sīghaṃ puñjaṃ kārāpetvā sīghaṃ sīghaṃ maddāpeyya. Sīghaṃ sīghaṃ maddāpetvā sīghaṃ sīghaṃ palālāni uddharāpeyya. Sīghaṃ sīghaṃ palālāni uddharāpetvā sīghaṃ sīghaṃ bhusikaṃ uddharāpeyya. Sīghaṃ sīghaṃ bhusikaṃ uddharāpetvā sīghaṃ sīghaṃ opunāpeyya. Sīghaṃ sīghaṃ opunāpetvā sīghaṃ sīghaṃ atiharāpeyya. Sīghaṃ sīghaṃ atiharāpetvā sīghaṃ ",
      " sīghaṃ koṭṭāpeyya. Sīghaṃ sīghaṃ koṭṭāpetvā sīghaṃ sīghaṃ thusāni uddharāpeyya. Evamassu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[evassu (ka.)]"
      },
      " tāni, bhikkhave, kassakassa gahapatissa dhaññāni aggappattāni sārappattāni suddhāni sāre patiṭṭhitāni."
    ],
    "innerText": "‘‘Seyyathāpi, bhikkhave, kassakassa gahapatissa sampannaṃ sālikkhettaṃ. Tamenaṃ kassako gahapati sīghaṃ sīghaṃ [sīghasīghaṃ (sī. syā. kaṃ. pī.)] lavāpeyya. Sīghaṃ sīghaṃ lavāpetvā sīghaṃ sīghaṃ saṅgharāpeyya. Sīghaṃ sīghaṃ saṅgharāpetvā sīghaṃ sīghaṃ ubbahāpeyya [ubbāhāpeyya (syā. kaṃ.)]. Sīghaṃ sīghaṃ ubbahāpetvā sīghaṃ sīghaṃ puñjaṃ kārāpeyya. Sīghaṃ sīghaṃ puñjaṃ kārāpetvā sīghaṃ sīghaṃ maddāpeyya. Sīghaṃ sīghaṃ maddāpetvā sīghaṃ sīghaṃ palālāni uddharāpeyya. Sīghaṃ sīghaṃ palālāni uddharāpetvā sīghaṃ sīghaṃ bhusikaṃ uddharāpeyya. Sīghaṃ sīghaṃ bhusikaṃ uddharāpetvā sīghaṃ sīghaṃ opunāpeyya. Sīghaṃ sīghaṃ opunāpetvā sīghaṃ sīghaṃ atiharāpeyya. Sīghaṃ sīghaṃ atiharāpetvā sīghaṃ sīghaṃ koṭṭāpeyya. Sīghaṃ sīghaṃ koṭṭāpetvā sīghaṃ sīghaṃ thusāni uddharāpeyya. Evamassu [evassu (ka.)] tāni, bhikkhave, kassakassa gahapatissa dhaññāni aggappattāni sārappattāni suddhāni sāre patiṭṭhitāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Evamevaṃ kho, bhikkhave, yato bhikkhu sīlavā ca hoti, dussīlyañcassa pahīnaṃ hoti, tena ca vivitto hoti; sammādiṭṭhiko ca hoti, micchādiṭṭhi cassa pahīnā hoti, tāya ca vivitto hoti; khīṇāsavo ca hoti, āsavā cassa pahīnā honti, tehi ca vivitto hoti. Ayaṃ vuccati, bhikkhave, ‘bhikkhu aggappatto sārappatto suddho sāre patiṭṭhito’’’ti. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Saradasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "95"
      },
      ". ‘‘Seyyathāpi, bhikkhave, saradasamaye viddhe vigatavalāhake deve ādicco nabhaṃ abbhussakkamāno ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[abbhussukkamāno (sī. pī.)]"
      },
      " sabbaṃ ākāsagataṃ tamagataṃ abhivihacca bhāsate ca tapate ca virocati ca."
    ],
    "innerText": "95. ‘‘Seyyathāpi, bhikkhave, saradasamaye viddhe vigatavalāhake deve ādicco nabhaṃ abbhussakkamāno [abbhussukkamāno (sī. pī.)] sabbaṃ ākāsagataṃ tamagataṃ abhivihacca bhāsate ca tapate ca virocati ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evamevaṃ kho, bhikkhave, yato ariyasāvakassa virajaṃ vītamalaṃ dhammacakkhuṃ uppajjati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[udapādi (sabbattha)]"
      },
      ", saha ",
      " dassanuppādā, bhikkhave, ariyasāvakassa tīṇi saṃyojanāni pahīyanti – sakkāyadiṭṭhi, vicikicchā, sīlabbataparāmāso."
    ],
    "innerText": "‘‘Evamevaṃ kho, bhikkhave, yato ariyasāvakassa virajaṃ vītamalaṃ dhammacakkhuṃ uppajjati [udapādi (sabbattha)], saha dassanuppādā, bhikkhave, ariyasāvakassa tīṇi saṃyojanāni pahīyanti – sakkāyadiṭṭhi, vicikicchā, sīlabbataparāmāso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Athāparaṃ dvīhi dhammehi niyyāti abhijjhāya ca byāpādena ca. So vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati. Tasmiṃ ce, bhikkhave, samaye ariyasāvako kālaṃ kareyya, natthi taṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[tassa (ka.)]"
      },
      " saṃyojanaṃ yena ",
      " saṃyojanena saṃyutto ariyasāvako puna imaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[punayimaṃ (syā. kaṃ. ka.)]"
      },
      " lokaṃ āgaccheyyā’’ti. Tatiyaṃ."
    ],
    "innerText": "‘‘Athāparaṃ dvīhi dhammehi niyyāti abhijjhāya ca byāpādena ca. So vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati. Tasmiṃ ce, bhikkhave, samaye ariyasāvako kālaṃ kareyya, natthi taṃ [tassa (ka.)] saṃyojanaṃ yena saṃyojanena saṃyutto ariyasāvako puna imaṃ [punayimaṃ (syā. kaṃ. ka.)] lokaṃ āgaccheyyā’’ti. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Parisāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "96"
      },
      ". ‘‘Tisso ",
      " imā, bhikkhave, parisā. Katamā tisso? Aggavatī parisā, vaggā parisā, samaggā parisā."
    ],
    "innerText": "96. ‘‘Tisso imā, bhikkhave, parisā. Katamā tisso? Aggavatī parisā, vaggā parisā, samaggā parisā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamā ",
      " ca, bhikkhave, aggavatī parisā? Idha, bhikkhave, yassaṃ parisāyaṃ therā bhikkhū na bāhulikā honti na sāthalikā, okkamane nikkhittadhurā paviveke pubbaṅgamā, vīriyaṃ ārabhanti appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya, tesaṃ pacchimā janatā diṭṭhānugatiṃ āpajjati. Sāpi hoti na bāhulikā na sāthalikā okkamane nikkhittadhurā paviveke pubbaṅgamā, vīriyaṃ ārabhati appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya. Ayaṃ vuccati, bhikkhave, aggavatī parisā."
    ],
    "innerText": "‘‘Katamā ca, bhikkhave, aggavatī parisā? Idha, bhikkhave, yassaṃ parisāyaṃ therā bhikkhū na bāhulikā honti na sāthalikā, okkamane nikkhittadhurā paviveke pubbaṅgamā, vīriyaṃ ārabhanti appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya, tesaṃ pacchimā janatā diṭṭhānugatiṃ āpajjati. Sāpi hoti na bāhulikā na sāthalikā okkamane nikkhittadhurā paviveke pubbaṅgamā, vīriyaṃ ārabhati appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya. Ayaṃ vuccati, bhikkhave, aggavatī parisā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamā ca, bhikkhave, vaggā parisā? Idha, bhikkhave, yassaṃ parisāyaṃ bhikkhū bhaṇḍanajātā kalahajātā vivādāpannā aññamaññaṃ mukhasattīhi vitudantā viharanti, ayaṃ vuccati, bhikkhave, vaggā parisā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamā ca, bhikkhave, samaggā parisā? Idha, bhikkhave, yassaṃ parisāyaṃ bhikkhū samaggā sammodamānā avivadamānā khīrodakībhūtā aññamaññaṃ piyacakkhūhi sampassantā viharanti, ayaṃ vuccati, bhikkhave, samaggā parisā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yasmiṃ ",
      ", bhikkhave, samaye bhikkhū samaggā sammodamānā avivadamānā khīrodakībhūtā aññamaññaṃ piyacakkhūhi sampassantā viharanti, bahuṃ, bhikkhave, bhikkhū tasmiṃ samaye puññaṃ pasavanti. Brahmaṃ, bhikkhave, vihāraṃ tasmiṃ samaye bhikkhū viharanti, yadidaṃ muditāya cetovimuttiyā. Pamuditassa pīti jāyati, pītimanassa kāyo passambhati, passaddhakāyo sukhaṃ vediyati, sukhino cittaṃ ",
      " samādhiyati."
    ],
    "innerText": "‘‘Yasmiṃ , bhikkhave, samaye bhikkhū samaggā sammodamānā avivadamānā khīrodakībhūtā aññamaññaṃ piyacakkhūhi sampassantā viharanti, bahuṃ, bhikkhave, bhikkhū tasmiṃ samaye puññaṃ pasavanti. Brahmaṃ, bhikkhave, vihāraṃ tasmiṃ samaye bhikkhū viharanti, yadidaṃ muditāya cetovimuttiyā. Pamuditassa pīti jāyati, pītimanassa kāyo passambhati, passaddhakāyo sukhaṃ vediyati, sukhino cittaṃ samādhiyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, bhikkhave, uparipabbate thullaphusitake deve vassante taṃ udakaṃ yathāninnaṃ pavattamānaṃ pabbatakandarapadarasākhā paripūreti, pabbatakandarapadarasākhā paripūrā kusobbhe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kussumbhe (sī. pī.), kusumbhe (syā. kaṃ. ka.)]"
      },
      " paripūrenti, kusobbhā paripūrā mahāsobbhe ",
      " paripūrenti, mahāsobbhā paripūrā kunnadiyo paripūrenti, kunnadiyo paripūrā mahānadiyo paripūrenti, mahānadiyo paripūrā samuddaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[samuddasāgare (ka.)]"
      },
      " paripūrenti."
    ],
    "innerText": "‘‘Seyyathāpi, bhikkhave, uparipabbate thullaphusitake deve vassante taṃ udakaṃ yathāninnaṃ pavattamānaṃ pabbatakandarapadarasākhā paripūreti, pabbatakandarapadarasākhā paripūrā kusobbhe [kussumbhe (sī. pī.), kusumbhe (syā. kaṃ. ka.)] paripūrenti, kusobbhā paripūrā mahāsobbhe paripūrenti, mahāsobbhā paripūrā kunnadiyo paripūrenti, kunnadiyo paripūrā mahānadiyo paripūrenti, mahānadiyo paripūrā samuddaṃ [samuddasāgare (ka.)] paripūrenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evamevaṃ kho, bhikkhave, yasmiṃ samaye bhikkhū samaggā sammodamānā avivadamānā khīrodakībhūtā aññamaññaṃ piyacakkhūhi ",
      " sampassantā viharanti, bahuṃ, bhikkhave, bhikkhū tasmiṃ samaye puññaṃ pasavanti. Brahmaṃ, bhikkhave, vihāraṃ tasmiṃ samaye bhikkhū viharanti, yadidaṃ muditāya cetovimuttiyā. Pamuditassa pīti jāyati, pītimanassa kāyo passambhati, passaddhakāyo sukhaṃ vediyati, sukhino cittaṃ samādhiyati. Imā kho, bhikkhave, tisso parisā’’ti. Catutthaṃ."
    ],
    "innerText": "‘‘Evamevaṃ kho, bhikkhave, yasmiṃ samaye bhikkhū samaggā sammodamānā avivadamānā khīrodakībhūtā aññamaññaṃ piyacakkhūhi sampassantā viharanti, bahuṃ, bhikkhave, bhikkhū tasmiṃ samaye puññaṃ pasavanti. Brahmaṃ, bhikkhave, vihāraṃ tasmiṃ samaye bhikkhū viharanti, yadidaṃ muditāya cetovimuttiyā. Pamuditassa pīti jāyati, pītimanassa kāyo passambhati, passaddhakāyo sukhaṃ vediyati, sukhino cittaṃ samādhiyati. Imā kho, bhikkhave, tisso parisā’’ti. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Paṭhamaājānīyasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "97"
      },
      ". ‘‘Tīhi, bhikkhave, aṅgehi samannāgato rañño bhadro ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[bhaddo (ka.)]"
      },
      " assājānīyo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[saṅkhaṃ (sī. syā. kaṃ. pī.)]"
      },
      " gacchati. Katamehi tīhi? Idha, bhikkhave, rañño bhadro assājānīyo vaṇṇasampanno ca hoti balasampanno ca javasampanno ca. Imehi kho, bhikkhave, tīhi aṅgehi samannāgato rañño bhadro assājānīyo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhyaṃ gacchati. Evamevaṃ kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu āhuneyyo hoti pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ ",
      " lokassa. Katamehi tīhi ",
      "? Idha, bhikkhave, bhikkhu vaṇṇasampanno ca hoti balasampanno ca javasampanno ca."
    ],
    "innerText": "97. ‘‘Tīhi, bhikkhave, aṅgehi samannāgato rañño bhadro [bhaddo (ka.)] assājānīyo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhyaṃ [saṅkhaṃ (sī. syā. kaṃ. pī.)] gacchati. Katamehi tīhi? Idha, bhikkhave, rañño bhadro assājānīyo vaṇṇasampanno ca hoti balasampanno ca javasampanno ca. Imehi kho, bhikkhave, tīhi aṅgehi samannāgato rañño bhadro assājānīyo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhyaṃ gacchati. Evamevaṃ kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu āhuneyyo hoti pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassa. Katamehi tīhi ? Idha, bhikkhave, bhikkhu vaṇṇasampanno ca hoti balasampanno ca javasampanno ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu vaṇṇasampanno hoti? Idha, bhikkhave, bhikkhu sīlavā hoti, pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu. Evaṃ kho, bhikkhave, bhikkhu vaṇṇasampanno hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, bhikkhu balasampanno hoti? Idha, bhikkhave, bhikkhu āraddhavīriyo viharati akusalānaṃ dhammānaṃ pahānāya kusalānaṃ dhammānaṃ ",
      " upasampadāya thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. Evaṃ kho, bhikkhave, bhikkhu balasampanno hoti."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu balasampanno hoti? Idha, bhikkhave, bhikkhu āraddhavīriyo viharati akusalānaṃ dhammānaṃ pahānāya kusalānaṃ dhammānaṃ upasampadāya thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. Evaṃ kho, bhikkhave, bhikkhu balasampanno hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, bhikkhu javasampanno hoti? Idha, bhikkhave, bhikkhu ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti; ‘ayaṃ dukkhasamudayo’ti yathābhūtaṃ pajānāti; ‘ayaṃ ",
      " dukkhanirodho’ti yathābhūtaṃ pajānāti; ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti. Evaṃ kho, bhikkhave, bhikkhu javasampanno hoti. Imehi kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu āhuneyyo hoti pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassā’’ti. Pañcamaṃ."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu javasampanno hoti? Idha, bhikkhave, bhikkhu ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti; ‘ayaṃ dukkhasamudayo’ti yathābhūtaṃ pajānāti; ‘ayaṃ dukkhanirodho’ti yathābhūtaṃ pajānāti; ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti. Evaṃ kho, bhikkhave, bhikkhu javasampanno hoti. Imehi kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu āhuneyyo hoti pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassā’’ti. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Dutiyaājānīyasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "98"
      },
      ". ‘‘Tīhi, bhikkhave, aṅgehi samannāgato rañño bhadro assājānīyo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhayaṃ gacchati. Katamehi tīhi? Idha, bhikkhave, rañño bhadro assājānīyo vaṇṇasampanno ca hoti balasampanno ca javasampanno ca. Imehi kho, bhikkhave, tīhi aṅgehi samannāgato rañño bhadro assājānīyo rājāraho ",
      " hoti rājabhoggo, rañño aṅganteva saṅkhyaṃ gacchati. Evamevaṃ kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassa. Katamehi tīhi? Idha, bhikkhave, bhikkhu vaṇṇasampanno ca hoti balasampanno ca javasampanno ca."
    ],
    "innerText": "98. ‘‘Tīhi, bhikkhave, aṅgehi samannāgato rañño bhadro assājānīyo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhayaṃ gacchati. Katamehi tīhi? Idha, bhikkhave, rañño bhadro assājānīyo vaṇṇasampanno ca hoti balasampanno ca javasampanno ca. Imehi kho, bhikkhave, tīhi aṅgehi samannāgato rañño bhadro assājānīyo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhyaṃ gacchati. Evamevaṃ kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassa. Katamehi tīhi? Idha, bhikkhave, bhikkhu vaṇṇasampanno ca hoti balasampanno ca javasampanno ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca ",
      ", bhikkhave, bhikkhu vaṇṇasampanno hoti? Idha, bhikkhave, bhikkhu sīlavā hoti…pe… samādāya sikkhati sikkhāpadesu. Evaṃ kho, bhikkhave, bhikkhu vaṇṇasampanno hoti."
    ],
    "innerText": "‘‘Kathañca , bhikkhave, bhikkhu vaṇṇasampanno hoti? Idha, bhikkhave, bhikkhu sīlavā hoti…pe… samādāya sikkhati sikkhāpadesu. Evaṃ kho, bhikkhave, bhikkhu vaṇṇasampanno hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu balasampanno hoti? Idha, bhikkhave, bhikkhu āraddhavīriyo viharati akusalānaṃ dhammānaṃ pahānāya kusalānaṃ dhammānaṃ upasampadāya thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. Evaṃ kho, bhikkhave, bhikkhu balasampanno hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, bhikkhu javasampanno hoti? Idha, bhikkhave, bhikkhu pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā opapātiko hoti tattha parinibbāyī ",
      " anāvattidhammo tasmā lokā. Evaṃ kho, bhikkhave, bhikkhu javasampanno hoti. Imehi kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassā’’ti. Chaṭṭhaṃ."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu javasampanno hoti? Idha, bhikkhave, bhikkhu pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā opapātiko hoti tattha parinibbāyī anāvattidhammo tasmā lokā. Evaṃ kho, bhikkhave, bhikkhu javasampanno hoti. Imehi kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassā’’ti. Chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Tatiyaājānīyasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "99"
      },
      ". ‘‘Tīhi, bhikkhave, aṅgehi samannāgato rañño bhadro assājānīyo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhayaṃ gacchati. Katamehi tīhi? Idha ",
      ", bhikkhave, rañño bhadro assājānīyo vaṇṇasampanno ca hoti balasampanno ca javasampanno ca. Imehi kho, bhikkhave, tīhi aṅgehi samannāgato rañño bhadro assājānīyo rājāraho ",
      " hoti rājabhoggo, rañño aṅganteva saṅkhyaṃ gacchati. Evamevaṃ kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu āhuneyyo hoti pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassa. Katamehi tīhi? Idha, bhikkhave, bhikkhu vaṇṇasampanno ca hoti balasampanno ca javasampanno ca."
    ],
    "innerText": "99. ‘‘Tīhi, bhikkhave, aṅgehi samannāgato rañño bhadro assājānīyo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhayaṃ gacchati. Katamehi tīhi? Idha , bhikkhave, rañño bhadro assājānīyo vaṇṇasampanno ca hoti balasampanno ca javasampanno ca. Imehi kho, bhikkhave, tīhi aṅgehi samannāgato rañño bhadro assājānīyo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhyaṃ gacchati. Evamevaṃ kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu āhuneyyo hoti pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassa. Katamehi tīhi? Idha, bhikkhave, bhikkhu vaṇṇasampanno ca hoti balasampanno ca javasampanno ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, bhikkhu vaṇṇasampanno hoti? Idha, bhikkhave, bhikkhu sīlavā hoti ",
      ", pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu. Evaṃ kho, bhikkhave, bhikkhu vaṇṇasampanno hoti."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu vaṇṇasampanno hoti? Idha, bhikkhave, bhikkhu sīlavā hoti , pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu. Evaṃ kho, bhikkhave, bhikkhu vaṇṇasampanno hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu balasampanno hoti? Idha, bhikkhave, bhikkhu āraddhavīriyo viharati akusalānaṃ dhammānaṃ pahānāya kusalānaṃ dhammānaṃ upasampadāya thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. Evaṃ kho, bhikkhave, bhikkhu balasampanno hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu javasampanno hoti? Idha, bhikkhave, bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Evaṃ kho, bhikkhave, bhikkhu javasampanno hoti. Imehi kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassā’’ti. Sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Potthakasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "100"
      },
      ". ‘‘Navopi ",
      ", bhikkhave, potthako dubbaṇṇo ca hoti dukkhasamphasso ca appaggho ca; majjhimopi, bhikkhave, potthako dubbaṇṇo ca hoti dukkhasamphasso ca appaggho ca; jiṇṇopi, bhikkhave, potthako dubbaṇṇo ca hoti dukkhasamphasso ca appaggho ca. Jiṇṇampi, bhikkhave, potthakaṃ ukkhaliparimajjanaṃ vā karonti saṅkārakūṭe ",
      " vā naṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[taṃ (sī.), ṭhāne (ka.)]"
      },
      " chaḍḍenti."
    ],
    "innerText": "100. ‘‘Navopi , bhikkhave, potthako dubbaṇṇo ca hoti dukkhasamphasso ca appaggho ca; majjhimopi, bhikkhave, potthako dubbaṇṇo ca hoti dukkhasamphasso ca appaggho ca; jiṇṇopi, bhikkhave, potthako dubbaṇṇo ca hoti dukkhasamphasso ca appaggho ca. Jiṇṇampi, bhikkhave, potthakaṃ ukkhaliparimajjanaṃ vā karonti saṅkārakūṭe vā naṃ [taṃ (sī.), ṭhāne (ka.)] chaḍḍenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evamevaṃ kho, bhikkhave, navo cepi bhikkhu hoti dussīlo pāpadhammo. Idamassa dubbaṇṇatāya vadāmi. Seyyathāpi ",
      " so, bhikkhave, potthako dubbaṇṇo tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. Ye kho panassa sevanti bhajanti payirupāsanti diṭṭhānugatiṃ āpajjanti, tesaṃ taṃ hoti dīgharattaṃ ahitāya dukkhāya. Idamassa dukkhasamphassatāya vadāmi. Seyyathāpi so, bhikkhave, potthako dukkhasamphasso tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. Yesaṃ kho pana so ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yesaṃ kho pana (sī. syā. kaṃ. pī.), yesaṃ so (ka.) pu. pa. 116 passitabbaṃ]"
      },
      " paṭiggaṇhāti cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhāraṃ, tesaṃ taṃ na mahapphalaṃ hoti na mahānisaṃsaṃ. Idamassa appagghatāya vadāmi ",
      ". Seyyathāpi so, bhikkhave, potthako appaggho tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. Majjhimo cepi, bhikkhave, bhikkhu hoti…pe… thero cepi, bhikkhave, bhikkhu hoti dussīlo pāpadhammo, idamassa dubbaṇṇatāya vadāmi. Seyyathāpi so, bhikkhave, potthako dubbaṇṇo tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. Ye kho panassa sevanti bhajanti payirupāsanti diṭṭhānugatiṃ āpajjanti, tesaṃ taṃ hoti dīgharattaṃ ahitāya dukkhāya. Idamassa dukkhasamphassatāya vadāmi. Seyyathāpi so, bhikkhave, potthako dukkhasamphasso tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. Yesaṃ kho pana so paṭiggaṇhāti cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhāraṃ, tesaṃ taṃ na mahapphalaṃ hoti na mahānisaṃsaṃ. Idamassa appagghatāya vadāmi. Seyyathāpi so, bhikkhave, potthako appaggho ",
      " tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi."
    ],
    "innerText": "‘‘Evamevaṃ kho, bhikkhave, navo cepi bhikkhu hoti dussīlo pāpadhammo. Idamassa dubbaṇṇatāya vadāmi. Seyyathāpi so, bhikkhave, potthako dubbaṇṇo tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. Ye kho panassa sevanti bhajanti payirupāsanti diṭṭhānugatiṃ āpajjanti, tesaṃ taṃ hoti dīgharattaṃ ahitāya dukkhāya. Idamassa dukkhasamphassatāya vadāmi. Seyyathāpi so, bhikkhave, potthako dukkhasamphasso tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. Yesaṃ kho pana so [yesaṃ kho pana (sī. syā. kaṃ. pī.), yesaṃ so (ka.) pu. pa. 116 passitabbaṃ] paṭiggaṇhāti cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhāraṃ, tesaṃ taṃ na mahapphalaṃ hoti na mahānisaṃsaṃ. Idamassa appagghatāya vadāmi . Seyyathāpi so, bhikkhave, potthako appaggho tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. Majjhimo cepi, bhikkhave, bhikkhu hoti…pe… thero cepi, bhikkhave, bhikkhu hoti dussīlo pāpadhammo, idamassa dubbaṇṇatāya vadāmi. Seyyathāpi so, bhikkhave, potthako dubbaṇṇo tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. Ye kho panassa sevanti bhajanti payirupāsanti diṭṭhānugatiṃ āpajjanti, tesaṃ taṃ hoti dīgharattaṃ ahitāya dukkhāya. Idamassa dukkhasamphassatāya vadāmi. Seyyathāpi so, bhikkhave, potthako dukkhasamphasso tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. Yesaṃ kho pana so paṭiggaṇhāti cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhāraṃ, tesaṃ taṃ na mahapphalaṃ hoti na mahānisaṃsaṃ. Idamassa appagghatāya vadāmi. Seyyathāpi so, bhikkhave, potthako appaggho tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evarūpo cāyaṃ, bhikkhave, thero bhikkhu saṅghamajjhe bhaṇati. Tamenaṃ bhikkhū evamāhaṃsu – ‘kiṃ nu kho tuyhaṃ bālassa abyattassa bhaṇitena, tvampi nāma bhaṇitabbaṃ maññasī’ti! So kupito anattamano tathārūpiṃ vācaṃ nicchāreti ",
      " yathārūpāya vācāya saṅgho taṃ ukkhipati, saṅkārakūṭeva naṃ potthakaṃ."
    ],
    "innerText": "‘‘Evarūpo cāyaṃ, bhikkhave, thero bhikkhu saṅghamajjhe bhaṇati. Tamenaṃ bhikkhū evamāhaṃsu – ‘kiṃ nu kho tuyhaṃ bālassa abyattassa bhaṇitena, tvampi nāma bhaṇitabbaṃ maññasī’ti! So kupito anattamano tathārūpiṃ vācaṃ nicchāreti yathārūpāya vācāya saṅgho taṃ ukkhipati, saṅkārakūṭeva naṃ potthakaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Navampi, bhikkhave, kāsikaṃ vatthaṃ vaṇṇavantañceva hoti sukhasamphassañca mahagghañca; majjhimampi, bhikkhave ",
      ", kāsikaṃ vatthaṃ vaṇṇavantañceva hoti sukhasamphassañca mahagghañca; jiṇṇampi, bhikkhave, kāsikaṃ vatthaṃ vaṇṇavantañceva hoti sukhasamphassañca mahagghañca. Jiṇṇampi, bhikkhave, kāsikaṃ vatthaṃ ratanapaliveṭhanaṃ vā karoti gandhakaraṇḍake vā naṃ pakkhipanti."
    ],
    "innerText": "‘‘Navampi, bhikkhave, kāsikaṃ vatthaṃ vaṇṇavantañceva hoti sukhasamphassañca mahagghañca; majjhimampi, bhikkhave , kāsikaṃ vatthaṃ vaṇṇavantañceva hoti sukhasamphassañca mahagghañca; jiṇṇampi, bhikkhave, kāsikaṃ vatthaṃ vaṇṇavantañceva hoti sukhasamphassañca mahagghañca. Jiṇṇampi, bhikkhave, kāsikaṃ vatthaṃ ratanapaliveṭhanaṃ vā karoti gandhakaraṇḍake vā naṃ pakkhipanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evamevaṃ kho, bhikkhave, navo cepi bhikkhu hoti sīlavā kalyāṇadhammo, idamassa suvaṇṇatāya vadāmi. Seyyathāpi taṃ, bhikkhave, kāsikaṃ vatthaṃ vaṇṇavantaṃ tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. Ye kho panassa sevanti bhajanti payirupāsanti diṭṭhānugatiṃ āpajjanti, tesaṃ taṃ hoti dīgharattaṃ hitāya sukhāya. Idamassa sukhasamphassatāya vadāmi. Seyyathāpi taṃ, bhikkhave, kāsikaṃ vatthaṃ sukhasamphassaṃ tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. Yesaṃ kho pana so paṭiggaṇhāti cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhāraṃ ",
      ", tesaṃ taṃ mahapphalaṃ hoti mahānisaṃsaṃ. Idamassa mahagghatāya vadāmi. Seyyathāpi taṃ, bhikkhave, kāsikaṃ vatthaṃ mahagghaṃ tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. Majjhimo ",
      " cepi, bhikkhave, bhikkhu hoti…pe… thero cepi, bhikkhave, bhikkhu hoti…pe… puggalaṃ vadāmi."
    ],
    "innerText": "‘‘Evamevaṃ kho, bhikkhave, navo cepi bhikkhu hoti sīlavā kalyāṇadhammo, idamassa suvaṇṇatāya vadāmi. Seyyathāpi taṃ, bhikkhave, kāsikaṃ vatthaṃ vaṇṇavantaṃ tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. Ye kho panassa sevanti bhajanti payirupāsanti diṭṭhānugatiṃ āpajjanti, tesaṃ taṃ hoti dīgharattaṃ hitāya sukhāya. Idamassa sukhasamphassatāya vadāmi. Seyyathāpi taṃ, bhikkhave, kāsikaṃ vatthaṃ sukhasamphassaṃ tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. Yesaṃ kho pana so paṭiggaṇhāti cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhāraṃ , tesaṃ taṃ mahapphalaṃ hoti mahānisaṃsaṃ. Idamassa mahagghatāya vadāmi. Seyyathāpi taṃ, bhikkhave, kāsikaṃ vatthaṃ mahagghaṃ tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi. Majjhimo cepi, bhikkhave, bhikkhu hoti…pe… thero cepi, bhikkhave, bhikkhu hoti…pe… puggalaṃ vadāmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evarūpo cāyaṃ, bhikkhave, thero bhikkhu saṅghamajjhe bhaṇati ",
      ". Tamenaṃ bhikkhū evamāhaṃsu – ‘appasaddā āyasmanto hotha, thero bhikkhu dhammañca vinayañca bhaṇatī’ti. Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘kāsikavatthūpamā bhavissāma, na potthakūpamā’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kāsikaṃ vatthaṃ tathūpamāhaṃ bhavissāmi, na potthakūpamāhanti (ka.)]"
      },
      ". Evañhi vo, bhikkhave, sikkhitabba’’nti. Aṭṭhamaṃ."
    ],
    "innerText": "‘‘Evarūpo cāyaṃ, bhikkhave, thero bhikkhu saṅghamajjhe bhaṇati . Tamenaṃ bhikkhū evamāhaṃsu – ‘appasaddā āyasmanto hotha, thero bhikkhu dhammañca vinayañca bhaṇatī’ti. Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘kāsikavatthūpamā bhavissāma, na potthakūpamā’ti [kāsikaṃ vatthaṃ tathūpamāhaṃ bhavissāmi, na potthakūpamāhanti (ka.)]. Evañhi vo, bhikkhave, sikkhitabba’’nti. Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Loṇakapallasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "101"
      },
      ". ‘‘Yo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yo kho (syā. kaṃ.), yo ca kho (ka.)]"
      },
      ", bhikkhave, evaṃ vadeyya – ‘yathā yathāyaṃ puriso kammaṃ karoti tathā tathā taṃ paṭisaṃvediyatī’ti, evaṃ santaṃ, bhikkhave, brahmacariyavāso na hoti, okāso na paññāyati sammā dukkhassa antakiriyāya ",
      ". Yo ca kho, bhikkhave, evaṃ vadeyya – ‘yathā yathā vedanīyaṃ ayaṃ puriso kammaṃ karoti tathā tathāssa vipākaṃ paṭisaṃvediyatī’ti, evaṃ santaṃ, bhikkhave, brahmacariyavāso hoti, okāso paññāyati sammā dukkhassa ",
      " antakiriyāya. Idha, bhikkhave, ekaccassa puggalassa appamattakampi pāpakammaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pāpaṃ kammaṃ (sī. pī.)]"
      },
      " kataṃ tamenaṃ nirayaṃ upaneti. Idha pana, bhikkhave, ekaccassa puggalassa tādisaṃyeva appamattakaṃ pāpakammaṃ kataṃ diṭṭhadhammavedanīyaṃ hoti, nā’ṇupi khāyati, kiṃ bahudeva."
    ],
    "innerText": "101. ‘‘Yo [yo kho (syā. kaṃ.), yo ca kho (ka.)], bhikkhave, evaṃ vadeyya – ‘yathā yathāyaṃ puriso kammaṃ karoti tathā tathā taṃ paṭisaṃvediyatī’ti, evaṃ santaṃ, bhikkhave, brahmacariyavāso na hoti, okāso na paññāyati sammā dukkhassa antakiriyāya . Yo ca kho, bhikkhave, evaṃ vadeyya – ‘yathā yathā vedanīyaṃ ayaṃ puriso kammaṃ karoti tathā tathāssa vipākaṃ paṭisaṃvediyatī’ti, evaṃ santaṃ, bhikkhave, brahmacariyavāso hoti, okāso paññāyati sammā dukkhassa antakiriyāya. Idha, bhikkhave, ekaccassa puggalassa appamattakampi pāpakammaṃ [pāpaṃ kammaṃ (sī. pī.)] kataṃ tamenaṃ nirayaṃ upaneti. Idha pana, bhikkhave, ekaccassa puggalassa tādisaṃyeva appamattakaṃ pāpakammaṃ kataṃ diṭṭhadhammavedanīyaṃ hoti, nā’ṇupi khāyati, kiṃ bahudeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathaṃrūpassa, bhikkhave, puggalassa appamattakampi pāpakammaṃ kataṃ tamenaṃ nirayaṃ upaneti? Idha pana, bhikkhave, ekacco puggalo abhāvitakāyo hoti abhāvitasīlo abhāvitacitto abhāvitapañño paritto appātumo appadukkhavihārī. Evarūpassa, bhikkhave, puggalassa appamattakampi pāpakammaṃ kataṃ tamenaṃ nirayaṃ upaneti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathaṃrūpassa, bhikkhave, puggalassa tādisaṃyeva appamattakaṃ pāpakammaṃ kataṃ diṭṭhadhammavedanīyaṃ hoti, nā’ṇupi khāyati, kiṃ bahudeva? Idha, bhikkhave, ekacco puggalo bhāvitakāyo ",
      " hoti bhāvitasīlo bhāvitacitto bhāvitapañño aparitto mahatto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mahattā (sī. syā. kaṃ. pī.)]"
      },
      " appamāṇavihārī. Evarūpassa, bhikkhave, puggalassa tādisaṃyeva appamattakaṃ pāpakammaṃ kataṃ diṭṭhadhammavedanīyaṃ hoti, nāṇupi khāyati, kiṃ bahudeva."
    ],
    "innerText": "‘‘Kathaṃrūpassa, bhikkhave, puggalassa tādisaṃyeva appamattakaṃ pāpakammaṃ kataṃ diṭṭhadhammavedanīyaṃ hoti, nā’ṇupi khāyati, kiṃ bahudeva? Idha, bhikkhave, ekacco puggalo bhāvitakāyo hoti bhāvitasīlo bhāvitacitto bhāvitapañño aparitto mahatto [mahattā (sī. syā. kaṃ. pī.)] appamāṇavihārī. Evarūpassa, bhikkhave, puggalassa tādisaṃyeva appamattakaṃ pāpakammaṃ kataṃ diṭṭhadhammavedanīyaṃ hoti, nāṇupi khāyati, kiṃ bahudeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi ",
      ", bhikkhave, puriso loṇakapallaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[loṇaphalaṃ (sī. syā. kaṃ. pī.)]"
      },
      " paritte udakamallake ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[udakakapallake (ka.)]"
      },
      " pakkhipeyya. Taṃ kiṃ maññatha, bhikkhave, api nu taṃ parittaṃ udakaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[udakamallake udakaṃ (sī. syā. kaṃ. pī.)]"
      },
      " amunā loṇakapallena loṇaṃ assa apeyya’’nti? ‘‘Evaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Aduñhi, bhante, parittaṃ udakakapallake udakaṃ, taṃ amunā loṇakapallena loṇaṃ assa apeyya’’nti. ‘‘Seyyathāpi, bhikkhave, puriso ",
      " loṇakapallakaṃ gaṅgāya nadiyā pakkhipeyya. Taṃ kiṃ maññatha, bhikkhave, api nu sā gaṅgā nadī amunā loṇakapallena loṇaṃ assa apeyyā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Asu hi, bhante, gaṅgāya nadiyā mahā udakakkhandho so amunā loṇakapallena loṇo na assa apeyyo’’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[loṇaṃ nevassa apeyyanti (sī.), na loṇo assa apeyyoti (pī.)]"
      },
      "."
    ],
    "innerText": "‘‘Seyyathāpi , bhikkhave, puriso loṇakapallaṃ [loṇaphalaṃ (sī. syā. kaṃ. pī.)] paritte udakamallake [udakakapallake (ka.)] pakkhipeyya. Taṃ kiṃ maññatha, bhikkhave, api nu taṃ parittaṃ udakaṃ [udakamallake udakaṃ (sī. syā. kaṃ. pī.)] amunā loṇakapallena loṇaṃ assa apeyya’’nti? ‘‘Evaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Aduñhi, bhante, parittaṃ udakakapallake udakaṃ, taṃ amunā loṇakapallena loṇaṃ assa apeyya’’nti. ‘‘Seyyathāpi, bhikkhave, puriso loṇakapallakaṃ gaṅgāya nadiyā pakkhipeyya. Taṃ kiṃ maññatha, bhikkhave, api nu sā gaṅgā nadī amunā loṇakapallena loṇaṃ assa apeyyā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Asu hi, bhante, gaṅgāya nadiyā mahā udakakkhandho so amunā loṇakapallena loṇo na assa apeyyo’’ti [loṇaṃ nevassa apeyyanti (sī.), na loṇo assa apeyyoti (pī.)]."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evamevaṃ ",
      " kho, bhikkhave, idhekaccassa puggalassa appamattakampi pāpakammaṃ kataṃ tamenaṃ nirayaṃ upaneti. Idha, bhikkhave, ekaccassa puggalassa tādisaṃyeva appamattakaṃ pāpakammaṃ kataṃ diṭṭhadhammavedanīyaṃ hoti, nāṇupi khāyati, kiṃ bahudeva."
    ],
    "innerText": "‘‘Evamevaṃ kho, bhikkhave, idhekaccassa puggalassa appamattakampi pāpakammaṃ kataṃ tamenaṃ nirayaṃ upaneti. Idha, bhikkhave, ekaccassa puggalassa tādisaṃyeva appamattakaṃ pāpakammaṃ kataṃ diṭṭhadhammavedanīyaṃ hoti, nāṇupi khāyati, kiṃ bahudeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathaṃrūpassa, bhikkhave, puggalassa appamattakampi pāpakammaṃ kataṃ tamenaṃ nirayaṃ upaneti? Idha, bhikkhave, ekacco puggalo abhāvitakāyo hoti abhāvitasīlo abhāvitacitto abhāvitapañño paritto appātumo appadukkhavihārī. Evarūpassa, bhikkhave, puggalassa appamattakampi pāpakammaṃ kataṃ tamenaṃ nirayaṃ upaneti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathaṃrūpassa, bhikkhave, puggalassa tādisaṃyeva appamattakaṃ pāpakammaṃ kataṃ diṭṭhadhammavedanīyaṃ hoti, nāṇupi khāyati, kiṃ bahudeva? Idha, bhikkhave, ekacco puggalo bhāvitakāyo hoti bhāvitasīlo bhāvitacitto bhāvitapañño aparitto mahatto appamāṇavihārī. Evarūpassa, bhikkhave, puggalassa tādisaṃyeva appamattakaṃ pāpakammaṃ kataṃ diṭṭhadhammavedanīyaṃ hoti, nāṇupi khāyati, kiṃ bahudeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idha ",
      ", bhikkhave, ekacco aḍḍhakahāpaṇenapi bandhanaṃ nigacchati, kahāpaṇenapi bandhanaṃ nigacchati, kahāpaṇasatenapi ",
      " bandhanaṃ nigacchati. Idha, bhikkhave, ekacco aḍḍhakahāpaṇenapi na bandhanaṃ nigacchati, kahāpaṇenapi na ",
      " bandhanaṃ nigacchati, kahāpaṇasatenapi na bandhanaṃ nigacchati."
    ],
    "innerText": "‘‘Idha , bhikkhave, ekacco aḍḍhakahāpaṇenapi bandhanaṃ nigacchati, kahāpaṇenapi bandhanaṃ nigacchati, kahāpaṇasatenapi bandhanaṃ nigacchati. Idha, bhikkhave, ekacco aḍḍhakahāpaṇenapi na bandhanaṃ nigacchati, kahāpaṇenapi na bandhanaṃ nigacchati, kahāpaṇasatenapi na bandhanaṃ nigacchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathaṃrūpo, bhikkhave, aḍḍhakahāpaṇenapi bandhanaṃ nigacchati, kahāpaṇenapi bandhanaṃ nigacchati, kahāpaṇasatenapi bandhanaṃ nigacchati? Idha, bhikkhave, ekacco daliddo hoti appassako appabhogo. Evarūpo, bhikkhave, aḍḍhakahāpaṇenapi bandhanaṃ nigacchati, kahāpaṇenapi bandhanaṃ nigacchati, kahāpaṇasatenapi bandhanaṃ nigacchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathaṃrūpo, bhikkhave, aḍḍhakahāpaṇenapi na bandhanaṃ nigacchati, kahāpaṇenapi na bandhanaṃ nigacchati, kahāpaṇasatenapi na bandhanaṃ nigacchati? Idha, bhikkhave, ekacco aḍḍho hoti mahaddhano mahābhogo. Evarūpo, bhikkhave, aḍḍhakahāpaṇenapi na bandhanaṃ nigacchati, kahāpaṇenapi na bandhanaṃ nigacchati, kahāpaṇasatenapi na bandhanaṃ nigacchati. Evamevaṃ kho, bhikkhave, idhekaccassa puggalassa appamattakaṃ pāpakammaṃ kataṃ. Tamenaṃ nirayaṃ upaneti. Idha ",
      ", bhikkhave, ekaccassa puggalassa tādisaṃyeva appamattakaṃ pāpakammaṃ kataṃ diṭṭhadhammavedanīyaṃ hoti, nāṇupi khāyati, kiṃ bahudeva."
    ],
    "innerText": "‘‘Kathaṃrūpo, bhikkhave, aḍḍhakahāpaṇenapi na bandhanaṃ nigacchati, kahāpaṇenapi na bandhanaṃ nigacchati, kahāpaṇasatenapi na bandhanaṃ nigacchati? Idha, bhikkhave, ekacco aḍḍho hoti mahaddhano mahābhogo. Evarūpo, bhikkhave, aḍḍhakahāpaṇenapi na bandhanaṃ nigacchati, kahāpaṇenapi na bandhanaṃ nigacchati, kahāpaṇasatenapi na bandhanaṃ nigacchati. Evamevaṃ kho, bhikkhave, idhekaccassa puggalassa appamattakaṃ pāpakammaṃ kataṃ. Tamenaṃ nirayaṃ upaneti. Idha , bhikkhave, ekaccassa puggalassa tādisaṃyeva appamattakaṃ pāpakammaṃ kataṃ diṭṭhadhammavedanīyaṃ hoti, nāṇupi khāyati, kiṃ bahudeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathaṃrūpassa, bhikkhave, puggalassa appamattakaṃ pāpakammaṃ kataṃ, tamenaṃ nirayaṃ upaneti? Idha, bhikkhave, ekacco puggalo abhāvitakāyo hoti abhāvitasīlo abhāvitacitto abhāvitapañño paritto appātumo appadukkhavihārī. Evarūpassa, bhikkhave, puggalassa tādisaṃyeva appamattakaṃ pāpakammaṃ kataṃ tamenaṃ nirayaṃ upaneti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathaṃrūpassa, bhikkhave, puggalassa tādisaṃyeva appamattakaṃ pāpakammaṃ kataṃ diṭṭhadhammavedanīyaṃ hoti, nāṇupi khāyati, kiṃ bahudeva? Idha, bhikkhave, ekacco puggalo bhāvitakāyo hoti bhāvitasīlo bhāvitacitto bhāvitapañño aparitto mahatto appamāṇavihārī. Evarūpassa, bhikkhave, puggalassa tādisaṃyeva appamattakaṃ pāpakammaṃ kataṃ diṭṭhadhammavedanīyaṃ hoti, nāṇupi khāyati, kiṃ bahudeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idha ",
      ", bhikkhave, ekacco puggalo bhāvitakāyo hoti bhāvitasīlo bhāvitacitto bhāvitapañño aparitto mahatto appamāṇavihārī. Evarūpassa, bhikkhave, puggalassa tādisaṃyeva appamattakaṃ pāpakammaṃ kataṃ diṭṭhadhammavedanīyaṃ hoti, nāṇupi khāyati, kiṃ bahudeva. Seyyathāpi, bhikkhave, orabbhiko vā urabbhaghātako vā ",
      " appekaccaṃ urabbhaṃ adinnaṃ ādiyamānaṃ pahoti hantuṃ vā bandhituṃ vā jāpetuṃ vā yathāpaccayaṃ vā kātuṃ, appekaccaṃ urabbhaṃ adinnaṃ ādiyamānaṃ nappahoti hantuṃ vā bandhituṃ vā jāpetuṃ vā yathāpaccayaṃ vā kātuṃ."
    ],
    "innerText": "‘‘Idha , bhikkhave, ekacco puggalo bhāvitakāyo hoti bhāvitasīlo bhāvitacitto bhāvitapañño aparitto mahatto appamāṇavihārī. Evarūpassa, bhikkhave, puggalassa tādisaṃyeva appamattakaṃ pāpakammaṃ kataṃ diṭṭhadhammavedanīyaṃ hoti, nāṇupi khāyati, kiṃ bahudeva. Seyyathāpi, bhikkhave, orabbhiko vā urabbhaghātako vā appekaccaṃ urabbhaṃ adinnaṃ ādiyamānaṃ pahoti hantuṃ vā bandhituṃ vā jāpetuṃ vā yathāpaccayaṃ vā kātuṃ, appekaccaṃ urabbhaṃ adinnaṃ ādiyamānaṃ nappahoti hantuṃ vā bandhituṃ vā jāpetuṃ vā yathāpaccayaṃ vā kātuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathaṃrūpaṃ, bhikkhave, orabbhiko vā urabbhaghātako vā urabbhaṃ adinnaṃ ādiyamānaṃ pahoti hantuṃ vā bandhituṃ vā jāpetuṃ vā yathāpaccayaṃ vā kātuṃ? Idha, bhikkhave, ekacco daliddo hoti appassako appabhogo. Evarūpaṃ ",
      ", bhikkhave, orabbhiko vā urabbhaghātako vā urabbhaṃ adinnaṃ ādiyamānaṃ pahoti hantuṃ vā bandhituṃ vā jāpetuṃ vā yathāpaccayaṃ vā kātuṃ."
    ],
    "innerText": "‘‘Kathaṃrūpaṃ, bhikkhave, orabbhiko vā urabbhaghātako vā urabbhaṃ adinnaṃ ādiyamānaṃ pahoti hantuṃ vā bandhituṃ vā jāpetuṃ vā yathāpaccayaṃ vā kātuṃ? Idha, bhikkhave, ekacco daliddo hoti appassako appabhogo. Evarūpaṃ , bhikkhave, orabbhiko vā urabbhaghātako vā urabbhaṃ adinnaṃ ādiyamānaṃ pahoti hantuṃ vā bandhituṃ vā jāpetuṃ vā yathāpaccayaṃ vā kātuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathaṃrūpaṃ, bhikkhave, orabbhiko vā urabbhaghātako vā urabbhaṃ adinnaṃ ādiyamānaṃ nappahoti hantuṃ vā bandhituṃ vā jāpetuṃ vā yathāpaccayaṃ vā kātuṃ ",
      ". Idha, bhikkhave, ekacco aḍḍho hoti mahaddhano mahābhogo rājā vā rājamahāmatto vā. Evarūpaṃ, bhikkhave, orabbhiko vā urabbhaghātako vā urabbhaṃ adinnaṃ ādiyamānaṃ nappahoti hantuṃ vā bandhituṃ vā jāpetuṃ vā yathāpaccayaṃ vā kātuṃ. Aññadatthu pañjalikova ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pañjaliko (ka.)]"
      },
      " naṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[paraṃ (ka.)]"
      },
      " yācati – ‘dehi me, mārisa, urabbhaṃ vā urabbhadhanaṃ vā’ti. Evamevaṃ kho, bhikkhave, idhekaccassa puggalassa tādisaṃyeva appamattakampi pāpakammaṃ kataṃ tamenaṃ nirayaṃ upaneti. Idha pana, bhikkhave, ekaccassa puggalassa tādisaṃyeva appamattakaṃ pāpakammaṃ kataṃ diṭṭhadhammavedanīyaṃ hoti, nāṇupi khāyati, kiṃ bahudeva."
    ],
    "innerText": "‘‘Kathaṃrūpaṃ, bhikkhave, orabbhiko vā urabbhaghātako vā urabbhaṃ adinnaṃ ādiyamānaṃ nappahoti hantuṃ vā bandhituṃ vā jāpetuṃ vā yathāpaccayaṃ vā kātuṃ . Idha, bhikkhave, ekacco aḍḍho hoti mahaddhano mahābhogo rājā vā rājamahāmatto vā. Evarūpaṃ, bhikkhave, orabbhiko vā urabbhaghātako vā urabbhaṃ adinnaṃ ādiyamānaṃ nappahoti hantuṃ vā bandhituṃ vā jāpetuṃ vā yathāpaccayaṃ vā kātuṃ. Aññadatthu pañjalikova [pañjaliko (ka.)] naṃ [paraṃ (ka.)] yācati – ‘dehi me, mārisa, urabbhaṃ vā urabbhadhanaṃ vā’ti. Evamevaṃ kho, bhikkhave, idhekaccassa puggalassa tādisaṃyeva appamattakampi pāpakammaṃ kataṃ tamenaṃ nirayaṃ upaneti. Idha pana, bhikkhave, ekaccassa puggalassa tādisaṃyeva appamattakaṃ pāpakammaṃ kataṃ diṭṭhadhammavedanīyaṃ hoti, nāṇupi khāyati, kiṃ bahudeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathaṃrūpassa, bhikkhave, puggalassa appamattakampi pāpakammaṃ kataṃ tamenaṃ nirayaṃ upaneti? Idha, bhikkhave, ekacco puggalo abhāvitakāyo hoti abhāvitasīlo abhāvitacitto abhāvitapañño paritto appātumo appadukkhavihārī. Evarūpassa, bhikkhave, puggalassa ",
      " appamattakampi pāpakammaṃ kataṃ tamenaṃ nirayaṃ upaneti."
    ],
    "innerText": "‘‘Kathaṃrūpassa, bhikkhave, puggalassa appamattakampi pāpakammaṃ kataṃ tamenaṃ nirayaṃ upaneti? Idha, bhikkhave, ekacco puggalo abhāvitakāyo hoti abhāvitasīlo abhāvitacitto abhāvitapañño paritto appātumo appadukkhavihārī. Evarūpassa, bhikkhave, puggalassa appamattakampi pāpakammaṃ kataṃ tamenaṃ nirayaṃ upaneti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathaṃrūpassa ",
      ", bhikkhave, puggalassa tādisaṃyeva appamattakaṃ pāpakammaṃ kataṃ diṭṭhadhammavedanīyaṃ hoti, nāṇupi khāyati, kiṃ bahudeva? Idha, bhikkhave, ekacco puggalo bhāvitakāyo hoti bhāvitasīlo bhāvitacitto bhāvitapañño aparitto mahatto appamāṇavihārī. Evarūpassa, bhikkhave, puggalassa tādisaṃyeva appamattakaṃ pāpakammaṃ kataṃ diṭṭhadhammavedanīyaṃ hoti, nāṇupi khāyati, kiṃ bahudeva."
    ],
    "innerText": "‘‘Kathaṃrūpassa , bhikkhave, puggalassa tādisaṃyeva appamattakaṃ pāpakammaṃ kataṃ diṭṭhadhammavedanīyaṃ hoti, nāṇupi khāyati, kiṃ bahudeva? Idha, bhikkhave, ekacco puggalo bhāvitakāyo hoti bhāvitasīlo bhāvitacitto bhāvitapañño aparitto mahatto appamāṇavihārī. Evarūpassa, bhikkhave, puggalassa tādisaṃyeva appamattakaṃ pāpakammaṃ kataṃ diṭṭhadhammavedanīyaṃ hoti, nāṇupi khāyati, kiṃ bahudeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Yo, bhikkhave, evaṃ vadeyya – ‘yathā yathāyaṃ puriso kammaṃ karoti tathā tathā taṃ paṭisaṃvedetī’ti, evaṃ santaṃ, bhikkhave, brahmacariyavāso na hoti, okāso na paññāyati sammā dukkhassa antakiriyāya. Yo ca kho, bhikkhave, evaṃ vadeyya – ‘yathā yathā vedanīyaṃ ayaṃ puriso kammaṃ karoti tathā tathā tassa vipākaṃ paṭisaṃvedetī’ti, evaṃ santaṃ, bhikkhave, brahmacariyavāso hoti, okāso paññāyati sammā dukkhassa antakiriyāyā’’ti. Navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Paṃsudhovakasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "102"
      },
      ". ‘‘Santi ",
      ", bhikkhave, jātarūpassa oḷārikā upakkilesā paṃsuvālukā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[paṃsuvālikā (sī. syā. kaṃ. pī.)]"
      },
      " sakkharakaṭhalā. Tamenaṃ paṃsudhovako vā paṃsudhovakantevāsī vā doṇiyaṃ ākiritvā dhovati sandhovati niddhovati. Tasmiṃ pahīne tasmiṃ byantīkate santi jātarūpassa majjhimasahagatā upakkilesā sukhumasakkharā thūlavālukā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[thūlavālikā (sī. pī.), thullavālikā (syā. kaṃ.)]"
      },
      ". Tamenaṃ paṃsudhovako vā paṃsudhovakantevāsī vā dhovati sandhovati niddhovati. Tasmiṃ pahīne tasmiṃ byantīkate santi jātarūpassa sukhumasahagatā upakkilesā sukhumavālukā kāḷajallikā. Tamenaṃ paṃsudhovako vā paṃsudhovakantevāsī vā dhovati sandhovati niddhovati. Tasmiṃ pahīne tasmiṃ byantīkate athāparaṃ suvaṇṇasikatāvasissanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[suvaṇṇajātarūpakāvasissanti (ka.)]"
      },
      ". Tamenaṃ suvaṇṇakāro vā suvaṇṇakārantevāsī vā jātarūpaṃ mūsāyaṃ pakkhipitvā dhamati sandhamati niddhamati ",
      ". Taṃ hoti jātarūpaṃ dhantaṃ sandhantaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[adhantaṃ asandhantaṃ (syā. kaṃ.)]"
      },
      " niddhantaṃ aniddhantakasāvaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[aniddhantaṃ anihitaṃ aninnītakasāvaṃ (sī. syā. kaṃ. pī.)]"
      },
      ", na ceva mudu hoti na ca kammaniyaṃ, na ca pabhassaraṃ pabhaṅgu ca, na ca sammā upeti kammāya. Hoti so, bhikkhave, samayo yaṃ suvaṇṇakāro vā suvaṇṇakārantevāsī vā taṃ jātarūpaṃ dhamati sandhamati niddhamati. Taṃ hoti jātarūpaṃ dhantaṃ sandhantaṃ niddhantaṃ niddhantakasāvaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[nihitaṃ ninnītakasāvaṃ (sī. syā. kaṃ. pī.)]"
      },
      ", mudu ca hoti kammaniyañca pabhassarañca, na ca pabhaṅgu, sammā ",
      " upeti kammāya. Yassā yassā ca pilandhanavikatiyā ākaṅkhati – yadi paṭṭikāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[muddikāya (a. ni. 5.23]"
      },
      ", yadi kuṇḍalāya, yadi gīveyyake ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[gīveyyakena (ka.), gīveyyakāya (?)]"
      },
      ", yadi suvaṇṇamālāya – tañcassa atthaṃ anubhoti."
    ],
    "innerText": "102. ‘‘Santi , bhikkhave, jātarūpassa oḷārikā upakkilesā paṃsuvālukā [paṃsuvālikā (sī. syā. kaṃ. pī.)] sakkharakaṭhalā. Tamenaṃ paṃsudhovako vā paṃsudhovakantevāsī vā doṇiyaṃ ākiritvā dhovati sandhovati niddhovati. Tasmiṃ pahīne tasmiṃ byantīkate santi jātarūpassa majjhimasahagatā upakkilesā sukhumasakkharā thūlavālukā [thūlavālikā (sī. pī.), thullavālikā (syā. kaṃ.)]. Tamenaṃ paṃsudhovako vā paṃsudhovakantevāsī vā dhovati sandhovati niddhovati. Tasmiṃ pahīne tasmiṃ byantīkate santi jātarūpassa sukhumasahagatā upakkilesā sukhumavālukā kāḷajallikā. Tamenaṃ paṃsudhovako vā paṃsudhovakantevāsī vā dhovati sandhovati niddhovati. Tasmiṃ pahīne tasmiṃ byantīkate athāparaṃ suvaṇṇasikatāvasissanti [suvaṇṇajātarūpakāvasissanti (ka.)]. Tamenaṃ suvaṇṇakāro vā suvaṇṇakārantevāsī vā jātarūpaṃ mūsāyaṃ pakkhipitvā dhamati sandhamati niddhamati . Taṃ hoti jātarūpaṃ dhantaṃ sandhantaṃ [adhantaṃ asandhantaṃ (syā. kaṃ.)] niddhantaṃ aniddhantakasāvaṃ [aniddhantaṃ anihitaṃ aninnītakasāvaṃ (sī. syā. kaṃ. pī.)], na ceva mudu hoti na ca kammaniyaṃ, na ca pabhassaraṃ pabhaṅgu ca, na ca sammā upeti kammāya. Hoti so, bhikkhave, samayo yaṃ suvaṇṇakāro vā suvaṇṇakārantevāsī vā taṃ jātarūpaṃ dhamati sandhamati niddhamati. Taṃ hoti jātarūpaṃ dhantaṃ sandhantaṃ niddhantaṃ niddhantakasāvaṃ [nihitaṃ ninnītakasāvaṃ (sī. syā. kaṃ. pī.)], mudu ca hoti kammaniyañca pabhassarañca, na ca pabhaṅgu, sammā upeti kammāya. Yassā yassā ca pilandhanavikatiyā ākaṅkhati – yadi paṭṭikāya [muddikāya (a. ni. 5.23], yadi kuṇḍalāya, yadi gīveyyake [gīveyyakena (ka.), gīveyyakāya (?)], yadi suvaṇṇamālāya – tañcassa atthaṃ anubhoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evamevaṃ kho, bhikkhave, santi adhicittamanuyuttassa bhikkhuno oḷārikā upakkilesā kāyaduccaritaṃ vacīduccaritaṃ manoduccaritaṃ, tamenaṃ sacetaso bhikkhu dabbajātiko pajahati vinodeti ",
      " byantīkaroti anabhāvaṃ gameti. Tasmiṃ pahīne tasmiṃ byantīkate santi adhicittamanuyuttassa bhikkhuno majjhimasahagatā upakkilesā kāmavitakko byāpādavitakko vihiṃsāvitakko, tamenaṃ sacetaso bhikkhu dabbajātiko pajahati vinodeti byantīkaroti anabhāvaṃ gameti. Tasmiṃ ",
      " pahīne tasmiṃ byantīkate santi adhicittamanuyuttassa bhikkhuno sukhumasahagatā upakkilesā ñātivitakko janapadavitakko anavaññattipaṭisaṃyutto vitakko, tamenaṃ sacetaso bhikkhu dabbajātiko pajahati vinodeti byantīkaroti anabhāvaṃ gameti. Tasmiṃ pahīne tasmiṃ byantīkate athāparaṃ dhammavitakkāvasissati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[dhammavitakkovasissati (ka.)]"
      },
      ". So hoti samādhi na ceva santo na ca paṇīto nappaṭippassaddhaladdho na ekodibhāvādhigato sasaṅkhāraniggayhavāritagato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sasaṅkhāraniggayhavāritavato (sī. syā. kaṃ. pī.), sasaṅkhāraniggayhavārivāvato (ka.), sasaṅkhāraniggayhavāriyādhigato (?) a. ni. 9.37; dī. ni. 3.355]"
      },
      " hoti. So, bhikkhave, samayo yaṃ taṃ cittaṃ ajjhattaṃyeva santiṭṭhati sannisīdati ekodi hoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ekodibhāvaṃ gacchati (sī.), ekodibhāvo hoti (syā. kaṃ. ka.), ekodihoti (pī.)]"
      },
      " samādhiyati. So hoti samādhi santo paṇīto paṭippassaddhiladdho ekodibhāvādhigato na sasaṅkhāraniggayhavāritagato. Yassa yassa ca abhiññā sacchikaraṇīyassa dhammassa cittaṃ abhininnāmeti ",
      " abhiññā sacchikiriyāya tatra tatreva sakkhibhabbataṃ pāpuṇāti sati satiāyatane."
    ],
    "innerText": "‘‘Evamevaṃ kho, bhikkhave, santi adhicittamanuyuttassa bhikkhuno oḷārikā upakkilesā kāyaduccaritaṃ vacīduccaritaṃ manoduccaritaṃ, tamenaṃ sacetaso bhikkhu dabbajātiko pajahati vinodeti byantīkaroti anabhāvaṃ gameti. Tasmiṃ pahīne tasmiṃ byantīkate santi adhicittamanuyuttassa bhikkhuno majjhimasahagatā upakkilesā kāmavitakko byāpādavitakko vihiṃsāvitakko, tamenaṃ sacetaso bhikkhu dabbajātiko pajahati vinodeti byantīkaroti anabhāvaṃ gameti. Tasmiṃ pahīne tasmiṃ byantīkate santi adhicittamanuyuttassa bhikkhuno sukhumasahagatā upakkilesā ñātivitakko janapadavitakko anavaññattipaṭisaṃyutto vitakko, tamenaṃ sacetaso bhikkhu dabbajātiko pajahati vinodeti byantīkaroti anabhāvaṃ gameti. Tasmiṃ pahīne tasmiṃ byantīkate athāparaṃ dhammavitakkāvasissati [dhammavitakkovasissati (ka.)]. So hoti samādhi na ceva santo na ca paṇīto nappaṭippassaddhaladdho na ekodibhāvādhigato sasaṅkhāraniggayhavāritagato [sasaṅkhāraniggayhavāritavato (sī. syā. kaṃ. pī.), sasaṅkhāraniggayhavārivāvato (ka.), sasaṅkhāraniggayhavāriyādhigato (?) a. ni. 9.37; dī. ni. 3.355] hoti. So, bhikkhave, samayo yaṃ taṃ cittaṃ ajjhattaṃyeva santiṭṭhati sannisīdati ekodi hoti [ekodibhāvaṃ gacchati (sī.), ekodibhāvo hoti (syā. kaṃ. ka.), ekodihoti (pī.)] samādhiyati. So hoti samādhi santo paṇīto paṭippassaddhiladdho ekodibhāvādhigato na sasaṅkhāraniggayhavāritagato. Yassa yassa ca abhiññā sacchikaraṇīyassa dhammassa cittaṃ abhininnāmeti abhiññā sacchikiriyāya tatra tatreva sakkhibhabbataṃ pāpuṇāti sati satiāyatane."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘So sace ākaṅkhati – ‘anekavihitaṃ iddhividhaṃ paccanubhaveyyaṃ – ekopi hutvā bahudhā assaṃ, bahudhāpi hutvā eko assaṃ; āvibhāvaṃ, tirobhāvaṃ; tirokuṭṭaṃ tiropākāraṃ tiropabbataṃ asajjamāno gaccheyyaṃ, seyyathāpi ākāse; pathaviyāpi ummujjanimujjaṃ kareyyaṃ, seyyathāpi udake; udakepi abhijjamāne ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[abhijjamāno (sī. pī. ka.)]"
      },
      " gaccheyyaṃ, seyyathāpi pathaviyaṃ; ākāsepi pallaṅkena kameyyaṃ ",
      ", seyyathāpi pakkhī sakuṇo; imepi candimasūriye evaṃmahiddhike evaṃmahānubhāve pāṇinā parimaseyyaṃ parimajjeyyaṃ; yāva brahmalokāpi kāyena vasaṃ vatteyya’nti, tatra tatreva sakkhibhabbataṃ pāpuṇāti sati satiāyatane."
    ],
    "innerText": "‘‘So sace ākaṅkhati – ‘anekavihitaṃ iddhividhaṃ paccanubhaveyyaṃ – ekopi hutvā bahudhā assaṃ, bahudhāpi hutvā eko assaṃ; āvibhāvaṃ, tirobhāvaṃ; tirokuṭṭaṃ tiropākāraṃ tiropabbataṃ asajjamāno gaccheyyaṃ, seyyathāpi ākāse; pathaviyāpi ummujjanimujjaṃ kareyyaṃ, seyyathāpi udake; udakepi abhijjamāne [abhijjamāno (sī. pī. ka.)] gaccheyyaṃ, seyyathāpi pathaviyaṃ; ākāsepi pallaṅkena kameyyaṃ , seyyathāpi pakkhī sakuṇo; imepi candimasūriye evaṃmahiddhike evaṃmahānubhāve pāṇinā parimaseyyaṃ parimajjeyyaṃ; yāva brahmalokāpi kāyena vasaṃ vatteyya’nti, tatra tatreva sakkhibhabbataṃ pāpuṇāti sati satiāyatane."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘So sace ākaṅkhati – ‘dibbāya sotadhātuyā visuddhāya atikkantamānusikāya ubho sadde ",
      " suṇeyyaṃ dibbe ca mānuse ca ye dūre santike cā’ti, tatra tatreva sakkhibhabbataṃ pāpuṇāti sati satiāyatane."
    ],
    "innerText": "‘‘So sace ākaṅkhati – ‘dibbāya sotadhātuyā visuddhāya atikkantamānusikāya ubho sadde suṇeyyaṃ dibbe ca mānuse ca ye dūre santike cā’ti, tatra tatreva sakkhibhabbataṃ pāpuṇāti sati satiāyatane."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘So ",
      " sace ākaṅkhati – ‘parasattānaṃ parapuggalānaṃ cetasā ceto paricca pajāneyyaṃ – sarāgaṃ vā cittaṃ sarāgaṃ cittanti pajāneyyaṃ, vītarāgaṃ vā cittaṃ vītarāgaṃ cittanti pajāneyyaṃ; sadosaṃ vā cittaṃ sadosaṃ cittanti pajāneyyaṃ, vītadosaṃ vā cittaṃ vītadosaṃ cittanti pajāneyyaṃ; samohaṃ vā cittaṃ samohaṃ cittanti pajāneyyaṃ, vītamohaṃ vā cittaṃ vītamohaṃ cittanti pajāneyyaṃ; saṃkhittaṃ vā cittaṃ saṃkhittaṃ cittanti pajāneyyaṃ, vikkhittaṃ vā cittaṃ vikkhittaṃ cittanti pajāneyyaṃ; mahaggataṃ vā cittaṃ mahaggataṃ cittanti pajāneyyaṃ, amahaggataṃ vā cittaṃ amahaggataṃ cittanti pajāneyyaṃ; sauttaraṃ vā cittaṃ sauttaraṃ cittanti pajāneyyaṃ, anuttaraṃ vā cittaṃ anuttaraṃ cittanti pajāneyyaṃ; samāhitaṃ vā cittaṃ samāhitaṃ cittanti pajāneyyaṃ, asamāhitaṃ vā cittaṃ asamāhitaṃ cittanti pajāneyyaṃ; vimuttaṃ vā cittaṃ vimuttaṃ cittanti pajāneyyaṃ, avimuttaṃ vā cittaṃ avimuttaṃ cittanti pajāneyya’nti, tatra tatreva sakkhibhabbataṃ pāpuṇāti sati satiāyatane."
    ],
    "innerText": "‘‘So sace ākaṅkhati – ‘parasattānaṃ parapuggalānaṃ cetasā ceto paricca pajāneyyaṃ – sarāgaṃ vā cittaṃ sarāgaṃ cittanti pajāneyyaṃ, vītarāgaṃ vā cittaṃ vītarāgaṃ cittanti pajāneyyaṃ; sadosaṃ vā cittaṃ sadosaṃ cittanti pajāneyyaṃ, vītadosaṃ vā cittaṃ vītadosaṃ cittanti pajāneyyaṃ; samohaṃ vā cittaṃ samohaṃ cittanti pajāneyyaṃ, vītamohaṃ vā cittaṃ vītamohaṃ cittanti pajāneyyaṃ; saṃkhittaṃ vā cittaṃ saṃkhittaṃ cittanti pajāneyyaṃ, vikkhittaṃ vā cittaṃ vikkhittaṃ cittanti pajāneyyaṃ; mahaggataṃ vā cittaṃ mahaggataṃ cittanti pajāneyyaṃ, amahaggataṃ vā cittaṃ amahaggataṃ cittanti pajāneyyaṃ; sauttaraṃ vā cittaṃ sauttaraṃ cittanti pajāneyyaṃ, anuttaraṃ vā cittaṃ anuttaraṃ cittanti pajāneyyaṃ; samāhitaṃ vā cittaṃ samāhitaṃ cittanti pajāneyyaṃ, asamāhitaṃ vā cittaṃ asamāhitaṃ cittanti pajāneyyaṃ; vimuttaṃ vā cittaṃ vimuttaṃ cittanti pajāneyyaṃ, avimuttaṃ vā cittaṃ avimuttaṃ cittanti pajāneyya’nti, tatra tatreva sakkhibhabbataṃ pāpuṇāti sati satiāyatane."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘So sace ākaṅkhati ",
      " – ‘anekavihitaṃ pubbenivāsaṃ anussareyyaṃ, seyyathidaṃ – ekampi jātiṃ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṃsampi jātiyo cattālīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi anekepi saṃvaṭṭakappe anekepi vivaṭṭakappe anekepi saṃvaṭṭavivaṭṭakappe – amutrāsiṃ evaṃnāmo ",
      " evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapannoti, iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussareyya’nti, tatra tatreva sakkhibhabbataṃ pāpuṇāti sati satiāyatane."
    ],
    "innerText": "‘‘So sace ākaṅkhati – ‘anekavihitaṃ pubbenivāsaṃ anussareyyaṃ, seyyathidaṃ – ekampi jātiṃ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṃsampi jātiyo cattālīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi anekepi saṃvaṭṭakappe anekepi vivaṭṭakappe anekepi saṃvaṭṭavivaṭṭakappe – amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapannoti, iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussareyya’nti, tatra tatreva sakkhibhabbataṃ pāpuṇāti sati satiāyatane."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘So sace ākaṅkhati – ‘dibbena cakkhunā visuddhena atikkantamānusakena satte passeyyaṃ cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajāneyyaṃ – ime vata bhonto sattā kāyaduccaritena samannāgatā vacīduccaritena samannāgatā ",
      " manoduccaritena samannāgatā ariyānaṃ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā ",
      ", te kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannā; ime vā pana bhonto sattā kāyasucaritena samannāgatā vacīsucaritena samannāgatā manosucaritena samannāgatā ariyānaṃ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā, te kāyassa bhedā ",
      " paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapannāti, iti dibbena cakkhunā visuddhena atikkantamānusakena satte passeyyaṃ cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajāneyya’nti, tatra tatreva sakkhibhabbataṃ pāpuṇāti sati satiāyatane."
    ],
    "innerText": "‘‘So sace ākaṅkhati – ‘dibbena cakkhunā visuddhena atikkantamānusakena satte passeyyaṃ cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajāneyyaṃ – ime vata bhonto sattā kāyaduccaritena samannāgatā vacīduccaritena samannāgatā manoduccaritena samannāgatā ariyānaṃ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā , te kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannā; ime vā pana bhonto sattā kāyasucaritena samannāgatā vacīsucaritena samannāgatā manosucaritena samannāgatā ariyānaṃ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā, te kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapannāti, iti dibbena cakkhunā visuddhena atikkantamānusakena satte passeyyaṃ cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajāneyya’nti, tatra tatreva sakkhibhabbataṃ pāpuṇāti sati satiāyatane."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘So sace ākaṅkhati – ‘āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihareyya’nti, tatra tatreva sakkhibhabbataṃ pāpuṇāti sati satiāyatane’’ti. Dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "11. Nimittasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "103"
      },
      ". ‘‘Adhicittamanuyuttena, bhikkhave, bhikkhunā tīṇi nimittāni kālena kālaṃ manasi kātabbāni – kālena kālaṃ samādhinimittaṃ manasi kātabbaṃ, kālena kālaṃ paggahanimittaṃ manasi kātabbaṃ, kālena kālaṃ upekkhānimittaṃ manasi kātabbaṃ. Sace, bhikkhave, adhicittamanuyutto bhikkhu ekantaṃ samādhinimittaṃyeva manasi kareyya, ṭhānaṃ taṃ cittaṃ kosajjāya saṃvatteyya. Sace, bhikkhave, adhicittamanuyutto bhikkhu ekantaṃ paggahanimittaṃyeva manasi kareyya, ṭhānaṃ taṃ cittaṃ uddhaccāya saṃvatteyya. Sace, bhikkhave ",
      ", adhicittamanuyutto bhikkhu ekantaṃ upekkhānimittaṃyeva manasi kareyya, ṭhānaṃ taṃ cittaṃ na sammā samādhiyeyya āsavānaṃ khayāya. Yato ca kho, bhikkhave, adhicittamanuyutto bhikkhu kālena kālaṃ samādhinimittaṃ manasi karoti, kālena kālaṃ paggahanimittaṃ manasi karoti, kālena kālaṃ upekkhānimittaṃ manasi karoti, taṃ hoti cittaṃ muduñca kammaniyañca pabhassarañca, na ca ",
      " pabhaṅgu, sammā samādhiyati āsavānaṃ khayāya."
    ],
    "innerText": "103. ‘‘Adhicittamanuyuttena, bhikkhave, bhikkhunā tīṇi nimittāni kālena kālaṃ manasi kātabbāni – kālena kālaṃ samādhinimittaṃ manasi kātabbaṃ, kālena kālaṃ paggahanimittaṃ manasi kātabbaṃ, kālena kālaṃ upekkhānimittaṃ manasi kātabbaṃ. Sace, bhikkhave, adhicittamanuyutto bhikkhu ekantaṃ samādhinimittaṃyeva manasi kareyya, ṭhānaṃ taṃ cittaṃ kosajjāya saṃvatteyya. Sace, bhikkhave, adhicittamanuyutto bhikkhu ekantaṃ paggahanimittaṃyeva manasi kareyya, ṭhānaṃ taṃ cittaṃ uddhaccāya saṃvatteyya. Sace, bhikkhave , adhicittamanuyutto bhikkhu ekantaṃ upekkhānimittaṃyeva manasi kareyya, ṭhānaṃ taṃ cittaṃ na sammā samādhiyeyya āsavānaṃ khayāya. Yato ca kho, bhikkhave, adhicittamanuyutto bhikkhu kālena kālaṃ samādhinimittaṃ manasi karoti, kālena kālaṃ paggahanimittaṃ manasi karoti, kālena kālaṃ upekkhānimittaṃ manasi karoti, taṃ hoti cittaṃ muduñca kammaniyañca pabhassarañca, na ca pabhaṅgu, sammā samādhiyati āsavānaṃ khayāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, bhikkhave, suvaṇṇakāro vā suvaṇṇakārantevāsī vā ukkaṃ bandheyya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[bandhati… ālimpati (visuddhi. 1.181 taṃṭīkāyaṃ ca) ma. ni. aṭṭha. 1.76; ma. ni. 3.360 taṃaṭṭhakathāṭīkāsu ca passitabbaṃ]"
      },
      ", ukkaṃ ",
      " bandhitvā ukkāmukhaṃ ālimpeyya, ukkāmukhaṃ ālimpetvā saṇḍāsena ",
      " jātarūpaṃ gahetvā ukkāmukhe pakkhipeyya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pakkhipati (visuddhi. 1.181)]"
      },
      ", ukkāmukhe pakkhipitvā kālena kālaṃ abhidhamati, kālena kālaṃ udakena paripphoseti, kālena kālaṃ ajjhupekkhati. Sace, bhikkhave, suvaṇṇakāro vā suvaṇṇakārantevāsī vā taṃ jātarūpaṃ ekantaṃ abhidhameyya, ṭhānaṃ taṃ jātarūpaṃ ḍaheyya. Sace, bhikkhave, suvaṇṇakāro vā suvaṇṇakārantevāsī vā taṃ jātarūpaṃ ekantaṃ udakena paripphoseyya, ṭhānaṃ taṃ jātarūpaṃ nibbāpeyya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[nibbāyeyya (sī.)]"
      },
      ". Sace, bhikkhave, suvaṇṇakāro vā suvaṇṇakārantevāsī vā taṃ jātarūpaṃ ekantaṃ ajjhupekkheyya, ṭhānaṃ taṃ jātarūpaṃ na sammā paripākaṃ gaccheyya. Yato ca kho, bhikkhave, suvaṇṇakāro vā suvaṇṇakārantevāsī vā taṃ jātarūpaṃ kālena kālaṃ abhidhamati, kālena kālaṃ udakena paripphoseti, kālena kālaṃ ajjhupekkhati, taṃ hoti jātarūpaṃ muduñca kammaniyañca pabhassarañca, na ca pabhaṅgu, sammā upeti kammāya. Yassā yassā ca pilandhanavikatiyā ākaṅkhati – yadi paṭṭikāya, yadi kuṇḍalāya, yadi gīveyyake, yadi suvaṇṇamālāya – tañcassa atthaṃ anubhoti."
    ],
    "innerText": "‘‘Seyyathāpi, bhikkhave, suvaṇṇakāro vā suvaṇṇakārantevāsī vā ukkaṃ bandheyya [bandhati… ālimpati (visuddhi. 1.181 taṃṭīkāyaṃ ca) ma. ni. aṭṭha. 1.76; ma. ni. 3.360 taṃaṭṭhakathāṭīkāsu ca passitabbaṃ], ukkaṃ bandhitvā ukkāmukhaṃ ālimpeyya, ukkāmukhaṃ ālimpetvā saṇḍāsena jātarūpaṃ gahetvā ukkāmukhe pakkhipeyya [pakkhipati (visuddhi. 1.181)], ukkāmukhe pakkhipitvā kālena kālaṃ abhidhamati, kālena kālaṃ udakena paripphoseti, kālena kālaṃ ajjhupekkhati. Sace, bhikkhave, suvaṇṇakāro vā suvaṇṇakārantevāsī vā taṃ jātarūpaṃ ekantaṃ abhidhameyya, ṭhānaṃ taṃ jātarūpaṃ ḍaheyya. Sace, bhikkhave, suvaṇṇakāro vā suvaṇṇakārantevāsī vā taṃ jātarūpaṃ ekantaṃ udakena paripphoseyya, ṭhānaṃ taṃ jātarūpaṃ nibbāpeyya [nibbāyeyya (sī.)]. Sace, bhikkhave, suvaṇṇakāro vā suvaṇṇakārantevāsī vā taṃ jātarūpaṃ ekantaṃ ajjhupekkheyya, ṭhānaṃ taṃ jātarūpaṃ na sammā paripākaṃ gaccheyya. Yato ca kho, bhikkhave, suvaṇṇakāro vā suvaṇṇakārantevāsī vā taṃ jātarūpaṃ kālena kālaṃ abhidhamati, kālena kālaṃ udakena paripphoseti, kālena kālaṃ ajjhupekkhati, taṃ hoti jātarūpaṃ muduñca kammaniyañca pabhassarañca, na ca pabhaṅgu, sammā upeti kammāya. Yassā yassā ca pilandhanavikatiyā ākaṅkhati – yadi paṭṭikāya, yadi kuṇḍalāya, yadi gīveyyake, yadi suvaṇṇamālāya – tañcassa atthaṃ anubhoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evamevaṃ kho, bhikkhave, adhicittamanuyuttena bhikkhunā tīṇi nimittāni kālena kālaṃ manasi kātabbāni – kālena kālaṃ samādhinimittaṃ manasi kātabbaṃ, kālena kālaṃ paggahanimittaṃ manasi kātabbaṃ, kālena kālaṃ upekkhānimittaṃ manasi kātabbaṃ. Sace, bhikkhave, adhicittamanuyutto ",
      " bhikkhu ekantaṃ samādhinimittaṃyeva manasi kareyya ",
      ", ṭhānaṃ taṃ cittaṃ kosajjāya saṃvatteyya. Sace, bhikkhave, adhicittamanuyutto bhikkhu ekantaṃ paggahanimittaṃyeva manasi kareyya, ṭhānaṃ taṃ cittaṃ uddhaccāya saṃvatteyya. Sace, bhikkhave, adhicittamanuyutto bhikkhu ekantaṃ upekkhānimittaṃyeva manasi kareyya, ṭhānaṃ taṃ cittaṃ na sammā samādhiyeyya āsavānaṃ khayāya. Yato ca kho, bhikkhave, adhicittamanuyutto bhikkhu kālena kālaṃ samādhinimittaṃ manasi karoti, kālena kālaṃ paggahanimittaṃ manasi karoti, kālena kālaṃ upekkhānimittaṃ manasi karoti, taṃ hoti cittaṃ muduñca kammaniyañca pabhassarañca, na ca pabhaṅgu, sammā samādhiyati āsavānaṃ khayāya. Yassa yassa ca abhiññāsacchikaraṇīyassa dhammassa cittaṃ abhininnāmeti abhiññāsacchikiriyāya, tatra tatreva sakkhibhabbataṃ pāpuṇāti sati satiāyatane."
    ],
    "innerText": "‘‘Evamevaṃ kho, bhikkhave, adhicittamanuyuttena bhikkhunā tīṇi nimittāni kālena kālaṃ manasi kātabbāni – kālena kālaṃ samādhinimittaṃ manasi kātabbaṃ, kālena kālaṃ paggahanimittaṃ manasi kātabbaṃ, kālena kālaṃ upekkhānimittaṃ manasi kātabbaṃ. Sace, bhikkhave, adhicittamanuyutto bhikkhu ekantaṃ samādhinimittaṃyeva manasi kareyya , ṭhānaṃ taṃ cittaṃ kosajjāya saṃvatteyya. Sace, bhikkhave, adhicittamanuyutto bhikkhu ekantaṃ paggahanimittaṃyeva manasi kareyya, ṭhānaṃ taṃ cittaṃ uddhaccāya saṃvatteyya. Sace, bhikkhave, adhicittamanuyutto bhikkhu ekantaṃ upekkhānimittaṃyeva manasi kareyya, ṭhānaṃ taṃ cittaṃ na sammā samādhiyeyya āsavānaṃ khayāya. Yato ca kho, bhikkhave, adhicittamanuyutto bhikkhu kālena kālaṃ samādhinimittaṃ manasi karoti, kālena kālaṃ paggahanimittaṃ manasi karoti, kālena kālaṃ upekkhānimittaṃ manasi karoti, taṃ hoti cittaṃ muduñca kammaniyañca pabhassarañca, na ca pabhaṅgu, sammā samādhiyati āsavānaṃ khayāya. Yassa yassa ca abhiññāsacchikaraṇīyassa dhammassa cittaṃ abhininnāmeti abhiññāsacchikiriyāya, tatra tatreva sakkhibhabbataṃ pāpuṇāti sati satiāyatane."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘So ",
      " sace ākaṅkhati – ‘anekavihitaṃ iddhividhaṃ paccanubhaveyyaṃ…pe… (cha abhiññā vitthāretabbā) ",
      " āsavānaṃ khayā…pe… sacchikatvā upasampajja vihareyya’nti, tatra tatreva sakkhibhabbataṃ pāpuṇāti sati satiāyatane’’ti. Ekādasamaṃ."
    ],
    "innerText": "‘‘So sace ākaṅkhati – ‘anekavihitaṃ iddhividhaṃ paccanubhaveyyaṃ…pe… (cha abhiññā vitthāretabbā) āsavānaṃ khayā…pe… sacchikatvā upasampajja vihareyya’nti, tatra tatreva sakkhibhabbataṃ pāpuṇāti sati satiāyatane’’ti. Ekādasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "children": [
      "Loṇakapallavaggo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[loṇaphalavaggo (sī. syā. kaṃ. pī.)]"
      },
      " pañcamo."
    ],
    "innerText": "Loṇakapallavaggo [loṇaphalavaggo (sī. syā. kaṃ. pī.)] pañcamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Accāyikaṃ pavivekaṃ, sarado parisā tayo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ājānīyā potthako ca, loṇaṃ dhovati nimittānīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dutiyo paṇṇāsako samatto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "3. Tatiyapaṇṇāsakaṃ"
  }
]