[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "(8) 3. Ānandavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Channasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "72"
      },
      ". Ekaṃ ",
      " samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho channo paribbājako yenāyasmā ānando tenupasaṅkami; upasaṅkamitvā āyasmatā ānandena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho channo paribbājako āyasmantaṃ ānandaṃ etadavoca – ‘‘tumhepi, āvuso ānanda, rāgassa pahānaṃ paññāpetha, dosassa pahānaṃ paññāpetha, mohassa pahānaṃ paññāpethāti. Mayaṃ kho, āvuso, rāgassa pahānaṃ paññāpema, dosassa pahānaṃ ",
      " paññāpema, mohassa pahānaṃ paññapemā’’ti."
    ],
    "innerText": "72. Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho channo paribbājako yenāyasmā ānando tenupasaṅkami; upasaṅkamitvā āyasmatā ānandena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho channo paribbājako āyasmantaṃ ānandaṃ etadavoca – ‘‘tumhepi, āvuso ānanda, rāgassa pahānaṃ paññāpetha, dosassa pahānaṃ paññāpetha, mohassa pahānaṃ paññāpethāti. Mayaṃ kho, āvuso, rāgassa pahānaṃ paññāpema, dosassa pahānaṃ paññāpema, mohassa pahānaṃ paññapemā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kiṃ pana tumhe, āvuso, rāge ādīnavaṃ disvā rāgassa pahānaṃ paññāpetha, kiṃ dose ādīnavaṃ disvā dosassa pahānaṃ paññāpetha, kiṃ mohe ādīnavaṃ disvā mohassa pahānaṃ ",
      " paññāpethā’’ti?"
    ],
    "innerText": "‘‘Kiṃ pana tumhe, āvuso, rāge ādīnavaṃ disvā rāgassa pahānaṃ paññāpetha, kiṃ dose ādīnavaṃ disvā dosassa pahānaṃ paññāpetha, kiṃ mohe ādīnavaṃ disvā mohassa pahānaṃ paññāpethā’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ratto ",
      " kho, āvuso, rāgena abhibhūto pariyādinnacitto attabyābādhāyapi ceteti, parabyābādhāyapi ceteti, ubhayabyābādhāyapi ceteti, cetasikampi dukkhaṃ domanassaṃ paṭisaṃvedeti; rāge pahīne nevattabyābādhāyapi ceteti, na parabyābādhāyapi ceteti, na ubhayabyābādhāyapi ceteti, na cetasikaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. Ratto kho, āvuso, rāgena abhibhūto pariyādinnacitto kāyena duccaritaṃ carati, vācāya duccaritaṃ carati, manasā duccaritaṃ carati; rāge pahīne neva kāyena duccaritaṃ carati, na vācāya duccaritaṃ carati, na manasā duccaritaṃ carati. Ratto kho, āvuso, rāgena abhibhūto pariyādinnacitto attatthampi yathābhūtaṃ nappajānāti, paratthampi yathābhūtaṃ nappajānāti, ubhayatthampi yathābhūtaṃ nappajānāti; rāge pahīne attatthampi yathābhūtaṃ pajānāti, paratthampi yathābhūtaṃ pajānāti, ubhayatthampi ",
      " yathābhūtaṃ pajānāti. Rāgo kho, āvuso, andhakaraṇo acakkhukaraṇo aññāṇakaraṇo paññānirodhiko vighātapakkhiko anibbānasaṃvattaniko."
    ],
    "innerText": "‘‘Ratto kho, āvuso, rāgena abhibhūto pariyādinnacitto attabyābādhāyapi ceteti, parabyābādhāyapi ceteti, ubhayabyābādhāyapi ceteti, cetasikampi dukkhaṃ domanassaṃ paṭisaṃvedeti; rāge pahīne nevattabyābādhāyapi ceteti, na parabyābādhāyapi ceteti, na ubhayabyābādhāyapi ceteti, na cetasikaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. Ratto kho, āvuso, rāgena abhibhūto pariyādinnacitto kāyena duccaritaṃ carati, vācāya duccaritaṃ carati, manasā duccaritaṃ carati; rāge pahīne neva kāyena duccaritaṃ carati, na vācāya duccaritaṃ carati, na manasā duccaritaṃ carati. Ratto kho, āvuso, rāgena abhibhūto pariyādinnacitto attatthampi yathābhūtaṃ nappajānāti, paratthampi yathābhūtaṃ nappajānāti, ubhayatthampi yathābhūtaṃ nappajānāti; rāge pahīne attatthampi yathābhūtaṃ pajānāti, paratthampi yathābhūtaṃ pajānāti, ubhayatthampi yathābhūtaṃ pajānāti. Rāgo kho, āvuso, andhakaraṇo acakkhukaraṇo aññāṇakaraṇo paññānirodhiko vighātapakkhiko anibbānasaṃvattaniko."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Duṭṭho kho, āvuso, dosena…pe… mūḷho kho, āvuso, mohena abhibhūto pariyādinnacitto attabyābādhāyapi ceteti, parabyābādhāyapi ceteti, ubhayabyābādhāyapi ceteti, cetasikampi dukkhaṃ domanassaṃ paṭisaṃvedeti; mohe pahīne nevattabyābādhāyapi ceteti, na parabyābādhāyapi ceteti, na ubhayabyābādhāyapi ceteti, na cetasikaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. Mūḷho kho, āvuso, mohena abhibhūto pariyādinnacitto kāyena duccaritaṃ carati, vācāya duccaritaṃ ",
      " carati, manasā duccaritaṃ carati; mohe pahīne neva kāyena duccaritaṃ carati, na vācāya duccaritaṃ carati, na manasā duccaritaṃ carati. Mūḷho kho, āvuso, mohena abhibhūto pariyādinnacitto attatthampi yathābhūtaṃ nappajānāti, paratthampi yathābhūtaṃ nappajānāti, ubhayatthampi yathābhūtaṃ nappajānāti; mohe pahīne ",
      " attatthampi yathābhūtaṃ pajānāti, paratthampi yathābhūtaṃ pajānāti, ubhayatthampi yathābhūtaṃ pajānāti. Moho kho, āvuso, andhakaraṇo acakkhukaraṇo aññāṇakaraṇo paññānirodhiko vighātapakkhiko anibbānasaṃvattaniko. Idaṃ kho mayaṃ, āvuso, rāge ādīnavaṃ disvā rāgassa pahānaṃ ",
      " paññāpema. Idaṃ dose ādīnavaṃ disvā dosassa pahānaṃ paññāpema. Idaṃ mohe ādīnavaṃ disvā mohassa pahānaṃ paññāpemā’’ti."
    ],
    "innerText": "‘‘Duṭṭho kho, āvuso, dosena…pe… mūḷho kho, āvuso, mohena abhibhūto pariyādinnacitto attabyābādhāyapi ceteti, parabyābādhāyapi ceteti, ubhayabyābādhāyapi ceteti, cetasikampi dukkhaṃ domanassaṃ paṭisaṃvedeti; mohe pahīne nevattabyābādhāyapi ceteti, na parabyābādhāyapi ceteti, na ubhayabyābādhāyapi ceteti, na cetasikaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. Mūḷho kho, āvuso, mohena abhibhūto pariyādinnacitto kāyena duccaritaṃ carati, vācāya duccaritaṃ carati, manasā duccaritaṃ carati; mohe pahīne neva kāyena duccaritaṃ carati, na vācāya duccaritaṃ carati, na manasā duccaritaṃ carati. Mūḷho kho, āvuso, mohena abhibhūto pariyādinnacitto attatthampi yathābhūtaṃ nappajānāti, paratthampi yathābhūtaṃ nappajānāti, ubhayatthampi yathābhūtaṃ nappajānāti; mohe pahīne attatthampi yathābhūtaṃ pajānāti, paratthampi yathābhūtaṃ pajānāti, ubhayatthampi yathābhūtaṃ pajānāti. Moho kho, āvuso, andhakaraṇo acakkhukaraṇo aññāṇakaraṇo paññānirodhiko vighātapakkhiko anibbānasaṃvattaniko. Idaṃ kho mayaṃ, āvuso, rāge ādīnavaṃ disvā rāgassa pahānaṃ paññāpema. Idaṃ dose ādīnavaṃ disvā dosassa pahānaṃ paññāpema. Idaṃ mohe ādīnavaṃ disvā mohassa pahānaṃ paññāpemā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Atthi panāvuso, maggo atthi paṭipadā etassa rāgassa dosassa mohassa pahānāyā’’ti? ‘‘Atthāvuso, maggo atthi paṭipadā etassa rāgassa dosassa mohassa pahānāyā’’ti. ‘‘Katamo panāvuso, maggo katamā paṭipadā etassa rāgassa dosassa mohassa pahānāyā’’ti? ‘‘Ayameva ariyo aṭṭhaṅgiko maggo, seyyathidaṃ – sammādiṭṭhi…pe… sammāsamādhi. Ayaṃ kho, āvuso, maggo ayaṃ paṭipadā etassa rāgassa dosassa mohassa pahānāyā’’ti. ‘‘Bhaddako kho, āvuso, maggo bhaddikā paṭipadā etassa rāgassa dosassa mohassa pahānāya. Alañca panāvuso ānanda, appamādāyā’’ti. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Ājīvakasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "73"
      },
      ". Ekaṃ ",
      " samayaṃ āyasmā ānando kosambiyaṃ viharati ghositārāme. Atha kho aññataro ājīvakasāvako gahapati yenāyasmā ānando tenupasaṅkami; upasaṅkamitvā āyasmantaṃ ānandaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so ājīvakasāvako gahapati āyasmantaṃ ānandaṃ etadavoca –"
    ],
    "innerText": "73. Ekaṃ samayaṃ āyasmā ānando kosambiyaṃ viharati ghositārāme. Atha kho aññataro ājīvakasāvako gahapati yenāyasmā ānando tenupasaṅkami; upasaṅkamitvā āyasmantaṃ ānandaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so ājīvakasāvako gahapati āyasmantaṃ ānandaṃ etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kesaṃ no, bhante ānanda, dhammo svākkhāto? Ke loke suppaṭipannā? Ke loke sukatā’’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sugatāti (sī. syā. kaṃ. pī.)]"
      },
      "? ‘‘Tena hi, gahapati, taññevettha paṭipucchissāmi, yathā te khameyya tathā naṃ byākareyyāsi. Taṃ kiṃ maññasi, gahapati, ye rāgassa pahānāya dhammaṃ desenti, dosassa pahānāya dhammaṃ desenti, mohassa pahānāya dhammaṃ desenti, tesaṃ dhammo svākkhāto no vā? Kathaṃ vā te ettha hotī’’ti? ‘‘Ye ",
      ", bhante, rāgassa pahānāya dhammaṃ desenti, dosassa pahānāya dhammaṃ desenti, mohassa pahānāya dhammaṃ desenti, tesaṃ dhammo svākkhāto. Evaṃ me ettha hotī’’ti."
    ],
    "innerText": "‘‘Kesaṃ no, bhante ānanda, dhammo svākkhāto? Ke loke suppaṭipannā? Ke loke sukatā’’ti [sugatāti (sī. syā. kaṃ. pī.)]? ‘‘Tena hi, gahapati, taññevettha paṭipucchissāmi, yathā te khameyya tathā naṃ byākareyyāsi. Taṃ kiṃ maññasi, gahapati, ye rāgassa pahānāya dhammaṃ desenti, dosassa pahānāya dhammaṃ desenti, mohassa pahānāya dhammaṃ desenti, tesaṃ dhammo svākkhāto no vā? Kathaṃ vā te ettha hotī’’ti? ‘‘Ye , bhante, rāgassa pahānāya dhammaṃ desenti, dosassa pahānāya dhammaṃ desenti, mohassa pahānāya dhammaṃ desenti, tesaṃ dhammo svākkhāto. Evaṃ me ettha hotī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Taṃ kiṃ maññasi, gahapati, ye rāgassa pahānāya paṭipannā, dosassa pahānāya paṭipannā, mohassa pahānāya paṭipannā, te loke suppaṭipannā ",
      " no vā? Kathaṃ vā te ettha hotī’’ti? ‘‘Ye, bhante, rāgassa pahānāya paṭipannā, dosassa pahānāya paṭipannā, mohassa pahānāya paṭipannā, te loke suppaṭipannā. Evaṃ me ettha hotī’’ti."
    ],
    "innerText": "‘‘Taṃ kiṃ maññasi, gahapati, ye rāgassa pahānāya paṭipannā, dosassa pahānāya paṭipannā, mohassa pahānāya paṭipannā, te loke suppaṭipannā no vā? Kathaṃ vā te ettha hotī’’ti? ‘‘Ye, bhante, rāgassa pahānāya paṭipannā, dosassa pahānāya paṭipannā, mohassa pahānāya paṭipannā, te loke suppaṭipannā. Evaṃ me ettha hotī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Taṃ kiṃ maññasi, gahapati, yesaṃ rāgo pahīno ucchinnamūlo tālāvatthukato anabhāvaṃkato āyatiṃ anuppādadhammo, yesaṃ doso pahīno ucchinnamūlo tālāvatthukato anabhāvaṅkato āyatiṃ anuppādadhammo, yesaṃ moho pahīno ucchinnamūlo tālāvatthukato anabhāvaṃkato āyatiṃ anuppādadhammo, te loke sukatā no vā? Kathaṃ vā te ettha hotī’’ti? ‘‘Yesaṃ, bhante, rāgo pahīno ucchinnamūlo tālāvatthukato anabhāvaṃkato āyatiṃ anuppādadhammo, yesaṃ doso pahīno…pe… yesaṃ moho pahīno ",
      " ucchinnamūlo tālāvatthukato anabhāvaṃkato āyatiṃ anuppādadhammo, te loke sukatā. Evaṃ me ettha hotī’’ti."
    ],
    "innerText": "‘‘Taṃ kiṃ maññasi, gahapati, yesaṃ rāgo pahīno ucchinnamūlo tālāvatthukato anabhāvaṃkato āyatiṃ anuppādadhammo, yesaṃ doso pahīno ucchinnamūlo tālāvatthukato anabhāvaṅkato āyatiṃ anuppādadhammo, yesaṃ moho pahīno ucchinnamūlo tālāvatthukato anabhāvaṃkato āyatiṃ anuppādadhammo, te loke sukatā no vā? Kathaṃ vā te ettha hotī’’ti? ‘‘Yesaṃ, bhante, rāgo pahīno ucchinnamūlo tālāvatthukato anabhāvaṃkato āyatiṃ anuppādadhammo, yesaṃ doso pahīno…pe… yesaṃ moho pahīno ucchinnamūlo tālāvatthukato anabhāvaṃkato āyatiṃ anuppādadhammo, te loke sukatā. Evaṃ me ettha hotī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Iti ",
      " kho, gahapati, tayāvetaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[tayā cetaṃ (sī. pī. ka.)]"
      },
      " byākataṃ – ‘ye, bhante, rāgassa pahānāya dhammaṃ desenti, dosassa pahānāya dhammaṃ desenti, mohassa pahānāya dhammaṃ desenti, tesaṃ dhammo svākkhāto’ti. Tayāvetaṃ byākataṃ – ‘ye, bhante, rāgassa pahānāya paṭipannā, dosassa pahānāya paṭipannā, mohassa pahānāya paṭipannā, te loke suppaṭipannā’ti. Tayāvetaṃ byākataṃ – ‘yesaṃ, bhante, rāgo pahīno ucchinnamūlo tālāvatthukato anabhāvaṅkato āyatiṃ anuppādadhammo, yesaṃ doso pahīno…pe… yesaṃ moho pahīno ucchinnamūlo tālāvatthukato anabhāvaṅkato āyatiṃ anuppādadhammo, te loke sukatā’’’ti."
    ],
    "innerText": "‘‘Iti kho, gahapati, tayāvetaṃ [tayā cetaṃ (sī. pī. ka.)] byākataṃ – ‘ye, bhante, rāgassa pahānāya dhammaṃ desenti, dosassa pahānāya dhammaṃ desenti, mohassa pahānāya dhammaṃ desenti, tesaṃ dhammo svākkhāto’ti. Tayāvetaṃ byākataṃ – ‘ye, bhante, rāgassa pahānāya paṭipannā, dosassa pahānāya paṭipannā, mohassa pahānāya paṭipannā, te loke suppaṭipannā’ti. Tayāvetaṃ byākataṃ – ‘yesaṃ, bhante, rāgo pahīno ucchinnamūlo tālāvatthukato anabhāvaṅkato āyatiṃ anuppādadhammo, yesaṃ doso pahīno…pe… yesaṃ moho pahīno ucchinnamūlo tālāvatthukato anabhāvaṅkato āyatiṃ anuppādadhammo, te loke sukatā’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Acchariyaṃ, bhante, abbhutaṃ, bhante! Na ceva nāma sadhammukkaṃsanā bhavissati, na ca paradhammāpasādanā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[na paradhammāpasādanā (sī. pī.), na paradhammavambhanā (ma. ni. 2.236)]"
      },
      ". Āyataneva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[āyatane ca (ma. ni. 2.236)]"
      },
      " dhammadesanā, attho ca vutto, attā ca anupanīto. Tumhe, bhante ānanda, rāgassa pahānāya dhammaṃ desetha, dosassa…pe… mohassa pahanāya dhammaṃ ",
      " desetha. Tumhākaṃ, bhante ānanda, dhammo svākkhāto. Tumhe, bhante ānanda, rāgassa pahānāya ",
      " paṭipannā, dosassa…pe… mohassa ",
      " pahānāya paṭipannā. Tumhe, bhante, loke suppaṭipannā. Tumhākaṃ, bhante ānanda, rāgo pahīno ucchinnamūlo tālāvatthukato anabhāvaṅkato āyatiṃ anuppādadhammo, tumhākaṃ doso pahīno…pe… tumhākaṃ moho pahīno ucchinnamūlo tālāvatthukato anabhāvaṅkato āyatiṃ anuppādadhammo. Tumhe loke sukatā."
    ],
    "innerText": "‘‘Acchariyaṃ, bhante, abbhutaṃ, bhante! Na ceva nāma sadhammukkaṃsanā bhavissati, na ca paradhammāpasādanā [na paradhammāpasādanā (sī. pī.), na paradhammavambhanā (ma. ni. 2.236)]. Āyataneva [āyatane ca (ma. ni. 2.236)] dhammadesanā, attho ca vutto, attā ca anupanīto. Tumhe, bhante ānanda, rāgassa pahānāya dhammaṃ desetha, dosassa…pe… mohassa pahanāya dhammaṃ desetha. Tumhākaṃ, bhante ānanda, dhammo svākkhāto. Tumhe, bhante ānanda, rāgassa pahānāya paṭipannā, dosassa…pe… mohassa pahānāya paṭipannā. Tumhe, bhante, loke suppaṭipannā. Tumhākaṃ, bhante ānanda, rāgo pahīno ucchinnamūlo tālāvatthukato anabhāvaṅkato āyatiṃ anuppādadhammo, tumhākaṃ doso pahīno…pe… tumhākaṃ moho pahīno ucchinnamūlo tālāvatthukato anabhāvaṅkato āyatiṃ anuppādadhammo. Tumhe loke sukatā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Abhikkantaṃ, bhante, abhikkantaṃ, bhante! Seyyathāpi, bhante, nikkujjitaṃ vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya – ‘cakkhumanto rūpāni dakkhantī’ti; evamevaṃ ayyena ānandena anekapariyāyena dhammo pakāsito. Esāhaṃ, bhante ānanda, taṃ bhagavantaṃ saraṇaṃ gacchāmi dhammañca bhikkhusaṅghañca. Upāsakaṃ maṃ ayyo ānando dhāretu, ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Mahānāmasakkasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "74"
      },
      ". Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sakkesu viharati kapilavatthusmiṃ nigrodhārāme. Tena kho pana samayena bhagavā gilānāvuṭṭhito ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[gilānavuṭṭhito (saddanīti)]"
      },
      " hoti aciravuṭṭhito gelaññā. Atha ",
      " kho mahānāmo sakko yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho mahānāmo sakko bhagavantaṃ etadavoca – ‘‘dīgharattāhaṃ, bhante, bhagavatā evaṃ dhammaṃ desitaṃ ājānāmi – ‘samāhitassa ñāṇaṃ, no asamāhitassā’ti. Samādhi nu kho, bhante, pubbe, pacchā ñāṇaṃ; udāhu ñāṇaṃ pubbe, pacchā samādhī’’ti? Atha kho āyasmato ānandassa etadahosi – ‘‘bhagavā kho gilānavuṭṭhito aciravuṭṭhito gelaññā ",
      ". Ayañca mahānāmo sakko bhagavantaṃ atigambhīraṃ pañhaṃ pucchati. Yaṃnūnāhaṃ mahānāmaṃ sakkaṃ ekamantaṃ apanetvā dhammaṃ deseyya’’nti."
    ],
    "innerText": "74. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sakkesu viharati kapilavatthusmiṃ nigrodhārāme. Tena kho pana samayena bhagavā gilānāvuṭṭhito [gilānavuṭṭhito (saddanīti)] hoti aciravuṭṭhito gelaññā. Atha kho mahānāmo sakko yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho mahānāmo sakko bhagavantaṃ etadavoca – ‘‘dīgharattāhaṃ, bhante, bhagavatā evaṃ dhammaṃ desitaṃ ājānāmi – ‘samāhitassa ñāṇaṃ, no asamāhitassā’ti. Samādhi nu kho, bhante, pubbe, pacchā ñāṇaṃ; udāhu ñāṇaṃ pubbe, pacchā samādhī’’ti? Atha kho āyasmato ānandassa etadahosi – ‘‘bhagavā kho gilānavuṭṭhito aciravuṭṭhito gelaññā . Ayañca mahānāmo sakko bhagavantaṃ atigambhīraṃ pañhaṃ pucchati. Yaṃnūnāhaṃ mahānāmaṃ sakkaṃ ekamantaṃ apanetvā dhammaṃ deseyya’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho āyasmā ānando mahānāmaṃ sakkaṃ bāhāyaṃ gahetvā ekamantaṃ apanetvā mahānāmaṃ sakkaṃ etadavoca – ‘‘sekhampi kho, mahānāma, sīlaṃ vuttaṃ bhagavatā, asekhampi sīlaṃ vuttaṃ bhagavatā; sekhopi samādhi vutto bhagavatā ",
      ", asekhopi samādhi vutto bhagavatā; sekhāpi paññā vuttā bhagavatā, asekhāpi paññā vuttā bhagavatā. Katamañca, mahānāma ",
      ", sekhaṃ sīlaṃ? Idha, mahānāma, bhikkhu sīlavā hoti pātimokkhasaṃvarasaṃvuto viharati…pe… samādāya sikkhati sikkhāpadesu. Idaṃ vuccati, mahānāma, sekhaṃ sīlaṃ’’."
    ],
    "innerText": "Atha kho āyasmā ānando mahānāmaṃ sakkaṃ bāhāyaṃ gahetvā ekamantaṃ apanetvā mahānāmaṃ sakkaṃ etadavoca – ‘‘sekhampi kho, mahānāma, sīlaṃ vuttaṃ bhagavatā, asekhampi sīlaṃ vuttaṃ bhagavatā; sekhopi samādhi vutto bhagavatā , asekhopi samādhi vutto bhagavatā; sekhāpi paññā vuttā bhagavatā, asekhāpi paññā vuttā bhagavatā. Katamañca, mahānāma , sekhaṃ sīlaṃ? Idha, mahānāma, bhikkhu sīlavā hoti pātimokkhasaṃvarasaṃvuto viharati…pe… samādāya sikkhati sikkhāpadesu. Idaṃ vuccati, mahānāma, sekhaṃ sīlaṃ’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamo ca, mahānāma, sekho samādhi? Idha, mahānāma, bhikkhu vivicceva kāmehi…pe… catutthaṃ jhānaṃ upasampajja viharati. Ayaṃ vuccati, mahānāma, sekho samādhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamā ca, mahānāma, sekhā paññā? Idha, mahānāma, bhikkhu idaṃ dukkhanti yathābhūtaṃ pajānāti…pe… ",
      " ayaṃ dukkhanirodhagāminī paṭipadāti yathābhūtaṃ pajānāti. Ayaṃ vuccati, mahānāma, sekhā paññā."
    ],
    "innerText": "‘‘Katamā ca, mahānāma, sekhā paññā? Idha, mahānāma, bhikkhu idaṃ dukkhanti yathābhūtaṃ pajānāti…pe… ayaṃ dukkhanirodhagāminī paṭipadāti yathābhūtaṃ pajānāti. Ayaṃ vuccati, mahānāma, sekhā paññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sa kho so, mahānāma, ariyasāvako evaṃ sīlasampanno evaṃ samādhisampanno evaṃ paññāsampanno āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Evaṃ kho, mahānāma, sekhampi sīlaṃ vuttaṃ bhagavatā, asekhampi sīlaṃ vuttaṃ bhagavatā; sekhopi samādhi vutto bhagavatā, asekhopi samādhi vutto bhagavatā; sekhāpi paññā vuttā bhagavatā, asekhāpi paññā vuttā bhagavatā’’ti. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Nigaṇṭhasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "75"
      },
      ". Ekaṃ ",
      " samayaṃ āyasmā ānando vesāliyaṃ viharati mahāvane kūṭāgārasālāyaṃ. Atha kho abhayo ca licchavi paṇḍitakumārako ca licchavi yenāyasmā ānando tenupasaṅkamiṃsu; upasaṅkamitvā āyasmantaṃ ānandaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinno kho abhayo licchavi āyasmantaṃ ānandaṃ etadavoca – ‘‘nigaṇṭho, bhante, nāṭaputto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[nāthaputto (sī. pī.)]"
      },
      " sabbaññū sabbadassāvī aparisesaṃ ñāṇadassanaṃ paṭijānāti – ‘carato ca me tiṭṭhato ca suttassa ca jāgarassa ca satataṃ samitaṃ ñāṇadassanaṃ paccupaṭṭhita’nti. So purāṇānaṃ kammānaṃ tapasā byantībhāvaṃ paññapeti navānaṃ kammānaṃ akaraṇā setughātaṃ ",
      ". Iti kammakkhayā dukkhakkhayo, dukkhakkhayā vedanākkhayo, vedanākkhayā sabbaṃ dukkhaṃ nijjiṇṇaṃ bhavissati – evametissā sandiṭṭhikāya nijjarāya ",
      " visuddhiyā samatikkamo hoti. Idha, bhante, bhagavā kimāhā’’ti?"
    ],
    "innerText": "75. Ekaṃ samayaṃ āyasmā ānando vesāliyaṃ viharati mahāvane kūṭāgārasālāyaṃ. Atha kho abhayo ca licchavi paṇḍitakumārako ca licchavi yenāyasmā ānando tenupasaṅkamiṃsu; upasaṅkamitvā āyasmantaṃ ānandaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinno kho abhayo licchavi āyasmantaṃ ānandaṃ etadavoca – ‘‘nigaṇṭho, bhante, nāṭaputto [nāthaputto (sī. pī.)] sabbaññū sabbadassāvī aparisesaṃ ñāṇadassanaṃ paṭijānāti – ‘carato ca me tiṭṭhato ca suttassa ca jāgarassa ca satataṃ samitaṃ ñāṇadassanaṃ paccupaṭṭhita’nti. So purāṇānaṃ kammānaṃ tapasā byantībhāvaṃ paññapeti navānaṃ kammānaṃ akaraṇā setughātaṃ . Iti kammakkhayā dukkhakkhayo, dukkhakkhayā vedanākkhayo, vedanākkhayā sabbaṃ dukkhaṃ nijjiṇṇaṃ bhavissati – evametissā sandiṭṭhikāya nijjarāya visuddhiyā samatikkamo hoti. Idha, bhante, bhagavā kimāhā’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tisso kho imā, abhaya, nijjarā visuddhiyo tena bhagavatā jānatā passatā arahatā sammāsambuddhena sammadakkhātā sattānaṃ visuddhiyā sokaparidevānaṃ samatikkamāya dukkhadomanassānaṃ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāya. Katamā tisso? Idha, abhaya, bhikkhu sīlavā hoti…pe… samādāya sikkhati sikkhāpadesu. So navañca kammaṃ na karoti, purāṇañca kammaṃ phussa phussa byantīkaroti. Sandiṭṭhikā nijjarā akālikā ehipassikā opaneyyikā paccattaṃ veditabbā viññūhīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sa ",
      " kho so, abhaya, bhikkhu evaṃ sīlasampanno vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati. Vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja viharati. Pītiyā ca virāgā upekkhako ca viharati sato ca sampajāno, sukhañca kāyena paṭisaṃvedeti yaṃ taṃ ariyā ācikkhanti – ‘upekkhako satimā sukhavihārī’ti tatiyaṃ jhānaṃ upasampajja viharati. Sukhassa ca pahānā dukkhassa ca pahānā, pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja ",
      " viharati. So navañca kammaṃ na karoti, purāṇañca kammaṃ phussa phussa byantīkaroti. Sandiṭṭhikā nijjarā akālikā ehipassikā opaneyyikā paccattaṃ veditabbā viññūhīti."
    ],
    "innerText": "‘‘Sa kho so, abhaya, bhikkhu evaṃ sīlasampanno vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati. Vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja viharati. Pītiyā ca virāgā upekkhako ca viharati sato ca sampajāno, sukhañca kāyena paṭisaṃvedeti yaṃ taṃ ariyā ācikkhanti – ‘upekkhako satimā sukhavihārī’ti tatiyaṃ jhānaṃ upasampajja viharati. Sukhassa ca pahānā dukkhassa ca pahānā, pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharati. So navañca kammaṃ na karoti, purāṇañca kammaṃ phussa phussa byantīkaroti. Sandiṭṭhikā nijjarā akālikā ehipassikā opaneyyikā paccattaṃ veditabbā viññūhīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sa kho so, abhaya, bhikkhu evaṃ samādhisampanno ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[evaṃ sīlasampanno evaṃ samādhisampanno (sī. syā. kaṃ.)]"
      },
      " āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. So navañca kammaṃ na karoti, purāṇañca kammaṃ phussa phussa byantīkaroti. Sandiṭṭhikā nijjarā akālikā ehipassikā opaneyyikā paccattaṃ veditabbā viññūhīti. Imā kho, abhaya, tisso nijjarā visuddhiyo tena bhagavatā jānatā passatā arahatā sammāsambuddhena sammadakkhātā sattānaṃ visuddhiyā sokaparidevānaṃ samatikkamāya dukkhadomanassānaṃ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāyā’’ti."
    ],
    "innerText": "‘‘Sa kho so, abhaya, bhikkhu evaṃ samādhisampanno [evaṃ sīlasampanno evaṃ samādhisampanno (sī. syā. kaṃ.)] āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. So navañca kammaṃ na karoti, purāṇañca kammaṃ phussa phussa byantīkaroti. Sandiṭṭhikā nijjarā akālikā ehipassikā opaneyyikā paccattaṃ veditabbā viññūhīti. Imā kho, abhaya, tisso nijjarā visuddhiyo tena bhagavatā jānatā passatā arahatā sammāsambuddhena sammadakkhātā sattānaṃ visuddhiyā sokaparidevānaṃ samatikkamāya dukkhadomanassānaṃ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ vutte paṇḍitakumārako licchavi abhayaṃ licchaviṃ etadavoca – ‘‘kiṃ pana tvaṃ, samma abhaya, āyasmato ānandassa subhāsitaṃ subhāsitato nābbhanumodasī’’ti? ‘‘Kyāhaṃ, samma paṇḍitakumāraka, āyasmato ānandassa subhāsitaṃ subhāsitato ",
      " nābbhanumodissāmi! Muddhāpi tassa vipateyya yo āyasmato ānandassa subhāsitaṃ subhāsitato nābbhanumodeyyā’’ti. Catutthaṃ."
    ],
    "innerText": "Evaṃ vutte paṇḍitakumārako licchavi abhayaṃ licchaviṃ etadavoca – ‘‘kiṃ pana tvaṃ, samma abhaya, āyasmato ānandassa subhāsitaṃ subhāsitato nābbhanumodasī’’ti? ‘‘Kyāhaṃ, samma paṇḍitakumāraka, āyasmato ānandassa subhāsitaṃ subhāsitato nābbhanumodissāmi! Muddhāpi tassa vipateyya yo āyasmato ānandassa subhāsitaṃ subhāsitato nābbhanumodeyyā’’ti. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Nivesakasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "76"
      },
      ". Atha ",
      " kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ",
      " ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ ānandaṃ bhagavā etadavoca –"
    ],
    "innerText": "76. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ ānandaṃ bhagavā etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ye, ānanda, anukampeyyātha ye ca sotabbaṃ maññeyyuṃ mittā vā amaccā vā ñātī vā ",
      " sālohitā vā te vo, ānanda, tīsu ṭhānesu samādapetabbā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[samādāpetabbā (?)]"
      },
      " nivesetabbā patiṭṭhāpetabbā. Katamesu tīsu? Buddhe aveccappasāde samādapetabbā nivesetabbā patiṭṭhāpetabbā – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi; satthā devamanussānaṃ, buddho bhagavā’ti, dhamme aveccappasāde samādapetabbā nivesetabbā patiṭṭhāpetabbā – ‘svākkhāto bhagavatā dhammo sandiṭṭhiko akāliko ehipassiko opaneyyiko paccattaṃ veditabbo viññūhī’ti, saṅghe aveccappasāde samādapetabbā nivesetabbā patiṭṭhāpetabbā – ‘suppaṭipanno bhagavato sāvakasaṅgho ujuppaṭipanno bhagavato sāvakasaṅgho ñāyappaṭipanno bhagavato sāvakasaṅgho sāmīcippaṭipanno bhagavato sāvakasaṅgho, yadidaṃ cattāri purisayugāni aṭṭha purisapuggalā esa bhagavato sāvakasaṅgho āhuneyyo pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassā’’’ti."
    ],
    "innerText": "‘‘Ye, ānanda, anukampeyyātha ye ca sotabbaṃ maññeyyuṃ mittā vā amaccā vā ñātī vā sālohitā vā te vo, ānanda, tīsu ṭhānesu samādapetabbā [samādāpetabbā (?)] nivesetabbā patiṭṭhāpetabbā. Katamesu tīsu? Buddhe aveccappasāde samādapetabbā nivesetabbā patiṭṭhāpetabbā – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi; satthā devamanussānaṃ, buddho bhagavā’ti, dhamme aveccappasāde samādapetabbā nivesetabbā patiṭṭhāpetabbā – ‘svākkhāto bhagavatā dhammo sandiṭṭhiko akāliko ehipassiko opaneyyiko paccattaṃ veditabbo viññūhī’ti, saṅghe aveccappasāde samādapetabbā nivesetabbā patiṭṭhāpetabbā – ‘suppaṭipanno bhagavato sāvakasaṅgho ujuppaṭipanno bhagavato sāvakasaṅgho ñāyappaṭipanno bhagavato sāvakasaṅgho sāmīcippaṭipanno bhagavato sāvakasaṅgho, yadidaṃ cattāri purisayugāni aṭṭha purisapuggalā esa bhagavato sāvakasaṅgho āhuneyyo pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassā’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Siyā, ānanda, catunnaṃ mahābhūtānaṃ aññathattaṃ – pathavīdhātuyā āpodhātuyā tejodhātuyā vāyodhātuyā, na tveva buddhe aveccappasādena samannāgatassa ariyasāvakassa siyā aññathattaṃ tatridaṃ aññathattaṃ. So vatānanda, buddhe aveccappasādena samannāgato ariyasāvako nirayaṃ vā tiracchānayoniṃ vā pettivisayaṃ vā upapajjissatīti netaṃ ṭhānaṃ vijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Siyā ",
      ", ānanda, catunnaṃ mahābhūtānaṃ aññathattaṃ – pathavīdhātuyā āpodhātuyā tejodhātuyā vāyodhātuyā, na tveva dhamme…pe… na tveva saṅghe aveccappasādena ",
      " samannāgatassa ariyasāvakassa siyā aññathattaṃ tatridaṃ aññathattaṃ. So vatānanda, saṅghe aveccappasādena samannāgato ",
      " ariyasāvako nirayaṃ vā tiracchānayoniṃ vā pettivisayaṃ vā upapajjissatīti netaṃ ṭhānaṃ vijjati."
    ],
    "innerText": "‘‘Siyā , ānanda, catunnaṃ mahābhūtānaṃ aññathattaṃ – pathavīdhātuyā āpodhātuyā tejodhātuyā vāyodhātuyā, na tveva dhamme…pe… na tveva saṅghe aveccappasādena samannāgatassa ariyasāvakassa siyā aññathattaṃ tatridaṃ aññathattaṃ. So vatānanda, saṅghe aveccappasādena samannāgato ariyasāvako nirayaṃ vā tiracchānayoniṃ vā pettivisayaṃ vā upapajjissatīti netaṃ ṭhānaṃ vijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ye, ānanda, anukampeyyātha ye ca sotabbaṃ maññeyyuṃ mittā vā amaccā vā ñātī vā ",
      " sālohitā vā te vo, ānanda, imesu tīsu ṭhānesu samādapetabbā nivesetabbā patiṭṭhāpetabbā’’ti. Pañcamaṃ."
    ],
    "innerText": "‘‘Ye, ānanda, anukampeyyātha ye ca sotabbaṃ maññeyyuṃ mittā vā amaccā vā ñātī vā sālohitā vā te vo, ānanda, imesu tīsu ṭhānesu samādapetabbā nivesetabbā patiṭṭhāpetabbā’’ti. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Paṭhamabhavasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "77"
      },
      ". Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘bhavo, bhavoti, bhante, vuccati. Kittāvatā nu kho, bhante, bhavo hotī’’ti?"
    ],
    "innerText": "77. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘bhavo, bhavoti, bhante, vuccati. Kittāvatā nu kho, bhante, bhavo hotī’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kāmadhātuvepakkañca, ānanda, kammaṃ nābhavissa, api nu kho kāmabhavo paññāyethā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Iti kho, ānanda, kammaṃ khettaṃ, viññāṇaṃ bījaṃ, taṇhā sneho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sineho (sī. syā. kaṃ. pī.)]"
      },
      ". Avijjānīvaraṇānaṃ sattānaṃ taṇhāsaṃyojanānaṃ hīnāya dhātuyā viññāṇaṃ patiṭṭhitaṃ evaṃ āyatiṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[āyati (sī.)]"
      },
      " punabbhavābhinibbatti hoti. ( ) ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[(evaṃ kho ānanda bhavo hotīti) (ka.) dutiyasutte pana idaṃ pāṭhanānattaṃ natthi]"
      }
    ],
    "innerText": "‘‘Kāmadhātuvepakkañca, ānanda, kammaṃ nābhavissa, api nu kho kāmabhavo paññāyethā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Iti kho, ānanda, kammaṃ khettaṃ, viññāṇaṃ bījaṃ, taṇhā sneho [sineho (sī. syā. kaṃ. pī.)]. Avijjānīvaraṇānaṃ sattānaṃ taṇhāsaṃyojanānaṃ hīnāya dhātuyā viññāṇaṃ patiṭṭhitaṃ evaṃ āyatiṃ [āyati (sī.)] punabbhavābhinibbatti hoti. ( ) [(evaṃ kho ānanda bhavo hotīti) (ka.) dutiyasutte pana idaṃ pāṭhanānattaṃ natthi]"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Rūpadhātuvepakkañca, ānanda, kammaṃ nābhavissa, api nu kho rūpabhavo paññāyethā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Iti kho ānanda, kammaṃ khettaṃ, viññāṇaṃ bījaṃ, taṇhā sneho. Avijjānīvaraṇānaṃ sattānaṃ taṇhāsaṃyojanānaṃ majjhimāya dhātuyā viññāṇaṃ patiṭṭhitaṃ evaṃ āyatiṃ punabbhavābhinibbatti hoti. ( ) ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[(evaṃ kho ānanda bhavo hotīti) (ka.) dutiyasutte pana idaṃ pāṭhanānattaṃ natthi]"
      }
    ],
    "innerText": "‘‘Rūpadhātuvepakkañca, ānanda, kammaṃ nābhavissa, api nu kho rūpabhavo paññāyethā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Iti kho ānanda, kammaṃ khettaṃ, viññāṇaṃ bījaṃ, taṇhā sneho. Avijjānīvaraṇānaṃ sattānaṃ taṇhāsaṃyojanānaṃ majjhimāya dhātuyā viññāṇaṃ patiṭṭhitaṃ evaṃ āyatiṃ punabbhavābhinibbatti hoti. ( ) [(evaṃ kho ānanda bhavo hotīti) (ka.) dutiyasutte pana idaṃ pāṭhanānattaṃ natthi]"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Arūpadhātuvepakkañca, ānanda, kammaṃ nābhavissa, api ",
      " nu kho arūpabhavo paññāyethā’’ti? ‘‘No ",
      " hetaṃ, bhante’’. ‘‘Iti kho, ānanda, kammaṃ khettaṃ, viññāṇaṃ bījaṃ, taṇhā sneho. Avijjānīvaraṇānaṃ sattānaṃ taṇhāsaṃyojanānaṃ paṇītāya dhātuyā viññāṇaṃ patiṭṭhitaṃ evaṃ āyatiṃ punabbhavābhinibbatti hoti. Evaṃ kho, ānanda, bhavo hotī’’ti. Chaṭṭhaṃ."
    ],
    "innerText": "‘‘Arūpadhātuvepakkañca, ānanda, kammaṃ nābhavissa, api nu kho arūpabhavo paññāyethā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Iti kho, ānanda, kammaṃ khettaṃ, viññāṇaṃ bījaṃ, taṇhā sneho. Avijjānīvaraṇānaṃ sattānaṃ taṇhāsaṃyojanānaṃ paṇītāya dhātuyā viññāṇaṃ patiṭṭhitaṃ evaṃ āyatiṃ punabbhavābhinibbatti hoti. Evaṃ kho, ānanda, bhavo hotī’’ti. Chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Dutiyabhavasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "78"
      },
      ". Atha ",
      " kho āyasmā ānando yena bhagavā tenupasaṅkami…pe… āyasmā ānando bhagavantaṃ etadavoca – ‘‘bhavo, bhavoti, bhante, vuccati. Kittāvatā nu kho, bhante, bhavo hotī’’ti?"
    ],
    "innerText": "78. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami…pe… āyasmā ānando bhagavantaṃ etadavoca – ‘‘bhavo, bhavoti, bhante, vuccati. Kittāvatā nu kho, bhante, bhavo hotī’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kāmadhātuvepakkañca, ānanda, kammaṃ nābhavissa, api nu kho kāmabhavo paññāyethā’’ti? ‘‘No hetaṃ bhante’’. ‘‘Iti kho, ānanda, kammaṃ khettaṃ, viññāṇaṃ bījaṃ, taṇhā sneho. Avijjānīvaraṇānaṃ sattānaṃ taṇhāsaṃyojanānaṃ hīnāya dhātuyā cetanā patiṭṭhitā patthanā patiṭṭhitā evaṃ āyatiṃ punabbhavābhinibbatti hoti’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Rūpadhātuvepakkañca, ānanda, kammaṃ nābhavissa, api nu kho rūpabhavo paññāyethā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Iti kho, ānanda, kammaṃ khettaṃ, viññāṇaṃ bījaṃ, taṇhā sneho. Avijjānīvaraṇānaṃ sattānaṃ taṇhāsaṃyojanānaṃ majjhimāya dhātuyā cetanā patiṭṭhitā patthanā patiṭṭhitā evaṃ āyatiṃ punabbhavābhinibbatti hoti’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Arūpadhātuvepakkañca, ānanda, kammaṃ nābhavissa, api nu kho arūpabhavo paññāyethā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Iti kho, ānanda, kammaṃ ",
      " khettaṃ, viññāṇaṃ bījaṃ, taṇhā sneho. Avijjānīvaraṇānaṃ sattānaṃ taṇhāsaṃyojanānaṃ paṇītāya dhātuyā cetanā patiṭṭhitā patthanā patiṭṭhitā evaṃ āyatiṃ punabbhavābhinibbatti hoti. Evaṃ kho, ānanda, bhavo hotī’’ti. Sattamaṃ."
    ],
    "innerText": "‘‘Arūpadhātuvepakkañca, ānanda, kammaṃ nābhavissa, api nu kho arūpabhavo paññāyethā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Iti kho, ānanda, kammaṃ khettaṃ, viññāṇaṃ bījaṃ, taṇhā sneho. Avijjānīvaraṇānaṃ sattānaṃ taṇhāsaṃyojanānaṃ paṇītāya dhātuyā cetanā patiṭṭhitā patthanā patiṭṭhitā evaṃ āyatiṃ punabbhavābhinibbatti hoti. Evaṃ kho, ānanda, bhavo hotī’’ti. Sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Sīlabbatasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "79"
      },
      ". Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ ",
      " nisinnaṃ kho āyasmantaṃ ānandaṃ bhagavā etadavoca – ‘‘sabbaṃ nu kho, ānanda, sīlabbataṃ jīvitaṃ brahmacariyaṃ upaṭṭhānasāraṃ saphala’’nti? ‘‘Na khvettha, bhante, ekaṃsenā’’ti. ‘‘Tena hānanda, vibhajassū’’ti."
    ],
    "innerText": "79. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ ānandaṃ bhagavā etadavoca – ‘‘sabbaṃ nu kho, ānanda, sīlabbataṃ jīvitaṃ brahmacariyaṃ upaṭṭhānasāraṃ saphala’’nti? ‘‘Na khvettha, bhante, ekaṃsenā’’ti. ‘‘Tena hānanda, vibhajassū’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yañhissa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yathārūpaṃ hissa (?) sevitabbāsevitabbasuttānurūpaṃ]"
      },
      ", bhante, sīlabbataṃ jīvitaṃ brahmacariyaṃ upaṭṭhānasāraṃ sevato akusalā dhammā abhivaḍḍhanti kusalā dhammā parihāyanti, evarūpaṃ sīlabbataṃ jīvitaṃ ",
      " brahmacariyaṃ upaṭṭhānasāraṃ aphalaṃ. Yañca khvāssa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yañhissa (ka.), yathārūpañca khvāssa (?)]"
      },
      ", bhante, sīlabbataṃ jīvitaṃ brahmacariyaṃ upaṭṭhānasāraṃ sevato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhanti, evarūpaṃ sīlabbataṃ jīvitaṃ brahmacariyaṃ upaṭṭhānasāraṃ saphala’’nti. Idamavoca āyasmā ānando; samanuñño satthā ahosi."
    ],
    "innerText": "‘‘Yañhissa [yathārūpaṃ hissa (?) sevitabbāsevitabbasuttānurūpaṃ], bhante, sīlabbataṃ jīvitaṃ brahmacariyaṃ upaṭṭhānasāraṃ sevato akusalā dhammā abhivaḍḍhanti kusalā dhammā parihāyanti, evarūpaṃ sīlabbataṃ jīvitaṃ brahmacariyaṃ upaṭṭhānasāraṃ aphalaṃ. Yañca khvāssa [yañhissa (ka.), yathārūpañca khvāssa (?)], bhante, sīlabbataṃ jīvitaṃ brahmacariyaṃ upaṭṭhānasāraṃ sevato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhanti, evarūpaṃ sīlabbataṃ jīvitaṃ brahmacariyaṃ upaṭṭhānasāraṃ saphala’’nti. Idamavoca āyasmā ānando; samanuñño satthā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha kho āyasmā ānando ‘‘samanuñño me satthā’’ti, uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi. Atha kho bhagavā acirapakkante āyasmante ānande bhikkhū āmantesi – ‘‘sekho, bhikkhave, ānando; na ca panassa sulabharūpo samasamo paññāyā’’ti. Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Gandhajātasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "80"
      },
      ". Atha ",
      " kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca –"
    ],
    "innerText": "80. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tīṇimāni, bhante, gandhajātāni, yesaṃ anuvātaṃyeva gandho gacchati, no paṭivātaṃ. Katamāni tīṇi? Mūlagandho, sāragandho, pupphagandho – imāni kho, bhante, tīṇi gandhajātāni, yesaṃ anuvātaṃyeva gandho gacchati, no paṭivātaṃ. Atthi nu kho, bhante, kiñci gandhajātaṃ yassa anuvātampi gandho gacchati, paṭivātampi gandho gacchati, anuvātapaṭivātampi gandho gacchatī’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Atthānanda, kiñci gandhajātaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[atthānanda gandhajātaṃ (sī. syā. kaṃ. pī.)]"
      },
      " yassa anuvātampi gandho gacchati ",
      ", paṭivātampi gandho gacchati, anuvātapaṭivātampi gandho gacchatī’’ti. ‘‘Katamañca pana, bhante, gandhajātaṃ yassa anuvātampi gandho gacchati, paṭivātampi gandho gacchati, anuvātapaṭivātampi gandho gacchatī’’ti?"
    ],
    "innerText": "‘‘Atthānanda, kiñci gandhajātaṃ [atthānanda gandhajātaṃ (sī. syā. kaṃ. pī.)] yassa anuvātampi gandho gacchati , paṭivātampi gandho gacchati, anuvātapaṭivātampi gandho gacchatī’’ti. ‘‘Katamañca pana, bhante, gandhajātaṃ yassa anuvātampi gandho gacchati, paṭivātampi gandho gacchati, anuvātapaṭivātampi gandho gacchatī’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idhānanda ",
      ", yasmiṃ gāme vā nigame vā itthī vā puriso vā buddhaṃ saraṇaṃ gato hoti, dhammaṃ saraṇaṃ gato hoti, saṅghaṃ saraṇaṃ gato hoti, pāṇātipātā paṭivirato hoti, adinnādānā paṭivirato hoti, kāmesumicchācārā paṭivirato hoti, musāvādā paṭivirato hoti, surāmerayamajjapamādaṭṭhānā paṭivirato hoti ",
      ", sīlavā hoti kalyāṇadhammo, vigatamalamaccherena cetasā agāraṃ ajjhāvasati muttacāgo payatapāṇi vossaggarato yācayogo dānasaṃvibhāgarato."
    ],
    "innerText": "‘‘Idhānanda , yasmiṃ gāme vā nigame vā itthī vā puriso vā buddhaṃ saraṇaṃ gato hoti, dhammaṃ saraṇaṃ gato hoti, saṅghaṃ saraṇaṃ gato hoti, pāṇātipātā paṭivirato hoti, adinnādānā paṭivirato hoti, kāmesumicchācārā paṭivirato hoti, musāvādā paṭivirato hoti, surāmerayamajjapamādaṭṭhānā paṭivirato hoti , sīlavā hoti kalyāṇadhammo, vigatamalamaccherena cetasā agāraṃ ajjhāvasati muttacāgo payatapāṇi vossaggarato yācayogo dānasaṃvibhāgarato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tassa disāsu samaṇabrāhmaṇā vaṇṇaṃ bhāsanti – ‘amukasmiṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[asukasmiṃ (sī. syā. kaṃ. pī.)]"
      },
      " nāma gāme vā nigame vā itthī vā puriso vā buddhaṃ saraṇaṃ gato hoti, dhammaṃ ",
      " saraṇaṃ gato hoti, saṅghaṃ saraṇaṃ gato hoti, pāṇātipātā paṭivirato hoti, adinnādānā paṭivirato hoti, kāmesumicchācārā paṭivirato hoti, musāvādā paṭivirato hoti, surāmerayamajjapamādaṭṭhānā paṭivirato hoti, sīlavā hoti kalyāṇadhammo, vigatamalamaccherena cetasā agāraṃ ajjhāvasati muttacāgo payatapāṇi vossaggarato yācayogo dānasaṃvibhāgarato’’’ti."
    ],
    "innerText": "‘‘Tassa disāsu samaṇabrāhmaṇā vaṇṇaṃ bhāsanti – ‘amukasmiṃ [asukasmiṃ (sī. syā. kaṃ. pī.)] nāma gāme vā nigame vā itthī vā puriso vā buddhaṃ saraṇaṃ gato hoti, dhammaṃ saraṇaṃ gato hoti, saṅghaṃ saraṇaṃ gato hoti, pāṇātipātā paṭivirato hoti, adinnādānā paṭivirato hoti, kāmesumicchācārā paṭivirato hoti, musāvādā paṭivirato hoti, surāmerayamajjapamādaṭṭhānā paṭivirato hoti, sīlavā hoti kalyāṇadhammo, vigatamalamaccherena cetasā agāraṃ ajjhāvasati muttacāgo payatapāṇi vossaggarato yācayogo dānasaṃvibhāgarato’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Devatāpissa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[devatāpissa amanussā (sī. pī.), devatāpissa amanussāpi (ka.), devatāpissa…pe… manussāpissa (?)]"
      },
      " vaṇṇaṃ bhāsanti – ‘amukasmiṃ nāma gāme vā nigame vā itthī vā puriso vā buddhaṃ saraṇaṃ gato hoti, dhammaṃ saraṇaṃ gato hoti, saṅghaṃ saraṇaṃ gato hoti, pāṇātipātā paṭivirato hoti…pe… surāmerayamajjapamādaṭṭhānā paṭivirato hoti, sīlavā hoti kalyāṇadhammo, vigatamalamaccherena cetasā agāraṃ ajjhāvasati muttacāgo payatapāṇi vossaggarato yācayogo dānasaṃvibhāgarato’ti. Idaṃ kho taṃ, ānanda, gandhajātaṃ yassa anuvātampi gandho gacchati, paṭivātampi gandho gacchati, anuvātapaṭivātampi gandho gacchatī’’ti."
    ],
    "innerText": "‘‘Devatāpissa [devatāpissa amanussā (sī. pī.), devatāpissa amanussāpi (ka.), devatāpissa…pe… manussāpissa (?)] vaṇṇaṃ bhāsanti – ‘amukasmiṃ nāma gāme vā nigame vā itthī vā puriso vā buddhaṃ saraṇaṃ gato hoti, dhammaṃ saraṇaṃ gato hoti, saṅghaṃ saraṇaṃ gato hoti, pāṇātipātā paṭivirato hoti…pe… surāmerayamajjapamādaṭṭhānā paṭivirato hoti, sīlavā hoti kalyāṇadhammo, vigatamalamaccherena cetasā agāraṃ ajjhāvasati muttacāgo payatapāṇi vossaggarato yācayogo dānasaṃvibhāgarato’ti. Idaṃ kho taṃ, ānanda, gandhajātaṃ yassa anuvātampi gandho gacchati, paṭivātampi gandho gacchati, anuvātapaṭivātampi gandho gacchatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Na pupphagandho paṭivātameti,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "children": [
      "Na candanaṃ tagaramallikā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[taggaramallikā (pī.)]"
      },
      " vā;"
    ],
    "innerText": "Na candanaṃ tagaramallikā [taggaramallikā (pī.)] vā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Satañca gandho paṭivātameti,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sabbā disā sappuriso pavāyatī’’ti. navamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Cūḷanikāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "81"
      },
      ". Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ",
      " ekamantaṃ nisīdi ",
      ". Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘sammukhāmetaṃ, bhante, bhagavato ",
      " sutaṃ sammukhā paṭiggahitaṃ – ‘bhagavato, ānanda, sikhissa abhibhū nāma sāvako brahmaloke ṭhito sahassilokadhātuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sahassīlokadhātuṃ (pī.) saṃ. ni. 1.185 vitthāro]"
      },
      " sarena viññāpesī’ti. Bhagavā pana, bhante, arahaṃ sammāsambuddho kīvatakaṃ pahoti sarena ",
      " viññāpetu’’nti? ‘‘Sāvako so, ānanda, appameyyā tathāgatā’’ti."
    ],
    "innerText": "81. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi . Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘sammukhāmetaṃ, bhante, bhagavato sutaṃ sammukhā paṭiggahitaṃ – ‘bhagavato, ānanda, sikhissa abhibhū nāma sāvako brahmaloke ṭhito sahassilokadhātuṃ [sahassīlokadhātuṃ (pī.) saṃ. ni. 1.185 vitthāro] sarena viññāpesī’ti. Bhagavā pana, bhante, arahaṃ sammāsambuddho kīvatakaṃ pahoti sarena viññāpetu’’nti? ‘‘Sāvako so, ānanda, appameyyā tathāgatā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dutiyampi kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘sammukhā metaṃ, bhante, bhagavato sutaṃ sammukhā paṭiggahitaṃ – ‘bhagavato, ānanda, sikhissa abhibhū nāma sāvako brahmaloke ṭhito sahassilokadhātuṃ sarena viññāpesī’ti. Bhagavā pana, bhante, arahaṃ sammāsambuddho kīvatakaṃ pahoti sarena viññāpetu’’nti? ‘‘Sāvako so, ānanda, appameyyā tathāgatā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tatiyampi kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘sammukhāmetaṃ, bhante, bhagavato sutaṃ sammukhā paṭiggahitaṃ – ‘bhagavato, ānanda, sikhissa abhibhū nāma sāvako brahmaloke ṭhito sahassilokadhātuṃ sarena viññāpesī’ti. Bhagavā pana, bhante, arahaṃ sammāsambuddho kīvatakaṃ pahoti sarena viññāpetu’’nti? ‘‘Sutā te, ānanda, sahassī cūḷanikā lokadhātū’’ti? ‘‘Etassa, bhagavā, kālo; etassa, sugata, kālo! Yaṃ bhagavā bhāseyya. Bhagavato sutvā bhikkhū dhāressantī’’ti. ‘‘Tenahānanda, suṇāhi sādhukaṃ manasi karohi, bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho āyasmā ānando bhagavato paccassosi. Bhagavā etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yāvatā, ānanda, candimasūriyā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[candimasuriyā (sī. syā. kaṃ. pī.)]"
      },
      " pariharanti, disā bhanti virocanā, tāva sahassadhā loko. Tasmiṃ sahassadhā loke sahassaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[tasmiṃ sahassaṃ (syā. kaṃ. pī.)]"
      },
      " candānaṃ, sahassaṃ sūriyānaṃ, sahassaṃ sinerupabbatarājānaṃ, sahassaṃ jambudīpānaṃ, sahassaṃ aparagoyānānaṃ, sahassaṃ uttarakurūnaṃ, sahassaṃ pubbavidehānaṃ, cattāri mahāsamuddasahassāni, cattāri mahārājasahassāni, sahassaṃ cātumahārājikānaṃ, sahassaṃ tāvatiṃsānaṃ ",
      ", sahassaṃ yāmānaṃ ",
      ", sahassaṃ tusitānaṃ, sahassaṃ nimmānaratīnaṃ, sahassaṃ paranimmitavasavattīnaṃ, sahassaṃ brahmalokānaṃ – ayaṃ vuccatānanda, sahassī cūḷanikā lokadhātu."
    ],
    "innerText": "‘‘Yāvatā, ānanda, candimasūriyā [candimasuriyā (sī. syā. kaṃ. pī.)] pariharanti, disā bhanti virocanā, tāva sahassadhā loko. Tasmiṃ sahassadhā loke sahassaṃ [tasmiṃ sahassaṃ (syā. kaṃ. pī.)] candānaṃ, sahassaṃ sūriyānaṃ, sahassaṃ sinerupabbatarājānaṃ, sahassaṃ jambudīpānaṃ, sahassaṃ aparagoyānānaṃ, sahassaṃ uttarakurūnaṃ, sahassaṃ pubbavidehānaṃ, cattāri mahāsamuddasahassāni, cattāri mahārājasahassāni, sahassaṃ cātumahārājikānaṃ, sahassaṃ tāvatiṃsānaṃ , sahassaṃ yāmānaṃ , sahassaṃ tusitānaṃ, sahassaṃ nimmānaratīnaṃ, sahassaṃ paranimmitavasavattīnaṃ, sahassaṃ brahmalokānaṃ – ayaṃ vuccatānanda, sahassī cūḷanikā lokadhātu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yāvatānanda ",
      ", sahassī cūḷanikā lokadhātu tāva sahassadhā loko. Ayaṃ vuccatānanda, dvisahassī majjhimikā lokadhātu."
    ],
    "innerText": "‘‘Yāvatānanda , sahassī cūḷanikā lokadhātu tāva sahassadhā loko. Ayaṃ vuccatānanda, dvisahassī majjhimikā lokadhātu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Yāvatānanda, dvisahassī majjhimikā lokadhātu tāva sahassadhā loko. Ayaṃ vuccatānanda, tisahassī mahāsahassī lokadhātu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ākaṅkhamāno, ānanda, tathāgato tisahassimahāsahassilokadhātuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[tisahassi mahāsahassiṃ lokadhātuṃ (syā. kaṃ.), tisahassīmahāsahassīlokadhātuṃ (pī.)]"
      },
      " sarena viññāpeyya, yāvatā pana ākaṅkheyyā’’ti."
    ],
    "innerText": "‘‘Ākaṅkhamāno, ānanda, tathāgato tisahassimahāsahassilokadhātuṃ [tisahassi mahāsahassiṃ lokadhātuṃ (syā. kaṃ.), tisahassīmahāsahassīlokadhātuṃ (pī.)] sarena viññāpeyya, yāvatā pana ākaṅkheyyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Yathā kathaṃ pana, bhante, bhagavā tisahassimahāsahassilokadhātuṃ sarena viññāpeyya, yāvatā pana ākaṅkheyyā’’ti? ‘‘Idhānanda, tathāgato tisahassimahāsahassilokadhātuṃ obhāsena phareyya. Yadā te sattā taṃ ālokaṃ sañjāneyyuṃ, atha tathāgato ghosaṃ kareyya saddamanussāveyya. Evaṃ kho, ānanda, tathāgato tisahassimahāsahassilokadhātuṃ sarena viññāpeyya, yāvatā pana ākaṅkheyyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ vutte āyasmā ānando (āyasmantaṃ udāyiṃ) ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[(bhagavantaṃ) (sī.), ( ) natthi syā. kaṃ. potthakesu. aṭṭhakathāya sameti]"
      },
      " etadavoca – ‘‘lābhā vata me, suladdhaṃ vata me, yassa me satthā evaṃmahiddhiko evaṃmahānubhāvo’’ti. Evaṃ vutte āyasmā udāyī āyasmantaṃ ānandaṃ etadavoca – ‘‘kiṃ tuyhettha, āvuso ānanda, yadi te satthā evaṃmahiddhiko evaṃmahānubhāvo’’ti? Evaṃ vutte bhagavā āyasmantaṃ udāyiṃ etadavoca – ‘‘mā hevaṃ, udāyi, mā hevaṃ, udāyi. Sace, udāyi, ānando avītarāgo kālaṃ kareyya, tena cittappasādena sattakkhattuṃ devesu devarajjaṃ kāreyya, sattakkhattuṃ ",
      " imasmiṃyeva jambudīpe mahārajjaṃ kāreyya. Api ca, udāyi, ānando diṭṭheva dhamme parinibbāyissatī’’ti. Dasamaṃ."
    ],
    "innerText": "Evaṃ vutte āyasmā ānando (āyasmantaṃ udāyiṃ) [(bhagavantaṃ) (sī.), ( ) natthi syā. kaṃ. potthakesu. aṭṭhakathāya sameti] etadavoca – ‘‘lābhā vata me, suladdhaṃ vata me, yassa me satthā evaṃmahiddhiko evaṃmahānubhāvo’’ti. Evaṃ vutte āyasmā udāyī āyasmantaṃ ānandaṃ etadavoca – ‘‘kiṃ tuyhettha, āvuso ānanda, yadi te satthā evaṃmahiddhiko evaṃmahānubhāvo’’ti? Evaṃ vutte bhagavā āyasmantaṃ udāyiṃ etadavoca – ‘‘mā hevaṃ, udāyi, mā hevaṃ, udāyi. Sace, udāyi, ānando avītarāgo kālaṃ kareyya, tena cittappasādena sattakkhattuṃ devesu devarajjaṃ kāreyya, sattakkhattuṃ imasmiṃyeva jambudīpe mahārajjaṃ kāreyya. Api ca, udāyi, ānando diṭṭheva dhamme parinibbāyissatī’’ti. Dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ānandavaggo tatiyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Channo ājīvako sakko, nigaṇṭho ca nivesako;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Duve bhavā sīlabbataṃ, gandhajātañca cūḷanīti."
  }
]