[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "(11) 1. Sambodhavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Pubbevasambodhasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "104"
      },
      ". ‘‘Pubbeva ",
      " me, bhikkhave, sambodhā anabhisambuddhassa bodhisattasseva sato etadahosi – ‘ko nu kho loke assādo, ko ādīnavo, kiṃ nissaraṇa’nti? Tassa mayhaṃ, bhikkhave, etadahosi – ‘yaṃ kho lokaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[loke (sī. syā. kaṃ. pī.)]"
      },
      " paṭicca uppajjati sukhaṃ somanassaṃ, ayaṃ loke assādo. Yaṃ loko ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[loke (pī. ka.)]"
      },
      " anicco dukkho vipariṇāmadhammo, ayaṃ loke ādīnavo. Yo loke chandarāgavinayo chandarāgappahānaṃ, idaṃ loke nissaraṇa’nti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[lokanissaraṇaṃ (aṭṭha.) ‘‘loke nissaraṇa’’nti padena saṃsanditabbaṃ]"
      },
      ". Yāvakīvañcāhaṃ, bhikkhave, evaṃ lokassa assādañca assādato ",
      " ādīnavañca ādīnavato nissaraṇañca nissaraṇato yathābhūtaṃ nābbhaññāsiṃ, neva tāvāhaṃ, bhikkhave, sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya ‘anuttaraṃ sammāsambodhiṃ abhisambuddho’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[abhisambuddho (sī. syā. kaṃ. ka.)]"
      },
      " paccaññāsiṃ. Yato ca khvāhaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kho ahaṃ (sī. pī.), khohaṃ (syā. kaṃ. ka.)]"
      },
      ", bhikkhave, evaṃ lokassa assādañca assādato ādīnavañca ādīnavato nissaraṇañca nissaraṇato yathābhūtaṃ abbhaññāsiṃ, athāhaṃ, bhikkhave, sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya ‘anuttaraṃ sammāsambodhiṃ abhisambuddho’ti paccaññāsiṃ. Ñāṇañca pana me dassanaṃ udapādi – ‘akuppā me vimutti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[cetovimutti (sī. pī. ka.)]"
      },
      ", ayamantimā jāti, natthi dāni punabbhavo’’’ti. Paṭhamaṃ."
    ],
    "innerText": "104. ‘‘Pubbeva me, bhikkhave, sambodhā anabhisambuddhassa bodhisattasseva sato etadahosi – ‘ko nu kho loke assādo, ko ādīnavo, kiṃ nissaraṇa’nti? Tassa mayhaṃ, bhikkhave, etadahosi – ‘yaṃ kho lokaṃ [loke (sī. syā. kaṃ. pī.)] paṭicca uppajjati sukhaṃ somanassaṃ, ayaṃ loke assādo. Yaṃ loko [loke (pī. ka.)] anicco dukkho vipariṇāmadhammo, ayaṃ loke ādīnavo. Yo loke chandarāgavinayo chandarāgappahānaṃ, idaṃ loke nissaraṇa’nti [lokanissaraṇaṃ (aṭṭha.) ‘‘loke nissaraṇa’’nti padena saṃsanditabbaṃ]. Yāvakīvañcāhaṃ, bhikkhave, evaṃ lokassa assādañca assādato ādīnavañca ādīnavato nissaraṇañca nissaraṇato yathābhūtaṃ nābbhaññāsiṃ, neva tāvāhaṃ, bhikkhave, sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya ‘anuttaraṃ sammāsambodhiṃ abhisambuddho’ti [abhisambuddho (sī. syā. kaṃ. ka.)] paccaññāsiṃ. Yato ca khvāhaṃ [kho ahaṃ (sī. pī.), khohaṃ (syā. kaṃ. ka.)], bhikkhave, evaṃ lokassa assādañca assādato ādīnavañca ādīnavato nissaraṇañca nissaraṇato yathābhūtaṃ abbhaññāsiṃ, athāhaṃ, bhikkhave, sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya ‘anuttaraṃ sammāsambodhiṃ abhisambuddho’ti paccaññāsiṃ. Ñāṇañca pana me dassanaṃ udapādi – ‘akuppā me vimutti [cetovimutti (sī. pī. ka.)], ayamantimā jāti, natthi dāni punabbhavo’’’ti. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Paṭhamaassādasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "105"
      },
      ". ‘‘Lokassāhaṃ ",
      ", bhikkhave, assādapariyesanaṃ acariṃ. Yo loke assādo tadajjhagamaṃ. Yāvatako loke assādo, paññāya me so sudiṭṭho. Lokassāhaṃ, bhikkhave, ādīnavapariyesanaṃ acariṃ ",
      ". Yo loke ādīnavo tadajjhagamaṃ. Yāvatako loke ādīnavo, paññāya ",
      " me so sudiṭṭho. Lokassāhaṃ, bhikkhave, nissaraṇapariyesanaṃ acariṃ. Yaṃ loke nissaraṇaṃ tadajjhagamaṃ. Yāvatakaṃ loke nissaraṇaṃ, paññāya me taṃ sudiṭṭhaṃ. Yāvakīvañcāhaṃ, bhikkhave, lokassa assādañca assādato ādīnavañca ādīnavato nissaraṇañca nissaraṇato yathābhūtaṃ nābbhaññāsiṃ, neva tāvāhaṃ, bhikkhave, sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya ‘anuttaraṃ sammāsambodhiṃ abhisambuddho’ti paccaññāsiṃ. Yato ca khvāhaṃ, bhikkhave, lokassa assādañca assādato ādīnavañca ādīnavato nissaraṇañca nissaraṇato yathābhūtaṃ abbhaññāsiṃ, athāhaṃ, bhikkhave, sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya ‘anuttaraṃ sammāsambodhiṃ abhisambuddho’ti paccaññāsiṃ. Ñāṇañca pana me dassanaṃ udapādi – ‘akuppā me vimutti, ayamantimā jāti, natthi dāni punabbhavo’’’ti. Dutiyaṃ."
    ],
    "innerText": "105. ‘‘Lokassāhaṃ , bhikkhave, assādapariyesanaṃ acariṃ. Yo loke assādo tadajjhagamaṃ. Yāvatako loke assādo, paññāya me so sudiṭṭho. Lokassāhaṃ, bhikkhave, ādīnavapariyesanaṃ acariṃ . Yo loke ādīnavo tadajjhagamaṃ. Yāvatako loke ādīnavo, paññāya me so sudiṭṭho. Lokassāhaṃ, bhikkhave, nissaraṇapariyesanaṃ acariṃ. Yaṃ loke nissaraṇaṃ tadajjhagamaṃ. Yāvatakaṃ loke nissaraṇaṃ, paññāya me taṃ sudiṭṭhaṃ. Yāvakīvañcāhaṃ, bhikkhave, lokassa assādañca assādato ādīnavañca ādīnavato nissaraṇañca nissaraṇato yathābhūtaṃ nābbhaññāsiṃ, neva tāvāhaṃ, bhikkhave, sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya ‘anuttaraṃ sammāsambodhiṃ abhisambuddho’ti paccaññāsiṃ. Yato ca khvāhaṃ, bhikkhave, lokassa assādañca assādato ādīnavañca ādīnavato nissaraṇañca nissaraṇato yathābhūtaṃ abbhaññāsiṃ, athāhaṃ, bhikkhave, sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya ‘anuttaraṃ sammāsambodhiṃ abhisambuddho’ti paccaññāsiṃ. Ñāṇañca pana me dassanaṃ udapādi – ‘akuppā me vimutti, ayamantimā jāti, natthi dāni punabbhavo’’’ti. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Dutiyaassādasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "106"
      },
      ". ‘‘No ",
      " cedaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[no cetaṃ (syā. kaṃ. pī. ka.) saṃ. ni. 3.28 passitabbaṃ]"
      },
      ", bhikkhave, loke assādo abhavissa, nayidaṃ sattā loke sārajjeyyuṃ. Yasmā ca kho, bhikkhave, atthi loke assādo, tasmā sattā loke sārajjanti. No cedaṃ, bhikkhave, loke ādīnavo ",
      " abhavissa, nayidaṃ sattā loke nibbindeyyuṃ. Yasmā ca kho, bhikkhave, atthi loke ādīnavo, tasmā sattā loke nibbindanti. No cedaṃ, bhikkhave, loke nissaraṇaṃ abhavissa, nayidaṃ sattā lokamhā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[loke (ka.)]"
      },
      " nissareyyuṃ. Yasmā ca kho, bhikkhave, atthi loke nissaraṇaṃ, tasmā sattā lokamhā nissaranti. Yāvakīvañca, bhikkhave, sattā lokassa assādañca assādato ādīnavañca ādīnavato nissaraṇañca nissaraṇato yathābhūtaṃ nābbhaññāsuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[nābbhaññaṃsu (saṃ. ni. 3.28]"
      },
      ", neva tāva, bhikkhave, sattā sadevakā lokā samārakā sabrahmakā sassamaṇabrāhmaṇiyā pajāya sadevamanussāya nissaṭā visaṃyuttā vippamuttā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vippayuttā (ka.)]"
      },
      " vimariyādīkatena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vimariyādikatena (sī. pī. ka.)]"
      },
      " cetasā vihariṃsu. Yato ca kho, bhikkhave, sattā lokassa ",
      " assādañca assādato ādīnavañca ādīnavato nissaraṇañca nissaraṇato yathābhūtaṃ abbhaññāsuṃ, atha, bhikkhave, sattā sadevakā lokā samārakā sabrahmakā sassamaṇabrāhmaṇiyā pajāya sadevamanussāya nissaṭā visaṃyuttā vippamuttā vimariyādīkatena cetasā viharantī’’ti. Tatiyaṃ."
    ],
    "innerText": "106. ‘‘No cedaṃ [no cetaṃ (syā. kaṃ. pī. ka.) saṃ. ni. 3.28 passitabbaṃ], bhikkhave, loke assādo abhavissa, nayidaṃ sattā loke sārajjeyyuṃ. Yasmā ca kho, bhikkhave, atthi loke assādo, tasmā sattā loke sārajjanti. No cedaṃ, bhikkhave, loke ādīnavo abhavissa, nayidaṃ sattā loke nibbindeyyuṃ. Yasmā ca kho, bhikkhave, atthi loke ādīnavo, tasmā sattā loke nibbindanti. No cedaṃ, bhikkhave, loke nissaraṇaṃ abhavissa, nayidaṃ sattā lokamhā [loke (ka.)] nissareyyuṃ. Yasmā ca kho, bhikkhave, atthi loke nissaraṇaṃ, tasmā sattā lokamhā nissaranti. Yāvakīvañca, bhikkhave, sattā lokassa assādañca assādato ādīnavañca ādīnavato nissaraṇañca nissaraṇato yathābhūtaṃ nābbhaññāsuṃ [nābbhaññaṃsu (saṃ. ni. 3.28], neva tāva, bhikkhave, sattā sadevakā lokā samārakā sabrahmakā sassamaṇabrāhmaṇiyā pajāya sadevamanussāya nissaṭā visaṃyuttā vippamuttā [vippayuttā (ka.)] vimariyādīkatena [vimariyādikatena (sī. pī. ka.)] cetasā vihariṃsu. Yato ca kho, bhikkhave, sattā lokassa assādañca assādato ādīnavañca ādīnavato nissaraṇañca nissaraṇato yathābhūtaṃ abbhaññāsuṃ, atha, bhikkhave, sattā sadevakā lokā samārakā sabrahmakā sassamaṇabrāhmaṇiyā pajāya sadevamanussāya nissaṭā visaṃyuttā vippamuttā vimariyādīkatena cetasā viharantī’’ti. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Samaṇabrāhmaṇasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "107"
      },
      ". ‘‘Ye ",
      " keci, bhikkhave, samaṇā vā brāhmaṇā vā lokassa assādañca assādato ādīnavañca ādīnavato nissaraṇañca nissaraṇato yathābhūtaṃ nappajānanti, na me te ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[na te (ka.)]"
      },
      ", bhikkhave, samaṇā vā brāhmaṇā vā samaṇesu vā samaṇasammatā brāhmaṇesu vā brāhmaṇasammatā, na ca pana te āyasmanto sāmaññatthaṃ vā brahmaññatthaṃ vā diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharanti. Ye ca kho keci ",
      ", bhikkhave, samaṇā vā brāhmaṇā vā lokassa assādañca assādato ādīnavañca ādīnavato nissaraṇañca nissaraṇato yathābhūtaṃ pajānanti, te kho, bhikkhave, samaṇā vā brāhmaṇā vā samaṇesu vā samaṇasammatā brāhmaṇesu vā brāhmaṇasammatā, te ca panāyasmanto sāmaññatthañca brahmaññatthañca diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharantī’’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[viharissanti (sī. pī.)]"
      },
      ". Catutthaṃ."
    ],
    "innerText": "107. ‘‘Ye keci, bhikkhave, samaṇā vā brāhmaṇā vā lokassa assādañca assādato ādīnavañca ādīnavato nissaraṇañca nissaraṇato yathābhūtaṃ nappajānanti, na me te [na te (ka.)], bhikkhave, samaṇā vā brāhmaṇā vā samaṇesu vā samaṇasammatā brāhmaṇesu vā brāhmaṇasammatā, na ca pana te āyasmanto sāmaññatthaṃ vā brahmaññatthaṃ vā diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharanti. Ye ca kho keci , bhikkhave, samaṇā vā brāhmaṇā vā lokassa assādañca assādato ādīnavañca ādīnavato nissaraṇañca nissaraṇato yathābhūtaṃ pajānanti, te kho, bhikkhave, samaṇā vā brāhmaṇā vā samaṇesu vā samaṇasammatā brāhmaṇesu vā brāhmaṇasammatā, te ca panāyasmanto sāmaññatthañca brahmaññatthañca diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharantī’’ti [viharissanti (sī. pī.)]. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Ruṇṇasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "108"
      },
      ". ‘‘Ruṇṇamidaṃ ",
      ", bhikkhave, ariyassa vinaye yadidaṃ gītaṃ. Ummattakamidaṃ, bhikkhave, ariyassa vinaye yadidaṃ naccaṃ. Komārakamidaṃ, bhikkhave, ariyassa vinaye yadidaṃ ativelaṃ dantavidaṃsakahasitaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[dantavidaṃsakaṃ hasitaṃ (sī. pī.)]"
      },
      ". Tasmātiha, bhikkhave, setughāto gīte, setughāto nacce, alaṃ vo dhammappamoditānaṃ sataṃ sitaṃ sitamattāyā’’ti. Pañcamaṃ."
    ],
    "innerText": "108. ‘‘Ruṇṇamidaṃ , bhikkhave, ariyassa vinaye yadidaṃ gītaṃ. Ummattakamidaṃ, bhikkhave, ariyassa vinaye yadidaṃ naccaṃ. Komārakamidaṃ, bhikkhave, ariyassa vinaye yadidaṃ ativelaṃ dantavidaṃsakahasitaṃ [dantavidaṃsakaṃ hasitaṃ (sī. pī.)]. Tasmātiha, bhikkhave, setughāto gīte, setughāto nacce, alaṃ vo dhammappamoditānaṃ sataṃ sitaṃ sitamattāyā’’ti. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Atittisuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "109"
      },
      ". ‘‘Tiṇṇaṃ, bhikkhave, paṭisevanāya natthi titti. Katamesaṃ tiṇṇaṃ? Soppassa, bhikkhave, paṭisevanāya natthi titti. Surāmerayapānassa, bhikkhave, paṭisevanāya ",
      " natthi titti. Methunadhammasamāpattiyā, bhikkhave, paṭisevanāya natthi titti. Imesaṃ, bhikkhave, tiṇṇaṃ paṭisevanāya natthi tittī’’ti. Chaṭṭhaṃ."
    ],
    "innerText": "109. ‘‘Tiṇṇaṃ, bhikkhave, paṭisevanāya natthi titti. Katamesaṃ tiṇṇaṃ? Soppassa, bhikkhave, paṭisevanāya natthi titti. Surāmerayapānassa, bhikkhave, paṭisevanāya natthi titti. Methunadhammasamāpattiyā, bhikkhave, paṭisevanāya natthi titti. Imesaṃ, bhikkhave, tiṇṇaṃ paṭisevanāya natthi tittī’’ti. Chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Arakkhitasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "110"
      },
      ". Atha ",
      " kho anāthapiṇḍiko gahapati yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho anāthapiṇḍikaṃ gahapatiṃ bhagavā etadavoca – ‘‘citte, gahapati, arakkhite kāyakammampi arakkhitaṃ hoti, vacīkammampi arakkhitaṃ hoti ",
      ", manokammampi arakkhitaṃ hoti. Tassa arakkhitakāyakammantassa arakkhitavacīkammantassa arakkhitamanokammantassa kāyakammampi avassutaṃ hoti, vacīkammampi avassutaṃ hoti, manokammampi avassutaṃ hoti. Tassa avassutakāyakammantassa avassutavacīkammantassa avassutamanokammantassa kāyakammampi pūtikaṃ hoti, vacīkammampi pūtikaṃ hoti, manokammampi pūtikaṃ hoti. Tassa pūtikāyakammantassa pūtivacīkammantassa pūtimanokammantassa na bhaddakaṃ maraṇaṃ hoti, na bhaddikā kālaṅkiriyā."
    ],
    "innerText": "110. Atha kho anāthapiṇḍiko gahapati yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho anāthapiṇḍikaṃ gahapatiṃ bhagavā etadavoca – ‘‘citte, gahapati, arakkhite kāyakammampi arakkhitaṃ hoti, vacīkammampi arakkhitaṃ hoti , manokammampi arakkhitaṃ hoti. Tassa arakkhitakāyakammantassa arakkhitavacīkammantassa arakkhitamanokammantassa kāyakammampi avassutaṃ hoti, vacīkammampi avassutaṃ hoti, manokammampi avassutaṃ hoti. Tassa avassutakāyakammantassa avassutavacīkammantassa avassutamanokammantassa kāyakammampi pūtikaṃ hoti, vacīkammampi pūtikaṃ hoti, manokammampi pūtikaṃ hoti. Tassa pūtikāyakammantassa pūtivacīkammantassa pūtimanokammantassa na bhaddakaṃ maraṇaṃ hoti, na bhaddikā kālaṅkiriyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Seyyathāpi, gahapati, kūṭāgāre ducchanne kūṭampi arakkhitaṃ hoti, gopānasiyopi arakkhitā honti, bhittipi arakkhitā hoti; kūṭampi avassutaṃ hoti, gopānasiyopi avassutā honti, bhittipi avassutā hoti; kūṭampi pūtikaṃ hoti, gopānasiyopi pūtikā honti, bhittipi pūtikā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evamevaṃ kho, gahapati, citte ",
      " arakkhite kāyakammampi arakkhitaṃ hoti, vacīkammampi arakkhitaṃ hoti, manokammampi arakkhitaṃ hoti. Tassa arakkhitakāyakammantassa arakkhitavacīkammantassa arakkhitamanokammantassa kāyakammampi avassutaṃ hoti, vacīkammampi avassutaṃ hoti, manokammampi avassutaṃ hoti. Tassa avassutakāyakammantassa avassutavacīkammantassa avassutamanokammantassa kāyakammampi pūtikaṃ hoti, vacīkammampi pūtikaṃ hoti, manokammampi pūtikaṃ hoti. Tassa pūtikāyakammantassa pūtivacīkammantassa pūtimanokammantassa na bhaddakaṃ maraṇaṃ hoti, na bhaddikā kālaṅkiriyā."
    ],
    "innerText": "‘‘Evamevaṃ kho, gahapati, citte arakkhite kāyakammampi arakkhitaṃ hoti, vacīkammampi arakkhitaṃ hoti, manokammampi arakkhitaṃ hoti. Tassa arakkhitakāyakammantassa arakkhitavacīkammantassa arakkhitamanokammantassa kāyakammampi avassutaṃ hoti, vacīkammampi avassutaṃ hoti, manokammampi avassutaṃ hoti. Tassa avassutakāyakammantassa avassutavacīkammantassa avassutamanokammantassa kāyakammampi pūtikaṃ hoti, vacīkammampi pūtikaṃ hoti, manokammampi pūtikaṃ hoti. Tassa pūtikāyakammantassa pūtivacīkammantassa pūtimanokammantassa na bhaddakaṃ maraṇaṃ hoti, na bhaddikā kālaṅkiriyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Citte ",
      ", gahapati, rakkhite kāyakammampi rakkhitaṃ hoti, vacīkammampi rakkhitaṃ hoti, manokammampi rakkhitaṃ hoti. Tassa rakkhitakāyakammantassa rakkhitavacīkammantassa rakkhitamanokammantassa kāyakammampi anavassutaṃ hoti, vacīkammampi anavassutaṃ hoti, manokammampi anavassutaṃ ",
      " hoti. Tassa anavassutakāyakammantassa anavassutavacīkammantassa anavassutamanokammantassa kāyakammampi apūtikaṃ hoti, vacīkammampi apūtikaṃ hoti, manokammampi apūtikaṃ hoti. Tassa apūtikāyakammantassa apūtivacīkammantassa apūtimanokammantassa bhaddakaṃ maraṇaṃ hoti, bhaddikā kālaṅkiriyā."
    ],
    "innerText": "‘‘Citte , gahapati, rakkhite kāyakammampi rakkhitaṃ hoti, vacīkammampi rakkhitaṃ hoti, manokammampi rakkhitaṃ hoti. Tassa rakkhitakāyakammantassa rakkhitavacīkammantassa rakkhitamanokammantassa kāyakammampi anavassutaṃ hoti, vacīkammampi anavassutaṃ hoti, manokammampi anavassutaṃ hoti. Tassa anavassutakāyakammantassa anavassutavacīkammantassa anavassutamanokammantassa kāyakammampi apūtikaṃ hoti, vacīkammampi apūtikaṃ hoti, manokammampi apūtikaṃ hoti. Tassa apūtikāyakammantassa apūtivacīkammantassa apūtimanokammantassa bhaddakaṃ maraṇaṃ hoti, bhaddikā kālaṅkiriyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, gahapati ",
      ", kūṭāgāre succhanne kūṭampi rakkhitaṃ hoti, gopānasiyopi rakkhitā honti, bhittipi rakkhitā hoti; kūṭampi anavassutaṃ hoti, gopānasiyopi anavassutā honti, bhittipi anavassutā hoti; kūṭampi apūtikaṃ hoti, gopānasiyopi apūtikā honti, bhittipi apūtikā hoti."
    ],
    "innerText": "‘‘Seyyathāpi, gahapati , kūṭāgāre succhanne kūṭampi rakkhitaṃ hoti, gopānasiyopi rakkhitā honti, bhittipi rakkhitā hoti; kūṭampi anavassutaṃ hoti, gopānasiyopi anavassutā honti, bhittipi anavassutā hoti; kūṭampi apūtikaṃ hoti, gopānasiyopi apūtikā honti, bhittipi apūtikā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evamevaṃ kho, gahapati, citte rakkhite kāyakammampi rakkhitaṃ hoti, vacīkammampi rakkhitaṃ hoti, manokammampi rakkhitaṃ hoti. Tassa rakkhitakāyakammantassa rakkhitavacīkammantassa rakkhitamanokammantassa kāyakammampi anavassutaṃ hoti, vacīkammampi anavassutaṃ hoti, manokammampi anavassutaṃ hoti. Tassa anavassutakāyakammantassa anavassutavacīkammantassa anavassutamanokammantassa kāyakammampi apūtikaṃ hoti, vacīkammampi apūtikaṃ hoti, manokammampi apūtikaṃ hoti. Tassa apūtikāyakammantassa apūtivacīkammantassa apūtimanokammantassa bhaddakaṃ maraṇaṃ hoti, bhaddikā kālaṅkiriyā’’ti. Sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Byāpannasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "111"
      },
      ". Ekamantaṃ nisinnaṃ kho anāthapiṇḍikaṃ gahapatiṃ bhagavā etadavoca – ‘‘citte, gahapati, byāpanne kāyakammampi byāpannaṃ hoti, vacīkammampi byāpannaṃ hoti, manokammampi byāpannaṃ hoti. Tassa byāpannakāyakammantassa byāpannavacīkammantassa byāpannamanokammantassa na bhaddakaṃ maraṇaṃ hoti, na bhaddikā kālaṅkiriyā. Seyyathāpi, gahapati, kūṭāgāre ducchanne kūṭampi byāpannaṃ hoti, gopānasiyopi byāpannā honti, bhittipi byāpannā ",
      " hoti; evamevaṃ kho, gahapati, citte byāpanne kāyakammampi byāpannaṃ hoti, vacīkammampi byāpannaṃ hoti, manokammampi byāpannaṃ hoti. Tassa byāpannakāyakammantassa byāpannavacīkammantassa byāpannamanokammantassa na bhaddakaṃ maraṇaṃ hoti, na bhaddikā kālaṅkiriyā."
    ],
    "innerText": "111. Ekamantaṃ nisinnaṃ kho anāthapiṇḍikaṃ gahapatiṃ bhagavā etadavoca – ‘‘citte, gahapati, byāpanne kāyakammampi byāpannaṃ hoti, vacīkammampi byāpannaṃ hoti, manokammampi byāpannaṃ hoti. Tassa byāpannakāyakammantassa byāpannavacīkammantassa byāpannamanokammantassa na bhaddakaṃ maraṇaṃ hoti, na bhaddikā kālaṅkiriyā. Seyyathāpi, gahapati, kūṭāgāre ducchanne kūṭampi byāpannaṃ hoti, gopānasiyopi byāpannā honti, bhittipi byāpannā hoti; evamevaṃ kho, gahapati, citte byāpanne kāyakammampi byāpannaṃ hoti, vacīkammampi byāpannaṃ hoti, manokammampi byāpannaṃ hoti. Tassa byāpannakāyakammantassa byāpannavacīkammantassa byāpannamanokammantassa na bhaddakaṃ maraṇaṃ hoti, na bhaddikā kālaṅkiriyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Citte ",
      ", gahapati, abyāpanne kāyakammampi abyāpannaṃ hoti, vacīkammampi abyāpannaṃ hoti, manokammampi abyāpannaṃ hoti. Tassa abyāpannakāyakammantassa abyāpannavacīkammantassa abyāpannamanokammantassa bhaddakaṃ maraṇaṃ hoti, bhaddikā kālaṅkiriyā. Seyyathāpi, gahapati, kūṭāgāre succhanne kūṭampi abyāpannaṃ hoti, gopānasiyopi ",
      " abyāpannā honti, bhittipi abyāpannā hoti; evamevaṃ kho, gahapati, citte abyāpanne kāyakammampi abyāpannaṃ hoti, vacīkammampi abyāpannaṃ hoti, manokammampi abyāpannaṃ hoti. Tassa abyāpannakāyakammantassa…pe… abyāpannamanokammantassa bhaddakaṃ maraṇaṃ hoti, bhaddikā ",
      " kālaṅkiriyā’’ti. Aṭṭhamaṃ."
    ],
    "innerText": "‘‘Citte , gahapati, abyāpanne kāyakammampi abyāpannaṃ hoti, vacīkammampi abyāpannaṃ hoti, manokammampi abyāpannaṃ hoti. Tassa abyāpannakāyakammantassa abyāpannavacīkammantassa abyāpannamanokammantassa bhaddakaṃ maraṇaṃ hoti, bhaddikā kālaṅkiriyā. Seyyathāpi, gahapati, kūṭāgāre succhanne kūṭampi abyāpannaṃ hoti, gopānasiyopi abyāpannā honti, bhittipi abyāpannā hoti; evamevaṃ kho, gahapati, citte abyāpanne kāyakammampi abyāpannaṃ hoti, vacīkammampi abyāpannaṃ hoti, manokammampi abyāpannaṃ hoti. Tassa abyāpannakāyakammantassa…pe… abyāpannamanokammantassa bhaddakaṃ maraṇaṃ hoti, bhaddikā kālaṅkiriyā’’ti. Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Paṭhamanidānasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "112"
      },
      ". ‘‘Tīṇimāni, bhikkhave, nidānāni kammānaṃ samudayāya. Katamāni tīṇi? Lobho nidānaṃ kammānaṃ samudayāya, doso nidānaṃ kammānaṃ samudayāya, moho nidānaṃ kammānaṃ samudayāya. Yaṃ, bhikkhave, lobhapakataṃ kammaṃ lobhajaṃ lobhanidānaṃ lobhasamudayaṃ, taṃ kammaṃ akusalaṃ taṃ kammaṃ sāvajjaṃ taṃ kammaṃ dukkhavipākaṃ, taṃ kammaṃ kammasamudayāya saṃvattati, na taṃ kammaṃ kammanirodhāya saṃvattati. Yaṃ, bhikkhave, dosapakataṃ kammaṃ dosajaṃ dosanidānaṃ dosasamudayaṃ, taṃ kammaṃ akusalaṃ taṃ kammaṃ sāvajjaṃ taṃ kammaṃ dukkhavipākaṃ, taṃ kammaṃ kammasamudayāya saṃvattati, na taṃ kammaṃ kammanirodhāya saṃvattati. Yaṃ, bhikkhave, mohapakataṃ kammaṃ mohajaṃ mohanidānaṃ mohasamudayaṃ, taṃ kammaṃ akusalaṃ taṃ kammaṃ sāvajjaṃ taṃ kammaṃ dukkhavipākaṃ, taṃ kammaṃ kammasamudayāya saṃvattati, na taṃ kammaṃ kammanirodhāya saṃvattati. Imāni kho, bhikkhave, tīṇi nidānāni kammānaṃ samudayāya."
    ],
    "innerText": "112. ‘‘Tīṇimāni, bhikkhave, nidānāni kammānaṃ samudayāya. Katamāni tīṇi? Lobho nidānaṃ kammānaṃ samudayāya, doso nidānaṃ kammānaṃ samudayāya, moho nidānaṃ kammānaṃ samudayāya. Yaṃ, bhikkhave, lobhapakataṃ kammaṃ lobhajaṃ lobhanidānaṃ lobhasamudayaṃ, taṃ kammaṃ akusalaṃ taṃ kammaṃ sāvajjaṃ taṃ kammaṃ dukkhavipākaṃ, taṃ kammaṃ kammasamudayāya saṃvattati, na taṃ kammaṃ kammanirodhāya saṃvattati. Yaṃ, bhikkhave, dosapakataṃ kammaṃ dosajaṃ dosanidānaṃ dosasamudayaṃ, taṃ kammaṃ akusalaṃ taṃ kammaṃ sāvajjaṃ taṃ kammaṃ dukkhavipākaṃ, taṃ kammaṃ kammasamudayāya saṃvattati, na taṃ kammaṃ kammanirodhāya saṃvattati. Yaṃ, bhikkhave, mohapakataṃ kammaṃ mohajaṃ mohanidānaṃ mohasamudayaṃ, taṃ kammaṃ akusalaṃ taṃ kammaṃ sāvajjaṃ taṃ kammaṃ dukkhavipākaṃ, taṃ kammaṃ kammasamudayāya saṃvattati, na taṃ kammaṃ kammanirodhāya saṃvattati. Imāni kho, bhikkhave, tīṇi nidānāni kammānaṃ samudayāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tīṇimāni, bhikkhave, nidānāni kammānaṃ samudayāya. Katamāni tīṇi? Alobho nidānaṃ kammānaṃ samudayāya, adoso nidānaṃ kammānaṃ samudayāya, amoho nidānaṃ kammānaṃ samudayāya. Yaṃ, bhikkhave, alobhapakataṃ kammaṃ alobhajaṃ alobhanidānaṃ alobhasamudayaṃ, taṃ ",
      " kammaṃ kusalaṃ taṃ ",
      " kammaṃ anavajjaṃ taṃ kammaṃ sukhavipākaṃ, taṃ kammaṃ kammanirodhāya saṃvattati, na taṃ kammaṃ kammasamudayāya saṃvattati. Yaṃ, bhikkhave, adosapakataṃ kammaṃ adosajaṃ adosanidānaṃ adosasamudayaṃ, taṃ kammaṃ kusalaṃ taṃ kammaṃ anavajjaṃ taṃ kammaṃ sukhavipākaṃ, taṃ ",
      " kammaṃ kammanirodhāya saṃvattati, na taṃ kammaṃ kammasamudayāya saṃvattati. Yaṃ, bhikkhave, amohapakataṃ kammaṃ amohajaṃ amohanidānaṃ amohasamudayaṃ, taṃ kammaṃ kusalaṃ taṃ kammaṃ anavajjaṃ taṃ kammaṃ sukhavipākaṃ, taṃ kammaṃ kammanirodhāya saṃvattati, na taṃ kammaṃ kammasamudayāya saṃvattati. Imāni kho, bhikkhave, tīṇi nidānāni kammānaṃ samudayāyā’’ti. Navamaṃ."
    ],
    "innerText": "‘‘Tīṇimāni, bhikkhave, nidānāni kammānaṃ samudayāya. Katamāni tīṇi? Alobho nidānaṃ kammānaṃ samudayāya, adoso nidānaṃ kammānaṃ samudayāya, amoho nidānaṃ kammānaṃ samudayāya. Yaṃ, bhikkhave, alobhapakataṃ kammaṃ alobhajaṃ alobhanidānaṃ alobhasamudayaṃ, taṃ kammaṃ kusalaṃ taṃ kammaṃ anavajjaṃ taṃ kammaṃ sukhavipākaṃ, taṃ kammaṃ kammanirodhāya saṃvattati, na taṃ kammaṃ kammasamudayāya saṃvattati. Yaṃ, bhikkhave, adosapakataṃ kammaṃ adosajaṃ adosanidānaṃ adosasamudayaṃ, taṃ kammaṃ kusalaṃ taṃ kammaṃ anavajjaṃ taṃ kammaṃ sukhavipākaṃ, taṃ kammaṃ kammanirodhāya saṃvattati, na taṃ kammaṃ kammasamudayāya saṃvattati. Yaṃ, bhikkhave, amohapakataṃ kammaṃ amohajaṃ amohanidānaṃ amohasamudayaṃ, taṃ kammaṃ kusalaṃ taṃ kammaṃ anavajjaṃ taṃ kammaṃ sukhavipākaṃ, taṃ kammaṃ kammanirodhāya saṃvattati, na taṃ kammaṃ kammasamudayāya saṃvattati. Imāni kho, bhikkhave, tīṇi nidānāni kammānaṃ samudayāyā’’ti. Navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Dutiyanidānasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "113"
      },
      ". ‘‘Tīṇimāni ",
      ", bhikkhave, nidānāni kammānaṃ samudayāya. Katamāni tīṇi? Atīte, bhikkhave, chandarāgaṭṭhāniye dhamme ārabbha chando jāyati; anāgate, bhikkhave, chandarāgaṭṭhāniye dhamme ārabbha chando jāyati; paccuppanne, bhikkhave, chandarāgaṭṭhāniye dhamme ārabbha chando jāyati. Kathañca, bhikkhave, atīte chandarāgaṭṭhāniye dhamme ārabbha chando jāyati? Atīte, bhikkhave, chandarāgaṭṭhāniye dhamme ārabbha cetasā anuvitakketi anuvicāreti. Tassa atīte chandarāgaṭṭhāniye dhamme ārabbha cetasā anuvitakkayato anuvicārayato chando jāyati. Chandajāto tehi dhammehi saṃyutto hoti. Etamahaṃ, bhikkhave, saṃyojanaṃ vadāmi yo cetaso sārāgo. Evaṃ kho, bhikkhave, atīte chandarāgaṭṭhāniye dhamme ārabbha chando jāyati."
    ],
    "innerText": "113. ‘‘Tīṇimāni , bhikkhave, nidānāni kammānaṃ samudayāya. Katamāni tīṇi? Atīte, bhikkhave, chandarāgaṭṭhāniye dhamme ārabbha chando jāyati; anāgate, bhikkhave, chandarāgaṭṭhāniye dhamme ārabbha chando jāyati; paccuppanne, bhikkhave, chandarāgaṭṭhāniye dhamme ārabbha chando jāyati. Kathañca, bhikkhave, atīte chandarāgaṭṭhāniye dhamme ārabbha chando jāyati? Atīte, bhikkhave, chandarāgaṭṭhāniye dhamme ārabbha cetasā anuvitakketi anuvicāreti. Tassa atīte chandarāgaṭṭhāniye dhamme ārabbha cetasā anuvitakkayato anuvicārayato chando jāyati. Chandajāto tehi dhammehi saṃyutto hoti. Etamahaṃ, bhikkhave, saṃyojanaṃ vadāmi yo cetaso sārāgo. Evaṃ kho, bhikkhave, atīte chandarāgaṭṭhāniye dhamme ārabbha chando jāyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, anāgate chandarāgaṭṭhāniye ",
      " dhamme ārabbha chando jāyati? Anāgate, bhikkhave, chandarāgaṭṭhāniye dhamme ārabbha cetasā anuvitakketi anuvicāreti. Tassa anāgate chandarāgaṭṭhāniye dhamme ārabbha cetasā anuvitakkayato anuvicārayato chando jāyati. Chandajāto tehi dhammehi saṃyutto hoti. Etamahaṃ, bhikkhave, saṃyojanaṃ vadāmi yo cetaso sārāgo. Evaṃ kho, bhikkhave, anāgate chandarāgaṭṭhāniye dhamme ārabbha chando jāyati."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, anāgate chandarāgaṭṭhāniye dhamme ārabbha chando jāyati? Anāgate, bhikkhave, chandarāgaṭṭhāniye dhamme ārabbha cetasā anuvitakketi anuvicāreti. Tassa anāgate chandarāgaṭṭhāniye dhamme ārabbha cetasā anuvitakkayato anuvicārayato chando jāyati. Chandajāto tehi dhammehi saṃyutto hoti. Etamahaṃ, bhikkhave, saṃyojanaṃ vadāmi yo cetaso sārāgo. Evaṃ kho, bhikkhave, anāgate chandarāgaṭṭhāniye dhamme ārabbha chando jāyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, paccuppanne chandarāgaṭṭhāniye dhamme ārabbha chando jāyati? Paccuppanne, bhikkhave, chandarāgaṭṭhāniye dhamme ārabbha cetasā anuvitakketi ",
      " anuvicāreti. Tassa paccuppanne chandarāgaṭṭhāniye dhamme ārabbha cetasā anuvitakkayato anuvicārayato chando jāyati. Chandajāto tehi dhammehi saṃyutto hoti. Etamahaṃ, bhikkhave, saṃyojanaṃ vadāmi yo cetaso ",
      " sārāgo. Evaṃ kho, bhikkhave, paccuppanne chandarāgaṭṭhāniye dhamme ārabbha chando jāyati. Imāni kho, bhikkhave, tīṇi nidānāni kammānaṃ samudayāya."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, paccuppanne chandarāgaṭṭhāniye dhamme ārabbha chando jāyati? Paccuppanne, bhikkhave, chandarāgaṭṭhāniye dhamme ārabbha cetasā anuvitakketi anuvicāreti. Tassa paccuppanne chandarāgaṭṭhāniye dhamme ārabbha cetasā anuvitakkayato anuvicārayato chando jāyati. Chandajāto tehi dhammehi saṃyutto hoti. Etamahaṃ, bhikkhave, saṃyojanaṃ vadāmi yo cetaso sārāgo. Evaṃ kho, bhikkhave, paccuppanne chandarāgaṭṭhāniye dhamme ārabbha chando jāyati. Imāni kho, bhikkhave, tīṇi nidānāni kammānaṃ samudayāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tīṇimāni ",
      ", bhikkhave, nidānāni kammānaṃ samudayāya. Katamāni tīṇi? Atīte, bhikkhave, chandarāgaṭṭhāniye dhamme ārabbha chando na jāyati; anāgate bhikkhave, chandarāgaṭṭhāniye dhamme ārabbha chando na jāyati; paccuppanne, bhikkhave, chandarāgaṭṭhāniye dhamme ārabbha chando na jāyati. Kathañca, bhikkhave, atīte chandarāgaṭṭhāniye dhamme ārabbha chando na jāyati? Atītānaṃ, bhikkhave, chandarāgaṭṭhāniyānaṃ dhammānaṃ āyatiṃ vipākaṃ pajānāti. Āyatiṃ vipākaṃ viditvā tadabhinivatteti. Tadabhinivattetvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[tadabhinivajjeti, tadabhinivajjetvā (sī. syā. kaṃ.)]"
      },
      " cetasā abhinivijjhitvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[abhivirājetvā (sī. syā. kaṃ. pī.)]"
      },
      " paññāya ativijjha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[abhinivijjha (ka.)]"
      },
      " passati. Evaṃ kho, bhikkhave, atīte chandarāgaṭṭhāniye dhamme ārabbha chando na jāyati."
    ],
    "innerText": "‘‘Tīṇimāni , bhikkhave, nidānāni kammānaṃ samudayāya. Katamāni tīṇi? Atīte, bhikkhave, chandarāgaṭṭhāniye dhamme ārabbha chando na jāyati; anāgate bhikkhave, chandarāgaṭṭhāniye dhamme ārabbha chando na jāyati; paccuppanne, bhikkhave, chandarāgaṭṭhāniye dhamme ārabbha chando na jāyati. Kathañca, bhikkhave, atīte chandarāgaṭṭhāniye dhamme ārabbha chando na jāyati? Atītānaṃ, bhikkhave, chandarāgaṭṭhāniyānaṃ dhammānaṃ āyatiṃ vipākaṃ pajānāti. Āyatiṃ vipākaṃ viditvā tadabhinivatteti. Tadabhinivattetvā [tadabhinivajjeti, tadabhinivajjetvā (sī. syā. kaṃ.)] cetasā abhinivijjhitvā [abhivirājetvā (sī. syā. kaṃ. pī.)] paññāya ativijjha [abhinivijjha (ka.)] passati. Evaṃ kho, bhikkhave, atīte chandarāgaṭṭhāniye dhamme ārabbha chando na jāyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, anāgate chandarāgaṭṭhāniye dhamme ārabbha chando na jāyati? Anāgatānaṃ, bhikkhave, chandarāgaṭṭhāniyānaṃ dhammānaṃ āyatiṃ vipākaṃ pajānāti. Āyatiṃ vipākaṃ viditvā tadabhinivatteti. Tadabhinivattetvā cetasā abhinivijjhitvā paññāya ativijjha passati. Evaṃ kho, bhikkhave, anāgate chandarāgaṭṭhāniye dhamme ārabbha chando na jāyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, paccuppanne chandarāgaṭṭhāniye dhamme ārabbha chando na jāyati? Paccuppannānaṃ, bhikkhave, chandarāgaṭṭhāniyānaṃ dhammānaṃ āyatiṃ vipākaṃ pajānāti, āyatiṃ vipākaṃ ",
      " viditvā tadabhinivatteti, tadabhinivattetvā cetasā abhinivijjhitvā paññāya ativijjha passati. Evaṃ kho, bhikkhave, paccuppanne chandarāgaṭṭhāniye dhamme ārabbha chando na jāyati. Imāni kho, bhikkhave, tīṇi nidānāni kammānaṃ samudayāyā’’ti. Dasamaṃ."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, paccuppanne chandarāgaṭṭhāniye dhamme ārabbha chando na jāyati? Paccuppannānaṃ, bhikkhave, chandarāgaṭṭhāniyānaṃ dhammānaṃ āyatiṃ vipākaṃ pajānāti, āyatiṃ vipākaṃ viditvā tadabhinivatteti, tadabhinivattetvā cetasā abhinivijjhitvā paññāya ativijjha passati. Evaṃ kho, bhikkhave, paccuppanne chandarāgaṭṭhāniye dhamme ārabbha chando na jāyati. Imāni kho, bhikkhave, tīṇi nidānāni kammānaṃ samudayāyā’’ti. Dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sambodhavaggo paṭhamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Pubbeva ",
      " duve assādā, samaṇo ruṇṇapañcamaṃ;"
    ],
    "innerText": "Pubbeva duve assādā, samaṇo ruṇṇapañcamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Atitti dve ca vuttāni, nidānāni apare duveti."
  }
]