[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "2. Rathakāravaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Ñātasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "11"
      },
      ". ‘‘Tīhi ",
      ", bhikkhave, dhammehi samannāgato ñāto bhikkhu bahujanaahitāya paṭipanno hoti bahujanadukkhāya, bahuno janassa anatthāya ahitāya dukkhāya devamanussānaṃ. Katamehi tīhi? Ananulomike kāyakamme samādapeti, ananulomike vacīkamme samādapeti, ananulomikesu dhammesu samādapeti. Imehi kho, bhikkhave, tīhi dhammehi samannāgato ñāto bhikkhu bahujanaahitāya paṭipanno hoti bahujanadukkhāya, bahuno janassa ",
      " anatthāya ahitāya dukkhāya devamanussānaṃ."
    ],
    "innerText": "11. ‘‘Tīhi , bhikkhave, dhammehi samannāgato ñāto bhikkhu bahujanaahitāya paṭipanno hoti bahujanadukkhāya, bahuno janassa anatthāya ahitāya dukkhāya devamanussānaṃ. Katamehi tīhi? Ananulomike kāyakamme samādapeti, ananulomike vacīkamme samādapeti, ananulomikesu dhammesu samādapeti. Imehi kho, bhikkhave, tīhi dhammehi samannāgato ñāto bhikkhu bahujanaahitāya paṭipanno hoti bahujanadukkhāya, bahuno janassa anatthāya ahitāya dukkhāya devamanussānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tīhi, bhikkhave, dhammehi samannāgato ñāto bhikkhu bahujanahitāya paṭipanno hoti bahujanasukhāya, bahuno janassa atthāya hitāya sukhāya devamanussānaṃ. Katamehi tīhi? Anulomike kāyakamme samādapeti, anulomike vacīkamme samādapeti, anulomikesu dhammesu samādapeti. Imehi kho, bhikkhave, tīhi dhammehi samannāgato ñāto bhikkhu bahujanahitāya paṭipanno hoti bahujanasukhāya, bahuno janassa atthāya hitāya sukhāya devamanussāna’’nti. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Sāraṇīyasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "12"
      },
      ". ‘‘Tīṇimāni ",
      ", bhikkhave, rañño khattiyassa muddhāvasittassa yāvajīvaṃ sāraṇīyāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[saraṇīyāni (sī. syā. kaṃ. pī.)]"
      },
      " bhavanti. Katamāni tīṇi? Yasmiṃ, bhikkhave, padese rājā khattiyo muddhāvasitto jāto hoti. Idaṃ, bhikkhave, paṭhamaṃ rañño khattiyassa muddhāvasittassa yāvajīvaṃ sāraṇīyaṃ hoti."
    ],
    "innerText": "12. ‘‘Tīṇimāni , bhikkhave, rañño khattiyassa muddhāvasittassa yāvajīvaṃ sāraṇīyāni [saraṇīyāni (sī. syā. kaṃ. pī.)] bhavanti. Katamāni tīṇi? Yasmiṃ, bhikkhave, padese rājā khattiyo muddhāvasitto jāto hoti. Idaṃ, bhikkhave, paṭhamaṃ rañño khattiyassa muddhāvasittassa yāvajīvaṃ sāraṇīyaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna ",
      " caparaṃ, bhikkhave, yasmiṃ padese rājā khattiyo muddhāvasitto hoti. Idaṃ, bhikkhave, dutiyaṃ rañño khattiyassa muddhāvasittassa yāvajīvaṃ sāraṇīyaṃ hoti."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, yasmiṃ padese rājā khattiyo muddhāvasitto hoti. Idaṃ, bhikkhave, dutiyaṃ rañño khattiyassa muddhāvasittassa yāvajīvaṃ sāraṇīyaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, bhikkhave, yasmiṃ padese rājā khattiyo muddhāvasitto saṅgāmaṃ abhivijinitvā vijitasaṅgāmo tameva saṅgāmasīsaṃ ajjhāvasati. Idaṃ, bhikkhave, tatiyaṃ rañño khattiyassa muddhāvasittassa yāvajīvaṃ sāraṇīyaṃ hoti. Imāni kho, bhikkhave, tīṇi rañño khattiyassa muddhāvasittassa yāvajīvaṃ sāraṇīyāni bhavanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evamevaṃ ",
      " kho, bhikkhave, tīṇimāni bhikkhussa yāvajīvaṃ sāraṇīyāni bhavanti. Katamāni tīṇi? Yasmiṃ, bhikkhave, padese bhikkhu kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ ",
      " pabbajito hoti. Idaṃ, bhikkhave, paṭhamaṃ bhikkhussa yāvajīvaṃ sāraṇīyaṃ hoti."
    ],
    "innerText": "‘‘Evamevaṃ kho, bhikkhave, tīṇimāni bhikkhussa yāvajīvaṃ sāraṇīyāni bhavanti. Katamāni tīṇi? Yasmiṃ, bhikkhave, padese bhikkhu kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajito hoti. Idaṃ, bhikkhave, paṭhamaṃ bhikkhussa yāvajīvaṃ sāraṇīyaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, bhikkhave, yasmiṃ padese bhikkhu ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhasamudayo’ti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhanirodho’ti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti. Idaṃ, bhikkhave, dutiyaṃ bhikkhussa yāvajīvaṃ sāraṇīyaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, bhikkhave, yasmiṃ padese bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Idaṃ, bhikkhave, tatiyaṃ bhikkhussa yāvajīvaṃ sāraṇīyaṃ hoti. Imāni kho, bhikkhave, tīṇi bhikkhussa yāvajīvaṃ sāraṇīyāni bhavantī’’ti. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Āsaṃsasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "13"
      },
      ". ‘‘Tayome ",
      ", bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Nirāso, āsaṃso, vigatāso. Katamo ca, bhikkhave puggalo nirāso? Idha, bhikkhave, ekacco puggalo nīce kule paccājāto hoti, caṇḍālakule vā venakule ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[veṇakule (syā. kaṃ. pī.)]"
      },
      " vā nesādakule vā ",
      " rathakārakule vā pukkusakule vā dalidde appannapānabhojane kasiravuttike, yattha kasirena ghāsacchādo labbhati. So ca hoti dubbaṇṇo duddasiko okoṭimako bavhābādho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[bahvābādho (syā. kaṃ. pī. ka.)]"
      },
      " kāṇo vā kuṇī vā khañjo vā pakkhahato vā, na lābhī annassa pānassa vatthassa yānassa mālāgandhavilepanassa seyyāvasathapadīpeyyassa. So suṇāti – ‘itthannāmo kira khattiyo khattiyehi khattiyābhisekena abhisitto’ti. Tassa na evaṃ hoti – ‘kudāssu nāma mampi ",
      " khattiyā khattiyābhisekena abhisiñcissantī’ti! Ayaṃ vuccati, bhikkhave, puggalo nirāso."
    ],
    "innerText": "13. ‘‘Tayome , bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Nirāso, āsaṃso, vigatāso. Katamo ca, bhikkhave puggalo nirāso? Idha, bhikkhave, ekacco puggalo nīce kule paccājāto hoti, caṇḍālakule vā venakule [veṇakule (syā. kaṃ. pī.)] vā nesādakule vā rathakārakule vā pukkusakule vā dalidde appannapānabhojane kasiravuttike, yattha kasirena ghāsacchādo labbhati. So ca hoti dubbaṇṇo duddasiko okoṭimako bavhābādho [bahvābādho (syā. kaṃ. pī. ka.)] kāṇo vā kuṇī vā khañjo vā pakkhahato vā, na lābhī annassa pānassa vatthassa yānassa mālāgandhavilepanassa seyyāvasathapadīpeyyassa. So suṇāti – ‘itthannāmo kira khattiyo khattiyehi khattiyābhisekena abhisitto’ti. Tassa na evaṃ hoti – ‘kudāssu nāma mampi khattiyā khattiyābhisekena abhisiñcissantī’ti! Ayaṃ vuccati, bhikkhave, puggalo nirāso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamo ca, bhikkhave, puggalo āsaṃso? Idha ",
      ", bhikkhave, rañño khattiyassa muddhāvasittassa jeṭṭho putto hoti ābhiseko anabhisitto acalappatto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[macalappatto (sī. pī.)]"
      },
      ". So suṇāti – ‘itthannāmo kira khattiyo khattiyehi khattiyābhisekena abhisitto’ti. Tassa evaṃ hoti – ‘kudāssu nāma mampi khattiyā khattiyābhisekena abhisiñcissantī’ti! Ayaṃ vuccati, bhikkhave, puggalo āsaṃso."
    ],
    "innerText": "‘‘Katamo ca, bhikkhave, puggalo āsaṃso? Idha , bhikkhave, rañño khattiyassa muddhāvasittassa jeṭṭho putto hoti ābhiseko anabhisitto acalappatto [macalappatto (sī. pī.)]. So suṇāti – ‘itthannāmo kira khattiyo khattiyehi khattiyābhisekena abhisitto’ti. Tassa evaṃ hoti – ‘kudāssu nāma mampi khattiyā khattiyābhisekena abhisiñcissantī’ti! Ayaṃ vuccati, bhikkhave, puggalo āsaṃso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamo ca, bhikkhave, puggalo vigatāso? Idha, bhikkhave, rājā hoti khattiyo muddhāvasitto. So suṇāti – ‘itthannāmo kira khattiyo khattiyehi khattiyābhisekena abhisitto’ti. Tassa na evaṃ hoti – ‘kudāssu nāma mampi khattiyā khattiyābhisekena abhisiñcissantī’ti! Taṃ kissa hetu? Yā hissa, bhikkhave, pubbe anabhisittassa abhisekāsā sā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sāssa (sī. syā. kaṃ. pī.)]"
      },
      " paṭippassaddhā. Ayaṃ vuccati, bhikkhave, puggalo vigatāso. Ime kho, bhikkhave, tayo puggalā santo saṃvijjamānā lokasmiṃ."
    ],
    "innerText": "‘‘Katamo ca, bhikkhave, puggalo vigatāso? Idha, bhikkhave, rājā hoti khattiyo muddhāvasitto. So suṇāti – ‘itthannāmo kira khattiyo khattiyehi khattiyābhisekena abhisitto’ti. Tassa na evaṃ hoti – ‘kudāssu nāma mampi khattiyā khattiyābhisekena abhisiñcissantī’ti! Taṃ kissa hetu? Yā hissa, bhikkhave, pubbe anabhisittassa abhisekāsā sā [sāssa (sī. syā. kaṃ. pī.)] paṭippassaddhā. Ayaṃ vuccati, bhikkhave, puggalo vigatāso. Ime kho, bhikkhave, tayo puggalā santo saṃvijjamānā lokasmiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evamevaṃ ",
      " kho, bhikkhave, tayo puggalā santo saṃvijjamānā bhikkhūsu. Katame tayo? Nirāso, āsaṃso, vigatāso. Katamo ca, bhikkhave, puggalo nirāso? Idha, bhikkhave, ekacco puggalo dussīlo hoti pāpadhammo asuci saṅkassarasamācāro paṭicchannakammanto assamaṇo samaṇapaṭiñño abrahmacārī brahmacāripaṭiñño antopūti avassuto kasambujāto. So suṇāti – ‘itthannāmo kira bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ ",
      " diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’ti. Tassa na evaṃ hoti – ‘kudāssu nāma ahampi āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ ",
      " diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissāmī’ti! Ayaṃ vuccati, bhikkhave, puggalo nirāso."
    ],
    "innerText": "‘‘Evamevaṃ kho, bhikkhave, tayo puggalā santo saṃvijjamānā bhikkhūsu. Katame tayo? Nirāso, āsaṃso, vigatāso. Katamo ca, bhikkhave, puggalo nirāso? Idha, bhikkhave, ekacco puggalo dussīlo hoti pāpadhammo asuci saṅkassarasamācāro paṭicchannakammanto assamaṇo samaṇapaṭiñño abrahmacārī brahmacāripaṭiñño antopūti avassuto kasambujāto. So suṇāti – ‘itthannāmo kira bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’ti. Tassa na evaṃ hoti – ‘kudāssu nāma ahampi āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissāmī’ti! Ayaṃ vuccati, bhikkhave, puggalo nirāso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamo ca, bhikkhave, puggalo āsaṃso? Idha, bhikkhave, bhikkhu sīlavā hoti kalyāṇadhammo. So suṇāti ",
      " āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’ti. Tassa evaṃ hoti – ‘kudāssu nāma ahampi āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissāmī’ti! Ayaṃ vuccati, bhikkhave, puggalo āsaṃso."
    ],
    "innerText": "‘‘Katamo ca, bhikkhave, puggalo āsaṃso? Idha, bhikkhave, bhikkhu sīlavā hoti kalyāṇadhammo. So suṇāti āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’ti. Tassa evaṃ hoti – ‘kudāssu nāma ahampi āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissāmī’ti! Ayaṃ vuccati, bhikkhave, puggalo āsaṃso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamo ca, bhikkhave, puggalo vigatāso? Idha, bhikkhave, bhikkhu arahaṃ hoti khīṇāsavo. So suṇāti – ‘itthannāmo kira bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’ti. Tassa na evaṃ hoti – ‘kudāssu nāma ahampi āsavānaṃ khayā…pe… sacchikatvā upasampajja viharissāmī’ti! Taṃ kissa hetu? Yā hissa, bhikkhave, pubbe avimuttassa vimuttāsā sā paṭippassaddhā. Ayaṃ vuccati, bhikkhave, puggalo vigatāso. Ime kho, bhikkhave, tayo puggalā santo saṃvijjamānā bhikkhūsū’’ti. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Cakkavattisuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "14"
      },
      ". ‘‘Yopi ",
      " so, bhikkhave, rājā cakkavattī dhammiko dhammarājā sopi na arājakaṃ cakkaṃ vattetī’’ti. Evaṃ vutte aññataro bhikkhu bhagavantaṃ etadavoca ",
      " – ‘‘ko pana, bhante, rañño cakkavattissa dhammikassa dhammarañño rājā’’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[cakkanti (ka.)]"
      },
      "? ‘‘Dhammo, bhikkhū’’ti bhagavā avoca – ‘‘idha, bhikkhu, rājā cakkavattī dhammiko dhammarājā dhammaṃyeva nissāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[garukaronto (sī. syā. kaṃ. pī.)]"
      },
      " dhammaṃ sakkaronto dhammaṃ garuṃ karonto dhammaṃ apacāyamāno dhammaddhajo dhammaketu dhammādhipateyyo dhammikaṃ rakkhāvaraṇaguttiṃ saṃvidahati antojanasmiṃ’’."
    ],
    "innerText": "14. ‘‘Yopi so, bhikkhave, rājā cakkavattī dhammiko dhammarājā sopi na arājakaṃ cakkaṃ vattetī’’ti. Evaṃ vutte aññataro bhikkhu bhagavantaṃ etadavoca – ‘‘ko pana, bhante, rañño cakkavattissa dhammikassa dhammarañño rājā’’ti [cakkanti (ka.)]? ‘‘Dhammo, bhikkhū’’ti bhagavā avoca – ‘‘idha, bhikkhu, rājā cakkavattī dhammiko dhammarājā dhammaṃyeva nissāya [garukaronto (sī. syā. kaṃ. pī.)] dhammaṃ sakkaronto dhammaṃ garuṃ karonto dhammaṃ apacāyamāno dhammaddhajo dhammaketu dhammādhipateyyo dhammikaṃ rakkhāvaraṇaguttiṃ saṃvidahati antojanasmiṃ’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhikkhu, rājā cakkavattī dhammiko dhammarājā dhammaṃyeva nissāya dhammaṃ sakkaronto dhammaṃ garuṃ karonto dhammaṃ apacāyamāno dhammaddhajo dhammaketu dhammādhipateyyo dhammikaṃ ",
      " rakkhāvaraṇaguttiṃ saṃvidahati khattiyesu, anuyantesu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[anuyuttesu (sī. syā. kaṃ. pī.)]"
      },
      ", balakāyasmiṃ, brāhmaṇagahapatikesu ",
      ", negamajānapadesu, samaṇabrāhmaṇesu, migapakkhīsu. Sa kho so bhikkhu rājā cakkavattī dhammiko dhammarājā dhammaṃyeva nissāya dhammaṃ sakkaronto dhammaṃ garuṃ karonto dhammaṃ apacāyamāno dhammaddhajo dhammaketu dhammādhipateyyo dhammikaṃ rakkhāvaraṇaguttiṃ saṃvidahitvā antojanasmiṃ, dhammikaṃ rakkhāvaraṇaguttiṃ saṃvidahitvā khattiyesu, anuyantesu, balakāyasmiṃ, brāhmaṇagahapatikesu, negamajānapadesu, samaṇabrāhmaṇesu, migapakkhīsu, dhammeneva cakkaṃ vatteti. Taṃ hoti cakkaṃ appaṭivattiyaṃ kenaci manussabhūtena paccatthikena pāṇinā."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhu, rājā cakkavattī dhammiko dhammarājā dhammaṃyeva nissāya dhammaṃ sakkaronto dhammaṃ garuṃ karonto dhammaṃ apacāyamāno dhammaddhajo dhammaketu dhammādhipateyyo dhammikaṃ rakkhāvaraṇaguttiṃ saṃvidahati khattiyesu, anuyantesu [anuyuttesu (sī. syā. kaṃ. pī.)], balakāyasmiṃ, brāhmaṇagahapatikesu , negamajānapadesu, samaṇabrāhmaṇesu, migapakkhīsu. Sa kho so bhikkhu rājā cakkavattī dhammiko dhammarājā dhammaṃyeva nissāya dhammaṃ sakkaronto dhammaṃ garuṃ karonto dhammaṃ apacāyamāno dhammaddhajo dhammaketu dhammādhipateyyo dhammikaṃ rakkhāvaraṇaguttiṃ saṃvidahitvā antojanasmiṃ, dhammikaṃ rakkhāvaraṇaguttiṃ saṃvidahitvā khattiyesu, anuyantesu, balakāyasmiṃ, brāhmaṇagahapatikesu, negamajānapadesu, samaṇabrāhmaṇesu, migapakkhīsu, dhammeneva cakkaṃ vatteti. Taṃ hoti cakkaṃ appaṭivattiyaṃ kenaci manussabhūtena paccatthikena pāṇinā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evamevaṃ kho, bhikkhu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[bhikkhave (ka.)]"
      },
      ", tathāgato arahaṃ sammāsambuddho dhammiko dhammarājā dhammaṃyeva nissāya dhammaṃ sakkaronto dhammaṃ garuṃ karonto dhammaṃ apacāyamāno dhammaddhajo dhammaketu dhammādhipateyyo ",
      " dhammikaṃ rakkhāvaraṇaguttiṃ saṃvidahati kāyakammasmiṃ – ‘evarūpaṃ kāyakammaṃ sevitabbaṃ, evarūpaṃ kāyakammaṃ na sevitabba’’’nti."
    ],
    "innerText": "‘‘Evamevaṃ kho, bhikkhu [bhikkhave (ka.)], tathāgato arahaṃ sammāsambuddho dhammiko dhammarājā dhammaṃyeva nissāya dhammaṃ sakkaronto dhammaṃ garuṃ karonto dhammaṃ apacāyamāno dhammaddhajo dhammaketu dhammādhipateyyo dhammikaṃ rakkhāvaraṇaguttiṃ saṃvidahati kāyakammasmiṃ – ‘evarūpaṃ kāyakammaṃ sevitabbaṃ, evarūpaṃ kāyakammaṃ na sevitabba’’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, bhikkhu, tathāgato arahaṃ sammāsambuddho dhammiko dhammarājā dhammaṃyeva nissāya dhammaṃ sakkaronto dhammaṃ garuṃ karonto dhammaṃ apacāyamāno dhammaddhajo dhammaketu dhammādhipateyyo dhammikaṃ rakkhāvaraṇaguttiṃ saṃvidahati vacīkammasmiṃ – ‘evarūpaṃ vacīkammaṃ sevitabbaṃ, evarūpaṃ vacīkammaṃ na sevitabba’nti…pe… manokammasmiṃ – ‘evarūpaṃ manokammaṃ sevitabbaṃ, evarūpaṃ manokammaṃ na sevitabba’’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sa ",
      " kho so, bhikkhu, tathāgato arahaṃ sammāsambuddho dhammiko dhammarājā dhammaṃyeva nissāya dhammaṃ sakkaronto dhammaṃ garuṃ karonto dhammaṃ apacāyamāno dhammaddhajo dhammaketu dhammādhipateyyo dhammikaṃ rakkhāvaraṇaguttiṃ saṃvidahitvā kāyakammasmiṃ, dhammikaṃ rakkhāvaraṇaguttiṃ saṃvidahitvā vacīkammasmiṃ, dhammikaṃ rakkhāvaraṇaguttiṃ saṃvidahitvā manokammasmiṃ, dhammeneva anuttaraṃ dhammacakkaṃ pavatteti. Taṃ hoti cakkaṃ appaṭivattiyaṃ samaṇena vā brāhmaṇena vā devena vā mārena vā brahmunā vā kenaci vā lokasmi’’nti. Catutthaṃ."
    ],
    "innerText": "‘‘Sa kho so, bhikkhu, tathāgato arahaṃ sammāsambuddho dhammiko dhammarājā dhammaṃyeva nissāya dhammaṃ sakkaronto dhammaṃ garuṃ karonto dhammaṃ apacāyamāno dhammaddhajo dhammaketu dhammādhipateyyo dhammikaṃ rakkhāvaraṇaguttiṃ saṃvidahitvā kāyakammasmiṃ, dhammikaṃ rakkhāvaraṇaguttiṃ saṃvidahitvā vacīkammasmiṃ, dhammikaṃ rakkhāvaraṇaguttiṃ saṃvidahitvā manokammasmiṃ, dhammeneva anuttaraṃ dhammacakkaṃ pavatteti. Taṃ hoti cakkaṃ appaṭivattiyaṃ samaṇena vā brāhmaṇena vā devena vā mārena vā brahmunā vā kenaci vā lokasmi’’nti. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Sacetanasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "15"
      },
      ". Ekaṃ ",
      " samayaṃ bhagavā bārāṇasiyaṃ viharati isipatane migadāye. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti ",
      " te ",
      " bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –"
    ],
    "innerText": "15. Ekaṃ samayaṃ bhagavā bārāṇasiyaṃ viharati isipatane migadāye. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Bhūtapubbaṃ, bhikkhave, rājā ahosi sacetano ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pacetano (sī. syā. kaṃ. pī.)]"
      },
      " nāma. Atha kho, bhikkhave, rājā sacetano rathakāraṃ āmantesi – ‘ito me, samma rathakāra, channaṃ māsānaṃ accayena saṅgāmo bhavissati. Sakkhissasi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sakkhasi (syā. kaṃ. pī.)]"
      },
      " me, samma rathakāra, navaṃ cakkayugaṃ kātu’nti? ‘Sakkomi devā’ti kho, bhikkhave, rathakāro rañño sacetanassa paccassosi. Atha kho, bhikkhave, rathakāro chahi māsehi chārattūnehi ekaṃ cakkaṃ niṭṭhāpesi. Atha kho, bhikkhave, rājā sacetano rathakāraṃ āmantesi – ‘ito me, samma rathakāra, channaṃ divasānaṃ accayena saṅgāmo bhavissati, niṭṭhitaṃ navaṃ cakkayuga’nti? ‘Imehi kho, deva, chahi māsehi chārattūnehi ekaṃ cakkaṃ niṭṭhita’nti. ‘Sakkhissasi pana me, samma rathakāra, imehi chahi divasehi dutiyaṃ cakkaṃ niṭṭhāpetu’nti? ‘Sakkomi devā’ti kho, bhikkhave, rathakāro chahi divasehi dutiyaṃ cakkaṃ niṭṭhāpetvā navaṃ cakkayugaṃ ādāya yena rājā sacetano tenupasaṅkami; upasaṅkamitvā rājānaṃ sacetanaṃ etadavoca – ‘idaṃ te, deva, navaṃ cakkayugaṃ niṭṭhita’nti. ‘Yañca te idaṃ, samma rathakāra, cakkaṃ chahi māsehi niṭṭhitaṃ chārattūnehi yañca te idaṃ cakkaṃ chahi divasehi niṭṭhitaṃ, imesaṃ kiṃ nānākaraṇaṃ? Nesāhaṃ kiñci nānākaraṇaṃ passāmī’ti. ‘Atthesaṃ, deva, nānākaraṇaṃ. Passatu devo nānākaraṇa’’’nti."
    ],
    "innerText": "‘‘Bhūtapubbaṃ, bhikkhave, rājā ahosi sacetano [pacetano (sī. syā. kaṃ. pī.)] nāma. Atha kho, bhikkhave, rājā sacetano rathakāraṃ āmantesi – ‘ito me, samma rathakāra, channaṃ māsānaṃ accayena saṅgāmo bhavissati. Sakkhissasi [sakkhasi (syā. kaṃ. pī.)] me, samma rathakāra, navaṃ cakkayugaṃ kātu’nti? ‘Sakkomi devā’ti kho, bhikkhave, rathakāro rañño sacetanassa paccassosi. Atha kho, bhikkhave, rathakāro chahi māsehi chārattūnehi ekaṃ cakkaṃ niṭṭhāpesi. Atha kho, bhikkhave, rājā sacetano rathakāraṃ āmantesi – ‘ito me, samma rathakāra, channaṃ divasānaṃ accayena saṅgāmo bhavissati, niṭṭhitaṃ navaṃ cakkayuga’nti? ‘Imehi kho, deva, chahi māsehi chārattūnehi ekaṃ cakkaṃ niṭṭhita’nti. ‘Sakkhissasi pana me, samma rathakāra, imehi chahi divasehi dutiyaṃ cakkaṃ niṭṭhāpetu’nti? ‘Sakkomi devā’ti kho, bhikkhave, rathakāro chahi divasehi dutiyaṃ cakkaṃ niṭṭhāpetvā navaṃ cakkayugaṃ ādāya yena rājā sacetano tenupasaṅkami; upasaṅkamitvā rājānaṃ sacetanaṃ etadavoca – ‘idaṃ te, deva, navaṃ cakkayugaṃ niṭṭhita’nti. ‘Yañca te idaṃ, samma rathakāra, cakkaṃ chahi māsehi niṭṭhitaṃ chārattūnehi yañca te idaṃ cakkaṃ chahi divasehi niṭṭhitaṃ, imesaṃ kiṃ nānākaraṇaṃ? Nesāhaṃ kiñci nānākaraṇaṃ passāmī’ti. ‘Atthesaṃ, deva, nānākaraṇaṃ. Passatu devo nānākaraṇa’’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Atha ",
      " kho, bhikkhave, rathakāro yaṃ taṃ cakkaṃ chahi divasehi niṭṭhitaṃ taṃ pavattesi. Taṃ pavattitaṃ samānaṃ yāvatikā abhisaṅkhārassa gati tāvatikaṃ gantvā ciṅgulāyitvā ",
      " bhūmiyaṃ papati. Yaṃ pana taṃ cakkaṃ chahi māsehi niṭṭhitaṃ ",
      " chārattūnehi taṃ pavattesi. Taṃ pavattitaṃ samānaṃ yāvatikā abhisaṅkhārassa gati tāvatikaṃ gantvā akkhāhataṃ maññe aṭṭhāsi."
    ],
    "innerText": "‘‘Atha kho, bhikkhave, rathakāro yaṃ taṃ cakkaṃ chahi divasehi niṭṭhitaṃ taṃ pavattesi. Taṃ pavattitaṃ samānaṃ yāvatikā abhisaṅkhārassa gati tāvatikaṃ gantvā ciṅgulāyitvā bhūmiyaṃ papati. Yaṃ pana taṃ cakkaṃ chahi māsehi niṭṭhitaṃ chārattūnehi taṃ pavattesi. Taṃ pavattitaṃ samānaṃ yāvatikā abhisaṅkhārassa gati tāvatikaṃ gantvā akkhāhataṃ maññe aṭṭhāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Ko nu kho, samma rathakāra, hetu ko paccayo yamidaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yadidaṃ (ka.)]"
      },
      " cakkaṃ chahi divasehi niṭṭhitaṃ taṃ pavattitaṃ samānaṃ yāvatikā abhisaṅkhārassa gati tāvatikaṃ gantvā ciṅgulāyitvā bhūmiyaṃ ",
      " papati? Ko pana, samma rathakāra, hetu ko paccayo yamidaṃ cakkaṃ chahi māsehi niṭṭhitaṃ chārattūnehi taṃ pavattitaṃ samānaṃ yāvatikā abhisaṅkhārassa gati tāvatikaṃ gantvā akkhāhataṃ maññe aṭṭhāsī’ti? ‘Yamidaṃ, deva, cakkaṃ chahi divasehi niṭṭhitaṃ tassa nemipi savaṅkā sadosā sakasāvā, arāpi savaṅkā sadosā sakasāvā, nābhipi savaṅkā sadosā sakasāvā. Taṃ nemiyāpi savaṅkattā sadosattā sakasāvattā, arānampi savaṅkattā sadosattā sakasāvattā, nābhiyāpi savaṅkattā sadosattā sakasāvattā pavattitaṃ samānaṃ yāvatikā abhisaṅkhārassa gati tāvatikaṃ gantvā ciṅgulāyitvā bhūmiyaṃ papati. Yaṃ pana taṃ, deva, cakkaṃ chahi māsehi niṭṭhitaṃ chārattūnehi tassa nemipi avaṅkā adosā akasāvā, arāpi avaṅkā adosā akasāvā, nābhipi avaṅkā adosā akasāvā. Taṃ nemiyāpi avaṅkattā adosattā akasāvattā, arānampi avaṅkattā adosattā akasāvattā, nābhiyāpi avaṅkattā adosattā akasāvattā pavattitaṃ samānaṃ yāvatikā abhisaṅkhārassa gati tāvatikaṃ gantvā akkhāhataṃ maññe aṭṭhāsī’’’ti."
    ],
    "innerText": "‘‘‘Ko nu kho, samma rathakāra, hetu ko paccayo yamidaṃ [yadidaṃ (ka.)] cakkaṃ chahi divasehi niṭṭhitaṃ taṃ pavattitaṃ samānaṃ yāvatikā abhisaṅkhārassa gati tāvatikaṃ gantvā ciṅgulāyitvā bhūmiyaṃ papati? Ko pana, samma rathakāra, hetu ko paccayo yamidaṃ cakkaṃ chahi māsehi niṭṭhitaṃ chārattūnehi taṃ pavattitaṃ samānaṃ yāvatikā abhisaṅkhārassa gati tāvatikaṃ gantvā akkhāhataṃ maññe aṭṭhāsī’ti? ‘Yamidaṃ, deva, cakkaṃ chahi divasehi niṭṭhitaṃ tassa nemipi savaṅkā sadosā sakasāvā, arāpi savaṅkā sadosā sakasāvā, nābhipi savaṅkā sadosā sakasāvā. Taṃ nemiyāpi savaṅkattā sadosattā sakasāvattā, arānampi savaṅkattā sadosattā sakasāvattā, nābhiyāpi savaṅkattā sadosattā sakasāvattā pavattitaṃ samānaṃ yāvatikā abhisaṅkhārassa gati tāvatikaṃ gantvā ciṅgulāyitvā bhūmiyaṃ papati. Yaṃ pana taṃ, deva, cakkaṃ chahi māsehi niṭṭhitaṃ chārattūnehi tassa nemipi avaṅkā adosā akasāvā, arāpi avaṅkā adosā akasāvā, nābhipi avaṅkā adosā akasāvā. Taṃ nemiyāpi avaṅkattā adosattā akasāvattā, arānampi avaṅkattā adosattā akasāvattā, nābhiyāpi avaṅkattā adosattā akasāvattā pavattitaṃ samānaṃ yāvatikā abhisaṅkhārassa gati tāvatikaṃ gantvā akkhāhataṃ maññe aṭṭhāsī’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Siyā kho pana, bhikkhave, tumhākaṃ evamassa – ‘añño nūna tena samayena so ",
      " rathakāro ahosī’ti! Na kho panetaṃ, bhikkhave, evaṃ daṭṭhabbaṃ. Ahaṃ tena samayena so rathakāro ahosiṃ. Tadāhaṃ, bhikkhave, kusalo dāruvaṅkānaṃ dārudosānaṃ dārukasāvānaṃ. Etarahi kho panāhaṃ, bhikkhave, arahaṃ sammāsambuddho kusalo kāyavaṅkānaṃ kāyadosānaṃ ",
      " kāyakasāvānaṃ, kusalo vacīvaṅkānaṃ vacīdosānaṃ vacīkasāvānaṃ, kusalo manovaṅkānaṃ manodosānaṃ manokasāvānaṃ. Yassa kassaci, bhikkhave, bhikkhussa vā bhikkhuniyā vā kāyavaṅko appahīno kāyadoso kāyakasāvo, vacīvaṅko appahīno vacīdoso vacīkasāvo, manovaṅko appahīno manodoso manokasāvo, evaṃ papatitā te, bhikkhave, imasmā dhammavinayā, seyyathāpi taṃ cakkaṃ chahi divasehi niṭṭhitaṃ."
    ],
    "innerText": "‘‘Siyā kho pana, bhikkhave, tumhākaṃ evamassa – ‘añño nūna tena samayena so rathakāro ahosī’ti! Na kho panetaṃ, bhikkhave, evaṃ daṭṭhabbaṃ. Ahaṃ tena samayena so rathakāro ahosiṃ. Tadāhaṃ, bhikkhave, kusalo dāruvaṅkānaṃ dārudosānaṃ dārukasāvānaṃ. Etarahi kho panāhaṃ, bhikkhave, arahaṃ sammāsambuddho kusalo kāyavaṅkānaṃ kāyadosānaṃ kāyakasāvānaṃ, kusalo vacīvaṅkānaṃ vacīdosānaṃ vacīkasāvānaṃ, kusalo manovaṅkānaṃ manodosānaṃ manokasāvānaṃ. Yassa kassaci, bhikkhave, bhikkhussa vā bhikkhuniyā vā kāyavaṅko appahīno kāyadoso kāyakasāvo, vacīvaṅko appahīno vacīdoso vacīkasāvo, manovaṅko appahīno manodoso manokasāvo, evaṃ papatitā te, bhikkhave, imasmā dhammavinayā, seyyathāpi taṃ cakkaṃ chahi divasehi niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yassa kassaci, bhikkhave, bhikkhussa vā bhikkhuniyā vā kāyavaṅko pahīno kāyadoso kāyakasāvo, vacīvaṅko pahīno vacīdoso vacīkasāvo, manovaṅko pahīno manodoso manokasāvo ",
      ", evaṃ patiṭṭhitā te, bhikkhave, imasmiṃ dhammavinaye, seyyathāpi taṃ cakkaṃ chahi māsehi niṭṭhitaṃ chārattūnehi."
    ],
    "innerText": "‘‘Yassa kassaci, bhikkhave, bhikkhussa vā bhikkhuniyā vā kāyavaṅko pahīno kāyadoso kāyakasāvo, vacīvaṅko pahīno vacīdoso vacīkasāvo, manovaṅko pahīno manodoso manokasāvo , evaṃ patiṭṭhitā te, bhikkhave, imasmiṃ dhammavinaye, seyyathāpi taṃ cakkaṃ chahi māsehi niṭṭhitaṃ chārattūnehi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tasmātiha ",
      ", bhikkhave, evaṃ sikkhitabbaṃ – ‘kāyavaṅkaṃ pajahissāma kāyadosaṃ kāyakasāvaṃ, vacīvaṅkaṃ pajahissāma vacīdosaṃ vacīkasāvaṃ, manovaṅkaṃ pajahissāma manodosaṃ manokasāva’nti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Pañcamaṃ."
    ],
    "innerText": "‘‘Tasmātiha , bhikkhave, evaṃ sikkhitabbaṃ – ‘kāyavaṅkaṃ pajahissāma kāyadosaṃ kāyakasāvaṃ, vacīvaṅkaṃ pajahissāma vacīdosaṃ vacīkasāvaṃ, manovaṅkaṃ pajahissāma manodosaṃ manokasāva’nti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Apaṇṇakasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "16"
      },
      ". ‘‘Tīhi, bhikkhave, dhammehi samannāgato bhikkhu apaṇṇakapaṭipadaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[apaṇṇakataṃ paṭipadaṃ (sī. pī.) ṭīkāya pana sameti]"
      },
      " paṭipanno hoti, yoni cassa āraddhā hoti āsavānaṃ khayāya. Katamehi tīhi? Idha, bhikkhave, bhikkhu indriyesu guttadvāro hoti, bhojane mattaññū hoti, jāgariyaṃ anuyutto hoti."
    ],
    "innerText": "16. ‘‘Tīhi, bhikkhave, dhammehi samannāgato bhikkhu apaṇṇakapaṭipadaṃ [apaṇṇakataṃ paṭipadaṃ (sī. pī.) ṭīkāya pana sameti] paṭipanno hoti, yoni cassa āraddhā hoti āsavānaṃ khayāya. Katamehi tīhi? Idha, bhikkhave, bhikkhu indriyesu guttadvāro hoti, bhojane mattaññū hoti, jāgariyaṃ anuyutto hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, bhikkhu ",
      " indriyesu guttadvāro hoti? Idha, bhikkhave, bhikkhu cakkhunā rūpaṃ disvā na nimittaggāhī hoti nānubyañjanaggāhī. Yatvādhikaraṇamenaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yatvādhikaraṇametaṃ (sī.)]"
      },
      " cakkhundriyaṃ asaṃvutaṃ viharantaṃ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṃ tassa saṃvarāya paṭipajjati, rakkhati cakkhundriyaṃ, cakkhundriye saṃvaraṃ āpajjati. Sotena saddaṃ sutvā… ghānena gandhaṃ ghāyitvā… jivhāya rasaṃ sāyitvā… kāyena phoṭṭhabbaṃ phusitvā… manasā dhammaṃ viññāya na nimittaggāhī hoti nānubyañjanaggāhī. Yatvādhikaraṇamenaṃ ",
      " manindriyaṃ asaṃvutaṃ viharantaṃ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṃ tassa saṃvarāya paṭipajjati, rakkhati manindriyaṃ, manindriye saṃvaraṃ āpajjati. Evaṃ kho, bhikkhave, bhikkhu indriyesu guttadvāro hoti."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu indriyesu guttadvāro hoti? Idha, bhikkhave, bhikkhu cakkhunā rūpaṃ disvā na nimittaggāhī hoti nānubyañjanaggāhī. Yatvādhikaraṇamenaṃ [yatvādhikaraṇametaṃ (sī.)] cakkhundriyaṃ asaṃvutaṃ viharantaṃ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṃ tassa saṃvarāya paṭipajjati, rakkhati cakkhundriyaṃ, cakkhundriye saṃvaraṃ āpajjati. Sotena saddaṃ sutvā… ghānena gandhaṃ ghāyitvā… jivhāya rasaṃ sāyitvā… kāyena phoṭṭhabbaṃ phusitvā… manasā dhammaṃ viññāya na nimittaggāhī hoti nānubyañjanaggāhī. Yatvādhikaraṇamenaṃ manindriyaṃ asaṃvutaṃ viharantaṃ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṃ tassa saṃvarāya paṭipajjati, rakkhati manindriyaṃ, manindriye saṃvaraṃ āpajjati. Evaṃ kho, bhikkhave, bhikkhu indriyesu guttadvāro hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca ",
      ", bhikkhave, bhikkhu bhojane mattaññū hoti? Idha, bhikkhave, bhikkhu paṭisaṅkhā yoniso āhāraṃ āhāreti – ‘neva davāya na madāya na maṇḍanāya na vibhūsanāya, yāvadeva imassa kāyassa ṭhitiyā yāpanāya vihiṃsūparatiyā brahmacariyānuggahāya, iti purāṇañca vedanaṃ paṭihaṅkhāmi, navañca vedanaṃ na uppādessāmi, yātrā ca me bhavissati anavajjatā ca phāsuvihāro cā’ti. Evaṃ kho, bhikkhave, bhikkhu bhojane mattaññū hoti."
    ],
    "innerText": "‘‘Kathañca , bhikkhave, bhikkhu bhojane mattaññū hoti? Idha, bhikkhave, bhikkhu paṭisaṅkhā yoniso āhāraṃ āhāreti – ‘neva davāya na madāya na maṇḍanāya na vibhūsanāya, yāvadeva imassa kāyassa ṭhitiyā yāpanāya vihiṃsūparatiyā brahmacariyānuggahāya, iti purāṇañca vedanaṃ paṭihaṅkhāmi, navañca vedanaṃ na uppādessāmi, yātrā ca me bhavissati anavajjatā ca phāsuvihāro cā’ti. Evaṃ kho, bhikkhave, bhikkhu bhojane mattaññū hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, bhikkhu jāgariyaṃ anuyutto hoti? Idha, bhikkhave, bhikkhu divasaṃ caṅkamena nisajjāya āvaraṇīyehi dhammehi cittaṃ parisodheti, rattiyā paṭhamaṃ yāmaṃ caṅkamena ",
      " nisajjāya āvaraṇīyehi dhammehi cittaṃ parisodheti, rattiyā ",
      " majjhimaṃ yāmaṃ dakkhiṇena passena sīhaseyyaṃ kappeti pāde pādaṃ accādhāya sato sampajāno uṭṭhānasaññaṃ manasi karitvā, rattiyā pacchimaṃ yāmaṃ paccuṭṭhāya caṅkamena nisajjāya āvaraṇīyehi dhammehi cittaṃ parisodheti. Evaṃ kho, bhikkhave, bhikkhu jāgariyaṃ anuyutto hoti. Imehi kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu apaṇṇakapaṭipadaṃ paṭipanno hoti, yoni cassa āraddhā hoti āsavānaṃ khayāyā’’ti. Chaṭṭhaṃ."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu jāgariyaṃ anuyutto hoti? Idha, bhikkhave, bhikkhu divasaṃ caṅkamena nisajjāya āvaraṇīyehi dhammehi cittaṃ parisodheti, rattiyā paṭhamaṃ yāmaṃ caṅkamena nisajjāya āvaraṇīyehi dhammehi cittaṃ parisodheti, rattiyā majjhimaṃ yāmaṃ dakkhiṇena passena sīhaseyyaṃ kappeti pāde pādaṃ accādhāya sato sampajāno uṭṭhānasaññaṃ manasi karitvā, rattiyā pacchimaṃ yāmaṃ paccuṭṭhāya caṅkamena nisajjāya āvaraṇīyehi dhammehi cittaṃ parisodheti. Evaṃ kho, bhikkhave, bhikkhu jāgariyaṃ anuyutto hoti. Imehi kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu apaṇṇakapaṭipadaṃ paṭipanno hoti, yoni cassa āraddhā hoti āsavānaṃ khayāyā’’ti. Chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Attabyābādhasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "17"
      },
      ". ‘‘Tayome, bhikkhave, dhammā attabyābādhāyapi saṃvattanti, parabyābādhāyapi saṃvattanti, ubhayabyābādhāyapi saṃvattanti. Katame tayo? Kāyaduccaritaṃ, vacīduccaritaṃ, manoduccaritaṃ. Ime kho, bhikkhave, tayo dhammā attabyābādhāyapi saṃvattanti, parabyābādhāyapi saṃvattanti, ubhayabyābādhāyapi saṃvattanti."
    ],
    "innerText": "17. ‘‘Tayome, bhikkhave, dhammā attabyābādhāyapi saṃvattanti, parabyābādhāyapi saṃvattanti, ubhayabyābādhāyapi saṃvattanti. Katame tayo? Kāyaduccaritaṃ, vacīduccaritaṃ, manoduccaritaṃ. Ime kho, bhikkhave, tayo dhammā attabyābādhāyapi saṃvattanti, parabyābādhāyapi saṃvattanti, ubhayabyābādhāyapi saṃvattanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tayome, bhikkhave, dhammā nevattabyābādhāyapi saṃvattanti, na parabyābādhāyapi saṃvattanti, na ubhayabyābādhāyapi saṃvattanti. Katame tayo? Kāyasucaritaṃ, vacīsucaritaṃ, manosucaritaṃ. Ime kho, bhikkhave, tayo ",
      " dhammā nevattabyābādhāyapi saṃvattanti, na parabyābādhāyapi saṃvattanti, na ubhayabyābādhāyapi saṃvattantī’’ti. Sattamaṃ."
    ],
    "innerText": "‘‘Tayome, bhikkhave, dhammā nevattabyābādhāyapi saṃvattanti, na parabyābādhāyapi saṃvattanti, na ubhayabyābādhāyapi saṃvattanti. Katame tayo? Kāyasucaritaṃ, vacīsucaritaṃ, manosucaritaṃ. Ime kho, bhikkhave, tayo dhammā nevattabyābādhāyapi saṃvattanti, na parabyābādhāyapi saṃvattanti, na ubhayabyābādhāyapi saṃvattantī’’ti. Sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Devalokasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "18"
      },
      ". ‘‘Sace ",
      " vo, bhikkhave, aññatitthiyā paribbājakā evaṃ puccheyyuṃ – ‘devalokūpapattiyā, āvuso, samaṇe gotame brahmacariyaṃ vussathā’ti? Nanu tumhe, bhikkhave, evaṃ puṭṭhā aṭṭīyeyyātha harāyeyyātha jiguccheyyāthā’’ti? ‘‘Evaṃ, bhante’’. ‘‘Iti kira tumhe, bhikkhave, dibbena āyunā aṭṭīyatha harāyatha jigucchatha, dibbena vaṇṇena dibbena sukhena ",
      " dibbena yasena dibbenādhipateyyena aṭṭīyatha harāyatha jigucchatha; pageva kho pana, bhikkhave, tumhehi kāyaduccaritena aṭṭīyitabbaṃ harāyitabbaṃ jigucchitabbaṃ, vacīduccaritena… manoduccaritena aṭṭīyitabbaṃ harāyitabbaṃ jigucchitabba’’nti. Aṭṭhamaṃ."
    ],
    "innerText": "18. ‘‘Sace vo, bhikkhave, aññatitthiyā paribbājakā evaṃ puccheyyuṃ – ‘devalokūpapattiyā, āvuso, samaṇe gotame brahmacariyaṃ vussathā’ti? Nanu tumhe, bhikkhave, evaṃ puṭṭhā aṭṭīyeyyātha harāyeyyātha jiguccheyyāthā’’ti? ‘‘Evaṃ, bhante’’. ‘‘Iti kira tumhe, bhikkhave, dibbena āyunā aṭṭīyatha harāyatha jigucchatha, dibbena vaṇṇena dibbena sukhena dibbena yasena dibbenādhipateyyena aṭṭīyatha harāyatha jigucchatha; pageva kho pana, bhikkhave, tumhehi kāyaduccaritena aṭṭīyitabbaṃ harāyitabbaṃ jigucchitabbaṃ, vacīduccaritena… manoduccaritena aṭṭīyitabbaṃ harāyitabbaṃ jigucchitabba’’nti. Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Paṭhamapāpaṇikasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "19"
      },
      ". ‘‘Tīhi ",
      ", bhikkhave, aṅgehi samannāgato pāpaṇiko abhabbo anadhigataṃ vā bhogaṃ adhigantuṃ, adhigataṃ vā bhogaṃ phātiṃ kātuṃ. Katamehi tīhi? Idha, bhikkhave, pāpaṇiko pubbaṇhasamayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[majjhantikasamayaṃ (sī. syā. kaṃ. pī.)]"
      },
      " na sakkaccaṃ kammantaṃ adhiṭṭhāti, majjhanhikasamayaṃ na sakkaccaṃ kammantaṃ adhiṭṭhāti, sāyanhasamayaṃ na sakkaccaṃ kammantaṃ adhiṭṭhāti. Imehi kho, bhikkhave, tīhi aṅgehi samannāgato pāpaṇiko abhabbo anadhigataṃ vā bhogaṃ adhigantuṃ, adhigataṃ vā bhogaṃ phātiṃ kātuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[phātikattuṃ (sī.), phātikātuṃ (syā. kaṃ. pī.)]"
      },
      "."
    ],
    "innerText": "19. ‘‘Tīhi , bhikkhave, aṅgehi samannāgato pāpaṇiko abhabbo anadhigataṃ vā bhogaṃ adhigantuṃ, adhigataṃ vā bhogaṃ phātiṃ kātuṃ. Katamehi tīhi? Idha, bhikkhave, pāpaṇiko pubbaṇhasamayaṃ [majjhantikasamayaṃ (sī. syā. kaṃ. pī.)] na sakkaccaṃ kammantaṃ adhiṭṭhāti, majjhanhikasamayaṃ na sakkaccaṃ kammantaṃ adhiṭṭhāti, sāyanhasamayaṃ na sakkaccaṃ kammantaṃ adhiṭṭhāti. Imehi kho, bhikkhave, tīhi aṅgehi samannāgato pāpaṇiko abhabbo anadhigataṃ vā bhogaṃ adhigantuṃ, adhigataṃ vā bhogaṃ phātiṃ kātuṃ [phātikattuṃ (sī.), phātikātuṃ (syā. kaṃ. pī.)]."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Evamevaṃ kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu abhabbo anadhigataṃ vā kusalaṃ dhammaṃ adhigantuṃ, adhigataṃ vā kusalaṃ dhammaṃ phātiṃ kātuṃ. Katamehi tīhi? Idha, bhikkhave, bhikkhu pubbaṇhasamayaṃ na sakkaccaṃ samādhinimittaṃ adhiṭṭhāti, majjhanhikasamayaṃ na sakkaccaṃ samādhinimittaṃ adhiṭṭhāti, sāyanhasamayaṃ na sakkaccaṃ samādhinimittaṃ adhiṭṭhāti. Imehi kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu abhabbo anadhigataṃ vā kusalaṃ dhammaṃ adhigantuṃ, adhigataṃ vā kusalaṃ dhammaṃ phātiṃ kātuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tīhi ",
      ", bhikkhave, aṅgehi samannāgato pāpaṇiko bhabbo anadhigataṃ vā bhogaṃ adhigantuṃ, adhigataṃ vā bhogaṃ phātiṃ kātuṃ. Katamehi tīhi? Idha ",
      ", bhikkhave, pāpaṇiko pubbaṇhasamayaṃ sakkaccaṃ kammantaṃ adhiṭṭhāti, majjhanhikasamayaṃ…pe… sāyanhasamayaṃ sakkaccaṃ kammantaṃ adhiṭṭhāti. Imehi kho, bhikkhave, tīhi aṅgehi samannāgato pāpaṇiko bhabbo anadhigataṃ vā bhogaṃ adhigantuṃ, adhigataṃ vā bhogaṃ phātiṃ kātuṃ."
    ],
    "innerText": "‘‘Tīhi , bhikkhave, aṅgehi samannāgato pāpaṇiko bhabbo anadhigataṃ vā bhogaṃ adhigantuṃ, adhigataṃ vā bhogaṃ phātiṃ kātuṃ. Katamehi tīhi? Idha , bhikkhave, pāpaṇiko pubbaṇhasamayaṃ sakkaccaṃ kammantaṃ adhiṭṭhāti, majjhanhikasamayaṃ…pe… sāyanhasamayaṃ sakkaccaṃ kammantaṃ adhiṭṭhāti. Imehi kho, bhikkhave, tīhi aṅgehi samannāgato pāpaṇiko bhabbo anadhigataṃ vā bhogaṃ adhigantuṃ, adhigataṃ vā bhogaṃ phātiṃ kātuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Evamevaṃ kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu bhabbo anadhigataṃ vā kusalaṃ dhammaṃ adhigantuṃ, adhigataṃ vā kusalaṃ dhammaṃ phātiṃ kātuṃ. Katamehi tīhi? Idha, bhikkhave, bhikkhu pubbaṇhasamayaṃ sakkaccaṃ samādhinimittaṃ adhiṭṭhāti, majjhanhikasamayaṃ…pe… sāyanhasamayaṃ sakkaccaṃ samādhinimittaṃ adhiṭṭhāti. Imehi kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu bhabbo anadhigataṃ vā kusalaṃ dhammaṃ adhigantuṃ, adhigataṃ vā kusalaṃ dhammaṃ phātiṃ kātu’’nti. Navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Dutiyapāpaṇikasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "20"
      },
      ". ‘‘Tīhi ",
      ", bhikkhave, aṅgehi samannāgato pāpaṇiko nacirasseva mahattaṃ vepullattaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mahantattaṃ vā vepullattaṃ vā (pī. ka.)]"
      },
      " pāpuṇāti bhogesu. Katamehi tīhi? Idha, bhikkhave, pāpaṇiko cakkhumā ca hoti vidhuro ca nissayasampanno ca. Kathañca, bhikkhave, pāpaṇiko cakkhumā hoti? Idha, bhikkhave, pāpaṇiko paṇiyaṃ jānāti – ‘idaṃ paṇiyaṃ evaṃ kītaṃ, evaṃ vikkayamānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vikkīyamānaṃ (?)]"
      },
      ", ettakaṃ mūlaṃ bhavissati, ettako udayo’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[uddayoti (sī.)]"
      },
      ". Evaṃ kho, bhikkhave, pāpaṇiko cakkhumā hoti."
    ],
    "innerText": "20. ‘‘Tīhi , bhikkhave, aṅgehi samannāgato pāpaṇiko nacirasseva mahattaṃ vepullattaṃ [mahantattaṃ vā vepullattaṃ vā (pī. ka.)] pāpuṇāti bhogesu. Katamehi tīhi? Idha, bhikkhave, pāpaṇiko cakkhumā ca hoti vidhuro ca nissayasampanno ca. Kathañca, bhikkhave, pāpaṇiko cakkhumā hoti? Idha, bhikkhave, pāpaṇiko paṇiyaṃ jānāti – ‘idaṃ paṇiyaṃ evaṃ kītaṃ, evaṃ vikkayamānaṃ [vikkīyamānaṃ (?)], ettakaṃ mūlaṃ bhavissati, ettako udayo’ti [uddayoti (sī.)]. Evaṃ kho, bhikkhave, pāpaṇiko cakkhumā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, pāpaṇiko vidhuro hoti? Idha, bhikkhave, pāpaṇiko kusalo hoti paṇiyaṃ ketuñca vikketuñca. Evaṃ kho, bhikkhave, pāpaṇiko vidhuro hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, pāpaṇiko nissayasampanno hoti? Idha ",
      " bhikkhave ",
      ", pāpaṇikaṃ ye te gahapatī vā gahapatiputtā vā aḍḍhā mahaddhanā mahābhogā te evaṃ jānanti – ‘ayaṃ kho bhavaṃ pāpaṇiko cakkhumā vidhuro ",
      " ca paṭibalo puttadārañca posetuṃ, amhākañca kālena kālaṃ anuppadātu’nti. Te naṃ bhogehi nipatanti – ‘ito, samma pāpaṇika, bhoge karitvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[haritvā (sī. syā. kaṃ.)]"
      },
      " puttadārañca posehi, amhākañca kālena kālaṃ anuppadehī’ti. Evaṃ kho, bhikkhave, pāpaṇiko nissayasampanno hoti. Imehi kho, bhikkhave, tīhi aṅgehi samannāgato pāpaṇiko nacirasseva mahattaṃ vepullattaṃ pāpuṇāti bhogesu."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, pāpaṇiko nissayasampanno hoti? Idha bhikkhave , pāpaṇikaṃ ye te gahapatī vā gahapatiputtā vā aḍḍhā mahaddhanā mahābhogā te evaṃ jānanti – ‘ayaṃ kho bhavaṃ pāpaṇiko cakkhumā vidhuro ca paṭibalo puttadārañca posetuṃ, amhākañca kālena kālaṃ anuppadātu’nti. Te naṃ bhogehi nipatanti – ‘ito, samma pāpaṇika, bhoge karitvā [haritvā (sī. syā. kaṃ.)] puttadārañca posehi, amhākañca kālena kālaṃ anuppadehī’ti. Evaṃ kho, bhikkhave, pāpaṇiko nissayasampanno hoti. Imehi kho, bhikkhave, tīhi aṅgehi samannāgato pāpaṇiko nacirasseva mahattaṃ vepullattaṃ pāpuṇāti bhogesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Evamevaṃ kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu nacirasseva mahattaṃ vepullattaṃ pāpuṇāti kusalesu dhammesu. Katamehi tīhi? Idha, bhikkhave, bhikkhu cakkhumā ca hoti vidhuro ca nissayasampanno ca. Kathañca, bhikkhave, bhikkhu cakkhumā hoti? Idha, bhikkhave, bhikkhu ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhasamudayo’ti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhanirodho’ti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti. Evaṃ kho, bhikkhave, bhikkhu cakkhumā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, bhikkhu vidhuro hoti? Idha, bhikkhave, bhikkhu āraddhavīriyo viharati ",
      " akusalānaṃ dhammānaṃ pahānāya, kusalānaṃ dhammānaṃ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. Evaṃ kho, bhikkhave, bhikkhu vidhuro hoti."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu vidhuro hoti? Idha, bhikkhave, bhikkhu āraddhavīriyo viharati akusalānaṃ dhammānaṃ pahānāya, kusalānaṃ dhammānaṃ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. Evaṃ kho, bhikkhave, bhikkhu vidhuro hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, bhikkhu nissayasampanno hoti? Idha, bhikkhave, bhikkhu ye te bhikkhū bahussutā āgatāgamā dhammadharā vinayadharā mātikādharā te kālena kālaṃ upasaṅkamitvā paripucchati paripañhati ",
      " – ‘idaṃ, bhante, kathaṃ, imassa ko attho’ti? Tassa te āyasmanto avivaṭañceva vivaranti, anuttānīkatañca uttānīkaronti, anekavihitesu ca kaṅkhāṭhāniyesu dhammesu kaṅkhaṃ paṭivinodenti. Evaṃ kho, bhikkhave, bhikkhu nissayasampanno hoti. Imehi ",
      " kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu nacirasseva mahattaṃ vepullattaṃ pāpuṇāti kusalesu dhammesū’’ti. Dasamaṃ."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu nissayasampanno hoti? Idha, bhikkhave, bhikkhu ye te bhikkhū bahussutā āgatāgamā dhammadharā vinayadharā mātikādharā te kālena kālaṃ upasaṅkamitvā paripucchati paripañhati – ‘idaṃ, bhante, kathaṃ, imassa ko attho’ti? Tassa te āyasmanto avivaṭañceva vivaranti, anuttānīkatañca uttānīkaronti, anekavihitesu ca kaṅkhāṭhāniyesu dhammesu kaṅkhaṃ paṭivinodenti. Evaṃ kho, bhikkhave, bhikkhu nissayasampanno hoti. Imehi kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu nacirasseva mahattaṃ vepullattaṃ pāpuṇāti kusalesu dhammesū’’ti. Dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Rathakāravaggo dutiyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṭhamabhāṇavāro niṭṭhito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Ñāto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ñātako (syā. kaṃ.)]"
      },
      " sāraṇīyo bhikkhu, cakkavattī sacetano;"
    ],
    "innerText": "Ñāto [ñātako (syā. kaṃ.)] sāraṇīyo bhikkhu, cakkavattī sacetano;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Apaṇṇakattā devo ca, duve pāpaṇikena cāti."
  }
]