[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "3. Puggalavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Samiddhasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "21"
      },
      ". Tatiyassa ",
      " paṭhame jhānaphassaṃ paṭhamaṃ phusati, pacchā nirodhaṃ nibbānaṃ sacchikarotīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāyasakkhi"
      },
      ". Diṭṭhantaṃ pattoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "diṭṭhippatto"
      },
      ". Saddahanto vimuttoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saddhāvimutto. Khamatī"
      },
      "ti ruccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhikkantataro"
      },
      "ti atisundarataro. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṇītataro"
      },
      "ti atipaṇītataro. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddhindriyaṃ adhimattaṃ hotī"
      },
      "ti samiddhattherassa kira arahattamaggakkhaṇe saddhindriyaṃ dhuraṃ ahosi, sesāni cattāri sahajātindriyāni tasseva parivārāni ahesuṃ. Iti thero attanā paṭividdhamaggaṃ kathento evamāha. Mahākoṭṭhikattherassa pana arahattamaggakkhaṇe samādhindriyaṃ dhuraṃ ahosi, sesāni cattāri indriyāni tasseva parivārāni ahesuṃ. Tasmā sopi samādhindriyaṃ adhimattanti kathento attanā paṭividdhamaggameva kathesi. Sāriputtattherassa pana arahattamaggakkhaṇe paññindriyaṃ dhuraṃ ahosi. Sesāni cattāri indriyāni tasseva parivārāni ahesuṃ. Tasmā sopi paññindriyaṃ adhimattanti kathento attanā paṭividdhamaggameva kathesi."
    ],
    "innerText": "21. Tatiyassa paṭhame jhānaphassaṃ paṭhamaṃ phusati, pacchā nirodhaṃ nibbānaṃ sacchikarotīti kāyasakkhi. Diṭṭhantaṃ pattoti diṭṭhippatto. Saddahanto vimuttoti saddhāvimutto. Khamatīti ruccati. Abhikkantataroti atisundarataro. Paṇītataroti atipaṇītataro. Saddhindriyaṃ adhimattaṃ hotīti samiddhattherassa kira arahattamaggakkhaṇe saddhindriyaṃ dhuraṃ ahosi, sesāni cattāri sahajātindriyāni tasseva parivārāni ahesuṃ. Iti thero attanā paṭividdhamaggaṃ kathento evamāha. Mahākoṭṭhikattherassa pana arahattamaggakkhaṇe samādhindriyaṃ dhuraṃ ahosi, sesāni cattāri indriyāni tasseva parivārāni ahesuṃ. Tasmā sopi samādhindriyaṃ adhimattanti kathento attanā paṭividdhamaggameva kathesi. Sāriputtattherassa pana arahattamaggakkhaṇe paññindriyaṃ dhuraṃ ahosi. Sesāni cattāri indriyāni tasseva parivārāni ahesuṃ. Tasmā sopi paññindriyaṃ adhimattanti kathento attanā paṭividdhamaggameva kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "khvetthā"
      },
      "ti na kho ettha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekaṃsena byākātu"
      },
      "nti ekantena byākarituṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Arahattāya paṭipanno"
      },
      "ti arahattamaggasamaṅgiṃ dasseti. Evametasmiṃ sutte tīhipi therehi attanā paṭividdhamaggova kathito, sammāsambuddho pana bhummantareneva kathesi."
    ],
    "innerText": "Nakhvetthāti na kho ettha. Ekaṃsena byākātunti ekantena byākarituṃ. Arahattāya paṭipannoti arahattamaggasamaṅgiṃ dasseti. Evametasmiṃ sutte tīhipi therehi attanā paṭividdhamaggova kathito, sammāsambuddho pana bhummantareneva kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Gilānasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "22"
      },
      ". Dutiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sappāyānī"
      },
      "ti hitāni vuddhikarāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Patirūpa"
      },
      "nti anucchavikaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Neva vuṭṭhāti tamhā ābādhā"
      },
      "ti iminā atekicchena vātāpamārādinā rogena samannāgato niṭṭhāpattagilāno kathito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vuṭṭhāti tamhā ābādhā"
      },
      "ti iminā khipitakakacchutiṇapupphakajarādibhedo appamattaābādho kathito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Labhanto sappāyāni bhojanāni no alabhanto"
      },
      "ti iminā pana yesaṃ paṭijagganena phāsukaṃ hoti, sabbepi te ābādhā kathitā. Ettha ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "patirūpo upaṭṭhāko"
      },
      " nāma ",
      " gilānupaṭṭhākaaṅgehi samannāgato paṇḍito dakkho analaso veditabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gilānupaṭṭhāko anuññāto"
      },
      "ti bhikkhusaṅghena dātabboti anuññāto. Tasmiñhi gilāne attano dhammatāya yāpetuṃ asakkonte bhikkhusaṅghena ",
      " tassa bhikkhuno eko bhikkhu ca sāmaṇero ca ‘‘imaṃ paṭijaggathā’’ti apaloketvā dātabbā. Yāva pana te taṃ paṭijagganti, tāva gilānassa ca tesañca dvinnaṃ yenattho, sabbaṃ bhikkhusaṅghasseva bhāro."
    ],
    "innerText": "22. Dutiye sappāyānīti hitāni vuddhikarāni. Patirūpanti anucchavikaṃ. Neva vuṭṭhāti tamhā ābādhāti iminā atekicchena vātāpamārādinā rogena samannāgato niṭṭhāpattagilāno kathito. Vuṭṭhāti tamhā ābādhāti iminā khipitakakacchutiṇapupphakajarādibhedo appamattaābādho kathito. Labhanto sappāyāni bhojanāni no alabhantoti iminā pana yesaṃ paṭijagganena phāsukaṃ hoti, sabbepi te ābādhā kathitā. Ettha ca patirūpo upaṭṭhāko nāma gilānupaṭṭhākaaṅgehi samannāgato paṇḍito dakkho analaso veditabbo. Gilānupaṭṭhāko anuññātoti bhikkhusaṅghena dātabboti anuññāto. Tasmiñhi gilāne attano dhammatāya yāpetuṃ asakkonte bhikkhusaṅghena tassa bhikkhuno eko bhikkhu ca sāmaṇero ca ‘‘imaṃ paṭijaggathā’’ti apaloketvā dātabbā. Yāva pana te taṃ paṭijagganti, tāva gilānassa ca tesañca dvinnaṃ yenattho, sabbaṃ bhikkhusaṅghasseva bhāro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aññepi gilānā upaṭṭhātabbā"
      },
      "ti itarepi dve gilānā upaṭṭhāpetabbā. Kiṃ kāraṇā? Yopi hi niṭṭhapattagilāno, so anupaṭṭhiyamāno ‘‘sace maṃ paṭijaggeyyuṃ, phāsukaṃ me bhaveyya. Na kho pana maṃ paṭijaggantī’’ti manopadosaṃ katvā apāye nibbatteyya. Paṭijaggiyamānassa panassa evaṃ hoti ‘‘bhikkhusaṅghena yaṃ kātabbaṃ, taṃ kataṃ. Mayhaṃ pana kammavipāko īdiso’’ti. So bhikkhusaṅghe mettaṃ ",
      " paccupaṭṭhāpetvā sagge nibbattissati. Yo pana appamattakena byādhinā samannāgato labhantopi alabhantopi vuṭṭhātiyeva, tassa vināpi bhesajjena vūpasamanabyādhi bhesajje kate khippataraṃ vūpasammati. So tato buddhavacanaṃ vā uggaṇhituṃ sakkhissati, samaṇadhammaṃ vā kātuṃ sakkhissati. Iminā kāraṇena ‘‘aññepi gilānā upaṭṭhātabbā’’ti vuttaṃ."
    ],
    "innerText": "Aññepi gilānā upaṭṭhātabbāti itarepi dve gilānā upaṭṭhāpetabbā. Kiṃ kāraṇā? Yopi hi niṭṭhapattagilāno, so anupaṭṭhiyamāno ‘‘sace maṃ paṭijaggeyyuṃ, phāsukaṃ me bhaveyya. Na kho pana maṃ paṭijaggantī’’ti manopadosaṃ katvā apāye nibbatteyya. Paṭijaggiyamānassa panassa evaṃ hoti ‘‘bhikkhusaṅghena yaṃ kātabbaṃ, taṃ kataṃ. Mayhaṃ pana kammavipāko īdiso’’ti. So bhikkhusaṅghe mettaṃ paccupaṭṭhāpetvā sagge nibbattissati. Yo pana appamattakena byādhinā samannāgato labhantopi alabhantopi vuṭṭhātiyeva, tassa vināpi bhesajjena vūpasamanabyādhi bhesajje kate khippataraṃ vūpasammati. So tato buddhavacanaṃ vā uggaṇhituṃ sakkhissati, samaṇadhammaṃ vā kātuṃ sakkhissati. Iminā kāraṇena ‘‘aññepi gilānā upaṭṭhātabbā’’ti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Neva okkamatī"
      },
      "ti neva pavisati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Niyāmaṃ kusalesu dhammesu sammatta"
      },
      "nti kusalesu dhammesu magganiyāmasaṅkhātaṃ sammattaṃ. Iminā padaparamo puggalo kathito. Dutiyavārena ugghaṭitaññū gahito sāsane nālakattherasadiso buddhantare ekavāraṃ paccekabuddhānaṃ santike ovādaṃ labhitvā paṭividdhapaccekabodhiñāṇo ca. Tatiyavārena vipañcitaññū puggalo kathito, neyyo pana tannissitova hoti."
    ],
    "innerText": "Neva okkamatīti neva pavisati. Niyāmaṃ kusalesu dhammesu sammattanti kusalesu dhammesu magganiyāmasaṅkhātaṃ sammattaṃ. Iminā padaparamo puggalo kathito. Dutiyavārena ugghaṭitaññū gahito sāsane nālakattherasadiso buddhantare ekavāraṃ paccekabuddhānaṃ santike ovādaṃ labhitvā paṭividdhapaccekabodhiñāṇo ca. Tatiyavārena vipañcitaññū puggalo kathito, neyyo pana tannissitova hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammadesanā anuññātā"
      },
      "ti māsassa aṭṭha vāre dhammakathā anuññātā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aññesampi dhammo desetabbo"
      },
      "ti itaresampi dhammo kathetabbo. Kiṃ kāraṇā? Padaparamassa hi imasmiṃ attabhāve dhammaṃ paṭivijjhituṃ asakkontassāpi anāgate paccayo bhavissati. Yo pana tathāgatassa rūpadassanaṃ labhantopi alabhantopi dhammavinayañca savanāya labhantopi alabhantopi dhammaṃ abhisameti, so alabhanto tāva abhisameti. Labhanto pana khippameva abhisamessatīti iminā kāraṇena ",
      " tesaṃ dhammo desetabbo. Tatiyassa pana punappunaṃ desetabbova."
    ],
    "innerText": "Dhammadesanā anuññātāti māsassa aṭṭha vāre dhammakathā anuññātā. Aññesampi dhammo desetabboti itaresampi dhammo kathetabbo. Kiṃ kāraṇā? Padaparamassa hi imasmiṃ attabhāve dhammaṃ paṭivijjhituṃ asakkontassāpi anāgate paccayo bhavissati. Yo pana tathāgatassa rūpadassanaṃ labhantopi alabhantopi dhammavinayañca savanāya labhantopi alabhantopi dhammaṃ abhisameti, so alabhanto tāva abhisameti. Labhanto pana khippameva abhisamessatīti iminā kāraṇena tesaṃ dhammo desetabbo. Tatiyassa pana punappunaṃ desetabbova."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Saṅkhārasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "23"
      },
      ". Tatiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sabyābajjha"
      },
      "nti sadukkhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāyasaṅkhāra"
      },
      "nti kāyadvāre cetanārāsiṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhisaṅkharotī"
      },
      "ti āyūhati rāsiṃ karoti piṇḍaṃ karoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vacīmanodvāresu"
      },
      "pi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabyābajjhaṃ loka"
      },
      "nti sadukkhaṃ lokaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabyābajjhā phassā phusantī"
      },
      "ti sadukkhā vipākaphassā phusanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabyābajjhaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vedanaṃ vediyatī"
      },
      "ti sadukkhaṃ vipākavedanaṃ vediyati, sābādhaṃ nirassādanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Seyyathāpi sattā nerayikā"
      },
      "ti yathā niraye nibbattasattā ekantadukkhaṃ vedanaṃ vediyanti, evaṃ vediyatīti attho. Kiṃ pana tattha upekkhāvedanā natthīti? Atthi, dukkhavedanāya pana balavabhāvena sā abbohārikaṭṭhāne ṭhitā. Iti nirayova nirayassa upamaṃ katvā āhaṭo. Tatra paṭibhāgaupamā nāma kira esā."
    ],
    "innerText": "23. Tatiye sabyābajjhanti sadukkhaṃ. Kāyasaṅkhāranti kāyadvāre cetanārāsiṃ. Abhisaṅkharotīti āyūhati rāsiṃ karoti piṇḍaṃ karoti. Vacīmanodvāresupi eseva nayo. Sabyābajjhaṃ lokanti sadukkhaṃ lokaṃ. Sabyābajjhā phassā phusantīti sadukkhā vipākaphassā phusanti. Sabyābajjhaṃvedanaṃ vediyatīti sadukkhaṃ vipākavedanaṃ vediyati, sābādhaṃ nirassādanti attho. Seyyathāpi sattā nerayikāti yathā niraye nibbattasattā ekantadukkhaṃ vedanaṃ vediyanti, evaṃ vediyatīti attho. Kiṃ pana tattha upekkhāvedanā natthīti? Atthi, dukkhavedanāya pana balavabhāvena sā abbohārikaṭṭhāne ṭhitā. Iti nirayova nirayassa upamaṃ katvā āhaṭo. Tatra paṭibhāgaupamā nāma kira esā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Seyyathāpi devā subhakiṇhā"
      },
      "ti idhāpi devalokova devalokassa upamaṃ katvā āhaṭo. Yasmā pana heṭṭhimesu brahmalokesu sappītikajjhānavipāko vattati, subhakiṇhesu nippītiko ekantasukhova, tasmā te aggahetvā subhakiṇhāva kathitā. Iti ayampi tatra paṭibhāgaupamā nāmāti veditabbā."
    ],
    "innerText": "Seyyathāpi devā subhakiṇhāti idhāpi devalokova devalokassa upamaṃ katvā āhaṭo. Yasmā pana heṭṭhimesu brahmalokesu sappītikajjhānavipāko vattati, subhakiṇhesu nippītiko ekantasukhova, tasmā te aggahetvā subhakiṇhāva kathitā. Iti ayampi tatra paṭibhāgaupamā nāmāti veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vokiṇṇasukhadukkha"
      },
      "nti vomissakasukhadukkhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Seyyathāpi manussā"
      },
      "ti manussānaṃ hi kālena sukhaṃ hoti, kālena dukkhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekacce ca devā"
      },
      "ti kāmāvacaradevā. Tesampi kālena sukhaṃ hoti, kālena dukkhaṃ. Tesaṃ hi hīnatarānaṃ mahesakkhatarā devatā disvā āsanā vuṭṭhātabbaṃ hoti, maggā ukkamitabbaṃ, pārutavatthaṃ apanetabbaṃ, añjalikammaṃ kātabbanti taṃ sabbampi dukkhaṃ nāma hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekacce ca vinipātikā"
      },
      "ti vemānikapetā. Te hi kālena sampattiṃ anubhavanti kālena kammanti vokiṇṇasukhadukkhāva honti. Iti imasmiṃ sutte tīṇi sucaritāni lokiyalokuttaramissakāni kathitānīti veditabbāni."
    ],
    "innerText": "Vokiṇṇasukhadukkhanti vomissakasukhadukkhaṃ. Seyyathāpi manussāti manussānaṃ hi kālena sukhaṃ hoti, kālena dukkhaṃ. Ekacce ca devāti kāmāvacaradevā. Tesampi kālena sukhaṃ hoti, kālena dukkhaṃ. Tesaṃ hi hīnatarānaṃ mahesakkhatarā devatā disvā āsanā vuṭṭhātabbaṃ hoti, maggā ukkamitabbaṃ, pārutavatthaṃ apanetabbaṃ, añjalikammaṃ kātabbanti taṃ sabbampi dukkhaṃ nāma hoti. Ekacce ca vinipātikāti vemānikapetā. Te hi kālena sampattiṃ anubhavanti kālena kammanti vokiṇṇasukhadukkhāva honti. Iti imasmiṃ sutte tīṇi sucaritāni lokiyalokuttaramissakāni kathitānīti veditabbāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Bahukārasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "24"
      },
      ". Catutthe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tayome, bhikkhave, puggalā"
      },
      "ti tayo ācariyapuggalā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puggalassa"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bahukārā"
      },
      "ti antevāsikapuggalassa bahūpakārā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Buddha"
      },
      "nti sabbaññubuddhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saraṇaṃ gato hotī"
      },
      "ti avassayaṃ ",
      " gato hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhamma"
      },
      "nti satantikaṃ navalokuttaradhammaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅgha"
      },
      "nti aṭṭhaariyapuggalasamūhaṃ. Idañca pana saraṇagamanaṃ aggahitasaraṇapubbassa akatābhinivesassa vasena vuttaṃ. Iti imasmiṃ sutte saraṇadāyako sotāpattimaggasampāpako arahattamaggasampāpakoti tayo ācariyā bahukārāti āgatā, pabbajjādāyako buddhavacanadāyako kammavācācariyo sakadāgāmimaggasampāpako anāgāmimaggasampāpakoti ime ācariyā na āgatā, kiṃ ete na bahukārāti? No, na bahukārā. Ayaṃ pana desanā duvidhena paricchinnā. Tasmā sabbepete bahukārā. Tesu saraṇagamanasmiṃyeva akatābhiniveso vaṭṭati, catupārisuddhisīlakasiṇaparikammavipassanāñāṇāni pana paṭhamamaggasannissitāni honti, upari dve maggā ca phalāni ca arahattamaggasannissitānīti veditabbāni."
    ],
    "innerText": "24. Catutthe tayome, bhikkhave, puggalāti tayo ācariyapuggalā. Puggalassabahukārāti antevāsikapuggalassa bahūpakārā. Buddhanti sabbaññubuddhaṃ. Saraṇaṃ gato hotīti avassayaṃ gato hoti. Dhammanti satantikaṃ navalokuttaradhammaṃ. Saṅghanti aṭṭhaariyapuggalasamūhaṃ. Idañca pana saraṇagamanaṃ aggahitasaraṇapubbassa akatābhinivesassa vasena vuttaṃ. Iti imasmiṃ sutte saraṇadāyako sotāpattimaggasampāpako arahattamaggasampāpakoti tayo ācariyā bahukārāti āgatā, pabbajjādāyako buddhavacanadāyako kammavācācariyo sakadāgāmimaggasampāpako anāgāmimaggasampāpakoti ime ācariyā na āgatā, kiṃ ete na bahukārāti? No, na bahukārā. Ayaṃ pana desanā duvidhena paricchinnā. Tasmā sabbepete bahukārā. Tesu saraṇagamanasmiṃyeva akatābhiniveso vaṭṭati, catupārisuddhisīlakasiṇaparikammavipassanāñāṇāni pana paṭhamamaggasannissitāni honti, upari dve maggā ca phalāni ca arahattamaggasannissitānīti veditabbāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iminā puggalenā"
      },
      "ti iminā antevāsikapuggalena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na suppatikāraṃ vadāmī"
      },
      "ti patikāraṃ kātuṃ na sukaranti vadāmi. Abhivādanādīsu anekasatavāraṃ anekasahassavārampi hi pañcapatiṭṭhitena nipatitvā vandanto āsanā vuṭṭhāya paccuggacchanto diṭṭhadiṭṭhakkhaṇe añjaliṃ paggaṇhanto anucchavikaṃ sāmīcikammaṃ karonto divase divase cīvarasataṃ cīvarasahassaṃ piṇḍapātasataṃ piṇḍapātasahassaṃ dadamāno cakkavāḷapariyantena sabbaratanamayaṃ āvāsaṃ karonto sappinavanītādinānappakāraṃ bhesajjaṃ anuppadajjamāno neva sakkoti ācariyena katassa patikāraṃ nāma kātunti evamattho veditabbo."
    ],
    "innerText": "Iminā puggalenāti iminā antevāsikapuggalena. Na suppatikāraṃ vadāmīti patikāraṃ kātuṃ na sukaranti vadāmi. Abhivādanādīsu anekasatavāraṃ anekasahassavārampi hi pañcapatiṭṭhitena nipatitvā vandanto āsanā vuṭṭhāya paccuggacchanto diṭṭhadiṭṭhakkhaṇe añjaliṃ paggaṇhanto anucchavikaṃ sāmīcikammaṃ karonto divase divase cīvarasataṃ cīvarasahassaṃ piṇḍapātasataṃ piṇḍapātasahassaṃ dadamāno cakkavāḷapariyantena sabbaratanamayaṃ āvāsaṃ karonto sappinavanītādinānappakāraṃ bhesajjaṃ anuppadajjamāno neva sakkoti ācariyena katassa patikāraṃ nāma kātunti evamattho veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Vajirūpamasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "25"
      },
      ". Pañcame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "arukūpamacitto"
      },
      "ti purāṇavaṇasadisacitto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vijjūpamacitto"
      },
      "ti ittarakālobhāsanena vijjusadisacitto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vajirūpamacitto"
      },
      "ti ",
      " kilesānaṃ ",
      " mūlaghātakaraṇasamatthatāya vajirena sadisacitto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhisajjatī"
      },
      "ti laggati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kuppatī"
      },
      "ti kopavasena kuppati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Byāpajjatī"
      },
      "ti pakatibhāvaṃ pajahati, pūtiko hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Patitthīyatī"
      },
      "ti thinabhāvaṃ thaddhabhāvaṃ āpajjati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kopa"
      },
      "nti dubbalakodhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dosa"
      },
      "nti dussanavasena tato balavataraṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appaccaya"
      },
      "nti atuṭṭhākāraṃ domanassaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Duṭṭhāruko"
      },
      "ti purāṇavaṇo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kaṭṭhenā"
      },
      "ti daṇḍakakoṭiyā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kaṭhalenā"
      },
      "ti kapālena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āsavaṃ detī"
      },
      "ti aparāparaṃ savati. Purāṇavaṇo hi attano dhammatāyeva pubbaṃ lohitaṃ yūsanti imāni tīṇi savati, ghaṭṭito pana tāni adhikataraṃ savati."
    ],
    "innerText": "25. Pañcame arukūpamacittoti purāṇavaṇasadisacitto. Vijjūpamacittoti ittarakālobhāsanena vijjusadisacitto. Vajirūpamacittoti kilesānaṃ mūlaghātakaraṇasamatthatāya vajirena sadisacitto. Abhisajjatīti laggati. Kuppatīti kopavasena kuppati. Byāpajjatīti pakatibhāvaṃ pajahati, pūtiko hoti. Patitthīyatīti thinabhāvaṃ thaddhabhāvaṃ āpajjati. Kopanti dubbalakodhaṃ. Dosanti dussanavasena tato balavataraṃ. Appaccayanti atuṭṭhākāraṃ domanassaṃ. Duṭṭhārukoti purāṇavaṇo. Kaṭṭhenāti daṇḍakakoṭiyā. Kaṭhalenāti kapālena. Āsavaṃ detīti aparāparaṃ savati. Purāṇavaṇo hi attano dhammatāyeva pubbaṃ lohitaṃ yūsanti imāni tīṇi savati, ghaṭṭito pana tāni adhikataraṃ savati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evameva"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kho"
      },
      "ti ettha idaṃ opammasaṃsandanaṃ – duṭṭhāruko viya hi kodhanapuggalo, tassa attano dhammatāya savanaṃ viya kodhanassapi attano dhammatāya uddhumātassa viya caṇḍikatassa caraṇaṃ, kaṭṭhena vā kaṭhalāya vā ghaṭṭanaṃ viya appamattaṃ vacanaṃ, bhiyyosomattāya savanaṃ viya ‘‘mādisaṃ nāma esa evaṃ vadatī’’ti bhiyyosomattāya uddhumāyanabhāvo daṭṭhabbo."
    ],
    "innerText": "Evamevakhoti ettha idaṃ opammasaṃsandanaṃ – duṭṭhāruko viya hi kodhanapuggalo, tassa attano dhammatāya savanaṃ viya kodhanassapi attano dhammatāya uddhumātassa viya caṇḍikatassa caraṇaṃ, kaṭṭhena vā kaṭhalāya vā ghaṭṭanaṃ viya appamattaṃ vacanaṃ, bhiyyosomattāya savanaṃ viya ‘‘mādisaṃ nāma esa evaṃ vadatī’’ti bhiyyosomattāya uddhumāyanabhāvo daṭṭhabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rattandhakāratimisāya"
      },
      "nti rattiṃ cakkhuviññāṇuppattinivāraṇena andhabhāvakaraṇe bahalatame. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vijjantarikāyā"
      },
      "ti vijjuppattikkhaṇe. Idhāpi idaṃ opammasaṃsandanaṃ – cakkhumā puriso viya hi yogāvacaro daṭṭhabbo, andhakāraṃ viya sotāpattimaggavajjhā kilesā, vijjusañcaraṇaṃ viya sotāpattimaggañāṇassa uppattikālo, vijjantarikāya cakkhumato purisassa samantā rūpadassanaṃ viya ",
      " sotāpattimaggakkhaṇe nibbānadassanaṃ, puna andhakārāvattharaṇaṃ viya sakadāgāmimaggavajjhā kilesā, puna vijjusañcaraṇaṃ viya sakadāgāmimaggañāṇassa uppādo, vijjantarikāya cakkhumato purisassa samantā rūpadassanaṃ viya sakadāgāmimaggakkhaṇe nibbānadassanaṃ, puna andhakārāvattharaṇaṃ viya anāgāmimaggavajjhā kilesā, puna vijjusañcaraṇaṃ viya anāgāmimaggañāṇassa uppādo, vijjantarikāya cakkhumato purisassa samantā rūpadassanaṃ viya anāgāmimaggakkhaṇe nibbānadassanaṃ veditabbaṃ."
    ],
    "innerText": "Rattandhakāratimisāyanti rattiṃ cakkhuviññāṇuppattinivāraṇena andhabhāvakaraṇe bahalatame. Vijjantarikāyāti vijjuppattikkhaṇe. Idhāpi idaṃ opammasaṃsandanaṃ – cakkhumā puriso viya hi yogāvacaro daṭṭhabbo, andhakāraṃ viya sotāpattimaggavajjhā kilesā, vijjusañcaraṇaṃ viya sotāpattimaggañāṇassa uppattikālo, vijjantarikāya cakkhumato purisassa samantā rūpadassanaṃ viya sotāpattimaggakkhaṇe nibbānadassanaṃ, puna andhakārāvattharaṇaṃ viya sakadāgāmimaggavajjhā kilesā, puna vijjusañcaraṇaṃ viya sakadāgāmimaggañāṇassa uppādo, vijjantarikāya cakkhumato purisassa samantā rūpadassanaṃ viya sakadāgāmimaggakkhaṇe nibbānadassanaṃ, puna andhakārāvattharaṇaṃ viya anāgāmimaggavajjhā kilesā, puna vijjusañcaraṇaṃ viya anāgāmimaggañāṇassa uppādo, vijjantarikāya cakkhumato purisassa samantā rūpadassanaṃ viya anāgāmimaggakkhaṇe nibbānadassanaṃ veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vajirūpamacittatāyapi"
      },
      " idaṃ opammasaṃsandanaṃ – vajiraṃ viya hi arahattamaggañāṇaṃ daṭṭhabbaṃ, maṇigaṇṭhipāsāṇagaṇṭhi viya arahattamaggavajjhā kilesā, vajirassa maṇigaṇṭhimpi vā pāsāṇagaṇṭhimpi vā vinivijjhitvā agamanabhāvassa natthitā viya arahattamaggañāṇena acchejjānaṃ kilesānaṃ natthibhāvo, vajirena nibbiddhavedhassa puna apatipūraṇaṃ viya arahattamaggena chinnānaṃ kilesānaṃ puna anuppādo daṭṭhabboti."
    ],
    "innerText": "Vajirūpamacittatāyapi idaṃ opammasaṃsandanaṃ – vajiraṃ viya hi arahattamaggañāṇaṃ daṭṭhabbaṃ, maṇigaṇṭhipāsāṇagaṇṭhi viya arahattamaggavajjhā kilesā, vajirassa maṇigaṇṭhimpi vā pāsāṇagaṇṭhimpi vā vinivijjhitvā agamanabhāvassa natthitā viya arahattamaggañāṇena acchejjānaṃ kilesānaṃ natthibhāvo, vajirena nibbiddhavedhassa puna apatipūraṇaṃ viya arahattamaggena chinnānaṃ kilesānaṃ puna anuppādo daṭṭhabboti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Sevitabbasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "26"
      },
      ". Chaṭṭhe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sevitabbo"
      },
      "ti upasaṅkamitabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhajitabbo"
      },
      "ti allīyitabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Payirupāsitabbo"
      },
      "ti santike nisīdanavasena punappunaṃ upāsitabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sakkatvā garuṃ katvā"
      },
      "ti sakkārañceva garukārañca katvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hīno hoti sīlenā"
      },
      "tiādīsu upādāyupādāya hīnatā veditabbā. Tattha yo hi pañca sīlāni rakkhati, so dasa sīlāni rakkhantena na sevitabbo ",
      ". Yo dasa sīlāni rakkhati, so catupārisuddhisīlaṃ rakkhantena na sevitabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aññatra anuddayā aññatra anukampā"
      },
      "ti ṭhapetvā anuddayañca anukampañca. Attano atthāyeva hi evarūpo puggalo na sevitabbo, anuddayānukampāvasena pana taṃ upasaṅkamituṃ vaṭṭati."
    ],
    "innerText": "26. Chaṭṭhe sevitabboti upasaṅkamitabbo. Bhajitabboti allīyitabbo. Payirupāsitabboti santike nisīdanavasena punappunaṃ upāsitabbo. Sakkatvā garuṃ katvāti sakkārañceva garukārañca katvā. Hīno hoti sīlenātiādīsu upādāyupādāya hīnatā veditabbā. Tattha yo hi pañca sīlāni rakkhati, so dasa sīlāni rakkhantena na sevitabbo . Yo dasa sīlāni rakkhati, so catupārisuddhisīlaṃ rakkhantena na sevitabbo. Aññatra anuddayā aññatra anukampāti ṭhapetvā anuddayañca anukampañca. Attano atthāyeva hi evarūpo puggalo na sevitabbo, anuddayānukampāvasena pana taṃ upasaṅkamituṃ vaṭṭati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sīlasāmaññagatānaṃ sata"
      },
      "nti sīlena samānabhāvaṃ gatānaṃ santānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sīlakathā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ca no bhavissatī"
      },
      "ti evaṃ samānasīlānaṃ amhākaṃ sīlameva ārabbha kathā bhavissati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sā ca no pavattinī bhavissatī"
      },
      "ti sā ca amhākaṃ kathā divasampi kathentānaṃ pavattissati na paṭihaññissati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sā ca no phāsu bhavissatī"
      },
      "ti sā ca divasampi pavattamānā sīlakathā amhākaṃ phāsuvihāro sukhavihāro bhavissati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samādhipaññākathāsu"
      },
      "pi eseva nayo."
    ],
    "innerText": "Sīlasāmaññagatānaṃ satanti sīlena samānabhāvaṃ gatānaṃ santānaṃ. Sīlakathāca no bhavissatīti evaṃ samānasīlānaṃ amhākaṃ sīlameva ārabbha kathā bhavissati. Sā ca no pavattinī bhavissatīti sā ca amhākaṃ kathā divasampi kathentānaṃ pavattissati na paṭihaññissati. Sā ca no phāsu bhavissatīti sā ca divasampi pavattamānā sīlakathā amhākaṃ phāsuvihāro sukhavihāro bhavissati. Samādhipaññākathāsupi eseva nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sīlakkhandha"
      },
      "nti sīlarāsiṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tattha tattha paññāya anuggahessāmī"
      },
      "ti ettha sīlassa asappāye anupakāradhamme vajjetvā sappāye upakāradhamme sevanto tasmiṃ tasmiṃ ṭhāne sīlakkhandhaṃ paññāya anuggaṇhāti nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samādhipaññākkhandhesu"
      },
      "pi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nihīyatī"
      },
      "ti attano hīnataraṃ puggalaṃ sevanto khāraparissāvane āsittaudakaṃ viya satataṃ samitaṃ hāyati parihāyati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tulyasevī"
      },
      "ti attanā samānasevī. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Seṭṭhamupanama"
      },
      "nti seṭṭhaṃ ",
      " puggalaṃ oṇamanto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Udeti khippa"
      },
      "nti khippameva vaḍḍhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasmā attano uttariṃ bhajethā"
      },
      "ti yasmā seṭṭhaṃ puggalaṃ upanamanto udeti khippaṃ, tasmā attano uttaritaraṃ visiṭṭhataraṃ bhajetha."
    ],
    "innerText": "Sīlakkhandhanti sīlarāsiṃ. Tattha tattha paññāya anuggahessāmīti ettha sīlassa asappāye anupakāradhamme vajjetvā sappāye upakāradhamme sevanto tasmiṃ tasmiṃ ṭhāne sīlakkhandhaṃ paññāya anuggaṇhāti nāma. Samādhipaññākkhandhesupi eseva nayo. Nihīyatīti attano hīnataraṃ puggalaṃ sevanto khāraparissāvane āsittaudakaṃ viya satataṃ samitaṃ hāyati parihāyati. Tulyasevīti attanā samānasevī. Seṭṭhamupanamanti seṭṭhaṃ puggalaṃ oṇamanto. Udeti khippanti khippameva vaḍḍhati. Tasmā attano uttariṃ bhajethāti yasmā seṭṭhaṃ puggalaṃ upanamanto udeti khippaṃ, tasmā attano uttaritaraṃ visiṭṭhataraṃ bhajetha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Jigucchitabbasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "27"
      },
      ". Sattame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jigucchitabbo"
      },
      "ti gūthaṃ viya jigucchitabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atha kho na"
      },
      "nti atha kho assa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kittisaddo"
      },
      "ti kathāsaddo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evameva kho"
      },
      "ti ettha gūthakūpo viya dussīlyaṃ daṭṭhabbaṃ. Gūthakūpe patitvā ṭhito dhammaniahi viya dussīlapuggalo. Gūthakūpato uddhariyamānena tena ahinā purisassa sarīraṃ āruḷhenāpi adaṭṭhabhāvo viya dussīlaṃ sevamānassāpi tassa kiriyāya akaraṇabhāvo. Sarīraṃ gūthena makkhetvā ",
      " ahinā gatakālo viya dussīlaṃ sevamānassa pāpakittisaddaabbhuggamanakālo veditabbo."
    ],
    "innerText": "27. Sattame jigucchitabboti gūthaṃ viya jigucchitabbo. Atha kho nanti atha kho assa. Kittisaddoti kathāsaddo. Evameva khoti ettha gūthakūpo viya dussīlyaṃ daṭṭhabbaṃ. Gūthakūpe patitvā ṭhito dhammaniahi viya dussīlapuggalo. Gūthakūpato uddhariyamānena tena ahinā purisassa sarīraṃ āruḷhenāpi adaṭṭhabhāvo viya dussīlaṃ sevamānassāpi tassa kiriyāya akaraṇabhāvo. Sarīraṃ gūthena makkhetvā ahinā gatakālo viya dussīlaṃ sevamānassa pāpakittisaddaabbhuggamanakālo veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tindukālāta"
      },
      "nti tindukarukkhaalātaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhiyyosomattāya cicciṭāyatī"
      },
      "ti taṃ hi jhāyamānaṃ pakatiyāpi ",
      " papaṭikāyo muñcantaṃ cicciṭāti ‘‘ciṭiciṭā’’ti saddaṃ karoti, ghaṭṭitaṃ pana adhimattaṃ karotīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evameva kho"
      },
      "ti evamevaṃ kodhano attano dhammatāyapi uddhato caṇḍikato hutvā carati, appamattakaṃ pana vacanaṃ sutakāle ‘‘mādisaṃ nāma evaṃ vadati evaṃ vadatī’’ti atirekataraṃ uddhato caṇḍikato hutvā carati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gūthakūpo"
      },
      "ti gūthapuṇṇakūpo, gūtharāsiyeva vā. Opammasaṃsandanaṃ panettha purimanayeneva veditabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasmā evarūpo puggalo ajjhupekkhitabbo na sevitabbo"
      },
      "ti yasmā kodhano atiseviyamāno atiupasaṅkamiyamānopi kujjhatiyeva, ‘‘kiṃ iminā’’ti paṭikkamantepi kujjhatiyeva. Tasmā palālaggi viya ajjhupekkhitabbo na sevitabbo na bhajitabbo. Kiṃ vuttaṃ hoti? Yo hi palālaggiṃ atiupasaṅkamitvā tappati, tassa sarīraṃ jhāyati. Yo atipaṭikkamitvā tappati, tassa sītaṃ na vūpasammati. Anupasaṅkamitvā apaṭikkamitvā pana majjhattabhāvena tappantassa sītaṃ vūpasammati, tasmā palālaggi viya kodhano puggalo majjhattabhāvena ",
      " ajjhupekkhitabbo, na sevitabbo na bhajitabbo na payirupāsitabbo."
    ],
    "innerText": "Tindukālātanti tindukarukkhaalātaṃ. Bhiyyosomattāya cicciṭāyatīti taṃ hi jhāyamānaṃ pakatiyāpi papaṭikāyo muñcantaṃ cicciṭāti ‘‘ciṭiciṭā’’ti saddaṃ karoti, ghaṭṭitaṃ pana adhimattaṃ karotīti attho. Evameva khoti evamevaṃ kodhano attano dhammatāyapi uddhato caṇḍikato hutvā carati, appamattakaṃ pana vacanaṃ sutakāle ‘‘mādisaṃ nāma evaṃ vadati evaṃ vadatī’’ti atirekataraṃ uddhato caṇḍikato hutvā carati. Gūthakūpoti gūthapuṇṇakūpo, gūtharāsiyeva vā. Opammasaṃsandanaṃ panettha purimanayeneva veditabbaṃ. Tasmā evarūpo puggalo ajjhupekkhitabbo na sevitabboti yasmā kodhano atiseviyamāno atiupasaṅkamiyamānopi kujjhatiyeva, ‘‘kiṃ iminā’’ti paṭikkamantepi kujjhatiyeva. Tasmā palālaggi viya ajjhupekkhitabbo na sevitabbo na bhajitabbo. Kiṃ vuttaṃ hoti? Yo hi palālaggiṃ atiupasaṅkamitvā tappati, tassa sarīraṃ jhāyati. Yo atipaṭikkamitvā tappati, tassa sītaṃ na vūpasammati. Anupasaṅkamitvā apaṭikkamitvā pana majjhattabhāvena tappantassa sītaṃ vūpasammati, tasmā palālaggi viya kodhano puggalo majjhattabhāvena ajjhupekkhitabbo, na sevitabbo na bhajitabbo na payirupāsitabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kalyāṇamitto"
      },
      "ti sucimitto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kalyāṇasahāyo"
      },
      "ti sucisahāyo. Sahāyā nāma sahagāmino saddhiṃcarā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kalyāṇasampavaṅko"
      },
      "ti kalyāṇesu sucipuggalesu sampavaṅko, tanninnatappoṇatappabbhāramānasoti attho."
    ],
    "innerText": "Kalyāṇamittoti sucimitto. Kalyāṇasahāyoti sucisahāyo. Sahāyā nāma sahagāmino saddhiṃcarā. Kalyāṇasampavaṅkoti kalyāṇesu sucipuggalesu sampavaṅko, tanninnatappoṇatappabbhāramānasoti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Gūthabhāṇīsuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "28"
      },
      ". Aṭṭhame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gūthabhāṇī"
      },
      "ti yo gūthaṃ viya duggandhakathaṃ katheti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pupphabhāṇī"
      },
      "ti ",
      " yo pupphāni viya sugandhakathaṃ katheti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Madhubhāṇī"
      },
      "ti yo madhu viya madhurakathaṃ katheti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabhaggato"
      },
      "ti sabhāya ṭhito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parisaggato"
      },
      "ti gāmaparisāya ṭhito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñātimajjhagato"
      },
      "ti ñātīnaṃ majjhe ṭhito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pūgamajjhagato"
      },
      "ti seṇīnaṃ majjhe ṭhito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rājakulamajjhagato"
      },
      "ti rājakulassa majjhe mahāvinicchaye ṭhito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhinīto"
      },
      "ti pucchanatthāyānīto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sakkhipuṭṭho"
      },
      "ti sakkhiṃ katvā pucchito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ehambho purisā"
      },
      "ti ālapanametaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attahetu vā parahetu vā"
      },
      "ti attano vā parassa vā hatthapādādihetu vā dhanahetu vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āmisakiñcikkhahetu vā"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āmisa"
      },
      "nti lañjo adhippeto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kiñcikkha"
      },
      "nti yaṃ vā taṃ vā appamattakaṃ antamaso tittiriyavaṭṭakasappipiṇḍanavanītapiṇḍādimattakassa lañjassa hetūti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sampajānamusā bhāsitā hotī"
      },
      "ti jānantoyeva musāvādaṃ kattā hoti."
    ],
    "innerText": "28. Aṭṭhame gūthabhāṇīti yo gūthaṃ viya duggandhakathaṃ katheti. Pupphabhāṇīti yo pupphāni viya sugandhakathaṃ katheti. Madhubhāṇīti yo madhu viya madhurakathaṃ katheti. Sabhaggatoti sabhāya ṭhito. Parisaggatoti gāmaparisāya ṭhito. Ñātimajjhagatoti ñātīnaṃ majjhe ṭhito. Pūgamajjhagatoti seṇīnaṃ majjhe ṭhito. Rājakulamajjhagatoti rājakulassa majjhe mahāvinicchaye ṭhito. Abhinītoti pucchanatthāyānīto. Sakkhipuṭṭhoti sakkhiṃ katvā pucchito. Ehambho purisāti ālapanametaṃ. Attahetu vā parahetu vāti attano vā parassa vā hatthapādādihetu vā dhanahetu vā. Āmisakiñcikkhahetu vāti ettha āmisanti lañjo adhippeto. Kiñcikkhanti yaṃ vā taṃ vā appamattakaṃ antamaso tittiriyavaṭṭakasappipiṇḍanavanītapiṇḍādimattakassa lañjassa hetūti attho. Sampajānamusā bhāsitā hotīti jānantoyeva musāvādaṃ kattā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nelā"
      },
      "ti ",
      " elaṃ vuccati doso, nāssa elanti nelā, niddosāti attho. ‘‘Nelaṅgo setapacchādo’’ti (udā. 65) ettha vuttasīlaṃ viya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kaṇṇasukhā"
      },
      "ti byañjanamadhuratāya kaṇṇānaṃ sukhā, sūcivijjhanaṃ viya kaṇṇasūlaṃ na janeti. Atthamadhuratāya sakalasarīre kopaṃ ajanetvā pemaṃ janetīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pemanīyā"
      },
      ". Hadayaṃ gacchati appaṭihaññamānā sukhena cittaṃ pavisatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hadayaṅgamā"
      },
      ". Guṇaparipuṇṇatāya pure bhavāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "porī"
      },
      ". Pure saṃvaḍḍhanārī viya sukumārātipi porī. Purassa esātipi porī. Purassa esāti nagaravāsīnaṃ kathāti attho. Nagaravāsino ",
      " hi yuttakathā honti ",
      ", pitimattaṃ pitāti, mātimattaṃ mātāti, bhātimattaṃ bhātāti vadanti. Evarūpī kathā bahuno janassa kantā hotīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bahujanakantā"
      },
      ". Kantabhāveneva bahuno janassa manāpā cittavuddhikarāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bahujanamanāpā"
      },
      "."
    ],
    "innerText": "Nelāti elaṃ vuccati doso, nāssa elanti nelā, niddosāti attho. ‘‘Nelaṅgo setapacchādo’’ti (udā. 65) ettha vuttasīlaṃ viya. Kaṇṇasukhāti byañjanamadhuratāya kaṇṇānaṃ sukhā, sūcivijjhanaṃ viya kaṇṇasūlaṃ na janeti. Atthamadhuratāya sakalasarīre kopaṃ ajanetvā pemaṃ janetīti pemanīyā. Hadayaṃ gacchati appaṭihaññamānā sukhena cittaṃ pavisatīti hadayaṅgamā. Guṇaparipuṇṇatāya pure bhavāti porī. Pure saṃvaḍḍhanārī viya sukumārātipi porī. Purassa esātipi porī. Purassa esāti nagaravāsīnaṃ kathāti attho. Nagaravāsino hi yuttakathā honti , pitimattaṃ pitāti, mātimattaṃ mātāti, bhātimattaṃ bhātāti vadanti. Evarūpī kathā bahuno janassa kantā hotīti bahujanakantā. Kantabhāveneva bahuno janassa manāpā cittavuddhikarāti bahujanamanāpā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Andhasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "29"
      },
      ". Navame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cakkhu na hotī"
      },
      "ti paññācakkhu na hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Phātiṃ kareyyā"
      },
      "ti phītaṃ vaḍḍhitaṃ kareyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sāvajjānavajje"
      },
      "ti sadosaniddose. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hīnappaṇīte"
      },
      "ti adhamuttame. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kaṇhasukkasappaṭibhāge"
      },
      "ti kaṇhasukkāyeva aññamaññaṃ paṭibāhanato paṭipakkhavasena sappaṭibhāgāti vuccanti. Ayaṃ panettha saṅkhepo – kusale dhamme ‘‘kusalā dhammā’’ti jāneyya, akusale dhamme ‘‘akusalā dhammā’’ti jāneyya. Sāvajjādīsupi eseva nayo. Kaṇhasukkasappaṭibhāgesu pana kaṇhadhamme ‘‘sukkasappaṭibhāgā’’ti jāneyya, sukkadhamme ‘‘kaṇhasappaṭibhāgā’’ti yena paññācakkhunā jāneyya, tathārūpampissa cakkhu na hotīti. Iminā nayena sesavāresupi attho veditabbo."
    ],
    "innerText": "29. Navame cakkhu na hotīti paññācakkhu na hoti. Phātiṃ kareyyāti phītaṃ vaḍḍhitaṃ kareyya. Sāvajjānavajjeti sadosaniddose. Hīnappaṇīteti adhamuttame. Kaṇhasukkasappaṭibhāgeti kaṇhasukkāyeva aññamaññaṃ paṭibāhanato paṭipakkhavasena sappaṭibhāgāti vuccanti. Ayaṃ panettha saṅkhepo – kusale dhamme ‘‘kusalā dhammā’’ti jāneyya, akusale dhamme ‘‘akusalā dhammā’’ti jāneyya. Sāvajjādīsupi eseva nayo. Kaṇhasukkasappaṭibhāgesu pana kaṇhadhamme ‘‘sukkasappaṭibhāgā’’ti jāneyya, sukkadhamme ‘‘kaṇhasappaṭibhāgā’’ti yena paññācakkhunā jāneyya, tathārūpampissa cakkhu na hotīti. Iminā nayena sesavāresupi attho veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na ceva bhogā tathārūpā"
      },
      "ti tathājātikā bhogāpissa na honti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na ca puññāni kubbatī"
      },
      "ti puññāni ca na karoti. Ettāvatā bhoguppādanacakkhuno ca puññakaraṇacakkhuno ca abhāvo vutto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ubhayattha kaliggāho"
      },
      "ti idhaloke ca paraloke cāti ubhayasmimpi aparaddhaggāho, parājayaggāho hotīti attho. Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ubhayattha kaliggāho"
      },
      "ti ubhayesampi diṭṭhadhammikasamparāyikānaṃ atthānaṃ kaliggāho, parājayaggāhoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammādhammenā"
      },
      "ti dasakusalakammapathadhammenapi dasaakusalakammapathaadhammenapi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṭho"
      },
      "ti kerāṭiko. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhogāni pariyesatī"
      },
      "ti bhoge gavesati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Theyyena"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kūṭakammena, musāvādena cūbhaya"
      },
      "nti theyyādīsu ubhayena pariyesatīti attho. Kathaṃ? Theyyena kūṭakammena ca pariyesati, theyyena musāvādena ca pariyesati ",
      ", kūṭakammena musāvādena ca pariyesati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅghātu"
      },
      "nti saṅgharituṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammaladdhehī"
      },
      "ti dasakusalakammapathadhammaṃ akopetvā laddhehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uṭṭhānādhigata"
      },
      "nti vīriyena ",
      " adhigataṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abyagghamānaso"
      },
      "ti nibbicikicchacitto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhaddakaṃ ṭhāna"
      },
      "nti seṭṭhaṃ devaṭṭhānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na socatī"
      },
      "ti yasmiṃ ṭhāne antosokena na socati."
    ],
    "innerText": "Na ceva bhogā tathārūpāti tathājātikā bhogāpissa na honti. Na ca puññāni kubbatīti puññāni ca na karoti. Ettāvatā bhoguppādanacakkhuno ca puññakaraṇacakkhuno ca abhāvo vutto. Ubhayattha kaliggāhoti idhaloke ca paraloke cāti ubhayasmimpi aparaddhaggāho, parājayaggāho hotīti attho. Atha vā ubhayattha kaliggāhoti ubhayesampi diṭṭhadhammikasamparāyikānaṃ atthānaṃ kaliggāho, parājayaggāhoti attho. Dhammādhammenāti dasakusalakammapathadhammenapi dasaakusalakammapathaadhammenapi. Saṭhoti kerāṭiko. Bhogāni pariyesatīti bhoge gavesati. Theyyenakūṭakammena, musāvādena cūbhayanti theyyādīsu ubhayena pariyesatīti attho. Kathaṃ? Theyyena kūṭakammena ca pariyesati, theyyena musāvādena ca pariyesati , kūṭakammena musāvādena ca pariyesati. Saṅghātunti saṅgharituṃ. Dhammaladdhehīti dasakusalakammapathadhammaṃ akopetvā laddhehi. Uṭṭhānādhigatanti vīriyena adhigataṃ. Abyagghamānasoti nibbicikicchacitto. Bhaddakaṃ ṭhānanti seṭṭhaṃ devaṭṭhānaṃ. Na socatīti yasmiṃ ṭhāne antosokena na socati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Avakujjasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "30"
      },
      ". Dasame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avakujjapañño"
      },
      "ti adhomukhapañño. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ucchaṅgapañño"
      },
      "ti ucchaṅgasadisapañño. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puthupañño"
      },
      "ti vitthārikapañño. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ādikalyāṇa"
      },
      "ntiādīsu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ādī"
      },
      "ti pubbapaṭṭhapanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Majjha"
      },
      "nti kathāvemajjhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pariyosāna"
      },
      "nti sanniṭṭhānaṃ. Itissa te dhammaṃ kathentā pubbapaṭṭhapanepi kalyāṇaṃ bhaddakaṃ anavajjameva katvā kathenti, vemajjhepi pariyosānepi. Ettha ca atthi desanāya ādimajjhapariyosānāni, atthi sāsanassa. Tattha desanāya tāva catuppadikagāthāya paṭhamapadaṃ ādi, dve padāni majjhaṃ, avasānapadaṃ pariyosānaṃ. Ekānusandhikassa suttassa nidānaṃ ādi, anusandhi majjhaṃ, idamavocāti appanā pariyosānaṃ. Anekānusandhikassa paṭhamo anusandhi ādi, tato paraṃ eko vā aneke vā majjhaṃ, pacchimo pariyosānaṃ. Ayaṃ tāva desanāya nayo. Sāsanassa pana sīlaṃ ādi, samādhi majjhaṃ, vipassanā pariyosānaṃ. Samādhi vā ādi, vipassanā majjhaṃ, maggo pariyosānaṃ. Vipassanā vā ādi, maggo majjhaṃ, phalaṃ pariyosānaṃ. Maggo vā ādi, phalaṃ majjhaṃ, nibbānaṃ pariyosānaṃ. Dve dve vā kayiramāne sīlasamādhayo ādi, vipassanāmaggā majjhaṃ, phalanibbānāni pariyosānaṃ."
    ],
    "innerText": "30. Dasame avakujjapaññoti adhomukhapañño. Ucchaṅgapaññoti ucchaṅgasadisapañño. Puthupaññoti vitthārikapañño. Ādikalyāṇantiādīsu ādīti pubbapaṭṭhapanā. Majjhanti kathāvemajjhaṃ. Pariyosānanti sanniṭṭhānaṃ. Itissa te dhammaṃ kathentā pubbapaṭṭhapanepi kalyāṇaṃ bhaddakaṃ anavajjameva katvā kathenti, vemajjhepi pariyosānepi. Ettha ca atthi desanāya ādimajjhapariyosānāni, atthi sāsanassa. Tattha desanāya tāva catuppadikagāthāya paṭhamapadaṃ ādi, dve padāni majjhaṃ, avasānapadaṃ pariyosānaṃ. Ekānusandhikassa suttassa nidānaṃ ādi, anusandhi majjhaṃ, idamavocāti appanā pariyosānaṃ. Anekānusandhikassa paṭhamo anusandhi ādi, tato paraṃ eko vā aneke vā majjhaṃ, pacchimo pariyosānaṃ. Ayaṃ tāva desanāya nayo. Sāsanassa pana sīlaṃ ādi, samādhi majjhaṃ, vipassanā pariyosānaṃ. Samādhi vā ādi, vipassanā majjhaṃ, maggo pariyosānaṃ. Vipassanā vā ādi, maggo majjhaṃ, phalaṃ pariyosānaṃ. Maggo vā ādi, phalaṃ majjhaṃ, nibbānaṃ pariyosānaṃ. Dve dve vā kayiramāne sīlasamādhayo ādi, vipassanāmaggā majjhaṃ, phalanibbānāni pariyosānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sāttha"
      },
      "nti ",
      " sātthakaṃ katvā desenti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabyañjana"
      },
      "nti akkharapāripūriṃ katvā desenti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kevalaparipuṇṇa"
      },
      "nti sakalaparipuṇṇaṃ anūnaṃ katvā desenti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parisuddha"
      },
      "nti parisuddhaṃ nijjaṭaṃ niggaṇṭhiṃ katvā desenti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Brahmacariyaṃ pakāsentī"
      },
      "ti evaṃ desentā ca seṭṭhacariyabhūtaṃ sikkhattayasaṅgahitaṃ ariyaṃ aṭṭhaṅgikaṃ maggaṃ pakāsenti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Neva ādiṃ manasi karotī"
      },
      "ti neva pubbapaṭṭhapanaṃ manasi karoti."
    ],
    "innerText": "Sātthanti sātthakaṃ katvā desenti. Sabyañjananti akkharapāripūriṃ katvā desenti. Kevalaparipuṇṇanti sakalaparipuṇṇaṃ anūnaṃ katvā desenti. Parisuddhanti parisuddhaṃ nijjaṭaṃ niggaṇṭhiṃ katvā desenti. Brahmacariyaṃ pakāsentīti evaṃ desentā ca seṭṭhacariyabhūtaṃ sikkhattayasaṅgahitaṃ ariyaṃ aṭṭhaṅgikaṃ maggaṃ pakāsenti. Neva ādiṃ manasi karotīti neva pubbapaṭṭhapanaṃ manasi karoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kumbho"
      },
      "ti ghaṭo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nikujjo"
      },
      "ti adhomukho ṭhapito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evameva kho"
      },
      "ti ettha kumbho nikujjo viya avakujjapañño puggalo daṭṭhabbo, udakāsiñcanakālo ",
      " viya dhammadesanāya laddhakālo, udakassa ",
      " vivaṭṭanakālo viya tasmiṃ āsane nisinnassa uggahetuṃ asamatthakālo, udakassa asaṇṭhānakālo viya vuṭṭhahitvā asallakkhaṇakālo veditabbo."
    ],
    "innerText": "Kumbhoti ghaṭo. Nikujjoti adhomukho ṭhapito. Evameva khoti ettha kumbho nikujjo viya avakujjapañño puggalo daṭṭhabbo, udakāsiñcanakālo viya dhammadesanāya laddhakālo, udakassa vivaṭṭanakālo viya tasmiṃ āsane nisinnassa uggahetuṃ asamatthakālo, udakassa asaṇṭhānakālo viya vuṭṭhahitvā asallakkhaṇakālo veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ākiṇṇānī"
      },
      "ti pakkhittāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Satisammosāya pakireyyā"
      },
      "ti muṭṭhassatitāya vikireyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evameva kho"
      },
      "ti ettha ucchaṅgo viya ucchaṅgapañño puggalo daṭṭhabbo, nānākhajjakāni viya nānappakāraṃ buddhavacanaṃ, ucchaṅge nānākhajjakāni khādantassa nisinnakālo viya tasmiṃ āsane nisinnassa uggaṇhanakālo, vuṭṭhahantassa satisammosā pakiraṇakālo viya tasmā āsanā vuṭṭhāya gacchantassa asallakkhaṇakālo veditabbo."
    ],
    "innerText": "Ākiṇṇānīti pakkhittāni. Satisammosāya pakireyyāti muṭṭhassatitāya vikireyya. Evameva khoti ettha ucchaṅgo viya ucchaṅgapañño puggalo daṭṭhabbo, nānākhajjakāni viya nānappakāraṃ buddhavacanaṃ, ucchaṅge nānākhajjakāni khādantassa nisinnakālo viya tasmiṃ āsane nisinnassa uggaṇhanakālo, vuṭṭhahantassa satisammosā pakiraṇakālo viya tasmā āsanā vuṭṭhāya gacchantassa asallakkhaṇakālo veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ukkujjo"
      },
      "ti uparimukho ṭhapito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṇṭhātī"
      },
      "ti patiṭṭhahati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evameva kho"
      },
      "ti ettha uparimukho ṭhapito kumbho viya puthupañño puggalo daṭṭhabbo, udakassa āsittakālo viya desanāya ",
      " laddhakālo, udakassa saṇṭhānakālo viya tattha nisinnassa uggaṇhanakālo, no vivaṭṭanakālo viya vuṭṭhāya gacchantassa sallakkhaṇakālo veditabbo."
    ],
    "innerText": "Ukkujjoti uparimukho ṭhapito. Saṇṭhātīti patiṭṭhahati. Evameva khoti ettha uparimukho ṭhapito kumbho viya puthupañño puggalo daṭṭhabbo, udakassa āsittakālo viya desanāya laddhakālo, udakassa saṇṭhānakālo viya tattha nisinnassa uggaṇhanakālo, no vivaṭṭanakālo viya vuṭṭhāya gacchantassa sallakkhaṇakālo veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dummedho"
      },
      "ti nippañño. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avicakkhaṇo"
      },
      "ti saṃvidahanapaññāya rahito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gantā"
      },
      "ti gamanasīlo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Seyyo etena vuccatī"
      },
      "ti etasmā puggalā uttaritaroti vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammānudhammappaṭipanno"
      },
      "ti navalokuttaradhammassa anudhammaṃ saha sīlena pubbabhāgapaṭipadaṃ paṭipanno. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dukkhassā"
      },
      "ti vaṭṭadukkhassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Antakaro siyā"
      },
      "ti koṭikaro paricchedakaro parivaṭumakaro bhaveyyāti."
    ],
    "innerText": "Dummedhoti nippañño. Avicakkhaṇoti saṃvidahanapaññāya rahito. Gantāti gamanasīlo. Seyyo etena vuccatīti etasmā puggalā uttaritaroti vuccati. Dhammānudhammappaṭipannoti navalokuttaradhammassa anudhammaṃ saha sīlena pubbabhāgapaṭipadaṃ paṭipanno. Dukkhassāti vaṭṭadukkhassa. Antakaro siyāti koṭikaro paricchedakaro parivaṭumakaro bhaveyyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Puggalavaggo tatiyo."
  }
]