[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "(26) 6. Abhiññāvaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Abhiññāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "254"
      },
      ". ‘‘Cattārome ",
      ", bhikkhave, dhammā. Katame cattāro? Atthi, bhikkhave, dhammā abhiññā pariññeyyā; atthi, bhikkhave ",
      ", dhammā abhiññā pahātabbā; atthi, bhikkhave, dhammā abhiññā bhāvetabbā; atthi, bhikkhave, dhammā abhiññā sacchikātabbā."
    ],
    "innerText": "254. ‘‘Cattārome , bhikkhave, dhammā. Katame cattāro? Atthi, bhikkhave, dhammā abhiññā pariññeyyā; atthi, bhikkhave , dhammā abhiññā pahātabbā; atthi, bhikkhave, dhammā abhiññā bhāvetabbā; atthi, bhikkhave, dhammā abhiññā sacchikātabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katame ca, bhikkhave, dhammā abhiññā pariññeyyā? Pañcupādānakkhandhā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pañcupādānakkhandhātissa vacanīyaṃ (ka.)]"
      },
      " – ime vuccanti, bhikkhave ",
      ", dhammā abhiññā pariññeyyā."
    ],
    "innerText": "‘‘Katame ca, bhikkhave, dhammā abhiññā pariññeyyā? Pañcupādānakkhandhā [pañcupādānakkhandhātissa vacanīyaṃ (ka.)] – ime vuccanti, bhikkhave , dhammā abhiññā pariññeyyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katame ca, bhikkhave, dhammā abhiññā pahātabbā? Avijjā ca bhavataṇhā ca – ime vuccanti, bhikkhave, dhammā abhiññā pahātabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katame ca, bhikkhave, dhammā abhiññā bhāvetabbā? Samatho ca vipassanā ca – ime vuccanti, bhikkhave, dhammā abhiññā bhāvetabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katame ca, bhikkhave, dhammā abhiññā sacchikātabbā? Vijjā ca vimutti ca – ime vuccanti, bhikkhave, dhammā abhiññā sacchikātabbā. Ime kho, bhikkhave, cattāro dhammā’’ti. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Pariyesanāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "255"
      },
      ". ‘‘Catasso imā, bhikkhave, anariyapariyesanā. Katamā catasso? Idha, bhikkhave, ekacco attanā jarādhammo samāno jarādhammaṃyeva pariyesati; attanā byādhidhammo samāno byādhidhammaṃyeva pariyesati; attanā maraṇadhammo samāno maraṇadhammaṃyeva pariyesati; attanā ",
      " saṃkilesadhammo samāno saṃkilesadhammaṃyeva pariyesati. Imā kho, bhikkhave, catasso anariyapariyesanā."
    ],
    "innerText": "255. ‘‘Catasso imā, bhikkhave, anariyapariyesanā. Katamā catasso? Idha, bhikkhave, ekacco attanā jarādhammo samāno jarādhammaṃyeva pariyesati; attanā byādhidhammo samāno byādhidhammaṃyeva pariyesati; attanā maraṇadhammo samāno maraṇadhammaṃyeva pariyesati; attanā saṃkilesadhammo samāno saṃkilesadhammaṃyeva pariyesati. Imā kho, bhikkhave, catasso anariyapariyesanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Catasso imā, bhikkhave, ariyapariyesanā. Katamā catasso? Idha, bhikkhave, ekacco attanā jarādhammo samāno jarādhamme ādīnavaṃ viditvā ajaraṃ anuttaraṃ yogakkhemaṃ nibbānaṃ pariyesati; attanā byādhidhammo samāno byādhidhamme ādīnavaṃ viditvā abyādhiṃ anuttaraṃ yogakkhemaṃ ",
      " nibbānaṃ pariyesati; attanā maraṇadhammo samāno maraṇadhamme ādīnavaṃ viditvā amataṃ anuttaraṃ yogakkhemaṃ nibbānaṃ pariyesati; attanā saṃkilesadhammo samāno saṃkilesadhamme ādīnavaṃ ",
      " viditvā asaṃkiliṭṭhaṃ anuttaraṃ yogakkhemaṃ nibbānaṃ pariyesati. Imā kho, bhikkhave ",
      ", catasso ariyapariyesanā’’ti. Dutiyaṃ."
    ],
    "innerText": "‘‘Catasso imā, bhikkhave, ariyapariyesanā. Katamā catasso? Idha, bhikkhave, ekacco attanā jarādhammo samāno jarādhamme ādīnavaṃ viditvā ajaraṃ anuttaraṃ yogakkhemaṃ nibbānaṃ pariyesati; attanā byādhidhammo samāno byādhidhamme ādīnavaṃ viditvā abyādhiṃ anuttaraṃ yogakkhemaṃ nibbānaṃ pariyesati; attanā maraṇadhammo samāno maraṇadhamme ādīnavaṃ viditvā amataṃ anuttaraṃ yogakkhemaṃ nibbānaṃ pariyesati; attanā saṃkilesadhammo samāno saṃkilesadhamme ādīnavaṃ viditvā asaṃkiliṭṭhaṃ anuttaraṃ yogakkhemaṃ nibbānaṃ pariyesati. Imā kho, bhikkhave , catasso ariyapariyesanā’’ti. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Saṅgahavatthusuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "256"
      },
      ". ‘‘Cattārimāni, bhikkhave, saṅgahavatthūni. Katamāni cattāri? Dānaṃ, peyyavajjaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[piyavācā (ka.) a. ni. 4.32 passitabbaṃ]"
      },
      ", atthacariyā, samānattatā – imāni kho, bhikkhave, cattāri saṅgahavatthūnī’’ti."
    ],
    "innerText": "256. ‘‘Cattārimāni, bhikkhave, saṅgahavatthūni. Katamāni cattāri? Dānaṃ, peyyavajjaṃ [piyavācā (ka.) a. ni. 4.32 passitabbaṃ], atthacariyā, samānattatā – imāni kho, bhikkhave, cattāri saṅgahavatthūnī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Mālukyaputtasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "257"
      },
      ". Atha kho āyasmā mālukyaputto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[māluṅkyaputto (sī. syā. kaṃ. pī.)]"
      },
      " yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā mālukyaputto bhagavantaṃ etadavoca –"
    ],
    "innerText": "257. Atha kho āyasmā mālukyaputto [māluṅkyaputto (sī. syā. kaṃ. pī.)] yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā mālukyaputto bhagavantaṃ etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sādhu me, bhante, bhagavā saṃkhittena dhammaṃ desetu, yamahaṃ bhagavato dhammaṃ sutvā eko vūpakaṭṭho appamatto ātāpī pahitatto vihareyya’’nti. ‘‘Ettha idāni, mālukyaputta, kiṃ dahare bhikkhū vakkhāma; yatra hi nāma tvaṃ jiṇṇo vuddho mahallako tathāgatassa saṃkhittena ovādaṃ yācasī’’ti! ‘‘Desetu me, bhante, bhagavā saṃkhittena dhammaṃ; desetu sugato saṃkhittena dhammaṃ. Appeva nāmāhaṃ bhagavato bhāsitassa atthaṃ ājāneyyaṃ; appeva nāmāhaṃ bhagavato bhāsitassa dāyādo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[bhagavato sāvako (ka.)]"
      },
      " assa’’nti."
    ],
    "innerText": "‘‘Sādhu me, bhante, bhagavā saṃkhittena dhammaṃ desetu, yamahaṃ bhagavato dhammaṃ sutvā eko vūpakaṭṭho appamatto ātāpī pahitatto vihareyya’’nti. ‘‘Ettha idāni, mālukyaputta, kiṃ dahare bhikkhū vakkhāma; yatra hi nāma tvaṃ jiṇṇo vuddho mahallako tathāgatassa saṃkhittena ovādaṃ yācasī’’ti! ‘‘Desetu me, bhante, bhagavā saṃkhittena dhammaṃ; desetu sugato saṃkhittena dhammaṃ. Appeva nāmāhaṃ bhagavato bhāsitassa atthaṃ ājāneyyaṃ; appeva nāmāhaṃ bhagavato bhāsitassa dāyādo [bhagavato sāvako (ka.)] assa’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Cattārome ",
      ", mālukyaputta, taṇhuppādā yattha bhikkhuno taṇhā uppajjamānā uppajjati. Katame cattāro? Cīvarahetu vā, mālukyaputta, bhikkhuno taṇhā uppajjamānā uppajjati. Piṇḍapātahetu vā, mālukyaputta, bhikkhuno taṇhā uppajjamānā uppajjati. Senāsanahetu vā, mālukyaputta, bhikkhuno taṇhā uppajjamānā uppajjati. Itibhavābhavahetu vā, mālukyaputta, bhikkhuno taṇhā uppajjamānā uppajjati. Ime ",
      " kho, mālukyaputta, cattāro taṇhuppādā yattha bhikkhuno taṇhā uppajjamānā uppajjati. Yato ",
      " kho, mālukyaputta ",
      ", bhikkhuno taṇhā pahīnā hoti ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā, ayaṃ vuccati, mālukyaputta, ‘bhikkhu acchecchi taṇhaṃ, vivattayi saṃyojanaṃ, sammā mānābhisamayā antamakāsi dukkhassā’’’ti."
    ],
    "innerText": "‘‘Cattārome , mālukyaputta, taṇhuppādā yattha bhikkhuno taṇhā uppajjamānā uppajjati. Katame cattāro? Cīvarahetu vā, mālukyaputta, bhikkhuno taṇhā uppajjamānā uppajjati. Piṇḍapātahetu vā, mālukyaputta, bhikkhuno taṇhā uppajjamānā uppajjati. Senāsanahetu vā, mālukyaputta, bhikkhuno taṇhā uppajjamānā uppajjati. Itibhavābhavahetu vā, mālukyaputta, bhikkhuno taṇhā uppajjamānā uppajjati. Ime kho, mālukyaputta, cattāro taṇhuppādā yattha bhikkhuno taṇhā uppajjamānā uppajjati. Yato kho, mālukyaputta , bhikkhuno taṇhā pahīnā hoti ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā, ayaṃ vuccati, mālukyaputta, ‘bhikkhu acchecchi taṇhaṃ, vivattayi saṃyojanaṃ, sammā mānābhisamayā antamakāsi dukkhassā’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha kho āyasmā mālukyaputto bhagavatā iminā ovādena ovadito uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi. Atha kho āyasmā mālukyaputto eko vūpakaṭṭho appamatto ātāpī pahitatto viharanto nacirasseva – yassatthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti, tadanuttaraṃ – brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihāsi. ‘‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’’ti abbhaññāsi. Aññataro ca panāyasmā mālukyaputto arahataṃ ahosīti. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Kulasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "258"
      },
      ". ‘‘Yāni kānici, bhikkhave, kulāni bhogesu mahattaṃ pattāni na ciraṭṭhitikāni bhavanti, sabbāni tāni catūhi ṭhānehi, etesaṃ vā aññatarena. Katamehi catūhi? Naṭṭhaṃ na gavesanti, jiṇṇaṃ na paṭisaṅkharonti, aparimitapānabhojanā honti, dussīlaṃ itthiṃ vā purisaṃ vā ādhipacce ṭhapenti. Yāni kānici, bhikkhave, kulāni bhogesu mahattaṃ pattāni na ciraṭṭhitikāni bhavanti, sabbāni tāni imehi catūhi ṭhānehi ",
      ", etesaṃ vā aññatarena."
    ],
    "innerText": "258. ‘‘Yāni kānici, bhikkhave, kulāni bhogesu mahattaṃ pattāni na ciraṭṭhitikāni bhavanti, sabbāni tāni catūhi ṭhānehi, etesaṃ vā aññatarena. Katamehi catūhi? Naṭṭhaṃ na gavesanti, jiṇṇaṃ na paṭisaṅkharonti, aparimitapānabhojanā honti, dussīlaṃ itthiṃ vā purisaṃ vā ādhipacce ṭhapenti. Yāni kānici, bhikkhave, kulāni bhogesu mahattaṃ pattāni na ciraṭṭhitikāni bhavanti, sabbāni tāni imehi catūhi ṭhānehi , etesaṃ vā aññatarena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yāni kānici, bhikkhave, kulāni bhogesu mahattaṃ pattāni ciraṭṭhitikāni bhavanti, sabbāni ",
      " tāni catūhi ṭhānehi, etesaṃ vā aññatarena. Katamehi catūhi? Naṭṭhaṃ gavesanti, jiṇṇaṃ paṭisaṅkharonti, parimitapānabhojanā honti, sīlavantaṃ itthiṃ vā purisaṃ vā ādhipacce ṭhapenti. Yāni kānici, bhikkhave, kulāni bhogesu mahattaṃ pattāni ciraṭṭhitikāni bhavanti, sabbāni tāni imehi catūhi ṭhānehi, etesaṃ vā aññatarenā’’ti. Pañcamaṃ."
    ],
    "innerText": "‘‘Yāni kānici, bhikkhave, kulāni bhogesu mahattaṃ pattāni ciraṭṭhitikāni bhavanti, sabbāni tāni catūhi ṭhānehi, etesaṃ vā aññatarena. Katamehi catūhi? Naṭṭhaṃ gavesanti, jiṇṇaṃ paṭisaṅkharonti, parimitapānabhojanā honti, sīlavantaṃ itthiṃ vā purisaṃ vā ādhipacce ṭhapenti. Yāni kānici, bhikkhave, kulāni bhogesu mahattaṃ pattāni ciraṭṭhitikāni bhavanti, sabbāni tāni imehi catūhi ṭhānehi, etesaṃ vā aññatarenā’’ti. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Paṭhamaājānīyasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "259"
      },
      ". ‘‘Catūhi ",
      ", bhikkhave, aṅgehi samannāgato rañño bhadro assājānīyo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhaṃ ",
      " gacchati. Katamehi catūhi? Idha, bhikkhave, rañño bhadro assājānīyo vaṇṇasampanno ca hoti balasampanno ca javasampanno ca ārohapariṇāhasampanno ca. Imehi kho, bhikkhave, catūhi aṅgehi samannāgato rañño bhadro assājānīyo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhaṃ gacchati."
    ],
    "innerText": "259. ‘‘Catūhi , bhikkhave, aṅgehi samannāgato rañño bhadro assājānīyo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhaṃ gacchati. Katamehi catūhi? Idha, bhikkhave, rañño bhadro assājānīyo vaṇṇasampanno ca hoti balasampanno ca javasampanno ca ārohapariṇāhasampanno ca. Imehi kho, bhikkhave, catūhi aṅgehi samannāgato rañño bhadro assājānīyo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhaṃ gacchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Evamevaṃ kho, bhikkhave, catūhi dhammehi samannāgato bhikkhu āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassa. Katamehi catūhi? Idha, bhikkhave, bhikkhu vaṇṇasampanno ca hoti balasampanno ca javasampanno ca ārohapariṇāhasampanno ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, bhikkhu vaṇṇasampanno hoti? Idha, bhikkhave, bhikkhu sīlavā hoti…pe… samādāya sikkhati ",
      " sikkhāpadesu. Evaṃ kho, bhikkhave, bhikkhu vaṇṇasampanno hoti."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu vaṇṇasampanno hoti? Idha, bhikkhave, bhikkhu sīlavā hoti…pe… samādāya sikkhati sikkhāpadesu. Evaṃ kho, bhikkhave, bhikkhu vaṇṇasampanno hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu balasampanno hoti? Idha, bhikkhave, bhikkhu āraddhavīriyo viharati akusalānaṃ dhammānaṃ pahānāya, kusalānaṃ dhammānaṃ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. Evaṃ kho, bhikkhave, bhikkhu balasampanno hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, bhikkhu javasampanno hoti? Idha, bhikkhave, bhikkhu ‘idaṃ dukkha’nti ",
      " yathābhūtaṃ pajānāti…pe… ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti. Evaṃ kho, bhikkhave, bhikkhu javasampanno hoti."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu javasampanno hoti? Idha, bhikkhave, bhikkhu ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti…pe… ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti. Evaṃ kho, bhikkhave, bhikkhu javasampanno hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, bhikkhu ārohapariṇāhasampanno hoti? Idha, bhikkhave, bhikkhu lābhī hoti cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārānaṃ. Evaṃ kho, bhikkhave, bhikkhu ārohapariṇāhasampanno hoti ",
      "."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu ārohapariṇāhasampanno hoti? Idha, bhikkhave, bhikkhu lābhī hoti cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārānaṃ. Evaṃ kho, bhikkhave, bhikkhu ārohapariṇāhasampanno hoti ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Imehi kho, bhikkhave, catūhi dhammehi samannāgato bhikkhu āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassā’’ti. Chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Dutiyaājānīyasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "260"
      },
      ". ‘‘Catūhi, bhikkhave, aṅgehi samannāgato rañño bhadro assājānīyo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhaṃ ",
      " gacchati. Katamehi catūhi? Idha, bhikkhave, rañño bhadro assājānīyo vaṇṇasampanno ca hoti, balasampanno ca, javasampanno ca, ārohapariṇāhasampanno ca. Imehi kho, bhikkhave, catūhi aṅgehi samannāgato rañño bhadro assājānīyo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhaṃ gacchati."
    ],
    "innerText": "260. ‘‘Catūhi, bhikkhave, aṅgehi samannāgato rañño bhadro assājānīyo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhaṃ gacchati. Katamehi catūhi? Idha, bhikkhave, rañño bhadro assājānīyo vaṇṇasampanno ca hoti, balasampanno ca, javasampanno ca, ārohapariṇāhasampanno ca. Imehi kho, bhikkhave, catūhi aṅgehi samannāgato rañño bhadro assājānīyo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhaṃ gacchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evamevaṃ kho, bhikkhave, catūhi dhammehi samannāgato ",
      " bhikkhu āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassa. Katamehi catūhi? Idha, bhikkhave, bhikkhu vaṇṇasampanno ca hoti, balasampanno ca, javasampanno ca, ārohapariṇāhasampanno ca."
    ],
    "innerText": "‘‘Evamevaṃ kho, bhikkhave, catūhi dhammehi samannāgato bhikkhu āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassa. Katamehi catūhi? Idha, bhikkhave, bhikkhu vaṇṇasampanno ca hoti, balasampanno ca, javasampanno ca, ārohapariṇāhasampanno ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu vaṇṇasampanno hoti? Idha, bhikkhave, bhikkhu sīlavā hoti…pe… samādāya sikkhati sikkhāpadesu. Evaṃ kho, bhikkhave, bhikkhu vaṇṇasampanno hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, bhikkhu balasampanno hoti? Idha, bhikkhave, bhikkhu āraddhavīriyo viharati akusalānaṃ dhammānaṃ pahānāya, kusalānaṃ dhammānaṃ upasampadāya, thāmavā daḷhaparakkamo ",
      " anikkhittadhuro kusalesu dhammesu. Evaṃ kho, bhikkhave, bhikkhu balasampanno hoti."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu balasampanno hoti? Idha, bhikkhave, bhikkhu āraddhavīriyo viharati akusalānaṃ dhammānaṃ pahānāya, kusalānaṃ dhammānaṃ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. Evaṃ kho, bhikkhave, bhikkhu balasampanno hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu javasampanno hoti? Idha, bhikkhave, bhikkhu āsavānaṃ khayā…pe… sacchikatvā upasampajja viharati. Evaṃ kho, bhikkhave, bhikkhu javasampanno hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, bhikkhu ārohapariṇāhasampanno hoti? Idha, bhikkhave, bhikkhu lābhī hoti cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārānaṃ. Evaṃ kho, bhikkhave ",
      ", bhikkhu ārohapariṇāhasampanno hoti."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu ārohapariṇāhasampanno hoti? Idha, bhikkhave, bhikkhu lābhī hoti cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārānaṃ. Evaṃ kho, bhikkhave , bhikkhu ārohapariṇāhasampanno hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Imehi kho, bhikkhave, catūhi dhammehi samannāgato bhikkhu āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassā’’ti. Sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Balasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "261"
      },
      ". ‘‘Cattārimāni, bhikkhave, balāni. Katamāni cattāri? Vīriyabalaṃ, satibalaṃ, samādhibalaṃ, paññābalaṃ – imāni kho, bhikkhave, cattāri balānī’’ti ",
      ". Aṭṭhamaṃ."
    ],
    "innerText": "261. ‘‘Cattārimāni, bhikkhave, balāni. Katamāni cattāri? Vīriyabalaṃ, satibalaṃ, samādhibalaṃ, paññābalaṃ – imāni kho, bhikkhave, cattāri balānī’’ti . Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Araññasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "262"
      },
      ". ‘‘Catūhi ",
      ", bhikkhave, dhammehi samannāgato bhikkhu nālaṃ araññavanappatthāni pantāni senāsanāni paṭisevituṃ. Katamehi catūhi? Kāmavitakkena, byāpādavitakkena, vihiṃsāvitakkena, duppañño hoti jaḷo elamūgo – imehi kho, bhikkhave, catūhi dhammehi samannāgato bhikkhu nālaṃ araññavanappatthāni pantāni senāsanāni paṭisevituṃ."
    ],
    "innerText": "262. ‘‘Catūhi , bhikkhave, dhammehi samannāgato bhikkhu nālaṃ araññavanappatthāni pantāni senāsanāni paṭisevituṃ. Katamehi catūhi? Kāmavitakkena, byāpādavitakkena, vihiṃsāvitakkena, duppañño hoti jaḷo elamūgo – imehi kho, bhikkhave, catūhi dhammehi samannāgato bhikkhu nālaṃ araññavanappatthāni pantāni senāsanāni paṭisevituṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Catūhi, bhikkhave, dhammehi samannāgato bhikkhu alaṃ araññavanappatthāni pantāni senāsanāni paṭisevituṃ. Katamehi catūhi? Nekkhammavitakkena, abyāpādavitakkena, avihiṃsāvitakkena ",
      ", paññavā hoti ajaḷo anelamūgo – imehi kho, bhikkhave, catūhi dhammehi samannāgato bhikkhu alaṃ araññavanappatthāni pantāni senāsanāni paṭisevitu’’nti. Navamaṃ."
    ],
    "innerText": "‘‘Catūhi, bhikkhave, dhammehi samannāgato bhikkhu alaṃ araññavanappatthāni pantāni senāsanāni paṭisevituṃ. Katamehi catūhi? Nekkhammavitakkena, abyāpādavitakkena, avihiṃsāvitakkena , paññavā hoti ajaḷo anelamūgo – imehi kho, bhikkhave, catūhi dhammehi samannāgato bhikkhu alaṃ araññavanappatthāni pantāni senāsanāni paṭisevitu’’nti. Navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Kammasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "263"
      },
      ". ‘‘Catūhi, bhikkhave, dhammehi samannāgato bālo abyatto asappuriso khataṃ upahataṃ attānaṃ pariharati, sāvajjo ca hoti sānuvajjo viññūnaṃ, bahuñca apuññaṃ pasavati. Katamehi catūhi? Sāvajjena kāyakammena, sāvajjena vacīkammena, sāvajjena manokammena, sāvajjāya diṭṭhiyā – imehi ",
      " kho, bhikkhave, catūhi dhammehi samannāgato bālo abyatto asappuriso khataṃ upahataṃ attānaṃ pariharati, sāvajjo ca hoti sānuvajjo viññūnaṃ, bahuñca apuññaṃ pasavati."
    ],
    "innerText": "263. ‘‘Catūhi, bhikkhave, dhammehi samannāgato bālo abyatto asappuriso khataṃ upahataṃ attānaṃ pariharati, sāvajjo ca hoti sānuvajjo viññūnaṃ, bahuñca apuññaṃ pasavati. Katamehi catūhi? Sāvajjena kāyakammena, sāvajjena vacīkammena, sāvajjena manokammena, sāvajjāya diṭṭhiyā – imehi kho, bhikkhave, catūhi dhammehi samannāgato bālo abyatto asappuriso khataṃ upahataṃ attānaṃ pariharati, sāvajjo ca hoti sānuvajjo viññūnaṃ, bahuñca apuññaṃ pasavati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Catūhi, bhikkhave, dhammehi samannāgato paṇḍito viyatto sappuriso akkhataṃ anupahataṃ attānaṃ pariharati, anavajjo ca hoti ananuvajjo viññūnaṃ, bahuñca puññaṃ pasavati. Katamehi catūhi? Anavajjena kāyakammena, anavajjena ",
      " vacīkammena, anavajjena manokammena, anavajjāya diṭṭhiyā – imehi kho, bhikkhave, catūhi dhammehi samannāgato paṇḍito viyatto sappuriso akkhataṃ anupahataṃ attānaṃ pariharati, anavajjo ca hoti ananuvajjo viññūnaṃ, bahuñca puññaṃ pasavatī’’ti. Dasamaṃ."
    ],
    "innerText": "‘‘Catūhi, bhikkhave, dhammehi samannāgato paṇḍito viyatto sappuriso akkhataṃ anupahataṃ attānaṃ pariharati, anavajjo ca hoti ananuvajjo viññūnaṃ, bahuñca puññaṃ pasavati. Katamehi catūhi? Anavajjena kāyakammena, anavajjena vacīkammena, anavajjena manokammena, anavajjāya diṭṭhiyā – imehi kho, bhikkhave, catūhi dhammehi samannāgato paṇḍito viyatto sappuriso akkhataṃ anupahataṃ attānaṃ pariharati, anavajjo ca hoti ananuvajjo viññūnaṃ, bahuñca puññaṃ pasavatī’’ti. Dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Abhiññāvaggo chaṭṭho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Abhiññā ",
      " pariyesanā, saṅgahaṃ mālukyaputto;"
    ],
    "innerText": "Abhiññā pariyesanā, saṅgahaṃ mālukyaputto;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kulaṃ dve ca ājānīyā, balaṃ araññakammunāti."
  }
]