[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "3. Vinayapeyyālaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "201"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atthavase"
      },
      "ti ",
      " vuddhivisese ānisaṃsavisese. Tesaṃ pana sikkhāpadapaññattikāraṇattā āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘dve kāraṇāni sandhāyā’’"
      },
      "ti. Atthoyeva vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atthavaso,"
      },
      " dve atthe dve kāraṇānīti vuttaṃ hoti. Atha vā attho phalaṃ tadadhīnavuttitāya vaso etassāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atthavaso,"
      },
      " kāraṇanti evampettha attho daṭṭhabbo. Yathā ‘‘anabhijjhā dhammapada’’nti vutte anabhijjhā eko dhammakoṭṭhāsoti attho hoti. Evamidhāpi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sikkhāpada"
      },
      "nti sikkhākoṭṭhāso sikkhāya eko padesoti ayamettha attho daṭṭhabboti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sikkhāpadaṃ paññattanti sikkhākoṭṭhāso ṭhapito’’"
      },
      "ti."
    ],
    "innerText": "201.Atthavaseti vuddhivisese ānisaṃsavisese. Tesaṃ pana sikkhāpadapaññattikāraṇattā āha ‘‘dve kāraṇāni sandhāyā’’ti. Atthoyeva vā atthavaso, dve atthe dve kāraṇānīti vuttaṃ hoti. Atha vā attho phalaṃ tadadhīnavuttitāya vaso etassāti atthavaso, kāraṇanti evampettha attho daṭṭhabbo. Yathā ‘‘anabhijjhā dhammapada’’nti vutte anabhijjhā eko dhammakoṭṭhāsoti attho hoti. Evamidhāpi sikkhāpadanti sikkhākoṭṭhāso sikkhāya eko padesoti ayamettha attho daṭṭhabboti āha ‘‘sikkhāpadaṃ paññattanti sikkhākoṭṭhāso ṭhapito’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅghasuṭṭhu"
      },
      " nāma saṅghassa suṭṭhubhāvo ‘‘suṭṭhu devā’’ti (pārā. aṭṭha. 39) āgataṭṭhāne viya ‘‘suṭṭhu, bhante’’ti vacanasampaṭicchanabhāvo. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘saṅghasuṭṭhutāyāti saṅghassa suṭṭhubhāvāyā’’"
      },
      "tiādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dummaṅkūnaṃ puggalānaṃ niggahāyā"
      },
      "ti dummaṅkū nāma dussīlapuggalā. Ye maṅkutaṃ āpādiyamānāpi dukkhena āpajjanti, vītikkamaṃ karontā vā katvā vā ",
      " na lajjanti, tesaṃ niggahatthāya. Te hi sikkhāpade asati ‘‘kiṃ tumhehi diṭṭhaṃ, kiṃ sutaṃ, kiṃ amhehi kataṃ, katarasmiṃ vatthusmiṃ katamaṃ āpattiṃ ropetvā amhe niggaṇhathā’’ti saṅghaṃ viheṭhessanti, sikkhāpade pana sati tesaṃ saṅgho sikkhāpadaṃ dassetvā dhammena vinayena satthusāsanena niggahessati. Tena vuttaṃ ‘‘dummaṅkūnaṃ puggalānaṃ niggahāyā’’ti."
    ],
    "innerText": "Saṅghasuṭṭhu nāma saṅghassa suṭṭhubhāvo ‘‘suṭṭhu devā’’ti (pārā. aṭṭha. 39) āgataṭṭhāne viya ‘‘suṭṭhu, bhante’’ti vacanasampaṭicchanabhāvo. Tenāha ‘‘saṅghasuṭṭhutāyāti saṅghassa suṭṭhubhāvāyā’’tiādi. Dummaṅkūnaṃ puggalānaṃ niggahāyāti dummaṅkū nāma dussīlapuggalā. Ye maṅkutaṃ āpādiyamānāpi dukkhena āpajjanti, vītikkamaṃ karontā vā katvā vā na lajjanti, tesaṃ niggahatthāya. Te hi sikkhāpade asati ‘‘kiṃ tumhehi diṭṭhaṃ, kiṃ sutaṃ, kiṃ amhehi kataṃ, katarasmiṃ vatthusmiṃ katamaṃ āpattiṃ ropetvā amhe niggaṇhathā’’ti saṅghaṃ viheṭhessanti, sikkhāpade pana sati tesaṃ saṅgho sikkhāpadaṃ dassetvā dhammena vinayena satthusāsanena niggahessati. Tena vuttaṃ ‘‘dummaṅkūnaṃ puggalānaṃ niggahāyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pesalānaṃ bhikkhūnaṃ phāsuvihārāyā"
      },
      "ti pesalānaṃ piyasīlānaṃ bhikkhūnaṃ phāsuvihāratthāya. Piyasīlā hi bhikkhū kattabbākattabbaṃ sāvajjānavajjaṃ velaṃ mariyādaṃ ajānantā sikkhattayapāripūriyā ghaṭamānā kilamanti, ubbāḷhā honti, kattabbākattabbaṃ pana sāvajjānavajjaṃ velaṃ mariyādañca ñatvā sikkhattayapāripūriyā ghaṭentā na kilamanti, na ubbāḷhā honti. Tena tesaṃ sikkhāpadappaññāpanā phāsuvihārāya saṃvattati. Yo vā dummaṅkūnaṃ puggalānaṃ niggaho, sveva etesaṃ phāsuvihāro. Dussīlapuggale nissāya hi uposatho na tiṭṭhati, pavāraṇā na tiṭṭhati, saṅghakammāni nappavattanti, sāmaggī na hoti, bhikkhū anekaggā uddesaparipucchākammaṭṭhānādīni anuyuñjituṃ na sakkonti. Dussīlesu pana niggahitesu sabbopi ayaṃ upaddavo na hoti, tato pesalā bhikkhū phāsu viharanti. Evaṃ ‘‘pesalānaṃ bhikkhūnaṃ phāsuvihārāyā’’ti ettha dvidhā attho veditabbo."
    ],
    "innerText": "Pesalānaṃ bhikkhūnaṃ phāsuvihārāyāti pesalānaṃ piyasīlānaṃ bhikkhūnaṃ phāsuvihāratthāya. Piyasīlā hi bhikkhū kattabbākattabbaṃ sāvajjānavajjaṃ velaṃ mariyādaṃ ajānantā sikkhattayapāripūriyā ghaṭamānā kilamanti, ubbāḷhā honti, kattabbākattabbaṃ pana sāvajjānavajjaṃ velaṃ mariyādañca ñatvā sikkhattayapāripūriyā ghaṭentā na kilamanti, na ubbāḷhā honti. Tena tesaṃ sikkhāpadappaññāpanā phāsuvihārāya saṃvattati. Yo vā dummaṅkūnaṃ puggalānaṃ niggaho, sveva etesaṃ phāsuvihāro. Dussīlapuggale nissāya hi uposatho na tiṭṭhati, pavāraṇā na tiṭṭhati, saṅghakammāni nappavattanti, sāmaggī na hoti, bhikkhū anekaggā uddesaparipucchākammaṭṭhānādīni anuyuñjituṃ na sakkonti. Dussīlesu pana niggahitesu sabbopi ayaṃ upaddavo na hoti, tato pesalā bhikkhū phāsu viharanti. Evaṃ ‘‘pesalānaṃ bhikkhūnaṃ phāsuvihārāyā’’ti ettha dvidhā attho veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Na ",
      " vo ahaṃ, cunda, diṭṭhadhammikānaṃyeva āsavānaṃ saṃvarāya dhammaṃ desemī’’ti (dī. ni. 3.182) ettha vivādamūlabhūtā kilesā āsavāti āgatā."
    ],
    "innerText": "‘‘Na vo ahaṃ, cunda, diṭṭhadhammikānaṃyeva āsavānaṃ saṃvarāya dhammaṃ desemī’’ti (dī. ni. 3.182) ettha vivādamūlabhūtā kilesā āsavāti āgatā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yena devūpapatyassa, gandhabbo vā vihaṅgamo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Yakkhattaṃ yena gaccheyyaṃ, manussattañca abbaje;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Te mayhaṃ āsavā khīṇā, viddhastā vinaḷīkatā’’ti. (a. ni. 4.36) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Ettha tebhūmakaṃ kammaṃ avasesā ca akusalā dhammā. Idha pana parūpavādavippaṭisāravadhabandhanādayo ceva apāyadukkhabhūtā ca nānappakārā upaddavā āsavāti āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘diṭṭhadhamme imasmiṃyeva attabhāve vītikkamapaccayā paṭiladdhabbāna’’"
      },
      "ntiādi. Yadi hi bhagavā sikkhāpadaṃ na paññāpeyya, tato asaddhammappaṭisevanaadinnādānapāṇātipātādihetu ye uppajjeyyuṃ parūpavādādayo diṭṭhadhammikā nānappakārā anatthā, ye ca tannimittameva ",
      " nirayādīsu nibbattassa paññavidhabandhanakammakāraṇādivasena mahādukkhānubhavanappakārā anatthā, te sandhāya idaṃ vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘diṭṭhadhammikānaṃ āsavānaṃ saṃvarāya samparāyikānaṃ āsavānaṃ paṭighātāyā’’"
      },
      "ti. Diṭṭhadhammo vuccati paccakkho attabhāvo, tattha bhavā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "diṭṭhadhammikā"
      },
      ". Samparetabbato pecca gantabbato samparāyo, paraloko, tattha bhavā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samparāyikā"
      },
      "."
    ],
    "innerText": "Ettha tebhūmakaṃ kammaṃ avasesā ca akusalā dhammā. Idha pana parūpavādavippaṭisāravadhabandhanādayo ceva apāyadukkhabhūtā ca nānappakārā upaddavā āsavāti āha – ‘‘diṭṭhadhamme imasmiṃyeva attabhāve vītikkamapaccayā paṭiladdhabbāna’’ntiādi. Yadi hi bhagavā sikkhāpadaṃ na paññāpeyya, tato asaddhammappaṭisevanaadinnādānapāṇātipātādihetu ye uppajjeyyuṃ parūpavādādayo diṭṭhadhammikā nānappakārā anatthā, ye ca tannimittameva nirayādīsu nibbattassa paññavidhabandhanakammakāraṇādivasena mahādukkhānubhavanappakārā anatthā, te sandhāya idaṃ vuttaṃ ‘‘diṭṭhadhammikānaṃ āsavānaṃ saṃvarāya samparāyikānaṃ āsavānaṃ paṭighātāyā’’ti. Diṭṭhadhammo vuccati paccakkho attabhāvo, tattha bhavā diṭṭhadhammikā. Samparetabbato pecca gantabbato samparāyo, paraloko, tattha bhavā samparāyikā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akusalaverāna"
      },
      "nti pāṇātipātādipañcaduccaritānaṃ. Tāni verakāraṇattā ‘‘verānī’’ti vuccanti, puggalesu pana uppajjamānāni verāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Te eva vā dukkhadhammā"
      },
      "ti heṭṭhā vuttā vadhabandhanādayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tesaṃ pakkhupacchedanatthāyā"
      },
      "ti tesaṃ pāpicchānaṃ pakkhupacchedāya gaṇabhojanasadisaṃ sikkhāpadaṃ paññattaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṇḍitamanussāna"
      },
      "nti lokiyaparikkhakajanānaṃ. Te hi sikkhāpadapaññattiyā sati sikkhāpadapaññattiṃ ñatvā vā yathāpaññattaṃ paṭipajjamāne bhikkhū disvā vā – ‘‘yāni vata loke mahājanassa rajjanadussanamuyhanaṭṭhānāni, tehi ime samaṇā sakyaputtiyā ārakā viharanti, dukkaraṃ vata karonti, bhāriyaṃ vata karontī’’ti pasādaṃ āpajjanti vinayapiṭake potthakaṃ disvā micchādiṭṭhikatavedibrāhmaṇo viya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uparūparipasādabhāvāyā"
      },
      "ti bhiyyo bhiyyo pasāduppādanatthaṃ. Yepi hi sāsane pasannā kulaputtā, tepi sikkhāpadapaññattiṃ vā ñatvā yathāpaññattaṃ paṭipajjamāne bhikkhū vā disvā ‘‘aho, ayyā, dukkarakārino, ye yāvajīvaṃ ekabhattaṃ brahmacariyaṃ vinayasaṃvaraṃ anupālentī’’ti bhiyyo bhiyyo pasīdanti."
    ],
    "innerText": "Akusalaverānanti pāṇātipātādipañcaduccaritānaṃ. Tāni verakāraṇattā ‘‘verānī’’ti vuccanti, puggalesu pana uppajjamānāni verāni. Te eva vā dukkhadhammāti heṭṭhā vuttā vadhabandhanādayo. Tesaṃ pakkhupacchedanatthāyāti tesaṃ pāpicchānaṃ pakkhupacchedāya gaṇabhojanasadisaṃ sikkhāpadaṃ paññattaṃ. Paṇḍitamanussānanti lokiyaparikkhakajanānaṃ. Te hi sikkhāpadapaññattiyā sati sikkhāpadapaññattiṃ ñatvā vā yathāpaññattaṃ paṭipajjamāne bhikkhū disvā vā – ‘‘yāni vata loke mahājanassa rajjanadussanamuyhanaṭṭhānāni, tehi ime samaṇā sakyaputtiyā ārakā viharanti, dukkaraṃ vata karonti, bhāriyaṃ vata karontī’’ti pasādaṃ āpajjanti vinayapiṭake potthakaṃ disvā micchādiṭṭhikatavedibrāhmaṇo viya. Uparūparipasādabhāvāyāti bhiyyo bhiyyo pasāduppādanatthaṃ. Yepi hi sāsane pasannā kulaputtā, tepi sikkhāpadapaññattiṃ vā ñatvā yathāpaññattaṃ paṭipajjamāne bhikkhū vā disvā ‘‘aho, ayyā, dukkarakārino, ye yāvajīvaṃ ekabhattaṃ brahmacariyaṃ vinayasaṃvaraṃ anupālentī’’ti bhiyyo bhiyyo pasīdanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddhammassa"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ciraṭṭhitattha"
      },
      "nti pariyattisaddhammo, paṭipattisaddhammo, adhigamasaddhammoti tividhassapi saddhammassa ciraṭṭhitatthaṃ. Tattha piṭakattayasaṅgahitaṃ sabbampi buddhavacanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pariyattisaddhammo"
      },
      " nāma. Terasa dhutaguṇā, cuddasa khandhakavattāni, dveasīti mahāvattāni, sīlasamādhivipassanāti ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭipattisaddhammo"
      },
      " nāma. Cattāro ariyamaggā cattāri ca sāmaññaphalāni nibbānañcāti ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "adhigamasaddhammo"
      },
      " nāma. So sabbo yasmā sikkhāpadapaññattiyā sati bhikkhū sikkhāpadañca tassa vibhaṅgañca tadatthajotanatthaṃ aññañca buddhavacanaṃ pariyāpuṇanti, yathāpaññattañca paṭipajjamānā paṭipattiṃ pūretvā paṭipattiyā adhigantabbaṃ lokuttaradhammaṃ adhigacchanti, tasmā sikkhāpadapaññattiyā ciraṭṭhitiko hoti."
    ],
    "innerText": "Saddhammassaciraṭṭhitatthanti pariyattisaddhammo, paṭipattisaddhammo, adhigamasaddhammoti tividhassapi saddhammassa ciraṭṭhitatthaṃ. Tattha piṭakattayasaṅgahitaṃ sabbampi buddhavacanaṃ pariyattisaddhammo nāma. Terasa dhutaguṇā, cuddasa khandhakavattāni, dveasīti mahāvattāni, sīlasamādhivipassanāti ayaṃ paṭipattisaddhammo nāma. Cattāro ariyamaggā cattāri ca sāmaññaphalāni nibbānañcāti ayaṃ adhigamasaddhammo nāma. So sabbo yasmā sikkhāpadapaññattiyā sati bhikkhū sikkhāpadañca tassa vibhaṅgañca tadatthajotanatthaṃ aññañca buddhavacanaṃ pariyāpuṇanti, yathāpaññattañca paṭipajjamānā paṭipattiṃ pūretvā paṭipattiyā adhigantabbaṃ lokuttaradhammaṃ adhigacchanti, tasmā sikkhāpadapaññattiyā ciraṭṭhitiko hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañcavidhassapi"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vinayassā"
      },
      "ti tadaṅgavinayādivasena pañcappakārassa vinayassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vinayaṭṭhakathāyaṃ"
      },
      " (pārā. aṭṭha. 39) pana sikkhāpadapaññattiyā sati saṃvaravinayo ca pahānavinayo ca samathavinayo ca paññattivinayo cāti catubbidhopi vinayo anuggahito hoti upatthambhito supatthambhito. Tena vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘vinayānuggahāyā’’"
      },
      "ti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṃvaravinayo"
      },
      "ti sīlasaṃvaro, satisaṃvaro, ñāṇasaṃvaro, khantisaṃvaro, vīriyasaṃvaroti pañcavidhopi saṃvaro yathāsakaṃ saṃvaritabbānaṃ vinetabbānañca kāyaduccaritādīnaṃ saṃvaraṇato saṃvaro, vinayanato vinayoti vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pahānavinayo"
      },
      "ti tadaṅgappahānaṃ, vikkhambhanappahānaṃ, samucchedappahānaṃ, paṭippassaddhippahānaṃ, nissaraṇappahānanti pañcavidhampi pahānaṃ yasmā cāgaṭṭhena pahānaṃ, vinayanaṭṭhena vinayo, tasmā pahānavinayoti vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samathavinayo"
      },
      "ti satta adhikaraṇasamathā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññattivinayo"
      },
      "ti sikkhāpadameva. Sikkhāpadapaññattiyā hi vijjamānāya eva sikkhāpadasambhavato sikkhāpadasaṅkhāto paññattivinayoti sikkhāpadapaññattiyā anuggahito hoti."
    ],
    "innerText": "Pañcavidhassapivinayassāti tadaṅgavinayādivasena pañcappakārassa vinayassa. Vinayaṭṭhakathāyaṃ (pārā. aṭṭha. 39) pana sikkhāpadapaññattiyā sati saṃvaravinayo ca pahānavinayo ca samathavinayo ca paññattivinayo cāti catubbidhopi vinayo anuggahito hoti upatthambhito supatthambhito. Tena vuttaṃ ‘‘vinayānuggahāyā’’ti. Tattha saṃvaravinayoti sīlasaṃvaro, satisaṃvaro, ñāṇasaṃvaro, khantisaṃvaro, vīriyasaṃvaroti pañcavidhopi saṃvaro yathāsakaṃ saṃvaritabbānaṃ vinetabbānañca kāyaduccaritādīnaṃ saṃvaraṇato saṃvaro, vinayanato vinayoti vuccati. Pahānavinayoti tadaṅgappahānaṃ, vikkhambhanappahānaṃ, samucchedappahānaṃ, paṭippassaddhippahānaṃ, nissaraṇappahānanti pañcavidhampi pahānaṃ yasmā cāgaṭṭhena pahānaṃ, vinayanaṭṭhena vinayo, tasmā pahānavinayoti vuccati. Samathavinayoti satta adhikaraṇasamathā. Paññattivinayoti sikkhāpadameva. Sikkhāpadapaññattiyā hi vijjamānāya eva sikkhāpadasambhavato sikkhāpadasaṅkhāto paññattivinayoti sikkhāpadapaññattiyā anuggahito hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "202-230"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhikkhūnaṃ pañcā"
      },
      "ti nidānapārājikasaṅghādisesāniyatavitthāruddesavasena pañca bhikkhūnaṃ uddesā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhikkhunīnaṃ cattāro"
      },
      "ti bhikkhūnaṃ vuttesu aniyatuddesaṃ ṭhapetvā avasesā cattāro."
    ],
    "innerText": "202-230.Bhikkhūnaṃ pañcāti nidānapārājikasaṅghādisesāniyatavitthāruddesavasena pañca bhikkhūnaṃ uddesā. Bhikkhunīnaṃ cattāroti bhikkhūnaṃ vuttesu aniyatuddesaṃ ṭhapetvā avasesā cattāro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ehibhikkhūpasampadā"
      },
      "ti ‘‘ehi bhikkhū’’ti vacanamattena paññattaupasampadā. Bhagavā hi ehibhikkhubhāvāya upanissayasampannaṃ puggalaṃ disvā rattapaṃsukūlantarato suvaṇṇavaṇṇaṃ dakkhiṇahatthaṃ nīharitvā brahmaghosaṃ nicchārento ‘‘ehi bhikkhu, cara brahmacariyaṃ sammā dukkhassa antakiriyāyā’’ti vadati. Tassa saheva bhagavato vacanena gihiliṅgaṃ antaradhāyati, pabbajjā ca upasampadā ca ruhati, bhaṇḍu kāsāvavasano hoti – ekaṃ nivāsetvā ekaṃ pārupitvā ekaṃ aṃse ṭhapetvā vāmaaṃsakūṭe āsattanīluppalavaṇṇamattikāpatto."
    ],
    "innerText": "Ehibhikkhūpasampadāti ‘‘ehi bhikkhū’’ti vacanamattena paññattaupasampadā. Bhagavā hi ehibhikkhubhāvāya upanissayasampannaṃ puggalaṃ disvā rattapaṃsukūlantarato suvaṇṇavaṇṇaṃ dakkhiṇahatthaṃ nīharitvā brahmaghosaṃ nicchārento ‘‘ehi bhikkhu, cara brahmacariyaṃ sammā dukkhassa antakiriyāyā’’ti vadati. Tassa saheva bhagavato vacanena gihiliṅgaṃ antaradhāyati, pabbajjā ca upasampadā ca ruhati, bhaṇḍu kāsāvavasano hoti – ekaṃ nivāsetvā ekaṃ pārupitvā ekaṃ aṃse ṭhapetvā vāmaaṃsakūṭe āsattanīluppalavaṇṇamattikāpatto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Ticīvarañca ",
      " patto ca, vāsi sūci ca bandhanaṃ;"
    ],
    "innerText": "‘‘Ticīvarañca patto ca, vāsi sūci ca bandhanaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Parissāvanena aṭṭhete, yuttayogassa bhikkhuno’’ti. (dī. ni. aṭṭha. 1.215; ma. ni. aṭṭha. 1.294; 2.349; a. ni. aṭṭha. 2.4.198; pārā. aṭṭha. 45 padabhājanīyavaṇṇanā; apa. aṭṭha. 1.avidūrenidānakathā; bu. vaṃ. aṭṭha. 27.avidūrenidānakathā; jā. aṭṭha. 1.avidūrenidānakathā; mahāni. aṭṭha. 206) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Evaṃ ",
      " vuttehi aṭṭhahi parikkhārehi sarīre paṭimukkehiyeva vassasatikatthero viya iriyāpathasampanno buddhācariyako buddhupajjhāyako sammāsambuddhaṃ vandamānoyeva tiṭṭhati."
    ],
    "innerText": "Evaṃ vuttehi aṭṭhahi parikkhārehi sarīre paṭimukkehiyeva vassasatikatthero viya iriyāpathasampanno buddhācariyako buddhupajjhāyako sammāsambuddhaṃ vandamānoyeva tiṭṭhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saraṇagamanūpasampadā"
      },
      "ti ‘‘buddhaṃ saraṇaṃ gacchāmī’’tiādinā nayena tikkhattuṃ vācaṃ bhinditvā vuttehi tīhi saraṇagamanehi anuññātaupasampadā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ovādūpasampadā"
      },
      "ti ovādappaṭiggahaṇaupasampadā. Sā ca ‘‘tasmātiha te, kassapa, evaṃ sikkhitabbaṃ ‘tibbaṃ me hirottappaṃ, paccupaṭṭhitaṃ bhavissati theresu navesu majjhimesū’ti. Evañhi te, kassapa, sikkhitabbaṃ. Tasmātiha te, kassapa, evaṃ sikkhitabbaṃ ‘yaṃ kiñci dhammaṃ suṇissāmi kusalūpasaṃhitaṃ, sabbaṃ taṃ aṭṭhiṃ katvā manasi karitvā sabbacetasā samannāharitvā ohitasoto dhammaṃ suṇissāmī’ti, evañhi te, kassapa, sikkhitabbaṃ. Tasmātiha te, kassapa, evaṃ sikkhitabbaṃ ‘sātasahagatā ca me kāyagatāsati na vijahissatī’ti, evañhi te, kassapa, sikkhitabba’’nti (saṃ. ni. 2.154) iminā ovādappaṭiggahaṇena mahākassapattherassa anuññātaupasampadā."
    ],
    "innerText": "Saraṇagamanūpasampadāti ‘‘buddhaṃ saraṇaṃ gacchāmī’’tiādinā nayena tikkhattuṃ vācaṃ bhinditvā vuttehi tīhi saraṇagamanehi anuññātaupasampadā. Ovādūpasampadāti ovādappaṭiggahaṇaupasampadā. Sā ca ‘‘tasmātiha te, kassapa, evaṃ sikkhitabbaṃ ‘tibbaṃ me hirottappaṃ, paccupaṭṭhitaṃ bhavissati theresu navesu majjhimesū’ti. Evañhi te, kassapa, sikkhitabbaṃ. Tasmātiha te, kassapa, evaṃ sikkhitabbaṃ ‘yaṃ kiñci dhammaṃ suṇissāmi kusalūpasaṃhitaṃ, sabbaṃ taṃ aṭṭhiṃ katvā manasi karitvā sabbacetasā samannāharitvā ohitasoto dhammaṃ suṇissāmī’ti, evañhi te, kassapa, sikkhitabbaṃ. Tasmātiha te, kassapa, evaṃ sikkhitabbaṃ ‘sātasahagatā ca me kāyagatāsati na vijahissatī’ti, evañhi te, kassapa, sikkhitabba’’nti (saṃ. ni. 2.154) iminā ovādappaṭiggahaṇena mahākassapattherassa anuññātaupasampadā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañhabyākaraṇūpasampadā"
      },
      " nāma sopākassa anuññātaupasampadā. Bhagavā kira pubbārāme anucaṅkamantaṃ sopākasāmaṇeraṃ ‘‘uddhumātakasaññāti vā, sopāka, rūpasaññāti vā ime dhammā nānatthā nānābyañjanā, udāhu ekatthā byañjanameva nāna’’nti dasa asubhanissite pañhe pucchi. So byākāsi. Bhagavā tassa sādhukāraṃ datvā ‘‘kativassosi, tvaṃ sopākā’’ti pucchi. Sattavassohaṃ bhagavāti. Sopāka, tvaṃ mama sabbaññutaññāṇena saddhiṃ saṃsanditvā pañhe byākāsīti āraddhacitto upasampadaṃ anujāni. Ayaṃ pañhabyākaraṇūpasampadā."
    ],
    "innerText": "Pañhabyākaraṇūpasampadā nāma sopākassa anuññātaupasampadā. Bhagavā kira pubbārāme anucaṅkamantaṃ sopākasāmaṇeraṃ ‘‘uddhumātakasaññāti vā, sopāka, rūpasaññāti vā ime dhammā nānatthā nānābyañjanā, udāhu ekatthā byañjanameva nāna’’nti dasa asubhanissite pañhe pucchi. So byākāsi. Bhagavā tassa sādhukāraṃ datvā ‘‘kativassosi, tvaṃ sopākā’’ti pucchi. Sattavassohaṃ bhagavāti. Sopāka, tvaṃ mama sabbaññutaññāṇena saddhiṃ saṃsanditvā pañhe byākāsīti āraddhacitto upasampadaṃ anujāni. Ayaṃ pañhabyākaraṇūpasampadā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñatticatutthaupasampadā"
      },
      " nāma bhikkhūnaṃ etarahi upasampadā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Garudhammūpasampadā"
      },
      "ti garudhammappaṭiggahaṇena upasampadā. Sā ca mahāpajāpatiyā aṭṭhagarudhammappaṭiggahaṇena anuññātā ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ubhatosaṅghe upasampadā"
      },
      " nāma bhikkhuniyā bhikkhunisaṅghato ñatticatutthena, bhikkhusaṅghato ñatticatutthenāti imehi dvīhi kammehi anuññātā aṭṭhavācikūpasampadā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dūtena upasampadā"
      },
      " nāma aḍḍhakāsiyā gaṇikāya anuññātā upasampadā."
    ],
    "innerText": "Ñatticatutthaupasampadā nāma bhikkhūnaṃ etarahi upasampadā. Garudhammūpasampadāti garudhammappaṭiggahaṇena upasampadā. Sā ca mahāpajāpatiyā aṭṭhagarudhammappaṭiggahaṇena anuññātā . Ubhatosaṅghe upasampadā nāma bhikkhuniyā bhikkhunisaṅghato ñatticatutthena, bhikkhusaṅghato ñatticatutthenāti imehi dvīhi kammehi anuññātā aṭṭhavācikūpasampadā. Dūtena upasampadā nāma aḍḍhakāsiyā gaṇikāya anuññātā upasampadā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñattikammaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nava ṭhānāni gacchatī"
      },
      "ti katamāni nava ṭhānāni gacchati? Osāraṇaṃ, nissāraṇaṃ, uposatho, pavāraṇā, sammuti, dānaṃ, paṭiggahaṃ, paccukkaḍḍhanaṃ, kammalakkhaṇaññeva navamanti evaṃ vuttāni nava ṭhānāni gacchati. Tattha ‘‘suṇātu me, bhante, saṅgho, itthannāmo itthannāmassa āyasmato upasampadāpekkho, anusiṭṭho so mayā, yadi saṅghassa pattakallaṃ, itthannāmo āgaccheyya, āgacchāhīti vattabbo’’ti (mahāva. 126) evaṃ upasampadāpekkhassa osāraṇā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "osāraṇā"
      },
      " nāma."
    ],
    "innerText": "Ñattikammaṃnava ṭhānāni gacchatīti katamāni nava ṭhānāni gacchati? Osāraṇaṃ, nissāraṇaṃ, uposatho, pavāraṇā, sammuti, dānaṃ, paṭiggahaṃ, paccukkaḍḍhanaṃ, kammalakkhaṇaññeva navamanti evaṃ vuttāni nava ṭhānāni gacchati. Tattha ‘‘suṇātu me, bhante, saṅgho, itthannāmo itthannāmassa āyasmato upasampadāpekkho, anusiṭṭho so mayā, yadi saṅghassa pattakallaṃ, itthannāmo āgaccheyya, āgacchāhīti vattabbo’’ti (mahāva. 126) evaṃ upasampadāpekkhassa osāraṇā osāraṇā nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇantu me, āyasmantā, ayaṃ itthannāmo bhikkhu dhammakathiko, imassa neva suttaṃ āgacchati, no suttavibhaṅgo, so atthaṃ asallakkhetvā byañjanacchāyāya atthaṃ paṭibāhati. Yadāyasmantānaṃ pattakallaṃ, itthannāmaṃ bhikkhuṃ vuṭṭhāpetvā avasesā imaṃ adhikaraṇaṃ vūpasameyyāmā’’ti evaṃ ubbāhikavinicchaye dhammakathikassa bhikkhuno nissāraṇā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nissāraṇā"
      },
      " nāma."
    ],
    "innerText": "‘‘Suṇantu me, āyasmantā, ayaṃ itthannāmo bhikkhu dhammakathiko, imassa neva suttaṃ āgacchati, no suttavibhaṅgo, so atthaṃ asallakkhetvā byañjanacchāyāya atthaṃ paṭibāhati. Yadāyasmantānaṃ pattakallaṃ, itthannāmaṃ bhikkhuṃ vuṭṭhāpetvā avasesā imaṃ adhikaraṇaṃ vūpasameyyāmā’’ti evaṃ ubbāhikavinicchaye dhammakathikassa bhikkhuno nissāraṇā nissāraṇā nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu me, bhante, saṅgho, ajjuposatho pannaraso. Yadi saṅghassa pattakallaṃ, saṅgho uposathaṃ kareyyā’’ti evaṃ uposathakammavasena ṭhapitā ñatti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uposatho"
      },
      " nāma."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho, ajjuposatho pannaraso. Yadi saṅghassa pattakallaṃ, saṅgho uposathaṃ kareyyā’’ti evaṃ uposathakammavasena ṭhapitā ñatti uposatho nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu me, bhante, saṅgho, ajja pavāraṇā pannarasī. Yadi saṅghassa pattakallaṃ, saṅgho pavāreyyā’’ti evaṃ pavāraṇākammavasena ṭhapitā ñatti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pavāraṇā"
      },
      " nāma."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho, ajja pavāraṇā pannarasī. Yadi saṅghassa pattakallaṃ, saṅgho pavāreyyā’’ti evaṃ pavāraṇākammavasena ṭhapitā ñatti pavāraṇā nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu me, bhante, saṅgho, itthannāmo itthannāmassa āyasmato upasampadāpekkho. Yadi saṅghassa pattakallaṃ, ahaṃ itthannāmaṃ anusāseyya’’nti, ‘‘yadi saṅghassa pattakallaṃ, itthannāmo itthannāmaṃ anusāseyyā’’ti, ‘‘yadi saṅghassa pattakallaṃ, ahaṃ itthannāmaṃ antarāyike dhamme puccheyya’’nti, ‘‘yadi saṅghassa pattakallaṃ, itthannāmo itthannāmaṃ antarāyike dhamme puccheyyā’’ti, ‘‘yadi saṅghassa pattakallaṃ, ahaṃ itthannāmaṃ vinayaṃ puccheyya’’nti, ‘‘yadi saṅghassa pattakallaṃ, itthannāmo itthannāmaṃ vinayaṃ puccheyyā’’ti, ‘‘yadi saṅghassa pattakallaṃ, ahaṃ itthannāmena vinayaṃ puṭṭho ",
      " vissajjeyya’’nti, ‘‘yadi saṅghassa pattakallaṃ, itthannāmo itthannāmena vinayaṃ puṭṭho ",
      " vissajjeyyā’’ti evaṃ attānaṃ vā paraṃ vā sammannituṃ ṭhapitā ñatti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammuti"
      },
      " nāma."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho, itthannāmo itthannāmassa āyasmato upasampadāpekkho. Yadi saṅghassa pattakallaṃ, ahaṃ itthannāmaṃ anusāseyya’’nti, ‘‘yadi saṅghassa pattakallaṃ, itthannāmo itthannāmaṃ anusāseyyā’’ti, ‘‘yadi saṅghassa pattakallaṃ, ahaṃ itthannāmaṃ antarāyike dhamme puccheyya’’nti, ‘‘yadi saṅghassa pattakallaṃ, itthannāmo itthannāmaṃ antarāyike dhamme puccheyyā’’ti, ‘‘yadi saṅghassa pattakallaṃ, ahaṃ itthannāmaṃ vinayaṃ puccheyya’’nti, ‘‘yadi saṅghassa pattakallaṃ, itthannāmo itthannāmaṃ vinayaṃ puccheyyā’’ti, ‘‘yadi saṅghassa pattakallaṃ, ahaṃ itthannāmena vinayaṃ puṭṭho vissajjeyya’’nti, ‘‘yadi saṅghassa pattakallaṃ, itthannāmo itthannāmena vinayaṃ puṭṭho vissajjeyyā’’ti evaṃ attānaṃ vā paraṃ vā sammannituṃ ṭhapitā ñatti sammuti nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu me, bhante, saṅgho, idaṃ cīvaraṃ itthannāmassa bhikkhuno nissaggiyaṃ saṅghassa nissaṭṭhaṃ. Yadi saṅghassa pattakallaṃ, saṅgho imaṃ cīvaraṃ itthannāmassa bhikkhuno dadeyyā’’ti, ‘‘yadāyasmantānaṃ pattakallaṃ, āyasmantā imaṃ cīvaraṃ itthannāmassa bhikkhuno dadeyyu’’nti evaṃ nissaṭṭhacīvarapattādīnaṃ dānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dānaṃ"
      },
      " nāma."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho, idaṃ cīvaraṃ itthannāmassa bhikkhuno nissaggiyaṃ saṅghassa nissaṭṭhaṃ. Yadi saṅghassa pattakallaṃ, saṅgho imaṃ cīvaraṃ itthannāmassa bhikkhuno dadeyyā’’ti, ‘‘yadāyasmantānaṃ pattakallaṃ, āyasmantā imaṃ cīvaraṃ itthannāmassa bhikkhuno dadeyyu’’nti evaṃ nissaṭṭhacīvarapattādīnaṃ dānaṃ dānaṃ nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu me, bhante, saṅgho, ayaṃ itthannāmo bhikkhu āpattiṃ sarati vivarati uttāniṃ karoti deseti. Yadi saṅghassa pattakallaṃ, ahaṃ itthannāmassa bhikkhuno āpattiṃ paṭiggaṇheyya’’nti, ‘‘yadāyasmantānaṃ pattakallaṃ, ahaṃ itthannāmassa bhikkhuno āpatiṃ paṭiggaṇheyya’’nti, tena vattabbo ‘‘passasī’’ti? Āma passāmīti. ‘‘Āyatiṃ saṃvareyyāsī’’ti evaṃ āpattippaṭiggaho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭiggaho"
      },
      " nāma."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho, ayaṃ itthannāmo bhikkhu āpattiṃ sarati vivarati uttāniṃ karoti deseti. Yadi saṅghassa pattakallaṃ, ahaṃ itthannāmassa bhikkhuno āpattiṃ paṭiggaṇheyya’’nti, ‘‘yadāyasmantānaṃ pattakallaṃ, ahaṃ itthannāmassa bhikkhuno āpatiṃ paṭiggaṇheyya’’nti, tena vattabbo ‘‘passasī’’ti? Āma passāmīti. ‘‘Āyatiṃ saṃvareyyāsī’’ti evaṃ āpattippaṭiggaho paṭiggaho nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇantu me, āyasmantā āvāsikā, yadāyasmantānaṃ pattakallaṃ, idāni uposathaṃ kareyyāma, pātimokkhaṃ uddiseyyāma, āgame kāle pavāreyyāmā’’ti, te ce, bhikkhave, bhikkhū bhaṇḍanakārakā kalahakārakā saṅghe adhikaraṇakārakā taṃ kālaṃ anuvaseyyuṃ, āvāsikena bhikkhunā byattena paṭibalena āvāsikā bhikkhū ñāpetabbā ‘‘suṇantu me, āyasmantā āvāsikā, yadāyasmantānaṃ pattakallaṃ, idāni uposathaṃ kareyyāma, pātimokkhaṃ uddiseyyāma, āgame juṇhe pavāreyyāmā’’ti evaṃ katā pavāraṇā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paccukkaḍḍhanā"
      },
      " nāma."
    ],
    "innerText": "‘‘Suṇantu me, āyasmantā āvāsikā, yadāyasmantānaṃ pattakallaṃ, idāni uposathaṃ kareyyāma, pātimokkhaṃ uddiseyyāma, āgame kāle pavāreyyāmā’’ti, te ce, bhikkhave, bhikkhū bhaṇḍanakārakā kalahakārakā saṅghe adhikaraṇakārakā taṃ kālaṃ anuvaseyyuṃ, āvāsikena bhikkhunā byattena paṭibalena āvāsikā bhikkhū ñāpetabbā ‘‘suṇantu me, āyasmantā āvāsikā, yadāyasmantānaṃ pattakallaṃ, idāni uposathaṃ kareyyāma, pātimokkhaṃ uddiseyyāma, āgame juṇhe pavāreyyāmā’’ti evaṃ katā pavāraṇā paccukkaḍḍhanā nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sabbeheva ekajjhaṃ sannipatitabbaṃ, sannipatitvā byattena bhikkhunā paṭibalena saṅgho ñāpetabbo ‘‘suṇātu me, bhante, saṅgho, amhākaṃ bhaṇḍanajātānaṃ kalahajātānaṃ vivādāpannānaṃ viharataṃ bahu assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Sace mayaṃ imāhi āpattīhi aññamaññaṃ kāressāma, siyāpi taṃ adhikaraṇaṃ kakkhaḷattāya vāḷattāya bhedāya saṃvatteyya. Yadi saṅghassa pattakallaṃ, saṅgho imaṃ adhikaraṇaṃ tiṇavatthārakena vūpasameyya ṭhapetvā thullavajjaṃ, ṭhapetvā gihipaṭisaṃyutta’’nti evaṃ tiṇavatthārakasamathe katā sabbapaṭhamā sabbasaṅgāhikañatti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kammalakkhaṇaṃ"
      },
      " nāma."
    ],
    "innerText": "Sabbeheva ekajjhaṃ sannipatitabbaṃ, sannipatitvā byattena bhikkhunā paṭibalena saṅgho ñāpetabbo ‘‘suṇātu me, bhante, saṅgho, amhākaṃ bhaṇḍanajātānaṃ kalahajātānaṃ vivādāpannānaṃ viharataṃ bahu assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Sace mayaṃ imāhi āpattīhi aññamaññaṃ kāressāma, siyāpi taṃ adhikaraṇaṃ kakkhaḷattāya vāḷattāya bhedāya saṃvatteyya. Yadi saṅghassa pattakallaṃ, saṅgho imaṃ adhikaraṇaṃ tiṇavatthārakena vūpasameyya ṭhapetvā thullavajjaṃ, ṭhapetvā gihipaṭisaṃyutta’’nti evaṃ tiṇavatthārakasamathe katā sabbapaṭhamā sabbasaṅgāhikañatti kammalakkhaṇaṃ nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñattidutiyaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kammaṃ satta ṭhānāni gacchatī"
      },
      "ti katamāni satta ṭhānāni gacchati? Osāraṇaṃ ",
      ", nissāraṇaṃ, sammuti, dānaṃ, uddharaṇaṃ, desanaṃ, kammalakkhaṇaññeva sattamanti evaṃ vuttāni satta ṭhānāni gacchati. Tattha vaḍḍhassa licchavino pattanikkujjanavasena khandhake vuttā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nissāraṇā,"
      },
      " tasseva pataukkujjanavasena vuttā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "osāraṇā"
      },
      " ca veditabbā. Sīmāsammuti ticīvarena avippavāsasammuti santhatasammuti bhattuddesakasenāsanaggāhāpakabhaṇḍāgārika- cīvarappaṭiggāhaka-cīvarabhājaka-yāgubhājaka-phalabhājaka-khajjabhājaka-appamattakavissajjaka- sāṭiyaggāhāpaka-pattaggāhāpaka-ārāmikapesaka-sāmaṇerapesakasammutīti etāsaṃ sammutīnaṃ vasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammuti"
      },
      " veditabbā. Kaṭhinacīvaradānamatakacīvaradānavasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dānaṃ"
      },
      " veditabbaṃ. Kaṭhinuddhāraṇavasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uddhāro"
      },
      " veditabbo. Kuṭivatthuvihāravatthudesanāvasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "desanā"
      },
      " veditabbā. Yā pana tiṇavatthārakasamathe sabbasaṅgāhikañattiñca ekekasmiṃ pakkhe ekekaṃ ñattiñcāti tissopi ñattiyo ṭhapetvā puna ekasmiṃ pakkhe ekā, ekasmiṃ pakkhe ekāti dvepi ñattidutiyakammavācā vuttā. Tāsaṃ vasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kammalakkhaṇaṃ"
      },
      " veditabbaṃ."
    ],
    "innerText": "Ñattidutiyaṃkammaṃ satta ṭhānāni gacchatīti katamāni satta ṭhānāni gacchati? Osāraṇaṃ , nissāraṇaṃ, sammuti, dānaṃ, uddharaṇaṃ, desanaṃ, kammalakkhaṇaññeva sattamanti evaṃ vuttāni satta ṭhānāni gacchati. Tattha vaḍḍhassa licchavino pattanikkujjanavasena khandhake vuttā nissāraṇā, tasseva pataukkujjanavasena vuttā osāraṇā ca veditabbā. Sīmāsammuti ticīvarena avippavāsasammuti santhatasammuti bhattuddesakasenāsanaggāhāpakabhaṇḍāgārika- cīvarappaṭiggāhaka-cīvarabhājaka-yāgubhājaka-phalabhājaka-khajjabhājaka-appamattakavissajjaka- sāṭiyaggāhāpaka-pattaggāhāpaka-ārāmikapesaka-sāmaṇerapesakasammutīti etāsaṃ sammutīnaṃ vasena sammuti veditabbā. Kaṭhinacīvaradānamatakacīvaradānavasena dānaṃ veditabbaṃ. Kaṭhinuddhāraṇavasena uddhāro veditabbo. Kuṭivatthuvihāravatthudesanāvasena desanā veditabbā. Yā pana tiṇavatthārakasamathe sabbasaṅgāhikañattiñca ekekasmiṃ pakkhe ekekaṃ ñattiñcāti tissopi ñattiyo ṭhapetvā puna ekasmiṃ pakkhe ekā, ekasmiṃ pakkhe ekāti dvepi ñattidutiyakammavācā vuttā. Tāsaṃ vasena kammalakkhaṇaṃ veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñatticatutthakammaṃ satta ṭhānāni gacchatī"
      },
      "ti katamāni satta ṭhānāni gacchati? Osāraṇaṃ, nissāraṇaṃ, sammuti, dānaṃ, niggahaṃ, samanubhāsanaṃ, kammalakkhaṇaññeva sattamanti evaṃ vuttāni satta ṭhānāni gacchati. Tattha tajjanīyakammādīnaṃ sattannaṃ kammānaṃ vasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nissāraṇā,"
      },
      " tesaṃyeva ca kammānaṃ paṭippassambhanavasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "osāraṇā"
      },
      " veditabbā. Bhikkhunovādakasammutivasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammuti"
      },
      " veditabbā. Parivāsadānamānattadānavasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dānaṃ"
      },
      " veditabbaṃ. Mūlāyapaṭikassanakammavasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "niggaho"
      },
      " veditabbo. Ukkhittānuvattakā, aṭṭha yāvatatiyakā, ariṭṭho, caṇḍakāḷī ca imete yāvatatiyakāti imāsaṃ ekādasannaṃ samanubhāsanānaṃ vasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samanubhāsanā"
      },
      " veditabbā. Upasampadakammaabbhānakammavasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kammalakkhaṇaṃ"
      },
      " veditabbaṃ."
    ],
    "innerText": "Ñatticatutthakammaṃ satta ṭhānāni gacchatīti katamāni satta ṭhānāni gacchati? Osāraṇaṃ, nissāraṇaṃ, sammuti, dānaṃ, niggahaṃ, samanubhāsanaṃ, kammalakkhaṇaññeva sattamanti evaṃ vuttāni satta ṭhānāni gacchati. Tattha tajjanīyakammādīnaṃ sattannaṃ kammānaṃ vasena nissāraṇā, tesaṃyeva ca kammānaṃ paṭippassambhanavasena osāraṇā veditabbā. Bhikkhunovādakasammutivasena sammuti veditabbā. Parivāsadānamānattadānavasena dānaṃ veditabbaṃ. Mūlāyapaṭikassanakammavasena niggaho veditabbo. Ukkhittānuvattakā, aṭṭha yāvatatiyakā, ariṭṭho, caṇḍakāḷī ca imete yāvatatiyakāti imāsaṃ ekādasannaṃ samanubhāsanānaṃ vasena samanubhāsanā veditabbā. Upasampadakammaabbhānakammavasena kammalakkhaṇaṃ veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammasammukhatā"
      },
      "tiādīsu yena dhammena, yena vinayena, yena satthusāsanena saṅgho kammaṃ karoti, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammasammukhatā, vinayasammukhatā, satthusāsanasammukhatā"
      },
      ". Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammo"
      },
      "ti bhūtavatthu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vinayo"
      },
      "ti codanā ceva sāraṇā ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Satthusāsanaṃ"
      },
      " nāma ñattisampadā ceva anusāvanasampadā ca. Yāvatikā bhikkhū kammappattā, te āgatā honti, chandārahānaṃ ",
      " chando āhaṭo hoti, sammukhībhūtā nappaṭikkosanti, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṅghasammukhatā"
      },
      ". Yassa saṅgho kammaṃ karoti, tassa sammukhībhāvo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "puggalasammukhatā"
      },
      ". Sesamettha vuttanayattā uttānatthameva."
    ],
    "innerText": "Dhammasammukhatātiādīsu yena dhammena, yena vinayena, yena satthusāsanena saṅgho kammaṃ karoti, ayaṃ dhammasammukhatā, vinayasammukhatā, satthusāsanasammukhatā. Tattha dhammoti bhūtavatthu. Vinayoti codanā ceva sāraṇā ca. Satthusāsanaṃ nāma ñattisampadā ceva anusāvanasampadā ca. Yāvatikā bhikkhū kammappattā, te āgatā honti, chandārahānaṃ chando āhaṭo hoti, sammukhībhūtā nappaṭikkosanti, ayaṃ saṅghasammukhatā. Yassa saṅgho kammaṃ karoti, tassa sammukhībhāvo puggalasammukhatā. Sesamettha vuttanayattā uttānatthameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti manorathapūraṇiyā aṅguttaranikāya-aṭṭhakathāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dukanipātavaṇṇanāya anuttānatthadīpanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Namo tassa bhagavato arahato sammāsambuddhassa"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "nikaya"
    },
    "innerText": "Aṅguttaranikāye"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "book"
    },
    "innerText": "Tikanipāta-ṭīkā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Paṭhamapaṇṇāsakaṃ"
  }
]