[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "(13) 3. Bhayavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Attānuvādasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "121"
      },
      ". Tatiyassa paṭhame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "attānaṃ anuvadantassa uppajjanakabhaya"
      },
      "nti attānaṃ anuvadantassa pāpakammino uppajjanakabhayaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dvattiṃsakammakāraṇe paṭicca uppajjanakabhaya"
      },
      "nti agārikānaṃ vasena vuttaṃ ",
      ", anagārikānaṃ pana vinayadaṇḍaṃ paṭicca uppajjanakabhayampi daṇḍabhayanteva saṅkhaṃ gacchati. Sesaṃ suviññeyyameva."
    ],
    "innerText": "121. Tatiyassa paṭhame attānaṃ anuvadantassa uppajjanakabhayanti attānaṃ anuvadantassa pāpakammino uppajjanakabhayaṃ. Dvattiṃsakammakāraṇe paṭicca uppajjanakabhayanti agārikānaṃ vasena vuttaṃ , anagārikānaṃ pana vinayadaṇḍaṃ paṭicca uppajjanakabhayampi daṇḍabhayanteva saṅkhaṃ gacchati. Sesaṃ suviññeyyameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Attānuvādasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Ūmibhayasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "122"
      },
      ". Dutiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kodhūpāyāsassetaṃ adhivacana"
      },
      "nti ettha kujjhanaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kodho,"
      },
      " sveva cittassa kāyassa ca atippamaddanamathanuppādanehi daḷhaāyāsaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upāyāso"
      },
      ". Anekavāraṃ pavattitvā attanā samavetaṃ sattaṃ ajjhottharitvā sīsaṃ ukkhipituṃ adatvā ūmisadisatā daṭṭhabbā. Yathā hi bāhiraṃ udakaṃ otiṇṇo ūmīsu osīditvā marati, evaṃ ",
      " imasmiṃ sāsane kodhūpāyāse osīditvā vibbhamati, tasmā kodhūpāyāso ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ūmibhaya’’"
      },
      "nti vutto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Odarikattassetaṃ adhivacana"
      },
      "nti yathā hi bāhiraṃ udakaṃ otiṇṇo kumbhīlena khādito marati, evaṃ imasmiṃ sāsane odarikattena odarikabhāvena āmisagedhena micchājīvena jīvikakappanena nāsitasīlādiguṇatāya khāditadhammasarīro vibbhamati, tasmā odarikattaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kumbhīlabhaya’’"
      },
      "nti vuttaṃ."
    ],
    "innerText": "122. Dutiye kodhūpāyāsassetaṃ adhivacananti ettha kujjhanaṭṭhena kodho, sveva cittassa kāyassa ca atippamaddanamathanuppādanehi daḷhaāyāsaṭṭhena upāyāso. Anekavāraṃ pavattitvā attanā samavetaṃ sattaṃ ajjhottharitvā sīsaṃ ukkhipituṃ adatvā ūmisadisatā daṭṭhabbā. Yathā hi bāhiraṃ udakaṃ otiṇṇo ūmīsu osīditvā marati, evaṃ imasmiṃ sāsane kodhūpāyāse osīditvā vibbhamati, tasmā kodhūpāyāso ‘‘ūmibhaya’’nti vutto. Odarikattassetaṃ adhivacananti yathā hi bāhiraṃ udakaṃ otiṇṇo kumbhīlena khādito marati, evaṃ imasmiṃ sāsane odarikattena odarikabhāvena āmisagedhena micchājīvena jīvikakappanena nāsitasīlādiguṇatāya khāditadhammasarīro vibbhamati, tasmā odarikattaṃ ‘‘kumbhīlabhaya’’nti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anupaṭṭhitāya satiyā"
      },
      "ti kāyagataṃ satiṃ anuṭṭhāpetvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asaṃvutehī"
      },
      "ti apihitehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañcannetaṃ kāmaguṇānaṃ adhivacana"
      },
      "nti yathā hi bāhiraṃ udakaṃ otiṇṇo āvaṭṭe nimujjitvā marati, evaṃ imasmiṃ sāsane pabbajito pañcakāmaguṇāvaṭṭe nimujjitvā vibbhamati. Kāmarāgābhibhūto hi satto ito ca etto, etto ca itoti evaṃ manāpiyarūpādivisayasaṅkhāte āvaṭṭe attānaṃ saṃsāretvā yathā tato bahibhūte nekkhamme cittampi na uppādeti, evaṃ āvaṭṭetvā byasanāpādanena kāmaguṇānaṃ āvaṭṭasadisatā daṭṭhabbā."
    ],
    "innerText": "Anupaṭṭhitāya satiyāti kāyagataṃ satiṃ anuṭṭhāpetvā. Asaṃvutehīti apihitehi. Pañcannetaṃ kāmaguṇānaṃ adhivacananti yathā hi bāhiraṃ udakaṃ otiṇṇo āvaṭṭe nimujjitvā marati, evaṃ imasmiṃ sāsane pabbajito pañcakāmaguṇāvaṭṭe nimujjitvā vibbhamati. Kāmarāgābhibhūto hi satto ito ca etto, etto ca itoti evaṃ manāpiyarūpādivisayasaṅkhāte āvaṭṭe attānaṃ saṃsāretvā yathā tato bahibhūte nekkhamme cittampi na uppādeti, evaṃ āvaṭṭetvā byasanāpādanena kāmaguṇānaṃ āvaṭṭasadisatā daṭṭhabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anuddhaṃsetī"
      },
      "ti kilameti vilolati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rāgānuddhaṃsitenā"
      },
      "ti rāgena anuddhaṃsitena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mātugāmassetaṃ adhivacana"
      },
      "nti. Yathā hi bāhiraṃ udakaṃ otiṇṇo caṇḍamacchaṃ āgamma laddhappahāro marati, evaṃ imasmiṃ sāsane mātugāmaṃ ārabbha uppannakāmarāgo vibbhamati, tasmā mātugāmo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘susukābhaya’’"
      },
      "nti vutto. Mātugāmo hi yonisomanasikārarahitaṃ adhīrapurisaṃ itthikuttabhūtehi attano hāsabhāvavilāsehi abhibhuyya gahetvā dhīrajātikampi attano ",
      " rūpādīhi sampalobhanavasena anavasesaṃ attano upakāradhamme sīlādike sampādetuṃ asamatthaṃ karonto anayabyasanaṃ pāpeti."
    ],
    "innerText": "Anuddhaṃsetīti kilameti vilolati. Rāgānuddhaṃsitenāti rāgena anuddhaṃsitena. Mātugāmassetaṃ adhivacananti. Yathā hi bāhiraṃ udakaṃ otiṇṇo caṇḍamacchaṃ āgamma laddhappahāro marati, evaṃ imasmiṃ sāsane mātugāmaṃ ārabbha uppannakāmarāgo vibbhamati, tasmā mātugāmo ‘‘susukābhaya’’nti vutto. Mātugāmo hi yonisomanasikārarahitaṃ adhīrapurisaṃ itthikuttabhūtehi attano hāsabhāvavilāsehi abhibhuyya gahetvā dhīrajātikampi attano rūpādīhi sampalobhanavasena anavasesaṃ attano upakāradhamme sīlādike sampādetuṃ asamatthaṃ karonto anayabyasanaṃ pāpeti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Imāni pana cattāri bhayāni bhāyitvā yathā udakaṃ anorohantassa udakaṃ nissāya udakapipāsāvinayanaṃ sarīrasuddhipariḷāhūpasamo kāyautuggāhāpananti, evamādi ānisaṃso natthi, evamevaṃ imāni cattāri bhayāni bhāyitvā sāsane apabbajantassapi imaṃ sāsanaṃ nissāya saṅkhepato vaṭṭadukkhūpasamo, vitthārato pana sīlānisaṃsādivasena anekavidho ānisaṃso natthi. Yathā pana imāni cattāri bhayāni abhāyitvā ",
      " udakaṃ orohantassa vuttappakāro ānisaṃso hoti, evaṃ imāni abhāyitvā sāsane pabbajantassapi vuttappakāro ānisaṃso hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahādhammarakkhitatthero"
      },
      " panāha ‘‘cattāri bhayāni bhāyitvā udakaṃ anotaranto sotaṃ chinditvā paratīraṃ pāpuṇituṃ na sakkoti, abhāyitvā otaranto sakkoti, evamevaṃ bhāyitvā sāsane apabbajantopi taṇhāsotaṃ chinditvā nibbānapāraṃ daṭṭhuṃ na sakkoti, abhāyitvā pabbajanto sakkotī’’ti."
    ],
    "innerText": "Imāni pana cattāri bhayāni bhāyitvā yathā udakaṃ anorohantassa udakaṃ nissāya udakapipāsāvinayanaṃ sarīrasuddhipariḷāhūpasamo kāyautuggāhāpananti, evamādi ānisaṃso natthi, evamevaṃ imāni cattāri bhayāni bhāyitvā sāsane apabbajantassapi imaṃ sāsanaṃ nissāya saṅkhepato vaṭṭadukkhūpasamo, vitthārato pana sīlānisaṃsādivasena anekavidho ānisaṃso natthi. Yathā pana imāni cattāri bhayāni abhāyitvā udakaṃ orohantassa vuttappakāro ānisaṃso hoti, evaṃ imāni abhāyitvā sāsane pabbajantassapi vuttappakāro ānisaṃso hoti. Mahādhammarakkhitatthero panāha ‘‘cattāri bhayāni bhāyitvā udakaṃ anotaranto sotaṃ chinditvā paratīraṃ pāpuṇituṃ na sakkoti, abhāyitvā otaranto sakkoti, evamevaṃ bhāyitvā sāsane apabbajantopi taṇhāsotaṃ chinditvā nibbānapāraṃ daṭṭhuṃ na sakkoti, abhāyitvā pabbajanto sakkotī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ūmibhayasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Paṭhamanānākaraṇasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "123"
      },
      ". Tatiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "brahmakāyikānaṃ devāna"
      },
      "nti ettha brahmānaṃ kāyo samūhoti brahmakāyo, tappariyāpannatāya tattha gatāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "brahmakāyikā"
      },
      ". Etāya ca sabbassapi brahmakāyassa samaññāya bhavitabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ābhassarānaṃ devāna"
      },
      "ntiādinā pana dutiyajjhānabhūmikādīnaṃ upari gahitattā gobalībaddaññāyena tadavasiṭṭhānaṃ ayaṃ samaññā, tasmā ‘‘brahmakāyikānaṃ devāna’’nti paṭhamajjhānabhūmikānaṃyeva gahaṇaṃ veditabbaṃ. Saha byayati gacchatīti sahabyo, sahavattanako. Tassa bhāvo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sahabyatā,"
      },
      " sahapavattīti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sahabhāvaṃ upagacchatī’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kappo āyuppamāṇa"
      },
      "nti ettha yadipi brahmapārisajjādīnaṃ āyuno antaraṃ atthi, ukkaṭṭhaparicchedena panetaṃ vuttanti dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘paṭhamajjhānaṃ atthi hīna’’"
      },
      "ntiādimāha."
    ],
    "innerText": "123. Tatiye brahmakāyikānaṃ devānanti ettha brahmānaṃ kāyo samūhoti brahmakāyo, tappariyāpannatāya tattha gatāti brahmakāyikā. Etāya ca sabbassapi brahmakāyassa samaññāya bhavitabbaṃ. Ābhassarānaṃ devānantiādinā pana dutiyajjhānabhūmikādīnaṃ upari gahitattā gobalībaddaññāyena tadavasiṭṭhānaṃ ayaṃ samaññā, tasmā ‘‘brahmakāyikānaṃ devāna’’nti paṭhamajjhānabhūmikānaṃyeva gahaṇaṃ veditabbaṃ. Saha byayati gacchatīti sahabyo, sahavattanako. Tassa bhāvo sahabyatā, sahapavattīti āha ‘‘sahabhāvaṃ upagacchatī’’ti. Kappo āyuppamāṇanti ettha yadipi brahmapārisajjādīnaṃ āyuno antaraṃ atthi, ukkaṭṭhaparicchedena panetaṃ vuttanti dassento ‘‘paṭhamajjhānaṃ atthi hīna’’ntiādimāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dve kappā āyuppamāṇa"
      },
      "nti ettha pana hīnajjhānena nibbattānaṃ vasena ayaṃ paricchedo katoti dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘dutiyajjhānaṃ vuttanayeneva tividhaṃ hotī’’"
      },
      "tiādi āraddhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cattāro kappā"
      },
      "ti ettha pana ukkaṭṭhaparicchedena catusaṭṭhi kappā vattabbāti dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yaṃ heṭṭhā vuttaṃ ‘kappo dve kappā’ti , kampi āharitvā attho veditabbo’’"
      },
      "ti āha. Kathaṃ panettha ayamattho labbhatīti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kappoti ca guṇassapi nāma’’"
      },
      "nti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭhamaṃ vutto kappo,"
      },
      " tato ekena guṇena, ekasmiṃ vāre gaṇanāyāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dve kappā hontī"
      },
      "ti ekavāragaṇanāya kappassa dviguṇitattā dve mahākappā hontīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dutiyenā"
      },
      "ti dutiyavāragaṇanāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cattāro"
      },
      "ti dutiyavāragaṇanāya dvīsu kappesu dviguṇitesu ",
      " cattāro mahākappā hontīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puna te cattāro kappā"
      },
      "ti vuttanayena dve vāre guṇetvā ye cattāro kappā dassitā, puna te cattāro kappā catugguṇā hontīti attho. Idaṃ vuttaṃ hoti – dve vāre guṇetvā ye cattāro kappā dassitā, tesu catukkhattuṃ guṇitesu catusaṭṭhi kappā sampajjantīti. Tathā hi cattāro ekasmiṃ vāre guṇitā aṭṭha honti, puna te aṭṭha dutiyavāre guṇitā soḷasa honti, puna te soḷasa tatiyavāre guṇitā dvattiṃsa honti, puna te dvattiṃsa catutthavāre guṇitā catusaṭṭhi honti. Tenevāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘imehi catūhi guṇehi guṇitā ekena guṇena aṭṭha hontī’’"
      },
      "tiādi. Ettha ca heṭṭhā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uposathasutte"
      },
      " (a. ni. 3.71) –"
    ],
    "innerText": "Dve kappā āyuppamāṇanti ettha pana hīnajjhānena nibbattānaṃ vasena ayaṃ paricchedo katoti dassetuṃ ‘‘dutiyajjhānaṃ vuttanayeneva tividhaṃ hotī’’tiādi āraddhaṃ. Cattāro kappāti ettha pana ukkaṭṭhaparicchedena catusaṭṭhi kappā vattabbāti dassento ‘‘yaṃ heṭṭhā vuttaṃ ‘kappo dve kappā’ti , kampi āharitvā attho veditabbo’’ti āha. Kathaṃ panettha ayamattho labbhatīti āha ‘‘kappoti ca guṇassapi nāma’’nti. Tattha paṭhamaṃ vutto kappo, tato ekena guṇena, ekasmiṃ vāre gaṇanāyāti attho. Dve kappā hontīti ekavāragaṇanāya kappassa dviguṇitattā dve mahākappā hontīti attho. Dutiyenāti dutiyavāragaṇanāya. Cattāroti dutiyavāragaṇanāya dvīsu kappesu dviguṇitesu cattāro mahākappā hontīti attho. Puna te cattāro kappāti vuttanayena dve vāre guṇetvā ye cattāro kappā dassitā, puna te cattāro kappā catugguṇā hontīti attho. Idaṃ vuttaṃ hoti – dve vāre guṇetvā ye cattāro kappā dassitā, tesu catukkhattuṃ guṇitesu catusaṭṭhi kappā sampajjantīti. Tathā hi cattāro ekasmiṃ vāre guṇitā aṭṭha honti, puna te aṭṭha dutiyavāre guṇitā soḷasa honti, puna te soḷasa tatiyavāre guṇitā dvattiṃsa honti, puna te dvattiṃsa catutthavāre guṇitā catusaṭṭhi honti. Tenevāha ‘‘imehi catūhi guṇehi guṇitā ekena guṇena aṭṭha hontī’’tiādi. Ettha ca heṭṭhā uposathasutte (a. ni. 3.71) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Yāni mānusakāni paññāsa vassāni, cātumahārājikānaṃ devānaṃ eso eko rattindivo’’ti –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Ādinā kāmāvacaradevānameva āyuppamāṇaṃ dassitaṃ. Heṭṭhāyeva –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Tayome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Idha, bhikkhave, ekacco puggalo sabbaso rūpasaññānaṃ samatikkamā…pe… ākāsānañcāyatanūpagānaṃ devānaṃ sahabyataṃ upapajjati. Ākāsānañcāyatanūpagānaṃ, bhikkhave, devānaṃ vīsati kappasahassāni āyuppamāṇa’’nti (a. ni. 3.117) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Ādinā arūpāvacarānaṃyeva āyuppamāṇaṃ vuttaṃ. Idha pana rūpāvacarānameva āyuppamāṇaṃ dassitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vibhaṅgapāḷiyaṃ"
      },
      " (vibha. 1022) pana ‘‘manussānaṃ kittakaṃ āyuppamāṇaṃ, vassasataṃ appaṃ vā bhiyyo’’tiādinā devamanussānañceva rūpārūpāvacarasattānañca āyuppamāṇaṃ dassitaṃ."
    ],
    "innerText": "Ādinā arūpāvacarānaṃyeva āyuppamāṇaṃ vuttaṃ. Idha pana rūpāvacarānameva āyuppamāṇaṃ dassitaṃ. Vibhaṅgapāḷiyaṃ (vibha. 1022) pana ‘‘manussānaṃ kittakaṃ āyuppamāṇaṃ, vassasataṃ appaṃ vā bhiyyo’’tiādinā devamanussānañceva rūpārūpāvacarasattānañca āyuppamāṇaṃ dassitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha sammāsambuddhena manussānaṃ devānañca āyuṃ paricchindamānena catūsu apāyesu bhummadevesu ",
      " ca āyu na paricchinnaṃ. Taṃ kasmāti? Niraye tāva kammameva pamāṇaṃ. Yāva kammaṃ na khīyati, tāva paccanti. Tathā sesaapāyesu. Bhummadevānampi kammameva pamāṇaṃ. Tattha nibbattā hi keci sattāhamattaṃ tiṭṭhanti, keci aḍḍhamāsaṃ, kappaṃ tiṭṭhamānāpi atthiyeva. Tattha manussesu gihibhāve ṭhitāyeva sotāpannāpi honti, sakadāgāmiphalaṃ anāgāmiphalaṃ arahattampi pāpuṇanti, tesu sotāpannādayo yāvajīvaṃ ",
      " tiṭṭhanti, khīṇāsavā pana parinibbāyanti vā pabbajanti vā. Kasmā? Arahattaṃ nāma seṭṭhaguṇaṃ, gihiliṅgaṃ hīnaṃ, taṃ hīnatāya uttamaṃ guṇaṃ dhāretuṃ na sakkoti, tasmā te parinibbātukāmā vā honti pabbajitukāmā vā. Bhummadevā pana arahattaṃ pattāpi yāvajīvaṃ tiṭṭhanti, chasu kāmāvacaresu devesu sotāpannasakadāgāmino yāvajīvaṃ tiṭṭhanti, anāgāminā rūpabhavaṃ gantuṃ vaṭṭati khīṇāsavena parinibbātuṃ. Kasmā? Nilīyanokāsassa abhāvā. Rūpāvacarārūpāvacaresu sabbepi yāvajīvaṃ tiṭṭhanti, tattha rūpāvacare nibbattā sotāpannasakadāgāmino na puna idhāgacchanti, tattheva parinibbāyanti. Ete hi jhānaanāgāmino nāma."
    ],
    "innerText": "Tattha sammāsambuddhena manussānaṃ devānañca āyuṃ paricchindamānena catūsu apāyesu bhummadevesu ca āyu na paricchinnaṃ. Taṃ kasmāti? Niraye tāva kammameva pamāṇaṃ. Yāva kammaṃ na khīyati, tāva paccanti. Tathā sesaapāyesu. Bhummadevānampi kammameva pamāṇaṃ. Tattha nibbattā hi keci sattāhamattaṃ tiṭṭhanti, keci aḍḍhamāsaṃ, kappaṃ tiṭṭhamānāpi atthiyeva. Tattha manussesu gihibhāve ṭhitāyeva sotāpannāpi honti, sakadāgāmiphalaṃ anāgāmiphalaṃ arahattampi pāpuṇanti, tesu sotāpannādayo yāvajīvaṃ tiṭṭhanti, khīṇāsavā pana parinibbāyanti vā pabbajanti vā. Kasmā? Arahattaṃ nāma seṭṭhaguṇaṃ, gihiliṅgaṃ hīnaṃ, taṃ hīnatāya uttamaṃ guṇaṃ dhāretuṃ na sakkoti, tasmā te parinibbātukāmā vā honti pabbajitukāmā vā. Bhummadevā pana arahattaṃ pattāpi yāvajīvaṃ tiṭṭhanti, chasu kāmāvacaresu devesu sotāpannasakadāgāmino yāvajīvaṃ tiṭṭhanti, anāgāminā rūpabhavaṃ gantuṃ vaṭṭati khīṇāsavena parinibbātuṃ. Kasmā? Nilīyanokāsassa abhāvā. Rūpāvacarārūpāvacaresu sabbepi yāvajīvaṃ tiṭṭhanti, tattha rūpāvacare nibbattā sotāpannasakadāgāmino na puna idhāgacchanti, tattheva parinibbāyanti. Ete hi jhānaanāgāmino nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Aṭṭhasamāpattilābhīnaṃ pana kiṃ niyameti? Paguṇajjhānaṃ. Yadevassa paguṇaṃ hoti, tena upapajjati. Sabbesu paguṇesu kiṃ niyameti? Nevasaññānāsaññāyatanasamāpatti. Ekaṃseneva hi so nevasaññānāsaññāyatane upapajjati. Navasu brahmalokesu nibbattaariyasāvakānaṃ tatrūpapattipi uparūpapattipi, na heṭṭhūpapatti. Puthujjanānaṃ pana tatrūpapattipi hoti, uparūpapattipi, heṭṭhūpapattipi. Pañcasu suddhāvāsesu catūsu ca arūpesu ariyasāvakānaṃ tatrūpapattipi hoti uparūpapattipi. Paṭhamajjhānabhūmiyaṃ nibbatto anāgāmī nava brahmaloke sodhetvā matthake ṭhito parinibbāti. Vehapphalaṃ, akaniṭṭhaṃ, nevasaññānāsaññāyatananti ime tayo devalokā seṭṭhabhavā nāma. Imesu tīsu ṭhānesu nibbattaanāgāmino neva uddhaṃ gacchanti, na adho, tattha tattheva parinibbāyantīti idaṃ pakiṇṇakaṃ veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṭhamanānākaraṇasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4-6. Dutiyanānākaraṇasuttādivaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "124-6"
      },
      ". Catutthe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "te dhamme"
      },
      "ti te ‘‘rūpagata’’ntiādinā nayena vutte rūpādayo dhamme. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aniccato"
      },
      "ti iminā niccappaṭikkhepato tesaṃ aniccatamāha, tato eva ca udayavayavantato vipariṇāmato tāvakālikato ca te aniccāti jotitaṃ hoti. Yañhi nibbattaṃ hoti, taṃ udayavayaparicchinnaṃ ",
      ". Jarāya maraṇena ca tadeva viparītaṃ, ittarakkhaṇameva ca hotīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dukkhato"
      },
      "ti iminā sukhappaṭikkhepato tesaṃ ",
      " dukkhatamāha. Tato eva ca abhiṇhappaṭipīḷanato dukkhavatthuto ca te dukkhāti jotitaṃ hoti. Udayavayavantatāya hi te abhiṇhappaṭipīḷanato nirantaradukkhatāya dukkhasseva ca adhiṭṭhānabhūtā. Paccayayāpanīyatāya rogamūlatāya ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rogato"
      },
      ". Dukkhatāsūlayogato kilesāsucipaggharaṇato uppādajarābhaṅgehi uddhumātaparipakkapabhinnato ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gaṇḍato"
      },
      ". Pīḷājananato, antotudanato, dunnīharaṇato ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sallato"
      },
      ". Avaḍḍhiāvahanato aghavatthuto ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aghato"
      },
      ". Aseribhāvajananato ābādhapadaṭṭhānatāya ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ābādhato"
      },
      ". Avasavattanato avidheyyatāya ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "parato"
      },
      ". Byādhijarāmaraṇehi palujjanīyatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "palokato"
      },
      ". Sāminivāsikārakavedakaadhiṭṭhāyakavirahato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "suññato"
      },
      ". Attappaṭikkhepaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anattato"
      },
      ". Rūpādidhammā hi na ettha attā atthīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anattā"
      },
      ". Evaṃ sayampi attā na hontīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anattā"
      },
      ". Tena abyāpārato nirīhato tucchato anattāti dīpitaṃ hoti. Lakkhaṇattayameva sukhāvabodhanatthaṃ ekādasahi padehi vibhajitvā gahitanti dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tatthā’’"
      },
      "tiādi vuttaṃ. Pañcamachaṭṭhāni uttānatthāneva."
    ],
    "innerText": "124-6. Catutthe te dhammeti te ‘‘rūpagata’’ntiādinā nayena vutte rūpādayo dhamme. Aniccatoti iminā niccappaṭikkhepato tesaṃ aniccatamāha, tato eva ca udayavayavantato vipariṇāmato tāvakālikato ca te aniccāti jotitaṃ hoti. Yañhi nibbattaṃ hoti, taṃ udayavayaparicchinnaṃ . Jarāya maraṇena ca tadeva viparītaṃ, ittarakkhaṇameva ca hotīti. Dukkhatoti iminā sukhappaṭikkhepato tesaṃ dukkhatamāha. Tato eva ca abhiṇhappaṭipīḷanato dukkhavatthuto ca te dukkhāti jotitaṃ hoti. Udayavayavantatāya hi te abhiṇhappaṭipīḷanato nirantaradukkhatāya dukkhasseva ca adhiṭṭhānabhūtā. Paccayayāpanīyatāya rogamūlatāya ca rogato. Dukkhatāsūlayogato kilesāsucipaggharaṇato uppādajarābhaṅgehi uddhumātaparipakkapabhinnato ca gaṇḍato. Pīḷājananato, antotudanato, dunnīharaṇato ca sallato. Avaḍḍhiāvahanato aghavatthuto ca aghato. Aseribhāvajananato ābādhapadaṭṭhānatāya ca ābādhato. Avasavattanato avidheyyatāya ca parato. Byādhijarāmaraṇehi palujjanīyatāya palokato. Sāminivāsikārakavedakaadhiṭṭhāyakavirahato suññato. Attappaṭikkhepaṭṭhena anattato. Rūpādidhammā hi na ettha attā atthīti anattā. Evaṃ sayampi attā na hontīti anattā. Tena abyāpārato nirīhato tucchato anattāti dīpitaṃ hoti. Lakkhaṇattayameva sukhāvabodhanatthaṃ ekādasahi padehi vibhajitvā gahitanti dassetuṃ ‘‘tatthā’’tiādi vuttaṃ. Pañcamachaṭṭhāni uttānatthāneva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dutiyanānākaraṇasuttādivaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Paṭhamatathāgataacchariyasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "127"
      },
      ". Sattame vattamānasamīpe vattamāne viya voharitabbanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘okkamatī’’"
      },
      "ti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘okkanto hotīti attho’’"
      },
      "ti. Dasasahassacakkavāḷapattharaṇo samujjalabhāvena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uḷāro. Devānubhāva"
      },
      "nti devānaṃ pabhānubhāvaṃ. Devānañhi pabhaṃ so obhāso adhibhavati, na deve. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘devāna’’"
      },
      "ntiādi. Rukkhagacchādinā kenaci na haññatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aghā,"
      },
      " asambādhā. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘niccavivarā’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asaṃvutā"
      },
      "ti heṭṭhā upari kenaci apihitā. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘heṭṭhāpi appatiṭṭhā’’"
      },
      "ti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pi"
      },
      "-saddena yathā heṭṭhā udakassa pidhāyikā sandhārikā pathavī natthi asaṃvutā lokantarikā, evaṃ uparipi cakkavāḷesu devavimānānaṃ abhāvato asaṃvutā appatiṭṭhāti dasseti. Andhakāro ettha atthīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "andhakārā. Cakkhuviññāṇaṃ na jāyati"
      },
      " ālokassa abhāvato, na cakkhuno. Tathā hi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tenobhāsena"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aññamaññaṃ sañjānantī’’"
      },
      "ti vuttaṃ. Jambudīpe ṭhitamajjhanhikavelāya pubbavidehavāsīnaṃ atthaṅgamavasena upaḍḍhaṃ sūriyamaṇḍalaṃ paññāyati, aparagoyānavāsīnaṃ uggamanavasena. Evaṃ sesadīpesupīti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ekappahāreneva tīsu dīpesu paññāyantī’’"
      },
      "ti. Ito aññathā dvīsu eva dīpesu paññāyanti. Ekekāya disāya navanavayojanasatasahassāni andhakāravidhamanampi imināva nayena daṭṭhabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pabhāya nappahontī"
      },
      "ti ",
      " attano pabhāya obhāsituṃ nābhisambhuṇanti. Yugandharapabbatamatthakasamappamāṇe ākāse vicaraṇato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘cakkavāḷapabbatassa vemajjhena carantī’’"
      },
      "ti vuttaṃ."
    ],
    "innerText": "127. Sattame vattamānasamīpe vattamāne viya voharitabbanti ‘‘okkamatī’’ti āha ‘‘okkanto hotīti attho’’ti. Dasasahassacakkavāḷapattharaṇo samujjalabhāvena uḷāro. Devānubhāvanti devānaṃ pabhānubhāvaṃ. Devānañhi pabhaṃ so obhāso adhibhavati, na deve. Tenāha ‘‘devāna’’ntiādi. Rukkhagacchādinā kenaci na haññatīti aghā, asambādhā. Tenāha ‘‘niccavivarā’’ti. Asaṃvutāti heṭṭhā upari kenaci apihitā. Tenāha ‘‘heṭṭhāpi appatiṭṭhā’’ti. Tattha pi-saddena yathā heṭṭhā udakassa pidhāyikā sandhārikā pathavī natthi asaṃvutā lokantarikā, evaṃ uparipi cakkavāḷesu devavimānānaṃ abhāvato asaṃvutā appatiṭṭhāti dasseti. Andhakāro ettha atthīti andhakārā. Cakkhuviññāṇaṃ na jāyati ālokassa abhāvato, na cakkhuno. Tathā hi ‘‘tenobhāsenaaññamaññaṃ sañjānantī’’ti vuttaṃ. Jambudīpe ṭhitamajjhanhikavelāya pubbavidehavāsīnaṃ atthaṅgamavasena upaḍḍhaṃ sūriyamaṇḍalaṃ paññāyati, aparagoyānavāsīnaṃ uggamanavasena. Evaṃ sesadīpesupīti āha ‘‘ekappahāreneva tīsu dīpesu paññāyantī’’ti. Ito aññathā dvīsu eva dīpesu paññāyanti. Ekekāya disāya navanavayojanasatasahassāni andhakāravidhamanampi imināva nayena daṭṭhabbaṃ. Pabhāya nappahontīti attano pabhāya obhāsituṃ nābhisambhuṇanti. Yugandharapabbatamatthakasamappamāṇe ākāse vicaraṇato ‘‘cakkavāḷapabbatassa vemajjhena carantī’’ti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Byāvaṭā"
      },
      "ti khādanatthaṃ gaṇhituṃ upakkamantā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Viparivattitvā"
      },
      "ti vivaṭṭitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Chijjitvā"
      },
      "ti mucchāpavattiyā ṭhitaṭṭhānato muccitvā, aṅgapaccaṅgachedanavasena vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "chijjitvā. Accantakhāre"
      },
      "ti ātapasantapābhāvena atisītabhāvaṃ sandhāya accantakhāratā vuttā siyā. Na hi taṃ kappasaṇṭhānaudakaṃ sampattikaramahāmeghavuṭṭhaṃ pathavisandhārakaṃ kappavināsakaudakaṃ viya khāraṃ bhavitumarahati, tathā sati pathavīpi vilīyeyya, tesaṃ vā pāpakammaphalena petānaṃ pakatiudakassa pubbakheḷabhāvāpatti viya tassa udakassa khārabhāvāpatti hotīti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘accantakhāre udake’’"
      },
      "ti."
    ],
    "innerText": "Byāvaṭāti khādanatthaṃ gaṇhituṃ upakkamantā. Viparivattitvāti vivaṭṭitvā. Chijjitvāti mucchāpavattiyā ṭhitaṭṭhānato muccitvā, aṅgapaccaṅgachedanavasena vā chijjitvā. Accantakhāreti ātapasantapābhāvena atisītabhāvaṃ sandhāya accantakhāratā vuttā siyā. Na hi taṃ kappasaṇṭhānaudakaṃ sampattikaramahāmeghavuṭṭhaṃ pathavisandhārakaṃ kappavināsakaudakaṃ viya khāraṃ bhavitumarahati, tathā sati pathavīpi vilīyeyya, tesaṃ vā pāpakammaphalena petānaṃ pakatiudakassa pubbakheḷabhāvāpatti viya tassa udakassa khārabhāvāpatti hotīti vuttaṃ ‘‘accantakhāre udake’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṭhamatathāgataacchariyasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Dutiyatathāgataacchariyasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "128"
      },
      ". Aṭṭhame ālīyanti āramitabbaṭṭhena sevīyantīti ālayā, pañca kāmaguṇā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āramantī"
      },
      "ti ratiṃ vindanti kīḷanti laḷanti. Ālīyanti vā allīyantā abhiramaṇavasena sevantīti ālayā, taṇhāvicaritāni. Tehi ālayehi ramantīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ālayārāmā"
      },
      ". Yatheva hi susajjitaṃ pupphaphalabharitarukkhādisampannauyyānaṃ paviṭṭho rājā tāya sampattiyā ramati, sammudito āmoditappamodito hoti, na ukkaṇṭheti, sāyampi nikkhamituṃ na icchati, evamimehi kāmālayataṇhālayehi sattā ramanti, saṃsāravaṭṭe pamuditā anukkaṇṭhitā vasanti. Tena tesaṃ bhagavā duvidhampi ālayaṃ uyyānabhūmiṃ viya dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ālayārāmā’’"
      },
      "tiādimāha. Sesamettha uttānameva."
    ],
    "innerText": "128. Aṭṭhame ālīyanti āramitabbaṭṭhena sevīyantīti ālayā, pañca kāmaguṇā. Āramantīti ratiṃ vindanti kīḷanti laḷanti. Ālīyanti vā allīyantā abhiramaṇavasena sevantīti ālayā, taṇhāvicaritāni. Tehi ālayehi ramantīti ālayārāmā. Yatheva hi susajjitaṃ pupphaphalabharitarukkhādisampannauyyānaṃ paviṭṭho rājā tāya sampattiyā ramati, sammudito āmoditappamodito hoti, na ukkaṇṭheti, sāyampi nikkhamituṃ na icchati, evamimehi kāmālayataṇhālayehi sattā ramanti, saṃsāravaṭṭe pamuditā anukkaṇṭhitā vasanti. Tena tesaṃ bhagavā duvidhampi ālayaṃ uyyānabhūmiṃ viya dassento ‘‘ālayārāmā’’tiādimāha. Sesamettha uttānameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dutiyatathāgataacchariyasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9-10. Ānandaacchariyasuttādivaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "129-130"
      },
      ". Navame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭisanthāradhamma"
      },
      "nti pakaticārittavasena vuttaṃ, upagatānaṃ pana bhikkhūnaṃ ",
      " bhikkhunīnañca pucchāvissajjanavasena ceva cittarucivasena ca yathākālaṃ dhammaṃ desetiyeva, upāsakaupāsikānaṃ pana upanisinnakakathāvasena. Dasamaṃ uttānameva."
    ],
    "innerText": "129-130. Navame paṭisanthāradhammanti pakaticārittavasena vuttaṃ, upagatānaṃ pana bhikkhūnaṃ bhikkhunīnañca pucchāvissajjanavasena ceva cittarucivasena ca yathākālaṃ dhammaṃ desetiyeva, upāsakaupāsikānaṃ pana upanisinnakakathāvasena. Dasamaṃ uttānameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ānandaacchariyasuttādivaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Bhayavaggavaṇṇanā niṭṭhitā."
  }
]