[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "(19) 4. Brāhmaṇavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Yodhājīvasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "181"
      },
      ". ‘‘Catūhi ",
      ", bhikkhave, aṅgehi samannāgato yodhājīvo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhaṃ gacchati. Katamehi catūhi? Idha, bhikkhave, yodhājīvo ṭhānakusalo ca hoti, dūrepātī ca, akkhaṇavedhī ca, mahato ca kāyassa padāletā. Imehi kho, bhikkhave, catūhi aṅgehi samannāgato yodhājīvo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhaṃ gacchati. Evamevaṃ ",
      " kho, bhikkhave, catūhi dhammehi samannāgato bhikkhu āhuneyyo hoti pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassa. Katamehi catūhi? Idha, bhikkhave, bhikkhu ṭhānakusalo ca hoti, dūrepātī ca, akkhaṇavedhī ca, mahato ca kāyassa padāletā."
    ],
    "innerText": "181. ‘‘Catūhi , bhikkhave, aṅgehi samannāgato yodhājīvo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhaṃ gacchati. Katamehi catūhi? Idha, bhikkhave, yodhājīvo ṭhānakusalo ca hoti, dūrepātī ca, akkhaṇavedhī ca, mahato ca kāyassa padāletā. Imehi kho, bhikkhave, catūhi aṅgehi samannāgato yodhājīvo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhaṃ gacchati. Evamevaṃ kho, bhikkhave, catūhi dhammehi samannāgato bhikkhu āhuneyyo hoti pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassa. Katamehi catūhi? Idha, bhikkhave, bhikkhu ṭhānakusalo ca hoti, dūrepātī ca, akkhaṇavedhī ca, mahato ca kāyassa padāletā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu ṭhānakusalo hoti? Idha, bhikkhave, bhikkhu sīlavā hoti…pe… samādāya sikkhati sikkhāpadesu. Evaṃ kho, bhikkhave, bhikkhu ṭhānakusalo hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, bhikkhu dūrepātī hoti? Idha, bhikkhave ",
      ", bhikkhu yaṃ kiñci rūpaṃ atītānāgatapaccuppannaṃ ajjhattaṃ vā bahiddhā vā oḷārikaṃ vā sukhumaṃ vā hīnaṃ vā paṇītaṃ vā yaṃ dūre santike vā, sabbaṃ rūpaṃ ‘netaṃ mama, nesohamasmi, na meso attā’ti evametaṃ yathābhūtaṃ sammappaññāya passati. Yā kāci vedanā…pe… yā kāci saññā… ye keci saṅkhārā… yaṃ kiñci viññāṇaṃ atītānāgatapaccuppannaṃ ajjhattaṃ vā bahiddhā vā oḷārikaṃ vā sukhumaṃ vā hīnaṃ vā paṇītaṃ vā yaṃ dūre santike vā ",
      ", sabbaṃ viññāṇaṃ ‘netaṃ mama, nesohamasmi, na meso attā’ti evametaṃ yathābhūtaṃ sammappaññāya passati. Evaṃ kho, bhikkhave, bhikkhu dūrepātī hoti."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu dūrepātī hoti? Idha, bhikkhave , bhikkhu yaṃ kiñci rūpaṃ atītānāgatapaccuppannaṃ ajjhattaṃ vā bahiddhā vā oḷārikaṃ vā sukhumaṃ vā hīnaṃ vā paṇītaṃ vā yaṃ dūre santike vā, sabbaṃ rūpaṃ ‘netaṃ mama, nesohamasmi, na meso attā’ti evametaṃ yathābhūtaṃ sammappaññāya passati. Yā kāci vedanā…pe… yā kāci saññā… ye keci saṅkhārā… yaṃ kiñci viññāṇaṃ atītānāgatapaccuppannaṃ ajjhattaṃ vā bahiddhā vā oḷārikaṃ vā sukhumaṃ vā hīnaṃ vā paṇītaṃ vā yaṃ dūre santike vā , sabbaṃ viññāṇaṃ ‘netaṃ mama, nesohamasmi, na meso attā’ti evametaṃ yathābhūtaṃ sammappaññāya passati. Evaṃ kho, bhikkhave, bhikkhu dūrepātī hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca ",
      ", bhikkhave, bhikkhu akkhaṇavedhī hoti? Idha, bhikkhave, bhikkhu ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti…pe… ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti. Evaṃ kho, bhikkhave, bhikkhu akkhaṇavedhī hoti."
    ],
    "innerText": "‘‘Kathañca , bhikkhave, bhikkhu akkhaṇavedhī hoti? Idha, bhikkhave, bhikkhu ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti…pe… ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti. Evaṃ kho, bhikkhave, bhikkhu akkhaṇavedhī hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu mahato kāyassa padāletā hoti? Idha, bhikkhave, bhikkhu mahantaṃ avijjākkhandhaṃ padāletā. Evaṃ kho, bhikkhave, bhikkhu mahato kāyassa padāletā hoti. Imehi kho, bhikkhave, catūhi dhammehi samannāgato bhikkhu āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassā’’ti. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Pāṭibhogasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "182"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kathā. 624]"
      },
      " ‘‘Catunnaṃ ",
      ", bhikkhave, dhammānaṃ natthi koci pāṭibhogo – samaṇo vā brāhmaṇo vā devo vā māro vā brahmā vā koci vā lokasmiṃ."
    ],
    "innerText": "182.[kathā. 624] ‘‘Catunnaṃ , bhikkhave, dhammānaṃ natthi koci pāṭibhogo – samaṇo vā brāhmaṇo vā devo vā māro vā brahmā vā koci vā lokasmiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamesaṃ catunnaṃ? ‘Jarādhammaṃ mā jīrī’ti natthi koci pāṭibhogo – samaṇo vā ",
      " brāhmaṇo vā devo vā māro vā brahmā vā koci vā lokasmiṃ; ‘byādhidhammaṃ mā byādhiyī’ti natthi koci pāṭibhogo – samaṇo vā brāhmaṇo vā devo vā māro vā brahmā vā koci vā lokasmiṃ; ‘maraṇadhammaṃ mā mīyī’ti natthi koci pāṭibhogo – samaṇo vā brāhmaṇo vā devo vā māro vā brahmā vā koci vā lokasmiṃ; ‘yāni kho pana tāni pubbe attanā katāni pāpakāni kammāni saṃkilesikāni ponobhavikāni sadarāni dukkhavipākāni āyatiṃ jātijarāmaraṇikāni, tesaṃ vipāko mā nibbattī’ti natthi koci pāṭibhogo – samaṇo vā brāhmaṇo vā devo vā māro vā brahmā vā koci vā lokasmiṃ."
    ],
    "innerText": "‘‘Katamesaṃ catunnaṃ? ‘Jarādhammaṃ mā jīrī’ti natthi koci pāṭibhogo – samaṇo vā brāhmaṇo vā devo vā māro vā brahmā vā koci vā lokasmiṃ; ‘byādhidhammaṃ mā byādhiyī’ti natthi koci pāṭibhogo – samaṇo vā brāhmaṇo vā devo vā māro vā brahmā vā koci vā lokasmiṃ; ‘maraṇadhammaṃ mā mīyī’ti natthi koci pāṭibhogo – samaṇo vā brāhmaṇo vā devo vā māro vā brahmā vā koci vā lokasmiṃ; ‘yāni kho pana tāni pubbe attanā katāni pāpakāni kammāni saṃkilesikāni ponobhavikāni sadarāni dukkhavipākāni āyatiṃ jātijarāmaraṇikāni, tesaṃ vipāko mā nibbattī’ti natthi koci pāṭibhogo – samaṇo vā brāhmaṇo vā devo vā māro vā brahmā vā koci vā lokasmiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Imesaṃ ",
      " kho, bhikkhave, catunnaṃ dhammānaṃ natthi koci pāṭibhogo – samaṇo vā brāhmaṇo vā devo vā māro vā brahmā vā koci vā lokasmi’’nti. Dutiyaṃ."
    ],
    "innerText": "‘‘Imesaṃ kho, bhikkhave, catunnaṃ dhammānaṃ natthi koci pāṭibhogo – samaṇo vā brāhmaṇo vā devo vā māro vā brahmā vā koci vā lokasmi’’nti. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Sutasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "183"
      },
      ". Ekaṃ samayaṃ bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Atha kho vassakāro brāhmaṇo magadhamahāmatto yena bhagavā ",
      " tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho vassakāro brāhmaṇo magadhamahāmatto bhagavantaṃ etadavoca –"
    ],
    "innerText": "183. Ekaṃ samayaṃ bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Atha kho vassakāro brāhmaṇo magadhamahāmatto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho vassakāro brāhmaṇo magadhamahāmatto bhagavantaṃ etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ahañhi, bho gotama, evaṃvādī evaṃdiṭṭhi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[evaṃdiṭṭhī (sabbattha)]"
      },
      " – ‘yo koci diṭṭhaṃ bhāsati – evaṃ me diṭṭhanti, natthi tato doso; yo koci sutaṃ bhāsati – evaṃ me sutanti, natthi tato doso; yo koci mutaṃ bhāsati – evaṃ me mutanti, natthi tato ",
      " doso; yo koci viññātaṃ bhāsati – evaṃ me viññātanti, natthi tato doso’’’ti."
    ],
    "innerText": "‘‘Ahañhi, bho gotama, evaṃvādī evaṃdiṭṭhi [evaṃdiṭṭhī (sabbattha)] – ‘yo koci diṭṭhaṃ bhāsati – evaṃ me diṭṭhanti, natthi tato doso; yo koci sutaṃ bhāsati – evaṃ me sutanti, natthi tato doso; yo koci mutaṃ bhāsati – evaṃ me mutanti, natthi tato doso; yo koci viññātaṃ bhāsati – evaṃ me viññātanti, natthi tato doso’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Nāhaṃ, brāhmaṇa, sabbaṃ diṭṭhaṃ bhāsitabbanti vadāmi; na panāhaṃ, brāhmaṇa, sabbaṃ diṭṭhaṃ na bhāsitabbanti vadāmi; nāhaṃ, brāhmaṇa, sabbaṃ sutaṃ bhāsitabbanti vadāmi; na panāhaṃ, brāhmaṇa, sabbaṃ sutaṃ na bhāsitabbanti ",
      " vadāmi; nāhaṃ, brāhmaṇa, sabbaṃ mutaṃ bhāsitabbanti vadāmi; na panāhaṃ, brāhmaṇa, sabbaṃ mutaṃ na bhāsitabbanti vadāmi; nāhaṃ, brāhmaṇa, sabbaṃ viññātaṃ bhāsitabbanti vadāmi; na panāhaṃ, brāhmaṇa, sabbaṃ viññātaṃ na bhāsitabbanti vadāmi."
    ],
    "innerText": "‘‘Nāhaṃ, brāhmaṇa, sabbaṃ diṭṭhaṃ bhāsitabbanti vadāmi; na panāhaṃ, brāhmaṇa, sabbaṃ diṭṭhaṃ na bhāsitabbanti vadāmi; nāhaṃ, brāhmaṇa, sabbaṃ sutaṃ bhāsitabbanti vadāmi; na panāhaṃ, brāhmaṇa, sabbaṃ sutaṃ na bhāsitabbanti vadāmi; nāhaṃ, brāhmaṇa, sabbaṃ mutaṃ bhāsitabbanti vadāmi; na panāhaṃ, brāhmaṇa, sabbaṃ mutaṃ na bhāsitabbanti vadāmi; nāhaṃ, brāhmaṇa, sabbaṃ viññātaṃ bhāsitabbanti vadāmi; na panāhaṃ, brāhmaṇa, sabbaṃ viññātaṃ na bhāsitabbanti vadāmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Yañhi, brāhmaṇa, diṭṭhaṃ bhāsato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyanti, evarūpaṃ diṭṭhaṃ na bhāsitabbanti vadāmi. Yañca khvassa, brāhmaṇa, diṭṭhaṃ abhāsato kusalā dhammā parihāyanti, akusalā dhammā abhivaḍḍhanti, evarūpaṃ diṭṭhaṃ bhāsitabbanti vadāmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yañhi, brāhmaṇa, sutaṃ bhāsato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyanti ",
      ", evarūpaṃ sutaṃ na bhāsitabbanti vadāmi. Yañca khvassa, brāhmaṇa, sutaṃ abhāsato kusalā dhammā parihāyanti, akusalā dhammā abhivaḍḍhanti, evarūpaṃ sutaṃ bhāsitabbanti vadāmi."
    ],
    "innerText": "‘‘Yañhi, brāhmaṇa, sutaṃ bhāsato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyanti , evarūpaṃ sutaṃ na bhāsitabbanti vadāmi. Yañca khvassa, brāhmaṇa, sutaṃ abhāsato kusalā dhammā parihāyanti, akusalā dhammā abhivaḍḍhanti, evarūpaṃ sutaṃ bhāsitabbanti vadāmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yañhi, brāhmaṇa, mutaṃ bhāsato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyanti, evarūpaṃ mutaṃ na bhāsitabbanti vadāmi. Yañca khvassa, brāhmaṇa, mutaṃ abhāsato kusalā dhammā parihāyanti, akusalā dhammā abhivaḍḍhanti, evarūpaṃ mutaṃ bhāsitabbanti vadāmi ",
      "."
    ],
    "innerText": "‘‘Yañhi, brāhmaṇa, mutaṃ bhāsato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyanti, evarūpaṃ mutaṃ na bhāsitabbanti vadāmi. Yañca khvassa, brāhmaṇa, mutaṃ abhāsato kusalā dhammā parihāyanti, akusalā dhammā abhivaḍḍhanti, evarūpaṃ mutaṃ bhāsitabbanti vadāmi ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yañhi ",
      ", brāhmaṇa, viññātaṃ bhāsato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyanti, evarūpaṃ viññātaṃ na bhāsitabbanti vadāmi. Yañca khvassa, brāhmaṇa, viññātaṃ abhāsato kusalā dhammā parihāyanti, akusalā dhammā abhivaḍḍhanti, evarūpaṃ viññātaṃ bhāsitabbanti vadāmī’’ti."
    ],
    "innerText": "‘‘Yañhi , brāhmaṇa, viññātaṃ bhāsato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyanti, evarūpaṃ viññātaṃ na bhāsitabbanti vadāmi. Yañca khvassa, brāhmaṇa, viññātaṃ abhāsato kusalā dhammā parihāyanti, akusalā dhammā abhivaḍḍhanti, evarūpaṃ viññātaṃ bhāsitabbanti vadāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha kho vassakāro brāhmaṇo magadhamahāmatto bhagavato bhāsitaṃ abhinanditvā anumoditvā uṭṭhāyāsanā pakkāmīti. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Abhayasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "184"
      },
      ". Atha kho jāṇussoṇi brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho jāṇussoṇi brāhmaṇo bhagavantaṃ etadavoca –"
    ],
    "innerText": "184. Atha kho jāṇussoṇi brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho jāṇussoṇi brāhmaṇo bhagavantaṃ etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ahañhi, bho gotama, evaṃvādī evaṃdiṭṭhi – ‘natthi yo maraṇadhammo samāno na bhāyati, na santāsaṃ āpajjati maraṇassā’’’ti. ‘‘Atthi, brāhmaṇa, maraṇadhammo samāno bhāyati, santāsaṃ āpajjati maraṇassa; atthi pana, brāhmaṇa, maraṇadhammo samāno na bhāyati, na santāsaṃ āpajjati maraṇassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamo ",
      " ca, brāhmaṇa, maraṇadhammo samāno bhāyati, santāsaṃ āpajjati maraṇassa? Idha, brāhmaṇa, ekacco kāmesu avītarāgo hoti avigatacchando ",
      " avigatapemo avigatapipāso avigatapariḷāho avigatataṇho. Tamenaṃ aññataro gāḷho rogātaṅko phusati. Tassa aññatarena gāḷhena rogātaṅkena phuṭṭhassa ",
      " evaṃ hoti – ‘piyā vata maṃ kāmā jahissanti, piye cāhaṃ kāme jahissāmī’ti. So socati kilamati paridevati, urattāḷiṃ kandati, sammohaṃ āpajjati. Ayaṃ kho, brāhmaṇa, maraṇadhammo samāno bhāyati, santāsaṃ āpajjati maraṇassa."
    ],
    "innerText": "‘‘Katamo ca, brāhmaṇa, maraṇadhammo samāno bhāyati, santāsaṃ āpajjati maraṇassa? Idha, brāhmaṇa, ekacco kāmesu avītarāgo hoti avigatacchando avigatapemo avigatapipāso avigatapariḷāho avigatataṇho. Tamenaṃ aññataro gāḷho rogātaṅko phusati. Tassa aññatarena gāḷhena rogātaṅkena phuṭṭhassa evaṃ hoti – ‘piyā vata maṃ kāmā jahissanti, piye cāhaṃ kāme jahissāmī’ti. So socati kilamati paridevati, urattāḷiṃ kandati, sammohaṃ āpajjati. Ayaṃ kho, brāhmaṇa, maraṇadhammo samāno bhāyati, santāsaṃ āpajjati maraṇassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, brāhmaṇa, idhekacco kāye avītarāgo hoti avigatacchando avigatapemo avigatapipāso avigatapariḷāho avigatataṇho. Tamenaṃ aññataro gāḷho rogātaṅko phusati. Tassa aññatarena gāḷhena rogātaṅkena phuṭṭhassa evaṃ hoti – ‘piyo vata ",
      " maṃ kāyo jahissati, piyañcāhaṃ kāyaṃ jahissāmī’ti. So socati kilamati paridevati, urattāḷiṃ kandati, sammohaṃ āpajjati. Ayampi kho, brāhmaṇa, maraṇadhammo samāno bhāyati, santāsaṃ āpajjati maraṇassa."
    ],
    "innerText": "‘‘Puna caparaṃ, brāhmaṇa, idhekacco kāye avītarāgo hoti avigatacchando avigatapemo avigatapipāso avigatapariḷāho avigatataṇho. Tamenaṃ aññataro gāḷho rogātaṅko phusati. Tassa aññatarena gāḷhena rogātaṅkena phuṭṭhassa evaṃ hoti – ‘piyo vata maṃ kāyo jahissati, piyañcāhaṃ kāyaṃ jahissāmī’ti. So socati kilamati paridevati, urattāḷiṃ kandati, sammohaṃ āpajjati. Ayampi kho, brāhmaṇa, maraṇadhammo samāno bhāyati, santāsaṃ āpajjati maraṇassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, brāhmaṇa, idhekacco akatakalyāṇo hoti akatakusalo akatabhīruttāṇo katapāpo kataluddo katakibbiso. Tamenaṃ aññataro gāḷho rogātaṅko phusati. Tassa aññatarena gāḷhena rogātaṅkena phuṭṭhassa evaṃ hoti – ‘akataṃ vata me kalyāṇaṃ, akataṃ kusalaṃ, akataṃ bhīruttāṇaṃ; kataṃ pāpaṃ, kataṃ luddaṃ, kataṃ kibbisaṃ. Yāvatā, bho, akatakalyāṇānaṃ akatakusalānaṃ akatabhīruttāṇānaṃ katapāpānaṃ kataluddānaṃ katakibbisānaṃ gati taṃ gatiṃ pecca gacchāmī’ti. So socati kilamati paridevati, urattāḷiṃ kandati, sammohaṃ āpajjati. Ayampi kho, brāhmaṇa, maraṇadhammo samāno bhāyati, santāsaṃ āpajjati maraṇassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, brāhmaṇa, idhekacco kaṅkhī hoti vicikicchī aniṭṭhaṅgato saddhamme. Tamenaṃ aññataro gāḷho rogātaṅko ",
      " phusati. Tassa aññatarena gāḷhena rogātaṅkena phuṭṭhassa evaṃ hoti – ‘kaṅkhī vatamhi vicikicchī aniṭṭhaṅgato saddhamme’ti. So socati kilamati paridevati, urattāḷiṃ kandati, sammohaṃ āpajjati. Ayampi kho, brāhmaṇa, maraṇadhammo samāno ",
      " bhāyati, santāsaṃ āpajjati maraṇassa. Ime kho, brāhmaṇa, cattāro maraṇadhammā samānā bhāyanti, santāsaṃ āpajjanti maraṇassa."
    ],
    "innerText": "‘‘Puna caparaṃ, brāhmaṇa, idhekacco kaṅkhī hoti vicikicchī aniṭṭhaṅgato saddhamme. Tamenaṃ aññataro gāḷho rogātaṅko phusati. Tassa aññatarena gāḷhena rogātaṅkena phuṭṭhassa evaṃ hoti – ‘kaṅkhī vatamhi vicikicchī aniṭṭhaṅgato saddhamme’ti. So socati kilamati paridevati, urattāḷiṃ kandati, sammohaṃ āpajjati. Ayampi kho, brāhmaṇa, maraṇadhammo samāno bhāyati, santāsaṃ āpajjati maraṇassa. Ime kho, brāhmaṇa, cattāro maraṇadhammā samānā bhāyanti, santāsaṃ āpajjanti maraṇassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamo ",
      " ca, brāhmaṇa, maraṇadhammo samāno na bhāyati, na santāsaṃ āpajjati maraṇassa? Idha, brāhmaṇa, ekacco kāmesu vītarāgo hoti vigatacchando vigatapemo vigatapipāso vigatapariḷāho vigatataṇho. Tamenaṃ aññataro gāḷho rogātaṅko phusati. Tassa aññatarena gāḷhena rogātaṅkena phuṭṭhassa na evaṃ hoti – ‘piyā vata maṃ kāmā jahissanti, piye cāhaṃ kāme jahissāmī’ti. So na socati na kilamati na paridevati, na urattāḷiṃ kandati, na sammohaṃ āpajjati. Ayaṃ kho, brāhmaṇa, maraṇadhammo samāno na bhāyati, na santāsaṃ āpajjati maraṇassa."
    ],
    "innerText": "‘‘Katamo ca, brāhmaṇa, maraṇadhammo samāno na bhāyati, na santāsaṃ āpajjati maraṇassa? Idha, brāhmaṇa, ekacco kāmesu vītarāgo hoti vigatacchando vigatapemo vigatapipāso vigatapariḷāho vigatataṇho. Tamenaṃ aññataro gāḷho rogātaṅko phusati. Tassa aññatarena gāḷhena rogātaṅkena phuṭṭhassa na evaṃ hoti – ‘piyā vata maṃ kāmā jahissanti, piye cāhaṃ kāme jahissāmī’ti. So na socati na kilamati na paridevati, na urattāḷiṃ kandati, na sammohaṃ āpajjati. Ayaṃ kho, brāhmaṇa, maraṇadhammo samāno na bhāyati, na santāsaṃ āpajjati maraṇassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna ",
      " caparaṃ, brāhmaṇa, idhekacco kāye vītarāgo hoti vigatacchando vigatapemo vigatapipāso vigatapariḷāho vigatataṇho. Tamenaṃ aññataro gāḷho rogātaṅko phusati. Tassa aññatarena gāḷhena rogātaṅkena phuṭṭhassa na evaṃ hoti – ‘piyo vata maṃ kāyo jahissati, piyañcāhaṃ kāyaṃ jahissāmī’ti. So na socati na kilamati na paridevati, na urattāḷiṃ kandati, na sammohaṃ āpajjati. Ayampi kho, brāhmaṇa, maraṇadhammo samāno na bhāyati, na santāsaṃ āpajjati maraṇassa."
    ],
    "innerText": "‘‘Puna caparaṃ, brāhmaṇa, idhekacco kāye vītarāgo hoti vigatacchando vigatapemo vigatapipāso vigatapariḷāho vigatataṇho. Tamenaṃ aññataro gāḷho rogātaṅko phusati. Tassa aññatarena gāḷhena rogātaṅkena phuṭṭhassa na evaṃ hoti – ‘piyo vata maṃ kāyo jahissati, piyañcāhaṃ kāyaṃ jahissāmī’ti. So na socati na kilamati na paridevati, na urattāḷiṃ kandati, na sammohaṃ āpajjati. Ayampi kho, brāhmaṇa, maraṇadhammo samāno na bhāyati, na santāsaṃ āpajjati maraṇassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna ",
      " caparaṃ, brāhmaṇa, idhekacco akatapāpo hoti akataluddo akatakibbiso katakalyāṇo katakusalo katabhīruttāṇo. Tamenaṃ aññataro gāḷho rogātaṅko phusati. Tassa aññatarena gāḷhena rogātaṅkena phuṭṭhassa evaṃ hoti – ‘akataṃ vata me pāpaṃ, akataṃ luddaṃ, akataṃ kibbisaṃ; kataṃ kalyāṇaṃ, kataṃ kusalaṃ, kataṃ bhīruttāṇaṃ. Yāvatā, bho, akatapāpānaṃ akataluddānaṃ akatakibbisānaṃ katakalyāṇānaṃ katakusalānaṃ katabhīruttāṇānaṃ gati taṃ gatiṃ pecca gacchāmī’ti. So na socati na kilamati na paridevati, na urattāḷiṃ kandati, na sammohaṃ āpajjati. Ayampi kho, brāhmaṇa, maraṇadhammo samāno na bhāyati, na santāsaṃ āpajjati maraṇassa."
    ],
    "innerText": "‘‘Puna caparaṃ, brāhmaṇa, idhekacco akatapāpo hoti akataluddo akatakibbiso katakalyāṇo katakusalo katabhīruttāṇo. Tamenaṃ aññataro gāḷho rogātaṅko phusati. Tassa aññatarena gāḷhena rogātaṅkena phuṭṭhassa evaṃ hoti – ‘akataṃ vata me pāpaṃ, akataṃ luddaṃ, akataṃ kibbisaṃ; kataṃ kalyāṇaṃ, kataṃ kusalaṃ, kataṃ bhīruttāṇaṃ. Yāvatā, bho, akatapāpānaṃ akataluddānaṃ akatakibbisānaṃ katakalyāṇānaṃ katakusalānaṃ katabhīruttāṇānaṃ gati taṃ gatiṃ pecca gacchāmī’ti. So na socati na kilamati na paridevati, na urattāḷiṃ kandati, na sammohaṃ āpajjati. Ayampi kho, brāhmaṇa, maraṇadhammo samāno na bhāyati, na santāsaṃ āpajjati maraṇassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, brāhmaṇa, idhekacco akaṅkhī hoti avicikicchī niṭṭhaṅgato saddhamme. Tamenaṃ ",
      " aññataro gāḷho rogātaṅko phusati. Tassa aññatarena gāḷhena rogātaṅkena phuṭṭhassa evaṃ hoti – ‘akaṅkhī vatamhi avicikicchī niṭṭhaṅgato saddhamme’ti. So na socati na kilamati na paridevati, na urattāḷiṃ kandati, na sammohaṃ āpajjati. Ayampi ",
      " kho, brāhmaṇa, maraṇadhammo samāno na bhāyati, na santāsaṃ āpajjati maraṇassa. Ime kho, brāhmaṇa, cattāro maraṇadhammā samānā na bhāyanti, na santāsaṃ āpajjanti maraṇassā’’ti."
    ],
    "innerText": "‘‘Puna caparaṃ, brāhmaṇa, idhekacco akaṅkhī hoti avicikicchī niṭṭhaṅgato saddhamme. Tamenaṃ aññataro gāḷho rogātaṅko phusati. Tassa aññatarena gāḷhena rogātaṅkena phuṭṭhassa evaṃ hoti – ‘akaṅkhī vatamhi avicikicchī niṭṭhaṅgato saddhamme’ti. So na socati na kilamati na paridevati, na urattāḷiṃ kandati, na sammohaṃ āpajjati. Ayampi kho, brāhmaṇa, maraṇadhammo samāno na bhāyati, na santāsaṃ āpajjati maraṇassa. Ime kho, brāhmaṇa, cattāro maraṇadhammā samānā na bhāyanti, na santāsaṃ āpajjanti maraṇassā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Abhikkantaṃ, bho gotama, abhikkantaṃ, bho gotama…pe… upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Brāhmaṇasaccasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "185"
      },
      ". Ekaṃ ",
      " samayaṃ bhagavā rājagahe viharati gijjhakūṭe pabbate. Tena kho pana samayena sambahulā abhiññātā abhiññātā paribbājakā sippinikātīre ",
      " paribbājakārāme paṭivasanti, seyyathidaṃ annabhāro varadharo sakuludāyī ca paribbājako aññe ca abhiññātā abhiññātā paribbājakā. Atha kho bhagavā sāyanhasamayaṃ paṭisallānā vuṭṭhito yena sippinikātīre paribbājakārāmo tenupasaṅkami."
    ],
    "innerText": "185. Ekaṃ samayaṃ bhagavā rājagahe viharati gijjhakūṭe pabbate. Tena kho pana samayena sambahulā abhiññātā abhiññātā paribbājakā sippinikātīre paribbājakārāme paṭivasanti, seyyathidaṃ annabhāro varadharo sakuludāyī ca paribbājako aññe ca abhiññātā abhiññātā paribbājakā. Atha kho bhagavā sāyanhasamayaṃ paṭisallānā vuṭṭhito yena sippinikātīre paribbājakārāmo tenupasaṅkami."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena kho pana samayena tesaṃ aññatitthiyānaṃ paribbājakānaṃ sannisinnānaṃ sannipatitānaṃ ayamantarā kathā udapādi – ‘‘itipi brāhmaṇasaccāni, itipi brāhmaṇasaccānī’’ti. Atha kho bhagavā yena te paribbājakā tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Nisajja kho bhagavā te paribbājake etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kāya nuttha, paribbājakā, etarahi kathāya sannisinnā, kā ca pana vo antarākathā vippakatā’’ti? ‘‘Idha, bho gotama, amhākaṃ sannisinnānaṃ sannipatitānaṃ ayamantarākathā udapādi – ‘itipi brāhmaṇasaccāni, itipi brāhmaṇasaccānī’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Cattārimāni, paribbājakā, brāhmaṇasaccāni mayā sayaṃ abhiññā sacchikatvā paveditāni. Katamāni cattāri? Idha, paribbājakā, brāhmaṇo evamāha – ‘sabbe pāṇā avajjhā’ti ",
      ". Iti vadaṃ brāhmaṇo saccaṃ āha, no musā. So tena na samaṇoti maññati, na brāhmaṇoti maññati, na seyyohamasmīti maññati, na sadisohamasmīti maññati, na hīnohamasmīti maññati. Api ca yadeva tattha saccaṃ tadabhiññāya pāṇānaṃyeva anuddayāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[tadabhiññāya anudayāya (ka.)]"
      },
      " anukampāya paṭipanno hoti."
    ],
    "innerText": "‘‘Cattārimāni, paribbājakā, brāhmaṇasaccāni mayā sayaṃ abhiññā sacchikatvā paveditāni. Katamāni cattāri? Idha, paribbājakā, brāhmaṇo evamāha – ‘sabbe pāṇā avajjhā’ti . Iti vadaṃ brāhmaṇo saccaṃ āha, no musā. So tena na samaṇoti maññati, na brāhmaṇoti maññati, na seyyohamasmīti maññati, na sadisohamasmīti maññati, na hīnohamasmīti maññati. Api ca yadeva tattha saccaṃ tadabhiññāya pāṇānaṃyeva anuddayāya [tadabhiññāya anudayāya (ka.)] anukampāya paṭipanno hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, paribbājakā, brāhmaṇo evamāha ",
      " – ‘sabbe ",
      " kāmā aniccā dukkhā vipariṇāmadhammā’ti. Iti vadaṃ brāhmaṇo saccamāha, no musā. So tena na samaṇoti maññati, na brāhmaṇoti maññati, na seyyohamasmīti maññati, na sadisohamasmīti maññati, na hīnohamasmīti maññati. Api ca yadeva tattha saccaṃ tadabhiññāya kāmānaṃyeva nibbidāya virāgāya nirodhāya paṭipanno hoti."
    ],
    "innerText": "‘‘Puna caparaṃ, paribbājakā, brāhmaṇo evamāha – ‘sabbe kāmā aniccā dukkhā vipariṇāmadhammā’ti. Iti vadaṃ brāhmaṇo saccamāha, no musā. So tena na samaṇoti maññati, na brāhmaṇoti maññati, na seyyohamasmīti maññati, na sadisohamasmīti maññati, na hīnohamasmīti maññati. Api ca yadeva tattha saccaṃ tadabhiññāya kāmānaṃyeva nibbidāya virāgāya nirodhāya paṭipanno hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna ",
      " caparaṃ, paribbājakā, brāhmaṇo evamāha – ‘sabbe bhavā aniccā…pe… bhavānaṃyeva nibbidāya virāgāya nirodhāya paṭipanno hoti."
    ],
    "innerText": "‘‘Puna caparaṃ, paribbājakā, brāhmaṇo evamāha – ‘sabbe bhavā aniccā…pe… bhavānaṃyeva nibbidāya virāgāya nirodhāya paṭipanno hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, paribbājakā, brāhmaṇo evamāha – ‘nāhaṃ kvacani ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kvacana (sī. syā.)]"
      },
      " kassaci kiñcanatasmiṃ na ca mama kvacani katthaci kiñcanatatthī’ti. Iti vadaṃ brāhmaṇo saccaṃ āha, no musā. So tena na samaṇoti maññati, na brāhmaṇoti maññati, na seyyohamasmīti maññati, na sadisohamasmīti maññati, na hīnohamasmīti maññati. Api ca yadeva tattha saccaṃ tadabhiññāya ākiñcaññaṃyeva paṭipadaṃ paṭipanno hoti. Imāni kho, paribbājakā, cattāri brāhmaṇasaccāni mayā sayaṃ abhiññā sacchikatvā paveditānī’’ti. Pañcamaṃ."
    ],
    "innerText": "‘‘Puna caparaṃ, paribbājakā, brāhmaṇo evamāha – ‘nāhaṃ kvacani [kvacana (sī. syā.)] kassaci kiñcanatasmiṃ na ca mama kvacani katthaci kiñcanatatthī’ti. Iti vadaṃ brāhmaṇo saccaṃ āha, no musā. So tena na samaṇoti maññati, na brāhmaṇoti maññati, na seyyohamasmīti maññati, na sadisohamasmīti maññati, na hīnohamasmīti maññati. Api ca yadeva tattha saccaṃ tadabhiññāya ākiñcaññaṃyeva paṭipadaṃ paṭipanno hoti. Imāni kho, paribbājakā, cattāri brāhmaṇasaccāni mayā sayaṃ abhiññā sacchikatvā paveditānī’’ti. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Ummaggasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "186"
      },
      ". Atha ",
      " kho aññataro bhikkhu yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘kena ",
      " nu kho, bhante, loko nīyati, kena loko parikassati, kassa ca uppannassa vasaṃ gacchatī’’ti?"
    ],
    "innerText": "186. Atha kho aññataro bhikkhu yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘kena nu kho, bhante, loko nīyati, kena loko parikassati, kassa ca uppannassa vasaṃ gacchatī’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sādhu sādhu, bhikkhu! Bhaddako kho te, bhikkhu, ummaggo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ummaṅgo (syā. ka.)]"
      },
      ", bhaddakaṃ paṭibhānaṃ, kalyāṇī ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kalyāṇā (ka.)]"
      },
      " paripucchā. Evañhi tvaṃ, bhikkhu, pucchasi – ‘kena nu kho, bhante, loko nīyati, kena loko parikassati, kassa ca uppannassa vasaṃ gacchatī’’’ti? ‘‘Evaṃ, bhante’’. ‘‘Cittena kho, bhikkhu, loko nīyati, cittena parikassati, cittassa uppannassa vasaṃ gacchatī’’ti."
    ],
    "innerText": "‘‘Sādhu sādhu, bhikkhu! Bhaddako kho te, bhikkhu, ummaggo [ummaṅgo (syā. ka.)], bhaddakaṃ paṭibhānaṃ, kalyāṇī [kalyāṇā (ka.)] paripucchā. Evañhi tvaṃ, bhikkhu, pucchasi – ‘kena nu kho, bhante, loko nīyati, kena loko parikassati, kassa ca uppannassa vasaṃ gacchatī’’’ti? ‘‘Evaṃ, bhante’’. ‘‘Cittena kho, bhikkhu, loko nīyati, cittena parikassati, cittassa uppannassa vasaṃ gacchatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sādhu ",
      ", bhante’’ti kho so bhikkhu bhagavato bhāsitaṃ abhinanditvā anumoditvā bhagavantaṃ uttari pañhaṃ apucchi – ‘‘‘bahussuto dhammadharo, bahussuto dhammadharo’ti, bhante, vuccati. Kittāvatā nu kho, bhante, bahussuto dhammadharo hotī’’ti?"
    ],
    "innerText": "‘‘Sādhu , bhante’’ti kho so bhikkhu bhagavato bhāsitaṃ abhinanditvā anumoditvā bhagavantaṃ uttari pañhaṃ apucchi – ‘‘‘bahussuto dhammadharo, bahussuto dhammadharo’ti, bhante, vuccati. Kittāvatā nu kho, bhante, bahussuto dhammadharo hotī’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sādhu sādhu, bhikkhu! Bhaddako kho te, bhikkhu ummaggo, bhaddakaṃ paṭibhānaṃ, kalyāṇī paripucchā. Evañhi tvaṃ, bhikkhu, pucchasi – ‘bahussuto dhammadharo, bahussuto dhammadharoti, bhante, vuccati. Kittāvatā nu kho, bhante, bahussuto ",
      " dhammadharo hotī’’’ti? ‘‘Evaṃ, bhante’’. ‘‘Bahū kho, bhikkhu, mayā dhammā desitā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[bahu kho bhikkhu mayā dhammo desito (ka.)]"
      },
      " – suttaṃ, geyyaṃ, veyyākaraṇaṃ, gāthā, udānaṃ, itivuttakaṃ, jātakaṃ, abbhutadhammaṃ, vedallaṃ. Catuppadāya cepi, bhikkhu, gāthāya atthamaññāya dhammamaññāya ",
      " dhammānudhammappaṭipanno hoti bahussuto dhammadharoti alaṃ vacanāyā’’ti."
    ],
    "innerText": "‘‘Sādhu sādhu, bhikkhu! Bhaddako kho te, bhikkhu ummaggo, bhaddakaṃ paṭibhānaṃ, kalyāṇī paripucchā. Evañhi tvaṃ, bhikkhu, pucchasi – ‘bahussuto dhammadharo, bahussuto dhammadharoti, bhante, vuccati. Kittāvatā nu kho, bhante, bahussuto dhammadharo hotī’’’ti? ‘‘Evaṃ, bhante’’. ‘‘Bahū kho, bhikkhu, mayā dhammā desitā [bahu kho bhikkhu mayā dhammo desito (ka.)] – suttaṃ, geyyaṃ, veyyākaraṇaṃ, gāthā, udānaṃ, itivuttakaṃ, jātakaṃ, abbhutadhammaṃ, vedallaṃ. Catuppadāya cepi, bhikkhu, gāthāya atthamaññāya dhammamaññāya dhammānudhammappaṭipanno hoti bahussuto dhammadharoti alaṃ vacanāyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sādhu, bhante’’ti kho so bhikkhu bhagavato bhāsitaṃ abhinanditvā anumoditvā bhagavantaṃ uttari pañhaṃ apucchi – ‘‘‘sutavā nibbedhikapañño, sutavā nibbedhikapañño’ti, bhante, vuccati. Kittāvatā nu kho, bhante, sutavā nibbedhikapañño hotī’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sādhu sādhu, bhikkhu! Bhaddako kho te, bhikkhu, ummaggo, bhaddakaṃ paṭibhānaṃ, kalyāṇī paripucchā. Evañhi tvaṃ, bhikkhu, pucchasi – ‘sutavā nibbedhikapañño, sutavā nibbedhikapaññoti, bhante, vuccati. Kittāvatā nu kho, bhante, sutavā nibbedhikapañño hotī’’’ti? ‘‘Evaṃ, bhante’’. ‘‘Idha, bhikkhu, bhikkhuno ‘idaṃ dukkha’nti sutaṃ hoti, paññāya cassa atthaṃ ativijjha passati; ‘ayaṃ dukkhasamudayo’ti sutaṃ hoti, paññāya cassa atthaṃ ",
      " ativijjha passati; ‘ayaṃ dukkhanirodho’ti sutaṃ hoti, paññāya cassa atthaṃ ativijjha passati; ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti sutaṃ hoti, paññāya cassa atthaṃ ativijjha passati. Evaṃ kho, bhikkhu, sutavā nibbedhikapañño hotī’’ti."
    ],
    "innerText": "‘‘Sādhu sādhu, bhikkhu! Bhaddako kho te, bhikkhu, ummaggo, bhaddakaṃ paṭibhānaṃ, kalyāṇī paripucchā. Evañhi tvaṃ, bhikkhu, pucchasi – ‘sutavā nibbedhikapañño, sutavā nibbedhikapaññoti, bhante, vuccati. Kittāvatā nu kho, bhante, sutavā nibbedhikapañño hotī’’’ti? ‘‘Evaṃ, bhante’’. ‘‘Idha, bhikkhu, bhikkhuno ‘idaṃ dukkha’nti sutaṃ hoti, paññāya cassa atthaṃ ativijjha passati; ‘ayaṃ dukkhasamudayo’ti sutaṃ hoti, paññāya cassa atthaṃ ativijjha passati; ‘ayaṃ dukkhanirodho’ti sutaṃ hoti, paññāya cassa atthaṃ ativijjha passati; ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti sutaṃ hoti, paññāya cassa atthaṃ ativijjha passati. Evaṃ kho, bhikkhu, sutavā nibbedhikapañño hotī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sādhu, bhante’’ti kho so bhikkhu bhagavato bhāsitaṃ abhinanditvā anumoditvā bhagavantaṃ uttari pañhaṃ apucchi – ‘‘‘paṇḍito mahāpañño, paṇḍito mahāpañño’ti, bhante, vuccati. Kittāvatā nu kho, bhante, paṇḍito mahāpañño hotī’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sādhu ",
      " sādhu bhikkhu! Bhaddako kho te, bhikkhu, ummaggo, bhaddakaṃ paṭibhānaṃ, kalyāṇī paripucchā. Evañhi tvaṃ bhikkhu pucchasi – ‘paṇḍito mahāpañño, paṇḍito mahāpaññoti ",
      ", bhante, vuccati. Kittāvatā nu kho, bhante, paṇḍito mahāpañño hotī’’’ti? ‘‘Evaṃ, bhante’’. ‘‘Idha, bhikkhu, paṇḍito mahāpañño nevattabyābādhāya ceteti na parabyābādhāya ceteti na ",
      " ubhayabyābādhāya ceteti attahitaparahitaubhayahitasabbalokahitameva cintayamāno cinteti. Evaṃ kho, bhikkhu, paṇḍito mahāpañño hotī’’ti. Chaṭṭhaṃ."
    ],
    "innerText": "‘‘Sādhu sādhu bhikkhu! Bhaddako kho te, bhikkhu, ummaggo, bhaddakaṃ paṭibhānaṃ, kalyāṇī paripucchā. Evañhi tvaṃ bhikkhu pucchasi – ‘paṇḍito mahāpañño, paṇḍito mahāpaññoti , bhante, vuccati. Kittāvatā nu kho, bhante, paṇḍito mahāpañño hotī’’’ti? ‘‘Evaṃ, bhante’’. ‘‘Idha, bhikkhu, paṇḍito mahāpañño nevattabyābādhāya ceteti na parabyābādhāya ceteti na ubhayabyābādhāya ceteti attahitaparahitaubhayahitasabbalokahitameva cintayamāno cinteti. Evaṃ kho, bhikkhu, paṇḍito mahāpañño hotī’’ti. Chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Vassakārasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "187"
      },
      ". Ekaṃ samayaṃ bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Atha kho vassakāro brāhmaṇo magadhamahāmatto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho vassakāro brāhmaṇo magadhamahāmatto bhagavantaṃ etadavoca –"
    ],
    "innerText": "187. Ekaṃ samayaṃ bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Atha kho vassakāro brāhmaṇo magadhamahāmatto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho vassakāro brāhmaṇo magadhamahāmatto bhagavantaṃ etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Jāneyya nu kho, bho gotama, asappuriso asappurisaṃ – ‘asappuriso ayaṃ bhava’’’nti? ‘‘Aṭṭhānaṃ kho etaṃ, brāhmaṇa, anavakāso yaṃ asappuriso asappurisaṃ jāneyya – ‘asappuriso ayaṃ bhava’’’nti. ‘‘Jāneyya pana, bho gotama, asappuriso sappurisaṃ – ‘sappuriso ayaṃ bhava’’’nti? ‘‘Etampi kho, brāhmaṇa, aṭṭhānaṃ anavakāso yaṃ asappuriso sappurisaṃ jāneyya – ‘sappuriso ayaṃ bhava’’’nti. ‘‘Jāneyya nu kho, bho gotama, sappuriso sappurisaṃ – ‘sappuriso ayaṃ bhava’’’nti? ‘‘Ṭhānaṃ kho etaṃ, brāhmaṇa, vijjati ",
      " yaṃ sappuriso sappurisaṃ jāneyya – ‘sappuriso ayaṃ bhava’’’nti. ‘‘Jāneyya pana, bho gotama, sappuriso asappurisaṃ – ‘asappuriso ayaṃ bhava’’’nti? ‘‘Etampi ",
      " kho, brāhmaṇa, ṭhānaṃ vijjati yaṃ sappuriso asappurisaṃ jāneyya – ‘asappuriso ayaṃ bhava’’’nti."
    ],
    "innerText": "‘‘Jāneyya nu kho, bho gotama, asappuriso asappurisaṃ – ‘asappuriso ayaṃ bhava’’’nti? ‘‘Aṭṭhānaṃ kho etaṃ, brāhmaṇa, anavakāso yaṃ asappuriso asappurisaṃ jāneyya – ‘asappuriso ayaṃ bhava’’’nti. ‘‘Jāneyya pana, bho gotama, asappuriso sappurisaṃ – ‘sappuriso ayaṃ bhava’’’nti? ‘‘Etampi kho, brāhmaṇa, aṭṭhānaṃ anavakāso yaṃ asappuriso sappurisaṃ jāneyya – ‘sappuriso ayaṃ bhava’’’nti. ‘‘Jāneyya nu kho, bho gotama, sappuriso sappurisaṃ – ‘sappuriso ayaṃ bhava’’’nti? ‘‘Ṭhānaṃ kho etaṃ, brāhmaṇa, vijjati yaṃ sappuriso sappurisaṃ jāneyya – ‘sappuriso ayaṃ bhava’’’nti. ‘‘Jāneyya pana, bho gotama, sappuriso asappurisaṃ – ‘asappuriso ayaṃ bhava’’’nti? ‘‘Etampi kho, brāhmaṇa, ṭhānaṃ vijjati yaṃ sappuriso asappurisaṃ jāneyya – ‘asappuriso ayaṃ bhava’’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Acchariyaṃ, bho gotama, abbhutaṃ, bho gotama! Yāva subhāsitaṃ ",
      " cidaṃ, bhotā gotamena – ‘aṭṭhānaṃ kho etaṃ, brāhmaṇa, anavakāso yaṃ asappuriso asappurisaṃ jāneyya – asappuriso ayaṃ bhavanti. Etampi kho, brāhmaṇa, aṭṭhānaṃ anavakāso yaṃ asappuriso sappurisaṃ jāneyya – sappuriso ayaṃ bhavanti. Ṭhānaṃ kho etaṃ, brāhmaṇa, vijjati yaṃ sappuriso sappurisaṃ jāneyya – sappuriso ayaṃ bhavanti. Etampi kho, brāhmaṇa, ṭhānaṃ vijjati yaṃ sappuriso asappurisaṃ jāneyya – asappuriso ayaṃ bhava’’’nti."
    ],
    "innerText": "‘‘Acchariyaṃ, bho gotama, abbhutaṃ, bho gotama! Yāva subhāsitaṃ cidaṃ, bhotā gotamena – ‘aṭṭhānaṃ kho etaṃ, brāhmaṇa, anavakāso yaṃ asappuriso asappurisaṃ jāneyya – asappuriso ayaṃ bhavanti. Etampi kho, brāhmaṇa, aṭṭhānaṃ anavakāso yaṃ asappuriso sappurisaṃ jāneyya – sappuriso ayaṃ bhavanti. Ṭhānaṃ kho etaṃ, brāhmaṇa, vijjati yaṃ sappuriso sappurisaṃ jāneyya – sappuriso ayaṃ bhavanti. Etampi kho, brāhmaṇa, ṭhānaṃ vijjati yaṃ sappuriso asappurisaṃ jāneyya – asappuriso ayaṃ bhava’’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ekamidaṃ, bho gotama, samayaṃ todeyyassa brāhmaṇassa parisati parūpārambhaṃ vattenti – ‘bālo ayaṃ rājā eḷeyyo samaṇe rāmaputte abhippasanno, samaṇe ca pana rāmaputte evarūpaṃ paramanipaccakāraṃ karoti, yadidaṃ ",
      " abhivādanaṃ paccuṭṭhānaṃ añjalikammaṃ sāmīcikamma’nti. Imepi rañño eḷeyyassa parihārakā bālā – yamako moggallo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[puggalo (ka.)]"
      },
      " uggo nāvindakī gandhabbo aggivesso, ye samaṇe rāmaputte abhippasannā, samaṇe ca pana rāmaputte evarūpaṃ paramanipaccakāraṃ karonti, yadidaṃ abhivādanaṃ paccuṭṭhānaṃ añjalikammaṃ sāmīcikammanti. Tyāssudaṃ todeyyo brāhmaṇo iminā nayena neti. Taṃ kiṃ maññanti, bhonto, paṇḍito rājā eḷeyyo karaṇīyādhikaraṇīyesu vacanīyādhivacanīyesu ",
      " alamatthadasatarehi alamatthadasataro’ti? ‘Evaṃ, bho, paṇḍito rājā eḷeyyo karaṇīyādhikaraṇīyesu vacanīyādhivacanīyesu alamatthadasatarehi alamatthadasataro’’’ti."
    ],
    "innerText": "‘‘Ekamidaṃ, bho gotama, samayaṃ todeyyassa brāhmaṇassa parisati parūpārambhaṃ vattenti – ‘bālo ayaṃ rājā eḷeyyo samaṇe rāmaputte abhippasanno, samaṇe ca pana rāmaputte evarūpaṃ paramanipaccakāraṃ karoti, yadidaṃ abhivādanaṃ paccuṭṭhānaṃ añjalikammaṃ sāmīcikamma’nti. Imepi rañño eḷeyyassa parihārakā bālā – yamako moggallo [puggalo (ka.)] uggo nāvindakī gandhabbo aggivesso, ye samaṇe rāmaputte abhippasannā, samaṇe ca pana rāmaputte evarūpaṃ paramanipaccakāraṃ karonti, yadidaṃ abhivādanaṃ paccuṭṭhānaṃ añjalikammaṃ sāmīcikammanti. Tyāssudaṃ todeyyo brāhmaṇo iminā nayena neti. Taṃ kiṃ maññanti, bhonto, paṇḍito rājā eḷeyyo karaṇīyādhikaraṇīyesu vacanīyādhivacanīyesu alamatthadasatarehi alamatthadasataro’ti? ‘Evaṃ, bho, paṇḍito rājā eḷeyyo karaṇīyādhikaraṇīyesu vacanīyādhivacanīyesu alamatthadasatarehi alamatthadasataro’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Yasmā ca kho, bho, samaṇo rāmaputto raññā eḷeyyena paṇḍitena paṇḍitataro karaṇīyādhikaraṇīyesu vacanīyādhivacanīyesu alamatthadasatarena alamatthadasataro, tasmā rājā eḷeyyo samaṇe rāmaputte abhippasanno, samaṇe ca pana rāmaputte evarūpaṃ paramanipaccakāraṃ karoti, yadidaṃ abhivādanaṃ paccuṭṭhānaṃ añjalikammaṃ sāmīcikammaṃ’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Taṃ kiṃ maññanti, bhonto, paṇḍitā rañño eḷeyyassa parihārakā – yamako moggallo ",
      " uggo ",
      " nāvindakī gandhabbo aggivesso, karaṇīyādhikaraṇīyesu vacanīyādhivacanīyesu alamatthadasatarehi alamatthadasatarāti? ‘Evaṃ, bho, paṇḍitā rañño eḷeyyassa parihārakā – yamako moggallo uggo nāvindakī gandhabbo aggivesso, karaṇīyādhikaraṇīyesu vacanīyādhivacanīyesu alamatthadasatarehi alamatthadasatarā’’’ti."
    ],
    "innerText": "‘‘Taṃ kiṃ maññanti, bhonto, paṇḍitā rañño eḷeyyassa parihārakā – yamako moggallo uggo nāvindakī gandhabbo aggivesso, karaṇīyādhikaraṇīyesu vacanīyādhivacanīyesu alamatthadasatarehi alamatthadasatarāti? ‘Evaṃ, bho, paṇḍitā rañño eḷeyyassa parihārakā – yamako moggallo uggo nāvindakī gandhabbo aggivesso, karaṇīyādhikaraṇīyesu vacanīyādhivacanīyesu alamatthadasatarehi alamatthadasatarā’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Yasmā ca kho, bho, samaṇo rāmaputto rañño eḷeyyassa parihārakehi paṇḍitehi paṇḍitataro karaṇīyādhikaraṇīyesu vacanīyādhivacanīyesu alamatthadasatarehi alamatthadasataro, tasmā rañño eḷeyyassa parihārakā samaṇe rāmaputte abhippasannā; samaṇe ca pana rāmaputte evarūpaṃ paramanipaccakāraṃ karonti, yadidaṃ abhivādanaṃ paccuṭṭhānaṃ añjalikammaṃ sāmīcikamma’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Acchariyaṃ, bho, gotama, abbhutaṃ, bho gotama! Yāva subhāsitaṃ cidaṃ bhotā gotamena ",
      " – ‘aṭṭhānaṃ kho etaṃ, brāhmaṇa, anavakāso yaṃ asappuriso ",
      " asappurisaṃ jāneyya – asappuriso ayaṃ bhavanti. Etampi kho, brāhmaṇa, aṭṭhānaṃ anavakāso yaṃ asappuriso sappurisaṃ jāneyya – sappuriso ayaṃ bhavanti. Ṭhānaṃ kho etaṃ, brāhmaṇa, vijjati yaṃ sappuriso sappurisaṃ jāneyya – sappuriso ayaṃ bhavanti. Etampi kho, brāhmaṇa, ṭhānaṃ vijjati yaṃ sappuriso asappurisaṃ jāneyya – asappuriso ayaṃ bhava’nti. Handa ca dāni mayaṃ, bho gotama, gacchāma. Bahukiccā mayaṃ bahukaraṇīyā’’ti. ‘‘Yassadāni tvaṃ, brāhmaṇa, kālaṃ maññasī’’ti. Atha kho vassakāro brāhmaṇo magadhamahāmatto bhagavato bhāsitaṃ abhinanditvā anumoditvā uṭṭhāyāsanā pakkāmīti. Sattamaṃ."
    ],
    "innerText": "‘‘Acchariyaṃ, bho, gotama, abbhutaṃ, bho gotama! Yāva subhāsitaṃ cidaṃ bhotā gotamena – ‘aṭṭhānaṃ kho etaṃ, brāhmaṇa, anavakāso yaṃ asappuriso asappurisaṃ jāneyya – asappuriso ayaṃ bhavanti. Etampi kho, brāhmaṇa, aṭṭhānaṃ anavakāso yaṃ asappuriso sappurisaṃ jāneyya – sappuriso ayaṃ bhavanti. Ṭhānaṃ kho etaṃ, brāhmaṇa, vijjati yaṃ sappuriso sappurisaṃ jāneyya – sappuriso ayaṃ bhavanti. Etampi kho, brāhmaṇa, ṭhānaṃ vijjati yaṃ sappuriso asappurisaṃ jāneyya – asappuriso ayaṃ bhava’nti. Handa ca dāni mayaṃ, bho gotama, gacchāma. Bahukiccā mayaṃ bahukaraṇīyā’’ti. ‘‘Yassadāni tvaṃ, brāhmaṇa, kālaṃ maññasī’’ti. Atha kho vassakāro brāhmaṇo magadhamahāmatto bhagavato bhāsitaṃ abhinanditvā anumoditvā uṭṭhāyāsanā pakkāmīti. Sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Upakasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "188"
      },
      ". Ekaṃ samayaṃ bhagavā rājagahe viharati gijjhakūṭe pabbate. Atha kho upako maṇḍikāputto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho upako maṇḍikāputto bhagavantaṃ etadavoca –"
    ],
    "innerText": "188. Ekaṃ samayaṃ bhagavā rājagahe viharati gijjhakūṭe pabbate. Atha kho upako maṇḍikāputto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho upako maṇḍikāputto bhagavantaṃ etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ahañhi, bhante, evaṃvādī evaṃdiṭṭhi – ‘yo koci parūpārambhaṃ vatteti, parūpārambhaṃ vattento ",
      " sabbo so ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sabbaso (sī. pī.)]"
      },
      " na upapādeti. Anupapādento gārayho hoti upavajjo’’’ti. ‘‘Parūpārambhaṃ ce, upaka, vatteti parūpārambhaṃ vattento na upapādeti, anupapādento ",
      " gārayho hoti upavajjo. Tvaṃ kho, upaka, parūpārambhaṃ vattesi, parūpārambhaṃ vattento na upapādesi, anupapādento gārayho hosi upavajjo’’ti. ‘‘Seyyathāpi, bhante ",
      ", ummujjamānakaṃyeva mahatā pāsena bandheyya; evamevaṃ kho ahaṃ, bhante, ummujjamānakoyeva bhagavatā mahatā vādapāsena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mahatā pāsena (ka.)]"
      },
      " baddho’’ti."
    ],
    "innerText": "‘‘Ahañhi, bhante, evaṃvādī evaṃdiṭṭhi – ‘yo koci parūpārambhaṃ vatteti, parūpārambhaṃ vattento sabbo so [sabbaso (sī. pī.)] na upapādeti. Anupapādento gārayho hoti upavajjo’’’ti. ‘‘Parūpārambhaṃ ce, upaka, vatteti parūpārambhaṃ vattento na upapādeti, anupapādento gārayho hoti upavajjo. Tvaṃ kho, upaka, parūpārambhaṃ vattesi, parūpārambhaṃ vattento na upapādesi, anupapādento gārayho hosi upavajjo’’ti. ‘‘Seyyathāpi, bhante , ummujjamānakaṃyeva mahatā pāsena bandheyya; evamevaṃ kho ahaṃ, bhante, ummujjamānakoyeva bhagavatā mahatā vādapāsena [mahatā pāsena (ka.)] baddho’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Idaṃ akusalanti kho, upaka, mayā paññattaṃ. Tattha aparimāṇā padā aparimāṇā byañjanā aparimāṇā tathāgatassa dhammadesanā – itipidaṃ akusalanti. Taṃ kho panidaṃ akusalaṃ pahātabbanti kho, upaka, mayā paññattaṃ. Tattha aparimāṇā padā aparimāṇā byañjanā aparimāṇā tathāgatassa dhammadesanā – itipidaṃ akusalaṃ pahātabbanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idaṃ ",
      " kusalanti kho, upaka, mayā paññattaṃ. Tattha aparimāṇā padā aparimāṇā byañjanā aparimāṇā tathāgatassa dhammadesanā – itipidaṃ kusalanti. Taṃ kho panidaṃ kusalaṃ bhāvetabbanti kho, upaka, mayā paññattaṃ. Tattha aparimāṇā padā aparimāṇā byañjanā aparimāṇā tathāgatassa dhammadesanā – itipidaṃ kusalaṃ bhāvetabba’’nti."
    ],
    "innerText": "‘‘Idaṃ kusalanti kho, upaka, mayā paññattaṃ. Tattha aparimāṇā padā aparimāṇā byañjanā aparimāṇā tathāgatassa dhammadesanā – itipidaṃ kusalanti. Taṃ kho panidaṃ kusalaṃ bhāvetabbanti kho, upaka, mayā paññattaṃ. Tattha aparimāṇā padā aparimāṇā byañjanā aparimāṇā tathāgatassa dhammadesanā – itipidaṃ kusalaṃ bhāvetabba’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha kho upako maṇḍikāputto bhagavato bhāsitaṃ abhinanditvā anumoditvā uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā yena rājā māgadho ajātasattu vedehiputto tenupasaṅkami; upasaṅkamitvā yāvatako ahosi bhagavatā saddhiṃ kathāsallāpo taṃ sabbaṃ rañño māgadhassa ajātasattussa vedehiputtassa ārocesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ vutte rājā māgadho ajātasattu vedehiputto kupito anattamano upakaṃ maṇḍikāputtaṃ etadavoca – ‘‘yāva dhaṃsī vatāyaṃ loṇakāradārako yāva mukharo yāva pagabbo ",
      " yatra hi nāma taṃ bhagavantaṃ arahantaṃ sammāsambuddhaṃ āsādetabbaṃ maññissati; apehi tvaṃ, upaka, vinassa, mā taṃ addasa’’nti. Aṭṭhamaṃ."
    ],
    "innerText": "Evaṃ vutte rājā māgadho ajātasattu vedehiputto kupito anattamano upakaṃ maṇḍikāputtaṃ etadavoca – ‘‘yāva dhaṃsī vatāyaṃ loṇakāradārako yāva mukharo yāva pagabbo yatra hi nāma taṃ bhagavantaṃ arahantaṃ sammāsambuddhaṃ āsādetabbaṃ maññissati; apehi tvaṃ, upaka, vinassa, mā taṃ addasa’’nti. Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Sacchikaraṇīyasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "189"
      },
      ". ‘‘Cattārome ",
      ", bhikkhave, sacchikaraṇīyā dhammā. Katame cattāro? Atthi ",
      ", bhikkhave, dhammā kāyena sacchikaraṇīyā; atthi, bhikkhave, dhammā satiyā sacchikaraṇīyā; atthi, bhikkhave, dhammā cakkhunā sacchikaraṇīyā; atthi, bhikkhave, dhammā paññāya sacchikaraṇīyā. Katame ca, bhikkhave, dhammā kāyena sacchikaraṇīyā? Aṭṭha vimokkhā, bhikkhave, kāyena sacchikaraṇīyā."
    ],
    "innerText": "189. ‘‘Cattārome , bhikkhave, sacchikaraṇīyā dhammā. Katame cattāro? Atthi , bhikkhave, dhammā kāyena sacchikaraṇīyā; atthi, bhikkhave, dhammā satiyā sacchikaraṇīyā; atthi, bhikkhave, dhammā cakkhunā sacchikaraṇīyā; atthi, bhikkhave, dhammā paññāya sacchikaraṇīyā. Katame ca, bhikkhave, dhammā kāyena sacchikaraṇīyā? Aṭṭha vimokkhā, bhikkhave, kāyena sacchikaraṇīyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katame ca, bhikkhave, dhammā satiyā sacchikaraṇīyā? Pubbenivāso, bhikkhave, satiyā sacchikaraṇīyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katame ca, bhikkhave, dhammā cakkhunā sacchikaraṇīyā? Sattānaṃ cutūpapāto, bhikkhave, cakkhunā sacchikaraṇīyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katame ca, bhikkhave, dhammā paññāya sacchikaraṇīyā? Āsavānaṃ khayo, bhikkhave, paññāya sacchikaraṇīyo. Ime kho, bhikkhave, cattāro sacchikaraṇīyā dhammā’’ti. Navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Uposathasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "190"
      },
      ". Ekaṃ ",
      " samayaṃ bhagavā sāvatthiyaṃ viharati pubbārāme migāramātupāsāde. Tena kho pana samayena bhagavā tadahuposathe bhikkhusaṅghaparivuto nisinno hoti. Atha kho bhagavā tuṇhībhūtaṃ tuṇhībhūtaṃ bhikkhusaṅghaṃ anuviloketvā bhikkhū āmantesi –"
    ],
    "innerText": "190. Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati pubbārāme migāramātupāsāde. Tena kho pana samayena bhagavā tadahuposathe bhikkhusaṅghaparivuto nisinno hoti. Atha kho bhagavā tuṇhībhūtaṃ tuṇhībhūtaṃ bhikkhusaṅghaṃ anuviloketvā bhikkhū āmantesi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Apalāpāyaṃ, bhikkhave, parisā nippalāpāyaṃ, bhikkhave, parisā suddhā sāre patiṭṭhitā. Tathārūpo ayaṃ ",
      ", bhikkhave, bhikkhusaṅgho, tathārūpāyaṃ, bhikkhave, parisā. Yathārūpā parisā dullabhā dassanāyapi lokasmiṃ, tathārūpo ayaṃ, bhikkhave, bhikkhusaṅgho, tathārūpāyaṃ, bhikkhave, parisā. Yathārūpā parisā āhuneyyā pāhuneyyā dakkhiṇeyyā añjalikaraṇīyā anuttaraṃ puññakkhettaṃ lokassa, tathārūpo ayaṃ, bhikkhave, bhikkhusaṅgho, tathārūpāyaṃ, bhikkhave, parisā ",
      ". Yathārūpāya parisāya appaṃ dinnaṃ bahu hoti bahu dinnaṃ bahutaraṃ, tathārūpo ayaṃ, bhikkhave, bhikkhusaṅgho, tathārūpāyaṃ, bhikkhave, parisā. Yathārūpaṃ parisaṃ alaṃ yojanagaṇanānipi dassanāya gantuṃ api puṭosenāpi, tathārūpo ayaṃ, bhikkhave, bhikkhusaṅgho, (tathārūpāyaṃ, bhikkhave, parisā) ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[( ) sī. syā. kaṃ. pī. potthakesu natthi]"
      },
      "."
    ],
    "innerText": "‘‘Apalāpāyaṃ, bhikkhave, parisā nippalāpāyaṃ, bhikkhave, parisā suddhā sāre patiṭṭhitā. Tathārūpo ayaṃ , bhikkhave, bhikkhusaṅgho, tathārūpāyaṃ, bhikkhave, parisā. Yathārūpā parisā dullabhā dassanāyapi lokasmiṃ, tathārūpo ayaṃ, bhikkhave, bhikkhusaṅgho, tathārūpāyaṃ, bhikkhave, parisā. Yathārūpā parisā āhuneyyā pāhuneyyā dakkhiṇeyyā añjalikaraṇīyā anuttaraṃ puññakkhettaṃ lokassa, tathārūpo ayaṃ, bhikkhave, bhikkhusaṅgho, tathārūpāyaṃ, bhikkhave, parisā . Yathārūpāya parisāya appaṃ dinnaṃ bahu hoti bahu dinnaṃ bahutaraṃ, tathārūpo ayaṃ, bhikkhave, bhikkhusaṅgho, tathārūpāyaṃ, bhikkhave, parisā. Yathārūpaṃ parisaṃ alaṃ yojanagaṇanānipi dassanāya gantuṃ api puṭosenāpi, tathārūpo ayaṃ, bhikkhave, bhikkhusaṅgho, (tathārūpāyaṃ, bhikkhave, parisā) [( ) sī. syā. kaṃ. pī. potthakesu natthi]."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Santi ",
      ", bhikkhave, bhikkhū imasmiṃ bhikkhusaṅghe devappattā viharanti; santi, bhikkhave, bhikkhū imasmiṃ bhikkhusaṅghe brahmappattā viharanti; santi, bhikkhave, bhikkhū imasmiṃ bhikkhusaṅghe āneñjappattā viharanti; santi, bhikkhave, bhikkhū imasmiṃ bhikkhusaṅghe ariyappattā viharanti."
    ],
    "innerText": "‘‘Santi , bhikkhave, bhikkhū imasmiṃ bhikkhusaṅghe devappattā viharanti; santi, bhikkhave, bhikkhū imasmiṃ bhikkhusaṅghe brahmappattā viharanti; santi, bhikkhave, bhikkhū imasmiṃ bhikkhusaṅghe āneñjappattā viharanti; santi, bhikkhave, bhikkhū imasmiṃ bhikkhusaṅghe ariyappattā viharanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu devappatto hoti? Idha, bhikkhave, bhikkhu vivicceva kāmehi…pe… paṭhamaṃ jhānaṃ upasampajja viharati; vitakkavicārānaṃ vūpasamā…pe… dutiyaṃ jhānaṃ…pe… tatiyaṃ jhānaṃ…pe… catutthaṃ jhānaṃ upasampajja viharati. Evaṃ kho, bhikkhave, bhikkhu devappatto hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, bhikkhu brahmappatto hoti? Idha, bhikkhave, bhikkhu mettāsahagatena cetasā ekaṃ disaṃ pharitvā viharati, tathā ",
      " dutiyaṃ tathā tatiyaṃ tathā catutthaṃ. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati. Karuṇā… muditā… upekkhāsahagatena ",
      " cetasā ekaṃ disaṃ pharitvā viharati, tathā dutiyaṃ tathā tatiyaṃ tathā catutthaṃ. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati. Evaṃ kho, bhikkhave, bhikkhu brahmappatto hoti."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu brahmappatto hoti? Idha, bhikkhave, bhikkhu mettāsahagatena cetasā ekaṃ disaṃ pharitvā viharati, tathā dutiyaṃ tathā tatiyaṃ tathā catutthaṃ. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati. Karuṇā… muditā… upekkhāsahagatena cetasā ekaṃ disaṃ pharitvā viharati, tathā dutiyaṃ tathā tatiyaṃ tathā catutthaṃ. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati. Evaṃ kho, bhikkhave, bhikkhu brahmappatto hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, bhikkhu āneñjappatto hoti? Idha, bhikkhave, bhikkhu sabbaso rūpasaññānaṃ ",
      " samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ‘ananto ākāso’ti ākāsānañcāyatanaṃ upasampajja viharati. Sabbaso ākāsānañcāyatanaṃ samatikkamma ‘anantaṃ viññāṇa’nti viññāṇañcāyatanaṃ upasampajja viharati. Sabbaso viññāṇañcāyatanaṃ samatikkamma ‘natthi kiñcī’ti ākiñcaññāyatanaṃ upasampajja viharati. Sabbaso ākiñcaññāyatanaṃ samatikkamma nevasaññānāsaññāyatanaṃ upasampajja viharati. Evaṃ kho, bhikkhave, bhikkhu āneñjappatto hoti."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu āneñjappatto hoti? Idha, bhikkhave, bhikkhu sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ‘ananto ākāso’ti ākāsānañcāyatanaṃ upasampajja viharati. Sabbaso ākāsānañcāyatanaṃ samatikkamma ‘anantaṃ viññāṇa’nti viññāṇañcāyatanaṃ upasampajja viharati. Sabbaso viññāṇañcāyatanaṃ samatikkamma ‘natthi kiñcī’ti ākiñcaññāyatanaṃ upasampajja viharati. Sabbaso ākiñcaññāyatanaṃ samatikkamma nevasaññānāsaññāyatanaṃ upasampajja viharati. Evaṃ kho, bhikkhave, bhikkhu āneñjappatto hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu ariyappatto hoti? Idha, bhikkhave, bhikkhu ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti…pe… ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti. Evaṃ kho, bhikkhave, bhikkhu ariyappatto hotī’’ti. Dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "children": [
      "Brāhmaṇavaggo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yodhājīvavaggo (sī. syā. kaṃ. pī.)]"
      },
      " catuttho."
    ],
    "innerText": "Brāhmaṇavaggo [yodhājīvavaggo (sī. syā. kaṃ. pī.)] catuttho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tassuddānaṃ ",
      " –"
    ],
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Yodhā pāṭibhogasutaṃ, abhayaṃ brāhmaṇasaccena pañcamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ummaggavassakāro, upako sacchikiriyā ca uposathoti."
  }
]