[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "(17) 2. Paṭipadāvaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Saṃkhittasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "161"
      },
      ". Dutiyassa paṭhame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dukkhāpaṭipadā dandhābhiññā"
      },
      "tiādīsu pāḷiyā āgatanayena attho veditabbo. Tathā hi –"
    ],
    "innerText": "161. Dutiyassa paṭhame dukkhāpaṭipadā dandhābhiññātiādīsu pāḷiyā āgatanayena attho veditabbo. Tathā hi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Tattha katamā dukkhapaṭipadā dandhābhiññā paññā? Kicchena kasirena samādhiṃ uppādentassa dandhaṃ taṃ ṭhānaṃ abhijānantassa yā uppajjati paññā pajānanā…pe… amoho dhammavicayo sammādiṭṭhi, ayaṃ vuccati dukkhapaṭipadā dandhābhiññā paññā. Tattha katamā dukkhapaṭipadā khippābhiññā paññā? Kicchena kasirena samādhiṃ uppādentassa khippaṃ taṃ ṭhānaṃ abhijānantassa yā uppajjati paññā pajānanā…pe… sammādiṭṭhi, ayaṃ vuccati dukkhapaṭipadā khippābhiññā paññā. Tattha katamā sukhapaṭipadā dandhābhiññā paññā? Akicchena akasirena samādhiṃ uppādentassa dandhaṃ taṃ ṭhānaṃ abhijānantassa yā uppajjati paññā pajānanā…pe… sammādiṭṭhi, ayaṃ vuccati sukhapaṭipadā dandhābhiññā paññā. Tattha katamā sukhapaṭipadā khippābhiññā paññā? Akicchena akasirena samādhiṃ uppādentassa khippaṃ taṃ ṭhānaṃ abhijānantassa yā uppajjati paññā pajānanā…pe… sammādiṭṭhi, ayaṃ vuccati sukhapaṭipadā khippābhiññā paññā’’ti (vibha. 801) – ayamettha pāḷi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kicchena kasirena samādhiṃ uppādentassā"
      },
      "ti pubbabhāge āgamanakāle kicchena kasirena dukkhena sasaṅkhārena sappayogena kilese vikkhambhetvā lokuttarasamādhiṃ uppādentassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dandhaṃ taṃ ṭhānaṃ abhijānantassā"
      },
      "ti vikkhambhitesu kilesesu vipassanāparivāse ciraṃ vasitvā taṃ lokuttarasamādhisaṅkhātaṃ ṭhānaṃ dandhaṃ saṇikaṃ abhijānantassa paṭivijjhantassa, pāpuṇantassāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayaṃ vuccatī"
      },
      "ti yā esā evaṃ uppajjati, ayaṃ kilesavikkhambhanappaṭipadāya dukkhattā, vipassanāparivāsapaññāya ca dandhattā maggakāle ekacittakkhaṇe uppannāpi paññā āgamanavasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘dukkhapaṭipadā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dandhābhiññā nāmā’’"
      },
      "ti vuccati. Upari tīsu padesupi iminā nayena attho veditabbo."
    ],
    "innerText": "Tattha kicchena kasirena samādhiṃ uppādentassāti pubbabhāge āgamanakāle kicchena kasirena dukkhena sasaṅkhārena sappayogena kilese vikkhambhetvā lokuttarasamādhiṃ uppādentassa. Dandhaṃ taṃ ṭhānaṃ abhijānantassāti vikkhambhitesu kilesesu vipassanāparivāse ciraṃ vasitvā taṃ lokuttarasamādhisaṅkhātaṃ ṭhānaṃ dandhaṃ saṇikaṃ abhijānantassa paṭivijjhantassa, pāpuṇantassāti attho. Ayaṃ vuccatīti yā esā evaṃ uppajjati, ayaṃ kilesavikkhambhanappaṭipadāya dukkhattā, vipassanāparivāsapaññāya ca dandhattā maggakāle ekacittakkhaṇe uppannāpi paññā āgamanavasena ‘‘dukkhapaṭipadādandhābhiññā nāmā’’ti vuccati. Upari tīsu padesupi iminā nayena attho veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Saṃkhittasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Vitthārasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "162"
      },
      ". Dutiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "akatābhiniveso"
      },
      "ti akatādhikāro. Rūpānaṃ lakkhaṇādīhi paricchinditvā gahaṇaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpapariggaho. Tīsu addhāsu kilamatī"
      },
      "ti pubbante aparante pubbantāparanteti evaṃ tīsu padesesu kilamati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañcasu ñāṇesū"
      },
      "ti rūpapariggahādīsu pañcasu ñāṇesu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Navasu vipassanāñāṇesū"
      },
      "ti udayabbayādinavavipassanāñāṇesu. Sesamettha uttānameva."
    ],
    "innerText": "162. Dutiye akatābhinivesoti akatādhikāro. Rūpānaṃ lakkhaṇādīhi paricchinditvā gahaṇaṃ rūpapariggaho. Tīsu addhāsu kilamatīti pubbante aparante pubbantāparanteti evaṃ tīsu padesesu kilamati. Pañcasu ñāṇesūti rūpapariggahādīsu pañcasu ñāṇesu. Navasu vipassanāñāṇesūti udayabbayādinavavipassanāñāṇesu. Sesamettha uttānameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vitthārasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Asubhasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "163"
      },
      ". Tatiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yathā etaṃ, tathā ida’’nti iminā nayenā"
      },
      "ti etena –"
    ],
    "innerText": "163. Tatiye ‘‘yathā etaṃ, tathā ida’’nti iminā nayenāti etena –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yathā idaṃ tathā etaṃ, yathā etaṃ tathā idaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ajjhattañca bahiddhā ca, kāye chandaṃ virājaye’’ti. (su. ni. 205); –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Imaṃ desanānayaṃ saṅgaṇhāti. Tassattho – yathā idaṃ saviññāṇakāsubhaṃ āyuusmāviññāṇānaṃ anapagamā carati tiṭṭhati nisīdati sayati, tathā etaṃ etarahi susāne sayitaṃ aviññāṇakampi pubbe tesaṃ dhammānaṃ anapagamā ahosi. Yathā ca etaṃ etarahi matasarīraṃ tesaṃ dhammānaṃ apagamā na carati na tiṭṭhati na nisīdati na seyyaṃ kappeti, tathā idaṃ saviññāṇakampi tesaṃ dhammānaṃ apagamā bhavissati. Yathā ca idaṃ saviññāṇakaṃ netarahi susāne mataṃ seti na uddhumātakādibhāvamupagataṃ, tathā etaṃ etarahi matasarīrampi pubbe ahosi. Yathā panetaṃ ",
      " etarahi aviññāṇakāsubhaṃ matakasusāne seti uddhumātakādibhāvañca upagataṃ, tathā idaṃ saviññāṇakampi bhavissatīti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yathā idaṃ tathā eta"
      },
      "nti attanā matasarīrassa samānabhāvaṃ karonto bāhire dosaṃ pajahati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathā etaṃ tathā ida"
      },
      "nti matasarīrena attano samānabhāvaṃ karonto ajjhattike rāgaṃ pajahati. Yenākārena ubhayaṃ samaṃ karoti, taṃ sampajānanto ubhayattha mohaṃ pajahati."
    ],
    "innerText": "Imaṃ desanānayaṃ saṅgaṇhāti. Tassattho – yathā idaṃ saviññāṇakāsubhaṃ āyuusmāviññāṇānaṃ anapagamā carati tiṭṭhati nisīdati sayati, tathā etaṃ etarahi susāne sayitaṃ aviññāṇakampi pubbe tesaṃ dhammānaṃ anapagamā ahosi. Yathā ca etaṃ etarahi matasarīraṃ tesaṃ dhammānaṃ apagamā na carati na tiṭṭhati na nisīdati na seyyaṃ kappeti, tathā idaṃ saviññāṇakampi tesaṃ dhammānaṃ apagamā bhavissati. Yathā ca idaṃ saviññāṇakaṃ netarahi susāne mataṃ seti na uddhumātakādibhāvamupagataṃ, tathā etaṃ etarahi matasarīrampi pubbe ahosi. Yathā panetaṃ etarahi aviññāṇakāsubhaṃ matakasusāne seti uddhumātakādibhāvañca upagataṃ, tathā idaṃ saviññāṇakampi bhavissatīti. Tattha yathā idaṃ tathā etanti attanā matasarīrassa samānabhāvaṃ karonto bāhire dosaṃ pajahati. Yathā etaṃ tathā idanti matasarīrena attano samānabhāvaṃ karonto ajjhattike rāgaṃ pajahati. Yenākārena ubhayaṃ samaṃ karoti, taṃ sampajānanto ubhayattha mohaṃ pajahati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bahiddhā diṭṭhāna"
      },
      "nti bahiddhā susānādīsu diṭṭhānaṃ uddhumātakādidasannaṃ asubhānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Navannaṃ pāṭikulyānaṃ vasenā’’"
      },
      "ti kasmā vuttaṃ, nanu antimajīvikābhāvato piṇḍapātassa alābhalābhesu paritassanagedhādisamuppattito ",
      " bhattassa sammadajananato kimikulasaṃvaddhanatoti evamādīhipi ākārehi āhārepaṭikūlatā paccavekkhitabbā. Vuttañhetaṃ – ‘‘antamidaṃ, bhikkhave, jīvikānaṃ yadidaṃ piṇḍolyaṃ atipāpoyaṃ lokasmiṃ yadidaṃ piṇḍolyo vicarati pattapāṇīti (saṃ. ni. 3.80; itivu. 91). Aladdhā ca piṇḍapātaṃ paritassati, laddhā ca piṇḍapātaṃ gadhito mucchito ajjhopanno anādīnavadassāvī anissaraṇapañño paribhuñjatīti (a. ni. 3.124). Bhutto ca āhāro kassaci kadāci maraṇaṃ vā maraṇamattaṃ vā dukkhaṃ āvahatī’’ti."
    ],
    "innerText": "Bahiddhā diṭṭhānanti bahiddhā susānādīsu diṭṭhānaṃ uddhumātakādidasannaṃ asubhānaṃ. ‘‘Navannaṃ pāṭikulyānaṃ vasenā’’ti kasmā vuttaṃ, nanu antimajīvikābhāvato piṇḍapātassa alābhalābhesu paritassanagedhādisamuppattito bhattassa sammadajananato kimikulasaṃvaddhanatoti evamādīhipi ākārehi āhārepaṭikūlatā paccavekkhitabbā. Vuttañhetaṃ – ‘‘antamidaṃ, bhikkhave, jīvikānaṃ yadidaṃ piṇḍolyaṃ atipāpoyaṃ lokasmiṃ yadidaṃ piṇḍolyo vicarati pattapāṇīti (saṃ. ni. 3.80; itivu. 91). Aladdhā ca piṇḍapātaṃ paritassati, laddhā ca piṇḍapātaṃ gadhito mucchito ajjhopanno anādīnavadassāvī anissaraṇapañño paribhuñjatīti (a. ni. 3.124). Bhutto ca āhāro kassaci kadāci maraṇaṃ vā maraṇamattaṃ vā dukkhaṃ āvahatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kaṭukīṭakādayo dvattiṃsakulappabhedā kimiyo naṃ upanissāya jīvantīti? Vuccate – antimajīvikābhāvo tāva cittasaṃkilesavisodhanatthaṃ kammaṭṭhānābhinivesanato pageva manasi kātabbo ‘‘māhaṃ chavālātasadiso bhaveyya’’nti. Tathā piṇḍapātassa alābhalābhesu paritassanagedhādisamuppattinivāraṇaṃ pageva anuṭṭhātabbaṃ suparisuddhasīlassa paṭisaṅkhānavato tadabhāvato. Bhattasammado anekantiko paribhoge antogadhovāti veditabbo. Kimikulasaṃvaddhanaṃ pana saṅgahetabbaṃ, saṅgahitameva vā ‘‘navannaṃ pāṭikulyānaṃ vasenā’’ti ettha niyamassa akatattā. Iminā vā nayena itaresampettha saṅgaho daṭṭhabbo yathāsambhavamettha paṭikūlatāpaccavekkhaṇassa adhippetattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evañca ",
      " katvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "visuddhimagge"
      },
      " (visuddhi. 1.294-295) dasahi ākārehi paṭikūlatā veditabbā. Seyyathidaṃ – gamanato, pariyesanato, paribhogato, āsayato, nidhānato, aparipakkato, paripakkato, phalato, nissandato, sammakkhanatoti. Evaṃ dasannaṃ vasena pāṭikulyavacanenapi idha ‘‘navanna’’nti vacanaṃ na virujjhati, sammakkhanassa paribhogādīsu labbhamānabhāvā visuṃ taṃ aggahetvā na vadanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Visuddhimagge"
      },
      " (visuddhi. 1.304) pana sammakkhanaṃ paribhogādīsu labbhamānampi nissandavasena visesato paṭikūlanti dassetuṃ sabbapacchā ṭhapitā."
    ],
    "innerText": "Evañca katvā visuddhimagge (visuddhi. 1.294-295) dasahi ākārehi paṭikūlatā veditabbā. Seyyathidaṃ – gamanato, pariyesanato, paribhogato, āsayato, nidhānato, aparipakkato, paripakkato, phalato, nissandato, sammakkhanatoti. Evaṃ dasannaṃ vasena pāṭikulyavacanenapi idha ‘‘navanna’’nti vacanaṃ na virujjhati, sammakkhanassa paribhogādīsu labbhamānabhāvā visuṃ taṃ aggahetvā na vadanti. Visuddhimagge (visuddhi. 1.304) pana sammakkhanaṃ paribhogādīsu labbhamānampi nissandavasena visesato paṭikūlanti dassetuṃ sabbapacchā ṭhapitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ukkaṇṭhitasaññāya samannāgato"
      },
      "ti tīsu bhavesu aruccanavasena pavattāya vipassanāpaññāya samannāgato. Nibbidānupassanā hesā saññāsīsena vuttā. Sesamettha uttānameva."
    ],
    "innerText": "Ukkaṇṭhitasaññāya samannāgatoti tīsu bhavesu aruccanavasena pavattāya vipassanāpaññāya samannāgato. Nibbidānupassanā hesā saññāsīsena vuttā. Sesamettha uttānameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Asubhasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4-6. Paṭhamakhamasuttādivaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "164-166"
      },
      ". Catutthe ",
      " padhānakaraṇakāle sītādīni nakkhamati na sahatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "akkhamā"
      },
      ". Khamati sahati abhibhavatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "khamā"
      },
      ". Indriyadamanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "damā"
      },
      ". ‘‘Uppannaṃ kāmavitakkaṃ nādhivāsetī’’tiādinā (ma. ni. 1.26; a. ni. 4.14; 6.58) nayena vitakkasamanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samā"
      },
      "ti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘akusalavitakkānaṃ vūpasamanapaṭipadā’’"
      },
      "ti. Nidassanamattañcetaṃ, sabbesampi kilesānaṃ samanavasena pavattā paṭipadā samā. Pañcamachaṭṭhāni uttānatthāneva."
    ],
    "innerText": "164-166. Catutthe padhānakaraṇakāle sītādīni nakkhamati na sahatīti akkhamā. Khamati sahati abhibhavatīti khamā. Indriyadamanaṃ damā. ‘‘Uppannaṃ kāmavitakkaṃ nādhivāsetī’’tiādinā (ma. ni. 1.26; a. ni. 4.14; 6.58) nayena vitakkasamanaṃ samāti āha ‘‘akusalavitakkānaṃ vūpasamanapaṭipadā’’ti. Nidassanamattañcetaṃ, sabbesampi kilesānaṃ samanavasena pavattā paṭipadā samā. Pañcamachaṭṭhāni uttānatthāneva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṭhamakhamasuttādivaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7-8. Mahāmoggallānasuttādivaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "167-168"
      },
      ". Sattamaṭṭhamesu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mahāmoggallānattherassā"
      },
      "tiādinā moggallānattherassa heṭṭhā tiṇṇaṃ maggānaṃ sukhapaṭipadadandhābhiññabhāvo, arahattamaggassa dukkhapaṭipadakhippābhiññabhāvo vutto, sāriputtattherassa pana heṭṭhimānaṃ tiṇṇaṃ maggānaṃ sukhapaṭipadadandhābhiññabhāvo, arahattamaggassa ca sukhapaṭipadakhippābhiññabhāvo dassito. Yaṃ pana vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "visuddhimagge"
      },
      " (visuddhi. 2.801) ‘‘buddhānaṃ ",
      " pana cattāropi maggā sukhapaṭipadakhippābhiññāva ahesuṃ, tathā dhammasenāpatissa. Mahāmoggallānattherassa pana paṭhamamaggo sukhapaṭipadakhippābhiñño ahosi, upari tayo dukkhapaṭipadadandhābhiññā’’ti. Yañca vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṭṭhasāliniyaṃ"
      },
      " (dha. sa. aṭṭha. 1476) ‘‘tathāgatassa hi sāriputtattherassa ca cattāropi maggā sukhapaṭipadakhippābhiññāva ahesuṃ, mahāmoggallānattherassa pana paṭhamamaggo sukhapaṭipadakhippābhiñño upari tayo dukkhapaṭipadakhippābhiññā’’ti, taṃ sabbaṃ aññamaññaṃ nānulometi. Imāya pāḷiyā imāya ca aṭṭhakathāya na sameti, tasmā vīmaṃsitabbametaṃ. Taṃtaṃbhāṇakānaṃ vā matena tattha tattha tathā tathā vuttanti gahetabbaṃ."
    ],
    "innerText": "167-168. Sattamaṭṭhamesu mahāmoggallānattherassātiādinā moggallānattherassa heṭṭhā tiṇṇaṃ maggānaṃ sukhapaṭipadadandhābhiññabhāvo, arahattamaggassa dukkhapaṭipadakhippābhiññabhāvo vutto, sāriputtattherassa pana heṭṭhimānaṃ tiṇṇaṃ maggānaṃ sukhapaṭipadadandhābhiññabhāvo, arahattamaggassa ca sukhapaṭipadakhippābhiññabhāvo dassito. Yaṃ pana vuttaṃ visuddhimagge (visuddhi. 2.801) ‘‘buddhānaṃ pana cattāropi maggā sukhapaṭipadakhippābhiññāva ahesuṃ, tathā dhammasenāpatissa. Mahāmoggallānattherassa pana paṭhamamaggo sukhapaṭipadakhippābhiñño ahosi, upari tayo dukkhapaṭipadadandhābhiññā’’ti. Yañca vuttaṃ aṭṭhasāliniyaṃ (dha. sa. aṭṭha. 1476) ‘‘tathāgatassa hi sāriputtattherassa ca cattāropi maggā sukhapaṭipadakhippābhiññāva ahesuṃ, mahāmoggallānattherassa pana paṭhamamaggo sukhapaṭipadakhippābhiñño upari tayo dukkhapaṭipadakhippābhiññā’’ti, taṃ sabbaṃ aññamaññaṃ nānulometi. Imāya pāḷiyā imāya ca aṭṭhakathāya na sameti, tasmā vīmaṃsitabbametaṃ. Taṃtaṃbhāṇakānaṃ vā matena tattha tattha tathā tathā vuttanti gahetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Mahāmoggallānasuttādivaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Sasaṅkhārasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "169"
      },
      ". Navame sasaṅkhārena dukkhena kasirena adhimattapayogaṃ katvāva kilesaparinibbānadhammoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sasaṅkhāraparinibbāyī"
      },
      ". Asaṅkhārena appayogena adhimattapayogaṃ akatvāva kilesaparinibbānadhammoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asaṅkhāraparinibbāyī"
      },
      ". Dhammānusārī puggalo hi āgamanamhi kilese vikkhambhento appadukkhena akasirena akilamantova vikkhambhetuṃ sakkoti. Saddhānusārī puggalo pana dukkhena kasirena kilamanto hutvā vikkhambhetuṃ, tasmā dhammānusārissa pubbabhāgamaggakkhaṇe kilesacchedakaṃ ñāṇaṃ adandhaṃ tikhiṇaṃ sūraṃ hutvā vahati. Yathā nāma tikhiṇena asinā kadaliṃ chindantassa chinnaṭṭhānaṃ maṭṭhaṃ hoti, atisīghaṃ vahati, saddo na suyyati, balavavāyāmakiccaṃ na hoti, evarūpā dhammānusārino pubbabhāgabhāvanā hoti. Saddhānusārino pana pubbabhāgakkhaṇe kilesacchedakaṃ ñāṇaṃ dandhaṃ atikhiṇaṃ asūraṃ hutvā vahati. Yathā nāma kuṇṭhena asinā kadaliṃ chindantassa chinnaṭṭhānaṃ na maṭṭhaṃ hoti, atisīghaṃ na vahati, saddo suyyati, balavavāyāmakiccaṃ icchitabbaṃ hoti, evarūpā saddhānusārino pubbabhāgabhāvanā hoti. Evaṃ santepi nesaṃ kilesakkhaye nānattaṃ natthi, anavasesāva kilesā khīyanti."
    ],
    "innerText": "169. Navame sasaṅkhārena dukkhena kasirena adhimattapayogaṃ katvāva kilesaparinibbānadhammoti sasaṅkhāraparinibbāyī. Asaṅkhārena appayogena adhimattapayogaṃ akatvāva kilesaparinibbānadhammoti asaṅkhāraparinibbāyī. Dhammānusārī puggalo hi āgamanamhi kilese vikkhambhento appadukkhena akasirena akilamantova vikkhambhetuṃ sakkoti. Saddhānusārī puggalo pana dukkhena kasirena kilamanto hutvā vikkhambhetuṃ, tasmā dhammānusārissa pubbabhāgamaggakkhaṇe kilesacchedakaṃ ñāṇaṃ adandhaṃ tikhiṇaṃ sūraṃ hutvā vahati. Yathā nāma tikhiṇena asinā kadaliṃ chindantassa chinnaṭṭhānaṃ maṭṭhaṃ hoti, atisīghaṃ vahati, saddo na suyyati, balavavāyāmakiccaṃ na hoti, evarūpā dhammānusārino pubbabhāgabhāvanā hoti. Saddhānusārino pana pubbabhāgakkhaṇe kilesacchedakaṃ ñāṇaṃ dandhaṃ atikhiṇaṃ asūraṃ hutvā vahati. Yathā nāma kuṇṭhena asinā kadaliṃ chindantassa chinnaṭṭhānaṃ na maṭṭhaṃ hoti, atisīghaṃ na vahati, saddo suyyati, balavavāyāmakiccaṃ icchitabbaṃ hoti, evarūpā saddhānusārino pubbabhāgabhāvanā hoti. Evaṃ santepi nesaṃ kilesakkhaye nānattaṃ natthi, anavasesāva kilesā khīyanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sasaṅkhārasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Yuganaddhasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "170"
      },
      ". Dasame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samathapubbaṅgamaṃ vipassanaṃ bhāvetī"
      },
      "ti idaṃ samathayānikassa vasena vuttaṃ. So hi paṭhamaṃ upacārasamādhiṃ vā appanāsamādhiṃ vā uppādeti, ayaṃ samatho. So tañca taṃsampayutte ca dhamme aniccādīhi vipassati, ayaṃ vipassanā, iti paṭhamaṃ samatho, pacchā vipassanā. Tena vuccati ‘‘samathapubbaṅgamaṃ vipassanaṃ bhāvetī’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vipassanāpubbaṅgamaṃ samathaṃ bhāvetī"
      },
      "ti idaṃ pana vipassanāyānikassa vasena vuttaṃ. So taṃ vuttappakāraṃ samathaṃ asampādetvā pañcupādānakkhandhe aniccādīhi vipassati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭhamo lokuttaramaggo nibbattatī"
      },
      "ti sotāpattimaggaṃ sandhāya vadati, lokiyamaggavaseneva vā imissā pāḷiyā attho veditabbo. Kathaṃ? ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Maggo sañjāyati,"
      },
      " pubbabhāgiyo lokiyamaggo uppajjati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āsevati"
      },
      " nibbidānupassanāvasena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhāveti"
      },
      " muccitukamyatāvasena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bahulīkaroti"
      },
      " paṭisaṅkhānupassanāvasena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āsevati"
      },
      " vā bhayatupaṭṭhānādiñāṇavasena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhāveti"
      },
      " muccitukamyatādiñāṇavasena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bahulīkaroti"
      },
      " vuṭṭhānagāminivipassanāvasena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṃyojanāni pahīyanti. Anusayā byantī hontī"
      },
      "ti maggappaṭipāṭiyā pahīyanti byantī honti."
    ],
    "innerText": "170. Dasame samathapubbaṅgamaṃ vipassanaṃ bhāvetīti idaṃ samathayānikassa vasena vuttaṃ. So hi paṭhamaṃ upacārasamādhiṃ vā appanāsamādhiṃ vā uppādeti, ayaṃ samatho. So tañca taṃsampayutte ca dhamme aniccādīhi vipassati, ayaṃ vipassanā, iti paṭhamaṃ samatho, pacchā vipassanā. Tena vuccati ‘‘samathapubbaṅgamaṃ vipassanaṃ bhāvetī’’ti. Vipassanāpubbaṅgamaṃ samathaṃ bhāvetīti idaṃ pana vipassanāyānikassa vasena vuttaṃ. So taṃ vuttappakāraṃ samathaṃ asampādetvā pañcupādānakkhandhe aniccādīhi vipassati. Paṭhamo lokuttaramaggo nibbattatīti sotāpattimaggaṃ sandhāya vadati, lokiyamaggavaseneva vā imissā pāḷiyā attho veditabbo. Kathaṃ? Maggo sañjāyati, pubbabhāgiyo lokiyamaggo uppajjati. Āsevati nibbidānupassanāvasena. Bhāveti muccitukamyatāvasena. Bahulīkaroti paṭisaṅkhānupassanāvasena. Āsevati vā bhayatupaṭṭhānādiñāṇavasena. Bhāveti muccitukamyatādiñāṇavasena. Bahulīkaroti vuṭṭhānagāminivipassanāvasena. Saṃyojanāni pahīyanti. Anusayā byantī hontīti maggappaṭipāṭiyā pahīyanti byantī honti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammuddhaccaviggahitamānasa"
      },
      "nti obhāsādīsu ariyadhammoti pavattaṃ uddhaccaṃ vikkhepo dhammuddhaccaṃ ",
      ", tena dhammuddhaccena vipassanāvīthito uggamanena virūpaṃ gahitaṃ pavattiyamānaṃ dhammuddhaccaviggahitamānasaṃ. Vuttañhetaṃ –"
    ],
    "innerText": "Dhammuddhaccaviggahitamānasanti obhāsādīsu ariyadhammoti pavattaṃ uddhaccaṃ vikkhepo dhammuddhaccaṃ , tena dhammuddhaccena vipassanāvīthito uggamanena virūpaṃ gahitaṃ pavattiyamānaṃ dhammuddhaccaviggahitamānasaṃ. Vuttañhetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Dhammuddhaccaviggahitamānasaṃ hoti, aniccato manasi karoti, obhāso uppajjati, obhāso dhammoti obhāsaṃ āvajjati, tato vikkhepo uddhaccaṃ, tena uddhaccena viggahitamānaso aniccato upaṭṭhānaṃ yathābhūtaṃ nappajānāti. Dukkhato…pe… anattato upaṭṭhānaṃ yathābhūtaṃ nappajānāti. Tathā aniccato manasikaroto ñāṇaṃ uppajjati…pe… pīti passaddhi sukhaṃ adhimokkho paggaho upaṭṭhānaṃ upekkhā nikanti uppajjati, nikanti dhammoti nikantiṃ āvajjati, tato vikkhepo uddhaccaṃ, tena uddhaccena viggahitamānaso aniccato upaṭṭhānaṃ yathābhūtaṃ ",
      " nappajānāti. Dukkhato…pe… anattato upaṭṭhānaṃ yathābhūtaṃ nappajānātī’’ti (paṭi. ma. 2.6). Sesamettha uttānameva."
    ],
    "innerText": "‘‘Dhammuddhaccaviggahitamānasaṃ hoti, aniccato manasi karoti, obhāso uppajjati, obhāso dhammoti obhāsaṃ āvajjati, tato vikkhepo uddhaccaṃ, tena uddhaccena viggahitamānaso aniccato upaṭṭhānaṃ yathābhūtaṃ nappajānāti. Dukkhato…pe… anattato upaṭṭhānaṃ yathābhūtaṃ nappajānāti. Tathā aniccato manasikaroto ñāṇaṃ uppajjati…pe… pīti passaddhi sukhaṃ adhimokkho paggaho upaṭṭhānaṃ upekkhā nikanti uppajjati, nikanti dhammoti nikantiṃ āvajjati, tato vikkhepo uddhaccaṃ, tena uddhaccena viggahitamānaso aniccato upaṭṭhānaṃ yathābhūtaṃ nappajānāti. Dukkhato…pe… anattato upaṭṭhānaṃ yathābhūtaṃ nappajānātī’’ti (paṭi. ma. 2.6). Sesamettha uttānameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Yuganaddhasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṭipadāvaggavaṇṇanā niṭṭhitā."
  }
]