[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "2. Anusayavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4.Puggalasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "14"
      },
      ". Dutiyassa ",
      " catutthe ubhato ubhayathā, ubhato ubhohi bhāgehi vimuttoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ubhatobhāgavimutto"
      },
      " ekadesasarūpekasesanayena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dvīhi bhāgehī"
      },
      "ti karaṇe nissakke cetaṃ bahuvacanaṃ ",
      ". Āvuttiādivasena ayaṃ niyamo veditabboti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘arūpasamāpattiyā’’"
      },
      "tiādi. Etena ‘‘samāpattiyā vikkhambhanavimokkhena, maggena samucchedavimokkhena vimuttattā ubhatobhāgavimutto’’ti evaṃ pavatto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tipiṭakacūḷanāgattheravādo,"
      },
      " ‘‘nāmakāyato rūpakāyato ca vimuttattā ubhatobhāgavimutto’’ti evaṃ pavatto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tipiṭakamahārakkhitattheravādo,"
      },
      " ‘‘samāpattiyā vikkhambhanavimokkhena ekavāraṃ, maggena samucchedavimokkhena ekavāraṃ vimuttattā ubhatobhāgavimutto’’ti evaṃ pavatto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tipiṭakacūḷābhayattheravādo cā"
      },
      "ti imesaṃ tiṇṇampi theravādānaṃ ekajjhaṃ saṅgaho katoti daṭṭhabbaṃ. Ettha ca paṭhamavāde dvīhi bhāgehi vimutto ubhatobhāgavimutto vutto, dutiyavāde ubhato bhāgato vimuttoti ubhatobhāgavimutto, tatiyavāde dvīhi bhāgehi dve vāre vimuttoti ayametesaṃ visesoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vimutto"
      },
      "ti kilesehi vimutto, kilesavikkhambhanasamucchedanehi vā kāyato vimuttohi attho."
    ],
    "innerText": "14. Dutiyassa catutthe ubhato ubhayathā, ubhato ubhohi bhāgehi vimuttoti ubhatobhāgavimutto ekadesasarūpekasesanayena. Dvīhi bhāgehīti karaṇe nissakke cetaṃ bahuvacanaṃ . Āvuttiādivasena ayaṃ niyamo veditabboti āha ‘‘arūpasamāpattiyā’’tiādi. Etena ‘‘samāpattiyā vikkhambhanavimokkhena, maggena samucchedavimokkhena vimuttattā ubhatobhāgavimutto’’ti evaṃ pavatto tipiṭakacūḷanāgattheravādo, ‘‘nāmakāyato rūpakāyato ca vimuttattā ubhatobhāgavimutto’’ti evaṃ pavatto tipiṭakamahārakkhitattheravādo, ‘‘samāpattiyā vikkhambhanavimokkhena ekavāraṃ, maggena samucchedavimokkhena ekavāraṃ vimuttattā ubhatobhāgavimutto’’ti evaṃ pavatto tipiṭakacūḷābhayattheravādo cāti imesaṃ tiṇṇampi theravādānaṃ ekajjhaṃ saṅgaho katoti daṭṭhabbaṃ. Ettha ca paṭhamavāde dvīhi bhāgehi vimutto ubhatobhāgavimutto vutto, dutiyavāde ubhato bhāgato vimuttoti ubhatobhāgavimutto, tatiyavāde dvīhi bhāgehi dve vāre vimuttoti ayametesaṃ visesoti. Vimuttoti kilesehi vimutto, kilesavikkhambhanasamucchedanehi vā kāyato vimuttohi attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "So"
      },
      "ti ubhatobhāgavimutto. Kāmañcettha rūpāvacaracatutthajjhānampi arūpāvacarajjhānaṃ viya duvaṅgikaṃ āneñjappattanti vuccati. Taṃ pana padaṭṭhānaṃ katvā arahattaṃ patto ubhatobhāgavimutto nāma na hoti rūpakāyato ",
      " avimuttattā. Tañhi kilesakāyatova vimuttaṃ, na rūpakāyato, tasmā tato vuṭṭhāya arahattaṃ patto ubhatobhāgavimutto na hotīti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘catunnaṃ arūpa…pe… pañcavidho hotī’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Arūpasamāpattīna"
      },
      "nti niddhāraṇe sāmivacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Arahattaṃ pattaanāgāmino"
      },
      "ti bhūtapubbagatiyā vuttaṃ. Na hi arahattaṃ patto anāgāmī nāma hoti. ‘‘Rūpī rūpāni passatī’’tiādike nirodhasamāpattiante aṭṭha vimokkhe vatvā –"
    ],
    "innerText": "Soti ubhatobhāgavimutto. Kāmañcettha rūpāvacaracatutthajjhānampi arūpāvacarajjhānaṃ viya duvaṅgikaṃ āneñjappattanti vuccati. Taṃ pana padaṭṭhānaṃ katvā arahattaṃ patto ubhatobhāgavimutto nāma na hoti rūpakāyato avimuttattā. Tañhi kilesakāyatova vimuttaṃ, na rūpakāyato, tasmā tato vuṭṭhāya arahattaṃ patto ubhatobhāgavimutto na hotīti āha ‘‘catunnaṃ arūpa…pe… pañcavidho hotī’’ti. Arūpasamāpattīnanti niddhāraṇe sāmivacanaṃ. Arahattaṃ pattaanāgāminoti bhūtapubbagatiyā vuttaṃ. Na hi arahattaṃ patto anāgāmī nāma hoti. ‘‘Rūpī rūpāni passatī’’tiādike nirodhasamāpattiante aṭṭha vimokkhe vatvā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Yato ca kho, ānanda, bhikkhu ime aṭṭha vimokkhe kāyena phusitvā viharati, paññāya cassa disvā āsavā parikkhīṇā honti. Ayaṃ vuccati, ānanda, bhikkhu ubhatobhāgavimutto’’ti –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yadipi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mahānidāne"
      },
      " (dī. ni. 2.130) vuttaṃ, taṃ pana ubhatobhāgavimuttaseṭṭhavasena vuttanti, idha pana sabbaubhatobhāgavimutte saṅgahaṇatthaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘pañcavidho hotī’’"
      },
      "ti vatvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘pāḷi panettha…pe… aṭṭhavimokkhalābhino vasena āgatā’’"
      },
      "ti āha. Majjhimanikāye pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kīṭāgirisutte"
      },
      " (ma. ni. 2.182) –"
    ],
    "innerText": "Yadipi mahānidāne (dī. ni. 2.130) vuttaṃ, taṃ pana ubhatobhāgavimuttaseṭṭhavasena vuttanti, idha pana sabbaubhatobhāgavimutte saṅgahaṇatthaṃ ‘‘pañcavidho hotī’’ti vatvā ‘‘pāḷi panettha…pe… aṭṭhavimokkhalābhino vasena āgatā’’ti āha. Majjhimanikāye pana kīṭāgirisutte (ma. ni. 2.182) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Katamo ca, bhikkhave, puggalo ubhatobhāgavimutto? Idha, bhikkhave, ekacco puggalo ye te santā vimokkhā atikkamma rūpe āruppā, te kāyena phusitvā viharati ",
      ", paññāya cassa disvā āsavā parikkhīṇā honti. Ayaṃ vuccati, bhikkhave, puggalo ubhatobhāgavimutto’’ti –"
    ],
    "innerText": "‘‘Katamo ca, bhikkhave, puggalo ubhatobhāgavimutto? Idha, bhikkhave, ekacco puggalo ye te santā vimokkhā atikkamma rūpe āruppā, te kāyena phusitvā viharati , paññāya cassa disvā āsavā parikkhīṇā honti. Ayaṃ vuccati, bhikkhave, puggalo ubhatobhāgavimutto’’ti –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Arūpasamāpattivasena cattāro ubhatobhāgavimuttā, seṭṭho ca vutto vuttalakkhaṇūpapattito. Yathāvuttesu hi pañcasu purimā cattāro samāpattisīsaṃ nirodhaṃ na samāpajjantīti pariyāyena ubhatobhāgavimuttā nāma. Aṭṭhasamāpattilābhī anāgāmī taṃ samāpajjitvā tato vuṭṭhāya vipassanaṃ vaḍḍhetvā arahattaṃ pattoti nippariyāyena ubhatobhāgavimuttaseṭṭho nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Katamo ca puggalo"
      },
      "tiādi puggalapaññattipāḷi. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "katamo"
      },
      "ti pucchāvacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puggalo"
      },
      "ti asādhāraṇato pucchitabbavacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idhā"
      },
      "ti idhasmiṃ sāsane. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekacco"
      },
      "ti eko. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭha vimokkhe kāyena phusitvā viharatī"
      },
      "ti ",
      " aṭṭha samāpattiyo samāpajjitvā nāmakāyato paṭilabhitvā viharati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññāya cassa disvā āsavā parikkhīṇā hontī"
      },
      "ti vipassanāpaññāya saṅkhāragataṃ, maggapaññāya cattāri saccāni passitvā cattāropi āsavā parikkhīṇā honti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Disvā"
      },
      "ti dassanahetu. Na hi āsave paññāya passanti, dassanakāraṇā pana parikkhīṇā disvā parikkhīṇāti vuttā dassanāyattaparikkhayattā. Evañhi dassanaṃ āsavānaṃ khayassa purimakiriyābhāvena vuttaṃ."
    ],
    "innerText": "Katamo ca puggalotiādi puggalapaññattipāḷi. Tattha katamoti pucchāvacanaṃ. Puggaloti asādhāraṇato pucchitabbavacanaṃ. Idhāti idhasmiṃ sāsane. Ekaccoti eko. Aṭṭha vimokkhe kāyena phusitvā viharatīti aṭṭha samāpattiyo samāpajjitvā nāmakāyato paṭilabhitvā viharati. Paññāya cassa disvā āsavā parikkhīṇā hontīti vipassanāpaññāya saṅkhāragataṃ, maggapaññāya cattāri saccāni passitvā cattāropi āsavā parikkhīṇā honti. Disvāti dassanahetu. Na hi āsave paññāya passanti, dassanakāraṇā pana parikkhīṇā disvā parikkhīṇāti vuttā dassanāyattaparikkhayattā. Evañhi dassanaṃ āsavānaṃ khayassa purimakiriyābhāvena vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññāvimutto"
      },
      "ti visesato paññāya eva vimutto, na tassa adhiṭṭhānabhūtena aṭṭhavimokkhasaṅkhātena sātisayena samādhināti paññāvimutto. Yo ariyo anadhigataaṭṭhavimokkho sabbaso āsavehi vimutto, tassetaṃ adhivacanaṃ. Adhigatepi hi rūpajjhānavimokkhe na so sātisayasamādhinissitoti na tassa vasena ubhatobhāgavimuttatā hotīti vuttovāyamattho. Arūpajjhānesu pana ekasmimpi sati ubhatobhāgavimuttoyeva nāma hoti. Tena hi aṭṭhavimokkhekadesena taṃnāmadānasamatthena aṭṭhavimokkhalābhītveva vuccati. Samudāye hi pavatto vohāro avayavepi dissati yathā taṃ ‘‘sattisayo’’ti anavasesato āsavānaṃ parikkhīṇattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭhavimokkhapaṭikkhepavaseneva"
      },
      " na ekadesabhūtarūpajjhānappaṭikkhepavasena. Evañhi arūpajjhānekadesābhāvepi aṭṭhavimokkhapaṭikkhepo na hotīti siddhaṃ hoti. Arūpāvacarajjhānesu hi ekasmimpi sati ubhatobhāgavimuttoyeva nāma hoti."
    ],
    "innerText": "Paññāvimuttoti visesato paññāya eva vimutto, na tassa adhiṭṭhānabhūtena aṭṭhavimokkhasaṅkhātena sātisayena samādhināti paññāvimutto. Yo ariyo anadhigataaṭṭhavimokkho sabbaso āsavehi vimutto, tassetaṃ adhivacanaṃ. Adhigatepi hi rūpajjhānavimokkhe na so sātisayasamādhinissitoti na tassa vasena ubhatobhāgavimuttatā hotīti vuttovāyamattho. Arūpajjhānesu pana ekasmimpi sati ubhatobhāgavimuttoyeva nāma hoti. Tena hi aṭṭhavimokkhekadesena taṃnāmadānasamatthena aṭṭhavimokkhalābhītveva vuccati. Samudāye hi pavatto vohāro avayavepi dissati yathā taṃ ‘‘sattisayo’’ti anavasesato āsavānaṃ parikkhīṇattā. Aṭṭhavimokkhapaṭikkhepavaseneva na ekadesabhūtarūpajjhānappaṭikkhepavasena. Evañhi arūpajjhānekadesābhāvepi aṭṭhavimokkhapaṭikkhepo na hotīti siddhaṃ hoti. Arūpāvacarajjhānesu hi ekasmimpi sati ubhatobhāgavimuttoyeva nāma hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Phuṭṭhantaṃ sacchikato"
      },
      "ti phuṭṭhānaṃ anto phuṭṭhanto, phuṭṭhānaṃ arūpajjhānānaṃ anantaro kāloti adhippāyo. Accantasaṃyoge cetaṃ upayogavacanaṃ. Taṃ phuṭṭhānantarakālameva sacchikātabbaṃ sacchikato ",
      " sacchikaraṇūpāyenāti vuttaṃ hoti, bhāvanapuṃsakaṃ vā etaṃ ‘‘ekamantaṃ nisīdī’’tiādīsu viya. Yo hi arūpajjhānena rūpakāyato nāmakāyekadesato ca vikkhambhanavimokkhena vimutto, tena nirodhasaṅkhāto vimokkho ālocito pakāsito viya hoti, na pana kāyena sacchikato. Nirodhaṃ pana ārammaṇaṃ katvā ekaccesu āsavesu khepitesu tena so sacchikato hoti, tasmā so sacchikātabbaṃ nirodhaṃ yathāālocitaṃ nāmakāyena sacchi karotīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kāyasakkhī’’"
      },
      "ti vuccati, na ",
      " tu ‘‘vimutto’’ti ekaccānaṃ āsavānaṃ aparikkhīṇattā. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘jhānaphassaṃ paṭhamaṃ phusati, pacchā nirodhaṃ nibbānaṃ sacchikarotī’’"
      },
      "ti. Ayaṃ catunnaṃ arūpasamāpattīnaṃ ekekato vuṭṭhāya saṅkhāre sammasitvā kāyasakkhibhāvaṃ pattānaṃ catunnaṃ, nirodhā vuṭṭhāya aggamaggappattaanāgāmino ca vasena ubhatobhāgavimutto viya pañcavidho nāma hotīti vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhidhammaṭīkāyaṃ"
      },
      " (pu. pa. mūlaṭī. 24) ‘‘kāyasakkhimhipi eseva nayo’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekacce āsavā"
      },
      "ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "heṭṭhimamaggavajjhā"
      },
      " āsavā."
    ],
    "innerText": "Phuṭṭhantaṃ sacchikatoti phuṭṭhānaṃ anto phuṭṭhanto, phuṭṭhānaṃ arūpajjhānānaṃ anantaro kāloti adhippāyo. Accantasaṃyoge cetaṃ upayogavacanaṃ. Taṃ phuṭṭhānantarakālameva sacchikātabbaṃ sacchikato sacchikaraṇūpāyenāti vuttaṃ hoti, bhāvanapuṃsakaṃ vā etaṃ ‘‘ekamantaṃ nisīdī’’tiādīsu viya. Yo hi arūpajjhānena rūpakāyato nāmakāyekadesato ca vikkhambhanavimokkhena vimutto, tena nirodhasaṅkhāto vimokkho ālocito pakāsito viya hoti, na pana kāyena sacchikato. Nirodhaṃ pana ārammaṇaṃ katvā ekaccesu āsavesu khepitesu tena so sacchikato hoti, tasmā so sacchikātabbaṃ nirodhaṃ yathāālocitaṃ nāmakāyena sacchi karotīti ‘‘kāyasakkhī’’ti vuccati, na tu ‘‘vimutto’’ti ekaccānaṃ āsavānaṃ aparikkhīṇattā. Tenāha ‘‘jhānaphassaṃ paṭhamaṃ phusati, pacchā nirodhaṃ nibbānaṃ sacchikarotī’’ti. Ayaṃ catunnaṃ arūpasamāpattīnaṃ ekekato vuṭṭhāya saṅkhāre sammasitvā kāyasakkhibhāvaṃ pattānaṃ catunnaṃ, nirodhā vuṭṭhāya aggamaggappattaanāgāmino ca vasena ubhatobhāgavimutto viya pañcavidho nāma hotīti vuttaṃ abhidhammaṭīkāyaṃ (pu. pa. mūlaṭī. 24) ‘‘kāyasakkhimhipi eseva nayo’’ti. Ekacce āsavāti heṭṭhimamaggavajjhā āsavā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Diṭṭhantaṃ patto"
      },
      "ti dassanasaṅkhātassa sotāpattimaggañāṇassa anantaraṃ pattoti vuttaṃ hoti. ‘‘Diṭṭhattā patto’’tipi pāṭho. Etena catusaccadassanasaṅkhātāya diṭṭhiyā nirodhassa pattataṃ dīpeti. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘dukkhā saṅkhārā’’"
      },
      "tiādi. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paññāyā"
      },
      "ti maggapaññāya. Paṭhamaphalaṭṭhato paṭṭhāya yāva aggamaggaṭṭhā diṭṭhippatto. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sopi kāyasakkhī viya chabbidho hotī’’"
      },
      "ti. Yathā pana paññāvimutto, evaṃ ayampi sukkhavipassako catūhi arūpajjhānehi vuṭṭhāya diṭṭhippattabhāvappattā cattāro cāti pañcavidho hotīti veditabbo. Saddhāvimuttepi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idaṃ dukkha"
      },
      "nti ettakaṃ dukkhaṃ, na ito uddhaṃ dukkhanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathābhūtaṃ pajānātī"
      },
      "ti ṭhapetvā taṇhaṃ upādānakkhandhapañcakaṃ dukkhasaccanti yāthāvato pajānāti. Yasmā pana taṇhā dukkhaṃ janeti nibbatteti, tato taṃ dukkhaṃ samudeti, tasmā naṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ayaṃ dukkhasamudayo’’ti yathābhūtaṃ pajānāti"
      },
      ". Yasmā pana idaṃ dukkhañca samudayo ca nibbānaṃ patvā nirujjhati, appavattiṃ gacchati, tasmā na ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ayaṃ dukkhanirodho’’ti yathābhūtaṃ pajānāti"
      },
      ". Ariyo pana aṭṭhaṅgiko maggo taṃ dukkhanirodhaṃ gacchati, tena taṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ayaṃ dukkhanirodhagāminī paṭipadā’’ti yathābhūtaṃ pajānāti"
      },
      ". Ettāvatā nānākkhaṇe saccavavatthānaṃ dassitaṃ. Idāni taṃ ekakkhaṇe dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tathāgatappaveditā’’"
      },
      "tiādi vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tathāgatappaveditā"
      },
      "ti tathāgatena bodhimaṇḍe paṭividdhā viditā pākaṭā katā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammā"
      },
      "ti catusaccadhammā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vodiṭṭhā hontī"
      },
      "ti sudiṭṭhā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vocaritā"
      },
      "ti sucaritā, paññāya suṭṭhu carāpitāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aya"
      },
      "nti ayaṃ evarūpo puggalo diṭṭhippattoti."
    ],
    "innerText": "Diṭṭhantaṃ pattoti dassanasaṅkhātassa sotāpattimaggañāṇassa anantaraṃ pattoti vuttaṃ hoti. ‘‘Diṭṭhattā patto’’tipi pāṭho. Etena catusaccadassanasaṅkhātāya diṭṭhiyā nirodhassa pattataṃ dīpeti. Tenāha ‘‘dukkhā saṅkhārā’’tiādi. Tattha paññāyāti maggapaññāya. Paṭhamaphalaṭṭhato paṭṭhāya yāva aggamaggaṭṭhā diṭṭhippatto. Tenāha ‘‘sopi kāyasakkhī viya chabbidho hotī’’ti. Yathā pana paññāvimutto, evaṃ ayampi sukkhavipassako catūhi arūpajjhānehi vuṭṭhāya diṭṭhippattabhāvappattā cattāro cāti pañcavidho hotīti veditabbo. Saddhāvimuttepi eseva nayo. Idaṃ dukkhanti ettakaṃ dukkhaṃ, na ito uddhaṃ dukkhanti. Yathābhūtaṃ pajānātīti ṭhapetvā taṇhaṃ upādānakkhandhapañcakaṃ dukkhasaccanti yāthāvato pajānāti. Yasmā pana taṇhā dukkhaṃ janeti nibbatteti, tato taṃ dukkhaṃ samudeti, tasmā naṃ ‘‘ayaṃ dukkhasamudayo’’ti yathābhūtaṃ pajānāti. Yasmā pana idaṃ dukkhañca samudayo ca nibbānaṃ patvā nirujjhati, appavattiṃ gacchati, tasmā na ‘‘ayaṃ dukkhanirodho’’ti yathābhūtaṃ pajānāti. Ariyo pana aṭṭhaṅgiko maggo taṃ dukkhanirodhaṃ gacchati, tena taṃ ‘‘ayaṃ dukkhanirodhagāminī paṭipadā’’ti yathābhūtaṃ pajānāti. Ettāvatā nānākkhaṇe saccavavatthānaṃ dassitaṃ. Idāni taṃ ekakkhaṇe dassetuṃ ‘‘tathāgatappaveditā’’tiādi vuttaṃ. Tathāgatappaveditāti tathāgatena bodhimaṇḍe paṭividdhā viditā pākaṭā katā. Dhammāti catusaccadhammā. Vodiṭṭhā hontīti sudiṭṭhā. Vocaritāti sucaritā, paññāya suṭṭhu carāpitāti attho. Ayanti ayaṃ evarūpo puggalo diṭṭhippattoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddhāya vimutto"
      },
      "ti saddahanavasena vimutto. Etena sabbathā avimuttassapi saddhāmattena vimuttabhāvaṃ ",
      " dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddhāvimutto"
      },
      "ti vā saddhāya adhimuttoti ",
      " attho. Kiṃ pana nesaṃ kilesappahāne nānattaṃ atthīti? Natthi. Atha kasmā saddhāvimutto diṭṭhippattaṃ na pāpuṇātīti? Āgamanīyanānattena. Diṭṭhippatto hi āgamanamhi kilese vikkhambhento appadukkhena akasirena akilamantova sakkoti vikkhambhituṃ, saddhāvimutto pana dukkhena kasirena kilamanto sakkoti vikkhambhituṃ, tasmā saddhāvimutto diṭṭhippattaṃ na pāpuṇāti. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘etassa hī’’"
      },
      "tiādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddahantassā"
      },
      "ti ‘‘ekaṃsato ayaṃ paṭipadā kilesakkhayaṃ āvahati sammāsambuddhena bhāsitattā’’ti evaṃ saddahantassa. Yasmā panassa aniccānupassanādīhi niccasaññāpahānavasena bhāvanāya pubbenāparaṃ visesaṃ passato tattha tattha paccakkhatāpi atthi, tasmā vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘saddahantassa viyā’’"
      },
      "ti. Sesapadadvayaṃ tasseva vevacanaṃ. Ettha ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pubbabhāgamaggabhāvanā"
      },
      "ti vacanena āgamanīyanānattena diṭṭhippattasaddhāvimuttānaṃ paññānānattaṃ hotīti dassitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhidhammaṭṭhakathāya"
      },
      "mpi (pu. pa. aṭṭha. 28) ‘‘nesaṃ kilesappahāne nānattaṃ natthi, paññāya nānattaṃ atthiyevā’’ti vatvā ‘‘āgamanīyanānatteneva saddhāvimutto diṭṭhippattaṃ na pāpuṇātīti sanniṭṭhānaṃ kata’’nti vuttaṃ."
    ],
    "innerText": "Saddhāya vimuttoti saddahanavasena vimutto. Etena sabbathā avimuttassapi saddhāmattena vimuttabhāvaṃ dasseti. Saddhāvimuttoti vā saddhāya adhimuttoti attho. Kiṃ pana nesaṃ kilesappahāne nānattaṃ atthīti? Natthi. Atha kasmā saddhāvimutto diṭṭhippattaṃ na pāpuṇātīti? Āgamanīyanānattena. Diṭṭhippatto hi āgamanamhi kilese vikkhambhento appadukkhena akasirena akilamantova sakkoti vikkhambhituṃ, saddhāvimutto pana dukkhena kasirena kilamanto sakkoti vikkhambhituṃ, tasmā saddhāvimutto diṭṭhippattaṃ na pāpuṇāti. Tenāha ‘‘etassa hī’’tiādi. Saddahantassāti ‘‘ekaṃsato ayaṃ paṭipadā kilesakkhayaṃ āvahati sammāsambuddhena bhāsitattā’’ti evaṃ saddahantassa. Yasmā panassa aniccānupassanādīhi niccasaññāpahānavasena bhāvanāya pubbenāparaṃ visesaṃ passato tattha tattha paccakkhatāpi atthi, tasmā vuttaṃ ‘‘saddahantassa viyā’’ti. Sesapadadvayaṃ tasseva vevacanaṃ. Ettha ca pubbabhāgamaggabhāvanāti vacanena āgamanīyanānattena diṭṭhippattasaddhāvimuttānaṃ paññānānattaṃ hotīti dassitaṃ. Abhidhammaṭṭhakathāyampi (pu. pa. aṭṭha. 28) ‘‘nesaṃ kilesappahāne nānattaṃ natthi, paññāya nānattaṃ atthiyevā’’ti vatvā ‘‘āgamanīyanānatteneva saddhāvimutto diṭṭhippattaṃ na pāpuṇātīti sanniṭṭhānaṃ kata’’nti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ārammaṇaṃ yāthāvato dhāreti avadhāretīti dhammo, paññā. Taṃ paññāsaṅkhātaṃ dhammaṃ adhimattatāya pubbaṅgamaṃ hutvā pavattaṃ anussaratīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammānusārī"
      },
      ". Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘dhammo’’"
      },
      "tiādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññāpubbaṅgama"
      },
      "nti paññāpadhānaṃ. ‘‘Saddhaṃ anussarati, saddhāpubbaṅgamaṃ maggaṃ bhāvetī’’ti imamatthaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "eseva nayo"
      },
      "ti atidisati. Paññaṃ vāhetīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paññāvāhī,"
      },
      " paññaṃ sātisayaṃ pavattetīti attho. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘paññāpubbaṅgamaṃ ariyamaggaṃ bhāvetī’’"
      },
      "ti. Paññā vā puggalaṃ vāheti nibbānābhimukhaṃ gametīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paññāvāhī. Saddhāvāhī"
      },
      "ti etthāpi iminā nayeneva attho veditabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ubhatobhāgavimuttādikathā"
      },
      "ti ubhatobhāgavimuttādīsu āgamanato paṭṭhāya vattabbakathā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasmā"
      },
      "ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "visuddhimagge"
      },
      " (visuddhi. 2.773, 889) vuttattā. Tato eva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "visuddhimaggasaṃvaṇṇanāyaṃ"
      },
      " (visuddhi. mahāṭī. 2.773) vuttanayeneva cettha attho veditabbo."
    ],
    "innerText": "Ārammaṇaṃ yāthāvato dhāreti avadhāretīti dhammo, paññā. Taṃ paññāsaṅkhātaṃ dhammaṃ adhimattatāya pubbaṅgamaṃ hutvā pavattaṃ anussaratīti dhammānusārī. Tenāha ‘‘dhammo’’tiādi. Paññāpubbaṅgamanti paññāpadhānaṃ. ‘‘Saddhaṃ anussarati, saddhāpubbaṅgamaṃ maggaṃ bhāvetī’’ti imamatthaṃ eseva nayoti atidisati. Paññaṃ vāhetīti paññāvāhī, paññaṃ sātisayaṃ pavattetīti attho. Tenāha ‘‘paññāpubbaṅgamaṃ ariyamaggaṃ bhāvetī’’ti. Paññā vā puggalaṃ vāheti nibbānābhimukhaṃ gametīti paññāvāhī. Saddhāvāhīti etthāpi iminā nayeneva attho veditabbo. Ubhatobhāgavimuttādikathāti ubhatobhāgavimuttādīsu āgamanato paṭṭhāya vattabbakathā. Tasmāti visuddhimagge (visuddhi. 2.773, 889) vuttattā. Tato eva visuddhimaggasaṃvaṇṇanāyaṃ (visuddhi. mahāṭī. 2.773) vuttanayeneva cettha attho veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Puggalasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Udakūpamāsuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "15"
      },
      ". Pañcame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekantakāḷakehī"
      },
      "ti natthikavādaahetukavādaakiriyavādasaṅkhātehi niyatamicchādiṭṭhidhammehi. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘niyatamicchādiṭṭhiṃ sandhāya vutta’’"
      },
      "nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ puggalo"
      },
      "ti iminā kāraṇena ",
      " ekavāraṃ nimuggo nimuggoyeva so hoti. Etassa hi puna bhavato vuṭṭhānaṃ nāma natthīti vadanti makkhaligosālādayo viya. Heṭṭhā heṭṭhā narakaggīnaṃyeva āhāro. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sādhu saddhā kusalesū"
      },
      "ti kusaladhammesu saddhā nāma sāhu laddhakāti ummujjati, so tāvattakeneva kusalena ummujjati nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sādhu hirī"
      },
      "tiādīsupi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Caṅkavāre"
      },
      "ti rajakānaṃ khāraparissāvane, surāparissāvane vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ puggalo"
      },
      "ti ‘‘evaṃ sādhu saddhā’’ti imesaṃ saddhādīnaṃ vasena ekavāraṃ ummujjitvā tesaṃ parihāniyā puna nimujjatiyeva devadattādayo viya. Devadatto hi aṭṭha samāpattiyo pañca ca abhiññāyo nibbattetvāpi puna buddhānaṃ paṭipakkhatāya tehi guṇehi parihīno ruhiruppādakammaṃ saṅghabhedakammañca katvā kāyassa bhedā dutiyacittavārena cuticittamanantarā niraye nibbatto. Kokāliko dve aggasāvake upavaditvā padumaniraye nibbatto."
    ],
    "innerText": "15. Pañcame ekantakāḷakehīti natthikavādaahetukavādaakiriyavādasaṅkhātehi niyatamicchādiṭṭhidhammehi. Tenāha ‘‘niyatamicchādiṭṭhiṃ sandhāya vutta’’nti. Evaṃ puggaloti iminā kāraṇena ekavāraṃ nimuggo nimuggoyeva so hoti. Etassa hi puna bhavato vuṭṭhānaṃ nāma natthīti vadanti makkhaligosālādayo viya. Heṭṭhā heṭṭhā narakaggīnaṃyeva āhāro. Sādhu saddhā kusalesūti kusaladhammesu saddhā nāma sāhu laddhakāti ummujjati, so tāvattakeneva kusalena ummujjati nāma. Sādhu hirītiādīsupi eseva nayo. Caṅkavāreti rajakānaṃ khāraparissāvane, surāparissāvane vā. Evaṃ puggaloti ‘‘evaṃ sādhu saddhā’’ti imesaṃ saddhādīnaṃ vasena ekavāraṃ ummujjitvā tesaṃ parihāniyā puna nimujjatiyeva devadattādayo viya. Devadatto hi aṭṭha samāpattiyo pañca ca abhiññāyo nibbattetvāpi puna buddhānaṃ paṭipakkhatāya tehi guṇehi parihīno ruhiruppādakammaṃ saṅghabhedakammañca katvā kāyassa bhedā dutiyacittavārena cuticittamanantarā niraye nibbatto. Kokāliko dve aggasāvake upavaditvā padumaniraye nibbatto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Neva hāyati no vaḍḍhatī"
      },
      "ti appahonakakālepi na hāyati, pahonakakālepi na vaḍḍhati. Ubhayampi panetaṃ agārikenapi anagārikenapi dīpetabbaṃ. Ekacco hi agāriko appahonakakāle pakkhikabhattaṃ vassikaṃ vā upanibandhāpesi, so pacchā pahonakakālepi pakkhikabhattādimattameva pavatteti. Anagārikopi ādimhi appahonakakāle uddesaṃ dhutaṅgaṃ vā gaṇhāti, medhāvī balavīriyasampattiyā pahonakakāle tato uttariṃ na karoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ puggalo"
      },
      "ti evaṃ imāya saddhādīnaṃ ṭhitiyā puggalo ummujjitvā ṭhito nāma hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ummujjitvā pataratī"
      },
      "ti sakadāgāmipuggalo kilesatanutāya uṭṭhahitvā gantabbadisābhimukho tarati nāma."
    ],
    "innerText": "Neva hāyati no vaḍḍhatīti appahonakakālepi na hāyati, pahonakakālepi na vaḍḍhati. Ubhayampi panetaṃ agārikenapi anagārikenapi dīpetabbaṃ. Ekacco hi agāriko appahonakakāle pakkhikabhattaṃ vassikaṃ vā upanibandhāpesi, so pacchā pahonakakālepi pakkhikabhattādimattameva pavatteti. Anagārikopi ādimhi appahonakakāle uddesaṃ dhutaṅgaṃ vā gaṇhāti, medhāvī balavīriyasampattiyā pahonakakāle tato uttariṃ na karoti. Evaṃ puggaloti evaṃ imāya saddhādīnaṃ ṭhitiyā puggalo ummujjitvā ṭhito nāma hoti. Ummujjitvā pataratīti sakadāgāmipuggalo kilesatanutāya uṭṭhahitvā gantabbadisābhimukho tarati nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭigādhappatto hotī"
      },
      "ti anāgāmipuggalaṃ sandhāya vadati. Ime pana satta puggalā udakopamena dīpitā. Satta kira jaṅghavāṇijā addhānamaggappaṭipannā antarāmagge ekaṃ puṇṇanadiṃ pāpuṇiṃsu. Tesu paṭhamaṃ otiṇṇo udakabhīruko puriso otiṇṇaṭṭhāneyeva nimujjitvā puna saṇṭhātuṃ nāsakkhi, avassaṃva macchakacchapabhattaṃ jāto. Dutiyo otiṇṇaṭṭhāne nimujjitvā ",
      " sakiṃ uṭṭhahitvā puna nimuggo uṭṭhātuṃ nāsakkhi, antoyeva macchakacchapabhattaṃ jāto. Tatiyo nimujjitvā uṭṭhito majjhe nadiyā ṭhatvā neva orato āgantuṃ, na pāraṃ gantuṃ asakkhi. Catuttho uṭṭhāya ṭhito uttaraṇatitthaṃ olokesi. Pañcamo uttaraṇatitthaṃ oloketvā patarati. Chaṭṭho taṃ disvā pārimatīraṃ gantvā kaṭippamāṇe udake ṭhito. Sattamo pārimatīraṃ gantvā gandhacuṇṇādīhi nhatvā varavatthādīni nivāsetvā surabhivilepanaṃ vilimpitvā nīluppalamālādīni pilandhitvā nānālaṅkārappaṭimaṇḍito mahānagaraṃ pavisitvā pāsādamāruhitvā uttamabhojanaṃ bhuñjati."
    ],
    "innerText": "Paṭigādhappatto hotīti anāgāmipuggalaṃ sandhāya vadati. Ime pana satta puggalā udakopamena dīpitā. Satta kira jaṅghavāṇijā addhānamaggappaṭipannā antarāmagge ekaṃ puṇṇanadiṃ pāpuṇiṃsu. Tesu paṭhamaṃ otiṇṇo udakabhīruko puriso otiṇṇaṭṭhāneyeva nimujjitvā puna saṇṭhātuṃ nāsakkhi, avassaṃva macchakacchapabhattaṃ jāto. Dutiyo otiṇṇaṭṭhāne nimujjitvā sakiṃ uṭṭhahitvā puna nimuggo uṭṭhātuṃ nāsakkhi, antoyeva macchakacchapabhattaṃ jāto. Tatiyo nimujjitvā uṭṭhito majjhe nadiyā ṭhatvā neva orato āgantuṃ, na pāraṃ gantuṃ asakkhi. Catuttho uṭṭhāya ṭhito uttaraṇatitthaṃ olokesi. Pañcamo uttaraṇatitthaṃ oloketvā patarati. Chaṭṭho taṃ disvā pārimatīraṃ gantvā kaṭippamāṇe udake ṭhito. Sattamo pārimatīraṃ gantvā gandhacuṇṇādīhi nhatvā varavatthādīni nivāsetvā surabhivilepanaṃ vilimpitvā nīluppalamālādīni pilandhitvā nānālaṅkārappaṭimaṇḍito mahānagaraṃ pavisitvā pāsādamāruhitvā uttamabhojanaṃ bhuñjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      " jaṅghavāṇijā viya ime satta puggalā, nadī viya vaṭṭaṃ, paṭhamassa udakabhīrukassa purisassa otiṇṇaṭṭhāneyeva nimujjanaṃ viya micchādiṭṭhikassa vaṭṭe nimujjanaṃ, ummujjitvā nimujjanapuriso viya saddhādīnaṃ uppattimatthakena ummujjitvā tāsaṃ hāniyā nimuggapuggalo, majjhe nadiyā ṭhatvā viya saddhādīnaṃ ṭhitiyā ṭhitipuggalo, uttaraṇatitthaṃ olokento viya sotāpanno, patarantapuriso viya kilesakāmāvaṭṭatāya pataranto sakadāgāmī, taritvā kaṭimatte udake ṭhitapuriso viya anāvaṭṭadhammattā anāgāmī, nhatvā pārimatīraṃ uttaritvā thale ṭhitapuriso viya cattāro oghe atikkamitvā nibbānathale ṭhito khīṇāsavabrāhmaṇo, thale ṭhitapurisassa nagaraṃ pavisitvā pāsādaṃ āruyha uttamabhojanabhuñjanaṃ viya khīṇāsavassa nibbānārammaṇasamāpattiṃ appetvā vītināmanaṃ veditabbaṃ."
    ],
    "innerText": "Tattha jaṅghavāṇijā viya ime satta puggalā, nadī viya vaṭṭaṃ, paṭhamassa udakabhīrukassa purisassa otiṇṇaṭṭhāneyeva nimujjanaṃ viya micchādiṭṭhikassa vaṭṭe nimujjanaṃ, ummujjitvā nimujjanapuriso viya saddhādīnaṃ uppattimatthakena ummujjitvā tāsaṃ hāniyā nimuggapuggalo, majjhe nadiyā ṭhatvā viya saddhādīnaṃ ṭhitiyā ṭhitipuggalo, uttaraṇatitthaṃ olokento viya sotāpanno, patarantapuriso viya kilesakāmāvaṭṭatāya pataranto sakadāgāmī, taritvā kaṭimatte udake ṭhitapuriso viya anāvaṭṭadhammattā anāgāmī, nhatvā pārimatīraṃ uttaritvā thale ṭhitapuriso viya cattāro oghe atikkamitvā nibbānathale ṭhito khīṇāsavabrāhmaṇo, thale ṭhitapurisassa nagaraṃ pavisitvā pāsādaṃ āruyha uttamabhojanabhuñjanaṃ viya khīṇāsavassa nibbānārammaṇasamāpattiṃ appetvā vītināmanaṃ veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Udakūpamāsuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6-9. Aniccānupassīsuttādivaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "16-19"
      },
      ". Chaṭṭhe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘idha samasīsī kathito’’"
      },
      "ti vatvā evaṃ samasīsitaṃ vibhajitvā idhādhippetaṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘so catubbidho hotī’’"
      },
      "tiādimāha. Rogavasena samasīsī ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rogasamasīsī"
      },
      ". Esa nayo sesesupi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekappahārenevā"
      },
      "ti ekavelāyameva. Yo cakkhurogādīsu aññatarasmiṃ sati ‘‘ito anuṭṭhito arahattaṃ pāpuṇissāmī’’ti vipassanaṃ paṭṭhapesi, athassa arahattañca rogato vuṭṭhānañca ekakālameva hoti ",
      ", ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rogasamasīsī"
      },
      " nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iriyāpathassa pariyosāna"
      },
      "nti iriyāpathantarasamāyogo. Yo ṭhānādīsu iriyāpathesu aññataraṃ adhiṭṭhāya ‘‘avikopetvāva arahattaṃ pāpuṇissāmī’’ti vipassanaṃ paṭṭhapesi. Athassa arahattappatti ca iriyāpathavikopanañca ekappahāreneva hoti, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "iriyāpathasamasīsī"
      },
      " nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jīvitasamasīsī nāmā"
      },
      "ti ettha ‘‘palibodhasīsaṃ māno, parāmāsasīsaṃ diṭṭhi, vikkhepasīsaṃ uddhaccaṃ, kilesasīsaṃ avijjā, adhimokkhasīsaṃ saddhā, paggahasīsaṃ vīriyaṃ, upaṭṭhānasīsaṃ sati, avikkhepasīsaṃ samādhi, dassanasīsaṃ paññā, pavattasīsaṃ jīvitindriyaṃ, cutisīsaṃ vimokkho, saṅkhārasīsaṃ nirodho’’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭisambhidāyaṃ"
      },
      " (paṭi. ma. 3.33) vuttesu sattarasasu sīsesu pavattasīsaṃ kilesasīsanti dve sīsāni idhādhippetāni – ‘‘apubbaṃ acarimaṃ āsavapariyādānañca hoti jīvitapariyādānañcā’’ti vacanato. Tesu kilesasīsaṃ arahattamaggo pariyādiyati, pavattasīsaṃ jīvitindriyaṃ cuticittaṃ pariyādiyati. Tattha avijjāpariyādāyakaṃ cittaṃ jīvitindriyaṃ pariyādātuṃ na sakkoti, jīvitindriyapariyādāyakaṃ avijjaṃ pariyādātuṃ na sakkoti ",
      ". Aññaṃ avijjāpariyādāyakaṃ cittaṃ, aññaṃ jīvitandriyapariyādāyakaṃ. Yassa cetaṃ sīsadvayaṃ samaṃ pariyādānaṃ gacchati, so ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jīvitasamasīsī"
      },
      " nāma."
    ],
    "innerText": "16-19. Chaṭṭhe ‘‘idha samasīsī kathito’’ti vatvā evaṃ samasīsitaṃ vibhajitvā idhādhippetaṃ dassetuṃ ‘‘so catubbidho hotī’’tiādimāha. Rogavasena samasīsī rogasamasīsī. Esa nayo sesesupi. Ekappahārenevāti ekavelāyameva. Yo cakkhurogādīsu aññatarasmiṃ sati ‘‘ito anuṭṭhito arahattaṃ pāpuṇissāmī’’ti vipassanaṃ paṭṭhapesi, athassa arahattañca rogato vuṭṭhānañca ekakālameva hoti , ayaṃ rogasamasīsī nāma. Iriyāpathassa pariyosānanti iriyāpathantarasamāyogo. Yo ṭhānādīsu iriyāpathesu aññataraṃ adhiṭṭhāya ‘‘avikopetvāva arahattaṃ pāpuṇissāmī’’ti vipassanaṃ paṭṭhapesi. Athassa arahattappatti ca iriyāpathavikopanañca ekappahāreneva hoti, ayaṃ iriyāpathasamasīsī nāma. Jīvitasamasīsī nāmāti ettha ‘‘palibodhasīsaṃ māno, parāmāsasīsaṃ diṭṭhi, vikkhepasīsaṃ uddhaccaṃ, kilesasīsaṃ avijjā, adhimokkhasīsaṃ saddhā, paggahasīsaṃ vīriyaṃ, upaṭṭhānasīsaṃ sati, avikkhepasīsaṃ samādhi, dassanasīsaṃ paññā, pavattasīsaṃ jīvitindriyaṃ, cutisīsaṃ vimokkho, saṅkhārasīsaṃ nirodho’’ti paṭisambhidāyaṃ (paṭi. ma. 3.33) vuttesu sattarasasu sīsesu pavattasīsaṃ kilesasīsanti dve sīsāni idhādhippetāni – ‘‘apubbaṃ acarimaṃ āsavapariyādānañca hoti jīvitapariyādānañcā’’ti vacanato. Tesu kilesasīsaṃ arahattamaggo pariyādiyati, pavattasīsaṃ jīvitindriyaṃ cuticittaṃ pariyādiyati. Tattha avijjāpariyādāyakaṃ cittaṃ jīvitindriyaṃ pariyādātuṃ na sakkoti, jīvitindriyapariyādāyakaṃ avijjaṃ pariyādātuṃ na sakkoti . Aññaṃ avijjāpariyādāyakaṃ cittaṃ, aññaṃ jīvitandriyapariyādāyakaṃ. Yassa cetaṃ sīsadvayaṃ samaṃ pariyādānaṃ gacchati, so jīvitasamasīsī nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ panidaṃ samaṃ hotīti? Vārasamatāya. Yasmiñhi vāre maggavuṭṭhānaṃ hoti, sotāpattimagge pañca paccavekkhaṇāni, sakadāgāmimagge pañca, anāgāmimagge pañca, arahattamagge cattārīti ekūnavīsatime paccavekkhaṇañāṇe patiṭṭhāya bhavaṅgaṃ otaritvā parinibbāyato imāya vārasamatāya idaṃ ubhayasīsapariyādānampi samaṃ hotīti imāya vārasamatāya. Vārasamavuttidāyakena hi maggacittena attano anantaraṃ viya nipphādetabbā paccavekkhaṇavārā ca kilesapariyādānasseva vārāti vattabbataṃ arahati. ‘‘Vimuttasmiṃ vimuttamiti ñāṇaṃ hotī’’ti (ma. ni. 1.78; saṃ. ni. 3.12, 14) vacanato paccavekkhaṇaparisamāpanena kilesapariyādānaṃ sampāpitaṃ nāma hotīti imāya vāravuttiyā samatāya kilesapariyādānajīvitapariyādānānaṃ samatā veditabbā. Tenevāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yasmā panassa…pe... tasmā evaṃ vutta’’"
      },
      "nti."
    ],
    "innerText": "Kathaṃ panidaṃ samaṃ hotīti? Vārasamatāya. Yasmiñhi vāre maggavuṭṭhānaṃ hoti, sotāpattimagge pañca paccavekkhaṇāni, sakadāgāmimagge pañca, anāgāmimagge pañca, arahattamagge cattārīti ekūnavīsatime paccavekkhaṇañāṇe patiṭṭhāya bhavaṅgaṃ otaritvā parinibbāyato imāya vārasamatāya idaṃ ubhayasīsapariyādānampi samaṃ hotīti imāya vārasamatāya. Vārasamavuttidāyakena hi maggacittena attano anantaraṃ viya nipphādetabbā paccavekkhaṇavārā ca kilesapariyādānasseva vārāti vattabbataṃ arahati. ‘‘Vimuttasmiṃ vimuttamiti ñāṇaṃ hotī’’ti (ma. ni. 1.78; saṃ. ni. 3.12, 14) vacanato paccavekkhaṇaparisamāpanena kilesapariyādānaṃ sampāpitaṃ nāma hotīti imāya vāravuttiyā samatāya kilesapariyādānajīvitapariyādānānaṃ samatā veditabbā. Tenevāha ‘‘yasmā panassa…pe... tasmā evaṃ vutta’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Āyuno vemajjhaṃ anatikkamitvā antarāva kilesaparinibbānena parinibbāyatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "antarāparinibbāyī"
      },
      ". Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yo pañcasu suddhāvāsesū’’"
      },
      "tiādi ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vemajjhe"
      },
      "ti avihādīsu yattha uppanno, tattha āyuno vemajjhe. Āyuvemajjhaṃ upahacca atikkamitvā tattha parinibbāyatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upahaccaparinibbāyī"
      },
      ". Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yo tatthevā’’"
      },
      "tiādi. Asaṅkhārena appayogena anussāhena akilamanto tikkhindriyatāya sukheneva parinibbāyatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asaṅkhāraparinibbāyī"
      },
      ". Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yo tesaṃyevā’’"
      },
      "tiādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tesaṃyeva puggalāna"
      },
      "nti niddhāraṇe sāmivacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appayogenā"
      },
      "ti adhimattappayogena vinā appakasirena. Sasaṅkhārena sappayogena kilamanto dukkhena parinibbāyatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sasaṅkhāraparinibbāyī"
      },
      ". Uddhaṃvāhibhāvena uddhamassa taṇhāsotaṃ vaṭṭasotañcāti, uddhaṃ vā gantvā paṭilabhitabbato uddhamassa maggasotanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uddhaṃbhoto"
      },
      ". Paṭisandhivasena akaniṭṭhaṃ gacchatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "akaniṭṭhagāmī"
      },
      "."
    ],
    "innerText": "Āyuno vemajjhaṃ anatikkamitvā antarāva kilesaparinibbānena parinibbāyatīti antarāparinibbāyī. Tenāha ‘‘yo pañcasu suddhāvāsesū’’tiādi . Vemajjheti avihādīsu yattha uppanno, tattha āyuno vemajjhe. Āyuvemajjhaṃ upahacca atikkamitvā tattha parinibbāyatīti upahaccaparinibbāyī. Tenāha ‘‘yo tatthevā’’tiādi. Asaṅkhārena appayogena anussāhena akilamanto tikkhindriyatāya sukheneva parinibbāyatīti asaṅkhāraparinibbāyī. Tenāha ‘‘yo tesaṃyevā’’tiādi. Tesaṃyeva puggalānanti niddhāraṇe sāmivacanaṃ. Appayogenāti adhimattappayogena vinā appakasirena. Sasaṅkhārena sappayogena kilamanto dukkhena parinibbāyatīti sasaṅkhāraparinibbāyī. Uddhaṃvāhibhāvena uddhamassa taṇhāsotaṃ vaṭṭasotañcāti, uddhaṃ vā gantvā paṭilabhitabbato uddhamassa maggasotanti uddhaṃbhoto. Paṭisandhivasena akaniṭṭhaṃ gacchatīti akaniṭṭhagāmī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettha pana catukkaṃ veditabbaṃ. Yo hi avihato paṭṭhāya cattāro devaloke sodhetvā akaniṭṭhaṃ gantvā parinibbāyati, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uddhaṃsoto akaniṭṭhagāmī nāma"
      },
      ". Ayañhi avihesu kappasahassaṃ vasanto arahattaṃ pattuṃ asakkuṇitvā atappaṃ gacchati, tatrāpi dve kappasahassāni vasanto arahattaṃ pattuṃ asakkuṇitvā sudassaṃ gacchati, tatrāpi cattāri kappasahassāni vasanto arahattaṃ pattuṃ asakkuṇitvā sudassiṃ gacchati, tatrāpi aṭṭha kappasahassāni vasanto arahattaṃ ",
      " pattuṃ asakkuṇitvā akaniṭṭhaṃ gacchati, tattha vasanto aggamaggaṃ adhigacchati. Tattha yo avihato paṭṭhāya dutiyaṃ vā catutthaṃ vā devalokaṃ gantvā parinibbāyati, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uddhaṃsoto na akaniṭṭhagāmī"
      },
      " nāma. Yo kāmabhavato cavitvā akaniṭṭhesu parinibbāyati, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na uddhaṃsoto akaniṭṭhagāmī"
      },
      " nāma. Yo heṭṭhā catūsu devalokesu tattha tattheva nibbattitvā parinibbāyati, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na uddhaṃsoto na akaniṭṭhagāmī"
      },
      "ti."
    ],
    "innerText": "Ettha pana catukkaṃ veditabbaṃ. Yo hi avihato paṭṭhāya cattāro devaloke sodhetvā akaniṭṭhaṃ gantvā parinibbāyati, ayaṃ uddhaṃsoto akaniṭṭhagāmī nāma. Ayañhi avihesu kappasahassaṃ vasanto arahattaṃ pattuṃ asakkuṇitvā atappaṃ gacchati, tatrāpi dve kappasahassāni vasanto arahattaṃ pattuṃ asakkuṇitvā sudassaṃ gacchati, tatrāpi cattāri kappasahassāni vasanto arahattaṃ pattuṃ asakkuṇitvā sudassiṃ gacchati, tatrāpi aṭṭha kappasahassāni vasanto arahattaṃ pattuṃ asakkuṇitvā akaniṭṭhaṃ gacchati, tattha vasanto aggamaggaṃ adhigacchati. Tattha yo avihato paṭṭhāya dutiyaṃ vā catutthaṃ vā devalokaṃ gantvā parinibbāyati, ayaṃ uddhaṃsoto na akaniṭṭhagāmī nāma. Yo kāmabhavato cavitvā akaniṭṭhesu parinibbāyati, ayaṃ na uddhaṃsoto akaniṭṭhagāmī nāma. Yo heṭṭhā catūsu devalokesu tattha tattheva nibbattitvā parinibbāyati, ayaṃ na uddhaṃsoto na akaniṭṭhagāmīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ete pana avihesu uppannasamanantaraāyuvemajjhaṃ appatvāva parinibbāyanavasena tayo antarāparinibbāyino, eko upahaccaparinibbāyī, eko uddhaṃsototi pañcavidho, asaṅkhārasasaṅkhāraparinibbāyivibhāgena dasa honti, tathā atappasudassasudassīsūti cattāro dasakāti cattārīsaṃ. Akaniṭṭhe pana uddhaṃsoto natthi, tayo antarāparinibbāyino, eko ",
      " upahaccaparinibbāyīti cattāro, asaṅkhārasasaṅkhāraparinibbāyivibhāgena aṭṭhāti aṭṭhacattārīsaṃ anāgāmino. Sattamādīsu natthi vattabbaṃ."
    ],
    "innerText": "Ete pana avihesu uppannasamanantaraāyuvemajjhaṃ appatvāva parinibbāyanavasena tayo antarāparinibbāyino, eko upahaccaparinibbāyī, eko uddhaṃsototi pañcavidho, asaṅkhārasasaṅkhāraparinibbāyivibhāgena dasa honti, tathā atappasudassasudassīsūti cattāro dasakāti cattārīsaṃ. Akaniṭṭhe pana uddhaṃsoto natthi, tayo antarāparinibbāyino, eko upahaccaparinibbāyīti cattāro, asaṅkhārasasaṅkhāraparinibbāyivibhāgena aṭṭhāti aṭṭhacattārīsaṃ anāgāmino. Sattamādīsu natthi vattabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Aniccānupassīsuttādivaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Niddasavatthusuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "20"
      },
      ". Dasame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "niddasavatthūnī"
      },
      "ti ādisaddalopenāyaṃ niddesoti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘niddasādivatthūnī’’"
      },
      "ti. Natthi idāni imassa dasāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "niddaso. Pañho"
      },
      "ti ñātuṃ icchito attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puna dasavasso na hotī"
      },
      "ti tesaṃ matimattametanti dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘so kirā’’"
      },
      "ti kirasaddaggahaṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Niddaso"
      },
      "ti cetaṃ vacanamattaṃ. Tassa nibbīsādibhāvassa viya ninnavādibhāvassa ca icchitattāti dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘na kevalañcā’’"
      },
      "tiādi vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gāme vicaranto"
      },
      "ti gāme piṇḍāya caranto. Na idaṃ titthiyānaṃ adhivacanaṃ tesu tannimittassa abhāvā, sāsanepi sekhassapi na idaṃ adhivacanaṃ, kimaṅgaṃ pana puthujjanassa. Yassa panetaṃ adhivacanaṃ yena ca kāraṇena, taṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘khīṇāsavasseta’’"
      },
      "ntiādi vuttaṃ. Appaṭisandhikabhāvo hissa paccakkhato kāraṇaṃ. Paramparāya itarāni yāni pāḷiyaṃ āgatāniṃ."
    ],
    "innerText": "20. Dasame niddasavatthūnīti ādisaddalopenāyaṃ niddesoti āha ‘‘niddasādivatthūnī’’ti. Natthi idāni imassa dasāti niddaso. Pañhoti ñātuṃ icchito attho. Puna dasavasso na hotīti tesaṃ matimattametanti dassetuṃ ‘‘so kirā’’ti kirasaddaggahaṇaṃ. Niddasoti cetaṃ vacanamattaṃ. Tassa nibbīsādibhāvassa viya ninnavādibhāvassa ca icchitattāti dassetuṃ ‘‘na kevalañcā’’tiādi vuttaṃ. Gāme vicarantoti gāme piṇḍāya caranto. Na idaṃ titthiyānaṃ adhivacanaṃ tesu tannimittassa abhāvā, sāsanepi sekhassapi na idaṃ adhivacanaṃ, kimaṅgaṃ pana puthujjanassa. Yassa panetaṃ adhivacanaṃ yena ca kāraṇena, taṃ dassetuṃ ‘‘khīṇāsavasseta’’ntiādi vuttaṃ. Appaṭisandhikabhāvo hissa paccakkhato kāraṇaṃ. Paramparāya itarāni yāni pāḷiyaṃ āgatāniṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sikkhāya sammadeva ādānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sikkhāsamādānaṃ"
      },
      ". Taṃ panassā pāripūriyā veditabbanti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sikkhāttayapūraṇe’’"
      },
      "ti. Sikkhāya vā sammadeva ādito paṭṭhāya rakkhaṇaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sikkhāsamādānaṃ"
      },
      ". Tañca atthato pūraṇena paricchinnaṃ arakkhaṇe sabbena sabbaṃ abhāvato, rakkhaṇe ",
      " ca paripūraṇato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Balavacchando"
      },
      "ti daḷhacchando. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āyati"
      },
      "nti anantarānāgatadivasādikālo adhippeto, na anāgatabhavoti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘anāgate punadivasādīsupī’’"
      },
      "ti. Sikkhaṃ paripūrentassa tattha nibaddhabhattitā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avigatapematā"
      },
      ". Tebhūmakadhammānaṃ aniccādivasena sammadeva nijjhānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammanisāmanā"
      },
      "ti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘vipassanāyetaṃ adhivacana’’"
      },
      "nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṇhāvinaye"
      },
      "ti bhaṅgānupassanāñāṇānubhāvasiddhe taṇhāvikkhambhane. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekībhāve"
      },
      "ti gaṇasaṅgaṇikākilesasaṅgaṇikāvigamasiddhe vivekavāse. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vīriyārambhe"
      },
      "ti sammappadhānassa paggaṇhane ",
      ". Taṃ pana sabbaso vīriyassa paribrūhanaṃ hotīti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kāyikacetasikassa vīriyassa pūraṇe’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Satiyañceva nipakabhāve cā"
      },
      "ti satokāritāya ceva sampajānakāritāya ca. Satisampajaññabaleneva hi vīriyārambho ijjhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Diṭṭhipaṭivedhe"
      },
      "ti maggasammādiṭṭhiyā paṭivijjhane. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘maggadassane’’"
      },
      "ti."
    ],
    "innerText": "Sikkhāya sammadeva ādānaṃ sikkhāsamādānaṃ. Taṃ panassā pāripūriyā veditabbanti āha ‘‘sikkhāttayapūraṇe’’ti. Sikkhāya vā sammadeva ādito paṭṭhāya rakkhaṇaṃ sikkhāsamādānaṃ. Tañca atthato pūraṇena paricchinnaṃ arakkhaṇe sabbena sabbaṃ abhāvato, rakkhaṇe ca paripūraṇato. Balavacchandoti daḷhacchando. Āyatinti anantarānāgatadivasādikālo adhippeto, na anāgatabhavoti āha ‘‘anāgate punadivasādīsupī’’ti. Sikkhaṃ paripūrentassa tattha nibaddhabhattitā avigatapematā. Tebhūmakadhammānaṃ aniccādivasena sammadeva nijjhānaṃ dhammanisāmanāti āha ‘‘vipassanāyetaṃ adhivacana’’nti. Taṇhāvinayeti bhaṅgānupassanāñāṇānubhāvasiddhe taṇhāvikkhambhane. Ekībhāveti gaṇasaṅgaṇikākilesasaṅgaṇikāvigamasiddhe vivekavāse. Vīriyārambheti sammappadhānassa paggaṇhane . Taṃ pana sabbaso vīriyassa paribrūhanaṃ hotīti āha ‘‘kāyikacetasikassa vīriyassa pūraṇe’’ti. Satiyañceva nipakabhāve cāti satokāritāya ceva sampajānakāritāya ca. Satisampajaññabaleneva hi vīriyārambho ijjhati. Diṭṭhipaṭivedheti maggasammādiṭṭhiyā paṭivijjhane. Tenāha ‘‘maggadassane’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Niddasavatthusuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Anusayavaggavaṇṇanā niṭṭhitā."
  }
]