[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "19. Kāyagatāsativaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "563"
      },
      ". ‘‘Yassa ",
      " kassaci, bhikkhave, mahāsamuddo cetasā phuṭo antogadhā tassa kunnadiyo yā kāci samuddaṅgamā; evamevaṃ, bhikkhave, yassa kassaci kāyagatā sati bhāvitā bahulīkatā antogadhā tassa kusalā dhammā ye keci vijjābhāgiyā’’ti."
    ],
    "innerText": "563. ‘‘Yassa kassaci, bhikkhave, mahāsamuddo cetasā phuṭo antogadhā tassa kunnadiyo yā kāci samuddaṅgamā; evamevaṃ, bhikkhave, yassa kassaci kāyagatā sati bhāvitā bahulīkatā antogadhā tassa kusalā dhammā ye keci vijjābhāgiyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "564-570"
      },
      ". ‘‘Ekadhammo, bhikkhave, bhāvito bahulīkato mahato saṃvegāya saṃvattati… mahato atthāya saṃvattati… mahato yogakkhemāya saṃvattati… satisampajaññāya ",
      " saṃvattati… ñāṇadassanappaṭilābhāya saṃvattati… diṭṭhadhammasukhavihārāya saṃvattati… vijjāvimuttiphalasacchikiriyāya saṃvattati. Katamo ekadhammo? Kāyagatā sati. Ayaṃ kho, bhikkhave, ekadhammo bhāvito bahulīkato mahato saṃvegāya saṃvattati… mahato atthāya saṃvattati… mahato yogakkhemāya saṃvattati… satisampajaññāya saṃvattati… ñāṇadassanappaṭilābhāya saṃvattati… diṭṭhadhammasukhavihārāya saṃvattati… vijjāvimuttiphalasacchikiriyāya saṃvattatī’’ti."
    ],
    "innerText": "564-570. ‘‘Ekadhammo, bhikkhave, bhāvito bahulīkato mahato saṃvegāya saṃvattati… mahato atthāya saṃvattati… mahato yogakkhemāya saṃvattati… satisampajaññāya saṃvattati… ñāṇadassanappaṭilābhāya saṃvattati… diṭṭhadhammasukhavihārāya saṃvattati… vijjāvimuttiphalasacchikiriyāya saṃvattati. Katamo ekadhammo? Kāyagatā sati. Ayaṃ kho, bhikkhave, ekadhammo bhāvito bahulīkato mahato saṃvegāya saṃvattati… mahato atthāya saṃvattati… mahato yogakkhemāya saṃvattati… satisampajaññāya saṃvattati… ñāṇadassanappaṭilābhāya saṃvattati… diṭṭhadhammasukhavihārāya saṃvattati… vijjāvimuttiphalasacchikiriyāya saṃvattatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "571"
      },
      ". ‘‘Ekadhamme ",
      ", bhikkhave, bhāvite bahulīkate kāyopi passambhati, cittampi passambhati, vitakkavicārāpi vūpasammanti, kevalāpi vijjābhāgiyā dhammā bhāvanāpāripūriṃ gacchanti. Katamasmiṃ ekadhamme? Kāyagatāya satiyā. Imasmiṃ ",
      " kho, bhikkhave, ekadhamme bhāvite bahulīkate kāyopi passambhati, cittampi passambhati, vitakkavicārāpi vūpasammanti, kevalāpi vijjābhāgiyā dhammā bhāvanāpāripūriṃ gacchantī’’ti."
    ],
    "innerText": "571. ‘‘Ekadhamme , bhikkhave, bhāvite bahulīkate kāyopi passambhati, cittampi passambhati, vitakkavicārāpi vūpasammanti, kevalāpi vijjābhāgiyā dhammā bhāvanāpāripūriṃ gacchanti. Katamasmiṃ ekadhamme? Kāyagatāya satiyā. Imasmiṃ kho, bhikkhave, ekadhamme bhāvite bahulīkate kāyopi passambhati, cittampi passambhati, vitakkavicārāpi vūpasammanti, kevalāpi vijjābhāgiyā dhammā bhāvanāpāripūriṃ gacchantī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "572"
      },
      ". ‘‘Ekadhamme, bhikkhave, bhāvite bahulīkate anuppannā ceva akusalā dhammā nuppajjanti, uppannā ca akusalā dhammā pahīyanti. Katamasmiṃ ekadhamme? Kāyagatāya satiyā. Imasmiṃ kho, bhikkhave, ekadhamme bhāvite bahulīkate anuppannā ceva akusalā dhammā nuppajjanti, uppannā ca akusalā dhammā pahīyantī’’ti."
    ],
    "innerText": "572. ‘‘Ekadhamme, bhikkhave, bhāvite bahulīkate anuppannā ceva akusalā dhammā nuppajjanti, uppannā ca akusalā dhammā pahīyanti. Katamasmiṃ ekadhamme? Kāyagatāya satiyā. Imasmiṃ kho, bhikkhave, ekadhamme bhāvite bahulīkate anuppannā ceva akusalā dhammā nuppajjanti, uppannā ca akusalā dhammā pahīyantī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "573"
      },
      ". ‘‘Ekadhamme ",
      ", bhikkhave, bhāvite bahulīkate anuppannā ceva kusalā dhammā uppajjanti, uppannā ca kusalā dhammā bhiyyobhāvāya vepullāya ",
      " saṃvattanti. Katamasmiṃ ekadhamme? Kāyagatāya satiyā. Imasmiṃ kho, bhikkhave, ekadhamme bhāvite bahulīkate anuppannā ceva kusalā dhammā uppajjanti, uppannā ca kusalā dhammā bhiyyobhāvāya vepullāya saṃvattantī’’ti."
    ],
    "innerText": "573. ‘‘Ekadhamme , bhikkhave, bhāvite bahulīkate anuppannā ceva kusalā dhammā uppajjanti, uppannā ca kusalā dhammā bhiyyobhāvāya vepullāya saṃvattanti. Katamasmiṃ ekadhamme? Kāyagatāya satiyā. Imasmiṃ kho, bhikkhave, ekadhamme bhāvite bahulīkate anuppannā ceva kusalā dhammā uppajjanti, uppannā ca kusalā dhammā bhiyyobhāvāya vepullāya saṃvattantī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "574"
      },
      ". ‘‘Ekadhamme, bhikkhave, bhāvite bahulīkate avijjā pahīyati, vijjā uppajjati, asmimāno pahīyati, anusayā samugghātaṃ gacchanti, saṃyojanā pahīyanti. Katamasmiṃ ekadhamme? Kāyagatāya satiyā. Imasmiṃ kho, bhikkhave, ekadhamme bhāvite bahulīkate avijjā pahīyati, vijjā uppajjati, asmimāno pahīyati, anusayā samugghātaṃ gacchanti, saṃyojanā pahīyantī’’ti."
    ],
    "innerText": "574. ‘‘Ekadhamme, bhikkhave, bhāvite bahulīkate avijjā pahīyati, vijjā uppajjati, asmimāno pahīyati, anusayā samugghātaṃ gacchanti, saṃyojanā pahīyanti. Katamasmiṃ ekadhamme? Kāyagatāya satiyā. Imasmiṃ kho, bhikkhave, ekadhamme bhāvite bahulīkate avijjā pahīyati, vijjā uppajjati, asmimāno pahīyati, anusayā samugghātaṃ gacchanti, saṃyojanā pahīyantī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "575-576"
      },
      ". ‘‘Ekadhammo, bhikkhave, bhāvito bahulīkato paññāpabhedāya saṃvattati… anupādāparinibbānāya saṃvattati. Katamo ekadhammo? Kāyagatā sati. Ayaṃ kho, bhikkhave, ekadhammo bhāvito bahulīkato paññāpabhedāya saṃvattati… anupādāparinibbānāya saṃvattatī’’ti."
    ],
    "innerText": "575-576. ‘‘Ekadhammo, bhikkhave, bhāvito bahulīkato paññāpabhedāya saṃvattati… anupādāparinibbānāya saṃvattati. Katamo ekadhammo? Kāyagatā sati. Ayaṃ kho, bhikkhave, ekadhammo bhāvito bahulīkato paññāpabhedāya saṃvattati… anupādāparinibbānāya saṃvattatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "577-579"
      },
      ". ‘‘Ekadhamme ",
      ", bhikkhave, bhāvite bahulīkate anekadhātupaṭivedho hoti… nānādhātupaṭivedho hoti… anekadhātupaṭisambhidā hoti. Katamasmiṃ ekadhamme? Kāyagatāya satiyā. Imasmiṃ kho, bhikkhave, ekadhamme bhāvite bahulīkate anekadhātupaṭivedho hoti… nānādhātupaṭivedho hoti… anekadhātupaṭisambhidā hotī’’ti."
    ],
    "innerText": "577-579. ‘‘Ekadhamme , bhikkhave, bhāvite bahulīkate anekadhātupaṭivedho hoti… nānādhātupaṭivedho hoti… anekadhātupaṭisambhidā hoti. Katamasmiṃ ekadhamme? Kāyagatāya satiyā. Imasmiṃ kho, bhikkhave, ekadhamme bhāvite bahulīkate anekadhātupaṭivedho hoti… nānādhātupaṭivedho hoti… anekadhātupaṭisambhidā hotī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "580-583"
      },
      ". ‘‘Ekadhammo, bhikkhave, bhāvito bahulīkato sotāpattiphalasacchikiriyāya ",
      " saṃvattati… sakadāgāmiphalasacchikiriyāya saṃvattati… anāgāmiphalasacchikiriyāya saṃvattati… arahattaphalasacchikiriyāya ",
      " saṃvattati. Katamo ekadhammo? Kāyagatā sati. Ayaṃ kho, bhikkhave, ekadhammo bhāvito bahulīkato sotāpattiphalasacchikiriyāya saṃvattati… sakadāgāmiphalasacchikiriyāya saṃvattati… anāgāmiphalasacchikiriyāya saṃvattati… arahattaphalasacchikiriyāya saṃvattatī’’ti."
    ],
    "innerText": "580-583. ‘‘Ekadhammo, bhikkhave, bhāvito bahulīkato sotāpattiphalasacchikiriyāya saṃvattati… sakadāgāmiphalasacchikiriyāya saṃvattati… anāgāmiphalasacchikiriyāya saṃvattati… arahattaphalasacchikiriyāya saṃvattati. Katamo ekadhammo? Kāyagatā sati. Ayaṃ kho, bhikkhave, ekadhammo bhāvito bahulīkato sotāpattiphalasacchikiriyāya saṃvattati… sakadāgāmiphalasacchikiriyāya saṃvattati… anāgāmiphalasacchikiriyāya saṃvattati… arahattaphalasacchikiriyāya saṃvattatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "584-599"
      },
      ". ‘‘Ekadhammo ",
      ", bhikkhave, bhāvito bahulīkato paññāpaṭilābhāya saṃvattati… paññāvuddhiyā saṃvattati… paññāvepullāya saṃvattati… mahāpaññatāya saṃvattati… puthupaññatāya saṃvattati… vipulapaññatāya saṃvattati… gambhīrapaññatāya saṃvattati… asāmantapaññatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[asamatthapaññatāya (syā. kaṃ.), asamattapaññatāya (ka.), asamantapaññatāya (ṭīkā) paṭi. ma. aṭṭha. 2.3.1 passitabbaṃ]"
      },
      " saṃvattati… bhūripaññatāya saṃvattati… paññābāhullāya saṃvattati… sīghapaññatāya saṃvattati… lahupaññatāya saṃvattati… hāsapaññatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[hāsupaññatāya (sī. pī.)]"
      },
      " saṃvattati… javanapaññatāya saṃvattati… tikkhapaññatāya saṃvattati… nibbedhikapaññatāya saṃvattati. Katamo ekadhammo? Kāyagatā sati. Ayaṃ kho, bhikkhave, ekadhammo bhāvito bahulīkato paññāpaṭilābhāya saṃvattati… paññāvuddhiyā saṃvattati… paññāvepullāya saṃvattati… mahāpaññatāya saṃvattati… puthupaññatāya saṃvattati… vipulapaññatāya saṃvattati… gambhīrapaññatāya saṃvattati… asāmantapaññatāya saṃvattati… bhūripaññatāya saṃvattati… paññābāhullāya saṃvattati… sīghapaññatāya saṃvattati… lahupaññatāya saṃvattati… hāsapaññatāya saṃvattati… javanapaññatāya saṃvattati… tikkhapaññatāya saṃvattati… nibbedhikapaññatāya saṃvattatī’’ti."
    ],
    "innerText": "584-599. ‘‘Ekadhammo , bhikkhave, bhāvito bahulīkato paññāpaṭilābhāya saṃvattati… paññāvuddhiyā saṃvattati… paññāvepullāya saṃvattati… mahāpaññatāya saṃvattati… puthupaññatāya saṃvattati… vipulapaññatāya saṃvattati… gambhīrapaññatāya saṃvattati… asāmantapaññatāya [asamatthapaññatāya (syā. kaṃ.), asamattapaññatāya (ka.), asamantapaññatāya (ṭīkā) paṭi. ma. aṭṭha. 2.3.1 passitabbaṃ] saṃvattati… bhūripaññatāya saṃvattati… paññābāhullāya saṃvattati… sīghapaññatāya saṃvattati… lahupaññatāya saṃvattati… hāsapaññatāya [hāsupaññatāya (sī. pī.)] saṃvattati… javanapaññatāya saṃvattati… tikkhapaññatāya saṃvattati… nibbedhikapaññatāya saṃvattati. Katamo ekadhammo? Kāyagatā sati. Ayaṃ kho, bhikkhave, ekadhammo bhāvito bahulīkato paññāpaṭilābhāya saṃvattati… paññāvuddhiyā saṃvattati… paññāvepullāya saṃvattati… mahāpaññatāya saṃvattati… puthupaññatāya saṃvattati… vipulapaññatāya saṃvattati… gambhīrapaññatāya saṃvattati… asāmantapaññatāya saṃvattati… bhūripaññatāya saṃvattati… paññābāhullāya saṃvattati… sīghapaññatāya saṃvattati… lahupaññatāya saṃvattati… hāsapaññatāya saṃvattati… javanapaññatāya saṃvattati… tikkhapaññatāya saṃvattati… nibbedhikapaññatāya saṃvattatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Kāyagatāsativaggo ekūnavīsatimo."
  }
]