[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "7. Vīriyārambhādivaggavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "61"
      },
      ". Sattamassa ",
      " paṭhame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vīriyārambho"
      },
      "ti catukiccassa sammappadhānavīriyassa ārambho, āraddhapaggahitaparipuṇṇavīriyatāti attho."
    ],
    "innerText": "61. Sattamassa paṭhame vīriyārambhoti catukiccassa sammappadhānavīriyassa ārambho, āraddhapaggahitaparipuṇṇavīriyatāti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "62"
      },
      ". Dutiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mahicchatā"
      },
      "ti mahālobho. Yaṃ sandhāya vuttaṃ –"
    ],
    "innerText": "62. Dutiye mahicchatāti mahālobho. Yaṃ sandhāya vuttaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Tattha katamā mahicchatā? Itarītaracīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārehi pañcahi vā kāmaguṇehi asantuṭṭhassa bhiyyokamyatā, yā evarūpā icchā icchāgatā mahicchatā rāgo sārāgo cittassa sārāgo. Ayaṃ vuccati mahicchatā’’ti (vibha. 850)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "63"
      },
      ". Tatiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "appicchatā"
      },
      "ti alobho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appicchassā"
      },
      "ti anicchassa. Ettha hi byañjanaṃ sāvasesaṃ viya, attho pana niravaseso. Na hi appamattikāya icchāya atthibhāvena so appicchoti vutto, icchāya pana abhāvena punappunaṃ āsevitassa alobhasseva bhāvena appicchoti vutto."
    ],
    "innerText": "63. Tatiye appicchatāti alobho. Appicchassāti anicchassa. Ettha hi byañjanaṃ sāvasesaṃ viya, attho pana niravaseso. Na hi appamattikāya icchāya atthibhāvena so appicchoti vutto, icchāya pana abhāvena punappunaṃ āsevitassa alobhasseva bhāvena appicchoti vutto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Apicettha atricchatā, pāpicchatā, mahicchatā appicchatāti ayaṃ bhedo veditabbo. Tattha sakalābhe atittassa paralābhe patthanā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atricchatā"
      },
      " nāma, yāya samannāgatassa ekabhājane pakkapūvepi attano patte patite na supakko viya khuddako ca viya khāyati, sveva pana parassa patte pakkhitto supakko viya mahanto viya ca khāyati. Asantaguṇasambhāvanatā pana paṭiggahaṇe ca amattaññutā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pāpicchatā"
      },
      " nāma, sā ‘‘idhekacco assaddho samāno saddhoti maṃ jano jānātū’’tiādinā nayena abhidhamme āgatāyeva, tāya samannāgato puggalo kohaññe patiṭṭhāti. Santaguṇasambhāvanatā pana paṭiggahaṇe ca amattaññutā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mahicchatā"
      },
      " nāma, sāpi ‘‘idhekacco saddho samāno saddhoti maṃ jano jānātūti icchati, sīlavā samāno sīlavāti maṃ ",
      " jano jānātū’’ti iminā nayena āgatāyeva. Tāya samannāgato puggalo dussantappayo hoti, vijātamātāpissa cittaṃ gahetuṃ na sakkoti. Tenetaṃ vuccati –"
    ],
    "innerText": "Apicettha atricchatā, pāpicchatā, mahicchatā appicchatāti ayaṃ bhedo veditabbo. Tattha sakalābhe atittassa paralābhe patthanā atricchatā nāma, yāya samannāgatassa ekabhājane pakkapūvepi attano patte patite na supakko viya khuddako ca viya khāyati, sveva pana parassa patte pakkhitto supakko viya mahanto viya ca khāyati. Asantaguṇasambhāvanatā pana paṭiggahaṇe ca amattaññutā pāpicchatā nāma, sā ‘‘idhekacco assaddho samāno saddhoti maṃ jano jānātū’’tiādinā nayena abhidhamme āgatāyeva, tāya samannāgato puggalo kohaññe patiṭṭhāti. Santaguṇasambhāvanatā pana paṭiggahaṇe ca amattaññutā mahicchatā nāma, sāpi ‘‘idhekacco saddho samāno saddhoti maṃ jano jānātūti icchati, sīlavā samāno sīlavāti maṃ jano jānātū’’ti iminā nayena āgatāyeva. Tāya samannāgato puggalo dussantappayo hoti, vijātamātāpissa cittaṃ gahetuṃ na sakkoti. Tenetaṃ vuccati –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Aggikkhandho samuddo ca, mahiccho cāpi puggalo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sakaṭena paccaye dentu, tayopete atappayā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Santaguṇanigūhanatā ",
      " pana paṭiggahaṇe ca mattaññutā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "appicchatā"
      },
      " nāma, tāya samannāgato puggalo attani vijjamānampi guṇaṃ paṭicchādetukāmatāya saddho samāno ‘‘saddhoti maṃ jano jānātū’’ti na icchati. Sīlavā, pavivitto, bahussuto, āraddhavīriyo, samādhisampanno, paññavā, khīṇāsavo ",
      " samāno ‘‘khīṇāsavoti maṃ jano jānātū’’ti na icchati seyyathāpi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "majjhantikatthero"
      },
      "."
    ],
    "innerText": "Santaguṇanigūhanatā pana paṭiggahaṇe ca mattaññutā appicchatā nāma, tāya samannāgato puggalo attani vijjamānampi guṇaṃ paṭicchādetukāmatāya saddho samāno ‘‘saddhoti maṃ jano jānātū’’ti na icchati. Sīlavā, pavivitto, bahussuto, āraddhavīriyo, samādhisampanno, paññavā, khīṇāsavo samāno ‘‘khīṇāsavoti maṃ jano jānātū’’ti na icchati seyyathāpi majjhantikatthero."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Thero kira mahākhīṇāsavo ahosi, pattacīvaraṃ panassa pādamattameva agghati. So asokassa dhammarañño vihāramahadivase saṅghatthero ahosi. Athassa atilūkhabhāvaṃ disvā manussā, ‘‘bhante, thokaṃ bahi hothā’’ti āhaṃsu. Thero ‘‘mādise khīṇāsave rañño saṅgahaṃ akaronte añño ko karissatī’’ti pathaviyaṃ nimujjitvā saṅghattherassa ukkhittapiṇḍaṃ gaṇhantoyeva ummujji. Evaṃ khīṇāsavo samāno ‘‘khīṇāsavoti maṃ jano jānātū’’ti na icchati. Evaṃ appiccho ca pana bhikkhu anuppannaṃ lābhaṃ uppādeti, uppannaṃ thāvaraṃ karoti, dāyakānaṃ cittaṃ ārādheti. Yathā yathā hi so attano appicchatāya appaṃ gaṇhāti, tathā tathā tassa vatte pasannā manussā bahū denti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aparopi catubbidho appiccho – paccayaappiccho, dhutaṅgaappiccho, pariyattiappiccho, adhigamaappicchoti. Tattha catūsu paccayesu appiccho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paccayaappiccho"
      },
      " nāma. So dāyakassa vasaṃ jānāti, deyyadhammassa vasaṃ jānāti, attano thāmaṃ jānāti. Yadi hi deyyadhammo bahu hoti, dāyako appamattakaṃ dātukāmo, dāyakassa vasena appaṃ gaṇhāti. Deyyadhammo appo, dāyako bahuṃ dātukāmo, deyyadhammassa vasena appaṃ gaṇhāti. Deyyadhammopi bahu, dāyakopi bahuṃ dātukāmo, attano thāmaṃ ñatvā pamāṇeneva gaṇhāti."
    ],
    "innerText": "Aparopi catubbidho appiccho – paccayaappiccho, dhutaṅgaappiccho, pariyattiappiccho, adhigamaappicchoti. Tattha catūsu paccayesu appiccho paccayaappiccho nāma. So dāyakassa vasaṃ jānāti, deyyadhammassa vasaṃ jānāti, attano thāmaṃ jānāti. Yadi hi deyyadhammo bahu hoti, dāyako appamattakaṃ dātukāmo, dāyakassa vasena appaṃ gaṇhāti. Deyyadhammo appo, dāyako bahuṃ dātukāmo, deyyadhammassa vasena appaṃ gaṇhāti. Deyyadhammopi bahu, dāyakopi bahuṃ dātukāmo, attano thāmaṃ ñatvā pamāṇeneva gaṇhāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dhutaṅgasamādānassa ",
      " attani atthibhāvaṃ najānāpetukāmo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhutaṅgaappiccho"
      },
      " nāma. Tassa vibhāvanatthaṃ imāni vatthūni – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sosānikamahākumāratthero"
      },
      " kira saṭṭhi vassāni susāne vasi, añño ekabhikkhupi na aññāsi. Tenevāha –"
    ],
    "innerText": "Dhutaṅgasamādānassa attani atthibhāvaṃ najānāpetukāmo dhutaṅgaappiccho nāma. Tassa vibhāvanatthaṃ imāni vatthūni – sosānikamahākumāratthero kira saṭṭhi vassāni susāne vasi, añño ekabhikkhupi na aññāsi. Tenevāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Susāne ",
      " saṭṭhi vassāni, abbokiṇṇaṃ vasāmahaṃ;"
    ],
    "innerText": "‘‘Susāne saṭṭhi vassāni, abbokiṇṇaṃ vasāmahaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dutiyo maṃ na jāneyya, aho sosānikuttamo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Cetiyapabbate dve ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhātikattherā"
      },
      " vasiṃsu. Kaniṭṭho upaṭṭhākena pesitaṃ ucchukhaṇḍikaṃ gahetvā jeṭṭhassa santikaṃ agamāsi ‘‘paribhogaṃ, bhante, karothā’’ti. Therassa ca bhattakiccaṃ katvā mukhavikkhālanakālo ahosi. So ‘‘alaṃ, āvuso’’ti āha. Kacci, bhante, ekāsanikatthāti? Āharāvuso, ucchukhaṇḍikanti paññāsa vassāni ekāsaniko samānopi dhutaṅgaṃ nigūhamāno paribhogaṃ katvā mukhaṃ vikkhāletvā puna dhutaṅgaṃ adhiṭṭhāya gato."
    ],
    "innerText": "Cetiyapabbate dve bhātikattherā vasiṃsu. Kaniṭṭho upaṭṭhākena pesitaṃ ucchukhaṇḍikaṃ gahetvā jeṭṭhassa santikaṃ agamāsi ‘‘paribhogaṃ, bhante, karothā’’ti. Therassa ca bhattakiccaṃ katvā mukhavikkhālanakālo ahosi. So ‘‘alaṃ, āvuso’’ti āha. Kacci, bhante, ekāsanikatthāti? Āharāvuso, ucchukhaṇḍikanti paññāsa vassāni ekāsaniko samānopi dhutaṅgaṃ nigūhamāno paribhogaṃ katvā mukhaṃ vikkhāletvā puna dhutaṅgaṃ adhiṭṭhāya gato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yo pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sāketatissatthero"
      },
      " viya bahussutabhāvaṃ jānāpetuṃ na icchati, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pariyattiappiccho"
      },
      " nāma. Thero kira ‘‘khaṇo natthīti uddesaparipucchāsu okāsaṃ akaronto kadā maraṇakkhaṇaṃ, bhante, labhissathā’’ti codito gaṇaṃ vissajjetvā kaṇikāravālikasamuddavihāraṃ gato. Tattha antovassaṃ theranavamajjhimānaṃ upakāro hutvā mahāpavāraṇāya uposathadivase dhammakathāya janapadaṃ khobhetvā gato."
    ],
    "innerText": "Yo pana sāketatissatthero viya bahussutabhāvaṃ jānāpetuṃ na icchati, ayaṃ pariyattiappiccho nāma. Thero kira ‘‘khaṇo natthīti uddesaparipucchāsu okāsaṃ akaronto kadā maraṇakkhaṇaṃ, bhante, labhissathā’’ti codito gaṇaṃ vissajjetvā kaṇikāravālikasamuddavihāraṃ gato. Tattha antovassaṃ theranavamajjhimānaṃ upakāro hutvā mahāpavāraṇāya uposathadivase dhammakathāya janapadaṃ khobhetvā gato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yo pana sotāpannādīsu aññataro hutvā sotāpannādibhāvaṃ jānāpetuṃ na icchati, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "adhigamappiccho"
      },
      " nāma tayo kulaputtā (ma. ni. 1.325) viya ghaṭīkārakumbhakāro (ma. ni. 2.282 ādayo) viya ca. Imasmiṃ panatthe laddhāsevanena balavaalobhena samannāgato sekkhopi puthujjanopi appicchoti veditabbo."
    ],
    "innerText": "Yo pana sotāpannādīsu aññataro hutvā sotāpannādibhāvaṃ jānāpetuṃ na icchati, ayaṃ adhigamappiccho nāma tayo kulaputtā (ma. ni. 1.325) viya ghaṭīkārakumbhakāro (ma. ni. 2.282 ādayo) viya ca. Imasmiṃ panatthe laddhāsevanena balavaalobhena samannāgato sekkhopi puthujjanopi appicchoti veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "64"
      },
      ". Catutthe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asantuṭṭhitā"
      },
      "ti asantuṭṭhe puggale sevantassa bhajantassa payirupāsantassa uppanno asantosasaṅkhāto lobho."
    ],
    "innerText": "64. Catutthe asantuṭṭhitāti asantuṭṭhe puggale sevantassa bhajantassa payirupāsantassa uppanno asantosasaṅkhāto lobho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "65"
      },
      ". Pañcame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "santuṭṭhitā"
      },
      "ti santuṭṭhe puggale sevantassa bhajantassa payirupāsantassa uppanno ",
      " alobhasaṅkhāto santoso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Santuṭṭhassā"
      },
      "ti itarītarapaccayasantosena samannāgatassa. So panesa santoso ",
      " dvādasavidho hoti. Seyyathidaṃ – cīvare yathālābhasantoso, yathābalasantoso, yathāsāruppasantosoti tividho. Evaṃ piṇḍapātādīsu."
    ],
    "innerText": "65. Pañcame santuṭṭhitāti santuṭṭhe puggale sevantassa bhajantassa payirupāsantassa uppanno alobhasaṅkhāto santoso. Santuṭṭhassāti itarītarapaccayasantosena samannāgatassa. So panesa santoso dvādasavidho hoti. Seyyathidaṃ – cīvare yathālābhasantoso, yathābalasantoso, yathāsāruppasantosoti tividho. Evaṃ piṇḍapātādīsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tassāyaṃ pabhedasaṃvaṇṇanā – idha bhikkhu cīvaraṃ labhati sundaraṃ vā asundaraṃ vā. So teneva yāpeti aññaṃ na pattheti, labhantopi na gaṇhāti. Ayamassa cīvare ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yathālābhasantoso"
      },
      ". Atha pana pakatidubbalo vā hoti ābādhajarābhibhūto vā, garuṃ cīvaraṃ pārupanto kilamati. So sabhāgena bhikkhunā saddhiṃ taṃ parivattetvā lahukena yāpentopi santuṭṭhova hoti. Ayamassa cīvare ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yathābalasantoso"
      },
      ". Aparo paṇītapaccayalābhī hoti. So paṭṭacīvarādīnaṃ aññataraṃ mahagghacīvaraṃ bahūni vā pana cīvarāni labhitvā ‘‘idaṃ therānaṃ cirapabbajitānaṃ, idaṃ bahussutānaṃ anurūpaṃ, idaṃ gilānānaṃ, idaṃ appalābhānaṃ hotū’’ti datvā tesaṃ purāṇacīvaraṃ vā saṅkārakūṭādito vā nantakāni uccinitvā tehi saṅghāṭiṃ katvā dhārentopi santuṭṭhova hoti. Ayamassa cīvare ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yathāsāruppasantoso"
      },
      "."
    ],
    "innerText": "Tassāyaṃ pabhedasaṃvaṇṇanā – idha bhikkhu cīvaraṃ labhati sundaraṃ vā asundaraṃ vā. So teneva yāpeti aññaṃ na pattheti, labhantopi na gaṇhāti. Ayamassa cīvare yathālābhasantoso. Atha pana pakatidubbalo vā hoti ābādhajarābhibhūto vā, garuṃ cīvaraṃ pārupanto kilamati. So sabhāgena bhikkhunā saddhiṃ taṃ parivattetvā lahukena yāpentopi santuṭṭhova hoti. Ayamassa cīvare yathābalasantoso. Aparo paṇītapaccayalābhī hoti. So paṭṭacīvarādīnaṃ aññataraṃ mahagghacīvaraṃ bahūni vā pana cīvarāni labhitvā ‘‘idaṃ therānaṃ cirapabbajitānaṃ, idaṃ bahussutānaṃ anurūpaṃ, idaṃ gilānānaṃ, idaṃ appalābhānaṃ hotū’’ti datvā tesaṃ purāṇacīvaraṃ vā saṅkārakūṭādito vā nantakāni uccinitvā tehi saṅghāṭiṃ katvā dhārentopi santuṭṭhova hoti. Ayamassa cīvare yathāsāruppasantoso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana bhikkhu piṇḍapātaṃ labhati lūkhaṃ vā paṇītaṃ vā, so teneva yāpeti, aññaṃ na pattheti, labhantopi na gaṇhāti. Ayamassa piṇḍapāte ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yathālābhasantoso"
      },
      ". Yo pana attano pakativiruddhaṃ vā byādhiviruddhaṃ vā piṇḍapātaṃ labhati, yenassa paribhuttena aphāsu hoti, so sabhāgassa bhikkhuno taṃ datvā tassa hatthato sappāyabhojanaṃ bhuñjitvā samaṇadhammaṃ karontopi santuṭṭhova hoti. Ayamassa piṇḍapāte ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yathābalasantoso"
      },
      ". Aparo bahuṃ paṇītaṃ piṇḍapātaṃ labhati. So taṃ cīvaraṃ viya theracirapabbajitabahussutaappalābhagilānānaṃ ",
      " datvā tesaṃ vā sesakaṃ piṇḍāya vā caritvā missakāhāraṃ bhuñjantopi santuṭṭhova hoti. Ayamassa piṇḍapāte ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yathāsāruppasantoso"
      },
      "."
    ],
    "innerText": "Idha pana bhikkhu piṇḍapātaṃ labhati lūkhaṃ vā paṇītaṃ vā, so teneva yāpeti, aññaṃ na pattheti, labhantopi na gaṇhāti. Ayamassa piṇḍapāte yathālābhasantoso. Yo pana attano pakativiruddhaṃ vā byādhiviruddhaṃ vā piṇḍapātaṃ labhati, yenassa paribhuttena aphāsu hoti, so sabhāgassa bhikkhuno taṃ datvā tassa hatthato sappāyabhojanaṃ bhuñjitvā samaṇadhammaṃ karontopi santuṭṭhova hoti. Ayamassa piṇḍapāte yathābalasantoso. Aparo bahuṃ paṇītaṃ piṇḍapātaṃ labhati. So taṃ cīvaraṃ viya theracirapabbajitabahussutaappalābhagilānānaṃ datvā tesaṃ vā sesakaṃ piṇḍāya vā caritvā missakāhāraṃ bhuñjantopi santuṭṭhova hoti. Ayamassa piṇḍapāte yathāsāruppasantoso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana bhikkhu senāsanaṃ labhati manāpaṃ vā amanāpaṃ vā, so tena neva somanassaṃ na domanassaṃ uppādeti, antamaso tiṇasanthārakenāpi yathāladdheneva ",
      " tussati. Ayamassa senāsane ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yathālābhasantoso"
      },
      ". Yo pana attano pakativiruddhaṃ vā byādhiviruddhaṃ vā senāsanaṃ labhati, yatthassa vasato aphāsu hoti, so taṃ sabhāgassa bhikkhuno datvā tassa santake sappāyasenāsane vasantopi santuṭṭhova hoti. Ayamassa senāsane ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yathābalasantoso"
      },
      "."
    ],
    "innerText": "Idha pana bhikkhu senāsanaṃ labhati manāpaṃ vā amanāpaṃ vā, so tena neva somanassaṃ na domanassaṃ uppādeti, antamaso tiṇasanthārakenāpi yathāladdheneva tussati. Ayamassa senāsane yathālābhasantoso. Yo pana attano pakativiruddhaṃ vā byādhiviruddhaṃ vā senāsanaṃ labhati, yatthassa vasato aphāsu hoti, so taṃ sabhāgassa bhikkhuno datvā tassa santake sappāyasenāsane vasantopi santuṭṭhova hoti. Ayamassa senāsane yathābalasantoso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aparo ",
      " mahāpuñño leṇamaṇḍapakūṭāgārādīni bahūni paṇītasenāsanāni labhati. So tāni cīvarādīni viya theracirapabbajitabahussutaappalābhagilānānaṃ datvā yattha katthaci vasantopi santuṭṭhova hoti. Ayamassa senāsane ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yathāsāruppasantoso"
      },
      ". Yopi ‘‘uttamasenāsanaṃ nāma pamādaṭṭhānaṃ, tattha nisinnassa thinamiddhaṃ okkamati, niddābhibhūtassa puna paṭibujjhato pāpavitakkā pātubhavantī’’ti paṭisañcikkhitvā tādisaṃ senāsanaṃ pattampi na sampaṭicchati, so taṃ paṭikkhipitvā abbhokāsarukkhamūlādīsu vasantopi santuṭṭhova hoti. Ayampissa senāsane ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yathāsāruppasantoso"
      },
      "."
    ],
    "innerText": "Aparo mahāpuñño leṇamaṇḍapakūṭāgārādīni bahūni paṇītasenāsanāni labhati. So tāni cīvarādīni viya theracirapabbajitabahussutaappalābhagilānānaṃ datvā yattha katthaci vasantopi santuṭṭhova hoti. Ayamassa senāsane yathāsāruppasantoso. Yopi ‘‘uttamasenāsanaṃ nāma pamādaṭṭhānaṃ, tattha nisinnassa thinamiddhaṃ okkamati, niddābhibhūtassa puna paṭibujjhato pāpavitakkā pātubhavantī’’ti paṭisañcikkhitvā tādisaṃ senāsanaṃ pattampi na sampaṭicchati, so taṃ paṭikkhipitvā abbhokāsarukkhamūlādīsu vasantopi santuṭṭhova hoti. Ayampissa senāsane yathāsāruppasantoso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana bhikkhu bhesajjaṃ labhati lūkhaṃ vā paṇītaṃ vā, so yaṃ labhati, teneva tussati, aññaṃ na pattheti, labhantopi na gaṇhāti. Ayamassa gilānapaccaye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yathālābhasantoso"
      },
      ". Yo pana telena atthiko phāṇitaṃ labhati, so taṃ sabhāgassa bhikkhuno datvā tassa hatthato telaṃ gahetvā aññadeva vā pariyesitvā bhesajjaṃ karontopi santuṭṭhova hoti. Ayamassa gilānapaccaye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yathābalasantoso"
      },
      "."
    ],
    "innerText": "Idha pana bhikkhu bhesajjaṃ labhati lūkhaṃ vā paṇītaṃ vā, so yaṃ labhati, teneva tussati, aññaṃ na pattheti, labhantopi na gaṇhāti. Ayamassa gilānapaccaye yathālābhasantoso. Yo pana telena atthiko phāṇitaṃ labhati, so taṃ sabhāgassa bhikkhuno datvā tassa hatthato telaṃ gahetvā aññadeva vā pariyesitvā bhesajjaṃ karontopi santuṭṭhova hoti. Ayamassa gilānapaccaye yathābalasantoso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aparo mahāpuñño bahuṃ telamadhuphāṇitādipaṇītabhesajjaṃ labhati. So taṃ cīvaraṃ viya theracirapabbajitabahussutaappalābhagilānānaṃ datvā tesaṃ ābhatena yena kenaci ",
      " yāpentopi santuṭṭhova hoti. Yo pana ekasmiṃ bhājane muttaharītakaṃ ṭhapetvā ekasmiṃ catumadhuraṃ – ‘‘gaṇhatha, bhante, yadicchaka’’nti vuccamāno ‘‘sacassa tesu aññatarenapi rogo vūpasammati, atha muttaharītakaṃ nāma buddhādīhi vaṇṇita’’nti catumadhuraṃ paṭikkhipitvā muttaharītakena bhesajjaṃ karontopi paramasantuṭṭhova hoti. Ayamassa gilānapaccaye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yathāsāruppasantoso"
      },
      ". Imesaṃ pana paccekapaccayesu tiṇṇaṃ tiṇṇaṃ santosānaṃ yathāsāruppasantosova aggo."
    ],
    "innerText": "Aparo mahāpuñño bahuṃ telamadhuphāṇitādipaṇītabhesajjaṃ labhati. So taṃ cīvaraṃ viya theracirapabbajitabahussutaappalābhagilānānaṃ datvā tesaṃ ābhatena yena kenaci yāpentopi santuṭṭhova hoti. Yo pana ekasmiṃ bhājane muttaharītakaṃ ṭhapetvā ekasmiṃ catumadhuraṃ – ‘‘gaṇhatha, bhante, yadicchaka’’nti vuccamāno ‘‘sacassa tesu aññatarenapi rogo vūpasammati, atha muttaharītakaṃ nāma buddhādīhi vaṇṇita’’nti catumadhuraṃ paṭikkhipitvā muttaharītakena bhesajjaṃ karontopi paramasantuṭṭhova hoti. Ayamassa gilānapaccaye yathāsāruppasantoso. Imesaṃ pana paccekapaccayesu tiṇṇaṃ tiṇṇaṃ santosānaṃ yathāsāruppasantosova aggo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "66-67"
      },
      ". Chaṭṭhasattamesu ",
      " ayonisomanasikārayonisomanasikārā heṭṭhā vuttalakkhaṇāva. Sesamettha uttānatthamevāti."
    ],
    "innerText": "66-67. Chaṭṭhasattamesu ayonisomanasikārayonisomanasikārā heṭṭhā vuttalakkhaṇāva. Sesamettha uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "68"
      },
      ". Aṭṭhame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asampajañña"
      },
      "nti asampajānabhāvo, mohassetaṃ adhivacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asampajānassā"
      },
      "ti ajānantassa sammuḷhassa."
    ],
    "innerText": "68. Aṭṭhame asampajaññanti asampajānabhāvo, mohassetaṃ adhivacanaṃ. Asampajānassāti ajānantassa sammuḷhassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "69"
      },
      ". Navame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sampajañña"
      },
      "nti sampajānabhāvo, paññāyetaṃ nāmaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sampajānassā"
      },
      "ti sampajānantassa."
    ],
    "innerText": "69. Navame sampajaññanti sampajānabhāvo, paññāyetaṃ nāmaṃ. Sampajānassāti sampajānantassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "70"
      },
      ". Dasame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pāpamittatā"
      },
      "ti yassa pāpā lāmakā mittā, so pāpamitto. Pāpamittassa bhāvo pāpamittatā, tenākārena pavattānaṃ catunnaṃ khandhānamevetaṃ nāmaṃ. Vuttampi cetaṃ –"
    ],
    "innerText": "70. Dasame pāpamittatāti yassa pāpā lāmakā mittā, so pāpamitto. Pāpamittassa bhāvo pāpamittatā, tenākārena pavattānaṃ catunnaṃ khandhānamevetaṃ nāmaṃ. Vuttampi cetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Tattha katamā pāpamittatā? Ye te puggalā assaddhā dussīlā appassutā maccharino duppaññā. Yā tesaṃ sevanā ",
      " nisevanā saṃsevanā bhajanā sambhajanā bhatti sambhatti sampavaṅkatā. Ayaṃ vuccati pāpamittatā’’ti (vibha. 901)."
    ],
    "innerText": "‘‘Tattha katamā pāpamittatā? Ye te puggalā assaddhā dussīlā appassutā maccharino duppaññā. Yā tesaṃ sevanā nisevanā saṃsevanā bhajanā sambhajanā bhatti sambhatti sampavaṅkatā. Ayaṃ vuccati pāpamittatā’’ti (vibha. 901)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vīriyārambhādivaggavaṇṇanā."
  }
]