[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "(10) 5. Asuravaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Asurasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "91"
      },
      ". ‘‘Cattārome ",
      ", bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Asuro asuraparivāro, asuro devaparivāro, devo asuraparivāro, devo devaparivāro."
    ],
    "innerText": "91. ‘‘Cattārome , bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Asuro asuraparivāro, asuro devaparivāro, devo asuraparivāro, devo devaparivāro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca ",
      ", bhikkhave, puggalo asuro hoti asuraparivāro? Idha, bhikkhave, ekacco puggalo dussīlo hoti pāpadhammo, parisāpissa hoti dussīlā pāpadhammā. Evaṃ kho, bhikkhave, puggalo asuro hoti asuraparivāro."
    ],
    "innerText": "‘‘Kathañca , bhikkhave, puggalo asuro hoti asuraparivāro? Idha, bhikkhave, ekacco puggalo dussīlo hoti pāpadhammo, parisāpissa hoti dussīlā pāpadhammā. Evaṃ kho, bhikkhave, puggalo asuro hoti asuraparivāro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, puggalo asuro hoti ",
      " devaparivāro? Idha, bhikkhave, ekacco puggalo dussīlo hoti pāpadhammo, parisā ca khvassa hoti sīlavatī kalyāṇadhammā. Evaṃ kho, bhikkhave, puggalo asuro hoti devaparivāro."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, puggalo asuro hoti devaparivāro? Idha, bhikkhave, ekacco puggalo dussīlo hoti pāpadhammo, parisā ca khvassa hoti sīlavatī kalyāṇadhammā. Evaṃ kho, bhikkhave, puggalo asuro hoti devaparivāro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, puggalo devo hoti asuraparivāro? Idha ",
      ", bhikkhave, ekacco puggalo sīlavā hoti kalyāṇadhammo, parisā ca khvassa hoti dussīlā pāpadhammā. Evaṃ kho, bhikkhave, puggalo devo hoti asuraparivāro."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, puggalo devo hoti asuraparivāro? Idha , bhikkhave, ekacco puggalo sīlavā hoti kalyāṇadhammo, parisā ca khvassa hoti dussīlā pāpadhammā. Evaṃ kho, bhikkhave, puggalo devo hoti asuraparivāro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, puggalo devo hoti devaparivāro? Idha, bhikkhave, ekacco puggalo sīlavā hoti kalyāṇadhammo, parisāpissa hoti sīlavatī kalyāṇadhammā. Evaṃ kho, bhikkhave, puggalo devo hoti, devaparivāro. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Paṭhamasamādhisuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "92"
      },
      ". ‘‘Cattārome ",
      ", bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Idha, bhikkhave, ekacco puggalo lābhī hoti ajjhattaṃ cetosamathassa, na lābhī adhipaññādhammavipassanāya. Idha pana, bhikkhave, ekacco puggalo lābhī hoti adhipaññādhammavipassanāya, na lābhī ajjhattaṃ cetosamathassa. Idha pana, bhikkhave, ekacco puggalo na ceva lābhī hoti ajjhattaṃ cetosamathassa na ca lābhī adhipaññādhammavipassanāya. Idha pana, bhikkhave, ekacco puggalo lābhī ceva hoti ajjhattaṃ cetosamathassa lābhī ca adhipaññādhammavipassanāya. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Dutiyaṃ."
    ],
    "innerText": "92. ‘‘Cattārome , bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Idha, bhikkhave, ekacco puggalo lābhī hoti ajjhattaṃ cetosamathassa, na lābhī adhipaññādhammavipassanāya. Idha pana, bhikkhave, ekacco puggalo lābhī hoti adhipaññādhammavipassanāya, na lābhī ajjhattaṃ cetosamathassa. Idha pana, bhikkhave, ekacco puggalo na ceva lābhī hoti ajjhattaṃ cetosamathassa na ca lābhī adhipaññādhammavipassanāya. Idha pana, bhikkhave, ekacco puggalo lābhī ceva hoti ajjhattaṃ cetosamathassa lābhī ca adhipaññādhammavipassanāya. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Dutiyasamādhisuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "93"
      },
      ". ‘‘Cattārome ",
      ", bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Idha, bhikkhave, ekacco puggalo lābhī hoti ajjhattaṃ cetosamathassa, na lābhī adhipaññādhammavipassanāya. Idha pana, bhikkhave, ekacco puggalo lābhī hoti adhipaññādhammavipassanāya, na lābhī ajjhattaṃ cetosamathassa. Idha pana, bhikkhave, ekacco puggalo na ceva lābhī hoti ajjhattaṃ cetosamathassa na ca lābhī adhipaññādhammavipassanāya. Idha pana, bhikkhave, ekacco puggalo lābhī ceva hoti ajjhattaṃ cetosamathassa lābhī ca adhipaññādhammavipassanāya."
    ],
    "innerText": "93. ‘‘Cattārome , bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Idha, bhikkhave, ekacco puggalo lābhī hoti ajjhattaṃ cetosamathassa, na lābhī adhipaññādhammavipassanāya. Idha pana, bhikkhave, ekacco puggalo lābhī hoti adhipaññādhammavipassanāya, na lābhī ajjhattaṃ cetosamathassa. Idha pana, bhikkhave, ekacco puggalo na ceva lābhī hoti ajjhattaṃ cetosamathassa na ca lābhī adhipaññādhammavipassanāya. Idha pana, bhikkhave, ekacco puggalo lābhī ceva hoti ajjhattaṃ cetosamathassa lābhī ca adhipaññādhammavipassanāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tatra, bhikkhave, yvāyaṃ puggalo lābhī hoti ajjhattaṃ cetosamathassa ",
      " na lābhī adhipaññādhammavipassanāya, tena, bhikkhave, puggalena ajjhattaṃ cetosamathe patiṭṭhāya adhipaññādhammavipassanāya yogo karaṇīyo. So aparena samayena lābhī ceva hoti ajjhattaṃ cetosamathassa lābhī ca adhipaññādhammavipassanāya."
    ],
    "innerText": "‘‘Tatra, bhikkhave, yvāyaṃ puggalo lābhī hoti ajjhattaṃ cetosamathassa na lābhī adhipaññādhammavipassanāya, tena, bhikkhave, puggalena ajjhattaṃ cetosamathe patiṭṭhāya adhipaññādhammavipassanāya yogo karaṇīyo. So aparena samayena lābhī ceva hoti ajjhattaṃ cetosamathassa lābhī ca adhipaññādhammavipassanāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tatra, bhikkhave, yvāyaṃ puggalo lābhī adhipaññādhammavipassanāya na lābhī ajjhattaṃ cetosamathassa, tena, bhikkhave, puggalena adhipaññādhammavipassanāya patiṭṭhāya ajjhattaṃ cetosamathe yogo ",
      " karaṇīyo. So aparena samayena lābhī ceva hoti adhipaññādhammavipassanāya lābhī ca ajjhattaṃ cetosamathassa."
    ],
    "innerText": "‘‘Tatra, bhikkhave, yvāyaṃ puggalo lābhī adhipaññādhammavipassanāya na lābhī ajjhattaṃ cetosamathassa, tena, bhikkhave, puggalena adhipaññādhammavipassanāya patiṭṭhāya ajjhattaṃ cetosamathe yogo karaṇīyo. So aparena samayena lābhī ceva hoti adhipaññādhammavipassanāya lābhī ca ajjhattaṃ cetosamathassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tatra, bhikkhave, yvāyaṃ puggalo na ceva lābhī ajjhattaṃ cetosamathassa na ca lābhī adhipaññādhammavipassanāya, tena, bhikkhave, puggalena tesaṃyeva kusalānaṃ dhammānaṃ paṭilābhāya adhimatto chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca karaṇīyaṃ. Seyyathāpi, bhikkhave, ādittacelo vā ādittasīso vā tasseva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[tassa tasseva (sī. syā. kaṃ.)]"
      },
      " celassa vā sīsassa vā nibbāpanāya adhimattaṃ chandañca vāyāmañca ussāhañca ussoḷhiñca appaṭivāniñca satiñca sampajaññañca kareyya; evamevaṃ kho, bhikkhave, tena puggalena tesaṃyeva kusalānaṃ dhammānaṃ paṭilābhāya adhimatto chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca ",
      " sati ",
      " ca sampajaññañca karaṇīyaṃ. So aparena samayena lābhī ceva hoti ajjhattaṃ cetosamathassa lābhī ca adhipaññādhammavipassanāya."
    ],
    "innerText": "‘‘Tatra, bhikkhave, yvāyaṃ puggalo na ceva lābhī ajjhattaṃ cetosamathassa na ca lābhī adhipaññādhammavipassanāya, tena, bhikkhave, puggalena tesaṃyeva kusalānaṃ dhammānaṃ paṭilābhāya adhimatto chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca karaṇīyaṃ. Seyyathāpi, bhikkhave, ādittacelo vā ādittasīso vā tasseva [tassa tasseva (sī. syā. kaṃ.)] celassa vā sīsassa vā nibbāpanāya adhimattaṃ chandañca vāyāmañca ussāhañca ussoḷhiñca appaṭivāniñca satiñca sampajaññañca kareyya; evamevaṃ kho, bhikkhave, tena puggalena tesaṃyeva kusalānaṃ dhammānaṃ paṭilābhāya adhimatto chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca karaṇīyaṃ. So aparena samayena lābhī ceva hoti ajjhattaṃ cetosamathassa lābhī ca adhipaññādhammavipassanāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tatra, bhikkhave, yvāyaṃ puggalo lābhī ceva hoti ajjhattaṃ cetosamathassa lābhī ca adhipaññādhammavipassanāya, tena, bhikkhave, puggalena tesuyeva kusalesu dhammesu patiṭṭhāya uttari ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[uttariṃ (sī. syā. kaṃ. pī.)]"
      },
      " āsavānaṃ khayāya yogo karaṇīyo. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Tatiyaṃ."
    ],
    "innerText": "‘‘Tatra, bhikkhave, yvāyaṃ puggalo lābhī ceva hoti ajjhattaṃ cetosamathassa lābhī ca adhipaññādhammavipassanāya, tena, bhikkhave, puggalena tesuyeva kusalesu dhammesu patiṭṭhāya uttari [uttariṃ (sī. syā. kaṃ. pī.)] āsavānaṃ khayāya yogo karaṇīyo. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Tatiyasamādhisuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "94"
      },
      ". ‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Idha, bhikkhave, ekacco puggalo lābhī hoti ajjhattaṃ cetosamathassa, na lābhī adhipaññādhammavipassanāya. Idha ",
      " pana, bhikkhave, ekacco puggalo lābhī hoti adhipaññādhammavipassanāya, na lābhī ajjhattaṃ cetosamathassa. Idha pana, bhikkhave, ekacco puggalo na ceva lābhī hoti ajjhattaṃ cetosamathassa na ca lābhī adhipaññādhammavipassanāya. Idha pana, bhikkhave, ekacco puggalo lābhī ceva hoti ajjhattaṃ cetosamathassa lābhī ca adhipaññādhammavipassanāya."
    ],
    "innerText": "94. ‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Idha, bhikkhave, ekacco puggalo lābhī hoti ajjhattaṃ cetosamathassa, na lābhī adhipaññādhammavipassanāya. Idha pana, bhikkhave, ekacco puggalo lābhī hoti adhipaññādhammavipassanāya, na lābhī ajjhattaṃ cetosamathassa. Idha pana, bhikkhave, ekacco puggalo na ceva lābhī hoti ajjhattaṃ cetosamathassa na ca lābhī adhipaññādhammavipassanāya. Idha pana, bhikkhave, ekacco puggalo lābhī ceva hoti ajjhattaṃ cetosamathassa lābhī ca adhipaññādhammavipassanāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tatra ",
      ", bhikkhave, yvāyaṃ puggalo lābhī ",
      " ajjhattaṃ cetosamathassa na lābhī adhipaññādhammavipassanāya, tena, bhikkhave, puggalena yvāyaṃ puggalo lābhī adhipaññādhammavipassanāya so upasaṅkamitvā evamassa vacanīyo – ‘kathaṃ nu kho, āvuso, saṅkhārā daṭṭhabbā? Kathaṃ saṅkhārā sammasitabbā? Kathaṃ saṅkhārā vipassitabbā’ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[passitabbā (ka.)]"
      },
      " ti? Tassa so yathādiṭṭhaṃ yathāviditaṃ byākaroti – ‘evaṃ kho, āvuso, saṅkhārā daṭṭhabbā, evaṃ saṅkhārā sammasitabbā, evaṃ saṅkhārā vipassitabbā’ti. So aparena samayena lābhī ceva hoti ajjhattaṃ cetosamathassa lābhī ca adhipaññādhammavipassanāya."
    ],
    "innerText": "‘‘Tatra , bhikkhave, yvāyaṃ puggalo lābhī ajjhattaṃ cetosamathassa na lābhī adhipaññādhammavipassanāya, tena, bhikkhave, puggalena yvāyaṃ puggalo lābhī adhipaññādhammavipassanāya so upasaṅkamitvā evamassa vacanīyo – ‘kathaṃ nu kho, āvuso, saṅkhārā daṭṭhabbā? Kathaṃ saṅkhārā sammasitabbā? Kathaṃ saṅkhārā vipassitabbā’ [passitabbā (ka.)] ti? Tassa so yathādiṭṭhaṃ yathāviditaṃ byākaroti – ‘evaṃ kho, āvuso, saṅkhārā daṭṭhabbā, evaṃ saṅkhārā sammasitabbā, evaṃ saṅkhārā vipassitabbā’ti. So aparena samayena lābhī ceva hoti ajjhattaṃ cetosamathassa lābhī ca adhipaññādhammavipassanāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tatra, bhikkhave, yvāyaṃ puggalo lābhī adhipaññādhammavipassanāya na lābhī ajjhattaṃ cetosamathassa, tena, bhikkhave, puggalena yvāyaṃ puggalo lābhī ajjhattaṃ cetosamathassa so upasaṅkamitvā evamassa vacanīyo – ‘kathaṃ nu kho, āvuso, cittaṃ saṇṭhapetabbaṃ? Kathaṃ cittaṃ sannisādetabbaṃ ",
      "? Kathaṃ cittaṃ ekodi kātabbaṃ? Kathaṃ cittaṃ samādahātabba’nti? Tassa so yathādiṭṭhaṃ yathāviditaṃ byākaroti – ‘evaṃ kho, āvuso, cittaṃ saṇṭhapetabbaṃ, evaṃ cittaṃ sannisādetabbaṃ, evaṃ cittaṃ ekodi kātabbaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ekodi kattabbaṃ (pī.)]"
      },
      ", evaṃ cittaṃ samādahātabba’nti. So aparena samaye lābhī ceva hoti adhipaññādhammavipassanāya lābhī ca ajjhattaṃ cetosamathassa."
    ],
    "innerText": "‘‘Tatra, bhikkhave, yvāyaṃ puggalo lābhī adhipaññādhammavipassanāya na lābhī ajjhattaṃ cetosamathassa, tena, bhikkhave, puggalena yvāyaṃ puggalo lābhī ajjhattaṃ cetosamathassa so upasaṅkamitvā evamassa vacanīyo – ‘kathaṃ nu kho, āvuso, cittaṃ saṇṭhapetabbaṃ? Kathaṃ cittaṃ sannisādetabbaṃ ? Kathaṃ cittaṃ ekodi kātabbaṃ? Kathaṃ cittaṃ samādahātabba’nti? Tassa so yathādiṭṭhaṃ yathāviditaṃ byākaroti – ‘evaṃ kho, āvuso, cittaṃ saṇṭhapetabbaṃ, evaṃ cittaṃ sannisādetabbaṃ, evaṃ cittaṃ ekodi kātabbaṃ [ekodi kattabbaṃ (pī.)], evaṃ cittaṃ samādahātabba’nti. So aparena samaye lābhī ceva hoti adhipaññādhammavipassanāya lābhī ca ajjhattaṃ cetosamathassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tatra, bhikkhave, yvāyaṃ puggalo na ceva lābhī ajjhattaṃ cetosamathassa na ca lābhī adhipaññādhammavipassanāya, tena, bhikkhave, puggalena yvāyaṃ puggalo lābhī ceva ajjhattaṃ cetosamathassa lābhī ",
      " ca adhipaññādhammavipassanāya so upasaṅkamitvā evamassa vacanīyo – ‘kathaṃ nu kho, āvuso, cittaṃ saṇṭhapetabbaṃ? Kathaṃ cittaṃ sannisādetabbaṃ? Kathaṃ cittaṃ ekodi kātabbaṃ? Kathaṃ cittaṃ samādahātabbaṃ? Kathaṃ saṅkhārā daṭṭhabbā? Kathaṃ saṅkhārā sammasitabbā? Kathaṃ saṅkhārā vipassitabbā’ti? Tassa so yathādiṭṭhaṃ yathāviditaṃ byākaroti – ‘evaṃ kho, āvuso, cittaṃ saṇṭhapetabbaṃ, evaṃ cittaṃ sannisādetabbaṃ, evaṃ cittaṃ ekodi kātabbaṃ, evaṃ cittaṃ samādahātabbaṃ, evaṃ saṅkhārā daṭṭhabbā, evaṃ saṅkhārā sammasitabbā, evaṃ saṅkhārā vipassitabbā’ti. So aparena samayena ",
      " lābhī ceva hoti ajjhattaṃ cetosamathassa lābhī ca adhipaññādhammavipassanāya."
    ],
    "innerText": "‘‘Tatra, bhikkhave, yvāyaṃ puggalo na ceva lābhī ajjhattaṃ cetosamathassa na ca lābhī adhipaññādhammavipassanāya, tena, bhikkhave, puggalena yvāyaṃ puggalo lābhī ceva ajjhattaṃ cetosamathassa lābhī ca adhipaññādhammavipassanāya so upasaṅkamitvā evamassa vacanīyo – ‘kathaṃ nu kho, āvuso, cittaṃ saṇṭhapetabbaṃ? Kathaṃ cittaṃ sannisādetabbaṃ? Kathaṃ cittaṃ ekodi kātabbaṃ? Kathaṃ cittaṃ samādahātabbaṃ? Kathaṃ saṅkhārā daṭṭhabbā? Kathaṃ saṅkhārā sammasitabbā? Kathaṃ saṅkhārā vipassitabbā’ti? Tassa so yathādiṭṭhaṃ yathāviditaṃ byākaroti – ‘evaṃ kho, āvuso, cittaṃ saṇṭhapetabbaṃ, evaṃ cittaṃ sannisādetabbaṃ, evaṃ cittaṃ ekodi kātabbaṃ, evaṃ cittaṃ samādahātabbaṃ, evaṃ saṅkhārā daṭṭhabbā, evaṃ saṅkhārā sammasitabbā, evaṃ saṅkhārā vipassitabbā’ti. So aparena samayena lābhī ceva hoti ajjhattaṃ cetosamathassa lābhī ca adhipaññādhammavipassanāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tatra, bhikkhave, yvāyaṃ puggalo lābhī ceva hoti ajjhattaṃ cetosamathassa lābhī adhipaññādhammavipassanāya ",
      ", tena, bhikkhave, puggalena tesu ceva kusalesu dhammesu patiṭṭhāya uttari āsavānaṃ khayāya yogo karaṇīyo. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Catutthaṃ."
    ],
    "innerText": "‘‘Tatra, bhikkhave, yvāyaṃ puggalo lābhī ceva hoti ajjhattaṃ cetosamathassa lābhī adhipaññādhammavipassanāya , tena, bhikkhave, puggalena tesu ceva kusalesu dhammesu patiṭṭhāya uttari āsavānaṃ khayāya yogo karaṇīyo. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Chavālātasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "95"
      },
      ". ‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Nevattahitāya paṭipanno no parahitāya, parahitāya paṭipanno no attahitāya, attahitāya paṭipanno no parahitāya, attahitāya ceva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[attahitāya ca (sī. syā. kaṃ. pī.)]"
      },
      " paṭipanno parahitāya ca."
    ],
    "innerText": "95. ‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Nevattahitāya paṭipanno no parahitāya, parahitāya paṭipanno no attahitāya, attahitāya paṭipanno no parahitāya, attahitāya ceva [attahitāya ca (sī. syā. kaṃ. pī.)] paṭipanno parahitāya ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi ",
      ", bhikkhave, chavālātaṃ ubhato padittaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ādittaṃ (ka.)]"
      },
      ", majjhe gūthagataṃ, neva gāme kaṭṭhatthaṃ pharati na araññe ( ) ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[(kaṭṭhatthaṃ pharati) katthaci]"
      },
      "; tathūpamāhaṃ ",
      ", bhikkhave, imaṃ puggalaṃ vadāmi yvāyaṃ puggalo nevattahitāya paṭipanno no parahitāya."
    ],
    "innerText": "‘‘Seyyathāpi , bhikkhave, chavālātaṃ ubhato padittaṃ [ādittaṃ (ka.)], majjhe gūthagataṃ, neva gāme kaṭṭhatthaṃ pharati na araññe ( ) [(kaṭṭhatthaṃ pharati) katthaci]; tathūpamāhaṃ , bhikkhave, imaṃ puggalaṃ vadāmi yvāyaṃ puggalo nevattahitāya paṭipanno no parahitāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tatra, bhikkhave, yvāyaṃ puggalo parahitāya paṭipanno no attahitāya, ayaṃ imesaṃ dvinnaṃ puggalānaṃ abhikkantataro ca paṇītataro ca. Tatra, bhikkhave, yvāyaṃ puggalo attahitāya paṭipanno no parahitāya, ayaṃ imesaṃ tiṇṇaṃ puggalānaṃ abhikkantataro ca paṇītataro ca. Tatra, bhikkhave, yvāyaṃ puggalo attahitāya ceva paṭipanno parahitāya ca, ayaṃ imesaṃ catunnaṃ puggalānaṃ aggo ca seṭṭho ca pāmokkho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mokkho (pī.) saṃ. ni. 3.662-663; a. ni. 5.181]"
      },
      " ca uttamo ca pavaro ca."
    ],
    "innerText": "‘‘Tatra, bhikkhave, yvāyaṃ puggalo parahitāya paṭipanno no attahitāya, ayaṃ imesaṃ dvinnaṃ puggalānaṃ abhikkantataro ca paṇītataro ca. Tatra, bhikkhave, yvāyaṃ puggalo attahitāya paṭipanno no parahitāya, ayaṃ imesaṃ tiṇṇaṃ puggalānaṃ abhikkantataro ca paṇītataro ca. Tatra, bhikkhave, yvāyaṃ puggalo attahitāya ceva paṭipanno parahitāya ca, ayaṃ imesaṃ catunnaṃ puggalānaṃ aggo ca seṭṭho ca pāmokkho [mokkho (pī.) saṃ. ni. 3.662-663; a. ni. 5.181] ca uttamo ca pavaro ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, bhikkhave, gavā khīraṃ, khīramhā dadhi, dadhimhā navanītaṃ, navanītamhā sappi, sappimhā sappimaṇḍo, sappimaṇḍo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sappimhā sappimaṇḍo (ka.)]"
      },
      " tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[tatra (saṃ. ni. 3.662-662)]"
      },
      " aggamakkhāyati; evamevaṃ kho, bhikkhave, yvāyaṃ puggalo attahitāya ceva paṭipanno parahitāya ca, ayaṃ imesaṃ catunnaṃ puggalānaṃ aggo ca seṭṭho ca pāmokkho ca uttamo ca pavaro ca. Ime ",
      " kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Pañcamaṃ."
    ],
    "innerText": "‘‘Seyyathāpi, bhikkhave, gavā khīraṃ, khīramhā dadhi, dadhimhā navanītaṃ, navanītamhā sappi, sappimhā sappimaṇḍo, sappimaṇḍo [sappimhā sappimaṇḍo (ka.)] tattha [tatra (saṃ. ni. 3.662-662)] aggamakkhāyati; evamevaṃ kho, bhikkhave, yvāyaṃ puggalo attahitāya ceva paṭipanno parahitāya ca, ayaṃ imesaṃ catunnaṃ puggalānaṃ aggo ca seṭṭho ca pāmokkho ca uttamo ca pavaro ca. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Rāgavinayasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "96"
      },
      ". ‘‘Cattārome ",
      ", bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Attahitāya paṭipanno no parahitāya, parahitāya paṭipanno no attahitāya, nevattahitāya paṭipanno no parahitāya, attahitāya ceva paṭipanno parahitāya ca."
    ],
    "innerText": "96. ‘‘Cattārome , bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Attahitāya paṭipanno no parahitāya, parahitāya paṭipanno no attahitāya, nevattahitāya paṭipanno no parahitāya, attahitāya ceva paṭipanno parahitāya ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, puggalo attahitāya paṭipanno hoti no parahitāya? Idha, bhikkhave, ekacco puggalo ",
      " attanā rāgavinayāya paṭipanno hoti, no paraṃ rāgavinayāya samādapeti; attanā dosavinayāya paṭipanno hoti, no paraṃ dosavinayāya samādapeti; attanā ",
      " mohavinayāya paṭipanno hoti, no paraṃ mohavinayāya samādapeti. Evaṃ kho, bhikkhave, puggalo attahitāya paṭipanno hoti, no parahitāya."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, puggalo attahitāya paṭipanno hoti no parahitāya? Idha, bhikkhave, ekacco puggalo attanā rāgavinayāya paṭipanno hoti, no paraṃ rāgavinayāya samādapeti; attanā dosavinayāya paṭipanno hoti, no paraṃ dosavinayāya samādapeti; attanā mohavinayāya paṭipanno hoti, no paraṃ mohavinayāya samādapeti. Evaṃ kho, bhikkhave, puggalo attahitāya paṭipanno hoti, no parahitāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, puggalo parahitāya paṭipanno hoti, no attahitāya? Idha, bhikkhave, ekacco puggalo attanā na rāgavinayāya paṭipanno hoti, paraṃ rāgavinayāya samādapeti; attanā na dosavinayāya paṭipanno hoti, paraṃ dosavinayāya samādapeti; attanā na mohavinayāya paṭipanno hoti, paraṃ mohavinayāya samādapeti. Evaṃ kho, bhikkhave, puggalo parahitāya paṭipanno hoti, no attahitāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, puggalo nevattahitāya paṭipanno hoti, no parahitāya? Idha, bhikkhave, ekacco puggalo attanā na rāgavinayāya paṭipanno hoti, no paraṃ rāgavinayāya samādapeti; attanā na dosavinayāya paṭipanno hoti, no paraṃ dosavinayāya samādapeti; attanā na mohavinayāya paṭipanno hoti, no paraṃ mohavinayāya samādapeti. Evaṃ kho, bhikkhave, puggalo nevattahitāya paṭipanno hoti, no parahitāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, puggalo attahitāya ceva paṭipanno hoti parahitāya ca? Idha, bhikkhave, ekacco puggalo attanā ca rāgavinayāya paṭipanno hoti, parañca rāgavinayāya samādapeti; attanā ca dosavinayāya paṭipanno hoti, parañca dosavinayāya samādapeti; attanā ca ",
      " mohavinayāya paṭipanno hoti, parañca mohavinayāya ",
      " samādapeti. Evaṃ kho, bhikkhave ",
      ", puggalo attahitāya ceva paṭipanno hoti parahitāya ca. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Chaṭṭhaṃ."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, puggalo attahitāya ceva paṭipanno hoti parahitāya ca? Idha, bhikkhave, ekacco puggalo attanā ca rāgavinayāya paṭipanno hoti, parañca rāgavinayāya samādapeti; attanā ca dosavinayāya paṭipanno hoti, parañca dosavinayāya samādapeti; attanā ca mohavinayāya paṭipanno hoti, parañca mohavinayāya samādapeti. Evaṃ kho, bhikkhave , puggalo attahitāya ceva paṭipanno hoti parahitāya ca. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Khippanisantisuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "97"
      },
      ". ‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Attahitāya paṭipanno no parahitāya, parahitāya paṭipanno no attahitāya, nevattahitāya paṭipanno no parahitāya, attahitāya ceva paṭipanno parahitāya ca."
    ],
    "innerText": "97. ‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Attahitāya paṭipanno no parahitāya, parahitāya paṭipanno no attahitāya, nevattahitāya paṭipanno no parahitāya, attahitāya ceva paṭipanno parahitāya ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca ",
      ", bhikkhave, puggalo attahitāya paṭipanno hoti, no parahitāya? Idha, bhikkhave, ekacco puggalo khippanisantī ca hoti kusalesu dhammesu, sutānañca dhammānaṃ dhārakajātiko ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[dhāraṇajātiko (ka.)]"
      },
      " hoti, dhātānañca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[dhatānañca (sī. syā. kaṃ. pī.)]"
      },
      " dhammānaṃ atthūpaparikkhī hoti atthamaññāya dhammamaññāya, dhammānudhammappaṭipanno hoti; no ca kalyāṇavāco hoti kalyāṇavākkaraṇo poriyā vācāya samannāgato vissaṭṭhāya anelagalāya atthassa viññāpaniyā, no ca sandassako hoti samādapako ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[samādāpako (?)]"
      },
      " samuttejako sampahaṃsako sabrahmacārīnaṃ. Evaṃ kho, bhikkhave, puggalo attahitāya paṭipanno hoti, no parahitāya."
    ],
    "innerText": "‘‘Kathañca , bhikkhave, puggalo attahitāya paṭipanno hoti, no parahitāya? Idha, bhikkhave, ekacco puggalo khippanisantī ca hoti kusalesu dhammesu, sutānañca dhammānaṃ dhārakajātiko [dhāraṇajātiko (ka.)] hoti, dhātānañca [dhatānañca (sī. syā. kaṃ. pī.)] dhammānaṃ atthūpaparikkhī hoti atthamaññāya dhammamaññāya, dhammānudhammappaṭipanno hoti; no ca kalyāṇavāco hoti kalyāṇavākkaraṇo poriyā vācāya samannāgato vissaṭṭhāya anelagalāya atthassa viññāpaniyā, no ca sandassako hoti samādapako [samādāpako (?)] samuttejako sampahaṃsako sabrahmacārīnaṃ. Evaṃ kho, bhikkhave, puggalo attahitāya paṭipanno hoti, no parahitāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, puggalo parahitāya paṭipanno hoti, no attahitāya? Idha, bhikkhave, ekacco puggalo na heva kho khippanisantī hoti kusalesu dhammesu, no ca sutānaṃ dhammānaṃ dhārakajātiko hoti, no ca dhātānaṃ dhammānaṃ atthūpaparikkhī hoti, no ca atthamaññāya dhammamaññāya dhammānudhammappaṭipanno ",
      " hoti; kalyāṇavāco ca hoti kalyāṇavākkaraṇo poriyā vācāya samannāgato vissaṭṭhāya anelagalāya atthassa viññāpaniyā, sandassako ca hoti samādapako samuttejako sampahaṃsako sabrahmacārīnaṃ. Evaṃ kho, bhikkhave, puggalo parahitāya paṭipanno hoti, no attahitāya."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, puggalo parahitāya paṭipanno hoti, no attahitāya? Idha, bhikkhave, ekacco puggalo na heva kho khippanisantī hoti kusalesu dhammesu, no ca sutānaṃ dhammānaṃ dhārakajātiko hoti, no ca dhātānaṃ dhammānaṃ atthūpaparikkhī hoti, no ca atthamaññāya dhammamaññāya dhammānudhammappaṭipanno hoti; kalyāṇavāco ca hoti kalyāṇavākkaraṇo poriyā vācāya samannāgato vissaṭṭhāya anelagalāya atthassa viññāpaniyā, sandassako ca hoti samādapako samuttejako sampahaṃsako sabrahmacārīnaṃ. Evaṃ kho, bhikkhave, puggalo parahitāya paṭipanno hoti, no attahitāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca ",
      ", bhikkhave, puggalo nevattahitāya paṭipanno hoti, no parahitāya? Idha, bhikkhave, ekacco puggalo na heva kho khippanisantī hoti kusalesu dhammesu, no ca sutānaṃ dhammānaṃ dhārakajātiko hoti, no ca dhātānaṃ dhammānaṃ atthūpaparikkhī hoti, no ca atthamaññāya ",
      " dhammamaññāya dhammānudhammappaṭipanno hoti; no ca kalyāṇavāco hoti kalyāṇavākkaraṇo poriyā vācāya samannāgato vissaṭṭhāya anelagalāya atthassa viññāpaniyā, no ca sandassako hoti samādapako samuttejako sampahaṃsako sabrahmacārīnaṃ. Evaṃ kho, bhikkhave, puggalo nevattahitāya paṭipanno hoti, no parahitāya."
    ],
    "innerText": "‘‘Kathañca , bhikkhave, puggalo nevattahitāya paṭipanno hoti, no parahitāya? Idha, bhikkhave, ekacco puggalo na heva kho khippanisantī hoti kusalesu dhammesu, no ca sutānaṃ dhammānaṃ dhārakajātiko hoti, no ca dhātānaṃ dhammānaṃ atthūpaparikkhī hoti, no ca atthamaññāya dhammamaññāya dhammānudhammappaṭipanno hoti; no ca kalyāṇavāco hoti kalyāṇavākkaraṇo poriyā vācāya samannāgato vissaṭṭhāya anelagalāya atthassa viññāpaniyā, no ca sandassako hoti samādapako samuttejako sampahaṃsako sabrahmacārīnaṃ. Evaṃ kho, bhikkhave, puggalo nevattahitāya paṭipanno hoti, no parahitāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca ",
      ", bhikkhave, puggalo attahitāya ceva paṭipanno hoti parahitāya ca? Idha, bhikkhave, ekacco puggalo khippanisantī ca hoti kusalesu dhammesu, sutānañca dhammānaṃ dhārakajātiko hoti, dhātānañca dhammānaṃ atthūpaparikkhī hoti atthamaññāya dhammamaññāya, dhammānudhammappaṭipanno hoti; kalyāṇavāco ca hoti kalyāṇavākkaraṇo poriyā vācāya samannāgato vissaṭṭhāya anelagalāya atthassa viññāpaniyā, sandassako ca hoti samādapako samuttejako sampahaṃsako sabrahmacārīnaṃ. Evaṃ kho, bhikkhave, puggalo attahitāya ceva paṭipanno hoti ",
      " parahitāya ca. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Sattamaṃ."
    ],
    "innerText": "‘‘Kathañca , bhikkhave, puggalo attahitāya ceva paṭipanno hoti parahitāya ca? Idha, bhikkhave, ekacco puggalo khippanisantī ca hoti kusalesu dhammesu, sutānañca dhammānaṃ dhārakajātiko hoti, dhātānañca dhammānaṃ atthūpaparikkhī hoti atthamaññāya dhammamaññāya, dhammānudhammappaṭipanno hoti; kalyāṇavāco ca hoti kalyāṇavākkaraṇo poriyā vācāya samannāgato vissaṭṭhāya anelagalāya atthassa viññāpaniyā, sandassako ca hoti samādapako samuttejako sampahaṃsako sabrahmacārīnaṃ. Evaṃ kho, bhikkhave, puggalo attahitāya ceva paṭipanno hoti parahitāya ca. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Attahitasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "98"
      },
      ". ‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Attahitāya paṭipanno no parahitāya, parahitāya paṭipanno no attahitāya, nevattahitāya paṭipanno no parahitāya, attahitāya ceva paṭipanno parahitāya ca. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Aṭṭhamaṃ."
    ],
    "innerText": "98. ‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Attahitāya paṭipanno no parahitāya, parahitāya paṭipanno no attahitāya, nevattahitāya paṭipanno no parahitāya, attahitāya ceva paṭipanno parahitāya ca. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Sikkhāpadasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "99"
      },
      ". ‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Attahitāya paṭipanno no ",
      " parahitāya, parahitāya paṭipanno no attahitāya, nevattahitāya paṭipanno no parahitāya, attahitāya ceva paṭipanno parahitāya ca."
    ],
    "innerText": "99. ‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Attahitāya paṭipanno no parahitāya, parahitāya paṭipanno no attahitāya, nevattahitāya paṭipanno no parahitāya, attahitāya ceva paṭipanno parahitāya ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, puggalo attahitāya paṭipanno hoti, no parahitāya? Idha, bhikkhave ",
      ", ekacco puggalo attanā pāṇātipātā paṭivirato hoti, no paraṃ pāṇātipātā veramaṇiyā samādapeti; attanā adinnādānā paṭivirato hoti, no paraṃ adinnādānā veramaṇiyā samādapeti; attanā kāmesumicchācārā paṭivirato hoti, no paraṃ kāmesumicchācārā veramaṇiyā samādapeti ",
      "; attanā musāvādā paṭivirato hoti, no paraṃ musāvādā veramaṇiyā samādapeti; attanā surāmerayamajjapamādaṭṭhānā paṭivirato hoti, no paraṃ surāmerayamajjapamādaṭṭhānā veramaṇiyā samādapeti. Evaṃ kho, bhikkhave ",
      ", puggalo attahitāya paṭipanno hoti, no parahitāya."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, puggalo attahitāya paṭipanno hoti, no parahitāya? Idha, bhikkhave , ekacco puggalo attanā pāṇātipātā paṭivirato hoti, no paraṃ pāṇātipātā veramaṇiyā samādapeti; attanā adinnādānā paṭivirato hoti, no paraṃ adinnādānā veramaṇiyā samādapeti; attanā kāmesumicchācārā paṭivirato hoti, no paraṃ kāmesumicchācārā veramaṇiyā samādapeti ; attanā musāvādā paṭivirato hoti, no paraṃ musāvādā veramaṇiyā samādapeti; attanā surāmerayamajjapamādaṭṭhānā paṭivirato hoti, no paraṃ surāmerayamajjapamādaṭṭhānā veramaṇiyā samādapeti. Evaṃ kho, bhikkhave , puggalo attahitāya paṭipanno hoti, no parahitāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, puggalo parahitāya paṭipanno hoti, no attahitāya? Idha, bhikkhave, ekacco puggalo attanā pāṇātipātā appaṭivirato hoti, paraṃ pāṇātipātā veramaṇiyā samādapeti; attanā adinnādānā appaṭivirato hoti, paraṃ adinnādānā veramaṇiyā samādapeti; attanā kāmesumicchācārā appaṭivirato hoti, paraṃ kāmesumicchācārā veramaṇiyā samādapeti; attanā musāvādā appaṭivirato hoti, paraṃ musāvādā veramaṇiyā samādapeti; attanā surāmerayamajjapamādaṭṭhānā appaṭivirato hoti, paraṃ surāmerayamajjapamādaṭṭhānā veramaṇiyā samādapeti. Evaṃ kho, bhikkhave, puggalo parahitāya paṭipanno hoti, no attahitāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, puggalo nevattahitāya paṭipanno hoti no parahitāya? Idha, bhikkhave, ekacco puggalo attanā pāṇātipātā appaṭivirato hoti, no paraṃ pāṇātipātā veramaṇiyā samādapeti…pe… attanā surāmerayamajjapamādaṭṭhānā appaṭivirato hoti, no paraṃ surāmerayamajjapamādaṭṭhānā veramaṇiyā samādapeti. Evaṃ kho, bhikkhave, puggalo nevattahitāya paṭipanno hoti, no parahitāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, puggalo attahitāya ceva paṭipanno hoti parahitāya ca? Idha, bhikkhave, ekacco puggalo attanā ca pāṇātipātā paṭivirato hoti, parañca pāṇātipātā veramaṇiyā samādapeti…pe… attanā ca surāmerayamajjapamādaṭṭhānā paṭivirato hoti, parañca surāmerayamajjapamādaṭṭhānā ",
      " veramaṇiyā samādapeti. Evaṃ kho, bhikkhave, puggalo attahitāya ceva paṭipanno hoti parahitāya ca. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Navamaṃ."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, puggalo attahitāya ceva paṭipanno hoti parahitāya ca? Idha, bhikkhave, ekacco puggalo attanā ca pāṇātipātā paṭivirato hoti, parañca pāṇātipātā veramaṇiyā samādapeti…pe… attanā ca surāmerayamajjapamādaṭṭhānā paṭivirato hoti, parañca surāmerayamajjapamādaṭṭhānā veramaṇiyā samādapeti. Evaṃ kho, bhikkhave, puggalo attahitāya ceva paṭipanno hoti parahitāya ca. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Potaliyasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "100"
      },
      ". Atha ",
      " kho potaliyo paribbājako yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho potaliyaṃ paribbājakaṃ bhagavā etadavoca –"
    ],
    "innerText": "100. Atha kho potaliyo paribbājako yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho potaliyaṃ paribbājakaṃ bhagavā etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Cattārome, potaliya, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Idha, potaliya, ekacco puggalo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pu. pa. 165]"
      },
      " avaṇṇārahassa avaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena, no ca kho vaṇṇārahassa vaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena. Idha pana, potaliya, ekacco puggalo vaṇṇārahassa vaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena, no ca kho avaṇṇārahassa avaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena. Idha pana, potaliya, ekacco puggalo neva avaṇṇārahassa avaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena, no ca vaṇṇārahassa vaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena. Idha pana, potaliya, ekacco puggalo avaṇṇārahassa ca avaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena, vaṇṇārahassa ca vaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena. Ime kho, potaliya, cattāro puggalā santo saṃvijjamānā lokasmiṃ. Imesaṃ kho, potaliya, catunnaṃ puggalānaṃ katamo te puggalo khamati abhikkantataro ca paṇītataro cā’’ti?"
    ],
    "innerText": "‘‘Cattārome, potaliya, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Idha, potaliya, ekacco puggalo [pu. pa. 165] avaṇṇārahassa avaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena, no ca kho vaṇṇārahassa vaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena. Idha pana, potaliya, ekacco puggalo vaṇṇārahassa vaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena, no ca kho avaṇṇārahassa avaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena. Idha pana, potaliya, ekacco puggalo neva avaṇṇārahassa avaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena, no ca vaṇṇārahassa vaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena. Idha pana, potaliya, ekacco puggalo avaṇṇārahassa ca avaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena, vaṇṇārahassa ca vaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena. Ime kho, potaliya, cattāro puggalā santo saṃvijjamānā lokasmiṃ. Imesaṃ kho, potaliya, catunnaṃ puggalānaṃ katamo te puggalo khamati abhikkantataro ca paṇītataro cā’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Cattārome, bho gotama, puggalā ",
      " santo saṃvijjamānā lokasmiṃ. Katame cattāro? Idha, bho gotama, ekacco puggalo avaṇṇārahassa avaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena, no ca kho vaṇṇārahassa vaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena. Idha pana, bho gotama, ekacco puggalo vaṇṇārahassa vaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena, no ca kho avaṇṇārahassa avaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena. Idha pana, bho gotama, ekacco puggalo neva avaṇṇārahassa avaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena, no ca vaṇṇārahassa vaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena. Idha ",
      " pana, bho gotama, ekacco puggalo avaṇṇārahassa ca avaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena, vaṇṇārahassa ca vaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena. Ime kho, bho gotama, cattāro puggalā santo ",
      " saṃvijjamānā lokasmiṃ. Imesaṃ, bho gotama, catunnaṃ puggalānaṃ yvāyaṃ puggalo neva avaṇṇārahassa avaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena, no ",
      " ca vaṇṇārahassa vaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena; ayaṃ me puggalo khamati imesaṃ catunnaṃ puggalānaṃ abhikkantataro ca paṇītataro ca. Taṃ kissa hetu? Abhikkantā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[abhikkantatarā (ka.)]"
      },
      " hesā, bho gotama, yadidaṃ upekkhā’’ti."
    ],
    "innerText": "‘‘Cattārome, bho gotama, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Idha, bho gotama, ekacco puggalo avaṇṇārahassa avaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena, no ca kho vaṇṇārahassa vaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena. Idha pana, bho gotama, ekacco puggalo vaṇṇārahassa vaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena, no ca kho avaṇṇārahassa avaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena. Idha pana, bho gotama, ekacco puggalo neva avaṇṇārahassa avaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena, no ca vaṇṇārahassa vaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena. Idha pana, bho gotama, ekacco puggalo avaṇṇārahassa ca avaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena, vaṇṇārahassa ca vaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena. Ime kho, bho gotama, cattāro puggalā santo saṃvijjamānā lokasmiṃ. Imesaṃ, bho gotama, catunnaṃ puggalānaṃ yvāyaṃ puggalo neva avaṇṇārahassa avaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena, no ca vaṇṇārahassa vaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena; ayaṃ me puggalo khamati imesaṃ catunnaṃ puggalānaṃ abhikkantataro ca paṇītataro ca. Taṃ kissa hetu? Abhikkantā [abhikkantatarā (ka.)] hesā, bho gotama, yadidaṃ upekkhā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Cattārome, potaliya, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro…pe… ime kho, potaliya, cattāro puggalā santo saṃvijjamānā lokasmiṃ. Imesaṃ kho, potaliya, catunnaṃ puggalānaṃ yvāyaṃ puggalo avaṇṇārahassa ca avaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena, vaṇṇārahassa ca vaṇṇaṃ bhāsitā hoti ",
      " bhūtaṃ tacchaṃ kālena; ayaṃ imesaṃ catunnaṃ puggalānaṃ abhikkantataro ca paṇītataro ca. Taṃ kissa hetu? Abhikkantā hesā, potaliya, yadidaṃ tattha tattha kālaññutā’’ti."
    ],
    "innerText": "‘‘Cattārome, potaliya, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro…pe… ime kho, potaliya, cattāro puggalā santo saṃvijjamānā lokasmiṃ. Imesaṃ kho, potaliya, catunnaṃ puggalānaṃ yvāyaṃ puggalo avaṇṇārahassa ca avaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena, vaṇṇārahassa ca vaṇṇaṃ bhāsitā hoti bhūtaṃ tacchaṃ kālena; ayaṃ imesaṃ catunnaṃ puggalānaṃ abhikkantataro ca paṇītataro ca. Taṃ kissa hetu? Abhikkantā hesā, potaliya, yadidaṃ tattha tattha kālaññutā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Cattārome, bho gotama, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro…pe… ime kho, bho gotama, cattāro puggalā santo saṃvijjamānā lokasmiṃ. Imesaṃ, bho gotama, catunnaṃ puggalānaṃ yvāyaṃ puggalo avaṇṇārahassa ca avaṇṇaṃ bhāsitā bhūtaṃ tacchaṃ kālena, vaṇṇārahassa ca vaṇṇaṃ bhāsitā bhūtaṃ tacchaṃ kālena; ayaṃ me puggalo khamati imesaṃ catunnaṃ puggalānaṃ abhikkantataro ca paṇītataro ca. Taṃ kissa hetu? Abhikkantā hesā, bho gotama, yadidaṃ tattha tattha ",
      " kālaññutā."
    ],
    "innerText": "‘‘Cattārome, bho gotama, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro…pe… ime kho, bho gotama, cattāro puggalā santo saṃvijjamānā lokasmiṃ. Imesaṃ, bho gotama, catunnaṃ puggalānaṃ yvāyaṃ puggalo avaṇṇārahassa ca avaṇṇaṃ bhāsitā bhūtaṃ tacchaṃ kālena, vaṇṇārahassa ca vaṇṇaṃ bhāsitā bhūtaṃ tacchaṃ kālena; ayaṃ me puggalo khamati imesaṃ catunnaṃ puggalānaṃ abhikkantataro ca paṇītataro ca. Taṃ kissa hetu? Abhikkantā hesā, bho gotama, yadidaṃ tattha tattha kālaññutā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Abhikkantaṃ, bho gotama, abhikkantaṃ, bho gotama! Seyyathāpi, bho gotama, nikkujjitaṃ vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya – cakkhumanto rūpāni dakkhantīti, evamevaṃ bhotā gotamena anekapariyāyena dhammo pakāsito ",
      ". Esāhaṃ bhavantaṃ gotamaṃ saraṇaṃ gacchāmi dhammañca bhikkhusaṅghañca. Upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Dasamaṃ."
    ],
    "innerText": "‘‘Abhikkantaṃ, bho gotama, abhikkantaṃ, bho gotama! Seyyathāpi, bho gotama, nikkujjitaṃ vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya – cakkhumanto rūpāni dakkhantīti, evamevaṃ bhotā gotamena anekapariyāyena dhammo pakāsito . Esāhaṃ bhavantaṃ gotamaṃ saraṇaṃ gacchāmi dhammañca bhikkhusaṅghañca. Upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Asuravaggo pañcamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Asuro tayo samādhī, chavālātena pañcamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Rāgo nisanti attahitaṃ, sikkhā potaliyena cāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dutiyapaṇṇāsakaṃ samattaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "3. Tatiyapaṇṇāsakaṃ"
  }
]