[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "2. Anussativaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1-2. Mahānāmasuttadvayavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "11-12"
      },
      ". Dutiyassa paṭhame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nānāvihārehi viharata"
      },
      "nti gihīnaṃ nibaddho eko vihāro nāma natthi, tasmā amhākaṃ anibaddhavihārena viharantānaṃ kena vihārena katarena nibaddhavihārena vihātabbanti pucchati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ārādhako"
      },
      "ti sampādako paripūrako. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammasotasamāpanno buddhānussatiṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhāvetī"
      },
      "ti dhammasotasamāpanno hutvā buddhānussatiṃ bhāveti. Dutiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gilānā vuṭṭhito"
      },
      "ti gilāno hutvā vuṭṭhito."
    ],
    "innerText": "11-12. Dutiyassa paṭhame nānāvihārehi viharatanti gihīnaṃ nibaddho eko vihāro nāma natthi, tasmā amhākaṃ anibaddhavihārena viharantānaṃ kena vihārena katarena nibaddhavihārena vihātabbanti pucchati. Ārādhakoti sampādako paripūrako. Dhammasotasamāpanno buddhānussatiṃbhāvetīti dhammasotasamāpanno hutvā buddhānussatiṃ bhāveti. Dutiye gilānā vuṭṭhitoti gilāno hutvā vuṭṭhito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Nandiyasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "13"
      },
      ". Tatiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kalyāṇamitte"
      },
      "ti sumitte. Evamettha kalyāṇamittavasena saṅghānussati kathitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kabaḷīkārāhārabhakkhāna"
      },
      "nti kāmāvacaradevānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asamayavimutto"
      },
      "ti ",
      " asamayavimuttiyā vimutto khīṇāsavo."
    ],
    "innerText": "13. Tatiye kalyāṇamitteti sumitte. Evamettha kalyāṇamittavasena saṅghānussati kathitā. Kabaḷīkārāhārabhakkhānanti kāmāvacaradevānaṃ. Asamayavimuttoti asamayavimuttiyā vimutto khīṇāsavo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Subhūtisuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "14"
      },
      ". Catutthe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ko nāmāyaṃ subhūtī bhikkhū"
      },
      "ti jānantopi satthā kathāsamuṭṭhāpanatthaṃ pucchati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sudattassa upāsakassa putto"
      },
      "ti anāthapiṇḍikaṃ sandhāyāha. Anāthapiṇḍikassa hi putto attano cūḷapitu santike pabbajito, atha naṃ subhūtitthero ādāya satthu santikaṃ agamāsi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddhāpadānesū"
      },
      "ti saddhānaṃ puggalānaṃ apadānesu lakkhaṇesu."
    ],
    "innerText": "14. Catutthe ko nāmāyaṃ subhūtī bhikkhūti jānantopi satthā kathāsamuṭṭhāpanatthaṃ pucchati. Sudattassa upāsakassa puttoti anāthapiṇḍikaṃ sandhāyāha. Anāthapiṇḍikassa hi putto attano cūḷapitu santike pabbajito, atha naṃ subhūtitthero ādāya satthu santikaṃ agamāsi. Saddhāpadānesūti saddhānaṃ puggalānaṃ apadānesu lakkhaṇesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Mettasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "15"
      },
      ". Pañcame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sukhaṃ supatī"
      },
      "ti yathā sesajanā samparivattamānā kākacchamānā dukkhaṃ supanti, evaṃ asupitvā sukhaṃ supati. Niddaṃ okkamantopi samāpattiṃ samāpanno viya hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sukhaṃ paṭibujjhatī"
      },
      "ti yathā aññe nitthunantā vijambhamānā samparivattantā dukkhaṃ paṭibujjhanti, evaṃ appaṭibujjhitvā vikasamānaṃ viya padumaṃ sukhaṃ nibbikāro paṭibujjhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na pāpakaṃ supinaṃ passatī"
      },
      "ti supinaṃ passantopi bhaddakameva supinaṃ passati, cetiyaṃ vandanto viya pūjaṃ karonto viya ca dhammaṃ suṇanto viya ca hoti. Yathā panaññe attānaṃ corehi samparivāritaṃ viya vāḷehi upaddutaṃ viya papāte patantaṃ viya ca passanti, na evaṃ pāpakaṃ supinaṃ passati."
    ],
    "innerText": "15. Pañcame sukhaṃ supatīti yathā sesajanā samparivattamānā kākacchamānā dukkhaṃ supanti, evaṃ asupitvā sukhaṃ supati. Niddaṃ okkamantopi samāpattiṃ samāpanno viya hoti. Sukhaṃ paṭibujjhatīti yathā aññe nitthunantā vijambhamānā samparivattantā dukkhaṃ paṭibujjhanti, evaṃ appaṭibujjhitvā vikasamānaṃ viya padumaṃ sukhaṃ nibbikāro paṭibujjhati. Na pāpakaṃ supinaṃ passatīti supinaṃ passantopi bhaddakameva supinaṃ passati, cetiyaṃ vandanto viya pūjaṃ karonto viya ca dhammaṃ suṇanto viya ca hoti. Yathā panaññe attānaṃ corehi samparivāritaṃ viya vāḷehi upaddutaṃ viya papāte patantaṃ viya ca passanti, na evaṃ pāpakaṃ supinaṃ passati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Manussānaṃ piyo hotī"
      },
      "ti ure āmukkamuttāhāro viya sīse piḷandhitamālā viya ca manussānaṃ piyo hoti manāpo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Amanussānaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "piyo hotī"
      },
      "ti yatheva manussānaṃ, amanussānampi piyo hoti visākhatthero viya. Vatthu visuddhimagge (visuddhi. 1.258) mettākammaṭṭhānaniddese vitthāritameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Devatā rakkhantī"
      },
      "ti puttamiva mātāpitaro devatā rakkhanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nāssa aggi"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vā visaṃ vā satthaṃ vā kamatī"
      },
      "ti mettāvihārissa kāye uttarāya upāsikāya viya aggi vā, saṃyuttabhāṇakacūḷasīvattherasseva visaṃ vā, saṃkiccasāmaṇerasseva satthaṃ vā na kamati nappavisati, nāssa kāyaṃ vikopetīti vuttaṃ hoti. Dhenuvatthumpi cettha kathayanti. Ekā kira dhenu vacchakassa khīradhāraṃ muñcamānā aṭṭhāsi. Eko luddako ‘‘taṃ vijjhissāmī’’ti hatthena samparivattetvā dīghadaṇḍaṃ sattiṃ muñci. Sā tassā sarīraṃ āhacca tālapaṇṇaṃ viya vaṭṭamānā gatā ",
      ", neva upacārabalena na appanābalena, kevalaṃ vacchake balavahitacittatāya. Evaṃ mahānubhāvā mettā."
    ],
    "innerText": "Manussānaṃ piyo hotīti ure āmukkamuttāhāro viya sīse piḷandhitamālā viya ca manussānaṃ piyo hoti manāpo. Amanussānaṃpiyo hotīti yatheva manussānaṃ, amanussānampi piyo hoti visākhatthero viya. Vatthu visuddhimagge (visuddhi. 1.258) mettākammaṭṭhānaniddese vitthāritameva. Devatā rakkhantīti puttamiva mātāpitaro devatā rakkhanti. Nāssa aggivā visaṃ vā satthaṃ vā kamatīti mettāvihārissa kāye uttarāya upāsikāya viya aggi vā, saṃyuttabhāṇakacūḷasīvattherasseva visaṃ vā, saṃkiccasāmaṇerasseva satthaṃ vā na kamati nappavisati, nāssa kāyaṃ vikopetīti vuttaṃ hoti. Dhenuvatthumpi cettha kathayanti. Ekā kira dhenu vacchakassa khīradhāraṃ muñcamānā aṭṭhāsi. Eko luddako ‘‘taṃ vijjhissāmī’’ti hatthena samparivattetvā dīghadaṇḍaṃ sattiṃ muñci. Sā tassā sarīraṃ āhacca tālapaṇṇaṃ viya vaṭṭamānā gatā , neva upacārabalena na appanābalena, kevalaṃ vacchake balavahitacittatāya. Evaṃ mahānubhāvā mettā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tuvaṭaṃ cittaṃ samādhiyatī"
      },
      "ti mettāvihārino khippameva cittaṃ samādhiyati, natthi tassa dandhāyitattaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mukhavaṇṇo vippasīdatī"
      },
      "ti bandhanā pavuttatālapakkaṃ viya cassa vippasannavaṇṇaṃ mukhaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asammūḷho kālaṃ karotī"
      },
      "ti mettāvihārino sammohamaraṇaṃ nāma natthi, asammūḷho pana niddaṃ okkamanto viya kālaṃ karoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uttari appaṭivijjhanto"
      },
      "ti mettāsamāpattito uttari arahattaṃ ",
      " adhigantuṃ asakkonto ito cavitvā suttappabuddho viya brahmalokaṃ upapajjatīti."
    ],
    "innerText": "Tuvaṭaṃ cittaṃ samādhiyatīti mettāvihārino khippameva cittaṃ samādhiyati, natthi tassa dandhāyitattaṃ. Mukhavaṇṇo vippasīdatīti bandhanā pavuttatālapakkaṃ viya cassa vippasannavaṇṇaṃ mukhaṃ hoti. Asammūḷho kālaṃ karotīti mettāvihārino sammohamaraṇaṃ nāma natthi, asammūḷho pana niddaṃ okkamanto viya kālaṃ karoti. Uttari appaṭivijjhantoti mettāsamāpattito uttari arahattaṃ adhigantuṃ asakkonto ito cavitvā suttappabuddho viya brahmalokaṃ upapajjatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Aṭṭhakanāgarasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "16"
      },
      ". Chaṭṭhe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dasamo"
      },
      "ti jātigottavasena ceva sārapattakulagaṇanāya ca dasame ṭhāne gaṇīyati, tenassa dasamotveva nāmaṃ jātaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭhakanāgaro"
      },
      "ti aṭṭhakanagaravāsī. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kukkuṭārāme"
      },
      "ti kukkuṭaseṭṭhinā kārite ārāme."
    ],
    "innerText": "16. Chaṭṭhe dasamoti jātigottavasena ceva sārapattakulagaṇanāya ca dasame ṭhāne gaṇīyati, tenassa dasamotveva nāmaṃ jātaṃ. Aṭṭhakanāgaroti aṭṭhakanagaravāsī. Kukkuṭārāmeti kukkuṭaseṭṭhinā kārite ārāme."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tena bhagavatā…pe… sammadakkhāto"
      },
      "ti ettha ayaṃ saṅkhepattho – yo so bhagavā samatiṃsa pāramiyo pūretvā sabbakilese bhañjitvā anuttaraṃ sammāsambodhiṃ abhisambuddho, tena bhagavatā tesaṃ tesaṃ sattānaṃ āsayānusayaṃ jānatā, hatthatale ṭhapitaṃ āmalakaṃ viya sabbañeyyadhamme passatā, apica pubbenivāsādīhi jānatā, dibbena cakkhunā passatā, tīhi vā vijjāhi chahi vā pana abhiññāhi jānatā, sabbattha appaṭihatena samantacakkhunā passatā, sabbadhammajānanasamatthāya paññāya jānatā, sabbasattānaṃ cakkhuvisayātītāni tirokuṭṭādigatāni cāpi ",
      " rūpāni ativisuddhena maṃsacakkhunā vā passatā, attahitasādhikāya samādhipadaṭṭhānāya paṭivedhapaññāya jānatā, parahitasādhikāya karuṇāpadaṭṭhānāya desanāpaññāya passatā, antarāyikadhamme vā jānatā, niyyānikadhamme passatā, arīnaṃ hatattā arahatā, sammā sāmaṃ sabbadhammānaṃ buddhattā sammāsambuddhenāti evaṃ catuvesārajjavasena catūhi kāraṇehi thomitena atthi nu kho eko dhammo akkhātoti."
    ],
    "innerText": "Tena bhagavatā…pe… sammadakkhātoti ettha ayaṃ saṅkhepattho – yo so bhagavā samatiṃsa pāramiyo pūretvā sabbakilese bhañjitvā anuttaraṃ sammāsambodhiṃ abhisambuddho, tena bhagavatā tesaṃ tesaṃ sattānaṃ āsayānusayaṃ jānatā, hatthatale ṭhapitaṃ āmalakaṃ viya sabbañeyyadhamme passatā, apica pubbenivāsādīhi jānatā, dibbena cakkhunā passatā, tīhi vā vijjāhi chahi vā pana abhiññāhi jānatā, sabbattha appaṭihatena samantacakkhunā passatā, sabbadhammajānanasamatthāya paññāya jānatā, sabbasattānaṃ cakkhuvisayātītāni tirokuṭṭādigatāni cāpi rūpāni ativisuddhena maṃsacakkhunā vā passatā, attahitasādhikāya samādhipadaṭṭhānāya paṭivedhapaññāya jānatā, parahitasādhikāya karuṇāpadaṭṭhānāya desanāpaññāya passatā, antarāyikadhamme vā jānatā, niyyānikadhamme passatā, arīnaṃ hatattā arahatā, sammā sāmaṃ sabbadhammānaṃ buddhattā sammāsambuddhenāti evaṃ catuvesārajjavasena catūhi kāraṇehi thomitena atthi nu kho eko dhammo akkhātoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhisaṅkhata"
      },
      "nti ",
      " kataṃ uppāditaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhisañcetayita"
      },
      "nti cetayitaṃ kappayitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "So"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tattha ṭhito"
      },
      "ti so tasmiṃ samathavipassanādhamme ṭhito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammarāgena dhammanandiyā"
      },
      "ti padadvayenapi samathavipassanāsu chandarāgo vutto. Samathavipassanāsu hi sabbena sabbaṃ chandarāgaṃ pariyādiyituṃ sakkonto arahā hoti, asakkonto anāgāmī hoti. So samathavipassanāsu chandarāgassa appahīnattā catutthajjhānacetanāya suddhāvāse nibbattati. Ayaṃ ācariyānaṃ samānatthakathā."
    ],
    "innerText": "Abhisaṅkhatanti kataṃ uppāditaṃ. Abhisañcetayitanti cetayitaṃ kappayitaṃ. Sotattha ṭhitoti so tasmiṃ samathavipassanādhamme ṭhito. Dhammarāgena dhammanandiyāti padadvayenapi samathavipassanāsu chandarāgo vutto. Samathavipassanāsu hi sabbena sabbaṃ chandarāgaṃ pariyādiyituṃ sakkonto arahā hoti, asakkonto anāgāmī hoti. So samathavipassanāsu chandarāgassa appahīnattā catutthajjhānacetanāya suddhāvāse nibbattati. Ayaṃ ācariyānaṃ samānatthakathā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Vitaṇḍavādī panāha – ‘‘teneva dhammarāgenāti vacanato akusalena suddhāvāse nibbattatī’’ti. So ‘‘suttaṃ āharāhī’’ti vattabbo. Addhā aññaṃ apassanto idameva āharissati. Tato vattabbo ‘‘kimpanidaṃ suttaṃ nītatthaṃ, udāhu neyyattha’’nti. Addhā ‘‘nītattha’’nti vakkhati. Tato vattabbo – evaṃ sante anāgāmiphalatthikena samathavipassanāsu chandarāgo kattabbo bhavissati, chandarāge uppādite anāgāmiphalaṃ paṭiladdhaṃ bhavissati, mā ‘‘suttaṃ me laddha’’nti yaṃ vā taṃ vā dīpehi. Pañhaṃ kathentena hi ācariyassa santike uggahetvā attharasaṃ paṭivijjhitvā kathetuṃ vaṭṭati. Akusalena hi sagge, kusalena ca apāye paṭisandhi nāma natthi. Vuttañcetaṃ bhagavatā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Na, bhikkhave, lobhajena kammena, dosajena kammena, mohajena kammena devā paññāyanti, manussā paññāyanti, yā vā panaññāpi kāci sugatiyo. Atha kho, bhikkhave, lobhajena kammena, dosajena kammena, mohajena kammena nirayo paññāyati, tiracchānayoni paññāyati, pettivisayo paññāyati, yā vā panaññāpi kāci duggatiyo’’ti (a. ni. 6.39) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Evaṃ ",
      " saññāpetabbo. Sace sañjānāti, sañjānātu. No ce sañjānāti, ‘‘gaccha pātova vihāraṃ pavisitvā yāguṃ pivā’’ti uyyojetabbo."
    ],
    "innerText": "Evaṃ saññāpetabbo. Sace sañjānāti, sañjānātu. No ce sañjānāti, ‘‘gaccha pātova vihāraṃ pavisitvā yāguṃ pivā’’ti uyyojetabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayaṃ kho, gahapati, ekadhammo akkhāto"
      },
      "ti ekaṃ dhammaṃ ",
      " pucchitena ‘‘ayampi ekadhammo akkhāto, ayampi ekadhammo akkhāto’’ti evaṃ pucchāvasena kathitattā ekādasapi dhammā ekadhammo nāma kato. Amatuppattiatthena vā sabbepi ekadhammoti vattuṃ vaṭṭati."
    ],
    "innerText": "Ayaṃ kho, gahapati, ekadhammo akkhātoti ekaṃ dhammaṃ pucchitena ‘‘ayampi ekadhammo akkhāto, ayampi ekadhammo akkhāto’’ti evaṃ pucchāvasena kathitattā ekādasapi dhammā ekadhammo nāma kato. Amatuppattiatthena vā sabbepi ekadhammoti vattuṃ vaṭṭati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nidhimukhaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gavesanto"
      },
      "ti nidhiṃ pariyesanto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sakidevā"
      },
      "ti ekappayogeneva. Kathaṃ pana ekappayogeneva ekādasannaṃ nidhīnaṃ adhigamo hotīti? Idhekacco araññe jīvitavuttiṃ gavesamāno carati. Tamenaṃ aññataro atthacarako disvā ‘‘kiṃ, bho, carasī’’ti pucchati. So ‘‘jīvitavuttiṃ pariyesāmī’’ti āha. Itaro ‘‘tena hi samma āgaccha, etaṃ pāsāṇaṃ pavaṭṭehī’’ti āha. So taṃ pavaṭṭetvā uparūpariṭṭhitā vā kucchiyā kucchiṃ āhacca ṭhitā vā ekādasa kumbhiyo passati. Evaṃ ekappayogena ekādasannaṃ adhigamo hoti."
    ],
    "innerText": "Nidhimukhaṃgavesantoti nidhiṃ pariyesanto. Sakidevāti ekappayogeneva. Kathaṃ pana ekappayogeneva ekādasannaṃ nidhīnaṃ adhigamo hotīti? Idhekacco araññe jīvitavuttiṃ gavesamāno carati. Tamenaṃ aññataro atthacarako disvā ‘‘kiṃ, bho, carasī’’ti pucchati. So ‘‘jīvitavuttiṃ pariyesāmī’’ti āha. Itaro ‘‘tena hi samma āgaccha, etaṃ pāsāṇaṃ pavaṭṭehī’’ti āha. So taṃ pavaṭṭetvā uparūpariṭṭhitā vā kucchiyā kucchiṃ āhacca ṭhitā vā ekādasa kumbhiyo passati. Evaṃ ekappayogena ekādasannaṃ adhigamo hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ācariyadhanaṃ pariyesissantī"
      },
      "ti aññatitthiyā hi yassa santike sippaṃ uggaṇhanti, tassa sippuggahaṇato pure vā pacchā vā antarantarā vā gehato nīharitvā dhanaṃ denti. Yesaṃ gehe natthi, te ñātisabhāgato pariyesanti. Yesaṃ tampi natthi, te sabhāgato pariyesanti. Tathā alabhamānā bhikkhampi caritvā dentiyeva. Taṃ sandhāyetaṃ vuttaṃ."
    ],
    "innerText": "Ācariyadhanaṃ pariyesissantīti aññatitthiyā hi yassa santike sippaṃ uggaṇhanti, tassa sippuggahaṇato pure vā pacchā vā antarantarā vā gehato nīharitvā dhanaṃ denti. Yesaṃ gehe natthi, te ñātisabhāgato pariyesanti. Yesaṃ tampi natthi, te sabhāgato pariyesanti. Tathā alabhamānā bhikkhampi caritvā dentiyeva. Taṃ sandhāyetaṃ vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kiṃ panāha"
      },
      "nti bāhirakā tāva aniyyānikepi sāsane sippamattadāyakassa dhanaṃ pariyesanti, ahaṃ pana evaṃvidhe niyyānikasāsane ekādasavidhaṃ amatuppattipaṭipadaṃ ",
      " desentassa ācariyassa pūjaṃ kiṃ na karissāmi, karissāmiyevāti vadati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paccekaṃ dussayugena acchādesī"
      },
      "ti ekamekassa bhikkhuno ekekaṃ dussayugaṃ adāsīti attho. Samudācāravacanaṃ panettha evarūpaṃ hoti, tasmā acchādesīti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañcasataṃ vihāra"
      },
      "nti pañcasatagghanikaṃ paṇṇasālaṃ kāresīti attho."
    ],
    "innerText": "Kiṃ panāhanti bāhirakā tāva aniyyānikepi sāsane sippamattadāyakassa dhanaṃ pariyesanti, ahaṃ pana evaṃvidhe niyyānikasāsane ekādasavidhaṃ amatuppattipaṭipadaṃ desentassa ācariyassa pūjaṃ kiṃ na karissāmi, karissāmiyevāti vadati. Paccekaṃ dussayugena acchādesīti ekamekassa bhikkhuno ekekaṃ dussayugaṃ adāsīti attho. Samudācāravacanaṃ panettha evarūpaṃ hoti, tasmā acchādesīti vuttaṃ. Pañcasataṃ vihāranti pañcasatagghanikaṃ paṇṇasālaṃ kāresīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Gopālasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "17"
      },
      ". Sattame tisso kathā ekanāḷikā caturassā nisinnavattikāti. Tattha pāḷiṃ vatvā ekekassa padassa atthakathanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekanāḷikā"
      },
      " nāma ",
      ". Apaṇḍitagopālakaṃ dassetvā, apaṇḍitabhikkhuṃ dassetvā, paṇḍitagopālakaṃ dassetvā, paṇḍitabhikkhuṃ dassetvāti catukkaṃ bandhitvā kathanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "caturassā"
      },
      " nāma. Apaṇḍitagopālakaṃ dassetvā pariyosānagamanaṃ, apaṇḍitabhikkhuṃ dassetvā pariyosānagamanaṃ, paṇḍitagopālakaṃ dassetvā pariyosānagamanaṃ, paṇḍitabhikkhuṃ dassetvā pariyosānagamananti ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nisinnavattikā"
      },
      " nāma. Ayaṃ idha sabbācariyānaṃ āciṇṇā."
    ],
    "innerText": "17. Sattame tisso kathā ekanāḷikā caturassā nisinnavattikāti. Tattha pāḷiṃ vatvā ekekassa padassa atthakathanaṃ ekanāḷikā nāma . Apaṇḍitagopālakaṃ dassetvā, apaṇḍitabhikkhuṃ dassetvā, paṇḍitagopālakaṃ dassetvā, paṇḍitabhikkhuṃ dassetvāti catukkaṃ bandhitvā kathanaṃ caturassā nāma. Apaṇḍitagopālakaṃ dassetvā pariyosānagamanaṃ, apaṇḍitabhikkhuṃ dassetvā pariyosānagamanaṃ, paṇḍitagopālakaṃ dassetvā pariyosānagamanaṃ, paṇḍitabhikkhuṃ dassetvā pariyosānagamananti ayaṃ nisinnavattikā nāma. Ayaṃ idha sabbācariyānaṃ āciṇṇā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekādasahi"
      },
      ", ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhikkhave, aṅgehī"
      },
      "ti ekādasahi aguṇakoṭṭhāsehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gogaṇa"
      },
      "nti gomaṇḍalaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pariharitu"
      },
      "nti pariggahetvā vicarituṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Phātiṃ kātu"
      },
      "nti vaḍḍhiṃ āpādetuṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idhā"
      },
      "ti imasmiṃ loke. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na rūpaññū hotī"
      },
      "ti gaṇanato vā vaṇṇato vā rūpaṃ na jānāti. Gaṇanato na jānāti nāma attano gunnaṃ sataṃ vā sahassaṃ vāti saṅkhyaṃ na jānāti, so gāvīsu haṭāsu vā palātāsu vā gogaṇaṃ gaṇetvā ‘‘ajja ettakā na ",
      " dissantī’’ti dve tīṇi gāmantarāni vā aṭaviṃ vā vicaranto na pariyesati. Aññesaṃ gāvīsu attano gogaṇaṃ paviṭṭhāsupi gogaṇaṃ gaṇetvā ‘‘imā ettikā gāvo na amhāka’’nti yaṭṭhiyā pothetvā na nīharati. Tassa naṭṭhā gāviyo naṭṭhāva honti. Paragāviyo gahetvā carati. Gosāmikā disvā ‘‘ayaṃ ettakaṃ kālaṃ amhākaṃ dhenū duhī’’ti tajjetvā attano gāviyo gahetvā gacchanti. Tassa gogaṇopi parihāyati, pañca gorasaparibhogatopi paribāhiro hoti. Vaṇṇato na jānāti nāma ‘‘ettikā gāvī setā, ettikā rattā, ettikā kāḷā, ettikā odātā, ettikā kabarā, ettikā nīlā’’ti na jānāti. So gāvīsu haṭāsu vā palātāsu vā…pe… pañcagorasaparibhogatopi paribāhiro hoti."
    ],
    "innerText": "Ekādasahi, bhikkhave, aṅgehīti ekādasahi aguṇakoṭṭhāsehi. Gogaṇanti gomaṇḍalaṃ. Pariharitunti pariggahetvā vicarituṃ. Phātiṃ kātunti vaḍḍhiṃ āpādetuṃ. Idhāti imasmiṃ loke. Na rūpaññū hotīti gaṇanato vā vaṇṇato vā rūpaṃ na jānāti. Gaṇanato na jānāti nāma attano gunnaṃ sataṃ vā sahassaṃ vāti saṅkhyaṃ na jānāti, so gāvīsu haṭāsu vā palātāsu vā gogaṇaṃ gaṇetvā ‘‘ajja ettakā na dissantī’’ti dve tīṇi gāmantarāni vā aṭaviṃ vā vicaranto na pariyesati. Aññesaṃ gāvīsu attano gogaṇaṃ paviṭṭhāsupi gogaṇaṃ gaṇetvā ‘‘imā ettikā gāvo na amhāka’’nti yaṭṭhiyā pothetvā na nīharati. Tassa naṭṭhā gāviyo naṭṭhāva honti. Paragāviyo gahetvā carati. Gosāmikā disvā ‘‘ayaṃ ettakaṃ kālaṃ amhākaṃ dhenū duhī’’ti tajjetvā attano gāviyo gahetvā gacchanti. Tassa gogaṇopi parihāyati, pañca gorasaparibhogatopi paribāhiro hoti. Vaṇṇato na jānāti nāma ‘‘ettikā gāvī setā, ettikā rattā, ettikā kāḷā, ettikā odātā, ettikā kabarā, ettikā nīlā’’ti na jānāti. So gāvīsu haṭāsu vā palātāsu vā…pe… pañcagorasaparibhogatopi paribāhiro hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na lakkhaṇakusalo"
      },
      "ti gāvīnaṃ sarīre kataṃ dhanusattisūlādibhedaṃ lakkhaṇaṃ na jānāti. So gāvīsu haṭāsu vā palātāsu vā ‘‘ajja asukalakkhaṇā asukalakkhaṇā ca gāvo na dissantī’’ti…pe… pañcagorasaparibhogatopi paribāhiro hoti."
    ],
    "innerText": "Na lakkhaṇakusaloti gāvīnaṃ sarīre kataṃ dhanusattisūlādibhedaṃ lakkhaṇaṃ na jānāti. So gāvīsu haṭāsu vā palātāsu vā ‘‘ajja asukalakkhaṇā asukalakkhaṇā ca gāvo na dissantī’’ti…pe… pañcagorasaparibhogatopi paribāhiro hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na āsāṭikaṃ hāretā"
      },
      "ti gunnaṃ khāṇukaṇṭakādīhi pahaṭaṭṭhānesu vaṇo hoti. Tattha nīlamakkhikā aṇḍakāni ṭhapenti, tesaṃ āsāṭikāti nāmaṃ. Tāni daṇḍakena apanetvā bhesajjaṃ dātabbaṃ hoti, bālo gopālako tathā na karoti. Tena vuttaṃ – ‘‘na āsāṭikaṃ hāretā ",
      " hotī’’ti. Tassa gunnaṃ vaṇā vaḍḍhanti, gambhīrā honti, pāṇakā kucchiṃ pavisanti, gāvo gelaññābhibhūtā neva yāvadatthaṃ tiṇaṃ khādituṃ ",
      " na pānīyaṃ pātuṃ sakkonti. Tattha gunnaṃ khīraṃ chijjati, goṇānaṃ javo hāyati, ubhayesampi jīvitantarāyo hoti. Evamassa gogaṇopi parihāyati…pe… pañcagorasatopi paribāhiro hoti."
    ],
    "innerText": "Na āsāṭikaṃ hāretāti gunnaṃ khāṇukaṇṭakādīhi pahaṭaṭṭhānesu vaṇo hoti. Tattha nīlamakkhikā aṇḍakāni ṭhapenti, tesaṃ āsāṭikāti nāmaṃ. Tāni daṇḍakena apanetvā bhesajjaṃ dātabbaṃ hoti, bālo gopālako tathā na karoti. Tena vuttaṃ – ‘‘na āsāṭikaṃ hāretā hotī’’ti. Tassa gunnaṃ vaṇā vaḍḍhanti, gambhīrā honti, pāṇakā kucchiṃ pavisanti, gāvo gelaññābhibhūtā neva yāvadatthaṃ tiṇaṃ khādituṃ na pānīyaṃ pātuṃ sakkonti. Tattha gunnaṃ khīraṃ chijjati, goṇānaṃ javo hāyati, ubhayesampi jīvitantarāyo hoti. Evamassa gogaṇopi parihāyati…pe… pañcagorasatopi paribāhiro hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na vaṇaṃ paṭicchādetā hotī"
      },
      "ti gunnaṃ vuttanayeneva sañjāto vaṇo bhesajjaṃ datvā vākena vā cīrakena vā bandhitvā paṭicchādetabbo hoti. Bālagopālako taṃ na karoti. Athassa gunnaṃ ",
      " vaṇehi yūsā paggharanti, tā aññamaññaṃ nighaṃsanti. Tena aññesampi vaṇā jāyanti. Evaṃ gāvo gelaññābhibhūtā neva yāvadatthaṃ tiṇāni khādituṃ…pe… paribāhiro hoti."
    ],
    "innerText": "Na vaṇaṃ paṭicchādetā hotīti gunnaṃ vuttanayeneva sañjāto vaṇo bhesajjaṃ datvā vākena vā cīrakena vā bandhitvā paṭicchādetabbo hoti. Bālagopālako taṃ na karoti. Athassa gunnaṃ vaṇehi yūsā paggharanti, tā aññamaññaṃ nighaṃsanti. Tena aññesampi vaṇā jāyanti. Evaṃ gāvo gelaññābhibhūtā neva yāvadatthaṃ tiṇāni khādituṃ…pe… paribāhiro hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na dhūmaṃ kattā hotī"
      },
      "ti antovasse ḍaṃsamakasādīnaṃ ussannakāle gogaṇe vajaṃ paviṭṭhe tattha tattha dhūmo kātabbo hoti. Apaṇḍitagopālako taṃ na karoti, gogaṇo sabbarattiṃ ḍaṃsādīhi upadduto niddaṃ alabhitvā punadivase araññe tattha tattha rukkhamūlādīsu nipajjitvā niddāyati. Neva yāvadatthaṃ tiṇāni khādituṃ…pe… paribāhiro hoti."
    ],
    "innerText": "Na dhūmaṃ kattā hotīti antovasse ḍaṃsamakasādīnaṃ ussannakāle gogaṇe vajaṃ paviṭṭhe tattha tattha dhūmo kātabbo hoti. Apaṇḍitagopālako taṃ na karoti, gogaṇo sabbarattiṃ ḍaṃsādīhi upadduto niddaṃ alabhitvā punadivase araññe tattha tattha rukkhamūlādīsu nipajjitvā niddāyati. Neva yāvadatthaṃ tiṇāni khādituṃ…pe… paribāhiro hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na titthaṃ jānātī"
      },
      "ti titthampi samanti vā visamanti vā sagāhanti vā niggāhanti vā na jānāti. So atitthena gāviyo otāreti. Tāsaṃ visamatitthe pāsāṇādīni akkamantīnaṃ pādā bhijjanti. Sagāhaṃ gambhīraṃ titthaṃ otiṇṇe kumbhīlādayo gāvo gaṇhanti, ‘‘ajja ettikā gāvo naṭṭhā, ajja ettikā’’ti vattabbataṃ āpajjanti. Evamassa ",
      " go gaṇopi parihāyati…pe… pañcagorasatopi paribāhiro hoti."
    ],
    "innerText": "Na titthaṃ jānātīti titthampi samanti vā visamanti vā sagāhanti vā niggāhanti vā na jānāti. So atitthena gāviyo otāreti. Tāsaṃ visamatitthe pāsāṇādīni akkamantīnaṃ pādā bhijjanti. Sagāhaṃ gambhīraṃ titthaṃ otiṇṇe kumbhīlādayo gāvo gaṇhanti, ‘‘ajja ettikā gāvo naṭṭhā, ajja ettikā’’ti vattabbataṃ āpajjanti. Evamassa go gaṇopi parihāyati…pe… pañcagorasatopi paribāhiro hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na pītaṃ jānātī"
      },
      "ti pītampi apītampi na jānāti. Gopālakena hi ‘‘imāya gāviyā pītaṃ, imāya na pītaṃ, imāya pānīyatitthe okāso laddho, imāya na laddho’’ti evaṃ pītāpītaṃ jānitabbaṃ hoti. Ayaṃ pana divasabhāge araññe gogaṇaṃ rakkhitvā ‘‘pānīyaṃ pāyessāmī’’ti nadiṃ vā taḷākaṃ vā ogāhetvā gacchati. Tattha mahāusabhā ca anusabhā ca balavagāviyo ca dubbalāni ceva mahallakāni ca gorūpāni siṅgehi ",
      " vā phāsukāhi vā paharitvā attano okāsaṃ katvā ūruppamāṇaṃ udakaṃ pavisitvā yathākāmaṃ pivanti. Avasesā okāsaṃ alabhamānā tīre ṭhatvā kalalamissakaṃ udakaṃ pivanti vā apītā eva vā honti. Atha so gopālako piṭṭhiyaṃ paharitvā puna araññaṃ paveseti. Tattha apītā gāviyo pipāsāya sussamānā yāvadatthaṃ tiṇāni khādituṃ na sakkonti. Tattha gunnaṃ khīraṃ chijjati. Goṇānaṃ javo hāyati…pe… paribāhiro hoti."
    ],
    "innerText": "Na pītaṃ jānātīti pītampi apītampi na jānāti. Gopālakena hi ‘‘imāya gāviyā pītaṃ, imāya na pītaṃ, imāya pānīyatitthe okāso laddho, imāya na laddho’’ti evaṃ pītāpītaṃ jānitabbaṃ hoti. Ayaṃ pana divasabhāge araññe gogaṇaṃ rakkhitvā ‘‘pānīyaṃ pāyessāmī’’ti nadiṃ vā taḷākaṃ vā ogāhetvā gacchati. Tattha mahāusabhā ca anusabhā ca balavagāviyo ca dubbalāni ceva mahallakāni ca gorūpāni siṅgehi vā phāsukāhi vā paharitvā attano okāsaṃ katvā ūruppamāṇaṃ udakaṃ pavisitvā yathākāmaṃ pivanti. Avasesā okāsaṃ alabhamānā tīre ṭhatvā kalalamissakaṃ udakaṃ pivanti vā apītā eva vā honti. Atha so gopālako piṭṭhiyaṃ paharitvā puna araññaṃ paveseti. Tattha apītā gāviyo pipāsāya sussamānā yāvadatthaṃ tiṇāni khādituṃ na sakkonti. Tattha gunnaṃ khīraṃ chijjati. Goṇānaṃ javo hāyati…pe… paribāhiro hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na vīthiṃ jānātī"
      },
      "ti ‘‘ayaṃ maggo samo khemo, ayaṃ visamo sāsaṅko sappaṭibhayo’’ti na jānāti. So samaṃ khemaṃ maggaṃ vajjetvā gogaṇaṃ itaramaggaṃ paṭipādeti. Tattha gāvo sīhabyagghādīnaṃ gandhena coraparissayena ca abhibhūtā bhantamigasappaṭibhāgā gīvaṃ ukkhipitvā tiṭṭhanti ",
      ", neva yāvadatthaṃ tiṇāni khādanti, na pānīyaṃ pivanti. Tattha gunnaṃ khīraṃ chijjati…pe… paribāhiro hoti."
    ],
    "innerText": "Na vīthiṃ jānātīti ‘‘ayaṃ maggo samo khemo, ayaṃ visamo sāsaṅko sappaṭibhayo’’ti na jānāti. So samaṃ khemaṃ maggaṃ vajjetvā gogaṇaṃ itaramaggaṃ paṭipādeti. Tattha gāvo sīhabyagghādīnaṃ gandhena coraparissayena ca abhibhūtā bhantamigasappaṭibhāgā gīvaṃ ukkhipitvā tiṭṭhanti , neva yāvadatthaṃ tiṇāni khādanti, na pānīyaṃ pivanti. Tattha gunnaṃ khīraṃ chijjati…pe… paribāhiro hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gocarakusalo hotī"
      },
      "ti gopālakena hi gocarakusalena bhavitabbaṃ, pañcāhikacāro vā sattāhikacāro vā jānitabbo. Ekadisāya gogaṇaṃ cāretvā punadivase tattha na cāretabbo. Mahatā hi gogaṇena ciṇṇaṭṭhānaṃ bheritalaṃ viya suddhaṃ hoti nittiṇaṃ, udakampi ālulīyati. Tasmā pañcame vā sattame vā divase puna tattha cāretuṃ vaṭṭati. Ettakena hi tiṇampi paṭiviruhati, udakampi pasīdati, ayaṃ pana imaṃ pañcāhikacāraṃ vā sattāhikacāraṃ vā na jānāti, divase divase rakkhitaṭṭhāneyeva rakkhati. Athassa gogaṇo haritatiṇaṃ na labhati, sukkhatiṇaṃ khādanto kalalamissakaṃ udakaṃ pivati. Tattha gunnaṃ khīraṃ chijjati…pe… paribāhiro hoti."
    ],
    "innerText": "Nagocarakusalo hotīti gopālakena hi gocarakusalena bhavitabbaṃ, pañcāhikacāro vā sattāhikacāro vā jānitabbo. Ekadisāya gogaṇaṃ cāretvā punadivase tattha na cāretabbo. Mahatā hi gogaṇena ciṇṇaṭṭhānaṃ bheritalaṃ viya suddhaṃ hoti nittiṇaṃ, udakampi ālulīyati. Tasmā pañcame vā sattame vā divase puna tattha cāretuṃ vaṭṭati. Ettakena hi tiṇampi paṭiviruhati, udakampi pasīdati, ayaṃ pana imaṃ pañcāhikacāraṃ vā sattāhikacāraṃ vā na jānāti, divase divase rakkhitaṭṭhāneyeva rakkhati. Athassa gogaṇo haritatiṇaṃ na labhati, sukkhatiṇaṃ khādanto kalalamissakaṃ udakaṃ pivati. Tattha gunnaṃ khīraṃ chijjati…pe… paribāhiro hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anavasesadohī ca hotī"
      },
      "ti paṇḍitagopālakena hi yāva vacchakassa maṃsalohitaṃ saṇṭhāti, tāva ekaṃ dve thane ṭhapetvā sāvasesadohinā bhavitabbaṃ. Ayaṃ vacchakassa kiñci anavasesetvā duhati. Khīrapako vaccho khīrapipāsāya sussati, saṇṭhātuṃ asakkonto kampamāno mātu purato patitvā kālaṃ karonti. Mātā puttakaṃ disvā, ‘‘mayhaṃ puttako attano mātukhīraṃ pātuṃ na labhatī’’ti ",
      " puttasokena neva yāvadatthaṃ tiṇāni khādituṃ na pānīyaṃ pātuṃ sakkoti, thanesu khīraṃ chijjati. Evamassa gogaṇopi parihāyati…pe… pañcagorasatopi paribāhiro hoti."
    ],
    "innerText": "Anavasesadohī ca hotīti paṇḍitagopālakena hi yāva vacchakassa maṃsalohitaṃ saṇṭhāti, tāva ekaṃ dve thane ṭhapetvā sāvasesadohinā bhavitabbaṃ. Ayaṃ vacchakassa kiñci anavasesetvā duhati. Khīrapako vaccho khīrapipāsāya sussati, saṇṭhātuṃ asakkonto kampamāno mātu purato patitvā kālaṃ karonti. Mātā puttakaṃ disvā, ‘‘mayhaṃ puttako attano mātukhīraṃ pātuṃ na labhatī’’ti puttasokena neva yāvadatthaṃ tiṇāni khādituṃ na pānīyaṃ pātuṃ sakkoti, thanesu khīraṃ chijjati. Evamassa gogaṇopi parihāyati…pe… pañcagorasatopi paribāhiro hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Gunnaṃ pitiṭṭhānaṃ karontīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gopitaro"
      },
      ". Gāvo pariṇāyanti yathāruciṃ gahetvā gacchantīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gopariṇāyakā. Te na"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atirekapūjāyā"
      },
      "ti paṇḍito hi gopālako evarūpe usabhe atirekapūjāya pūjeti, paṇītaṃ gobhattaṃ deti, gandhapañcaṅgulikehi maṇḍeti, mālaṃ piḷandheti, siṅgesu suvaṇṇarajatakosake ca dhāreti, rattiṃ dīpaṃ jāletvā celavitānassa heṭṭhā sayāpeti. Ayaṃ pana tato ekasakkārampi na karoti. Usabhā atirekapūjaṃ alabhamānā gogaṇaṃ na rakkhanti, parissayaṃ na vārenti. Evamassa gogaṇopi parihāyati…pe… pañcagorasatopi paribāhiro hoti."
    ],
    "innerText": "Gunnaṃ pitiṭṭhānaṃ karontīti gopitaro. Gāvo pariṇāyanti yathāruciṃ gahetvā gacchantīti gopariṇāyakā. Te naatirekapūjāyāti paṇḍito hi gopālako evarūpe usabhe atirekapūjāya pūjeti, paṇītaṃ gobhattaṃ deti, gandhapañcaṅgulikehi maṇḍeti, mālaṃ piḷandheti, siṅgesu suvaṇṇarajatakosake ca dhāreti, rattiṃ dīpaṃ jāletvā celavitānassa heṭṭhā sayāpeti. Ayaṃ pana tato ekasakkārampi na karoti. Usabhā atirekapūjaṃ alabhamānā gogaṇaṃ na rakkhanti, parissayaṃ na vārenti. Evamassa gogaṇopi parihāyati…pe… pañcagorasatopi paribāhiro hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idhā"
      },
      "ti ",
      " imasmiṃ sāsane. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na rūpaññū hotī"
      },
      "ti ‘‘cattāri mahābhūtāni catunnañca mahābhūtānaṃ upādāyarūpa’’nti evaṃ vuttaṃ rūpaṃ dvīhākārehi na jānāti gaṇanato vā samuṭṭhānato vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gaṇanato na jānāti"
      },
      " nāma – ‘‘cakkhāyatanaṃ sotāyatanaṃ ghānāyatanaṃ jivhākāyarūpasaddagandharasaphoṭṭhabbāyatanaṃ, itthindriyaṃ purisindriyaṃ jīvitindriyaṃ kāyaviññatti vacīviññatti ākāsadhātu āpodhātu rūpassa lahutā, mudutā, kammaññatā, upacayo, santati, jaratā, rūpassa aniccatā, kabaḷīkāro āhāro’’ti (dha. sa. 657-665) evaṃ pāḷiyā āgatā pañcavīsati rūpakoṭṭhāsāti na jānāti. Seyyathāpi so gopālako gaṇanato gunnaṃ rūpaṃ na jānāti, tathūpamo ayaṃ bhikkhu. So gaṇanato rūpaṃ ajānanto rūpaṃ pariggahetvā arūpaṃ vavatthapetvā rūpārūpaṃ pariggahetvā paccayaṃ sallakkhetvā lakkhaṇaṃ āropetvā kammaṭṭhānaṃ matthakaṃ pāpetuṃ na sakkoti. So yathā tassa gopālakassa gogaṇo na vaḍḍhati, evaṃ imasmiṃ sāsane sīlasamādhivipassanāmaggaphalanibbānehi na vaḍḍhati. Yathā ca so gopālako pañcahi gorasehi paribāhiro hoti ",
      ", evamevāyaṃ asekhena sīlakkhandhena asekhena samādhipaññāvimutti vimuttiñāṇadassanakkhandhenāti pañcahi dhammakkhandhehi paribāhiro hoti."
    ],
    "innerText": "Idhāti imasmiṃ sāsane. Na rūpaññū hotīti ‘‘cattāri mahābhūtāni catunnañca mahābhūtānaṃ upādāyarūpa’’nti evaṃ vuttaṃ rūpaṃ dvīhākārehi na jānāti gaṇanato vā samuṭṭhānato vā. Gaṇanato na jānāti nāma – ‘‘cakkhāyatanaṃ sotāyatanaṃ ghānāyatanaṃ jivhākāyarūpasaddagandharasaphoṭṭhabbāyatanaṃ, itthindriyaṃ purisindriyaṃ jīvitindriyaṃ kāyaviññatti vacīviññatti ākāsadhātu āpodhātu rūpassa lahutā, mudutā, kammaññatā, upacayo, santati, jaratā, rūpassa aniccatā, kabaḷīkāro āhāro’’ti (dha. sa. 657-665) evaṃ pāḷiyā āgatā pañcavīsati rūpakoṭṭhāsāti na jānāti. Seyyathāpi so gopālako gaṇanato gunnaṃ rūpaṃ na jānāti, tathūpamo ayaṃ bhikkhu. So gaṇanato rūpaṃ ajānanto rūpaṃ pariggahetvā arūpaṃ vavatthapetvā rūpārūpaṃ pariggahetvā paccayaṃ sallakkhetvā lakkhaṇaṃ āropetvā kammaṭṭhānaṃ matthakaṃ pāpetuṃ na sakkoti. So yathā tassa gopālakassa gogaṇo na vaḍḍhati, evaṃ imasmiṃ sāsane sīlasamādhivipassanāmaggaphalanibbānehi na vaḍḍhati. Yathā ca so gopālako pañcahi gorasehi paribāhiro hoti , evamevāyaṃ asekhena sīlakkhandhena asekhena samādhipaññāvimutti vimuttiñāṇadassanakkhandhenāti pañcahi dhammakkhandhehi paribāhiro hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samuṭṭhānato"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na jānāti"
      },
      " nāma – ‘‘ettakaṃ rūpaṃ ekasamuṭṭhānaṃ, ettakaṃ dvisamuṭṭhānaṃ, ettakaṃ tisamuṭṭhānaṃ, ettakaṃ catusamuṭṭhānaṃ, ettakaṃ nakutoci samuṭṭhātī’’ti na jānāti. Seyyathāpi so gopālako vaṇṇato gunnaṃ rūpaṃ na jānāti, tathūpamo ayaṃ bhikkhu. So samuṭṭhānato rūpaṃ ajānanto rūpaṃ pariggahetvā…pe… paribāhiro hoti."
    ],
    "innerText": "Samuṭṭhānatona jānāti nāma – ‘‘ettakaṃ rūpaṃ ekasamuṭṭhānaṃ, ettakaṃ dvisamuṭṭhānaṃ, ettakaṃ tisamuṭṭhānaṃ, ettakaṃ catusamuṭṭhānaṃ, ettakaṃ nakutoci samuṭṭhātī’’ti na jānāti. Seyyathāpi so gopālako vaṇṇato gunnaṃ rūpaṃ na jānāti, tathūpamo ayaṃ bhikkhu. So samuṭṭhānato rūpaṃ ajānanto rūpaṃ pariggahetvā…pe… paribāhiro hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na lakkhaṇakusalo hotī"
      },
      "ti ‘‘kammalakkhaṇo bālo, kammalakkhaṇo paṇḍito’’ti evaṃ vuttaṃ kusalākusalakammaṃ paṇḍitabālalakkhaṇanti na jānāti. So evaṃ ajānanto bāle vajjetvā paṇḍite na sevati. Bāle vajjetvā paṇḍite asevanto kappiyākappiyaṃ kusalākusalaṃ sāvajjānavajjaṃ garukalahukaṃ satekicchātekicchaṃ kāraṇākāraṇaṃ na jānāti. Taṃ ajānanto kammaṭṭhānaṃ gahetvā vaḍḍhetuṃ na sakkoti. So yathā tassa gopālakassa gogaṇo na vaḍḍhati, evaṃ imasmiṃ sāsane yathāvuttehi sīlādīhi na vaḍḍhati. So gopālako viya ca pañcahi gorasehi, pañcahi dhammakkhandhehi paribāhiro hoti."
    ],
    "innerText": "Na lakkhaṇakusalo hotīti ‘‘kammalakkhaṇo bālo, kammalakkhaṇo paṇḍito’’ti evaṃ vuttaṃ kusalākusalakammaṃ paṇḍitabālalakkhaṇanti na jānāti. So evaṃ ajānanto bāle vajjetvā paṇḍite na sevati. Bāle vajjetvā paṇḍite asevanto kappiyākappiyaṃ kusalākusalaṃ sāvajjānavajjaṃ garukalahukaṃ satekicchātekicchaṃ kāraṇākāraṇaṃ na jānāti. Taṃ ajānanto kammaṭṭhānaṃ gahetvā vaḍḍhetuṃ na sakkoti. So yathā tassa gopālakassa gogaṇo na vaḍḍhati, evaṃ imasmiṃ sāsane yathāvuttehi sīlādīhi na vaḍḍhati. So gopālako viya ca pañcahi gorasehi, pañcahi dhammakkhandhehi paribāhiro hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na āsāṭikaṃ hāretā hotī"
      },
      "ti ‘‘uppannaṃ kāmavitakka’’nti evaṃ vutte kāmavitakkādayo na ",
      " vinodeti. So imaṃ akusalavitakkaṃ āsāṭikaṃ ahāretvā vitakkavasiko hutvā vicaranto kammaṭṭhānaṃ gahetvā vaḍḍhetuṃ na sakkoti. So yathā tassa gopālakassa…pe… paribāhiro hoti."
    ],
    "innerText": "Na āsāṭikaṃ hāretā hotīti ‘‘uppannaṃ kāmavitakka’’nti evaṃ vutte kāmavitakkādayo na vinodeti. So imaṃ akusalavitakkaṃ āsāṭikaṃ ahāretvā vitakkavasiko hutvā vicaranto kammaṭṭhānaṃ gahetvā vaḍḍhetuṃ na sakkoti. So yathā tassa gopālakassa…pe… paribāhiro hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na vaṇaṃ paṭicchādetā hotī"
      },
      "ti ‘‘cakkhunā rūpaṃ disvā nimittaggāhī ",
      " hotī’’tiādinā nayena sabbārammaṇesu nimittaṃ gaṇhanto yathā so gopālako vaṇaṃ na paṭicchādeti, evaṃ saṃvaraṃ na sampādeti. So vivaṭadvāro vicaranto kammaṭṭhānaṃ gahetvā vaḍḍhetuṃ na sakkoti…pe… paribāhiro hoti."
    ],
    "innerText": "Na vaṇaṃ paṭicchādetā hotīti ‘‘cakkhunā rūpaṃ disvā nimittaggāhī hotī’’tiādinā nayena sabbārammaṇesu nimittaṃ gaṇhanto yathā so gopālako vaṇaṃ na paṭicchādeti, evaṃ saṃvaraṃ na sampādeti. So vivaṭadvāro vicaranto kammaṭṭhānaṃ gahetvā vaḍḍhetuṃ na sakkoti…pe… paribāhiro hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na dhūmaṃ kattā hotī"
      },
      "ti so gopālako dhūmaṃ viya dhammadesanādhūmaṃ na karoti, dhammakathaṃ vā sarabhaññaṃ vā upanisinnakakathaṃ vā anumodanaṃ vā na karoti, tato naṃ manussā ‘‘bahussuto guṇavā’’ti na jānanti. Te guṇāguṇaṃ ajānanto catūhi paccayehi saṅgahaṃ na karonti. So paccayehi kilamamāno buddhavacanaṃ sajjhāyaṃ kātuṃ vattapaṭivattaṃ pūretuṃ kammaṭṭhānaṃ gahetvā vaḍḍhetuṃ na sakkoti…pe… paribāhiro hoti."
    ],
    "innerText": "Na dhūmaṃ kattā hotīti so gopālako dhūmaṃ viya dhammadesanādhūmaṃ na karoti, dhammakathaṃ vā sarabhaññaṃ vā upanisinnakakathaṃ vā anumodanaṃ vā na karoti, tato naṃ manussā ‘‘bahussuto guṇavā’’ti na jānanti. Te guṇāguṇaṃ ajānanto catūhi paccayehi saṅgahaṃ na karonti. So paccayehi kilamamāno buddhavacanaṃ sajjhāyaṃ kātuṃ vattapaṭivattaṃ pūretuṃ kammaṭṭhānaṃ gahetvā vaḍḍhetuṃ na sakkoti…pe… paribāhiro hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "titthaṃ jānātī"
      },
      "ti titthabhūte bahussutabhikkhū na upasaṅkamati. Anupasaṅkamanto ‘‘idaṃ, bhante, byañjanaṃ kathaṃ ropetabbaṃ? Imassa bhāsitassa ko attho? Imasmiṃ ṭhāne pāḷi kiṃ vadati? Imasmiṃ ṭhāne attho kiṃ dīpetī’’ti evaṃ na paripucchati na paripañhati, na jānāpetīti attho. Tassa te evaṃ aparipucchitā avivaṭañceva na vivaranti, bhājetvā na dassenti, anuttānīkatañca na uttāniṃ karonti, apākaṭaṃ na pākaṭaṃ karonti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anekavihitesu ca kaṅkhāṭhāniyesu dhammesū"
      },
      "ti anekavidhāsu kaṅkhāsu ekakaṅkhampi na paṭivinodenti. Kaṅkhāyeva hi kaṅkhāṭhāniyā dhammā ",
      " nāma. Tattha ekaṃ kaṅkhampi na nīharantīti attho. So evaṃ bahussutatitthaṃ anupasaṅkamitvā sakaṅkho kammaṭṭhānaṃ gahetvā vaḍḍhetuṃ na sakkoti. Yathā vā so gopālako titthaṃ na jānāti, evaṃ ayampi bhikkhu dhammatitthaṃ na jānāti. Ajānanto avisaye pañhaṃ pucchati, ābhidhammikaṃ upasaṅkamitvā kappiyākappiyaṃ pucchati, vinayadharaṃ upasaṅkamitvā rūpārūpaparicchedaṃ pucchati. Te avisaye puṭṭhā kathetuṃ na sakkonti. So attanā sakaṅkho kammaṭṭhānaṃ gahetvā vaḍḍhetuṃ na sakkoti…pe… paribāhiro hoti."
    ],
    "innerText": "Natitthaṃ jānātīti titthabhūte bahussutabhikkhū na upasaṅkamati. Anupasaṅkamanto ‘‘idaṃ, bhante, byañjanaṃ kathaṃ ropetabbaṃ? Imassa bhāsitassa ko attho? Imasmiṃ ṭhāne pāḷi kiṃ vadati? Imasmiṃ ṭhāne attho kiṃ dīpetī’’ti evaṃ na paripucchati na paripañhati, na jānāpetīti attho. Tassa te evaṃ aparipucchitā avivaṭañceva na vivaranti, bhājetvā na dassenti, anuttānīkatañca na uttāniṃ karonti, apākaṭaṃ na pākaṭaṃ karonti. Anekavihitesu ca kaṅkhāṭhāniyesu dhammesūti anekavidhāsu kaṅkhāsu ekakaṅkhampi na paṭivinodenti. Kaṅkhāyeva hi kaṅkhāṭhāniyā dhammā nāma. Tattha ekaṃ kaṅkhampi na nīharantīti attho. So evaṃ bahussutatitthaṃ anupasaṅkamitvā sakaṅkho kammaṭṭhānaṃ gahetvā vaḍḍhetuṃ na sakkoti. Yathā vā so gopālako titthaṃ na jānāti, evaṃ ayampi bhikkhu dhammatitthaṃ na jānāti. Ajānanto avisaye pañhaṃ pucchati, ābhidhammikaṃ upasaṅkamitvā kappiyākappiyaṃ pucchati, vinayadharaṃ upasaṅkamitvā rūpārūpaparicchedaṃ pucchati. Te avisaye puṭṭhā kathetuṃ na sakkonti. So attanā sakaṅkho kammaṭṭhānaṃ gahetvā vaḍḍhetuṃ na sakkoti…pe… paribāhiro hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pītaṃ jānātī"
      },
      "ti yathā so gopālako pītāpītaṃ na jānāti, evaṃ dhammūpasañhitaṃ pāmojjaṃ na jānāti na labhati. Savanamayaṃ puññakiriyavatthuṃ nissāya ānisaṃsaṃ na vindati, dhammassavanaggaṃ gantvā sakkaccaṃ na suṇāti, nisinno niddāyati, kathaṃ katheti, aññavihitako hoti. So sakkaccaṃ dhammaṃ assuṇanto kammaṭṭhānaṃ gahetvā vaḍḍhetuṃ na sakkoti…pe… paribāhiro hoti."
    ],
    "innerText": "Napītaṃ jānātīti yathā so gopālako pītāpītaṃ na jānāti, evaṃ dhammūpasañhitaṃ pāmojjaṃ na jānāti na labhati. Savanamayaṃ puññakiriyavatthuṃ nissāya ānisaṃsaṃ na vindati, dhammassavanaggaṃ gantvā sakkaccaṃ na suṇāti, nisinno niddāyati, kathaṃ katheti, aññavihitako hoti. So sakkaccaṃ dhammaṃ assuṇanto kammaṭṭhānaṃ gahetvā vaḍḍhetuṃ na sakkoti…pe… paribāhiro hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na vīthiṃ jānātī"
      },
      "ti so gopālako maggāmaggaṃ viya ‘‘ayaṃ lokiyo, ayaṃ lokuttaro’’ti ariyaṃ aṭṭhaṅgikaṃ maggaṃ yathābhūtaṃ nappajānāti. Ajānanto lokiyamagge abhinivisitvā lokuttaraṃ nibbattetuṃ na sakkoti…pe… paribāhiro hoti."
    ],
    "innerText": "Na vīthiṃ jānātīti so gopālako maggāmaggaṃ viya ‘‘ayaṃ lokiyo, ayaṃ lokuttaro’’ti ariyaṃ aṭṭhaṅgikaṃ maggaṃ yathābhūtaṃ nappajānāti. Ajānanto lokiyamagge abhinivisitvā lokuttaraṃ nibbattetuṃ na sakkoti…pe… paribāhiro hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na gocarakusalo hotī"
      },
      "ti so gopālako pañcāhikasattāhikacāre viya cattāro satipaṭṭhāne ‘‘ime lokiyā, ime lokuttarā’’ti yathābhūtaṃ nappajānāti. Ajānanto sukhumaṭṭhānesu attano ñāṇaṃ carāpetvā lokiyasatipaṭṭhāne abhinivisitvā lokuttaraṃ nibbattetuṃ na sakkoti…pe… paribāhiro hoti."
    ],
    "innerText": "Na gocarakusalo hotīti so gopālako pañcāhikasattāhikacāre viya cattāro satipaṭṭhāne ‘‘ime lokiyā, ime lokuttarā’’ti yathābhūtaṃ nappajānāti. Ajānanto sukhumaṭṭhānesu attano ñāṇaṃ carāpetvā lokiyasatipaṭṭhāne abhinivisitvā lokuttaraṃ nibbattetuṃ na sakkoti…pe… paribāhiro hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anavasesadohī"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hotī"
      },
      "ti paṭiggahaṇe mattaṃ ajānanto anavasesaṃ duhati. Niddesavāre panassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhihaṭṭhuṃ pavārentī"
      },
      "ti abhiharitvā pavārenti. Ettha dve abhihārā vācābhihāro ca, paccayābhihāro ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vācābhihāro"
      },
      " nāma manussā bhikkhussa santikaṃ gantvā ‘‘vadeyyātha, bhante, yenattho’’ti pavārenti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paccayābhihāro"
      },
      " nāma vatthādīni vā sappinavanītaphāṇitādīni vā gahetvā bhikkhussa santikaṃ gantvā ‘‘gaṇhatha, bhante, yāvatakena attho’’ti vadanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatra bhikkhu mattaṃ na jānātī"
      },
      "ti bhikkhu tesu paccayesu pamāṇaṃ na jānāti. ‘‘Dāyakassa vaso veditabbo, deyyadhammassa vaso veditabbo, attano thāmo veditabbo’’ti iminā nayena pamāṇayuttakaṃ aggahetvā yaṃ āharanti, taṃ sabbaṃ gaṇhātīti attho. Manussā vippaṭisārino na puna abhiharitvā pavārenti. So paccayehi kilamanto kammaṭṭhānaṃ gahetvā vaḍḍhetuṃ na sakkoti…pe… paribāhiro hoti."
    ],
    "innerText": "Anavasesadohīhotīti paṭiggahaṇe mattaṃ ajānanto anavasesaṃ duhati. Niddesavāre panassa abhihaṭṭhuṃ pavārentīti abhiharitvā pavārenti. Ettha dve abhihārā vācābhihāro ca, paccayābhihāro ca. Vācābhihāro nāma manussā bhikkhussa santikaṃ gantvā ‘‘vadeyyātha, bhante, yenattho’’ti pavārenti. Paccayābhihāro nāma vatthādīni vā sappinavanītaphāṇitādīni vā gahetvā bhikkhussa santikaṃ gantvā ‘‘gaṇhatha, bhante, yāvatakena attho’’ti vadanti. Tatra bhikkhu mattaṃ na jānātīti bhikkhu tesu paccayesu pamāṇaṃ na jānāti. ‘‘Dāyakassa vaso veditabbo, deyyadhammassa vaso veditabbo, attano thāmo veditabbo’’ti iminā nayena pamāṇayuttakaṃ aggahetvā yaṃ āharanti, taṃ sabbaṃ gaṇhātīti attho. Manussā vippaṭisārino na puna abhiharitvā pavārenti. So paccayehi kilamanto kammaṭṭhānaṃ gahetvā vaḍḍhetuṃ na sakkoti…pe… paribāhiro hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Te na atirekapūjāya pūjetā hotī"
      },
      "ti so gopālako mahāusabhe viya there bhikkhū imāya āvi ceva raho ca mettākāyakammādikāya atirekapūjāya na pūjeti. Tato therā ‘‘ime ",
      " amhesu garucittīkāraṃ na karontī’’ti navake bhikkhū dvīhi saṅgahehi na saṅgaṇhanti, neva dhammasaṅgahena saṅgaṇhanti, na āmisasaṅgahena, cīvarena vā pattena vā pattapariyāpannena vā vasanaṭṭhānena vā kilamantepi nappaṭijagganti, pāḷiṃ vā aṭṭhakathaṃ vā dhammakathābandhaṃ ",
      " vā guḷhaganthaṃ vā na sikkhāpenti. Navakā therānaṃ santikā sabbaso ime dve saṅgahe alabhamānā imasmiṃ sāsane patiṭṭhātuṃ na sakkonti. Yathā tassa gopālakassa gogaṇo na vaḍḍhati, evaṃ sīlādīhi na vaḍḍhanti. Yathā ca so gopālako pañcahi gorasehi, evaṃ pañcahi dhammakkhandhehi paribāhirā honti. Sukkapakkho kaṇhapakkhe vuttavipallāsavasena yojetvā veditabbo."
    ],
    "innerText": "Te na atirekapūjāya pūjetā hotīti so gopālako mahāusabhe viya there bhikkhū imāya āvi ceva raho ca mettākāyakammādikāya atirekapūjāya na pūjeti. Tato therā ‘‘ime amhesu garucittīkāraṃ na karontī’’ti navake bhikkhū dvīhi saṅgahehi na saṅgaṇhanti, neva dhammasaṅgahena saṅgaṇhanti, na āmisasaṅgahena, cīvarena vā pattena vā pattapariyāpannena vā vasanaṭṭhānena vā kilamantepi nappaṭijagganti, pāḷiṃ vā aṭṭhakathaṃ vā dhammakathābandhaṃ vā guḷhaganthaṃ vā na sikkhāpenti. Navakā therānaṃ santikā sabbaso ime dve saṅgahe alabhamānā imasmiṃ sāsane patiṭṭhātuṃ na sakkonti. Yathā tassa gopālakassa gogaṇo na vaḍḍhati, evaṃ sīlādīhi na vaḍḍhanti. Yathā ca so gopālako pañcahi gorasehi, evaṃ pañcahi dhammakkhandhehi paribāhirā honti. Sukkapakkho kaṇhapakkhe vuttavipallāsavasena yojetvā veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Anussativaggo dutiyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Manorathapūraṇiyā aṅguttaranikāya-aṭṭhakathāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ekādasakanipātassa saṃvaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Nigamanakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettāvatā ",
      " ca –"
    ],
    "innerText": "Ettāvatā ca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Āyācito ",
      " sumatinā therena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhadantajotipālena"
      },
      ";"
    ],
    "innerText": "Āyācito sumatinā therena bhadantajotipālena;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kañcipurādīsu mayā pubbe saddhiṃ vasantena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Varatambapaṇṇidīpe mahāvihāramhi vasanakālepi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pākaṃ gate viya dume valañjamānamhi saddhamme."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Pāraṃ piṭakattayasāgarassa gantvā ṭhitena sumatinā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Parisuddhājīvenābhiyācito jīvakenāpi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Dhammakathāya ",
      " nipuṇaparamanikāyassaṭṭhakathaṃ āraddho;"
    ],
    "innerText": "Dhammakathāya nipuṇaparamanikāyassaṭṭhakathaṃ āraddho;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yamahaṃ cirakālaṭṭhitimicchanto sāsanavarassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sā hi mahāaṭṭhakathāya sāramādāya niṭṭhitā esā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Catunavutiparimāṇāya pāḷiyā bhāṇavārehi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sabbāgamasaṃvaṇṇanamanoratho pūrito ca me yasmā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Etāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "manorathapūraṇī"
      },
      "ti nāmaṃ tato assā."
    ],
    "innerText": "Etāya manorathapūraṇīti nāmaṃ tato assā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Ekūnasaṭṭhimatto ",
      " visuddhimaggopi bhāṇavārehi;"
    ],
    "innerText": "Ekūnasaṭṭhimatto visuddhimaggopi bhāṇavārehi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Atthappakāsanatthāya āgamānaṃ kato yasmā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Tasmā tena sahāyaṃ gāthāgaṇanānayena aṭṭhakathā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tīhādhikadiyaḍḍhasataṃ viññeyyā bhāṇavārānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Tīhādhikadiyaḍḍhasatappamāṇamiti bhāṇavārato esā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Samayaṃ pakāsayantī mahāvihārādhivāsīnaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Mūlaṭṭhakathāsāraṃ ādāya mayā imaṃ karontena;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yaṃ puññamupacitaṃ tena hotu loko sadā sukhitoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Paramavisuddhasaddhābuddhivīriyappaṭimaṇḍitena ",
      " sīlācārajjavamaddavādiguṇasamudayasamuditena sakasamayasamayantaragahanajjhogāhanasamatthena paññāveyyattiyasamannāgatena tipiṭakapariyattippabhede sāṭṭhakathe satthu sāsane appaṭihatañāṇappabhāvena mahāveyyākaraṇena karaṇasampattijanitasukhaviniggatamadhurodāravacanalāvaṇṇayuttena yuttamuttavādinā vādīvarena mahākavinā pabhinnapaṭisambhidāparivāre chaḷabhiññādippabhedaguṇappaṭimaṇḍite uttarimanussadhamme suppatiṭṭhitabuddhīnaṃ therānaṃ theravaṃsappadīpānaṃ mahāvihāravāsīnaṃ vaṃsālaṅkārabhūtena suvipulavisuddhabuddhinā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "buddhaghoso"
      },
      "ti ",
      " garūhi gahitanāmadheyyena therena katā ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "manorathapūraṇī"
      },
      " nāma aṅguttaranikāyaṭṭhakathā –"
    ],
    "innerText": "Paramavisuddhasaddhābuddhivīriyappaṭimaṇḍitena sīlācārajjavamaddavādiguṇasamudayasamuditena sakasamayasamayantaragahanajjhogāhanasamatthena paññāveyyattiyasamannāgatena tipiṭakapariyattippabhede sāṭṭhakathe satthu sāsane appaṭihatañāṇappabhāvena mahāveyyākaraṇena karaṇasampattijanitasukhaviniggatamadhurodāravacanalāvaṇṇayuttena yuttamuttavādinā vādīvarena mahākavinā pabhinnapaṭisambhidāparivāre chaḷabhiññādippabhedaguṇappaṭimaṇḍite uttarimanussadhamme suppatiṭṭhitabuddhīnaṃ therānaṃ theravaṃsappadīpānaṃ mahāvihāravāsīnaṃ vaṃsālaṅkārabhūtena suvipulavisuddhabuddhinā buddhaghosoti garūhi gahitanāmadheyyena therena katā ayaṃ manorathapūraṇī nāma aṅguttaranikāyaṭṭhakathā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Tāva tiṭṭhatu lokasmiṃ, lokanittharaṇesinaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dassentī kulaputtānaṃ, nayaṃ cittavisuddhiyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Yāva buddhoti nāmampi, suddhacittassa tādino;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Lokamhi lokajeṭṭhassa, pavattati mahesinoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Manorathapūraṇī nāma"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Aṅguttaranikāya-aṭṭhakathā sabbākārena niṭṭhitā."
  }
]