[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "(21) 1. Karajakāyavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Paṭhamanirayasaggasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "211"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": " . ''Dasahi"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": ", bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. Katamehi dasahi? Idha, bhikkhave, ekacco pāṇātipātī hoti luddo lohitapāṇi hatapahate niviṭṭho adayāpanno sabbapāṇabhūtesu "
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[natthettha pāṭhabhedo]"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": " ."
      }
    ],
    "innerText": "211 . ''Dasahi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. Katamehi dasahi? Idha, bhikkhave, ekacco pāṇātipātī hoti luddo lohitapāṇi hatapahate niviṭṭho adayāpanno sabbapāṇabhūtesu [natthettha pāṭhabhedo] ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "''Adinnādayī hoti. Yaṃ taṃ parassa paravittūpakaraṇaṃ gāmagataṃ vā araññagataṃ vā, taṃ adinnaṃ theyyasaṅkhātaṃ ādātā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "''Kāmesu micchācārī hoti. Yā tā māturakkhitā piturakkhitā mātāpiturakkhitā bhaturakkhitā bhaginirakkhitā ñātirakkhitā gottarakkhitā dhammarakkhitā sasāmikā saparidaṇḍā antamaso mālāguḷaparikkhittāpi, tathārūpāsu cārittaṃ āpajjitā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "''Musāvādī hoti. Sabhaggato vāparisgato vā ñātimajjhagato vā pūgamajjhagato vā rājakulamajjhagato vā abhinīto sakkhipuṭṭho – 'ehambho purisa, yaṃ jānāsi taṃ vadehī'ti, so ajānaṃ vā āha 'jānāmī'ti, jānaṃ vā āha 'na jānāmī'ti, apassaṃ vā āha 'passāmī'ti, passaṃ vā āha 'na passāmī'ti. Iti attahetu vā parahetu vā āmisakiñcikkhahetu vā sampajānamusā bhāsitā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "''Pisuṇavāco hoti – ito sutvā amutra akkhātā imesaṃ bhedāya, amutra vā sutvā imesaṃ akkhātā amūsaṃ bhedāya. Iti samaggānaṃ vā bhettā bhinnānaṃ vā anuppadātā vaggārāmo"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "vaggarato vagganandī, vaggakaraṇiṃ vācaṃ bhāsitā hoti."
      }
    ],
    "innerText": "''Pisuṇavāco hoti – ito sutvā amutra akkhātā imesaṃ bhedāya, amutra vā sutvā imesaṃ akkhātā amūsaṃ bhedāya. Iti samaggānaṃ vā bhettā bhinnānaṃ vā anuppadātā vaggārāmovaggarato vagganandī, vaggakaraṇiṃ vācaṃ bhāsitā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "''Pharusavāco"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "hoti – yā sā vācā aṇḍakā kakkasā parakaṭukā parābhisajjanī kodhasāmantā asamādhisaṃvattanikā, tathārūpiṃ vācaṃ bhāsitā hoti."
      }
    ],
    "innerText": "''Pharusavācohoti – yā sā vācā aṇḍakā kakkasā parakaṭukā parābhisajjanī kodhasāmantā asamādhisaṃvattanikā, tathārūpiṃ vācaṃ bhāsitā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "''Samphappalāpī"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "hoti akālavadī abhūtavādī anatthavādī adhammavādī avinayavādī, anidhānavatiṃ vācaṃ bhāsitā hoti akālena anapadesaṃ apariyantavadiṃ anatthasaṃhitaṃ."
      }
    ],
    "innerText": "''Samphappalāpīhoti akālavadī abhūtavādī anatthavādī adhammavādī avinayavādī, anidhānavatiṃ vācaṃ bhāsitā hoti akālena anapadesaṃ apariyantavadiṃ anatthasaṃhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "''Abhijjhālu"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "hoti. Yaṃ taṃ parassa paravittūpakaraṇaṃ taṃ abhijjhātā hoti – 'aho vata yaṃ parassa taṃ mama assā'ti."
      }
    ],
    "innerText": "''Abhijjhāluhoti. Yaṃ taṃ parassa paravittūpakaraṇaṃ taṃ abhijjhātā hoti – 'aho vata yaṃ parassa taṃ mama assā'ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "''Byāpannacitto hoti paduṭṭhamanasaṅkappo – 'ime sattā haññantu vā bajjhantu vā ucchijjantu vā vinassantu vā mā vā ahesu'nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "''Micchādiṭṭhiko hoti viparītadassano – 'natthi dinnaṃ, natthi yiṭṭhaṃ, natthi hutaṃ, natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko, natthi ayaṃ loko, natthi paro loko, natthi mātā, natthi pitā, natthi sattā opapātikā, natthi loke samaṇabrāṇā sammaggatā sammāpaṭipannā ye imañca lokaṃ parañ ca lokaṃ sayaṃ abhiñña sacchikatvā pavedentī'ti. Imehi kho, bhikkhave, dasahi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Dasahi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge. Katamehi dasahi? Idha, bhikkhave, ekacco pāṇātipātaṃ pahāya pāṇātipātā paṭivirato hoti nihitadaṇḍo nihitasattho lajjī dayāpanno, sabbapāṇabhūtahitānukampī viharati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Adinnādānaṃ pahāya adinnādānā paṭivirato hoti. Yaṃ taṃ parassa paravittūpakaraṇaṃ gāmagataṃ vā araññagataṃ vā, na ",
      " taṃ adinnaṃ theyyasaṅkhātaṃ ādātā hoti."
    ],
    "innerText": "‘‘Adinnādānaṃ pahāya adinnādānā paṭivirato hoti. Yaṃ taṃ parassa paravittūpakaraṇaṃ gāmagataṃ vā araññagataṃ vā, na taṃ adinnaṃ theyyasaṅkhātaṃ ādātā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kāmesumicchācāraṃ pahāya kāmesumicchācārā paṭivirato hoti. Yā tā māturakkhitā…pe… antamaso mālāguḷaparikkhittāpi, tathārūpāsu na cārittaṃ āpajjitā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Musāvādaṃ ",
      " pahāya musāvādā paṭivirato hoti. Sabhaggato vā parisaggato vā ñātimajjhagato vā pūgamajjhagato vā rājakulamajjhagato vā abhinīto sakkhipuṭṭho – ‘ehambho purisa, yaṃ jānāsi taṃ vadehī’ti, so ajānaṃ vā āha ‘na jānāmī’ti, jānaṃ vā āha ‘jānāmī’ti, apassaṃ vā āha ‘na passāmī’ti, passaṃ vā āha ‘passāmī’ti. Iti attahetu vā parahetu vā āmisakiñcikkhahetu vā na sampajānamusā ",
      " bhāsitā hoti."
    ],
    "innerText": "‘‘Musāvādaṃ pahāya musāvādā paṭivirato hoti. Sabhaggato vā parisaggato vā ñātimajjhagato vā pūgamajjhagato vā rājakulamajjhagato vā abhinīto sakkhipuṭṭho – ‘ehambho purisa, yaṃ jānāsi taṃ vadehī’ti, so ajānaṃ vā āha ‘na jānāmī’ti, jānaṃ vā āha ‘jānāmī’ti, apassaṃ vā āha ‘na passāmī’ti, passaṃ vā āha ‘passāmī’ti. Iti attahetu vā parahetu vā āmisakiñcikkhahetu vā na sampajānamusā bhāsitā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Pisuṇavācaṃ ",
      " pahāya pisuṇāya vācāya paṭivirato hoti – na ito sutvā amutra akkhātā imesaṃ bhedāya, amutra vā sutvā imesaṃ akkhātā amūsaṃ bhedāya. Iti bhinnānaṃ vā sandhātā sahitānaṃ vā anuppadātā samaggārāmo samaggarato samagganandī, samaggakaraṇiṃ vācaṃ bhāsitā hoti."
    ],
    "innerText": "‘‘Pisuṇavācaṃ pahāya pisuṇāya vācāya paṭivirato hoti – na ito sutvā amutra akkhātā imesaṃ bhedāya, amutra vā sutvā imesaṃ akkhātā amūsaṃ bhedāya. Iti bhinnānaṃ vā sandhātā sahitānaṃ vā anuppadātā samaggārāmo samaggarato samagganandī, samaggakaraṇiṃ vācaṃ bhāsitā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Pharusavācaṃ pahāya pharusāya vācāya paṭivirato hoti. Yā sā vācā nelā kaṇṇasukhā pemanīyā hadayaṅgamā porī bahujanakantā bahujanamanāpā, tathārūpiṃ vācaṃ bhāsitā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Samphappalāpaṃ pahāya samphappalāpā paṭivirato hoti kālavādī bhūtavādī, atthavādī dhammavādī vinayavādī, nidhānavatiṃ vācaṃ bhāsitā hoti kālena sāpadesaṃ pariyantavatiṃ atthasaṃhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Anabhijjhālu hoti ",
      ". Yaṃ taṃ parassa paravittūpakaraṇaṃ taṃ anabhijjhātā hoti – ‘aho vata yaṃ parassa taṃ mama assā’ti."
    ],
    "innerText": "‘‘Anabhijjhālu hoti . Yaṃ taṃ parassa paravittūpakaraṇaṃ taṃ anabhijjhātā hoti – ‘aho vata yaṃ parassa taṃ mama assā’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Abyāpannacitto hoti appaduṭṭhamanasaṅkappo – ‘ime sattā averā hontu abyāpajjā anīghā, sukhī attānaṃ pariharantū’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sammādiṭṭhiko hoti aviparītadassano – ‘atthi dinnaṃ, atthi yiṭṭhaṃ, atthi hutaṃ, atthi sukaṭadukkaṭānaṃ kammānaṃ phalaṃ vipāko, atthi ayaṃ loko, atthi paro loko, atthi mātā, atthi pitā, atthi sattā opapātikā, atthi loke samaṇabrāhmaṇā sammaggatā sammāpaṭipannā ",
      " ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedentī’ti. Imehi kho, bhikkhave, dasahi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge’’ti. Paṭhamaṃ."
    ],
    "innerText": "‘‘Sammādiṭṭhiko hoti aviparītadassano – ‘atthi dinnaṃ, atthi yiṭṭhaṃ, atthi hutaṃ, atthi sukaṭadukkaṭānaṃ kammānaṃ phalaṃ vipāko, atthi ayaṃ loko, atthi paro loko, atthi mātā, atthi pitā, atthi sattā opapātikā, atthi loke samaṇabrāhmaṇā sammaggatā sammāpaṭipannā ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedentī’ti. Imehi kho, bhikkhave, dasahi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge’’ti. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Dutiyanirayasaggasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "212"
      },
      ". ‘‘Dasahi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. Katamehi dasahi? Idha, bhikkhave, ekacco pāṇātipātī hoti luddo lohitapāṇi hatapahate niviṭṭho adayāpanno sabbapāṇabhūtesu."
    ],
    "innerText": "212. ‘‘Dasahi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. Katamehi dasahi? Idha, bhikkhave, ekacco pāṇātipātī hoti luddo lohitapāṇi hatapahate niviṭṭho adayāpanno sabbapāṇabhūtesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Adinnādāyī hoti… kāmesumicchācārī hoti… musāvādī hoti… pisuṇavāco hoti… pharusavāco hoti ",
      " … samphappalāpī hoti… abhijjhālu ",
      " hoti… byāpannacitto hoti… micchādiṭṭhiko hoti viparītadassano – ‘natthi dinnaṃ…pe… sayaṃ abhiññā sacchikatvā pavedentī’ti. Imehi kho, bhikkhave, dasahi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye."
    ],
    "innerText": "‘‘Adinnādāyī hoti… kāmesumicchācārī hoti… musāvādī hoti… pisuṇavāco hoti… pharusavāco hoti … samphappalāpī hoti… abhijjhālu hoti… byāpannacitto hoti… micchādiṭṭhiko hoti viparītadassano – ‘natthi dinnaṃ…pe… sayaṃ abhiññā sacchikatvā pavedentī’ti. Imehi kho, bhikkhave, dasahi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Dasahi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge. Katamehi dasahi? Idha, bhikkhave, ekacco pāṇātipātaṃ pahāya pāṇātipātā paṭivirato hoti nihitadaṇḍo nihitasattho lajjī dayāpanno, sabbapāṇabhūtahitānukampī viharati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Adinnādānaṃ pahāya adinnādānā paṭivirato hoti… kāmesumicchācāraṃ pahāya kāmesumicchācārā paṭivirato hoti… musāvādaṃ pahāya musāvādā paṭivirato hoti… pisuṇaṃ vācaṃ pahāya pisuṇāya vācāya paṭivirato hoti… pharusaṃ vācaṃ pahāya pharusāya vācāya paṭivirato hoti… samphappalāpaṃ pahāya samphappalāpā paṭivirato hoti… anabhijjhālu hoti… abyāpannacitto hoti… sammādiṭṭhiko hoti aviparītadassano – ‘atthi dinnaṃ…pe… ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedentī’ti. Imehi kho, bhikkhave, dasahi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge’’ti. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Mātugāmasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "213"
      },
      ". ‘‘Dasahi ",
      ", bhikkhave, dhammehi samannāgato mātugāmo yathābhataṃ nikkhitto evaṃ niraye. Katamehi dasahi? Pāṇātipātī ",
      " hoti…pe… adinnādāyī hoti… kāmesumicchācārī hoti… musāvādī hoti… pisuṇavāco hoti… pharusavāco hoti… samphappalāpī hoti… abhijjhālu hoti… byāpannacitto hoti… micchādiṭṭhiko hoti…. Imehi kho, bhikkhave, dasahi dhammehi samannāgato mātugāmo yathābhataṃ nikkhitto evaṃ niraye."
    ],
    "innerText": "213. ‘‘Dasahi , bhikkhave, dhammehi samannāgato mātugāmo yathābhataṃ nikkhitto evaṃ niraye. Katamehi dasahi? Pāṇātipātī hoti…pe… adinnādāyī hoti… kāmesumicchācārī hoti… musāvādī hoti… pisuṇavāco hoti… pharusavāco hoti… samphappalāpī hoti… abhijjhālu hoti… byāpannacitto hoti… micchādiṭṭhiko hoti…. Imehi kho, bhikkhave, dasahi dhammehi samannāgato mātugāmo yathābhataṃ nikkhitto evaṃ niraye."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Dasahi, bhikkhave, dhammehi samannāgato mātugāmo yathābhataṃ nikkhitto evaṃ sagge. Katamehi dasahi? Pāṇātipātā paṭivirato hoti…pe… adinnādānā paṭivirato hoti… kāmesumicchācārā paṭivirato hoti… musāvādā paṭivirato hoti… pisuṇāya vācāya paṭivirato ",
      " hoti… pharusāya vācāya paṭivirato hoti… samphappalāpā paṭivirato hoti… anabhijjhālu hoti… abyāpannacitto hoti… sammādiṭṭhiko hoti… imehi kho, bhikkhave, dasahi dhammehi samannāgato mātugāmo yathābhataṃ nikkhitto evaṃ sagge’’ti. Tatiyaṃ."
    ],
    "innerText": "‘‘Dasahi, bhikkhave, dhammehi samannāgato mātugāmo yathābhataṃ nikkhitto evaṃ sagge. Katamehi dasahi? Pāṇātipātā paṭivirato hoti…pe… adinnādānā paṭivirato hoti… kāmesumicchācārā paṭivirato hoti… musāvādā paṭivirato hoti… pisuṇāya vācāya paṭivirato hoti… pharusāya vācāya paṭivirato hoti… samphappalāpā paṭivirato hoti… anabhijjhālu hoti… abyāpannacitto hoti… sammādiṭṭhiko hoti… imehi kho, bhikkhave, dasahi dhammehi samannāgato mātugāmo yathābhataṃ nikkhitto evaṃ sagge’’ti. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Upāsikāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "214"
      },
      ". ‘‘Dasahi, bhikkhave, dhammehi samannāgatā upāsikā yathābhataṃ nikkhittā evaṃ niraye. Katamehi dasahi? Pāṇātipātinī hoti…pe… micchādiṭṭhikā ",
      " hoti…. Imehi kho, bhikkhave, dasahi dhammehi samannāgatā upāsikā yathābhataṃ nikkhittā evaṃ niraye."
    ],
    "innerText": "214. ‘‘Dasahi, bhikkhave, dhammehi samannāgatā upāsikā yathābhataṃ nikkhittā evaṃ niraye. Katamehi dasahi? Pāṇātipātinī hoti…pe… micchādiṭṭhikā hoti…. Imehi kho, bhikkhave, dasahi dhammehi samannāgatā upāsikā yathābhataṃ nikkhittā evaṃ niraye."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Dasahi, bhikkhave, dhammehi samannāgatā upāsikā yathābhataṃ nikkhittā evaṃ sagge. Katamehi dasahi? Pāṇātipātā paṭiviratā hoti…pe… sammādiṭṭhikā hoti…. Imehi kho, bhikkhave, dasahi dhammehi samannāgatā upāsikā yathābhataṃ nikkhittā evaṃ sagge’’. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Visāradasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "215"
      },
      ". ‘‘Dasahi ",
      ", bhikkhave, dhammehi samannāgatā upāsikā avisāradā agāraṃ ajjhāvasati. Katamehi dasahi? Pāṇātipātinī hoti… adinnādāyinī hoti… kāmesumicchācārinī hoti… musāvādinī hoti… pisuṇāvācā hoti… pharusavācā hoti… samphappalāpinī hoti… abhijjhālunī hoti… byāpannacittā hoti… micchādiṭṭhikā hoti…. Imehi kho, bhikkhave, dasahi dhammehi samannāgatā upāsikā avisāradā agāraṃ ajjhāvasati."
    ],
    "innerText": "215. ‘‘Dasahi , bhikkhave, dhammehi samannāgatā upāsikā avisāradā agāraṃ ajjhāvasati. Katamehi dasahi? Pāṇātipātinī hoti… adinnādāyinī hoti… kāmesumicchācārinī hoti… musāvādinī hoti… pisuṇāvācā hoti… pharusavācā hoti… samphappalāpinī hoti… abhijjhālunī hoti… byāpannacittā hoti… micchādiṭṭhikā hoti…. Imehi kho, bhikkhave, dasahi dhammehi samannāgatā upāsikā avisāradā agāraṃ ajjhāvasati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Dasahi, bhikkhave, dhammehi samannāgatā upāsikā visāradā agāraṃ ajjhāvasati. Katamehi dasahi? Pāṇātipātā paṭiviratā hoti… adinnādānā paṭiviratā hoti… kāmesumicchācārā paṭiviratā hoti… musāvādā paṭiviratā hoti… pisuṇāya vācāya paṭiviratā hoti… pharusāya vācāya paṭiviratā hoti… samphappalāpā paṭiviratā hoti… anabhijjhālunī hoti… abyāpannacittā hoti… sammādiṭṭhikā hoti…. Imehi kho, bhikkhave, dasahi dhammehi samannāgatā upāsikā visāradā agāraṃ ajjhāvasatī’’ti. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Saṃsappanīyasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "216"
      },
      ". ‘‘Saṃsappanīyapariyāyaṃ ",
      " vo, bhikkhave, dhammapariyāyaṃ desessāmi. Taṃ suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –"
    ],
    "innerText": "216. ‘‘Saṃsappanīyapariyāyaṃ vo, bhikkhave, dhammapariyāyaṃ desessāmi. Taṃ suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamo ca, bhikkhave, saṃsappanīyapariyāyo dhammapariyāyo? Kammassakā, bhikkhave, sattā kammadāyādā kammayonī kammabandhū kammapaṭisaraṇā, yaṃ kammaṃ karonti – kalyāṇaṃ vā pāpakaṃ vā – tassa dāyādā bhavanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idha ",
      ", bhikkhave, ekacco pāṇātipātī ",
      " hoti luddo lohitapāṇi hatapahate niviṭṭho, adayāpanno ",
      " sabbapāṇabhūtesu. So saṃsappati kāyena, saṃsappati vācāya, saṃsappati manasā. Tassa jimhaṃ kāyakammaṃ hoti, jimhaṃ vacīkammaṃ, jimhaṃ manokammaṃ, jimhā gati, jimhupapatti."
    ],
    "innerText": "‘‘Idha , bhikkhave, ekacco pāṇātipātī hoti luddo lohitapāṇi hatapahate niviṭṭho, adayāpanno sabbapāṇabhūtesu. So saṃsappati kāyena, saṃsappati vācāya, saṃsappati manasā. Tassa jimhaṃ kāyakammaṃ hoti, jimhaṃ vacīkammaṃ, jimhaṃ manokammaṃ, jimhā gati, jimhupapatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Jimhagatikassa kho panāhaṃ, bhikkhave, jimhupapattikassa dvinnaṃ gatīnaṃ aññataraṃ gatiṃ vadāmi – ye vā ekantadukkhā nirayā yā vā saṃsappajātikā tiracchānayoni. Katamā ca sā, bhikkhave, saṃsappajātikā tiracchānayoni? Ahi vicchikā satapadī nakulā biḷārā mūsikā ulūkā, ye vā panaññepi keci tiracchānayonikā sattā manusse disvā saṃsappanti. Iti kho, bhikkhave, bhūtā bhūtassa upapatti hoti. Yaṃ karoti tena upapajjati. Upapannamenaṃ phassā phusanti. Evamahaṃ, bhikkhave, ‘kammadāyādā sattā’ti vadāmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idha pana, bhikkhave, ekacco adinnādāyī hoti…pe… kāmesumicchācārī hoti… musāvādī hoti… pisuṇavāco hoti… pharusavāco hoti… samphappalāpī hoti… abhijjhālu hoti… byāpannacitto hoti… micchādiṭṭhiko hoti viparītadassano – ‘natthi dinnaṃ…pe… sayaṃ abhiññā sacchikatvā pavedentī’ti. So saṃsappati kāyena, saṃsappati vācāya, saṃsappati manasā. Tassa jimhaṃ kāyakammaṃ ",
      " hoti, jimhaṃ vacīkammaṃ, jimhaṃ manokammaṃ, jimhā gati, jimhupapatti ",
      "."
    ],
    "innerText": "‘‘Idha pana, bhikkhave, ekacco adinnādāyī hoti…pe… kāmesumicchācārī hoti… musāvādī hoti… pisuṇavāco hoti… pharusavāco hoti… samphappalāpī hoti… abhijjhālu hoti… byāpannacitto hoti… micchādiṭṭhiko hoti viparītadassano – ‘natthi dinnaṃ…pe… sayaṃ abhiññā sacchikatvā pavedentī’ti. So saṃsappati kāyena, saṃsappati vācāya, saṃsappati manasā. Tassa jimhaṃ kāyakammaṃ hoti, jimhaṃ vacīkammaṃ, jimhaṃ manokammaṃ, jimhā gati, jimhupapatti ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Jimhagatikassa kho panāhaṃ, bhikkhave, jimhupapattikassa dvinnaṃ gatīnaṃ aññataraṃ gatiṃ vadāmi – ye vā ekantadukkhā nirayā yā vā saṃsappajātikā tiracchānayoni. Katamā ca sā, bhikkhave, saṃsappajātikā tiracchānayoni ",
      "? Ahi vicchikā satapadī nakulā biḷārā mūsikā ulūkā, ye vā panaññepi keci tiracchānayonikā sattā manusse disvā saṃsappanti. Iti kho, bhikkhave, bhūtā bhūtassa upapatti hoti, yaṃ karoti tena upapajjati. Upapannamenaṃ phassā phusanti. Evamahaṃ, bhikkhave, ‘kammadāyādā sattā’ti vadāmi. Kammassakā, bhikkhave, sattā kammadāyādā kammayonī kammabandhū kammapaṭisaraṇā, yaṃ kammaṃ karonti – kalyāṇaṃ vā pāpakaṃ vā – tassa dāyādā bhavanti."
    ],
    "innerText": "‘‘Jimhagatikassa kho panāhaṃ, bhikkhave, jimhupapattikassa dvinnaṃ gatīnaṃ aññataraṃ gatiṃ vadāmi – ye vā ekantadukkhā nirayā yā vā saṃsappajātikā tiracchānayoni. Katamā ca sā, bhikkhave, saṃsappajātikā tiracchānayoni ? Ahi vicchikā satapadī nakulā biḷārā mūsikā ulūkā, ye vā panaññepi keci tiracchānayonikā sattā manusse disvā saṃsappanti. Iti kho, bhikkhave, bhūtā bhūtassa upapatti hoti, yaṃ karoti tena upapajjati. Upapannamenaṃ phassā phusanti. Evamahaṃ, bhikkhave, ‘kammadāyādā sattā’ti vadāmi. Kammassakā, bhikkhave, sattā kammadāyādā kammayonī kammabandhū kammapaṭisaraṇā, yaṃ kammaṃ karonti – kalyāṇaṃ vā pāpakaṃ vā – tassa dāyādā bhavanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idha, bhikkhave, ekacco pāṇātipātaṃ pahāya pāṇātipātā paṭivirato hoti nihitadaṇḍo ",
      " nihitasattho, lajjī dayāpanno sabbapāṇabhūtahitānukampī viharati. So na saṃsappati kāyena, na saṃsappati vācāya, na saṃsappati manasā. Tassa uju kāyakammaṃ hoti, uju vacīkammaṃ, uju manokammaṃ, uju gati, ujupapatti."
    ],
    "innerText": "‘‘Idha, bhikkhave, ekacco pāṇātipātaṃ pahāya pāṇātipātā paṭivirato hoti nihitadaṇḍo nihitasattho, lajjī dayāpanno sabbapāṇabhūtahitānukampī viharati. So na saṃsappati kāyena, na saṃsappati vācāya, na saṃsappati manasā. Tassa uju kāyakammaṃ hoti, uju vacīkammaṃ, uju manokammaṃ, uju gati, ujupapatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ujugatikassa kho panāhaṃ, bhikkhave, ujupapattikassa dvinnaṃ gatīnaṃ aññataraṃ gatiṃ vadāmi – ye vā ekantasukhā saggā yāni vā pana tāni uccākulāni khattiyamahāsālakulāni vā brāhmaṇamahāsālakulāni vā gahapatimahāsālakulāni vā aḍḍhāni mahaddhanāni mahābhogāni pahūtajātarūparajatāni pahūtavittūpakaraṇāni pahūtadhanadhaññāni. Iti kho, bhikkhave, bhūtā bhūtassa ",
      " upapatti hoti. Yaṃ karoti tena upapajjati. Upapannamenaṃ phassā phusanti. Evamahaṃ, bhikkhave, ‘kammadāyādā sattā’ti vadāmi."
    ],
    "innerText": "‘‘Ujugatikassa kho panāhaṃ, bhikkhave, ujupapattikassa dvinnaṃ gatīnaṃ aññataraṃ gatiṃ vadāmi – ye vā ekantasukhā saggā yāni vā pana tāni uccākulāni khattiyamahāsālakulāni vā brāhmaṇamahāsālakulāni vā gahapatimahāsālakulāni vā aḍḍhāni mahaddhanāni mahābhogāni pahūtajātarūparajatāni pahūtavittūpakaraṇāni pahūtadhanadhaññāni. Iti kho, bhikkhave, bhūtā bhūtassa upapatti hoti. Yaṃ karoti tena upapajjati. Upapannamenaṃ phassā phusanti. Evamahaṃ, bhikkhave, ‘kammadāyādā sattā’ti vadāmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idha pana, bhikkhave, ekacco adinnādānaṃ pahāya adinnādānā paṭivirato hoti…pe… kāmesumicchācārā paṭivirato hoti… musāvādaṃ ",
      " pahāya musāvādā paṭivirato hoti… pisuṇaṃ vācaṃ pahāya pisuṇāya vācāya paṭivirato hoti… pharusaṃ vācaṃ pahāya pharusāya vācāya paṭivirato hoti… samphappalāpaṃ pahāya samphappalāpā paṭivirato hoti… anabhijjhālu hoti… abyāpannacitto hoti… sammādiṭṭhiko hoti aviparītadassano – ‘atthi dinnaṃ…pe… ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedentī’ti. So na saṃsappati kāyena, na saṃsappati vācāya, na saṃsappati manasā. Tassa uju kāyakammaṃ hoti, uju vacīkammaṃ, uju manokammaṃ, uju gati, ujupapatti."
    ],
    "innerText": "‘‘Idha pana, bhikkhave, ekacco adinnādānaṃ pahāya adinnādānā paṭivirato hoti…pe… kāmesumicchācārā paṭivirato hoti… musāvādaṃ pahāya musāvādā paṭivirato hoti… pisuṇaṃ vācaṃ pahāya pisuṇāya vācāya paṭivirato hoti… pharusaṃ vācaṃ pahāya pharusāya vācāya paṭivirato hoti… samphappalāpaṃ pahāya samphappalāpā paṭivirato hoti… anabhijjhālu hoti… abyāpannacitto hoti… sammādiṭṭhiko hoti aviparītadassano – ‘atthi dinnaṃ…pe… ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedentī’ti. So na saṃsappati kāyena, na saṃsappati vācāya, na saṃsappati manasā. Tassa uju kāyakammaṃ hoti, uju vacīkammaṃ, uju manokammaṃ, uju gati, ujupapatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ujugatikassa ",
      " kho pana ahaṃ, bhikkhave, ujupapattikassa dvinnaṃ gatīnaṃ aññataraṃ gatiṃ vadāmi – ye vā ekantasukhā saggā yāni vā pana tāni uccākulāni khattiyamahāsālakulāni vā brāhmaṇamahāsālakulāni vā gahapatimahāsālakulāni vā aḍḍhāni mahaddhanāni mahābhogāni pahūtajātarūparajatāni pahūtavittūpakaraṇāni pahūtadhanadhaññāni. Iti kho, bhikkhave, bhūtā bhūtassa ",
      " upapatti hoti. Yaṃ karoti tena upapajjati. Upapannamenaṃ phassā phusanti. Evamahaṃ, bhikkhave, ‘kammadāyādā sattā’ti vadāmi."
    ],
    "innerText": "‘‘Ujugatikassa kho pana ahaṃ, bhikkhave, ujupapattikassa dvinnaṃ gatīnaṃ aññataraṃ gatiṃ vadāmi – ye vā ekantasukhā saggā yāni vā pana tāni uccākulāni khattiyamahāsālakulāni vā brāhmaṇamahāsālakulāni vā gahapatimahāsālakulāni vā aḍḍhāni mahaddhanāni mahābhogāni pahūtajātarūparajatāni pahūtavittūpakaraṇāni pahūtadhanadhaññāni. Iti kho, bhikkhave, bhūtā bhūtassa upapatti hoti. Yaṃ karoti tena upapajjati. Upapannamenaṃ phassā phusanti. Evamahaṃ, bhikkhave, ‘kammadāyādā sattā’ti vadāmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kammassakā ",
      ", bhikkhave, sattā kammadāyādā kammayonī kammabandhū kammapaṭisaraṇā, yaṃ kammaṃ karonti – kalyāṇaṃ vā pāpakaṃ vā – tassa dāyādā bhavanti. Ayaṃ kho so, bhikkhave, saṃsappanīyapariyāyo dhammapariyāyo’’ti. Chaṭṭhaṃ."
    ],
    "innerText": "‘‘Kammassakā , bhikkhave, sattā kammadāyādā kammayonī kammabandhū kammapaṭisaraṇā, yaṃ kammaṃ karonti – kalyāṇaṃ vā pāpakaṃ vā – tassa dāyādā bhavanti. Ayaṃ kho so, bhikkhave, saṃsappanīyapariyāyo dhammapariyāyo’’ti. Chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Paṭhamasañcetanikasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "217"
      },
      ". ‘‘Nāhaṃ ",
      ", bhikkhave, sañcetanikānaṃ kammānaṃ katānaṃ upacitānaṃ appaṭisaṃveditvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[appaṭisaṃviditvā (sī. syā. pī.)]"
      },
      " byantībhāvaṃ vadāmi. Tañca kho diṭṭheva dhamme upapajje vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[upapajjaṃ vā (ka.) a. ni. 6.63 passitabbaṃ, upapajja vā (ma. ni. 3.303)]"
      },
      " apare vā pariyāye. Na tvevāhaṃ, bhikkhave, sañcetanikānaṃ kammānaṃ katānaṃ upacitānaṃ appaṭisaṃveditvā dukkhassantakiriyaṃ vadāmi."
    ],
    "innerText": "217. ‘‘Nāhaṃ , bhikkhave, sañcetanikānaṃ kammānaṃ katānaṃ upacitānaṃ appaṭisaṃveditvā [appaṭisaṃviditvā (sī. syā. pī.)] byantībhāvaṃ vadāmi. Tañca kho diṭṭheva dhamme upapajje vā [upapajjaṃ vā (ka.) a. ni. 6.63 passitabbaṃ, upapajja vā (ma. ni. 3.303)] apare vā pariyāye. Na tvevāhaṃ, bhikkhave, sañcetanikānaṃ kammānaṃ katānaṃ upacitānaṃ appaṭisaṃveditvā dukkhassantakiriyaṃ vadāmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tatra, bhikkhave, tividhā kāyakammantasandosabyāpatti akusalasañcetanikā dukkhudrayā dukkhavipākā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[akusalaṃ sañcetanikaṃ dukkhudrayaṃ dukkhavipākaṃ (ka.)]"
      },
      " hoti; catubbidhā vacīkammantasandosabyāpatti akusalasañcetanikā dukkhudrayā dukkhavipākā hoti; tividhā manokammantasandosabyāpatti akusalasañcetanikā dukkhudrayā dukkhavipākā hoti."
    ],
    "innerText": "‘‘Tatra, bhikkhave, tividhā kāyakammantasandosabyāpatti akusalasañcetanikā dukkhudrayā dukkhavipākā [akusalaṃ sañcetanikaṃ dukkhudrayaṃ dukkhavipākaṃ (ka.)] hoti; catubbidhā vacīkammantasandosabyāpatti akusalasañcetanikā dukkhudrayā dukkhavipākā hoti; tividhā manokammantasandosabyāpatti akusalasañcetanikā dukkhudrayā dukkhavipākā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, tividhā kāyakammantasandosabyāpatti akusalasañcetanikā dukkhudrayā dukkhavipākā hoti? Idha, bhikkhave, ekacco pāṇātipātī hoti luddo lohitapāṇi hatapahate niviṭṭho adayāpanno sabbapāṇabhūtesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Adinnādāyī ",
      " hoti. Yaṃ taṃ parassa paravittūpakaraṇaṃ gāmagataṃ vā araññagataṃ vā, taṃ adinnaṃ theyyasaṅkhātaṃ ādātā hoti."
    ],
    "innerText": "‘‘Adinnādāyī hoti. Yaṃ taṃ parassa paravittūpakaraṇaṃ gāmagataṃ vā araññagataṃ vā, taṃ adinnaṃ theyyasaṅkhātaṃ ādātā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kāmesumicchācārī hoti. Yā tā māturakkhitā…pe… antamaso mālāguḷaparikkhittāpi ",
      ", tathārūpāsu cārittaṃ āpajjitā hoti. Evaṃ kho, bhikkhave, tividhā kāyakammantasandosabyāpatti akusalasañcetanikā dukkhudrayā dukkhavipākā hoti."
    ],
    "innerText": "‘‘Kāmesumicchācārī hoti. Yā tā māturakkhitā…pe… antamaso mālāguḷaparikkhittāpi , tathārūpāsu cārittaṃ āpajjitā hoti. Evaṃ kho, bhikkhave, tividhā kāyakammantasandosabyāpatti akusalasañcetanikā dukkhudrayā dukkhavipākā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, catubbidhā vacīkammantasandosabyāpatti akusalasañcetanikā dukkhudrayā ",
      " dukkhavipākā hoti? Idha ",
      ", bhikkhave, ekacco musāvādī hoti. Sabhaggato vā parisaggato vā ñātimajjhagato vā pūgamajjhagato vā rājakulamajjhagato vā abhinīto sakkhipuṭṭho ‘ehambho purisa, yaṃ jānāsi taṃ vadehī’ti, so ajānaṃ vā āha ‘jānāmī’ti, jānaṃ vā āha ‘na jānāmī’ti, apassaṃ vā āha ‘passāmī’ti, passaṃ vā āha ‘na passāmī’ti, iti attahetu vā parahetu vā āmisakiñcikkhahetu vā sampajānamusā bhāsitā hoti."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, catubbidhā vacīkammantasandosabyāpatti akusalasañcetanikā dukkhudrayā dukkhavipākā hoti? Idha , bhikkhave, ekacco musāvādī hoti. Sabhaggato vā parisaggato vā ñātimajjhagato vā pūgamajjhagato vā rājakulamajjhagato vā abhinīto sakkhipuṭṭho ‘ehambho purisa, yaṃ jānāsi taṃ vadehī’ti, so ajānaṃ vā āha ‘jānāmī’ti, jānaṃ vā āha ‘na jānāmī’ti, apassaṃ vā āha ‘passāmī’ti, passaṃ vā āha ‘na passāmī’ti, iti attahetu vā parahetu vā āmisakiñcikkhahetu vā sampajānamusā bhāsitā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Pisuṇavāco hoti. Ito sutvā amutra akkhātā imesaṃ bhedāya, amutra vā sutvā imesaṃ akkhātā amūsaṃ bhedāya. Iti samaggānaṃ vā bhettā bhinnānaṃ vā anuppadātā vaggārāmo vaggarato vagganandī, vaggakaraṇiṃ vācaṃ bhāsitā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Pharusavāco hoti. Yā sā vācā aṇḍakā kakkasā parakaṭukā parābhisajjanī kodhasāmantā. Asamādhisaṃvattanikā, tathārūpiṃ vācaṃ bhāsitā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Samphappalāpī hoti akālavādī abhūtavādī anatthavādī adhammavādī avinayavādī, anidhānavatiṃ vācaṃ bhāsitā hoti akālena anapadesaṃ apariyantavatiṃ anatthasaṃhitaṃ. Evaṃ kho, bhikkhave, catubbidhā vacīkammantasandosabyāpatti akusalasañcetanikā dukkhudrayā dukkhavipākā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca ",
      ", bhikkhave, tividhā manokammantasandosabyāpatti akusalasañcetanikā dukkhudrayā dukkhavipākā hoti? Idha, bhikkhave, ekacco abhijjhālu hoti. Yaṃ taṃ parassa paravittūpakaraṇaṃ, taṃ abhijjhātā hoti – ‘aho vata, yaṃ parassa taṃ mama assā’ti."
    ],
    "innerText": "‘‘Kathañca , bhikkhave, tividhā manokammantasandosabyāpatti akusalasañcetanikā dukkhudrayā dukkhavipākā hoti? Idha, bhikkhave, ekacco abhijjhālu hoti. Yaṃ taṃ parassa paravittūpakaraṇaṃ, taṃ abhijjhātā hoti – ‘aho vata, yaṃ parassa taṃ mama assā’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Byāpannacitto ",
      " hoti paduṭṭhamanasaṅkappo – ‘ime sattā haññantu vā bajjhantu vā ucchijjantu vā vinassantu vā mā vā ahesu’nti."
    ],
    "innerText": "‘‘Byāpannacitto hoti paduṭṭhamanasaṅkappo – ‘ime sattā haññantu vā bajjhantu vā ucchijjantu vā vinassantu vā mā vā ahesu’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Micchādiṭṭhiko hoti viparītadassano – ‘natthi dinnaṃ…pe. ",
      "… ye imañca lokaṃ parañca lokaṃ ",
      " sayaṃ abhiññā sacchikatvā pavedentī’ti. Evaṃ kho, bhikkhave, tividhā manokammantasandosabyāpatti akusalasañcetanikā dukkhudrayā dukkhavipākā hoti."
    ],
    "innerText": "Micchādiṭṭhiko hoti viparītadassano – ‘natthi dinnaṃ…pe. … ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedentī’ti. Evaṃ kho, bhikkhave, tividhā manokammantasandosabyāpatti akusalasañcetanikā dukkhudrayā dukkhavipākā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tividha kāyakammantasandosabyāpatti akusalasañcetanikāhetu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[… sañcetanikahetu (ka.)]"
      },
      " vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti; catubbidhavacīkammantasandosabyāpatti akusalasañcetanikāhetu vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti; tividhamanokammantasandosabyāpatti akusalasañcetanikāhetu vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti."
    ],
    "innerText": "‘‘Tividha kāyakammantasandosabyāpatti akusalasañcetanikāhetu [… sañcetanikahetu (ka.)] vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti; catubbidhavacīkammantasandosabyāpatti akusalasañcetanikāhetu vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti; tividhamanokammantasandosabyāpatti akusalasañcetanikāhetu vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, bhikkhave, apaṇṇako maṇi uddhaṃkhitto yena yeneva patiṭṭhāti suppatiṭṭhitaṃyeva patiṭṭhāti ",
      "; evamevaṃ kho, bhikkhave, tividhakāyakammantasandosabyāpatti akusalasañcetanikāhetu vā sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti; catubbidhavacīkammantasandosabyāpatti akusalasañcetanikāhetu vā sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti; tividhamanokammantasandosabyāpatti akusalasañcetanikāhetu vā sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjantīti."
    ],
    "innerText": "‘‘Seyyathāpi, bhikkhave, apaṇṇako maṇi uddhaṃkhitto yena yeneva patiṭṭhāti suppatiṭṭhitaṃyeva patiṭṭhāti ; evamevaṃ kho, bhikkhave, tividhakāyakammantasandosabyāpatti akusalasañcetanikāhetu vā sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti; catubbidhavacīkammantasandosabyāpatti akusalasañcetanikāhetu vā sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti; tividhamanokammantasandosabyāpatti akusalasañcetanikāhetu vā sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjantīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Nāhaṃ, bhikkhave, sañcetanikānaṃ kammānaṃ katānaṃ upacitānaṃ appaṭisaṃveditvā byantībhāvaṃ vadāmi, tañca kho diṭṭheva dhamme upapajje vā apare vā pariyāye. Na tvevāhaṃ, bhikkhave, sañcetanikānaṃ kammānaṃ katānaṃ upacitānaṃ appaṭisaṃveditvā dukkhassantakiriyaṃ vadāmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tatra, bhikkhave, tividhā kāyakammantasampatti kusalasañcetanikā sukhudrayā sukhavipākā hoti; catubbidhā vacīkammantasampatti kusalasañcetanikā sukhudrayā sukhavipākā hoti; tividhā manokammantasampatti ",
      " kusalasañcetanikā sukhudrayā sukhavipākā hoti."
    ],
    "innerText": "‘‘Tatra, bhikkhave, tividhā kāyakammantasampatti kusalasañcetanikā sukhudrayā sukhavipākā hoti; catubbidhā vacīkammantasampatti kusalasañcetanikā sukhudrayā sukhavipākā hoti; tividhā manokammantasampatti kusalasañcetanikā sukhudrayā sukhavipākā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca ",
      ", bhikkhave, tividhā kāyakammantasampatti kusalasañcetanikā sukhudrayā sukhavipākā ",
      " hoti? Idha, bhikkhave, ekacco pāṇātipātaṃ pahāya pāṇātipātā paṭivirato hoti nihitadaṇḍo nihitasattho lajjī dayāpanno, sabbapāṇabhūtahitānukampī viharati…pe…."
    ],
    "innerText": "‘‘Kathañca , bhikkhave, tividhā kāyakammantasampatti kusalasañcetanikā sukhudrayā sukhavipākā hoti? Idha, bhikkhave, ekacco pāṇātipātaṃ pahāya pāṇātipātā paṭivirato hoti nihitadaṇḍo nihitasattho lajjī dayāpanno, sabbapāṇabhūtahitānukampī viharati…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Adinnādānaṃ pahāya, adinnādānā paṭivirato hoti. Yaṃ taṃ parassa paravittūpakaraṇaṃ gāmagataṃ vā araññagataṃ vā, na taṃ adinnaṃ theyyasaṅkhātaṃ ādātā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kāmesumicchācāraṃ pahāya, kāmesumicchācārā paṭivirato hoti. Yā tā māturakkhitā ",
      " …pe… antamaso mālāguḷaparikkhittāpi, tathārūpāsu na cārittaṃ āpajjitā hoti. Evaṃ kho, bhikkhave, tividhā kāyakammantasampatti kusalasañcetanikā sukhudrayā sukhavipākā hoti."
    ],
    "innerText": "‘‘Kāmesumicchācāraṃ pahāya, kāmesumicchācārā paṭivirato hoti. Yā tā māturakkhitā …pe… antamaso mālāguḷaparikkhittāpi, tathārūpāsu na cārittaṃ āpajjitā hoti. Evaṃ kho, bhikkhave, tividhā kāyakammantasampatti kusalasañcetanikā sukhudrayā sukhavipākā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, catubbidhā vacīkammantasampatti kusalasañcetanikā sukhudrayā sukhavipākā hoti? Idha, bhikkhave, ekacco musāvādaṃ pahāya musāvādā paṭivirato hoti. Sabhaggato vā parisaggato vā ñātimajjhagato vā pūgamajjhagato vā rājakulamajjhagato vā abhinīto sakkhipuṭṭho ‘ehambho purisa, yaṃ jānāsi taṃ vadehī’ti, so ajānaṃ vā āha ‘na jānāmī’ti, jānaṃ vā āha ‘jānāmī’ti, apassaṃ vā āha ‘na passāmī’ti, passaṃ vā āha ‘passāmī’ti, iti attahetu vā parahetu vā āmisakiñcikkhahetu vā na sampajānamusā bhāsitā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Pisuṇaṃ vācaṃ pahāya, pisuṇāya vācāya paṭivirato hoti – na ito sutvā amutra akkhātā imesaṃ bhedāya, amutra vā sutvā na imesaṃ akkhātā amūsaṃ bhedāya. Iti bhinnānaṃ vā sandhātā ",
      " sahitānaṃ vā anuppadātā samaggārāmo samaggarato samagganandiṃ, samaggakaraṇiṃ vācaṃ bhāsitā hoti."
    ],
    "innerText": "‘‘Pisuṇaṃ vācaṃ pahāya, pisuṇāya vācāya paṭivirato hoti – na ito sutvā amutra akkhātā imesaṃ bhedāya, amutra vā sutvā na imesaṃ akkhātā amūsaṃ bhedāya. Iti bhinnānaṃ vā sandhātā sahitānaṃ vā anuppadātā samaggārāmo samaggarato samagganandiṃ, samaggakaraṇiṃ vācaṃ bhāsitā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Pharusaṃ vācaṃ pahāya, pharusāya vācāya paṭivirato hoti. Yā sā vācā nelā kaṇṇasukhā pemanīyā hadayaṅgamā porī bahujanakantā bahujanamanāpā, tathārūpiṃ vācaṃ bhāsitā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Samphappalāpaṃ ",
      " pahāya, samphappalāpā paṭivirato hoti kālavādī bhūtavādī atthavādī dhammavādī vinayavādī, nidhānavatiṃ ",
      " vācaṃ bhāsitā hoti kālena ",
      " sāpadesaṃ pariyantavatiṃ atthasaṃhitaṃ. Evaṃ kho, bhikkhave, catubbidhā vacīkammantasampatti kusalasañcetanikā sukhudrayā sukhavipākā hoti."
    ],
    "innerText": "‘‘Samphappalāpaṃ pahāya, samphappalāpā paṭivirato hoti kālavādī bhūtavādī atthavādī dhammavādī vinayavādī, nidhānavatiṃ vācaṃ bhāsitā hoti kālena sāpadesaṃ pariyantavatiṃ atthasaṃhitaṃ. Evaṃ kho, bhikkhave, catubbidhā vacīkammantasampatti kusalasañcetanikā sukhudrayā sukhavipākā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, tividhā manokammantasampatti kusalasañcetanikā sukhudrayā sukhavipākā hoti? Idha, bhikkhave, ekacco anabhijjhālu hoti. Yaṃ taṃ parassa paravittūpakaraṇaṃ taṃ anabhijjhātā hoti – ‘aho vata, yaṃ parassa taṃ mamassā’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Abyāpannacitto hoti appaduṭṭhamanasaṅkappo – ‘ime sattā averā hontu abyāpajjā anīghā, sukhī attānaṃ pariharantū’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sammādiṭṭhiko hoti aviparītadassano – ‘atthi dinnaṃ, atthi yiṭṭhaṃ…pe… ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedentī’ti. Evaṃ kho, bhikkhave, tividhā manokammantasampatti kusalasañcetanikā sukhudrayā sukhavipākā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tividhakāyakammantasampattikusalasañcetanikāhetu vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti; catubbidhavacīkammantasampattikusalasañcetanikāhetu vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti; tividhamanokammantasampattikusalasañcetanikāhetu vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, bhikkhave, apaṇṇako maṇi uddhaṃkhitto yena yeneva patiṭṭhāti suppatiṭṭhitaṃyeva patiṭṭhāti; evamevaṃ kho, bhikkhave, tividhakāyakammantasampattikusalasañcetanikāhetu ",
      " vā sattā ",
      " kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti; catubbidhavacīkammantasampattikusalasañcetanikāhetu vā sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti; tividhamanokammantasampattikusalasañcetanikāhetu vā sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Nāhaṃ, bhikkhave, sañcetanikānaṃ ",
      " kammānaṃ katānaṃ upacitānaṃ appaṭisaṃveditvā byantībhāvaṃ vadāmi. Tañca kho diṭṭheva dhamme upapajje vā apare vā pariyāye. Na tvevāhaṃ, bhikkhave, sañcetanikānaṃ kammānaṃ katānaṃ upacitānaṃ appaṭisaṃveditvā dukkhassantakiriyaṃ vadāmī’’ti. Sattamaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[aṭṭhakathāyaṃ pana aṭṭhamasuttampi ettheva pariyāpannaṃ viya saṃvaṇṇanā dissati]"
      }
    ],
    "innerText": "‘‘Seyyathāpi, bhikkhave, apaṇṇako maṇi uddhaṃkhitto yena yeneva patiṭṭhāti suppatiṭṭhitaṃyeva patiṭṭhāti; evamevaṃ kho, bhikkhave, tividhakāyakammantasampattikusalasañcetanikāhetu vā sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti; catubbidhavacīkammantasampattikusalasañcetanikāhetu vā sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti; tividhamanokammantasampattikusalasañcetanikāhetu vā sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Nāhaṃ, bhikkhave, sañcetanikānaṃ kammānaṃ katānaṃ upacitānaṃ appaṭisaṃveditvā byantībhāvaṃ vadāmi. Tañca kho diṭṭheva dhamme upapajje vā apare vā pariyāye. Na tvevāhaṃ, bhikkhave, sañcetanikānaṃ kammānaṃ katānaṃ upacitānaṃ appaṭisaṃveditvā dukkhassantakiriyaṃ vadāmī’’ti. Sattamaṃ. [aṭṭhakathāyaṃ pana aṭṭhamasuttampi ettheva pariyāpannaṃ viya saṃvaṇṇanā dissati]"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Dutiyasañcetanikasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "218"
      },
      ". ‘‘Nāhaṃ ",
      ", bhikkhave, sañcetanikānaṃ kammānaṃ katānaṃ upacitānaṃ appaṭisaṃveditvā byantībhāvaṃ vadāmi, tañca kho diṭṭheva dhamme upapajje vā apare vā pariyāye. Na tvevāhaṃ, bhikkhave, sañcetanikānaṃ kammānaṃ katānaṃ upacitānaṃ appaṭisaṃveditvā dukkhassantakiriyaṃ vadāmi."
    ],
    "innerText": "218. ‘‘Nāhaṃ , bhikkhave, sañcetanikānaṃ kammānaṃ katānaṃ upacitānaṃ appaṭisaṃveditvā byantībhāvaṃ vadāmi, tañca kho diṭṭheva dhamme upapajje vā apare vā pariyāye. Na tvevāhaṃ, bhikkhave, sañcetanikānaṃ kammānaṃ katānaṃ upacitānaṃ appaṭisaṃveditvā dukkhassantakiriyaṃ vadāmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tatra, bhikkhave, tividhā kāyakammantasandosabyāpatti akusalasañcetanikā dukkhudrayā dukkhavipākā hoti; catubbidhā vacīkammantasandosabyāpatti akusalasañcetanikā dukkhudrayā dukkhavipākā hoti; tividhā manokammantasandosabyāpatti akusalasañcetanikā dukkhudrayā dukkhavipākā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, tividhā kāyakammantasandosabyāpatti akusalasañcetanikā dukkhudrayā dukkhavipākā hoti…pe… evaṃ kho, bhikkhave, tividhā kāyakammantasandosabyāpatti akusalasañcetanikā dukkhudrayā dukkhavipākā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, catubbidhā vacīkammantasandosabyāpatti akusalasañcetanikā dukkhudrayā dukkhavipākā hoti…pe… evaṃ ",
      " kho, bhikkhave, catubbidhā vacīkammantasandosabyāpatti akusalasañcetanikā dukkhudrayā dukkhavipākā ",
      " hoti."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, catubbidhā vacīkammantasandosabyāpatti akusalasañcetanikā dukkhudrayā dukkhavipākā hoti…pe… evaṃ kho, bhikkhave, catubbidhā vacīkammantasandosabyāpatti akusalasañcetanikā dukkhudrayā dukkhavipākā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, tividhā manokammantasandosabyāpatti akusalasañcetanikā dukkhudrayā dukkhavipākā hoti…pe… evaṃ kho, bhikkhave, tividhā manokammantasandosabyāpatti akusalasañcetanikā dukkhudrayā dukkhavipākā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tividha ",
      " kāyakammantasandosabyāpatti akusalasañcetanikāhetu vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti, catubbidhavacīkammanta…pe… tividhamanokammantasandosabyāpatti akusalasañcetanikāhetu vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti."
    ],
    "innerText": "‘‘Tividha kāyakammantasandosabyāpatti akusalasañcetanikāhetu vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti, catubbidhavacīkammanta…pe… tividhamanokammantasandosabyāpatti akusalasañcetanikāhetu vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Nāhaṃ, bhikkhave, sañcetanikānaṃ kammānaṃ katānaṃ upacitānaṃ appaṭisaṃveditvā byantībhāvaṃ vadāmi, tañca kho diṭṭheva dhamme upapajje vā apare vā pariyāye ",
      ". Na tvevāhaṃ, bhikkhave, sañcetanikānaṃ kammānaṃ katānaṃ upacitānaṃ appaṭisaṃveditvā dukkhassantakiriyaṃ vadāmi."
    ],
    "innerText": "‘‘Nāhaṃ, bhikkhave, sañcetanikānaṃ kammānaṃ katānaṃ upacitānaṃ appaṭisaṃveditvā byantībhāvaṃ vadāmi, tañca kho diṭṭheva dhamme upapajje vā apare vā pariyāye . Na tvevāhaṃ, bhikkhave, sañcetanikānaṃ kammānaṃ katānaṃ upacitānaṃ appaṭisaṃveditvā dukkhassantakiriyaṃ vadāmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tatra kho, bhikkhave, tividhā kāyakammantasampatti kusalasañcetanikā sukhudrayā sukhavipākā hoti; catubbidhā vacīkammantasampatti kusalasañcetanikā sukhudrayā sukhavipākā hoti; tividhā manokammantasampatti kusalasañcetanikā sukhudrayā sukhavipākā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, tividhā kāyakammantasampatti kusalasañcetanikā sukhudrayā sukhavipākā hoti…pe… evaṃ kho, bhikkhave, tividhā kāyakammantasampatti kusalasañcetanikā sukhudrayā sukhavipākā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca ",
      ", bhikkhave, catubbidhā vacīkammantasampatti kusalasañcetanikā sukhudrayā sukhavipākā hoti…pe… evaṃ kho, bhikkhave, catubbidhā vacīkammantasampatti kusalasañcetanikā sukhudrayā sukhavipākā hoti ",
      "."
    ],
    "innerText": "‘‘Kathañca , bhikkhave, catubbidhā vacīkammantasampatti kusalasañcetanikā sukhudrayā sukhavipākā hoti…pe… evaṃ kho, bhikkhave, catubbidhā vacīkammantasampatti kusalasañcetanikā sukhudrayā sukhavipākā hoti ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, tividhā manokammantasampatti kusalasañcetanikā sukhudrayā sukhavipākā hoti…pe… evaṃ kho, bhikkhave, tividhā manokammantasampatti kusalasañcetanikā sukhudrayā sukhavipākā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tividhakāyakammantasampattikusalasañcetanikāhetu vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti; catubbidhavacīkammantasampatti…pe… tividhamanokammantasampattikusalasañcetanikāhetu ",
      " vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti…pe…. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[upapajjanti. (syā. ka.) tathā sati ‘‘nāhaṃ bhikkhave sañcetanikāna’’ miccādinā vuccamānavacanena saha ekasuttanti gahetabbaṃ. peyyālena pana purimasutte viya nigamanaṃ dassitaṃ]"
      },
      " Aṭṭhamaṃ."
    ],
    "innerText": "‘‘Tividhakāyakammantasampattikusalasañcetanikāhetu vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti; catubbidhavacīkammantasampatti…pe… tividhamanokammantasampattikusalasañcetanikāhetu vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti…pe…. [upapajjanti. (syā. ka.) tathā sati ‘‘nāhaṃ bhikkhave sañcetanikāna’’ miccādinā vuccamānavacanena saha ekasuttanti gahetabbaṃ. peyyālena pana purimasutte viya nigamanaṃ dassitaṃ] Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Karajakāyasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "219"
      },
      ". ‘‘Nāhaṃ, bhikkhave, sañcetanikānaṃ kammānaṃ katānaṃ upacitānaṃ appaṭisaṃveditvā byantībhāvaṃ vadāmi, tañca kho diṭṭheva dhamme upapajje vā apare vā pariyāye. Na tvevāhaṃ, bhikkhave, sañcetanikānaṃ kammānaṃ katānaṃ upacitānaṃ appaṭisaṃveditvā dukkhassantakiriyaṃ vadāmi."
    ],
    "innerText": "219. ‘‘Nāhaṃ, bhikkhave, sañcetanikānaṃ kammānaṃ katānaṃ upacitānaṃ appaṭisaṃveditvā byantībhāvaṃ vadāmi, tañca kho diṭṭheva dhamme upapajje vā apare vā pariyāye. Na tvevāhaṃ, bhikkhave, sañcetanikānaṃ kammānaṃ katānaṃ upacitānaṃ appaṭisaṃveditvā dukkhassantakiriyaṃ vadāmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sa kho so, bhikkhave, ariyasāvako evaṃ vigatābhijjho vigatabyāpādo asammūḷho sampajāno paṭissato mettāsahagatena cetasā ",
      " ekaṃ disaṃ pharitvā viharati tathā dutiyaṃ tathā tatiyaṃ tathā catutthaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[catutthiṃ (?)]"
      },
      ". Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ mettāsahagatena cetasā vipulena mahaggatena ",
      " appamāṇena averena abyāpajjena pharitvā viharati."
    ],
    "innerText": "‘‘Sa kho so, bhikkhave, ariyasāvako evaṃ vigatābhijjho vigatabyāpādo asammūḷho sampajāno paṭissato mettāsahagatena cetasā ekaṃ disaṃ pharitvā viharati tathā dutiyaṃ tathā tatiyaṃ tathā catutthaṃ [catutthiṃ (?)]. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘So evaṃ pajānāti – ‘pubbe kho me idaṃ cittaṃ parittaṃ ahosi abhāvitaṃ, etarahi pana me idaṃ cittaṃ appamāṇaṃ subhāvitaṃ. Yaṃ kho pana kiñci pamāṇakataṃ kammaṃ, na taṃ tatrāvasissati na taṃ tatrāvatiṭṭhatī’ti ",
      "."
    ],
    "innerText": "‘‘So evaṃ pajānāti – ‘pubbe kho me idaṃ cittaṃ parittaṃ ahosi abhāvitaṃ, etarahi pana me idaṃ cittaṃ appamāṇaṃ subhāvitaṃ. Yaṃ kho pana kiñci pamāṇakataṃ kammaṃ, na taṃ tatrāvasissati na taṃ tatrāvatiṭṭhatī’ti ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Taṃ kiṃ maññatha, bhikkhave, daharatagge ce so ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ce ayaṃ (syā.)]"
      },
      " kumāro mettaṃ cetovimuttiṃ bhāveyya, api nu kho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[api nu so (?)]"
      },
      " pāpakammaṃ kareyyā’’ti? ‘‘No hetaṃ, bhante’’."
    ],
    "innerText": "‘‘Taṃ kiṃ maññatha, bhikkhave, daharatagge ce so ayaṃ [ce ayaṃ (syā.)] kumāro mettaṃ cetovimuttiṃ bhāveyya, api nu kho [api nu so (?)] pāpakammaṃ kareyyā’’ti? ‘‘No hetaṃ, bhante’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Akarontaṃ kho pana pāpakammaṃ api nu kho dukkhaṃ phuseyyā’’ti? ‘‘No hetaṃ, bhante. Akarontañhi, bhante, pāpakammaṃ kuto dukkhaṃ phusissatī’’ti!"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Bhāvetabbā kho panāyaṃ, bhikkhave, mettācetovimutti itthiyā vā purisena vā. Itthiyā vā, bhikkhave, purisassa vā nāyaṃ kāyo ādāya gamanīyo. Cittantaro ayaṃ, bhikkhave ",
      ", macco. So evaṃ pajānāti – ‘yaṃ kho me idaṃ kiñci pubbe iminā karajakāyena pāpakammaṃ kataṃ, sabbaṃ taṃ idha vedanīyaṃ; na taṃ anugaṃ bhavissatī’ti. Evaṃ bhāvitā kho, bhikkhave, mettā cetovimutti anāgāmitāya saṃvattati, idha paññassa bhikkhuno uttari ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[uttariṃ (sī. syā. pī.)]"
      },
      " vimuttiṃ appaṭivijjhato."
    ],
    "innerText": "‘‘Bhāvetabbā kho panāyaṃ, bhikkhave, mettācetovimutti itthiyā vā purisena vā. Itthiyā vā, bhikkhave, purisassa vā nāyaṃ kāyo ādāya gamanīyo. Cittantaro ayaṃ, bhikkhave , macco. So evaṃ pajānāti – ‘yaṃ kho me idaṃ kiñci pubbe iminā karajakāyena pāpakammaṃ kataṃ, sabbaṃ taṃ idha vedanīyaṃ; na taṃ anugaṃ bhavissatī’ti. Evaṃ bhāvitā kho, bhikkhave, mettā cetovimutti anāgāmitāya saṃvattati, idha paññassa bhikkhuno uttari [uttariṃ (sī. syā. pī.)] vimuttiṃ appaṭivijjhato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Karuṇāsahagatena cetasā… muditāsahagatena cetasā… upekkhāsahagatena cetasā ekaṃ disaṃ pharitvā viharati tathā dutiyaṃ tathā tatiyaṃ tathā catutthaṃ. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘So evaṃ pajānāti – ‘pubbe kho me idaṃ cittaṃ parittaṃ ahosi abhāvitaṃ, etarahi pana me idaṃ cittaṃ appamāṇaṃ ",
      " subhāvitaṃ. Yaṃ kho pana kiñci pamāṇakataṃ kammaṃ ",
      ", na taṃ tatrāvasissati na taṃ tatrāvatiṭṭhatī’ti."
    ],
    "innerText": "‘‘So evaṃ pajānāti – ‘pubbe kho me idaṃ cittaṃ parittaṃ ahosi abhāvitaṃ, etarahi pana me idaṃ cittaṃ appamāṇaṃ subhāvitaṃ. Yaṃ kho pana kiñci pamāṇakataṃ kammaṃ , na taṃ tatrāvasissati na taṃ tatrāvatiṭṭhatī’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Taṃ ",
      " kiṃ maññatha, bhikkhave, daharatagge ce so ayaṃ kumāro upekkhaṃ cetovimuttiṃ bhāveyya, api nu kho pāpakammaṃ kareyyā’’ti? ‘‘No hetaṃ, bhante’’."
    ],
    "innerText": "‘‘Taṃ kiṃ maññatha, bhikkhave, daharatagge ce so ayaṃ kumāro upekkhaṃ cetovimuttiṃ bhāveyya, api nu kho pāpakammaṃ kareyyā’’ti? ‘‘No hetaṃ, bhante’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Akarontaṃ kho pana pāpakammaṃ api nu kho dukkhaṃ phuseyyā’’ti? ‘‘No hetaṃ, bhante. Akarontañhi, bhante, pāpakammaṃ kuto dukkhaṃ phusissatī’’ti!"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Bhāvetabbā kho panāyaṃ, bhikkhave, upekkhā cetovimutti itthiyā vā purisena vā. Itthiyā vā, bhikkhave, purisassa vā nāyaṃ kāyo ādāya gamanīyo. Cittantaro ayaṃ, bhikkhave, macco. So evaṃ pajānāti – ‘yaṃ kho me idaṃ kiñci pubbe iminā karajakāyena pāpakammaṃ kataṃ, sabbaṃ taṃ idha vedanīyaṃ; na taṃ anugaṃ bhavissatī’ti. Evaṃ bhāvitā kho, bhikkhave, upekkhā cetovimutti anāgāmitāya saṃvattati, idha paññassa bhikkhuno uttari vimuttiṃ appaṭivijjhato’’ti. Navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Adhammacariyāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "220"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[a. ni. 2.16]"
      },
      " Atha ",
      " kho aññataro brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so brāhmaṇo bhagavantaṃ etadavoca – ‘‘ko nu kho, bho gotama, hetu ko paccayo yenamidhekacce sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjantī’’ti? ‘‘Adhammacariyāvisamacariyāhetu kho, brāhmaṇa, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjantī’’ti."
    ],
    "innerText": "220.[a. ni. 2.16] Atha kho aññataro brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so brāhmaṇo bhagavantaṃ etadavoca – ‘‘ko nu kho, bho gotama, hetu ko paccayo yenamidhekacce sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjantī’’ti? ‘‘Adhammacariyāvisamacariyāhetu kho, brāhmaṇa, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjantī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ko pana, bho gotama, hetu ko paccayo ",
      " yenamidhekacce sattā kāyassa bhedā ",
      " paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjantī’’ti? ‘‘Dhammacariyāsamacariyāhetu kho, brāhmaṇa, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjantī’’ti."
    ],
    "innerText": "‘‘Ko pana, bho gotama, hetu ko paccayo yenamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjantī’’ti? ‘‘Dhammacariyāsamacariyāhetu kho, brāhmaṇa, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjantī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Na kho ahaṃ imassa bhoto gotamassa saṃkhittena bhāsitassa vitthārena atthaṃ ājānāmi. Sādhu me bhavaṃ gotamo tathā dhammaṃ desetu yathāhaṃ imassa bhoto gotamassa saṃkhittena bhāsitassa vitthārena atthaṃ ājāneyya’’nti. ‘‘Tena hi, brāhmaṇa, suṇāhi, sādhukaṃ manasi karohi ",
      "; bhāsissāmī’’ti. ‘‘Evaṃ, bho’’ti kho so brāhmaṇo bhagavato paccassosi. Bhagavā etadavoca –"
    ],
    "innerText": "‘‘Na kho ahaṃ imassa bhoto gotamassa saṃkhittena bhāsitassa vitthārena atthaṃ ājānāmi. Sādhu me bhavaṃ gotamo tathā dhammaṃ desetu yathāhaṃ imassa bhoto gotamassa saṃkhittena bhāsitassa vitthārena atthaṃ ājāneyya’’nti. ‘‘Tena hi, brāhmaṇa, suṇāhi, sādhukaṃ manasi karohi ; bhāsissāmī’’ti. ‘‘Evaṃ, bho’’ti kho so brāhmaṇo bhagavato paccassosi. Bhagavā etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tividhā ",
      " kho, brāhmaṇa, kāyena adhammacariyāvisamacariyā hoti; catubbidhā vācāya adhammacariyāvisamacariyā hoti; tividhā manasā adhammacariyāvisamacariyā hoti."
    ],
    "innerText": "‘‘Tividhā kho, brāhmaṇa, kāyena adhammacariyāvisamacariyā hoti; catubbidhā vācāya adhammacariyāvisamacariyā hoti; tividhā manasā adhammacariyāvisamacariyā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, brāhmaṇa, tividhā kāyena adhammacariyāvisamacariyā hoti…pe… evaṃ kho, brāhmaṇa, tividhā kāyena adhammacariyā visamacariyā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, brāhmaṇa, catubbidhā vācāya adhammacariyāvisamacariyā hoti…pe… evaṃ kho, brāhmaṇa, catubbidhā vācāya adhammacariyā visamacariyā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca ",
      ", brāhmaṇa, tividhā manasā adhammacariyāvisamacariyā hoti…pe… evaṃ kho, brāhmaṇa, tividhā manasā adhammacariyāvisamacariyā hoti. Evaṃ adhammacariyāvisamacariyāhetu kho, brāhmaṇa, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti."
    ],
    "innerText": "‘‘Kathañca , brāhmaṇa, tividhā manasā adhammacariyāvisamacariyā hoti…pe… evaṃ kho, brāhmaṇa, tividhā manasā adhammacariyāvisamacariyā hoti. Evaṃ adhammacariyāvisamacariyāhetu kho, brāhmaṇa, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tividhā brāhmaṇa, kāyena dhammacariyāsamacariyā hoti; catubbidhā vācāya dhammacariyāsamacariyā hoti; tividhā manasā dhammacariyāsamacariyā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, brāhmaṇa, tividhā kāyena dhammacariyāsamacariyā hoti…pe… evaṃ ",
      " kho, brāhmaṇa, tividhā kāyena dhammacariyāsamacariyā hoti."
    ],
    "innerText": "‘‘Kathañca, brāhmaṇa, tividhā kāyena dhammacariyāsamacariyā hoti…pe… evaṃ kho, brāhmaṇa, tividhā kāyena dhammacariyāsamacariyā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, brāhmaṇa, catubbidhā vācāya dhammacariyāsamacariyā hoti…pe… evaṃ kho, brāhmaṇa, catubbidhā vācāya dhammacariyāsamacariyā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, brāhmaṇa, tividhā manasā dhammacariyāsamacariyā hoti…pe… evaṃ kho, brāhmaṇa, tividhā manasā dhammacariyāsamacariyā hoti. Evaṃ dhammacariyāsamacariyāhetu kho, brāhmaṇa, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjantī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Abhikkantaṃ, bho gotama, abhikkantaṃ, bho gotama…pe… upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Karajakāyavaggo paṭhamo."
  }
]