[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "(18) 3. Sañcetaniyavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Cetanāsuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "171"
      },
      ". Tatiyassa ",
      " paṭhame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāye"
      },
      "ti kāyadvāre, kāyaviññattiyā satīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāyasañcetanāhetū"
      },
      "tiādīsu kāyasañcetanā nāma kāyadvāre cetanā pakappanā. Sā aṭṭha kāmāvacarakusalavasena aṭṭhavidhā, akusalavasena dvādasavidhāti vīsatividhā. Tathā vacīsañcetanā, tathā manosañcetanā. Apicettha nava mahaggatacetanāpi labbhanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāyasañcetanāhetū"
      },
      "ti kāyasañcetanāpaccayā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uppajjati ajjhattaṃ sukhadukkha"
      },
      "nti aṭṭhakusalakammapaccayā niyakajjhatte sukhaṃ uppajjati, dvādasaakusalakammapaccayā dukkhaṃ. Sesadvāresupi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avijjāpaccayāvā"
      },
      "ti avijjākāraṇeneva. Sace hi avijjā chādayamānā paccayo hoti, evaṃ sante tīsu dvāresu sukhadukkhānaṃ paccayabhūtā cetanā uppajjati. Iti mūlabhūtāya avijjāya vasenetaṃ vuttaṃ."
    ],
    "innerText": "171. Tatiyassa paṭhame kāyeti kāyadvāre, kāyaviññattiyā satīti attho. Kāyasañcetanāhetūtiādīsu kāyasañcetanā nāma kāyadvāre cetanā pakappanā. Sā aṭṭha kāmāvacarakusalavasena aṭṭhavidhā, akusalavasena dvādasavidhāti vīsatividhā. Tathā vacīsañcetanā, tathā manosañcetanā. Apicettha nava mahaggatacetanāpi labbhanti. Kāyasañcetanāhetūti kāyasañcetanāpaccayā. Uppajjati ajjhattaṃ sukhadukkhanti aṭṭhakusalakammapaccayā niyakajjhatte sukhaṃ uppajjati, dvādasaakusalakammapaccayā dukkhaṃ. Sesadvāresupi eseva nayo. Avijjāpaccayāvāti avijjākāraṇeneva. Sace hi avijjā chādayamānā paccayo hoti, evaṃ sante tīsu dvāresu sukhadukkhānaṃ paccayabhūtā cetanā uppajjati. Iti mūlabhūtāya avijjāya vasenetaṃ vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sāmaṃ vā"
      },
      "tiādīsu parehi anāṇatto sayameva abhisaṅkharonto ",
      " sāmaṃ kāyasaṅkhāraṃ abhisaṅkharoti nāma. Yaṃ pana pare samādapetvā āṇāpetvā kārenti, tassa taṃ kāyasaṅkhāraṃ pare abhisaṅkharonti nāma. Yo pana kusalaṃ kusalanti akusalaṃ akusalanti kusalavipākaṃ kusalavipākoti akusalavipākaṃ akusalavipākoti jānanto kāyadvāre vīsatividhaṃ kāyasaṅkhāraṃ abhisaṅkharoti, ayaṃ sampajāno abhisaṅkharoti nāma. Yo evaṃ ajānanto abhisaṅkharoti, ayaṃ asampajāno abhisaṅkharoti nāma. Sesadvāresupi eseva nayo."
    ],
    "innerText": "Sāmaṃ vātiādīsu parehi anāṇatto sayameva abhisaṅkharonto sāmaṃ kāyasaṅkhāraṃ abhisaṅkharoti nāma. Yaṃ pana pare samādapetvā āṇāpetvā kārenti, tassa taṃ kāyasaṅkhāraṃ pare abhisaṅkharonti nāma. Yo pana kusalaṃ kusalanti akusalaṃ akusalanti kusalavipākaṃ kusalavipākoti akusalavipākaṃ akusalavipākoti jānanto kāyadvāre vīsatividhaṃ kāyasaṅkhāraṃ abhisaṅkharoti, ayaṃ sampajāno abhisaṅkharoti nāma. Yo evaṃ ajānanto abhisaṅkharoti, ayaṃ asampajāno abhisaṅkharoti nāma. Sesadvāresupi eseva nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      " asampajānakammaṃ evaṃ veditabbaṃ – daharadārakā ‘‘mātāpitūhi kataṃ karomā’’ti cetiyaṃ vandanti, pupphapūjaṃ karonti, bhikkhusaṅghaṃ vandanti, tesaṃ kusalanti ajānantānampi taṃ kusalameva hoti. Tathā migapakkhiādayo tiracchānā dhammaṃ suṇanti, saṅghaṃ vandanti, cetiyaṃ vandanti, tesaṃ jānantānampi ajānantānampi taṃ kusalameva hoti. Daharadārakā pana mātāpitaro hatthapādehi paharanti, bhikkhūnaṃ talasattikaṃ uggiranti, daṇḍaṃ khipanti, akkosanti ",
      ". Gāviyo bhikkhusaṅghaṃ anubandhanti, sunakhā anubandhanti, ḍaṃsanti, sīhabyagghādayo anubandhanti, jīvitā voropenti. Tesaṃ jānantānampi ajānantānampi akusalakammaṃ hotīti veditabbaṃ."
    ],
    "innerText": "Tattha asampajānakammaṃ evaṃ veditabbaṃ – daharadārakā ‘‘mātāpitūhi kataṃ karomā’’ti cetiyaṃ vandanti, pupphapūjaṃ karonti, bhikkhusaṅghaṃ vandanti, tesaṃ kusalanti ajānantānampi taṃ kusalameva hoti. Tathā migapakkhiādayo tiracchānā dhammaṃ suṇanti, saṅghaṃ vandanti, cetiyaṃ vandanti, tesaṃ jānantānampi ajānantānampi taṃ kusalameva hoti. Daharadārakā pana mātāpitaro hatthapādehi paharanti, bhikkhūnaṃ talasattikaṃ uggiranti, daṇḍaṃ khipanti, akkosanti . Gāviyo bhikkhusaṅghaṃ anubandhanti, sunakhā anubandhanti, ḍaṃsanti, sīhabyagghādayo anubandhanti, jīvitā voropenti. Tesaṃ jānantānampi ajānantānampi akusalakammaṃ hotīti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni tīsupi dvāresu āyūhanacetanā samodhānetabbā. Seyyathidaṃ – kāyadvāre sayaṃkatamūlikā vīsati cetanā, āṇattimūlikā vīsati, sampajānamūlikā vīsati, asampajānamūlikā vīsatīti asīti cetanā honti, tathā vacīdvāre. Manodvāre ",
      " pana ekekasmimpi vikappe ekūnatiṃsa katvā satañca soḷasa ca honti. Iti sabbāpi tīsu dvāresu dve satāni chasattati ca cetanā. Tā sabbāpi saṅkhārakkhandhoteva saṅkhaṃ gacchanti, taṃsampayutto vedayitākāro vedanākkhandho, sañjānanākāro saññākkhandho, cittaṃ viññāṇakkhandho, kāyo upādārūpaṃ, tassa paccayā catasso dhātuyo cattāri bhūtānīti ime pañcakkhandhā dukkhasaccaṃ nāma."
    ],
    "innerText": "Idāni tīsupi dvāresu āyūhanacetanā samodhānetabbā. Seyyathidaṃ – kāyadvāre sayaṃkatamūlikā vīsati cetanā, āṇattimūlikā vīsati, sampajānamūlikā vīsati, asampajānamūlikā vīsatīti asīti cetanā honti, tathā vacīdvāre. Manodvāre pana ekekasmimpi vikappe ekūnatiṃsa katvā satañca soḷasa ca honti. Iti sabbāpi tīsu dvāresu dve satāni chasattati ca cetanā. Tā sabbāpi saṅkhārakkhandhoteva saṅkhaṃ gacchanti, taṃsampayutto vedayitākāro vedanākkhandho, sañjānanākāro saññākkhandho, cittaṃ viññāṇakkhandho, kāyo upādārūpaṃ, tassa paccayā catasso dhātuyo cattāri bhūtānīti ime pañcakkhandhā dukkhasaccaṃ nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Imesu, bhikkhave, dhammesu avijjā anupatitā"
      },
      "ti imesu vuttappabhedesu cetanādhammesu avijjā sahajātavasena ca upanissayavasena ca anupatitā. Evaṃ vaṭṭañceva vaṭṭamūlikā ca avijjā dassitā hoti."
    ],
    "innerText": "Imesu, bhikkhave, dhammesu avijjā anupatitāti imesu vuttappabhedesu cetanādhammesu avijjā sahajātavasena ca upanissayavasena ca anupatitā. Evaṃ vaṭṭañceva vaṭṭamūlikā ca avijjā dassitā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettāvatā vipassanaṃ vaḍḍhetvā arahattaṃ pattassa khīṇāsavassa idāni thutiṃ karonto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avijjāyatveva asesavirāganirodhā"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asesavirāganirodhā"
      },
      "ti asesavirāgena ceva asesanirodhena ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "So kāyo na hotī"
      },
      "ti khīṇāsavassa kāyena karaṇakammaṃ paññāyati, cetiyaṅgaṇasammajjanaṃ bodhiyaṅgaṇasammajjanaṃ abhikkamanaṃ paṭikkamanaṃ vattānuvattakaraṇanti evamādi. Kāyadvāre panassa vīsati cetanā avipākadhammataṃ ",
      " āpajjanti. Tena vuttaṃ – ‘‘so kāyo na hoti, yaṃ paccayāssa taṃ uppajjati ajjhattaṃ sukhadukkha’’nti. Kāyadvārappavattā hi cetanā idha kāyoti adhippetā. Sesadvayepi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khetta"
      },
      "ntiādīnipi ",
      " kusalākusalakammasseva nāmāni. Tañhi vipākassa viruhanaṭṭhānaṭṭhena khettaṃ, patiṭṭhānaṭṭhena vatthu, kāraṇaṭṭhena āyatanaṃ, adhikaraṇaṭṭhena adhikaraṇanti vuccati."
    ],
    "innerText": "Ettāvatā vipassanaṃ vaḍḍhetvā arahattaṃ pattassa khīṇāsavassa idāni thutiṃ karonto avijjāyatveva asesavirāganirodhātiādimāha. Tattha asesavirāganirodhāti asesavirāgena ceva asesanirodhena ca. So kāyo na hotīti khīṇāsavassa kāyena karaṇakammaṃ paññāyati, cetiyaṅgaṇasammajjanaṃ bodhiyaṅgaṇasammajjanaṃ abhikkamanaṃ paṭikkamanaṃ vattānuvattakaraṇanti evamādi. Kāyadvāre panassa vīsati cetanā avipākadhammataṃ āpajjanti. Tena vuttaṃ – ‘‘so kāyo na hoti, yaṃ paccayāssa taṃ uppajjati ajjhattaṃ sukhadukkha’’nti. Kāyadvārappavattā hi cetanā idha kāyoti adhippetā. Sesadvayepi eseva nayo. Khettantiādīnipi kusalākusalakammasseva nāmāni. Tañhi vipākassa viruhanaṭṭhānaṭṭhena khettaṃ, patiṭṭhānaṭṭhena vatthu, kāraṇaṭṭhena āyatanaṃ, adhikaraṇaṭṭhena adhikaraṇanti vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Iti satthā ettakena ṭhānena tīhi dvārehi āyūhitakammaṃ dassetvā idāni tassa kammassa ",
      " vipaccanaṭṭhānaṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cattārome bhikkhave"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "attabhāvappaṭilābhā"
      },
      "ti paṭiladdhaattabhāvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attasañcetanā kamatī"
      },
      "ti attanā pakappitacetanā vahati pavattati."
    ],
    "innerText": "Iti satthā ettakena ṭhānena tīhi dvārehi āyūhitakammaṃ dassetvā idāni tassa kammassa vipaccanaṭṭhānaṃ dassetuṃ cattārome bhikkhavetiādimāha. Tattha attabhāvappaṭilābhāti paṭiladdhaattabhāvā. Attasañcetanā kamatīti attanā pakappitacetanā vahati pavattati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attasañcetanāhetu tesaṃ sattānaṃ tamhā kāyā cuti hotī"
      },
      "tiādīsu khiḍḍāpadosikā devā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "attasañcetanāhetu"
      },
      " cavanti. Tesañhi nandanavanacittalatāvanaphārusakavanādīsu dibbaratisamappitānaṃ kīḷantānaṃ pānabhojane sati sammussati, te āhārupacchedena ātape khittamālā viya milāyanti. Manopadosikā devā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "parasañcetanāhetu"
      },
      " cavanti, ete cātumahārājikā devā. Tesu kira eko devaputto ‘‘nakkhattaṃ kīḷissāmī’’ti saparivāro rathena vīthiṃ paṭipajjati. Athañño nikkhamanto taṃ purato gacchantaṃ disvā ‘‘kiṃ, bho, ayaṃ kapaṇo adiṭṭhapubbaṃ viya etaṃ disvā pītiyā uddhumāto viya gajjamāno viya ca gacchatī’’ti kujjhati. Purato gacchantopi nivattitvā taṃ kuddhaṃ disvā kuddhā nāma suvijānā hontīti kuddhabhāvamassa ñatvā ‘‘tvaṃ kuddho ",
      " mayhaṃ kiṃ karissasi, ayaṃ sampatti mayā dānasīlādīnaṃ vasena laddhā, na tuyhaṃ vasenā’’ti paṭikujjhati. Ekasmiñhi kuddhe itaro akuddho rakkhati, ubhosu pana kuddhesu ekassa kodho itarassa paccayo hoti, tassapi kodho itarassa paccayo hotīti ubho kandantānaṃyeva orodhānaṃ cavanti. Manussā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "attasañcetanā ca parasañcetanā ca hetu"
      },
      " cavanti, attasañcetanāya ca parasañcetanāya ca hetubhūtāya cavantīti attho. Manussā hi kujjhitvā attanāva attānaṃ hatthehipi daṇḍehipi paharanti, rajjubandhanādīhipi bandhanti, asināpi sīsaṃ chindanti, visampi khādanti, papātepi patanti, udakampi pavisanti, aggimpi pavisanti, parepi daṇḍena vā satthane vā paharitvā mārenti. Evaṃ tesu attasañcetanāpi parasañcetanāpi kamati."
    ],
    "innerText": "Attasañcetanāhetu tesaṃ sattānaṃ tamhā kāyā cuti hotītiādīsu khiḍḍāpadosikā devā attasañcetanāhetu cavanti. Tesañhi nandanavanacittalatāvanaphārusakavanādīsu dibbaratisamappitānaṃ kīḷantānaṃ pānabhojane sati sammussati, te āhārupacchedena ātape khittamālā viya milāyanti. Manopadosikā devā parasañcetanāhetu cavanti, ete cātumahārājikā devā. Tesu kira eko devaputto ‘‘nakkhattaṃ kīḷissāmī’’ti saparivāro rathena vīthiṃ paṭipajjati. Athañño nikkhamanto taṃ purato gacchantaṃ disvā ‘‘kiṃ, bho, ayaṃ kapaṇo adiṭṭhapubbaṃ viya etaṃ disvā pītiyā uddhumāto viya gajjamāno viya ca gacchatī’’ti kujjhati. Purato gacchantopi nivattitvā taṃ kuddhaṃ disvā kuddhā nāma suvijānā hontīti kuddhabhāvamassa ñatvā ‘‘tvaṃ kuddho mayhaṃ kiṃ karissasi, ayaṃ sampatti mayā dānasīlādīnaṃ vasena laddhā, na tuyhaṃ vasenā’’ti paṭikujjhati. Ekasmiñhi kuddhe itaro akuddho rakkhati, ubhosu pana kuddhesu ekassa kodho itarassa paccayo hoti, tassapi kodho itarassa paccayo hotīti ubho kandantānaṃyeva orodhānaṃ cavanti. Manussā attasañcetanā ca parasañcetanā ca hetu cavanti, attasañcetanāya ca parasañcetanāya ca hetubhūtāya cavantīti attho. Manussā hi kujjhitvā attanāva attānaṃ hatthehipi daṇḍehipi paharanti, rajjubandhanādīhipi bandhanti, asināpi sīsaṃ chindanti, visampi khādanti, papātepi patanti, udakampi pavisanti, aggimpi pavisanti, parepi daṇḍena vā satthane vā paharitvā mārenti. Evaṃ tesu attasañcetanāpi parasañcetanāpi kamati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Katame"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tena devā daṭṭhabbā"
      },
      "ti katame nāma te devā daṭṭhabbāti attho. Tena vā attabhāvena katame devā daṭṭhabbātipi attho. Kasmā pana thero imaṃ pañhaṃ pucchati, kiṃ attanā kathetuṃ nappahotīti? Pahoti, idaṃ pana padaṃ attano sabhāvena buddhavisayaṃ pañhanti thero na kathesi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tena daṭṭhabbā"
      },
      "ti tena attabhāvena daṭṭhabbā. Ayaṃ pana pañho heṭṭhā kāmāvacarepi rūpāvacarepi labbhati, bhavaggena pana paricchinditvā kathito nippadesena kathito hotīti bhagavatā evaṃ kathito."
    ],
    "innerText": "Katametena devā daṭṭhabbāti katame nāma te devā daṭṭhabbāti attho. Tena vā attabhāvena katame devā daṭṭhabbātipi attho. Kasmā pana thero imaṃ pañhaṃ pucchati, kiṃ attanā kathetuṃ nappahotīti? Pahoti, idaṃ pana padaṃ attano sabhāvena buddhavisayaṃ pañhanti thero na kathesi. Tena daṭṭhabbāti tena attabhāvena daṭṭhabbā. Ayaṃ pana pañho heṭṭhā kāmāvacarepi rūpāvacarepi labbhati, bhavaggena pana paricchinditvā kathito nippadesena kathito hotīti bhagavatā evaṃ kathito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āgantāro"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "itthatta"
      },
      "nti itthabhāvaṃ kāmāvacarapañcakkhandhabhāvameva ",
      " āgantāro, neva tatrūpapattikā na uparūpapattikā honti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anāgantāro itthatta"
      },
      "nti imaṃ khandhapañcakaṃ anāgantāro, heṭṭhūpapattikā na honti, tatrūpapattikā vā uparūpapattikā vā tattheva vā parinibbāyino hontīti attho. Ettha ca heṭṭhimabhave nibbattānaṃ vasena uparūpapattikā veditabbā. Bhavagge panetaṃ natthi. Sesaṃ sabbattha uttānamevāti."
    ],
    "innerText": "Āgantāroitthattanti itthabhāvaṃ kāmāvacarapañcakkhandhabhāvameva āgantāro, neva tatrūpapattikā na uparūpapattikā honti. Anāgantāro itthattanti imaṃ khandhapañcakaṃ anāgantāro, heṭṭhūpapattikā na honti, tatrūpapattikā vā uparūpapattikā vā tattheva vā parinibbāyino hontīti attho. Ettha ca heṭṭhimabhave nibbattānaṃ vasena uparūpapattikā veditabbā. Bhavagge panetaṃ natthi. Sesaṃ sabbattha uttānamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Vibhattisuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "172"
      },
      ". Dutiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atthapaṭisambhidā"
      },
      "ti pañcasu atthesu pabhedagataṃ ñāṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Odhiso"
      },
      "ti kāraṇaso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Byañjanaso"
      },
      "ti akkharaso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anekapariyāyenā"
      },
      "ti anekehi kāraṇehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ācikkhāmī"
      },
      "ti kathemi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Desemī"
      },
      "ti pākaṭaṃ katvā kathemi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññāpemī"
      },
      "ti jānāpemi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭṭhapemī"
      },
      "ti paṭṭhapetvā pavattetvā kathemi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vivarāmī"
      },
      "ti vivaṭaṃ katvā kathemi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vibhajāmī"
      },
      "ti vibhajitvā kathemi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uttānīkaromī"
      },
      "ti gambhīraṃ uttānakaṃ katvā kathemi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "So maṃ pañhenā"
      },
      "ti so maṃ pañhena upagacchatu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ahaṃ veyyākaraṇenā"
      },
      "ti ahamassa pañhakathanena cittaṃ ārādhessāmi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yo no dhammānaṃ sukusalo"
      },
      "ti yo amhākaṃ adhigatadhammānaṃ ",
      " sukusalo satthā, so esa sammukhībhūto. Yadi mayā atthapaṭisambhidā na sacchikatā, ‘‘sacchikarohi tāva sāriputtā’’ti vatvā maṃ paṭibāhissatīti satthu purato nisinnakova sīhanādaṃ nadati. Iminā upāyena sabbattha attho veditabbo. Imāsu ca pana paṭisambhidāsu tisso paṭisambhidā lokiyā, atthapaṭisambhidā lokiyalokuttarāti."
    ],
    "innerText": "172. Dutiye atthapaṭisambhidāti pañcasu atthesu pabhedagataṃ ñāṇaṃ. Odhisoti kāraṇaso. Byañjanasoti akkharaso. Anekapariyāyenāti anekehi kāraṇehi. Ācikkhāmīti kathemi. Desemīti pākaṭaṃ katvā kathemi. Paññāpemīti jānāpemi. Paṭṭhapemīti paṭṭhapetvā pavattetvā kathemi. Vivarāmīti vivaṭaṃ katvā kathemi. Vibhajāmīti vibhajitvā kathemi. Uttānīkaromīti gambhīraṃ uttānakaṃ katvā kathemi. So maṃ pañhenāti so maṃ pañhena upagacchatu. Ahaṃ veyyākaraṇenāti ahamassa pañhakathanena cittaṃ ārādhessāmi. Yo no dhammānaṃ sukusaloti yo amhākaṃ adhigatadhammānaṃ sukusalo satthā, so esa sammukhībhūto. Yadi mayā atthapaṭisambhidā na sacchikatā, ‘‘sacchikarohi tāva sāriputtā’’ti vatvā maṃ paṭibāhissatīti satthu purato nisinnakova sīhanādaṃ nadati. Iminā upāyena sabbattha attho veditabbo. Imāsu ca pana paṭisambhidāsu tisso paṭisambhidā lokiyā, atthapaṭisambhidā lokiyalokuttarāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Mahākoṭṭhikasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "173"
      },
      ". Tatiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "phassāyatanāna"
      },
      "nti phassākarānaṃ, phassassa uppattiṭṭhānānanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atthaññaṃ kiñcī"
      },
      "ti etesu asesato niruddhesu tato paraṃ koci appamattakopi kileso atthīti pucchati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Natthaññaṃ kiñcī"
      },
      "ti idhāpi ‘‘appamattakopi kileso natthī’’ti pucchati. Sesadvayepi eseva nayo. Ime pana cattāropi pañhe sassatucchedaekaccasassataamarāvikkhepavasena pucchati. Tenassa thero pucchitapucchitaṃ paṭibāhanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mā heva"
      },
      "nti āha. Ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hi"
      },
      "iti nipātamattaṃ, evaṃ mā bhaṇīti attho. Attūpaladdhivaseneva ‘‘atthaññaṃ kiñci añño ",
      " koci attā nāma atthī’’ti sassatādiākārena pucchati. Kiṃ panesa attūpaladdhikoti? Na attūpaladdhiko. Evaṃladdhiko pana tattheko bhikkhu nisinno, so pucchituṃ na sakkoti. Tassa laddhiṃ vissajjāpanatthaṃ evaṃ pucchati. Yepi ca anāgate evaṃladdhikā bhavissanti, tesaṃ ‘‘buddhakālepeso pañho mahāsāvakehi vissajjito’’ti vacanokāsupacchedanatthaṃ pucchatiyeva."
    ],
    "innerText": "173. Tatiye phassāyatanānanti phassākarānaṃ, phassassa uppattiṭṭhānānanti attho. Atthaññaṃ kiñcīti etesu asesato niruddhesu tato paraṃ koci appamattakopi kileso atthīti pucchati. Natthaññaṃ kiñcīti idhāpi ‘‘appamattakopi kileso natthī’’ti pucchati. Sesadvayepi eseva nayo. Ime pana cattāropi pañhe sassatucchedaekaccasassataamarāvikkhepavasena pucchati. Tenassa thero pucchitapucchitaṃ paṭibāhanto mā hevanti āha. Ettha hiiti nipātamattaṃ, evaṃ mā bhaṇīti attho. Attūpaladdhivaseneva ‘‘atthaññaṃ kiñci añño koci attā nāma atthī’’ti sassatādiākārena pucchati. Kiṃ panesa attūpaladdhikoti? Na attūpaladdhiko. Evaṃladdhiko pana tattheko bhikkhu nisinno, so pucchituṃ na sakkoti. Tassa laddhiṃ vissajjāpanatthaṃ evaṃ pucchati. Yepi ca anāgate evaṃladdhikā bhavissanti, tesaṃ ‘‘buddhakālepeso pañho mahāsāvakehi vissajjito’’ti vacanokāsupacchedanatthaṃ pucchatiyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appapañcaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "papañcetī"
      },
      "ti na papañcetabbaṭṭhāne papañcaṃ karoti, anācaritabbaṃ maggaṃ carati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tāvatā papañcassa gatī"
      },
      "ti yattakā channaṃ phassāyatanānaṃ gati, tattakāva taṇhādiṭṭhimānappabhedassa papañcassa gati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Channaṃ, āvuso, phassāyatanānaṃ asesavirāganirodhā papañcanirodho papañcavūpasamo"
      },
      "ti etesu chasu āyatanesu sabbaso niruddhesu papañcāpi niruddhāva honti, vūpasantāva hontīti attho. Āruppe pana puthujjanadevatānaṃ kiñcāpi pañca phassāyatanāni niruddhāni, chaṭṭhassa pana aniruddhattā tayopi papañcā appahīnāva. Apica pañcavokārabhavavaseneva pañho kathitoti. Catutthe imināva nayena attho veditabbo."
    ],
    "innerText": "Appapañcaṃpapañcetīti na papañcetabbaṭṭhāne papañcaṃ karoti, anācaritabbaṃ maggaṃ carati. Tāvatā papañcassa gatīti yattakā channaṃ phassāyatanānaṃ gati, tattakāva taṇhādiṭṭhimānappabhedassa papañcassa gati. Channaṃ, āvuso, phassāyatanānaṃ asesavirāganirodhā papañcanirodho papañcavūpasamoti etesu chasu āyatanesu sabbaso niruddhesu papañcāpi niruddhāva honti, vūpasantāva hontīti attho. Āruppe pana puthujjanadevatānaṃ kiñcāpi pañca phassāyatanāni niruddhāni, chaṭṭhassa pana aniruddhattā tayopi papañcā appahīnāva. Apica pañcavokārabhavavaseneva pañho kathitoti. Catutthe imināva nayena attho veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Upavāṇasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "175-176"
      },
      ". Pañcame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vijjāyantakaro hotī"
      },
      "ti vijjāya vaṭṭadukkhassa antakaro hoti, sakalaṃ vaṭṭadukkhaṃ paricchinnaṃ parivaṭumaṃ katvā tiṭṭhatīti. Sesapadesupi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saupādāno"
      },
      "ti sagahaṇova hutvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Antakaro abhavissā"
      },
      "ti vaṭṭadukkhassa antaṃ katvā ṭhito abhavissa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Caraṇasampanno"
      },
      "ti pannarasadhammabhedena caraṇena samannāgato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathābhūtaṃ jānaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "passaṃ antakaro hotī"
      },
      "ti yathāsabhāvaṃ maggapaññāya jānitvā passitvā vaṭṭadukkhassa antaṃ katvā ṭhito nāma hotīti arahattanikūṭena pañhaṃ niṭṭhapesi. Chaṭṭhaṃ heṭṭhā ekakanipātavaṇṇanāyaṃ vuttanayeneva veditabbaṃ."
    ],
    "innerText": "175-176. Pañcame vijjāyantakaro hotīti vijjāya vaṭṭadukkhassa antakaro hoti, sakalaṃ vaṭṭadukkhaṃ paricchinnaṃ parivaṭumaṃ katvā tiṭṭhatīti. Sesapadesupi eseva nayo. Saupādānoti sagahaṇova hutvā. Antakaro abhavissāti vaṭṭadukkhassa antaṃ katvā ṭhito abhavissa. Caraṇasampannoti pannarasadhammabhedena caraṇena samannāgato. Yathābhūtaṃ jānaṃpassaṃ antakaro hotīti yathāsabhāvaṃ maggapaññāya jānitvā passitvā vaṭṭadukkhassa antaṃ katvā ṭhito nāma hotīti arahattanikūṭena pañhaṃ niṭṭhapesi. Chaṭṭhaṃ heṭṭhā ekakanipātavaṇṇanāyaṃ vuttanayeneva veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Rāhulasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "177"
      },
      ". Sattame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ajjhattikā"
      },
      "ti kesādīsu vīsatiyā koṭṭhāsesu thaddhākāralakkhaṇā pathavīdhātu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bāhirā"
      },
      "ti bahiddhā anindriyabaddhesu pāsāṇapabbatādīsu thaddhākāralakkhaṇā pathavīdhātu ",
      ". Imināva nayena sesāpi dhātuyo veditabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Netaṃ mama, nesohamasmi, na meso attā"
      },
      "ti idaṃ tayaṃ taṇhāmānadiṭṭhiggāhapaṭikkhepavasena vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammappaññāya daṭṭhabba"
      },
      "nti hetunā kāraṇena maggapaññāya passitabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Disvā"
      },
      "ti sahavipassanāya maggapaññāya passitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Acchecchi taṇha"
      },
      "nti maggavajjhataṇhaṃ samūlakaṃ chindi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vivattayi saṃyojana"
      },
      "nti dasavidhampi saṃyojanaṃ vivattayi ubbattetvā pajahi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammā mānābhisamayā"
      },
      "ti hetunā kāraṇena navavidhassa mānassa pahānābhisamayā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Antamakāsi dukkhassā"
      },
      "ti vaṭṭadukkhaṃ paricchinnaṃ parivaṭumaṃ akāsi, katvā ṭhitoti attho. Iti satthārā saṃyuttamahānikāye rāhulovāde (saṃ. ni. 3.91 ādayo) vipassanā kathitā, cūḷarāhulovādepi (ma. ni. 3.416 ādayo) vipassanā kathitā, ambalaṭṭhikarāhulovāde (ma. ni. 2.107 ādayo) daharasseva sato musāvādā veramaṇī kathitā, mahārāhulovāde (ma. ni. 2.113 ādayo) vipassanā kathitā. Imasmiṃ aṅguttaramahānikāye ayaṃ catukoṭikasuññatā nāma kathitāti."
    ],
    "innerText": "177. Sattame ajjhattikāti kesādīsu vīsatiyā koṭṭhāsesu thaddhākāralakkhaṇā pathavīdhātu. Bāhirāti bahiddhā anindriyabaddhesu pāsāṇapabbatādīsu thaddhākāralakkhaṇā pathavīdhātu . Imināva nayena sesāpi dhātuyo veditabbā. Netaṃ mama, nesohamasmi, na meso attāti idaṃ tayaṃ taṇhāmānadiṭṭhiggāhapaṭikkhepavasena vuttaṃ. Sammappaññāya daṭṭhabbanti hetunā kāraṇena maggapaññāya passitabbaṃ. Disvāti sahavipassanāya maggapaññāya passitvā. Acchecchi taṇhanti maggavajjhataṇhaṃ samūlakaṃ chindi. Vivattayi saṃyojananti dasavidhampi saṃyojanaṃ vivattayi ubbattetvā pajahi. Sammā mānābhisamayāti hetunā kāraṇena navavidhassa mānassa pahānābhisamayā. Antamakāsi dukkhassāti vaṭṭadukkhaṃ paricchinnaṃ parivaṭumaṃ akāsi, katvā ṭhitoti attho. Iti satthārā saṃyuttamahānikāye rāhulovāde (saṃ. ni. 3.91 ādayo) vipassanā kathitā, cūḷarāhulovādepi (ma. ni. 3.416 ādayo) vipassanā kathitā, ambalaṭṭhikarāhulovāde (ma. ni. 2.107 ādayo) daharasseva sato musāvādā veramaṇī kathitā, mahārāhulovāde (ma. ni. 2.113 ādayo) vipassanā kathitā. Imasmiṃ aṅguttaramahānikāye ayaṃ catukoṭikasuññatā nāma kathitāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Jambālīsuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "178"
      },
      ". Aṭṭhame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "santaṃ cetovimutti"
      },
      "nti aṭṭhannaṃ samāpattīnaṃ aññataraṃ samāpattiṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sakkāyanirodha"
      },
      "nti tebhūmakavaṭṭasaṅkhātassa sakkāyassa nirodhaṃ, nibbānanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na pakkhandatī"
      },
      "ti ārammaṇavasena na pakkhandati. Sesapadesupi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na pāṭikaṅkho"
      },
      "ti na pāṭikaṅkhitabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lepagatenā"
      },
      "ti lepamakkhitena."
    ],
    "innerText": "178. Aṭṭhame santaṃ cetovimuttinti aṭṭhannaṃ samāpattīnaṃ aññataraṃ samāpattiṃ. Sakkāyanirodhanti tebhūmakavaṭṭasaṅkhātassa sakkāyassa nirodhaṃ, nibbānanti attho. Na pakkhandatīti ārammaṇavasena na pakkhandati. Sesapadesupi eseva nayo. Na pāṭikaṅkhoti na pāṭikaṅkhitabbo. Lepagatenāti lepamakkhitena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Imasmiñca ",
      " panatthe nadīpāraṃ gantukāmapurisopammaṃ āharitabbaṃ – eko kira puriso caṇḍasotāya vāḷamacchākulāya nadiyā pāraṃ gantukāmo ‘‘orimaṃ tīraṃ sāsaṅkaṃ sappaṭibhayaṃ, pārimaṃ tīraṃ khemaṃ appaṭibhayaṃ, kiṃ nu kho katvā pāraṃ gamissāmī’’ti paṭipāṭiyā ṭhite aṭṭha kakudharukkhe disvā ‘‘sakkā imāya rukkhapaṭipāṭiyā gantu’’nti manasikatvā ‘‘kakudharukkhā nāma maṭṭhasākhā honti, sākhāya hatthā na saṇṭhaheyyu’’nti nigrodhapilakkharukkhādīnaṃ aññatarassa lākhāya hatthapāde makkhetvā dakkhiṇahatthena ekaṃ sākhaṃ gaṇhi. Hattho tattheva lagi. Puna vāmahatthena dakkhiṇapādena vāmapādenāti cattāropi hatthapādā tattheva lagiṃsu. So adhosiro lambamāno uparinadiyaṃ deve vuṭṭhe puṇṇāya nadiyā sote nimuggo kumbhīlādīnaṃ bhakkho ahosi."
    ],
    "innerText": "Imasmiñca panatthe nadīpāraṃ gantukāmapurisopammaṃ āharitabbaṃ – eko kira puriso caṇḍasotāya vāḷamacchākulāya nadiyā pāraṃ gantukāmo ‘‘orimaṃ tīraṃ sāsaṅkaṃ sappaṭibhayaṃ, pārimaṃ tīraṃ khemaṃ appaṭibhayaṃ, kiṃ nu kho katvā pāraṃ gamissāmī’’ti paṭipāṭiyā ṭhite aṭṭha kakudharukkhe disvā ‘‘sakkā imāya rukkhapaṭipāṭiyā gantu’’nti manasikatvā ‘‘kakudharukkhā nāma maṭṭhasākhā honti, sākhāya hatthā na saṇṭhaheyyu’’nti nigrodhapilakkharukkhādīnaṃ aññatarassa lākhāya hatthapāde makkhetvā dakkhiṇahatthena ekaṃ sākhaṃ gaṇhi. Hattho tattheva lagi. Puna vāmahatthena dakkhiṇapādena vāmapādenāti cattāropi hatthapādā tattheva lagiṃsu. So adhosiro lambamāno uparinadiyaṃ deve vuṭṭhe puṇṇāya nadiyā sote nimuggo kumbhīlādīnaṃ bhakkho ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      " nadīsotaṃ viya saṃsārasotaṃ daṭṭhabbaṃ, sotassa pāraṃ gantukāmapuriso viya yogāvacaro, orimatīraṃ viya sakkāyo, pārimatīraṃ viya nibbānaṃ, paṭipāṭiyā ṭhitā aṭṭha kakudharukkhā viya aṭṭha samāpattiyo, lepamakkhitena ",
      " hatthena sākhāgahaṇaṃ viya jhānavipassanānaṃ pāripanthike asodhetvā samāpattisamāpajjanaṃ, catūhi hatthapādehi sākhāya baddhassa olambanaṃ viya paṭhamajjhāne nikantiyā laggakālo, uparisote vuṭṭhi viya chasu dvāresu kilesānaṃ uppannakālo, nadiyā puṇṇāya sote nimuggassa kumbhīlādīnaṃ bhakkhabhūtakālo viya saṃsārasote nimuggassa catūsu apāyesu dukkhānubhavanakālo veditabbo."
    ],
    "innerText": "Tattha nadīsotaṃ viya saṃsārasotaṃ daṭṭhabbaṃ, sotassa pāraṃ gantukāmapuriso viya yogāvacaro, orimatīraṃ viya sakkāyo, pārimatīraṃ viya nibbānaṃ, paṭipāṭiyā ṭhitā aṭṭha kakudharukkhā viya aṭṭha samāpattiyo, lepamakkhitena hatthena sākhāgahaṇaṃ viya jhānavipassanānaṃ pāripanthike asodhetvā samāpattisamāpajjanaṃ, catūhi hatthapādehi sākhāya baddhassa olambanaṃ viya paṭhamajjhāne nikantiyā laggakālo, uparisote vuṭṭhi viya chasu dvāresu kilesānaṃ uppannakālo, nadiyā puṇṇāya sote nimuggassa kumbhīlādīnaṃ bhakkhabhūtakālo viya saṃsārasote nimuggassa catūsu apāyesu dukkhānubhavanakālo veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suddhena hatthenā"
      },
      "ti sudhotena parisuddhahatthena. Imasmimpi atthe tādisameva opammaṃ kātabbaṃ – tatheva hi pāraṃ gantukāmo puriso ‘‘kakudharukkhā nāma maṭṭhasākhā, kiliṭṭhahatthena gaṇhantassa hattho parigaleyyā’’ti hatthapāde sudhote katvā ekaṃ sākhaṃ gaṇhitvā paṭhamaṃ rukkhaṃ āruḷho. Tato otaritvā dutiyaṃ…pe… tato otaritvā aṭṭhamaṃ, aṭṭhamarukkhato otaritvā pārimatīre khemantabhūmiṃ gato."
    ],
    "innerText": "Suddhena hatthenāti sudhotena parisuddhahatthena. Imasmimpi atthe tādisameva opammaṃ kātabbaṃ – tatheva hi pāraṃ gantukāmo puriso ‘‘kakudharukkhā nāma maṭṭhasākhā, kiliṭṭhahatthena gaṇhantassa hattho parigaleyyā’’ti hatthapāde sudhote katvā ekaṃ sākhaṃ gaṇhitvā paṭhamaṃ rukkhaṃ āruḷho. Tato otaritvā dutiyaṃ…pe… tato otaritvā aṭṭhamaṃ, aṭṭhamarukkhato otaritvā pārimatīre khemantabhūmiṃ gato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ‘‘imehi rukkhehi pārimatīraṃ gamissāmī’’ti tassa purisassa cintitakālo viya yogino ‘‘aṭṭha samāpattiyo samāpajjitvā samāpattito ",
      " vuṭṭhāya arahattaṃ gamissāmī’’ti cintitakālo, suddhena hatthena sākhāgahaṇaṃ viya jhānavipassanānaṃ pāripanthikadhamme sodhetvā samāpattisamāpajjanaṃ. Tattha paṭhamarukkhārohaṇakālo viya paṭhamajjhānasamāpattikālo, paṭhamarukkhato oruyha dutiyaṃ ",
      " āruḷhakālo viya paṭhamajjhāne nikantiyā abaddhassa tato vuṭṭhāya dutiyajjhānasamāpannakālo…pe… sattamarukkhato oruyha aṭṭhamaṃ āruḷhakālo viya ākiñcaññāyatanasamāpattiyaṃ nikantiyā abaddhassa tato vuṭṭhāya nevasaññānāsaññāyatanasamāpannakālo. Aṭṭhamarukkhato oruyha pārimatīraṃ khemantabhūmiṃ gatakālo viya nevasaññānāsaññāyatane nikantiyā abaddhassa samāpattito vuṭṭhāya saṅkhāre sammasitvā arahattappattakālo veditabbo."
    ],
    "innerText": "Tattha ‘‘imehi rukkhehi pārimatīraṃ gamissāmī’’ti tassa purisassa cintitakālo viya yogino ‘‘aṭṭha samāpattiyo samāpajjitvā samāpattito vuṭṭhāya arahattaṃ gamissāmī’’ti cintitakālo, suddhena hatthena sākhāgahaṇaṃ viya jhānavipassanānaṃ pāripanthikadhamme sodhetvā samāpattisamāpajjanaṃ. Tattha paṭhamarukkhārohaṇakālo viya paṭhamajjhānasamāpattikālo, paṭhamarukkhato oruyha dutiyaṃ āruḷhakālo viya paṭhamajjhāne nikantiyā abaddhassa tato vuṭṭhāya dutiyajjhānasamāpannakālo…pe… sattamarukkhato oruyha aṭṭhamaṃ āruḷhakālo viya ākiñcaññāyatanasamāpattiyaṃ nikantiyā abaddhassa tato vuṭṭhāya nevasaññānāsaññāyatanasamāpannakālo. Aṭṭhamarukkhato oruyha pārimatīraṃ khemantabhūmiṃ gatakālo viya nevasaññānāsaññāyatane nikantiyā abaddhassa samāpattito vuṭṭhāya saṅkhāre sammasitvā arahattappattakālo veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avijjāppabhedaṃ manasi karotī"
      },
      "ti aṭṭhasu ṭhānesu aññāṇabhūtāya gaṇabahalamahāavijjāya pabhedasaṅkhātaṃ arahattaṃ manasi karoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na pakkhandatī"
      },
      "ti ārammaṇavaseneva na pakkhandati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jambālī"
      },
      "ti gāmato nikkhantassa mahāudakassa patiṭṭhānabhūto mahāāvāṭo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anekavassagaṇikā"
      },
      "ti ",
      " gāmassa vā nagarassa vā uppannakāleyeva uppannattā anekāni vassagaṇāni uppannāya etissāti anekavassagaṇikā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āyamukhānī"
      },
      "ti catasso pavisanakandarā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Apāyamukhānī"
      },
      "ti apavāhanacchiddāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na āḷippabhedo pāṭikaṅkho"
      },
      "ti na pāḷippabhedo pāṭikaṅkhitabbo. Na hi tato udakaṃ uṭṭhāya pāḷiṃ bhinditvā kacavaraṃ gahetvā mahāsamuddaṃ pāpuṇāti."
    ],
    "innerText": "Avijjāppabhedaṃ manasi karotīti aṭṭhasu ṭhānesu aññāṇabhūtāya gaṇabahalamahāavijjāya pabhedasaṅkhātaṃ arahattaṃ manasi karoti. Na pakkhandatīti ārammaṇavaseneva na pakkhandati. Jambālīti gāmato nikkhantassa mahāudakassa patiṭṭhānabhūto mahāāvāṭo. Anekavassagaṇikāti gāmassa vā nagarassa vā uppannakāleyeva uppannattā anekāni vassagaṇāni uppannāya etissāti anekavassagaṇikā. Āyamukhānīti catasso pavisanakandarā. Apāyamukhānīti apavāhanacchiddāni. Na āḷippabhedo pāṭikaṅkhoti na pāḷippabhedo pāṭikaṅkhitabbo. Na hi tato udakaṃ uṭṭhāya pāḷiṃ bhinditvā kacavaraṃ gahetvā mahāsamuddaṃ pāpuṇāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Imassa panatthassa vibhāvanatthaṃ uyyānagavesakaopammaṃ āharitabbaṃ. Eko ",
      " kira nagaravāsiko kulaputto uyyānaṃ gavesanto nagarato nātidūre naccāsanne mahantaṃ jambāliṃ addasa. So ‘‘imasmiṃ ṭhāne ramaṇīyaṃ uyyānaṃ bhavissatī’’ti sallakkhetvā kuddālaṃ ādāya cattāripi kandarāni pidhāya apavāhanacchiddāni vivaritvā aṭṭhāsi. Devo na sammā vassi, avasesaudakaṃ apavāhanacchiddena parissavitvā gataṃ. Cammakhaṇḍapilotikādīni tattheva pūtikāni jātāni, pāṇakā saṇṭhitā, samantā anupagamanīyā jātā. Upagatānampi nāsāpuṭe pidhāya pakkamitabbaṃ hoti ",
      ". So katipāhena āgantvā paṭikkamma ṭhito oloketvā ‘‘na sakkā upagantu’’nti pakkāmi."
    ],
    "innerText": "Imassa panatthassa vibhāvanatthaṃ uyyānagavesakaopammaṃ āharitabbaṃ. Eko kira nagaravāsiko kulaputto uyyānaṃ gavesanto nagarato nātidūre naccāsanne mahantaṃ jambāliṃ addasa. So ‘‘imasmiṃ ṭhāne ramaṇīyaṃ uyyānaṃ bhavissatī’’ti sallakkhetvā kuddālaṃ ādāya cattāripi kandarāni pidhāya apavāhanacchiddāni vivaritvā aṭṭhāsi. Devo na sammā vassi, avasesaudakaṃ apavāhanacchiddena parissavitvā gataṃ. Cammakhaṇḍapilotikādīni tattheva pūtikāni jātāni, pāṇakā saṇṭhitā, samantā anupagamanīyā jātā. Upagatānampi nāsāpuṭe pidhāya pakkamitabbaṃ hoti . So katipāhena āgantvā paṭikkamma ṭhito oloketvā ‘‘na sakkā upagantu’’nti pakkāmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha nagaravāsī kulaputto viya yogāvacaro daṭṭhabbo, uyyānaṃ gavesantena gāmadvāre jambāliyā diṭṭhakālo viya cātumahābhūtikakāyo, āyamukhānaṃ pihitakālo viya dhammassavanodakassa aladdhakālo, apāyamukhānaṃ vivaṭakālo viya chadvārikasaṃvarassa vissaṭṭhakālo, devassa sammā avuṭṭhakālo viya sappāyakammaṭṭhānassa aladdhakālo, avasesaudakassa apāyamukhehi parissavitvā gatakālo viya abbhantare guṇānaṃ parihīnakālo, udakassa uṭṭhāya pāḷiṃ bhinditvā kacavaraṃ ādāya mahāsamuddaṃ pāpuṇituṃ asamatthakālo viya arahattamaggena avijjāpāḷiṃ bhinditvā kilesarāsiṃ vidhamitvā nibbānaṃ sacchikātuṃ asamatthakālo, cammakhaṇḍapilotikādīnaṃ tattheva pūtibhāvo viya abbhantare rāgādikilesehi paripūritakālo, tassa āgantvā disvā ",
      " vippaṭisārino gatakālo viya vaṭṭasamaṅgipuggalassa vaṭṭe abhiratakālo veditabbo."
    ],
    "innerText": "Tattha nagaravāsī kulaputto viya yogāvacaro daṭṭhabbo, uyyānaṃ gavesantena gāmadvāre jambāliyā diṭṭhakālo viya cātumahābhūtikakāyo, āyamukhānaṃ pihitakālo viya dhammassavanodakassa aladdhakālo, apāyamukhānaṃ vivaṭakālo viya chadvārikasaṃvarassa vissaṭṭhakālo, devassa sammā avuṭṭhakālo viya sappāyakammaṭṭhānassa aladdhakālo, avasesaudakassa apāyamukhehi parissavitvā gatakālo viya abbhantare guṇānaṃ parihīnakālo, udakassa uṭṭhāya pāḷiṃ bhinditvā kacavaraṃ ādāya mahāsamuddaṃ pāpuṇituṃ asamatthakālo viya arahattamaggena avijjāpāḷiṃ bhinditvā kilesarāsiṃ vidhamitvā nibbānaṃ sacchikātuṃ asamatthakālo, cammakhaṇḍapilotikādīnaṃ tattheva pūtibhāvo viya abbhantare rāgādikilesehi paripūritakālo, tassa āgantvā disvā vippaṭisārino gatakālo viya vaṭṭasamaṅgipuggalassa vaṭṭe abhiratakālo veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āḷippabhedo pāṭikaṅkho"
      },
      "ti pāḷippabhedo pāṭikaṅkhitabbo. Tato hi udakaṃ uṭṭhāya pāḷiṃ bhinditvā kacavaraṃ ādāya mahāsamuddaṃ pāpuṇituṃ sakkhissatīti attho."
    ],
    "innerText": "Āḷippabhedo pāṭikaṅkhoti pāḷippabhedo pāṭikaṅkhitabbo. Tato hi udakaṃ uṭṭhāya pāḷiṃ bhinditvā kacavaraṃ ādāya mahāsamuddaṃ pāpuṇituṃ sakkhissatīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idhāpi ",
      " tadeva opammaṃ āharitabbaṃ. Tattha āyamukhānaṃ vivaṭakālo viya sappāyadhammassavanassa laddhakālo, apāyamukhānaṃ pihitakālo viya chasu dvāresu saṃvarassa paccupaṭṭhitakālo, devassa sammā vuṭṭhakālo viya sappāyakammaṭṭhānassa laddhakālo, udakassa uṭṭhāya pāḷiṃ bhinditvā kacavaraṃ ādāya mahāsamuddaṃ pattakālo viya arahattamaggena avijjaṃ bhinditvā akusalarāsiṃ vidhamitvā arahattaṃ sacchikatakālo, āyamukhehi paviṭṭhena udakena sarassa paripuṇṇakālo viya abbhantare lokuttaradhammehi paripuṇṇakālo, samantato vatiṃ katvā rukkhe ropetvā uyyānamajjhe pāsādaṃ māpetvā nāṭakāni paccupaṭṭhapetvā subhojanaṃ bhuñjantassa nisinnakālo viya dhammapāsādaṃ āruyha ",
      " nibbānārammaṇaṃ phalasamāpattiṃ appetvā nisinnakālo veditabbo. Sesamettha uttānatthameva. Desanā pana lokiyalokuttaramissikā kathitāti."
    ],
    "innerText": "Idhāpi tadeva opammaṃ āharitabbaṃ. Tattha āyamukhānaṃ vivaṭakālo viya sappāyadhammassavanassa laddhakālo, apāyamukhānaṃ pihitakālo viya chasu dvāresu saṃvarassa paccupaṭṭhitakālo, devassa sammā vuṭṭhakālo viya sappāyakammaṭṭhānassa laddhakālo, udakassa uṭṭhāya pāḷiṃ bhinditvā kacavaraṃ ādāya mahāsamuddaṃ pattakālo viya arahattamaggena avijjaṃ bhinditvā akusalarāsiṃ vidhamitvā arahattaṃ sacchikatakālo, āyamukhehi paviṭṭhena udakena sarassa paripuṇṇakālo viya abbhantare lokuttaradhammehi paripuṇṇakālo, samantato vatiṃ katvā rukkhe ropetvā uyyānamajjhe pāsādaṃ māpetvā nāṭakāni paccupaṭṭhapetvā subhojanaṃ bhuñjantassa nisinnakālo viya dhammapāsādaṃ āruyha nibbānārammaṇaṃ phalasamāpattiṃ appetvā nisinnakālo veditabbo. Sesamettha uttānatthameva. Desanā pana lokiyalokuttaramissikā kathitāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Nibbānasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "179"
      },
      ". Navame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hānabhāgiyā saññā"
      },
      "tiādīsu ‘‘paṭhamassa jhānassa lābhiṃ kāmasahagatā saññāmanasikārā samudācaranti, hānabhāginī paññā’’ti (vibha. 799) abhidhamme vuttanayeneva attho veditabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathābhūtaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nappajānantī"
      },
      "ti yathāsabhāvato maggañāṇena na jānanti."
    ],
    "innerText": "179. Navame hānabhāgiyā saññātiādīsu ‘‘paṭhamassa jhānassa lābhiṃ kāmasahagatā saññāmanasikārā samudācaranti, hānabhāginī paññā’’ti (vibha. 799) abhidhamme vuttanayeneva attho veditabbo. Yathābhūtaṃnappajānantīti yathāsabhāvato maggañāṇena na jānanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Mahāpadesasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "180"
      },
      ". Dasame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhoganagare viharatī"
      },
      "ti parinibbānasamaye cārikaṃ caranto taṃ nagaraṃ patvā tattha viharati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ānandacetiye"
      },
      "ti ānandayakkhassa bhavanaṭṭhāne patiṭṭhitavihāre. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahāpadese"
      },
      "ti mahāokāse mahāapadese vā, buddhādayo mahante mahante apadisitvā vuttāni mahākāraṇānīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Neva abhinanditabba"
      },
      "nti haṭṭhatuṭṭhehi sādhukāraṃ datvā pubbeva na sotabbaṃ. Evaṃ kate hi pacchā ‘‘idaṃ na sametī’’ti vuccamānopi ‘‘kiṃ pubbeva ayaṃ dhammo, idāni na dhammo’’ti vatvā laddhiṃ na vissajjeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nappaṭikkositabba"
      },
      "nti ‘‘kiṃ esa bālo vadatī’’ti evaṃ pubbeva na vattabbaṃ. Evaṃ vutte hi vattuṃ yuttampi na vakkhati. Tenāha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anabhinanditvā appaṭikkositvā"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Padabyañjanānī"
      },
      "ti padasaṅkhātāni byañjanāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sādhukaṃ uggahetvā"
      },
      "ti ‘‘imasmiṃ ṭhāne pāḷi vuttā, imasmiṃ ṭhāne attho vutto, imasmiṃ ṭhāne anusandhi kathitā ",
      ", imasmiṃ ṭhāne pubbāparaṃ kathita’’nti suṭṭhu gahetvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sutte otāretabbānī"
      },
      "ti sutte otaritabbāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vinaye sandassetabbānī"
      },
      "ti vinaye saṃsandetabbāni."
    ],
    "innerText": "180. Dasame bhoganagare viharatīti parinibbānasamaye cārikaṃ caranto taṃ nagaraṃ patvā tattha viharati. Ānandacetiyeti ānandayakkhassa bhavanaṭṭhāne patiṭṭhitavihāre. Mahāpadeseti mahāokāse mahāapadese vā, buddhādayo mahante mahante apadisitvā vuttāni mahākāraṇānīti attho. Neva abhinanditabbanti haṭṭhatuṭṭhehi sādhukāraṃ datvā pubbeva na sotabbaṃ. Evaṃ kate hi pacchā ‘‘idaṃ na sametī’’ti vuccamānopi ‘‘kiṃ pubbeva ayaṃ dhammo, idāni na dhammo’’ti vatvā laddhiṃ na vissajjeti. Nappaṭikkositabbanti ‘‘kiṃ esa bālo vadatī’’ti evaṃ pubbeva na vattabbaṃ. Evaṃ vutte hi vattuṃ yuttampi na vakkhati. Tenāha – anabhinanditvā appaṭikkositvāti. Padabyañjanānīti padasaṅkhātāni byañjanāni. Sādhukaṃ uggahetvāti ‘‘imasmiṃ ṭhāne pāḷi vuttā, imasmiṃ ṭhāne attho vutto, imasmiṃ ṭhāne anusandhi kathitā , imasmiṃ ṭhāne pubbāparaṃ kathita’’nti suṭṭhu gahetvā. Sutte otāretabbānīti sutte otaritabbāni. Vinaye sandassetabbānīti vinaye saṃsandetabbāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettha ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sutta"
      },
      "nti vinayo vutto. Yathāha – ‘‘kattha paṭikkhittaṃ, sāvatthiyaṃ suttavibhaṅge’’ti (cūḷava. 457) ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vinayo"
      },
      "ti khandhako. Yathāha – ‘‘vinayātisāre’’ti. Evaṃ vinayapiṭakampi na pariyādiyati. Ubhatovibhaṅgā pana ",
      " suttaṃ, khandhakaparivārā ",
      " vinayoti evaṃ vinayapiṭakaṃ pariyādiyati. Atha vā suttantapiṭakaṃ suttaṃ, vinayapiṭakaṃ vinayoti evaṃ dveyeva piṭakāni pariyādiyanti. Suttantābhidhammapiṭakāni vā suttaṃ, vinayapiṭakaṃ vinayoti evampi tīṇi piṭakāni na tāva pariyādiyanti. Asuttanāmakañhi buddhavacanaṃ nāma atthi. Seyyathidaṃ – jātakaṃ paṭisambhidā niddeso suttanipāto dhammapadaṃ udānaṃ itivuttakaṃ vimānavatthu petavatthu theragāthā therīgāthā apadānanti."
    ],
    "innerText": "Ettha ca suttanti vinayo vutto. Yathāha – ‘‘kattha paṭikkhittaṃ, sāvatthiyaṃ suttavibhaṅge’’ti (cūḷava. 457) vinayoti khandhako. Yathāha – ‘‘vinayātisāre’’ti. Evaṃ vinayapiṭakampi na pariyādiyati. Ubhatovibhaṅgā pana suttaṃ, khandhakaparivārā vinayoti evaṃ vinayapiṭakaṃ pariyādiyati. Atha vā suttantapiṭakaṃ suttaṃ, vinayapiṭakaṃ vinayoti evaṃ dveyeva piṭakāni pariyādiyanti. Suttantābhidhammapiṭakāni vā suttaṃ, vinayapiṭakaṃ vinayoti evampi tīṇi piṭakāni na tāva pariyādiyanti. Asuttanāmakañhi buddhavacanaṃ nāma atthi. Seyyathidaṃ – jātakaṃ paṭisambhidā niddeso suttanipāto dhammapadaṃ udānaṃ itivuttakaṃ vimānavatthu petavatthu theragāthā therīgāthā apadānanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sudinnatthero pana ‘‘asuttanāmakaṃ buddhavacanaṃ natthī’’ti taṃ sabbaṃ paṭikkhipitvā ‘‘tīṇi piṭakāni suttaṃ, vinayo pana kāraṇa’’nti āha. Tato taṃ kāraṇaṃ dassento idaṃ suttamāhari –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Ye kho tvaṃ, gotami, dhamme jāneyyāsi, ime dhammā sarāgāya saṃvattanti no virāgāya, saṃyogāya saṃvattanti no visaṃyogāya, saupādānāya saṃvattanti no anupādānāya, mahicchatāya saṃvattanti no appicchatāya, asantuṭṭhiyā saṃvattanti no santuṭṭhiyā, kosajjāya saṃvattanti no vīriyārambhāya, saṅgaṇikāya saṃvattanti no pavivekāya, ācayāya saṃvattanti no apacayāya. Ekaṃsena, gotami, jāneyyāsi ‘neso dhammo neso vinayo netaṃ satthu sāsana’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Ye ca kho tvaṃ, gotami, dhamme jāneyyāsi, ime dhammā virāgāya saṃvattanti no sarāgāya, visaṃyogāya saṃvattanti no saṃyogāya. Anupādānāya saṃvattanti no saupādānāya, appicchatāya saṃvattanti no mahicchatāya, santuṭṭhiyā saṃvattanti no asantuṭṭhiyā, vīriyārambhāya saṃvattanti no kosajjāya, pavivekāya saṃvattanti no saṅgaṇikāya, apacayāya saṃvattanti no ācayāya. Ekaṃsena, gotami ",
      ", jāneyyāsi ‘eso ",
      " dhammo eso vinayo etaṃ satthu sāsana’’’nti (cūḷava. 406; a. ni. 8.53)."
    ],
    "innerText": "‘‘Ye ca kho tvaṃ, gotami, dhamme jāneyyāsi, ime dhammā virāgāya saṃvattanti no sarāgāya, visaṃyogāya saṃvattanti no saṃyogāya. Anupādānāya saṃvattanti no saupādānāya, appicchatāya saṃvattanti no mahicchatāya, santuṭṭhiyā saṃvattanti no asantuṭṭhiyā, vīriyārambhāya saṃvattanti no kosajjāya, pavivekāya saṃvattanti no saṅgaṇikāya, apacayāya saṃvattanti no ācayāya. Ekaṃsena, gotami , jāneyyāsi ‘eso dhammo eso vinayo etaṃ satthu sāsana’’’nti (cūḷava. 406; a. ni. 8.53)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sutte"
      },
      "ti tepiṭakabuddhavacane otāretabbāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vinaye"
      },
      "ti etasmiṃ rāgādivinayakāraṇe saṃsandetabbānīti ayamettha attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na ceva sutte otarantī"
      },
      "ti suttapaṭipāṭiyā katthaci anāgantvā challiṃ uṭṭhapetvā ",
      " guḷhavessantara-guḷhaummagga-guḷhavinayavedallapiṭakānaṃ aññatarato āgatāni paññāyantīti attho. Evaṃ āgatāni hi rāgādivinaye ca apaññāyamānāni chaḍḍetabbāni honti. Tena vuttaṃ – ‘‘iti hidaṃ, bhikkhave, chaḍḍeyyāthā’’ti. Etenupāyena sabbattha attho veditabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idaṃ, bhikkhave, catutthaṃ mahāpadesaṃ dhāreyyāthā"
      },
      "ti imaṃ, bhikkhave, catutthaṃ dhammassa patiṭṭhānokāsaṃ dhāreyyāthāti."
    ],
    "innerText": "Tasmā sutteti tepiṭakabuddhavacane otāretabbāni. Vinayeti etasmiṃ rāgādivinayakāraṇe saṃsandetabbānīti ayamettha attho. Na ceva sutte otarantīti suttapaṭipāṭiyā katthaci anāgantvā challiṃ uṭṭhapetvā guḷhavessantara-guḷhaummagga-guḷhavinayavedallapiṭakānaṃ aññatarato āgatāni paññāyantīti attho. Evaṃ āgatāni hi rāgādivinaye ca apaññāyamānāni chaḍḍetabbāni honti. Tena vuttaṃ – ‘‘iti hidaṃ, bhikkhave, chaḍḍeyyāthā’’ti. Etenupāyena sabbattha attho veditabbo. Idaṃ, bhikkhave, catutthaṃ mahāpadesaṃ dhāreyyāthāti imaṃ, bhikkhave, catutthaṃ dhammassa patiṭṭhānokāsaṃ dhāreyyāthāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sañcetaniyavaggo tatiyo."
  }
]