[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "4. Rāgapeyyālaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "231"
      },
      ". ‘‘Rāgassa ",
      ", bhikkhave, abhiññāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Rāgassa, bhikkhave, abhiññāya ime dve dhammā bhāvetabbā’’ti."
    ],
    "innerText": "231. ‘‘Rāgassa , bhikkhave, abhiññāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Rāgassa, bhikkhave, abhiññāya ime dve dhammā bhāvetabbā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Rāgassa, bhikkhave, pariññāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Rāgassa, bhikkhave, pariññā ime dve dhammā bhāvetabbā. Rāgassa, bhikkhave, parikkhayāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Rāgassa, bhikkhave, parikkhayā ime dve dhammā bhāvetabbā. Rāgassa, bhikkhave, pahānāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Rāgassa, bhikkhave, pahānā ime dve dhammā bhāvetabbā. Rāgassa, bhikkhave, khayāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Rāgassa, bhikkhave, khayā ime dve dhammā bhāvetabbā. Rāgassa, bhikkhave, vayāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Rāgassa, bhikkhave, vayā ime dve dhammā bhāvetabbā. Rāgassa, bhikkhave, virāgāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Rāgassa, bhikkhave, virāgā ime dve dhammā bhāvetabbā. Rāgassa, bhikkhave, nirodhāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Rāgassa, bhikkhave, nirodhā ime dve dhammā bhāvetabbā. Rāgassa, bhikkhave, cāgāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Rāgassa, bhikkhave, cāgā ime dve dhammā bhāvetabbā. Rāgassa, bhikkhave, paṭinissaggāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Rāgassa, bhikkhave, paṭinissaggāya ime dve dhammā bhāvetabbā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "232-246"
      },
      ". ‘‘Dosassa…pe… mohassa… kodhassa… upanāhassa… makkhassa… paḷāsassa… issāya… macchariyassa… māyāya… sāṭheyyassa… thambhassa… sārambhassa… mānassa… atimānassa… madassa… pamādassa, bhikkhave, abhiññāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Pamādassa, bhikkhave, abhiññā ime dve dhammā bhāvetabbā. Pamādassa, bhikkhave, pariññāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Pamādassa, bhikkhave, pariññā ime dve dhammā bhāvetabbā. Pamādassa, bhikkhave, parikkhayāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Pamādassa ",
      ", bhikkhave, parikkhayāya ime dve dhammā bhāvetabbā. Pamādassa, bhikkhave, pahānāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Pamādassa, bhikkhave, pahānā ime dve dhammā bhāvetabbā. Pamādassa, bhikkhave, khayāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Pamādassa, bhikkhave, khayā ime dve dhammā bhāvetabbā. Pamādassa, bhikkhave, vayāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Pamādassa, bhikkhave, vayā ime dve dhammā bhāvetabbā. Pamādassa, bhikkhave, virāgāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Pamādassa, bhikkhave, virāgā ime dve dhammā bhāvetabbā. Pamādassa, bhikkhave, nirodhāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Pamādassa, bhikkhave, nirodhā ime dve dhammā bhāvetabbā. Pamādassa, bhikkhave, cāgāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Pamādassa, bhikkhave, cāgā ime dve dhammā bhāvetabbā. Pamādassa, bhikkhave, paṭinissaggāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Pamādassa, bhikkhave, paṭinissaggāya ime dve dhammā bhāvetabbā’’ti."
    ],
    "innerText": "232-246. ‘‘Dosassa…pe… mohassa… kodhassa… upanāhassa… makkhassa… paḷāsassa… issāya… macchariyassa… māyāya… sāṭheyyassa… thambhassa… sārambhassa… mānassa… atimānassa… madassa… pamādassa, bhikkhave, abhiññāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Pamādassa, bhikkhave, abhiññā ime dve dhammā bhāvetabbā. Pamādassa, bhikkhave, pariññāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Pamādassa, bhikkhave, pariññā ime dve dhammā bhāvetabbā. Pamādassa, bhikkhave, parikkhayāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Pamādassa , bhikkhave, parikkhayāya ime dve dhammā bhāvetabbā. Pamādassa, bhikkhave, pahānāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Pamādassa, bhikkhave, pahānā ime dve dhammā bhāvetabbā. Pamādassa, bhikkhave, khayāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Pamādassa, bhikkhave, khayā ime dve dhammā bhāvetabbā. Pamādassa, bhikkhave, vayāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Pamādassa, bhikkhave, vayā ime dve dhammā bhāvetabbā. Pamādassa, bhikkhave, virāgāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Pamādassa, bhikkhave, virāgā ime dve dhammā bhāvetabbā. Pamādassa, bhikkhave, nirodhāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Pamādassa, bhikkhave, nirodhā ime dve dhammā bhāvetabbā. Pamādassa, bhikkhave, cāgāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Pamādassa, bhikkhave, cāgā ime dve dhammā bhāvetabbā. Pamādassa, bhikkhave, paṭinissaggāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Pamādassa, bhikkhave, paṭinissaggāya ime dve dhammā bhāvetabbā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "(Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṃ abhinandunti.) ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[( ) etthantare pāṭho sī. syā. kaṃ. pī. potthakesu natthi]"
      }
    ],
    "innerText": "(Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṃ abhinandunti.) [( ) etthantare pāṭho sī. syā. kaṃ. pī. potthakesu natthi]"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Rāgapeyyālaṃ niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dukanipātapāḷi niṭṭhitā."
  }
]