[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "(16) 6. Acelakavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "157-163"
      },
      ". ‘‘Tisso ",
      " imā, bhikkhave, paṭipadā. Katamā tisso? Āgāḷhā paṭipadā, nijjhāmā paṭipadā, majjhimā paṭipadā. Katamā ca, bhikkhave, āgāḷhā paṭipadā? Idha, bhikkhave, ekacco evaṃvādī hoti evaṃdiṭṭhi – ‘natthi kāmesu doso’ti. So kāmesu pātabyataṃ āpajjati. Ayaṃ vuccati, bhikkhave, āgāḷhā paṭipadā."
    ],
    "innerText": "157-163. ‘‘Tisso imā, bhikkhave, paṭipadā. Katamā tisso? Āgāḷhā paṭipadā, nijjhāmā paṭipadā, majjhimā paṭipadā. Katamā ca, bhikkhave, āgāḷhā paṭipadā? Idha, bhikkhave, ekacco evaṃvādī hoti evaṃdiṭṭhi – ‘natthi kāmesu doso’ti. So kāmesu pātabyataṃ āpajjati. Ayaṃ vuccati, bhikkhave, āgāḷhā paṭipadā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamā ca, bhikkhave, nijjhāmā paṭipadā? Idha, bhikkhave, ekacco acelako hoti muttācāro, hatthāpalekhano ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[hatthāvalekhano (syā. kaṃ.) dī. ni. 1.394; ma. ni. 1.155 passitabbaṃ]"
      },
      ", na ehibhadantiko, na tiṭṭhabhadantiko, nābhihaṭaṃ na uddissakataṃ na nimantanaṃ sādiyati. So na kumbhimukhā paṭiggaṇhāti, na kaḷopimukhā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[khaḷopimukhā (sī. syā. kaṃ.)]"
      },
      " paṭiggaṇhāti na eḷakamantaraṃ na daṇḍamantaraṃ na musalamantaraṃ na dvinnaṃ bhuñjamānānaṃ na gabbhiniyā na pāyamānāya na purisantaragatāya na saṅkittīsu na yattha sā upaṭṭhito hoti na yattha makkhikā saṇḍasaṇḍacārinī na macchaṃ na maṃsaṃ na suraṃ na merayaṃ, na thusodakaṃ pivati. So ekāgāriko vā hoti ekālopiko, dvāgāriko vā hoti dvālopiko… sattāgāriko vā hoti sattālopiko; ekissāpi dattiyā yāpeti, dvīhipi dattīhi yāpeti… sattahipi dattīhi yāpeti; ekāhikampi āhāraṃ āhāreti, dvāhikampi āhāraṃ āhāreti… sattāhikampi āhāraṃ āhāreti – iti evarūpaṃ addhamāsikampi pariyāyabhattabhojanānuyogamanuyutto viharati."
    ],
    "innerText": "‘‘Katamā ca, bhikkhave, nijjhāmā paṭipadā? Idha, bhikkhave, ekacco acelako hoti muttācāro, hatthāpalekhano [hatthāvalekhano (syā. kaṃ.) dī. ni. 1.394; ma. ni. 1.155 passitabbaṃ], na ehibhadantiko, na tiṭṭhabhadantiko, nābhihaṭaṃ na uddissakataṃ na nimantanaṃ sādiyati. So na kumbhimukhā paṭiggaṇhāti, na kaḷopimukhā [khaḷopimukhā (sī. syā. kaṃ.)] paṭiggaṇhāti na eḷakamantaraṃ na daṇḍamantaraṃ na musalamantaraṃ na dvinnaṃ bhuñjamānānaṃ na gabbhiniyā na pāyamānāya na purisantaragatāya na saṅkittīsu na yattha sā upaṭṭhito hoti na yattha makkhikā saṇḍasaṇḍacārinī na macchaṃ na maṃsaṃ na suraṃ na merayaṃ, na thusodakaṃ pivati. So ekāgāriko vā hoti ekālopiko, dvāgāriko vā hoti dvālopiko… sattāgāriko vā hoti sattālopiko; ekissāpi dattiyā yāpeti, dvīhipi dattīhi yāpeti… sattahipi dattīhi yāpeti; ekāhikampi āhāraṃ āhāreti, dvāhikampi āhāraṃ āhāreti… sattāhikampi āhāraṃ āhāreti – iti evarūpaṃ addhamāsikampi pariyāyabhattabhojanānuyogamanuyutto viharati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "So sākabhakkhopi hoti, sāmākabhakkhopi hoti, nīvārabhakkhopi hoti, daddulabhakkhopi hoti, haṭabhakkhopi hoti ",
      ", kaṇhabhakkhopi hoti, ācāmabhakkhopi hoti, piññākabhakkhopi hoti, tiṇabhakkhopi hoti, gomayabhakkhopi hoti, vanamūlaphalāhāro yāpeti pavattaphalabhojī."
    ],
    "innerText": "So sākabhakkhopi hoti, sāmākabhakkhopi hoti, nīvārabhakkhopi hoti, daddulabhakkhopi hoti, haṭabhakkhopi hoti , kaṇhabhakkhopi hoti, ācāmabhakkhopi hoti, piññākabhakkhopi hoti, tiṇabhakkhopi hoti, gomayabhakkhopi hoti, vanamūlaphalāhāro yāpeti pavattaphalabhojī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "So sāṇānipi dhāreti, masāṇānipi dhāreti, chavadussānipi dhāreti, paṃsukūlānipi dhāreti, tirīṭānipi dhāreti, ajinampi dhāreti, ajinakkhipampi dhāreti, kusacīrampi dhāreti ",
      ", vākacīrampi dhāreti, phalakacīrampi dhāreti, kesakambalampi dhāreti, vāḷakambalampi ",
      " dhāreti, ulūkapakkhikampi ",
      " dhāreti, kesamassulocakopi hoti kesamassulocanānuyogamanuyutto, ubbhaṭṭhakopi hoti āsanapaṭikkhitto, ukkuṭikopi hoti ukkuṭikappadhānamanuyutto, kaṇṭakāpassayikopi hoti kaṇṭakāpassaye seyyaṃ kappeti, sāyatatiyakampi udakorohanānuyogamanuyutto viharati – iti evarūpaṃ anekavihitaṃ kāyassa ātāpanaparitāpanānuyogamanuyutto viharati. Ayaṃ vuccati, bhikkhave, nijjhāmā paṭipadā."
    ],
    "innerText": "So sāṇānipi dhāreti, masāṇānipi dhāreti, chavadussānipi dhāreti, paṃsukūlānipi dhāreti, tirīṭānipi dhāreti, ajinampi dhāreti, ajinakkhipampi dhāreti, kusacīrampi dhāreti , vākacīrampi dhāreti, phalakacīrampi dhāreti, kesakambalampi dhāreti, vāḷakambalampi dhāreti, ulūkapakkhikampi dhāreti, kesamassulocakopi hoti kesamassulocanānuyogamanuyutto, ubbhaṭṭhakopi hoti āsanapaṭikkhitto, ukkuṭikopi hoti ukkuṭikappadhānamanuyutto, kaṇṭakāpassayikopi hoti kaṇṭakāpassaye seyyaṃ kappeti, sāyatatiyakampi udakorohanānuyogamanuyutto viharati – iti evarūpaṃ anekavihitaṃ kāyassa ātāpanaparitāpanānuyogamanuyutto viharati. Ayaṃ vuccati, bhikkhave, nijjhāmā paṭipadā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamā ca, bhikkhave, majjhimā paṭipadā? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā vineyya loke abhijjhādomanassaṃ. Ayaṃ vuccati, bhikkhave, majjhimā paṭipadā. Imā kho, bhikkhave, tisso paṭipadā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tisso imā, bhikkhave, paṭipadā. Katamā tisso? Āgāḷhā paṭipadā, nijjhāmā paṭipadā, majjhimā paṭipadā. Katamā ca, bhikkhave, āgāḷhā paṭipadā…pe… ayaṃ vuccati, bhikkhave, āgāḷhā paṭipadā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamā ca, bhikkhave, nijjhāmā paṭipadā…pe… ayaṃ vuccati, bhikkhave, nijjhāmā paṭipadā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamā ",
      " ca, bhikkhave, majjhimā paṭipadā? Idha, bhikkhave, bhikkhu anuppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ anuppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati; uppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati; anuppannānaṃ kusalānaṃ dhammānaṃ uppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati; uppannānaṃ kusalānaṃ dhammānaṃ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṃ ",
      " janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati…."
    ],
    "innerText": "‘‘Katamā ca, bhikkhave, majjhimā paṭipadā? Idha, bhikkhave, bhikkhu anuppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ anuppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati; uppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati; anuppannānaṃ kusalānaṃ dhammānaṃ uppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati; uppannānaṃ kusalānaṃ dhammānaṃ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Chandasamādhipadhānasaṅkhārasamannāgataṃ ",
      " iddhipādaṃ bhāveti vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhipadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti…pe…."
    ],
    "innerText": "‘‘Chandasamādhipadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti vīriyasamādhi…pe… cittasamādhi…pe… vīmaṃsāsamādhipadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Saddhindriyaṃ bhāveti… vīriyindriyaṃ bhāveti… satindriyaṃ bhāveti… samādhindriyaṃ bhāveti… paññindriyaṃ bhāveti…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Saddhābalaṃ ",
      " bhāveti… vīriyabalaṃ bhāveti… satibalaṃ bhāveti… samādhibalaṃ bhāveti… paññābalaṃ bhāveti…."
    ],
    "innerText": "‘‘Saddhābalaṃ bhāveti… vīriyabalaṃ bhāveti… satibalaṃ bhāveti… samādhibalaṃ bhāveti… paññābalaṃ bhāveti…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Satisambojjhaṅgaṃ bhāveti… dhammavicayasambojjhaṅgaṃ bhāveti… vīriyasambojjhaṅgaṃ bhāveti… pītisambojjhaṅgaṃ bhāveti… passaddhisambojjhaṅgaṃ bhāveti… samādhisambojjhaṅgaṃ bhāveti… upekkhāsambojjhaṅgaṃ bhāveti…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sammādiṭṭhiṃ bhāveti… sammāsaṅkappaṃ bhāveti… sammāvācaṃ bhāveti… sammākammantaṃ bhāveti ",
      "… sammāājīvaṃ bhāveti… sammāvāyāmaṃ bhāveti… sammāsatiṃ bhāveti… sammāsamādhiṃ bhāveti…. Ayaṃ vuccati, bhikkhave, majjhimā paṭipadā. Imā kho, bhikkhave, tisso paṭipadā’’ti."
    ],
    "innerText": "‘‘Sammādiṭṭhiṃ bhāveti… sammāsaṅkappaṃ bhāveti… sammāvācaṃ bhāveti… sammākammantaṃ bhāveti … sammāājīvaṃ bhāveti… sammāvāyāmaṃ bhāveti… sammāsatiṃ bhāveti… sammāsamādhiṃ bhāveti…. Ayaṃ vuccati, bhikkhave, majjhimā paṭipadā. Imā kho, bhikkhave, tisso paṭipadā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Acelakavaggo chaṭṭho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Satipaṭṭhānaṃ sammappadhānaṃ, iddhipādindriyena ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Balaṃ bojjhaṅgo maggo ca, paṭipadāya yojayeti."
  }
]