[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "(12) 2. Kesivaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Kesisuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "111"
      },
      ". Atha ",
      " kho kesi assadammasārathi yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho kesiṃ assadammasārathiṃ bhagavā etadavoca – ‘‘tvaṃ khosi, kesi, paññāto assadammasārathīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[saññāto assadammasārathi (sī. syā. kaṃ. pī.)]"
      },
      ". Kathaṃ pana tvaṃ, kesi, assadammaṃ vinesī’’ti? ‘‘Ahaṃ kho, bhante, assadammaṃ saṇhenapi vinemi, pharusenapi vinemi ",
      ", saṇhapharusenapi vinemī’’ti. ‘‘Sace te, kesi, assadammo saṇhena vinayaṃ na upeti, pharusena vinayaṃ na upeti, saṇhapharusena vinayaṃ na upeti, kinti naṃ karosī’’ti? ‘‘Sace me, bhante, assadammo saṇhena vinayaṃ na upeti, pharusena vinayaṃ na upeti, saṇhapharusena vinayaṃ na upeti; hanāmi naṃ, bhante. Taṃ kissa hetu? Mā me ācariyakulassa avaṇṇo ahosī’’ti."
    ],
    "innerText": "111. Atha kho kesi assadammasārathi yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho kesiṃ assadammasārathiṃ bhagavā etadavoca – ‘‘tvaṃ khosi, kesi, paññāto assadammasārathīti [saññāto assadammasārathi (sī. syā. kaṃ. pī.)]. Kathaṃ pana tvaṃ, kesi, assadammaṃ vinesī’’ti? ‘‘Ahaṃ kho, bhante, assadammaṃ saṇhenapi vinemi, pharusenapi vinemi , saṇhapharusenapi vinemī’’ti. ‘‘Sace te, kesi, assadammo saṇhena vinayaṃ na upeti, pharusena vinayaṃ na upeti, saṇhapharusena vinayaṃ na upeti, kinti naṃ karosī’’ti? ‘‘Sace me, bhante, assadammo saṇhena vinayaṃ na upeti, pharusena vinayaṃ na upeti, saṇhapharusena vinayaṃ na upeti; hanāmi naṃ, bhante. Taṃ kissa hetu? Mā me ācariyakulassa avaṇṇo ahosī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Bhagavā pana, bhante, anuttaro purisadammasārathi. Kathaṃ pana, bhante, bhagavā purisadammaṃ vinetī’’ti? ‘‘Ahaṃ kho, kesi, purisadammaṃ saṇhenapi vinemi, pharusenapi vinemi, saṇhapharusenapi vinemi. Tatridaṃ, kesi, saṇhasmiṃ – iti kāyasucaritaṃ iti kāyasucaritassa vipāko, iti vacīsucaritaṃ iti vacīsucaritassa vipāko, iti manosucaritaṃ iti manosucaritassa vipāko, iti devā, iti manussāti. Tatridaṃ, kesi, pharusasmiṃ – iti kāyaduccaritaṃ iti kāyaduccaritassa vipāko, iti vacīduccaritaṃ iti vacīduccaritassa vipāko, iti manoduccaritaṃ iti manoduccaritassa vipāko, iti nirayo, iti tiracchānayoni, iti pettivisayo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tatridaṃ, kesi, saṇhapharusasmiṃ – iti kāyasucaritaṃ iti kāyasucaritassa vipāko, iti kāyaduccaritaṃ iti kāyaduccaritassa vipāko, iti vacīsucaritaṃ iti vacīsucaritassa vipāko, iti vacīduccaritaṃ iti vacīduccaritassa vipāko, iti manosucaritaṃ iti manosucaritassa ",
      " vipāko, iti manoduccaritaṃ iti manoduccaritassa vipāko, iti devā, iti manussā, iti nirayo, iti tiracchānayoni, iti pettivisayo’’ti."
    ],
    "innerText": "‘‘Tatridaṃ, kesi, saṇhapharusasmiṃ – iti kāyasucaritaṃ iti kāyasucaritassa vipāko, iti kāyaduccaritaṃ iti kāyaduccaritassa vipāko, iti vacīsucaritaṃ iti vacīsucaritassa vipāko, iti vacīduccaritaṃ iti vacīduccaritassa vipāko, iti manosucaritaṃ iti manosucaritassa vipāko, iti manoduccaritaṃ iti manoduccaritassa vipāko, iti devā, iti manussā, iti nirayo, iti tiracchānayoni, iti pettivisayo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace ",
      " te, bhante, purisadammo saṇhena vinayaṃ na upeti, pharusena ",
      " vinayaṃ na upeti, saṇhapharusena vinayaṃ na upeti, kinti naṃ bhagavā karotī’’ti? ‘‘Sace me, kesi, purisadammo saṇhena vinayaṃ na upeti, pharusena vinayaṃ na upeti, saṇhapharusena vinayaṃ na upeti, hanāmi naṃ, kesī’’ti. ‘‘Na kho, bhante, bhagavato pāṇātipāto kappati. Atha ca pana bhagavā evamāha – ‘hanāmi, naṃ kesī’’’ti! ‘‘Saccaṃ, kesi! Na tathāgatassa pāṇātipāto kappati. Api ca yo purisadammo saṇhena vinayaṃ na upeti, pharusena vinayaṃ na upeti, saṇhapharusena vinayaṃ na upeti, na taṃ tathāgato vattabbaṃ anusāsitabbaṃ maññati, nāpi viññū sabrahmacārī vattabbaṃ anusāsitabbaṃ maññanti. Vadho heso, kesi, ariyassa vinaye – yaṃ na tathāgato vattabbaṃ anusāsitabbaṃ maññati, nāpi viññū sabrahmacārī vattabbaṃ anusāsitabbaṃ maññantī’’ti."
    ],
    "innerText": "‘‘Sace te, bhante, purisadammo saṇhena vinayaṃ na upeti, pharusena vinayaṃ na upeti, saṇhapharusena vinayaṃ na upeti, kinti naṃ bhagavā karotī’’ti? ‘‘Sace me, kesi, purisadammo saṇhena vinayaṃ na upeti, pharusena vinayaṃ na upeti, saṇhapharusena vinayaṃ na upeti, hanāmi naṃ, kesī’’ti. ‘‘Na kho, bhante, bhagavato pāṇātipāto kappati. Atha ca pana bhagavā evamāha – ‘hanāmi, naṃ kesī’’’ti! ‘‘Saccaṃ, kesi! Na tathāgatassa pāṇātipāto kappati. Api ca yo purisadammo saṇhena vinayaṃ na upeti, pharusena vinayaṃ na upeti, saṇhapharusena vinayaṃ na upeti, na taṃ tathāgato vattabbaṃ anusāsitabbaṃ maññati, nāpi viññū sabrahmacārī vattabbaṃ anusāsitabbaṃ maññanti. Vadho heso, kesi, ariyassa vinaye – yaṃ na tathāgato vattabbaṃ anusāsitabbaṃ maññati, nāpi viññū sabrahmacārī vattabbaṃ anusāsitabbaṃ maññantī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘So hi nūna, bhante, suhato hoti – yaṃ na tathāgato vattabbaṃ anusāsitabbaṃ maññati, nāpi viññū sabrahmacārī vattabbaṃ anusāsitabbaṃ maññantīti. Abhikkantaṃ, bhante, abhikkantaṃ, bhante…pe… upāsakaṃ maṃ, bhante, bhagavā dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Javasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "112"
      },
      ". ‘‘Catūhi ",
      ", bhikkhave, aṅgehi samannāgato rañño bhadro assājānīyo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhaṃ gacchati. Katamehi catūhi? Ajjavena, javena, khantiyā, soraccena – imehi kho, bhikkhave, catūhi aṅgehi samannāgato rañño bhadro assājānīyo rājāraho hoti, rājabhoggo, rañño aṅganteva saṅkhaṃ gacchati."
    ],
    "innerText": "112. ‘‘Catūhi , bhikkhave, aṅgehi samannāgato rañño bhadro assājānīyo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhaṃ gacchati. Katamehi catūhi? Ajjavena, javena, khantiyā, soraccena – imehi kho, bhikkhave, catūhi aṅgehi samannāgato rañño bhadro assājānīyo rājāraho hoti, rājabhoggo, rañño aṅganteva saṅkhaṃ gacchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evamevaṃ kho, bhikkhave, catūhi dhammehi samannāgato bhikkhu āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassa. Katamehi catūhi? Ajjavena, javena, khantiyā, soraccena – imehi ",
      " kho, bhikkhave, catūhi dhammehi samannāgato bhikkhu ",
      " āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassā’’ti. Dutiyaṃ."
    ],
    "innerText": "‘‘Evamevaṃ kho, bhikkhave, catūhi dhammehi samannāgato bhikkhu āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassa. Katamehi catūhi? Ajjavena, javena, khantiyā, soraccena – imehi kho, bhikkhave, catūhi dhammehi samannāgato bhikkhu āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassā’’ti. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Patodasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "113"
      },
      ". ‘‘Cattārome ",
      ", bhikkhave, bhadrā assājānīyā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Idha, bhikkhave, ekacco bhadro assājānīyo patodacchāyaṃ disvā saṃvijjati saṃvegaṃ āpajjati – ‘kiṃ nu kho maṃ ajja assadammasārathi kāraṇaṃ kāressati, kimassāhaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kathamassāhaṃ (ka.)]"
      },
      " paṭikaromī’ti! Evarūpopi, bhikkhave, idhekacco bhadro assājānīyo hoti. Ayaṃ, bhikkhave, paṭhamo bhadro assājānīyo santo saṃvijjamāno lokasmiṃ."
    ],
    "innerText": "113. ‘‘Cattārome , bhikkhave, bhadrā assājānīyā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Idha, bhikkhave, ekacco bhadro assājānīyo patodacchāyaṃ disvā saṃvijjati saṃvegaṃ āpajjati – ‘kiṃ nu kho maṃ ajja assadammasārathi kāraṇaṃ kāressati, kimassāhaṃ [kathamassāhaṃ (ka.)] paṭikaromī’ti! Evarūpopi, bhikkhave, idhekacco bhadro assājānīyo hoti. Ayaṃ, bhikkhave, paṭhamo bhadro assājānīyo santo saṃvijjamāno lokasmiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhikkhave, idhekacco bhadro assājānīyo na heva kho patodacchāyaṃ disvā saṃvijjati saṃvegaṃ āpajjati, api ca kho lomavedhaviddho saṃvijjati saṃvegaṃ āpajjati – ‘kiṃ nu kho maṃ ajja assadammasārathi kāraṇaṃ kāressati, kimassāhaṃ paṭikaromī’ti! Evarūpopi, bhikkhave, idhekacco bhadro ",
      " assājānīyo hoti. Ayaṃ, bhikkhave, dutiyo bhadro assājānīyo santo saṃvijjamāno lokasmiṃ."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, idhekacco bhadro assājānīyo na heva kho patodacchāyaṃ disvā saṃvijjati saṃvegaṃ āpajjati, api ca kho lomavedhaviddho saṃvijjati saṃvegaṃ āpajjati – ‘kiṃ nu kho maṃ ajja assadammasārathi kāraṇaṃ kāressati, kimassāhaṃ paṭikaromī’ti! Evarūpopi, bhikkhave, idhekacco bhadro assājānīyo hoti. Ayaṃ, bhikkhave, dutiyo bhadro assājānīyo santo saṃvijjamāno lokasmiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, bhikkhave, idhekacco bhadro assājānīyo na heva kho patodacchāyaṃ disvā saṃvijjati saṃvegaṃ āpajjati nāpi lomavedhaviddho saṃvijjati saṃvegaṃ āpajjati, api ca kho cammavedhaviddho saṃvijjati saṃvegaṃ āpajjati – ‘kiṃ nu kho maṃ ajja assadammasārathi kāraṇaṃ kāressati, kimassāhaṃ paṭikaromī’ti! Evarūpopi, bhikkhave, idhekacco bhadro assājānīyo hoti. Ayaṃ, bhikkhave, tatiyo bhadro assājānīyo santo saṃvijjamāno lokasmiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhikkhave, idhekacco bhadro assājānīyo na heva kho patodacchāyaṃ disvā saṃvijjati saṃvegaṃ āpajjati nāpi lomavedhaviddho saṃvijjati saṃvegaṃ āpajjati nāpi cammavedhaviddho saṃvijjati saṃvegaṃ āpajjati, api ca kho aṭṭhivedhaviddho saṃvijjati saṃvegaṃ āpajjati – ‘kiṃ ",
      " nu kho maṃ ajja assadammasārathi kāraṇaṃ kāressati, kimassāhaṃ paṭikaromī’ti ",
      "! Evarūpopi, bhikkhave, idhekacco bhadro assājānīyo hoti. Ayaṃ, bhikkhave, catuttho bhadro assājānīyo santo saṃvijjamāno ",
      " lokasmiṃ. Ime kho, bhikkhave, cattāro bhadrā assājānīyā santo saṃvijjamānā lokasmiṃ."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, idhekacco bhadro assājānīyo na heva kho patodacchāyaṃ disvā saṃvijjati saṃvegaṃ āpajjati nāpi lomavedhaviddho saṃvijjati saṃvegaṃ āpajjati nāpi cammavedhaviddho saṃvijjati saṃvegaṃ āpajjati, api ca kho aṭṭhivedhaviddho saṃvijjati saṃvegaṃ āpajjati – ‘kiṃ nu kho maṃ ajja assadammasārathi kāraṇaṃ kāressati, kimassāhaṃ paṭikaromī’ti ! Evarūpopi, bhikkhave, idhekacco bhadro assājānīyo hoti. Ayaṃ, bhikkhave, catuttho bhadro assājānīyo santo saṃvijjamāno lokasmiṃ. Ime kho, bhikkhave, cattāro bhadrā assājānīyā santo saṃvijjamānā lokasmiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evamevaṃ kho, bhikkhave, cattārome bhadrā purisājānīyā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Idha, bhikkhave, ekacco bhadro purisājānīyo suṇāti – ‘amukasmiṃ nāma gāme vā nigame vā itthī vā puriso vā dukkhito vā kālaṅkato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kālakato (sī. syā. kaṃ. pī.)]"
      },
      " vā’ti. So tena saṃvijjati, saṃvegaṃ āpajjati. Saṃviggo yoniso padahati. Pahitatto kāyena ",
      " ceva paramasaccaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[paramatthasaccaṃ (ka.) ma. ni. 2.183 passitabbaṃ]"
      },
      " sacchikaroti, paññāya ca ativijjha passati. Seyyathāpi so, bhikkhave, bhadro assājānīyo patodacchāyaṃ disvā saṃvijjati saṃvegaṃ āpajjati; tathūpamāhaṃ, bhikkhave, imaṃ bhadraṃ purisājānīyaṃ vadāmi. Evarūpopi, bhikkhave, idhekacco bhadro purisājānīyo hoti. Ayaṃ, bhikkhave, paṭhamo bhadro purisājānīyo santo saṃvijjamāno lokasmiṃ."
    ],
    "innerText": "‘‘Evamevaṃ kho, bhikkhave, cattārome bhadrā purisājānīyā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Idha, bhikkhave, ekacco bhadro purisājānīyo suṇāti – ‘amukasmiṃ nāma gāme vā nigame vā itthī vā puriso vā dukkhito vā kālaṅkato [kālakato (sī. syā. kaṃ. pī.)] vā’ti. So tena saṃvijjati, saṃvegaṃ āpajjati. Saṃviggo yoniso padahati. Pahitatto kāyena ceva paramasaccaṃ [paramatthasaccaṃ (ka.) ma. ni. 2.183 passitabbaṃ] sacchikaroti, paññāya ca ativijjha passati. Seyyathāpi so, bhikkhave, bhadro assājānīyo patodacchāyaṃ disvā saṃvijjati saṃvegaṃ āpajjati; tathūpamāhaṃ, bhikkhave, imaṃ bhadraṃ purisājānīyaṃ vadāmi. Evarūpopi, bhikkhave, idhekacco bhadro purisājānīyo hoti. Ayaṃ, bhikkhave, paṭhamo bhadro purisājānīyo santo saṃvijjamāno lokasmiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, bhikkhave, idhekacco bhadro purisājānīyo na heva kho suṇāti – ‘amukasmiṃ nāma gāme vā nigame vā itthī vā puriso vā dukkhito vā kālaṅkato vā’ti, api ca kho sāmaṃ passati itthiṃ vā purisaṃ vā dukkhitaṃ vā kālaṅkataṃ vā. So tena saṃvijjati, saṃvegaṃ āpajjati. Saṃviggo yoniso padahati. Pahitatto kāyena ceva paramasaccaṃ sacchikaroti, paññāya ca ativijjha passati. Seyyathāpi so, bhikkhave, bhadro assājānīyo lomavedhaviddho saṃvijjati saṃvegaṃ āpajjati; tathūpamāhaṃ, bhikkhave, imaṃ bhadraṃ purisājānīyaṃ vadāmi. Evarūpopi, bhikkhave, idhekacco bhadro purisājānīyo hoti. Ayaṃ, bhikkhave, dutiyo bhadro purisājānīyo santo saṃvijjamāno lokasmiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhikkhave, idhekacco bhadro purisājānīyo na heva kho suṇāti – ‘amukasmiṃ nāma gāme vā nigame vā itthī vā puriso vā dukkhito vā kālaṅkato vā’ti, nāpi sāmaṃ passati itthiṃ vā purisaṃ vā dukkhitaṃ vā kālaṅkataṃ vā, api ca khvassa ñāti vā sālohito vā dukkhito vā hoti kālaṅkato vā. So tena saṃvijjati, saṃvegaṃ āpajjati. Saṃviggo ",
      " yoniso padahati. Pahitatto kāyena ",
      " ceva paramasaccaṃ ",
      " sacchikaroti, paññāya ca ativijjha passati. Seyyathāpi so, bhikkhave, bhadro assājānīyo cammavedhaviddho saṃvijjati ",
      " saṃvegaṃ āpajjati; tathūpamāhaṃ, bhikkhave, imaṃ bhadraṃ purisājānīyaṃ vadāmi. Evarūpopi, bhikkhave, idhekacco bhadro purisājānīyo hoti. Ayaṃ, bhikkhave, tatiyo bhadro purisājānīyo santo saṃvijjamāno lokasmiṃ."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, idhekacco bhadro purisājānīyo na heva kho suṇāti – ‘amukasmiṃ nāma gāme vā nigame vā itthī vā puriso vā dukkhito vā kālaṅkato vā’ti, nāpi sāmaṃ passati itthiṃ vā purisaṃ vā dukkhitaṃ vā kālaṅkataṃ vā, api ca khvassa ñāti vā sālohito vā dukkhito vā hoti kālaṅkato vā. So tena saṃvijjati, saṃvegaṃ āpajjati. Saṃviggo yoniso padahati. Pahitatto kāyena ceva paramasaccaṃ sacchikaroti, paññāya ca ativijjha passati. Seyyathāpi so, bhikkhave, bhadro assājānīyo cammavedhaviddho saṃvijjati saṃvegaṃ āpajjati; tathūpamāhaṃ, bhikkhave, imaṃ bhadraṃ purisājānīyaṃ vadāmi. Evarūpopi, bhikkhave, idhekacco bhadro purisājānīyo hoti. Ayaṃ, bhikkhave, tatiyo bhadro purisājānīyo santo saṃvijjamāno lokasmiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhikkhave, idhekacco bhadro purisājānīyo na heva kho suṇāti – ‘amukasmiṃ nāma gāme vā nigame vā itthī vā puriso vā dukkhito vā kālaṅkato vā’ti, nāpi sāmaṃ passati itthiṃ vā purisaṃ vā dukkhitaṃ vā kālaṅkataṃ vā, nāpissa ñāti vā sālohito vā dukkhito vā hoti kālaṅkato vā, api ca kho sāmaññeva phuṭṭho hoti sārīrikāhi vedanāhi dukkhāhi tibbāhi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[tippāhi (sī. pī.)]"
      },
      " kharāhi kaṭukāhi asātāhi amanāpāhi pāṇaharāhi. So tena saṃvijjati, saṃvegaṃ āpajjati. Saṃviggo yoniso padahati. Pahitatto kāyena ceva paramasaccaṃ sacchikaroti, paññāya ca ativijjha passati. Seyyathāpi so, bhikkhave, bhadro assājānīyo aṭṭhivedhaviddho saṃvijjati saṃvegaṃ āpajjati; tathūpamāhaṃ, bhikkhave, imaṃ bhadraṃ purisājānīyaṃ vadāmi. Evarūpopi, bhikkhave, idhekacco bhadro purisājānīyo hoti. Ayaṃ, bhikkhave, catuttho bhadro purisājānīyo santo saṃvijjamāno lokasmiṃ. Ime kho, bhikkhave, cattāro bhadrā purisājānīyā santo saṃvijjamānā lokasmi’’nti. Tatiyaṃ."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, idhekacco bhadro purisājānīyo na heva kho suṇāti – ‘amukasmiṃ nāma gāme vā nigame vā itthī vā puriso vā dukkhito vā kālaṅkato vā’ti, nāpi sāmaṃ passati itthiṃ vā purisaṃ vā dukkhitaṃ vā kālaṅkataṃ vā, nāpissa ñāti vā sālohito vā dukkhito vā hoti kālaṅkato vā, api ca kho sāmaññeva phuṭṭho hoti sārīrikāhi vedanāhi dukkhāhi tibbāhi [tippāhi (sī. pī.)] kharāhi kaṭukāhi asātāhi amanāpāhi pāṇaharāhi. So tena saṃvijjati, saṃvegaṃ āpajjati. Saṃviggo yoniso padahati. Pahitatto kāyena ceva paramasaccaṃ sacchikaroti, paññāya ca ativijjha passati. Seyyathāpi so, bhikkhave, bhadro assājānīyo aṭṭhivedhaviddho saṃvijjati saṃvegaṃ āpajjati; tathūpamāhaṃ, bhikkhave, imaṃ bhadraṃ purisājānīyaṃ vadāmi. Evarūpopi, bhikkhave, idhekacco bhadro purisājānīyo hoti. Ayaṃ, bhikkhave, catuttho bhadro purisājānīyo santo saṃvijjamāno lokasmiṃ. Ime kho, bhikkhave, cattāro bhadrā purisājānīyā santo saṃvijjamānā lokasmi’’nti. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Nāgasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "114"
      },
      ". ‘‘Catūhi, bhikkhave, aṅgehi samannāgato rañño nāgo rājāraho ",
      " hoti rājabhoggo, rañño aṅganteva saṅkhaṃ gacchati. Katamehi catūhi? Idha, bhikkhave, rañño nāgo sotā ca hoti, hantā ca, khantā ca, gantā ca."
    ],
    "innerText": "114. ‘‘Catūhi, bhikkhave, aṅgehi samannāgato rañño nāgo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhaṃ gacchati. Katamehi catūhi? Idha, bhikkhave, rañño nāgo sotā ca hoti, hantā ca, khantā ca, gantā ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, rañño nāgo sotā hoti? Idha, bhikkhave, rañño nāgo yamenaṃ hatthidammasārathi kāraṇaṃ kāreti – yadi vā katapubbaṃ yadi vā akatapubbaṃ – taṃ aṭṭhiṃ katvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[aṭṭhikatvā (sī. syā. kaṃ. pī.) a. ni. 5.140]"
      },
      " manasi katvā sabbacetasā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sabbaṃ cetaso (sabbattha)]"
      },
      " samannāharitvā ",
      " ohitasoto suṇāti. Evaṃ kho, bhikkhave, rañño nāgo sotā hoti."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, rañño nāgo sotā hoti? Idha, bhikkhave, rañño nāgo yamenaṃ hatthidammasārathi kāraṇaṃ kāreti – yadi vā katapubbaṃ yadi vā akatapubbaṃ – taṃ aṭṭhiṃ katvā [aṭṭhikatvā (sī. syā. kaṃ. pī.) a. ni. 5.140] manasi katvā sabbacetasā [sabbaṃ cetaso (sabbattha)] samannāharitvā ohitasoto suṇāti. Evaṃ kho, bhikkhave, rañño nāgo sotā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, rañño nāgo hantā hoti? Idha, bhikkhave, rañño nāgo saṅgāmagato ",
      " hatthimpi hanati, hatthāruhampi hanati, assampi hanati, assāruhampi hanati ",
      ", rathampi hanati, rathikampi hanati, pattikampi hanati. Evaṃ kho, bhikkhave, rañño nāgo hantā hoti."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, rañño nāgo hantā hoti? Idha, bhikkhave, rañño nāgo saṅgāmagato hatthimpi hanati, hatthāruhampi hanati, assampi hanati, assāruhampi hanati , rathampi hanati, rathikampi hanati, pattikampi hanati. Evaṃ kho, bhikkhave, rañño nāgo hantā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, rañño nāgo khantā hoti? Idha bhikkhave, rañño nāgo saṅgāmagato khamo hoti sattippahārānaṃ asippahārānaṃ usuppahārānaṃ pharasuppahārānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[‘‘pharasuppahārāna’’nti idaṃ padaṃ syāmapotthake natthi. ma. ni. 3.217 passitabbaṃ]"
      },
      " bheripaṇavasaṅkhatiṇavaninnādasaddānaṃ. Evaṃ kho, bhikkhave, rañño nāgo khantā hoti."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, rañño nāgo khantā hoti? Idha bhikkhave, rañño nāgo saṅgāmagato khamo hoti sattippahārānaṃ asippahārānaṃ usuppahārānaṃ pharasuppahārānaṃ [‘‘pharasuppahārāna’’nti idaṃ padaṃ syāmapotthake natthi. ma. ni. 3.217 passitabbaṃ] bheripaṇavasaṅkhatiṇavaninnādasaddānaṃ. Evaṃ kho, bhikkhave, rañño nāgo khantā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, rañño nāgo gantā hoti? Idha, bhikkhave, rañño nāgo yamenaṃ hatthidammasārathi disaṃ peseti – yadi vā gatapubbaṃ yadi vā agatapubbaṃ – taṃ khippameva gantā hoti. Evaṃ kho, bhikkhave, rañño nāgo gantā hoti. Imehi kho, bhikkhave, catūhi aṅgehi samannāgato rañño nāgo rājāraho hoti rājabhoggo, rañño aṅganteva saṅkhaṃ gacchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evamevaṃ kho, bhikkhave, catūhi dhammehi samannāgato bhikkhu āhuneyyo hoti ",
      " …pe… anuttaraṃ puññakkhettaṃ lokassa. Katamehi catūhi? Idha, bhikkhave, bhikkhu sotā ca hoti, hantā ca, khantā ca, gantā ca."
    ],
    "innerText": "‘‘Evamevaṃ kho, bhikkhave, catūhi dhammehi samannāgato bhikkhu āhuneyyo hoti …pe… anuttaraṃ puññakkhettaṃ lokassa. Katamehi catūhi? Idha, bhikkhave, bhikkhu sotā ca hoti, hantā ca, khantā ca, gantā ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu sotā hoti? Idha, bhikkhave, bhikkhu tathāgatappavedite dhammavinaye desiyamāne aṭṭhiṃ katvā manasi katvā sabbacetasā samannāharitvā ohitasoto dhammaṃ suṇāti. Evaṃ kho, bhikkhave, bhikkhu sotā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, bhikkhu hantā hoti? Idha, bhikkhave, bhikkhu uppannaṃ kāmavitakkaṃ nādhivāseti pajahati vinodeti (hanati) ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[( ) natthi sī. syā. pī. potthakesu. a. ni. 4.164 paṭipadāvagge catutthasutte pana ‘‘sametī’’ti padaṃ sabbatthapi dissati]"
      },
      " byantīkaroti anabhāvaṃ gameti, uppannaṃ byāpādavitakkaṃ…pe… uppannaṃ vihiṃsāvitakkaṃ…pe… uppannuppanne pāpake akusale dhamme nādhivāseti pajahati vinodeti hanati ",
      " byantīkaroti anabhāvaṃ gameti. Evaṃ kho, bhikkhave, bhikkhu hantā hoti."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu hantā hoti? Idha, bhikkhave, bhikkhu uppannaṃ kāmavitakkaṃ nādhivāseti pajahati vinodeti (hanati) [( ) natthi sī. syā. pī. potthakesu. a. ni. 4.164 paṭipadāvagge catutthasutte pana ‘‘sametī’’ti padaṃ sabbatthapi dissati] byantīkaroti anabhāvaṃ gameti, uppannaṃ byāpādavitakkaṃ…pe… uppannaṃ vihiṃsāvitakkaṃ…pe… uppannuppanne pāpake akusale dhamme nādhivāseti pajahati vinodeti hanati byantīkaroti anabhāvaṃ gameti. Evaṃ kho, bhikkhave, bhikkhu hantā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, bhikkhu khantā hoti? Idha, bhikkhave, bhikkhu khamo hoti sītassa ",
      " uṇhassa jighacchāya pipāsāya, ḍaṃsamakasavātātapasarīsapasamphassānaṃ duruttānaṃ durāgatānaṃ vacanapathānaṃ uppannānaṃ ",
      " sārīrikānaṃ vedanānaṃ dukkhānaṃ tibbānaṃ kharānaṃ kaṭukānaṃ asātānaṃ amanāpānaṃ pāṇaharānaṃ adhivāsakajātiko hoti. Evaṃ kho, bhikkhave, bhikkhu khantā hoti."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu khantā hoti? Idha, bhikkhave, bhikkhu khamo hoti sītassa uṇhassa jighacchāya pipāsāya, ḍaṃsamakasavātātapasarīsapasamphassānaṃ duruttānaṃ durāgatānaṃ vacanapathānaṃ uppannānaṃ sārīrikānaṃ vedanānaṃ dukkhānaṃ tibbānaṃ kharānaṃ kaṭukānaṃ asātānaṃ amanāpānaṃ pāṇaharānaṃ adhivāsakajātiko hoti. Evaṃ kho, bhikkhave, bhikkhu khantā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, bhikkhu gantā hoti? Idha, bhikkhave, bhikkhu yāyaṃ disā agatapubbā iminā dīghena addhunā yadidaṃ sabbasaṅkhārasamatho sabbūpadhipaṭinissaggo taṇhākkhayo virāgo nirodho nibbānaṃ, taṃ khippaññeva gantā ",
      " hoti. Evaṃ kho, bhikkhave, bhikkhu gantā hoti. Imehi kho, bhikkhave, catūhi dhammehi samannāgato bhikkhu āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassā’’ti. Catutthaṃ."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu gantā hoti? Idha, bhikkhave, bhikkhu yāyaṃ disā agatapubbā iminā dīghena addhunā yadidaṃ sabbasaṅkhārasamatho sabbūpadhipaṭinissaggo taṇhākkhayo virāgo nirodho nibbānaṃ, taṃ khippaññeva gantā hoti. Evaṃ kho, bhikkhave, bhikkhu gantā hoti. Imehi kho, bhikkhave, catūhi dhammehi samannāgato bhikkhu āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassā’’ti. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Ṭhānasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "115"
      },
      ". ‘‘Cattārimāni, bhikkhave, ṭhānāni. Katamāni cattāri? Atthi, bhikkhave, ṭhānaṃ amanāpaṃ kātuṃ; tañca kayiramānaṃ anatthāya saṃvattati. Atthi, bhikkhave, ṭhānaṃ amanāpaṃ kātuṃ; tañca kayiramānaṃ atthāya saṃvattati. Atthi, bhikkhave, ṭhānaṃ manāpaṃ kātuṃ; tañca kayiramānaṃ anatthāya saṃvattati. Atthi, bhikkhave, ṭhānaṃ manāpaṃ kātuṃ; tañca kayiramānaṃ atthāya saṃvattati."
    ],
    "innerText": "115. ‘‘Cattārimāni, bhikkhave, ṭhānāni. Katamāni cattāri? Atthi, bhikkhave, ṭhānaṃ amanāpaṃ kātuṃ; tañca kayiramānaṃ anatthāya saṃvattati. Atthi, bhikkhave, ṭhānaṃ amanāpaṃ kātuṃ; tañca kayiramānaṃ atthāya saṃvattati. Atthi, bhikkhave, ṭhānaṃ manāpaṃ kātuṃ; tañca kayiramānaṃ anatthāya saṃvattati. Atthi, bhikkhave, ṭhānaṃ manāpaṃ kātuṃ; tañca kayiramānaṃ atthāya saṃvattati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tatra, bhikkhave, yamidaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yadidaṃ (syā. kaṃ. ka.)]"
      },
      " ṭhānaṃ amanāpaṃ kātuṃ; tañca kayiramānaṃ anatthāya saṃvattati – idaṃ, bhikkhave, ṭhānaṃ ubhayeneva na kattabbaṃ maññati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[paññāyati (?)]"
      },
      ". Yampidaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yadidaṃ (ka.)]"
      },
      " ṭhānaṃ amanāpaṃ kātuṃ; imināpi naṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[taṃ (sī. pī.) syāmapotthake natthi]"
      },
      " na kattabbaṃ maññati. Yampidaṃ ṭhānaṃ kayiramānaṃ anatthāya saṃvattati; imināpi naṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[taṃ (pī.) sī. syā. potthakesu natthi]"
      },
      " na kattabbaṃ maññati. Idaṃ, bhikkhave, ṭhānaṃ ubhayeneva na kattabbaṃ maññati."
    ],
    "innerText": "‘‘Tatra, bhikkhave, yamidaṃ [yadidaṃ (syā. kaṃ. ka.)] ṭhānaṃ amanāpaṃ kātuṃ; tañca kayiramānaṃ anatthāya saṃvattati – idaṃ, bhikkhave, ṭhānaṃ ubhayeneva na kattabbaṃ maññati [paññāyati (?)]. Yampidaṃ [yadidaṃ (ka.)] ṭhānaṃ amanāpaṃ kātuṃ; imināpi naṃ [taṃ (sī. pī.) syāmapotthake natthi] na kattabbaṃ maññati. Yampidaṃ ṭhānaṃ kayiramānaṃ anatthāya saṃvattati; imināpi naṃ [taṃ (pī.) sī. syā. potthakesu natthi] na kattabbaṃ maññati. Idaṃ, bhikkhave, ṭhānaṃ ubhayeneva na kattabbaṃ maññati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tatra, bhikkhave, yamidaṃ ṭhānaṃ amanāpaṃ kātuṃ; tañca kayiramānaṃ atthāya saṃvattati – imasmiṃ, bhikkhave, ṭhāne bālo ca paṇḍito ca veditabbo purisathāme ",
      " purisavīriye purisaparakkame. Na, bhikkhave, bālo iti paṭisañcikkhati – ‘kiñcāpi kho idaṃ ṭhānaṃ amanāpaṃ kātuṃ; atha carahidaṃ ",
      " ṭhānaṃ kayiramānaṃ atthāya saṃvattatī’ti. So taṃ ṭhānaṃ na karoti. Tassa taṃ ṭhānaṃ akayiramānaṃ anatthāya saṃvattati. Paṇḍito ca kho, bhikkhave, iti ",
      " paṭisañcikkhati – ‘kiñcāpi kho idaṃ ṭhānaṃ amanāpaṃ kātuṃ; atha ",
      " carahidaṃ ṭhānaṃ kayiramānaṃ atthāya saṃvattatī’ti. So taṃ ṭhānaṃ karoti. Tassa taṃ ṭhānaṃ kayiramānaṃ atthāya saṃvattati."
    ],
    "innerText": "‘‘Tatra, bhikkhave, yamidaṃ ṭhānaṃ amanāpaṃ kātuṃ; tañca kayiramānaṃ atthāya saṃvattati – imasmiṃ, bhikkhave, ṭhāne bālo ca paṇḍito ca veditabbo purisathāme purisavīriye purisaparakkame. Na, bhikkhave, bālo iti paṭisañcikkhati – ‘kiñcāpi kho idaṃ ṭhānaṃ amanāpaṃ kātuṃ; atha carahidaṃ ṭhānaṃ kayiramānaṃ atthāya saṃvattatī’ti. So taṃ ṭhānaṃ na karoti. Tassa taṃ ṭhānaṃ akayiramānaṃ anatthāya saṃvattati. Paṇḍito ca kho, bhikkhave, iti paṭisañcikkhati – ‘kiñcāpi kho idaṃ ṭhānaṃ amanāpaṃ kātuṃ; atha carahidaṃ ṭhānaṃ kayiramānaṃ atthāya saṃvattatī’ti. So taṃ ṭhānaṃ karoti. Tassa taṃ ṭhānaṃ kayiramānaṃ atthāya saṃvattati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tatra, bhikkhave, yamidaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yadidaṃ (syā. kaṃ.)]"
      },
      " ṭhānaṃ manāpaṃ kātuṃ; tañca kayiramānaṃ anatthāya saṃvattati – imasmimpi, bhikkhave, ṭhāne bālo ca paṇḍito ca veditabbo purisathāme purisavīriye purisaparakkame. Na, bhikkhave, bālo iti paṭisañcikkhati – ‘kiñcāpi kho idaṃ ṭhānaṃ manāpaṃ kātuṃ; atha carahidaṃ ṭhānaṃ kayiramānaṃ anatthāya saṃvattatī’ti. So taṃ ṭhānaṃ karoti. Tassa taṃ ṭhānaṃ kayiramānaṃ anatthāya saṃvattati. Paṇḍito ca kho, bhikkhave, iti paṭisañcikkhati – ‘kiñcāpi kho idaṃ ṭhānaṃ manāpaṃ kātuṃ; atha carahidaṃ ṭhānaṃ kayiramānaṃ anatthāya saṃvattatī’ti. So taṃ ṭhānaṃ na karoti. Tassa taṃ ṭhānaṃ akayiramānaṃ atthāya saṃvattati."
    ],
    "innerText": "‘‘Tatra, bhikkhave, yamidaṃ [yadidaṃ (syā. kaṃ.)] ṭhānaṃ manāpaṃ kātuṃ; tañca kayiramānaṃ anatthāya saṃvattati – imasmimpi, bhikkhave, ṭhāne bālo ca paṇḍito ca veditabbo purisathāme purisavīriye purisaparakkame. Na, bhikkhave, bālo iti paṭisañcikkhati – ‘kiñcāpi kho idaṃ ṭhānaṃ manāpaṃ kātuṃ; atha carahidaṃ ṭhānaṃ kayiramānaṃ anatthāya saṃvattatī’ti. So taṃ ṭhānaṃ karoti. Tassa taṃ ṭhānaṃ kayiramānaṃ anatthāya saṃvattati. Paṇḍito ca kho, bhikkhave, iti paṭisañcikkhati – ‘kiñcāpi kho idaṃ ṭhānaṃ manāpaṃ kātuṃ; atha carahidaṃ ṭhānaṃ kayiramānaṃ anatthāya saṃvattatī’ti. So taṃ ṭhānaṃ na karoti. Tassa taṃ ṭhānaṃ akayiramānaṃ atthāya saṃvattati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tatra, bhikkhave, yamidaṃ ṭhānaṃ manāpaṃ kātuṃ, tañca kayiramānaṃ atthāya saṃvattati – idaṃ, bhikkhave, ṭhānaṃ ubhayeneva kattabbaṃ maññati. Yampidaṃ ṭhānaṃ manāpaṃ kātuṃ, imināpi naṃ kattabbaṃ maññati; yampidaṃ ṭhānaṃ kayiramānaṃ atthāya saṃvattati, imināpi naṃ kattabbaṃ maññati. Idaṃ, bhikkhave, ṭhānaṃ ubhayeneva kattabbaṃ maññati. Imāni kho, bhikkhave, cattāri ṭhānānī’’ti. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Appamādasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "116"
      },
      ". ‘‘Catūhi, bhikkhave, ṭhānehi appamādo karaṇīyo. Katamehi catūhi? Kāyaduccaritaṃ, bhikkhave, pajahatha, kāyasucaritaṃ bhāvetha; tattha ca mā pamādattha. Vacīduccaritaṃ, bhikkhave, pajahatha, vacīsucaritaṃ bhāvetha; tattha ca mā pamādattha. Manoduccaritaṃ, bhikkhave, pajahatha, manosucaritaṃ bhāvetha; tattha ca mā pamādattha. Micchādiṭṭhiṃ, bhikkhave, pajahatha, sammādiṭṭhiṃ bhāvetha ",
      "; tattha ca mā pamādattha."
    ],
    "innerText": "116. ‘‘Catūhi, bhikkhave, ṭhānehi appamādo karaṇīyo. Katamehi catūhi? Kāyaduccaritaṃ, bhikkhave, pajahatha, kāyasucaritaṃ bhāvetha; tattha ca mā pamādattha. Vacīduccaritaṃ, bhikkhave, pajahatha, vacīsucaritaṃ bhāvetha; tattha ca mā pamādattha. Manoduccaritaṃ, bhikkhave, pajahatha, manosucaritaṃ bhāvetha; tattha ca mā pamādattha. Micchādiṭṭhiṃ, bhikkhave, pajahatha, sammādiṭṭhiṃ bhāvetha ; tattha ca mā pamādattha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yato ",
      " kho, bhikkhave, bhikkhuno kāyaduccaritaṃ pahīnaṃ hoti kāyasucaritaṃ bhāvitaṃ, vacīduccaritaṃ ",
      " pahīnaṃ hoti vacīsucaritaṃ bhāvitaṃ, manoduccaritaṃ pahīnaṃ hoti manosucaritaṃ bhāvitaṃ, micchādiṭṭhi pahīnā hoti sammādiṭṭhi bhāvitā, so na bhāyati samparāyikassa maraṇassā’’ti. Chaṭṭhaṃ."
    ],
    "innerText": "‘‘Yato kho, bhikkhave, bhikkhuno kāyaduccaritaṃ pahīnaṃ hoti kāyasucaritaṃ bhāvitaṃ, vacīduccaritaṃ pahīnaṃ hoti vacīsucaritaṃ bhāvitaṃ, manoduccaritaṃ pahīnaṃ hoti manosucaritaṃ bhāvitaṃ, micchādiṭṭhi pahīnā hoti sammādiṭṭhi bhāvitā, so na bhāyati samparāyikassa maraṇassā’’ti. Chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Ārakkhasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "117"
      },
      ". ‘‘Catūsu, bhikkhave, ṭhānesu attarūpena appamādo sati cetaso ārakkho karaṇīyo. Katamesu catūsu? ‘Mā me rajanīyesu dhammesu cittaṃ rajjī’ti attarūpena appamādo sati cetaso ārakkho karaṇīyo; ‘mā me dosanīyesu dhammesu cittaṃ dussī’ti attarūpena appamādo sati cetaso ārakkho karaṇīyo; ‘mā me mohanīyesu dhammesu cittaṃ muyhī’ti attarūpena appamādo sati cetaso ārakkho karaṇīyo; ‘mā me madanīyesu dhammesu cittaṃ majjī’ti attarūpena appamādo sati cetaso ārakkho karaṇīyo."
    ],
    "innerText": "117. ‘‘Catūsu, bhikkhave, ṭhānesu attarūpena appamādo sati cetaso ārakkho karaṇīyo. Katamesu catūsu? ‘Mā me rajanīyesu dhammesu cittaṃ rajjī’ti attarūpena appamādo sati cetaso ārakkho karaṇīyo; ‘mā me dosanīyesu dhammesu cittaṃ dussī’ti attarūpena appamādo sati cetaso ārakkho karaṇīyo; ‘mā me mohanīyesu dhammesu cittaṃ muyhī’ti attarūpena appamādo sati cetaso ārakkho karaṇīyo; ‘mā me madanīyesu dhammesu cittaṃ majjī’ti attarūpena appamādo sati cetaso ārakkho karaṇīyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Yato kho, bhikkhave, bhikkhuno rajanīyesu dhammesu cittaṃ na rajjati vītarāgattā, dosanīyesu dhammesu cittaṃ na dussati vītadosattā, mohanīyesu dhammesu cittaṃ na muyhati vītamohattā, madanīyesu dhammesu cittaṃ na majjati vītamadattā, so na chambhati na kampati na vedhati na santāsaṃ āpajjati, na ca pana samaṇavacanahetupi gacchatī’’ti. Sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Saṃvejanīyasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "118"
      },
      ". ‘‘Cattārimāni, bhikkhave, saddhassa kulaputtassa dassanīyāni saṃvejanīyāni ṭhānāni. Katamāni cattāri? ‘Idha tathāgato jāto’ti, bhikkhave, saddhassa kulaputtassa dassanīyaṃ saṃvejanīyaṃ ṭhānaṃ. ‘Idha tathāgato anuttaraṃ ",
      " sammāsambodhiṃ abhisambuddho’ti, bhikkhave, saddhassa kulaputtassa dassanīyaṃ saṃvejanīyaṃ ṭhānaṃ. ‘Idha tathāgato anuttaraṃ dhammacakkaṃ pavattesī’ti, bhikkhave, saddhassa kulaputtassa dassanīyaṃ saṃvejanīyaṃ ṭhānaṃ. ‘Idha tathāgato anupādisesāya nibbānadhātuyā parinibbuto’ti ",
      ", bhikkhave, saddhassa kulaputtassa dassanīyaṃ saṃvejanīyaṃ ṭhānaṃ. Imāni ",
      " kho, bhikkhave, cattāri saddhassa kulaputtassa dassanīyāni saṃvejanīyāni ṭhānānī’’ti. Aṭṭhamaṃ."
    ],
    "innerText": "118. ‘‘Cattārimāni, bhikkhave, saddhassa kulaputtassa dassanīyāni saṃvejanīyāni ṭhānāni. Katamāni cattāri? ‘Idha tathāgato jāto’ti, bhikkhave, saddhassa kulaputtassa dassanīyaṃ saṃvejanīyaṃ ṭhānaṃ. ‘Idha tathāgato anuttaraṃ sammāsambodhiṃ abhisambuddho’ti, bhikkhave, saddhassa kulaputtassa dassanīyaṃ saṃvejanīyaṃ ṭhānaṃ. ‘Idha tathāgato anuttaraṃ dhammacakkaṃ pavattesī’ti, bhikkhave, saddhassa kulaputtassa dassanīyaṃ saṃvejanīyaṃ ṭhānaṃ. ‘Idha tathāgato anupādisesāya nibbānadhātuyā parinibbuto’ti , bhikkhave, saddhassa kulaputtassa dassanīyaṃ saṃvejanīyaṃ ṭhānaṃ. Imāni kho, bhikkhave, cattāri saddhassa kulaputtassa dassanīyāni saṃvejanīyāni ṭhānānī’’ti. Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Paṭhamabhayasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "119"
      },
      ". ‘‘Cattārimāni ",
      ", bhikkhave, bhayāni. Katamāni cattāri? Jātibhayaṃ, jarābhayaṃ, byādhibhayaṃ, maraṇabhayaṃ – imāni kho, bhikkhave, cattāri bhayānī’’ti. Navamaṃ."
    ],
    "innerText": "119. ‘‘Cattārimāni , bhikkhave, bhayāni. Katamāni cattāri? Jātibhayaṃ, jarābhayaṃ, byādhibhayaṃ, maraṇabhayaṃ – imāni kho, bhikkhave, cattāri bhayānī’’ti. Navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Dutiyabhayasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "120"
      },
      ". ‘‘Cattārimāni, bhikkhave, bhayāni. Katamāni cattāri? Aggibhayaṃ, udakabhayaṃ, rājabhayaṃ, corabhayaṃ – imāni kho, bhikkhave, cattāri bhayānī’’ti. Dasamaṃ."
    ],
    "innerText": "120. ‘‘Cattārimāni, bhikkhave, bhayāni. Katamāni cattāri? Aggibhayaṃ, udakabhayaṃ, rājabhayaṃ, corabhayaṃ – imāni kho, bhikkhave, cattāri bhayānī’’ti. Dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Kesivaggo dutiyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Kesi javo patodo ca, nāgo ṭhānena pañcamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Appamādo ca ārakkho, saṃvejanīyañca dve bhayāti."
  }
]