[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "2. Sāraṇīyavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Paṭhamasāraṇīyasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "11"
      },
      ". ‘‘Chayime ",
      ", bhikkhave, dhammā sāraṇīyā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sārāṇīyā (sī. syā. kaṃ. pī.)]"
      },
      ". Katame cha? Idha, bhikkhave, bhikkhuno mettaṃ kāyakammaṃ paccupaṭṭhitaṃ hoti sabrahmacārīsu āvi ceva raho ca, ayampi dhammo sāraṇīyo."
    ],
    "innerText": "11. ‘‘Chayime , bhikkhave, dhammā sāraṇīyā [sārāṇīyā (sī. syā. kaṃ. pī.)]. Katame cha? Idha, bhikkhave, bhikkhuno mettaṃ kāyakammaṃ paccupaṭṭhitaṃ hoti sabrahmacārīsu āvi ceva raho ca, ayampi dhammo sāraṇīyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, bhikkhave, bhikkhuno mettaṃ vacīkammaṃ paccupaṭṭhitaṃ hoti sabrahmacārīsu āvi ceva raho ca, ayampi dhammo sāraṇīyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, bhikkhave, bhikkhuno mettaṃ manokammaṃ paccupaṭṭhitaṃ hoti sabrahmacārīsu āvi ceva raho ca, ayampi dhammo sāraṇīyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna ",
      " caparaṃ, bhikkhave, bhikkhu ye te lābhā dhammikā dhammaladdhā antamaso pattapariyāpannamattampi tathārūpehi lābhehi appaṭivibhattabhogī hoti sīlavantehi sabrahmacārīhi sādhāraṇabhogī, ayampi dhammo sāraṇīyo."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, bhikkhu ye te lābhā dhammikā dhammaladdhā antamaso pattapariyāpannamattampi tathārūpehi lābhehi appaṭivibhattabhogī hoti sīlavantehi sabrahmacārīhi sādhāraṇabhogī, ayampi dhammo sāraṇīyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhikkhave, bhikkhu yāni tāni sīlāni akhaṇḍāni acchiddāni asabalāni akammāsāni bhujissāni viññuppasatthāni aparāmaṭṭhāni samādhisaṃvattanikāni ",
      " tathārūpehi sīlehi sīlasāmaññagato viharati sabrahmacārīhi āvi ceva raho ca, ayampi dhammo sāraṇīyo."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, bhikkhu yāni tāni sīlāni akhaṇḍāni acchiddāni asabalāni akammāsāni bhujissāni viññuppasatthāni aparāmaṭṭhāni samādhisaṃvattanikāni tathārūpehi sīlehi sīlasāmaññagato viharati sabrahmacārīhi āvi ceva raho ca, ayampi dhammo sāraṇīyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhikkhave, bhikkhu yāyaṃ diṭṭhi ariyā niyyānikā niyyāti takkarassa sammā dukkhakkhayāya tathārūpāya diṭṭhiyā diṭṭhisāmaññagato viharati sabrahmacārīhi āvi ceva ",
      " raho ca, ayampi dhammo sāraṇīyo. Ime kho, bhikkhave, cha dhammā sāraṇīyā’’ti. Paṭhamaṃ."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, bhikkhu yāyaṃ diṭṭhi ariyā niyyānikā niyyāti takkarassa sammā dukkhakkhayāya tathārūpāya diṭṭhiyā diṭṭhisāmaññagato viharati sabrahmacārīhi āvi ceva raho ca, ayampi dhammo sāraṇīyo. Ime kho, bhikkhave, cha dhammā sāraṇīyā’’ti. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Dutiyasāraṇīyasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "12"
      },
      ". ‘‘Chayime ",
      ", bhikkhave, dhammā sāraṇīyā piyakaraṇā garukaraṇā saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṃvattanti. Katame cha? Idha, bhikkhave, bhikkhuno mettaṃ kāyakammaṃ paccupaṭṭhitaṃ hoti sabrahmacārīsu āvi ceva raho ca, ayampi dhammo sāraṇīyo piyakaraṇo garukaraṇo saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṃvattati."
    ],
    "innerText": "12. ‘‘Chayime , bhikkhave, dhammā sāraṇīyā piyakaraṇā garukaraṇā saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṃvattanti. Katame cha? Idha, bhikkhave, bhikkhuno mettaṃ kāyakammaṃ paccupaṭṭhitaṃ hoti sabrahmacārīsu āvi ceva raho ca, ayampi dhammo sāraṇīyo piyakaraṇo garukaraṇo saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṃvattati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, bhikkhave, bhikkhuno mettaṃ vacīkammaṃ paccupaṭṭhitaṃ hoti…pe… mettaṃ manokammaṃ paccupaṭṭhitaṃ hoti sabrahmacārīsu āvi ceva raho ca, ayampi dhammo sāraṇīyo piyakaraṇo garukaraṇo saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṃvattati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhikkhave, bhikkhu ye te lābhā dhammikā dhammaladdhā antamaso pattapariyāpannamattampi tathārūpehi lābhehi appaṭivibhattabhogī hoti sīlavantehi ",
      " sabrahmacārīhi sādhāraṇabhogī, ayampi dhammo sāraṇīyo piyakaraṇo garukaraṇo saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṃvattati."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, bhikkhu ye te lābhā dhammikā dhammaladdhā antamaso pattapariyāpannamattampi tathārūpehi lābhehi appaṭivibhattabhogī hoti sīlavantehi sabrahmacārīhi sādhāraṇabhogī, ayampi dhammo sāraṇīyo piyakaraṇo garukaraṇo saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṃvattati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, bhikkhave, bhikkhu yāni tāni sīlāni akhaṇḍāni acchiddāni asabalāni akammāsāni bhujissāni viññuppasatthāni aparāmaṭṭhāni samādhisaṃvattanikāni tathārūpehi sīlehi sīlasāmaññagato viharati sabrahmacārīhi āvi ceva raho ca, ayampi dhammo sāraṇīyo piyakaraṇo garukaraṇo saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṃvattati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna ",
      " caparaṃ, bhikkhave, bhikkhu yāyaṃ diṭṭhi ariyā niyyānikā niyyāti takkarassa sammā dukkhakkhayāya tathārūpāya diṭṭhiyā diṭṭhisāmaññagato viharati sabrahmacārīhi āvi ceva raho ",
      " ca, ayampi dhammo sāraṇīyo piyakaraṇo garukaraṇo saṅgahāya avivādāya sāmaggiyā ",
      " ekībhāvāya saṃvattati. Ime kho, bhikkhave, cha dhammā sāraṇīyā piyakaraṇā garukaraṇā saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṃvattantī’’ti. Dutiyaṃ."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, bhikkhu yāyaṃ diṭṭhi ariyā niyyānikā niyyāti takkarassa sammā dukkhakkhayāya tathārūpāya diṭṭhiyā diṭṭhisāmaññagato viharati sabrahmacārīhi āvi ceva raho ca, ayampi dhammo sāraṇīyo piyakaraṇo garukaraṇo saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṃvattati. Ime kho, bhikkhave, cha dhammā sāraṇīyā piyakaraṇā garukaraṇā saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṃvattantī’’ti. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Nissāraṇīyasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "13"
      },
      ". ‘‘Chayimā, bhikkhave, nissāraṇīyā dhātuyo. Katamā cha? Idha, bhikkhave, bhikkhu evaṃ vadeyya – ‘mettā hi kho me cetovimutti bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā; atha ca pana me byāpādo cittaṃ pariyādāya tiṭṭhatī’ti. So ‘mā heva’ntissa vacanīyo – ‘māyasmā, evaṃ avaca; mā bhagavantaṃ abbhācikkhi, na hi sādhu bhagavato abbhakkhānaṃ, na hi bhagavā evaṃ vadeyya. Aṭṭhānametaṃ, āvuso, anavakāso yaṃ mettāya cetovimuttiyā bhāvitāya bahulīkatāya yānīkatāya vatthukatāya anuṭṭhitāya paricitāya susamāraddhāya; atha ca ",
      " panassa byāpādo cittaṃ pariyādāya ṭhassati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ṭhassatīti (sabbattha) dī. ni. 3.326 passitabbaṃ]"
      },
      ", netaṃ ṭhānaṃ vijjati. Nissaraṇañhetaṃ, āvuso, byāpādassa yadidaṃ mettācetovimuttī’’’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mettācetovimutti (sabbattha)]"
      },
      "."
    ],
    "innerText": "13. ‘‘Chayimā, bhikkhave, nissāraṇīyā dhātuyo. Katamā cha? Idha, bhikkhave, bhikkhu evaṃ vadeyya – ‘mettā hi kho me cetovimutti bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā; atha ca pana me byāpādo cittaṃ pariyādāya tiṭṭhatī’ti. So ‘mā heva’ntissa vacanīyo – ‘māyasmā, evaṃ avaca; mā bhagavantaṃ abbhācikkhi, na hi sādhu bhagavato abbhakkhānaṃ, na hi bhagavā evaṃ vadeyya. Aṭṭhānametaṃ, āvuso, anavakāso yaṃ mettāya cetovimuttiyā bhāvitāya bahulīkatāya yānīkatāya vatthukatāya anuṭṭhitāya paricitāya susamāraddhāya; atha ca panassa byāpādo cittaṃ pariyādāya ṭhassati [ṭhassatīti (sabbattha) dī. ni. 3.326 passitabbaṃ], netaṃ ṭhānaṃ vijjati. Nissaraṇañhetaṃ, āvuso, byāpādassa yadidaṃ mettācetovimuttī’’’ti [mettācetovimutti (sabbattha)]."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idha pana, bhikkhave, bhikkhu evaṃ vadeyya – ‘karuṇā hi kho me cetovimutti bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā; atha ca pana me vihesā cittaṃ pariyādāya tiṭṭhatī’ti. So ‘mā heva’ntissa vacanīyo – ‘māyasmā, evaṃ avaca; mā bhagavantaṃ abbhācikkhi, na hi sādhu bhagavato abbhakkhānaṃ, na hi bhagavā evaṃ vadeyya. Aṭṭhānametaṃ, āvuso ",
      ", anavakāso yaṃ karuṇāya cetovimuttiyā bhāvitāya bahulīkatāya yānīkatāya vatthukatāya anuṭṭhitāya paricitāya susamāraddhāya; atha ca panassa vihesā cittaṃ pariyādāya ṭhassati, netaṃ ṭhānaṃ vijjati. Nissaraṇañhetaṃ, āvuso, vihesāya yadidaṃ karuṇācetovimuttī’’’ti."
    ],
    "innerText": "‘‘Idha pana, bhikkhave, bhikkhu evaṃ vadeyya – ‘karuṇā hi kho me cetovimutti bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā; atha ca pana me vihesā cittaṃ pariyādāya tiṭṭhatī’ti. So ‘mā heva’ntissa vacanīyo – ‘māyasmā, evaṃ avaca; mā bhagavantaṃ abbhācikkhi, na hi sādhu bhagavato abbhakkhānaṃ, na hi bhagavā evaṃ vadeyya. Aṭṭhānametaṃ, āvuso , anavakāso yaṃ karuṇāya cetovimuttiyā bhāvitāya bahulīkatāya yānīkatāya vatthukatāya anuṭṭhitāya paricitāya susamāraddhāya; atha ca panassa vihesā cittaṃ pariyādāya ṭhassati, netaṃ ṭhānaṃ vijjati. Nissaraṇañhetaṃ, āvuso, vihesāya yadidaṃ karuṇācetovimuttī’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idha ",
      " pana, bhikkhave, bhikkhu evaṃ vadeyya – ‘muditā hi kho me cetovimutti bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā; atha ca pana me arati cittaṃ pariyādāya tiṭṭhatī’ti. So ‘mā heva’ntissa vacanīyo – ‘māyasmā, evaṃ avaca; mā bhagavantaṃ abbhācikkhi, na hi sādhu bhagavato abbhakkhānaṃ, na hi bhagavā evaṃ vadeyya ",
      ". Aṭṭhānametaṃ, āvuso, anavakāso yaṃ muditāya cetovimuttiyā bhāvitāya bahulīkatāya yānīkatāya vatthukatāya anuṭṭhitāya paricitāya susamāraddhāya; atha ca panassa arati cittaṃ pariyādāya ṭhassati, netaṃ ṭhānaṃ vijjati. Nissaraṇañhetaṃ, āvuso, aratiyā yadidaṃ muditācetovimuttī’’’ti."
    ],
    "innerText": "‘‘Idha pana, bhikkhave, bhikkhu evaṃ vadeyya – ‘muditā hi kho me cetovimutti bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā; atha ca pana me arati cittaṃ pariyādāya tiṭṭhatī’ti. So ‘mā heva’ntissa vacanīyo – ‘māyasmā, evaṃ avaca; mā bhagavantaṃ abbhācikkhi, na hi sādhu bhagavato abbhakkhānaṃ, na hi bhagavā evaṃ vadeyya . Aṭṭhānametaṃ, āvuso, anavakāso yaṃ muditāya cetovimuttiyā bhāvitāya bahulīkatāya yānīkatāya vatthukatāya anuṭṭhitāya paricitāya susamāraddhāya; atha ca panassa arati cittaṃ pariyādāya ṭhassati, netaṃ ṭhānaṃ vijjati. Nissaraṇañhetaṃ, āvuso, aratiyā yadidaṃ muditācetovimuttī’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idha pana, bhikkhave, bhikkhu evaṃ vadeyya – ‘upekkhā hi kho me cetovimutti bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā; atha ca pana me rāgo cittaṃ pariyādāya tiṭṭhatī’ti. So ‘mā heva’ntissa vacanīyo – ‘māyasmā, evaṃ avaca; mā bhagavantaṃ abbhācikkhi, na hi sādhu bhagavato abbhakkhānaṃ, na hi bhagavā evaṃ vadeyya. Aṭṭhānametaṃ, āvuso, anavakāso yaṃ upekkhāya cetovimuttiyā bhāvitāya bahulīkatāya yānīkatāya vatthukatāya anuṭṭhitāya ",
      " paricitāya susamāraddhāya ",
      "; atha ca panassa rāgo cittaṃ pariyādāya ṭhassati, netaṃ ṭhānaṃ vijjati. Nissaraṇañhetaṃ, āvuso, rāgassa yadidaṃ upekkhācetovimuttī’’’ti."
    ],
    "innerText": "‘‘Idha pana, bhikkhave, bhikkhu evaṃ vadeyya – ‘upekkhā hi kho me cetovimutti bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā; atha ca pana me rāgo cittaṃ pariyādāya tiṭṭhatī’ti. So ‘mā heva’ntissa vacanīyo – ‘māyasmā, evaṃ avaca; mā bhagavantaṃ abbhācikkhi, na hi sādhu bhagavato abbhakkhānaṃ, na hi bhagavā evaṃ vadeyya. Aṭṭhānametaṃ, āvuso, anavakāso yaṃ upekkhāya cetovimuttiyā bhāvitāya bahulīkatāya yānīkatāya vatthukatāya anuṭṭhitāya paricitāya susamāraddhāya ; atha ca panassa rāgo cittaṃ pariyādāya ṭhassati, netaṃ ṭhānaṃ vijjati. Nissaraṇañhetaṃ, āvuso, rāgassa yadidaṃ upekkhācetovimuttī’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Idha pana, bhikkhave, bhikkhu evaṃ vadeyya – ‘animittā hi kho me cetovimutti bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā; atha ca pana me nimittānusāri viññāṇaṃ hotī’ti. So ‘mā heva’ntissa vacanīyo – ‘māyasmā, evaṃ avaca; mā bhagavantaṃ abbhācikkhi, na hi sādhu bhagavato abbhakkhānaṃ, na hi bhagavā evaṃ vadeyya. Aṭṭhānametaṃ, āvuso, anavakāso yaṃ animittāya cetovimuttiyā bhāvitāya bahulīkatāya yānīkatāya vatthukatāya anuṭṭhitāya paricitāya susamāraddhāya; atha ca panassa nimittānusāri viññāṇaṃ bhavissati, netaṃ ṭhānaṃ vijjati. Nissaraṇañhetaṃ, āvuso, sabbanimittānaṃ yadidaṃ animittācetovimuttī’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idha ",
      " pana bhikkhave, bhikkhu evaṃ vadeyya – ‘asmīti kho me vigataṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vigate (syā.)]"
      },
      ", ayamahamasmīti ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ayaṃ cakāro dī. ni. 3.326 natthi]"
      },
      " na samanupassāmi; atha ca pana me vicikicchākathaṃkathāsallaṃ cittaṃ pariyādāya tiṭṭhatī’ti. So ‘mā heva’ntissa vacanīyo – ‘māyasmā, evaṃ avaca; mā bhagavantaṃ abbhācikkhi, na hi sādhu bhagavato abbhakkhānaṃ, na hi bhagavā evaṃ vadeyya. Aṭṭhānametaṃ, āvuso, anavakāso yaṃ asmīti vigate ayamahamasmīti ca na samanupassato; atha ",
      " ca panassa vicikicchākathaṃkathāsallaṃ cittaṃ pariyādāya ṭhassati, netaṃ ṭhānaṃ vijjati. Nissaraṇañhetaṃ, āvuso, vicikicchākathaṃkathāsallassa yadidaṃ asmīti mānasamugghāto’ti. Imā ",
      " kho, bhikkhave, cha nissāraṇīyā dhātuyo’’ti. Tatiyaṃ."
    ],
    "innerText": "‘‘Idha pana bhikkhave, bhikkhu evaṃ vadeyya – ‘asmīti kho me vigataṃ [vigate (syā.)], ayamahamasmīti ca [ayaṃ cakāro dī. ni. 3.326 natthi] na samanupassāmi; atha ca pana me vicikicchākathaṃkathāsallaṃ cittaṃ pariyādāya tiṭṭhatī’ti. So ‘mā heva’ntissa vacanīyo – ‘māyasmā, evaṃ avaca; mā bhagavantaṃ abbhācikkhi, na hi sādhu bhagavato abbhakkhānaṃ, na hi bhagavā evaṃ vadeyya. Aṭṭhānametaṃ, āvuso, anavakāso yaṃ asmīti vigate ayamahamasmīti ca na samanupassato; atha ca panassa vicikicchākathaṃkathāsallaṃ cittaṃ pariyādāya ṭhassati, netaṃ ṭhānaṃ vijjati. Nissaraṇañhetaṃ, āvuso, vicikicchākathaṃkathāsallassa yadidaṃ asmīti mānasamugghāto’ti. Imā kho, bhikkhave, cha nissāraṇīyā dhātuyo’’ti. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Bhaddakasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "14"
      },
      ". Tatra kho āyasmā sāriputto bhikkhū āmantesi – ‘‘āvuso, bhikkhavo’’ti. ‘‘Āvuso’’ti kho te bhikkhū āyasmato ",
      " sāriputtassa paccassosuṃ. Āyasmā sāriputto etadavoca –"
    ],
    "innerText": "14. Tatra kho āyasmā sāriputto bhikkhū āmantesi – ‘‘āvuso, bhikkhavo’’ti. ‘‘Āvuso’’ti kho te bhikkhū āyasmato sāriputtassa paccassosuṃ. Āyasmā sāriputto etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tathā tathā, āvuso, bhikkhu vihāraṃ kappeti yathā yathāssa vihāraṃ kappayato na bhaddakaṃ maraṇaṃ hoti, na bhaddikā kālakiriyā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kālaṃkiriyā (ka.) a. ni. 3.110]"
      },
      ". Kathañcāvuso, bhikkhu tathā tathā vihāraṃ kappeti yathā yathāssa vihāraṃ kappayato na bhaddakaṃ maraṇaṃ hoti, na bhaddikā kālakiriyā?"
    ],
    "innerText": "‘‘Tathā tathā, āvuso, bhikkhu vihāraṃ kappeti yathā yathāssa vihāraṃ kappayato na bhaddakaṃ maraṇaṃ hoti, na bhaddikā kālakiriyā [kālaṃkiriyā (ka.) a. ni. 3.110]. Kathañcāvuso, bhikkhu tathā tathā vihāraṃ kappeti yathā yathāssa vihāraṃ kappayato na bhaddakaṃ maraṇaṃ hoti, na bhaddikā kālakiriyā?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idhāvuso, bhikkhu kammārāmo hoti kammarato kammārāmataṃ anuyutto, bhassārāmo hoti bhassarato bhassārāmataṃ anuyutto, niddārāmo hoti niddārato niddārāmataṃ anuyutto, saṅgaṇikārāmo hoti saṅgaṇikarato saṅgaṇikārāmataṃ anuyutto, saṃsaggārāmo hoti saṃsaggarato saṃsaggārāmataṃ anuyutto, papañcārāmo hoti papañcarato papañcārāmataṃ anuyutto. Evaṃ kho, āvuso, bhikkhu tathā tathā vihāraṃ kappeti yathā yathāssa vihāraṃ kappayato na bhaddakaṃ maraṇaṃ hoti, na bhaddikā kālakiriyā. Ayaṃ vuccatāvuso – ‘bhikkhu sakkāyābhirato nappajahāsi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[na pahāsi (sī. syā. kaṃ. pī.)]"
      },
      " sakkāyaṃ sammā dukkhassa antakiriyāya’’’."
    ],
    "innerText": "‘‘Idhāvuso, bhikkhu kammārāmo hoti kammarato kammārāmataṃ anuyutto, bhassārāmo hoti bhassarato bhassārāmataṃ anuyutto, niddārāmo hoti niddārato niddārāmataṃ anuyutto, saṅgaṇikārāmo hoti saṅgaṇikarato saṅgaṇikārāmataṃ anuyutto, saṃsaggārāmo hoti saṃsaggarato saṃsaggārāmataṃ anuyutto, papañcārāmo hoti papañcarato papañcārāmataṃ anuyutto. Evaṃ kho, āvuso, bhikkhu tathā tathā vihāraṃ kappeti yathā yathāssa vihāraṃ kappayato na bhaddakaṃ maraṇaṃ hoti, na bhaddikā kālakiriyā. Ayaṃ vuccatāvuso – ‘bhikkhu sakkāyābhirato nappajahāsi [na pahāsi (sī. syā. kaṃ. pī.)] sakkāyaṃ sammā dukkhassa antakiriyāya’’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tathā ",
      " tathāvuso, bhikkhu vihāraṃ kappeti yathā yathāssa vihāraṃ kappayato bhaddakaṃ maraṇaṃ hoti, bhaddikā kālakiriyā. Kathañcāvuso, bhikkhu tathā tathā vihāraṃ kappeti yathā yathāssa vihāraṃ kappayato bhaddakaṃ maraṇaṃ hoti, bhaddikā kālakiriyā?"
    ],
    "innerText": "‘‘Tathā tathāvuso, bhikkhu vihāraṃ kappeti yathā yathāssa vihāraṃ kappayato bhaddakaṃ maraṇaṃ hoti, bhaddikā kālakiriyā. Kathañcāvuso, bhikkhu tathā tathā vihāraṃ kappeti yathā yathāssa vihāraṃ kappayato bhaddakaṃ maraṇaṃ hoti, bhaddikā kālakiriyā?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idhāvuso, bhikkhu ",
      " na kammārāmo hoti na kammarato na kammārāmataṃ anuyutto, na bhassārāmo hoti na bhassarato na bhassārāmataṃ anuyutto, na niddārāmo hoti na niddārato ",
      " niddārāmataṃ anuyutto, na saṅgaṇikārāmo hoti na saṅgaṇikarato na saṅgaṇikārāmataṃ anuyutto, na saṃsaggārāmo hoti na saṃsaggarato na saṃsaggārāmataṃ anuyutto, na papañcārāmo hoti na papañcarato na papañcārāmataṃ anuyutto. Evaṃ kho, āvuso, bhikkhu tathā ",
      " tathā vihāraṃ kappeti yathā yathāssa vihāraṃ kappayato bhaddakaṃ maraṇaṃ hoti, bhaddikā kālakiriyā. Ayaṃ vuccatāvuso – ‘bhikkhu nibbānābhirato pajahāsi sakkāyaṃ sammā dukkhassa antakiriyāyā’’’ti."
    ],
    "innerText": "‘‘Idhāvuso, bhikkhu na kammārāmo hoti na kammarato na kammārāmataṃ anuyutto, na bhassārāmo hoti na bhassarato na bhassārāmataṃ anuyutto, na niddārāmo hoti na niddārato niddārāmataṃ anuyutto, na saṅgaṇikārāmo hoti na saṅgaṇikarato na saṅgaṇikārāmataṃ anuyutto, na saṃsaggārāmo hoti na saṃsaggarato na saṃsaggārāmataṃ anuyutto, na papañcārāmo hoti na papañcarato na papañcārāmataṃ anuyutto. Evaṃ kho, āvuso, bhikkhu tathā tathā vihāraṃ kappeti yathā yathāssa vihāraṃ kappayato bhaddakaṃ maraṇaṃ hoti, bhaddikā kālakiriyā. Ayaṃ vuccatāvuso – ‘bhikkhu nibbānābhirato pajahāsi sakkāyaṃ sammā dukkhassa antakiriyāyā’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yo papañcamanuyutto, papañcābhirato mago;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Virādhayī so nibbānaṃ, yogakkhemaṃ anuttaraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yo ca papañcaṃ hitvāna, nippapañcapade rato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ārādhayī so nibbānaṃ, yogakkhemaṃ anuttara’’nti. catutthaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Anutappiyasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "15"
      },
      ". Tatra kho āyasmā sāriputto bhikkhū āmantesi – ‘‘tathā tathāvuso, bhikkhu vihāraṃ kappeti yathā yathāssa vihāraṃ kappayato kālakiriyā anutappā hoti. Kathañcāvuso, bhikkhu tathā tathā vihāraṃ kappeti yathā yathāssa vihāraṃ kappayato kālakiriyā anutappā hoti?"
    ],
    "innerText": "15. Tatra kho āyasmā sāriputto bhikkhū āmantesi – ‘‘tathā tathāvuso, bhikkhu vihāraṃ kappeti yathā yathāssa vihāraṃ kappayato kālakiriyā anutappā hoti. Kathañcāvuso, bhikkhu tathā tathā vihāraṃ kappeti yathā yathāssa vihāraṃ kappayato kālakiriyā anutappā hoti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idhāvuso, bhikkhu kammārāmo hoti kammarato kammārāmataṃ anuyutto, bhassārāmo hoti…pe… niddārāmo hoti… saṅgaṇikārāmo hoti… saṃsaggārāmo hoti… papañcārāmo hoti papañcarato papañcārāmataṃ ",
      " anuyutto. Evaṃ kho, āvuso, bhikkhu tathā tathā vihāraṃ kappeti yathā yathāssa vihāraṃ kappayato kālakiriyā anutappā hoti ",
      ". Ayaṃ vuccatāvuso – ‘bhikkhu sakkāyābhirato nappajahāsi sakkāyaṃ sammā dukkhassa antakiriyāya’’’."
    ],
    "innerText": "‘‘Idhāvuso, bhikkhu kammārāmo hoti kammarato kammārāmataṃ anuyutto, bhassārāmo hoti…pe… niddārāmo hoti… saṅgaṇikārāmo hoti… saṃsaggārāmo hoti… papañcārāmo hoti papañcarato papañcārāmataṃ anuyutto. Evaṃ kho, āvuso, bhikkhu tathā tathā vihāraṃ kappeti yathā yathāssa vihāraṃ kappayato kālakiriyā anutappā hoti . Ayaṃ vuccatāvuso – ‘bhikkhu sakkāyābhirato nappajahāsi sakkāyaṃ sammā dukkhassa antakiriyāya’’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tathā tathāvuso, bhikkhu vihāraṃ kappeti yathā yathāssa vihāraṃ kappayato kālakiriyā ananutappā ",
      " hoti. Kathañcāvuso, bhikkhu tathā tathā vihāraṃ kappeti yathā yathāssa vihāraṃ kappayato kālakiriyā ananutappā hoti?"
    ],
    "innerText": "‘‘Tathā tathāvuso, bhikkhu vihāraṃ kappeti yathā yathāssa vihāraṃ kappayato kālakiriyā ananutappā hoti. Kathañcāvuso, bhikkhu tathā tathā vihāraṃ kappeti yathā yathāssa vihāraṃ kappayato kālakiriyā ananutappā hoti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idhāvuso, bhikkhu na kammārāmo hoti na kammarato na kammārāmataṃ anuyutto, na bhassārāmo hoti…pe… na ",
      " niddārāmo hoti… na saṅgaṇikārāmo hoti… na saṃsaggārāmo hoti… na papañcārāmo hoti na papañcarato na papañcārāmataṃ anuyutto. Evaṃ kho, āvuso, bhikkhu tathā tathā vihāraṃ kappeti yathā yathāssa vihāraṃ kappayato kālakiriyā ananutappā hoti. Ayaṃ vuccatāvuso – ‘bhikkhu nibbānābhirato pajahāsi sakkāyaṃ sammā dukkhassa antakiriyāyā’’’ti."
    ],
    "innerText": "‘‘Idhāvuso, bhikkhu na kammārāmo hoti na kammarato na kammārāmataṃ anuyutto, na bhassārāmo hoti…pe… na niddārāmo hoti… na saṅgaṇikārāmo hoti… na saṃsaggārāmo hoti… na papañcārāmo hoti na papañcarato na papañcārāmataṃ anuyutto. Evaṃ kho, āvuso, bhikkhu tathā tathā vihāraṃ kappeti yathā yathāssa vihāraṃ kappayato kālakiriyā ananutappā hoti. Ayaṃ vuccatāvuso – ‘bhikkhu nibbānābhirato pajahāsi sakkāyaṃ sammā dukkhassa antakiriyāyā’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yo papañcamanuyutto, papañcābhirato mago;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Virādhayī so nibbānaṃ, yogakkhemaṃ anuttaraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yo ca papañcaṃ hitvāna, nippapañcapade rato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ārādhayī so nibbānaṃ, yogakkhemaṃ anuttara’’nti. pañcamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Nakulapitusuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "16"
      },
      ". Ekaṃ samayaṃ bhagavā bhaggesu viharati susumāragire ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[suṃsumāragire (sī. pī.), saṃsumāragire (katthaci)]"
      },
      " bhesakaḷāvane ",
      " migadāye. Tena kho pana samayena nakulapitā gahapati ābādhiko hoti dukkhito bāḷhagilāno. Atha kho nakulamātā gahapatānī nakulapitaraṃ gahapatiṃ etadavoca –"
    ],
    "innerText": "16. Ekaṃ samayaṃ bhagavā bhaggesu viharati susumāragire [suṃsumāragire (sī. pī.), saṃsumāragire (katthaci)] bhesakaḷāvane migadāye. Tena kho pana samayena nakulapitā gahapati ābādhiko hoti dukkhito bāḷhagilāno. Atha kho nakulamātā gahapatānī nakulapitaraṃ gahapatiṃ etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Mā kho tvaṃ, gahapati, sāpekkho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sāpekho (pī. ka.)]"
      },
      " kālamakāsi. Dukkhā, gahapati, sāpekkhassa kālakiriyā; garahitā ca bhagavatā sāpekkhassa kālakiriyā. Siyā kho pana te, gahapati, evamassa – ‘na nakulamātā gahapatānī mamaccayena sakkhissati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[na sakkhissati (sī. syā. kaṃ.), sakkoti (pī. ka.)]"
      },
      " dārake posetuṃ, gharāvāsaṃ sandharitu’nti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sandharitunti (ka.), saṇṭharituṃ (syā.)]"
      },
      ". Na kho panetaṃ, gahapati, evaṃ daṭṭhabbaṃ. Kusalāhaṃ, gahapati, kappāsaṃ ",
      " kantituṃ veṇiṃ olikhituṃ. Sakkomahaṃ, gahapati, tavaccayena dārake posetuṃ, gharāvāsaṃ ",
      " sandharituṃ. Tasmātiha ",
      " tvaṃ, gahapati, mā sāpekkho kālamakāsi. Dukkhā, gahapati, sāpekkhassa kālakiriyā; garahitā ca bhagavatā sāpekkhassa kālakiriyā."
    ],
    "innerText": "‘‘Mā kho tvaṃ, gahapati, sāpekkho [sāpekho (pī. ka.)] kālamakāsi. Dukkhā, gahapati, sāpekkhassa kālakiriyā; garahitā ca bhagavatā sāpekkhassa kālakiriyā. Siyā kho pana te, gahapati, evamassa – ‘na nakulamātā gahapatānī mamaccayena sakkhissati [na sakkhissati (sī. syā. kaṃ.), sakkoti (pī. ka.)] dārake posetuṃ, gharāvāsaṃ sandharitu’nti [sandharitunti (ka.), saṇṭharituṃ (syā.)]. Na kho panetaṃ, gahapati, evaṃ daṭṭhabbaṃ. Kusalāhaṃ, gahapati, kappāsaṃ kantituṃ veṇiṃ olikhituṃ. Sakkomahaṃ, gahapati, tavaccayena dārake posetuṃ, gharāvāsaṃ sandharituṃ. Tasmātiha tvaṃ, gahapati, mā sāpekkho kālamakāsi. Dukkhā, gahapati, sāpekkhassa kālakiriyā; garahitā ca bhagavatā sāpekkhassa kālakiriyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Siyā kho pana te, gahapati, evamassa – ‘nakulamātā gahapatānī mamaccayena aññaṃ gharaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[bhattāraṃ (syā. kaṃ.), vīraṃ (sī.)]"
      },
      " gamissatī’ti. Na kho panetaṃ, gahapati, evaṃ daṭṭhabbaṃ. Tvañceva kho, gahapati, jānāsi ahañca, yaṃ no ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yadā te (sī.), yathā (syā.), yathā no (pī.)]"
      },
      " soḷasavassāni gahaṭṭhakaṃ brahmacariyaṃ samāciṇṇaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[samādinnaṃ (sī.)]"
      },
      ". Tasmātiha tvaṃ, gahapati, mā sāpekkho kālamakāsi. Dukkhā, gahapati, sāpekkhassa kālakiriyā; garahitā ca bhagavatā sāpekkhassa kālakiriyā."
    ],
    "innerText": "‘‘Siyā kho pana te, gahapati, evamassa – ‘nakulamātā gahapatānī mamaccayena aññaṃ gharaṃ [bhattāraṃ (syā. kaṃ.), vīraṃ (sī.)] gamissatī’ti. Na kho panetaṃ, gahapati, evaṃ daṭṭhabbaṃ. Tvañceva kho, gahapati, jānāsi ahañca, yaṃ no [yadā te (sī.), yathā (syā.), yathā no (pī.)] soḷasavassāni gahaṭṭhakaṃ brahmacariyaṃ samāciṇṇaṃ [samādinnaṃ (sī.)]. Tasmātiha tvaṃ, gahapati, mā sāpekkho kālamakāsi. Dukkhā, gahapati, sāpekkhassa kālakiriyā; garahitā ca bhagavatā sāpekkhassa kālakiriyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Siyā kho pana te, gahapati, evamassa – ‘nakulamātā gahapatānī mamaccayena na dassanakāmā bhavissati bhagavato na dassanakāmā bhikkhusaṅghassā’ti. Na kho panetaṃ, gahapati, evaṃ daṭṭhabbaṃ. Ahañhi, gahapati, tavaccayena dassanakāmatarā ceva bhavissāmi bhagavato, dassanakāmatarā ",
      " ca bhikkhusaṅghassa. Tasmātiha tvaṃ, gahapati, mā sāpekkho kālamakāsi. Dukkhā, gahapati, sāpekkhassa kālakiriyā; garahitā ca bhagavatā sāpekkhassa kālakiriyā."
    ],
    "innerText": "‘‘Siyā kho pana te, gahapati, evamassa – ‘nakulamātā gahapatānī mamaccayena na dassanakāmā bhavissati bhagavato na dassanakāmā bhikkhusaṅghassā’ti. Na kho panetaṃ, gahapati, evaṃ daṭṭhabbaṃ. Ahañhi, gahapati, tavaccayena dassanakāmatarā ceva bhavissāmi bhagavato, dassanakāmatarā ca bhikkhusaṅghassa. Tasmātiha tvaṃ, gahapati, mā sāpekkho kālamakāsi. Dukkhā, gahapati, sāpekkhassa kālakiriyā; garahitā ca bhagavatā sāpekkhassa kālakiriyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Siyā kho pana te, gahapati, evamassa – ‘na nakulamātā gahapatānī mamaccayena sīlesu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[nakulamātā… na sīlesu (sī. pī.)]"
      },
      " paripūrakārinī’ti. Na kho panetaṃ, gahapati, evaṃ daṭṭhabbaṃ. Yāvatā kho, gahapati, tassa bhagavato sāvikā gihī odātavasanā sīlesu paripūrakāriniyo, ahaṃ tāsaṃ aññatarā. Yassa kho panassa kaṅkhā vā vimati vā – ayaṃ so bhagavā arahaṃ sammāsambuddho bhaggesu viharati susumāragire bhesakaḷāvane migadāye – taṃ bhagavantaṃ upasaṅkamitvā pucchatu. Tasmātiha tvaṃ, gahapati, mā sāpekkho kālamakāsi ",
      ". Dukkhā, gahapati, sāpekkhassa kālakiriyā; garahitā ca bhagavatā sāpekkhassa kālakiriyā."
    ],
    "innerText": "‘‘Siyā kho pana te, gahapati, evamassa – ‘na nakulamātā gahapatānī mamaccayena sīlesu [nakulamātā… na sīlesu (sī. pī.)] paripūrakārinī’ti. Na kho panetaṃ, gahapati, evaṃ daṭṭhabbaṃ. Yāvatā kho, gahapati, tassa bhagavato sāvikā gihī odātavasanā sīlesu paripūrakāriniyo, ahaṃ tāsaṃ aññatarā. Yassa kho panassa kaṅkhā vā vimati vā – ayaṃ so bhagavā arahaṃ sammāsambuddho bhaggesu viharati susumāragire bhesakaḷāvane migadāye – taṃ bhagavantaṃ upasaṅkamitvā pucchatu. Tasmātiha tvaṃ, gahapati, mā sāpekkho kālamakāsi . Dukkhā, gahapati, sāpekkhassa kālakiriyā; garahitā ca bhagavatā sāpekkhassa kālakiriyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Siyā ",
      " kho pana te, gahapati, evamassa – ‘na nakulamātā gahapatānī lābhinī ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[nakulamātā gahapatānī na lābhinī (pī.)]"
      },
      " ajjhattaṃ cetosamathassā’ti. Na kho panetaṃ, gahapati, evaṃ daṭṭhabbaṃ. Yāvatā kho, gahapati, tassa bhagavato sāvikā gihī odātavasanā lābhiniyo ajjhattaṃ cetosamathassa, ahaṃ tāsaṃ aññatarā. Yassa kho panassa kaṅkhā vā vimati vā – ayaṃ so bhagavā arahaṃ sammāsambuddho ",
      " bhaggesu viharati susumāragire bhesakaḷāvane migadāye – taṃ bhagavantaṃ upasaṅkamitvā pucchatu. Tasmātiha tvaṃ, gahapati, mā sāpekkho kālamakāsi. Dukkhā, gahapati, sāpekkhassa kālakiriyā; garahitā ca bhagavatā sāpekkhassa kālakiriyā."
    ],
    "innerText": "‘‘Siyā kho pana te, gahapati, evamassa – ‘na nakulamātā gahapatānī lābhinī [nakulamātā gahapatānī na lābhinī (pī.)] ajjhattaṃ cetosamathassā’ti. Na kho panetaṃ, gahapati, evaṃ daṭṭhabbaṃ. Yāvatā kho, gahapati, tassa bhagavato sāvikā gihī odātavasanā lābhiniyo ajjhattaṃ cetosamathassa, ahaṃ tāsaṃ aññatarā. Yassa kho panassa kaṅkhā vā vimati vā – ayaṃ so bhagavā arahaṃ sammāsambuddho bhaggesu viharati susumāragire bhesakaḷāvane migadāye – taṃ bhagavantaṃ upasaṅkamitvā pucchatu. Tasmātiha tvaṃ, gahapati, mā sāpekkho kālamakāsi. Dukkhā, gahapati, sāpekkhassa kālakiriyā; garahitā ca bhagavatā sāpekkhassa kālakiriyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Siyā kho pana te, gahapati, evamassa – ‘na nakulamātā ",
      " gahapatānī imasmiṃ dhammavinaye ogādhappattā patigādhappattā assāsappattā tiṇṇavicikicchā vigatakathaṃkathā vesārajjappattā aparappaccayā satthusāsane viharatī’ti. Na kho panetaṃ, gahapati, evaṃ daṭṭhabbaṃ. Yāvatā kho, gahapati, tassa bhagavato sāvikā gihī odātavasanā imasmiṃ dhammavinaye ogādhappattā patigādhappattā assāsappattā tiṇṇavicikicchā vigatakathaṃkathā vesārajjappattā aparappaccayā satthusāsane viharanti, ahaṃ tāsaṃ aññatarā. Yassa kho panassa kaṅkhā vā vimati vā – ayaṃ so bhagavā arahaṃ sammāsambuddho bhaggesu viharati susumāragire bhesakaḷāvane migadāye – taṃ bhagavantaṃ upasaṅkamitvā pucchatu. Tasmātiha tvaṃ, gahapati, mā sāpekkho kālamakāsi. Dukkhā gahapati sāpekkhassa kālakiriyā; garahitā ca bhagavatā sāpekkhassa kālakiriyā’’ti."
    ],
    "innerText": "‘‘Siyā kho pana te, gahapati, evamassa – ‘na nakulamātā gahapatānī imasmiṃ dhammavinaye ogādhappattā patigādhappattā assāsappattā tiṇṇavicikicchā vigatakathaṃkathā vesārajjappattā aparappaccayā satthusāsane viharatī’ti. Na kho panetaṃ, gahapati, evaṃ daṭṭhabbaṃ. Yāvatā kho, gahapati, tassa bhagavato sāvikā gihī odātavasanā imasmiṃ dhammavinaye ogādhappattā patigādhappattā assāsappattā tiṇṇavicikicchā vigatakathaṃkathā vesārajjappattā aparappaccayā satthusāsane viharanti, ahaṃ tāsaṃ aññatarā. Yassa kho panassa kaṅkhā vā vimati vā – ayaṃ so bhagavā arahaṃ sammāsambuddho bhaggesu viharati susumāragire bhesakaḷāvane migadāye – taṃ bhagavantaṃ upasaṅkamitvā pucchatu. Tasmātiha tvaṃ, gahapati, mā sāpekkho kālamakāsi. Dukkhā gahapati sāpekkhassa kālakiriyā; garahitā ca bhagavatā sāpekkhassa kālakiriyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho nakulapituno gahapatissa nakulamātarā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[nakulamātāya (sī. syā.), nakulamātuyā (ka.)]"
      },
      " gahapatāniyā iminā ovādena ovadiyamānassa so ābādho ṭhānaso paṭippassambhi. Vuṭṭhahi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vuṭṭhāti (ka.)]"
      },
      " ca nakulapitā gahapati tamhā ābādhā; tathā pahīno ca pana nakulapituno gahapatissa so ābādho ahosi. Atha kho nakulapitā gahapati gilānā vuṭṭhito ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[‘‘gilānabhāvato vuṭṭhāya ṭhito, bhāvappadhāno hi ayaṃ niddeso’’ti ṭīkāsaṃvaṇṇanā]"
      },
      " aciravuṭṭhito gelaññā daṇḍamolubbha ",
      " yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho nakulapitaraṃ gahapatiṃ bhagavā etadavoca –"
    ],
    "innerText": "Atha kho nakulapituno gahapatissa nakulamātarā [nakulamātāya (sī. syā.), nakulamātuyā (ka.)] gahapatāniyā iminā ovādena ovadiyamānassa so ābādho ṭhānaso paṭippassambhi. Vuṭṭhahi [vuṭṭhāti (ka.)] ca nakulapitā gahapati tamhā ābādhā; tathā pahīno ca pana nakulapituno gahapatissa so ābādho ahosi. Atha kho nakulapitā gahapati gilānā vuṭṭhito [‘‘gilānabhāvato vuṭṭhāya ṭhito, bhāvappadhāno hi ayaṃ niddeso’’ti ṭīkāsaṃvaṇṇanā] aciravuṭṭhito gelaññā daṇḍamolubbha yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho nakulapitaraṃ gahapatiṃ bhagavā etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Lābhā te, gahapati, suladdhaṃ te, gahapati! Yassa te nakulamātā ",
      " gahapatānī anukampikā atthakāmā ovādikā anusāsikā. Yāvatā kho, gahapati, mama sāvikā gihī odātavasanā sīlesu paripūrakāriniyo, nakulamātā gahapatānī tāsaṃ aññatarā. Yāvatā kho, gahapati, mama sāvikā gihī odātavasanā lābhiniyo ajjhattaṃ cetosamathassa, nakulamātā gahapatānī tāsaṃ aññatarā. Yāvatā kho, gahapati, mama sāvikā gihī odātavasanā imasmiṃ dhammavinaye ogādhappattā patigādhappattā assāsappattā tiṇṇavicikicchā vigatakathaṃkathā ",
      " vesārajjappattā aparappaccayā satthusāsane viharanti, nakulamātā gahapatānī tāsaṃ aññatarā. Lābhā te, gahapati, suladdhaṃ te, gahapati! Yassa te nakulamātā gahapatānī anukampikā atthakāmā ovādikā anusāsikā’’ti. Chaṭṭhaṃ."
    ],
    "innerText": "‘‘Lābhā te, gahapati, suladdhaṃ te, gahapati! Yassa te nakulamātā gahapatānī anukampikā atthakāmā ovādikā anusāsikā. Yāvatā kho, gahapati, mama sāvikā gihī odātavasanā sīlesu paripūrakāriniyo, nakulamātā gahapatānī tāsaṃ aññatarā. Yāvatā kho, gahapati, mama sāvikā gihī odātavasanā lābhiniyo ajjhattaṃ cetosamathassa, nakulamātā gahapatānī tāsaṃ aññatarā. Yāvatā kho, gahapati, mama sāvikā gihī odātavasanā imasmiṃ dhammavinaye ogādhappattā patigādhappattā assāsappattā tiṇṇavicikicchā vigatakathaṃkathā vesārajjappattā aparappaccayā satthusāsane viharanti, nakulamātā gahapatānī tāsaṃ aññatarā. Lābhā te, gahapati, suladdhaṃ te, gahapati! Yassa te nakulamātā gahapatānī anukampikā atthakāmā ovādikā anusāsikā’’ti. Chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Soppasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "17"
      },
      ". Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho bhagavā sāyanhasamayaṃ paṭisallānā vuṭṭhito yenupaṭṭhānasālā tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Āyasmāpi kho sāriputto sāyanhasamayaṃ paṭisallānā vuṭṭhito yenupaṭṭhānasālā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ ",
      " abhivādetvā ekamantaṃ nisīdi. Āyasmāpi kho mahāmoggallāno…pe… āyasmāpi kho mahākassapo… āyasmāpi kho mahākaccāyano… āyasmāpi kho mahākoṭṭhiko ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mahākoṭṭhito (sī. pī.)]"
      },
      " … āyasmāpi kho mahācundo… āyasmāpi kho mahākappino… āyasmāpi kho anuruddho… āyasmāpi kho revato… āyasmāpi kho ",
      " ānando sāyanhasamayaṃ paṭisallānā vuṭṭhito yenupaṭṭhānasālā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Atha kho bhagavā bahudeva rattiṃ nisajjāya vītināmetvā uṭṭhāyāsanā vihāraṃ pāvisi. Tepi kho āyasmanto ",
      " acirapakkantassa bhagavato uṭṭhāyāsanā yathāvihāraṃ agamaṃsu. Ye pana tattha bhikkhū navā acirapabbajitā adhunāgatā imaṃ dhammavinayaṃ te yāva sūriyuggamanā kākacchamānā supiṃsu. Addasā kho bhagavā dibbena cakkhunā visuddhena atikkantamānusakena te bhikkhū yāva sūriyuggamanā kākacchamāne supante. Disvā yenupaṭṭhānasālā tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Nisajja kho bhagavā bhikkhū āmantesi –"
    ],
    "innerText": "17. Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho bhagavā sāyanhasamayaṃ paṭisallānā vuṭṭhito yenupaṭṭhānasālā tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Āyasmāpi kho sāriputto sāyanhasamayaṃ paṭisallānā vuṭṭhito yenupaṭṭhānasālā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Āyasmāpi kho mahāmoggallāno…pe… āyasmāpi kho mahākassapo… āyasmāpi kho mahākaccāyano… āyasmāpi kho mahākoṭṭhiko [mahākoṭṭhito (sī. pī.)] … āyasmāpi kho mahācundo… āyasmāpi kho mahākappino… āyasmāpi kho anuruddho… āyasmāpi kho revato… āyasmāpi kho ānando sāyanhasamayaṃ paṭisallānā vuṭṭhito yenupaṭṭhānasālā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Atha kho bhagavā bahudeva rattiṃ nisajjāya vītināmetvā uṭṭhāyāsanā vihāraṃ pāvisi. Tepi kho āyasmanto acirapakkantassa bhagavato uṭṭhāyāsanā yathāvihāraṃ agamaṃsu. Ye pana tattha bhikkhū navā acirapabbajitā adhunāgatā imaṃ dhammavinayaṃ te yāva sūriyuggamanā kākacchamānā supiṃsu. Addasā kho bhagavā dibbena cakkhunā visuddhena atikkantamānusakena te bhikkhū yāva sūriyuggamanā kākacchamāne supante. Disvā yenupaṭṭhānasālā tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Nisajja kho bhagavā bhikkhū āmantesi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kahaṃ nu kho, bhikkhave, sāriputto? Kahaṃ mahāmoggallāno? Kahaṃ mahākassapo? Kahaṃ mahākaccāyano? Kahaṃ mahākoṭṭhiko? Kahaṃ mahācundo? Kahaṃ mahākappino? Kahaṃ anuruddho? Kahaṃ revato? Kahaṃ ānando? Kahaṃ nu kho te, bhikkhave, therā sāvakā gatā’’ti? ‘‘Tepi kho, bhante, āyasmanto acirapakkantassa bhagavato uṭṭhāyāsanā yathāvihāraṃ agamaṃsū’’ti. ‘‘Kena no ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kena no (ka.), ke nu (katthaci)]"
      },
      " tumhe, bhikkhave, therā bhikkhū nāgatāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[bhikkhū navā (sī. syā. kaṃ. pī.), bhikkhū gatāti (?)]"
      },
      " yāva sūriyuggamanā kākacchamānā supatha? Taṃ kiṃ maññatha, bhikkhave, api nu tumhehi diṭṭhaṃ vā sutaṃ ",
      " vā – ‘rājā khattiyo muddhābhisitto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[muddhābhisitto (ka.)]"
      },
      " yāvadatthaṃ seyyasukhaṃ ",
      " passasukhaṃ middhasukhaṃ anuyutto viharanto yāvajīvaṃ rajjaṃ kārento janapadassa vā piyo manāpo’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Sādhu, bhikkhave! Mayāpi kho etaṃ, bhikkhave, neva ",
      " diṭṭhaṃ na sutaṃ – ‘rājā khattiyo muddhābhisitto yāvadatthaṃ seyyasukhaṃ passasukhaṃ middhasukhaṃ anuyutto viharanto yāvajīvaṃ rajjaṃ kārento janapadassa vā piyo manāpo’’’ti."
    ],
    "innerText": "‘‘Kahaṃ nu kho, bhikkhave, sāriputto? Kahaṃ mahāmoggallāno? Kahaṃ mahākassapo? Kahaṃ mahākaccāyano? Kahaṃ mahākoṭṭhiko? Kahaṃ mahācundo? Kahaṃ mahākappino? Kahaṃ anuruddho? Kahaṃ revato? Kahaṃ ānando? Kahaṃ nu kho te, bhikkhave, therā sāvakā gatā’’ti? ‘‘Tepi kho, bhante, āyasmanto acirapakkantassa bhagavato uṭṭhāyāsanā yathāvihāraṃ agamaṃsū’’ti. ‘‘Kena no [kena no (ka.), ke nu (katthaci)] tumhe, bhikkhave, therā bhikkhū nāgatāti [bhikkhū navā (sī. syā. kaṃ. pī.), bhikkhū gatāti (?)] yāva sūriyuggamanā kākacchamānā supatha? Taṃ kiṃ maññatha, bhikkhave, api nu tumhehi diṭṭhaṃ vā sutaṃ vā – ‘rājā khattiyo muddhābhisitto [muddhābhisitto (ka.)] yāvadatthaṃ seyyasukhaṃ passasukhaṃ middhasukhaṃ anuyutto viharanto yāvajīvaṃ rajjaṃ kārento janapadassa vā piyo manāpo’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Sādhu, bhikkhave! Mayāpi kho etaṃ, bhikkhave, neva diṭṭhaṃ na sutaṃ – ‘rājā khattiyo muddhābhisitto yāvadatthaṃ seyyasukhaṃ passasukhaṃ middhasukhaṃ anuyutto viharanto yāvajīvaṃ rajjaṃ kārento janapadassa vā piyo manāpo’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Taṃ kiṃ maññatha, bhikkhave, api nu tumhehi diṭṭhaṃ vā sutaṃ vā – ‘raṭṭhiko…pe… pettaṇiko… senāpatiko… gāmagāmaṇiko ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[gāmagāmiko (sī. pī.)]"
      },
      " … pūgagāmaṇiko yāvadatthaṃ seyyasukhaṃ passasukhaṃ middhasukhaṃ anuyutto viharanto yāvajīvaṃ pūgagāmaṇikattaṃ kārento pūgassa vā piyo manāpo’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Sādhu, bhikkhave! Mayāpi kho etaṃ, bhikkhave, neva diṭṭhaṃ na sutaṃ – ‘pūgagāmaṇiko yāvadatthaṃ seyyasukhaṃ passasukhaṃ middhasukhaṃ anuyutto viharanto yāvajīvaṃ pūgagāmaṇikattaṃ vā kārento pūgassa vā piyo manāpo’’’ti."
    ],
    "innerText": "‘‘Taṃ kiṃ maññatha, bhikkhave, api nu tumhehi diṭṭhaṃ vā sutaṃ vā – ‘raṭṭhiko…pe… pettaṇiko… senāpatiko… gāmagāmaṇiko [gāmagāmiko (sī. pī.)] … pūgagāmaṇiko yāvadatthaṃ seyyasukhaṃ passasukhaṃ middhasukhaṃ anuyutto viharanto yāvajīvaṃ pūgagāmaṇikattaṃ kārento pūgassa vā piyo manāpo’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Sādhu, bhikkhave! Mayāpi kho etaṃ, bhikkhave, neva diṭṭhaṃ na sutaṃ – ‘pūgagāmaṇiko yāvadatthaṃ seyyasukhaṃ passasukhaṃ middhasukhaṃ anuyutto viharanto yāvajīvaṃ pūgagāmaṇikattaṃ vā kārento pūgassa vā piyo manāpo’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Taṃ ",
      " kiṃ maññatha, bhikkhave, api nu tumhehi diṭṭhaṃ vā sutaṃ vā – ‘samaṇo vā brāhmaṇo vā yāvadatthaṃ seyyasukhaṃ passasukhaṃ middhasukhaṃ anuyutto indriyesu aguttadvāro bhojane amattaññū jāgariyaṃ ananuyutto avipassako kusalānaṃ dhammānaṃ pubbarattāpararattaṃ bodhipakkhiyānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[bodhapakkhiyānaṃ (sī.), bodhapakkhikānaṃ (pī.)]"
      },
      " dhammānaṃ bhāvanānuyogaṃ ananuyutto āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharanto’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Sādhu, bhikkhave! Mayāpi kho etaṃ, bhikkhave, neva diṭṭhaṃ na sutaṃ ",
      " – ‘samaṇo vā brāhmaṇo vā yāvadatthaṃ seyyasukhaṃ passasukhaṃ middhasukhaṃ anuyutto indriyesu aguttadvāro bhojane amattaññū jāgariyaṃ ananuyutto avipassako kusalānaṃ dhammānaṃ pubbarattāpararattaṃ bodhipakkhiyānaṃ dhammānaṃ bhāvanānuyogaṃ ananuyutto ",
      " āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharanto’’’ti."
    ],
    "innerText": "‘‘Taṃ kiṃ maññatha, bhikkhave, api nu tumhehi diṭṭhaṃ vā sutaṃ vā – ‘samaṇo vā brāhmaṇo vā yāvadatthaṃ seyyasukhaṃ passasukhaṃ middhasukhaṃ anuyutto indriyesu aguttadvāro bhojane amattaññū jāgariyaṃ ananuyutto avipassako kusalānaṃ dhammānaṃ pubbarattāpararattaṃ bodhipakkhiyānaṃ [bodhapakkhiyānaṃ (sī.), bodhapakkhikānaṃ (pī.)] dhammānaṃ bhāvanānuyogaṃ ananuyutto āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharanto’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Sādhu, bhikkhave! Mayāpi kho etaṃ, bhikkhave, neva diṭṭhaṃ na sutaṃ – ‘samaṇo vā brāhmaṇo vā yāvadatthaṃ seyyasukhaṃ passasukhaṃ middhasukhaṃ anuyutto indriyesu aguttadvāro bhojane amattaññū jāgariyaṃ ananuyutto avipassako kusalānaṃ dhammānaṃ pubbarattāpararattaṃ bodhipakkhiyānaṃ dhammānaṃ bhāvanānuyogaṃ ananuyutto āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharanto’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘indriyesu guttadvārā bhavissāma, bhojane mattaññuno, jāgariyaṃ anuyuttā, vipassakā kusalānaṃ dhammānaṃ ",
      ", pubbarattāpararattaṃ bodhipakkhiyānaṃ dhammānaṃ, bhāvanānuyogamanuyuttā viharissāmā’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Sattamaṃ."
    ],
    "innerText": "‘‘Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘indriyesu guttadvārā bhavissāma, bhojane mattaññuno, jāgariyaṃ anuyuttā, vipassakā kusalānaṃ dhammānaṃ , pubbarattāpararattaṃ bodhipakkhiyānaṃ dhammānaṃ, bhāvanānuyogamanuyuttā viharissāmā’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Macchabandhasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "18"
      },
      ". Ekaṃ samayaṃ bhagavā kosalesu cārikaṃ carati mahatā bhikkhusaṅghena saddhiṃ. Addasā kho bhagavā addhānamaggappaṭipanno aññatarasmiṃ padese macchikaṃ macchabandhaṃ macche vadhitvā vadhitvā vikkiṇamānaṃ. Disvā maggā okkamma aññatarasmiṃ rukkhamūle paññatte āsane nisīdi. Nisajja kho bhagavā bhikkhū āmantesi – ‘‘passatha no tumhe, bhikkhave, amuṃ macchikaṃ macchabandhaṃ macche vadhitvā vadhitvā vikkiṇamāna’’nti? ‘‘Evaṃ, bhante’’."
    ],
    "innerText": "18. Ekaṃ samayaṃ bhagavā kosalesu cārikaṃ carati mahatā bhikkhusaṅghena saddhiṃ. Addasā kho bhagavā addhānamaggappaṭipanno aññatarasmiṃ padese macchikaṃ macchabandhaṃ macche vadhitvā vadhitvā vikkiṇamānaṃ. Disvā maggā okkamma aññatarasmiṃ rukkhamūle paññatte āsane nisīdi. Nisajja kho bhagavā bhikkhū āmantesi – ‘‘passatha no tumhe, bhikkhave, amuṃ macchikaṃ macchabandhaṃ macche vadhitvā vadhitvā vikkiṇamāna’’nti? ‘‘Evaṃ, bhante’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Taṃ kiṃ maññatha, bhikkhave, api nu tumhehi diṭṭhaṃ vā sutaṃ vā – ‘macchiko macchabandho macche vadhitvā vadhitvā ",
      " vikkiṇamāno tena kammena tena ājīvena hatthiyāyī vā assayāyī vā rathayāyī vā yānayāyī vā bhogabhogī vā mahantaṃ vā bhogakkhandhaṃ ajjhāvasanto’’’ti? ‘‘No hetaṃ, bhante’’ ",
      ". ‘‘Sādhu, bhikkhave! Mayāpi kho etaṃ, bhikkhave, neva diṭṭhaṃ na sutaṃ – ‘macchiko macchabandho macche vadhitvā vadhitvā vikkiṇamāno tena kammena tena ājīvena hatthiyāyī vā assayāyī vā rathayāyī vā yānayāyī vā bhogabhogī ",
      " vā mahantaṃ vā bhogakkhandhaṃ ajjhāvasanto’ti. Taṃ kissa hetu? Te hi so, bhikkhave, macche vajjhe vadhāyupanīte ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vadhāyānīte (syā. kaṃ.), vadhāya nīte (ka.)]"
      },
      " pāpakena manasānupekkhati, tasmā so neva hatthiyāyī hoti na assayāyī na rathayāyī na yānayāyī na bhogabhogī, na mahantaṃ bhogakkhandhaṃ ajjhāvasati."
    ],
    "innerText": "‘‘Taṃ kiṃ maññatha, bhikkhave, api nu tumhehi diṭṭhaṃ vā sutaṃ vā – ‘macchiko macchabandho macche vadhitvā vadhitvā vikkiṇamāno tena kammena tena ājīvena hatthiyāyī vā assayāyī vā rathayāyī vā yānayāyī vā bhogabhogī vā mahantaṃ vā bhogakkhandhaṃ ajjhāvasanto’’’ti? ‘‘No hetaṃ, bhante’’ . ‘‘Sādhu, bhikkhave! Mayāpi kho etaṃ, bhikkhave, neva diṭṭhaṃ na sutaṃ – ‘macchiko macchabandho macche vadhitvā vadhitvā vikkiṇamāno tena kammena tena ājīvena hatthiyāyī vā assayāyī vā rathayāyī vā yānayāyī vā bhogabhogī vā mahantaṃ vā bhogakkhandhaṃ ajjhāvasanto’ti. Taṃ kissa hetu? Te hi so, bhikkhave, macche vajjhe vadhāyupanīte [vadhāyānīte (syā. kaṃ.), vadhāya nīte (ka.)] pāpakena manasānupekkhati, tasmā so neva hatthiyāyī hoti na assayāyī na rathayāyī na yānayāyī na bhogabhogī, na mahantaṃ bhogakkhandhaṃ ajjhāvasati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Taṃ kiṃ maññatha, bhikkhave, api nu tumhehi diṭṭhaṃ vā sutaṃ vā – ‘goghātako gāvo vadhitvā vadhitvā vikkiṇamāno tena kammena tena ājīvena hatthiyāyī vā assayāyī vā rathayāyī vā yānayāyī vā bhogabhogī vā mahantaṃ vā bhogakkhandhaṃ ajjhāvasanto’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Sādhu, bhikkhave! Mayāpi kho etaṃ, bhikkhave, neva diṭṭhaṃ na sutaṃ – ‘goghātako gāvo vadhitvā vadhitvā vikkiṇamāno tena kammena tena ājīvena hatthiyāyī vā assayāyī vā rathayāyī vā yānayāyī vā bhogabhogī vā mahantaṃ vā bhogakkhandhaṃ ajjhāvasanto’ti. Taṃ kissa hetu? Te hi so, bhikkhave, gāvo vajjhe vadhāyupanīte pāpakena ",
      " manasānupekkhati, tasmā so neva hatthiyāyī hoti na assayāyī na rathayāyī na yānayāyī na bhogabhogī, na mahantaṃ bhogakkhandhaṃ ajjhāvasati’’."
    ],
    "innerText": "‘‘Taṃ kiṃ maññatha, bhikkhave, api nu tumhehi diṭṭhaṃ vā sutaṃ vā – ‘goghātako gāvo vadhitvā vadhitvā vikkiṇamāno tena kammena tena ājīvena hatthiyāyī vā assayāyī vā rathayāyī vā yānayāyī vā bhogabhogī vā mahantaṃ vā bhogakkhandhaṃ ajjhāvasanto’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Sādhu, bhikkhave! Mayāpi kho etaṃ, bhikkhave, neva diṭṭhaṃ na sutaṃ – ‘goghātako gāvo vadhitvā vadhitvā vikkiṇamāno tena kammena tena ājīvena hatthiyāyī vā assayāyī vā rathayāyī vā yānayāyī vā bhogabhogī vā mahantaṃ vā bhogakkhandhaṃ ajjhāvasanto’ti. Taṃ kissa hetu? Te hi so, bhikkhave, gāvo vajjhe vadhāyupanīte pāpakena manasānupekkhati, tasmā so neva hatthiyāyī hoti na assayāyī na rathayāyī na yānayāyī na bhogabhogī, na mahantaṃ bhogakkhandhaṃ ajjhāvasati’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Taṃ kiṃ maññatha, bhikkhave, api nu tumhehi diṭṭhaṃ vā ",
      " sutaṃ vā – ‘orabbhiko…pe… sūkariko ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sokariko (syā.)]"
      },
      " …pe… sākuṇiko…pe… māgaviko mage ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mige (syā. kaṃ.)]"
      },
      " vadhitvā vadhitvā vikkiṇamāno tena kammena tena ājīvena hatthiyāyī vā assayāyī vā rathayāyī vā yānayāyī ",
      " vā bhogabhogī vā mahantaṃ vā bhogakkhandhaṃ ajjhāvasanto’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Sādhu, bhikkhave! Mayāpi kho etaṃ, bhikkhave, neva diṭṭhaṃ na sutaṃ – ‘māgaviko mage vadhitvā vadhitvā vikkiṇamāno tena kammena tena ājīvena hatthiyāyī vā assayāyī vā rathayāyī vā yānayāyī vā bhogabhogī vā mahantaṃ vā bhogakkhandhaṃ ajjhāvasanto’ti. Taṃ kissa hetu? Te hi so, bhikkhave, mage vajjhe vadhāyupanīte pāpakena manasānupekkhati, tasmā so neva hatthiyāyī hoti na assayāyī na rathayāyī na yānayāyī ",
      " na bhogabhogī, na mahantaṃ bhogakkhandhaṃ ajjhāvasati. Te hi (nāma) ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[( ) bahūsu natthi]"
      },
      " so, bhikkhave, tiracchānagate pāṇe vajjhe vadhāyupanīte pāpakena manasānupekkhamāno ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[manasānupekkhati, tasmā so (syā. ka.)]"
      },
      " neva hatthiyāyī bhavissati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[hoti (syā. ka.)]"
      },
      " na assayāyī na rathayāyī na yānayāyī na bhogabhogī, na mahantaṃ bhogakkhandhaṃ ajjhāvasissati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ajjhāvasati (syā. ka.)]"
      },
      ". Ko pana vādo yaṃ manussabhūtaṃ vajjhaṃ vadhāyupanītaṃ pāpakena manasānupekkhati! Tañhi tassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[taṃ hissa (pī. ka.)]"
      },
      ", bhikkhave, hoti dīgharattaṃ ahitāya dukkhāya. Kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjatī’’ti. Aṭṭhamaṃ."
    ],
    "innerText": "‘‘Taṃ kiṃ maññatha, bhikkhave, api nu tumhehi diṭṭhaṃ vā sutaṃ vā – ‘orabbhiko…pe… sūkariko [sokariko (syā.)] …pe… sākuṇiko…pe… māgaviko mage [mige (syā. kaṃ.)] vadhitvā vadhitvā vikkiṇamāno tena kammena tena ājīvena hatthiyāyī vā assayāyī vā rathayāyī vā yānayāyī vā bhogabhogī vā mahantaṃ vā bhogakkhandhaṃ ajjhāvasanto’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Sādhu, bhikkhave! Mayāpi kho etaṃ, bhikkhave, neva diṭṭhaṃ na sutaṃ – ‘māgaviko mage vadhitvā vadhitvā vikkiṇamāno tena kammena tena ājīvena hatthiyāyī vā assayāyī vā rathayāyī vā yānayāyī vā bhogabhogī vā mahantaṃ vā bhogakkhandhaṃ ajjhāvasanto’ti. Taṃ kissa hetu? Te hi so, bhikkhave, mage vajjhe vadhāyupanīte pāpakena manasānupekkhati, tasmā so neva hatthiyāyī hoti na assayāyī na rathayāyī na yānayāyī na bhogabhogī, na mahantaṃ bhogakkhandhaṃ ajjhāvasati. Te hi (nāma) [( ) bahūsu natthi] so, bhikkhave, tiracchānagate pāṇe vajjhe vadhāyupanīte pāpakena manasānupekkhamāno [manasānupekkhati, tasmā so (syā. ka.)] neva hatthiyāyī bhavissati [hoti (syā. ka.)] na assayāyī na rathayāyī na yānayāyī na bhogabhogī, na mahantaṃ bhogakkhandhaṃ ajjhāvasissati [ajjhāvasati (syā. ka.)]. Ko pana vādo yaṃ manussabhūtaṃ vajjhaṃ vadhāyupanītaṃ pāpakena manasānupekkhati! Tañhi tassa [taṃ hissa (pī. ka.)], bhikkhave, hoti dīgharattaṃ ahitāya dukkhāya. Kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjatī’’ti. Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Paṭhamamaraṇassatisuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "19"
      },
      ". Ekaṃ samayaṃ bhagavā nātike ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[nādike (sī. syā. kaṃ. pī.) a. ni. 8.73]"
      },
      " viharati giñjakāvasathe. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti ",
      ". ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘maraṇassati, bhikkhave, bhāvitā bahulīkatā mahapphalā hoti mahānisaṃsā amatogadhā amatapariyosānā. Bhāvetha no tumhe, bhikkhave, maraṇassati’’nti?"
    ],
    "innerText": "19. Ekaṃ samayaṃ bhagavā nātike [nādike (sī. syā. kaṃ. pī.) a. ni. 8.73] viharati giñjakāvasathe. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti . ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘maraṇassati, bhikkhave, bhāvitā bahulīkatā mahapphalā hoti mahānisaṃsā amatogadhā amatapariyosānā. Bhāvetha no tumhe, bhikkhave, maraṇassati’’nti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ vutte aññataro bhikkhu ",
      " bhagavantaṃ etadavoca – ‘‘ahaṃ kho, bhante, bhāvemi maraṇassati’’nti. ‘‘Yathā kathaṃ pana tvaṃ, bhikkhu, bhāvesi maraṇassati’’nti? ‘‘Idha mayhaṃ, bhante ",
      ", evaṃ hoti – ‘aho vatāhaṃ rattindivaṃ jīveyyaṃ, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’ti. Evaṃ kho ahaṃ, bhante, bhāvemi maraṇassati’’nti."
    ],
    "innerText": "Evaṃ vutte aññataro bhikkhu bhagavantaṃ etadavoca – ‘‘ahaṃ kho, bhante, bhāvemi maraṇassati’’nti. ‘‘Yathā kathaṃ pana tvaṃ, bhikkhu, bhāvesi maraṇassati’’nti? ‘‘Idha mayhaṃ, bhante , evaṃ hoti – ‘aho vatāhaṃ rattindivaṃ jīveyyaṃ, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’ti. Evaṃ kho ahaṃ, bhante, bhāvemi maraṇassati’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Aññataropi kho bhikkhu bhagavantaṃ etadavoca – ‘‘ahampi kho, bhante, bhāvemi maraṇassati’’nti. ‘‘Yathā kathaṃ pana tvaṃ, bhikkhu, bhāvesi maraṇassati’’nti? ‘‘Idha mayhaṃ, bhante, evaṃ hoti – ‘aho vatāhaṃ divasaṃ jīveyyaṃ, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’ti. Evaṃ kho ahaṃ, bhante, bhāvemi maraṇassati’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aññataropi kho bhikkhu bhagavantaṃ etadavoca – ‘‘ahampi kho, bhante, bhāvemi maraṇassati’’nti. ‘‘Yathā kathaṃ pana tvaṃ, bhikkhu, bhāvesi maraṇassati’’nti ",
      "? ‘‘Idha mayhaṃ, bhante, evaṃ hoti – ‘aho vatāhaṃ tadantaraṃ jīveyyaṃ yadantaraṃ ekapiṇḍapātaṃ bhuñjāmi, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’ti. Evaṃ kho ahaṃ, bhante, bhāvemi maraṇassati’’nti."
    ],
    "innerText": "Aññataropi kho bhikkhu bhagavantaṃ etadavoca – ‘‘ahampi kho, bhante, bhāvemi maraṇassati’’nti. ‘‘Yathā kathaṃ pana tvaṃ, bhikkhu, bhāvesi maraṇassati’’nti ? ‘‘Idha mayhaṃ, bhante, evaṃ hoti – ‘aho vatāhaṃ tadantaraṃ jīveyyaṃ yadantaraṃ ekapiṇḍapātaṃ bhuñjāmi, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’ti. Evaṃ kho ahaṃ, bhante, bhāvemi maraṇassati’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aññataropi kho bhikkhu bhagavantaṃ etadavoca – ‘‘ahampi kho, bhante, bhāvemi maraṇassati’’nti. ‘‘Yathā kathaṃ pana tvaṃ, bhikkhu, bhāvesi maraṇassati’’nti? ‘‘Idha mayhaṃ, bhante, evaṃ hoti – ‘aho vatāhaṃ tadantaraṃ jīveyyaṃ yadantaraṃ cattāro pañca ālope saṅkhāditvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[saṅkharitvā (ka.)]"
      },
      " ajjhoharāmi, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata ",
      " me kataṃ assā’ti. Evaṃ kho ahaṃ, bhante, bhāvemi maraṇassati’’nti."
    ],
    "innerText": "Aññataropi kho bhikkhu bhagavantaṃ etadavoca – ‘‘ahampi kho, bhante, bhāvemi maraṇassati’’nti. ‘‘Yathā kathaṃ pana tvaṃ, bhikkhu, bhāvesi maraṇassati’’nti? ‘‘Idha mayhaṃ, bhante, evaṃ hoti – ‘aho vatāhaṃ tadantaraṃ jīveyyaṃ yadantaraṃ cattāro pañca ālope saṅkhāditvā [saṅkharitvā (ka.)] ajjhoharāmi, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’ti. Evaṃ kho ahaṃ, bhante, bhāvemi maraṇassati’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aññataropi kho bhikkhu bhagavantaṃ etadavoca – ‘‘ahampi ",
      " kho, bhante, bhāvemi maraṇassati’’nti. ‘‘Yathā kathaṃ pana tvaṃ, bhikkhu, bhāvesi maraṇassati’’nti? ‘‘Idha mayhaṃ, bhante, evaṃ hoti – ‘aho vatāhaṃ tadantaraṃ jīveyyaṃ yadantaraṃ ekaṃ ālopaṃ saṅkhāditvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[saṃharitvā (ka.)]"
      },
      " ajjhoharāmi, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’ti. Evaṃ kho ahaṃ, bhante, bhāvemi maraṇassati’’nti."
    ],
    "innerText": "Aññataropi kho bhikkhu bhagavantaṃ etadavoca – ‘‘ahampi kho, bhante, bhāvemi maraṇassati’’nti. ‘‘Yathā kathaṃ pana tvaṃ, bhikkhu, bhāvesi maraṇassati’’nti? ‘‘Idha mayhaṃ, bhante, evaṃ hoti – ‘aho vatāhaṃ tadantaraṃ jīveyyaṃ yadantaraṃ ekaṃ ālopaṃ saṅkhāditvā [saṃharitvā (ka.)] ajjhoharāmi, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’ti. Evaṃ kho ahaṃ, bhante, bhāvemi maraṇassati’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aññataropi kho bhikkhu bhagavantaṃ etadavoca – ‘‘ahampi kho, bhante, bhāvemi maraṇassati’’nti. ‘‘Yathā kathaṃ pana tvaṃ, bhikkhu, bhāvesi maraṇassati’’nti? ‘‘Idha mayhaṃ, bhante ",
      ", evaṃ hoti – ‘aho vatāhaṃ tadantaraṃ jīveyyaṃ yadantaraṃ assasitvā vā passasāmi passasitvā vā assasāmi, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’ti. Evaṃ kho ahaṃ, bhante, bhāvemi maraṇassati’’nti."
    ],
    "innerText": "Aññataropi kho bhikkhu bhagavantaṃ etadavoca – ‘‘ahampi kho, bhante, bhāvemi maraṇassati’’nti. ‘‘Yathā kathaṃ pana tvaṃ, bhikkhu, bhāvesi maraṇassati’’nti? ‘‘Idha mayhaṃ, bhante , evaṃ hoti – ‘aho vatāhaṃ tadantaraṃ jīveyyaṃ yadantaraṃ assasitvā vā passasāmi passasitvā vā assasāmi, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’ti. Evaṃ kho ahaṃ, bhante, bhāvemi maraṇassati’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ vutte bhagavā te bhikkhū etadavoca – ‘‘yo cāyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yvāyaṃ (pī. ka.)]"
      },
      ", bhikkhave, bhikkhu evaṃ maraṇassatiṃ bhāveti – ‘aho vatāhaṃ rattindivaṃ jīveyyaṃ, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’’’ti."
    ],
    "innerText": "Evaṃ vutte bhagavā te bhikkhū etadavoca – ‘‘yo cāyaṃ [yvāyaṃ (pī. ka.)], bhikkhave, bhikkhu evaṃ maraṇassatiṃ bhāveti – ‘aho vatāhaṃ rattindivaṃ jīveyyaṃ, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yo cāyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yopāyaṃ (ka.)]"
      },
      ", bhikkhave, bhikkhu evaṃ maraṇassatiṃ bhāveti – ‘aho vatāhaṃ divasaṃ jīveyyaṃ, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’’’ti."
    ],
    "innerText": "‘‘Yo cāyaṃ [yopāyaṃ (ka.)], bhikkhave, bhikkhu evaṃ maraṇassatiṃ bhāveti – ‘aho vatāhaṃ divasaṃ jīveyyaṃ, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yo ",
      " cāyaṃ, bhikkhave, bhikkhu evaṃ maraṇassatiṃ bhāveti – ‘aho vatāhaṃ tadantaraṃ jīveyyaṃ yadantaraṃ ekapiṇḍapātaṃ bhuñjāmi, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’’’ti."
    ],
    "innerText": "‘‘Yo cāyaṃ, bhikkhave, bhikkhu evaṃ maraṇassatiṃ bhāveti – ‘aho vatāhaṃ tadantaraṃ jīveyyaṃ yadantaraṃ ekapiṇḍapātaṃ bhuñjāmi, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yo cāyaṃ, bhikkhave, bhikkhu evaṃ maraṇassatiṃ bhāveti – ‘aho vatāhaṃ tadantaraṃ jīveyyaṃ yadantaraṃ cattāro pañca ālope saṅkhāditvā ajjhoharāmi, bhagavato sāsanaṃ manasi kareyyaṃ ",
      ", bahu vata me kataṃ assā’ti. Ime ",
      " vuccanti, bhikkhave, bhikkhū pamattā viharanti dandhaṃ maraṇassatiṃ bhāventi āsavānaṃ khayāya."
    ],
    "innerText": "‘‘Yo cāyaṃ, bhikkhave, bhikkhu evaṃ maraṇassatiṃ bhāveti – ‘aho vatāhaṃ tadantaraṃ jīveyyaṃ yadantaraṃ cattāro pañca ālope saṅkhāditvā ajjhoharāmi, bhagavato sāsanaṃ manasi kareyyaṃ , bahu vata me kataṃ assā’ti. Ime vuccanti, bhikkhave, bhikkhū pamattā viharanti dandhaṃ maraṇassatiṃ bhāventi āsavānaṃ khayāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yo ca khvāyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yopāyaṃ (ka.)]"
      },
      ", bhikkhave, bhikkhu evaṃ maraṇassatiṃ bhāveti – ‘aho vatāhaṃ tadantaraṃ jīveyyaṃ yadantaraṃ ekaṃ ālopaṃ saṅkhāditvā ajjhoharāmi, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’’’ti."
    ],
    "innerText": "‘‘Yo ca khvāyaṃ [yopāyaṃ (ka.)], bhikkhave, bhikkhu evaṃ maraṇassatiṃ bhāveti – ‘aho vatāhaṃ tadantaraṃ jīveyyaṃ yadantaraṃ ekaṃ ālopaṃ saṅkhāditvā ajjhoharāmi, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Yo cāyaṃ, bhikkhave, bhikkhu evaṃ maraṇassatiṃ bhāveti – ‘aho vatāhaṃ tadantaraṃ jīveyyaṃ yadantaraṃ assasitvā vā passasāmi passasitvā vā assasāmi, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’ti. Ime vuccanti, bhikkhave, bhikkhū appamattā viharanti tikkhaṃ maraṇassatiṃ bhāventi āsavānaṃ khayāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tasmātiha ",
      ", bhikkhave, evaṃ sikkhitabbaṃ – ‘appamattā viharissāma, tikkhaṃ maraṇassatiṃ bhāvessāma āsavānaṃ khayāyā’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Navamaṃ."
    ],
    "innerText": "‘‘Tasmātiha , bhikkhave, evaṃ sikkhitabbaṃ – ‘appamattā viharissāma, tikkhaṃ maraṇassatiṃ bhāvessāma āsavānaṃ khayāyā’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Dutiyamaraṇassatisuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "20"
      },
      ". Ekaṃ samayaṃ bhagavā nātike viharati giñjakāvasathe. Tatra kho bhagavā bhikkhū āmantesi – ‘‘maraṇassati, bhikkhave, bhāvitā bahulīkatā mahapphalā hoti mahānisaṃsā amatogadhā amatapariyosānā. Kathaṃ bhāvitā ca, bhikkhave, maraṇassati kathaṃ bahulīkatā mahapphalā hoti mahānisaṃsā amatogadhā amatapariyosānā?"
    ],
    "innerText": "20. Ekaṃ samayaṃ bhagavā nātike viharati giñjakāvasathe. Tatra kho bhagavā bhikkhū āmantesi – ‘‘maraṇassati, bhikkhave, bhāvitā bahulīkatā mahapphalā hoti mahānisaṃsā amatogadhā amatapariyosānā. Kathaṃ bhāvitā ca, bhikkhave, maraṇassati kathaṃ bahulīkatā mahapphalā hoti mahānisaṃsā amatogadhā amatapariyosānā?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idha, bhikkhave, bhikkhu divase nikkhante rattiyā patihitāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[paṭigatāya (ka.) a. ni. 8.74]"
      },
      " iti paṭisañcikkhati – ‘bahukā kho me paccayā maraṇassa – ahi vā maṃ ḍaṃseyya, vicchiko vā maṃ ḍaṃseyya, satapadī vā maṃ ḍaṃseyya; tena me assa kālakiriyā ",
      ", so mamassa antarāyo. Upakkhalitvā ",
      " vā papateyyaṃ, bhattaṃ vā me bhuttaṃ byāpajjeyya, pittaṃ vā me kuppeyya ",
      ", semhaṃ vā me kuppeyya, satthakā vā me vātā kuppeyyuṃ; tena me assa kālakiriyā, so mamassa antarāyo’ti. Tena, bhikkhave, bhikkhunā iti paṭisañcikkhitabbaṃ – ‘atthi nu kho me pāpakā akusalā dhammā appahīnā, ye me assu rattiṃ kālaṃ karontassa antarāyāyā’’’ti."
    ],
    "innerText": "‘‘Idha, bhikkhave, bhikkhu divase nikkhante rattiyā patihitāya [paṭigatāya (ka.) a. ni. 8.74] iti paṭisañcikkhati – ‘bahukā kho me paccayā maraṇassa – ahi vā maṃ ḍaṃseyya, vicchiko vā maṃ ḍaṃseyya, satapadī vā maṃ ḍaṃseyya; tena me assa kālakiriyā , so mamassa antarāyo. Upakkhalitvā vā papateyyaṃ, bhattaṃ vā me bhuttaṃ byāpajjeyya, pittaṃ vā me kuppeyya , semhaṃ vā me kuppeyya, satthakā vā me vātā kuppeyyuṃ; tena me assa kālakiriyā, so mamassa antarāyo’ti. Tena, bhikkhave, bhikkhunā iti paṭisañcikkhitabbaṃ – ‘atthi nu kho me pāpakā akusalā dhammā appahīnā, ye me assu rattiṃ kālaṃ karontassa antarāyāyā’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sace, bhikkhave, bhikkhu paccavekkhamāno evaṃ jānāti – ‘atthi me pāpakā akusalā dhammā appahīnā, ye me assu rattiṃ kālaṃ karontassa antarāyāyā’ti, tena, bhikkhave, bhikkhunā tesaṃyeva pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya adhimatto chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca karaṇīyaṃ. Seyyathāpi, bhikkhave, ādittacelo vā ādittasīso vā tasseva celassa vā sīsassa vā nibbāpanāya adhimattaṃ chandañca vāyāmañca ussāhañca ussoḷhiñca appaṭivāniñca satiñca sampajaññañca kareyya; evamevaṃ kho, bhikkhave, tena bhikkhunā tesaṃyeva pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya adhimatto chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca karaṇīyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace ",
      " pana, bhikkhave, bhikkhu paccavekkhamāno evaṃ jānāti – ‘natthi me pāpakā akusalā dhammā appahīnā, ye me assu rattiṃ kālaṃ karontassa antarāyāyā’ti, tena, bhikkhave, bhikkhunā teneva pītipāmojjena vihātabbaṃ ahorattānusikkhinā kusalesu dhammesu."
    ],
    "innerText": "‘‘Sace pana, bhikkhave, bhikkhu paccavekkhamāno evaṃ jānāti – ‘natthi me pāpakā akusalā dhammā appahīnā, ye me assu rattiṃ kālaṃ karontassa antarāyāyā’ti, tena, bhikkhave, bhikkhunā teneva pītipāmojjena vihātabbaṃ ahorattānusikkhinā kusalesu dhammesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idha ",
      " pana, bhikkhave, bhikkhu rattiyā nikkhantāya divase patihite iti paṭisañcikkhati – ‘bahukā kho me paccayā maraṇassa – ahi vā maṃ ḍaṃseyya, vicchiko vā maṃ ḍaṃseyya, satapadī vā maṃ ḍaṃseyya; tena me assa kālakiriyā so mamassa antarāyo. Upakkhalitvā vā papateyyaṃ, bhattaṃ vā me bhuttaṃ byāpajjeyya, pittaṃ vā me kuppeyya, semhaṃ vā me kuppeyya, satthakā vā me vātā kuppeyyuṃ; tena me assa kālakiriyā so mamassa antarāyo’ti. Tena, bhikkhave, bhikkhunā iti paṭisañcikkhitabbaṃ ",
      " – ‘atthi nu kho me pāpakā akusalā dhammā appahīnā, ye me assu divā kālaṃ karontassa antarāyāyā’’’ti."
    ],
    "innerText": "‘‘Idha pana, bhikkhave, bhikkhu rattiyā nikkhantāya divase patihite iti paṭisañcikkhati – ‘bahukā kho me paccayā maraṇassa – ahi vā maṃ ḍaṃseyya, vicchiko vā maṃ ḍaṃseyya, satapadī vā maṃ ḍaṃseyya; tena me assa kālakiriyā so mamassa antarāyo. Upakkhalitvā vā papateyyaṃ, bhattaṃ vā me bhuttaṃ byāpajjeyya, pittaṃ vā me kuppeyya, semhaṃ vā me kuppeyya, satthakā vā me vātā kuppeyyuṃ; tena me assa kālakiriyā so mamassa antarāyo’ti. Tena, bhikkhave, bhikkhunā iti paṭisañcikkhitabbaṃ – ‘atthi nu kho me pāpakā akusalā dhammā appahīnā, ye me assu divā kālaṃ karontassa antarāyāyā’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace ",
      ", bhikkhave, bhikkhu paccavekkhamāno evaṃ jānāti – ‘atthi me pāpakā akusalā dhammā appahīnā, ye me assu divā kālaṃ karontassa antarāyāyā’ti, tena, bhikkhave, bhikkhunā tesaṃyeva pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya adhimatto chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca karaṇīyaṃ. Seyyathāpi, bhikkhave, ādittacelo vā ādittasīso vā tasseva celassa vā sīsassa vā nibbāpanāya adhimattaṃ chandañca vāyāmañca ussāhañca ussoḷhiñca appaṭivāniñca satiñca sampajaññañca kareyya; evamevaṃ kho, bhikkhave, tena bhikkhunā tesaṃyeva pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya adhimatto chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ",
      " ca sati ca sampajaññañca karaṇīyaṃ."
    ],
    "innerText": "‘‘Sace , bhikkhave, bhikkhu paccavekkhamāno evaṃ jānāti – ‘atthi me pāpakā akusalā dhammā appahīnā, ye me assu divā kālaṃ karontassa antarāyāyā’ti, tena, bhikkhave, bhikkhunā tesaṃyeva pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya adhimatto chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca karaṇīyaṃ. Seyyathāpi, bhikkhave, ādittacelo vā ādittasīso vā tasseva celassa vā sīsassa vā nibbāpanāya adhimattaṃ chandañca vāyāmañca ussāhañca ussoḷhiñca appaṭivāniñca satiñca sampajaññañca kareyya; evamevaṃ kho, bhikkhave, tena bhikkhunā tesaṃyeva pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya adhimatto chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca karaṇīyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sace pana, bhikkhave, bhikkhu paccavekkhamāno evaṃ jānāti – ‘natthi me pāpakā akusalā dhammā appahīnā, ye me assu divā kālaṃ karontassa antarāyāyā’ti, tena, bhikkhave, bhikkhunā teneva pītipāmojjena vihātabbaṃ ahorattānusikkhinā kusalesu dhammesu. Evaṃ bhāvitā kho, bhikkhave, maraṇassati evaṃ bahulīkatā mahapphalā hoti mahānisaṃsā amatogadhā amatapariyosānā’’ti. Dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sāraṇīyavaggo dutiyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tassuddānaṃ ",
      " –"
    ],
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Dve sāraṇī nisāraṇīyaṃ, bhaddakaṃ anutappiyaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nakulaṃ soppamacchā ca, dve honti maraṇassatīti."
  }
]