[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Namo tassa bhagavato arahato sammāsambuddhassa"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "nikaya"
    },
    "innerText": "Aṅguttaranikāyo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "book"
    },
    "innerText": "Aṭṭhakanipātapāḷi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Paṭhamapaṇṇāsakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "1. Mettāvaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Mettāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      ". Evaṃ ",
      " me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –"
    ],
    "innerText": "1. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[a. ni. 11.15]"
      },
      " ‘‘Mettāya, bhikkhave, cetovimuttiyā āsevitāya bhāvitāya bahulīkatāya yānīkatāya vatthukatāya ",
      " anuṭṭhitāya paricitāya susamāraddhāya aṭṭhānisaṃsā pāṭikaṅkhā. Katame aṭṭha? Sukhaṃ supati, sukhaṃ paṭibujjhati, na pāpakaṃ supinaṃ passati, manussānaṃ piyo hoti, amanussānaṃ piyo hoti, devatā rakkhanti, nāssa aggi vā visaṃ vā satthaṃ vā kamati, uttariṃ appaṭivijjhanto brahmalokūpago hoti. Mettāya, bhikkhave, cetovimuttiyā āsevitāya bhāvitāya bahulīkatāya yānīkatāya vatthukatāya anuṭṭhitāya paricitāya susamāraddhāya ime aṭṭhānisaṃsā pāṭikaṅkhā’’ti."
    ],
    "innerText": "[a. ni. 11.15] ‘‘Mettāya, bhikkhave, cetovimuttiyā āsevitāya bhāvitāya bahulīkatāya yānīkatāya vatthukatāya anuṭṭhitāya paricitāya susamāraddhāya aṭṭhānisaṃsā pāṭikaṅkhā. Katame aṭṭha? Sukhaṃ supati, sukhaṃ paṭibujjhati, na pāpakaṃ supinaṃ passati, manussānaṃ piyo hoti, amanussānaṃ piyo hoti, devatā rakkhanti, nāssa aggi vā visaṃ vā satthaṃ vā kamati, uttariṃ appaṭivijjhanto brahmalokūpago hoti. Mettāya, bhikkhave, cetovimuttiyā āsevitāya bhāvitāya bahulīkatāya yānīkatāya vatthukatāya anuṭṭhitāya paricitāya susamāraddhāya ime aṭṭhānisaṃsā pāṭikaṅkhā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Yo ",
      " ca mettaṃ bhāvayati, appamāṇaṃ paṭissato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[patissato (sī.)]"
      },
      ";"
    ],
    "innerText": "‘‘Yo ca mettaṃ bhāvayati, appamāṇaṃ paṭissato [patissato (sī.)];"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tanū saṃyojanā honti, passato upadhikkhayaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Ekampi ",
      " ce pāṇamaduṭṭhacitto,"
    ],
    "innerText": "‘‘Ekampi ce pāṇamaduṭṭhacitto,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Mettāyati kusalī tena hoti;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Sabbe ca pāṇe manasānukampī,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pahūtamariyo pakaroti puññaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ye sattasaṇḍaṃ pathaviṃ vijetvā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Rājisayo yajamānā anupariyagā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Assamedhaṃ purisamedhaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sammāpāsaṃ vājapeyyaṃ niraggaḷaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Mettassa cittassa subhāvitassa,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Kalampi te nānubhavanti soḷasiṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Candappabhā tāragaṇāva sabbe,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Yathā na agghanti kalampi soḷasiṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ayaṃ pādo bahūsu na dissati]"
      },
      "."
    ],
    "innerText": "Yathā na agghanti kalampi soḷasiṃ [ayaṃ pādo bahūsu na dissati]."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yo na hanti na ghāteti, na jināti na jāpaye;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Mettaṃso sabbabhūtānaṃ, veraṃ tassa na kenacī’’ti. paṭhamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Paññāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "2"
      },
      ". ‘‘Aṭṭhime ",
      ", bhikkhave, hetū aṭṭha paccayā ādibrahmacariyikāya paññāya appaṭiladdhāya paṭilābhāya, paṭiladdhāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā saṃvattanti. Katame aṭṭha? Idha, bhikkhave, bhikkhu satthāraṃ upanissāya viharati aññataraṃ vā garuṭṭhāniyaṃ sabrahmacāriṃ, yatthassa tibbaṃ hirottappaṃ paccupaṭṭhitaṃ hoti pemañca gāravo ca. Ayaṃ ",
      ", bhikkhave, paṭhamo hetu paṭhamo paccayo ādibrahmacariyikāya paññāya appaṭiladdhāya paṭilābhāya, paṭiladdhāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā saṃvattati."
    ],
    "innerText": "2. ‘‘Aṭṭhime , bhikkhave, hetū aṭṭha paccayā ādibrahmacariyikāya paññāya appaṭiladdhāya paṭilābhāya, paṭiladdhāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā saṃvattanti. Katame aṭṭha? Idha, bhikkhave, bhikkhu satthāraṃ upanissāya viharati aññataraṃ vā garuṭṭhāniyaṃ sabrahmacāriṃ, yatthassa tibbaṃ hirottappaṃ paccupaṭṭhitaṃ hoti pemañca gāravo ca. Ayaṃ , bhikkhave, paṭhamo hetu paṭhamo paccayo ādibrahmacariyikāya paññāya appaṭiladdhāya paṭilābhāya, paṭiladdhāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā saṃvattati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘So ",
      " taṃ satthāraṃ upanissāya viharanto aññataraṃ vā garuṭṭhāniyaṃ sabrahmacāriṃ, yatthassa tibbaṃ hirottappaṃ paccupaṭṭhitaṃ hoti pemaṃ gāravo ",
      " ca, te kālena kālaṃ upasaṅkamitvā paripucchati paripañhati – ‘idaṃ, bhante, kathaṃ; imassa ko attho’ti? Tassa te āyasmanto avivaṭañceva vivaranti, anuttānīkatañca uttānī karonti, anekavihitesu ca kaṅkhāṭhāniyesu dhammesu kaṅkhaṃ paṭivinodenti. Ayaṃ, bhikkhave, dutiyo hetu dutiyo paccayo ādibrahmacariyikāya paññāya appaṭiladdhāya paṭilābhāya, paṭiladdhāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā saṃvattati."
    ],
    "innerText": "‘‘So taṃ satthāraṃ upanissāya viharanto aññataraṃ vā garuṭṭhāniyaṃ sabrahmacāriṃ, yatthassa tibbaṃ hirottappaṃ paccupaṭṭhitaṃ hoti pemaṃ gāravo ca, te kālena kālaṃ upasaṅkamitvā paripucchati paripañhati – ‘idaṃ, bhante, kathaṃ; imassa ko attho’ti? Tassa te āyasmanto avivaṭañceva vivaranti, anuttānīkatañca uttānī karonti, anekavihitesu ca kaṅkhāṭhāniyesu dhammesu kaṅkhaṃ paṭivinodenti. Ayaṃ, bhikkhave, dutiyo hetu dutiyo paccayo ādibrahmacariyikāya paññāya appaṭiladdhāya paṭilābhāya, paṭiladdhāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā saṃvattati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘So taṃ dhammaṃ sutvā dvayena vūpakāsena sampādeti – kāyavūpakāsena ca cittavūpakāsena ca. Ayaṃ, bhikkhave, tatiyo hetu tatiyo paccayo ādibrahmacariyikāya paññāya appaṭiladdhāya paṭilābhāya, paṭiladdhāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā saṃvattati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sīlavā hoti, pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu. Ayaṃ, bhikkhave, catuttho hetu catuttho paccayo ādibrahmacariyikāya paññāya appaṭiladdhāya paṭilābhāya, paṭiladdhāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā saṃvattati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Bahussuto hoti sutadharo sutasannicayo. Ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā ",
      " sātthaṃ sabyañjanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[satthā sabyañjanā (ka. sī.)]"
      },
      " kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpāssa dhammā bahussutā honti dhātā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[dhatā (sī. syā. kaṃ. pī.)]"
      },
      " vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā. Ayaṃ, bhikkhave, pañcamo hetu pañcamo paccayo ādibrahmacariyikāya paññāya appaṭiladdhāya paṭilābhāya, paṭiladdhāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā saṃvattati."
    ],
    "innerText": "‘‘Bahussuto hoti sutadharo sutasannicayo. Ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṃ sabyañjanaṃ [satthā sabyañjanā (ka. sī.)] kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpāssa dhammā bahussutā honti dhātā [dhatā (sī. syā. kaṃ. pī.)] vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā. Ayaṃ, bhikkhave, pañcamo hetu pañcamo paccayo ādibrahmacariyikāya paññāya appaṭiladdhāya paṭilābhāya, paṭiladdhāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā saṃvattati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Āraddhavīriyo ",
      " viharati akusalānaṃ dhammānaṃ pahānāya, kusalānaṃ dhammānaṃ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. Ayaṃ, bhikkhave, chaṭṭho hetu chaṭṭho paccayo ādibrahmacariyikāya paññāya appaṭiladdhāya paṭilābhāya, paṭiladdhāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā saṃvattati."
    ],
    "innerText": "‘‘Āraddhavīriyo viharati akusalānaṃ dhammānaṃ pahānāya, kusalānaṃ dhammānaṃ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. Ayaṃ, bhikkhave, chaṭṭho hetu chaṭṭho paccayo ādibrahmacariyikāya paññāya appaṭiladdhāya paṭilābhāya, paṭiladdhāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā saṃvattati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Saṅghagato ",
      " kho pana anānākathiko hoti atiracchānakathiko. Sāmaṃ vā dhammaṃ bhāsati paraṃ vā ajjhesati ariyaṃ vā tuṇhībhāvaṃ nātimaññati. Ayaṃ, bhikkhave, sattamo hetu sattamo paccayo ādibrahmacariyikāya paññāya appaṭiladdhāya paṭilābhāya, paṭiladdhāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā saṃvattati."
    ],
    "innerText": "‘‘Saṅghagato kho pana anānākathiko hoti atiracchānakathiko. Sāmaṃ vā dhammaṃ bhāsati paraṃ vā ajjhesati ariyaṃ vā tuṇhībhāvaṃ nātimaññati. Ayaṃ, bhikkhave, sattamo hetu sattamo paccayo ādibrahmacariyikāya paññāya appaṭiladdhāya paṭilābhāya, paṭiladdhāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā saṃvattati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Pañcasu kho pana upādānakkhandhesu udayabbayānupassī viharati – ‘iti rūpaṃ, iti rūpassa samudayo, iti rūpassa atthaṅgamo; iti vedanā, iti vedanāya samudayo, iti vedanāya atthaṅgamo; iti saññā…pe… iti saṅkhārā…pe… iti viññāṇaṃ, iti viññāṇassa samudayo, iti viññāṇassa atthaṅgamo’ti. Ayaṃ, bhikkhave, aṭṭhamo hetu aṭṭhamo paccayo ādibrahmacariyikāya paññāya appaṭiladdhāya paṭilābhāya, paṭiladdhāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā saṃvattati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tamenaṃ ",
      " sabrahmacārī evaṃ sambhāventi – ‘ayaṃ kho āyasmā satthāraṃ upanissāya viharati aññataraṃ vā garuṭṭhāniyaṃ sabrahmacāriṃ, yatthassa tibbaṃ hirottappaṃ paccupaṭṭhitaṃ hoti pemañca gāravo ca. Addhā ayamāyasmā jānaṃ jānāti passaṃ passatī’ti! Ayampi dhammo piyattāya garuttāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[piyatāya garutāya (syā.)]"
      },
      " bhāvanāya sāmaññāya ekībhāvāya saṃvattati."
    ],
    "innerText": "‘‘Tamenaṃ sabrahmacārī evaṃ sambhāventi – ‘ayaṃ kho āyasmā satthāraṃ upanissāya viharati aññataraṃ vā garuṭṭhāniyaṃ sabrahmacāriṃ, yatthassa tibbaṃ hirottappaṃ paccupaṭṭhitaṃ hoti pemañca gāravo ca. Addhā ayamāyasmā jānaṃ jānāti passaṃ passatī’ti! Ayampi dhammo piyattāya garuttāya [piyatāya garutāya (syā.)] bhāvanāya sāmaññāya ekībhāvāya saṃvattati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Taṃ ",
      " kho panāyamāyasmā satthāraṃ upanissāya viharanto aññataraṃ vā garuṭṭhāniyaṃ sabrahmacāriṃ, yatthassa tibbaṃ hirottappaṃ paccupaṭṭhitaṃ hoti pemañca ",
      " gāravo ca, te kālena kālaṃ upasaṅkamitvā paripucchati paripañhati – idaṃ, bhante, kathaṃ; imassa ko atthoti? Tassa te āyasmanto avivaṭañceva vivaranti, anuttānīkatañca uttānī karonti, anekavihitesu ca kaṅkhāṭhāniyesu dhammesu kaṅkhaṃ paṭivinodenti. Addhā ayamāyasmā jānaṃ jānāti passaṃ passatī’ti! Ayampi dhammo piyattāya garuttāya bhāvanāya sāmaññāya ekībhāvāya saṃvattati."
    ],
    "innerText": "‘‘‘Taṃ kho panāyamāyasmā satthāraṃ upanissāya viharanto aññataraṃ vā garuṭṭhāniyaṃ sabrahmacāriṃ, yatthassa tibbaṃ hirottappaṃ paccupaṭṭhitaṃ hoti pemañca gāravo ca, te kālena kālaṃ upasaṅkamitvā paripucchati paripañhati – idaṃ, bhante, kathaṃ; imassa ko atthoti? Tassa te āyasmanto avivaṭañceva vivaranti, anuttānīkatañca uttānī karonti, anekavihitesu ca kaṅkhāṭhāniyesu dhammesu kaṅkhaṃ paṭivinodenti. Addhā ayamāyasmā jānaṃ jānāti passaṃ passatī’ti! Ayampi dhammo piyattāya garuttāya bhāvanāya sāmaññāya ekībhāvāya saṃvattati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘‘Taṃ kho panāyamāyasmā dhammaṃ sutvā dvayena vūpakāsena sampādeti – kāyavūpakāsena ca cittavūpakāsena ca. Addhā ayamāyasmā jānaṃ jānāti passaṃ passatī’ti! Ayampi dhammo piyattāya garuttāya bhāvanāya sāmaññāya ekībhāvāya saṃvattati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Sīlavā ",
      " kho panāyamāyasmā pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu. Addhā ayamāyasmā jānaṃ jānāti passaṃ passatī’ti! Ayampi dhammo piyattāya garuttāya bhāvanāya sāmaññāya ekībhāvāya saṃvattati."
    ],
    "innerText": "‘‘‘Sīlavā kho panāyamāyasmā pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu. Addhā ayamāyasmā jānaṃ jānāti passaṃ passatī’ti! Ayampi dhammo piyattāya garuttāya bhāvanāya sāmaññāya ekībhāvāya saṃvattati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Bahussuto kho panāyamāyasmā ",
      " sutadharo sutasannicayo. Ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpāssa dhammā bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā. Addhā ayamāyasmā jānaṃ jānāti passaṃ passatī’ti! Ayampi dhammo piyattāya garuttāya bhāvanāya sāmaññāya ekībhāvāya saṃvattati."
    ],
    "innerText": "‘‘‘Bahussuto kho panāyamāyasmā sutadharo sutasannicayo. Ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpāssa dhammā bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā. Addhā ayamāyasmā jānaṃ jānāti passaṃ passatī’ti! Ayampi dhammo piyattāya garuttāya bhāvanāya sāmaññāya ekībhāvāya saṃvattati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘‘Āraddhavīriyo kho panāyamāyasmā viharati akusalānaṃ dhammānaṃ pahānāya, kusalānaṃ dhammānaṃ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. Addhā ayamāyasmā jānaṃ jānāti passaṃ passatī’ti! Ayampi dhammo piyattāya garuttāya bhāvanāya sāmaññāya ekībhāvāya saṃvattati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘‘Saṅghagato ",
      " kho panāyamāyasmā anānākathiko hoti atiracchānakathiko. Sāmaṃ vā dhammaṃ ",
      " bhāsati paraṃ vā ajjhesati ariyaṃ vā tuṇhībhāvaṃ nātimaññati. Addhā ayamāyasmā jānaṃ jānāti passaṃ passatī’ti! Ayampi dhammo piyattāya garuttāya bhāvanāya sāmaññāya ekībhāvāya saṃvattati."
    ],
    "innerText": "‘‘‘Saṅghagato kho panāyamāyasmā anānākathiko hoti atiracchānakathiko. Sāmaṃ vā dhammaṃ bhāsati paraṃ vā ajjhesati ariyaṃ vā tuṇhībhāvaṃ nātimaññati. Addhā ayamāyasmā jānaṃ jānāti passaṃ passatī’ti! Ayampi dhammo piyattāya garuttāya bhāvanāya sāmaññāya ekībhāvāya saṃvattati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘‘Pañcasu kho panāyamāyasmā upādānakkhandhesu udayabbayānupassī viharati – iti rūpaṃ, iti rūpassa samudayo, iti rūpassa atthaṅgamo; iti vedanā…pe… iti saññā…pe… iti saṅkhārā…pe… iti viññāṇaṃ, iti viññāṇassa samudayo, iti viññāṇassa atthaṅgamoti. Addhā ayamāyasmā jānaṃ jānāti passaṃ passatī’ti! Ayampi dhammo piyattāya garuttāya bhāvanāya sāmaññāya ekībhāvāya saṃvattati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ime kho, bhikkhave, aṭṭha hetū aṭṭha paccayā ",
      " ādibrahmacariyikāya paññāya appaṭiladdhāya paṭilābhāya, paṭiladdhāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā saṃvattantī’’ti. Dutiyaṃ."
    ],
    "innerText": "‘‘Ime kho, bhikkhave, aṭṭha hetū aṭṭha paccayā ādibrahmacariyikāya paññāya appaṭiladdhāya paṭilābhāya, paṭiladdhāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā saṃvattantī’’ti. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Paṭhamaappiyasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "3"
      },
      ". ‘‘Aṭṭhahi ",
      ", bhikkhave, dhammehi samannāgato bhikkhu sabrahmacārīnaṃ appiyo ca hoti amanāpo ca agaru ca abhāvanīyo ca. Katamehi aṭṭhahi? Idha, bhikkhave, bhikkhu appiyapasaṃsī ca hoti, piyagarahī ca, lābhakāmo ca, sakkārakāmo ca, ahiriko ca, anottappī ca, pāpiccho ca, micchādiṭṭhi ca. Imehi kho, bhikkhave, aṭṭhahi dhammehi samannāgato bhikkhu sabrahmacārīnaṃ appiyo ca hoti amanāpo ca agaru ca abhāvanīyo ca."
    ],
    "innerText": "3. ‘‘Aṭṭhahi , bhikkhave, dhammehi samannāgato bhikkhu sabrahmacārīnaṃ appiyo ca hoti amanāpo ca agaru ca abhāvanīyo ca. Katamehi aṭṭhahi? Idha, bhikkhave, bhikkhu appiyapasaṃsī ca hoti, piyagarahī ca, lābhakāmo ca, sakkārakāmo ca, ahiriko ca, anottappī ca, pāpiccho ca, micchādiṭṭhi ca. Imehi kho, bhikkhave, aṭṭhahi dhammehi samannāgato bhikkhu sabrahmacārīnaṃ appiyo ca hoti amanāpo ca agaru ca abhāvanīyo ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aṭṭhahi, bhikkhave, dhammehi samannāgato bhikkhu sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo ca. Katamehi aṭṭhahi? Idha ",
      ", bhikkhave, bhikkhu na appiyapasaṃsī ca hoti, na piyagarahī ca, na lābhakāmo ca, na sakkārakāmo ca, hirīmā ca hoti, ottappī ca, appiccho ca, sammādiṭṭhi ca. Imehi kho, bhikkhave, aṭṭhahi dhammehi samannāgato ",
      " bhikkhu sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo cā’’ti. Tatiyaṃ."
    ],
    "innerText": "‘‘Aṭṭhahi, bhikkhave, dhammehi samannāgato bhikkhu sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo ca. Katamehi aṭṭhahi? Idha , bhikkhave, bhikkhu na appiyapasaṃsī ca hoti, na piyagarahī ca, na lābhakāmo ca, na sakkārakāmo ca, hirīmā ca hoti, ottappī ca, appiccho ca, sammādiṭṭhi ca. Imehi kho, bhikkhave, aṭṭhahi dhammehi samannāgato bhikkhu sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo cā’’ti. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Dutiyaappiyasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "4"
      },
      ". ‘‘Aṭṭhahi, bhikkhave, dhammehi samannāgato bhikkhu sabrahmacārīnaṃ appiyo ca hoti amanāpo ca agaru ca abhāvanīyo ca. Katamehi aṭṭhahi? Idha, bhikkhave, bhikkhu lābhakāmo ca hoti, sakkārakāmo ca, anavaññattikāmo ca, akālaññū ca, amattaññū ca, asuci ca, bahubhāṇī ca, akkosakaparibhāsako ca sabrahmacārīnaṃ. Imehi kho, bhikkhave, aṭṭhahi dhammehi samannāgato bhikkhu sabrahmacārīnaṃ appiyo ca hoti amanāpo ca",
      " agaru ca abhāvanīyo ca."
    ],
    "innerText": "4. ‘‘Aṭṭhahi, bhikkhave, dhammehi samannāgato bhikkhu sabrahmacārīnaṃ appiyo ca hoti amanāpo ca agaru ca abhāvanīyo ca. Katamehi aṭṭhahi? Idha, bhikkhave, bhikkhu lābhakāmo ca hoti, sakkārakāmo ca, anavaññattikāmo ca, akālaññū ca, amattaññū ca, asuci ca, bahubhāṇī ca, akkosakaparibhāsako ca sabrahmacārīnaṃ. Imehi kho, bhikkhave, aṭṭhahi dhammehi samannāgato bhikkhu sabrahmacārīnaṃ appiyo ca hoti amanāpo ca agaru ca abhāvanīyo ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Aṭṭhahi, bhikkhave, dhammehi samannāgato bhikkhu sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo ca. Katamehi aṭṭhahi? Idha, bhikkhave, bhikkhu na lābhakāmo ca hoti, na sakkārakāmo ca, na anavaññattikāmo ca, kālaññū ca, mattaññū ca, suci ca, na bahubhāṇī ca, anakkosakaparibhāsako ca sabrahmacārīnaṃ. Imehi kho, bhikkhave, aṭṭhahi dhammehi samannāgato bhikkhu sabrahmacārīnaṃ piyo ca hoti manāpo ca garu ca bhāvanīyo cā’’ti. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Paṭhamalokadhammasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "5"
      },
      ". ‘‘Aṭṭhime ",
      ", bhikkhave, lokadhammā lokaṃ anuparivattanti, loko ca aṭṭha lokadhamme anuparivattati. Katame aṭṭha? Lābho ",
      " ca, alābho ca, yaso ca, ayaso ca, nindā ca, pasaṃsā ca, sukhañca, dukkhañca. Ime kho, bhikkhave, aṭṭha lokadhammā lokaṃ anuparivattanti, loko ca ime aṭṭha lokadhamme anuparivattatī’’ti."
    ],
    "innerText": "5. ‘‘Aṭṭhime , bhikkhave, lokadhammā lokaṃ anuparivattanti, loko ca aṭṭha lokadhamme anuparivattati. Katame aṭṭha? Lābho ca, alābho ca, yaso ca, ayaso ca, nindā ca, pasaṃsā ca, sukhañca, dukkhañca. Ime kho, bhikkhave, aṭṭha lokadhammā lokaṃ anuparivattanti, loko ca ime aṭṭha lokadhamme anuparivattatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Lābho alābho ca yasāyaso ca,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Nindā pasaṃsā ca sukhaṃ dukhañca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "children": [
      "Ete ",
      " aniccā manujesu dhammā,"
    ],
    "innerText": "Ete aniccā manujesu dhammā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Asassatā vipariṇāmadhammā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ete ca ñatvā satimā sumedho,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Avekkhati vipariṇāmadhamme;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Iṭṭhassa dhammā na mathenti cittaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Aniṭṭhato no paṭighātameti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Tassānurodhā ",
      " atha vā virodhā,"
    ],
    "innerText": "‘‘Tassānurodhā atha vā virodhā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Vidhūpitā atthaṅgatā na santi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Padañca ñatvā virajaṃ asokaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sammappajānāti bhavassa pāragū’’ti. pañcamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Dutiyalokadhammasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "6"
      },
      ". ‘‘Aṭṭhime, bhikkhave, lokadhammā lokaṃ anuparivattanti, loko ca aṭṭha lokadhamme anuparivattati. Katame aṭṭha? Lābho ca, alābho ca, yaso ca, ayaso ca, nindā ca, pasaṃsā ca, sukhañca, dukkhañca. Ime kho, bhikkhave, aṭṭha lokadhammā lokaṃ anuparivattanti, loko ca ime aṭṭha lokadhamme anuparivattati."
    ],
    "innerText": "6. ‘‘Aṭṭhime, bhikkhave, lokadhammā lokaṃ anuparivattanti, loko ca aṭṭha lokadhamme anuparivattati. Katame aṭṭha? Lābho ca, alābho ca, yaso ca, ayaso ca, nindā ca, pasaṃsā ca, sukhañca, dukkhañca. Ime kho, bhikkhave, aṭṭha lokadhammā lokaṃ anuparivattanti, loko ca ime aṭṭha lokadhamme anuparivattati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Assutavato, bhikkhave, puthujjanassa uppajjati lābhopi alābhopi yasopi ayasopi nindāpi pasaṃsāpi sukhampi dukkhampi. Sutavatopi, bhikkhave, ariyasāvakassa uppajjati lābhopi alābhopi yasopi ayasopi nindāpi pasaṃsāpi sukhampi dukkhampi. Tatra, bhikkhave, ko viseso ",
      " ko ",
      " adhippayāso ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[adhippāyo (sī.), adhippāyaso (syā. kaṃ.) adhi + pa + yasu + ṇa = adhippayāso]"
      },
      " kiṃ nānākaraṇaṃ sutavato ariyasāvakassa assutavatā puthujjanenā’’ti? ‘‘Bhagavaṃmūlakā no, bhante, dhammā bhagavaṃnettikā bhagavaṃpaṭisaraṇā. Sādhu vata, bhante, bhagavantaṃyeva paṭibhātu etassa bhāsitassa attho. Bhagavato sutvā bhikkhū dhāressantī’’ti."
    ],
    "innerText": "‘‘Assutavato, bhikkhave, puthujjanassa uppajjati lābhopi alābhopi yasopi ayasopi nindāpi pasaṃsāpi sukhampi dukkhampi. Sutavatopi, bhikkhave, ariyasāvakassa uppajjati lābhopi alābhopi yasopi ayasopi nindāpi pasaṃsāpi sukhampi dukkhampi. Tatra, bhikkhave, ko viseso ko adhippayāso [adhippāyo (sī.), adhippāyaso (syā. kaṃ.) adhi + pa + yasu + ṇa = adhippayāso] kiṃ nānākaraṇaṃ sutavato ariyasāvakassa assutavatā puthujjanenā’’ti? ‘‘Bhagavaṃmūlakā no, bhante, dhammā bhagavaṃnettikā bhagavaṃpaṭisaraṇā. Sādhu vata, bhante, bhagavantaṃyeva paṭibhātu etassa bhāsitassa attho. Bhagavato sutvā bhikkhū dhāressantī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tena ",
      " hi, bhikkhave, suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘assutavato, bhikkhave, puthujjanassa uppajjati lābho. So na iti paṭisañcikkhati – ‘uppanno kho me ayaṃ lābho; so ca kho anicco dukkho vipariṇāmadhammo’ti ",
      " yathābhūtaṃ nappajānāti. Uppajjati alābho…pe… uppajjati yaso… uppajjati ayaso… uppajjati nindā… uppajjati pasaṃsā… uppajjati sukhaṃ… uppajjati dukkhaṃ. So na iti paṭisañcikkhati – ‘uppannaṃ kho me idaṃ dukkhaṃ; tañca kho aniccaṃ dukkhaṃ vipariṇāmadhamma’nti yathābhūtaṃ nappajānāti’’."
    ],
    "innerText": "‘‘Tena hi, bhikkhave, suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘assutavato, bhikkhave, puthujjanassa uppajjati lābho. So na iti paṭisañcikkhati – ‘uppanno kho me ayaṃ lābho; so ca kho anicco dukkho vipariṇāmadhammo’ti yathābhūtaṃ nappajānāti. Uppajjati alābho…pe… uppajjati yaso… uppajjati ayaso… uppajjati nindā… uppajjati pasaṃsā… uppajjati sukhaṃ… uppajjati dukkhaṃ. So na iti paṭisañcikkhati – ‘uppannaṃ kho me idaṃ dukkhaṃ; tañca kho aniccaṃ dukkhaṃ vipariṇāmadhamma’nti yathābhūtaṃ nappajānāti’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tassa lābhopi cittaṃ pariyādāya tiṭṭhati, alābhopi cittaṃ pariyādāya tiṭṭhati, yasopi cittaṃ pariyādāya tiṭṭhati, ayasopi cittaṃ pariyādāya tiṭṭhati, nindāpi cittaṃ pariyādāya tiṭṭhati, pasaṃsāpi cittaṃ pariyādāya tiṭṭhati, sukhampi cittaṃ pariyādāya tiṭṭhati, dukkhampi cittaṃ pariyādāya tiṭṭhati. So uppannaṃ lābhaṃ anurujjhati, alābhe paṭivirujjhati; uppannaṃ yasaṃ anurujjhati, ayase paṭivirujjhati; uppannaṃ pasaṃsaṃ anurujjhati, nindāya paṭivirujjhati; uppannaṃ sukhaṃ anurujjhati, dukkhe paṭivirujjhati. So evaṃ anurodhavirodhasamāpanno na parimuccati jātiyā jarāya maraṇena sokehi paridevehi dukkhehi domanassehi upāyāsehi. ‘Na parimuccati dukkhasmā’ti vadāmi’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sutavato ca kho, bhikkhave, ariyasāvakassa uppajjati lābho. So iti paṭisañcikkhati – ‘uppanno kho me ayaṃ lābho; so ca kho anicco dukkho vipariṇāmadhammo’ti yathābhūtaṃ pajānāti. Uppajjati alābho…pe… uppajjati yaso… uppajjati ",
      " ayaso… uppajjati nindā… uppajjati pasaṃsā… uppajjati sukhaṃ… uppajjati dukkhaṃ. So iti paṭisañcikkhati – ‘uppannaṃ kho me idaṃ ",
      " dukkhaṃ; tañca kho aniccaṃ dukkhaṃ vipariṇāmadhamma’nti yathābhūtaṃ pajānāti’’."
    ],
    "innerText": "‘‘Sutavato ca kho, bhikkhave, ariyasāvakassa uppajjati lābho. So iti paṭisañcikkhati – ‘uppanno kho me ayaṃ lābho; so ca kho anicco dukkho vipariṇāmadhammo’ti yathābhūtaṃ pajānāti. Uppajjati alābho…pe… uppajjati yaso… uppajjati ayaso… uppajjati nindā… uppajjati pasaṃsā… uppajjati sukhaṃ… uppajjati dukkhaṃ. So iti paṭisañcikkhati – ‘uppannaṃ kho me idaṃ dukkhaṃ; tañca kho aniccaṃ dukkhaṃ vipariṇāmadhamma’nti yathābhūtaṃ pajānāti’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tassa ",
      " lābhopi cittaṃ na pariyādāya tiṭṭhati, alābhopi cittaṃ na pariyādāya tiṭṭhati, yasopi cittaṃ na pariyādāya tiṭṭhati, ayasopi cittaṃ na pariyādāya tiṭṭhati, nindāpi cittaṃ na pariyādāya tiṭṭhati, pasaṃsāpi cittaṃ na pariyādāya tiṭṭhati, sukhampi cittaṃ ",
      " na pariyādāya tiṭṭhati, dukkhampi cittaṃ na pariyādāya tiṭṭhati. So uppannaṃ lābhaṃ nānurujjhati, alābhe nappaṭivirujjhati; uppannaṃ yasaṃ nānurujjhati, ayase nappaṭivirujjhati; uppannaṃ pasaṃsaṃ nānurujjhati, nindāya nappaṭivirujjhati; uppannaṃ sukhaṃ nānurujjhati, dukkhe nappaṭivirujjhati. So evaṃ anurodhavirodhavippahīno parimuccati jātiyā jarāya maraṇena sokehi paridevehi dukkhehi domanassehi upāyāsehi. ‘Parimuccati dukkhasmā’ti vadāmi. Ayaṃ kho, bhikkhave, viseso ayaṃ adhippayāso idaṃ nānākaraṇaṃ sutavato ariyasāvakassa assutavatā puthujjanenā’’ti."
    ],
    "innerText": "‘‘Tassa lābhopi cittaṃ na pariyādāya tiṭṭhati, alābhopi cittaṃ na pariyādāya tiṭṭhati, yasopi cittaṃ na pariyādāya tiṭṭhati, ayasopi cittaṃ na pariyādāya tiṭṭhati, nindāpi cittaṃ na pariyādāya tiṭṭhati, pasaṃsāpi cittaṃ na pariyādāya tiṭṭhati, sukhampi cittaṃ na pariyādāya tiṭṭhati, dukkhampi cittaṃ na pariyādāya tiṭṭhati. So uppannaṃ lābhaṃ nānurujjhati, alābhe nappaṭivirujjhati; uppannaṃ yasaṃ nānurujjhati, ayase nappaṭivirujjhati; uppannaṃ pasaṃsaṃ nānurujjhati, nindāya nappaṭivirujjhati; uppannaṃ sukhaṃ nānurujjhati, dukkhe nappaṭivirujjhati. So evaṃ anurodhavirodhavippahīno parimuccati jātiyā jarāya maraṇena sokehi paridevehi dukkhehi domanassehi upāyāsehi. ‘Parimuccati dukkhasmā’ti vadāmi. Ayaṃ kho, bhikkhave, viseso ayaṃ adhippayāso idaṃ nānākaraṇaṃ sutavato ariyasāvakassa assutavatā puthujjanenā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Lābho alābho ca yasāyaso ca,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Nindā pasaṃsā ca sukhaṃ dukhañca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Ete aniccā manujesu dhammā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Asassatā vipariṇāmadhammā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ete ca ñatvā satimā sumedho,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Avekkhati vipariṇāmadhamme;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "children": [
      "Iṭṭhassa ",
      " dhammā na mathenti cittaṃ,"
    ],
    "innerText": "Iṭṭhassa dhammā na mathenti cittaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Aniṭṭhato no paṭighātameti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Tassānurodhā ",
      " atha vā virodhā,"
    ],
    "innerText": "‘‘Tassānurodhā atha vā virodhā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Vidhūpitā atthaṅgatā na santi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Padañca ñatvā virajaṃ asokaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sammappajānāti bhavassa pāragū’’ti. chaṭṭhaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Devadattavipattisuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "7"
      },
      ". Ekaṃ samayaṃ bhagavā rājagahe viharati gijjhakūṭe pabbate acirapakkante devadatte. Tatra bhagavā devadattaṃ ārabbha bhikkhū āmantesi – ‘‘sādhu, bhikkhave, bhikkhu kālena kālaṃ attavipattiṃ paccavekkhitā hoti. Sādhu, bhikkhave, bhikkhu kālena kālaṃ paravipattiṃ paccavekkhitā ",
      " hoti. Sādhu, bhikkhave, bhikkhu kālena kālaṃ attasampattiṃ paccavekkhitā hoti. Sādhu ",
      ", bhikkhave, bhikkhu kālena kālaṃ parasampattiṃ paccavekkhitā hoti. Aṭṭhahi, bhikkhave, asaddhammehi abhibhūto pariyādinnacitto devadatto āpāyiko nerayiko kappaṭṭho atekiccho’’."
    ],
    "innerText": "7. Ekaṃ samayaṃ bhagavā rājagahe viharati gijjhakūṭe pabbate acirapakkante devadatte. Tatra bhagavā devadattaṃ ārabbha bhikkhū āmantesi – ‘‘sādhu, bhikkhave, bhikkhu kālena kālaṃ attavipattiṃ paccavekkhitā hoti. Sādhu, bhikkhave, bhikkhu kālena kālaṃ paravipattiṃ paccavekkhitā hoti. Sādhu, bhikkhave, bhikkhu kālena kālaṃ attasampattiṃ paccavekkhitā hoti. Sādhu , bhikkhave, bhikkhu kālena kālaṃ parasampattiṃ paccavekkhitā hoti. Aṭṭhahi, bhikkhave, asaddhammehi abhibhūto pariyādinnacitto devadatto āpāyiko nerayiko kappaṭṭho atekiccho’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[cūḷava. 348]"
      },
      " ‘‘Katamehi aṭṭhahi? Lābhena hi, bhikkhave, abhibhūto pariyādinnacitto devadatto āpāyiko nerayiko kappaṭṭho atekiccho. Alābhena, bhikkhave…pe… yasena, bhikkhave… ayasena, bhikkhave… sakkārena, bhikkhave… asakkārena, bhikkhave… pāpicchatāya, bhikkhave… pāpamittatāya, bhikkhave, abhibhūto pariyādinnacitto devadatto āpāyiko nerayiko kappaṭṭho atekiccho. Imehi kho, bhikkhave, aṭṭhahi asaddhammehi abhibhūto pariyādinnacitto devadatto āpāyiko ",
      " nerayiko kappaṭṭho atekiccho."
    ],
    "innerText": "[cūḷava. 348] ‘‘Katamehi aṭṭhahi? Lābhena hi, bhikkhave, abhibhūto pariyādinnacitto devadatto āpāyiko nerayiko kappaṭṭho atekiccho. Alābhena, bhikkhave…pe… yasena, bhikkhave… ayasena, bhikkhave… sakkārena, bhikkhave… asakkārena, bhikkhave… pāpicchatāya, bhikkhave… pāpamittatāya, bhikkhave, abhibhūto pariyādinnacitto devadatto āpāyiko nerayiko kappaṭṭho atekiccho. Imehi kho, bhikkhave, aṭṭhahi asaddhammehi abhibhūto pariyādinnacitto devadatto āpāyiko nerayiko kappaṭṭho atekiccho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sādhu, bhikkhave, bhikkhu uppannaṃ lābhaṃ abhibhuyya abhibhuyya vihareyya, uppannaṃ alābhaṃ…pe… uppannaṃ yasaṃ… uppannaṃ ayasaṃ… uppannaṃ sakkāraṃ ",
      "… uppannaṃ asakkāraṃ… uppannaṃ pāpicchataṃ… uppannaṃ pāpamittataṃ abhibhuyya abhibhuyya vihareyya."
    ],
    "innerText": "‘‘Sādhu, bhikkhave, bhikkhu uppannaṃ lābhaṃ abhibhuyya abhibhuyya vihareyya, uppannaṃ alābhaṃ…pe… uppannaṃ yasaṃ… uppannaṃ ayasaṃ… uppannaṃ sakkāraṃ … uppannaṃ asakkāraṃ… uppannaṃ pāpicchataṃ… uppannaṃ pāpamittataṃ abhibhuyya abhibhuyya vihareyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kiñca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kathañca (ka.)]"
      },
      ", bhikkhave, bhikkhu atthavasaṃ paṭicca uppannaṃ lābhaṃ abhibhuyya abhibhuyya vihareyya, uppannaṃ alābhaṃ…pe… uppannaṃ yasaṃ… uppannaṃ ayasaṃ… uppannaṃ sakkāraṃ… uppannaṃ asakkāraṃ… uppannaṃ pāpicchataṃ… uppannaṃ pāpamittataṃ abhibhuyya abhibhuyya vihareyya?"
    ],
    "innerText": "‘‘Kiñca [kathañca (ka.)], bhikkhave, bhikkhu atthavasaṃ paṭicca uppannaṃ lābhaṃ abhibhuyya abhibhuyya vihareyya, uppannaṃ alābhaṃ…pe… uppannaṃ yasaṃ… uppannaṃ ayasaṃ… uppannaṃ sakkāraṃ… uppannaṃ asakkāraṃ… uppannaṃ pāpicchataṃ… uppannaṃ pāpamittataṃ abhibhuyya abhibhuyya vihareyya?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yaṃ hissa, bhikkhave, uppannaṃ lābhaṃ anabhibhuyya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[anabhibhūyya anabhibhūyya (ka.)]"
      },
      " viharato uppajjeyyuṃ āsavā vighātapariḷāhā, uppannaṃ lābhaṃ abhibhuyya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[abhibhūyya abhibhūyya (ka.)]"
      },
      " viharato evaṃsa te āsavā vighātapariḷāhā na honti. Yaṃ hissa, bhikkhave, uppannaṃ alābhaṃ…pe… uppannaṃ yasaṃ… uppannaṃ ayasaṃ… uppannaṃ sakkāraṃ… uppannaṃ asakkāraṃ… uppannaṃ pāpicchataṃ… uppannaṃ pāpamittataṃ anabhibhuyya viharato uppajjeyyuṃ āsavā vighātapariḷāhā, uppannaṃ pāpamittataṃ abhibhuyya viharato evaṃsa te āsavā vighātapariḷāhā na honti. Idaṃ kho, bhikkhave, bhikkhu atthavasaṃ paṭicca uppannaṃ lābhaṃ abhibhuyya abhibhuyya vihareyya, uppannaṃ alābhaṃ…pe… uppannaṃ yasaṃ… uppannaṃ ayasaṃ ",
      " … uppannaṃ sakkāraṃ… uppannaṃ asakkāraṃ… uppannaṃ pāpicchataṃ… uppannaṃ pāpamittataṃ abhibhuyya abhibhuyya vihareyya."
    ],
    "innerText": "‘‘Yaṃ hissa, bhikkhave, uppannaṃ lābhaṃ anabhibhuyya [anabhibhūyya anabhibhūyya (ka.)] viharato uppajjeyyuṃ āsavā vighātapariḷāhā, uppannaṃ lābhaṃ abhibhuyya [abhibhūyya abhibhūyya (ka.)] viharato evaṃsa te āsavā vighātapariḷāhā na honti. Yaṃ hissa, bhikkhave, uppannaṃ alābhaṃ…pe… uppannaṃ yasaṃ… uppannaṃ ayasaṃ… uppannaṃ sakkāraṃ… uppannaṃ asakkāraṃ… uppannaṃ pāpicchataṃ… uppannaṃ pāpamittataṃ anabhibhuyya viharato uppajjeyyuṃ āsavā vighātapariḷāhā, uppannaṃ pāpamittataṃ abhibhuyya viharato evaṃsa te āsavā vighātapariḷāhā na honti. Idaṃ kho, bhikkhave, bhikkhu atthavasaṃ paṭicca uppannaṃ lābhaṃ abhibhuyya abhibhuyya vihareyya, uppannaṃ alābhaṃ…pe… uppannaṃ yasaṃ… uppannaṃ ayasaṃ … uppannaṃ sakkāraṃ… uppannaṃ asakkāraṃ… uppannaṃ pāpicchataṃ… uppannaṃ pāpamittataṃ abhibhuyya abhibhuyya vihareyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tasmātiha ",
      ", bhikkhave, evaṃ sikkhitabbaṃ – ‘uppannaṃ lābhaṃ abhibhuyya abhibhuyya viharissāma, uppannaṃ alābhaṃ…pe… uppannaṃ yasaṃ… uppannaṃ ayasaṃ… uppannaṃ sakkāraṃ… uppannaṃ asakkāraṃ… uppannaṃ pāpicchataṃ… uppannaṃ pāpamittataṃ abhibhuyya abhibhuyya viharissāmā’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Sattamaṃ."
    ],
    "innerText": "‘‘Tasmātiha , bhikkhave, evaṃ sikkhitabbaṃ – ‘uppannaṃ lābhaṃ abhibhuyya abhibhuyya viharissāma, uppannaṃ alābhaṃ…pe… uppannaṃ yasaṃ… uppannaṃ ayasaṃ… uppannaṃ sakkāraṃ… uppannaṃ asakkāraṃ… uppannaṃ pāpicchataṃ… uppannaṃ pāpamittataṃ abhibhuyya abhibhuyya viharissāmā’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Uttaravipattisuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "8"
      },
      ". Ekaṃ ",
      " samayaṃ āyasmā uttaro mahisavatthusmiṃ viharati saṅkheyyake pabbate vaṭajālikāyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[dhavajālikāyaṃ (sī.), vaṭṭajālikāyaṃ (syā.)]"
      },
      ". Tatra kho āyasmā uttaro bhikkhū āmantesi – ‘‘sādhāvuso, bhikkhu kālena kālaṃ attavipattiṃ paccavekkhitā hoti. Sādhāvuso, bhikkhu kālena kālaṃ paravipattiṃ paccavekkhitā hoti. Sādhāvuso, bhikkhu kālena kālaṃ attasampattiṃ paccavekkhitā hoti. Sādhāvuso, bhikkhu kālena kālaṃ parasampattiṃ paccavekkhitā hotī’’ti."
    ],
    "innerText": "8. Ekaṃ samayaṃ āyasmā uttaro mahisavatthusmiṃ viharati saṅkheyyake pabbate vaṭajālikāyaṃ [dhavajālikāyaṃ (sī.), vaṭṭajālikāyaṃ (syā.)]. Tatra kho āyasmā uttaro bhikkhū āmantesi – ‘‘sādhāvuso, bhikkhu kālena kālaṃ attavipattiṃ paccavekkhitā hoti. Sādhāvuso, bhikkhu kālena kālaṃ paravipattiṃ paccavekkhitā hoti. Sādhāvuso, bhikkhu kālena kālaṃ attasampattiṃ paccavekkhitā hoti. Sādhāvuso, bhikkhu kālena kālaṃ parasampattiṃ paccavekkhitā hotī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena kho pana samayena vessavaṇo mahārājā uttarāya disāya dakkhiṇaṃ disaṃ gacchati kenacideva karaṇīyena. Assosi kho vessavaṇo mahārājā āyasmato uttarassa mahisavatthusmiṃ saṅkheyyake pabbate vaṭajālikāyaṃ bhikkhūnaṃ evaṃ dhammaṃ desentassa – ‘‘sādhāvuso, bhikkhu kālena kālaṃ attavipattiṃ paccavekkhitā hoti. Sādhāvuso, bhikkhu kālena kālaṃ paravipattiṃ paccavekkhitā hoti. Sādhāvuso, bhikkhu kālena kālaṃ attasampattiṃ paccavekkhitā hoti. Sādhāvuso, bhikkhu kālena kālaṃ parasampattiṃ paccavekkhitā hotī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho vessavaṇṇo mahārājā – seyyathāpi nāma balavā puriso samiñjitaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sammiñjitaṃ (sī. syā. kaṃ. pī.)]"
      },
      " vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sammiñjeyya (sī. syā. kaṃ. pī.)]"
      },
      ", evamevaṃ mahisavatthusmiṃ saṅkheyyake pabbate vaṭajālikāyaṃ antarahito devesu tāvatiṃsesu pāturahosi. Atha kho vessavaṇṇo mahārājā yena sakko devānamindo tenupasaṅkami; upasaṅkamitvā sakkaṃ ",
      " devānamindaṃ etadavoca – ‘‘yagghe mārisa, jāneyyāsi! Eso āyasmā uttaro mahisavatthusmiṃ saṅkheyyake ",
      " pabbate vaṭajālikāyaṃ bhikkhūnaṃ ",
      " evaṃ dhammaṃ deseti – ‘sādhāvuso, bhikkhu kālena kālaṃ attavipattiṃ paccavekkhitā hoti ",
      ". Sādhāvuso, bhikkhu kālena kālaṃ paravipattiṃ…pe… attasampattiṃ… parasampattiṃ paccavekkhitā hotī’’’ti."
    ],
    "innerText": "Atha kho vessavaṇṇo mahārājā – seyyathāpi nāma balavā puriso samiñjitaṃ [sammiñjitaṃ (sī. syā. kaṃ. pī.)] vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya [sammiñjeyya (sī. syā. kaṃ. pī.)], evamevaṃ mahisavatthusmiṃ saṅkheyyake pabbate vaṭajālikāyaṃ antarahito devesu tāvatiṃsesu pāturahosi. Atha kho vessavaṇṇo mahārājā yena sakko devānamindo tenupasaṅkami; upasaṅkamitvā sakkaṃ devānamindaṃ etadavoca – ‘‘yagghe mārisa, jāneyyāsi! Eso āyasmā uttaro mahisavatthusmiṃ saṅkheyyake pabbate vaṭajālikāyaṃ bhikkhūnaṃ evaṃ dhammaṃ deseti – ‘sādhāvuso, bhikkhu kālena kālaṃ attavipattiṃ paccavekkhitā hoti . Sādhāvuso, bhikkhu kālena kālaṃ paravipattiṃ…pe… attasampattiṃ… parasampattiṃ paccavekkhitā hotī’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha kho sakko devānamindo seyyathāpi nāma balavā puriso samiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya, evamevaṃ devesu tāvatiṃsesu antarahito mahisavatthusmiṃ saṅkheyyake pabbate vaṭajālikāyaṃ āyasmato uttarassa sammukhe pāturahosi. Atha kho sakko devānamindo yenāyasmā uttaro tenupasaṅkami; upasaṅkamitvā āyasmantaṃ uttaraṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhito kho sakko devānamindo āyasmantaṃ uttaraṃ etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Saccaṃ kira, bhante, āyasmā uttaro bhikkhūnaṃ evaṃ dhammaṃ desesi – ‘sādhāvuso, bhikkhu kālena kālaṃ attavipattiṃ paccavekkhitā hoti, sādhāvuso, bhikkhu kālena kālaṃ paravipattiṃ…pe… attasampattiṃ… parasampattiṃ paccavekkhitā hotī’’’ ti? ‘‘Evaṃ, devānamindā’’ti. ‘‘Kiṃ panidaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kiṃ pana (syā.)]"
      },
      ", bhante, āyasmato uttarassa sakaṃ paṭibhānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sakapaṭibhānaṃ upādāya (ka.)]"
      },
      ", udāhu tassa bhagavato vacanaṃ arahato sammāsambuddhassā’’ti? ‘‘Tena hi, devānaminda, upamaṃ te karissāmi. Upamāya midhekacce viññū purisā bhāsitassa atthaṃ ājāna’’nti."
    ],
    "innerText": "‘‘Saccaṃ kira, bhante, āyasmā uttaro bhikkhūnaṃ evaṃ dhammaṃ desesi – ‘sādhāvuso, bhikkhu kālena kālaṃ attavipattiṃ paccavekkhitā hoti, sādhāvuso, bhikkhu kālena kālaṃ paravipattiṃ…pe… attasampattiṃ… parasampattiṃ paccavekkhitā hotī’’’ ti? ‘‘Evaṃ, devānamindā’’ti. ‘‘Kiṃ panidaṃ [kiṃ pana (syā.)], bhante, āyasmato uttarassa sakaṃ paṭibhānaṃ [sakapaṭibhānaṃ upādāya (ka.)], udāhu tassa bhagavato vacanaṃ arahato sammāsambuddhassā’’ti? ‘‘Tena hi, devānaminda, upamaṃ te karissāmi. Upamāya midhekacce viññū purisā bhāsitassa atthaṃ ājāna’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, devānaminda, gāmassa vā nigamassa vā avidūre mahādhaññarāsi. Tato mahājanakāyo dhaññaṃ āhareyya – kājehipi piṭakehipi ucchaṅgehipi ",
      " añjalīhipi ",
      ". Yo nu kho, devānaminda, taṃ mahājanakāyaṃ upasaṅkamitvā evaṃ puccheyya – ‘kuto imaṃ dhaññaṃ āharathā’ti, kathaṃ byākaramāno nu kho, devānaminda, so mahājanakāyo sammā byākaramāno byākareyyā’’ti? ‘‘‘Amumhā mahādhaññarāsimhā āharāmā’ti kho, bhante, so mahājanakāyo sammā byākaramāno byākareyyā’’ti. ‘‘Evamevaṃ kho, devānaminda, yaṃ kiñci subhāsitaṃ sabbaṃ taṃ tassa bhagavato vacanaṃ arahato sammāsambuddhassa. Tato upādāyupādāya mayaṃ caññe ca bhaṇāmā’’ti."
    ],
    "innerText": "‘‘Seyyathāpi, devānaminda, gāmassa vā nigamassa vā avidūre mahādhaññarāsi. Tato mahājanakāyo dhaññaṃ āhareyya – kājehipi piṭakehipi ucchaṅgehipi añjalīhipi . Yo nu kho, devānaminda, taṃ mahājanakāyaṃ upasaṅkamitvā evaṃ puccheyya – ‘kuto imaṃ dhaññaṃ āharathā’ti, kathaṃ byākaramāno nu kho, devānaminda, so mahājanakāyo sammā byākaramāno byākareyyā’’ti? ‘‘‘Amumhā mahādhaññarāsimhā āharāmā’ti kho, bhante, so mahājanakāyo sammā byākaramāno byākareyyā’’ti. ‘‘Evamevaṃ kho, devānaminda, yaṃ kiñci subhāsitaṃ sabbaṃ taṃ tassa bhagavato vacanaṃ arahato sammāsambuddhassa. Tato upādāyupādāya mayaṃ caññe ca bhaṇāmā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Acchariyaṃ, bhante, abbhutaṃ bhante! Yāva subhāsitaṃ cidaṃ āyasmatā uttarena – ‘yaṃ kiñci ",
      " subhāsitaṃ sabbaṃ taṃ tassa bhagavato vacanaṃ arahato sammāsambuddhassa ",
      ". Tato upādāyupādāya mayaṃ caññe ca bhaṇāmā’ti. Ekamidaṃ, bhante uttara, samayaṃ bhagavā rājagahe viharati gijjhakūṭe pabbate acirapakkante devadatte. Tatra kho bhagavā devadattaṃ ārabbha bhikkhū āmantesi –"
    ],
    "innerText": "‘‘Acchariyaṃ, bhante, abbhutaṃ bhante! Yāva subhāsitaṃ cidaṃ āyasmatā uttarena – ‘yaṃ kiñci subhāsitaṃ sabbaṃ taṃ tassa bhagavato vacanaṃ arahato sammāsambuddhassa . Tato upādāyupādāya mayaṃ caññe ca bhaṇāmā’ti. Ekamidaṃ, bhante uttara, samayaṃ bhagavā rājagahe viharati gijjhakūṭe pabbate acirapakkante devadatte. Tatra kho bhagavā devadattaṃ ārabbha bhikkhū āmantesi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sādhu, bhikkhave, bhikkhu kālena kālaṃ attavipattiṃ paccavekkhitā hoti. Sādhu, bhikkhave, bhikkhu kālena kālaṃ paravipattiṃ…pe… attasampattiṃ… parasampattiṃ paccavekkhitā hoti. Aṭṭhahi, bhikkhave, asaddhammehi abhibhūto pariyādinnacitto devadatto āpāyiko nerayiko kappaṭṭho atekiccho. Katamehi aṭṭhahi? Lābhena hi, bhikkhave, abhibhūto pariyādinnacitto devadatto āpāyiko nerayiko kappaṭṭho atekiccho; alābhena, bhikkhave…pe… yasena, bhikkhave ",
      "… ayasena, bhikkhave… sakkārena, bhikkhave… asakkārena, bhikkhave… pāpicchatāya, bhikkhave… pāpamittatāya ",
      ", bhikkhave, abhibhūto pariyādinnacitto devadatto āpāyiko nerayiko kappaṭṭho atekiccho. Imehi kho, bhikkhave, aṭṭhahi asaddhammehi abhibhūto pariyādinnacitto devadatto āpāyiko nerayiko kappaṭṭho atekiccho."
    ],
    "innerText": "‘‘Sādhu, bhikkhave, bhikkhu kālena kālaṃ attavipattiṃ paccavekkhitā hoti. Sādhu, bhikkhave, bhikkhu kālena kālaṃ paravipattiṃ…pe… attasampattiṃ… parasampattiṃ paccavekkhitā hoti. Aṭṭhahi, bhikkhave, asaddhammehi abhibhūto pariyādinnacitto devadatto āpāyiko nerayiko kappaṭṭho atekiccho. Katamehi aṭṭhahi? Lābhena hi, bhikkhave, abhibhūto pariyādinnacitto devadatto āpāyiko nerayiko kappaṭṭho atekiccho; alābhena, bhikkhave…pe… yasena, bhikkhave … ayasena, bhikkhave… sakkārena, bhikkhave… asakkārena, bhikkhave… pāpicchatāya, bhikkhave… pāpamittatāya , bhikkhave, abhibhūto pariyādinnacitto devadatto āpāyiko nerayiko kappaṭṭho atekiccho. Imehi kho, bhikkhave, aṭṭhahi asaddhammehi abhibhūto pariyādinnacitto devadatto āpāyiko nerayiko kappaṭṭho atekiccho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sādhu, bhikkhave, bhikkhu uppannaṃ lābhaṃ abhibhuyya abhibhuyya vihareyya; uppannaṃ alābhaṃ…pe… uppannaṃ yasaṃ… uppannaṃ ayasaṃ… uppannaṃ sakkāraṃ… uppannaṃ asakkāraṃ… uppannaṃ pāpicchataṃ… uppannaṃ pāpamittataṃ abhibhuyya abhibhuyya vihareyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kiñca, bhikkhave, bhikkhu atthavasaṃ paṭicca uppannaṃ lābhaṃ abhibhuyya abhibhuyya vihareyya; uppannaṃ alābhaṃ…pe… uppannaṃ yasaṃ… uppannaṃ ayasaṃ… uppannaṃ sakkāraṃ… uppannaṃ asakkāraṃ… uppannaṃ pāpicchataṃ… uppannaṃ pāpamittataṃ abhibhuyya abhibhuyya vihareyya?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yaṃ hissa, bhikkhave, uppannaṃ lābhaṃ anabhibhuyya viharato uppajjeyyuṃ āsavā vighātapariḷāhā, uppannaṃ lābhaṃ abhibhuyya viharato evaṃsa te āsavā vighātapariḷāhā na honti. Yaṃ hissa, bhikkhave, uppannaṃ alābhaṃ…pe… uppannaṃ yasaṃ… uppannaṃ ayasaṃ… uppannaṃ sakkāraṃ… uppannaṃ asakkāraṃ… uppannaṃ pāpicchataṃ… uppannaṃ pāpamittataṃ anabhibhuyya viharato ",
      " uppajjeyyuṃ āsavā vighātapariḷāhā, uppannaṃ pāpamittataṃ abhibhuyya viharato evaṃsa ",
      " te āsavā vighātapariḷāhā na honti. Idaṃ kho, bhikkhave, bhikkhu atthavasaṃ paṭicca uppannaṃ lābhaṃ abhibhuyya abhibhuyya vihareyya; uppannaṃ alābhaṃ…pe… uppannaṃ yasaṃ… uppannaṃ ayasaṃ… uppannaṃ sakkāraṃ… uppannaṃ asakkāraṃ… uppannaṃ pāpicchataṃ ",
      "… uppannaṃ pāpamittataṃ abhibhuyya abhibhuyya vihareyya."
    ],
    "innerText": "‘‘Yaṃ hissa, bhikkhave, uppannaṃ lābhaṃ anabhibhuyya viharato uppajjeyyuṃ āsavā vighātapariḷāhā, uppannaṃ lābhaṃ abhibhuyya viharato evaṃsa te āsavā vighātapariḷāhā na honti. Yaṃ hissa, bhikkhave, uppannaṃ alābhaṃ…pe… uppannaṃ yasaṃ… uppannaṃ ayasaṃ… uppannaṃ sakkāraṃ… uppannaṃ asakkāraṃ… uppannaṃ pāpicchataṃ… uppannaṃ pāpamittataṃ anabhibhuyya viharato uppajjeyyuṃ āsavā vighātapariḷāhā, uppannaṃ pāpamittataṃ abhibhuyya viharato evaṃsa te āsavā vighātapariḷāhā na honti. Idaṃ kho, bhikkhave, bhikkhu atthavasaṃ paṭicca uppannaṃ lābhaṃ abhibhuyya abhibhuyya vihareyya; uppannaṃ alābhaṃ…pe… uppannaṃ yasaṃ… uppannaṃ ayasaṃ… uppannaṃ sakkāraṃ… uppannaṃ asakkāraṃ… uppannaṃ pāpicchataṃ … uppannaṃ pāpamittataṃ abhibhuyya abhibhuyya vihareyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – uppannaṃ ",
      " lābhaṃ abhibhuyya abhibhuyya viharissāma, uppannaṃ alābhaṃ…pe… uppannaṃ yasaṃ… uppannaṃ ayasaṃ… uppannaṃ sakkāraṃ… uppannaṃ asakkāraṃ… uppannaṃ pāpicchataṃ… uppannaṃ pāpamittataṃ abhibhuyya abhibhuyya viharissāmāti. Evañhi vo, bhikkhave, sikkhitabba’’nti."
    ],
    "innerText": "‘‘Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – uppannaṃ lābhaṃ abhibhuyya abhibhuyya viharissāma, uppannaṃ alābhaṃ…pe… uppannaṃ yasaṃ… uppannaṃ ayasaṃ… uppannaṃ sakkāraṃ… uppannaṃ asakkāraṃ… uppannaṃ pāpicchataṃ… uppannaṃ pāpamittataṃ abhibhuyya abhibhuyya viharissāmāti. Evañhi vo, bhikkhave, sikkhitabba’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ettāvatā, bhante uttara, manussesu catasso parisā – bhikkhū, bhikkhuniyo, upāsakā, upāsikāyo. Nāyaṃ dhammapariyāyo kismiñci upaṭṭhito ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[patiṭṭhito (sī. syā.)]"
      },
      ". Uggaṇhatu, bhante, āyasmā uttaro imaṃ dhammapariyāyaṃ. Pariyāpuṇātu, bhante, āyasmā uttaro imaṃ dhammapariyāyaṃ. Dhāretu, bhante, āyasmā uttaro imaṃ dhammapariyāyaṃ. Atthasaṃhito ayaṃ, bhante, dhammapariyāyo ādibrahmacariyako’’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ādibrahmacariyiko (sī. ka.)]"
      },
      ". Aṭṭhamaṃ."
    ],
    "innerText": "‘‘Ettāvatā, bhante uttara, manussesu catasso parisā – bhikkhū, bhikkhuniyo, upāsakā, upāsikāyo. Nāyaṃ dhammapariyāyo kismiñci upaṭṭhito [patiṭṭhito (sī. syā.)]. Uggaṇhatu, bhante, āyasmā uttaro imaṃ dhammapariyāyaṃ. Pariyāpuṇātu, bhante, āyasmā uttaro imaṃ dhammapariyāyaṃ. Dhāretu, bhante, āyasmā uttaro imaṃ dhammapariyāyaṃ. Atthasaṃhito ayaṃ, bhante, dhammapariyāyo ādibrahmacariyako’’ti [ādibrahmacariyiko (sī. ka.)]. Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Nandasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "9"
      },
      ". ‘‘‘Kulaputto’ti, bhikkhave, nandaṃ sammā vadamāno vadeyya. ‘Balavā’ti, bhikkhave, nandaṃ sammā vadamāno vadeyya. ‘Pāsādiko’ti, bhikkhave, nandaṃ sammā vadamāno vadeyya. ‘Tibbarāgo’ti, bhikkhave, nandaṃ sammā vadamāno vadeyya. Kimaññatra, bhikkhave, nando indriyesu guttadvāro, bhojane mattaññū, jāgariyaṃ anuyutto, satisampajaññena samannāgato, yehi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yena (ka.)]"
      },
      " nando sakkoti paripuṇṇaṃ parisuddhaṃ brahmacariyaṃ carituṃ! Tatridaṃ, bhikkhave, nandassa indriyesu guttadvāratāya hoti. Sace ",
      ", bhikkhave, nandassa puratthimā disā āloketabbā hoti, sabbaṃ cetasā samannāharitvā ",
      " nando puratthimaṃ disaṃ āloketi – ‘evaṃ me puratthimaṃ disaṃ ālokayato nābhijjhādomanassā pāpakā akusalā dhammā anvāssavissantī’ti. Itiha tattha sampajāno hoti."
    ],
    "innerText": "9. ‘‘‘Kulaputto’ti, bhikkhave, nandaṃ sammā vadamāno vadeyya. ‘Balavā’ti, bhikkhave, nandaṃ sammā vadamāno vadeyya. ‘Pāsādiko’ti, bhikkhave, nandaṃ sammā vadamāno vadeyya. ‘Tibbarāgo’ti, bhikkhave, nandaṃ sammā vadamāno vadeyya. Kimaññatra, bhikkhave, nando indriyesu guttadvāro, bhojane mattaññū, jāgariyaṃ anuyutto, satisampajaññena samannāgato, yehi [yena (ka.)] nando sakkoti paripuṇṇaṃ parisuddhaṃ brahmacariyaṃ carituṃ! Tatridaṃ, bhikkhave, nandassa indriyesu guttadvāratāya hoti. Sace , bhikkhave, nandassa puratthimā disā āloketabbā hoti, sabbaṃ cetasā samannāharitvā nando puratthimaṃ disaṃ āloketi – ‘evaṃ me puratthimaṃ disaṃ ālokayato nābhijjhādomanassā pāpakā akusalā dhammā anvāssavissantī’ti. Itiha tattha sampajāno hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace ",
      ", bhikkhave, nandassa pacchimā disā āloketabbā hoti…pe… uttarā disā āloketabbā hoti… dakkhiṇā disā āloketabbā hoti… uddhaṃ ulloketabbā hoti… adho oloketabbā hoti… anudisā anuviloketabbā hoti, sabbaṃ cetasā samannāharitvā nando anudisaṃ anuviloketi – ‘evaṃ me anudisaṃ anuvilokayato nābhijjhādomanassā pāpakā akusalā dhammā anvāssavissantī’ti. Itiha tattha sampajāno hoti. Idaṃ kho, bhikkhave, nandassa indriyesu guttadvāratāya hoti."
    ],
    "innerText": "‘‘Sace , bhikkhave, nandassa pacchimā disā āloketabbā hoti…pe… uttarā disā āloketabbā hoti… dakkhiṇā disā āloketabbā hoti… uddhaṃ ulloketabbā hoti… adho oloketabbā hoti… anudisā anuviloketabbā hoti, sabbaṃ cetasā samannāharitvā nando anudisaṃ anuviloketi – ‘evaṃ me anudisaṃ anuvilokayato nābhijjhādomanassā pāpakā akusalā dhammā anvāssavissantī’ti. Itiha tattha sampajāno hoti. Idaṃ kho, bhikkhave, nandassa indriyesu guttadvāratāya hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tatridaṃ, bhikkhave, nandassa bhojane mattaññutāya hoti. Idha, bhikkhave, nando paṭisaṅkhā yoniso āhāraṃ āhāreti – ‘neva davāya na madāya na maṇḍanāya na vibhūsanāya, yāvadeva imassa kāyassa ṭhitiyā yāpanāya vihiṃsūparatiyā brahmacariyānuggahāya iti purāṇañca vedanaṃ paṭihaṅkhāmi, navañca vedanaṃ na uppādessāmi, yātrā ca me bhavissati anavajjatā ca phāsuvihāro cā’ti. Idaṃ kho, bhikkhave, nandassa bhojane mattaññutāya hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tatridaṃ, bhikkhave, nandassa jāgariyānuyogasmiṃ hoti. Idha ",
      ", bhikkhave, nando divasaṃ caṅkamena nisajjāya āvaraṇīyehi dhammehi cittaṃ parisodheti; rattiyā paṭhamaṃ yāmaṃ caṅkamena nisajjāya āvaraṇīyehi dhammehi cittaṃ parisodheti ",
      "; rattiyā majjhimaṃ yāmaṃ dakkhiṇena passena sīhaseyyaṃ kappeti pāde pādaṃ accādhāya sato sampajāno uṭṭhānasaññaṃ manasi karitvā; rattiyā pacchimaṃ yāmaṃ paccuṭṭhāya caṅkamena nisajjāya āvaraṇīyehi dhammehi cittaṃ parisodheti. Idaṃ kho, bhikkhave, nandassa jāgariyānuyogasmiṃ hoti."
    ],
    "innerText": "‘‘Tatridaṃ, bhikkhave, nandassa jāgariyānuyogasmiṃ hoti. Idha , bhikkhave, nando divasaṃ caṅkamena nisajjāya āvaraṇīyehi dhammehi cittaṃ parisodheti; rattiyā paṭhamaṃ yāmaṃ caṅkamena nisajjāya āvaraṇīyehi dhammehi cittaṃ parisodheti ; rattiyā majjhimaṃ yāmaṃ dakkhiṇena passena sīhaseyyaṃ kappeti pāde pādaṃ accādhāya sato sampajāno uṭṭhānasaññaṃ manasi karitvā; rattiyā pacchimaṃ yāmaṃ paccuṭṭhāya caṅkamena nisajjāya āvaraṇīyehi dhammehi cittaṃ parisodheti. Idaṃ kho, bhikkhave, nandassa jāgariyānuyogasmiṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tatridaṃ, bhikkhave, nandassa satisampajaññasmiṃ hoti. Idha, bhikkhave, nandassa viditā vedanā uppajjanti, viditā upaṭṭhahanti, viditā abbhatthaṃ gacchanti; viditā saññā…pe… viditā vitakkā…pe… abbhatthaṃ gacchanti. Idaṃ kho, bhikkhave, nandassa satisampajaññasmiṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kimaññatra, bhikkhave, nando indriyesu guttadvāro, bhojane mattaññū, jāgariyaṃ anuyutto ",
      ", satisampajaññena samannāgato, yehi nando sakkoti paripuṇṇaṃ parisuddhaṃ brahmacariyaṃ caritu’’nti! Navamaṃ."
    ],
    "innerText": "‘‘Kimaññatra, bhikkhave, nando indriyesu guttadvāro, bhojane mattaññū, jāgariyaṃ anuyutto , satisampajaññena samannāgato, yehi nando sakkoti paripuṇṇaṃ parisuddhaṃ brahmacariyaṃ caritu’’nti! Navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Kāraṇḍavasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "10"
      },
      ". Ekaṃ ",
      " samayaṃ bhagavā campāyaṃ viharati gaggarāya pokkharaṇiyā tīre. Tena kho pana samayena bhikkhū bhikkhuṃ āpattiyā codenti. So bhikkhu bhikkhūhi āpattiyā codiyamāno aññenāññaṃ paṭicarati, bahiddhā kathaṃ apanāmeti, kopañca dosañca appaccayañca pātukaroti."
    ],
    "innerText": "10. Ekaṃ samayaṃ bhagavā campāyaṃ viharati gaggarāya pokkharaṇiyā tīre. Tena kho pana samayena bhikkhū bhikkhuṃ āpattiyā codenti. So bhikkhu bhikkhūhi āpattiyā codiyamāno aññenāññaṃ paṭicarati, bahiddhā kathaṃ apanāmeti, kopañca dosañca appaccayañca pātukaroti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho bhagavā bhikkhū āmantesi – ‘‘niddhamathetaṃ ",
      ", bhikkhave, puggalaṃ; niddhamathetaṃ, bhikkhave, puggalaṃ. Apaneyyeso ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[apaneyyo so (sī.), apaneyyo (syā.)]"
      },
      ", bhikkhave, puggalo. Kiṃ vo tena paraputtena visodhitena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kiṃ voparaputto viheṭhiyati (sī.), kiṃ paraputto viheṭheti (syā.), kiṃ vo paraputtā viheṭheti (pī.), kiṃ so paraputto visodheti (ka.)]"
      },
      "! Idha ",
      ", bhikkhave, ekaccassa puggalassa tādisaṃyeva hoti abhikkantaṃ paṭikkantaṃ ālokitaṃ vilokitaṃ samiñjitaṃ pasāritaṃ saṅghāṭipattacīvaradhāraṇaṃ, seyyathāpi aññesaṃ bhaddakānaṃ bhikkhūnaṃ – yāvassa bhikkhū āpattiṃ na passanti. Yato ca khvassa bhikkhū āpattiṃ passanti, tamenaṃ evaṃ jānanti – ‘samaṇadūsīvāyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[samaṇarūpī (ka.)]"
      },
      " samaṇapalāpo samaṇakāraṇḍavo’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[samaṇakaraṇḍavoti (ka.)]"
      },
      ". Tamenaṃ iti viditvā bahiddhā nāsenti. Taṃ kissa hetu? Mā aññe bhaddake bhikkhū dūsesī’’ti!"
    ],
    "innerText": "Atha kho bhagavā bhikkhū āmantesi – ‘‘niddhamathetaṃ , bhikkhave, puggalaṃ; niddhamathetaṃ, bhikkhave, puggalaṃ. Apaneyyeso [apaneyyo so (sī.), apaneyyo (syā.)], bhikkhave, puggalo. Kiṃ vo tena paraputtena visodhitena [kiṃ voparaputto viheṭhiyati (sī.), kiṃ paraputto viheṭheti (syā.), kiṃ vo paraputtā viheṭheti (pī.), kiṃ so paraputto visodheti (ka.)]! Idha , bhikkhave, ekaccassa puggalassa tādisaṃyeva hoti abhikkantaṃ paṭikkantaṃ ālokitaṃ vilokitaṃ samiñjitaṃ pasāritaṃ saṅghāṭipattacīvaradhāraṇaṃ, seyyathāpi aññesaṃ bhaddakānaṃ bhikkhūnaṃ – yāvassa bhikkhū āpattiṃ na passanti. Yato ca khvassa bhikkhū āpattiṃ passanti, tamenaṃ evaṃ jānanti – ‘samaṇadūsīvāyaṃ [samaṇarūpī (ka.)] samaṇapalāpo samaṇakāraṇḍavo’ti [samaṇakaraṇḍavoti (ka.)]. Tamenaṃ iti viditvā bahiddhā nāsenti. Taṃ kissa hetu? Mā aññe bhaddake bhikkhū dūsesī’’ti!"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, bhikkhave, sampanne yavakaraṇe yavadūsī ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yavarūpī (ka.)]"
      },
      " jāyetha yavapalāpo yavakāraṇḍavoti. Tassa tādisaṃyeva mūlaṃ hoti, seyyathāpi aññesaṃ bhaddakānaṃ yavānaṃ; tādisaṃyeva nāḷaṃ hoti, seyyathāpi aññesaṃ bhaddakānaṃ yavānaṃ; tādisaṃyeva pattaṃ hoti, seyyathāpi aññesaṃ bhaddakānaṃ yavānaṃ – yāvassa sīsaṃ na nibbattati. Yato ca khvassa sīsaṃ nibbattati, tamenaṃ evaṃ jānanti – ‘yavadūsīvāyaṃ yavapalāpo yavakāraṇḍavo’ti ",
      ". Tamenaṃ iti viditvā samūlaṃ uppāṭetvā bahiddhā yavakaraṇassa chaḍḍenti. Taṃ kissa hetu? Mā aññe bhaddake yave dūsesīti!"
    ],
    "innerText": "‘‘Seyyathāpi, bhikkhave, sampanne yavakaraṇe yavadūsī [yavarūpī (ka.)] jāyetha yavapalāpo yavakāraṇḍavoti. Tassa tādisaṃyeva mūlaṃ hoti, seyyathāpi aññesaṃ bhaddakānaṃ yavānaṃ; tādisaṃyeva nāḷaṃ hoti, seyyathāpi aññesaṃ bhaddakānaṃ yavānaṃ; tādisaṃyeva pattaṃ hoti, seyyathāpi aññesaṃ bhaddakānaṃ yavānaṃ – yāvassa sīsaṃ na nibbattati. Yato ca khvassa sīsaṃ nibbattati, tamenaṃ evaṃ jānanti – ‘yavadūsīvāyaṃ yavapalāpo yavakāraṇḍavo’ti . Tamenaṃ iti viditvā samūlaṃ uppāṭetvā bahiddhā yavakaraṇassa chaḍḍenti. Taṃ kissa hetu? Mā aññe bhaddake yave dūsesīti!"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evamevaṃ kho, bhikkhave, idhekaccassa puggalassa tādisaṃyeva hoti abhikkantaṃ paṭikkantaṃ ālokitaṃ vilokitaṃ samiñjitaṃ pasāritaṃ saṅghāṭipattacīvaradhāraṇaṃ, seyyathāpi aññesaṃ ",
      " bhaddakānaṃ bhikkhūnaṃ – yāvassa ",
      " bhikkhū āpattiṃ na passanti. Yato ca khvassa bhikkhū āpattiṃ passanti, tamenaṃ evaṃ jānanti – ‘samaṇadūsīvāyaṃ samaṇapalāpo samaṇakāraṇḍavo’ti. Tamenaṃ iti viditvā bahiddhā nāsenti. Taṃ kissa ",
      " hetu? Mā aññe bhaddake bhikkhū dūsesīti."
    ],
    "innerText": "‘‘Evamevaṃ kho, bhikkhave, idhekaccassa puggalassa tādisaṃyeva hoti abhikkantaṃ paṭikkantaṃ ālokitaṃ vilokitaṃ samiñjitaṃ pasāritaṃ saṅghāṭipattacīvaradhāraṇaṃ, seyyathāpi aññesaṃ bhaddakānaṃ bhikkhūnaṃ – yāvassa bhikkhū āpattiṃ na passanti. Yato ca khvassa bhikkhū āpattiṃ passanti, tamenaṃ evaṃ jānanti – ‘samaṇadūsīvāyaṃ samaṇapalāpo samaṇakāraṇḍavo’ti. Tamenaṃ iti viditvā bahiddhā nāsenti. Taṃ kissa hetu? Mā aññe bhaddake bhikkhū dūsesīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, bhikkhave, mahato dhaññarāsissa phuṇamānassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vuyhamānassa (sī. pī.), phusayamānassa (syā.), punamānassa (?)]"
      },
      " tattha yāni tāni dhaññāni daḷhāni sāravantāni tāni ekamantaṃ puñjaṃ hoti, yāni pana tāni dhaññāni dubbalāni palāpāni tāni vāto ekamantaṃ apavahati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[apakassati (sī.)]"
      },
      ". Tamenaṃ sāmikā sammajjaniṃ gahetvā bhiyyosomattāya apasammajjanti. Taṃ kissa hetu? Mā aññe bhaddake dhaññe dūsesīti! Evamevaṃ kho, bhikkhave, idhekaccassa puggalassa tādisaṃyeva hoti abhikkantaṃ paṭikkantaṃ ālokitaṃ vilokitaṃ samiñjitaṃ pasāritaṃ saṅghāṭipattacīvaradhāraṇaṃ, seyyathāpi aññesaṃ bhaddakānaṃ bhikkhūnaṃ – yāvassa bhikkhū āpattiṃ na passanti. Yato ca khvassa bhikkhū āpattiṃ passanti, tamenaṃ evaṃ jānanti ",
      " – ‘samaṇadūsīvāyaṃ samaṇapalāpo samaṇakāraṇḍavo’ti. Tamenaṃ iti viditvā bahiddhā nāsenti. Taṃ kissa hetu? Mā aññe bhaddake bhikkhū dūsesīti."
    ],
    "innerText": "‘‘Seyyathāpi, bhikkhave, mahato dhaññarāsissa phuṇamānassa [vuyhamānassa (sī. pī.), phusayamānassa (syā.), punamānassa (?)] tattha yāni tāni dhaññāni daḷhāni sāravantāni tāni ekamantaṃ puñjaṃ hoti, yāni pana tāni dhaññāni dubbalāni palāpāni tāni vāto ekamantaṃ apavahati [apakassati (sī.)]. Tamenaṃ sāmikā sammajjaniṃ gahetvā bhiyyosomattāya apasammajjanti. Taṃ kissa hetu? Mā aññe bhaddake dhaññe dūsesīti! Evamevaṃ kho, bhikkhave, idhekaccassa puggalassa tādisaṃyeva hoti abhikkantaṃ paṭikkantaṃ ālokitaṃ vilokitaṃ samiñjitaṃ pasāritaṃ saṅghāṭipattacīvaradhāraṇaṃ, seyyathāpi aññesaṃ bhaddakānaṃ bhikkhūnaṃ – yāvassa bhikkhū āpattiṃ na passanti. Yato ca khvassa bhikkhū āpattiṃ passanti, tamenaṃ evaṃ jānanti – ‘samaṇadūsīvāyaṃ samaṇapalāpo samaṇakāraṇḍavo’ti. Tamenaṃ iti viditvā bahiddhā nāsenti. Taṃ kissa hetu? Mā aññe bhaddake bhikkhū dūsesīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, bhikkhave, puriso udapānapanāḷiyatthiko tiṇhaṃ kuṭhāriṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kudhāriṃ (syā. kaṃ. ka.)]"
      },
      " ādāya vanaṃ paviseyya. So yaṃ yadeva rukkhaṃ kuṭhāripāsena ākoṭeyya tattha yāni tāni rukkhāni daḷhāni sāravantāni tāni kuṭhāripāsena ākoṭitāni kakkhaḷaṃ paṭinadanti; yāni pana tāni rukkhāni antopūtīni avassutāni kasambujātāni tāni kuṭhāripāsena ākoṭitāni daddaraṃ paṭinadanti. Tamenaṃ mūle chindati, mūle chinditvā agge chindati, agge chinditvā anto suvisodhitaṃ visodheti, anto suvisodhitaṃ visodhetvā udapānapanāḷiṃ yojeti. Evamevaṃ kho, bhikkhave ",
      ", idhekaccassa puggalassa tādisaṃyeva hoti abhikkantaṃ paṭikkantaṃ ālokitaṃ vilokitaṃ samiñjitaṃ pasāritaṃ saṅghāṭipattacīvaradhāraṇaṃ, seyyathāpi aññesaṃ bhaddakānaṃ bhikkhūnaṃ – yāvassa bhikkhū āpattiṃ na passanti. Yato ca khvassa bhikkhū āpattiṃ passanti, tamenaṃ evaṃ ",
      " jānanti – ‘samaṇadūsīvāyaṃ samaṇapalāpo samaṇakāraṇḍavo’ti. Tamenaṃ iti viditvā bahiddhā nāsenti. Taṃ kissa hetu? Mā aññe bhaddake bhikkhū dūsesī’’ti."
    ],
    "innerText": "‘‘Seyyathāpi, bhikkhave, puriso udapānapanāḷiyatthiko tiṇhaṃ kuṭhāriṃ [kudhāriṃ (syā. kaṃ. ka.)] ādāya vanaṃ paviseyya. So yaṃ yadeva rukkhaṃ kuṭhāripāsena ākoṭeyya tattha yāni tāni rukkhāni daḷhāni sāravantāni tāni kuṭhāripāsena ākoṭitāni kakkhaḷaṃ paṭinadanti; yāni pana tāni rukkhāni antopūtīni avassutāni kasambujātāni tāni kuṭhāripāsena ākoṭitāni daddaraṃ paṭinadanti. Tamenaṃ mūle chindati, mūle chinditvā agge chindati, agge chinditvā anto suvisodhitaṃ visodheti, anto suvisodhitaṃ visodhetvā udapānapanāḷiṃ yojeti. Evamevaṃ kho, bhikkhave , idhekaccassa puggalassa tādisaṃyeva hoti abhikkantaṃ paṭikkantaṃ ālokitaṃ vilokitaṃ samiñjitaṃ pasāritaṃ saṅghāṭipattacīvaradhāraṇaṃ, seyyathāpi aññesaṃ bhaddakānaṃ bhikkhūnaṃ – yāvassa bhikkhū āpattiṃ na passanti. Yato ca khvassa bhikkhū āpattiṃ passanti, tamenaṃ evaṃ jānanti – ‘samaṇadūsīvāyaṃ samaṇapalāpo samaṇakāraṇḍavo’ti. Tamenaṃ iti viditvā bahiddhā nāsenti. Taṃ kissa hetu? Mā aññe bhaddake bhikkhū dūsesī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Saṃvāsāyaṃ ",
      " vijānātha, pāpiccho kodhano iti;"
    ],
    "innerText": "‘‘Saṃvāsāyaṃ vijānātha, pāpiccho kodhano iti;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Makkhī thambhī paḷāsī ca, issukī maccharī saṭho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Santavāco janavati, samaṇo viya bhāsati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Raho karoti karaṇaṃ, pāpadiṭṭhi anādaro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Saṃsappī ca musāvādī, taṃ viditvā yathātathaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Sabbe samaggā hutvāna, abhinibbajjayātha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[abhinibbijjayetha (ka.)]"
      },
      " naṃ."
    ],
    "innerText": "Sabbe samaggā hutvāna, abhinibbajjayātha [abhinibbijjayetha (ka.)] naṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Kāraṇḍavaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[karaṇḍavaṃ (ka.) su. ni. 283 passitabbaṃ]"
      },
      " niddhamatha, kasambuṃ apakassatha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[avakassatha (ka.)]"
      },
      ";"
    ],
    "innerText": "‘‘Kāraṇḍavaṃ [karaṇḍavaṃ (ka.) su. ni. 283 passitabbaṃ] niddhamatha, kasambuṃ apakassatha [avakassatha (ka.)];"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tato palāpe vāhetha, assamaṇe samaṇamānine."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Niddhamitvāna pāpicche, pāpaācāragocare;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Suddhāsuddhehi saṃvāsaṃ, kappayavho patissatā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tato samaggā nipakā, dukkhassantaṃ karissathā’’ti. dasamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Mettāvaggo paṭhamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Mettaṃ ",
      " paññā ca dve piyā, dve lokā dve vipattiyo;"
    ],
    "innerText": "Mettaṃ paññā ca dve piyā, dve lokā dve vipattiyo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Devadatto ca uttaro, nando kāraṇḍavena cāti."
  }
]