[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "(17) 2. Paṭipadāvaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Saṃkhittasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "161"
      },
      ". ‘‘Catasso ",
      " imā, bhikkhave, paṭipadā. Katamā catasso? Dukkhā paṭipadā dandhābhiññā, dukkhā paṭipadā khippābhiññā, sukhā paṭipadā dandhābhiññā, sukhā paṭipadā khippābhiññā – imā kho, bhikkhave, catasso paṭipadā’’ti. Paṭhamaṃ."
    ],
    "innerText": "161. ‘‘Catasso imā, bhikkhave, paṭipadā. Katamā catasso? Dukkhā paṭipadā dandhābhiññā, dukkhā paṭipadā khippābhiññā, sukhā paṭipadā dandhābhiññā, sukhā paṭipadā khippābhiññā – imā kho, bhikkhave, catasso paṭipadā’’ti. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Vitthārasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "162"
      },
      ". ‘‘Catasso imā, bhikkhave, paṭipadā. Katamā catasso? Dukkhā paṭipadā dandhābhiññā, dukkhā paṭipadā khippābhiññā, sukhā paṭipadā dandhābhiññā, sukhā paṭipadā khippābhiññā."
    ],
    "innerText": "162. ‘‘Catasso imā, bhikkhave, paṭipadā. Katamā catasso? Dukkhā paṭipadā dandhābhiññā, dukkhā paṭipadā khippābhiññā, sukhā paṭipadā dandhābhiññā, sukhā paṭipadā khippābhiññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamā ca, bhikkhave, dukkhā paṭipadā dandhābhiññā? Idha, bhikkhave, ekacco pakatiyāpi tibbarāgajātiko hoti, abhikkhaṇaṃ rāgajaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. Pakatiyāpi tibbadosajātiko hoti, abhikkhaṇaṃ dosajaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. Pakatiyāpi tibbamohajātiko hoti, abhikkhaṇaṃ mohajaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. Tassimāni pañcindriyāni mudūni pātubhavanti – saddhindriyaṃ, vīriyindriyaṃ, satindriyaṃ, samādhindriyaṃ, paññindriyaṃ. So imesaṃ pañcannaṃ indriyānaṃ muduttā dandhaṃ ānantariyaṃ pāpuṇāti āsavānaṃ khayāya. Ayaṃ vuccati, bhikkhave, dukkhā paṭipadā dandhābhiññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamā ca, bhikkhave, dukkhā paṭipadā khippābhiññā? Idha, bhikkhave, ekacco pakatiyāpi tibbarāgajātiko hoti, abhikkhaṇaṃ rāgajaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. Pakatiyāpi tibbadosajātiko hoti, abhikkhaṇaṃ dosajaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. Pakatiyāpi tibbamohajātiko hoti ",
      ", abhikkhaṇaṃ mohajaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. Tassimāni ",
      " pañcindriyāni adhimattāni ",
      " pātubhavanti – saddhindriyaṃ, vīriyindriyaṃ, satindriyaṃ, samādhindriyaṃ, paññindriyaṃ. So imesaṃ pañcannaṃ indriyānaṃ adhimattattā khippaṃ ānantariyaṃ pāpuṇāti āsavānaṃ khayāya. Ayaṃ vuccati, bhikkhave, dukkhā paṭipadā khippābhiññā."
    ],
    "innerText": "‘‘Katamā ca, bhikkhave, dukkhā paṭipadā khippābhiññā? Idha, bhikkhave, ekacco pakatiyāpi tibbarāgajātiko hoti, abhikkhaṇaṃ rāgajaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. Pakatiyāpi tibbadosajātiko hoti, abhikkhaṇaṃ dosajaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. Pakatiyāpi tibbamohajātiko hoti , abhikkhaṇaṃ mohajaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. Tassimāni pañcindriyāni adhimattāni pātubhavanti – saddhindriyaṃ, vīriyindriyaṃ, satindriyaṃ, samādhindriyaṃ, paññindriyaṃ. So imesaṃ pañcannaṃ indriyānaṃ adhimattattā khippaṃ ānantariyaṃ pāpuṇāti āsavānaṃ khayāya. Ayaṃ vuccati, bhikkhave, dukkhā paṭipadā khippābhiññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamā ca, bhikkhave, sukhā paṭipadā dandhābhiññā? Idha, bhikkhave, ekacco pakatiyāpi na tibbarāgajātiko hoti, nābhikkhaṇaṃ rāgajaṃ dukkhaṃ domanassaṃ ",
      " paṭisaṃvedeti. Pakatiyāpi na tibbadosajātiko hoti, nābhikkhaṇaṃ dosajaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. Pakatiyāpi na tibbamohajātiko hoti, nābhikkhaṇaṃ mohajaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. Tassimāni pañcindriyāni mudūni pātubhavanti – saddhindriyaṃ…pe… paññindriyaṃ. So imesaṃ pañcannaṃ indriyānaṃ muduttā dandhaṃ ānantariyaṃ pāpuṇāti āsavānaṃ khayāya. Ayaṃ vuccati, bhikkhave, sukhā paṭipadā dandhābhiññā."
    ],
    "innerText": "‘‘Katamā ca, bhikkhave, sukhā paṭipadā dandhābhiññā? Idha, bhikkhave, ekacco pakatiyāpi na tibbarāgajātiko hoti, nābhikkhaṇaṃ rāgajaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. Pakatiyāpi na tibbadosajātiko hoti, nābhikkhaṇaṃ dosajaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. Pakatiyāpi na tibbamohajātiko hoti, nābhikkhaṇaṃ mohajaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. Tassimāni pañcindriyāni mudūni pātubhavanti – saddhindriyaṃ…pe… paññindriyaṃ. So imesaṃ pañcannaṃ indriyānaṃ muduttā dandhaṃ ānantariyaṃ pāpuṇāti āsavānaṃ khayāya. Ayaṃ vuccati, bhikkhave, sukhā paṭipadā dandhābhiññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamā ca, bhikkhave, sukhā paṭipadā khippābhiññā? Idha, bhikkhave, ekacco pakatiyāpi na tibbarāgajātiko hoti, nābhikkhaṇaṃ rāgajaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. Pakatiyāpi na tibbadosajātiko hoti, nābhikkhaṇaṃ dosajaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. Pakatiyāpi na tibbamohajātiko hoti, nābhikkhaṇaṃ mohajaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. Tassimāni pañcindriyāni adhimattāni pātubhavanti – saddhindriyaṃ, vīriyindriyaṃ, satindriyaṃ, samādhindriyaṃ, paññindriyaṃ ",
      ". So imesaṃ pañcannaṃ indriyānaṃ adhimattattā khippaṃ ānantariyaṃ pāpuṇāti āsavānaṃ khayāya. Ayaṃ vuccati, bhikkhave, sukhā paṭipadā khippābhiññā. Imā kho, bhikkhave, catasso paṭipadā’’ti. Dutiyaṃ."
    ],
    "innerText": "‘‘Katamā ca, bhikkhave, sukhā paṭipadā khippābhiññā? Idha, bhikkhave, ekacco pakatiyāpi na tibbarāgajātiko hoti, nābhikkhaṇaṃ rāgajaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. Pakatiyāpi na tibbadosajātiko hoti, nābhikkhaṇaṃ dosajaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. Pakatiyāpi na tibbamohajātiko hoti, nābhikkhaṇaṃ mohajaṃ dukkhaṃ domanassaṃ paṭisaṃvedeti. Tassimāni pañcindriyāni adhimattāni pātubhavanti – saddhindriyaṃ, vīriyindriyaṃ, satindriyaṃ, samādhindriyaṃ, paññindriyaṃ . So imesaṃ pañcannaṃ indriyānaṃ adhimattattā khippaṃ ānantariyaṃ pāpuṇāti āsavānaṃ khayāya. Ayaṃ vuccati, bhikkhave, sukhā paṭipadā khippābhiññā. Imā kho, bhikkhave, catasso paṭipadā’’ti. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Asubhasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "163"
      },
      ". ‘‘Catasso imā, bhikkhave, paṭipadā. Katamā catasso? Dukkhā paṭipadā dandhābhiññā, dukkhā paṭipadā khippābhiññā, sukhā paṭipadā dandhābhiññā, sukhā paṭipadā khippābhiññā."
    ],
    "innerText": "163. ‘‘Catasso imā, bhikkhave, paṭipadā. Katamā catasso? Dukkhā paṭipadā dandhābhiññā, dukkhā paṭipadā khippābhiññā, sukhā paṭipadā dandhābhiññā, sukhā paṭipadā khippābhiññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamā ca, bhikkhave, dukkhā paṭipadā dandhābhiññā? Idha, bhikkhave, bhikkhu asubhānupassī ",
      " kāye viharati, āhāre paṭikūlasaññī ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[paṭikkūlasaññī (sī. syā. kaṃ. pī.)]"
      },
      ", sabbaloke anabhiratisaññī ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[anabhiratasaññī (sī. syā. kaṃ. pī.)]"
      },
      ", sabbasaṅkhāresu aniccānupassī; maraṇasaññā kho panassa ajjhattaṃ sūpaṭṭhitā hoti. So imāni pañca sekhabalāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sekkhabalāni (syā. kaṃ.)]"
      },
      " upanissāya viharati – saddhābalaṃ, hiribalaṃ, ottappabalaṃ, vīriyabalaṃ ",
      ", paññābalaṃ. Tassimāni pañcindriyāni mudūni pātubhavanti – saddhindriyaṃ, vīriyindriyaṃ, satindriyaṃ, samādhindriyaṃ, paññindriyaṃ. So imesaṃ pañcannaṃ indriyānaṃ muduttā dandhaṃ ānantariyaṃ pāpuṇāti āsavānaṃ khayāya. Ayaṃ vuccati, bhikkhave, dukkhā paṭipadā dandhābhiññā."
    ],
    "innerText": "‘‘Katamā ca, bhikkhave, dukkhā paṭipadā dandhābhiññā? Idha, bhikkhave, bhikkhu asubhānupassī kāye viharati, āhāre paṭikūlasaññī [paṭikkūlasaññī (sī. syā. kaṃ. pī.)], sabbaloke anabhiratisaññī [anabhiratasaññī (sī. syā. kaṃ. pī.)], sabbasaṅkhāresu aniccānupassī; maraṇasaññā kho panassa ajjhattaṃ sūpaṭṭhitā hoti. So imāni pañca sekhabalāni [sekkhabalāni (syā. kaṃ.)] upanissāya viharati – saddhābalaṃ, hiribalaṃ, ottappabalaṃ, vīriyabalaṃ , paññābalaṃ. Tassimāni pañcindriyāni mudūni pātubhavanti – saddhindriyaṃ, vīriyindriyaṃ, satindriyaṃ, samādhindriyaṃ, paññindriyaṃ. So imesaṃ pañcannaṃ indriyānaṃ muduttā dandhaṃ ānantariyaṃ pāpuṇāti āsavānaṃ khayāya. Ayaṃ vuccati, bhikkhave, dukkhā paṭipadā dandhābhiññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamā ",
      " ca, bhikkhave, dukkhā paṭipadā khippābhiññā? Idha, bhikkhave, bhikkhu asubhānupassī kāye viharati, āhāre paṭikūlasaññī, sabbaloke anabhiratisaññī, sabbasaṅkhāresu aniccānupassī; maraṇasaññā kho panassa ajjhattaṃ sūpaṭṭhitā hoti. So imāni pañca sekhabalāni upanissāya viharati – saddhābalaṃ…pe… paññābalaṃ. Tassimāni pañcindriyāni adhimattāni pātubhavanti – saddhindriyaṃ…pe… ",
      " paññindriyaṃ. So imesaṃ pañcannaṃ indriyānaṃ adhimattattā khippaṃ ānantariyaṃ pāpuṇāti āsavānaṃ khayāya. Ayaṃ vuccati, bhikkhave, dukkhā paṭipadā khippābhiññā."
    ],
    "innerText": "‘‘Katamā ca, bhikkhave, dukkhā paṭipadā khippābhiññā? Idha, bhikkhave, bhikkhu asubhānupassī kāye viharati, āhāre paṭikūlasaññī, sabbaloke anabhiratisaññī, sabbasaṅkhāresu aniccānupassī; maraṇasaññā kho panassa ajjhattaṃ sūpaṭṭhitā hoti. So imāni pañca sekhabalāni upanissāya viharati – saddhābalaṃ…pe… paññābalaṃ. Tassimāni pañcindriyāni adhimattāni pātubhavanti – saddhindriyaṃ…pe… paññindriyaṃ. So imesaṃ pañcannaṃ indriyānaṃ adhimattattā khippaṃ ānantariyaṃ pāpuṇāti āsavānaṃ khayāya. Ayaṃ vuccati, bhikkhave, dukkhā paṭipadā khippābhiññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamā ca, bhikkhave, sukhā paṭipadā dandhābhiññā? Idha bhikkhave, bhikkhu vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati; vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja viharati; pītiyā ca virāgā upekkhako ca viharati sato ca sampajāno sukhañca kāyena paṭisaṃvedeti yaṃ taṃ ariyā ācikkhanti – ‘upekkhako satimā sukhavihārī’ti tatiyaṃ jhānaṃ upasampajja viharati; sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharati. So imāni pañca sekhabalāni upanissāya viharati – saddhābalaṃ…pe… paññābalaṃ. Tassimāni pañcindriyāni mudūni pātubhavanti – saddhindriyaṃ…pe… paññindriyaṃ. So imesaṃ pañcannaṃ indriyānaṃ muduttā dandhaṃ ānantariyaṃ pāpuṇāti āsavānaṃ khayāya. Ayaṃ vuccati, bhikkhave, sukhā paṭipadā dandhābhiññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamā ",
      " ca, bhikkhave, sukhā paṭipadā khippābhiññā? ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kathā. 815 ādayo]"
      },
      " Idha, bhikkhave, bhikkhu vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati…pe… dutiyaṃ jhānaṃ…pe… ",
      " tatiyaṃ jhānaṃ…pe… ",
      " catutthaṃ jhānaṃ upasampajja viharati. So imāni pañca sekhabalāni upanissāya viharati – saddhābalaṃ, hiribalaṃ, ottappabalaṃ, vīriyabalaṃ, paññābalaṃ. Tassimāni pañcindriyāni adhimattāni pātubhavanti – saddhindriyaṃ, vīriyindriyaṃ, satindriyaṃ, samādhindriyaṃ, paññindriyaṃ. So imesaṃ pañcannaṃ indriyānaṃ adhimattattā khippaṃ ānantariyaṃ pāpuṇāti āsavānaṃ khayāya. Ayaṃ vuccati, bhikkhave, sukhā paṭipadā khippābhiññā. Imā kho, bhikkhave, catasso paṭipadā’’ti. Tatiyaṃ."
    ],
    "innerText": "‘‘Katamā ca, bhikkhave, sukhā paṭipadā khippābhiññā? [kathā. 815 ādayo] Idha, bhikkhave, bhikkhu vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati…pe… dutiyaṃ jhānaṃ…pe… tatiyaṃ jhānaṃ…pe… catutthaṃ jhānaṃ upasampajja viharati. So imāni pañca sekhabalāni upanissāya viharati – saddhābalaṃ, hiribalaṃ, ottappabalaṃ, vīriyabalaṃ, paññābalaṃ. Tassimāni pañcindriyāni adhimattāni pātubhavanti – saddhindriyaṃ, vīriyindriyaṃ, satindriyaṃ, samādhindriyaṃ, paññindriyaṃ. So imesaṃ pañcannaṃ indriyānaṃ adhimattattā khippaṃ ānantariyaṃ pāpuṇāti āsavānaṃ khayāya. Ayaṃ vuccati, bhikkhave, sukhā paṭipadā khippābhiññā. Imā kho, bhikkhave, catasso paṭipadā’’ti. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Paṭhamakhamasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "164"
      },
      ". ‘‘Catasso ",
      " imā, bhikkhave, paṭipadā. Katamā catasso? Akkhamā paṭipadā, khamā paṭipadā, damā paṭipadā, samā paṭipadā. Katamā ca, bhikkhave, akkhamā paṭipadā? Idha, bhikkhave, ekacco ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ekacco puggalo (sī. syā. kaṃ.)]"
      },
      " akkosantaṃ paccakkosati, rosantaṃ paṭirosati, bhaṇḍantaṃ paṭibhaṇḍati. Ayaṃ vuccati, bhikkhave, akkhamā paṭipadā."
    ],
    "innerText": "164. ‘‘Catasso imā, bhikkhave, paṭipadā. Katamā catasso? Akkhamā paṭipadā, khamā paṭipadā, damā paṭipadā, samā paṭipadā. Katamā ca, bhikkhave, akkhamā paṭipadā? Idha, bhikkhave, ekacco [ekacco puggalo (sī. syā. kaṃ.)] akkosantaṃ paccakkosati, rosantaṃ paṭirosati, bhaṇḍantaṃ paṭibhaṇḍati. Ayaṃ vuccati, bhikkhave, akkhamā paṭipadā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamā ca, bhikkhave, khamā paṭipadā? Idha, bhikkhave, ekacco akkosantaṃ na paccakkosati, rosantaṃ na paṭirosati, bhaṇḍantaṃ na paṭibhaṇḍati. Ayaṃ vuccati, bhikkhave, khamā paṭipadā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamā ca, bhikkhave, damā paṭipadā? Idha, bhikkhave, bhikkhu cakkhunā rūpaṃ disvā na nimittaggāhī hoti nānubyañjanaggāhī; yatvādhikaraṇamenaṃ cakkhundriyaṃ asaṃvutaṃ viharantaṃ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṃ, tassa saṃvarāya ",
      " paṭipajjati; rakkhati cakkhundriyaṃ; cakkhundriye saṃvaraṃ āpajjati. Sotena saddaṃ sutvā… ghānena ",
      " gandhaṃ ghāyitvā… jivhāya rasaṃ sāyitvā… kāyena phoṭṭhabbaṃ phusitvā… manasā dhammaṃ viññāya na nimittaggāhī hoti nānubyañjanaggāhī; yatvādhikaraṇamenaṃ manindriyaṃ asaṃvutaṃ viharantaṃ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṃ, tassa saṃvarāya paṭipajjati ",
      "; rakkhati manindriyaṃ; manindriye saṃvaraṃ āpajjati. Ayaṃ vuccati, bhikkhave, damā paṭipadā."
    ],
    "innerText": "‘‘Katamā ca, bhikkhave, damā paṭipadā? Idha, bhikkhave, bhikkhu cakkhunā rūpaṃ disvā na nimittaggāhī hoti nānubyañjanaggāhī; yatvādhikaraṇamenaṃ cakkhundriyaṃ asaṃvutaṃ viharantaṃ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṃ, tassa saṃvarāya paṭipajjati; rakkhati cakkhundriyaṃ; cakkhundriye saṃvaraṃ āpajjati. Sotena saddaṃ sutvā… ghānena gandhaṃ ghāyitvā… jivhāya rasaṃ sāyitvā… kāyena phoṭṭhabbaṃ phusitvā… manasā dhammaṃ viññāya na nimittaggāhī hoti nānubyañjanaggāhī; yatvādhikaraṇamenaṃ manindriyaṃ asaṃvutaṃ viharantaṃ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṃ, tassa saṃvarāya paṭipajjati ; rakkhati manindriyaṃ; manindriye saṃvaraṃ āpajjati. Ayaṃ vuccati, bhikkhave, damā paṭipadā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamā ca, bhikkhave, samā paṭipadā? Idha, bhikkhave, bhikkhu uppannaṃ kāmavitakkaṃ nādhivāseti pajahati vinodeti sameti byantīkaroti anabhāvaṃ gameti; uppannaṃ byāpādavitakkaṃ…pe… uppannaṃ vihiṃsāvitakkaṃ… uppannuppanne pāpake akusale dhamme nādhivāseti pajahati vinodeti sameti byantīkaroti anabhāvaṃ gameti. Ayaṃ vuccati, bhikkhave, samā paṭipadā. Imā kho, bhikkhave, catasso paṭipadā’’ti. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Dutiyakhamasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "165"
      },
      ". ‘‘Catasso imā, bhikkhave, paṭipadā. Katamā catasso? Akkhamā paṭipadā, khamā paṭipadā, damā paṭipadā, samā paṭipadā."
    ],
    "innerText": "165. ‘‘Catasso imā, bhikkhave, paṭipadā. Katamā catasso? Akkhamā paṭipadā, khamā paṭipadā, damā paṭipadā, samā paṭipadā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamā ",
      " ca, bhikkhave, akkhamā paṭipadā? Idha, bhikkhave, ekacco akkhamo hoti sītassa uṇhassa jighacchāya pipāsāya, ḍaṃsamakasavātātapasarīsapasamphassānaṃ duruttānaṃ durāgatānaṃ vacanapathānaṃ uppannānaṃ sārīrikānaṃ vedanānaṃ dukkhānaṃ tibbānaṃ kharānaṃ kaṭukānaṃ asātānaṃ amanāpānaṃ pāṇaharānaṃ anadhivāsakajātiko hoti. Ayaṃ vuccati, bhikkhave, akkhamā paṭipadā ",
      "."
    ],
    "innerText": "‘‘Katamā ca, bhikkhave, akkhamā paṭipadā? Idha, bhikkhave, ekacco akkhamo hoti sītassa uṇhassa jighacchāya pipāsāya, ḍaṃsamakasavātātapasarīsapasamphassānaṃ duruttānaṃ durāgatānaṃ vacanapathānaṃ uppannānaṃ sārīrikānaṃ vedanānaṃ dukkhānaṃ tibbānaṃ kharānaṃ kaṭukānaṃ asātānaṃ amanāpānaṃ pāṇaharānaṃ anadhivāsakajātiko hoti. Ayaṃ vuccati, bhikkhave, akkhamā paṭipadā ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamā ca, bhikkhave, khamā paṭipadā? Idha, bhikkhave, ekacco khamo hoti sītassa uṇhassa jighacchāya pipāsāya, ḍaṃsamakasavātātapasarīsapasamphassānaṃ duruttānaṃ durāgatānaṃ vacanapathānaṃ uppannānaṃ sārīrikānaṃ vedanānaṃ dukkhānaṃ tibbānaṃ kharānaṃ kaṭukānaṃ asātānaṃ amanāpānaṃ pāṇaharānaṃ adhivāsakajātiko hoti. Ayaṃ vuccati, bhikkhave, khamā paṭipadā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamā ",
      " ca, bhikkhave, damā paṭipadā? Idha, bhikkhave, bhikkhu cakkhunā rūpaṃ disvā na nimittaggāhī hoti…pe… sotena saddaṃ sutvā… ghānena gandhaṃ ghāyitvā… jivhāya rasaṃ sāyitvā… kāyena phoṭṭhabbaṃ phusitvā… manasā dhammaṃ viññāya na nimittaggāhī hoti nānubyañjanaggāhī; yatvādhikaraṇamenaṃ manindriyaṃ asaṃvutaṃ viharantaṃ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṃ, tassa saṃvarāya paṭipajjati; rakkhati manindriyaṃ; manindriye saṃvaraṃ āpajjati. Ayaṃ vuccati, bhikkhave, damā paṭipadā."
    ],
    "innerText": "‘‘Katamā ca, bhikkhave, damā paṭipadā? Idha, bhikkhave, bhikkhu cakkhunā rūpaṃ disvā na nimittaggāhī hoti…pe… sotena saddaṃ sutvā… ghānena gandhaṃ ghāyitvā… jivhāya rasaṃ sāyitvā… kāyena phoṭṭhabbaṃ phusitvā… manasā dhammaṃ viññāya na nimittaggāhī hoti nānubyañjanaggāhī; yatvādhikaraṇamenaṃ manindriyaṃ asaṃvutaṃ viharantaṃ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṃ, tassa saṃvarāya paṭipajjati; rakkhati manindriyaṃ; manindriye saṃvaraṃ āpajjati. Ayaṃ vuccati, bhikkhave, damā paṭipadā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamā ca, bhikkhave, samā paṭipadā? Idha, bhikkhave, bhikkhu uppannaṃ kāmavitakkaṃ nādhivāseti pajahati vinodeti sameti byantīkaroti anabhāvaṃ gameti, uppannaṃ byāpādavitakkaṃ…pe… uppannaṃ vihiṃsāvitakkaṃ… uppannuppanne pāpake akusale dhamme nādhivāseti pajahati vinodeti sameti byantīkaroti anabhāvaṃ gameti. Ayaṃ ",
      " vuccati, bhikkhave, samā paṭipadā. Imā kho, bhikkhave, catasso paṭipadā’’ti. Pañcamaṃ."
    ],
    "innerText": "‘‘Katamā ca, bhikkhave, samā paṭipadā? Idha, bhikkhave, bhikkhu uppannaṃ kāmavitakkaṃ nādhivāseti pajahati vinodeti sameti byantīkaroti anabhāvaṃ gameti, uppannaṃ byāpādavitakkaṃ…pe… uppannaṃ vihiṃsāvitakkaṃ… uppannuppanne pāpake akusale dhamme nādhivāseti pajahati vinodeti sameti byantīkaroti anabhāvaṃ gameti. Ayaṃ vuccati, bhikkhave, samā paṭipadā. Imā kho, bhikkhave, catasso paṭipadā’’ti. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Ubhayasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "166"
      },
      ". ‘‘Catasso ",
      " imā, bhikkhave, paṭipadā. Katamā catasso? Dukkhā paṭipadā dandhābhiññā, dukkhā paṭipadā khippābhiññā, sukhā paṭipadā dandhābhiññā, sukhā paṭipadā khippābhiññā."
    ],
    "innerText": "166. ‘‘Catasso imā, bhikkhave, paṭipadā. Katamā catasso? Dukkhā paṭipadā dandhābhiññā, dukkhā paṭipadā khippābhiññā, sukhā paṭipadā dandhābhiññā, sukhā paṭipadā khippābhiññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tatra ",
      ", bhikkhave, yāyaṃ paṭipadā dukkhā dandhābhiññā, ayaṃ, bhikkhave, paṭipadā ubhayeneva hīnā akkhāyati. Yampāyaṃ paṭipadā dukkhā, imināpāyaṃ hīnā akkhāyati; yampāyaṃ paṭipadā dandhā, imināpāyaṃ hīnā akkhāyati. Ayaṃ, bhikkhave, paṭipadā ubhayeneva hīnā akkhāyati."
    ],
    "innerText": "‘‘Tatra , bhikkhave, yāyaṃ paṭipadā dukkhā dandhābhiññā, ayaṃ, bhikkhave, paṭipadā ubhayeneva hīnā akkhāyati. Yampāyaṃ paṭipadā dukkhā, imināpāyaṃ hīnā akkhāyati; yampāyaṃ paṭipadā dandhā, imināpāyaṃ hīnā akkhāyati. Ayaṃ, bhikkhave, paṭipadā ubhayeneva hīnā akkhāyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tatra, bhikkhave, yāyaṃ paṭipadā dukkhā khippābhiññā, ayaṃ, bhikkhave, paṭipadā dukkhattā hīnā akkhāyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tatra ",
      ", bhikkhave, yāyaṃ paṭipadā sukhā dandhābhiññā, ayaṃ, bhikkhave, paṭipadā dandhattā hīnā akkhāyati."
    ],
    "innerText": "‘‘Tatra , bhikkhave, yāyaṃ paṭipadā sukhā dandhābhiññā, ayaṃ, bhikkhave, paṭipadā dandhattā hīnā akkhāyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tatra, bhikkhave, yāyaṃ paṭipadā sukhā khippābhiññā, ayaṃ, bhikkhave, paṭipadā ubhayeneva paṇītā akkhāyati. Yampāyaṃ paṭipadā sukhā, imināpāyaṃ paṇītā akkhāyati; yampāyaṃ paṭipadā khippā, imināpāyaṃ paṇītā akkhāyati. Ayaṃ, bhikkhave, paṭipadā ubhayeneva paṇītā akkhāyati. Imā kho, bhikkhave, catasso paṭipadā’’ti. Chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Mahāmoggallānasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "167"
      },
      ". Atha kho āyasmā sāriputto yenāyasmā mahāmoggallāno tenupasaṅkami; upasaṅkamitvā āyasmatā mahāmoggallānena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi ",
      ". Ekamantaṃ nisinno kho āyasmā sāriputto āyasmantaṃ mahāmoggallānaṃ etadavoca –"
    ],
    "innerText": "167. Atha kho āyasmā sāriputto yenāyasmā mahāmoggallāno tenupasaṅkami; upasaṅkamitvā āyasmatā mahāmoggallānena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi . Ekamantaṃ nisinno kho āyasmā sāriputto āyasmantaṃ mahāmoggallānaṃ etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Catasso imā, āvuso moggallāna, paṭipadā. Katamā catasso? Dukkhā paṭipadā dandhābhiññā, dukkhā paṭipadā khippābhiññā, sukhā paṭipadā dandhābhiññā, sukhā paṭipadā khippābhiññā. Imā kho, āvuso, catasso paṭipadā ",
      ". Imāsaṃ, āvuso, catunnaṃ paṭipadānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[catassannaṃ paṭipadānaṃ (sī. syā. kaṃ.)]"
      },
      " katamaṃ te paṭipadaṃ āgamma anupādāya āsavehi cittaṃ vimutta’’nti?"
    ],
    "innerText": "‘‘Catasso imā, āvuso moggallāna, paṭipadā. Katamā catasso? Dukkhā paṭipadā dandhābhiññā, dukkhā paṭipadā khippābhiññā, sukhā paṭipadā dandhābhiññā, sukhā paṭipadā khippābhiññā. Imā kho, āvuso, catasso paṭipadā . Imāsaṃ, āvuso, catunnaṃ paṭipadānaṃ [catassannaṃ paṭipadānaṃ (sī. syā. kaṃ.)] katamaṃ te paṭipadaṃ āgamma anupādāya āsavehi cittaṃ vimutta’’nti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Catasso ",
      " imā, āvuso sāriputta, paṭipadā. Katamā catasso? Dukkhā paṭipadā dandhābhiññā, dukkhā paṭipadā khippābhiññā, sukhā paṭipadā dandhābhiññā, sukhā paṭipadā khippābhiññā. Imā kho, āvuso, catasso paṭipadā ",
      ". Imāsaṃ, āvuso, catunnaṃ paṭipadānaṃ yāyaṃ paṭipadā dukkhā khippābhiññā, imaṃ me paṭipadaṃ āgamma anupādāya āsavehi cittaṃ vimutta’’nti. Sattamaṃ."
    ],
    "innerText": "‘‘Catasso imā, āvuso sāriputta, paṭipadā. Katamā catasso? Dukkhā paṭipadā dandhābhiññā, dukkhā paṭipadā khippābhiññā, sukhā paṭipadā dandhābhiññā, sukhā paṭipadā khippābhiññā. Imā kho, āvuso, catasso paṭipadā . Imāsaṃ, āvuso, catunnaṃ paṭipadānaṃ yāyaṃ paṭipadā dukkhā khippābhiññā, imaṃ me paṭipadaṃ āgamma anupādāya āsavehi cittaṃ vimutta’’nti. Sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Sāriputtasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "168"
      },
      ". Atha ",
      " kho āyasmā mahāmoggallāno yenāyasmā sāriputto tenupasaṅkami; upasaṅkamitvā āyasmatā sāriputtena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā mahāmoggallāno āyasmantaṃ sāriputtaṃ etadavoca –"
    ],
    "innerText": "168. Atha kho āyasmā mahāmoggallāno yenāyasmā sāriputto tenupasaṅkami; upasaṅkamitvā āyasmatā sāriputtena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā mahāmoggallāno āyasmantaṃ sāriputtaṃ etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Catasso imā, āvuso sāriputta, paṭipadā. Katamā catasso? Dukkhā paṭipadā dandhābhiññā, dukkhā paṭipadā khippābhiññā, sukhā paṭipadā dandhābhiññā, sukhā paṭipadā khippābhiññā. Imā kho, āvuso, catasso paṭipadā. Imāsaṃ, āvuso, catunnaṃ paṭipadānaṃ ",
      " katamaṃ te paṭipadaṃ āgamma anupādāya āsavehi cittaṃ vimutta’’nti?"
    ],
    "innerText": "‘‘Catasso imā, āvuso sāriputta, paṭipadā. Katamā catasso? Dukkhā paṭipadā dandhābhiññā, dukkhā paṭipadā khippābhiññā, sukhā paṭipadā dandhābhiññā, sukhā paṭipadā khippābhiññā. Imā kho, āvuso, catasso paṭipadā. Imāsaṃ, āvuso, catunnaṃ paṭipadānaṃ katamaṃ te paṭipadaṃ āgamma anupādāya āsavehi cittaṃ vimutta’’nti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Catasso imā, āvuso moggallāna, paṭipadā. Katamā catasso? Dukkhā paṭipadā dandhābhiññā, dukkhā paṭipadā khippābhiññā, sukhā paṭipadā dandhābhiññā, sukhā paṭipadā khippābhiññā. Imā kho, āvuso, catasso paṭipadā. Imāsaṃ, āvuso, catunnaṃ paṭipadānaṃ yāyaṃ paṭipadā sukhā khippābhiññā, imaṃ me paṭipadaṃ āgamma anupādāya āsavehi cittaṃ vimutta’’nti. Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Sasaṅkhārasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "169"
      },
      ". ‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Idha, bhikkhave, ekacco puggalo diṭṭheva dhamme sasaṅkhāraparinibbāyī hoti. Idha pana, bhikkhave, ekacco puggalo kāyassa bhedā sasaṅkhāraparinibbāyī hoti. Idha pana, bhikkhave, ekacco puggalo diṭṭheva dhamme asaṅkhāraparinibbāyī hoti. Idha pana, bhikkhave, ekacco puggalo kāyassa bhedā asaṅkhāraparinibbāyī hoti."
    ],
    "innerText": "169. ‘‘Cattārome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Idha, bhikkhave, ekacco puggalo diṭṭheva dhamme sasaṅkhāraparinibbāyī hoti. Idha pana, bhikkhave, ekacco puggalo kāyassa bhedā sasaṅkhāraparinibbāyī hoti. Idha pana, bhikkhave, ekacco puggalo diṭṭheva dhamme asaṅkhāraparinibbāyī hoti. Idha pana, bhikkhave, ekacco puggalo kāyassa bhedā asaṅkhāraparinibbāyī hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, puggalo diṭṭheva dhamme sasaṅkhāraparinibbāyī hoti? Idha, bhikkhave, bhikkhu asubhānupassī kāye viharati, āhāre paṭikūlasaññī, sabbaloke anabhiratisaññī, sabbasaṅkhāresu ",
      " aniccānupassī. Maraṇasaññā ",
      " kho panassa ajjhattaṃ ",
      " sūpaṭṭhitā hoti. So imāni pañca sekhabalāni upanissāya viharati – saddhābalaṃ, hiribalaṃ, ottappabalaṃ, vīriyabalaṃ, paññābalaṃ ",
      ". Tassimāni pañcindriyāni adhimattāni pātubhavanti – saddhindriyaṃ, vīriyindriyaṃ, satindriyaṃ, samādhindriyaṃ, paññindriyaṃ. So imesaṃ pañcannaṃ indriyānaṃ adhimattattā diṭṭheva dhamme sasaṅkhāraparinibbāyī hoti. Evaṃ kho, bhikkhave, puggalo diṭṭheva dhamme sasaṅkhāraparinibbāyī hoti."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, puggalo diṭṭheva dhamme sasaṅkhāraparinibbāyī hoti? Idha, bhikkhave, bhikkhu asubhānupassī kāye viharati, āhāre paṭikūlasaññī, sabbaloke anabhiratisaññī, sabbasaṅkhāresu aniccānupassī. Maraṇasaññā kho panassa ajjhattaṃ sūpaṭṭhitā hoti. So imāni pañca sekhabalāni upanissāya viharati – saddhābalaṃ, hiribalaṃ, ottappabalaṃ, vīriyabalaṃ, paññābalaṃ . Tassimāni pañcindriyāni adhimattāni pātubhavanti – saddhindriyaṃ, vīriyindriyaṃ, satindriyaṃ, samādhindriyaṃ, paññindriyaṃ. So imesaṃ pañcannaṃ indriyānaṃ adhimattattā diṭṭheva dhamme sasaṅkhāraparinibbāyī hoti. Evaṃ kho, bhikkhave, puggalo diṭṭheva dhamme sasaṅkhāraparinibbāyī hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, puggalo kāyassa bhedā sasaṅkhāraparinibbāyī hoti? Idha, bhikkhave, bhikkhu asubhānupassī kāye viharati, āhāre paṭikūlasaññī, sabbaloke anabhiratisaññī, sabbasaṅkhāresu aniccānupassī. Maraṇasaññā kho panassa ajjhattaṃ sūpaṭṭhitā hoti. So imāni pañca sekhabalāni upanissāya viharati – saddhābalaṃ, hiribalaṃ, ottappabalaṃ, vīriyabalaṃ, paññābalaṃ. Tassimāni pañcindriyāni mudūni pātubhavanti – saddhindriyaṃ, vīriyindriyaṃ, satindriyaṃ, samādhindriyaṃ, paññindriyaṃ. So imesaṃ pañcannaṃ indriyānaṃ muduttā kāyassa bhedā sasaṅkhāraparinibbāyī hoti. Evaṃ kho, bhikkhave, puggalo kāyassa bhedā sasaṅkhāraparinibbāyī hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, puggalo diṭṭheva dhamme asaṅkhāraparinibbāyī hoti? Idha, bhikkhave, bhikkhu vivicceva kāmehi…pe… paṭhamaṃ jhānaṃ…pe… dutiyaṃ jhānaṃ…pe… tatiyaṃ jhānaṃ…pe… catutthaṃ jhānaṃ upasampajja viharati. So imāni pañca sekhabalāni upanissāya viharati – saddhābalaṃ…pe… ",
      " paññābalaṃ. Tassimāni pañcindriyāni adhimattāni pātubhavanti – saddhindriyaṃ…pe… paññindriyaṃ. So imesaṃ pañcannaṃ indriyānaṃ adhimattattā diṭṭheva dhamme asaṅkhāraparinibbāyī hoti. Evaṃ kho, bhikkhave, puggalo diṭṭheva dhamme asaṅkhāraparinibbāyī hoti."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, puggalo diṭṭheva dhamme asaṅkhāraparinibbāyī hoti? Idha, bhikkhave, bhikkhu vivicceva kāmehi…pe… paṭhamaṃ jhānaṃ…pe… dutiyaṃ jhānaṃ…pe… tatiyaṃ jhānaṃ…pe… catutthaṃ jhānaṃ upasampajja viharati. So imāni pañca sekhabalāni upanissāya viharati – saddhābalaṃ…pe… paññābalaṃ. Tassimāni pañcindriyāni adhimattāni pātubhavanti – saddhindriyaṃ…pe… paññindriyaṃ. So imesaṃ pañcannaṃ indriyānaṃ adhimattattā diṭṭheva dhamme asaṅkhāraparinibbāyī hoti. Evaṃ kho, bhikkhave, puggalo diṭṭheva dhamme asaṅkhāraparinibbāyī hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, puggalo kāyassa bhedā asaṅkhāraparinibbāyī hoti? Idha, bhikkhave ",
      ", bhikkhu vivicceva kāmehi…pe… paṭhamaṃ jhānaṃ…pe… dutiyaṃ jhānaṃ…pe… tatiyaṃ jhānaṃ…pe… catutthaṃ jhānaṃ upasampajja viharati. So imāni pañca sekhabalāni upanissāya viharati – saddhābalaṃ, hiribalaṃ, ottappabalaṃ, vīriyabalaṃ, paññābalaṃ. Tassimāni pañcindriyāni…pe… paññindriyaṃ. So imesaṃ pañcannaṃ indriyānaṃ muduttā kāyassa bhedā asaṅkhāraparinibbāyī hoti. Evaṃ kho, bhikkhave, puggalo kāyassa bhedā asaṅkhāraparinibbāyī hoti. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Navamaṃ."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, puggalo kāyassa bhedā asaṅkhāraparinibbāyī hoti? Idha, bhikkhave , bhikkhu vivicceva kāmehi…pe… paṭhamaṃ jhānaṃ…pe… dutiyaṃ jhānaṃ…pe… tatiyaṃ jhānaṃ…pe… catutthaṃ jhānaṃ upasampajja viharati. So imāni pañca sekhabalāni upanissāya viharati – saddhābalaṃ, hiribalaṃ, ottappabalaṃ, vīriyabalaṃ, paññābalaṃ. Tassimāni pañcindriyāni…pe… paññindriyaṃ. So imesaṃ pañcannaṃ indriyānaṃ muduttā kāyassa bhedā asaṅkhāraparinibbāyī hoti. Evaṃ kho, bhikkhave, puggalo kāyassa bhedā asaṅkhāraparinibbāyī hoti. Ime kho, bhikkhave, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Yuganaddhasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "170"
      },
      ". Evaṃ ",
      " me sutaṃ – ekaṃ samayaṃ āyasmā ānando kosambiyaṃ viharati ghositārāme. Tatra kho āyasmā ānando bhikkhū āmantesi – ‘‘āvuso bhikkhave’’ti. ‘‘Āvuso’’ti kho te bhikkhū āyasmato ānandassa paccassosuṃ. Āyasmā ",
      " ānando etadavoca –"
    ],
    "innerText": "170. Evaṃ me sutaṃ – ekaṃ samayaṃ āyasmā ānando kosambiyaṃ viharati ghositārāme. Tatra kho āyasmā ānando bhikkhū āmantesi – ‘‘āvuso bhikkhave’’ti. ‘‘Āvuso’’ti kho te bhikkhū āyasmato ānandassa paccassosuṃ. Āyasmā ānando etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yo ",
      " hi koci, āvuso, bhikkhu vā bhikkhunī vā mama santike arahattappattiṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[arahattappattaṃ (ka.) paṭi. ma. 2.1 paṭisambhidāmaggepi]"
      },
      " byākaroti, sabbo so catūhi maggehi, etesaṃ vā aññatarena."
    ],
    "innerText": "‘‘Yo hi koci, āvuso, bhikkhu vā bhikkhunī vā mama santike arahattappattiṃ [arahattappattaṃ (ka.) paṭi. ma. 2.1 paṭisambhidāmaggepi] byākaroti, sabbo so catūhi maggehi, etesaṃ vā aññatarena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamehi catūhi? Idha, āvuso, bhikkhu samathapubbaṅgamaṃ vipassanaṃ bhāveti. Tassa samathapubbaṅgamaṃ vipassanaṃ bhāvayato maggo sañjāyati. So taṃ maggaṃ āsevati bhāveti bahulīkaroti. Tassa taṃ maggaṃ āsevato bhāvayato bahulīkaroto saṃyojanāni pahīyanti, anusayā byantīhonti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, āvuso, bhikkhu vipassanāpubbaṅgamaṃ samathaṃ bhāveti. Tassa vipassanāpubbaṅgamaṃ samathaṃ bhāvayato maggo sañjāyati. So taṃ maggaṃ āsevati bhāveti bahulīkaroti ",
      ". Tassa taṃ maggaṃ āsevato bhāvayato bahulīkaroto saṃyojanāni pahīyanti, anusayā byantīhonti."
    ],
    "innerText": "‘‘Puna caparaṃ, āvuso, bhikkhu vipassanāpubbaṅgamaṃ samathaṃ bhāveti. Tassa vipassanāpubbaṅgamaṃ samathaṃ bhāvayato maggo sañjāyati. So taṃ maggaṃ āsevati bhāveti bahulīkaroti . Tassa taṃ maggaṃ āsevato bhāvayato bahulīkaroto saṃyojanāni pahīyanti, anusayā byantīhonti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, āvuso, bhikkhu samathavipassanaṃ yuganaddhaṃ bhāveti. Tassa samathavipassanaṃ yuganaddhaṃ bhāvayato maggo sañjāyati. So taṃ maggaṃ āsevati bhāveti bahulīkaroti. Tassa taṃ maggaṃ āsevato bhāvayato bahulīkaroto saṃyojanāni pahīyanti, anusayā byantīhonti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, āvuso, bhikkhuno dhammuddhaccaviggahitaṃ mānasaṃ hoti. Hoti so, āvuso, samayo yaṃ taṃ cittaṃ ajjhattameva santiṭṭhati sannisīdati ekodi hoti samādhiyati. Tassa maggo sañjāyati. So taṃ maggaṃ āsevati bhāveti bahulīkaroti. Tassa taṃ maggaṃ āsevato bhāvayato ",
      " bahulīkaroto saṃyojanāni pahīyanti, anusayā byantīhonti."
    ],
    "innerText": "‘‘Puna caparaṃ, āvuso, bhikkhuno dhammuddhaccaviggahitaṃ mānasaṃ hoti. Hoti so, āvuso, samayo yaṃ taṃ cittaṃ ajjhattameva santiṭṭhati sannisīdati ekodi hoti samādhiyati. Tassa maggo sañjāyati. So taṃ maggaṃ āsevati bhāveti bahulīkaroti. Tassa taṃ maggaṃ āsevato bhāvayato bahulīkaroto saṃyojanāni pahīyanti, anusayā byantīhonti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yo hi koci, āvuso, bhikkhu vā bhikkhunī vā mama santike arahattappattiṃ ",
      " byākaroti, sabbo so imehi catūhi maggehi, etesaṃ vā aññatarenā’’ti. Dasamaṃ."
    ],
    "innerText": "‘‘Yo hi koci, āvuso, bhikkhu vā bhikkhunī vā mama santike arahattappattiṃ byākaroti, sabbo so imehi catūhi maggehi, etesaṃ vā aññatarenā’’ti. Dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṭipadāvaggo dutiyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Saṃkhittaṃ vitthārāsubhaṃ, dve khamā ubhayena ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Moggallāno sāriputto, sasaṅkhāraṃ yuganaddhena cāti."
  }
]