[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "2. Mahāvaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Verañjasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "11"
      },
      ". Dutiyassa paṭhame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhivādetī"
      },
      "ti evamādīni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na samaṇo gotamo"
      },
      "ti ettha vuttanakārena yojetvā evamettha attho veditabbo ",
      " ‘‘na vandati nāsanā vuṭṭhāti, nāpi ‘idha bhonto nisīdantū’ti evaṃ āsanena vā nimantetī’’ti. Ettha hi vā-saddo vibhāvane nāma atthe ",
      " ‘‘rūpaṃ niccaṃ vā aniccaṃ vā’’tiādīsu viya. Evaṃ vatvā atha attano abhivādanādīni akarontaṃ bhagavantaṃ disvā āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tayidaṃ, bho gotama, tathevā"
      },
      "ti. Yaṃ taṃ mayā sutaṃ, taṃ tatheva, taṃ savanañca me dassanañca saṃsandati sameti, atthato ekībhāvaṃ gacchati. Na hi bhavaṃ gotamo…pe… āsanena vā nimantetīti. Evaṃ attanā sutaṃ diṭṭhena nigametvā nindanto āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tayidaṃ, bho gotama, na sampannamevā"
      },
      "ti taṃ abhivādanādīnaṃ akaraṇaṃ ayuttamevāti."
    ],
    "innerText": "11. Dutiyassa paṭhame abhivādetīti evamādīni na samaṇo gotamoti ettha vuttanakārena yojetvā evamettha attho veditabbo ‘‘na vandati nāsanā vuṭṭhāti, nāpi ‘idha bhonto nisīdantū’ti evaṃ āsanena vā nimantetī’’ti. Ettha hi vā-saddo vibhāvane nāma atthe ‘‘rūpaṃ niccaṃ vā aniccaṃ vā’’tiādīsu viya. Evaṃ vatvā atha attano abhivādanādīni akarontaṃ bhagavantaṃ disvā āha – tayidaṃ, bho gotama, tathevāti. Yaṃ taṃ mayā sutaṃ, taṃ tatheva, taṃ savanañca me dassanañca saṃsandati sameti, atthato ekībhāvaṃ gacchati. Na hi bhavaṃ gotamo…pe… āsanena vā nimantetīti. Evaṃ attanā sutaṃ diṭṭhena nigametvā nindanto āha – tayidaṃ, bho gotama, na sampannamevāti taṃ abhivādanādīnaṃ akaraṇaṃ ayuttamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Athassa bhagavā attukkaṃsanaparavambhanadosaṃ anupagamma karuṇāsītalena hadayena taṃ aññāṇaṃ vidhamitvā yuttabhāvaṃ dassetukāmo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nāhaṃ taṃ brāhmaṇā"
      },
      "tiādimāha. Tatrāyaṃ saṅkhepattho – ahaṃ, brāhmaṇa, appaṭihatena sabbaññutaññāṇacakkhunā olokentopi taṃ puggalaṃ etasmiṃ sadevakādibhede loke na passāmi, yamahaṃ abhivādeyyaṃ vā paccuṭṭheyyaṃ vā āsanena vā nimanteyyaṃ. Anacchariyaṃ vā etaṃ, svāhaṃ ajja sabbaññutaṃ patto evarūpaṃ nipaccākārārahaṃ puggalaṃ na passāmi. Apica kho yadāpāhaṃ sampatijātova uttarena mukho sattapadavītihārena gantvā ",
      " sakalaṃ dasasahassilokadhātuṃ olokesiṃ, tadāpi etasmiṃ sadevakādibhede loke taṃ puggalaṃ na passāmi, yamahaṃ evarūpaṃ nipaccakāraṃ kareyyaṃ. Atha kho maṃ soḷasakappasahassāyuko khīṇāsavamahābrahmāpi añjaliṃ paggahetvā ‘‘tvaṃ loke mahāpuriso, tvaṃ ",
      " sadevakassa lokassa aggo ca jeṭṭho ca seṭṭho ca, natthi tayā uttaritaro’’ti sañjātasomanasso patimānesi. Tadāpi cāhaṃ attanā uttaritaraṃ apassanto āsabhiṃ vācaṃ nicchāresiṃ – ‘‘aggohamasmi lokassa, jeṭṭhohamasmi lokassa, seṭṭhohamasmi lokassā’’ti. Evaṃ sampatijātassāpi mayhaṃ abhivādanādiraho puggalo natthi, svāhaṃ idāni sabbaññutaṃ patto kaṃ abhivādeyyaṃ. Tasmā tvaṃ, brāhmaṇa, mā tathāgatā evarūpaṃ paramanipaccakāraṃ patthayi. Yañhi, brāhmaṇa, tathāgato abhivādeyya vā…pe… āsanena vā nimanteyya, muddhāpi tassa puggalassa rattipariyosāne paripākasithilabandhanaṃ vaṇṭā muttatālaphalaṃ viya gīvato chijjitvā sahasāva bhūmiyaṃ nipateyya."
    ],
    "innerText": "Athassa bhagavā attukkaṃsanaparavambhanadosaṃ anupagamma karuṇāsītalena hadayena taṃ aññāṇaṃ vidhamitvā yuttabhāvaṃ dassetukāmo nāhaṃ taṃ brāhmaṇātiādimāha. Tatrāyaṃ saṅkhepattho – ahaṃ, brāhmaṇa, appaṭihatena sabbaññutaññāṇacakkhunā olokentopi taṃ puggalaṃ etasmiṃ sadevakādibhede loke na passāmi, yamahaṃ abhivādeyyaṃ vā paccuṭṭheyyaṃ vā āsanena vā nimanteyyaṃ. Anacchariyaṃ vā etaṃ, svāhaṃ ajja sabbaññutaṃ patto evarūpaṃ nipaccākārārahaṃ puggalaṃ na passāmi. Apica kho yadāpāhaṃ sampatijātova uttarena mukho sattapadavītihārena gantvā sakalaṃ dasasahassilokadhātuṃ olokesiṃ, tadāpi etasmiṃ sadevakādibhede loke taṃ puggalaṃ na passāmi, yamahaṃ evarūpaṃ nipaccakāraṃ kareyyaṃ. Atha kho maṃ soḷasakappasahassāyuko khīṇāsavamahābrahmāpi añjaliṃ paggahetvā ‘‘tvaṃ loke mahāpuriso, tvaṃ sadevakassa lokassa aggo ca jeṭṭho ca seṭṭho ca, natthi tayā uttaritaro’’ti sañjātasomanasso patimānesi. Tadāpi cāhaṃ attanā uttaritaraṃ apassanto āsabhiṃ vācaṃ nicchāresiṃ – ‘‘aggohamasmi lokassa, jeṭṭhohamasmi lokassa, seṭṭhohamasmi lokassā’’ti. Evaṃ sampatijātassāpi mayhaṃ abhivādanādiraho puggalo natthi, svāhaṃ idāni sabbaññutaṃ patto kaṃ abhivādeyyaṃ. Tasmā tvaṃ, brāhmaṇa, mā tathāgatā evarūpaṃ paramanipaccakāraṃ patthayi. Yañhi, brāhmaṇa, tathāgato abhivādeyya vā…pe… āsanena vā nimanteyya, muddhāpi tassa puggalassa rattipariyosāne paripākasithilabandhanaṃ vaṇṭā muttatālaphalaṃ viya gīvato chijjitvā sahasāva bhūmiyaṃ nipateyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ ",
      " vuttepi brāhmaṇo duppaññatāya tathāgatassa lokajeṭṭhabhāvaṃ asallakkhento kevalaṃ taṃ vacanaṃ asahamāno āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "arasarūpo bhavaṃ gotamo"
      },
      "ti. Ayaṃ kirassa adhippāyo – yaṃ loke abhivādanapaccuṭṭhānaañjalikammasāmīcikammaṃ ‘‘sāmaggiraso’’ti vuccati, taṃ bhoto gotamassa natthi. Tasmā arasarūpo bhavaṃ gotamo, arasajātiko arasasabhāvoti. Athassa bhagavā cittamudubhāvajananatthaṃ ujuvipaccanīkabhāvaṃ pariharanto aññathā tassa vacanassa atthaṃ ",
      " attani sandassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atthi khvesa, brāhmaṇa, pariyāyo"
      },
      "tiādimāha."
    ],
    "innerText": "Evaṃ vuttepi brāhmaṇo duppaññatāya tathāgatassa lokajeṭṭhabhāvaṃ asallakkhento kevalaṃ taṃ vacanaṃ asahamāno āha – arasarūpo bhavaṃ gotamoti. Ayaṃ kirassa adhippāyo – yaṃ loke abhivādanapaccuṭṭhānaañjalikammasāmīcikammaṃ ‘‘sāmaggiraso’’ti vuccati, taṃ bhoto gotamassa natthi. Tasmā arasarūpo bhavaṃ gotamo, arasajātiko arasasabhāvoti. Athassa bhagavā cittamudubhāvajananatthaṃ ujuvipaccanīkabhāvaṃ pariharanto aññathā tassa vacanassa atthaṃ attani sandassento atthi khvesa, brāhmaṇa, pariyāyotiādimāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atthi khvesā"
      },
      "ti atthi kho esa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pariyāyo"
      },
      "ti kāraṇaṃ. Idaṃ vuttaṃ hoti – atthi kho, brāhmaṇa, etaṃ kāraṇaṃ, yena kāraṇena maṃ ‘‘arasarūpo bhavaṃ gotamo’’ti vadamāno puggalo sammā vadeyya, avitathavādīti saṅkhaṃ gaccheyya. Katamo pana soti? Ye te, brāhmaṇa, rūparasā…pe… phoṭṭhabbarasā, te tathāgatassa pahīnāti. Kiṃ vuttaṃ hoti? Ye te jātivasena vā upapattivasena vā seṭṭhasammatānampi puthujjanānaṃ rūpārammaṇādīni assādentānaṃ abhinandantānaṃ rajjantānaṃ uppajjanti kāmasukhassādasaṅkhātā rūparasā, saddarasā, gandharasā, rasarasā, phoṭṭhabbarasā, ye imaṃ lokaṃ gīvāya bandhitvā viya āviñchanti, vatthārammaṇādisāmaggiyañca uppannattā sāmaggirasāti vuccanti. Te sabbepi tathāgatassa pahīnā. ‘‘Mayhaṃ pahīnā’’ti ",
      " vattabbepi mamākārena attānaṃ anukkhipanto dhammaṃ deseti, desanāvilāso vā esa tathāgatassa."
    ],
    "innerText": "Tattha atthi khvesāti atthi kho esa. Pariyāyoti kāraṇaṃ. Idaṃ vuttaṃ hoti – atthi kho, brāhmaṇa, etaṃ kāraṇaṃ, yena kāraṇena maṃ ‘‘arasarūpo bhavaṃ gotamo’’ti vadamāno puggalo sammā vadeyya, avitathavādīti saṅkhaṃ gaccheyya. Katamo pana soti? Ye te, brāhmaṇa, rūparasā…pe… phoṭṭhabbarasā, te tathāgatassa pahīnāti. Kiṃ vuttaṃ hoti? Ye te jātivasena vā upapattivasena vā seṭṭhasammatānampi puthujjanānaṃ rūpārammaṇādīni assādentānaṃ abhinandantānaṃ rajjantānaṃ uppajjanti kāmasukhassādasaṅkhātā rūparasā, saddarasā, gandharasā, rasarasā, phoṭṭhabbarasā, ye imaṃ lokaṃ gīvāya bandhitvā viya āviñchanti, vatthārammaṇādisāmaggiyañca uppannattā sāmaggirasāti vuccanti. Te sabbepi tathāgatassa pahīnā. ‘‘Mayhaṃ pahīnā’’ti vattabbepi mamākārena attānaṃ anukkhipanto dhammaṃ deseti, desanāvilāso vā esa tathāgatassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pahīnā"
      },
      "ti cittasantānato vigatā, pajahitā vā. Etasmiṃ panatthe karaṇe sāmivacanaṃ daṭṭhabbaṃ. Ariyamaggasatthena ucchinnaṃ taṇhāvijjāmayaṃ mūlaṃ etesanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ucchinnamūlā"
      },
      ". Tālavatthu viya nesaṃ vatthu katanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tālāvatthukatā"
      },
      ". Yathā hi tālarukkhaṃ samūlaṃ uddharitvā tassa vatthumatte tasmiṃ padese kate na puna tassa tālassa uppatti paññāyati, evaṃ ariyamaggasatthena ",
      " samūle rūpādirase uddharitvā tesaṃ pubbe uppannapubbabhāvena vatthumatte cittasantāne kate sabbepi te tālāvatthukatāti vuccanti. Aviruḷhidhammattā vā matthakacchinnatālo viya katāti tālāvatthukatā. Yasmā pana evaṃ tālāvatthukatā anabhāvaṃkatā honti ",
      ", yathā nesaṃ pacchābhāvo na hoti, tathā katā honti. Tasmā āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anabhāvaṃkatā"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āyatiṃ anuppādadhammā"
      },
      "ti anāgate anuppajjanakasabhāvā."
    ],
    "innerText": "Tattha pahīnāti cittasantānato vigatā, pajahitā vā. Etasmiṃ panatthe karaṇe sāmivacanaṃ daṭṭhabbaṃ. Ariyamaggasatthena ucchinnaṃ taṇhāvijjāmayaṃ mūlaṃ etesanti ucchinnamūlā. Tālavatthu viya nesaṃ vatthu katanti tālāvatthukatā. Yathā hi tālarukkhaṃ samūlaṃ uddharitvā tassa vatthumatte tasmiṃ padese kate na puna tassa tālassa uppatti paññāyati, evaṃ ariyamaggasatthena samūle rūpādirase uddharitvā tesaṃ pubbe uppannapubbabhāvena vatthumatte cittasantāne kate sabbepi te tālāvatthukatāti vuccanti. Aviruḷhidhammattā vā matthakacchinnatālo viya katāti tālāvatthukatā. Yasmā pana evaṃ tālāvatthukatā anabhāvaṃkatā honti , yathā nesaṃ pacchābhāvo na hoti, tathā katā honti. Tasmā āha – anabhāvaṃkatāti. Āyatiṃ anuppādadhammāti anāgate anuppajjanakasabhāvā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "No ca kho yaṃ tvaṃ sandhāya vadesī"
      },
      "ti yañca kho tvaṃ sandhāya vadesi, so pariyāyo na hoti. Nanu ca evaṃ vutte yo brāhmaṇena vutto sāmaggiraso, tassa attani vijjamānatā anuññātā hotīti? Na hoti. Yo hi naṃ sāmaggirasaṃ kātuṃ bhabbo hutvā na karoti, so tadabhāvena arasarūpoti vattabbataṃ arahati. Bhagavā pana abhabbova etaṃ kātuṃ, tenassa kāraṇe abhabbataṃ pakāsento āha – ‘‘no ca kho yaṃ tvaṃ sandhāya vadesī’’ti. Yaṃ pariyāyaṃ sandhāya tvaṃ maṃ ‘‘arasarūpo’’ti vadesi, so amhesu neva vattabboti."
    ],
    "innerText": "No ca kho yaṃ tvaṃ sandhāya vadesīti yañca kho tvaṃ sandhāya vadesi, so pariyāyo na hoti. Nanu ca evaṃ vutte yo brāhmaṇena vutto sāmaggiraso, tassa attani vijjamānatā anuññātā hotīti? Na hoti. Yo hi naṃ sāmaggirasaṃ kātuṃ bhabbo hutvā na karoti, so tadabhāvena arasarūpoti vattabbataṃ arahati. Bhagavā pana abhabbova etaṃ kātuṃ, tenassa kāraṇe abhabbataṃ pakāsento āha – ‘‘no ca kho yaṃ tvaṃ sandhāya vadesī’’ti. Yaṃ pariyāyaṃ sandhāya tvaṃ maṃ ‘‘arasarūpo’’ti vadesi, so amhesu neva vattabboti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ brāhmaṇo attanā adhippetaṃ arasarūpataṃ āropetuṃ asakkonto athāparaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nibbhogo bhava"
      },
      "ntiādimāha. Sabbapariyāyesu cettha vuttanayeneva yojanākkamaṃ viditvā sandhāyabhāsitamatthaṃ evaṃ veditabbaṃ – brāhmaṇo tadeva vayovuddhānaṃ abhivādanādikammaṃ loke ",
      " ‘‘sāmaggiparibhogo’’ti maññamāno tadabhāvena ca bhagavantaṃ ‘‘nibbhogo’’tiādimāha. Bhagavā ca yvāyaṃ rūpādīsu sattānaṃ chandarāgaparibhogo, tadabhāvaṃ attani sampassamāno aparaṃ pariyāyamanujāni."
    ],
    "innerText": "Evaṃ brāhmaṇo attanā adhippetaṃ arasarūpataṃ āropetuṃ asakkonto athāparaṃ nibbhogo bhavantiādimāha. Sabbapariyāyesu cettha vuttanayeneva yojanākkamaṃ viditvā sandhāyabhāsitamatthaṃ evaṃ veditabbaṃ – brāhmaṇo tadeva vayovuddhānaṃ abhivādanādikammaṃ loke ‘‘sāmaggiparibhogo’’ti maññamāno tadabhāvena ca bhagavantaṃ ‘‘nibbhogo’’tiādimāha. Bhagavā ca yvāyaṃ rūpādīsu sattānaṃ chandarāgaparibhogo, tadabhāvaṃ attani sampassamāno aparaṃ pariyāyamanujāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Puna brāhmaṇo yaṃ loke vayovuddhānaṃ abhivādanādikulasamudācārakammaṃ lokiyā karonti, tassa akiriyaṃ sampassamāno bhagavantaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "akiriyavādo"
      },
      "ti āha. Bhagavā pana yasmā kāyaduccaritādīnaṃ ",
      " akiriyaṃ vadati, tasmā taṃ akiriyavāditaṃ attani sampassamāno aparaṃ pariyāyamanujāni. Tattha ṭhapetvā kāyaduccaritādīni avasesā akusalā dhammā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anekavihitā pāpakā akusalā dhammā"
      },
      "ti veditabbā."
    ],
    "innerText": "Puna brāhmaṇo yaṃ loke vayovuddhānaṃ abhivādanādikulasamudācārakammaṃ lokiyā karonti, tassa akiriyaṃ sampassamāno bhagavantaṃ akiriyavādoti āha. Bhagavā pana yasmā kāyaduccaritādīnaṃ akiriyaṃ vadati, tasmā taṃ akiriyavāditaṃ attani sampassamāno aparaṃ pariyāyamanujāni. Tattha ṭhapetvā kāyaduccaritādīni avasesā akusalā dhammā anekavihitā pāpakā akusalā dhammāti veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Puna brāhmaṇo tadeva abhivādanādikammaṃ bhagavati apassanto ‘‘imaṃ āgamma ayaṃ lokatanti lokapaveṇī ucchijjatī’’ti maññamāno bhagavantaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ucchedavādo"
      },
      "ti āha. Bhagavā pana yasmā pañcakāmaguṇikarāgassa ceva akusalacittadvayasampayuttassa ca dosassa anāgāmimaggena ucchedaṃ vadati, sabbākusalasambhavassa pana mohassa arahattamaggena ucchedaṃ ",
      " vadati, ṭhapetvā te tayo avasesānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ yathānurūpaṃ catūhi maggehi ucchedaṃ vadati, tasmā taṃ ucchedavādaṃ attani sampassamāno aparaṃ pariyāyamanujāni."
    ],
    "innerText": "Puna brāhmaṇo tadeva abhivādanādikammaṃ bhagavati apassanto ‘‘imaṃ āgamma ayaṃ lokatanti lokapaveṇī ucchijjatī’’ti maññamāno bhagavantaṃ ucchedavādoti āha. Bhagavā pana yasmā pañcakāmaguṇikarāgassa ceva akusalacittadvayasampayuttassa ca dosassa anāgāmimaggena ucchedaṃ vadati, sabbākusalasambhavassa pana mohassa arahattamaggena ucchedaṃ vadati, ṭhapetvā te tayo avasesānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ yathānurūpaṃ catūhi maggehi ucchedaṃ vadati, tasmā taṃ ucchedavādaṃ attani sampassamāno aparaṃ pariyāyamanujāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Puna brāhmaṇo ‘‘jigucchati maññe samaṇo gotamo idaṃ vayovuddhānaṃ abhivādanādikulasamudācārakammaṃ, tena taṃ na karotī’’ti maññamāno bhagavantaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jegucchī"
      },
      "ti āha. Bhagavā pana yasmā jigucchati kāyaduccaritādīhi, yāni kāyavacīmanoduccaritāni ceva yāva ca akusalānaṃ ",
      " lāmakadhammānaṃ samāpatti samāpajjanā samaṅgibhāvo, taṃ sabbampi gūthaṃ viya maṇḍanakajātiko puriso jigucchati hirīyati, tasmā taṃ jegucchitaṃ attani sampassamāno aparaṃ pariyāyamanujāni. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāyaduccaritenā"
      },
      "tiādi karaṇavacanaṃ upayogatthe daṭṭhabbaṃ."
    ],
    "innerText": "Puna brāhmaṇo ‘‘jigucchati maññe samaṇo gotamo idaṃ vayovuddhānaṃ abhivādanādikulasamudācārakammaṃ, tena taṃ na karotī’’ti maññamāno bhagavantaṃ jegucchīti āha. Bhagavā pana yasmā jigucchati kāyaduccaritādīhi, yāni kāyavacīmanoduccaritāni ceva yāva ca akusalānaṃ lāmakadhammānaṃ samāpatti samāpajjanā samaṅgibhāvo, taṃ sabbampi gūthaṃ viya maṇḍanakajātiko puriso jigucchati hirīyati, tasmā taṃ jegucchitaṃ attani sampassamāno aparaṃ pariyāyamanujāni. Tattha kāyaduccaritenātiādi karaṇavacanaṃ upayogatthe daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Puna brāhmaṇo tadeva abhivādanādikammaṃ bhagavati apassanto ‘‘ayaṃ idaṃ lokajeṭṭhakakammaṃ vineti vināseti, atha vā yasmā etaṃ sāmīcikammaṃ na karoti, tasmā ayaṃ vinetabbo niggaṇhitabbo’’ti maññamāno bhagavantaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "venayiko"
      },
      "ti āha. Tatrāyaṃ padattho – vinayatīti vinayo, vināsetīti vuttaṃ hoti. Vinayo eva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "venayiko"
      },
      ". Vinayaṃ vā arahatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "venayiko,"
      },
      " niggahaṃ arahatīti vuttaṃ hoti. Bhagavā pana yasmā rāgādīnaṃ vinayāya vūpasamāya dhammaṃ deseti, tasmā venayiko hoti. Ayameva cettha padattho – vinayāya dhammaṃ desetīti venayiko. Vicitrā hi taddhitavutti. Svāyaṃ taṃ venayikabhāvaṃ attani sampassamāno aparaṃ pariyāyamanujāni."
    ],
    "innerText": "Puna brāhmaṇo tadeva abhivādanādikammaṃ bhagavati apassanto ‘‘ayaṃ idaṃ lokajeṭṭhakakammaṃ vineti vināseti, atha vā yasmā etaṃ sāmīcikammaṃ na karoti, tasmā ayaṃ vinetabbo niggaṇhitabbo’’ti maññamāno bhagavantaṃ venayikoti āha. Tatrāyaṃ padattho – vinayatīti vinayo, vināsetīti vuttaṃ hoti. Vinayo eva venayiko. Vinayaṃ vā arahatīti venayiko, niggahaṃ arahatīti vuttaṃ hoti. Bhagavā pana yasmā rāgādīnaṃ vinayāya vūpasamāya dhammaṃ deseti, tasmā venayiko hoti. Ayameva cettha padattho – vinayāya dhammaṃ desetīti venayiko. Vicitrā hi taddhitavutti. Svāyaṃ taṃ venayikabhāvaṃ attani sampassamāno aparaṃ pariyāyamanujāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Puna brāhmaṇo yasmā abhivādanādīni sāmīcikammāni karontā vayovuddhe tosenti hāsenti ",
      ", akarontā pana tāpenti vihesenti domanassaṃ nesaṃ uppādenti, bhagavā ca tāni na karoti, tasmā ‘‘ayaṃ vayovuddhe tapatī’’ti maññamāno sappurisācāravirahitattā vā ‘‘kapaṇapuriso aya’’nti maññamāno bhagavantaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tapassī"
      },
      "ti āha. Tatrāyaṃ padattho – tapatīti tapo, roseti vihesetīti attho. Sāmīcikammākaraṇassetaṃ adhivacanaṃ. Tapo assa atthīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tapassī"
      },
      ". Dutiye atthavikappe byañjanāni avicāretvā loke kapaṇapuriso ",
      " tapassīti ",
      " vuccati. Bhagavā pana ye akusalā dhammā lokaṃ tapanato tapanīyāni vuccanti, tesaṃ pahīnattā yasmā tapassīti saṅkhaṃ gato. Tasmā taṃ tapassitaṃ attani sampassamāno aparaṃ pariyāyamanujāni. Tatrāyaṃ vacanattho – tapantīti tapā, akusaladhammānametaṃ adhivacanaṃ. Te tape assi nirassi pahāsi viddhaṃsīti tapassī."
    ],
    "innerText": "Puna brāhmaṇo yasmā abhivādanādīni sāmīcikammāni karontā vayovuddhe tosenti hāsenti , akarontā pana tāpenti vihesenti domanassaṃ nesaṃ uppādenti, bhagavā ca tāni na karoti, tasmā ‘‘ayaṃ vayovuddhe tapatī’’ti maññamāno sappurisācāravirahitattā vā ‘‘kapaṇapuriso aya’’nti maññamāno bhagavantaṃ tapassīti āha. Tatrāyaṃ padattho – tapatīti tapo, roseti vihesetīti attho. Sāmīcikammākaraṇassetaṃ adhivacanaṃ. Tapo assa atthīti tapassī. Dutiye atthavikappe byañjanāni avicāretvā loke kapaṇapuriso tapassīti vuccati. Bhagavā pana ye akusalā dhammā lokaṃ tapanato tapanīyāni vuccanti, tesaṃ pahīnattā yasmā tapassīti saṅkhaṃ gato. Tasmā taṃ tapassitaṃ attani sampassamāno aparaṃ pariyāyamanujāni. Tatrāyaṃ vacanattho – tapantīti tapā, akusaladhammānametaṃ adhivacanaṃ. Te tape assi nirassi pahāsi viddhaṃsīti tapassī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Puna brāhmaṇo taṃ abhivādanādikammaṃ devalokagabbhasampattiyā devalokapaṭisandhipaṭilābhāya saṃvattatīti maññamāno bhagavati cassa abhāvaṃ disvā bhagavantaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "apagabbho"
      },
      "ti āha. Kodhavasena vā bhagavato mātukucchismiṃ paṭisandhiggahaṇe dosaṃ dassentopi evamāha. Tatrāyaṃ vacanattho – gabbhato apagatoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "apagabbho,"
      },
      " abhabbo devalokūpapattiṃ pāpuṇitunti adhippāyo. Hīno vā gabbho assāti apagabbho. Devalokagabbhaparibāhirattā āyatiṃ hīnagabbhapaṭilābhabhāgīti. Hīno vāssa mātukucchismiṃ gabbhavāso ahosīti adhippāyo. Bhagavato pana yasmā āyatiṃ gabbhaseyyā apagatā, tasmā so taṃ apagabbhataṃ attani sampassamāno aparaṃ pariyāyamanujāni. Tatra ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yassa kho, brāhmaṇa, āyatiṃ gabbhaseyyā punabbhavābhinibbatti pahīnā"
      },
      "ti etesaṃ padānaṃ evamattho daṭṭhabbo – ‘‘brāhmaṇa, yassa puggalassa anāgate gabbhaseyyā punabbhave ca abhinibbatti anuttarena maggena vihatakāraṇattā pahīnā. Gabbhaseyyāgahaṇena cettha jalābujayoni gahitā, punabbhavābhinibbattiggahaṇena itarā tisso’’pi."
    ],
    "innerText": "Puna brāhmaṇo taṃ abhivādanādikammaṃ devalokagabbhasampattiyā devalokapaṭisandhipaṭilābhāya saṃvattatīti maññamāno bhagavati cassa abhāvaṃ disvā bhagavantaṃ apagabbhoti āha. Kodhavasena vā bhagavato mātukucchismiṃ paṭisandhiggahaṇe dosaṃ dassentopi evamāha. Tatrāyaṃ vacanattho – gabbhato apagatoti apagabbho, abhabbo devalokūpapattiṃ pāpuṇitunti adhippāyo. Hīno vā gabbho assāti apagabbho. Devalokagabbhaparibāhirattā āyatiṃ hīnagabbhapaṭilābhabhāgīti. Hīno vāssa mātukucchismiṃ gabbhavāso ahosīti adhippāyo. Bhagavato pana yasmā āyatiṃ gabbhaseyyā apagatā, tasmā so taṃ apagabbhataṃ attani sampassamāno aparaṃ pariyāyamanujāni. Tatra ca yassa kho, brāhmaṇa, āyatiṃ gabbhaseyyā punabbhavābhinibbatti pahīnāti etesaṃ padānaṃ evamattho daṭṭhabbo – ‘‘brāhmaṇa, yassa puggalassa anāgate gabbhaseyyā punabbhave ca abhinibbatti anuttarena maggena vihatakāraṇattā pahīnā. Gabbhaseyyāgahaṇena cettha jalābujayoni gahitā, punabbhavābhinibbattiggahaṇena itarā tisso’’pi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Apica gabbhassa seyyā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gabbhaseyyā"
      },
      ". Punabbhavo ",
      " eva abhinibbatti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "punabbhavābhinibbattī"
      },
      "ti evamettha attho daṭṭhabbo. Yathā ca viññāṇaṭṭhitīti vuttepi na viññāṇato aññā ṭhiti atthi, evamidhāpi na gabbhato aññā seyyā veditabbā. Abhinibbatti ca nāma yasmā punabbhavabhūtāpi apunabbhavabhūtāpi atthi, idha ca punabbhavabhūtā adhippetā, tasmā vuttaṃ – ‘‘punabbhavo eva abhinibbatti punabbhavābhinibbattī’’ti."
    ],
    "innerText": "Apica gabbhassa seyyā gabbhaseyyā. Punabbhavo eva abhinibbatti punabbhavābhinibbattīti evamettha attho daṭṭhabbo. Yathā ca viññāṇaṭṭhitīti vuttepi na viññāṇato aññā ṭhiti atthi, evamidhāpi na gabbhato aññā seyyā veditabbā. Abhinibbatti ca nāma yasmā punabbhavabhūtāpi apunabbhavabhūtāpi atthi, idha ca punabbhavabhūtā adhippetā, tasmā vuttaṃ – ‘‘punabbhavo eva abhinibbatti punabbhavābhinibbattī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ ",
      " āgatakālato paṭṭhāya arasarūpatādīhi aṭṭhahi akkosavatthūhi akkosantampi brāhmaṇaṃ bhagavā dhammissaro dhammarājā dhammasāmī tathāgato anukampāya sītaleneva cakkhunā brāhmaṇaṃ olekento yaṃ dhammadhātuṃ paṭivijjhitvā desanāvilāsappattā nāma hoti, tassā ",
      " dhammadhātuyā suppaṭividdhattā vigatavalāhake nabhe puṇṇacando viya ca saradakāle sūriyo viya ca brāhmaṇassa hadayandhakāraṃ vidhamento tāniyeva akkosavatthūni tena tena pariyāyena aññathā dassetvā punapi attano karuṇāvipphāraṃ aṭṭhahi lokadhammehi akampiyabhāvena paṭiladdhatādiguṇalakkhaṇaṃ pathavisamacittataṃ akuppadhammatañca pakāsento ‘‘ayaṃ brāhmaṇo kevalaṃ palitasirakhaṇḍadantavalittacatādīhi attano vuddhabhāvaṃ sallakkheti, no ca kho jānāti attānaṃ jātiyā anugataṃ jarāya anusaṭaṃ byādhino adhibhūtaṃ maraṇena abbhāhataṃ ajja maritvā puna sveva uttānaseyyadārakabhāvagamanīyaṃ ",
      ". Mahantena kho pana ussāhena mama santikaṃ āgato, tadassa āgamanaṃ sātthakaṃ hotū’’ti cintetvā imasmiṃ loke attano appaṭisamaṃ purejātabhāvaṃ dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "seyyathāpi, brāhmaṇā"
      },
      "tiādinā nayena brāhmaṇassa dhammadesanaṃ vaḍḍhesi."
    ],
    "innerText": "Evaṃ āgatakālato paṭṭhāya arasarūpatādīhi aṭṭhahi akkosavatthūhi akkosantampi brāhmaṇaṃ bhagavā dhammissaro dhammarājā dhammasāmī tathāgato anukampāya sītaleneva cakkhunā brāhmaṇaṃ olekento yaṃ dhammadhātuṃ paṭivijjhitvā desanāvilāsappattā nāma hoti, tassā dhammadhātuyā suppaṭividdhattā vigatavalāhake nabhe puṇṇacando viya ca saradakāle sūriyo viya ca brāhmaṇassa hadayandhakāraṃ vidhamento tāniyeva akkosavatthūni tena tena pariyāyena aññathā dassetvā punapi attano karuṇāvipphāraṃ aṭṭhahi lokadhammehi akampiyabhāvena paṭiladdhatādiguṇalakkhaṇaṃ pathavisamacittataṃ akuppadhammatañca pakāsento ‘‘ayaṃ brāhmaṇo kevalaṃ palitasirakhaṇḍadantavalittacatādīhi attano vuddhabhāvaṃ sallakkheti, no ca kho jānāti attānaṃ jātiyā anugataṃ jarāya anusaṭaṃ byādhino adhibhūtaṃ maraṇena abbhāhataṃ ajja maritvā puna sveva uttānaseyyadārakabhāvagamanīyaṃ . Mahantena kho pana ussāhena mama santikaṃ āgato, tadassa āgamanaṃ sātthakaṃ hotū’’ti cintetvā imasmiṃ loke attano appaṭisamaṃ purejātabhāvaṃ dassento seyyathāpi, brāhmaṇātiādinā nayena brāhmaṇassa dhammadesanaṃ vaḍḍhesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "seyyathāpī"
      },
      "tiādīnaṃ heṭṭhā vutanayeneva attho veditabbo. Ayaṃ pana viseso – heṭṭhā vuttanayeneva hi te kukkuṭapotakā pakkhe vidhunantā taṃkhaṇānurūpaṃ viravantā nikkhamanti. Evaṃ nikkhamantānañca tesaṃ yo paṭhamataraṃ nikkhamati, so jeṭṭhoti vuccati. Tasmā bhagavā tāya upamāya attano jeṭṭhabhāvaṃ sādhetukāmo brāhmaṇaṃ pucchati – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yo nu kho tesaṃ kukkuṭacchāpotakānaṃ…pe… kinti svāssa vacanīyo"
      },
      "ti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kukkuṭacchāpakāna"
      },
      "nti kukkuṭapotakānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kinti svāssa vacanīyo"
      },
      "ti so kinti vacanīyo assa, kiṃ vattabbo bhaveyya jeṭṭho vā kaniṭṭho vāti."
    ],
    "innerText": "Tattha seyyathāpītiādīnaṃ heṭṭhā vutanayeneva attho veditabbo. Ayaṃ pana viseso – heṭṭhā vuttanayeneva hi te kukkuṭapotakā pakkhe vidhunantā taṃkhaṇānurūpaṃ viravantā nikkhamanti. Evaṃ nikkhamantānañca tesaṃ yo paṭhamataraṃ nikkhamati, so jeṭṭhoti vuccati. Tasmā bhagavā tāya upamāya attano jeṭṭhabhāvaṃ sādhetukāmo brāhmaṇaṃ pucchati – yo nu kho tesaṃ kukkuṭacchāpotakānaṃ…pe… kinti svāssa vacanīyoti. Tattha kukkuṭacchāpakānanti kukkuṭapotakānaṃ. Kinti svāssa vacanīyoti so kinti vacanīyo assa, kiṃ vattabbo bhaveyya jeṭṭho vā kaniṭṭho vāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Jeṭṭho’’tissa, bho gotama, vacanīyo"
      },
      "ti, bho gotama, so jeṭṭho iti assa vacanīyo. Kasmāti ce? ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "So hi nesaṃ jeṭṭho"
      },
      "ti, yasmā so nesaṃ vuddhataroti attho. Athassa bhagavā opammaṃ sampaṭipādento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "evameva kho"
      },
      "ti āha, yathā so kukkuṭapotako, evaṃ ahampi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avijjāgatāya"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pajāyā"
      },
      "ti avijjā vuccati aññāṇaṃ, tattha gatāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pajāyā"
      },
      "ti sattadhivacanametaṃ, avijjākosassa anto paviṭṭhesu sattesūpi vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṇḍabhūtāyā"
      },
      "ti aṇḍe bhūtāya pajātāya sañjātāya. Yathā hi aṇḍe nibbattā ekacce sattā aṇḍabhūtāti vuccanti, evamayaṃ ",
      " sabbāpi pajā avijjaṇḍakose nibbattattā aṇḍabhūtāti vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pariyonaddhāyā"
      },
      "ti ",
      " tena avijjaṇḍakosena samantato onaddhāya baddhāya veṭhitāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avijjaṇḍakosaṃ padāletvā"
      },
      "ti taṃ avijjāmayaṃ aṇḍakosaṃ bhinditvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekova loke"
      },
      "ti sakalepi lokasannivāse ahameva eko adutiyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anuttaraṃ sammāsambodhiṃ abhisambuddho"
      },
      "ti uttararahitaṃ sabbaseṭṭhaṃ sammā sāmañca bodhiṃ, atha vā pasatthaṃ sundarañca bodhiṃ. Arahattamaggañāṇassetaṃ nāmaṃ, sabbaññutaññāṇassāpi nāmameva. Ubhayampi vaṭṭati. Aññesaṃ arahattamaggo anuttarā bodhi hoti, na hotīti? Na hoti. Kasmā? Asabbaguṇadāyakattā. Tesañhi kassaci arahattamaggo arahattaphalameva deti, kassaci tisso vijjā, kassaci cha abhiññā, kassaci catasso paṭisambhidā, kassaci sāvakapāramiñāṇaṃ. Paccekabuddhānampi paccekabodhiñāṇameva deti, buddhānaṃ pana sabbaguṇasampattiṃ ",
      " deti abhiseko viya rañño sabbalokissarabhāvaṃ. Tasmā aññassa kassacipi anuttarā bodhi na hotīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhisambuddho"
      },
      "ti abbhaññāsiṃ paṭivijjhiṃ, pattomhi adhigatomhīti vuttaṃ hoti."
    ],
    "innerText": "‘‘Jeṭṭho’’tissa, bho gotama, vacanīyoti, bho gotama, so jeṭṭho iti assa vacanīyo. Kasmāti ce? So hi nesaṃ jeṭṭhoti, yasmā so nesaṃ vuddhataroti attho. Athassa bhagavā opammaṃ sampaṭipādento evameva khoti āha, yathā so kukkuṭapotako, evaṃ ahampi. Avijjāgatāyapajāyāti avijjā vuccati aññāṇaṃ, tattha gatāya. Pajāyāti sattadhivacanametaṃ, avijjākosassa anto paviṭṭhesu sattesūpi vuttaṃ hoti. Aṇḍabhūtāyāti aṇḍe bhūtāya pajātāya sañjātāya. Yathā hi aṇḍe nibbattā ekacce sattā aṇḍabhūtāti vuccanti, evamayaṃ sabbāpi pajā avijjaṇḍakose nibbattattā aṇḍabhūtāti vuccati. Pariyonaddhāyāti tena avijjaṇḍakosena samantato onaddhāya baddhāya veṭhitāya. Avijjaṇḍakosaṃ padāletvāti taṃ avijjāmayaṃ aṇḍakosaṃ bhinditvā. Ekova loketi sakalepi lokasannivāse ahameva eko adutiyo. Anuttaraṃ sammāsambodhiṃ abhisambuddhoti uttararahitaṃ sabbaseṭṭhaṃ sammā sāmañca bodhiṃ, atha vā pasatthaṃ sundarañca bodhiṃ. Arahattamaggañāṇassetaṃ nāmaṃ, sabbaññutaññāṇassāpi nāmameva. Ubhayampi vaṭṭati. Aññesaṃ arahattamaggo anuttarā bodhi hoti, na hotīti? Na hoti. Kasmā? Asabbaguṇadāyakattā. Tesañhi kassaci arahattamaggo arahattaphalameva deti, kassaci tisso vijjā, kassaci cha abhiññā, kassaci catasso paṭisambhidā, kassaci sāvakapāramiñāṇaṃ. Paccekabuddhānampi paccekabodhiñāṇameva deti, buddhānaṃ pana sabbaguṇasampattiṃ deti abhiseko viya rañño sabbalokissarabhāvaṃ. Tasmā aññassa kassacipi anuttarā bodhi na hotīti. Abhisambuddhoti abbhaññāsiṃ paṭivijjhiṃ, pattomhi adhigatomhīti vuttaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni yadetaṃ bhagavatā ‘‘evameva kho’’tiādinā nayena vuttaṃ opammasampaṭipādanaṃ, taṃ evaṃ atthena saṃsanditvā veditabbaṃ – yathā hi tassā kukkuṭiyā attano aṇḍesu adhisayanāditividhakiriyākaraṇaṃ, evaṃ bodhipallaṅke nisinnassa bodhisattabhūtassa bhagavato attano santāne aniccaṃ, dukkhaṃ, anattāti tividhānupassanākaraṇaṃ. Kukkuṭiyā tividhakiriyāsampādanena aṇḍānaṃ apūtibhāvo viya bodhisattabhūtassa bhagavato tividhānupassanāsampādanena vipassanāñāṇassa aparihāni. Kukkuṭiyā tividhakiriyākaraṇena aṇḍānaṃ allasinehapariyādānaṃ viya bodhisattabhūtassa bhagavato tividhānupassanāsampādanena bhavattayānugatanikantisinehapariyādānaṃ. Kukkuṭiyā tividhakiriyākaraṇena aṇḍakapālānaṃ tanubhāvo viya bodhisattabhūtassa bhagavato tividhānupassanāsampādanena avijjaṇḍakosassa tanubhāvo, kukkuṭiyā tividhakiriyākaraṇena kukkuṭapotakassa pādanakhatuṇḍakānaṃ thaddhakharabhāvo viya bodhisattabhūtassa bhagavato tividhānupassanāsampādanena vipassanāñāṇassa tikkhakharavippasannasūrabhāvo. Kukkuṭiyā tividhakiriyākaraṇena kukkuṭapotakassa pariṇāmakālo viya bodhisattabhūtassa ",
      " bhagavato tividhānupassanāsampādanena vipassanāñāṇassa pariṇāmakālo vaḍḍhikālo gabbhaggahaṇakālo. Kukkuṭiyā tividhakiriyākaraṇena kukkuṭapotakassa pādanakhasikhāya vā mukhatuṇḍakena vā aṇḍakosaṃ padāletvā pakkhe papphoṭetvā sotthinā abhinibbhidākālo viya bhagavato tividhānupassanāsampādanena vipassanāñāṇagabbhaṃ gaṇhāpetvā anupubbādhigatena ",
      " arahattamaggena avijjaṇḍakosaṃ padāletvā abhiññāpakkhe papphoṭetvā sotthinā sakalabuddhaguṇasacchikatakālo veditabbo."
    ],
    "innerText": "Idāni yadetaṃ bhagavatā ‘‘evameva kho’’tiādinā nayena vuttaṃ opammasampaṭipādanaṃ, taṃ evaṃ atthena saṃsanditvā veditabbaṃ – yathā hi tassā kukkuṭiyā attano aṇḍesu adhisayanāditividhakiriyākaraṇaṃ, evaṃ bodhipallaṅke nisinnassa bodhisattabhūtassa bhagavato attano santāne aniccaṃ, dukkhaṃ, anattāti tividhānupassanākaraṇaṃ. Kukkuṭiyā tividhakiriyāsampādanena aṇḍānaṃ apūtibhāvo viya bodhisattabhūtassa bhagavato tividhānupassanāsampādanena vipassanāñāṇassa aparihāni. Kukkuṭiyā tividhakiriyākaraṇena aṇḍānaṃ allasinehapariyādānaṃ viya bodhisattabhūtassa bhagavato tividhānupassanāsampādanena bhavattayānugatanikantisinehapariyādānaṃ. Kukkuṭiyā tividhakiriyākaraṇena aṇḍakapālānaṃ tanubhāvo viya bodhisattabhūtassa bhagavato tividhānupassanāsampādanena avijjaṇḍakosassa tanubhāvo, kukkuṭiyā tividhakiriyākaraṇena kukkuṭapotakassa pādanakhatuṇḍakānaṃ thaddhakharabhāvo viya bodhisattabhūtassa bhagavato tividhānupassanāsampādanena vipassanāñāṇassa tikkhakharavippasannasūrabhāvo. Kukkuṭiyā tividhakiriyākaraṇena kukkuṭapotakassa pariṇāmakālo viya bodhisattabhūtassa bhagavato tividhānupassanāsampādanena vipassanāñāṇassa pariṇāmakālo vaḍḍhikālo gabbhaggahaṇakālo. Kukkuṭiyā tividhakiriyākaraṇena kukkuṭapotakassa pādanakhasikhāya vā mukhatuṇḍakena vā aṇḍakosaṃ padāletvā pakkhe papphoṭetvā sotthinā abhinibbhidākālo viya bhagavato tividhānupassanāsampādanena vipassanāñāṇagabbhaṃ gaṇhāpetvā anupubbādhigatena arahattamaggena avijjaṇḍakosaṃ padāletvā abhiññāpakkhe papphoṭetvā sotthinā sakalabuddhaguṇasacchikatakālo veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ahañhi, brāhmaṇa, jeṭṭho seṭṭho lokassā"
      },
      "ti, brāhmaṇa, yathā tesaṃ kukkuṭapotakānaṃ paṭhamataraṃ aṇḍakosaṃ padāletvā abhinibbatto kukkuṭapotako jeṭṭho hoti, evaṃ avijjāgatāya pajāya taṃ avijjaṇḍakosaṃ padāletvā paṭhamataraṃ ariyāya jātiyā jātattā ahañhi jeṭṭho vuddhatamoti saṅkhaṃ gato, sabbaguṇehi pana appaṭisamattā seṭṭhoti."
    ],
    "innerText": "Ahañhi, brāhmaṇa, jeṭṭho seṭṭho lokassāti, brāhmaṇa, yathā tesaṃ kukkuṭapotakānaṃ paṭhamataraṃ aṇḍakosaṃ padāletvā abhinibbatto kukkuṭapotako jeṭṭho hoti, evaṃ avijjāgatāya pajāya taṃ avijjaṇḍakosaṃ padāletvā paṭhamataraṃ ariyāya jātiyā jātattā ahañhi jeṭṭho vuddhatamoti saṅkhaṃ gato, sabbaguṇehi pana appaṭisamattā seṭṭhoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ bhagavā attano anuttaraṃ jeṭṭhaseṭṭhabhāvaṃ brāhmaṇassa pakāsetvā idāni yāya paṭipadāya taṃ adhigato, taṃ paṭipadaṃ pubbabhāgato pabhuti dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āraddhaṃ kho pana me, brāhmaṇā"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āraddhaṃ kho pana me, brāhmaṇa, vīriyaṃ ahosī"
      },
      "ti, brāhmaṇa, na mayā ayaṃ anuttaro jeṭṭhaseṭṭhabhāvo kusītena muṭṭhassatinā sāraddhakāyena vikkhittacitena adhigato, apica kho tadadhigamāya āraddhaṃ kho pana me vīriyaṃ ahosi. Bodhimaṇḍe nisinnena mayā catusammappadhānabhedaṃ vīriyaṃ āraddhaṃ ahosi, paggahitaṃ asithilappavattitaṃ. Āraddhattāyeva ca me taṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asallīnaṃ"
      },
      " ahosi ",
      ". Na kevalañca vīriyameva, satipi me ārammaṇābhimukhabhāvena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upaṭṭhitā"
      },
      " ahosi, upaṭṭhitattāyeva ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asammuṭṭhā. Passaddho kāyo asāraddho"
      },
      "ti kāyacittappassaddhivasena kāyopi me passaddho ahosi. Tattha yasmā nāmakāye passaddhe rūpakāyopi passaddhoyeva hoti, tasmā ‘‘nāmakāyo rūpakāyo’’ti avisesetvāva ‘‘passaddho kāyo’’ti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asāraddho"
      },
      "ti so ca kho passaddhattāyeva asāraddho, vigatadarathoti vuttaṃ hoti ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samāhitaṃ cittaṃ ekagga"
      },
      "nti cittampi me sammā āhitaṃ suṭṭhu ṭhapitaṃ appitaṃ viya ahosi, samāhitattā eva ca ekaggaṃ acalaṃ nipphandananti. Ettāvatā jhānassa pubbabhāgapaṭipadā kathitā hoti."
    ],
    "innerText": "Evaṃ bhagavā attano anuttaraṃ jeṭṭhaseṭṭhabhāvaṃ brāhmaṇassa pakāsetvā idāni yāya paṭipadāya taṃ adhigato, taṃ paṭipadaṃ pubbabhāgato pabhuti dassetuṃ āraddhaṃ kho pana me, brāhmaṇātiādimāha. Tattha āraddhaṃ kho pana me, brāhmaṇa, vīriyaṃ ahosīti, brāhmaṇa, na mayā ayaṃ anuttaro jeṭṭhaseṭṭhabhāvo kusītena muṭṭhassatinā sāraddhakāyena vikkhittacitena adhigato, apica kho tadadhigamāya āraddhaṃ kho pana me vīriyaṃ ahosi. Bodhimaṇḍe nisinnena mayā catusammappadhānabhedaṃ vīriyaṃ āraddhaṃ ahosi, paggahitaṃ asithilappavattitaṃ. Āraddhattāyeva ca me taṃ asallīnaṃ ahosi . Na kevalañca vīriyameva, satipi me ārammaṇābhimukhabhāvena upaṭṭhitā ahosi, upaṭṭhitattāyeva ca asammuṭṭhā. Passaddho kāyo asāraddhoti kāyacittappassaddhivasena kāyopi me passaddho ahosi. Tattha yasmā nāmakāye passaddhe rūpakāyopi passaddhoyeva hoti, tasmā ‘‘nāmakāyo rūpakāyo’’ti avisesetvāva ‘‘passaddho kāyo’’ti vuttaṃ. Asāraddhoti so ca kho passaddhattāyeva asāraddho, vigatadarathoti vuttaṃ hoti . Samāhitaṃ cittaṃ ekagganti cittampi me sammā āhitaṃ suṭṭhu ṭhapitaṃ appitaṃ viya ahosi, samāhitattā eva ca ekaggaṃ acalaṃ nipphandananti. Ettāvatā jhānassa pubbabhāgapaṭipadā kathitā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni imāya paṭipadāya adhigataṃ paṭhamajjhānaṃ ādiṃ katvā vijjāttayapariyosānaṃ visesaṃ dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "so kho aha"
      },
      "ntiādimāha. Tattha yaṃ yāva vinicchayanayena vattabbaṃ siyā, taṃ visuddhimagge (visuddhi. 1.69) vuttameva."
    ],
    "innerText": "Idāni imāya paṭipadāya adhigataṃ paṭhamajjhānaṃ ādiṃ katvā vijjāttayapariyosānaṃ visesaṃ dassento so kho ahantiādimāha. Tattha yaṃ yāva vinicchayanayena vattabbaṃ siyā, taṃ visuddhimagge (visuddhi. 1.69) vuttameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayaṃ kho me, brāhmaṇā"
      },
      "tiādīsu pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vijjā"
      },
      "ti viditakaraṇaṭṭhena vijjā. Kiṃ viditaṃ karoti ",
      "? Pubbenivāsaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avijjā"
      },
      "ti tasseva pubbenivāsassa aviditakaraṇaṭṭhena tappaṭicchādakamoho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tamo"
      },
      "ti sveva moho tappaṭicchādakaṭṭhena tamo nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āloko"
      },
      "ti ",
      " sā eva vijjā obhāsakaraṇaṭṭhena ālokoti. Ettha ca vijjā adhigatāti attho, sesaṃ pasaṃsāvacanaṃ. Yojanā panettha – ayaṃ kho me vijjā adhigatā, tassa me adhigatavijjassa avijjā vihatā, vinaṭṭhāti attho. Kasmā? Yasmā vijjā uppannā. Esa nayo itarasmimpi padadvaye. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathā ta"
      },
      "nti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ta"
      },
      "nti nipātamattaṃ. Satiyā avippavāsena appamattassa vīriyātāpena ātāpino kāye ca jīvite ca anapekkhātāya pahitattassa pesitattassāti attho. Idaṃ vuttaṃ hoti – yathā appamattassa ātāpino pahitattassa viharato avijjā vihaññeyya, vijjā uppajjeyya tamo vihaññeyya, āloko uppajjeyya, evameva mama avijjā vihatā, vijjā uppannā, tamo vihato, āloko uppanno. Etassa me padhānānuyogassa anurūpameva phalaṃ laddhanti."
    ],
    "innerText": "Ayaṃ kho me, brāhmaṇātiādīsu pana vijjāti viditakaraṇaṭṭhena vijjā. Kiṃ viditaṃ karoti ? Pubbenivāsaṃ. Avijjāti tasseva pubbenivāsassa aviditakaraṇaṭṭhena tappaṭicchādakamoho. Tamoti sveva moho tappaṭicchādakaṭṭhena tamo nāma. Ālokoti sā eva vijjā obhāsakaraṇaṭṭhena ālokoti. Ettha ca vijjā adhigatāti attho, sesaṃ pasaṃsāvacanaṃ. Yojanā panettha – ayaṃ kho me vijjā adhigatā, tassa me adhigatavijjassa avijjā vihatā, vinaṭṭhāti attho. Kasmā? Yasmā vijjā uppannā. Esa nayo itarasmimpi padadvaye. Yathā tanti ettha tanti nipātamattaṃ. Satiyā avippavāsena appamattassa vīriyātāpena ātāpino kāye ca jīvite ca anapekkhātāya pahitattassa pesitattassāti attho. Idaṃ vuttaṃ hoti – yathā appamattassa ātāpino pahitattassa viharato avijjā vihaññeyya, vijjā uppajjeyya tamo vihaññeyya, āloko uppajjeyya, evameva mama avijjā vihatā, vijjā uppannā, tamo vihato, āloko uppanno. Etassa me padhānānuyogassa anurūpameva phalaṃ laddhanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayaṃ kho me, brāhmaṇa, paṭhamā abhinibbhidā ahosi kukkuṭacchāpakasseva aṇḍakosamhā"
      },
      "ti ayaṃ kho mama, brāhmaṇa, pubbenivāsānussatiñāṇamukhatuṇḍakena pubbe nivutthakhandhappaṭicchādakaṃ avijjaṇḍakosaṃ padāletvā paṭhamā abhinibbhidā paṭhamā nikkhanti paṭhamā ariyājāti ahosi kukkuṭacchāpakasseva mukhatuṇḍakena vā ṃ pādanakhasikhāya vā aṇḍakosaṃ padāletvā tamhā aṇḍakosamhā abhinibbhidā nikkhanti kukkuṭanikāye paccājātīti. Ayaṃ tāva pubbenivāsakathāyaṃ nayo."
    ],
    "innerText": "Ayaṃ kho me, brāhmaṇa, paṭhamā abhinibbhidā ahosi kukkuṭacchāpakasseva aṇḍakosamhāti ayaṃ kho mama, brāhmaṇa, pubbenivāsānussatiñāṇamukhatuṇḍakena pubbe nivutthakhandhappaṭicchādakaṃ avijjaṇḍakosaṃ padāletvā paṭhamā abhinibbhidā paṭhamā nikkhanti paṭhamā ariyājāti ahosi kukkuṭacchāpakasseva mukhatuṇḍakena vā ṃ pādanakhasikhāya vā aṇḍakosaṃ padāletvā tamhā aṇḍakosamhā abhinibbhidā nikkhanti kukkuṭanikāye paccājātīti. Ayaṃ tāva pubbenivāsakathāyaṃ nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Cutupapātakathāya ",
      " pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vijjā"
      },
      "ti dibbacakkhuñāṇavijjā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avijjā"
      },
      "ti cutupapātappaṭicchādikā ",
      " avijjā. Yathā pana pubbenivāsakathāyaṃ ‘‘pubbenivāsānussatiñāṇamukhatuṇḍakena pubbe nivutthakkhandhappaṭicchādakaṃ avijjaṇḍakosaṃ padāletvā’’ti vuttaṃ, evamidha ‘‘cutupapātañāṇamukhatuṇḍakena cutupapātappaṭicchādakaṃ avijjaṇḍakosaṃ padāletvā’’ti vattabbaṃ."
    ],
    "innerText": "Cutupapātakathāya pana vijjāti dibbacakkhuñāṇavijjā. Avijjāti cutupapātappaṭicchādikā avijjā. Yathā pana pubbenivāsakathāyaṃ ‘‘pubbenivāsānussatiñāṇamukhatuṇḍakena pubbe nivutthakkhandhappaṭicchādakaṃ avijjaṇḍakosaṃ padāletvā’’ti vuttaṃ, evamidha ‘‘cutupapātañāṇamukhatuṇḍakena cutupapātappaṭicchādakaṃ avijjaṇḍakosaṃ padāletvā’’ti vattabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yaṃ panetaṃ paccavekkhaṇañāṇapariggahitaṃ āsavānaṃ khayañāṇādhigamaṃ brāhmaṇassa dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ayaṃ kho me, brāhmaṇa, tatiyā vijjā"
      },
      "tiādimāha, tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vijjā"
      },
      "ti arahattamaggavijjā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avijjā"
      },
      "ti catusaccappaṭicchādikā avijjā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayaṃ kho me, brāhmaṇa, tatiyā abhinibbhidā ahosī"
      },
      "ti ",
      " ettha ayaṃ kho mama, brāhmaṇa, āsavānaṃ khayañāṇamukhatuṇḍakena catusaccapaṭicchādakaṃ avijjaṇḍakosaṃ padāletvā tatiyā abhinibbhidā tatiyā nikkhanti tatiyā ariyajāti ahosi kukkuṭacchāpakasseva mukhatuṇḍakena vā pādanakhasikhāya vā aṇḍakosaṃ padāletvā tamhā aṇḍakosamhā abhinibbhidā nikkhanti kukkuṭanikāye paccājātīti."
    ],
    "innerText": "Yaṃ panetaṃ paccavekkhaṇañāṇapariggahitaṃ āsavānaṃ khayañāṇādhigamaṃ brāhmaṇassa dassento ayaṃ kho me, brāhmaṇa, tatiyā vijjātiādimāha, tattha vijjāti arahattamaggavijjā. Avijjāti catusaccappaṭicchādikā avijjā. Ayaṃ kho me, brāhmaṇa, tatiyā abhinibbhidā ahosīti ettha ayaṃ kho mama, brāhmaṇa, āsavānaṃ khayañāṇamukhatuṇḍakena catusaccapaṭicchādakaṃ avijjaṇḍakosaṃ padāletvā tatiyā abhinibbhidā tatiyā nikkhanti tatiyā ariyajāti ahosi kukkuṭacchāpakasseva mukhatuṇḍakena vā pādanakhasikhāya vā aṇḍakosaṃ padāletvā tamhā aṇḍakosamhā abhinibbhidā nikkhanti kukkuṭanikāye paccājātīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettāvatā kiṃ dassesīti? So hi, brāhmaṇa, kukkuṭacchāpako aṇḍakosaṃ padāletvā tato nikkhamanto sakimeva jāyati, ahaṃ pana pubbenivutthakkhandhappaṭicchādakaṃ avijjaṇḍakosaṃ bhinditvā paṭhamaṃ tāva pubbenivāsānussatiñāṇavijjāya jāto. Tato sattānaṃ cutipaṭisandhippaṭicchādakaṃ avijjaṇḍakosaṃ padāletvā dutiyaṃ dibbacakkhuñāṇavijjāya jāto, puna catusaccappaṭicchādakaṃ avijjaṇḍakosaṃ padāletvā tatiyaṃ āsavānaṃ khayañāṇavijjāya jāto. Evaṃ tīhi vijjāhi tikkhattuṃ jātomhi. Sā ca me jāti ariyā suparisuddhāti idaṃ dasseti. Evaṃdassento ca pubbenivāsañāṇena atītaṃsañāṇaṃ, dibbacakkhunā paccuppannānāgataṃsañāṇaṃ, āsavakkhayena sakalalokiyalokuttaraguṇanti ",
      " evaṃ tīhi vijjāhi sabbepi sabbaññuguṇe pakāsetvā attano ariyāya jātiyā jeṭṭhaseṭṭhabhāvaṃ brāhmaṇassa dassesi."
    ],
    "innerText": "Ettāvatā kiṃ dassesīti? So hi, brāhmaṇa, kukkuṭacchāpako aṇḍakosaṃ padāletvā tato nikkhamanto sakimeva jāyati, ahaṃ pana pubbenivutthakkhandhappaṭicchādakaṃ avijjaṇḍakosaṃ bhinditvā paṭhamaṃ tāva pubbenivāsānussatiñāṇavijjāya jāto. Tato sattānaṃ cutipaṭisandhippaṭicchādakaṃ avijjaṇḍakosaṃ padāletvā dutiyaṃ dibbacakkhuñāṇavijjāya jāto, puna catusaccappaṭicchādakaṃ avijjaṇḍakosaṃ padāletvā tatiyaṃ āsavānaṃ khayañāṇavijjāya jāto. Evaṃ tīhi vijjāhi tikkhattuṃ jātomhi. Sā ca me jāti ariyā suparisuddhāti idaṃ dasseti. Evaṃdassento ca pubbenivāsañāṇena atītaṃsañāṇaṃ, dibbacakkhunā paccuppannānāgataṃsañāṇaṃ, āsavakkhayena sakalalokiyalokuttaraguṇanti evaṃ tīhi vijjāhi sabbepi sabbaññuguṇe pakāsetvā attano ariyāya jātiyā jeṭṭhaseṭṭhabhāvaṃ brāhmaṇassa dassesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ vutte verañjo brāhmaṇo"
      },
      "ti evaṃ bhagavatā lokānukampakena brāhmaṇaṃ anukampamānena niguhitabbepi attano ariyāya jātiyā jeṭṭhaseṭṭhabhāve vijjāttayapakāsikāya dhammadesanāya vutte pītivipphāraparipuṇṇagattacitto verañjo brāhmaṇo taṃ bhagavato ariyāya jātiyā jeṭṭhaseṭṭhabhāvaṃ viditvā ‘‘īdisaṃ nāmāhaṃ sabbalokajeṭṭhaṃ ",
      " sabbaguṇasamannāgataṃ sabbaññuṃ ‘aññesaṃ abhivādanādikammaṃ na karotī’ti avacaṃ, dhiratthu vata, bho, aññāṇa’’nti attānaṃ garahitvā ‘‘ayaṃ dāni loke ariyāya jātiyā purejātaṭṭhena jeṭṭho, sabbaguṇehi appaṭisamaṭṭhena seṭṭho’’ti niṭṭhaṃ gantvā bhagavantaṃ etadavoca – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jeṭṭho bhavaṃ gotamo seṭṭho bhavaṃ gotamo"
      },
      "ti. Evañca pana vatvā puna taṃ bhagavato dhammadesanaṃ abbhanumodamāno ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhikkantaṃ bho gotamā"
      },
      "tiādimāha. Taṃ vuttatthamevāti."
    ],
    "innerText": "Evaṃ vutte verañjo brāhmaṇoti evaṃ bhagavatā lokānukampakena brāhmaṇaṃ anukampamānena niguhitabbepi attano ariyāya jātiyā jeṭṭhaseṭṭhabhāve vijjāttayapakāsikāya dhammadesanāya vutte pītivipphāraparipuṇṇagattacitto verañjo brāhmaṇo taṃ bhagavato ariyāya jātiyā jeṭṭhaseṭṭhabhāvaṃ viditvā ‘‘īdisaṃ nāmāhaṃ sabbalokajeṭṭhaṃ sabbaguṇasamannāgataṃ sabbaññuṃ ‘aññesaṃ abhivādanādikammaṃ na karotī’ti avacaṃ, dhiratthu vata, bho, aññāṇa’’nti attānaṃ garahitvā ‘‘ayaṃ dāni loke ariyāya jātiyā purejātaṭṭhena jeṭṭho, sabbaguṇehi appaṭisamaṭṭhena seṭṭho’’ti niṭṭhaṃ gantvā bhagavantaṃ etadavoca – jeṭṭho bhavaṃ gotamo seṭṭho bhavaṃ gotamoti. Evañca pana vatvā puna taṃ bhagavato dhammadesanaṃ abbhanumodamāno abhikkantaṃ bho gotamātiādimāha. Taṃ vuttatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Sīhasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "12"
      },
      ". Dutiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhiññātā"
      },
      "ti ñātā paññātā pākaṭā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Santhāgāre"
      },
      "ti mahājanassa vissamanatthāya ",
      " kate agāre. Sā kira santhāgārasālā nagaramajjhe ahosi, catūsu ṭhānesu ṭhitānaṃ paññāyati, catūhi disāhi āgatamanussā paṭhamaṃ tattha vissamitvā pacchā attano attano phāsukaṭṭhānaṃ gacchanti. Rājakulānaṃ rajjakiccasantharaṇatthāya ",
      " kataṃ agārantipi vadantiyeva. Tattha hi nisīditvā licchavirājāno rajjakiccaṃ santharanti karonti vicārenti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sannisinnā"
      },
      "ti tesaṃ nisīdanatthaññeva paññattesu mahārahavarapaccattharaṇesu samussitasetacchattesu āsanesu sannisinnā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anekapariyāyena buddhassa vaṇṇaṃ bhāsantī"
      },
      "ti rājakule kiccañceva lokatthacariyañca vicāretvā anekehi kāraṇehi buddhassa vaṇṇaṃ bhāsanti kathenti dīpenti. Paṇḍitā hi te rājāno saddhā pasannā sotāpannāpi sakadāgāminopi anāgāminopi ariyasāvakā, te sabbepi lokiyajaṭaṃ chinditvā buddhādīnaṃ tiṇṇaṃ ratanānaṃ vaṇṇaṃ bhāsanti. Tattha tividho buddhavaṇṇo nāma cariyavaṇṇo, sarīravaṇṇo, guṇavaṇṇoti. Tatrime rājāno cariyāya vaṇṇaṃ ārabhiṃsu – ‘‘dukkaraṃ vata kataṃ sammāsambuddhena kappasatasahassādhikāni cattāri asaṅkheyyāni dasa pāramiyo, dasa upapāramiyo, dasa paramatthapāramiyoti samattiṃsa pāramiyo pūrentena, ñātatthacariyaṃ, lokatthacariyaṃ, buddhacariyaṃ matthakaṃ pāpetvā pañca mahāpariccāge pariccajantenā’’ti aḍḍhacchakkehi jātakasatehi buddhavaṇṇaṃ kathentā tusitabhavanaṃ pāpetvā ṭhapayiṃsu."
    ],
    "innerText": "12. Dutiye abhiññātāti ñātā paññātā pākaṭā. Santhāgāreti mahājanassa vissamanatthāya kate agāre. Sā kira santhāgārasālā nagaramajjhe ahosi, catūsu ṭhānesu ṭhitānaṃ paññāyati, catūhi disāhi āgatamanussā paṭhamaṃ tattha vissamitvā pacchā attano attano phāsukaṭṭhānaṃ gacchanti. Rājakulānaṃ rajjakiccasantharaṇatthāya kataṃ agārantipi vadantiyeva. Tattha hi nisīditvā licchavirājāno rajjakiccaṃ santharanti karonti vicārenti. Sannisinnāti tesaṃ nisīdanatthaññeva paññattesu mahārahavarapaccattharaṇesu samussitasetacchattesu āsanesu sannisinnā. Anekapariyāyena buddhassa vaṇṇaṃ bhāsantīti rājakule kiccañceva lokatthacariyañca vicāretvā anekehi kāraṇehi buddhassa vaṇṇaṃ bhāsanti kathenti dīpenti. Paṇḍitā hi te rājāno saddhā pasannā sotāpannāpi sakadāgāminopi anāgāminopi ariyasāvakā, te sabbepi lokiyajaṭaṃ chinditvā buddhādīnaṃ tiṇṇaṃ ratanānaṃ vaṇṇaṃ bhāsanti. Tattha tividho buddhavaṇṇo nāma cariyavaṇṇo, sarīravaṇṇo, guṇavaṇṇoti. Tatrime rājāno cariyāya vaṇṇaṃ ārabhiṃsu – ‘‘dukkaraṃ vata kataṃ sammāsambuddhena kappasatasahassādhikāni cattāri asaṅkheyyāni dasa pāramiyo, dasa upapāramiyo, dasa paramatthapāramiyoti samattiṃsa pāramiyo pūrentena, ñātatthacariyaṃ, lokatthacariyaṃ, buddhacariyaṃ matthakaṃ pāpetvā pañca mahāpariccāge pariccajantenā’’ti aḍḍhacchakkehi jātakasatehi buddhavaṇṇaṃ kathentā tusitabhavanaṃ pāpetvā ṭhapayiṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammassa"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vaṇṇaṃ"
      },
      " bhāsantā pana ‘‘tena bhagavatā dhammo desito, nikāyato pañca nikāyā, piṭakato tīṇi piṭakāni, aṅgato nava aṅgāni, khandhato caturāsītidhammakkhandhasahassānī’’ti koṭṭhāsavasena dhammaguṇaṃ kathayiṃsu."
    ],
    "innerText": "Dhammassavaṇṇaṃ bhāsantā pana ‘‘tena bhagavatā dhammo desito, nikāyato pañca nikāyā, piṭakato tīṇi piṭakāni, aṅgato nava aṅgāni, khandhato caturāsītidhammakkhandhasahassānī’’ti koṭṭhāsavasena dhammaguṇaṃ kathayiṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅghassa vaṇṇaṃ"
      },
      " bhāsantā satthu dhammadesanaṃ sutvā ‘‘paṭiladdhasaddhā kulaputtā bhogakkhandhañceva ñātiparivaṭṭañca ",
      " pahāya setacchattaṃ oparajjaṃ senāpatiseṭṭhibhaṇḍāgārikaṭṭhānantarādīni agaṇetvā nikkhamma satthu varasāsane pabbajanti. Setacchattaṃ pahāya pabbajitānaṃ bhaddiyarājamahākappinapukkusātiādīnaṃ rājapabbajitānaṃyeva buddhakāle asītisahassāni ahesuṃ. Anekakoṭisataṃ dhanaṃ pahāya pabbajitānaṃ pana yasakulaputtasoṇaseṭṭhiputtaraṭṭhapālakulaputtādīnaṃ paricchedo natthi. Evarūpā ca evarūpā ca kulaputtā satthu sāsane pabbajantī’’ti pabbajjāsaṅkhepavasena saṅghaguṇe kathayiṃsu."
    ],
    "innerText": "Saṅghassa vaṇṇaṃ bhāsantā satthu dhammadesanaṃ sutvā ‘‘paṭiladdhasaddhā kulaputtā bhogakkhandhañceva ñātiparivaṭṭañca pahāya setacchattaṃ oparajjaṃ senāpatiseṭṭhibhaṇḍāgārikaṭṭhānantarādīni agaṇetvā nikkhamma satthu varasāsane pabbajanti. Setacchattaṃ pahāya pabbajitānaṃ bhaddiyarājamahākappinapukkusātiādīnaṃ rājapabbajitānaṃyeva buddhakāle asītisahassāni ahesuṃ. Anekakoṭisataṃ dhanaṃ pahāya pabbajitānaṃ pana yasakulaputtasoṇaseṭṭhiputtaraṭṭhapālakulaputtādīnaṃ paricchedo natthi. Evarūpā ca evarūpā ca kulaputtā satthu sāsane pabbajantī’’ti pabbajjāsaṅkhepavasena saṅghaguṇe kathayiṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sīho"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "senāpatī"
      },
      "ti evaṃnāmako senāya adhipati. Vesāliyañhi satta sahassāni satta satāni satta ca rājāno. Te sabbepi sannipatitvā sabbesaṃ manaṃ gahetvā ‘‘raṭṭhaṃ vicāretuṃ samatthaṃ ekaṃ vicinathā’’ti vicinantā sīhaṃ rājakumāraṃ disvā ‘‘ayaṃ sakkhissatī’’ti sanniṭṭhānaṃ katvā tassa rattamaṇivaṇṇaṃ kambalapariyonaddhaṃ senāpaticchattaṃ adaṃsu. Taṃ sandhāya vuttaṃ – ‘‘sīho senāpatī’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nigaṇṭhasāvako"
      },
      "ti nigaṇṭhassa nāṭaputtassa paccayadāyako upaṭṭhāko. Jambudīpatalasmiñhi tayo janā nigaṇṭhānaṃ aggupaṭṭhākā – nāḷandāyaṃ, upāli gahapati, kapilapure vappo sakko, vesāliyaṃ ayaṃ sīho senāpatīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nisinno"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hotī"
      },
      "ti sesarājūnaṃ parisāya antarantare āsanāni paññāpayiṃsu, sīhassa pana majjhe ṭhāneti tasmiṃ paññatte mahārahe rājāsane nisinno hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nissaṃsaya"
      },
      "nti nibbicikicchaṃ addhā ekaṃsena, na hete yassa vā tassa vā appesakkhassa evaṃ anekasatehi kāraṇehi vaṇṇaṃ bhāsanti."
    ],
    "innerText": "Sīhosenāpatīti evaṃnāmako senāya adhipati. Vesāliyañhi satta sahassāni satta satāni satta ca rājāno. Te sabbepi sannipatitvā sabbesaṃ manaṃ gahetvā ‘‘raṭṭhaṃ vicāretuṃ samatthaṃ ekaṃ vicinathā’’ti vicinantā sīhaṃ rājakumāraṃ disvā ‘‘ayaṃ sakkhissatī’’ti sanniṭṭhānaṃ katvā tassa rattamaṇivaṇṇaṃ kambalapariyonaddhaṃ senāpaticchattaṃ adaṃsu. Taṃ sandhāya vuttaṃ – ‘‘sīho senāpatī’’ti. Nigaṇṭhasāvakoti nigaṇṭhassa nāṭaputtassa paccayadāyako upaṭṭhāko. Jambudīpatalasmiñhi tayo janā nigaṇṭhānaṃ aggupaṭṭhākā – nāḷandāyaṃ, upāli gahapati, kapilapure vappo sakko, vesāliyaṃ ayaṃ sīho senāpatīti. Nisinnohotīti sesarājūnaṃ parisāya antarantare āsanāni paññāpayiṃsu, sīhassa pana majjhe ṭhāneti tasmiṃ paññatte mahārahe rājāsane nisinno hoti. Nissaṃsayanti nibbicikicchaṃ addhā ekaṃsena, na hete yassa vā tassa vā appesakkhassa evaṃ anekasatehi kāraṇehi vaṇṇaṃ bhāsanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yena nigaṇṭho nāṭaputto tenupasaṅkamī"
      },
      "ti nigaṇṭho kira nāṭaputto ‘‘sacāyaṃ sīho kassacideva samaṇassa gotamassa vaṇṇaṃ kathentassa sutvā samaṇaṃ gotamaṃ dassanāya upasaṅkamissati, mayhaṃ parihāni bhavissatī’’ti ",
      " cintetvā paṭhamataraṃyeva sīhaṃ senāpatiṃ etadavoca – ‘‘senāpati imasmiṃ loke ‘ahaṃ buddho ahaṃ buddho’ti bahū vicaranti. Sace tvaṃ kassaci dassanāya upasaṅkamitukāmo ahosi, maṃ puccheyyāsi. Ahaṃ te yuttaṭṭhānaṃ pesessāmi, ayuttaṭṭhānato nivāressāmī’’ti. So taṃ kathaṃ anussaritvā ‘‘sace maṃ pesessati, gamissāmi. No ce, na gamissāmī’’ti cintetvā yena nigaṇṭho nāṭaputto, tenupasaṅkami."
    ],
    "innerText": "Yena nigaṇṭho nāṭaputto tenupasaṅkamīti nigaṇṭho kira nāṭaputto ‘‘sacāyaṃ sīho kassacideva samaṇassa gotamassa vaṇṇaṃ kathentassa sutvā samaṇaṃ gotamaṃ dassanāya upasaṅkamissati, mayhaṃ parihāni bhavissatī’’ti cintetvā paṭhamataraṃyeva sīhaṃ senāpatiṃ etadavoca – ‘‘senāpati imasmiṃ loke ‘ahaṃ buddho ahaṃ buddho’ti bahū vicaranti. Sace tvaṃ kassaci dassanāya upasaṅkamitukāmo ahosi, maṃ puccheyyāsi. Ahaṃ te yuttaṭṭhānaṃ pesessāmi, ayuttaṭṭhānato nivāressāmī’’ti. So taṃ kathaṃ anussaritvā ‘‘sace maṃ pesessati, gamissāmi. No ce, na gamissāmī’’ti cintetvā yena nigaṇṭho nāṭaputto, tenupasaṅkami."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Athassa vacanaṃ sutvā nigaṇṭho mahāpabbatena viya balavasokena otthaṭo ‘‘yattha dānissāhaṃ gamanaṃ na icchāmi, tattheva gantukāmo jāto, hatohamasmī’’ti anattamano hutvā ‘‘paṭibāhanupāyamassa karissāmī’’ti cintetvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kiṃ pana tva"
      },
      "ntiādimāha. Evaṃ vadanto vicarantaṃ goṇaṃ daṇḍena paharanto viya jalamānaṃ padīpaṃ nibbāpento viya bhattabharitaṃ pattaṃ nikkujjanto viya ca sīhassa uppannapītiṃ vināsesi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gamiyābhisaṅkhāro"
      },
      "ti hatthiyānādīnaṃ yojāpanagandhamālādiggahaṇavasena pavatto payogo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "So paṭippassambhī"
      },
      "ti ",
      " so vūpasanto."
    ],
    "innerText": "Athassa vacanaṃ sutvā nigaṇṭho mahāpabbatena viya balavasokena otthaṭo ‘‘yattha dānissāhaṃ gamanaṃ na icchāmi, tattheva gantukāmo jāto, hatohamasmī’’ti anattamano hutvā ‘‘paṭibāhanupāyamassa karissāmī’’ti cintetvā kiṃ pana tvantiādimāha. Evaṃ vadanto vicarantaṃ goṇaṃ daṇḍena paharanto viya jalamānaṃ padīpaṃ nibbāpento viya bhattabharitaṃ pattaṃ nikkujjanto viya ca sīhassa uppannapītiṃ vināsesi. Gamiyābhisaṅkhāroti hatthiyānādīnaṃ yojāpanagandhamālādiggahaṇavasena pavatto payogo. So paṭippassambhīti so vūpasanto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dutiyampi kho"
      },
      "ti dutiyavārampi. Imasmiñca vāre buddhassa vaṇṇaṃ bhāsantā tusitabhavanato paṭṭhāya yāva mahābodhipallaṅkā dasabalassa heṭṭhā pādatalehi upari kesaggehi paricchinditvā ",
      " dvattiṃsamahāpurisalakkhaṇaasītianubyañjanabyāmappabhānaṃ vasena sarīravaṇṇaṃ kathayiṃsu. Dhammassa vaṇṇaṃ bhāsantā ‘‘ekapadepi ekabyañjanepi avakhalitaṃ nāma natthī’’ti sukathitavaseneva dhammaguṇaṃ kathayiṃsu. Saṅghassa vaṇṇaṃ bhāsantā ‘‘evarūpaṃ yasasirivibhavaṃ pahāya satthu sāsane pabbajitā na kosajjapakatikā honti, terasasu pana dhutaṅgaguṇesu paripūrakārino hutvā sattasu anupassanāsu kammaṃ karonti, aṭṭhatiṃsārammaṇavibhattiyo vaḷañjentī’’ti paṭipadāvasena saṅghaguṇe kathayiṃsu."
    ],
    "innerText": "Dutiyampi khoti dutiyavārampi. Imasmiñca vāre buddhassa vaṇṇaṃ bhāsantā tusitabhavanato paṭṭhāya yāva mahābodhipallaṅkā dasabalassa heṭṭhā pādatalehi upari kesaggehi paricchinditvā dvattiṃsamahāpurisalakkhaṇaasītianubyañjanabyāmappabhānaṃ vasena sarīravaṇṇaṃ kathayiṃsu. Dhammassa vaṇṇaṃ bhāsantā ‘‘ekapadepi ekabyañjanepi avakhalitaṃ nāma natthī’’ti sukathitavaseneva dhammaguṇaṃ kathayiṃsu. Saṅghassa vaṇṇaṃ bhāsantā ‘‘evarūpaṃ yasasirivibhavaṃ pahāya satthu sāsane pabbajitā na kosajjapakatikā honti, terasasu pana dhutaṅgaguṇesu paripūrakārino hutvā sattasu anupassanāsu kammaṃ karonti, aṭṭhatiṃsārammaṇavibhattiyo vaḷañjentī’’ti paṭipadāvasena saṅghaguṇe kathayiṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatiyavāre pana buddhassa vaṇṇaṃ bhāsamānā ‘‘itipi so bhagavā’’ti suttantapariyāyeneva buddhaguṇe kathayiṃsu, ‘‘svākkhāto bhagavatā dhammo’’tiādinā suttantapariyāyeneva dhammaguṇe, ‘‘suppaṭipanno bhagavato ",
      " sāvakasaṅgho’’tiādinā suttantapariyāyeneva saṅghaguṇe ca kathayiṃsu. Tato sīho cintesi – ‘‘imesañca licchavirājakumārānaṃ tatiyadivasato paṭṭhāya buddhadhammasaṅghaguṇe kathentānaṃ mukhaṃ nappahoti, addhā anomaguṇena samannāgatā ",
      " so bhagavā, imaṃ dāni uppannaṃ pītiṃ avijahitvāva ahaṃ ajja sammāsambuddhaṃ passissāmī’’ti. Athassa ‘‘kiṃ hi me karissanti nigaṇṭhā’’ti vitakko udapādi. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kiṃ hi me karissantī"
      },
      "ti kiṃ nāma mayhaṃ nigaṇṭhā karissanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Apalokitā vā anapalokitā vā"
      },
      "ti āpucchitā vā anāpucchitā vā. Na hi me te āpucchitā yānavāhanasampattiṃ, na ca issariyavisesaṃ dassanti, nāpi anāpucchitā harissanti, aphalaṃ etesaṃ āpucchananti adhippāyo."
    ],
    "innerText": "Tatiyavāre pana buddhassa vaṇṇaṃ bhāsamānā ‘‘itipi so bhagavā’’ti suttantapariyāyeneva buddhaguṇe kathayiṃsu, ‘‘svākkhāto bhagavatā dhammo’’tiādinā suttantapariyāyeneva dhammaguṇe, ‘‘suppaṭipanno bhagavato sāvakasaṅgho’’tiādinā suttantapariyāyeneva saṅghaguṇe ca kathayiṃsu. Tato sīho cintesi – ‘‘imesañca licchavirājakumārānaṃ tatiyadivasato paṭṭhāya buddhadhammasaṅghaguṇe kathentānaṃ mukhaṃ nappahoti, addhā anomaguṇena samannāgatā so bhagavā, imaṃ dāni uppannaṃ pītiṃ avijahitvāva ahaṃ ajja sammāsambuddhaṃ passissāmī’’ti. Athassa ‘‘kiṃ hi me karissanti nigaṇṭhā’’ti vitakko udapādi. Tattha kiṃ hi me karissantīti kiṃ nāma mayhaṃ nigaṇṭhā karissanti. Apalokitā vā anapalokitā vāti āpucchitā vā anāpucchitā vā. Na hi me te āpucchitā yānavāhanasampattiṃ, na ca issariyavisesaṃ dassanti, nāpi anāpucchitā harissanti, aphalaṃ etesaṃ āpucchananti adhippāyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vesāliyā niyyāsī"
      },
      "ti yathā hi gimhakāle deve vuṭṭhe udakaṃ sandamānaṃ nadiṃ otaritvā thokameva gantvā tiṭṭhati nappavattati, evaṃ sīhassa paṭhamadivase ‘‘dasabalaṃ passissāmī’’ti uppannāya pītiyā nigaṇṭhena paṭibāhitakālo. Yathāpi dutiyadivase deve vuṭṭhe udakaṃ sandamānaṃ nadiṃ otaritvā thokaṃ gantvā vālikāpuñjaṃ paharitvā appavattaṃ hoti, evaṃ sīhassa dutiyadivase ‘‘dasabalaṃ passissāmī’’ti uppannāya pītiyā nigaṇṭhena paṭibāhitakālo. Yathā tatiyadivase deve vuṭṭhe udakaṃ sandamānaṃ nadiṃ otaritvā purāṇapaṇṇasukkhadaṇḍakaṭṭhakacavarādīni parikaḍḍhantaṃ vālikāpuñjaṃ bhinditvā samuddaninnameva hoti, evaṃ sīho tatiyadivase tiṇṇaṃ vatthūnaṃ guṇakathaṃ sutvā uppanne pītipāmojje ‘‘aphalā nigaṇṭhā nipphalā nigaṇṭhā, kiṃ me ime karissanti, gamissāmahaṃ satthusantika’’nti manaṃ abhinīharitvā vesāliyā niyyāsi. Niyyanto ca ‘‘cirassāhaṃ dasabalassa santikaṃ gantukāmo ",
      " jāto, na kho pana me yuttaṃ aññātakavesena ",
      " gantu’’nti ‘‘yekeci dasabalassa santikaṃ gantukāmā, sabbe nikkhamantū’’ti ghosanaṃ kāretvā pañcarathasatāni yojāpetvā uttamarathe ṭhito tehi ceva pañcahi rathasatehi mahatiyā ca parisāya parivuto gandhapupphacuṇṇavāsādīni gāhāpetvā niyyāsi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Divā divassā"
      },
      "ti divasassa ca divā, majjhanhike atikkantamatte."
    ],
    "innerText": "Vesāliyā niyyāsīti yathā hi gimhakāle deve vuṭṭhe udakaṃ sandamānaṃ nadiṃ otaritvā thokameva gantvā tiṭṭhati nappavattati, evaṃ sīhassa paṭhamadivase ‘‘dasabalaṃ passissāmī’’ti uppannāya pītiyā nigaṇṭhena paṭibāhitakālo. Yathāpi dutiyadivase deve vuṭṭhe udakaṃ sandamānaṃ nadiṃ otaritvā thokaṃ gantvā vālikāpuñjaṃ paharitvā appavattaṃ hoti, evaṃ sīhassa dutiyadivase ‘‘dasabalaṃ passissāmī’’ti uppannāya pītiyā nigaṇṭhena paṭibāhitakālo. Yathā tatiyadivase deve vuṭṭhe udakaṃ sandamānaṃ nadiṃ otaritvā purāṇapaṇṇasukkhadaṇḍakaṭṭhakacavarādīni parikaḍḍhantaṃ vālikāpuñjaṃ bhinditvā samuddaninnameva hoti, evaṃ sīho tatiyadivase tiṇṇaṃ vatthūnaṃ guṇakathaṃ sutvā uppanne pītipāmojje ‘‘aphalā nigaṇṭhā nipphalā nigaṇṭhā, kiṃ me ime karissanti, gamissāmahaṃ satthusantika’’nti manaṃ abhinīharitvā vesāliyā niyyāsi. Niyyanto ca ‘‘cirassāhaṃ dasabalassa santikaṃ gantukāmo jāto, na kho pana me yuttaṃ aññātakavesena gantu’’nti ‘‘yekeci dasabalassa santikaṃ gantukāmā, sabbe nikkhamantū’’ti ghosanaṃ kāretvā pañcarathasatāni yojāpetvā uttamarathe ṭhito tehi ceva pañcahi rathasatehi mahatiyā ca parisāya parivuto gandhapupphacuṇṇavāsādīni gāhāpetvā niyyāsi. Divā divassāti divasassa ca divā, majjhanhike atikkantamatte."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yena bhagavā tenupasaṅkamī"
      },
      "ti ārāmaṃ pavisanto dūratova asīti-anubyañjana-byāmappabhā-dvattiṃsa-mahāpurisalakkhaṇāni chabbaṇṇaghanabuddharasmiyo ca disvā ‘‘evarūpaṃ nāma purisaṃ evaṃ āsanne vasantaṃ ettakaṃ kālaṃ nāddasaṃ, vañcito ",
      " vatamhi, alābhā vata me’’ti cintetvā mahānidhiṃ disvā daliddapuriso viya sañjātapītipāmojjo yena bhagavā tenupasaṅkami. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammassa cānudhammaṃ byākarontī"
      },
      "ti bhotā gotamena vuttakāraṇassa anukāraṇaṃ kathenti. Kāraṇavacano hettha dhammasaddo ‘‘hetumhi ñāṇaṃ dhammapaṭisambhidā’’tiādīsu (vibha. 720) viya. Kāraṇanti cettha tathāpavattassa saddassa attho adhippeto tassa pavattihetubhāvato. Atthappayutto hi saddappayogo. Anukāraṇanti eso eva parehi tathā vuccamāno. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahadhammiko vādānuvādoti"
      },
      ". Parehi vuttakāraṇehi sakāraṇo hutvā tumhākaṃ vādo vā tato paraṃ tassa anuvādo vā koci appamattakopi viññūhi garahitabbaṃ ṭhānaṃ kāraṇaṃ na āgacchati. Idaṃ vuttaṃ hoti – kiṃ sabbākārenapi tava vāde gārayhaṃ kāraṇaṃ natthīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anabbhakkhātukāmā"
      },
      "ti na abhūtena vattukāmā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atthi sīhapariyāyo"
      },
      "tiādīnaṃ attho verañjakaṇḍe āgatanayeneva veditabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paramena"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "assāsenā"
      },
      "ti catumaggacatuphalasaṅkhātena uttamena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Assāsāya dhammaṃ desemī"
      },
      "ti assāsanatthāya santhambhanatthāya dhammaṃ desemi. Iti bhagavā aṭṭhahaṅgehi sīhassa senāpatissa dhammaṃ desesi."
    ],
    "innerText": "Yena bhagavā tenupasaṅkamīti ārāmaṃ pavisanto dūratova asīti-anubyañjana-byāmappabhā-dvattiṃsa-mahāpurisalakkhaṇāni chabbaṇṇaghanabuddharasmiyo ca disvā ‘‘evarūpaṃ nāma purisaṃ evaṃ āsanne vasantaṃ ettakaṃ kālaṃ nāddasaṃ, vañcito vatamhi, alābhā vata me’’ti cintetvā mahānidhiṃ disvā daliddapuriso viya sañjātapītipāmojjo yena bhagavā tenupasaṅkami. Dhammassa cānudhammaṃ byākarontīti bhotā gotamena vuttakāraṇassa anukāraṇaṃ kathenti. Kāraṇavacano hettha dhammasaddo ‘‘hetumhi ñāṇaṃ dhammapaṭisambhidā’’tiādīsu (vibha. 720) viya. Kāraṇanti cettha tathāpavattassa saddassa attho adhippeto tassa pavattihetubhāvato. Atthappayutto hi saddappayogo. Anukāraṇanti eso eva parehi tathā vuccamāno. Sahadhammiko vādānuvādoti. Parehi vuttakāraṇehi sakāraṇo hutvā tumhākaṃ vādo vā tato paraṃ tassa anuvādo vā koci appamattakopi viññūhi garahitabbaṃ ṭhānaṃ kāraṇaṃ na āgacchati. Idaṃ vuttaṃ hoti – kiṃ sabbākārenapi tava vāde gārayhaṃ kāraṇaṃ natthīti. Anabbhakkhātukāmāti na abhūtena vattukāmā. Atthi sīhapariyāyotiādīnaṃ attho verañjakaṇḍe āgatanayeneva veditabbo. Paramenaassāsenāti catumaggacatuphalasaṅkhātena uttamena. Assāsāya dhammaṃ desemīti assāsanatthāya santhambhanatthāya dhammaṃ desemi. Iti bhagavā aṭṭhahaṅgehi sīhassa senāpatissa dhammaṃ desesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anuviccakāra"
      },
      "nti anuviditvā cintetvā tulayitvā kattabbaṃ karohīti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sādhu hotī"
      },
      "ti sundaro hoti. Tumhādisasmiñhi maṃ disvā maṃ saraṇaṃ gacchante nigaṇṭhaṃ disvā nigaṇṭhaṃ saraṇaṃ gacchante ‘‘kiṃ ayaṃ sīho diṭṭhadiṭṭhameva saraṇaṃ gacchatī’’ti garahā uppajjati, tasmā anuviccakāro tumhādisānaṃ sādhūti dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭākaṃ parihareyyu"
      },
      "nti te kira evarūpaṃ sāvakaṃ labhitvā ‘‘asuko nāma rājā vā rājamahāmatto vā seṭṭhi vā amhākaṃ saraṇaṃ gato sāvako jāto’’ti paṭākaṃ ukkhipitvā nagare ghosentā āhiṇḍanti. Kasmā? Evaṃ no mahantabhāvo ",
      " āvibhavissatīti ca. Sace panassa ‘‘kimahaṃ etesaṃ saraṇaṃ gato’’ti vippaṭisāro uppajjeyya, tampi so ‘‘etesaṃ me saraṇagatabhāvaṃ bahū jānanti, dukkhaṃ idāni paṭinivattitu’’nti vinodetvā na paṭikkamissatīti ca. Tenāha – ‘‘paṭākaṃ parihareyyu’’nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Opānabhūta"
      },
      "nti paṭiyattaudapāno viya ṭhitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kula"
      },
      "nti tava nivesanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dātabbaṃ maññeyyāsī"
      },
      "ti pubbe dasapi vīsatipi saṭṭhipi jane āgate disvā ",
      " natthīti avatvā desi, idāni maṃ ",
      " saraṇaṃ gatakāraṇamatteneva mā imesaṃ deyyadhammaṃ upacchindi. Sampattānañhi dātabbamevāti ovadi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sutaṃ metaṃ, bhante"
      },
      "ti kuto sutanti? Nigaṇṭhānaṃ santikā. Te kira kulagharesu evaṃ pakāsenti ‘‘mayaṃ yassa kassaci sampattassa dātabbanti vadāma, samaṇo pana gotamo ‘mayhameva dānaṃ dātabbaṃ nāññesaṃ, mayhameva sāvakānaṃ dānaṃ dātabbaṃ, nāññesaṃ sāvakānaṃ, mayhameva dinnaṃ dānaṃ mahapphalaṃ, nāññesaṃ, mayhameva sāvakānaṃ dinnaṃ mahapphalaṃ, nāññesa’nti evaṃ vadatī’’ti. Taṃ sandhāya ayaṃ ‘‘sutaṃ meta’’nti āha."
    ],
    "innerText": "Anuviccakāranti anuviditvā cintetvā tulayitvā kattabbaṃ karohīti vuttaṃ hoti. Sādhu hotīti sundaro hoti. Tumhādisasmiñhi maṃ disvā maṃ saraṇaṃ gacchante nigaṇṭhaṃ disvā nigaṇṭhaṃ saraṇaṃ gacchante ‘‘kiṃ ayaṃ sīho diṭṭhadiṭṭhameva saraṇaṃ gacchatī’’ti garahā uppajjati, tasmā anuviccakāro tumhādisānaṃ sādhūti dasseti. Paṭākaṃ parihareyyunti te kira evarūpaṃ sāvakaṃ labhitvā ‘‘asuko nāma rājā vā rājamahāmatto vā seṭṭhi vā amhākaṃ saraṇaṃ gato sāvako jāto’’ti paṭākaṃ ukkhipitvā nagare ghosentā āhiṇḍanti. Kasmā? Evaṃ no mahantabhāvo āvibhavissatīti ca. Sace panassa ‘‘kimahaṃ etesaṃ saraṇaṃ gato’’ti vippaṭisāro uppajjeyya, tampi so ‘‘etesaṃ me saraṇagatabhāvaṃ bahū jānanti, dukkhaṃ idāni paṭinivattitu’’nti vinodetvā na paṭikkamissatīti ca. Tenāha – ‘‘paṭākaṃ parihareyyu’’nti. Opānabhūtanti paṭiyattaudapāno viya ṭhitaṃ. Kulanti tava nivesanaṃ. Dātabbaṃ maññeyyāsīti pubbe dasapi vīsatipi saṭṭhipi jane āgate disvā natthīti avatvā desi, idāni maṃ saraṇaṃ gatakāraṇamatteneva mā imesaṃ deyyadhammaṃ upacchindi. Sampattānañhi dātabbamevāti ovadi. Sutaṃ metaṃ, bhanteti kuto sutanti? Nigaṇṭhānaṃ santikā. Te kira kulagharesu evaṃ pakāsenti ‘‘mayaṃ yassa kassaci sampattassa dātabbanti vadāma, samaṇo pana gotamo ‘mayhameva dānaṃ dātabbaṃ nāññesaṃ, mayhameva sāvakānaṃ dānaṃ dātabbaṃ, nāññesaṃ sāvakānaṃ, mayhameva dinnaṃ dānaṃ mahapphalaṃ, nāññesaṃ, mayhameva sāvakānaṃ dinnaṃ mahapphalaṃ, nāññesa’nti evaṃ vadatī’’ti. Taṃ sandhāya ayaṃ ‘‘sutaṃ meta’’nti āha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anupubbiṃ katha"
      },
      "nti dānānantaraṃ sīlaṃ, sīlānantaraṃ saggaṃ, saggānantaraṃ magganti evaṃ anupaṭipāṭikathaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dānakatha"
      },
      "nti idaṃ dānaṃ nāma sukhānaṃ nidānaṃ, sampattīnaṃ mūlaṃ, bhogānaṃ patiṭṭhā, visamagatassa tāṇaṃ leṇaṃ gati parāyaṇaṃ, idhalokaparalokesu dānasadiso avassayo patiṭṭhā ārammaṇaṃ tāṇaṃ leṇaṃ gati parāyaṇaṃ natthi. Idañhi avassayaṭṭhena ratanamayasīhāsanasadisaṃ, patiṭṭhānaṭṭhena mahāpathavīsadisaṃ, ārammaṇaṭṭhena ālambanarajjusadisaṃ. Idañhi dukkhanittharaṇaṭṭhena nāvā, samassāsanaṭṭhena saṅgāmasūro, bhayaparittāṇaṭṭhena ",
      " susaṅkhatanagaraṃ, maccheramalādīhi anupalittaṭṭhena padumaṃ, tesaṃ nidahanaṭṭhena aggi, durāsadaṭṭhena āsiviso, asantāsanaṭṭhena sīho, balavantaṭṭhena hatthī, abhimaṅgalasammataṭṭhena setavasabho, khemantabhūmisampāpanaṭṭhena valāhako assarājā. Dānaṃ nāmetaṃ mayā gatamaggo, mayheso vaṃso, mayā dasa pāramiyo pūrentena velāmamahāyañño, mahāgovindamahāyañño, mahāsudassanamahāyañño, vessantaramahāyaññoti, anekamahāyaññā pavattitā, sasabhūtena jalitaaggikkhandhe attānaṃ niyyādentena sampattayācakānaṃ cittaṃ gahitaṃ. Dānañhi loke sakkasampattiṃ deti mārasampattiṃ brahmasampattiṃ, cakkavattisampattiṃ, sāvakapāramīñāṇaṃ, paccekabodhiñāṇaṃ, abhisambodhiñāṇaṃ detīti evamādidānaguṇappaṭisaṃyuttaṃ kathaṃ."
    ],
    "innerText": "Anupubbiṃ kathanti dānānantaraṃ sīlaṃ, sīlānantaraṃ saggaṃ, saggānantaraṃ magganti evaṃ anupaṭipāṭikathaṃ. Tattha dānakathanti idaṃ dānaṃ nāma sukhānaṃ nidānaṃ, sampattīnaṃ mūlaṃ, bhogānaṃ patiṭṭhā, visamagatassa tāṇaṃ leṇaṃ gati parāyaṇaṃ, idhalokaparalokesu dānasadiso avassayo patiṭṭhā ārammaṇaṃ tāṇaṃ leṇaṃ gati parāyaṇaṃ natthi. Idañhi avassayaṭṭhena ratanamayasīhāsanasadisaṃ, patiṭṭhānaṭṭhena mahāpathavīsadisaṃ, ārammaṇaṭṭhena ālambanarajjusadisaṃ. Idañhi dukkhanittharaṇaṭṭhena nāvā, samassāsanaṭṭhena saṅgāmasūro, bhayaparittāṇaṭṭhena susaṅkhatanagaraṃ, maccheramalādīhi anupalittaṭṭhena padumaṃ, tesaṃ nidahanaṭṭhena aggi, durāsadaṭṭhena āsiviso, asantāsanaṭṭhena sīho, balavantaṭṭhena hatthī, abhimaṅgalasammataṭṭhena setavasabho, khemantabhūmisampāpanaṭṭhena valāhako assarājā. Dānaṃ nāmetaṃ mayā gatamaggo, mayheso vaṃso, mayā dasa pāramiyo pūrentena velāmamahāyañño, mahāgovindamahāyañño, mahāsudassanamahāyañño, vessantaramahāyaññoti, anekamahāyaññā pavattitā, sasabhūtena jalitaaggikkhandhe attānaṃ niyyādentena sampattayācakānaṃ cittaṃ gahitaṃ. Dānañhi loke sakkasampattiṃ deti mārasampattiṃ brahmasampattiṃ, cakkavattisampattiṃ, sāvakapāramīñāṇaṃ, paccekabodhiñāṇaṃ, abhisambodhiñāṇaṃ detīti evamādidānaguṇappaṭisaṃyuttaṃ kathaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yasmā pana dānaṃ dento sīlaṃ samādātuṃ sakkoti, tasmā tadanantaraṃ sīlakathaṃ kathesi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sīlakatha"
      },
      "nti ",
      " sīlaṃ nāmetaṃ avassayo patiṭṭhā ārammaṇaṃ tāṇaṃ leṇaṃ gati parāyaṇaṃ. Sīlaṃ nāmetaṃ mama vaṃso ",
      ", ahaṃ saṅkhapālanāgarājakāle bhūridattanāgarājakāle campeyyanāgarājakāle sīlavarājakāle mātuposakahatthirājakāle chaddantahatthirājakāleti anantesu attabhāvesu sīlaṃ paripūresiṃ. Idhalokaparalokasampattīnañhi sīlasadiso avassayo patiṭṭhā ārammaṇaṃ tāṇaṃ leṇaṃ gati parāyaṇaṃ natthi, sīlālaṅkārasadiso alaṅkāro natthi, sīlapupphasadisaṃ pupphaṃ natthi, sīlagandhasadiso gandho natthi. Sīlālaṅkārena hi alaṅkataṃ sīlagandhānulittaṃ sadevakopi loko ",
      " olokento tittiṃ na gacchatīti evamādisīlaguṇappaṭisaṃyuttaṃ kathaṃ."
    ],
    "innerText": "Yasmā pana dānaṃ dento sīlaṃ samādātuṃ sakkoti, tasmā tadanantaraṃ sīlakathaṃ kathesi. Sīlakathanti sīlaṃ nāmetaṃ avassayo patiṭṭhā ārammaṇaṃ tāṇaṃ leṇaṃ gati parāyaṇaṃ. Sīlaṃ nāmetaṃ mama vaṃso , ahaṃ saṅkhapālanāgarājakāle bhūridattanāgarājakāle campeyyanāgarājakāle sīlavarājakāle mātuposakahatthirājakāle chaddantahatthirājakāleti anantesu attabhāvesu sīlaṃ paripūresiṃ. Idhalokaparalokasampattīnañhi sīlasadiso avassayo patiṭṭhā ārammaṇaṃ tāṇaṃ leṇaṃ gati parāyaṇaṃ natthi, sīlālaṅkārasadiso alaṅkāro natthi, sīlapupphasadisaṃ pupphaṃ natthi, sīlagandhasadiso gandho natthi. Sīlālaṅkārena hi alaṅkataṃ sīlagandhānulittaṃ sadevakopi loko olokento tittiṃ na gacchatīti evamādisīlaguṇappaṭisaṃyuttaṃ kathaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idaṃ pana sīlaṃ nissāya ayaṃ saggo labbhatī’’ti dassetuṃ sīlānantaraṃ saggakathaṃ kathesi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saggakatha"
      },
      "nti ‘‘ayaṃ saggo nāma iṭṭho kanto manāpo, niccamettha kīḷā, niccaṃ sampattiyo labbhanti, cātumahārājikā devā navutivassasatasahassāni dibbasukhaṃ dibbasampattiṃ anubhavanti, tāvatiṃsā tisso ca vassakoṭiyo saṭṭhi ca vassasatasahassānī’’ti evamādisaggaguṇappaṭisaṃyuttaṃ kathaṃ. Saggasampattiṃ kathayantānañhi buddhānaṃ mukhaṃ nappahoti. Vuttampi cetaṃ – ‘‘anekapariyāyena khvāhaṃ, bhikkhave, saggakathaṃ katheyya’’ntiādi (ma. ni. 3.255)."
    ],
    "innerText": "‘‘Idaṃ pana sīlaṃ nissāya ayaṃ saggo labbhatī’’ti dassetuṃ sīlānantaraṃ saggakathaṃ kathesi. Saggakathanti ‘‘ayaṃ saggo nāma iṭṭho kanto manāpo, niccamettha kīḷā, niccaṃ sampattiyo labbhanti, cātumahārājikā devā navutivassasatasahassāni dibbasukhaṃ dibbasampattiṃ anubhavanti, tāvatiṃsā tisso ca vassakoṭiyo saṭṭhi ca vassasatasahassānī’’ti evamādisaggaguṇappaṭisaṃyuttaṃ kathaṃ. Saggasampattiṃ kathayantānañhi buddhānaṃ mukhaṃ nappahoti. Vuttampi cetaṃ – ‘‘anekapariyāyena khvāhaṃ, bhikkhave, saggakathaṃ katheyya’’ntiādi (ma. ni. 3.255)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ saggakathāya palobhetvā pana hatthiṃ alaṅkaritvā tassa soṇḍaṃ chindanto viya ‘‘ayampi saggo anicco addhuvo, na ettha chandarāgo kattabbo’’ti dassanatthaṃ ‘‘appassādā kāmā bahudukkhā bahupāyāsā, ādīnavo ettha bhiyyo’’tiādinā (ma. ni. 1.235-236; 2.42) nayena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāmānaṃ ādīnavaṃ okāraṃ saṃkilesaṃ"
      },
      " kathesi. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ādīnavo"
      },
      "ti doso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Okāro"
      },
      "ti avakāro lāmakabhāvo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṃkileso"
      },
      "ti tehi sattānaṃ saṃsāre saṃkilissanaṃ. Yathāha – ‘‘saṃkilissanti vata, bho, sattā’’ti (ma. ni. 2.351)."
    ],
    "innerText": "Evaṃ saggakathāya palobhetvā pana hatthiṃ alaṅkaritvā tassa soṇḍaṃ chindanto viya ‘‘ayampi saggo anicco addhuvo, na ettha chandarāgo kattabbo’’ti dassanatthaṃ ‘‘appassādā kāmā bahudukkhā bahupāyāsā, ādīnavo ettha bhiyyo’’tiādinā (ma. ni. 1.235-236; 2.42) nayena kāmānaṃ ādīnavaṃ okāraṃ saṃkilesaṃ kathesi. Tattha ādīnavoti doso. Okāroti avakāro lāmakabhāvo. Saṃkilesoti tehi sattānaṃ saṃsāre saṃkilissanaṃ. Yathāha – ‘‘saṃkilissanti vata, bho, sattā’’ti (ma. ni. 2.351)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ kāmādīnavena tajjetvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nekkhamme ānisaṃsaṃ pakāsesi. Kallacitta"
      },
      "nti arogacittaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sāmukkaṃsikā"
      },
      "ti sāmaṃ ukkaṃsikā attanāyeva uddharitvā gahitā, sayambhuñāṇena ",
      " diṭṭhā asādhāraṇā aññesanti attho. Kā pana sāti? Ariyasaccadesanā. Tenevāha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dukkhaṃ samudayaṃ nirodhaṃ magga"
      },
      "nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Virajaṃ vītamala"
      },
      "nti rāgarajādīnaṃ abhāvā virajaṃ, rāgamalādīnaṃ ",
      " vigatattā vītamalaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammacakkhu"
      },
      "nti idha sotāpattimaggo adhippeto. Tassa uppattiākāradassanatthaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yaṃkiñci samudayadhammaṃ sabbaṃ taṃ nirodhadhamma"
      },
      "nti āha. Tañhi nirodhaṃ ārammaṇaṃ katvā kiccavasena evaṃ sabbasaṅkhataṃ paṭivijjhantaṃ uppajjati. Diṭṭho ariyasaccadhammo etenāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "diṭṭhadhammo"
      },
      ". Esa nayo sesesupi. Tiṇṇā vicikicchā anenāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tiṇṇavicikiccho"
      },
      ". Vigatā kathaṃkathā assāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vigatakathaṃkatho"
      },
      ". Visārajjaṃ pattoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vesārajjappatto"
      },
      ". Kattha? Satthusāsane. Nāssa paro paccayo, na paraṃ saddhāya ettha vattatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aparappaccayo"
      },
      "."
    ],
    "innerText": "Evaṃ kāmādīnavena tajjetvā nekkhamme ānisaṃsaṃ pakāsesi. Kallacittanti arogacittaṃ. Sāmukkaṃsikāti sāmaṃ ukkaṃsikā attanāyeva uddharitvā gahitā, sayambhuñāṇena diṭṭhā asādhāraṇā aññesanti attho. Kā pana sāti? Ariyasaccadesanā. Tenevāha – dukkhaṃ samudayaṃ nirodhaṃ magganti. Virajaṃ vītamalanti rāgarajādīnaṃ abhāvā virajaṃ, rāgamalādīnaṃ vigatattā vītamalaṃ. Dhammacakkhunti idha sotāpattimaggo adhippeto. Tassa uppattiākāradassanatthaṃ yaṃkiñci samudayadhammaṃ sabbaṃ taṃ nirodhadhammanti āha. Tañhi nirodhaṃ ārammaṇaṃ katvā kiccavasena evaṃ sabbasaṅkhataṃ paṭivijjhantaṃ uppajjati. Diṭṭho ariyasaccadhammo etenāti diṭṭhadhammo. Esa nayo sesesupi. Tiṇṇā vicikicchā anenāti tiṇṇavicikiccho. Vigatā kathaṃkathā assāti vigatakathaṃkatho. Visārajjaṃ pattoti vesārajjappatto. Kattha? Satthusāsane. Nāssa paro paccayo, na paraṃ saddhāya ettha vattatīti aparappaccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pavattamaṃsa"
      },
      "nti pakatiyā pavattaṃ kappiyamaṃsaṃ mūlaṃ gahetvā antarāpaṇe pariyesāhīti adhippāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sambahulā nigaṇṭhā"
      },
      "ti pañcasatamattā nigaṇṭhā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Thūlaṃ pasu"
      },
      "nti thūlaṃ mahāsarīraṃ gokaṇṇamahiṃsasūkarasaṅkhātaṃ pasuṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uddissakata"
      },
      "nti attānaṃ uddisitvā kataṃ, māritanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭiccakamma"
      },
      "nti svāyaṃ taṃ maṃsaṃ paṭicca taṃ pāṇavadhakammaṃ phusati. Tañhi akusalaṃ upaḍḍhaṃ dāyakassa, upaḍḍhaṃ paṭiggāhakassa hotīti nesaṃ laddhi. Aparo ",
      " nayo – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭiccakamma"
      },
      "nti attānaṃ paṭiccakataṃ. Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭiccakamma"
      },
      "nti nimittakammassetaṃ adhivacanaṃ, taṃ paṭiccakammaṃ ettha atthīti maṃsampi paṭiccakammanti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upakaṇṇake"
      },
      "ti kaṇṇamūle. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ala"
      },
      "nti paṭikkhepavacanaṃ, kiṃ imināti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na ca panete"
      },
      "ti ete āyasmanto dīgharattaṃ avaṇṇakāmā hutvā avaṇṇaṃ bhāsantāpi abbhācikkhantā na jiridanti, abbhakkhānassa antaṃ na gacchantīti attho. Atha vā lajjanatthe idaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jiridantī"
      },
      "ti padaṃ daṭṭhabbaṃ, na lajjantīti attho."
    ],
    "innerText": "Pavattamaṃsanti pakatiyā pavattaṃ kappiyamaṃsaṃ mūlaṃ gahetvā antarāpaṇe pariyesāhīti adhippāyo. Sambahulā nigaṇṭhāti pañcasatamattā nigaṇṭhā. Thūlaṃ pasunti thūlaṃ mahāsarīraṃ gokaṇṇamahiṃsasūkarasaṅkhātaṃ pasuṃ. Uddissakatanti attānaṃ uddisitvā kataṃ, māritanti attho. Paṭiccakammanti svāyaṃ taṃ maṃsaṃ paṭicca taṃ pāṇavadhakammaṃ phusati. Tañhi akusalaṃ upaḍḍhaṃ dāyakassa, upaḍḍhaṃ paṭiggāhakassa hotīti nesaṃ laddhi. Aparo nayo – paṭiccakammanti attānaṃ paṭiccakataṃ. Atha vā paṭiccakammanti nimittakammassetaṃ adhivacanaṃ, taṃ paṭiccakammaṃ ettha atthīti maṃsampi paṭiccakammanti vuttaṃ. Upakaṇṇaketi kaṇṇamūle. Alanti paṭikkhepavacanaṃ, kiṃ imināti attho. Na ca paneteti ete āyasmanto dīgharattaṃ avaṇṇakāmā hutvā avaṇṇaṃ bhāsantāpi abbhācikkhantā na jiridanti, abbhakkhānassa antaṃ na gacchantīti attho. Atha vā lajjanatthe idaṃ jiridantīti padaṃ daṭṭhabbaṃ, na lajjantīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Assājānīyasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "13"
      },
      ". Tatiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṅgehī"
      },
      "ti guṇaṅgehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tassaṃ disāyaṃ jāto hotī"
      },
      "ti tassaṃ sindhunadītīradisāyaṃ jāto hoti. Aññepi bhadrā assājānīyā tattheva jāyanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Allaṃ vā sukkhaṃ vā"
      },
      "ti allatiṇaṃ vā sukkhatiṇaṃ vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nāññe asse ubbejetā"
      },
      "ti aññe asse na ubbejeti na paharati na ḍaṃsati na kalahaṃ karoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sāṭheyyānī"
      },
      "ti saṭhabhāvo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kūṭeyyānī"
      },
      "ti kūṭabhāvo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jimheyyānī"
      },
      "ti jimhabhāvo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vaṅkeyyānī"
      },
      "ti vaṅkabhāvā. Iccassa catūhipi padehi asikkhitabhāvova kathito ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vāhī"
      },
      "ti vahanasabhāvo dinnovādapaṭikaro. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yāva"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jīvitamaraṇapariyādānā"
      },
      "ti yāva jīvitassa maraṇena pariyosānā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sakkaccaṃ paribhuñjatī"
      },
      "ti amataṃ ",
      " viya paccavekkhitvā paribhuñjati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purisathāmenā"
      },
      "tiādīsu ñāṇathāmādayo kathitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṇṭhāna"
      },
      "nti osakkanaṃ paṭippassaddhi."
    ],
    "innerText": "13. Tatiye aṅgehīti guṇaṅgehi. Tassaṃ disāyaṃ jāto hotīti tassaṃ sindhunadītīradisāyaṃ jāto hoti. Aññepi bhadrā assājānīyā tattheva jāyanti. Allaṃ vā sukkhaṃ vāti allatiṇaṃ vā sukkhatiṇaṃ vā. Nāññe asse ubbejetāti aññe asse na ubbejeti na paharati na ḍaṃsati na kalahaṃ karoti. Sāṭheyyānīti saṭhabhāvo. Kūṭeyyānīti kūṭabhāvo. Jimheyyānīti jimhabhāvo. Vaṅkeyyānīti vaṅkabhāvā. Iccassa catūhipi padehi asikkhitabhāvova kathito . Vāhīti vahanasabhāvo dinnovādapaṭikaro. Yāvajīvitamaraṇapariyādānāti yāva jīvitassa maraṇena pariyosānā. Sakkaccaṃ paribhuñjatīti amataṃ viya paccavekkhitvā paribhuñjati. Purisathāmenātiādīsu ñāṇathāmādayo kathitā. Saṇṭhānanti osakkanaṃ paṭippassaddhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Assakhaḷuṅkasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "14"
      },
      ". Catutthe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘pehī’’ti vutto"
      },
      "ti ‘‘gacchā’’ti vutto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Piṭṭhito rathaṃ pavattetī"
      },
      "ti khandhaṭṭhikena yugaṃ uppīḷitvā pacchimabhāgena rathaṃ pavaṭṭento osakkati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pacchā laṅghati, kubbaraṃ hanatī"
      },
      "ti dve pacchimapāde ukkhipitvā tehi paharitvā rathakubbaraṃ bhindati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tidaṇḍaṃ bhañjatī"
      },
      "ti rathassa purato tayo daṇḍakā honti, te bhañjati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rathīsāya satthiṃ ussajjitvā"
      },
      "ti sīsaṃ nāmetvā yugaṃ bhūmiyaṃ pātetvā satthinā rathīsaṃ paharitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ajjhomaddatī"
      },
      "ti dvīhi purimapādehi īsaṃ maddanto tiṭṭhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ubbaṭumaṃ rathaṃ karotī"
      },
      "ti thalaṃ vā kaṇḍakaṭṭhānaṃ vā rathaṃ āropeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anādiyitvā"
      },
      "ti amanasikatvā agaṇitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mukhādhāna"
      },
      "nti mukhaṭhapanatthāya dinnaṃ ayasaṅkhalikaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khīlaṭṭhāyī"
      },
      "ti cattāro pāde thambhe viya niccalaṃ ṭhapetvā khīlaṭṭhānasadisena ṭhānena tiṭṭhati. Imasmiṃ ",
      " sutte vaṭṭameva kathitaṃ."
    ],
    "innerText": "14. Catutthe ‘‘pehī’’ti vuttoti ‘‘gacchā’’ti vutto. Piṭṭhito rathaṃ pavattetīti khandhaṭṭhikena yugaṃ uppīḷitvā pacchimabhāgena rathaṃ pavaṭṭento osakkati. Pacchā laṅghati, kubbaraṃ hanatīti dve pacchimapāde ukkhipitvā tehi paharitvā rathakubbaraṃ bhindati. Tidaṇḍaṃ bhañjatīti rathassa purato tayo daṇḍakā honti, te bhañjati. Rathīsāya satthiṃ ussajjitvāti sīsaṃ nāmetvā yugaṃ bhūmiyaṃ pātetvā satthinā rathīsaṃ paharitvā. Ajjhomaddatīti dvīhi purimapādehi īsaṃ maddanto tiṭṭhati. Ubbaṭumaṃ rathaṃ karotīti thalaṃ vā kaṇḍakaṭṭhānaṃ vā rathaṃ āropeti. Anādiyitvāti amanasikatvā agaṇitvā. Mukhādhānanti mukhaṭhapanatthāya dinnaṃ ayasaṅkhalikaṃ. Khīlaṭṭhāyīti cattāro pāde thambhe viya niccalaṃ ṭhapetvā khīlaṭṭhānasadisena ṭhānena tiṭṭhati. Imasmiṃ sutte vaṭṭameva kathitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Malasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "15"
      },
      ". Pañcame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asajjhāyamalā"
      },
      "ti uggahitamantānaṃ asajjhāyakaraṇaṃ malaṃ nāma hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anuṭṭhānamalā gharā"
      },
      "ti uṭṭhānavīriyābhāvo gharānaṃ malaṃ nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vaṇṇassā"
      },
      "ti sarīravaṇṇassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rakkhato"
      },
      "ti yaṃkiñci attano santakaṃ rakkhantassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avijjā paramaṃ mala"
      },
      "nti tato sesākusaladhammamalato aṭṭhasu ṭhānesu aññāṇabhūtā vaṭṭamūlasaṅkhātā bahalandhakāraavijjā paramaṃ malaṃ. Tato hi malataraṃ nāma natthi. Imasmimpi sutte vaṭṭameva kathitaṃ."
    ],
    "innerText": "15. Pañcame asajjhāyamalāti uggahitamantānaṃ asajjhāyakaraṇaṃ malaṃ nāma hoti. Anuṭṭhānamalā gharāti uṭṭhānavīriyābhāvo gharānaṃ malaṃ nāma. Vaṇṇassāti sarīravaṇṇassa. Rakkhatoti yaṃkiñci attano santakaṃ rakkhantassa. Avijjā paramaṃ malanti tato sesākusaladhammamalato aṭṭhasu ṭhānesu aññāṇabhūtā vaṭṭamūlasaṅkhātā bahalandhakāraavijjā paramaṃ malaṃ. Tato hi malataraṃ nāma natthi. Imasmimpi sutte vaṭṭameva kathitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Dūteyyasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "16"
      },
      ". Chaṭṭhe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dūteyya"
      },
      "nti dūtakammaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gantumarahatī"
      },
      "ti taṃ dūteyyasaṅkhātaṃ sāsanaṃ dhāretvā harituṃ arahati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sotā"
      },
      "ti yo taṃ assa sāsanaṃ deti ",
      ", tassa sotā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sāvetā"
      },
      "ti taṃ uggaṇhitvā ‘‘idaṃ nāma tumhehi vutta’’nti paṭisāvetā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uggahetā"
      },
      "ti suggahitaṃ katvā uggahetā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhāretā"
      },
      "ti sudhāritaṃ ",
      " katvā dhāretā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Viññā"
      },
      "ti atthānatthassa atthaṃ jānitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Viññāpetā"
      },
      "ti paraṃ vijānāpetā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahitā sahitassā"
      },
      "ti idaṃ sahitaṃ, idaṃ asahitanti evaṃ sahitāsahitassa kusalo, upagatānupagatesu cheko sāsanaṃ ārocento sahitaṃ sallakkhetvā āroceti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na byathatī"
      },
      "ti vedhati na chambhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asandiddha"
      },
      "nti ",
      " nissandehaṃ vigatasaṃsayaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchito"
      },
      "ti pañhatthāya pucchito."
    ],
    "innerText": "16. Chaṭṭhe dūteyyanti dūtakammaṃ. Gantumarahatīti taṃ dūteyyasaṅkhātaṃ sāsanaṃ dhāretvā harituṃ arahati. Sotāti yo taṃ assa sāsanaṃ deti , tassa sotā. Sāvetāti taṃ uggaṇhitvā ‘‘idaṃ nāma tumhehi vutta’’nti paṭisāvetā. Uggahetāti suggahitaṃ katvā uggahetā. Dhāretāti sudhāritaṃ katvā dhāretā. Viññāti atthānatthassa atthaṃ jānitā. Viññāpetāti paraṃ vijānāpetā. Sahitā sahitassāti idaṃ sahitaṃ, idaṃ asahitanti evaṃ sahitāsahitassa kusalo, upagatānupagatesu cheko sāsanaṃ ārocento sahitaṃ sallakkhetvā āroceti. Na byathatīti vedhati na chambhati. Asandiddhanti nissandehaṃ vigatasaṃsayaṃ. Pucchitoti pañhatthāya pucchito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7-8. Bandhanasuttadvayavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "17-18"
      },
      ". Sattame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ruṇṇenā"
      },
      "ti ruditena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ākappenā"
      },
      "ti nivāsanapārupanādinā vidhānena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vanabhaṅgenā"
      },
      "ti vanato bhañjitvā āhaṭena pupphaphalādipaṇṇākārena. Aṭṭhamepi eseva nayo."
    ],
    "innerText": "17-18. Sattame ruṇṇenāti ruditena. Ākappenāti nivāsanapārupanādinā vidhānena. Vanabhaṅgenāti vanato bhañjitvā āhaṭena pupphaphalādipaṇṇākārena. Aṭṭhamepi eseva nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Pahārādasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "19"
      },
      ". Navame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pahārādo"
      },
      "ti evaṃnāmako. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asurindo"
      },
      "ti asurajeṭṭhako. Asuresu hi vepacitti rāhu pahārādoti ime tayo jeṭṭhakā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yena bhagavā tenupasaṅkamī"
      },
      "ti dasabalassa abhisambuddhadivasato paṭṭhāya ‘‘ajja gamissāmi sve gamissāmī’’ti ekādasa vassāni atikkamitvā dvādasame vasse satthu verañjāyaṃ vasanakāle ‘‘sammāsambuddhassa santikaṃ gamissāmī’’ti cittaṃ uppādetvā ‘‘mama ‘ajja sve’ti dvādasa vassāni jātāni, handāhaṃ idāneva gacchāmī’’ti taṅkhaṇaṃyeva asuragaṇaparivuto asurabhavanā nikkhamitvā divā divassa yena bhagavā tenupasaṅkami, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekamantaṃ aṭṭhāsī"
      },
      "ti so kira ‘‘tathāgataṃ pañhaṃ pucchitvā eva dhammaṃ suṇissāmī’’ti āgato, tathāgatassa pana diṭṭhakālato paṭṭhāya buddhagāravena pucchituṃ asakkonto api satthāraṃ vanditvā ekamantaṃ aṭṭhāsi. Tato satthā cintesi – ‘‘ayaṃ pahārādo mayi akathente paṭhamataraṃ kathetuṃ na sakkhissati, ciṇṇavasiṭṭhāneyeva naṃ kathāsamuṭṭhāpanatthaṃ ekaṃ pañhaṃ pucchissāmī’’ti ",
      "."
    ],
    "innerText": "19. Navame pahārādoti evaṃnāmako. Asurindoti asurajeṭṭhako. Asuresu hi vepacitti rāhu pahārādoti ime tayo jeṭṭhakā. Yena bhagavā tenupasaṅkamīti dasabalassa abhisambuddhadivasato paṭṭhāya ‘‘ajja gamissāmi sve gamissāmī’’ti ekādasa vassāni atikkamitvā dvādasame vasse satthu verañjāyaṃ vasanakāle ‘‘sammāsambuddhassa santikaṃ gamissāmī’’ti cittaṃ uppādetvā ‘‘mama ‘ajja sve’ti dvādasa vassāni jātāni, handāhaṃ idāneva gacchāmī’’ti taṅkhaṇaṃyeva asuragaṇaparivuto asurabhavanā nikkhamitvā divā divassa yena bhagavā tenupasaṅkami, ekamantaṃ aṭṭhāsīti so kira ‘‘tathāgataṃ pañhaṃ pucchitvā eva dhammaṃ suṇissāmī’’ti āgato, tathāgatassa pana diṭṭhakālato paṭṭhāya buddhagāravena pucchituṃ asakkonto api satthāraṃ vanditvā ekamantaṃ aṭṭhāsi. Tato satthā cintesi – ‘‘ayaṃ pahārādo mayi akathente paṭhamataraṃ kathetuṃ na sakkhissati, ciṇṇavasiṭṭhāneyeva naṃ kathāsamuṭṭhāpanatthaṃ ekaṃ pañhaṃ pucchissāmī’’ti ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " naṃ pucchanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "api pana pahārādā"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhiramantī"
      },
      "ti ratiṃ vindanti, anukkaṇṭhamānā vasantīti attho. So ‘‘pariciṇṇaṭṭhāneyeva maṃ bhagavā pucchatī’’ti attamano hutvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhiramanti, bhante"
      },
      "ti āha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anupubbaninno"
      },
      "tiādīni sabbāni anupaṭipāṭiyā ninnabhāvassa vevacanāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na āyatakeneva papāto"
      },
      "ti na chinnataṭamahāsobbho viya āditova papāto ",
      ". So hi tīrato paṭṭhāya ekaṅguladvaṅgulavidatthiratanayaṭṭhiusabhaaḍḍhagāvutagāvutaaḍḍhayojanādivasena gambhīro hutvā gacchanto sinerupādamūle caturāsītiyojanasahassagambhīro hutvā ṭhitoti dasseti."
    ],
    "innerText": "Atha naṃ pucchanto api pana pahārādātiādimāha. Tattha abhiramantīti ratiṃ vindanti, anukkaṇṭhamānā vasantīti attho. So ‘‘pariciṇṇaṭṭhāneyeva maṃ bhagavā pucchatī’’ti attamano hutvā abhiramanti, bhanteti āha. Anupubbaninnotiādīni sabbāni anupaṭipāṭiyā ninnabhāvassa vevacanāni. Na āyatakeneva papātoti na chinnataṭamahāsobbho viya āditova papāto . So hi tīrato paṭṭhāya ekaṅguladvaṅgulavidatthiratanayaṭṭhiusabhaaḍḍhagāvutagāvutaaḍḍhayojanādivasena gambhīro hutvā gacchanto sinerupādamūle caturāsītiyojanasahassagambhīro hutvā ṭhitoti dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ṭhitadhammo"
      },
      "ti ṭhitasabhāvo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kuṇapenā"
      },
      "ti yena kenaci hatthiassādīnaṃ kaḷevarena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Thalaṃ ussāretī"
      },
      "ti hatthena gahetvā viya vīcipahāreneva thalaṃ khipati."
    ],
    "innerText": "Ṭhitadhammoti ṭhitasabhāvo. Kuṇapenāti yena kenaci hatthiassādīnaṃ kaḷevarena. Thalaṃ ussāretīti hatthena gahetvā viya vīcipahāreneva thalaṃ khipati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gaṅgāyamunā"
      },
      "ti idha ṭhatvā imāsaṃ nadīnaṃ uppattikathaṃ kathetuṃ vaṭṭati. Ayaṃ tāva jambudīpo dasasahassayojanaparimāṇo, tattha catusahassayojanaparimāṇo padeso udakena ajjhotthaṭo mahāsamuddoti saṅkhaṃ gato, tisahassayojanappamāṇe manussā vasanti, tisahassayojanappamāṇe himavā patiṭṭhito ubbedhena pañcayojanasatiko caturāsītikūṭasahassapaṭimaṇḍito samantato sandamānapañcasatanadīvicitto, yattha āyāmavitthārena ca gambhīrato ca paṇṇāsapaṇṇāsayojanā diyaḍḍhayojanasataparimaṇḍalā anotattadaho kaṇṇamuṇḍadaho ",
      " rathakāradaho chaddantadaho kuṇāladaho mandākinidaho sīhappapātadahoti satta mahāsarā patiṭṭhahanti."
    ],
    "innerText": "Gaṅgāyamunāti idha ṭhatvā imāsaṃ nadīnaṃ uppattikathaṃ kathetuṃ vaṭṭati. Ayaṃ tāva jambudīpo dasasahassayojanaparimāṇo, tattha catusahassayojanaparimāṇo padeso udakena ajjhotthaṭo mahāsamuddoti saṅkhaṃ gato, tisahassayojanappamāṇe manussā vasanti, tisahassayojanappamāṇe himavā patiṭṭhito ubbedhena pañcayojanasatiko caturāsītikūṭasahassapaṭimaṇḍito samantato sandamānapañcasatanadīvicitto, yattha āyāmavitthārena ca gambhīrato ca paṇṇāsapaṇṇāsayojanā diyaḍḍhayojanasataparimaṇḍalā anotattadaho kaṇṇamuṇḍadaho rathakāradaho chaddantadaho kuṇāladaho mandākinidaho sīhappapātadahoti satta mahāsarā patiṭṭhahanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tesu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anotatto"
      },
      " sudassanakūṭaṃ cittakūṭaṃ kāḷakūṭaṃ gandhamādanakūṭaṃ kelāsakūṭanti imehi pañcahi pabbatehi parikkhitto. Tattha sudassanakūṭaṃ sovaṇṇamayaṃ dviyojanasatubbedhaṃ antovaṅkaṃ kākamukhasaṇṭhānaṃ tameva saraṃ paṭicchādetvā tiṭṭhati, cittakūṭaṃ sabbaratanamayaṃ, kāḷakūṭaṃ añjanamayaṃ, gandhamādanakūṭaṃ sānumayaṃ abbhantare muggavaṇṇaṃ, mūlagandho sāragandho pheggugandho tacagandho papaṭikāgandho rasagandho pattagandho pupphagandho phalagandho ",
      " gandhagandhoti imehi dasahi gandhehi ussannaṃ, nānappakāraosadhasañchannaṃ kāḷapakkhauposathadivase ādittamiva aṅgāraṃ jalantaṃ tiṭṭhati, kelāsakūṭaṃ rajatamayaṃ. Sabbāni sudassanena samānubbedhasaṇṭhānāni tameva saraṃ paṭicchādetvā ṭhitāni. Tāni sabbāni devānubhāvena nāgānubhāvena ca vassanti, nadiyo cetesu sandanti. Taṃ sabbampi udakaṃ anotattameva pavisati. Candimasūriyā dakkhiṇena vā uttarena vā gacchantā pabbatantarena tattha obhāsaṃ karonti, ujuṃ gacchantā na karonti. Tenevassa anotatto tisaṅkhā udapādi."
    ],
    "innerText": "Tesu anotatto sudassanakūṭaṃ cittakūṭaṃ kāḷakūṭaṃ gandhamādanakūṭaṃ kelāsakūṭanti imehi pañcahi pabbatehi parikkhitto. Tattha sudassanakūṭaṃ sovaṇṇamayaṃ dviyojanasatubbedhaṃ antovaṅkaṃ kākamukhasaṇṭhānaṃ tameva saraṃ paṭicchādetvā tiṭṭhati, cittakūṭaṃ sabbaratanamayaṃ, kāḷakūṭaṃ añjanamayaṃ, gandhamādanakūṭaṃ sānumayaṃ abbhantare muggavaṇṇaṃ, mūlagandho sāragandho pheggugandho tacagandho papaṭikāgandho rasagandho pattagandho pupphagandho phalagandho gandhagandhoti imehi dasahi gandhehi ussannaṃ, nānappakāraosadhasañchannaṃ kāḷapakkhauposathadivase ādittamiva aṅgāraṃ jalantaṃ tiṭṭhati, kelāsakūṭaṃ rajatamayaṃ. Sabbāni sudassanena samānubbedhasaṇṭhānāni tameva saraṃ paṭicchādetvā ṭhitāni. Tāni sabbāni devānubhāvena nāgānubhāvena ca vassanti, nadiyo cetesu sandanti. Taṃ sabbampi udakaṃ anotattameva pavisati. Candimasūriyā dakkhiṇena vā uttarena vā gacchantā pabbatantarena tattha obhāsaṃ karonti, ujuṃ gacchantā na karonti. Tenevassa anotatto tisaṅkhā udapādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha manoharasilātalāni nimmacchakacchapāni phalikasadisanimmalodakāni nhānatitthāni supaṭiyattāni ",
      " honti ",
      ", yesu buddhā khīṇāsavā ca paccekabuddhā ca iddhimantā ca isayo nhāyanti, devayakkhādayo udakakīḷaṃ kīḷanti."
    ],
    "innerText": "Tattha manoharasilātalāni nimmacchakacchapāni phalikasadisanimmalodakāni nhānatitthāni supaṭiyattāni honti , yesu buddhā khīṇāsavā ca paccekabuddhā ca iddhimantā ca isayo nhāyanti, devayakkhādayo udakakīḷaṃ kīḷanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tassa catūsu passesu sīhamukhaṃ, hatthimukhaṃ, assamukhaṃ, usabhamukhanti cattāri mukhāni honti, yehi catasso nadiyo sandanti. Sīhamukhena nikkhantanadītīre sīhā bahutarā honti, hatthimukhādīhi hatthiassausabhā. Puratthimadisato nikkhantanadī anotattaṃ tikkhattuṃ padakkhiṇaṃ katvā itarā tisso nadiyo anupagamma pācīnahimavanteneva amanussapathaṃ gantvā mahāsamuddaṃ pavisati. Pacchimadisato ca uttaradisato ca nikkhantanadiyopi tatheva padakkhiṇaṃ katvā pacchimahimavanteneva uttarahimavanteneva ca amanussapathaṃ gantvā mahāsamuddaṃ pavisanti. Dakkhiṇamukhato nikkhantanadī pana taṃ tikkhattuṃ padakkhiṇaṃ katvā uttarena ujukaṃ pāsāṇapiṭṭheneva saṭṭhi yojanāni gantvā pabbataṃ paharitvā uṭṭhāya parikkhepena tigāvutappamāṇā udakadhārā hutvā ākāsena saṭṭhi yojanāni gantvā tiyaggaḷe nāma pāsāṇe patitā, pāsāṇo udakadhārāvegena bhinno. Tattha paññāsayojanappamāṇā tiyaggaḷā nāma mahāpokkharaṇī jātā, pokkharaṇiyā kūlaṃ bhinditvā pāsāṇaṃ pavisitvā saṭṭhi yojanāni gatā. Tato ghanapathaviṃ bhinditvā ummaṅgena saṭṭhi yojanāni gantvā giñjhaṃ nāma tiracchānapabbataṃ paharitvā hatthatale pañcaṅgulisadisā pañca dhārā hutvā pavattati. Sā ",
      " tikkhattuṃ anotattaṃ padakkhiṇaṃ katvā gataṭṭhāne ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āvattagaṅgā"
      },
      "ti vuccati ",
      ". Ujukaṃ pāsāṇapiṭṭhena saṭṭhi yojanāni gataṭṭhāne ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kaṇhagaṅgā,"
      },
      " ākāsena saṭṭhi yojanāni gataṭṭhāne ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ākāsagaṅgā,"
      },
      " tiyaggaḷapāsāṇe paññāsayojanokāse ṭhitā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tiyaggaḷapokkharaṇī,"
      },
      " kūlaṃ bhinditvā pāsāṇaṃ pavisitvā saṭṭhi yojanāni gataṭṭhāne ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bahalagaṅgā"
      },
      "ti, umaṅgena saṭṭhi yojanāni gataṭṭhāne ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "umaṅgagaṅgā"
      },
      "ti vuccati. Viñjhaṃ nāma tiracchānapabbataṃ paharitvā pañca dhārā hutvā pavattanaṭṭhāne pana gaṅgā, yamunā, aciravatī, sarabhū, mahīti pañca saṅkhaṃ gatā. Evametā pañca mahānadiyo himavantato pavattantīti veditabbā."
    ],
    "innerText": "Tassa catūsu passesu sīhamukhaṃ, hatthimukhaṃ, assamukhaṃ, usabhamukhanti cattāri mukhāni honti, yehi catasso nadiyo sandanti. Sīhamukhena nikkhantanadītīre sīhā bahutarā honti, hatthimukhādīhi hatthiassausabhā. Puratthimadisato nikkhantanadī anotattaṃ tikkhattuṃ padakkhiṇaṃ katvā itarā tisso nadiyo anupagamma pācīnahimavanteneva amanussapathaṃ gantvā mahāsamuddaṃ pavisati. Pacchimadisato ca uttaradisato ca nikkhantanadiyopi tatheva padakkhiṇaṃ katvā pacchimahimavanteneva uttarahimavanteneva ca amanussapathaṃ gantvā mahāsamuddaṃ pavisanti. Dakkhiṇamukhato nikkhantanadī pana taṃ tikkhattuṃ padakkhiṇaṃ katvā uttarena ujukaṃ pāsāṇapiṭṭheneva saṭṭhi yojanāni gantvā pabbataṃ paharitvā uṭṭhāya parikkhepena tigāvutappamāṇā udakadhārā hutvā ākāsena saṭṭhi yojanāni gantvā tiyaggaḷe nāma pāsāṇe patitā, pāsāṇo udakadhārāvegena bhinno. Tattha paññāsayojanappamāṇā tiyaggaḷā nāma mahāpokkharaṇī jātā, pokkharaṇiyā kūlaṃ bhinditvā pāsāṇaṃ pavisitvā saṭṭhi yojanāni gatā. Tato ghanapathaviṃ bhinditvā ummaṅgena saṭṭhi yojanāni gantvā giñjhaṃ nāma tiracchānapabbataṃ paharitvā hatthatale pañcaṅgulisadisā pañca dhārā hutvā pavattati. Sā tikkhattuṃ anotattaṃ padakkhiṇaṃ katvā gataṭṭhāne āvattagaṅgāti vuccati . Ujukaṃ pāsāṇapiṭṭhena saṭṭhi yojanāni gataṭṭhāne kaṇhagaṅgā, ākāsena saṭṭhi yojanāni gataṭṭhāne ākāsagaṅgā, tiyaggaḷapāsāṇe paññāsayojanokāse ṭhitā tiyaggaḷapokkharaṇī, kūlaṃ bhinditvā pāsāṇaṃ pavisitvā saṭṭhi yojanāni gataṭṭhāne bahalagaṅgāti, umaṅgena saṭṭhi yojanāni gataṭṭhāne umaṅgagaṅgāti vuccati. Viñjhaṃ nāma tiracchānapabbataṃ paharitvā pañca dhārā hutvā pavattanaṭṭhāne pana gaṅgā, yamunā, aciravatī, sarabhū, mahīti pañca saṅkhaṃ gatā. Evametā pañca mahānadiyo himavantato pavattantīti veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Savantiyo"
      },
      "ti yā kāci savamānā gacchantī mahānadiyo vā kunnadiyo vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appentī"
      },
      "ti allīyanti osaranti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhārā"
      },
      "ti vuṭṭhidhārā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pūratta"
      },
      "nti puṇṇabhāvo. Mahāsamuddassa hi ayaṃ dhammatā – ‘‘imasmiṃ kāle devo mando jāto, jālakkhipādīni ādāya macchakacchape gaṇhissāmā’’ti vā ‘‘imasmiṃ kāle mahantā vuṭṭhi, labhissāma nu kho piṭṭhipasāraṇaṭṭhāna’’nti vā ",
      " vattuṃ na sakkā. Paṭhamakappikakālato paṭṭhāya hi yaṃ sinerumekhalaṃ āhacca udakaṃ ṭhitaṃ, tato ekaṅgulamattampi udakaṃ neva heṭṭhā osīdati, na uddhaṃ uttarati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekaraso"
      },
      "ti asambhinnaraso."
    ],
    "innerText": "Savantiyoti yā kāci savamānā gacchantī mahānadiyo vā kunnadiyo vā. Appentīti allīyanti osaranti. Dhārāti vuṭṭhidhārā. Pūrattanti puṇṇabhāvo. Mahāsamuddassa hi ayaṃ dhammatā – ‘‘imasmiṃ kāle devo mando jāto, jālakkhipādīni ādāya macchakacchape gaṇhissāmā’’ti vā ‘‘imasmiṃ kāle mahantā vuṭṭhi, labhissāma nu kho piṭṭhipasāraṇaṭṭhāna’’nti vā vattuṃ na sakkā. Paṭhamakappikakālato paṭṭhāya hi yaṃ sinerumekhalaṃ āhacca udakaṃ ṭhitaṃ, tato ekaṅgulamattampi udakaṃ neva heṭṭhā osīdati, na uddhaṃ uttarati. Ekarasoti asambhinnaraso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Muttā"
      },
      "ti khuddakamahantavaṭṭadīghādibhedā anekavidhā ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Maṇī"
      },
      "ti rattanīlādibhedo anekavidho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Veḷuriyo"
      },
      "ti vaṃsavaṇṇasirīsapupphavaṇṇādibhedo anekavidho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅkho"
      },
      "ti dakkhiṇāvaṭṭatambakucchikadhamanasaṅkhādibhedo anekavidho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Silā"
      },
      "ti setakāḷamuggavaṇṇādibhedo anekavidhā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pavāḷa"
      },
      "nti khuddakamahantarattaghanarattādibhedaṃ anekavidhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Masāragalla"
      },
      "nti kabaramaṇi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nāgā"
      },
      "ti ūmipiṭṭhavāsinopi vimānaṭṭhakā nāgāpi."
    ],
    "innerText": "Muttāti khuddakamahantavaṭṭadīghādibhedā anekavidhā . Maṇīti rattanīlādibhedo anekavidho. Veḷuriyoti vaṃsavaṇṇasirīsapupphavaṇṇādibhedo anekavidho. Saṅkhoti dakkhiṇāvaṭṭatambakucchikadhamanasaṅkhādibhedo anekavidho. Silāti setakāḷamuggavaṇṇādibhedo anekavidhā. Pavāḷanti khuddakamahantarattaghanarattādibhedaṃ anekavidhaṃ. Masāragallanti kabaramaṇi. Nāgāti ūmipiṭṭhavāsinopi vimānaṭṭhakā nāgāpi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭha pahārādā"
      },
      "ti satthā aṭṭhapi dhamme vattuṃ sakkoti, soḷasapi bāttiṃsapi catusaṭṭhipi sahassampi, pahārādena pana aṭṭha kathitā, ahampi teheva sarikkhake katvā kathessāmīti cintetvā evamāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anupubbasikkhā"
      },
      "tiādīsu anupubbasikkhāya tisso sikkhā gahitā, anupubbakiriyāya terasa dhutaṅgāni, anupubbapaṭipadāya satta anupassanā aṭṭhārasa mahāvipassanā aṭṭhatiṃsa ārammaṇavibhattiyo sattatiṃsa bodhapakkhiyadhammā ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na āyatakeneva aññāpaṭivedho"
      },
      "ti maṇḍūkassa uppatitvā gamanaṃ viya āditova sīlapūraṇādiṃ akatvā arahattappaṭivedho nāma natthi, paṭipāṭiyā pana sīlasamādhipaññāyo pūretvāva sakkā arahattaṃ pattunti attho."
    ],
    "innerText": "Aṭṭha pahārādāti satthā aṭṭhapi dhamme vattuṃ sakkoti, soḷasapi bāttiṃsapi catusaṭṭhipi sahassampi, pahārādena pana aṭṭha kathitā, ahampi teheva sarikkhake katvā kathessāmīti cintetvā evamāha. Anupubbasikkhātiādīsu anupubbasikkhāya tisso sikkhā gahitā, anupubbakiriyāya terasa dhutaṅgāni, anupubbapaṭipadāya satta anupassanā aṭṭhārasa mahāvipassanā aṭṭhatiṃsa ārammaṇavibhattiyo sattatiṃsa bodhapakkhiyadhammā . Na āyatakeneva aññāpaṭivedhoti maṇḍūkassa uppatitvā gamanaṃ viya āditova sīlapūraṇādiṃ akatvā arahattappaṭivedho nāma natthi, paṭipāṭiyā pana sīlasamādhipaññāyo pūretvāva sakkā arahattaṃ pattunti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ārakāvā"
      },
      "ti dūreyeva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na tena nibbānadhātuyā ūnattaṃ vā pūrattaṃ vā"
      },
      "ti asaṅkhyeyyepi kappe buddhesu anuppannesu ekasattopi parinibbātuṃ na sakkoti, tadāpi ‘‘tucchā nibbānadhātū’’ti na ",
      " sakkā vattuṃ. Buddhakāle ca pana ekekasmiṃ samāgame asaṅkhyeyyāpi sattā amataṃ ārādhenti, tadāpi na sakkā vattuṃ – ‘‘pūrā nibbānadhātū’’ti."
    ],
    "innerText": "Ārakāvāti dūreyeva. Na tena nibbānadhātuyā ūnattaṃ vā pūrattaṃ vāti asaṅkhyeyyepi kappe buddhesu anuppannesu ekasattopi parinibbātuṃ na sakkoti, tadāpi ‘‘tucchā nibbānadhātū’’ti na sakkā vattuṃ. Buddhakāle ca pana ekekasmiṃ samāgame asaṅkhyeyyāpi sattā amataṃ ārādhenti, tadāpi na sakkā vattuṃ – ‘‘pūrā nibbānadhātū’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Uposathasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "20"
      },
      ". Dasame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nisinno hotī"
      },
      "ti uposathakaraṇatthāya upāsikāya ratanapāsāde nisinno. Nisajja pana bhikkhūnaṃ cittāni olokento ekaṃ dussīlapuggalaṃ disvā ‘‘sacāhaṃ imasmiṃ puggale ",
      " nisinneyeva pātimokkhaṃ uddisissāmi, sattadhā tassa muddhā phalissatī’’ti tassa anukampāya tuṇhīyeva ahosi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhikkantā"
      },
      "ti atikkantā parikkhīṇā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uddhaste aruṇe"
      },
      "ti uggate aruṇasīse. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nandimukhiyā"
      },
      "ti tuṭṭhamukhiyā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aparisuddhā, ānanda, parisā"
      },
      "ti ‘‘asukapuggalo aparisuddho’’ti avatvā ‘‘aparisuddhā, ānanda, parisā’’ti āha. Sesaṃ sabbattha uttānamevāti."
    ],
    "innerText": "20. Dasame nisinno hotīti uposathakaraṇatthāya upāsikāya ratanapāsāde nisinno. Nisajja pana bhikkhūnaṃ cittāni olokento ekaṃ dussīlapuggalaṃ disvā ‘‘sacāhaṃ imasmiṃ puggale nisinneyeva pātimokkhaṃ uddisissāmi, sattadhā tassa muddhā phalissatī’’ti tassa anukampāya tuṇhīyeva ahosi. Abhikkantāti atikkantā parikkhīṇā. Uddhaste aruṇeti uggate aruṇasīse. Nandimukhiyāti tuṭṭhamukhiyā. Aparisuddhā, ānanda, parisāti ‘‘asukapuggalo aparisuddho’’ti avatvā ‘‘aparisuddhā, ānanda, parisā’’ti āha. Sesaṃ sabbattha uttānamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Mahāvaggo dutiyo."
  }
]