[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "(7) 2. Bhūmicālavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Icchāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "61"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[a. ni. 8.77]"
      },
      " ‘‘Aṭṭhime ",
      ", bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame aṭṭha? Idha, bhikkhave, bhikkhuno pavivittassa viharato nirāyattavuttino icchā uppajjati lābhāya. So uṭṭhahati ghaṭati vāyamati lābhāya. Tassa uṭṭhahato ghaṭato vāyamato lābhāya lābho nuppajjati. So tena alābhena socati kilamati paridevati, urattāḷiṃ kandati, sammohaṃ āpajjati. Ayaṃ vuccati, bhikkhave – ‘bhikkhu iccho viharati lābhāya ",
      ", uṭṭhahati ",
      " ghaṭati vāyamati lābhāya, na ca lābhī, socī ca paridevī ca, cuto ca saddhammā’’’."
    ],
    "innerText": "61.[a. ni. 8.77] ‘‘Aṭṭhime , bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame aṭṭha? Idha, bhikkhave, bhikkhuno pavivittassa viharato nirāyattavuttino icchā uppajjati lābhāya. So uṭṭhahati ghaṭati vāyamati lābhāya. Tassa uṭṭhahato ghaṭato vāyamato lābhāya lābho nuppajjati. So tena alābhena socati kilamati paridevati, urattāḷiṃ kandati, sammohaṃ āpajjati. Ayaṃ vuccati, bhikkhave – ‘bhikkhu iccho viharati lābhāya , uṭṭhahati ghaṭati vāyamati lābhāya, na ca lābhī, socī ca paridevī ca, cuto ca saddhammā’’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idha pana, bhikkhave, bhikkhuno pavivittassa viharato nirāyattavuttino icchā uppajjati lābhāya. So uṭṭhahati ghaṭati vāyamati lābhāya. Tassa uṭṭhahato ghaṭato vāyamato lābhāya lābho uppajjati. So tena lābhena majjati pamajjati pamādamāpajjati. Ayaṃ ",
      " vuccati, bhikkhave – ‘bhikkhu iccho viharati lābhāya, uṭṭhahati ghaṭati vāyamati lābhāya, lābhī ca madī ca pamādī ca, cuto ca saddhammā’’’."
    ],
    "innerText": "‘‘Idha pana, bhikkhave, bhikkhuno pavivittassa viharato nirāyattavuttino icchā uppajjati lābhāya. So uṭṭhahati ghaṭati vāyamati lābhāya. Tassa uṭṭhahato ghaṭato vāyamato lābhāya lābho uppajjati. So tena lābhena majjati pamajjati pamādamāpajjati. Ayaṃ vuccati, bhikkhave – ‘bhikkhu iccho viharati lābhāya, uṭṭhahati ghaṭati vāyamati lābhāya, lābhī ca madī ca pamādī ca, cuto ca saddhammā’’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idha pana, bhikkhave, bhikkhuno pavivittassa viharato nirāyattavuttino icchā uppajjati lābhāya. So na uṭṭhahati na ghaṭati na vāyamati lābhāya. Tassa anuṭṭhahato aghaṭato ",
      " avāyamato lābhāya lābho nuppajjati. So tena alābhena socati, kilamati, paridevati, urattāḷiṃ kandati, sammohaṃ āpajjati. Ayaṃ vuccati, bhikkhave – ‘bhikkhu iccho viharati lābhāya, na uṭṭhahati na ghaṭati na vāyamati lābhāya, na ca lābhī, socī ca paridevī ca, cuto ca saddhammā’’’."
    ],
    "innerText": "‘‘Idha pana, bhikkhave, bhikkhuno pavivittassa viharato nirāyattavuttino icchā uppajjati lābhāya. So na uṭṭhahati na ghaṭati na vāyamati lābhāya. Tassa anuṭṭhahato aghaṭato avāyamato lābhāya lābho nuppajjati. So tena alābhena socati, kilamati, paridevati, urattāḷiṃ kandati, sammohaṃ āpajjati. Ayaṃ vuccati, bhikkhave – ‘bhikkhu iccho viharati lābhāya, na uṭṭhahati na ghaṭati na vāyamati lābhāya, na ca lābhī, socī ca paridevī ca, cuto ca saddhammā’’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Idha pana, bhikkhave, bhikkhuno pavivittassa viharato nirāyattavuttino icchā uppajjati lābhāya. So na uṭṭhahati, na ghaṭati, na vāyamati lābhāya. Tassa anuṭṭhahato, aghaṭato, avāyamato lābhāya lābho uppajjati. So tena lābhena majjati, pamajjati, pamādamāpajjati. Ayaṃ vuccati, bhikkhave – ‘bhikkhu iccho viharati lābhāya, na uṭṭhahati na ghaṭati na vāyamati lābhāya, lābhī ca madī ca, pamādī ca, cuto ca saddhammā’’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idha pana, bhikkhave, bhikkhuno pavivittassa viharato nirāyattavuttino icchā uppajjati lābhāya. So uṭṭhahati ghaṭati vāyamati lābhāya. Tassa uṭṭhahato ghaṭato vāyamato ",
      " lābhāya lābho nuppajjati. So tena alābhena na socati na kilamati na paridevati, na urattāḷiṃ kandati, na sammohaṃ āpajjati. Ayaṃ vuccati, bhikkhave – ‘bhikkhu iccho viharati lābhāya, uṭṭhahati ghaṭati vāyamati lābhāya, na ",
      " ca lābhī, na ca socī na ca paridevī, accuto ca saddhammā’’’."
    ],
    "innerText": "‘‘Idha pana, bhikkhave, bhikkhuno pavivittassa viharato nirāyattavuttino icchā uppajjati lābhāya. So uṭṭhahati ghaṭati vāyamati lābhāya. Tassa uṭṭhahato ghaṭato vāyamato lābhāya lābho nuppajjati. So tena alābhena na socati na kilamati na paridevati, na urattāḷiṃ kandati, na sammohaṃ āpajjati. Ayaṃ vuccati, bhikkhave – ‘bhikkhu iccho viharati lābhāya, uṭṭhahati ghaṭati vāyamati lābhāya, na ca lābhī, na ca socī na ca paridevī, accuto ca saddhammā’’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idha pana, bhikkhave, bhikkhuno pavivittassa viharato nirāyattavuttino icchā uppajjati lābhāya. So uṭṭhahati ghaṭati vāyamati lābhāya. Tassa ",
      " uṭṭhahato ghaṭato vāyamato lābhāya lābho uppajjati. So tena lābhena na majjati, na pamajjati, na pamādamāpajjati. Ayaṃ vuccati, bhikkhave – ‘bhikkhu iccho viharati lābhāya, uṭṭhahati ghaṭati vāyamati lābhāya, lābhī ca, na ca madī na ca pamādī, accuto ca saddhammā’’’."
    ],
    "innerText": "‘‘Idha pana, bhikkhave, bhikkhuno pavivittassa viharato nirāyattavuttino icchā uppajjati lābhāya. So uṭṭhahati ghaṭati vāyamati lābhāya. Tassa uṭṭhahato ghaṭato vāyamato lābhāya lābho uppajjati. So tena lābhena na majjati, na pamajjati, na pamādamāpajjati. Ayaṃ vuccati, bhikkhave – ‘bhikkhu iccho viharati lābhāya, uṭṭhahati ghaṭati vāyamati lābhāya, lābhī ca, na ca madī na ca pamādī, accuto ca saddhammā’’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idha pana, bhikkhave, bhikkhuno pavivittassa viharato nirāyattavuttino icchā uppajjati lābhāya. So na uṭṭhahati, na ghaṭati, na vāyamati lābhāya. Tassa anuṭṭhahato, aghaṭato, avāyamato lābhāya lābho nuppajjati. So tena alābhena na socati, na kilamati, na paridevati, na urattāḷiṃ kandati, na sammohaṃ āpajjati. Ayaṃ vuccati, bhikkhave – ‘bhikkhu iccho viharati lābhāya, na uṭṭhahati, na ghaṭati, na vāyamati lābhāya ",
      ", na ca lābhī, na ca socī na ca paridevī, accuto ca saddhammā’’’."
    ],
    "innerText": "‘‘Idha pana, bhikkhave, bhikkhuno pavivittassa viharato nirāyattavuttino icchā uppajjati lābhāya. So na uṭṭhahati, na ghaṭati, na vāyamati lābhāya. Tassa anuṭṭhahato, aghaṭato, avāyamato lābhāya lābho nuppajjati. So tena alābhena na socati, na kilamati, na paridevati, na urattāḷiṃ kandati, na sammohaṃ āpajjati. Ayaṃ vuccati, bhikkhave – ‘bhikkhu iccho viharati lābhāya, na uṭṭhahati, na ghaṭati, na vāyamati lābhāya , na ca lābhī, na ca socī na ca paridevī, accuto ca saddhammā’’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idha pana, bhikkhave, bhikkhuno pavivittassa viharato nirāyattavuttino icchā uppajjati lābhāya. So na uṭṭhahati, na ghaṭati, na vāyamati lābhāya. Tassa anuṭṭhahato aghaṭato avāyamato lābhāya lābho uppajjati. So tena lābhena na majjati, na pamajjati, na pamādamāpajjati. Ayaṃ vuccati, bhikkhave – ‘bhikkhu iccho viharati lābhāya, na uṭṭhahati, na ghaṭati, na vāyamati lābhāya, lābhī ca, na ca madī na ca pamādī, accuto ca saddhammā ",
      "’. Ime kho, bhikkhave, aṭṭha puggalā santo saṃvijjamānā lokasmi’’nti. Paṭhamaṃ."
    ],
    "innerText": "‘‘Idha pana, bhikkhave, bhikkhuno pavivittassa viharato nirāyattavuttino icchā uppajjati lābhāya. So na uṭṭhahati, na ghaṭati, na vāyamati lābhāya. Tassa anuṭṭhahato aghaṭato avāyamato lābhāya lābho uppajjati. So tena lābhena na majjati, na pamajjati, na pamādamāpajjati. Ayaṃ vuccati, bhikkhave – ‘bhikkhu iccho viharati lābhāya, na uṭṭhahati, na ghaṭati, na vāyamati lābhāya, lābhī ca, na ca madī na ca pamādī, accuto ca saddhammā ’. Ime kho, bhikkhave, aṭṭha puggalā santo saṃvijjamānā lokasmi’’nti. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Alaṃsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "62"
      },
      ". ‘‘Chahi ",
      ", bhikkhave, dhammehi samannāgato bhikkhu alaṃ attano alaṃ paresaṃ. Katamehi chahi? Idha, bhikkhave, bhikkhu khippanisanti ca hoti kusalesu dhammesu; sutānañca dhammānaṃ dhāraṇajātiko ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[dhārakajātiko (sī. syā. pī.) a. ni. 8.78]"
      },
      " hoti; dhātānañca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[dhatānañca (sī. syā. pī.)]"
      },
      " dhammānaṃ atthūpaparikkhitā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[atthūpavarikkhī (sī. syā. pī.)]"
      },
      " hoti; atthamaññāya dhammamaññāya dhammānudhammappaṭipanno ca hoti; kalyāṇavāco ca hoti kalyāṇavākkaraṇo, poriyā vācāya samannāgato vissaṭṭhāya anelagaḷāya atthassa viññāpaniyā; sandassako ca hoti samādapako ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[samādāpako (?)]"
      },
      " samuttejako ",
      " sampahaṃsako sabrahmacārīnaṃ. Imehi kho, bhikkhave, chahi dhammehi samannāgato bhikkhu alaṃ attano alaṃ paresaṃ."
    ],
    "innerText": "62. ‘‘Chahi , bhikkhave, dhammehi samannāgato bhikkhu alaṃ attano alaṃ paresaṃ. Katamehi chahi? Idha, bhikkhave, bhikkhu khippanisanti ca hoti kusalesu dhammesu; sutānañca dhammānaṃ dhāraṇajātiko [dhārakajātiko (sī. syā. pī.) a. ni. 8.78] hoti; dhātānañca [dhatānañca (sī. syā. pī.)] dhammānaṃ atthūpaparikkhitā [atthūpavarikkhī (sī. syā. pī.)] hoti; atthamaññāya dhammamaññāya dhammānudhammappaṭipanno ca hoti; kalyāṇavāco ca hoti kalyāṇavākkaraṇo, poriyā vācāya samannāgato vissaṭṭhāya anelagaḷāya atthassa viññāpaniyā; sandassako ca hoti samādapako [samādāpako (?)] samuttejako sampahaṃsako sabrahmacārīnaṃ. Imehi kho, bhikkhave, chahi dhammehi samannāgato bhikkhu alaṃ attano alaṃ paresaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Pañcahi, bhikkhave, dhammehi samannāgato bhikkhu alaṃ attano alaṃ paresaṃ. Katamehi pañcahi? Idha, bhikkhave, bhikkhu na heva kho khippanisanti ca hoti kusalesu dhammesu; sutānañca dhammānaṃ dhāraṇajātiko hoti; dhātānañca dhammānaṃ atthūpaparikkhitā hoti; atthamaññāya dhammamaññāya dhammānudhammappaṭipanno ca hoti; kalyāṇavāco ca hoti…pe… atthassa viññāpaniyā; sandassako ca hoti samādapako samuttejako sampahaṃsako sabrahmacārīnaṃ. Imehi kho, bhikkhave, pañcahi dhammehi samannāgato bhikkhu alaṃ attano alaṃ paresaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Catūhi ",
      ", bhikkhave, dhammehi samannāgato bhikkhu alaṃ attano nālaṃ paresaṃ. Katamehi catūhi? Idha, bhikkhave, bhikkhu khippanisanti ca hoti kusalesu dhammesu; sutānañca dhammānaṃ dhāraṇajātiko hoti ",
      "; dhātānañca dhammānaṃ atthūpaparikkhitā hoti; atthamaññāya dhammamaññāya dhammānudhammappaṭipanno ca hoti; no ca kalyāṇavāco hoti kalyāṇavākkaraṇo, poriyā vācāya samannāgato vissaṭṭhāya anelagaḷāya atthassa viññāpaniyā; no ca sandassako hoti samādapako ",
      " samuttejako sampahaṃsako sabrahmacārīnaṃ. Imehi kho, bhikkhave, catūhi dhammehi samannāgato bhikkhu alaṃ attano nālaṃ paresaṃ."
    ],
    "innerText": "‘‘Catūhi , bhikkhave, dhammehi samannāgato bhikkhu alaṃ attano nālaṃ paresaṃ. Katamehi catūhi? Idha, bhikkhave, bhikkhu khippanisanti ca hoti kusalesu dhammesu; sutānañca dhammānaṃ dhāraṇajātiko hoti ; dhātānañca dhammānaṃ atthūpaparikkhitā hoti; atthamaññāya dhammamaññāya dhammānudhammappaṭipanno ca hoti; no ca kalyāṇavāco hoti kalyāṇavākkaraṇo, poriyā vācāya samannāgato vissaṭṭhāya anelagaḷāya atthassa viññāpaniyā; no ca sandassako hoti samādapako samuttejako sampahaṃsako sabrahmacārīnaṃ. Imehi kho, bhikkhave, catūhi dhammehi samannāgato bhikkhu alaṃ attano nālaṃ paresaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Catūhi, bhikkhave, dhammehi samannāgato bhikkhu alaṃ paresaṃ nālaṃ attano. Katamehi catūhi? Idha, bhikkhave, bhikkhu khippanisanti ca hoti kusalesu dhammesu; sutānañca dhammānaṃ dhāraṇajātiko hoti; no ca dhātānaṃ dhammānaṃ atthūpaparikkhitā hoti; na ca atthamaññāya dhammamaññāya dhammānudhammappaṭipanno hoti; kalyāṇavāco ca hoti kalyāṇavākkaraṇo…pe… atthassa viññāpaniyā; sandassako ca hoti…pe… sabrahmacārīnaṃ. Imehi kho, bhikkhave, catūhi dhammehi samannāgato bhikkhu alaṃ paresaṃ, nālaṃ attano."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tīhi, bhikkhave, dhammehi samannāgato bhikkhu alaṃ attano nālaṃ paresaṃ. Katamehi tīhi? Idha, bhikkhave, bhikkhu na heva kho khippanisanti ca hoti kusalesu dhammesu; sutānañca dhammānaṃ dhāraṇajātiko hoti; dhātānañca ",
      " dhammānaṃ atthūpaparikkhitā hoti; atthamaññāya dhammamaññāya dhammānudhammappaṭipanno ca hoti; no ca kalyāṇavāco hoti kalyāṇavākkaraṇo, poriyā vācāya samannāgato vissaṭṭhāya anelagaḷāya ",
      " atthassa viññāpaniyā; no ca sandassako hoti samādapako samuttejako sampahaṃsako sabrahmacārīnaṃ. Imehi kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu alaṃ attano, nālaṃ paresaṃ."
    ],
    "innerText": "‘‘Tīhi, bhikkhave, dhammehi samannāgato bhikkhu alaṃ attano nālaṃ paresaṃ. Katamehi tīhi? Idha, bhikkhave, bhikkhu na heva kho khippanisanti ca hoti kusalesu dhammesu; sutānañca dhammānaṃ dhāraṇajātiko hoti; dhātānañca dhammānaṃ atthūpaparikkhitā hoti; atthamaññāya dhammamaññāya dhammānudhammappaṭipanno ca hoti; no ca kalyāṇavāco hoti kalyāṇavākkaraṇo, poriyā vācāya samannāgato vissaṭṭhāya anelagaḷāya atthassa viññāpaniyā; no ca sandassako hoti samādapako samuttejako sampahaṃsako sabrahmacārīnaṃ. Imehi kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu alaṃ attano, nālaṃ paresaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tīhi, bhikkhave, dhammehi samannāgato bhikkhu alaṃ paresaṃ, nālaṃ attano. Katamehi tīhi? Idha, bhikkhave, bhikkhu na heva kho khippanisanti ca hoti kusalesu dhammesu; sutānañca dhammānaṃ dhāraṇajātiko hoti; no ca dhātānaṃ dhammānaṃ atthūpaparikkhitā hoti; no ca atthamaññāya dhammamaññāya dhammānudhammappaṭipanno hoti; kalyāṇavāco ca hoti…pe… atthassa viññāpaniyā; sandassako ca hoti samādapako samuttejako sampahaṃsako sabrahmacārīnaṃ. Imehi kho, bhikkhave, tīhi dhammehi samannāgato bhikkhu alaṃ paresaṃ, nālaṃ attano."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Dvīhi, bhikkhave, dhammehi samannāgato bhikkhu alaṃ attano, nālaṃ paresaṃ. Katamehi dvīhi? Idha, bhikkhave, bhikkhu na heva kho khippanisanti ca hoti kusalesu dhammesu; no ca ",
      " sutānaṃ dhammānaṃ dhāraṇajātiko hoti; dhātānañca dhammānaṃ atthūpaparikkhitā hoti; atthamaññāya dhammamaññāya dhammānudhammappaṭipanno ca hoti; no ca kalyāṇavāco hoti…pe… atthassa viññāpaniyā; no ca sandassako hoti…pe… sabrahmacārīnaṃ ",
      ". Imehi kho, bhikkhave, dvīhi dhammehi samannāgato bhikkhu alaṃ attano, nālaṃ paresaṃ."
    ],
    "innerText": "‘‘Dvīhi, bhikkhave, dhammehi samannāgato bhikkhu alaṃ attano, nālaṃ paresaṃ. Katamehi dvīhi? Idha, bhikkhave, bhikkhu na heva kho khippanisanti ca hoti kusalesu dhammesu; no ca sutānaṃ dhammānaṃ dhāraṇajātiko hoti; dhātānañca dhammānaṃ atthūpaparikkhitā hoti; atthamaññāya dhammamaññāya dhammānudhammappaṭipanno ca hoti; no ca kalyāṇavāco hoti…pe… atthassa viññāpaniyā; no ca sandassako hoti…pe… sabrahmacārīnaṃ . Imehi kho, bhikkhave, dvīhi dhammehi samannāgato bhikkhu alaṃ attano, nālaṃ paresaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Dvīhi, bhikkhave, dhammehi samannāgato bhikkhu alaṃ paresaṃ, nālaṃ attano. Katamehi dvīhi? Idha, bhikkhave, bhikkhu na heva kho khippanisanti ca hoti kusalesu dhammesu; no ca sutānaṃ dhammānaṃ dhāraṇajātiko hoti; no ca dhātānaṃ dhammānaṃ atthūpaparikkhitā ",
      " hoti; no ca atthamaññāya dhammamaññāya dhammānudhammappaṭipanno hoti; kalyāṇavāco ca hoti kalyāṇavākkaraṇo, poriyā vācāya samannāgato vissaṭṭhāya anelagaḷāya atthassa viññāpaniyā; sandassako ca hoti samādapako samuttejako sampahaṃsako sabrahmacārīnaṃ. Imehi kho, bhikkhave ",
      ", dvīhi dhammehi samannāgato bhikkhu alaṃ paresaṃ, nālaṃ attano’’ti. Dutiyaṃ."
    ],
    "innerText": "‘‘Dvīhi, bhikkhave, dhammehi samannāgato bhikkhu alaṃ paresaṃ, nālaṃ attano. Katamehi dvīhi? Idha, bhikkhave, bhikkhu na heva kho khippanisanti ca hoti kusalesu dhammesu; no ca sutānaṃ dhammānaṃ dhāraṇajātiko hoti; no ca dhātānaṃ dhammānaṃ atthūpaparikkhitā hoti; no ca atthamaññāya dhammamaññāya dhammānudhammappaṭipanno hoti; kalyāṇavāco ca hoti kalyāṇavākkaraṇo, poriyā vācāya samannāgato vissaṭṭhāya anelagaḷāya atthassa viññāpaniyā; sandassako ca hoti samādapako samuttejako sampahaṃsako sabrahmacārīnaṃ. Imehi kho, bhikkhave , dvīhi dhammehi samannāgato bhikkhu alaṃ paresaṃ, nālaṃ attano’’ti. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Saṃkhittasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "63"
      },
      ". Atha kho aññataro bhikkhu yena bhagavā tenupasaṅkami…pe… ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘sādhu me, bhante, bhagavā saṃkhittena dhammaṃ desetu, yamahaṃ bhagavato dhammaṃ sutvā eko vūpakaṭṭho appamatto ātāpī pahitatto vihareyya’’nti. ‘‘Evamevaṃ panidhekacce moghapurisā mamaññeva ajjhesanti. Dhamme ca bhāsite mamaññeva anubandhitabbaṃ maññantī’’ti. ‘‘Desetu me, bhante, bhagavā saṃkhittena dhammaṃ, desetu sugato saṃkhittena dhammaṃ. Appeva nāmāhaṃ bhagavato bhāsitassa atthaṃ ājāneyyaṃ, appeva nāmāhaṃ bhagavato bhāsitassa dāyādo assa’’nti. ‘‘Tasmātiha ",
      " te, bhikkhu evaṃ sikkhitabbaṃ – ‘ajjhattaṃ me cittaṃ ṭhitaṃ bhavissati susaṇṭhitaṃ, na ca uppannā pāpakā akusalā dhammā cittaṃ pariyādāya ṭhassantī’ti. Evañhi te, bhikkhu, sikkhitabbaṃ’’."
    ],
    "innerText": "63. Atha kho aññataro bhikkhu yena bhagavā tenupasaṅkami…pe… ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘sādhu me, bhante, bhagavā saṃkhittena dhammaṃ desetu, yamahaṃ bhagavato dhammaṃ sutvā eko vūpakaṭṭho appamatto ātāpī pahitatto vihareyya’’nti. ‘‘Evamevaṃ panidhekacce moghapurisā mamaññeva ajjhesanti. Dhamme ca bhāsite mamaññeva anubandhitabbaṃ maññantī’’ti. ‘‘Desetu me, bhante, bhagavā saṃkhittena dhammaṃ, desetu sugato saṃkhittena dhammaṃ. Appeva nāmāhaṃ bhagavato bhāsitassa atthaṃ ājāneyyaṃ, appeva nāmāhaṃ bhagavato bhāsitassa dāyādo assa’’nti. ‘‘Tasmātiha te, bhikkhu evaṃ sikkhitabbaṃ – ‘ajjhattaṃ me cittaṃ ṭhitaṃ bhavissati susaṇṭhitaṃ, na ca uppannā pāpakā akusalā dhammā cittaṃ pariyādāya ṭhassantī’ti. Evañhi te, bhikkhu, sikkhitabbaṃ’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yato kho te, bhikkhu, ajjhattaṃ cittaṃ ṭhitaṃ hoti susaṇṭhitaṃ, na ca uppannā pāpakā akusalā dhammā cittaṃ pariyādāya tiṭṭhanti, tato te, bhikkhu, evaṃ sikkhitabbaṃ – ‘mettā ",
      " me cetovimutti bhāvitā bhavissati bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā’ti. Evañhi te, bhikkhu, sikkhitabbaṃ."
    ],
    "innerText": "‘‘Yato kho te, bhikkhu, ajjhattaṃ cittaṃ ṭhitaṃ hoti susaṇṭhitaṃ, na ca uppannā pāpakā akusalā dhammā cittaṃ pariyādāya tiṭṭhanti, tato te, bhikkhu, evaṃ sikkhitabbaṃ – ‘mettā me cetovimutti bhāvitā bhavissati bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā’ti. Evañhi te, bhikkhu, sikkhitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yato kho te, bhikkhu, ayaṃ samādhi evaṃ bhāvito hoti bahulīkato, tato tvaṃ, bhikkhu, imaṃ samādhiṃ savitakkampi savicāraṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[savitakkasavicārampi (ka.)]"
      },
      " bhāveyyāsi, avitakkampi vicāramattaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[avitakkavicāramattampi (ka.) visuddhi. 1.271 passitabbaṃ]"
      },
      " bhāveyyāsi, avitakkampi avicāraṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[avitakkaavicārampi (ka.)]"
      },
      " bhāveyyāsi, sappītikampi bhāveyyāsi, nippītikampi bhāveyyāsi, sātasahagatampi bhāveyyāsi, upekkhāsahagatampi bhāveyyāsi."
    ],
    "innerText": "‘‘Yato kho te, bhikkhu, ayaṃ samādhi evaṃ bhāvito hoti bahulīkato, tato tvaṃ, bhikkhu, imaṃ samādhiṃ savitakkampi savicāraṃ [savitakkasavicārampi (ka.)] bhāveyyāsi, avitakkampi vicāramattaṃ [avitakkavicāramattampi (ka.) visuddhi. 1.271 passitabbaṃ] bhāveyyāsi, avitakkampi avicāraṃ [avitakkaavicārampi (ka.)] bhāveyyāsi, sappītikampi bhāveyyāsi, nippītikampi bhāveyyāsi, sātasahagatampi bhāveyyāsi, upekkhāsahagatampi bhāveyyāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yato kho, te bhikkhu, ayaṃ samādhi evaṃ bhāvito hoti subhāvito, tato te, bhikkhu, evaṃ sikkhitabbaṃ – ‘karuṇā me cetovimutti… muditā me cetovimutti… upekkhā me cetovimutti bhāvitā bhavissati ",
      " bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā’ti. Evañhi te, bhikkhu, sikkhitabbaṃ."
    ],
    "innerText": "‘‘Yato kho, te bhikkhu, ayaṃ samādhi evaṃ bhāvito hoti subhāvito, tato te, bhikkhu, evaṃ sikkhitabbaṃ – ‘karuṇā me cetovimutti… muditā me cetovimutti… upekkhā me cetovimutti bhāvitā bhavissati bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā’ti. Evañhi te, bhikkhu, sikkhitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Yato kho te, bhikkhu, ayaṃ samādhi evaṃ bhāvito hoti subhāvito, tato tvaṃ, bhikkhu, imaṃ samādhiṃ savitakkasavicārampi bhāveyyāsi, avitakkavicāramattampi bhāveyyāsi, avitakkaavicārampi bhāveyyāsi, sappītikampi bhāveyyāsi, nippītikampi bhāveyyāsi, sātasahagatampi bhāveyyāsi, upekkhāsahagatampi bhāveyyāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Yato kho te, bhikkhu, ayaṃ samādhi evaṃ bhāvito hoti subhāvito, tato te, bhikkhu, evaṃ sikkhitabbaṃ – ‘kāye kāyānupassī viharissāmi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassa’nti. Evañhi te, bhikkhu, sikkhitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yato kho te, bhikkhu, ayaṃ samādhi evaṃ bhāvito hoti bahulīkato, tato tvaṃ, bhikkhu, imaṃ samādhiṃ savitakkasavicārampi bhāveyyāsi, avitakkavicāramattampi ",
      " bhāveyyāsi, avitakkaavicārampi bhāveyyāsi, sappītikampi bhāveyyāsi, nippītikampi bhāveyyāsi, sātasahagatampi bhāveyyāsi ",
      ", upekkhāsahagatampi bhāveyyāsi."
    ],
    "innerText": "‘‘Yato kho te, bhikkhu, ayaṃ samādhi evaṃ bhāvito hoti bahulīkato, tato tvaṃ, bhikkhu, imaṃ samādhiṃ savitakkasavicārampi bhāveyyāsi, avitakkavicāramattampi bhāveyyāsi, avitakkaavicārampi bhāveyyāsi, sappītikampi bhāveyyāsi, nippītikampi bhāveyyāsi, sātasahagatampi bhāveyyāsi , upekkhāsahagatampi bhāveyyāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yato kho te, bhikkhu, ayaṃ samādhi evaṃ bhāvito hoti subhāvito, tato te, bhikkhu ",
      ", evaṃ sikkhitabbaṃ – ‘vedanāsu vedanānupassī viharissāmi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassa’nti; citte cittānupassī viharissāmi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassa’nti; dhammesu dhammānupassī viharissāmi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassa’nti. Evañhi te, bhikkhu, sikkhitabbaṃ."
    ],
    "innerText": "‘‘Yato kho te, bhikkhu, ayaṃ samādhi evaṃ bhāvito hoti subhāvito, tato te, bhikkhu , evaṃ sikkhitabbaṃ – ‘vedanāsu vedanānupassī viharissāmi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassa’nti; citte cittānupassī viharissāmi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassa’nti; dhammesu dhammānupassī viharissāmi ātāpī sampajāno satimā, vineyya loke abhijjhādomanassa’nti. Evañhi te, bhikkhu, sikkhitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Yato kho te, bhikkhu, ayaṃ samādhi evaṃ bhāvito hoti bahulīkato, tato tvaṃ, bhikkhu, imaṃ samādhiṃ savitakkasavicārampi bhāveyyāsi, avitakkavicāramattampi bhāveyyāsi, avitakkaavicārampi bhāveyyāsi, sappītikampi bhāveyyāsi, nippītikampi bhāveyyāsi, sātasahagatampi bhāveyyāsi, upekkhāsahagatampi bhāveyyāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yato kho te, bhikkhu, ayaṃ samādhi evaṃ bhāvito hoti subhāvito, tato tvaṃ, bhikkhu, yena yeneva gagghasi phāsuṃyeva gagghasi, yattha yattha ṭhassasi phāsuṃyeva ṭhassasi, yattha yattha nisīdissasi phāsuṃyeva nisīdissasi, yattha yattha seyyaṃ kappessasi ",
      " phāsuṃyeva seyyaṃ kappessasī’’ti."
    ],
    "innerText": "‘‘Yato kho te, bhikkhu, ayaṃ samādhi evaṃ bhāvito hoti subhāvito, tato tvaṃ, bhikkhu, yena yeneva gagghasi phāsuṃyeva gagghasi, yattha yattha ṭhassasi phāsuṃyeva ṭhassasi, yattha yattha nisīdissasi phāsuṃyeva nisīdissasi, yattha yattha seyyaṃ kappessasi phāsuṃyeva seyyaṃ kappessasī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " kho so bhikkhu bhagavatā iminā ovādena ovadito uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi. Atha kho so bhikkhu eko vūpakaṭṭho appamatto ātāpī pahitatto viharanto nacirasseva – yassatthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti, tadanuttaraṃ – brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihāsi. ‘‘Khīṇā ",
      " jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’’ti abbhaññāsi. Aññataro ca pana so bhikkhu arahataṃ ahosīti. Tatiyaṃ."
    ],
    "innerText": "Atha kho so bhikkhu bhagavatā iminā ovādena ovadito uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi. Atha kho so bhikkhu eko vūpakaṭṭho appamatto ātāpī pahitatto viharanto nacirasseva – yassatthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti, tadanuttaraṃ – brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihāsi. ‘‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’’ti abbhaññāsi. Aññataro ca pana so bhikkhu arahataṃ ahosīti. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Gayāsīsasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "64"
      },
      ". Ekaṃ samayaṃ bhagavā gayāyaṃ viharati gayāsīse. Tatra kho bhagavā bhikkhū āmantesi…pe… ‘‘pubbāhaṃ, bhikkhave, sambodhā anabhisambuddho bodhisattova samāno obhāsaññeva kho sañjānāmi, no ca rūpāni passāmi’’."
    ],
    "innerText": "64. Ekaṃ samayaṃ bhagavā gayāyaṃ viharati gayāsīse. Tatra kho bhagavā bhikkhū āmantesi…pe… ‘‘pubbāhaṃ, bhikkhave, sambodhā anabhisambuddho bodhisattova samāno obhāsaññeva kho sañjānāmi, no ca rūpāni passāmi’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tassa ",
      " mayhaṃ, bhikkhave, etadahosi – ‘sace kho ahaṃ obhāsañceva sañjāneyyaṃ rūpāni ca passeyyaṃ; evaṃ me idaṃ ñāṇadassanaṃ parisuddhataraṃ assā’’’ti."
    ],
    "innerText": "‘‘Tassa mayhaṃ, bhikkhave, etadahosi – ‘sace kho ahaṃ obhāsañceva sañjāneyyaṃ rūpāni ca passeyyaṃ; evaṃ me idaṃ ñāṇadassanaṃ parisuddhataraṃ assā’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘So kho ahaṃ, bhikkhave, aparena samayena appamatto ātāpī pahitatto viharanto obhāsañceva sañjānāmi, rūpāni ca passāmi; no ca kho tāhi devatāhi saddhiṃ santiṭṭhāmi sallapāmi sākacchaṃ samāpajjāmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tassa mayhaṃ, bhikkhave, etadahosi – ‘sace kho ahaṃ obhāsañceva sañjāneyyaṃ, rūpāni ca passeyyaṃ, tāhi ca devatāhi saddhiṃ santiṭṭheyyaṃ sallapeyyaṃ ",
      " sākacchaṃ samāpajjeyyaṃ; evaṃ me idaṃ ñāṇadassanaṃ parisuddhataraṃ assā’’’ti."
    ],
    "innerText": "‘‘Tassa mayhaṃ, bhikkhave, etadahosi – ‘sace kho ahaṃ obhāsañceva sañjāneyyaṃ, rūpāni ca passeyyaṃ, tāhi ca devatāhi saddhiṃ santiṭṭheyyaṃ sallapeyyaṃ sākacchaṃ samāpajjeyyaṃ; evaṃ me idaṃ ñāṇadassanaṃ parisuddhataraṃ assā’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘So kho ahaṃ, bhikkhave, aparena samayena appamatto ātāpī pahitatto viharanto obhāsañceva sañjānāmi, rūpāni ca passāmi, tāhi ca devatāhi saddhiṃ santiṭṭhāmi sallapāmi sākacchaṃ samāpajjāmi; no ca kho tā devatā jānāmi – imā devatā amukamhā vā amukamhā vā devanikāyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tassa ",
      " mayhaṃ, bhikkhave, etadahosi – ‘sace kho ahaṃ obhāsañceva sañjāneyyaṃ, rūpāni ca passeyyaṃ, tāhi ca devatāhi saddhiṃ santiṭṭheyyaṃ sallapeyyaṃ sākacchaṃ samāpajjeyyaṃ, tā ca devatā jāneyyaṃ – imā devatā amukamhā vā amukamhā vā devanikāyā’ti; evaṃ me idaṃ ñāṇadassanaṃ parisuddhataraṃ assā’’’ti."
    ],
    "innerText": "‘‘Tassa mayhaṃ, bhikkhave, etadahosi – ‘sace kho ahaṃ obhāsañceva sañjāneyyaṃ, rūpāni ca passeyyaṃ, tāhi ca devatāhi saddhiṃ santiṭṭheyyaṃ sallapeyyaṃ sākacchaṃ samāpajjeyyaṃ, tā ca devatā jāneyyaṃ – imā devatā amukamhā vā amukamhā vā devanikāyā’ti; evaṃ me idaṃ ñāṇadassanaṃ parisuddhataraṃ assā’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘So kho ahaṃ, bhikkhave, aparena samayena appamatto ātāpī pahitatto viharanto obhāsañceva sañjānāmi, rūpāni ca passāmi, tāhi ca devatāhi saddhiṃ santiṭṭhāmi sallapāmi sākacchaṃ samāpajjāmi, tā ca devatā jānāmi – ‘imā devatā amukamhā vā amukamhā vā devanikāyā’ti; no ca kho tā devatā jānāmi – ‘imā devatā imassa kammassa vipākena ito cutā tattha upapannā’ti…pe… tā ca devatā jānāmi – ‘imā devatā imassa kammassa vipākena ito cutā tattha upapannā’ti; no ca kho tā devatā jānāmi – ‘imā devatā imassa kammassa vipākena evamāhārā evaṃsukhadukkhappaṭisaṃvediniyo’ti ",
      " …pe… tā ca devatā jānāmi – ‘imā devatā imassa kammassa vipākena evamāhārā evaṃsukhadukkhappaṭisaṃvediniyo’ti; no ca kho tā devatā jānāmi – ‘imā devatā evaṃdīghāyukā ",
      " evaṃciraṭṭhitikā’ti…pe… tā ca devatā jānāmi – ‘imā devatā evaṃdīghāyukā evaṃciraṭṭhitikā’ti; no ca kho tā devatā jānāmi yadi vā me imāhi devatāhi saddhiṃ sannivutthapubbaṃ yadi vā na sannivutthapubbanti."
    ],
    "innerText": "‘‘So kho ahaṃ, bhikkhave, aparena samayena appamatto ātāpī pahitatto viharanto obhāsañceva sañjānāmi, rūpāni ca passāmi, tāhi ca devatāhi saddhiṃ santiṭṭhāmi sallapāmi sākacchaṃ samāpajjāmi, tā ca devatā jānāmi – ‘imā devatā amukamhā vā amukamhā vā devanikāyā’ti; no ca kho tā devatā jānāmi – ‘imā devatā imassa kammassa vipākena ito cutā tattha upapannā’ti…pe… tā ca devatā jānāmi – ‘imā devatā imassa kammassa vipākena ito cutā tattha upapannā’ti; no ca kho tā devatā jānāmi – ‘imā devatā imassa kammassa vipākena evamāhārā evaṃsukhadukkhappaṭisaṃvediniyo’ti …pe… tā ca devatā jānāmi – ‘imā devatā imassa kammassa vipākena evamāhārā evaṃsukhadukkhappaṭisaṃvediniyo’ti; no ca kho tā devatā jānāmi – ‘imā devatā evaṃdīghāyukā evaṃciraṭṭhitikā’ti…pe… tā ca devatā jānāmi – ‘imā devatā evaṃdīghāyukā evaṃciraṭṭhitikā’ti; no ca kho tā devatā jānāmi yadi vā me imāhi devatāhi saddhiṃ sannivutthapubbaṃ yadi vā na sannivutthapubbanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tassa mayhaṃ, bhikkhave, etadahosi – ‘sace kho ahaṃ obhāsañceva sañjāneyyaṃ, rūpāni ca passeyyaṃ, tāhi ca devatāhi saddhiṃ santiṭṭheyyaṃ sallapeyyaṃ sākacchaṃ samāpajjeyyaṃ ",
      ", tā ca devatā jāneyyaṃ – ‘imā devatā amukamhā vā amukamhā vā devanikāyā’ti, tā ca devatā jāneyyaṃ – ‘imā devatā imassa kammassa vipākena ito cutā tattha upapannā’ti, tā ca devatā jāneyyaṃ – ‘imā devatā evamāhārā evaṃsukhadukkhappaṭisaṃvediniyo’ti, tā ca devatā jāneyyaṃ – ‘imā devatā evaṃdīghāyukā evaṃciraṭṭhitikā’ti, tā ca devatā jāneyyaṃ yadi vā me imāhi devatāhi saddhiṃ sannivutthapubbaṃ yadi vā na sannivutthapubbanti; evaṃ me idaṃ ñāṇadassanaṃ parisuddhataraṃ assā’’’ti."
    ],
    "innerText": "‘‘Tassa mayhaṃ, bhikkhave, etadahosi – ‘sace kho ahaṃ obhāsañceva sañjāneyyaṃ, rūpāni ca passeyyaṃ, tāhi ca devatāhi saddhiṃ santiṭṭheyyaṃ sallapeyyaṃ sākacchaṃ samāpajjeyyaṃ , tā ca devatā jāneyyaṃ – ‘imā devatā amukamhā vā amukamhā vā devanikāyā’ti, tā ca devatā jāneyyaṃ – ‘imā devatā imassa kammassa vipākena ito cutā tattha upapannā’ti, tā ca devatā jāneyyaṃ – ‘imā devatā evamāhārā evaṃsukhadukkhappaṭisaṃvediniyo’ti, tā ca devatā jāneyyaṃ – ‘imā devatā evaṃdīghāyukā evaṃciraṭṭhitikā’ti, tā ca devatā jāneyyaṃ yadi vā me imāhi devatāhi saddhiṃ sannivutthapubbaṃ yadi vā na sannivutthapubbanti; evaṃ me idaṃ ñāṇadassanaṃ parisuddhataraṃ assā’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘So ",
      " kho ahaṃ, bhikkhave, aparena samayena appamatto ātāpī pahitatto viharanto obhāsañceva sañjānāmi, rūpāni ca passāmi, tāhi ca devatāhi saddhiṃ santiṭṭhāmi sallapāmi sākacchaṃ samāpajjāmi, tā ca devatā jānāmi – ‘imā devatā amukamhā vā amukamhā vā devanikāyā’ti, tā ca devatā jānāmi – ‘imā devatā imassa kammassa vipākena ito cutā tattha upapannā’ti, tā ca devatā jānāmi – ‘imā devatā evamāhārā evaṃsukhadukkhappaṭisaṃvediniyo’ti ",
      ", tā ca devatā jānāmi – ‘imā devatā evaṃdīghāyukā evaṃciraṭṭhitikā’ti, tā ca devatā jānāmi yadi vā me devatāhi saddhiṃ sannivutthapubbaṃ yadi vā na sannivutthapubbanti."
    ],
    "innerText": "‘‘So kho ahaṃ, bhikkhave, aparena samayena appamatto ātāpī pahitatto viharanto obhāsañceva sañjānāmi, rūpāni ca passāmi, tāhi ca devatāhi saddhiṃ santiṭṭhāmi sallapāmi sākacchaṃ samāpajjāmi, tā ca devatā jānāmi – ‘imā devatā amukamhā vā amukamhā vā devanikāyā’ti, tā ca devatā jānāmi – ‘imā devatā imassa kammassa vipākena ito cutā tattha upapannā’ti, tā ca devatā jānāmi – ‘imā devatā evamāhārā evaṃsukhadukkhappaṭisaṃvediniyo’ti , tā ca devatā jānāmi – ‘imā devatā evaṃdīghāyukā evaṃciraṭṭhitikā’ti, tā ca devatā jānāmi yadi vā me devatāhi saddhiṃ sannivutthapubbaṃ yadi vā na sannivutthapubbanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yāvakīvañca me, bhikkhave, evaṃ aṭṭhaparivaṭṭaṃ adhidevañāṇadassanaṃ na suvisuddhaṃ ahosi, neva tāvāhaṃ, bhikkhave, ‘sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya anuttaraṃ sammāsambodhiṃ abhisambuddho’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[abhisambuddho (sī. syā. pī.)]"
      },
      " paccaññāsiṃ. Yato ca kho me ",
      ", bhikkhave, evaṃ aṭṭhaparivaṭṭaṃ adhidevañāṇadassanaṃ suvisuddhaṃ ahosi, athāhaṃ, bhikkhave, ‘sadevake ",
      " loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya anuttaraṃ sammāsambodhiṃ abhisambuddho’ti paccaññāsiṃ; ñāṇañca pana me dassanaṃ udapādi; akuppā me cetovimutti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vimutti (ka. sī. ka.)]"
      },
      "; ayamantimā jāti natthi dāni punabbhavo’’ti. Catutthaṃ."
    ],
    "innerText": "‘‘Yāvakīvañca me, bhikkhave, evaṃ aṭṭhaparivaṭṭaṃ adhidevañāṇadassanaṃ na suvisuddhaṃ ahosi, neva tāvāhaṃ, bhikkhave, ‘sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya anuttaraṃ sammāsambodhiṃ abhisambuddho’ti [abhisambuddho (sī. syā. pī.)] paccaññāsiṃ. Yato ca kho me , bhikkhave, evaṃ aṭṭhaparivaṭṭaṃ adhidevañāṇadassanaṃ suvisuddhaṃ ahosi, athāhaṃ, bhikkhave, ‘sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya anuttaraṃ sammāsambodhiṃ abhisambuddho’ti paccaññāsiṃ; ñāṇañca pana me dassanaṃ udapādi; akuppā me cetovimutti [vimutti (ka. sī. ka.)]; ayamantimā jāti natthi dāni punabbhavo’’ti. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Abhibhāyatanasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "65"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[dī. ni. 3.338, 358; a. ni. 10.29]"
      },
      " ‘‘Aṭṭhimāni, bhikkhave, abhibhāyatanāni. Katamāni aṭṭha? Ajjhattaṃ rūpasaññī eko bahiddhā rūpāni passati parittāni suvaṇṇadubbaṇṇāni. ‘Tāni abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Idaṃ paṭhamaṃ abhibhāyatanaṃ."
    ],
    "innerText": "65.[dī. ni. 3.338, 358; a. ni. 10.29] ‘‘Aṭṭhimāni, bhikkhave, abhibhāyatanāni. Katamāni aṭṭha? Ajjhattaṃ rūpasaññī eko bahiddhā rūpāni passati parittāni suvaṇṇadubbaṇṇāni. ‘Tāni abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Idaṃ paṭhamaṃ abhibhāyatanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ajjhattaṃ rūpasaññī eko bahiddhā rūpāni passati appamāṇāni suvaṇṇadubbaṇṇāni. ‘Tāni abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Idaṃ dutiyaṃ abhibhāyatanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ajjhattaṃ ",
      " arūpasaññī eko bahiddhā rūpāni passati parittāni suvaṇṇadubbaṇṇāni. ‘Tāni abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Idaṃ tatiyaṃ ",
      " abhibhāyatanaṃ."
    ],
    "innerText": "‘‘Ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati parittāni suvaṇṇadubbaṇṇāni. ‘Tāni abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Idaṃ tatiyaṃ abhibhāyatanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati appamāṇāni suvaṇṇadubbaṇṇāni. ‘Tāni abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Idaṃ catutthaṃ abhibhāyatanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati nīlāni nīlavaṇṇāni nīlanidassanāni nīlanibhāsāni. ‘Tāni abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Idaṃ pañcamaṃ abhibhāyatanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati pītāni pītavaṇṇāni pītanidassanāni pītanibhāsāni. ‘Tāni abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Idaṃ chaṭṭhaṃ abhibhāyatanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ajjhattaṃ ",
      " arūpasaññī eko bahiddhā rūpāni passati lohitakāni lohitakavaṇṇāni lohitakanidassanāni lohitakanibhāsāni. ‘Tāni abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Idaṃ sattamaṃ abhibhāyatanaṃ."
    ],
    "innerText": "‘‘Ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati lohitakāni lohitakavaṇṇāni lohitakanidassanāni lohitakanibhāsāni. ‘Tāni abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Idaṃ sattamaṃ abhibhāyatanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati odātāni odātavaṇṇāni odātanidassanāni odātanibhāsāni. ‘Tāni abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Idaṃ aṭṭhamaṃ abhibhāyatanaṃ. Imāni kho, bhikkhave, aṭṭha abhibhāyatanānī’’ti. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Vimokkhasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "66"
      },
      ". ‘‘Aṭṭhime, bhikkhave, vimokkhā. Katame aṭṭha? Rūpī rūpāni passati. Ayaṃ paṭhamo vimokkho."
    ],
    "innerText": "66. ‘‘Aṭṭhime, bhikkhave, vimokkhā. Katame aṭṭha? Rūpī rūpāni passati. Ayaṃ paṭhamo vimokkho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ajjhattaṃ arūpasaññī, bahiddhā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[arūpasaññī eko bahiddhā (syā. pī. ka.) dī. ni. 2.129; dī. ni. 3.338, 358; a. ni. 8.119; ma. ni. 2.248 passitabbaṃ]"
      },
      " rūpāni passati. Ayaṃ dutiyo vimokkho."
    ],
    "innerText": "‘‘Ajjhattaṃ arūpasaññī, bahiddhā [arūpasaññī eko bahiddhā (syā. pī. ka.) dī. ni. 2.129; dī. ni. 3.338, 358; a. ni. 8.119; ma. ni. 2.248 passitabbaṃ] rūpāni passati. Ayaṃ dutiyo vimokkho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Subhanteva adhimutto hoti. Ayaṃ tatiyo vimokkho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sabbaso ",
      " rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ‘ananto ",
      " ākāso’ti ākāsānañcāyatanaṃ upasampajja viharati. Ayaṃ catuttho vimokkho."
    ],
    "innerText": "‘‘Sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ‘ananto ākāso’ti ākāsānañcāyatanaṃ upasampajja viharati. Ayaṃ catuttho vimokkho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sabbaso ākāsānañcāyatanaṃ samatikkamma ‘anantaṃ viññāṇa’nti viññāṇañcāyatanaṃ upasampajja viharati. Ayaṃ pañcamo vimokkho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sabbaso viññāṇañcāyatanaṃ samatikkamma ‘natthi kiñcī’ti ākiñcaññāyatanaṃ upasampajja viharati. Ayaṃ chaṭṭho vimokkho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sabbaso ",
      " ākiñcaññāyatanaṃ samatikkamma nevasaññānāsaññāyatanaṃ upasampajja viharati. Ayaṃ sattamo vimokkho."
    ],
    "innerText": "‘‘Sabbaso ākiñcaññāyatanaṃ samatikkamma nevasaññānāsaññāyatanaṃ upasampajja viharati. Ayaṃ sattamo vimokkho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sabbaso nevasaññānāsaññāyatanaṃ samatikkamma saññāvedayitanirodhaṃ upasampajja viharati. Ayaṃ aṭṭhamo vimokkho. Ime kho, bhikkhave, aṭṭha vimokkhā’’ti. Chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Anariyavohārasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "67"
      },
      ". ‘‘Aṭṭhime ",
      ", bhikkhave, anariyavohārā. Katame aṭṭha? Adiṭṭhe diṭṭhavāditā, asute sutavāditā, amute mutavāditā, aviññāte viññātavāditā, diṭṭhe adiṭṭhavāditā, sute asutavāditā, mute amutavāditā, viññāte aviññātavāditā. Ime kho, bhikkhave, aṭṭha anariyavohārā’’ti. Sattamaṃ."
    ],
    "innerText": "67. ‘‘Aṭṭhime , bhikkhave, anariyavohārā. Katame aṭṭha? Adiṭṭhe diṭṭhavāditā, asute sutavāditā, amute mutavāditā, aviññāte viññātavāditā, diṭṭhe adiṭṭhavāditā, sute asutavāditā, mute amutavāditā, viññāte aviññātavāditā. Ime kho, bhikkhave, aṭṭha anariyavohārā’’ti. Sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Ariyavohārasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "68"
      },
      ". ‘‘Aṭṭhime, bhikkhave, ariyavohārā. Katame aṭṭha? Adiṭṭhe adiṭṭhavāditā, asute asutavāditā, amute amutavāditā, aviññāte aviññātavāditā, diṭṭhe diṭṭhavāditā, sute sutavāditā, mute mutavāditā, viññāte viññātavāditā. Ime kho, bhikkhave, aṭṭha ariyavohārā’’ti. Aṭṭhamaṃ."
    ],
    "innerText": "68. ‘‘Aṭṭhime, bhikkhave, ariyavohārā. Katame aṭṭha? Adiṭṭhe adiṭṭhavāditā, asute asutavāditā, amute amutavāditā, aviññāte aviññātavāditā, diṭṭhe diṭṭhavāditā, sute sutavāditā, mute mutavāditā, viññāte viññātavāditā. Ime kho, bhikkhave, aṭṭha ariyavohārā’’ti. Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Parisāsuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "69"
      },
      ". ‘‘Aṭṭhimā, bhikkhave, parisā. Katamā aṭṭha? Khattiyaparisā ",
      ", brāhmaṇaparisā, gahapatiparisā, samaṇaparisā, cātumahārājikaparisā, tāvatiṃsaparisā, māraparisā, brahmaparisā. Abhijānāmi kho panāhaṃ, bhikkhave, anekasataṃ ",
      " khattiyaparisaṃ upasaṅkamitā. Tatrapi mayā sannisinnapubbañceva sallapitapubbañca sākacchā ca samāpannapubbā. Tattha yādisako tesaṃ vaṇṇo hoti tādisako mayhaṃ vaṇṇo hoti, yādisako tesaṃ saro hoti tādisako mayhaṃ saro hoti. Dhammiyā ca kathāya sandassemi samādapemi samuttejemi sampahaṃsemi ",
      ". Bhāsamānañca maṃ na jānanti – ‘ko nu kho ayaṃ bhāsati devo vā manusso vā’ti. Dhammiyā kathāya sandassetvā samādapetvā samuttejetvā sampahaṃsetvā antaradhāyāmi. Antarahitañca maṃ na jānanti – ‘ko nu kho ayaṃ antarahito devo vā manusso vā’’’ti."
    ],
    "innerText": "69. ‘‘Aṭṭhimā, bhikkhave, parisā. Katamā aṭṭha? Khattiyaparisā , brāhmaṇaparisā, gahapatiparisā, samaṇaparisā, cātumahārājikaparisā, tāvatiṃsaparisā, māraparisā, brahmaparisā. Abhijānāmi kho panāhaṃ, bhikkhave, anekasataṃ khattiyaparisaṃ upasaṅkamitā. Tatrapi mayā sannisinnapubbañceva sallapitapubbañca sākacchā ca samāpannapubbā. Tattha yādisako tesaṃ vaṇṇo hoti tādisako mayhaṃ vaṇṇo hoti, yādisako tesaṃ saro hoti tādisako mayhaṃ saro hoti. Dhammiyā ca kathāya sandassemi samādapemi samuttejemi sampahaṃsemi . Bhāsamānañca maṃ na jānanti – ‘ko nu kho ayaṃ bhāsati devo vā manusso vā’ti. Dhammiyā kathāya sandassetvā samādapetvā samuttejetvā sampahaṃsetvā antaradhāyāmi. Antarahitañca maṃ na jānanti – ‘ko nu kho ayaṃ antarahito devo vā manusso vā’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Abhijānāmi ",
      " kho panāhaṃ, bhikkhave, anekasataṃ brāhmaṇaparisaṃ…pe… gahapatiparisaṃ… samaṇaparisaṃ… cātumahārājikaparisaṃ… tāvatiṃsaparisaṃ… māraparisaṃ… brahmaparisaṃ upasaṅkamitā. Tatrapi mayā sannisinnapubbañceva sallapitapubbañca sākacchā ca samāpannapubbā. Tattha yādisako tesaṃ vaṇṇo hoti tādisako mayhaṃ vaṇṇo hoti, yādisako tesaṃ saro hoti tādisako mayhaṃ saro hoti. Dhammiyā ca kathāya sandassemi samādapemi samuttejemi sampahaṃsemi. Bhāsamānañca maṃ na jānanti – ‘ko nu kho ayaṃ bhāsati devo vā manusso vā’ti. Dhammiyā kathāya sandassetvā samādapetvā samuttejetvā sampahaṃsetvā antaradhāyāmi. Antarahitañca maṃ na jānanti – ‘ko nu ",
      " kho ayaṃ antarahito devo vā manusso vā’ti. Imā kho, bhikkhave, aṭṭha parisā’’ti. Navamaṃ."
    ],
    "innerText": "‘‘Abhijānāmi kho panāhaṃ, bhikkhave, anekasataṃ brāhmaṇaparisaṃ…pe… gahapatiparisaṃ… samaṇaparisaṃ… cātumahārājikaparisaṃ… tāvatiṃsaparisaṃ… māraparisaṃ… brahmaparisaṃ upasaṅkamitā. Tatrapi mayā sannisinnapubbañceva sallapitapubbañca sākacchā ca samāpannapubbā. Tattha yādisako tesaṃ vaṇṇo hoti tādisako mayhaṃ vaṇṇo hoti, yādisako tesaṃ saro hoti tādisako mayhaṃ saro hoti. Dhammiyā ca kathāya sandassemi samādapemi samuttejemi sampahaṃsemi. Bhāsamānañca maṃ na jānanti – ‘ko nu kho ayaṃ bhāsati devo vā manusso vā’ti. Dhammiyā kathāya sandassetvā samādapetvā samuttejetvā sampahaṃsetvā antaradhāyāmi. Antarahitañca maṃ na jānanti – ‘ko nu kho ayaṃ antarahito devo vā manusso vā’ti. Imā kho, bhikkhave, aṭṭha parisā’’ti. Navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Bhūmicālasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "70"
      },
      ". Ekaṃ samayaṃ bhagavā vesāliyaṃ viharati mahāvane kūṭāgārasālāyaṃ. Atha kho bhagavā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya vesāliṃ piṇḍāya pāvisi. Vesāliyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātapaṭikkanto āyasmantaṃ ānandaṃ āmantesi – ‘‘gaṇhāhi, ānanda, nisīdanaṃ. Yena cāpālaṃ cetiyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pāvālacetiyaṃ (syā.), cāpālacetiyaṃ (pī. ka.)]"
      },
      " tenupasaṅkamissāma divāvihārāyā’’ti. ‘‘Evaṃ, bhante’’ti kho āyasmā ānando bhagavato paṭissutvā nisīdanaṃ ādāya bhagavantaṃ piṭṭhito piṭṭhito anubandhi."
    ],
    "innerText": "70. Ekaṃ samayaṃ bhagavā vesāliyaṃ viharati mahāvane kūṭāgārasālāyaṃ. Atha kho bhagavā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya vesāliṃ piṇḍāya pāvisi. Vesāliyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātapaṭikkanto āyasmantaṃ ānandaṃ āmantesi – ‘‘gaṇhāhi, ānanda, nisīdanaṃ. Yena cāpālaṃ cetiyaṃ [pāvālacetiyaṃ (syā.), cāpālacetiyaṃ (pī. ka.)] tenupasaṅkamissāma divāvihārāyā’’ti. ‘‘Evaṃ, bhante’’ti kho āyasmā ānando bhagavato paṭissutvā nisīdanaṃ ādāya bhagavantaṃ piṭṭhito piṭṭhito anubandhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " kho bhagavā yena cāpālaṃ cetiyaṃ tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Nisajja kho bhagavā āyasmantaṃ ānandaṃ āmantesi – ‘‘ramaṇīyā ",
      ", ānanda, vesālī, ramaṇīyaṃ udenaṃ cetiyaṃ, ramaṇīyaṃ gotamakaṃ cetiyaṃ, ramaṇīyaṃ sattambaṃ cetiyaṃ, ramaṇīyaṃ bahuputtakaṃ cetiyaṃ; ramaṇīyaṃ sārandadaṃ cetiyaṃ, ramaṇīyaṃ cāpālaṃ cetiyaṃ. Yassa kassaci ",
      ", ānanda, cattāro iddhipādā bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā, ākaṅkhamāno so, ānanda, kappaṃ vā tiṭṭheyya kappāvasesaṃ vā. Tathāgatassa kho, ānanda, cattāro iddhipādā bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā. Ākaṅkhamāno, ānanda, tathāgato kappaṃ vā tiṭṭheyya kappāvasesaṃ vā’’ti. Evampi kho āyasmā ānando bhagavatā oḷārike nimitte kayiramāne oḷārike ",
      " obhāse kayiramāne nāsakkhi paṭivijjhituṃ; na bhagavantaṃ yāci – ‘‘tiṭṭhatu, bhante, bhagavā kappaṃ, tiṭṭhatu sugato kappaṃ bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussāna’’nti, yathā taṃ mārena pariyuṭṭhitacitto."
    ],
    "innerText": "Atha kho bhagavā yena cāpālaṃ cetiyaṃ tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Nisajja kho bhagavā āyasmantaṃ ānandaṃ āmantesi – ‘‘ramaṇīyā , ānanda, vesālī, ramaṇīyaṃ udenaṃ cetiyaṃ, ramaṇīyaṃ gotamakaṃ cetiyaṃ, ramaṇīyaṃ sattambaṃ cetiyaṃ, ramaṇīyaṃ bahuputtakaṃ cetiyaṃ; ramaṇīyaṃ sārandadaṃ cetiyaṃ, ramaṇīyaṃ cāpālaṃ cetiyaṃ. Yassa kassaci , ānanda, cattāro iddhipādā bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā, ākaṅkhamāno so, ānanda, kappaṃ vā tiṭṭheyya kappāvasesaṃ vā. Tathāgatassa kho, ānanda, cattāro iddhipādā bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā. Ākaṅkhamāno, ānanda, tathāgato kappaṃ vā tiṭṭheyya kappāvasesaṃ vā’’ti. Evampi kho āyasmā ānando bhagavatā oḷārike nimitte kayiramāne oḷārike obhāse kayiramāne nāsakkhi paṭivijjhituṃ; na bhagavantaṃ yāci – ‘‘tiṭṭhatu, bhante, bhagavā kappaṃ, tiṭṭhatu sugato kappaṃ bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussāna’’nti, yathā taṃ mārena pariyuṭṭhitacitto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dutiyampi kho bhagavā…pe… tatiyampi kho bhagavā āyasmantaṃ ānandaṃ āmantesi – ‘‘ramaṇīyā, ānanda, vesālī, ramaṇīyaṃ udenaṃ cetiyaṃ, ramaṇīyaṃ gotamakaṃ cetiyaṃ, ramaṇīyaṃ sattambaṃ cetiyaṃ, ramaṇīyaṃ bahuputtakaṃ cetiyaṃ, ramaṇīyaṃ sārandadaṃ cetiyaṃ, ramaṇīyaṃ cāpālaṃ cetiyaṃ. Yassa kassaci, ānanda, cattāro iddhipādā bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā, ākaṅkhamāno so, ānanda, kappaṃ vā tiṭṭheyya kappāvasesaṃ vā. Tathāgatassa kho, ānanda, cattāro iddhipādā bhāvitā…pe… ākaṅkhamāno, ānanda, tathāgato kappaṃ vā tiṭṭheyya kappāvasesaṃ vā’’ti. Evampi kho āyasmā ānando bhagavatā ",
      " oḷārike nimitte kayiramāne oḷārike obhāse kayiramāne nāsakkhi paṭivijjhituṃ; na bhagavantaṃ yāci – ‘‘tiṭṭhatu, bhante, bhagavā kappaṃ, tiṭṭhatu sugato kappaṃ bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussāna’’nti, yathā taṃ mārena pariyuṭṭhitacitto."
    ],
    "innerText": "Dutiyampi kho bhagavā…pe… tatiyampi kho bhagavā āyasmantaṃ ānandaṃ āmantesi – ‘‘ramaṇīyā, ānanda, vesālī, ramaṇīyaṃ udenaṃ cetiyaṃ, ramaṇīyaṃ gotamakaṃ cetiyaṃ, ramaṇīyaṃ sattambaṃ cetiyaṃ, ramaṇīyaṃ bahuputtakaṃ cetiyaṃ, ramaṇīyaṃ sārandadaṃ cetiyaṃ, ramaṇīyaṃ cāpālaṃ cetiyaṃ. Yassa kassaci, ānanda, cattāro iddhipādā bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā, ākaṅkhamāno so, ānanda, kappaṃ vā tiṭṭheyya kappāvasesaṃ vā. Tathāgatassa kho, ānanda, cattāro iddhipādā bhāvitā…pe… ākaṅkhamāno, ānanda, tathāgato kappaṃ vā tiṭṭheyya kappāvasesaṃ vā’’ti. Evampi kho āyasmā ānando bhagavatā oḷārike nimitte kayiramāne oḷārike obhāse kayiramāne nāsakkhi paṭivijjhituṃ; na bhagavantaṃ yāci – ‘‘tiṭṭhatu, bhante, bhagavā kappaṃ, tiṭṭhatu sugato kappaṃ bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussāna’’nti, yathā taṃ mārena pariyuṭṭhitacitto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " kho bhagavā āyasmantaṃ ānandaṃ āmantesi – ‘‘gaccha tvaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[gaccha kho tvaṃ (saṃ. ni. 5.822) udā. 51 passitabbaṃ]"
      },
      ", ānanda, yassa dāni kālaṃ maññasī’’ti. ‘‘Evaṃ, bhante’’ti kho āyasmā ānando bhagavato paṭissutvā uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā bhagavato avidūre aññatarasmiṃ rukkhamūle nisīdi. Atha kho māro pāpimā acirapakkante āyasmante ānande bhagavantaṃ ",
      " etadavoca –"
    ],
    "innerText": "Atha kho bhagavā āyasmantaṃ ānandaṃ āmantesi – ‘‘gaccha tvaṃ [gaccha kho tvaṃ (saṃ. ni. 5.822) udā. 51 passitabbaṃ], ānanda, yassa dāni kālaṃ maññasī’’ti. ‘‘Evaṃ, bhante’’ti kho āyasmā ānando bhagavato paṭissutvā uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā bhagavato avidūre aññatarasmiṃ rukkhamūle nisīdi. Atha kho māro pāpimā acirapakkante āyasmante ānande bhagavantaṃ etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Parinibbātu dāni, bhante, bhagavā, parinibbātu sugato. Parinibbānakālo dāni, bhante ",
      ", bhagavato. Bhāsitā kho panesā, bhante, bhagavatā vācā – ‘na tāvāhaṃ, pāpima, parinibbāyissāmi yāva me bhikkhū na sāvakā bhavissanti viyattā vinītā visāradā pattayogakkhemā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[idaṃ padaṃ dī. ni. 2.168 ca saṃ. ni. 5.822 ca na dissati]"
      },
      " bahussutā dhammadharā dhammānudhammappaṭipannā sāmīcippaṭipannā anudhammacārino, sakaṃ ācariyakaṃ uggahetvā ācikkhissanti desessanti paññapessanti paṭṭhapessanti vivarissanti vibhajissanti uttānīkarissanti uppannaṃ parappavādaṃ sahadhammena suniggahitaṃ niggahetvā sappāṭihāriyaṃ dhammaṃ desessantī’ti. Etarahi, bhante, bhikkhū bhagavato sāvakā viyattā vinītā visāradā pattayogakkhemā bahussutā dhammadharā dhammānudhammappaṭipannā sāmīcippaṭipannā anudhammacārino, sakaṃ ācariyakaṃ uggahetvā ācikkhanti desenti paññapenti paṭṭhapenti vivaranti vibhajanti uttānīkaronti uppannaṃ parappavādaṃ sahadhammena suniggahitaṃ niggahetvā sappāṭihāriyaṃ dhammaṃ desenti."
    ],
    "innerText": "‘‘Parinibbātu dāni, bhante, bhagavā, parinibbātu sugato. Parinibbānakālo dāni, bhante , bhagavato. Bhāsitā kho panesā, bhante, bhagavatā vācā – ‘na tāvāhaṃ, pāpima, parinibbāyissāmi yāva me bhikkhū na sāvakā bhavissanti viyattā vinītā visāradā pattayogakkhemā [idaṃ padaṃ dī. ni. 2.168 ca saṃ. ni. 5.822 ca na dissati] bahussutā dhammadharā dhammānudhammappaṭipannā sāmīcippaṭipannā anudhammacārino, sakaṃ ācariyakaṃ uggahetvā ācikkhissanti desessanti paññapessanti paṭṭhapessanti vivarissanti vibhajissanti uttānīkarissanti uppannaṃ parappavādaṃ sahadhammena suniggahitaṃ niggahetvā sappāṭihāriyaṃ dhammaṃ desessantī’ti. Etarahi, bhante, bhikkhū bhagavato sāvakā viyattā vinītā visāradā pattayogakkhemā bahussutā dhammadharā dhammānudhammappaṭipannā sāmīcippaṭipannā anudhammacārino, sakaṃ ācariyakaṃ uggahetvā ācikkhanti desenti paññapenti paṭṭhapenti vivaranti vibhajanti uttānīkaronti uppannaṃ parappavādaṃ sahadhammena suniggahitaṃ niggahetvā sappāṭihāriyaṃ dhammaṃ desenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Parinibbātu dāni, bhante, bhagavā, parinibbātu sugato. Parinibbānakālo dāni, bhante, bhagavato. Bhāsitā kho panesā, bhante, bhagavatā vācā – ‘na tāvāhaṃ, pāpima, parinibbāyissāmi yāva me bhikkhuniyo na sāvikā bhavissanti…pe… yāva me upāsakā na sāvakā ",
      " bhavissanti…pe… yāva me upāsikā na sāvikā bhavissanti viyattā vinītā visāradā pattayogakkhemā bahussutā dhammadharā dhammānudhammappaṭipannā sāmīcippaṭipannā anudhammacāriniyo, sakaṃ ācariyakaṃ uggahetvā ",
      " ācikkhissanti desessanti paññapessanti paṭṭhapessanti vivarissanti vibhajissanti uttānīkarissanti, uppannaṃ parappavādaṃ sahadhammena suniggahitaṃ niggahetvā sappāṭihāriyaṃ dhammaṃ desessantī’ti. Etarahi, bhante, upāsikā bhagavato sāvikā viyattā vinītā visāradā pattayogakkhemā bahussutā ",
      " dhammadharā dhammānudhammappaṭipannā sāmīcippaṭipannā anudhammacāriniyo, sakaṃ ācariyakaṃ uggahetvā ācikkhanti desenti paññapenti paṭṭhapenti vivaranti vibhajanti uttānīkaronti, uppannaṃ parappavādaṃ sahadhammena suniggahitaṃ niggahetvā sappāṭihāriyaṃ dhammaṃ desenti."
    ],
    "innerText": "‘‘Parinibbātu dāni, bhante, bhagavā, parinibbātu sugato. Parinibbānakālo dāni, bhante, bhagavato. Bhāsitā kho panesā, bhante, bhagavatā vācā – ‘na tāvāhaṃ, pāpima, parinibbāyissāmi yāva me bhikkhuniyo na sāvikā bhavissanti…pe… yāva me upāsakā na sāvakā bhavissanti…pe… yāva me upāsikā na sāvikā bhavissanti viyattā vinītā visāradā pattayogakkhemā bahussutā dhammadharā dhammānudhammappaṭipannā sāmīcippaṭipannā anudhammacāriniyo, sakaṃ ācariyakaṃ uggahetvā ācikkhissanti desessanti paññapessanti paṭṭhapessanti vivarissanti vibhajissanti uttānīkarissanti, uppannaṃ parappavādaṃ sahadhammena suniggahitaṃ niggahetvā sappāṭihāriyaṃ dhammaṃ desessantī’ti. Etarahi, bhante, upāsikā bhagavato sāvikā viyattā vinītā visāradā pattayogakkhemā bahussutā dhammadharā dhammānudhammappaṭipannā sāmīcippaṭipannā anudhammacāriniyo, sakaṃ ācariyakaṃ uggahetvā ācikkhanti desenti paññapenti paṭṭhapenti vivaranti vibhajanti uttānīkaronti, uppannaṃ parappavādaṃ sahadhammena suniggahitaṃ niggahetvā sappāṭihāriyaṃ dhammaṃ desenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Parinibbātu dāni, bhante, bhagavā, parinibbātu sugato. Parinibbānakālo dāni, bhante, bhagavato. Bhāsitā kho panesā, bhante, bhagavatā vācā – ‘na tāvāhaṃ, pāpima, parinibbāyissāmi yāva me idaṃ brahmacariyaṃ na iddhañceva bhavissati phītañca vitthārikaṃ bāhujaññaṃ ",
      " puthubhūtaṃ, yāva devamanussehi suppakāsita’nti. Etarahi, bhante, bhagavato brahmacariyaṃ iddhañceva phītañca vitthārikaṃ bāhujaññaṃ puthubhūtaṃ, yāva devamanussehi suppakāsitaṃ."
    ],
    "innerText": "‘‘Parinibbātu dāni, bhante, bhagavā, parinibbātu sugato. Parinibbānakālo dāni, bhante, bhagavato. Bhāsitā kho panesā, bhante, bhagavatā vācā – ‘na tāvāhaṃ, pāpima, parinibbāyissāmi yāva me idaṃ brahmacariyaṃ na iddhañceva bhavissati phītañca vitthārikaṃ bāhujaññaṃ puthubhūtaṃ, yāva devamanussehi suppakāsita’nti. Etarahi, bhante, bhagavato brahmacariyaṃ iddhañceva phītañca vitthārikaṃ bāhujaññaṃ puthubhūtaṃ, yāva devamanussehi suppakāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Parinibbātu dāni, bhante, bhagavā, parinibbātu sugato. Parinibbānakālo dāni, bhante, bhagavato’’ti. ‘‘Appossukko tvaṃ, pāpima, hohi. Naciraṃ tathāgatassa parinibbānaṃ bhavissati. Ito tiṇṇaṃ māsānaṃ accayena tathāgato parinibbāyissatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho bhagavā cāpāle cetiye sato sampajāno āyusaṅkhāraṃ ossaji. Ossaṭṭhe ca bhagavatā āyusaṅkhāre ",
      " mahābhūmicālo ahosi bhiṃsanako salomahaṃso, devadundubhiyo ca phaliṃsu. Atha kho bhagavā etamatthaṃ viditvā tāyaṃ velāyaṃ imaṃ udānaṃ udānesi –"
    ],
    "innerText": "Atha kho bhagavā cāpāle cetiye sato sampajāno āyusaṅkhāraṃ ossaji. Ossaṭṭhe ca bhagavatā āyusaṅkhāre mahābhūmicālo ahosi bhiṃsanako salomahaṃso, devadundubhiyo ca phaliṃsu. Atha kho bhagavā etamatthaṃ viditvā tāyaṃ velāyaṃ imaṃ udānaṃ udānesi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Tulamatulañca ",
      " sambhavaṃ, bhavasaṅkhāramavassaji muni;"
    ],
    "innerText": "‘‘Tulamatulañca sambhavaṃ, bhavasaṅkhāramavassaji muni;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ajjhattarato samāhito, abhindi kavacamivattasambhava’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha kho āyasmato ānandassa etadahosi – ‘‘mahā vatāyaṃ bhūmicālo; sumahā vatāyaṃ bhūmicālo bhiṃsanako salomahaṃso, devadundubhiyo ca phaliṃsu. Ko nu kho hetu, ko paccayo mahato bhūmicālassa pātubhāvāyā’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘mahā vatāyaṃ, bhante, bhūmicālo ",
      "; sumahā vatāyaṃ, bhante, bhūmicālo bhiṃsanako salomahaṃso, devadundubhiyo ca phaliṃsu. Ko nu kho, bhante, hetu, ko paccayo mahato bhūmicālassa pātubhāvāyā’’ti?"
    ],
    "innerText": "Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘mahā vatāyaṃ, bhante, bhūmicālo ; sumahā vatāyaṃ, bhante, bhūmicālo bhiṃsanako salomahaṃso, devadundubhiyo ca phaliṃsu. Ko nu kho, bhante, hetu, ko paccayo mahato bhūmicālassa pātubhāvāyā’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aṭṭhime, ānanda, hetū, aṭṭha paccayā mahato bhūmicālassa pātubhāvāya. Katame aṭṭha? Ayaṃ, ānanda, mahāpathavī udake patiṭṭhitā; udakaṃ vāte patiṭṭhitaṃ; vāto ākāsaṭṭho hoti. So, ānanda, samayo yaṃ mahāvātā vāyanti; mahāvātā vāyantā udakaṃ kampenti; udakaṃ ",
      " kampitaṃ pathaviṃ kampeti. Ayaṃ, ānanda, paṭhamo hetu, paṭhamo paccayo mahato bhūmicālassa pātubhāvāya."
    ],
    "innerText": "‘‘Aṭṭhime, ānanda, hetū, aṭṭha paccayā mahato bhūmicālassa pātubhāvāya. Katame aṭṭha? Ayaṃ, ānanda, mahāpathavī udake patiṭṭhitā; udakaṃ vāte patiṭṭhitaṃ; vāto ākāsaṭṭho hoti. So, ānanda, samayo yaṃ mahāvātā vāyanti; mahāvātā vāyantā udakaṃ kampenti; udakaṃ kampitaṃ pathaviṃ kampeti. Ayaṃ, ānanda, paṭhamo hetu, paṭhamo paccayo mahato bhūmicālassa pātubhāvāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, ānanda, samaṇo vā brāhmaṇo ",
      " vā iddhimā cetovasippatto devatā vā mahiddhikā mahānubhāvā. Tassa parittā pathavīsaññā bhāvitā hoti, appamāṇā āposaññā. So imaṃ pathaviṃ kampeti saṅkampeti sampakampeti sampavedheti. Ayaṃ, ānanda, dutiyo hetu, dutiyo paccayo mahato bhūmicālassa pātubhāvāya."
    ],
    "innerText": "‘‘Puna caparaṃ, ānanda, samaṇo vā brāhmaṇo vā iddhimā cetovasippatto devatā vā mahiddhikā mahānubhāvā. Tassa parittā pathavīsaññā bhāvitā hoti, appamāṇā āposaññā. So imaṃ pathaviṃ kampeti saṅkampeti sampakampeti sampavedheti. Ayaṃ, ānanda, dutiyo hetu, dutiyo paccayo mahato bhūmicālassa pātubhāvāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, ānanda, yadā bodhisatto tusitā kāyā cavitvā sato sampajāno mātukucchiṃ okkamati, tadāyaṃ pathavī ",
      " kampati saṅkampati sampakampati sampavedhati. Ayaṃ, ānanda, tatiyo hetu; tatiyo paccayo mahato bhūmicālassa pātubhāvāya."
    ],
    "innerText": "‘‘Puna caparaṃ, ānanda, yadā bodhisatto tusitā kāyā cavitvā sato sampajāno mātukucchiṃ okkamati, tadāyaṃ pathavī kampati saṅkampati sampakampati sampavedhati. Ayaṃ, ānanda, tatiyo hetu; tatiyo paccayo mahato bhūmicālassa pātubhāvāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, ānanda, yadā bodhisatto sato sampajāno mātukucchismā nikkhamati, tadāyaṃ pathavī kampati saṅkampati sampakampati sampavedhati. Ayaṃ, ānanda, catuttho hetu, catuttho paccayo mahato bhūmicālassa pātubhāvāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, ānanda, yadā tathāgato anuttaraṃ sammāsambodhiṃ abhisambujjhati, tadāyaṃ pathavī kampati saṅkampati sampakampati sampavedhati. Ayaṃ, ānanda, pañcamo hetu, pañcamo paccayo mahato bhūmicālassa pātubhāvāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, ānanda, yadā tathāgato anuttaraṃ dhammacakkaṃ pavatteti, tadāyaṃ pathavī kampati saṅkampati sampakampati sampavedhati. Ayaṃ, ānanda, chaṭṭho hetu, chaṭṭho paccayo mahato bhūmicālassa pātubhāvāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna ",
      " caparaṃ, ānanda, yadā tathāgato sato sampajāno āyusaṅkhāraṃ ossajjati, tadāyaṃ pathavī kampati saṅkampati sampakampati sampavedhati. Ayaṃ, ānanda, sattamo hetu, sattamo paccayo mahato bhūmicālassa pātubhāvāya."
    ],
    "innerText": "‘‘Puna caparaṃ, ānanda, yadā tathāgato sato sampajāno āyusaṅkhāraṃ ossajjati, tadāyaṃ pathavī kampati saṅkampati sampakampati sampavedhati. Ayaṃ, ānanda, sattamo hetu, sattamo paccayo mahato bhūmicālassa pātubhāvāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna ",
      " caparaṃ, ānanda, yadā tathāgato anupādisesāya nibbānadhātuyā ",
      " parinibbāyati, tadāyaṃ pathavī kampati saṅkampati sampakampati sampavedhati. Ayaṃ, ānanda, aṭṭhamo hetu, aṭṭhamo paccayo mahato bhūmicālassa pātubhāvāya. Ime kho, ānanda, aṭṭha hetū, aṭṭha paccayā mahato bhūmicālassa pātubhāvāyā’’ti. Dasamaṃ."
    ],
    "innerText": "‘‘Puna caparaṃ, ānanda, yadā tathāgato anupādisesāya nibbānadhātuyā parinibbāyati, tadāyaṃ pathavī kampati saṅkampati sampakampati sampavedhati. Ayaṃ, ānanda, aṭṭhamo hetu, aṭṭhamo paccayo mahato bhūmicālassa pātubhāvāya. Ime kho, ānanda, aṭṭha hetū, aṭṭha paccayā mahato bhūmicālassa pātubhāvāyā’’ti. Dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Bhūmicālavaggo dutiyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Icchā ",
      " alañca saṃkhittaṃ, gayā abhibhunā saha;"
    ],
    "innerText": "Icchā alañca saṃkhittaṃ, gayā abhibhunā saha;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vimokkho dve ca vohārā, parisā bhūmicālenāti."
  }
]