[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "8. Vinayavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1-8. Paṭhamavinayadharasuttādivaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "75-82"
      },
      ". Aṭṭhamassa ",
      " paṭhamaṃ dutiyañca uttānatthameva. Tatiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vinayalakkhaṇe patiṭṭhito"
      },
      " lajjibhāvena vinayalakkhaṇe ṭhito hoti. Alajjī (pārā. aṭṭha. 1.45) hi bahussutopi samāno lābhagarukatāya tantiṃ visaṃvādetvā uddhammaṃ ubbinayaṃ satthusāsanaṃ dīpetvā sāsane mahantaṃ upaddavaṃ karoti, saṅghabhedampi saṅgharājimpi uppādeti. Lajjī pana kukkuccako sikkhākāmo jīvitahetupi tantiṃ avisaṃvādetvā dhammameva vinayameva ca dīpeti, satthusāsanaṃ garuṃ katvā ṭhapeti. Evaṃ yo lajjī, so vinayaṃ ajahanto avokkamantova lajjibhāvena vinayalakkhaṇe ṭhito hoti patiṭṭhito."
    ],
    "innerText": "75-82. Aṭṭhamassa paṭhamaṃ dutiyañca uttānatthameva. Tatiye vinayalakkhaṇe patiṭṭhito lajjibhāvena vinayalakkhaṇe ṭhito hoti. Alajjī (pārā. aṭṭha. 1.45) hi bahussutopi samāno lābhagarukatāya tantiṃ visaṃvādetvā uddhammaṃ ubbinayaṃ satthusāsanaṃ dīpetvā sāsane mahantaṃ upaddavaṃ karoti, saṅghabhedampi saṅgharājimpi uppādeti. Lajjī pana kukkuccako sikkhākāmo jīvitahetupi tantiṃ avisaṃvādetvā dhammameva vinayameva ca dīpeti, satthusāsanaṃ garuṃ katvā ṭhapeti. Evaṃ yo lajjī, so vinayaṃ ajahanto avokkamantova lajjibhāvena vinayalakkhaṇe ṭhito hoti patiṭṭhito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asaṃhīro"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṃhīro"
      },
      " nāma yo pāḷiyaṃ vā aṭṭhakathāyaṃ vā heṭṭhā vā uparito vā padapaṭipāṭiyā vā pucchiyamāno vitthunati vipphandati, saṇṭhātuṃ na sakkoti, yaṃ yaṃ parena vuccati, taṃ taṃ anujānāti, sakavādaṃ chaḍḍetvā paravādaṃ gaṇhāti. Yo pana pāḷiyaṃ vā aṭṭhakathāyaṃ vā heṭṭhupariyavasena vā padapaṭipāṭiyā vā pucchiyamāno na vitthunati na vipphandati, ekekalomaṃ saṇḍāsena gaṇhanto viya ‘‘evaṃ mayaṃ vadāma, evaṃ no ācariyā vadantī’’ti vissajjeti. Yamhi pāḷi ca pāḷivinicchayo ca suvaṇṇabhājane pakkhittasīhavasā viya parikkhayaṃ pariyādānaṃ agacchanto tiṭṭhati, ayaṃ vuccati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asaṃhīro"
      },
      ". Yasmā pana evarūpo yaṃ yaṃ parena vuccati, taṃ taṃ nānujānāti, attanā suvinicchinitaṃ katvā gahitaṃ aviparītamatthaṃ na ",
      " vissajjeti, tasmā vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘na sakkoti gahitaggahaṇaṃ vissajjāpetu’’"
      },
      "nti. Catutthādīni suviññeyyāni."
    ],
    "innerText": "Asaṃhīroti ettha saṃhīro nāma yo pāḷiyaṃ vā aṭṭhakathāyaṃ vā heṭṭhā vā uparito vā padapaṭipāṭiyā vā pucchiyamāno vitthunati vipphandati, saṇṭhātuṃ na sakkoti, yaṃ yaṃ parena vuccati, taṃ taṃ anujānāti, sakavādaṃ chaḍḍetvā paravādaṃ gaṇhāti. Yo pana pāḷiyaṃ vā aṭṭhakathāyaṃ vā heṭṭhupariyavasena vā padapaṭipāṭiyā vā pucchiyamāno na vitthunati na vipphandati, ekekalomaṃ saṇḍāsena gaṇhanto viya ‘‘evaṃ mayaṃ vadāma, evaṃ no ācariyā vadantī’’ti vissajjeti. Yamhi pāḷi ca pāḷivinicchayo ca suvaṇṇabhājane pakkhittasīhavasā viya parikkhayaṃ pariyādānaṃ agacchanto tiṭṭhati, ayaṃ vuccati asaṃhīro. Yasmā pana evarūpo yaṃ yaṃ parena vuccati, taṃ taṃ nānujānāti, attanā suvinicchinitaṃ katvā gahitaṃ aviparītamatthaṃ na vissajjeti, tasmā vuttaṃ ‘‘na sakkoti gahitaggahaṇaṃ vissajjāpetu’’nti. Catutthādīni suviññeyyāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṭhamavinayadharasuttādivaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Satthusāsanasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "83"
      },
      ". Navame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vivekaṭṭho"
      },
      "ti vivitto. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘dūrībhūto’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Satiavippavāse ṭhito"
      },
      "ti kammaṭṭhāne ",
      " satiṃ avijahitvā ṭhito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pesitatto"
      },
      "ti kāye ca jīvite ca anapekkhatāya nibbānaṃ pesitacitto tanninno tappoṇo tappabbhāro."
    ],
    "innerText": "83. Navame vivekaṭṭhoti vivitto. Tenāha ‘‘dūrībhūto’’ti. Satiavippavāse ṭhitoti kammaṭṭhāne satiṃ avijahitvā ṭhito. Pesitattoti kāye ca jīvite ca anapekkhatāya nibbānaṃ pesitacitto tanninno tappoṇo tappabbhāro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Satthusāsanasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Adhikaraṇasamathasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "84"
      },
      ". Dasame adhikarīyanti etthāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "adhikaraṇāni"
      },
      ". Ke adhikarīyanti? Samathā. Kathaṃ adhikarīyanti? Samanavasena. Tasmā te tesaṃ samanavasena pavattantīti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘adhikaraṇāni samentī’’"
      },
      "tiādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uppannānaṃ uppanāna"
      },
      "nti uṭṭhitānaṃ uṭṭhitānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samathattha"
      },
      "nti samanatthaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dīghanikāye saṅgītisuttavaṇṇanāyampi"
      },
      " (dī. ni. aṭṭha. 3.331) ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vitthāratoyevā"
      },
      "ti etthāyaṃ vitthāranayo – adhikaraṇesu tāva dhammoti vā adhammoti vā aṭṭhārasahi vatthūhi vivadantānaṃ bhikkhūnaṃ yo vivādo, idaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vivādādhikaraṇaṃ"
      },
      " nāma. Sīlavipattiyā vā ācāradiṭṭhiājīvavipattiyā vā anuvadantānaṃ yo anuvādo upavadanā ceva codanā ca, idaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anuvādādhikaraṇaṃ"
      },
      " nāma. Mātikāyaṃ āgatā pañca, vibhaṅge dveti sattapi āpattikkhandhā, idaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āpattādhikaraṇaṃ"
      },
      " nāma. Yaṃ saṅghassa apalokanādīnaṃ catunnaṃ kammānaṃ karaṇaṃ, idaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kiccādhikaraṇaṃ"
      },
      " nāma."
    ],
    "innerText": "84. Dasame adhikarīyanti etthāti adhikaraṇāni. Ke adhikarīyanti? Samathā. Kathaṃ adhikarīyanti? Samanavasena. Tasmā te tesaṃ samanavasena pavattantīti āha ‘‘adhikaraṇāni samentī’’tiādi. Uppannānaṃ uppanānanti uṭṭhitānaṃ uṭṭhitānaṃ. Samathatthanti samanatthaṃ. Dīghanikāye saṅgītisuttavaṇṇanāyampi (dī. ni. aṭṭha. 3.331) vitthāratoyevāti etthāyaṃ vitthāranayo – adhikaraṇesu tāva dhammoti vā adhammoti vā aṭṭhārasahi vatthūhi vivadantānaṃ bhikkhūnaṃ yo vivādo, idaṃ vivādādhikaraṇaṃ nāma. Sīlavipattiyā vā ācāradiṭṭhiājīvavipattiyā vā anuvadantānaṃ yo anuvādo upavadanā ceva codanā ca, idaṃ anuvādādhikaraṇaṃ nāma. Mātikāyaṃ āgatā pañca, vibhaṅge dveti sattapi āpattikkhandhā, idaṃ āpattādhikaraṇaṃ nāma. Yaṃ saṅghassa apalokanādīnaṃ catunnaṃ kammānaṃ karaṇaṃ, idaṃ kiccādhikaraṇaṃ nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha vivādādhikaraṇaṃ dvīhi samathehi sammati sammukhāvinayena ca yebhuyyasikāya ca. Sammukhāvinayeneva sammamānaṃ yasmiṃ vihāre uppannaṃ tasmiṃyeva ",
      " vā, aññatra vūpasametuṃ gacchantānaṃ antarāmagge vā, yattha gantvā saṅghassa niyyātitaṃ, tattha saṅghena vā, saṅghe vūpasametuṃ asakkonte tattheva ubbāhikāya sammatapuggalehi vā vinicchitaṃ sammati. Evaṃ sammamāne ca panetasmiṃ yā saṅghasammukhato dhammasammukhato vinayasammukhatā puggalasammukhatā, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammukhāvinayo"
      },
      " nāma. Tattha ca kārakasaṅghassa saṅghasāmaggivasena sammukhibhāvo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṅghasammukhatā"
      },
      ". Sametabbassa vatthuno bhūtattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammasammukhatā"
      },
      ". Yathā taṃ sametabbaṃ, tathevassa samanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vinayasammukhatā"
      },
      ". Yo ca vivadati, yena ca vivadati, tesaṃ ubhinnaṃ atthapaccatthikānaṃ sammukhībhāvo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "puggalasammukhatā"
      },
      ". Ubbāhikāya vūpasame panettha saṅghasammukhatā parihāyati. Evaṃ tāva sammukhāvinayeneva sammati."
    ],
    "innerText": "Tattha vivādādhikaraṇaṃ dvīhi samathehi sammati sammukhāvinayena ca yebhuyyasikāya ca. Sammukhāvinayeneva sammamānaṃ yasmiṃ vihāre uppannaṃ tasmiṃyeva vā, aññatra vūpasametuṃ gacchantānaṃ antarāmagge vā, yattha gantvā saṅghassa niyyātitaṃ, tattha saṅghena vā, saṅghe vūpasametuṃ asakkonte tattheva ubbāhikāya sammatapuggalehi vā vinicchitaṃ sammati. Evaṃ sammamāne ca panetasmiṃ yā saṅghasammukhato dhammasammukhato vinayasammukhatā puggalasammukhatā, ayaṃ sammukhāvinayo nāma. Tattha ca kārakasaṅghassa saṅghasāmaggivasena sammukhibhāvo saṅghasammukhatā. Sametabbassa vatthuno bhūtattā dhammasammukhatā. Yathā taṃ sametabbaṃ, tathevassa samanaṃ vinayasammukhatā. Yo ca vivadati, yena ca vivadati, tesaṃ ubhinnaṃ atthapaccatthikānaṃ sammukhībhāvo puggalasammukhatā. Ubbāhikāya vūpasame panettha saṅghasammukhatā parihāyati. Evaṃ tāva sammukhāvinayeneva sammati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sace panevampi na sammati, atha naṃ ubbāhikāya sammatā bhikkhū ‘‘na mayaṃ sakkoma vūpasametu’’nti ",
      " saṅghasseva niyyātenti. Tato saṅgho pañcaṅgasamannāgataṃ bhikkhuṃ salākaggāhāpakaṃ sammannati, tena guḷhakavivaṭakasakaṇṇajappakesu tīsu salākaggāhakesu aññataravasena salākaṃ gāhāpetvā sannipatitāya parisāya dhammavādīnaṃ yebhuyyatāya yathā te dhammavādino vadanti, evaṃ vūpasantaṃ adhikaraṇaṃ sammukhāvinayena ca yebhuyyasikāya ca vūpasantaṃ hoti. Tattha sammukhāvinayo vuttanayo eva. Yaṃ pana yebhuyyasikākammassa karaṇaṃ, ayaṃ yebhuyyasikā nāma. Evaṃ vivādādhikaraṇaṃ dvīhi samathehi sammati."
    ],
    "innerText": "Sace panevampi na sammati, atha naṃ ubbāhikāya sammatā bhikkhū ‘‘na mayaṃ sakkoma vūpasametu’’nti saṅghasseva niyyātenti. Tato saṅgho pañcaṅgasamannāgataṃ bhikkhuṃ salākaggāhāpakaṃ sammannati, tena guḷhakavivaṭakasakaṇṇajappakesu tīsu salākaggāhakesu aññataravasena salākaṃ gāhāpetvā sannipatitāya parisāya dhammavādīnaṃ yebhuyyatāya yathā te dhammavādino vadanti, evaṃ vūpasantaṃ adhikaraṇaṃ sammukhāvinayena ca yebhuyyasikāya ca vūpasantaṃ hoti. Tattha sammukhāvinayo vuttanayo eva. Yaṃ pana yebhuyyasikākammassa karaṇaṃ, ayaṃ yebhuyyasikā nāma. Evaṃ vivādādhikaraṇaṃ dvīhi samathehi sammati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Anuvādādhikaraṇaṃ catūhi samathehi sammati sammukhāvinayena ca sativinayena ca amūḷhavinayena ca tassapāpiyasikāya ca. Sammukhāvinayeneva sammamānaṃ yo ca anuvadati, yañca anuvadati, tesaṃ vacanaṃ sutvā sace kāci āpatti natthi, ubho khamāpetvā, sace atthi ayaṃ nāmettha āpattīti evaṃ vinicchitaṃ vūpasammati. Tattha sammukhāvinayalakkhaṇaṃ vuttanayameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yadā pana khīṇāsavassa bhikkhuno amūlikāya sīlavipattiyā anuddhaṃsitassa sativinayaṃ yācamānassa saṅgho ñatticatutthena kammena sativinayaṃ deti, tadā sammukhāvinayena ca sativinayena ca vūpasantaṃ hoti. Dinne pana sativinaye puna tasmiṃ puggale kassaci anuvādo na ruhati. Yadā ummattako bhikkhu ummādavasena kate assāmaṇake ajjhācāre ‘‘saratāyasmā evarūpiṃ āpatti’’nti bhikkhūhi codiyamāno ‘‘ummattakena ",
      " me, āvuso, etaṃ kataṃ, nāhaṃ taṃ sarāmī’’ti bhaṇantopi bhikkhūhi codiyamānova puna acodanatthāya amūḷhavinayaṃ yācati, saṅgho cassa ñatticatutthena kammena amūḷhavinayaṃ deti. Tadā sammukhāvinayena ca amūḷhavinayena ca vūpasantaṃ hoti. Dinne pana amūḷhavinaye puna tasmiṃ puggale kassaci tappaccayā anuvādo na ruhati. Yadā pana pārājikena vā pārājikasāmantena vā codiyamānassa aññenaññaṃ paṭicarato pāpussannatāya pāpiyassa puggalassa ‘‘sacāyaṃ acchinnamūlo bhavissati, sammā vattitvā osāraṇaṃ labhissati. Sace chinnamūlo, ayamevassa nāsanā bhavissatī’’ti maññamāno saṅgho ñatticatutthena kammena tassapāpiyasikaṃ karoti, tadā sammukhāvinayena ca tassapāpiyasikāya ca vūpasantaṃ hotīti. Evaṃ anuvādādhikaraṇaṃ catūhi samathehi sammati."
    ],
    "innerText": "Yadā pana khīṇāsavassa bhikkhuno amūlikāya sīlavipattiyā anuddhaṃsitassa sativinayaṃ yācamānassa saṅgho ñatticatutthena kammena sativinayaṃ deti, tadā sammukhāvinayena ca sativinayena ca vūpasantaṃ hoti. Dinne pana sativinaye puna tasmiṃ puggale kassaci anuvādo na ruhati. Yadā ummattako bhikkhu ummādavasena kate assāmaṇake ajjhācāre ‘‘saratāyasmā evarūpiṃ āpatti’’nti bhikkhūhi codiyamāno ‘‘ummattakena me, āvuso, etaṃ kataṃ, nāhaṃ taṃ sarāmī’’ti bhaṇantopi bhikkhūhi codiyamānova puna acodanatthāya amūḷhavinayaṃ yācati, saṅgho cassa ñatticatutthena kammena amūḷhavinayaṃ deti. Tadā sammukhāvinayena ca amūḷhavinayena ca vūpasantaṃ hoti. Dinne pana amūḷhavinaye puna tasmiṃ puggale kassaci tappaccayā anuvādo na ruhati. Yadā pana pārājikena vā pārājikasāmantena vā codiyamānassa aññenaññaṃ paṭicarato pāpussannatāya pāpiyassa puggalassa ‘‘sacāyaṃ acchinnamūlo bhavissati, sammā vattitvā osāraṇaṃ labhissati. Sace chinnamūlo, ayamevassa nāsanā bhavissatī’’ti maññamāno saṅgho ñatticatutthena kammena tassapāpiyasikaṃ karoti, tadā sammukhāvinayena ca tassapāpiyasikāya ca vūpasantaṃ hotīti. Evaṃ anuvādādhikaraṇaṃ catūhi samathehi sammati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Āpattādhikaraṇaṃ tīhi samathehi sammati sammukhāvinayena ca paṭiññātakaraṇena ca tiṇavatthārakena ca. Tassa sammukhāvinayeneva vūpasamo natthi. Yadā pana ekassa vā bhikkhuno ",
      " santike saṅghagaṇamajjhesu vā bhikkhu lahukaṃ āpattiṃ deseti, tadā āpattādhikaraṇaṃ sammukhāvinayena ca paṭiññātakaraṇena ca vūpasammati. Tattha sammukhāvinaye tāva yo ca deseti, yassa ca deseti, tesaṃ sammukhībhāvo puggalasammukhato. Sesaṃ vuttanayameva."
    ],
    "innerText": "Āpattādhikaraṇaṃ tīhi samathehi sammati sammukhāvinayena ca paṭiññātakaraṇena ca tiṇavatthārakena ca. Tassa sammukhāvinayeneva vūpasamo natthi. Yadā pana ekassa vā bhikkhuno santike saṅghagaṇamajjhesu vā bhikkhu lahukaṃ āpattiṃ deseti, tadā āpattādhikaraṇaṃ sammukhāvinayena ca paṭiññātakaraṇena ca vūpasammati. Tattha sammukhāvinaye tāva yo ca deseti, yassa ca deseti, tesaṃ sammukhībhāvo puggalasammukhato. Sesaṃ vuttanayameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Puggalassa ca gaṇassa ca desanākāle saṅghasammukhato parihāyati. Yaṃ panettha ‘‘ahaṃ, bhante, itthannāmaṃ āpattiṃ āpanno’’ti ca ‘‘passasī’’ti ca ‘‘āma, passāmī’’ti ca paṭiññātāya ‘‘āyatiṃ saṃvareyyāsī’’ti karaṇaṃ, taṃ paṭiññātakaraṇaṃ nāma. Saṅghādisese parivāsādiyācanā paṭiññā, parivāsādīnaṃ dānaṃ paṭiññātakaraṇaṃ nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dvepakkhajātā pana bhaṇḍanakārakā bhikkhū bahuṃ assāmaṇakaṃ ajjhācāraṃ caritvā puna lajjidhamme uppanne ‘‘sace mayaṃ imāhi āpattīhi aññamaññaṃ kāressāma, siyāpi taṃ adhikaraṇaṃ kakkhaḷattāya vāḷattāya saṃvatteyyā’’ti aññamaññaṃ āpattiyā kārāpane dosaṃ disvā yadā bhikkhū tiṇavatthārakakammaṃ karonti, tadā āpattādhikaraṇaṃ sammukhāvinayena ca tiṇavatthārakena ca sammati. Tatra hi yattakā hatthapāsūpagatā ‘‘na metaṃ khamatī’’ti evaṃ diṭṭhāvikammaṃ akatvā ‘‘dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti ",
      " na ukkoṭenti, niddampi okkantā honti, sabbesaṃ ṭhapetvā thullavajjañca gihipaṭisaṃyuttañca sabbāpattiyo vuṭṭhahanti. Evaṃ āpattādhikaraṇaṃ tīhi samathehi sammati."
    ],
    "innerText": "Dvepakkhajātā pana bhaṇḍanakārakā bhikkhū bahuṃ assāmaṇakaṃ ajjhācāraṃ caritvā puna lajjidhamme uppanne ‘‘sace mayaṃ imāhi āpattīhi aññamaññaṃ kāressāma, siyāpi taṃ adhikaraṇaṃ kakkhaḷattāya vāḷattāya saṃvatteyyā’’ti aññamaññaṃ āpattiyā kārāpane dosaṃ disvā yadā bhikkhū tiṇavatthārakakammaṃ karonti, tadā āpattādhikaraṇaṃ sammukhāvinayena ca tiṇavatthārakena ca sammati. Tatra hi yattakā hatthapāsūpagatā ‘‘na metaṃ khamatī’’ti evaṃ diṭṭhāvikammaṃ akatvā ‘‘dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti na ukkoṭenti, niddampi okkantā honti, sabbesaṃ ṭhapetvā thullavajjañca gihipaṭisaṃyuttañca sabbāpattiyo vuṭṭhahanti. Evaṃ āpattādhikaraṇaṃ tīhi samathehi sammati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kiccādhikaraṇaṃ ekena samathena sammati sammukhāvinayeneva. Iti imāni cattāri adhikaraṇāni yathānurūpaṃ imehi sattahi samathehi sammanti. Tena vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘uppannuppannānaṃ adhikaraṇānaṃ samathāya vūpasamāya sammukhāvinayo dātabbo…pe… tiṇavatthārako’’"
      },
      "ti. Sesaṃ sabbattha uttānameva."
    ],
    "innerText": "Kiccādhikaraṇaṃ ekena samathena sammati sammukhāvinayeneva. Iti imāni cattāri adhikaraṇāni yathānurūpaṃ imehi sattahi samathehi sammanti. Tena vuttaṃ – ‘‘uppannuppannānaṃ adhikaraṇānaṃ samathāya vūpasamāya sammukhāvinayo dātabbo…pe… tiṇavatthārako’’ti. Sesaṃ sabbattha uttānameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Adhikaraṇasamathasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vinayavaggavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti manorathapūraṇiyā aṅguttaranikāya-aṭṭhakathāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sattakanipātavaṇṇanāya anuttānatthadīpanā samattā."
  }
]