[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "9. Sītivaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Sītibhāvasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "85"
      },
      ". ‘‘Chahi ",
      ", bhikkhave, dhammehi samannāgato bhikkhu abhabbo anuttaraṃ sītibhāvaṃ sacchikātuṃ. Katamehi chahi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[visuddhi. 1.64 ādayo vitthāro]"
      },
      "? Idha, bhikkhave, bhikkhu yasmiṃ samaye cittaṃ niggahetabbaṃ tasmiṃ samaye cittaṃ na niggaṇhāti, yasmiṃ samaye cittaṃ paggahetabbaṃ tasmiṃ samaye cittaṃ na paggaṇhāti, yasmiṃ samaye cittaṃ sampahaṃsitabbaṃ tasmiṃ samaye cittaṃ na sampahaṃseti, yasmiṃ samaye cittaṃ ajjhupekkhitabbaṃ tasmiṃ samaye cittaṃ na ajjhupekkhati, hīnādhimuttiko ca hoti, sakkāyābhirato ca. Imehi kho, bhikkhave, chahi dhammehi samannāgato bhikkhu abhabbo anuttaraṃ sītibhāvaṃ sacchikātuṃ."
    ],
    "innerText": "85. ‘‘Chahi , bhikkhave, dhammehi samannāgato bhikkhu abhabbo anuttaraṃ sītibhāvaṃ sacchikātuṃ. Katamehi chahi [visuddhi. 1.64 ādayo vitthāro]? Idha, bhikkhave, bhikkhu yasmiṃ samaye cittaṃ niggahetabbaṃ tasmiṃ samaye cittaṃ na niggaṇhāti, yasmiṃ samaye cittaṃ paggahetabbaṃ tasmiṃ samaye cittaṃ na paggaṇhāti, yasmiṃ samaye cittaṃ sampahaṃsitabbaṃ tasmiṃ samaye cittaṃ na sampahaṃseti, yasmiṃ samaye cittaṃ ajjhupekkhitabbaṃ tasmiṃ samaye cittaṃ na ajjhupekkhati, hīnādhimuttiko ca hoti, sakkāyābhirato ca. Imehi kho, bhikkhave, chahi dhammehi samannāgato bhikkhu abhabbo anuttaraṃ sītibhāvaṃ sacchikātuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Chahi, bhikkhave, dhammehi samannāgato bhikkhu bhabbo anuttaraṃ sītibhāvaṃ sacchikātuṃ. Katamehi chahi? Idha, bhikkhave, bhikkhu yasmiṃ samaye cittaṃ niggahetabbaṃ tasmiṃ samaye cittaṃ niggaṇhāti, yasmiṃ samaye cittaṃ paggahetabbaṃ tasmiṃ samaye cittaṃ paggaṇhāti, yasmiṃ samaye cittaṃ sampahaṃsitabbaṃ ",
      " tasmiṃ samaye cittaṃ sampahaṃseti, yasmiṃ samaye cittaṃ ajjhupekkhitabbaṃ tasmiṃ samaye cittaṃ ajjhupekkhati, paṇītādhimuttiko ca hoti, nibbānābhirato ca. Imehi kho, bhikkhave, chahi dhammehi samannāgato bhikkhu bhabbo anuttaraṃ sītibhāvaṃ sacchikātu’’nti. Paṭhamaṃ."
    ],
    "innerText": "‘‘Chahi, bhikkhave, dhammehi samannāgato bhikkhu bhabbo anuttaraṃ sītibhāvaṃ sacchikātuṃ. Katamehi chahi? Idha, bhikkhave, bhikkhu yasmiṃ samaye cittaṃ niggahetabbaṃ tasmiṃ samaye cittaṃ niggaṇhāti, yasmiṃ samaye cittaṃ paggahetabbaṃ tasmiṃ samaye cittaṃ paggaṇhāti, yasmiṃ samaye cittaṃ sampahaṃsitabbaṃ tasmiṃ samaye cittaṃ sampahaṃseti, yasmiṃ samaye cittaṃ ajjhupekkhitabbaṃ tasmiṃ samaye cittaṃ ajjhupekkhati, paṇītādhimuttiko ca hoti, nibbānābhirato ca. Imehi kho, bhikkhave, chahi dhammehi samannāgato bhikkhu bhabbo anuttaraṃ sītibhāvaṃ sacchikātu’’nti. Paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Āvaraṇasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "86"
      },
      ". ‘‘Chahi, bhikkhave, dhammehi samannāgato suṇantopi saddhammaṃ abhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammattaṃ. Katamehi chahi ",
      "? Kammāvaraṇatāya ",
      " samannāgato hoti, kilesāvaraṇatāya samannāgato hoti, vipākāvaraṇatāya samannāgato hoti, assaddho ca hoti, acchandiko ca, duppañño ca. Imehi kho, bhikkhave, chahi dhammehi samannāgato suṇantopi saddhammaṃ abhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammattaṃ."
    ],
    "innerText": "86. ‘‘Chahi, bhikkhave, dhammehi samannāgato suṇantopi saddhammaṃ abhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammattaṃ. Katamehi chahi ? Kammāvaraṇatāya samannāgato hoti, kilesāvaraṇatāya samannāgato hoti, vipākāvaraṇatāya samannāgato hoti, assaddho ca hoti, acchandiko ca, duppañño ca. Imehi kho, bhikkhave, chahi dhammehi samannāgato suṇantopi saddhammaṃ abhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammattaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Chahi ",
      ", bhikkhave, dhammehi samannāgato suṇanto saddhammaṃ bhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammattaṃ. Katamehi chahi? Na kammāvaraṇatāya samannāgato hoti, na kilesāvaraṇatāya samannāgato hoti, na vipākāvaraṇatāya samannāgato hoti, saddho ca hoti, chandiko ca, paññavā ca. Imehi kho, bhikkhave, chahi dhammehi samannāgato suṇanto saddhammaṃ bhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammatta’’nti. Dutiyaṃ."
    ],
    "innerText": "‘‘Chahi , bhikkhave, dhammehi samannāgato suṇanto saddhammaṃ bhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammattaṃ. Katamehi chahi? Na kammāvaraṇatāya samannāgato hoti, na kilesāvaraṇatāya samannāgato hoti, na vipākāvaraṇatāya samannāgato hoti, saddho ca hoti, chandiko ca, paññavā ca. Imehi kho, bhikkhave, chahi dhammehi samannāgato suṇanto saddhammaṃ bhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammatta’’nti. Dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Voropitasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "87"
      },
      ". ‘‘Chahi, bhikkhave, dhammehi samannāgato suṇantopi saddhammaṃ abhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammattaṃ. Katamehi chahi? Mātā ",
      " jīvitā voropitā hoti, pitā jīvitā voropito hoti, arahaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[arahā (syā. kaṃ.), arahanto (ka.)]"
      },
      " jīvitā voropito hoti, tathāgatassa duṭṭhena cittena lohitaṃ uppāditaṃ hoti, saṅgho bhinno hoti, duppañño hoti jaḷo eḷamūgo. Imehi kho, bhikkhave, chahi dhammehi samannāgato suṇantopi saddhammaṃ abhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammattaṃ."
    ],
    "innerText": "87. ‘‘Chahi, bhikkhave, dhammehi samannāgato suṇantopi saddhammaṃ abhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammattaṃ. Katamehi chahi? Mātā jīvitā voropitā hoti, pitā jīvitā voropito hoti, arahaṃ [arahā (syā. kaṃ.), arahanto (ka.)] jīvitā voropito hoti, tathāgatassa duṭṭhena cittena lohitaṃ uppāditaṃ hoti, saṅgho bhinno hoti, duppañño hoti jaḷo eḷamūgo. Imehi kho, bhikkhave, chahi dhammehi samannāgato suṇantopi saddhammaṃ abhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammattaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Chahi, bhikkhave, dhammehi samannāgato suṇanto saddhammaṃ bhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammattaṃ. Katamehi chahi? Na ",
      " mātā jīvitā voropitā hoti, na pitā jīvitā voropito hoti, na arahaṃ jīvitā voropito hoti, na tathāgatassa duṭṭhena cittena lohitaṃ uppāditaṃ hoti, na saṅgho bhinno hoti, paññavā hoti ajaḷo aneḷamūgo. Imehi kho, bhikkhave, chahi dhammehi samannāgato ",
      " suṇanto saddhammaṃ bhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammatta’’nti. Tatiyaṃ."
    ],
    "innerText": "‘‘Chahi, bhikkhave, dhammehi samannāgato suṇanto saddhammaṃ bhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammattaṃ. Katamehi chahi? Na mātā jīvitā voropitā hoti, na pitā jīvitā voropito hoti, na arahaṃ jīvitā voropito hoti, na tathāgatassa duṭṭhena cittena lohitaṃ uppāditaṃ hoti, na saṅgho bhinno hoti, paññavā hoti ajaḷo aneḷamūgo. Imehi kho, bhikkhave, chahi dhammehi samannāgato suṇanto saddhammaṃ bhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammatta’’nti. Tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Sussūsatisuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "88"
      },
      ". ‘‘Chahi, bhikkhave, dhammehi samannāgato suṇantopi saddhammaṃ abhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammattaṃ. Katamehi chahi? Tathāgatappavedite dhammavinaye desiyamāne na sussūsati, na sotaṃ odahati, na aññā cittaṃ upaṭṭhāpeti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[upaṭṭhapeti (sī. syā. kaṃ. pī.)]"
      },
      ", anatthaṃ gaṇhāti, atthaṃ riñcati, ananulomikāya khantiyā samannāgato hoti. Imehi kho, bhikkhave, chahi dhammehi ",
      " samannāgato suṇantopi saddhammaṃ abhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammattaṃ."
    ],
    "innerText": "88. ‘‘Chahi, bhikkhave, dhammehi samannāgato suṇantopi saddhammaṃ abhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammattaṃ. Katamehi chahi? Tathāgatappavedite dhammavinaye desiyamāne na sussūsati, na sotaṃ odahati, na aññā cittaṃ upaṭṭhāpeti [upaṭṭhapeti (sī. syā. kaṃ. pī.)], anatthaṃ gaṇhāti, atthaṃ riñcati, ananulomikāya khantiyā samannāgato hoti. Imehi kho, bhikkhave, chahi dhammehi samannāgato suṇantopi saddhammaṃ abhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammattaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Chahi ",
      ", bhikkhave, dhammehi samannāgato suṇanto saddhammaṃ bhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammattaṃ. Katamehi chahi? Tathāgatappavedite dhammavinaye desiyamāne sussūsati, sotaṃ odahati, aññā cittaṃ upaṭṭhāpeti, atthaṃ gaṇhāti, anatthaṃ riñcati, anulomikāya khantiyā samannāgato hoti. Imehi kho, bhikkhave, chahi dhammehi samannāgato suṇanto saddhammaṃ bhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammatta’’nti. Catutthaṃ."
    ],
    "innerText": "‘‘Chahi , bhikkhave, dhammehi samannāgato suṇanto saddhammaṃ bhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammattaṃ. Katamehi chahi? Tathāgatappavedite dhammavinaye desiyamāne sussūsati, sotaṃ odahati, aññā cittaṃ upaṭṭhāpeti, atthaṃ gaṇhāti, anatthaṃ riñcati, anulomikāya khantiyā samannāgato hoti. Imehi kho, bhikkhave, chahi dhammehi samannāgato suṇanto saddhammaṃ bhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammatta’’nti. Catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Appahāyasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "89"
      },
      ". ‘‘Cha ",
      ", bhikkhave, dhamme appahāya abhabbo diṭṭhisampadaṃ sacchikātuṃ. Katame cha? Sakkāyadiṭṭhiṃ, vicikicchaṃ, sīlabbataparāmāsaṃ, apāyagamanīyaṃ rāgaṃ, apāyagamanīyaṃ dosaṃ, apāyagamanīyaṃ mohaṃ. Ime kho, bhikkhave, cha dhamme appahāya abhabbo diṭṭhisampadaṃ sacchikātuṃ."
    ],
    "innerText": "89. ‘‘Cha , bhikkhave, dhamme appahāya abhabbo diṭṭhisampadaṃ sacchikātuṃ. Katame cha? Sakkāyadiṭṭhiṃ, vicikicchaṃ, sīlabbataparāmāsaṃ, apāyagamanīyaṃ rāgaṃ, apāyagamanīyaṃ dosaṃ, apāyagamanīyaṃ mohaṃ. Ime kho, bhikkhave, cha dhamme appahāya abhabbo diṭṭhisampadaṃ sacchikātuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Cha, bhikkhave, dhamme pahāya bhabbo diṭṭhisampadaṃ sacchikātuṃ. Katame cha? Sakkāyadiṭṭhiṃ, vicikicchaṃ, sīlabbataparāmāsaṃ, apāyagamanīyaṃ rāgaṃ, apāyagamanīyaṃ dosaṃ, apāyagamanīyaṃ mohaṃ. Ime kho, bhikkhave, cha dhamme pahāya bhabbo diṭṭhisampadaṃ sacchikātu’’nti. Pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Pahīnasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "90"
      },
      ". ‘‘Chayime ",
      ", bhikkhave, dhammā diṭṭhisampannassa puggalassa pahīnā. Katame cha? Sakkāyadiṭṭhi, vicikicchā, sīlabbataparāmāso, apāyagamanīyo rāgo, apāyagamanīyo doso, apāyagamanīyo moho. Ime kho, bhikkhave, cha dhammā diṭṭhisampannassa puggalassa pahīnā’’ti. Chaṭṭhaṃ."
    ],
    "innerText": "90. ‘‘Chayime , bhikkhave, dhammā diṭṭhisampannassa puggalassa pahīnā. Katame cha? Sakkāyadiṭṭhi, vicikicchā, sīlabbataparāmāso, apāyagamanīyo rāgo, apāyagamanīyo doso, apāyagamanīyo moho. Ime kho, bhikkhave, cha dhammā diṭṭhisampannassa puggalassa pahīnā’’ti. Chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Abhabbasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "91"
      },
      ". ‘‘Cha ",
      ", bhikkhave, dhamme abhabbo diṭṭhisampanno puggalo uppādetuṃ ",
      ". Katame cha? Sakkāyadiṭṭhiṃ, vicikicchaṃ, sīlabbataparāmāsaṃ, apāyagamanīyaṃ rāgaṃ, apāyagamanīyaṃ dosaṃ, apāyagamanīyaṃ mohaṃ. Ime kho, bhikkhave, cha dhamme abhabbo diṭṭhisampanno puggalo uppādetu’’nti. Sattamaṃ."
    ],
    "innerText": "91. ‘‘Cha , bhikkhave, dhamme abhabbo diṭṭhisampanno puggalo uppādetuṃ . Katame cha? Sakkāyadiṭṭhiṃ, vicikicchaṃ, sīlabbataparāmāsaṃ, apāyagamanīyaṃ rāgaṃ, apāyagamanīyaṃ dosaṃ, apāyagamanīyaṃ mohaṃ. Ime kho, bhikkhave, cha dhamme abhabbo diṭṭhisampanno puggalo uppādetu’’nti. Sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Paṭhamaabhabbaṭṭhānasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "92"
      },
      ". ‘‘Chayimāni, bhikkhave, abhabbaṭṭhānāni. Katamāni cha? Abhabbo ",
      " diṭṭhisampanno puggalo satthari agāravo viharituṃ appatisso, abhabbo diṭṭhisampanno puggalo dhamme agāravo viharituṃ appatisso, abhabbo diṭṭhisampanno puggalo saṅghe agāravo viharituṃ appatisso, abhabbo diṭṭhisampanno puggalo sikkhāya agāravo viharituṃ appatisso, abhabbo diṭṭhisampanno puggalo anāgamanīyaṃ vatthuṃ paccāgantuṃ, abhabbo diṭṭhisampanno puggalo aṭṭhamaṃ bhavaṃ nibbattetuṃ. Imāni kho, bhikkhave, cha abhabbaṭṭhānānī’’ti. Aṭṭhamaṃ."
    ],
    "innerText": "92. ‘‘Chayimāni, bhikkhave, abhabbaṭṭhānāni. Katamāni cha? Abhabbo diṭṭhisampanno puggalo satthari agāravo viharituṃ appatisso, abhabbo diṭṭhisampanno puggalo dhamme agāravo viharituṃ appatisso, abhabbo diṭṭhisampanno puggalo saṅghe agāravo viharituṃ appatisso, abhabbo diṭṭhisampanno puggalo sikkhāya agāravo viharituṃ appatisso, abhabbo diṭṭhisampanno puggalo anāgamanīyaṃ vatthuṃ paccāgantuṃ, abhabbo diṭṭhisampanno puggalo aṭṭhamaṃ bhavaṃ nibbattetuṃ. Imāni kho, bhikkhave, cha abhabbaṭṭhānānī’’ti. Aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Dutiyaabhabbaṭṭhānasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "93"
      },
      ". ‘‘Chayimāni, bhikkhave, abhabbaṭṭhānāni. Katamāni cha? Abhabbo diṭṭhisampanno puggalo kañci ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kiñci (ka.) vibha. 809; ma. ni. 3.127]"
      },
      " saṅkhāraṃ niccato upagantuṃ, abhabbo diṭṭhisampanno puggalo kañci saṅkhāraṃ sukhato upagantuṃ, abhabbo diṭṭhisampanno puggalo kañci dhammaṃ attato upagantuṃ, abhabbo diṭṭhisampanno puggalo ānantariyaṃ kammaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ānantariyakammaṃ (sī.), anantariyakammaṃ (syā. pī.) a. ni. 4.162 passitabbaṃ]"
      },
      " kātuṃ, abhabbo diṭṭhisampanno puggalo kotūhalamaṅgalena suddhiṃ paccāgantuṃ ",
      ", abhabbo diṭṭhisampanno puggalo ito bahiddhā dakkhiṇeyyaṃ gavesituṃ. Imāni kho, bhikkhave, cha abhabbaṭṭhānānī’’ti. Navamaṃ."
    ],
    "innerText": "93. ‘‘Chayimāni, bhikkhave, abhabbaṭṭhānāni. Katamāni cha? Abhabbo diṭṭhisampanno puggalo kañci [kiñci (ka.) vibha. 809; ma. ni. 3.127] saṅkhāraṃ niccato upagantuṃ, abhabbo diṭṭhisampanno puggalo kañci saṅkhāraṃ sukhato upagantuṃ, abhabbo diṭṭhisampanno puggalo kañci dhammaṃ attato upagantuṃ, abhabbo diṭṭhisampanno puggalo ānantariyaṃ kammaṃ [ānantariyakammaṃ (sī.), anantariyakammaṃ (syā. pī.) a. ni. 4.162 passitabbaṃ] kātuṃ, abhabbo diṭṭhisampanno puggalo kotūhalamaṅgalena suddhiṃ paccāgantuṃ , abhabbo diṭṭhisampanno puggalo ito bahiddhā dakkhiṇeyyaṃ gavesituṃ. Imāni kho, bhikkhave, cha abhabbaṭṭhānānī’’ti. Navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Tatiyaabhabbaṭṭhānasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "94"
      },
      ". ‘‘Chayimāni, bhikkhave, abhabbaṭṭhānāni. Katamāni cha? Abhabbo diṭṭhisampanno ",
      " puggalo ",
      " mātaraṃ jīvitā voropetuṃ, abhabbo diṭṭhisampanno puggalo pitaraṃ jīvitā voropetuṃ, abhabbo diṭṭhisampanno puggalo arahantaṃ jīvitā voropetuṃ, abhabbo diṭṭhisampanno puggalo tathāgatassa duṭṭhena cittena lohitaṃ uppādetuṃ, abhabbo diṭṭhisampanno puggalo saṅghaṃ bhindituṃ, abhabbo diṭṭhisampanno puggalo aññaṃ satthāraṃ uddisituṃ. Imāni kho, bhikkhave, cha abhabbaṭṭhānānī’’ti. Dasamaṃ."
    ],
    "innerText": "94. ‘‘Chayimāni, bhikkhave, abhabbaṭṭhānāni. Katamāni cha? Abhabbo diṭṭhisampanno puggalo mātaraṃ jīvitā voropetuṃ, abhabbo diṭṭhisampanno puggalo pitaraṃ jīvitā voropetuṃ, abhabbo diṭṭhisampanno puggalo arahantaṃ jīvitā voropetuṃ, abhabbo diṭṭhisampanno puggalo tathāgatassa duṭṭhena cittena lohitaṃ uppādetuṃ, abhabbo diṭṭhisampanno puggalo saṅghaṃ bhindituṃ, abhabbo diṭṭhisampanno puggalo aññaṃ satthāraṃ uddisituṃ. Imāni kho, bhikkhave, cha abhabbaṭṭhānānī’’ti. Dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "11. Catutthaabhabbaṭṭhānasuttaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "95"
      },
      ". ‘‘Chayimāni ",
      ", bhikkhave, abhabbaṭṭhānāni. Katamāni cha? Abhabbo diṭṭhisampanno puggalo sayaṃkataṃ sukhadukkhaṃ paccāgantuṃ, abhabbo diṭṭhisampanno puggalo paraṃkataṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[parakataṃ (sī. syā.)]"
      },
      " sukhadukkhaṃ paccāgantuṃ, abhabbo diṭṭhisampanno puggalo sayaṃkatañca paraṃkatañca sukhadukkhaṃ paccāgantuṃ, abhabbo diṭṭhisampanno puggalo asayaṃkāraṃ adhiccasamuppannaṃ sukhadukkhaṃ paccāgantuṃ, abhabbo diṭṭhisampanno puggalo aparaṃkāraṃ adhiccasamuppannaṃ sukhadukkhaṃ paccāgantuṃ, abhabbo diṭṭhisampanno puggalo asayaṃkārañca aparaṃkārañca adhiccasamuppannaṃ sukhadukkhaṃ paccāgantuṃ. Taṃ kissa hetu? Tathā hissa, bhikkhave, diṭṭhisampannassa puggalassa hetu ca sudiṭṭho hetusamuppannā ca dhammā. Imāni kho, bhikkhave, cha abhabbaṭṭhānānī’’ti. Ekādasamaṃ."
    ],
    "innerText": "95. ‘‘Chayimāni , bhikkhave, abhabbaṭṭhānāni. Katamāni cha? Abhabbo diṭṭhisampanno puggalo sayaṃkataṃ sukhadukkhaṃ paccāgantuṃ, abhabbo diṭṭhisampanno puggalo paraṃkataṃ [parakataṃ (sī. syā.)] sukhadukkhaṃ paccāgantuṃ, abhabbo diṭṭhisampanno puggalo sayaṃkatañca paraṃkatañca sukhadukkhaṃ paccāgantuṃ, abhabbo diṭṭhisampanno puggalo asayaṃkāraṃ adhiccasamuppannaṃ sukhadukkhaṃ paccāgantuṃ, abhabbo diṭṭhisampanno puggalo aparaṃkāraṃ adhiccasamuppannaṃ sukhadukkhaṃ paccāgantuṃ, abhabbo diṭṭhisampanno puggalo asayaṃkārañca aparaṃkārañca adhiccasamuppannaṃ sukhadukkhaṃ paccāgantuṃ. Taṃ kissa hetu? Tathā hissa, bhikkhave, diṭṭhisampannassa puggalassa hetu ca sudiṭṭho hetusamuppannā ca dhammā. Imāni kho, bhikkhave, cha abhabbaṭṭhānānī’’ti. Ekādasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "children": [
      "Sītivaggo navamo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[catuttho (syā. ka.)]"
      }
    ],
    "innerText": "Sītivaggo navamo. [catuttho (syā. ka.)]"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sītibhāvaṃ āvaraṇaṃ, voropitā sussūsati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Appahāya pahīnābhabbo, taṭṭhānā caturopi cāti."
  }
]