[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "18. Malavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Goghātakaputtavatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṇḍupalāsova"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dānisī"
      },
      "ti imaṃ dhammadesanaṃ satthā jetavane viharanto ekaṃ goghātakaputtaṃ ārabbha kathesi."
    ],
    "innerText": "Paṇḍupalāsovadānisīti imaṃ dhammadesanaṃ satthā jetavane viharanto ekaṃ goghātakaputtaṃ ārabbha kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sāvatthiyaṃ kireko goghātako gāvo vadhitvā varamaṃsāni gahetvā pacāpetvā puttadārehi saddhiṃ nisīditvā maṃsañca khādati, mūlena ca vikkiṇitvā jīvikaṃ kappesi. So evaṃ pañcapaṇṇāsa vassāni goghātakakammaṃ karonto dhuravihāre viharantassa satthu ekadivasampi kaṭacchumattampi yāguṃ vā bhattaṃ vā na adāsi. So ca vinā maṃsena bhattaṃ na bhuñjati. So ekadivasaṃ divasabhāge maṃsaṃ vikkiṇitvā attano atthāya pacituṃ ekaṃ maṃsakhaṇḍaṃ bhariyāya datvā nhāyituṃ agamāsi. Athassa sahāyako gehaṃ gantvā bhariyaṃ āha – ‘‘thokaṃ me vikkiṇiyamaṃsaṃ dehi, gehaṃ ",
      " me pāhunako āgato’’ti. Natthi vikkiṇiyamaṃsaṃ, sahāyako te maṃsaṃ vikkiṇitvā idāni nhāyituṃ gatoti. Mā evaṃ kari, sace maṃsakhaṇḍaṃ atthi, dehīti. Sahāyakassa te nikkhittamaṃsaṃ ṭhapetvā aññaṃ natthīti. So ‘‘sahāyakassa me atthāya ṭhapitamaṃsato aññaṃ maṃsaṃ natthi, so ca vinā maṃsena na bhuñjati, nāyaṃ dassatī’’ti sāmaṃyeva taṃ maṃsaṃ gahetvā pakkāmi."
    ],
    "innerText": "Sāvatthiyaṃ kireko goghātako gāvo vadhitvā varamaṃsāni gahetvā pacāpetvā puttadārehi saddhiṃ nisīditvā maṃsañca khādati, mūlena ca vikkiṇitvā jīvikaṃ kappesi. So evaṃ pañcapaṇṇāsa vassāni goghātakakammaṃ karonto dhuravihāre viharantassa satthu ekadivasampi kaṭacchumattampi yāguṃ vā bhattaṃ vā na adāsi. So ca vinā maṃsena bhattaṃ na bhuñjati. So ekadivasaṃ divasabhāge maṃsaṃ vikkiṇitvā attano atthāya pacituṃ ekaṃ maṃsakhaṇḍaṃ bhariyāya datvā nhāyituṃ agamāsi. Athassa sahāyako gehaṃ gantvā bhariyaṃ āha – ‘‘thokaṃ me vikkiṇiyamaṃsaṃ dehi, gehaṃ me pāhunako āgato’’ti. Natthi vikkiṇiyamaṃsaṃ, sahāyako te maṃsaṃ vikkiṇitvā idāni nhāyituṃ gatoti. Mā evaṃ kari, sace maṃsakhaṇḍaṃ atthi, dehīti. Sahāyakassa te nikkhittamaṃsaṃ ṭhapetvā aññaṃ natthīti. So ‘‘sahāyakassa me atthāya ṭhapitamaṃsato aññaṃ maṃsaṃ natthi, so ca vinā maṃsena na bhuñjati, nāyaṃ dassatī’’ti sāmaṃyeva taṃ maṃsaṃ gahetvā pakkāmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Goghātakopi nhatvā āgato tāya attano pakkapaṇṇena saddhiṃ vaḍḍhetvā bhatte upanīte āha ‘‘kahaṃ maṃsa’’nti? ‘‘Natthi, sāmī’’ti. Nanu ahaṃ paccanatthāya maṃsaṃ datvā gatoti. Tava sahāyako āgantvā ‘‘pāhunako me āgato, vikkiṇiyamaṃsaṃ dehī’’ti vatvā mayā ‘‘sahāyakassa te ṭhapitamaṃsato aññaṃ maṃsaṃ natthi, so ca vinā maṃsena na bhuñjatī’’ti vuttepi balakkārena taṃ maṃsaṃ sāmaṃyeva gahetvā gatoti. Ahaṃ vinā maṃsena bhattaṃ na bhuñjāmi, harāhi nanti. Kiṃ sakkā kātuṃ, bhuñja, sāmīti. So ‘‘nāhaṃ bhuñjāmī’’ti taṃ bhattaṃ harāpetvā satthaṃ ādāya pacchāgehe ṭhito goṇo atthi, tassa santikaṃ gantvā mukhe hatthaṃ pakkhipitvā jivhaṃ nīharitvā satthena mūle ",
      " chinditvā ādāya gantvā aṅgāresu pacāpetvā bhattamatthake ",
      " ṭhapetvā nisinno ekaṃ bhattapiṇḍaṃ bhuñjitvā ekaṃ maṃsakhaṇḍaṃ mukhe ṭhapesi. Taṅkhaṇaññevassa ",
      " jivhā chijjitvā bhattapātiyaṃ pati. Taṅkhaṇaññeva kammasarikkhakaṃ vipākaṃ labhi. Sopi kho goṇo viya lohitadhārāya mukhato paggharantiyā antogehaṃ pavisitvā jaṇṇukehi vicaranto viravi."
    ],
    "innerText": "Goghātakopi nhatvā āgato tāya attano pakkapaṇṇena saddhiṃ vaḍḍhetvā bhatte upanīte āha ‘‘kahaṃ maṃsa’’nti? ‘‘Natthi, sāmī’’ti. Nanu ahaṃ paccanatthāya maṃsaṃ datvā gatoti. Tava sahāyako āgantvā ‘‘pāhunako me āgato, vikkiṇiyamaṃsaṃ dehī’’ti vatvā mayā ‘‘sahāyakassa te ṭhapitamaṃsato aññaṃ maṃsaṃ natthi, so ca vinā maṃsena na bhuñjatī’’ti vuttepi balakkārena taṃ maṃsaṃ sāmaṃyeva gahetvā gatoti. Ahaṃ vinā maṃsena bhattaṃ na bhuñjāmi, harāhi nanti. Kiṃ sakkā kātuṃ, bhuñja, sāmīti. So ‘‘nāhaṃ bhuñjāmī’’ti taṃ bhattaṃ harāpetvā satthaṃ ādāya pacchāgehe ṭhito goṇo atthi, tassa santikaṃ gantvā mukhe hatthaṃ pakkhipitvā jivhaṃ nīharitvā satthena mūle chinditvā ādāya gantvā aṅgāresu pacāpetvā bhattamatthake ṭhapetvā nisinno ekaṃ bhattapiṇḍaṃ bhuñjitvā ekaṃ maṃsakhaṇḍaṃ mukhe ṭhapesi. Taṅkhaṇaññevassa jivhā chijjitvā bhattapātiyaṃ pati. Taṅkhaṇaññeva kammasarikkhakaṃ vipākaṃ labhi. Sopi kho goṇo viya lohitadhārāya mukhato paggharantiyā antogehaṃ pavisitvā jaṇṇukehi vicaranto viravi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tasmiṃ samaye goghātakassa putto pitaraṃ olokento samīpe ṭhito hoti. Atha naṃ mātā āha – ‘‘passa, putta, imaṃ goghātakaṃ goṇaṃ viya gehamajjhe jaṇṇukehi vicaritvā viravantaṃ, idaṃ dukkhaṃ tava matthake patissati, mamampi anoloketvā attano sotthiṃ karonto palāyassū’’ti. So maraṇabhayatajjito mātaraṃ vanditvā palāyi, palāyitvā ca pana takkasilaṃ agamāsi. Goghātakopi goṇo viya gehamajjhe viravanto vicaritvā kālakato avīcimhi nibbatti. Goṇopi kālamakāsi. Goghātakaputtopi takkasilaṃ gantvā suvaṇṇakārakammaṃ uggaṇhi. Athassācariyo gāmaṃ gacchanto ‘‘evarūpaṃ nāma alaṅkāraṃ kareyyāsī’’ti vatvā pakkāmi. Sopi tathārūpaṃ alaṅkāraṃ akāsi. Athassācariyo āgantvā alaṅkāraṃ disvā ‘‘ayaṃ yattha katthaci gantvā jīvituṃ samattho’’ti vayappattaṃ attano dhītaraṃ adāsi. So puttadhītāhi vaḍḍhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Athassa puttā vayappattā sippaṃ uggaṇhitvā aparabhāge sāvatthiyaṃ gantvā tattha gharāvāsaṃ saṇṭhapetvā vasantā saddhā pasannā ahesuṃ. Pitāpi nesaṃ takkasilāyaṃ kiñci kusalaṃ akatvāva jaraṃ ",
      " pāpuṇi. Athassa puttā ‘‘pitā no mahallako’’ti attano santikaṃ pakkosāpetvā ‘‘pitu atthāya dānaṃ dassāmā’’ti buddhappamukhaṃ bhikkhusaṅghaṃ nimantayiṃsu. Te punadivase antogehe buddhappamukhaṃ bhikkhusaṅghaṃ nisīdāpetvā sakkaccaṃ parivisitvā bhattakiccāvasāne satthāraṃ āhaṃsu – ‘‘bhante, amhehi idaṃ pitu jīvabhattaṃ dinnaṃ, pitu no anumodanaṃ karothā’’ti. Satthā taṃ āmantetvā, ‘‘upāsaka, tvaṃ mahallako paripakkasarīro paṇḍupalāsasadiso, tava paralokagamanāya kusalapātheyyaṃ natthi, attano patiṭṭhaṃ karohi, paṇḍito bhava, mā bālo’’ti anumodanaṃ karonto imā dve gāthā abhāsi –"
    ],
    "innerText": "Athassa puttā vayappattā sippaṃ uggaṇhitvā aparabhāge sāvatthiyaṃ gantvā tattha gharāvāsaṃ saṇṭhapetvā vasantā saddhā pasannā ahesuṃ. Pitāpi nesaṃ takkasilāyaṃ kiñci kusalaṃ akatvāva jaraṃ pāpuṇi. Athassa puttā ‘‘pitā no mahallako’’ti attano santikaṃ pakkosāpetvā ‘‘pitu atthāya dānaṃ dassāmā’’ti buddhappamukhaṃ bhikkhusaṅghaṃ nimantayiṃsu. Te punadivase antogehe buddhappamukhaṃ bhikkhusaṅghaṃ nisīdāpetvā sakkaccaṃ parivisitvā bhattakiccāvasāne satthāraṃ āhaṃsu – ‘‘bhante, amhehi idaṃ pitu jīvabhattaṃ dinnaṃ, pitu no anumodanaṃ karothā’’ti. Satthā taṃ āmantetvā, ‘‘upāsaka, tvaṃ mahallako paripakkasarīro paṇḍupalāsasadiso, tava paralokagamanāya kusalapātheyyaṃ natthi, attano patiṭṭhaṃ karohi, paṇḍito bhava, mā bālo’’ti anumodanaṃ karonto imā dve gāthā abhāsi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "235"
      },
      "."
    ],
    "innerText": "235."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " ‘‘Paṇḍupalāsova ",
      " dānisi,"
    ],
    "innerText": "‘‘Paṇḍupalāsova dānisi,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Yamapurisāpi ca te upaṭṭhitā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Uyyogamukhe ca tiṭṭhasi,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pātheyyampi ca te na vijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "236"
      },
      "."
    ],
    "innerText": "236."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " ‘‘So ",
      " karohi dīpamattano,"
    ],
    "innerText": "‘‘So karohi dīpamattano,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Khippaṃ vāyama paṇḍito bhava;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Niddhantamalo anaṅgaṇo,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dibbaṃ ariyabhūmiṃ upehisī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṇḍupalāsova dānisī"
      },
      "ti, upāsaka, tvaṃ idāni chijjitvā bhūmiyaṃ patitapaṇḍupalāso viya ahosi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yamapurisā"
      },
      "ti yamadūtā vuccanti, idaṃ pana maraṇameva sandhāya vuttaṃ, maraṇaṃ te paccupaṭṭhitanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uyyogamukhe"
      },
      "ti parihānimukhe, avuḍḍhimukhe ca ṭhitosīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pātheyya"
      },
      "nti gamikassa taṇḍulādipātheyyaṃ ",
      " viya paralokaṃ gacchantassa tava kusalapātheyyampi natthīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "So karohī"
      },
      "ti so tvaṃ samudde nāvāya bhinnāya dīpasaṅkhātaṃ patiṭṭhaṃ viya attano kusalapatiṭṭhaṃ karohi. Karonto ca khippaṃ vāyama, sīghaṃ sīghaṃ vīriyaṃ ārabha, attano kusalakammapatiṭṭhakaraṇena paṇḍito bhava. Yo hi maraṇamukhaṃ appatvā kātuṃ samatthakāleva kusalaṃ karoti, esa paṇḍito nāma, tādiso bhava, mā andhabāloti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dibbaṃ ariyabhūmi"
      },
      "nti evaṃ vīriyaṃ karonto rāgādīnaṃ malānaṃ nīhaṭatāya niddhantamalo aṅgaṇābhāvena anaṅgaṇo nikkileso hutvā pañcavidhaṃ suddhāvāsabhūmiṃ pāpuṇissasīti attho."
    ],
    "innerText": "Tattha paṇḍupalāsova dānisīti, upāsaka, tvaṃ idāni chijjitvā bhūmiyaṃ patitapaṇḍupalāso viya ahosi. Yamapurisāti yamadūtā vuccanti, idaṃ pana maraṇameva sandhāya vuttaṃ, maraṇaṃ te paccupaṭṭhitanti attho. Uyyogamukheti parihānimukhe, avuḍḍhimukhe ca ṭhitosīti attho. Pātheyyanti gamikassa taṇḍulādipātheyyaṃ viya paralokaṃ gacchantassa tava kusalapātheyyampi natthīti attho. So karohīti so tvaṃ samudde nāvāya bhinnāya dīpasaṅkhātaṃ patiṭṭhaṃ viya attano kusalapatiṭṭhaṃ karohi. Karonto ca khippaṃ vāyama, sīghaṃ sīghaṃ vīriyaṃ ārabha, attano kusalakammapatiṭṭhakaraṇena paṇḍito bhava. Yo hi maraṇamukhaṃ appatvā kātuṃ samatthakāleva kusalaṃ karoti, esa paṇḍito nāma, tādiso bhava, mā andhabāloti attho. Dibbaṃ ariyabhūminti evaṃ vīriyaṃ karonto rāgādīnaṃ malānaṃ nīhaṭatāya niddhantamalo aṅgaṇābhāvena anaṅgaṇo nikkileso hutvā pañcavidhaṃ suddhāvāsabhūmiṃ pāpuṇissasīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Desanāvasāne upāsako sotāpattiphale patiṭṭhahi, sampattānampi sātthikā dhammadesanā ahosīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Te punadivasatthāyapi satthāraṃ nimantetvā dānaṃ datvā katabhattakiccaṃ satthāraṃ anumodanakāle āhaṃsu – ‘‘bhante, idampi amhākaṃ pitu jīvabhattameva, imasseva anumodanaṃ karothā’’ti. Satthā tassa anumodanaṃ karonto imā dve gāthā abhāsi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "237"
      },
      "."
    ],
    "innerText": "237."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " ‘‘Upanītavayo ",
      " ca dānisi,"
    ],
    "innerText": "‘‘Upanītavayo ca dānisi,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Sampayātosi yamassa santikaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Vāso te natthi antarā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pātheyyampi ca te na vijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "238"
      },
      "."
    ],
    "innerText": "238."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘So karohi dīpamattano,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Khippaṃ vāyama paṇḍito bhava;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "children": [
      "Niddhantamalo ",
      " anaṅgaṇo,"
    ],
    "innerText": "Niddhantamalo anaṅgaṇo,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Na puna jātijaraṃ upehisī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upanītavayo"
      },
      "ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upā"
      },
      "ti nipātamattaṃ, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nītavayo"
      },
      "ti vigatavayo atikkantavayo, tvañcasi dāni tayo vaye atikkamitvā maraṇamukhe ṭhitoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sampayātosi yamassa santika"
      },
      "nti maraṇamukhaṃ gantuṃ sajjo hutvā ṭhitosīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vāso te natthi antarā"
      },
      "ti yathā maggaṃ gacchantā tāni tāni kiccāni karontā antarāmagge vasanti, na evaṃ paralokaṃ gacchantā. Na hi sakkā paralokaṃ gacchantena ‘‘adhivāsetha katipāhaṃ, dānaṃ tāva demi, dhammaṃ tāva suṇāmī’’tiādīni vattuṃ. Ito pana cavitvā paraloke nibbattova hoti. Imamatthaṃ sandhāyetaṃ vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pātheyya"
      },
      "nti idaṃ kiñcāpi heṭṭhā vuttameva, upāsakassa pana punappunaṃ daḷhīkaraṇatthaṃ idhāpi satthārā kathitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jātijara"
      },
      "nti ettha ",
      " byādhimaraṇānipi gahitāneva honti. Heṭṭhimagāthāhi ca anāgāmimaggo kathito, idha arahattamaggo kathito. Evaṃ santepi yathā nāma raññā attano mukhapamāṇena kabaḷaṃ vaḍḍhetvā puttassa upanīte so kumāro attano mukhapamāṇeneva gaṇhāti, evameva satthārā uparimaggavasena dhamme desitepi upāsako attano upanissayavasena heṭṭhā sotāpattiphalaṃ patvā imissā anumodanāya avasāne anāgāmiphalaṃ patto. Sesaparisāyapi sātthikā dhammadesanā ahosīti."
    ],
    "innerText": "Tattha upanītavayoti upāti nipātamattaṃ, nītavayoti vigatavayo atikkantavayo, tvañcasi dāni tayo vaye atikkamitvā maraṇamukhe ṭhitoti attho. Sampayātosi yamassa santikanti maraṇamukhaṃ gantuṃ sajjo hutvā ṭhitosīti attho. Vāso te natthi antarāti yathā maggaṃ gacchantā tāni tāni kiccāni karontā antarāmagge vasanti, na evaṃ paralokaṃ gacchantā. Na hi sakkā paralokaṃ gacchantena ‘‘adhivāsetha katipāhaṃ, dānaṃ tāva demi, dhammaṃ tāva suṇāmī’’tiādīni vattuṃ. Ito pana cavitvā paraloke nibbattova hoti. Imamatthaṃ sandhāyetaṃ vuttaṃ. Pātheyyanti idaṃ kiñcāpi heṭṭhā vuttameva, upāsakassa pana punappunaṃ daḷhīkaraṇatthaṃ idhāpi satthārā kathitaṃ. Jātijaranti ettha byādhimaraṇānipi gahitāneva honti. Heṭṭhimagāthāhi ca anāgāmimaggo kathito, idha arahattamaggo kathito. Evaṃ santepi yathā nāma raññā attano mukhapamāṇena kabaḷaṃ vaḍḍhetvā puttassa upanīte so kumāro attano mukhapamāṇeneva gaṇhāti, evameva satthārā uparimaggavasena dhamme desitepi upāsako attano upanissayavasena heṭṭhā sotāpattiphalaṃ patvā imissā anumodanāya avasāne anāgāmiphalaṃ patto. Sesaparisāyapi sātthikā dhammadesanā ahosīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Goghātakaputtavatthu paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Aññatarabrāhmaṇavatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anupubbenā"
      },
      "ti ",
      " imaṃ dhammadesanaṃ satthā jetavane viharanto aññatarabrāhmaṇaṃ ārabbha kathesi."
    ],
    "innerText": "Anupubbenāti imaṃ dhammadesanaṃ satthā jetavane viharanto aññatarabrāhmaṇaṃ ārabbha kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "So kira ekadivasaṃ pātova nikkhamitvā bhikkhūnaṃ cīvarapārupanaṭṭhāne bhikkhū cīvaraṃ pārupante olokento aṭṭhāsi. Taṃ pana ṭhānaṃ virūḷhatiṇaṃ hoti. Athekassa bhikkhuno cīvaraṃ pārupantassa cīvarakaṇṇo tiṇesu pavaṭṭento ussāvabindūhi temi. Brāhmaṇo ‘‘imaṃ ṭhānaṃ ",
      " appaharitaṃ kātuṃ vaṭṭatī’’ti punadivase kuddālaṃ ādāya gantvā taṃ ṭhānaṃ tacchetvā khalamaṇḍalasadisaṃ akāsi. Punadivasepi taṃ ṭhānaṃ āgantvā bhikkhūsu cīvaraṃ pārupantesu ekassa ",
      " cīvarakaṇṇaṃ bhūmiyaṃ patitvā paṃsumhi pavaṭṭamānaṃ disvā ‘‘idha vālukaṃ okirituṃ vaṭṭatī’’ti cintetvā vālukaṃ āharitvā okiri."
    ],
    "innerText": "So kira ekadivasaṃ pātova nikkhamitvā bhikkhūnaṃ cīvarapārupanaṭṭhāne bhikkhū cīvaraṃ pārupante olokento aṭṭhāsi. Taṃ pana ṭhānaṃ virūḷhatiṇaṃ hoti. Athekassa bhikkhuno cīvaraṃ pārupantassa cīvarakaṇṇo tiṇesu pavaṭṭento ussāvabindūhi temi. Brāhmaṇo ‘‘imaṃ ṭhānaṃ appaharitaṃ kātuṃ vaṭṭatī’’ti punadivase kuddālaṃ ādāya gantvā taṃ ṭhānaṃ tacchetvā khalamaṇḍalasadisaṃ akāsi. Punadivasepi taṃ ṭhānaṃ āgantvā bhikkhūsu cīvaraṃ pārupantesu ekassa cīvarakaṇṇaṃ bhūmiyaṃ patitvā paṃsumhi pavaṭṭamānaṃ disvā ‘‘idha vālukaṃ okirituṃ vaṭṭatī’’ti cintetvā vālukaṃ āharitvā okiri."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Athekadivasaṃ purebhattaṃ caṇḍo ātapo ahosi, tadāpi bhikkhūnaṃ cīvaraṃ pārupantānaṃ gattato sede muccante disvā ‘‘idha mayā maṇḍapaṃ kāretuṃ vaṭṭatī’’ti cintetvā maṇḍapaṃ kāresi. Punadivase pātova vassaṃ vassi, vaddalikaṃ ahosi. Tadāpi brāhmaṇo bhikkhū olokentova ṭhito tintacīvarake bhikkhū disvā ‘‘ettha mayā sālaṃ kāretuṃ vaṭṭatī’’ti sālaṃ kāretvā ‘‘idāni sālamahaṃ karissāmī’’ti cintetvā buddhappamukhaṃ bhikkhusaṅghaṃ ",
      " nimantetvā anto ca bahi ca bhikkhū nisīdāpetvā bhattakiccāvasāne anumodanatthāya satthu pattaṃ gahetvā, ‘‘bhante, ahaṃ bhikkhūnaṃ cīvarapārupanakāle imasmiṃ ṭhāne olokento ṭhito idañcidañca disvā idañcidañca kāresi’’nti ādito paṭṭhāya sabbaṃ taṃ pavattiṃ ārocesi. Satthā tassa vacanaṃ sutvā, ‘‘brāhmaṇa, paṇḍitā nāma khaṇe khaṇe thokaṃ kusalaṃ karontā anupubbena attano akusalamalaṃ nīharantiyevā’’ti vatvā imaṃ gāthamāha –"
    ],
    "innerText": "Athekadivasaṃ purebhattaṃ caṇḍo ātapo ahosi, tadāpi bhikkhūnaṃ cīvaraṃ pārupantānaṃ gattato sede muccante disvā ‘‘idha mayā maṇḍapaṃ kāretuṃ vaṭṭatī’’ti cintetvā maṇḍapaṃ kāresi. Punadivase pātova vassaṃ vassi, vaddalikaṃ ahosi. Tadāpi brāhmaṇo bhikkhū olokentova ṭhito tintacīvarake bhikkhū disvā ‘‘ettha mayā sālaṃ kāretuṃ vaṭṭatī’’ti sālaṃ kāretvā ‘‘idāni sālamahaṃ karissāmī’’ti cintetvā buddhappamukhaṃ bhikkhusaṅghaṃ nimantetvā anto ca bahi ca bhikkhū nisīdāpetvā bhattakiccāvasāne anumodanatthāya satthu pattaṃ gahetvā, ‘‘bhante, ahaṃ bhikkhūnaṃ cīvarapārupanakāle imasmiṃ ṭhāne olokento ṭhito idañcidañca disvā idañcidañca kāresi’’nti ādito paṭṭhāya sabbaṃ taṃ pavattiṃ ārocesi. Satthā tassa vacanaṃ sutvā, ‘‘brāhmaṇa, paṇḍitā nāma khaṇe khaṇe thokaṃ kusalaṃ karontā anupubbena attano akusalamalaṃ nīharantiyevā’’ti vatvā imaṃ gāthamāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "239"
      },
      "."
    ],
    "innerText": "239."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Anupubbena medhāvī, thokaṃ thokaṃ khaṇe khaṇe;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kammāro rajatasseva, niddhame malamattano’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anupubbenā"
      },
      "ti anupaṭipāṭiyā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Medhāvī"
      },
      "ti dhammojapaññāya samannāgato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khaṇe khaṇe"
      },
      "ti okāse okāse kusalaṃ karonto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammāro rajatassevā"
      },
      "ti yathā suvaṇṇakāro ekavārameva suvaṇṇaṃ tāpetvā koṭṭetvā malaṃ nīharitvā pilandhanavikatiṃ kātuṃ na sakkoti ",
      ", punappunaṃ tāpento koṭṭento pana malaṃ nīharati, tato anekavidhaṃ pilandhanavikatiṃ karoti, evameva punappunaṃ kusalaṃ karonto paṇḍito attano rāgādimalaṃ niddhameyya, evaṃ niddhantamalo nikkilesova hotīti attho."
    ],
    "innerText": "Tattha anupubbenāti anupaṭipāṭiyā. Medhāvīti dhammojapaññāya samannāgato. Khaṇe khaṇeti okāse okāse kusalaṃ karonto. Kammāro rajatassevāti yathā suvaṇṇakāro ekavārameva suvaṇṇaṃ tāpetvā koṭṭetvā malaṃ nīharitvā pilandhanavikatiṃ kātuṃ na sakkoti , punappunaṃ tāpento koṭṭento pana malaṃ nīharati, tato anekavidhaṃ pilandhanavikatiṃ karoti, evameva punappunaṃ kusalaṃ karonto paṇḍito attano rāgādimalaṃ niddhameyya, evaṃ niddhantamalo nikkilesova hotīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Desanāvasāne ",
      " brāhmaṇo sotāpattiphale patiṭṭhati, mahājanassāpi sātthikā dhammadesanā ahosīti."
    ],
    "innerText": "Desanāvasāne brāhmaṇo sotāpattiphale patiṭṭhati, mahājanassāpi sātthikā dhammadesanā ahosīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Aññatarabrāhmaṇavatthu dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Tissattheravatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayasāva"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mala"
      },
      "nti imaṃ dhammadesanaṃ satthā jetavane viharanto tissattheraṃ nāma bhikkhuṃ ārabbha kathesi."
    ],
    "innerText": "Ayasāvamalanti imaṃ dhammadesanaṃ satthā jetavane viharanto tissattheraṃ nāma bhikkhuṃ ārabbha kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Eko kira sāvatthivāsī kulaputto pabbajitvā laddhūpasampado tissattheroti paññāyi. So aparabhāge janapadavihāre vassūpagato aṭṭhahatthakaṃ thūlasāṭakaṃ labhitvā vutthavasso pavāretvā taṃ ādāya gantvā bhaginiyā hatthe ṭhapesi. Sā ‘‘na me eso sāṭako bhātu anucchaviko’’ti taṃ tikhiṇāya vāsiyā chinditvā hīrahīraṃ katvā udukkhale koṭṭetvā pavisetvā pothetvā vaṭṭetvā sukhumasuttaṃ kantitvā sāṭakaṃ vāyāpesi. Theropi suttañceva sūciyo ca saṃvidahitvā cīvarakārake daharasāmaṇere sannipātetvā bhaginiyā santikaṃ gantvā ‘‘taṃ ",
      " me sāṭakaṃ detha, cīvaraṃ kāressāmī’’ti āha. Sā navahatthaṃ sāṭakaṃ nīharitvā kaniṭṭhabhātikassa hatthe ṭhapesi. So taṃ gahetvā vitthāretvā oloketvā ‘‘mama sāṭako thūlo aṭṭhahattho, ayaṃ sukhumo navahattho. Nāyaṃ mama sāṭako, tumhākaṃ esa, na me iminā attho, tameva me dethā’’ti āha. ‘‘Bhante, tumhākameva eso, gaṇhatha na’’nti? So neva icchi. Athassa attanā katakiccaṃ sabbaṃ ārocetvā, ‘‘bhante, tumhākamevesa, gaṇhatha na’’nti adāsi. So taṃ ādāya vihāraṃ gantvā cīvarakammaṃ paṭṭhapesi."
    ],
    "innerText": "Eko kira sāvatthivāsī kulaputto pabbajitvā laddhūpasampado tissattheroti paññāyi. So aparabhāge janapadavihāre vassūpagato aṭṭhahatthakaṃ thūlasāṭakaṃ labhitvā vutthavasso pavāretvā taṃ ādāya gantvā bhaginiyā hatthe ṭhapesi. Sā ‘‘na me eso sāṭako bhātu anucchaviko’’ti taṃ tikhiṇāya vāsiyā chinditvā hīrahīraṃ katvā udukkhale koṭṭetvā pavisetvā pothetvā vaṭṭetvā sukhumasuttaṃ kantitvā sāṭakaṃ vāyāpesi. Theropi suttañceva sūciyo ca saṃvidahitvā cīvarakārake daharasāmaṇere sannipātetvā bhaginiyā santikaṃ gantvā ‘‘taṃ me sāṭakaṃ detha, cīvaraṃ kāressāmī’’ti āha. Sā navahatthaṃ sāṭakaṃ nīharitvā kaniṭṭhabhātikassa hatthe ṭhapesi. So taṃ gahetvā vitthāretvā oloketvā ‘‘mama sāṭako thūlo aṭṭhahattho, ayaṃ sukhumo navahattho. Nāyaṃ mama sāṭako, tumhākaṃ esa, na me iminā attho, tameva me dethā’’ti āha. ‘‘Bhante, tumhākameva eso, gaṇhatha na’’nti? So neva icchi. Athassa attanā katakiccaṃ sabbaṃ ārocetvā, ‘‘bhante, tumhākamevesa, gaṇhatha na’’nti adāsi. So taṃ ādāya vihāraṃ gantvā cīvarakammaṃ paṭṭhapesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Athassa ",
      " bhaginī cīvarakārānaṃ atthāya yāgubhattādīni sampādesi. Cīvarassa niṭṭhitadivase pana atirekasakkāraṃ kāresi. So cīvaraṃ oloketvā tasmiṃ uppannasineho ‘‘sve dāni naṃ pārupissāmī’’ti saṃharitvā cīvaravaṃse ṭhapetvā taṃ rattiṃ bhuttāhāraṃ jirāpetuṃ asakkonto kālaṃ katvā tasmiṃyeva cīvare ūkā hutvā nibbatti. Bhaginīpissa kālakiriyaṃ sutvā bhikkhūnaṃ pādesu pavattamānā rodi. Bhikkhū tassa sarīrakiccaṃ katvā gilānupaṭṭhākassa abhāvena saṅghasseva taṃ pāpuṇāti. ‘‘Bhājessāma na’’nti taṃ cīvaraṃ nīharāpesuṃ. Sā ūkā ‘‘ime mama santakaṃ vilumpantī’’ti viravantī ito cito ca sandhāvi. Satthā gandhakuṭiyaṃ nisinnova dibbāya sotadhātuyā taṃ saddaṃ sutvā, ‘‘ānanda, tissassa cīvaraṃ abhājetvā sattāhaṃ nikkhipituṃ vadehī’’ti āha. Thero tathā kāresi. Sāpi sattame divase kālaṃ katvā tusitavimāne nibbatti. Satthā ",
      " ‘‘aṭṭhame divase tissassa cīvaraṃ bhājetvā gaṇhathā’’ti āṇāpesi. Bhikkhū tathā kariṃsu."
    ],
    "innerText": "Athassa bhaginī cīvarakārānaṃ atthāya yāgubhattādīni sampādesi. Cīvarassa niṭṭhitadivase pana atirekasakkāraṃ kāresi. So cīvaraṃ oloketvā tasmiṃ uppannasineho ‘‘sve dāni naṃ pārupissāmī’’ti saṃharitvā cīvaravaṃse ṭhapetvā taṃ rattiṃ bhuttāhāraṃ jirāpetuṃ asakkonto kālaṃ katvā tasmiṃyeva cīvare ūkā hutvā nibbatti. Bhaginīpissa kālakiriyaṃ sutvā bhikkhūnaṃ pādesu pavattamānā rodi. Bhikkhū tassa sarīrakiccaṃ katvā gilānupaṭṭhākassa abhāvena saṅghasseva taṃ pāpuṇāti. ‘‘Bhājessāma na’’nti taṃ cīvaraṃ nīharāpesuṃ. Sā ūkā ‘‘ime mama santakaṃ vilumpantī’’ti viravantī ito cito ca sandhāvi. Satthā gandhakuṭiyaṃ nisinnova dibbāya sotadhātuyā taṃ saddaṃ sutvā, ‘‘ānanda, tissassa cīvaraṃ abhājetvā sattāhaṃ nikkhipituṃ vadehī’’ti āha. Thero tathā kāresi. Sāpi sattame divase kālaṃ katvā tusitavimāne nibbatti. Satthā ‘‘aṭṭhame divase tissassa cīvaraṃ bhājetvā gaṇhathā’’ti āṇāpesi. Bhikkhū tathā kariṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhikkhū ",
      " dhammasabhāyaṃ kathaṃ samuṭṭhāpesuṃ ‘‘kasmā nu kho satthā tissassa cīvaraṃ satta divase ṭhapāpetvā aṭṭhame divase gaṇhituṃ anujānī’’ti. Satthā āgantvā ‘‘kāya nuttha, bhikkhave, etarahi kathāya sannisinnā’’ti pucchitvā ‘‘imāya nāmā’’ti vutte, ‘‘bhikkhave, tisso attano cīvare ūkā hutvā nibbatto, tumhehi tasmiṃ bhājiyamāne ‘ime mama santakaṃ vilumpantī’ti viravantī ito cito ca dhāvi. Sā tumhehi cīvare gayhamāne tumhesu manaṃ padussitvā niraye nibbatteyya, tena cāhaṃ cīvaraṃ nikkhipāpesiṃ. Idāni pana sā tusitavimāne nibbattā, tena vo mayā cīvaragahaṇaṃ anuññāta’’nti vatvā puna tehi ‘‘bhāriyā vata ayaṃ, bhante, taṇhā nāmā’’ti vutte ‘‘āma, bhikkhave, imesaṃ sattānaṃ taṇhā nāma bhāriyā. Yathā ayato malaṃ uṭṭhahitvā ayameva khādati vināseti aparibhogaṃ karoti, evamevāyaṃ taṇhā imesaṃ sattānaṃ abbhantare uppajjitvā te satte nirayādīsu nibbattāpeti, vināsaṃ pāpetī’’ti vatvā imaṃ gāthamāha –"
    ],
    "innerText": "Bhikkhū dhammasabhāyaṃ kathaṃ samuṭṭhāpesuṃ ‘‘kasmā nu kho satthā tissassa cīvaraṃ satta divase ṭhapāpetvā aṭṭhame divase gaṇhituṃ anujānī’’ti. Satthā āgantvā ‘‘kāya nuttha, bhikkhave, etarahi kathāya sannisinnā’’ti pucchitvā ‘‘imāya nāmā’’ti vutte, ‘‘bhikkhave, tisso attano cīvare ūkā hutvā nibbatto, tumhehi tasmiṃ bhājiyamāne ‘ime mama santakaṃ vilumpantī’ti viravantī ito cito ca dhāvi. Sā tumhehi cīvare gayhamāne tumhesu manaṃ padussitvā niraye nibbatteyya, tena cāhaṃ cīvaraṃ nikkhipāpesiṃ. Idāni pana sā tusitavimāne nibbattā, tena vo mayā cīvaragahaṇaṃ anuññāta’’nti vatvā puna tehi ‘‘bhāriyā vata ayaṃ, bhante, taṇhā nāmā’’ti vutte ‘‘āma, bhikkhave, imesaṃ sattānaṃ taṇhā nāma bhāriyā. Yathā ayato malaṃ uṭṭhahitvā ayameva khādati vināseti aparibhogaṃ karoti, evamevāyaṃ taṇhā imesaṃ sattānaṃ abbhantare uppajjitvā te satte nirayādīsu nibbattāpeti, vināsaṃ pāpetī’’ti vatvā imaṃ gāthamāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "240"
      },
      "."
    ],
    "innerText": "240."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ayasāva malaṃ samuṭṭhitaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Tatuṭṭhāya tameva khādati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Evaṃ atidhonacārinaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sāni kammāni nayanti duggati’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ayasāvā"
      },
      "ti ayato samuṭṭhitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatuṭṭhāyā"
      },
      "ti tato uṭṭhāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atidhonacārina"
      },
      "nti dhonā vuccati cattāro paccaye ‘‘idamatthaṃ ete’’ti paccavekkhitvā paribhuñjanapaññā, taṃ atikkamitvā caranto atidhonacārī nāma. Idaṃ vuttaṃ hoti – yathā ayato malaṃ samuṭṭhāya tato samuṭṭhitaṃ tameva khādati, evamevaṃ catupaccaye apaccavekkhitvā paribhuñjantaṃ atidhonacārinaṃ sāni kammāni attani ṭhitattā attano santakāneva tāni kammāni duggatiṃ nayantīti."
    ],
    "innerText": "Tattha ayasāvāti ayato samuṭṭhitaṃ. Tatuṭṭhāyāti tato uṭṭhāya. Atidhonacārinanti dhonā vuccati cattāro paccaye ‘‘idamatthaṃ ete’’ti paccavekkhitvā paribhuñjanapaññā, taṃ atikkamitvā caranto atidhonacārī nāma. Idaṃ vuttaṃ hoti – yathā ayato malaṃ samuṭṭhāya tato samuṭṭhitaṃ tameva khādati, evamevaṃ catupaccaye apaccavekkhitvā paribhuñjantaṃ atidhonacārinaṃ sāni kammāni attani ṭhitattā attano santakāneva tāni kammāni duggatiṃ nayantīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Desanāvasāne bahū sotāpattiphalādīni pāpuṇiṃsūti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tissattheravatthu tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Lāludāyittheravatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asajjhāyamalā"
      },
      "ti ",
      " imaṃ dhammadesanaṃ satthā jetavane viharanto lāludāyittheraṃ ārabbha kathesi."
    ],
    "innerText": "Asajjhāyamalāti imaṃ dhammadesanaṃ satthā jetavane viharanto lāludāyittheraṃ ārabbha kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sāvatthiyaṃ kira pañcakoṭimattā ariyasāvakā vasanti, dve koṭimattā puthujjanā vasanti. Tesu ariyasāvakā purebhattaṃ ",
      " dānaṃ datvā pacchābhattaṃ sappitelamadhuphāṇitavatthādīni gahetvā vihāraṃ gantvā dhammakathaṃ suṇanti. Dhammaṃ sutvā gamanakāle ca sāriputtamoggallānānaṃ guṇakathaṃ kathenti. Udāyitthero tesaṃ kathaṃ sutvā ‘‘etesaṃ tāva dhammaṃ sutvā tumhe evaṃ kathetha, mama dhammakathaṃ sutvā kiṃ nu kho na kathessathā’’ti vadati. Manussā tassa kathaṃ sutvā ‘‘ayaṃ eko dhammakathiko bhavissati, imassapi amhehi dhammakathaṃ sotuṃ vaṭṭatī’’ti te ekadivasaṃ theraṃ yācitvā, ‘‘bhante, ajja amhākaṃ dhammassavanadivaso’’ti saṅghassa dānaṃ datvā, ‘‘bhante, tumhe amhākaṃ divā dhammakathaṃ katheyyāthā’’ti āhaṃsu. Sopi tesaṃ adhivāsesi."
    ],
    "innerText": "Sāvatthiyaṃ kira pañcakoṭimattā ariyasāvakā vasanti, dve koṭimattā puthujjanā vasanti. Tesu ariyasāvakā purebhattaṃ dānaṃ datvā pacchābhattaṃ sappitelamadhuphāṇitavatthādīni gahetvā vihāraṃ gantvā dhammakathaṃ suṇanti. Dhammaṃ sutvā gamanakāle ca sāriputtamoggallānānaṃ guṇakathaṃ kathenti. Udāyitthero tesaṃ kathaṃ sutvā ‘‘etesaṃ tāva dhammaṃ sutvā tumhe evaṃ kathetha, mama dhammakathaṃ sutvā kiṃ nu kho na kathessathā’’ti vadati. Manussā tassa kathaṃ sutvā ‘‘ayaṃ eko dhammakathiko bhavissati, imassapi amhehi dhammakathaṃ sotuṃ vaṭṭatī’’ti te ekadivasaṃ theraṃ yācitvā, ‘‘bhante, ajja amhākaṃ dhammassavanadivaso’’ti saṅghassa dānaṃ datvā, ‘‘bhante, tumhe amhākaṃ divā dhammakathaṃ katheyyāthā’’ti āhaṃsu. Sopi tesaṃ adhivāsesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tehi dhammassavanavelāya āgantvā, ‘‘bhante, no dhammaṃ kathethā’’ti vutte lāludāyitthero āsane nisīditvā cittabījaniṃ gahetvā ",
      " cālento ekampi dhammapadaṃ adisvā ‘‘ahaṃ sarabhaññaṃ bhaṇissāmi, añño dhammakathaṃ kathetū’’ti vatvā otari. Te aññena dhammakathaṃ kathāpetvā sarabhāṇatthāya puna taṃ āsanaṃ āropayiṃsu. So punapi kiñci adisvā ‘‘ahaṃ rattiṃ kathessāmi, añño sarabhaññaṃ bhaṇatū’’ti vatvā āsanā otari. Te aññena sarabhaññaṃ bhaṇāpetvā puna rattiṃ theraṃ ānayiṃsu. So rattimpi kiñci adisvā ‘‘ahaṃ paccūsakāle kathessāmi, rattiṃ añño kathetū’’ti vatvā otari. Te aññena rattiṃ kathāpetvā ",
      " puna paccūse taṃ ānayiṃsu. So punapi kiñci nāddasa. Mahājano leḍḍudaṇḍādīni gahetvā, ‘‘andhabāla, tvaṃ sāriputtamoggallānānaṃ vaṇṇe kathiyamāne evañcevañca vadesi, idāni kasmā na kathesī’’ti santajjetvā palāyantaṃ anubandhi. So palāyanto ekissā vaccakuṭiyā pati."
    ],
    "innerText": "Tehi dhammassavanavelāya āgantvā, ‘‘bhante, no dhammaṃ kathethā’’ti vutte lāludāyitthero āsane nisīditvā cittabījaniṃ gahetvā cālento ekampi dhammapadaṃ adisvā ‘‘ahaṃ sarabhaññaṃ bhaṇissāmi, añño dhammakathaṃ kathetū’’ti vatvā otari. Te aññena dhammakathaṃ kathāpetvā sarabhāṇatthāya puna taṃ āsanaṃ āropayiṃsu. So punapi kiñci adisvā ‘‘ahaṃ rattiṃ kathessāmi, añño sarabhaññaṃ bhaṇatū’’ti vatvā āsanā otari. Te aññena sarabhaññaṃ bhaṇāpetvā puna rattiṃ theraṃ ānayiṃsu. So rattimpi kiñci adisvā ‘‘ahaṃ paccūsakāle kathessāmi, rattiṃ añño kathetū’’ti vatvā otari. Te aññena rattiṃ kathāpetvā puna paccūse taṃ ānayiṃsu. So punapi kiñci nāddasa. Mahājano leḍḍudaṇḍādīni gahetvā, ‘‘andhabāla, tvaṃ sāriputtamoggallānānaṃ vaṇṇe kathiyamāne evañcevañca vadesi, idāni kasmā na kathesī’’ti santajjetvā palāyantaṃ anubandhi. So palāyanto ekissā vaccakuṭiyā pati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Mahājano kathaṃ samuṭṭhāpesi – ‘‘ajja lāludāyī sāriputtamoggallānānaṃ guṇakathāya pavattamānāya ussūyanto attano dhammakathikabhāvaṃ pakāsetvā manussehi sakkāraṃ katvā ‘dhammaṃ suṇomā’ti vutte catukkhattuṃ āsane nisīditvā kathetabbayuttakaṃ kiñci apassanto ‘tvaṃ amhākaṃ ",
      " ayyehi sāriputtamoggallānattherehi saddhiṃ yugaggāhaṃ gaṇhāsī’ti leḍḍudaṇḍādīni gahetvā santajjetvā palāpiyamāno vaccakuṭiyā patito’’ti. Satthā āgantvā ‘‘kāya nuttha, bhikkhave, etarahi kathāya sannisinnā’’ti pucchitvā ‘‘imāya nāmā’’ti vutte ‘‘na, bhikkhave, idāneva, pubbepi eso gūthakūpe nimuggoyevā’’ti vatvā atītaṃ āharitvā –"
    ],
    "innerText": "Mahājano kathaṃ samuṭṭhāpesi – ‘‘ajja lāludāyī sāriputtamoggallānānaṃ guṇakathāya pavattamānāya ussūyanto attano dhammakathikabhāvaṃ pakāsetvā manussehi sakkāraṃ katvā ‘dhammaṃ suṇomā’ti vutte catukkhattuṃ āsane nisīditvā kathetabbayuttakaṃ kiñci apassanto ‘tvaṃ amhākaṃ ayyehi sāriputtamoggallānattherehi saddhiṃ yugaggāhaṃ gaṇhāsī’ti leḍḍudaṇḍādīni gahetvā santajjetvā palāpiyamāno vaccakuṭiyā patito’’ti. Satthā āgantvā ‘‘kāya nuttha, bhikkhave, etarahi kathāya sannisinnā’’ti pucchitvā ‘‘imāya nāmā’’ti vutte ‘‘na, bhikkhave, idāneva, pubbepi eso gūthakūpe nimuggoyevā’’ti vatvā atītaṃ āharitvā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Catuppado ahaṃ samma, tvampi samma catuppado;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ehi samma nivattassu, kiṃ nu bhīto palāyasi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Asucipūtilomosi, duggandho vāsi sūkara;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sace yujjhitukāmosi, jayaṃ samma dadāmi te’’ti. (jā. 1.2.5-6) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Imaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jātakaṃ"
      },
      " vitthāretvā kathesi. Tadā sīho sāriputto ahosi, sūkaro lāludāyīti. Satthā imaṃ dhammadesanaṃ āharitvā, ‘‘bhikkhave, lāludāyinā appamattakova dhammo uggahito, sajjhāyaṃ pana neva ",
      " akāsi, kiñci pariyattiṃ uggahetvā tassā asajjhāyakaraṇaṃ malamevā’’ti vatvā imaṃ gāthamāha –"
    ],
    "innerText": "Imaṃ jātakaṃ vitthāretvā kathesi. Tadā sīho sāriputto ahosi, sūkaro lāludāyīti. Satthā imaṃ dhammadesanaṃ āharitvā, ‘‘bhikkhave, lāludāyinā appamattakova dhammo uggahito, sajjhāyaṃ pana neva akāsi, kiñci pariyattiṃ uggahetvā tassā asajjhāyakaraṇaṃ malamevā’’ti vatvā imaṃ gāthamāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "241"
      },
      "."
    ],
    "innerText": "241."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Asajjhāyamalā mantā, anuṭṭhānamalā gharā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Malaṃ vaṇṇassa kosajjaṃ, pamādo rakkhato mala’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asajjhāyamalā"
      },
      "ti yākāci pariyatti vā sippaṃ vā yasmā asajjhāyantassa ananuyuñjantassa vinassati vā nirantaraṃ vā na upaṭṭhāti, tasmā ‘‘asajjhāyamalā mantā’’ti vuttaṃ. Yasmā pana gharāvāsaṃ vasantassa uṭṭhāyuṭṭhāya jiṇṇapaṭisaṅkharaṇādīni akarontassa gharaṃ nāma vinassati, tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘anuṭṭhānamalā gharā’’"
      },
      "ti vuttaṃ. Yasmā gihissa vā pabbajitassa vā kosajjavasena sarīrapaṭijagganaṃ vā parikkhārapaṭijagganaṃ vā akarontassa kāyo dubbaṇṇo hoti, tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘malaṃ vaṇṇassa kosajja’’"
      },
      "nti vuttaṃ. Yasmā gāvo rakkhantassa pamādavasena niddāyantassa vā kīḷantassa vā tā gāvo atitthapakkhandanādinā ",
      " vā vāḷamigacorādiupaddavena vā paresaṃ sālikhettādīni otaritvā khādanavasena vināsaṃ āpajjanti, sayampi daṇḍaṃ vā paribhāsaṃ vā pāpuṇāti, pabbajitaṃ vā pana cha dvārāni arakkhantaṃ pamādavasena kilesā otaritvā sāsanā cāventi, tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘pamādo rakkhato mala’’"
      },
      "nti vuttaṃ. So hissa vināsāvahanena malaṭṭhāniyattā malanti attho."
    ],
    "innerText": "Tattha asajjhāyamalāti yākāci pariyatti vā sippaṃ vā yasmā asajjhāyantassa ananuyuñjantassa vinassati vā nirantaraṃ vā na upaṭṭhāti, tasmā ‘‘asajjhāyamalā mantā’’ti vuttaṃ. Yasmā pana gharāvāsaṃ vasantassa uṭṭhāyuṭṭhāya jiṇṇapaṭisaṅkharaṇādīni akarontassa gharaṃ nāma vinassati, tasmā ‘‘anuṭṭhānamalā gharā’’ti vuttaṃ. Yasmā gihissa vā pabbajitassa vā kosajjavasena sarīrapaṭijagganaṃ vā parikkhārapaṭijagganaṃ vā akarontassa kāyo dubbaṇṇo hoti, tasmā ‘‘malaṃ vaṇṇassa kosajja’’nti vuttaṃ. Yasmā gāvo rakkhantassa pamādavasena niddāyantassa vā kīḷantassa vā tā gāvo atitthapakkhandanādinā vā vāḷamigacorādiupaddavena vā paresaṃ sālikhettādīni otaritvā khādanavasena vināsaṃ āpajjanti, sayampi daṇḍaṃ vā paribhāsaṃ vā pāpuṇāti, pabbajitaṃ vā pana cha dvārāni arakkhantaṃ pamādavasena kilesā otaritvā sāsanā cāventi, tasmā ‘‘pamādo rakkhato mala’’nti vuttaṃ. So hissa vināsāvahanena malaṭṭhāniyattā malanti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Desanāvasāne ",
      " bahū sotāpattiphalādīni pāpuṇiṃsūti."
    ],
    "innerText": "Desanāvasāne bahū sotāpattiphalādīni pāpuṇiṃsūti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Lāludāyittheravatthu catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Aññatarakulaputtavatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Malitthiyā duccarita"
      },
      "nti imaṃ dhammadesanaṃ satthā veḷuvane viharanto aññataraṃ kulaputtaṃ ārabbha kathesi."
    ],
    "innerText": "Malitthiyā duccaritanti imaṃ dhammadesanaṃ satthā veḷuvane viharanto aññataraṃ kulaputtaṃ ārabbha kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tassa kira samānajātikaṃ kulakumārikaṃ ānesuṃ. Sā ānītadivasato paṭṭhāya aticārinī ahosi. So kulaputto tassā aticārena lajjito kassaci sammukhībhāvaṃ upagantuṃ asakkonto ",
      " buddhupaṭṭhānādīni ",
      " pacchinditvā katipāhaccayena satthāraṃ upasaṅkamitvā vanditvā ekamantaṃ nisinno ‘‘kiṃ, upāsaka, na dissasī’’ti vutte tamatthaṃ ārocesi. Atha naṃ satthā, ‘‘upāsaka, pubbepi mayā ‘itthiyo nāma nadīādisadisā, tāsu paṇḍitena kodho na kātabbo’ti vuttaṃ, tvaṃ pana bhavapaṭicchannattā na sallakkhesī’’ti vatvā tena yācito –"
    ],
    "innerText": "Tassa kira samānajātikaṃ kulakumārikaṃ ānesuṃ. Sā ānītadivasato paṭṭhāya aticārinī ahosi. So kulaputto tassā aticārena lajjito kassaci sammukhībhāvaṃ upagantuṃ asakkonto buddhupaṭṭhānādīni pacchinditvā katipāhaccayena satthāraṃ upasaṅkamitvā vanditvā ekamantaṃ nisinno ‘‘kiṃ, upāsaka, na dissasī’’ti vutte tamatthaṃ ārocesi. Atha naṃ satthā, ‘‘upāsaka, pubbepi mayā ‘itthiyo nāma nadīādisadisā, tāsu paṇḍitena kodho na kātabbo’ti vuttaṃ, tvaṃ pana bhavapaṭicchannattā na sallakkhesī’’ti vatvā tena yācito –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yathā nadī ca pantho ca, pānāgāraṃ sabhā papā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Evaṃ lokitthiyo nāma, velā tāsaṃ na vijjatī’’ti. (jā. 1.1.65; 1.12.9) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jātakaṃ"
      },
      " vitthāretvā, ‘‘upāsaka, itthiyā hi aticārinibhāvo malaṃ, dānaṃ dentassa maccheraṃ malaṃ, idhalokaparalokesu sattānaṃ akusalakammaṃ vināsanatthena malaṃ, avijjā pana sabbamalānaṃ uttamamala’’nti vatvā imā gāthā abhāsi –"
    ],
    "innerText": "Jātakaṃ vitthāretvā, ‘‘upāsaka, itthiyā hi aticārinibhāvo malaṃ, dānaṃ dentassa maccheraṃ malaṃ, idhalokaparalokesu sattānaṃ akusalakammaṃ vināsanatthena malaṃ, avijjā pana sabbamalānaṃ uttamamala’’nti vatvā imā gāthā abhāsi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "242"
      },
      "."
    ],
    "innerText": "242."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Malitthiyā duccaritaṃ, maccheraṃ dadato malaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Malā ve pāpakā dhammā, asmiṃ loke paramhi ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "243"
      },
      "."
    ],
    "innerText": "243."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tato malā malataraṃ, avijjā paramaṃ malaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Etaṃ malaṃ pahantvāna, nimmalā hotha bhikkhavo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "duccarita"
      },
      "nti aticāro. Aticāriniñhi itthiṃ sāmikopi gehā nīharati, mātāpitūnaṃ santikaṃ gatampi ‘‘tvaṃ kulassa agāravabhūtā, akkhīhipi na daṭṭhabbā’’ti taṃ nīharanti. Sā anāthā vicarantī mahādukkhaṃ pāpuṇāti. Tenassā duccaritaṃ ‘‘mala’’nti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dadato"
      },
      "ti dāyakassa. Yassa hi khettakasanakāle ‘‘imasmiṃ khette sampanne salākabhattādīni dassāmī’’ti cintetvā nipphanne sassepi maccheraṃ uppajjitvā cāgacittaṃ nivāreti, so maccheravasena cāgacitte avirūhante manussasampattiṃ dibbasampattiṃ nibbānasampattinti tisso sampattiyo na labhati. Tena vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘maccheraṃ dadato mala’’"
      },
      "nti. Sesesupi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāpakā dhammā"
      },
      "ti akusaladhammā pana idhaloke ca paraloke ca malameva."
    ],
    "innerText": "Tattha duccaritanti aticāro. Aticāriniñhi itthiṃ sāmikopi gehā nīharati, mātāpitūnaṃ santikaṃ gatampi ‘‘tvaṃ kulassa agāravabhūtā, akkhīhipi na daṭṭhabbā’’ti taṃ nīharanti. Sā anāthā vicarantī mahādukkhaṃ pāpuṇāti. Tenassā duccaritaṃ ‘‘mala’’nti vuttaṃ. Dadatoti dāyakassa. Yassa hi khettakasanakāle ‘‘imasmiṃ khette sampanne salākabhattādīni dassāmī’’ti cintetvā nipphanne sassepi maccheraṃ uppajjitvā cāgacittaṃ nivāreti, so maccheravasena cāgacitte avirūhante manussasampattiṃ dibbasampattiṃ nibbānasampattinti tisso sampattiyo na labhati. Tena vuttaṃ – ‘‘maccheraṃ dadato mala’’nti. Sesesupi eseva nayo. Pāpakā dhammāti akusaladhammā pana idhaloke ca paraloke ca malameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tato"
      },
      "ti heṭṭhā vuttamalato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Malatara"
      },
      "nti atirekamalaṃ vo kathemīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avijjā"
      },
      "ti ",
      " aṭṭhavatthukaṃ aññāṇameva paramaṃ malaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pahantvānā"
      },
      "ti ",
      " etaṃ malaṃ jahitvā, bhikkhave, tumhe nimmalā hothāti attho."
    ],
    "innerText": "Tatoti heṭṭhā vuttamalato. Malataranti atirekamalaṃ vo kathemīti attho. Avijjāti aṭṭhavatthukaṃ aññāṇameva paramaṃ malaṃ. Pahantvānāti etaṃ malaṃ jahitvā, bhikkhave, tumhe nimmalā hothāti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Desanāvasāne bahū sotāpattiphalādīni pāpuṇiṃsūti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Aññatarakulaputtavatthu pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Cūḷasārivatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sujīva"
      },
      "nti imaṃ dhammadesanaṃ satthā jetavane viharanto cūḷasāriṃ nāma sāriputtattherassa saddhivihārikaṃ ārabbha kathesi."
    ],
    "innerText": "Sujīvanti imaṃ dhammadesanaṃ satthā jetavane viharanto cūḷasāriṃ nāma sāriputtattherassa saddhivihārikaṃ ārabbha kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "So kira ekadivase vejjakammaṃ katvā paṇītabhojanaṃ labhitvā ādāya nikkhamanto antarāmagge theraṃ disvā, ‘‘bhante, idaṃ mayā vejjakammaṃ katvā laddhaṃ, tumhe aññattha evarūpaṃ bhojanaṃ na labhissatha, imaṃ bhuñjatha, ahaṃ te vejjakammaṃ katvā niccakālaṃ evarūpaṃ āhāraṃ āharissāmī’’ti āha. Thero tassa vacanaṃ sutvā tuṇhībhūtova pakkāmi. Bhikkhū vihāraṃ gantvā satthu tamatthaṃ ārocesuṃ. Satthā, ‘‘bhikkhave, ahiriko nāma pagabbho kākasadiso hutvā ekavīsatividhāya anesanāya ṭhatvā sukhaṃ jīvati, hiriottappasampanno pana dukkhaṃ jīvatī’’ti vatvā imā gāthā abhāsi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "244"
      },
      "."
    ],
    "innerText": "244."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " ‘‘Sujīvaṃ ",
      " ahirikena, kākasūrena dhaṃsinā;"
    ],
    "innerText": "‘‘Sujīvaṃ ahirikena, kākasūrena dhaṃsinā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pakkhandinā pagabbhena, saṃkiliṭṭhena jīvitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "245"
      },
      "."
    ],
    "innerText": "245."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " ‘‘Hirīmatā ",
      " ca dujjīvaṃ, niccaṃ sucigavesinā;"
    ],
    "innerText": "‘‘Hirīmatā ca dujjīvaṃ, niccaṃ sucigavesinā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Alīnenāppagabbhena, suddhājīvena passatā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ahirikenā"
      },
      "ti chinnahirottappakena. Evarūpena hi amātarameva ‘‘mātā me’’ti apitādayo eva ca ‘‘pitā me’’tiādinā nayena vatvā ekavīsatividhāya anesanāya patiṭṭhāya sukhena jīvatuṃ sakkā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kākasūrenā"
      },
      "ti sūrakākasadisena. Yathā hi sūrakāko kulagharesu yāguādīni gaṇhitukāmo bhittiādīsu nisīditvā attano olokanabhāvaṃ ñatvā anolokento viya aññavihitako viya ",
      " niddāyanto viya ca hutvā manussānaṃ pamādaṃ sallakkhetvā anupatitvā ‘‘sūsū’’ti vadantesuyeva bhājanato mukhapūraṃ gahetvā palāyati, evamevaṃ ahirikapuggalopi bhikkhūhi saddhiṃ gāmaṃ pavisitvā yāgubhattaṭṭhānādīni vavatthapeti. Tattha bhikkhū piṇḍāya caritvā yāpanamattaṃ ādāya āsanasālaṃ gantvā paccavekkhantā yāguṃ pivitvā kammaṭṭhānaṃ manasi karonti sajjhāyanti āsanasālaṃ sammajjanti. Ayaṃ pana akatvā gāmābhimukhova hoti."
    ],
    "innerText": "Tattha ahirikenāti chinnahirottappakena. Evarūpena hi amātarameva ‘‘mātā me’’ti apitādayo eva ca ‘‘pitā me’’tiādinā nayena vatvā ekavīsatividhāya anesanāya patiṭṭhāya sukhena jīvatuṃ sakkā. Kākasūrenāti sūrakākasadisena. Yathā hi sūrakāko kulagharesu yāguādīni gaṇhitukāmo bhittiādīsu nisīditvā attano olokanabhāvaṃ ñatvā anolokento viya aññavihitako viya niddāyanto viya ca hutvā manussānaṃ pamādaṃ sallakkhetvā anupatitvā ‘‘sūsū’’ti vadantesuyeva bhājanato mukhapūraṃ gahetvā palāyati, evamevaṃ ahirikapuggalopi bhikkhūhi saddhiṃ gāmaṃ pavisitvā yāgubhattaṭṭhānādīni vavatthapeti. Tattha bhikkhū piṇḍāya caritvā yāpanamattaṃ ādāya āsanasālaṃ gantvā paccavekkhantā yāguṃ pivitvā kammaṭṭhānaṃ manasi karonti sajjhāyanti āsanasālaṃ sammajjanti. Ayaṃ pana akatvā gāmābhimukhova hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "So hi bhikkhūhi ‘‘passathima’’nti olokiyamānopi anolokento viya aññavihito viya niddāyanto viya gaṇṭhikaṃ paṭimuñcanto ",
      " viya cīvaraṃ saṃvidahanto viya hutvā ‘‘asukaṃ nāma me kammaṃ atthī’’ti vadanto uṭṭhāyāsanā gāmaṃ pavisitvā pātova vavatthapitagehesu aññataraṃ gehaṃ upasaṅkamitvā gharamānusakesu thokaṃ kavāṭaṃ pidhāya dvāre nisīditvā kandantesupi ekena hatthena kavāṭaṃ paṇāmetvā anto pavisati. Atha naṃ disvā akāmakāpi āsane nisīdāpetvā yāguādīsu yaṃ atthi, taṃ denti. So yāvadatthaṃ bhuñjitvā avasesaṃ pattenādāya pakkamati. Ayaṃ kākasūro nāma. Evarūpena ahirikena sujīvanti attho."
    ],
    "innerText": "So hi bhikkhūhi ‘‘passathima’’nti olokiyamānopi anolokento viya aññavihito viya niddāyanto viya gaṇṭhikaṃ paṭimuñcanto viya cīvaraṃ saṃvidahanto viya hutvā ‘‘asukaṃ nāma me kammaṃ atthī’’ti vadanto uṭṭhāyāsanā gāmaṃ pavisitvā pātova vavatthapitagehesu aññataraṃ gehaṃ upasaṅkamitvā gharamānusakesu thokaṃ kavāṭaṃ pidhāya dvāre nisīditvā kandantesupi ekena hatthena kavāṭaṃ paṇāmetvā anto pavisati. Atha naṃ disvā akāmakāpi āsane nisīdāpetvā yāguādīsu yaṃ atthi, taṃ denti. So yāvadatthaṃ bhuñjitvā avasesaṃ pattenādāya pakkamati. Ayaṃ kākasūro nāma. Evarūpena ahirikena sujīvanti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhaṃsinā"
      },
      "ti ‘‘asukatthero nāma appiccho’’tiādīni vadantesu – ‘‘kiṃ pana mayaṃ na appicchā’’tiādivacanena paresaṃ guṇadhaṃsanatāya dhaṃsinā. Tathārūpassa vacanaṃ sutvā ‘‘ayampi appicchatādiguṇe yutto’’ti maññamānā manussā dātabbaṃ maññanti. So pana tato paṭṭhāya viññūpurisānaṃ ",
      " cittaṃ ārādhetuṃ asakkonto tamhāpi lābhā parihāyati. Evaṃ dhaṃsipuggalo attanopi parassapi lābhaṃ nāsetiyeva."
    ],
    "innerText": "Dhaṃsināti ‘‘asukatthero nāma appiccho’’tiādīni vadantesu – ‘‘kiṃ pana mayaṃ na appicchā’’tiādivacanena paresaṃ guṇadhaṃsanatāya dhaṃsinā. Tathārūpassa vacanaṃ sutvā ‘‘ayampi appicchatādiguṇe yutto’’ti maññamānā manussā dātabbaṃ maññanti. So pana tato paṭṭhāya viññūpurisānaṃ cittaṃ ārādhetuṃ asakkonto tamhāpi lābhā parihāyati. Evaṃ dhaṃsipuggalo attanopi parassapi lābhaṃ nāsetiyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pakkhandinā"
      },
      "ti pakkhandacārinā. Paresaṃ kiccānipi attano kiccāni viya dassento pātova bhikkhūsu cetiyaṅgaṇādīsu vattaṃ katvā kammaṭṭhānamanasikārena thokaṃ ",
      " nisīditvā uṭṭhāya gāmaṃ pavisantesu mukhaṃ dhovitvā paṇḍukāsāvapārupanaakkhiañjanasīsamakkhanādīhi attabhāvaṃ maṇḍetvā sammajjanto viya dve tayo sammajjanipahāre datvā dvārakoṭṭhakābhimukho hoti. Manussā pātova ‘‘cetiyaṃ vandissāma, mālāpūjaṃ karissāmā’’ti ",
      " āgatā taṃ disvā ‘‘ayaṃ vihāro imaṃ daharaṃ nissāya paṭijagganaṃ labhati, imaṃ mā pamajjitthā’’ti vatvā tassa dātabbaṃ maññanti. Evarūpena pakkhandināpi sujīvaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pagabbhenā"
      },
      "ti kāyapāgabbhiyādīhi samannāgatena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṃkiliṭṭhena jīvita"
      },
      "nti evaṃ jīvikaṃ kappetvā jīvantena hi puggalena saṃkiliṭṭhena hutvā jīvitaṃ nāma hoti, taṃ dujjīvitaṃ pāpamevāti attho."
    ],
    "innerText": "Pakkhandināti pakkhandacārinā. Paresaṃ kiccānipi attano kiccāni viya dassento pātova bhikkhūsu cetiyaṅgaṇādīsu vattaṃ katvā kammaṭṭhānamanasikārena thokaṃ nisīditvā uṭṭhāya gāmaṃ pavisantesu mukhaṃ dhovitvā paṇḍukāsāvapārupanaakkhiañjanasīsamakkhanādīhi attabhāvaṃ maṇḍetvā sammajjanto viya dve tayo sammajjanipahāre datvā dvārakoṭṭhakābhimukho hoti. Manussā pātova ‘‘cetiyaṃ vandissāma, mālāpūjaṃ karissāmā’’ti āgatā taṃ disvā ‘‘ayaṃ vihāro imaṃ daharaṃ nissāya paṭijagganaṃ labhati, imaṃ mā pamajjitthā’’ti vatvā tassa dātabbaṃ maññanti. Evarūpena pakkhandināpi sujīvaṃ. Pagabbhenāti kāyapāgabbhiyādīhi samannāgatena. Saṃkiliṭṭhena jīvitanti evaṃ jīvikaṃ kappetvā jīvantena hi puggalena saṃkiliṭṭhena hutvā jīvitaṃ nāma hoti, taṃ dujjīvitaṃ pāpamevāti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hirīmatā cā"
      },
      "ti hirottappasampannena puggalena dujjīvaṃ. So hi amātādayova ‘‘mātā me’’tiādīni avatvā adhammike paccaye gūthaṃ viya jigucchanto dhammena samena pariyesanto sapadānaṃ piṇḍāya caritvā jīvikaṃ kappento lūkhaṃ jīvikaṃ jīvatīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sucigavesinā"
      },
      "ti sucīni kāyakammādīni gavesantena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Alīnenā"
      },
      "ti jīvitavuttimanallīnena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suddhājīvena passatā"
      },
      "ti ",
      " evarūpo hi puggalo suddhājīvo nāma hoti. Tena evaṃ suddhājīvena tameva suddhājīvaṃ sārato passatā lūkhajīvitavasena dujjīvaṃ hotīti attho."
    ],
    "innerText": "Hirīmatā cāti hirottappasampannena puggalena dujjīvaṃ. So hi amātādayova ‘‘mātā me’’tiādīni avatvā adhammike paccaye gūthaṃ viya jigucchanto dhammena samena pariyesanto sapadānaṃ piṇḍāya caritvā jīvikaṃ kappento lūkhaṃ jīvikaṃ jīvatīti attho. Sucigavesināti sucīni kāyakammādīni gavesantena. Alīnenāti jīvitavuttimanallīnena. Suddhājīvena passatāti evarūpo hi puggalo suddhājīvo nāma hoti. Tena evaṃ suddhājīvena tameva suddhājīvaṃ sārato passatā lūkhajīvitavasena dujjīvaṃ hotīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Desanāvasāne bahū sotāpattiphalādīni pāpuṇiṃsūti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Cūḷasārivatthu chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Pañcaupāsakavatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yo pāṇa"
      },
      "nti imaṃ dhammadesanaṃ satthā jetavane viharanto pañca upāsake ārabbha kathesi."
    ],
    "innerText": "Yo pāṇanti imaṃ dhammadesanaṃ satthā jetavane viharanto pañca upāsake ārabbha kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tesu hi eko pāṇātipātāveramaṇisikkhāpadameva rakkhati, itare itarāni. Te ekadivasaṃ ‘‘ahaṃ dukkaraṃ karomi, dukkaraṃ rakkhāmī’’ti vivādāpannā satthu santikaṃ gantvā vanditvā ",
      " tamatthaṃ ārocesuṃ. Satthā tesaṃ kathaṃ sutvā ekasīlampi kaniṭṭhakaṃ akatvā ‘‘sabbāneva durakkhānī’’ti vatvā imā gāthā abhāsi –"
    ],
    "innerText": "Tesu hi eko pāṇātipātāveramaṇisikkhāpadameva rakkhati, itare itarāni. Te ekadivasaṃ ‘‘ahaṃ dukkaraṃ karomi, dukkaraṃ rakkhāmī’’ti vivādāpannā satthu santikaṃ gantvā vanditvā tamatthaṃ ārocesuṃ. Satthā tesaṃ kathaṃ sutvā ekasīlampi kaniṭṭhakaṃ akatvā ‘‘sabbāneva durakkhānī’’ti vatvā imā gāthā abhāsi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "246"
      },
      "."
    ],
    "innerText": "246."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yo pāṇamatipāteti, musāvādañca bhāsati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Loke adinnamādiyati, paradārañca gacchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "247"
      },
      "."
    ],
    "innerText": "247."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " ‘‘Surāmerayapānañca ",
      ", yo naro anuyuñjati;"
    ],
    "innerText": "‘‘Surāmerayapānañca , yo naro anuyuñjati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Idheva meso lokasmiṃ, mūlaṃ khaṇati attano."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "248"
      },
      "."
    ],
    "innerText": "248."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Evaṃ bho purisa jānāhi, pāpadhammā asaññatā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Mā taṃ lobho adhammo ca, ciraṃ dukkhāya randhayu’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yo pāṇamatipātetī"
      },
      "ti yo sāhatthikādīsu chasu payogesu ekapayogenāpi parassa jīvitindriyaṃ upacchindati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Musāvāda"
      },
      "nti paresaṃ atthabhañjanakaṃ musāvādañca bhāsati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Loke adinnamādiyatī"
      },
      "ti imasmiṃ sattaloke theyyāvahārādīsu ekenapi avahārena parapariggahitaṃ ādiyati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paradārañca gacchatī"
      },
      "ti parassa rakkhitagopitesu bhaṇḍesu aparajjhanto uppathacāraṃ carati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Surāmerayapāna"
      },
      "nti yassa kassaci surāya ceva merayassa ca pānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anuyuñjatī"
      },
      "ti sevati bahulīkaroti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mūlaṃ khaṇatī"
      },
      "ti tiṭṭhatu paraloko, so pana puggalo idha lokasmiṃyeva yena khettavatthuādinā mūlena patiṭṭhapeyya, tampi aṭṭhapetvā vā vissajjetvā vā suraṃ pivanto attano mūlaṃ khaṇati, anātho kapaṇo hutvā vicarati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ, bho"
      },
      "ti pañcadussīlyakammakārakaṃ puggalaṃ ālapati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāpadhammā"
      },
      "ti lāmakadhammā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asaññatā"
      },
      "ti kāyasaññatādirahitā. Acetasātipi pāṭho, acittakāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lobho adhammo cā"
      },
      "ti lobho ceva doso ca. Ubhayampi hetaṃ akusalameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ciraṃ dukkhāya randhayu"
      },
      "nti cirakālaṃ nirayadukkhādīnaṃ atthāya ",
      " taṃ ete dhammā mā randhentu mā matthentūti attho."
    ],
    "innerText": "Tattha yo pāṇamatipātetīti yo sāhatthikādīsu chasu payogesu ekapayogenāpi parassa jīvitindriyaṃ upacchindati. Musāvādanti paresaṃ atthabhañjanakaṃ musāvādañca bhāsati. Loke adinnamādiyatīti imasmiṃ sattaloke theyyāvahārādīsu ekenapi avahārena parapariggahitaṃ ādiyati. Paradārañca gacchatīti parassa rakkhitagopitesu bhaṇḍesu aparajjhanto uppathacāraṃ carati. Surāmerayapānanti yassa kassaci surāya ceva merayassa ca pānaṃ. Anuyuñjatīti sevati bahulīkaroti. Mūlaṃ khaṇatīti tiṭṭhatu paraloko, so pana puggalo idha lokasmiṃyeva yena khettavatthuādinā mūlena patiṭṭhapeyya, tampi aṭṭhapetvā vā vissajjetvā vā suraṃ pivanto attano mūlaṃ khaṇati, anātho kapaṇo hutvā vicarati. Evaṃ, bhoti pañcadussīlyakammakārakaṃ puggalaṃ ālapati. Pāpadhammāti lāmakadhammā. Asaññatāti kāyasaññatādirahitā. Acetasātipi pāṭho, acittakāti attho. Lobho adhammo cāti lobho ceva doso ca. Ubhayampi hetaṃ akusalameva. Ciraṃ dukkhāya randhayunti cirakālaṃ nirayadukkhādīnaṃ atthāya taṃ ete dhammā mā randhentu mā matthentūti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Desanāvasāne te pañca upāsakā sotāpattiphale patiṭṭhahiṃsu, sampattānampi sātthikā dhammadesanā ahosīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pañcaupāsakavatthu sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Tissadaharavatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dadāti"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ve"
      },
      "ti imaṃ dhammadesanaṃ satthā jetavane viharanto tissadaharaṃ nāma ārabbha kathesi."
    ],
    "innerText": "Dadātiveti imaṃ dhammadesanaṃ satthā jetavane viharanto tissadaharaṃ nāma ārabbha kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "So ",
      " kira anāthapiṇḍikassa gahapatino visākhāya upāsikāyāti pañcannaṃ ariyasāvakakoṭīnaṃ dānaṃ nindanto vicari, asadisadānampi nindiyeva. Tesaṃ tesaṃ dānagge sītalaṃ labhitvā ‘‘sītala’’nti nindi, uṇhaṃ labhitvā ‘‘uṇha’’nti nindi. Appaṃ dentepi ‘‘kiṃ ime appamattakaṃ dentī’’ti nindi, bahuṃ dentepi ‘‘imesaṃ gehe ṭhapanaṭṭhānaṃ maññe natthi, nanu nāma bhikkhūnaṃ yāpanamattaṃ dātabbaṃ, ettakaṃ yāgubhattaṃ niratthakameva vissajjatī’’ti nindi. Attano pana ñātake ārabbha ‘‘aho amhākaṃ ñātakānaṃ gehaṃ catūhi disāhi āgatāgatānaṃ bhikkhūnaṃ opānabhūta’’ntiādīni vatvā pasaṃsaṃ ",
      " pavattesi. So panekassa dovārikassa putto janapadaṃ vicarantehi vaḍḍhakīhi saddhiṃ vicaranto sāvatthiṃ patvā pabbajito. Atha naṃ bhikkhū evaṃ manussānaṃ dānādīni nindantaṃ disvā ‘‘pariggaṇhissāma na’’nti cintetvā, ‘‘āvuso, tava ñātakā kahaṃ vasantī’’ti pucchitvā ‘‘asukagāme nāmā’’ti sutvāva katipaye dahare pesesuṃ. Te tattha gantvā gāmavāsikehi āsanasālāya nisīdāpetvā katasakkārā pucchiṃsu – ‘‘imamhā gāmā nikkhamitvā pabbajito tisso nāma daharo atthi. Tassa katame ñātakā’’ti? Manussā ‘‘idha kulagehato nikkhamitvā pabbajitadārako natthi, kiṃ nu kho ime vadantī’’ti cintetvā, ‘‘bhante, eko dovārikaputto vaḍḍhakīhi saddhiṃ vicaritvā pabbajitoti suṇoma, taṃ sandhāya vadetha maññe’’ti āhaṃsu. Daharabhikkhū tissassa tattha issarañātakānaṃ abhāvaṃ ñatvā sāvatthiṃ gantvā ‘‘akāraṇameva, bhante, tisso vilapanto vicaratī’’ti taṃ pavattiṃ bhikkhūnaṃ ārocesuṃ. Bhikkhūpi taṃ tathāgatassa ārocesuṃ."
    ],
    "innerText": "So kira anāthapiṇḍikassa gahapatino visākhāya upāsikāyāti pañcannaṃ ariyasāvakakoṭīnaṃ dānaṃ nindanto vicari, asadisadānampi nindiyeva. Tesaṃ tesaṃ dānagge sītalaṃ labhitvā ‘‘sītala’’nti nindi, uṇhaṃ labhitvā ‘‘uṇha’’nti nindi. Appaṃ dentepi ‘‘kiṃ ime appamattakaṃ dentī’’ti nindi, bahuṃ dentepi ‘‘imesaṃ gehe ṭhapanaṭṭhānaṃ maññe natthi, nanu nāma bhikkhūnaṃ yāpanamattaṃ dātabbaṃ, ettakaṃ yāgubhattaṃ niratthakameva vissajjatī’’ti nindi. Attano pana ñātake ārabbha ‘‘aho amhākaṃ ñātakānaṃ gehaṃ catūhi disāhi āgatāgatānaṃ bhikkhūnaṃ opānabhūta’’ntiādīni vatvā pasaṃsaṃ pavattesi. So panekassa dovārikassa putto janapadaṃ vicarantehi vaḍḍhakīhi saddhiṃ vicaranto sāvatthiṃ patvā pabbajito. Atha naṃ bhikkhū evaṃ manussānaṃ dānādīni nindantaṃ disvā ‘‘pariggaṇhissāma na’’nti cintetvā, ‘‘āvuso, tava ñātakā kahaṃ vasantī’’ti pucchitvā ‘‘asukagāme nāmā’’ti sutvāva katipaye dahare pesesuṃ. Te tattha gantvā gāmavāsikehi āsanasālāya nisīdāpetvā katasakkārā pucchiṃsu – ‘‘imamhā gāmā nikkhamitvā pabbajito tisso nāma daharo atthi. Tassa katame ñātakā’’ti? Manussā ‘‘idha kulagehato nikkhamitvā pabbajitadārako natthi, kiṃ nu kho ime vadantī’’ti cintetvā, ‘‘bhante, eko dovārikaputto vaḍḍhakīhi saddhiṃ vicaritvā pabbajitoti suṇoma, taṃ sandhāya vadetha maññe’’ti āhaṃsu. Daharabhikkhū tissassa tattha issarañātakānaṃ abhāvaṃ ñatvā sāvatthiṃ gantvā ‘‘akāraṇameva, bhante, tisso vilapanto vicaratī’’ti taṃ pavattiṃ bhikkhūnaṃ ārocesuṃ. Bhikkhūpi taṃ tathāgatassa ārocesuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Satthā ‘‘na, bhikkhave, idāneva vikatthento vicarati, pubbepi vikatthakova ahosī’’ti vatvā bhikkhūhi yācito atītaṃ āharitvā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Bahumpi so vikattheyya, aññaṃ janapadaṃ gato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Anvāgantvāna dūseyya, bhuñja bhoge kaṭāhakā’’ti. (jā. 1.1.125) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Imaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kaṭāhajātakaṃ"
      },
      " vitthāretvā, ‘‘bhikkhave, yo hi puggalo parehi appake vā bahuke vā lūkhe vā paṇīte vā dinne aññesaṃ vā datvā attano ",
      " adinne maṅku hoti, tassa jhānaṃ ",
      " vā ",
      " vipassanaṃ vā maggaphalādīni vā na uppajjantī’’ti vatvā dhammaṃ desento imā gāthā abhāsi –"
    ],
    "innerText": "Imaṃ kaṭāhajātakaṃ vitthāretvā, ‘‘bhikkhave, yo hi puggalo parehi appake vā bahuke vā lūkhe vā paṇīte vā dinne aññesaṃ vā datvā attano adinne maṅku hoti, tassa jhānaṃ vā vipassanaṃ vā maggaphalādīni vā na uppajjantī’’ti vatvā dhammaṃ desento imā gāthā abhāsi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "249"
      },
      "."
    ],
    "innerText": "249."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Dadāti ve yathāsaddhaṃ, yathāpasādanaṃ jano;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Tattha yo ca maṅku hoti, paresaṃ pānabhojane;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Na so divā vā rattiṃ vā, samādhimadhigacchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "250"
      },
      "."
    ],
    "innerText": "250."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yassa cetaṃ samucchinnaṃ, mūlaghaccaṃ samūhataṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sa ve divā vā rattiṃ vā, samādhimadhigacchatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dadāti ve yathāsaddha"
      },
      "nti lūkhapaṇītādīsu yaṃkiñci dento jano yathāsaddhaṃ attano saddhānurūpameva deti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathāpasādana"
      },
      "nti theranavādīsu cassa yasmiṃ yasmiṃ pasādo uppajjati, tassa dento yathāpasādanaṃ attano pasādānurūpameva deti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatthā"
      },
      "ti tasmiṃ parassa dāne ‘‘mayā appaṃ vā laddhaṃ, lūkhaṃ vā laddha’’nti maṅkubhāvaṃ āpajjati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samādhi"
      },
      "nti so puggalo divā vā rattiṃ vā upacārappanāvasena vā maggaphalavasena vā samādhiṃ nādhigacchati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yassa ceta"
      },
      "nti yassa puggalassa etaṃ ekesu ṭhānesu maṅkubhāvasaṅkhātaṃ akusalaṃ samucchinnaṃ mūlaghaccaṃ katvā arahattamaggañāṇena samūhataṃ, so vuttappakāraṃ samādhiṃ adhigacchatīti attho."
    ],
    "innerText": "Tattha dadāti ve yathāsaddhanti lūkhapaṇītādīsu yaṃkiñci dento jano yathāsaddhaṃ attano saddhānurūpameva deti. Yathāpasādananti theranavādīsu cassa yasmiṃ yasmiṃ pasādo uppajjati, tassa dento yathāpasādanaṃ attano pasādānurūpameva deti. Tatthāti tasmiṃ parassa dāne ‘‘mayā appaṃ vā laddhaṃ, lūkhaṃ vā laddha’’nti maṅkubhāvaṃ āpajjati. Samādhinti so puggalo divā vā rattiṃ vā upacārappanāvasena vā maggaphalavasena vā samādhiṃ nādhigacchati. Yassa cetanti yassa puggalassa etaṃ ekesu ṭhānesu maṅkubhāvasaṅkhātaṃ akusalaṃ samucchinnaṃ mūlaghaccaṃ katvā arahattamaggañāṇena samūhataṃ, so vuttappakāraṃ samādhiṃ adhigacchatīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Desanāvasāne bahū sotāpattiphalādīni pāpuṇiṃsūti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tissadaharavatthu aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Pañcaupāsakavatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Natthi"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rāgasamo aggī"
      },
      "ti imaṃ dhammadesanaṃ satthā jetavane viharanto pañca upāsake ārabbha kathesi."
    ],
    "innerText": "Natthirāgasamo aggīti imaṃ dhammadesanaṃ satthā jetavane viharanto pañca upāsake ārabbha kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Te kira dhammaṃ sotukāmā vihāraṃ gantvā satthāraṃ vanditvā ekamantaṃ nisīdiṃsu. Buddhānañca ‘‘ayaṃ khattiyo, ayaṃ brāhmaṇo, ayaṃ aḍḍho, ayaṃ duggato, imassa uḷāraṃ katvā dhammaṃ desessāmi, imassa no’’ti cittaṃ na uppajjati. Yaṃkiñci ārabbha dhammaṃ desento dhammagāravaṃ ",
      " purakkhatvā ākāsagaṅgaṃ ",
      " otārento viya deseti. Evaṃ desentassa pana tathāgatassa santike nisinnānaṃ tesaṃ eko nisinnakova niddāyi, eko aṅguliyā bhūmiṃ likhanto nisīdi, eko ekaṃ rukkhaṃ cālento nisīdi, eko ākāsaṃ ullokento nisīdi, eko pana sakkaccaṃ dhammaṃ assosi."
    ],
    "innerText": "Te kira dhammaṃ sotukāmā vihāraṃ gantvā satthāraṃ vanditvā ekamantaṃ nisīdiṃsu. Buddhānañca ‘‘ayaṃ khattiyo, ayaṃ brāhmaṇo, ayaṃ aḍḍho, ayaṃ duggato, imassa uḷāraṃ katvā dhammaṃ desessāmi, imassa no’’ti cittaṃ na uppajjati. Yaṃkiñci ārabbha dhammaṃ desento dhammagāravaṃ purakkhatvā ākāsagaṅgaṃ otārento viya deseti. Evaṃ desentassa pana tathāgatassa santike nisinnānaṃ tesaṃ eko nisinnakova niddāyi, eko aṅguliyā bhūmiṃ likhanto nisīdi, eko ekaṃ rukkhaṃ cālento nisīdi, eko ākāsaṃ ullokento nisīdi, eko pana sakkaccaṃ dhammaṃ assosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ānandatthero satthāraṃ bījayamāno tesaṃ ākāraṃ olokento satthāraṃ āha – ‘‘bhante, tumhe imesaṃ mahāmeghagajjitaṃ gajjantā viya dhammaṃ desetha, ete pana tumhesupi dhammaṃ kathentesu idañcidañca karontā nisinnā’’ti. ‘‘Ānanda, tvaṃ ete na jānāsī’’ti? ‘‘Āma, na jānāmi, bhante’’ti. Etesu hi yo esa niddāyanto nisinno, esa pañca jātisatāni sappayoniyaṃ nibbattitvā bhogesu sīsaṃ ṭhapetvā niddāyi, idānipissa niddāya titti natthi, nāssa kaṇṇaṃ ",
      " mama saddo pavisatīti. Kiṃ pana, bhante, paṭipāṭiyā kathetha, udāhu antarantarāti. Ānanda, etassa hi kālena manussattaṃ, kālena devattaṃ, kālena nāgattanti evaṃ antarantarā uppajjantassa upapattiyo sabbaññutaññāṇenāpi na sakkā paricchindituṃ. Paṭipāṭiyā panesa pañca jātisatāni nāgayoniyaṃ nibbattitvā niddāyantopi niddāya atittoyeva. Aṅguliyā bhūmiṃ likhanto nisinnapurisopi pañca jātisatāni gaṇḍuppādayoniyaṃ nibbattitvā bhūmiṃ khaṇi, idānipi bhūmiṃ khaṇantova mama saddaṃ na suṇāti. Esa rukkhaṃ cālento nisinnapurisopi paṭipāṭiyā pañca jātisatāni makkaṭayoniyaṃ nibbatti, idānipi pubbāciṇṇavasena rukkhaṃ cāletiyeva, nāssa kaṇṇaṃ mama saddo pavisati. Esa ākāsaṃ ulloketvā nisinnapurisopi pañca jātisatāni nakkhattapāṭhako hutvā nibbatti, idāni pubbāciṇṇavasena ajjāpi ākāsameva ulloketi, nāssa kaṇṇaṃ mama saddo pavisati. Esa sakkaccaṃ dhammaṃ suṇanto nisinnapuriso pana paṭipāṭiyā pañca jātisatāni tiṇṇaṃ vedānaṃ pāragū mantajjhāyakabrāhmaṇo hutvā nibbatti, idānipi mantaṃ saṃsandanto viya sakkaccaṃ suṇātīti."
    ],
    "innerText": "Ānandatthero satthāraṃ bījayamāno tesaṃ ākāraṃ olokento satthāraṃ āha – ‘‘bhante, tumhe imesaṃ mahāmeghagajjitaṃ gajjantā viya dhammaṃ desetha, ete pana tumhesupi dhammaṃ kathentesu idañcidañca karontā nisinnā’’ti. ‘‘Ānanda, tvaṃ ete na jānāsī’’ti? ‘‘Āma, na jānāmi, bhante’’ti. Etesu hi yo esa niddāyanto nisinno, esa pañca jātisatāni sappayoniyaṃ nibbattitvā bhogesu sīsaṃ ṭhapetvā niddāyi, idānipissa niddāya titti natthi, nāssa kaṇṇaṃ mama saddo pavisatīti. Kiṃ pana, bhante, paṭipāṭiyā kathetha, udāhu antarantarāti. Ānanda, etassa hi kālena manussattaṃ, kālena devattaṃ, kālena nāgattanti evaṃ antarantarā uppajjantassa upapattiyo sabbaññutaññāṇenāpi na sakkā paricchindituṃ. Paṭipāṭiyā panesa pañca jātisatāni nāgayoniyaṃ nibbattitvā niddāyantopi niddāya atittoyeva. Aṅguliyā bhūmiṃ likhanto nisinnapurisopi pañca jātisatāni gaṇḍuppādayoniyaṃ nibbattitvā bhūmiṃ khaṇi, idānipi bhūmiṃ khaṇantova mama saddaṃ na suṇāti. Esa rukkhaṃ cālento nisinnapurisopi paṭipāṭiyā pañca jātisatāni makkaṭayoniyaṃ nibbatti, idānipi pubbāciṇṇavasena rukkhaṃ cāletiyeva, nāssa kaṇṇaṃ mama saddo pavisati. Esa ākāsaṃ ulloketvā nisinnapurisopi pañca jātisatāni nakkhattapāṭhako hutvā nibbatti, idāni pubbāciṇṇavasena ajjāpi ākāsameva ulloketi, nāssa kaṇṇaṃ mama saddo pavisati. Esa sakkaccaṃ dhammaṃ suṇanto nisinnapuriso pana paṭipāṭiyā pañca jātisatāni tiṇṇaṃ vedānaṃ pāragū mantajjhāyakabrāhmaṇo hutvā nibbatti, idānipi mantaṃ saṃsandanto viya sakkaccaṃ suṇātīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Bhante, tumhākaṃ dhammadesanā chaviādīni chinditvā aṭṭhimiñjaṃ āhacca tiṭṭhati, kasmā ime tumhesupi dhammaṃ desentesu sakkaccaṃ na suṇantī’’ti? ‘‘Ānanda, mama dhammo sussavanīyoti saññaṃ karosi maññe’’ti. ‘‘Kiṃ pana, bhante, dussavanīyo’’ti? ‘‘Āma, ānandā’’ti. ‘‘Kasmā, bhante’’ti ",
      "? ‘‘Ānanda, buddhoti ",
      " vā dhammoti vā saṅghoti vā padaṃ imehi sattehi anekesupi kappakoṭisatasahassesu asutapubbaṃ. Yasmā imaṃ dhammaṃ sotuṃ na sakkontā anamatagge saṃsāre ime sattā anekavihitaṃ tiracchānakathaṃyeva suṇantā āgatā, tasmā ",
      " surāpānakeḷimaṇḍalādīsu gāyantā naccantā vicaranti, dhammaṃ sotuṃ na sakkontī’’ti. ‘‘Kiṃ nissāya panete na sakkonti, bhante’’ti?"
    ],
    "innerText": "‘‘Bhante, tumhākaṃ dhammadesanā chaviādīni chinditvā aṭṭhimiñjaṃ āhacca tiṭṭhati, kasmā ime tumhesupi dhammaṃ desentesu sakkaccaṃ na suṇantī’’ti? ‘‘Ānanda, mama dhammo sussavanīyoti saññaṃ karosi maññe’’ti. ‘‘Kiṃ pana, bhante, dussavanīyo’’ti? ‘‘Āma, ānandā’’ti. ‘‘Kasmā, bhante’’ti ? ‘‘Ānanda, buddhoti vā dhammoti vā saṅghoti vā padaṃ imehi sattehi anekesupi kappakoṭisatasahassesu asutapubbaṃ. Yasmā imaṃ dhammaṃ sotuṃ na sakkontā anamatagge saṃsāre ime sattā anekavihitaṃ tiracchānakathaṃyeva suṇantā āgatā, tasmā surāpānakeḷimaṇḍalādīsu gāyantā naccantā vicaranti, dhammaṃ sotuṃ na sakkontī’’ti. ‘‘Kiṃ nissāya panete na sakkonti, bhante’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Athassa satthā, ‘‘ānanda, rāgaṃ nissāya dosaṃ nissāya mohaṃ nissāya taṇhaṃ nissāya na sakkonti. Rāgaggisadiso aggi nāma natthi, so chārikampi asesetvā satte dahati. Kiñcāpi sattasūriyapātubhāvaṃ nissāya uppanno kappavināsako aggipi kiñci anavasesetvāva lokaṃ dahati, so pana aggi kadāciyeva dahati. Rāgaggino adahanakālo nāma natthi, tasmā rāgasamo vā aggi dosasamo vā gaho mohasamaṃ vā jālaṃ taṇhāsamā vā nadī nāma natthī’’ti vatvā imaṃ gāthamāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "251"
      },
      "."
    ],
    "innerText": "251."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Natthi rāgasamo aggi, natthi dosasamo gaho;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Natthi mohasamaṃ jālaṃ, natthi taṇhāsamā nadī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rāgasamo"
      },
      "ti dhūmādīsu kiñci adassetvā antoyeva uṭṭhāya jhāpanavasena rāgena samo aggi nāma natthi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dosasamo"
      },
      "ti yakkhagahaajagaragahakumbhilagahādayo ekasmiṃyeva attabhāve gaṇhituṃ sakkonti, dosagaho pana sabbattha ekantameva gaṇhātīti dosena samo ",
      " gaho nāma natthi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mohasama"
      },
      "nti onandhanapariyonandhanaṭṭhena pana mohasamaṃ jālaṃ nāma natthi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṇhāsamā"
      },
      "ti gaṅgādīnaṃ nadīnaṃ puṇṇakālopi ūnakālopi sukkhakālopi paññāyati, taṇhāya pana puṇṇakālo vā sukkhakālo vā natthi, niccaṃ ūnāva paññāyatīti duppūraṇaṭṭhena taṇhāya samā nadī nāma natthīti attho."
    ],
    "innerText": "Tattha rāgasamoti dhūmādīsu kiñci adassetvā antoyeva uṭṭhāya jhāpanavasena rāgena samo aggi nāma natthi. Dosasamoti yakkhagahaajagaragahakumbhilagahādayo ekasmiṃyeva attabhāve gaṇhituṃ sakkonti, dosagaho pana sabbattha ekantameva gaṇhātīti dosena samo gaho nāma natthi. Mohasamanti onandhanapariyonandhanaṭṭhena pana mohasamaṃ jālaṃ nāma natthi. Taṇhāsamāti gaṅgādīnaṃ nadīnaṃ puṇṇakālopi ūnakālopi sukkhakālopi paññāyati, taṇhāya pana puṇṇakālo vā sukkhakālo vā natthi, niccaṃ ūnāva paññāyatīti duppūraṇaṭṭhena taṇhāya samā nadī nāma natthīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Desanāvasāne sakkaccaṃ dhammaṃ suṇanto upāsako sotāpattiphale patiṭṭhahi, sampattānampi sātthikā dhammadesanā ahosīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pañcaupāsakavatthu navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Meṇḍakaseṭṭhivatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sudassaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vajja"
      },
      "nti imaṃ dhammadesanaṃ satthā bhaddiyanagaraṃ nissāya jātiyāvane viharanto meṇḍakaseṭṭhiṃ ārabbha kathesi."
    ],
    "innerText": "Sudassaṃvajjanti imaṃ dhammadesanaṃ satthā bhaddiyanagaraṃ nissāya jātiyāvane viharanto meṇḍakaseṭṭhiṃ ārabbha kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Satthā ",
      " kira aṅguttarāpesu cārikaṃ caranto meṇḍakaseṭṭhino ca, bhariyāya cassa candapadumāya, puttassa ca dhanañcayaseṭṭhino, suṇisāya ca sumanadeviyā, nattāya cassa visākhāya, dāsassa ca puṇṇassāti imesaṃ sotāpattiphalūpanissayaṃ disvā bhaddiyanagaraṃ gantvā jātiyāvane vihāsi. Meṇḍakaseṭṭhi satthu āgamanaṃ assosi. Kasmā ",
      " panesa meṇḍakaseṭṭhi nāma jātoti? Tassa kira pacchimagehe aṭṭhakarīsamatte ṭhāne hatthiassausabhapamāṇā suvaṇṇameṇḍakā pathaviṃ bhinditvā piṭṭhiyā piṭṭhiṃ paharamānā uṭṭhahiṃsu. Tesaṃ mukhesu pañcavaṇṇānaṃ suttānaṃ geṇḍukā pakkhittā honti. Sappitelamadhuphāṇitādīhi vā vatthacchādanahiraññasuvaṇṇādīhi vā atthe sati tesaṃ mukhato geṇḍuke apanenti, ekassāpi meṇḍakassa mukhato jambudīpavāsīnaṃ pahonakaṃ sappitelamadhuphāṇitavatthacchādanahiraññasuvaṇṇaṃ nikkhamati. Tato paṭṭhāya meṇḍakaseṭṭhīti paññāyi."
    ],
    "innerText": "Satthā kira aṅguttarāpesu cārikaṃ caranto meṇḍakaseṭṭhino ca, bhariyāya cassa candapadumāya, puttassa ca dhanañcayaseṭṭhino, suṇisāya ca sumanadeviyā, nattāya cassa visākhāya, dāsassa ca puṇṇassāti imesaṃ sotāpattiphalūpanissayaṃ disvā bhaddiyanagaraṃ gantvā jātiyāvane vihāsi. Meṇḍakaseṭṭhi satthu āgamanaṃ assosi. Kasmā panesa meṇḍakaseṭṭhi nāma jātoti? Tassa kira pacchimagehe aṭṭhakarīsamatte ṭhāne hatthiassausabhapamāṇā suvaṇṇameṇḍakā pathaviṃ bhinditvā piṭṭhiyā piṭṭhiṃ paharamānā uṭṭhahiṃsu. Tesaṃ mukhesu pañcavaṇṇānaṃ suttānaṃ geṇḍukā pakkhittā honti. Sappitelamadhuphāṇitādīhi vā vatthacchādanahiraññasuvaṇṇādīhi vā atthe sati tesaṃ mukhato geṇḍuke apanenti, ekassāpi meṇḍakassa mukhato jambudīpavāsīnaṃ pahonakaṃ sappitelamadhuphāṇitavatthacchādanahiraññasuvaṇṇaṃ nikkhamati. Tato paṭṭhāya meṇḍakaseṭṭhīti paññāyi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kiṃ panassa pubbakammanti? Vipassībuddhakāle kira esa avarojassa nāma kuṭumbikassa bhāgineyyo mātulena samānanāmo avarojo nāma ahosi. Athassa mātulo satthu gandhakuṭiṃ kātuṃ ārabhi. So tassa santikaṃ gantvā, ‘‘mātula, ubhopi saheva karomā’’ti vatvā ‘‘ahaṃ aññehi saddhiṃ asādhāraṇaṃ katvā ekakova karissāmī’’ti tena pana paṭikkhittakāle ‘‘imasmiṃ ṭhāne gandhakuṭiyā katāya imasmiṃ nāma ṭhāne kuñjarasālaṃ nāma laddhuṃ vaṭṭatī’’ti cintetvā araññato dabbasambhāre āharāpetvā ekaṃ thambhaṃ suvaṇṇakhacitaṃ, ekaṃ rajatakhacitaṃ, ekaṃ maṇikhacitaṃ, ekaṃ sattaratanakhacitanti evaṃ tulāsaṅghātadvārakavāṭavātapānagopānasīchadaniṭṭhakā sabbāpi suvaṇṇādikhacitāva kāretvā gandhakuṭiyā sammukhaṭṭhāne tathāgatassa sattaratanamayaṃ kuñjarasālaṃ kāresi. Tassā upari ghanarattasuvaṇṇamayā kambalā pavāḷamayā sikharathūpikāyo ahesuṃ. Kuñjarasālāya ",
      " majjhe ṭhāne ",
      " ratanamaṇḍapaṃ kāretvā dhammāsanaṃ patiṭṭhāpesi. Tassa ghanarattasuvaṇṇamayā pādā ahesuṃ, tathā catasso aṭaniyo. Cattāro pana suvaṇṇameṇḍake kārāpetvā āsanassa catunnaṃ pādānaṃ heṭṭhā ṭhapesi, dve meṇḍake kārāpetvā pādapīṭhakāya heṭṭhā ṭhapesi, cha suvaṇṇameṇḍake kārāpetvā maṇḍapaṃ parikkhipento ṭhapesi. Dhammāsanaṃ paṭhamaṃ suttamayehi rajjukehi vāyāpetvā majjhe suvaṇṇasuttamayehi upari muttamayehi suttehi vāyāpesi. Tassa candanamayo apassayo ahosi. Evaṃ kuñjarasālaṃ niṭṭhāpetvā sālāmahaṃ karonto aṭṭhasaṭṭhīhi bhikkhusatasahassehi saddhiṃ satthāraṃ nimantetvā cattāro māse dānaṃ datvā osānadivase ticīvaraṃ adāsi. Tattha saṅghanavakassa satasahassagghanikaṃ pāpuṇi."
    ],
    "innerText": "Kiṃ panassa pubbakammanti? Vipassībuddhakāle kira esa avarojassa nāma kuṭumbikassa bhāgineyyo mātulena samānanāmo avarojo nāma ahosi. Athassa mātulo satthu gandhakuṭiṃ kātuṃ ārabhi. So tassa santikaṃ gantvā, ‘‘mātula, ubhopi saheva karomā’’ti vatvā ‘‘ahaṃ aññehi saddhiṃ asādhāraṇaṃ katvā ekakova karissāmī’’ti tena pana paṭikkhittakāle ‘‘imasmiṃ ṭhāne gandhakuṭiyā katāya imasmiṃ nāma ṭhāne kuñjarasālaṃ nāma laddhuṃ vaṭṭatī’’ti cintetvā araññato dabbasambhāre āharāpetvā ekaṃ thambhaṃ suvaṇṇakhacitaṃ, ekaṃ rajatakhacitaṃ, ekaṃ maṇikhacitaṃ, ekaṃ sattaratanakhacitanti evaṃ tulāsaṅghātadvārakavāṭavātapānagopānasīchadaniṭṭhakā sabbāpi suvaṇṇādikhacitāva kāretvā gandhakuṭiyā sammukhaṭṭhāne tathāgatassa sattaratanamayaṃ kuñjarasālaṃ kāresi. Tassā upari ghanarattasuvaṇṇamayā kambalā pavāḷamayā sikharathūpikāyo ahesuṃ. Kuñjarasālāya majjhe ṭhāne ratanamaṇḍapaṃ kāretvā dhammāsanaṃ patiṭṭhāpesi. Tassa ghanarattasuvaṇṇamayā pādā ahesuṃ, tathā catasso aṭaniyo. Cattāro pana suvaṇṇameṇḍake kārāpetvā āsanassa catunnaṃ pādānaṃ heṭṭhā ṭhapesi, dve meṇḍake kārāpetvā pādapīṭhakāya heṭṭhā ṭhapesi, cha suvaṇṇameṇḍake kārāpetvā maṇḍapaṃ parikkhipento ṭhapesi. Dhammāsanaṃ paṭhamaṃ suttamayehi rajjukehi vāyāpetvā majjhe suvaṇṇasuttamayehi upari muttamayehi suttehi vāyāpesi. Tassa candanamayo apassayo ahosi. Evaṃ kuñjarasālaṃ niṭṭhāpetvā sālāmahaṃ karonto aṭṭhasaṭṭhīhi bhikkhusatasahassehi saddhiṃ satthāraṃ nimantetvā cattāro māse dānaṃ datvā osānadivase ticīvaraṃ adāsi. Tattha saṅghanavakassa satasahassagghanikaṃ pāpuṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ ",
      " vipassībuddhakāle puññakammaṃ katvā tato cuto devesu ca manussesu ca saṃsaranto imasmiṃ bhaddakappe bārāṇasiyaṃ mahābhogakule nibbattitvā bārāṇasiseṭṭhi nāma ahosi. So ekadivasaṃ rājūpaṭṭhānaṃ gacchanto purohitaṃ disvā ‘‘kiṃ, ācariya, nakkhattamuhuttaṃ, upadhārethā’’ti āha. Āma, upadhāremi, kiṃ aññaṃ amhākaṃ kammanti. Tena hi kīdisaṃ janapadacārittanti? Ekaṃ bhayaṃ ",
      " bhavissatīti. Kiṃ bhayaṃ nāmāti? Chātakabhayaṃ seṭṭhīti. Kadā bhavissatīti? Ito tiṇṇaṃ saṃvaccharānaṃ accayenāti. Taṃ sutvā seṭṭhi bahuṃ kasikammaṃ kāretvā gehe vijjamānadhanenāpi dhaññameva gahetvā aḍḍhaterasāni koṭṭhasatāni kāretvā sabbakoṭṭhake vīhīhi paripūresi. Koṭṭhesu appahontesu cāṭiādīni pūretvā avasesaṃ bhūmiyaṃ āvāṭe katvā nikhaṇi. Nidhānāvasesaṃ mattikāya saddhiṃ madditvā bhittiyo limpāpesi."
    ],
    "innerText": "Evaṃ vipassībuddhakāle puññakammaṃ katvā tato cuto devesu ca manussesu ca saṃsaranto imasmiṃ bhaddakappe bārāṇasiyaṃ mahābhogakule nibbattitvā bārāṇasiseṭṭhi nāma ahosi. So ekadivasaṃ rājūpaṭṭhānaṃ gacchanto purohitaṃ disvā ‘‘kiṃ, ācariya, nakkhattamuhuttaṃ, upadhārethā’’ti āha. Āma, upadhāremi, kiṃ aññaṃ amhākaṃ kammanti. Tena hi kīdisaṃ janapadacārittanti? Ekaṃ bhayaṃ bhavissatīti. Kiṃ bhayaṃ nāmāti? Chātakabhayaṃ seṭṭhīti. Kadā bhavissatīti? Ito tiṇṇaṃ saṃvaccharānaṃ accayenāti. Taṃ sutvā seṭṭhi bahuṃ kasikammaṃ kāretvā gehe vijjamānadhanenāpi dhaññameva gahetvā aḍḍhaterasāni koṭṭhasatāni kāretvā sabbakoṭṭhake vīhīhi paripūresi. Koṭṭhesu appahontesu cāṭiādīni pūretvā avasesaṃ bhūmiyaṃ āvāṭe katvā nikhaṇi. Nidhānāvasesaṃ mattikāya saddhiṃ madditvā bhittiyo limpāpesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "So aparena samayena chātakabhaye sampatte yathānikkhittaṃ dhaññaṃ paribhuñjanto koṭṭhesu ca cāṭiādīsu ca nikkhittadhaññe parikkhīṇe parijane pakkosāpetvā āha – ‘‘gacchatha, tātā, pabbatapādaṃ pavisitvā jīvantā subhikkhakāle mama santikaṃ āgantukāmā āgacchatha, anāgantukāmā tattha tattheva jīvathā’’ti. Te rodamānā assumukhā hutvā seṭṭhiṃ vanditvā khamāpetvā sattāhaṃ nisīditvā tathā akaṃsu. Tassa pana santike ",
      " veyyāvaccakaro ekova puṇṇo nāma dāso ohīyi, tena saddhiṃ seṭṭhijāyā seṭṭhiputto seṭṭhisuṇisāti pañceva janā ahesuṃ. Te bhūmiyaṃ ",
      " āvāṭesu nihitadhaññepi parikkhīṇe bhittimattikaṃ pātetvā temetvā tato laddhadhaññena yāpayiṃsu. Athassa jāyā chātake avattharante mattikāya khīyamānāya bhittipādesu avasiṭṭhamattikaṃ pātetvā temetvā aḍḍhāḷhakamattaṃ vīhiṃ labhitvā koṭṭetvā ekaṃ taṇḍulanāḷiṃ gahetvā ‘‘chātakakāle corā bahū hontī’’ti corabhayena ekasmiṃ kuṭe pakkhipitvā pidahitvā bhūmiyaṃ nikhaṇitvā ṭhapesi. Atha naṃ seṭṭhi rājūpaṭṭhānato āgantvā āha – ‘‘bhadde, chātomhi, atthi kiñcī’’ti. Sā vijjamānaṃ ‘‘natthī’’ti avatvā ‘‘ekā taṇḍulanāḷi atthī’’ti āha. ‘‘Kahaṃ sā’’ti? ‘‘Corabhayena me nikhaṇitvā ṭhapitā’’ti. ‘‘Tena hi naṃ uddharitvā kiñci pacāhī’’ti. ‘‘Sace yāguṃ pacissāmi, dve vāre labhissati. Sace bhattaṃ pacissāmi, ekavārameva labhissati, kiṃ pacāmi, sāmī’’ti āha. ‘‘Amhākaṃ añño paccayo natthi, bhattaṃ bhuñjitvā marissāma, bhattameva pacāhī’’ti. Sā bhattaṃ pacitvā pañca koṭṭhāse katvā seṭṭhino koṭṭhāsaṃ vaḍḍhetvā purato ṭhapesi."
    ],
    "innerText": "So aparena samayena chātakabhaye sampatte yathānikkhittaṃ dhaññaṃ paribhuñjanto koṭṭhesu ca cāṭiādīsu ca nikkhittadhaññe parikkhīṇe parijane pakkosāpetvā āha – ‘‘gacchatha, tātā, pabbatapādaṃ pavisitvā jīvantā subhikkhakāle mama santikaṃ āgantukāmā āgacchatha, anāgantukāmā tattha tattheva jīvathā’’ti. Te rodamānā assumukhā hutvā seṭṭhiṃ vanditvā khamāpetvā sattāhaṃ nisīditvā tathā akaṃsu. Tassa pana santike veyyāvaccakaro ekova puṇṇo nāma dāso ohīyi, tena saddhiṃ seṭṭhijāyā seṭṭhiputto seṭṭhisuṇisāti pañceva janā ahesuṃ. Te bhūmiyaṃ āvāṭesu nihitadhaññepi parikkhīṇe bhittimattikaṃ pātetvā temetvā tato laddhadhaññena yāpayiṃsu. Athassa jāyā chātake avattharante mattikāya khīyamānāya bhittipādesu avasiṭṭhamattikaṃ pātetvā temetvā aḍḍhāḷhakamattaṃ vīhiṃ labhitvā koṭṭetvā ekaṃ taṇḍulanāḷiṃ gahetvā ‘‘chātakakāle corā bahū hontī’’ti corabhayena ekasmiṃ kuṭe pakkhipitvā pidahitvā bhūmiyaṃ nikhaṇitvā ṭhapesi. Atha naṃ seṭṭhi rājūpaṭṭhānato āgantvā āha – ‘‘bhadde, chātomhi, atthi kiñcī’’ti. Sā vijjamānaṃ ‘‘natthī’’ti avatvā ‘‘ekā taṇḍulanāḷi atthī’’ti āha. ‘‘Kahaṃ sā’’ti? ‘‘Corabhayena me nikhaṇitvā ṭhapitā’’ti. ‘‘Tena hi naṃ uddharitvā kiñci pacāhī’’ti. ‘‘Sace yāguṃ pacissāmi, dve vāre labhissati. Sace bhattaṃ pacissāmi, ekavārameva labhissati, kiṃ pacāmi, sāmī’’ti āha. ‘‘Amhākaṃ añño paccayo natthi, bhattaṃ bhuñjitvā marissāma, bhattameva pacāhī’’ti. Sā bhattaṃ pacitvā pañca koṭṭhāse katvā seṭṭhino koṭṭhāsaṃ vaḍḍhetvā purato ṭhapesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tasmiṃ khaṇe gandhamādanapabbate paccekabuddho samāpattito ",
      " vuṭṭhāti. Antosamāpattiyaṃ kira samāpattibalena jighacchā na bādhati. Samāpattito vuṭṭhitānaṃ pana balavatī hutvā udarapaṭalaṃ ",
      " ḍayhantī viya uppajjati. Tasmā te labhanaṭṭhānaṃ oloketvā gacchanti. Taṃ divasañca tesaṃ dānaṃ datvā senāpatiṭṭhānādīsu aññatarasampattiṃ labhanti. Tasmā sopi dibbena cakkhunā olokento ‘‘sakalajambudīpe chātakabhayaṃ uppannaṃ, seṭṭhigehe ca pañcannaṃ janānaṃ nāḷikodanova pakko, saddhā nu kho ete, sakkhissanti vā mama saṅgahaṃ kātu’’nti tesaṃ saddhabhāvañca saṅgahaṃ kātuṃ samatthabhāvañca disvā pattacīvaramādāya mahāseṭṭhissa purato dvāre ṭhitameva attānaṃ dassesi. So taṃ disvā pasannacitto ‘‘pubbepi mayā dānassa adinnattā evarūpaṃ chātakaṃ diṭṭhaṃ, idaṃ kho pana bhattaṃ maṃ ekadivasameva rakkheyya. Ayyassa pana dinnaṃ anekāsu kappakoṭīsu mama hitasukhāvahaṃ bhavissatī’’ti taṃ bhattapātiṃ apanetvā paccekabuddhaṃ upasaṅkamitvā pañcapatiṭṭhitena vanditvā gehaṃ pavesetvā āsane nisinnassa ",
      " pāde dhovitvā suvaṇṇapādapīṭhe ṭhapetvā bhattapātimādāya paccekabuddhassa patte okiri. Upaḍḍhāvasese bhatte paccekabuddho hatthena pattaṃ ",
      " pidahi. Atha naṃ, ‘‘bhante, ekāya taṇḍulanāḷiyā pañcannaṃ janānaṃ pakkaodanassa ayaṃ eko koṭṭhāso, imaṃ dvidhā kātuṃ na sakkā. Mā mayhaṃ idhaloke saṅgahaṃ karotha, ahaṃ niravasesaṃ dātukāmomhī’’ti vatvā sabbaṃ bhattamadāsi. Datvā ca pana patthanaṃ paṭṭhapesi, ‘‘mā, bhante, puna nibbattanibbattaṭṭhāne evarūpaṃ chātakabhayaṃ addasaṃ, ito paṭṭhāya sakalajambudīpavāsīnaṃ bījabhattaṃ dātuṃ samattho bhaveyyaṃ, sahatthena kammaṃ katvā jīvikaṃ na kappeyyaṃ, aḍḍhaterasa koṭṭhasatāni sodhāpetvā sīsaṃ nhāyitvā tesaṃ dvāre nisīditvā uddhaṃ olokitakkhaṇeyeva me rattasālidhārā patitvā sabbakoṭṭhe pūreyyuṃ. Nibbattanibbattaṭṭhāne ca ayameva bhariyā, ayameva putto, ayameva suṇisā, ayameva dāso hotū’’ti."
    ],
    "innerText": "Tasmiṃ khaṇe gandhamādanapabbate paccekabuddho samāpattito vuṭṭhāti. Antosamāpattiyaṃ kira samāpattibalena jighacchā na bādhati. Samāpattito vuṭṭhitānaṃ pana balavatī hutvā udarapaṭalaṃ ḍayhantī viya uppajjati. Tasmā te labhanaṭṭhānaṃ oloketvā gacchanti. Taṃ divasañca tesaṃ dānaṃ datvā senāpatiṭṭhānādīsu aññatarasampattiṃ labhanti. Tasmā sopi dibbena cakkhunā olokento ‘‘sakalajambudīpe chātakabhayaṃ uppannaṃ, seṭṭhigehe ca pañcannaṃ janānaṃ nāḷikodanova pakko, saddhā nu kho ete, sakkhissanti vā mama saṅgahaṃ kātu’’nti tesaṃ saddhabhāvañca saṅgahaṃ kātuṃ samatthabhāvañca disvā pattacīvaramādāya mahāseṭṭhissa purato dvāre ṭhitameva attānaṃ dassesi. So taṃ disvā pasannacitto ‘‘pubbepi mayā dānassa adinnattā evarūpaṃ chātakaṃ diṭṭhaṃ, idaṃ kho pana bhattaṃ maṃ ekadivasameva rakkheyya. Ayyassa pana dinnaṃ anekāsu kappakoṭīsu mama hitasukhāvahaṃ bhavissatī’’ti taṃ bhattapātiṃ apanetvā paccekabuddhaṃ upasaṅkamitvā pañcapatiṭṭhitena vanditvā gehaṃ pavesetvā āsane nisinnassa pāde dhovitvā suvaṇṇapādapīṭhe ṭhapetvā bhattapātimādāya paccekabuddhassa patte okiri. Upaḍḍhāvasese bhatte paccekabuddho hatthena pattaṃ pidahi. Atha naṃ, ‘‘bhante, ekāya taṇḍulanāḷiyā pañcannaṃ janānaṃ pakkaodanassa ayaṃ eko koṭṭhāso, imaṃ dvidhā kātuṃ na sakkā. Mā mayhaṃ idhaloke saṅgahaṃ karotha, ahaṃ niravasesaṃ dātukāmomhī’’ti vatvā sabbaṃ bhattamadāsi. Datvā ca pana patthanaṃ paṭṭhapesi, ‘‘mā, bhante, puna nibbattanibbattaṭṭhāne evarūpaṃ chātakabhayaṃ addasaṃ, ito paṭṭhāya sakalajambudīpavāsīnaṃ bījabhattaṃ dātuṃ samattho bhaveyyaṃ, sahatthena kammaṃ katvā jīvikaṃ na kappeyyaṃ, aḍḍhaterasa koṭṭhasatāni sodhāpetvā sīsaṃ nhāyitvā tesaṃ dvāre nisīditvā uddhaṃ olokitakkhaṇeyeva me rattasālidhārā patitvā sabbakoṭṭhe pūreyyuṃ. Nibbattanibbattaṭṭhāne ca ayameva bhariyā, ayameva putto, ayameva suṇisā, ayameva dāso hotū’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhariyāpissa ‘‘mama sāmike jighacchāya pīḷiyamāne na sakkā mayā bhuñjitu’’nti cintetvā attano koṭṭhāsaṃ paccekabuddhassa datvā patthanaṃ paṭṭhapesi, ‘‘bhante, idāni nibbattanibbattaṭṭhāne evarūpaṃ chātakabhayaṃ na passeyyaṃ, bhattathālikaṃ ",
      " purato katvā sakalajambudīpavāsīnaṃ bhattaṃ dentiyāpi ca me yāva na uṭṭhahissāmi, tāva gahitagahitaṭṭhānaṃ pūritameva hotu. Ayameva sāmiko, ayameva putto, ayameva suṇisā, ayameva dāso hotū’’ti. Puttopissa attano koṭṭhāsaṃ paccekabuddhassa datvā patthanaṃ paṭṭhapesi, ‘‘bhante, ito paṭṭhāya evarūpaṃ chātakabhayaṃ na passeyyaṃ, ekañca me sahassathavikaṃ gahetvā sakalajambudīpavāsīnaṃ kahāpaṇaṃ dentassāpi ayaṃ sahassathavikā paripuṇṇāva hotu, imeyeva mātāpitaro hontu, ayaṃ bhariyā, ayaṃ dāso hotū’’ti."
    ],
    "innerText": "Bhariyāpissa ‘‘mama sāmike jighacchāya pīḷiyamāne na sakkā mayā bhuñjitu’’nti cintetvā attano koṭṭhāsaṃ paccekabuddhassa datvā patthanaṃ paṭṭhapesi, ‘‘bhante, idāni nibbattanibbattaṭṭhāne evarūpaṃ chātakabhayaṃ na passeyyaṃ, bhattathālikaṃ purato katvā sakalajambudīpavāsīnaṃ bhattaṃ dentiyāpi ca me yāva na uṭṭhahissāmi, tāva gahitagahitaṭṭhānaṃ pūritameva hotu. Ayameva sāmiko, ayameva putto, ayameva suṇisā, ayameva dāso hotū’’ti. Puttopissa attano koṭṭhāsaṃ paccekabuddhassa datvā patthanaṃ paṭṭhapesi, ‘‘bhante, ito paṭṭhāya evarūpaṃ chātakabhayaṃ na passeyyaṃ, ekañca me sahassathavikaṃ gahetvā sakalajambudīpavāsīnaṃ kahāpaṇaṃ dentassāpi ayaṃ sahassathavikā paripuṇṇāva hotu, imeyeva mātāpitaro hontu, ayaṃ bhariyā, ayaṃ dāso hotū’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Suṇisāpissa ",
      " attano koṭṭhāsaṃ paccekabuddhassa datvā patthanaṃ paṭṭhapesi, ‘‘ito paṭṭhāya evarūpaṃ chātakabhayaṃ na passeyyaṃ, ekañca me dhaññapiṭakaṃ purato ṭhapetvā sakalajambudīpavāsīnaṃ bījabhattaṃ dentiyāpi khīṇabhāvo mā paññāyittha, nibbattanibbattaṭṭhāne imeyeva sasurā hontu, ayameva sāmiko, ayameva dāso hotū’’ti. Dāsopi attano koṭṭhāsaṃ paccekabuddhassa datvā patthanaṃ paṭṭhapesi ",
      ", ‘‘ito paṭṭhāya evarūpaṃ chātakabhayaṃ na passeyyaṃ, sabbe ime sāmikā hontu, kasantassa ca me ito tisso, etto tisso, majjhe ekāti dāruambaṇamattā satta satta sītāyo gacchantū’’ti. So taṃ divasaṃ senāpatiṭṭhānaṃ patthetvā laddhuṃ samatthopi sāmikesu ",
      " sinehena ‘‘imeyeva me sāmikā hontū’’ti patthanaṃ paṭṭhapesi. Paccekabuddho sabbesampi vacanāvasāne ‘‘evaṃ hotū’’ti vatvā –"
    ],
    "innerText": "Suṇisāpissa attano koṭṭhāsaṃ paccekabuddhassa datvā patthanaṃ paṭṭhapesi, ‘‘ito paṭṭhāya evarūpaṃ chātakabhayaṃ na passeyyaṃ, ekañca me dhaññapiṭakaṃ purato ṭhapetvā sakalajambudīpavāsīnaṃ bījabhattaṃ dentiyāpi khīṇabhāvo mā paññāyittha, nibbattanibbattaṭṭhāne imeyeva sasurā hontu, ayameva sāmiko, ayameva dāso hotū’’ti. Dāsopi attano koṭṭhāsaṃ paccekabuddhassa datvā patthanaṃ paṭṭhapesi , ‘‘ito paṭṭhāya evarūpaṃ chātakabhayaṃ na passeyyaṃ, sabbe ime sāmikā hontu, kasantassa ca me ito tisso, etto tisso, majjhe ekāti dāruambaṇamattā satta satta sītāyo gacchantū’’ti. So taṃ divasaṃ senāpatiṭṭhānaṃ patthetvā laddhuṃ samatthopi sāmikesu sinehena ‘‘imeyeva me sāmikā hontū’’ti patthanaṃ paṭṭhapesi. Paccekabuddho sabbesampi vacanāvasāne ‘‘evaṃ hotū’’ti vatvā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Icchitaṃ patthitaṃ tuyhaṃ, khippameva samijjhatu;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sabbe pūrentu saṅkappā, cando pannaraso yathā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Icchitaṃ patthitaṃ tuyhaṃ, khippameva samijjhatu;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sabbe pūrentu saṅkappā, maṇi jotiraso yathā’’ti. –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Paccekabuddhagāthāhi anumodanaṃ katvā ‘‘mayā imesaṃ cittaṃ pasādetuṃ vaṭṭatī’’ti cintetvā ‘‘yāva gandhamādanapabbatā ime maṃ passantū’’ti adhiṭṭhahitvā pakkāmi. Tepi oloketvāva aṭṭhaṃsu. So gantvā taṃ bhattaṃ pañcahi paccekabuddhasatehi saddhiṃ saṃvibhaji. Taṃ tassānubhāvena sabbesampi pahoti. Te olokentāyeva aṭṭhaṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atikkante pana majjhanhike seṭṭhibhariyā ukkhaliṃ dhovitvā pidahitvā ṭhapesi. Seṭṭhipi jighacchāya pīḷito nipajjitvā niddaṃ okkami. So sāyanhe pabujjhitvā bhariyaṃ āha – ‘‘bhadde, ativiya chātomhi, atthi nu kho ukkhaliyā tale jhāmakasitthānī’’ti. Sā dhovitvā ukkhaliyā ṭhapitabhāvaṃ jānantīpi ‘‘natthī’’ti avatvā ‘‘ukkhaliṃ vivaritvā ācikkhissāmī’’ti uṭṭhāya ukkhalimūlaṃ gantvā ukkhaliṃ vivari, tāvadeva sumanamakulasadisavaṇṇassa bhattassa pūrā ukkhali pidhānaṃ ukkhipitvā aṭṭhāsi. Sā taṃ disvāva pītiyā phuṭṭhasarīrā seṭṭhiṃ āha – ‘‘uṭṭhehi, sāmi, ahaṃ ukkhaliṃ dhovitvā pidahiṃ, sā pana sumanamakulasadisavaṇṇassa bhattassa ",
      " pūrā, puññāni nāma kattabbarūpāni, dānaṃ nāma kattabbayuttakaṃ. Uṭṭhehi, sāmi, bhuñjassū’’ti. Sā dvinnaṃ pitāputtānaṃ bhattaṃ adāsi. Tesu sutvā ",
      " uṭṭhitesu suṇisāya saddhiṃ nisīditvā bhuñjitvā puṇṇassa bhattaṃ adāsi. Gahitagahitaṭṭhānaṃ na khīyati, kaṭacchunā sakiṃ gahitaṭṭhānameva paññāyati. Taṃdivasameva koṭṭhādayo pubbe pūritaniyāmeneva puna pūrayiṃsu. ‘‘Seṭṭhissa gehe bhattaṃ uppannaṃ, bījabhattehi atthikā āgantvā gaṇhantū’’ti nagare ",
      " ghosanaṃ kāresi. Manussā tassa gehato bījabhattaṃ gaṇhiṃsu. Sakalajambudīpavāsino taṃ nissāya jīvitaṃ labhiṃsuyeva."
    ],
    "innerText": "Atikkante pana majjhanhike seṭṭhibhariyā ukkhaliṃ dhovitvā pidahitvā ṭhapesi. Seṭṭhipi jighacchāya pīḷito nipajjitvā niddaṃ okkami. So sāyanhe pabujjhitvā bhariyaṃ āha – ‘‘bhadde, ativiya chātomhi, atthi nu kho ukkhaliyā tale jhāmakasitthānī’’ti. Sā dhovitvā ukkhaliyā ṭhapitabhāvaṃ jānantīpi ‘‘natthī’’ti avatvā ‘‘ukkhaliṃ vivaritvā ācikkhissāmī’’ti uṭṭhāya ukkhalimūlaṃ gantvā ukkhaliṃ vivari, tāvadeva sumanamakulasadisavaṇṇassa bhattassa pūrā ukkhali pidhānaṃ ukkhipitvā aṭṭhāsi. Sā taṃ disvāva pītiyā phuṭṭhasarīrā seṭṭhiṃ āha – ‘‘uṭṭhehi, sāmi, ahaṃ ukkhaliṃ dhovitvā pidahiṃ, sā pana sumanamakulasadisavaṇṇassa bhattassa pūrā, puññāni nāma kattabbarūpāni, dānaṃ nāma kattabbayuttakaṃ. Uṭṭhehi, sāmi, bhuñjassū’’ti. Sā dvinnaṃ pitāputtānaṃ bhattaṃ adāsi. Tesu sutvā uṭṭhitesu suṇisāya saddhiṃ nisīditvā bhuñjitvā puṇṇassa bhattaṃ adāsi. Gahitagahitaṭṭhānaṃ na khīyati, kaṭacchunā sakiṃ gahitaṭṭhānameva paññāyati. Taṃdivasameva koṭṭhādayo pubbe pūritaniyāmeneva puna pūrayiṃsu. ‘‘Seṭṭhissa gehe bhattaṃ uppannaṃ, bījabhattehi atthikā āgantvā gaṇhantū’’ti nagare ghosanaṃ kāresi. Manussā tassa gehato bījabhattaṃ gaṇhiṃsu. Sakalajambudīpavāsino taṃ nissāya jīvitaṃ labhiṃsuyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "So tato cuto devaloke nibbattitvā devamanussesu saṃsaranto imasmiṃ buddhuppāde bhaddiyanagare seṭṭhikule nibbatti. Bhariyāpissa mahābhogakule nibbattitvā vayappattā tasseva gehaṃ agamāsi. Tassa taṃ pubbakammaṃ nissāya pacchāgehe pubbe vuttappakārā meṇḍakā uṭṭhahiṃsu. Puttopi nesaṃ puttova, suṇisā suṇisāva, dāso dāsova ahosi. Athekadivasaṃ seṭṭhi attano puññaṃ vīmaṃsitukāmo aḍḍhaterasāni koṭṭhasatāni sodhāpetvā sīsaṃ nhāto dvāre nisīditvā uddhaṃ olokesi. Sabbānipi vuttappakārānaṃ ",
      " rattasālīnaṃ pūrayiṃsu. So sesānampi puññāni vīmaṃsitukāmo bhariyañca puttādayo ca ‘‘tumhākampi puññāni vīmaṃsissathā’’ti āha."
    ],
    "innerText": "So tato cuto devaloke nibbattitvā devamanussesu saṃsaranto imasmiṃ buddhuppāde bhaddiyanagare seṭṭhikule nibbatti. Bhariyāpissa mahābhogakule nibbattitvā vayappattā tasseva gehaṃ agamāsi. Tassa taṃ pubbakammaṃ nissāya pacchāgehe pubbe vuttappakārā meṇḍakā uṭṭhahiṃsu. Puttopi nesaṃ puttova, suṇisā suṇisāva, dāso dāsova ahosi. Athekadivasaṃ seṭṭhi attano puññaṃ vīmaṃsitukāmo aḍḍhaterasāni koṭṭhasatāni sodhāpetvā sīsaṃ nhāto dvāre nisīditvā uddhaṃ olokesi. Sabbānipi vuttappakārānaṃ rattasālīnaṃ pūrayiṃsu. So sesānampi puññāni vīmaṃsitukāmo bhariyañca puttādayo ca ‘‘tumhākampi puññāni vīmaṃsissathā’’ti āha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Athassa bhariyā sabbālaṅkārehi alaṅkaritvā mahājanassa passantasseva taṇḍule mināpetvā tehi bhattaṃ pacāpetvā dvārakoṭṭhake paññattāsane nisīditvā suvaṇṇakaṭacchuṃ ādāya ‘‘bhattena atthikā āgacchantū’’ti ghosāpetvā āgatāgatānaṃ upanītabhājanāni pūretvā adāsi. Sakaladivasampi dentiyā kaṭacchunā gahitaṭṭhānameva paññāyati. Tassā pana purimabuddhānampi bhikkhusaṅghassa vāmahatthena ukkhaliṃ dakkhiṇahatthena kaṭacchuṃ gahetvā evameva patte pūretvā bhattassa dinnattā vāmahatthatalaṃ pūretvā padumalakkhaṇaṃ nibbatti, dakkhiṇahatthatalaṃ pūretvā candalakkhaṇaṃ nibbatti. Yasmā pana vāmahatthato dhammakaraṇaṃ ādāya bhikkhusaṅghassa udakaṃ parissāvetvā dadamānā aparāparaṃ vicari, tenassā dakkhiṇapādatalaṃ pūretvā candalakkhaṇaṃ nibbatti, vāmapādatalaṃ pūretvā padumalakkhaṇaṃ nibbatti. Tassā iminā kāraṇena candapadumāti nāmaṃ kariṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Puttopissa sīsaṃ nhāto sahassathavikaṃ ",
      " ādāya ‘‘kahāpaṇehi atthikā āgacchantū’’ti vatvā āgatāgatānaṃ gahitabhājanāni pūretvā adāsi. Thavikāya kahāpaṇasahassaṃ ahosiyeva. Suṇisāpissa sabbālaṅkārehi alaṅkaritvā vīhipiṭakaṃ ādāya ākāsaṅgaṇe nisinnā ‘‘bījabhattehi atthikā āgacchantū’’ti vatvā āgatāgatānaṃ gahitabhājanāni pūretvā adāsi. Piṭakaṃ ",
      " yathāpūritameva ahosi. Dāsopissa ",
      " sabbālaṅkārehi alaṅkaritvā suvaṇṇayugesu suvaṇṇayottehi goṇe yojetvā suvaṇṇapatodayaṭṭhiṃ ādāya dvinnaṃ goṇānaṃ gandhapañcaṅgulikāni datvā visāṇesu suvaṇṇakosake paṭimuñcitvā khettaṃ gantvā pājesi. Ito tisso, etto tisso, majjhe ekāti satta sītā bhijjitvā agamaṃsu. Jambudīpavāsino bhattabījahiraññasuvaṇṇādīsu yathārucitaṃ seṭṭhigehatoyeva gaṇhiṃsu. Ime pañca mahāpuññā."
    ],
    "innerText": "Puttopissa sīsaṃ nhāto sahassathavikaṃ ādāya ‘‘kahāpaṇehi atthikā āgacchantū’’ti vatvā āgatāgatānaṃ gahitabhājanāni pūretvā adāsi. Thavikāya kahāpaṇasahassaṃ ahosiyeva. Suṇisāpissa sabbālaṅkārehi alaṅkaritvā vīhipiṭakaṃ ādāya ākāsaṅgaṇe nisinnā ‘‘bījabhattehi atthikā āgacchantū’’ti vatvā āgatāgatānaṃ gahitabhājanāni pūretvā adāsi. Piṭakaṃ yathāpūritameva ahosi. Dāsopissa sabbālaṅkārehi alaṅkaritvā suvaṇṇayugesu suvaṇṇayottehi goṇe yojetvā suvaṇṇapatodayaṭṭhiṃ ādāya dvinnaṃ goṇānaṃ gandhapañcaṅgulikāni datvā visāṇesu suvaṇṇakosake paṭimuñcitvā khettaṃ gantvā pājesi. Ito tisso, etto tisso, majjhe ekāti satta sītā bhijjitvā agamaṃsu. Jambudīpavāsino bhattabījahiraññasuvaṇṇādīsu yathārucitaṃ seṭṭhigehatoyeva gaṇhiṃsu. Ime pañca mahāpuññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ mahānubhāvo seṭṭhi ‘‘satthā kira āgato’’ti sutvā ‘‘satthu paccuggamanaṃ karissāmī’’ti nikkhamanto antarāmagge titthiye disvā tehi ‘‘kasmā taṃ, gahapati, kiriyavādo samāno akiriyavādassa samaṇassa gotamassa santikaṃ gacchasī’’ti nivāriyamānopi tesaṃ vacanaṃ anādiyitvā gantvā satthāraṃ vanditvā ekamantaṃ nisīdi ",
      ". Athassa satthā anupubbiṃ kathaṃ kathesi. So desanāvasāne sotāpattiphalaṃ patvā satthu titthiyehi avaṇṇaṃ vatvā attano nivāritabhāvaṃ ārocesi. Atha naṃ satthā, ‘‘gahapati, ime sattā nāma mahantampi attano dosaṃ na passanti, avijjamānampi paresaṃ dosaṃ vijjamānaṃ katvā tattha tattha bhusaṃ viya opunantī’’ti vatvā imaṃ gāthamāha –"
    ],
    "innerText": "Evaṃ mahānubhāvo seṭṭhi ‘‘satthā kira āgato’’ti sutvā ‘‘satthu paccuggamanaṃ karissāmī’’ti nikkhamanto antarāmagge titthiye disvā tehi ‘‘kasmā taṃ, gahapati, kiriyavādo samāno akiriyavādassa samaṇassa gotamassa santikaṃ gacchasī’’ti nivāriyamānopi tesaṃ vacanaṃ anādiyitvā gantvā satthāraṃ vanditvā ekamantaṃ nisīdi . Athassa satthā anupubbiṃ kathaṃ kathesi. So desanāvasāne sotāpattiphalaṃ patvā satthu titthiyehi avaṇṇaṃ vatvā attano nivāritabhāvaṃ ārocesi. Atha naṃ satthā, ‘‘gahapati, ime sattā nāma mahantampi attano dosaṃ na passanti, avijjamānampi paresaṃ dosaṃ vijjamānaṃ katvā tattha tattha bhusaṃ viya opunantī’’ti vatvā imaṃ gāthamāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "252"
      },
      "."
    ],
    "innerText": "252."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sudassaṃ vajjamaññesaṃ, attano pana duddasaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Paresañhi so vajjāni, opunāti yathā bhusaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Attano pana chādeti, kaliṃva kitavā saṭho’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sudassaṃ vajja"
      },
      "nti parassa aṇumattampi vajjaṃ khalitaṃ sudassaṃ sukheneva passituṃ sakkā, attano pana atimahantampi duddasaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paresaṃ hī"
      },
      "ti teneva kāraṇena so puggalo saṅghamajjhādīsu paresaṃ vajjāni uccaṭṭhāne ṭhapetvā bhusaṃ opunanto viya opunāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kaliṃva kitavā saṭho"
      },
      "ti ettha sakuṇesu aparajjhanabhāvena attabhāvo kali nāma, sākhabhaṅgādikaṃ paṭicchādanaṃ kitavā nāma, sākuṇiko saṭho nāma. Yathā sakuṇaluddako sakuṇe gahetvā māretukāmo kitavā viya ",
      " attabhāvaṃ paṭicchādeti, evaṃ attano vajjaṃ chādetīti attho."
    ],
    "innerText": "Tattha sudassaṃ vajjanti parassa aṇumattampi vajjaṃ khalitaṃ sudassaṃ sukheneva passituṃ sakkā, attano pana atimahantampi duddasaṃ. Paresaṃ hīti teneva kāraṇena so puggalo saṅghamajjhādīsu paresaṃ vajjāni uccaṭṭhāne ṭhapetvā bhusaṃ opunanto viya opunāti. Kaliṃva kitavā saṭhoti ettha sakuṇesu aparajjhanabhāvena attabhāvo kali nāma, sākhabhaṅgādikaṃ paṭicchādanaṃ kitavā nāma, sākuṇiko saṭho nāma. Yathā sakuṇaluddako sakuṇe gahetvā māretukāmo kitavā viya attabhāvaṃ paṭicchādeti, evaṃ attano vajjaṃ chādetīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Desanāvasāne bahū sotāpattiphalādīni pāpuṇiṃsūti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Meṇḍakaseṭṭhivatthu dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "11. Ujjhānasaññittheravatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paravajjānupassissā"
      },
      "ti ",
      " imaṃ dhammadesanaṃ satthā jetavane viharanto ujjhānasaññiṃ nāma ekaṃ theraṃ ārabbha kathesi."
    ],
    "innerText": "Paravajjānupassissāti imaṃ dhammadesanaṃ satthā jetavane viharanto ujjhānasaññiṃ nāma ekaṃ theraṃ ārabbha kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "So kira ‘‘ayaṃ evaṃ nivāseti, evaṃ pārupatī’’ti bhikkhūnaṃ antarameva gavesanto vicarati. Bhikkhū ‘‘asuko nāma, bhante, thero evaṃ karotī’’ti satthu ārocesuṃ. Satthā, ‘‘bhikkhave, vattasīse ṭhatvā evaṃ ovadanto ananupavādo. Yo pana niccaṃ ujjhānasaññitāya paresaṃ antaraṃ pariyesamāno evaṃ vatvā vicarati, tassa jhānādīsu ekopi viseso nuppajjati, kevalaṃ āsavāyeva vaḍḍhantī’’ti vatvā imaṃ gāthamāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "253"
      },
      "."
    ],
    "innerText": "253."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Paravajjānupassissa, niccaṃ ujjhānasaññino;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Āsavā tassa vaḍḍhanti, ārā so āsavakkhayā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ujjhānasaññino"
      },
      "ti evaṃ nivāsetabbaṃ evaṃ pārupitabbanti paresaṃ antaragavesitāya ujjhānabahulassa puggalassa jhānādīsu ekadhammopi na vaḍḍhati, atha kho āsavāva tassa vaḍḍhanti. Teneva kāraṇena so arahattamaggasaṅkhātā āsavakkhayā ārā dūraṃ gatova hotīti."
    ],
    "innerText": "Tattha ujjhānasaññinoti evaṃ nivāsetabbaṃ evaṃ pārupitabbanti paresaṃ antaragavesitāya ujjhānabahulassa puggalassa jhānādīsu ekadhammopi na vaḍḍhati, atha kho āsavāva tassa vaḍḍhanti. Teneva kāraṇena so arahattamaggasaṅkhātā āsavakkhayā ārā dūraṃ gatova hotīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Desanāvasāne bahū sotāpattiphalādīni pāpuṇiṃsūti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ujjhānasaññittheravatthu ekādasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "12. Subhaddaparibbājakavatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ākāse"
      },
      "ti idaṃ dhammadesanaṃ satthā kusinārāyaṃ upavattane mallānaṃ sālavane parinibbānamañcake nipanno subhaddaṃ paribbājakaṃ ārabbha kathesi."
    ],
    "innerText": "Ākāseti idaṃ dhammadesanaṃ satthā kusinārāyaṃ upavattane mallānaṃ sālavane parinibbānamañcake nipanno subhaddaṃ paribbājakaṃ ārabbha kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "So kira atīte kaniṭṭhabhātari ekasmiṃ sasse navakkhattuṃ aggadānaṃ dente dānaṃ dātuṃ anicchanto osakkitvā avasāne adāsi. Tasmā paṭhamabodhiyampi majjhimabodhiyampi satthāraṃ daṭṭhuṃ nālattha. Pacchimabodhiyaṃ pana satthu parinibbānakāle ‘‘ahaṃ tīsu pañhesu attano kaṅkhaṃ mahallake ",
      " paribbājake ",
      " pucchitvā samaṇaṃ gotamaṃ ‘daharo’ti saññāya na pucchiṃ ",
      ", tassa ca dāni parinibbānakālo, pacchā me samaṇassa gotamassa apucchitakāraṇā vippaṭisāro uppajjeyyā’’ti satthāraṃ upasaṅkamitvā ānandattherena nivāriyamānopi satthārā okāsaṃ katvā, ‘‘ānanda, mā subhaddaṃ nivārayi, pucchatu maṃ pañha’’nti vutte antosāṇiṃ pavisitvā heṭṭhāmañcake nisinno, ‘‘bho samaṇa, kiṃ nu kho ākāse padaṃ nāma atthi, ito bahiddhā samaṇo nāma atthi, saṅkhārā sassatā nāma atthī’’ti ime pañhe pucchi. Athassa satthā tesaṃ abhāvaṃ ācikkhanto imāhi gāthāhi dhammaṃ desesi –"
    ],
    "innerText": "So kira atīte kaniṭṭhabhātari ekasmiṃ sasse navakkhattuṃ aggadānaṃ dente dānaṃ dātuṃ anicchanto osakkitvā avasāne adāsi. Tasmā paṭhamabodhiyampi majjhimabodhiyampi satthāraṃ daṭṭhuṃ nālattha. Pacchimabodhiyaṃ pana satthu parinibbānakāle ‘‘ahaṃ tīsu pañhesu attano kaṅkhaṃ mahallake paribbājake pucchitvā samaṇaṃ gotamaṃ ‘daharo’ti saññāya na pucchiṃ , tassa ca dāni parinibbānakālo, pacchā me samaṇassa gotamassa apucchitakāraṇā vippaṭisāro uppajjeyyā’’ti satthāraṃ upasaṅkamitvā ānandattherena nivāriyamānopi satthārā okāsaṃ katvā, ‘‘ānanda, mā subhaddaṃ nivārayi, pucchatu maṃ pañha’’nti vutte antosāṇiṃ pavisitvā heṭṭhāmañcake nisinno, ‘‘bho samaṇa, kiṃ nu kho ākāse padaṃ nāma atthi, ito bahiddhā samaṇo nāma atthi, saṅkhārā sassatā nāma atthī’’ti ime pañhe pucchi. Athassa satthā tesaṃ abhāvaṃ ācikkhanto imāhi gāthāhi dhammaṃ desesi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "254"
      },
      "."
    ],
    "innerText": "254."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ākāseva padaṃ natthi, samaṇo natthi bāhire;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Papañcābhiratā pajā, nippapañcā tathāgatā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "255"
      },
      "."
    ],
    "innerText": "255."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ākāseva padaṃ natthi, samaṇo natthi bāhire;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Saṅkhārā sassatā natthi, natthi buddhānamiñjita’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pada"
      },
      "nti imasmiṃ ākāse vaṇṇasaṇṭhānavasena evarūpanti paññāpetabbaṃ kassaci padaṃ nāma natthi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bāhire"
      },
      "ti mama sāsanato bahiddhā maggaphalaṭṭho samaṇo nāma natthi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pajā"
      },
      "ti ayaṃ sattalokasaṅkhātā pajā taṇhādīsu papañcesuyevābhiratā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nippapañcā"
      },
      "ti bodhimūleyeva sabbapapañcānaṃ samucchinnattā nippapañcā ",
      " tathāgatā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅkhārā"
      },
      "ti pañcakkhandhā. Tesu hi ekopi sassato nāma natthi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iñjita"
      },
      "nti buddhānaṃ pana taṇhāmānādīsu iñjitesu yena saṅkhārā sassatāti gaṇheyya, taṃ ekaṃ iñjitampi nāma natthīti attho."
    ],
    "innerText": "Tattha padanti imasmiṃ ākāse vaṇṇasaṇṭhānavasena evarūpanti paññāpetabbaṃ kassaci padaṃ nāma natthi. Bāhireti mama sāsanato bahiddhā maggaphalaṭṭho samaṇo nāma natthi. Pajāti ayaṃ sattalokasaṅkhātā pajā taṇhādīsu papañcesuyevābhiratā. Nippapañcāti bodhimūleyeva sabbapapañcānaṃ samucchinnattā nippapañcā tathāgatā. Saṅkhārāti pañcakkhandhā. Tesu hi ekopi sassato nāma natthi. Iñjitanti buddhānaṃ pana taṇhāmānādīsu iñjitesu yena saṅkhārā sassatāti gaṇheyya, taṃ ekaṃ iñjitampi nāma natthīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Desanāvasāne subhaddo anāgāmiphale patiṭṭhahi, sampattaparisāyapi sātthikā dhammadesanā ahosīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Subhaddaparibbājakavatthu dvādasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Malavaggavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Aṭṭhārasamo vaggo."
  }
]