[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Namo tassa bhagavato arahato sammāsambuddhassa"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "nikaya"
    },
    "innerText": "Khuddakanikāye"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "book"
    },
    "innerText": "Vimānavatthu-aṭṭhakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subsubhead"
    },
    "innerText": "Ganthārambhakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Mahākāruṇikaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nāthaṃ,"
      },
      " ñeyyasāgarapāraguṃ;"
    ],
    "innerText": "Mahākāruṇikaṃ nāthaṃ, ñeyyasāgarapāraguṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vande nipuṇagambhīra-vicitranayadesanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Vijjācaraṇasampannā, yena niyyanti lokato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Vande tamuttamaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammaṃ,"
      },
      " sammāsambuddhapūjitaṃ."
    ],
    "innerText": "Vande tamuttamaṃ dhammaṃ, sammāsambuddhapūjitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sīlādiguṇasampanno, ṭhito maggaphalesu yo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Vande ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ariyasaṅghaṃ"
      },
      " taṃ, puññakkhettaṃ anuttaraṃ."
    ],
    "innerText": "Vande ariyasaṅghaṃ taṃ, puññakkhettaṃ anuttaraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Vandanājanitaṃ ",
      " puññaṃ, iti yaṃ ratanattaye;"
    ],
    "innerText": "Vandanājanitaṃ puññaṃ, iti yaṃ ratanattaye;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Hatantarāyo sabbattha, hutvāhaṃ tassa tejasā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Devatāhi kataṃ puññaṃ, yaṃ yaṃ purimajātisu;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tassa tassa vimānādi-phalasampattibhedato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Pucchāvasena yā tāsaṃ, vissajjanavasena ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pavattā desanā kamma-phalapaccakkhakārinī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vimānavatthu"
      },
      " icceva, nāmena vasino pure;"
    ],
    "innerText": "Vimānavatthu icceva, nāmena vasino pure;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yaṃ khuddakanikāyasmiṃ, saṅgāyiṃsu mahesayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Tassāhamavalambitvā, porāṇaṭṭhakathānayaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tattha tattha nidānāni, vibhāvento visesato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Suvisuddhaṃ ",
      " asaṃkiṇṇaṃ, nipuṇatthavinicchayaṃ;"
    ],
    "innerText": "Suvisuddhaṃ asaṃkiṇṇaṃ, nipuṇatthavinicchayaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Mahāvihāravāsīnaṃ, samayaṃ avilomayaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Yathābalaṃ karissāmi, atthasaṃvaṇṇanaṃ subhaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sakkaccaṃ bhāsato taṃ me, nisāmayatha sādhavoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vimānānī"
      },
      "ti visiṭṭhamānāni devatānaṃ kīḷānivāsaṭṭhānāni. Tāni hi tāsaṃ sucaritakammānubhāvanibbattāni yojanikadviyojanikādipamāṇavisesayuttatāya ",
      ", nānāratanasamujjalāni vicittavaṇṇasaṇṭhānāni sobhātisayayogena visesato mānanīyatāya ca ‘‘vimānānī’’ti vuccanti. Vimānānaṃ vatthu kāraṇaṃ etissāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vimānavatthu,"
      },
      " ‘‘pīṭhaṃ te sovaṇṇamaya’’ntiādinayappavattā desanā. Nidassanamattañcetaṃ tāsaṃ devatānaṃ rūpabhogaparivārādisampattiyo taṃnibbattakakammañca nissāya imissā desanāya pavattattā. Vipākamukhena vā kammantaramānassa kāraṇabhāvato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vimānavatthū"
      },
      "ti veditabbaṃ."
    ],
    "innerText": "Tattha vimānānīti visiṭṭhamānāni devatānaṃ kīḷānivāsaṭṭhānāni. Tāni hi tāsaṃ sucaritakammānubhāvanibbattāni yojanikadviyojanikādipamāṇavisesayuttatāya , nānāratanasamujjalāni vicittavaṇṇasaṇṭhānāni sobhātisayayogena visesato mānanīyatāya ca ‘‘vimānānī’’ti vuccanti. Vimānānaṃ vatthu kāraṇaṃ etissāti vimānavatthu, ‘‘pīṭhaṃ te sovaṇṇamaya’’ntiādinayappavattā desanā. Nidassanamattañcetaṃ tāsaṃ devatānaṃ rūpabhogaparivārādisampattiyo taṃnibbattakakammañca nissāya imissā desanāya pavattattā. Vipākamukhena vā kammantaramānassa kāraṇabhāvato vimānavatthūti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tayidaṃ kena bhāsitaṃ, kattha bhāsitaṃ, kadā bhāsitaṃ, kasmā ca bhāsitanti? Vuccate ",
      " – idañhi vimānavatthu duvidhena pavattaṃ – pucchāvasena vissajjanavasena ca. Tattha vissajjanagāthā tāhi tāhi devatāhi bhāsitā, pucchāgāthā pana kāci bhagavatā bhāsitā, kāci sakkādīhi, kāci sāvakehi therehi. Tatthāpi yebhuyyena yo so kappānaṃ satasahassādhikaṃ ekaṃ asaṅkhyeyyaṃ buddhassa bhagavato aggasāvakabhāvāya puññañāṇasambhāre sambharanto anukkamena sāvakapāramiyo pūretvā, chaḷabhiññācatupaṭisambhidādiguṇavisesaparivārassa, sakalassa sāvakapāramiñāṇassa matthakaṃ patto dutiye aggasāvakaṭṭhāne ṭhito iddhimantesu ca bhagavatā etadagge ṭhapito āyasmā mahāmoggallāno, tena bhāsitā."
    ],
    "innerText": "Tayidaṃ kena bhāsitaṃ, kattha bhāsitaṃ, kadā bhāsitaṃ, kasmā ca bhāsitanti? Vuccate – idañhi vimānavatthu duvidhena pavattaṃ – pucchāvasena vissajjanavasena ca. Tattha vissajjanagāthā tāhi tāhi devatāhi bhāsitā, pucchāgāthā pana kāci bhagavatā bhāsitā, kāci sakkādīhi, kāci sāvakehi therehi. Tatthāpi yebhuyyena yo so kappānaṃ satasahassādhikaṃ ekaṃ asaṅkhyeyyaṃ buddhassa bhagavato aggasāvakabhāvāya puññañāṇasambhāre sambharanto anukkamena sāvakapāramiyo pūretvā, chaḷabhiññācatupaṭisambhidādiguṇavisesaparivārassa, sakalassa sāvakapāramiñāṇassa matthakaṃ patto dutiye aggasāvakaṭṭhāne ṭhito iddhimantesu ca bhagavatā etadagge ṭhapito āyasmā mahāmoggallāno, tena bhāsitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhāsantena ca paṭhamaṃ tāva lokahitāya devacārikaṃ carantena devaloke devatānaṃ pucchāvasena puna tato manussalokaṃ āgantvā manussānaṃ puññaphalassa paccakkhakaraṇatthaṃ pucchaṃ vissajjanañca ekajjhaṃ ",
      " katvā ",
      " bhagavato pavedetvā bhikkhūnaṃ bhāsitā, sakkena pucchāvasena, devatāhi tassa vissajjanavasena bhāsitāpi mahāmoggallānattherassa bhāsitā eva. Evaṃ bhagavatā therehi ca devatāhi ca pucchāvasena, devatāhi tassā vissajjanavasena ca tattha tattha bhāsitā pacchā dhammavinayaṃ saṅgāyantehi dhammasaṅgāhakehi ekato katvā ‘‘vimānavatthu’’icceva saṅgahaṃ āropitā. Ayaṃ tāvettha ‘‘kena bhāsita’’ntiādīnaṃ padānaṃ saṅkhepato sādhāraṇato ca vissajjanā."
    ],
    "innerText": "Bhāsantena ca paṭhamaṃ tāva lokahitāya devacārikaṃ carantena devaloke devatānaṃ pucchāvasena puna tato manussalokaṃ āgantvā manussānaṃ puññaphalassa paccakkhakaraṇatthaṃ pucchaṃ vissajjanañca ekajjhaṃ katvā bhagavato pavedetvā bhikkhūnaṃ bhāsitā, sakkena pucchāvasena, devatāhi tassa vissajjanavasena bhāsitāpi mahāmoggallānattherassa bhāsitā eva. Evaṃ bhagavatā therehi ca devatāhi ca pucchāvasena, devatāhi tassā vissajjanavasena ca tattha tattha bhāsitā pacchā dhammavinayaṃ saṅgāyantehi dhammasaṅgāhakehi ekato katvā ‘‘vimānavatthu’’icceva saṅgahaṃ āropitā. Ayaṃ tāvettha ‘‘kena bhāsita’’ntiādīnaṃ padānaṃ saṅkhepato sādhāraṇato ca vissajjanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Vitthārato pana ‘‘kena bhāsita’’nti padassa anomadassissa bhagavato pādamūle katapaṇidhānato paṭṭhāya mahātherassa āgamanīyapaṭipadā kathetabbā, sā pana āgamaṭṭhakathāsu tattha tattha vitthāritāti tattha āgatanayeneva veditabbā. Asādhāraṇato ‘‘kattha bhāsita’’ntiādīnaṃ padānaṃ vissajjanā tassa tassa vimānassa atthavaṇṇanānayeneva āgamissati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Apare pana bhaṇanti – ekadivasaṃ āyasmato mahāmoggallānassa rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi ‘‘etarahi kho manussā asatipi vatthusampattiyā khettasampattiyā attano ca cittapasādasampattiyā tāni tāni puññāni katvā devaloke nibbattā uḷārasampattiṃ paccanubhonti, yaṃnūnāhaṃ devacārikaṃ caranto tā devatā kāyasakkhiṃ katvā tāhi yathūpacitaṃ puññaṃ yathādhigatañca puññaphalaṃ kathāpetvā tamatthaṃ bhagavato āroceyyaṃ. Evaṃ me satthā gaganatale puṇṇacandaṃ uṭṭhāpento viya manussānaṃ kammaphalaṃ paccakkhato dassento appakānampi kārānaṃ āyatanagatāya saddhāya vasena uḷāraphalataṃ vibhāvento taṃ taṃ vimānavatthuṃ aṭṭhuppattiṃ katvā mahatiṃ dhammadesanaṃ pavattessati, sā hoti bahujanassa ",
      " atthāya hitāya sukhāya devamanussāna’’nti ",
      ". So āsanā vuṭṭhahitvā rattadupaṭṭaṃ nivāsetvā aparaṃ rattadupaṭṭaṃ ekaṃsaṃ katvā samantato jātihiṅgulikadhārā vijjulatā viya sañjhāpabhānurañjito viya ca jaṅgamo añjanagirisikharo, bhagavantaṃ upasaṅkamitvā abhivādetvā ekamantaṃ nisinno attano adhippāyaṃ ārocetvā bhagavatā anuññāto uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā abhiññāpādakaṃ catutthajjhānaṃ ",
      " samāpajjitvā, tato vuṭṭhāya iddhibalena taṅkhaṇaññeva tāvatiṃsabhavanaṃ gantvā tattha tattha tāhi tāhi devatāhi yathūpacitaṃ puññakammaṃ pucchi, tassa tā kathesuṃ. Tato manussalokaṃ āgantvā taṃ sabbaṃ tattha pavattitaniyāmeneva bhagavato ārocesi, taṃ samanuñño satthā ahosi. Iccetaṃ aṭṭhuppattiṃ katvā sampattaparisāya vitthārena dhammaṃ desesīti."
    ],
    "innerText": "Apare pana bhaṇanti – ekadivasaṃ āyasmato mahāmoggallānassa rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi ‘‘etarahi kho manussā asatipi vatthusampattiyā khettasampattiyā attano ca cittapasādasampattiyā tāni tāni puññāni katvā devaloke nibbattā uḷārasampattiṃ paccanubhonti, yaṃnūnāhaṃ devacārikaṃ caranto tā devatā kāyasakkhiṃ katvā tāhi yathūpacitaṃ puññaṃ yathādhigatañca puññaphalaṃ kathāpetvā tamatthaṃ bhagavato āroceyyaṃ. Evaṃ me satthā gaganatale puṇṇacandaṃ uṭṭhāpento viya manussānaṃ kammaphalaṃ paccakkhato dassento appakānampi kārānaṃ āyatanagatāya saddhāya vasena uḷāraphalataṃ vibhāvento taṃ taṃ vimānavatthuṃ aṭṭhuppattiṃ katvā mahatiṃ dhammadesanaṃ pavattessati, sā hoti bahujanassa atthāya hitāya sukhāya devamanussāna’’nti . So āsanā vuṭṭhahitvā rattadupaṭṭaṃ nivāsetvā aparaṃ rattadupaṭṭaṃ ekaṃsaṃ katvā samantato jātihiṅgulikadhārā vijjulatā viya sañjhāpabhānurañjito viya ca jaṅgamo añjanagirisikharo, bhagavantaṃ upasaṅkamitvā abhivādetvā ekamantaṃ nisinno attano adhippāyaṃ ārocetvā bhagavatā anuññāto uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā abhiññāpādakaṃ catutthajjhānaṃ samāpajjitvā, tato vuṭṭhāya iddhibalena taṅkhaṇaññeva tāvatiṃsabhavanaṃ gantvā tattha tattha tāhi tāhi devatāhi yathūpacitaṃ puññakammaṃ pucchi, tassa tā kathesuṃ. Tato manussalokaṃ āgantvā taṃ sabbaṃ tattha pavattitaniyāmeneva bhagavato ārocesi, taṃ samanuñño satthā ahosi. Iccetaṃ aṭṭhuppattiṃ katvā sampattaparisāya vitthārena dhammaṃ desesīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Taṃ panetaṃ vimānavatthu vinayapiṭakaṃ suttantapiṭakaṃ abhidhammapiṭakanti tīsu piṭakesu suttantapiṭakapariyāpannaṃ, dīghanikāyo majjhimanikāyo saṃyuttanikāyo aṅguttaranikāyo khuddakanikāyoti pañcasu nikāyesu khuddakanikāyapariyāpannaṃ, suttaṃ geyyaṃ veyyākaraṇaṃ gāthā udānaṃ itivuttakaṃ jātakaṃ abbhutadhammaṃ vedallanti navasu sāsanaṅgesu gāthāsaṅgahaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Dvāsīti buddhato gaṇhiṃ, dve sahassāni bhikkhuto;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Caturāsīti sahassāni, ye me dhammā pavattino’’ti. (theragā. 1027) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Evaṃ dhammabhaṇḍāgārikena paṭiññātesu caturāsītiyā dhammakkhandhasahassesu katipayadhammakkhandhasaṅgahaṃ. Vaggato pīṭhavaggo cittalatāvaggo pāricchattakavaggo mañjiṭṭhakavaggo mahārathavaggo pāyāsivaggo sunikkhittavaggoti satta vaggā. Vatthuto paṭhame vagge sattarasa vatthūni, dutiye ekādasa, tatiye dasa, catutthe dvādasa ",
      ", pañcame catuddasa, chaṭṭhe dasa, sattame ekādasāti antaravimānānaṃ aggahaṇe pañcāsīti, gahaṇe pana tevīsasataṃ vatthūni, gāthāto pana diyaḍḍhasahassagāthā. Tassa vaggesu pīṭhavaggo ādi, vatthūsu sovaṇṇapīṭhavatthu ādi, tassāpi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘pīṭhaṃ te sovaṇṇamaya’’"
      },
      "nti gāthā ādi."
    ],
    "innerText": "Evaṃ dhammabhaṇḍāgārikena paṭiññātesu caturāsītiyā dhammakkhandhasahassesu katipayadhammakkhandhasaṅgahaṃ. Vaggato pīṭhavaggo cittalatāvaggo pāricchattakavaggo mañjiṭṭhakavaggo mahārathavaggo pāyāsivaggo sunikkhittavaggoti satta vaggā. Vatthuto paṭhame vagge sattarasa vatthūni, dutiye ekādasa, tatiye dasa, catutthe dvādasa , pañcame catuddasa, chaṭṭhe dasa, sattame ekādasāti antaravimānānaṃ aggahaṇe pañcāsīti, gahaṇe pana tevīsasataṃ vatthūni, gāthāto pana diyaḍḍhasahassagāthā. Tassa vaggesu pīṭhavaggo ādi, vatthūsu sovaṇṇapīṭhavatthu ādi, tassāpi ‘‘pīṭhaṃ te sovaṇṇamaya’’nti gāthā ādi."
  }
]