[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "3. Tikanipāto"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Aṅgaṇikabhāradvājattheragāthāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tikanipāte ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ayoni suddhimanvesa"
      },
      "nti āyasmato aṅgaṇikabhāradvājattherassa gāthā. Kā uppatti? Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayaṃ puññaṃ upacinanto ito ekatiṃse kappe sikhissa bhagavato kāle kulagehe nibbattitvā viññutaṃ patto ekadivasaṃ satthāraṃ piṇḍāya carantaṃ disvā pasannamānaso pañcapatiṭṭhitena vanditvā añjaliṃ paggaṇhi. So tena puññakammena devamanussesu saṃsaranto imasmiṃ buddhuppāde himavantasamīpe ukkaṭṭhe nāma nagare vibhavasampannassa brāhmaṇassa gehe nibbattitvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṅgaṇikabhāradvājo"
      },
      "ti laddhanāmo vayappatto vijjāsippesu nipphattiṃ gato nekkhammajjhāsayatāya paribbājakapabbajjaṃ pabbajitvā amaraṃ tapaṃ caranto tattha tattha vicaranto sammāsambuddhaṃ janapadacārikaṃ carantaṃ disvā pasannamānaso satthu santike dhammaṃ sutvā taṃ micchātapaṃ pahāya sāsane pabbajitvā vipassanāya kammaṃ karonto nacirasseva chaḷabhiñño ahosi. Tena vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "apadāne"
      },
      " (apa. thera 1.23.48-51) –"
    ],
    "innerText": "Tikanipāte ayoni suddhimanvesanti āyasmato aṅgaṇikabhāradvājattherassa gāthā. Kā uppatti? Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayaṃ puññaṃ upacinanto ito ekatiṃse kappe sikhissa bhagavato kāle kulagehe nibbattitvā viññutaṃ patto ekadivasaṃ satthāraṃ piṇḍāya carantaṃ disvā pasannamānaso pañcapatiṭṭhitena vanditvā añjaliṃ paggaṇhi. So tena puññakammena devamanussesu saṃsaranto imasmiṃ buddhuppāde himavantasamīpe ukkaṭṭhe nāma nagare vibhavasampannassa brāhmaṇassa gehe nibbattitvā aṅgaṇikabhāradvājoti laddhanāmo vayappatto vijjāsippesu nipphattiṃ gato nekkhammajjhāsayatāya paribbājakapabbajjaṃ pabbajitvā amaraṃ tapaṃ caranto tattha tattha vicaranto sammāsambuddhaṃ janapadacārikaṃ carantaṃ disvā pasannamānaso satthu santike dhammaṃ sutvā taṃ micchātapaṃ pahāya sāsane pabbajitvā vipassanāya kammaṃ karonto nacirasseva chaḷabhiñño ahosi. Tena vuttaṃ apadāne (apa. thera 1.23.48-51) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Usabhaṃ pavaraṃ vīraṃ, vessabhuṃ vijitāvinaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pasannacitto sumano, buddhaseṭṭhamavandahaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ekatiṃse ito kappe, yaṃ kammamakariṃ tadā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Duggatiṃ nābhijānāmi, vandanāya idaṃ phalaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Catuvīsatikappamhi, vikatānandanāmako;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sattaratanasampanno, cakkavattī mahabbalo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kilesā jhāpitā mayhaṃ…pe… kataṃ buddhassa sāsana’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Chaḷabhiñño pana hutvā vimuttisukhena viharanto ñātīnaṃ anukampāya attano jātibhūmiṃ gantvā bahū ñātake saraṇesu ca sīlesu ca patiṭṭhāpetvā tato nivattitvā kururaṭṭhe kuṇḍiyassa ",
      " nāma nigamassa avidūre ",
      " araññe vasanto kenacideva karaṇīyena uggārāmaṃ gato uttarāpathato āgatehi sandiṭṭhehi brāhmaṇehi ",
      " samāgato tehi, ‘‘bho bhāradvāja, kiṃ disvā brāhmaṇānaṃ samayaṃ pahāya imaṃ samayaṃ gaṇhī’’ti pucchito tesaṃ ito buddhasāsanato bahiddhā suddhi natthīti dassento –"
    ],
    "innerText": "Chaḷabhiñño pana hutvā vimuttisukhena viharanto ñātīnaṃ anukampāya attano jātibhūmiṃ gantvā bahū ñātake saraṇesu ca sīlesu ca patiṭṭhāpetvā tato nivattitvā kururaṭṭhe kuṇḍiyassa nāma nigamassa avidūre araññe vasanto kenacideva karaṇīyena uggārāmaṃ gato uttarāpathato āgatehi sandiṭṭhehi brāhmaṇehi samāgato tehi, ‘‘bho bhāradvāja, kiṃ disvā brāhmaṇānaṃ samayaṃ pahāya imaṃ samayaṃ gaṇhī’’ti pucchito tesaṃ ito buddhasāsanato bahiddhā suddhi natthīti dassento –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "219"
      },
      "."
    ],
    "innerText": "219."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ayoni suddhimanvesaṃ, aggiṃ paricariṃ vane;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Suddhimaggaṃ ajānanto, akāsiṃ amaraṃ tapa’’nti. – paṭhamaṃ gāthamāha;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ayonī"
      },
      "ti ayoniso anupāyena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suddhi"
      },
      "nti saṃsārasuddhiṃ bhavanissaraṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anvesa"
      },
      "nti gavesanto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aggiṃ paricariṃ vane"
      },
      "ti ‘‘ayaṃ suddhimaggo’’ti adhippāyena araññāyatane aggihutasālāyaṃ agyāgāraṃ katvā āhutiṃ paggaṇhanto aggidevaṃ paricariṃ vede vuttavidhinā pūjesiṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suddhimaggaṃ ajānanto, akāsiṃ amaraṃ tapa"
      },
      "nti suddhiyā nibbānassa maggaṃ ajānanto aggiparicaraṇaṃ viya pañcatapatappanādiattakilamathānuyogaṃ ‘‘suddhimaggo’’ti maññāya akāsiṃ acariṃ paṭipajjiṃ."
    ],
    "innerText": "Tattha ayonīti ayoniso anupāyena. Suddhinti saṃsārasuddhiṃ bhavanissaraṇaṃ. Anvesanti gavesanto. Aggiṃ paricariṃ vaneti ‘‘ayaṃ suddhimaggo’’ti adhippāyena araññāyatane aggihutasālāyaṃ agyāgāraṃ katvā āhutiṃ paggaṇhanto aggidevaṃ paricariṃ vede vuttavidhinā pūjesiṃ. Suddhimaggaṃ ajānanto, akāsiṃ amaraṃ tapanti suddhiyā nibbānassa maggaṃ ajānanto aggiparicaraṇaṃ viya pañcatapatappanādiattakilamathānuyogaṃ ‘‘suddhimaggo’’ti maññāya akāsiṃ acariṃ paṭipajjiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ thero assamato assamaṃ gacchanto viya vede vuttavidhinā aggiparicaraṇādinā anuṭṭhāya suddhiyā appattabhāvena bahiddhā suddhiyā abhāvaṃ dassetvā idāni imasmiṃyeva sāsane suddhi ca mayā adhigatāti dassento –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "220"
      },
      "."
    ],
    "innerText": "220."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Taṃ sukhena sukhaṃ laddhaṃ, passa dhammasudhammataṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tisso vijjā anuppattā, kataṃ buddhassa sāsana’’nti. – dutiyagāthamāha;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ta"
      },
      "nti yassatthāya suddhiṃ anvesanto tassa maggaṃ ajānanto aggiṃ paricariṃ amaraṃ tapaṃ acariṃ, taṃ nibbāna",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sukhaṃ sukhena"
      },
      " samathavipassanāya sukhāya paṭipadāya attakilamathānuyogaṃ anupagamma mayā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "laddhaṃ"
      },
      " pattaṃ adhigataṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Passa dhammasudhammata"
      },
      "nti satthu sāsanadhammassa sudhammataṃ aviparītaniyyānikadhammasabhāvaṃ ",
      " passa jānāhīti dhammālapanavasena vadati, attānaṃ vā ālapati. Tassa laddhabhāvaṃ pana dassento –"
    ],
    "innerText": "Tattha tanti yassatthāya suddhiṃ anvesanto tassa maggaṃ ajānanto aggiṃ paricariṃ amaraṃ tapaṃ acariṃ, taṃ nibbānasukhaṃ sukhena samathavipassanāya sukhāya paṭipadāya attakilamathānuyogaṃ anupagamma mayā laddhaṃ pattaṃ adhigataṃ. Passa dhammasudhammatanti satthu sāsanadhammassa sudhammataṃ aviparītaniyyānikadhammasabhāvaṃ passa jānāhīti dhammālapanavasena vadati, attānaṃ vā ālapati. Tassa laddhabhāvaṃ pana dassento –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Tisso vijjā anuppattā, kataṃ buddhassa sāsana’’"
      },
      "nti. –"
    ],
    "innerText": "‘‘Tisso vijjā anuppattā, kataṃ buddhassa sāsana’’nti. –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Āha ",
      ", taṃ vuttatthameva. Evaṃ suddhiyā adhigatattā ‘‘ito paṭṭhāyāhaṃ paramatthato brāhmaṇo’’ti dassento –"
    ],
    "innerText": "Āha , taṃ vuttatthameva. Evaṃ suddhiyā adhigatattā ‘‘ito paṭṭhāyāhaṃ paramatthato brāhmaṇo’’ti dassento –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "221"
      },
      "."
    ],
    "innerText": "221."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " ‘‘Brahmabandhu ",
      " pure āsiṃ, idāni khomhi brāhmaṇo;"
    ],
    "innerText": "‘‘Brahmabandhu pure āsiṃ, idāni khomhi brāhmaṇo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tevijjo nhātakocamhi, sottiyo camhi vedagū’’ti. – tatiyaṃ gāthamāha;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tassattho – ito pubbe jātimattena brāhmaṇabhāvato brāhmaṇānaṃ samaññāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "brahmabandhu"
      },
      " nāma ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āsiṃ"
      },
      ". Bāhitapāpattā pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "idāni kho"
      },
      " arahattādhigamena paramatthato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "brāhmaṇo ca amhi"
      },
      ". Ito pubbe bhavasañcayakarānaṃ tissannaṃ vedasaṅkhātānaṃ vijjānaṃ ajjhayanena samaññāmattena tevijjo nāma hutvā idāni bhavakkhayakarāya vijjāya vasena tissannaṃ vijjānaṃ adhigatattā paramatthato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tevijjo ca amhi"
      },
      ". Tathā ito pubbe bhavassādagadhitāya nhātakavatanipphattiyā samaññāmattena nhātako nāma hutvā idāni aṭṭhaṅgikamaggajalena suvikkhālitakilesamalatāya paramatthato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nhātako camhi"
      },
      ". Ito pubbe avimuttabhavassādamantajjhānena vohāramattato sottiyo nāma hutvā idāni suvimuttabhavassādadhammajjhānena paramatthato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sottiyo camhi"
      },
      ". Ito pubbe appaṭinissaṭṭhapāpadhammānaṃ vedānaṃ gatamattena vedagū nāma hutvā idāni vedasaṅkhātena maggañāṇena saṃsāramahoghassa vedassa catusaccassa ca pāraṃ gatattā adhigatattā ñātattā paramatthato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vedagū"
      },
      " jātoti. Taṃ sutvā brāhmaṇā sāsane uḷāraṃ pasādaṃ pavedesuṃ."
    ],
    "innerText": "Tassattho – ito pubbe jātimattena brāhmaṇabhāvato brāhmaṇānaṃ samaññāya brahmabandhu nāma āsiṃ. Bāhitapāpattā pana idāni kho arahattādhigamena paramatthato brāhmaṇo ca amhi. Ito pubbe bhavasañcayakarānaṃ tissannaṃ vedasaṅkhātānaṃ vijjānaṃ ajjhayanena samaññāmattena tevijjo nāma hutvā idāni bhavakkhayakarāya vijjāya vasena tissannaṃ vijjānaṃ adhigatattā paramatthato tevijjo ca amhi. Tathā ito pubbe bhavassādagadhitāya nhātakavatanipphattiyā samaññāmattena nhātako nāma hutvā idāni aṭṭhaṅgikamaggajalena suvikkhālitakilesamalatāya paramatthato nhātako camhi. Ito pubbe avimuttabhavassādamantajjhānena vohāramattato sottiyo nāma hutvā idāni suvimuttabhavassādadhammajjhānena paramatthato sottiyo camhi. Ito pubbe appaṭinissaṭṭhapāpadhammānaṃ vedānaṃ gatamattena vedagū nāma hutvā idāni vedasaṅkhātena maggañāṇena saṃsāramahoghassa vedassa catusaccassa ca pāraṃ gatattā adhigatattā ñātattā paramatthato vedagū jātoti. Taṃ sutvā brāhmaṇā sāsane uḷāraṃ pasādaṃ pavedesuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Aṅgaṇikabhāradvājattheragāthāvaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Paccayattheragāthāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañcāhāhaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pabbajito"
      },
      "ti āyasmato paccayattherassa gāthā. Kā uppatti? Ayampi purimabuddhesu katādhikāro tattha tattha bhave puññāni upacinanto ito ekanavute kappe vipassissa bhagavato kāle kulagehe nibbattitvā viññutaṃ patto ekadivasaṃ satthāraṃ vinatāya nāma nadiyā tīre gacchantaṃ disvā pasannamānaso manuññadassanāni mahantāni udumbaraphalāni ocinitvā upanāmesi. So tena puññakammena sugatīsuyeva saṃsaranto imasmiṃ bhaddakappe kassape bhagavati loke uppajjitvā pavattavaradhammacakke veneyyajanānuggahaṃ karonte tassa sāsane pabbajitvā vipassanaṃ paṭṭhapetvā bhāvanamanuyuñjanto ekadivasaṃ saṃsāradukkhaṃ cintetvā"
    ],
    "innerText": "Pañcāhāhaṃpabbajitoti āyasmato paccayattherassa gāthā. Kā uppatti? Ayampi purimabuddhesu katādhikāro tattha tattha bhave puññāni upacinanto ito ekanavute kappe vipassissa bhagavato kāle kulagehe nibbattitvā viññutaṃ patto ekadivasaṃ satthāraṃ vinatāya nāma nadiyā tīre gacchantaṃ disvā pasannamānaso manuññadassanāni mahantāni udumbaraphalāni ocinitvā upanāmesi. So tena puññakammena sugatīsuyeva saṃsaranto imasmiṃ bhaddakappe kassape bhagavati loke uppajjitvā pavattavaradhammacakke veneyyajanānuggahaṃ karonte tassa sāsane pabbajitvā vipassanaṃ paṭṭhapetvā bhāvanamanuyuñjanto ekadivasaṃ saṃsāradukkhaṃ cintetvā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Ativiya ",
      " sañjātasaṃvego vihāre nisinno ‘‘arahattaṃ appatvā ito na nikkhamissāmī’’ti ",
      " cittaṃ adhiṭṭhāya vāyamanto ñāṇassa aparipakkattā vipassanaṃ ussukkāpetuṃ nāsakkhi. So kālaṅkatvā devamanussesu saṃsaranto imasmiṃ buddhuppāde rohitanagare khattiyakule nibbattitvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paccayo"
      },
      "ti laddhanāmo vayappatto pitu accayena rajje patiṭṭhito ekadivasaṃ mahārājabaliṃ kātuṃ ārabhi. Tattha mahājano sannipati. Tasmiṃ samāgame tassa pasādañjananatthaṃ satthā mahājanassa pekkhantasseva ākāse vessavaṇena nimmite ratanamayakūṭāgāre ratanamayasīhāsane nisīditvā dhammaṃ desesi. Mahato janakāyassa dhammābhisamayo ahosi. Taṃ dhammaṃ sutvā paccayarājāpi rajjaṃ pahāya purimahetusañcodito pabbaji. So yathā kassapassa bhagavato kāle paṭiññaṃ akāsi, evaṃ paṭiññaṃ katvā vihāraṃ pavisitvā vipassanaṃ vaḍḍhento ñāṇassa paripākaṃ gatattā tāvadeva arahattaṃ pāpuṇi. Tena vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "apadāne"
      },
      " (apa. thera 1.39.15-20) –"
    ],
    "innerText": "Ativiya sañjātasaṃvego vihāre nisinno ‘‘arahattaṃ appatvā ito na nikkhamissāmī’’ti cittaṃ adhiṭṭhāya vāyamanto ñāṇassa aparipakkattā vipassanaṃ ussukkāpetuṃ nāsakkhi. So kālaṅkatvā devamanussesu saṃsaranto imasmiṃ buddhuppāde rohitanagare khattiyakule nibbattitvā paccayoti laddhanāmo vayappatto pitu accayena rajje patiṭṭhito ekadivasaṃ mahārājabaliṃ kātuṃ ārabhi. Tattha mahājano sannipati. Tasmiṃ samāgame tassa pasādañjananatthaṃ satthā mahājanassa pekkhantasseva ākāse vessavaṇena nimmite ratanamayakūṭāgāre ratanamayasīhāsane nisīditvā dhammaṃ desesi. Mahato janakāyassa dhammābhisamayo ahosi. Taṃ dhammaṃ sutvā paccayarājāpi rajjaṃ pahāya purimahetusañcodito pabbaji. So yathā kassapassa bhagavato kāle paṭiññaṃ akāsi, evaṃ paṭiññaṃ katvā vihāraṃ pavisitvā vipassanaṃ vaḍḍhento ñāṇassa paripākaṃ gatattā tāvadeva arahattaṃ pāpuṇi. Tena vuttaṃ apadāne (apa. thera 1.39.15-20) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Vinatānadiyā tīre, vihāsi purisuttamo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Addasaṃ virajaṃ buddhaṃ, ekaggaṃ susamāhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tasmiṃ pasannamānaso, kilesamaladhovane;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Udumbaraphalaṃ gayha, buddhaseṭṭhassadāsahaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Ekanavutito ",
      " kappe, yaṃ phalamadadiṃ tadā;"
    ],
    "innerText": "‘‘Ekanavutito kappe, yaṃ phalamadadiṃ tadā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Duggatiṃ nābhijānāmi, phaladānassidaṃ phalaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Imamhi bhaddake kappe, saṃviggamānamānaso;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kassapassa bhagavato, sāsane pabbajiṃ ahaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tathā pabbajito santo, bhāvanaṃ anuyuñjisaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Na vihārā nikkhamissaṃ, iti katvāna mānasaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Uttamatthaṃ asampatto, na ca pattomhi tāvade;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Idāni pana ñāṇassa, paripākena nibbuto;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pattomhi acalaṃ ṭhānaṃ, phusitvā accutaṃ padaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kilesā jhāpitā mayhaṃ…pe… kataṃ buddhassa sāsana’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Arahattaṃ pana patvā attano paṭipattikittanamukhena aññaṃ byākaronto –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "222"
      },
      "."
    ],
    "innerText": "222."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " ‘‘Pañcāhāhaṃ ",
      " pabbajito, sekho appattamānaso;"
    ],
    "innerText": "‘‘Pañcāhāhaṃ pabbajito, sekho appattamānaso;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vihāraṃ me paviṭṭhassa, cetaso paṇidhī ahu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "223"
      },
      "."
    ],
    "innerText": "223."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Nāsissaṃ na pivissāmi, vihārato na nikkhame;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Napi passaṃ nipātessaṃ, taṇhāsalle anūhate."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "224"
      },
      "."
    ],
    "innerText": "224."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tassa mevaṃ viharato, passa vīriyaparakkamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tisso vijjā anuppattā, kataṃ buddhassa sāsana’’nti. –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Imā tisso gāthā abhāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pañcāhāhaṃ pabbajito"
      },
      "ti pañcāho ahaṃ, pabbajito hutvā pañcāho, pabbajitadivasato pañcamo aho niṭṭhitoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sekho appattamānaso"
      },
      "ti adhisīlasikkhādīnaṃ sikkhanato sekho. Anavasesato mānaṃ siyati samucchindatīti mānaso, aggamaggo, taṃnibbattito mānasato āgataṃ mānasaṃ, arahattaṃ, taṃ, so vā appatto ",
      " etenāti appattamānaso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vihāraṃ me paviṭṭhassa, cetaso paṇidhī ahū"
      },
      "ti evaṃ sekhassa me vasanakavihāraṃ ovarakaṃ paviṭṭhassa sato evarūpo idāni vuccamānākāro cetopaṇidhi ahosi, evaṃ mayā cittaṃ paṇihitanti attho."
    ],
    "innerText": "Tattha pañcāhāhaṃ pabbajitoti pañcāho ahaṃ, pabbajito hutvā pañcāho, pabbajitadivasato pañcamo aho niṭṭhitoti attho. Sekho appattamānasoti adhisīlasikkhādīnaṃ sikkhanato sekho. Anavasesato mānaṃ siyati samucchindatīti mānaso, aggamaggo, taṃnibbattito mānasato āgataṃ mānasaṃ, arahattaṃ, taṃ, so vā appatto etenāti appattamānaso. Vihāraṃ me paviṭṭhassa, cetaso paṇidhī ahūti evaṃ sekhassa me vasanakavihāraṃ ovarakaṃ paviṭṭhassa sato evarūpo idāni vuccamānākāro cetopaṇidhi ahosi, evaṃ mayā cittaṃ paṇihitanti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nāsissa"
      },
      "ntiādinā ",
      " cittapaṇidhiṃ dasseti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nāsissa"
      },
      "nti yaṃkiñci bhojanaṃ na bhuñjissaṃ na bhuñjissāmi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "taṇhāsalle"
      },
      " mama hadayagate ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anūhate"
      },
      " anuddhateti evaṃ sabbapadesu yojetabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na pivissāmī"
      },
      "ti yaṃkiñci pātabbaṃ na pivissāmi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vihārato na nikkhame"
      },
      "ti imasmā idāni mayā nisinnagabbhato na nikkhameyyaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Napi passaṃ nipātessa"
      },
      "nti mama sarīrassa dvīsu passesu ekampi passaṃ kāyakilamathavinodanatthaṃ na nipātessaṃ, ekapassenapi na nipajjissāmīti attho."
    ],
    "innerText": "Nāsissantiādinā cittapaṇidhiṃ dasseti. Tattha nāsissanti yaṃkiñci bhojanaṃ na bhuñjissaṃ na bhuñjissāmi taṇhāsalle mama hadayagate anūhate anuddhateti evaṃ sabbapadesu yojetabbaṃ. Na pivissāmīti yaṃkiñci pātabbaṃ na pivissāmi. Vihārato na nikkhameti imasmā idāni mayā nisinnagabbhato na nikkhameyyaṃ. Napi passaṃ nipātessanti mama sarīrassa dvīsu passesu ekampi passaṃ kāyakilamathavinodanatthaṃ na nipātessaṃ, ekapassenapi na nipajjissāmīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tassa mevaṃ viharato"
      },
      "ti tassa me evaṃ cittaṃ paṇidhāya daḷhavīriyādhiṭṭhānaṃ katvā vipassanānuyogavasena viharato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Passa vīriyaparakkama"
      },
      "nti vidhinā īrayitabbato ‘‘vīriyaṃ’’ paraṃ ṭhānaṃ akkamanato ‘‘parakkamo’’ti ca laddhanāmaṃ ussoḷhībhūtaṃ vāyāmaṃ passa jānāhi. Yassa panānubhāvena mayā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tisso vijjā anuppattā, kataṃ buddhassa sāsana"
      },
      "nti vuttatthameva."
    ],
    "innerText": "Tassa mevaṃ viharatoti tassa me evaṃ cittaṃ paṇidhāya daḷhavīriyādhiṭṭhānaṃ katvā vipassanānuyogavasena viharato. Passa vīriyaparakkamanti vidhinā īrayitabbato ‘‘vīriyaṃ’’ paraṃ ṭhānaṃ akkamanato ‘‘parakkamo’’ti ca laddhanāmaṃ ussoḷhībhūtaṃ vāyāmaṃ passa jānāhi. Yassa panānubhāvena mayā tisso vijjā anuppattā, kataṃ buddhassa sāsananti vuttatthameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paccayattheragāthāvaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Bākulattheragāthāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yo"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pubbe karaṇīyānī"
      },
      "ti āyasmato bākulattherassa gāthā. Kā uppatti? Ayampi kira atīte ito kappasatasahassādhikassa asaṅkhyeyyassa matthake anomadassissa bhagavato uppattito puretarameva brāhmaṇakule nibbattitvā vayappatto tayo vede uggahetvā tattha sāraṃ apassanto ‘‘samparāyikatthaṃ gavesissāmī’’ti isipabbajjaṃ pabbajitvā pabbatapāde viharanto pañcābhiññāaṭṭhasamāpattilābhī hutvā viharanto buddhuppādaṃ sutvā satthu santikaṃ gantvā dhammaṃ sutvā saraṇesu ",
      " patiṭṭhito satthu udarābādhe uppanne araññato bhesajjāni āharitvā taṃ vūpasametvā tattha puññaṃ ārogyatthāya pariṇāmetvā tato cuto brahmaloke nibbattitvā ekaṃ asaṅkhyeyyaṃ devamanussesu saṃsaranto padumuttarabuddhakāle haṃsavatīnagare kulagehe nibbatto satthāraṃ ekaṃ bhikkhuṃ appābādhānaṃ aggaṭṭhāne ṭhapentaṃ disvā sayaṃ taṃ ṭhānantaraṃ ākaṅkhanto paṇidhānaṃ katvā yāvajīvaṃ kusalaṃ upacinitvā sugatīsuyeva saṃsaranto vipassissa bhagavato nibbattito puretarameva bandhumatīnagare brāhmaṇakule nibbatto purimanayeneva isipabbajjaṃ pabbajitvā jhānābhiññālābhī hutvā pabbatapāde vasanto buddhuppādaṃ sutvā satthu santikaṃ gantvā dhammaṃ sutvā saraṇesu ",
      " patiṭṭhito bhikkhūnaṃ tiṇapupphakaroge uppanne taṃ vūpasametvā tattha yāvatāyukaṃ ṭhatvā tato cuto brahmaloke nibbattitvā ekanavutikappe devamanussesu saṃsaranto kassapassa bhagavato kāle bārāṇasiyaṃ kulagehe nibbattitvā gharāvāsaṃ vasanto ekaṃ jiṇṇaṃ vinassamānaṃ mahāvihāraṃ disvā tattha uposathāgārādikaṃ sabbaṃ āvasathaṃ kāretvā tattha bhikkhusaṅghassa sabbaṃ bhesajjaṃ paṭiyādetvā yāvajīvaṃ kusalaṃ katvā ekaṃ buddhantaraṃ devamanussesu saṃsaranto amhākaṃ bhagavato uppattito puretarameva kosambiyaṃ seṭṭhigehe nibbatti. So arogabhāvāya mahāyamunāya nhāpiyamāno dhātiyā hatthato macchena gilito macche kevaṭṭahatthagate bārāṇasiseṭṭhibhariyāya vikkiṇitvā gahite phāliyamānepi puññabalena arogoyeva hutvā tāya puttoti gahetvā posiyamāno taṃ pavattiṃ sutvā janakehi mātāpitūhi ‘‘ayaṃ amhākaṃ putto, detha no putta’’nti anuyoge kate raññā ‘‘ubhayesampi sādhāraṇo hotū’’ti dvinnaṃ kulānaṃ dāyādabhāvena vinicchayaṃ katvā ṭhapitattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bākulo"
      },
      "ti laddhanāmo vayappatto hutvā mahatiṃ sampattiṃ anubhavanto āsītiko hutvā satthu santike dhammaṃ sutvā paṭiladdhasaddho pabbajitvā sattāhameva puthujjano ahosi, aṭṭhame aruṇe saha paṭisambhidāhi arahattaṃ pāpuṇi. Tena vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "apadāne"
      },
      " (apa. thera 1.40.386-411) –"
    ],
    "innerText": "Yopubbe karaṇīyānīti āyasmato bākulattherassa gāthā. Kā uppatti? Ayampi kira atīte ito kappasatasahassādhikassa asaṅkhyeyyassa matthake anomadassissa bhagavato uppattito puretarameva brāhmaṇakule nibbattitvā vayappatto tayo vede uggahetvā tattha sāraṃ apassanto ‘‘samparāyikatthaṃ gavesissāmī’’ti isipabbajjaṃ pabbajitvā pabbatapāde viharanto pañcābhiññāaṭṭhasamāpattilābhī hutvā viharanto buddhuppādaṃ sutvā satthu santikaṃ gantvā dhammaṃ sutvā saraṇesu patiṭṭhito satthu udarābādhe uppanne araññato bhesajjāni āharitvā taṃ vūpasametvā tattha puññaṃ ārogyatthāya pariṇāmetvā tato cuto brahmaloke nibbattitvā ekaṃ asaṅkhyeyyaṃ devamanussesu saṃsaranto padumuttarabuddhakāle haṃsavatīnagare kulagehe nibbatto satthāraṃ ekaṃ bhikkhuṃ appābādhānaṃ aggaṭṭhāne ṭhapentaṃ disvā sayaṃ taṃ ṭhānantaraṃ ākaṅkhanto paṇidhānaṃ katvā yāvajīvaṃ kusalaṃ upacinitvā sugatīsuyeva saṃsaranto vipassissa bhagavato nibbattito puretarameva bandhumatīnagare brāhmaṇakule nibbatto purimanayeneva isipabbajjaṃ pabbajitvā jhānābhiññālābhī hutvā pabbatapāde vasanto buddhuppādaṃ sutvā satthu santikaṃ gantvā dhammaṃ sutvā saraṇesu patiṭṭhito bhikkhūnaṃ tiṇapupphakaroge uppanne taṃ vūpasametvā tattha yāvatāyukaṃ ṭhatvā tato cuto brahmaloke nibbattitvā ekanavutikappe devamanussesu saṃsaranto kassapassa bhagavato kāle bārāṇasiyaṃ kulagehe nibbattitvā gharāvāsaṃ vasanto ekaṃ jiṇṇaṃ vinassamānaṃ mahāvihāraṃ disvā tattha uposathāgārādikaṃ sabbaṃ āvasathaṃ kāretvā tattha bhikkhusaṅghassa sabbaṃ bhesajjaṃ paṭiyādetvā yāvajīvaṃ kusalaṃ katvā ekaṃ buddhantaraṃ devamanussesu saṃsaranto amhākaṃ bhagavato uppattito puretarameva kosambiyaṃ seṭṭhigehe nibbatti. So arogabhāvāya mahāyamunāya nhāpiyamāno dhātiyā hatthato macchena gilito macche kevaṭṭahatthagate bārāṇasiseṭṭhibhariyāya vikkiṇitvā gahite phāliyamānepi puññabalena arogoyeva hutvā tāya puttoti gahetvā posiyamāno taṃ pavattiṃ sutvā janakehi mātāpitūhi ‘‘ayaṃ amhākaṃ putto, detha no putta’’nti anuyoge kate raññā ‘‘ubhayesampi sādhāraṇo hotū’’ti dvinnaṃ kulānaṃ dāyādabhāvena vinicchayaṃ katvā ṭhapitattā bākuloti laddhanāmo vayappatto hutvā mahatiṃ sampattiṃ anubhavanto āsītiko hutvā satthu santike dhammaṃ sutvā paṭiladdhasaddho pabbajitvā sattāhameva puthujjano ahosi, aṭṭhame aruṇe saha paṭisambhidāhi arahattaṃ pāpuṇi. Tena vuttaṃ apadāne (apa. thera 1.40.386-411) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Himavantassāvidūre ",
      ", sobhito nāma pabbato;"
    ],
    "innerText": "‘‘Himavantassāvidūre , sobhito nāma pabbato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Assamo sukato mayhaṃ, sakasissehi māpito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Maṇḍapā ca bahū tattha, pupphitā sindhuvārakā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kapitthā ca bahū tattha, pupphitā jīvajīvakā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Nigguṇḍiyo bahū tattha, badarāmalakāni ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Phārusakā alābū ca, puṇḍarīkā ca pupphitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Āḷakā beluvā tattha, kadalī mātuluṅgakā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Mahānāmā bahū tattha, ajjunā ca piyaṅgukā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kosambā saḷalā nimbā, nigrodhā ca kapitthanā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ediso assamo mayhaṃ, sasissohaṃ tahiṃ vasiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Anomadassī bhagavā, sayambhū lokanāyako;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Gavesaṃ paṭisallānaṃ, mamassamamupāgami."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Upetamhi mahāvīre, anomadassimahāyase;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Khaṇena lokanāthassa, vātābādho samuṭṭhahi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Vicaranto araññamhi, addasaṃ lokanāyakaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Upagantvāna sambuddhaṃ, cakkhumantaṃ mahāyasaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Iriyañcāpi disvāna, upalakkhesahaṃ tadā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Asaṃsayañhi buddhassa, byādhi no udapajjatha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Khippaṃ assamamāgañchiṃ, mama sissāna santike;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhesajjaṃ kattukāmohaṃ, sisse āmantayiṃ tadā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Paṭissuṇitvāna me vākyaṃ, sissā sabbe sagāravā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ekajjhaṃ sannipatiṃsu, satthugāravatā mama."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Khippaṃ pabbatamāruyha, sabbosadhamahāsahaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pānīyayogaṃ katvāna, buddhaseṭṭhassadāsahaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Paribhutte mahāvīre, sabbaññulokanāyake;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Khippaṃ vāto vūpasami, sugatassa mahesino."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Passaddhaṃ ",
      " darathaṃ disvā, anomadassī mahāyaso;"
    ],
    "innerText": "‘‘Passaddhaṃ darathaṃ disvā, anomadassī mahāyaso;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sakāsane nisīditvā, imā gāthā abhāsatha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yo me pādāsi bhesajjaṃ, byādhiñca samayī mama;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tamahaṃ kittayissāmi, suṇātha mama bhāsato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kappasatasahassāni, devaloke ramissati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vādite tūriye tattha, modissati sadā ayaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Manussalokamāgantvā ",
      ", sukkamūlena codito;"
    ],
    "innerText": "‘‘Manussalokamāgantvā , sukkamūlena codito;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sahassakkhattuṃ rājā ca, cakkavattī bhavissati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Pañcapaññāsakappamhi, anomo nāma khattiyo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Cāturanto vijitāvī, jambumaṇḍassa issaro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sattaratanasampanno, cakkavattī mahabbalo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tāvatiṃsepi khobhetvā, issaraṃ kārayissati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Devabhūto manusso vā, appābādho bhavissati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pariggahaṃ vivajjetvā, byādhiṃ loke tarissati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Aparimeyye ito kappe, okkākakulasambhavo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Gotamo nāma gottena, satthā loke bhavissati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tassa dhammesu dāyādo, oraso dhammanimmito;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sabbāsave pariññāya, nibbāyissatināsavo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kilese jhāpayitvāna, taṇhāsotaṃ tarissati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bākulo nāma nāmena, hessati satthu sāvako."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Idaṃ sabbaṃ abhiññāya, gotamo sakyapuṅgavo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhikkhusaṅghe nisīditvā, etadagge ṭhapessati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Anomadassī bhagavā, sayambhū lokanāyako;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vivekānuvilokento, mamassamamupāgami."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Upāgataṃ mahāvīraṃ, sabbaññuṃ lokanāyakaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sabbosadhena tappesiṃ, pasanno sehi pāṇibhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Tassa ",
      " me sukataṃ kammaṃ, sukhette bījasampadā;"
    ],
    "innerText": "‘‘Tassa me sukataṃ kammaṃ, sukhette bījasampadā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Khepetuṃ neva sakkomi, tadā hi sukataṃ mama."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Lābhā mama suladdhaṃ me, yohaṃ addakkhi nāyakaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tena kammāvasesena, pattomhi acalaṃ padaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sabbametaṃ abhiññāya, gotamo sakyapuṅgavo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhikkhusaṅghe nisīditvā, etadagge ṭhapesi maṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Aparimeyye ito kappe, yaṃ kammamakariṃ tadā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Duggatiṃ nābhijānāmi, bhesajjassa idaṃ phalaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kilesā jhāpitā mayhaṃ…pe… kataṃ buddhassa sāsana’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Arahattaṃ pana patvā ekadivasaṃ satthārā attano sāvake paṭipāṭiyā ṭhānantare ṭhapentena appābādhānaṃ ",
      " aggaṭṭhāne ṭhapito so parinibbānasamaye saṅghamajjhe bhikkhūnaṃ ovādamukhena aññaṃ byākaronto –"
    ],
    "innerText": "Arahattaṃ pana patvā ekadivasaṃ satthārā attano sāvake paṭipāṭiyā ṭhānantare ṭhapentena appābādhānaṃ aggaṭṭhāne ṭhapito so parinibbānasamaye saṅghamajjhe bhikkhūnaṃ ovādamukhena aññaṃ byākaronto –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "225"
      },
      "."
    ],
    "innerText": "225."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yo pubbe karaṇīyāni, pacchā so kātumicchati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sukhā so dhaṃsate ṭhānā, pacchā ca manutappati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "226"
      },
      "."
    ],
    "innerText": "226."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yañhi kayirā tañhi vade, yaṃ na kayirā na taṃ vade;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Akarontaṃ bhāsamānaṃ, parijānanti paṇḍitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "227"
      },
      "."
    ],
    "innerText": "227."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Susukhaṃ vata nibbānaṃ, sammāsambuddhadesitaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Asokaṃ virajaṃ khemaṃ, yattha dukkhaṃ nirujjhatī’’ti. – gāthāttayamabhāsi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yo pubbe karaṇīyāni, pacchā so kātumicchatī"
      },
      "ti yo puggalo pubbe puretaraṃ jarārogādīhi anabhibhūtakāleyeva kātabbāni attano hitasukhāvahāni kammāni pamādavasena akatvā pacchā so kātabbakālaṃ atikkamitvā kātuṃ icchati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "So"
      },
      "ti ca nipātamattaṃ. Tadā pana jarārogādīhi abhibhūtattā kātuṃ na sakkoti, asakkonto ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sukhā so dhaṃsate ṭhānā, pacchā ca manutappatī"
      },
      "ti so puggalo sukhā ",
      " ṭhānā saggato nibbānato ca tadupāyassa anuppāditattā parihāyanto ‘‘akataṃ me kalyāṇa’’ntiādinā (ma. ni. 3.248; netti. 120) pacchā ca anutappati vippaṭisāraṃ āpajjati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ma"
      },
      "-kāro padasandhikaro. Ahaṃ pana karaṇīyaṃ katvā eva tumhe evaṃ vadāmīti dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yañhi kayirā’’"
      },
      "ti dutiyaṃ gāthamāha."
    ],
    "innerText": "Tattha yo pubbe karaṇīyāni, pacchā so kātumicchatīti yo puggalo pubbe puretaraṃ jarārogādīhi anabhibhūtakāleyeva kātabbāni attano hitasukhāvahāni kammāni pamādavasena akatvā pacchā so kātabbakālaṃ atikkamitvā kātuṃ icchati. Soti ca nipātamattaṃ. Tadā pana jarārogādīhi abhibhūtattā kātuṃ na sakkoti, asakkonto ca sukhā so dhaṃsate ṭhānā, pacchā ca manutappatīti so puggalo sukhā ṭhānā saggato nibbānato ca tadupāyassa anuppāditattā parihāyanto ‘‘akataṃ me kalyāṇa’’ntiādinā (ma. ni. 3.248; netti. 120) pacchā ca anutappati vippaṭisāraṃ āpajjati. Ma-kāro padasandhikaro. Ahaṃ pana karaṇīyaṃ katvā eva tumhe evaṃ vadāmīti dassento ‘‘yañhi kayirā’’ti dutiyaṃ gāthamāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "parijānantī"
      },
      "ti ‘‘ettako aya’’nti paricchijja jānanti na bahuṃ maññantīti attho. Sammāpaṭipattivasena hi yathāvādī tathākārī eva sobhati, na tato aññathā. Karaṇīyapariyāyena sādhāraṇato vuttamatthaṃ idāni sarūpato dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘susukhaṃ vatā’’"
      },
      "tiādinā tatiyaṃ gāthamāha. Tassattho – sammā sāmaṃ sabbadhammānaṃ buddhattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammāsambuddhena"
      },
      " bhagavatā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "desitaṃ"
      },
      " sabbaso sokahetūnaṃ abhāvato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asokaṃ"
      },
      " vigatarāgādirajattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "virajaṃ"
      },
      " catūhi yogehi anupaddutattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "khemaṃ"
      },
      " nibbānaṃ suṭṭhu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sukhaṃ vata,"
      },
      " kasmā? ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yattha"
      },
      " yasmiṃ nibbāne sakalaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vaṭṭadukkhaṃ nirujjhati"
      },
      " accantameva vūpasamatīti."
    ],
    "innerText": "Tattha parijānantīti ‘‘ettako aya’’nti paricchijja jānanti na bahuṃ maññantīti attho. Sammāpaṭipattivasena hi yathāvādī tathākārī eva sobhati, na tato aññathā. Karaṇīyapariyāyena sādhāraṇato vuttamatthaṃ idāni sarūpato dassetuṃ ‘‘susukhaṃ vatā’’tiādinā tatiyaṃ gāthamāha. Tassattho – sammā sāmaṃ sabbadhammānaṃ buddhattā sammāsambuddhena bhagavatā desitaṃ sabbaso sokahetūnaṃ abhāvato asokaṃ vigatarāgādirajattā virajaṃ catūhi yogehi anupaddutattā khemaṃ nibbānaṃ suṭṭhu sukhaṃ vata, kasmā? Yattha yasmiṃ nibbāne sakalaṃ vaṭṭadukkhaṃ nirujjhati accantameva vūpasamatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Bākulattheragāthāvaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Dhaniyattheragāthāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sukhañce"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jīvituṃ icche"
      },
      "ti āyasmato dhaniyattherassa gāthā. Kā uppatti? Ayampi purimabuddhesu katādhikāro tattha tattha bhave puññāni upacinanto sikhissa bhagavato kāle kulagehe nibbattitvā viññutaṃ patto ekadivasaṃ satthāraṃ disvā pasannamānaso naḷamālāya pūjaṃ akāsi. So tena puññakammena devamanussesu saṃsaranto imasmiṃ buddhuppāde rājagahe kumbhakārakule nibbattitvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhaniyo"
      },
      "ti laddhanāmo vayappatto kumbhakārakammena jīvati. Tena ca samayena satthā dhaniyassa kumbhakārassa sālāyaṃ nisīditvā pukkusātissa kulaputtassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "chadhātuvibhaṅgasuttaṃ"
      },
      " (ma. ni. 3.342 ādayo) desesi. So taṃ sutvā katakicco ahosi. Dhaniyo tassa parinibbutabhāvaṃ sutvā ‘‘niyyānikaṃ vata buddhasāsanaṃ, yattha ekarattiparicayenāpi vaṭṭadukkhato muñcituṃ sakkā’’ti paṭiladdhasaddho pabbajitvā ",
      " kuṭimaṇḍanānuyutto ",
      " viharanto kuṭikaraṇaṃ paṭicca bhagavatā garahito saṅghike senāsane vasanto vipassanaṃ vaḍḍhetvā arahattaṃ pāpuṇi. Tena vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "apadāne"
      },
      " (apa. thera 2.48.1-7) –"
    ],
    "innerText": "Sukhañcejīvituṃ iccheti āyasmato dhaniyattherassa gāthā. Kā uppatti? Ayampi purimabuddhesu katādhikāro tattha tattha bhave puññāni upacinanto sikhissa bhagavato kāle kulagehe nibbattitvā viññutaṃ patto ekadivasaṃ satthāraṃ disvā pasannamānaso naḷamālāya pūjaṃ akāsi. So tena puññakammena devamanussesu saṃsaranto imasmiṃ buddhuppāde rājagahe kumbhakārakule nibbattitvā dhaniyoti laddhanāmo vayappatto kumbhakārakammena jīvati. Tena ca samayena satthā dhaniyassa kumbhakārassa sālāyaṃ nisīditvā pukkusātissa kulaputtassa chadhātuvibhaṅgasuttaṃ (ma. ni. 3.342 ādayo) desesi. So taṃ sutvā katakicco ahosi. Dhaniyo tassa parinibbutabhāvaṃ sutvā ‘‘niyyānikaṃ vata buddhasāsanaṃ, yattha ekarattiparicayenāpi vaṭṭadukkhato muñcituṃ sakkā’’ti paṭiladdhasaddho pabbajitvā kuṭimaṇḍanānuyutto viharanto kuṭikaraṇaṃ paṭicca bhagavatā garahito saṅghike senāsane vasanto vipassanaṃ vaḍḍhetvā arahattaṃ pāpuṇi. Tena vuttaṃ apadāne (apa. thera 2.48.1-7) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Suvaṇṇavaṇṇaṃ sambuddhaṃ, āhutīnaṃ paṭiggahaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vipinaggena gacchantaṃ, addasaṃ lokanāyakaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Naḷamālaṃ gahetvāna, nikkhamanto ca tāvade;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tatthaddasāsiṃ sambuddhaṃ, oghatiṇṇamanāsavaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Pasannacitto sumano, naḷamālamapūjayiṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dakkhiṇeyyaṃ mahāvīraṃ, sabbalokānukampakaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ekatiṃse ito kappe, yaṃ mālamabhiropayiṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Duggatiṃ nābhijānāmi, buddhapūjāyidaṃ phalaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kilesā jhāpitā mayhaṃ…pe… kataṃ buddhassa sāsana’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Arahattaṃ pana patvā ye bhikkhū dhutaṅgasamādhānena attānaṃ ukkaṃsetvā saṅghabhattādiṃ sādiyante aññe bhikkhū avajānanti, tesaṃ ovādadānamukhena aññaṃ byākaronto –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "228"
      },
      "."
    ],
    "innerText": "228."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sukhañce jīvituṃ icche, sāmaññasmiṃ apekkhavā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Saṅghikaṃ nātimaññeyya, cīvaraṃ pānabhojanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "229"
      },
      "."
    ],
    "innerText": "229."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " Sukhañce ",
      " jīvituṃ icche, sāmaññasmiṃ apekkhavā;"
    ],
    "innerText": "Sukhañce jīvituṃ icche, sāmaññasmiṃ apekkhavā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ahi mūsikasobbhaṃva, sevetha sayanāsanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "230"
      },
      "."
    ],
    "innerText": "230."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sukhañce jīvituṃ icche, sāmaññasmiṃ apekkhavā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Itarītarena tusseyya, ekadhammañca bhāvaye’’ti. – tisso gāthā abhāsi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sukhañce jīvituṃ icche, sāmaññasmiṃ apekkhavā"
      },
      "ti sāmaññasmiṃ samaṇabhāve apekkhavā sikkhāya tibbagāravo hutvā sukhaṃ jīvituṃ iccheyya ce, anesanaṃ pahāya sāmaññasukhena sace jīvitukāmoti attho ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅghikaṃ nātimaññeyya, cīvaraṃ pānabhojana"
      },
      "nti saṅghato ābhataṃ cīvaraṃ āhāraṃ na avamaññeyya, saṅghassa uppajjanakalābho nāma parisuddhuppādo hotīti taṃ paribhuñjantassa ājīvapārisuddhisambhavena sāmaññasukhaṃ hatthagatamevāti adhippāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ahi mūsikasobbhaṃvā"
      },
      "ti ahi viya mūsikāya khatabilaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sevetha"
      },
      " seveyya senāsanaṃ. Yathā nāma sappo sayamattano āsayaṃ akatvā mūsikāya aññena vā kate āsaye vasitvā yena kāmaṃ pakkamati, evamevaṃ bhikkhu sayaṃ senāsanakaraṇā saṃkilesaṃ anāpajjitvā yattha katthaci vasitvā pakkameyyāti attho."
    ],
    "innerText": "Tattha sukhañce jīvituṃ icche, sāmaññasmiṃ apekkhavāti sāmaññasmiṃ samaṇabhāve apekkhavā sikkhāya tibbagāravo hutvā sukhaṃ jīvituṃ iccheyya ce, anesanaṃ pahāya sāmaññasukhena sace jīvitukāmoti attho . Saṅghikaṃ nātimaññeyya, cīvaraṃ pānabhojananti saṅghato ābhataṃ cīvaraṃ āhāraṃ na avamaññeyya, saṅghassa uppajjanakalābho nāma parisuddhuppādo hotīti taṃ paribhuñjantassa ājīvapārisuddhisambhavena sāmaññasukhaṃ hatthagatamevāti adhippāyo. Ahi mūsikasobbhaṃvāti ahi viya mūsikāya khatabilaṃ sevetha seveyya senāsanaṃ. Yathā nāma sappo sayamattano āsayaṃ akatvā mūsikāya aññena vā kate āsaye vasitvā yena kāmaṃ pakkamati, evamevaṃ bhikkhu sayaṃ senāsanakaraṇā saṃkilesaṃ anāpajjitvā yattha katthaci vasitvā pakkameyyāti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni vutte avutte ca paccaye yathālābhasantoseneva sāmaññasukhaṃ hoti, na aññathāti dassento āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘itarītarena tusseyyā’’"
      },
      "ti, yena kenaci hīnena vā paṇītena vā yathāladdhena paccayena santosaṃ āpajjeyyāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekadhamma"
      },
      "nti appamādabhāvaṃ, tañhi anuyuñjantassa anavajjaṃ sabbaṃ lokiyasukhaṃ lokuttarasukhañca hatthagatameva hoti. Tenāha bhagavā – ‘‘appamatto hi jhāyanto, pappoti vipulaṃ sukha’’nti (ma. ni. 2.352; dha. pa. 27)."
    ],
    "innerText": "Idāni vutte avutte ca paccaye yathālābhasantoseneva sāmaññasukhaṃ hoti, na aññathāti dassento āha ‘‘itarītarena tusseyyā’’ti, yena kenaci hīnena vā paṇītena vā yathāladdhena paccayena santosaṃ āpajjeyyāti attho. Ekadhammanti appamādabhāvaṃ, tañhi anuyuñjantassa anavajjaṃ sabbaṃ lokiyasukhaṃ lokuttarasukhañca hatthagatameva hoti. Tenāha bhagavā – ‘‘appamatto hi jhāyanto, pappoti vipulaṃ sukha’’nti (ma. ni. 2.352; dha. pa. 27)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dhaniyattheragāthāvaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Mātaṅgaputtattheragāthāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atisīta"
      },
      "nti ",
      " āyasmato mātaṅgaputtattherassa gāthā. Kā uppatti? Ayaṃ kira padumuttarassa bhagavato kāle himavantasamīpe mahato jātassarassa heṭṭhā mahati nāgabhavane mahānubhāvo nāgarājā hutvā nibbatto ekadivasaṃ nāgabhavanato nikkhamitvā vicaranto satthāraṃ ākāsena gacchantaṃ disvā pasannamānaso attano sīsamaṇinā pūjaṃ akāsi. So tena puññakammena devamanussesu saṃsaranto imasmiṃ buddhuppāde kosalaraṭṭhe mātaṅgassa nāma kuṭumbikassa putto ",
      " hutvā nibbatto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mātaṅgaputto"
      },
      "tveva paññāyittha. So viññutaṃ patto alasajātiko hutvā kiñci kammaṃ akaronto ñātakehi aññehi ca garahito ‘‘sukhajīvino ime samaṇā sakyaputtiyā’’ti sukhajīvitaṃ ākaṅkhanto bhikkhūhi kataparicayo hutvā satthāraṃ upasaṅkamitvā dhammaṃ sutvā paṭiladdhasaddho pabbajitvā aññe bhikkhū iddhimante disvā iddhibalaṃ patthetvā satthu santike kammaṭṭhānaṃ gahetvā bhāvanaṃ anuyuñjanto chaḷabhiñño ahosi. Tena vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "apadāne"
      },
      " (apa. thera 2.48.8-29) –"
    ],
    "innerText": "Atisītanti āyasmato mātaṅgaputtattherassa gāthā. Kā uppatti? Ayaṃ kira padumuttarassa bhagavato kāle himavantasamīpe mahato jātassarassa heṭṭhā mahati nāgabhavane mahānubhāvo nāgarājā hutvā nibbatto ekadivasaṃ nāgabhavanato nikkhamitvā vicaranto satthāraṃ ākāsena gacchantaṃ disvā pasannamānaso attano sīsamaṇinā pūjaṃ akāsi. So tena puññakammena devamanussesu saṃsaranto imasmiṃ buddhuppāde kosalaraṭṭhe mātaṅgassa nāma kuṭumbikassa putto hutvā nibbatto mātaṅgaputtotveva paññāyittha. So viññutaṃ patto alasajātiko hutvā kiñci kammaṃ akaronto ñātakehi aññehi ca garahito ‘‘sukhajīvino ime samaṇā sakyaputtiyā’’ti sukhajīvitaṃ ākaṅkhanto bhikkhūhi kataparicayo hutvā satthāraṃ upasaṅkamitvā dhammaṃ sutvā paṭiladdhasaddho pabbajitvā aññe bhikkhū iddhimante disvā iddhibalaṃ patthetvā satthu santike kammaṭṭhānaṃ gahetvā bhāvanaṃ anuyuñjanto chaḷabhiñño ahosi. Tena vuttaṃ apadāne (apa. thera 2.48.8-29) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Padumuttaro nāma jino, sabbadhammāna pāragū;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vivekakāmo sambuddho, gacchate anilañjase."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Avidūre himavantassa, mahājātassaro ahu;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tattha me bhavanaṃ āsi, puññakammena saṃyutaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Bhavanā abhinikkhamma, addasaṃ lokanāyakaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Indīvaraṃva jalitaṃ, ādittaṃva hutāsanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Vicinaṃ naddasaṃ pupphaṃ, pūjayissanti nāyakaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sakaṃ cittaṃ pasādetvā, avandiṃ satthuno ahaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Mama sīse maṇiṃ gayha, pūjayiṃ lokanāyakaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Imāya maṇipūjāya, vipāko hotu bhaddako."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Padumuttaro lokavidū, āhutīnaṃ paṭiggaho;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Antalikkhe ṭhito satthā, imaṃ gāthaṃ abhāsatha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘So te ijjhatu saṅkappo, labhassu vipulaṃ sukhaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Imāya maṇipūjāya, anubhohi mahāyasaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Idaṃ vatvāna bhagavā, jalajuttamanāmako;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Agamāsi buddhaseṭṭho, yattha cittaṃ paṇīhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Saṭṭhikappāni devindo, devarajjamakārayiṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Anekasatakkhattuñca, cakkavattī ahosahaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Pubbakammaṃ sarantassa, devabhūtassa me sato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Maṇi nibbattate mayhaṃ, ālokakaraṇo mamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Chaḷasītisahassāni ",
      ", nāriyo me pariggahā;"
    ],
    "innerText": "‘‘Chaḷasītisahassāni , nāriyo me pariggahā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vicittavatthābharaṇā, āmukkamaṇikuṇḍalā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Aḷārapamhā hasulā, susaññā tanumajjhimā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Parivārenti maṃ niccaṃ, maṇipūjāyidaṃ phalaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Soṇṇamayā ",
      " maṇimayā, lohitaṅkamayā tathā;"
    ],
    "innerText": "‘‘Soṇṇamayā maṇimayā, lohitaṅkamayā tathā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhaṇḍā me sukatā honti, yadicchasi piḷandhanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kūṭāgārā gahā rammā, sayanañca mahārahaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Mama saṅkappamaññāya, nibbattanti yadicchakaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Lābhā tesaṃ suladdhañca, ye labhanti upassutiṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Puññakkhettaṃ manussānaṃ, osadhaṃ sabbapāṇinaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Mayhampi sukataṃ kammaṃ, yohaṃ adakkhi nāyakaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vinipātā pamuttomhi, pattomhi acalaṃ padaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yaṃ yaṃ yonūpapajjāmi, devattaṃ atha mānusaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Divasañceva rattiñca, āloko hoti me sadā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tāyeva maṇipūjāya, anubhotvāna sampadā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ñāṇāloko mayā diṭṭho, pattomhi acalaṃ padaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Satasahassito kappe, yaṃ maṇiṃ abhipūjayiṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Duggatiṃ nābhijānāmi, maṇipūjāyidaṃ phalaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kilesā jhāpitā mayhaṃ…pe… kataṃ buddhassa sāsana’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Chaḷabhiñño pana hutvā puggalādhiṭṭhānavasena kosajjaṃ garahanto attano ca vīriyārambhaṃ kittento –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "231"
      },
      "."
    ],
    "innerText": "231."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Atisītaṃ atiuṇhaṃ, atisāyamidaṃ ahu;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Iti vissaṭṭhakammante, khaṇā accenti māṇave."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "232"
      },
      "."
    ],
    "innerText": "232."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yo ca sītañca uṇhañca, tiṇā bhiyyo na maññati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Karaṃ purisakiccāni, so sukhā na vihāyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "233"
      },
      "."
    ],
    "innerText": "233."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " ‘‘Dabbaṃ ",
      " kusaṃ poṭakilaṃ, usīraṃ muñjapabbajaṃ;"
    ],
    "innerText": "‘‘Dabbaṃ kusaṃ poṭakilaṃ, usīraṃ muñjapabbajaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Urasā panudissāmi, vivekamanubrūhaya’’nti. – gāthāttayamāha;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atisīta"
      },
      "nti himapātavaddalādinā ativiya sītaṃ, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "idaṃ ahū"
      },
      "ti ānetvā sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atiuṇha"
      },
      "nti dhammaparitāpādinā ativiya uṇhaṃ, ubhayenapi utuvasena kosajjavatthumāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atisāya"
      },
      "nti divasassa pariṇatiyā atisāyaṃ, sāyaggahaṇeneva cettha pātopi saṅgayhati ",
      ", tadubhayena kālavasena kosajjavatthumāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Itī"
      },
      "ti iminā pakārena. Etena ‘‘idha, bhikkhave, bhikkhunā kammaṃ kattabbaṃ hotī’’tiādinā (a. ni. 8.80; dī. ni. 3.334) vuttaṃ kosajjavatthuṃ ",
      " saṅgaṇhāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissaṭṭhakammante"
      },
      "ti pariccattayogakammante. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khaṇā"
      },
      "ti buddhuppādādayo brahmacariyavāsassa okāsā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Accentī"
      },
      "ti atikkamanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Māṇave"
      },
      "ti satte. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tiṇā bhiyyo na maññatī"
      },
      "ti tiṇato upari na maññati, tiṇaṃ viya maññati, sītuṇhāni abhibhavitvā attanā kattabbaṃ karoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kara"
      },
      "nti karonto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purisakiccānī"
      },
      "ti vīrapurisena kattabbāni attahitaparahitāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sukhā"
      },
      "ti sukhato, nibbānasukhatoti adhippāyo. Tatiyagāthāya attho heṭṭhā vuttoyeva."
    ],
    "innerText": "Tattha atisītanti himapātavaddalādinā ativiya sītaṃ, idaṃ ahūti ānetvā sambandho. Atiuṇhanti dhammaparitāpādinā ativiya uṇhaṃ, ubhayenapi utuvasena kosajjavatthumāha. Atisāyanti divasassa pariṇatiyā atisāyaṃ, sāyaggahaṇeneva cettha pātopi saṅgayhati , tadubhayena kālavasena kosajjavatthumāha. Itīti iminā pakārena. Etena ‘‘idha, bhikkhave, bhikkhunā kammaṃ kattabbaṃ hotī’’tiādinā (a. ni. 8.80; dī. ni. 3.334) vuttaṃ kosajjavatthuṃ saṅgaṇhāti. Vissaṭṭhakammanteti pariccattayogakammante. Khaṇāti buddhuppādādayo brahmacariyavāsassa okāsā. Accentīti atikkamanti. Māṇaveti satte. Tiṇā bhiyyo na maññatīti tiṇato upari na maññati, tiṇaṃ viya maññati, sītuṇhāni abhibhavitvā attanā kattabbaṃ karoti. Karanti karonto. Purisakiccānīti vīrapurisena kattabbāni attahitaparahitāni. Sukhāti sukhato, nibbānasukhatoti adhippāyo. Tatiyagāthāya attho heṭṭhā vuttoyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Mātaṅgaputtattheragāthāvaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Khujjasobhitattheragāthāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ye cittakathī bahussutā"
      },
      "ti āyasmato khujjasobhitattherassa gāthā. Kā uppatti? Ayaṃ kira padumuttarassa bhagavato kāle kulagehe nibbattitvā viññutaṃ patto ekadivasaṃ bhagavantaṃ mahatā bhikkhusaṅghena saddhiṃ gacchantaṃ disvā pasannamānaso dasahi gāthāhi abhitthavi. So tena puññakammena devamanussesu saṃsaranto imasmiṃ buddhuppāde pāṭaliputtanagare brāhmaṇakule nibbatti, ‘‘sobhito’’tissa nāmaṃ ",
      " ahosi. Thokaṃ khujjadhātukatāya pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "khujjasobhito"
      },
      "tveva paññāyittha. So vayappatto satthari parinibbute ānandattherassa santike pabbajitvā chaḷabhiñño ahosi. Tena vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "apadāne"
      },
      " (apa. thera 2.47.49-58) –"
    ],
    "innerText": "Ye cittakathī bahussutāti āyasmato khujjasobhitattherassa gāthā. Kā uppatti? Ayaṃ kira padumuttarassa bhagavato kāle kulagehe nibbattitvā viññutaṃ patto ekadivasaṃ bhagavantaṃ mahatā bhikkhusaṅghena saddhiṃ gacchantaṃ disvā pasannamānaso dasahi gāthāhi abhitthavi. So tena puññakammena devamanussesu saṃsaranto imasmiṃ buddhuppāde pāṭaliputtanagare brāhmaṇakule nibbatti, ‘‘sobhito’’tissa nāmaṃ ahosi. Thokaṃ khujjadhātukatāya pana khujjasobhitotveva paññāyittha. So vayappatto satthari parinibbute ānandattherassa santike pabbajitvā chaḷabhiñño ahosi. Tena vuttaṃ apadāne (apa. thera 2.47.49-58) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kakudhaṃ vilasantaṃva, devadevaṃ narāsabhaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Rathiyaṃ paṭipajjantaṃ, ko disvā na pasīdati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tamandhakāraṃ nāsetvā, santāretvā bahuṃ janaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ñāṇālokena jotantaṃ, ko disvā na pasīdati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Vasīsatasahassehi, nīyantaṃ lokanāyakaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Uddharantaṃ bahū satte, ko disvā na pasīdati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Āhanantaṃ dhammabheriṃ, maddantaṃ titthiye gaṇe;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sīhanādaṃ vinadantaṃ, ko disvā na pasīdati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yāvatā brahmalokato, āgantvāna sabrahmakā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pucchanti nipuṇe pañhe, ko disvā na pasīdati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yassañjaliṃ karitvāna, āyācanti sadevakā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tena puññaṃ anubhonti, ko disvā na pasīdati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Sabbe ",
      " janā samāgantvā, sampavārenti cakkhumaṃ;"
    ],
    "innerText": "‘‘Sabbe janā samāgantvā, sampavārenti cakkhumaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Na vikampati ajjhiṭṭho, ko disvā na pasīdati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Nagaraṃ pavisato yassa, ravanti bheriyo bahū;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vinadanti gajā mattā, ko disvā na pasīdati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Vīthiyā gacchato yassa, sabbābhā jotate sadā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Abbhunnatā samā honti, ko disvā na pasīdati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Byāharantassa buddhassa, cakkavāḷampi suyyati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sabbe satte viññāpeti, ko disvā na pasīdati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Satasahassito kappe, yaṃ buddhamabhikittayiṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Duggatiṃ nābhijānāmi, kittanāya idaṃ phalaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kilesā jhāpitā mayhaṃ…pe… kataṃ buddhassa sāsana’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Chaḷabhiñño ",
      " pana hutvā paṭhamamahāsaṅgītikāle rājagahe sattapaṇṇiguhāyaṃ sannipatitena saṅghena ‘‘āyasmantaṃ ānandaṃ āmantehī’’ti āṇatto pathaviyaṃ nimujjitvā therassa purato uṭṭhahitvā saṅghassa sāsanaṃ ārocetvā sayaṃ puretaraṃ ākāsena gantvā sattapaṇṇiguhādvāraṃ sampāpuṇi. Tena ca samayena mārassa mārakāyikānañca paṭisedhanatthaṃ devasaṅghena pesitā aññatarā devatā sattapaṇṇiguhādvāre ṭhitā hoti, tassā khujjasobhito thero attano āgamanaṃ kathento –"
    ],
    "innerText": "Chaḷabhiñño pana hutvā paṭhamamahāsaṅgītikāle rājagahe sattapaṇṇiguhāyaṃ sannipatitena saṅghena ‘‘āyasmantaṃ ānandaṃ āmantehī’’ti āṇatto pathaviyaṃ nimujjitvā therassa purato uṭṭhahitvā saṅghassa sāsanaṃ ārocetvā sayaṃ puretaraṃ ākāsena gantvā sattapaṇṇiguhādvāraṃ sampāpuṇi. Tena ca samayena mārassa mārakāyikānañca paṭisedhanatthaṃ devasaṅghena pesitā aññatarā devatā sattapaṇṇiguhādvāre ṭhitā hoti, tassā khujjasobhito thero attano āgamanaṃ kathento –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "234"
      },
      "."
    ],
    "innerText": "234."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " ‘‘Ye ",
      " cittakathī bahussutā, samaṇā pāṭaliputtavāsino;"
    ],
    "innerText": "‘‘Ye cittakathī bahussutā, samaṇā pāṭaliputtavāsino;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tesaññataroyamāyuvā, dvāre tiṭṭhati khujjasobhito’’ti. – paṭhamaṃ gāthamāha;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cittakathī"
      },
      "ti vicittadhammakathikā, saṅkhipanaṃ, vitthāraṇaṃ gambhīrakaraṇaṃ uttānīkaraṇaṃ kaṅkhāvinodanaṃ dhammapatiṭṭhāpananti evamādīhi nānānayehi paresaṃ ajjhāsayānurūpaṃ dhammassa kathanasīlāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bahussutā"
      },
      "ti pariyattipaṭivedhabāhusaccapāripūriyā bahussutā. Sabbaso samitapāpatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samaṇā. Pāṭaliputtavāsino, tesaññataro"
      },
      "ti pāṭaliputtanagaravāsitāya pāṭaliputtavāsino, tesaṃ aññataro, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ayaṃ āyuvā"
      },
      " dīghāyu āyasmā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dvāre tiṭṭhatī"
      },
      "ti sattapaṇṇiguhāya dvāre tiṭṭhati, saṅghassa anumatiyā pavisitunti attho. Taṃ sutvā sā devatā therassa āgamanaṃ saṅghassa nivedentī –"
    ],
    "innerText": "Tattha cittakathīti vicittadhammakathikā, saṅkhipanaṃ, vitthāraṇaṃ gambhīrakaraṇaṃ uttānīkaraṇaṃ kaṅkhāvinodanaṃ dhammapatiṭṭhāpananti evamādīhi nānānayehi paresaṃ ajjhāsayānurūpaṃ dhammassa kathanasīlāti attho. Bahussutāti pariyattipaṭivedhabāhusaccapāripūriyā bahussutā. Sabbaso samitapāpatāya samaṇā. Pāṭaliputtavāsino, tesaññataroti pāṭaliputtanagaravāsitāya pāṭaliputtavāsino, tesaṃ aññataro, ayaṃ āyuvā dīghāyu āyasmā. Dvāre tiṭṭhatīti sattapaṇṇiguhāya dvāre tiṭṭhati, saṅghassa anumatiyā pavisitunti attho. Taṃ sutvā sā devatā therassa āgamanaṃ saṅghassa nivedentī –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "235"
      },
      "."
    ],
    "innerText": "235."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " ‘‘Ye ",
      " cittakathī…pe… dvāre tiṭṭhati māluterito’’ti. – dutiyaṃ gāthamāha;"
    ],
    "innerText": "‘‘Ye cittakathī…pe… dvāre tiṭṭhati māluterito’’ti. – dutiyaṃ gāthamāha;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "māluterito"
      },
      "ti iddhicittajanitena vāyunā erito, iddhibalena āgatoti attho."
    ],
    "innerText": "Tattha māluteritoti iddhicittajanitena vāyunā erito, iddhibalena āgatoti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ ",
      " tāya devatāya niveditena saṅghena katokāso thero saṅghassa santikaṃ gacchanto –"
    ],
    "innerText": "Evaṃ tāya devatāya niveditena saṅghena katokāso thero saṅghassa santikaṃ gacchanto –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "236"
      },
      "."
    ],
    "innerText": "236."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Suyuddhena suyiṭṭhena, saṅgāmavijayena ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Brahmacariyānuciṇṇena, evāyaṃ sukhamedhatī’’ti. –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Imāya tatiyagāthāya aññaṃ byākāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "suyuddhenā"
      },
      "ti pubbabhāge tadaṅgavikkhambhanappahānavasena kilesehi suṭṭhu yujjhanena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suyiṭṭhenā"
      },
      "ti antarantarā kalyāṇamittehi dinnasappāyadhammadānena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅgāmavijayena cā"
      },
      "ti samucchedappahānavasena sabbaso kilesābhisaṅkhāranimmathanena laddhasaṅgāmavijayena ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Brahmacariyānuciṇṇenā"
      },
      "ti anuciṇṇena aggamaggabrahmacariyena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evāyaṃ sukhamedhatī"
      },
      "ti evaṃ vuttappakārena ayaṃ khujjasobhito nibbānasukhaṃ phalasamāpattisukhañca edhati, anubhavatīti attho."
    ],
    "innerText": "Tattha suyuddhenāti pubbabhāge tadaṅgavikkhambhanappahānavasena kilesehi suṭṭhu yujjhanena. Suyiṭṭhenāti antarantarā kalyāṇamittehi dinnasappāyadhammadānena. Saṅgāmavijayena cāti samucchedappahānavasena sabbaso kilesābhisaṅkhāranimmathanena laddhasaṅgāmavijayena ca. Brahmacariyānuciṇṇenāti anuciṇṇena aggamaggabrahmacariyena. Evāyaṃ sukhamedhatīti evaṃ vuttappakārena ayaṃ khujjasobhito nibbānasukhaṃ phalasamāpattisukhañca edhati, anubhavatīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Khujjasobhitattheragāthāvaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Vāraṇattheragāthāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yodha koci manussesū"
      },
      "ti āyasmato vāraṇattherassa gāthā. Kā uppatti? Ayampi purimabuddhesu katādhikāro tattha tattha bhave puññāni karonto ito dvānavute kappe tissassa bhagavato uppattito puretarameva ",
      " brāhmaṇakule nibbattitvā brāhmaṇānaṃ vijjāsippesu pāragū hutvā isipabbajjaṃ pabbajitvā catupaṇṇāsasahassānaṃ antevāsikānaṃ mante vācento vasati. Tena ca samayena tissassa bhagavato bodhisattabhūtassa tusitā kāyā cavitvā carimabhave mātukucchiṃ okkamanena mahāpathavikampo ahosi. Taṃ disvā mahājano bhīto saṃviggo naṃ isiṃ upasaṅkamitvā pathavikampanakāraṇaṃ pucchi. So ‘‘mahābodhisatto mātukucchiṃ okkami, tenāyaṃ pathavikampo, tasmā mā bhāyathā’’ti buddhuppādassa pubbanimittabhāvaṃ kathetvā samassāsesi, buddhārammaṇañca pītiṃ paṭivedesi. So tena puññakammena devamanussesu ",
      " saṃsaranto imasmiṃ ",
      " buddhuppāde kosalaraṭṭhe brāhmaṇakule nibbattitvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vāraṇo"
      },
      "ti laddhanāmo vayappatto aññatarassa āraññakassa therassa santike dhammaṃ sutvā laddhappasādo pabbajitvā samaṇadhammaṃ karoti. So ekadivasaṃ buddhupaṭṭhānaṃ gacchanto antarāmagge ahinakule aññamaññaṃ kalahaṃ katvā kālaṅkate disvā ‘‘ime sattā aññamaññavirodhena jīvitakkhayaṃ pattā’’ti saṃviggamānaso hutvā bhagavato santikaṃ gato, tassa bhagavā cittācāraṃ ñatvā tadanurūpameva ovādaṃ dento –"
    ],
    "innerText": "Yodha koci manussesūti āyasmato vāraṇattherassa gāthā. Kā uppatti? Ayampi purimabuddhesu katādhikāro tattha tattha bhave puññāni karonto ito dvānavute kappe tissassa bhagavato uppattito puretarameva brāhmaṇakule nibbattitvā brāhmaṇānaṃ vijjāsippesu pāragū hutvā isipabbajjaṃ pabbajitvā catupaṇṇāsasahassānaṃ antevāsikānaṃ mante vācento vasati. Tena ca samayena tissassa bhagavato bodhisattabhūtassa tusitā kāyā cavitvā carimabhave mātukucchiṃ okkamanena mahāpathavikampo ahosi. Taṃ disvā mahājano bhīto saṃviggo naṃ isiṃ upasaṅkamitvā pathavikampanakāraṇaṃ pucchi. So ‘‘mahābodhisatto mātukucchiṃ okkami, tenāyaṃ pathavikampo, tasmā mā bhāyathā’’ti buddhuppādassa pubbanimittabhāvaṃ kathetvā samassāsesi, buddhārammaṇañca pītiṃ paṭivedesi. So tena puññakammena devamanussesu saṃsaranto imasmiṃ buddhuppāde kosalaraṭṭhe brāhmaṇakule nibbattitvā vāraṇoti laddhanāmo vayappatto aññatarassa āraññakassa therassa santike dhammaṃ sutvā laddhappasādo pabbajitvā samaṇadhammaṃ karoti. So ekadivasaṃ buddhupaṭṭhānaṃ gacchanto antarāmagge ahinakule aññamaññaṃ kalahaṃ katvā kālaṅkate disvā ‘‘ime sattā aññamaññavirodhena jīvitakkhayaṃ pattā’’ti saṃviggamānaso hutvā bhagavato santikaṃ gato, tassa bhagavā cittācāraṃ ñatvā tadanurūpameva ovādaṃ dento –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "237"
      },
      "."
    ],
    "innerText": "237."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yodha koci manussesu, parapāṇāni hiṃsati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Asmā lokā paramhā ca, ubhayā dhaṃsate naro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "238"
      },
      "."
    ],
    "innerText": "238."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yo ca mettena cittena, sabbapāṇānukampati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bahuñhi so pasavati, puññaṃ tādisako naro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "239"
      },
      "."
    ],
    "innerText": "239."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Subhāsitassa sikkhetha, samaṇūpāsanassa ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ekāsanassa ca raho, cittavūpasamassā cā’’ti. – tisso gāthā abhāsi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yodha koci manussesū"
      },
      "ti idha manussesu yo koci khattiyo vā brāhmaṇo vā vesso vā suddo vā gahaṭṭho vā pabbajito vā. Manussaggahaṇañcettha ukkaṭṭhasattanidassananti daṭṭhabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parapāṇāni hiṃsatī"
      },
      "ti parasatte māreti vibādhati ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asmā lokā"
      },
      "ti idha lokato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paramhā"
      },
      "ti paralokato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ubhayā dhaṃsate"
      },
      "ti ubhayato dhaṃsati, ubhayalokapariyāpannahitasukhato parihāyatīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Naro"
      },
      "ti satto."
    ],
    "innerText": "Tattha yodha koci manussesūti idha manussesu yo koci khattiyo vā brāhmaṇo vā vesso vā suddo vā gahaṭṭho vā pabbajito vā. Manussaggahaṇañcettha ukkaṭṭhasattanidassananti daṭṭhabbaṃ. Parapāṇāni hiṃsatīti parasatte māreti vibādhati ca. Asmā lokāti idha lokato. Paramhāti paralokato. Ubhayā dhaṃsateti ubhayato dhaṃsati, ubhayalokapariyāpannahitasukhato parihāyatīti attho. Naroti satto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ parapīḷālakkhaṇaṃ pāpadhammaṃ dassetvā idāni parapīḷānivattilakkhaṇaṃ kusalaṃ dhammaṃ dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yo ca mettenā’’"
      },
      "tiādinā dutiyaṃ gāthamāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mettena cittenā"
      },
      "ti mettāsampayuttena cittena appanāpattena itarītarena vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbapāṇānukampatī"
      },
      "ti sabbe pāṇe attano orasaputte viya mettāyati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bahuñhi so pasavati, puññaṃ tādisako naro"
      },
      "ti ",
      " so tathārūpo mettāvihārī puggalo bahuṃ mahantaṃ anappakaṃ kusalaṃ pasavati paṭilabhati adhigacchati."
    ],
    "innerText": "Evaṃ parapīḷālakkhaṇaṃ pāpadhammaṃ dassetvā idāni parapīḷānivattilakkhaṇaṃ kusalaṃ dhammaṃ dassento ‘‘yo ca mettenā’’tiādinā dutiyaṃ gāthamāha. Tattha mettena cittenāti mettāsampayuttena cittena appanāpattena itarītarena vā. Sabbapāṇānukampatīti sabbe pāṇe attano orasaputte viya mettāyati. Bahuñhi so pasavati, puññaṃ tādisako naroti so tathārūpo mettāvihārī puggalo bahuṃ mahantaṃ anappakaṃ kusalaṃ pasavati paṭilabhati adhigacchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni ",
      " taṃ sasambhāre samathavipassanādhamme niyojento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘subhāsitassā’’"
      },
      "tiādinā tatiyaṃ gāthamāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "subhāsitassa sikkhethā"
      },
      "ti appicchakathādibhedaṃ subhāsitaṃ pariyattidhammaṃ savanadhāraṇaparipucchādivasena sikkheyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samaṇūpāsanassa cā"
      },
      "ti samitapāpānaṃ samaṇānaṃ kalyāṇamittānaṃ upāsakānaṃ kālena kālaṃ upasaṅkamitvā payirupāsanañceva paṭipattiyā tesaṃ samīpacariyañca ",
      " sikkheyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekāsanassa ca raho cittavūpasamassa cā"
      },
      "ti ekassa asahāyassa kāyavivekaṃ anubrūhantassa raho kammaṭṭhānānuyogavasena āsanaṃ nisajjaṃ sikkheyya. Evaṃ kammaṭṭhānaṃ anuyuñjanto bhāvanañca matthakaṃ pāpento samucchedavasena kilesānaṃ cittassa vūpasamañca sikkheyya. Yāhi adhisīlasikkhādīhi kilesā accantameva vūpasantā pahīnā honti, tā maggaphalasikkhā sikkhantassa accantameva cittaṃ vūpasantaṃ nāma hotīti. Gāthāpariyosāne vipassanaṃ vaḍḍhetvā arahattaṃ pāpuṇi. Tena vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "apadāne"
      },
      " (apa. thera 2.47.59-72) –"
    ],
    "innerText": "Idāni taṃ sasambhāre samathavipassanādhamme niyojento ‘‘subhāsitassā’’tiādinā tatiyaṃ gāthamāha. Tattha subhāsitassa sikkhethāti appicchakathādibhedaṃ subhāsitaṃ pariyattidhammaṃ savanadhāraṇaparipucchādivasena sikkheyya. Samaṇūpāsanassa cāti samitapāpānaṃ samaṇānaṃ kalyāṇamittānaṃ upāsakānaṃ kālena kālaṃ upasaṅkamitvā payirupāsanañceva paṭipattiyā tesaṃ samīpacariyañca sikkheyya. Ekāsanassa ca raho cittavūpasamassa cāti ekassa asahāyassa kāyavivekaṃ anubrūhantassa raho kammaṭṭhānānuyogavasena āsanaṃ nisajjaṃ sikkheyya. Evaṃ kammaṭṭhānaṃ anuyuñjanto bhāvanañca matthakaṃ pāpento samucchedavasena kilesānaṃ cittassa vūpasamañca sikkheyya. Yāhi adhisīlasikkhādīhi kilesā accantameva vūpasantā pahīnā honti, tā maggaphalasikkhā sikkhantassa accantameva cittaṃ vūpasantaṃ nāma hotīti. Gāthāpariyosāne vipassanaṃ vaḍḍhetvā arahattaṃ pāpuṇi. Tena vuttaṃ apadāne (apa. thera 2.47.59-72) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ajjhogāhetvā himavaṃ, mante vācemahaṃ tadā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Catupaññāsasahassāni, sissā mayhaṃ upaṭṭhahuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Adhitā vedagū sabbe, chaḷaṅge pāramiṃ gatā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sakavijjāhupatthaddhā, himavante vasanti te."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Cavitvā tusitā kāyā, devaputto mahāyaso;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Uppajji mātukucchismiṃ, sampajāno patissato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sambuddhe upapajjante, dasasahassi kampatha;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Andhā cakkhuṃ alabhiṃsu, uppajjantamhi nāyake."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sabbākāraṃ pakampittha, kevalā vasudhā ayaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nigghosasaddaṃ sutvāna, ubbijjiṃsu mahājanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sabbe janā samāgamma, āgacchuṃ mama santikaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vasudhāyaṃ pakampittha, kiṃ vipāko bhavissati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Avacāsiṃ ",
      " tadā tesaṃ, mā bhetha natthi vo bhayaṃ;"
    ],
    "innerText": "‘‘Avacāsiṃ tadā tesaṃ, mā bhetha natthi vo bhayaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Visaṭṭhā hotha sabbepi, uppādoyaṃ suvatthiko."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Aṭṭhahetūhi samphussa, vasudhāyaṃ pakampati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tathā nimittā dissanti, obhāso vipulo mahā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Asaṃsayaṃ buddhaseṭṭho, uppajjissati cakkhumā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Saññāpetvāna janataṃ, pañcasīle kathesahaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sutvāna pañcasīlāni, buddhuppādañca dullabhaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ubbegajātā sumanā, tuṭṭhahaṭṭhā ahaṃsu te."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Dvenavute ito kappe, yaṃ nimittaṃ viyākariṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Duggatiṃ nābhijānāmi, byākaraṇassidaṃ phalaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kilesā jhāpitā mayhaṃ…pe… kataṃ buddhassa sāsana’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vāraṇattheragāthāvaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Vassikattheragāthāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekopi"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saddho medhāvī"
      },
      "ti āyasmato vassikattherassa gāthā. Kā uppatti? Ayampi purimabuddhesu katādhikāro tattha tattha bhave puññāni karonto atthadassissa bhagavato kāle kulagehe nibbattitvā viññutaṃ patto ekadivasaṃ satthāraṃ disvā pasannacitto pilakkhaphalāni adāsi. So tena puññakammena devamanussesu saṃsaranto imasmiṃ buddhuppāde kosalaraṭṭhe brāhmaṇakule nibbattitvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vassiko"
      },
      "ti laddhanāmo vayappatto satthu yamakapāṭihāriyaṃ disvā paṭiladdhasaddho pabbajitvā samaṇadhammaṃ karonto ābādhiko ahosi. Atha naṃ ñātakā vejjaparidiṭṭhena bhesajjavidhinā upaṭṭhahitvā arogamakaṃsu. So tamhā ābādhā vuṭṭhito saṃvegajāto bhāvanaṃ ussukkāpetvā chaḷabhiñño ahosi. Tena vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "apadāne"
      },
      " (apa. thera 2.47.40-44) –"
    ],
    "innerText": "Ekopisaddho medhāvīti āyasmato vassikattherassa gāthā. Kā uppatti? Ayampi purimabuddhesu katādhikāro tattha tattha bhave puññāni karonto atthadassissa bhagavato kāle kulagehe nibbattitvā viññutaṃ patto ekadivasaṃ satthāraṃ disvā pasannacitto pilakkhaphalāni adāsi. So tena puññakammena devamanussesu saṃsaranto imasmiṃ buddhuppāde kosalaraṭṭhe brāhmaṇakule nibbattitvā vassikoti laddhanāmo vayappatto satthu yamakapāṭihāriyaṃ disvā paṭiladdhasaddho pabbajitvā samaṇadhammaṃ karonto ābādhiko ahosi. Atha naṃ ñātakā vejjaparidiṭṭhena bhesajjavidhinā upaṭṭhahitvā arogamakaṃsu. So tamhā ābādhā vuṭṭhito saṃvegajāto bhāvanaṃ ussukkāpetvā chaḷabhiñño ahosi. Tena vuttaṃ apadāne (apa. thera 2.47.40-44) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Vanantare ",
      " buddhaṃ disvā, atthadassiṃ mahāyasaṃ;"
    ],
    "innerText": "‘‘Vanantare buddhaṃ disvā, atthadassiṃ mahāyasaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pasannacitto sumano, pilakkhassa phalaṃ adā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Aṭṭhārase kappasate, yaṃ phalaṃ adadiṃ tadā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Duggatiṃ nābhijānāmi, phaladānassidaṃ phalaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kilesā jhāpitā mayhaṃ…pe… kataṃ buddhassa sāsana’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Chaḷabhiñño ",
      " pana hutvā ākāsena ñātakānaṃ santike gantvā ākāse ṭhito dhammaṃ desetvā te saraṇesu sīlesu ca patiṭṭhāpesi. Tesu keci kālaṅkatā saraṇesu sīlesu ca patiṭṭhitattā sagge nibbattiṃsu. Atha naṃ satthā buddhupaṭṭhānaṃ upagataṃ ‘‘kiṃ te, vassika, ñātīnaṃ ārogya’’nti pucchi. So ñātīnaṃ attanā kataṃ upakāraṃ satthu kathento –"
    ],
    "innerText": "Chaḷabhiñño pana hutvā ākāsena ñātakānaṃ santike gantvā ākāse ṭhito dhammaṃ desetvā te saraṇesu sīlesu ca patiṭṭhāpesi. Tesu keci kālaṅkatā saraṇesu sīlesu ca patiṭṭhitattā sagge nibbattiṃsu. Atha naṃ satthā buddhupaṭṭhānaṃ upagataṃ ‘‘kiṃ te, vassika, ñātīnaṃ ārogya’’nti pucchi. So ñātīnaṃ attanā kataṃ upakāraṃ satthu kathento –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "240"
      },
      "."
    ],
    "innerText": "240."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ekopi saddho medhāvī, assaddhānīdha ñātinaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dhammaṭṭho sīlasampanno, hoti atthāya bandhunaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "241"
      },
      "."
    ],
    "innerText": "241."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Niggayha anukampāya, coditā ñātayo mayā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ñātibandhavapemena, kāraṃ katvāna bhikkhusu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "242"
      },
      "."
    ],
    "innerText": "242."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Te abbhatītā kālaṅkatā, pattā te tidivaṃ sukhaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhātaro mayhaṃ mātā ca, modanti kāmakāmino’’ti. –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Tisso gāthā abhāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatthāyaṃ ",
      " paṭhamagāthāya attho – yo kammaphalasaddhāya ca ratanattayasaddhāya ca vasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saddho,"
      },
      " tato eva kammassakatañāṇādiyogato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "medhāvī,"
      },
      " satthu ovādadhamme navalokuttaradhamme ca ṭhitattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammaṭṭho,"
      },
      " ācārasīlassa maggasīlassa phalasīlassa ca vasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sīlasampanno,"
      },
      " so ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekopi"
      },
      " yathāvuttāya saddhāya abhāvena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "assaddhānaṃ idha"
      },
      " imasmiṃ loke ‘‘amhākaṃ ime’’ti ñātabbaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ñātīnaṃ,"
      },
      " tathā pemabandhanena bandhanaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘bandhū’’"
      },
      "ti ca laddhanāmānaṃ bandhavānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atthāya"
      },
      " hitāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hotī"
      },
      "ti."
    ],
    "innerText": "Tatthāyaṃ paṭhamagāthāya attho – yo kammaphalasaddhāya ca ratanattayasaddhāya ca vasena saddho, tato eva kammassakatañāṇādiyogato medhāvī, satthu ovādadhamme navalokuttaradhamme ca ṭhitattā dhammaṭṭho, ācārasīlassa maggasīlassa phalasīlassa ca vasena sīlasampanno, so ekopi yathāvuttāya saddhāya abhāvena assaddhānaṃ idha imasmiṃ loke ‘‘amhākaṃ ime’’ti ñātabbaṭṭhena ñātīnaṃ, tathā pemabandhanena bandhanaṭṭhena ‘‘bandhū’’ti ca laddhanāmānaṃ bandhavānaṃ atthāya hitāya hotīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ ",
      " sādhāraṇato vuttamatthaṃ attūpanāyikaṃ katvā dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘niggayhā’’"
      },
      "tiādinā itaragāthā vuttā. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "niggayha anukampāya, coditā ñātayo mayā"
      },
      "ti idānipi duggatā kusalaṃ akatvā āyatiṃ parikkilesaṃ puna mānubhavitthāti niggahetvā ñātayo mayā ovaditā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñātibandhavapemena"
      },
      " ‘‘amhākaṃ ayaṃ bandhavo’’ti evaṃ pavattena pemena mama ovādaṃ atikkamituṃ asakkontā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāraṃ katvāna bhikkhūsu"
      },
      " pasannacittā hutvā cīvarādipaccayadānena ceva upaṭṭhānena ca bhikkhūsu sakkārasammānaṃ katvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "te abbhatītā kālaṅkatā"
      },
      " hutvā imaṃ lokaṃ atikkantā. Puna ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "te"
      },
      "ti nipātamattaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tidivaṃ sukha"
      },
      "nti devalokapariyāpannasukhaṃ, sukhaṃ vā iṭṭhaṃ tidivaṃ adhigatā. ‘‘Ke pana te’’ti āha. ‘‘",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhātaro mayhaṃ mātā ca, modanti kāmakāmino’’"
      },
      "ti. Attanā yathākāmitavatthukāmasamaṅgino hutvā abhiramantīti attho."
    ],
    "innerText": "Evaṃ sādhāraṇato vuttamatthaṃ attūpanāyikaṃ katvā dassetuṃ ‘‘niggayhā’’tiādinā itaragāthā vuttā. Tattha niggayha anukampāya, coditā ñātayo mayāti idānipi duggatā kusalaṃ akatvā āyatiṃ parikkilesaṃ puna mānubhavitthāti niggahetvā ñātayo mayā ovaditā. Ñātibandhavapemena ‘‘amhākaṃ ayaṃ bandhavo’’ti evaṃ pavattena pemena mama ovādaṃ atikkamituṃ asakkontā kāraṃ katvāna bhikkhūsu pasannacittā hutvā cīvarādipaccayadānena ceva upaṭṭhānena ca bhikkhūsu sakkārasammānaṃ katvā te abbhatītā kālaṅkatā hutvā imaṃ lokaṃ atikkantā. Puna teti nipātamattaṃ. Tidivaṃ sukhanti devalokapariyāpannasukhaṃ, sukhaṃ vā iṭṭhaṃ tidivaṃ adhigatā. ‘‘Ke pana te’’ti āha. ‘‘Bhātaro mayhaṃ mātā ca, modanti kāmakāmino’’ti. Attanā yathākāmitavatthukāmasamaṅgino hutvā abhiramantīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vassikattheragāthāvaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Yasojattheragāthāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kālapabbaṅgasaṅkāso"
      },
      "ti ",
      " āyasmato yasojattherassa gāthā. Kā uppatti? Ayampi purimabuddhesu katādhikāro tattha tattha bhave puññāni upacinanto vipassissa bhagavato kāle ārāmagopakakule nibbattitvā viññutaṃ patto ekadivasaṃ vipassiṃ bhagavantaṃ ākāsena gacchantaṃ disvā pasannamānaso labujaphalaṃ adāsi."
    ],
    "innerText": "Kālapabbaṅgasaṅkāsoti āyasmato yasojattherassa gāthā. Kā uppatti? Ayampi purimabuddhesu katādhikāro tattha tattha bhave puññāni upacinanto vipassissa bhagavato kāle ārāmagopakakule nibbattitvā viññutaṃ patto ekadivasaṃ vipassiṃ bhagavantaṃ ākāsena gacchantaṃ disvā pasannamānaso labujaphalaṃ adāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "So tena puññakammena devamanussesu saṃsaranto imasmiṃ buddhuppāde sāvatthinagaradvāre kevaṭṭagāme pañcakulasatajeṭṭhakassa kevaṭṭassa putto hutvā nibbatti, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yasojo"
      },
      "tissa nāmaṃ akaṃsu. So vayappatto attano sahāyehi kevaṭṭaputtehi saddhiṃ macchagahaṇatthaṃ aciravatiyaṃ nadiyaṃ jālaṃ khipi. Tattheko suvaṇṇavaṇṇo mahāmaccho antojālaṃ pāvisi. Taṃ te rañño pasenadissa dassesuṃ ",
      ". Rājā ‘‘imassa suvaṇṇavaṇṇassa macchassa vaṇṇakāraṇaṃ bhagavā jānātī’’ti macchaṃ gāhāpetvā bhagavato ",
      " dassesi. Bhagavā ‘‘ayaṃ kassapassa sammāsambuddhassa sāsane osakkamāne pabbajitvā micchā paṭipajjanto sāsanaṃ osakkāpetvā niraye nibbatto ekaṃ buddhantaraṃ niraye paccitvā tato cuto aciravatiyaṃ maccho hutvā nibbatto’’ti vatvā tassa bhaginīnañca niraye nibbattabhāvaṃ, tassa bhātikattherassa parinibbutabhāvañca teneva kathāpetvā imissā aṭṭhuppattiyā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kapilasuttaṃ"
      },
      " desesi."
    ],
    "innerText": "So tena puññakammena devamanussesu saṃsaranto imasmiṃ buddhuppāde sāvatthinagaradvāre kevaṭṭagāme pañcakulasatajeṭṭhakassa kevaṭṭassa putto hutvā nibbatti, yasojotissa nāmaṃ akaṃsu. So vayappatto attano sahāyehi kevaṭṭaputtehi saddhiṃ macchagahaṇatthaṃ aciravatiyaṃ nadiyaṃ jālaṃ khipi. Tattheko suvaṇṇavaṇṇo mahāmaccho antojālaṃ pāvisi. Taṃ te rañño pasenadissa dassesuṃ . Rājā ‘‘imassa suvaṇṇavaṇṇassa macchassa vaṇṇakāraṇaṃ bhagavā jānātī’’ti macchaṃ gāhāpetvā bhagavato dassesi. Bhagavā ‘‘ayaṃ kassapassa sammāsambuddhassa sāsane osakkamāne pabbajitvā micchā paṭipajjanto sāsanaṃ osakkāpetvā niraye nibbatto ekaṃ buddhantaraṃ niraye paccitvā tato cuto aciravatiyaṃ maccho hutvā nibbatto’’ti vatvā tassa bhaginīnañca niraye nibbattabhāvaṃ, tassa bhātikattherassa parinibbutabhāvañca teneva kathāpetvā imissā aṭṭhuppattiyā kapilasuttaṃ desesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Satthu desanaṃ sutvā yasojo saṃvegajāto saddhiṃ attano sahāyehi bhagavato santike pabbajitvā patirūpe ṭhāne vasanto ekadivasaṃ sapariso bhagavantaṃ vandituṃ jetavanaṃ agamāsi. Tassa āgamane senāsanapaññāpanādinā vihāre uccāsaddamahāsaddo ahosi. Taṃ sutvā ‘‘bhagavā saparisaṃ yasojaṃ paṇāmesī’’ti (udā. 23) sabbaṃ udāne āgatanayena veditabbaṃ. Paṇāmito pana āyasmā yasojo kasābhihato bhaddo assājānīyo viya saṃviggamānaso saddhiṃ parisāya vaggumudāya nadiyā tīre vasanto ghaṭento vāyamanto vipassanaṃ vaḍḍhetvā antovasseyeva chaḷabhiñño ahosi. Tena vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "apadāne"
      },
      " (apa. thera 2.47.32-39) –"
    ],
    "innerText": "Satthu desanaṃ sutvā yasojo saṃvegajāto saddhiṃ attano sahāyehi bhagavato santike pabbajitvā patirūpe ṭhāne vasanto ekadivasaṃ sapariso bhagavantaṃ vandituṃ jetavanaṃ agamāsi. Tassa āgamane senāsanapaññāpanādinā vihāre uccāsaddamahāsaddo ahosi. Taṃ sutvā ‘‘bhagavā saparisaṃ yasojaṃ paṇāmesī’’ti (udā. 23) sabbaṃ udāne āgatanayena veditabbaṃ. Paṇāmito pana āyasmā yasojo kasābhihato bhaddo assājānīyo viya saṃviggamānaso saddhiṃ parisāya vaggumudāya nadiyā tīre vasanto ghaṭento vāyamanto vipassanaṃ vaḍḍhetvā antovasseyeva chaḷabhiñño ahosi. Tena vuttaṃ apadāne (apa. thera 2.47.32-39) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Nagare bandhumatiyā, ārāmiko ahaṃ tadā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Addasaṃ virajaṃ buddhaṃ, gacchantaṃ anilañjase."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Labujaṃ phalamādāya, buddhaseṭṭhassadāsahaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ākāseva ṭhito santo, paṭiggaṇhi mahāyaso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Vittisañjānano mayhaṃ, diṭṭhadhammasukhāvaho;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Phalaṃ buddhassa datvāna, vippasannena cetasā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Adhigañchiṃ tadā pītiṃ, vipulaṃ sukhamuttamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Uppajjateva ratanaṃ, nibbattassa tahiṃ tahiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ekanavutito kappe, yaṃ phalaṃ adadiṃ tadā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Duggatiṃ nābhijānāmi, phaladānassidaṃ phalaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kilesā jhāpitā mayhaṃ…pe… kataṃ buddhassa sāsana’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Chaḷabhiññaṃ ",
      " pana samānaṃ saparisaṃ āyasmantaṃ yasojaṃ satthā pakkositvā āneñjasamāpattinā paṭisanthāramakāsi. So sabbepi ",
      " dhutaṅgadhamme samādāya vattati. Tenassa sarīraṃ kisaṃ ahosi lūkhaṃ dubbaṇṇaṃ, taṃ bhagavā paramappicchatāya pasaṃsanto –"
    ],
    "innerText": "Chaḷabhiññaṃ pana samānaṃ saparisaṃ āyasmantaṃ yasojaṃ satthā pakkositvā āneñjasamāpattinā paṭisanthāramakāsi. So sabbepi dhutaṅgadhamme samādāya vattati. Tenassa sarīraṃ kisaṃ ahosi lūkhaṃ dubbaṇṇaṃ, taṃ bhagavā paramappicchatāya pasaṃsanto –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "243"
      },
      "."
    ],
    "innerText": "243."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " ‘‘Kālapabbaṅgasaṅkāso ",
      ", kiso dhamanisanthato;"
    ],
    "innerText": "‘‘Kālapabbaṅgasaṅkāso , kiso dhamanisanthato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Mattaññū annapānamhi, adīnamānaso naro’’ti. – paṭhamaṃ gāthamāha;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kālapabbaṅgasaṅkāso"
      },
      "ti maṃsūpacayavigamena kisadusaṇṭhitasarīrāvayavatāya dantilatāpabbasadisaṅgo, tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kiso dhamanisanthato’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kiso"
      },
      "ti moneyyapaṭipadāpūraṇena kisasarīro. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhamanisanthato"
      },
      "ti dhamanīhi santhatagatto appamaṃsalohitatāya pākaṭīhi kaṇḍarasirāhi vitatasarīro. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mattaññū"
      },
      "ti pariyesanapaṭiggahaṇaparibhogavissajjanesu pamāṇaññū. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adīnamānaso"
      },
      "ti kosajjādīhi anabhibhūtattā alīnacitto akusītavutti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Naro"
      },
      "ti puriso, porisassa dhurassa vahanato porisalakkhaṇasampanno purisadhorayhoti adhippāyo."
    ],
    "innerText": "Tattha kālapabbaṅgasaṅkāsoti maṃsūpacayavigamena kisadusaṇṭhitasarīrāvayavatāya dantilatāpabbasadisaṅgo, tenāha ‘‘kiso dhamanisanthato’’ti. Kisoti moneyyapaṭipadāpūraṇena kisasarīro. Dhamanisanthatoti dhamanīhi santhatagatto appamaṃsalohitatāya pākaṭīhi kaṇḍarasirāhi vitatasarīro. Mattaññūti pariyesanapaṭiggahaṇaparibhogavissajjanesu pamāṇaññū. Adīnamānasoti kosajjādīhi anabhibhūtattā alīnacitto akusītavutti. Naroti puriso, porisassa dhurassa vahanato porisalakkhaṇasampanno purisadhorayhoti adhippāyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ thero satthārā pasaṭṭho pasaṭṭhabhāvānurūpaṃ attano adhivāsanakhantivīriyārambhavivekābhiratikittanamukhena bhikkhūnaṃ dhammaṃ kathento –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "244"
      },
      "."
    ],
    "innerText": "244."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Phuṭṭho ḍaṃsehi makasehi, araññasmiṃ brahāvane;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nāgo saṅgāmasīseva, sato tatrādhivāsaye."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "245"
      },
      "."
    ],
    "innerText": "245."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yathā brahmā tathā eko, yathā devo tathā duve;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yathā gāmo tathā tayo, kolāhalaṃ tatuttari’’nti. –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Imā dve gāthā abhāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nāgo saṅgāmasīsevā"
      },
      "ti yathā nāma ājāneyyo hatthināgo yuddhamaṇḍale asisattitomarādippahāre adhivāsetvā parasenaṃ viddhaṃseti, evaṃ bhikkhu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "araññasmiṃ brahāvane"
      },
      " araññāniyaṃ ḍaṃsādiparissaye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sato"
      },
      " sampajāno adhivāseyya, adhivāsetvā ca bhāvanābalena mārabalaṃ vidhameyya."
    ],
    "innerText": "Tattha nāgo saṅgāmasīsevāti yathā nāma ājāneyyo hatthināgo yuddhamaṇḍale asisattitomarādippahāre adhivāsetvā parasenaṃ viddhaṃseti, evaṃ bhikkhu araññasmiṃ brahāvane araññāniyaṃ ḍaṃsādiparissaye sato sampajāno adhivāseyya, adhivāsetvā ca bhāvanābalena mārabalaṃ vidhameyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathā brahmā"
      },
      "ti yathā brahmā ekako cittappakoparahito jhānasukhena niccameva sukhito viharati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tathā eko"
      },
      "ti bhikkhupi eko adutiyo vivekasukhamanubrūhento sukhaṃ viharati. Ekassa sāmaññasukhaṃ paṇītanti hi vuttaṃ. Etena ekavihārī bhikkhu ‘‘brahmasamo’’ti ovādaṃ deti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathā devo tathā duve"
      },
      "ti yathā devānaṃ antarantarā ",
      " cittappakopopi siyā, tathā dvinnaṃ bhikkhūnaṃ sahavāse ghaṭṭanāpi bhaveyyāti sadutiyavāsena bhikkhu ‘‘devasamo’’ti vutto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathā gāmo tathā tayo"
      },
      "ti asmimeva pāṭhe tiṇṇaṃ bhikkhūnaṃ sahavāso gāmavāsasadiso vivekavāso na hotīti adhippāyo ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kolāhalaṃ tatuttari"
      },
      "nti tato tayato upari ca bahūnaṃ saṃvāso kolāhalaṃ uccāsaddamahāsaddamahājanasannipātasadiso, tasmā ekavihārinā bhavitabbanti adhippāyoti."
    ],
    "innerText": "Yathā brahmāti yathā brahmā ekako cittappakoparahito jhānasukhena niccameva sukhito viharati tathā ekoti bhikkhupi eko adutiyo vivekasukhamanubrūhento sukhaṃ viharati. Ekassa sāmaññasukhaṃ paṇītanti hi vuttaṃ. Etena ekavihārī bhikkhu ‘‘brahmasamo’’ti ovādaṃ deti. Yathā devo tathā duveti yathā devānaṃ antarantarā cittappakopopi siyā, tathā dvinnaṃ bhikkhūnaṃ sahavāse ghaṭṭanāpi bhaveyyāti sadutiyavāsena bhikkhu ‘‘devasamo’’ti vutto. Yathā gāmo tathā tayoti asmimeva pāṭhe tiṇṇaṃ bhikkhūnaṃ sahavāso gāmavāsasadiso vivekavāso na hotīti adhippāyo . Kolāhalaṃ tatuttarinti tato tayato upari ca bahūnaṃ saṃvāso kolāhalaṃ uccāsaddamahāsaddamahājanasannipātasadiso, tasmā ekavihārinā bhavitabbanti adhippāyoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Yasojattheragāthāvaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Sāṭimattiyattheragāthāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ahu tuyhaṃ pure saddhā"
      },
      "ti āyasmato sāṭimattiyattherassa gāthā. Kā uppatti? Ayampi purimabuddhesu katādhikāro tattha tattha bhave puññāni upacinanto siddhatthassa bhagavato kāle kulagehe nibbattitvā viññutaṃ patto ekadivasaṃ satthāraṃ disvā pasannamānaso tālavaṇṭaṃ adāsi. So tena puññakammena devamanussesu saṃsaranto imasmiṃ buddhuppāde magadharaṭṭhe brāhmaṇakule nibbattitvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sāṭimattiyo"
      },
      "ti laddhanāmo vayappatto hetusampannatāya āraññakabhikkhūnaṃ santike pabbajitvā vipassanāya kammaṃ karonto chaḷabhiñño ahosi. Tena vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "apadāne"
      },
      " (apa. thera 1.38.43-47) –"
    ],
    "innerText": "Ahu tuyhaṃ pure saddhāti āyasmato sāṭimattiyattherassa gāthā. Kā uppatti? Ayampi purimabuddhesu katādhikāro tattha tattha bhave puññāni upacinanto siddhatthassa bhagavato kāle kulagehe nibbattitvā viññutaṃ patto ekadivasaṃ satthāraṃ disvā pasannamānaso tālavaṇṭaṃ adāsi. So tena puññakammena devamanussesu saṃsaranto imasmiṃ buddhuppāde magadharaṭṭhe brāhmaṇakule nibbattitvā sāṭimattiyoti laddhanāmo vayappatto hetusampannatāya āraññakabhikkhūnaṃ santike pabbajitvā vipassanāya kammaṃ karonto chaḷabhiñño ahosi. Tena vuttaṃ apadāne (apa. thera 1.38.43-47) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Siddhatthassa ",
      " bhagavato, tālavaṇṭamadāsahaṃ;"
    ],
    "innerText": "‘‘Siddhatthassa bhagavato, tālavaṇṭamadāsahaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sumanehi paṭicchannaṃ, dhārayāmi mahārahaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Catunnavutito kappe, tālavaṇṭamadāsahaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Duggatiṃ nābhijānāmi, tālavaṇṭassidaṃ phalaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kilesā jhāpitā mayhaṃ…pe… kataṃ buddhassa sāsana’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Chaḷabhiñño pana hutvā bhikkhū ovadati anusāsati bahū ca satte dhammaṃ kathetvā saraṇesu ca sīlesu ca patiṭṭhāpesi. Aññatarañca kulaṃ assaddhaṃ appasannaṃ saddhaṃ pasannaṃ akāsi. Tena tasmiṃ kule manussā there abhippasannā ahesuṃ. Tatthekā dārikā abhirūpā dassanīyā theraṃ piṇḍāya paviṭṭhaṃ sakkaccaṃ bhojanena parivisati. Athekadivasaṃ māro ‘‘evaṃ imassa ayaso vaḍḍhissati, appatiṭṭho bhavissatī’’ti cintetvā therassa rūpena gantvā taṃ dārikaṃ hatthe aggahesi. Dārikā ‘‘nāyaṃ manussasamphasso’’ti ca aññāsi, hatthañca muñcāpesi. Taṃ disvā gharajano there appasādaṃ janesi. Punadivase thero taṃ kāraṇaṃ anāvajjento taṃ gharaṃ agamāsi. Tattha manussā anādaraṃ akaṃsu. Thero taṃ kāraṇaṃ āvajjento mārassa kiriyaṃ disvā ‘‘tassa gīvāyaṃ kukkurakuṇapaṃ paṭimuñcatū’’ti adhiṭṭhahitvā ",
      " tassa mocanatthaṃ upagatena mārena atītadivase katakiriyaṃ ",
      " kathāpetvā taṃ tajjetvā vissajjesi. Taṃ disvā gharasāmiko ‘‘khamatha, bhante, accaya’’nti khamāpetvā ‘‘ajjatagge ahameva, bhante, tumhe upaṭṭhahāmī’’ti āha. Thero tassa dhammaṃ kathento –"
    ],
    "innerText": "Chaḷabhiñño pana hutvā bhikkhū ovadati anusāsati bahū ca satte dhammaṃ kathetvā saraṇesu ca sīlesu ca patiṭṭhāpesi. Aññatarañca kulaṃ assaddhaṃ appasannaṃ saddhaṃ pasannaṃ akāsi. Tena tasmiṃ kule manussā there abhippasannā ahesuṃ. Tatthekā dārikā abhirūpā dassanīyā theraṃ piṇḍāya paviṭṭhaṃ sakkaccaṃ bhojanena parivisati. Athekadivasaṃ māro ‘‘evaṃ imassa ayaso vaḍḍhissati, appatiṭṭho bhavissatī’’ti cintetvā therassa rūpena gantvā taṃ dārikaṃ hatthe aggahesi. Dārikā ‘‘nāyaṃ manussasamphasso’’ti ca aññāsi, hatthañca muñcāpesi. Taṃ disvā gharajano there appasādaṃ janesi. Punadivase thero taṃ kāraṇaṃ anāvajjento taṃ gharaṃ agamāsi. Tattha manussā anādaraṃ akaṃsu. Thero taṃ kāraṇaṃ āvajjento mārassa kiriyaṃ disvā ‘‘tassa gīvāyaṃ kukkurakuṇapaṃ paṭimuñcatū’’ti adhiṭṭhahitvā tassa mocanatthaṃ upagatena mārena atītadivase katakiriyaṃ kathāpetvā taṃ tajjetvā vissajjesi. Taṃ disvā gharasāmiko ‘‘khamatha, bhante, accaya’’nti khamāpetvā ‘‘ajjatagge ahameva, bhante, tumhe upaṭṭhahāmī’’ti āha. Thero tassa dhammaṃ kathento –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "246"
      },
      "."
    ],
    "innerText": "246."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ahu tuyhaṃ pure saddhā, sā te ajja na vijjati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yaṃ tuyhaṃ tuyhamevetaṃ, natthi duccaritaṃ mama."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "247"
      },
      "."
    ],
    "innerText": "247."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Aniccā hi calā saddhā, evaṃ diṭṭhā hi sā mayā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Rajjantipi virajjanti, tattha kiṃ jiyyate muni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "248"
      },
      "."
    ],
    "innerText": "248."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Paccati munino bhattaṃ, thokaṃ thokaṃ kule kule;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Piṇḍikāya carissāmi, atthi jaṅghabalaṃ mamā’’ti. –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Tisso gāthā abhāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ahu tuyhaṃ pure saddhā, sā te ajja na vijjatī"
      },
      "ti, upāsaka, ito pubbe tava mayi ‘‘ayyo dhammacārī samacārī’’tiādinā saddhā ahosi, sā saddhā te tava ajja idāni na upalabbhati. Tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yaṃ tuyhaṃ tuyhameveta"
      },
      "nti catupaccayadānaṃ, tuyhameva etaṃ hotu, na tena mayhaṃ attho, sammā pasannacittena hi dānaṃ nāma dātabbanti adhippāyo. Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yaṃ tuyhaṃ tuyhameveta"
      },
      "nti yaṃ tava mayi ajja agāravaṃ pavattaṃ, taṃ tuyhameva, tassa phalaṃ tayā eva paccanubhavitabbaṃ, na mayāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Natthi duccaritaṃ mamā"
      },
      "ti mama pana duccaritaṃ nāma natthi maggeneva duccaritahetūnaṃ kilesānaṃ samucchinnattā."
    ],
    "innerText": "Tattha ahu tuyhaṃ pure saddhā, sā te ajja na vijjatīti, upāsaka, ito pubbe tava mayi ‘‘ayyo dhammacārī samacārī’’tiādinā saddhā ahosi, sā saddhā te tava ajja idāni na upalabbhati. Tasmā yaṃ tuyhaṃ tuyhamevetanti catupaccayadānaṃ, tuyhameva etaṃ hotu, na tena mayhaṃ attho, sammā pasannacittena hi dānaṃ nāma dātabbanti adhippāyo. Atha vā yaṃ tuyhaṃ tuyhamevetanti yaṃ tava mayi ajja agāravaṃ pavattaṃ, taṃ tuyhameva, tassa phalaṃ tayā eva paccanubhavitabbaṃ, na mayāti attho. Natthi duccaritaṃ mamāti mama pana duccaritaṃ nāma natthi maggeneva duccaritahetūnaṃ kilesānaṃ samucchinnattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aniccā hi calā saddhā"
      },
      "ti yasmā pothujjanikā saddhā aniccā ekantikā na hoti, tato eva calā assapiṭṭhe ṭhapitakumbhaṇḍaṃ viya, thusarāsimhi nikhātakhāṇukaṃ viya ca anavaṭṭhitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ diṭṭhā hi sā mayā"
      },
      "ti evaṃ bhūtā ca sā saddhā mayā tayi diṭṭhā paccakkhato viditā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rajjantipi virajjantī"
      },
      "ti evaṃ tassā anavaṭṭhitattā eva ime sattā kadāci katthaci mittasanthavavasena rajjanti sinehampi karonti, kadāci virajjanti virattacittā honti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tattha kiṃ jiyyate munī"
      },
      "ti tasmiṃ puthujjanānaṃ rajjane virajjane ca muni pabbajito kiṃ jiyyati, kā tassa hānīti attho."
    ],
    "innerText": "Aniccā hi calā saddhāti yasmā pothujjanikā saddhā aniccā ekantikā na hoti, tato eva calā assapiṭṭhe ṭhapitakumbhaṇḍaṃ viya, thusarāsimhi nikhātakhāṇukaṃ viya ca anavaṭṭhitā. Evaṃ diṭṭhā hi sā mayāti evaṃ bhūtā ca sā saddhā mayā tayi diṭṭhā paccakkhato viditā. Rajjantipi virajjantīti evaṃ tassā anavaṭṭhitattā eva ime sattā kadāci katthaci mittasanthavavasena rajjanti sinehampi karonti, kadāci virajjanti virattacittā honti. Tattha kiṃ jiyyate munīti tasmiṃ puthujjanānaṃ rajjane virajjane ca muni pabbajito kiṃ jiyyati, kā tassa hānīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace mama paccaye na gaṇhatha, kathaṃ tumhe yāpethā’’ti evaṃ mā cintayīti dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘paccatī’’"
      },
      "ti gāthamāha. Tassattho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "munino"
      },
      " pabbajitassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhattaṃ"
      },
      " nāma ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kule kule"
      },
      " anugharaṃ divase divase ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "thokaṃ thokaṃ"
      },
      " paccate, na ca tuyhaṃ eva gehe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Piṇḍikāya carissāmi, atthi jaṅghabalaṃ mamā"
      },
      "ti atthi me jaṅghabalaṃ, nāhaṃ obhaggajaṅgho na khañjo na ca pādarogī, tasmā ",
      " piṇḍikāya missakabhikkhāya carissāmi, ‘‘yathāpi bhamaro puppha’’ntiādinā (dha. pa. 49; netti. 123) satthārā vuttanayena piṇḍāya caritvā yāpessāmīti dasseti."
    ],
    "innerText": "‘‘Sace mama paccaye na gaṇhatha, kathaṃ tumhe yāpethā’’ti evaṃ mā cintayīti dassento ‘‘paccatī’’ti gāthamāha. Tassattho munino pabbajitassa bhattaṃ nāma kule kule anugharaṃ divase divase thokaṃ thokaṃ paccate, na ca tuyhaṃ eva gehe. Piṇḍikāya carissāmi, atthi jaṅghabalaṃ mamāti atthi me jaṅghabalaṃ, nāhaṃ obhaggajaṅgho na khañjo na ca pādarogī, tasmā piṇḍikāya missakabhikkhāya carissāmi, ‘‘yathāpi bhamaro puppha’’ntiādinā (dha. pa. 49; netti. 123) satthārā vuttanayena piṇḍāya caritvā yāpessāmīti dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sāṭimattiyattheragāthāvaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "11. Upālittheragāthāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddhāya"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhinikkhammā"
      },
      "ti āyasmato upālittherassa gāthā. Kā uppatti? Ayampi padumuttarassa bhagavato kāle haṃsavatīnagare kulaghare nibbatto ekadivasaṃ satthu dhammaṃ suṇanto satthāraṃ ekaṃ bhikkhuṃ vinayadharānaṃ aggaṭṭhāne ṭhapentaṃ disvā adhikārakammaṃ katvā taṃ ṭhānantaraṃ patthesi. So yāvajīvaṃ kusalaṃ katvā devamanussesu saṃsaranto imasmiṃ buddhuppāde kappakagehe paṭisandhiṃ gaṇhi, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upālī"
      },
      "tissa nāmaṃ akaṃsu. So vayappatto anuruddhādīnaṃ channaṃ khattiyānaṃ pasādako hutvā tathāgate anupiyambavane viharante pabbajanatthāya nikkhamantehi chahi khattiyehi saddhiṃ nikkhamitvā pabbaji. Tassa pabbajjāvidhānaṃ pāḷiyaṃ āgatameva (cūḷava. 330)."
    ],
    "innerText": "Saddhāyaabhinikkhammāti āyasmato upālittherassa gāthā. Kā uppatti? Ayampi padumuttarassa bhagavato kāle haṃsavatīnagare kulaghare nibbatto ekadivasaṃ satthu dhammaṃ suṇanto satthāraṃ ekaṃ bhikkhuṃ vinayadharānaṃ aggaṭṭhāne ṭhapentaṃ disvā adhikārakammaṃ katvā taṃ ṭhānantaraṃ patthesi. So yāvajīvaṃ kusalaṃ katvā devamanussesu saṃsaranto imasmiṃ buddhuppāde kappakagehe paṭisandhiṃ gaṇhi, upālītissa nāmaṃ akaṃsu. So vayappatto anuruddhādīnaṃ channaṃ khattiyānaṃ pasādako hutvā tathāgate anupiyambavane viharante pabbajanatthāya nikkhamantehi chahi khattiyehi saddhiṃ nikkhamitvā pabbaji. Tassa pabbajjāvidhānaṃ pāḷiyaṃ āgatameva (cūḷava. 330)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "So pabbajitvā upasampanno satthu santike kammaṭṭhānaṃ gahetvā ‘‘mayhaṃ, bhante, araññavāsaṃ anujānāthā’’ti āha. Bhikkhu tava araññe vasantassa ekameva dhuraṃ vaḍḍhissati, amhākaṃ pana santike vasantassa ganthadhurañca vipassanādhurañca paripūressatīti. Thero satthu vacanaṃ sampaṭicchitvā vipassanāya kammaṃ karonto nacirasseva arahattaṃ pāpuṇi. Tena vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "apadāne"
      },
      " (apa. thera 1.1.441-595) –"
    ],
    "innerText": "So pabbajitvā upasampanno satthu santike kammaṭṭhānaṃ gahetvā ‘‘mayhaṃ, bhante, araññavāsaṃ anujānāthā’’ti āha. Bhikkhu tava araññe vasantassa ekameva dhuraṃ vaḍḍhissati, amhākaṃ pana santike vasantassa ganthadhurañca vipassanādhurañca paripūressatīti. Thero satthu vacanaṃ sampaṭicchitvā vipassanāya kammaṃ karonto nacirasseva arahattaṃ pāpuṇi. Tena vuttaṃ apadāne (apa. thera 1.1.441-595) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Nagare haṃsavatiyā, sujāto nāma brāhmaṇo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Asītikoṭinicayo, pahūtadhanadhaññavā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ajjhāyako mantadharo, tiṇṇaṃ vedāna pāragū;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Lakkhaṇe itihāse ca, sadhamme pāramiṃ gato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Paribbājā ekasikhā, gotamā buddhasāvakā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Carakā tāpasā ceva, caranti mahiyā tadā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Tepi ",
      " maṃ parivārenti, brāhmaṇo vissuto iti;"
    ],
    "innerText": "‘‘Tepi maṃ parivārenti, brāhmaṇo vissuto iti;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bahujjano maṃ pūjeti, nāhaṃ pūjemi kiñcanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Pūjārahaṃ na passāmi, mānatthaddho ahaṃ tadā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Buddhoti vacanaṃ natthi, tāva nuppajjate jino."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Accayena ahorattaṃ, padumuttaranāmako;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sabbaṃ tamaṃ vinodetvā, loke uppajji cakkhumā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Vitthārike ",
      " bāhujaññe, puthubhūte ca sāsane;"
    ],
    "innerText": "‘‘Vitthārike bāhujaññe, puthubhūte ca sāsane;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Upāgami tadā buddho, nagaraṃ haṃsasavhayaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Pitu atthāya so buddho, dhammaṃ desesi cakkhumā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tena kālena parisā, samantā yojanaṃ tadā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sammato manujānaṃ so, sunando nāma tāpaso;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yāvatā buddhaparisā, pupphehacchādayī tadā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Catusaccaṃ pakāsente, seṭṭhe ca pupphamaṇḍape;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Koṭisatasahassānaṃ, dhammābhisamayo ahu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sattarattindivaṃ buddho, vassetvā dhammavuṭṭhiyo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Aṭṭhame divase patte, sunandaṃ kittayī jino."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Devaloke manusse vā, saṃsaranto ayaṃ bhave;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sabbesaṃ pavaro hutvā, bhavesu saṃsarissati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kappasatasahassamhi, okkākakulasambhavo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Gotamo nāma gottena, satthā loke bhavissati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tassa dhammesu dāyādo, oraso dhammanimmito;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Mantāṇiputto puṇṇoti, hessati satthu sāvako."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Evaṃ kittayi sambuddho, sunandaṃ tāpasaṃ tadā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Hāsayanto janaṃ sabbaṃ, dassayanto sakaṃ balaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Katañjalī namassanti, sunandaṃ tāpasaṃ janā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Buddhe kāraṃ karitvāna, sodhesi gatimattano."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tattha me ahu saṅkappo, sutvāna munino vacaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ahampi kāraṃ kassāmi, yathā passāmi gotamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Evāhaṃ cintayitvāna, kiriyaṃ cintayiṃ mama;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kyāhaṃ kammaṃ ācarāmi, puññakkhette anuttare."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ayañca pāṭhiko bhikkhu, sabbapāṭhissa sāsane;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vinaye agganikkhitto, taṃ ṭhānaṃ patthaye ahaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Idaṃ ",
      " me amitaṃ bhogaṃ, akkhobhaṃ sāgarūpamaṃ;"
    ],
    "innerText": "‘‘Idaṃ me amitaṃ bhogaṃ, akkhobhaṃ sāgarūpamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tena bhogena buddhassa, ārāmaṃ māpaye ahaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sobhanaṃ nāma ārāmaṃ, nagarassa puratthato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kiṇitvā satasahassena, saṅghārāmaṃ amāpayiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kūṭāgāre ca pāsāde, maṇḍape hammiye guhā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Caṅkame sukate katvā, saṅghārāmaṃ amāpayiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Jantāgharaṃ aggisālaṃ, atho udakamāḷakaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nhānagharaṃ māpayitvā, bhikkhusaṅghassadāsahaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Āsandiyo pīṭhake ca, paribhoge ca bhājane;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ārāmikañca bhesajjaṃ, sabbametaṃ adāsahaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ārakkhaṃ paṭṭhapetvāna, pākāraṃ kārayiṃ daḷhaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Mā naṃ koci viheṭhesi, santacittāna tādinaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Satasahassenāvāsaṃ, saṅghārāme amāpayiṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vepullaṃ taṃ māpayitvā, sambuddhaṃ upanāmayiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Niṭṭhāpito mayārāmo, sampaṭiccha tuvaṃ muni;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Niyyādessāmi taṃ vīra, adhivāsehi cakkhuma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Padumuttaro lokavidū, āhutīnaṃ paṭiggaho;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Mama saṅkappamaññāya, adhivāsesi nāyako."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Adhivāsanamaññāya, sabbaññussa mahesino;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhojanaṃ paṭiyādetvā, kālamārocayiṃ ahaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ārocitamhi kālamhi, padumuttaranāyako;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Khīṇāsavasahassehi, ārāmaṃ me upāgami."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Nisinnaṃ kālamaññāya, annapānena tappayiṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhuttāviṃ kālamaññāya, idaṃ vacanamabraviṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kīto satasahassena, tattakeneva kārito;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sobhano nāma ārāmo, sampaṭiccha tuvaṃ muni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Iminārāmadānena ",
      ", cetanāpaṇidhīhi ca;"
    ],
    "innerText": "‘‘Iminārāmadānena , cetanāpaṇidhīhi ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhave nibbattamānohaṃ, labhāmi mama patthitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Paṭiggahetvā sambuddho, saṅghārāmaṃ sumāpitaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhikkhusaṅghe nisīditvā, idaṃ vacanamabravi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yo so buddhassa pādāsi, saṅghārāmaṃ sumāpitaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tamahaṃ kittayissāmi, suṇātha mama bhāsato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Hatthī ",
      " assā rathā pattī, senā ca caturaṅginī;"
    ],
    "innerText": "‘‘Hatthī assā rathā pattī, senā ca caturaṅginī;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Parivāressantimaṃ niccaṃ, saṅghārāmassidaṃ phalaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Saṭṭhi tūrasahassāni, bheriyo samalaṅkatā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Parivāressantimaṃ niccaṃ, saṅghārāmassidaṃ phalaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Chaḷasītisahassāni, nāriyo samalaṅkatā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vicittavatthābharaṇā, āmuttamaṇikuṇḍalā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Aḷārapamhā hasulā, susaññā tanumajjhimā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Parivāressantimaṃ niccaṃ, saṅghārāmassidaṃ phalaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tiṃsakappasahassāni, devaloke ramissati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sahassakkhattuṃ devindo, devarajjaṃ karissati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Devarājena pattabbaṃ, sabbaṃ paṭilabhissati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Anūnabhogo hutvāna, devarajjaṃ karissati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sahassakkhattuṃ cakkavattī, rājā raṭṭhe bhavissati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pathabyā rajjaṃ vipulaṃ, gaṇanāto asaṅkhiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kappasatasahassamhi, okkākakulasambhavo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Gotamo nāma gottena, satthā loke bhavissati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tassa dhammesu dāyādo, oraso dhammanimmito;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Upāli nāma nāmena, hessati satthu sāvako."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Vinaye pāramiṃ patvā, ṭhānāṭhāne ca kovido;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Jinasāsanaṃ dhārento, viharissatināsavo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Sabbametaṃ ",
      " abhiññāya, gotamo sakyapuṅgavo;"
    ],
    "innerText": "‘‘Sabbametaṃ abhiññāya, gotamo sakyapuṅgavo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhikkhusaṅghe nisīditvā, etadagge ṭhapessati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Aparimeyyupādāya, patthemi tava sāsanaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "So me attho anuppatto, sabbasaṃyojanakkhayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yathā sūlāvuto poso, rājadaṇḍena tajjito;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sūle sātaṃ avindanto, parimuttiṃva icchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tathevāhaṃ mahāvīra, bhavadaṇḍena tajjito;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kammasūlāvuto santo, pipāsāvedanaṭṭito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Bhave sātaṃ na vindāmi, ḍayhanto tīhi aggibhi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Parimuttiṃ gavesāmi, yathāpi rājadaṇḍito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yathā visādo puriso, visena paripīḷito;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Agadaṃ so gaveseyya, visaghātāyupālanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Gavesamāno ",
      " passeyya, agadaṃ visaghātakaṃ;"
    ],
    "innerText": "‘‘Gavesamāno passeyya, agadaṃ visaghātakaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Taṃ pivitvā sukhī assa, visamhā parimuttiyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tathevāhaṃ mahāvīra, yathā visahato naro;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sampīḷito avijjāya, saddhammāgadamesahaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Dhammāgadaṃ gavesanto, addakkhiṃ sakyasāsanaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Aggaṃ sabbosadhānaṃ taṃ, sabbasallavinodanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Dhammosadhaṃ pivitvāna, visaṃ sabbaṃ samūhaniṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ajarāmaraṃ sītibhāvaṃ, nibbānaṃ phassayiṃ ahaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yathā bhūtaṭṭito poso, bhūtaggāhena pīḷito;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhūtavejjaṃ gaveseyya, bhūtasmā parimuttiyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Gavesamāno passeyya, bhūtavijjāsu kovidaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tassa so vihane bhūtaṃ, samūlañca vināsaye."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tathevāhaṃ mahāvīra, tamaggāhena pīḷito;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ñāṇālokaṃ gavesāmi, tamato parimuttiyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Athaddasaṃ ",
      " sakyamuniṃ, kilesatamasodhanaṃ;"
    ],
    "innerText": "‘‘Athaddasaṃ sakyamuniṃ, kilesatamasodhanaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "So me tamaṃ vinodesi, bhūtavejjova bhūtakaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Saṃsārasotaṃ sañchindiṃ, taṇhāsotaṃ nivārayiṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhavaṃ ugghāṭayiṃ sabbaṃ, bhūtavejjova mūlato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Garuḷo yathā opatati, pannagaṃ bhakkhamattano;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Samantā yojanasataṃ, vikkhobheti mahāsaraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Pannagaṃ so gahetvāna, adhosīsaṃ viheṭhayaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ādāya so pakkamati, yenakāmaṃ vihaṅgamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tathevāhaṃ mahāvīra, yathāpi garuḷo balī;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Asaṅkhataṃ gavesanto, dose vikkhālayiṃ ahaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Diṭṭho ahaṃ dhammavaraṃ, santipadamanuttaraṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ādāya viharāmetaṃ, garuḷo pannagaṃ yathā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Āsāvatī nāma latā, jātā cittalatāvane;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tassā vassasahassena, ekaṃ nibbattate phalaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Taṃ devā payirupāsanti, tāvadūraphale sati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Devānaṃ sā piyā evaṃ, āsāvatī latuttamā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Satasahassupādāya, tāhaṃ paricare muni;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sāyaṃ pātaṃ namassāmi, devā āsāvatiṃ yathā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Avañjhā ",
      " pāricariyā, amoghā ca namassanā;"
    ],
    "innerText": "‘‘Avañjhā pāricariyā, amoghā ca namassanā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dūrāgatampi maṃ santaṃ, khaṇoyaṃ na virādhayi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Paṭisandhiṃ na passāmi, vicinanto bhave ahaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nirūpadhi vippamutto, upasanto carāmahaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yathāpi padumaṃ nāma, sūriyaraṃsena pupphati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tathevāhaṃ mahāvīra, buddharaṃsena pupphito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yathā balākayonimhi, na vijjati pumo sadā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Meghesu gajjamānesu, gabbhaṃ gaṇhanti tā sadā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Cirampi ",
      " gabbhaṃ dhārenti, yāva megho na gajjati;"
    ],
    "innerText": "‘‘Cirampi gabbhaṃ dhārenti, yāva megho na gajjati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhārato parimuccanti, yadā megho pavassati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Padumuttarabuddhassa, dhammameghena gajjato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Saddena dhammameghassa, dhammagabbhaṃ agaṇhahaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Satasahassupādāya, puññagabbhaṃ dharemahaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nappamuccāmi bhārato, dhammamegho na gajjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yadā tuvaṃ sakyamuni, ramme kapilavatthave;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Gajjasi dhammameghena, bhārato parimuccahaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Suññataṃ animittañca, tathāppaṇihitampi ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Caturo ca phale sabbe, dhammevaṃ vijanayiṃ ahaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Aparimeyyupādāya, patthemi tava sāsanaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "So me attho anuppatto, santipadamanuttaraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Vinaye pāramiṃ patto, yathāpi pāṭhiko isi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Na me samasamo atthi, dhāremi sāsanaṃ ahaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Vinaye khandhake cāpi, tikacchede ca pañcake;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ettha me vimati natthi, akkhare byañjanepi vā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Niggahe paṭikamme ca, ṭhānāṭhāne ca kovido;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Osāraṇe vuṭṭhāpane, sabbattha pāramiṃ gato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Vinaye khandhake vāpi, nikkhipitvā padaṃ ahaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ubhato viniveṭhetvā, rasato osareyyahaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Niruttiyā sukusalo, atthānatthe ca kovido;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Anaññātaṃ mayā natthi, ekaggo satthu sāsane."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Rūpadakkho ahaṃ ajja, sakyaputtassa sāsane;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kaṅkhaṃ sabbaṃ vinodemi, chindāmi sabbasaṃsayaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Padaṃ ",
      " anupadañcāpi, akkharañcāpi byañjanaṃ;"
    ],
    "innerText": "‘‘Padaṃ anupadañcāpi, akkharañcāpi byañjanaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nidāne pariyosāne, sabbattha kovido ahaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Yathāpi ",
      " rājā balavā, niggaṇhitvā parantape;"
    ],
    "innerText": "‘‘Yathāpi rājā balavā, niggaṇhitvā parantape;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vijinitvāna saṅgāmaṃ, nagaraṃ tattha māpaye."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Pākāraṃ parikhañcāpi, esikaṃ dvārakoṭṭhakaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Aṭṭālake ca vividhe, kāraye nagare bahū."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Siṅghāṭakaṃ caccarañca, suvibhattantarāpaṇaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kārayeyya sabhaṃ tattha, atthānatthavinicchayaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Nigghātatthaṃ amittānaṃ, chiddāchiddañca jānituṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Balakāyassa rakkhāya, senāpaccaṃ ṭhapeti so."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ārakkhatthāya bhaṇḍassa, nidhānakusalaṃ naraṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Mā me bhaṇḍaṃ vinassīti, bhaṇḍarakkhaṃ ṭhapeti so."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Mamatto hoti yo rañño, vuddhiṃ yassa ca icchati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tassādhikaraṇaṃ deti, mittassa paṭipajjituṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Uppātesu nimittesu, lakkhaṇesu ca kovidaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ajjhāyakaṃ mantadharaṃ, porohicce ṭhapeti so."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Etehaṅgehi sampanno, khattiyoti pavuccati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sadā rakkhanti rājānaṃ, cakkavākova dukkhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tatheva tvaṃ mahāvīra, hatāmittova khattiyo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sadevakassa lokassa, dhammarājāti vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Titthiye nihanitvāna, mārañcāpi sasenakaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tamandhakāraṃ vidhamitvā, dhammanagaraṃ amāpayi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sīlaṃ pākārakaṃ tattha, ñāṇaṃ te dvārakoṭṭhakaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Saddhā te esikā vīra, dvārapālo ca saṃvaro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Satipaṭṭhānamaṭṭālaṃ, paññā te caccaraṃ mune;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Iddhipādañca siṅghāṭaṃ, dhammavīthi sumāpitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Suttantaṃ abhidhammañca, vinayañcāpi kevalaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Navaṅgaṃ buddhavacanaṃ, esā dhammasabhā tava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Suññataṃ ",
      " animittañca, vihārañcappaṇīhitaṃ;"
    ],
    "innerText": "‘‘Suññataṃ animittañca, vihārañcappaṇīhitaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Āneñjañca nirodho ca, esā dhammakuṭī tava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Paññāya aggo nikkhitto, paṭibhāne ca kovido;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sāriputtoti nāmena, dhammasenāpatī tava."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Cutūpapātakusalo ",
      ", iddhiyā pāramiṃ gato;"
    ],
    "innerText": "‘‘Cutūpapātakusalo , iddhiyā pāramiṃ gato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kolito nāma nāmena, porohicco tavaṃ mune."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Porāṇakavaṃsadharo, uggatejo durāsado;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dhutavādīguṇenaggo, akkhadasso tavaṃ mune."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Bahussuto dhammadharo, sabbapāṭhī ca sāsane;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ānando nāma nāmena, dhammārakkho tavaṃ mune."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ete sabbe atikkamma, pamesi bhagavā mamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vinicchayaṃ me pādāsi, vinaye viññudesitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yo koci vinaye pañhaṃ, pucchati buddhasāvako;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tattha me cintanā natthi, taññevatthaṃ kathemahaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yāvatā buddhakhettamhi, ṭhapetvā taṃ mahāmuni;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vinaye mādiso natthi, kuto bhiyyo bhavissati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Bhikkhusaṅghe nisīditvā, evaṃ gajjati gotamo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Upālissa samo natthi, vinaye khandhakesu ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yāvatā buddhabhaṇitaṃ, navaṅgaṃ satthusāsanaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vinayogadhaṃ taṃ sabbaṃ, vinayamūlapassino."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Mama kammaṃ saritvāna, gotamo sakyapuṅgavo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhikkhusaṅghe nisīditvā, etadagge ṭhapesi maṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Satasahassupādāya, imaṃ ṭhānaṃ apatthayiṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "So me attho anuppatto, vinaye pāramiṃ gato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sakyānaṃ nandijanano, kappako āsahaṃ pure;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vijahitvāna taṃ jātiṃ, putto jāto mahesino."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Ito ",
      " dutiyake kappe, añjaso nāma khattiyo;"
    ],
    "innerText": "‘‘Ito dutiyake kappe, añjaso nāma khattiyo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Anantatejo amitayaso, bhūmipālo mahaddhano."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tassa rañño ahaṃ putto, candano nāma khattiyo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Jātimadenupatthaddho, yasabhogamadena ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Nāgasatasahassāni, sabbālaṅkārabhūsitā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tidhāpabhinnā mātaṅgā, parivārenti maṃ sadā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sabalehi paretohaṃ, uyyānaṃ gantukāmako;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Āruyha sirikaṃ nāgaṃ, nagarā nikkhamiṃ tadā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Caraṇena ca sampanno, guttadvāro susaṃvuto;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Devalo nāma sambuddho, āgacchi purato mama."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Pesetvā ",
      " sirikaṃ nāgaṃ, buddhaṃ āsādayiṃ tadā;"
    ],
    "innerText": "‘‘Pesetvā sirikaṃ nāgaṃ, buddhaṃ āsādayiṃ tadā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tato sañjātakopo so, nāgo nuddharate padaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Nāgaṃ ruṇṇamanaṃ disvā, buddhe kodhaṃ akāsahaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vihesayitvā sambuddhaṃ, uyyānaṃ agamāsahaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sātaṃ tattha na vindāmi, siro pajjalito yathā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pariḷāhena ḍayhāmi, macchova baḷisādako."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sasāgarantā pathavī, ādittā viya hoti me;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pitu santikupāgamma, idaṃ vacanamabraviṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Āsīvisaṃva kupitaṃ, aggikkhandhaṃva āgataṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Mattaṃva kuñjaraṃ dantiṃ, yaṃ sayambhumasādayiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Āsādito mayā buddho, ghoro uggatapo jino;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Purā sabbe vinassāma, khamāpessāma taṃ muniṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘No ce taṃ nijjhāpessāma, attadantaṃ samāhitaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Orena sattadivasā, raṭṭhaṃ me vidhamissati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sumekhalo kosiyo ca, siggavo cāpi sattako;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Āsādayitvā isayo, duggatā te saraṭṭhakā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Yadā ",
      " kuppanti isayo, saññatā brahmacārino;"
    ],
    "innerText": "‘‘Yadā kuppanti isayo, saññatā brahmacārino;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sadevakaṃ vināsenti, sasāgaraṃ sapabbataṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tiyojanasahassamhi, purise sannipātayiṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Accayaṃ desanatthāya, sayambhuṃ upasaṅkamiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Allavatthā allasirā, sabbeva pañjalīkatā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Buddhassa pāde nipatitvā, idaṃ vacanamabravuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Khamassu tvaṃ mahāvīra, abhiyācati taṃ jano;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pariḷāhaṃ vinodehi, mā no raṭṭhaṃ vināsaya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sadevamānusā sabbe, sadānavā sarakkhasā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ayomayena kūṭena, siraṃ bhindeyyu me sadā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Dake aggi na saṇṭhāti, bījaṃ sele na rūhati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Agade kimi na saṇṭhāti, kopo buddhe na jāyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yathā ca bhūmi acalā, appameyyo ca sāgaro;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Anantako ca ākāso, evaṃ buddhā akhobhiyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sadā khantā mahāvīrā, khamitā ca tapassino;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Khantānaṃ khamitānañca, gamanaṃ taṃ na vijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Idaṃ ",
      " vatvāna sambuddho, pariḷāhaṃ vinodayaṃ;"
    ],
    "innerText": "‘‘Idaṃ vatvāna sambuddho, pariḷāhaṃ vinodayaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Mahājanassa purato, nabhaṃ abbhuggamī tadā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tena kammenahaṃ vīra, hīnattaṃ ajjhupāgato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Samatikkamma taṃ jātiṃ, pāvisiṃ abhayaṃ puraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tadāpi maṃ mahāvīra, ḍayhamānaṃ susaṇṭhitaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pariḷāhaṃ vinodesi, sayambhuñca khamāpayiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ajjāpi maṃ mahāvīra, ḍayhamānaṃ tihaggibhi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nibbāpesi tayo aggī, sītibhāvañca pāpayiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yesaṃ sotāvadhānatthi, suṇātha mama bhāsato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Atthaṃ tuyhaṃ pavakkhāmi, yathā diṭṭhaṃ padaṃ mama."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Sayambhuṃ ",
      " taṃ vimānetvā, santacittaṃ samāhitaṃ;"
    ],
    "innerText": "‘‘Sayambhuṃ taṃ vimānetvā, santacittaṃ samāhitaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tena kammenahaṃ ajja, jātomhi nīcayoniyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Mā vo khaṇaṃ virādhetha, khaṇātītā hi socare;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sadatthe vāyameyyātha, khaṇo vo paṭipādito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ekaccānañca vamanaṃ, ekaccānaṃ virecanaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Visaṃ halāhalaṃ eke, ekaccānañca osadhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Vamanaṃ paṭipannānaṃ, phalaṭṭhānaṃ virecanaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Osadhaṃ phalalābhīnaṃ, puññakkhettaṃ gavesinaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sāsanena viruddhānaṃ, visaṃ halāhalaṃ yathā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Āsīviso diṭṭhaviso, evaṃ jhāpeti taṃ naraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sakiṃ pītaṃ halāhalaṃ, uparundhati jīvitaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sāsanena virujjhitvā, kappakoṭimhi ḍayhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Khantiyā avihiṃsāya, mettacittavatāya ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sadevakaṃ so tāreti, tasmā te avirādhiyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Lābhālābhe na sajjanti, sammānanavimānane;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pathavīsadisā buddhā, tasmā te na virādhiyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Devadatte ca vadhake, core aṅgulimālake;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Rāhule dhanapāle ca, sabbesaṃ samako muni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Etesaṃ paṭigho natthi, rāgomesaṃ na vijjati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sabbesaṃ samako buddho, vadhakassorasassa ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Panthe disvāna kāsāvaṃ, chaḍḍitaṃ mīḷhamakkhitaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sirasmiṃ añjaliṃ katvā, vanditabbaṃ isiddhajaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Abbhatītā ",
      " ca ye buddhā, vattamānā anāgatā;"
    ],
    "innerText": "‘‘Abbhatītā ca ye buddhā, vattamānā anāgatā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dhajenānena sujjhanti, tasmā ete namassiyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Satthukappaṃ suvinayaṃ, dhāremi hadayenahaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Namassamāno vinayaṃ, viharissāmi sabbadā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Vinayo ",
      " āsayo mayhaṃ, vinayo ṭhānacaṅkamaṃ;"
    ],
    "innerText": "‘‘Vinayo āsayo mayhaṃ, vinayo ṭhānacaṅkamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kappemi vinaye vāsaṃ, vinayo mama gocaro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Vinaye pāramippatto, samathe cāpi kovido;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Upāli taṃ mahāvīra, pāde vandati satthuno."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘So ahaṃ vicarissāmi, gāmā gāmaṃ purā puraṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Namassamāno sambuddhaṃ, dhammassa ca sudhammataṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kilesā jhāpitā mayhaṃ…pe… kataṃ buddhassa sāsana’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha hi naṃ satthā sayameva sakalaṃ vinayapiṭakaṃ uggaṇhāpesi. So aparabhāge bhārukacchakavatthuṃ (pārā. 78) ajjukavatthuṃ (pārā. 158) kumārakassapavatthunti imāni tīṇi vatthūni vinicchayi. Satthā ekekasmiṃ vinicchite sādhukāraṃ datvā tayopi vinicchaye aṭṭhuppattiṃ katvā theraṃ vinayadharānaṃ aggaṭṭhāne ṭhapesi. So aparabhāge ekasmiṃ uposathadivase pātimokkhuddesasamaye bhikkhū ovadanto –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "249"
      },
      "."
    ],
    "innerText": "249."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " ‘‘Saddhāya ",
      " abhinikkhamma, navapabbajito navo;"
    ],
    "innerText": "‘‘Saddhāya abhinikkhamma, navapabbajito navo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Mitte bhajeyya kalyāṇe, suddhājīve atandite."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "250"
      },
      "."
    ],
    "innerText": "250."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Saddhāya abhinikkhamma, navapabbajito navo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Saṅghasmiṃ viharaṃ bhikkhu, sikkhetha vinayaṃ budho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "251"
      },
      "."
    ],
    "innerText": "251."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Saddhāya abhinikkhamma, navapabbajito navo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kappākappesu kusalo, careyya apurakkhato’’ti. – tisso gāthā abhāsi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saddhāyā"
      },
      "ti saddhānimittaṃ, na jīvikatthanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddhāyā"
      },
      "ti vā kammaphalāni ratanattayaguṇañca saddahitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhinikkhammā"
      },
      "ti gharāvāsato nikkhamitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Navapabbajito"
      },
      "ti navo hutvā pabbajito, paṭhamavaye eva pabbajito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Navo"
      },
      "ti sāsane sikkhāya abhinavo daharo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mitte bhajeyya kalyāṇe suddhājīve atandite"
      },
      "ti ‘‘piyo garu bhāvanīyo’’tiādinā (a. ni. 7.37) vuttalakkhaṇe kalyāṇamitte, micchājīvavivajjanena suddhājīve ",
      ", āraddhavīriyatāya atandite ",
      " bhajeyya upasaṅkameyya, tesaṃ ovādānusāsanīpaṭiggahaṇavasena seveyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅghasmiṃ vihara"
      },
      "nti saṅghe bhikkhusamūhe vattapaṭivattapūraṇavasena viharanto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sikkhetha vinayaṃ budho"
      },
      "ti bodhañāṇatāsukusalo hutvā vinayapariyattiṃ sikkheyya. Vinayo hi sāsanassa āyu, tasmiṃ ṭhite sāsanaṃ ṭhitaṃ hoti. ‘‘Buddho’’ti ca paṭhanti, so evattho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kappākappesū"
      },
      "ti kappiyākappiyesu kusalo suttavasena suttānulomavasena ca nipuṇo cheko. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Apurakkhato"
      },
      "ti na purakkhato taṇhādīhi kutoci purekkhāraṃ apaccāsīsanto hutvā vihareyya."
    ],
    "innerText": "Tattha saddhāyāti saddhānimittaṃ, na jīvikatthanti attho. Saddhāyāti vā kammaphalāni ratanattayaguṇañca saddahitvā. Abhinikkhammāti gharāvāsato nikkhamitvā. Navapabbajitoti navo hutvā pabbajito, paṭhamavaye eva pabbajito. Navoti sāsane sikkhāya abhinavo daharo. Mitte bhajeyya kalyāṇe suddhājīve atanditeti ‘‘piyo garu bhāvanīyo’’tiādinā (a. ni. 7.37) vuttalakkhaṇe kalyāṇamitte, micchājīvavivajjanena suddhājīve , āraddhavīriyatāya atandite bhajeyya upasaṅkameyya, tesaṃ ovādānusāsanīpaṭiggahaṇavasena seveyya. Saṅghasmiṃ viharanti saṅghe bhikkhusamūhe vattapaṭivattapūraṇavasena viharanto. Sikkhetha vinayaṃ budhoti bodhañāṇatāsukusalo hutvā vinayapariyattiṃ sikkheyya. Vinayo hi sāsanassa āyu, tasmiṃ ṭhite sāsanaṃ ṭhitaṃ hoti. ‘‘Buddho’’ti ca paṭhanti, so evattho. Kappākappesūti kappiyākappiyesu kusalo suttavasena suttānulomavasena ca nipuṇo cheko. Apurakkhatoti na purakkhato taṇhādīhi kutoci purekkhāraṃ apaccāsīsanto hutvā vihareyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Upālittheragāthāvaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "12. Uttarapālattheragāthāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṇḍitaṃ vata maṃ santa"
      },
      "nti āyasmato uttarapālattherassa gāthā. Kā uppatti? Ayampi purimabuddhesu katādhikāro tattha tattha bhave puññāni upacinanto vipassissa bhagavato gamanamagge setuṃ kārāpesi. So tena puññakammena devamanussesu saṃsaranto imasmiṃ buddhuppāde sāvatthiyaṃ brāhmaṇakule nibbattitvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uttarapālo"
      },
      "ti laddhanāmo vayappatto yamakapāṭihāriyaṃ disvā paṭiladdhasaddho pabbajitvā samaṇadhammaṃ karoti. Tassa ekadivasaṃ ayonisomanasikāravasena ",
      " anubhūtārammaṇaṃ anussarantassa kāmarāgo uppajji. So tāvadeva sahoḍḍhaṃ coraṃ gaṇhanto viya attano cittaṃ niggahetvā saṃvegajāto paṭipakkhamanasikārena kilese vikkhambhetvā vipassanāya kammaṃ karonto bhāvanaṃ ussukkāpetvā arahattaṃ pāpuṇi. Tena vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "apadāne"
      },
      " (apa. thera 2.47.16-20) –"
    ],
    "innerText": "Paṇḍitaṃ vata maṃ santanti āyasmato uttarapālattherassa gāthā. Kā uppatti? Ayampi purimabuddhesu katādhikāro tattha tattha bhave puññāni upacinanto vipassissa bhagavato gamanamagge setuṃ kārāpesi. So tena puññakammena devamanussesu saṃsaranto imasmiṃ buddhuppāde sāvatthiyaṃ brāhmaṇakule nibbattitvā uttarapāloti laddhanāmo vayappatto yamakapāṭihāriyaṃ disvā paṭiladdhasaddho pabbajitvā samaṇadhammaṃ karoti. Tassa ekadivasaṃ ayonisomanasikāravasena anubhūtārammaṇaṃ anussarantassa kāmarāgo uppajji. So tāvadeva sahoḍḍhaṃ coraṃ gaṇhanto viya attano cittaṃ niggahetvā saṃvegajāto paṭipakkhamanasikārena kilese vikkhambhetvā vipassanāya kammaṃ karonto bhāvanaṃ ussukkāpetvā arahattaṃ pāpuṇi. Tena vuttaṃ apadāne (apa. thera 2.47.16-20) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Vipassino bhagavato, caṅkamantassa sammukhā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pasannacitto sumano, setuṃ kārāpayiṃ ahaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Ekanavutito ",
      " kappe, yaṃ setuṃ kārayiṃ ahaṃ;"
    ],
    "innerText": "‘‘Ekanavutito kappe, yaṃ setuṃ kārayiṃ ahaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Duggatiṃ nābhijānāmi, setudānassidaṃ phalaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kilesā jhāpitā mayhaṃ…pe… kataṃ buddhassa sāsana’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Arahattaṃ pana patvā attano paṭipattiṃ paccavekkhitvā sīhanādaṃ nadanto –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "252"
      },
      "."
    ],
    "innerText": "252."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Paṇḍitaṃ vata maṃ santaṃ, alamatthavicintakaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pañca kāmaguṇā loke, sammohā pātayiṃsu maṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "253"
      },
      "."
    ],
    "innerText": "253."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " ‘‘Pakkhando ",
      " māravisaye, daḷhasallasamappito;"
    ],
    "innerText": "‘‘Pakkhando māravisaye, daḷhasallasamappito;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Asakkhiṃ maccurājassa, ahaṃ pāsā pamuccituṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "254"
      },
      "."
    ],
    "innerText": "254."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sabbe kāmā pahīnā me, bhavā sabbe padālitā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vikkhīṇo jātisaṃsāro, natthi dāni punabbhavo’’ti. –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Tisso gāthā abhāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṇḍitaṃ vata maṃ santa"
      },
      "nti sutacintāmayāya paññāya vasena paññāsampannampi nāma maṃ samānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Alamatthavicintaka"
      },
      "nti attano ca paresañca atthaṃ hitaṃ vicintetuṃ samatthaṃ, alaṃ vā pariyattaṃ atthassa vicintakaṃ, kilesaviddhaṃsanasamatthaṃ atthadassinaṃ vā, sabbametaṃ attano antimabhavikatāya thero vadati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañca kāmaguṇā"
      },
      "ti rūpādayo pañca kāmakoṭṭhāsā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Loke"
      },
      "ti tesaṃ pavattiṭṭhānadassanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammohā"
      },
      "ti sammohanimittaṃ ayonisomanasikārahetu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammohā"
      },
      "ti vā sammohanā sammohakarā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pātayiṃsū"
      },
      "ti dhīrabhāvato pātesuṃ, lokato vā uttaritukāmaṃ maṃ loke pātayiṃsūti attho."
    ],
    "innerText": "Tattha paṇḍitaṃ vata maṃ santanti sutacintāmayāya paññāya vasena paññāsampannampi nāma maṃ samānaṃ. Alamatthavicintakanti attano ca paresañca atthaṃ hitaṃ vicintetuṃ samatthaṃ, alaṃ vā pariyattaṃ atthassa vicintakaṃ, kilesaviddhaṃsanasamatthaṃ atthadassinaṃ vā, sabbametaṃ attano antimabhavikatāya thero vadati. Pañca kāmaguṇāti rūpādayo pañca kāmakoṭṭhāsā. Loketi tesaṃ pavattiṭṭhānadassanaṃ. Sammohāti sammohanimittaṃ ayonisomanasikārahetu. Sammohāti vā sammohanā sammohakarā. Pātayiṃsūti dhīrabhāvato pātesuṃ, lokato vā uttaritukāmaṃ maṃ loke pātayiṃsūti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pakkhando"
      },
      "ti anupaviṭṭho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Māravisaye"
      },
      "ti kilesavisaye kilesamārassa pavattiṭṭhāne, tassa vasaṃ gatoti adhippāyo. Devaputtamārassa vā issariyaṭṭhāne taṃ anupavisitvā ṭhito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Daḷhasallasamappito"
      },
      "ti daḷhaṃ thiraṃ, daḷhena vā sallena samappito, rāgasallena hadayaṃ āhacca viddho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asakkhiṃ maccurājassa, ahaṃ pāsā pamuccitu"
      },
      "nti aggamaggasaṇḍāsena rāgādisallaṃ anavasesato uddharantoyeva rāgabandhanasaṅkhātā ",
      " maccurājassa pāsā ahaṃ parimuccituṃ asakkhiṃ, tato attānaṃ pamocesiṃ."
    ],
    "innerText": "Pakkhandoti anupaviṭṭho. Māravisayeti kilesavisaye kilesamārassa pavattiṭṭhāne, tassa vasaṃ gatoti adhippāyo. Devaputtamārassa vā issariyaṭṭhāne taṃ anupavisitvā ṭhito. Daḷhasallasamappitoti daḷhaṃ thiraṃ, daḷhena vā sallena samappito, rāgasallena hadayaṃ āhacca viddho. Asakkhiṃ maccurājassa, ahaṃ pāsā pamuccitunti aggamaggasaṇḍāsena rāgādisallaṃ anavasesato uddharantoyeva rāgabandhanasaṅkhātā maccurājassa pāsā ahaṃ parimuccituṃ asakkhiṃ, tato attānaṃ pamocesiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tato eva ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sabbe kāmā pahīnā me, bhavā sabbe padālitā"
      },
      "ti vatthārammaṇādibhedena anekabhedabhinnā ",
      " sabbe kilesakāmā ariyamaggena samucchedavasena mayā pahīnā. Kilesakāmesu hi pahīnesu vatthukāmāpi pahīnā eva honti. Tathā kāmabhavakammabhavādayo bhavā sabbe maggañāṇāsinā padālitā viddhaṃsitā. Kammabhavesu hi padālitesu upapattibhavā padālitā eva honti. Evaṃ kammabhavānaṃ padālitattā eva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vikkhīṇo jātisaṃsāro, natthi dāni punabbhavo"
      },
      "ti. Tassattho heṭṭhā vuttoyeva. Idameva ca therassa aññābyākaraṇaṃ ahosi."
    ],
    "innerText": "Tato eva ca sabbe kāmā pahīnā me, bhavā sabbe padālitāti vatthārammaṇādibhedena anekabhedabhinnā sabbe kilesakāmā ariyamaggena samucchedavasena mayā pahīnā. Kilesakāmesu hi pahīnesu vatthukāmāpi pahīnā eva honti. Tathā kāmabhavakammabhavādayo bhavā sabbe maggañāṇāsinā padālitā viddhaṃsitā. Kammabhavesu hi padālitesu upapattibhavā padālitā eva honti. Evaṃ kammabhavānaṃ padālitattā eva vikkhīṇo jātisaṃsāro, natthi dāni punabbhavoti. Tassattho heṭṭhā vuttoyeva. Idameva ca therassa aññābyākaraṇaṃ ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Uttarapālattheragāthāvaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "13. Abhibhūtattheragāthāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suṇātha"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ñātayo sabbe"
      },
      "ti āyasmato abhibhūtattherassa gāthā. Kā uppatti? Ayampi purimabuddhesu katādhikāro tattha tattha bhave puññāni upacinanto vessabhussa bhagavato kāle kulagehe nibbattitvā viññutaṃ patto tādisena kalyāṇamittasannissayena sāsane abhippasanno ahosi. So satthari parinibbute tassa dhātuṃ gahetuṃ mahājane ussāhaṃ karonte sayaṃ sabbapaṭhamaṃ gandhodakena citakaṃ nibbāpesi. So tena puññakammena devamanussesu saṃsaranto imasmiṃ buddhuppāde veṭhapuranagare rājakule nibbattitvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhibhūto"
      },
      "ti laddhanāmo pitu accayena rajjaṃ kāreti. Tasmiñca samaye bhagavā janapadacārikaṃ caranto anupubbena taṃ nagaraṃ pāpuṇi. Tato so rājā ‘‘bhagavā kira mama nagaraṃ anuppatto’’ti sutvā satthu santikaṃ gantvā dhammaṃ sutvā dutiyadivase mahādānaṃ pavattesi. Bhagavā bhuttāvī tassa rañño ajjhāsayānurūpaṃ anumodanaṃ karontoyeva vitthārato dhammaṃ desesi. So dhammaṃ sutvā laddhappasādo rajjaṃ pahāya pabbajitvā arahattaṃ sacchākāsi. Tena vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "apadāne"
      },
      " (apa. thera 2.47.11-15) –"
    ],
    "innerText": "Suṇāthañātayo sabbeti āyasmato abhibhūtattherassa gāthā. Kā uppatti? Ayampi purimabuddhesu katādhikāro tattha tattha bhave puññāni upacinanto vessabhussa bhagavato kāle kulagehe nibbattitvā viññutaṃ patto tādisena kalyāṇamittasannissayena sāsane abhippasanno ahosi. So satthari parinibbute tassa dhātuṃ gahetuṃ mahājane ussāhaṃ karonte sayaṃ sabbapaṭhamaṃ gandhodakena citakaṃ nibbāpesi. So tena puññakammena devamanussesu saṃsaranto imasmiṃ buddhuppāde veṭhapuranagare rājakule nibbattitvā abhibhūtoti laddhanāmo pitu accayena rajjaṃ kāreti. Tasmiñca samaye bhagavā janapadacārikaṃ caranto anupubbena taṃ nagaraṃ pāpuṇi. Tato so rājā ‘‘bhagavā kira mama nagaraṃ anuppatto’’ti sutvā satthu santikaṃ gantvā dhammaṃ sutvā dutiyadivase mahādānaṃ pavattesi. Bhagavā bhuttāvī tassa rañño ajjhāsayānurūpaṃ anumodanaṃ karontoyeva vitthārato dhammaṃ desesi. So dhammaṃ sutvā laddhappasādo rajjaṃ pahāya pabbajitvā arahattaṃ sacchākāsi. Tena vuttaṃ apadāne (apa. thera 2.47.11-15) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Dayhamāne ",
      " sarīramhi, vessabhussa mahesino;"
    ],
    "innerText": "‘‘Dayhamāne sarīramhi, vessabhussa mahesino;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Gandhodakaṃ gahetvāna, citaṃ nibbāpayiṃ ahaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ekatiṃse ito kappe, citaṃ nibbāpayiṃ ahaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Duggatiṃ nābhijānāmi, gandhodakassidaṃ phalaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kilesā jhāpitā mayhaṃ…pe… kataṃ buddhassa sāsana’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Arahattaṃ pana patvā vimuttisukhena viharante tasmiṃ tassa ñātakā amaccā pārisajjā nāgarā jānapadāti sabbe samāgantvā, ‘‘bhante, kasmā tvaṃ amhe anāthe katvā pabbajito’’ti parideviṃsu. Thero te ñātipamukhe manusse paridevante disvā tesaṃ attano pabbajjakāraṇavibhāvanamukhena dhammaṃ kathento –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "255"
      },
      "."
    ],
    "innerText": "255."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " ‘‘Suṇātha ",
      " ñātayo sabbe, yāvantettha samāgatā;"
    ],
    "innerText": "‘‘Suṇātha ñātayo sabbe, yāvantettha samāgatā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dhammaṃ vo desayissāmi, dukkhā jāti punappunaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "256"
      },
      "."
    ],
    "innerText": "256."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ārambhatha nikkamatha, yuñjatha buddhasāsane;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dhunātha maccuno senaṃ, naḷāgāraṃva kuñjaro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "257"
      },
      "."
    ],
    "innerText": "257."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " ‘‘Yo ",
      " imasmiṃ dhammavinaye, appamatto vihassati;"
    ],
    "innerText": "‘‘Yo imasmiṃ dhammavinaye, appamatto vihassati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pahāya jātisaṃsāraṃ, dukkhassantaṃ karissatī’’ti. – tisso gāthā abhāsi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "suṇāthā"
      },
      "ti nisāmetha, idāni mayā vuccamānaṃ ohitasotā sotadvārānusārena upadhārethāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñātayo"
      },
      "ti ñātī pamukhe katvā tesaṃ sabbesaṃ ālapanaṃ, tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sabbe yāvantettha samāgatā’’"
      },
      "ti, yāvanto yattakā ettha samāgame, etissaṃ vā mama pabbajjāya samāgatāti attho."
    ],
    "innerText": "Tattha suṇāthāti nisāmetha, idāni mayā vuccamānaṃ ohitasotā sotadvārānusārena upadhārethāti attho. Ñātayoti ñātī pamukhe katvā tesaṃ sabbesaṃ ālapanaṃ, tenāha ‘‘sabbe yāvantettha samāgatā’’ti, yāvanto yattakā ettha samāgame, etissaṃ vā mama pabbajjāya samāgatāti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni yaṃ sandhāya ‘‘suṇāthā’’ti savanāṇattikavacanaṃ kataṃ, taṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘dhammaṃ vo desayissāmī’’"
      },
      "ti paṭijānitvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘dukkhā jāti punappuna’’"
      },
      "ntiādinā desetuṃ ārabhi. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dukkhā jāti punappuna"
      },
      "nti jāti nāmesā gabbhokkantimūlakādibhedassa jarādibhedassa ca anekavihitassa dukkhassa adhiṭṭhānabhāvato dukkhā. Sā punappunaṃ pavattamānā ativiya dukkhā."
    ],
    "innerText": "Idāni yaṃ sandhāya ‘‘suṇāthā’’ti savanāṇattikavacanaṃ kataṃ, taṃ ‘‘dhammaṃ vo desayissāmī’’ti paṭijānitvā ‘‘dukkhā jāti punappuna’’ntiādinā desetuṃ ārabhi. Tattha dukkhā jāti punappunanti jāti nāmesā gabbhokkantimūlakādibhedassa jarādibhedassa ca anekavihitassa dukkhassa adhiṭṭhānabhāvato dukkhā. Sā punappunaṃ pavattamānā ativiya dukkhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tassā ",
      " pana jātiyā samatikkamanatthaṃ ussāho karaṇīyoti dassento āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ārambhathā"
      },
      "’’tiādi. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ārambhathā"
      },
      "ti ārambhadhātusaṅkhātaṃ vīriyaṃ karotha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nikkamathā"
      },
      "ti kosajjapakkhato nikkhantattā nikkamadhātusaṅkhātaṃ taduttariṃ vīriyaṃ karotha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yuñjatha buddhasāsane"
      },
      "ti yasmā sīlasaṃvaro indriyesu guttadvāratā bhojane mattaññutā satisampajaññanti imesu dhammesu patiṭṭhitānaṃ jāgariyānuyogavasena ārambhanikkamadhātuyo sampajjanti, tasmā tathābhūtā samathavipassanāsaṅkhāte adhisīlasikkhādisaṅkhāte vā bhagavato sāsane yuttappayuttā hotha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhunātha maccuno senaṃ, naḷāgāraṃva kuñjaro"
      },
      "ti evaṃ paṭipajjantā ca tedhātuissarassa maccurājassa vasaṃ satte netīti tassa senāsaṅkhātaṃ abalaṃ dubbalaṃ yathā nāma thāmabalūpapanno kuñjaro naḷehi kataṃ agāraṃ khaṇeneva viddhaṃseti, evameva kilesagaṇaṃ dhunātha vidhamatha viddhaṃsethāti attho."
    ],
    "innerText": "Tassā pana jātiyā samatikkamanatthaṃ ussāho karaṇīyoti dassento āha ‘‘ārambhathā’’tiādi. Tattha ārambhathāti ārambhadhātusaṅkhātaṃ vīriyaṃ karotha. Nikkamathāti kosajjapakkhato nikkhantattā nikkamadhātusaṅkhātaṃ taduttariṃ vīriyaṃ karotha. Yuñjatha buddhasāsaneti yasmā sīlasaṃvaro indriyesu guttadvāratā bhojane mattaññutā satisampajaññanti imesu dhammesu patiṭṭhitānaṃ jāgariyānuyogavasena ārambhanikkamadhātuyo sampajjanti, tasmā tathābhūtā samathavipassanāsaṅkhāte adhisīlasikkhādisaṅkhāte vā bhagavato sāsane yuttappayuttā hotha. Dhunātha maccuno senaṃ, naḷāgāraṃva kuñjaroti evaṃ paṭipajjantā ca tedhātuissarassa maccurājassa vasaṃ satte netīti tassa senāsaṅkhātaṃ abalaṃ dubbalaṃ yathā nāma thāmabalūpapanno kuñjaro naḷehi kataṃ agāraṃ khaṇeneva viddhaṃseti, evameva kilesagaṇaṃ dhunātha vidhamatha viddhaṃsethāti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ pana buddhasāsane ussāhaṃ karontassa ekaṃsiko jātidukkhassa samatikkamoti dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yo imasmi’’"
      },
      "ntiādinā tatiyaṃ gāthamāha. Taṃ suviññeyyameva."
    ],
    "innerText": "Evaṃ pana buddhasāsane ussāhaṃ karontassa ekaṃsiko jātidukkhassa samatikkamoti dassento ‘‘yo imasmi’’ntiādinā tatiyaṃ gāthamāha. Taṃ suviññeyyameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Abhibhūtattheragāthāvaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "14. Gotamattheragāthāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṃsara"
      },
      "nti ",
      " āyasmato gotamattherassa gāthā. Kā uppatti? Ayaṃ kira purimabuddhesu katādhikāro tattha tattha bhave puññāni karonto sikhimhi bhagavati parinibbute tassa citakaṃ devamanussesu pūjentesu aṭṭhahi campakapupphehi citakaṃ pūjesi. So tena puññakammena devamanussesu saṃsaranto imasmiṃ buddhuppāde sakyarājakule nibbattitvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gotamo"
      },
      "ti gottavaseneva abhilakkhitanāmo vayappatto satthu ñātisamāgame paṭiladdhasaddho pabbajitvā vipassanāya kammaṃ karonto chaḷabhiñño ahosi. Tena vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "apadāne"
      },
      " (apa. thera 2.47.6-10) –"
    ],
    "innerText": "Saṃsaranti āyasmato gotamattherassa gāthā. Kā uppatti? Ayaṃ kira purimabuddhesu katādhikāro tattha tattha bhave puññāni karonto sikhimhi bhagavati parinibbute tassa citakaṃ devamanussesu pūjentesu aṭṭhahi campakapupphehi citakaṃ pūjesi. So tena puññakammena devamanussesu saṃsaranto imasmiṃ buddhuppāde sakyarājakule nibbattitvā gotamoti gottavaseneva abhilakkhitanāmo vayappatto satthu ñātisamāgame paṭiladdhasaddho pabbajitvā vipassanāya kammaṃ karonto chaḷabhiñño ahosi. Tena vuttaṃ apadāne (apa. thera 2.47.6-10) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Jhāyamānassa ",
      " bhagavato, sikhino lokabandhuno;"
    ],
    "innerText": "‘‘Jhāyamānassa bhagavato, sikhino lokabandhuno;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Aṭṭha campakapupphāni, citakaṃ abhiropayiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ekatiṃse ito kappe, yaṃ pupphamabhiropayiṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Duggatiṃ nābhijānāmi, citapūjāyidaṃ phalaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kilesā jhāpitā mayhaṃ…pe… kataṃ buddhassa sāsana’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Chaḷabhiñño pana hutvā vimuttisukhena viharanto ekadivasaṃ ñātakehi ‘‘kasmā, bhante, amhe pahāya pabbajito’’ti puṭṭho saṃsāre attanā anubhūtadukkhañceva idāni adhigataṃ nibbānasukhañca pakāsento –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "258"
      },
      "."
    ],
    "innerText": "258."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Saṃsarañhi nirayaṃ agacchissaṃ, petalokamagamaṃ punappunaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dukkhamamhipi tiracchānayoniyaṃ, nekadhā hi vusitaṃ ciraṃ mayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "259"
      },
      "."
    ],
    "innerText": "259."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Mānusopi ca bhavobhirādhito, saggakāyamagamaṃ sakiṃ sakiṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Rūpadhātusu arūpadhātusu, nevasaññisu asaññisuṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "260"
      },
      "."
    ],
    "innerText": "260."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sambhavā suviditā asārakā, saṅkhatā pacalitā saderitā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Taṃ viditvā mahamahattasambhavaṃ, santimeva satimā samajjhaga’’nti. –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Tīhi gāthāhi tesaṃ dhammaṃ desesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṃsara"
      },
      "nti anādimati saṃsāre saṃsaranto kammakilesehi pañcasu gatīsu cavanupapātavasena aparāparaṃ saṃsarantoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hī"
      },
      "ti nipātamattaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nirayaṃ agacchissa"
      },
      "nti sañjīvādikaṃ aṭṭhavidhaṃ mahānirayaṃ, kukkuḷādikaṃ soḷasavidhaṃ ussadanirayañca paṭisandhivasena upagacchiṃ ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Punappuna’’"
      },
      "nti idaṃ idhāpi ānetabbaṃ ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Petaloka"
      },
      "nti pettivisayaṃ, khuppipāsādibhedaṃ petattabhāvanti ",
      " attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Agama"
      },
      "nti paṭisandhivasena upagacchiṃ upapajjiṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Punappuna"
      },
      "nti aparāparaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dukkhamamhipī"
      },
      "ti aññamaññaṃ tikhiṇakasāpatodābhighātādidukkhehi dussahāyapi. Liṅgavipallāsena hetaṃ vuttaṃ ‘‘dukkhamamhipī’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tiracchānayoniya"
      },
      "nti migapakkhiādibhedāya tiracchānayoniyaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nekadhā hī"
      },
      "ti oṭṭhagoṇagadrabhādivasena ceva kākabalākakulalādivasena ca anekappakāraṃ anekavārañca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ciraṃ"
      },
      " dīghamaddhānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mayā vusitaṃ"
      },
      " niccaṃ utrastamānasatādivasena dukkhaṃ anubhūtaṃ. Tiracchānayoniyaṃ nibbattasatto mahāmūḷhatāya cirataraṃ tattheva aparāparaṃ parivattatīti dassanatthaṃ idha ‘‘cira’’nti vuttaṃ."
    ],
    "innerText": "Tattha saṃsaranti anādimati saṃsāre saṃsaranto kammakilesehi pañcasu gatīsu cavanupapātavasena aparāparaṃ saṃsarantoti attho. Hīti nipātamattaṃ. Nirayaṃ agacchissanti sañjīvādikaṃ aṭṭhavidhaṃ mahānirayaṃ, kukkuḷādikaṃ soḷasavidhaṃ ussadanirayañca paṭisandhivasena upagacchiṃ . ‘‘Punappuna’’nti idaṃ idhāpi ānetabbaṃ . Petalokanti pettivisayaṃ, khuppipāsādibhedaṃ petattabhāvanti attho. Agamanti paṭisandhivasena upagacchiṃ upapajjiṃ. Punappunanti aparāparaṃ. Dukkhamamhipīti aññamaññaṃ tikhiṇakasāpatodābhighātādidukkhehi dussahāyapi. Liṅgavipallāsena hetaṃ vuttaṃ ‘‘dukkhamamhipī’’ti. Tiracchānayoniyanti migapakkhiādibhedāya tiracchānayoniyaṃ. Nekadhā hīti oṭṭhagoṇagadrabhādivasena ceva kākabalākakulalādivasena ca anekappakāraṃ anekavārañca ciraṃ dīghamaddhānaṃ mayā vusitaṃ niccaṃ utrastamānasatādivasena dukkhaṃ anubhūtaṃ. Tiracchānayoniyaṃ nibbattasatto mahāmūḷhatāya cirataraṃ tattheva aparāparaṃ parivattatīti dassanatthaṃ idha ‘‘cira’’nti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mānusopi ca bhavobhirādhito"
      },
      "ti manussattabhāvopi mayā tādisena kusalakammunā samavāyena abhirādhito sādhito adhigato. Kāṇakacchapopamasuttamettha (ma. ni. 3.252; saṃ. ni. 5.1117) udāharitabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saggakāyamagamaṃ sakiṃ saki"
      },
      "nti saggagatisaṅkhātaṃ kāmāvacaradevakāyaṃ sakiṃ sakiṃ kadāci kadāci upapajjanavasena agacchiṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rūpadhātusū"
      },
      "ti puthujjanabhavaggapariyosānesu rūpabhavesu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "arūpadhātusū"
      },
      "ti arūpabhavesu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nevasaññisu asaññisuṭṭhita"
      },
      "nti rūpārūpadhātūsu ca na kevalaṃ saññīsu eva, atha kho nevasaññīnāsaññīsu asaññīsu ca upapajja ṭhitaṃ mayāti ānetvā yojetabbaṃ. Nevasaññiggahaṇena hettha nevasaññīnāsaññībhavo gahito. Yadipime dve bhavā rūpārūpadhātuggahaṇeneva gayhanti, ye pana ito bāhirakā tattha niccasaññino bhavavimokkhasaññino ca, tesaṃ tassā saññāya micchābhāvadassanatthaṃ visuṃ gahitāti daṭṭhabbaṃ."
    ],
    "innerText": "Mānusopi ca bhavobhirādhitoti manussattabhāvopi mayā tādisena kusalakammunā samavāyena abhirādhito sādhito adhigato. Kāṇakacchapopamasuttamettha (ma. ni. 3.252; saṃ. ni. 5.1117) udāharitabbaṃ. Saggakāyamagamaṃ sakiṃ sakinti saggagatisaṅkhātaṃ kāmāvacaradevakāyaṃ sakiṃ sakiṃ kadāci kadāci upapajjanavasena agacchiṃ. Rūpadhātusūti puthujjanabhavaggapariyosānesu rūpabhavesu arūpadhātusūti arūpabhavesu. Nevasaññisu asaññisuṭṭhitanti rūpārūpadhātūsu ca na kevalaṃ saññīsu eva, atha kho nevasaññīnāsaññīsu asaññīsu ca upapajja ṭhitaṃ mayāti ānetvā yojetabbaṃ. Nevasaññiggahaṇena hettha nevasaññīnāsaññībhavo gahito. Yadipime dve bhavā rūpārūpadhātuggahaṇeneva gayhanti, ye pana ito bāhirakā tattha niccasaññino bhavavimokkhasaññino ca, tesaṃ tassā saññāya micchābhāvadassanatthaṃ visuṃ gahitāti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ dvīhi gāthāhi bhavamūlassa anupacchinnattā anādimati saṃsāre attano vaṭṭadukkhānubhavaṃ dassetvā idāni tadupacchedena vivaṭṭasukhānubhavaṃ dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sambhavā’’"
      },
      "tiādinā tatiyaṃ gāthamāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sambhavā"
      },
      "ti bhavā. Kāmabhavādayo eva hi hetupaccayasamavāyena bhavantīti idha sambhavāti vuttā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suviditā"
      },
      "ti vipassanāpaññāsahitāya maggapaññāya suṭṭhu viditā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asārakā"
      },
      "tiādi tesaṃ viditākāradassanaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asārakā"
      },
      "ti niccasārādisārarahitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅkhatā"
      },
      "ti samecca sambhuyya paccayehi ",
      " katā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pacalitā"
      },
      "ti saṅkhatattā eva uppādajarādīhi pakārato calitā anavaṭṭhitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saderitā"
      },
      "ti sadā sabbakālaṃ bhaṅgena eritā, ittarā bhaṅgagāmino pabhaṅgunoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃ viditvā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mahamattasambhava"
      },
      "nti taṃ yathāvuttaṃ saṅkhatasabhāvaṃ attasambhavaṃ attani sambhūtaṃ attāyattaṃ issarādivasena aparāyattaṃ pariññābhisamayavasena ahaṃ viditvā tappaṭipakkhabhūtaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "santimeva"
      },
      " nibbānameva maggapaññāsatiyā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "satimā"
      },
      " hutvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samajjhagaṃ"
      },
      " adhigacchiṃ ariyamaggabhāvanāya anuppattoti. Evaṃ thero ñātakānaṃ dhammadesanāmukhena aññaṃ byākāsi."
    ],
    "innerText": "Evaṃ dvīhi gāthāhi bhavamūlassa anupacchinnattā anādimati saṃsāre attano vaṭṭadukkhānubhavaṃ dassetvā idāni tadupacchedena vivaṭṭasukhānubhavaṃ dassento ‘‘sambhavā’’tiādinā tatiyaṃ gāthamāha. Tattha sambhavāti bhavā. Kāmabhavādayo eva hi hetupaccayasamavāyena bhavantīti idha sambhavāti vuttā. Suviditāti vipassanāpaññāsahitāya maggapaññāya suṭṭhu viditā. Asārakātiādi tesaṃ viditākāradassanaṃ. Tattha asārakāti niccasārādisārarahitā. Saṅkhatāti samecca sambhuyya paccayehi katā. Pacalitāti saṅkhatattā eva uppādajarādīhi pakārato calitā anavaṭṭhitā. Saderitāti sadā sabbakālaṃ bhaṅgena eritā, ittarā bhaṅgagāmino pabhaṅgunoti attho. Taṃ viditvāmahamattasambhavanti taṃ yathāvuttaṃ saṅkhatasabhāvaṃ attasambhavaṃ attani sambhūtaṃ attāyattaṃ issarādivasena aparāyattaṃ pariññābhisamayavasena ahaṃ viditvā tappaṭipakkhabhūtaṃ santimeva nibbānameva maggapaññāsatiyā satimā hutvā samajjhagaṃ adhigacchiṃ ariyamaggabhāvanāya anuppattoti. Evaṃ thero ñātakānaṃ dhammadesanāmukhena aññaṃ byākāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Gotamattheragāthāvaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "15. Hāritattheragāthāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yo pubbe karaṇīyānī"
      },
      "ti āyasmato hāritattherassa gāthā. Kā uppatti? Ayampi padumuttarassa bhagavato kāle kulagehe nibbattitvā viññutaṃ patto satthari parinibbute tassa citakapūjāya kayiramānāya gandhena pūjaṃ akāsi. So tena puññakammena devamanussesu saṃsaranto imasmiṃ buddhuppāde sāvatthiyaṃ brāhmaṇakule nibbattitvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hārito"
      },
      "ti laddhanāmo vayappatto jātimānaṃ nissāya aññe vasalavādena samudācarati. So bhikkhūnaṃ santikaṃ gantvā dhammaṃ sutvā paṭiladdhasaddho pabbajitopi ciraparicitattā vasalasamudācāraṃ na vissajji. Athekadivasaṃ satthu santike dhammaṃ sutvā sañjātasaṃvego vipassanaṃ paṭṭhapetvā attano cittappavattiṃ upaparikkhanto mānuddhaccaviggahitataṃ disvā taṃ pahāya vipassanaṃ ussukkāpetvā arahattaṃ pāpuṇi. Tena vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "apadāne"
      },
      " (apa. thera 2.46.63-67) –"
    ],
    "innerText": "Yo pubbe karaṇīyānīti āyasmato hāritattherassa gāthā. Kā uppatti? Ayampi padumuttarassa bhagavato kāle kulagehe nibbattitvā viññutaṃ patto satthari parinibbute tassa citakapūjāya kayiramānāya gandhena pūjaṃ akāsi. So tena puññakammena devamanussesu saṃsaranto imasmiṃ buddhuppāde sāvatthiyaṃ brāhmaṇakule nibbattitvā hāritoti laddhanāmo vayappatto jātimānaṃ nissāya aññe vasalavādena samudācarati. So bhikkhūnaṃ santikaṃ gantvā dhammaṃ sutvā paṭiladdhasaddho pabbajitopi ciraparicitattā vasalasamudācāraṃ na vissajji. Athekadivasaṃ satthu santike dhammaṃ sutvā sañjātasaṃvego vipassanaṃ paṭṭhapetvā attano cittappavattiṃ upaparikkhanto mānuddhaccaviggahitataṃ disvā taṃ pahāya vipassanaṃ ussukkāpetvā arahattaṃ pāpuṇi. Tena vuttaṃ apadāne (apa. thera 2.46.63-67) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Citāsu kurumānāsu, nānāgandhe samāhaṭe;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pasannacitto sumano, gandhamuṭṭhimapūjayiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Satasahassito kappe, citakaṃ yamapūjayiṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Duggatiṃ nābhijānāmi, citapūjāyidaṃ phalaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kilesā jhāpitā mayhaṃ…pe… kataṃ buddhassa sāsana’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Arahā ",
      " pana hutvā vimuttisukhaṃ anubhavanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yo pubbe karaṇīyānī’’"
      },
      "tiādinā tīhi gāthāhi bhikkhūnaṃ ovādadānamukhena aññaṃ byākāsi. Tāsaṃ attho heṭṭhā vuttoyeva."
    ],
    "innerText": "Arahā pana hutvā vimuttisukhaṃ anubhavanto ‘‘yo pubbe karaṇīyānī’’tiādinā tīhi gāthāhi bhikkhūnaṃ ovādadānamukhena aññaṃ byākāsi. Tāsaṃ attho heṭṭhā vuttoyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Hāritattheragāthāvaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "16. Vimalattheragāthāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāpamitte"
      },
      "ti ",
      " āyasmato vimalattherassa gāthā. Kā uppatti? Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayaṃ puññaṃ upacinanto padumuttarassa bhagavato kāle kulagehe nibbattitvā viññutaṃ patto satthari parinibbute sādhukīḷanadivasesu vītivattesu satthu sarīraṃ gahetvā upāsakesu jhāpanaṭṭhānaṃ gacchantesu satthu guṇe āvajjitvā pasannamānaso sumanapupphehi pūjamakāsi. So tena puññakammena devamanussesu saṃsaranto imasmiṃ buddhuppāde bārāṇasiyaṃ brāhmaṇakule nibbattitvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vimalo"
      },
      "ti laddhanāmo vayappatto somamittattheraṃ nissāya sāsane pabbajitvā teneva ussāhito vipassanaṃ paṭṭhapetvā nacirasseva arahattaṃ pāpuṇi. Tena vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "apadāne"
      },
      " (apa. thera 2.46.58-62) –"
    ],
    "innerText": "Pāpamitteti āyasmato vimalattherassa gāthā. Kā uppatti? Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayaṃ puññaṃ upacinanto padumuttarassa bhagavato kāle kulagehe nibbattitvā viññutaṃ patto satthari parinibbute sādhukīḷanadivasesu vītivattesu satthu sarīraṃ gahetvā upāsakesu jhāpanaṭṭhānaṃ gacchantesu satthu guṇe āvajjitvā pasannamānaso sumanapupphehi pūjamakāsi. So tena puññakammena devamanussesu saṃsaranto imasmiṃ buddhuppāde bārāṇasiyaṃ brāhmaṇakule nibbattitvā vimaloti laddhanāmo vayappatto somamittattheraṃ nissāya sāsane pabbajitvā teneva ussāhito vipassanaṃ paṭṭhapetvā nacirasseva arahattaṃ pāpuṇi. Tena vuttaṃ apadāne (apa. thera 2.46.58-62) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Nīharante sarīramhi, vajjamānāsu bherisu;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pasannacitto sumano, paṭṭipupphamapūjayiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Satasahassito kappe, yaṃ pupphamabhipūjayiṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Duggatiṃ nābhijānāmi, dehapūjāyidaṃ phalaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kilesā jhāpitā mayhaṃ…pe… kataṃ buddhassa sāsana’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Arahattaṃ pana patvā attano sahāyassa bhikkhussa ovādaṃ dento –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "264"
      },
      "."
    ],
    "innerText": "264."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Pāpamitte vivajjetvā, bhajeyyuttamapuggalaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ovāde cassa tiṭṭheyya, patthento acalaṃ sukhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "265"
      },
      "."
    ],
    "innerText": "265."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " ‘‘Parittaṃ ",
      " dārumāruyha, yathā sīde mahaṇṇave;"
    ],
    "innerText": "‘‘Parittaṃ dārumāruyha, yathā sīde mahaṇṇave;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Evaṃ kusītamāgamma, sādhujīvīpi sīdati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tasmā taṃ parivajjeyya, kusītaṃ hīnavīriyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "266"
      },
      "."
    ],
    "innerText": "266."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Pavivittehi ariyehi, pahitattehi jhāyibhi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Niccaṃ āraddhavīriyehi, paṇḍitehi sahāvase’’ti. –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Tisso gāthā abhāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pāpamitte"
      },
      "ti akalyāṇamitte asappurise hīnavīriye. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vivajjetvā"
      },
      "ti taṃ abhajanavasena dūrato vajjetvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhajeyyuttamapuggala"
      },
      "nti sappurisaṃ paṇḍitaṃ kalyāṇamittaṃ ovādānusāsanīgahaṇavasena ",
      " seveyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ovāde cassa tiṭṭheyyā"
      },
      "ti assa kalyāṇamittassa ovāde anusiṭṭhiyaṃ yathānusiṭṭhaṃ paṭipajjanavasena tiṭṭheyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Patthento"
      },
      "ti ākaṅkhanto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Acalaṃ sukha"
      },
      "nti nibbānasukhaṃ phalasukhañca. Tampi hi akuppabhāvato ‘‘acala’’nti vuccati. Sesaṃ vuttatthameva."
    ],
    "innerText": "Tattha pāpamitteti akalyāṇamitte asappurise hīnavīriye. Vivajjetvāti taṃ abhajanavasena dūrato vajjetvā. Bhajeyyuttamapuggalanti sappurisaṃ paṇḍitaṃ kalyāṇamittaṃ ovādānusāsanīgahaṇavasena seveyya. Ovāde cassa tiṭṭheyyāti assa kalyāṇamittassa ovāde anusiṭṭhiyaṃ yathānusiṭṭhaṃ paṭipajjanavasena tiṭṭheyya. Patthentoti ākaṅkhanto. Acalaṃ sukhanti nibbānasukhaṃ phalasukhañca. Tampi hi akuppabhāvato ‘‘acala’’nti vuccati. Sesaṃ vuttatthameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vimalattheragāthāvaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tikanipātavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṭhamo bhāgo niṭṭhito."
  }
]