[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "4. Catukkanipāto"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Brāhmaṇadhammayāgasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "100"
      },
      ". Catukkanipātassa ",
      " paṭhame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aha"
      },
      "nti attaniddeso. Yo hi paro na hoti, so niyakajjhattasaṅkhāto attā ‘‘aha’’nti vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asmī"
      },
      "ti paṭijānanā. Yo paramatthabrāhmaṇabhāvo ‘‘aha’’nti vuccamāno, tassa attani atthibhāvaṃ paṭijānanto hi satthā ‘‘asmī’’ti avoca. ‘‘Ahamasmī’’ti ca yathā ‘‘ahamasmi brahmā mahābrahmā, seyyohamasmī’’ti ca appahīnadiṭṭhimānānusayā puthujjanā attano diṭṭhimānamaññanābhinivesavasena abhivadanti, na evaṃ vuttaṃ. Sabbaso pana pahīnadiṭṭhimānānusayo bhagavā samaññaṃ anatidhāvanto lokasamaññānurodhena veneyyasantānesu dhammaṃ patiṭṭhapento kevalaṃ tādisassa guṇassa attani vijjamānataṃ paṭijānanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ahamasmī’’"
      },
      "ti āha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Brāhmaṇo"
      },
      "ti bāhitapāpattā brahmassa ca aṇanato brāhmaṇo. Ayañhettha attho – bhikkhave, ahaṃ paramatthato brāhmaṇosmīti. Bhagavā sabbākāraparipuṇṇassa dānasaṃyamādivatasamādānassa niravasesāya tapacariyāya pāraṃ gato sammadeva vusitabrahmacariyavāso sakalavedantagū suvisuddhavijjācaraṇo sabbathā ninhātapāpamalo anuttarassa ariyamaggasaṅkhātassa brāhmaṇassa vattā pavattā, suparisuddhassa ca sāsanabrahmacariyassa pavedetā, tasmā sabbaso bāhitapāpattā brahmassa ca aṇanato kathanato paramatthena brāhmaṇoti vuccati."
    ],
    "innerText": "100. Catukkanipātassa paṭhame ahanti attaniddeso. Yo hi paro na hoti, so niyakajjhattasaṅkhāto attā ‘‘aha’’nti vuccati. Asmīti paṭijānanā. Yo paramatthabrāhmaṇabhāvo ‘‘aha’’nti vuccamāno, tassa attani atthibhāvaṃ paṭijānanto hi satthā ‘‘asmī’’ti avoca. ‘‘Ahamasmī’’ti ca yathā ‘‘ahamasmi brahmā mahābrahmā, seyyohamasmī’’ti ca appahīnadiṭṭhimānānusayā puthujjanā attano diṭṭhimānamaññanābhinivesavasena abhivadanti, na evaṃ vuttaṃ. Sabbaso pana pahīnadiṭṭhimānānusayo bhagavā samaññaṃ anatidhāvanto lokasamaññānurodhena veneyyasantānesu dhammaṃ patiṭṭhapento kevalaṃ tādisassa guṇassa attani vijjamānataṃ paṭijānanto ‘‘ahamasmī’’ti āha. Brāhmaṇoti bāhitapāpattā brahmassa ca aṇanato brāhmaṇo. Ayañhettha attho – bhikkhave, ahaṃ paramatthato brāhmaṇosmīti. Bhagavā sabbākāraparipuṇṇassa dānasaṃyamādivatasamādānassa niravasesāya tapacariyāya pāraṃ gato sammadeva vusitabrahmacariyavāso sakalavedantagū suvisuddhavijjācaraṇo sabbathā ninhātapāpamalo anuttarassa ariyamaggasaṅkhātassa brāhmaṇassa vattā pavattā, suparisuddhassa ca sāsanabrahmacariyassa pavedetā, tasmā sabbaso bāhitapāpattā brahmassa ca aṇanato kathanato paramatthena brāhmaṇoti vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Iti bhagavā sadevake loke attano anuttaraṃ brāhmaṇabhāvaṃ pavedetvā yāni tāni brāhmaṇadānādīni cha kammāni brāhmaṇassa paññāpenti, tesampi suparisuddhānaṃ ukkaṃsato attani saṃvijjamānataṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yācayogo’’"
      },
      "tiādimāha."
    ],
    "innerText": "Iti bhagavā sadevake loke attano anuttaraṃ brāhmaṇabhāvaṃ pavedetvā yāni tāni brāhmaṇadānādīni cha kammāni brāhmaṇassa paññāpenti, tesampi suparisuddhānaṃ ukkaṃsato attani saṃvijjamānataṃ dassetuṃ ‘‘yācayogo’’tiādimāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yācayogo"
      },
      "ti yācehi yutto. Yācantīti yācā, yācakā ",
      ", te panettha veneyyā veditabbā. Te hi ‘‘desetu, bhante bhagavā ",
      ", dhammaṃ; desetu, sugato, dhamma’’nti bhagavantaṃ upasaṅkamitvā dhammadesanaṃ yācanti. Bhagavā ca tesaṃ icchāvighātaṃ akaronto yathāruci dhammaṃ desento ",
      " dhammadānaṃ detīti yācayogo, sadā sabbakālaṃ tehi avirahito. Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yācayogo"
      },
      "ti yācanayoggo, adhippāyapūraṇato yācituṃ yuttoti attho ‘‘yājayogo’’tipi pāṭho. Tattha yājo vuccati mahādānaṃ, yiṭṭhanti attho. Idha pana dhammadānaṃ veditabbaṃ, yāje niyuttoti yājayogā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sadā"
      },
      "ti sabbadā, anavaratappavattasaddhammamahādānoti attho. Atha vā yājena yojetītipi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yājayogo"
      },
      ". Tividhadānasaṅkhātena yājena satte yathārahaṃ yojeti, tattha dāne niyojetīti attho. ‘‘Yājayogo satata’’ntipi paṭhanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Payatapāṇī"
      },
      "ti parisuddhahattho. Yo hi dānādhimutto āmisadānaṃ dento sakkaccaṃ sahatthena deyyadhammaṃ dātuṃ sadā dhotahatthoyeva hoti, so ‘‘payatapāṇī’’ti vuccati. Bhagavāpi dhammadānādhimutto sakkaccaṃ sabbakālaṃ dhammadāne yuttappayuttoti katvā vuttaṃ ‘‘payatapāṇī’’ti. ‘‘Sadā’’ti ca padaṃ imināpi saddhiṃ yojetabbaṃ ‘‘sadā payatapāṇī’’ti. Avibhāgena hi satthā veneyyalokassa saddhammadānaṃ sadā sabbakālaṃ pavattento tattha yuttappayutto hutvā viharati."
    ],
    "innerText": "Tattha yācayogoti yācehi yutto. Yācantīti yācā, yācakā , te panettha veneyyā veditabbā. Te hi ‘‘desetu, bhante bhagavā , dhammaṃ; desetu, sugato, dhamma’’nti bhagavantaṃ upasaṅkamitvā dhammadesanaṃ yācanti. Bhagavā ca tesaṃ icchāvighātaṃ akaronto yathāruci dhammaṃ desento dhammadānaṃ detīti yācayogo, sadā sabbakālaṃ tehi avirahito. Atha vā yācayogoti yācanayoggo, adhippāyapūraṇato yācituṃ yuttoti attho ‘‘yājayogo’’tipi pāṭho. Tattha yājo vuccati mahādānaṃ, yiṭṭhanti attho. Idha pana dhammadānaṃ veditabbaṃ, yāje niyuttoti yājayogā. Sadāti sabbadā, anavaratappavattasaddhammamahādānoti attho. Atha vā yājena yojetītipi yājayogo. Tividhadānasaṅkhātena yājena satte yathārahaṃ yojeti, tattha dāne niyojetīti attho. ‘‘Yājayogo satata’’ntipi paṭhanti. Payatapāṇīti parisuddhahattho. Yo hi dānādhimutto āmisadānaṃ dento sakkaccaṃ sahatthena deyyadhammaṃ dātuṃ sadā dhotahatthoyeva hoti, so ‘‘payatapāṇī’’ti vuccati. Bhagavāpi dhammadānādhimutto sakkaccaṃ sabbakālaṃ dhammadāne yuttappayuttoti katvā vuttaṃ ‘‘payatapāṇī’’ti. ‘‘Sadā’’ti ca padaṃ imināpi saddhiṃ yojetabbaṃ ‘‘sadā payatapāṇī’’ti. Avibhāgena hi satthā veneyyalokassa saddhammadānaṃ sadā sabbakālaṃ pavattento tattha yuttappayutto hutvā viharati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aparo nayo – yogo vuccati bhāvanā. Yathāha ‘‘yogā ve jāyate bhūrī’’ti (dha. pa. 282). Tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yājayogo"
      },
      "ti yājabhāvanaṃ, pariccāgabhāvanaṃ anuyuttoti attho. Bhagavā hi abhisambodhito pubbe bodhisattabhūtopi karuṇāsamussāhito anavasesato dānaṃ paribrūhento tattha ukkaṃsapāramippatto hutvā abhisambodhiṃ pāpuṇi, buddho hutvāpi tividhaṃ dānaṃ paribrūhesi visesato dhammadānaṃ, parepi tattha niyojesi. Tathā hi so veneyyayācakānaṃ kassaci saraṇāni adāsi, kassaci pañca sīlāni, kassaci dasa sīlāni, kassaci catupārisuddhisīlaṃ, kassaci dhutadhamme, kassaci cattāri jhānāni, kassaci aṭṭha samāpattiyo, kassaci pañcābhiññāyo, cattāro magge, cattāri ",
      " sāmaññaphalāni, tisso vijjā, catasso paṭisambhidāti evamādilokiyalokuttarabhedaṃ guṇadhanaṃ dhammadānavasena yathādhippāyaṃ dento pare ca ‘‘dethā’’ti niyojento pariccāgabhāvanaṃ paribrūhesi. Tena vuttaṃ ‘‘pariccāgabhāvanaṃ anuyutto’’ti."
    ],
    "innerText": "Aparo nayo – yogo vuccati bhāvanā. Yathāha ‘‘yogā ve jāyate bhūrī’’ti (dha. pa. 282). Tasmā yājayogoti yājabhāvanaṃ, pariccāgabhāvanaṃ anuyuttoti attho. Bhagavā hi abhisambodhito pubbe bodhisattabhūtopi karuṇāsamussāhito anavasesato dānaṃ paribrūhento tattha ukkaṃsapāramippatto hutvā abhisambodhiṃ pāpuṇi, buddho hutvāpi tividhaṃ dānaṃ paribrūhesi visesato dhammadānaṃ, parepi tattha niyojesi. Tathā hi so veneyyayācakānaṃ kassaci saraṇāni adāsi, kassaci pañca sīlāni, kassaci dasa sīlāni, kassaci catupārisuddhisīlaṃ, kassaci dhutadhamme, kassaci cattāri jhānāni, kassaci aṭṭha samāpattiyo, kassaci pañcābhiññāyo, cattāro magge, cattāri sāmaññaphalāni, tisso vijjā, catasso paṭisambhidāti evamādilokiyalokuttarabhedaṃ guṇadhanaṃ dhammadānavasena yathādhippāyaṃ dento pare ca ‘‘dethā’’ti niyojento pariccāgabhāvanaṃ paribrūhesi. Tena vuttaṃ ‘‘pariccāgabhāvanaṃ anuyutto’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Payatapāṇī"
      },
      "ti ",
      " vā āyatapāṇī, hatthagataṃ kiñci dātuṃ ‘‘ehi gaṇhā’’ti pasāritahattho viya ācariyamuṭṭhiṃ akatvā saddhammadāne yuttappayuttoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Payatapāṇī"
      },
      "ti vā ussāhitahattho, āmisadānaṃ dātuṃ ussāhitahattho viya dhammadāne katussāhoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Antimadehadharo"
      },
      "ti brahmacariyavasena brāhmaṇakaraṇānaṃ dhammānaṃ pāripūriyā pacchimattabhāvadhārī. Avusitavato hi vasalakaraṇānaṃ dhammānaṃ appahānena vasalādisamaññā gati āyatiṃ gabbhaseyyā siyā. Tena bhagavā attano accantavusitabrāhmaṇabhāvaṃ dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anuttaro bhisakko"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sallakatto"
      },
      "ti duttikicchassa vaṭṭadukkharogassa tikicchanato uttamo bhisakko, aññehi anuddharaṇīyānaṃ rāgādisallānaṃ kantanato samucchedavasena samuddharaṇato uttamo sallakantanavejjo. Iminā nippariyāyato brāhmaṇakaraṇānaṃ dhammānaṃ attani patiṭṭhitānaṃ parasantatiyaṃ patiṭṭhāpanena paresampi brāhmaṇakaraṇamāha."
    ],
    "innerText": "Payatapāṇīti vā āyatapāṇī, hatthagataṃ kiñci dātuṃ ‘‘ehi gaṇhā’’ti pasāritahattho viya ācariyamuṭṭhiṃ akatvā saddhammadāne yuttappayuttoti attho. Payatapāṇīti vā ussāhitahattho, āmisadānaṃ dātuṃ ussāhitahattho viya dhammadāne katussāhoti attho. Antimadehadharoti brahmacariyavasena brāhmaṇakaraṇānaṃ dhammānaṃ pāripūriyā pacchimattabhāvadhārī. Avusitavato hi vasalakaraṇānaṃ dhammānaṃ appahānena vasalādisamaññā gati āyatiṃ gabbhaseyyā siyā. Tena bhagavā attano accantavusitabrāhmaṇabhāvaṃ dasseti. Anuttaro bhisakkosallakattoti duttikicchassa vaṭṭadukkharogassa tikicchanato uttamo bhisakko, aññehi anuddharaṇīyānaṃ rāgādisallānaṃ kantanato samucchedavasena samuddharaṇato uttamo sallakantanavejjo. Iminā nippariyāyato brāhmaṇakaraṇānaṃ dhammānaṃ attani patiṭṭhitānaṃ parasantatiyaṃ patiṭṭhāpanena paresampi brāhmaṇakaraṇamāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tassa me tumhe puttā"
      },
      "ti tassa evarūpassa mama tumhe, bhikkhave, puttā atrajā hotha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Orasā"
      },
      "ti urasi sambandhā. Yathā hi sattānaṃ orasaputtā atrajā visesena pitusantakassa dāyajjassa bhāgino honti, evametepi ariyapuggalā sammāsambuddhassa dhammassavanante ariyāya jātiyā jātā. Tassa santakassa vimuttisukhassa ariyadhammaratanassa ca ekaṃsabhāgiyatāya orasā. Atha vā bhagavato dhammadesanānubhāvena ariyabhūmiṃ okkamamānā okkantā ca ariyasāvakā satthu ure vāyāmajanitābhijātitāya nippariyāyena ‘‘orasaputtā’’ti vattabbataṃ arahanti. Tathā hi te bhagavatā āsayānusayacariyādhimuttiādivolokanena vajjānucintanena ca hadaye katvā vajjato nivāretvā anavajje patiṭṭhapentena sīlādidhammasarīraposanena saṃvaḍḍhitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mukhato jātā"
      },
      "ti mukhato jātāya dhammadesanāya ariyāya jātiyā ",
      " jātattā mukhato jātā. Atha vā anaññasādhāraṇato sabbassa kusaladhammassa mukhato pātimokkhato vuṭṭhānagāminivipassanāsaṅkhātato vimokkhamukhato vā ariyamaggajātiyā jātātipi mukhato jātā. Sikkhattayasaṅgahe sāsanadhamme ariyamaggadhamme vā jātāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammajā"
      },
      ". Teneva dhammena nimmitā māpitāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammanimmitā"
      },
      ". Satidhammavicayādi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammadāyādā,"
      },
      " na lābhasakkārādi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āmisadāyādā,"
      },
      " dhammadāyādā no āmisadāyādā hothāti attho."
    ],
    "innerText": "Tassa me tumhe puttāti tassa evarūpassa mama tumhe, bhikkhave, puttā atrajā hotha. Orasāti urasi sambandhā. Yathā hi sattānaṃ orasaputtā atrajā visesena pitusantakassa dāyajjassa bhāgino honti, evametepi ariyapuggalā sammāsambuddhassa dhammassavanante ariyāya jātiyā jātā. Tassa santakassa vimuttisukhassa ariyadhammaratanassa ca ekaṃsabhāgiyatāya orasā. Atha vā bhagavato dhammadesanānubhāvena ariyabhūmiṃ okkamamānā okkantā ca ariyasāvakā satthu ure vāyāmajanitābhijātitāya nippariyāyena ‘‘orasaputtā’’ti vattabbataṃ arahanti. Tathā hi te bhagavatā āsayānusayacariyādhimuttiādivolokanena vajjānucintanena ca hadaye katvā vajjato nivāretvā anavajje patiṭṭhapentena sīlādidhammasarīraposanena saṃvaḍḍhitā. Mukhato jātāti mukhato jātāya dhammadesanāya ariyāya jātiyā jātattā mukhato jātā. Atha vā anaññasādhāraṇato sabbassa kusaladhammassa mukhato pātimokkhato vuṭṭhānagāminivipassanāsaṅkhātato vimokkhamukhato vā ariyamaggajātiyā jātātipi mukhato jātā. Sikkhattayasaṅgahe sāsanadhamme ariyamaggadhamme vā jātāti dhammajā. Teneva dhammena nimmitā māpitāti dhammanimmitā. Satidhammavicayādi dhammadāyādā, na lābhasakkārādi āmisadāyādā, dhammadāyādā no āmisadāyādā hothāti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha dhammo duvidho – nippariyāyadhammo, pariyāyadhammoti. Āmisampi duvidhaṃ – nippariyāyāmisaṃ, pariyāyāmisanti. Kathaṃ? Maggaphalanibbānappabhedo hi navavidho lokuttaradhammo nippariyāyadhammo, nibbattitadhammoyeva, na kenaci pariyāyena kāraṇena vā lesena vā dhammo. Yaṃ panidaṃ vivaṭṭūpanissitaṃ kusalaṃ, seyyathidaṃ – idhekacco vivaṭṭaṃ patthento dānaṃ deti, sīlaṃ samādiyati, uposathakammaṃ karoti, gandhamālādīhi vatthupūjaṃ karoti, dhammaṃ suṇāti, deseti, jhānasamāpattiyo nibbatteti, evaṃ karonto anupubbena nippariyāyaṃ amataṃ nibbānaṃ paṭilabhati, ayaṃ pariyāyadhammo. Tathā cīvarādayo cattāro paccayā nippariyāyāmisameva, na aññena pariyāyena vā kāraṇena vā lesena vā āmisaṃ. Yaṃ panidaṃ vaṭṭagāmikusalaṃ, seyyathidaṃ – idhekacco vaṭṭaṃ patthento sampattibhavaṃ icchamāno dānaṃ deti…pe… samāpattiyo nibbatteti, evaṃ karonto anupubbena devamanussasampattiyo paṭilabhati, idaṃ pariyāyāmisaṃ nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      " nippariyāyadhammopi bhagavatoyeva santako. Bhagavatā hi kathitattā bhikkhū maggaphalanibbānāni adhigacchanti. Vuttañhetaṃ –"
    ],
    "innerText": "Tattha nippariyāyadhammopi bhagavatoyeva santako. Bhagavatā hi kathitattā bhikkhū maggaphalanibbānāni adhigacchanti. Vuttañhetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘So, hi, brāhmaṇa, bhagavā anuppannassa maggassa uppādetā, asañjātassa maggassa sañjanetā…pe… maggānugā ca panetarahi sāvakā viharanti pacchā samannāgatā’’ti (ma. ni. 3.79; cūlani. mogharājamāṇavapucchāniddesa 85)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘So, hāvuso, bhagavā jānaṃ jānāti, passaṃ passati, cakkhubhūto ñāṇabhūto dhammabhūto brahmabhūto, vattā pavattā, atthassa ninnetā ",
      ", amatassa dātā, dhammassāmī tathāgato’’ti (ma. ni. 1.203; 3.281) ca."
    ],
    "innerText": "‘‘So, hāvuso, bhagavā jānaṃ jānāti, passaṃ passati, cakkhubhūto ñāṇabhūto dhammabhūto brahmabhūto, vattā pavattā, atthassa ninnetā , amatassa dātā, dhammassāmī tathāgato’’ti (ma. ni. 1.203; 3.281) ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pariyāyadhammopi bhagavatoyeva santako. Bhagavatā hi kathitattā eva jānanti ‘‘vivaṭṭaṃ patthetvā dānaṃ dento…pe… samāpattiyo nibbattento anukkamena amataṃ nibbānaṃ paṭilabhatī’’ti. Nippariyāyāmisampi bhagavatoyeva ",
      " santakaṃ. Bhagavatā hi anuññātattāyeva bhikkhūhi jīvakavatthuṃ ādiṃ katvā paṇītacīvaraṃ laddhaṃ. Yathāha –"
    ],
    "innerText": "Pariyāyadhammopi bhagavatoyeva santako. Bhagavatā hi kathitattā eva jānanti ‘‘vivaṭṭaṃ patthetvā dānaṃ dento…pe… samāpattiyo nibbattento anukkamena amataṃ nibbānaṃ paṭilabhatī’’ti. Nippariyāyāmisampi bhagavatoyeva santakaṃ. Bhagavatā hi anuññātattāyeva bhikkhūhi jīvakavatthuṃ ādiṃ katvā paṇītacīvaraṃ laddhaṃ. Yathāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Anujānāmi, bhikkhave, gahapaticīvaraṃ. Yo icchati, paṃsukūliko hotu. Yo icchati, gahapaticīvaraṃ sādiyatu. Itarītarenapāhaṃ, bhikkhave, santuṭṭhiṃyeva vaṇṇemī’’ti (mahāva. 337)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ itarepi paccayā bhagavatā anuññātattā eva bhikkhūhi paribhuñjituṃ laddhā. Pariyāyāmisampi bhagavatoyeva santakaṃ. Bhagavatā hi kathitattā eva jānanti ‘‘sampattibhavaṃ patthento dānaṃ datvā sīlaṃ…pe… samāpattiyo nibbattetvā anukkamena pariyāyāmisaṃ dibbasampattiṃ manussasampattiñca paṭilabhatī’’ti. Yadeva yasmā nippariyāyadhammopi pariyāyadhammopi nippariyāyāmisampi pariyāyāmisampi bhagavatoyeva santakaṃ, tasmā tattha attano sāmibhāvaṃ dassento tattha ca yaṃ seṭṭhataraṃ accantahitasukhāvahaṃ tattheva ne niyojento evamāha ‘‘tassa me tumhe puttā orasā…pe… no āmisadāyādā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Iti bhagavā paripuṇṇavatasamādānaṃ tapacariyaṃ sammadeva vusitabrahmacariyaṃ suvisuddhavijjācaraṇasampannaṃ anavasesavedantapāraguṃ bāhitasabbapāpaṃ satataṃ yācayogaṃ sadevake loke ",
      " anuttaradakkhiṇeyyabhāvappattaṃ attano paramatthabrāhmaṇabhāvaṃ ariyasāvakānañca attano orasaputtādibhāvaṃ pavedesi. Bhagavā hi ‘‘sīhoti kho, bhikkhave, tathāgatassetaṃ adhivacanaṃ arahato sammāsambuddhassā’’ti (a. ni. 5.99) ettha sīhasadisaṃ, ‘‘puriso maggakusaloti kho, tissa, tathāgatassetaṃ adhivacana’’nti (saṃ. ni. 3.84) ettha maggadesakapurisasadisaṃ, ‘‘rājāhamasmi ",
      " selā’’ti (ma. ni. 2.399; su. ni. 559) ettha rājasadisaṃ, ‘‘bhisakko sallakattoti kho, sunakkhatta, tathāgatassetaṃ adhivacana’’nti (ma. ni. 3.65) ettha vejjasadisaṃ, ‘‘brāhmaṇoti kho, bhikkhave, tathāgatassetaṃ adhivacana’’nti (a. ni. 8.85) ettha brāhmaṇasadisaṃ attānaṃ kathesi. Idhāpi brāhmaṇa sadisaṃ katvā kathesi."
    ],
    "innerText": "Iti bhagavā paripuṇṇavatasamādānaṃ tapacariyaṃ sammadeva vusitabrahmacariyaṃ suvisuddhavijjācaraṇasampannaṃ anavasesavedantapāraguṃ bāhitasabbapāpaṃ satataṃ yācayogaṃ sadevake loke anuttaradakkhiṇeyyabhāvappattaṃ attano paramatthabrāhmaṇabhāvaṃ ariyasāvakānañca attano orasaputtādibhāvaṃ pavedesi. Bhagavā hi ‘‘sīhoti kho, bhikkhave, tathāgatassetaṃ adhivacanaṃ arahato sammāsambuddhassā’’ti (a. ni. 5.99) ettha sīhasadisaṃ, ‘‘puriso maggakusaloti kho, tissa, tathāgatassetaṃ adhivacana’’nti (saṃ. ni. 3.84) ettha maggadesakapurisasadisaṃ, ‘‘rājāhamasmi selā’’ti (ma. ni. 2.399; su. ni. 559) ettha rājasadisaṃ, ‘‘bhisakko sallakattoti kho, sunakkhatta, tathāgatassetaṃ adhivacana’’nti (ma. ni. 3.65) ettha vejjasadisaṃ, ‘‘brāhmaṇoti kho, bhikkhave, tathāgatassetaṃ adhivacana’’nti (a. ni. 8.85) ettha brāhmaṇasadisaṃ attānaṃ kathesi. Idhāpi brāhmaṇa sadisaṃ katvā kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni yehi dānādīhi yuttassa ito bāhirakabrāhmaṇassa brāhmaṇakiccaṃ paripuṇṇaṃ maññanti, tehi attano dānādīnaṃ aggaseṭṭhabhāvaṃ pakāsetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘dvemāni, bhikkhave, dānānī’’"
      },
      "tiādi āraddhaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yāgā"
      },
      "ti mahāyaññā ",
      ", mahādānānīti attho, yāni ‘‘yiṭṭhānī’’tipi vuccanti. Tattha velāmadānavessantaradānamahāvijitayaññasadisā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āmisayāgā"
      },
      " veditabbā, mahāsamayasuttamaṅgalasuttacūḷarāhulovādasuttasamacittasuttadesanādayo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammayāgā"
      },
      ". Sesaṃ heṭṭhā vuttanayameva."
    ],
    "innerText": "Idāni yehi dānādīhi yuttassa ito bāhirakabrāhmaṇassa brāhmaṇakiccaṃ paripuṇṇaṃ maññanti, tehi attano dānādīnaṃ aggaseṭṭhabhāvaṃ pakāsetuṃ ‘‘dvemāni, bhikkhave, dānānī’’tiādi āraddhaṃ. Tattha yāgāti mahāyaññā , mahādānānīti attho, yāni ‘‘yiṭṭhānī’’tipi vuccanti. Tattha velāmadānavessantaradānamahāvijitayaññasadisā āmisayāgā veditabbā, mahāsamayasuttamaṅgalasuttacūḷarāhulovādasuttasamacittasuttadesanādayo dhammayāgā. Sesaṃ heṭṭhā vuttanayameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Gāthāyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ayajī"
      },
      "ti adāsi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Amaccharī"
      },
      "ti sabbamacchariyānaṃ bodhimūleyeva suppahīnattā maccherarahito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbabhūtānukampī"
      },
      "ti mahākaruṇāya sabbasatte piyaputtaṃ viya anuggaṇhanasīlo. Vuttañhetaṃ –"
    ],
    "innerText": "Gāthāyaṃ ayajīti adāsi. Amaccharīti sabbamacchariyānaṃ bodhimūleyeva suppahīnattā maccherarahito. Sabbabhūtānukampīti mahākaruṇāya sabbasatte piyaputtaṃ viya anuggaṇhanasīlo. Vuttañhetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Vadhake devadatte ca, core aṅgulimālake;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dhanapāle rāhule ceva, samacitto mahāmunī’’ti. (mi. pa. 6.6.5) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Sesaṃ suviññeyyameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṭhamasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Sulabhasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "101"
      },
      ". Dutiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "appānī"
      },
      "ti parittāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sulabhānī"
      },
      "ti sukhena laddhabbāni, yattha katthaci vā sakkā hoti laddhuṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anavajjānī"
      },
      "ti vajjarahitāni niddosāni āgamanasuddhito kāyamaṇḍanādikilesavatthubhāvābhāvato ca. Tattha sulabhatāya pariyesanadukkhassa abhāvo dassito, appatāya pariharaṇadukkhassapi ",
      " abhāvo dassito, anavajjatāya agarahitabbatāya bhikkhusāruppabhāvo dassito hoti. Appatāya vā parittāsassa avatthutā, sulabhatāya gedhāya avatthutā, anavajjatāya ādīnavavasena nissaraṇapaññāya vatthutā dassitā hoti. Appatāya vā lābhena na somanassaṃ janayanti, sulabhatāya alābhena na domanassaṃ janayanti, anavajjatāya vippaṭisāranimittaṃ aññāṇupekkhaṃ na janayanti avippaṭisāravatthubhāvato."
    ],
    "innerText": "101. Dutiye appānīti parittāni. Sulabhānīti sukhena laddhabbāni, yattha katthaci vā sakkā hoti laddhuṃ. Anavajjānīti vajjarahitāni niddosāni āgamanasuddhito kāyamaṇḍanādikilesavatthubhāvābhāvato ca. Tattha sulabhatāya pariyesanadukkhassa abhāvo dassito, appatāya pariharaṇadukkhassapi abhāvo dassito, anavajjatāya agarahitabbatāya bhikkhusāruppabhāvo dassito hoti. Appatāya vā parittāsassa avatthutā, sulabhatāya gedhāya avatthutā, anavajjatāya ādīnavavasena nissaraṇapaññāya vatthutā dassitā hoti. Appatāya vā lābhena na somanassaṃ janayanti, sulabhatāya alābhena na domanassaṃ janayanti, anavajjatāya vippaṭisāranimittaṃ aññāṇupekkhaṃ na janayanti avippaṭisāravatthubhāvato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṃsukūla"
      },
      "nti rathikāsusānasaṅkārakūṭādīsu yattha katthaci paṃsūnaṃ upari ṭhitattā abbhuggataṭṭhena paṃsukūlaṃ viyāti paṃsukūlaṃ, paṃsu viya kucchitabhāvaṃ ulati gacchatīti paṃsukūlanti evaṃ laddhanāmaṃ rathikādīsu patitanantakāni uccinitvā katacīvaraṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Piṇḍiyālopo"
      },
      "ti jaṅghapiṇḍiyā balena ",
      " caritvā ghare ghare ālopamattaṃ katvā laddhabhojanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rukkhamūla"
      },
      "nti vivekānurūpaṃ yaṃkiñci rukkhasamīpaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pūtimutta"
      },
      "nti yaṃkiñci gomuttaṃ. Yathā hi suvaṇṇavaṇṇopi kāyo pūtikāyova evaṃ abhinavampi muttaṃ pūtimuttameva. Tattha keci gomuttabhāvitaṃ haritakīkhaṇḍaṃ ‘‘pūtimutta’’nti vadanti, pūtibhāvena āpaṇādito vissaṭṭhaṃ chaḍḍitaṃ apariggahitaṃ yaṃkiñci bhesajjaṃ pūtimuttanti adhippetanti apare."
    ],
    "innerText": "Paṃsukūlanti rathikāsusānasaṅkārakūṭādīsu yattha katthaci paṃsūnaṃ upari ṭhitattā abbhuggataṭṭhena paṃsukūlaṃ viyāti paṃsukūlaṃ, paṃsu viya kucchitabhāvaṃ ulati gacchatīti paṃsukūlanti evaṃ laddhanāmaṃ rathikādīsu patitanantakāni uccinitvā katacīvaraṃ. Piṇḍiyālopoti jaṅghapiṇḍiyā balena caritvā ghare ghare ālopamattaṃ katvā laddhabhojanaṃ. Rukkhamūlanti vivekānurūpaṃ yaṃkiñci rukkhasamīpaṃ. Pūtimuttanti yaṃkiñci gomuttaṃ. Yathā hi suvaṇṇavaṇṇopi kāyo pūtikāyova evaṃ abhinavampi muttaṃ pūtimuttameva. Tattha keci gomuttabhāvitaṃ haritakīkhaṇḍaṃ ‘‘pūtimutta’’nti vadanti, pūtibhāvena āpaṇādito vissaṭṭhaṃ chaḍḍitaṃ apariggahitaṃ yaṃkiñci bhesajjaṃ pūtimuttanti adhippetanti apare."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yato kho"
      },
      "ti paccatte nissakkavacanaṃ, yaṃ khoti vuttaṃ hoti. Tena ‘‘tuṭṭho hotī’’ti vuttakiriyaṃ parāmasati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tuṭṭho"
      },
      "ti santuṭṭho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idamassāha"
      },
      "nti yvāyaṃ catubbidhena yathāvuttena paccayena appena sulabhena santoso, idaṃ imassa bhikkhuno sīlasaṃvarādīsu aññataraṃ ekaṃ sāmaññaṅgaṃ samaṇabhāvakāraṇanti ahaṃ vadāmi. Santuṭṭhassa hi catupārisuddhisīlaṃ suparipuṇṇaṃ hoti, samathavipassanā ca bhāvanāpāripūriṃ gacchanti. Atha vā sāmaññaṃ nāma ariyamaggo. Tassa saṅkhepato dve aṅgāni – bāhiraṃ, ajjhattikanti. Tattha bāhiraṃ sappurisūpanissayo saddhammassavanañca, ajjhattikaṃ pana yoniso manasikāro dhammānudhammapaṭipatti ",
      " ca. Tesu yasmā yathārahaṃ dhammānudhammapaṭipattibhūtā tassā mūlabhūtā cete dhammā, yadidaṃ appicchatā santuṭṭhitā pavivittatā asaṃsaṭṭhatā āraddhavīriyatāti evamādayo, tasmā vuttaṃ ‘‘idamassāhaṃ aññataraṃ sāmaññaṅganti vadāmī’’ti."
    ],
    "innerText": "Yato khoti paccatte nissakkavacanaṃ, yaṃ khoti vuttaṃ hoti. Tena ‘‘tuṭṭho hotī’’ti vuttakiriyaṃ parāmasati. Tuṭṭhoti santuṭṭho. Idamassāhanti yvāyaṃ catubbidhena yathāvuttena paccayena appena sulabhena santoso, idaṃ imassa bhikkhuno sīlasaṃvarādīsu aññataraṃ ekaṃ sāmaññaṅgaṃ samaṇabhāvakāraṇanti ahaṃ vadāmi. Santuṭṭhassa hi catupārisuddhisīlaṃ suparipuṇṇaṃ hoti, samathavipassanā ca bhāvanāpāripūriṃ gacchanti. Atha vā sāmaññaṃ nāma ariyamaggo. Tassa saṅkhepato dve aṅgāni – bāhiraṃ, ajjhattikanti. Tattha bāhiraṃ sappurisūpanissayo saddhammassavanañca, ajjhattikaṃ pana yoniso manasikāro dhammānudhammapaṭipatti ca. Tesu yasmā yathārahaṃ dhammānudhammapaṭipattibhūtā tassā mūlabhūtā cete dhammā, yadidaṃ appicchatā santuṭṭhitā pavivittatā asaṃsaṭṭhatā āraddhavīriyatāti evamādayo, tasmā vuttaṃ ‘‘idamassāhaṃ aññataraṃ sāmaññaṅganti vadāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Gāthāsu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "senāsanamārabbhā"
      },
      "ti vihārādiṃ mañcapīṭhādiñca senāsanaṃ nissāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cīvaraṃ pānabhojana"
      },
      "nti nivāsanādicīvaraṃ, ambapānakādipānaṃ, khādanīyabhojanīyādibhuñjitabbavatthuñca ārabbhāti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vighāto"
      },
      " vihatabhāvo cetodukkhaṃ na hotīti yojanā. Ayañhettha saṅkhepattho – ‘‘asukasmiṃ nāma āvāse paccayā sulabhā’’ti labhitabbaṭṭhānagamanena vā ‘‘mayhaṃ pāpuṇāti na tuyha’’nti vivādāpajjanena vā navakammakaraṇādivasena vā senāsanādīni pariyesantānaṃ asantuṭṭhānaṃ icchitalābhādinā yo vighāto cittassa hoti, so tattha santuṭṭhassa na hotīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Disā nappaṭihaññatī"
      },
      "ti santuṭṭhiyā cātuddisābhāvena disā nappaṭihanti. Vuttañhetaṃ –"
    ],
    "innerText": "Gāthāsu senāsanamārabbhāti vihārādiṃ mañcapīṭhādiñca senāsanaṃ nissāya. Cīvaraṃ pānabhojananti nivāsanādicīvaraṃ, ambapānakādipānaṃ, khādanīyabhojanīyādibhuñjitabbavatthuñca ārabbhāti sambandho. Vighāto vihatabhāvo cetodukkhaṃ na hotīti yojanā. Ayañhettha saṅkhepattho – ‘‘asukasmiṃ nāma āvāse paccayā sulabhā’’ti labhitabbaṭṭhānagamanena vā ‘‘mayhaṃ pāpuṇāti na tuyha’’nti vivādāpajjanena vā navakammakaraṇādivasena vā senāsanādīni pariyesantānaṃ asantuṭṭhānaṃ icchitalābhādinā yo vighāto cittassa hoti, so tattha santuṭṭhassa na hotīti. Disā nappaṭihaññatīti santuṭṭhiyā cātuddisābhāvena disā nappaṭihanti. Vuttañhetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Cātuddiso ",
      " appaṭigho ca hoti,"
    ],
    "innerText": "‘‘Cātuddiso appaṭigho ca hoti,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Santussamāno itarītarenā’’ti. (su. ni. 42; cūḷani. khaggavisāṇasuttaniddesa 128);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yassa hi ‘‘asukaṭṭhānaṃ nāma gato cīvarādīni labhissāmī’’ti cittaṃ uppajjati, tassa disā paṭihaññati nāma. Yassa pana evaṃ na uppajjati, tassa disā na paṭihaññati nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammā"
      },
      "ti paṭipattidhammā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sāmaññassānulomikā"
      },
      "ti samaṇadhammassa samathavipassanābhāvanāya ariyamaggasseva vā anucchavikā appicchatādayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adhiggahitā"
      },
      "ti sabbe te tuṭṭhacittassa santuṭṭhacittena bhikkhunā adhiggahitā paṭipakkhadhamme abhibhavitvā gahitā honti abbhantaragatā, na bāhiragatāti."
    ],
    "innerText": "Yassa hi ‘‘asukaṭṭhānaṃ nāma gato cīvarādīni labhissāmī’’ti cittaṃ uppajjati, tassa disā paṭihaññati nāma. Yassa pana evaṃ na uppajjati, tassa disā na paṭihaññati nāma. Dhammāti paṭipattidhammā. Sāmaññassānulomikāti samaṇadhammassa samathavipassanābhāvanāya ariyamaggasseva vā anucchavikā appicchatādayo. Adhiggahitāti sabbe te tuṭṭhacittassa santuṭṭhacittena bhikkhunā adhiggahitā paṭipakkhadhamme abhibhavitvā gahitā honti abbhantaragatā, na bāhiragatāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dutiyasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Āsavakkhayasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "102"
      },
      ". Tatiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jānato"
      },
      "ti jānantassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Passato"
      },
      "ti passantassa. Yadipi imāni dvepi padāni ekatthāni, byañjanameva nānaṃ, evaṃ santepi ‘‘jānato’’ti ñāṇalakkhaṇaṃ upādāya puggalaṃ niddisati. Jānanalakkhaṇañhi ñāṇaṃ. ‘‘Passato’’ti ñāṇappabhāvaṃ upādāya. Dassanappabhāvañhi upādāya ñāṇasamaṅgī puggalo cakkhumā viya puggalo cakkhunā rūpāni, ñāṇena vivaṭe dhamme passati. Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jānato"
      },
      "ti anubodhañāṇena jānato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Passato"
      },
      "ti paṭivedhañāṇena passato. Paṭilomato vā dassanamaggena passato, bhāvanāmaggena jānato. Keci ",
      " pana ‘‘ñātatīraṇapahānapariññāhi jānato, sikhāppattavipassanāya passato’’ti vadanti. Atha vā dukkhaṃ pariññābhisamayena jānato, nirodhaṃ sacchikiriyābhisamayena passato. Tadubhaye ca sati pahānabhāvanābhisamayā siddhā eva hontīti catusaccābhisamayo vutto hoti. Yadā cettha vipassanāñāṇaṃ adhippetaṃ, tadā ‘‘jānato passato’’ti padānaṃ hetuatthadīpanatā daṭṭhabbā. Yadā pana maggañāṇaṃ adhippetaṃ, tadā maggakiccatthadīpanatā."
    ],
    "innerText": "102. Tatiye jānatoti jānantassa. Passatoti passantassa. Yadipi imāni dvepi padāni ekatthāni, byañjanameva nānaṃ, evaṃ santepi ‘‘jānato’’ti ñāṇalakkhaṇaṃ upādāya puggalaṃ niddisati. Jānanalakkhaṇañhi ñāṇaṃ. ‘‘Passato’’ti ñāṇappabhāvaṃ upādāya. Dassanappabhāvañhi upādāya ñāṇasamaṅgī puggalo cakkhumā viya puggalo cakkhunā rūpāni, ñāṇena vivaṭe dhamme passati. Atha vā jānatoti anubodhañāṇena jānato. Passatoti paṭivedhañāṇena passato. Paṭilomato vā dassanamaggena passato, bhāvanāmaggena jānato. Keci pana ‘‘ñātatīraṇapahānapariññāhi jānato, sikhāppattavipassanāya passato’’ti vadanti. Atha vā dukkhaṃ pariññābhisamayena jānato, nirodhaṃ sacchikiriyābhisamayena passato. Tadubhaye ca sati pahānabhāvanābhisamayā siddhā eva hontīti catusaccābhisamayo vutto hoti. Yadā cettha vipassanāñāṇaṃ adhippetaṃ, tadā ‘‘jānato passato’’ti padānaṃ hetuatthadīpanatā daṭṭhabbā. Yadā pana maggañāṇaṃ adhippetaṃ, tadā maggakiccatthadīpanatā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āsavānaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "khaya"
      },
      "nti ‘‘jānato, ahaṃ bhikkhave, passato āsavānaṃ khayaṃ vadāmī’’ti (ma. ni. 1.15; saṃ. ni. 3.101; 5.1095) evamāgate sabbāsavasaṃvarapariyāye ‘‘āsavānaṃ khayā anāsavaṃ cetovimutti’’ntiādīsu (ma. ni. 1.438) ca suttapadesu āsavānaṃ pahānaṃ accantakkhayo asamuppādo khīṇākāro natthibhāvo ‘‘āsavakkhayo’’ti vutto. ‘‘Āsavānaṃ khayā samaṇo hotī’’tiādīsu (ma. ni. 1.438) phalaṃ."
    ],
    "innerText": "Āsavānaṃkhayanti ‘‘jānato, ahaṃ bhikkhave, passato āsavānaṃ khayaṃ vadāmī’’ti (ma. ni. 1.15; saṃ. ni. 3.101; 5.1095) evamāgate sabbāsavasaṃvarapariyāye ‘‘āsavānaṃ khayā anāsavaṃ cetovimutti’’ntiādīsu (ma. ni. 1.438) ca suttapadesu āsavānaṃ pahānaṃ accantakkhayo asamuppādo khīṇākāro natthibhāvo ‘‘āsavakkhayo’’ti vutto. ‘‘Āsavānaṃ khayā samaṇo hotī’’tiādīsu (ma. ni. 1.438) phalaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Paravajjānupassissa, niccaṃ ujjhānasaññino;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Āsavā tassa vaḍḍhanti, ārā so āsavakkhayā’’ti. (dha. pa. 253); –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Ādīsu nibbānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sekhassa sikkhamānassa, ujumaggānusārino;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Khayasmiṃ paṭhamaṃ ñāṇaṃ, tato aññā anantarā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tato aññāvimuttassa, ñāṇaṃ ve hoti tādino’’ti. (a. ni. 3.86; itivu. 62) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Evamāgate indriyasutte idha ca maggo ‘‘āsavakkhayo’’ti vutto. Tasmā yathāvuttanayena jānantassa passantassa ahaṃ ariyamaggādhigamaṃ vadāmīti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "No"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ajānato no apassato"
      },
      "ti yo pana na jānāti na passati, tassa no vadāmīti attho. Etena ye ajānato apassatopi saṃsārasuddhiṃ vadanti, te paṭikkhipati. Purimena vā padadvayena upāyo vutto, iminā anupāyapaṭisedho. Saṅkhepena cettha ñāṇaṃ āsavakkhayakaraṃ, sesaṃ tassa parikkhāroti dasseti."
    ],
    "innerText": "Evamāgate indriyasutte idha ca maggo ‘‘āsavakkhayo’’ti vutto. Tasmā yathāvuttanayena jānantassa passantassa ahaṃ ariyamaggādhigamaṃ vadāmīti vuttaṃ hoti. Noajānato no apassatoti yo pana na jānāti na passati, tassa no vadāmīti attho. Etena ye ajānato apassatopi saṃsārasuddhiṃ vadanti, te paṭikkhipati. Purimena vā padadvayena upāyo vutto, iminā anupāyapaṭisedho. Saṅkhepena cettha ñāṇaṃ āsavakkhayakaraṃ, sesaṃ tassa parikkhāroti dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni ",
      " yaṃ jānato yaṃ passato āsavakkhayo hoti, taṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kiñca, bhikkhave, jānato’’"
      },
      "ti pucchaṃ ārabhi. Tattha jānanā bahuvidhā. Dabbajātiko eva hi koci bhikkhu chattaṃ kātuṃ jānāti, koci cīvarādīnaṃ aññataraṃ, tassa īdisāni kammāni vattasīse ṭhatvā karontassa sā jānanā ‘‘maggaphalānaṃ padaṭṭhānaṃ na hotī’’ti na vattabbā. Yo pana sāsane pabbajitvā vejjakammādīni kātuṃ jānāti, tassevaṃ jānato āsavā vaḍḍhantiyeva. Tasmā yaṃ jānato yaṃ passato āsavānaṃ khayo hoti, tadeva dassento āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘idaṃ dukkha’’"
      },
      "ntiādi. Tattha yaṃ vattabbaṃ catusaccakammaṭṭhānaṃ, taṃ heṭṭhā yonisomanasikārasutte saṅkhepato vuttameva."
    ],
    "innerText": "Idāni yaṃ jānato yaṃ passato āsavakkhayo hoti, taṃ dassetuṃ ‘‘kiñca, bhikkhave, jānato’’ti pucchaṃ ārabhi. Tattha jānanā bahuvidhā. Dabbajātiko eva hi koci bhikkhu chattaṃ kātuṃ jānāti, koci cīvarādīnaṃ aññataraṃ, tassa īdisāni kammāni vattasīse ṭhatvā karontassa sā jānanā ‘‘maggaphalānaṃ padaṭṭhānaṃ na hotī’’ti na vattabbā. Yo pana sāsane pabbajitvā vejjakammādīni kātuṃ jānāti, tassevaṃ jānato āsavā vaḍḍhantiyeva. Tasmā yaṃ jānato yaṃ passato āsavānaṃ khayo hoti, tadeva dassento āha ‘‘idaṃ dukkha’’ntiādi. Tattha yaṃ vattabbaṃ catusaccakammaṭṭhānaṃ, taṃ heṭṭhā yonisomanasikārasutte saṅkhepato vuttameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      " pana ‘‘yoniso, bhikkhave, bhikkhu manasi karonto akusalaṃ pajahati, kusalaṃ bhāvetī’’ti (itivu. 16) āgatattā ‘‘idaṃ dukkhanti yoniso manasi karotī’’tiādinā atthavibhāvanā katā. Idha ‘‘idaṃ dukkhanti, bhikkhave, jānato passato āsavānaṃ khayo hotī’’ti (ma. ni. 1.15; saṃ. ni. 3.101; 5.1095) āgatattā ‘‘idaṃ dukkhanti pariññāpaṭivedhavasena pariññābhisamayavasena maggañāṇena jānato passato āsavānaṃ khayo hotī’’tiādinā nayena yojetabbaṃ. Āsavesu ca paṭhamamaggena diṭṭhāsavo khīyati, tatiyamaggena kāmāsavo, catutthamaggena bhavāsavo avijjāsavo ca khīyatīti veditabbo."
    ],
    "innerText": "Tattha pana ‘‘yoniso, bhikkhave, bhikkhu manasi karonto akusalaṃ pajahati, kusalaṃ bhāvetī’’ti (itivu. 16) āgatattā ‘‘idaṃ dukkhanti yoniso manasi karotī’’tiādinā atthavibhāvanā katā. Idha ‘‘idaṃ dukkhanti, bhikkhave, jānato passato āsavānaṃ khayo hotī’’ti (ma. ni. 1.15; saṃ. ni. 3.101; 5.1095) āgatattā ‘‘idaṃ dukkhanti pariññāpaṭivedhavasena pariññābhisamayavasena maggañāṇena jānato passato āsavānaṃ khayo hotī’’tiādinā nayena yojetabbaṃ. Āsavesu ca paṭhamamaggena diṭṭhāsavo khīyati, tatiyamaggena kāmāsavo, catutthamaggena bhavāsavo avijjāsavo ca khīyatīti veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Gāthāsu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vimuttiñāṇa"
      },
      "nti vimuttiyaṃ nibbāne phale ca paccavekkhaṇañāṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uttama"
      },
      "nti uttamadhammārammaṇattā uttamaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khaye ñāṇa"
      },
      "nti āsavānaṃ saṃyojanānañca khaye khayakare ariyamagge ñāṇaṃ. ‘‘Khīṇā saṃyojanā iti ñāṇa’’nti idhāpi ānetvā sambandhitabbaṃ. Tena pahīnakilesapaccavekkhaṇaṃ dasseti. Evamettha cattāripi paccavekkhaṇañāṇāni vuttāni honti ",
      ". Avasiṭṭhakilesapaccavekkhaṇā hi idha natthi arahattaphalādhigamassa adhippetattā. Yathā cettha jānato passatoti nibbānādhigamena sammādiṭṭhikiccaṃ adhikaṃ katvā vuttaṃ, evaṃ sammappadhānakiccampi adhikameva icchitabbanti dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘na tvevidaṃ kusītenā’’"
      },
      "ti osānagāthamāha."
    ],
    "innerText": "Gāthāsu vimuttiñāṇanti vimuttiyaṃ nibbāne phale ca paccavekkhaṇañāṇaṃ. Uttamanti uttamadhammārammaṇattā uttamaṃ. Khaye ñāṇanti āsavānaṃ saṃyojanānañca khaye khayakare ariyamagge ñāṇaṃ. ‘‘Khīṇā saṃyojanā iti ñāṇa’’nti idhāpi ānetvā sambandhitabbaṃ. Tena pahīnakilesapaccavekkhaṇaṃ dasseti. Evamettha cattāripi paccavekkhaṇañāṇāni vuttāni honti . Avasiṭṭhakilesapaccavekkhaṇā hi idha natthi arahattaphalādhigamassa adhippetattā. Yathā cettha jānato passatoti nibbānādhigamena sammādiṭṭhikiccaṃ adhikaṃ katvā vuttaṃ, evaṃ sammappadhānakiccampi adhikameva icchitabbanti dassento ‘‘na tvevidaṃ kusītenā’’ti osānagāthamāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na tvevida"
      },
      "nti na tu eva idaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tu"
      },
      "saddo nipātamattaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bālenamavijānatā"
      },
      "ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ma"
      },
      "kāro padasandhikaro. Ayañhettha saṅkhepattho – idaṃ sekkhamaggena asekkhamaggena ca pattabbaṃ abhijjhākāyaganthādisabbaganthānaṃ pamocanaṃ pamocanassa nimittabhūtaṃ nibbānaṃ ‘‘idaṃ dukkha’’ntiādinā cattāri saccāni yathābhūtaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avijānatā"
      },
      " tato eva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bālena"
      },
      " aviddasunā yathā adhigantuṃ na sakkā, evaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kusītena"
      },
      " nibbīriyenāpi, tasmā tadadhigamāya āraddhavīriyena bhavitabbanti. Tenāha bhagavā ‘‘āraddhavīriyassāyaṃ dhammo, no kusītassa’’ (dī. ni. 3.358)."
    ],
    "innerText": "Tattha na tvevidanti na tu eva idaṃ. Tusaddo nipātamattaṃ. Bālenamavijānatāti makāro padasandhikaro. Ayañhettha saṅkhepattho – idaṃ sekkhamaggena asekkhamaggena ca pattabbaṃ abhijjhākāyaganthādisabbaganthānaṃ pamocanaṃ pamocanassa nimittabhūtaṃ nibbānaṃ ‘‘idaṃ dukkha’’ntiādinā cattāri saccāni yathābhūtaṃ avijānatā tato eva bālena aviddasunā yathā adhigantuṃ na sakkā, evaṃ kusītena nibbīriyenāpi, tasmā tadadhigamāya āraddhavīriyena bhavitabbanti. Tenāha bhagavā ‘‘āraddhavīriyassāyaṃ dhammo, no kusītassa’’ (dī. ni. 3.358)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Ārambhatha ",
      " nikkamatha, yuñjatha buddhasāsane;"
    ],
    "innerText": "‘‘Ārambhatha nikkamatha, yuñjatha buddhasāsane;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dhunātha maccuno senaṃ, naḷāgāraṃva kuñjaro’’ti. (saṃ. ni. 1.185; netti. 29; mi. pa. 5.1.4);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tatiyasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Samaṇabrāhmaṇasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "103"
      },
      ". Catutthe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ye hi kecī"
      },
      "ti ye keci. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idaṃ dukkhanti yathābhūtaṃ nappajānantī"
      },
      "ti ‘‘idaṃ dukkhaṃ, ettakaṃ dukkhaṃ, na ito bhiyyo’’ti aviparītaṃ sabhāvasarasalakkhaṇato vipassanāpaññāsahitāya maggapaññāya dukkhasaccaṃ na jānanti na paṭivijjhanti. Sesesupi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na me te, bhikkhave"
      },
      "tiādīsu ayaṃ saṅkhepattho – bhikkhave, catusaccakammaṭṭhānaṃ ananuyuttā pabbajjāmattasamaṇā ceva jātimattabrāhmaṇā ca na mayā te samitapāpasamaṇesu samaṇoti, bāhitapāpabrāhmaṇesu brāhmaṇoti ca sammatā anuññātā. Kasmā? Samaṇakaraṇānaṃ brāhmaṇakaraṇānañca dhammānaṃ abhāvatoti. Tenevāha ‘‘na ca pana te āyasmanto’’tiādi. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sāmaññattha"
      },
      "nti sāmaññasaṅkhātaṃ atthaṃ, cattāri sāmaññaphalānīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Brahmaññattha"
      },
      "nti tasseva vevacanaṃ. Apare pana ‘‘sāmaññatthanti ",
      " cattāro ariyamaggā, brahmaññatthanti cattāri ariyaphalānī’’ti vadanti. Sesaṃ vuttanayameva. Sukkapakkho vuttavipariyāyena veditabbo. Gāthāsu apubbaṃ natthi."
    ],
    "innerText": "103. Catutthe ye hi kecīti ye keci. Idaṃ dukkhanti yathābhūtaṃ nappajānantīti ‘‘idaṃ dukkhaṃ, ettakaṃ dukkhaṃ, na ito bhiyyo’’ti aviparītaṃ sabhāvasarasalakkhaṇato vipassanāpaññāsahitāya maggapaññāya dukkhasaccaṃ na jānanti na paṭivijjhanti. Sesesupi eseva nayo. Na me te, bhikkhavetiādīsu ayaṃ saṅkhepattho – bhikkhave, catusaccakammaṭṭhānaṃ ananuyuttā pabbajjāmattasamaṇā ceva jātimattabrāhmaṇā ca na mayā te samitapāpasamaṇesu samaṇoti, bāhitapāpabrāhmaṇesu brāhmaṇoti ca sammatā anuññātā. Kasmā? Samaṇakaraṇānaṃ brāhmaṇakaraṇānañca dhammānaṃ abhāvatoti. Tenevāha ‘‘na ca pana te āyasmanto’’tiādi. Tattha sāmaññatthanti sāmaññasaṅkhātaṃ atthaṃ, cattāri sāmaññaphalānīti attho. Brahmaññatthanti tasseva vevacanaṃ. Apare pana ‘‘sāmaññatthanti cattāro ariyamaggā, brahmaññatthanti cattāri ariyaphalānī’’ti vadanti. Sesaṃ vuttanayameva. Sukkapakkho vuttavipariyāyena veditabbo. Gāthāsu apubbaṃ natthi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Catutthasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Sīlasampannasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "104"
      },
      ". Pañcame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sīlasampannā"
      },
      "ti ettha sīlaṃ nāma khīṇāsavānaṃ lokiyalokuttarasīlaṃ, tena sampannā samannāgatāti sīlasampannā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samādhipaññāsu"
      },
      "pi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vimutti"
      },
      " pana phalavimuttiyeva, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vimuttiñāṇadassanaṃ"
      },
      " paccavekkhaṇañāṇaṃ. Evamettha sīlādayo tayo lokiyalokuttarā, vimutti lokuttarāva, vimuttiñāṇadassanaṃ lokiyameva. Diṭṭhadhammikasamparāyikaparamatthehi yathārahaṃ pare ovadanti anusāsantīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ovādakā. Viññāpakā"
      },
      "ti kammāni kammaphalāni ca, viññāpakā, tattha ca ‘‘ime dhammā kusalā, ime dhammā akusalā. Ime ",
      " dhammā sāvajjā, ime dhammā anavajjā’’tiādinā kusalādivibhāgato khandhādivibhāgato salakkhaṇato sāmaññalakkhaṇatoti vividhehi nayehi dhammānaṃ ñāpakā avabodhakā ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sandassakā"
      },
      "ti teyeva dhamme hatthena gahetvā viya parassa paccakkhato dassetāro. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samādapakā"
      },
      "ti yaṃ sīlādi yehi asamādinnaṃ, tassa samādāpetāro, tattha te patiṭṭhāpetāro. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samuttejakā"
      },
      "ti evaṃ kusaladhammesu patiṭṭhitānaṃ upari adhicittānuyoge niyojanavasena cittassa sammā uttejakā, yathā visesādhigamo hoti, evaṃ nisāmanavasena tejakā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sampahaṃsakā"
      },
      "ti tesaṃ yathāladdhehi upariladdhabbehi ca guṇavisesehi cittassa sammā pahaṃsakā, laddhassādavasena suṭṭhu tosakā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Alaṃsamakkhātāro"
      },
      "ti alaṃ pariyattaṃ yathāvuttaṃ aparihāpetvā sammadeva anuggahādhippāyena akkhātāro."
    ],
    "innerText": "104. Pañcame sīlasampannāti ettha sīlaṃ nāma khīṇāsavānaṃ lokiyalokuttarasīlaṃ, tena sampannā samannāgatāti sīlasampannā. Samādhipaññāsupi eseva nayo. Vimutti pana phalavimuttiyeva, vimuttiñāṇadassanaṃ paccavekkhaṇañāṇaṃ. Evamettha sīlādayo tayo lokiyalokuttarā, vimutti lokuttarāva, vimuttiñāṇadassanaṃ lokiyameva. Diṭṭhadhammikasamparāyikaparamatthehi yathārahaṃ pare ovadanti anusāsantīti ovādakā. Viññāpakāti kammāni kammaphalāni ca, viññāpakā, tattha ca ‘‘ime dhammā kusalā, ime dhammā akusalā. Ime dhammā sāvajjā, ime dhammā anavajjā’’tiādinā kusalādivibhāgato khandhādivibhāgato salakkhaṇato sāmaññalakkhaṇatoti vividhehi nayehi dhammānaṃ ñāpakā avabodhakā . Sandassakāti teyeva dhamme hatthena gahetvā viya parassa paccakkhato dassetāro. Samādapakāti yaṃ sīlādi yehi asamādinnaṃ, tassa samādāpetāro, tattha te patiṭṭhāpetāro. Samuttejakāti evaṃ kusaladhammesu patiṭṭhitānaṃ upari adhicittānuyoge niyojanavasena cittassa sammā uttejakā, yathā visesādhigamo hoti, evaṃ nisāmanavasena tejakā. Sampahaṃsakāti tesaṃ yathāladdhehi upariladdhabbehi ca guṇavisesehi cittassa sammā pahaṃsakā, laddhassādavasena suṭṭhu tosakā. Alaṃsamakkhātāroti alaṃ pariyattaṃ yathāvuttaṃ aparihāpetvā sammadeva anuggahādhippāyena akkhātāro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sandassakā"
      },
      "ti dhammaṃ desentā pavattinivattiyo sabhāvasarasalakkhaṇato sammadeva dassetāro. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samādapakā"
      },
      "ti citte patiṭṭhāpanavasena tasseva atthassa gāhāpakā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samuttejakā"
      },
      "ti ",
      " tadatthaggahaṇe ussāhajananena sammadeva vodapakā jotakā vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sampahaṃsakā"
      },
      "ti tadatthapaṭipattiyaṃ ānisaṃsadassanena sammadeva pahaṃsakā tosakā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Alaṃsamakkhātāro"
      },
      "ti samatthā hutvā vuttanayena samakkhātāro. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddhammassā"
      },
      "ti paṭivedhasaddhammassa, tividhassāpi vā saddhammassa desetāro."
    ],
    "innerText": "Atha vā sandassakāti dhammaṃ desentā pavattinivattiyo sabhāvasarasalakkhaṇato sammadeva dassetāro. Samādapakāti citte patiṭṭhāpanavasena tasseva atthassa gāhāpakā. Samuttejakāti tadatthaggahaṇe ussāhajananena sammadeva vodapakā jotakā vā. Sampahaṃsakāti tadatthapaṭipattiyaṃ ānisaṃsadassanena sammadeva pahaṃsakā tosakā. Alaṃsamakkhātāroti samatthā hutvā vuttanayena samakkhātāro. Saddhammassāti paṭivedhasaddhammassa, tividhassāpi vā saddhammassa desetāro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dassanampaha"
      },
      "nti dassanampi ahaṃ. Taṃ panetaṃ cakkhudassanaṃ ñāṇadassananti duvidhaṃ. Tattha pasannehi cakkhūhi ariyānaṃ olokanaṃ cakkhudassanaṃ nāma. Ariyabhāvakarānaṃ pana dhammānaṃ ariyabhāvassa ca vipassanāmaggaphalehi adhigamo ñāṇadassanaṃ nāma. Imasmiṃ panatthe cakkhudassanaṃ adhippetaṃ. Ariyānañhi pasannehi cakkhūhi olokanampi sattānaṃ bahūpakārameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Savana"
      },
      "nti ‘‘asuko nāma khīṇāsavo asukasmiṃ nāma raṭṭhe vā janapade vā gāme vā nigame vā vihāre vā leṇe vā vasatī’’ti kathentānaṃ sotena savanaṃ, etampi bahūpakārameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upasaṅkamana"
      },
      "nti ‘‘dānaṃ vā dassāmi, pañhaṃ vā pucchissāmi, dhammaṃ vā sossāmi, sakkāraṃ vā karissāmī’’ti evarūpena cittena ariyānaṃ upasaṅkamanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Payirupāsana"
      },
      "nti pañhapayirupāsanaṃ, ariyānaṃ guṇe sutvā te upasaṅkamitvā nimantetvā dānaṃ ",
      " vā datvā vattaṃ vā katvā ‘‘kiṃ, bhante, kusala’’ntiādinā nayena pañhapucchananti attho. Veyyāvaccādikaraṇaṃ payirupāsanaṃyeva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anussaraṇa"
      },
      "nti rattiṭṭhānadivāṭṭhānesu nisinnassa ‘‘idāni ariyā gumbaleṇamaṇḍapādīsu jhānavipassanāmaggaphalasukhehi vītināmentī’’ti tesaṃ dibbavihārādiguṇavisesārammaṇaṃ anussaraṇaṃ. Yo vā tesaṃ santikā ovādo laddho hoti, taṃ āvajjitvā ‘‘imasmiṃ ",
      " ṭhāne sīlaṃ kathitaṃ, imasmiṃ samādhi, imasmiṃ vipassanā, imasmiṃ maggo, imasmiṃ phala’’nti evaṃ anussaraṇaṃ."
    ],
    "innerText": "Dassanampahanti dassanampi ahaṃ. Taṃ panetaṃ cakkhudassanaṃ ñāṇadassananti duvidhaṃ. Tattha pasannehi cakkhūhi ariyānaṃ olokanaṃ cakkhudassanaṃ nāma. Ariyabhāvakarānaṃ pana dhammānaṃ ariyabhāvassa ca vipassanāmaggaphalehi adhigamo ñāṇadassanaṃ nāma. Imasmiṃ panatthe cakkhudassanaṃ adhippetaṃ. Ariyānañhi pasannehi cakkhūhi olokanampi sattānaṃ bahūpakārameva. Savananti ‘‘asuko nāma khīṇāsavo asukasmiṃ nāma raṭṭhe vā janapade vā gāme vā nigame vā vihāre vā leṇe vā vasatī’’ti kathentānaṃ sotena savanaṃ, etampi bahūpakārameva. Upasaṅkamananti ‘‘dānaṃ vā dassāmi, pañhaṃ vā pucchissāmi, dhammaṃ vā sossāmi, sakkāraṃ vā karissāmī’’ti evarūpena cittena ariyānaṃ upasaṅkamanaṃ. Payirupāsananti pañhapayirupāsanaṃ, ariyānaṃ guṇe sutvā te upasaṅkamitvā nimantetvā dānaṃ vā datvā vattaṃ vā katvā ‘‘kiṃ, bhante, kusala’’ntiādinā nayena pañhapucchananti attho. Veyyāvaccādikaraṇaṃ payirupāsanaṃyeva. Anussaraṇanti rattiṭṭhānadivāṭṭhānesu nisinnassa ‘‘idāni ariyā gumbaleṇamaṇḍapādīsu jhānavipassanāmaggaphalasukhehi vītināmentī’’ti tesaṃ dibbavihārādiguṇavisesārammaṇaṃ anussaraṇaṃ. Yo vā tesaṃ santikā ovādo laddho hoti, taṃ āvajjitvā ‘‘imasmiṃ ṭhāne sīlaṃ kathitaṃ, imasmiṃ samādhi, imasmiṃ vipassanā, imasmiṃ maggo, imasmiṃ phala’’nti evaṃ anussaraṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anupabbajja"
      },
      "nti ariyesu cittaṃ pasādetvā gharā nikkhamma tesaṃ santike pabbajjaṃ. Ariyesu ",
      " hi cittaṃ pasādetvā tesaṃyeva santike pabbajitvā tesaṃyeva ovādānusāsaniṃ paccāsīsamānassa caratopi pabbajjā anupabbajjā nāma, aññesaṃ santike ovādānusāsaniṃ paccāsīsamānassa caratopi pabbajjā anupabbajjā nāma, ariyesu pasādena aññattha pabbajitvā ariyānaṃ santike ovādānusāsaniṃ paccāsīsamānassa caratopi pabbajjā anupabbajjāva. Aññesu pana pasādena aññesaṃyeva santike pabbajitvā aññesaṃyeva ovādānusāsaniṃ paccāsīsamānassa carato pabbajjā anupabbajjā nāma na hoti. Vuttanayena pabbajitesu pana mahākassapattherassa tāva anupabbajjaṃ pabbajitā satasahassamattā ahesuṃ, tathā therasseva saddhivihārikassa candaguttattherassa, tassāpi saddhivihārikassa sūriyaguttattherassa, tassāpi saddhivihārikassa assaguttattherassa, tassāpi saddhivihārikassa yonakadhammarakkhitattherassa. Tassa pana saddhivihāriko asokarañño kaniṭṭhabhātā tissatthero nāma ahosi. Tassa anupabbajjaṃ pabbajitā aḍḍhateyyakoṭisaṅkhā ahesuṃ. Dīpappasādakamahāmahindattherassa pana anupabbajitānaṃ gaṇanaparicchedo natthi. Yāvajjadivasā laṅkādīpe satthari pasādena pabbajantā mahāmahindattherasseva anupabbajjanti nāma."
    ],
    "innerText": "Anupabbajjanti ariyesu cittaṃ pasādetvā gharā nikkhamma tesaṃ santike pabbajjaṃ. Ariyesu hi cittaṃ pasādetvā tesaṃyeva santike pabbajitvā tesaṃyeva ovādānusāsaniṃ paccāsīsamānassa caratopi pabbajjā anupabbajjā nāma, aññesaṃ santike ovādānusāsaniṃ paccāsīsamānassa caratopi pabbajjā anupabbajjā nāma, ariyesu pasādena aññattha pabbajitvā ariyānaṃ santike ovādānusāsaniṃ paccāsīsamānassa caratopi pabbajjā anupabbajjāva. Aññesu pana pasādena aññesaṃyeva santike pabbajitvā aññesaṃyeva ovādānusāsaniṃ paccāsīsamānassa carato pabbajjā anupabbajjā nāma na hoti. Vuttanayena pabbajitesu pana mahākassapattherassa tāva anupabbajjaṃ pabbajitā satasahassamattā ahesuṃ, tathā therasseva saddhivihārikassa candaguttattherassa, tassāpi saddhivihārikassa sūriyaguttattherassa, tassāpi saddhivihārikassa assaguttattherassa, tassāpi saddhivihārikassa yonakadhammarakkhitattherassa. Tassa pana saddhivihāriko asokarañño kaniṭṭhabhātā tissatthero nāma ahosi. Tassa anupabbajjaṃ pabbajitā aḍḍhateyyakoṭisaṅkhā ahesuṃ. Dīpappasādakamahāmahindattherassa pana anupabbajitānaṃ gaṇanaparicchedo natthi. Yāvajjadivasā laṅkādīpe satthari pasādena pabbajantā mahāmahindattherasseva anupabbajjanti nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni yena kāraṇena tesaṃ ariyānaṃ dassanādi bahūpakāranti vuttaṃ, taṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tathārūpe’’"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tathārūpe"
      },
      "ti tādise sīlādiguṇasampanne ariye. Yasmā dassanasavanānussaraṇāni upasaṅkamanapayirupāsanaṭṭhānāni, tasmā tāni anāmasitvā upasaṅkamanapayirupāsanāniyeva dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sevato bhajato payirupāsato’’"
      },
      "ti vuttaṃ ",
      ". Dassanasavanānussaraṇato hi ariyesu uppannasaddho te upasaṅkamitvā payirupāsitvā pañhaṃ pucchitvā laddhasavanānuttariyo aparipūre sīlādiguṇe paripūressatīti. Tathā hi vuttaṃ ‘‘saddhājāto upasaṅkamati, upasaṅkamanto payirupāsatī’’tiādi (ma. ni. 2.183)."
    ],
    "innerText": "Idāni yena kāraṇena tesaṃ ariyānaṃ dassanādi bahūpakāranti vuttaṃ, taṃ dassetuṃ ‘‘tathārūpe’’tiādimāha. Tattha tathārūpeti tādise sīlādiguṇasampanne ariye. Yasmā dassanasavanānussaraṇāni upasaṅkamanapayirupāsanaṭṭhānāni, tasmā tāni anāmasitvā upasaṅkamanapayirupāsanāniyeva dassetuṃ ‘‘sevato bhajato payirupāsato’’ti vuttaṃ . Dassanasavanānussaraṇato hi ariyesu uppannasaddho te upasaṅkamitvā payirupāsitvā pañhaṃ pucchitvā laddhasavanānuttariyo aparipūre sīlādiguṇe paripūressatīti. Tathā hi vuttaṃ ‘‘saddhājāto upasaṅkamati, upasaṅkamanto payirupāsatī’’tiādi (ma. ni. 2.183)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sevato"
      },
      "ti vattapaṭivattakaraṇavasena kālena kālaṃ upasaṅkamato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhajato"
      },
      "ti ",
      " sampiyāyanabhattivasena bhajato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Payirupāsato"
      },
      "ti pañhapucchanena paṭipattianukaraṇena ca payirupāsatoti tiṇṇaṃ padānaṃ atthavibhāgo dīpetabbo. Vimuttiñāṇadassanassa pāripūri ekūnavīsatimassa paccavekkhaṇañāṇassa uppattiyā veditabbā."
    ],
    "innerText": "Tattha sevatoti vattapaṭivattakaraṇavasena kālena kālaṃ upasaṅkamato. Bhajatoti sampiyāyanabhattivasena bhajato. Payirupāsatoti pañhapucchanena paṭipattianukaraṇena ca payirupāsatoti tiṇṇaṃ padānaṃ atthavibhāgo dīpetabbo. Vimuttiñāṇadassanassa pāripūri ekūnavīsatimassa paccavekkhaṇañāṇassa uppattiyā veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evarūpā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ca te, bhikkhave, bhikkhū"
      },
      "tiādīsu ye yathāvuttaguṇasamannāgamena evarūpā edisā bhinnasabbakilesā bhikkhū, te diṭṭhadhammikādihitesu sattānaṃ niyojanavasena anusāsanato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "satthāro"
      },
      "tipi vuccanti. Jātikantārādinittharaṇato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "satthavāhā"
      },
      "tipi, rāgādiraṇānaṃ jahanato jahāpanato ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "raṇañjahā"
      },
      "tipi, avijjātamassa vinodanato vinodāpanato ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tamonudā"
      },
      "tipi, saparasantānesu paññāālokapaññāobhāsapaññāpajjotānaṃ karaṇena nibbattanena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ālokādikarā"
      },
      "tipi, tathā ñāṇukkāñāṇappabhādhammukkādhammappabhānaṃ dhāraṇena karaṇena ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ukkādhārā"
      },
      "tipi, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pabhaṅkarā"
      },
      "tipi, ārakattā kilesehi, anaye na iriyanato, aye ca iriyanato paresaṃ tathābhāvahetubhāvato, sadevakena lokena araṇīyato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ariyā"
      },
      "tipi, paññācakkhudhammacakkhūnaṃ sātisayapaṭilābhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cakkhumanto"
      },
      "tipi vuccanti."
    ],
    "innerText": "Evarūpāca te, bhikkhave, bhikkhūtiādīsu ye yathāvuttaguṇasamannāgamena evarūpā edisā bhinnasabbakilesā bhikkhū, te diṭṭhadhammikādihitesu sattānaṃ niyojanavasena anusāsanato satthārotipi vuccanti. Jātikantārādinittharaṇato satthavāhātipi, rāgādiraṇānaṃ jahanato jahāpanato ca raṇañjahātipi, avijjātamassa vinodanato vinodāpanato ca tamonudātipi, saparasantānesu paññāālokapaññāobhāsapaññāpajjotānaṃ karaṇena nibbattanena ālokādikarātipi, tathā ñāṇukkāñāṇappabhādhammukkādhammappabhānaṃ dhāraṇena karaṇena ca ukkādhārātipi, pabhaṅkarātipi, ārakattā kilesehi, anaye na iriyanato, aye ca iriyanato paresaṃ tathābhāvahetubhāvato, sadevakena lokena araṇīyato ariyātipi, paññācakkhudhammacakkhūnaṃ sātisayapaṭilābhena cakkhumantotipi vuccanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Gāthāsu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pāmojjakaraṇaṃ ṭhāna"
      },
      "nti nirāmisassa pamodassa nibbattakaṃ ṭhānaṃ kāraṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Eta"
      },
      "nti idāni vattabbanidassanaṃ sandhāya vadati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vijānata"
      },
      "nti saṃkilesavodāne yāthāvato jānantānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhāvitattāna"
      },
      "nti bhāvitasabhāvānaṃ, kāyabhāvanādīhi bhāvitasantānānanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammajīvina"
      },
      "nti micchājīvaṃ pahāya dhammena ñāyena jīvikakappanato, dhammena vā ñāyena attabhāvassa pavattanato, samāpattibahulatāya vā aggaphaladhammena jīvanato dhammajīvinaṃ. Ayañhettha saṅkhepattho – yadidaṃ bhāvitattānaṃ pariniṭṭhitasamādhipaññābhāvanānaṃ tato eva dhammajīvinaṃ ariyānaṃ dassanaṃ ",
      ". Etaṃ avippaṭisāranimittānaṃ sīlādīnaṃ pāripūrihetubhāvato vijānataṃ sappaññajātikānaṃ ",
      " ekanteneva pītipāmojjakāraṇanti."
    ],
    "innerText": "Gāthāsu pāmojjakaraṇaṃ ṭhānanti nirāmisassa pamodassa nibbattakaṃ ṭhānaṃ kāraṇaṃ. Etanti idāni vattabbanidassanaṃ sandhāya vadati. Vijānatanti saṃkilesavodāne yāthāvato jānantānaṃ. Bhāvitattānanti bhāvitasabhāvānaṃ, kāyabhāvanādīhi bhāvitasantānānanti attho. Dhammajīvinanti micchājīvaṃ pahāya dhammena ñāyena jīvikakappanato, dhammena vā ñāyena attabhāvassa pavattanato, samāpattibahulatāya vā aggaphaladhammena jīvanato dhammajīvinaṃ. Ayañhettha saṅkhepattho – yadidaṃ bhāvitattānaṃ pariniṭṭhitasamādhipaññābhāvanānaṃ tato eva dhammajīvinaṃ ariyānaṃ dassanaṃ . Etaṃ avippaṭisāranimittānaṃ sīlādīnaṃ pāripūrihetubhāvato vijānataṃ sappaññajātikānaṃ ekanteneva pītipāmojjakāraṇanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni taṃ tassa kāraṇabhāvaṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘te jotayantī’’"
      },
      "ti osānagāthādvayamāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "te"
      },
      "ti te bhāvitattā dhammajīvino ariyā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jotayantī"
      },
      "ti pakāsayanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhāsayantī"
      },
      "ti saddhammobhāsena lokaṃ pabhāsayanti, dhammaṃ desentīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yesa"
      },
      "nti yesaṃ ariyānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sāsana"
      },
      "nti ovādaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammadaññāyā"
      },
      "ti pubbabhāgañāṇehi sammadeva jānitvā. Sesaṃ vuttanayameva."
    ],
    "innerText": "Idāni taṃ tassa kāraṇabhāvaṃ dassetuṃ ‘‘te jotayantī’’ti osānagāthādvayamāha. Tattha teti te bhāvitattā dhammajīvino ariyā. Jotayantīti pakāsayanti. Bhāsayantīti saddhammobhāsena lokaṃ pabhāsayanti, dhammaṃ desentīti attho. Yesanti yesaṃ ariyānaṃ. Sāsananti ovādaṃ. Sammadaññāyāti pubbabhāgañāṇehi sammadeva jānitvā. Sesaṃ vuttanayameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pañcamasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Taṇhuppādasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "105"
      },
      ". Chaṭṭhe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "taṇhuppādā"
      },
      "ti ettha uppajjati etesūti uppādā. Kā uppajjati? Taṇhā. Taṇhāya uppādā taṇhuppādā, taṇhāvatthūni taṇhākāraṇānīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yatthā"
      },
      "ti yesu nimittabhūtesu ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uppajjamānā"
      },
      "ti uppajjanasīlā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cīvarahetū"
      },
      "ti ‘‘kattha manāpaṃ cīvaraṃ labhissāmī’’ti cīvarakāraṇā uppajjati. Sesapadesupi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Itibhavābhavahetū"
      },
      "ti ettha pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "itī"
      },
      "ti nidassanatthe nipāto. Yathā cīvarādihetu, evaṃ bhavābhavahetupīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhavābhavā"
      },
      "ti cettha paṇītappaṇītāni sappinavanītādīni adhippetāni bhavati ārogyaṃ etenāti katvā. ‘‘Sampattibhavesu paṇītappaṇītataro bhavābhavo’’tipi vadanti. Bhavoti vā sampatti, abhavoti vipatti. Bhavoti vuḍḍhi, abhavoti hāni. Taṃ nimittañca taṇhā uppajjatīti vuttaṃ ‘‘bhavābhavahetu vā’’ti."
    ],
    "innerText": "105. Chaṭṭhe taṇhuppādāti ettha uppajjati etesūti uppādā. Kā uppajjati? Taṇhā. Taṇhāya uppādā taṇhuppādā, taṇhāvatthūni taṇhākāraṇānīti attho. Yatthāti yesu nimittabhūtesu . Uppajjamānāti uppajjanasīlā. Cīvarahetūti ‘‘kattha manāpaṃ cīvaraṃ labhissāmī’’ti cīvarakāraṇā uppajjati. Sesapadesupi eseva nayo. Itibhavābhavahetūti ettha pana itīti nidassanatthe nipāto. Yathā cīvarādihetu, evaṃ bhavābhavahetupīti attho. Bhavābhavāti cettha paṇītappaṇītāni sappinavanītādīni adhippetāni bhavati ārogyaṃ etenāti katvā. ‘‘Sampattibhavesu paṇītappaṇītataro bhavābhavo’’tipi vadanti. Bhavoti vā sampatti, abhavoti vipatti. Bhavoti vuḍḍhi, abhavoti hāni. Taṃ nimittañca taṇhā uppajjatīti vuttaṃ ‘‘bhavābhavahetu vā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Gāthā heṭṭhā vuttatthā eva. Apica ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "taṇhādutiyo"
      },
      "ti taṇhāsahāyo. Ayañhi satto anamatagge saṃsāravaṭṭe saṃsaranto na ekakova saṃsarati, taṇhaṃ pana dutiyikaṃ sahāyikaṃ labhitvāva saṃsarati. Tathā hi taṃ papātapātaṃ acintetvā madhugaṇhanakaluddakaṃ viya ",
      " anekādīnavākulesupi bhavesu ānisaṃsameva dassentī anatthajāle sā paribbhamāpeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etamādīnavaṃ ñatvā"
      },
      "ti etaṃ atītānāgatapaccuppannesu khandhesu ",
      " itthabhāvaññathābhāvasaññitaṃ ādīnavaṃ jānitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṇhaṃ dukkhassa sambhava"
      },
      "nti ‘‘taṇhā cāyaṃ vaṭṭadukkhassa sambhavo pabhavo kāraṇa’’nti jānitvā. Ettāvatā ca ekassa bhikkhuno vipassanaṃ vaḍḍhetvā arahattuppatti dassitā. Idāni taṃ khīṇāsavaṃ thomento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘vītataṇho’’"
      },
      "tiādimāha. Yaṃ panettha avuttaṃ, taṃ heṭṭhā vuttanayameva."
    ],
    "innerText": "Gāthā heṭṭhā vuttatthā eva. Apica taṇhādutiyoti taṇhāsahāyo. Ayañhi satto anamatagge saṃsāravaṭṭe saṃsaranto na ekakova saṃsarati, taṇhaṃ pana dutiyikaṃ sahāyikaṃ labhitvāva saṃsarati. Tathā hi taṃ papātapātaṃ acintetvā madhugaṇhanakaluddakaṃ viya anekādīnavākulesupi bhavesu ānisaṃsameva dassentī anatthajāle sā paribbhamāpeti. Etamādīnavaṃ ñatvāti etaṃ atītānāgatapaccuppannesu khandhesu itthabhāvaññathābhāvasaññitaṃ ādīnavaṃ jānitvā. Taṇhaṃ dukkhassa sambhavanti ‘‘taṇhā cāyaṃ vaṭṭadukkhassa sambhavo pabhavo kāraṇa’’nti jānitvā. Ettāvatā ca ekassa bhikkhuno vipassanaṃ vaḍḍhetvā arahattuppatti dassitā. Idāni taṃ khīṇāsavaṃ thomento ‘‘vītataṇho’’tiādimāha. Yaṃ panettha avuttaṃ, taṃ heṭṭhā vuttanayameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Chaṭṭhasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Sabrahmakasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "106"
      },
      ". Sattame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sabrahmakānī"
      },
      "ti saseṭṭhakāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yesa"
      },
      "nti yesaṃ kulānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puttāna"
      },
      "nti puttehi pūjitasaddayogena hi idaṃ karaṇatthe sāmivacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ajjhāgāre"
      },
      "ti sake ghare. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pūjitā hontī"
      },
      "ti yaṃ ghare atthi, tena paṭijaggitā manāpena ceva kāyikavācasikena ca paccupaṭṭhitā honti. Iti mātāpitupūjakāni kulāni ‘‘sabrahmakānī’’ti pasaṃsitvā uparipi nesaṃ pasaṃsanīyataṃ dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sapubbadevatānī’’"
      },
      "tiādimāha."
    ],
    "innerText": "106. Sattame sabrahmakānīti saseṭṭhakāni. Yesanti yesaṃ kulānaṃ. Puttānanti puttehi pūjitasaddayogena hi idaṃ karaṇatthe sāmivacanaṃ. Ajjhāgāreti sake ghare. Pūjitā hontīti yaṃ ghare atthi, tena paṭijaggitā manāpena ceva kāyikavācasikena ca paccupaṭṭhitā honti. Iti mātāpitupūjakāni kulāni ‘‘sabrahmakānī’’ti pasaṃsitvā uparipi nesaṃ pasaṃsanīyataṃ dassento ‘‘sapubbadevatānī’’tiādimāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "brahmā"
      },
      "tiādīni tesaṃ brahmādibhāvasādhanatthaṃ vuttāni. Tatrāyamatthavibhāvanā – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "brahmā"
      },
      "ti seṭṭhādhivacanaṃ. Yathā hi brahmuno catasso bhāvanā avijahitā honti mettā, karuṇā, muditā, upekkhāti, evaṃ mātāpitūnaṃ puttesu catasso bhāvanā avijahitā honti. Tā tasmiṃ tasmiṃ kāle ",
      " veditabbā – kucchigatasmiñhi dārake ‘‘kadā na kho puttakaṃ arogaṃ paripuṇṇaṅgapaccaṅgaṃ passissāmā’’ti mātāpitūnaṃ mettacittaṃ uppajjati. Yadā panesa mando uttānaseyyako ūkāhi vā maṅkulehi vā daṭṭho dukkhaseyyāya vā pīḷito parodati viravati, tadāssa saddaṃ sutvā mātāpitūnaṃ kāruññaṃ uppajjati. Ādhāvitvā vidhāvitvā kīḷanakāle pana lobhanīyavayasmiṃ vā ṭhitakāle dārakaṃ ",
      " oloketvā mātāpitūnaṃ cittaṃ sappimaṇḍe pakkhittasatavihatakappāsapicupaṭalaṃ viya mudukaṃ āmoditaṃ pamoditaṃ, tadā nesaṃ muditā labbhati. Yadā pana tesaṃ putto dārabharaṇaṃ paccupaṭṭhapetvā pāṭiyekkaṃ agāraṃ ajjhāvasati, tadā mātāpitūnaṃ ‘‘sakkoti dāni no puttako attano dhammatāya jīvitu’’nti majjhattabhāvo ",
      " uppajjati. Evaṃ tasmiṃ kāle upekkhā labbhati. Evaṃ mātāpitūnaṃ puttesu yathākālaṃ catubbidhassapi brahmavihārassa labbhanato brahmasadisavuttitāya vuttaṃ ‘‘brahmāti, bhikkhave, mātāpitūnaṃ etaṃ adhivacana’’nti."
    ],
    "innerText": "Tattha brahmātiādīni tesaṃ brahmādibhāvasādhanatthaṃ vuttāni. Tatrāyamatthavibhāvanā – brahmāti seṭṭhādhivacanaṃ. Yathā hi brahmuno catasso bhāvanā avijahitā honti mettā, karuṇā, muditā, upekkhāti, evaṃ mātāpitūnaṃ puttesu catasso bhāvanā avijahitā honti. Tā tasmiṃ tasmiṃ kāle veditabbā – kucchigatasmiñhi dārake ‘‘kadā na kho puttakaṃ arogaṃ paripuṇṇaṅgapaccaṅgaṃ passissāmā’’ti mātāpitūnaṃ mettacittaṃ uppajjati. Yadā panesa mando uttānaseyyako ūkāhi vā maṅkulehi vā daṭṭho dukkhaseyyāya vā pīḷito parodati viravati, tadāssa saddaṃ sutvā mātāpitūnaṃ kāruññaṃ uppajjati. Ādhāvitvā vidhāvitvā kīḷanakāle pana lobhanīyavayasmiṃ vā ṭhitakāle dārakaṃ oloketvā mātāpitūnaṃ cittaṃ sappimaṇḍe pakkhittasatavihatakappāsapicupaṭalaṃ viya mudukaṃ āmoditaṃ pamoditaṃ, tadā nesaṃ muditā labbhati. Yadā pana tesaṃ putto dārabharaṇaṃ paccupaṭṭhapetvā pāṭiyekkaṃ agāraṃ ajjhāvasati, tadā mātāpitūnaṃ ‘‘sakkoti dāni no puttako attano dhammatāya jīvitu’’nti majjhattabhāvo uppajjati. Evaṃ tasmiṃ kāle upekkhā labbhati. Evaṃ mātāpitūnaṃ puttesu yathākālaṃ catubbidhassapi brahmavihārassa labbhanato brahmasadisavuttitāya vuttaṃ ‘‘brahmāti, bhikkhave, mātāpitūnaṃ etaṃ adhivacana’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pubbadevatā"
      },
      "ti ettha devā nāma tividhā – sammutidevā, upapattidevā, visuddhidevāti. Tesu sammutidevā nāma rājāno khattiyā. Te hi ‘‘devo, devī’’ti loke voharīyanti, devā viya lokassa niggahānuggahasamatthā ca honti. Upapattidevā nāma cātumahārājikato paṭṭhāya yāva bhavaggā uppannā sattā. Visuddhidevā nāma khīṇāsavā sabbakilesavisuddhito. Tatrāyaṃ vacanattho – dibbanti, kīḷanti, laḷanti, jotanti paṭipakkhaṃ jayanti vāti devā. Tesu sabbaseṭṭhā visuddhidevā. Yathā te bālajanehi kataṃ aparādhaṃ agaṇetvā ekanteneva tesaṃ anatthahāniṃ atthuppattiñca ākaṅkhantāva yathāvuttabrahmavihārayogena atthāya hitāya sukhāya paṭipajjanti, dakkhiṇeyyatāya ca tesaṃ kārānaṃ mahapphalataṃ mahānisaṃsatañca āvahanti; evameva mātāpitaropi puttānaṃ aparādhaṃ agaṇetvā ekanteneva tesaṃ anatthahāniṃ atthuppattiñca ākaṅkhantā vuttanayeneva catubbidhassapi brahmavihārassa labbhanato atthāya hitāya sukhāya paṭipajjantā paramadakkhiṇeyyā hutvā attani katānaṃ kārānaṃ mahapphalataṃ mahānisaṃsatañca āvahanti. Sabbadevehi ca paṭhamaṃ tesaṃ upakāravantatāya te āditoyeva devā. Tesañhi vasena te paṭhamaṃ aññe deve ‘‘devā’’ti jānanti ārādhenti payirupāsanti, ārādhanavidhiṃ ñatvā tathā paṭipajjantā tassā paṭipattiyā phalaṃ adhigacchanti, tasmā te ",
      " pacchādevā nāma. Tena vuttaṃ ‘‘pubbadevatāti, bhikkhave, mātāpitūnaṃ etaṃ adhivacana’’nti."
    ],
    "innerText": "Pubbadevatāti ettha devā nāma tividhā – sammutidevā, upapattidevā, visuddhidevāti. Tesu sammutidevā nāma rājāno khattiyā. Te hi ‘‘devo, devī’’ti loke voharīyanti, devā viya lokassa niggahānuggahasamatthā ca honti. Upapattidevā nāma cātumahārājikato paṭṭhāya yāva bhavaggā uppannā sattā. Visuddhidevā nāma khīṇāsavā sabbakilesavisuddhito. Tatrāyaṃ vacanattho – dibbanti, kīḷanti, laḷanti, jotanti paṭipakkhaṃ jayanti vāti devā. Tesu sabbaseṭṭhā visuddhidevā. Yathā te bālajanehi kataṃ aparādhaṃ agaṇetvā ekanteneva tesaṃ anatthahāniṃ atthuppattiñca ākaṅkhantāva yathāvuttabrahmavihārayogena atthāya hitāya sukhāya paṭipajjanti, dakkhiṇeyyatāya ca tesaṃ kārānaṃ mahapphalataṃ mahānisaṃsatañca āvahanti; evameva mātāpitaropi puttānaṃ aparādhaṃ agaṇetvā ekanteneva tesaṃ anatthahāniṃ atthuppattiñca ākaṅkhantā vuttanayeneva catubbidhassapi brahmavihārassa labbhanato atthāya hitāya sukhāya paṭipajjantā paramadakkhiṇeyyā hutvā attani katānaṃ kārānaṃ mahapphalataṃ mahānisaṃsatañca āvahanti. Sabbadevehi ca paṭhamaṃ tesaṃ upakāravantatāya te āditoyeva devā. Tesañhi vasena te paṭhamaṃ aññe deve ‘‘devā’’ti jānanti ārādhenti payirupāsanti, ārādhanavidhiṃ ñatvā tathā paṭipajjantā tassā paṭipattiyā phalaṃ adhigacchanti, tasmā te pacchādevā nāma. Tena vuttaṃ ‘‘pubbadevatāti, bhikkhave, mātāpitūnaṃ etaṃ adhivacana’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pubbācariyā"
      },
      "ti paṭhamaācariyā. Mātāpitaro hi putte sikkhāpentā atitaruṇakālato paṭṭhāya ‘‘evaṃ nisīda, evaṃ gaccha, evaṃ tiṭṭha, evaṃ saya, evaṃ khāda, evaṃ bhuñja, ayaṃ te ",
      " ‘tātā’ti vattabbo, ayaṃ ‘bhātikā’ti, ayaṃ ‘bhaginī’ti, idaṃ nāma kātuṃ vaṭṭati, idaṃ na vaṭṭati, asukaṃ nāma upasaṅkamituṃ vaṭṭati, asukaṃ nāma na vaṭṭatī’’ti gāhenti sikkhāpenti. Aparabhāge aññe ācariyāpi sippaṃ muddaṃ gaṇananti evamādiṃ sikkhāpenti, aññe saraṇāni denti, sīlesu patiṭṭhāpenti, pabbājenti ",
      ", dhammaṃ uggaṇhāpenti, upasampādenti, sotāpattimaggādīni pāpenti. Iti sabbepi te pacchāācariyā nāma. Mātāpitaro pana sabbapaṭhamaṃ. Tenāha ‘‘pubbācariyāti, bhikkhave, mātāpitūnaṃ etaṃ adhivacana’’nti."
    ],
    "innerText": "Pubbācariyāti paṭhamaācariyā. Mātāpitaro hi putte sikkhāpentā atitaruṇakālato paṭṭhāya ‘‘evaṃ nisīda, evaṃ gaccha, evaṃ tiṭṭha, evaṃ saya, evaṃ khāda, evaṃ bhuñja, ayaṃ te ‘tātā’ti vattabbo, ayaṃ ‘bhātikā’ti, ayaṃ ‘bhaginī’ti, idaṃ nāma kātuṃ vaṭṭati, idaṃ na vaṭṭati, asukaṃ nāma upasaṅkamituṃ vaṭṭati, asukaṃ nāma na vaṭṭatī’’ti gāhenti sikkhāpenti. Aparabhāge aññe ācariyāpi sippaṃ muddaṃ gaṇananti evamādiṃ sikkhāpenti, aññe saraṇāni denti, sīlesu patiṭṭhāpenti, pabbājenti , dhammaṃ uggaṇhāpenti, upasampādenti, sotāpattimaggādīni pāpenti. Iti sabbepi te pacchāācariyā nāma. Mātāpitaro pana sabbapaṭhamaṃ. Tenāha ‘‘pubbācariyāti, bhikkhave, mātāpitūnaṃ etaṃ adhivacana’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āhuneyyā"
      },
      "ti ānetvā hunitabbanti āhunaṃ, dūratopi ānetvā phalavisesaṃ ākaṅkhantena guṇavantesu dātabbānaṃ annapānavatthacchādanādīnaṃ etaṃ nāmaṃ, upakārakhettatāya taṃ āhunaṃ arahantīti āhuneyyā. Tena vuttaṃ ‘‘āhuneyyāti, bhikkhave, mātāpitūnaṃ etaṃ adhivacana’’nti."
    ],
    "innerText": "Āhuneyyāti ānetvā hunitabbanti āhunaṃ, dūratopi ānetvā phalavisesaṃ ākaṅkhantena guṇavantesu dātabbānaṃ annapānavatthacchādanādīnaṃ etaṃ nāmaṃ, upakārakhettatāya taṃ āhunaṃ arahantīti āhuneyyā. Tena vuttaṃ ‘‘āhuneyyāti, bhikkhave, mātāpitūnaṃ etaṃ adhivacana’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni tesaṃ brahmādibhāve kāraṇaṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘taṃ kissa hetu? Bahukārā’’"
      },
      "tiādi vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃ kissa hetū"
      },
      "ti taṃ mātāpitūnaṃ brahmādiadhivacanaṃ kena kāraṇenāti ceti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bahukārā"
      },
      "ti bahūpakārā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āpādakā"
      },
      "ti jīvitassa āpādakā, pālakā. Puttānañhi mātāpitūhi jīvitaṃ āpāditaṃ pālitaṃ ghaṭitaṃ anuppabandhena pavattitaṃ sampāditaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Posakā"
      },
      "ti hatthapāde vaḍḍhetvā hadayalohitaṃ pāyetvā posetāro. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Imassa lokassa dassetāro"
      },
      "ti puttānaṃ imasmiṃ loke iṭṭhāniṭṭhārammaṇadassanaṃ nāma mātāpitaro nissāya jātanti te nesaṃ imassa lokassa dassetāro nāma. Iti tesaṃ bahukārattaṃ brahmādibhāvassa kāraṇaṃ dassitaṃ, yena putto mātāpitūnaṃ ",
      " lokiyena upakārena kenaci pariyāyena pariyantaṃ paṭikāraṃ kātuṃ na samatthoyeva. Sace hi putto ‘‘mātāpitūnaṃ upakārassa paccupakāraṃ karissāmī’’ti uṭṭhāya samuṭṭhāya vāyamanto dakkhiṇe aṃsakūṭe mātaraṃ, itarasmiṃ pitaraṃ ṭhapetvā vassasatāyuko sakalaṃ vassasatampi parihareyya catūhi paccayehi ucchādanaparimaddananhāpanasambāhanādīhi ca yathāruci upaṭṭhahanto tesaṃ muttakarīsampi ajigucchanto, na ettāvatā puttena mātāpitūnaṃ paṭikāro kato hoti aññatra saddhādiguṇavisese patiṭṭhāpanā. Vuttañhetaṃ bhagavatā –"
    ],
    "innerText": "Idāni tesaṃ brahmādibhāve kāraṇaṃ dassetuṃ ‘‘taṃ kissa hetu? Bahukārā’’tiādi vuttaṃ. Taṃ kissa hetūti taṃ mātāpitūnaṃ brahmādiadhivacanaṃ kena kāraṇenāti ceti attho. Bahukārāti bahūpakārā. Āpādakāti jīvitassa āpādakā, pālakā. Puttānañhi mātāpitūhi jīvitaṃ āpāditaṃ pālitaṃ ghaṭitaṃ anuppabandhena pavattitaṃ sampāditaṃ. Posakāti hatthapāde vaḍḍhetvā hadayalohitaṃ pāyetvā posetāro. Imassa lokassa dassetāroti puttānaṃ imasmiṃ loke iṭṭhāniṭṭhārammaṇadassanaṃ nāma mātāpitaro nissāya jātanti te nesaṃ imassa lokassa dassetāro nāma. Iti tesaṃ bahukārattaṃ brahmādibhāvassa kāraṇaṃ dassitaṃ, yena putto mātāpitūnaṃ lokiyena upakārena kenaci pariyāyena pariyantaṃ paṭikāraṃ kātuṃ na samatthoyeva. Sace hi putto ‘‘mātāpitūnaṃ upakārassa paccupakāraṃ karissāmī’’ti uṭṭhāya samuṭṭhāya vāyamanto dakkhiṇe aṃsakūṭe mātaraṃ, itarasmiṃ pitaraṃ ṭhapetvā vassasatāyuko sakalaṃ vassasatampi parihareyya catūhi paccayehi ucchādanaparimaddananhāpanasambāhanādīhi ca yathāruci upaṭṭhahanto tesaṃ muttakarīsampi ajigucchanto, na ettāvatā puttena mātāpitūnaṃ paṭikāro kato hoti aññatra saddhādiguṇavisese patiṭṭhāpanā. Vuttañhetaṃ bhagavatā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Dvinnāhaṃ, bhikkhave, na suppaṭikāraṃ vadāmi. Katamesaṃ dvinnaṃ? Mātu ca pitu ca. Ekena, bhikkhave, aṃsena mātaraṃ parihareyya, ekena aṃsena pitaraṃ parihareyya vassasatāyuko vassasatajīvī, so ca nesaṃ ucchādanaparimaddananhāpanasambāhanena, te ca tattheva muttakarīsaṃ cajeyyuṃ, na tveva, bhikkhave, mātāpitūnaṃ kataṃ ",
      " vā hoti paṭikataṃ vā ",
      ". Imissā ca, bhikkhave, mahāpathaviyā pahūtarattaratanāya mātāpitaro issariyādhipacce rajje patiṭṭhāpeyya, na tveva, bhikkhave, mātāpitūnaṃ kataṃ vā hoti paṭikataṃ vā. Taṃ kissa hetu? Bahukārā, bhikkhave, mātāpitaro puttānaṃ āpādakā posakā imassa lokassa dassetāro."
    ],
    "innerText": "‘‘Dvinnāhaṃ, bhikkhave, na suppaṭikāraṃ vadāmi. Katamesaṃ dvinnaṃ? Mātu ca pitu ca. Ekena, bhikkhave, aṃsena mātaraṃ parihareyya, ekena aṃsena pitaraṃ parihareyya vassasatāyuko vassasatajīvī, so ca nesaṃ ucchādanaparimaddananhāpanasambāhanena, te ca tattheva muttakarīsaṃ cajeyyuṃ, na tveva, bhikkhave, mātāpitūnaṃ kataṃ vā hoti paṭikataṃ vā . Imissā ca, bhikkhave, mahāpathaviyā pahūtarattaratanāya mātāpitaro issariyādhipacce rajje patiṭṭhāpeyya, na tveva, bhikkhave, mātāpitūnaṃ kataṃ vā hoti paṭikataṃ vā. Taṃ kissa hetu? Bahukārā, bhikkhave, mātāpitaro puttānaṃ āpādakā posakā imassa lokassa dassetāro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Yo ca kho, bhikkhave, mātāpitaro assaddhe saddhāsampadāya samādapeti niveseti patiṭṭhāpeti. Dussīle sīlasampadāya, maccharino cāgasampadāya, duppaññe paññāsampadāya samādapeti niveseti patiṭṭhāpeti. Ettāvatā kho, bhikkhave, mātāpitūnaṃ katañca hoti paṭikatañcā’’ti (a. ni. 2.34)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tathā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Mātāpituupaṭṭhānaṃ, puttadārassa saṅgaho’’ti; (Khu. pā. 5.6);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "‘‘Mātāpituupaṭṭhānaṃ, bhikkhave, paṇḍitapaññatta’’nti ca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Evamādīni mātāpitūnaṃ puttassa bahūpakārabhāvasādhakāni suttāni daṭṭhabbāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Gāthāsu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vuccare"
      },
      "ti vuccanti kathīyanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pajāya anukampakā"
      },
      "ti paresaṃ pāṇaṃ chinditvāpi attano santakaṃ yaṃkiñci cajitvāpi attano pajaṃ paṭijagganti gopayanti, tasmā pajāya attano puttānaṃ anukampakā anuggāhakā."
    ],
    "innerText": "Gāthāsu vuccareti vuccanti kathīyanti. Pajāya anukampakāti paresaṃ pāṇaṃ chinditvāpi attano santakaṃ yaṃkiñci cajitvāpi attano pajaṃ paṭijagganti gopayanti, tasmā pajāya attano puttānaṃ anukampakā anuggāhakā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Namasseyyā"
      },
      "ti ",
      " sāyaṃ pātaṃ upaṭṭhānaṃ gantvā ‘‘idaṃ mayhaṃ uttamaṃ puññakkhetta’’nti namakkāraṃ kareyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sakkareyyā"
      },
      "ti sakkārena paṭimāneyya. Idāni taṃ sakkāraṃ dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘annenā’’"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "annenā"
      },
      "ti yāgubhattakhādanīyena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pānenā"
      },
      "ti aṭṭhavidhapānena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vatthenā"
      },
      "ti nivāsanapārupanena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sayanenā"
      },
      "ti mañcapīṭhabhisibimbohanādinā sayanena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ucchādanenā"
      },
      "ti duggandhaṃ paṭivinodetvā sugandhakaraṇucchādanena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nhānenā"
      },
      "ti sītakāle uṇhodakena, uṇhakāle sītodakena gattāni parisiñcitvā nhāpanena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pādānaṃ dhovanena cā"
      },
      "ti uṇhodakasītodakehi pādadhovanena ceva telamakkhanena ca."
    ],
    "innerText": "Namasseyyāti sāyaṃ pātaṃ upaṭṭhānaṃ gantvā ‘‘idaṃ mayhaṃ uttamaṃ puññakkhetta’’nti namakkāraṃ kareyya. Sakkareyyāti sakkārena paṭimāneyya. Idāni taṃ sakkāraṃ dassento ‘‘annenā’’tiādimāha. Tattha annenāti yāgubhattakhādanīyena. Pānenāti aṭṭhavidhapānena. Vatthenāti nivāsanapārupanena. Sayanenāti mañcapīṭhabhisibimbohanādinā sayanena. Ucchādanenāti duggandhaṃ paṭivinodetvā sugandhakaraṇucchādanena. Nhānenāti sītakāle uṇhodakena, uṇhakāle sītodakena gattāni parisiñcitvā nhāpanena. Pādānaṃ dhovanena cāti uṇhodakasītodakehi pādadhovanena ceva telamakkhanena ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tāya"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "naṃ pāricariyāyā"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na"
      },
      "nti nipātamattaṃ, yathāvuttaparicaraṇena. Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pāricariyāyā"
      },
      "ti bharaṇakiccakaraṇakulavaṃsapatiṭṭhāpanādinā pañcavidhaupaṭṭhānena. Vuttañhetaṃ –"
    ],
    "innerText": "Tāyanaṃ pāricariyāyāti ettha nanti nipātamattaṃ, yathāvuttaparicaraṇena. Atha vā pāricariyāyāti bharaṇakiccakaraṇakulavaṃsapatiṭṭhāpanādinā pañcavidhaupaṭṭhānena. Vuttañhetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Pañcahi kho, gahapatiputta, ṭhānehi puttena puratthimā disā mātāpitaro paccupaṭṭhātabbā ‘bhato ne bharissāmi, kiccaṃ nesaṃ karissāmi, kulavaṃsaṃ ṭhapessāmi, dāyajjaṃ paṭipajjissāmi. Atha vā pana nesaṃ petānaṃ kālakatānaṃ dakkhiṇamanuppadassāmī’ti. Imehi kho, gahapatiputta, pañcahi ṭhānehi puttena puratthimā disā mātāpitaro paccupaṭṭhitā pañcahi ṭhānehi puttaṃ anukampanti – pāpā nivārenti, kalyāṇe nivesenti, sippaṃ sikkhāpenti, patirūpena dārena saṃyojenti, samaye dāyajjaṃ niyyādentī’’ti (dī. ni. 3.267)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Apica yo mātāpitaro tīsu vatthūsu abhippasanne katvā sīlesu vā patiṭṭhāpetvā pabbajjāya vā niyojetvā upaṭṭhahati, ayaṃ mātāpituupaṭṭhākānaṃ aggoti veditabbo. Sā panāyaṃ pāricariyā puttassa ubhayalokahitasukhāvahāti dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘idheva naṃ pasaṃsanti, pecca sagge pamodatī’’"
      },
      "ti āha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "idhā"
      },
      "ti imasmiṃ loke. Mātāpituupaṭṭhākañhi puggalaṃ paṇḍitamanussā tattha pāricariyāya pasaṃsanti vaṇṇenti ",
      " thomenti, tassa ca diṭṭhānugatiṃ āpajjantā sayampi attano mātāpitūsu tathā paṭipajjitvā mahantaṃ puññaṃ pasavanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Peccā"
      },
      "ti paralokaṃ gantvā sagge ṭhito mātāpitupaṭṭhāko dibbasampattīhi modati pamodati abhinandatīti."
    ],
    "innerText": "Apica yo mātāpitaro tīsu vatthūsu abhippasanne katvā sīlesu vā patiṭṭhāpetvā pabbajjāya vā niyojetvā upaṭṭhahati, ayaṃ mātāpituupaṭṭhākānaṃ aggoti veditabbo. Sā panāyaṃ pāricariyā puttassa ubhayalokahitasukhāvahāti dassento ‘‘idheva naṃ pasaṃsanti, pecca sagge pamodatī’’ti āha. Tattha idhāti imasmiṃ loke. Mātāpituupaṭṭhākañhi puggalaṃ paṇḍitamanussā tattha pāricariyāya pasaṃsanti vaṇṇenti thomenti, tassa ca diṭṭhānugatiṃ āpajjantā sayampi attano mātāpitūsu tathā paṭipajjitvā mahantaṃ puññaṃ pasavanti. Peccāti paralokaṃ gantvā sagge ṭhito mātāpitupaṭṭhāko dibbasampattīhi modati pamodati abhinandatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sattamasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Bahukārasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "107"
      },
      ". Aṭṭhame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "brāhmaṇagahapatikā"
      },
      "ti brāhmaṇā ceva gahapatikā ca. Ṭhapetvā brāhmaṇe ye keci agāraṃ ajjhāvasantā idha gahapatikāti veditabbā ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ye"
      },
      "ti aniyamato niddiṭṭhaparāmasanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vo"
      },
      "ti upayogabahuvacanaṃ. Ayañhettha saṅkhepattho – bhikkhave, tumhākaṃ bahūpakārā brāhmaṇagahapatikā, ye brāhmaṇā ceva sesaagārikā ca ‘‘tumhe eva amhākaṃ puññakkhettaṃ, yattha mayaṃ uddhaggikaṃ dakkhiṇaṃ patiṭṭhāpema sovaggikaṃ sukhavipākaṃ saggasaṃvattanika’’nti cīvarādīhi paccayehi patiupaṭṭhitāti."
    ],
    "innerText": "107. Aṭṭhame brāhmaṇagahapatikāti brāhmaṇā ceva gahapatikā ca. Ṭhapetvā brāhmaṇe ye keci agāraṃ ajjhāvasantā idha gahapatikāti veditabbā . Yeti aniyamato niddiṭṭhaparāmasanaṃ. Voti upayogabahuvacanaṃ. Ayañhettha saṅkhepattho – bhikkhave, tumhākaṃ bahūpakārā brāhmaṇagahapatikā, ye brāhmaṇā ceva sesaagārikā ca ‘‘tumhe eva amhākaṃ puññakkhettaṃ, yattha mayaṃ uddhaggikaṃ dakkhiṇaṃ patiṭṭhāpema sovaggikaṃ sukhavipākaṃ saggasaṃvattanika’’nti cīvarādīhi paccayehi patiupaṭṭhitāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ ",
      " ‘‘āmisadānena āmisasaṃvibhāgena āmisānuggahena gahaṭṭhā bhikkhūnaṃ upakāravanto’’ti dassetvā idāni dhammadānena dhammasaṃvibhāgena dhammānuggahena bhikkhūnampi tesaṃ upakāravantataṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tumhepi, bhikkhave,’’"
      },
      "tiādi vuttaṃ, taṃ vuttanayameva."
    ],
    "innerText": "Evaṃ ‘‘āmisadānena āmisasaṃvibhāgena āmisānuggahena gahaṭṭhā bhikkhūnaṃ upakāravanto’’ti dassetvā idāni dhammadānena dhammasaṃvibhāgena dhammānuggahena bhikkhūnampi tesaṃ upakāravantataṃ dassetuṃ ‘‘tumhepi, bhikkhave,’’tiādi vuttaṃ, taṃ vuttanayameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Iminā kiṃ kathitaṃ? Piṇḍāpacāyanaṃ nāma kathitaṃ. Ayañhettha adhippāyo – bhikkhave, yasmā ime brāhmaṇagahapatikā neva tumhākaṃ ñātakā, na mittā, na iṇaṃ vā dhārenti, atha kho ‘‘ime samaṇā sammaggatā sammā paṭipannā, ettha no kārā mahapphalā bhavissanti mahānisaṃsā’’ti phalavisesaṃ ākaṅkhantā tumhe cīvarādīhi upaṭṭhahanti. Tasmā taṃ tesaṃ adhippāyaṃ paripūrentā appamādena sampādetha, dhammadesanāpi vo kārakānaṃyeva sobhati, ādeyyā ca hoti, na itaresanti evaṃ sammāpaṭipattiyaṃ appamādo karaṇīyoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evamidaṃ, bhikkhave"
      },
      "tiādīsu ayaṃ saṅkhepattho – bhikkhave, evaṃ iminā vuttappakārena gahaṭṭhapabbajitehi āmisadānadhammadānavasena aññamaññaṃ sannissāya kāmādivasena catubbidhassapi oghassa nittharaṇatthāya ",
      " sakalassapi vaṭṭadukkhassa sammadeva pariyosānakaraṇāya uposathasīlaniyamādivasena catupārisuddhisīlādivasena vā idaṃ sāsanabrahmacariyaṃ maggabrahmacariyañca vussati carīyatīti."
    ],
    "innerText": "Evamidaṃ, bhikkhavetiādīsu ayaṃ saṅkhepattho – bhikkhave, evaṃ iminā vuttappakārena gahaṭṭhapabbajitehi āmisadānadhammadānavasena aññamaññaṃ sannissāya kāmādivasena catubbidhassapi oghassa nittharaṇatthāya sakalassapi vaṭṭadukkhassa sammadeva pariyosānakaraṇāya uposathasīlaniyamādivasena catupārisuddhisīlādivasena vā idaṃ sāsanabrahmacariyaṃ maggabrahmacariyañca vussati carīyatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Gāthāsu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sāgārā"
      },
      "ti gahaṭṭhā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anagārā"
      },
      "ti pariccattaagārā pabbajitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ubho aññoññanissitā"
      },
      "ti te ubhopi aññamaññasannissitā. Sāgārā hi anagārānaṃ dhammadānasannissitā, anagārā ca sāgārānaṃ paccayadānasannissitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ārādhayantī"
      },
      "ti sādhenti sampādenti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddhamma"
      },
      "nti paṭipattisaddhammaṃ paṭivedhasaddhammañca. Tattha yaṃ uttamaṃ, taṃ dassento āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yogakkhemaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anuttara’’"
      },
      "nti arahattaṃ nibbānañca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sāgāresū"
      },
      "ti sāgārehi, nissakke idaṃ bhummavacanaṃ, sāgārānaṃ vā santike. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paccaya"
      },
      "nti vuttāvasesaṃ duvidhaṃ paccayaṃ piṇḍapātaṃ bhesajjañca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parissayavinodana"
      },
      "nti utuparissayādiparissayaharaṇaṃ vihārādiāvasathaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sugata"
      },
      "nti sammā paṭipannaṃ kalyāṇaputhujjanena saddhiṃ aṭṭhavidhaṃ ariyapuggalaṃ. Sāvako hi idha sugatoti adhippeto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gharamesino"
      },
      "ti gharaṃ esino, gehe ṭhatvā gharāvāsaṃ vasantā bhogūpakaraṇāni ceva gahaṭṭhasīlādīni ca esanasīlāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddahāno arahata"
      },
      "nti arahantānaṃ ariyānaṃ vacanaṃ, tesaṃ vā sammāpaṭipattiṃ saddahantā. ‘‘Addhā ime sammā paṭipannā, yathā ime kathenti, tathā paṭipajjantānaṃ sā paṭipatti saggamokkhasampattiyā saṃvattatī’’ti abhisaddahantāti attho. ‘‘Saddahantā’’tipi ",
      " pāṭho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ariyapaññāyā"
      },
      "ti suvisuddhapaññāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jhāyino"
      },
      "ti ārammaṇalakkhaṇūpanijjhānavasena duvidhenapi jhānena jhāyino."
    ],
    "innerText": "Gāthāsu sāgārāti gahaṭṭhā. Anagārāti pariccattaagārā pabbajitā. Ubho aññoññanissitāti te ubhopi aññamaññasannissitā. Sāgārā hi anagārānaṃ dhammadānasannissitā, anagārā ca sāgārānaṃ paccayadānasannissitā. Ārādhayantīti sādhenti sampādenti. Saddhammanti paṭipattisaddhammaṃ paṭivedhasaddhammañca. Tattha yaṃ uttamaṃ, taṃ dassento āha ‘‘yogakkhemaṃanuttara’’nti arahattaṃ nibbānañca. Sāgāresūti sāgārehi, nissakke idaṃ bhummavacanaṃ, sāgārānaṃ vā santike. Paccayanti vuttāvasesaṃ duvidhaṃ paccayaṃ piṇḍapātaṃ bhesajjañca. Parissayavinodananti utuparissayādiparissayaharaṇaṃ vihārādiāvasathaṃ. Sugatanti sammā paṭipannaṃ kalyāṇaputhujjanena saddhiṃ aṭṭhavidhaṃ ariyapuggalaṃ. Sāvako hi idha sugatoti adhippeto. Gharamesinoti gharaṃ esino, gehe ṭhatvā gharāvāsaṃ vasantā bhogūpakaraṇāni ceva gahaṭṭhasīlādīni ca esanasīlāti attho. Saddahāno arahatanti arahantānaṃ ariyānaṃ vacanaṃ, tesaṃ vā sammāpaṭipattiṃ saddahantā. ‘‘Addhā ime sammā paṭipannā, yathā ime kathenti, tathā paṭipajjantānaṃ sā paṭipatti saggamokkhasampattiyā saṃvattatī’’ti abhisaddahantāti attho. ‘‘Saddahantā’’tipi pāṭho. Ariyapaññāyāti suvisuddhapaññāya. Jhāyinoti ārammaṇalakkhaṇūpanijjhānavasena duvidhenapi jhānena jhāyino."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idha dhammaṃ caritvānā"
      },
      "ti imasmiṃ attabhāve, imasmiṃ vā sāsane lokiyalokuttarasukhassa maggabhūtaṃ sīlādidhammaṃ ",
      " paṭipajjitvā yāva parinibbānaṃ na pāpuṇanti, tāvadeva sugatigāmino. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nandino"
      },
      "ti pītisomanassayogena nandanasīlā. Keci pana ‘‘dhammaṃ caritvāna magganti sotāpattimaggaṃ pāpuṇitvā’’ti vadanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Devalokasmi"
      },
      "nti chabbidhepi kāmāvacaradevaloke. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Modanti kāmakāmino"
      },
      "ti yathicchitavatthunipphattito kāmakāmino kāmavanto hutvā pamodantīti."
    ],
    "innerText": "Idha dhammaṃ caritvānāti imasmiṃ attabhāve, imasmiṃ vā sāsane lokiyalokuttarasukhassa maggabhūtaṃ sīlādidhammaṃ paṭipajjitvā yāva parinibbānaṃ na pāpuṇanti, tāvadeva sugatigāmino. Nandinoti pītisomanassayogena nandanasīlā. Keci pana ‘‘dhammaṃ caritvāna magganti sotāpattimaggaṃ pāpuṇitvā’’ti vadanti. Devalokasminti chabbidhepi kāmāvacaradevaloke. Modanti kāmakāminoti yathicchitavatthunipphattito kāmakāmino kāmavanto hutvā pamodantīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Aṭṭhamasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Kuhasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "108"
      },
      ". Navame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kuhā"
      },
      "ti sāmantajappanādinā kuhanavatthunā kuhakā, asantaguṇasambhāvanicchāya kohaññaṃ katvā paresaṃ vimhāpakāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Thaddhā"
      },
      "ti kodhena ca mānena ca thaddhamānasā. ‘‘Kodhano hoti upāyāsabahulo, appampi vutto samāno abhisajjati kuppati byāpajjati patitthīyatī’’ti (a. ni. 3.25; pu. pa. 101) evaṃ vuttena kodhena ca, ‘‘dubbaco hoti dovacassakaraṇehi ",
      " dhammehi samannāgato akkhamo appadakkhiṇaggāhī anusāsani’’nti (ma. ni. 1.181) evaṃ vuttena dovacassena ca, ‘‘jātimado, gottamado, sippamado, ārogyamado, yobbanamado, jīvitamado’’ti (vibha. 832) evaṃ vuttena jātimadādibhedena madena ca garukātabbesu garūsu paramanipaccakāraṃ akatvā ayosalākaṃ gilitvā ṭhitā viya anonatā hutvā vicaraṇakā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lapā"
      },
      "ti upalāpakā micchājīvavasena kulasaṅgāhakā paccayatthaṃ payuttavācāvasena nippesikatāvasena ca lapakāti vā attho."
    ],
    "innerText": "108. Navame kuhāti sāmantajappanādinā kuhanavatthunā kuhakā, asantaguṇasambhāvanicchāya kohaññaṃ katvā paresaṃ vimhāpakāti attho. Thaddhāti kodhena ca mānena ca thaddhamānasā. ‘‘Kodhano hoti upāyāsabahulo, appampi vutto samāno abhisajjati kuppati byāpajjati patitthīyatī’’ti (a. ni. 3.25; pu. pa. 101) evaṃ vuttena kodhena ca, ‘‘dubbaco hoti dovacassakaraṇehi dhammehi samannāgato akkhamo appadakkhiṇaggāhī anusāsani’’nti (ma. ni. 1.181) evaṃ vuttena dovacassena ca, ‘‘jātimado, gottamado, sippamado, ārogyamado, yobbanamado, jīvitamado’’ti (vibha. 832) evaṃ vuttena jātimadādibhedena madena ca garukātabbesu garūsu paramanipaccakāraṃ akatvā ayosalākaṃ gilitvā ṭhitā viya anonatā hutvā vicaraṇakā. Lapāti upalāpakā micchājīvavasena kulasaṅgāhakā paccayatthaṃ payuttavācāvasena nippesikatāvasena ca lapakāti vā attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Siṅgī"
      },
      "ti ‘‘tattha katamaṃ siṅgaṃ? Yaṃ siṅgaṃ siṅgāratā cāturatā cāturiyaṃ parikkhattatā pārikkhattiya’’nti (vibha. 852) evaṃ vuttehi siṅgasadisehi pākaṭakilesehi samannāgatā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Unnaḷā"
      },
      "ti uggatanaḷā, naḷasadisaṃ tucchamānaṃ ukkhipitvā vicaraṇakā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asamāhitā"
      },
      "ti ",
      " cittekaggatāmattassāpi alābhino. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na me te, bhikkhave, bhikkhū māmakā"
      },
      "ti te mayhaṃ bhikkhū mama santakā na honti. Meti idaṃ padaṃ attānaṃ uddissa pabbajitattā bhagavatā vuttaṃ. Yasmā pana ",
      " te kuhanādiyogato na sammā paṭipannā, tasmā ‘‘na māmakā’’ti vuttā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Apagatā"
      },
      "ti yadipi te mama sāsane pabbajitā, yathānusiṭṭhaṃ pana appaṭipajjanato apagatā eva imasmā dhammavinayā, ito te suvidūravidūre ṭhitāti dasseti. Vuttañhetaṃ –"
    ],
    "innerText": "Siṅgīti ‘‘tattha katamaṃ siṅgaṃ? Yaṃ siṅgaṃ siṅgāratā cāturatā cāturiyaṃ parikkhattatā pārikkhattiya’’nti (vibha. 852) evaṃ vuttehi siṅgasadisehi pākaṭakilesehi samannāgatā. Unnaḷāti uggatanaḷā, naḷasadisaṃ tucchamānaṃ ukkhipitvā vicaraṇakā. Asamāhitāti cittekaggatāmattassāpi alābhino. Na me te, bhikkhave, bhikkhū māmakāti te mayhaṃ bhikkhū mama santakā na honti. Meti idaṃ padaṃ attānaṃ uddissa pabbajitattā bhagavatā vuttaṃ. Yasmā pana te kuhanādiyogato na sammā paṭipannā, tasmā ‘‘na māmakā’’ti vuttā. Apagatāti yadipi te mama sāsane pabbajitā, yathānusiṭṭhaṃ pana appaṭipajjanato apagatā eva imasmā dhammavinayā, ito te suvidūravidūre ṭhitāti dasseti. Vuttañhetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Nabhañca dūre pathavī ca dūre,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Pāraṃ samuddassa tadāhu dūre;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Tato have dūrataraṃ vadanti,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Satañca dhammaṃ asatañca rājā’’ti. (a. ni. 4.47; jā. 2.21.414);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vuddhiṃ virūḷhiṃ vepullaṃ āpajjantī"
      },
      "ti sīlādiguṇehi vaḍḍhanavasena vuddhiṃ, tattha niccalabhāvena virūḷhiṃ, sabbattha patthaṭabhāvena sīlādidhammakkhandhapāripūriyā vepullaṃ. Na ca te kuhādisabhāvā bhikkhū āpajjanti, na ca pāpuṇantīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Te kho me, bhikkhave, bhikkhū māmakā"
      },
      "ti idhāpi meti attānaṃ uddissa pabbajitattā vadati, sammā paṭipannattā pana ‘‘māmakā’’ti āha. Vuttavipariyāyena sukkapakkho veditabbo. Tattha yāva ",
      " arahattamaggā virūhanti nāma, arahattaphale pana sampatte virūḷhiṃ vepullaṃ āpannā nāma. Gāthā suviññeyyā eva."
    ],
    "innerText": "Vuddhiṃ virūḷhiṃ vepullaṃ āpajjantīti sīlādiguṇehi vaḍḍhanavasena vuddhiṃ, tattha niccalabhāvena virūḷhiṃ, sabbattha patthaṭabhāvena sīlādidhammakkhandhapāripūriyā vepullaṃ. Na ca te kuhādisabhāvā bhikkhū āpajjanti, na ca pāpuṇantīti attho. Te kho me, bhikkhave, bhikkhū māmakāti idhāpi meti attānaṃ uddissa pabbajitattā vadati, sammā paṭipannattā pana ‘‘māmakā’’ti āha. Vuttavipariyāyena sukkapakkho veditabbo. Tattha yāva arahattamaggā virūhanti nāma, arahattaphale pana sampatte virūḷhiṃ vepullaṃ āpannā nāma. Gāthā suviññeyyā eva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Navamasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Nadīsotasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "109"
      },
      ". Dasame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "seyyathāpī"
      },
      "ti opammadassanatthe nipāto, yathā nāmāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nadiyā sotena ovuyheyyā"
      },
      "ti sīghasotāya hārahāriniyā nadiyā udakavegena heṭṭhato vuyheyya adho hariyetha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Piyarūpasātarūpenā"
      },
      "ti piyasabhāvena sātasabhāvena ca kāraṇabhūtena, tassaṃ nadiyaṃ tassā vā paratīre maṇisuvaṇṇādi aññaṃ vā piyavatthu vittūpakaraṇaṃ atthi, taṃ gahessāmīti nadiyaṃ patitvā sotena avakaḍḍheyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kiñcāpī"
      },
      "ti ",
      " anujānanaasambhāvanatthe nipāto. Kiṃ anujānāti, kiṃ na sambhāveti? Tena purisena adhippetassa piyavatthussa tattha atthibhāvaṃ anujānāti, tathāgamanaṃ pana ādīnavavantatāya na sambhāveti. Idaṃ vuttaṃ hoti – ambho, purisa ",
      ", yadipi tayā adhippetaṃ piyavatthu tattha upalabbhati, evaṃ gamane pana ayamādīnavo, yaṃ tvaṃ heṭṭhā rahadaṃ patvā maraṇaṃ maraṇamattaṃ vā dukkhaṃ pāpuṇeyyāsīti."
    ],
    "innerText": "109. Dasame seyyathāpīti opammadassanatthe nipāto, yathā nāmāti attho. Nadiyā sotena ovuyheyyāti sīghasotāya hārahāriniyā nadiyā udakavegena heṭṭhato vuyheyya adho hariyetha. Piyarūpasātarūpenāti piyasabhāvena sātasabhāvena ca kāraṇabhūtena, tassaṃ nadiyaṃ tassā vā paratīre maṇisuvaṇṇādi aññaṃ vā piyavatthu vittūpakaraṇaṃ atthi, taṃ gahessāmīti nadiyaṃ patitvā sotena avakaḍḍheyya. Kiñcāpīti anujānanaasambhāvanatthe nipāto. Kiṃ anujānāti, kiṃ na sambhāveti? Tena purisena adhippetassa piyavatthussa tattha atthibhāvaṃ anujānāti, tathāgamanaṃ pana ādīnavavantatāya na sambhāveti. Idaṃ vuttaṃ hoti – ambho, purisa , yadipi tayā adhippetaṃ piyavatthu tattha upalabbhati, evaṃ gamane pana ayamādīnavo, yaṃ tvaṃ heṭṭhā rahadaṃ patvā maraṇaṃ maraṇamattaṃ vā dukkhaṃ pāpuṇeyyāsīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atthi cettha heṭṭhā rahado"
      },
      "ti etissā nadiyā heṭṭhā anusotabhāge ativiya gambhīravitthato eko mahāsaro atthi. So ca samantato vātābhighātasamuṭṭhitāhi maṇimayapabbatakūṭasannibhāhi mahatīhi ūmīhi vīcīhi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saūmi,"
      },
      " visamesu bhūmippadesesu savegaṃ anupakkhandantena imissā tāva nadiyā mahoghena tahiṃ tahiṃ āvaṭṭamānavipulajalatāya balavāmukhasadisehi saha āvaṭṭehīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sāvaṭṭo"
      },
      ". Taṃ rahadaṃ otiṇṇasatteyeva attano nibaddhāmisagocare katvā ajjhāvasantena ativiya bhayānakadassanena ghoracetasā dakarakkhasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sagaho sarakkhaso,"
      },
      " caṇḍamacchamakarādinā vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sagaho,"
      },
      " yathāvuttarakkhasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sarakkhaso"
      },
      "."
    ],
    "innerText": "Atthi cettha heṭṭhā rahadoti etissā nadiyā heṭṭhā anusotabhāge ativiya gambhīravitthato eko mahāsaro atthi. So ca samantato vātābhighātasamuṭṭhitāhi maṇimayapabbatakūṭasannibhāhi mahatīhi ūmīhi vīcīhi saūmi, visamesu bhūmippadesesu savegaṃ anupakkhandantena imissā tāva nadiyā mahoghena tahiṃ tahiṃ āvaṭṭamānavipulajalatāya balavāmukhasadisehi saha āvaṭṭehīti sāvaṭṭo. Taṃ rahadaṃ otiṇṇasatteyeva attano nibaddhāmisagocare katvā ajjhāvasantena ativiya bhayānakadassanena ghoracetasā dakarakkhasena sagaho sarakkhaso, caṇḍamacchamakarādinā vā sagaho, yathāvuttarakkhasena sarakkhaso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ya"
      },
      "nti ",
      " evaṃ sappaṭibhayaṃ yaṃ rahadaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ambho purisā"
      },
      "ti ālapanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Maraṇaṃ vā nigacchasī"
      },
      "ti tāhi vā ūmīhi ajjhotthaṭo, tesu vā āvaṭṭesu nipatito sīsaṃ ukkhipituṃ asakkonto tesaṃ vā caṇḍamacchamakarādīnaṃ mukhe nipatito. Tassa vā dakarakkhasassa hatthaṃ gato maraṇaṃ vā gamissasi, atha vā pana āyusese sati tato muccitvā apagacchanto tehi ūmiādīhi janitaghaṭṭitavasena maraṇamattaṃ maraṇappamāṇaṃ dukkhaṃ nigacchasi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭisotaṃ vāyameyyā"
      },
      "ti so pubbe anusotaṃ vuyhamāno tassa purisassa vacanaṃ sutvā ‘‘anattho kira me upaṭṭhito, maccumukhe kirāhaṃ parivattāmī’’ti uppannabalavabhayo sambhamanto diguṇaṃ katvā ussāhaṃ hatthehi ca pādehi ca vāyameyya tareyya, na cireneva tīraṃ sampāpuṇeyya."
    ],
    "innerText": "Yanti evaṃ sappaṭibhayaṃ yaṃ rahadaṃ. Ambho purisāti ālapanaṃ. Maraṇaṃ vā nigacchasīti tāhi vā ūmīhi ajjhotthaṭo, tesu vā āvaṭṭesu nipatito sīsaṃ ukkhipituṃ asakkonto tesaṃ vā caṇḍamacchamakarādīnaṃ mukhe nipatito. Tassa vā dakarakkhasassa hatthaṃ gato maraṇaṃ vā gamissasi, atha vā pana āyusese sati tato muccitvā apagacchanto tehi ūmiādīhi janitaghaṭṭitavasena maraṇamattaṃ maraṇappamāṇaṃ dukkhaṃ nigacchasi. Paṭisotaṃ vāyameyyāti so pubbe anusotaṃ vuyhamāno tassa purisassa vacanaṃ sutvā ‘‘anattho kira me upaṭṭhito, maccumukhe kirāhaṃ parivattāmī’’ti uppannabalavabhayo sambhamanto diguṇaṃ katvā ussāhaṃ hatthehi ca pādehi ca vāyameyya tareyya, na cireneva tīraṃ sampāpuṇeyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atthassa"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "viññāpanāyā"
      },
      "ti catusaccapaṭivedhānukūlassa atthassa sambodhanāya upamā katā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayañcettha attho"
      },
      "ti ayameva idāni vuccamāno idha mayā adhippeto upameyyattho, yassa viññāpanāya upamā āhaṭā."
    ],
    "innerText": "Atthassaviññāpanāyāti catusaccapaṭivedhānukūlassa atthassa sambodhanāya upamā katā. Ayañcettha atthoti ayameva idāni vuccamāno idha mayā adhippeto upameyyattho, yassa viññāpanāya upamā āhaṭā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṇhāyetaṃ adhivacana"
      },
      "nti ettha catūhi ākārehi taṇhāya sotasadisatā veditabbā anukkamaparivuḍḍhito anuppabandhato osīdāpanato duruttaraṇato ca. Yathā hi upari mahāmeghe abhippavuṭṭhe udakaṃ pabbatakandarapadarasākhāyo pūretvā tato bhassitvā kusubbhe pūretvā tato bhassitvā kunnadiyo pūretvā tato mahānadiyo pakkhanditvā ekoghaṃ hutvā pavattamānaṃ ‘‘nadīsoto’’ti vuccati, evameva ajjhattikabāhirādivasena anekabhedesu rūpādīsu ārammaṇesu lobho uppajjitvā anukkamena parivuḍḍhiṃ gacchanto ‘‘taṇhāsoto’’ti vuccati, yathā ",
      " ca nadīsoto āgamanato yāva samuddappatti, tāva sati vicchedapaccayābhāve avicchijjamāno anuppabandhena pavattati, evaṃ taṇhāsotopi āgamanato paṭṭhāya asati vicchedapaccaye avicchijjamāno apāyasamuddābhimukho anuppabandhena pavattati. Yathā pana nadīsoto tadantogadhe satte osīdāpeti, sīsaṃ ukkhipituṃ na deti, maraṇaṃ vā maraṇamattaṃ vā dukkhaṃ pāpeti, evaṃ taṇhāsotopi attano sotantogate satte osīdāpeti, paññāsīsaṃ ",
      " ukkhipituṃ na deti, kusalamūlacchedanena saṃkilesadhammasamāpajjanena ca maraṇaṃ vā maraṇamattaṃ vā dukkhaṃ pāpeti."
    ],
    "innerText": "Taṇhāyetaṃ adhivacananti ettha catūhi ākārehi taṇhāya sotasadisatā veditabbā anukkamaparivuḍḍhito anuppabandhato osīdāpanato duruttaraṇato ca. Yathā hi upari mahāmeghe abhippavuṭṭhe udakaṃ pabbatakandarapadarasākhāyo pūretvā tato bhassitvā kusubbhe pūretvā tato bhassitvā kunnadiyo pūretvā tato mahānadiyo pakkhanditvā ekoghaṃ hutvā pavattamānaṃ ‘‘nadīsoto’’ti vuccati, evameva ajjhattikabāhirādivasena anekabhedesu rūpādīsu ārammaṇesu lobho uppajjitvā anukkamena parivuḍḍhiṃ gacchanto ‘‘taṇhāsoto’’ti vuccati, yathā ca nadīsoto āgamanato yāva samuddappatti, tāva sati vicchedapaccayābhāve avicchijjamāno anuppabandhena pavattati, evaṃ taṇhāsotopi āgamanato paṭṭhāya asati vicchedapaccaye avicchijjamāno apāyasamuddābhimukho anuppabandhena pavattati. Yathā pana nadīsoto tadantogadhe satte osīdāpeti, sīsaṃ ukkhipituṃ na deti, maraṇaṃ vā maraṇamattaṃ vā dukkhaṃ pāpeti, evaṃ taṇhāsotopi attano sotantogate satte osīdāpeti, paññāsīsaṃ ukkhipituṃ na deti, kusalamūlacchedanena saṃkilesadhammasamāpajjanena ca maraṇaṃ vā maraṇamattaṃ vā dukkhaṃ pāpeti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yathā ca nadiyā soto mahoghabhāvena pavattamāno uḷumpaṃ vā nāvaṃ vā bandhituṃ netuñca chekaṃ purisaṃ nissāya paratīraṃ gantuṃ ajjhāsayaṃ katvā tajjaṃ vāyāmaṃ karontena taritabbo, na yena vā tena vāti duruttaro, evaṃ taṇhāsotopi kāmoghabhavoghabhūto sīlasaṃvaraṃ pūretuṃ samathavipassanāsu kammaṃ kātuṃ ‘‘nipakena arahattaṃ pāpuṇissāmī’’ti ajjhāsayaṃ samuṭṭhāpetvā kalyāṇamitte nissāya samathavipassanānāvaṃ abhiruhitvā sammāvāyāmaṃ karontena taritabbo, na yena vā tena vāti duruttaro. Evaṃ anukkamaparivuḍḍhito anuppabandhato osīdāpanato duruttaraṇatoti catūhi ākārehi taṇhāya nadīsotasadisatā veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Piyarūpaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sātarūpa"
      },
      "nti piyajātikaṃ piyasabhāvaṃ piyarūpaṃ, madhurajātikaṃ madhurasabhāvaṃ sātarūpaṃ, iṭṭhasabhāvanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Channeta"
      },
      "nti channaṃ etaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ajjhattikāna"
      },
      "nti ettha ‘‘evaṃ mayaṃ attāti gahaṇaṃ gamissāmā’’ti iminā viya adhippāyena attānaṃ adhikāraṃ katvā pavattānīti ajjhattikāni. Tattha gocarajjhattaṃ, niyakajjhattaṃ, visayajjhattaṃ, ajjhattajjhattanti catubbidhaṃ ajjhattaṃ. Tesu ‘‘ajjhattarato samāhito’’ti evamādīsu (dha. pa. 362) vuttaṃ idaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gocarajjhattaṃ"
      },
      " nāma. ‘‘Ajjhattaṃ sampasādana’’nti (dī. ni. 1.228; dha. sa. 161) āgataṃ idaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "niyakajjhattaṃ"
      },
      " nāma. ‘‘Sabbanimittānaṃ amanasikārā ajjhattaṃ suññataṃ upasampajja viharatī’’ti (ma. ni. 3.187) evamāgataṃ idaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "visayajjhattaṃ"
      },
      " nāma. ‘‘Ajjhattikā dhammā, bāhirā dhammā’’ti (dha. sa. tikamātikā 20) ettha vuttaṃ ajjhattaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ajjhattajjhattaṃ"
      },
      " nāma. Idhāpi etadeva adhippetaṃ, tasmā ajjhattāniyeva ajjhattikāni. Atha vā yathāvutteneva atthena ‘‘ajjhattā dhammā, bahiddhā dhammā’’tiādīsu viya tesu ajjhattesu bhavāni ajjhattikāni, cakkhādīni. Tesaṃ ajjhattikānaṃ."
    ],
    "innerText": "Piyarūpaṃsātarūpanti piyajātikaṃ piyasabhāvaṃ piyarūpaṃ, madhurajātikaṃ madhurasabhāvaṃ sātarūpaṃ, iṭṭhasabhāvanti attho. Channetanti channaṃ etaṃ. Ajjhattikānanti ettha ‘‘evaṃ mayaṃ attāti gahaṇaṃ gamissāmā’’ti iminā viya adhippāyena attānaṃ adhikāraṃ katvā pavattānīti ajjhattikāni. Tattha gocarajjhattaṃ, niyakajjhattaṃ, visayajjhattaṃ, ajjhattajjhattanti catubbidhaṃ ajjhattaṃ. Tesu ‘‘ajjhattarato samāhito’’ti evamādīsu (dha. pa. 362) vuttaṃ idaṃ gocarajjhattaṃ nāma. ‘‘Ajjhattaṃ sampasādana’’nti (dī. ni. 1.228; dha. sa. 161) āgataṃ idaṃ niyakajjhattaṃ nāma. ‘‘Sabbanimittānaṃ amanasikārā ajjhattaṃ suññataṃ upasampajja viharatī’’ti (ma. ni. 3.187) evamāgataṃ idaṃ visayajjhattaṃ nāma. ‘‘Ajjhattikā dhammā, bāhirā dhammā’’ti (dha. sa. tikamātikā 20) ettha vuttaṃ ajjhattaṃ ajjhattajjhattaṃ nāma. Idhāpi etadeva adhippetaṃ, tasmā ajjhattāniyeva ajjhattikāni. Atha vā yathāvutteneva atthena ‘‘ajjhattā dhammā, bahiddhā dhammā’’tiādīsu viya tesu ajjhattesu bhavāni ajjhattikāni, cakkhādīni. Tesaṃ ajjhattikānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āyatanāna"
      },
      "nti ettha āyatanato, āyānaṃ tananato, āyatassa ca nayanato āyatanānīti ",
      ". Cakkhādīsu hi taṃtaṃdvāravatthukā cittacetasikā dhammā sakena sakena anubhavanādinā kiccena āyatanti uṭṭhahanti ghaṭanti vāyamanti, te ca āyabhūte dhamme etāni tanonti vitthārenti ",
      ", yañca anamatagge saṃsāre pavattaṃ ativiya āyataṃ vaṭṭadukkhaṃ, taṃ nayanti pavattenti. Iti sabbathāpime dhammā āyatanato, āyānaṃ tananato, āyatassa ca nayanato āyatanānīti vuccanti. Apica nivāsaṭṭhānaṭṭhena, ākaraṭṭhena, samosaraṇaṭṭhānaṭṭhena, sañjātidesaṭṭhena, kāraṇaṭṭhena ca āyatanaṃ veditabbaṃ. Tathā hi loke ‘‘issarāyatanaṃ devāyatana’’ntiādīsu nivāsaṭṭhānaṃ āyatananti vuccati. ‘‘Suvaṇṇāyatanaṃ rajatāyatana’’ntiādīsu ākaro. Sāsane pana ",
      " ‘‘manorame āyatane, sevanti naṃ vihaṅgamā’’tiādīsu samosaraṇaṭṭhānaṃ. ‘‘Dakkhiṇāpatho gunnaṃ āyatana’’ntiādīsu sañjātideso. ‘‘Tatra tatreva sakkhibhabbataṃ pāpuṇāti sati satiāyatane’’tiādīsu (ma. ni. 3.158; a. ni. 3.102) kāraṇaṃ āyatananti vuccati. Cakkhādīsu ca te te cittacetasikā dhammā nivasanti tadāyattavuttitāyāti cakkhādayo tesaṃ nivāsaṭṭhānaṃ. Tattha ca te ākiṇṇā tannissitattāti te nesaṃ ākaro, samosaraṇaṭṭhānañca tattha vatthudvārabhāvena samosaraṇato, sañjātideso ca tannissayabhāvena tesaṃ tattheva uppattito, kāraṇañca tadabhāve tesaṃ abhāvatoti. Iti nivāsaṭṭhānaṭṭhena, ākaraṭṭhena, samosaraṇaṭṭhānaṭṭhena, sañjātidesaṭṭhena, kāraṇaṭṭhenāti imehi kāraṇehi cakkhādīni āyatanānīti vuccanti. Tena vuttaṃ ‘‘channetaṃ ajjhattikānaṃ āyatanāna’’nti."
    ],
    "innerText": "Āyatanānanti ettha āyatanato, āyānaṃ tananato, āyatassa ca nayanato āyatanānīti . Cakkhādīsu hi taṃtaṃdvāravatthukā cittacetasikā dhammā sakena sakena anubhavanādinā kiccena āyatanti uṭṭhahanti ghaṭanti vāyamanti, te ca āyabhūte dhamme etāni tanonti vitthārenti , yañca anamatagge saṃsāre pavattaṃ ativiya āyataṃ vaṭṭadukkhaṃ, taṃ nayanti pavattenti. Iti sabbathāpime dhammā āyatanato, āyānaṃ tananato, āyatassa ca nayanato āyatanānīti vuccanti. Apica nivāsaṭṭhānaṭṭhena, ākaraṭṭhena, samosaraṇaṭṭhānaṭṭhena, sañjātidesaṭṭhena, kāraṇaṭṭhena ca āyatanaṃ veditabbaṃ. Tathā hi loke ‘‘issarāyatanaṃ devāyatana’’ntiādīsu nivāsaṭṭhānaṃ āyatananti vuccati. ‘‘Suvaṇṇāyatanaṃ rajatāyatana’’ntiādīsu ākaro. Sāsane pana ‘‘manorame āyatane, sevanti naṃ vihaṅgamā’’tiādīsu samosaraṇaṭṭhānaṃ. ‘‘Dakkhiṇāpatho gunnaṃ āyatana’’ntiādīsu sañjātideso. ‘‘Tatra tatreva sakkhibhabbataṃ pāpuṇāti sati satiāyatane’’tiādīsu (ma. ni. 3.158; a. ni. 3.102) kāraṇaṃ āyatananti vuccati. Cakkhādīsu ca te te cittacetasikā dhammā nivasanti tadāyattavuttitāyāti cakkhādayo tesaṃ nivāsaṭṭhānaṃ. Tattha ca te ākiṇṇā tannissitattāti te nesaṃ ākaro, samosaraṇaṭṭhānañca tattha vatthudvārabhāvena samosaraṇato, sañjātideso ca tannissayabhāvena tesaṃ tattheva uppattito, kāraṇañca tadabhāve tesaṃ abhāvatoti. Iti nivāsaṭṭhānaṭṭhena, ākaraṭṭhena, samosaraṇaṭṭhānaṭṭhena, sañjātidesaṭṭhena, kāraṇaṭṭhenāti imehi kāraṇehi cakkhādīni āyatanānīti vuccanti. Tena vuttaṃ ‘‘channetaṃ ajjhattikānaṃ āyatanāna’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yadipi rūpādayopi dhammā ‘‘rūpaṃ loke piyarūpaṃ sātarūpaṃ, etthesā taṇhā uppajjamānā uppajjatī’’ti taṇhāvatthubhāvato piyarūpasātarūpabhāvena vuttā. Cakkhādike pana muñcitvā attabhāvapaññattiyā abhāvato ‘‘mama cakkhu mama sota’’ntiādinā adhikasinehavatthubhāvena cakkhādayo sātisayaṃ piyarūpaṃ sātarūpanti niddesaṃ arahantīti dassetuṃ ‘‘piyarūpaṃ sātarūpanti kho, bhikkhave, channetaṃ ajjhattikānaṃ āyatanānaṃ adhivacana’’nti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Orambhāgiyāna"
      },
      "nti ettha oraṃ vuccati kāmadhātu, tappariyāpannā orambhāgā, paccayabhāvena tesaṃ hitāti orambhāgiyā. Yassa saṃvijjanti, taṃ puggalaṃ vaṭṭasmiṃ saṃyojenti bandhantīti saṃyojanāni. Sakkāyadiṭṭhivicikicchāsīlabbataparāmāsakāmarāgabyāpādānaṃ etaṃ adhivacanaṃ. Te ",
      " hi kāmabhavūpagānaṃ saṅkhārānaṃ paccayā hutvā rūpārūpadhātuto heṭṭhābhāvena nihīnabhāvena orambhāgabhūtena kāmabhavena satte saṃyojenti. Eteneva tesaṃ heṭṭhārahadasadisatā dīpitāti daṭṭhabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ūmibhayanti"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kho, bhikkhave, kodhupāyāsassetaṃ adhivacana"
      },
      "nti bhāyati etasmāti ",
      " bhayaṃ, ūmi eva bhayanti ūmibhayaṃ. Kujjhanaṭṭhena kodho, sveva cittassa sarīrassa ca abhippamaddanapavedhanuppādanena daḷhaṃ āyāsanaṭṭhena upāyāso."
    ],
    "innerText": "Orambhāgiyānanti ettha oraṃ vuccati kāmadhātu, tappariyāpannā orambhāgā, paccayabhāvena tesaṃ hitāti orambhāgiyā. Yassa saṃvijjanti, taṃ puggalaṃ vaṭṭasmiṃ saṃyojenti bandhantīti saṃyojanāni. Sakkāyadiṭṭhivicikicchāsīlabbataparāmāsakāmarāgabyāpādānaṃ etaṃ adhivacanaṃ. Te hi kāmabhavūpagānaṃ saṅkhārānaṃ paccayā hutvā rūpārūpadhātuto heṭṭhābhāvena nihīnabhāvena orambhāgabhūtena kāmabhavena satte saṃyojenti. Eteneva tesaṃ heṭṭhārahadasadisatā dīpitāti daṭṭhabbā. Ūmibhayantikho, bhikkhave, kodhupāyāsassetaṃ adhivacananti bhāyati etasmāti bhayaṃ, ūmi eva bhayanti ūmibhayaṃ. Kujjhanaṭṭhena kodho, sveva cittassa sarīrassa ca abhippamaddanapavedhanuppādanena daḷhaṃ āyāsanaṭṭhena upāyāso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ettha ca anekavāraṃ pavattitvā attanā samavetaṃ sattaṃ ajjhottharitvā sīsaṃ ukkhipituṃ adatvā anayabyasanāpādanena kodhupāyāsassa ūmisadisatā daṭṭhabbā. Tathā kāmaguṇānaṃ kilesābhibhūte satte ito ca etto, etto ca itoti evaṃ manāpiyarūpādivisayasaṅkhāte attani saṃsāretvā yathā tato bahibhūte nekkhamme cittampi na uppajjati evaṃ āvaṭṭetvā byasanāpādanena āvaṭṭasadisatā daṭṭhabbā. Yathā pana gaharakkhasopi ārakkharahitaṃ attano gocarabhūmigataṃ purisaṃ abhibhuyya gahetvā agocare ṭhitampi rakkhasamāyāya gocaraṃ netvā bheravarūpadassanādinā avasaṃ attano upakāraṃ kātuṃ asamatthaṃ katvā anvāvisitvā vaṇṇabalabhogayasasukhehipi viyojento mahantaṃ anayabyasanaṃ āpādeti, evaṃ mātugāmopi yonisomanasikārarahitaṃ avīrapurisaṃ itthikuttabhūtehi attano hāvabhāvavilāsehi abhibhuyya gahetvā vīrajātiyampi attano rūpādīhi palobhanavasena itthimāyāya anvāvisitvā avasaṃ attano upakāradhamme sīlādayo sampādetuṃ asamatthaṃ karonto guṇavaṇṇādīhi viyojetvā mahantaṃ anayabyasanaṃ āpādeti, evaṃ mātugāmassa gaharakkhasasadisatā daṭṭhabbā. Tena vuttaṃ ‘‘āvaṭṭanti kho, bhikkhave, pañcannetaṃ kāmaguṇānaṃ adhivacanaṃ, gaharakkhasoti kho, bhikkhave, mātugāmassetaṃ adhivacana’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭisototi kho bhikkhave nekkhammassetaṃ adhivacana"
      },
      "nti ettha pabbajjā saha upacārena paṭhamajjhānaṃ vipassanāpaññā ca nibbānañca nekkhammaṃ nāma. Sabbepi kusalā dhammā nekkhammaṃ nāma. Vuttañhetaṃ –"
    ],
    "innerText": "Paṭisototi kho bhikkhave nekkhammassetaṃ adhivacananti ettha pabbajjā saha upacārena paṭhamajjhānaṃ vipassanāpaññā ca nibbānañca nekkhammaṃ nāma. Sabbepi kusalā dhammā nekkhammaṃ nāma. Vuttañhetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Pabbajjā ",
      " paṭhamaṃ jhānaṃ, nibbānañca vipassanā;"
    ],
    "innerText": "‘‘Pabbajjā paṭhamaṃ jhānaṃ, nibbānañca vipassanā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sabbepi kusalā dhammā, nekkhammanti pavuccare’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Imesaṃ ",
      " pana pabbajjādīnaṃ taṇhāsotassa paṭilomato paṭisotasadisatā veditabbā. Avisesena hi dhammavinayo nekkhammaṃ, tassa adhiṭṭhānaṃ pabbajjā ca, dhammavinayo ca taṇhāsotassa paṭisotaṃ vuccati. Vuttañhetaṃ –"
    ],
    "innerText": "Imesaṃ pana pabbajjādīnaṃ taṇhāsotassa paṭilomato paṭisotasadisatā veditabbā. Avisesena hi dhammavinayo nekkhammaṃ, tassa adhiṭṭhānaṃ pabbajjā ca, dhammavinayo ca taṇhāsotassa paṭisotaṃ vuccati. Vuttañhetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Paṭisotagāmiṃ ",
      " nipuṇaṃ, gambhīraṃ duddasaṃ aṇuṃ;"
    ],
    "innerText": "‘‘Paṭisotagāmiṃ nipuṇaṃ, gambhīraṃ duddasaṃ aṇuṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Rāgarattā na dakkhanti, tamokhandhena āvutā’’ti. (dī. ni. 2.65; ma. ni. 1.281; saṃ. ni. 1.172);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vīriyārambhassā"
      },
      "ti catubbidhasammappadhānavīriyassa. Tassa kāmoghādibhedataṇhāsotasantaraṇassa hatthehi pādehi caturaṅganadīsotasantaraṇavāyāmassa sadisatā pākaṭāyeva. Tathā nadīsotassa tīre ṭhitassa cakkhumato purisassa kāmādiṃ catubbidhampi oghaṃ taritvā tassa paratīrabhūte nibbānathale ṭhitassa pañcahi cakkhūhi cakkhumato bhagavato sadisabhāvo. Tena vuttaṃ ‘‘cakkhumā puriso…pe… sammāsambuddhassā’’ti."
    ],
    "innerText": "Vīriyārambhassāti catubbidhasammappadhānavīriyassa. Tassa kāmoghādibhedataṇhāsotasantaraṇassa hatthehi pādehi caturaṅganadīsotasantaraṇavāyāmassa sadisatā pākaṭāyeva. Tathā nadīsotassa tīre ṭhitassa cakkhumato purisassa kāmādiṃ catubbidhampi oghaṃ taritvā tassa paratīrabhūte nibbānathale ṭhitassa pañcahi cakkhūhi cakkhumato bhagavato sadisabhāvo. Tena vuttaṃ ‘‘cakkhumā puriso…pe… sammāsambuddhassā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatridaṃ opammasaṃsandanaṃ – nadīsoto viya anuppabandhavasena pavattamāno taṇhāsoto, tena vuyhamāno puriso viya anamatagge saṃsāravaṭṭe paribbhamanato taṇhāsotena vuyhamāno satto, tassa tattha piyarūpasātarūpavatthusmiṃ abhiniveso viya imassa cakkhādīsu abhiniveso, saūmisāvaṭṭasagaharakkhaso heṭṭhārahado viya kodhupāyāsapañcakāmaguṇamātugāmasamākulo pañcorambhāgiyasaṃyojanasamūho, tamatthaṃ yathābhūtaṃ viditvā tassa nadīsotassa paratīre ṭhito cakkhumā puriso viya sakalaṃ saṃsārādīnavaṃ sabbañca ñeyyadhammaṃ yathābhūtaṃ viditvā taṇhāsotassa paratīrabhūte nibbānathale ṭhito samantacakkhu bhagavā, tassa purisassa tasmiṃ nadiyā sotena vuyhamāne purise anukampāya rahadassa rahadādīnavassa ca ācikkhanaṃ viya taṇhāsotena vuyhamānassa sattassa mahākaruṇāya bhagavato taṇhādīnaṃ tadādīnavassa ca vibhāvanā, tassa vacanaṃ asaddahitvā anusotagāmino ",
      " tassa purisassa tasmiṃ rahade maraṇappattimaraṇamattadukkhappattiyo viya bhagavato vacanaṃ asampaṭicchantassa apāyuppatti, sugatiyaṃ dukkhuppatti ca, tassa pana vacanaṃ saddahitvā hatthehi ca pādehi ca vāyāmakaraṇaṃ viya ",
      " tena ca vāyāmena paratīraṃ patvā sukhena yathicchitaṭṭhānagamanaṃ viya bhagavato vacanaṃ sampaṭicchitvā taṇhādīsu ādīnavaṃ passitvā taṇhāsotassa paṭisotapabbajjādinekkhammavasena vīriyārambho, āraddhavīriyassa ca teneva vīriyārambhena taṇhāsotātikkamanaṃ nibbānatīraṃ patvā arahattaphalasamāpattivasena yathāruci sukhavihāroti."
    ],
    "innerText": "Tatridaṃ opammasaṃsandanaṃ – nadīsoto viya anuppabandhavasena pavattamāno taṇhāsoto, tena vuyhamāno puriso viya anamatagge saṃsāravaṭṭe paribbhamanato taṇhāsotena vuyhamāno satto, tassa tattha piyarūpasātarūpavatthusmiṃ abhiniveso viya imassa cakkhādīsu abhiniveso, saūmisāvaṭṭasagaharakkhaso heṭṭhārahado viya kodhupāyāsapañcakāmaguṇamātugāmasamākulo pañcorambhāgiyasaṃyojanasamūho, tamatthaṃ yathābhūtaṃ viditvā tassa nadīsotassa paratīre ṭhito cakkhumā puriso viya sakalaṃ saṃsārādīnavaṃ sabbañca ñeyyadhammaṃ yathābhūtaṃ viditvā taṇhāsotassa paratīrabhūte nibbānathale ṭhito samantacakkhu bhagavā, tassa purisassa tasmiṃ nadiyā sotena vuyhamāne purise anukampāya rahadassa rahadādīnavassa ca ācikkhanaṃ viya taṇhāsotena vuyhamānassa sattassa mahākaruṇāya bhagavato taṇhādīnaṃ tadādīnavassa ca vibhāvanā, tassa vacanaṃ asaddahitvā anusotagāmino tassa purisassa tasmiṃ rahade maraṇappattimaraṇamattadukkhappattiyo viya bhagavato vacanaṃ asampaṭicchantassa apāyuppatti, sugatiyaṃ dukkhuppatti ca, tassa pana vacanaṃ saddahitvā hatthehi ca pādehi ca vāyāmakaraṇaṃ viya tena ca vāyāmena paratīraṃ patvā sukhena yathicchitaṭṭhānagamanaṃ viya bhagavato vacanaṃ sampaṭicchitvā taṇhādīsu ādīnavaṃ passitvā taṇhāsotassa paṭisotapabbajjādinekkhammavasena vīriyārambho, āraddhavīriyassa ca teneva vīriyārambhena taṇhāsotātikkamanaṃ nibbānatīraṃ patvā arahattaphalasamāpattivasena yathāruci sukhavihāroti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Gāthāsu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sahāpi dukkhena jaheyya kāme"
      },
      "ti jhānamaggādhigamatthaṃ samathavipassanānuyogaṃ karonto bhikkhu yadipi tesaṃ pubbabhāgapaṭipadā kicchena kasirena sampajjati, na sukhena vīthiṃ otarati pubbabhāgabhāvanāya kilesānaṃ balavabhāvato, indriyānaṃ vā atikkhabhāvato. Tathā ",
      " sati sahāpi dukkhena jaheyya kāme, paṭhamajjhānena vikkhambhento tatiyamaggena samucchindanto kilesakāme pajaheyya. Etena dukkhapaṭipade jhānamagge dasseti."
    ],
    "innerText": "Gāthāsu sahāpi dukkhena jaheyya kāmeti jhānamaggādhigamatthaṃ samathavipassanānuyogaṃ karonto bhikkhu yadipi tesaṃ pubbabhāgapaṭipadā kicchena kasirena sampajjati, na sukhena vīthiṃ otarati pubbabhāgabhāvanāya kilesānaṃ balavabhāvato, indriyānaṃ vā atikkhabhāvato. Tathā sati sahāpi dukkhena jaheyya kāme, paṭhamajjhānena vikkhambhento tatiyamaggena samucchindanto kilesakāme pajaheyya. Etena dukkhapaṭipade jhānamagge dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yogakkhemaṃ āyatiṃ patthayāno"
      },
      "ti anāgāmitaṃ arahattaṃ icchanto ākaṅkhamāno. Ayañhettha adhippāyo – yadipi etarahi kicchena kasirena jhānapurimamagge adhigacchāmi, ime pana nissāya upari arahattaṃ adhigantvā katakicco pahīnasabbadukkho bhavissāmīti sahāpi dukkhena jhānādīhi kāme pajaheyyāti. Atha vā yo kāmavitakkabahulo puggalo kalyāṇamittassa vasena pabbajjaṃ sīlavisodhanaṃ jhānādīnaṃ pubbabhāgapaṭipattiṃ vā paṭipajjanto kicchena kasirena assumukho rodamāno taṃ vitakkaṃ vikkhambheti, taṃ sandhāya vuttaṃ ‘‘sahāpi dukkhena jaheyya kāme’’ti. So hi kicchenapi kāme pajahanto jhānaṃ nibbattetvā taṃ jhānaṃ pādakaṃ katvā vipassanto anukkamena arahatte patiṭṭhaheyya. Tena vuttaṃ ‘‘yogakkhemaṃ āyatiṃ patthayāno’’ti."
    ],
    "innerText": "Yogakkhemaṃ āyatiṃ patthayānoti anāgāmitaṃ arahattaṃ icchanto ākaṅkhamāno. Ayañhettha adhippāyo – yadipi etarahi kicchena kasirena jhānapurimamagge adhigacchāmi, ime pana nissāya upari arahattaṃ adhigantvā katakicco pahīnasabbadukkho bhavissāmīti sahāpi dukkhena jhānādīhi kāme pajaheyyāti. Atha vā yo kāmavitakkabahulo puggalo kalyāṇamittassa vasena pabbajjaṃ sīlavisodhanaṃ jhānādīnaṃ pubbabhāgapaṭipattiṃ vā paṭipajjanto kicchena kasirena assumukho rodamāno taṃ vitakkaṃ vikkhambheti, taṃ sandhāya vuttaṃ ‘‘sahāpi dukkhena jaheyya kāme’’ti. So hi kicchenapi kāme pajahanto jhānaṃ nibbattetvā taṃ jhānaṃ pādakaṃ katvā vipassanto anukkamena arahatte patiṭṭhaheyya. Tena vuttaṃ ‘‘yogakkhemaṃ āyatiṃ patthayāno’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammappajāno"
      },
      "ti vipassanāsahitāya maggapaññāya sammadeva pajānanto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suvimuttacitto"
      },
      "ti tassa ariyamaggādhigamassa anantaraṃ phalavimuttiyā suṭṭhu vimuttacitto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vimuttiyā phassaye tattha tatthā"
      },
      "ti tasmiṃ tasmiṃ maggaphalādhigamanakāle ",
      " vimuttiṃ nibbānaṃ phassaye phuseyya pāpuṇeyya adhigaccheyya sacchikareyya. Upayogatthe hi ‘‘vimuttiyā’’ti idaṃ sāmivacanaṃ. Vimuttiyā ",
      " vā ārammaṇabhūtāya tattha tattha taṃtaṃphalasamāpattikāle attano phalacittaṃ phassaye phuseyya pāpuṇeyya, nibbānogadhāya phalasamāpattiyā vihareyyāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sa vedagū"
      },
      "ti so vedasaṅkhātena maggañāṇena catunnaṃ saccānaṃ gatattā paṭividdhattā vedagū. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lokantagū"
      },
      "ti khandhalokassa pariyantaṃ gato. Sesaṃ suviññeyyameva."
    ],
    "innerText": "Sammappajānoti vipassanāsahitāya maggapaññāya sammadeva pajānanto. Suvimuttacittoti tassa ariyamaggādhigamassa anantaraṃ phalavimuttiyā suṭṭhu vimuttacitto. Vimuttiyā phassaye tattha tatthāti tasmiṃ tasmiṃ maggaphalādhigamanakāle vimuttiṃ nibbānaṃ phassaye phuseyya pāpuṇeyya adhigaccheyya sacchikareyya. Upayogatthe hi ‘‘vimuttiyā’’ti idaṃ sāmivacanaṃ. Vimuttiyā vā ārammaṇabhūtāya tattha tattha taṃtaṃphalasamāpattikāle attano phalacittaṃ phassaye phuseyya pāpuṇeyya, nibbānogadhāya phalasamāpattiyā vihareyyāti attho. Sa vedagūti so vedasaṅkhātena maggañāṇena catunnaṃ saccānaṃ gatattā paṭividdhattā vedagū. Lokantagūti khandhalokassa pariyantaṃ gato. Sesaṃ suviññeyyameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dasamasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "11. Carasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "110"
      },
      ". Ekādasame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "carato"
      },
      "ti gacchantassa, caṅkamantassa vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uppajjati kāmavitakko vā"
      },
      "ti vatthukāmesu avītarāgatāya tādise paccaye kāmapaṭisaṃyutto vā vitakko uppajjati ce, yadi uppajjati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Byāpādavitakko vā vihiṃsāvitakko vā"
      },
      "ti āghātanimittabyāpādapaṭisaṃyutto vā vitakko, leḍḍudaṇḍādīhi paraviheṭhanavasena vihiṃsāpaṭisaṃyutto vā vitakko uppajjati ",
      " ceti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adhivāsetī"
      },
      "ti taṃ yathāvuttaṃ kāmavitakkādiṃ yathāpaccayaṃ attano citte uppannaṃ ‘‘itipāyaṃ vitakko pāpako, itipi akusalo, itipi sāvajjo, so ca kho attabyābādhāyapi saṃvattatī’’tiādinā nayena paccavekkhaṇāya abhāvato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "adhivāseti"
      },
      " attano cittaṃ āropetvā vāseti ce. Adhivāsentoyeva ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nappajahati"
      },
      " tadaṅgādippahānavasena na paṭinissajjati, tato eva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na vinodeti"
      },
      " attano cittasantānato na nudati na nīharati, tathā avinodanato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na byantīkaroti"
      },
      " na vigatantaṃ karoti. Ātāpī pahitatto yathā tesaṃ antopi nāvasissati antamaso bhaṅgamattampi evaṃ karoti, ayaṃ pana tathā na karotīti attho. Tathābhūtova ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na anabhāvaṃ gameti"
      },
      " anu anu abhāvaṃ na gameti. Na pajahati ce, na vinodeti cetiādinā ce-saddaṃ yojetvā attho veditabbo."
    ],
    "innerText": "110. Ekādasame caratoti gacchantassa, caṅkamantassa vā. Uppajjati kāmavitakko vāti vatthukāmesu avītarāgatāya tādise paccaye kāmapaṭisaṃyutto vā vitakko uppajjati ce, yadi uppajjati. Byāpādavitakko vā vihiṃsāvitakko vāti āghātanimittabyāpādapaṭisaṃyutto vā vitakko, leḍḍudaṇḍādīhi paraviheṭhanavasena vihiṃsāpaṭisaṃyutto vā vitakko uppajjati ceti sambandho. Adhivāsetīti taṃ yathāvuttaṃ kāmavitakkādiṃ yathāpaccayaṃ attano citte uppannaṃ ‘‘itipāyaṃ vitakko pāpako, itipi akusalo, itipi sāvajjo, so ca kho attabyābādhāyapi saṃvattatī’’tiādinā nayena paccavekkhaṇāya abhāvato adhivāseti attano cittaṃ āropetvā vāseti ce. Adhivāsentoyeva ca nappajahati tadaṅgādippahānavasena na paṭinissajjati, tato eva na vinodeti attano cittasantānato na nudati na nīharati, tathā avinodanato na byantīkaroti na vigatantaṃ karoti. Ātāpī pahitatto yathā tesaṃ antopi nāvasissati antamaso bhaṅgamattampi evaṃ karoti, ayaṃ pana tathā na karotīti attho. Tathābhūtova na anabhāvaṃ gameti anu anu abhāvaṃ na gameti. Na pajahati ce, na vinodeti cetiādinā ce-saddaṃ yojetvā attho veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cara"
      },
      "nti caranto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃbhūto"
      },
      "ti evaṃ kāmavitakkādipāpavitakkehi samaṅgībhūto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anātāpī"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anottāpī"
      },
      "ti kilesānaṃ ātāpanassa vīriyassa ",
      " abhāvena anātāpī, pāputrāsaātāpanaparitāpanalakkhaṇassa ottappassa abhāvena anottāpī. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Satataṃ samita"
      },
      "nti sabbakālaṃ nirantaraṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kusīto hīnavīriyo"
      },
      "ti kusalehi dhammehi parihāyitvā akusalapakkhe kucchitaṃ sīdanato kosajjasamannāgamena ca kusīto, sammappadhānavīriyābhāvena hīnavīriyo vīriyavirahitoti vuccati kathīyati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ṭhitassā"
      },
      "ti gamanaṃ upacchinditvā tiṭṭhato. Sayanairiyāpathassa visesato kosajjapakkhikattā yathā taṃsamaṅgino vitakkā sambhavanti, taṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘jāgarassā’’"
      },
      "ti vuttaṃ."
    ],
    "innerText": "Caranti caranto. Evaṃbhūtoti evaṃ kāmavitakkādipāpavitakkehi samaṅgībhūto. Anātāpīanottāpīti kilesānaṃ ātāpanassa vīriyassa abhāvena anātāpī, pāputrāsaātāpanaparitāpanalakkhaṇassa ottappassa abhāvena anottāpī. Satataṃ samitanti sabbakālaṃ nirantaraṃ. Kusīto hīnavīriyoti kusalehi dhammehi parihāyitvā akusalapakkhe kucchitaṃ sīdanato kosajjasamannāgamena ca kusīto, sammappadhānavīriyābhāvena hīnavīriyo vīriyavirahitoti vuccati kathīyati. Ṭhitassāti gamanaṃ upacchinditvā tiṭṭhato. Sayanairiyāpathassa visesato kosajjapakkhikattā yathā taṃsamaṅgino vitakkā sambhavanti, taṃ dassetuṃ ‘‘jāgarassā’’ti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sukkapakkhe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tañce, bhikkhave, bhikkhu nādhivāsetī"
      },
      "ti āraddhavīriyassāpi viharato anādimati saṃsāre cirakālabhāvitena tathārūpappaccayasamāyogena satisammosena vā kāmavitakkādi uppajjati ce, taṃ bhikkhu attano cittaṃ āropetvā na vāseti ce, abbhantare na vāseti ceti attho. Anadhivāsento kiṃ karotīti? ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pajahati"
      },
      " chaḍḍeti. Kiṃ kacavaraṃ viya piṭakena? Na hi, apica kho taṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vinodeti"
      },
      " nudati nīharati. Kiṃ balībaddaṃ viya patodena? Na hi, atha kho naṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "byantīkaroti"
      },
      " vigatantaṃ karoti. Yathā tesaṃ antopi nāvasissati antamaso bhaṅgamattampi, tathā te karoti. Kathaṃ pana te tathā karoti? ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anabhāvaṃ gameti"
      },
      " anu anu abhāvaṃ gameti, vikkhambhanappahānena yathā suvikkhambhitā honti tathā ne karotīti vuttaṃ hoti."
    ],
    "innerText": "Sukkapakkhe tañce, bhikkhave, bhikkhu nādhivāsetīti āraddhavīriyassāpi viharato anādimati saṃsāre cirakālabhāvitena tathārūpappaccayasamāyogena satisammosena vā kāmavitakkādi uppajjati ce, taṃ bhikkhu attano cittaṃ āropetvā na vāseti ce, abbhantare na vāseti ceti attho. Anadhivāsento kiṃ karotīti? Pajahati chaḍḍeti. Kiṃ kacavaraṃ viya piṭakena? Na hi, apica kho taṃ vinodeti nudati nīharati. Kiṃ balībaddaṃ viya patodena? Na hi, atha kho naṃ byantīkaroti vigatantaṃ karoti. Yathā tesaṃ antopi nāvasissati antamaso bhaṅgamattampi, tathā te karoti. Kathaṃ pana te tathā karoti? Anabhāvaṃ gameti anu anu abhāvaṃ gameti, vikkhambhanappahānena yathā suvikkhambhitā honti tathā ne karotīti vuttaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃbhūto"
      },
      "tiādīsu evaṃ kāmavitakkādīnaṃ anadhivāsanena suvisuddhāsayo samāno tāya ca ",
      " āsayasampattiyā tannimittāya ca payogasampattiyā parisuddhasīlo indriyesu guttadvāro bhojane mattaññū satisampajaññena samannāgato jāgariyaṃ anuyutto tadaṅgādivasena kilesānaṃ ātāpanalakkhaṇena vīriyena samannāgatattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ātāpī"
      },
      ", sabbaso pāputrāsena samannāgatattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ottāpī satataṃ"
      },
      " rattindivaṃ, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samitaṃ"
      },
      " nirantaraṃ samathavipassanābhāvanānuyogavasena catubbidhasammappadhānasiddhiyā, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āraddhavīriyo pahitatto"
      },
      " nibbānaṃ paṭipesitacittoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vuccati"
      },
      " kathīyatīti attho. Sesaṃ vuttanayameva."
    ],
    "innerText": "Evaṃbhūtotiādīsu evaṃ kāmavitakkādīnaṃ anadhivāsanena suvisuddhāsayo samāno tāya ca āsayasampattiyā tannimittāya ca payogasampattiyā parisuddhasīlo indriyesu guttadvāro bhojane mattaññū satisampajaññena samannāgato jāgariyaṃ anuyutto tadaṅgādivasena kilesānaṃ ātāpanalakkhaṇena vīriyena samannāgatattā ātāpī, sabbaso pāputrāsena samannāgatattā. Ottāpī satataṃ rattindivaṃ, samitaṃ nirantaraṃ samathavipassanābhāvanānuyogavasena catubbidhasammappadhānasiddhiyā, āraddhavīriyo pahitatto nibbānaṃ paṭipesitacittoti vuccati kathīyatīti attho. Sesaṃ vuttanayameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Gāthāsu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gehanissita"
      },
      "nti ettha gehavāsīhi apariccattattā gehavāsīnaṃ sabhāvattā gehadhammattā vā gehaṃ vuccati vatthukāmo. Atha vā gehapaṭibaddhabhāvato kilesakāmānaṃ ",
      " nivāsaṭṭhānabhāvato taṃvatthukattā vā kāmavitakkādi gehanissitaṃ nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kummaggaṃ paṭipanno"
      },
      "ti yasmā ariyamaggassa uppathabhāvato abhijjhādayo tadekaṭṭhadhammā ca kummaggo, tasmā kāmavitakkādibahulo puggalo kummaggaṃ paṭipanno nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mohaneyyesu mucchito"
      },
      "ti mohasaṃvattaniyesu rūpādīsu mucchito sammatto ajjhopanno. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sambodhi"
      },
      "nti ariyamaggañāṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Phuṭṭhu"
      },
      "nti phusituṃ pattuṃ, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "so tādiso"
      },
      " micchāsaṅkappagocaro abhabbo, na kadāci taṃ pāpuṇātīti attho."
    ],
    "innerText": "Gāthāsu gehanissitanti ettha gehavāsīhi apariccattattā gehavāsīnaṃ sabhāvattā gehadhammattā vā gehaṃ vuccati vatthukāmo. Atha vā gehapaṭibaddhabhāvato kilesakāmānaṃ nivāsaṭṭhānabhāvato taṃvatthukattā vā kāmavitakkādi gehanissitaṃ nāma. Kummaggaṃ paṭipannoti yasmā ariyamaggassa uppathabhāvato abhijjhādayo tadekaṭṭhadhammā ca kummaggo, tasmā kāmavitakkādibahulo puggalo kummaggaṃ paṭipanno nāma. Mohaneyyesu mucchitoti mohasaṃvattaniyesu rūpādīsu mucchito sammatto ajjhopanno. Sambodhinti ariyamaggañāṇaṃ. Phuṭṭhunti phusituṃ pattuṃ, so tādiso micchāsaṅkappagocaro abhabbo, na kadāci taṃ pāpuṇātīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vitakkaṃ samayitvānāti"
      },
      " yathāvuttaṃ micchāvitakkaṃ paṭisaṅkhānabhāvanābalehi vūpasametvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vitakkūpasame rato"
      },
      "ti navannampi mahāvitakkānaṃ accantavūpasamabhūte arahatte nibbāne eva vā ajjhāsayena rato abhirato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhabbo so tādiso"
      },
      "ti so yathāvutto sammā paṭipajjamāno puggalo pubbabhāge samathavipassanābalena sabbavitakke yathārahaṃ tadaṅgādivasena vūpasametvā ṭhito, vipassanaṃ ussukkāpetvā maggapaṭipāṭiyā arahattamaggañāṇasaṅkhātaṃ nibbānasaṅkhātañca anuttaraṃ sambodhiṃ phuṭṭhuṃ adhigantuṃ bhabbo samatthoti."
    ],
    "innerText": "Vitakkaṃ samayitvānāti yathāvuttaṃ micchāvitakkaṃ paṭisaṅkhānabhāvanābalehi vūpasametvā. Vitakkūpasame ratoti navannampi mahāvitakkānaṃ accantavūpasamabhūte arahatte nibbāne eva vā ajjhāsayena rato abhirato. Bhabbo so tādisoti so yathāvutto sammā paṭipajjamāno puggalo pubbabhāge samathavipassanābalena sabbavitakke yathārahaṃ tadaṅgādivasena vūpasametvā ṭhito, vipassanaṃ ussukkāpetvā maggapaṭipāṭiyā arahattamaggañāṇasaṅkhātaṃ nibbānasaṅkhātañca anuttaraṃ sambodhiṃ phuṭṭhuṃ adhigantuṃ bhabbo samatthoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ekādasamasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "12. Sampannasīlasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "111"
      },
      ". Dvādasame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sampannasīlā"
      },
      "ti ettha tividhaṃ sampannaṃ paripuṇṇasamaṅgīmadhuravasena. Tesu –"
    ],
    "innerText": "111. Dvādasame sampannasīlāti ettha tividhaṃ sampannaṃ paripuṇṇasamaṅgīmadhuravasena. Tesu –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Sampannaṃ ",
      " sālikedāraṃ, suvā bhuñjanti kosiya;"
    ],
    "innerText": "‘‘Sampannaṃ sālikedāraṃ, suvā bhuñjanti kosiya;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Paṭivedemi te brahme, na ne vāretumussahe’’ti. (jā. 1.14.1) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Ettha paripuṇṇattho sampannasaddo. ‘‘Iminā pātimokkhasaṃvarena upeto hoti samupeto upagato samupagato sampanno samannāgato’’ti (vibha. 511) ettha samaṅgibhāvattho sampannasaddo ",
      ". ‘‘Imissā, bhante, mahāpathaviyā heṭṭhimatalaṃ ",
      " sampannaṃ – seyyathāpi khuddamadhuṃ anīlakaṃ, evamassāda’’nti (pārā. 17) ettha madhurattho sampannasaddo. Idha pana paripuṇṇatthepi samaṅgibhāvepi vaṭṭati, tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sampannasīlā"
      },
      "ti paripuṇṇasīlā hutvātipi, sīlasamaṅgino hutvātipi evamettha attho veditabbo."
    ],
    "innerText": "Ettha paripuṇṇattho sampannasaddo. ‘‘Iminā pātimokkhasaṃvarena upeto hoti samupeto upagato samupagato sampanno samannāgato’’ti (vibha. 511) ettha samaṅgibhāvattho sampannasaddo . ‘‘Imissā, bhante, mahāpathaviyā heṭṭhimatalaṃ sampannaṃ – seyyathāpi khuddamadhuṃ anīlakaṃ, evamassāda’’nti (pārā. 17) ettha madhurattho sampannasaddo. Idha pana paripuṇṇatthepi samaṅgibhāvepi vaṭṭati, tasmā sampannasīlāti paripuṇṇasīlā hutvātipi, sīlasamaṅgino hutvātipi evamettha attho veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ‘‘paripuṇṇasīlā’’ti iminā atthena khettadosavigamena khettapāripūri viya paripuṇṇaṃ nāma hoti. Tena vuttaṃ ‘‘khettadosavigamena khettapāripūri viya sīladosavigamena sīlapāripūri vuttā’’ti. ‘‘Sīlasamaṅgino’’ti iminā pana atthena sīlena samaṅgībhūtā samodhānagatā samannāgatā hutvā viharathāti vuttaṃ hoti. Tattha dvīhi kāraṇehi sampannasīlatā hoti sīlavipattiyā ādīnavadassanena, sīlasampattiyā ānisaṃsadassanena ca. Tadubhayampi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "visuddhimagge"
      },
      " (visuddhi. 1.20-21) vuttanayena veditabbaṃ. Tattha ‘‘sampannasīlā’’ti ettāvatā kira bhagavā catupārisuddhisīlaṃ uddisitvā ‘‘pātimokkhasaṃvarasaṃvutā’’ti iminā jeṭṭhakasīlaṃ dassetītiādinā ettha yaṃ vattabbaṃ, taṃ heṭṭhā vuttameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kimassa uttari karaṇīya"
      },
      "nti evaṃ sampannasīlānaṃ viharataṃ tumhākaṃ kinti siyā uttari kātabbaṃ, paṭipajjitabbanti ceti attho."
    ],
    "innerText": "Tattha ‘‘paripuṇṇasīlā’’ti iminā atthena khettadosavigamena khettapāripūri viya paripuṇṇaṃ nāma hoti. Tena vuttaṃ ‘‘khettadosavigamena khettapāripūri viya sīladosavigamena sīlapāripūri vuttā’’ti. ‘‘Sīlasamaṅgino’’ti iminā pana atthena sīlena samaṅgībhūtā samodhānagatā samannāgatā hutvā viharathāti vuttaṃ hoti. Tattha dvīhi kāraṇehi sampannasīlatā hoti sīlavipattiyā ādīnavadassanena, sīlasampattiyā ānisaṃsadassanena ca. Tadubhayampi visuddhimagge (visuddhi. 1.20-21) vuttanayena veditabbaṃ. Tattha ‘‘sampannasīlā’’ti ettāvatā kira bhagavā catupārisuddhisīlaṃ uddisitvā ‘‘pātimokkhasaṃvarasaṃvutā’’ti iminā jeṭṭhakasīlaṃ dassetītiādinā ettha yaṃ vattabbaṃ, taṃ heṭṭhā vuttameva. Kimassa uttari karaṇīyanti evaṃ sampannasīlānaṃ viharataṃ tumhākaṃ kinti siyā uttari kātabbaṃ, paṭipajjitabbanti ceti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ ‘‘sampannasīlā, bhikkhave, viharathā’’tiādinā sampādanūpāyena saddhiṃ sīlasampadāya bhikkhū niyojento anekapuggalādhiṭṭhānaṃ katvā desanaṃ ārabhitvā idāni yasmā ekapuggalādhiṭṭhānavasena pavattitāpi bhagavato desanā anekapuggalādhiṭṭhānāva hoti sabbasādhāraṇattā, tasmā taṃ ekapuggalādhiṭṭhānavasena dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘carato cepi, bhikkhave, bhikkhuno’’"
      },
      "tiādimāha."
    ],
    "innerText": "Evaṃ ‘‘sampannasīlā, bhikkhave, viharathā’’tiādinā sampādanūpāyena saddhiṃ sīlasampadāya bhikkhū niyojento anekapuggalādhiṭṭhānaṃ katvā desanaṃ ārabhitvā idāni yasmā ekapuggalādhiṭṭhānavasena pavattitāpi bhagavato desanā anekapuggalādhiṭṭhānāva hoti sabbasādhāraṇattā, tasmā taṃ ekapuggalādhiṭṭhānavasena dassento ‘‘carato cepi, bhikkhave, bhikkhuno’’tiādimāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha abhijjhāyati etāyāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhijjhā,"
      },
      " parabhaṇḍābhijjhāyanalakkhaṇassa lobhassetaṃ adhivacanaṃ. Byāpajjati pūtibhavati cittaṃ etenāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "byāpādo,"
      },
      " ‘‘anatthaṃ me acarī’’tiādinayappavattassa ekūnavīsatiāghātavatthuvisayassa dosassetaṃ adhivacanaṃ. Ubhinnampi ‘‘tattha katamo ",
      " kāmacchando? Yo kāmesu kāmacchando kāmasneho kāmapipāsā kāmapariḷāho kāmamucchā kāmajjhosāna’’nti ",
      " (dha. sa. 1159), tathā ‘‘lobho lubbhanā lubbhitattaṃ sārāgo sārajjanā sārajjitattaṃ abhijjhā lobho akusalamūla’’ntiādinā (dha. sa. 391), ‘‘doso dussanā dussitattaṃ ",
      " byāpatti byāpajjanā byāpajjitattaṃ virodho paṭivirodho caṇḍikkaṃ asuropo anattamanatā cittassā’’tiādinā (dha. sa. 418, 1237) ca vitthāro veditabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vigato hotī"
      },
      "ti ayañca abhijjhā, ayañca byāpādo vigato hoti apagato, pahīno hotīti attho. Ettāvatā kāmacchandanīvaraṇassa ca byāpādanīvaraṇassa ca pahānaṃ dassitaṃ hoti."
    ],
    "innerText": "Tattha abhijjhāyati etāyāti abhijjhā, parabhaṇḍābhijjhāyanalakkhaṇassa lobhassetaṃ adhivacanaṃ. Byāpajjati pūtibhavati cittaṃ etenāti byāpādo, ‘‘anatthaṃ me acarī’’tiādinayappavattassa ekūnavīsatiāghātavatthuvisayassa dosassetaṃ adhivacanaṃ. Ubhinnampi ‘‘tattha katamo kāmacchando? Yo kāmesu kāmacchando kāmasneho kāmapipāsā kāmapariḷāho kāmamucchā kāmajjhosāna’’nti (dha. sa. 1159), tathā ‘‘lobho lubbhanā lubbhitattaṃ sārāgo sārajjanā sārajjitattaṃ abhijjhā lobho akusalamūla’’ntiādinā (dha. sa. 391), ‘‘doso dussanā dussitattaṃ byāpatti byāpajjanā byāpajjitattaṃ virodho paṭivirodho caṇḍikkaṃ asuropo anattamanatā cittassā’’tiādinā (dha. sa. 418, 1237) ca vitthāro veditabbo. Vigato hotīti ayañca abhijjhā, ayañca byāpādo vigato hoti apagato, pahīno hotīti attho. Ettāvatā kāmacchandanīvaraṇassa ca byāpādanīvaraṇassa ca pahānaṃ dassitaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Thinamiddha"
      },
      "nti thinañceva middhañca. Tesu cittassa akammaññatā thinaṃ, ālasiyassetaṃ adhivacanaṃ, vedanādīnaṃ tiṇṇaṃ khandhānaṃ akammaññatā middhaṃ, pacalāyikabhāvassetaṃ adhivacanaṃ. Ubhinnampi ‘‘tattha katamaṃ thinaṃ? Yā cittassa akallatā akammaññatā olīyanā sallīyanā. Tattha katamaṃ middhaṃ? Yā kāyassa akallatā akammaññatā onāho pariyonāho’’tiādinā (dha. sa. 1162-1163) nayena vitthāro veditabbo."
    ],
    "innerText": "Thinamiddhanti thinañceva middhañca. Tesu cittassa akammaññatā thinaṃ, ālasiyassetaṃ adhivacanaṃ, vedanādīnaṃ tiṇṇaṃ khandhānaṃ akammaññatā middhaṃ, pacalāyikabhāvassetaṃ adhivacanaṃ. Ubhinnampi ‘‘tattha katamaṃ thinaṃ? Yā cittassa akallatā akammaññatā olīyanā sallīyanā. Tattha katamaṃ middhaṃ? Yā kāyassa akallatā akammaññatā onāho pariyonāho’’tiādinā (dha. sa. 1162-1163) nayena vitthāro veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uddhaccakukkucca"
      },
      "nti uddhaccañceva kukkuccañca. Tattha uddhaccaṃ nāma cittassa uddhatākāro, kukkuccaṃ nāma akatakalyāṇassa katapāpassa tappaccayā vippaṭisāro. Ubhinnampi ‘‘tattha katamaṃ uddhaccaṃ? Yaṃ cittassa uddhaccaṃ avūpasamo cetaso vikkhepo bhantattaṃ cittassā’’tiādinā (dha. sa. 1165) vitthāro. ‘‘Akataṃ vata me kalyāṇaṃ, akataṃ kusalaṃ, akataṃ bhīruttānaṃ; kataṃ pāpaṃ, kataṃ luddaṃ, kataṃ kibbisa’’ntiādinā (ma. ni. 3.248; netti. 120) pavattiākāro veditabbo."
    ],
    "innerText": "Uddhaccakukkuccanti uddhaccañceva kukkuccañca. Tattha uddhaccaṃ nāma cittassa uddhatākāro, kukkuccaṃ nāma akatakalyāṇassa katapāpassa tappaccayā vippaṭisāro. Ubhinnampi ‘‘tattha katamaṃ uddhaccaṃ? Yaṃ cittassa uddhaccaṃ avūpasamo cetaso vikkhepo bhantattaṃ cittassā’’tiādinā (dha. sa. 1165) vitthāro. ‘‘Akataṃ vata me kalyāṇaṃ, akataṃ kusalaṃ, akataṃ bhīruttānaṃ; kataṃ pāpaṃ, kataṃ luddaṃ, kataṃ kibbisa’’ntiādinā (ma. ni. 3.248; netti. 120) pavattiākāro veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vicikicchā"
      },
      "ti buddhādīsu saṃsayo. Tassā ‘‘satthari kaṅkhati vicikicchati, nādhimuccati na sampasīdatī’’tiādinā (vibha. 915), ‘‘tattha katamā vicikicchā? Yā kaṅkhā kaṅkhāyanā kaṅkhāyitattaṃ vimati vicikicchā dveḷhakaṃ dvedhāpatho saṃsayo anekaṃsaggāho āsappanā parisappanā apariyogāhanā chambhitattaṃ cittassa manovilekho’’tiādinā (dha. sa. 1008) ca nayena vitthāro veditabbo."
    ],
    "innerText": "Vicikicchāti buddhādīsu saṃsayo. Tassā ‘‘satthari kaṅkhati vicikicchati, nādhimuccati na sampasīdatī’’tiādinā (vibha. 915), ‘‘tattha katamā vicikicchā? Yā kaṅkhā kaṅkhāyanā kaṅkhāyitattaṃ vimati vicikicchā dveḷhakaṃ dvedhāpatho saṃsayo anekaṃsaggāho āsappanā parisappanā apariyogāhanā chambhitattaṃ cittassa manovilekho’’tiādinā (dha. sa. 1008) ca nayena vitthāro veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ettha ca abhijjhābyāpādādīnaṃ vigamavasena ca pahānavasena ca tesaṃ vikkhambhanameva veditabbaṃ. Yaṃ sandhāya vuttaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘So ",
      " abhijjhaṃ loke pahāya vigatābhijjhena ",
      " cetasā viharati, abhijjhāya cittaṃ parisodheti. Byāpādapadosaṃ pahāya abyāpannacitto viharati, byāpādapadosā cittaṃ parisodheti. Thinamiddhaṃ pahāya vigatathinamiddho viharati ālokasaññī sato ",
      " sampajāno, thinamiddhā cittaṃ parisodheti. Uddhaccakukkuccaṃ pahāya anuddhato viharati ajjhattaṃ upasantacitto uddhaccakukkuccā cittaṃ parisodheti. Vicikicchaṃ pahāya tiṇṇavicikiccho viharati akathaṃkathī kusalesu dhammesu, vicikicchāya cittaṃ parisodhetī’’ti (vibha. 508)."
    ],
    "innerText": "‘‘So abhijjhaṃ loke pahāya vigatābhijjhena cetasā viharati, abhijjhāya cittaṃ parisodheti. Byāpādapadosaṃ pahāya abyāpannacitto viharati, byāpādapadosā cittaṃ parisodheti. Thinamiddhaṃ pahāya vigatathinamiddho viharati ālokasaññī sato sampajāno, thinamiddhā cittaṃ parisodheti. Uddhaccakukkuccaṃ pahāya anuddhato viharati ajjhattaṃ upasantacitto uddhaccakukkuccā cittaṃ parisodheti. Vicikicchaṃ pahāya tiṇṇavicikiccho viharati akathaṃkathī kusalesu dhammesu, vicikicchāya cittaṃ parisodhetī’’ti (vibha. 508)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha yathā nīvaraṇānaṃ pahānaṃ hoti, taṃ veditabbaṃ. Kathañca nesaṃ pahānaṃ hoti? ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāmacchandassa"
      },
      " tāva asubhanimitte yonisomanasikārena pahānaṃ hoti, subhanimitte ayonisomanasikārenassa uppatti. Tenāha bhagavā –"
    ],
    "innerText": "Tattha yathā nīvaraṇānaṃ pahānaṃ hoti, taṃ veditabbaṃ. Kathañca nesaṃ pahānaṃ hoti? Kāmacchandassa tāva asubhanimitte yonisomanasikārena pahānaṃ hoti, subhanimitte ayonisomanasikārenassa uppatti. Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Atthi, bhikkhave, subhanimittaṃ. Tattha ayonisomanasikārabahulīkāro ayamāhāro anuppannassa vā kāmacchandassa uppādāya, uppannassa vā kāmacchandassa bhiyyobhāvāya vepullāyā’’ti (saṃ. ni. 5.232)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ subhanimitte ayonisomanasikārena uppajjantassa kāmacchandassa tappaṭipakkhato asubhanimitte yonisomanasikārena pahānaṃ hoti. Tattha asubhanimittaṃ nāma asubhampi asubhārammaṇampi, yonisomanasikāro nāma upāyamanasikāro, pathamanasikāro, anicce aniccanti vā, dukkhe dukkhanti vā, anattani anattāti vā, asubhe asubhanti vā manasikāro. Taṃ tattha bahulaṃ pavattayato kāmacchando pahīyati. Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Atthi, bhikkhave, asubhanimittaṃ. Tattha yonisomanasikārabahulīkāro – ayamāhāro anuppannassa vā kāmacchandassa anuppādāya, uppannassa vā kāmacchandassa pahānāyā’’ti (saṃ. ni. 5.232)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Apica cha dhammā kāmacchandassa pahānāya saṃvattanti – asubhanimittassa uggaho, asubhabhāvanānuyogo, indriyesu guttadvāratā, bhojane mattaññutā, kalyāṇamittatā, sappāyakathāti. Dasavidhañhi asubhanimittaṃ uggaṇhantassapi kāmacchando pahīyati, bhāventassapi ",
      ", indriyesu pihitadvārassapi ",
      " catunnaṃ pañcannaṃ ālopānaṃ okāse sati udakaṃ pivitvā yāpanasīlatāya bhojane mattaññunopi. Tena vuttaṃ –"
    ],
    "innerText": "Apica cha dhammā kāmacchandassa pahānāya saṃvattanti – asubhanimittassa uggaho, asubhabhāvanānuyogo, indriyesu guttadvāratā, bhojane mattaññutā, kalyāṇamittatā, sappāyakathāti. Dasavidhañhi asubhanimittaṃ uggaṇhantassapi kāmacchando pahīyati, bhāventassapi , indriyesu pihitadvārassapi catunnaṃ pañcannaṃ ālopānaṃ okāse sati udakaṃ pivitvā yāpanasīlatāya bhojane mattaññunopi. Tena vuttaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Cattāro ",
      " pañca ālope, abhutvā udakaṃ pive;"
    ],
    "innerText": "‘‘Cattāro pañca ālope, abhutvā udakaṃ pive;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Alaṃ phāsuvihārāya, pahitattassa bhikkhuno’’ti. (theragā. 983);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Asubhakammikatissattherasadise kalyāṇamitte sevantassapi kāmacchando pahīyati, ṭhānanisajjādīsu dasaasubhanissitasappāyakathāyapi pahīyati. Tena vuttaṃ ‘‘cha dhammā kāmacchandassa pahānāya saṃvattantī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Paṭighanimitte āyonisomanasikārena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "byāpādassa"
      },
      " uppādo hoti. Tattha paṭighampi paṭighanimittaṃ, paṭighārammaṇampi paṭighanimittaṃ. Ayonisomanasikāro sabbattha ekalakkhaṇo eva. Taṃ tasmiṃ nimitte bahulaṃ pavattayato byāpādo uppajjati. Tenāha bhagavā –"
    ],
    "innerText": "Paṭighanimitte āyonisomanasikārena byāpādassa uppādo hoti. Tattha paṭighampi paṭighanimittaṃ, paṭighārammaṇampi paṭighanimittaṃ. Ayonisomanasikāro sabbattha ekalakkhaṇo eva. Taṃ tasmiṃ nimitte bahulaṃ pavattayato byāpādo uppajjati. Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Atthi, bhikkhave, paṭighanimittaṃ. Tattha ayonisomanasikārabahulīkāro – ayamāhāro anuppannassa vā byāpādassa uppādāya, uppannassa vā byāpādassa bhiyyobhāvāya vepullāyā’’ti (saṃ. ni. 5.232)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Mettāya pana cetovimuttiyā yonisomanasikārenassa pahānaṃ hoti. Tattha ‘‘mettā’’ti vutte appanāpi upacāropi vaṭṭati, ‘‘cetovimuttī’’ti pana appanāva. Yonisomanasikāro vuttalakkhaṇova. Taṃ tattha bahulaṃ pavattayato byāpādo pahīyati. Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Atthi, bhikkhave, mettācetovimutti. Tattha yonisomanasikārabahulīkāro ayamāhāro anuppannassa vā byāpādassa anuppādāya uppannassa vā byāpādassa pahānāyā’’ti (saṃ. ni. 5.232)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Apica cha dhammā byāpādassa pahānāya saṃvattanti – mettānimittassa uggaho, mettābhāvanā, kammassakatāpaccavekkhaṇā, paṭisaṅkhānabahulatā, kalyāṇamittatā, sappāyakathāti. Odhisakānodhisakadisāpharaṇānañhi aññataravasena mettaṃ uggaṇhantassapi byāpādo pahīyati, odhiso anodhiso disāpharaṇavasena mettaṃ bhāventassapi byāpādo pahīyati, ‘‘tvaṃ etassa kuddho ",
      " kiṃ karissasi, kimassa sīlādīni ",
      " vināsetuṃ sakkhissasi nanu tvaṃ attano kammena āgantvā attano kammeneva gamissasi, parassa kujjhanaṃ nāma vītaccikaṅgāratattaayasalākagūthādīni gahetvā paraṃ ",
      " paharitukāmatā viya hoti. Esopi tava kuddho kiṃ karissati, kiṃ te sīlādīni vināsetuṃ sakkhissati esa attano kammena āgantvā attano kammeneva gamissati, appaṭicchitapaheṇakaṃ viya, paṭivātaṃ khittarajomuṭṭhi viya ca etasseva esa kodho matthake patissatī’’ti evaṃ attano ca parassa cāti ubhayesaṃ kammassakataṃ paccavekkhatopi, paccavekkhitvā paṭisaṅkhāne ṭhitassapi, assaguttattherasadise mettābhāvanārate kalyāṇamitte sevantassāpi byāpādo pahīyati, ṭhānanisajjādīsu mettānissitasappāyakathāyapi pahīyati. Tena vuttaṃ ‘‘cha dhammā byāpādassa pahānāya saṃvattantī’’ti."
    ],
    "innerText": "Apica cha dhammā byāpādassa pahānāya saṃvattanti – mettānimittassa uggaho, mettābhāvanā, kammassakatāpaccavekkhaṇā, paṭisaṅkhānabahulatā, kalyāṇamittatā, sappāyakathāti. Odhisakānodhisakadisāpharaṇānañhi aññataravasena mettaṃ uggaṇhantassapi byāpādo pahīyati, odhiso anodhiso disāpharaṇavasena mettaṃ bhāventassapi byāpādo pahīyati, ‘‘tvaṃ etassa kuddho kiṃ karissasi, kimassa sīlādīni vināsetuṃ sakkhissasi nanu tvaṃ attano kammena āgantvā attano kammeneva gamissasi, parassa kujjhanaṃ nāma vītaccikaṅgāratattaayasalākagūthādīni gahetvā paraṃ paharitukāmatā viya hoti. Esopi tava kuddho kiṃ karissati, kiṃ te sīlādīni vināsetuṃ sakkhissati esa attano kammena āgantvā attano kammeneva gamissati, appaṭicchitapaheṇakaṃ viya, paṭivātaṃ khittarajomuṭṭhi viya ca etasseva esa kodho matthake patissatī’’ti evaṃ attano ca parassa cāti ubhayesaṃ kammassakataṃ paccavekkhatopi, paccavekkhitvā paṭisaṅkhāne ṭhitassapi, assaguttattherasadise mettābhāvanārate kalyāṇamitte sevantassāpi byāpādo pahīyati, ṭhānanisajjādīsu mettānissitasappāyakathāyapi pahīyati. Tena vuttaṃ ‘‘cha dhammā byāpādassa pahānāya saṃvattantī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aratiādīsu ayonisomanasikārena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "thinamiddhassa"
      },
      " uppādo hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Arati"
      },
      " nāma ukkaṇṭhitatā, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tandī"
      },
      " nāma kāyālasiyaṃ, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vijambhitā"
      },
      " nāma kāyavinamanā, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhattasammado"
      },
      " nāma bhattamucchā bhattapariḷāho, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cetaso līnattaṃ"
      },
      " nāma cittassa līnākāro. Imesu aratiādīsu ayonisomanasikāraṃ bahulaṃ pavattayato thinamiddhaṃ uppajjati. Tenāha bhagavā –"
    ],
    "innerText": "Aratiādīsu ayonisomanasikārena thinamiddhassa uppādo hoti. Arati nāma ukkaṇṭhitatā, tandī nāma kāyālasiyaṃ, vijambhitā nāma kāyavinamanā, bhattasammado nāma bhattamucchā bhattapariḷāho, cetaso līnattaṃ nāma cittassa līnākāro. Imesu aratiādīsu ayonisomanasikāraṃ bahulaṃ pavattayato thinamiddhaṃ uppajjati. Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Atthi, bhikkhave, arati tandī vijambhitā bhattasammado cetaso līnattaṃ. Tattha ayonisomanasikārabahulīkāro – ayamāhāro anuppannassa vā thinamiddhassa uppādāya, uppannassa vā thinamiddhassa bhiyyobhāvāya vepullāyā’’ti (saṃ. ni. 5.232)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ārambhadhātuādīsu pana yonisomanasikārena thinamiddhassa pahānaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ārambhadhātu"
      },
      " nāma paṭhamārambhavīriyaṃ, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nikkamadhātu"
      },
      " nāma kosajjato nikkhantatāya tato balavataraṃ, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "parakkamadhātu"
      },
      " nāma paraṃ paraṃ ṭhānaṃ akkamanato tatopi balavataraṃ. Imasmiṃ tippabhede vīriye yonisomanasikāraṃ bahulaṃ pavattayato thinamiddhaṃ pahīyati. Tenāha –"
    ],
    "innerText": "Ārambhadhātuādīsu pana yonisomanasikārena thinamiddhassa pahānaṃ hoti. Ārambhadhātu nāma paṭhamārambhavīriyaṃ, nikkamadhātu nāma kosajjato nikkhantatāya tato balavataraṃ, parakkamadhātu nāma paraṃ paraṃ ṭhānaṃ akkamanato tatopi balavataraṃ. Imasmiṃ tippabhede vīriye yonisomanasikāraṃ bahulaṃ pavattayato thinamiddhaṃ pahīyati. Tenāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Atthi, bhikkhave, ārambhadhātu, nikkamadhātu, parakkamadhātu. Tattha yonisomanasikārabahulīkāro – ayamāhāro anuppannassa ",
      " vā thinamiddhassa anuppādāya, uppannassa vā thinamiddhassa pahānāyā’’ti (saṃ. ni. 5.232)."
    ],
    "innerText": "‘‘Atthi, bhikkhave, ārambhadhātu, nikkamadhātu, parakkamadhātu. Tattha yonisomanasikārabahulīkāro – ayamāhāro anuppannassa vā thinamiddhassa anuppādāya, uppannassa vā thinamiddhassa pahānāyā’’ti (saṃ. ni. 5.232)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Apica cha dhammā thinamiddhassa pahānāya saṃvattanti, atibhojane nimittaggāho – iriyāpathasamparivattanatā, ālokasaññāmanasikāro ",
      ", abbhokāsavāso, kalyāṇamittatā, sappāyakathāti ",
      ". Āharahatthakabhuttavamitakatatthavaṭṭakaalaṃsāṭakakākamāsakabhojanaṃ bhuñjitvā rattiṭṭhānadivāṭṭhāne nisinnassa hi samaṇadhammaṃ karoto thinamiddhaṃ mahāhatthī viya ottharantaṃ āgacchati, catupañcaālopaokāsaṃ pana ṭhapetvā pānīyaṃ pivitvā yāpanasīlassa bhikkhuno taṃ na hoti. Evaṃ atibhojane nimittaṃ gaṇhantassapi thinamiddhaṃ pahīyati. Yasmiṃ iriyāpathe thinamiddhaṃ okkamati, tato aññaṃ parivattentassapi, rattiṃ candālokaṃ dīpālokaṃ ukkālokaṃ divā sūriyālokaṃ manasikarontassapi, abbhokāse vasantassapi mahākassapattherasadise vigatathinamiddhe kalyāṇamitte sevantassapi thinamiddhaṃ pahīyati, ṭhānanisajjādīsu dhutaṅganissitasappāyakathāyapi pahīyati. Tena vuttaṃ ‘‘cha dhammā thinamiddhassa pahānāya saṃvattantī’’ti."
    ],
    "innerText": "Apica cha dhammā thinamiddhassa pahānāya saṃvattanti, atibhojane nimittaggāho – iriyāpathasamparivattanatā, ālokasaññāmanasikāro , abbhokāsavāso, kalyāṇamittatā, sappāyakathāti . Āharahatthakabhuttavamitakatatthavaṭṭakaalaṃsāṭakakākamāsakabhojanaṃ bhuñjitvā rattiṭṭhānadivāṭṭhāne nisinnassa hi samaṇadhammaṃ karoto thinamiddhaṃ mahāhatthī viya ottharantaṃ āgacchati, catupañcaālopaokāsaṃ pana ṭhapetvā pānīyaṃ pivitvā yāpanasīlassa bhikkhuno taṃ na hoti. Evaṃ atibhojane nimittaṃ gaṇhantassapi thinamiddhaṃ pahīyati. Yasmiṃ iriyāpathe thinamiddhaṃ okkamati, tato aññaṃ parivattentassapi, rattiṃ candālokaṃ dīpālokaṃ ukkālokaṃ divā sūriyālokaṃ manasikarontassapi, abbhokāse vasantassapi mahākassapattherasadise vigatathinamiddhe kalyāṇamitte sevantassapi thinamiddhaṃ pahīyati, ṭhānanisajjādīsu dhutaṅganissitasappāyakathāyapi pahīyati. Tena vuttaṃ ‘‘cha dhammā thinamiddhassa pahānāya saṃvattantī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Cetaso avūpasame ayonisomanasikārena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uddhaccakukkuccassa"
      },
      " uppādo hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avūpasamo"
      },
      " nāma avūpasantākāro, atthato taṃ uddhaccakukkuccameva. Tattha ayonisomanasikāraṃ bahulaṃ pavattayato uddhaccakukkuccaṃ uppajjati. Tenāha –"
    ],
    "innerText": "Cetaso avūpasame ayonisomanasikārena uddhaccakukkuccassa uppādo hoti. Avūpasamo nāma avūpasantākāro, atthato taṃ uddhaccakukkuccameva. Tattha ayonisomanasikāraṃ bahulaṃ pavattayato uddhaccakukkuccaṃ uppajjati. Tenāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Atthi, bhikkhave, cetaso avūpasamo. Tattha ayonisomanasikārabahulīkāro – ayamāhāro anuppannassa vā uddhaccakukkuccassa uppādāya, uppannassa vā uddhaccakukkuccassa bhiyyobhāvāya vepullāyā’’ti (saṃ. ni. 5.232)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Samādhisaṅkhāte pana cetaso vūpasame yonisomanasikārenassa pahānaṃ hoti. Tenāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Atthi, bhikkhave, cetaso vūpasamo. Tattha yonisomanasikārabahulīkāro – ayamāhāro anuppannassa vā uddhaccakukkuccassa anuppādāya, uppannassa vā uddhaccakukkuccassa pahānāyā’’ti (saṃ. ni. 5.232)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Apica ",
      " cha dhammā uddhaccakukkuccassa pahānāya saṃvattanti – bahussutatā, paripucchakatā, vinaye pakataññutā, vuḍḍhasevitā, kalyāṇamittatā, sappāyakathāti. Bāhusaccenapi hi ekaṃ vā dve vā tayo vā cattāro vā pañca vā nikāye pāḷivasena ca atthavasena ca uggaṇhantassapi uddhaccakukkuccaṃ pahīyati, kappiyākappiyaparipucchābahulassapi, vinayapaññattiyaṃ ciṇṇavasībhāvatāya pakataññunopi ",
      ", vuḍḍhe mahallakatthere upasaṅkamantassapi, upālittherasadise vinayadhare kalyāṇamitte sevantassapi uddhaccakukkuccaṃ pahīyati, ṭhānanisajjādīsu ",
      " kappiyākappiyanissitasappāyakathāyapi pahīyati. Tena vuttaṃ ‘‘cha dhammā uddhaccakukkuccassa pahānāya saṃvattantī’’ti."
    ],
    "innerText": "Apica cha dhammā uddhaccakukkuccassa pahānāya saṃvattanti – bahussutatā, paripucchakatā, vinaye pakataññutā, vuḍḍhasevitā, kalyāṇamittatā, sappāyakathāti. Bāhusaccenapi hi ekaṃ vā dve vā tayo vā cattāro vā pañca vā nikāye pāḷivasena ca atthavasena ca uggaṇhantassapi uddhaccakukkuccaṃ pahīyati, kappiyākappiyaparipucchābahulassapi, vinayapaññattiyaṃ ciṇṇavasībhāvatāya pakataññunopi , vuḍḍhe mahallakatthere upasaṅkamantassapi, upālittherasadise vinayadhare kalyāṇamitte sevantassapi uddhaccakukkuccaṃ pahīyati, ṭhānanisajjādīsu kappiyākappiyanissitasappāyakathāyapi pahīyati. Tena vuttaṃ ‘‘cha dhammā uddhaccakukkuccassa pahānāya saṃvattantī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vicikicchāṭṭhāniyesu dhammesu ayonisomanasikārena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vicikicchāya"
      },
      " uppādo hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vicikicchāṭṭhāniyā dhammā"
      },
      " nāma punappunaṃ vicikicchāya kāraṇattā vicikicchāva. Tattha ayonisomanasikāraṃ bahulaṃ pavattayato vicikicchā uppajjati. Tenāha –"
    ],
    "innerText": "Vicikicchāṭṭhāniyesu dhammesu ayonisomanasikārena vicikicchāya uppādo hoti. Vicikicchāṭṭhāniyā dhammā nāma punappunaṃ vicikicchāya kāraṇattā vicikicchāva. Tattha ayonisomanasikāraṃ bahulaṃ pavattayato vicikicchā uppajjati. Tenāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Atthi, bhikkhave, vicikicchāṭṭhāniyā dhammā. Tattha ayonisomanasikārabahulīkāro – ayamāhāro anuppannāya vā vicikicchāya uppādāya, uppannāya vā vicikicchāya bhiyyobhāvāya vepullāyā’’ti (saṃ. ni. 5.232)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kusalādidhammesu pana yonisomanasikārena vicikicchāya pahānaṃ hoti. Tenāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Atthi, bhikkhave, kusalākusalā dhammā, sāvajjānavajjā dhammā, sevitabbāsevitabbā dhammā, hīnapaṇītā dhammā, kaṇhasukkasappaṭibhāgā dhammā. Tattha yonisomanasikārabahulīkāro ayamāhāro anuppannāya vā vicikicchāya anuppādāya, uppannāya vā vicikicchāya pahānāyā’’ti (saṃ. ni. 5.232)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Apica cha dhammā vicikicchāya pahānāya saṃvattanti bahussutatā, paripucchakatā, vinaye pakataññutā, adhimokkhabahulatā, kalyāṇamittatā, sappāyakathāti ",
      ". Bāhusaccavasenapi hi ekaṃ vā…pe… pañca vā nikāye pāḷivasena ca atthavasena ca uggaṇhantassapi vicikicchā pahīyati, tīṇi ratanāni ārabbha kusalādibhedesu dhammesu paripucchābahulassapi, vinaye ciṇṇavasībhāvassapi, tīsu ratanesu okappanīya, saddhāsaṅkhāta, adhimokkhabahulassapi, saddhādhimutte vakkalittherasadise kalyāṇamitte sevantassapi vicikicchā pahīyati, ṭhānanisajjādīsu tiṇṇaṃ ratanānaṃ guṇanissitasappāyakathāyapi pahīyati. Tena vuttaṃ ‘‘cha dhammā vicikicchāya pahānāya saṃvattantī’’ti."
    ],
    "innerText": "Apica cha dhammā vicikicchāya pahānāya saṃvattanti bahussutatā, paripucchakatā, vinaye pakataññutā, adhimokkhabahulatā, kalyāṇamittatā, sappāyakathāti . Bāhusaccavasenapi hi ekaṃ vā…pe… pañca vā nikāye pāḷivasena ca atthavasena ca uggaṇhantassapi vicikicchā pahīyati, tīṇi ratanāni ārabbha kusalādibhedesu dhammesu paripucchābahulassapi, vinaye ciṇṇavasībhāvassapi, tīsu ratanesu okappanīya, saddhāsaṅkhāta, adhimokkhabahulassapi, saddhādhimutte vakkalittherasadise kalyāṇamitte sevantassapi vicikicchā pahīyati, ṭhānanisajjādīsu tiṇṇaṃ ratanānaṃ guṇanissitasappāyakathāyapi pahīyati. Tena vuttaṃ ‘‘cha dhammā vicikicchāya pahānāya saṃvattantī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettha ca yathāvuttehi tehi tehi dhammehi vikkhambhanavasena pahīnānaṃ imesaṃ nīvaraṇānaṃ kāmacchandanīvaraṇassa tāva arahattamaggena accantappahānaṃ hoti, tathā thinamiddhanīvaraṇassa uddhaccanīvaraṇassa ca ",
      ". Byāpādanīvaraṇassa ",
      " pana kukkuccanīvaraṇassa ca anāgāmimaggena, vicikicchānīvaraṇassa sotāpattimaggena accantappahānaṃ hoti. Tasmā tesaṃ tathā pahānāya upakāradhamme dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘āraddhaṃ hoti vīriya’’"
      },
      "ntiādi āraddhaṃ. Idameva vā yathāvuttaṃ abhijjhādīnaṃ nīvaraṇānaṃ pahānaṃ, yasmā hīnavīriyatāya kusītena, anupaṭṭhitassatitāya muṭṭhassatinā, apaṭippassaddhadarathatāya sāraddhakāyena, asamāhitatāya vikkhittacittena na kadācipi te sakkā nibbattetuṃ, pageva itaraṃ, tasmā yathā paṭipannassa so abhijjhādīnaṃ vigamo pahānaṃ sambhavati, taṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘āraddhaṃ hoti vīriya’’"
      },
      "ntiādi āraddhaṃ. Tassattho – tesaṃ nīvaraṇānaṃ pahānāya sabbesampi vā saṃkilesadhammānaṃ samucchindanatthāya vīriyaṃ āraddhaṃ hoti, paggahitaṃ asithilappavattanti vuttaṃ hoti. Āraddhattā eva ca antarā saṅkocassa anāpajjanato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asallīnaṃ"
      },
      "."
    ],
    "innerText": "Ettha ca yathāvuttehi tehi tehi dhammehi vikkhambhanavasena pahīnānaṃ imesaṃ nīvaraṇānaṃ kāmacchandanīvaraṇassa tāva arahattamaggena accantappahānaṃ hoti, tathā thinamiddhanīvaraṇassa uddhaccanīvaraṇassa ca . Byāpādanīvaraṇassa pana kukkuccanīvaraṇassa ca anāgāmimaggena, vicikicchānīvaraṇassa sotāpattimaggena accantappahānaṃ hoti. Tasmā tesaṃ tathā pahānāya upakāradhamme dassetuṃ ‘‘āraddhaṃ hoti vīriya’’ntiādi āraddhaṃ. Idameva vā yathāvuttaṃ abhijjhādīnaṃ nīvaraṇānaṃ pahānaṃ, yasmā hīnavīriyatāya kusītena, anupaṭṭhitassatitāya muṭṭhassatinā, apaṭippassaddhadarathatāya sāraddhakāyena, asamāhitatāya vikkhittacittena na kadācipi te sakkā nibbattetuṃ, pageva itaraṃ, tasmā yathā paṭipannassa so abhijjhādīnaṃ vigamo pahānaṃ sambhavati, taṃ dassetuṃ ‘‘āraddhaṃ hoti vīriya’’ntiādi āraddhaṃ. Tassattho – tesaṃ nīvaraṇānaṃ pahānāya sabbesampi vā saṃkilesadhammānaṃ samucchindanatthāya vīriyaṃ āraddhaṃ hoti, paggahitaṃ asithilappavattanti vuttaṃ hoti. Āraddhattā eva ca antarā saṅkocassa anāpajjanato asallīnaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upaṭṭhitā sati asammuṭṭhā"
      },
      "ti na kevalañca vīriyameva, satipi ārammaṇābhimukhabhāvena upaṭṭhitā hoti, tathā upaṭṭhitattā eva ca cirakatacirabhāsitānaṃ saraṇasamatthatāya asammuṭṭhā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Passaddho"
      },
      "ti kāyacittadarathappassambhanena kāyopissa passaddho hoti. Tattha yasmā nāmakāye passaddhe rūpakāyopissa passaddho eva hoti, tasmā ‘‘nāmakāyo rūpakāyo’’ti avisesetvā ‘‘passaddho kāyo’’ti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asāraddho"
      },
      "ti so ca passaddhattā eva asāraddho, vigatadarathoti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samāhitaṃ cittaṃ ekagga"
      },
      "nti cittampissa sammā āhitaṃ suṭṭhu ṭhapitaṃ appitaṃ viya hoti, samāhitattā eva ca ekaggaṃ acalaṃ nipphandanaṃ niriñjananti."
    ],
    "innerText": "Upaṭṭhitā sati asammuṭṭhāti na kevalañca vīriyameva, satipi ārammaṇābhimukhabhāvena upaṭṭhitā hoti, tathā upaṭṭhitattā eva ca cirakatacirabhāsitānaṃ saraṇasamatthatāya asammuṭṭhā. Passaddhoti kāyacittadarathappassambhanena kāyopissa passaddho hoti. Tattha yasmā nāmakāye passaddhe rūpakāyopissa passaddho eva hoti, tasmā ‘‘nāmakāyo rūpakāyo’’ti avisesetvā ‘‘passaddho kāyo’’ti vuttaṃ. Asāraddhoti so ca passaddhattā eva asāraddho, vigatadarathoti vuttaṃ hoti. Samāhitaṃ cittaṃ ekagganti cittampissa sammā āhitaṃ suṭṭhu ṭhapitaṃ appitaṃ viya hoti, samāhitattā eva ca ekaggaṃ acalaṃ nipphandanaṃ niriñjananti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettāvatā ",
      " jhānamaggānaṃ pubbabhāgapaṭipadā kathitā. Tenevāha –"
    ],
    "innerText": "Ettāvatā jhānamaggānaṃ pubbabhāgapaṭipadā kathitā. Tenevāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Carampi, bhikkhave, bhikkhu evaṃbhūto ātāpī ottāpī satataṃ samitaṃ āraddhavīriyo pahitattoti vuccatī’’ti (itivu. 110)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassattho heṭṭhā vutto eva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Gāthāsu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yataṃ care"
      },
      "ti yatamāno careyya, caṅkamanādivasena gamanaṃ kappentopi ‘‘anuppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ anuppādāya chandaṃ janeti vāyamatī’’tiādinā ",
      " (saṃ. ni. 5.651-662; vibha. 390) nayena vuttasammappadhānavīriyavasena yatanto ghaṭento vāyamanto yathā akusalā dhammā pahīyanti, kusalā dhammā bhāvanāpāripūriṃ gacchanti, evaṃ gamanaṃ ",
      " kappeyyāti attho. Esa nayo sesesupi. Keci pana ‘‘yata’’nti etassa saṃyatoti atthaṃ vadanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tiṭṭhe"
      },
      "ti tiṭṭheyya ṭhānaṃ kappeyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Acche"
      },
      "ti nisīdeyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saye"
      },
      "ti nipajjeyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yatamenaṃ pasāraye"
      },
      "ti etaṃ pasāretabbaṃ hatthapādādiṃ yataṃ yatamāno yathāvuttavīriyasamaṅgīyeva hutvā pasāreyya, sabbattha pamādaṃ vijaheyyāti adhippāyo."
    ],
    "innerText": "Gāthāsu yataṃ careti yatamāno careyya, caṅkamanādivasena gamanaṃ kappentopi ‘‘anuppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ anuppādāya chandaṃ janeti vāyamatī’’tiādinā (saṃ. ni. 5.651-662; vibha. 390) nayena vuttasammappadhānavīriyavasena yatanto ghaṭento vāyamanto yathā akusalā dhammā pahīyanti, kusalā dhammā bhāvanāpāripūriṃ gacchanti, evaṃ gamanaṃ kappeyyāti attho. Esa nayo sesesupi. Keci pana ‘‘yata’’nti etassa saṃyatoti atthaṃ vadanti. Tiṭṭheti tiṭṭheyya ṭhānaṃ kappeyya. Accheti nisīdeyya. Sayeti nipajjeyya. Yatamenaṃ pasārayeti etaṃ pasāretabbaṃ hatthapādādiṃ yataṃ yatamāno yathāvuttavīriyasamaṅgīyeva hutvā pasāreyya, sabbattha pamādaṃ vijaheyyāti adhippāyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni yathā paṭipajjanto yataṃ yatamāno nāma hoti, taṃ paṭipadaṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘uddha’’"
      },
      "ntiādi vuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uddha"
      },
      "nti upari. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tiriya"
      },
      "nti tiriyato, puratthimadisādivasena samantato disābhāgesūti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Apācīna"
      },
      "nti heṭṭhā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yāvatā jagato gatī"
      },
      "ti yattakā sattasaṅkhārabhedassa lokassa pavatti, tattha sabbatthāti attho. Ettāvatā anavasesato sammasanañāṇassa visayaṃ saṅgahetvā dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samavekkhitā"
      },
      "ti sammā hetunā ñāyena avekkhitā, aniccādivasena vipassakoti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammāna"
      },
      "nti sattasuññānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khandhāna"
      },
      "nti rūpādīnaṃ pañcannaṃ khandhānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Udayabbaya"
      },
      "nti udayañca vayañca. Idaṃ vuttaṃ hoti – upari tiriyaṃ adhoti tisaṅgahe sabbasmiṃ loke atītādibhedabhinnānaṃ pañcupādānakkhandhasaṅkhātānaṃ sabbesaṃ rūpārūpadhammānaṃ aniccatādisammasanādhigatena udayabbayañāṇena pañcavīsatiyā ākārehi udayaṃ, pañcavīsatiyā ākārehi vayañca samavekkhitā samanupassitā bhaveyyāti."
    ],
    "innerText": "Idāni yathā paṭipajjanto yataṃ yatamāno nāma hoti, taṃ paṭipadaṃ dassetuṃ ‘‘uddha’’ntiādi vuttaṃ. Tattha uddhanti upari. Tiriyanti tiriyato, puratthimadisādivasena samantato disābhāgesūti attho. Apācīnanti heṭṭhā. Yāvatā jagato gatīti yattakā sattasaṅkhārabhedassa lokassa pavatti, tattha sabbatthāti attho. Ettāvatā anavasesato sammasanañāṇassa visayaṃ saṅgahetvā dasseti. Samavekkhitāti sammā hetunā ñāyena avekkhitā, aniccādivasena vipassakoti vuttaṃ hoti. Dhammānanti sattasuññānaṃ. Khandhānanti rūpādīnaṃ pañcannaṃ khandhānaṃ. Udayabbayanti udayañca vayañca. Idaṃ vuttaṃ hoti – upari tiriyaṃ adhoti tisaṅgahe sabbasmiṃ loke atītādibhedabhinnānaṃ pañcupādānakkhandhasaṅkhātānaṃ sabbesaṃ rūpārūpadhammānaṃ aniccatādisammasanādhigatena udayabbayañāṇena pañcavīsatiyā ākārehi udayaṃ, pañcavīsatiyā ākārehi vayañca samavekkhitā samanupassitā bhaveyyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cetosamathasāmīci"
      },
      "nti ",
      " cittasaṃkilesānaṃ accantavūpasamanato ",
      " cetosamathasaṅkhātassa ariyamaggassa anucchavikapaṭipadaṃ ñāṇadassanavisuddhiṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sikkhamāna"
      },
      "nti paṭipajjamānaṃ bhāventaṃ ñāṇaparamparaṃ nibbattentaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sadā"
      },
      "ti sabbakālaṃ, rattiñceva divā ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sata"
      },
      "nti catusampajaññena samannāgatāya satiyā satokāriṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Satataṃ pahitatto"
      },
      "ti sabbakālaṃ pahitatto nibbānaṃ paṭipesitattoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tathāvidhaṃ bhikkhuṃ"
      },
      " buddhādayo ariyā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āhu"
      },
      " ācikkhanti kathenti. Sesaṃ vuttanayameva."
    ],
    "innerText": "Cetosamathasāmīcinti cittasaṃkilesānaṃ accantavūpasamanato cetosamathasaṅkhātassa ariyamaggassa anucchavikapaṭipadaṃ ñāṇadassanavisuddhiṃ. Sikkhamānanti paṭipajjamānaṃ bhāventaṃ ñāṇaparamparaṃ nibbattentaṃ. Sadāti sabbakālaṃ, rattiñceva divā ca. Satanti catusampajaññena samannāgatāya satiyā satokāriṃ. Satataṃ pahitattoti sabbakālaṃ pahitatto nibbānaṃ paṭipesitattoti tathāvidhaṃ bhikkhuṃ buddhādayo ariyā āhu ācikkhanti kathenti. Sesaṃ vuttanayameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dvādasamasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "13. Lokasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "112"
      },
      ". Terasame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "loko"
      },
      "ti lujjanapalujjanaṭṭhena loko, atthato purimaṃ ariyasaccadvayaṃ idha pana dukkhaṃ ariyasaccaṃ veditabbaṃ. Svāyaṃ sattaloko, saṅkhāraloko, okāsalokoti vibhāgato ",
      " sarūpato ca heṭṭhā vuttoyeva. Apica khandhalokādivasena ca anekavidho loko. Yathāha –"
    ],
    "innerText": "112. Terasame lokoti lujjanapalujjanaṭṭhena loko, atthato purimaṃ ariyasaccadvayaṃ idha pana dukkhaṃ ariyasaccaṃ veditabbaṃ. Svāyaṃ sattaloko, saṅkhāraloko, okāsalokoti vibhāgato sarūpato ca heṭṭhā vuttoyeva. Apica khandhalokādivasena ca anekavidho loko. Yathāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Lokoti khandhaloko, dhātuloko, āyatanaloko, vipattibhavaloko, vipattisambhavaloko, sampattibhavaloko, sampattisambhavaloko, eko loko sabbe sattā ahāraṭṭhitikā, dve lokā nāmañca rūpañca, tayo lokā tisso vedanā, cattāro lokā cattāro āhārā, pañca lokā pañcupādānakkhandhā, cha lokā cha ajjhattikāni āyatanāni, satta lokā satta viññāṇaṭṭhitiyo, aṭṭha lokā aṭṭha lokadhammā, nava lokā nava sattāvāsā, dasa lokā dasāyatanāni, dvādasa lokā dvādasāyatanāni, aṭṭhārasa lokā aṭṭhārasa dhātuyo’’ti (mahāni. 3; cūḷani. ajitamāṇavapucchāniddesa 2)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evamanekadhā vibhattopi loko pañcasu upādānakkhandhesu eva saṅgahaṃ samosaraṇaṃ gacchati, upādānakkhandhā ca dukkhaṃ ariyasaccaṃ jātipi dukkhā ",
      " …pe… saṃkhittena pañcupādānakkhandhāpi dukkhāti. Tena vuttaṃ ‘‘atthato purimaṃ ariyasaccadvayaṃ, idha pana dukkhaṃ ariyasaccaṃ veditabba’’nti. Nanu ca lujjanapalujjanaṭṭho avisesena pañcasu khandhesu sambhavatīti? Saccaṃ sambhavati. Yaṃ pana na lujjatīti gahitaṃ, taṃ tathā na hoti, ekaṃseneva lujjati palujjatīti ",
      " so lokoti upādānakkhandhesveva lokasaddo nirūḷhoti veditabbo. Tasmā lokoti dukkhaṃ ariyasaccaṃ eva."
    ],
    "innerText": "Evamanekadhā vibhattopi loko pañcasu upādānakkhandhesu eva saṅgahaṃ samosaraṇaṃ gacchati, upādānakkhandhā ca dukkhaṃ ariyasaccaṃ jātipi dukkhā …pe… saṃkhittena pañcupādānakkhandhāpi dukkhāti. Tena vuttaṃ ‘‘atthato purimaṃ ariyasaccadvayaṃ, idha pana dukkhaṃ ariyasaccaṃ veditabba’’nti. Nanu ca lujjanapalujjanaṭṭho avisesena pañcasu khandhesu sambhavatīti? Saccaṃ sambhavati. Yaṃ pana na lujjatīti gahitaṃ, taṃ tathā na hoti, ekaṃseneva lujjati palujjatīti so lokoti upādānakkhandhesveva lokasaddo nirūḷhoti veditabbo. Tasmā lokoti dukkhaṃ ariyasaccaṃ eva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yadipi tathāgata-saddassa heṭṭhā tathāgatasutte nānānayehi vitthārato attho vibhatto, tathāpi pāḷiyā atthasaṃvaṇṇanāmukhena ayamatthavibhāvanā – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhisambuddho"
      },
      "ti ‘‘abhiññeyyato pariññeyyato’’ti pubbe vuttavibhāgena vā avisesato tāva āsayānusayacariyādhimuttiādibhedato kusalākusalādivibhāgato vaṭṭappamāṇasaṇṭhānādibhedato, visesato vā pana ‘‘ayaṃ sassatāsayo, ayaṃ ucchedāsayo’’tiādinā ‘‘kakkhaḷalakkhaṇā pathavīdhātu, paggharaṇalakkhaṇā āpodhātū’’tiādinā ca abhivisiṭṭhena sayambhuñāṇena sammā aviparītaṃ yo yo attho yathā yathā bujjhitabbo, tathā tathā buddho ñāto attapaccakkho katoti abhisambuddho."
    ],
    "innerText": "Yadipi tathāgata-saddassa heṭṭhā tathāgatasutte nānānayehi vitthārato attho vibhatto, tathāpi pāḷiyā atthasaṃvaṇṇanāmukhena ayamatthavibhāvanā – abhisambuddhoti ‘‘abhiññeyyato pariññeyyato’’ti pubbe vuttavibhāgena vā avisesato tāva āsayānusayacariyādhimuttiādibhedato kusalākusalādivibhāgato vaṭṭappamāṇasaṇṭhānādibhedato, visesato vā pana ‘‘ayaṃ sassatāsayo, ayaṃ ucchedāsayo’’tiādinā ‘‘kakkhaḷalakkhaṇā pathavīdhātu, paggharaṇalakkhaṇā āpodhātū’’tiādinā ca abhivisiṭṭhena sayambhuñāṇena sammā aviparītaṃ yo yo attho yathā yathā bujjhitabbo, tathā tathā buddho ñāto attapaccakkho katoti abhisambuddho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lokasmā"
      },
      "ti yathāvuttalokato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Visaṃyutto"
      },
      "ti visaṃsaṭṭho, tappaṭibaddhānaṃ sabbesaṃ saṃyojanānaṃ sammadeva samucchinnattā tato vippamuttoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lokasamudayo"
      },
      "ti suttantanayena taṇhā, abhidhammanayena ",
      " pana abhisaṅkhārehi saddhiṃ diyaḍḍhakilesasahassaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pahīno"
      },
      "ti bodhimaṇḍe arahattamaggañāṇena samucchedappahānavasena savāsanaṃ pahīno. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lokanirodho"
      },
      "ti nibbānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sacchikato"
      },
      "ti attapaccakkho kato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lokanirodhagāminī paṭipadā"
      },
      "ti sīlādikkhandhattayasaṅgaho ariyo aṭṭhaṅgiko maggo. So hi lokanirodhaṃ nibbānaṃ gacchati adhigacchati, tadatthaṃ ariyehi paṭipajjīyati cāti lokanirodhagāminī paṭipadāti vuccati."
    ],
    "innerText": "Lokasmāti yathāvuttalokato. Visaṃyuttoti visaṃsaṭṭho, tappaṭibaddhānaṃ sabbesaṃ saṃyojanānaṃ sammadeva samucchinnattā tato vippamuttoti attho. Lokasamudayoti suttantanayena taṇhā, abhidhammanayena pana abhisaṅkhārehi saddhiṃ diyaḍḍhakilesasahassaṃ. Pahīnoti bodhimaṇḍe arahattamaggañāṇena samucchedappahānavasena savāsanaṃ pahīno. Lokanirodhoti nibbānaṃ. Sacchikatoti attapaccakkho kato. Lokanirodhagāminī paṭipadāti sīlādikkhandhattayasaṅgaho ariyo aṭṭhaṅgiko maggo. So hi lokanirodhaṃ nibbānaṃ gacchati adhigacchati, tadatthaṃ ariyehi paṭipajjīyati cāti lokanirodhagāminī paṭipadāti vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ettāvatā tathāni abhisambuddho yāthāvato gatoti tathāgatoti ayamattho dassito hoti. Cattāri hi ariyasaccāni tathāni nāma. Yathāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Cattārimāni ",
      ", bhikkhave, tathāni avitathāni anaññathāni. Katamāni cattāri? Idaṃ dukkhanti, bhikkhave, tathametaṃ avitathametaṃ, anaññathameta’’nti (saṃ. ni. 5.1090) vitthāro."
    ],
    "innerText": "‘‘Cattārimāni , bhikkhave, tathāni avitathāni anaññathāni. Katamāni cattāri? Idaṃ dukkhanti, bhikkhave, tathametaṃ avitathametaṃ, anaññathameta’’nti (saṃ. ni. 5.1090) vitthāro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Apica tathāya gatoti tathāgato, tathaṃ gatoti tathāgato ",
      ", gatoti ca avagato atīto patto paṭipannoti attho. Idaṃ vuttaṃ hoti – yasmā bhagavā sakalalokaṃ tīraṇapariññāya tathāya aviparītāya gato avagato, tasmā loko tathāgatena abhisambuddhoti tathāgato. Lokasamudayaṃ pahānapariññāya tathāya gato atītoti tathāgato. Lokanirodhaṃ sacchikiriyāya tathāya gato pattoti tathāgato. Lokanirodhagāminiṃ paṭipadaṃ tathaṃ aviparītaṃ gato paṭipannoti tathāgatoti. Evaṃ imissā pāḷiyā bhagavato tathāgatabhāvadīpanavasena attho veditabbo."
    ],
    "innerText": "Apica tathāya gatoti tathāgato, tathaṃ gatoti tathāgato , gatoti ca avagato atīto patto paṭipannoti attho. Idaṃ vuttaṃ hoti – yasmā bhagavā sakalalokaṃ tīraṇapariññāya tathāya aviparītāya gato avagato, tasmā loko tathāgatena abhisambuddhoti tathāgato. Lokasamudayaṃ pahānapariññāya tathāya gato atītoti tathāgato. Lokanirodhaṃ sacchikiriyāya tathāya gato pattoti tathāgato. Lokanirodhagāminiṃ paṭipadaṃ tathaṃ aviparītaṃ gato paṭipannoti tathāgatoti. Evaṃ imissā pāḷiyā bhagavato tathāgatabhāvadīpanavasena attho veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Iti bhagavā catusaccābhisambodhanavasena attano tathāgatabhāvaṃ pakāsetvā idāni tattha diṭṭhādiabhisambodhivasenapi taṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yaṃ, bhikkhave’’"
      },
      "tiādimāha. Aṅguttaraṭṭhakathāyaṃ (a. ni. aṭṭha. 2.4.23) pana ‘‘catūhi saccehi attano buddhabhāvaṃ kathetvā’’tiādi vuttaṃ. Taṃ tathāgatasadda-buddhasaddānaṃ atthato ninnānākaraṇataṃ dassetuṃ vuttaṃ. Tathā ceva hi pāḷi pavattāti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "diṭṭha"
      },
      "nti rūpāyatanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suta"
      },
      "nti saddāyatanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Muta"
      },
      "nti patvā gahetabbato gandhāyatanaṃ, rasāyatanaṃ, phoṭṭhabbāyatanañca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Viññāta"
      },
      "nti sukhadukkhādidhammārammaṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Patta"
      },
      "nti pariyesitvā vā apariyesitvā vā pattaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pariyesita"
      },
      "nti pattaṃ vā appattaṃ vā pariyesitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anuvicaritaṃ manasā"
      },
      "ti cittena anusañcaritaṃ. Kassa pana anuvicaritaṃ manasāti? ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sadevakassa…pe… sadevamanussāyā"
      },
      "ti sambandhanīyaṃ. Tattha saha devehīti sadevako, tassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sadevakassa"
      },
      ". Sesapadesupi eseva nayo."
    ],
    "innerText": "Iti bhagavā catusaccābhisambodhanavasena attano tathāgatabhāvaṃ pakāsetvā idāni tattha diṭṭhādiabhisambodhivasenapi taṃ dassetuṃ ‘‘yaṃ, bhikkhave’’tiādimāha. Aṅguttaraṭṭhakathāyaṃ (a. ni. aṭṭha. 2.4.23) pana ‘‘catūhi saccehi attano buddhabhāvaṃ kathetvā’’tiādi vuttaṃ. Taṃ tathāgatasadda-buddhasaddānaṃ atthato ninnānākaraṇataṃ dassetuṃ vuttaṃ. Tathā ceva hi pāḷi pavattāti. Tattha diṭṭhanti rūpāyatanaṃ. Sutanti saddāyatanaṃ. Mutanti patvā gahetabbato gandhāyatanaṃ, rasāyatanaṃ, phoṭṭhabbāyatanañca. Viññātanti sukhadukkhādidhammārammaṇaṃ. Pattanti pariyesitvā vā apariyesitvā vā pattaṃ. Pariyesitanti pattaṃ vā appattaṃ vā pariyesitaṃ. Anuvicaritaṃ manasāti cittena anusañcaritaṃ. Kassa pana anuvicaritaṃ manasāti? Sadevakassa…pe… sadevamanussāyāti sambandhanīyaṃ. Tattha saha devehīti sadevako, tassa sadevakassa. Sesapadesupi eseva nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sadevakavacanena ",
      " cettha pañcakāmāvacaradevaggahaṇaṃ veditabbaṃ, samārakavacanena chaṭṭhakāmāvacaradevaggahaṇaṃ, sabrahmakavacanena brahmakāyikādibrahmaggahaṇaṃ, sassamaṇabrāhmaṇivacanena sāsanassa paccatthikasamaṇabrāhmaṇaggahaṇañceva samitapāpabāhitapāpasamaṇabrāhmaṇaggahaṇañca, pajāvacanena sattalokaggahaṇaṃ ",
      ", sadevamanussavacanena sammutidevaavasesamanussaggahaṇaṃ. Evamettha tīhi padehi devamārabrahmehi saddhiṃ sattaloko, dvīhi pajāvasena sattaloko gahitoti veditabbo."
    ],
    "innerText": "Sadevakavacanena cettha pañcakāmāvacaradevaggahaṇaṃ veditabbaṃ, samārakavacanena chaṭṭhakāmāvacaradevaggahaṇaṃ, sabrahmakavacanena brahmakāyikādibrahmaggahaṇaṃ, sassamaṇabrāhmaṇivacanena sāsanassa paccatthikasamaṇabrāhmaṇaggahaṇañceva samitapāpabāhitapāpasamaṇabrāhmaṇaggahaṇañca, pajāvacanena sattalokaggahaṇaṃ , sadevamanussavacanena sammutidevaavasesamanussaggahaṇaṃ. Evamettha tīhi padehi devamārabrahmehi saddhiṃ sattaloko, dvīhi pajāvasena sattaloko gahitoti veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aparo ",
      " nayo – sadevakaggahaṇena arūpāvacaradevaloko gahito, samārakavacanena chakāmāvacaradevaloko, sabrahmakavacanena rūpībrahmaloko, sassamaṇabrāhmaṇādivacanena sammutidevehi saha avasesasattaloko gahito. Apicettha sadevakavacanena ukkaṭṭhaparicchedato sabbalokavisayassa bhagavato abhisambuddhabhāve pakāsite yesamevaṃ siyā ‘‘māro nāma mahānubhāvo chakāmāvacarissaro vasavattī, brahmā pana tatopi mahānubhāvataro dasahi aṅgulīhi dasasu cakkavāḷasahassesu ālokaṃ pharati, uttamajjhānasamāpattisukhaṃ paṭisaṃvedeti. Puthū ca samaṇabrāhmaṇā iddhimanto dibbacakkhukā paracittaviduno mahānubhāvā saṃvijjanti. Ayañca sattakāyo ananto aparimāṇo, kimetesaṃ sabbesaṃyeva visayo anavasesato bhagavatā abhisambuddho’’ti? Tesaṃ vimatiṃ vidhamento bhagavā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sadevakassa lokassā’’"
      },
      "tiādimāha."
    ],
    "innerText": "Aparo nayo – sadevakaggahaṇena arūpāvacaradevaloko gahito, samārakavacanena chakāmāvacaradevaloko, sabrahmakavacanena rūpībrahmaloko, sassamaṇabrāhmaṇādivacanena sammutidevehi saha avasesasattaloko gahito. Apicettha sadevakavacanena ukkaṭṭhaparicchedato sabbalokavisayassa bhagavato abhisambuddhabhāve pakāsite yesamevaṃ siyā ‘‘māro nāma mahānubhāvo chakāmāvacarissaro vasavattī, brahmā pana tatopi mahānubhāvataro dasahi aṅgulīhi dasasu cakkavāḷasahassesu ālokaṃ pharati, uttamajjhānasamāpattisukhaṃ paṭisaṃvedeti. Puthū ca samaṇabrāhmaṇā iddhimanto dibbacakkhukā paracittaviduno mahānubhāvā saṃvijjanti. Ayañca sattakāyo ananto aparimāṇo, kimetesaṃ sabbesaṃyeva visayo anavasesato bhagavatā abhisambuddho’’ti? Tesaṃ vimatiṃ vidhamento bhagavā ‘‘sadevakassa lokassā’’tiādimāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Porāṇā panāhu – ‘‘sadevakassā’’ti devatāhi saddhiṃ avasesalokaṃ pariyādiyati, ‘‘samārakassā’’ti mārena saddhiṃ avasesalokaṃ, ‘‘sabrahmakassā’’ti brahmehi saddhiṃ avasesalokaṃ. Evaṃ sabbepi tibhavūpage satte tīsu padesu pakkhipitvā puna dvīhi padehi pariyādiyanto ‘‘sassamaṇabrāhmaṇiyā pajāya sadevamanussāyā’’ti āha. Evaṃ pañcahipi padehi khandhattayaparicchinne sabbasatte pariyādiyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yasmā taṃ tathāgatena abhisambuddha"
      },
      "nti iminā idaṃ dasseti – yaṃ aparimāṇāsu lokadhātūsu imassa sadevakassa lokassa ‘‘nīlaṃ pītaka’’ntiādi rūpārammaṇaṃ cakkhudvāre āpāthaṃ āgacchati, taṃ sabbaṃ ‘‘ayaṃ satto imasmiṃ khaṇe imaṃ nāma rūpārammaṇaṃ disvā sumano vā dummano vā majjhatto vā jāto’’ti tathāgatassa evaṃ abhisambuddhaṃ. Tathā yaṃ aparimāṇāsu lokadhātūsu imassa sadevakassa lokassa ‘‘bherisaddo mudiṅgasaddo’’tiādi saddārammaṇaṃ sotadvāre āpāthaṃ āgacchati, ‘‘mūlagandho tacagandho’’tiādi gandhārammaṇaṃ ghānadvāre āpāthamāgacchati, ‘‘mūlaraso khandharaso’’tiādi rasārammaṇaṃ jivhādvāre āpāthamāgacchati ",
      ", ‘‘kakkhaḷaṃ muduka’’ntiādi pathavīdhātutejodhātuvāyodhātubhedaṃ phoṭṭhabbārammaṇaṃ kāyadvāre āpāthamāgacchati ",
      ", ‘‘ayaṃ satto imasmiṃ khaṇe imaṃ nāma phoṭṭhabbaṃ ",
      " phusitvā sumano vā dummano vā majjhatto vā jāto’’ti sabbaṃ taṃ tathāgatassa evaṃ abhisambuddhaṃ."
    ],
    "innerText": "Yasmā taṃ tathāgatena abhisambuddhanti iminā idaṃ dasseti – yaṃ aparimāṇāsu lokadhātūsu imassa sadevakassa lokassa ‘‘nīlaṃ pītaka’’ntiādi rūpārammaṇaṃ cakkhudvāre āpāthaṃ āgacchati, taṃ sabbaṃ ‘‘ayaṃ satto imasmiṃ khaṇe imaṃ nāma rūpārammaṇaṃ disvā sumano vā dummano vā majjhatto vā jāto’’ti tathāgatassa evaṃ abhisambuddhaṃ. Tathā yaṃ aparimāṇāsu lokadhātūsu imassa sadevakassa lokassa ‘‘bherisaddo mudiṅgasaddo’’tiādi saddārammaṇaṃ sotadvāre āpāthaṃ āgacchati, ‘‘mūlagandho tacagandho’’tiādi gandhārammaṇaṃ ghānadvāre āpāthamāgacchati, ‘‘mūlaraso khandharaso’’tiādi rasārammaṇaṃ jivhādvāre āpāthamāgacchati , ‘‘kakkhaḷaṃ muduka’’ntiādi pathavīdhātutejodhātuvāyodhātubhedaṃ phoṭṭhabbārammaṇaṃ kāyadvāre āpāthamāgacchati , ‘‘ayaṃ satto imasmiṃ khaṇe imaṃ nāma phoṭṭhabbaṃ phusitvā sumano vā dummano vā majjhatto vā jāto’’ti sabbaṃ taṃ tathāgatassa evaṃ abhisambuddhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tathā yaṃ aparimāṇāsu lokadhātūsu imassa sadevakassa lokassa sukhādibhedaṃ dhammārammaṇaṃ manodvāre āpāthamāgacchati, ‘‘ayaṃ satto imasmiṃ khaṇe imaṃ nāma dhammārammaṇaṃ jānitvā sumano vā dummano vā majjhatto vā jāto’’ti sabbaṃ taṃ tathāgatassa evaṃ abhisambuddhaṃ. Evaṃ yaṃ imassa sadevakassa lokassa diṭṭhaṃ sutaṃ mutaṃ viññātaṃ, taṃ tathāgatena adiṭṭhaṃ vā asutaṃ vā amutaṃ vā aviññātaṃ vā natthi. Imassa pana mahājanassa pariyesitvā appattampi atthi, apariyesitvā appattampi atthi, pariyesitvā pattampi atthi, apariyesitvā pattampi atthi. Sabbampi tathāgatassa appattaṃ nāma natthi ñāṇena asacchikataṃ. Tato eva yaṃ aparimāṇāsu lokadhātūsu aparimāṇānaṃ sattānaṃ cakkhudvāre āpāthamāgacchantaṃ rūpārammaṇaṃ nāma atthi, taṃ bhagavā sabbaṃ sabbākārena jānāti passati. Evaṃ jānatā passatā cānena taṃ iṭṭhāniṭṭhādivasena vā diṭṭhasutamutaviññātesu labbhamānapadavasena vā ‘‘katamaṃ taṃ rūpaṃ rūpāyatanaṃ? Yaṃ rūpaṃ catunnaṃ mahābhūtānaṃ upādāya vaṇṇanibhā sanidassanaṃ sappaṭighaṃ nīlaṃ pītaka’’ntiādinā (dha. sa. 617) nayena anekehi nāmehi terasahi vārehi dvepaññāsāya nayehi vibhajjamānaṃ tatheva hoti, vitathaṃ natthi. Esa nayo sotadvārādīsupi āpāthamāgacchantesu saddādīsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasmā tathāgatoti vuccatī"
      },
      "ti yaṃ yathā lokena gataṃ, tassa tatheva gatattā tathāgatoti vuccati. Pāḷiyaṃ pana ‘‘abhisambuddha’’nti vuttaṃ, taṃ tathāgatasaddena samānatthaṃ. Iminā tathādassibhāvato tathāgatoti ayamattho dassito hoti. Vuttañhetaṃ dhammasenāpatinā –"
    ],
    "innerText": "Tasmā tathāgatoti vuccatīti yaṃ yathā lokena gataṃ, tassa tatheva gatattā tathāgatoti vuccati. Pāḷiyaṃ pana ‘‘abhisambuddha’’nti vuttaṃ, taṃ tathāgatasaddena samānatthaṃ. Iminā tathādassibhāvato tathāgatoti ayamattho dassito hoti. Vuttañhetaṃ dhammasenāpatinā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Na tassa addiṭṭhamidhatthi kiñci,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Atho aviññātamajānitabbaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Sabbaṃ abhiññāsi yadatthi neyyaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tathāgato tena samantacakkhū’’ti. (mahāni. 156; cūḷani. mogharājamāṇavapucchāniddesa 85; paṭi. ma. 1.121);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Suttantepi ",
      " vuttaṃ bhagavatā –"
    ],
    "innerText": "Suttantepi vuttaṃ bhagavatā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Yaṃ ",
      ", bhikkhave, sadevakassa lokassa…pe… sadevamanussāya pajāya diṭṭhaṃ sutaṃ mutaṃ ",
      " viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā, tamahaṃ jānāmi, tamahaṃ abbhaññāsiṃ, taṃ tathāgatassa viditaṃ, taṃ tathāgato na upaṭṭhāsī’’ti (a. ni. 4.24)."
    ],
    "innerText": "‘‘Yaṃ , bhikkhave, sadevakassa lokassa…pe… sadevamanussāya pajāya diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā, tamahaṃ jānāmi, tamahaṃ abbhaññāsiṃ, taṃ tathāgatassa viditaṃ, taṃ tathāgato na upaṭṭhāsī’’ti (a. ni. 4.24)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yañca, bhikkhave, rattiṃ tathāgato anuttaraṃ sammāsambodhiṃ abhisambujjhatī"
      },
      "ti yassañca visākhapuṇṇamarattiyaṃ tathā āgatādiatthena tathāgato bhagavā bodhimaṇḍe aparājitapallaṅke nisinno tiṇṇaṃ mārānaṃ matthakaṃ madditvā uttaritarābhāvato anuttaraṃ sammāsambodhiṃ āsavakkhayañāṇena saddhiṃ sabbaññutaññāṇaṃ adhigacchati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yañca rattiṃ anupādisesāya nibbānadhātuyā parinibbāyatī"
      },
      "ti yassañca visākhapuṇṇamarattiyaṃyeva kusinārāyaṃ upavattane mallānaṃ sālavane yamakasālānamantare anupādisesāya nibbānadhātuyā parinibbāyati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yaṃ etasmiṃ antare"
      },
      "ti imāsaṃ dvinnaṃ saupādisesaanupādisesanibbānadhātūnaṃ vemajjhe pañcacattālīsavassaparimāṇe kāle paṭhamabodhiyampi, majjhimabodhiyampi, pacchimabodhiyampi yaṃ suttageyyādippabhedaṃ dhammaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhāsati"
      },
      " niddisanavasena, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "lapati"
      },
      " uddhisanavasena, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "niddisati"
      },
      " paṭiniddisanavasena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbaṃ taṃ tatheva hotī"
      },
      "ti taṃ etthantare desitaṃ sabbaṃ suttageyyādinavaṅgaṃ buddhavacanaṃ atthato byañjanato ca anupavajjaṃ anūnaṃ anadhikaṃ sabbākāraparipuṇṇaṃ rāgamadanimmadanaṃ…pe… mohamadanimmadanaṃ, natthi tattha vālaggamattampi avakkhalitaṃ, ekamuddikāya lañchitaṃ viya ekanāḷiyā mitaṃ viya ekatulāya tulitaṃ viya ca taṃ tatheva hoti yassatthāya bhāsitaṃ, ekanteneva tassa sādhanato, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "no aññathā"
      },
      ". Tasmā tathaṃ, avitathaṃ, anaññathaṃ. Etena tathāvāditāya tathāgatoti dasseti. Gadaattho ayaṃ gatasaddo dakārassa takāraṃ katvā, tasmā tathaṃ gadatīti tathāgatoti attho. Atha vā āgadanaṃ āgado, vacananti attho. Tatho aviparīto āgado yassāti dakārassa takāraṃ katvā tathāgatoti evamettha padasiddhi veditabbā."
    ],
    "innerText": "Yañca, bhikkhave, rattiṃ tathāgato anuttaraṃ sammāsambodhiṃ abhisambujjhatīti yassañca visākhapuṇṇamarattiyaṃ tathā āgatādiatthena tathāgato bhagavā bodhimaṇḍe aparājitapallaṅke nisinno tiṇṇaṃ mārānaṃ matthakaṃ madditvā uttaritarābhāvato anuttaraṃ sammāsambodhiṃ āsavakkhayañāṇena saddhiṃ sabbaññutaññāṇaṃ adhigacchati. Yañca rattiṃ anupādisesāya nibbānadhātuyā parinibbāyatīti yassañca visākhapuṇṇamarattiyaṃyeva kusinārāyaṃ upavattane mallānaṃ sālavane yamakasālānamantare anupādisesāya nibbānadhātuyā parinibbāyati. Yaṃ etasmiṃ antareti imāsaṃ dvinnaṃ saupādisesaanupādisesanibbānadhātūnaṃ vemajjhe pañcacattālīsavassaparimāṇe kāle paṭhamabodhiyampi, majjhimabodhiyampi, pacchimabodhiyampi yaṃ suttageyyādippabhedaṃ dhammaṃ bhāsati niddisanavasena, lapati uddhisanavasena, niddisati paṭiniddisanavasena. Sabbaṃ taṃ tatheva hotīti taṃ etthantare desitaṃ sabbaṃ suttageyyādinavaṅgaṃ buddhavacanaṃ atthato byañjanato ca anupavajjaṃ anūnaṃ anadhikaṃ sabbākāraparipuṇṇaṃ rāgamadanimmadanaṃ…pe… mohamadanimmadanaṃ, natthi tattha vālaggamattampi avakkhalitaṃ, ekamuddikāya lañchitaṃ viya ekanāḷiyā mitaṃ viya ekatulāya tulitaṃ viya ca taṃ tatheva hoti yassatthāya bhāsitaṃ, ekanteneva tassa sādhanato, no aññathā. Tasmā tathaṃ, avitathaṃ, anaññathaṃ. Etena tathāvāditāya tathāgatoti dasseti. Gadaattho ayaṃ gatasaddo dakārassa takāraṃ katvā, tasmā tathaṃ gadatīti tathāgatoti attho. Atha vā āgadanaṃ āgado, vacananti attho. Tatho aviparīto āgado yassāti dakārassa takāraṃ katvā tathāgatoti evamettha padasiddhi veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathāvādī tathākārī"
      },
      "ti ye dhamme bhagavā ‘‘ime dhammā akusalā sāvajjā viññugarahitā samattā samādinnā ",
      " ahitāya dukkhāya saṃvattantī’’ti ",
      " paresaṃ dhammaṃ desento vadati, te dhamme ekanteneva sayaṃ pahāsi. Ye pana dhamme bhagavā ‘‘ime dhammā kusalā anavajjā viññuppasatthā samattā samādinnā hitāya sukhāya saṃvattantī’’ti vadati, te dhamme ekanteneva sayaṃ upasampajja vihāsi. Tasmā yathāvādī bhagavā, tathākārīti veditabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathākārī tathāvādī"
      },
      "ti sammadeva sīlādiparipūraṇavasena sammā paṭipanno sayaṃ yathākārī bhagavā, tatheva dhammadesanāya paresaṃ tattha patiṭṭhāpanavasena ",
      " tathāvādī. Bhagavato hi vācāya kāyo anulometi, kāyassapi vācā. Tasmā yathāvādī tathākārī, yathākārī tathāvādī ca hoti. Evaṃbhūtassa cassa yathā vācā, kāyopi tathā gato pavatto. Yathā ca kāyo, vācāpi tathā gatā pavattāti attho."
    ],
    "innerText": "Yathāvādī tathākārīti ye dhamme bhagavā ‘‘ime dhammā akusalā sāvajjā viññugarahitā samattā samādinnā ahitāya dukkhāya saṃvattantī’’ti paresaṃ dhammaṃ desento vadati, te dhamme ekanteneva sayaṃ pahāsi. Ye pana dhamme bhagavā ‘‘ime dhammā kusalā anavajjā viññuppasatthā samattā samādinnā hitāya sukhāya saṃvattantī’’ti vadati, te dhamme ekanteneva sayaṃ upasampajja vihāsi. Tasmā yathāvādī bhagavā, tathākārīti veditabbo. Yathākārī tathāvādīti sammadeva sīlādiparipūraṇavasena sammā paṭipanno sayaṃ yathākārī bhagavā, tatheva dhammadesanāya paresaṃ tattha patiṭṭhāpanavasena tathāvādī. Bhagavato hi vācāya kāyo anulometi, kāyassapi vācā. Tasmā yathāvādī tathākārī, yathākārī tathāvādī ca hoti. Evaṃbhūtassa cassa yathā vācā, kāyopi tathā gato pavatto. Yathā ca kāyo, vācāpi tathā gatā pavattāti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhibhū anabhibhūto"
      },
      "ti upari bhavaggaṃ heṭṭhā avīcinirayaṃ pariyantaṃ katvā tiriyaṃ aparimāṇāsu lokadhātūsu bhagavā sabbasatte abhibhavati sīlenapi samādhināpi paññāyapi vimuttiyāpi vimuttiñāṇadassanenapi, na tassa tulā vā pamāṇaṃ vā atthi, asamo asamasamo appaṭimo appaṭibhāgo appaṭipuggalo atulo appameyyo anuttaro dhammarājā devānaṃ atidevo sakkānaṃ atisakko brahmānaṃ atibrahmā. Tato eva sayaṃ na kenaci abhibhūtoti anabhibhūto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aññadatthū"
      },
      "ti ekaṃsatthe nipāto. Yañhi kiñci neyyaṃ nāma, sabbaṃ taṃ hatthatale āmalakaṃ viya passatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "daso"
      },
      ". Aviparītaṃ āsayādiavabodhena hitūpasaṃhārādinā ca satte, bhāvaññathattūpanayavasena saṅkhāre sabbākārena suciṇṇavasitāya samāpattiyo cittañca vase vattetīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vasavattī"
      },
      ". Ettāvatā abhibhavanaṭṭhena bhagavā attano tathāgatabhāvaṃ dasseti."
    ],
    "innerText": "Abhibhū anabhibhūtoti upari bhavaggaṃ heṭṭhā avīcinirayaṃ pariyantaṃ katvā tiriyaṃ aparimāṇāsu lokadhātūsu bhagavā sabbasatte abhibhavati sīlenapi samādhināpi paññāyapi vimuttiyāpi vimuttiñāṇadassanenapi, na tassa tulā vā pamāṇaṃ vā atthi, asamo asamasamo appaṭimo appaṭibhāgo appaṭipuggalo atulo appameyyo anuttaro dhammarājā devānaṃ atidevo sakkānaṃ atisakko brahmānaṃ atibrahmā. Tato eva sayaṃ na kenaci abhibhūtoti anabhibhūto. Aññadatthūti ekaṃsatthe nipāto. Yañhi kiñci neyyaṃ nāma, sabbaṃ taṃ hatthatale āmalakaṃ viya passatīti daso. Aviparītaṃ āsayādiavabodhena hitūpasaṃhārādinā ca satte, bhāvaññathattūpanayavasena saṅkhāre sabbākārena suciṇṇavasitāya samāpattiyo cittañca vase vattetīti vasavattī. Ettāvatā abhibhavanaṭṭhena bhagavā attano tathāgatabhāvaṃ dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatrevaṃ padasiddhi veditabbā – agado viya agado. Ko panesa? Desanāvilāso ceva puññussayo ca. Teneva hesa mahānubhāvo bhisakko viya dibbāgadena sappe, sabbe parappavādino sadevakañca lokaṃ abhibhavati. Iti sabbalokābhibhavane tatho aviparīto desanāvilāso ceva puññussayo ca agado assāti dakārassa takāraṃ katvā ",
      " tathāgatoti veditabbo. Tena vuttaṃ ‘‘sadevake, bhikkhave, loke…pe… vasavattī, tasmā tathāgatoti vuccatī’’ti."
    ],
    "innerText": "Tatrevaṃ padasiddhi veditabbā – agado viya agado. Ko panesa? Desanāvilāso ceva puññussayo ca. Teneva hesa mahānubhāvo bhisakko viya dibbāgadena sappe, sabbe parappavādino sadevakañca lokaṃ abhibhavati. Iti sabbalokābhibhavane tatho aviparīto desanāvilāso ceva puññussayo ca agado assāti dakārassa takāraṃ katvā tathāgatoti veditabbo. Tena vuttaṃ ‘‘sadevake, bhikkhave, loke…pe… vasavattī, tasmā tathāgatoti vuccatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Gāthāsu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sabbalokaṃ abhiññāyā"
      },
      "ti tedhātukalokasannivāsaṃ jānitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbaloke yathātatha"
      },
      "nti tasmiṃ tedhātukalokasannivāse yaṃkiñci neyyaṃ, taṃ sabbaṃ yathātathaṃ aviparītaṃ jānitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbalokavisaṃyutto"
      },
      "ti catunnaṃ yogānaṃ anavasesappahānena sabbenapi lokena visaṃyutto vippamutto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anūpayo"
      },
      "ti sabbasmimpi loke taṇhādiṭṭhiupayehi anūpayo tehi upayehi virahito."
    ],
    "innerText": "Gāthāsu sabbalokaṃ abhiññāyāti tedhātukalokasannivāsaṃ jānitvā. Sabbaloke yathātathanti tasmiṃ tedhātukalokasannivāse yaṃkiñci neyyaṃ, taṃ sabbaṃ yathātathaṃ aviparītaṃ jānitvā. Sabbalokavisaṃyuttoti catunnaṃ yogānaṃ anavasesappahānena sabbenapi lokena visaṃyutto vippamutto. Anūpayoti sabbasmimpi loke taṇhādiṭṭhiupayehi anūpayo tehi upayehi virahito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbābhibhū"
      },
      "ti rūpādīni sabbārammaṇāni, sabbaṃ saṅkhāragataṃ, sabbepi māre abhibhavitvā ṭhito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhīro"
      },
      "ti dhitisampanno. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbaganthappamocano"
      },
      "ti sabbe abhijjhākāyaganthādike mocetvā ṭhito ",
      " veneyyasantānepi attano desanāvilāsena tesaṃ pamocanato sabbaganthappamocano. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Phuṭṭhāssā"
      },
      "ti phuṭṭhā assa. Karaṇatthe idaṃ sāmivacanaṃ, phuṭṭhā anenāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paramā santī"
      },
      "ti nibbānaṃ. Tañhi tena ñāṇaphusanena phuṭṭhaṃ. Tenevāha ‘‘nibbānaṃ akutobhaya’’nti. Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paramā santī"
      },
      "ti uttamā santi. Katarā sāti? Nibbānaṃ. Yasmā pana nibbāne kutoci bhayaṃ natthi, tasmā taṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "akutobhaya"
      },
      "nti vuccati."
    ],
    "innerText": "Sabbābhibhūti rūpādīni sabbārammaṇāni, sabbaṃ saṅkhāragataṃ, sabbepi māre abhibhavitvā ṭhito. Dhīroti dhitisampanno. Sabbaganthappamocanoti sabbe abhijjhākāyaganthādike mocetvā ṭhito veneyyasantānepi attano desanāvilāsena tesaṃ pamocanato sabbaganthappamocano. Phuṭṭhāssāti phuṭṭhā assa. Karaṇatthe idaṃ sāmivacanaṃ, phuṭṭhā anenāti attho. Paramā santīti nibbānaṃ. Tañhi tena ñāṇaphusanena phuṭṭhaṃ. Tenevāha ‘‘nibbānaṃ akutobhaya’’nti. Atha vā paramā santīti uttamā santi. Katarā sāti? Nibbānaṃ. Yasmā pana nibbāne kutoci bhayaṃ natthi, tasmā taṃ akutobhayanti vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anīgho"
      },
      "ti niddukkho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbakammakkhayaṃ patto"
      },
      "ti sabbesaṃ kammānaṃ khayaṃ pariyosānaṃ accantābhāvaṃ patto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vimutto upadhisaṅkhaye"
      },
      "ti upadhisaṅkhayasaṅkhāte nibbāne tadārammaṇāya phalavimuttiyā vimutto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Esa so"
      },
      "ti eso so. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sīho anuttaro"
      },
      "ti parissayānaṃ sahanaṭṭhena, kilesānaṃ hananaṭṭhena ca, tathāgato anuttaro sīho nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Brahma"
      },
      "nti seṭṭhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cakka"
      },
      "nti dhammacakkaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pavattayī"
      },
      "ti tiparivaṭṭaṃ dvādasākāraṃ pavattesi."
    ],
    "innerText": "Anīghoti niddukkho. Sabbakammakkhayaṃ pattoti sabbesaṃ kammānaṃ khayaṃ pariyosānaṃ accantābhāvaṃ patto. Vimutto upadhisaṅkhayeti upadhisaṅkhayasaṅkhāte nibbāne tadārammaṇāya phalavimuttiyā vimutto. Esa soti eso so. Sīho anuttaroti parissayānaṃ sahanaṭṭhena, kilesānaṃ hananaṭṭhena ca, tathāgato anuttaro sīho nāma. Brahmanti seṭṭhaṃ. Cakkanti dhammacakkaṃ. Pavattayīti tiparivaṭṭaṃ dvādasākāraṃ pavattesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Itī"
      },
      "ti ",
      " evaṃ tathāgatassa guṇe jānitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅgammā"
      },
      "ti ",
      " samāgantvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "namassantī"
      },
      "ti taṃ tathāgataṃ te saraṇaṃ gatā devamanussā namassanti. Mahantehi sīlādiguṇehi samannāgatattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mahantaṃ,"
      },
      " catuvesārajjayogena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vītasāradaṃ"
      },
      ". Idāni yaṃ vadantā te namassanti, taṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "danto"
      },
      "tiādi vuttaṃ. Taṃ uttānatthameva."
    ],
    "innerText": "Itīti evaṃ tathāgatassa guṇe jānitvā. Saṅgammāti samāgantvā. Taṃnamassantīti taṃ tathāgataṃ te saraṇaṃ gatā devamanussā namassanti. Mahantehi sīlādiguṇehi samannāgatattā mahantaṃ, catuvesārajjayogena vītasāradaṃ. Idāni yaṃ vadantā te namassanti, taṃ dassetuṃ dantotiādi vuttaṃ. Taṃ uttānatthameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Iti imasmiṃ catukkanipāte chaṭṭhe sattame ca sutte vaṭṭaṃ kathitaṃ, paṭhamadutiyatatiyadvādasamaterasamesu vivaṭṭaṃ kathitaṃ, sesesu vaṭṭavivaṭṭaṃ kathitanti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Terasamasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti paramatthadīpaniyā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Khuddakanikāya-aṭṭhakathāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Itivuttakassa catukkanipātavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Nigamanakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettāvatā ",
      " ca –"
    ],
    "innerText": "Ettāvatā ca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Dhammissarena jagato, dhammālokavidhāyinā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dhammānaṃ bodhaneyyānaṃ, jānatā desanāvidhiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Taṃ taṃ nidānamāgamma, sabbalokahitesinā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ekakādippabhedena, desitāni mahesinā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Dasuttarasataṃ dve ca, suttāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "itivuttakaṃ"
      },
      ";"
    ],
    "innerText": "Dasuttarasataṃ dve ca, suttāni itivuttakaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Itivuttappabhedena, saṅgāyiṃsu mahesayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Chaḷabhiññā vasippattā, pabhinnapaṭisambhidā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yaṃ taṃ sāsanadhorayhā, dhammasaṅgāhakā pure."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Tassa atthaṃ pakāsetuṃ, porāṇaṭṭhakathānayaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nissāya yā samāraddhā, atthasaṃvaṇṇanā mayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sā tattha paramatthānaṃ, suttantesu yathārahaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Pakāsanā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paramattha-dīpanī"
      },
      " nāma nāmato."
    ],
    "innerText": "Pakāsanā paramattha-dīpanī nāma nāmato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sampattā pariniṭṭhānaṃ, anākulavinicchayā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Aṭṭhattiṃsappamāṇāya, pāḷiyā bhāṇavārato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Iti taṃ saṅkharontena, yaṃ taṃ adhigataṃ mayā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Puññaṃ tassānubhāvena, lokanāthassa sāsanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Ogāhetvā visuddhāya, sīlādipaṭipattiyā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sabbepi pāṇino hontu, vimuttirasabhāgino."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Ciraṃ ",
      " tiṭṭhatu lokasmiṃ, sammāsambuddhasāsanaṃ;"
    ],
    "innerText": "Ciraṃ tiṭṭhatu lokasmiṃ, sammāsambuddhasāsanaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tasmiṃ sagāravā niccaṃ, hontu sabbepi pāṇino."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sammā vassatu kālena, devopi jagatippati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Saddhammanirato lokaṃ, dhammeneva pasāsatūti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti badaratitthavihāravāsinā ācariyadhammapālena katā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Itivuttakassa aṭṭhakathā niṭṭhitā."
  }
]