[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "21. Pakiṇṇakavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Attanopubbakammavatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mattāsukhapariccāgā"
      },
      "ti ",
      " imaṃ dhammadesanaṃ satthā veḷuvane viharanto attano pubbakammaṃ ārabbha kathesi."
    ],
    "innerText": "Mattāsukhapariccāgāti imaṃ dhammadesanaṃ satthā veḷuvane viharanto attano pubbakammaṃ ārabbha kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ekasmiñhi samaye vesālī iddhā ahosi phītā bahujanā ākiṇṇamanussā. Tattha hi vārena vārena rajjaṃ kārentānaṃ khattiyānaṃyeva sattasatādhikāni sattasahassāni satta ca khattiyā ahesuṃ. Tesaṃ vasanatthāya tattakāyeva pāsādā tattakāneva kūṭāgārāni uyyāne vihāratthāya tattakāyeva ārāmā ca pokkharaṇiyo ca ahesuṃ. Sā aparena samayena dubbhikkhā ahosi dussassā. Tattha chātakabhayena paṭhamaṃ duggatamanussā kālamakaṃsu. Tesaṃ tesaṃ tattha tattha chaḍḍitānaṃ kuṇapānaṃ gandhena amanussā nagaraṃ pavisiṃsu. Amanussūpaddavena bahutarā kālamakaṃsu. Tesaṃ ",
      " kuṇapagandhapaṭikkūlatāya sattānaṃ ahivātarogo uppajji. Evaṃ dubbhikkhabhayaṃ amanussabhayaṃ rogabhayanti tīṇi bhayāni uppajjiṃsu."
    ],
    "innerText": "Ekasmiñhi samaye vesālī iddhā ahosi phītā bahujanā ākiṇṇamanussā. Tattha hi vārena vārena rajjaṃ kārentānaṃ khattiyānaṃyeva sattasatādhikāni sattasahassāni satta ca khattiyā ahesuṃ. Tesaṃ vasanatthāya tattakāyeva pāsādā tattakāneva kūṭāgārāni uyyāne vihāratthāya tattakāyeva ārāmā ca pokkharaṇiyo ca ahesuṃ. Sā aparena samayena dubbhikkhā ahosi dussassā. Tattha chātakabhayena paṭhamaṃ duggatamanussā kālamakaṃsu. Tesaṃ tesaṃ tattha tattha chaḍḍitānaṃ kuṇapānaṃ gandhena amanussā nagaraṃ pavisiṃsu. Amanussūpaddavena bahutarā kālamakaṃsu. Tesaṃ kuṇapagandhapaṭikkūlatāya sattānaṃ ahivātarogo uppajji. Evaṃ dubbhikkhabhayaṃ amanussabhayaṃ rogabhayanti tīṇi bhayāni uppajjiṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nagaravāsino sannipatitvā rājānaṃ āhaṃsu – ‘‘mahārāja, imasmiṃ nagare tīṇi bhayāni uppannāni, ito pubbe yāva sattamā rājaparivaṭṭā evarūpaṃ bhayaṃ nāma na uppannapubbaṃ. Adhammikarājūnañhi kāle evarūpaṃ bhayaṃ uppajjatī’’ti. Rājā santhāgāre sabbesaṃ sannipātaṃ kāretvā ‘‘sace me adhammikabhāvo atthi, taṃ vicinathā’’ti āha. Vesālivāsino sabbaṃ paveṇi vicinantā rañño kañci dosaṃ adisvā, ‘‘mahārāja, natthi te doso’’ti vatvā ‘‘kathaṃ nu kho idaṃ amhākaṃ bhayaṃ vūpasamaṃ gaccheyyā’’ti mantayiṃsu. Tattha ekaccehi ‘‘balikammena āyācanāya maṅgalakiriyāyā’’ti vutte sabbampi taṃ vidhiṃ katvā paṭibāhituṃ nāsakkhiṃsu. Athaññe evamāhaṃsu – ‘‘cha satthāro mahānubhāvā, tesu idhāgatamattesu bhayaṃ vūpasameyyā’’ti. Apare ‘‘sammāsambuddho loke uppanno. So hi bhagavā sabbasattahitāya dhammaṃ deseti, mahiddhiko ",
      " mahānubhāvo. Tasmiṃ idha āgate imāni ",
      " bhayāni vūpasameyyu’’nti āhaṃsu. Tesaṃ vacanaṃ sabbepi abhinanditvā ‘‘kahaṃ nu kho so bhagavā etarahi viharatī’’ti āhaṃsu ",
      ". Tadā pana satthā upakaṭṭhāya vassūpanāyikāya rañño bimbisārassa paṭiññaṃ datvā veḷuvane viharati. Tena ca samayena bimbisārasamāgame bimbisārena saddhiṃ sotāpattiphalaṃ patto mahāli nāma licchavī tassaṃ parisāyaṃ nisinno hoti."
    ],
    "innerText": "Nagaravāsino sannipatitvā rājānaṃ āhaṃsu – ‘‘mahārāja, imasmiṃ nagare tīṇi bhayāni uppannāni, ito pubbe yāva sattamā rājaparivaṭṭā evarūpaṃ bhayaṃ nāma na uppannapubbaṃ. Adhammikarājūnañhi kāle evarūpaṃ bhayaṃ uppajjatī’’ti. Rājā santhāgāre sabbesaṃ sannipātaṃ kāretvā ‘‘sace me adhammikabhāvo atthi, taṃ vicinathā’’ti āha. Vesālivāsino sabbaṃ paveṇi vicinantā rañño kañci dosaṃ adisvā, ‘‘mahārāja, natthi te doso’’ti vatvā ‘‘kathaṃ nu kho idaṃ amhākaṃ bhayaṃ vūpasamaṃ gaccheyyā’’ti mantayiṃsu. Tattha ekaccehi ‘‘balikammena āyācanāya maṅgalakiriyāyā’’ti vutte sabbampi taṃ vidhiṃ katvā paṭibāhituṃ nāsakkhiṃsu. Athaññe evamāhaṃsu – ‘‘cha satthāro mahānubhāvā, tesu idhāgatamattesu bhayaṃ vūpasameyyā’’ti. Apare ‘‘sammāsambuddho loke uppanno. So hi bhagavā sabbasattahitāya dhammaṃ deseti, mahiddhiko mahānubhāvo. Tasmiṃ idha āgate imāni bhayāni vūpasameyyu’’nti āhaṃsu. Tesaṃ vacanaṃ sabbepi abhinanditvā ‘‘kahaṃ nu kho so bhagavā etarahi viharatī’’ti āhaṃsu . Tadā pana satthā upakaṭṭhāya vassūpanāyikāya rañño bimbisārassa paṭiññaṃ datvā veḷuvane viharati. Tena ca samayena bimbisārasamāgame bimbisārena saddhiṃ sotāpattiphalaṃ patto mahāli nāma licchavī tassaṃ parisāyaṃ nisinno hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vesālivāsino mahantaṃ paṇṇākāraṃ sajjetvā rājānaṃ bimbisāraṃ saññāpetvā ‘‘satthāraṃ idhānethā’’ti mahāliñceva licchaviṃ purohitaputtañca pahiṇiṃsu. Te gantvā rañño paṇṇākāraṃ datvā taṃ pavattiṃ nivedetvā, ‘‘mahārāja, satthāraṃ amhākaṃ nagaraṃ pesethā’’ti yāciṃsu. Rājā ‘‘tumheva jānāthā’’ti na sampaṭicchi. Te bhagavantaṃ upasaṅkamitvā vanditvā yāciṃsu – ‘‘bhante, vesāliyaṃ tīṇi bhayāni uppannāni, tāni tumhesu āgatesu vūpasamissanti, etha, bhante, gacchāmā’’ti. Satthā tesaṃ vacanaṃ sutvā āvajjento ‘‘vesāliyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ratanasutte"
      },
      " (khu. pā. 6.1 ādayo; su. ni. 224 ādayo) vutte sā rakkhā cakkavāḷānaṃ koṭisatasahassaṃ pharissati, suttapariyosāne caturāsītiyā pāṇasahassānaṃ dhammābhisamayo ",
      " bhavissati, tāni ca bhayāni vūpasamissantī’’ti ñatvā tesaṃ vacanaṃ sampaṭicchi."
    ],
    "innerText": "Vesālivāsino mahantaṃ paṇṇākāraṃ sajjetvā rājānaṃ bimbisāraṃ saññāpetvā ‘‘satthāraṃ idhānethā’’ti mahāliñceva licchaviṃ purohitaputtañca pahiṇiṃsu. Te gantvā rañño paṇṇākāraṃ datvā taṃ pavattiṃ nivedetvā, ‘‘mahārāja, satthāraṃ amhākaṃ nagaraṃ pesethā’’ti yāciṃsu. Rājā ‘‘tumheva jānāthā’’ti na sampaṭicchi. Te bhagavantaṃ upasaṅkamitvā vanditvā yāciṃsu – ‘‘bhante, vesāliyaṃ tīṇi bhayāni uppannāni, tāni tumhesu āgatesu vūpasamissanti, etha, bhante, gacchāmā’’ti. Satthā tesaṃ vacanaṃ sutvā āvajjento ‘‘vesāliyaṃ ratanasutte (khu. pā. 6.1 ādayo; su. ni. 224 ādayo) vutte sā rakkhā cakkavāḷānaṃ koṭisatasahassaṃ pharissati, suttapariyosāne caturāsītiyā pāṇasahassānaṃ dhammābhisamayo bhavissati, tāni ca bhayāni vūpasamissantī’’ti ñatvā tesaṃ vacanaṃ sampaṭicchi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Rājā bimbisāro ‘‘satthārā kira vesāligamanaṃ sampaṭicchita’’nti sutvā nagare ghosanaṃ kāretvā satthāraṃ upasaṅkamitvā ‘‘kiṃ, bhante, vesāligamanaṃ sampaṭicchita’’nti pucchitvā ‘‘āma, mahārājā’’ti vutte ‘‘tena hi, bhante, āgametha, tāva maggaṃ paṭiyādessāmī’’ti vatvā rājagahassa ca gaṅgāya ca antare pañcayojanabhūmiṃ samaṃ kāretvā yojane yojane vihāraṃ patiṭṭhāpetvā satthu gamanakālaṃ ārocesi. Satthā pañcahi bhikkhusatehi saddhiṃ maggaṃ paṭipajji. Rājā yojanantare jaṇṇumattena odhinā pañcavaṇṇāni pupphāni okirāpetvā dhajapaṭākakadalīādīni ussāpetvā bhagavato chattātichattaṃ katvā dve setacchattāni ekamekassa bhikkhuno ekamekaṃ setacchattaṃ upari dhāretvā saparivāro pupphagandhādīhi pūjaṃ karonto satthāraṃ ekekasmiṃ vihāre vasāpetvā mahādānādīni datvā pañcahi divasehi gaṅgātīraṃ pāpetvā tattha ",
      " nāvaṃ alaṅkaronto vesālikānaṃ sāsanaṃ pesesi – ‘‘maggaṃ paṭiyādetvā satthu paccuggamanaṃ karontū’’ti. Te ‘‘diguṇaṃ pūjaṃ karissāmā’’ti vesāliyā ca gaṅgāya ca antare tiyojanabhūmiṃ ",
      " samaṃ kāretvā bhagavato catūhi setacchattehi ekamekassa bhikkhuno dvīhi dvīhi setacchattehi chattātichattāni sajjetvā pūjaṃ kurumānā āgantvā gaṅgātīre aṭṭhaṃsu. Bimbisāro dve nāvā saṅghāṭetvā maṇḍapaṃ kāretvā pupphadāmādīhi alaṅkārāpetvā sabbaratanamayaṃ buddhāsanaṃ paññāpesi. Bhagavā tasmiṃ nisīdi. Bhikkhūpi nāvaṃ abhiruhitvā bhagavantaṃ parivāretvā nisīdiṃsu. Rājā anugacchanto galappamāṇaṃ udakaṃ otaritvā ‘‘yāva, bhante, bhagavā ",
      " āgacchati, tāvāhaṃ idheva gaṅgātīre vasissāmī’’ti vatvā nāvaṃ uyyojetvā nivatti. Satthā yojanamattaṃ addhānaṃ gaṅgāya gantvā vesālikānaṃ sīmaṃ pāpuṇi."
    ],
    "innerText": "Rājā bimbisāro ‘‘satthārā kira vesāligamanaṃ sampaṭicchita’’nti sutvā nagare ghosanaṃ kāretvā satthāraṃ upasaṅkamitvā ‘‘kiṃ, bhante, vesāligamanaṃ sampaṭicchita’’nti pucchitvā ‘‘āma, mahārājā’’ti vutte ‘‘tena hi, bhante, āgametha, tāva maggaṃ paṭiyādessāmī’’ti vatvā rājagahassa ca gaṅgāya ca antare pañcayojanabhūmiṃ samaṃ kāretvā yojane yojane vihāraṃ patiṭṭhāpetvā satthu gamanakālaṃ ārocesi. Satthā pañcahi bhikkhusatehi saddhiṃ maggaṃ paṭipajji. Rājā yojanantare jaṇṇumattena odhinā pañcavaṇṇāni pupphāni okirāpetvā dhajapaṭākakadalīādīni ussāpetvā bhagavato chattātichattaṃ katvā dve setacchattāni ekamekassa bhikkhuno ekamekaṃ setacchattaṃ upari dhāretvā saparivāro pupphagandhādīhi pūjaṃ karonto satthāraṃ ekekasmiṃ vihāre vasāpetvā mahādānādīni datvā pañcahi divasehi gaṅgātīraṃ pāpetvā tattha nāvaṃ alaṅkaronto vesālikānaṃ sāsanaṃ pesesi – ‘‘maggaṃ paṭiyādetvā satthu paccuggamanaṃ karontū’’ti. Te ‘‘diguṇaṃ pūjaṃ karissāmā’’ti vesāliyā ca gaṅgāya ca antare tiyojanabhūmiṃ samaṃ kāretvā bhagavato catūhi setacchattehi ekamekassa bhikkhuno dvīhi dvīhi setacchattehi chattātichattāni sajjetvā pūjaṃ kurumānā āgantvā gaṅgātīre aṭṭhaṃsu. Bimbisāro dve nāvā saṅghāṭetvā maṇḍapaṃ kāretvā pupphadāmādīhi alaṅkārāpetvā sabbaratanamayaṃ buddhāsanaṃ paññāpesi. Bhagavā tasmiṃ nisīdi. Bhikkhūpi nāvaṃ abhiruhitvā bhagavantaṃ parivāretvā nisīdiṃsu. Rājā anugacchanto galappamāṇaṃ udakaṃ otaritvā ‘‘yāva, bhante, bhagavā āgacchati, tāvāhaṃ idheva gaṅgātīre vasissāmī’’ti vatvā nāvaṃ uyyojetvā nivatti. Satthā yojanamattaṃ addhānaṃ gaṅgāya gantvā vesālikānaṃ sīmaṃ pāpuṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Licchavīrājāno satthāraṃ paccuggantvā galappamāṇaṃ udakaṃ otaritvā nāvaṃ tīraṃ upanetvā satthāraṃ nāvāto otārayiṃsu. Satthārā otaritvā tīre akkantamatteyeva mahāmegho uṭṭhahitvā pokkharavassaṃ vassi. Sabbattha jaṇṇuppamāṇaūruppamāṇakaṭippamāṇādīni udakāni sandantāni sabbakuṇapāni gaṅgaṃ pavesayiṃsu, parisuddho bhūmibhāgo ahosi. Licchavīrājāno satthāraṃ yojane yojane vasāpetvā mahādānaṃ datvā diguṇaṃ pūjaṃ karontā tīhi divasehi ",
      " vesāliṃ nayiṃsu. Sakko devarājā devagaṇaparivuto āgamāsi, mahesakkhānaṃ devānaṃ sannipātena amanussā yebhuyyena palāyiṃsu. Satthā sāyaṃ nagaradvāre ṭhatvā ānandattheraṃ āmantesi – ‘‘imaṃ, ānanda, ratanasuttaṃ uggaṇhitvā licchavīkumārehi saddhiṃ vicaranto vesāliyā tiṇṇaṃ pākārānaṃ antare parittaṃ karohī’’ti."
    ],
    "innerText": "Licchavīrājāno satthāraṃ paccuggantvā galappamāṇaṃ udakaṃ otaritvā nāvaṃ tīraṃ upanetvā satthāraṃ nāvāto otārayiṃsu. Satthārā otaritvā tīre akkantamatteyeva mahāmegho uṭṭhahitvā pokkharavassaṃ vassi. Sabbattha jaṇṇuppamāṇaūruppamāṇakaṭippamāṇādīni udakāni sandantāni sabbakuṇapāni gaṅgaṃ pavesayiṃsu, parisuddho bhūmibhāgo ahosi. Licchavīrājāno satthāraṃ yojane yojane vasāpetvā mahādānaṃ datvā diguṇaṃ pūjaṃ karontā tīhi divasehi vesāliṃ nayiṃsu. Sakko devarājā devagaṇaparivuto āgamāsi, mahesakkhānaṃ devānaṃ sannipātena amanussā yebhuyyena palāyiṃsu. Satthā sāyaṃ nagaradvāre ṭhatvā ānandattheraṃ āmantesi – ‘‘imaṃ, ānanda, ratanasuttaṃ uggaṇhitvā licchavīkumārehi saddhiṃ vicaranto vesāliyā tiṇṇaṃ pākārānaṃ antare parittaṃ karohī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Thero satthārā dinnaṃ ratanasuttaṃ uggaṇhitvā satthu selamayapattena udakaṃ ādāya nagaradvāre ṭhito paṇidhānato paṭṭhāya tathāgatassa dasa pāramiyo dasa upapāramiyo dasa paramatthapāramiyoti samatiṃsa pāramiyo pañca mahāpariccāge lokatthacariyā ñātatthacariyā buddhatthacariyāti tisso cariyāyo pacchimabhave gabbhavokkantiṃ jātiṃ abhinikkhamanaṃ padhānacariyaṃ bodhipallaṅke māravijayaṃ sabbaññutaññāṇapaṭivedhaṃ dhammacakkapavattanaṃ ",
      " navalokuttaradhammeti sabbepime buddhaguṇe āvajjetvā nagaraṃ pavisitvā tiyāmarattiṃ tīsu pākārantaresu parittaṃ karonto vicari. Tena ‘‘yaṃkiñcī’’ti vuttamatteyeva uddhaṃ khittaudakaṃ amanussānaṃ upari pati. ‘‘Yānīdha bhūtānī’’ti gāthākathanato paṭṭhāya rajatavaṭaṃsakā viya udakabindūni ākāsena gantvā gilānamanussānaṃ upari patiṃsu. Tāvadeva vūpasantarogā manussā uṭṭhāyuṭṭhāya theraṃ parivāresuṃ ",
      ". ‘‘Yaṃkiñcī’’ti vuttapadato paṭṭhāya pana udakaphusitehi phuṭṭhaphuṭṭhā sabbe apalāyantā saṅkārakūṭabhittipadesādinissitā amanussā tena tena dvārena palāyiṃsu. Dvārāni anokāsāni ahesuṃ. Te okāsaṃ alabhantā pākāraṃ bhinditvāpi palāyiṃsu."
    ],
    "innerText": "Thero satthārā dinnaṃ ratanasuttaṃ uggaṇhitvā satthu selamayapattena udakaṃ ādāya nagaradvāre ṭhito paṇidhānato paṭṭhāya tathāgatassa dasa pāramiyo dasa upapāramiyo dasa paramatthapāramiyoti samatiṃsa pāramiyo pañca mahāpariccāge lokatthacariyā ñātatthacariyā buddhatthacariyāti tisso cariyāyo pacchimabhave gabbhavokkantiṃ jātiṃ abhinikkhamanaṃ padhānacariyaṃ bodhipallaṅke māravijayaṃ sabbaññutaññāṇapaṭivedhaṃ dhammacakkapavattanaṃ navalokuttaradhammeti sabbepime buddhaguṇe āvajjetvā nagaraṃ pavisitvā tiyāmarattiṃ tīsu pākārantaresu parittaṃ karonto vicari. Tena ‘‘yaṃkiñcī’’ti vuttamatteyeva uddhaṃ khittaudakaṃ amanussānaṃ upari pati. ‘‘Yānīdha bhūtānī’’ti gāthākathanato paṭṭhāya rajatavaṭaṃsakā viya udakabindūni ākāsena gantvā gilānamanussānaṃ upari patiṃsu. Tāvadeva vūpasantarogā manussā uṭṭhāyuṭṭhāya theraṃ parivāresuṃ . ‘‘Yaṃkiñcī’’ti vuttapadato paṭṭhāya pana udakaphusitehi phuṭṭhaphuṭṭhā sabbe apalāyantā saṅkārakūṭabhittipadesādinissitā amanussā tena tena dvārena palāyiṃsu. Dvārāni anokāsāni ahesuṃ. Te okāsaṃ alabhantā pākāraṃ bhinditvāpi palāyiṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Mahājano nagaramajjhe santhāgāraṃ sabbagandhehi upalimpetvā upari suvaṇṇatārakādivicittaṃ vitānaṃ bandhitvā buddhāsanaṃ paññāpetvā satthāraṃ ānesi. Satthā paññatte āsane nisīdi. Bhikkhusaṅghopi licchavīgaṇopi satthāraṃ parivāretvā nisīdi. Sakko devarājā devagaṇaparivuto patirūpe okāse aṭṭhāsi. Theropi sakalanagaraṃ anuvicaritvā vūpasantarogena mahājanena saddhiṃ ",
      " āgantvā satthāraṃ vanditvā nisīdi. Satthā parisaṃ oloketvā tadeva ratanasuttaṃ abhāsi. Desanāvasāne caturāsītiyā pāṇasahassānaṃ dhammābhisamayo ahosi. Evaṃ punadivasepīti sattāhaṃ tadeva ratanasuttaṃ desetvā sabbabhayānaṃ vūpasantabhāvaṃ ñatvā licchavīgaṇaṃ āmantetvā vesālito nikkhami. Licchavīrājāno diguṇaṃ sakkāraṃ karontā puna tīhi divasehi satthāraṃ gaṅgātīraṃ nayiṃsu."
    ],
    "innerText": "Mahājano nagaramajjhe santhāgāraṃ sabbagandhehi upalimpetvā upari suvaṇṇatārakādivicittaṃ vitānaṃ bandhitvā buddhāsanaṃ paññāpetvā satthāraṃ ānesi. Satthā paññatte āsane nisīdi. Bhikkhusaṅghopi licchavīgaṇopi satthāraṃ parivāretvā nisīdi. Sakko devarājā devagaṇaparivuto patirūpe okāse aṭṭhāsi. Theropi sakalanagaraṃ anuvicaritvā vūpasantarogena mahājanena saddhiṃ āgantvā satthāraṃ vanditvā nisīdi. Satthā parisaṃ oloketvā tadeva ratanasuttaṃ abhāsi. Desanāvasāne caturāsītiyā pāṇasahassānaṃ dhammābhisamayo ahosi. Evaṃ punadivasepīti sattāhaṃ tadeva ratanasuttaṃ desetvā sabbabhayānaṃ vūpasantabhāvaṃ ñatvā licchavīgaṇaṃ āmantetvā vesālito nikkhami. Licchavīrājāno diguṇaṃ sakkāraṃ karontā puna tīhi divasehi satthāraṃ gaṅgātīraṃ nayiṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Gaṅgāya nibbattanāgarājāno cintesuṃ – ‘‘manussā tathāgatassa ",
      " sakkāraṃ karonti, mayaṃ kiṃ na karomā’’ti. Te suvaṇṇarajatamaṇimayā nāvāyo māpetvā suvaṇṇarajatamaṇimaye pallaṅke paññāpetvā pañcavaṇṇapadumasañchannaṃ udakaṃ karitvā, ‘‘bhante, amhākampi anuggahaṃ karothā’’ti attano attano nāvaṃ abhiruhaṇatthāya satthāraṃ yāciṃsu. ‘‘Manussā ca nāgā ca tathāgatassa pūjaṃ karonti, mayaṃ pana kiṃ na karomā’’ti bhūmaṭṭhakadevepi ādiṃ katvā yāva akaniṭṭhabrahmalokā sabbe devā sakkāraṃ kariṃsu. Tattha nāgā yojanikāni chattātichattāni ukkhipiṃsu. Evaṃ heṭṭhā nāgā ",
      " bhūmitale rukkhagacchapabbatādīsu bhūmaṭṭhakā devatā, antalikkhe ākāsaṭṭhadevāti nāgabhavanaṃ ādiṃ katvā cakkavāḷapariyantena yāva brahmalokā chattātichattāni ussāpitāni ahesuṃ. Chattantaresu dhajā, dhajantaresu paṭākā, tesaṃ antarantarā pupphadāmavāsacuṇṇadhumādīhi sakkāro ahosi. Sabbalaṅkārapaṭimaṇḍitā devaputtā chaṇavesaṃ gahetvā ugghosayamānā ākāse vicariṃsu. Tayo eva kira samāgamā mahantā ahesuṃ – yamakapāṭihāriyasamāgamo devorohaṇasamāgamo ayaṃ gaṅgorohaṇasamāgamoti."
    ],
    "innerText": "Gaṅgāya nibbattanāgarājāno cintesuṃ – ‘‘manussā tathāgatassa sakkāraṃ karonti, mayaṃ kiṃ na karomā’’ti. Te suvaṇṇarajatamaṇimayā nāvāyo māpetvā suvaṇṇarajatamaṇimaye pallaṅke paññāpetvā pañcavaṇṇapadumasañchannaṃ udakaṃ karitvā, ‘‘bhante, amhākampi anuggahaṃ karothā’’ti attano attano nāvaṃ abhiruhaṇatthāya satthāraṃ yāciṃsu. ‘‘Manussā ca nāgā ca tathāgatassa pūjaṃ karonti, mayaṃ pana kiṃ na karomā’’ti bhūmaṭṭhakadevepi ādiṃ katvā yāva akaniṭṭhabrahmalokā sabbe devā sakkāraṃ kariṃsu. Tattha nāgā yojanikāni chattātichattāni ukkhipiṃsu. Evaṃ heṭṭhā nāgā bhūmitale rukkhagacchapabbatādīsu bhūmaṭṭhakā devatā, antalikkhe ākāsaṭṭhadevāti nāgabhavanaṃ ādiṃ katvā cakkavāḷapariyantena yāva brahmalokā chattātichattāni ussāpitāni ahesuṃ. Chattantaresu dhajā, dhajantaresu paṭākā, tesaṃ antarantarā pupphadāmavāsacuṇṇadhumādīhi sakkāro ahosi. Sabbalaṅkārapaṭimaṇḍitā devaputtā chaṇavesaṃ gahetvā ugghosayamānā ākāse vicariṃsu. Tayo eva kira samāgamā mahantā ahesuṃ – yamakapāṭihāriyasamāgamo devorohaṇasamāgamo ayaṃ gaṅgorohaṇasamāgamoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Paratīre bimbisāropi licchavīhi katasakkārato diguṇaṃ sakkāraṃ sajjetvā ",
      " bhagavato āgamanaṃ udikkhamāno aṭṭhāsi. Satthā gaṅgāya ubhosu passesu rājūnaṃ mahantaṃ pariccāgaṃ oloketvā nāgādīnañca ajjhāsayaṃ viditvā ekekāya nāvāya pañcapañcabhikkhusataparivāraṃ ekekaṃ nimmitabuddhaṃ māpesi. So ekekassa setacchattassa ceva kapparukkhassa ca pupphadāmassa ca heṭṭhā nāgagaṇaparivuto nisinno hoti. Bhūmaṭṭhakadevatādīsupi ekekasmiṃ okāse saparivāraṃ ekekaṃ nimmitabuddhaṃ māpesi. Evaṃ sakalacakkavāḷagabbhe ekālaṅkāre ekussave ekachaṇeyeva ca jāte satthā nāgānamanuggahaṃ karonto ekaṃ ratananāvaṃ abhiruhi. Bhikkhūsupi ekeko ekekameva abhiruhi. Nāgarājāno buddhappamukhaṃ bhikkhusaṅghaṃ nāgabhavanaṃ pavesetvā sabbarattiṃ satthu santike dhammakathaṃ sutvā dutiyadivase dibbena khādanīyena bhojanīyena buddhappamukhaṃ bhikkhusaṅghaṃ parivisiṃsu. Satthā anumodanaṃ katvā nāgabhavanā nikkhamitvā sakalacakkavāḷadevatāhi pūjiyamāno pañcahi nāvāsatehi gaṅgānadiṃ atikkami."
    ],
    "innerText": "Paratīre bimbisāropi licchavīhi katasakkārato diguṇaṃ sakkāraṃ sajjetvā bhagavato āgamanaṃ udikkhamāno aṭṭhāsi. Satthā gaṅgāya ubhosu passesu rājūnaṃ mahantaṃ pariccāgaṃ oloketvā nāgādīnañca ajjhāsayaṃ viditvā ekekāya nāvāya pañcapañcabhikkhusataparivāraṃ ekekaṃ nimmitabuddhaṃ māpesi. So ekekassa setacchattassa ceva kapparukkhassa ca pupphadāmassa ca heṭṭhā nāgagaṇaparivuto nisinno hoti. Bhūmaṭṭhakadevatādīsupi ekekasmiṃ okāse saparivāraṃ ekekaṃ nimmitabuddhaṃ māpesi. Evaṃ sakalacakkavāḷagabbhe ekālaṅkāre ekussave ekachaṇeyeva ca jāte satthā nāgānamanuggahaṃ karonto ekaṃ ratananāvaṃ abhiruhi. Bhikkhūsupi ekeko ekekameva abhiruhi. Nāgarājāno buddhappamukhaṃ bhikkhusaṅghaṃ nāgabhavanaṃ pavesetvā sabbarattiṃ satthu santike dhammakathaṃ sutvā dutiyadivase dibbena khādanīyena bhojanīyena buddhappamukhaṃ bhikkhusaṅghaṃ parivisiṃsu. Satthā anumodanaṃ katvā nāgabhavanā nikkhamitvā sakalacakkavāḷadevatāhi pūjiyamāno pañcahi nāvāsatehi gaṅgānadiṃ atikkami."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Rājā ",
      " paccuggantvā satthāraṃ nāvāto otāretvā āgamanakāle licchavīti katasakkārato diguṇaṃ sakkāraṃ katvā purimanayeneva pañcahi divasehi rājagahaṃ abhinesi. Dutiyadivase ",
      " bhikkhū piṇḍapātapaṭikkantā sāyanhasamaye dhammasabhāyaṃ sannisinnā kathaṃ samuṭṭhāpesuṃ – ‘‘aho buddhānaṃ mahānubhāvo, aho satthari devamanussānaṃ pasādo, gaṅgāya nāma orato ",
      " ca pārato ca aṭṭhayojane magge buddhagatena pasādena rājūhi samatalaṃ bhūmiṃ katvā vālukā okiṇṇā, jaṇṇumattena odhinā nānāvaṇṇāni pupphāni santhatāni, gaṅgāya udakaṃ nāgānubhāvena pañcavaṇṇehi padumehi sañchannaṃ, yāva akaniṭṭhabhavanā chattātichattāni ussāpitāni, sakalacakkavāḷagabbhaṃ ekālaṅkāraṃ ekussavaṃ viya jāta’’nti. Satthā āgantvā ‘‘kāya nuttha, bhikkhave, etarahi kathāya sannisinnā’’ti pucchitvā ‘‘imāya nāmā’’ti vutte ‘‘na, bhikkhave, esa pūjāsakkāro mayhaṃ buddhānubhāvena nibbatto, na nāgadevabrahmānubhāvena. Atīte pana appamattakapariccāgānubhāvena nibbatto’’ti vatvā bhikkhūhi yācito atītaṃ āhari."
    ],
    "innerText": "Rājā paccuggantvā satthāraṃ nāvāto otāretvā āgamanakāle licchavīti katasakkārato diguṇaṃ sakkāraṃ katvā purimanayeneva pañcahi divasehi rājagahaṃ abhinesi. Dutiyadivase bhikkhū piṇḍapātapaṭikkantā sāyanhasamaye dhammasabhāyaṃ sannisinnā kathaṃ samuṭṭhāpesuṃ – ‘‘aho buddhānaṃ mahānubhāvo, aho satthari devamanussānaṃ pasādo, gaṅgāya nāma orato ca pārato ca aṭṭhayojane magge buddhagatena pasādena rājūhi samatalaṃ bhūmiṃ katvā vālukā okiṇṇā, jaṇṇumattena odhinā nānāvaṇṇāni pupphāni santhatāni, gaṅgāya udakaṃ nāgānubhāvena pañcavaṇṇehi padumehi sañchannaṃ, yāva akaniṭṭhabhavanā chattātichattāni ussāpitāni, sakalacakkavāḷagabbhaṃ ekālaṅkāraṃ ekussavaṃ viya jāta’’nti. Satthā āgantvā ‘‘kāya nuttha, bhikkhave, etarahi kathāya sannisinnā’’ti pucchitvā ‘‘imāya nāmā’’ti vutte ‘‘na, bhikkhave, esa pūjāsakkāro mayhaṃ buddhānubhāvena nibbatto, na nāgadevabrahmānubhāvena. Atīte pana appamattakapariccāgānubhāvena nibbatto’’ti vatvā bhikkhūhi yācito atītaṃ āhari."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atīte takkasilāyaṃ saṅkho nāma brāhmaṇo ahosi. Tassa putto susīmo nāma māṇavo soḷasavassuddesiko ekadivasaṃ pitaraṃ upasaṅkamitvā āha – ‘‘icchāmahaṃ, tāta, bārāṇasiṃ gantvā mante ajjhāyitu’’nti. Atha naṃ pitā āha – ‘‘tena hi, tāta, asuko nāma brāhmaṇo mama ",
      " sahāyako, tassa santikaṃ gantvā adhīyassū’’ti. So ‘‘sādhū’’ti paṭissuṇitvā anupubbena bārāṇasiṃ gantvā taṃ brāhmaṇaṃ upasaṅkamitvā pitarā pahitabhāvamācikkhi. Atha naṃ so ‘‘sahāyakassa me putto’’ti sampaṭicchitvā paṭipassaddhadarathaṃ bhaddakena divasena mante vācetumārabhi. So lahuñca gaṇhanto bahuñca gaṇhanto attano uggahituggahitaṃ suvaṇṇabhājane pakkhittasīhatelamiva avinassamānaṃ dhārento na cirasseva ācariyassa sammukhato uggaṇhitabbaṃ sabbaṃ uggaṇhitvā sajjhāyaṃ karonto attano uggahitasippassa ādimajjhameva passati, no pariyosānaṃ."
    ],
    "innerText": "Atīte takkasilāyaṃ saṅkho nāma brāhmaṇo ahosi. Tassa putto susīmo nāma māṇavo soḷasavassuddesiko ekadivasaṃ pitaraṃ upasaṅkamitvā āha – ‘‘icchāmahaṃ, tāta, bārāṇasiṃ gantvā mante ajjhāyitu’’nti. Atha naṃ pitā āha – ‘‘tena hi, tāta, asuko nāma brāhmaṇo mama sahāyako, tassa santikaṃ gantvā adhīyassū’’ti. So ‘‘sādhū’’ti paṭissuṇitvā anupubbena bārāṇasiṃ gantvā taṃ brāhmaṇaṃ upasaṅkamitvā pitarā pahitabhāvamācikkhi. Atha naṃ so ‘‘sahāyakassa me putto’’ti sampaṭicchitvā paṭipassaddhadarathaṃ bhaddakena divasena mante vācetumārabhi. So lahuñca gaṇhanto bahuñca gaṇhanto attano uggahituggahitaṃ suvaṇṇabhājane pakkhittasīhatelamiva avinassamānaṃ dhārento na cirasseva ācariyassa sammukhato uggaṇhitabbaṃ sabbaṃ uggaṇhitvā sajjhāyaṃ karonto attano uggahitasippassa ādimajjhameva passati, no pariyosānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "So ācariyaṃ upasaṅkamitvā ‘‘ahaṃ imassa sippassa ādimajjhameva passāmi, no pariyosāna’’nti vatvā ācariyena ‘‘ahampi, tāta, na passāmī’’ti vutte ‘‘atha ko, ācariya, pariyosānaṃ jānātī’’ti pucchitvā ‘‘ime, tāta, isayo isipatane viharanti, te jāneyyuṃ, tesaṃ santikaṃ upasaṅkamitvā pucchassū’’ti ācariyena vutte paccekabuddhe upasaṅkamitvā pucchi – ‘‘tumhe kira pariyosānaṃ jānāthā’’ti? ‘‘Āma, jānāmā’’ti. ‘‘Tena hi me ācikkhathā’’ti? ‘‘Na mayaṃ apabbajitassa ācikkhāma. Sace te pariyosānenattho ",
      ", pabbajassū’’ti ",
      ". So ‘‘sādhū’’ti sampaṭicchitvā ",
      " tesaṃ santike pabbaji. Athassa te ‘‘idaṃ tāva sikkhassū’’ti vatvā ‘‘evaṃ te nivāsetabbaṃ, evaṃ pārupitabba’’ntiādinā nayena ābhisamācārikaṃ ācikkhiṃsu. So tattha sikkhanto upanissayasampannattā nacirasseva paccekasambodhiṃ abhisambujjhitvā sakalabārāṇasinagare gaganatale puṇṇacando viya pākaṭo lābhaggayasaggappatto ahosi, so appāyukasaṃvattanikassa kammassa katattā na cirasseva parinibbāyi. Athassa paccekabuddhā ca mahājano ca sarīrakiccaṃ katvā dhātuyo ca gahetvā nagaradvāre thūpaṃ kāresuṃ."
    ],
    "innerText": "So ācariyaṃ upasaṅkamitvā ‘‘ahaṃ imassa sippassa ādimajjhameva passāmi, no pariyosāna’’nti vatvā ācariyena ‘‘ahampi, tāta, na passāmī’’ti vutte ‘‘atha ko, ācariya, pariyosānaṃ jānātī’’ti pucchitvā ‘‘ime, tāta, isayo isipatane viharanti, te jāneyyuṃ, tesaṃ santikaṃ upasaṅkamitvā pucchassū’’ti ācariyena vutte paccekabuddhe upasaṅkamitvā pucchi – ‘‘tumhe kira pariyosānaṃ jānāthā’’ti? ‘‘Āma, jānāmā’’ti. ‘‘Tena hi me ācikkhathā’’ti? ‘‘Na mayaṃ apabbajitassa ācikkhāma. Sace te pariyosānenattho , pabbajassū’’ti . So ‘‘sādhū’’ti sampaṭicchitvā tesaṃ santike pabbaji. Athassa te ‘‘idaṃ tāva sikkhassū’’ti vatvā ‘‘evaṃ te nivāsetabbaṃ, evaṃ pārupitabba’’ntiādinā nayena ābhisamācārikaṃ ācikkhiṃsu. So tattha sikkhanto upanissayasampannattā nacirasseva paccekasambodhiṃ abhisambujjhitvā sakalabārāṇasinagare gaganatale puṇṇacando viya pākaṭo lābhaggayasaggappatto ahosi, so appāyukasaṃvattanikassa kammassa katattā na cirasseva parinibbāyi. Athassa paccekabuddhā ca mahājano ca sarīrakiccaṃ katvā dhātuyo ca gahetvā nagaradvāre thūpaṃ kāresuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Saṅkhopi brāhmaṇo ‘‘putto me ciraṃ gato, pavattimassa jānissāmī’’ti taṃ daṭṭhukāmo takkasilāto nikkhamitvā anupubbena bārāṇasiṃ patvā mahājanakāyaṃ sannipatitaṃ disvā ‘‘addhā imesu ekopi me puttassa pavattiṃ jānissatī’’ti upasaṅkamitvā pucchi – ‘‘susīmo nāma māṇavo idhāgami, api nu kho tassa pavattiṃ jānāthā’’ti? ‘‘Āma, brāhmaṇa, jānāma, asukassa brāhmaṇassa santike tayo vede sajjhāyitvā pabbajitvā paccekasambodhiṃ sacchikatvā parinibbuto, ayamassa thūpo patiṭṭhāpito’’ti. So bhūmiṃ hatthena paharitvā roditvā kanditvā ",
      " taṃ cetiyaṅgaṇaṃ gantvā tiṇāni uddharitvā uttarasāṭakena vālukaṃ āharitvā cetiyaṅgaṇe ākiritvā kamaṇḍaluto udakena paripphositvā vanapupphehi pūjaṃ katvā sāṭakena paṭākaṃ āropetvā thūpassa upari attano chattakaṃ bandhitvā pakkāmi."
    ],
    "innerText": "Saṅkhopi brāhmaṇo ‘‘putto me ciraṃ gato, pavattimassa jānissāmī’’ti taṃ daṭṭhukāmo takkasilāto nikkhamitvā anupubbena bārāṇasiṃ patvā mahājanakāyaṃ sannipatitaṃ disvā ‘‘addhā imesu ekopi me puttassa pavattiṃ jānissatī’’ti upasaṅkamitvā pucchi – ‘‘susīmo nāma māṇavo idhāgami, api nu kho tassa pavattiṃ jānāthā’’ti? ‘‘Āma, brāhmaṇa, jānāma, asukassa brāhmaṇassa santike tayo vede sajjhāyitvā pabbajitvā paccekasambodhiṃ sacchikatvā parinibbuto, ayamassa thūpo patiṭṭhāpito’’ti. So bhūmiṃ hatthena paharitvā roditvā kanditvā taṃ cetiyaṅgaṇaṃ gantvā tiṇāni uddharitvā uttarasāṭakena vālukaṃ āharitvā cetiyaṅgaṇe ākiritvā kamaṇḍaluto udakena paripphositvā vanapupphehi pūjaṃ katvā sāṭakena paṭākaṃ āropetvā thūpassa upari attano chattakaṃ bandhitvā pakkāmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Satthā idaṃ atītaṃ āharitvā ‘‘tadā, bhikkhave, ahaṃ saṅkho brāhmaṇo ahosiṃ. Mayā susīmassa paccekabuddhassa cetiyaṅgaṇe tiṇāni uddhaṭāni, tassa me kammassa nissandena aṭṭhayojanamaggaṃ vihatakhāṇukakaṇṭakaṃ katvā suddhaṃ samatalaṃ kariṃsu. Mayā tattha vālukā okiṇṇā, tassa me nissandena aṭṭhayojanamagge vālukaṃ okiriṃsu. Mayā tattha vanakusumehi pūjā katā, tassa me nissandena aṭṭhayojanamagge nānāvaṇṇāni pupphāni okiṇṇāni, ekayojanaṭṭhāne gaṅgāya udakaṃ pañcavaṇṇehi padumehi sañchannaṃ. Mayā tattha kamaṇḍaluudakena bhūmi paripphositā, tassa me nissandena vesāliyaṃ pokkharavassaṃ vassi. Mayā tattha paṭākā, āropitā, chattakañca baddhaṃ, tassa me nissandena yāva akaniṭṭhabhavanā dhajapaṭākachattātichattādīhi sakalacakkavāḷagabbhaṃ ekussavaṃ viya ",
      " jātaṃ. Iti kho, bhikkhave, esa pūjāsakkāro mayhaṃ neva buddhānubhāvena nibbatto, na nāgadevabrahmānubhāvena, atīte pana appamattakapariccāgānubhāvenā’’ti vatvā dhammaṃ desento imaṃ gāthamāha –"
    ],
    "innerText": "Satthā idaṃ atītaṃ āharitvā ‘‘tadā, bhikkhave, ahaṃ saṅkho brāhmaṇo ahosiṃ. Mayā susīmassa paccekabuddhassa cetiyaṅgaṇe tiṇāni uddhaṭāni, tassa me kammassa nissandena aṭṭhayojanamaggaṃ vihatakhāṇukakaṇṭakaṃ katvā suddhaṃ samatalaṃ kariṃsu. Mayā tattha vālukā okiṇṇā, tassa me nissandena aṭṭhayojanamagge vālukaṃ okiriṃsu. Mayā tattha vanakusumehi pūjā katā, tassa me nissandena aṭṭhayojanamagge nānāvaṇṇāni pupphāni okiṇṇāni, ekayojanaṭṭhāne gaṅgāya udakaṃ pañcavaṇṇehi padumehi sañchannaṃ. Mayā tattha kamaṇḍaluudakena bhūmi paripphositā, tassa me nissandena vesāliyaṃ pokkharavassaṃ vassi. Mayā tattha paṭākā, āropitā, chattakañca baddhaṃ, tassa me nissandena yāva akaniṭṭhabhavanā dhajapaṭākachattātichattādīhi sakalacakkavāḷagabbhaṃ ekussavaṃ viya jātaṃ. Iti kho, bhikkhave, esa pūjāsakkāro mayhaṃ neva buddhānubhāvena nibbatto, na nāgadevabrahmānubhāvena, atīte pana appamattakapariccāgānubhāvenā’’ti vatvā dhammaṃ desento imaṃ gāthamāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "290"
      },
      "."
    ],
    "innerText": "290."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " ‘‘Mattāsukhapariccāgā ",
      ", passe ce vipulaṃ sukhaṃ;"
    ],
    "innerText": "‘‘Mattāsukhapariccāgā , passe ce vipulaṃ sukhaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Caje mattāsukhaṃ dhīro, sampassaṃ vipulaṃ sukha’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mattāsukhapariccāgā"
      },
      "ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mattāsukha"
      },
      "nti pamāṇayuttakaṃ parittasukhaṃ vuccati, tassa pariccāgena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vipulaṃ sukha"
      },
      "nti uḷāraṃ sukhaṃ nibbānasukhaṃ vuccati, taṃ ce passeyyāti attho. Idaṃ vuttaṃ hoti – ekañhi bhojanapātiṃ sajjāpetvā bhuñjantassa mattāsukhaṃ nāma uppajjati, taṃ pana pariccajitvā uposathaṃ vā karontassa dānaṃ vā dadantassa vipulaṃ uḷāraṃ nibbānasukhaṃ nāma nibbattati. Tasmā sace evaṃ tassa mattāsukhassa pariccāgā vipulaṃ sukhaṃ passati, athetaṃ vipulaṃ sukhaṃ sammā passanto paṇḍito taṃ mattāsukhaṃ cajeyyāti."
    ],
    "innerText": "Tattha mattāsukhapariccāgāti mattāsukhanti pamāṇayuttakaṃ parittasukhaṃ vuccati, tassa pariccāgena. Vipulaṃ sukhanti uḷāraṃ sukhaṃ nibbānasukhaṃ vuccati, taṃ ce passeyyāti attho. Idaṃ vuttaṃ hoti – ekañhi bhojanapātiṃ sajjāpetvā bhuñjantassa mattāsukhaṃ nāma uppajjati, taṃ pana pariccajitvā uposathaṃ vā karontassa dānaṃ vā dadantassa vipulaṃ uḷāraṃ nibbānasukhaṃ nāma nibbattati. Tasmā sace evaṃ tassa mattāsukhassa pariccāgā vipulaṃ sukhaṃ passati, athetaṃ vipulaṃ sukhaṃ sammā passanto paṇḍito taṃ mattāsukhaṃ cajeyyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Desanāvasāne bahū sotāpattiphalādīni pāpuṇiṃsūti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Attanopubbakammavatthu paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Kukkuṭaaṇḍakhādikāvatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paradukkhūpadhānenā"
      },
      "ti imaṃ dhammadesanaṃ satthā jetavane viharanto ekaṃ kukkuṭaaṇḍakhādikaṃ ārabbha kathesi."
    ],
    "innerText": "Paradukkhūpadhānenāti imaṃ dhammadesanaṃ satthā jetavane viharanto ekaṃ kukkuṭaaṇḍakhādikaṃ ārabbha kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sāvatthiyā kira avidūre paṇḍuraṃ nāma eko gāmo, tattheko kevaṭṭo vasati. So sāvatthiṃ gacchanto aciravatiyaṃ kacchapaaṇḍāni disvā tāni ādāya sāvatthiṃ gantvā ekasmiṃ gehe pacāpetvā khādanto tasmiṃ gehe kumārikāyapi ",
      " ekaṃ aṇḍaṃ adāsi. Sā taṃ khāditvā tato paṭṭhāya aññaṃ khādanīyaṃ nāma na icchi. Athassā mātā kukkuṭiyā vijātaṭṭhānato ekaṃ aṇḍaṃ gahetvā adāsi. Sā taṃ khāditvā rasataṇhāya baddhā tato paṭṭhāya sayameva kukkuṭiyā aṇḍāni gahetvā khādati. Kukkuṭī vijātavijātakāle taṃ attano aṇḍāni gahetvā ",
      " khādantiṃ disvā tāya upaddutā āghātaṃ bandhitvā ‘‘ito dāni cutā yakkhinī hutvā tava jātadārake khādituṃ samatthā hutvā nibbatteyya’’nti patthanaṃ paṭṭhapetvā kālaṃ katvā tasmiṃyeva gehe majjārī hutvā nibbatti. Itarāpi kālaṃ katvā tattheva kukkuṭī hutvā nibbatti. Kukkuṭī aṇḍāni vijāyi, majjārī āgantvā tāni khāditvā dutiyampi tatiyampi khādiyeva. Kukkuṭī ‘‘tayo vāre mama aṇḍāni khāditvā idāni mampi khāditukāmāsi ",
      ", ito cutā saputtakaṃ taṃ khādituṃ labheyya’’nti patthanaṃ katvā tato cutā dīpinī hutvā nibbatti. Itarāpi kālaṃ katvā migī hutvā nibbatti. Tassā vijātakāle dīpinī āgantvā taṃ saddhiṃ puttehi khādi. Evaṃ khādantā pañcasu attabhāvasatesu aññamaññassa dukkhaṃ uppādetvā avasāne ekā yakkhinī hutvā nibbatti, ekā sāvatthiyaṃ kuladhītā hutvā nibbatti. Ito paraṃ ‘‘na hi verena verānī’’ti (dha. pa. 5) gāthāya vuttanayeneva veditabbaṃ. Idha pana satthā ‘‘verañhi averena upasammati, no verenā’’ti vatvā ubhinnampi dhammaṃ desento imaṃ gāthamāha –"
    ],
    "innerText": "Sāvatthiyā kira avidūre paṇḍuraṃ nāma eko gāmo, tattheko kevaṭṭo vasati. So sāvatthiṃ gacchanto aciravatiyaṃ kacchapaaṇḍāni disvā tāni ādāya sāvatthiṃ gantvā ekasmiṃ gehe pacāpetvā khādanto tasmiṃ gehe kumārikāyapi ekaṃ aṇḍaṃ adāsi. Sā taṃ khāditvā tato paṭṭhāya aññaṃ khādanīyaṃ nāma na icchi. Athassā mātā kukkuṭiyā vijātaṭṭhānato ekaṃ aṇḍaṃ gahetvā adāsi. Sā taṃ khāditvā rasataṇhāya baddhā tato paṭṭhāya sayameva kukkuṭiyā aṇḍāni gahetvā khādati. Kukkuṭī vijātavijātakāle taṃ attano aṇḍāni gahetvā khādantiṃ disvā tāya upaddutā āghātaṃ bandhitvā ‘‘ito dāni cutā yakkhinī hutvā tava jātadārake khādituṃ samatthā hutvā nibbatteyya’’nti patthanaṃ paṭṭhapetvā kālaṃ katvā tasmiṃyeva gehe majjārī hutvā nibbatti. Itarāpi kālaṃ katvā tattheva kukkuṭī hutvā nibbatti. Kukkuṭī aṇḍāni vijāyi, majjārī āgantvā tāni khāditvā dutiyampi tatiyampi khādiyeva. Kukkuṭī ‘‘tayo vāre mama aṇḍāni khāditvā idāni mampi khāditukāmāsi , ito cutā saputtakaṃ taṃ khādituṃ labheyya’’nti patthanaṃ katvā tato cutā dīpinī hutvā nibbatti. Itarāpi kālaṃ katvā migī hutvā nibbatti. Tassā vijātakāle dīpinī āgantvā taṃ saddhiṃ puttehi khādi. Evaṃ khādantā pañcasu attabhāvasatesu aññamaññassa dukkhaṃ uppādetvā avasāne ekā yakkhinī hutvā nibbatti, ekā sāvatthiyaṃ kuladhītā hutvā nibbatti. Ito paraṃ ‘‘na hi verena verānī’’ti (dha. pa. 5) gāthāya vuttanayeneva veditabbaṃ. Idha pana satthā ‘‘verañhi averena upasammati, no verenā’’ti vatvā ubhinnampi dhammaṃ desento imaṃ gāthamāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "291"
      },
      "."
    ],
    "innerText": "291."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Paradukkhūpadhānena, attano sukhamicchati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Verasaṃsaggasaṃsaṭṭho, verā so na parimuccatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paradukkhūpadhānenā"
      },
      "ti parasmiṃ dukkhūpadhānena, parassa dukkhuppādanenāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Verasaṃsaggasaṃsaṭṭho"
      },
      "ti yo puggalo akkosanapaccakkosanapaharaṇapaṭiharaṇādīnaṃ vasena aññamaññaṃ katena verasaṃsaggena saṃsaṭṭho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Verā so na parimuccatī"
      },
      "ti niccakālaṃ veravasena dukkhameva pāpuṇātīti attho."
    ],
    "innerText": "Tattha paradukkhūpadhānenāti parasmiṃ dukkhūpadhānena, parassa dukkhuppādanenāti attho. Verasaṃsaggasaṃsaṭṭhoti yo puggalo akkosanapaccakkosanapaharaṇapaṭiharaṇādīnaṃ vasena aññamaññaṃ katena verasaṃsaggena saṃsaṭṭho. Verā so na parimuccatīti niccakālaṃ veravasena dukkhameva pāpuṇātīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Desanāvasāne yakkhinī saraṇesu patiṭṭhāya pañca sīlāni samādiyitvā verato mucci, itarāpi sotāpattiphale patiṭṭhahi, sampattānampi sātthikā dhammadesanā ahosīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Kukkuṭaaṇḍakhādikāvatthu dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Bhaddiyabhikkhuvatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yañhi"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kicca"
      },
      "nti imaṃ dhammadesanaṃ satthā bhaddiyaṃ nissāya jātiyāvane viharanto bhaddiye bhikkhū ārabbha kathesi."
    ],
    "innerText": "Yañhikiccanti imaṃ dhammadesanaṃ satthā bhaddiyaṃ nissāya jātiyāvane viharanto bhaddiye bhikkhū ārabbha kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Te kira pādukamaṇḍane uyyuttā ahesuṃ. Yathāha – ‘‘tena kho pana samayena bhaddiyā bhikkhū anekavihitaṃ pādukamaṇḍanānuyogamanuyuttā viharanti, tiṇapādukaṃ karontipi kārāpentipi, muñjapādukaṃ karontipi kārāpentipi, pabbajapādukaṃ hintālapādukaṃ kamalapādukaṃ kambalapādukaṃ karontipi kārāpentipi, riñcanti uddesaṃ paripucchaṃ adhisīlaṃ adhicittaṃ adhipañña’’nti ",
      " (mahāva. 251). Bhikkhū tesaṃ tathākaraṇabhāvaṃ jānitvā ujjhāyitvā ",
      " satthu ārocesuṃ. Satthā te bhikkhū garahitvā, ‘‘bhikkhave, tumhe aññena kiccena āgatā aññasmiṃyeva kicce uyyuttā’’ti vatvā dhammaṃ desento imā gāthā abhāsi –"
    ],
    "innerText": "Te kira pādukamaṇḍane uyyuttā ahesuṃ. Yathāha – ‘‘tena kho pana samayena bhaddiyā bhikkhū anekavihitaṃ pādukamaṇḍanānuyogamanuyuttā viharanti, tiṇapādukaṃ karontipi kārāpentipi, muñjapādukaṃ karontipi kārāpentipi, pabbajapādukaṃ hintālapādukaṃ kamalapādukaṃ kambalapādukaṃ karontipi kārāpentipi, riñcanti uddesaṃ paripucchaṃ adhisīlaṃ adhicittaṃ adhipañña’’nti (mahāva. 251). Bhikkhū tesaṃ tathākaraṇabhāvaṃ jānitvā ujjhāyitvā satthu ārocesuṃ. Satthā te bhikkhū garahitvā, ‘‘bhikkhave, tumhe aññena kiccena āgatā aññasmiṃyeva kicce uyyuttā’’ti vatvā dhammaṃ desento imā gāthā abhāsi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "292"
      },
      "."
    ],
    "innerText": "292."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yañhi kiccaṃ apaviddhaṃ, akiccaṃ pana karīyati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Unnaḷānaṃ pamattānaṃ, tesaṃ vaḍḍhanti āsavā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "293"
      },
      "."
    ],
    "innerText": "293."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yesañca susamāraddhā, niccaṃ kāyagatā sati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Akiccaṃ te na sevanti, kicce sātaccakārino;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Satānaṃ sampajānānaṃ, atthaṃ gacchanti āsavā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yañhi kicca"
      },
      "nti bhikkhuno hi pabbajitakālato paṭṭhāya aparimāṇasīlakkhandhagopanaṃ araññāvāso dhutaṅgapariharaṇaṃ bhāvanārāmatāti evamādīni kiccaṃ nāma. Imehi pana yaṃ attano kiccaṃ, taṃ apaviddhaṃ chaḍḍitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akicca"
      },
      "nti bhikkhuno chattamaṇḍanaṃ upāhanamaṇḍanaṃ pādukapattathālakadhammakaraṇakāyabandhanaaṃsabaddhakamaṇḍanaṃ akiccaṃ nāma. Yehi taṃ kayirati, tesaṃ mānanaḷaṃ ukkhipitvā caraṇena unnaḷānaṃ sativossaggena pamattānaṃ cattāro āsavā vaḍḍhantīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Susamāraddhā"
      },
      "ti supaggahitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāyagatā satī"
      },
      "ti kāyānupassanābhāvanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akicca"
      },
      "nti te etaṃ chattamaṇḍanādikaṃ akiccaṃ na sevanti na karontīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kicce"
      },
      "ti pabbajitakālato paṭṭhāya kattabbe aparimāṇasīlakkhandhagopanādike karaṇīye. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sātaccakārino"
      },
      "ti satatakārino aṭṭhitakārino. Tesaṃ satiyā avippavāsena satānaṃ ",
      " sātthakasampajaññaṃ ",
      " sappāyasampajaññaṃ gocarasampajaññaṃ asammohasampajaññanti catūhi sampajaññehi sampajānānaṃ cattāropi āsavā atthaṃ gacchanti, parikkhayaṃ abhāvaṃ gacchantīti attho."
    ],
    "innerText": "Tattha yañhi kiccanti bhikkhuno hi pabbajitakālato paṭṭhāya aparimāṇasīlakkhandhagopanaṃ araññāvāso dhutaṅgapariharaṇaṃ bhāvanārāmatāti evamādīni kiccaṃ nāma. Imehi pana yaṃ attano kiccaṃ, taṃ apaviddhaṃ chaḍḍitaṃ. Akiccanti bhikkhuno chattamaṇḍanaṃ upāhanamaṇḍanaṃ pādukapattathālakadhammakaraṇakāyabandhanaaṃsabaddhakamaṇḍanaṃ akiccaṃ nāma. Yehi taṃ kayirati, tesaṃ mānanaḷaṃ ukkhipitvā caraṇena unnaḷānaṃ sativossaggena pamattānaṃ cattāro āsavā vaḍḍhantīti attho. Susamāraddhāti supaggahitā. Kāyagatā satīti kāyānupassanābhāvanā. Akiccanti te etaṃ chattamaṇḍanādikaṃ akiccaṃ na sevanti na karontīti attho. Kicceti pabbajitakālato paṭṭhāya kattabbe aparimāṇasīlakkhandhagopanādike karaṇīye. Sātaccakārinoti satatakārino aṭṭhitakārino. Tesaṃ satiyā avippavāsena satānaṃ sātthakasampajaññaṃ sappāyasampajaññaṃ gocarasampajaññaṃ asammohasampajaññanti catūhi sampajaññehi sampajānānaṃ cattāropi āsavā atthaṃ gacchanti, parikkhayaṃ abhāvaṃ gacchantīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Desanāvasāne te bhikkhū arahatte patiṭṭhahiṃsu, sampattānampi sātthikā dhammadesanā ahosīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Bhaddiyavatthu tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Lakuṇḍakabhaddiyattheravatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mātara"
      },
      "nti imaṃ dhammadesanaṃ satthā jetavane viharanto lakuṇḍakabhaddiyattheraṃ ārabbha kathesi."
    ],
    "innerText": "Mātaranti imaṃ dhammadesanaṃ satthā jetavane viharanto lakuṇḍakabhaddiyattheraṃ ārabbha kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ekadivasañhi ",
      " sambahulā āgantukā bhikkhū satthāraṃ divāṭṭhāne nisinnaṃ upasaṅkamitvā vanditvā ekamantaṃ nisīdiṃsu. Tasmiṃ khaṇe lakuṇḍakabhaddiyatthero bhagavato avidūre atikkamati. Satthā tesaṃ bhikkhūnaṃ cittācāraṃ ñatvā oloketvā ‘‘passatha, bhikkhave, ayaṃ bhikkhu mātāpitaro hantvā niddukkho hutvā yātī’’ti vatvā tehi bhikkhūhi ‘‘kiṃ nu kho satthā vadatī’’ti aññamaññaṃ mukhāni oloketvā saṃsayapakkhandehi, ‘‘bhante, kiṃ nāmetaṃ vadethā’’ti vutte tesaṃ dhammaṃ desento imaṃ gāthamāha –"
    ],
    "innerText": "Ekadivasañhi sambahulā āgantukā bhikkhū satthāraṃ divāṭṭhāne nisinnaṃ upasaṅkamitvā vanditvā ekamantaṃ nisīdiṃsu. Tasmiṃ khaṇe lakuṇḍakabhaddiyatthero bhagavato avidūre atikkamati. Satthā tesaṃ bhikkhūnaṃ cittācāraṃ ñatvā oloketvā ‘‘passatha, bhikkhave, ayaṃ bhikkhu mātāpitaro hantvā niddukkho hutvā yātī’’ti vatvā tehi bhikkhūhi ‘‘kiṃ nu kho satthā vadatī’’ti aññamaññaṃ mukhāni oloketvā saṃsayapakkhandehi, ‘‘bhante, kiṃ nāmetaṃ vadethā’’ti vutte tesaṃ dhammaṃ desento imaṃ gāthamāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "294"
      },
      "."
    ],
    "innerText": "294."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Mātaraṃ pitaraṃ hantvā, rājāno dve ca khattiye;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Raṭṭhaṃ sānucaraṃ hantvā, anīgho yāti brāhmaṇo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sānucara"
      },
      "nti āyasādhakena āyuttakena sahitaṃ. Ettha hi ‘‘taṇhā janeti purisa’’nti (saṃ. ni. 1.55-57) vacanato tīsu bhavesu sattānaṃ jananato taṇhā mātā nāma. ‘‘Ahaṃ asukassa nāma rañño vā rājamahāmattassa vā putto’’ti pitaraṃ nissāya asmimānassa uppajjanato asmimāno pitā nāma. Loko viya rājānaṃ yasmā sabbadiṭṭhigatāni dve sassatucchedadiṭṭhiyo bhajanti, tasmā dve sassatucchedadiṭṭhiyo dve khattiyarājāno nāma. Dvādasāyatanāni vitthataṭṭhena raṭṭhadisattā raṭṭhaṃ nāma. Āyasādhako ",
      " āyuttakapuriso viya tannissito nandirāgo anucaro nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anīgho"
      },
      "ti niddukkho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Brāhmaṇo"
      },
      "ti khīṇāsavo. Etesaṃ taṇhādīnaṃ arahattamaggañāṇāsinā hatattā khīṇāsavo niddukkho hutvā yātīti ayametthattho."
    ],
    "innerText": "Tattha sānucaranti āyasādhakena āyuttakena sahitaṃ. Ettha hi ‘‘taṇhā janeti purisa’’nti (saṃ. ni. 1.55-57) vacanato tīsu bhavesu sattānaṃ jananato taṇhā mātā nāma. ‘‘Ahaṃ asukassa nāma rañño vā rājamahāmattassa vā putto’’ti pitaraṃ nissāya asmimānassa uppajjanato asmimāno pitā nāma. Loko viya rājānaṃ yasmā sabbadiṭṭhigatāni dve sassatucchedadiṭṭhiyo bhajanti, tasmā dve sassatucchedadiṭṭhiyo dve khattiyarājāno nāma. Dvādasāyatanāni vitthataṭṭhena raṭṭhadisattā raṭṭhaṃ nāma. Āyasādhako āyuttakapuriso viya tannissito nandirāgo anucaro nāma. Anīghoti niddukkho. Brāhmaṇoti khīṇāsavo. Etesaṃ taṇhādīnaṃ arahattamaggañāṇāsinā hatattā khīṇāsavo niddukkho hutvā yātīti ayametthattho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Desanāvasāne te bhikkhū arahatte patiṭṭhahiṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dutiyagāthāyapi vatthu purimasadisameva. Tadā hi satthā lakuṇḍakabhaddiyattherameva ārabbha kathesi. Tesaṃ dhammaṃ desento imaṃ gāthamāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "295"
      },
      "."
    ],
    "innerText": "295."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Mātaraṃ pitaraṃ hantvā, rājāno dve ca sotthiye;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Veyagghapañcamaṃ hantvā, anīgho yāti brāhmaṇo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dve ca sotthiye"
      },
      "ti dve ca brāhmaṇe. Imissā gāthāya satthā attano dhammissaratāya ca desanāvidhikusalatāya ca sassatucchedadiṭṭhiyo dve brāhmaṇarājāno ",
      " ca katvā kathesi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Veyagghapañcama"
      },
      "nti ettha byagghānucarito sappaṭibhayo duppaṭipanno maggo veyaggho nāma, vicikicchānīvaraṇampi ",
      " tena sadisatāya veyagghaṃ nāma, taṃ pañcamaṃ assāti nīvaraṇapañcakaṃ veyagghapañcamaṃ nāma. Idañca veyagghapañcamaṃ arahattamaggañāṇāsinā nissesaṃ hantvā anīghova yāti brāhmaṇoti ayametthattho. Sesaṃ purimasadisamevāti."
    ],
    "innerText": "Tattha dve ca sotthiyeti dve ca brāhmaṇe. Imissā gāthāya satthā attano dhammissaratāya ca desanāvidhikusalatāya ca sassatucchedadiṭṭhiyo dve brāhmaṇarājāno ca katvā kathesi. Veyagghapañcamanti ettha byagghānucarito sappaṭibhayo duppaṭipanno maggo veyaggho nāma, vicikicchānīvaraṇampi tena sadisatāya veyagghaṃ nāma, taṃ pañcamaṃ assāti nīvaraṇapañcakaṃ veyagghapañcamaṃ nāma. Idañca veyagghapañcamaṃ arahattamaggañāṇāsinā nissesaṃ hantvā anīghova yāti brāhmaṇoti ayametthattho. Sesaṃ purimasadisamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Lakuṇḍakabhaddiyattheravatthu catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Dārusākaṭikaputtavatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suppabuddha"
      },
      "nti imaṃ dhammadesanaṃ satthā veḷuvane viharanto dārusākaṭikassa puttaṃ ārabbha kathesi."
    ],
    "innerText": "Suppabuddhanti imaṃ dhammadesanaṃ satthā veḷuvane viharanto dārusākaṭikassa puttaṃ ārabbha kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Rājagahasmiñhi sammādiṭṭhikaputto micchādiṭṭhikaputtoti dve dārakā abhikkhaṇaṃ guḷakīḷaṃ kīḷanti. Tesu sammādiṭṭhikaputto guḷaṃ khipamāno buddhānussatiṃ āvajjetvā ‘‘namo buddhassā’’ti vatvā vatvā guḷaṃ khipati. Itaro titthiyaguṇe uddisitvā ‘‘namo arahantāna’’nti vatvā vatvā khipati. Tesu sammādiṭṭhikassa ",
      " putto jināti, itaro pana parājayati. So tassa kiriyaṃ disvā ‘‘ayaṃ ",
      " evaṃ anussaritvā evaṃ vatvā guḷaṃ khipanto mamaṃ jināti, ahampi evarūpaṃ karissāmī’’ti buddhānussatiyaṃ paricayamakāsi. Athekadivasaṃ tassa pitā sakaṭaṃ yojetvā dārūnaṃ atthāya gacchanto tampi dārakaṃ ādāya gantvā aṭaviyaṃ dārūnaṃ sakaṭaṃ pūretvā āgacchanto bahinagare susānasāmante udakaphāsukaṭṭhāne goṇe mocetvā bhattavissaggamakāsi. Athassa te goṇā sāyanhasamaye nagaraṃ pavisantena gogaṇena saddhiṃ nagarameva pavisiṃsu. Sākaṭikopi goṇe anubandhanto nagaraṃ pavisitvā sāyaṃ goṇe disvā ādāya nikkhamanto dvāraṃ na sampāpuṇi. Tasmiñhi asampatteyeva dvāraṃ pihitaṃ."
    ],
    "innerText": "Rājagahasmiñhi sammādiṭṭhikaputto micchādiṭṭhikaputtoti dve dārakā abhikkhaṇaṃ guḷakīḷaṃ kīḷanti. Tesu sammādiṭṭhikaputto guḷaṃ khipamāno buddhānussatiṃ āvajjetvā ‘‘namo buddhassā’’ti vatvā vatvā guḷaṃ khipati. Itaro titthiyaguṇe uddisitvā ‘‘namo arahantāna’’nti vatvā vatvā khipati. Tesu sammādiṭṭhikassa putto jināti, itaro pana parājayati. So tassa kiriyaṃ disvā ‘‘ayaṃ evaṃ anussaritvā evaṃ vatvā guḷaṃ khipanto mamaṃ jināti, ahampi evarūpaṃ karissāmī’’ti buddhānussatiyaṃ paricayamakāsi. Athekadivasaṃ tassa pitā sakaṭaṃ yojetvā dārūnaṃ atthāya gacchanto tampi dārakaṃ ādāya gantvā aṭaviyaṃ dārūnaṃ sakaṭaṃ pūretvā āgacchanto bahinagare susānasāmante udakaphāsukaṭṭhāne goṇe mocetvā bhattavissaggamakāsi. Athassa te goṇā sāyanhasamaye nagaraṃ pavisantena gogaṇena saddhiṃ nagarameva pavisiṃsu. Sākaṭikopi goṇe anubandhanto nagaraṃ pavisitvā sāyaṃ goṇe disvā ādāya nikkhamanto dvāraṃ na sampāpuṇi. Tasmiñhi asampatteyeva dvāraṃ pihitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Athassa putto ekakova rattibhāge sakaṭassa heṭṭhā nipajjitvā niddaṃ okkami. Rājagahaṃ pana pakatiyāpi amanussabahulaṃ. Ayañca susānasantike nipanno. Tattha naṃ dve amanussā passiṃsu. Eko sāsanassa paṭikaṇḍako micchādiṭṭhiko, eko sammādiṭṭhiko. Tesu micchādiṭṭhiko āha – ‘‘ayaṃ no bhakkho, imaṃ khādissāmā’’ti. Itaro ‘‘alaṃ mā te ruccī’’ti nivāreti. So tena nivāriyamānopi tassa vacanaṃ anādiyitvā dārakaṃ pādesu gahetvā ākaḍḍhi. So buddhānussatiyā paricitattā ",
      " tasmiṃ khaṇe ‘‘namo buddhassā’’ti āha. Amanusso ",
      " mahābhayabhīto paṭikkamitvā aṭṭhāsi. Atha naṃ itaro ‘‘amhehi akiccaṃ kataṃ, daṇḍakammaṃ tassa karomā’’ti vatvā taṃ rakkhamāno aṭṭhāsi. Micchādiṭṭhiko nagaraṃ pavisitvā rañño bhojanapātiṃ pūretvā bhojanaṃ āhari. Atha naṃ ubhopi tassa mātāpitaro viya hutvā upaṭṭhāpetvā bhojetvā ‘‘imāni akkharāni rājāva passatu, mā añño’’ti taṃ pavattiṃ pakāsentā yakkhānubhāvena bhojanapātiyaṃ akkharāni chinditvā pātiṃ dārusakaṭe pakkhipitvā sabbarattiṃ ārakkhaṃ katvā pakkamiṃsu."
    ],
    "innerText": "Athassa putto ekakova rattibhāge sakaṭassa heṭṭhā nipajjitvā niddaṃ okkami. Rājagahaṃ pana pakatiyāpi amanussabahulaṃ. Ayañca susānasantike nipanno. Tattha naṃ dve amanussā passiṃsu. Eko sāsanassa paṭikaṇḍako micchādiṭṭhiko, eko sammādiṭṭhiko. Tesu micchādiṭṭhiko āha – ‘‘ayaṃ no bhakkho, imaṃ khādissāmā’’ti. Itaro ‘‘alaṃ mā te ruccī’’ti nivāreti. So tena nivāriyamānopi tassa vacanaṃ anādiyitvā dārakaṃ pādesu gahetvā ākaḍḍhi. So buddhānussatiyā paricitattā tasmiṃ khaṇe ‘‘namo buddhassā’’ti āha. Amanusso mahābhayabhīto paṭikkamitvā aṭṭhāsi. Atha naṃ itaro ‘‘amhehi akiccaṃ kataṃ, daṇḍakammaṃ tassa karomā’’ti vatvā taṃ rakkhamāno aṭṭhāsi. Micchādiṭṭhiko nagaraṃ pavisitvā rañño bhojanapātiṃ pūretvā bhojanaṃ āhari. Atha naṃ ubhopi tassa mātāpitaro viya hutvā upaṭṭhāpetvā bhojetvā ‘‘imāni akkharāni rājāva passatu, mā añño’’ti taṃ pavattiṃ pakāsentā yakkhānubhāvena bhojanapātiyaṃ akkharāni chinditvā pātiṃ dārusakaṭe pakkhipitvā sabbarattiṃ ārakkhaṃ katvā pakkamiṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Punadivase ‘‘rājakulato corehi bhojanabhaṇḍaṃ avahaṭa’’nti kolāhalaṃ karontā dvārāni pidahitvā olokentā tattha apassantā nagarā nikkhamitvā ito cito ca olokentā dārusakaṭe suvaṇṇapātiṃ disvā ‘‘ayaṃ coro’’ti taṃ dārakaṃ gahetvā rañño dassesuṃ. Rājā akkharāni disvā ‘‘kiṃ etaṃ, tātā’’ti pucchitvā ‘‘nāhaṃ ",
      ", deva, jānāmi, mātāpitaro me āgantvā rattiṃ bhojetvā rakkhamānā aṭṭhaṃsu, ahampi mātāpitaro maṃ rakkhantīti nibbhayova niddaṃ upagato. Ettakaṃ ahaṃ jānāmī’’ti. Athassa mātāpitaropi taṃ ṭhānaṃ āgamaṃsu. Rājā taṃ pavattiṃ ñatvā te tayopi jane ādāya ",
      " satthu santikaṃ gantvā sabbaṃ ārocetvā ‘‘kiṃ nu kho, bhante, buddhānussati eva rakkhā hoti, udāhu dhammānussatiādayopī’’ti pucchi. Athassa satthā, ‘‘mahārāja, na kevalaṃ buddhānussatiyeva rakkhā, yesaṃ pana chabbidhena cittaṃ subhāvitaṃ, tesaṃ aññena rakkhāvaraṇena vā mantosadhehi vā kiccaṃ natthī’’ti vatvā cha ṭhānāni dassento imā gāthā abhāsi."
    ],
    "innerText": "Punadivase ‘‘rājakulato corehi bhojanabhaṇḍaṃ avahaṭa’’nti kolāhalaṃ karontā dvārāni pidahitvā olokentā tattha apassantā nagarā nikkhamitvā ito cito ca olokentā dārusakaṭe suvaṇṇapātiṃ disvā ‘‘ayaṃ coro’’ti taṃ dārakaṃ gahetvā rañño dassesuṃ. Rājā akkharāni disvā ‘‘kiṃ etaṃ, tātā’’ti pucchitvā ‘‘nāhaṃ , deva, jānāmi, mātāpitaro me āgantvā rattiṃ bhojetvā rakkhamānā aṭṭhaṃsu, ahampi mātāpitaro maṃ rakkhantīti nibbhayova niddaṃ upagato. Ettakaṃ ahaṃ jānāmī’’ti. Athassa mātāpitaropi taṃ ṭhānaṃ āgamaṃsu. Rājā taṃ pavattiṃ ñatvā te tayopi jane ādāya satthu santikaṃ gantvā sabbaṃ ārocetvā ‘‘kiṃ nu kho, bhante, buddhānussati eva rakkhā hoti, udāhu dhammānussatiādayopī’’ti pucchi. Athassa satthā, ‘‘mahārāja, na kevalaṃ buddhānussatiyeva rakkhā, yesaṃ pana chabbidhena cittaṃ subhāvitaṃ, tesaṃ aññena rakkhāvaraṇena vā mantosadhehi vā kiccaṃ natthī’’ti vatvā cha ṭhānāni dassento imā gāthā abhāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "296"
      },
      "."
    ],
    "innerText": "296."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Suppabuddhaṃ pabujjhanti, sadā gotamasāvakā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yesaṃ divā ca ratto ca, niccaṃ buddhagatā sati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "297"
      },
      "."
    ],
    "innerText": "297."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Suppabuddhaṃ pabujjhanti, sadā gotamasāvakā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yesaṃ divā ca ratto ca, niccaṃ dhammagatā sati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "298"
      },
      "."
    ],
    "innerText": "298."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Suppabuddhaṃ pabujjhanti, sadā gotamasāvakā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yesaṃ divā ca ratto ca, niccaṃ saṅghagatā sati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "299"
      },
      "."
    ],
    "innerText": "299."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Suppabuddhaṃ pabujjhanti, sadā gotamasāvakā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yesaṃ divā ca ratto ca, niccaṃ kāyagatā sati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "300"
      },
      "."
    ],
    "innerText": "300."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " ‘‘Suppabuddhaṃ ",
      " pabujjhanti, sadā gotamasāvakā;"
    ],
    "innerText": "‘‘Suppabuddhaṃ pabujjhanti, sadā gotamasāvakā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yesaṃ divā ca ratto ca, ahiṃsāya rato mano."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "301"
      },
      "."
    ],
    "innerText": "301."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Suppabuddhaṃ pabujjhanti, sadā gotamasāvakā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yesaṃ divā ca ratto ca, bhāvanāya rato mano’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "suppabuddhaṃ pabujjhantī"
      },
      "ti buddhagataṃ satiṃ gahetvā supantā, gahetvāyeva ca pabujjhantā suppabuddhaṃ pabujjhanti nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sadā gotamasāvakā"
      },
      "ti gotamagottassa buddhassa savanante jātattā tasseva ",
      " anusāsaniyā savanatāya gotamasāvakā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Buddhagatā satī"
      },
      "ti yesaṃ ‘‘itipi so bhagavā’’tiādippabhede buddhaguṇe ārabbha uppajjamānā sati niccakālaṃ atthi, te sadāpi suppabuddhaṃ pabujjhantīti attho. Tathā asakkontā pana ekadivasaṃ ",
      " tīsu kālesu dvīsu kālesu ekasmimpi kāle buddhānussatiṃ manasi karontā suppabuddhaṃ pabujjhantiyeva nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammagatā satī"
      },
      "ti ‘‘svākhāto bhagavatā dhammo’’tiādippabhede dhammaguṇe ārabbha uppajjamānā sati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅghagatā satī"
      },
      "ti ‘‘suppaṭipanno bhagavato sāvakasaṅgho’’tiādippabhede saṅghaguṇe ārabbha uppajjamānā sati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāyagatā satī"
      },
      "ti dvattiṃsākāravasena vā navasivathikāvasena vā catudhātuvavatthānavasena vā ajjhattanīlakasiṇādirūpajjhānavasena vā uppajjamānā sati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ahiṃsāya rato"
      },
      "ti ‘‘so karuṇāsahagatena cetasā ekaṃ disaṃ pharitvā viharatī’’ti (vibha. 642) evaṃ vuttāya karuṇābhāvanāya rato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhāvanāyā"
      },
      "ti mettābhāvanāya. Kiñcāpi heṭṭhā karuṇābhāvanāya vuttattā idha sabbāpi avasesā bhāvanā nāma, idha pana mettābhāvanāva adhippetā. Sesaṃ paṭhamagāthāya vuttanayeneva veditabbaṃ."
    ],
    "innerText": "Tattha suppabuddhaṃ pabujjhantīti buddhagataṃ satiṃ gahetvā supantā, gahetvāyeva ca pabujjhantā suppabuddhaṃ pabujjhanti nāma. Sadā gotamasāvakāti gotamagottassa buddhassa savanante jātattā tasseva anusāsaniyā savanatāya gotamasāvakā. Buddhagatā satīti yesaṃ ‘‘itipi so bhagavā’’tiādippabhede buddhaguṇe ārabbha uppajjamānā sati niccakālaṃ atthi, te sadāpi suppabuddhaṃ pabujjhantīti attho. Tathā asakkontā pana ekadivasaṃ tīsu kālesu dvīsu kālesu ekasmimpi kāle buddhānussatiṃ manasi karontā suppabuddhaṃ pabujjhantiyeva nāma. Dhammagatā satīti ‘‘svākhāto bhagavatā dhammo’’tiādippabhede dhammaguṇe ārabbha uppajjamānā sati. Saṅghagatā satīti ‘‘suppaṭipanno bhagavato sāvakasaṅgho’’tiādippabhede saṅghaguṇe ārabbha uppajjamānā sati. Kāyagatā satīti dvattiṃsākāravasena vā navasivathikāvasena vā catudhātuvavatthānavasena vā ajjhattanīlakasiṇādirūpajjhānavasena vā uppajjamānā sati. Ahiṃsāya ratoti ‘‘so karuṇāsahagatena cetasā ekaṃ disaṃ pharitvā viharatī’’ti (vibha. 642) evaṃ vuttāya karuṇābhāvanāya rato. Bhāvanāyāti mettābhāvanāya. Kiñcāpi heṭṭhā karuṇābhāvanāya vuttattā idha sabbāpi avasesā bhāvanā nāma, idha pana mettābhāvanāva adhippetā. Sesaṃ paṭhamagāthāya vuttanayeneva veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Desanāvasāne dārako saddhiṃ mātāpitūhi sotāpattiphale ",
      " patiṭṭhahi. Pacchā pana pabbajitvā sabbepi arahattaṃ pāpuṇiṃsu, sampattānampi sātthikā dhammadesanā ahosīti."
    ],
    "innerText": "Desanāvasāne dārako saddhiṃ mātāpitūhi sotāpattiphale patiṭṭhahi. Pacchā pana pabbajitvā sabbepi arahattaṃ pāpuṇiṃsu, sampattānampi sātthikā dhammadesanā ahosīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dārusākaṭikaputtavatthu pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Vajjiputtakabhikkhuvatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Duppabbajja"
      },
      "nti imaṃ dhammadesanaṃ satthā vesāliṃ nissāya mahāvane viharanto aññataraṃ vajjiputtakaṃ bhikkhuṃ ārabbha kathesi. Taṃ sandhāya vuttaṃ – aññataro vajjiputtako bhikkhu vesāliyaṃ ",
      " viharati aññatarasmiṃ vanasaṇḍe, tena kho pana samayena vesāliyaṃ sabbarattichaṇo hoti. Atha kho so bhikkhu vesāliyā tūriyatāḷitavāditanigghosasaddaṃ sutvā paridevamāno tāyaṃ velāyaṃ imaṃ gāthaṃ abhāsi –"
    ],
    "innerText": "Duppabbajjanti imaṃ dhammadesanaṃ satthā vesāliṃ nissāya mahāvane viharanto aññataraṃ vajjiputtakaṃ bhikkhuṃ ārabbha kathesi. Taṃ sandhāya vuttaṃ – aññataro vajjiputtako bhikkhu vesāliyaṃ viharati aññatarasmiṃ vanasaṇḍe, tena kho pana samayena vesāliyaṃ sabbarattichaṇo hoti. Atha kho so bhikkhu vesāliyā tūriyatāḷitavāditanigghosasaddaṃ sutvā paridevamāno tāyaṃ velāyaṃ imaṃ gāthaṃ abhāsi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ekakā mayaṃ araññe viharāma,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Apaviddhaṃva vanasmiṃ dārukaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Etādisikāya rattiyā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kosu nāmamhehi pāpiyo’’ti. (saṃ. ni. 1.229);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "So ",
      " kira vajjiraṭṭhe rājaputto vārena sampattaṃ rajjaṃ pahāya pabbajito vesāliyaṃ cātumahārājikehi saddhiṃ ekābaddhaṃ ",
      " katvā sakalanagare dhajapaṭākādīhi paṭimaṇḍite komudiyā puṇṇamāya sabbarattiṃ chaṇavāre vattamāne bheriyādīnaṃ tūriyānaṃ tāḷitānaṃ nigghosaṃ vīṇādīnañca vāditānaṃ saddaṃ sutvā yāni vesāliyaṃ satta rājasahassāni satta rājasatāni satta rājāno, tattakā eva ca nesaṃ uparājasenāpatiādayo, tesu alaṅkatapaṭiyattesu nakkhattakīḷanatthāya vīthiṃ otiṇṇesu saṭṭhihatthe mahācaṅkame caṅkamamāno gaganamajjhe ṭhitaṃ puṇṇacandaṃ disvā caṅkamakoṭiyaṃ phalakaṃ nissāya ṭhito veṭhanālaṅkāravirahitattā vane chaḍḍitadārukaṃ viya attabhāvaṃ oloketvā ‘‘atthi nu kho añño amhehi lāmakataro’’ti cintento pakatiyā āraññakādiguṇayuttopi tasmiṃ khaṇe anabhiratiyā pīḷito evamāha. So tasmiṃ vanasaṇḍe adhivatthāya devatāya ‘‘imaṃ bhikkhuṃ saṃvejessāmī’’ti adhippāyena –"
    ],
    "innerText": "So kira vajjiraṭṭhe rājaputto vārena sampattaṃ rajjaṃ pahāya pabbajito vesāliyaṃ cātumahārājikehi saddhiṃ ekābaddhaṃ katvā sakalanagare dhajapaṭākādīhi paṭimaṇḍite komudiyā puṇṇamāya sabbarattiṃ chaṇavāre vattamāne bheriyādīnaṃ tūriyānaṃ tāḷitānaṃ nigghosaṃ vīṇādīnañca vāditānaṃ saddaṃ sutvā yāni vesāliyaṃ satta rājasahassāni satta rājasatāni satta rājāno, tattakā eva ca nesaṃ uparājasenāpatiādayo, tesu alaṅkatapaṭiyattesu nakkhattakīḷanatthāya vīthiṃ otiṇṇesu saṭṭhihatthe mahācaṅkame caṅkamamāno gaganamajjhe ṭhitaṃ puṇṇacandaṃ disvā caṅkamakoṭiyaṃ phalakaṃ nissāya ṭhito veṭhanālaṅkāravirahitattā vane chaḍḍitadārukaṃ viya attabhāvaṃ oloketvā ‘‘atthi nu kho añño amhehi lāmakataro’’ti cintento pakatiyā āraññakādiguṇayuttopi tasmiṃ khaṇe anabhiratiyā pīḷito evamāha. So tasmiṃ vanasaṇḍe adhivatthāya devatāya ‘‘imaṃ bhikkhuṃ saṃvejessāmī’’ti adhippāyena –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ekakova tvaṃ araññe viharasi, apaviddhaṃva vanasmiṃ dārukaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tassa te bahukā pihayanti, nerayikā viya saggagāmina’’nti. (saṃ. ni. 1.229) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Vuttaṃ imaṃ gāthaṃ sutvā punadivase satthāraṃ upasaṅkamitvā vanditvā nisīdi. Satthā taṃ pavattiṃ ñatvā gharāvāsassa ",
      " dukkhataṃ pakāsetukāmo pañca dukkhāni samodhānetvā imaṃ gāthamāha –"
    ],
    "innerText": "Vuttaṃ imaṃ gāthaṃ sutvā punadivase satthāraṃ upasaṅkamitvā vanditvā nisīdi. Satthā taṃ pavattiṃ ñatvā gharāvāsassa dukkhataṃ pakāsetukāmo pañca dukkhāni samodhānetvā imaṃ gāthamāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "302"
      },
      "."
    ],
    "innerText": "302."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Duppabbajjaṃ durabhiramaṃ, durāvāsā gharā dukhā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Dukkhosamānasaṃvāso, dukkhānupatitaddhagū;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tasmā na caddhagū siyā, na ca dukkhānupatito siyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "duppabbajja"
      },
      "nti appaṃ vā mahantaṃ vā bhogakkhandhañceva ñātiparivaṭṭañca pahāya imasmiṃ sāsane uraṃ datvā pabbajjaṃ nāma dukkhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Durabhirama"
      },
      "nti evaṃ pabbajitenāpi bhikkhācariyāya jīvitavuttiṃ ghaṭentena aparimāṇasīlakkhandhagopanadhammānudhammappaṭipattipūraṇavasena abhiramituṃ dukkhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Durāvāsā"
      },
      "ti yasmā pana gharaṃ āvasantena rājūnaṃ rājakiccaṃ, issarānaṃ issarakiccaṃ vahitabbaṃ, parijanā ceva dhammikā samaṇabrāhmaṇā ca saṅgahitabbā. Evaṃ santepi gharāvāso chiddaghaṭo viya mahāsamuddo viya ca duppūro. Tasmā gharāvāsā ",
      " nāmete durāvāsā dukkhā āvasituṃ, teneva kāraṇena dukkhāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dukkho samānasaṃvāso"
      },
      "ti gihino vā hi ye jātigottakulabhogehi ",
      " pabbajitā vā sīlācārabāhusaccādīhi samānāpi hutvā ‘‘kosi tvaṃ, kosmi aha’’ntiādīni vatvā adhikaraṇapasutā honti, te asamānā nāma, tehi saddhiṃ saṃvāso dukkhoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dukkhānupatitaddhagū"
      },
      "ti ye vaṭṭasaṅkhātaṃ addhānaṃ paṭipannattā addhagū, te dukkhe anupatitāva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasmā na caddhagū"
      },
      "ti yasmā dukkhānupatitabhāvopi dukkho addhagūbhāvopi, tasmā vaṭṭasaṅkhātaṃ addhānaṃ gamanatāya addhagū na bhaveyya, vuttappakārena dukkhena anupatitopi na bhaveyyāti attho."
    ],
    "innerText": "Tattha duppabbajjanti appaṃ vā mahantaṃ vā bhogakkhandhañceva ñātiparivaṭṭañca pahāya imasmiṃ sāsane uraṃ datvā pabbajjaṃ nāma dukkhaṃ. Durabhiramanti evaṃ pabbajitenāpi bhikkhācariyāya jīvitavuttiṃ ghaṭentena aparimāṇasīlakkhandhagopanadhammānudhammappaṭipattipūraṇavasena abhiramituṃ dukkhaṃ. Durāvāsāti yasmā pana gharaṃ āvasantena rājūnaṃ rājakiccaṃ, issarānaṃ issarakiccaṃ vahitabbaṃ, parijanā ceva dhammikā samaṇabrāhmaṇā ca saṅgahitabbā. Evaṃ santepi gharāvāso chiddaghaṭo viya mahāsamuddo viya ca duppūro. Tasmā gharāvāsā nāmete durāvāsā dukkhā āvasituṃ, teneva kāraṇena dukkhāti attho. Dukkho samānasaṃvāsoti gihino vā hi ye jātigottakulabhogehi pabbajitā vā sīlācārabāhusaccādīhi samānāpi hutvā ‘‘kosi tvaṃ, kosmi aha’’ntiādīni vatvā adhikaraṇapasutā honti, te asamānā nāma, tehi saddhiṃ saṃvāso dukkhoti attho. Dukkhānupatitaddhagūti ye vaṭṭasaṅkhātaṃ addhānaṃ paṭipannattā addhagū, te dukkhe anupatitāva. Tasmā na caddhagūti yasmā dukkhānupatitabhāvopi dukkho addhagūbhāvopi, tasmā vaṭṭasaṅkhātaṃ addhānaṃ gamanatāya addhagū na bhaveyya, vuttappakārena dukkhena anupatitopi na bhaveyyāti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Desanāvasāne so bhikkhu pañcasu ṭhānesu dassite dukkhe nibbindanto pañcorambhāgiyāni pañca uddhambhāgiyāni saṃyojanāni padāletvā arahatte patiṭṭhahīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vajjiputtakabhikkhuvatthu chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Cittagahapativatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddho"
      },
      "ti imaṃ dhammadesanaṃ satthā jetavane viharanto cittagahapatiṃ ārabbha kathesi. Vatthu bālavagge ‘‘asantaṃ bhāvanamiccheyyā’’ti ",
      " gāthāvaṇṇanāya vitthāritaṃ. Gāthāpi tattheva vuttā. Vuttañhetaṃ tattha (dha. pa. aṭṭha. 1.74) –"
    ],
    "innerText": "Saddhoti imaṃ dhammadesanaṃ satthā jetavane viharanto cittagahapatiṃ ārabbha kathesi. Vatthu bālavagge ‘‘asantaṃ bhāvanamiccheyyā’’ti gāthāvaṇṇanāya vitthāritaṃ. Gāthāpi tattheva vuttā. Vuttañhetaṃ tattha (dha. pa. aṭṭha. 1.74) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kiṃ pana, bhante, etassa tumhākaṃ santikaṃ āgacchantassevāyaṃ lābhasakkāro uppajjati, udāhu aññattha gacchantassāpi uppajjatī’’ti. ‘‘Ānanda, mama santikaṃ āgacchantassāpi aññattha gacchantassāpi tassa uppajjateva. Ayañhi upāsako saddho pasanno sampannasīlo, evarūpo puggalo yaṃ yaṃ padesaṃ bhajati, tattha tatthevassa lābhasakkāro nibbattatī’’ti vatvā imaṃ gāthamāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "303"
      },
      "."
    ],
    "innerText": "303."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " ‘‘Saddho ",
      " sīlena sampanno, yasobhogasamappito;"
    ],
    "innerText": "‘‘Saddho sīlena sampanno, yasobhogasamappito;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yaṃ yaṃ padesaṃ bhajati, tattha tattheva pūjito’’ti. (dha. pa. aṭṭha. 1.74);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saddho"
      },
      "ti lokiyalokuttarasaddhāya samannāgato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sīlenā"
      },
      "ti āgāriyasīlaṃ, anāgāriyasīlanti duvidhaṃ sīlaṃ. Tesu idha āgāriyasīlaṃ adhippetaṃ, tena samannāgatoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yasobhogasamappito"
      },
      "ti yādiso anāthapiṇḍikādīnaṃ pañcaupāsakasataparivārasaṅkhāto āgāriyayaso, tādiseneva yasena dhanadhaññādiko ceva sattavidhaariyadhanasaṅkhāto cāti duvidho bhogo, tena samannāgatoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yaṃ yaṃ padesa"
      },
      "nti puratthimādīsu ",
      " disāsu evarūpo kulaputto yaṃ yaṃ padesaṃ bhajati, tattha tattha evarūpena lābhasakkārena pūjitova hotīti attho."
    ],
    "innerText": "Tattha saddhoti lokiyalokuttarasaddhāya samannāgato. Sīlenāti āgāriyasīlaṃ, anāgāriyasīlanti duvidhaṃ sīlaṃ. Tesu idha āgāriyasīlaṃ adhippetaṃ, tena samannāgatoti attho. Yasobhogasamappitoti yādiso anāthapiṇḍikādīnaṃ pañcaupāsakasataparivārasaṅkhāto āgāriyayaso, tādiseneva yasena dhanadhaññādiko ceva sattavidhaariyadhanasaṅkhāto cāti duvidho bhogo, tena samannāgatoti attho. Yaṃ yaṃ padesanti puratthimādīsu disāsu evarūpo kulaputto yaṃ yaṃ padesaṃ bhajati, tattha tattha evarūpena lābhasakkārena pūjitova hotīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Desanāvasāne bahū sotāpattiphalādīni pāpuṇiṃsūti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Cittagahapativatthu sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Cūḷasubhaddāvatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dūre santo"
      },
      "ti imaṃ dhammadesanaṃ satthā jetavane viharanto anāthapiṇḍikassa dhītaraṃ cūḷasubhaddaṃ nāma ārabbha kathesi."
    ],
    "innerText": "Dūre santoti imaṃ dhammadesanaṃ satthā jetavane viharanto anāthapiṇḍikassa dhītaraṃ cūḷasubhaddaṃ nāma ārabbha kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anāthapiṇḍikassa kira daharakālato paṭṭhāya ugganagaravāsī uggo nāma seṭṭhiputto sahāyako ahosi. Te ekācariyakule sippaṃ uggaṇhantā aññamaññaṃ katikaṃ kariṃsu ‘‘amhākaṃ vayappattakāle puttadhītāsu jātāsu yo puttassa dhītaraṃ vāreti, tena tassa dhītā dātabbā’’ti. Te ubhopi vayappattā attano attano nagare seṭṭhiṭṭhāne patiṭṭhahiṃsu. Athekasmiṃ samaye uggaseṭṭhi vaṇijjaṃ payojento pañcahi sakaṭasatehi sāvatthiṃ agamāsi. Anāthapiṇḍiko attano dhītaraṃ cūḷasubhaddaṃ āmantetvā, ‘‘amma, pitā te uggaseṭṭhi nāma āgato, tassa kattabbakiccaṃ sabbaṃ tava bhāro’’ti āṇāpesi. Sā ‘‘sādhū’’ti paṭissuṇitvā tassa āgatadivasato paṭṭhāya sahattheneva sūpabyañjanādīni sampādeti, mālāgandhavilepanādīni abhisaṅkharoti ",
      ", bhojanakāle tassa nhānodakaṃ paṭiyādāpetvā nhānakālato paṭṭhāya sabbakiccāni sādhukaṃ karoti."
    ],
    "innerText": "Anāthapiṇḍikassa kira daharakālato paṭṭhāya ugganagaravāsī uggo nāma seṭṭhiputto sahāyako ahosi. Te ekācariyakule sippaṃ uggaṇhantā aññamaññaṃ katikaṃ kariṃsu ‘‘amhākaṃ vayappattakāle puttadhītāsu jātāsu yo puttassa dhītaraṃ vāreti, tena tassa dhītā dātabbā’’ti. Te ubhopi vayappattā attano attano nagare seṭṭhiṭṭhāne patiṭṭhahiṃsu. Athekasmiṃ samaye uggaseṭṭhi vaṇijjaṃ payojento pañcahi sakaṭasatehi sāvatthiṃ agamāsi. Anāthapiṇḍiko attano dhītaraṃ cūḷasubhaddaṃ āmantetvā, ‘‘amma, pitā te uggaseṭṭhi nāma āgato, tassa kattabbakiccaṃ sabbaṃ tava bhāro’’ti āṇāpesi. Sā ‘‘sādhū’’ti paṭissuṇitvā tassa āgatadivasato paṭṭhāya sahattheneva sūpabyañjanādīni sampādeti, mālāgandhavilepanādīni abhisaṅkharoti , bhojanakāle tassa nhānodakaṃ paṭiyādāpetvā nhānakālato paṭṭhāya sabbakiccāni sādhukaṃ karoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Uggaseṭṭhi ",
      " tassā ācārasampattiṃ disvā pasannacitto ekadivasaṃ anāthapiṇḍikena saddhiṃ sukhakathāya sannisinno ‘‘mayaṃ daharakāle evaṃ nāma katikaṃ karimhā’’ti sāretvā cūḷasubhaddaṃ attano puttassatthāya vāresi. So pana pakatiyāva micchādiṭṭhiko. Tasmā dasabalassa tamatthaṃ ārocetvā satthārā uggaseṭṭhissūpanissayaṃ disvā anuññāto bhariyāya saddhiṃ mantetvā tassa vacanaṃ sampaṭicchitvā divasaṃ vavatthapetvā dhītaraṃ visākhaṃ datvā uyyojento dhanañcayaseṭṭhi viya mahantaṃ sakkāraṃ katvā subhaddaṃ āmantetvā, ‘‘amma, sasurakule vasantiyā nāma antoaggi bahi na nīharitabbo’’ti (a. ni. aṭṭha. 1.1.259; dha. pa. aṭṭha. 1.52 visākhāvatthu) dhanañcayaseṭṭhinā visākhāya dinnanayeneva dasa ovāde datvā ‘‘sace me gataṭṭhāne dhītu doso uppajjati, tumhehi sodhetabbo’’ti aṭṭha kuṭumbike pāṭibhoge gahetvā tassā uyyojanadivase buddhappamukhassa bhikkhusaṅghassa mahādānaṃ datvā purimabhave dhītarā katānaṃ sucaritānaṃ phalavibhūtiṃ lokassa pākaṭaṃ katvā dassento viya mahantena sakkārena dhītaraṃ uyyojesi. Tassā anupubbena ugganagaraṃ pattakāle sasurakulena saddhiṃ ",
      " mahājano paccuggamanamakāsi."
    ],
    "innerText": "Uggaseṭṭhi tassā ācārasampattiṃ disvā pasannacitto ekadivasaṃ anāthapiṇḍikena saddhiṃ sukhakathāya sannisinno ‘‘mayaṃ daharakāle evaṃ nāma katikaṃ karimhā’’ti sāretvā cūḷasubhaddaṃ attano puttassatthāya vāresi. So pana pakatiyāva micchādiṭṭhiko. Tasmā dasabalassa tamatthaṃ ārocetvā satthārā uggaseṭṭhissūpanissayaṃ disvā anuññāto bhariyāya saddhiṃ mantetvā tassa vacanaṃ sampaṭicchitvā divasaṃ vavatthapetvā dhītaraṃ visākhaṃ datvā uyyojento dhanañcayaseṭṭhi viya mahantaṃ sakkāraṃ katvā subhaddaṃ āmantetvā, ‘‘amma, sasurakule vasantiyā nāma antoaggi bahi na nīharitabbo’’ti (a. ni. aṭṭha. 1.1.259; dha. pa. aṭṭha. 1.52 visākhāvatthu) dhanañcayaseṭṭhinā visākhāya dinnanayeneva dasa ovāde datvā ‘‘sace me gataṭṭhāne dhītu doso uppajjati, tumhehi sodhetabbo’’ti aṭṭha kuṭumbike pāṭibhoge gahetvā tassā uyyojanadivase buddhappamukhassa bhikkhusaṅghassa mahādānaṃ datvā purimabhave dhītarā katānaṃ sucaritānaṃ phalavibhūtiṃ lokassa pākaṭaṃ katvā dassento viya mahantena sakkārena dhītaraṃ uyyojesi. Tassā anupubbena ugganagaraṃ pattakāle sasurakulena saddhiṃ mahājano paccuggamanamakāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sāpi attano sirivibhavaṃ pākaṭaṃ kātuṃ visākhā viya sakalanagarassa attānaṃ dassentī rathe ṭhatvā nagaraṃ pavisitvā nāgarehi pesite paṇṇākāre gahetvā anurūpavasena tesaṃ tesaṃ pesentī sakalanagaraṃ attano guṇehi ekābaddhamakāsi. Maṅgaladivasādīsu panassā sasuro acelakānaṃ sakkāraṃ karonto ‘‘āgantvā amhākaṃ samaṇe vandatū’’ti pesesi. Sā lajjāya nagge passituṃ asakkontī gantuṃ na icchati. So punappunaṃ pesetvāpi tāya paṭikkhitto kujjhitvā ‘‘nīharatha na’’nti āha. Sā ‘‘na sakkā mama akāraṇena dosaṃ āropetu’’nti kuṭumbike pakkosāpetvā tamatthaṃ ārocesi. Te tassā niddosabhāvaṃ ñatvā seṭṭhiṃ saññāpesuṃ. So ‘‘ayaṃ mama samaṇe ahirikāti na vandī’’ti bhariyāya ārocesi. Sā ‘‘kīdisā nu kho imissā samaṇā, ativiya tesaṃ pasaṃsatī’’ti taṃ pakkosāpetvā āha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kīdisā samaṇā tuyhaṃ, bāḷhaṃ kho ne pasaṃsasi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kiṃsīlā kiṃsamācārā, taṃ me akkhāhi pucchitā’’ti. (a. ni. aṭṭha. 2.4.24);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Athassā ",
      " subhaddā buddhānañceva buddhasāvakānañca guṇe pakāsentī –"
    ],
    "innerText": "Athassā subhaddā buddhānañceva buddhasāvakānañca guṇe pakāsentī –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Santindriyā ",
      " santamānasā, santaṃ tesaṃ gataṃ ṭhitaṃ;"
    ],
    "innerText": "‘‘Santindriyā santamānasā, santaṃ tesaṃ gataṃ ṭhitaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Okkhittacakkhū mitabhāṇī, tādisā samaṇā mama. (a. ni. aṭṭha. 2.4.24);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kāyakammaṃ suci nesaṃ, vācākammaṃ anāvilaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Manokammaṃ suvisuddhaṃ, tādisā samaṇā mama."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Vimalā ",
      " saṅkhamuttābhā, suddhā antarabāhirā;"
    ],
    "innerText": "‘‘Vimalā saṅkhamuttābhā, suddhā antarabāhirā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Puṇṇā suddhehi dhammehi, tādisā samaṇā mama."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Lābhena unnato loko, alābhena ca onato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Lābhālābhena ekaṭṭhā, tādisā samaṇā mama."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yasena unnato loko, ayasena ca onato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yasāyasena ekaṭṭhā, tādisā samaṇā mama."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Pasaṃsāyunnato loko, nindāyāpi ca onato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Samā nindāpasaṃsāsu, tādisā samaṇā mama."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sukhena unnato loko, dukkhenāpi ca onato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Akampā sukhadukkhesu, tādisā samaṇā mamā’’ti. –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Evamādīhi vacanehi sassuṃ tosesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha naṃ ‘‘sakkā tava samaṇe amhākampi dassetu’’nti vatvā ‘‘sakkā’’ti vutte ‘‘tena hi yathā mayaṃ te passāma, tathā karohī’’ti vutte sā ‘‘sādhū’’ti buddhappamukhassa bhikkhusaṅghassa mahādānaṃ sajjetvā uparipāsādatale ṭhatvā jetavanābhimukhī sakkaccaṃ pañcapatiṭṭhitena vanditvā buddhaguṇe āvajjetvā gandhavāsapupphadhumehi pūjaṃ katvā, ‘‘bhante, svātanāya buddhappamukhaṃ bhikkhusaṅghaṃ nimantemi, iminā me saññāṇena satthā nimantitabhāvaṃ jānātū’’ti ",
      " sumanapupphānaṃ aṭṭha muṭṭhiyo ākāse khipi. Pupphāni gantvā catuparisamajjhe dhammaṃ ",
      " desentassa satthuno upari mālāvitānaṃ hutvā aṭṭhaṃsu. Tasmiṃ khaṇe anāthapiṇḍikopi dhammakathaṃ sutvā svātanāya satthāraṃ nimantesi. Satthā ‘‘adhivutthaṃ mayā, gahapati, svātanāya bhatta’’nti vatvā, ‘‘bhante, mayā puretaraṃ āgato natthi, kassa nu kho vo adhivuttha’’nti vutte ‘‘cūḷasubhaddāya, gahapati, nimantito’’ti ",
      " vatvā ‘‘nanu, bhante, cūḷasubhaddā dūre vasati ito vīsatiyojanasatamatthake’’ti vutte, ‘‘āma gahapati, dūre vasantāpi hi sappurisā abhimukhe ṭhitā viya pakāsentī’’ti vatvā imaṃ gāthamāha –"
    ],
    "innerText": "Atha naṃ ‘‘sakkā tava samaṇe amhākampi dassetu’’nti vatvā ‘‘sakkā’’ti vutte ‘‘tena hi yathā mayaṃ te passāma, tathā karohī’’ti vutte sā ‘‘sādhū’’ti buddhappamukhassa bhikkhusaṅghassa mahādānaṃ sajjetvā uparipāsādatale ṭhatvā jetavanābhimukhī sakkaccaṃ pañcapatiṭṭhitena vanditvā buddhaguṇe āvajjetvā gandhavāsapupphadhumehi pūjaṃ katvā, ‘‘bhante, svātanāya buddhappamukhaṃ bhikkhusaṅghaṃ nimantemi, iminā me saññāṇena satthā nimantitabhāvaṃ jānātū’’ti sumanapupphānaṃ aṭṭha muṭṭhiyo ākāse khipi. Pupphāni gantvā catuparisamajjhe dhammaṃ desentassa satthuno upari mālāvitānaṃ hutvā aṭṭhaṃsu. Tasmiṃ khaṇe anāthapiṇḍikopi dhammakathaṃ sutvā svātanāya satthāraṃ nimantesi. Satthā ‘‘adhivutthaṃ mayā, gahapati, svātanāya bhatta’’nti vatvā, ‘‘bhante, mayā puretaraṃ āgato natthi, kassa nu kho vo adhivuttha’’nti vutte ‘‘cūḷasubhaddāya, gahapati, nimantito’’ti vatvā ‘‘nanu, bhante, cūḷasubhaddā dūre vasati ito vīsatiyojanasatamatthake’’ti vutte, ‘‘āma gahapati, dūre vasantāpi hi sappurisā abhimukhe ṭhitā viya pakāsentī’’ti vatvā imaṃ gāthamāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "304"
      },
      "."
    ],
    "innerText": "304."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Dūre santo pakāsenti, himavantova pabbato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Asantettha na dissanti, rattiṃ khittā yathā sarā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "santo"
      },
      "ti rāgādīnaṃ santatāya buddhādayo santā nāma. Idha pana pubbabuddhesu katādhikārā ussannakusalamūlā bhāvitabhāvanā sattā santoti adhippetā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pakāsentī"
      },
      "ti dūre ṭhitāpi buddhānaṃ ñāṇapathaṃ āgacchantā pākaṭā honti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Himavanto vā"
      },
      "ti yathā hi tiyojanasahassavitthato pañcayojanasatubbedho caturāsītiyā ",
      " kūṭasahassehi paṭimaṇḍito himavantapabbato dūre ṭhitānampi abhimukhe ṭhito viya pakāseti, evaṃ pakāsentīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asantetthā"
      },
      "ti diṭṭhadhammagarukā vitiṇṇaparalokā āmisacakkhukā jīvikatthāya pabbajitā bālapuggalā asanto nāma, te ettha buddhānaṃ dakkhiṇassa jāṇumaṇḍalassa santike nisinnāpi na dissanti na paññāyanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rattiṃ khittā"
      },
      "ti rattiṃ caturaṅgasamannāgate andhakāre khittasarā viya tathārūpassa upanissayabhūtassa pubbahetuno abhāvena na paññāyantīti attho."
    ],
    "innerText": "Tattha santoti rāgādīnaṃ santatāya buddhādayo santā nāma. Idha pana pubbabuddhesu katādhikārā ussannakusalamūlā bhāvitabhāvanā sattā santoti adhippetā. Pakāsentīti dūre ṭhitāpi buddhānaṃ ñāṇapathaṃ āgacchantā pākaṭā honti. Himavanto vāti yathā hi tiyojanasahassavitthato pañcayojanasatubbedho caturāsītiyā kūṭasahassehi paṭimaṇḍito himavantapabbato dūre ṭhitānampi abhimukhe ṭhito viya pakāseti, evaṃ pakāsentīti attho. Asantetthāti diṭṭhadhammagarukā vitiṇṇaparalokā āmisacakkhukā jīvikatthāya pabbajitā bālapuggalā asanto nāma, te ettha buddhānaṃ dakkhiṇassa jāṇumaṇḍalassa santike nisinnāpi na dissanti na paññāyanti. Rattiṃ khittāti rattiṃ caturaṅgasamannāgate andhakāre khittasarā viya tathārūpassa upanissayabhūtassa pubbahetuno abhāvena na paññāyantīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Desanāvasāne bahū sotāpattiphalādīni pāpuṇiṃsūti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sakko devarājā ‘‘satthārā subhaddāya nimantanaṃ adhivāsita’’nti ñatvā vissakammadevaputtaṃ āṇāpesi – ‘‘pañca kūṭāgārasatāni nimminitvā sve buddhappamukhaṃ bhikkhusaṅghaṃ ugganagaraṃ nehī’’ti. So punadivase pañcasatāni kūṭāgārāni nimminitvā jetavanadvāre aṭṭhāsi. Satthā uccinitvā visuddhakhīṇāsavānaṃyeva pañcasatāni ādāya saparivāro kūṭāgāresu nisīditvā ugganagaraṃ agamāsi. Uggaseṭṭhipi saparivāro subhaddāya dinnanayeneva tathāgatassa āgatamaggaṃ olokento satthāraṃ mahantena sirivibhavena ",
      " āgacchantaṃ disvā pasannamānaso mālādīhi mahantaṃ sakkāraṃ karonto saparivāro sampaṭicchitvā vanditvā mahādānaṃ datvā punappunaṃ nimantetvā sattāhaṃ mahādānaṃ adāsi. Satthāpissa sappāyaṃ sallakkhetvā ",
      " dhammaṃ ",
      " desesi. Taṃ ādiṃ katvā caturāsītiyā pāṇasahassānaṃ dhammābhisamayo ahosi. Satthā ‘‘cūḷasubhaddāya anuggahaṇatthaṃ tvaṃ idheva hohī’’ti anuruddhattheraṃ nivattāpetvā sāvatthimeva agamāsi. Tato paṭṭhāya taṃ nagaraṃ saddhāsampannaṃ ahosīti."
    ],
    "innerText": "Sakko devarājā ‘‘satthārā subhaddāya nimantanaṃ adhivāsita’’nti ñatvā vissakammadevaputtaṃ āṇāpesi – ‘‘pañca kūṭāgārasatāni nimminitvā sve buddhappamukhaṃ bhikkhusaṅghaṃ ugganagaraṃ nehī’’ti. So punadivase pañcasatāni kūṭāgārāni nimminitvā jetavanadvāre aṭṭhāsi. Satthā uccinitvā visuddhakhīṇāsavānaṃyeva pañcasatāni ādāya saparivāro kūṭāgāresu nisīditvā ugganagaraṃ agamāsi. Uggaseṭṭhipi saparivāro subhaddāya dinnanayeneva tathāgatassa āgatamaggaṃ olokento satthāraṃ mahantena sirivibhavena āgacchantaṃ disvā pasannamānaso mālādīhi mahantaṃ sakkāraṃ karonto saparivāro sampaṭicchitvā vanditvā mahādānaṃ datvā punappunaṃ nimantetvā sattāhaṃ mahādānaṃ adāsi. Satthāpissa sappāyaṃ sallakkhetvā dhammaṃ desesi. Taṃ ādiṃ katvā caturāsītiyā pāṇasahassānaṃ dhammābhisamayo ahosi. Satthā ‘‘cūḷasubhaddāya anuggahaṇatthaṃ tvaṃ idheva hohī’’ti anuruddhattheraṃ nivattāpetvā sāvatthimeva agamāsi. Tato paṭṭhāya taṃ nagaraṃ saddhāsampannaṃ ahosīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Cūḷasubhaddāvatthu aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Ekavihārittheravatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekāsana"
      },
      "nti imaṃ dhammadesanaṃ satthā jetavane viharanto ekavihārittheraṃ nāma ārabbha kathesi."
    ],
    "innerText": "Ekāsananti imaṃ dhammadesanaṃ satthā jetavane viharanto ekavihārittheraṃ nāma ārabbha kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "So kira thero ekakova seyyaṃ kappeti, ekakova nisīdati, ekakova caṅkamati, ekakova tiṭṭhatīti catuparisantare pākaṭo ahosi. Atha naṃ bhikkhū, ‘‘bhante, evarūpo nāmāyaṃ thero’’ti tathāgatassārocesuṃ. Satthā ‘‘sādhu sādhū’’ti ",
      " tassa sādhukāraṃ datvā ‘‘bhikkhunā nāma pavivittena bhavitabba’’nti viveke ānisaṃsaṃ kathetvā imaṃ gāthamāha –"
    ],
    "innerText": "So kira thero ekakova seyyaṃ kappeti, ekakova nisīdati, ekakova caṅkamati, ekakova tiṭṭhatīti catuparisantare pākaṭo ahosi. Atha naṃ bhikkhū, ‘‘bhante, evarūpo nāmāyaṃ thero’’ti tathāgatassārocesuṃ. Satthā ‘‘sādhu sādhū’’ti tassa sādhukāraṃ datvā ‘‘bhikkhunā nāma pavivittena bhavitabba’’nti viveke ānisaṃsaṃ kathetvā imaṃ gāthamāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "305"
      },
      "."
    ],
    "innerText": "305."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ekāsanaṃ ekaseyyaṃ, eko caramatandito;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Eko damayamattānaṃ, vanante ramito siyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekāsanaṃ ekaseyya"
      },
      "nti bhikkhusahassamajjhepi mūlakammaṭṭhānaṃ avijahitvā teneva manasikārena nisinnassa āsanaṃ ekāsanaṃ nāma. Lohapāsādasadisepi ca pāsāde bhikkhusahassamajjhepi paññatte vicitrapaccattharaṇūpadhāne mahārahe sayane satiṃ upaṭṭhapetvā dakkhiṇena passena mūlakammaṭṭhānamanasikārena nipannassa bhikkhuno seyyā ekaseyyā nāma. Evarūpaṃ ekāsanañca ekaseyyañca bhajethāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atandito"
      },
      "ti jaṅghabalaṃ nissāya jīvitakappanena akusīto hutvā sabbīriyāpathesu ekakova carantoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Eko damaya"
      },
      "nti rattiṭṭhānādīsu ",
      " kammaṭṭhānaṃ anuyuñjitvā maggaphalādhigamavasena ekova hutvā attānaṃ damentoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vanante ramito siyā"
      },
      "ti evaṃ attānaṃ damento itthipurisasaddādīhi pavivitte vananteyeva abhiramito bhaveyya. Na hi sakkā ākiṇṇavihārinā evaṃ attānaṃ dametunti attho."
    ],
    "innerText": "Tattha ekāsanaṃ ekaseyyanti bhikkhusahassamajjhepi mūlakammaṭṭhānaṃ avijahitvā teneva manasikārena nisinnassa āsanaṃ ekāsanaṃ nāma. Lohapāsādasadisepi ca pāsāde bhikkhusahassamajjhepi paññatte vicitrapaccattharaṇūpadhāne mahārahe sayane satiṃ upaṭṭhapetvā dakkhiṇena passena mūlakammaṭṭhānamanasikārena nipannassa bhikkhuno seyyā ekaseyyā nāma. Evarūpaṃ ekāsanañca ekaseyyañca bhajethāti attho. Atanditoti jaṅghabalaṃ nissāya jīvitakappanena akusīto hutvā sabbīriyāpathesu ekakova carantoti attho. Eko damayanti rattiṭṭhānādīsu kammaṭṭhānaṃ anuyuñjitvā maggaphalādhigamavasena ekova hutvā attānaṃ damentoti attho. Vanante ramito siyāti evaṃ attānaṃ damento itthipurisasaddādīhi pavivitte vananteyeva abhiramito bhaveyya. Na hi sakkā ākiṇṇavihārinā evaṃ attānaṃ dametunti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Desanāvasāne ",
      " bahū sotāpattiphalādīni pāpuṇiṃsu. Tato paṭṭhāya mahājano ekavihārikameva patthesīti."
    ],
    "innerText": "Desanāvasāne bahū sotāpattiphalādīni pāpuṇiṃsu. Tato paṭṭhāya mahājano ekavihārikameva patthesīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ekavihārittheravatthu navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pakiṇṇakavaggavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ekavīsatimo vaggo."
  }
]