[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "25. Bhikkhuvaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Pañcabhikkhuvatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cakkhunā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṃvaro"
      },
      "ti imaṃ dhammadesanaṃ satthā jetavane viharanto pañca bhikkhū ārabbha kathesi."
    ],
    "innerText": "Cakkhunāsaṃvaroti imaṃ dhammadesanaṃ satthā jetavane viharanto pañca bhikkhū ārabbha kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tesu kira ekeko cakkhudvārādīsu pañcasu dvāresu ekekameva rakkhi. Athekadivasaṃ sannipatitvā ‘‘ahaṃ durakkhaṃ rakkhāmi, ahaṃ durakkhaṃ rakkhāmī’’ti vivaditvā ‘‘satthāraṃ pucchitvā imamatthaṃ jānissāmā’’ti satthāraṃ upasaṅkamitvā, ‘‘bhante, mayaṃ cakkhudvārādīni rakkhantā attano attano rakkhanadvārameva durakkhanti maññāma, ko nu kho amhesu durakkhaṃ rakkhatī’’ti pucchiṃsu. Satthā ekaṃ bhikkhumpi anosādetvā, ‘‘bhikkhave, sabbāni petāni durakkhāneva, api ca kho pana tumhe na idāneva pañcasu ṭhānesu asaṃvutā, pubbepi asaṃvutā, asaṃvutattāyeva ca paṇḍitānaṃ ovāde avattitvā jīvitakkhayaṃ pāpuṇitthā’’ti vatvā ‘‘kadā, bhante’’ti tehi yācito atīte takkasilajātakassa vatthuṃ vitthāretvā rakkhasīnaṃ ",
      " vasena rājakule jīvitakkhayaṃ patte pattābhisekena mahāsattena setacchattassa heṭṭhā rājāsane nisinnena attano sirisampattiṃ oloketvā ‘‘vīriyaṃ nāmetaṃ sattehi kattabbamevā’’ti udānavasena udānitaṃ –"
    ],
    "innerText": "Tesu kira ekeko cakkhudvārādīsu pañcasu dvāresu ekekameva rakkhi. Athekadivasaṃ sannipatitvā ‘‘ahaṃ durakkhaṃ rakkhāmi, ahaṃ durakkhaṃ rakkhāmī’’ti vivaditvā ‘‘satthāraṃ pucchitvā imamatthaṃ jānissāmā’’ti satthāraṃ upasaṅkamitvā, ‘‘bhante, mayaṃ cakkhudvārādīni rakkhantā attano attano rakkhanadvārameva durakkhanti maññāma, ko nu kho amhesu durakkhaṃ rakkhatī’’ti pucchiṃsu. Satthā ekaṃ bhikkhumpi anosādetvā, ‘‘bhikkhave, sabbāni petāni durakkhāneva, api ca kho pana tumhe na idāneva pañcasu ṭhānesu asaṃvutā, pubbepi asaṃvutā, asaṃvutattāyeva ca paṇḍitānaṃ ovāde avattitvā jīvitakkhayaṃ pāpuṇitthā’’ti vatvā ‘‘kadā, bhante’’ti tehi yācito atīte takkasilajātakassa vatthuṃ vitthāretvā rakkhasīnaṃ vasena rājakule jīvitakkhayaṃ patte pattābhisekena mahāsattena setacchattassa heṭṭhā rājāsane nisinnena attano sirisampattiṃ oloketvā ‘‘vīriyaṃ nāmetaṃ sattehi kattabbamevā’’ti udānavasena udānitaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kusalūpadese dhitiyā daḷhāya ca,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Anivattitattābhayabhīrutāya ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Na rakkhasīnaṃ vasamāgamimhase,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sa sotthibhāvo mahatā bhayena me’’ti. (jā. 1.1.132) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Imaṃ gāthaṃ dassetvā ‘‘tadāpi tumheva pañca janā takkasilāyaṃ rajjagahaṇatthāya nikkhantaṃ mahāsattaṃ āvudhahatthā parivāretvā maggaṃ gacchantā antarāmagge rakkhasīhi cakkhudvārādivasena upanītesu rūpārammaṇādīsu asaṃvutā paṇḍitassa ovāde avattitvā olīyantā rakkhasīhi khāditā ",
      " jīvitakkhayaṃ pāpuṇittha. Tesu pana ārammaṇesu susaṃvuto piṭṭhito piṭṭhito anubandhantiṃ devavaṇṇiṃ yakkhiniṃ anādiyitvā sotthinā takkasilaṃ gantvā rajjaṃ ",
      " patto rājā ahamevā’’ti jātakaṃ samodhānetvā, ‘‘bhikkhave, bhikkhunā nāma sabbāni dvārāni saṃvaritabbāni. Etāni hi saṃvaranto eva sabbadukkhā pamuccatī’’ti vatvā dhammaṃ desento imā gāthā abhāsi –"
    ],
    "innerText": "Imaṃ gāthaṃ dassetvā ‘‘tadāpi tumheva pañca janā takkasilāyaṃ rajjagahaṇatthāya nikkhantaṃ mahāsattaṃ āvudhahatthā parivāretvā maggaṃ gacchantā antarāmagge rakkhasīhi cakkhudvārādivasena upanītesu rūpārammaṇādīsu asaṃvutā paṇḍitassa ovāde avattitvā olīyantā rakkhasīhi khāditā jīvitakkhayaṃ pāpuṇittha. Tesu pana ārammaṇesu susaṃvuto piṭṭhito piṭṭhito anubandhantiṃ devavaṇṇiṃ yakkhiniṃ anādiyitvā sotthinā takkasilaṃ gantvā rajjaṃ patto rājā ahamevā’’ti jātakaṃ samodhānetvā, ‘‘bhikkhave, bhikkhunā nāma sabbāni dvārāni saṃvaritabbāni. Etāni hi saṃvaranto eva sabbadukkhā pamuccatī’’ti vatvā dhammaṃ desento imā gāthā abhāsi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "360"
      },
      "."
    ],
    "innerText": "360."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " ‘‘Cakkhunā ",
      " saṃvaro sādhu, sādhu sotena saṃvaro;"
    ],
    "innerText": "‘‘Cakkhunā saṃvaro sādhu, sādhu sotena saṃvaro;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ghānena saṃvaro sādhu, sādhu jivhāya saṃvaro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "361"
      },
      "."
    ],
    "innerText": "361."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kāyena saṃvaro sādhu, sādhu vācāya saṃvaro;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Manasā saṃvaro sādhu, sādhu sabbattha saṃvaro;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sabbattha saṃvuto bhikkhu, sabbadukkhā pamuccatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cakkhunā"
      },
      "ti yadā hi bhikkhuno cakkhudvāre rūpārammaṇaṃ āpāthamāgacchati, tadā iṭṭhārammaṇe arajjantassa aniṭṭhārammaṇe adussantassa asamapekkhanena mohaṃ anuppādentassa tasmiṃ dvāre saṃvaro thakanaṃ pidahanaṃ gutti katā nāma hoti. Tassa so evarūpo cakkhunā saṃvaro sādhu. Esa nayo sotadvārādīsupi. Cakkhudvārādīsuyeva pana saṃvaro vā asaṃvaro vā nuppajjati, parato pana javanavīthiyaṃ esa labbhati. Tadā hi asaṃvaro uppajjanto assaddhā akkhanti kosajjaṃ muṭṭhasaccaṃ aññāṇanti akusalavīthiyaṃ ayaṃ pañcavidho labbhati. Saṃvaro uppajjanto saddhā khanti vīriyaṃ sati ñāṇanti kusalavīthiyaṃ ayaṃ pañcavidho labbhati."
    ],
    "innerText": "Tattha cakkhunāti yadā hi bhikkhuno cakkhudvāre rūpārammaṇaṃ āpāthamāgacchati, tadā iṭṭhārammaṇe arajjantassa aniṭṭhārammaṇe adussantassa asamapekkhanena mohaṃ anuppādentassa tasmiṃ dvāre saṃvaro thakanaṃ pidahanaṃ gutti katā nāma hoti. Tassa so evarūpo cakkhunā saṃvaro sādhu. Esa nayo sotadvārādīsupi. Cakkhudvārādīsuyeva pana saṃvaro vā asaṃvaro vā nuppajjati, parato pana javanavīthiyaṃ esa labbhati. Tadā hi asaṃvaro uppajjanto assaddhā akkhanti kosajjaṃ muṭṭhasaccaṃ aññāṇanti akusalavīthiyaṃ ayaṃ pañcavidho labbhati. Saṃvaro uppajjanto saddhā khanti vīriyaṃ sati ñāṇanti kusalavīthiyaṃ ayaṃ pañcavidho labbhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāyena saṃvaro"
      },
      "ti ettha pana pasādakāyopi copanakāyopi labbhati. Ubhayampi panetaṃ kāyadvārameva. Tattha pasādadvāre saṃvarāsaṃvaro kathitova. Copanadvārepi taṃvatthukā pāṇātipātaadinnādānakāmesumicchācārā. Tehi pana saddhiṃ akusalavīthiyaṃ uppajjantehi taṃ dvāraṃ asaṃvutaṃ hoti, kusalavīthiyaṃ uppajjantehi ",
      " pāṇātipātāveramaṇiādīhi saṃvutaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sādhu vācāyā"
      },
      "ti etthāpi copanavācāpi vācā. Tāya saddhiṃ uppajjantehi musāvādādīhi taṃ dvāraṃ asaṃvutaṃ hoti, musāvādāveramaṇiādīhi saṃvutaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Manasā saṃvaro"
      },
      "ti etthāpi javanamanato aññena manena saddhiṃ abhijjhādayo natthi. Manodvāre pana javanakkhaṇe uppajjamānehi abhijjhādīhi taṃ dvāraṃ asaṃvutaṃ hoti, anabhijjhādīhi saṃvutaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sādhu sabbatthā"
      },
      "ti tesu cakkhudvārādīsu sabbesupi saṃvaro sādhu. Ettāvatā hi aṭṭha saṃvaradvārāni aṭṭha ca asaṃvaradvārāni ",
      " kathitāni. Tesu aṭṭhasu asaṃvaradvāresu ṭhito bhikkhu sakalavaṭṭamūlakadukkhato ",
      " na muccati, saṃvaradvāresu pana ṭhito sabbasmāpi vaṭṭamūlakadukkhā muccati. Tena vuttaṃ – ‘‘sabbattha saṃvuto bhikkhu, sabbadukkhā pamuccatī’’ti."
    ],
    "innerText": "Kāyena saṃvaroti ettha pana pasādakāyopi copanakāyopi labbhati. Ubhayampi panetaṃ kāyadvārameva. Tattha pasādadvāre saṃvarāsaṃvaro kathitova. Copanadvārepi taṃvatthukā pāṇātipātaadinnādānakāmesumicchācārā. Tehi pana saddhiṃ akusalavīthiyaṃ uppajjantehi taṃ dvāraṃ asaṃvutaṃ hoti, kusalavīthiyaṃ uppajjantehi pāṇātipātāveramaṇiādīhi saṃvutaṃ. Sādhu vācāyāti etthāpi copanavācāpi vācā. Tāya saddhiṃ uppajjantehi musāvādādīhi taṃ dvāraṃ asaṃvutaṃ hoti, musāvādāveramaṇiādīhi saṃvutaṃ. Manasā saṃvaroti etthāpi javanamanato aññena manena saddhiṃ abhijjhādayo natthi. Manodvāre pana javanakkhaṇe uppajjamānehi abhijjhādīhi taṃ dvāraṃ asaṃvutaṃ hoti, anabhijjhādīhi saṃvutaṃ hoti. Sādhu sabbatthāti tesu cakkhudvārādīsu sabbesupi saṃvaro sādhu. Ettāvatā hi aṭṭha saṃvaradvārāni aṭṭha ca asaṃvaradvārāni kathitāni. Tesu aṭṭhasu asaṃvaradvāresu ṭhito bhikkhu sakalavaṭṭamūlakadukkhato na muccati, saṃvaradvāresu pana ṭhito sabbasmāpi vaṭṭamūlakadukkhā muccati. Tena vuttaṃ – ‘‘sabbattha saṃvuto bhikkhu, sabbadukkhā pamuccatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Desanāvasāne te pañca bhikkhū sotāpattiphale patiṭṭhahiṃsu, sampattānampi sātthikā dhammadesanā ahosīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pañcabhikkhuvatthu paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Haṃsaghātakabhikkhuvatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hatthasaṃyato"
      },
      "ti imaṃ dhammadesanaṃ satthā jetavane viharanto ekaṃ haṃsaghātakaṃ bhikkhuṃ ārabbha kathesi."
    ],
    "innerText": "Hatthasaṃyatoti imaṃ dhammadesanaṃ satthā jetavane viharanto ekaṃ haṃsaghātakaṃ bhikkhuṃ ārabbha kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sāvatthivāsino ",
      " kira dve sahāyakā bhikkhūsu pabbajitvā laddhūpasampadā yebhuyyena ekato vicaranti. Te ekadivasaṃ aciravatiṃ gantvā nhatvā ātape tappamānā sāraṇīyakathaṃ kathentā aṭṭhaṃsu. Tasmiṃ khaṇe dve haṃsā ākāsena gacchanti. Atheko daharabhikkhu sakkharaṃ gahetvā ‘‘ekassa haṃsapotakassa akkhiṃ paharissāmī’’ti āha, itaro ‘‘na sakkhissāmī’’ti āha. Tiṭṭhatu imasmiṃ passe akkhi, parapasse akkhiṃ paharissāmīti. Idampi na sakkhissasiyevāti. ‘‘Tena hi upadhārehī’’ti dutiyaṃ sakkharaṃ gahetvā haṃsassa pacchābhāge khipi, haṃso sakkharasaddaṃ sutvā nivattitvā olokesi. Atha naṃ itaraṃ vaṭṭasakkharaṃ gahetvā parapasse akkhimhi paharitvā orimakkhinā nikkhāmesi. Haṃso viravanto parivattitvā tesaṃ pādamūleyeva pati. Tattha tattha ṭhitā bhikkhū disvā, ‘‘āvuso, buddhasāsane pabbajitvā ananucchavikaṃ vo kataṃ pāṇātipātaṃ karontehī’’ti vatvā te ādāya gantvā tathāgatassa dassesuṃ."
    ],
    "innerText": "Sāvatthivāsino kira dve sahāyakā bhikkhūsu pabbajitvā laddhūpasampadā yebhuyyena ekato vicaranti. Te ekadivasaṃ aciravatiṃ gantvā nhatvā ātape tappamānā sāraṇīyakathaṃ kathentā aṭṭhaṃsu. Tasmiṃ khaṇe dve haṃsā ākāsena gacchanti. Atheko daharabhikkhu sakkharaṃ gahetvā ‘‘ekassa haṃsapotakassa akkhiṃ paharissāmī’’ti āha, itaro ‘‘na sakkhissāmī’’ti āha. Tiṭṭhatu imasmiṃ passe akkhi, parapasse akkhiṃ paharissāmīti. Idampi na sakkhissasiyevāti. ‘‘Tena hi upadhārehī’’ti dutiyaṃ sakkharaṃ gahetvā haṃsassa pacchābhāge khipi, haṃso sakkharasaddaṃ sutvā nivattitvā olokesi. Atha naṃ itaraṃ vaṭṭasakkharaṃ gahetvā parapasse akkhimhi paharitvā orimakkhinā nikkhāmesi. Haṃso viravanto parivattitvā tesaṃ pādamūleyeva pati. Tattha tattha ṭhitā bhikkhū disvā, ‘‘āvuso, buddhasāsane pabbajitvā ananucchavikaṃ vo kataṃ pāṇātipātaṃ karontehī’’ti vatvā te ādāya gantvā tathāgatassa dassesuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Satthā ‘‘saccaṃ kira tayā bhikkhu pāṇātipāto kato’’ti pucchitvā ‘‘saccaṃ, bhante’’ti vutte ‘‘bhikkhu kasmā evarūpe niyyānikasāsane pabbajitvā evamakāsi, porāṇakapaṇḍitā anuppanne buddhe agāramajjhe ",
      " vasamānā appamattakesupi ",
      " ṭhānesu kukkuccaṃ kariṃsu ",
      ", tvaṃ pana evarūpe buddhasāsane pabbajitvā kukkuccamattampi na akāsī’’ti vatvā tehi yācito atītaṃ āhari."
    ],
    "innerText": "Satthā ‘‘saccaṃ kira tayā bhikkhu pāṇātipāto kato’’ti pucchitvā ‘‘saccaṃ, bhante’’ti vutte ‘‘bhikkhu kasmā evarūpe niyyānikasāsane pabbajitvā evamakāsi, porāṇakapaṇḍitā anuppanne buddhe agāramajjhe vasamānā appamattakesupi ṭhānesu kukkuccaṃ kariṃsu , tvaṃ pana evarūpe buddhasāsane pabbajitvā kukkuccamattampi na akāsī’’ti vatvā tehi yācito atītaṃ āhari."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atīte kururaṭṭhe indapattanagare dhanañcaye rajjaṃ kārente bodhisatto tassa aggamahesiyā kucchismiṃ paṭisandhiṃ gahetvā anupubbena viññutaṃ patto takkasilāyaṃ sippāni uggahetvā pitarā uparajje patiṭṭhāpito aparabhāge pitu accayena rajjaṃ patvā dasa rājadhamme akopento kurudhamme vattittha. Kurudhammo nāma pañcasīlāni, tāni bodhisatto parisuddhāni katvā rakkhi. Yathā ca bodhisatto, evamassa mātā aggamahesī kaniṭṭhabhātā uparājā purohito brāhmaṇo rajjugāhako amacco sārathi seṭṭhi doṇamāpako mahāmatto dovāriko nagarasobhinī vaṇṇadāsīti evametesu ekādasasu janesu kurudhammaṃ rakkhantesu kaliṅgaraṭṭhe dantapuranagare kaliṅge rajjaṃ kārente tasmiṃ raṭṭhe devo na vassi. Mahāsattassa pana añjanasannibho nāma maṅgalahatthī mahāpuñño hoti. Raṭṭhavāsino ‘‘tasmiṃ ānīte devo vassissatī’’ti saññāya rañño ārocayiṃsu. Rājā tassa hatthissa ānayanatthāya brāhmaṇe pahiṇi. Te gantvā mahāsattaṃ hatthiṃ yāciṃsu. Satthā tesaṃ yācanakāraṇaṃ dassetuṃ āha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Tava ",
      " saddhañca sīlañca, viditvāna janādhipa;"
    ],
    "innerText": "‘‘Tava saddhañca sīlañca, viditvāna janādhipa;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vaṇṇaṃ añjanavaṇṇena, kaliṅgasmiṃ nimimhase’’ti. (jā. 1.3.76) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Imaṃ tikanipāte jātakaṃ kathesi. Hatthimhi pana ānītepi deve avassante ‘‘so rājā kurudhammaṃ rakkhati, tenassa raṭṭhe devo vassatī’’ti saññāya ‘‘yaṃ so kurudhammaṃ rakkhati, taṃ suvaṇṇapaṭṭe likhitvā ānethā’’ti puna kāliṅgo brāhmaṇe ca amacce ca pesesi. Tesu gantvā yācantesu rājānaṃ ādiṃ katvā sabbepi te attano attano sīlesu kiñci kukkuccamattaṃ katvā ‘‘aparisuddhaṃ no sīla’’nti paṭikkhipitvāpi ‘‘na ettāvatā sīlabhedo hotī’’ti tehi punappunaṃ yācitā attano attano sīlāni kathayiṃsu. Kāliṅgo suvaṇṇapaṭṭe likhāpetvā ābhataṃ ",
      " kurudhammaṃ disvāva samādāya sādhukaṃ pūresi. Tassa raṭṭhe devo pāvassi, raṭṭhaṃ khemaṃ subhikkhaṃ ahosi. Satthā imaṃ atītaṃ āharitvā –"
    ],
    "innerText": "Imaṃ tikanipāte jātakaṃ kathesi. Hatthimhi pana ānītepi deve avassante ‘‘so rājā kurudhammaṃ rakkhati, tenassa raṭṭhe devo vassatī’’ti saññāya ‘‘yaṃ so kurudhammaṃ rakkhati, taṃ suvaṇṇapaṭṭe likhitvā ānethā’’ti puna kāliṅgo brāhmaṇe ca amacce ca pesesi. Tesu gantvā yācantesu rājānaṃ ādiṃ katvā sabbepi te attano attano sīlesu kiñci kukkuccamattaṃ katvā ‘‘aparisuddhaṃ no sīla’’nti paṭikkhipitvāpi ‘‘na ettāvatā sīlabhedo hotī’’ti tehi punappunaṃ yācitā attano attano sīlāni kathayiṃsu. Kāliṅgo suvaṇṇapaṭṭe likhāpetvā ābhataṃ kurudhammaṃ disvāva samādāya sādhukaṃ pūresi. Tassa raṭṭhe devo pāvassi, raṭṭhaṃ khemaṃ subhikkhaṃ ahosi. Satthā imaṃ atītaṃ āharitvā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Gaṇikā uppalavaṇṇā, puṇṇo dovāriko tadā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Rajjugāho ca kaccāno, doṇamāpako ca kolito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Sāriputto ",
      " tadā seṭṭhī, anuruddho ca sārathī;"
    ],
    "innerText": "‘‘Sāriputto tadā seṭṭhī, anuruddho ca sārathī;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Brāhmaṇo kassapo thero, uparājānandapaṇḍito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Mahesī rāhulamātā, māyādevī janettikā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kururājā bodhisatto, evaṃ dhāretha jātaka’’nti. –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Jātakaṃ ",
      " samodhānetvā ‘‘bhikkhu evaṃ pubbepi paṇḍitā appamattakepi kukkucce uppanne attano sīlabhede āsaṅkaṃ kariṃsu, tvaṃ pana mādisassa buddhassa sāsane pabbajitvā pāṇātipātaṃ karonto atibhāriyaṃ kammamakāsi, bhikkhunā nāma hatthehi pādehi vācāya ca saṃyatena bhavitabba’’nti vatvā imaṃ gāthamāha –"
    ],
    "innerText": "Jātakaṃ samodhānetvā ‘‘bhikkhu evaṃ pubbepi paṇḍitā appamattakepi kukkucce uppanne attano sīlabhede āsaṅkaṃ kariṃsu, tvaṃ pana mādisassa buddhassa sāsane pabbajitvā pāṇātipātaṃ karonto atibhāriyaṃ kammamakāsi, bhikkhunā nāma hatthehi pādehi vācāya ca saṃyatena bhavitabba’’nti vatvā imaṃ gāthamāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "362"
      },
      "."
    ],
    "innerText": "362."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Hatthasaṃyato pādasaṃyato,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Vācāsaṃyato saṃyatuttamo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Ajjhattarato samāhito,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Eko santusito tamāhu bhikkhu’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hatthasaṃyato"
      },
      "ti hatthakīḷāpanādīnaṃ vā hatthena paresaṃ paharaṇādīnaṃ vā abhāvena hatthasaṃyato. Dutiyapadepi eseva nayo. Vācāya pana musāvādādīnaṃ akaraṇato vācāya saṃyato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṃyatuttamo"
      },
      "ti saṃyatattabhāvo, kāyacalanasīsukkhipanabhamukavikārādīnaṃ akārakoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ajjhattarato"
      },
      "ti gocarajjhattasaṅkhātāya kammaṭṭhānabhāvanāya rato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samāhito"
      },
      "ti suṭṭhu ṭhapito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Eko santusito"
      },
      "ti ekavihārī hutvā suṭṭhu tusito vipassanācārato paṭṭhāya attano adhigamena tuṭṭhamānaso. Puthujjanakalyāṇakañhi ādiṃ katvā sabbepi sekhā attano adhigamena santussantīti santusitā, arahā pana ekantasantusitova. Taṃ sandhāyetaṃ vuttaṃ."
    ],
    "innerText": "Tattha hatthasaṃyatoti hatthakīḷāpanādīnaṃ vā hatthena paresaṃ paharaṇādīnaṃ vā abhāvena hatthasaṃyato. Dutiyapadepi eseva nayo. Vācāya pana musāvādādīnaṃ akaraṇato vācāya saṃyato. Saṃyatuttamoti saṃyatattabhāvo, kāyacalanasīsukkhipanabhamukavikārādīnaṃ akārakoti attho. Ajjhattaratoti gocarajjhattasaṅkhātāya kammaṭṭhānabhāvanāya rato. Samāhitoti suṭṭhu ṭhapito. Eko santusitoti ekavihārī hutvā suṭṭhu tusito vipassanācārato paṭṭhāya attano adhigamena tuṭṭhamānaso. Puthujjanakalyāṇakañhi ādiṃ katvā sabbepi sekhā attano adhigamena santussantīti santusitā, arahā pana ekantasantusitova. Taṃ sandhāyetaṃ vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Desanāvasāne bahū sotāpattiphalādīni pāpuṇiṃsūti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Haṃsaghātakabhikkhuvatthu dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Kokālikavatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yo"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mukhasaṃyato"
      },
      "ti imaṃ dhammadesanaṃ satthā jetavane viharanto kokālikaṃ ārabbha kathesi. Vatthu ‘‘atha kho kokāliko bhikkhu yena bhagavā tenupasaṅkamī’’ti sutte (saṃ. ni. 1.181; su. ni. kokālikasutta; a. ni. 10.89) āgatameva. Atthopissa aṭṭhakathāya vuttanayeneva veditabbo."
    ],
    "innerText": "Yomukhasaṃyatoti imaṃ dhammadesanaṃ satthā jetavane viharanto kokālikaṃ ārabbha kathesi. Vatthu ‘‘atha kho kokāliko bhikkhu yena bhagavā tenupasaṅkamī’’ti sutte (saṃ. ni. 1.181; su. ni. kokālikasutta; a. ni. 10.89) āgatameva. Atthopissa aṭṭhakathāya vuttanayeneva veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kokālike pana padumaniraye uppanne dhammasabhāyaṃ kathaṃ samuṭṭhāpesuṃ ‘‘aho kokāliko bhikkhu attano mukhaṃ nissāya vināsaṃ patto, dve aggasāvake akkosantasseva hissa pathavī vivaraṃ adāsī’’ti. Satthā āgantvā ‘‘kāya nuttha, bhikkhave, etarahi kathāya sannisinnā’’ti pucchitvā ‘‘imāya nāmā’’ti vutte ‘‘na, bhikkhave, idāneva, pubbepi kokāliko bhikkhu attano mukhameva nissāya naṭṭho’’ti vatvā tamatthaṃ sotukāmehi bhikkhūhi yācito tassa pakāsanatthaṃ atītaṃ āhari."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atīte himavantapadese ekasmiṃ sare kacchapo vasati. Dve haṃsapotakā gocarāya carantā tena saddhiṃ vissāsaṃ katvā daḷhavissāsikā hutvā ekadivasaṃ kacchapaṃ pucchiṃsu – ‘‘samma, amhākaṃ himavante cittakūṭapabbatatale kañcanaguhāya vasanaṭṭhānaṃ, ramaṇiyo padeso, gacchissasi amhehi saddhi’’nti. ‘‘Samma, ahaṃ kathaṃ gamissāmī’’ti? ‘‘Mayaṃ taṃ nessāma, sace mukhaṃ rakkhituṃ sakkhissasī’’ti. ‘‘Rakkhissāmi, sammā gahetvā maṃ gacchathā’’ti. Te ‘‘sādhū’’ti vatvā ekaṃ daṇḍakaṃ kacchapena ",
      " ḍaṃsāpetvā sayaṃ tassa ubho koṭiyo ḍaṃsitvā ākāsaṃ pakkhandiṃsu. Taṃ tathā haṃsehi nīyamānaṃ gāmadārakā disvā ‘‘dve haṃsā kacchapaṃ daṇḍena harantī’’ti āhaṃsu. Kacchapo ‘‘yadi maṃ sahāyakā nenti, tumhākaṃ ettha kiṃ hoti duṭṭhaceṭakā’’ti vattukāmo haṃsānaṃ sīghavegatāya bārāṇasinagare rājanivesanassa uparibhāgaṃ sampattakāle daṭṭhaṭṭhānato daṇḍakaṃ vissajjetvā ākāsaṅgaṇe patitvā dvedhā bhijji. Satthā imaṃ atītaṃ āharitvā –"
    ],
    "innerText": "Atīte himavantapadese ekasmiṃ sare kacchapo vasati. Dve haṃsapotakā gocarāya carantā tena saddhiṃ vissāsaṃ katvā daḷhavissāsikā hutvā ekadivasaṃ kacchapaṃ pucchiṃsu – ‘‘samma, amhākaṃ himavante cittakūṭapabbatatale kañcanaguhāya vasanaṭṭhānaṃ, ramaṇiyo padeso, gacchissasi amhehi saddhi’’nti. ‘‘Samma, ahaṃ kathaṃ gamissāmī’’ti? ‘‘Mayaṃ taṃ nessāma, sace mukhaṃ rakkhituṃ sakkhissasī’’ti. ‘‘Rakkhissāmi, sammā gahetvā maṃ gacchathā’’ti. Te ‘‘sādhū’’ti vatvā ekaṃ daṇḍakaṃ kacchapena ḍaṃsāpetvā sayaṃ tassa ubho koṭiyo ḍaṃsitvā ākāsaṃ pakkhandiṃsu. Taṃ tathā haṃsehi nīyamānaṃ gāmadārakā disvā ‘‘dve haṃsā kacchapaṃ daṇḍena harantī’’ti āhaṃsu. Kacchapo ‘‘yadi maṃ sahāyakā nenti, tumhākaṃ ettha kiṃ hoti duṭṭhaceṭakā’’ti vattukāmo haṃsānaṃ sīghavegatāya bārāṇasinagare rājanivesanassa uparibhāgaṃ sampattakāle daṭṭhaṭṭhānato daṇḍakaṃ vissajjetvā ākāsaṅgaṇe patitvā dvedhā bhijji. Satthā imaṃ atītaṃ āharitvā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Avadhī ",
      " vata attānaṃ, kacchapo byāharaṃ giraṃ;"
    ],
    "innerText": "‘‘Avadhī vata attānaṃ, kacchapo byāharaṃ giraṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Suggahītasmiṃ kaṭṭhasmiṃ, vācāya sakiyāvadhī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Etampi ",
      " disvā naravīriyaseṭṭha,"
    ],
    "innerText": "‘‘Etampi disvā naravīriyaseṭṭha,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Vācaṃ pamuñce kusalaṃ nātivelaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Passasi bahubhāṇena, kacchapaṃ byasanaṃ gata’’nti. (jā. 1.2.129-130);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Imaṃ dukanipāte ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bahubhāṇijātakaṃ"
      },
      " vitthāretvā, ‘‘bhikkhave, bhikkhunā nāma mukhasaṃyatena samacārinā anuddhatena nibbutacittena bhavitabba’’nti vatvā imaṃ gāthamāha –"
    ],
    "innerText": "Imaṃ dukanipāte bahubhāṇijātakaṃ vitthāretvā, ‘‘bhikkhave, bhikkhunā nāma mukhasaṃyatena samacārinā anuddhatena nibbutacittena bhavitabba’’nti vatvā imaṃ gāthamāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "363"
      },
      "."
    ],
    "innerText": "363."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " ‘‘Yo ",
      " mukhasaṃyato bhikkhu, mantabhāṇī anuddhato;"
    ],
    "innerText": "‘‘Yo mukhasaṃyato bhikkhu, mantabhāṇī anuddhato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Atthaṃ dhammañca dīpeti, madhuraṃ tassa bhāsita’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mukhasaṃyato"
      },
      "ti dāsacaṇḍālādayopi ‘‘tvaṃ dujjāto, tvaṃ dussīlo’’tiādīnaṃ avacanatāya mukhena saṃyato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mantabhāṇī"
      },
      "ti mantā vuccati paññā, tāya bhaṇanasīlo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anuddhato"
      },
      "ti nibbutacitto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atthaṃ dhammañca dīpetī"
      },
      "ti bhāsitatthañceva desanādhammañca katheti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Madhura"
      },
      "nti evarūpassa bhikkhuno bhāsitaṃ madhuraṃ nāma. Yo pana atthameva sampādeti, na pāḷiṃ, pāḷiṃyeva sampādeti, na atthaṃ, ubhayaṃ vā pana na sampādeti, tassa bhāsitaṃ madhuraṃ nāma na hotīti."
    ],
    "innerText": "Tattha mukhasaṃyatoti dāsacaṇḍālādayopi ‘‘tvaṃ dujjāto, tvaṃ dussīlo’’tiādīnaṃ avacanatāya mukhena saṃyato. Mantabhāṇīti mantā vuccati paññā, tāya bhaṇanasīlo. Anuddhatoti nibbutacitto. Atthaṃ dhammañca dīpetīti bhāsitatthañceva desanādhammañca katheti. Madhuranti evarūpassa bhikkhuno bhāsitaṃ madhuraṃ nāma. Yo pana atthameva sampādeti, na pāḷiṃ, pāḷiṃyeva sampādeti, na atthaṃ, ubhayaṃ vā pana na sampādeti, tassa bhāsitaṃ madhuraṃ nāma na hotīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Desanāvasāne bahū sotāpattiphalādīni pāpuṇiṃsūti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Kokālikavatthu tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Dhammārāmattheravatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammārāmo"
      },
      "ti imaṃ dhammadesanaṃ satthā jetavane viharanto dhammārāmattheraṃ ārabbha kathesi."
    ],
    "innerText": "Dhammārāmoti imaṃ dhammadesanaṃ satthā jetavane viharanto dhammārāmattheraṃ ārabbha kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Satthārā kira ‘‘ito me catumāsaccayena parinibbānaṃ bhavissatī’’ti ārocite anekasahassā bhikkhū satthāraṃ parivāretvā vicariṃsu. Tattha puthujjanā ",
      " bhikkhū assūni sandhāretuṃ nāsakkhiṃsu, khīṇāsavānaṃ dhammasaṃvego uppajji. Sabbepi ‘‘kiṃ nu kho karissāmā’’ti vaggabandhanena ",
      " vicaranti. Eko pana dhammārāmo nāma bhikkhu bhikkhūnaṃ santikaṃ na upasaṅkamati. Bhikkhūhi ‘‘kiṃ, āvuso’’ti vuccamāno paṭivacanampi adatvā ‘‘satthā ",
      " kira catumāsaccayena parinibbāyissati, ahañcamhi avītarāgo, satthari dharamāneyeva vāyamitvā arahattaṃ pāpuṇissāmī’’ti ekakova viharanto satthārā desitaṃ dhammaṃ āvajjeti cinteti anussarati. Bhikkhū tathāgatassa ārocesuṃ – ‘‘bhante, dhammārāmassa tumhesu sinehamattampi natthi, ‘satthā kira parinibbāyissati, kiṃ nu kho karissāmā’ti amhehi saddhiṃ sammantanamattampi na karotī’’ti. Satthā taṃ pakkosāpetvā ‘‘saccaṃ kira tvaṃ evaṃ karosī’’ti pucchi. ‘‘Saccaṃ, bhante’’ti. ‘‘Kiṃ kāraṇā’’ti? Tumhe kira catumāsaccayena parinibbāyissatha, ahañcamhi avītarāgo, tumhesu dharantesuyeva vāyamitvā arahattaṃ pāpuṇissāmīti tumhehi desitaṃ dhammaṃ āvajjāmi cintemi anussarāmīti."
    ],
    "innerText": "Satthārā kira ‘‘ito me catumāsaccayena parinibbānaṃ bhavissatī’’ti ārocite anekasahassā bhikkhū satthāraṃ parivāretvā vicariṃsu. Tattha puthujjanā bhikkhū assūni sandhāretuṃ nāsakkhiṃsu, khīṇāsavānaṃ dhammasaṃvego uppajji. Sabbepi ‘‘kiṃ nu kho karissāmā’’ti vaggabandhanena vicaranti. Eko pana dhammārāmo nāma bhikkhu bhikkhūnaṃ santikaṃ na upasaṅkamati. Bhikkhūhi ‘‘kiṃ, āvuso’’ti vuccamāno paṭivacanampi adatvā ‘‘satthā kira catumāsaccayena parinibbāyissati, ahañcamhi avītarāgo, satthari dharamāneyeva vāyamitvā arahattaṃ pāpuṇissāmī’’ti ekakova viharanto satthārā desitaṃ dhammaṃ āvajjeti cinteti anussarati. Bhikkhū tathāgatassa ārocesuṃ – ‘‘bhante, dhammārāmassa tumhesu sinehamattampi natthi, ‘satthā kira parinibbāyissati, kiṃ nu kho karissāmā’ti amhehi saddhiṃ sammantanamattampi na karotī’’ti. Satthā taṃ pakkosāpetvā ‘‘saccaṃ kira tvaṃ evaṃ karosī’’ti pucchi. ‘‘Saccaṃ, bhante’’ti. ‘‘Kiṃ kāraṇā’’ti? Tumhe kira catumāsaccayena parinibbāyissatha, ahañcamhi avītarāgo, tumhesu dharantesuyeva vāyamitvā arahattaṃ pāpuṇissāmīti tumhehi desitaṃ dhammaṃ āvajjāmi cintemi anussarāmīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Satthā ‘‘sādhu sādhū’’ti tassa sādhukāraṃ datvā, ‘‘bhikkhave, aññenāpi mayi sinehavantena bhikkhunā nāma dhammārāmasadiseneva bhavitabbaṃ. Na hi mayhaṃ mālāgandhādīhi pūjaṃ karontā mama pūjaṃ karonti nāma, dhammānudhammaṃ paṭipajjantāyeva pana maṃ pūjenti nāmā’’ti vatvā imaṃ gāthamāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "364"
      },
      "."
    ],
    "innerText": "364."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Dhammārāmo dhammarato, dhammaṃ anuvicintayaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dhammaṃ anussaraṃ bhikkhu, saddhammā na parihāyatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      " nivāsanaṭṭhena samathavipassanādhammo ārāmo assāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammārāmo"
      },
      ". Tasmiṃyeva dhamme ratoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammarato"
      },
      ". Tasseva dhammassa punappunaṃ vicintanatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammaṃ anuvicintayaṃ,"
      },
      " taṃ dhammaṃ āvajjento manasikarontoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anussara"
      },
      "nti tameva dhammaṃ anussaranto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddhammā"
      },
      "ti evarūpo bhikkhu sattatiṃsabhedā bodhipakkhiyadhammā navavidhalokuttaradhammā ca na parihāyatīti attho."
    ],
    "innerText": "Tattha nivāsanaṭṭhena samathavipassanādhammo ārāmo assāti dhammārāmo. Tasmiṃyeva dhamme ratoti dhammarato. Tasseva dhammassa punappunaṃ vicintanatāya dhammaṃ anuvicintayaṃ, taṃ dhammaṃ āvajjento manasikarontoti attho. Anussaranti tameva dhammaṃ anussaranto. Saddhammāti evarūpo bhikkhu sattatiṃsabhedā bodhipakkhiyadhammā navavidhalokuttaradhammā ca na parihāyatīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Desanāvasāne so bhikkhu arahatte patiṭṭhahi, sampattānampi sātthikā dhammadesanā ahosīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dhammārāmattheravatthu catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Vipakkhasevakabhikkhuvatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Salābha"
      },
      "nti ",
      " imaṃ dhammadesanaṃ satthā veḷuvane viharanto aññataraṃ vipakkhasevakaṃ bhikkhuṃ ārabbha kathesi."
    ],
    "innerText": "Salābhanti imaṃ dhammadesanaṃ satthā veḷuvane viharanto aññataraṃ vipakkhasevakaṃ bhikkhuṃ ārabbha kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tassa ",
      " kireko devadattapakkhiko bhikkhu sahāyo ahosi. So taṃ bhikkhūhi saddhiṃ piṇḍāya caritvā katabhattakiccaṃ āgacchantaṃ disvā ‘‘kuhiṃ gatosī’’ti pucchi. ‘‘Asukaṭṭhānaṃ nāma piṇḍāya caritu’’nti. ‘‘Laddho te piṇḍapāto’’ti? ‘‘Āma, laddho’’ti. ‘‘Idha amhākaṃ mahālābhasakkāro, katipāhaṃ idheva hohī’’ti. So tassa vacanena katipāhaṃ tattha vasitvā sakaṭṭhānameva agamāsi ",
      ". Atha naṃ bhikkhū ‘‘ayaṃ, bhante, devadattassa uppannalābhasakkāraṃ paribhuñjati, devadattassa pakkhiko eso’’ti tathāgatassa ārocesuṃ. Satthā taṃ pakkosāpetvā ‘‘saccaṃ kira tvaṃ evamakāsī’’ti pucchi. ‘‘Āma, bhante, ahaṃ tattha ekaṃ daharaṃ nissāya katipāhaṃ vasiṃ, na ca pana devadattassa laddhiṃ rocemī’’ti. Atha naṃ bhagavā ‘‘kiñcāpi tvaṃ laddhiṃ na rocesi, diṭṭhadiṭṭhakānaṃyeva pana laddhiṃ rocento viya vicarasi. Na tvaṃ idāneva evaṃ karosi, pubbepi evarūpoyevā’’ti vatvā ‘‘idāni tāva, bhante, amhehi sāmaṃ diṭṭho, pubbe panesa kesaṃ laddhiṃ rocento viya vicari, ācikkhatha no’’ti bhikkhūhi yācito atītaṃ āharitvā –"
    ],
    "innerText": "Tassa kireko devadattapakkhiko bhikkhu sahāyo ahosi. So taṃ bhikkhūhi saddhiṃ piṇḍāya caritvā katabhattakiccaṃ āgacchantaṃ disvā ‘‘kuhiṃ gatosī’’ti pucchi. ‘‘Asukaṭṭhānaṃ nāma piṇḍāya caritu’’nti. ‘‘Laddho te piṇḍapāto’’ti? ‘‘Āma, laddho’’ti. ‘‘Idha amhākaṃ mahālābhasakkāro, katipāhaṃ idheva hohī’’ti. So tassa vacanena katipāhaṃ tattha vasitvā sakaṭṭhānameva agamāsi . Atha naṃ bhikkhū ‘‘ayaṃ, bhante, devadattassa uppannalābhasakkāraṃ paribhuñjati, devadattassa pakkhiko eso’’ti tathāgatassa ārocesuṃ. Satthā taṃ pakkosāpetvā ‘‘saccaṃ kira tvaṃ evamakāsī’’ti pucchi. ‘‘Āma, bhante, ahaṃ tattha ekaṃ daharaṃ nissāya katipāhaṃ vasiṃ, na ca pana devadattassa laddhiṃ rocemī’’ti. Atha naṃ bhagavā ‘‘kiñcāpi tvaṃ laddhiṃ na rocesi, diṭṭhadiṭṭhakānaṃyeva pana laddhiṃ rocento viya vicarasi. Na tvaṃ idāneva evaṃ karosi, pubbepi evarūpoyevā’’ti vatvā ‘‘idāni tāva, bhante, amhehi sāmaṃ diṭṭho, pubbe panesa kesaṃ laddhiṃ rocento viya vicari, ācikkhatha no’’ti bhikkhūhi yācito atītaṃ āharitvā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Purāṇacorāna vaco nisamma,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Mahiḷāmukho pothayamanvacārī;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Susaññatānañhi vaco nisamma,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Gajuttamo sabbaguṇesu aṭṭhā’’ti. (jā. 1.1.26) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Imaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mahiḷāmukhajātakaṃ"
      },
      " vitthāretvā, ‘‘bhikkhave, bhikkhunā nāma sakalābheneva santuṭṭhena bhavitabbaṃ, paralābhaṃ patthetuṃ na vaṭṭati. Paralābhaṃ patthentassa hi jhānavipassanāmaggaphalesu ekadhammopi nuppajjati, sakalābhasantuṭṭhasseva pana jhānādīni ",
      " uppajjantī’’ti vatvā dhammaṃ desento imā gāthā abhāsi –"
    ],
    "innerText": "Imaṃ mahiḷāmukhajātakaṃ vitthāretvā, ‘‘bhikkhave, bhikkhunā nāma sakalābheneva santuṭṭhena bhavitabbaṃ, paralābhaṃ patthetuṃ na vaṭṭati. Paralābhaṃ patthentassa hi jhānavipassanāmaggaphalesu ekadhammopi nuppajjati, sakalābhasantuṭṭhasseva pana jhānādīni uppajjantī’’ti vatvā dhammaṃ desento imā gāthā abhāsi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "365"
      },
      "."
    ],
    "innerText": "365."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Salābhaṃ nātimaññeyya, nāññesaṃ pihayaṃ care;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Aññesaṃ pihayaṃ bhikkhu, samādhiṃ nādhigacchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "366"
      },
      "."
    ],
    "innerText": "366."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " ‘‘Appalābhopi ",
      " ce bhikkhu, salābhaṃ nātimaññati;"
    ],
    "innerText": "‘‘Appalābhopi ce bhikkhu, salābhaṃ nātimaññati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Taṃ ve devā pasaṃsanti, suddhājīviṃ atandita’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "salābha"
      },
      "nti attano uppajjanakalābhaṃ. Sapadānacārañhi parivajjetvā anesanāya jīvikaṃ ",
      " kappento salābhaṃ atimaññati hīḷeti jigucchati nāma. Tasmā evaṃ akaraṇena salābhaṃ nātimaññeyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aññesaṃ pihaya"
      },
      "nti aññesaṃ lābhaṃ patthento na careyyāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samādhiṃ nādhigacchatī"
      },
      "ti aññesañhi lābhaṃ pihayanto tesaṃ cīvarādikaraṇe ussukkaṃ āpanno bhikkhu appanāsamādhiṃ vā upacārasamādhiṃ vā nādhigacchati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Salābhaṃ nātimaññatī"
      },
      "ti appalābhopi samāno uccanīcakule paṭipāṭiyā sapadānaṃ caranto bhikkhu salābhaṃ nātimaññati nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃ ve"
      },
      "ti taṃ evarūpaṃ bhikkhuṃ sārajīvitatāya suddhājīviṃ jaṅghabalaṃ nissāya jīvitakappanena akusītatāya atanditaṃ devā pasaṃsanti thomentīti attho."
    ],
    "innerText": "Tattha salābhanti attano uppajjanakalābhaṃ. Sapadānacārañhi parivajjetvā anesanāya jīvikaṃ kappento salābhaṃ atimaññati hīḷeti jigucchati nāma. Tasmā evaṃ akaraṇena salābhaṃ nātimaññeyya. Aññesaṃ pihayanti aññesaṃ lābhaṃ patthento na careyyāti attho. Samādhiṃ nādhigacchatīti aññesañhi lābhaṃ pihayanto tesaṃ cīvarādikaraṇe ussukkaṃ āpanno bhikkhu appanāsamādhiṃ vā upacārasamādhiṃ vā nādhigacchati. Salābhaṃ nātimaññatīti appalābhopi samāno uccanīcakule paṭipāṭiyā sapadānaṃ caranto bhikkhu salābhaṃ nātimaññati nāma. Taṃ veti taṃ evarūpaṃ bhikkhuṃ sārajīvitatāya suddhājīviṃ jaṅghabalaṃ nissāya jīvitakappanena akusītatāya atanditaṃ devā pasaṃsanti thomentīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Desanāvasāne bahū sotāpattiphalādīni pāpuṇiṃsūti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vipakkhasevakabhikkhuvatthu pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Pañcaggadāyakabrāhmaṇavatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbaso"
      },
      "ti ",
      " imaṃ dhammadesanaṃ satthā jetavane viharanto pañcaggadāyakaṃ nāma brāhmaṇaṃ ārabbha kathesi."
    ],
    "innerText": "Sabbasoti imaṃ dhammadesanaṃ satthā jetavane viharanto pañcaggadāyakaṃ nāma brāhmaṇaṃ ārabbha kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "So kira sasse khette ṭhitakāleyeva khettaggaṃ nāma deti, khalakāle khalaggaṃ nāma deti, khalabhaṇḍakāle khalabhaṇḍaggaṃ nāma deti, ukkhalikakāle kumbhaggaṃ nāma deti, pātiyaṃ vaḍḍhitakāle pātaggaṃ nāma detīti imāni pañca aggadānāni deti, sampattassa adatvā nāma na bhuñjati. Tenassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pañcaggadāyako"
      },
      "tveva nāmaṃ ahosi. Satthā tassa ca brāhmaṇiyā cassa tiṇṇaṃ phalānaṃ upanissayaṃ disvā brāhmaṇassa bhojanavelāyaṃ gantvā dvāre aṭṭhāsi. Sopi dvārapamukhe antogehābhimukho nisīditvā bhuñjati, satthāraṃ dvāre ṭhitaṃ na passati. Brāhmaṇī pana taṃ parivisamānā satthāraṃ disvā cintesi – ‘‘ayaṃ brāhmaṇo pañcasu ",
      " ṭhānesu aggaṃ datvā bhuñjati, idāni ca samaṇo gotamo āgantvā dvāre ṭhito. Sace brāhmaṇo etaṃ disvā attano bhattaṃ haritvā dassati, punapāhaṃ pacituṃ na sakkhissāmī’’ti. Sā ‘‘evaṃ ayaṃ samaṇaṃ gotamaṃ na passissatī’’ti satthu piṭṭhiṃ datvā tassa pacchato taṃ paṭicchādentī onamitvā puṇṇacandaṃ pāṇinā paṭicchādentī viya aṭṭhāsi. Tathā ṭhitā eva ca pana ‘‘gato nu kho no’’ti satthāraṃ aḍḍhakkhikena olokesi. Satthā tattheva aṭṭhāsi. Brāhmaṇassa pana savanabhayena ‘‘aticchathā’’ti na vadeti, osakkitvā pana saṇikameva ‘‘aticchathā’’ti āha ",
      ". Satthā ‘‘na gamissāmī’’ti sīsaṃ ",
      " cālesi. Lokagarunā buddhena ‘‘na gamissāmī’’ti sīse cālite sā sandhāretuṃ asakkontī mahāhasitaṃ hasi. Tasmiṃ khaṇe satthā gehābhimukhaṃ obhāsaṃ muñci. Brāhmaṇopi piṭṭhiṃ datvā nisinnoyeva brāhmaṇiyā hasitasaddaṃ sutvā chabbaṇṇānañca rasmīnaṃ obhāsaṃ oloketvā satthāraṃ addasa. Buddhā hi nāma gāme vā araññe vā hetusampannānaṃ attānaṃ adassetvā na pakkamanti. Brāhmaṇopi satthāraṃ disvā, ‘‘bhoti nāsitomhi tayā, rājaputtaṃ āgantvā dvāre ṭhitaṃ mayhaṃ anācikkhantiyā bhāriyaṃ te kammaṃ kata’’nti vatvā aḍḍhabhuttaṃ bhojanapātiṃ ādāya satthu santikaṃ gantvā, ‘‘bho gotama, ahaṃ pañcasu ṭhānesu aggaṃ datvāva bhuñjāmi, ito ca me majjhe bhinditvā ekova bhattakoṭṭhāso bhutto, eko koṭṭhāso avasiṭṭho, paṭiggaṇhissasi me idaṃ bhatta’’nti. Satthā ‘‘na me tava ucchiṭṭhabhattena attho’’ti avatvā, ‘‘brāhmaṇa, aggampi mayhameva anucchavikaṃ, majjhe bhinditvā aḍḍhabhuttabhattampi, carimakabhattapiṇḍopi mayhameva anucchaviko. Mayañhi, brāhmaṇa, paradattūpajīvipetasadisā’’ti vatvā imaṃ gāthamāha –"
    ],
    "innerText": "So kira sasse khette ṭhitakāleyeva khettaggaṃ nāma deti, khalakāle khalaggaṃ nāma deti, khalabhaṇḍakāle khalabhaṇḍaggaṃ nāma deti, ukkhalikakāle kumbhaggaṃ nāma deti, pātiyaṃ vaḍḍhitakāle pātaggaṃ nāma detīti imāni pañca aggadānāni deti, sampattassa adatvā nāma na bhuñjati. Tenassa pañcaggadāyakotveva nāmaṃ ahosi. Satthā tassa ca brāhmaṇiyā cassa tiṇṇaṃ phalānaṃ upanissayaṃ disvā brāhmaṇassa bhojanavelāyaṃ gantvā dvāre aṭṭhāsi. Sopi dvārapamukhe antogehābhimukho nisīditvā bhuñjati, satthāraṃ dvāre ṭhitaṃ na passati. Brāhmaṇī pana taṃ parivisamānā satthāraṃ disvā cintesi – ‘‘ayaṃ brāhmaṇo pañcasu ṭhānesu aggaṃ datvā bhuñjati, idāni ca samaṇo gotamo āgantvā dvāre ṭhito. Sace brāhmaṇo etaṃ disvā attano bhattaṃ haritvā dassati, punapāhaṃ pacituṃ na sakkhissāmī’’ti. Sā ‘‘evaṃ ayaṃ samaṇaṃ gotamaṃ na passissatī’’ti satthu piṭṭhiṃ datvā tassa pacchato taṃ paṭicchādentī onamitvā puṇṇacandaṃ pāṇinā paṭicchādentī viya aṭṭhāsi. Tathā ṭhitā eva ca pana ‘‘gato nu kho no’’ti satthāraṃ aḍḍhakkhikena olokesi. Satthā tattheva aṭṭhāsi. Brāhmaṇassa pana savanabhayena ‘‘aticchathā’’ti na vadeti, osakkitvā pana saṇikameva ‘‘aticchathā’’ti āha . Satthā ‘‘na gamissāmī’’ti sīsaṃ cālesi. Lokagarunā buddhena ‘‘na gamissāmī’’ti sīse cālite sā sandhāretuṃ asakkontī mahāhasitaṃ hasi. Tasmiṃ khaṇe satthā gehābhimukhaṃ obhāsaṃ muñci. Brāhmaṇopi piṭṭhiṃ datvā nisinnoyeva brāhmaṇiyā hasitasaddaṃ sutvā chabbaṇṇānañca rasmīnaṃ obhāsaṃ oloketvā satthāraṃ addasa. Buddhā hi nāma gāme vā araññe vā hetusampannānaṃ attānaṃ adassetvā na pakkamanti. Brāhmaṇopi satthāraṃ disvā, ‘‘bhoti nāsitomhi tayā, rājaputtaṃ āgantvā dvāre ṭhitaṃ mayhaṃ anācikkhantiyā bhāriyaṃ te kammaṃ kata’’nti vatvā aḍḍhabhuttaṃ bhojanapātiṃ ādāya satthu santikaṃ gantvā, ‘‘bho gotama, ahaṃ pañcasu ṭhānesu aggaṃ datvāva bhuñjāmi, ito ca me majjhe bhinditvā ekova bhattakoṭṭhāso bhutto, eko koṭṭhāso avasiṭṭho, paṭiggaṇhissasi me idaṃ bhatta’’nti. Satthā ‘‘na me tava ucchiṭṭhabhattena attho’’ti avatvā, ‘‘brāhmaṇa, aggampi mayhameva anucchavikaṃ, majjhe bhinditvā aḍḍhabhuttabhattampi, carimakabhattapiṇḍopi mayhameva anucchaviko. Mayañhi, brāhmaṇa, paradattūpajīvipetasadisā’’ti vatvā imaṃ gāthamāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yadaggato majjhato sesato vā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Piṇḍaṃ labhetha paradattūpajīvī;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Nālaṃ thutuṃ nopi nipaccavādī,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Taṃ vāpi dhīrā muni vedayantī’’ti. (su. ni. 219);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Brāhmaṇo ",
      " taṃ sutvāva pasannacitto hutvā ‘‘aho acchariyaṃ, dīpasāmiko nāma rājaputto ‘na me tava ucchiṭṭhabhattena attho’ti avatvā evaṃ vakkhatī’’ti dvāre ṭhitakova satthāraṃ pañhaṃ pucchi – ‘‘bho gotama ",
      ", tumhe attano sāvake bhikkhūti vadatha, kittāvatā bhikkhu nāma hotī’’ti. Satthā ‘‘kathaṃrūpā nu kho imassa dhammadesanā sappāyā’’ti upadhārento ‘‘ime dvepi janā kassapabuddhakāle ‘nāmarūpa’nti vadantānaṃ kathaṃ suṇiṃsu, nāmarūpaṃ avissajjitvāva nesaṃ dhammaṃ desetuṃ vaṭṭatī’’ti, ‘‘brāhmaṇa, nāme ca rūpe ca arajjanto asajjanto asocanto bhikkhu nāma hotī’’ti vatvā imaṃ gāthamāha –"
    ],
    "innerText": "Brāhmaṇo taṃ sutvāva pasannacitto hutvā ‘‘aho acchariyaṃ, dīpasāmiko nāma rājaputto ‘na me tava ucchiṭṭhabhattena attho’ti avatvā evaṃ vakkhatī’’ti dvāre ṭhitakova satthāraṃ pañhaṃ pucchi – ‘‘bho gotama , tumhe attano sāvake bhikkhūti vadatha, kittāvatā bhikkhu nāma hotī’’ti. Satthā ‘‘kathaṃrūpā nu kho imassa dhammadesanā sappāyā’’ti upadhārento ‘‘ime dvepi janā kassapabuddhakāle ‘nāmarūpa’nti vadantānaṃ kathaṃ suṇiṃsu, nāmarūpaṃ avissajjitvāva nesaṃ dhammaṃ desetuṃ vaṭṭatī’’ti, ‘‘brāhmaṇa, nāme ca rūpe ca arajjanto asajjanto asocanto bhikkhu nāma hotī’’ti vatvā imaṃ gāthamāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "367"
      },
      "."
    ],
    "innerText": "367."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sabbaso nāmarūpasmiṃ, yassa natthi mamāyitaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Asatā ca na socati, sa ve bhikkhūti vuccatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sabbaso"
      },
      "ti sabbasmimpi vedanādīnaṃ catunnaṃ, rūpakkhandhassa cāti pañcannaṃ khandhānaṃ vasena ",
      " pavatte nāmarūpe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mamāyita"
      },
      "nti yassa ahanti vā mamanti vā gāho natthi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asatā ca na socatī"
      },
      "ti tasmiñca nāmarūpe khayavayaṃ patte ‘‘mama rūpaṃ khīṇaṃ…pe… mama viññāṇaṃ khīṇa’’nti na socati na vihaññati, ‘‘khayavayadhammaṃ me khīṇa’’nti passati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sa ve"
      },
      "ti so evarūpo vijjamānepi nāmarūpe mamāyitarahitopi asatāpi tena asocanto bhikkhūti vuccatīti attho."
    ],
    "innerText": "Tattha sabbasoti sabbasmimpi vedanādīnaṃ catunnaṃ, rūpakkhandhassa cāti pañcannaṃ khandhānaṃ vasena pavatte nāmarūpe. Mamāyitanti yassa ahanti vā mamanti vā gāho natthi. Asatā ca na socatīti tasmiñca nāmarūpe khayavayaṃ patte ‘‘mama rūpaṃ khīṇaṃ…pe… mama viññāṇaṃ khīṇa’’nti na socati na vihaññati, ‘‘khayavayadhammaṃ me khīṇa’’nti passati. Sa veti so evarūpo vijjamānepi nāmarūpe mamāyitarahitopi asatāpi tena asocanto bhikkhūti vuccatīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Desanāvasāne ",
      " ubhopi jayampatikā anāgāmiphale patiṭṭhahiṃsu, sampattānampi sātthikā dhammadesanā ahosīti."
    ],
    "innerText": "Desanāvasāne ubhopi jayampatikā anāgāmiphale patiṭṭhahiṃsu, sampattānampi sātthikā dhammadesanā ahosīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pañcaggadāyakabrāhmaṇavatthu chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Sambahulabhikkhuvatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mettāvihārī"
      },
      "ti imaṃ dhammadesanaṃ satthā jetavane viharanto sambahule bhikkhū ārabbha kathesi."
    ],
    "innerText": "Mettāvihārīti imaṃ dhammadesanaṃ satthā jetavane viharanto sambahule bhikkhū ārabbha kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ekasmiñhi samaye āyasmante mahākaccāne avantijanapade kuraragharaṃ nissāya pavattapabbate viharante soṇo nāma koṭikaṇṇo upāsako therassa dhammakathāya pasīditvā therassa santike pabbajitukāmo ",
      " therena ‘‘dukkaraṃ kho, soṇa, yāvajīvaṃ ekabhattaṃ ekaseyyaṃ brahmacariya’’nti vatvā dve vāre paṭikkhittopi pabbajjāya ativiya ussāhajāto tatiyavāre theraṃ yācitvā pabbajitvā appabhikkhukattā dakkhiṇāpathe tiṇṇaṃ vassānaṃ accayena laddhūpasampado satthāraṃ sammukhā daṭṭhukāmo hutvā upajjhāyaṃ āpucchitvā tena dinnaṃ sāsanaṃ gahetvā anupubbena jetavanaṃ gantvā satthāraṃ vanditvā katapaṭisanthāro satthārā ekagandhakuṭiyaṃyeva anuññātasenāsano bahudeva rattiṃ ajjhokāse vīthināmetvā rattibhāge gandhakuṭiṃ pavisitvā attano pattasenāsane taṃ rattibhāgaṃ vītināmetvā paccūsasamaye satthārā ajjhiṭṭho soḷasa aṭṭhakavaggikāni ",
      " (su. ni. 772 ādayo) sabbāneva sarabhaññena abhaṇi. Athassa bhagavā sarabhaññapariyosāne abbhānumodento – ‘‘sādhu sādhu, bhikkhū’’ti sādhukāraṃ adāsi. Satthārā dinnasādhukāraṃ sutvā bhūmaṭṭhakadevā nāgā supaṇṇāti evaṃ yāva brahmalokā ekasādhukārameva ahosi."
    ],
    "innerText": "Ekasmiñhi samaye āyasmante mahākaccāne avantijanapade kuraragharaṃ nissāya pavattapabbate viharante soṇo nāma koṭikaṇṇo upāsako therassa dhammakathāya pasīditvā therassa santike pabbajitukāmo therena ‘‘dukkaraṃ kho, soṇa, yāvajīvaṃ ekabhattaṃ ekaseyyaṃ brahmacariya’’nti vatvā dve vāre paṭikkhittopi pabbajjāya ativiya ussāhajāto tatiyavāre theraṃ yācitvā pabbajitvā appabhikkhukattā dakkhiṇāpathe tiṇṇaṃ vassānaṃ accayena laddhūpasampado satthāraṃ sammukhā daṭṭhukāmo hutvā upajjhāyaṃ āpucchitvā tena dinnaṃ sāsanaṃ gahetvā anupubbena jetavanaṃ gantvā satthāraṃ vanditvā katapaṭisanthāro satthārā ekagandhakuṭiyaṃyeva anuññātasenāsano bahudeva rattiṃ ajjhokāse vīthināmetvā rattibhāge gandhakuṭiṃ pavisitvā attano pattasenāsane taṃ rattibhāgaṃ vītināmetvā paccūsasamaye satthārā ajjhiṭṭho soḷasa aṭṭhakavaggikāni (su. ni. 772 ādayo) sabbāneva sarabhaññena abhaṇi. Athassa bhagavā sarabhaññapariyosāne abbhānumodento – ‘‘sādhu sādhu, bhikkhū’’ti sādhukāraṃ adāsi. Satthārā dinnasādhukāraṃ sutvā bhūmaṭṭhakadevā nāgā supaṇṇāti evaṃ yāva brahmalokā ekasādhukārameva ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tasmiṃ ",
      " khaṇe jetavanato vīsayojanasatamatthake kuraragharanagare therassa mātu mahāupāsikāya gehe adhivatthā devatāpi mahantena saddena sādhukāramadāsi. Atha naṃ upāsikā āha – ‘‘ko esa sādhukāraṃ detī’’ti? Ahaṃ, bhaginīti. Kosi tvanti? Tava gehe adhivatthā, devatāti. Tvaṃ ito pubbe mayhaṃ sādhukāraṃ adatvā ajja kasmā desīti? Nāhaṃ tuyhaṃ sādhukāraṃ dammīti. Atha kassa te sādhukāro dinnoti? Tava puttassa koṭikaṇṇassa soṇattherassāti. Kiṃ me puttena katanti? Putto te ajja satthārā saddhiṃ ekagandhakuṭiyaṃ vasitvā dhammaṃ desesi, satthā tava puttassa dhammaṃ sutvā pasanno sādhukāramadāsi. Tenassa mayāpi sādhukāro dinno. Sammāsambuddhassa hi sādhukāraṃ sampaṭicchitvā bhūmaṭṭhakadeve ādiṃ katvā yāva brahmalokā ekasādhukārameva jātanti. Kiṃ pana, sāmi, mama puttena satthu dhammo kathito, satthārā mama puttassa kathitoti? Tava puttena satthu kathitoti. Evaṃ devatāya kathentiyāva upāsikāya pañcavaṇṇā pīti uppajjitvā sakalasarīraṃ phari."
    ],
    "innerText": "Tasmiṃ khaṇe jetavanato vīsayojanasatamatthake kuraragharanagare therassa mātu mahāupāsikāya gehe adhivatthā devatāpi mahantena saddena sādhukāramadāsi. Atha naṃ upāsikā āha – ‘‘ko esa sādhukāraṃ detī’’ti? Ahaṃ, bhaginīti. Kosi tvanti? Tava gehe adhivatthā, devatāti. Tvaṃ ito pubbe mayhaṃ sādhukāraṃ adatvā ajja kasmā desīti? Nāhaṃ tuyhaṃ sādhukāraṃ dammīti. Atha kassa te sādhukāro dinnoti? Tava puttassa koṭikaṇṇassa soṇattherassāti. Kiṃ me puttena katanti? Putto te ajja satthārā saddhiṃ ekagandhakuṭiyaṃ vasitvā dhammaṃ desesi, satthā tava puttassa dhammaṃ sutvā pasanno sādhukāramadāsi. Tenassa mayāpi sādhukāro dinno. Sammāsambuddhassa hi sādhukāraṃ sampaṭicchitvā bhūmaṭṭhakadeve ādiṃ katvā yāva brahmalokā ekasādhukārameva jātanti. Kiṃ pana, sāmi, mama puttena satthu dhammo kathito, satthārā mama puttassa kathitoti? Tava puttena satthu kathitoti. Evaṃ devatāya kathentiyāva upāsikāya pañcavaṇṇā pīti uppajjitvā sakalasarīraṃ phari."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Athassā etadahosi – ‘‘sace me putto satthārā saddhiṃ ekagandhakuṭiyaṃ vasitvā satthu dhammaṃ kathetuṃ sakkhi ",
      ", mayhampi kathetuṃ sakkhissatiyeva ",
      ". Puttassa āgatakāle dhammassavanaṃ kāretvā dhammakathaṃ suṇissāmī’’ti. Soṇattheropi kho satthārā sādhukāre dinne ‘‘ayaṃ me upajjhāyena dinnasāsanaṃ ārocetuṃ kālo’’ti bhagavantaṃ paccantimesu janapadesu vinayadharapañcamena gaṇena upasampadaṃ ādiṃ katvā (mahāva. 259) pañca vare yācitvā katipāhaṃ satthu santikeyeva vasitvā ‘‘upajjhāyaṃ passissāmī’’ti satthāraṃ āpucchitvā jetavanā nikkhamitvā anupubbena upajjhāyassa santikaṃ agamāsi."
    ],
    "innerText": "Athassā etadahosi – ‘‘sace me putto satthārā saddhiṃ ekagandhakuṭiyaṃ vasitvā satthu dhammaṃ kathetuṃ sakkhi , mayhampi kathetuṃ sakkhissatiyeva . Puttassa āgatakāle dhammassavanaṃ kāretvā dhammakathaṃ suṇissāmī’’ti. Soṇattheropi kho satthārā sādhukāre dinne ‘‘ayaṃ me upajjhāyena dinnasāsanaṃ ārocetuṃ kālo’’ti bhagavantaṃ paccantimesu janapadesu vinayadharapañcamena gaṇena upasampadaṃ ādiṃ katvā (mahāva. 259) pañca vare yācitvā katipāhaṃ satthu santikeyeva vasitvā ‘‘upajjhāyaṃ passissāmī’’ti satthāraṃ āpucchitvā jetavanā nikkhamitvā anupubbena upajjhāyassa santikaṃ agamāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Thero punadivase taṃ ādāya piṇḍāya caranto mātu upāsikāya gehadvāraṃ agamāsi. Sāpi puttaṃ disvā tuṭṭhamānasā vanditvā sakkaccaṃ parivisitvā pucchi – ‘‘saccaṃ kira tvaṃ, tāta, satthārā saddhiṃ ekagandhakuṭiyaṃ vasitvā satthu dhammakathaṃ kathesī’’ti. ‘‘Upāsike, tuyhaṃ kena idaṃ kathita’’nti? ‘‘Tāta, imasmiṃ gehe adhivatthā devatā mahantena saddena sādhukāraṃ datvā mayā ‘ko eso’ti vutte ‘aha’nti vatvā evañca evañca kathesi. Taṃ sutvā mayhaṃ etadahosi – ‘sace me putto satthu dhammakathaṃ kathesi, mayhampi kathetuṃ sakkhissatī’ti. Atha naṃ āha – ‘tāta, yato tayā satthu sammukhā dhammo kathito, mayhampi kathetuṃ sakkhissasi eva. Asukadivase nāma dhammassavanaṃ kāretvā tava dhammaṃ suṇissāmi, tātā’’’ti. So adhivāsesi. Upāsikā bhikkhusaṅghassa dānaṃ datvā pūjaṃ katvā ‘‘puttassa me dhammakathaṃ suṇissāmī’’ti ekameva dāsiṃ geharakkhikaṃ ṭhapetvā ",
      " sabbaṃ parijanaṃ ādāya antonagare dhammassavanatthāya ",
      " kārite maṇḍape alaṅkatadhammāsanaṃ abhiruyha dhammaṃ desentassa puttassa dhammakathaṃ sotuṃ agamāsi."
    ],
    "innerText": "Thero punadivase taṃ ādāya piṇḍāya caranto mātu upāsikāya gehadvāraṃ agamāsi. Sāpi puttaṃ disvā tuṭṭhamānasā vanditvā sakkaccaṃ parivisitvā pucchi – ‘‘saccaṃ kira tvaṃ, tāta, satthārā saddhiṃ ekagandhakuṭiyaṃ vasitvā satthu dhammakathaṃ kathesī’’ti. ‘‘Upāsike, tuyhaṃ kena idaṃ kathita’’nti? ‘‘Tāta, imasmiṃ gehe adhivatthā devatā mahantena saddena sādhukāraṃ datvā mayā ‘ko eso’ti vutte ‘aha’nti vatvā evañca evañca kathesi. Taṃ sutvā mayhaṃ etadahosi – ‘sace me putto satthu dhammakathaṃ kathesi, mayhampi kathetuṃ sakkhissatī’ti. Atha naṃ āha – ‘tāta, yato tayā satthu sammukhā dhammo kathito, mayhampi kathetuṃ sakkhissasi eva. Asukadivase nāma dhammassavanaṃ kāretvā tava dhammaṃ suṇissāmi, tātā’’’ti. So adhivāsesi. Upāsikā bhikkhusaṅghassa dānaṃ datvā pūjaṃ katvā ‘‘puttassa me dhammakathaṃ suṇissāmī’’ti ekameva dāsiṃ geharakkhikaṃ ṭhapetvā sabbaṃ parijanaṃ ādāya antonagare dhammassavanatthāya kārite maṇḍape alaṅkatadhammāsanaṃ abhiruyha dhammaṃ desentassa puttassa dhammakathaṃ sotuṃ agamāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tasmiṃ pana kāle navasatā corā tassā upāsikāya gehe otāraṃ olokentā vicaranti. Tassā pana gehaṃ sattahi pākārehi parikkhittaṃ sattadvārakoṭṭhakayuttaṃ, tattha tesu tesu ṭhānesu caṇḍasunakhe bandhitvā ṭhapayiṃsu. Antogehe chadanassa udakapātaṭṭhāne pana parikhaṃ khaṇitvā tipunā pūrayiṃsu. Taṃ divā ātapena vilīnaṃ pakkuthitaṃ viya tiṭṭhati, rattiṃ kaṭhinaṃ kakkhaḷaṃ hutvā tiṭṭhati. Tassānantarā mahantāni ayasaṅghāṭakāni nirantaraṃ bhūmiyaṃ odahiṃsu. Iti imañcārakkhaṃ upāsikāya ca antogehe ṭhitabhāvaṃ paṭicca te corā okāsaṃ alabhantā taṃ divasaṃ tassā gatabhāvaṃ ñatvā umaṅgaṃ bhinditvā tipuparikhāya ",
      " ca ayasaṅghāṭakānañca heṭṭhābhāgeneva gehaṃ pavisitvā corajeṭṭhakaṃ tassā santikaṃ pahiṇiṃsu ‘‘sace sā amhākaṃ idha paviṭṭhabhāvaṃ sutvā nivattitvā gehābhimukhī āgacchati, asinā naṃ paharitvā mārethā’’ti. So gantvā tassā santike aṭṭhāsi."
    ],
    "innerText": "Tasmiṃ pana kāle navasatā corā tassā upāsikāya gehe otāraṃ olokentā vicaranti. Tassā pana gehaṃ sattahi pākārehi parikkhittaṃ sattadvārakoṭṭhakayuttaṃ, tattha tesu tesu ṭhānesu caṇḍasunakhe bandhitvā ṭhapayiṃsu. Antogehe chadanassa udakapātaṭṭhāne pana parikhaṃ khaṇitvā tipunā pūrayiṃsu. Taṃ divā ātapena vilīnaṃ pakkuthitaṃ viya tiṭṭhati, rattiṃ kaṭhinaṃ kakkhaḷaṃ hutvā tiṭṭhati. Tassānantarā mahantāni ayasaṅghāṭakāni nirantaraṃ bhūmiyaṃ odahiṃsu. Iti imañcārakkhaṃ upāsikāya ca antogehe ṭhitabhāvaṃ paṭicca te corā okāsaṃ alabhantā taṃ divasaṃ tassā gatabhāvaṃ ñatvā umaṅgaṃ bhinditvā tipuparikhāya ca ayasaṅghāṭakānañca heṭṭhābhāgeneva gehaṃ pavisitvā corajeṭṭhakaṃ tassā santikaṃ pahiṇiṃsu ‘‘sace sā amhākaṃ idha paviṭṭhabhāvaṃ sutvā nivattitvā gehābhimukhī āgacchati, asinā naṃ paharitvā mārethā’’ti. So gantvā tassā santike aṭṭhāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Corāpi antogehe dīpaṃ jāletvā kahāpaṇagabbhadvāraṃ vivariṃsu. Sā dāsī core disvā upāsikāya santikaṃ gantvā, ‘‘ayye, bahū corā gehaṃ pavisitvā kahāpaṇagabbhadvāraṃ vivariṃsū’’ti ārocesi. ‘‘Corā attanā diṭṭhakahāpaṇe harantu, ahaṃ mama puttassa dhammakathaṃ suṇāmi, mā me dhammassa antarāyaṃ kari, gehaṃ gacchā’’ti taṃ pahiṇi. Corāpi kahāpaṇagabbhaṃ tucchaṃ katvā ",
      " rajatagabbhaṃ vivariṃsu. Sā punapi gantvā tamatthaṃ ārocesi. Upāsikāpi ‘‘corā attanā icchitaṃ harantu, mā me antarāyaṃ karī’’ti puna taṃ pahiṇi. Corā rajatagabbhampi tucchaṃ katvā suvaṇṇagabbhaṃ vivariṃsu. Sā punapi gantvā upāsikāya tamatthaṃ ārocesi. Atha naṃ upāsikā āmantetvā, ‘‘bhoti je tvaṃ anekavāraṃ mama santikaṃ āgatā, ‘corā yathārucitaṃ harantu, ahaṃ mama puttassa dhammakathaṃ suṇāmi, mā me antarāyaṃ karī’ti mayā vuttāpi mama kathaṃ anādiyitvā punappunaṃ āgacchasiyeva. Sace idāni tvaṃ āgacchissasi, jānissāmi te kattabbaṃ, gehameva gacchā’’ti pahiṇi."
    ],
    "innerText": "Corāpi antogehe dīpaṃ jāletvā kahāpaṇagabbhadvāraṃ vivariṃsu. Sā dāsī core disvā upāsikāya santikaṃ gantvā, ‘‘ayye, bahū corā gehaṃ pavisitvā kahāpaṇagabbhadvāraṃ vivariṃsū’’ti ārocesi. ‘‘Corā attanā diṭṭhakahāpaṇe harantu, ahaṃ mama puttassa dhammakathaṃ suṇāmi, mā me dhammassa antarāyaṃ kari, gehaṃ gacchā’’ti taṃ pahiṇi. Corāpi kahāpaṇagabbhaṃ tucchaṃ katvā rajatagabbhaṃ vivariṃsu. Sā punapi gantvā tamatthaṃ ārocesi. Upāsikāpi ‘‘corā attanā icchitaṃ harantu, mā me antarāyaṃ karī’’ti puna taṃ pahiṇi. Corā rajatagabbhampi tucchaṃ katvā suvaṇṇagabbhaṃ vivariṃsu. Sā punapi gantvā upāsikāya tamatthaṃ ārocesi. Atha naṃ upāsikā āmantetvā, ‘‘bhoti je tvaṃ anekavāraṃ mama santikaṃ āgatā, ‘corā yathārucitaṃ harantu, ahaṃ mama puttassa dhammakathaṃ suṇāmi, mā me antarāyaṃ karī’ti mayā vuttāpi mama kathaṃ anādiyitvā punappunaṃ āgacchasiyeva. Sace idāni tvaṃ āgacchissasi, jānissāmi te kattabbaṃ, gehameva gacchā’’ti pahiṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Corajeṭṭhako tassā kathaṃ sutvā ‘‘evarūpāya itthiyā santakaṃ harantānaṃ asani patitvā matthakaṃ bhindeyyā’’ti corānaṃ santikaṃ gantvā ‘‘sīghaṃ upāsikāya santakaṃ paṭipākatikaṃ karothā’’ti āha. Te kahāpaṇehi kahāpaṇagabbhaṃ, rajatasuvaṇṇehi rajatasuvaṇṇagabbhe puna pūrayiṃsu. Dhammatā kiresā, yaṃ dhammo dhammacārinaṃ rakkhati. Tenevāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Dhammo ",
      " have rakkhati dhammacāriṃ,"
    ],
    "innerText": "‘‘Dhammo have rakkhati dhammacāriṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Dhammo suciṇṇo sukhamāvahāti;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Esānisaṃso dhamme suciṇṇe,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Na duggatiṃ gacchati dhammacārī’’ti. (theragā. 303; jā. 1.10.102);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Corāpi gantvā dhammassavanaṭṭhāne aṭṭhaṃsu. Theropi dhammaṃ kathetvā vibhātāya rattiyā āsanā otari. Tasmiṃ khaṇe corajeṭṭhako upāsikāya ",
      " pādamūle nipajjitvā ‘‘khamāhi me, ayye’’ti āha. ‘‘Kiṃ idaṃ, tātā’’ti? ‘‘Ahañhi tumhesu ",
      " āghātaṃ katvā tumhe māretukāmo aṭṭhāsi’’nti. ‘‘Tena hi te, tāta, khamāmī’’ti. Sesacorāpi tatheva vatvā, ‘‘tātā, khamāmī’’ti vutte āhaṃsu – ‘‘ayye, sace no khamatha, puttassa vo santike amhākaṃ pabbajjaṃ dāpethā’’ti. Sā puttaṃ vanditvā āha – ‘‘tāta, ime corā mama guṇesu tumhākañca dhammakathāya pasannā pabbajjaṃ yācanti, pabbājetha ne’’ti. Thero ‘‘sādhū’’ti vatvā tehi nivatthavatthānaṃ dasāni chindāpetvā tambamattikāya rajāpetvā te pabbājetvā sīlesu patiṭṭhāpesi. Upasampannakāle ca nesaṃ ekekassa visuṃ visuṃ kammaṭṭhānamadāsi. Te navasatā bhikkhū visuṃ visuṃ navasatakammaṭṭhānāni gahetvā ekaṃ pabbataṃ abhiruyha tassa tassa rukkhassa chāyāya nisīditvā samaṇadhammaṃ kariṃsu."
    ],
    "innerText": "Corāpi gantvā dhammassavanaṭṭhāne aṭṭhaṃsu. Theropi dhammaṃ kathetvā vibhātāya rattiyā āsanā otari. Tasmiṃ khaṇe corajeṭṭhako upāsikāya pādamūle nipajjitvā ‘‘khamāhi me, ayye’’ti āha. ‘‘Kiṃ idaṃ, tātā’’ti? ‘‘Ahañhi tumhesu āghātaṃ katvā tumhe māretukāmo aṭṭhāsi’’nti. ‘‘Tena hi te, tāta, khamāmī’’ti. Sesacorāpi tatheva vatvā, ‘‘tātā, khamāmī’’ti vutte āhaṃsu – ‘‘ayye, sace no khamatha, puttassa vo santike amhākaṃ pabbajjaṃ dāpethā’’ti. Sā puttaṃ vanditvā āha – ‘‘tāta, ime corā mama guṇesu tumhākañca dhammakathāya pasannā pabbajjaṃ yācanti, pabbājetha ne’’ti. Thero ‘‘sādhū’’ti vatvā tehi nivatthavatthānaṃ dasāni chindāpetvā tambamattikāya rajāpetvā te pabbājetvā sīlesu patiṭṭhāpesi. Upasampannakāle ca nesaṃ ekekassa visuṃ visuṃ kammaṭṭhānamadāsi. Te navasatā bhikkhū visuṃ visuṃ navasatakammaṭṭhānāni gahetvā ekaṃ pabbataṃ abhiruyha tassa tassa rukkhassa chāyāya nisīditvā samaṇadhammaṃ kariṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Satthā vīsayojanasatamatthake jetavanamahāvihāre nisinnova te bhikkhū oloketvā tesaṃ cariyavasena dhammadesanaṃ vavatthāpetvā obhāsaṃ pharitvā sammukhe nisīditvā kathento viya imā gāthā abhāsi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "368"
      },
      "."
    ],
    "innerText": "368."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Mettāvihārī yo bhikkhu, pasanno buddhasāsane;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Adhigacche padaṃ santaṃ, saṅkhārūpasamaṃ sukhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "369"
      },
      "."
    ],
    "innerText": "369."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Siñca bhikkhu imaṃ nāvaṃ, sittā te lahumessati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Chetvā rāgañca dosañca, tato nibbānamehisi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "370"
      },
      "."
    ],
    "innerText": "370."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Pañca chinde pañca jahe, pañca cuttari bhāvaye;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pañcasaṅgātigo bhikkhu, oghatiṇṇoti vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "371"
      },
      "."
    ],
    "innerText": "371."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " ‘‘Jhāya ",
      " bhikkhu mā pamādo,"
    ],
    "innerText": "‘‘Jhāya bhikkhu mā pamādo,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Mā te kāmaguṇe ramessu cittaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Mā lohaguḷaṃ gilī pamatto,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Mā kandī dukkhamidanti dayhamāno."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "372"
      },
      "."
    ],
    "innerText": "372."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " ‘‘Natthi ",
      " jhānaṃ apaññassa, paññā natthi ajhāyato;"
    ],
    "innerText": "‘‘Natthi jhānaṃ apaññassa, paññā natthi ajhāyato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yamhi jhānañca paññā ca, sa ve nibbānasantike."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "373"
      },
      "."
    ],
    "innerText": "373."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Suññāgāraṃ paviṭṭhassa, santacittassa bhikkhuno;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Amānusī ratī hoti, sammā dhammaṃ vipassato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "374"
      },
      "."
    ],
    "innerText": "374."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yato yato sammasati, khandhānaṃ udayabbayaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Labhatī pītipāmojjaṃ, amataṃ taṃ vijānataṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "375"
      },
      "."
    ],
    "innerText": "375."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tatrāyamādi bhavati, idha paññassa bhikkhuno;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Indriyagutti santuṭṭhi, pātimokkhe ca saṃvaro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "376"
      },
      "."
    ],
    "innerText": "376."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Mitte bhajassu kalyāṇe, suddhājīve atandite;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Paṭisanthāravutyassa, ācārakusalo siyā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tato pāmojjabahulo, dukkhassantaṃ karissatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mettāvihārī"
      },
      "ti mettākammaṭṭhāne kammaṃ karontopi mettāvasena tikacatukkajjhāne nibbattetvā ṭhitopi mettāvihārīyeva nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pasanno"
      },
      "ti yo pana buddhasāsane pasanno hoti, pasādaṃ rocetiyevāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Padaṃ santa"
      },
      "nti nibbānassetaṃ nāmaṃ. Evarūpo hi bhikkhu santaṃ koṭṭhāsaṃ sabbasaṅkhārānaṃ upasantatāya saṅkhārūpasamaṃ, paramasukhatāya sukhanti laddhanāmaṃ nibbānaṃ adhigacchati, vindatiyevāti attho."
    ],
    "innerText": "Tattha mettāvihārīti mettākammaṭṭhāne kammaṃ karontopi mettāvasena tikacatukkajjhāne nibbattetvā ṭhitopi mettāvihārīyeva nāma. Pasannoti yo pana buddhasāsane pasanno hoti, pasādaṃ rocetiyevāti attho. Padaṃ santanti nibbānassetaṃ nāmaṃ. Evarūpo hi bhikkhu santaṃ koṭṭhāsaṃ sabbasaṅkhārānaṃ upasantatāya saṅkhārūpasamaṃ, paramasukhatāya sukhanti laddhanāmaṃ nibbānaṃ adhigacchati, vindatiyevāti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Siñca bhikkhu imaṃ nāva"
      },
      "nti bhikkhu imaṃ attabhāvasaṅkhātaṃ nāvaṃ micchāvitakkodakaṃ chaḍḍento siñca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sittā te lahumessatī"
      },
      "ti yathā hi mahāsamudde udakasseva bharitā nāvā chiddāni ",
      " pidahitvā udakassa sittatāya sittā sallahukā hutvā mahāsamudde anosīditvā sīghaṃ supaṭṭanaṃ gacchati, evaṃ tavāpi ayaṃ micchāvitakkodakabharitā attabhāvanāvā cakkhudvārādichiddāni saṃvarena pidahitvā uppannassa micchāvitakkodakassa sittatāya sittā sallahukā saṃsāravaṭṭe anosīditvā sīghaṃ nibbānaṃ gamissati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Chetvā"
      },
      "ti rāgadosabandhanāni chinda. Etāni hi chinditvā arahattappatto tato aparabhāge anupādisesanibbānameva ehisi, gamissasīti attho."
    ],
    "innerText": "Siñca bhikkhu imaṃ nāvanti bhikkhu imaṃ attabhāvasaṅkhātaṃ nāvaṃ micchāvitakkodakaṃ chaḍḍento siñca. Sittā te lahumessatīti yathā hi mahāsamudde udakasseva bharitā nāvā chiddāni pidahitvā udakassa sittatāya sittā sallahukā hutvā mahāsamudde anosīditvā sīghaṃ supaṭṭanaṃ gacchati, evaṃ tavāpi ayaṃ micchāvitakkodakabharitā attabhāvanāvā cakkhudvārādichiddāni saṃvarena pidahitvā uppannassa micchāvitakkodakassa sittatāya sittā sallahukā saṃsāravaṭṭe anosīditvā sīghaṃ nibbānaṃ gamissati. Chetvāti rāgadosabandhanāni chinda. Etāni hi chinditvā arahattappatto tato aparabhāge anupādisesanibbānameva ehisi, gamissasīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañca"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "chinde"
      },
      "ti ",
      " heṭṭhāapāyasampāpakāni pañcorambhāgiyasaṃyojanāni pāde baddharajjuṃ puriso satthena viya heṭṭhāmaggattayena chindeyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañca jahe"
      },
      "ti uparidevalokasampāpakāni pañcuddhambhāgiyasaṃyojanāni puriso gīvāya baddharajjukaṃ viya arahattamaggena jaheyya pajaheyya, chindeyyāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañca cuttari bhāvaye"
      },
      "ti uddhambhāgiyasaṃyojanānaṃ pahānatthāya saddhādīni pañcindriyāni uttari bhāveyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañcasaṅgātigo"
      },
      "ti evaṃ sante pañcannaṃ rāgadosamohamānadiṭṭhisaṅgānaṃ atikkamanena pañcasaṅgātigo bhikkhu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "oghatiṇṇoti vuccati,"
      },
      " cattāro oghe tiṇṇoyevāti vuccatīti attho."
    ],
    "innerText": "Pañcachindeti heṭṭhāapāyasampāpakāni pañcorambhāgiyasaṃyojanāni pāde baddharajjuṃ puriso satthena viya heṭṭhāmaggattayena chindeyya. Pañca jaheti uparidevalokasampāpakāni pañcuddhambhāgiyasaṃyojanāni puriso gīvāya baddharajjukaṃ viya arahattamaggena jaheyya pajaheyya, chindeyyāti attho. Pañca cuttari bhāvayeti uddhambhāgiyasaṃyojanānaṃ pahānatthāya saddhādīni pañcindriyāni uttari bhāveyya. Pañcasaṅgātigoti evaṃ sante pañcannaṃ rāgadosamohamānadiṭṭhisaṅgānaṃ atikkamanena pañcasaṅgātigo bhikkhu oghatiṇṇoti vuccati, cattāro oghe tiṇṇoyevāti vuccatīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jhāya bhikkhū"
      },
      "ti bhikkhu tvaṃ dvinnaṃ jhānānaṃ vasena jhāya ceva, kāyakammādīsu ca appamattavihāritāya mā pamajji. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ramessū"
      },
      "ti pañcavidhe ca kāmaguṇe te cittaṃ mā ramessu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mā lohaguḷa"
      },
      "nti sativossaggalakkhaṇena hi pamādena pamattā niraye tattaṃ lohaguḷaṃ gilanti, tena taṃ vadāmi ‘‘mā pamatto hutvā lohaguḷaṃ gili, mā niraye ḍayhamāno ‘dukkhamida’nti kandī’’ti attho."
    ],
    "innerText": "Jhāya bhikkhūti bhikkhu tvaṃ dvinnaṃ jhānānaṃ vasena jhāya ceva, kāyakammādīsu ca appamattavihāritāya mā pamajji. Ramessūti pañcavidhe ca kāmaguṇe te cittaṃ mā ramessu. Mā lohaguḷanti sativossaggalakkhaṇena hi pamādena pamattā niraye tattaṃ lohaguḷaṃ gilanti, tena taṃ vadāmi ‘‘mā pamatto hutvā lohaguḷaṃ gili, mā niraye ḍayhamāno ‘dukkhamida’nti kandī’’ti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Natthi jhāna"
      },
      "nti jhānuppādikāya vāyāmapaññāya apaññassa jhānaṃ nāma natthi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññā natthī"
      },
      "ti ",
      " ajhāyantassa ‘‘samāhito bhikkhu yathābhūtaṃ jānāti passatī’’ti vuttalakkhaṇā paññā natthi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yamhi jhānañca paññā cā"
      },
      "ti yamhi puggale idaṃ ubhayampi atthi, so nibbānassa santike ṭhitoyevāti attho."
    ],
    "innerText": "Natthi jhānanti jhānuppādikāya vāyāmapaññāya apaññassa jhānaṃ nāma natthi. Paññā natthīti ajhāyantassa ‘‘samāhito bhikkhu yathābhūtaṃ jānāti passatī’’ti vuttalakkhaṇā paññā natthi. Yamhi jhānañca paññā cāti yamhi puggale idaṃ ubhayampi atthi, so nibbānassa santike ṭhitoyevāti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suññāgāraṃ paviṭṭhassā"
      },
      "ti kismiñcideva vivittokāse kammaṭṭhānaṃ avijahitvā kammaṭṭhānamanasikārena nisinnassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Santacittassā"
      },
      "ti nibbutacittassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammā"
      },
      "ti hetunā kāraṇena dhammaṃ vipassantassa vipassanāsaṅkhātā amānusī rati aṭṭhasamāpattisaṅkhātā dibbāpi rati hoti uppajjatīti attho."
    ],
    "innerText": "Suññāgāraṃ paviṭṭhassāti kismiñcideva vivittokāse kammaṭṭhānaṃ avijahitvā kammaṭṭhānamanasikārena nisinnassa. Santacittassāti nibbutacittassa. Sammāti hetunā kāraṇena dhammaṃ vipassantassa vipassanāsaṅkhātā amānusī rati aṭṭhasamāpattisaṅkhātā dibbāpi rati hoti uppajjatīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yato"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yato sammasatī"
      },
      "ti aṭṭhatiṃsāya ārammaṇesu kammaṃ karonto yena yenākārena, purebhattādīsu vā kālesu yasmiṃ yasmiṃ attanā abhirucite kāle, abhirucite vā kammaṭṭhāne kammaṃ karonto sammasati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Udayabbaya"
      },
      "nti pañcannaṃ khandhānaṃ pañcavīsatiyā lakkhaṇehi udayaṃ ",
      ", pañcavīsatiyā eva ca lakkhaṇehi vayaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pītipāmojja"
      },
      "nti evaṃ khandhānaṃ udayabbayaṃ sammasanto dhammapītiṃ dhammapāmojjañca labhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Amata"
      },
      "nti taṃ sappaccaye nāmarūpe pākaṭe hutvā upaṭṭhahante uppannaṃ pītipāmojjaṃ amatanibbānasampāpakattā ",
      " vijānataṃ paṇḍitānaṃ amatamevāti attho."
    ],
    "innerText": "Yatoyato sammasatīti aṭṭhatiṃsāya ārammaṇesu kammaṃ karonto yena yenākārena, purebhattādīsu vā kālesu yasmiṃ yasmiṃ attanā abhirucite kāle, abhirucite vā kammaṭṭhāne kammaṃ karonto sammasati. Udayabbayanti pañcannaṃ khandhānaṃ pañcavīsatiyā lakkhaṇehi udayaṃ , pañcavīsatiyā eva ca lakkhaṇehi vayaṃ. Pītipāmojjanti evaṃ khandhānaṃ udayabbayaṃ sammasanto dhammapītiṃ dhammapāmojjañca labhati. Amatanti taṃ sappaccaye nāmarūpe pākaṭe hutvā upaṭṭhahante uppannaṃ pītipāmojjaṃ amatanibbānasampāpakattā vijānataṃ paṇḍitānaṃ amatamevāti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatrāyamādi bhavatī"
      },
      "ti tatra ayaṃ ādi, idaṃ pubbaṭṭhānaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idha paññassā"
      },
      "ti imasmiṃ sāsane paṇḍitabhikkhuno. Idāni ‘‘taṃ ādī’’ti vuttaṃ pubbaṭṭhānaṃ dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "indriyaguttī"
      },
      "tiādimāha. Catupārisuddhisīlañhi pubbaṭṭhānaṃ nāma. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "indriyaguttī"
      },
      "ti indriyasaṃvaro. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Santuṭṭhī"
      },
      "ti catupaccayasantoso. Tena ājīvapārisuddhi ceva paccayasannissitañca sīlaṃ kathitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pātimokkhe"
      },
      "ti pātimokkhasaṅkhāte jeṭṭhakasīle paripūrakāritā kathitā."
    ],
    "innerText": "Tatrāyamādi bhavatīti tatra ayaṃ ādi, idaṃ pubbaṭṭhānaṃ hoti. Idha paññassāti imasmiṃ sāsane paṇḍitabhikkhuno. Idāni ‘‘taṃ ādī’’ti vuttaṃ pubbaṭṭhānaṃ dassento indriyaguttītiādimāha. Catupārisuddhisīlañhi pubbaṭṭhānaṃ nāma. Tattha indriyaguttīti indriyasaṃvaro. Santuṭṭhīti catupaccayasantoso. Tena ājīvapārisuddhi ceva paccayasannissitañca sīlaṃ kathitaṃ. Pātimokkheti pātimokkhasaṅkhāte jeṭṭhakasīle paripūrakāritā kathitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mitte bhajassu kalyāṇe"
      },
      "ti vissaṭṭhakammante apatirūpasahāye vajjetvā sādhujīvitāya suddhājīve jaṅghabalaṃ nissāya jīvikakappanāya akusīte atandite kalyāṇamitte bhajassu, sevassūti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭisanthāravutyassā"
      },
      "ti āmisapaṭisanthārena ca dhammapaṭisanthārena ca sampannavuttitāya paṭisanthāravutti assa, paṭisanthārassa kārakā bhaveyyāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ācārakusalo"
      },
      "ti sīlampi ācāro, vattapaṭivattampi ācāro. Tattha kusalo siyā, cheko bhaveyyāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tato pāmojjabahulo"
      },
      "ti tato paṭisanthāravuttito ca ācārakosallato ca uppannena dhammapāmojjena pāmojjabahulo hutvā taṃ sakalassāpi vaṭṭadukkhassa antaṃ karissatīti attho."
    ],
    "innerText": "Mitte bhajassu kalyāṇeti vissaṭṭhakammante apatirūpasahāye vajjetvā sādhujīvitāya suddhājīve jaṅghabalaṃ nissāya jīvikakappanāya akusīte atandite kalyāṇamitte bhajassu, sevassūti attho. Paṭisanthāravutyassāti āmisapaṭisanthārena ca dhammapaṭisanthārena ca sampannavuttitāya paṭisanthāravutti assa, paṭisanthārassa kārakā bhaveyyāti attho. Ācārakusaloti sīlampi ācāro, vattapaṭivattampi ācāro. Tattha kusalo siyā, cheko bhaveyyāti attho. Tato pāmojjabahuloti tato paṭisanthāravuttito ca ācārakosallato ca uppannena dhammapāmojjena pāmojjabahulo hutvā taṃ sakalassāpi vaṭṭadukkhassa antaṃ karissatīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ satthārā desitāsu imāsu gāthāsu ekamekissāya gāthāya pariyosāne ekamekaṃ bhikkhusataṃ nisinnanisinnaṭṭhāneyeva saha paṭisambhidāhi arahattaṃ patvā vehāsaṃ abbhuggantvā sabbepi te bhikkhū ākāseneva vīsayojanasatikaṃ ",
      " kantāraṃ atikkamitvā tathāgatassa suvaṇṇavaṇṇaṃ sarīraṃ vaṇṇentā thomentā pāde vandiṃsūti."
    ],
    "innerText": "Evaṃ satthārā desitāsu imāsu gāthāsu ekamekissāya gāthāya pariyosāne ekamekaṃ bhikkhusataṃ nisinnanisinnaṭṭhāneyeva saha paṭisambhidāhi arahattaṃ patvā vehāsaṃ abbhuggantvā sabbepi te bhikkhū ākāseneva vīsayojanasatikaṃ kantāraṃ atikkamitvā tathāgatassa suvaṇṇavaṇṇaṃ sarīraṃ vaṇṇentā thomentā pāde vandiṃsūti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sambahulabhikkhuvatthu sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Pañcasatabhikkhuvatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vassikā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "viya pupphānī"
      },
      "ti imaṃ dhammadesanaṃ satthā jetavane viharanto pañcasate bhikkhū ārabbha kathesi."
    ],
    "innerText": "Vassikāviya pupphānīti imaṃ dhammadesanaṃ satthā jetavane viharanto pañcasate bhikkhū ārabbha kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Te kira satthu santike kammaṭṭhānaṃ gahetvā araññe samaṇadhammaṃ karontā pātova pupphitāni vassikapupphāni sāyaṃ vaṇṭato muccantāni disvā ‘‘pupphānaṃ vaṇṭehi muccanato mayaṃ paṭhamataraṃ rāgādīhi muccissāmā’’ti vāyamiṃsu. Satthā te bhikkhū oloketvā, ‘‘bhikkhave, bhikkhunā nāma vaṇṭato muccanapupphena viya dukkhato muccituṃ vāyamitabbamevā’’ti vatvā gandhakuṭiyaṃ nisinnova ālokaṃ pharitvā imaṃ gāthamāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "377"
      },
      "."
    ],
    "innerText": "377."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Vassikā viya pupphāni, maddavāni pamuñcati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Evaṃ rāgañca dosañca, vippamuñcetha bhikkhavo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vassikā"
      },
      "ti sumanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Maddavānī"
      },
      "ti milātāni. Idaṃ vuttaṃ hoti – yathā vassikā hiyyo pupphitapupphāni ",
      " punadivase purāṇabhūtāni muñcati, vaṇṭato vissajjeti, evaṃ tumhepi rāgādayo dose vippamuñcethāti."
    ],
    "innerText": "Tattha vassikāti sumanā. Maddavānīti milātāni. Idaṃ vuttaṃ hoti – yathā vassikā hiyyo pupphitapupphāni punadivase purāṇabhūtāni muñcati, vaṇṭato vissajjeti, evaṃ tumhepi rāgādayo dose vippamuñcethāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Desanāvasāne sabbepi te bhikkhū arahatte patiṭṭhahiṃsūti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pañcasatabhikkhuvatthu aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Santakāyattheravatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Santakāyo"
      },
      "ti imaṃ dhammadesanaṃ satthā jetavane viharanto santakāyattheraṃ nāma ārabbha kathesi."
    ],
    "innerText": "Santakāyoti imaṃ dhammadesanaṃ satthā jetavane viharanto santakāyattheraṃ nāma ārabbha kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tassa kira hatthapādakukkuccaṃ nāma nāhosi, kāyavijambhanarahito santaattabhāvova ahosi. So kira sīhayonito āgato thero. Sīhā kira ekadivasaṃ gocaraṃ gahetvā rajatasuvaṇṇamaṇipavāḷaguhānaṃ aññataraṃ pavisitvā manosilātale haritālacuṇṇesu sattāhaṃ nipajjitvā ",
      " sattame divase uṭṭhāya nipannaṭṭhānaṃ oloketvā sace naṅguṭṭhassa vā kaṇṇānaṃ vā hatthapādānaṃ vā calitattā manosilāharitālacuṇṇānaṃ vippakiṇṇataṃ passanti, ‘‘na te idaṃ jātiyā vā gottassa vā patirūpa’’nti ",
      " puna sattāhaṃ nirāhārā nipajjanti, cuṇṇānaṃ pana vippakiṇṇabhāve asati ‘‘idaṃ ",
      " te jātigottānaṃ anucchavika’’nti āsayā nikkhamitvā vijambhitvā disā anuviloketvā tikkhattuṃ sīhanādaṃ naditvā gocarāya pakkamanti. Evarūpāya sīhayoniyā āgato ayaṃ bhikkhu. Tassa kāyasamācāraṃ disvā bhikkhū satthu ārocesuṃ – ‘‘na no, bhante, santakāyattherasadiso bhikkhu diṭṭhapubbo. Imassa hi nisinnaṭṭhāne hatthacalanaṃ vā pādacalanaṃ vā kāyavijambhitā vā natthī’’ti. Taṃ sutvā satthā, ‘‘bhikkhave, bhikkhunā nāma santakāyattherena viya kāyādīhi upasanteneva bhavitabba’’nti vatvā imaṃ gāthamāha –"
    ],
    "innerText": "Tassa kira hatthapādakukkuccaṃ nāma nāhosi, kāyavijambhanarahito santaattabhāvova ahosi. So kira sīhayonito āgato thero. Sīhā kira ekadivasaṃ gocaraṃ gahetvā rajatasuvaṇṇamaṇipavāḷaguhānaṃ aññataraṃ pavisitvā manosilātale haritālacuṇṇesu sattāhaṃ nipajjitvā sattame divase uṭṭhāya nipannaṭṭhānaṃ oloketvā sace naṅguṭṭhassa vā kaṇṇānaṃ vā hatthapādānaṃ vā calitattā manosilāharitālacuṇṇānaṃ vippakiṇṇataṃ passanti, ‘‘na te idaṃ jātiyā vā gottassa vā patirūpa’’nti puna sattāhaṃ nirāhārā nipajjanti, cuṇṇānaṃ pana vippakiṇṇabhāve asati ‘‘idaṃ te jātigottānaṃ anucchavika’’nti āsayā nikkhamitvā vijambhitvā disā anuviloketvā tikkhattuṃ sīhanādaṃ naditvā gocarāya pakkamanti. Evarūpāya sīhayoniyā āgato ayaṃ bhikkhu. Tassa kāyasamācāraṃ disvā bhikkhū satthu ārocesuṃ – ‘‘na no, bhante, santakāyattherasadiso bhikkhu diṭṭhapubbo. Imassa hi nisinnaṭṭhāne hatthacalanaṃ vā pādacalanaṃ vā kāyavijambhitā vā natthī’’ti. Taṃ sutvā satthā, ‘‘bhikkhave, bhikkhunā nāma santakāyattherena viya kāyādīhi upasanteneva bhavitabba’’nti vatvā imaṃ gāthamāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "378"
      },
      "."
    ],
    "innerText": "378."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Santakāyo santavāco, santavā susamāhito;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vantalokāmiso bhikkhu, upasantoti vuccatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "santakāyo"
      },
      "ti pāṇātipātādīnaṃ abhāvena santakāyo, musāvādādīnaṃ abhāvena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "santavāco,"
      },
      " abhijjhādīnaṃ abhāvena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "santavā,"
      },
      " kāyādīnaṃ tiṇṇampi suṭṭhu samāhitattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "susamāhito,"
      },
      " catūhi maggehi lokāmisassa vantatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vantalokāmiso"
      },
      " bhikkhu abbhantare rāgādīnaṃ upasantatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upasanto"
      },
      "ti vuccatīti attho."
    ],
    "innerText": "Tattha santakāyoti pāṇātipātādīnaṃ abhāvena santakāyo, musāvādādīnaṃ abhāvena santavāco, abhijjhādīnaṃ abhāvena santavā, kāyādīnaṃ tiṇṇampi suṭṭhu samāhitattā susamāhito, catūhi maggehi lokāmisassa vantatāya vantalokāmiso bhikkhu abbhantare rāgādīnaṃ upasantatāya upasantoti vuccatīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Desanāvasāne so thero arahatte patiṭṭhahi, sampattānampi sātthikā dhammadesanā ahosīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Santakāyattheravatthu navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Naṅgalakulattheravatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attanā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "codayattāna"
      },
      "nti imaṃ dhammadesanaṃ satthā jetavane viharanto naṅgalakulattheraṃ ārabbha kathesi."
    ],
    "innerText": "Attanācodayattānanti imaṃ dhammadesanaṃ satthā jetavane viharanto naṅgalakulattheraṃ ārabbha kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Eko kira duggatamanusso paresaṃ bhatiṃ katvā jīvati, taṃ eko bhikkhu pilotikakhaṇḍanivatthaṃ naṅgalaṃ ukkhipitvā gacchantaṃ disvā evamāha – ‘‘kiṃ pana te evaṃ jīvanato pabbajituṃ na vara’’nti. Ko maṃ, bhante, evaṃ jīvantaṃ pabbājessatīti? Sace pabbajissasi ",
      ", ahaṃ taṃ pabbājessāmīti. Sādhu bhante ",
      ", sace maṃ pabbājessatha, pabbajissāmīti. Atha naṃ so thero jetavanaṃ netvā sahatthena, nhāpetvā māḷake ṭhapetvā pabbājetvā nivatthapilotikakhaṇḍena saddhiṃ naṅgalaṃ māḷakasīmāyameva rukkhasākhāyaṃ ṭhapāpesi. So upasampannakālepi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "naṅgalakulatthero"
      },
      "tveva paññāyi. So buddhānaṃ uppannalābhasakkāraṃ nissāya jīvanto ukkaṇṭhitvā ukkaṇṭhitaṃ vinodetuṃ asakkonto ‘‘na dāni saddhādeyyāni kāsāyāni paridahitvā gamissāmī’’ti taṃ rukkhamūlaṃ gantvā attanāva attānaṃ ovadi – ‘‘ahirika, nillajja, idaṃ nivāsetvā vibbhamitvā bhatiṃ katvā jīvitukāmo jāto’’ti. Tassevaṃ attānaṃ ovadantasseva cittaṃ tanukabhāvaṃ gataṃ. So nivattitvā puna katipāhaccayena ",
      " ukkaṇṭhitvā tatheva attānaṃ ovadi, punassa cittaṃ nivatti. So imināva nīhārena ukkaṇṭhitaukkaṇṭhitakāle tattha gantvā attānaṃ ovadi. Atha naṃ bhikkhū tattha abhiṇhaṃ gacchantaṃ disvā, ‘‘āvuso, naṅgalatthera kasmā ettha gacchasī’’ti pucchiṃsu. So ‘‘ācariyassa santikaṃ gacchāmi, bhante’’ti vatvā katipāheneva arahattaṃ pāpuṇi."
    ],
    "innerText": "Eko kira duggatamanusso paresaṃ bhatiṃ katvā jīvati, taṃ eko bhikkhu pilotikakhaṇḍanivatthaṃ naṅgalaṃ ukkhipitvā gacchantaṃ disvā evamāha – ‘‘kiṃ pana te evaṃ jīvanato pabbajituṃ na vara’’nti. Ko maṃ, bhante, evaṃ jīvantaṃ pabbājessatīti? Sace pabbajissasi , ahaṃ taṃ pabbājessāmīti. Sādhu bhante , sace maṃ pabbājessatha, pabbajissāmīti. Atha naṃ so thero jetavanaṃ netvā sahatthena, nhāpetvā māḷake ṭhapetvā pabbājetvā nivatthapilotikakhaṇḍena saddhiṃ naṅgalaṃ māḷakasīmāyameva rukkhasākhāyaṃ ṭhapāpesi. So upasampannakālepi naṅgalakulattherotveva paññāyi. So buddhānaṃ uppannalābhasakkāraṃ nissāya jīvanto ukkaṇṭhitvā ukkaṇṭhitaṃ vinodetuṃ asakkonto ‘‘na dāni saddhādeyyāni kāsāyāni paridahitvā gamissāmī’’ti taṃ rukkhamūlaṃ gantvā attanāva attānaṃ ovadi – ‘‘ahirika, nillajja, idaṃ nivāsetvā vibbhamitvā bhatiṃ katvā jīvitukāmo jāto’’ti. Tassevaṃ attānaṃ ovadantasseva cittaṃ tanukabhāvaṃ gataṃ. So nivattitvā puna katipāhaccayena ukkaṇṭhitvā tatheva attānaṃ ovadi, punassa cittaṃ nivatti. So imināva nīhārena ukkaṇṭhitaukkaṇṭhitakāle tattha gantvā attānaṃ ovadi. Atha naṃ bhikkhū tattha abhiṇhaṃ gacchantaṃ disvā, ‘‘āvuso, naṅgalatthera kasmā ettha gacchasī’’ti pucchiṃsu. So ‘‘ācariyassa santikaṃ gacchāmi, bhante’’ti vatvā katipāheneva arahattaṃ pāpuṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhikkhū tena saddhiṃ keḷiṃ karontā āhaṃsu – ‘‘āvuso naṅgalatthera, tava vicaraṇamaggo avaḷañjo viya jāto, ācariyassa santikaṃ na gacchasi maññe’’ti. Āma, bhante, mayaṃ saṃsagge sati agamimhā, idāni pana so saṃsaggo chinno, tena na gacchāmāti. Taṃ sutvā bhikkhū ‘‘esa abhūtaṃ vatvā aññaṃ byākarotī’’ti satthu tamatthaṃ ārocesuṃ. Satthā ‘‘āma, bhikkhave, mama putto attanāva attānaṃ codetvā pabbajitakiccassa matthakaṃ patto’’ti vatvā dhammaṃ desento imā gāthā abhāsi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "379"
      },
      "."
    ],
    "innerText": "379."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Attanā codayattānaṃ, paṭimaṃsetha attanā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "So attagutto satimā, sukhaṃ bhikkhu vihāhisi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "380"
      },
      "."
    ],
    "innerText": "380."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Attā hi attano nātho, ko hi nātho paro siyā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Attā hi attano gati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tasmā saṃyamamattānaṃ, assaṃ bhadraṃva vāṇijo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "codayattāna"
      },
      "nti attanāva attānaṃ codaya sāraya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭimaṃsethā"
      },
      "ti attanāva attānaṃ parivīmaṃsatha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "So"
      },
      "ti so tvaṃ, bhikkhu, evaṃ sante attanāva guttatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "attagutto,"
      },
      " upaṭṭhitasatitāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "satimā"
      },
      " hutvā sabbiriyāpathesu sukhaṃ viharissasīti attho."
    ],
    "innerText": "Tattha codayattānanti attanāva attānaṃ codaya sāraya. Paṭimaṃsethāti attanāva attānaṃ parivīmaṃsatha. Soti so tvaṃ, bhikkhu, evaṃ sante attanāva guttatāya attagutto, upaṭṭhitasatitāya satimā hutvā sabbiriyāpathesu sukhaṃ viharissasīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nātho"
      },
      "ti ",
      " avassayo patiṭṭhā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ko hi nātho paro"
      },
      "ti yasmā parassa attabhāve patiṭṭhāya kusalaṃ vā katvā saggaparāyaṇena maggaṃ vā bhāvetvā sacchikataphalena bhavituṃ na sakkā, tasmā ko hi nāma paro nātho bhaveyyāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasmā"
      },
      "ti yasmā attāva attano gati patiṭṭhā saraṇaṃ, tasmā yathā bhadraṃ assājānīyaṃ nissāya lābhaṃ patthayanto vāṇijo tassa visamaṭṭhānacāraṃ pacchinditvā divasassa tikkhattuṃ nahāpento bhojento saṃyameti paṭijaggati, evaṃ tvampi anuppannassa akusalassa uppādaṃ nivārento satisammosena uppannaṃ akusalaṃ pajahanto attānaṃ saṃyama gopaya, evaṃ sante paṭhamajjhānaṃ ādiṃ katvā lokiyalokuttaravisesaṃ adhigamissasīti attho."
    ],
    "innerText": "Nāthoti avassayo patiṭṭhā. Ko hi nātho paroti yasmā parassa attabhāve patiṭṭhāya kusalaṃ vā katvā saggaparāyaṇena maggaṃ vā bhāvetvā sacchikataphalena bhavituṃ na sakkā, tasmā ko hi nāma paro nātho bhaveyyāti attho. Tasmāti yasmā attāva attano gati patiṭṭhā saraṇaṃ, tasmā yathā bhadraṃ assājānīyaṃ nissāya lābhaṃ patthayanto vāṇijo tassa visamaṭṭhānacāraṃ pacchinditvā divasassa tikkhattuṃ nahāpento bhojento saṃyameti paṭijaggati, evaṃ tvampi anuppannassa akusalassa uppādaṃ nivārento satisammosena uppannaṃ akusalaṃ pajahanto attānaṃ saṃyama gopaya, evaṃ sante paṭhamajjhānaṃ ādiṃ katvā lokiyalokuttaravisesaṃ adhigamissasīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Desanāvasāne bahū sotāpattiphalādīni pāpuṇiṃsūti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Naṅgalakulattheravatthu dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "11. Vakkalittheravatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāmojjabahulo"
      },
      "ti imaṃ dhammadesanaṃ satthā veḷuvane viharanto vakkalittheraṃ ārabbha kathesi."
    ],
    "innerText": "Pāmojjabahuloti imaṃ dhammadesanaṃ satthā veḷuvane viharanto vakkalittheraṃ ārabbha kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "So ",
      " kirāyasmā sāvatthiyaṃ brāhmaṇakule nibbattitvā vayappatto piṇḍāya paviṭṭhaṃ tathāgataṃ disvā satthu sarīrasampattiṃ oloketvā sarīrasampattidassanena atitto ‘‘evāhaṃ niccakālaṃ tathāgataṃ daṭṭhuṃ labhissāmī’’ti satthu santike pabbajitvā yattha ṭhitena sakkā dasabalaṃ passituṃ, tattha ṭhito sajjhāyakammaṭṭhānamanasikārādīni pahāya satthāraṃ olokentova vicarati. Satthā tassa ñāṇaparipākaṃ āgamento kiñci avatvā ‘‘idānissa ñāṇaṃ paripākaṃ gata’’nti ñatvā ‘‘kiṃ te, vakkali, iminā ",
      " pūtikāyena diṭṭhena, yo kho, vakkali, dhammaṃ passati, so maṃ passati. Yo maṃ passati, so dhammaṃ passatī’’ti (saṃ. ni. 3.87) vatvā ovadi. So evaṃ ovaditopi satthu dassanaṃ pahāya neva aññattha gantuṃ sakkoti. Atha naṃ satthā ‘‘nāyaṃ bhikkhu saṃvegaṃ alabhitvā bujjhissatī’’ti upakaṭṭhāya vassūpanāyikāya rājagahaṃ gantvā vassūpanāyikadivase ‘‘apehi, vakkali, apehi, vakkalī’’ti paṇāmesi. So ‘‘na maṃ satthā ālapatī’’ti temāsaṃ satthu sammukhe ṭhātuṃ asakkonto ‘‘kiṃ mayhaṃ jīvitena, pabbatā attānaṃ pātessāmī’’ti gijjhakūṭaṃ abhiruhi."
    ],
    "innerText": "So kirāyasmā sāvatthiyaṃ brāhmaṇakule nibbattitvā vayappatto piṇḍāya paviṭṭhaṃ tathāgataṃ disvā satthu sarīrasampattiṃ oloketvā sarīrasampattidassanena atitto ‘‘evāhaṃ niccakālaṃ tathāgataṃ daṭṭhuṃ labhissāmī’’ti satthu santike pabbajitvā yattha ṭhitena sakkā dasabalaṃ passituṃ, tattha ṭhito sajjhāyakammaṭṭhānamanasikārādīni pahāya satthāraṃ olokentova vicarati. Satthā tassa ñāṇaparipākaṃ āgamento kiñci avatvā ‘‘idānissa ñāṇaṃ paripākaṃ gata’’nti ñatvā ‘‘kiṃ te, vakkali, iminā pūtikāyena diṭṭhena, yo kho, vakkali, dhammaṃ passati, so maṃ passati. Yo maṃ passati, so dhammaṃ passatī’’ti (saṃ. ni. 3.87) vatvā ovadi. So evaṃ ovaditopi satthu dassanaṃ pahāya neva aññattha gantuṃ sakkoti. Atha naṃ satthā ‘‘nāyaṃ bhikkhu saṃvegaṃ alabhitvā bujjhissatī’’ti upakaṭṭhāya vassūpanāyikāya rājagahaṃ gantvā vassūpanāyikadivase ‘‘apehi, vakkali, apehi, vakkalī’’ti paṇāmesi. So ‘‘na maṃ satthā ālapatī’’ti temāsaṃ satthu sammukhe ṭhātuṃ asakkonto ‘‘kiṃ mayhaṃ jīvitena, pabbatā attānaṃ pātessāmī’’ti gijjhakūṭaṃ abhiruhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Satthā tassa kilamanabhāvaṃ ñatvā ‘‘ayaṃ bhikkhu mama santikā assāsaṃ alabhanto maggaphalānaṃ ",
      " upanissayaṃ nāseyyā’’ti attānaṃ dassetuṃ obhāsaṃ muñci. Athassa satthu diṭṭhakālato paṭṭhāya tāvamahantopi soko pahīyi. Satthā sukkhataḷākaṃ oghena pūrento viya therassa balavapītipāmojjaṃ uppādetuṃ imaṃ gāthamāha –"
    ],
    "innerText": "Satthā tassa kilamanabhāvaṃ ñatvā ‘‘ayaṃ bhikkhu mama santikā assāsaṃ alabhanto maggaphalānaṃ upanissayaṃ nāseyyā’’ti attānaṃ dassetuṃ obhāsaṃ muñci. Athassa satthu diṭṭhakālato paṭṭhāya tāvamahantopi soko pahīyi. Satthā sukkhataḷākaṃ oghena pūrento viya therassa balavapītipāmojjaṃ uppādetuṃ imaṃ gāthamāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "381"
      },
      "."
    ],
    "innerText": "381."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " ‘‘Pāmojjabahulo ",
      " bhikkhu, pasanno buddhasāsane;"
    ],
    "innerText": "‘‘Pāmojjabahulo bhikkhu, pasanno buddhasāsane;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Adhigacche padaṃ santaṃ, saṅkhārūpasamaṃ sukha’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassattho – pakatiyāpi pāmojjabahulo bhikkhu buddhasāsane pasādaṃ roceti, so evaṃ pasanno buddhasāsane santaṃ padaṃ saṅkhārūpasamaṃ sukhanti laddhanāmaṃ nibbānaṃ adhigaccheyyāti. Imañca pana gāthaṃ vatvā satthā vakkalittherassa hatthaṃ pasāretvā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ehi vakkali mā bhāyi, olokehi tathāgataṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ahaṃ taṃ uddharissāmi, paṅke sannaṃva kuñjaraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ehi vakkali mā bhāyi, olokehi tathāgataṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ahaṃ taṃ mocayissāmi, rāhuggahaṃva sūriyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ehi vakkali mā bhāyi, olokehi tathāgataṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ahaṃ taṃ mocayissāmi, rāhuggahaṃva candima’’nti. –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Imā gāthā abhāsi. So ‘‘dasabalo me diṭṭho, ehīti ca avhānampi laddha’’nti balavapītiṃ uppādetvā ‘‘kuto nu kho gantabba’’nti gamanamaggaṃ apassanto dasabalassa sammukhe ākāse uppatitvā paṭhamapāde pabbate ",
      " ṭhiteyeva satthārā vuttagāthā āvajjento ākāseyeva pītiṃ vikkhambhetvā saha paṭisambhidāhi arahattaṃ patvā tathāgataṃ vandamānova otaritvā satthu santike aṭṭhāsi. Atha naṃ satthā aparabhāge saddhādhimuttānaṃ aggaṭṭhāne ṭhapesīti."
    ],
    "innerText": "Imā gāthā abhāsi. So ‘‘dasabalo me diṭṭho, ehīti ca avhānampi laddha’’nti balavapītiṃ uppādetvā ‘‘kuto nu kho gantabba’’nti gamanamaggaṃ apassanto dasabalassa sammukhe ākāse uppatitvā paṭhamapāde pabbate ṭhiteyeva satthārā vuttagāthā āvajjento ākāseyeva pītiṃ vikkhambhetvā saha paṭisambhidāhi arahattaṃ patvā tathāgataṃ vandamānova otaritvā satthu santike aṭṭhāsi. Atha naṃ satthā aparabhāge saddhādhimuttānaṃ aggaṭṭhāne ṭhapesīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vakkalittheravatthu ekādasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "12. Sumanasāmaṇeravatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yo"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "have"
      },
      "ti imaṃ dhammadesanaṃ satthā pubbārāme viharanto sumanasāmaṇeraṃ ārabbha kathesi. Tatrāyaṃ anupubbī kathā –"
    ],
    "innerText": "Yohaveti imaṃ dhammadesanaṃ satthā pubbārāme viharanto sumanasāmaṇeraṃ ārabbha kathesi. Tatrāyaṃ anupubbī kathā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Padumuttarabuddhakālasmiñhi eko kulaputto satthārā catuparisamajjhe ekaṃ bhikkhuṃ dibbacakkhukānaṃ aggaṭṭhāne ṭhapentaṃ disvā taṃ sampattiṃ patthayamāno satthāraṃ nimantetvā sattāhaṃ buddhappamukhassa bhikkhusaṅghassa mahādānaṃ datvā, ‘‘bhante, ahampi anāgate ekassa buddhassa sāsane dibbacakkhukānaṃ aggo bhaveyya’’nti patthanaṃ ṭhapesi. Satthā kappasatasahassaṃ olokento tassa patthanāya samijjhanabhāvaṃ viditvā ‘‘ito kappasatasahassamatthake gotamabuddhasāsane dibbacakkhukānaṃ aggo anuruddho nāma bhavissasī’’ti byākāsi. So taṃ byākaraṇaṃ sutvā sve pattabbaṃ viya taṃ sampattiṃ maññamāno parinibbute satthari bhikkhū dibbacakkhuparikammaṃ pucchitvā sattayojanikaṃ kañcanathūpaṃ parikkhipitvā anekāni dīparukkhasahassāni kāretvā dīpapūjaṃ katvā tato cuto devaloke nibbattitvā devamanussesu kappasatasahassāni saṃsaritvā imasmiṃ kappe bārāṇasiyaṃ daliddakule nibbatto sumanaseṭṭhiṃ nissāya tassa tiṇahārako hutvā jīvikaṃ kappesi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Annabhāro"
      },
      "tissa nāmaṃ ahosi. Sumanaseṭṭhīpi tasmiṃ nagare niccakālaṃ mahādānaṃ deti."
    ],
    "innerText": "Padumuttarabuddhakālasmiñhi eko kulaputto satthārā catuparisamajjhe ekaṃ bhikkhuṃ dibbacakkhukānaṃ aggaṭṭhāne ṭhapentaṃ disvā taṃ sampattiṃ patthayamāno satthāraṃ nimantetvā sattāhaṃ buddhappamukhassa bhikkhusaṅghassa mahādānaṃ datvā, ‘‘bhante, ahampi anāgate ekassa buddhassa sāsane dibbacakkhukānaṃ aggo bhaveyya’’nti patthanaṃ ṭhapesi. Satthā kappasatasahassaṃ olokento tassa patthanāya samijjhanabhāvaṃ viditvā ‘‘ito kappasatasahassamatthake gotamabuddhasāsane dibbacakkhukānaṃ aggo anuruddho nāma bhavissasī’’ti byākāsi. So taṃ byākaraṇaṃ sutvā sve pattabbaṃ viya taṃ sampattiṃ maññamāno parinibbute satthari bhikkhū dibbacakkhuparikammaṃ pucchitvā sattayojanikaṃ kañcanathūpaṃ parikkhipitvā anekāni dīparukkhasahassāni kāretvā dīpapūjaṃ katvā tato cuto devaloke nibbattitvā devamanussesu kappasatasahassāni saṃsaritvā imasmiṃ kappe bārāṇasiyaṃ daliddakule nibbatto sumanaseṭṭhiṃ nissāya tassa tiṇahārako hutvā jīvikaṃ kappesi. Annabhārotissa nāmaṃ ahosi. Sumanaseṭṭhīpi tasmiṃ nagare niccakālaṃ mahādānaṃ deti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Athekadivasaṃ upariṭṭho nāma paccekabuddho gandhamādane nirodhasamāpattito ",
      " vuṭṭhāya ‘‘kassa nu kho ajja anuggahaṃ karissāmī’’ti cintetvā ‘‘ajja mayā annabhārassa anuggahaṃ kātuṃ vaṭṭati, idāni ca so aṭavito tiṇaṃ ādāya gehaṃ āgamissatī’’ti ñatvā pattacīvaramādāya iddhiyā gantvā annabhārassa sammukhe paccuṭṭhāsi. Annabhāro taṃ tucchapattahatthaṃ disvā ‘‘api ",
      ", bhante, bhikkhaṃ labhitthā’’ti pucchitvā ‘‘labhissāma mahāpuññā’’ti vutte ‘‘tena hi, bhante, thokaṃ āgamethā’’ti tiṇakājaṃ chaḍḍetvā vegena gehaṃ gantvā, ‘‘bhadde, mayhaṃ ṭhapitabhāgabhattaṃ atthi, natthī’’ti bhariyaṃ pucchitvā ‘‘atthi, sāmī’’ti vutte vegena paccāgantvā paccekabuddhassa pattaṃ ādāya ‘‘mayhaṃ dātukāmatāya sati deyyadhammo na hoti, deyyadhamme sati paṭiggāhakaṃ na labhāmi. Ajja pana me paṭiggāhako ca diṭṭho, deyyadhammo ca atthi, lābhā vata me’’ti gehaṃ gantvā bhattaṃ patte pakkhipāpetvā paccāharitvā paccekabuddhassa hatthe patiṭṭhapetvā –"
    ],
    "innerText": "Athekadivasaṃ upariṭṭho nāma paccekabuddho gandhamādane nirodhasamāpattito vuṭṭhāya ‘‘kassa nu kho ajja anuggahaṃ karissāmī’’ti cintetvā ‘‘ajja mayā annabhārassa anuggahaṃ kātuṃ vaṭṭati, idāni ca so aṭavito tiṇaṃ ādāya gehaṃ āgamissatī’’ti ñatvā pattacīvaramādāya iddhiyā gantvā annabhārassa sammukhe paccuṭṭhāsi. Annabhāro taṃ tucchapattahatthaṃ disvā ‘‘api , bhante, bhikkhaṃ labhitthā’’ti pucchitvā ‘‘labhissāma mahāpuññā’’ti vutte ‘‘tena hi, bhante, thokaṃ āgamethā’’ti tiṇakājaṃ chaḍḍetvā vegena gehaṃ gantvā, ‘‘bhadde, mayhaṃ ṭhapitabhāgabhattaṃ atthi, natthī’’ti bhariyaṃ pucchitvā ‘‘atthi, sāmī’’ti vutte vegena paccāgantvā paccekabuddhassa pattaṃ ādāya ‘‘mayhaṃ dātukāmatāya sati deyyadhammo na hoti, deyyadhamme sati paṭiggāhakaṃ na labhāmi. Ajja pana me paṭiggāhako ca diṭṭho, deyyadhammo ca atthi, lābhā vata me’’ti gehaṃ gantvā bhattaṃ patte pakkhipāpetvā paccāharitvā paccekabuddhassa hatthe patiṭṭhapetvā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Iminā ",
      " pana dānena, mā me dāliddiyaṃ ahu;"
    ],
    "innerText": "‘‘Iminā pana dānena, mā me dāliddiyaṃ ahu;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Natthīti vacanaṃ nāma, mā ahosi bhavābhave. –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Bhante evarūpā dujjīvitā mucceyyaṃ, natthīti padameva na suṇeyya’’nti patthanaṃ ṭhapesi. Paccekabuddho ‘‘evaṃ hotu mahāpuññā’’ti vatvā anumodanaṃ katvā pakkāmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sumanaseṭṭhinopi chatte adhivatthā devatā ‘‘aho dānaṃ paramadānaṃ, upariṭṭhe supatiṭṭhita’’nti ",
      " vatvā tikkhattuṃ sādhukāramadāsi. Atha naṃ seṭṭhi ‘‘kiṃ maṃ ettakaṃ kālaṃ dānaṃ dadamānaṃ na passasī’’ti āha. Nāhaṃ tava dānaṃ ārabbha sādhukāraṃ demi, annabhārena pana upariṭṭhassa dinnapiṇḍapāte pasīditvā mayā esa sādhukāro pavattitoti. So ‘‘acchariyaṃ vata, bho, ahaṃ ettakaṃ kālaṃ dānaṃ dadanto devataṃ sādhukāraṃ dāpetuṃ nāsakkhiṃ, annabhāro maṃ nissāya jīvanto ekapiṇḍapāteneva sādhukāraṃ dāpesi, tassa dāne anucchavikaṃ katvā taṃ piṇḍapātaṃ mama santakaṃ karissāmī’’ti cintetvā taṃ pakkosāpetvā ‘‘ajja tayā kassaci kiñci dinna’’nti pucchi. ‘‘Āma, sāmi, upariṭṭhapaccekabuddhassa me ajja bhāgabhattaṃ dinna’’nti. ‘‘Handa, bho, kahāpaṇaṃ gahetvā etaṃ mayhaṃ piṇḍapātaṃ dehī’’ti? ‘‘Na demi, sāmī’’ti. So yāva sahassaṃ vaḍḍhesi, itaro sahassenāpi nādāsi. Atha naṃ ‘‘hotu, bho, yadi piṇḍapātaṃ na desi, sahassaṃ gahetvā pattiṃ me dehī’’ti āha. So ‘‘ayyena saddhiṃ mantetvā jānissāmī’’ti vegena paccekabuddhaṃ sampāpuṇitvā, ‘‘bhante sumanaseṭṭhi, sahassaṃ datvā tumhākaṃ piṇḍapāte pattiṃ yācati, kiṃ karomī’’ti pucchi."
    ],
    "innerText": "Sumanaseṭṭhinopi chatte adhivatthā devatā ‘‘aho dānaṃ paramadānaṃ, upariṭṭhe supatiṭṭhita’’nti vatvā tikkhattuṃ sādhukāramadāsi. Atha naṃ seṭṭhi ‘‘kiṃ maṃ ettakaṃ kālaṃ dānaṃ dadamānaṃ na passasī’’ti āha. Nāhaṃ tava dānaṃ ārabbha sādhukāraṃ demi, annabhārena pana upariṭṭhassa dinnapiṇḍapāte pasīditvā mayā esa sādhukāro pavattitoti. So ‘‘acchariyaṃ vata, bho, ahaṃ ettakaṃ kālaṃ dānaṃ dadanto devataṃ sādhukāraṃ dāpetuṃ nāsakkhiṃ, annabhāro maṃ nissāya jīvanto ekapiṇḍapāteneva sādhukāraṃ dāpesi, tassa dāne anucchavikaṃ katvā taṃ piṇḍapātaṃ mama santakaṃ karissāmī’’ti cintetvā taṃ pakkosāpetvā ‘‘ajja tayā kassaci kiñci dinna’’nti pucchi. ‘‘Āma, sāmi, upariṭṭhapaccekabuddhassa me ajja bhāgabhattaṃ dinna’’nti. ‘‘Handa, bho, kahāpaṇaṃ gahetvā etaṃ mayhaṃ piṇḍapātaṃ dehī’’ti? ‘‘Na demi, sāmī’’ti. So yāva sahassaṃ vaḍḍhesi, itaro sahassenāpi nādāsi. Atha naṃ ‘‘hotu, bho, yadi piṇḍapātaṃ na desi, sahassaṃ gahetvā pattiṃ me dehī’’ti āha. So ‘‘ayyena saddhiṃ mantetvā jānissāmī’’ti vegena paccekabuddhaṃ sampāpuṇitvā, ‘‘bhante sumanaseṭṭhi, sahassaṃ datvā tumhākaṃ piṇḍapāte pattiṃ yācati, kiṃ karomī’’ti pucchi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Athassa ",
      " so upamaṃ āhari ‘‘seyyathāpi, paṇḍita, kulasatike gāme ekasmiṃ ghare dīpaṃ jāleyya, sesā attano telena vaṭṭiṃ temetvā jālāpetvā gaṇheyyuṃ, purimapadīpassa ",
      " pabhā atthīti vattabbā natthī’’ti. Atirekatarā, bhante, pabhā hotīti. Evamevaṃ paṇḍita uḷuṅkayāgu vā hotu, kaṭacchubhikkhā vā, attano piṇḍapāte paresaṃ pattiṃ dentassa yattakānaṃ deti, tattakaṃ vaḍḍhati. Tvañhi ekameva piṇḍapātaṃ adāsi, seṭṭhissa pana pattiyā dinnāya dve piṇḍapātā honti eko tava, eko tassāti."
    ],
    "innerText": "Athassa so upamaṃ āhari ‘‘seyyathāpi, paṇḍita, kulasatike gāme ekasmiṃ ghare dīpaṃ jāleyya, sesā attano telena vaṭṭiṃ temetvā jālāpetvā gaṇheyyuṃ, purimapadīpassa pabhā atthīti vattabbā natthī’’ti. Atirekatarā, bhante, pabhā hotīti. Evamevaṃ paṇḍita uḷuṅkayāgu vā hotu, kaṭacchubhikkhā vā, attano piṇḍapāte paresaṃ pattiṃ dentassa yattakānaṃ deti, tattakaṃ vaḍḍhati. Tvañhi ekameva piṇḍapātaṃ adāsi, seṭṭhissa pana pattiyā dinnāya dve piṇḍapātā honti eko tava, eko tassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "So ‘‘sādhu, bhante’’ti taṃ abhivādetvā seṭṭhissa santikaṃ gantvā ‘‘gaṇha, sāmi, patti’’nti āha. Tena hi ime kahāpaṇe gaṇhāti. Nāhaṃ piṇḍapātaṃ vikkiṇāmi, saddhāya te pattiṃ dammīti. ‘‘Tvaṃ saddhāya desi, ahampi tava guṇe pūjemi, gaṇha, tāta, ito paṭṭhāya ",
      " ca pana mā sahatthā kammamakāsi, vīthiyaṃ gharaṃ māpetvā vasa. Yena ca te attho hoti, sabbaṃ mama santikā gaṇhāhī’’ti āha. Nirodhā vuṭṭhitassa pana dinnapiṇḍapāto tadaheva vipākaṃ deti. Tasmā rājāpi taṃ pavattiṃ sutvā annabhāraṃ pakkosāpetvā pattiṃ gahetvā mahantaṃ bhogaṃ datvā tassa seṭṭhiṭṭhānaṃ dāpesi."
    ],
    "innerText": "So ‘‘sādhu, bhante’’ti taṃ abhivādetvā seṭṭhissa santikaṃ gantvā ‘‘gaṇha, sāmi, patti’’nti āha. Tena hi ime kahāpaṇe gaṇhāti. Nāhaṃ piṇḍapātaṃ vikkiṇāmi, saddhāya te pattiṃ dammīti. ‘‘Tvaṃ saddhāya desi, ahampi tava guṇe pūjemi, gaṇha, tāta, ito paṭṭhāya ca pana mā sahatthā kammamakāsi, vīthiyaṃ gharaṃ māpetvā vasa. Yena ca te attho hoti, sabbaṃ mama santikā gaṇhāhī’’ti āha. Nirodhā vuṭṭhitassa pana dinnapiṇḍapāto tadaheva vipākaṃ deti. Tasmā rājāpi taṃ pavattiṃ sutvā annabhāraṃ pakkosāpetvā pattiṃ gahetvā mahantaṃ bhogaṃ datvā tassa seṭṭhiṭṭhānaṃ dāpesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "So sumanaseṭṭhissa sahāyako hutvā yāvajīvaṃ puññāni katvā tato cuto devaloke nibbattitvā devamanussesu saṃsaranto ",
      " imasmiṃ buddhuppāde kapilavatthunagare amitodanassa sakkassa gehe paṭisandhiṃ gaṇhi, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anuruddho"
      },
      "tissa nāmaṃ akaṃsu. So mahānāmasakkassa kaniṭṭhabhātā, satthu cūḷapitu putto paramasukhumālo mahāpuñño ahosi. Ekadivasaṃ kira chasu khattiyesu pūve lakkhaṃ katvā guḷehi kīḷantesu anuruddho parājito pūvānaṃ atthāya mātu santikaṃ pahiṇi. Sā mahantaṃ suvaṇṇathālaṃ pūretvā pūve pesesi. Pūve khāditvā puna kīḷanto parājito tatheva pahiṇi. Evaṃ tikkhattuṃ pūvesu āhaṭesu catutthe vāre mātā ‘‘idāni pūvā natthī’’ti pahiṇi. Tassā vacanaṃ sutvā ‘‘natthī’’ti padassa asutapubbatāya ‘‘natthipūvā nāma idāni bhavissantī’’ti saññaṃ katvā ‘‘gaccha natthipūve āharā’’ti pesesi. Athassa ",
      " mātā ‘‘natthipūve kira, ayye, dethā’’ti vutte ‘‘mama puttena natthīti padaṃ na sutapubbaṃ, kathaṃ nu kho natthibhāvaṃ jānāpeyya’’nti suvaṇṇapātiṃ dhovitvā aparāya suvaṇṇapātiyā paṭikujjitvā ‘‘handa, tāta, imaṃ mama puttassa dehī’’ti pahiṇi. Tasmiṃ khaṇe nagarapariggāhikā devatā ‘‘amhākaṃ sāminā annabhārakāle upariṭṭhassa paccekabuddhassa bhāgabhattaṃ ",
      " datvā ‘natthīti padameva na suṇeyya’nti patthanā nāma ṭhapitā. Sace mayaṃ tamatthaṃ ñatvā ajjhupekkheyyāma, muddhāpi no sattadhā phaleyyā’’ti cintetvā dibbapūvehi pātiṃ pūrayiṃsu. So puriso pātiṃ āharitvā tassa santike ṭhapetvā vivari. Tesaṃ gandho sakalanagaraṃ phari. Pūvo pana mukhe ṭhapitamattova sattarasaharaṇisahassāni pharitvā aṭṭhāsi."
    ],
    "innerText": "So sumanaseṭṭhissa sahāyako hutvā yāvajīvaṃ puññāni katvā tato cuto devaloke nibbattitvā devamanussesu saṃsaranto imasmiṃ buddhuppāde kapilavatthunagare amitodanassa sakkassa gehe paṭisandhiṃ gaṇhi, anuruddhotissa nāmaṃ akaṃsu. So mahānāmasakkassa kaniṭṭhabhātā, satthu cūḷapitu putto paramasukhumālo mahāpuñño ahosi. Ekadivasaṃ kira chasu khattiyesu pūve lakkhaṃ katvā guḷehi kīḷantesu anuruddho parājito pūvānaṃ atthāya mātu santikaṃ pahiṇi. Sā mahantaṃ suvaṇṇathālaṃ pūretvā pūve pesesi. Pūve khāditvā puna kīḷanto parājito tatheva pahiṇi. Evaṃ tikkhattuṃ pūvesu āhaṭesu catutthe vāre mātā ‘‘idāni pūvā natthī’’ti pahiṇi. Tassā vacanaṃ sutvā ‘‘natthī’’ti padassa asutapubbatāya ‘‘natthipūvā nāma idāni bhavissantī’’ti saññaṃ katvā ‘‘gaccha natthipūve āharā’’ti pesesi. Athassa mātā ‘‘natthipūve kira, ayye, dethā’’ti vutte ‘‘mama puttena natthīti padaṃ na sutapubbaṃ, kathaṃ nu kho natthibhāvaṃ jānāpeyya’’nti suvaṇṇapātiṃ dhovitvā aparāya suvaṇṇapātiyā paṭikujjitvā ‘‘handa, tāta, imaṃ mama puttassa dehī’’ti pahiṇi. Tasmiṃ khaṇe nagarapariggāhikā devatā ‘‘amhākaṃ sāminā annabhārakāle upariṭṭhassa paccekabuddhassa bhāgabhattaṃ datvā ‘natthīti padameva na suṇeyya’nti patthanā nāma ṭhapitā. Sace mayaṃ tamatthaṃ ñatvā ajjhupekkheyyāma, muddhāpi no sattadhā phaleyyā’’ti cintetvā dibbapūvehi pātiṃ pūrayiṃsu. So puriso pātiṃ āharitvā tassa santike ṭhapetvā vivari. Tesaṃ gandho sakalanagaraṃ phari. Pūvo pana mukhe ṭhapitamattova sattarasaharaṇisahassāni pharitvā aṭṭhāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Anuruddhopi cintesi – ‘‘na maṃ maññe ito pubbe mātā piyāyati. Na hi me aññadā tāya natthipūvā nāma pakkapubbā’’ti. So gantvā mātaraṃ evamāha – ‘‘amma, nāhaṃ tava piyo’’ti. Tāta, kiṃ vadesi, mama akkhīhipi hadayamaṃsatopi tvaṃ piyataroti. Sacāhaṃ, amma, tava piyo, kasmā mama pubbe evarūpe natthipūve nāma na adāsīti. Sā taṃ purisaṃ pucchi – ‘‘tāta, kiñci pātiyaṃ ahosī’’ti. Āma, ayye, pūvānaṃ pāti paripuṇṇā ahosi, na me evarūpā diṭṭhapubbāti. Sā cintesi – ‘‘putto me katapuñño, devatāhissa dibbapūvā pahitā bhavissantī’’ti. Sopi mātaraṃ āha – ‘‘amma, na mayā evarūpā ",
      " pūvā khāditapubbā, ito paṭṭhāya me natthipūvameva paceyyāsī’’ti. Sā tato paṭṭhāya tena ‘‘pūve khāditukāmomhī’’ti vuttakāle suvaṇṇapātiṃ dhovitvā aññāya pātiyā paṭikujjitvā ",
      " pahiṇati, devatā pātiṃ pūrenti. Evaṃ so agāramajjhe vasanto natthīti padassa atthaṃ ajānitvā dibbapūveyeva paribhuñji."
    ],
    "innerText": "Anuruddhopi cintesi – ‘‘na maṃ maññe ito pubbe mātā piyāyati. Na hi me aññadā tāya natthipūvā nāma pakkapubbā’’ti. So gantvā mātaraṃ evamāha – ‘‘amma, nāhaṃ tava piyo’’ti. Tāta, kiṃ vadesi, mama akkhīhipi hadayamaṃsatopi tvaṃ piyataroti. Sacāhaṃ, amma, tava piyo, kasmā mama pubbe evarūpe natthipūve nāma na adāsīti. Sā taṃ purisaṃ pucchi – ‘‘tāta, kiñci pātiyaṃ ahosī’’ti. Āma, ayye, pūvānaṃ pāti paripuṇṇā ahosi, na me evarūpā diṭṭhapubbāti. Sā cintesi – ‘‘putto me katapuñño, devatāhissa dibbapūvā pahitā bhavissantī’’ti. Sopi mātaraṃ āha – ‘‘amma, na mayā evarūpā pūvā khāditapubbā, ito paṭṭhāya me natthipūvameva paceyyāsī’’ti. Sā tato paṭṭhāya tena ‘‘pūve khāditukāmomhī’’ti vuttakāle suvaṇṇapātiṃ dhovitvā aññāya pātiyā paṭikujjitvā pahiṇati, devatā pātiṃ pūrenti. Evaṃ so agāramajjhe vasanto natthīti padassa atthaṃ ajānitvā dibbapūveyeva paribhuñji."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Satthu pana parivāratthaṃ kulapaṭipāṭiyā sākiyakumāresu pabbajantesu mahānāmena sakkena, ‘‘tāta, amhākaṃ kulā koci pabbajito natthi, tayā vā pabbajitabbaṃ, mayā vā’’ti vutte so āha – ‘‘ahaṃ atisukhumālo pabbajituṃ na sakkhissāmī’’ti. Tena hi kammantaṃ uggaṇha, ahaṃ pabbajissāmīti. Ko esa kammanto nāmāti? So hi bhattassa uṭṭhānaṭṭhānampi na jānāti, kammantaṃ kimeva jānissati, tasmā evamāha. Ekadivasañhi ",
      " anuruddho bhaddiyo kimiloti tayo janā ‘‘bhattaṃ nāma kahaṃ uṭṭhātī’’ti mantayiṃsu. Tesu kimilo ‘‘koṭṭhesu uṭṭhātī’’ti āha. So kirekadivasaṃ vīhī koṭṭhamhi pakkhipante addasa, tasmā ‘‘koṭṭhe bhattaṃ uppajjatī’’ti saññāya evamāha. Atha naṃ bhaddiyo ‘‘tvaṃ na jānāsī’’ti vatvā ‘‘bhattaṃ nāma ukkhaliyaṃ uṭṭhātī’’ti āha. So kirekadivasaṃ ukkhalito bhattaṃ vaḍḍhente disvā ‘‘etthevetaṃ uppajjatī’’ti saññamakāsi, tasmā evamāha. Anuruddho te ubhopi ‘‘tumhe na jānāthā’’ti vatvā ‘‘bhattaṃ nāma ratanubbedhamakuḷāya ",
      " mahāsuvaṇṇapātiyaṃ uṭṭhātī’’ti āha. Tena kira neva vīhiṃ koṭṭentā, na bhattaṃ pacantā diṭṭhapubbā, suvaṇṇapātiyaṃ vaḍḍhetvā purato ṭhapitabhattameva passati, tasmā ‘‘pātiyaṃyevetaṃ uppajjatī’’ti saññamakāsi, tasmā evamāha. Evaṃ bhattuṭṭhānaṭṭhānampi ajānanto mahāpuñño kulaputto kammante kiṃ jānissati."
    ],
    "innerText": "Satthu pana parivāratthaṃ kulapaṭipāṭiyā sākiyakumāresu pabbajantesu mahānāmena sakkena, ‘‘tāta, amhākaṃ kulā koci pabbajito natthi, tayā vā pabbajitabbaṃ, mayā vā’’ti vutte so āha – ‘‘ahaṃ atisukhumālo pabbajituṃ na sakkhissāmī’’ti. Tena hi kammantaṃ uggaṇha, ahaṃ pabbajissāmīti. Ko esa kammanto nāmāti? So hi bhattassa uṭṭhānaṭṭhānampi na jānāti, kammantaṃ kimeva jānissati, tasmā evamāha. Ekadivasañhi anuruddho bhaddiyo kimiloti tayo janā ‘‘bhattaṃ nāma kahaṃ uṭṭhātī’’ti mantayiṃsu. Tesu kimilo ‘‘koṭṭhesu uṭṭhātī’’ti āha. So kirekadivasaṃ vīhī koṭṭhamhi pakkhipante addasa, tasmā ‘‘koṭṭhe bhattaṃ uppajjatī’’ti saññāya evamāha. Atha naṃ bhaddiyo ‘‘tvaṃ na jānāsī’’ti vatvā ‘‘bhattaṃ nāma ukkhaliyaṃ uṭṭhātī’’ti āha. So kirekadivasaṃ ukkhalito bhattaṃ vaḍḍhente disvā ‘‘etthevetaṃ uppajjatī’’ti saññamakāsi, tasmā evamāha. Anuruddho te ubhopi ‘‘tumhe na jānāthā’’ti vatvā ‘‘bhattaṃ nāma ratanubbedhamakuḷāya mahāsuvaṇṇapātiyaṃ uṭṭhātī’’ti āha. Tena kira neva vīhiṃ koṭṭentā, na bhattaṃ pacantā diṭṭhapubbā, suvaṇṇapātiyaṃ vaḍḍhetvā purato ṭhapitabhattameva passati, tasmā ‘‘pātiyaṃyevetaṃ uppajjatī’’ti saññamakāsi, tasmā evamāha. Evaṃ bhattuṭṭhānaṭṭhānampi ajānanto mahāpuñño kulaputto kammante kiṃ jānissati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "So ‘‘ehi kho te, anuruddha, gharāvāsatthaṃ anusāsissāmi, paṭhamaṃ khettaṃ kasāpetabba’’ntiādinā nayena bhātarā vuttānaṃ kammantānaṃ apariyantabhāvaṃ sutvā ‘‘na me gharāvāsena attho’’ti mātaraṃ āpucchitvā bhaddiyapamukhehi pañcahi sākiyakumārehi saddhiṃ nikkhamitvā anupiyambavane satthāraṃ upasaṅkamitvā pabbaji. Pabbajitvā ca pana sammāpaṭipadaṃ paṭipanno anupubbena tisso vijjā sacchikatvā dibbena cakkhunā ekāsane nisinnova hatthatale ṭhapitaāmalakāni viya sahassalokadhātuyo olokanasamattho hutvā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Pubbenivāsaṃ jānāmi, dibbacakkhu visodhitaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tevijjo iddhipattomhi, kataṃ buddhassa sāsana’’nti. (theragā. 332, 562) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Udānaṃ ",
      " udānetvā ‘‘kiṃ nu kho me katvā ayaṃ sampatti laddhā’’ti olokento ‘‘padumuttarapādamūle patthanaṃ ṭhapesi’’nti ñatvā puna ‘‘saṃsāre saṃsaranto asukasmiṃ nāma kāle bārāṇasiyaṃ sumanaseṭṭhiṃ nissāya jīvanto annabhāro nāma ahosi’’ntipi ñatvā –"
    ],
    "innerText": "Udānaṃ udānetvā ‘‘kiṃ nu kho me katvā ayaṃ sampatti laddhā’’ti olokento ‘‘padumuttarapādamūle patthanaṃ ṭhapesi’’nti ñatvā puna ‘‘saṃsāre saṃsaranto asukasmiṃ nāma kāle bārāṇasiyaṃ sumanaseṭṭhiṃ nissāya jīvanto annabhāro nāma ahosi’’ntipi ñatvā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Annabhāro ",
      " pure āsiṃ, daliddo tiṇahārako;"
    ],
    "innerText": "‘‘Annabhāro pure āsiṃ, daliddo tiṇahārako;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Piṇḍapāto mayā dinno, upariṭṭhassa tādino’’ti. –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Āha ",
      ". Athassa etadahosi – ‘‘yo so tadā mayā upariṭṭhassa dinnapiṇḍapātato kahāpaṇe datvā pattiṃ aggahesi, mama sahāyako sumanaseṭṭhi kahaṃ nu kho so etarahi nibbatto’’ti. Atha naṃ ‘‘viñjhāṭaviyaṃ pabbatapāde muṇḍanigamo nāma atthi, tattha mahāmuṇḍassa nāma upāsakassa mahāsumano cūḷasumanoti dve puttā, tesu so cūḷasumano hutvā nibbatto’’ti addasa. Disvā ca pana cintesi – ‘‘atthi nu kho tattha mayi gate upakāro, natthī’’ti. So upadhārento idaṃ addasa ‘‘so tattha mayi gate sattavassikova nikkhamitvā pabbajissati, khuraggeyeva ca arahattaṃ pāpuṇissatī’’ti. Disvā ca pana upakaṭṭhe antovasse ākāsena gantvā gāmadvāre otari. Mahāmuṇḍo pana upāsako therassa pubbepi vissāsiko eva. So theraṃ piṇḍapātakāle cīvaraṃ pārupantaṃ disvā puttaṃ mahāsumanaṃ āha – ‘‘tāta, ayyo, me anuruddhatthero āgato, yāvassa añño koci pattaṃ na gaṇhāti, tāvassa gantvā pattaṃ gaṇha, ahaṃ āsanaṃ paññāpessāmī’’ti. So tathā akāsi. Upāsako theraṃ antonivesane sakkaccaṃ parivisitvā temāsaṃ vasanatthāya paṭiññaṃ gaṇhi, theropi adhivāsesi."
    ],
    "innerText": "Āha . Athassa etadahosi – ‘‘yo so tadā mayā upariṭṭhassa dinnapiṇḍapātato kahāpaṇe datvā pattiṃ aggahesi, mama sahāyako sumanaseṭṭhi kahaṃ nu kho so etarahi nibbatto’’ti. Atha naṃ ‘‘viñjhāṭaviyaṃ pabbatapāde muṇḍanigamo nāma atthi, tattha mahāmuṇḍassa nāma upāsakassa mahāsumano cūḷasumanoti dve puttā, tesu so cūḷasumano hutvā nibbatto’’ti addasa. Disvā ca pana cintesi – ‘‘atthi nu kho tattha mayi gate upakāro, natthī’’ti. So upadhārento idaṃ addasa ‘‘so tattha mayi gate sattavassikova nikkhamitvā pabbajissati, khuraggeyeva ca arahattaṃ pāpuṇissatī’’ti. Disvā ca pana upakaṭṭhe antovasse ākāsena gantvā gāmadvāre otari. Mahāmuṇḍo pana upāsako therassa pubbepi vissāsiko eva. So theraṃ piṇḍapātakāle cīvaraṃ pārupantaṃ disvā puttaṃ mahāsumanaṃ āha – ‘‘tāta, ayyo, me anuruddhatthero āgato, yāvassa añño koci pattaṃ na gaṇhāti, tāvassa gantvā pattaṃ gaṇha, ahaṃ āsanaṃ paññāpessāmī’’ti. So tathā akāsi. Upāsako theraṃ antonivesane sakkaccaṃ parivisitvā temāsaṃ vasanatthāya paṭiññaṃ gaṇhi, theropi adhivāsesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha naṃ ekadivasaṃ paṭijagganto viya ",
      " temāsaṃ paṭijaggitvā mahāpavāraṇāya ticīvarañceva guḷatelataṇḍulādīni ca āharitvā therassa pādamūle ṭhapetvā ‘‘gaṇhatha, bhante’’ti āha. ‘‘Alaṃ, upāsaka, na me iminā attho’’ti. ‘‘Tena hi, bhante, vassāvāsikalābho nāmesa, gaṇhatha na’’nti? ‘‘Na gaṇhāmi, upāsakā’’ti. ‘‘Kimatthaṃ na gaṇhatha, bhante’’ti? ‘‘Mayhaṃ santike kappiyakārako sāmaṇeropi natthī’’ti. ‘‘Tena hi, bhante, mama putto mahāsumano sāmaṇero bhavissatī’’ti. ‘‘Na me, upāsaka, mahāsumanenattho’’ti. ‘‘Tena hi, bhante, cūḷasumanaṃ pabbājethā’’ti. Thero ‘‘sādhū’’ti sampaṭicchitvā cūḷasumanaṃ pabbājesi. So khuraggeyeva arahattaṃ pāpuṇi. Thero tena saddhiṃ aḍḍhamāsamattaṃ tattheva vasitvā ‘‘satthāraṃ passissāmī’’ti tassa ñātake āpucchitvā ākāseneva gantvā himavantapadese araññakuṭikāya otari."
    ],
    "innerText": "Atha naṃ ekadivasaṃ paṭijagganto viya temāsaṃ paṭijaggitvā mahāpavāraṇāya ticīvarañceva guḷatelataṇḍulādīni ca āharitvā therassa pādamūle ṭhapetvā ‘‘gaṇhatha, bhante’’ti āha. ‘‘Alaṃ, upāsaka, na me iminā attho’’ti. ‘‘Tena hi, bhante, vassāvāsikalābho nāmesa, gaṇhatha na’’nti? ‘‘Na gaṇhāmi, upāsakā’’ti. ‘‘Kimatthaṃ na gaṇhatha, bhante’’ti? ‘‘Mayhaṃ santike kappiyakārako sāmaṇeropi natthī’’ti. ‘‘Tena hi, bhante, mama putto mahāsumano sāmaṇero bhavissatī’’ti. ‘‘Na me, upāsaka, mahāsumanenattho’’ti. ‘‘Tena hi, bhante, cūḷasumanaṃ pabbājethā’’ti. Thero ‘‘sādhū’’ti sampaṭicchitvā cūḷasumanaṃ pabbājesi. So khuraggeyeva arahattaṃ pāpuṇi. Thero tena saddhiṃ aḍḍhamāsamattaṃ tattheva vasitvā ‘‘satthāraṃ passissāmī’’ti tassa ñātake āpucchitvā ākāseneva gantvā himavantapadese araññakuṭikāya otari."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Thero ",
      " pana pakatiyāpi āraddhavīriyo, tassa tattha pubbarattāpararattaṃ caṅkamantassa udaravāto samuṭṭhahi. Atha naṃ kilantarūpaṃ disvā sāmaṇero pucchi – ‘‘bhante, kiṃ vo rujjatī’’ti? ‘‘Udaravāto me samuṭṭhito’’ti ",
      ". ‘‘Aññadāpi samuṭṭhitapubbo, bhante’’ti? ‘‘Āmāvuso’’ti. ‘‘Kena phāsukaṃ hoti, bhante’’ti? ‘‘Anotattato pānīye laddhe phāsukaṃ hoti, āvuso’’ti. ‘‘Tena hi, bhante, āharāmī’’ti. ‘‘Sakkhissasi sāmaṇerā’’ti? ‘‘Āma, bhante’’ti. Tena hi anotatte pannago nāma nāgarājā maṃ jānāti, tassa ācikkhitvā bhesajjatthāya ekaṃ pānīyavārakaṃ āharāti. So sādhūti upajjhāyaṃ vanditvā vehāsaṃ abbhuggantvā pañcayojanasataṃ ṭhānaṃ agamāsi ",
      ". Taṃ divasaṃ pana nāgarājā nāganāṭakaparivuto udakakīḷaṃ kīḷitukāmo hoti. So sāmaṇeraṃ āgacchantaṃ disvāva kujjhi, ‘‘ayaṃ muṇḍakasamaṇo attano pādapaṃsuṃ mama matthake okiranto vicarati, anotatte pānīyatthāya āgato bhavissati, na dānissa pānīyaṃ dassāmī’’ti paṇṇāsayojanikaṃ anotattadahaṃ mahāpātiyā ukkhaliṃ pidahanto viya phaṇena pidahitvā nipajji. Sāmaṇero nāgarājassa ākāraṃ oloketvāva ‘‘kuddho aya’’nti ñatvā imaṃ gāthamāha –"
    ],
    "innerText": "Thero pana pakatiyāpi āraddhavīriyo, tassa tattha pubbarattāpararattaṃ caṅkamantassa udaravāto samuṭṭhahi. Atha naṃ kilantarūpaṃ disvā sāmaṇero pucchi – ‘‘bhante, kiṃ vo rujjatī’’ti? ‘‘Udaravāto me samuṭṭhito’’ti . ‘‘Aññadāpi samuṭṭhitapubbo, bhante’’ti? ‘‘Āmāvuso’’ti. ‘‘Kena phāsukaṃ hoti, bhante’’ti? ‘‘Anotattato pānīye laddhe phāsukaṃ hoti, āvuso’’ti. ‘‘Tena hi, bhante, āharāmī’’ti. ‘‘Sakkhissasi sāmaṇerā’’ti? ‘‘Āma, bhante’’ti. Tena hi anotatte pannago nāma nāgarājā maṃ jānāti, tassa ācikkhitvā bhesajjatthāya ekaṃ pānīyavārakaṃ āharāti. So sādhūti upajjhāyaṃ vanditvā vehāsaṃ abbhuggantvā pañcayojanasataṃ ṭhānaṃ agamāsi . Taṃ divasaṃ pana nāgarājā nāganāṭakaparivuto udakakīḷaṃ kīḷitukāmo hoti. So sāmaṇeraṃ āgacchantaṃ disvāva kujjhi, ‘‘ayaṃ muṇḍakasamaṇo attano pādapaṃsuṃ mama matthake okiranto vicarati, anotatte pānīyatthāya āgato bhavissati, na dānissa pānīyaṃ dassāmī’’ti paṇṇāsayojanikaṃ anotattadahaṃ mahāpātiyā ukkhaliṃ pidahanto viya phaṇena pidahitvā nipajji. Sāmaṇero nāgarājassa ākāraṃ oloketvāva ‘‘kuddho aya’’nti ñatvā imaṃ gāthamāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Suṇohi me nāgarāja, uggateja mahabbala;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dehi me pānīyaghaṭaṃ, bhesajjatthamhi āgato’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Taṃ sutvā nāgarājā imaṃ gāthamāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Puratthimasmiṃ disābhāge, gaṅgā nāma mahānadī;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Mahāsamuddamappeti, tato tvaṃ pānīyaṃ harā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Taṃ sutvā sāmaṇero ‘‘ayaṃ nāgarājā attano icchāya na dassati, ahaṃ balakkāraṃ katvā ānubhāvaṃ jānāpetvā imaṃ abhibhavitvāva pānīyaṃ gaṇhissāmī’’ti cintetvā, ‘‘mahārāja ",
      ", upajjhāyo maṃ anotattatova pānīyaṃ āharāpeti, tenāhaṃ idameva harissāmi, apehi, mā maṃ vārehī’’ti vatvā imaṃ gāthamāha –"
    ],
    "innerText": "Taṃ sutvā sāmaṇero ‘‘ayaṃ nāgarājā attano icchāya na dassati, ahaṃ balakkāraṃ katvā ānubhāvaṃ jānāpetvā imaṃ abhibhavitvāva pānīyaṃ gaṇhissāmī’’ti cintetvā, ‘‘mahārāja , upajjhāyo maṃ anotattatova pānīyaṃ āharāpeti, tenāhaṃ idameva harissāmi, apehi, mā maṃ vārehī’’ti vatvā imaṃ gāthamāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Itova pānīyaṃ hāssaṃ, imināvamhi atthiko;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yadi te thāmabalaṃ atthi, nāgarāja nivārayā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " naṃ nāgarājā āha –"
    ],
    "innerText": "Atha naṃ nāgarājā āha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sāmaṇera sace atthi, tava vikkama porisaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Abhinandāmi te vācaṃ, harassu pānīyaṃ mamā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " naṃ sāmaṇero ‘‘evaṃ, mahārāja, harāmī’’ti vatvā ‘‘yadi sakkonto harāhī’’ti vutte – ‘‘tena hi suṭṭhu jānassū’’ti tikkhattuṃ paṭiññaṃ gahetvā ‘‘buddhasāsanassa ānubhāvaṃ dassetvā mayā pānīyaṃ harituṃ vaṭṭatī’’ti cintetvā ākāsaṭṭhadevatānaṃ tāva santikaṃ agamāsi. Tā āgantvā vanditvā ‘‘kiṃ, bhante’’ti vatvā aṭṭhaṃsu. ‘‘Etasmiṃ anotattadahapiṭṭhe pannaganāgarājena saddhiṃ mama saṅgāmo bhavissati, tattha gantvā jayaparājayaṃ olokethā’’ti āha. So eteneva nīhārena cattāro lokapāle sakkasuyāmasantusitaparanimmitavasavattī ca upasaṅkamitvā tamatthaṃ ārocesi. Tato paraṃ paṭipāṭiyā yāva brahmalokaṃ gantvā tattha tattha brahmehi āgantvā ",
      " vanditvā ṭhitehi ‘‘kiṃ, bhante’’ti puṭṭho tamatthaṃ ārocesi. Evaṃ so asaññe ca arūpibrahmāno ca ṭhapetvā sabbattha muhutteneva āhiṇḍitvā ārocesi. Tassa vacanaṃ sutvā sabbāpi devatā anotattadahapiṭṭhe nāḷiyaṃ pakkhittāni piṭṭhacuṇṇāni viya ākāsaṃ nirantaraṃ pūretvā sannipatiṃsu. Sannipatite devasaṅghe sāmaṇero ākāse ṭhatvā nāgarājaṃ āha –"
    ],
    "innerText": "Atha naṃ sāmaṇero ‘‘evaṃ, mahārāja, harāmī’’ti vatvā ‘‘yadi sakkonto harāhī’’ti vutte – ‘‘tena hi suṭṭhu jānassū’’ti tikkhattuṃ paṭiññaṃ gahetvā ‘‘buddhasāsanassa ānubhāvaṃ dassetvā mayā pānīyaṃ harituṃ vaṭṭatī’’ti cintetvā ākāsaṭṭhadevatānaṃ tāva santikaṃ agamāsi. Tā āgantvā vanditvā ‘‘kiṃ, bhante’’ti vatvā aṭṭhaṃsu. ‘‘Etasmiṃ anotattadahapiṭṭhe pannaganāgarājena saddhiṃ mama saṅgāmo bhavissati, tattha gantvā jayaparājayaṃ olokethā’’ti āha. So eteneva nīhārena cattāro lokapāle sakkasuyāmasantusitaparanimmitavasavattī ca upasaṅkamitvā tamatthaṃ ārocesi. Tato paraṃ paṭipāṭiyā yāva brahmalokaṃ gantvā tattha tattha brahmehi āgantvā vanditvā ṭhitehi ‘‘kiṃ, bhante’’ti puṭṭho tamatthaṃ ārocesi. Evaṃ so asaññe ca arūpibrahmāno ca ṭhapetvā sabbattha muhutteneva āhiṇḍitvā ārocesi. Tassa vacanaṃ sutvā sabbāpi devatā anotattadahapiṭṭhe nāḷiyaṃ pakkhittāni piṭṭhacuṇṇāni viya ākāsaṃ nirantaraṃ pūretvā sannipatiṃsu. Sannipatite devasaṅghe sāmaṇero ākāse ṭhatvā nāgarājaṃ āha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Suṇohi me nāgarāja, uggateja mahabbala;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dehi me pānīyaghaṭaṃ, bhesajjatthamhi āgato’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha naṃ nāgo āha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sāmaṇera sace atthi, tava vikkama porisaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Abhinandāmi te vācaṃ, harassu pānīyaṃ mamā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "So tikkhattuṃ nāgarājassa paṭiññaṃ gahetvā ākāse ṭhitakova dvādasayojanikaṃ brahmattabhāvaṃ māpetvā ākāsato oruyha nāgarājassa phaṇe akkamitvā adhomukhaṃ nippīḷesi, tāvadeva balavatā purisena akkantaallacammaṃ viya nāgarājassa phaṇe akkantamatte ogalitvā dabbimattā phaṇapuṭakā ahesuṃ. Nāgarājassa phaṇehi muttamuttaṭṭhānato tālakkhandhapamāṇā ",
      " udakavaṭṭiyo uggañchiṃsu. Sāmaṇero ākāseyeva pānīyavārakaṃ ",
      " pūresi. Devasaṅgho sādhukāramadāsi. Atha nāgarājā ",
      " lajjitvā sāmaṇerassa kujjhi, jayakusumavaṇṇānissa akkhīni ahesuṃ. So ‘‘ayaṃ maṃ devasaṅghaṃ sannipātetvā pānīyaṃ gahetvā lajjāpesi, etaṃ gahetvā mukhe hatthaṃ pakkhipitvā hadayamaṃsaṃ vāssa maddāmi, pāde vā naṃ gahetvā pāragaṅgāyaṃ khipāmī’’ti vegena anubandhi. Anubandhantopi naṃ pāpuṇituṃ nāsakkhiyeva. Sāmaṇero gantvā upajjhāyassa hatthe pānīyaṃ ṭhapetvā ‘‘pivatha, bhante’’ti āha. Nāgarājāpi pacchato āgantvā, ‘‘bhante anuruddha, sāmaṇero mayā adinnameva pānīyaṃ gahetvā āgato, mā pivitthā’’ti āha. Evaṃ kira sāmaṇerāti. ‘‘Pivatha, bhante, iminā me dinnaṃ pānīyaṃ āhaṭa’’nti āha. Thero ‘‘khīṇāsavasāmaṇerassa musākathanaṃ nāma natthī’’ti ñatvā pānīyaṃ pivi. Taṅkhaṇaññevassa ābādho paṭipassambhi. Puna nāgo theraṃ āha – ‘‘bhante, sāmaṇerenamhi sabbaṃ devagaṇaṃ sannipātetvā lajjāpito, ahamassa hadayaṃ vā phālessāmi, pāde vā naṃ gahetvā pāragaṅgāya khipissāmī’’ti. Mahārāja, sāmaṇero mahānubhāvo, tumhe sāmaṇerena saddhiṃ saṅgāmetuṃ na sakkhissatha ",
      ", khamāpetvā naṃ gacchathāti. So sayampi sāmaṇerassa ānubhāvaṃ jānātiyeva, lajjāya pana anubandhitvā āgato. Atha naṃ therassa vacanena khamāpetvā tena saddhiṃ mittasanthavaṃ katvā ‘‘ito paṭṭhāya anotattaudakena atthe sati tumhākaṃ āgamanakiccaṃ natthi, mayhaṃ pahiṇeyyātha, ahameva āharitvā dassāmī’’ti vatvā pakkāmi."
    ],
    "innerText": "So tikkhattuṃ nāgarājassa paṭiññaṃ gahetvā ākāse ṭhitakova dvādasayojanikaṃ brahmattabhāvaṃ māpetvā ākāsato oruyha nāgarājassa phaṇe akkamitvā adhomukhaṃ nippīḷesi, tāvadeva balavatā purisena akkantaallacammaṃ viya nāgarājassa phaṇe akkantamatte ogalitvā dabbimattā phaṇapuṭakā ahesuṃ. Nāgarājassa phaṇehi muttamuttaṭṭhānato tālakkhandhapamāṇā udakavaṭṭiyo uggañchiṃsu. Sāmaṇero ākāseyeva pānīyavārakaṃ pūresi. Devasaṅgho sādhukāramadāsi. Atha nāgarājā lajjitvā sāmaṇerassa kujjhi, jayakusumavaṇṇānissa akkhīni ahesuṃ. So ‘‘ayaṃ maṃ devasaṅghaṃ sannipātetvā pānīyaṃ gahetvā lajjāpesi, etaṃ gahetvā mukhe hatthaṃ pakkhipitvā hadayamaṃsaṃ vāssa maddāmi, pāde vā naṃ gahetvā pāragaṅgāyaṃ khipāmī’’ti vegena anubandhi. Anubandhantopi naṃ pāpuṇituṃ nāsakkhiyeva. Sāmaṇero gantvā upajjhāyassa hatthe pānīyaṃ ṭhapetvā ‘‘pivatha, bhante’’ti āha. Nāgarājāpi pacchato āgantvā, ‘‘bhante anuruddha, sāmaṇero mayā adinnameva pānīyaṃ gahetvā āgato, mā pivitthā’’ti āha. Evaṃ kira sāmaṇerāti. ‘‘Pivatha, bhante, iminā me dinnaṃ pānīyaṃ āhaṭa’’nti āha. Thero ‘‘khīṇāsavasāmaṇerassa musākathanaṃ nāma natthī’’ti ñatvā pānīyaṃ pivi. Taṅkhaṇaññevassa ābādho paṭipassambhi. Puna nāgo theraṃ āha – ‘‘bhante, sāmaṇerenamhi sabbaṃ devagaṇaṃ sannipātetvā lajjāpito, ahamassa hadayaṃ vā phālessāmi, pāde vā naṃ gahetvā pāragaṅgāya khipissāmī’’ti. Mahārāja, sāmaṇero mahānubhāvo, tumhe sāmaṇerena saddhiṃ saṅgāmetuṃ na sakkhissatha , khamāpetvā naṃ gacchathāti. So sayampi sāmaṇerassa ānubhāvaṃ jānātiyeva, lajjāya pana anubandhitvā āgato. Atha naṃ therassa vacanena khamāpetvā tena saddhiṃ mittasanthavaṃ katvā ‘‘ito paṭṭhāya anotattaudakena atthe sati tumhākaṃ āgamanakiccaṃ natthi, mayhaṃ pahiṇeyyātha, ahameva āharitvā dassāmī’’ti vatvā pakkāmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Theropi sāmaṇeraṃ ādāya pāyāsi. Satthā therassa āgamanabhāvaṃ ñatvā migāramātupāsāde therassa āgamanaṃ olokento nisīdi. Bhikkhūpi theraṃ āgacchantaṃ disvā paccuggantvā pattacīvaraṃ paṭiggahesuṃ. Athekacce sāmaṇeraṃ sīsepi kaṇṇesupi bāhāyampi gahetvā sañcāletvā ‘‘kiṃ, sāmaṇera cūḷakaniṭṭha, na ukkaṇṭhitosī’’ti āhaṃsu. Satthā tesaṃ kiriyaṃ disvā cintesi – ‘‘bhāriyaṃ vatimesaṃ bhikkhūnaṃ kammaṃ āsīvisaṃ gīvāya gaṇhantā viya sāmaṇeraṃ gaṇhanti, nāssa ānubhāvaṃ jānanti, ajja mayā sumanasāmaṇerassa guṇaṃ pākaṭaṃ kātuṃ vaṭṭatī’’ti. Theropi āgantvā satthāraṃ vanditvā nisīdi. Satthā tena saddhiṃ paṭisanthāraṃ katvā ānandattheraṃ āmantesi – ‘‘ānanda, anotattaudakenamhi pāde dhovitukāmo ",
      ", sāmaṇerānaṃ ghaṭaṃ datvā pānīyaṃ āharāpehī’’ti. Thero vihāre pañcamattāni ",
      " sāmaṇerasatāni sannipātesi. Tesu sumanasāmaṇero sabbanavako ahosi. Thero sabbamahallakaṃ sāmaṇeraṃ āha – ‘‘sāmaṇera, satthā anokattadahaudakena pāde dhovitukāmo, ghaṭaṃ ādāya gantvā pānīyaṃ āharā’’ti. So ‘‘na sakkomi, bhante’’ti na icchi. Thero sesepi paṭipāṭiyā pucchi, tepi tatheva vatvā paṭikkhipiṃsu. ‘‘Kiṃ panettha khīṇāsavasāmaṇerā natthī’’ti? Atthi, te pana ‘‘nāyaṃ amhākaṃ baddho ",
      " mālāpuṭo, sumanasāmaṇerasseva baddho’’ti na icchiṃsu, puthujjanā pana attano asamatthatāyeva na icchiṃsu. Pariyosāne pana sumanassa vāre sampatte, ‘‘sāmaṇera, satthā anotattadahaudakena pāde dhovitukāmo, kuṭaṃ ādāya kira udakaṃ āharā’’ti āha. So ‘‘satthari āharāpente āharissāmī’’ti satthāraṃ vanditvā, ‘‘bhante, anotattato kira maṃ udakaṃ āhārāpethā’’ti āha. ‘‘Āma, sumanā’’ti. So visākhāya kāritesu ghanasuvaṇṇakoṭṭimesu senāsanakuṭesu ekaṃ saṭṭhikuṭaudakagaṇhanakaṃ mahāghaṭaṃ hatthena gahetvā ‘‘iminā me ukkhipitvā aṃsakūṭe ṭhapitena attho natthī’’ti olambakaṃ katvā vehāsaṃ abbhuggantvā himavantābhimukho pakkhandi."
    ],
    "innerText": "Theropi sāmaṇeraṃ ādāya pāyāsi. Satthā therassa āgamanabhāvaṃ ñatvā migāramātupāsāde therassa āgamanaṃ olokento nisīdi. Bhikkhūpi theraṃ āgacchantaṃ disvā paccuggantvā pattacīvaraṃ paṭiggahesuṃ. Athekacce sāmaṇeraṃ sīsepi kaṇṇesupi bāhāyampi gahetvā sañcāletvā ‘‘kiṃ, sāmaṇera cūḷakaniṭṭha, na ukkaṇṭhitosī’’ti āhaṃsu. Satthā tesaṃ kiriyaṃ disvā cintesi – ‘‘bhāriyaṃ vatimesaṃ bhikkhūnaṃ kammaṃ āsīvisaṃ gīvāya gaṇhantā viya sāmaṇeraṃ gaṇhanti, nāssa ānubhāvaṃ jānanti, ajja mayā sumanasāmaṇerassa guṇaṃ pākaṭaṃ kātuṃ vaṭṭatī’’ti. Theropi āgantvā satthāraṃ vanditvā nisīdi. Satthā tena saddhiṃ paṭisanthāraṃ katvā ānandattheraṃ āmantesi – ‘‘ānanda, anotattaudakenamhi pāde dhovitukāmo , sāmaṇerānaṃ ghaṭaṃ datvā pānīyaṃ āharāpehī’’ti. Thero vihāre pañcamattāni sāmaṇerasatāni sannipātesi. Tesu sumanasāmaṇero sabbanavako ahosi. Thero sabbamahallakaṃ sāmaṇeraṃ āha – ‘‘sāmaṇera, satthā anokattadahaudakena pāde dhovitukāmo, ghaṭaṃ ādāya gantvā pānīyaṃ āharā’’ti. So ‘‘na sakkomi, bhante’’ti na icchi. Thero sesepi paṭipāṭiyā pucchi, tepi tatheva vatvā paṭikkhipiṃsu. ‘‘Kiṃ panettha khīṇāsavasāmaṇerā natthī’’ti? Atthi, te pana ‘‘nāyaṃ amhākaṃ baddho mālāpuṭo, sumanasāmaṇerasseva baddho’’ti na icchiṃsu, puthujjanā pana attano asamatthatāyeva na icchiṃsu. Pariyosāne pana sumanassa vāre sampatte, ‘‘sāmaṇera, satthā anotattadahaudakena pāde dhovitukāmo, kuṭaṃ ādāya kira udakaṃ āharā’’ti āha. So ‘‘satthari āharāpente āharissāmī’’ti satthāraṃ vanditvā, ‘‘bhante, anotattato kira maṃ udakaṃ āhārāpethā’’ti āha. ‘‘Āma, sumanā’’ti. So visākhāya kāritesu ghanasuvaṇṇakoṭṭimesu senāsanakuṭesu ekaṃ saṭṭhikuṭaudakagaṇhanakaṃ mahāghaṭaṃ hatthena gahetvā ‘‘iminā me ukkhipitvā aṃsakūṭe ṭhapitena attho natthī’’ti olambakaṃ katvā vehāsaṃ abbhuggantvā himavantābhimukho pakkhandi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nāgarājā sāmaṇeraṃ dūratova āgacchantaṃ disvā paccuggantvā kuṭaṃ ",
      " aṃsakūṭena ādāya, ‘‘bhante, tumhe mādise dāse vijjamāne kasmā sayaṃ āgatā, udakenatthe sati kasmā sāsanamattampi na pahiṇathā’’ti kuṭena udakaṃ ādāya sayaṃ ukkhipitvā ‘‘purato hotha, bhante, ahameva āharissāmī’’ti āha. ‘‘Tiṭṭhatha tumhe, mahārāja, ahameva sammāsambuddhena āṇatto’’ti nāgarājānaṃ nivattāpetvā kuṭaṃ mukhavaṭṭiyaṃ hatthena gahetvā ākāsenāgañchi. Atha naṃ satthā āgacchantaṃ oloketvā bhikkhū āmantesi – ‘‘passatha, bhikkhave, sāmaṇerassa līlaṃ, ākāse haṃsarājā viya sobhatī’’ti āha. Sopi pānīyaghaṭaṃ ṭhapetvā satthāraṃ vanditvā aṭṭhāsi. Atha naṃ satthā āha – ‘‘kativassosi tvaṃ, sumanā’’ti? ‘‘Sattavassomhi, bhanteti. ‘‘Tena hi, sumana, ajja paṭṭhāya bhikkhu hohī’’ti vatvā dāyajjaupasampadaṃ adāsi. Dveyeva ",
      " kira sāmaṇerā sattavassikā upasampadaṃ labhiṃsu – ayañca sumano sopāko cāti."
    ],
    "innerText": "Nāgarājā sāmaṇeraṃ dūratova āgacchantaṃ disvā paccuggantvā kuṭaṃ aṃsakūṭena ādāya, ‘‘bhante, tumhe mādise dāse vijjamāne kasmā sayaṃ āgatā, udakenatthe sati kasmā sāsanamattampi na pahiṇathā’’ti kuṭena udakaṃ ādāya sayaṃ ukkhipitvā ‘‘purato hotha, bhante, ahameva āharissāmī’’ti āha. ‘‘Tiṭṭhatha tumhe, mahārāja, ahameva sammāsambuddhena āṇatto’’ti nāgarājānaṃ nivattāpetvā kuṭaṃ mukhavaṭṭiyaṃ hatthena gahetvā ākāsenāgañchi. Atha naṃ satthā āgacchantaṃ oloketvā bhikkhū āmantesi – ‘‘passatha, bhikkhave, sāmaṇerassa līlaṃ, ākāse haṃsarājā viya sobhatī’’ti āha. Sopi pānīyaghaṭaṃ ṭhapetvā satthāraṃ vanditvā aṭṭhāsi. Atha naṃ satthā āha – ‘‘kativassosi tvaṃ, sumanā’’ti? ‘‘Sattavassomhi, bhanteti. ‘‘Tena hi, sumana, ajja paṭṭhāya bhikkhu hohī’’ti vatvā dāyajjaupasampadaṃ adāsi. Dveyeva kira sāmaṇerā sattavassikā upasampadaṃ labhiṃsu – ayañca sumano sopāko cāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ tasmiṃ upasampanne dhammasabhāyaṃ kathaṃ samuṭṭhāpesuṃ, ‘‘acchariyaṃ āvuso, evarūpo hi nāma daharasāmaṇerassa ānubhāvo hoti, na no ito pubbe evarūpo ānubhāvo diṭṭhapubbo’’ti. Satthā āgantvā ‘‘kāya nuttha, bhikkhave, etarahi kathāya sannisinnā’’ti pucchitvā ‘‘imāya nāmā’’ti vutte, ‘‘bhikkhave, mama sāsane daharopi sammā paṭipanno evarūpaṃ ",
      " sampattiṃ labhatiyevā’’ti vatvā dhammaṃ desento imaṃ gāthamāha –"
    ],
    "innerText": "Evaṃ tasmiṃ upasampanne dhammasabhāyaṃ kathaṃ samuṭṭhāpesuṃ, ‘‘acchariyaṃ āvuso, evarūpo hi nāma daharasāmaṇerassa ānubhāvo hoti, na no ito pubbe evarūpo ānubhāvo diṭṭhapubbo’’ti. Satthā āgantvā ‘‘kāya nuttha, bhikkhave, etarahi kathāya sannisinnā’’ti pucchitvā ‘‘imāya nāmā’’ti vutte, ‘‘bhikkhave, mama sāsane daharopi sammā paṭipanno evarūpaṃ sampattiṃ labhatiyevā’’ti vatvā dhammaṃ desento imaṃ gāthamāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "382"
      },
      "."
    ],
    "innerText": "382."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yo have daharo bhikkhu, yuñjati buddhasāsane;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Somaṃ lokaṃ pabhāseti, abbhā muttova candimā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yuñjatī"
      },
      "ti ghaṭati vāyamati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pabhāsetī"
      },
      "ti so bhikkhu attano arahattamaggañāṇena abbhādīhi mutto candimā viya lokaṃ khandhādibhedaṃ lokaṃ obhāseti, ekālokaṃ karotīti attho."
    ],
    "innerText": "Tattha yuñjatīti ghaṭati vāyamati. Pabhāsetīti so bhikkhu attano arahattamaggañāṇena abbhādīhi mutto candimā viya lokaṃ khandhādibhedaṃ lokaṃ obhāseti, ekālokaṃ karotīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Desanāvasāne bahū sotāpattiphalādīni pāpuṇiṃsūti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sumanasāmaṇeravatthu dvādasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Bhikkhuvaggavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pañcavīsatimo vaggo."
  }
]