[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "8. Pāṭaligāmiyavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Paṭhamanibbānapaṭisaṃyuttasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "71"
      },
      ". Pāṭaligāmiyavaggassa ",
      " paṭhame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nibbānapaṭisaṃyuttāyā"
      },
      "ti amatadhātusannissitāya asaṅkhatadhātuyā pavedanavasena pavattāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammiyā kathāyā"
      },
      "ti dhammadesanāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sandassetī"
      },
      "ti sabhāvasarasalakkhaṇato nibbānaṃ dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samādapetī"
      },
      "ti tameva atthaṃ te bhikkhū gaṇhāpeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samuttejetī"
      },
      "ti tadatthagahaṇe ussāhaṃ janento tejeti joteti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sampahaṃsetī"
      },
      "ti nibbānaguṇehi sammadeva sabbappakārehi toseti."
    ],
    "innerText": "71. Pāṭaligāmiyavaggassa paṭhame nibbānapaṭisaṃyuttāyāti amatadhātusannissitāya asaṅkhatadhātuyā pavedanavasena pavattāya. Dhammiyā kathāyāti dhammadesanāya. Sandassetīti sabhāvasarasalakkhaṇato nibbānaṃ dasseti. Samādapetīti tameva atthaṃ te bhikkhū gaṇhāpeti. Samuttejetīti tadatthagahaṇe ussāhaṃ janento tejeti joteti. Sampahaṃsetīti nibbānaguṇehi sammadeva sabbappakārehi toseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sandassetī"
      },
      "ti ‘‘so sabbasaṅkhārasamatho sabbūpadhipaṭinissaggā taṇhakkhayo virāgo nirodho’’tiādinā (ma. ni. 1.281; 2.337; mahāva. 8) nayeneva sabbathā tena tena pariyāyena tesaṃ tesaṃ ajjhāsayānurūpaṃ sammā dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samādapetī"
      },
      "ti ‘‘iminā ariyamaggena taṃ adhigantabba’’nti adhigamapaṭipadāya saddhiṃ tattha bhikkhū ninnapoṇapabbhāre karonto sammā ādapeti gaṇhāpeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samuttejetī"
      },
      "ti etaṃ dukkaraṃ durabhisambhavanti ‘‘mā sammāpaṭipattiyaṃ pamādaṃ antarāvosānaṃ āpajjatha, upanissayasampannassa vīriyavato nayidaṃ dukkaraṃ, tasmā sīlavisuddhiādivisuddhipaṭipadāya uṭṭhahatha ghaṭayatha vāyameyyāthā’’ti nibbānādhigamāya ussāheti, tattha vā cittaṃ vodapeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sampahaṃsetī"
      },
      "ti ‘‘madanimmadano pipāsavinayo ālayasamugghāto’’ti (a. ni. 4.34; itivu. 90), rāgakkhayo dosakkhayo mohakkhayoti (saṃ. ni. 4.367; itivu. 44), asaṅkhatanti (saṃ. ni. 4.367), amatañca santantiādinā ca anekapariyāyena (saṃ. ni. 4.409) nibbānānisaṃsappakāsanena tesaṃ bhikkhūnaṃ cittaṃ tosento hāsento sampahaṃseti samassāseti."
    ],
    "innerText": "Atha vā sandassetīti ‘‘so sabbasaṅkhārasamatho sabbūpadhipaṭinissaggā taṇhakkhayo virāgo nirodho’’tiādinā (ma. ni. 1.281; 2.337; mahāva. 8) nayeneva sabbathā tena tena pariyāyena tesaṃ tesaṃ ajjhāsayānurūpaṃ sammā dasseti. Samādapetīti ‘‘iminā ariyamaggena taṃ adhigantabba’’nti adhigamapaṭipadāya saddhiṃ tattha bhikkhū ninnapoṇapabbhāre karonto sammā ādapeti gaṇhāpeti. Samuttejetīti etaṃ dukkaraṃ durabhisambhavanti ‘‘mā sammāpaṭipattiyaṃ pamādaṃ antarāvosānaṃ āpajjatha, upanissayasampannassa vīriyavato nayidaṃ dukkaraṃ, tasmā sīlavisuddhiādivisuddhipaṭipadāya uṭṭhahatha ghaṭayatha vāyameyyāthā’’ti nibbānādhigamāya ussāheti, tattha vā cittaṃ vodapeti. Sampahaṃsetīti ‘‘madanimmadano pipāsavinayo ālayasamugghāto’’ti (a. ni. 4.34; itivu. 90), rāgakkhayo dosakkhayo mohakkhayoti (saṃ. ni. 4.367; itivu. 44), asaṅkhatanti (saṃ. ni. 4.367), amatañca santantiādinā ca anekapariyāyena (saṃ. ni. 4.409) nibbānānisaṃsappakāsanena tesaṃ bhikkhūnaṃ cittaṃ tosento hāsento sampahaṃseti samassāseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tedhā"
      },
      "ti ",
      " te idha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭhiṃ katvā"
      },
      "ti ‘‘atthi kiñci ayaṃ no attho adhigantabbo’’ti evaṃ sallakkhetvā tāya desanāya atthikā hutvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Manasi katvā"
      },
      "ti citte ṭhapetvā anaññavihitā taṃ desanaṃ attano cittagatameva ",
      " katvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbaṃ cetaso samannāharitvā"
      },
      "ti sabbena kārakacittena ",
      " ādito paṭṭhāya yāva pariyosānā desanaṃ āvajjetvā, taggatameva ābhogaṃ katvāti attho. Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sabbaṃ cetaso samannāharitvā"
      },
      "ti sabbasmā cittato desanaṃ sammā anu anu āharitvā. Idaṃ vuttaṃ hoti – desentassa yehi cittehi desanā katā, sabbasmā cittato pavattaṃ desanaṃ bahi gantuṃ adento sammā aviparītaṃ anu anu āharitvā attano cittasantānaṃ āharitvā yathādesitadesitaṃ desanaṃ suṭṭhu upadhāretvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ohitasotā"
      },
      "ti avahitasotā, suṭṭhu upitasotā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ohitasotā"
      },
      "ti vā avikkhittasotā. Tameva upalabbhamānopi hi savane avikkhepo satisaṃvaro viya cakkhundriyādīsu sotindriyepi vattumarahatīti. Ettha ca ‘‘aṭṭhiṃ katvā’’tiādīhi catūhipi padehi tesaṃ bhikkhūnaṃ tapparabhāvato savane ādaradīpanena sakkaccasavanaṃ dasseti."
    ],
    "innerText": "Tedhāti te idha. Aṭṭhiṃ katvāti ‘‘atthi kiñci ayaṃ no attho adhigantabbo’’ti evaṃ sallakkhetvā tāya desanāya atthikā hutvā. Manasi katvāti citte ṭhapetvā anaññavihitā taṃ desanaṃ attano cittagatameva katvā. Sabbaṃ cetaso samannāharitvāti sabbena kārakacittena ādito paṭṭhāya yāva pariyosānā desanaṃ āvajjetvā, taggatameva ābhogaṃ katvāti attho. Atha vā sabbaṃ cetaso samannāharitvāti sabbasmā cittato desanaṃ sammā anu anu āharitvā. Idaṃ vuttaṃ hoti – desentassa yehi cittehi desanā katā, sabbasmā cittato pavattaṃ desanaṃ bahi gantuṃ adento sammā aviparītaṃ anu anu āharitvā attano cittasantānaṃ āharitvā yathādesitadesitaṃ desanaṃ suṭṭhu upadhāretvā. Ohitasotāti avahitasotā, suṭṭhu upitasotā. Ohitasotāti vā avikkhittasotā. Tameva upalabbhamānopi hi savane avikkhepo satisaṃvaro viya cakkhundriyādīsu sotindriyepi vattumarahatīti. Ettha ca ‘‘aṭṭhiṃ katvā’’tiādīhi catūhipi padehi tesaṃ bhikkhūnaṃ tapparabhāvato savane ādaradīpanena sakkaccasavanaṃ dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etamatthaṃ viditvā"
      },
      "ti etaṃ tesaṃ bhikkhūnaṃ tassā nibbānapaṭisaṃyuttāya dhammakathāya savane ādarakāritaṃ sabbākārato viditvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Imaṃ udāna"
      },
      "nti imaṃ nibbānassa tabbidhuradhammadesanāmukhena paramatthato vijjamānabhāvavibhāvanaṃ udānaṃ udānesi."
    ],
    "innerText": "Etamatthaṃ viditvāti etaṃ tesaṃ bhikkhūnaṃ tassā nibbānapaṭisaṃyuttāya dhammakathāya savane ādarakāritaṃ sabbākārato viditvā. Imaṃ udānanti imaṃ nibbānassa tabbidhuradhammadesanāmukhena paramatthato vijjamānabhāvavibhāvanaṃ udānaṃ udānesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atthī"
      },
      "ti vijjati, paramatthato upalabbhatīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhikkhave"
      },
      "ti tesaṃ bhikkhūnaṃ ālapanaṃ. Nanu ca udānaṃ nāma pītisomanassasamuṭṭhāpito vā dhammasaṃvegasamuṭṭhāpito vā dhammapaṭiggāhakanirapekkho udāhāro, tathā ceva ettakesu suttesu āgataṃ, idha kasmā bhagavā udānento te bhikkhū āmantesīti? Tesaṃ bhikkhūnaṃ saññāpanatthaṃ. Nibbānapaṭisaṃyuttañhi bhagavā tesaṃ bhikkhūnaṃ dhammaṃ desetvā nibbānaguṇānussaraṇena uppannapītisomanassā udānaṃ udānesi. Idha ",
      " nibbānavajjo sabbo sabhāvadhammo paccayāyattavuttikova upalabbhati, na paccayanirapekkho. Ayaṃ pana nibbānadhammo katamapaccaye upalabbhatīti tesaṃ bhikkhūnaṃ cetoparivitakkamaññāya te ca saññāpetukāmo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘atthi, bhikkhave, tadāyatana’’"
      },
      "ntiādimāha, na ekantatova te paṭiggāhake katvāti veditabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tadāyatana"
      },
      "nti taṃ kāraṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Da"
      },
      "kāro padasandhikaro. Nibbānañhi ",
      " maggaphalañāṇādīnaṃ ārammaṇapaccayabhāvato rūpādīni viya cakkhuviññāṇādīnaṃ ārammaṇapaccayabhūtānīti kāraṇaṭṭhena ‘‘āyatana’’nti vuccati. Ettāvatā ca bhagavā tesaṃ bhikkhūnaṃ asaṅkhatāya dhātuyā paramatthato atthibhāvaṃ pavedesi."
    ],
    "innerText": "Tattha atthīti vijjati, paramatthato upalabbhatīti attho. Bhikkhaveti tesaṃ bhikkhūnaṃ ālapanaṃ. Nanu ca udānaṃ nāma pītisomanassasamuṭṭhāpito vā dhammasaṃvegasamuṭṭhāpito vā dhammapaṭiggāhakanirapekkho udāhāro, tathā ceva ettakesu suttesu āgataṃ, idha kasmā bhagavā udānento te bhikkhū āmantesīti? Tesaṃ bhikkhūnaṃ saññāpanatthaṃ. Nibbānapaṭisaṃyuttañhi bhagavā tesaṃ bhikkhūnaṃ dhammaṃ desetvā nibbānaguṇānussaraṇena uppannapītisomanassā udānaṃ udānesi. Idha nibbānavajjo sabbo sabhāvadhammo paccayāyattavuttikova upalabbhati, na paccayanirapekkho. Ayaṃ pana nibbānadhammo katamapaccaye upalabbhatīti tesaṃ bhikkhūnaṃ cetoparivitakkamaññāya te ca saññāpetukāmo ‘‘atthi, bhikkhave, tadāyatana’’ntiādimāha, na ekantatova te paṭiggāhake katvāti veditabbaṃ. Tadāyatananti taṃ kāraṇaṃ. Dakāro padasandhikaro. Nibbānañhi maggaphalañāṇādīnaṃ ārammaṇapaccayabhāvato rūpādīni viya cakkhuviññāṇādīnaṃ ārammaṇapaccayabhūtānīti kāraṇaṭṭhena ‘‘āyatana’’nti vuccati. Ettāvatā ca bhagavā tesaṃ bhikkhūnaṃ asaṅkhatāya dhātuyā paramatthato atthibhāvaṃ pavedesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatrāyaṃ dhammanvayo – idha saṅkhatadhammānaṃ vijjamānattā asaṅkhatāyapi dhātuyā bhavitabbaṃ tappaṭipakkhattā sabhāvadhammānaṃ. Yathā hi dukkhe vijjamāne tappaṭipakkhabhūtaṃ sukhampi vijjatiyeva ",
      ", tathā uṇhe vijjamāne sītampi vijjati, pāpadhammesu vijjamānesu kalyāṇadhammāpi vijjanti eva. Vuttañcetaṃ –"
    ],
    "innerText": "Tatrāyaṃ dhammanvayo – idha saṅkhatadhammānaṃ vijjamānattā asaṅkhatāyapi dhātuyā bhavitabbaṃ tappaṭipakkhattā sabhāvadhammānaṃ. Yathā hi dukkhe vijjamāne tappaṭipakkhabhūtaṃ sukhampi vijjatiyeva , tathā uṇhe vijjamāne sītampi vijjati, pāpadhammesu vijjamānesu kalyāṇadhammāpi vijjanti eva. Vuttañcetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yathāpi dukkhe vijjante, sukhaṃ nāmapi vijjati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Evaṃ bhave vijjamāne, vibhavopi icchitabbako."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yathāpi uṇhe vijjante, aparaṃ vijjati sītalaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Evaṃ tividhaggi vijjante, nibbānaṃ icchitabbakaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yathāpi pāpe vijjante, kalyāṇamapi vijjati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Evameva jāti vijjante, ajātimapi icchitabbaka’’ntiādi. (bu. vaṃ. 2.10-12) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Apica nibbānassa paramatthato atthibhāvavicāraṇaṃ parato āvibhavissati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ bhagavā asaṅkhatāya dhātuyā paramatthato atthibhāvaṃ sammukhena dassetvā idāni tabbidhuradhammāpohanamukhenassa sabhāvaṃ dassetuṃ, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yattha neva pathavī na āpo’’"
      },
      "tiādimāha. Tattha yasmā nibbānaṃ sabbasaṅkhāravidhurasabhāvaṃ yathā saṅkhatadhammesu katthaci natthi, tathā tatthapi sabbe saṅkhatadhammā. Na hi saṅkhatāsaṅkhatadhammānaṃ samodhānaṃ sambhavati. Tatrāyaṃ atthavibhāvanā ",
      " – yattha yasmiṃ nibbāne yassaṃ asaṅkhatadhātuyaṃ neva kakkhaḷalakkhaṇā pathavīdhātu atthi, na paggharaṇalakkhaṇā āpodhātu, na uṇhalakkhaṇā tejodhātu, na vitthambhanalakkhaṇā vāyodhātu atthi. Iti catumahābhūtābhāvavacanena yathā sabbassapi upādārūpassa abhāvo vutto hoti tannissitattā. Evaṃ anavasesato kāmarūpabhavassa ",
      " tattha abhāvo vutto hoti tadāyattavuttibhāvato. Na hi mahābhūtanissayena vinā pañcavokārabhavo ekavokārabhavo vā sambhavatīti."
    ],
    "innerText": "Evaṃ bhagavā asaṅkhatāya dhātuyā paramatthato atthibhāvaṃ sammukhena dassetvā idāni tabbidhuradhammāpohanamukhenassa sabhāvaṃ dassetuṃ, ‘‘yattha neva pathavī na āpo’’tiādimāha. Tattha yasmā nibbānaṃ sabbasaṅkhāravidhurasabhāvaṃ yathā saṅkhatadhammesu katthaci natthi, tathā tatthapi sabbe saṅkhatadhammā. Na hi saṅkhatāsaṅkhatadhammānaṃ samodhānaṃ sambhavati. Tatrāyaṃ atthavibhāvanā – yattha yasmiṃ nibbāne yassaṃ asaṅkhatadhātuyaṃ neva kakkhaḷalakkhaṇā pathavīdhātu atthi, na paggharaṇalakkhaṇā āpodhātu, na uṇhalakkhaṇā tejodhātu, na vitthambhanalakkhaṇā vāyodhātu atthi. Iti catumahābhūtābhāvavacanena yathā sabbassapi upādārūpassa abhāvo vutto hoti tannissitattā. Evaṃ anavasesato kāmarūpabhavassa tattha abhāvo vutto hoti tadāyattavuttibhāvato. Na hi mahābhūtanissayena vinā pañcavokārabhavo ekavokārabhavo vā sambhavatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni arūpasabhāvattepi nibbānassa arūpabhavapariyāpannānaṃ dhammānaṃ tattha abhāvaṃ dassetuṃ, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘na ākāsānañcāyatanaṃ…pe… na nevasaññānāsaññāyatana’’"
      },
      "nti vuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na ākāsānañcāyatana"
      },
      "nti saddhiṃ ārammaṇena kusalavipākakiriyabhedo tividhopi ākāsānañcāyatanacittuppādo natthīti attho. Sesesupi eseva nayo. Yadaggena ca nibbāne kāmalokādīnaṃ ",
      " abhāvo hoti, tadaggena tattha idhalokaparalokānampi abhāvoti āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘nāyaṃ loko na paraloko’’"
      },
      "ti. Tassattho – yvāyaṃ ‘‘itthattaṃ diṭṭhadhammo idhaloko’’ti ca laddhavohāro khandhādiloko, yo ca ‘‘tato aññathā paro abhisamparāyo’’ti ca laddhavohāro khandhādiloko, tadubhayampi tattha natthīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na ubho candimasūriyā"
      },
      "ti yasmā rūpagate sati tamo nāma siyā, tamassa ca vidhamanatthaṃ candimasūriyehi vattitabbaṃ. Sabbena sabbaṃ pana yattha rūpagatameva natthi, kuto tattha tamo. Tamassa vā vidhamanā candimasūriyā, tasmā candimā sūriyo cāti ubhopi tattha nibbāne natthīti attho. Iminā ālokasabhāvataṃyeva nibbānassa dasseti."
    ],
    "innerText": "Idāni arūpasabhāvattepi nibbānassa arūpabhavapariyāpannānaṃ dhammānaṃ tattha abhāvaṃ dassetuṃ, ‘‘na ākāsānañcāyatanaṃ…pe… na nevasaññānāsaññāyatana’’nti vuttaṃ. Tattha na ākāsānañcāyatananti saddhiṃ ārammaṇena kusalavipākakiriyabhedo tividhopi ākāsānañcāyatanacittuppādo natthīti attho. Sesesupi eseva nayo. Yadaggena ca nibbāne kāmalokādīnaṃ abhāvo hoti, tadaggena tattha idhalokaparalokānampi abhāvoti āha – ‘‘nāyaṃ loko na paraloko’’ti. Tassattho – yvāyaṃ ‘‘itthattaṃ diṭṭhadhammo idhaloko’’ti ca laddhavohāro khandhādiloko, yo ca ‘‘tato aññathā paro abhisamparāyo’’ti ca laddhavohāro khandhādiloko, tadubhayampi tattha natthīti. Na ubho candimasūriyāti yasmā rūpagate sati tamo nāma siyā, tamassa ca vidhamanatthaṃ candimasūriyehi vattitabbaṃ. Sabbena sabbaṃ pana yattha rūpagatameva natthi, kuto tattha tamo. Tamassa vā vidhamanā candimasūriyā, tasmā candimā sūriyo cāti ubhopi tattha nibbāne natthīti attho. Iminā ālokasabhāvataṃyeva nibbānassa dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettāvatā ca anabhisametāvīnaṃ bhikkhūnaṃ anādimatisaṃsāre supinantepi ananubhūtapubbaṃ paramagambhīraṃ atiduddasaṃ saṇhasukhumaṃ atakkāvacaraṃ accantasantaṃ paṇḍitavedanīyaṃ atipaṇītaṃ amataṃ nibbānaṃ vibhāvento paṭhamaṃ tāva ‘‘atthi, bhikkhave, tadāyatana’’nti tassa atthibhāvā tesaṃ aññāṇādīni apanetvā ‘‘yattha neva pathavī ",
      " …pe… na ubho candimasūriyā’’ti tadaññadhammāpohanamukhena taṃ vibhāveti dhammarājā. Tena pathavīādisabbasaṅkhatadhammavidhurasabhāvā yā asaṅkhatā dhātu, taṃ nibbānanti dīpitaṃ hoti. Tenevāha, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tatrāpāhaṃ, bhikkhave, neva āgatiṃ vadāmī’’"
      },
      "ti."
    ],
    "innerText": "Ettāvatā ca anabhisametāvīnaṃ bhikkhūnaṃ anādimatisaṃsāre supinantepi ananubhūtapubbaṃ paramagambhīraṃ atiduddasaṃ saṇhasukhumaṃ atakkāvacaraṃ accantasantaṃ paṇḍitavedanīyaṃ atipaṇītaṃ amataṃ nibbānaṃ vibhāvento paṭhamaṃ tāva ‘‘atthi, bhikkhave, tadāyatana’’nti tassa atthibhāvā tesaṃ aññāṇādīni apanetvā ‘‘yattha neva pathavī …pe… na ubho candimasūriyā’’ti tadaññadhammāpohanamukhena taṃ vibhāveti dhammarājā. Tena pathavīādisabbasaṅkhatadhammavidhurasabhāvā yā asaṅkhatā dhātu, taṃ nibbānanti dīpitaṃ hoti. Tenevāha, ‘‘tatrāpāhaṃ, bhikkhave, neva āgatiṃ vadāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tatrā"
      },
      "ti tasmiṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Api"
      },
      "saddo samuccaye. Ahaṃ, bhikkhave, yattha saṅkhārapavatte kutoci kassaci āgatiṃ na vadāmi yathāpaccayaṃ tattha dhammamattassa ",
      " uppajjanato. Evaṃ tasmimpi āyatane nibbāne kutoci āgatiṃ āgamanaṃ neva vadāmi āgantabbaṭṭhānatāya abhāvato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na gati"
      },
      "nti katthaci gamanaṃ na vadāmi gantabbaṭṭhānatāya abhāvato. Na hi tattha sattānaṃ ṭhapetvā ñāṇena ārammaṇakaraṇaṃ āgatigatiyo sambhavanti, nāpi ṭhiticutūpapattiyo vadāmi. ‘‘Tadāpaha’’ntipi pāḷi. Tassattho – tampi āyatanaṃ gāmantarato gāmantaraṃ viya na āgantabbatāya na āgati, na gantabbatāya na gati, pathavīpabbatādi viya apatiṭṭhānatāya na ṭhiti, apaccayattā vā uppādābhāvo, tato amatasabhāvattā cavanābhāvo, uppādanirodhābhāvato ceva tadubhayaparicchinnāya ṭhitiyā ca abhāvato na ṭhitiṃ na cutiṃ na upapattiṃ vadāmi. Kevalaṃ pana taṃ arūpasabhāvattā apaccayattā ca na katthaci patiṭṭhitanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "appatiṭṭhaṃ"
      },
      ". Tattha pavattābhāvato pavattappaṭipakkhato ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "appavattaṃ"
      },
      ". Arūpasabhāvattepi vedanādayo viya kassacipi ārammaṇassa anālambanato upatthambhanirapekkhato ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anārammaṇameva"
      },
      " taṃ ‘‘āyatana’’nti vuttaṃ nibbānaṃ. Ayañca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "eva"
      },
      "saddo appatiṭṭhameva appavattamevāti padadvayenapi yojetabbo ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Esevanto dukkhassā"
      },
      "ti yadidaṃ ‘‘appatiṭṭha’’ntiādīhi vacanehi vaṇṇitaṃ thomitaṃ yathāvuttalakkhaṇaṃ nibbānaṃ, eso eva sakalassa vaṭṭadukkhassa anto pariyosānaṃ tadadhigame sati sabbadukkhābhāvato. Tasmā ‘‘dukkhassa anto’’ti ayameva tassa sabhāvoti dasseti."
    ],
    "innerText": "Tattha tatrāti tasmiṃ. Apisaddo samuccaye. Ahaṃ, bhikkhave, yattha saṅkhārapavatte kutoci kassaci āgatiṃ na vadāmi yathāpaccayaṃ tattha dhammamattassa uppajjanato. Evaṃ tasmimpi āyatane nibbāne kutoci āgatiṃ āgamanaṃ neva vadāmi āgantabbaṭṭhānatāya abhāvato. Na gatinti katthaci gamanaṃ na vadāmi gantabbaṭṭhānatāya abhāvato. Na hi tattha sattānaṃ ṭhapetvā ñāṇena ārammaṇakaraṇaṃ āgatigatiyo sambhavanti, nāpi ṭhiticutūpapattiyo vadāmi. ‘‘Tadāpaha’’ntipi pāḷi. Tassattho – tampi āyatanaṃ gāmantarato gāmantaraṃ viya na āgantabbatāya na āgati, na gantabbatāya na gati, pathavīpabbatādi viya apatiṭṭhānatāya na ṭhiti, apaccayattā vā uppādābhāvo, tato amatasabhāvattā cavanābhāvo, uppādanirodhābhāvato ceva tadubhayaparicchinnāya ṭhitiyā ca abhāvato na ṭhitiṃ na cutiṃ na upapattiṃ vadāmi. Kevalaṃ pana taṃ arūpasabhāvattā apaccayattā ca na katthaci patiṭṭhitanti appatiṭṭhaṃ. Tattha pavattābhāvato pavattappaṭipakkhato ca appavattaṃ. Arūpasabhāvattepi vedanādayo viya kassacipi ārammaṇassa anālambanato upatthambhanirapekkhato ca anārammaṇameva taṃ ‘‘āyatana’’nti vuttaṃ nibbānaṃ. Ayañca evasaddo appatiṭṭhameva appavattamevāti padadvayenapi yojetabbo . Esevanto dukkhassāti yadidaṃ ‘‘appatiṭṭha’’ntiādīhi vacanehi vaṇṇitaṃ thomitaṃ yathāvuttalakkhaṇaṃ nibbānaṃ, eso eva sakalassa vaṭṭadukkhassa anto pariyosānaṃ tadadhigame sati sabbadukkhābhāvato. Tasmā ‘‘dukkhassa anto’’ti ayameva tassa sabhāvoti dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṭhamasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Dutiyanibbānapaṭisaṃyuttasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "72"
      },
      ". Dutiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "imaṃ udāna"
      },
      "nti imaṃ nibbānassa pakatiyā gambhīrabhāvato duddasabhāvadīpanaṃ udānaṃ udānesi. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "duddasa"
      },
      "nti sabhāvagambhīrattā atisukhumasaṇhasabhāvattā ca anupacitañāṇasambhārehi passituṃ na sakkāti duddasaṃ. Vuttañhetaṃ – ‘‘tañhi te, māgaṇḍiya, ariyaṃ paññācakkhu natthi, yena tvaṃ ārogyaṃ jāneyyāsi, nibbānampi passeyyāsī’’ti (ma. ni. 2.218). Aparampi vuttaṃ – ‘‘idampi kho ṭhānaṃ duddasaṃ, yadidaṃ sabbasaṅkhārasamatho’’tiādi (mahāva. 8; ma. ni. 1.281; 2.337). ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anata"
      },
      "nti ",
      " rūpādiārammaṇesu, kāmādīsu ca bhavesu namanato tanninnabhāvena pavattito sattānañca tattha namanato taṇhā natā nāma, natthi ettha natāti anataṃ, nibbānanti attho. ‘‘Ananta’’ntipi paṭhanti, niccasabhāvattā antavirahitaṃ, acavanadhammaṃ nirodhaṃ amatanti attho. Keci pana ‘‘ananta’’nti padassa ‘‘appamāṇa’’nti atthaṃ vadanti. Ettha ca ‘‘duddasa’’nti iminā paññāya dubbalīkaraṇehi rāgādikilesehi cirakālabhāvitattā sattānaṃ apaccayabhāvanā na sukarāti nibbānassa kicchena adhigamanīyataṃ dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na hi saccaṃ sudassana"
      },
      "nti imināpi tamevatthaṃ pākaṭaṃ karoti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sacca"
      },
      "nti nibbānaṃ. Tañhi kenaci pariyāyena asantasabhāvābhāvato ekanteneva santattā aviparītaṭṭhena saccaṃ. Na hi taṃ sudassanaṃ na sukhena passitabbaṃ, sucirampi kālaṃ puññañāṇasambhāre samānentehipi kasireneva samadhigantabbato. Tathā hi vuttaṃ bhagavatā – ‘‘kicchena me adhigata’’nti (mahāva. 8; ma. ni. 1.281; 2.337)."
    ],
    "innerText": "72. Dutiye imaṃ udānanti imaṃ nibbānassa pakatiyā gambhīrabhāvato duddasabhāvadīpanaṃ udānaṃ udānesi. Tattha duddasanti sabhāvagambhīrattā atisukhumasaṇhasabhāvattā ca anupacitañāṇasambhārehi passituṃ na sakkāti duddasaṃ. Vuttañhetaṃ – ‘‘tañhi te, māgaṇḍiya, ariyaṃ paññācakkhu natthi, yena tvaṃ ārogyaṃ jāneyyāsi, nibbānampi passeyyāsī’’ti (ma. ni. 2.218). Aparampi vuttaṃ – ‘‘idampi kho ṭhānaṃ duddasaṃ, yadidaṃ sabbasaṅkhārasamatho’’tiādi (mahāva. 8; ma. ni. 1.281; 2.337). Anatanti rūpādiārammaṇesu, kāmādīsu ca bhavesu namanato tanninnabhāvena pavattito sattānañca tattha namanato taṇhā natā nāma, natthi ettha natāti anataṃ, nibbānanti attho. ‘‘Ananta’’ntipi paṭhanti, niccasabhāvattā antavirahitaṃ, acavanadhammaṃ nirodhaṃ amatanti attho. Keci pana ‘‘ananta’’nti padassa ‘‘appamāṇa’’nti atthaṃ vadanti. Ettha ca ‘‘duddasa’’nti iminā paññāya dubbalīkaraṇehi rāgādikilesehi cirakālabhāvitattā sattānaṃ apaccayabhāvanā na sukarāti nibbānassa kicchena adhigamanīyataṃ dasseti. Na hi saccaṃ sudassananti imināpi tamevatthaṃ pākaṭaṃ karoti. Tattha saccanti nibbānaṃ. Tañhi kenaci pariyāyena asantasabhāvābhāvato ekanteneva santattā aviparītaṭṭhena saccaṃ. Na hi taṃ sudassanaṃ na sukhena passitabbaṃ, sucirampi kālaṃ puññañāṇasambhāre samānentehipi kasireneva samadhigantabbato. Tathā hi vuttaṃ bhagavatā – ‘‘kicchena me adhigata’’nti (mahāva. 8; ma. ni. 1.281; 2.337)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭividdhā taṇhā jānato passato natthi kiñcana"
      },
      "nti tañca nirodhasaccaṃ sacchikiriyābhisamayavasena abhisamentena visayato kiccato ca ārammaṇato ca ārammaṇappaṭivedhena asammohappaṭivedhena ca paṭividdhaṃ, yathāpariññābhisamayavasena dukkhasaccaṃ, bhāvanābhisamayavasena ",
      " maggasaccañca ",
      " asammohato paṭividdhaṃ hoti, evaṃ pahānābhisamayavasena asammohato ca paṭividdhā taṇhā hoti. Evañca cattāri saccāni yathābhūtaṃ ariyamaggapaññāya jānato passato bhavādīsu natabhūtā taṇhā natthi, tadabhāve sabbassapi kilesavaṭṭassa abhāvo, tatova kammavipākavaṭṭānaṃ asambhavoyevāti evaṃ bhagavā tesaṃ bhikkhūnaṃ anavasesavaṭṭadukkhavūpasamahetubhūtaṃ amatamahānibbānassa ānubhāvaṃ pakāsesi. Sesaṃ vuttanayameva."
    ],
    "innerText": "Paṭividdhā taṇhā jānato passato natthi kiñcananti tañca nirodhasaccaṃ sacchikiriyābhisamayavasena abhisamentena visayato kiccato ca ārammaṇato ca ārammaṇappaṭivedhena asammohappaṭivedhena ca paṭividdhaṃ, yathāpariññābhisamayavasena dukkhasaccaṃ, bhāvanābhisamayavasena maggasaccañca asammohato paṭividdhaṃ hoti, evaṃ pahānābhisamayavasena asammohato ca paṭividdhā taṇhā hoti. Evañca cattāri saccāni yathābhūtaṃ ariyamaggapaññāya jānato passato bhavādīsu natabhūtā taṇhā natthi, tadabhāve sabbassapi kilesavaṭṭassa abhāvo, tatova kammavipākavaṭṭānaṃ asambhavoyevāti evaṃ bhagavā tesaṃ bhikkhūnaṃ anavasesavaṭṭadukkhavūpasamahetubhūtaṃ amatamahānibbānassa ānubhāvaṃ pakāsesi. Sesaṃ vuttanayameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dutiyasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Tatiyanibbānapaṭisaṃyuttasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "73"
      },
      ". Tatiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atha kho bhagavā etamatthaṃ viditvā"
      },
      "ti tadā kira bhagavatā anekapariyāyena saṃsārassa ādīnavaṃ pakāsetvā sandassanādivasena ",
      " nibbānapaṭisaṃyuttāya dhammadesanāya katāya tesaṃ bhikkhūnaṃ etadahosi – ‘‘ayaṃ saṃsāro bhagavatā avijjādīhi kāraṇehi sahetuko pakāsito, nibbānassa pana tadupasamassa na kiñci kāraṇaṃ vuttaṃ, tayidaṃ ahetukaṃ, kathaṃ saccikaṭṭhaparamatthena upalabbhatī’’ti. Atha bhagavā tesaṃ bhikkhūnaṃ etaṃ yathāvuttaṃ parivitakkasaṅkhātaṃ atthaṃ viditvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Imaṃ udāna"
      },
      "nti tesaṃ bhikkhūnaṃ vimatividhamanatthañceva idha samaṇabrāhmaṇānaṃ ‘‘nibbānaṃ nibbānanti vācāvatthumattameva, natthi hi paramatthato nibbānaṃ nāma anupalabbhamānasabhāvattā’’ti lokāyatikādayo viya vippaṭipannānaṃ bahiddhā ca puthudiṭṭhigatikānaṃ micchāvādabhañjanatthañca imaṃ amatamahānibbānassa paramatthato atthibhāvadīpanaṃ udānaṃ udānesi."
    ],
    "innerText": "73. Tatiye atha kho bhagavā etamatthaṃ viditvāti tadā kira bhagavatā anekapariyāyena saṃsārassa ādīnavaṃ pakāsetvā sandassanādivasena nibbānapaṭisaṃyuttāya dhammadesanāya katāya tesaṃ bhikkhūnaṃ etadahosi – ‘‘ayaṃ saṃsāro bhagavatā avijjādīhi kāraṇehi sahetuko pakāsito, nibbānassa pana tadupasamassa na kiñci kāraṇaṃ vuttaṃ, tayidaṃ ahetukaṃ, kathaṃ saccikaṭṭhaparamatthena upalabbhatī’’ti. Atha bhagavā tesaṃ bhikkhūnaṃ etaṃ yathāvuttaṃ parivitakkasaṅkhātaṃ atthaṃ viditvā. Imaṃ udānanti tesaṃ bhikkhūnaṃ vimatividhamanatthañceva idha samaṇabrāhmaṇānaṃ ‘‘nibbānaṃ nibbānanti vācāvatthumattameva, natthi hi paramatthato nibbānaṃ nāma anupalabbhamānasabhāvattā’’ti lokāyatikādayo viya vippaṭipannānaṃ bahiddhā ca puthudiṭṭhigatikānaṃ micchāvādabhañjanatthañca imaṃ amatamahānibbānassa paramatthato atthibhāvadīpanaṃ udānaṃ udānesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ajātaṃ abhūtaṃ akataṃ asaṅkhata"
      },
      "nti sabbānipi padāni ",
      " aññamaññavevacanāni. Atha vā vedanādayo viya hetupaccayasamavāyasaṅkhātāya kāraṇasāmaggiyā na jātaṃ na nibbattanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ajātaṃ,"
      },
      " kāraṇena vinā, sayameva vā na bhūtaṃ na pātubhūtaṃ na uppannanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhūtaṃ,"
      },
      " evaṃ ajātattā abhūtattā ca yena kenaci kāraṇena na katanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "akataṃ,"
      },
      " jātabhūtakatasabhāvo ca nāmarūpānaṃ saṅkhatadhammānaṃ hoti, na asaṅkhatasabhāvassa nibbānassāti dassanatthaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asaṅkhata"
      },
      "nti vuttaṃ. Paṭilomato vā samecca sambhūya paccayehi katanti saṅkhataṃ, tathā na saṅkhataṃ saṅkhatalakkhaṇarahitanti asaṅkhatanti. Evaṃ anekehi kāraṇehi nibbattitabhāve paṭisiddhe ‘‘siyā ",
      " nu kho ekeneva kāraṇena kata’’nti āsaṅkāya ‘‘na yena kenaci kata’’nti dassanatthaṃ ‘‘akata’’nti vuttaṃ. Evaṃ apaccayampi samānaṃ ‘‘sayameva nu kho idaṃ bhūtaṃ pātubhūta’’nti āsaṅkāya tannivattanatthaṃ ‘‘abhūta’’nti vuttaṃ. ‘‘Ayañcetassa asaṅkhatākatābhūtabhāvo sabbena sabbaṃ ajātidhammattā’’ti dassetuṃ ‘‘ajāta’’nti vuttaṃ. Evametesaṃ catunnampi padānaṃ sātthakabhāvaṃ viditvā ‘‘tayidaṃ nibbānaṃ atthi, bhikkhave’’ti paramatthato nibbānassa atthibhāvo pakāsitoti veditabbo. Ettha udānentena bhagavatā, ‘‘bhikkhave’’ti ālapane kāraṇaṃ heṭṭhā vuttanayeneva veditabbaṃ."
    ],
    "innerText": "Tattha ajātaṃ abhūtaṃ akataṃ asaṅkhatanti sabbānipi padāni aññamaññavevacanāni. Atha vā vedanādayo viya hetupaccayasamavāyasaṅkhātāya kāraṇasāmaggiyā na jātaṃ na nibbattanti ajātaṃ, kāraṇena vinā, sayameva vā na bhūtaṃ na pātubhūtaṃ na uppannanti abhūtaṃ, evaṃ ajātattā abhūtattā ca yena kenaci kāraṇena na katanti akataṃ, jātabhūtakatasabhāvo ca nāmarūpānaṃ saṅkhatadhammānaṃ hoti, na asaṅkhatasabhāvassa nibbānassāti dassanatthaṃ asaṅkhatanti vuttaṃ. Paṭilomato vā samecca sambhūya paccayehi katanti saṅkhataṃ, tathā na saṅkhataṃ saṅkhatalakkhaṇarahitanti asaṅkhatanti. Evaṃ anekehi kāraṇehi nibbattitabhāve paṭisiddhe ‘‘siyā nu kho ekeneva kāraṇena kata’’nti āsaṅkāya ‘‘na yena kenaci kata’’nti dassanatthaṃ ‘‘akata’’nti vuttaṃ. Evaṃ apaccayampi samānaṃ ‘‘sayameva nu kho idaṃ bhūtaṃ pātubhūta’’nti āsaṅkāya tannivattanatthaṃ ‘‘abhūta’’nti vuttaṃ. ‘‘Ayañcetassa asaṅkhatākatābhūtabhāvo sabbena sabbaṃ ajātidhammattā’’ti dassetuṃ ‘‘ajāta’’nti vuttaṃ. Evametesaṃ catunnampi padānaṃ sātthakabhāvaṃ viditvā ‘‘tayidaṃ nibbānaṃ atthi, bhikkhave’’ti paramatthato nibbānassa atthibhāvo pakāsitoti veditabbo. Ettha udānentena bhagavatā, ‘‘bhikkhave’’ti ālapane kāraṇaṃ heṭṭhā vuttanayeneva veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Iti satthā ‘‘atthi, bhikkhave, ajātaṃ abhūtaṃ akataṃ asaṅkhata’’nti vatvā tattha hetuṃ dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘no cetaṃ, bhikkhave’’"
      },
      "tiādimāha. Tassāyaṃ ",
      " saṅkhepattho – bhikkhave, yadi ajātādisabhāvā asaṅkhatā dhātu na abhavissa na siyā, idha loke jātādisabhāvassa rūpādikkhandhapañcakasaṅkhātassa saṅkhatassa nissaraṇaṃ anavasesavūpasamo na paññāyeyya na upalabbheyya na sambhaveyya. Nibbānañhi ārammaṇaṃ katvā pavattamānā sammādiṭṭhiādayo ariyamaggadhammā anavasesakilese samucchindanti. Tenettha sabbassapi vaṭṭadukkhassa appavatti apagamo nissaraṇaṃ paññāyati."
    ],
    "innerText": "Iti satthā ‘‘atthi, bhikkhave, ajātaṃ abhūtaṃ akataṃ asaṅkhata’’nti vatvā tattha hetuṃ dassento ‘‘no cetaṃ, bhikkhave’’tiādimāha. Tassāyaṃ saṅkhepattho – bhikkhave, yadi ajātādisabhāvā asaṅkhatā dhātu na abhavissa na siyā, idha loke jātādisabhāvassa rūpādikkhandhapañcakasaṅkhātassa saṅkhatassa nissaraṇaṃ anavasesavūpasamo na paññāyeyya na upalabbheyya na sambhaveyya. Nibbānañhi ārammaṇaṃ katvā pavattamānā sammādiṭṭhiādayo ariyamaggadhammā anavasesakilese samucchindanti. Tenettha sabbassapi vaṭṭadukkhassa appavatti apagamo nissaraṇaṃ paññāyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ byatirekavasena nibbānassa atthibhāvaṃ dassetvā idāni anvayavasenapi taṃ dassetuṃ, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yasmā ca kho’’"
      },
      "tiādi vuttaṃ. Taṃ vuttatthameva. Ettha ",
      " ca yasmā ‘‘apaccayā dhammā, asaṅkhatā dhammā (dha. sa. dukamātikā 7, 8), atthi, bhikkhave, tadāyatanaṃ, yattha neva pathavī (udā. 71), idampi kho ṭhānaṃ duddasaṃ, yadidaṃ sabbasaṅkhārasamatho sabbūpadhipaṭinissaggo (mahāva. 8; ma. ni. 1.281; 2.337), asaṅkhatañca vo, bhikkhave, dhammaṃ desessāmi asaṅkhatagāminiñca paṭipada’’ntiādīhi (saṃ. ni. 4.366-367) anekehi suttapadehi, ‘‘atthi, bhikkhave, ajāta’’nti imināpi ca suttena nibbānadhātuyā paramatthato sambhavo sabbalokaṃ anukampamānena sammāsambuddhena desito, tasmā yadipi tattha apaccakkhakārīnampi viññūnaṃ kaṅkhā vā vimati vā natthiyeva. Ye pana paraneyyabuddhino puggalā, tesaṃ vimativinodanatthaṃ ayamettha adhippāyaniddhāraṇamukhena yuttivicāraṇā – yathā pariññeyyatāya sauttarānaṃ kāmānaṃ rūpādīnañca paṭipakkhabhūtaṃ tabbidhurasabhāvaṃ nissaraṇaṃ paññāyati, evaṃ taṃsabhāvānaṃ sabbesampi saṅkhatadhammānaṃ paṭipakkhabhūtena tabbidhurasabhāvena nissaraṇena bhavitabbaṃ. Yañcetaṃ nissaraṇaṃ, sā asaṅkhatā dhātu. Kiñca bhiyyo saṅkhatadhammārammaṇaṃ vipassanāñāṇaṃ api anulomañāṇaṃ kilese samucchedavasena pajahituṃ na ",
      " sakkoti. Tathā sammutisaccārammaṇaṃ paṭhamajjhānādīsu ñāṇaṃ vikkhambhanavaseneva kilese pajahati, na samucchedavasena. Iti saṅkhatadhammārammaṇassa sammutisaccārammaṇassa ca ñāṇassa kilesānaṃ samucchedappahāne asamatthabhāvato tesaṃ samucchedappahānakarassa ariyamaggañāṇassa tadubhayaviparītasabhāvena ārammaṇena bhavitabbaṃ ",
      ", sā asaṅkhatā dhātu. Tathā ‘‘atthi, bhikkhave, ajātaṃ abhūtaṃ akataṃ asaṅkhata’’nti idaṃ nibbānapadassa paramatthato atthibhāvajotakaṃ vacanaṃ aviparītatthaṃ bhagavatā bhāsitattā. Yañhi bhagavatā bhāsitaṃ, taṃ aviparītatthaṃ paramatthaṃ yathā taṃ ‘‘sabbe saṅkhārā aniccā, sabbe saṅkhārā dukkhā, sabbe dhammā ",
      " anattā’’ti (a. ni. 3.137; mahāni. 27), tathā nibbānasaddo katthaci visaye yathābhūtaparamatthavisayo upacāramattavuttisabbhāvato seyyathāpi sīhasaddo. Atha vā attheva paramatthato asaṅkhatā dhātu, itaratabbiparītavinimuttasabhāvattā seyyathāpi pathavīdhātu vedanāti. Evamādīhi nayehi yuttitopi asaṅkhatāya dhātuyā paramatthato atthibhāvo veditabbo."
    ],
    "innerText": "Evaṃ byatirekavasena nibbānassa atthibhāvaṃ dassetvā idāni anvayavasenapi taṃ dassetuṃ, ‘‘yasmā ca kho’’tiādi vuttaṃ. Taṃ vuttatthameva. Ettha ca yasmā ‘‘apaccayā dhammā, asaṅkhatā dhammā (dha. sa. dukamātikā 7, 8), atthi, bhikkhave, tadāyatanaṃ, yattha neva pathavī (udā. 71), idampi kho ṭhānaṃ duddasaṃ, yadidaṃ sabbasaṅkhārasamatho sabbūpadhipaṭinissaggo (mahāva. 8; ma. ni. 1.281; 2.337), asaṅkhatañca vo, bhikkhave, dhammaṃ desessāmi asaṅkhatagāminiñca paṭipada’’ntiādīhi (saṃ. ni. 4.366-367) anekehi suttapadehi, ‘‘atthi, bhikkhave, ajāta’’nti imināpi ca suttena nibbānadhātuyā paramatthato sambhavo sabbalokaṃ anukampamānena sammāsambuddhena desito, tasmā yadipi tattha apaccakkhakārīnampi viññūnaṃ kaṅkhā vā vimati vā natthiyeva. Ye pana paraneyyabuddhino puggalā, tesaṃ vimativinodanatthaṃ ayamettha adhippāyaniddhāraṇamukhena yuttivicāraṇā – yathā pariññeyyatāya sauttarānaṃ kāmānaṃ rūpādīnañca paṭipakkhabhūtaṃ tabbidhurasabhāvaṃ nissaraṇaṃ paññāyati, evaṃ taṃsabhāvānaṃ sabbesampi saṅkhatadhammānaṃ paṭipakkhabhūtena tabbidhurasabhāvena nissaraṇena bhavitabbaṃ. Yañcetaṃ nissaraṇaṃ, sā asaṅkhatā dhātu. Kiñca bhiyyo saṅkhatadhammārammaṇaṃ vipassanāñāṇaṃ api anulomañāṇaṃ kilese samucchedavasena pajahituṃ na sakkoti. Tathā sammutisaccārammaṇaṃ paṭhamajjhānādīsu ñāṇaṃ vikkhambhanavaseneva kilese pajahati, na samucchedavasena. Iti saṅkhatadhammārammaṇassa sammutisaccārammaṇassa ca ñāṇassa kilesānaṃ samucchedappahāne asamatthabhāvato tesaṃ samucchedappahānakarassa ariyamaggañāṇassa tadubhayaviparītasabhāvena ārammaṇena bhavitabbaṃ , sā asaṅkhatā dhātu. Tathā ‘‘atthi, bhikkhave, ajātaṃ abhūtaṃ akataṃ asaṅkhata’’nti idaṃ nibbānapadassa paramatthato atthibhāvajotakaṃ vacanaṃ aviparītatthaṃ bhagavatā bhāsitattā. Yañhi bhagavatā bhāsitaṃ, taṃ aviparītatthaṃ paramatthaṃ yathā taṃ ‘‘sabbe saṅkhārā aniccā, sabbe saṅkhārā dukkhā, sabbe dhammā anattā’’ti (a. ni. 3.137; mahāni. 27), tathā nibbānasaddo katthaci visaye yathābhūtaparamatthavisayo upacāramattavuttisabbhāvato seyyathāpi sīhasaddo. Atha vā attheva paramatthato asaṅkhatā dhātu, itaratabbiparītavinimuttasabhāvattā seyyathāpi pathavīdhātu vedanāti. Evamādīhi nayehi yuttitopi asaṅkhatāya dhātuyā paramatthato atthibhāvo veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tatiyasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Catutthanibbānapaṭisaṃyuttasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "74"
      },
      ". Catutthe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atha kho bhagavā etamatthaṃ viditvā"
      },
      "ti tadā kira bhagavatā anekapariyāyena sandassanādivasena nibbānapaṭisaṃyuttāya dhammadesanāya katāya tesaṃ bhikkhūnaṃ etadahosi – ‘‘ayaṃ tāva bhagavatā amatamahānibbānadhātuyā anekākāravokāraṃ ānisaṃsaṃ dassentena anaññasādhāraṇo ānubhāvo pakāsito, adhigamūpāyo panassā na bhāsito, kathaṃ nu kho paṭipajjantehi amhehi ayaṃ adhigantabbā’’ti. Atha bhagavā tesaṃ bhikkhūnaṃ etaṃ yathāvuttaparivitakkasaṅkhātaṃ atthaṃ sabbākārato viditvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Imaṃ udāna"
      },
      "nti taṇhāvasena katthaci anissitassa passaddhakāyacittassa vīthipaṭipannavipassanassa ariyamaggena anavasesato taṇhāpahānena nibbānādhigamavibhāvanaṃ imaṃ udānaṃ udānesi."
    ],
    "innerText": "74. Catutthe atha kho bhagavā etamatthaṃ viditvāti tadā kira bhagavatā anekapariyāyena sandassanādivasena nibbānapaṭisaṃyuttāya dhammadesanāya katāya tesaṃ bhikkhūnaṃ etadahosi – ‘‘ayaṃ tāva bhagavatā amatamahānibbānadhātuyā anekākāravokāraṃ ānisaṃsaṃ dassentena anaññasādhāraṇo ānubhāvo pakāsito, adhigamūpāyo panassā na bhāsito, kathaṃ nu kho paṭipajjantehi amhehi ayaṃ adhigantabbā’’ti. Atha bhagavā tesaṃ bhikkhūnaṃ etaṃ yathāvuttaparivitakkasaṅkhātaṃ atthaṃ sabbākārato viditvā. Imaṃ udānanti taṇhāvasena katthaci anissitassa passaddhakāyacittassa vīthipaṭipannavipassanassa ariyamaggena anavasesato taṇhāpahānena nibbānādhigamavibhāvanaṃ imaṃ udānaṃ udānesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nissitassa calita"
      },
      "nti rūpādisaṅkhāre taṇhādiṭṭhīhi nissitassa calitaṃ ‘‘etaṃ mama, eso me attā’’ti taṇhādiṭṭhivipphanditaṃ hoti. Appahīnataṇhādiṭṭhikassa hi puggalassa sukhādīsu uppannesu tāni abhibhuyya viharituṃ asakkontassa ",
      " ‘‘mama vedanā, ahaṃ vediyāmī’’tiādinā ",
      " taṇhādiṭṭhigāhavasena kusalappavattito cittasantānassa calanaṃ kampanaṃ, avakkhalitaṃ vā ",
      " hotīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anissitassa calitaṃ natthī"
      },
      "ti yo pana visuddhipaṭipadaṃ paṭipajjanto samathavipassanāhi taṇhādiṭṭhiyo vikkhambhetvā aniccādivasena saṅkhāre sammasanto viharati, tassa taṃ anissitassa yathāvuttaṃ calitaṃ avakkhalitaṃ, vipphanditaṃ vā natthi kāraṇassa suvikkhambhitattā."
    ],
    "innerText": "Tattha nissitassa calitanti rūpādisaṅkhāre taṇhādiṭṭhīhi nissitassa calitaṃ ‘‘etaṃ mama, eso me attā’’ti taṇhādiṭṭhivipphanditaṃ hoti. Appahīnataṇhādiṭṭhikassa hi puggalassa sukhādīsu uppannesu tāni abhibhuyya viharituṃ asakkontassa ‘‘mama vedanā, ahaṃ vediyāmī’’tiādinā taṇhādiṭṭhigāhavasena kusalappavattito cittasantānassa calanaṃ kampanaṃ, avakkhalitaṃ vā hotīti attho. Anissitassa calitaṃ natthīti yo pana visuddhipaṭipadaṃ paṭipajjanto samathavipassanāhi taṇhādiṭṭhiyo vikkhambhetvā aniccādivasena saṅkhāre sammasanto viharati, tassa taṃ anissitassa yathāvuttaṃ calitaṃ avakkhalitaṃ, vipphanditaṃ vā natthi kāraṇassa suvikkhambhitattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Calite asatī"
      },
      "ti yathāvutte calite asati yathā taṇhādiṭṭhigāhā nappavattanti, tathā vīthipaṭipannāya vipassanāya taṃ ussukkantassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Passaddhī"
      },
      "ti vipassanācittasahajātānaṃ kāyacittānaṃ sārambhakarakilesavūpasaminī duvidhāpi passaddhi hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Passaddhiyā sati nati na hotī"
      },
      "ti pubbenāparaṃ visesayuttāya passaddhiyā sati anavajjasukhādhiṭṭhānaṃ samādhiṃ vaḍḍhetvā taṃ paññāya samavāyakaraṇena samathavipassanaṃ yuganaddhaṃ yojetvā maggaparamparāya kilese khepentassa kāmabhavādīsu namanato ‘‘natī’’ti laddhanāmā taṇhā arahattamaggakkhaṇe anavasesato na hoti, anuppattidhammataṃ āpāditattā na uppajjatīti attho."
    ],
    "innerText": "Calite asatīti yathāvutte calite asati yathā taṇhādiṭṭhigāhā nappavattanti, tathā vīthipaṭipannāya vipassanāya taṃ ussukkantassa. Passaddhīti vipassanācittasahajātānaṃ kāyacittānaṃ sārambhakarakilesavūpasaminī duvidhāpi passaddhi hoti. Passaddhiyā sati nati na hotīti pubbenāparaṃ visesayuttāya passaddhiyā sati anavajjasukhādhiṭṭhānaṃ samādhiṃ vaḍḍhetvā taṃ paññāya samavāyakaraṇena samathavipassanaṃ yuganaddhaṃ yojetvā maggaparamparāya kilese khepentassa kāmabhavādīsu namanato ‘‘natī’’ti laddhanāmā taṇhā arahattamaggakkhaṇe anavasesato na hoti, anuppattidhammataṃ āpāditattā na uppajjatīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Natiyā asatī"
      },
      "ti arahattamaggena taṇhāya suppahīnattā bhavādiatthāya ālayanikanti pariyuṭṭhāne asati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āgatigati na hotī"
      },
      "ti paṭisandhivasena idha āgati āgamanaṃ cutivasena gati ito paralokagamanaṃ peccabhāvo na hoti na pavattati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āgatigatiyā asatī"
      },
      "ti vuttanayena āgatiyā ca gatiyā ca asati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cutūpapāto na hotī"
      },
      "ti aparāparaṃ cavanupapajjanaṃ na hoti na pavattati. Asati hi kilesavaṭṭe kammavaṭṭaṃ pacchinnameva, pacchinne ca tasmiṃ kuto vipākavaṭṭassa sambhavo. Tenāha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘cutūpapāte asati nevidha na hura’’"
      },
      "ntiādi. Tattha yaṃ vattabbaṃ, taṃ heṭṭhā bāhiyasutte vitthārato vuttameva. Tasmā tattha vuttanayeneva attho veditabbo."
    ],
    "innerText": "Natiyā asatīti arahattamaggena taṇhāya suppahīnattā bhavādiatthāya ālayanikanti pariyuṭṭhāne asati. Āgatigati na hotīti paṭisandhivasena idha āgati āgamanaṃ cutivasena gati ito paralokagamanaṃ peccabhāvo na hoti na pavattati. Āgatigatiyā asatīti vuttanayena āgatiyā ca gatiyā ca asati. Cutūpapāto na hotīti aparāparaṃ cavanupapajjanaṃ na hoti na pavattati. Asati hi kilesavaṭṭe kammavaṭṭaṃ pacchinnameva, pacchinne ca tasmiṃ kuto vipākavaṭṭassa sambhavo. Tenāha – ‘‘cutūpapāte asati nevidha na hura’’ntiādi. Tattha yaṃ vattabbaṃ, taṃ heṭṭhā bāhiyasutte vitthārato vuttameva. Tasmā tattha vuttanayeneva attho veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Iti ",
      " bhagavā idhāpi tesaṃ bhikkhūnaṃ anavasesato vaṭṭadukkhavūpasamahetubhūtaṃ amatamahānibbānassa ānubhāvaṃ sammāpaṭipattiyā pakāseti."
    ],
    "innerText": "Iti bhagavā idhāpi tesaṃ bhikkhūnaṃ anavasesato vaṭṭadukkhavūpasamahetubhūtaṃ amatamahānibbānassa ānubhāvaṃ sammāpaṭipattiyā pakāseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Catutthasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Cundasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "75"
      },
      ". Pañcame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mallesū"
      },
      "ti evaṃnāmake janapade. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahatā bhikkhusaṅghenā"
      },
      "ti guṇamahattasaṅkhyāmahattehi mahatā. So hi bhikkhusaṅgho sīlādiguṇavisesayogenapi mahā tattha sabbapacchimakassa sotāpannabhāvato, saṅkhyāmahattenapi mahā aparicchinnagaṇanattā. Āyusaṅkhārossajjanato paṭṭhāya hi āgatāgatā bhikkhū na pakkamiṃsu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cundassā"
      },
      "ti evaṃnāmakassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammāraputtassā"
      },
      "ti suvaṇṇakāraputtassa. So kira aḍḍho mahākuṭumbiko bhagavato paṭhamadassaneneva sotāpanno hutvā attano ambavane satthuvasanānucchavikaṃ gandhakuṭiṃ, bhikkhusaṅghassa ca rattiṭṭhānadivāṭṭhānaupaṭṭhānasālākuṭimaṇḍapacaṅkamanādike ca sampādetvā pākāraparikkhittaṃ dvārakoṭṭhakayuttaṃ vihāraṃ katvā buddhappamukhassa saṅghassa niyyādesi. Taṃ sandhāya vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tatra sudaṃ bhagavā pāvāyaṃ viharati cundassa kammāraputtassa ambavane’’"
      },
      "ti."
    ],
    "innerText": "75. Pañcame mallesūti evaṃnāmake janapade. Mahatā bhikkhusaṅghenāti guṇamahattasaṅkhyāmahattehi mahatā. So hi bhikkhusaṅgho sīlādiguṇavisesayogenapi mahā tattha sabbapacchimakassa sotāpannabhāvato, saṅkhyāmahattenapi mahā aparicchinnagaṇanattā. Āyusaṅkhārossajjanato paṭṭhāya hi āgatāgatā bhikkhū na pakkamiṃsu. Cundassāti evaṃnāmakassa. Kammāraputtassāti suvaṇṇakāraputtassa. So kira aḍḍho mahākuṭumbiko bhagavato paṭhamadassaneneva sotāpanno hutvā attano ambavane satthuvasanānucchavikaṃ gandhakuṭiṃ, bhikkhusaṅghassa ca rattiṭṭhānadivāṭṭhānaupaṭṭhānasālākuṭimaṇḍapacaṅkamanādike ca sampādetvā pākāraparikkhittaṃ dvārakoṭṭhakayuttaṃ vihāraṃ katvā buddhappamukhassa saṅghassa niyyādesi. Taṃ sandhāya vuttaṃ – ‘‘tatra sudaṃ bhagavā pāvāyaṃ viharati cundassa kammāraputtassa ambavane’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭiyādāpetvā"
      },
      "ti sampādetvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Sūkaramaddava"
      },
      "nti sūkarassa mudusiniddhaṃ pavattamaṃsa’’nti mahāaṭṭhakathāyaṃ vuttaṃ. Keci pana ‘‘sūkaramaddavanti na sūkaramaṃsaṃ, sūkarehi madditavaṃsakaḷīro’’ti vadanti. Aññe ‘‘sūkarehi madditappadese jātaṃ ahichattaka’’nti. Apare pana ‘‘sūkaramaddavaṃ nāma ekaṃ rasāyana’’nti bhaṇiṃsu ",
      ". Tañhi cundo kammāraputto ‘‘ajja bhagavā parinibbāyissatī’’ti sutvā ‘‘appeva nāma naṃ paribhuñjitvā cirataraṃ tiṭṭheyyā’’ti satthu cirajīvitukamyatāya adāsīti vadanti."
    ],
    "innerText": "Paṭiyādāpetvāti sampādetvā. ‘‘Sūkaramaddavanti sūkarassa mudusiniddhaṃ pavattamaṃsa’’nti mahāaṭṭhakathāyaṃ vuttaṃ. Keci pana ‘‘sūkaramaddavanti na sūkaramaṃsaṃ, sūkarehi madditavaṃsakaḷīro’’ti vadanti. Aññe ‘‘sūkarehi madditappadese jātaṃ ahichattaka’’nti. Apare pana ‘‘sūkaramaddavaṃ nāma ekaṃ rasāyana’’nti bhaṇiṃsu . Tañhi cundo kammāraputto ‘‘ajja bhagavā parinibbāyissatī’’ti sutvā ‘‘appeva nāma naṃ paribhuñjitvā cirataraṃ tiṭṭheyyā’’ti satthu cirajīvitukamyatāya adāsīti vadanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tena maṃ parivisā"
      },
      "ti tena mamaṃ bhojehi. Kasmā bhagavā evamāha? Parānuddayatāya. Tañca kāraṇaṃ pāḷiyaṃ vuttameva. Tena abhihaṭabhikkhāya paresaṃ aparibhogārahato ca tathā vattuṃ vaṭṭatīti dassitaṃ hoti. Tasmiṃ kira sūkaramaddave dvisahassadīpaparivāresu catūsu mahādīpesu devatā ojaṃ pakkhipiṃsu. Tasmā taṃ añño koci sammā jīrāpetuṃ na sakkoti, tamatthaṃ pakāsento satthā parūpavādamocanatthaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘nāhaṃ taṃ, cunda, passāmī’’"
      },
      "tiādinā sīhanādaṃ nadi. Ye hi pare upavadeyyuṃ ‘‘attanā paribhuttāvasesaṃ neva bhikkhūnaṃ, na aññesaṃ manussānaṃ adāsi, āvāṭe nikhaṇāpetvā vināsesī’’ti, ‘‘tesaṃ vacanokāso mā hotū’’ti parūpavādamocanatthaṃ sīhanādaṃ nadi."
    ],
    "innerText": "Tena maṃ parivisāti tena mamaṃ bhojehi. Kasmā bhagavā evamāha? Parānuddayatāya. Tañca kāraṇaṃ pāḷiyaṃ vuttameva. Tena abhihaṭabhikkhāya paresaṃ aparibhogārahato ca tathā vattuṃ vaṭṭatīti dassitaṃ hoti. Tasmiṃ kira sūkaramaddave dvisahassadīpaparivāresu catūsu mahādīpesu devatā ojaṃ pakkhipiṃsu. Tasmā taṃ añño koci sammā jīrāpetuṃ na sakkoti, tamatthaṃ pakāsento satthā parūpavādamocanatthaṃ ‘‘nāhaṃ taṃ, cunda, passāmī’’tiādinā sīhanādaṃ nadi. Ye hi pare upavadeyyuṃ ‘‘attanā paribhuttāvasesaṃ neva bhikkhūnaṃ, na aññesaṃ manussānaṃ adāsi, āvāṭe nikhaṇāpetvā vināsesī’’ti, ‘‘tesaṃ vacanokāso mā hotū’’ti parūpavādamocanatthaṃ sīhanādaṃ nadi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sadevake"
      },
      "tiādīsu saha devehīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sadevako,"
      },
      " saha mārenāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samārako,"
      },
      " saha brahmunāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sabrahmako,"
      },
      " saha samaṇabrāhmaṇehīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sassamaṇabrāhmaṇī,"
      },
      " pajātattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pajā,"
      },
      " saha devamanussehīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sadevamanussā"
      },
      ". Tasmiṃ sadevake loke…pe… sadevamanussāya. Tattha sadevakavacanena pañcakāmāvacaradevaggahaṇaṃ, samārakavacanena chaṭṭhakāmāvacaradevaggahaṇaṃ, sabrahmakavacanena brahmakāyikādibrahmaggahaṇaṃ, sassamaṇabrāhmaṇīvacanena sāsanassa paccatthikapaccāmittasamaṇabrāhmaṇaggahaṇaṃ samitapāpabāhitapāpasamaṇabrāhmaṇaggahaṇañca, pajāvacanena sattalokaggahaṇaṃ, sadevamanussavacanena sammutidevaavasesamanussaggahaṇaṃ. Evamettha tīhi padehi okāsalokavasena, dvīhi pajāvasena sattaloko gahitoti veditabbo. Aparo ",
      " nayo – sadevakavacanena arūpāvacaraloko gahito, samārakavacanena chakāmāvacaradevaloko, sabrahmakavacanena rūpī brahmaloko, sassamaṇabrāhmaṇavacanena catuparisavasena sammutidevehi saha manussaloko, avasesasattaloko vā gahitoti veditabbo."
    ],
    "innerText": "Tattha sadevaketiādīsu saha devehīti sadevako, saha mārenāti samārako, saha brahmunāti sabrahmako, saha samaṇabrāhmaṇehīti sassamaṇabrāhmaṇī, pajātattā pajā, saha devamanussehīti sadevamanussā. Tasmiṃ sadevake loke…pe… sadevamanussāya. Tattha sadevakavacanena pañcakāmāvacaradevaggahaṇaṃ, samārakavacanena chaṭṭhakāmāvacaradevaggahaṇaṃ, sabrahmakavacanena brahmakāyikādibrahmaggahaṇaṃ, sassamaṇabrāhmaṇīvacanena sāsanassa paccatthikapaccāmittasamaṇabrāhmaṇaggahaṇaṃ samitapāpabāhitapāpasamaṇabrāhmaṇaggahaṇañca, pajāvacanena sattalokaggahaṇaṃ, sadevamanussavacanena sammutidevaavasesamanussaggahaṇaṃ. Evamettha tīhi padehi okāsalokavasena, dvīhi pajāvasena sattaloko gahitoti veditabbo. Aparo nayo – sadevakavacanena arūpāvacaraloko gahito, samārakavacanena chakāmāvacaradevaloko, sabrahmakavacanena rūpī brahmaloko, sassamaṇabrāhmaṇavacanena catuparisavasena sammutidevehi saha manussaloko, avasesasattaloko vā gahitoti veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhuttāvissā"
      },
      "ti bhuttavato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kharo"
      },
      "ti pharuso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ābādho"
      },
      "ti visabhāgarogo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pabāḷhā"
      },
      "ti balavatiyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Māraṇantikā"
      },
      "ti maraṇantā maraṇasamīpapāpanasamatthā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sato sampajāno adhivāsesī"
      },
      "ti satiṃ upaṭṭhitaṃ katvā ñāṇena paricchinditvā adhivāsesi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avihaññamāno"
      },
      "ti vedanānuvattanavasena asallakkhitadhammo viya aparāparaṃ parivattanaṃ akaronto apīḷiyamāno adukkhiyamāno viya adhivāsesi. Bhagavato hi veḷuvagāmakeyeva tā vedanā uppannā, samāpattibalena pana vikkhambhitā yāva parinibbānadivasā na uppajjiṃsu divase divase samāpattīhi paṭipaṇāmanato. Taṃ divasaṃ pana parinibbāyitukāmo ‘‘koṭisahassahatthīnaṃ balaṃ dhārentānaṃ vajirasaṅghātasamānakāyānaṃ aparimitakālaṃ upacitapuññasambhārānampi bhave sati evarūpā vedanā pavattanti, kimaṅgaṃ pana aññesa’’nti sattānaṃ saṃvegajananatthaṃ samāpattiṃ na samāpajji, tena vedanā kharā vattiṃsu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āyāmā"
      },
      "ti ehi yāma."
    ],
    "innerText": "Bhuttāvissāti bhuttavato. Kharoti pharuso. Ābādhoti visabhāgarogo. Pabāḷhāti balavatiyo. Māraṇantikāti maraṇantā maraṇasamīpapāpanasamatthā. Sato sampajāno adhivāsesīti satiṃ upaṭṭhitaṃ katvā ñāṇena paricchinditvā adhivāsesi. Avihaññamānoti vedanānuvattanavasena asallakkhitadhammo viya aparāparaṃ parivattanaṃ akaronto apīḷiyamāno adukkhiyamāno viya adhivāsesi. Bhagavato hi veḷuvagāmakeyeva tā vedanā uppannā, samāpattibalena pana vikkhambhitā yāva parinibbānadivasā na uppajjiṃsu divase divase samāpattīhi paṭipaṇāmanato. Taṃ divasaṃ pana parinibbāyitukāmo ‘‘koṭisahassahatthīnaṃ balaṃ dhārentānaṃ vajirasaṅghātasamānakāyānaṃ aparimitakālaṃ upacitapuññasambhārānampi bhave sati evarūpā vedanā pavattanti, kimaṅgaṃ pana aññesa’’nti sattānaṃ saṃvegajananatthaṃ samāpattiṃ na samāpajji, tena vedanā kharā vattiṃsu. Āyāmāti ehi yāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cundassa bhattaṃ bhuñjitvā"
      },
      "tiādikā aparabhāge dhammasaṅgāhakehi ṭhapitā gāthā. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhuttassa ca sūkaramaddavenā"
      },
      "ti bhuttassa udapādi, na pana bhuttapaccayā. Yadi hi abhuttassa uppajjissā, atikharo abhavissā, siniddhabhojanaṃ ",
      " pana bhuttattā tanukā vedanā ahosi, teneva padasā gantuṃ asakkhi. Etena yvāyaṃ ‘‘yassa taṃ paribhuttaṃ sammā pariṇāmaṃ gaccheyya aññatra tathāgatassā’’ti sīhanādo nadito, tassa sātthakatā dassitā. Buddhānañhi aṭṭhāne gajjitaṃ nāma natthi. Yasmā taṃ paribhuttaṃ bhagavato na kiñci vikāraṃ uppādesi, kammena pana laddhokāsena uppādiyamānaṃ vikāraṃ appamattatāya upasamento ",
      " sarīre balaṃ uppādesi, yena yathā vakkhamānaṃ tividhaṃ payojanaṃ sampādesi, tasmā sammadeva taṃ pariṇāmaṃ gataṃ, māraṇantikattā ",
      " pana vedanānaṃ aviññātaṃ apākaṭaṃ ahosīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Viriccamāno"
      },
      "ti abhiṇhaṃ pavattalohitavirecanova samāno. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avocā"
      },
      "ti attanā icchitaṭṭhāne parinibbānatthāya evamāha."
    ],
    "innerText": "Cundassa bhattaṃ bhuñjitvātiādikā aparabhāge dhammasaṅgāhakehi ṭhapitā gāthā. Tattha bhuttassa ca sūkaramaddavenāti bhuttassa udapādi, na pana bhuttapaccayā. Yadi hi abhuttassa uppajjissā, atikharo abhavissā, siniddhabhojanaṃ pana bhuttattā tanukā vedanā ahosi, teneva padasā gantuṃ asakkhi. Etena yvāyaṃ ‘‘yassa taṃ paribhuttaṃ sammā pariṇāmaṃ gaccheyya aññatra tathāgatassā’’ti sīhanādo nadito, tassa sātthakatā dassitā. Buddhānañhi aṭṭhāne gajjitaṃ nāma natthi. Yasmā taṃ paribhuttaṃ bhagavato na kiñci vikāraṃ uppādesi, kammena pana laddhokāsena uppādiyamānaṃ vikāraṃ appamattatāya upasamento sarīre balaṃ uppādesi, yena yathā vakkhamānaṃ tividhaṃ payojanaṃ sampādesi, tasmā sammadeva taṃ pariṇāmaṃ gataṃ, māraṇantikattā pana vedanānaṃ aviññātaṃ apākaṭaṃ ahosīti. Viriccamānoti abhiṇhaṃ pavattalohitavirecanova samāno. Avocāti attanā icchitaṭṭhāne parinibbānatthāya evamāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kasmā pana bhagavā evaṃ roge uppanne kusināraṃ agamāsi, kiṃ aññattha na sakkā parinibbāyitunti? Parinibbāyituṃ nāma na katthaci na sakkā, evaṃ pana cintesi – mayi kusināraṃ gate mahāsudassanasuttadesanāya (dī. ni. 2.241) aṭṭhuppatti bhavissati, tāya yā devaloke anubhavitabbasadisā sampatti manussaloke mayā anubhūtā, taṃ dvīhi bhāṇavārehi paṭimaṇḍetvā desessāmi, taṃ sutvā bahū janā kusalaṃ kattabbaṃ maññissanti. Subhaddopi kattha maṃ upasaṅkamitvā pañhaṃ pucchitvā vissajjanapariyosāne saraṇesu patiṭṭhāya pabbajitvā laddhūpasampado kammaṭṭhānaṃ bhāvetvā mayi dharanteyeva arahattaṃ patvā pacchimasāvako nāma bhavissati. Aññattha mayi parinibbute dhātunimittaṃ mahākalaho bhavissati, lohitaṃ nadī viya sandissati. Kusinārāyaṃ pana parinibbute doṇabrāhmaṇo taṃ vivādaṃ vūpasametvā dhātuyo vibhajitvā dassatīti imāni tīṇi kāraṇāni passanto bhagavā mahatā ussāhena kusināraṃ agamāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iṅghā"
      },
      "ti codanatthe nipāto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kilantosmī"
      },
      "ti parissanto asmi. Tena yathāvuttavedanānaṃ balavabhāvaṃ eva dasseti. Bhagavā hi attano ānubhāvena tadā padasā agamāsi, aññesaṃ pana yathā paduddhārampi kātuṃ na sakkā, tathā vedanā tikhiṇā kharā kaṭukā vattiṃsu. Tenevāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘nisīdissāmī’’"
      },
      "ti."
    ],
    "innerText": "Iṅghāti codanatthe nipāto. Kilantosmīti parissanto asmi. Tena yathāvuttavedanānaṃ balavabhāvaṃ eva dasseti. Bhagavā hi attano ānubhāvena tadā padasā agamāsi, aññesaṃ pana yathā paduddhārampi kātuṃ na sakkā, tathā vedanā tikhiṇā kharā kaṭukā vattiṃsu. Tenevāha ‘‘nisīdissāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idānī"
      },
      "ti adhunā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Luḷita"
      },
      "nti madditaṃ viya ākulaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āvila"
      },
      "nti ālulaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Acchodakā"
      },
      "ti tanupasannasalilā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sātodakā"
      },
      "ti madhuratoyā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sītodakā"
      },
      "ti ",
      " sītalajalā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Setodakā"
      },
      "ti nikkaddamā ",
      ". Udakañhi sabhāvato setavaṇṇaṃ, bhūmivasena kaddamāvilatāya ca aññādisaṃ hoti, kakudhāpi nadī vimalavālikā samokiṇṇā setavaṇṇā sandati. Tena vuttaṃ ‘‘setodakā’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Supatitthā"
      },
      "ti sundaratitthā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ramaṇīyā"
      },
      "ti manoharabhūmibhāgatāya ramitabbā yathāvuttaudakasampattiyā ca manoramā."
    ],
    "innerText": "Idānīti adhunā. Luḷitanti madditaṃ viya ākulaṃ. Āvilanti ālulaṃ. Acchodakāti tanupasannasalilā. Sātodakāti madhuratoyā. Sītodakāti sītalajalā. Setodakāti nikkaddamā . Udakañhi sabhāvato setavaṇṇaṃ, bhūmivasena kaddamāvilatāya ca aññādisaṃ hoti, kakudhāpi nadī vimalavālikā samokiṇṇā setavaṇṇā sandati. Tena vuttaṃ ‘‘setodakā’’ti. Supatitthāti sundaratitthā. Ramaṇīyāti manoharabhūmibhāgatāya ramitabbā yathāvuttaudakasampattiyā ca manoramā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kilantosmi cundaka, nipajjissāmī"
      },
      "ti tathāgatassa hi –"
    ],
    "innerText": "Kilantosmi cundaka, nipajjissāmīti tathāgatassa hi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Kāḷāvakañca ",
      " gaṅgeyyaṃ, paṇḍaraṃ tambapiṅgalaṃ;"
    ],
    "innerText": "‘‘Kāḷāvakañca gaṅgeyyaṃ, paṇḍaraṃ tambapiṅgalaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Gandhamaṅgalahemañca, uposathachaddantime dasā’’ti. –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Evaṃ vuttesu dasasu hatthikulesu kāḷāvakasaṅkhātānaṃ yaṃ dasannaṃ pakatihatthīnaṃ balaṃ, taṃ ekassa gaṅgeyyassāti evaṃ dasaguṇitāya gaṇanāya pakatihatthīnaṃ koṭisahassabalappamāṇaṃ sarīrabalaṃ. Taṃ sabbampi tasmiṃ divase pacchābhattato paṭṭhāya caṅgavāre pakkhittaudakaṃ viya parikkhayaṃ gataṃ. Pāvāya tigāvute kusinārā. Etasmiṃ antare pañcavīsatiyā ṭhānesu nisīditvā mahantaṃ ussāhaṃ katvā āgacchanto sūriyatthaṅgamanavelāya bhagavā kusināraṃ pāpuṇīti evaṃ ‘‘rogo nāma sabbaṃ ārogyaṃ maddanto āgacchatī’’ti imamatthaṃ dassento sadevakassa lokassa saṃvegakaraṃ vācaṃ bhāsanto ‘‘kilantosmi, cundaka, nipajjissāmī’’ti āha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sīhaseyya"
      },
      "nti ettha kāmabhogīseyyā petaseyyā tathāgataseyyā sīhaseyyāti catasso seyyā. Tattha ‘‘yebhuyyena, bhikkhave, kāmabhogī vāmena passena seyyaṃ kappentī’’ti (a. ni. 4.246) ayaṃ kāmabhogīseyyā. ‘‘Yebhuyyena ",
      ", bhikkhave, petā uttānā sentī’’ti (a. ni. 4.246) ayaṃ petaseyyā. Catutthajjhānaṃ tathāgataseyyā. ‘‘Sīho, bhikkhave, migarājā dakkhiṇena passena seyyaṃ kappetī’’ti (a. ni. 4.246) ayaṃ sīhaseyyā. Ayañhi tejussadairiyāpathattā uttamaseyyā nāma. Tena vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘dakkhiṇena passena sīhaseyyaṃ kappesī’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāde pāda"
      },
      "nti dakkhiṇapāde vāmapādaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Accādhāyā"
      },
      "ti atiādhāya, gopphakaṃ atikkamma ṭhapetvā. Gopphakena hi gopphake, jāṇunā jāṇumhi saṅghaṭṭiyamāne abhiṇhaṃ vedanā uppajjanti ",
      ", seyyā phāsukā na hoti. Yathā pana na saṅghaṭṭeti, evaṃ atikkamma ṭhapite vedanā nuppajjanti, seyyā phāsukā hoti. Tasmā evaṃ nipajji."
    ],
    "innerText": "Sīhaseyyanti ettha kāmabhogīseyyā petaseyyā tathāgataseyyā sīhaseyyāti catasso seyyā. Tattha ‘‘yebhuyyena, bhikkhave, kāmabhogī vāmena passena seyyaṃ kappentī’’ti (a. ni. 4.246) ayaṃ kāmabhogīseyyā. ‘‘Yebhuyyena , bhikkhave, petā uttānā sentī’’ti (a. ni. 4.246) ayaṃ petaseyyā. Catutthajjhānaṃ tathāgataseyyā. ‘‘Sīho, bhikkhave, migarājā dakkhiṇena passena seyyaṃ kappetī’’ti (a. ni. 4.246) ayaṃ sīhaseyyā. Ayañhi tejussadairiyāpathattā uttamaseyyā nāma. Tena vuttaṃ – ‘‘dakkhiṇena passena sīhaseyyaṃ kappesī’’ti. Pāde pādanti dakkhiṇapāde vāmapādaṃ. Accādhāyāti atiādhāya, gopphakaṃ atikkamma ṭhapetvā. Gopphakena hi gopphake, jāṇunā jāṇumhi saṅghaṭṭiyamāne abhiṇhaṃ vedanā uppajjanti , seyyā phāsukā na hoti. Yathā pana na saṅghaṭṭeti, evaṃ atikkamma ṭhapite vedanā nuppajjanti, seyyā phāsukā hoti. Tasmā evaṃ nipajji."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gantvāna buddho"
      },
      "ti imā gāthā aparabhāge dhammasaṅgāhakehi ṭhapitā. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nadika"
      },
      "nti nadiṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appaṭimodha loke"
      },
      "ti appaṭimo idha imasmiṃ sadevake loke. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nhatvā ca pivitvā cudatārī"
      },
      "ti gattānaṃ sītikaraṇavasena nhatvā ca pānīyaṃ pivitvā ca nadito uttari. Tadā kira bhagavati nhāyante antonadiyaṃ macchakacchapā, udakaṃ, ubhosu tīresu vanasaṇḍo, sabbo ca so bhūmibhāgoti sabbaṃ suvaṇṇavaṇṇameva ahosi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purakkhato"
      },
      "ti guṇavisiṭṭhasattuttamagarubhāvato sadevakena lokena pūjāsammānavasena purakkhato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhikkhugaṇassa majjhe"
      },
      "ti bhikkhusaṅghassa majjhe. Tadā bhikkhū bhagavato vedanānaṃ adhimattabhāvaṃ viditvā āsannā hutvā samantato parivāretvāva gacchanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Satthā"
      },
      "ti diṭṭhadhammikasamparāyikaparamatthehi sattānaṃ anusāsanato satthā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pavattā bhagavā idha"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhamme"
      },
      "ti bhāgyavantatādīhi bhagavā idha sīlādisāsanadhamme pavattā, dhamme vā caturāsītidhammakkhandhasahassāni pavattā pavattetā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ambavana"
      },
      "nti tassā eva nadiyā tīre ambavanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āmantayi cundaka"
      },
      "nti tasmiṃ kira khaṇe āyasmā ānando udakasāṭikaṃ pīḷento ohīyi, cundakatthero samīpe ahosi. Tasmā ",
      " taṃ bhagavā āmantayi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pamukhe nisīdī"
      },
      "ti vattasīsena satthu purato nisīdi ‘‘kiṃ nu kho satthā āṇāpetī’’ti. Ettāvatā dhammabhaṇḍāgāriko anuppatto. Evaṃ anuppattaṃ atha kho bhagavā āyasmantaṃ ānandaṃ āmantesi."
    ],
    "innerText": "Gantvāna buddhoti imā gāthā aparabhāge dhammasaṅgāhakehi ṭhapitā. Tattha nadikanti nadiṃ. Appaṭimodha loketi appaṭimo idha imasmiṃ sadevake loke. Nhatvā ca pivitvā cudatārīti gattānaṃ sītikaraṇavasena nhatvā ca pānīyaṃ pivitvā ca nadito uttari. Tadā kira bhagavati nhāyante antonadiyaṃ macchakacchapā, udakaṃ, ubhosu tīresu vanasaṇḍo, sabbo ca so bhūmibhāgoti sabbaṃ suvaṇṇavaṇṇameva ahosi. Purakkhatoti guṇavisiṭṭhasattuttamagarubhāvato sadevakena lokena pūjāsammānavasena purakkhato. Bhikkhugaṇassa majjheti bhikkhusaṅghassa majjhe. Tadā bhikkhū bhagavato vedanānaṃ adhimattabhāvaṃ viditvā āsannā hutvā samantato parivāretvāva gacchanti. Satthāti diṭṭhadhammikasamparāyikaparamatthehi sattānaṃ anusāsanato satthā. Pavattā bhagavā idhadhammeti bhāgyavantatādīhi bhagavā idha sīlādisāsanadhamme pavattā, dhamme vā caturāsītidhammakkhandhasahassāni pavattā pavattetā. Ambavananti tassā eva nadiyā tīre ambavanaṃ. Āmantayi cundakanti tasmiṃ kira khaṇe āyasmā ānando udakasāṭikaṃ pīḷento ohīyi, cundakatthero samīpe ahosi. Tasmā taṃ bhagavā āmantayi. Pamukhe nisīdīti vattasīsena satthu purato nisīdi ‘‘kiṃ nu kho satthā āṇāpetī’’ti. Ettāvatā dhammabhaṇḍāgāriko anuppatto. Evaṃ anuppattaṃ atha kho bhagavā āyasmantaṃ ānandaṃ āmantesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upadaheyyā"
      },
      "ti uppādeyya, vippaṭisārassa uppādako koci puriso siyā api bhaveyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Alābhā"
      },
      "ti ye aññesaṃ dānaṃ dadantānaṃ dānānisaṃsasaṅkhātā lābhā honti, te alābhā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dulladdha"
      },
      "nti puññavisesena laddhampi manussattaṃ dulladdhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yassa te"
      },
      "ti yassa tava. Uttaṇḍulaṃ vā atikilinnaṃ vā ko taṃ jānāti, kīdisampi pacchimaṃ piṇḍapātaṃ bhuñjitvā tathāgato parinibbuto, addhā tena yaṃ vā taṃ vā dinnaṃ bhavissatīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lābhā"
      },
      "ti diṭṭhadhammikasamparāyikā dānānisaṃsasaṅkhātā lābhā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suladdha"
      },
      "nti tuyhaṃ manussattaṃ suladdhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammukhā"
      },
      "ti sammukhato, na anussavena na paramparāyāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Meta"
      },
      "nti me etaṃ mayā etaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dveme"
      },
      "ti dve ime. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samasamaphalā"
      },
      "ti sabbākārena samānaphalā."
    ],
    "innerText": "Upadaheyyāti uppādeyya, vippaṭisārassa uppādako koci puriso siyā api bhaveyya. Alābhāti ye aññesaṃ dānaṃ dadantānaṃ dānānisaṃsasaṅkhātā lābhā honti, te alābhā. Dulladdhanti puññavisesena laddhampi manussattaṃ dulladdhaṃ. Yassa teti yassa tava. Uttaṇḍulaṃ vā atikilinnaṃ vā ko taṃ jānāti, kīdisampi pacchimaṃ piṇḍapātaṃ bhuñjitvā tathāgato parinibbuto, addhā tena yaṃ vā taṃ vā dinnaṃ bhavissatīti. Lābhāti diṭṭhadhammikasamparāyikā dānānisaṃsasaṅkhātā lābhā. Suladdhanti tuyhaṃ manussattaṃ suladdhaṃ. Sammukhāti sammukhato, na anussavena na paramparāyāti attho. Metanti me etaṃ mayā etaṃ. Dvemeti dve ime. Samasamaphalāti sabbākārena samānaphalā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nanu ",
      " ca yaṃ sujātāya dinnaṃ piṇḍapātaṃ bhuñjitvā tathāgato abhisambuddho, taṃ kilesānaṃ appahīnakāle dānaṃ, idaṃ pana cundassa dānaṃ khīṇāsavakāle, kasmā etāni samaphalānīti? Parinibbānasamatāya samāpattisamatāya anussaraṇasamatāya ca. Bhagavā hi sujātāya dinnaṃ piṇḍapātaṃ bhuñjitvā saupādisesāya nibbānadhātuyā parinibbuto, cundena dinnaṃ bhuñjitvā anupādisesāya nibbānadhātuyā parinibbutoti evaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "parinibbānasamatāya"
      },
      "pi samaphalāni. Abhisambujjhanadivase ca aggamaggassa hetubhūtā catuvīsatikoṭisatasahassasaṅkhā samāpattiyo samāpajji, parinibbānadivasepi sabbā tā samāpajji. Evaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samāpattisamatāya"
      },
      "pi samaphalāni. Vuttañhetaṃ bhagavatā –"
    ],
    "innerText": "Nanu ca yaṃ sujātāya dinnaṃ piṇḍapātaṃ bhuñjitvā tathāgato abhisambuddho, taṃ kilesānaṃ appahīnakāle dānaṃ, idaṃ pana cundassa dānaṃ khīṇāsavakāle, kasmā etāni samaphalānīti? Parinibbānasamatāya samāpattisamatāya anussaraṇasamatāya ca. Bhagavā hi sujātāya dinnaṃ piṇḍapātaṃ bhuñjitvā saupādisesāya nibbānadhātuyā parinibbuto, cundena dinnaṃ bhuñjitvā anupādisesāya nibbānadhātuyā parinibbutoti evaṃ parinibbānasamatāyapi samaphalāni. Abhisambujjhanadivase ca aggamaggassa hetubhūtā catuvīsatikoṭisatasahassasaṅkhā samāpattiyo samāpajji, parinibbānadivasepi sabbā tā samāpajji. Evaṃ samāpattisamatāyapi samaphalāni. Vuttañhetaṃ bhagavatā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Yassa cetaṃ piṇḍapātaṃ ",
      " paribhuñjitvā anuttaraṃ appamāṇaṃ cetosamādhiṃ upasampajja viharati, appamāṇo tassa puññābhisando kusalābhisando’’tiādi. –"
    ],
    "innerText": "‘‘Yassa cetaṃ piṇḍapātaṃ paribhuñjitvā anuttaraṃ appamāṇaṃ cetosamādhiṃ upasampajja viharati, appamāṇo tassa puññābhisando kusalābhisando’’tiādi. –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Sujātā ca aparabhāge assosi ‘‘na kira sā rukkhadevatā, bodhisatto kiresa, taṃ kira piṇḍapātaṃ paribhuñjitvā anuttaraṃ sammāsambodhiṃ abhisambuddho, sattasattāhaṃ kirassa tena yāpanā ",
      " ahosī’’ti. Tassā idaṃ sutvā ‘‘lābhā vata me’’ti anussarantiyā balavapītisomanassaṃ udapādi. Cundassapi aparabhāge ‘‘avasānapiṇḍapāto kira mayā dinno, dhammasīsaṃ kira mayā gahitaṃ, mayhaṃ kira piṇḍapātaṃ paribhuñjitvā satthā attanā cirakālābhipatthitāya anupādisesāya nibbānadhātuyā parinibbuto’’ti sutvā ‘‘lābhā vata me’’ti anussarato balavapītisomanassaṃ udapādi. Evaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anussaraṇasamatāya"
      },
      "pi samaphalāni dvepi piṇḍapātadānānīti veditabbāni."
    ],
    "innerText": "Sujātā ca aparabhāge assosi ‘‘na kira sā rukkhadevatā, bodhisatto kiresa, taṃ kira piṇḍapātaṃ paribhuñjitvā anuttaraṃ sammāsambodhiṃ abhisambuddho, sattasattāhaṃ kirassa tena yāpanā ahosī’’ti. Tassā idaṃ sutvā ‘‘lābhā vata me’’ti anussarantiyā balavapītisomanassaṃ udapādi. Cundassapi aparabhāge ‘‘avasānapiṇḍapāto kira mayā dinno, dhammasīsaṃ kira mayā gahitaṃ, mayhaṃ kira piṇḍapātaṃ paribhuñjitvā satthā attanā cirakālābhipatthitāya anupādisesāya nibbānadhātuyā parinibbuto’’ti sutvā ‘‘lābhā vata me’’ti anussarato balavapītisomanassaṃ udapādi. Evaṃ anussaraṇasamatāyapi samaphalāni dvepi piṇḍapātadānānīti veditabbāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āyusaṃvattanika"
      },
      "nti dīghāyukasaṃvattanikaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upacita"
      },
      "nti pasutaṃ uppāditaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yasasaṃvattanika"
      },
      "nti parivārasaṃvattanikaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ādhipateyyasaṃvattanika"
      },
      "nti seṭṭhabhāvasaṃvattanikaṃ."
    ],
    "innerText": "Āyusaṃvattanikanti dīghāyukasaṃvattanikaṃ. Upacitanti pasutaṃ uppāditaṃ. Yasasaṃvattanikanti parivārasaṃvattanikaṃ. Ādhipateyyasaṃvattanikanti seṭṭhabhāvasaṃvattanikaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etamatthaṃ viditvā"
      },
      "ti etaṃ dānassa mahapphalatañceva sīlādiguṇehi attano ca anuttaradakkhiṇeyyabhāvaṃ anupādāparinibbānañcāti tividhampi atthaṃ sabbākārato viditvā tadatthadīpanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "imaṃ udānaṃ udānesi"
      },
      "."
    ],
    "innerText": "Etamatthaṃ viditvāti etaṃ dānassa mahapphalatañceva sīlādiguṇehi attano ca anuttaradakkhiṇeyyabhāvaṃ anupādāparinibbānañcāti tividhampi atthaṃ sabbākārato viditvā tadatthadīpanaṃ imaṃ udānaṃ udānesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dadato puññaṃ pavaḍḍhatī"
      },
      "ti dānaṃ dentassa cittasampattiyā ca dakkhiṇeyyasampattiyā ca dānamayaṃ puññaṃ upacīyati, mahapphalatarañca mahānisaṃsatarañca hotīti attho. Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dadato puññaṃ pavaḍḍhatī"
      },
      "ti deyyadhammaṃ pariccajanto pariccāgacetanāya bahulīkatāya anukkamena sabbattha anāpattibahulo suvisuddhasīlaṃ rakkhitvā samathavipassanañca bhāvetuṃ sakkotīti tassa dānādivasena tividhampi puññaṃ abhivaḍḍhatīti evamettha attho veditabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṃyamato"
      },
      "ti ",
      " sīlasaṃyamena saṃyamantassa, saṃvare ṭhitassāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Veraṃ na cīyatī"
      },
      "ti pañcavidhaveraṃ na pavaḍḍhati, adosapadhānattā vā adhisīlassa kāyavācācittehi sayaṃmanto suvisuddhasīlo khantibahulatāya kenaci veraṃ na karoti, kuto tassa upacayo. Tasmā tassa saṃyamato saṃyamantassa, saṃyamahetu vā veraṃ na cīyati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kusalo ca jahāti pāpaka"
      },
      "nti kusalo pana ñāṇasampanno suvisuddhasīle patiṭṭhito aṭṭhatiṃsāya ārammaṇesu attano anurūpaṃ kammaṭṭhānaṃ gahetvā upacārappanābhedaṃ jhānaṃ sampādento pāpakaṃ lāmakaṃ kāmacchandādiakusalaṃ vikkhambhanavasena jahāti pariccajati. So tameva jhānaṃ pādakaṃ katvā saṅkhāresu khayavayaṃ paṭṭhapetvā vipassanāya kammaṃ karonto vipassanaṃ ussukkāpetvā ariyamaggena anavasesaṃ pāpakaṃ lāmakaṃ akusalaṃ samucchedavasena jahāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rāgadosamohakkhayā sa nibbuto"
      },
      "ti so evaṃ pāpakaṃ pajahitvā rāgādīnaṃ khayā anavasesakilesanibbānena, tato paraṃ khandhanibbānena ca nibbuto ",
      " hotīti evaṃ bhagavā cundassa ca dakkhiṇasampattiṃ, attano ca dakkhiṇeyyasampattiṃ nissāya pītivegavissaṭṭhaṃ udānaṃ udānesi."
    ],
    "innerText": "Tattha dadato puññaṃ pavaḍḍhatīti dānaṃ dentassa cittasampattiyā ca dakkhiṇeyyasampattiyā ca dānamayaṃ puññaṃ upacīyati, mahapphalatarañca mahānisaṃsatarañca hotīti attho. Atha vā dadato puññaṃ pavaḍḍhatīti deyyadhammaṃ pariccajanto pariccāgacetanāya bahulīkatāya anukkamena sabbattha anāpattibahulo suvisuddhasīlaṃ rakkhitvā samathavipassanañca bhāvetuṃ sakkotīti tassa dānādivasena tividhampi puññaṃ abhivaḍḍhatīti evamettha attho veditabbo. Saṃyamatoti sīlasaṃyamena saṃyamantassa, saṃvare ṭhitassāti attho. Veraṃ na cīyatīti pañcavidhaveraṃ na pavaḍḍhati, adosapadhānattā vā adhisīlassa kāyavācācittehi sayaṃmanto suvisuddhasīlo khantibahulatāya kenaci veraṃ na karoti, kuto tassa upacayo. Tasmā tassa saṃyamato saṃyamantassa, saṃyamahetu vā veraṃ na cīyati. Kusalo ca jahāti pāpakanti kusalo pana ñāṇasampanno suvisuddhasīle patiṭṭhito aṭṭhatiṃsāya ārammaṇesu attano anurūpaṃ kammaṭṭhānaṃ gahetvā upacārappanābhedaṃ jhānaṃ sampādento pāpakaṃ lāmakaṃ kāmacchandādiakusalaṃ vikkhambhanavasena jahāti pariccajati. So tameva jhānaṃ pādakaṃ katvā saṅkhāresu khayavayaṃ paṭṭhapetvā vipassanāya kammaṃ karonto vipassanaṃ ussukkāpetvā ariyamaggena anavasesaṃ pāpakaṃ lāmakaṃ akusalaṃ samucchedavasena jahāti. Rāgadosamohakkhayā sa nibbutoti so evaṃ pāpakaṃ pajahitvā rāgādīnaṃ khayā anavasesakilesanibbānena, tato paraṃ khandhanibbānena ca nibbuto hotīti evaṃ bhagavā cundassa ca dakkhiṇasampattiṃ, attano ca dakkhiṇeyyasampattiṃ nissāya pītivegavissaṭṭhaṃ udānaṃ udānesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pañcamasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Pāṭaligāmiyasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "76"
      },
      ". Chaṭṭhe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "magadhesū"
      },
      "ti magadharaṭṭhe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahatā"
      },
      "ti idhāpi guṇamahattenapi aparicchinnasaṅkhyattā gaṇanamahattenapi mahatā bhikkhusaṅghena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāṭaligāmo"
      },
      "ti evaṃnāmako magadharaṭṭhe eko gāmo. Tassa kira gāmassa māpanadivase ",
      " gāmaggahaṇaṭṭhāne dve tayo pāṭalaṅkurā pathavito ubbhijjitvā ",
      " nikkhamiṃsu. Tena taṃ ‘‘pāṭaligāmo’’tveva vohariṃsu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tadavasarī"
      },
      "ti taṃ pāṭaligāmaṃ avasari anupāpuṇi. Kadā pana bhagavā pāṭaligāmaṃ anupāpuṇi? Heṭṭhā vuttanayena sāvatthiyaṃ dhammasenāpatino cetiyaṃ kārāpetvā tato nikkhamitvā rājagahe vasanto tattha āyasmato mahāmoggallānassa ca cetiyaṃ kārāpetvā tato nikkhamitvā ambalaṭṭhikāyaṃ vasitvā aturitacārikāvasena janapadacārikaṃ caranto tattha tattha ekarattivāsena vasitvā lokaṃ anuggaṇhanto anukkamena pāṭaligāmaṃ anupāpuṇi."
    ],
    "innerText": "76. Chaṭṭhe magadhesūti magadharaṭṭhe. Mahatāti idhāpi guṇamahattenapi aparicchinnasaṅkhyattā gaṇanamahattenapi mahatā bhikkhusaṅghena. Pāṭaligāmoti evaṃnāmako magadharaṭṭhe eko gāmo. Tassa kira gāmassa māpanadivase gāmaggahaṇaṭṭhāne dve tayo pāṭalaṅkurā pathavito ubbhijjitvā nikkhamiṃsu. Tena taṃ ‘‘pāṭaligāmo’’tveva vohariṃsu. Tadavasarīti taṃ pāṭaligāmaṃ avasari anupāpuṇi. Kadā pana bhagavā pāṭaligāmaṃ anupāpuṇi? Heṭṭhā vuttanayena sāvatthiyaṃ dhammasenāpatino cetiyaṃ kārāpetvā tato nikkhamitvā rājagahe vasanto tattha āyasmato mahāmoggallānassa ca cetiyaṃ kārāpetvā tato nikkhamitvā ambalaṭṭhikāyaṃ vasitvā aturitacārikāvasena janapadacārikaṃ caranto tattha tattha ekarattivāsena vasitvā lokaṃ anuggaṇhanto anukkamena pāṭaligāmaṃ anupāpuṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāṭaligāmiyā"
      },
      "ti pāṭaligāmavāsino upāsakā. Te kira bhagavato paṭhamadassanena keci saraṇesu, keci sīlesu, keci saraṇesu ca sīlesu ca patiṭṭhitā. Tena vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘upāsakā’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yena bhagavā tenupasaṅkamiṃsū"
      },
      "ti pāṭaligāme kira ajātasattuno licchavirājūnañca manussā kālena kālaṃ gantvā gehasāmike gehato nīharitvā māsampi aḍḍhamāsampi vasanti. Tena pāṭaligāmavāsino manussā niccupaddutā ‘‘etesañceva āgatakāle vasanaṭṭhānaṃ bhavissatī’’ti ekapasse issarānaṃ bhaṇḍappaṭisāmanaṭṭhānaṃ, ekapasse vasanaṭṭhānaṃ, ekapasse āgantukānaṃ addhikamanussānaṃ, ekapasse daliddānaṃ kapaṇamanussānaṃ, ekapasse gilānānaṃ vasanaṭṭhānaṃ bhavissatīti sabbesaṃ aññamaññaṃ aghaṭṭetvā vasanappahonakaṃ nagaramajjhe mahāsālaṃ kāresuṃ, tassā nāmaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āvasathāgāra"
      },
      "nti. Taṃ divasañca niṭṭhānaṃ agamāsi. Te tattha gantvā hatthakammasudhākammacittakammādivasena supariniṭṭhitaṃ susajjitaṃ devavimānasadisaṃ taṃ dvārakoṭṭhakato paṭṭhāya oloketvā ‘‘idaṃ āvasathāgāraṃ ativiya manoramaṃ sassirikaṃ, kena nu ",
      " kho paṭhamaṃ paribhuttaṃ amhākaṃ dīgharattaṃ hitāya sukhāya assā’’ti cintesuṃ, tasmiṃyeva ca khaṇe ‘‘bhagavā taṃ gāmaṃ anuppatto’’ti assosuṃ. Tena te uppannapītisomanassā ‘‘amhehi bhagavā gantvāpi ",
      " ānetabbo siyā, so pana sayameva amhākaṃ vasanaṭṭhānaṃ sampatto, ajja mayaṃ bhagavantaṃ idha vasāpetvā paṭhamaṃ paribhuñjāpessāma tathā bhikkhusaṅghaṃ, bhikkhusaṅghe āgate tepiṭakaṃ buddhavacanaṃ āgatameva bhavissati, satthāraṃ maṅgalaṃ vadāpessāma, dhammaṃ kathāpessāma. Iti tīhi ratanehi paribhutte pacchā amhākañca paresañca paribhogo bhavissati, evaṃ no dīgharattaṃ ",
      " hitāya sukhāya bhavissatī’’ti sanniṭṭhānaṃ katvā etadatthameva bhagavantaṃ upasaṅkamiṃsu. Tasmā evamāhaṃsu – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘adhivāsetu no, bhante bhagavā, āvasathāgāra’’"
      },
      "nti."
    ],
    "innerText": "Pāṭaligāmiyāti pāṭaligāmavāsino upāsakā. Te kira bhagavato paṭhamadassanena keci saraṇesu, keci sīlesu, keci saraṇesu ca sīlesu ca patiṭṭhitā. Tena vuttaṃ ‘‘upāsakā’’ti. Yena bhagavā tenupasaṅkamiṃsūti pāṭaligāme kira ajātasattuno licchavirājūnañca manussā kālena kālaṃ gantvā gehasāmike gehato nīharitvā māsampi aḍḍhamāsampi vasanti. Tena pāṭaligāmavāsino manussā niccupaddutā ‘‘etesañceva āgatakāle vasanaṭṭhānaṃ bhavissatī’’ti ekapasse issarānaṃ bhaṇḍappaṭisāmanaṭṭhānaṃ, ekapasse vasanaṭṭhānaṃ, ekapasse āgantukānaṃ addhikamanussānaṃ, ekapasse daliddānaṃ kapaṇamanussānaṃ, ekapasse gilānānaṃ vasanaṭṭhānaṃ bhavissatīti sabbesaṃ aññamaññaṃ aghaṭṭetvā vasanappahonakaṃ nagaramajjhe mahāsālaṃ kāresuṃ, tassā nāmaṃ āvasathāgāranti. Taṃ divasañca niṭṭhānaṃ agamāsi. Te tattha gantvā hatthakammasudhākammacittakammādivasena supariniṭṭhitaṃ susajjitaṃ devavimānasadisaṃ taṃ dvārakoṭṭhakato paṭṭhāya oloketvā ‘‘idaṃ āvasathāgāraṃ ativiya manoramaṃ sassirikaṃ, kena nu kho paṭhamaṃ paribhuttaṃ amhākaṃ dīgharattaṃ hitāya sukhāya assā’’ti cintesuṃ, tasmiṃyeva ca khaṇe ‘‘bhagavā taṃ gāmaṃ anuppatto’’ti assosuṃ. Tena te uppannapītisomanassā ‘‘amhehi bhagavā gantvāpi ānetabbo siyā, so pana sayameva amhākaṃ vasanaṭṭhānaṃ sampatto, ajja mayaṃ bhagavantaṃ idha vasāpetvā paṭhamaṃ paribhuñjāpessāma tathā bhikkhusaṅghaṃ, bhikkhusaṅghe āgate tepiṭakaṃ buddhavacanaṃ āgatameva bhavissati, satthāraṃ maṅgalaṃ vadāpessāma, dhammaṃ kathāpessāma. Iti tīhi ratanehi paribhutte pacchā amhākañca paresañca paribhogo bhavissati, evaṃ no dīgharattaṃ hitāya sukhāya bhavissatī’’ti sanniṭṭhānaṃ katvā etadatthameva bhagavantaṃ upasaṅkamiṃsu. Tasmā evamāhaṃsu – ‘‘adhivāsetu no, bhante bhagavā, āvasathāgāra’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yena āvasathāgāraṃ tenupasaṅkamiṃsū"
      },
      "ti kiñcāpi taṃ taṃ divasameva pariniṭṭhitattā devavimānaṃ viya susajjitaṃ supaṭijaggitaṃ, buddhārahaṃ pana katvā na paññattaṃ, ‘‘buddhā nāma araññajjhāsayā araññārāmā, antogāme vaseyyuṃ vā no vā, tasmā bhagavato ruciṃ jānitvāva paññāpessāmā’’ti cintetvā te bhagavantaṃ upasaṅkamiṃsu, idāni bhagavato ruciṃ jānitvā tathā paññāpetukāmā yena āvasathāgāraṃ tenupasaṅkamiṃsu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbasanthariṃ āvasathāgāraṃ santharitvā"
      },
      "ti yathā sabbameva santhataṃ hoti, evaṃ taṃ santharitvā sabbapaṭhamaṃ tāva ‘‘gomayaṃ nāma sabbamaṅgalesu vattatī’’ti sudhāparikammakatampi bhūmiṃ allagomayena opuñjāpetvā parisukkhabhāvaṃ ñatvā yathā akkantaṭṭhāne padaṃ na paññāyati, evaṃ catujjātiyagandhehi limpetvā upari nānāvaṇṇakaṭasārake santharitvā tesaṃ upari mahāpiṭṭhikakojavādiṃ katvā hatthattharaṇādīhi nānāvaṇṇehi attharaṇehi santharitabbayuttakaṃ sabbokāsaṃ santharāpesuṃ. Tena vuttaṃ – ‘‘sabbasanthariṃ āvasathāgāraṃ santharitvā’’ti."
    ],
    "innerText": "Yena āvasathāgāraṃ tenupasaṅkamiṃsūti kiñcāpi taṃ taṃ divasameva pariniṭṭhitattā devavimānaṃ viya susajjitaṃ supaṭijaggitaṃ, buddhārahaṃ pana katvā na paññattaṃ, ‘‘buddhā nāma araññajjhāsayā araññārāmā, antogāme vaseyyuṃ vā no vā, tasmā bhagavato ruciṃ jānitvāva paññāpessāmā’’ti cintetvā te bhagavantaṃ upasaṅkamiṃsu, idāni bhagavato ruciṃ jānitvā tathā paññāpetukāmā yena āvasathāgāraṃ tenupasaṅkamiṃsu. Sabbasanthariṃ āvasathāgāraṃ santharitvāti yathā sabbameva santhataṃ hoti, evaṃ taṃ santharitvā sabbapaṭhamaṃ tāva ‘‘gomayaṃ nāma sabbamaṅgalesu vattatī’’ti sudhāparikammakatampi bhūmiṃ allagomayena opuñjāpetvā parisukkhabhāvaṃ ñatvā yathā akkantaṭṭhāne padaṃ na paññāyati, evaṃ catujjātiyagandhehi limpetvā upari nānāvaṇṇakaṭasārake santharitvā tesaṃ upari mahāpiṭṭhikakojavādiṃ katvā hatthattharaṇādīhi nānāvaṇṇehi attharaṇehi santharitabbayuttakaṃ sabbokāsaṃ santharāpesuṃ. Tena vuttaṃ – ‘‘sabbasanthariṃ āvasathāgāraṃ santharitvā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Āsanānañhi majjhaṭṭhāne tāva maṅgalathambhaṃ nissāya mahārahaṃ buddhāsanaṃ paññāpetvā tattha yaṃ yaṃ mudukañca manoramañca paccattharaṇaṃ, taṃ taṃ paccattharitvā ubhatolohitakaṃ manuññadassanaṃ upadhānaṃ ",
      " upadahitvā upari suvaṇṇarajatatārakāvicittaṃ vitānaṃ bandhitvā gandhadāmapupphadāmādīhi alaṅkaritvā samantā dvādasahatthe ṭhāne pupphajālaṃ kāretvā tiṃsahatthamattaṭṭhānaṃ paṭasāṇiyā parikkhipāpetvā pacchimabhittiṃ nissāya bhikkhusaṅghassa pallaṅkaapassayamañcapīṭhādīni paññāpetvā upari setapaccattharaṇehi paccattharāpetvā sālāya pācīnapassaṃ attano nisajjāyoggaṃ kāresuṃ. Taṃ sandhāya vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘āsanāni paññāpetvā’’"
      },
      "ti."
    ],
    "innerText": "Āsanānañhi majjhaṭṭhāne tāva maṅgalathambhaṃ nissāya mahārahaṃ buddhāsanaṃ paññāpetvā tattha yaṃ yaṃ mudukañca manoramañca paccattharaṇaṃ, taṃ taṃ paccattharitvā ubhatolohitakaṃ manuññadassanaṃ upadhānaṃ upadahitvā upari suvaṇṇarajatatārakāvicittaṃ vitānaṃ bandhitvā gandhadāmapupphadāmādīhi alaṅkaritvā samantā dvādasahatthe ṭhāne pupphajālaṃ kāretvā tiṃsahatthamattaṭṭhānaṃ paṭasāṇiyā parikkhipāpetvā pacchimabhittiṃ nissāya bhikkhusaṅghassa pallaṅkaapassayamañcapīṭhādīni paññāpetvā upari setapaccattharaṇehi paccattharāpetvā sālāya pācīnapassaṃ attano nisajjāyoggaṃ kāresuṃ. Taṃ sandhāya vuttaṃ ‘‘āsanāni paññāpetvā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Udakamaṇika"
      },
      "nti mahākucchikaṃ udakacāṭiṃ. Evaṃ bhagavā bhikkhusaṅgho ca yathāruciyā hatthapāde ",
      " dhovissanti, mukhaṃ vikkhālessantīti tesu tesu ṭhānesu maṇivaṇṇassa udakassa pūretvā vāsatthāya nānāpupphāni ceva udakavāsacuṇṇāni ca pakkhipitvā kadalipaṇṇehi pidahitvā patiṭṭhapesuṃ. Tena vuttaṃ ‘‘udakamaṇikaṃ patiṭṭhāpetvā’’ti."
    ],
    "innerText": "Udakamaṇikanti mahākucchikaṃ udakacāṭiṃ. Evaṃ bhagavā bhikkhusaṅgho ca yathāruciyā hatthapāde dhovissanti, mukhaṃ vikkhālessantīti tesu tesu ṭhānesu maṇivaṇṇassa udakassa pūretvā vāsatthāya nānāpupphāni ceva udakavāsacuṇṇāni ca pakkhipitvā kadalipaṇṇehi pidahitvā patiṭṭhapesuṃ. Tena vuttaṃ ‘‘udakamaṇikaṃ patiṭṭhāpetvā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Telappadīpaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āropetvā"
      },
      "ti rajatasuvaṇṇādimayadaṇḍadīpikāsu yodhakarūpavilāsakhacitarūpakādīnaṃ hatthe ṭhapitasuvaṇṇarajatādimayakapallikāsu telappadīpaṃ jālayitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yena bhagavā tenupasaṅkamiṃsū"
      },
      "ti ettha pana te pāṭaligāmiyā upāsakā na kevalaṃ āvasathāgārameva, atha kho sakalasmimpi gāme vīthiyo sajjāpetvā dhaje ussāpetvā gehadvāresu puṇṇaghaṭe kadaliyo ca ṭhapāpetvā sakalagāmaṃ dīpamālāhi vippakiṇṇatārakaṃ viya katvā ‘‘khīrapake dārake khīraṃ pāyetha, daharakumāre lahuṃ lahuṃ bhojetvā sayāpetha, uccāsaddaṃ mā karittha, ajja ekarattiṃ satthā antogāme vasissati, buddhā nāma appasaddakāmā hontī’’ti bheriṃ carāpetvā sayaṃ ",
      " daṇḍadīpikā ādāya yena bhagavā tenupasaṅkamiṃsu."
    ],
    "innerText": "Telappadīpaṃāropetvāti rajatasuvaṇṇādimayadaṇḍadīpikāsu yodhakarūpavilāsakhacitarūpakādīnaṃ hatthe ṭhapitasuvaṇṇarajatādimayakapallikāsu telappadīpaṃ jālayitvā. Yena bhagavā tenupasaṅkamiṃsūti ettha pana te pāṭaligāmiyā upāsakā na kevalaṃ āvasathāgārameva, atha kho sakalasmimpi gāme vīthiyo sajjāpetvā dhaje ussāpetvā gehadvāresu puṇṇaghaṭe kadaliyo ca ṭhapāpetvā sakalagāmaṃ dīpamālāhi vippakiṇṇatārakaṃ viya katvā ‘‘khīrapake dārake khīraṃ pāyetha, daharakumāre lahuṃ lahuṃ bhojetvā sayāpetha, uccāsaddaṃ mā karittha, ajja ekarattiṃ satthā antogāme vasissati, buddhā nāma appasaddakāmā hontī’’ti bheriṃ carāpetvā sayaṃ daṇḍadīpikā ādāya yena bhagavā tenupasaṅkamiṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atha kho bhagavā nivāsetvā pattacīvaramādāya saddhiṃ bhikkhusaṅghena yena āvasathāgāraṃ tenupasaṅkamī"
      },
      "ti ‘‘yassa dāni, bhante, bhagavā kālaṃ maññatī’’ti evaṃ kira tehi kāle ārocite bhagavā lākhārasena tintarattakoviḷārapupphavaṇṇaṃ rattadupaṭṭaṃ kattariyā padumaṃ kantento viya, saṃvidhāya timaṇḍalaṃ paṭicchādento nivāsetvā suvaṇṇapāmaṅgena padumakalāpaṃ parikkhipanto viya, vijjulatāsassirikaṃ kāyabandhanaṃ bandhitvā rattakambalena gajakumbhaṃ pariyonandhanto viya, ratanasatubbedhe suvaṇṇagghike pavāḷajālaṃ khipamāno viya, mahati suvaṇṇacetiye rattakambalakañcukaṃ paṭimuñcanto viya, gacchantaṃ puṇṇacandaṃ rattavalāhakena paṭicchādento viya, kañcanagirimatthake supakkalākhārasaṃ parisiñcanto viya, cittakūṭapabbatamatthakaṃ vijjulatājālena parikkhipanto viya, sakalacakkavāḷasineruyugandharamahāpathaviṃ cāletvā gahitanigrodhapallavasamānavaṇṇaṃ surattavarapaṃsukūlaṃ pārupitvā vanagahanato nikkhantakesarasīho viya, samantato udayapabbatakūṭato puṇṇacando viya, bālasūriyo viya ca attanā nisinnacārumaṇḍapato nikkhami."
    ],
    "innerText": "Atha kho bhagavā nivāsetvā pattacīvaramādāya saddhiṃ bhikkhusaṅghena yena āvasathāgāraṃ tenupasaṅkamīti ‘‘yassa dāni, bhante, bhagavā kālaṃ maññatī’’ti evaṃ kira tehi kāle ārocite bhagavā lākhārasena tintarattakoviḷārapupphavaṇṇaṃ rattadupaṭṭaṃ kattariyā padumaṃ kantento viya, saṃvidhāya timaṇḍalaṃ paṭicchādento nivāsetvā suvaṇṇapāmaṅgena padumakalāpaṃ parikkhipanto viya, vijjulatāsassirikaṃ kāyabandhanaṃ bandhitvā rattakambalena gajakumbhaṃ pariyonandhanto viya, ratanasatubbedhe suvaṇṇagghike pavāḷajālaṃ khipamāno viya, mahati suvaṇṇacetiye rattakambalakañcukaṃ paṭimuñcanto viya, gacchantaṃ puṇṇacandaṃ rattavalāhakena paṭicchādento viya, kañcanagirimatthake supakkalākhārasaṃ parisiñcanto viya, cittakūṭapabbatamatthakaṃ vijjulatājālena parikkhipanto viya, sakalacakkavāḷasineruyugandharamahāpathaviṃ cāletvā gahitanigrodhapallavasamānavaṇṇaṃ surattavarapaṃsukūlaṃ pārupitvā vanagahanato nikkhantakesarasīho viya, samantato udayapabbatakūṭato puṇṇacando viya, bālasūriyo viya ca attanā nisinnacārumaṇḍapato nikkhami."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Athassa kāyato meghamukhato vijjukalāpā viya rasmiyo nikkhamitvā suvaṇṇarasadhārāparisekapiñjarapattapupphaphalasākhāviṭape viya samantato rukkhe kariṃsu. Tāvadeva attano attano pattacīvaramādāya mahābhikkhusaṅgho bhagavantaṃ parivāresi. Te ca naṃ parivāretvā ṭhitā bhikkhū ",
      " evarūpā ahesuṃ appicchā santuṭṭhā pavivittā asaṃsaṭṭhā āraddhavīriyā vattāro vacanakkhamā ",
      " codakā pāpagarahino sīlasampannā samādhisampannā paññāsampannā vimuttisampannā vimuttiñāṇadassanasampannā. Tehi parivuto bhagavā rattakambalaparikkhitto viya suvaṇṇakkhandho, nakkhattaparivārito viya puṇṇacando, rattapadumavanasaṇḍamajjhagatā ",
      " viya suvaṇṇanāvā, pavāḷavedikaparikkhitto viya suvaṇṇapāsādo virocittha. Mahākassapappamukhā pana mahātherā meghavaṇṇaṃ paṃsukūlacīvaraṃ pārupitvā maṇivammavammitā viya mahānāgā parivārayiṃsu vantarāgā bhinnakilesā vijaṭitajaṭā chinnabandhanā kule vā gaṇe vā alaggā."
    ],
    "innerText": "Athassa kāyato meghamukhato vijjukalāpā viya rasmiyo nikkhamitvā suvaṇṇarasadhārāparisekapiñjarapattapupphaphalasākhāviṭape viya samantato rukkhe kariṃsu. Tāvadeva attano attano pattacīvaramādāya mahābhikkhusaṅgho bhagavantaṃ parivāresi. Te ca naṃ parivāretvā ṭhitā bhikkhū evarūpā ahesuṃ appicchā santuṭṭhā pavivittā asaṃsaṭṭhā āraddhavīriyā vattāro vacanakkhamā codakā pāpagarahino sīlasampannā samādhisampannā paññāsampannā vimuttisampannā vimuttiñāṇadassanasampannā. Tehi parivuto bhagavā rattakambalaparikkhitto viya suvaṇṇakkhandho, nakkhattaparivārito viya puṇṇacando, rattapadumavanasaṇḍamajjhagatā viya suvaṇṇanāvā, pavāḷavedikaparikkhitto viya suvaṇṇapāsādo virocittha. Mahākassapappamukhā pana mahātherā meghavaṇṇaṃ paṃsukūlacīvaraṃ pārupitvā maṇivammavammitā viya mahānāgā parivārayiṃsu vantarāgā bhinnakilesā vijaṭitajaṭā chinnabandhanā kule vā gaṇe vā alaggā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Iti bhagavā sayaṃ vītarāgo vītarāgehi, vītadoso vītadosehi, vītamoho vītamohehi, nittaṇho nittaṇhehi, nikkileso nikkilesehi, sayaṃ buddho anubuddhehi parivārito pattaparivāritaṃ viya kesaraṃ, kesaraparivāritā viya kaṇṇikā, aṭṭhanāgasahassaparivārito viya chaddanto nāgarājā, navutihaṃsasahassaparivārito viya dhataraṭṭho haṃsarājā, senaṅgaparivārito viya cakkavattirājā, marugaṇaparivārito viya sakko devarājā, brahmagaṇaparivārito viya hāritamahābrahmā, tārāgaṇaparivārito viya puṇṇacando, anupamena buddhavesena aparimāṇena buddhavilāsena pāṭaligāminaṃ maggaṃ paṭipajji."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Athassa puratthimakāyato suvaṇṇavaṇṇā ghanabuddharasmiyo uṭṭhahitvā asītihatthaṭṭhānaṃ aggahesuṃ, tathā pacchimakāyato dakkhiṇapassato vāmapassato suvaṇṇavaṇṇā ghanabuddharasmiyo uṭṭhahitvā asītihatthaṭṭhānaṃ aggahesuṃ, uparikesantato paṭṭhāya sabbakesāvaṭṭehi moragīvarājavaṇṇā asitā ghanabuddharasmiyo uṭṭhahitvā gaganatale asītihatthaṭṭhānaṃ aggahesuṃ, heṭṭhāpādatalehi pavāḷavaṇṇā rasmiyo uṭṭhahitvā ghanapathaviyaṃ asītihatthaṭṭhānaṃ aggahesuṃ, dantato akkhīnaṃ setaṭṭhānato, nakhānaṃ maṃsavimuttaṭṭhānato odātā ghanabuddharasmiyo uṭṭhahitvā asītihatthaṭṭhānaṃ aggahesuṃ, rattapītavaṇṇānaṃ sambhinnaṭṭhānato mañjeṭṭhavaṇṇā rasmiyo uṭṭhahitvā asītihatthaṭṭhānaṃ aggahesuṃ, sabbatthakameva pabhassarā rasmiyo uṭṭhahiṃsu. Evaṃ samantā asītihatthaṭṭhānaṃ chabbaṇṇā buddharasmiyo vijjotamānā vipphandamānā vidhāvamānā kañcanadaṇḍadīpikādīhi ",
      " niccharitvā ākāsaṃ pakkhandamānā mahāpadīpajālā viya, cātuddīpikamahāmeghato nikkhantavijjulatā ",
      " viya ca disodisaṃ pakkhandiṃsu. Yāhi sabbe disābhāgā suvaṇṇacampakapupphehi vikiriyamānā viya, suvaṇṇaghaṭato suvaṇṇarasadhārāhi āsiñciyamānā viya, pasāritasuvaṇṇapaṭaparikkhittā viya, verambhavātena samuddhatakiṃsukakaṇikārakoviḷārapupphacuṇṇasamokiṇṇā viya, cīnapiṭṭhacuṇṇasamparirañjitā viya ca virociṃsu."
    ],
    "innerText": "Athassa puratthimakāyato suvaṇṇavaṇṇā ghanabuddharasmiyo uṭṭhahitvā asītihatthaṭṭhānaṃ aggahesuṃ, tathā pacchimakāyato dakkhiṇapassato vāmapassato suvaṇṇavaṇṇā ghanabuddharasmiyo uṭṭhahitvā asītihatthaṭṭhānaṃ aggahesuṃ, uparikesantato paṭṭhāya sabbakesāvaṭṭehi moragīvarājavaṇṇā asitā ghanabuddharasmiyo uṭṭhahitvā gaganatale asītihatthaṭṭhānaṃ aggahesuṃ, heṭṭhāpādatalehi pavāḷavaṇṇā rasmiyo uṭṭhahitvā ghanapathaviyaṃ asītihatthaṭṭhānaṃ aggahesuṃ, dantato akkhīnaṃ setaṭṭhānato, nakhānaṃ maṃsavimuttaṭṭhānato odātā ghanabuddharasmiyo uṭṭhahitvā asītihatthaṭṭhānaṃ aggahesuṃ, rattapītavaṇṇānaṃ sambhinnaṭṭhānato mañjeṭṭhavaṇṇā rasmiyo uṭṭhahitvā asītihatthaṭṭhānaṃ aggahesuṃ, sabbatthakameva pabhassarā rasmiyo uṭṭhahiṃsu. Evaṃ samantā asītihatthaṭṭhānaṃ chabbaṇṇā buddharasmiyo vijjotamānā vipphandamānā vidhāvamānā kañcanadaṇḍadīpikādīhi niccharitvā ākāsaṃ pakkhandamānā mahāpadīpajālā viya, cātuddīpikamahāmeghato nikkhantavijjulatā viya ca disodisaṃ pakkhandiṃsu. Yāhi sabbe disābhāgā suvaṇṇacampakapupphehi vikiriyamānā viya, suvaṇṇaghaṭato suvaṇṇarasadhārāhi āsiñciyamānā viya, pasāritasuvaṇṇapaṭaparikkhittā viya, verambhavātena samuddhatakiṃsukakaṇikārakoviḷārapupphacuṇṇasamokiṇṇā viya, cīnapiṭṭhacuṇṇasamparirañjitā viya ca virociṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhagavatopi ",
      " asītianubyañjanabyāmappabhāparikkhepasamujjalaṃ dvattiṃsamahāpurisalakkhaṇappaṭimaṇḍitaṃ sarīraṃ abbhamahikādiupakkilesavimuttaṃ samujjalantatārakāvabhāsitaṃ viya, gaganatalaṃ vikasitaṃ viya padumavanaṃ, sabbapāliphullo viya yojanasatiko pāricchattako, paṭipāṭiyā ṭhapitānaṃ dvattiṃsasūriyānaṃ dvattiṃsacandimānaṃ dvattiṃsacakkavattīnaṃ dvattiṃsadevarājānaṃ dvattiṃsamahābrahmānaṃ siriyā siriṃ abhibhavamānaṃ viya virocittha, yathā taṃ dasahi pāramīhi dasahi upapāramīhi dasahi paramatthapāramīhīti sammadeva paripūritāhi samatiṃsapāramitāhi alaṅkataṃ kappasatasahassādhikāni cattāri asaṅkhyeyyāni dinnena dānena rakkhitena sīlena katena kalyāṇakammena ekasmiṃ attabhāve samosaritvā vipākaṃ dātuṃ okāsaṃ alabhamānena sambādhappattaṃ viya nibbattitaṃ nāvāsahassabhaṇḍaṃ ekaṃ nāvaṃ āropanakālo viya, sakaṭasahassabhaṇḍaṃ ekaṃ sakaṭaṃ āropanakālo viya, pañcavīsatiyā gaṅgānaṃ sambhinnamukhadvāre ekato rāsibhūtakālo viya ahosi."
    ],
    "innerText": "Bhagavatopi asītianubyañjanabyāmappabhāparikkhepasamujjalaṃ dvattiṃsamahāpurisalakkhaṇappaṭimaṇḍitaṃ sarīraṃ abbhamahikādiupakkilesavimuttaṃ samujjalantatārakāvabhāsitaṃ viya, gaganatalaṃ vikasitaṃ viya padumavanaṃ, sabbapāliphullo viya yojanasatiko pāricchattako, paṭipāṭiyā ṭhapitānaṃ dvattiṃsasūriyānaṃ dvattiṃsacandimānaṃ dvattiṃsacakkavattīnaṃ dvattiṃsadevarājānaṃ dvattiṃsamahābrahmānaṃ siriyā siriṃ abhibhavamānaṃ viya virocittha, yathā taṃ dasahi pāramīhi dasahi upapāramīhi dasahi paramatthapāramīhīti sammadeva paripūritāhi samatiṃsapāramitāhi alaṅkataṃ kappasatasahassādhikāni cattāri asaṅkhyeyyāni dinnena dānena rakkhitena sīlena katena kalyāṇakammena ekasmiṃ attabhāve samosaritvā vipākaṃ dātuṃ okāsaṃ alabhamānena sambādhappattaṃ viya nibbattitaṃ nāvāsahassabhaṇḍaṃ ekaṃ nāvaṃ āropanakālo viya, sakaṭasahassabhaṇḍaṃ ekaṃ sakaṭaṃ āropanakālo viya, pañcavīsatiyā gaṅgānaṃ sambhinnamukhadvāre ekato rāsibhūtakālo viya ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Imāya buddhasiriyā obhāsamānassapi bhagavato purato anekāni daṇḍadīpikāsahassāni ukkhipiṃsu. Tathā pacchato vāmapasse dakkhiṇapasse jātikusumacampakavanamālikārattuppalanīluppalabakulasinduvārādipupphāni ceva nīlapītādivaṇṇasugandhacuṇṇāni ca cātuddīpikamahāmeghavissaṭṭhā salilavuṭṭhiyo viya vippakiriṃsu ",
      ". Pañcaṅgikatūriyanigghosā ca buddhadhammasaṅghaguṇāsaṃyuttā thutighosā ca sabbā disā pūrayamānā mukhasambhāsā viya ahesuṃ. Devasupaṇṇanāgayakkhagandhabbamanussānaṃ akkhīni amatapānaṃ viya labhiṃsu. Imasmiṃ pana ṭhāne ṭhatvā padasahassehi gamanavaṇṇanaṃ vattuṃ vaṭṭati. Tatriyaṃ mukhamattaṃ –"
    ],
    "innerText": "Imāya buddhasiriyā obhāsamānassapi bhagavato purato anekāni daṇḍadīpikāsahassāni ukkhipiṃsu. Tathā pacchato vāmapasse dakkhiṇapasse jātikusumacampakavanamālikārattuppalanīluppalabakulasinduvārādipupphāni ceva nīlapītādivaṇṇasugandhacuṇṇāni ca cātuddīpikamahāmeghavissaṭṭhā salilavuṭṭhiyo viya vippakiriṃsu . Pañcaṅgikatūriyanigghosā ca buddhadhammasaṅghaguṇāsaṃyuttā thutighosā ca sabbā disā pūrayamānā mukhasambhāsā viya ahesuṃ. Devasupaṇṇanāgayakkhagandhabbamanussānaṃ akkhīni amatapānaṃ viya labhiṃsu. Imasmiṃ pana ṭhāne ṭhatvā padasahassehi gamanavaṇṇanaṃ vattuṃ vaṭṭati. Tatriyaṃ mukhamattaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Evaṃ ",
      " sabbaṅgasampanno, kampayanto vasundharaṃ;"
    ],
    "innerText": "‘‘Evaṃ sabbaṅgasampanno, kampayanto vasundharaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Aheṭhayanto pāṇāni, yāti lokavināyako."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Dakkhiṇaṃ paṭhamaṃ pādaṃ, uddharanto narāsabho;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Gacchanto sirisampanno, sobhate dvipaduttamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Gacchato buddhaseṭṭhassa, heṭṭhā pādatalaṃ mudu;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Samaṃ samphusate bhūmiṃ, rajasānupalimpati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Ninnaṃ ",
      " ṭhānaṃ unnamati, gacchante lokanāyake;"
    ],
    "innerText": "‘‘Ninnaṃ ṭhānaṃ unnamati, gacchante lokanāyake;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Unnatañca samaṃ hoti, pathavī ca acetanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Pāsāṇā sakkharā ceva, kathalā khāṇukaṇṭakā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sabbe maggā vivajjanti, gacchante lokanāyake."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Nātidūre uddharati, naccāsanne ca nikkhipaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Aghaṭṭayanto niyyāti, ubho jāṇū ca gopphake."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Nātisīghaṃ pakkamati, sampannacaraṇo muni;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Na cāpi saṇikaṃ yāti, gacchamāno samāhito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Uddhaṃ adho ca tiriyaṃ, disañca vidisaṃ tathā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Na pekkhamāno so yāti, yugamattaṃvapekkhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Nāgavikkantacāro so, gamane sobhate jino;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Cāruṃ gacchati lokaggo, hāsayanto sadevake."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Usabharājāva sobhanto, cārucārīva kesarī;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tosayanto bahū satte, gāmaṃ seṭṭho upāgamī’’ti. –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Vaṇṇakālo ",
      " nāma kiresa. Evaṃvidhesu kālesu bhagavato sarīravaṇṇe vā guṇavaṇṇe vā dhammakathikassa thāmoyeva pamāṇaṃ, cuṇṇiyapadehi gāthābandhehi yattakaṃ sakkoti, tattakaṃ vattabbaṃ. ‘‘Dukkathita’’nti vā ‘‘atitthena pakkhando’’ti vā na vattabbo. Aparimāṇavaṇṇā hi buddhā bhagavanto, tesaṃ buddhāpi anavasesato vaṇṇaṃ vattuṃ asamatthā. Sakalampi hi kappaṃ vaṇṇentā pariyosāpetuṃ na sakkonti, pageva itarā pajāti. Iminā sirivilāsena alaṅkatappaṭiyattaṃ pāṭaligāmaṃ pāvisi ",
      ", pavisitvā bhagavā pasannacittena janena pupphagandhadhūmavāsacuṇṇādīhi pūjiyamāno āvasathāgāraṃ pāvisi. Tena vuttaṃ – ‘‘atha kho bhagavā nivāsetvā pattacīvaramādāya saddhiṃ bhikkhusaṅghena yena āvasathāgāraṃ tenupasaṅkamī’’ti."
    ],
    "innerText": "Vaṇṇakālo nāma kiresa. Evaṃvidhesu kālesu bhagavato sarīravaṇṇe vā guṇavaṇṇe vā dhammakathikassa thāmoyeva pamāṇaṃ, cuṇṇiyapadehi gāthābandhehi yattakaṃ sakkoti, tattakaṃ vattabbaṃ. ‘‘Dukkathita’’nti vā ‘‘atitthena pakkhando’’ti vā na vattabbo. Aparimāṇavaṇṇā hi buddhā bhagavanto, tesaṃ buddhāpi anavasesato vaṇṇaṃ vattuṃ asamatthā. Sakalampi hi kappaṃ vaṇṇentā pariyosāpetuṃ na sakkonti, pageva itarā pajāti. Iminā sirivilāsena alaṅkatappaṭiyattaṃ pāṭaligāmaṃ pāvisi , pavisitvā bhagavā pasannacittena janena pupphagandhadhūmavāsacuṇṇādīhi pūjiyamāno āvasathāgāraṃ pāvisi. Tena vuttaṃ – ‘‘atha kho bhagavā nivāsetvā pattacīvaramādāya saddhiṃ bhikkhusaṅghena yena āvasathāgāraṃ tenupasaṅkamī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāde"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pakkhāletvā"
      },
      "ti yadipi bhagavato pāde rajojallaṃ na upalimpati, tesaṃ pana upāsakānaṃ kusalābhivuddhiṃ ākaṅkhanto paresaṃ diṭṭhānugatiṃ āpajjanatthañca bhagavā pāde pakkhāleti. Apica upādinnakasarīraṃ nāma sītaṃ kātabbampi hotīti etadatthampi bhagavā nhānapādadhovanādīni karotiyeva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhagavantaṃyeva purakkhatvā"
      },
      "ti bhagavantaṃ purato katvā. Tattha bhagavā bhikkhūnañceva upāsakānañca majjhe nisinno gandhodakena nhāpetvā dukūlacumbaṭakena vodakaṃ katvā jātihiṅgulakena majjitvā rattakambalena paliveṭhetvā pīṭhe ṭhapitā rattasuvaṇṇaghanapaṭimā viya ativirocittha."
    ],
    "innerText": "Pādepakkhāletvāti yadipi bhagavato pāde rajojallaṃ na upalimpati, tesaṃ pana upāsakānaṃ kusalābhivuddhiṃ ākaṅkhanto paresaṃ diṭṭhānugatiṃ āpajjanatthañca bhagavā pāde pakkhāleti. Apica upādinnakasarīraṃ nāma sītaṃ kātabbampi hotīti etadatthampi bhagavā nhānapādadhovanādīni karotiyeva. Bhagavantaṃyeva purakkhatvāti bhagavantaṃ purato katvā. Tattha bhagavā bhikkhūnañceva upāsakānañca majjhe nisinno gandhodakena nhāpetvā dukūlacumbaṭakena vodakaṃ katvā jātihiṅgulakena majjitvā rattakambalena paliveṭhetvā pīṭhe ṭhapitā rattasuvaṇṇaghanapaṭimā viya ativirocittha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ayaṃ panettha porāṇānaṃ vaṇṇabhaṇanamaggo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Gantvāna maṇḍalamāḷaṃ, nāgavikkantacāraṇo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Obhāsayanto lokaggo, nisīdi varamāsane."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Tahiṃ ",
      " nisinno naradammasārathi,"
    ],
    "innerText": "‘‘Tahiṃ nisinno naradammasārathi,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Devātidevo satapuññalakkhaṇo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Buddhāsane majjhagato virocati,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Suvaṇṇanikkhaṃ viya paṇḍukambale."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Nekkhaṃ jambonadasseva, nikkhittaṃ paṇḍukambale;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Virocati vītamalo, maṇiverocano yathā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Mahāsālova samphullo, merurājāvalaṅkato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Suvaṇṇayūpasaṅkāso, padumo kokanado yathā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Jalanto dīparukkhova, pabbatagge yathā sikhī;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Devānaṃ pārichattova, sabbaphullo virocatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāṭaligāmiye"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upāsake āmantesī"
      },
      "ti yasmā tesu upāsakesu bahū janā sīlesu patiṭṭhitā, tasmā paṭhamaṃ tāva sīlavipattiyā ādīnavaṃ pakāsetvā pacchā sīlasampadāya ānisaṃsaṃ dassetuṃ, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘pañcime gahapatayo’’"
      },
      "tiādinā dhammadesanatthaṃ āmantesi."
    ],
    "innerText": "Pāṭaligāmiyeupāsake āmantesīti yasmā tesu upāsakesu bahū janā sīlesu patiṭṭhitā, tasmā paṭhamaṃ tāva sīlavipattiyā ādīnavaṃ pakāsetvā pacchā sīlasampadāya ānisaṃsaṃ dassetuṃ, ‘‘pañcime gahapatayo’’tiādinā dhammadesanatthaṃ āmantesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dussīlo"
      },
      "ti nissīlo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sīlavipanno"
      },
      "ti vipannasīlo bhinnasaṃvaro. Ettha ca ‘‘dussīlo’’ti padena puggalassa sīlābhāvo vutto. So panassa sīlābhāvo duvidho asamādānena vā samādinnassa bhedena vāti. Tesu purimo na tathā sāvajjo, yathā dutiyo sāvajjataro. Yathādhippetādīnavanimittaṃ sīlābhāvaṃ puggalādhiṭṭhānāya desanāya dassetuṃ, ‘‘sīlavipanno’’ti vuttaṃ. Tena ‘‘dussīlo’’ti padassa atthaṃ dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pamādādhikaraṇa"
      },
      "nti pamādakāraṇā. Idañca suttaṃ gahaṭṭhānaṃ vasena āgataṃ, pabbajitānampi pana labbhateva. Gahaṭṭho hi yena sippaṭṭhānena jīvikaṃ kappeti yadi kasiyā yadi vāṇijjāya yadi gorakkhena, pāṇātipātādivasena pamatto taṃ taṃ yathākālaṃ sampādetuṃ na sakkoti, athassa kammaṃ vinassati. Māghātakāle ",
      " pana pāṇātipātādīni karonto daṇḍavasena mahatiṃ bhogajāniṃ nigacchati. Pabbajito dussīlo pamādakāraṇā sīlato buddhavacanato jhānato sattaariyadhanato ca jāniṃ nigacchati."
    ],
    "innerText": "Tattha dussīloti nissīlo. Sīlavipannoti vipannasīlo bhinnasaṃvaro. Ettha ca ‘‘dussīlo’’ti padena puggalassa sīlābhāvo vutto. So panassa sīlābhāvo duvidho asamādānena vā samādinnassa bhedena vāti. Tesu purimo na tathā sāvajjo, yathā dutiyo sāvajjataro. Yathādhippetādīnavanimittaṃ sīlābhāvaṃ puggalādhiṭṭhānāya desanāya dassetuṃ, ‘‘sīlavipanno’’ti vuttaṃ. Tena ‘‘dussīlo’’ti padassa atthaṃ dasseti. Pamādādhikaraṇanti pamādakāraṇā. Idañca suttaṃ gahaṭṭhānaṃ vasena āgataṃ, pabbajitānampi pana labbhateva. Gahaṭṭho hi yena sippaṭṭhānena jīvikaṃ kappeti yadi kasiyā yadi vāṇijjāya yadi gorakkhena, pāṇātipātādivasena pamatto taṃ taṃ yathākālaṃ sampādetuṃ na sakkoti, athassa kammaṃ vinassati. Māghātakāle pana pāṇātipātādīni karonto daṇḍavasena mahatiṃ bhogajāniṃ nigacchati. Pabbajito dussīlo pamādakāraṇā sīlato buddhavacanato jhānato sattaariyadhanato ca jāniṃ nigacchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāpako kittisaddo"
      },
      "ti gahaṭṭhassa ‘‘asuko amukakule jāto dussīlo pāpadhammo pariccattaidhalokaparaloko salākabhattamattampi na detī’’ti parisamajjhe pāpako kittisaddo abbhuggacchati. Pabbajitassa ‘‘asuko nāma thero satthu sāsane pabbajitvā nāsakkhi sīlāni rakkhituṃ, na buddhavacanaṃ gahetuṃ, vejjakammādīhi jīvati, chahi agāravehi samannāgato’’ti evaṃ pāpako kittisaddo abbhuggacchati."
    ],
    "innerText": "Pāpako kittisaddoti gahaṭṭhassa ‘‘asuko amukakule jāto dussīlo pāpadhammo pariccattaidhalokaparaloko salākabhattamattampi na detī’’ti parisamajjhe pāpako kittisaddo abbhuggacchati. Pabbajitassa ‘‘asuko nāma thero satthu sāsane pabbajitvā nāsakkhi sīlāni rakkhituṃ, na buddhavacanaṃ gahetuṃ, vejjakammādīhi jīvati, chahi agāravehi samannāgato’’ti evaṃ pāpako kittisaddo abbhuggacchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avisārado"
      },
      "ti gahaṭṭho tāva avassaṃ bahūnaṃ sannipātaṭṭhāne ‘‘koci mama kammaṃ jānissati, atha maṃ nindissati, rājakulassa vā dassessatī’’ti sabhayo upasaṅkamati, maṅkubhūto pattakkhandho adhomukho nisīdati, visārado hutvā kathetuṃ na sakkoti. Pabbajitopi bahubhikkhusaṅghe sannipatite ‘‘avassaṃ koci mama kammaṃ jānissati, atha me uposathampi pavāraṇampi ṭhapetvā sāmaññato cāvetvā nikkaḍḍhissatī’’ti sabhayo upasaṅkamati, visārado hutvā kathetuṃ ",
      " na sakkoti. Ekacco pana dussīlopi samāno susīlo viya carati, sopi ajjhāsayena maṅku hotiyeva."
    ],
    "innerText": "Avisāradoti gahaṭṭho tāva avassaṃ bahūnaṃ sannipātaṭṭhāne ‘‘koci mama kammaṃ jānissati, atha maṃ nindissati, rājakulassa vā dassessatī’’ti sabhayo upasaṅkamati, maṅkubhūto pattakkhandho adhomukho nisīdati, visārado hutvā kathetuṃ na sakkoti. Pabbajitopi bahubhikkhusaṅghe sannipatite ‘‘avassaṃ koci mama kammaṃ jānissati, atha me uposathampi pavāraṇampi ṭhapetvā sāmaññato cāvetvā nikkaḍḍhissatī’’ti sabhayo upasaṅkamati, visārado hutvā kathetuṃ na sakkoti. Ekacco pana dussīlopi samāno susīlo viya carati, sopi ajjhāsayena maṅku hotiyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammūḷho kālaṃ karotī"
      },
      "ti dussīlassa hi maraṇamañce nipannassa dussīlakammāni samādāya pavattitaṭṭhānāni āpāthaṃ āgacchanti. So ummīletvā idhalokaṃ, nimīletvā paralokaṃ passati. Tassa cattāro apāyā kammānurūpaṃ upaṭṭhahanti, sattisatena pahariyamāno viya aggijālābhighātena ",
      " jhāyamāno viya ca hoti. So ‘‘vāretha, vārethā’’ti viravantova marati. Tena vuttaṃ – ‘‘sammūḷho kālaṃ karotī’’ti."
    ],
    "innerText": "Sammūḷho kālaṃ karotīti dussīlassa hi maraṇamañce nipannassa dussīlakammāni samādāya pavattitaṭṭhānāni āpāthaṃ āgacchanti. So ummīletvā idhalokaṃ, nimīletvā paralokaṃ passati. Tassa cattāro apāyā kammānurūpaṃ upaṭṭhahanti, sattisatena pahariyamāno viya aggijālābhighātena jhāyamāno viya ca hoti. So ‘‘vāretha, vārethā’’ti viravantova marati. Tena vuttaṃ – ‘‘sammūḷho kālaṃ karotī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāyassa"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhedā"
      },
      "ti upādinnakkhandhapariccāgā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paraṃ maraṇā"
      },
      "ti tadanantaraṃ abhinibbattakkhandhaggahaṇā. Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāyassa bhedā"
      },
      "ti jīvitindriyassa upacchedā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paraṃ maraṇā"
      },
      "ti cutito uddhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Apāya"
      },
      "ntiādi sabbaṃ nirayavevacanaṃ. Nirayo hi saggamokkhahetubhūtā puññasaṅkhātā ayā apetattā, sukhānaṃ vā ayassa, āgamanassa vā abhāvā apāyo. Dukkhassa gati paṭisaraṇanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "duggati,"
      },
      " dosabahulatāya vā duṭṭhena kammunā nibbattā gatīti duggati. Vivasā nipatanti ettha dukkatakārinoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vinipāto,"
      },
      " vinassantā vā ettha nipatanti sambhijjamānaṅgapaccaṅgāti vinipāto. Natthi ettha assādasaññito ayoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nirayo"
      },
      "."
    ],
    "innerText": "Kāyassabhedāti upādinnakkhandhapariccāgā. Paraṃ maraṇāti tadanantaraṃ abhinibbattakkhandhaggahaṇā. Atha vā kāyassa bhedāti jīvitindriyassa upacchedā. Paraṃ maraṇāti cutito uddhaṃ. Apāyantiādi sabbaṃ nirayavevacanaṃ. Nirayo hi saggamokkhahetubhūtā puññasaṅkhātā ayā apetattā, sukhānaṃ vā ayassa, āgamanassa vā abhāvā apāyo. Dukkhassa gati paṭisaraṇanti duggati, dosabahulatāya vā duṭṭhena kammunā nibbattā gatīti duggati. Vivasā nipatanti ettha dukkatakārinoti vinipāto, vinassantā vā ettha nipatanti sambhijjamānaṅgapaccaṅgāti vinipāto. Natthi ettha assādasaññito ayoti nirayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha vā apāyaggahaṇena tiracchānayoniṃ dīpeti. Tiracchānayoni hi apāyo sugatito apetattā, na duggati mahesakkhānaṃ nāgarājādīnaṃ sambhavato. Duggatiggahaṇena pettivisayaṃ dīpeti. So hi apāyo ceva duggati ca sugatito apetattā, dukkhassa ca gatibhūtattā, na tu vinipāto asurasadisaṃ avinipatitattā petamahiddhikānampi vijjamānattā. Vinipātaggahaṇena asurakāyaṃ dīpeti. So hi yathāvuttenaṭṭhena ‘‘apāyo’’ ceva ‘‘duggati’’ ca sabbasampattisamussayehi vinipatitattā ‘‘vinipāto’’ti ca vuccati. Nirayaggahaṇena avīciādikaṃ anekappakāraṃ nirayameva dīpeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upapajjatī"
      },
      "ti nibbattati."
    ],
    "innerText": "Atha vā apāyaggahaṇena tiracchānayoniṃ dīpeti. Tiracchānayoni hi apāyo sugatito apetattā, na duggati mahesakkhānaṃ nāgarājādīnaṃ sambhavato. Duggatiggahaṇena pettivisayaṃ dīpeti. So hi apāyo ceva duggati ca sugatito apetattā, dukkhassa ca gatibhūtattā, na tu vinipāto asurasadisaṃ avinipatitattā petamahiddhikānampi vijjamānattā. Vinipātaggahaṇena asurakāyaṃ dīpeti. So hi yathāvuttenaṭṭhena ‘‘apāyo’’ ceva ‘‘duggati’’ ca sabbasampattisamussayehi vinipatitattā ‘‘vinipāto’’ti ca vuccati. Nirayaggahaṇena avīciādikaṃ anekappakāraṃ nirayameva dīpeti. Upapajjatīti nibbattati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ānisaṃsakathā vuttavipariyāyena veditabbā. Ayaṃ pana viseso – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sīlavā"
      },
      "ti samādānavasena sīlavā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sīlasampanno"
      },
      "ti parisuddhaṃ paripuṇṇañca katvā ",
      " sīlassa samādānena sīlasampanno. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhogakkhandha"
      },
      "nti bhogarāsiṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sugatiṃ saggaṃ loka"
      },
      "nti ettha sugatiggahaṇena manussagatipi saṅgayhati, saggaggahaṇena devagati eva. Tattha sundarā gati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sugati,"
      },
      " rūpādīhi visayehi suṭṭhu aggoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saggo,"
      },
      " so sabbopi lujjanapalujjanaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "loko"
      },
      "ti."
    ],
    "innerText": "Ānisaṃsakathā vuttavipariyāyena veditabbā. Ayaṃ pana viseso – sīlavāti samādānavasena sīlavā. Sīlasampannoti parisuddhaṃ paripuṇṇañca katvā sīlassa samādānena sīlasampanno. Bhogakkhandhanti bhogarāsiṃ. Sugatiṃ saggaṃ lokanti ettha sugatiggahaṇena manussagatipi saṅgayhati, saggaggahaṇena devagati eva. Tattha sundarā gati sugati, rūpādīhi visayehi suṭṭhu aggoti saggo, so sabbopi lujjanapalujjanaṭṭhena lokoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāṭaligāmiye"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upāsake bahudeva rattiṃ dhammiyā kathāyā"
      },
      "ti aññāyapi pāḷimuttāya dhammakathāya ceva āvasathānumodanakathāya ca. Tadā hi bhagavā yasmā ajātasattunā tattha pāṭaliputtanagaraṃ māpentena aññesu gāmanigamajanapadarājadhānīsu ye sīlācārasampannā kuṭumbikā, te ānetvā dhanadhaññagharavatthukhettavatthādīni ceva parihārañca dāpetvā nivesiyanti. Tasmā pāṭaligāmiyā upāsakā ānisaṃsadassāvitāya visesato sīlagarukā sabbaguṇānañca sīlassa ",
      " adhiṭṭhānabhāvato tesaṃ paṭhamaṃ sīlānisaṃse pakāsetvā tato paraṃ ākāsagaṅgaṃ otārento viya, pathavojaṃ ākaḍḍhanto viya, mahājambuṃ matthake gahetvā cālento viya, yojanikamadhukaṇḍaṃ cakkayantena pīḷetvā madhurasaṃ pāyamāno viya pāṭaligāmikānaṃ upāsakānaṃ hitasukhāvahaṃ pakiṇṇakakathaṃ kathento ‘‘āvāsadānaṃ nāmetaṃ gahapatayo mahantaṃ puññaṃ, tumhākaṃ āvāso mayā paribhutto, bhikkhusaṅghena ca paribhutto, mayā ca bhikkhusaṅghena ca paribhutte pana dhammaratanenapi paribhuttoyeva hoti. Evaṃ tīhi ratanehi paribhutte aparimeyyo ca vipāko, apica āvāsadānasmiṃ dinne sabbadānaṃ dinnameva hoti, bhūmaṭṭhakapaṇṇasālāya vā sākhāmaṇḍapassa vā saṅghaṃ uddissa katassa ānisaṃso paricchindituṃ na sakkā. Āvāsadānānubhāvena hi bhave nibbattamānassapi sampīḷitagabbhavāso nāma na hoti, dvādasahattho ovarako viyassa mātukucchi asambādhova hotī’’ti evaṃ nānānayehi vicittaṃ bahuṃ dhammakathaṃ kathetvā –"
    ],
    "innerText": "Pāṭaligāmiyeupāsake bahudeva rattiṃ dhammiyā kathāyāti aññāyapi pāḷimuttāya dhammakathāya ceva āvasathānumodanakathāya ca. Tadā hi bhagavā yasmā ajātasattunā tattha pāṭaliputtanagaraṃ māpentena aññesu gāmanigamajanapadarājadhānīsu ye sīlācārasampannā kuṭumbikā, te ānetvā dhanadhaññagharavatthukhettavatthādīni ceva parihārañca dāpetvā nivesiyanti. Tasmā pāṭaligāmiyā upāsakā ānisaṃsadassāvitāya visesato sīlagarukā sabbaguṇānañca sīlassa adhiṭṭhānabhāvato tesaṃ paṭhamaṃ sīlānisaṃse pakāsetvā tato paraṃ ākāsagaṅgaṃ otārento viya, pathavojaṃ ākaḍḍhanto viya, mahājambuṃ matthake gahetvā cālento viya, yojanikamadhukaṇḍaṃ cakkayantena pīḷetvā madhurasaṃ pāyamāno viya pāṭaligāmikānaṃ upāsakānaṃ hitasukhāvahaṃ pakiṇṇakakathaṃ kathento ‘‘āvāsadānaṃ nāmetaṃ gahapatayo mahantaṃ puññaṃ, tumhākaṃ āvāso mayā paribhutto, bhikkhusaṅghena ca paribhutto, mayā ca bhikkhusaṅghena ca paribhutte pana dhammaratanenapi paribhuttoyeva hoti. Evaṃ tīhi ratanehi paribhutte aparimeyyo ca vipāko, apica āvāsadānasmiṃ dinne sabbadānaṃ dinnameva hoti, bhūmaṭṭhakapaṇṇasālāya vā sākhāmaṇḍapassa vā saṅghaṃ uddissa katassa ānisaṃso paricchindituṃ na sakkā. Āvāsadānānubhāvena hi bhave nibbattamānassapi sampīḷitagabbhavāso nāma na hoti, dvādasahattho ovarako viyassa mātukucchi asambādhova hotī’’ti evaṃ nānānayehi vicittaṃ bahuṃ dhammakathaṃ kathetvā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sītaṃ uṇhaṃ paṭihanti, tato vāḷamigāni ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sarīsape ca makase, sisire cāpi vuṭṭhiyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tato vātātapo ghoro, sañjāto paṭihaññati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Leṇatthañca sukhatthañca, jhāyituñca vipassituṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Vihāradānaṃ ",
      " saṅghassa, aggaṃ buddhena vaṇṇitaṃ;"
    ],
    "innerText": "‘‘Vihāradānaṃ saṅghassa, aggaṃ buddhena vaṇṇitaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Tasmā ",
      " hi paṇḍito poso, sampassaṃ atthamattano."
    ],
    "innerText": "Tasmā hi paṇḍito poso, sampassaṃ atthamattano."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Vihāre kāraye ramme, vāsayettha bahussute;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tesaṃ annañca pānañca, vatthasenāsanāni ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Dadeyya ujubhūtesu, vippasannena cetasā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Te tassa dhammaṃ desenti, sabbadukkhāpanūdanaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yaṃ so dhammaṃ idhaññāya, parinibbāti anāsavo’’ti. (cūḷava. 295) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Evaṃ ayampi āvāsadāne ānisaṃsoti bahudeva rattiṃ atirekataraṃ diyaḍḍhayāmaṃ āvāsadānānisaṃsakathaṃ ",
      " kathesi. Tattha imā gāthā tāva saṅgahaṃ āruḷhā, pakiṇṇakadhammadesanā pana saṅgahaṃ nārohati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sandassetvā"
      },
      "tiādīni vuttatthāneva."
    ],
    "innerText": "Evaṃ ayampi āvāsadāne ānisaṃsoti bahudeva rattiṃ atirekataraṃ diyaḍḍhayāmaṃ āvāsadānānisaṃsakathaṃ kathesi. Tattha imā gāthā tāva saṅgahaṃ āruḷhā, pakiṇṇakadhammadesanā pana saṅgahaṃ nārohati. Sandassetvātiādīni vuttatthāneva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhikkantā"
      },
      "ti atikkantā dve yāmā gatā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yassa dāni kālaṃ maññathā"
      },
      "ti yassa gamanassa tumhe kālaṃ maññatha, gamanakālo tumhākaṃ, gacchathāti vuttaṃ hoti. Kasmā pana bhagavā te uyyojesīti? Anukampāya. Tiyāmarattiñhi tattha nisīditvā vītināmentānaṃ tesaṃ sarīre ābādho uppajjeyyāti, bhikkhusaṅghepi ca vippabhātasayananisajjāya okāso laddhuṃ vaṭṭati, iti ubhayānukampāya uyyojesīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suññāgāra"
      },
      "nti pāṭiyekkaṃ suññāgāraṃ nāma tattha natthi. Tena kira gahapatayo tasseva āvasathāgārassa ekapasse paṭasāṇiyā parikkhipāpetvā kappiyamañcaṃ paññāpetvā tattha kappiyapaccattharaṇaṃ attharitvā upari suvaṇṇarajatatārakāgandhamālādipaṭimaṇḍitaṃ vitānaṃ bandhitvā telappadīpaṃ āropesuṃ ‘‘appeva nāma satthā dhammāsanato vuṭṭhāya thokaṃ vissamitukāmo idha nipajjeyya, evaṃ no idaṃ āvasathāgāraṃ bhagavatā catūhi iriyāpathehi paribhuttaṃ dīgharattaṃ hitāya sukhāya bhavissatī’’ti. Satthāpi tadeva sandhāya tattha saṅghāṭiṃ paññāpetvā sīhaseyyaṃ kappesi. Taṃ sandhāya vuttaṃ ‘‘suññāgāraṃ pāvisī’’ti. Tattha pādadhovanaṭṭhānato paṭṭhāya yāva dhammāsanā agamāsi, ettake ṭhāne gamanaṃ nipphannaṃ. Dhammāsanaṃ patvā ",
      " thokaṃ aṭṭhāsi, idaṃ tattha ṭhānaṃ. Bhagavā dve yāme dhammāsane nisīdi, ettake ṭhāne nisajjā nipphannā. Upāsake uyyojetvā dhammāsanato ",
      " oruyha yathāvutte ṭhāne sīhaseyyaṃ kappesi. Evaṃ taṃ ṭhānaṃ bhagavatā catūhi iriyāpathehi paribhuttaṃ ahosīti."
    ],
    "innerText": "Abhikkantāti atikkantā dve yāmā gatā. Yassa dāni kālaṃ maññathāti yassa gamanassa tumhe kālaṃ maññatha, gamanakālo tumhākaṃ, gacchathāti vuttaṃ hoti. Kasmā pana bhagavā te uyyojesīti? Anukampāya. Tiyāmarattiñhi tattha nisīditvā vītināmentānaṃ tesaṃ sarīre ābādho uppajjeyyāti, bhikkhusaṅghepi ca vippabhātasayananisajjāya okāso laddhuṃ vaṭṭati, iti ubhayānukampāya uyyojesīti. Suññāgāranti pāṭiyekkaṃ suññāgāraṃ nāma tattha natthi. Tena kira gahapatayo tasseva āvasathāgārassa ekapasse paṭasāṇiyā parikkhipāpetvā kappiyamañcaṃ paññāpetvā tattha kappiyapaccattharaṇaṃ attharitvā upari suvaṇṇarajatatārakāgandhamālādipaṭimaṇḍitaṃ vitānaṃ bandhitvā telappadīpaṃ āropesuṃ ‘‘appeva nāma satthā dhammāsanato vuṭṭhāya thokaṃ vissamitukāmo idha nipajjeyya, evaṃ no idaṃ āvasathāgāraṃ bhagavatā catūhi iriyāpathehi paribhuttaṃ dīgharattaṃ hitāya sukhāya bhavissatī’’ti. Satthāpi tadeva sandhāya tattha saṅghāṭiṃ paññāpetvā sīhaseyyaṃ kappesi. Taṃ sandhāya vuttaṃ ‘‘suññāgāraṃ pāvisī’’ti. Tattha pādadhovanaṭṭhānato paṭṭhāya yāva dhammāsanā agamāsi, ettake ṭhāne gamanaṃ nipphannaṃ. Dhammāsanaṃ patvā thokaṃ aṭṭhāsi, idaṃ tattha ṭhānaṃ. Bhagavā dve yāme dhammāsane nisīdi, ettake ṭhāne nisajjā nipphannā. Upāsake uyyojetvā dhammāsanato oruyha yathāvutte ṭhāne sīhaseyyaṃ kappesi. Evaṃ taṃ ṭhānaṃ bhagavatā catūhi iriyāpathehi paribhuttaṃ ahosīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sunidhavassakārā"
      },
      "ti sunidho ca vassakāro ca dve brāhmaṇā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Magadhamahāmattā"
      },
      "ti magadharañño mahāamaccā, magadharaṭṭhe vā mahāmattā mahatiyā issariyamattāya samannāgatāti mahāmattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāṭaligāme nagaraṃ māpentī"
      },
      "ti pāṭaligāmasaṅkhāte bhūmipadese nagaraṃ māpenti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vajjīnaṃ paṭibāhāyā"
      },
      "ti licchavirājūnaṃ āyamukhappacchindanatthaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahassasahassevā"
      },
      "ti ekekavaggavasena sahassaṃ sahassaṃ hutvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vatthūnī"
      },
      "ti gharavatthūni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cittāni namanti nivesanāni māpetu"
      },
      "nti rañño rājamahāmattānañca nivesanāni māpetuṃ vatthuvijjāpāṭhakānaṃ cittāni namanti. Te kira attano sippānubhāvena heṭṭhāpathaviyaṃ tiṃsahatthamatte ṭhāne ‘‘idha nāgaggāho, idha yakkhaggāho, idha bhūtaggāho, idha pāsāṇo vā khāṇuko vā atthī’’ti jānanti. Te tadā sippaṃ jappetvā devatāhi saddhiṃ sammantayamānā viya māpenti."
    ],
    "innerText": "Sunidhavassakārāti sunidho ca vassakāro ca dve brāhmaṇā. Magadhamahāmattāti magadharañño mahāamaccā, magadharaṭṭhe vā mahāmattā mahatiyā issariyamattāya samannāgatāti mahāmattā. Pāṭaligāme nagaraṃ māpentīti pāṭaligāmasaṅkhāte bhūmipadese nagaraṃ māpenti. Vajjīnaṃ paṭibāhāyāti licchavirājūnaṃ āyamukhappacchindanatthaṃ. Sahassasahassevāti ekekavaggavasena sahassaṃ sahassaṃ hutvā. Vatthūnīti gharavatthūni. Cittāni namanti nivesanāni māpetunti rañño rājamahāmattānañca nivesanāni māpetuṃ vatthuvijjāpāṭhakānaṃ cittāni namanti. Te kira attano sippānubhāvena heṭṭhāpathaviyaṃ tiṃsahatthamatte ṭhāne ‘‘idha nāgaggāho, idha yakkhaggāho, idha bhūtaggāho, idha pāsāṇo vā khāṇuko vā atthī’’ti jānanti. Te tadā sippaṃ jappetvā devatāhi saddhiṃ sammantayamānā viya māpenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " vā nesaṃ sarīre devatā adhimuccitvā tattha tattha nivesanāni māpetuṃ cittaṃ nāmenti. Tā catūsu koṇesu khāṇuke koṭṭetvā vatthumhi gahitamatte paṭivigacchanti. Saddhakulānaṃ saddhā devatā tathā karonti, assaddhakulānaṃ assaddhā devatā. Kiṃkāraṇā? Saddhānañhi evaṃ hoti ‘‘idha manussā nivesanaṃ māpentā paṭhamaṃ bhikkhusaṅghaṃ nisīdāpetvā maṅgalaṃ vadāpessanti, atha mayaṃ sīlavantānaṃ dassanaṃ dhammakathaṃ pañhavissajjanaṃ anumodanaṃ sotuṃ labhissāma, manussā ca dānaṃ datvā amhākaṃ pattiṃ dassantī’’ti. Assaddhā devatāpi ‘‘attano icchānurūpaṃ tesaṃ paṭipattiṃ passituṃ, kathañca sotuṃ labhissāmā’’ti tathā karonti."
    ],
    "innerText": "Atha vā nesaṃ sarīre devatā adhimuccitvā tattha tattha nivesanāni māpetuṃ cittaṃ nāmenti. Tā catūsu koṇesu khāṇuke koṭṭetvā vatthumhi gahitamatte paṭivigacchanti. Saddhakulānaṃ saddhā devatā tathā karonti, assaddhakulānaṃ assaddhā devatā. Kiṃkāraṇā? Saddhānañhi evaṃ hoti ‘‘idha manussā nivesanaṃ māpentā paṭhamaṃ bhikkhusaṅghaṃ nisīdāpetvā maṅgalaṃ vadāpessanti, atha mayaṃ sīlavantānaṃ dassanaṃ dhammakathaṃ pañhavissajjanaṃ anumodanaṃ sotuṃ labhissāma, manussā ca dānaṃ datvā amhākaṃ pattiṃ dassantī’’ti. Assaddhā devatāpi ‘‘attano icchānurūpaṃ tesaṃ paṭipattiṃ passituṃ, kathañca sotuṃ labhissāmā’’ti tathā karonti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tāvatiṃsehī"
      },
      "ti ",
      " yathā hi ekasmiṃ kule ekaṃ paṇḍitamanussaṃ, ekasmiñca vihāre ekaṃ bahussutaṃ bhikkhuṃ upādāya ‘‘asukakule manussā paṇḍitā, asukavihāre bhikkhū bahussutā’’ti saddo abbhuggacchati, evameva sakkaṃ devarājānaṃ, vissakammañca devaputtaṃ upādāya ‘‘tāvatiṃsā paṇḍitā’’ti saddo abbhuggato. Tenāha ‘‘tāvatiṃsehī’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Seyyathāpī"
      },
      "tiādinā ",
      " devehi tāvatiṃsehi saddhiṃ mantetvā viya sunidhavassakārā nagaraṃ māpentīti dasseti."
    ],
    "innerText": "Tāvatiṃsehīti yathā hi ekasmiṃ kule ekaṃ paṇḍitamanussaṃ, ekasmiñca vihāre ekaṃ bahussutaṃ bhikkhuṃ upādāya ‘‘asukakule manussā paṇḍitā, asukavihāre bhikkhū bahussutā’’ti saddo abbhuggacchati, evameva sakkaṃ devarājānaṃ, vissakammañca devaputtaṃ upādāya ‘‘tāvatiṃsā paṇḍitā’’ti saddo abbhuggato. Tenāha ‘‘tāvatiṃsehī’’ti. Seyyathāpītiādinā devehi tāvatiṃsehi saddhiṃ mantetvā viya sunidhavassakārā nagaraṃ māpentīti dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yāvatā, ānanda, ariyaṃ āyatana"
      },
      "nti yattakaṃ ariyamanussānaṃ osaraṇaṭṭhānaṃ nāma atthi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yāvatā vaṇippatho"
      },
      "ti yattakaṃ vāṇijānaṃ āhaṭabhaṇḍassa rāsivasena kayavikkayaṭṭhānaṃ nāma, vāṇijānaṃ vasanaṭṭhānaṃ vā atthi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idaṃ agganagara"
      },
      "nti tesaṃ ariyāyatanavaṇippathānaṃ idaṃ nagaraṃ aggaṃ bhavissati jeṭṭhakaṃ pāmokkhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puṭabhedana"
      },
      "nti bhaṇḍapuṭabhedanaṭṭhānaṃ, bhaṇḍabhaṇḍikānaṃ mocanaṭṭhānanti vuttaṃ hoti. Sakalajambudīpe aladdhabhaṇḍampi hi idheva labhissanti, aññattha vikkayaṃ agacchantāpi idheva vikkayaṃ gacchissanti, tasmā idheva puṭaṃ bhindissantīti attho. Āyānampi hi catūsu dvāresu cattāri, sabhāyaṃ ekanti evaṃ divase divase pañcasatasahassāni tattha uṭṭhahissanti. Tāni sabhāvāni āyānīti dasseti."
    ],
    "innerText": "Yāvatā, ānanda, ariyaṃ āyatananti yattakaṃ ariyamanussānaṃ osaraṇaṭṭhānaṃ nāma atthi. Yāvatā vaṇippathoti yattakaṃ vāṇijānaṃ āhaṭabhaṇḍassa rāsivasena kayavikkayaṭṭhānaṃ nāma, vāṇijānaṃ vasanaṭṭhānaṃ vā atthi. Idaṃ agganagaranti tesaṃ ariyāyatanavaṇippathānaṃ idaṃ nagaraṃ aggaṃ bhavissati jeṭṭhakaṃ pāmokkhaṃ. Puṭabhedananti bhaṇḍapuṭabhedanaṭṭhānaṃ, bhaṇḍabhaṇḍikānaṃ mocanaṭṭhānanti vuttaṃ hoti. Sakalajambudīpe aladdhabhaṇḍampi hi idheva labhissanti, aññattha vikkayaṃ agacchantāpi idheva vikkayaṃ gacchissanti, tasmā idheva puṭaṃ bhindissantīti attho. Āyānampi hi catūsu dvāresu cattāri, sabhāyaṃ ekanti evaṃ divase divase pañcasatasahassāni tattha uṭṭhahissanti. Tāni sabhāvāni āyānīti dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aggito vā"
      },
      "tiādīsu samuccayattho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vā"
      },
      "saddo, agginā ca udakena ca mithubhedena ca nassissatīti attho. Tassa hi eko koṭṭhāso agginā nassissati, nibbāpetuṃ na sakkhissanti, ekaṃ koṭṭhāsaṃ gaṅgā gahetvā gamissati, eko iminā akathitaṃ amussa, amunā akathitaṃ imassa vadantānaṃ pisuṇavācānaṃ vasena bhinnānaṃ manussānaṃ aññamaññabhedena vinassissati. Evaṃ vatvā bhagavā paccūsakāle gaṅgātīraṃ gantvā katamukhadhovano bhikkhācāravelaṃ āgamayamāno nisīdi."
    ],
    "innerText": "Aggito vātiādīsu samuccayattho vāsaddo, agginā ca udakena ca mithubhedena ca nassissatīti attho. Tassa hi eko koṭṭhāso agginā nassissati, nibbāpetuṃ na sakkhissanti, ekaṃ koṭṭhāsaṃ gaṅgā gahetvā gamissati, eko iminā akathitaṃ amussa, amunā akathitaṃ imassa vadantānaṃ pisuṇavācānaṃ vasena bhinnānaṃ manussānaṃ aññamaññabhedena vinassissati. Evaṃ vatvā bhagavā paccūsakāle gaṅgātīraṃ gantvā katamukhadhovano bhikkhācāravelaṃ āgamayamāno nisīdi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sunidhavassakārāpi ",
      " ‘‘amhākaṃ rājā samaṇassa gotamassa upaṭṭhāko ",
      ", so amhe upagate pucchissati ‘satthā kira pāṭaligāmaṃ agamāsi, kiṃ tassa santikaṃ upasaṅkamittha, na upasaṅkamitthā’ti. ‘Upasaṅkamimhā’ti ca vutte ‘nimantayittha, na nimantayitthā’ti pucchissati. ‘Na nimantayimhā’ti ca vutte amhākaṃ dosaṃ āropetvā niggaṇhissati, idañcāpi mayaṃ akataṭṭhāne nagaraṃ māpema, samaṇassa kho pana gotamassa gatagataṭṭhāne kāḷakaṇṇisattā paṭikkamanti, taṃ mayaṃ nagaramaṅgalaṃ vācāpessāmā’’ti cintetvā satthāraṃ upasaṅkamitvā nimantayiṃsu. Tena vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘atha kho sunidhavassakārā’’"
      },
      "tiādi."
    ],
    "innerText": "Sunidhavassakārāpi ‘‘amhākaṃ rājā samaṇassa gotamassa upaṭṭhāko , so amhe upagate pucchissati ‘satthā kira pāṭaligāmaṃ agamāsi, kiṃ tassa santikaṃ upasaṅkamittha, na upasaṅkamitthā’ti. ‘Upasaṅkamimhā’ti ca vutte ‘nimantayittha, na nimantayitthā’ti pucchissati. ‘Na nimantayimhā’ti ca vutte amhākaṃ dosaṃ āropetvā niggaṇhissati, idañcāpi mayaṃ akataṭṭhāne nagaraṃ māpema, samaṇassa kho pana gotamassa gatagataṭṭhāne kāḷakaṇṇisattā paṭikkamanti, taṃ mayaṃ nagaramaṅgalaṃ vācāpessāmā’’ti cintetvā satthāraṃ upasaṅkamitvā nimantayiṃsu. Tena vuttaṃ – ‘‘atha kho sunidhavassakārā’’tiādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pubbaṇhasamaya"
      },
      "nti ",
      " pubbaṇhe kāle. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nivāsetvā"
      },
      "ti gāmapavesananīhārena nivāsanaṃ nivāsetvā kāyabandhanaṃ bandhitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pattacīvaramādāyā"
      },
      "ti cīvaraṃ pārupitvā pattaṃ hatthena gahetvā."
    ],
    "innerText": "Pubbaṇhasamayanti pubbaṇhe kāle. Nivāsetvāti gāmapavesananīhārena nivāsanaṃ nivāsetvā kāyabandhanaṃ bandhitvā. Pattacīvaramādāyāti cīvaraṃ pārupitvā pattaṃ hatthena gahetvā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sīlavantetthā"
      },
      "ti sīlavanto ettha attano vasanaṭṭhāne. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saññate"
      },
      "ti kāyavācācittehi saññate. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tāsaṃ dakkhiṇamādise"
      },
      "ti saṅghassa dinne cattāro paccaye tāsaṃ gharadevatānaṃ ādiseyya pattiṃ dadeyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pūjitā pūjayantī"
      },
      "ti ‘‘ime manussā amhākaṃ ñātakāpi na honti, evampi no pattiṃ dentī’’ti ārakkhaṃ susaṃvihitaṃ karonti suṭṭhu ārakkhaṃ karonti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mānitā mānayantī"
      },
      "ti kālānukālaṃ balikammakaraṇena mānitā ‘‘ete manussā amhākaṃ ñātakāpi na honti, tathāpi catupañcachamāsantaraṃ no balikammaṃ karontī’’ti mānenti uppannaparissayaṃ haranti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tato na"
      },
      "nti tato taṃ paṇḍitajātikaṃ purisaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Orasa"
      },
      "nti ure ṭhapetvā vaḍḍhitaṃ, yathā mātā orasaṃ puttaṃ anukampati, uppannaparissayaharaṇatthamevassa yathā vāyamati, evaṃ anukampantīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhadrāni passatī"
      },
      "ti sundarāni passati."
    ],
    "innerText": "Sīlavantetthāti sīlavanto ettha attano vasanaṭṭhāne. Saññateti kāyavācācittehi saññate. Tāsaṃ dakkhiṇamādiseti saṅghassa dinne cattāro paccaye tāsaṃ gharadevatānaṃ ādiseyya pattiṃ dadeyya. Pūjitā pūjayantīti ‘‘ime manussā amhākaṃ ñātakāpi na honti, evampi no pattiṃ dentī’’ti ārakkhaṃ susaṃvihitaṃ karonti suṭṭhu ārakkhaṃ karonti. Mānitā mānayantīti kālānukālaṃ balikammakaraṇena mānitā ‘‘ete manussā amhākaṃ ñātakāpi na honti, tathāpi catupañcachamāsantaraṃ no balikammaṃ karontī’’ti mānenti uppannaparissayaṃ haranti. Tato nanti tato taṃ paṇḍitajātikaṃ purisaṃ. Orasanti ure ṭhapetvā vaḍḍhitaṃ, yathā mātā orasaṃ puttaṃ anukampati, uppannaparissayaharaṇatthamevassa yathā vāyamati, evaṃ anukampantīti attho. Bhadrāni passatīti sundarāni passati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anumoditvā"
      },
      "ti tehi tadā pasutapuññassa anumodanavasena ",
      " tesaṃ dhammakathaṃ katvā. Sunidhavassakārāpi ‘‘yā tattha devatā āsuṃ, tāsaṃ dakkhiṇamādise’’ti bhagavato vacanaṃ sutvā devatānaṃ pattiṃ adaṃsu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃ gotamadvāraṃ nāma ahosī"
      },
      "ti tassa nagarassa yena dvārena bhagavā nikkhami, taṃ gotamadvāraṃ nāma ahosi. Gaṅgāya pana uttaraṇatthaṃ anotiṇṇattā gotamatitthaṃ nāma nāhosi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pūrā"
      },
      "ti puṇṇā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samatittikā"
      },
      "ti taṭasamaṃ udakassa tittā bharitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kākapeyyā"
      },
      "ti tīre ṭhitakākehi pātuṃ sakkuṇeyyaudakā. Dvīhipi padehi ubhatokūlasamaṃ paripuṇṇabhāvameva dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uḷumpa"
      },
      "nti pāragamanatthāya dārūni saṅghāṭetvā āṇiyo koṭṭetvā kataṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kulla"
      },
      "nti veḷudaṇḍādike valliādīhi bandhitvā kataṃ."
    ],
    "innerText": "Anumoditvāti tehi tadā pasutapuññassa anumodanavasena tesaṃ dhammakathaṃ katvā. Sunidhavassakārāpi ‘‘yā tattha devatā āsuṃ, tāsaṃ dakkhiṇamādise’’ti bhagavato vacanaṃ sutvā devatānaṃ pattiṃ adaṃsu. Taṃ gotamadvāraṃ nāma ahosīti tassa nagarassa yena dvārena bhagavā nikkhami, taṃ gotamadvāraṃ nāma ahosi. Gaṅgāya pana uttaraṇatthaṃ anotiṇṇattā gotamatitthaṃ nāma nāhosi. Pūrāti puṇṇā. Samatittikāti taṭasamaṃ udakassa tittā bharitā. Kākapeyyāti tīre ṭhitakākehi pātuṃ sakkuṇeyyaudakā. Dvīhipi padehi ubhatokūlasamaṃ paripuṇṇabhāvameva dasseti. Uḷumpanti pāragamanatthāya dārūni saṅghāṭetvā āṇiyo koṭṭetvā kataṃ. Kullanti veḷudaṇḍādike valliādīhi bandhitvā kataṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etamatthaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "viditvā"
      },
      "ti etaṃ mahājanassa gaṅgodakamattassapi kevalaṃ tarituṃ asamatthataṃ, attano pana bhikkhusaṅghassa ca atigambhīravitthataṃ saṃsāramahaṇṇavaṃ ",
      " taritvā ṭhitabhāvañca sabbākārato viditvā tadatthaparidīpanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "imaṃ udānaṃ udānesi"
      },
      "."
    ],
    "innerText": "Etamatthaṃviditvāti etaṃ mahājanassa gaṅgodakamattassapi kevalaṃ tarituṃ asamatthataṃ, attano pana bhikkhusaṅghassa ca atigambhīravitthataṃ saṃsāramahaṇṇavaṃ taritvā ṭhitabhāvañca sabbākārato viditvā tadatthaparidīpanaṃ imaṃ udānaṃ udānesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṇṇava"
      },
      "nti sabbantimena paricchedena yojanamattaṃ gambhīrassa ca vitthatassa ca udakaṭṭhānassetaṃ adhivacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sara"
      },
      "nti saritvā gamanato idha nadī adhippetā. Idaṃ vuttaṃ hoti – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ye"
      },
      " gambhīravitthataṃ saṃsāraṇṇavaṃ taṇhāsaritañca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "taranti,"
      },
      " te ariyamaggasaṅkhātaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "setuṃ katvāna visajja pallalāni"
      },
      " anāmasitvāva udakabharitāni ninnaṭṭhānāni, ayaṃ pana idaṃ appamattakaṃ udakaṃ taritukāmo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kullañhi jano pabandhati"
      },
      " kullaṃ bandhituṃ āyāsaṃ āpajjati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tiṇṇā medhāvino janā"
      },
      "ti ariyamaggañāṇasaṅkhātāya medhāya samannāgatattā medhāvino buddhā ca buddhasāvakā ca vinā eva kullena tiṇṇā paratīre patiṭṭhitāti."
    ],
    "innerText": "Tattha aṇṇavanti sabbantimena paricchedena yojanamattaṃ gambhīrassa ca vitthatassa ca udakaṭṭhānassetaṃ adhivacanaṃ. Saranti saritvā gamanato idha nadī adhippetā. Idaṃ vuttaṃ hoti – ye gambhīravitthataṃ saṃsāraṇṇavaṃ taṇhāsaritañca taranti, te ariyamaggasaṅkhātaṃ setuṃ katvāna visajja pallalāni anāmasitvāva udakabharitāni ninnaṭṭhānāni, ayaṃ pana idaṃ appamattakaṃ udakaṃ taritukāmo kullañhi jano pabandhati kullaṃ bandhituṃ āyāsaṃ āpajjati. Tiṇṇā medhāvino janāti ariyamaggañāṇasaṅkhātāya medhāya samannāgatattā medhāvino buddhā ca buddhasāvakā ca vinā eva kullena tiṇṇā paratīre patiṭṭhitāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Chaṭṭhasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Dvidhāpathasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "77"
      },
      ". Sattame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "addhānamaggapaṭipanno"
      },
      "ti addhānasaṅkhātaṃ dīghamaggaṃ paṭipanno gacchanto hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nāgasamālenā"
      },
      "ti evaṃnāmakena therena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pacchāsamaṇenā"
      },
      "ti ayaṃ tadā bhagavato upaṭṭhāko ahosi. Tena naṃ pacchāsamaṇaṃ katvā maggaṃ paṭipajji. Bhagavato hi paṭhamabodhiyaṃ vīsativassāni anibaddhā upaṭṭhākā ahesuṃ, tato paraṃ yāva parinibbānā pañcavīsativassāni āyasmā ānando chāyāva upaṭṭhāsi. Ayaṃ pana anibaddhupaṭṭhākakālo. Tena vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘āyasmatā nāgasamālena pacchāsamaṇenā’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dvidhāpatha"
      },
      "nti dvidhābhūtaṃ maggaṃ. ‘‘Dvedhāpatha’’ntipi paṭhanti āyasmā nāgasamālo attanā pubbe tattha kataparicayattā ujubhāvañcassa sandhāya vadati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ayaṃ, bhante bhagavā, pantho’’"
      },
      "ti."
    ],
    "innerText": "77. Sattame addhānamaggapaṭipannoti addhānasaṅkhātaṃ dīghamaggaṃ paṭipanno gacchanto hoti. Nāgasamālenāti evaṃnāmakena therena. Pacchāsamaṇenāti ayaṃ tadā bhagavato upaṭṭhāko ahosi. Tena naṃ pacchāsamaṇaṃ katvā maggaṃ paṭipajji. Bhagavato hi paṭhamabodhiyaṃ vīsativassāni anibaddhā upaṭṭhākā ahesuṃ, tato paraṃ yāva parinibbānā pañcavīsativassāni āyasmā ānando chāyāva upaṭṭhāsi. Ayaṃ pana anibaddhupaṭṭhākakālo. Tena vuttaṃ – ‘‘āyasmatā nāgasamālena pacchāsamaṇenā’’ti. Dvidhāpathanti dvidhābhūtaṃ maggaṃ. ‘‘Dvedhāpatha’’ntipi paṭhanti āyasmā nāgasamālo attanā pubbe tattha kataparicayattā ujubhāvañcassa sandhāya vadati ‘‘ayaṃ, bhante bhagavā, pantho’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhagavā pana tadā tassa saparissayabhāvaṃ ñatvā tato aññaṃ maggaṃ gantukāmo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ayaṃ, nāgasamāla, pantho’’"
      },
      "ti āha. ‘‘Saparissayo’’ti ca vutte asaddahitvā ‘‘bhagavā na tattha parissayo’’ti vadeyya, tadassa dīgharattaṃ ahitāya dukkhāyāti ‘‘saparissayo’’ti na kathesi. Tikkhattuṃ ",
      " ‘‘ayaṃ ",
      " pantho, iminā gacchāmā’’ti vatvā catutthavāre ‘‘na bhagavā iminā maggena gantuṃ icchati, ayameva ca ujumaggo, handāhaṃ bhagavato pattacīvaraṃ datvā iminā maggena gamissāmī’’ti cintetvā satthu pattacīvaraṃ dātuṃ asakkonto bhūmiyaṃ ṭhapetvā paccupaṭṭhitena dukkhasaṃvattanikena kammunā codiyamāno bhagavato vacanaṃ anādiyitvāva pakkāmi. Tena vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘atha kho āyasmā nāgasamālo bhagavato pattacīvaraṃ tattheva chamāyaṃ nikkhipitvā pakkāmī’’"
      },
      "ti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhagavato pattacīvara"
      },
      "nti attano hatthagataṃ bhagavato pattacīvaraṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatthevā"
      },
      "ti tasmiṃyeva magge ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "chamāyaṃ"
      },
      " pathaviyaṃ nikkhipitvā pakkāmi. Idaṃ vo bhagavā pattacīvaraṃ, sace icchatha, gaṇhatha, yadi attanā icchitamaggaṃyeva gantukāmatthāti adhippāyo. Bhagavāpi attano pattacīvaraṃ sayameva gahetvā yathādhippetaṃ maggaṃ paṭipajji."
    ],
    "innerText": "Bhagavā pana tadā tassa saparissayabhāvaṃ ñatvā tato aññaṃ maggaṃ gantukāmo ‘‘ayaṃ, nāgasamāla, pantho’’ti āha. ‘‘Saparissayo’’ti ca vutte asaddahitvā ‘‘bhagavā na tattha parissayo’’ti vadeyya, tadassa dīgharattaṃ ahitāya dukkhāyāti ‘‘saparissayo’’ti na kathesi. Tikkhattuṃ ‘‘ayaṃ pantho, iminā gacchāmā’’ti vatvā catutthavāre ‘‘na bhagavā iminā maggena gantuṃ icchati, ayameva ca ujumaggo, handāhaṃ bhagavato pattacīvaraṃ datvā iminā maggena gamissāmī’’ti cintetvā satthu pattacīvaraṃ dātuṃ asakkonto bhūmiyaṃ ṭhapetvā paccupaṭṭhitena dukkhasaṃvattanikena kammunā codiyamāno bhagavato vacanaṃ anādiyitvāva pakkāmi. Tena vuttaṃ – ‘‘atha kho āyasmā nāgasamālo bhagavato pattacīvaraṃ tattheva chamāyaṃ nikkhipitvā pakkāmī’’ti. Tattha bhagavato pattacīvaranti attano hatthagataṃ bhagavato pattacīvaraṃ. Tatthevāti tasmiṃyeva magge chamāyaṃ pathaviyaṃ nikkhipitvā pakkāmi. Idaṃ vo bhagavā pattacīvaraṃ, sace icchatha, gaṇhatha, yadi attanā icchitamaggaṃyeva gantukāmatthāti adhippāyo. Bhagavāpi attano pattacīvaraṃ sayameva gahetvā yathādhippetaṃ maggaṃ paṭipajji."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Antarāmagge corā nikkhamitvā"
      },
      "ti tadā kira pañcasatā purisā ",
      " luddā lohitapāṇino rājāparādhino hutvā araññaṃ pavisitvā corikāya jīvikaṃ kappentā ‘‘pāripanthikabhāvena rañño āyapathaṃ pacchindissāmā’’ti maggasamīpe araññe tiṭṭhanti. Te theraṃ tena maggena gacchantaṃ disvā ‘‘ayaṃ samaṇo iminā maggena āgacchati, avaḷañjitabbaṃ maggaṃ vaḷañjeti, amhākaṃ atthibhāvaṃ na jānāti, handa naṃ jānāpessāmā’’ti kujjhitvā gahanaṭṭhānato vegena nikkhamitvā sahasā theraṃ bhūmiyaṃ pātetvā hatthapādehi koṭṭetvā mattikāpattañcassa bhinditvā cīvaraṃ khaṇḍākhaṇḍikaṃ chinditvā pabbajitattā ‘‘taṃ na hanāma, ito paṭṭhāya imassa maggassa parissayabhāvaṃ jānāhī’’ti vissajjesuṃ. Tena vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘atha kho āyasmato…pe… vipphālesu’’"
      },
      "nti."
    ],
    "innerText": "Antarāmagge corā nikkhamitvāti tadā kira pañcasatā purisā luddā lohitapāṇino rājāparādhino hutvā araññaṃ pavisitvā corikāya jīvikaṃ kappentā ‘‘pāripanthikabhāvena rañño āyapathaṃ pacchindissāmā’’ti maggasamīpe araññe tiṭṭhanti. Te theraṃ tena maggena gacchantaṃ disvā ‘‘ayaṃ samaṇo iminā maggena āgacchati, avaḷañjitabbaṃ maggaṃ vaḷañjeti, amhākaṃ atthibhāvaṃ na jānāti, handa naṃ jānāpessāmā’’ti kujjhitvā gahanaṭṭhānato vegena nikkhamitvā sahasā theraṃ bhūmiyaṃ pātetvā hatthapādehi koṭṭetvā mattikāpattañcassa bhinditvā cīvaraṃ khaṇḍākhaṇḍikaṃ chinditvā pabbajitattā ‘‘taṃ na hanāma, ito paṭṭhāya imassa maggassa parissayabhāvaṃ jānāhī’’ti vissajjesuṃ. Tena vuttaṃ – ‘‘atha kho āyasmato…pe… vipphālesu’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhagavāpi ‘‘ayaṃ tena maggena gato corehi bādhito maṃ pariyesitvā idāneva āgamissatī’’ti ñatvā thokaṃ gantvā maggā okkamma aññatarasmiṃ rukkhamūle nisīdi. Āyasmāpi kho nāgasamālo paccāgantvā satthārā gatamaggameva gahetvā gacchanto tasmiṃ rukkhamūle bhagavantaṃ passitvā upasaṅkamitvā vanditvā taṃ pavattiṃ sabbaṃ ārocesi. Tena vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘atha kho āyasmā nāgasamālo…pe… saṅghāṭiñca vipphālesu’’"
      },
      "nti."
    ],
    "innerText": "Bhagavāpi ‘‘ayaṃ tena maggena gato corehi bādhito maṃ pariyesitvā idāneva āgamissatī’’ti ñatvā thokaṃ gantvā maggā okkamma aññatarasmiṃ rukkhamūle nisīdi. Āyasmāpi kho nāgasamālo paccāgantvā satthārā gatamaggameva gahetvā gacchanto tasmiṃ rukkhamūle bhagavantaṃ passitvā upasaṅkamitvā vanditvā taṃ pavattiṃ sabbaṃ ārocesi. Tena vuttaṃ – ‘‘atha kho āyasmā nāgasamālo…pe… saṅghāṭiñca vipphālesu’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etamatthaṃ viditvā"
      },
      "ti etaṃ āyasmato nāgasamālassa attano vacanaṃ anādiyitvā akhemantamaggagamanaṃ, attano ca khemantamaggagamanaṃ viditvā tadatthadīpanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "imaṃ udānaṃ udānesi"
      },
      "."
    ],
    "innerText": "Etamatthaṃ viditvāti etaṃ āyasmato nāgasamālassa attano vacanaṃ anādiyitvā akhemantamaggagamanaṃ, attano ca khemantamaggagamanaṃ viditvā tadatthadīpanaṃ imaṃ udānaṃ udānesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saddhiṃ cara"
      },
      "nti saha caranto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekato vasa"
      },
      "nti idaṃ tasseva vevacanaṃ, saha vasantoti attho ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Misso aññajanena vedagū"
      },
      "ti veditabbaṭṭhena vedasaṅkhātena catusaccaariyamaggañāṇena gatattā adhigatattā, vedassa vā sakalassa ñeyyassa pāraṃ gatattā vedagū. Attano hitāhitaṃ na jānātīti añño, avidvā bāloti attho. Tena aññena janena misso sahacaraṇamattena misso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vidvā pajahāti pāpaka"
      },
      "nti tena vedagūbhāvena vidvā jānanto pāpakaṃ abhaddakaṃ attano dukkhāvahaṃ pajahāti, pāpakaṃ vā akalyāṇapuggalaṃ pajahāti. Yathā kiṃ? ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Koñco khīrapakova ninnaga"
      },
      "nti ",
      " yathā koñcasakuṇo udakamissite khīre upanīte vinā toyaṃ khīramattasseva pivanato khīrapako ninnaṭṭhānagamanena ninnagasaṅkhātaṃ udakaṃ pajahāti vajjeti, evaṃ paṇḍito kira duppaññapuggalehi ṭhānanisajjādīsu sahabhūtopi ācārena te pajahāti, na kadācipi sammisso hoti."
    ],
    "innerText": "Tattha saddhiṃ caranti saha caranto. Ekato vasanti idaṃ tasseva vevacanaṃ, saha vasantoti attho . Misso aññajanena vedagūti veditabbaṭṭhena vedasaṅkhātena catusaccaariyamaggañāṇena gatattā adhigatattā, vedassa vā sakalassa ñeyyassa pāraṃ gatattā vedagū. Attano hitāhitaṃ na jānātīti añño, avidvā bāloti attho. Tena aññena janena misso sahacaraṇamattena misso. Vidvā pajahāti pāpakanti tena vedagūbhāvena vidvā jānanto pāpakaṃ abhaddakaṃ attano dukkhāvahaṃ pajahāti, pāpakaṃ vā akalyāṇapuggalaṃ pajahāti. Yathā kiṃ? Koñco khīrapakova ninnaganti yathā koñcasakuṇo udakamissite khīre upanīte vinā toyaṃ khīramattasseva pivanato khīrapako ninnaṭṭhānagamanena ninnagasaṅkhātaṃ udakaṃ pajahāti vajjeti, evaṃ paṇḍito kira duppaññapuggalehi ṭhānanisajjādīsu sahabhūtopi ācārena te pajahāti, na kadācipi sammisso hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sattamasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Visākhāsuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "78"
      },
      ". Aṭṭhame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "visākhāya migāramātuyā nattā kālaṅkatā hotī"
      },
      "ti visākhāya mahāupāsikāya puttassa dhītā kumārikā kālaṅkatā hoti. Sā kira vattasampannā sāsane abhippasannā mahāupāsikāya gehaṃ paviṭṭhānaṃ bhikkhūnaṃ bhikkhunīnañca attanā kātabbaveyyāvaccaṃ purebhattaṃ pacchābhattañca appamattā akāsi, attano pitāmahiyā cittānukūlaṃ paṭipajji. Tena visākhā gehato bahi gacchantī sabbaṃ tassāyeva bhāraṃ katvā gacchati, rūpena ca dassanīyā pāsādikā, iti sā tassā visesato piyā manāpā ahosi. Sā rogābhibhūtā kālamakāsi. Tena vuttaṃ – ‘‘tena kho pana samayena visākhāya migāramātuyā nattā kālaṅkatā hoti piyā manāpā’’ti. Atha mahāupāsikā tassā maraṇena sokaṃ sandhāretuṃ asakkontī dukkhī dummanā sarīranikkhepaṃ kāretvā ‘‘api nāma satthu santikaṃ gatakāle cittassādaṃ labheyya’’nti bhagavantaṃ upasaṅkami. Tena vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘atha kho visākhā migāramātā’’"
      },
      "tiādi. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "divā divassā"
      },
      "ti divasassāpi divā, majjhanhike kāleti attho."
    ],
    "innerText": "78. Aṭṭhame visākhāya migāramātuyā nattā kālaṅkatā hotīti visākhāya mahāupāsikāya puttassa dhītā kumārikā kālaṅkatā hoti. Sā kira vattasampannā sāsane abhippasannā mahāupāsikāya gehaṃ paviṭṭhānaṃ bhikkhūnaṃ bhikkhunīnañca attanā kātabbaveyyāvaccaṃ purebhattaṃ pacchābhattañca appamattā akāsi, attano pitāmahiyā cittānukūlaṃ paṭipajji. Tena visākhā gehato bahi gacchantī sabbaṃ tassāyeva bhāraṃ katvā gacchati, rūpena ca dassanīyā pāsādikā, iti sā tassā visesato piyā manāpā ahosi. Sā rogābhibhūtā kālamakāsi. Tena vuttaṃ – ‘‘tena kho pana samayena visākhāya migāramātuyā nattā kālaṅkatā hoti piyā manāpā’’ti. Atha mahāupāsikā tassā maraṇena sokaṃ sandhāretuṃ asakkontī dukkhī dummanā sarīranikkhepaṃ kāretvā ‘‘api nāma satthu santikaṃ gatakāle cittassādaṃ labheyya’’nti bhagavantaṃ upasaṅkami. Tena vuttaṃ – ‘‘atha kho visākhā migāramātā’’tiādi. Tattha divā divassāti divasassāpi divā, majjhanhike kāleti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhagavā ",
      " visākhāya vaṭṭābhiratiṃ jānanto upāyena sokatanukaraṇatthaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘iccheyyāsi tvaṃ visākhe’’"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yāvatikā"
      },
      "ti yattakā. Tadā kira satta janakoṭiyo sāvatthiyaṃ paṭivasanti ",
      ". Taṃ sandhāya bhagavā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kīvabahukā pana visākhe sāvatthiyā manussā devasikaṃ kālaṃ karontī’’"
      },
      "ti pucchi. Visākhā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘dasapi, bhante’’"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tīṇī"
      },
      "ti tayo. Ayameva vā pāṭho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avivittā"
      },
      "ti asuññā."
    ],
    "innerText": "Bhagavā visākhāya vaṭṭābhiratiṃ jānanto upāyena sokatanukaraṇatthaṃ ‘‘iccheyyāsi tvaṃ visākhe’’tiādimāha. Tattha yāvatikāti yattakā. Tadā kira satta janakoṭiyo sāvatthiyaṃ paṭivasanti . Taṃ sandhāya bhagavā ‘‘kīvabahukā pana visākhe sāvatthiyā manussā devasikaṃ kālaṃ karontī’’ti pucchi. Visākhā ‘‘dasapi, bhante’’tiādimāha. Tattha tīṇīti tayo. Ayameva vā pāṭho. Avivittāti asuññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " bhagavā attano adhippāyaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘api nu tvaṃ kadāci karahaci anallavatthā vā bhaveyyāsi anallakesā vā’’"
      },
      "ti āha. Nanu evaṃ sante tayā sabbakālaṃ sokābhibhūtāya matānaṃ puttādīnaṃ amaṅgalūpacāravasena udakorohaṇena allavatthāya allakesāya eva bhavitabbanti dasseti. Taṃ sutvā upāsikā saṃvegajātā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘no hetaṃ, bhante’’"
      },
      "ti paṭikkhipitvā piyavatthuṃ vippaṭisārato attano cittassa nivattabhāvaṃ satthu ārocentī ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘alaṃ me, bhante, tāvabahukehi puttehi ca nattārehi cā’’"
      },
      "ti āha."
    ],
    "innerText": "Atha bhagavā attano adhippāyaṃ pakāsento ‘‘api nu tvaṃ kadāci karahaci anallavatthā vā bhaveyyāsi anallakesā vā’’ti āha. Nanu evaṃ sante tayā sabbakālaṃ sokābhibhūtāya matānaṃ puttādīnaṃ amaṅgalūpacāravasena udakorohaṇena allavatthāya allakesāya eva bhavitabbanti dasseti. Taṃ sutvā upāsikā saṃvegajātā ‘‘no hetaṃ, bhante’’ti paṭikkhipitvā piyavatthuṃ vippaṭisārato attano cittassa nivattabhāvaṃ satthu ārocentī ‘‘alaṃ me, bhante, tāvabahukehi puttehi ca nattārehi cā’’ti āha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Athassā bhagavā ‘‘dukkhaṃ nāmetaṃ piyavatthunimittaṃ, yattakāni piyavatthūni, tattakāni dukkhāni. Tasmā sukhakāmena dukkhappaṭikūlena sabbaso piyavatthuto cittaṃ vivecetabba’’nti dhammaṃ desento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yesaṃ kho visākhe sataṃ piyāni, sataṃ tesaṃ dukkhānī’’"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sataṃ piyānī"
      },
      "ti sataṃ piyāyitabbavatthūni. ‘‘Sataṃ piya’’ntipi keci paṭhanti. Ettha ca yasmā ekato paṭṭhāya yāva dasa, tāva saṅkhyā saṅkhyeyyappadhānā, tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yesaṃ dasa piyāni, dasa tesaṃ dukkhānī’’"
      },
      "tiādinā pāḷi āgatā. Keci pana ‘‘yesaṃ dasa piyānaṃ, dasa nesaṃ dukkhāna’’ntiādinā paṭhanti, taṃ na sundaraṃ. Yasmā pana vīsatito paṭṭhāya yāva sataṃ, tāva saṅkhyā saṅkhyeyyappadhānāva, tasmā tatthāpi saṅkhyeyyappadhānataṃyeva gahetvā ‘‘yesaṃ kho visākhe sataṃ piyāni, sataṃ tesaṃ dukkhānī’’tiādinā pāḷi āgatā. Sabbesampi ca ‘‘yesaṃ ekaṃ piyaṃ, ekaṃ tesaṃ dukkha’’nti pāṭho, na pana dukkhassāti. Etasmiñhi pakkhe ekarasā ekajjhāsayā ca bhagavato desanā hoti. Tasmā yathāvuttanayāva pāḷi veditabbā."
    ],
    "innerText": "Athassā bhagavā ‘‘dukkhaṃ nāmetaṃ piyavatthunimittaṃ, yattakāni piyavatthūni, tattakāni dukkhāni. Tasmā sukhakāmena dukkhappaṭikūlena sabbaso piyavatthuto cittaṃ vivecetabba’’nti dhammaṃ desento ‘‘yesaṃ kho visākhe sataṃ piyāni, sataṃ tesaṃ dukkhānī’’tiādimāha. Tattha sataṃ piyānīti sataṃ piyāyitabbavatthūni. ‘‘Sataṃ piya’’ntipi keci paṭhanti. Ettha ca yasmā ekato paṭṭhāya yāva dasa, tāva saṅkhyā saṅkhyeyyappadhānā, tasmā ‘‘yesaṃ dasa piyāni, dasa tesaṃ dukkhānī’’tiādinā pāḷi āgatā. Keci pana ‘‘yesaṃ dasa piyānaṃ, dasa nesaṃ dukkhāna’’ntiādinā paṭhanti, taṃ na sundaraṃ. Yasmā pana vīsatito paṭṭhāya yāva sataṃ, tāva saṅkhyā saṅkhyeyyappadhānāva, tasmā tatthāpi saṅkhyeyyappadhānataṃyeva gahetvā ‘‘yesaṃ kho visākhe sataṃ piyāni, sataṃ tesaṃ dukkhānī’’tiādinā pāḷi āgatā. Sabbesampi ca ‘‘yesaṃ ekaṃ piyaṃ, ekaṃ tesaṃ dukkha’’nti pāṭho, na pana dukkhassāti. Etasmiñhi pakkhe ekarasā ekajjhāsayā ca bhagavato desanā hoti. Tasmā yathāvuttanayāva pāḷi veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etamatthaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "viditvā"
      },
      " sokaparidevādikaṃ cetasikaṃ kāyikañca dukkhaṃ piyavatthunimittaṃ piyavatthumhi sati hoti, asati na hotīti etamatthaṃ sabbākārato jānitvā tadatthaparidīpanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "imaṃ udānaṃ udānesi"
      },
      "."
    ],
    "innerText": "Etamatthaṃviditvā sokaparidevādikaṃ cetasikaṃ kāyikañca dukkhaṃ piyavatthunimittaṃ piyavatthumhi sati hoti, asati na hotīti etamatthaṃ sabbākārato jānitvā tadatthaparidīpanaṃ imaṃ udānaṃ udānesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tassattho – ñātibhogarogasīladiṭṭhibyasanehi phuṭṭhassa anto nijjhāyantassa bālassa cittasantāpalakkhaṇā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ye keci"
      },
      " mudumajjhādibhedena yādisā tādisā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sokā vā"
      },
      " tehiyeva phuṭṭhassa ",
      " sokuddehakasamuṭṭhāpitavacīvippalāpalakkhaṇā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paridevitā vā"
      },
      " aniṭṭhaphoṭṭhabbapaṭihatakāyassa ",
      " kāyapīḷanalakkhaṇā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dukkhā vā"
      },
      " tathā avuttatthassa vikappanatthena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vā"
      },
      "saddena gahitā domanassūpāyāsādayo vā nissayabhedena ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anekarūpā"
      },
      " nānāvidhā imasmiṃ sattaloke dissanti upalabbhanti, sabbepi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ete piyaṃ"
      },
      " piyajātikaṃ sattaṃ saṅkhārañca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭicca"
      },
      " nissāya āgamma paccayaṃ katvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pabhavanti"
      },
      " nibbattanti. Tasmiṃ pana yathāvutte piyavatthumhi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "piye asante"
      },
      " piyabhāvakare chandarāge pahīne na kadācipi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ete bhavanti"
      },
      ". Vuttañhetaṃ – ‘‘piyato jāyatī soko…pe… pemato jāyatī soko’’ti ca ādi (dha. pa. 212-213). Tathā ‘‘piyappabhūtā kalahā vivādā, paridevasokā sahamaccharehī’’ti ca ādi (su. ni. 869). Ettha ca ‘‘paridevitā vā dukkhā vā’’ti liṅgavipallāsena vuttaṃ, ‘‘paridevitāni vā dukkhāni vā’’ti vattabbe vibhattilopo vā katoti veditabbo."
    ],
    "innerText": "Tassattho – ñātibhogarogasīladiṭṭhibyasanehi phuṭṭhassa anto nijjhāyantassa bālassa cittasantāpalakkhaṇā ye keci mudumajjhādibhedena yādisā tādisā sokā vā tehiyeva phuṭṭhassa sokuddehakasamuṭṭhāpitavacīvippalāpalakkhaṇā paridevitā vā aniṭṭhaphoṭṭhabbapaṭihatakāyassa kāyapīḷanalakkhaṇā dukkhā vā tathā avuttatthassa vikappanatthena vāsaddena gahitā domanassūpāyāsādayo vā nissayabhedena ca anekarūpā nānāvidhā imasmiṃ sattaloke dissanti upalabbhanti, sabbepi ete piyaṃ piyajātikaṃ sattaṃ saṅkhārañca paṭicca nissāya āgamma paccayaṃ katvā pabhavanti nibbattanti. Tasmiṃ pana yathāvutte piyavatthumhi piye asante piyabhāvakare chandarāge pahīne na kadācipi ete bhavanti. Vuttañhetaṃ – ‘‘piyato jāyatī soko…pe… pemato jāyatī soko’’ti ca ādi (dha. pa. 212-213). Tathā ‘‘piyappabhūtā kalahā vivādā, paridevasokā sahamaccharehī’’ti ca ādi (su. ni. 869). Ettha ca ‘‘paridevitā vā dukkhā vā’’ti liṅgavipallāsena vuttaṃ, ‘‘paridevitāni vā dukkhāni vā’’ti vattabbe vibhattilopo vā katoti veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasmā hi te sukhino vītasokā"
      },
      "ti yasmā piyappabhūtā sokādayo yesaṃ natthi, tasmā te eva sukhino vītasokā nāma. Ke pana te? ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yesaṃ piyaṃ natthi kuhiñci loke"
      },
      " yesaṃ ariyānaṃ sabbaso vītarāgattā katthacipi sattaloke saṅkhāraloke ca piyaṃ piyabhāvo ‘‘putto’’ti vā ‘‘bhātā’’ti vā ‘‘bhaginī’’ti vā ‘‘bhariyā’’ti vā piyaṃ piyāyanaṃ piyabhāvo natthi, saṅkhāralokepi ‘‘etaṃ mama santakaṃ, imināhaṃ imaṃ nāma sukhaṃ labhāmi labhissāmī’’ti piyaṃ piyāyanaṃ piyabhāvo natthi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasmā asokaṃ virajaṃ patthayāno, piyaṃ na kayirātha kuhiñci loke"
      },
      "ti yasmā ca sukhino nāma vītasokā, vītasokattāva katthacipi visaye piyabhāvo natthi, tasmā attano yathāvuttasokābhāvena ca asokaṃ asokabhāvaṃ rāgarajādivigamanena virajaṃ ",
      " virajabhāvaṃ arahattaṃ, sokassa rāgarajādīnañca abhāvahetubhāvato vā ‘‘asokaṃ viraja’’nti laddhanāmaṃ nibbānaṃ patthayāno kattukamyatākusalacchandassa vasena chandajāto katthaci loke rūpādidhamme ",
      " antamaso samathavipassanādhammepi piyaṃ piyabhāvaṃ viyāyanaṃ na kayirātha na uppādeyya. Vuttañhetaṃ – ‘‘dhammāpi vo, bhikkhave, pahātabbā, pageva adhammā’’ti (ma. ni. 1.240)."
    ],
    "innerText": "Tasmā hi te sukhino vītasokāti yasmā piyappabhūtā sokādayo yesaṃ natthi, tasmā te eva sukhino vītasokā nāma. Ke pana te? Yesaṃ piyaṃ natthi kuhiñci loke yesaṃ ariyānaṃ sabbaso vītarāgattā katthacipi sattaloke saṅkhāraloke ca piyaṃ piyabhāvo ‘‘putto’’ti vā ‘‘bhātā’’ti vā ‘‘bhaginī’’ti vā ‘‘bhariyā’’ti vā piyaṃ piyāyanaṃ piyabhāvo natthi, saṅkhāralokepi ‘‘etaṃ mama santakaṃ, imināhaṃ imaṃ nāma sukhaṃ labhāmi labhissāmī’’ti piyaṃ piyāyanaṃ piyabhāvo natthi. Tasmā asokaṃ virajaṃ patthayāno, piyaṃ na kayirātha kuhiñci loketi yasmā ca sukhino nāma vītasokā, vītasokattāva katthacipi visaye piyabhāvo natthi, tasmā attano yathāvuttasokābhāvena ca asokaṃ asokabhāvaṃ rāgarajādivigamanena virajaṃ virajabhāvaṃ arahattaṃ, sokassa rāgarajādīnañca abhāvahetubhāvato vā ‘‘asokaṃ viraja’’nti laddhanāmaṃ nibbānaṃ patthayāno kattukamyatākusalacchandassa vasena chandajāto katthaci loke rūpādidhamme antamaso samathavipassanādhammepi piyaṃ piyabhāvaṃ viyāyanaṃ na kayirātha na uppādeyya. Vuttañhetaṃ – ‘‘dhammāpi vo, bhikkhave, pahātabbā, pageva adhammā’’ti (ma. ni. 1.240)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Aṭṭhamasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Paṭhamadabbasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "79"
      },
      ". Navame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āyasmā"
      },
      "ti piyavacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dabbo"
      },
      "ti tassa therassa nāmaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mallaputto"
      },
      "ti mallarājassa putto. So hi āyasmā padumuttarassa bhagavato pādamūle katābhinīhāro kappasatasahassaṃ upacitapuññasañcayo amhākaṃ bhagavato kāle mallarājassa devikā kucchiyaṃ nibbatto katādhikārattā jātiyā sattavassikakāleyeva mātāpitaro upasaṅkamitvā pabbajjaṃ yāci. Te ca ‘‘pabbajitvāpi ācāraṃ tāva sikkhatu, sace taṃ nābhiramissati, idheva āgamissatī’’ti anujāniṃsu. So satthāraṃ upasaṅkamitvā pabbajjaṃ yāci. Satthāpissa upanissayasampattiṃ oloketvā pabbajjaṃ anujāni. Tassa pabbajjāsamaye dinnaovādena bhavattayaṃ ādittaṃ viya upaṭṭhāsi. So vipassanaṃ paṭṭhapetvā khuraggeyeva arahattaṃ pāpuṇi. Yaṃkiñci sāvakena pattabbaṃ, ‘‘tisso vijjā catasso paṭisambhidā chaḷabhiññā nava lokuttaradhammā’’ti evamādikaṃ sabbaṃ adhigantvā asītiyā mahāsāvakesu abbhantaro ahosi. Vuttañhetaṃ tena āyasmatā –"
    ],
    "innerText": "79. Navame āyasmāti piyavacanaṃ. Dabboti tassa therassa nāmaṃ. Mallaputtoti mallarājassa putto. So hi āyasmā padumuttarassa bhagavato pādamūle katābhinīhāro kappasatasahassaṃ upacitapuññasañcayo amhākaṃ bhagavato kāle mallarājassa devikā kucchiyaṃ nibbatto katādhikārattā jātiyā sattavassikakāleyeva mātāpitaro upasaṅkamitvā pabbajjaṃ yāci. Te ca ‘‘pabbajitvāpi ācāraṃ tāva sikkhatu, sace taṃ nābhiramissati, idheva āgamissatī’’ti anujāniṃsu. So satthāraṃ upasaṅkamitvā pabbajjaṃ yāci. Satthāpissa upanissayasampattiṃ oloketvā pabbajjaṃ anujāni. Tassa pabbajjāsamaye dinnaovādena bhavattayaṃ ādittaṃ viya upaṭṭhāsi. So vipassanaṃ paṭṭhapetvā khuraggeyeva arahattaṃ pāpuṇi. Yaṃkiñci sāvakena pattabbaṃ, ‘‘tisso vijjā catasso paṭisambhidā chaḷabhiññā nava lokuttaradhammā’’ti evamādikaṃ sabbaṃ adhigantvā asītiyā mahāsāvakesu abbhantaro ahosi. Vuttañhetaṃ tena āyasmatā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Mayā kho jātiyā sattavassena arahattaṃ sacchikataṃ, yaṃkiñci sāvakena pattabbaṃ, sabbaṃ taṃ anuppattaṃ mayā’’tiādi (pārā. 380)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yena bhagavā tenupasaṅkamī"
      },
      "ti so kirāyasmā ekadivasaṃ rājagahe piṇḍāya caritvā pacchābhattaṃ piṇḍapātappaṭikkanto bhagavato vattaṃ dassetvā divāṭṭhānaṃ gantvā ",
      " udakakumbhato udakaṃ gahetvā pāde pakkhāletvā gattāni ",
      " sītiṃ katvā cammakkhaṇḍaṃ paññāpetvā nisinno kālaparicchedaṃ katvā samāpattiṃ samāpajji. Athāyasmā yathākālaparicchedaṃ samāpattito vuṭṭhahitvā attano āyusaṅkhāre olokesi. Tassa te parikkhīṇā katipayamuhuttikā upaṭṭhahiṃsu. So cintesi – ‘‘na kho metaṃ patirūpaṃ, yamahaṃ satthu anārocetvā sabrahmacārīhi ca avidito idha yathānisinnova parinibbāyissāmi. Yaṃnūnāhaṃ satthāraṃ upasaṅkamitvā parinibbānaṃ anujānāpetvā satthu vattaṃ dassetvā sāsanassa niyyānikabhāvadassanatthaṃ mayhaṃ iddhānubhāvaṃ vibhāvento ākāse nisīditvā tejodhātuṃ samāpajjitvā parinibbāyeyyaṃ. Evaṃ sante ye mayi assaddhā appasannā, tesampi pasādo uppajjissati, tadassa tesaṃ dīgharattaṃ hitāya sukhāyā’’ti. Evañca so āyasmā cintetvā bhagavantaṃ upasaṅkamitvā sabbaṃ taṃ tatheva akāsi. Tena vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘atha kho āyasmā dabbo mallaputto yena bhagavā tenupasaṅkamī’’"
      },
      "tiādi."
    ],
    "innerText": "Yena bhagavā tenupasaṅkamīti so kirāyasmā ekadivasaṃ rājagahe piṇḍāya caritvā pacchābhattaṃ piṇḍapātappaṭikkanto bhagavato vattaṃ dassetvā divāṭṭhānaṃ gantvā udakakumbhato udakaṃ gahetvā pāde pakkhāletvā gattāni sītiṃ katvā cammakkhaṇḍaṃ paññāpetvā nisinno kālaparicchedaṃ katvā samāpattiṃ samāpajji. Athāyasmā yathākālaparicchedaṃ samāpattito vuṭṭhahitvā attano āyusaṅkhāre olokesi. Tassa te parikkhīṇā katipayamuhuttikā upaṭṭhahiṃsu. So cintesi – ‘‘na kho metaṃ patirūpaṃ, yamahaṃ satthu anārocetvā sabrahmacārīhi ca avidito idha yathānisinnova parinibbāyissāmi. Yaṃnūnāhaṃ satthāraṃ upasaṅkamitvā parinibbānaṃ anujānāpetvā satthu vattaṃ dassetvā sāsanassa niyyānikabhāvadassanatthaṃ mayhaṃ iddhānubhāvaṃ vibhāvento ākāse nisīditvā tejodhātuṃ samāpajjitvā parinibbāyeyyaṃ. Evaṃ sante ye mayi assaddhā appasannā, tesampi pasādo uppajjissati, tadassa tesaṃ dīgharattaṃ hitāya sukhāyā’’ti. Evañca so āyasmā cintetvā bhagavantaṃ upasaṅkamitvā sabbaṃ taṃ tatheva akāsi. Tena vuttaṃ – ‘‘atha kho āyasmā dabbo mallaputto yena bhagavā tenupasaṅkamī’’tiādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "parinibbānakālo me"
      },
      "ti ‘‘bhagavā mayhaṃ anupādisesāya nibbānadhātuyā parinibbānakālo upaṭṭhito, tamahaṃ bhagavato ārocetvā parinibbāyitukāmomhī’’ti dasseti. Keci panāhu ‘‘na tāva thero jiṇṇo, na ca gilāno, parinibbānāya ca satthāraṃ āpucchati, kiṃ tattha kāraṇaṃ? ‘Mettiyabhūmajakā bhikkhū pubbe maṃ amūlakena pārājikena anuddhaṃsesuṃ, tasmiṃ adhikaraṇe vūpasantepi akkosantiyeva. Tesaṃ saddahitvā aññepi puthujjanā mayi agāravaṃ paribhavañca karonti. Imañca dukkhabhāraṃ niratthakaṃ vahitvā kiṃ payojanaṃ, tasmāhaṃ idāneva parinibbāyissāmī’ti sanniṭṭhānaṃ katvā satthāraṃ āpucchī’’ti. Taṃ akāraṇaṃ. Na hi khīṇāsavā aparikkhīṇe āyusaṅkhāre paresaṃ upavādādibhayena parinibbānāya cetenti ghaṭayanti vāyamanti, na ca paresaṃ ",
      " pasaṃsādihetu ciraṃ tiṭṭhanti, atha kho saraseneva attano āyusaṅkhārassa parikkhayaṃ āgamenti. Yathāha –"
    ],
    "innerText": "Tattha parinibbānakālo meti ‘‘bhagavā mayhaṃ anupādisesāya nibbānadhātuyā parinibbānakālo upaṭṭhito, tamahaṃ bhagavato ārocetvā parinibbāyitukāmomhī’’ti dasseti. Keci panāhu ‘‘na tāva thero jiṇṇo, na ca gilāno, parinibbānāya ca satthāraṃ āpucchati, kiṃ tattha kāraṇaṃ? ‘Mettiyabhūmajakā bhikkhū pubbe maṃ amūlakena pārājikena anuddhaṃsesuṃ, tasmiṃ adhikaraṇe vūpasantepi akkosantiyeva. Tesaṃ saddahitvā aññepi puthujjanā mayi agāravaṃ paribhavañca karonti. Imañca dukkhabhāraṃ niratthakaṃ vahitvā kiṃ payojanaṃ, tasmāhaṃ idāneva parinibbāyissāmī’ti sanniṭṭhānaṃ katvā satthāraṃ āpucchī’’ti. Taṃ akāraṇaṃ. Na hi khīṇāsavā aparikkhīṇe āyusaṅkhāre paresaṃ upavādādibhayena parinibbānāya cetenti ghaṭayanti vāyamanti, na ca paresaṃ pasaṃsādihetu ciraṃ tiṭṭhanti, atha kho saraseneva attano āyusaṅkhārassa parikkhayaṃ āgamenti. Yathāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Nābhikaṅkhāmi maraṇaṃ, nābhikaṅkhāmi jīvitaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kālañca paṭikaṅkhāmi, nibbisaṃ bhatako yathā’’ti. (theragā. 196, 606; mi. pa. 2.2.4) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Bhagavāpissa āyusaṅkhāraṃ oloketvā parikkhīṇabhāvaṃ ñatvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yassadāni tvaṃ, dabba, kālaṃ maññasī’’"
      },
      "ti āha."
    ],
    "innerText": "Bhagavāpissa āyusaṅkhāraṃ oloketvā parikkhīṇabhāvaṃ ñatvā ‘‘yassadāni tvaṃ, dabba, kālaṃ maññasī’’ti āha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vehāsaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abbhuggantvā"
      },
      "ti ākāsaṃ abhiuggantvā, vehāsaṃ gantvāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhi"
      },
      "saddayogena hi idaṃ upayogavacanaṃ, attho pana bhummavasena veditabbo. Vehāsaṃ abbhuggantvā kiṃ akāsīti āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ākāse antalikkhe pallaṅkena nisīditvā’’"
      },
      "tiādi. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tejodhātuṃ samāpajjitvā"
      },
      "ti tejokasiṇacatutthajjhānasamāpattiṃ samāpajjitvā. Thero hi tadā bhagavantaṃ vanditvā tikkhattuṃ padakkhiṇaṃ katvā ekamantaṃ ṭhito ‘‘bhagavā kappasatasahassaṃ tumhehi saddhiṃ tattha tattha vasanto puññāni karonto imamevatthaṃ sandhāya akāsiṃ, svāyamattho ajja matthakaṃ patto, idaṃ pacchimadassana’’nti āha. Ye tattha puthujjanabhikkhū sotāpannasakadāgāmino ca, tesu ekaccānaṃ mahantaṃ kāruññaṃ ahosi, ekacce ārodanappattā ahesuṃ. Athassa bhagavā cittācāraṃ ñatvā ‘‘tena hi, dabba, mayhaṃ bhikkhusaṅghassa ca iddhipāṭihāriyaṃ dassehī’’ti āha. Tāvadeva sabbo bhikkhusaṅgho sannipati. Athāyasmā dabbo ‘‘ekopi hutvā bahudhā hotī’’tiādinā (paṭi. ma. 1.102; dī. ni. 1.484) nayena āgatāni sāvakasādhāraṇāni sabbāni pāṭihāriyāni dassetvā puna ca bhagavantaṃ vanditvā ākāsaṃ abbhuggantvā ",
      " ākāse pathaviṃ nimminitvā tattha pallaṅkena nisinno tejokasiṇasamāpattiyā parikammaṃ katvā samāpattiṃ samāpajjitvā vuṭṭhāya sarīraṃ āvajjitvā puna samāpattiṃ samāpajjitvā sarīrajhāpanatejodhātuṃ adhiṭṭhahitvā parinibbāyi. Saha adhiṭṭhānena sabbo kāyo agginā āditto ahosi. Khaṇeneva ca so aggi kappavuṭṭhānaggi viya aṇumattampi saṅkhāragataṃ masimattampi tattha kiñci anavasesento adhiṭṭhānabalena jhāpetvā nibbāyi. Tena vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘atha kho āyasmā dabbo mallaputto’’"
      },
      "tiādi. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vuṭṭhahitvā parinibbāyī"
      },
      "ti iddhicittato vuṭṭhahitvā bhavaṅgacittena ",
      " parinibbāyi."
    ],
    "innerText": "Vehāsaṃabbhuggantvāti ākāsaṃ abhiuggantvā, vehāsaṃ gantvāti attho. Abhisaddayogena hi idaṃ upayogavacanaṃ, attho pana bhummavasena veditabbo. Vehāsaṃ abbhuggantvā kiṃ akāsīti āha – ‘‘ākāse antalikkhe pallaṅkena nisīditvā’’tiādi. Tattha tejodhātuṃ samāpajjitvāti tejokasiṇacatutthajjhānasamāpattiṃ samāpajjitvā. Thero hi tadā bhagavantaṃ vanditvā tikkhattuṃ padakkhiṇaṃ katvā ekamantaṃ ṭhito ‘‘bhagavā kappasatasahassaṃ tumhehi saddhiṃ tattha tattha vasanto puññāni karonto imamevatthaṃ sandhāya akāsiṃ, svāyamattho ajja matthakaṃ patto, idaṃ pacchimadassana’’nti āha. Ye tattha puthujjanabhikkhū sotāpannasakadāgāmino ca, tesu ekaccānaṃ mahantaṃ kāruññaṃ ahosi, ekacce ārodanappattā ahesuṃ. Athassa bhagavā cittācāraṃ ñatvā ‘‘tena hi, dabba, mayhaṃ bhikkhusaṅghassa ca iddhipāṭihāriyaṃ dassehī’’ti āha. Tāvadeva sabbo bhikkhusaṅgho sannipati. Athāyasmā dabbo ‘‘ekopi hutvā bahudhā hotī’’tiādinā (paṭi. ma. 1.102; dī. ni. 1.484) nayena āgatāni sāvakasādhāraṇāni sabbāni pāṭihāriyāni dassetvā puna ca bhagavantaṃ vanditvā ākāsaṃ abbhuggantvā ākāse pathaviṃ nimminitvā tattha pallaṅkena nisinno tejokasiṇasamāpattiyā parikammaṃ katvā samāpattiṃ samāpajjitvā vuṭṭhāya sarīraṃ āvajjitvā puna samāpattiṃ samāpajjitvā sarīrajhāpanatejodhātuṃ adhiṭṭhahitvā parinibbāyi. Saha adhiṭṭhānena sabbo kāyo agginā āditto ahosi. Khaṇeneva ca so aggi kappavuṭṭhānaggi viya aṇumattampi saṅkhāragataṃ masimattampi tattha kiñci anavasesento adhiṭṭhānabalena jhāpetvā nibbāyi. Tena vuttaṃ – ‘‘atha kho āyasmā dabbo mallaputto’’tiādi. Tattha vuṭṭhahitvā parinibbāyīti iddhicittato vuṭṭhahitvā bhavaṅgacittena parinibbāyi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jhāyamānassā"
      },
      "ti jāliyamānassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ḍayhamānassā"
      },
      "ti tasseva vevacanaṃ. Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jhāyamānassā"
      },
      "ti jālāpavattikkhaṇaṃ sandhāya vuttaṃ, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ḍayhamānassā"
      },
      "ti vītaccitaṅgārakkhaṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Chārikā"
      },
      "ti bhasmaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Masī"
      },
      "ti kajjalaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na paññāyitthā"
      },
      "ti na passittha, adhiṭṭhānabalena sabbaṃ khaṇeneva antaradhāyitthāti attho. Kasmā pana thero uttarimanussadhammaṃ iddhipāṭihāriyaṃ dassesi, nanu bhagavatā iddhipāṭihāriyakaraṇaṃ paṭikkhittanti ",
      "? Na codetabbametaṃ gihīnaṃ sammukhā pāṭihāriyakaraṇassa paṭikkhittattā. Tañca kho vikubbanavasena, na panevaṃ adhiṭṭhānavasena. Ayaṃ panāyasmā dhammasāminā āṇattova pāṭihāriyaṃ dassesi."
    ],
    "innerText": "Jhāyamānassāti jāliyamānassa. Ḍayhamānassāti tasseva vevacanaṃ. Atha vā jhāyamānassāti jālāpavattikkhaṇaṃ sandhāya vuttaṃ, ḍayhamānassāti vītaccitaṅgārakkhaṇaṃ. Chārikāti bhasmaṃ. Masīti kajjalaṃ. Na paññāyitthāti na passittha, adhiṭṭhānabalena sabbaṃ khaṇeneva antaradhāyitthāti attho. Kasmā pana thero uttarimanussadhammaṃ iddhipāṭihāriyaṃ dassesi, nanu bhagavatā iddhipāṭihāriyakaraṇaṃ paṭikkhittanti ? Na codetabbametaṃ gihīnaṃ sammukhā pāṭihāriyakaraṇassa paṭikkhittattā. Tañca kho vikubbanavasena, na panevaṃ adhiṭṭhānavasena. Ayaṃ panāyasmā dhammasāminā āṇattova pāṭihāriyaṃ dassesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etamatthaṃ viditvā"
      },
      "ti etaṃ āyasmato dabbassa mallaputtassa anupādāparinibbānaṃ sabbākārato viditvā tadatthaparidīpanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "imaṃ udānaṃ udānesi"
      },
      "."
    ],
    "innerText": "Etamatthaṃ viditvāti etaṃ āyasmato dabbassa mallaputtassa anupādāparinibbānaṃ sabbākārato viditvā tadatthaparidīpanaṃ imaṃ udānaṃ udānesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhedi kāyo"
      },
      "ti sabbo bhūtupādāyapabhedo catusantatirūpakāyo bhijji, anavasesato ḍayhi, antaradhāyi, anuppattidhammataṃ āpajji. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nirodhi saññā"
      },
      "ti rūpāyatanādigocaratāya rūpasaññādibhedā sabbāpi saññā appaṭisandhikena nirodhena nirujjhi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vedanā sītibhaviṃsu sabbā"
      },
      "ti vipākavedanā kiriyavedanāti sabbāpi vedanā appaṭisandhikanirodhena niruddhattā aṇumattampi vedanādarathassa abhāvato sītibhūtā ahesuṃ, kusalākusalavedanā pana arahattaphalakkhaṇeyeva nirodhaṃ gatā. ‘‘Sītirahiṃsū’’tipi paṭhanti, santā niruddhā ahesunti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vūpasamiṃsu saṅkhārā"
      },
      "ti vipākakiriyappabhedā sabbepi phassādayo saṅkhārakkhandhadhammā appaṭisandhikanirodheneva niruddhattā visesena upasamiṃsu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Viññāṇaṃ atthamāgamā"
      },
      "ti viññāṇampi vipākakiriyappabhedaṃ sabbaṃ appaṭisandhikanirodheneva atthaṃ vināsaṃ upacchedaṃ agamā agacchi."
    ],
    "innerText": "Tattha abhedi kāyoti sabbo bhūtupādāyapabhedo catusantatirūpakāyo bhijji, anavasesato ḍayhi, antaradhāyi, anuppattidhammataṃ āpajji. Nirodhi saññāti rūpāyatanādigocaratāya rūpasaññādibhedā sabbāpi saññā appaṭisandhikena nirodhena nirujjhi. Vedanā sītibhaviṃsu sabbāti vipākavedanā kiriyavedanāti sabbāpi vedanā appaṭisandhikanirodhena niruddhattā aṇumattampi vedanādarathassa abhāvato sītibhūtā ahesuṃ, kusalākusalavedanā pana arahattaphalakkhaṇeyeva nirodhaṃ gatā. ‘‘Sītirahiṃsū’’tipi paṭhanti, santā niruddhā ahesunti attho. Vūpasamiṃsu saṅkhārāti vipākakiriyappabhedā sabbepi phassādayo saṅkhārakkhandhadhammā appaṭisandhikanirodheneva niruddhattā visesena upasamiṃsu. Viññāṇaṃ atthamāgamāti viññāṇampi vipākakiriyappabhedaṃ sabbaṃ appaṭisandhikanirodheneva atthaṃ vināsaṃ upacchedaṃ agamā agacchi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Iti ",
      " bhagavā āyasmato dabbassa mallaputtassa pañcannampi khandhānaṃ pubbeyeva kilesābhisaṅkhārupādānassa anavasesato niruddhattā anupādāno ",
      " viya jātavedo appaṭisandhikanirodhena niruddhabhāvaṃ nissāya pītivegavissaṭṭhaṃ udānaṃ udānesīti."
    ],
    "innerText": "Iti bhagavā āyasmato dabbassa mallaputtassa pañcannampi khandhānaṃ pubbeyeva kilesābhisaṅkhārupādānassa anavasesato niruddhattā anupādāno viya jātavedo appaṭisandhikanirodhena niruddhabhāvaṃ nissāya pītivegavissaṭṭhaṃ udānaṃ udānesīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Navamasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Dutiyadabbasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "80"
      },
      ". Dasame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tatra kho bhagavā bhikkhū āmantesī"
      },
      "ti bhagavā rājagahe yathābhirantaṃ viharitvā janapadacārikaṃ caranto anukkamena sāvatthiṃ patvā jetavane viharantoyeva yesaṃ bhikkhūnaṃ āyasmato dabbassa mallaputtassa parinibbānaṃ apaccakkhaṃ, tesaṃ taṃ paccakkhaṃ katvā dassetuṃ, yepi ",
      " ca mettiyabhūmajakehi katena abhūtena abbhācikkhaṇena there gāravarahitā puthujjanā, tesaṃ there bahumānuppādanatthañca āmantesi. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tatrā"
      },
      "ti vacanasaññāpane nipātamattaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kho"
      },
      "ti avadhāraṇe. Tesu ‘‘tatrā’’ti iminā ‘‘bhagavā bhikkhū āmantesī’’ti etesaṃ padānaṃ vuccamānataṃyeva joteti. ‘‘Kho’’ti pana iminā āmantesiyeva, nāssa āmantane koci antarāyo ahosīti imamatthaṃ dasseti. Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tatrā"
      },
      "ti tasmiṃ ārāme. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kho"
      },
      "ti vacanālaṅkāre nipāto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āmantesī"
      },
      "ti abhāsi. Kasmā pana bhagavā bhikkhūyeva āmantesīti? Jeṭṭhattā seṭṭhattā āsannattā sabbakālaṃ sannihitattā dhammadesanāya visesato bhājanabhūtattā ca."
    ],
    "innerText": "80. Dasame tatra kho bhagavā bhikkhū āmantesīti bhagavā rājagahe yathābhirantaṃ viharitvā janapadacārikaṃ caranto anukkamena sāvatthiṃ patvā jetavane viharantoyeva yesaṃ bhikkhūnaṃ āyasmato dabbassa mallaputtassa parinibbānaṃ apaccakkhaṃ, tesaṃ taṃ paccakkhaṃ katvā dassetuṃ, yepi ca mettiyabhūmajakehi katena abhūtena abbhācikkhaṇena there gāravarahitā puthujjanā, tesaṃ there bahumānuppādanatthañca āmantesi. Tattha tatrāti vacanasaññāpane nipātamattaṃ. Khoti avadhāraṇe. Tesu ‘‘tatrā’’ti iminā ‘‘bhagavā bhikkhū āmantesī’’ti etesaṃ padānaṃ vuccamānataṃyeva joteti. ‘‘Kho’’ti pana iminā āmantesiyeva, nāssa āmantane koci antarāyo ahosīti imamatthaṃ dasseti. Atha vā tatrāti tasmiṃ ārāme. Khoti vacanālaṅkāre nipāto. Āmantesīti abhāsi. Kasmā pana bhagavā bhikkhūyeva āmantesīti? Jeṭṭhattā seṭṭhattā āsannattā sabbakālaṃ sannihitattā dhammadesanāya visesato bhājanabhūtattā ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhikkhavo"
      },
      "ti tesaṃ āmantanākāradassanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhadante"
      },
      "ti āmantitānaṃ bhikkhūnaṃ gāravena satthu paṭivacanadānaṃ. Tattha ‘‘bhikkhavo’’ti vadanto bhagavā te bhikkhū ālapati. ‘‘Bhadante’’ti vadantā te paccālapanti. Apica ‘‘bhikkhavo’’ti iminā karuṇāvipphārasommahadayanissitapubbaṅgamena vacanena te bhikkhū kammaṭṭhānamanasikāradhammapaccavekkhaṇādito nivattetvā attano mukhābhimukhe karoti. ‘‘Bhadante’’ti iminā satthari ādarabahumānagāravadīpanavacanena te bhikkhū attano sussūsataṃ ovādappaṭiggahagāravabhāvañca paṭivedenti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhagavato paccassosu"
      },
      "nti te bhikkhū bhagavato vacanaṃ patiassosuṃ sotukāmataṃ janesuṃ ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etadavocā"
      },
      "ti bhagavā etaṃ idāni vakkhamānaṃ sakalaṃ suttaṃ abhāsi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dabbassa, bhikkhave, mallaputtassā"
      },
      "tiādi ",
      " anantarasutte vuttatthameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etamattha"
      },
      "ntiādīsupi apubbaṃ natthi, anantarasutte vuttanayeneva veditabbaṃ."
    ],
    "innerText": "Bhikkhavoti tesaṃ āmantanākāradassanaṃ. Bhadanteti āmantitānaṃ bhikkhūnaṃ gāravena satthu paṭivacanadānaṃ. Tattha ‘‘bhikkhavo’’ti vadanto bhagavā te bhikkhū ālapati. ‘‘Bhadante’’ti vadantā te paccālapanti. Apica ‘‘bhikkhavo’’ti iminā karuṇāvipphārasommahadayanissitapubbaṅgamena vacanena te bhikkhū kammaṭṭhānamanasikāradhammapaccavekkhaṇādito nivattetvā attano mukhābhimukhe karoti. ‘‘Bhadante’’ti iminā satthari ādarabahumānagāravadīpanavacanena te bhikkhū attano sussūsataṃ ovādappaṭiggahagāravabhāvañca paṭivedenti. Bhagavato paccassosunti te bhikkhū bhagavato vacanaṃ patiassosuṃ sotukāmataṃ janesuṃ . Etadavocāti bhagavā etaṃ idāni vakkhamānaṃ sakalaṃ suttaṃ abhāsi. Dabbassa, bhikkhave, mallaputtassātiādi anantarasutte vuttatthameva. Etamatthantiādīsupi apubbaṃ natthi, anantarasutte vuttanayeneva veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Gāthāsu pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ayoghanahatassā"
      },
      "ti ayo haññati etenāti ayoghanaṃ, kammārānaṃ ayokūṭaṃ ayomuṭṭhi ca. Tena ayoghanena hatassa pahatassa. Keci pana ‘‘ayoghanahatassāti ghanaayopiṇḍaṃ hatassā’’ti atthaṃ vadanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Eva"
      },
      "-saddo cettha nipātamattaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jalato jātavedaso"
      },
      "ti jhāyamānassa aggissa. Anādare etaṃ sāmivacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anupubbūpasantassā"
      },
      "ti anukkamena upasantassa vijjhātassa niruddhassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathā na ñāyate gatī"
      },
      "ti yathā tassa gati na ñāyati. Idaṃ vuttaṃ hoti – ayomuṭṭhikūṭādinā mahatā ayoghanena hatassa saṃhatassa, kaṃsabhājanādigatassa vā jalamānassa aggissa, tathā uppannassa ",
      " vā saddassa anukkamena upasantassa suvūpasantassa dasasu disāsu na katthaci gati paññāyati paccayanirodhena appaṭisandhikaniruddhattā."
    ],
    "innerText": "Gāthāsu pana ayoghanahatassāti ayo haññati etenāti ayoghanaṃ, kammārānaṃ ayokūṭaṃ ayomuṭṭhi ca. Tena ayoghanena hatassa pahatassa. Keci pana ‘‘ayoghanahatassāti ghanaayopiṇḍaṃ hatassā’’ti atthaṃ vadanti. Eva-saddo cettha nipātamattaṃ. Jalato jātavedasoti jhāyamānassa aggissa. Anādare etaṃ sāmivacanaṃ. Anupubbūpasantassāti anukkamena upasantassa vijjhātassa niruddhassa. Yathā na ñāyate gatīti yathā tassa gati na ñāyati. Idaṃ vuttaṃ hoti – ayomuṭṭhikūṭādinā mahatā ayoghanena hatassa saṃhatassa, kaṃsabhājanādigatassa vā jalamānassa aggissa, tathā uppannassa vā saddassa anukkamena upasantassa suvūpasantassa dasasu disāsu na katthaci gati paññāyati paccayanirodhena appaṭisandhikaniruddhattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ sammāvimuttāna"
      },
      "nti evaṃ sammā hetunā ñāyena tadaṅgavikkhambhanavimuttipubbaṅgamena ariyamaggena catūhipi upādānehi āsavehi ca vimuttattā sammā vimuttānaṃ, tato eva kāmapabandhasaṅkhātaṃ kāmoghaṃ bhavoghādibhedaṃ avasiṭṭhaṃ oghañca taritvā ṭhitattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāmabandhoghatārinaṃ"
      },
      " suṭṭhu paṭipassambhitasabbakilesavipphanditattā kilesābhisaṅkhāravātehi ca akampanīyatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "acalaṃ"
      },
      " anupādisesanibbānasaṅkhātaṃ sabbasaṅkhārūpasamaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sukhaṃ pattānaṃ"
      },
      " adhigatānaṃ khīṇāsavānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gati"
      },
      " devamanussādibhedāsu gatīsu ayaṃ nāmāti paññapetabbatāya abhāvattā paññāpetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "natthi"
      },
      " na upalabbhati, yathāvuttajātavedo viya apaññattikabhāvameva hi so gatoti attho."
    ],
    "innerText": "Evaṃ sammāvimuttānanti evaṃ sammā hetunā ñāyena tadaṅgavikkhambhanavimuttipubbaṅgamena ariyamaggena catūhipi upādānehi āsavehi ca vimuttattā sammā vimuttānaṃ, tato eva kāmapabandhasaṅkhātaṃ kāmoghaṃ bhavoghādibhedaṃ avasiṭṭhaṃ oghañca taritvā ṭhitattā kāmabandhoghatārinaṃ suṭṭhu paṭipassambhitasabbakilesavipphanditattā kilesābhisaṅkhāravātehi ca akampanīyatāya acalaṃ anupādisesanibbānasaṅkhātaṃ sabbasaṅkhārūpasamaṃ sukhaṃ pattānaṃ adhigatānaṃ khīṇāsavānaṃ gati devamanussādibhedāsu gatīsu ayaṃ nāmāti paññapetabbatāya abhāvattā paññāpetuṃ natthi na upalabbhati, yathāvuttajātavedo viya apaññattikabhāvameva hi so gatoti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dasamasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Niṭṭhitā ca pāṭaligāmiyavaggavaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Nigamanakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ettāvatā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ca"
      },
      " –"
    ],
    "innerText": "Ettāvatāca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Suvimuttabhavādāno, devadānavamānito;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pacchinnataṇhāsantāno, pītisaṃvegadīpano."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Saddhammadānanirato, upādānakkhayāvaho;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tattha tattha udāne ye, udānesi vināyako."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Te sabbe ekato katvā, āropentehi saṅgahaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Udāna"
      },
      "miti saṅgītaṃ, dhammasaṅgāhakehi yaṃ."
    ],
    "innerText": "Udānamiti saṅgītaṃ, dhammasaṅgāhakehi yaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Tassa atthaṃ pakāsetuṃ, porāṇaṭṭhakathānayaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nissāya yā samāraddhā, atthasaṃvaṇṇanā mayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sā tattha paramatthānaṃ, suttantesu yathārahaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Pakāsanā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paramatthadīpanī"
      },
      " nāma nāmato."
    ],
    "innerText": "Pakāsanā paramatthadīpanī nāma nāmato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sampattā pariniṭṭhānaṃ, anākulavinicchayā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Catuttiṃsappamāṇāya, pāḷiyā bhāṇavārato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Iti taṃ saṅkharontena, yaṃ taṃ adhigataṃ mayā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Puññaṃ tassānubhāvena, lokanāthassa sāsanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Ogāhitvā visuddhāya, sīlādipaṭipattiyā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sabbepi dehino hontu, vimuttirasabhāgino."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Ciraṃ tiṭṭhatu lokasmiṃ, sammāsambuddhasāsanaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tasmiṃ sagāravā niccaṃ, hontu sabbepi pāṇino."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Sammā ",
      " vassatu kālena, devopi jagatīpati;"
    ],
    "innerText": "Sammā vassatu kālena, devopi jagatīpati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Saddhammanirato lokaṃ, dhammeneva pasāsatūti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Badaratitthavihāravāsinā ācariyadhammapālattherena"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Katāudānassa aṭṭhakathā samattā."
  }
]