[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "2. Sikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Sikkhāpadapāṭhamātikā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ ",
      " saraṇagamanehi sāsanotāraṃ dassetvā sāsanaṃ otiṇṇena upāsakena vā pabbajitena vā yesu sikkhāpadesu paṭhamaṃ sikkhitabbaṃ, tāni dassetuṃ nikkhittassa sikkhāpadapāṭhassa idāni vaṇṇanatthaṃ ayaṃ mātikā –"
    ],
    "innerText": "Evaṃ saraṇagamanehi sāsanotāraṃ dassetvā sāsanaṃ otiṇṇena upāsakena vā pabbajitena vā yesu sikkhāpadesu paṭhamaṃ sikkhitabbaṃ, tāni dassetuṃ nikkhittassa sikkhāpadapāṭhassa idāni vaṇṇanatthaṃ ayaṃ mātikā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Yena ",
      " yattha yadā yasmā, vuttānetāni taṃ nayaṃ;"
    ],
    "innerText": "‘‘Yena yattha yadā yasmā, vuttānetāni taṃ nayaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vatvā katvā vavatthānaṃ, sādhāraṇavisesato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Pakatiyā ca yaṃ vajjaṃ, vajjaṃ paṇṇattiyā ca yaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vavatthapetvā taṃ katvā, padānaṃ byañjanatthato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sādhāraṇānaṃ sabbesaṃ, sādhāraṇavibhāvanaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Atha pañcasu pubbesu, visesatthappakāsato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Pāṇātipātapabhuti-hekatānānatādito;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ārammaṇādānabhedā, mahāsāvajjato tathā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Payogaṅgasamuṭṭhānā, vedanāmūlakammato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Viramato ca phalato, viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Yojetabbaṃ ",
      " tato yuttaṃ, pacchimesvapi pañcasu;"
    ],
    "innerText": "‘‘Yojetabbaṃ tato yuttaṃ, pacchimesvapi pañcasu;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Āveṇikañca vattabbaṃ, ñeyyā hīnāditāpi cā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha etāni pāṇātipātāveramaṇītiādīni dasa sikkhāpadāni bhagavatā eva vuttāni, na ",
      " sāvakādīhi. Tāni ca sāvatthiyaṃ vuttāni jetavane anāthapiṇḍikassa ārāme āyasmantaṃ rāhulaṃ pabbājetvā kapilavatthuto sāvatthiṃ anuppattena sāmaṇerānaṃ sikkhāpadavavatthāpanatthaṃ. Vuttaṃ hetaṃ –"
    ],
    "innerText": "Tattha etāni pāṇātipātāveramaṇītiādīni dasa sikkhāpadāni bhagavatā eva vuttāni, na sāvakādīhi. Tāni ca sāvatthiyaṃ vuttāni jetavane anāthapiṇḍikassa ārāme āyasmantaṃ rāhulaṃ pabbājetvā kapilavatthuto sāvatthiṃ anuppattena sāmaṇerānaṃ sikkhāpadavavatthāpanatthaṃ. Vuttaṃ hetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Atha kho bhagavā kapilavatthusmiṃ yathābhirantaṃ viharitvā yena sāvatthi tena cārikaṃ pakkāmi. Anupubbena cārikaṃ caramāno yena sāvatthi tadavasari. Tatra sudaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena …pe… atha kho sāmaṇerānaṃ etadahosi – ‘kati nu kho amhākaṃ sikkhāpadāni, kattha ca amhehi sikkhitabba’’’nti. Bhagavato etamatthaṃ ārocesuṃ – ‘‘anujānāmi, bhikkhave, sāmaṇerānaṃ dasa sikkhāpadāni, tesu ca sāmaṇerehi sikkhituṃ ",
      ", pāṇātipātāveramaṇī…pe… jātarūparajatapaṭiggahaṇā veramaṇī’’ti (mahāva. 105)."
    ],
    "innerText": "‘‘Atha kho bhagavā kapilavatthusmiṃ yathābhirantaṃ viharitvā yena sāvatthi tena cārikaṃ pakkāmi. Anupubbena cārikaṃ caramāno yena sāvatthi tadavasari. Tatra sudaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena …pe… atha kho sāmaṇerānaṃ etadahosi – ‘kati nu kho amhākaṃ sikkhāpadāni, kattha ca amhehi sikkhitabba’’’nti. Bhagavato etamatthaṃ ārocesuṃ – ‘‘anujānāmi, bhikkhave, sāmaṇerānaṃ dasa sikkhāpadāni, tesu ca sāmaṇerehi sikkhituṃ , pāṇātipātāveramaṇī…pe… jātarūparajatapaṭiggahaṇā veramaṇī’’ti (mahāva. 105)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tānetāni ‘‘samādāya sikkhati sikkhāpadesū’’ti (dī. ni. 1.193; ma. ni. 2.24; vibha. 508) suttānusārena saraṇagamanesu ca dassitapāṭhānusārena ‘‘pāṇātipātā veramaṇisikkhāpadaṃ samādiyāmī’’ti evaṃ vācanāmaggaṃ āropitānīti veditabbāni. Evaṃ tāva ‘‘yena yattha yadā yasmā, vuttānetāni taṃ nayaṃ vatvā’’ti so nayo daṭṭhabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Sādhāraṇavisesavavatthānaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettha ca ādito dve catutthapañcamāni upāsakānaṃ sāmaṇerānañca sādhāraṇāni niccasīlavasena. Uposathasīlavasena pana upāsakānaṃ sattamaṭṭhamaṃ cekaṃ aṅgaṃ katvā sabbapacchimavajjāni sabbānipi sāmaṇerehi sādhāraṇāni, pacchimaṃ pana sāmaṇerānameva visesabhūtanti evaṃ sādhāraṇavisesato vavatthānaṃ kātabbaṃ. Purimāni cettha pañca ekantaakusalacittasamuṭṭhānattā pāṇātipātādīnaṃ pakativajjato veramaṇiyā, sesāni ",
      " paṇṇattivajjatoti evaṃ pakatiyā ca yaṃ vajjaṃ, vajjaṃ paṇṇattiyā ca yaṃ, taṃ vavatthapetabbaṃ."
    ],
    "innerText": "Ettha ca ādito dve catutthapañcamāni upāsakānaṃ sāmaṇerānañca sādhāraṇāni niccasīlavasena. Uposathasīlavasena pana upāsakānaṃ sattamaṭṭhamaṃ cekaṃ aṅgaṃ katvā sabbapacchimavajjāni sabbānipi sāmaṇerehi sādhāraṇāni, pacchimaṃ pana sāmaṇerānameva visesabhūtanti evaṃ sādhāraṇavisesato vavatthānaṃ kātabbaṃ. Purimāni cettha pañca ekantaakusalacittasamuṭṭhānattā pāṇātipātādīnaṃ pakativajjato veramaṇiyā, sesāni paṇṇattivajjatoti evaṃ pakatiyā ca yaṃ vajjaṃ, vajjaṃ paṇṇattiyā ca yaṃ, taṃ vavatthapetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Sādhāraṇavibhāvanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yasmā cettha ‘‘veramaṇisikkhāpadaṃ samādiyāmī’’ti etāni sabbasādhāraṇāni padāni, tasmā etesaṃ padānaṃ byañjanato ca atthato ca ayaṃ sādhāraṇavibhāvanā veditabbā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "byañjanato"
      },
      " tāva veraṃ maṇatīti veramaṇī, veraṃ pajahati, vinodeti, byantīkaroti, anabhāvaṃ gametīti attho. Viramati vā etāya karaṇabhūtāya veramhā puggaloti, vikārassa vekāraṃ katvā veramaṇī. Teneva cettha ‘‘veramaṇisikkhāpadaṃ viramaṇisikkhāpada’’nti dvidhā sajjhāyaṃ karonti. Sikkhitabbāti sikkhā, pajjate anenāti padaṃ. Sikkhāya padaṃ sikkhāpadaṃ, sikkhāya adhigamūpāyoti attho. Atha vā mūlaṃ nissayo patiṭṭhāti vuttaṃ hoti. Veramaṇī eva sikkhāpadaṃ veramaṇisikkhāpadaṃ, viramaṇisikkhāpadaṃ vā dutiyena nayena. Sammā ādiyāmi samādiyāmi, avītikkamanādhippāyena akhaṇḍakāritāya acchiddakāritāya asabalakāritāya ca ādiyāmīti vuttaṃ hoti."
    ],
    "innerText": "Tattha byañjanato tāva veraṃ maṇatīti veramaṇī, veraṃ pajahati, vinodeti, byantīkaroti, anabhāvaṃ gametīti attho. Viramati vā etāya karaṇabhūtāya veramhā puggaloti, vikārassa vekāraṃ katvā veramaṇī. Teneva cettha ‘‘veramaṇisikkhāpadaṃ viramaṇisikkhāpada’’nti dvidhā sajjhāyaṃ karonti. Sikkhitabbāti sikkhā, pajjate anenāti padaṃ. Sikkhāya padaṃ sikkhāpadaṃ, sikkhāya adhigamūpāyoti attho. Atha vā mūlaṃ nissayo patiṭṭhāti vuttaṃ hoti. Veramaṇī eva sikkhāpadaṃ veramaṇisikkhāpadaṃ, viramaṇisikkhāpadaṃ vā dutiyena nayena. Sammā ādiyāmi samādiyāmi, avītikkamanādhippāyena akhaṇḍakāritāya acchiddakāritāya asabalakāritāya ca ādiyāmīti vuttaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atthato"
      },
      " pana veramaṇīti kāmāvacarakusalacittasampayuttā virati, sā ",
      " pāṇātipātā viramantassa ‘‘yā tasmiṃ samaye pāṇātipātā ārati virati paṭivirati veramaṇī akiriyā akaraṇaṃ anajjhāpatti velāanatikkamo setughāto’’ti evamādinā (vibha. 704) nayena vibhaṅge vuttā. Kāmañcesā veramaṇī nāma lokuttarāpi atthi, idha pana samādiyāmīti vuttattā samādānavasena pavattārahā, tasmā sā na hotīti kāmāvacarakusalacittasampayuttā viratīti vuttā."
    ],
    "innerText": "Atthato pana veramaṇīti kāmāvacarakusalacittasampayuttā virati, sā pāṇātipātā viramantassa ‘‘yā tasmiṃ samaye pāṇātipātā ārati virati paṭivirati veramaṇī akiriyā akaraṇaṃ anajjhāpatti velāanatikkamo setughāto’’ti evamādinā (vibha. 704) nayena vibhaṅge vuttā. Kāmañcesā veramaṇī nāma lokuttarāpi atthi, idha pana samādiyāmīti vuttattā samādānavasena pavattārahā, tasmā sā na hotīti kāmāvacarakusalacittasampayuttā viratīti vuttā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sikkhā"
      },
      "ti tisso sikkhā adhisīlasikkhā, adhicittasikkhā, adhipaññāsikkhāti. Imasmiṃ panatthe sampattaviratisīlaṃ lokikā vipassanā rūpārūpajhānāni ariyamaggo ca sikkhāti adhippetā. Yathāha –"
    ],
    "innerText": "Sikkhāti tisso sikkhā adhisīlasikkhā, adhicittasikkhā, adhipaññāsikkhāti. Imasmiṃ panatthe sampattaviratisīlaṃ lokikā vipassanā rūpārūpajhānāni ariyamaggo ca sikkhāti adhippetā. Yathāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Katame dhammā sikkhā? Yasmiṃ samaye kāmāvacaraṃ kusalaṃ cittaṃ uppannaṃ hoti, somanassasahagataṃ ñāṇasampayuttaṃ…pe… tasmiṃ samaye ",
      " phasso hoti…pe… avikkhepo hoti, ime dhammā sikkhā."
    ],
    "innerText": "‘‘Katame dhammā sikkhā? Yasmiṃ samaye kāmāvacaraṃ kusalaṃ cittaṃ uppannaṃ hoti, somanassasahagataṃ ñāṇasampayuttaṃ…pe… tasmiṃ samaye phasso hoti…pe… avikkhepo hoti, ime dhammā sikkhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Katame dhammā sikkhā? Yasmiṃ samaye rūpūpapattiyā maggaṃ bhāveti vivicceva kāmehi vivicca akusalehi dhammehi…pe… paṭhamaṃ jhānaṃ…pe… pañcamaṃ jhānaṃ upasampajja viharati…pe… avikkhepo hoti, ime dhammā sikkhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Katame dhammā sikkhā? Yasmiṃ samaye arūpapattiyā…pe… nevasaññānāsaññāyatanasahagataṃ…pe… avikkhepo hoti, ime dhammā sikkhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Katame ",
      " dhammā sikkhā? Yasmiṃ samaye lokuttaraṃ jhānaṃ bhāveti niyyānikaṃ…pe… avikkhepo hoti, ime dhammā sikkhā’’ti (vibha. 712-713)."
    ],
    "innerText": "‘‘Katame dhammā sikkhā? Yasmiṃ samaye lokuttaraṃ jhānaṃ bhāveti niyyānikaṃ…pe… avikkhepo hoti, ime dhammā sikkhā’’ti (vibha. 712-713)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Etāsu sikkhāsu yāya kāyaci sikkhāya padaṃ adhigamūpāyo, atha vā mūlaṃ nissayo patiṭṭhāti sikkhāpadaṃ. Vuttañhetaṃ – ‘‘sīlaṃ nissāya sīle patiṭṭhāya satta bojjhaṅge bhāvento bahulīkaronto’’ti evamādi (saṃ. ni. 5.182). Evamettha sādhāraṇānaṃ padānaṃ sādhāraṇā byañjanato atthato ca vibhāvanā kātabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Purimapañcasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni yaṃ vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘atha pañcasu pubbesu, visesatthappakāsato…pe… viññātabbo vinicchayo’’"
      },
      "ti ",
      ", tatthetaṃ vuccati – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pāṇātipāto"
      },
      "ti ettha tāva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pāṇo"
      },
      "ti jīvitindriyappaṭibaddhā khandhasantati, taṃ vā upādāya paññatto satto. Tasmiṃ pana pāṇe pāṇasaññino tassa pāṇassa jīvitindriyupacchedakaupakkamasamuṭṭhāpikā kāyavacīdvārānaṃ aññataradvārappavattā vadhakacetanā pāṇātipāto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adinnādāna"
      },
      "nti ettha adinnanti parapariggahitaṃ, yattha paro yathākāmakāritaṃ āpajjanto adaṇḍāraho anupavajjo ca hoti, tasmiṃ parapariggahite parapariggahitasaññino tadādāyakaupakkamasamuṭṭhāpikā kāyavacīdvārānaṃ aññataradvārappavattā eva theyyacetanā adinnādānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abrahmacariya"
      },
      "nti aseṭṭhacariyaṃ, dvayaṃdvayasamāpattimethunappaṭisevanā kāyadvārappavattā asaddhammappaṭisevanaṭṭhānavītikkamacetanā abrahmacariyaṃ ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Musāvādo"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "musā"
      },
      "ti visaṃvādanapurekkhārassa atthabhañjanako vacīpayogo kāyapayogo vā, visaṃvādanādhippāyena panassa paravisaṃvādakakāyavacīpayogasamuṭṭhāpikā kāyavacīdvārānameva aññataradvārappavattā micchācetanā musāvādo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Surāmerayamajjapamādaṭṭhāna"
      },
      "nti ettha pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "surā"
      },
      "ti pañca surā – piṭṭhasurā, pūvasurā, odanasurā, kiṇṇapakkhittā, sambhārasaṃyuttā cāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Meraya"
      },
      "mpi pupphāsavo, phalāsavo, guḷāsavo, madhvāsavo, sambhārasaṃyutto cāti pañcavidhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Majja"
      },
      "nti tadubhayameva madaniyaṭṭhena majjaṃ, yaṃ vā panaññampi kiñci atthi madaniyaṃ, yena pītena matto hoti pamatto, idaṃ vuccati majjaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pamādaṭṭhāna"
      },
      "nti yāya cetanāya taṃ pivati ajjhoharati, sā cetanā madappamādahetuto pamādaṭṭhānanti vuccati, yato ajjhoharaṇādhippāyena kāyadvārappavattā surāmerayamajjānaṃ ajjhoharaṇacetanā ‘‘surāmerayamajjapamādaṭṭhāna’’nti ",
      " veditabbā. Evaṃ tāvettha pāṇātipātappabhutīhi viññātabbo vinicchayo."
    ],
    "innerText": "Idāni yaṃ vuttaṃ – ‘‘atha pañcasu pubbesu, visesatthappakāsato…pe… viññātabbo vinicchayo’’ti , tatthetaṃ vuccati – pāṇātipātoti ettha tāva pāṇoti jīvitindriyappaṭibaddhā khandhasantati, taṃ vā upādāya paññatto satto. Tasmiṃ pana pāṇe pāṇasaññino tassa pāṇassa jīvitindriyupacchedakaupakkamasamuṭṭhāpikā kāyavacīdvārānaṃ aññataradvārappavattā vadhakacetanā pāṇātipāto. Adinnādānanti ettha adinnanti parapariggahitaṃ, yattha paro yathākāmakāritaṃ āpajjanto adaṇḍāraho anupavajjo ca hoti, tasmiṃ parapariggahite parapariggahitasaññino tadādāyakaupakkamasamuṭṭhāpikā kāyavacīdvārānaṃ aññataradvārappavattā eva theyyacetanā adinnādānaṃ. Abrahmacariyanti aseṭṭhacariyaṃ, dvayaṃdvayasamāpattimethunappaṭisevanā kāyadvārappavattā asaddhammappaṭisevanaṭṭhānavītikkamacetanā abrahmacariyaṃ . Musāvādoti ettha musāti visaṃvādanapurekkhārassa atthabhañjanako vacīpayogo kāyapayogo vā, visaṃvādanādhippāyena panassa paravisaṃvādakakāyavacīpayogasamuṭṭhāpikā kāyavacīdvārānameva aññataradvārappavattā micchācetanā musāvādo. Surāmerayamajjapamādaṭṭhānanti ettha pana surāti pañca surā – piṭṭhasurā, pūvasurā, odanasurā, kiṇṇapakkhittā, sambhārasaṃyuttā cāti. Merayampi pupphāsavo, phalāsavo, guḷāsavo, madhvāsavo, sambhārasaṃyutto cāti pañcavidhaṃ. Majjanti tadubhayameva madaniyaṭṭhena majjaṃ, yaṃ vā panaññampi kiñci atthi madaniyaṃ, yena pītena matto hoti pamatto, idaṃ vuccati majjaṃ. Pamādaṭṭhānanti yāya cetanāya taṃ pivati ajjhoharati, sā cetanā madappamādahetuto pamādaṭṭhānanti vuccati, yato ajjhoharaṇādhippāyena kāyadvārappavattā surāmerayamajjānaṃ ajjhoharaṇacetanā ‘‘surāmerayamajjapamādaṭṭhāna’’nti veditabbā. Evaṃ tāvettha pāṇātipātappabhutīhi viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Ekatānānatādivinicchayaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekatānānatādito"
      },
      "ti ",
      " ettha āha – kiṃ pana vajjhavadhakappayogacetanādīnaṃ ekatāya pāṇātipātassa aññassa vā adinnādānādino ekattaṃ, nānatāya nānattaṃ hoti, udāhu noti. Kasmā panetaṃ vuccati? Yadi tāva ekatāya ekattaṃ, atha yadā ekaṃ vajjhaṃ bahū vadhakā vadhenti, eko vā vadhako bahuke vajjhe vadheti, ekena vā sāhatthikādinā payogena bahū vajjhā vadhīyanti, ekā vā cetanā bahūnaṃ vajjhānaṃ jīvitindriyupacchedakapayogaṃ samuṭṭhāpeti, tadā ekena pāṇātipātena bhavitabbaṃ. Yadi pana nānatāya nānattaṃ. Atha yadā eko vadhako ekassatthāya ekaṃ payogaṃ karonto bahū vajjhe vadheti, bahū vā vadhakā devadattayaññadattasomadattādīnaṃ bahūnamatthāya bahū payoge karontā ekameva devadattaṃ yaññadattaṃ somadattaṃ vā vadhenti, bahūhi vā sāhatthikādīhi payogehi eko vajjho vadhīyati. Bahū vā cetanā ekasseva vajjhassa jīvitindriyupacchedakapayogaṃ samuṭṭhāpenti, tadā bahūhi pāṇātipātehi bhavitabbaṃ. Ubhayampi cetamayuttaṃ. Atha neva etesaṃ vajjhādīnaṃ ekatāya ekattaṃ, nānatāya nānattaṃ, aññatheva tu ekattaṃ nānattañca hoti, taṃ vattabbaṃ pāṇātipātassa, evaṃ sesānampīti."
    ],
    "innerText": "Ekatānānatāditoti ettha āha – kiṃ pana vajjhavadhakappayogacetanādīnaṃ ekatāya pāṇātipātassa aññassa vā adinnādānādino ekattaṃ, nānatāya nānattaṃ hoti, udāhu noti. Kasmā panetaṃ vuccati? Yadi tāva ekatāya ekattaṃ, atha yadā ekaṃ vajjhaṃ bahū vadhakā vadhenti, eko vā vadhako bahuke vajjhe vadheti, ekena vā sāhatthikādinā payogena bahū vajjhā vadhīyanti, ekā vā cetanā bahūnaṃ vajjhānaṃ jīvitindriyupacchedakapayogaṃ samuṭṭhāpeti, tadā ekena pāṇātipātena bhavitabbaṃ. Yadi pana nānatāya nānattaṃ. Atha yadā eko vadhako ekassatthāya ekaṃ payogaṃ karonto bahū vajjhe vadheti, bahū vā vadhakā devadattayaññadattasomadattādīnaṃ bahūnamatthāya bahū payoge karontā ekameva devadattaṃ yaññadattaṃ somadattaṃ vā vadhenti, bahūhi vā sāhatthikādīhi payogehi eko vajjho vadhīyati. Bahū vā cetanā ekasseva vajjhassa jīvitindriyupacchedakapayogaṃ samuṭṭhāpenti, tadā bahūhi pāṇātipātehi bhavitabbaṃ. Ubhayampi cetamayuttaṃ. Atha neva etesaṃ vajjhādīnaṃ ekatāya ekattaṃ, nānatāya nānattaṃ, aññatheva tu ekattaṃ nānattañca hoti, taṃ vattabbaṃ pāṇātipātassa, evaṃ sesānampīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vuccate ",
      " – tattha tāva pāṇātipātassa na vajjhavadhakādīnaṃ paccekamekatāya ekatā, nānatāya nānatā, kintu vajjhavadhakādīnaṃ yuganandhamekatāya ekatā, dvinnampi tu tesaṃ, tato aññatarassa vā nānatāya nānatā. Tathā hi bahūsu vadhakesu bahūhi sarakkhepādīhi ekena vā opātakhaṇanādinā payogena bahū vajjhe vadhentesupi bahū pāṇātipātā honti. Ekasmiṃ vadhake ekena, bahūhi vā payogehi tappayogasamuṭṭhāpikāya ca ekāya, bahūhi vā cetanāhi bahū vajjhe vadhentepi bahū pāṇātipātā honti, bahūsu ca vadhakesu yathāvuttappakārehi bahūhi, ekena vā payogena ekaṃ vajjhaṃ vadhentesupi bahū pāṇātipātā honti. Esa nayo adinnādānādīsupīti. Evamettha ekatānānatāditopi viññātabbo vinicchayo."
    ],
    "innerText": "Vuccate – tattha tāva pāṇātipātassa na vajjhavadhakādīnaṃ paccekamekatāya ekatā, nānatāya nānatā, kintu vajjhavadhakādīnaṃ yuganandhamekatāya ekatā, dvinnampi tu tesaṃ, tato aññatarassa vā nānatāya nānatā. Tathā hi bahūsu vadhakesu bahūhi sarakkhepādīhi ekena vā opātakhaṇanādinā payogena bahū vajjhe vadhentesupi bahū pāṇātipātā honti. Ekasmiṃ vadhake ekena, bahūhi vā payogehi tappayogasamuṭṭhāpikāya ca ekāya, bahūhi vā cetanāhi bahū vajjhe vadhentepi bahū pāṇātipātā honti, bahūsu ca vadhakesu yathāvuttappakārehi bahūhi, ekena vā payogena ekaṃ vajjhaṃ vadhentesupi bahū pāṇātipātā honti. Esa nayo adinnādānādīsupīti. Evamettha ekatānānatāditopi viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ārammaṇato"
      },
      "ti ",
      " pāṇātipāto cettha jīvitindriyārammaṇo. Adinnādānaabrahmacariyasurāmerayamajjapamādaṭṭhānāni rūpadhammesu rūpāyatanādiaññatarasaṅkhārārammaṇāni. Musāvādo yassa musā bhaṇati, tamārabhitvā pavattanato sattārammaṇo. Abrahmacariyampi sattārammaṇanti eke. Adinnādānañca yadā satto haritabbo hoti, tadā sattārammaṇanti. Api cettha saṅkhāravaseneva sattārammaṇaṃ, na paṇṇattivasenāti. Evamettha ārammaṇatopi viññātabbo vinicchayo."
    ],
    "innerText": "Ārammaṇatoti pāṇātipāto cettha jīvitindriyārammaṇo. Adinnādānaabrahmacariyasurāmerayamajjapamādaṭṭhānāni rūpadhammesu rūpāyatanādiaññatarasaṅkhārārammaṇāni. Musāvādo yassa musā bhaṇati, tamārabhitvā pavattanato sattārammaṇo. Abrahmacariyampi sattārammaṇanti eke. Adinnādānañca yadā satto haritabbo hoti, tadā sattārammaṇanti. Api cettha saṅkhāravaseneva sattārammaṇaṃ, na paṇṇattivasenāti. Evamettha ārammaṇatopi viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ādānato"
      },
      "ti ",
      " pāṇātipātāveramaṇisikkhāpadādīni cetāni sāmaṇerena bhikkhusantike samādinnāneva samādinnāni honti, upāsakena pana attanā samādiyantenāpi samādinnāni honti, parassa santike samādiyantenāpi. Ekajjhaṃ samādinnānipi samādinnāni honti, paccekaṃ samādinnānipi. Kintu nānaṃ ekajjhaṃ samādiyato ekāyeva virati, ekāva cetanā hoti, kiccavasena panetāsaṃ pañcavidhattaṃ viññāyati. Paccekaṃ samādiyato pana pañceva viratiyo, pañca ca cetanā hontīti veditabbā. Evamettha ādānatopi viññātabbo vinicchayo."
    ],
    "innerText": "Ādānatoti pāṇātipātāveramaṇisikkhāpadādīni cetāni sāmaṇerena bhikkhusantike samādinnāneva samādinnāni honti, upāsakena pana attanā samādiyantenāpi samādinnāni honti, parassa santike samādiyantenāpi. Ekajjhaṃ samādinnānipi samādinnāni honti, paccekaṃ samādinnānipi. Kintu nānaṃ ekajjhaṃ samādiyato ekāyeva virati, ekāva cetanā hoti, kiccavasena panetāsaṃ pañcavidhattaṃ viññāyati. Paccekaṃ samādiyato pana pañceva viratiyo, pañca ca cetanā hontīti veditabbā. Evamettha ādānatopi viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhedato"
      },
      "ti sāmaṇerānañcettha ekasmiṃ bhinne sabbānipi bhinnāni honti. Pārājikaṭṭhāniyāni hi tāni tesaṃ, yaṃ taṃ vītikkantaṃ hoti, teneva kammabaddho. Gahaṭṭhānaṃ pana ekasmiṃ bhinne ekameva bhinnaṃ hoti, yato ",
      " tesaṃ taṃsamādāneneva puna pañcaṅgikattaṃ sīlassa sampajjati. Apare panāhu – ‘‘visuṃ visuṃ samādinnesu ekasmiṃ bhinne ekameva bhinnaṃ hoti, ‘pañcaṅgasamannāgataṃ sīlaṃ samādiyāmī’ti evaṃ pana ekato samādinnesu ekasmiṃ bhinne sesānipi sabbāni bhinnāni honti. Kasmā? Samādinnassa abhinnattā, yaṃ taṃ vītikkantaṃ, teneva kammabaddho’’ti. Evamettha bhedatopi viññātabbo vinicchayo."
    ],
    "innerText": "Bhedatoti sāmaṇerānañcettha ekasmiṃ bhinne sabbānipi bhinnāni honti. Pārājikaṭṭhāniyāni hi tāni tesaṃ, yaṃ taṃ vītikkantaṃ hoti, teneva kammabaddho. Gahaṭṭhānaṃ pana ekasmiṃ bhinne ekameva bhinnaṃ hoti, yato tesaṃ taṃsamādāneneva puna pañcaṅgikattaṃ sīlassa sampajjati. Apare panāhu – ‘‘visuṃ visuṃ samādinnesu ekasmiṃ bhinne ekameva bhinnaṃ hoti, ‘pañcaṅgasamannāgataṃ sīlaṃ samādiyāmī’ti evaṃ pana ekato samādinnesu ekasmiṃ bhinne sesānipi sabbāni bhinnāni honti. Kasmā? Samādinnassa abhinnattā, yaṃ taṃ vītikkantaṃ, teneva kammabaddho’’ti. Evamettha bhedatopi viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahāsāvajjato"
      },
      "ti guṇavirahitesu tiracchānagatādīsu pāṇesu khuddake pāṇe pāṇātipāto appasāvajjo, mahāsarīre mahāsāvajjo. Kasmā? Payogamahantatāya. Payogasamattepi vatthumahantatāya. Guṇavantesu pana manussādīsu appaguṇe pāṇātipāto appasāvajjo, mahāguṇe mahāsāvajjo ",
      ". Sarīraguṇānantu samabhāve sati kilesānaṃ upakkamānañca mudutāya appasāvajjatā, tibbatāya mahāsāvajjatā ca veditabbā. Esa nayo sesesupi. Api cettha surāmerayamajjapamādaṭṭhānameva mahāsāvajjaṃ, na tathā pāṇātipātādayo. Kasmā? Manussabhūtassāpi ummattakabhāvasaṃvattanena ariyadhammantarāyakaraṇatoti. Evamettha mahāsāvajjatopi viññātabbo vinicchayo."
    ],
    "innerText": "Mahāsāvajjatoti guṇavirahitesu tiracchānagatādīsu pāṇesu khuddake pāṇe pāṇātipāto appasāvajjo, mahāsarīre mahāsāvajjo. Kasmā? Payogamahantatāya. Payogasamattepi vatthumahantatāya. Guṇavantesu pana manussādīsu appaguṇe pāṇātipāto appasāvajjo, mahāguṇe mahāsāvajjo . Sarīraguṇānantu samabhāve sati kilesānaṃ upakkamānañca mudutāya appasāvajjatā, tibbatāya mahāsāvajjatā ca veditabbā. Esa nayo sesesupi. Api cettha surāmerayamajjapamādaṭṭhānameva mahāsāvajjaṃ, na tathā pāṇātipātādayo. Kasmā? Manussabhūtassāpi ummattakabhāvasaṃvattanena ariyadhammantarāyakaraṇatoti. Evamettha mahāsāvajjatopi viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Payogato"
      },
      "ti ettha ca pāṇātipātassa sāhatthiko, āṇattiko, nissaggiyo, thāvaro, vijjāmayo, iddhimayoti chappayogā. Tattha kāyena vā kāyappaṭibaddhena vā paharaṇaṃ sāhatthiko payogo, so uddissānuddissabhedato duvidho hoti. Tattha uddissake yaṃ uddissa paharati, tasseva maraṇena kammunā bajjhati. ‘‘Yo koci maratū’’ti evaṃ anuddissake pahārapaccayā yassa kassaci maraṇena. Ubhayathāpi ca paharitamatte vā maratu, pacchā vā teneva ",
      " rogena, paharitakkhaṇe eva kammunā bajjhati. Maraṇādhippāyena ca pahāraṃ datvā tena amatassa puna aññena cittena pahāre dinne pacchāpi yadi paṭhamapahāreneva marati, tadā eva kammunā baddho hoti. Atha dutiyapahārena, natthi pāṇātipāto. Ubhayehi matepi paṭhamapahāreneva kammunā baddho, ubhayehipi amate nevatthi pāṇātipāto. Esa nayo bahukehipi ",
      " ekassa pahāre dinne. Tatrāpi hi yassa pahārena marati, tasseva kammabaddho hoti."
    ],
    "innerText": "Payogatoti ettha ca pāṇātipātassa sāhatthiko, āṇattiko, nissaggiyo, thāvaro, vijjāmayo, iddhimayoti chappayogā. Tattha kāyena vā kāyappaṭibaddhena vā paharaṇaṃ sāhatthiko payogo, so uddissānuddissabhedato duvidho hoti. Tattha uddissake yaṃ uddissa paharati, tasseva maraṇena kammunā bajjhati. ‘‘Yo koci maratū’’ti evaṃ anuddissake pahārapaccayā yassa kassaci maraṇena. Ubhayathāpi ca paharitamatte vā maratu, pacchā vā teneva rogena, paharitakkhaṇe eva kammunā bajjhati. Maraṇādhippāyena ca pahāraṃ datvā tena amatassa puna aññena cittena pahāre dinne pacchāpi yadi paṭhamapahāreneva marati, tadā eva kammunā baddho hoti. Atha dutiyapahārena, natthi pāṇātipāto. Ubhayehi matepi paṭhamapahāreneva kammunā baddho, ubhayehipi amate nevatthi pāṇātipāto. Esa nayo bahukehipi ekassa pahāre dinne. Tatrāpi hi yassa pahārena marati, tasseva kammabaddho hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Adhiṭṭhahitvā pana āṇāpanaṃ āṇattiko payogo. Tatthapi sāhatthike payoge vuttanayeneva kammabaddho anussaritabbo. Chabbidho cettha niyamo veditabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Vatthu kālo ca okāso, āvudhaṃ iriyāpatho;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kiriyāvisesoti ime, cha āṇattiniyāmakā’’ti. (pāci. aṭṭha. 2.174);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vatthū"
      },
      "ti māretabbo pāṇo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kālo"
      },
      "ti pubbaṇhasāyanhādikālo ca, yobbanathāvariyādikālo ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Okāso"
      },
      "ti gāmo vā nigamo vā vanaṃ vā racchā vā siṅghāṭakaṃ vāti evamādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āvudha"
      },
      "nti asi vā usu vā satti vāti evamādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iriyāpatho"
      },
      "ti māretabbassa mārakassa ca ṭhānaṃ vā nisajjā vāti evamādi."
    ],
    "innerText": "Tattha vatthūti māretabbo pāṇo. Kāloti pubbaṇhasāyanhādikālo ca, yobbanathāvariyādikālo ca. Okāsoti gāmo vā nigamo vā vanaṃ vā racchā vā siṅghāṭakaṃ vāti evamādi. Āvudhanti asi vā usu vā satti vāti evamādi. Iriyāpathoti māretabbassa mārakassa ca ṭhānaṃ vā nisajjā vāti evamādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kiriyāviseso"
      },
      "ti vijjhanaṃ vā chedanaṃ vā bhedanaṃ vā saṅkhamuṇḍikaṃ vāti evamādi. Yadi hi vatthuṃ visaṃvādetvā ‘‘yaṃ mārehī’’ti āṇatto, tato aññaṃ māreti, āṇāpakassa natthi kammabaddho. Atha vatthuṃ avisaṃvādetvā māreti, āṇāpakassa āṇattikkhaṇe āṇattassa māraṇakkhaṇeti ubhayesampi kammabaddho. Esa nayo kālādīsupi."
    ],
    "innerText": "Kiriyāvisesoti vijjhanaṃ vā chedanaṃ vā bhedanaṃ vā saṅkhamuṇḍikaṃ vāti evamādi. Yadi hi vatthuṃ visaṃvādetvā ‘‘yaṃ mārehī’’ti āṇatto, tato aññaṃ māreti, āṇāpakassa natthi kammabaddho. Atha vatthuṃ avisaṃvādetvā māreti, āṇāpakassa āṇattikkhaṇe āṇattassa māraṇakkhaṇeti ubhayesampi kammabaddho. Esa nayo kālādīsupi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Māraṇatthantu kāyena vā kāyappaṭibaddhena vā paharaṇanissajjanaṃ nissaggiyo payogo. Sopi uddissānuddissabhedato duvidho eva, kammabaddho cettha pubbe vuttanayeneva veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Māraṇatthameva opātakhaṇanaṃ, apassenaupanikkhipanaṃ, bhesajjavisayantādippayojanaṃ vā thāvaro payogo. Sopi uddissānuddissabhedato duvidho, yato tatthapi pubbe vuttanayeneva kammabaddho veditabbo. Ayantu viseso – mūlaṭṭhena opātādīsu paresaṃ mūlena vā mudhā vā dinnesupi yadi tappaccayā koci marati, mūlaṭṭhasseva kammabaddho. Yadipi ca tena aññena vā ",
      " tattha opāte vināsetvā bhūmisame katepi paṃsudhovakā vā paṃsuṃ gaṇhantā, mūlakhaṇakā vā mūlāni khaṇantā āvāṭaṃ karonti ",
      ", deve vā vassante kaddamo jāyati, tattha ca koci otaritvā vā laggitvā vā marati, mūlaṭṭhasseva kammabaddho. Yadi pana yena laddhaṃ, so añño vā taṃ vitthaṭataraṃ gambhīrataraṃ vā karoti, tappaccayāva koci marati, ubhayesampi kammabaddho. Yathā tu mūlāni mūlehi saṃsandanti, tathā tatra thale kate muccati. Evaṃ apassenādīsupi yāva tesaṃ pavatti, tāva yathāsambhavaṃ kammabaddho veditabbo."
    ],
    "innerText": "Māraṇatthameva opātakhaṇanaṃ, apassenaupanikkhipanaṃ, bhesajjavisayantādippayojanaṃ vā thāvaro payogo. Sopi uddissānuddissabhedato duvidho, yato tatthapi pubbe vuttanayeneva kammabaddho veditabbo. Ayantu viseso – mūlaṭṭhena opātādīsu paresaṃ mūlena vā mudhā vā dinnesupi yadi tappaccayā koci marati, mūlaṭṭhasseva kammabaddho. Yadipi ca tena aññena vā tattha opāte vināsetvā bhūmisame katepi paṃsudhovakā vā paṃsuṃ gaṇhantā, mūlakhaṇakā vā mūlāni khaṇantā āvāṭaṃ karonti , deve vā vassante kaddamo jāyati, tattha ca koci otaritvā vā laggitvā vā marati, mūlaṭṭhasseva kammabaddho. Yadi pana yena laddhaṃ, so añño vā taṃ vitthaṭataraṃ gambhīrataraṃ vā karoti, tappaccayāva koci marati, ubhayesampi kammabaddho. Yathā tu mūlāni mūlehi saṃsandanti, tathā tatra thale kate muccati. Evaṃ apassenādīsupi yāva tesaṃ pavatti, tāva yathāsambhavaṃ kammabaddho veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Māraṇatthaṃ pana vijjāparijappanaṃ vijjāmayo payogo. Dāṭhāvudhādīnaṃ dāṭhākoṭanādimiva māraṇatthaṃ kammavipākajiddhivikārakaraṇaṃ iddhimayo payogoti. Adinnādānassa tu theyyapasayhapaṭicchannaparikappakusāvahāravasappavattā ",
      " sāhatthikāṇattikādayo payogā, tesampi vuttānusāreneva pabhedo veditabbo. Abrahmacariyādīnaṃ tiṇṇampi sāhatthiko eva payogo labbhatīti. Evamettha payogatopi viññātabbo vinicchayo."
    ],
    "innerText": "Māraṇatthaṃ pana vijjāparijappanaṃ vijjāmayo payogo. Dāṭhāvudhādīnaṃ dāṭhākoṭanādimiva māraṇatthaṃ kammavipākajiddhivikārakaraṇaṃ iddhimayo payogoti. Adinnādānassa tu theyyapasayhapaṭicchannaparikappakusāvahāravasappavattā sāhatthikāṇattikādayo payogā, tesampi vuttānusāreneva pabhedo veditabbo. Abrahmacariyādīnaṃ tiṇṇampi sāhatthiko eva payogo labbhatīti. Evamettha payogatopi viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṅgato"
      },
      "ti ettha ca pāṇātipātassa pañca aṅgāni bhavanti – pāṇo ca hoti, pāṇasaññī ca, vadhakacittañca paccupaṭṭhitaṃ hoti, vāyamati, tena ca maratīti. Adinnādānassāpi pañceva – parapariggahitañca hoti, parapariggahitasaññī ca, theyyacittañca paccupaṭṭhitaṃ hoti, vāyamati, tena ca ādātabbaṃ ādānaṃ gacchatīti. Abrahmacariyassa pana cattāri aṅgāni bhavanti – ajjhācariyavatthu ca hoti, tattha ca sevanacittaṃ paccupaṭṭhitaṃ hoti, sevanapaccayā payogañca samāpajjati, sādiyati cāti, tathā paresaṃ dvinnampi. Tattha musāvādassa tāva musā ca hoti taṃ vatthu, visaṃvādanacittañca paccupaṭṭhitaṃ hoti, tajjo ca vāyāmo, paravisaṃvādanañca viññāpayamānā viññatti pavattatīti cattāri aṅgāni veditabbāni. Surāmerayamajjapamādaṭṭhānassa pana surādīnañca aññataraṃ hoti madanīyapātukamyatācittañca paccupaṭṭhitaṃ hoti, tajjañca vāyāmaṃ āpajjati, pīte ca pavisatīti imāni cattāri aṅgānīti. Evamettha aṅgatopi viññātabbo vinicchayo."
    ],
    "innerText": "Aṅgatoti ettha ca pāṇātipātassa pañca aṅgāni bhavanti – pāṇo ca hoti, pāṇasaññī ca, vadhakacittañca paccupaṭṭhitaṃ hoti, vāyamati, tena ca maratīti. Adinnādānassāpi pañceva – parapariggahitañca hoti, parapariggahitasaññī ca, theyyacittañca paccupaṭṭhitaṃ hoti, vāyamati, tena ca ādātabbaṃ ādānaṃ gacchatīti. Abrahmacariyassa pana cattāri aṅgāni bhavanti – ajjhācariyavatthu ca hoti, tattha ca sevanacittaṃ paccupaṭṭhitaṃ hoti, sevanapaccayā payogañca samāpajjati, sādiyati cāti, tathā paresaṃ dvinnampi. Tattha musāvādassa tāva musā ca hoti taṃ vatthu, visaṃvādanacittañca paccupaṭṭhitaṃ hoti, tajjo ca vāyāmo, paravisaṃvādanañca viññāpayamānā viññatti pavattatīti cattāri aṅgāni veditabbāni. Surāmerayamajjapamādaṭṭhānassa pana surādīnañca aññataraṃ hoti madanīyapātukamyatācittañca paccupaṭṭhitaṃ hoti, tajjañca vāyāmaṃ āpajjati, pīte ca pavisatīti imāni cattāri aṅgānīti. Evamettha aṅgatopi viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samuṭṭhānato"
      },
      "ti pāṇātipātaadinnādānamusāvādā cettha kāyacittato, vācācittato, kāyavācācittato cāti tisamuṭṭhānā honti. Abrahmacariyaṃ kāyacittavasena ekasamuṭṭhānameva. Surāmerayamajjapamādaṭṭhānaṃ kāyato ca, kāyacittato cāti dvisamuṭṭhānanti. Evamettha samuṭṭhānatopi viññātabbo vinicchayo."
    ],
    "innerText": "Samuṭṭhānatoti pāṇātipātaadinnādānamusāvādā cettha kāyacittato, vācācittato, kāyavācācittato cāti tisamuṭṭhānā honti. Abrahmacariyaṃ kāyacittavasena ekasamuṭṭhānameva. Surāmerayamajjapamādaṭṭhānaṃ kāyato ca, kāyacittato cāti dvisamuṭṭhānanti. Evamettha samuṭṭhānatopi viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vedanāto"
      },
      "ti ",
      " ettha ca pāṇātipāto dukkhavedanāsampayuttova. Adinnādānaṃ tīsu vedanāsu aññataravedanāsampayuttaṃ, tathā musāvādo. Itarāni dve sukhāya vā adukkhamasukhāya vā vedanāya sampayuttānīti. Evamettha vedanātopi viññātabbo vinicchayo."
    ],
    "innerText": "Vedanātoti ettha ca pāṇātipāto dukkhavedanāsampayuttova. Adinnādānaṃ tīsu vedanāsu aññataravedanāsampayuttaṃ, tathā musāvādo. Itarāni dve sukhāya vā adukkhamasukhāya vā vedanāya sampayuttānīti. Evamettha vedanātopi viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mūlato"
      },
      "ti pāṇātipāto cettha dosamohamūlo. Adinnādānamusāvādā ",
      " lobhamohamūlā vā dosamohamūlā vā. Itarāni dve lobhamohamūlānīti. Evamettha mūlatopi viññātabbo vinicchayo."
    ],
    "innerText": "Mūlatoti pāṇātipāto cettha dosamohamūlo. Adinnādānamusāvādā lobhamohamūlā vā dosamohamūlā vā. Itarāni dve lobhamohamūlānīti. Evamettha mūlatopi viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammato"
      },
      "ti pāṇātipātaadinnādānaabrahmacariyāni cettha kāyakammameva kammapathappattāneva ca, musāvādo vacīkammameva. Yo pana atthabhañjako, so kammapathappatto. Itaro kammameva. Surāmerayamajjapamādaṭṭhānaṃ kāyakammamevāti. Evamettha kammatopi viññātabbo vinicchayo."
    ],
    "innerText": "Kammatoti pāṇātipātaadinnādānaabrahmacariyāni cettha kāyakammameva kammapathappattāneva ca, musāvādo vacīkammameva. Yo pana atthabhañjako, so kammapathappatto. Itaro kammameva. Surāmerayamajjapamādaṭṭhānaṃ kāyakammamevāti. Evamettha kammatopi viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Viramato"
      },
      "ti ettha āha ‘‘pāṇātipātādīhi viramanto kuto viramatī’’ti? Vuccate – samādānavasena tāva viramanto attano vā paresaṃ vā pāṇātipātādiakusalato viramati. Kimārabhitvā? Yato viramati, tadeva. Sampattavasenāpi viramanto vuttappakārākusalatova. Kimārabhitvā? Pāṇātipātādīnaṃ vuttārammaṇāneva. Keci pana bhaṇanti ‘‘surāmerayamajjasaṅkhāte saṅkhāre ārabhitvā surāmerayamajjapamādaṭṭhānā viramati, sattasaṅkhāresu yaṃ pana avaharitabbaṃ bhañjitabbañca, taṃ ārabhitvā adinnādānā musāvādā ca, satteyevārabhitvā pāṇātipātā abrahmacariyā cā’’ti. Tadaññe ‘‘evaṃ sante ‘aññaṃ cintento aññaṃ kareyya, yañca pajahati, taṃ na jāneyyā’ti evaṃdiṭṭhikā hutvā anicchamānā yadeva pajahati, taṃ attano pāṇātipātādiakusalamevārabhitvā viramatī’’ti vadanti. Tadayuttaṃ. Kasmā? Tassa paccuppannābhāvato bahiddhābhāvato ca. Sikkhāpadānañhi vibhaṅgapāṭhe ‘‘pañcannaṃ sikkhāpadānaṃ kati kusalā…pe… kati araṇā’’ti pucchitvā ‘‘kusalāyeva, siyā sukhāya vedanāya sampayuttā’’ti (vibha. 716) evaṃ pavattamāne vissajjane ‘‘paccuppannārammaṇā’’ti ca ‘‘bahiddhārammaṇā’’ti ca evaṃ paccuppannabahiddhārammaṇattaṃ vuttaṃ, taṃ attano pāṇātipātādiakusalaṃ ārabhitvā viramantassa na yujjati. Yaṃ pana vuttaṃ – ‘‘aññaṃ ",
      " cintento aññaṃ kareyya, yañca pajahati, taṃ na jāneyyā’’ti. Tattha vuccate – na kiccasādhanavasena pavattento aññaṃ cintento ",
      " aññaṃ karotīti vā, yañca pajahati, taṃ na jānātīti vā vuccati."
    ],
    "innerText": "Viramatoti ettha āha ‘‘pāṇātipātādīhi viramanto kuto viramatī’’ti? Vuccate – samādānavasena tāva viramanto attano vā paresaṃ vā pāṇātipātādiakusalato viramati. Kimārabhitvā? Yato viramati, tadeva. Sampattavasenāpi viramanto vuttappakārākusalatova. Kimārabhitvā? Pāṇātipātādīnaṃ vuttārammaṇāneva. Keci pana bhaṇanti ‘‘surāmerayamajjasaṅkhāte saṅkhāre ārabhitvā surāmerayamajjapamādaṭṭhānā viramati, sattasaṅkhāresu yaṃ pana avaharitabbaṃ bhañjitabbañca, taṃ ārabhitvā adinnādānā musāvādā ca, satteyevārabhitvā pāṇātipātā abrahmacariyā cā’’ti. Tadaññe ‘‘evaṃ sante ‘aññaṃ cintento aññaṃ kareyya, yañca pajahati, taṃ na jāneyyā’ti evaṃdiṭṭhikā hutvā anicchamānā yadeva pajahati, taṃ attano pāṇātipātādiakusalamevārabhitvā viramatī’’ti vadanti. Tadayuttaṃ. Kasmā? Tassa paccuppannābhāvato bahiddhābhāvato ca. Sikkhāpadānañhi vibhaṅgapāṭhe ‘‘pañcannaṃ sikkhāpadānaṃ kati kusalā…pe… kati araṇā’’ti pucchitvā ‘‘kusalāyeva, siyā sukhāya vedanāya sampayuttā’’ti (vibha. 716) evaṃ pavattamāne vissajjane ‘‘paccuppannārammaṇā’’ti ca ‘‘bahiddhārammaṇā’’ti ca evaṃ paccuppannabahiddhārammaṇattaṃ vuttaṃ, taṃ attano pāṇātipātādiakusalaṃ ārabhitvā viramantassa na yujjati. Yaṃ pana vuttaṃ – ‘‘aññaṃ cintento aññaṃ kareyya, yañca pajahati, taṃ na jāneyyā’’ti. Tattha vuccate – na kiccasādhanavasena pavattento aññaṃ cintento aññaṃ karotīti vā, yañca pajahati, taṃ na jānātīti vā vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Ārabhitvāna ",
      " amataṃ, jahanto sabbapāpake;"
    ],
    "innerText": "‘‘Ārabhitvāna amataṃ, jahanto sabbapāpake;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nidassanañcettha bhave, maggaṭṭhoriyapuggalo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evamettha viramatopi viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Phalato"
      },
      "ti sabbe eva cete pāṇātipātādayo duggatiphalanibbattakā honti, sugatiyañca aniṭṭhākantāmanāpavipākanibbattakā honti, samparāye diṭṭhadhamme eva ca avesārajjādiphalanibbattakā. Apica ‘‘yo sabbalahuso pāṇātipātassa vipāko manussabhūtassa appāyukasaṃvattaniko hotī’’ti (a. ni. 8.40) evamādinā nayenettha phalatopi viññātabbo vinicchayo."
    ],
    "innerText": "Phalatoti sabbe eva cete pāṇātipātādayo duggatiphalanibbattakā honti, sugatiyañca aniṭṭhākantāmanāpavipākanibbattakā honti, samparāye diṭṭhadhamme eva ca avesārajjādiphalanibbattakā. Apica ‘‘yo sabbalahuso pāṇātipātassa vipāko manussabhūtassa appāyukasaṃvattaniko hotī’’ti (a. ni. 8.40) evamādinā nayenettha phalatopi viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Api cettha pāṇātipātādiveramaṇīnampi samuṭṭhānavedanāmūlakammaphalato viññātabbo vinicchayo. Tatthāyaṃ viññāpanā – sabbā eva cetā veramaṇiyo catūhi samuṭṭhahanti kāyato, kāyacittato, vācācittato, kāyavācācittato cāti. Sabbā eva ca sukhavedanāsampayuttā vā, adukkhamasukhavedanāsampayuttā vā, alobhādosamūlā vā alobhādosāmohamūlā vā. Catassopi cettha kāyakammaṃ, musāvādāveramaṇī vacīkammaṃ, maggakkhaṇe ca cittatova samuṭṭhahanti, sabbāpi manokammaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāṇātipātā veramaṇiyā"
      },
      " cettha aṅgapaccaṅgasampannatā ārohapariṇāhasampattitā javasampattitā suppatiṭṭhitapādatā cārutā mudutā sucitā sūratā mahabbalatā vissatthavacanatā lokapiyatā nelatā abhejjaparisatā acchambhitā duppadhaṃsitā parūpakkamena amaraṇatā anantaparivāratā surūpatā susaṇṭhānatā appābādhatā asokitā piyehi manāpehi saddhiṃ avippayogatā dīghāyukatāti evamādīni phalāni."
    ],
    "innerText": "Pāṇātipātā veramaṇiyā cettha aṅgapaccaṅgasampannatā ārohapariṇāhasampattitā javasampattitā suppatiṭṭhitapādatā cārutā mudutā sucitā sūratā mahabbalatā vissatthavacanatā lokapiyatā nelatā abhejjaparisatā acchambhitā duppadhaṃsitā parūpakkamena amaraṇatā anantaparivāratā surūpatā susaṇṭhānatā appābādhatā asokitā piyehi manāpehi saddhiṃ avippayogatā dīghāyukatāti evamādīni phalāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adinnādānā veramaṇiyā"
      },
      " mahaddhanatā pahūtadhanadhaññatā anantabhogatā anuppannabhoguppattitā uppannabhogathāvaratā icchitānaṃ bhogānaṃ khippappaṭilābhitā rājacorudakaggiappiyadāyādehi asādhāraṇabhogatā ",
      " asādhāraṇadhanappaṭilābhitā lokuttamatā natthikabhāvassa ajānanatā sukhavihāritāti evamādīni."
    ],
    "innerText": "Adinnādānā veramaṇiyā mahaddhanatā pahūtadhanadhaññatā anantabhogatā anuppannabhoguppattitā uppannabhogathāvaratā icchitānaṃ bhogānaṃ khippappaṭilābhitā rājacorudakaggiappiyadāyādehi asādhāraṇabhogatā asādhāraṇadhanappaṭilābhitā lokuttamatā natthikabhāvassa ajānanatā sukhavihāritāti evamādīni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abrahmacariyā veramaṇiyā"
      },
      " vigatapaccatthikatā sabbajanapiyatā annapānavatthasayanādīnaṃ lābhitā ",
      " sukhasayanatā sukhappaṭibujjhanatā apāyabhayavinimuttatā itthibhāvappaṭilābhassa vā napuṃsakabhāvappaṭilābhassa vā abhabbatā akkodhanatā paccakkhakāritā apatitakkhandhatā anadhomukhatā itthipurisānaṃ aññamaññapiyatā paripuṇṇindriyatā paripuṇṇalakkhaṇatā nirāsaṅkatā appossukkatā sukhavihāritā akutobhayatā piyavippayogābhāvatāti evamādīni."
    ],
    "innerText": "Abrahmacariyā veramaṇiyā vigatapaccatthikatā sabbajanapiyatā annapānavatthasayanādīnaṃ lābhitā sukhasayanatā sukhappaṭibujjhanatā apāyabhayavinimuttatā itthibhāvappaṭilābhassa vā napuṃsakabhāvappaṭilābhassa vā abhabbatā akkodhanatā paccakkhakāritā apatitakkhandhatā anadhomukhatā itthipurisānaṃ aññamaññapiyatā paripuṇṇindriyatā paripuṇṇalakkhaṇatā nirāsaṅkatā appossukkatā sukhavihāritā akutobhayatā piyavippayogābhāvatāti evamādīni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Musāvādā veramaṇiyā"
      },
      " vippasannindriyatā vissaṭṭhamadhurabhāṇitā samasitasuddhadantatā nātithūlatā nātikisatā nātirassatā nātidīghatā sukhasamphassatā uppalagandhamukhatā sussūsakaparijanatā ādeyyavacanatā kamaluppalasadisamudulohitatanujivhatā anuddhatatā acapalatāti evamādīni."
    ],
    "innerText": "Musāvādā veramaṇiyā vippasannindriyatā vissaṭṭhamadhurabhāṇitā samasitasuddhadantatā nātithūlatā nātikisatā nātirassatā nātidīghatā sukhasamphassatā uppalagandhamukhatā sussūsakaparijanatā ādeyyavacanatā kamaluppalasadisamudulohitatanujivhatā anuddhatatā acapalatāti evamādīni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Surāmerayamajjapamādaṭṭhānā veramaṇiyā"
      },
      " atītānāgatapaccuppannesu sabbakiccakaraṇīyesu khippaṃ paṭijānanatā sadā upaṭṭhitasatitā anummattakatā ñāṇavantatā analasatā ajaḷatā anelamūgatā amattatā appamattatā asammohatā acchambhitā asārambhitā anussaṅkitā saccavāditā apisuṇāpharusāsamphapalāpavāditā rattindivamatanditatā kataññutā kataveditā amaccharitā cāgavantatā sīlavantatā ujutā akkodhanatā hirimanatā ottappitā ujudiṭṭhikatā mahāpaññatā medhāvitā paṇḍitatā atthānatthakusalatāti evamādīni phalāni. Evamettha pāṇātipātādiveramaṇīnaṃ samuṭṭhānavedanāmūlakammaphalatopi viññātabbo vinicchayo."
    ],
    "innerText": "Surāmerayamajjapamādaṭṭhānā veramaṇiyā atītānāgatapaccuppannesu sabbakiccakaraṇīyesu khippaṃ paṭijānanatā sadā upaṭṭhitasatitā anummattakatā ñāṇavantatā analasatā ajaḷatā anelamūgatā amattatā appamattatā asammohatā acchambhitā asārambhitā anussaṅkitā saccavāditā apisuṇāpharusāsamphapalāpavāditā rattindivamatanditatā kataññutā kataveditā amaccharitā cāgavantatā sīlavantatā ujutā akkodhanatā hirimanatā ottappitā ujudiṭṭhikatā mahāpaññatā medhāvitā paṇḍitatā atthānatthakusalatāti evamādīni phalāni. Evamettha pāṇātipātādiveramaṇīnaṃ samuṭṭhānavedanāmūlakammaphalatopi viññātabbo vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Pacchimapañcasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idāni yaṃ vuttaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yojetabbaṃ tato yuttaṃ, pacchimesvapi pañcasu;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Āveṇikañca vattabbaṃ, ñeyyā hīnāditāpi cā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tassāyaṃ ",
      " atthavaṇṇanā – etissā purimapañcasikkhāpadavaṇṇanāya ",
      " yaṃ yujjati, taṃ tato gahetvā pacchimesvapi pañcasu sikkhāpadesu yojetabbaṃ. Tatthāyaṃ yojanā – yatheva hi purimasikkhāpadesu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ārammaṇato"
      },
      " ca surāmerayamajjapamādaṭṭhānaṃ rūpāyatanādiaññatarasaṅkhārārammaṇaṃ, tathā idha vikālabhojanaṃ. Etena nayena sabbesaṃ ārammaṇabhedo veditabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ādānato"
      },
      " ca yathā purimāni sāmaṇerena vā upāsakena vā samādiyantena samādinnāni honti, tathā etānipi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṅgato"
      },
      "pi ",
      " yathā tattha pāṇātipātādīnaṃ aṅgabhedo vutto, evamidhāpi vikālabhojanassa cattāri aṅgāni – vikālo, yāvakālikaṃ, ajjhoharaṇaṃ, anummattakatāti. Etenānusārena sesānampi aṅgavibhāgo veditabbo. Yathā ca tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samuṭṭhānato"
      },
      " surāmerayamajjapamādaṭṭhānaṃ kāyato ca kāyacittato cāti dvisamuṭṭhānaṃ, evamidha vikālabhojanaṃ. Etena nayena sabbesaṃ samuṭṭhānaṃ veditabbaṃ. Yathā ca tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vedanāto"
      },
      " adinnādānaṃ tīsu vedanāsu aññataravedanāsampayuttaṃ, tathā idha vikālabhojanaṃ. Etena nayena sabbesaṃ vedanāsampayogo veditabbo. Yathā ca tattha abrahmacariyaṃ lobhamohamūlaṃ, evamidha vikālabhojanaṃ. Aparāni ca dve etena nayena sabbesaṃ mūlabhedo veditabbo. Yathā ca tattha pāṇātipātādayo kāyakammaṃ, evamidhāpi vikālabhojanādīni. Jātarūparajatappaṭiggahaṇaṃ pana kāyakammaṃ vā siyā vacīkammaṃ vā kāyadvārādīhi pavattisabbhāvapariyāyena, na kammapathavasena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Viramato"
      },
      "ti yathā ca tattha viramanto attano vā paresaṃ vā pāṇātipātādiakusalato viramati, evamidhāpi vikālabhojanādiakusalato, kusalatopi vā ekato. Yathā ca purimā pañca veramaṇiyo catusamuṭṭhānā kāyato, kāyacittato, vācācittato, kāyavācācittato cāti, sabbā sukhavedanāsampayuttā vā adukkhamasukhavedanāsampayuttā vā, alobhādosamūlā vā alobhādosāmohamūlā vā, sabbā ca nānappakāraiṭṭhaphalanibbattakā, tathā idhāpīti."
    ],
    "innerText": "Tassāyaṃ atthavaṇṇanā – etissā purimapañcasikkhāpadavaṇṇanāya yaṃ yujjati, taṃ tato gahetvā pacchimesvapi pañcasu sikkhāpadesu yojetabbaṃ. Tatthāyaṃ yojanā – yatheva hi purimasikkhāpadesu ārammaṇato ca surāmerayamajjapamādaṭṭhānaṃ rūpāyatanādiaññatarasaṅkhārārammaṇaṃ, tathā idha vikālabhojanaṃ. Etena nayena sabbesaṃ ārammaṇabhedo veditabbo. Ādānato ca yathā purimāni sāmaṇerena vā upāsakena vā samādiyantena samādinnāni honti, tathā etānipi. Aṅgatopi yathā tattha pāṇātipātādīnaṃ aṅgabhedo vutto, evamidhāpi vikālabhojanassa cattāri aṅgāni – vikālo, yāvakālikaṃ, ajjhoharaṇaṃ, anummattakatāti. Etenānusārena sesānampi aṅgavibhāgo veditabbo. Yathā ca tattha samuṭṭhānato surāmerayamajjapamādaṭṭhānaṃ kāyato ca kāyacittato cāti dvisamuṭṭhānaṃ, evamidha vikālabhojanaṃ. Etena nayena sabbesaṃ samuṭṭhānaṃ veditabbaṃ. Yathā ca tattha vedanāto adinnādānaṃ tīsu vedanāsu aññataravedanāsampayuttaṃ, tathā idha vikālabhojanaṃ. Etena nayena sabbesaṃ vedanāsampayogo veditabbo. Yathā ca tattha abrahmacariyaṃ lobhamohamūlaṃ, evamidha vikālabhojanaṃ. Aparāni ca dve etena nayena sabbesaṃ mūlabhedo veditabbo. Yathā ca tattha pāṇātipātādayo kāyakammaṃ, evamidhāpi vikālabhojanādīni. Jātarūparajatappaṭiggahaṇaṃ pana kāyakammaṃ vā siyā vacīkammaṃ vā kāyadvārādīhi pavattisabbhāvapariyāyena, na kammapathavasena. Viramatoti yathā ca tattha viramanto attano vā paresaṃ vā pāṇātipātādiakusalato viramati, evamidhāpi vikālabhojanādiakusalato, kusalatopi vā ekato. Yathā ca purimā pañca veramaṇiyo catusamuṭṭhānā kāyato, kāyacittato, vācācittato, kāyavācācittato cāti, sabbā sukhavedanāsampayuttā vā adukkhamasukhavedanāsampayuttā vā, alobhādosamūlā vā alobhādosāmohamūlā vā, sabbā ca nānappakāraiṭṭhaphalanibbattakā, tathā idhāpīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yojetabbaṃ tato yuttaṃ, pacchimesvapi pañcasu;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Āveṇikañca vattabbaṃ, ñeyyā hīnāditāpi cā’’ti. –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Ettha pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vikālabhojana"
      },
      "nti majjhanhikavītikkame bhojanaṃ. Etañhi anuññātakāle vītikkante bhojanaṃ, tasmā ‘‘vikālabhojana’’nti vuccati ",
      ", tato vikālabhojanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Naccagītavāditavisūkadassana"
      },
      "nti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "naccaṃ"
      },
      " nāma yaṃkiñci naccaṃ, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gīta"
      },
      "nti yaṃkiñci gītaṃ, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vādita"
      },
      "nti yaṃkiñci vāditaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Visūkadassana"
      },
      "nti kilesuppattipaccayato kusalapakkhabhindanena visūkānaṃ dassanaṃ, visūkabhūtaṃ vā dassanaṃ visūkadassanaṃ. Naccā ca gītā ca vāditā ca visūkadassanā ca naccagītavāditavisūkadassanā. Visūkadassanañcettha brahmajāle vuttanayeneva gahetabbaṃ. Vuttañhi tattha –"
    ],
    "innerText": "Ettha pana vikālabhojananti majjhanhikavītikkame bhojanaṃ. Etañhi anuññātakāle vītikkante bhojanaṃ, tasmā ‘‘vikālabhojana’’nti vuccati , tato vikālabhojanā. Naccagītavāditavisūkadassananti ettha naccaṃ nāma yaṃkiñci naccaṃ, gītanti yaṃkiñci gītaṃ, vāditanti yaṃkiñci vāditaṃ. Visūkadassananti kilesuppattipaccayato kusalapakkhabhindanena visūkānaṃ dassanaṃ, visūkabhūtaṃ vā dassanaṃ visūkadassanaṃ. Naccā ca gītā ca vāditā ca visūkadassanā ca naccagītavāditavisūkadassanā. Visūkadassanañcettha brahmajāle vuttanayeneva gahetabbaṃ. Vuttañhi tattha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṃ visūkadassanamanuyuttā viharanti, seyyathidaṃ, naccaṃ gītaṃ vāditaṃ pekkhaṃ akkhānaṃ pāṇissaraṃ vetālaṃ kumbhathūṇaṃ sobhanakaṃ caṇḍālaṃ vaṃsaṃ dhovanaṃ hatthiyuddhaṃ assayuddhaṃ ",
      " mahiṃsayuddhaṃ usabhayuddhaṃ ajayuddhaṃ meṇḍayuddhaṃ kukkuṭayuddhaṃ vaṭṭakayuddhaṃ daṇḍayuddhaṃ muṭṭhiyuddhaṃ nibbuddhaṃ uyyodhikaṃ balaggaṃ senābyūhaṃ anīkadassanaṃ iti vā, iti evarūpā visūkadassanā paṭivirato samaṇo gotamo’’ti (dī. ni. 1.12)."
    ],
    "innerText": "‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṃ visūkadassanamanuyuttā viharanti, seyyathidaṃ, naccaṃ gītaṃ vāditaṃ pekkhaṃ akkhānaṃ pāṇissaraṃ vetālaṃ kumbhathūṇaṃ sobhanakaṃ caṇḍālaṃ vaṃsaṃ dhovanaṃ hatthiyuddhaṃ assayuddhaṃ mahiṃsayuddhaṃ usabhayuddhaṃ ajayuddhaṃ meṇḍayuddhaṃ kukkuṭayuddhaṃ vaṭṭakayuddhaṃ daṇḍayuddhaṃ muṭṭhiyuddhaṃ nibbuddhaṃ uyyodhikaṃ balaggaṃ senābyūhaṃ anīkadassanaṃ iti vā, iti evarūpā visūkadassanā paṭivirato samaṇo gotamo’’ti (dī. ni. 1.12)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha vā yathāvuttenatthena naccagītavāditāni eva visūkāni naccagītavāditavisūkāni, tesaṃ dassanaṃ naccagītavāditavisūkadassanaṃ, tasmā naccagītavāditavisūkadassanā. ‘‘Dassanasavanā’’ti vattabbe yathā ‘‘so ca hoti micchādiṭṭhiko viparītadassano’’ti evamādīsu (a. ni. 1.308) acakkhudvārappavattampi visayaggahaṇaṃ ‘‘dassana’’nti vuccati, evaṃ savanampi ‘‘dassana’’ntveva vuttaṃ. Dassanakamyatāya upasaṅkamitvā passato eva cettha vītikkamo hoti. Ṭhitanisinnasayanokāse pana āgataṃ gacchantassa vā āpāthagataṃ passato siyā saṃkileso, na vītikkamo. Dhammūpasaṃhitampi cettha gītaṃ na vaṭṭati, gītūpasaṃhito pana dhammo ",
      " vaṭṭatīti veditabbo."
    ],
    "innerText": "Atha vā yathāvuttenatthena naccagītavāditāni eva visūkāni naccagītavāditavisūkāni, tesaṃ dassanaṃ naccagītavāditavisūkadassanaṃ, tasmā naccagītavāditavisūkadassanā. ‘‘Dassanasavanā’’ti vattabbe yathā ‘‘so ca hoti micchādiṭṭhiko viparītadassano’’ti evamādīsu (a. ni. 1.308) acakkhudvārappavattampi visayaggahaṇaṃ ‘‘dassana’’nti vuccati, evaṃ savanampi ‘‘dassana’’ntveva vuttaṃ. Dassanakamyatāya upasaṅkamitvā passato eva cettha vītikkamo hoti. Ṭhitanisinnasayanokāse pana āgataṃ gacchantassa vā āpāthagataṃ passato siyā saṃkileso, na vītikkamo. Dhammūpasaṃhitampi cettha gītaṃ na vaṭṭati, gītūpasaṃhito pana dhammo vaṭṭatīti veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Mālādīni dhāraṇādīhi yathāsaṅkhyaṃ yojetabbāni. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mālā"
      },
      "ti yaṃkiñci pupphajātaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vilepana"
      },
      "nti yaṃkiñci vilepanatthaṃ pisitvā paṭiyattaṃ. Avasesaṃ sabbampi vāsacuṇṇadhūpanādikaṃ gandhajātaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gandho"
      },
      ". Taṃ sabbampi maṇḍanavibhūsanatthaṃ na vaṭṭati, bhesajjatthantu vaṭṭati, pūjanatthañca abhihaṭaṃ sādiyato na kenaci pariyāyena na vaṭṭati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uccāsayana"
      },
      "nti pamāṇātikkantaṃ vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahāsayana"
      },
      "nti akappiyasayanaṃ akappiyattharaṇañca. Tadubhayampi sādiyato ",
      " na kenaci pariyāyena vaṭṭati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jātarūpa"
      },
      "nti suvaṇṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rajata"
      },
      "nti kahāpaṇo, lohamāsakadārumāsakajatumāsakādi yaṃ yaṃ tattha tattha vohāraṃ gacchati, tadubhayampi jātarūparajataṃ. Tassa yena kenaci pakārena sādiyanaṃ paṭiggaho nāma, so na yena kenaci pariyāyena vaṭṭatīti evaṃ āveṇikaṃ vattabbaṃ."
    ],
    "innerText": "Mālādīni dhāraṇādīhi yathāsaṅkhyaṃ yojetabbāni. Tattha mālāti yaṃkiñci pupphajātaṃ. Vilepananti yaṃkiñci vilepanatthaṃ pisitvā paṭiyattaṃ. Avasesaṃ sabbampi vāsacuṇṇadhūpanādikaṃ gandhajātaṃ gandho. Taṃ sabbampi maṇḍanavibhūsanatthaṃ na vaṭṭati, bhesajjatthantu vaṭṭati, pūjanatthañca abhihaṭaṃ sādiyato na kenaci pariyāyena na vaṭṭati. Uccāsayananti pamāṇātikkantaṃ vuccati. Mahāsayananti akappiyasayanaṃ akappiyattharaṇañca. Tadubhayampi sādiyato na kenaci pariyāyena vaṭṭati. Jātarūpanti suvaṇṇaṃ. Rajatanti kahāpaṇo, lohamāsakadārumāsakajatumāsakādi yaṃ yaṃ tattha tattha vohāraṃ gacchati, tadubhayampi jātarūparajataṃ. Tassa yena kenaci pakārena sādiyanaṃ paṭiggaho nāma, so na yena kenaci pariyāyena vaṭṭatīti evaṃ āveṇikaṃ vattabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dasapi cetāni sikkhāpadāni hīnena chandena cittavīriyavīmaṃsāhi vā samādinnāni hīnāni, majjhimehi majjhimāni, paṇītehi paṇītāni. Taṇhādiṭṭhimānehi vā upakkiliṭṭhāni hīnāni, anupakkiliṭṭhāni majjhimāni, tattha tattha paññāya anuggahitāni paṇītāni. Ñāṇavippayuttena vā kusalacittena samādinnāni hīnāni, sasaṅkhārikañāṇasampayuttena majjhimāni, asaṅkhārikena paṇītānīti evaṃ ñeyyā hīnāditāpi cāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettāvatā ",
      " ca yā pubbe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yena yattha yadā yasmā’’"
      },
      "tiādīhi chahi gāthāhi sikkhāpadapāṭhassa vaṇṇanatthaṃ mātikā nikkhittā, sā atthato pakāsitā hotīti."
    ],
    "innerText": "Ettāvatā ca yā pubbe ‘‘yena yattha yadā yasmā’’tiādīhi chahi gāthāhi sikkhāpadapāṭhassa vaṇṇanatthaṃ mātikā nikkhittā, sā atthato pakāsitā hotīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paramatthajotikāya khuddakapāṭha-aṭṭhakathāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sikkhāpadavaṇṇanā niṭṭhitā."
  }
]