[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "12. Attavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Bodhirājakumāravatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attānañce"
      },
      "ti ",
      " imaṃ dhammadesanaṃ satthā bhesakaḷāvane viharanto bodhirājakumāraṃ ārabbha kathesi."
    ],
    "innerText": "Attānañceti imaṃ dhammadesanaṃ satthā bhesakaḷāvane viharanto bodhirājakumāraṃ ārabbha kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "So kira pathavītale aññehi pāsādehi asadisarūpaṃ ākāse uppatamānaṃ viya kokanudaṃ nāma pāsādaṃ kāretvā vaḍḍhakiṃ pucchi – ‘‘kiṃ tayā aññatthāpi evarūpo pāsādo katapubbo, udāhu paṭhamasippameva te ida’’nti. ‘‘Paṭhamasippameva, devā’’ti ca vutte cintesi – ‘‘sace ayaṃ aññassapi evarūpaṃ pāsādaṃ karissati, ayaṃ pāsādo anacchariyo bhavissati. Imaṃ mayā māretuṃ vā hatthapāde vāssa chindituṃ akkhīni vā uppāṭetuṃ vaṭṭati, evaṃ aññassa pāsādaṃ na karissatī’’ti. So tamatthaṃ attano piyasahāyakassa sañjīvakaputtassa nāma māṇavakassa kathesi. So cintesi – ‘‘nissaṃsayaṃ esa vaḍḍhakiṃ nāsessati, anaggho sippī, so mayi passante mā nassatu, saññamassa dassāmī’’ti. So taṃ upasaṅkamitvā ‘‘pāsāde te kammaṃ niṭṭhitaṃ, no’’ti pucchitvā ‘‘niṭṭhita’’nti vutte ‘‘rājakumāro taṃ nāsetukāmo attānaṃ rakkheyyāsī’’ti āha ",
      ". Vaḍḍhakīpi ‘‘bhaddakaṃ te, sāmi, kataṃ mama ārocentena, ahamettha kattabbaṃ jānissāmī’’ti vatvā ‘‘kiṃ, samma, amhākaṃ pāsāde kammaṃ niṭṭhita’’nti rājakumārena puṭṭho ‘‘na tāva, deva, niṭṭhitaṃ, bahu avasiṭṭha’’nti āha. Kiṃ kammaṃ nāma avasiṭṭhanti? Pacchā, deva, ācikkhissāmi, dārūni tāva āharāpethāti. Kiṃ dārūni nāmāti? Nissārāni sukkhadārūni, devāti. So āharāpetvā adāsi. Atha naṃ āha – ‘‘deva, te ito paṭṭhāya mama santikaṃ nāgantabbaṃ. Kiṃ kāraṇā? Sukhumakammaṃ karontassa hi aññehi saddhiṃ sallapantassa me kammavikkhepo hoti, āhāravelāyaṃ pana me bhariyāva āhāraṃ āharissatī’’ti. Rājakumāropi ‘‘sādhū’’ti paṭissuṇi. Sopi ekasmiṃ gabbhe nisīditvā tāni dārūni tacchetvā attano puttadārassa anto nisīdanayoggaṃ garuḷasakuṇaṃ katvā āhāravelāya pana bhariyaṃ āha – ‘‘gehe vijjamānakaṃ sabbaṃ vikkiṇitvā hiraññasuvaṇṇaṃ ",
      " gaṇhāhī’’ti. Rājakumāropi vaḍḍhakissa anikkhamanatthāya gehaṃ parikkhipitvā ārakkhaṃ ṭhapesi. Vaḍḍhakīpi ",
      " sakuṇassa niṭṭhitakāle ‘‘ajja sabbepi dārake gahetvā āgaccheyyāsī’’ti bhariyaṃ vatvā bhuttapātarāso puttadāraṃ sakuṇassa kucchiyaṃ nisīdāpetvā vātapānena nikkhamitvā palāyi. So tesaṃ, ‘‘deva, vaḍḍhakī palāyatī’’ti kandantānaṃyeva gantvā himavante otaritvā ekaṃ nagaraṃ māpetvā kaṭṭhavāhanarājā nāma jāto."
    ],
    "innerText": "So kira pathavītale aññehi pāsādehi asadisarūpaṃ ākāse uppatamānaṃ viya kokanudaṃ nāma pāsādaṃ kāretvā vaḍḍhakiṃ pucchi – ‘‘kiṃ tayā aññatthāpi evarūpo pāsādo katapubbo, udāhu paṭhamasippameva te ida’’nti. ‘‘Paṭhamasippameva, devā’’ti ca vutte cintesi – ‘‘sace ayaṃ aññassapi evarūpaṃ pāsādaṃ karissati, ayaṃ pāsādo anacchariyo bhavissati. Imaṃ mayā māretuṃ vā hatthapāde vāssa chindituṃ akkhīni vā uppāṭetuṃ vaṭṭati, evaṃ aññassa pāsādaṃ na karissatī’’ti. So tamatthaṃ attano piyasahāyakassa sañjīvakaputtassa nāma māṇavakassa kathesi. So cintesi – ‘‘nissaṃsayaṃ esa vaḍḍhakiṃ nāsessati, anaggho sippī, so mayi passante mā nassatu, saññamassa dassāmī’’ti. So taṃ upasaṅkamitvā ‘‘pāsāde te kammaṃ niṭṭhitaṃ, no’’ti pucchitvā ‘‘niṭṭhita’’nti vutte ‘‘rājakumāro taṃ nāsetukāmo attānaṃ rakkheyyāsī’’ti āha . Vaḍḍhakīpi ‘‘bhaddakaṃ te, sāmi, kataṃ mama ārocentena, ahamettha kattabbaṃ jānissāmī’’ti vatvā ‘‘kiṃ, samma, amhākaṃ pāsāde kammaṃ niṭṭhita’’nti rājakumārena puṭṭho ‘‘na tāva, deva, niṭṭhitaṃ, bahu avasiṭṭha’’nti āha. Kiṃ kammaṃ nāma avasiṭṭhanti? Pacchā, deva, ācikkhissāmi, dārūni tāva āharāpethāti. Kiṃ dārūni nāmāti? Nissārāni sukkhadārūni, devāti. So āharāpetvā adāsi. Atha naṃ āha – ‘‘deva, te ito paṭṭhāya mama santikaṃ nāgantabbaṃ. Kiṃ kāraṇā? Sukhumakammaṃ karontassa hi aññehi saddhiṃ sallapantassa me kammavikkhepo hoti, āhāravelāyaṃ pana me bhariyāva āhāraṃ āharissatī’’ti. Rājakumāropi ‘‘sādhū’’ti paṭissuṇi. Sopi ekasmiṃ gabbhe nisīditvā tāni dārūni tacchetvā attano puttadārassa anto nisīdanayoggaṃ garuḷasakuṇaṃ katvā āhāravelāya pana bhariyaṃ āha – ‘‘gehe vijjamānakaṃ sabbaṃ vikkiṇitvā hiraññasuvaṇṇaṃ gaṇhāhī’’ti. Rājakumāropi vaḍḍhakissa anikkhamanatthāya gehaṃ parikkhipitvā ārakkhaṃ ṭhapesi. Vaḍḍhakīpi sakuṇassa niṭṭhitakāle ‘‘ajja sabbepi dārake gahetvā āgaccheyyāsī’’ti bhariyaṃ vatvā bhuttapātarāso puttadāraṃ sakuṇassa kucchiyaṃ nisīdāpetvā vātapānena nikkhamitvā palāyi. So tesaṃ, ‘‘deva, vaḍḍhakī palāyatī’’ti kandantānaṃyeva gantvā himavante otaritvā ekaṃ nagaraṃ māpetvā kaṭṭhavāhanarājā nāma jāto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Rājakumāropi ",
      " ‘‘pāsādamahaṃ karissāmī’’ti satthāraṃ nimantetvā pāsāde catujjātiyagandhehi paribhaṇḍikaṃ katvā paṭhamaummārato paṭṭhāya celapaṭikaṃ patthari. So kira aputtako, tasmā ‘‘sacāhaṃ puttaṃ vā dhītaraṃ vā lacchāmi, satthā imaṃ akkamissatī’’ti cintetvā patthari. So satthari āgate satthāraṃ pañcapatiṭṭhitena vanditvā pattaṃ gahetvā ‘‘pavisatha, bhante’’ti āha. Satthā na pāvisi, so dutiyampi tatiyampi yāci. Satthā apavisitvāva ānandattheraṃ olokesi. Thero olokitasaññāyeva vatthānaṃ anakkamanabhāvaṃ ñatvā taṃ ‘‘saṃharatu, rājakumāra, dussāni, na bhagavā celapaṭikaṃ akkamissati, pacchimajanataṃ tathāgato oloketī’’ti dussāni saṃharāpesi. So dussāni saṃharitvā satthāraṃ antonivesanaṃ pavesatvā yāgukhajjakena sammānetvā ekamantaṃ nisinno vanditvā āha – ‘‘bhante, ahaṃ tumhākaṃ upakārako tikkhattuṃ saraṇaṃ gato, kucchigato ca kiramhi ekavāraṃ saraṇaṃ gato, dutiyaṃ taruṇadārakakāle, tatiyaṃ viññubhāvaṃ pattakāle. Tassa me kasmā celapaṭikaṃ na akkamitthā’’ti? ‘‘Kiṃ pana tvaṃ, kumāra, cintetvā celāni attharī’’ti? ‘‘Sace puttaṃ vā dhītaraṃ vā lacchāmi, satthā me celapaṭikaṃ akkamissatī’’ti idaṃ cintetvā, bhanteti. Tenevāhaṃ taṃ na akkaminti. ‘‘Kiṃ panāhaṃ, bhante, puttaṃ ",
      " vā dhītaraṃ vā neva lacchāmī’’ti? ‘‘Āma, kumārā’’ti. ‘‘Kiṃ kāraṇā’’ti? ‘‘Purimakaattabhāve jāyāya saddhiṃ pamādaṃ āpannattā’’ti. ‘‘Kasmiṃ kāle, bhante’’ti? Athassa satthā atītaṃ āharitvā dassesi –"
    ],
    "innerText": "Rājakumāropi ‘‘pāsādamahaṃ karissāmī’’ti satthāraṃ nimantetvā pāsāde catujjātiyagandhehi paribhaṇḍikaṃ katvā paṭhamaummārato paṭṭhāya celapaṭikaṃ patthari. So kira aputtako, tasmā ‘‘sacāhaṃ puttaṃ vā dhītaraṃ vā lacchāmi, satthā imaṃ akkamissatī’’ti cintetvā patthari. So satthari āgate satthāraṃ pañcapatiṭṭhitena vanditvā pattaṃ gahetvā ‘‘pavisatha, bhante’’ti āha. Satthā na pāvisi, so dutiyampi tatiyampi yāci. Satthā apavisitvāva ānandattheraṃ olokesi. Thero olokitasaññāyeva vatthānaṃ anakkamanabhāvaṃ ñatvā taṃ ‘‘saṃharatu, rājakumāra, dussāni, na bhagavā celapaṭikaṃ akkamissati, pacchimajanataṃ tathāgato oloketī’’ti dussāni saṃharāpesi. So dussāni saṃharitvā satthāraṃ antonivesanaṃ pavesatvā yāgukhajjakena sammānetvā ekamantaṃ nisinno vanditvā āha – ‘‘bhante, ahaṃ tumhākaṃ upakārako tikkhattuṃ saraṇaṃ gato, kucchigato ca kiramhi ekavāraṃ saraṇaṃ gato, dutiyaṃ taruṇadārakakāle, tatiyaṃ viññubhāvaṃ pattakāle. Tassa me kasmā celapaṭikaṃ na akkamitthā’’ti? ‘‘Kiṃ pana tvaṃ, kumāra, cintetvā celāni attharī’’ti? ‘‘Sace puttaṃ vā dhītaraṃ vā lacchāmi, satthā me celapaṭikaṃ akkamissatī’’ti idaṃ cintetvā, bhanteti. Tenevāhaṃ taṃ na akkaminti. ‘‘Kiṃ panāhaṃ, bhante, puttaṃ vā dhītaraṃ vā neva lacchāmī’’ti? ‘‘Āma, kumārā’’ti. ‘‘Kiṃ kāraṇā’’ti? ‘‘Purimakaattabhāve jāyāya saddhiṃ pamādaṃ āpannattā’’ti. ‘‘Kasmiṃ kāle, bhante’’ti? Athassa satthā atītaṃ āharitvā dassesi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atīte kira anekasatā manussā mahatiyā nāvāya samuddaṃ pakkhandiṃsu. Nāvā samuddamajjhe bhijji. Dve jayampatikā ekaṃ phalakaṃ gahetvā antaradīpakaṃ pavisiṃsu, sesā sabbe tattheva mariṃsu. Tasmiṃ kho pana dīpake ",
      " mahāsakuṇasaṅgho vasati. Te aññaṃ khāditabbakaṃ adisvā chātajjhattā sakuṇaaṇḍāni aṅgāresu pacitvā khādiṃsu, tesu appahontesu sakuṇacchāpe gahetvā khādiṃsu. Evaṃ paṭhamavayepi majjhimavayepi pacchimavayepi khādiṃsuyeva. Ekasmimpi vaye appamādaṃ nāpajjiṃsu, ekopi ca nesaṃ appamādaṃ nāpajji."
    ],
    "innerText": "Atīte kira anekasatā manussā mahatiyā nāvāya samuddaṃ pakkhandiṃsu. Nāvā samuddamajjhe bhijji. Dve jayampatikā ekaṃ phalakaṃ gahetvā antaradīpakaṃ pavisiṃsu, sesā sabbe tattheva mariṃsu. Tasmiṃ kho pana dīpake mahāsakuṇasaṅgho vasati. Te aññaṃ khāditabbakaṃ adisvā chātajjhattā sakuṇaaṇḍāni aṅgāresu pacitvā khādiṃsu, tesu appahontesu sakuṇacchāpe gahetvā khādiṃsu. Evaṃ paṭhamavayepi majjhimavayepi pacchimavayepi khādiṃsuyeva. Ekasmimpi vaye appamādaṃ nāpajjiṃsu, ekopi ca nesaṃ appamādaṃ nāpajji."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Satthā idaṃ tassa pubbakammaṃ dassetvā ‘‘sace hi tvaṃ, kumāra, tadā ekasmimpi vaye bhariyāya ",
      " saddhiṃ appamādaṃ āpajjissa, ekasmimpi vaye putto vā dhītā vā uppajjeyya. Sace pana vo ekopi appamatto abhavissa, taṃ paṭicca putto vā dhītā vā uppajjissa. Kumāra, attānañhi piyaṃ maññamānena tīsupi vayesu appamattena attā rakkhitabbo, evaṃ asakkontena ekavayepi rakkhitabboyevā’’ti vatvā imaṃ gāthamāha –"
    ],
    "innerText": "Satthā idaṃ tassa pubbakammaṃ dassetvā ‘‘sace hi tvaṃ, kumāra, tadā ekasmimpi vaye bhariyāya saddhiṃ appamādaṃ āpajjissa, ekasmimpi vaye putto vā dhītā vā uppajjeyya. Sace pana vo ekopi appamatto abhavissa, taṃ paṭicca putto vā dhītā vā uppajjissa. Kumāra, attānañhi piyaṃ maññamānena tīsupi vayesu appamattena attā rakkhitabbo, evaṃ asakkontena ekavayepi rakkhitabboyevā’’ti vatvā imaṃ gāthamāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "157"
      },
      "."
    ],
    "innerText": "157."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Attānañce piyaṃ jaññā, rakkheyya naṃ surakkhitaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tiṇṇaṃ aññataraṃ yāmaṃ, paṭijaggeyya paṇḍito’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yāma"
      },
      "nti satthā attano dhammissaratāya desanākusalatāya ca idha tiṇṇaṃ vayānaṃ aññataraṃ vayaṃ yāmanti katvā desesi, tasmā evamettha attho veditabbo. Sace ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "attānaṃ piyaṃ"
      },
      " jāneyya, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rakkheyya naṃ surakkhita"
      },
      "nti yathā so surakkhito hoti, evaṃ naṃ rakkheyya. Tattha sace gīhī samāno ‘‘attānaṃ rakkhissāmī’’ti uparipāsādatale susaṃvutaṃ gabbhaṃ pavisitvā sampannārakkho hutvā vasantopi, pabbajito hutvā susaṃvute pihitadvāravātapāne leṇe viharantopi attānaṃ na rakkhatiyeva. Gihī pana samāno yathābalaṃ dānasīlādīni puññāni karonto, pabbajito vā pana vattapaṭivattapariyattimanasikāresu ussukkaṃ āpajjanto attānaṃ rakkhati nāma. Evaṃ tīsu vayesu asakkonto aññatarasmimpi vaye paṇḍitapuriso attānaṃ paṭijaggatiyeva. Sace hi gihibhūto paṭhamavaye khiḍḍāpasutatāya kusalaṃ kātuṃ na sakkoti, majjhimavaye appamattena hutvā kusalaṃ kātabbaṃ. Sace majjhimavaye puttadāraṃ posento kusalaṃ kātuṃ na sakkoti, pacchimavaye kātabbameva. Evampi karontena attā paṭijaggitova hoti. Evaṃ akarontassa pana attā piyo nāma na hoti, apāyaparāyaṇameva naṃ karoti. Sace pana ",
      " pabbajito paṭhamavaye sajjhāyaṃ karonto dhārento vācento vattapaṭivattaṃ karonto pamādaṃ āpajjati, majjhimavaye appamattena samaṇadhammo ",
      " kātabbo. Sace paṭhamavaye uggahitapariyattiyā aṭṭhakathaṃ vinicchayaṃ kāraṇākāraṇañca pucchanto majjhimavaye pamādaṃ āpajjati, pacchimavaye appamattena samaṇadhammo kātabboyeva. Evampi karontena attā paṭijaggitova hoti. Evaṃ akarontassa pana attā piyo nāma na hoti, pacchānutāpeneva naṃ tāpetīti."
    ],
    "innerText": "Tattha yāmanti satthā attano dhammissaratāya desanākusalatāya ca idha tiṇṇaṃ vayānaṃ aññataraṃ vayaṃ yāmanti katvā desesi, tasmā evamettha attho veditabbo. Sace attānaṃ piyaṃ jāneyya, rakkheyya naṃ surakkhitanti yathā so surakkhito hoti, evaṃ naṃ rakkheyya. Tattha sace gīhī samāno ‘‘attānaṃ rakkhissāmī’’ti uparipāsādatale susaṃvutaṃ gabbhaṃ pavisitvā sampannārakkho hutvā vasantopi, pabbajito hutvā susaṃvute pihitadvāravātapāne leṇe viharantopi attānaṃ na rakkhatiyeva. Gihī pana samāno yathābalaṃ dānasīlādīni puññāni karonto, pabbajito vā pana vattapaṭivattapariyattimanasikāresu ussukkaṃ āpajjanto attānaṃ rakkhati nāma. Evaṃ tīsu vayesu asakkonto aññatarasmimpi vaye paṇḍitapuriso attānaṃ paṭijaggatiyeva. Sace hi gihibhūto paṭhamavaye khiḍḍāpasutatāya kusalaṃ kātuṃ na sakkoti, majjhimavaye appamattena hutvā kusalaṃ kātabbaṃ. Sace majjhimavaye puttadāraṃ posento kusalaṃ kātuṃ na sakkoti, pacchimavaye kātabbameva. Evampi karontena attā paṭijaggitova hoti. Evaṃ akarontassa pana attā piyo nāma na hoti, apāyaparāyaṇameva naṃ karoti. Sace pana pabbajito paṭhamavaye sajjhāyaṃ karonto dhārento vācento vattapaṭivattaṃ karonto pamādaṃ āpajjati, majjhimavaye appamattena samaṇadhammo kātabbo. Sace paṭhamavaye uggahitapariyattiyā aṭṭhakathaṃ vinicchayaṃ kāraṇākāraṇañca pucchanto majjhimavaye pamādaṃ āpajjati, pacchimavaye appamattena samaṇadhammo kātabboyeva. Evampi karontena attā paṭijaggitova hoti. Evaṃ akarontassa pana attā piyo nāma na hoti, pacchānutāpeneva naṃ tāpetīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Desanāvasāne bodhirājakumāro sotāpattiphale patiṭṭhahi, sampattaparisāyapi sātthikā dhammadesanā ahosīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Bodhirājakumāravatthu paṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Upanandasakyaputtattheravatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attānameva"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭhama"
      },
      "nti imaṃ dhammadesanaṃ satthā jetavane viharanto upanandaṃ sakyaputtaṃ ārabbha kathesi."
    ],
    "innerText": "Attānamevapaṭhamanti imaṃ dhammadesanaṃ satthā jetavane viharanto upanandaṃ sakyaputtaṃ ārabbha kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "So kira thero dhammakathaṃ kathetuṃ cheko. Tassa appicchatādipaṭisaṃyuttaṃ dhammakathaṃ sutvā bahū bhikkhu taṃ ticīvarehi pūjetvā dhutaṅgāni samādiyiṃsu. Tehi vissaṭṭhaparikkhāre soyeva gaṇhi. So ekasmiṃ antovasse upakaṭṭhe janapadaṃ agamāsi. Atha naṃ ekasmiṃ vihāre daharasāmaṇerā dhammakathikapemena, ‘‘bhante, idha vassaṃ upethā’’ti vadiṃsu. ‘‘Idha kittakaṃ vassāvāsikaṃ labbhatī’’ti pucchitvā tehi ‘‘ekeko sāṭako’’ti vutte tattha upāhanā ṭhapetvā aññaṃ vihāraṃ agamāsi ",
      ". Dutiyaṃ vihāraṃ gantvā ‘‘idha kiṃ labbhatī’’ti pucchitvā ‘‘dve sāṭakā’’ti vutte kattarayaṭṭhiṃ ṭhapesi. Tatiyaṃ vihāraṃ gantvā ‘‘idha kiṃ labbhatī’’ti pucchitvā ‘‘tayo sāṭakā’’ti vutte tattha udakatumbaṃ ṭhapesi. Catutthaṃ vihāraṃ gantvā ‘‘idha kiṃ labbhatī’’ti pucchitvā ‘‘cattāro sāṭakā’’ti vutte ‘‘sādhu idha vasissāmī’’ti tattha vassaṃ upagantvā gahaṭṭhānañceva bhikkhūnañca dhammakathaṃ kathesi. Te naṃ bahūhi vatthehi ceva cīvarehi ca pūjesuṃ. So vuṭṭhavasso itaresupi vihāresu sāsanaṃ pesetvā ‘‘mayā parikkhārassa ṭhapitattā vassāvāsikaṃ laddhabbaṃ, taṃ me pahiṇantū’’ti sabbaṃ āharāpetvā yānakaṃ pūretvā pāyāsi."
    ],
    "innerText": "So kira thero dhammakathaṃ kathetuṃ cheko. Tassa appicchatādipaṭisaṃyuttaṃ dhammakathaṃ sutvā bahū bhikkhu taṃ ticīvarehi pūjetvā dhutaṅgāni samādiyiṃsu. Tehi vissaṭṭhaparikkhāre soyeva gaṇhi. So ekasmiṃ antovasse upakaṭṭhe janapadaṃ agamāsi. Atha naṃ ekasmiṃ vihāre daharasāmaṇerā dhammakathikapemena, ‘‘bhante, idha vassaṃ upethā’’ti vadiṃsu. ‘‘Idha kittakaṃ vassāvāsikaṃ labbhatī’’ti pucchitvā tehi ‘‘ekeko sāṭako’’ti vutte tattha upāhanā ṭhapetvā aññaṃ vihāraṃ agamāsi . Dutiyaṃ vihāraṃ gantvā ‘‘idha kiṃ labbhatī’’ti pucchitvā ‘‘dve sāṭakā’’ti vutte kattarayaṭṭhiṃ ṭhapesi. Tatiyaṃ vihāraṃ gantvā ‘‘idha kiṃ labbhatī’’ti pucchitvā ‘‘tayo sāṭakā’’ti vutte tattha udakatumbaṃ ṭhapesi. Catutthaṃ vihāraṃ gantvā ‘‘idha kiṃ labbhatī’’ti pucchitvā ‘‘cattāro sāṭakā’’ti vutte ‘‘sādhu idha vasissāmī’’ti tattha vassaṃ upagantvā gahaṭṭhānañceva bhikkhūnañca dhammakathaṃ kathesi. Te naṃ bahūhi vatthehi ceva cīvarehi ca pūjesuṃ. So vuṭṭhavasso itaresupi vihāresu sāsanaṃ pesetvā ‘‘mayā parikkhārassa ṭhapitattā vassāvāsikaṃ laddhabbaṃ, taṃ me pahiṇantū’’ti sabbaṃ āharāpetvā yānakaṃ pūretvā pāyāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Athekasmiṃ ",
      " vihāre dve daharabhikkhū dve sāṭake ekañca kambalaṃ labhitvā ‘‘tuyhaṃ sāṭakā hontu, mayhaṃ kambalo’’ti bhājetuṃ asakkontā maggasamīpe nisīditvā vivadanti. Te taṃ theraṃ āgacchantaṃ disvā, ‘‘bhante, tumhe no bhājetvā dethā’’ti vadiṃsu. Tumheyeva bhājethāti. Na sakkoma, bhante, tumheyeva no bhājetvā dethāti. Tena hi mama vacane ṭhassathāti. Āma, ṭhassāmāti. ‘‘Tena hi sādhū’’ti tesaṃ dve sāṭake datvā ‘‘ayaṃ dhammakathaṃ kathentānaṃ amhākaṃ pārupanāraho’’ti mahagghaṃ kambalaṃ ādāya pakkāmi. Daharabhikkhū vippaṭisārino hutvā satthu santikaṃ gantvā tamatthaṃ ārocesuṃ. Satthā ‘‘na, bhikkhave, idāneva tumhākaṃ santakaṃ ",
      " gahetvā tumhe vippaṭisārino karoti, pubbepi akāsiyevā’’ti vatvā atītaṃ āhari –"
    ],
    "innerText": "Athekasmiṃ vihāre dve daharabhikkhū dve sāṭake ekañca kambalaṃ labhitvā ‘‘tuyhaṃ sāṭakā hontu, mayhaṃ kambalo’’ti bhājetuṃ asakkontā maggasamīpe nisīditvā vivadanti. Te taṃ theraṃ āgacchantaṃ disvā, ‘‘bhante, tumhe no bhājetvā dethā’’ti vadiṃsu. Tumheyeva bhājethāti. Na sakkoma, bhante, tumheyeva no bhājetvā dethāti. Tena hi mama vacane ṭhassathāti. Āma, ṭhassāmāti. ‘‘Tena hi sādhū’’ti tesaṃ dve sāṭake datvā ‘‘ayaṃ dhammakathaṃ kathentānaṃ amhākaṃ pārupanāraho’’ti mahagghaṃ kambalaṃ ādāya pakkāmi. Daharabhikkhū vippaṭisārino hutvā satthu santikaṃ gantvā tamatthaṃ ārocesuṃ. Satthā ‘‘na, bhikkhave, idāneva tumhākaṃ santakaṃ gahetvā tumhe vippaṭisārino karoti, pubbepi akāsiyevā’’ti vatvā atītaṃ āhari –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atītasmiṃ anutīracārī ca gambhīracārī cāti dve uddā mahantaṃ rohitamacchaṃ labhitvā ‘‘mayhaṃ sīsaṃ hotu, tava naṅguṭṭha’’nti vivādāpannā bhājetuṃ asakkontā ekaṃ siṅgālaṃ disvā āhaṃsu – ‘‘mātula, imaṃ no bhājetvā dehī’’ti. Ahaṃ raññā vinicchayaṭṭhāne ṭhapito, tattha ciraṃ ",
      " nisīditvā jaṅghavihāratthāya āgatomhi, idāni me okāso natthīti. Mātula, mā evaṃ karotha, bhājetvā eva no dethāti. Mama vacane ṭhassathāti. Ṭhassāma, mātulāti. ‘‘Tena hi sādhū’’ti so sīsaṃ chinditvā ekamante akāsi, naṅguṭṭhaṃ ekamante. Katvā ca pana, ‘‘tātā, yena vo anutīre caritaṃ, so naṅguṭṭhaṃ gaṇhātu. Yena gambhīre caritaṃ, tassa sīsaṃ hotu. Ayaṃ pana majjhimo khaṇḍo mama vinicchayadhamme ṭhitassa bhavissatī’’ti te saññāpento –"
    ],
    "innerText": "Atītasmiṃ anutīracārī ca gambhīracārī cāti dve uddā mahantaṃ rohitamacchaṃ labhitvā ‘‘mayhaṃ sīsaṃ hotu, tava naṅguṭṭha’’nti vivādāpannā bhājetuṃ asakkontā ekaṃ siṅgālaṃ disvā āhaṃsu – ‘‘mātula, imaṃ no bhājetvā dehī’’ti. Ahaṃ raññā vinicchayaṭṭhāne ṭhapito, tattha ciraṃ nisīditvā jaṅghavihāratthāya āgatomhi, idāni me okāso natthīti. Mātula, mā evaṃ karotha, bhājetvā eva no dethāti. Mama vacane ṭhassathāti. Ṭhassāma, mātulāti. ‘‘Tena hi sādhū’’ti so sīsaṃ chinditvā ekamante akāsi, naṅguṭṭhaṃ ekamante. Katvā ca pana, ‘‘tātā, yena vo anutīre caritaṃ, so naṅguṭṭhaṃ gaṇhātu. Yena gambhīre caritaṃ, tassa sīsaṃ hotu. Ayaṃ pana majjhimo khaṇḍo mama vinicchayadhamme ṭhitassa bhavissatī’’ti te saññāpento –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Anutīracāri naṅguṭṭhaṃ, sīsaṃ gambhīracārino;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Accāyaṃ majjhimo khaṇḍo, dhammaṭṭhassa bhavissatī’’ti. (jā. 1.7.33) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Imaṃ gāthaṃ vatvā majjhimakhaṇḍaṃ ādāya pakkāmi. Tepi vippaṭisārino taṃ oloketvā aṭṭhaṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Satthā imaṃ atītaṃ dassetvā ‘‘evamesa atītepi tumhe vippaṭisārino akāsiyevā’’ti te bhikkhū saññāpetvā upanandaṃ garahanto, ‘‘bhikkhave ",
      ", paraṃ ovadantena nāma paṭhamameva attā patirūpe patiṭṭhāpetabbo’’ti vatvā imaṃ gāthamāha –"
    ],
    "innerText": "Satthā imaṃ atītaṃ dassetvā ‘‘evamesa atītepi tumhe vippaṭisārino akāsiyevā’’ti te bhikkhū saññāpetvā upanandaṃ garahanto, ‘‘bhikkhave , paraṃ ovadantena nāma paṭhamameva attā patirūpe patiṭṭhāpetabbo’’ti vatvā imaṃ gāthamāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "158"
      },
      "."
    ],
    "innerText": "158."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Attānameva paṭhamaṃ, patirūpe nivesaye;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Athaññamanusāseyya, na kilisseyya paṇḍito’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "patirūpe nivesaye"
      },
      "ti anucchavike guṇe patiṭṭhāpeyya. Idaṃ vuttaṃ hoti – yo appicchatādiguṇehi vā ariyavaṃsapaṭipadādīhi vā paraṃ anusāsitukāmo, so ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "attānameva paṭhamaṃ"
      },
      " tasmiṃ guṇe patiṭṭhāpeyya. Evaṃ patiṭṭhāpetvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "athaññaṃ"
      },
      " tehi guṇehi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anusāseyya"
      },
      ". Attānañhi tattha anivesetvā kevalaṃ parameva anusāsamāno parato nindaṃ labhitvā kilissati nāma, tattha attānaṃ nivesetvā anusāsamāno parato pasaṃsaṃ labhati, tasmā na kilissati nāma. Evaṃ karonto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṇḍito na kilisseyyā"
      },
      "ti."
    ],
    "innerText": "Tattha patirūpe nivesayeti anucchavike guṇe patiṭṭhāpeyya. Idaṃ vuttaṃ hoti – yo appicchatādiguṇehi vā ariyavaṃsapaṭipadādīhi vā paraṃ anusāsitukāmo, so attānameva paṭhamaṃ tasmiṃ guṇe patiṭṭhāpeyya. Evaṃ patiṭṭhāpetvā athaññaṃ tehi guṇehi anusāseyya. Attānañhi tattha anivesetvā kevalaṃ parameva anusāsamāno parato nindaṃ labhitvā kilissati nāma, tattha attānaṃ nivesetvā anusāsamāno parato pasaṃsaṃ labhati, tasmā na kilissati nāma. Evaṃ karonto paṇḍito na kilisseyyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Desanāvasāne te bhikkhū sotāpattiphale patiṭṭhahiṃsu, mahājanassāpi sātthikā dhammadesanā ahosīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Upanandasakyaputtattheravatthu dutiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Padhānikatissattheravatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attānañce"
      },
      "ti ",
      " imaṃ dhammadesanaṃ satthā jetavane viharanto padhānikatissattheraṃ ārabbha kathesi."
    ],
    "innerText": "Attānañceti imaṃ dhammadesanaṃ satthā jetavane viharanto padhānikatissattheraṃ ārabbha kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "So kira satthu santike kammaṭṭhānaṃ gahetvā pañcasate bhikkhū ādāya araññe vassaṃ upagantvā, ‘‘āvuso, dharamānakassa buddhassa santike vo kammaṭṭhānaṃ gahitaṃ, appamattāva samaṇadhammaṃ karothā’’ti ovaditvā sayaṃ gantvā nipajjitvā supati. Te bhikkhū paṭhamayāme caṅkamitvā majjhimayāme vihāraṃ pavisanti. So niddāyitvā pabuddhakāle tesaṃ santikaṃ gantvā ‘‘kiṃ tumhe ‘nipajjitvā niddāyissāmā’ti āgatā, sīghaṃ nikkhamitvā ",
      " samaṇadhammaṃ karothā’’ti vatvā sayaṃ gantvā tatheva supati. Itare majjhimayāme bahi caṅkamitvā pacchimayāme vihāraṃ pavisanti. So punapi pabujjhitvā tesaṃ santikaṃ gantvā te vihārā nīharitvā sayaṃ puna gantvā tatheva supati. Tasmiṃ niccakālaṃ evaṃ karonte te bhikkhū sajjhāyaṃ vā kammaṭṭhānaṃ ",
      " vā manasikātuṃ nāsakkhiṃsu, cittaṃ aññathattaṃ agamāsi. Te ‘‘amhākaṃ ācariyo ativiya āraddhavīriyo, pariggaṇhissāma na’’nti pariggaṇhantā tassa kiriyaṃ disvā ‘‘naṭṭhamhā, āvuso, ācariyo no tuccharavaṃ ravatī’’ti vadiṃsu. Tesaṃ ativiya niddāya kilamantānaṃ ekabhikkhupi visesaṃ nibbattetuṃ nāsakkhi. Te vuṭṭhavassā satthu santikaṃ gantvā satthārā katapaṭisanthārā ‘‘kiṃ, bhikkhave, appamattā hutvā samaṇadhammaṃ karitthā’’ti pucchitā tamatthaṃ ārocesuṃ. Satthā ‘‘na, bhikkhave, idāneva, pubbepesa tumhākaṃ antarāyamakāsiyevā’’ti vatvā tehi yācito –"
    ],
    "innerText": "So kira satthu santike kammaṭṭhānaṃ gahetvā pañcasate bhikkhū ādāya araññe vassaṃ upagantvā, ‘‘āvuso, dharamānakassa buddhassa santike vo kammaṭṭhānaṃ gahitaṃ, appamattāva samaṇadhammaṃ karothā’’ti ovaditvā sayaṃ gantvā nipajjitvā supati. Te bhikkhū paṭhamayāme caṅkamitvā majjhimayāme vihāraṃ pavisanti. So niddāyitvā pabuddhakāle tesaṃ santikaṃ gantvā ‘‘kiṃ tumhe ‘nipajjitvā niddāyissāmā’ti āgatā, sīghaṃ nikkhamitvā samaṇadhammaṃ karothā’’ti vatvā sayaṃ gantvā tatheva supati. Itare majjhimayāme bahi caṅkamitvā pacchimayāme vihāraṃ pavisanti. So punapi pabujjhitvā tesaṃ santikaṃ gantvā te vihārā nīharitvā sayaṃ puna gantvā tatheva supati. Tasmiṃ niccakālaṃ evaṃ karonte te bhikkhū sajjhāyaṃ vā kammaṭṭhānaṃ vā manasikātuṃ nāsakkhiṃsu, cittaṃ aññathattaṃ agamāsi. Te ‘‘amhākaṃ ācariyo ativiya āraddhavīriyo, pariggaṇhissāma na’’nti pariggaṇhantā tassa kiriyaṃ disvā ‘‘naṭṭhamhā, āvuso, ācariyo no tuccharavaṃ ravatī’’ti vadiṃsu. Tesaṃ ativiya niddāya kilamantānaṃ ekabhikkhupi visesaṃ nibbattetuṃ nāsakkhi. Te vuṭṭhavassā satthu santikaṃ gantvā satthārā katapaṭisanthārā ‘‘kiṃ, bhikkhave, appamattā hutvā samaṇadhammaṃ karitthā’’ti pucchitā tamatthaṃ ārocesuṃ. Satthā ‘‘na, bhikkhave, idāneva, pubbepesa tumhākaṃ antarāyamakāsiyevā’’ti vatvā tehi yācito –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Amātāpitarasaṃvaḍḍho, anācerakule vasaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nāyaṃ kālaṃ akālaṃ vā, abhijānāti kukkuṭo’’ti. (jā. 1.1.119) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Imaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "akālarāvikukkuṭajātakaṃ"
      },
      " vitthāretvā kathesi. ‘‘Tadā hi so kukkuṭo ayaṃ padhānikatissatthero ahosi, ime pañca satā bhikkhū te māṇavā ahesuṃ, disāpāmokkho ācariyo ahamevā’’ti satthā imaṃ jātakaṃ vitthāretvā, ‘‘bhikkhave, paraṃ ovadantena nāma attā sudanto kātabbo. Evaṃ ovadanto hi ",
      " sudanto hutvā dameti nāmā’’ti vatvā imaṃ gāthamāha –"
    ],
    "innerText": "Imaṃ akālarāvikukkuṭajātakaṃ vitthāretvā kathesi. ‘‘Tadā hi so kukkuṭo ayaṃ padhānikatissatthero ahosi, ime pañca satā bhikkhū te māṇavā ahesuṃ, disāpāmokkho ācariyo ahamevā’’ti satthā imaṃ jātakaṃ vitthāretvā, ‘‘bhikkhave, paraṃ ovadantena nāma attā sudanto kātabbo. Evaṃ ovadanto hi sudanto hutvā dameti nāmā’’ti vatvā imaṃ gāthamāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "159"
      },
      "."
    ],
    "innerText": "159."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " ‘‘Attānañce ",
      " tathā kayirā, yathāññamanusāsati;"
    ],
    "innerText": "‘‘Attānañce tathā kayirā, yathāññamanusāsati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sudanto vata dametha, attā hi kira duddamo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tassattho – yo hi bhikkhu ‘‘paṭhamayāmādīsu caṅkamitabba’’nti vatvā paraṃ ovadati, sayaṃ caṅkamanādīni adhiṭṭhahanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "attānañce tathā kayirā, yathāññamanusāsati,"
      },
      " evaṃ sante ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sudanto vata damethā"
      },
      "ti yena guṇena paraṃ anusāsati, tena attanā sudanto hutvā dameyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attā hi kira duddamo"
      },
      "ti ayañhi attā nāma duddamo. Tasmā yathā so sudanto hoti, tathā dametabboti."
    ],
    "innerText": "Tassattho – yo hi bhikkhu ‘‘paṭhamayāmādīsu caṅkamitabba’’nti vatvā paraṃ ovadati, sayaṃ caṅkamanādīni adhiṭṭhahanto attānañce tathā kayirā, yathāññamanusāsati, evaṃ sante sudanto vata damethāti yena guṇena paraṃ anusāsati, tena attanā sudanto hutvā dameyya. Attā hi kira duddamoti ayañhi attā nāma duddamo. Tasmā yathā so sudanto hoti, tathā dametabboti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Desanāvasāne pañca satāpi te bhikkhū arahattaṃ pāpuṇiṃsūti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Padhānikatissattheravatthu tatiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Kumārakassapamātutherīvatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hi attano nātho"
      },
      "ti imaṃ dhammadesanaṃ satthā jetavane viharanto kumārakassapattherassa mātaraṃ ārabbha kathesi."
    ],
    "innerText": "Attāhi attano nāthoti imaṃ dhammadesanaṃ satthā jetavane viharanto kumārakassapattherassa mātaraṃ ārabbha kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sā kira rājagahanagare seṭṭhidhītā viññutaṃ pattakālato paṭṭhāya pabbajjaṃ yāci. Atha sā punappunaṃ yācamānāpi mātāpitūnaṃ santikā pabbajjaṃ alabhitvā vayappattā ",
      " patikulaṃ gantvā patidevatā hutvā agāraṃ ajjhāvasi. Athassā na cirasseva kucchismiṃ gabbho patiṭṭhahi. Sā gabbhassa patiṭṭhitabhāvaṃ ajānitvāva sāmikaṃ ārādhetvā pabbajjaṃ yāci. Atha naṃ so mahantena sakkārena bhikkhunupassayaṃ netvā ajānanto devadattapakkhikānaṃ bhikkhunīnaṃ santike pabbājesi. Aparena samayena bhikkhuniyo tassā gabbhinibhāvaṃ ñatvā tāhi ‘‘kiṃ ida’’nti vuttā nāhaṃ, ayye, jānāmi ‘‘kimetaṃ’’, sīlaṃ vata me arogamevāti. Bhikkhuniyo taṃ devadattassa santikaṃ netvā ‘‘ayaṃ bhikkhunī saddhāpabbajitā, imissā mayaṃ gabbhassa patiṭṭhitabhāvaṃ jānāma, kālaṃ na jānāma, kiṃ dāni karomā’’ti pucchiṃsu. Devadatto ‘‘mā mayhaṃ ovādakārikānaṃ bhikkhunīnaṃ ayaso uppajjatū’’ti ettakameva cintetvā ‘‘uppabbājetha na’’nti āha. Taṃ sutvā sā daharā mā maṃ, ayye, nāsetha, nāhaṃ devadattaṃ uddissa pabbajitā, etha, maṃ satthu santikaṃ jetavanaṃ nethāti. Tā taṃ ādāya jetavanaṃ gantvā satthu ",
      " ārocesuṃ. Satthā ‘‘tassā gihikāle gabbho patiṭṭhito’’ti jānantopi paravādamocanatthaṃ rājānaṃ pasenadikosalaṃ mahāanāthapiṇḍikaṃ cūḷaanāthapiṇḍikaṃ visākhāupāsikaṃ aññāni ca mahākulāni pakkosāpetvā upālittheraṃ āṇāpesi – ‘‘gaccha, imissā daharāya bhikkhuniyā catuparisamajjhe kammaṃ parisodhehī’’ti. Thero rañño purato visākhaṃ pakkosāpetvā taṃ adhikaraṇaṃ paṭicchāpesi. Sā sāṇipākāraṃ parikkhipāpetvā antosāṇiyaṃ tassā hatthapādanābhiudarapariyosānāni ",
      " oloketvā māsadivase samānetvā ‘‘gihibhāve imāya gabbho laddho’’ti ñatvā therassa tamatthaṃ ārocesi. Athassā thero parisamajjhe parisuddhabhāvaṃ patiṭṭhāpesi. Sā aparena samayena padumuttarabuddhassa pādamūle patthitapatthanaṃ mahānubhāvaṃ puttaṃ vijāyi."
    ],
    "innerText": "Sā kira rājagahanagare seṭṭhidhītā viññutaṃ pattakālato paṭṭhāya pabbajjaṃ yāci. Atha sā punappunaṃ yācamānāpi mātāpitūnaṃ santikā pabbajjaṃ alabhitvā vayappattā patikulaṃ gantvā patidevatā hutvā agāraṃ ajjhāvasi. Athassā na cirasseva kucchismiṃ gabbho patiṭṭhahi. Sā gabbhassa patiṭṭhitabhāvaṃ ajānitvāva sāmikaṃ ārādhetvā pabbajjaṃ yāci. Atha naṃ so mahantena sakkārena bhikkhunupassayaṃ netvā ajānanto devadattapakkhikānaṃ bhikkhunīnaṃ santike pabbājesi. Aparena samayena bhikkhuniyo tassā gabbhinibhāvaṃ ñatvā tāhi ‘‘kiṃ ida’’nti vuttā nāhaṃ, ayye, jānāmi ‘‘kimetaṃ’’, sīlaṃ vata me arogamevāti. Bhikkhuniyo taṃ devadattassa santikaṃ netvā ‘‘ayaṃ bhikkhunī saddhāpabbajitā, imissā mayaṃ gabbhassa patiṭṭhitabhāvaṃ jānāma, kālaṃ na jānāma, kiṃ dāni karomā’’ti pucchiṃsu. Devadatto ‘‘mā mayhaṃ ovādakārikānaṃ bhikkhunīnaṃ ayaso uppajjatū’’ti ettakameva cintetvā ‘‘uppabbājetha na’’nti āha. Taṃ sutvā sā daharā mā maṃ, ayye, nāsetha, nāhaṃ devadattaṃ uddissa pabbajitā, etha, maṃ satthu santikaṃ jetavanaṃ nethāti. Tā taṃ ādāya jetavanaṃ gantvā satthu ārocesuṃ. Satthā ‘‘tassā gihikāle gabbho patiṭṭhito’’ti jānantopi paravādamocanatthaṃ rājānaṃ pasenadikosalaṃ mahāanāthapiṇḍikaṃ cūḷaanāthapiṇḍikaṃ visākhāupāsikaṃ aññāni ca mahākulāni pakkosāpetvā upālittheraṃ āṇāpesi – ‘‘gaccha, imissā daharāya bhikkhuniyā catuparisamajjhe kammaṃ parisodhehī’’ti. Thero rañño purato visākhaṃ pakkosāpetvā taṃ adhikaraṇaṃ paṭicchāpesi. Sā sāṇipākāraṃ parikkhipāpetvā antosāṇiyaṃ tassā hatthapādanābhiudarapariyosānāni oloketvā māsadivase samānetvā ‘‘gihibhāve imāya gabbho laddho’’ti ñatvā therassa tamatthaṃ ārocesi. Athassā thero parisamajjhe parisuddhabhāvaṃ patiṭṭhāpesi. Sā aparena samayena padumuttarabuddhassa pādamūle patthitapatthanaṃ mahānubhāvaṃ puttaṃ vijāyi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Athekadivasaṃ ",
      " rājā bhikkhunupassayasamīpena gacchanto dārakasaddaṃ sutvā ‘‘kiṃ ida’’nti pucchitvā, ‘‘deva, ekissā bhikkhuniyā putto jāto, tassesa saddo’’ti vutte taṃ kumāraṃ attano gharaṃ netvā dhātīnaṃ adāsi. Nāmaggahaṇadivase cassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kassapo"
      },
      "ti nāmaṃ katvā kumāraparihārena vaḍḍhitattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kumārakassapo"
      },
      "ti sañjāniṃsu. So kīḷāmaṇḍale dārake paharitvā ‘‘nimmātāpitikenamhā pahaṭā’’ti vutte rājānaṃ upasaṅkamitvā, ‘‘deva, maṃ ‘nimmātāpitiko’ti vadanti, mātaraṃ me ācikkhathā’’ti pucchitvā raññā dhātiyo dassetvā ‘‘imā te mātaro’’ti vutte ‘‘na ettikā me mātaro, ekāya me mātarā bhavitabbaṃ, taṃ me ācikkhathā’’ti āha. Rājā ‘‘na sakkā imaṃ vañcetu’’nti cintetvā, tāta, tava mātā bhikkhunī, tvaṃ mayā bhikkhunupassayā ānītoti. So tāvatakeneva samuppannasaṃvego hutvā, ‘‘tāta, pabbājetha ma’’nti āha. Rājā ‘‘sādhu, tātā’’ti taṃ mahantena sakkārena satthu santike pabbājesi. So laddhūpasampado ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kumārakassapatthero"
      },
      "ti paññāyi. So satthu santike kammaṭṭhānaṃ gahetvā araññaṃ pavisitvā vāyamitvā visesaṃ nibbattetuṃ asakkonto ‘‘puna kammaṭṭhānaṃ visesetvā gahessāmī’’ti satthu santikaṃ gantvā andhavane vihāsi."
    ],
    "innerText": "Athekadivasaṃ rājā bhikkhunupassayasamīpena gacchanto dārakasaddaṃ sutvā ‘‘kiṃ ida’’nti pucchitvā, ‘‘deva, ekissā bhikkhuniyā putto jāto, tassesa saddo’’ti vutte taṃ kumāraṃ attano gharaṃ netvā dhātīnaṃ adāsi. Nāmaggahaṇadivase cassa kassapoti nāmaṃ katvā kumāraparihārena vaḍḍhitattā kumārakassapoti sañjāniṃsu. So kīḷāmaṇḍale dārake paharitvā ‘‘nimmātāpitikenamhā pahaṭā’’ti vutte rājānaṃ upasaṅkamitvā, ‘‘deva, maṃ ‘nimmātāpitiko’ti vadanti, mātaraṃ me ācikkhathā’’ti pucchitvā raññā dhātiyo dassetvā ‘‘imā te mātaro’’ti vutte ‘‘na ettikā me mātaro, ekāya me mātarā bhavitabbaṃ, taṃ me ācikkhathā’’ti āha. Rājā ‘‘na sakkā imaṃ vañcetu’’nti cintetvā, tāta, tava mātā bhikkhunī, tvaṃ mayā bhikkhunupassayā ānītoti. So tāvatakeneva samuppannasaṃvego hutvā, ‘‘tāta, pabbājetha ma’’nti āha. Rājā ‘‘sādhu, tātā’’ti taṃ mahantena sakkārena satthu santike pabbājesi. So laddhūpasampado kumārakassapattheroti paññāyi. So satthu santike kammaṭṭhānaṃ gahetvā araññaṃ pavisitvā vāyamitvā visesaṃ nibbattetuṃ asakkonto ‘‘puna kammaṭṭhānaṃ visesetvā gahessāmī’’ti satthu santikaṃ gantvā andhavane vihāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha naṃ kassapabuddhakāle ekato samaṇadhammaṃ katvā anāgāmiphalaṃ patvā brahmaloke nibbattabhikkhu brahmalokato āgantvā pannarasa pañhe pucchitvā ",
      " ‘‘ime pañhe ṭhapetvā satthāraṃ añño byākātuṃ samattho nāma natthi, gaccha, satthu santike imesaṃ atthaṃ uggaṇhā’’ti uyyojesi. So tathā katvā pañhavissajjanāvasāne arahattaṃ pāpuṇi. Tassa pana nikkhantadivasato paṭṭhāya dvādasa vassāni mātubhikkhuniyā akkhīhi assūni pavattiṃsu. Sā puttaviyogadukkhitā assutinteneva mukhena bhikkhāya caramānā antaravīthiyaṃ theraṃ disvāva, ‘‘putta ",
      ", puttā’’ti viravantī taṃ gaṇhituṃ upadhāvamānā parivattitvā pati. Sā thanehi khīraṃ muñcantehi uṭṭhahitvā allacīvarā gantvā theraṃ gaṇhi. So cintesi – ‘‘sacāyaṃ mama santikā madhuravacanaṃ labhissati, vinassissati. Thaddhameva katvā imāya saddhiṃ sallapissāmī’’ti. Atha naṃ āha – ‘‘kiṃ karontī vicarasi, sinehamattampi chindituṃ na sakkosī’’ti. Sā ‘‘aho kakkhaḷā therassa ",
      " kathā’’ti cintetvā ‘‘kiṃ vadesi, tātā’’ti vatvā punapi tena tatheva vuttā cintesi – ‘‘ahaṃ imassa kāraṇā dvādasa vassāni assūni sandhāretuṃ na sakkomi, ayaṃ panevaṃ thaddhahadayo, kiṃ me iminā’’ti puttasinehaṃ chinditvā taṃdivasameva arahattaṃ pāpuṇi."
    ],
    "innerText": "Atha naṃ kassapabuddhakāle ekato samaṇadhammaṃ katvā anāgāmiphalaṃ patvā brahmaloke nibbattabhikkhu brahmalokato āgantvā pannarasa pañhe pucchitvā ‘‘ime pañhe ṭhapetvā satthāraṃ añño byākātuṃ samattho nāma natthi, gaccha, satthu santike imesaṃ atthaṃ uggaṇhā’’ti uyyojesi. So tathā katvā pañhavissajjanāvasāne arahattaṃ pāpuṇi. Tassa pana nikkhantadivasato paṭṭhāya dvādasa vassāni mātubhikkhuniyā akkhīhi assūni pavattiṃsu. Sā puttaviyogadukkhitā assutinteneva mukhena bhikkhāya caramānā antaravīthiyaṃ theraṃ disvāva, ‘‘putta , puttā’’ti viravantī taṃ gaṇhituṃ upadhāvamānā parivattitvā pati. Sā thanehi khīraṃ muñcantehi uṭṭhahitvā allacīvarā gantvā theraṃ gaṇhi. So cintesi – ‘‘sacāyaṃ mama santikā madhuravacanaṃ labhissati, vinassissati. Thaddhameva katvā imāya saddhiṃ sallapissāmī’’ti. Atha naṃ āha – ‘‘kiṃ karontī vicarasi, sinehamattampi chindituṃ na sakkosī’’ti. Sā ‘‘aho kakkhaḷā therassa kathā’’ti cintetvā ‘‘kiṃ vadesi, tātā’’ti vatvā punapi tena tatheva vuttā cintesi – ‘‘ahaṃ imassa kāraṇā dvādasa vassāni assūni sandhāretuṃ na sakkomi, ayaṃ panevaṃ thaddhahadayo, kiṃ me iminā’’ti puttasinehaṃ chinditvā taṃdivasameva arahattaṃ pāpuṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aparena samayena dhammasabhāyaṃ kathaṃ samuṭṭhāpesuṃ – ‘‘āvuso, devadattena evaṃ upanissayasampanno kumārakassapo ca therī ca nāsitā, satthā pana tesaṃ patiṭṭhā jāto, aho buddhā nāma lokānukampakā’’ti ",
      ". Satthā āgantvā ‘‘kāya nuttha, bhikkhave, etarahi kathāya sannisinnā’’ti pucchitvā ‘‘imāya nāmā’’ti vutte ‘‘na, bhikkhave, idāneva ahaṃ imesaṃ paccayo patiṭṭhā jāto, pubbepi nesaṃ ahaṃ patiṭṭhā ahosiṃyevā’’ti vatvā –"
    ],
    "innerText": "Aparena samayena dhammasabhāyaṃ kathaṃ samuṭṭhāpesuṃ – ‘‘āvuso, devadattena evaṃ upanissayasampanno kumārakassapo ca therī ca nāsitā, satthā pana tesaṃ patiṭṭhā jāto, aho buddhā nāma lokānukampakā’’ti . Satthā āgantvā ‘‘kāya nuttha, bhikkhave, etarahi kathāya sannisinnā’’ti pucchitvā ‘‘imāya nāmā’’ti vutte ‘‘na, bhikkhave, idāneva ahaṃ imesaṃ paccayo patiṭṭhā jāto, pubbepi nesaṃ ahaṃ patiṭṭhā ahosiṃyevā’’ti vatvā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Nigrodhameva seveyya, na sākhamupasaṃvase;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nigrodhasmiṃ mataṃ seyyo, yañce sākhasmi jīvita’’nti. (jā. 1.1.12; 1.10.81) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Imaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nigrodhajātakaṃ"
      },
      " vitthārena kathetvā ‘‘tadā sākhamigo devadatto ahosi, parisāpissa devadattaparisā, vārappattā migadhenu therī ahosi, putto kumārakassapo, gabbhinīmigiyā jīvitaṃ pariccajitvā gato nigrodhamigarājā pana ahamevā’’ti jātakaṃ samodhānetvā puttasinehaṃ chinditvā theriyā attanāva attano patiṭṭhānakatabhāvaṃ pakāsento, ‘‘bhikkhave, yasmā parassa attani ṭhitena saggaparāyaṇena vā maggaparāyaṇena vā bhavituṃ na sakkā, tasmā attāva attano nātho, paro kiṃ karissatī’’ti vatvā imaṃ gāthamāha –"
    ],
    "innerText": "Imaṃ nigrodhajātakaṃ vitthārena kathetvā ‘‘tadā sākhamigo devadatto ahosi, parisāpissa devadattaparisā, vārappattā migadhenu therī ahosi, putto kumārakassapo, gabbhinīmigiyā jīvitaṃ pariccajitvā gato nigrodhamigarājā pana ahamevā’’ti jātakaṃ samodhānetvā puttasinehaṃ chinditvā theriyā attanāva attano patiṭṭhānakatabhāvaṃ pakāsento, ‘‘bhikkhave, yasmā parassa attani ṭhitena saggaparāyaṇena vā maggaparāyaṇena vā bhavituṃ na sakkā, tasmā attāva attano nātho, paro kiṃ karissatī’’ti vatvā imaṃ gāthamāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "160"
      },
      "."
    ],
    "innerText": "160."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Attā hi attano nātho, ko hi nātho paro siyā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Attanā hi sudantena, nāthaṃ labhati dullabha’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nātho"
      },
      "ti patiṭṭhā. Idaṃ vuttaṃ hoti – yasmā attani ṭhitena attasampannena kusalaṃ katvā ",
      " saggaṃ vā pāpuṇituṃ, maggaṃ vā bhāvetuṃ, phalaṃ vā sacchikātuṃ sakkā ",
      ". Tasmā hi attāva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "attano"
      },
      " patiṭṭhā hoti, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paro ko"
      },
      " nāma kassa patiṭṭhā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "siyā. Attanā"
      },
      " eva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hi sudantena"
      },
      " nibbisevanena ",
      " arahattaphalasaṅkhātaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dullabhaṃ nāthaṃ labhati"
      },
      ". Arahattañhi sandhāya idha ‘‘nāthaṃ labhati dullabha’’nti vuttaṃ."
    ],
    "innerText": "Tattha nāthoti patiṭṭhā. Idaṃ vuttaṃ hoti – yasmā attani ṭhitena attasampannena kusalaṃ katvā saggaṃ vā pāpuṇituṃ, maggaṃ vā bhāvetuṃ, phalaṃ vā sacchikātuṃ sakkā . Tasmā hi attāva attano patiṭṭhā hoti, paro ko nāma kassa patiṭṭhā siyā. Attanā eva hi sudantena nibbisevanena arahattaphalasaṅkhātaṃ dullabhaṃ nāthaṃ labhati. Arahattañhi sandhāya idha ‘‘nāthaṃ labhati dullabha’’nti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Desanāvasāne bahū sotāpattiphalādīni pāpuṇiṃsūti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Kumārakassapamātutherīvatthu catutthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Mahākālaupāsakavatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attanā hi kataṃ pāpa"
      },
      "nti imaṃ dhammadesanaṃ satthā jetavane viharanto ekaṃ mahākālaṃ nāma sotāpannaupāsakaṃ ārabbha kathesi."
    ],
    "innerText": "Attanā hi kataṃ pāpanti imaṃ dhammadesanaṃ satthā jetavane viharanto ekaṃ mahākālaṃ nāma sotāpannaupāsakaṃ ārabbha kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "So kira māsassa aṭṭhadivasesu uposathiko hutvā vihāre sabbarattiṃ dhammakathaṃ suṇāti. Atha rattiṃ corā ekasmiṃ gehe sandhiṃ chinditvā bhaṇḍakaṃ gahetvā lohabhājanasaddena pabuddhehi sāmikehi anubaddhā gahitabhaṇḍaṃ chaḍḍetvā palāyiṃsu. Sāmikāpi te anubandhiṃsuyeva, te disā pakkhandiṃsu. Eko pana vihāramaggaṃ gahetvā mahākālassa rattiṃ dhammakathaṃ sutvā pātova pokkharaṇitīre mukhaṃ dhovantassa purato bhaṇḍikaṃ chaḍḍetvā palāyi. Core anubandhitvā āgatamanussā bhaṇḍikaṃ disvā ‘‘tvaṃ no gehasandhiṃ chinditvā bhaṇḍikaṃ haritvā dhammaṃ suṇanto viya vicarasī’’ti ",
      " taṃ gahetvā pothetvā māretvā chaḍḍetvā agamiṃsu. Atha naṃ pātova pānīyaghaṭaṃ ādāya gatā daharasāmaṇerā disvā ‘‘vihāre dhammakathaṃ sutvā sayitaupāsako ayuttaṃ maraṇaṃ labhatī’’ti vatvā satthu ārocesuṃ. Satthā ‘‘āma, bhikkhave, imasmiṃ attabhāve kālena appatirūpaṃ maraṇaṃ laddhaṃ, pubbe katakammassa pana tena yuttameva laddha’’nti vatvā tehi yācito tassa pubbakammaṃ kathesi –"
    ],
    "innerText": "So kira māsassa aṭṭhadivasesu uposathiko hutvā vihāre sabbarattiṃ dhammakathaṃ suṇāti. Atha rattiṃ corā ekasmiṃ gehe sandhiṃ chinditvā bhaṇḍakaṃ gahetvā lohabhājanasaddena pabuddhehi sāmikehi anubaddhā gahitabhaṇḍaṃ chaḍḍetvā palāyiṃsu. Sāmikāpi te anubandhiṃsuyeva, te disā pakkhandiṃsu. Eko pana vihāramaggaṃ gahetvā mahākālassa rattiṃ dhammakathaṃ sutvā pātova pokkharaṇitīre mukhaṃ dhovantassa purato bhaṇḍikaṃ chaḍḍetvā palāyi. Core anubandhitvā āgatamanussā bhaṇḍikaṃ disvā ‘‘tvaṃ no gehasandhiṃ chinditvā bhaṇḍikaṃ haritvā dhammaṃ suṇanto viya vicarasī’’ti taṃ gahetvā pothetvā māretvā chaḍḍetvā agamiṃsu. Atha naṃ pātova pānīyaghaṭaṃ ādāya gatā daharasāmaṇerā disvā ‘‘vihāre dhammakathaṃ sutvā sayitaupāsako ayuttaṃ maraṇaṃ labhatī’’ti vatvā satthu ārocesuṃ. Satthā ‘‘āma, bhikkhave, imasmiṃ attabhāve kālena appatirūpaṃ maraṇaṃ laddhaṃ, pubbe katakammassa pana tena yuttameva laddha’’nti vatvā tehi yācito tassa pubbakammaṃ kathesi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atīte kira bārāṇasirañño vijite ekassa paccantagāmassa aṭavimukhe corā paharanti. Rājā aṭavimukhe ekaṃ rājabhaṭaṃ ṭhapesi, so bhatiṃ gahetvā manusse orato pāraṃ neti, pārato oraṃ āneti. Atheko manusso abhirūpaṃ attano bhariyaṃ cūḷayānakaṃ āropetvā ",
      " taṃ ṭhānaṃ agamāsi. Rājabhaṭo taṃ itthiṃ disvāva sañjātasineho tena ‘‘aṭaviṃ no ",
      ", sāmi, atikkāmehī’’ti vuttepi ‘‘idāni vikālo, pātova atikkāmessāmī’’ti āha. So sakālo, sāmi, idāneva no nehīti. Nivatta, bho, amhākaṃyeva gehe āhāro ca nivāso ca bhavissatīti. So neva nivattituṃ icchi. Itaro purisānaṃ saññaṃ datvā yānakaṃ nivattāpetvā anicchantasseva dvārakoṭṭhake nivāsaṃ datvā āhāraṃ paṭiyādāpesi. Tassa pana gehe ekaṃ maṇiratanaṃ atthi. So taṃ tassa yānakantare pakkhipāpetvā paccūsakāle corānaṃ paviṭṭhasaddaṃ kāresi. Athassa purisā ‘‘maṇiratanaṃ, sāmi, corehi haṭa’’nti ārocesuṃ. So gāmadvāresu ārakkhaṃ ṭhapetvā ‘‘antogāmato nikkhamante vicinathā’’ti āha. Itaropi pātova yānakaṃ yojetvā ",
      " pāyāsi. Athassa yānakaṃ sodhentā attanā ṭhapitaṃ maṇiratanaṃ disvā santajjetvā ‘‘tvaṃ maṇiṃ gahetvā palāyasī’’ti pothetvā ‘‘gahito no, sāmi, coro’’ti gāmabhojakassa dassesuṃ. So ‘‘bhatakassa vata me gehe nivāsaṃ datvā bhattaṃ dinnaṃ, maṇiṃ gahetvā gato, gaṇhatha naṃ pāpapurisa’’nti pothāpetvā māretvā chaḍḍāpesi. Idaṃ tassa pubbakammaṃ. So tato cuto avīcimhi nibbattitvā tattha dīgharattaṃ paccitvā vipākāvasesena attabhāvasate tatheva pothito maraṇaṃ pāpuṇi."
    ],
    "innerText": "Atīte kira bārāṇasirañño vijite ekassa paccantagāmassa aṭavimukhe corā paharanti. Rājā aṭavimukhe ekaṃ rājabhaṭaṃ ṭhapesi, so bhatiṃ gahetvā manusse orato pāraṃ neti, pārato oraṃ āneti. Atheko manusso abhirūpaṃ attano bhariyaṃ cūḷayānakaṃ āropetvā taṃ ṭhānaṃ agamāsi. Rājabhaṭo taṃ itthiṃ disvāva sañjātasineho tena ‘‘aṭaviṃ no , sāmi, atikkāmehī’’ti vuttepi ‘‘idāni vikālo, pātova atikkāmessāmī’’ti āha. So sakālo, sāmi, idāneva no nehīti. Nivatta, bho, amhākaṃyeva gehe āhāro ca nivāso ca bhavissatīti. So neva nivattituṃ icchi. Itaro purisānaṃ saññaṃ datvā yānakaṃ nivattāpetvā anicchantasseva dvārakoṭṭhake nivāsaṃ datvā āhāraṃ paṭiyādāpesi. Tassa pana gehe ekaṃ maṇiratanaṃ atthi. So taṃ tassa yānakantare pakkhipāpetvā paccūsakāle corānaṃ paviṭṭhasaddaṃ kāresi. Athassa purisā ‘‘maṇiratanaṃ, sāmi, corehi haṭa’’nti ārocesuṃ. So gāmadvāresu ārakkhaṃ ṭhapetvā ‘‘antogāmato nikkhamante vicinathā’’ti āha. Itaropi pātova yānakaṃ yojetvā pāyāsi. Athassa yānakaṃ sodhentā attanā ṭhapitaṃ maṇiratanaṃ disvā santajjetvā ‘‘tvaṃ maṇiṃ gahetvā palāyasī’’ti pothetvā ‘‘gahito no, sāmi, coro’’ti gāmabhojakassa dassesuṃ. So ‘‘bhatakassa vata me gehe nivāsaṃ datvā bhattaṃ dinnaṃ, maṇiṃ gahetvā gato, gaṇhatha naṃ pāpapurisa’’nti pothāpetvā māretvā chaḍḍāpesi. Idaṃ tassa pubbakammaṃ. So tato cuto avīcimhi nibbattitvā tattha dīgharattaṃ paccitvā vipākāvasesena attabhāvasate tatheva pothito maraṇaṃ pāpuṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ satthā mahākālassa pubbakammaṃ dassetvā, ‘‘bhikkhave, evaṃ ime satte attanā katapāpakammameva catūsu apāyesu abhimatthatī’’ti vatvā imaṃ gāthamāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "161"
      },
      "."
    ],
    "innerText": "161."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Attanā hi kataṃ pāpaṃ, attajaṃ attasambhavaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Abhimatthati dummedhaṃ, vajiraṃvasmamayaṃ maṇi’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vajiraṃvasmamayaṃ maṇi"
      },
      "nti vajiraṃva asmamayaṃ maṇiṃ. Idaṃ vuttaṃ hoti – yathā pāsāṇamayaṃ pāsāṇasambhavaṃ vajiraṃ tameva asmamayaṃ maṇiṃ attano uṭṭhānaṭṭhānasaṅkhātaṃ pāsāṇamaṇiṃ khāditvā chiddaṃ chiddaṃ khaṇḍaṃ khaṇḍaṃ katvā aparibhogaṃ karoti, evameva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "attanā kataṃ"
      },
      " attani jātaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "attasambhavaṃ"
      },
      " pāpaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dummedhaṃ"
      },
      " nippaññaṃ puggalaṃ catūsu apāyesu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhimatthati"
      },
      " kantati viddhaṃsetīti."
    ],
    "innerText": "Tattha vajiraṃvasmamayaṃ maṇinti vajiraṃva asmamayaṃ maṇiṃ. Idaṃ vuttaṃ hoti – yathā pāsāṇamayaṃ pāsāṇasambhavaṃ vajiraṃ tameva asmamayaṃ maṇiṃ attano uṭṭhānaṭṭhānasaṅkhātaṃ pāsāṇamaṇiṃ khāditvā chiddaṃ chiddaṃ khaṇḍaṃ khaṇḍaṃ katvā aparibhogaṃ karoti, evameva attanā kataṃ attani jātaṃ attasambhavaṃ pāpaṃ dummedhaṃ nippaññaṃ puggalaṃ catūsu apāyesu abhimatthati kantati viddhaṃsetīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Desanāvasāne sampattabhikkhū sotāpattiphalādīni pāpuṇiṃsūti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Mahākālaupāsakavatthu pañcamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Devadattavatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yassa"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "accantadussīlya"
      },
      "nti imaṃ dhammadesanaṃ satthā veḷuvane viharanto devadattaṃ ārabbha kathesi."
    ],
    "innerText": "Yassaaccantadussīlyanti imaṃ dhammadesanaṃ satthā veḷuvane viharanto devadattaṃ ārabbha kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ekasmiñhi divase bhikkhū dhammasabhāyaṃ kathaṃ samuṭṭhāpesuṃ – ‘‘āvuso, devadatto dussīlo pāpadhammo dussīlyakāraṇena vaḍḍhitāya taṇhāya ajātasattuṃ saṅgaṇhitvā mahantaṃ lābhasakkāraṃ nibbattetvā ajātasattuṃ pituvadhe samādapetvā tena saddhiṃ ekato hutvā nānappakārena tathāgatassa vadhāya parisakkatī’’ti. Satthā āgantvā ‘‘kāya nuttha, bhikkhave, etarahi kathāya sannisinnā’’ti pucchitvā ‘‘imāya nāmā’’ti vutte ‘‘na, bhikkhave, idāneva, pubbepi devadatto nānappakārena mayhaṃ vadhāya parisakkatī’’ti vatvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kuruṅgamigajātakā"
      },
      "dīni (jā. 1.2.111-2) kathetvā, ‘‘bhikkhave, accantadussīlapuggalaṃ nāma dussīlyakāraṇā uppannā taṇhā māluvā viya sālaṃ pariyonandhitvā sambhañjamānā nirayādīsu pakkhipatī’’ti vatvā imaṃ gāthāmāha –"
    ],
    "innerText": "Ekasmiñhi divase bhikkhū dhammasabhāyaṃ kathaṃ samuṭṭhāpesuṃ – ‘‘āvuso, devadatto dussīlo pāpadhammo dussīlyakāraṇena vaḍḍhitāya taṇhāya ajātasattuṃ saṅgaṇhitvā mahantaṃ lābhasakkāraṃ nibbattetvā ajātasattuṃ pituvadhe samādapetvā tena saddhiṃ ekato hutvā nānappakārena tathāgatassa vadhāya parisakkatī’’ti. Satthā āgantvā ‘‘kāya nuttha, bhikkhave, etarahi kathāya sannisinnā’’ti pucchitvā ‘‘imāya nāmā’’ti vutte ‘‘na, bhikkhave, idāneva, pubbepi devadatto nānappakārena mayhaṃ vadhāya parisakkatī’’ti vatvā kuruṅgamigajātakādīni (jā. 1.2.111-2) kathetvā, ‘‘bhikkhave, accantadussīlapuggalaṃ nāma dussīlyakāraṇā uppannā taṇhā māluvā viya sālaṃ pariyonandhitvā sambhañjamānā nirayādīsu pakkhipatī’’ti vatvā imaṃ gāthāmāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "162"
      },
      "."
    ],
    "innerText": "162."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " ‘‘Yassa ",
      " accantadussīlyaṃ, māluvā sālamivotthataṃ;"
    ],
    "innerText": "‘‘Yassa accantadussīlyaṃ, māluvā sālamivotthataṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Karoti so tathattānaṃ, yathā naṃ icchatī diso’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "accantadussīlya"
      },
      "nti ekantadussīlabhāvo. Gihī vā jātito paṭṭhāya dasa akusalakammapathe karonto, pabbajito vā upasampannadivasato paṭṭhāya garukāpattiṃ āpajjamāno accantadussīlo nāma. Idha pana yo dvīsu tīsu attabhāvesu dussīlo, etassa gatiyā āgataṃ dussīlabhāvaṃ sandhāyetaṃ vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dussīlabhāvo"
      },
      "ti cettha dussīlassa cha ",
      " dvārāni nissāya uppannā taṇhā veditabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Māluvā sālamivotthata"
      },
      "nti yassa puggalassa taṃ taṇhāsaṅkhātaṃ dussīlyaṃ yathā nāma māluvā sālaṃ ottharantī deve vassante pattehi udakaṃ sampaṭicchitvā sambhañjanavasena sabbatthakameva pariyonandhati, evaṃ attabhāvaṃ otthataṃ pariyonandhitvā ṭhitaṃ. So māluvāya sambhañjitvā bhūmiyaṃ pātiyamāno rukkho viya tāya dussīlyasaṅkhātāya taṇhāya sambhañjitvā apāyesu pātiyamāno, yathā naṃ anatthakāmo diso icchati, tathā attānaṃ karoti nāmāti attho."
    ],
    "innerText": "Tattha accantadussīlyanti ekantadussīlabhāvo. Gihī vā jātito paṭṭhāya dasa akusalakammapathe karonto, pabbajito vā upasampannadivasato paṭṭhāya garukāpattiṃ āpajjamāno accantadussīlo nāma. Idha pana yo dvīsu tīsu attabhāvesu dussīlo, etassa gatiyā āgataṃ dussīlabhāvaṃ sandhāyetaṃ vuttaṃ. Dussīlabhāvoti cettha dussīlassa cha dvārāni nissāya uppannā taṇhā veditabbā. Māluvā sālamivotthatanti yassa puggalassa taṃ taṇhāsaṅkhātaṃ dussīlyaṃ yathā nāma māluvā sālaṃ ottharantī deve vassante pattehi udakaṃ sampaṭicchitvā sambhañjanavasena sabbatthakameva pariyonandhati, evaṃ attabhāvaṃ otthataṃ pariyonandhitvā ṭhitaṃ. So māluvāya sambhañjitvā bhūmiyaṃ pātiyamāno rukkho viya tāya dussīlyasaṅkhātāya taṇhāya sambhañjitvā apāyesu pātiyamāno, yathā naṃ anatthakāmo diso icchati, tathā attānaṃ karoti nāmāti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Desanāvasāne bahū sotāpattiphalādīni pāpuṇiṃsūti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Devadattavatthu chaṭṭhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Saṅghabhedaparisakkanavatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sukarānī"
      },
      "ti ",
      " imaṃ dhammadesanaṃ satthā veḷuvane viharanto saṅghabhedaparisakkanaṃ ārabbha kathesi."
    ],
    "innerText": "Sukarānīti imaṃ dhammadesanaṃ satthā veḷuvane viharanto saṅghabhedaparisakkanaṃ ārabbha kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ekadivasañhi devadatto saṅghabhedāya parisakkanto āyasmantaṃ ānandaṃ piṇḍāya carantaṃ disvā attano adhippāyaṃ ārocesi. Taṃ sutvā thero satthu santikaṃ gantvā bhagavantaṃ etadavoca – ‘‘idhāhaṃ, bhante, pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya rājagahaṃ piṇḍāya pāvisiṃ. Addasā kho maṃ, bhante, devadatto rājagahe piṇḍāya carantaṃ. Disvā yenāhaṃ tenupasaṅkami, upasaṅkamitvā maṃ etadavoca – ‘ajjatagge dānāhaṃ, āvuso ānanda, aññatreva bhagavatā aññatra bhikkhusaṅghena uposathaṃ karissāmi saṅghakammañcā’ti. Ajja bhagavā devadatto saṅghaṃ bhindissati, uposathañca karissati saṅghakammāni cā’’ti. Evaṃ vutte satthā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sukaraṃ sādhunā sādhu, sādhu pāpena dukkaraṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pāpaṃ pāpena sukaraṃ, pāpamariyehi dukkara’’nti. (udā. 48) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Imaṃ ",
      " udānaṃ udānetvā, ‘‘ānanda, attano ahitakammaṃ nāma sukaraṃ, hitakammameva dukkara’’nti vatvā imaṃ gāthamāha –"
    ],
    "innerText": "Imaṃ udānaṃ udānetvā, ‘‘ānanda, attano ahitakammaṃ nāma sukaraṃ, hitakammameva dukkara’’nti vatvā imaṃ gāthamāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "163"
      },
      "."
    ],
    "innerText": "163."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sukarāni asādhūni, attano ahitāni ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yaṃ ve hitañca sādhuñca, taṃ ve paramadukkara’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tassattho – yāni kammāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asādhūni"
      },
      " sāvajjāni apāyasaṃvattanikattāyeva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "attano ahitāni ca"
      },
      " honti, tāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sukarāni"
      },
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yaṃ"
      },
      " pana sugatisaṃvattanikattā attano ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hitañca"
      },
      " anavajjatthena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sādhuñca"
      },
      " sugatisaṃvattanikañceva nibbānasaṃvattanikañca kammaṃ, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "taṃ"
      },
      " pācīnaninnāya gaṅgāya ubbattetvā pacchāmukhakaraṇaṃ viya atidukkaranti."
    ],
    "innerText": "Tassattho – yāni kammāni asādhūni sāvajjāni apāyasaṃvattanikattāyeva attano ahitāni ca honti, tāni sukarāni. Yaṃ pana sugatisaṃvattanikattā attano hitañca anavajjatthena sādhuñca sugatisaṃvattanikañceva nibbānasaṃvattanikañca kammaṃ, taṃ pācīnaninnāya gaṅgāya ubbattetvā pacchāmukhakaraṇaṃ viya atidukkaranti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Desanāvasāne bahū sotāpattiphalādīni pāpuṇiṃsūti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Saṅghabhedaparisakkanavatthu sattamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Kālattheravatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yo"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sāsana"
      },
      "nti imaṃ dhammadesanaṃ satthā jetavane viharanto kālattheraṃ ārabbha kathesi."
    ],
    "innerText": "Yosāsananti imaṃ dhammadesanaṃ satthā jetavane viharanto kālattheraṃ ārabbha kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sāvatthiyaṃ kirekā itthī mātuṭṭhāne ṭhatvā taṃ theraṃ upaṭṭhahi. Tassā paṭivissakagehe manussā satthu santike dhammaṃ sutvā āgantvā ‘‘aho buddhā nāma acchariyā, aho dhammadesanā madhurā’’ti pasaṃsanti. Sā itthī tesaṃ kathaṃ sutvā, ‘‘bhante, ahampi satthu dhammadesanaṃ sotukāmā’’ti tassa ārocesi. So ‘‘tattha mā gamī’’ti taṃ nivāresi. Sā punadivase punadivasepīti yāvatatiyaṃ tena nivāriyamānāpi sotukāmāva ahosi. Kasmā so panetaṃ nivāresīti? Evaṃ kirassa ahosi – ‘‘satthu santike dhammaṃ sutvā mayi bhijjissatī’’ti. Sā ekadivasaṃ pātova bhuttapātarāsā uposathaṃ samādiyitvā, ‘‘amma, sādhukaṃ ayyaṃ pariviseyyāsī’’ti dhītaraṃ āṇāpetvā vihāraṃ agamāsi. Dhītāpissā taṃ bhikkhuṃ āgatakāle parivisitvā ‘‘kuhiṃ mahāupāsikā’’ti vuttā ‘‘dhammassavanāya ",
      " vihāraṃ gatā’’ti āha. So taṃ ",
      " sutvāva kucchiyaṃ uṭṭhitena ḍāhena santappamāno ‘‘idāni sā mayi bhinnā’’ti vegena gantvā satthu santike dhammaṃ suṇamānaṃ disvā satthāraṃ āha, ‘‘bhante, ayaṃ itthī dandhā sukhumaṃ dhammakathaṃ na jānāti, imissā khandhādipaṭisaṃyuttaṃ sukhumaṃ dhammakathaṃ akathetvā dānakathaṃ vā sīlakathaṃ vā kathetuṃ vaṭṭatī’’ti. Satthā tassajjhāsayaṃ viditvā ‘‘tvaṃ duppañño pāpikaṃ diṭṭhiṃ nissāya buddhānaṃ sāsanaṃ paṭikkosasi. Attaghātāyeva vāyamasī’’ti vatvā imaṃ gāthamāha –"
    ],
    "innerText": "Sāvatthiyaṃ kirekā itthī mātuṭṭhāne ṭhatvā taṃ theraṃ upaṭṭhahi. Tassā paṭivissakagehe manussā satthu santike dhammaṃ sutvā āgantvā ‘‘aho buddhā nāma acchariyā, aho dhammadesanā madhurā’’ti pasaṃsanti. Sā itthī tesaṃ kathaṃ sutvā, ‘‘bhante, ahampi satthu dhammadesanaṃ sotukāmā’’ti tassa ārocesi. So ‘‘tattha mā gamī’’ti taṃ nivāresi. Sā punadivase punadivasepīti yāvatatiyaṃ tena nivāriyamānāpi sotukāmāva ahosi. Kasmā so panetaṃ nivāresīti? Evaṃ kirassa ahosi – ‘‘satthu santike dhammaṃ sutvā mayi bhijjissatī’’ti. Sā ekadivasaṃ pātova bhuttapātarāsā uposathaṃ samādiyitvā, ‘‘amma, sādhukaṃ ayyaṃ pariviseyyāsī’’ti dhītaraṃ āṇāpetvā vihāraṃ agamāsi. Dhītāpissā taṃ bhikkhuṃ āgatakāle parivisitvā ‘‘kuhiṃ mahāupāsikā’’ti vuttā ‘‘dhammassavanāya vihāraṃ gatā’’ti āha. So taṃ sutvāva kucchiyaṃ uṭṭhitena ḍāhena santappamāno ‘‘idāni sā mayi bhinnā’’ti vegena gantvā satthu santike dhammaṃ suṇamānaṃ disvā satthāraṃ āha, ‘‘bhante, ayaṃ itthī dandhā sukhumaṃ dhammakathaṃ na jānāti, imissā khandhādipaṭisaṃyuttaṃ sukhumaṃ dhammakathaṃ akathetvā dānakathaṃ vā sīlakathaṃ vā kathetuṃ vaṭṭatī’’ti. Satthā tassajjhāsayaṃ viditvā ‘‘tvaṃ duppañño pāpikaṃ diṭṭhiṃ nissāya buddhānaṃ sāsanaṃ paṭikkosasi. Attaghātāyeva vāyamasī’’ti vatvā imaṃ gāthamāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "164"
      },
      "."
    ],
    "innerText": "164."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yo sāsanaṃ arahataṃ, ariyānaṃ dhammajīvinaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Paṭikkosati dummedho, diṭṭhiṃ nissāya pāpikaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Phalāni kaṭṭhakasseva, attaghātāya phallatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tassattho – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yo dummedho"
      },
      " puggalo attano sakkārahānibhayena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pāpikaṃ diṭṭhiṃ nissāya"
      },
      " ‘‘dhammaṃ vā sossāma, dānaṃ vā dassāmā’’ti vadante paṭikkosanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "arahataṃ ariyānaṃ dhammajīvinaṃ"
      },
      " buddhānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sāsanaṃ paṭikkosati,"
      },
      " tassa taṃ paṭikkosanaṃ sā ca pāpikā diṭṭhi veḷusaṅkhātassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kaṭṭhakassa phalāni"
      },
      " viya hoti. Tasmā yathā kaṭṭhako phalāni gaṇhanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "attaghātāya phallati,"
      },
      " attano ghātatthameva phalati, evaṃ sopi attaghātāya phallatīti. Vuttampi cetaṃ –"
    ],
    "innerText": "Tassattho – yo dummedho puggalo attano sakkārahānibhayena pāpikaṃ diṭṭhiṃ nissāya ‘‘dhammaṃ vā sossāma, dānaṃ vā dassāmā’’ti vadante paṭikkosanto arahataṃ ariyānaṃ dhammajīvinaṃ buddhānaṃ sāsanaṃ paṭikkosati, tassa taṃ paṭikkosanaṃ sā ca pāpikā diṭṭhi veḷusaṅkhātassa kaṭṭhakassa phalāni viya hoti. Tasmā yathā kaṭṭhako phalāni gaṇhanto attaghātāya phallati, attano ghātatthameva phalati, evaṃ sopi attaghātāya phallatīti. Vuttampi cetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Phalaṃ ",
      " ve kadaliṃ hanti, phalaṃ veḷuṃ phalaṃ naḷaṃ;"
    ],
    "innerText": "‘‘Phalaṃ ve kadaliṃ hanti, phalaṃ veḷuṃ phalaṃ naḷaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sakkāro kāpurisaṃ hanti, gabbho assatariṃ yathā’’ti. (cūḷava. 335; a. ni. 4.68);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Desanāvasāne upāsikā sotāpattiphale patiṭṭhahi, sampattaparisāyapi sātthikā dhammadesanā ahosīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Kālattheravatthu aṭṭhamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Cūḷakālaupāsakavatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attanā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hi kata"
      },
      "nti imaṃ dhammadesanaṃ satthā jetavane viharanto cūḷakālaṃ upāsakaṃ ārabbha kathesi."
    ],
    "innerText": "Attanāhi katanti imaṃ dhammadesanaṃ satthā jetavane viharanto cūḷakālaṃ upāsakaṃ ārabbha kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ekadivasañhi mahākālavatthusmiṃ vuttanayeneva umaṅgacorā sāmikehi anubaddhā rattiṃ vihāre dhammakathaṃ sutvā pātova vihārā nikkhamitvā sāvatthiṃ āgacchantassa tassa upāsakassa purato bhaṇḍikaṃ chaḍḍetvā palāyiṃsu. Manussā taṃ disvā ‘‘ayaṃ rattiṃ corakammaṃ katvā dhammaṃ suṇanto viya carati, gaṇhatha na’’nti taṃ pothayiṃsu. Kumbhadāsiyo udakatitthaṃ gacchamānā taṃ disvā ‘‘apetha, sāmi, nāyaṃ evarūpaṃ karotī’’ti taṃ mocesuṃ. So vihāraṃ gantvā, ‘‘bhante, ahamhi manussehi nāsito, kumbhadāsiyo me nissāya jīvitaṃ laddha’’nti bhikkhūnaṃ ārocesi. Bhikkhū tathāgatassa tamatthaṃ ārocesuṃ. Satthā tesaṃ kathaṃ sutvā, ‘‘bhikkhave, cūḷakālaupāsako kumbhadāsiyo ceva nissāya, attano ca akaraṇabhāvena jīvitaṃ labhi. Ime hi nāma sattā attanā pāpakammaṃ katvā nirayādīsu attanāva kilissanti, kusalaṃ katvā pana sugatiñceva nibbānañca gacchantā attanāva visujjhantī’’ti vatvā imaṃ gāthamāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "165"
      },
      "."
    ],
    "innerText": "165."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Attanā hi kataṃ pāpaṃ, attanā saṃkilissati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Attanā akataṃ pāpaṃ, attanāva visujjhati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Suddhī asuddhi paccattaṃ, nāñño aññaṃ visodhaye’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tassattho ",
      " – yena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "attanā"
      },
      " akusalakammaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kataṃ"
      },
      " hoti, so catūsu apāyesu dukkhaṃ anubhavanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "attanāva saṃkilissati"
      },
      ". Yena pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "attanā akataṃ pāpaṃ,"
      },
      " so sugatiñceva nibbānañca gacchanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "attanāva visujjhati"
      },
      ". Kusalakammasaṅkhātā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "suddhi"
      },
      " akusalakammasaṅkhātā ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asuddhi paccattaṃ"
      },
      " kārakasattānaṃ attaniyeva vipaccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Añño"
      },
      " puggalo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aññaṃ"
      },
      " puggalaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na visodhaye"
      },
      " neva visodheti, na kilesetīti vuttaṃ hoti."
    ],
    "innerText": "Tassattho – yena attanā akusalakammaṃ kataṃ hoti, so catūsu apāyesu dukkhaṃ anubhavanto attanāva saṃkilissati. Yena pana attanā akataṃ pāpaṃ, so sugatiñceva nibbānañca gacchanto attanāva visujjhati. Kusalakammasaṅkhātā suddhi akusalakammasaṅkhātā ca asuddhi paccattaṃ kārakasattānaṃ attaniyeva vipaccati. Añño puggalo aññaṃ puggalaṃ na visodhaye neva visodheti, na kilesetīti vuttaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Desanāvasāne ",
      " cūḷakālo sotāpattiphale patiṭṭhahi, sampattaparisāyapi sātthikā dhammadesanā ahosīti."
    ],
    "innerText": "Desanāvasāne cūḷakālo sotāpattiphale patiṭṭhahi, sampattaparisāyapi sātthikā dhammadesanā ahosīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Cūḷakālaupāsakavatthu navamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Attadatthattheravatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attadattha"
      },
      "nti imaṃ dhammadesanaṃ satthā jetavane viharanto attadatthattheraṃ ārabbha kathesi."
    ],
    "innerText": "Attadatthanti imaṃ dhammadesanaṃ satthā jetavane viharanto attadatthattheraṃ ārabbha kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Satthārā hi parinibbānakāle, ‘‘bhikkhave, ahaṃ ito catumāsaccayena parinibbāyissāmī’’ti vutte uppannasaṃvegā sattasatā puthujjanā bhikkhū satthu santikaṃ avijahitvā ‘‘kiṃ nu kho, āvuso, karissāmā’’ti sammantayamānā vicaranti. Attadatthatthero pana cintesi – ‘‘satthā kira catumāsaccayena parinibbāyissati, ahañcamhi avītarāgo, satthari dharamāneyeva arahattatthāya vāyamissāmī’’ti. So bhikkhūnaṃ santikaṃ na gacchati. Atha naṃ bhikkhū ‘‘kasmā, āvuso, tvaṃ neva amhākaṃ santikaṃ āgacchasi, na kiñci mantesī’’ti vatvā satthu santikaṃ netvā ‘‘ayaṃ, bhante, evaṃ nāma karotī’’ti ārocayiṃsu. So satthārāpi ‘‘kasmā evaṃ karosī’’ti vutte ‘‘tumhe kira, bhante, catumāsaccayena ",
      " parinibbāyissatha, ahaṃ tumhesu dharantesuyeva arahattappattiyā vāyamissāmī’’ti. Satthā tassa sādhukāraṃ datvā, ‘‘bhikkhave, yassa mayi sineho atthi, tena attadatthena viya bhavituṃ vaṭṭati. Na hi gandhādīhi pūjentā maṃ pūjenti, dhammānudhammapaṭipattiyā pana maṃ pūjenti. Tasmā aññenapi attadatthasadiseneva bhavitabba’’nti vatvā imaṃ gāthamāha –"
    ],
    "innerText": "Satthārā hi parinibbānakāle, ‘‘bhikkhave, ahaṃ ito catumāsaccayena parinibbāyissāmī’’ti vutte uppannasaṃvegā sattasatā puthujjanā bhikkhū satthu santikaṃ avijahitvā ‘‘kiṃ nu kho, āvuso, karissāmā’’ti sammantayamānā vicaranti. Attadatthatthero pana cintesi – ‘‘satthā kira catumāsaccayena parinibbāyissati, ahañcamhi avītarāgo, satthari dharamāneyeva arahattatthāya vāyamissāmī’’ti. So bhikkhūnaṃ santikaṃ na gacchati. Atha naṃ bhikkhū ‘‘kasmā, āvuso, tvaṃ neva amhākaṃ santikaṃ āgacchasi, na kiñci mantesī’’ti vatvā satthu santikaṃ netvā ‘‘ayaṃ, bhante, evaṃ nāma karotī’’ti ārocayiṃsu. So satthārāpi ‘‘kasmā evaṃ karosī’’ti vutte ‘‘tumhe kira, bhante, catumāsaccayena parinibbāyissatha, ahaṃ tumhesu dharantesuyeva arahattappattiyā vāyamissāmī’’ti. Satthā tassa sādhukāraṃ datvā, ‘‘bhikkhave, yassa mayi sineho atthi, tena attadatthena viya bhavituṃ vaṭṭati. Na hi gandhādīhi pūjentā maṃ pūjenti, dhammānudhammapaṭipattiyā pana maṃ pūjenti. Tasmā aññenapi attadatthasadiseneva bhavitabba’’nti vatvā imaṃ gāthamāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "166"
      },
      "."
    ],
    "innerText": "166."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Attadatthaṃ paratthena, bahunāpi na hāpaye;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Attadatthamabhiññāya, sadatthapasuto siyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tassattho – gihibhūtā tāva kākaṇikamattampi attano atthaṃ sahassamattenāpi parassa atthena ",
      " na hāpaye. Kākaṇikamattenāpi hissa attadatthova khādanīyaṃ vā bhojanīyaṃ vā nipphādeyya, na parattho. Idaṃ ",
      " pana evaṃ akathetvā kammaṭṭhānasīsena kathitaṃ, tasmā ‘‘attadatthaṃ na hāpemī’’ti bhikkhunā nāma saṅghassa uppannaṃ cetiyapaṭisaṅkharaṇādikiccaṃ vā upajjhāyādivattaṃ vā na hāpetabbaṃ. Ābhisamācārikavattañhi pūrentoyeva ariyaphalādīni sacchikaroti, tasmā ayampi attadatthova. Yo pana accāraddhavipassako ‘‘ajja vā suve vā’’ti paṭivedhaṃ patthayamāno vicarati, tena upajjhāyavattādīnipi hāpetvā attano kiccameva kātabbaṃ. Evarūpañhi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "attadatthamabhiññāya"
      },
      " ‘‘ayaṃ me attano attho’’ti sallakkhetvā ",
      ", ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sadatthapasuto siyā"
      },
      "ti tasmiṃ sake atthe uyyuttapayutto bhaveyyāti."
    ],
    "innerText": "Tassattho – gihibhūtā tāva kākaṇikamattampi attano atthaṃ sahassamattenāpi parassa atthena na hāpaye. Kākaṇikamattenāpi hissa attadatthova khādanīyaṃ vā bhojanīyaṃ vā nipphādeyya, na parattho. Idaṃ pana evaṃ akathetvā kammaṭṭhānasīsena kathitaṃ, tasmā ‘‘attadatthaṃ na hāpemī’’ti bhikkhunā nāma saṅghassa uppannaṃ cetiyapaṭisaṅkharaṇādikiccaṃ vā upajjhāyādivattaṃ vā na hāpetabbaṃ. Ābhisamācārikavattañhi pūrentoyeva ariyaphalādīni sacchikaroti, tasmā ayampi attadatthova. Yo pana accāraddhavipassako ‘‘ajja vā suve vā’’ti paṭivedhaṃ patthayamāno vicarati, tena upajjhāyavattādīnipi hāpetvā attano kiccameva kātabbaṃ. Evarūpañhi attadatthamabhiññāya ‘‘ayaṃ me attano attho’’ti sallakkhetvā , sadatthapasuto siyāti tasmiṃ sake atthe uyyuttapayutto bhaveyyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Desanāvasāne so thero arahatte patiṭṭhahi, sampattabhikkhūnampi sātthikā dhammadesanā ahosīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Attadatthattheravatthu dasamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Attavaggavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dvādasamo vaggo."
  }
]