[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "5. Soṇavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Piyatarasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "41"
      },
      ". Mahāvaggassa ",
      " paṭhame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mallikāya deviyā saddhi"
      },
      "nti mallikāya nāma attano mahesiyā saha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uparipāsādavaragato"
      },
      "ti pāsādavarassa upari gato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kocañño attanā piyataro"
      },
      "ti koci añño attanā piyāyitabbataro. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atthi nu kho te"
      },
      "ti ‘‘kiṃ te atthī’’ti deviṃ pucchati."
    ],
    "innerText": "41. Mahāvaggassa paṭhame mallikāya deviyā saddhinti mallikāya nāma attano mahesiyā saha. Uparipāsādavaragatoti pāsādavarassa upari gato. Kocañño attanā piyataroti koci añño attanā piyāyitabbataro. Atthi nu kho teti ‘‘kiṃ te atthī’’ti deviṃ pucchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kasmā pucchati? Ayañhi sāvatthiyaṃ duggatamālākārassa dhītā. Ekadivasaṃ āpaṇato pūvaṃ gahetvā mālārāmaṃ gantvā ‘‘khādissāmī’’ti gacchantī paṭipathe bhikkhusaṅghaparivutaṃ bhagavantaṃ bhikkhācāraṃ pavisantaṃ disvā pasannacittā taṃ bhagavato adāsi. Satthā tathārūpe ṭhāne nisīdanākāraṃ dassesi. Ānandatthero cīvaraṃ paññāpetvā adāsi. Bhagavā tattha nisīditvā taṃ pūvaṃ paribhuñjitvā mukhaṃ vikkhāletvā sitaṃ pātvākāsi. Thero ‘‘ko imissā, bhante, dānassa vipāko bhavissatī’’ti pucchi. ‘‘Ajjesā, ānanda, tathāgatassa paṭhamaṃ bhojanaṃ adāsi, ajjeva kosalarañño aggamahesī bhavissati piyā manāpā’’ti. Taṃ divasameva ca rājā kāsigāme bhāgineyyena saddhiṃ yujjhitvā parājito palāyitvā āgato nagaraṃ pavisanto ‘‘balakāyassa āgamanaṃ āgamessāmī’’ti taṃ mālārāmaṃ pāvisi. Sā rājānaṃ āgataṃ passitvā tassa vattamakāsi. Rājā tassā vatte pasīditvā pitaraṃ pakkosāpetvā mahantaṃ issariyaṃ datvā ",
      " taṃ antepuraṃ paṭiharāpetvā aggamahesiṭṭhāne ṭhapesi. Athekadivasaṃ rājā cintesi – ‘‘mayā imissā mahantaṃ issariyaṃ dinnaṃ, yaṃnūnāhaṃ imaṃ puccheyyaṃ ‘ko te piyo’ti? Sā ‘tvaṃ me, mahārāja, piyo’ti vatvā, puna maṃ pucchissati, athassāhaṃ ‘mayhampi tvaṃyeva piyā’ti vakkhāmī’’ti. Iti so aññamaññaṃ vissāsajananatthaṃ sammodanīyaṃ karonto pucchi."
    ],
    "innerText": "Kasmā pucchati? Ayañhi sāvatthiyaṃ duggatamālākārassa dhītā. Ekadivasaṃ āpaṇato pūvaṃ gahetvā mālārāmaṃ gantvā ‘‘khādissāmī’’ti gacchantī paṭipathe bhikkhusaṅghaparivutaṃ bhagavantaṃ bhikkhācāraṃ pavisantaṃ disvā pasannacittā taṃ bhagavato adāsi. Satthā tathārūpe ṭhāne nisīdanākāraṃ dassesi. Ānandatthero cīvaraṃ paññāpetvā adāsi. Bhagavā tattha nisīditvā taṃ pūvaṃ paribhuñjitvā mukhaṃ vikkhāletvā sitaṃ pātvākāsi. Thero ‘‘ko imissā, bhante, dānassa vipāko bhavissatī’’ti pucchi. ‘‘Ajjesā, ānanda, tathāgatassa paṭhamaṃ bhojanaṃ adāsi, ajjeva kosalarañño aggamahesī bhavissati piyā manāpā’’ti. Taṃ divasameva ca rājā kāsigāme bhāgineyyena saddhiṃ yujjhitvā parājito palāyitvā āgato nagaraṃ pavisanto ‘‘balakāyassa āgamanaṃ āgamessāmī’’ti taṃ mālārāmaṃ pāvisi. Sā rājānaṃ āgataṃ passitvā tassa vattamakāsi. Rājā tassā vatte pasīditvā pitaraṃ pakkosāpetvā mahantaṃ issariyaṃ datvā taṃ antepuraṃ paṭiharāpetvā aggamahesiṭṭhāne ṭhapesi. Athekadivasaṃ rājā cintesi – ‘‘mayā imissā mahantaṃ issariyaṃ dinnaṃ, yaṃnūnāhaṃ imaṃ puccheyyaṃ ‘ko te piyo’ti? Sā ‘tvaṃ me, mahārāja, piyo’ti vatvā, puna maṃ pucchissati, athassāhaṃ ‘mayhampi tvaṃyeva piyā’ti vakkhāmī’’ti. Iti so aññamaññaṃ vissāsajananatthaṃ sammodanīyaṃ karonto pucchi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Devī pana paṇḍitā buddhupaṭṭhāyikā saṅghupaṭṭhāyikā ‘‘nāyaṃ pañho rañño mukhaṃ ulloketvā ",
      " kathetabbo’’ti cintetvā yathābhūtameva vadantī ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘natthi kho me, mahārāja, kocañño attanā piyataro’’"
      },
      "ti ",
      " āha. Vatvāpi attanā byākatamatthaṃ upāyena rañño paccakkhaṃ kātukāmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tuyhaṃ pana, mahārāja, atthañño koci attanā piyataro’’"
      },
      "ti tatheva rājānaṃ pucchi yathā raññā sayaṃ puṭṭhā. Rājāpi tāya sarasalakkhaṇena kathitattā nivattituṃ asakkonto sayampi sarasalakkhaṇeneva kathento tatheva byākāsi yathā deviyā byākataṃ."
    ],
    "innerText": "Devī pana paṇḍitā buddhupaṭṭhāyikā saṅghupaṭṭhāyikā ‘‘nāyaṃ pañho rañño mukhaṃ ulloketvā kathetabbo’’ti cintetvā yathābhūtameva vadantī ‘‘natthi kho me, mahārāja, kocañño attanā piyataro’’ti āha. Vatvāpi attanā byākatamatthaṃ upāyena rañño paccakkhaṃ kātukāmā ‘‘tuyhaṃ pana, mahārāja, atthañño koci attanā piyataro’’ti tatheva rājānaṃ pucchi yathā raññā sayaṃ puṭṭhā. Rājāpi tāya sarasalakkhaṇena kathitattā nivattituṃ asakkonto sayampi sarasalakkhaṇeneva kathento tatheva byākāsi yathā deviyā byākataṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Byākaritvā ca mandadhātukatāya evaṃ cintesi – ‘‘ahaṃ rājā pathavissaro mahantaṃ pathavimaṇḍalaṃ abhivijiya ajjhāvasāmi, mayhaṃ tāva yuttaṃ ‘attanā piyataraṃ aññaṃ na passāmī’ti, ayaṃ pana vasalī hīnajaccā samānā mayā ucce ṭhāne ṭhapitā sāmibhūtaṃ maṃ na tathā piyāyati, ‘attāva piyataro’ti mama sammukhā vadati, yāva kakkhaḷā vatāya’’nti anattamano hutvā ‘‘nanu te tīṇi ratanāni piyatarānī’’ti codesi. Devī ‘ratanattayaṃpāhaṃ deva attano saggasukhaṃ mokkhasukhañca patthayantī sampiyāyāmi, tasmā attāva me piyataro’’ti āha. Sabbo cāyaṃ loko attadatthameva paraṃ piyāyati, puttaṃ patthentopi ‘‘ayaṃ maṃ jiṇṇakāle posessatī’’ti pattheti, dhītaraṃ ‘‘mama kulaṃ vaḍḍhissatī’’ti, bhariyaṃ ‘‘mayhaṃ pāde paricarissatī’’ti, aññepi ñātimittabandhave taṃtaṃkiccavasena, iti attadatthameva ",
      " sampassanto loko paraṃ piyāyatīti. Ayañhi deviyā adhippāyo."
    ],
    "innerText": "Byākaritvā ca mandadhātukatāya evaṃ cintesi – ‘‘ahaṃ rājā pathavissaro mahantaṃ pathavimaṇḍalaṃ abhivijiya ajjhāvasāmi, mayhaṃ tāva yuttaṃ ‘attanā piyataraṃ aññaṃ na passāmī’ti, ayaṃ pana vasalī hīnajaccā samānā mayā ucce ṭhāne ṭhapitā sāmibhūtaṃ maṃ na tathā piyāyati, ‘attāva piyataro’ti mama sammukhā vadati, yāva kakkhaḷā vatāya’’nti anattamano hutvā ‘‘nanu te tīṇi ratanāni piyatarānī’’ti codesi. Devī ‘ratanattayaṃpāhaṃ deva attano saggasukhaṃ mokkhasukhañca patthayantī sampiyāyāmi, tasmā attāva me piyataro’’ti āha. Sabbo cāyaṃ loko attadatthameva paraṃ piyāyati, puttaṃ patthentopi ‘‘ayaṃ maṃ jiṇṇakāle posessatī’’ti pattheti, dhītaraṃ ‘‘mama kulaṃ vaḍḍhissatī’’ti, bhariyaṃ ‘‘mayhaṃ pāde paricarissatī’’ti, aññepi ñātimittabandhave taṃtaṃkiccavasena, iti attadatthameva sampassanto loko paraṃ piyāyatīti. Ayañhi deviyā adhippāyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha rājā cintesi – ‘‘ayaṃ mallikā kusalā paṇḍitā nipuṇā ‘attāva me piyataro’ti vadati, mayhampi attāva piyataro hutvā upaṭṭhāti, handāhaṃ imamatthaṃ satthu ārocessāmi, yathā ca me satthā byākarissati, tathā naṃ dhāressāmī’’ti. Evaṃ pana cintetvā satthu santikaṃ upasaṅkamitvā tamatthaṃ ārocesi. Tena vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘atha kho rājā pasenadi kosalo…pe… piyataro’’"
      },
      "ti."
    ],
    "innerText": "Atha rājā cintesi – ‘‘ayaṃ mallikā kusalā paṇḍitā nipuṇā ‘attāva me piyataro’ti vadati, mayhampi attāva piyataro hutvā upaṭṭhāti, handāhaṃ imamatthaṃ satthu ārocessāmi, yathā ca me satthā byākarissati, tathā naṃ dhāressāmī’’ti. Evaṃ pana cintetvā satthu santikaṃ upasaṅkamitvā tamatthaṃ ārocesi. Tena vuttaṃ – ‘‘atha kho rājā pasenadi kosalo…pe… piyataro’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etamatthaṃ viditvā"
      },
      "ti etaṃ ‘‘loke sabbasattānaṃ attāva attano piyataro’’ti raññā vuttamatthaṃ sabbaso jānitvā tadatthaparidīpanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "imaṃ udānaṃ udānesi"
      },
      "."
    ],
    "innerText": "Etamatthaṃ viditvāti etaṃ ‘‘loke sabbasattānaṃ attāva attano piyataro’’ti raññā vuttamatthaṃ sabbaso jānitvā tadatthaparidīpanaṃ imaṃ udānaṃ udānesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sabbā disā anuparigamma cetasā"
      },
      "ti sabbā anavasesā dasapi disā pariyesanavasena cittena anugantvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nevajjhagā piyataramattanā kvacī"
      },
      "ti attanā atisayena piyaṃ aññaṃ koci puriso sabbussāhena pariyesanto ",
      " kvaci katthaci sabbadisāsu neva adhigaccheyya na passeyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ piyo puthu attā paresa"
      },
      "nti evaṃ kassaci attanā piyatarassa anupalabbhanavasena ",
      " puthu visuṃ visuṃ tesaṃ tesaṃ sattānaṃ attāva piyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasmā na hiṃse paramattakāmo"
      },
      "ti yasmā evaṃ sabbopi satto attānaṃ piyāyati attano sukhakāmo dukkhappaṭikūlo, tasmā attakāmo attano hitasukhaṃ icchanto paraṃ sattaṃ antamaso kunthakipillikaṃ upādāya na hiṃse na haneyya na pāṇileḍḍudaṇḍādīhipi viheṭheyya. Parassa hi attanā kate dukkhe taṃ tato saṅkamantaṃ viya kālantare attani sandissati. Ayañhi kammānaṃ dhammatāti."
    ],
    "innerText": "Tattha sabbā disā anuparigamma cetasāti sabbā anavasesā dasapi disā pariyesanavasena cittena anugantvā. Nevajjhagā piyataramattanā kvacīti attanā atisayena piyaṃ aññaṃ koci puriso sabbussāhena pariyesanto kvaci katthaci sabbadisāsu neva adhigaccheyya na passeyya. Evaṃ piyo puthu attā paresanti evaṃ kassaci attanā piyatarassa anupalabbhanavasena puthu visuṃ visuṃ tesaṃ tesaṃ sattānaṃ attāva piyo. Tasmā na hiṃse paramattakāmoti yasmā evaṃ sabbopi satto attānaṃ piyāyati attano sukhakāmo dukkhappaṭikūlo, tasmā attakāmo attano hitasukhaṃ icchanto paraṃ sattaṃ antamaso kunthakipillikaṃ upādāya na hiṃse na haneyya na pāṇileḍḍudaṇḍādīhipi viheṭheyya. Parassa hi attanā kate dukkhe taṃ tato saṅkamantaṃ viya kālantare attani sandissati. Ayañhi kammānaṃ dhammatāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṭhamasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Appāyukasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "42"
      },
      ". Dutiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "acchariyaṃ, bhante"
      },
      "ti idampi meghiyasutte viya garahaṇacchariyavasena veditabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yāva appāyukā"
      },
      "ti yattakaṃ parittāyukā, atiittarajīvitāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sattāhajāte"
      },
      "ti sattāhena jāto sattāhajāto. Tasmiṃ sattāhajāte, jātassa sattame ahanīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tusitaṃ kāyaṃ upapajjī"
      },
      "ti tusitaṃ devanikāyaṃ paṭisandhiggahaṇavasena upapajji."
    ],
    "innerText": "42. Dutiye acchariyaṃ, bhanteti idampi meghiyasutte viya garahaṇacchariyavasena veditabbaṃ. Yāva appāyukāti yattakaṃ parittāyukā, atiittarajīvitāti attho. Sattāhajāteti sattāhena jāto sattāhajāto. Tasmiṃ sattāhajāte, jātassa sattame ahanīti attho. Tusitaṃ kāyaṃ upapajjīti tusitaṃ devanikāyaṃ paṭisandhiggahaṇavasena upapajji."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ekadivasaṃ kira thero pacchābhattaṃ divāṭṭhāne nisinno lakkhaṇānubyañjanappaṭimaṇḍitaṃ sobhaggappattaṃ dassanānuttariyabhūtaṃ bhagavato rūpakāyasiriṃ manasi karitvā, ‘‘aho buddhānaṃ rūpakāyasampatti dassanīyā samantapāsādikā manoharā’’ti uḷāraṃ pītisomanassaṃ paṭisaṃvedento evaṃ cintesi – ‘‘vijātamātuyā nāma virūpopi putto surūpo viya manāpo hoti, sace pana buddhānaṃ mātā mahāmāyā devī dhareyya, kīdisaṃ nu kho tassā bhagavato rūpadassane pītisomanassaṃ uppajjeyya, mahājāni kho mayhaṃ mahāmātu deviyā, yā sattāhajāte bhagavati kālakatā’’ti. Evaṃ pana cintetvā bhagavantaṃ upasaṅkamitvā attano parivitakkitaṃ ārocento tassā kālakiriyaṃ garahanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘acchariyaṃ, bhante’’"
      },
      "tiādimāha."
    ],
    "innerText": "Ekadivasaṃ kira thero pacchābhattaṃ divāṭṭhāne nisinno lakkhaṇānubyañjanappaṭimaṇḍitaṃ sobhaggappattaṃ dassanānuttariyabhūtaṃ bhagavato rūpakāyasiriṃ manasi karitvā, ‘‘aho buddhānaṃ rūpakāyasampatti dassanīyā samantapāsādikā manoharā’’ti uḷāraṃ pītisomanassaṃ paṭisaṃvedento evaṃ cintesi – ‘‘vijātamātuyā nāma virūpopi putto surūpo viya manāpo hoti, sace pana buddhānaṃ mātā mahāmāyā devī dhareyya, kīdisaṃ nu kho tassā bhagavato rūpadassane pītisomanassaṃ uppajjeyya, mahājāni kho mayhaṃ mahāmātu deviyā, yā sattāhajāte bhagavati kālakatā’’ti. Evaṃ pana cintetvā bhagavantaṃ upasaṅkamitvā attano parivitakkitaṃ ārocento tassā kālakiriyaṃ garahanto ‘‘acchariyaṃ, bhante’’tiādimāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Keci ",
      " panāhu – ‘‘mahāpajāpati gotamī bhagavantaṃ mahatā āyāsena pabbajjaṃ yācitvāpi paṭikkhittā, mayā pana upāyena yācito bhagavā aṭṭhagarudhammappaṭiggahaṇavasena tassā pabbajjaṃ upasampadañca anujāni, sā te dhamme paṭiggahetvā laddhapabbajjūpasampadā bhagavato dutiyaṃ parisaṃ uppādetvā catutthāya parisāya paccayo ahosi. Sace pana bhagavato janetti ",
      " mahāmāyā devī dhareyya, evametā cubhopi khattiyabhaginiyo ekato hutvā imaṃ sāsanaṃ sobheyyuṃ, bhagavā ca mātari bahumānena mātugāmassa sāsane pabbajjaṃ upasampadañca sukheneva anujāneyya, appāyukatāya panassā kasirena nipphannamidanti iminā adhippāyena thero bhagavato santike ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘acchariyaṃ, bhante’"
      },
      "tiādimāhā’’ti. Taṃ akāraṇaṃ. Bhagavā hi mātuyā vā aññassa vā mātugāmassa attano sāsane ",
      " pabbajjaṃ anujānanto garukaṃyeva katvā anujānāti, na lahukaṃ ciraṭṭhitikāmatāyāti."
    ],
    "innerText": "Keci panāhu – ‘‘mahāpajāpati gotamī bhagavantaṃ mahatā āyāsena pabbajjaṃ yācitvāpi paṭikkhittā, mayā pana upāyena yācito bhagavā aṭṭhagarudhammappaṭiggahaṇavasena tassā pabbajjaṃ upasampadañca anujāni, sā te dhamme paṭiggahetvā laddhapabbajjūpasampadā bhagavato dutiyaṃ parisaṃ uppādetvā catutthāya parisāya paccayo ahosi. Sace pana bhagavato janetti mahāmāyā devī dhareyya, evametā cubhopi khattiyabhaginiyo ekato hutvā imaṃ sāsanaṃ sobheyyuṃ, bhagavā ca mātari bahumānena mātugāmassa sāsane pabbajjaṃ upasampadañca sukheneva anujāneyya, appāyukatāya panassā kasirena nipphannamidanti iminā adhippāyena thero bhagavato santike ‘acchariyaṃ, bhante’tiādimāhā’’ti. Taṃ akāraṇaṃ. Bhagavā hi mātuyā vā aññassa vā mātugāmassa attano sāsane pabbajjaṃ anujānanto garukaṃyeva katvā anujānāti, na lahukaṃ ciraṭṭhitikāmatāyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Apare panāhu – ‘‘dasabalacatuvesārajjādike anaññasādhāraṇe anantāparimāṇe buddhaguṇe thero manasi karitvā yā evaṃ mahānubhāvaṃ nāma loke aggapuggalaṃ satthāraṃ kucchinā dasa māse parihari, sā buddhamātā kassaci paricārikā bhavissatīti ayuttamidaṃ. Kasmā? Satthu guṇānucchavikamevetaṃ, yadidaṃ sattāhajāte bhagavati janetti kālaṃ karoti, kālakatā ca tusitesu uppajjatīti acchariyabbhutacittajāto hutvā taṃ attano vitakkuppādanaṃ bhagavato ārocento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘acchariyaṃ, bhante’"
      },
      "tiādivacanaṃ avocā’’ti."
    ],
    "innerText": "Apare panāhu – ‘‘dasabalacatuvesārajjādike anaññasādhāraṇe anantāparimāṇe buddhaguṇe thero manasi karitvā yā evaṃ mahānubhāvaṃ nāma loke aggapuggalaṃ satthāraṃ kucchinā dasa māse parihari, sā buddhamātā kassaci paricārikā bhavissatīti ayuttamidaṃ. Kasmā? Satthu guṇānucchavikamevetaṃ, yadidaṃ sattāhajāte bhagavati janetti kālaṃ karoti, kālakatā ca tusitesu uppajjatīti acchariyabbhutacittajāto hutvā taṃ attano vitakkuppādanaṃ bhagavato ārocento ‘acchariyaṃ, bhante’tiādivacanaṃ avocā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Satthā pana yasmā sattāhajātesu bodhisattesu bodhisattamātu kālakiriyā dhammatā siddhā, tasmā taṃ dhammataṃ paridīpento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘evametaṃ, ānandā’’"
      },
      "tiādimāha. Sā panāyaṃ dhammatā yasmā yathā sabbe bodhisattā pāramiyo pūretvā tusitapure nibbattitvā tattha yāvatāyukaṃ ṭhatvā āyupariyosāne dasasahassacakkavāḷadevatāhi sannipatitvā abhisambodhiṃ pattuṃ manussaloke paṭisandhiggahaṇāya ajjhesitā kāladīpadesakulāni viya janettiyā āyuparimāṇampi oloketvā paṭisandhiṃ gaṇhanti, ayampi bhagavā bodhisattabhūto tatheva tusitapure ṭhito pañca mahāvilokanāni vilokento sattadivasādhikadasamāsaparimāṇaṃ ",
      " mātuyā āyuparimāṇaṃ paricchinditvā ‘‘ayaṃ mama paṭisandhiggahaṇassa kālo, idāni uppajjituṃ vaṭṭatī’’ti ñatvāva paṭisandhiṃ aggahesi, tasmā sabbabodhisattānaṃ āciṇṇasamāciṇṇavaseneva veditabbaṃ. Tenāha bhagavā – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘appāyukā hi, ānanda, bodhisattamātaro hontī’’"
      },
      "tiādi."
    ],
    "innerText": "Satthā pana yasmā sattāhajātesu bodhisattesu bodhisattamātu kālakiriyā dhammatā siddhā, tasmā taṃ dhammataṃ paridīpento ‘‘evametaṃ, ānandā’’tiādimāha. Sā panāyaṃ dhammatā yasmā yathā sabbe bodhisattā pāramiyo pūretvā tusitapure nibbattitvā tattha yāvatāyukaṃ ṭhatvā āyupariyosāne dasasahassacakkavāḷadevatāhi sannipatitvā abhisambodhiṃ pattuṃ manussaloke paṭisandhiggahaṇāya ajjhesitā kāladīpadesakulāni viya janettiyā āyuparimāṇampi oloketvā paṭisandhiṃ gaṇhanti, ayampi bhagavā bodhisattabhūto tatheva tusitapure ṭhito pañca mahāvilokanāni vilokento sattadivasādhikadasamāsaparimāṇaṃ mātuyā āyuparimāṇaṃ paricchinditvā ‘‘ayaṃ mama paṭisandhiggahaṇassa kālo, idāni uppajjituṃ vaṭṭatī’’ti ñatvāva paṭisandhiṃ aggahesi, tasmā sabbabodhisattānaṃ āciṇṇasamāciṇṇavaseneva veditabbaṃ. Tenāha bhagavā – ‘‘appāyukā hi, ānanda, bodhisattamātaro hontī’’tiādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kālaṃ karontī"
      },
      "ti yathāvuttaāyuparikkhayeneva kālaṃ karonti, na vijātapaccayā. Carimattabhāvehi bodhisattehi vasitaṭṭhānaṃ cetiyagharasadisaṃ hoti, na aññesaṃ paribhogārahaṃ, na ca sakkā bodhisattamātaraṃ apanetvā aññaṃ aggamahesiṭṭhāne ṭhapetunti tattakaṃ eva bodhisattamātu āyuppamāṇaṃ hoti, tasmā tadā kālaṃ karonti. Imameva hi atthaṃ sandhāya mahābodhisattā pañcamaṃ mahāvilokanaṃ karonti."
    ],
    "innerText": "Tattha kālaṃ karontīti yathāvuttaāyuparikkhayeneva kālaṃ karonti, na vijātapaccayā. Carimattabhāvehi bodhisattehi vasitaṭṭhānaṃ cetiyagharasadisaṃ hoti, na aññesaṃ paribhogārahaṃ, na ca sakkā bodhisattamātaraṃ apanetvā aññaṃ aggamahesiṭṭhāne ṭhapetunti tattakaṃ eva bodhisattamātu āyuppamāṇaṃ hoti, tasmā tadā kālaṃ karonti. Imameva hi atthaṃ sandhāya mahābodhisattā pañcamaṃ mahāvilokanaṃ karonti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katarasmiṃ ",
      " pana vaye kālaṃ ",
      " karontīti? Majjhimavaye. Paṭhamavayasmiñhi sattānaṃ attabhāve chandarāgo balavā hoti, tena tadā sañjātagabbhā itthiyo yebhuyyena gabbhaṃ anurakkhituṃ na sakkonti. Gaṇheyyuṃ ce, gabbho bahvābādho hoti. Majjhimavayassa pana dve koṭṭhāse atikkamitvā tatiyakoṭṭhāse vatthu visadaṃ hoti, visade vatthumhi nibbattadārakā arogā honti, tasmā bodhisattamātaro paṭhamavaye sampattiṃ anubhavitvā majjhimavayassa tatiyakoṭṭhāse vijāyitvā kālaṃ karontīti."
    ],
    "innerText": "Katarasmiṃ pana vaye kālaṃ karontīti? Majjhimavaye. Paṭhamavayasmiñhi sattānaṃ attabhāve chandarāgo balavā hoti, tena tadā sañjātagabbhā itthiyo yebhuyyena gabbhaṃ anurakkhituṃ na sakkonti. Gaṇheyyuṃ ce, gabbho bahvābādho hoti. Majjhimavayassa pana dve koṭṭhāse atikkamitvā tatiyakoṭṭhāse vatthu visadaṃ hoti, visade vatthumhi nibbattadārakā arogā honti, tasmā bodhisattamātaro paṭhamavaye sampattiṃ anubhavitvā majjhimavayassa tatiyakoṭṭhāse vijāyitvā kālaṃ karontīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etamatthaṃ viditvā"
      },
      "ti etaṃ bodhisattamātu aññesañca sabbasattānaṃ attabhāve āyussa maraṇapariyosānataṃ viditvā tadatthavibhāvanamukhena anavajjappaṭipattiyaṃ ussāhadīpakaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "imaṃ udānaṃ udānesi"
      },
      "."
    ],
    "innerText": "Etamatthaṃ viditvāti etaṃ bodhisattamātu aññesañca sabbasattānaṃ attabhāve āyussa maraṇapariyosānataṃ viditvā tadatthavibhāvanamukhena anavajjappaṭipattiyaṃ ussāhadīpakaṃ imaṃ udānaṃ udānesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ye kecī"
      },
      "ti aniyamaniddeso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhūtā"
      },
      "ti nibbattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhavissantī"
      },
      "ti anāgate nibbattissanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vā"
      },
      "saddo vikappattho, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "api"
      },
      "saddo sampiṇḍanattho. Tena nibbattamānepi saṅgaṇhāti. Ettāvatā atītādivasena tiyaddhapariyāpanne satte anavasesato pariyādiyati. Apica gabbhaseyyakasattā gabbhato nikkhantakālato paṭṭhāya bhūtā nāma, tato pubbe bhavissanti nāma. Saṃsedajūpapātikā paṭisandhicittato parato bhūtā ",
      " nāma, tato pubbe uppajjitabbabhavavasena bhavissanti nāma. Sabbepi vā paccuppannabhavavasena bhūtā nāma, āyatiṃ punabbhavavasena bhavissanti nāma. Khīṇāsavā bhūtā nāma. Te hi bhūtā eva, na puna bhavissantīti, tadaññe bhavissanti nāma."
    ],
    "innerText": "Tattha ye kecīti aniyamaniddeso. Bhūtāti nibbattā. Bhavissantīti anāgate nibbattissanti. Vāsaddo vikappattho, apisaddo sampiṇḍanattho. Tena nibbattamānepi saṅgaṇhāti. Ettāvatā atītādivasena tiyaddhapariyāpanne satte anavasesato pariyādiyati. Apica gabbhaseyyakasattā gabbhato nikkhantakālato paṭṭhāya bhūtā nāma, tato pubbe bhavissanti nāma. Saṃsedajūpapātikā paṭisandhicittato parato bhūtā nāma, tato pubbe uppajjitabbabhavavasena bhavissanti nāma. Sabbepi vā paccuppannabhavavasena bhūtā nāma, āyatiṃ punabbhavavasena bhavissanti nāma. Khīṇāsavā bhūtā nāma. Te hi bhūtā eva, na puna bhavissantīti, tadaññe bhavissanti nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbe gamissanti pahāya deha"
      },
      "nti sabbe yathāvuttabhedā sabbabhavayonigativiññāṇaṭṭhitisattāvāsādivasena anekabhedabhinnā sattā dehaṃ attano sarīraṃ pahāya nikkhipitvā paralokaṃ gamissanti, asekkhā pana nibbānaṃ. Ettha koci acavanadhammo nāma natthīti dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃ sabbajāniṃ kusalo viditvā"
      },
      "ti tadetaṃ sabbassa sattassa jāniṃ hāniṃ maraṇaṃ, sabbassa vā sattassa jāniṃ vināsaṃ pabhaṅgutaṃ kusalo paṇḍitajātiko maraṇānussativasena aniccatāmanasikāravasena vā jānitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ātāpiyo brahmacariyaṃ careyyā"
      },
      "ti vipassanāya kammaṃ karonto ātāpiyasaṅkhātena ",
      " vīriyena samannāgatattā ātāpiyo catubbidhasammappadhānavasena āraddhavīriyo anavasesamaraṇasamatikkamanūpāyaṃ maggabrahmacariyaṃ careyya, paṭipajjeyyāti attho."
    ],
    "innerText": "Sabbe gamissanti pahāya dehanti sabbe yathāvuttabhedā sabbabhavayonigativiññāṇaṭṭhitisattāvāsādivasena anekabhedabhinnā sattā dehaṃ attano sarīraṃ pahāya nikkhipitvā paralokaṃ gamissanti, asekkhā pana nibbānaṃ. Ettha koci acavanadhammo nāma natthīti dasseti. Taṃ sabbajāniṃ kusalo viditvāti tadetaṃ sabbassa sattassa jāniṃ hāniṃ maraṇaṃ, sabbassa vā sattassa jāniṃ vināsaṃ pabhaṅgutaṃ kusalo paṇḍitajātiko maraṇānussativasena aniccatāmanasikāravasena vā jānitvā. Ātāpiyo brahmacariyaṃ careyyāti vipassanāya kammaṃ karonto ātāpiyasaṅkhātena vīriyena samannāgatattā ātāpiyo catubbidhasammappadhānavasena āraddhavīriyo anavasesamaraṇasamatikkamanūpāyaṃ maggabrahmacariyaṃ careyya, paṭipajjeyyāti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dutiyasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Suppabuddhakuṭṭhisuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "43"
      },
      ". Tatiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rājagahe suppabuddho nāma kuṭṭhī ahosī"
      },
      "ti suppabuddhanāmako eko puriso rājagahe ahosi. So ca kuṭṭhī kuṭṭharogena bāḷhavidūsitagatto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Manussadaliddo"
      },
      "ti yattakā rājagahe manussā tesu sabbaduggato. So hi saṅkārakūṭavatiādīsu manussehi chaḍḍitapilotikakhaṇḍāni sibbitvā paridahati, kapālaṃ gahetvā gharā gharaṃ gantvā laddhaācāmaucchiṭṭhabhattāni nissāya jīvati, tampi pubbe katakammapaccayā na yāvadatthaṃ labhati. Tena vuttaṃ ‘‘manussadaliddo’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Manussakapaṇo"
      },
      "ti manussesu paramakapaṇataṃ patto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Manussavarāko"
      },
      "ti manussānaṃ hīḷitaparibhūtatāya ativiya dīno. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahatiyā parisāyā"
      },
      "ti mahatiyā bhikkhuparisāya ceva upāsakaparisāya ca."
    ],
    "innerText": "43. Tatiye rājagahe suppabuddho nāma kuṭṭhī ahosīti suppabuddhanāmako eko puriso rājagahe ahosi. So ca kuṭṭhī kuṭṭharogena bāḷhavidūsitagatto. Manussadaliddoti yattakā rājagahe manussā tesu sabbaduggato. So hi saṅkārakūṭavatiādīsu manussehi chaḍḍitapilotikakhaṇḍāni sibbitvā paridahati, kapālaṃ gahetvā gharā gharaṃ gantvā laddhaācāmaucchiṭṭhabhattāni nissāya jīvati, tampi pubbe katakammapaccayā na yāvadatthaṃ labhati. Tena vuttaṃ ‘‘manussadaliddo’’ti. Manussakapaṇoti manussesu paramakapaṇataṃ patto. Manussavarākoti manussānaṃ hīḷitaparibhūtatāya ativiya dīno. Mahatiyā parisāyāti mahatiyā bhikkhuparisāya ceva upāsakaparisāya ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ekadivasaṃ ",
      " kira bhagavā mahābhikkhusaṅghaparivāro rājagahaṃ piṇḍāya pavisitvā bhikkhūnaṃ sulabhapiṇḍapātaṃ katvā pacchābhattaṃ piṇḍapātappaṭikkanto katipayabhikkhuparivāro nikkhanto yehi dānaṃ dinnaṃ, tesaṃ upāsakānaṃ avasesabhikkhūnañca āgamanaṃ āgamayamāno antonagareyeva aññatarasmiṃ ramaṇīye padese aṭṭhāsi. Tāvadeva bhikkhū tato tato āgantvā bhagavantaṃ parivāresuṃ, upāsakāpi ‘‘anumodanaṃ sutvā vanditvā nivattissāmā’’ti bhagavantaṃ upasaṅkamiṃsu, mahāsannipāto ahosi. Bhagavā nisīdanākāraṃ dassesi. Tāvadeva buddhārahaṃ āsanaṃ paññāpesuṃ. Atha bhagavā asītianubyañjanappaṭimaṇḍitehi ",
      " dvattiṃsamahāpurisalakkhaṇehi virocamānāya byāmappabhāparikkhepasamujjalāya nīlapītalohitodātamañjeṭṭhapabhassarānaṃ vasena chabbaṇṇabuddharaṃsiyo vissajjentiyā anupamāya rūpakāyasiriyā sakalameva taṃ padesaṃ obhāsento tārāgaṇaparivuto viya puṇṇacando bhikkhugaṇaparivuto paññattavarabuddhāsane nisīditvā manosilātale kesarasīho viya sīhanādaṃ nadanto karavīkarutamañjunā brahmassarena dhammaṃ deseti."
    ],
    "innerText": "Ekadivasaṃ kira bhagavā mahābhikkhusaṅghaparivāro rājagahaṃ piṇḍāya pavisitvā bhikkhūnaṃ sulabhapiṇḍapātaṃ katvā pacchābhattaṃ piṇḍapātappaṭikkanto katipayabhikkhuparivāro nikkhanto yehi dānaṃ dinnaṃ, tesaṃ upāsakānaṃ avasesabhikkhūnañca āgamanaṃ āgamayamāno antonagareyeva aññatarasmiṃ ramaṇīye padese aṭṭhāsi. Tāvadeva bhikkhū tato tato āgantvā bhagavantaṃ parivāresuṃ, upāsakāpi ‘‘anumodanaṃ sutvā vanditvā nivattissāmā’’ti bhagavantaṃ upasaṅkamiṃsu, mahāsannipāto ahosi. Bhagavā nisīdanākāraṃ dassesi. Tāvadeva buddhārahaṃ āsanaṃ paññāpesuṃ. Atha bhagavā asītianubyañjanappaṭimaṇḍitehi dvattiṃsamahāpurisalakkhaṇehi virocamānāya byāmappabhāparikkhepasamujjalāya nīlapītalohitodātamañjeṭṭhapabhassarānaṃ vasena chabbaṇṇabuddharaṃsiyo vissajjentiyā anupamāya rūpakāyasiriyā sakalameva taṃ padesaṃ obhāsento tārāgaṇaparivuto viya puṇṇacando bhikkhugaṇaparivuto paññattavarabuddhāsane nisīditvā manosilātale kesarasīho viya sīhanādaṃ nadanto karavīkarutamañjunā brahmassarena dhammaṃ deseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhikkhūpi kho appicchā santuṭṭhā pavivittā asaṃsaṭṭhā āraddhavīriyā pahitattā codakā pāpagarahino vattāro vacanakkhamā sīlasampannā samādhisampannā paññāsampannā vimuttisampannā vimuttiñāṇadassanasampannā meghavaṇṇaṃ paṃsukūlacīvaraṃ pārupitvā suvammitā viya gandhahatthino bhagavantaṃ parivāretvā ohitasotā dhammaṃ suṇanti. Upāsakāpi suddhavatthanivatthā suddhuttarāsaṅgā pubbaṇhasamayaṃ mahādānāni pavattetvā gandhamālādīhi bhagavantaṃ pūjetvā vanditvā bhikkhusaṅghassa nipaccakāraṃ dassetvā bhagavantaṃ bhikkhusaṅghañca parivāretvā saṃyatahatthapādā ohitasotā sakkaccaṃ ",
      " dhammaṃ suṇanti. Tena vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tena kho pana samayena bhagavā mahatiyā parisāya parivuto dhammaṃ desento nisinno hotī’’"
      },
      "ti."
    ],
    "innerText": "Bhikkhūpi kho appicchā santuṭṭhā pavivittā asaṃsaṭṭhā āraddhavīriyā pahitattā codakā pāpagarahino vattāro vacanakkhamā sīlasampannā samādhisampannā paññāsampannā vimuttisampannā vimuttiñāṇadassanasampannā meghavaṇṇaṃ paṃsukūlacīvaraṃ pārupitvā suvammitā viya gandhahatthino bhagavantaṃ parivāretvā ohitasotā dhammaṃ suṇanti. Upāsakāpi suddhavatthanivatthā suddhuttarāsaṅgā pubbaṇhasamayaṃ mahādānāni pavattetvā gandhamālādīhi bhagavantaṃ pūjetvā vanditvā bhikkhusaṅghassa nipaccakāraṃ dassetvā bhagavantaṃ bhikkhusaṅghañca parivāretvā saṃyatahatthapādā ohitasotā sakkaccaṃ dhammaṃ suṇanti. Tena vuttaṃ – ‘‘tena kho pana samayena bhagavā mahatiyā parisāya parivuto dhammaṃ desento nisinno hotī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Suppabuddho pana jighacchādubbalyapareto ghāsapariyesanaṃ caramāno antaravīthiṃ otiṇṇo dūratova taṃ mahājanasannipātaṃ disvā, ‘‘kiṃ nu kho ayaṃ mahājanakāyo sannipatito, addhā ettha bhojanaṃ dīyati maññe, appeva nāmettha gatena kiñci khādanīyaṃ vā bhojanīyaṃ vā laddhuṃ sakkā’’ti sañjātābhilāso tattha gantvā addasa bhagavantaṃ pāsādikaṃ dassanīyaṃ ",
      " pasādanīyaṃ uttamadamathasamathamanuppattaṃ dantaṃ guttaṃ santindriyaṃ susamāhitaṃ tāya parisāya parivutaṃ dhammaṃ desentaṃ, disvāna purimajātisambhatāya paripakkāya upanissayasampattiyā codiyamāno ‘‘yaṃnūnāhampi dhammaṃ suṇeyya’’nti parisapariyante nisīdi. Taṃ sandhāya vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘addasā kho suppabuddho kuṭṭhī…pe… tattheva ekamantaṃ nisīdi"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘ahampi dhammaṃ sossāmī’’’"
      },
      "ti."
    ],
    "innerText": "Suppabuddho pana jighacchādubbalyapareto ghāsapariyesanaṃ caramāno antaravīthiṃ otiṇṇo dūratova taṃ mahājanasannipātaṃ disvā, ‘‘kiṃ nu kho ayaṃ mahājanakāyo sannipatito, addhā ettha bhojanaṃ dīyati maññe, appeva nāmettha gatena kiñci khādanīyaṃ vā bhojanīyaṃ vā laddhuṃ sakkā’’ti sañjātābhilāso tattha gantvā addasa bhagavantaṃ pāsādikaṃ dassanīyaṃ pasādanīyaṃ uttamadamathasamathamanuppattaṃ dantaṃ guttaṃ santindriyaṃ susamāhitaṃ tāya parisāya parivutaṃ dhammaṃ desentaṃ, disvāna purimajātisambhatāya paripakkāya upanissayasampattiyā codiyamāno ‘‘yaṃnūnāhampi dhammaṃ suṇeyya’’nti parisapariyante nisīdi. Taṃ sandhāya vuttaṃ – ‘‘addasā kho suppabuddho kuṭṭhī…pe… tattheva ekamantaṃ nisīdi‘ahampi dhammaṃ sossāmī’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbāvanta"
      },
      "nti sabbāvatiṃ hīnādisabbapuggalavataṃ, tattha kiñcipi anavasesetvāti attho. ‘‘Sabbavanta’’ntipi paṭhanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cetasā"
      },
      "ti buddhacakkhusampayuttacittena. Cittasīsena hi ñāṇaṃ niddiṭṭhaṃ, tasmā āsayānusayañāṇena indriyaparopariyattañāṇena cāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ceto paricca manasākāsī"
      },
      "ti tassā parisāya cittaṃ paccekaṃ paricchinditvā manasi akāsi te volokesi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhabbo dhammaṃ viññātu"
      },
      "nti maggaphaladhammaṃ adhigantuṃ samattho, upanissayasampannoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etadahosī"
      },
      "ti ayaṃ suppabuddho kiñcāpi tagarasikhimhi paccekabuddhe aparajjhitvā īdiso jāto, maggaphalūpanissayo panassa paṃsupaṭicchannasuvaṇṇanikkhaṃ viya antohadayeyeva vijjotati, tasmā suviññāpiyoti idaṃ ahosi. Tenāha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ayaṃ kho idha bhabbo dhammaṃ viññātu’’"
      },
      "nti."
    ],
    "innerText": "Sabbāvantanti sabbāvatiṃ hīnādisabbapuggalavataṃ, tattha kiñcipi anavasesetvāti attho. ‘‘Sabbavanta’’ntipi paṭhanti. Cetasāti buddhacakkhusampayuttacittena. Cittasīsena hi ñāṇaṃ niddiṭṭhaṃ, tasmā āsayānusayañāṇena indriyaparopariyattañāṇena cāti attho. Ceto paricca manasākāsīti tassā parisāya cittaṃ paccekaṃ paricchinditvā manasi akāsi te volokesi. Bhabbo dhammaṃ viññātunti maggaphaladhammaṃ adhigantuṃ samattho, upanissayasampannoti attho. Etadahosīti ayaṃ suppabuddho kiñcāpi tagarasikhimhi paccekabuddhe aparajjhitvā īdiso jāto, maggaphalūpanissayo panassa paṃsupaṭicchannasuvaṇṇanikkhaṃ viya antohadayeyeva vijjotati, tasmā suviññāpiyoti idaṃ ahosi. Tenāha – ‘‘ayaṃ kho idha bhabbo dhammaṃ viññātu’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anupubbiṃ katha"
      },
      "nti dānānantaraṃ sīlaṃ, sīlānantaraṃ saggaṃ, saggānantaraṃ magganti evaṃ anupaṭipāṭikathaṃ. Bhagavā hi paṭhamaṃ hetunā saddhiṃ assādaṃ dassetvā tato satte vivecetuṃ nānānayehi ādīnavaṃ pakāsetvā ādīnavasavanena saṃviggahadayānaṃ nekkhammaguṇavibhāvanamukhena ca vivaṭṭaṃ dasseti."
    ],
    "innerText": "Anupubbiṃ kathanti dānānantaraṃ sīlaṃ, sīlānantaraṃ saggaṃ, saggānantaraṃ magganti evaṃ anupaṭipāṭikathaṃ. Bhagavā hi paṭhamaṃ hetunā saddhiṃ assādaṃ dassetvā tato satte vivecetuṃ nānānayehi ādīnavaṃ pakāsetvā ādīnavasavanena saṃviggahadayānaṃ nekkhammaguṇavibhāvanamukhena ca vivaṭṭaṃ dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dānakatha"
      },
      "nti idaṃ nāma sukhānaṃ nidānaṃ, sampattīnaṃ mūlaṃ, bhogānaṃ patiṭṭhā, visamagatassa tāṇaṃ leṇaṃ gati parāyaṇaṃ, idhalokaparalokesu dānasadiso avassayo patiṭṭhā ālambanaṃ tāṇaṃ leṇaṃ gati parāyaṇaṃ natthi. Idañhi avassayaṭṭhena ratanamayasīhāsanasadisaṃ, patiṭṭhānaṭṭhena mahāpathavisadisaṃ ",
      ", ālambanaṭṭhena ālambanarajjusadisaṃ, dukkhanittharaṇaṭṭhena nāvāsadisaṃ, samassāsanaṭṭhena saṅgāmasūro, bhayaparittāṇaṭṭhena suparikhāparikkhittanagaraṃ, maccheramalādīhi anupalittaṭṭhena padumaṃ, tesaṃ nidahanaṭṭhena jātavedo, durāsadaṭṭhena āsīviso, asantāsaṭṭhena sīho, balavantaṭṭhena ",
      " hatthī, abhimaṅgalasammataṭṭhena setausabho, khemantabhūmisampāpanaṭṭhena valāhako assarājā. Dānañhi loke rajjasiriṃ deti, cakkavattisampattiṃ sakkasampattiṃ mārasampattiṃ brahmasampattiṃ sāvakapāramīñāṇaṃ ",
      " paccekabodhiñāṇaṃ sammāsambodhiñāṇaṃ detīti evamādidānaguṇappaṭisaṃyuttakathaṃ."
    ],
    "innerText": "Dānakathanti idaṃ nāma sukhānaṃ nidānaṃ, sampattīnaṃ mūlaṃ, bhogānaṃ patiṭṭhā, visamagatassa tāṇaṃ leṇaṃ gati parāyaṇaṃ, idhalokaparalokesu dānasadiso avassayo patiṭṭhā ālambanaṃ tāṇaṃ leṇaṃ gati parāyaṇaṃ natthi. Idañhi avassayaṭṭhena ratanamayasīhāsanasadisaṃ, patiṭṭhānaṭṭhena mahāpathavisadisaṃ , ālambanaṭṭhena ālambanarajjusadisaṃ, dukkhanittharaṇaṭṭhena nāvāsadisaṃ, samassāsanaṭṭhena saṅgāmasūro, bhayaparittāṇaṭṭhena suparikhāparikkhittanagaraṃ, maccheramalādīhi anupalittaṭṭhena padumaṃ, tesaṃ nidahanaṭṭhena jātavedo, durāsadaṭṭhena āsīviso, asantāsaṭṭhena sīho, balavantaṭṭhena hatthī, abhimaṅgalasammataṭṭhena setausabho, khemantabhūmisampāpanaṭṭhena valāhako assarājā. Dānañhi loke rajjasiriṃ deti, cakkavattisampattiṃ sakkasampattiṃ mārasampattiṃ brahmasampattiṃ sāvakapāramīñāṇaṃ paccekabodhiñāṇaṃ sammāsambodhiñāṇaṃ detīti evamādidānaguṇappaṭisaṃyuttakathaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yasmā pana dānaṃ dento sīlaṃ samādātuṃ sakkoti, tasmā dānakathānantaraṃ sīlakathaṃ kathesi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sīlakatha"
      },
      "nti sīlaṃ nāmetaṃ sattānaṃ avassayo patiṭṭhā ālambanaṃ tāṇaṃ leṇaṃ gati parāyaṇaṃ. Idhalokaparalokasampattīnañhi sīlasadiso avassayo patiṭṭhā ālambanaṃ tāṇaṃ leṇaṃ gati parāyaṇaṃ natthi, sīlālaṅkārasadiso alaṅkāro, sīlapupphasadisaṃ pupphaṃ, sīlagandhasadiso gandho natthi, sīlālaṅkārena hi alaṅkataṃ sīlakusumapiḷandhitaṃ sīlagandhānulittaṃ sadevako loko olokento tittiṃ na gacchatīti evamādīhi sīlaguṇappaṭisaṃyuttakathaṃ."
    ],
    "innerText": "Yasmā pana dānaṃ dento sīlaṃ samādātuṃ sakkoti, tasmā dānakathānantaraṃ sīlakathaṃ kathesi. Sīlakathanti sīlaṃ nāmetaṃ sattānaṃ avassayo patiṭṭhā ālambanaṃ tāṇaṃ leṇaṃ gati parāyaṇaṃ. Idhalokaparalokasampattīnañhi sīlasadiso avassayo patiṭṭhā ālambanaṃ tāṇaṃ leṇaṃ gati parāyaṇaṃ natthi, sīlālaṅkārasadiso alaṅkāro, sīlapupphasadisaṃ pupphaṃ, sīlagandhasadiso gandho natthi, sīlālaṅkārena hi alaṅkataṃ sīlakusumapiḷandhitaṃ sīlagandhānulittaṃ sadevako loko olokento tittiṃ na gacchatīti evamādīhi sīlaguṇappaṭisaṃyuttakathaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idaṃ pana sīlaṃ nissāya ayaṃ saggo labbhatīti dassetuṃ sīlānantaraṃ saggakathaṃ kathesi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saggakatha"
      },
      "nti saggo nāma iṭṭho kanto manāpo, niccamettha kīḷā niccasampattiyo labbhanti, cātumahārājikā devā navutivassasatasahassāni dibbasukhaṃ dibbasampattiṃ paṭilabhanti, tāvatiṃsā tisso vassakoṭiyo saṭṭhi ca vassasatasahassānīti evamādisaggaguṇappaṭisaṃyuttakathaṃ. Saggasampattiṃ kathentānañhi buddhānaṃ mukhaṃ nappahoti. Vuttampi cetaṃ ‘‘anekapariyāyena kho ahaṃ, bhikkhave, saggakathaṃ katheyya’’ntiādi."
    ],
    "innerText": "Idaṃ pana sīlaṃ nissāya ayaṃ saggo labbhatīti dassetuṃ sīlānantaraṃ saggakathaṃ kathesi. Saggakathanti saggo nāma iṭṭho kanto manāpo, niccamettha kīḷā niccasampattiyo labbhanti, cātumahārājikā devā navutivassasatasahassāni dibbasukhaṃ dibbasampattiṃ paṭilabhanti, tāvatiṃsā tisso vassakoṭiyo saṭṭhi ca vassasatasahassānīti evamādisaggaguṇappaṭisaṃyuttakathaṃ. Saggasampattiṃ kathentānañhi buddhānaṃ mukhaṃ nappahoti. Vuttampi cetaṃ ‘‘anekapariyāyena kho ahaṃ, bhikkhave, saggakathaṃ katheyya’’ntiādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ hetunā saddhiṃ saggakathāya palobhetvā puna hatthiṃ alaṅkaritvā tassa soṇḍaṃ chindanto viya ‘‘ayampi saggo anicco adhuvo, na ettha chandarāgo kātabbo’’ti dassanatthaṃ ‘‘appassādā kāmā bahudukkhā bahupāyāsā, ādīnavo ettha bhiyyo’’tiādinā (ma. ni. 1.177; 2.42) nayena kāmānaṃ ādīnavaṃ okāraṃ saṃkilesaṃ kathesi. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ādīnava"
      },
      "nti dosaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Okāra"
      },
      "nti lāmakasabhāvaṃ, aseṭṭhehi sevitabbaṃ seṭṭhehi na sevitabbaṃ nihīnasabhāvanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṃkilesa"
      },
      "nti tehi sattānaṃ saṃsāre saṃkilissanaṃ. Tenāha – ‘‘kilissanti vata bho sattā’’ti (ma. ni. 2.351)."
    ],
    "innerText": "Evaṃ hetunā saddhiṃ saggakathāya palobhetvā puna hatthiṃ alaṅkaritvā tassa soṇḍaṃ chindanto viya ‘‘ayampi saggo anicco adhuvo, na ettha chandarāgo kātabbo’’ti dassanatthaṃ ‘‘appassādā kāmā bahudukkhā bahupāyāsā, ādīnavo ettha bhiyyo’’tiādinā (ma. ni. 1.177; 2.42) nayena kāmānaṃ ādīnavaṃ okāraṃ saṃkilesaṃ kathesi. Tattha ādīnavanti dosaṃ. Okāranti lāmakasabhāvaṃ, aseṭṭhehi sevitabbaṃ seṭṭhehi na sevitabbaṃ nihīnasabhāvanti attho. Saṃkilesanti tehi sattānaṃ saṃsāre saṃkilissanaṃ. Tenāha – ‘‘kilissanti vata bho sattā’’ti (ma. ni. 2.351)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ ",
      " kāmādīnavena tajjetvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nekkhamme ānisaṃsaṃ pakāsesi"
      },
      " pabbajjāya jhānādīsu ca guṇaṃ dīpesi vaṇṇesi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kallacitta"
      },
      "ntiādīsu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kallacitta"
      },
      "nti kammaniyacittaṃ, heṭṭhā pavattitadesanāya assaddhiyādīnaṃ cittadosānaṃ ",
      " vigatattā uparidesanāya bhājanabhāvūpagamanena kammaniyacittaṃ, kammakkhamacittanti attho. Diṭṭhimānādisaṃkilesavigamena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "muducittaṃ"
      },
      ". Kāmacchandādivigamena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vinīvaraṇacittaṃ"
      },
      ". Sammāpaṭipattiyaṃ uḷārapītipāmojjayogena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "udaggacittaṃ"
      },
      ". Tattha saddhāsampattiyā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pasannacittaṃ,"
      },
      " yadā bhagavā aññāsīti sambandho."
    ],
    "innerText": "Evaṃ kāmādīnavena tajjetvā nekkhamme ānisaṃsaṃ pakāsesi pabbajjāya jhānādīsu ca guṇaṃ dīpesi vaṇṇesi. Kallacittantiādīsu kallacittanti kammaniyacittaṃ, heṭṭhā pavattitadesanāya assaddhiyādīnaṃ cittadosānaṃ vigatattā uparidesanāya bhājanabhāvūpagamanena kammaniyacittaṃ, kammakkhamacittanti attho. Diṭṭhimānādisaṃkilesavigamena muducittaṃ. Kāmacchandādivigamena vinīvaraṇacittaṃ. Sammāpaṭipattiyaṃ uḷārapītipāmojjayogena udaggacittaṃ. Tattha saddhāsampattiyā pasannacittaṃ, yadā bhagavā aññāsīti sambandho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kallacitta"
      },
      "nti kāmacchandavigamena arogacittaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Muducitta"
      },
      "nti byāpādavigamena mettāvasena akathinacittaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vinīvaraṇacitta"
      },
      "nti uddhaccakukkuccavigamena avikkhipanato na pihitacittaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Udaggacitta"
      },
      "nti thinamiddhavigamena sampaggahavasena alīnacittaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pasannacitta"
      },
      "nti vicikicchāvigamena sammāpaṭipattiyā adhimuttacittaṃ."
    ],
    "innerText": "Atha vā kallacittanti kāmacchandavigamena arogacittaṃ. Muducittanti byāpādavigamena mettāvasena akathinacittaṃ. Vinīvaraṇacittanti uddhaccakukkuccavigamena avikkhipanato na pihitacittaṃ. Udaggacittanti thinamiddhavigamena sampaggahavasena alīnacittaṃ. Pasannacittanti vicikicchāvigamena sammāpaṭipattiyā adhimuttacittaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Athā"
      },
      "ti pacchā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sāmukkaṃsikā"
      },
      "ti sāmaṃ ukkaṃsikā attanāva uddharitvā gahitā, sayambhūñāṇena sāmaṃ diṭṭhā, aññesaṃ asādhāraṇāti attho. Kā ca pana sāti? Ariyasaccadesanā. Tenevāha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘dukkhaṃ samudayaṃ nirodhaṃ magga’’"
      },
      "nti. Idañhi saccānaṃ sarūpadassanaṃ, tasmā imasmiṃ ṭhāne ariyasaccāni kathetabbāni, tāni sabbākārato vitthārena visuddhimagge (visuddhi. 2.529) vuttānīti tattha vuttanayena veditabbāni."
    ],
    "innerText": "Athāti pacchā. Sāmukkaṃsikāti sāmaṃ ukkaṃsikā attanāva uddharitvā gahitā, sayambhūñāṇena sāmaṃ diṭṭhā, aññesaṃ asādhāraṇāti attho. Kā ca pana sāti? Ariyasaccadesanā. Tenevāha – ‘‘dukkhaṃ samudayaṃ nirodhaṃ magga’’nti. Idañhi saccānaṃ sarūpadassanaṃ, tasmā imasmiṃ ṭhāne ariyasaccāni kathetabbāni, tāni sabbākārato vitthārena visuddhimagge (visuddhi. 2.529) vuttānīti tattha vuttanayena veditabbāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Seyyathāpī"
      },
      "tiādinā upamāvasena suppabuddhassa kilesappahānaṃ ariyamagguppādañca dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Apagatakāḷaka"
      },
      "nti vigatakāḷakaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammadevā"
      },
      "ti suṭṭhuyeva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rajana"
      },
      "nti nīlapītalohitamañjeṭṭhādiraṅgajātaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭiggaṇheyyā"
      },
      "ti gaṇheyya, pabhassaraṃ bhaveyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasmiṃyeva āsane"
      },
      "ti tassaṃyeva nisajjāyaṃ. Etenassa lahuvipassanakatā tikkhapaññatā sukhāpaṭipadā khippābhiññatā ca dassitā honti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Virajaṃ vītamala"
      },
      "nti apāyagamanīyarāgarajādīnaṃ abhāvena virajaṃ, anavasesadiṭṭhivicikicchāmalāpagamena vītamalaṃ. Paṭhamamaggavajjhakilesarajābhāvena vā virajaṃ, pañcavidhadussīlamalāpagamena vītamalaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammacakkhu"
      },
      "nti sotāpattimaggo adhippeto. Tassa uppattiākāradassanatthaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yaṃkiñci samudayadhammaṃ, sabbaṃ taṃ nirodhadhamma’’"
      },
      "nti vuttaṃ. Tañhi nirodhaṃ ārammaṇaṃ ",
      " katvā kiccavasena eva saṅkhatadhamme paṭivijjhantaṃ uppajjati."
    ],
    "innerText": "Seyyathāpītiādinā upamāvasena suppabuddhassa kilesappahānaṃ ariyamagguppādañca dasseti. Apagatakāḷakanti vigatakāḷakaṃ. Sammadevāti suṭṭhuyeva. Rajananti nīlapītalohitamañjeṭṭhādiraṅgajātaṃ. Paṭiggaṇheyyāti gaṇheyya, pabhassaraṃ bhaveyya. Tasmiṃyeva āsaneti tassaṃyeva nisajjāyaṃ. Etenassa lahuvipassanakatā tikkhapaññatā sukhāpaṭipadā khippābhiññatā ca dassitā honti. Virajaṃ vītamalanti apāyagamanīyarāgarajādīnaṃ abhāvena virajaṃ, anavasesadiṭṭhivicikicchāmalāpagamena vītamalaṃ. Paṭhamamaggavajjhakilesarajābhāvena vā virajaṃ, pañcavidhadussīlamalāpagamena vītamalaṃ. Dhammacakkhunti sotāpattimaggo adhippeto. Tassa uppattiākāradassanatthaṃ ‘‘yaṃkiñci samudayadhammaṃ, sabbaṃ taṃ nirodhadhamma’’nti vuttaṃ. Tañhi nirodhaṃ ārammaṇaṃ katvā kiccavasena eva saṅkhatadhamme paṭivijjhantaṃ uppajjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatridaṃ ",
      " upamāsaṃsandanaṃ – vatthaṃ viya cittaṃ daṭṭhabbaṃ, vatthassa āgantukamalehi kiliṭṭhabhāvo viya cittassa rāgādimalehi saṃkiliṭṭhabhāvo, dhovanaphalakaṃ viya anupubbikathā, udakaṃ ",
      " viya saddhā, udakena temetvā temetvā gomayakhārehi kāḷake sammadditvā vatthassa dhovanappayogo viya saddhāsalilena temetvā satisamādhipaññāhi dose sithile katvā saddhādividhinā cittassa sodhane vīriyārambho, tena payogena vatthe kāḷakāpagamo viya vīriyārambhena kilesavikkhambhanaṃ, raṅgajātaṃ viya ariyamaggo, tena suddhassa vatthassa pabhassarabhāvo viya vikkhambhitakilesassa cittassa maggena pariyodāpananti."
    ],
    "innerText": "Tatridaṃ upamāsaṃsandanaṃ – vatthaṃ viya cittaṃ daṭṭhabbaṃ, vatthassa āgantukamalehi kiliṭṭhabhāvo viya cittassa rāgādimalehi saṃkiliṭṭhabhāvo, dhovanaphalakaṃ viya anupubbikathā, udakaṃ viya saddhā, udakena temetvā temetvā gomayakhārehi kāḷake sammadditvā vatthassa dhovanappayogo viya saddhāsalilena temetvā satisamādhipaññāhi dose sithile katvā saddhādividhinā cittassa sodhane vīriyārambho, tena payogena vatthe kāḷakāpagamo viya vīriyārambhena kilesavikkhambhanaṃ, raṅgajātaṃ viya ariyamaggo, tena suddhassa vatthassa pabhassarabhāvo viya vikkhambhitakilesassa cittassa maggena pariyodāpananti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ pana suppabuddho parisapariyante nisinno dhammadesanaṃ sutvā sotāpattiphalaṃ patvā attanā paṭiladdhaguṇaṃ satthu ārocetukāmo parisamajjhaṃ ogāhituṃ avisahanto mahājanassa satthāraṃ vanditvā anugantvā nivattakāle bhagavati vihāraṃ gate sayampi vihāraṃ agamāsi. Tasmiṃ khaṇe sakko devarājā ‘‘ayaṃ suppabuddho kuṭṭhī attanā satthu sāsane paṭiladdhaguṇaṃ pākaṭaṃ kātukāmo’’ti ñatvā ‘‘vīmaṃsissāmi na’’nti gantvā ākāse ṭhito etadavoca – ‘‘suppabuddha tvaṃ manussadaliddo manussakapaṇo manussavarāko, ahaṃ te aparimitaṃ dhanaṃ dassāmi, ‘buddho na buddho, dhammo na dhammo, saṅgho na saṅgho, alaṃ me buddhena, alaṃ me dhammena, alaṃ me saṅghenā’ti vadehī’’ti. Atha naṃ so āha ‘‘kosi tva’’nti? ‘‘Ahaṃ sakko devarājā’’ti. ‘‘Andhabāla ahirika, tvaṃ mayā saddhiṃ kathetuṃ na yuttarūpo, yo tvaṃ evaṃ avattabbaṃ vadesi, apica maṃ tvaṃ ‘duggato daliddo kapaṇo’ti kasmā vadesi, nanu ahaṃ lokanāthassa orasaputto, nevāhaṃ duggato na daliddo na kapaṇo, atha kho sukhappatto paramena sukhena apāhamasmi mahaddhano’’ti vatvā āha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Saddhādhanaṃ ",
      " sīladhanaṃ, hiriottappiyaṃ dhanaṃ;"
    ],
    "innerText": "‘‘Saddhādhanaṃ sīladhanaṃ, hiriottappiyaṃ dhanaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sutadhanañca cāgo ca, paññā ve sattamaṃ dhanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yassa ete dhanā atthi, itthiyā purisassa vā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "‘Adaliddo’ti taṃ āhu, amoghaṃ tassa jīvita’’nti. (a. ni. 7.5) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Tassimāni ",
      " me satta ariyadhanāni santi. Yesañhi imāni dhanāni santi, na tveva te buddhehi vā paccekabuddhehi vā ‘daliddā’ti vuccantī’’ti."
    ],
    "innerText": "Tassimāni me satta ariyadhanāni santi. Yesañhi imāni dhanāni santi, na tveva te buddhehi vā paccekabuddhehi vā ‘daliddā’ti vuccantī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sakko tassa kathaṃ sutvā taṃ antarāmagge ohāya satthu santikaṃ gantvā sabbaṃ taṃ vacanaṃ paṭivacanañca ārocesi. Atha naṃ bhagavā āha – ‘‘na kho sakka sakkā tādisānaṃ satenapi ",
      " sahassenapi suppabuddhaṃ kuṭṭhiṃ ‘buddho na buddho, dhammo na dhammo, saṅgho na saṅgho’ti kathāpetu’’nti. Suppabuddhopi kho kuṭṭhī satthu santikaṃ gantvā satthārā katapaṭisanthāro attanā paṭiladdhaguṇaṃ ārocesi. Tena vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘atha kho suppabuddho kuṭṭhī diṭṭhadhammo’’"
      },
      "tiādi."
    ],
    "innerText": "Sakko tassa kathaṃ sutvā taṃ antarāmagge ohāya satthu santikaṃ gantvā sabbaṃ taṃ vacanaṃ paṭivacanañca ārocesi. Atha naṃ bhagavā āha – ‘‘na kho sakka sakkā tādisānaṃ satenapi sahassenapi suppabuddhaṃ kuṭṭhiṃ ‘buddho na buddho, dhammo na dhammo, saṅgho na saṅgho’ti kathāpetu’’nti. Suppabuddhopi kho kuṭṭhī satthu santikaṃ gantvā satthārā katapaṭisanthāro attanā paṭiladdhaguṇaṃ ārocesi. Tena vuttaṃ – ‘‘atha kho suppabuddho kuṭṭhī diṭṭhadhammo’’tiādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "diṭṭhadhammo"
      },
      "ti diṭṭho ariyasaccadhammo etenāti diṭṭhadhammo. Sesapadesupi eseva nayo. Tattha ‘‘diṭṭhadhammo’’ti cettha sāmaññavacano dhammasaddo. Dassanaṃ nāma ñāṇadassanato aññampi atthīti taṃ nivattanatthaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘pattadhammo’’"
      },
      "ti vuttaṃ. Patti ca ñāṇasampattito aññāpi vijjatīti tato visesanatthaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘viditadhammo’’"
      },
      "ti vuttaṃ. Sā panāyaṃ viditadhammatā dhammesu ekadesenāpi hotīti nippadesato viditabhāvaṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘pariyogāḷhadhammo’’"
      },
      "ti vuttaṃ. Tenassa yathāvuttaṃ saccābhisambodhaṃyeva dīpeti. Maggañāṇañhi ekābhisamayavasena pariññādikiccaṃ sādhentaṃ nippadesenapi pariññeyyadhammaṃ samantato ogāḷhaṃ nāma hoti, na tadaññañāṇaṃ. Tena vuttaṃ – ‘‘diṭṭho ariyasaccadhammo etenāti diṭṭhadhammo’’ti. Tenevāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tiṇṇavicikiccho’’"
      },
      "tiādi."
    ],
    "innerText": "Tattha diṭṭhadhammoti diṭṭho ariyasaccadhammo etenāti diṭṭhadhammo. Sesapadesupi eseva nayo. Tattha ‘‘diṭṭhadhammo’’ti cettha sāmaññavacano dhammasaddo. Dassanaṃ nāma ñāṇadassanato aññampi atthīti taṃ nivattanatthaṃ ‘‘pattadhammo’’ti vuttaṃ. Patti ca ñāṇasampattito aññāpi vijjatīti tato visesanatthaṃ ‘‘viditadhammo’’ti vuttaṃ. Sā panāyaṃ viditadhammatā dhammesu ekadesenāpi hotīti nippadesato viditabhāvaṃ dassetuṃ ‘‘pariyogāḷhadhammo’’ti vuttaṃ. Tenassa yathāvuttaṃ saccābhisambodhaṃyeva dīpeti. Maggañāṇañhi ekābhisamayavasena pariññādikiccaṃ sādhentaṃ nippadesenapi pariññeyyadhammaṃ samantato ogāḷhaṃ nāma hoti, na tadaññañāṇaṃ. Tena vuttaṃ – ‘‘diṭṭho ariyasaccadhammo etenāti diṭṭhadhammo’’ti. Tenevāha ‘‘tiṇṇavicikiccho’’tiādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha paṭibhayakantārasadisā soḷasavatthukā ca aṭṭhavatthukā ca tiṇṇā vicikicchā etenāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tiṇṇavicikiccho"
      },
      ". Tato eva pavattiādīsu ‘‘evaṃ nu kho, na nu kho’’ti evaṃ pavattitā vigatā samucchinnā kathaṃkathā etassāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vigatakathaṃkatho"
      },
      ". Sārajjakarānaṃ pāpadhammānaṃ pahīnattā tappaṭipakkhesu ca sīlādiguṇesu suppatiṭṭhitattā vesārajjaṃ visāradabhāvaṃ veyyattiyaṃ pattoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vesārajjappatto"
      },
      ". Nāssa paro paccayo, na parassa saddhāya ettha vattatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aparappaccayo"
      },
      ". Katthāti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘satthusāsane’’"
      },
      "ti."
    ],
    "innerText": "Tattha paṭibhayakantārasadisā soḷasavatthukā ca aṭṭhavatthukā ca tiṇṇā vicikicchā etenāti tiṇṇavicikiccho. Tato eva pavattiādīsu ‘‘evaṃ nu kho, na nu kho’’ti evaṃ pavattitā vigatā samucchinnā kathaṃkathā etassāti vigatakathaṃkatho. Sārajjakarānaṃ pāpadhammānaṃ pahīnattā tappaṭipakkhesu ca sīlādiguṇesu suppatiṭṭhitattā vesārajjaṃ visāradabhāvaṃ veyyattiyaṃ pattoti vesārajjappatto. Nāssa paro paccayo, na parassa saddhāya ettha vattatīti aparappaccayo. Katthāti āha ‘‘satthusāsane’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhikkanta"
      },
      "ntiādīsu ",
      " kiñcāpi ayaṃ abhikkantasaddo khayasundarābhirūpabbhanumodanādīsu anekesu atthesu dissati, idha pana abbhanumodane daṭṭhabbo. Teneva so pasādavasena pasaṃsāvasena ca dvikkhattuṃ vutto, sādhu sādhu, bhanteti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhikkanta"
      },
      "nti vā atikantaṃ atiiṭṭhaṃ atimanāpaṃ, atisundaranti attho. Tattha ekena abhikkantasaddena bhagavato desanaṃ thometi, ekena attano pasādaṃ."
    ],
    "innerText": "Abhikkantantiādīsu kiñcāpi ayaṃ abhikkantasaddo khayasundarābhirūpabbhanumodanādīsu anekesu atthesu dissati, idha pana abbhanumodane daṭṭhabbo. Teneva so pasādavasena pasaṃsāvasena ca dvikkhattuṃ vutto, sādhu sādhu, bhanteti vuttaṃ hoti. Abhikkantanti vā atikantaṃ atiiṭṭhaṃ atimanāpaṃ, atisundaranti attho. Tattha ekena abhikkantasaddena bhagavato desanaṃ thometi, ekena attano pasādaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ayañhettha adhippāyo – abhikkantaṃ, bhante, yadidaṃ bhagavato dhammadesanā, abhikkantaṃ, bhante, yadidaṃ bhagavato dhammadesanaṃ āgamma mama pasādoti. Bhagavato eva vā vacanaṃ abhikkantaṃ dosanāsanato, abhikkantaṃ guṇādhigamanato, tathā saddhāvaḍḍhanato, paññājananato, sātthato ",
      ", sabyañjanato, uttānapadato, gambhīratthato, kaṇṇasukhato, hadayaṅgamato, anattukkaṃsanato, aparavambhanato, karuṇāsītalato, paññāvadātato, āpātharamaṇīyato, vimaddakkhamato, suyyamānasukhato, vīmaṃsiyamānahitatoti evamādinayehi thomento padadvayaṃ āha."
    ],
    "innerText": "Ayañhettha adhippāyo – abhikkantaṃ, bhante, yadidaṃ bhagavato dhammadesanā, abhikkantaṃ, bhante, yadidaṃ bhagavato dhammadesanaṃ āgamma mama pasādoti. Bhagavato eva vā vacanaṃ abhikkantaṃ dosanāsanato, abhikkantaṃ guṇādhigamanato, tathā saddhāvaḍḍhanato, paññājananato, sātthato , sabyañjanato, uttānapadato, gambhīratthato, kaṇṇasukhato, hadayaṅgamato, anattukkaṃsanato, aparavambhanato, karuṇāsītalato, paññāvadātato, āpātharamaṇīyato, vimaddakkhamato, suyyamānasukhato, vīmaṃsiyamānahitatoti evamādinayehi thomento padadvayaṃ āha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tato parampi catūhi upamāhi desanaṃyeva thometi. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nikkujjita"
      },
      "nti adhomukhaṭṭhapitaṃ, heṭṭhāmukhajātaṃ vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ukkujjeyyā"
      },
      "ti upari mukhaṃ kareyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭicchanna"
      },
      "nti tiṇapaṇṇādinā chāditaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vivareyyā"
      },
      "ti ugghāṭeyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mūḷhassā"
      },
      "ti disāmūḷhassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Maggaṃ ācikkheyyā"
      },
      "ti hatthe gahetvā ‘‘esa maggo’’ti maggaṃ upadiseyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Andhakāre"
      },
      "ti caturaṅgasamannāgate. Ayaṃ tāva padattho."
    ],
    "innerText": "Tato parampi catūhi upamāhi desanaṃyeva thometi. Tattha nikkujjitanti adhomukhaṭṭhapitaṃ, heṭṭhāmukhajātaṃ vā. Ukkujjeyyāti upari mukhaṃ kareyya. Paṭicchannanti tiṇapaṇṇādinā chāditaṃ. Vivareyyāti ugghāṭeyya. Mūḷhassāti disāmūḷhassa. Maggaṃ ācikkheyyāti hatthe gahetvā ‘‘esa maggo’’ti maggaṃ upadiseyya. Andhakāreti caturaṅgasamannāgate. Ayaṃ tāva padattho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ayaṃ pana adhippāyayojanā ",
      " – yathā koci nikkujjitaṃ ukkujjeyya, evaṃ saddhammavimukhaṃ asaddhamme patiṭṭhitaṃ maṃ asaddhammā vuṭṭhāpentena, yathā paṭicchannaṃ vivareyya, evaṃ kassapassa bhagavato sāsanantaradhānato paṭṭhāya micchādiṭṭhigahanapaṭicchannaṃ sāsanaṃ vivarantena, yathā mūḷhassa maggaṃ ācikkheyya, evaṃ kummaggamicchāmaggappaṭipannassa me saggamokkhamaggaṃ āvikarontena, yathā andhakāre telapajjotaṃ dhāreyya, evaṃ mohandhakāre nimuggassa me buddhādiratanarūpāni apassato tappaṭicchādakamohandhakāraviddhaṃsanadesanāpajjotadhāraṇena bhagavatā nānānayehi pakāsitattā anekapariyāyena dhammo pakāsito."
    ],
    "innerText": "Ayaṃ pana adhippāyayojanā – yathā koci nikkujjitaṃ ukkujjeyya, evaṃ saddhammavimukhaṃ asaddhamme patiṭṭhitaṃ maṃ asaddhammā vuṭṭhāpentena, yathā paṭicchannaṃ vivareyya, evaṃ kassapassa bhagavato sāsanantaradhānato paṭṭhāya micchādiṭṭhigahanapaṭicchannaṃ sāsanaṃ vivarantena, yathā mūḷhassa maggaṃ ācikkheyya, evaṃ kummaggamicchāmaggappaṭipannassa me saggamokkhamaggaṃ āvikarontena, yathā andhakāre telapajjotaṃ dhāreyya, evaṃ mohandhakāre nimuggassa me buddhādiratanarūpāni apassato tappaṭicchādakamohandhakāraviddhaṃsanadesanāpajjotadhāraṇena bhagavatā nānānayehi pakāsitattā anekapariyāyena dhammo pakāsito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ ",
      " desanaṃ thometvā tāya desanāya ratanattaye pasannacitto pasannākāraṃ karonto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘esāha’’"
      },
      "ntiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "esāha"
      },
      "nti eso ahaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhagavantaṃ saraṇaṃ gacchāmī"
      },
      "ti bhagavā me saraṇaṃ parāyaṇaṃ aghassa ghātā, hitassa vidhātāti iminā adhippāyena bhagavantaṃ gacchāmi bhajāmi, evaṃ vā jānāmi bujjhāmīti. Yesañhi dhātūnaṃ gatiattho, buddhipi tesaṃ atthoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhamma"
      },
      "nti adhigatamagge sacchikatanirodhe yathānusiṭṭhaṃ paṭipajjamāne catūsu apāyesu apatamāne dhāretīti dhammo. So atthato ariyamaggo ceva nibbānañca. Vuttañhetaṃ –"
    ],
    "innerText": "Evaṃ desanaṃ thometvā tāya desanāya ratanattaye pasannacitto pasannākāraṃ karonto ‘‘esāha’’ntiādimāha. Tattha esāhanti eso ahaṃ. Bhagavantaṃ saraṇaṃ gacchāmīti bhagavā me saraṇaṃ parāyaṇaṃ aghassa ghātā, hitassa vidhātāti iminā adhippāyena bhagavantaṃ gacchāmi bhajāmi, evaṃ vā jānāmi bujjhāmīti. Yesañhi dhātūnaṃ gatiattho, buddhipi tesaṃ atthoti. Dhammanti adhigatamagge sacchikatanirodhe yathānusiṭṭhaṃ paṭipajjamāne catūsu apāyesu apatamāne dhāretīti dhammo. So atthato ariyamaggo ceva nibbānañca. Vuttañhetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Yāvatā, bhikkhave, dhammā saṅkhatā, ariyo aṭṭhaṅgiko maggo tesaṃ aggamakkhāyatī’’ti (a. ni. 4.34; itivu. 90)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Yāvatā, bhikkhave, dhammā saṅkhatā vā asaṅkhatā vā, virāgo tesaṃ aggamakkhāyatī’’ti (itivu. 90) ca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Na ",
      " kevalaṃ ariyamaggo ",
      " ceva nibbānañca, apica kho ariyaphalehi saddhiṃ pariyattidhammopi. Vuttañhetaṃ –"
    ],
    "innerText": "Na kevalaṃ ariyamaggo ceva nibbānañca, apica kho ariyaphalehi saddhiṃ pariyattidhammopi. Vuttañhetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Rāgavirāgamanejamasokaṃ, dhammamasaṅkhatamappaṭikūlaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Madhuramimaṃ paguṇaṃ suvibhattaṃ, dhammamimaṃ saraṇatthamupehī’’ti. (vi. va. 887);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettha hi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rāgavirāga"
      },
      "nti maggo vutto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anejamasoka"
      },
      "nti phalaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asaṅkhata"
      },
      "nti nibbānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appaṭikūlaṃ madhuramimaṃ paguṇaṃ suvibhatta"
      },
      "nti pariyattidhammo vuttoti."
    ],
    "innerText": "Ettha hi rāgavirāganti maggo vutto. Anejamasokanti phalaṃ. Asaṅkhatanti nibbānaṃ. Appaṭikūlaṃ madhuramimaṃ paguṇaṃ suvibhattanti pariyattidhammo vuttoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhikkhusaṅgha"
      },
      "nti diṭṭhisīlasāmaññena saṃhataṃ aṭṭhaariyapuggalasamūhaṃ. Ettāvatā suppabuddho tīṇi saraṇagamanāni paṭivedesi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upāsakaṃ maṃ bhagavā dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata"
      },
      "nti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ajjatagge"
      },
      "ti ajjataṃ ādiṃ katvā. ‘‘Ajjadagge’’tipi pāṭho, tattha dakāro padasandhikaro, ajja agge ajja ādiṃ katvāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāṇupeta"
      },
      "nti pāṇehi upetaṃ, yāva me jīvitaṃ pavattati, tāva upetaṃ anaññasatthukaṃ tīhi saraṇagamanehi saraṇaṃ gataṃ ratanattayassa upāsanato upāsakaṃ kappiyakārakaṃ maṃ bhagavā upadhāretu jānātūti attho. Imassa ca saraṇagamanaṃ ariyamaggādhigameneva nipphannaṃ, ajjhāsayaṃ pana āvikaronto evamāha."
    ],
    "innerText": "Bhikkhusaṅghanti diṭṭhisīlasāmaññena saṃhataṃ aṭṭhaariyapuggalasamūhaṃ. Ettāvatā suppabuddho tīṇi saraṇagamanāni paṭivedesi. Upāsakaṃ maṃ bhagavā dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gatanti ajjataggeti ajjataṃ ādiṃ katvā. ‘‘Ajjadagge’’tipi pāṭho, tattha dakāro padasandhikaro, ajja agge ajja ādiṃ katvāti attho. Pāṇupetanti pāṇehi upetaṃ, yāva me jīvitaṃ pavattati, tāva upetaṃ anaññasatthukaṃ tīhi saraṇagamanehi saraṇaṃ gataṃ ratanattayassa upāsanato upāsakaṃ kappiyakārakaṃ maṃ bhagavā upadhāretu jānātūti attho. Imassa ca saraṇagamanaṃ ariyamaggādhigameneva nipphannaṃ, ajjhāsayaṃ pana āvikaronto evamāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhagavato"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhāsitaṃ abhinanditvā anumoditvā"
      },
      "ti bhagavato vacanaṃ cittena abhinanditvā tameva abhinanditabhāvaṃ pakāsento vuttanayena vācāya anumoditvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhivādetvā padakkhiṇaṃ katvā pakkāmī"
      },
      "ti taṃ bhagavantaṃ pañcapatiṭṭhitena vanditvā tikkhattuṃ padakkhiṇaṃ katvā satthu guṇaninnacitto yāva dassanavisayasamatikkamā bhagavantaṃyeva pekkhamāno pañjaliko namassamāno pakkāmi."
    ],
    "innerText": "Bhagavatobhāsitaṃ abhinanditvā anumoditvāti bhagavato vacanaṃ cittena abhinanditvā tameva abhinanditabhāvaṃ pakāsento vuttanayena vācāya anumoditvā. Abhivādetvā padakkhiṇaṃ katvā pakkāmīti taṃ bhagavantaṃ pañcapatiṭṭhitena vanditvā tikkhattuṃ padakkhiṇaṃ katvā satthu guṇaninnacitto yāva dassanavisayasamatikkamā bhagavantaṃyeva pekkhamāno pañjaliko namassamāno pakkāmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pakkanto ca kuṭṭharogābhibhavena chinnahatthapādaṅguli ukkāragatto samantato vissandamānāsavo kaṇḍūtipatipīḷito ",
      " asuci duggandho jegucchatamo paramakāruññataṃ patto ‘‘nāyaṃ kāyo imassa accantasantassa paṇītatamassa ariyadhammassa ādhāro bhavituṃ yutto’’ti uppannābhisandhinā viya saggasaṃvattaniyena puññakammena okāse kate appāyukasaṃvattaniyena upacchedakena pāpakammena katūpacitena codiyamāno taruṇavacchāya dhenuyā āpatitvā mārito. Tena vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘atha kho acirapakkantaṃ suppabuddhaṃ kuṭṭhiṃ gāvī taruṇavacchā adhipatitvā jīvitā voropesī’’"
      },
      "ti."
    ],
    "innerText": "Pakkanto ca kuṭṭharogābhibhavena chinnahatthapādaṅguli ukkāragatto samantato vissandamānāsavo kaṇḍūtipatipīḷito asuci duggandho jegucchatamo paramakāruññataṃ patto ‘‘nāyaṃ kāyo imassa accantasantassa paṇītatamassa ariyadhammassa ādhāro bhavituṃ yutto’’ti uppannābhisandhinā viya saggasaṃvattaniyena puññakammena okāse kate appāyukasaṃvattaniyena upacchedakena pāpakammena katūpacitena codiyamāno taruṇavacchāya dhenuyā āpatitvā mārito. Tena vuttaṃ – ‘‘atha kho acirapakkantaṃ suppabuddhaṃ kuṭṭhiṃ gāvī taruṇavacchā adhipatitvā jīvitā voropesī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "So ",
      " kira atīte eko seṭṭhiputto hutvā attano sahāyehi tīhi seṭṭhiputtehi saddhiṃ kīḷanto ekaṃ nagarasobhiniṃ gaṇikaṃ uyyānaṃ netvā divasaṃ sampattiṃ anubhavitvā atthaṅgate sūriye sahāye etadavoca – ‘‘imissā hatthe kahāpaṇasahassaṃ bahukañca suvaṇṇaṃ mahagghāni ca pasādhanāni saṃvijjanti, imasmiṃ vane añño koci natthi, ratti ca jātā, handa imaṃ mayaṃ māretvā sabbaṃ dhanaṃ gahetvā gacchāmā’’ti. Te cattāropi janā ekajjhāsayā hutvā taṃ māretuṃ upakkamiṃsu. Sā tehi māriyamānā ‘‘ime nillajjā nikkaruṇā mayā saddhiṃ kilesasanthavaṃ katvā niraparādhaṃ maṃ kevalaṃ dhanalobhena mārenti, ekavāraṃ tāva maṃ ime mārentu, ahaṃ pana yakkhinī hutvā anekavāraṃ ime māretuṃ samatthā bhaveyya’’nti patthanaṃ katvā kālamakāsi. Tesu kira eko pakkusāti kulaputto ahosi, eko bāhiyo dārucīriyo, eko tambadāṭhiko coraghātako, eko suppabuddho kuṭṭhī, iti imesaṃ catunnaṃ janānaṃ anekasate attabhāve sā yakkhayoniyaṃ nibbattā gāvī hutvā jīvitā voropesi. Te tassa kammassa nissandena tattha ",
      " tattha antarāmaraṇaṃ pāpuṇiṃsu. Evaṃ suppabuddhassa kuṭṭhissa sahasā maraṇaṃ jātaṃ, tena vuttaṃ – ‘‘atha kho acirapakkantaṃ…pe… voropesī’’ti."
    ],
    "innerText": "So kira atīte eko seṭṭhiputto hutvā attano sahāyehi tīhi seṭṭhiputtehi saddhiṃ kīḷanto ekaṃ nagarasobhiniṃ gaṇikaṃ uyyānaṃ netvā divasaṃ sampattiṃ anubhavitvā atthaṅgate sūriye sahāye etadavoca – ‘‘imissā hatthe kahāpaṇasahassaṃ bahukañca suvaṇṇaṃ mahagghāni ca pasādhanāni saṃvijjanti, imasmiṃ vane añño koci natthi, ratti ca jātā, handa imaṃ mayaṃ māretvā sabbaṃ dhanaṃ gahetvā gacchāmā’’ti. Te cattāropi janā ekajjhāsayā hutvā taṃ māretuṃ upakkamiṃsu. Sā tehi māriyamānā ‘‘ime nillajjā nikkaruṇā mayā saddhiṃ kilesasanthavaṃ katvā niraparādhaṃ maṃ kevalaṃ dhanalobhena mārenti, ekavāraṃ tāva maṃ ime mārentu, ahaṃ pana yakkhinī hutvā anekavāraṃ ime māretuṃ samatthā bhaveyya’’nti patthanaṃ katvā kālamakāsi. Tesu kira eko pakkusāti kulaputto ahosi, eko bāhiyo dārucīriyo, eko tambadāṭhiko coraghātako, eko suppabuddho kuṭṭhī, iti imesaṃ catunnaṃ janānaṃ anekasate attabhāve sā yakkhayoniyaṃ nibbattā gāvī hutvā jīvitā voropesi. Te tassa kammassa nissandena tattha tattha antarāmaraṇaṃ pāpuṇiṃsu. Evaṃ suppabuddhassa kuṭṭhissa sahasā maraṇaṃ jātaṃ, tena vuttaṃ – ‘‘atha kho acirapakkantaṃ…pe… voropesī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha sambahulā bhikkhū tassa kālakiriyaṃ bhagavato ārocetvā abhisamparāyaṃ pucchiṃsu. Bhagavā byākāsi. Tena vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘atha kho sambahulā bhikkhū’’"
      },
      "tiādi."
    ],
    "innerText": "Atha sambahulā bhikkhū tassa kālakiriyaṃ bhagavato ārocetvā abhisamparāyaṃ pucchiṃsu. Bhagavā byākāsi. Tena vuttaṃ – ‘‘atha kho sambahulā bhikkhū’’tiādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tiṇṇaṃ saṃyojanānaṃ parikkhayā"
      },
      "ti sakkāyadiṭṭhi vicikicchā sīlabbataparāmāsoti imesaṃ tiṇṇaṃ bhavabandhanānaṃ samucchedavasena ",
      " pahānā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sotāpanno"
      },
      "ti sotasaṅkhātaṃ ariyamaggaṃ ādito panno. Vuttañhetaṃ –"
    ],
    "innerText": "Tattha tiṇṇaṃ saṃyojanānaṃ parikkhayāti sakkāyadiṭṭhi vicikicchā sīlabbataparāmāsoti imesaṃ tiṇṇaṃ bhavabandhanānaṃ samucchedavasena pahānā. Sotāpannoti sotasaṅkhātaṃ ariyamaggaṃ ādito panno. Vuttañhetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Soto sototi idaṃ, āvuso sāriputta, vuccati. Katamo nu kho, āvuso, sototi? Ayameva ariyo aṭṭhaṅgiko maggo’’tiādi (saṃ. ni. 5.1001)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avinipātadhammo"
      },
      "ti vinipatanaṃ vinipāto, nāssa vinipāto dhammoti avinipātadhammo, catūsu apāyesu upapajjanavasena apatanasabhāvoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Niyato"
      },
      "ti dhammaniyāmena sammattaniyāmena niyato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sambodhiparāyaṇo"
      },
      "ti uparimaggattayasaṅkhātā sambodhi paraṃ ayanaṃ assa gati paṭisaraṇaṃ avassaṃ pattabbanti sambodhiparāyaṇo. Etena ‘‘tassa kā gati, ko abhisamparāyo’’ti pucchāya bhaddikā eva suppabuddhassa gati, na pāpikāti ayamattho dassito. Na pana tena sampattā gati, taṃ pana pucchānusandhivasena pakāsetukāmo dhammarājā ettakameva ",
      " abhāsi. Passati hi bhagavā ‘‘mayā ettake kathite imissaṃyeva parisati anusandhikusalo eko bhikkhu suppabuddhassa kuṭṭhibhāvadāliddiyakapaṇabhāvānaṃ kāraṇaṃ pucchissati, athāhaṃ tassa taṃ kāraṇaṃ tena pucchānusandhinā pakāsetvā desanaṃ niṭṭhāpessāmī’’ti. Tenevāha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘evaṃ vutte aññataro bhikkhū’’"
      },
      "tiādi. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hetū"
      },
      "ti asādhāraṇakāraṇaṃ, sādhāraṇakāraṇaṃ pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paccayo"
      },
      "ti, ayametesaṃ viseso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yenā"
      },
      "ti yena hetunā yena paccayena ca."
    ],
    "innerText": "Avinipātadhammoti vinipatanaṃ vinipāto, nāssa vinipāto dhammoti avinipātadhammo, catūsu apāyesu upapajjanavasena apatanasabhāvoti attho. Niyatoti dhammaniyāmena sammattaniyāmena niyato. Sambodhiparāyaṇoti uparimaggattayasaṅkhātā sambodhi paraṃ ayanaṃ assa gati paṭisaraṇaṃ avassaṃ pattabbanti sambodhiparāyaṇo. Etena ‘‘tassa kā gati, ko abhisamparāyo’’ti pucchāya bhaddikā eva suppabuddhassa gati, na pāpikāti ayamattho dassito. Na pana tena sampattā gati, taṃ pana pucchānusandhivasena pakāsetukāmo dhammarājā ettakameva abhāsi. Passati hi bhagavā ‘‘mayā ettake kathite imissaṃyeva parisati anusandhikusalo eko bhikkhu suppabuddhassa kuṭṭhibhāvadāliddiyakapaṇabhāvānaṃ kāraṇaṃ pucchissati, athāhaṃ tassa taṃ kāraṇaṃ tena pucchānusandhinā pakāsetvā desanaṃ niṭṭhāpessāmī’’ti. Tenevāha – ‘‘evaṃ vutte aññataro bhikkhū’’tiādi. Tattha hetūti asādhāraṇakāraṇaṃ, sādhāraṇakāraṇaṃ pana paccayoti, ayametesaṃ viseso. Yenāti yena hetunā yena paccayena ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhūtapubba"
      },
      "nti jātapubbaṃ. Atīte kāle nibbattaṃ taṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘suppabuddho’’"
      },
      "tiādi vuttaṃ. Kadā pana bhūtanti? Atīte kira anuppanne tathāgate ",
      " bārāṇasiyā sāmantā ekasmiṃ gāme ekā kuladhītā khettaṃ rakkhati. Sā ekaṃ paccekabuddhaṃ disvā pasannacittā tassa pañcahi lājāsatehi saddhiṃ ekaṃ padumapupphaṃ datvā pañca puttasatāni patthesi. Tasmiṃyeva khaṇe pañcasatā migaluddakā paccekabuddhassa madhuramaṃsaṃ datvā ‘‘etissā puttā bhaveyyāma, tumhehi pattavisesaṃ labheyyāmā’’ti ca patthayiṃsu. Sā yāvatāyukaṃ ṭhatvā devaloke nibbattā. Tato cutā ekasmiṃ jātassare padumagabbhe nibbatti. Tameko tāpaso disvā paṭijaggi. Tassā vicarantiyā pāduddhāre pāduddhāre ",
      " bhūmito padumāni uṭṭhahanti. Eko vanacarako disvā bārāṇasirañño ārocesi. Rājā taṃ ānetvā aggamahesiṃ akāsi. Tassā kucchiyaṃ gabbho saṇṭhāsi. Mahāpadumakumāro tassā kucchiyaṃ vasi, sesā gabbhamalaṃ nissāya nibbattā, te vayappattā uyyāne padumasare kīḷantā ekekasmiṃ padume nisīditvā paripakkañāṇā saṅkhāresu khayavayaṃ paṭṭhapetvā paccekabodhiṃ pāpuṇiṃsu. Tesaṃ byākaraṇagāthā ahosi –"
    ],
    "innerText": "Bhūtapubbanti jātapubbaṃ. Atīte kāle nibbattaṃ taṃ dassetuṃ ‘‘suppabuddho’’tiādi vuttaṃ. Kadā pana bhūtanti? Atīte kira anuppanne tathāgate bārāṇasiyā sāmantā ekasmiṃ gāme ekā kuladhītā khettaṃ rakkhati. Sā ekaṃ paccekabuddhaṃ disvā pasannacittā tassa pañcahi lājāsatehi saddhiṃ ekaṃ padumapupphaṃ datvā pañca puttasatāni patthesi. Tasmiṃyeva khaṇe pañcasatā migaluddakā paccekabuddhassa madhuramaṃsaṃ datvā ‘‘etissā puttā bhaveyyāma, tumhehi pattavisesaṃ labheyyāmā’’ti ca patthayiṃsu. Sā yāvatāyukaṃ ṭhatvā devaloke nibbattā. Tato cutā ekasmiṃ jātassare padumagabbhe nibbatti. Tameko tāpaso disvā paṭijaggi. Tassā vicarantiyā pāduddhāre pāduddhāre bhūmito padumāni uṭṭhahanti. Eko vanacarako disvā bārāṇasirañño ārocesi. Rājā taṃ ānetvā aggamahesiṃ akāsi. Tassā kucchiyaṃ gabbho saṇṭhāsi. Mahāpadumakumāro tassā kucchiyaṃ vasi, sesā gabbhamalaṃ nissāya nibbattā, te vayappattā uyyāne padumasare kīḷantā ekekasmiṃ padume nisīditvā paripakkañāṇā saṅkhāresu khayavayaṃ paṭṭhapetvā paccekabodhiṃ pāpuṇiṃsu. Tesaṃ byākaraṇagāthā ahosi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Saroruhaṃ padumapalāsapatrajaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Supupphitaṃ bhamaragaṇānukiṇṇaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Aniccataṃ khayavayataṃ viditvā,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Eko care khaggavisāṇakappo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ paccekabodhiṃ abhisambuddhesu tesu pañcasu paccekabuddhasatesu abbhantaro tagarasikhī nāma paccekasambuddho gandhamādanapabbate nandamūlapabbhāre sattāhaṃ nirodhasamāpattiṃ samāpajjitvā sattāhassa accayena nirodhā vuṭṭhito ākāsena āgantvā isigilipabbate otaritvā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya rājagahaṃ piṇḍāya pāvisi. Tasmiñca samaye rājagahe eko seṭṭhiputto mahatā parivārena uyyānakīḷanatthaṃ nagarato nikkhamanto tagarasikhipaccekabuddhaṃ ",
      " disvā ‘‘ko ayaṃ bhaṇḍukāsāvavasano, kuṭṭhī bhavissati, tathā hi kuṭṭhicīvarena sarīraṃ pārupitvā gacchatī’’ti niṭṭhubhitvā apasabyaṃ katvā pakkāmi. Taṃ sandhāya vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘suppabuddho kuṭṭhī imasmiṃyeva rājagahe…pe… pakkāmī’’"
      },
      "ti."
    ],
    "innerText": "Evaṃ paccekabodhiṃ abhisambuddhesu tesu pañcasu paccekabuddhasatesu abbhantaro tagarasikhī nāma paccekasambuddho gandhamādanapabbate nandamūlapabbhāre sattāhaṃ nirodhasamāpattiṃ samāpajjitvā sattāhassa accayena nirodhā vuṭṭhito ākāsena āgantvā isigilipabbate otaritvā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya rājagahaṃ piṇḍāya pāvisi. Tasmiñca samaye rājagahe eko seṭṭhiputto mahatā parivārena uyyānakīḷanatthaṃ nagarato nikkhamanto tagarasikhipaccekabuddhaṃ disvā ‘‘ko ayaṃ bhaṇḍukāsāvavasano, kuṭṭhī bhavissati, tathā hi kuṭṭhicīvarena sarīraṃ pārupitvā gacchatī’’ti niṭṭhubhitvā apasabyaṃ katvā pakkāmi. Taṃ sandhāya vuttaṃ – ‘‘suppabuddho kuṭṭhī imasmiṃyeva rājagahe…pe… pakkāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kvāya"
      },
      "nti ko ayaṃ. Khuṃsanavasena vadati. ‘‘Kovāya’’ntipi pāḷi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kuṭṭhī"
      },
      "ti akuṭṭhiṃyeva taṃ seṭṭhi kuṭṭharogaṃ akkosavatthuṃ pāpento vadati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kuṭṭhicīvarenā"
      },
      "ti kuṭṭhīnaṃ cīvarena. Yebhuyyena hi kuṭṭhino ḍaṃsamakasasarīsapapaṭibāhanatthaṃ rogapaṭicchādanatthañca ",
      " yaṃ vā taṃ vā pilotikakhaṇḍaṃ gahetvā pārupati, evamayampīti dasseti. Paṃsukūlacīvaradharattā vā aggaḷānaṃ anekavaṇṇabhāvena kuṭṭhasarīrasadisoti hīḷento ‘‘kuṭṭhicīvarenā’’ti āha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Niṭṭhubhitvā"
      },
      "ti kheḷaṃ pātetvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Apasabyato karitvā"
      },
      "ti paṇḍitā tādisaṃ paccekabuddhaṃ disvā vanditvā padakkhiṇaṃ karonti, ayaṃ pana aviññutāya paribhavena taṃ apasabyaṃ katvā attano apasabyaṃ apadakkhiṇaṃ katvā gato. ‘‘Apasabyāmato’’tipi pāṭho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tassa kammassā"
      },
      "ti tagarasikhimhi paccekabuddhe ‘‘kvāyaṃ kuṭṭhī’’ti hīḷetvā niṭṭhubhanaapasabyakaraṇavasena pavattapāpakammassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Niraye paccitthā"
      },
      "ti niraye nirayagginā dayhittha. ‘‘Paccitvā nirayagginā’’tipi paṭhanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasseva kammassa vipākāvasesenā"
      },
      "ti yena kammena so niraye paṭisandhiṃ gaṇhi, na taṃ kammaṃ manussaloke vipākaṃ deti. Yā panassa nānakkhaṇikā cetanā tadā paccekabuddhe vippaṭipajjanavasena pavattā aparāpariyavedanīyabhūtā, sā aparāpariyavedanīyeneva puññakammena manussesu tihetukapaṭisandhiyā dinnāya pavattiyaṃ kuṭṭhibhāvaṃ dāliddiyaṃ paramakāruññataṃ āpādesi. Taṃ sandhāya kammasabhāgatāvasena ‘‘tasseva kammassa vipākavasesenā’’ti vuttaṃ. Sadisepi hi loke tabbohāro diṭṭho yathā taṃ ‘‘sā eva tittirī, tāniyeva osadhānī’’ti."
    ],
    "innerText": "Tattha kvāyanti ko ayaṃ. Khuṃsanavasena vadati. ‘‘Kovāya’’ntipi pāḷi. Kuṭṭhīti akuṭṭhiṃyeva taṃ seṭṭhi kuṭṭharogaṃ akkosavatthuṃ pāpento vadati. Kuṭṭhicīvarenāti kuṭṭhīnaṃ cīvarena. Yebhuyyena hi kuṭṭhino ḍaṃsamakasasarīsapapaṭibāhanatthaṃ rogapaṭicchādanatthañca yaṃ vā taṃ vā pilotikakhaṇḍaṃ gahetvā pārupati, evamayampīti dasseti. Paṃsukūlacīvaradharattā vā aggaḷānaṃ anekavaṇṇabhāvena kuṭṭhasarīrasadisoti hīḷento ‘‘kuṭṭhicīvarenā’’ti āha. Niṭṭhubhitvāti kheḷaṃ pātetvā. Apasabyato karitvāti paṇḍitā tādisaṃ paccekabuddhaṃ disvā vanditvā padakkhiṇaṃ karonti, ayaṃ pana aviññutāya paribhavena taṃ apasabyaṃ katvā attano apasabyaṃ apadakkhiṇaṃ katvā gato. ‘‘Apasabyāmato’’tipi pāṭho. Tassa kammassāti tagarasikhimhi paccekabuddhe ‘‘kvāyaṃ kuṭṭhī’’ti hīḷetvā niṭṭhubhanaapasabyakaraṇavasena pavattapāpakammassa. Niraye paccitthāti niraye nirayagginā dayhittha. ‘‘Paccitvā nirayagginā’’tipi paṭhanti. Tasseva kammassa vipākāvasesenāti yena kammena so niraye paṭisandhiṃ gaṇhi, na taṃ kammaṃ manussaloke vipākaṃ deti. Yā panassa nānakkhaṇikā cetanā tadā paccekabuddhe vippaṭipajjanavasena pavattā aparāpariyavedanīyabhūtā, sā aparāpariyavedanīyeneva puññakammena manussesu tihetukapaṭisandhiyā dinnāya pavattiyaṃ kuṭṭhibhāvaṃ dāliddiyaṃ paramakāruññataṃ āpādesi. Taṃ sandhāya kammasabhāgatāvasena ‘‘tasseva kammassa vipākavasesenā’’ti vuttaṃ. Sadisepi hi loke tabbohāro diṭṭho yathā taṃ ‘‘sā eva tittirī, tāniyeva osadhānī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettāvatā ‘‘ko nu kho, bhante, hetū’’ti tena bhikkhunā puṭṭhapañhaṃ vissajjetvā idāni yo ‘‘tassa kā gati, ko abhisamparāyo’’ti pubbe bhikkhūhi puṭṭhapañho, taṃ vissajjetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘so tathāgatappavedita’’"
      },
      "ntiādi vuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tathāgatappavedita"
      },
      "nti tathāgatena bhagavatā desitaṃ akkhātaṃ pakāsitanti tathāgatappaveditaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āgammā"
      },
      "ti adhigantvā, nissāya ñatvā vā. ‘‘Tathāgatappavedite dhammavinaye’’tipi pāṭho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddhaṃ samādiyī"
      },
      "ti sammāsambuddho bhagavā, svākkhāto bhagavatā dhammo, suppaṭipanno ",
      " bhagavato sāvakasaṅghoti ratanattayasannissayaṃ pubbabhāgasaddhañceva lokuttarasaddhañcāti duvidhampi ",
      " saddhaṃ sammā ādiyi. Yathā na puna ādātabbā hoti, evaṃ yāva bhavakkhayā gaṇhi, attano cittasantāne uppādesīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sīlaṃ samādiyī"
      },
      "tiādīsupi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sīla"
      },
      "nti pubbabhāgasīlena saddhiṃ maggasīlaṃ phalasīlañca ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suta"
      },
      "nti pariyattibāhusaccaṃ paṭivedhabāhusaccañcāti duvidhampi sutaṃ. Pariyattidhammāpi hi tena dhammassavanakāle saccappaṭivedhāya sāvakehi yathāladdhappakāraṃ sutā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā cāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cāga"
      },
      "nti paṭhamamaggavajjhakilesābhisaṅkhārānaṃ vossaggasaṅkhātaṃ cāgaṃ, yena ariyasāvakā deyyadhammesu muttacāgā ca honti payatapāṇī vossaggaratā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañña"
      },
      "nti saddhiṃ vipassanāpaññāya maggapaññañceva phalapaññañca."
    ],
    "innerText": "Ettāvatā ‘‘ko nu kho, bhante, hetū’’ti tena bhikkhunā puṭṭhapañhaṃ vissajjetvā idāni yo ‘‘tassa kā gati, ko abhisamparāyo’’ti pubbe bhikkhūhi puṭṭhapañho, taṃ vissajjetuṃ ‘‘so tathāgatappavedita’’ntiādi vuttaṃ. Tattha tathāgatappaveditanti tathāgatena bhagavatā desitaṃ akkhātaṃ pakāsitanti tathāgatappaveditaṃ. Āgammāti adhigantvā, nissāya ñatvā vā. ‘‘Tathāgatappavedite dhammavinaye’’tipi pāṭho. Saddhaṃ samādiyīti sammāsambuddho bhagavā, svākkhāto bhagavatā dhammo, suppaṭipanno bhagavato sāvakasaṅghoti ratanattayasannissayaṃ pubbabhāgasaddhañceva lokuttarasaddhañcāti duvidhampi saddhaṃ sammā ādiyi. Yathā na puna ādātabbā hoti, evaṃ yāva bhavakkhayā gaṇhi, attano cittasantāne uppādesīti attho. Sīlaṃ samādiyītiādīsupi eseva nayo. Sīlanti pubbabhāgasīlena saddhiṃ maggasīlaṃ phalasīlañca . Sutanti pariyattibāhusaccaṃ paṭivedhabāhusaccañcāti duvidhampi sutaṃ. Pariyattidhammāpi hi tena dhammassavanakāle saccappaṭivedhāya sāvakehi yathāladdhappakāraṃ sutā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā cāti. Cāganti paṭhamamaggavajjhakilesābhisaṅkhārānaṃ vossaggasaṅkhātaṃ cāgaṃ, yena ariyasāvakā deyyadhammesu muttacāgā ca honti payatapāṇī vossaggaratā. Paññanti saddhiṃ vipassanāpaññāya maggapaññañceva phalapaññañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāyassa bhedā"
      },
      "ti upādinnakkhandhapariccāgā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paraṃ maraṇā"
      },
      "ti tadanantaraṃ abhinibbattakkhandhagahaṇā. Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāyassa bhedā"
      },
      "ti jīvitindriyassa upacchedā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paraṃ maraṇā"
      },
      "ti cutito uddhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sugatiṃ saggaṃ loka"
      },
      "nti padattayenāpi devalokameva vadati. So hi sampattīnaṃ sobhanattā sundarā gatīti sugati, rūpādīhi visesehi suṭṭhu aggoti saggo, sabbakālaṃ sukhamevettha lokiyati, lujjatīti vā lokoti vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upapanno"
      },
      "ti paṭisandhiggahaṇavasena upagato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahabyata"
      },
      "nti sahabhāvaṃ. Vacanattho pana saha byati pavattati, vasatīti vā sahabyo, sahaṭhāyī sahavāyī vā. Tassa bhāvo sahabyatā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atirocatī"
      },
      "ti atikkamma abhibhavitvā rocati virocati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vaṇṇenā"
      },
      "ti rūpasampattiyā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yasasā"
      },
      "ti parivārena. So hi asucimakkhitaṃ jajjaraṃ mattikābhājanaṃ chaḍḍetvā anekaratanavicittaṃ pabhassararaṃsijālavinaddhasuddhajambunadabhājanaṃ gaṇhanto viya vuttappakāraṃ kaḷevaraṃ idha nikkhipitvā ekacittakkhaṇena yathāvuttaṃ dibbattabhāvaṃ mahatā parivārena saddhiṃ paṭilabhīti."
    ],
    "innerText": "Kāyassa bhedāti upādinnakkhandhapariccāgā. Paraṃ maraṇāti tadanantaraṃ abhinibbattakkhandhagahaṇā. Atha vā kāyassa bhedāti jīvitindriyassa upacchedā. Paraṃ maraṇāti cutito uddhaṃ. Sugatiṃ saggaṃ lokanti padattayenāpi devalokameva vadati. So hi sampattīnaṃ sobhanattā sundarā gatīti sugati, rūpādīhi visesehi suṭṭhu aggoti saggo, sabbakālaṃ sukhamevettha lokiyati, lujjatīti vā lokoti vuccati. Upapannoti paṭisandhiggahaṇavasena upagato. Sahabyatanti sahabhāvaṃ. Vacanattho pana saha byati pavattati, vasatīti vā sahabyo, sahaṭhāyī sahavāyī vā. Tassa bhāvo sahabyatā. Atirocatīti atikkamma abhibhavitvā rocati virocati. Vaṇṇenāti rūpasampattiyā. Yasasāti parivārena. So hi asucimakkhitaṃ jajjaraṃ mattikābhājanaṃ chaḍḍetvā anekaratanavicittaṃ pabhassararaṃsijālavinaddhasuddhajambunadabhājanaṃ gaṇhanto viya vuttappakāraṃ kaḷevaraṃ idha nikkhipitvā ekacittakkhaṇena yathāvuttaṃ dibbattabhāvaṃ mahatā parivārena saddhiṃ paṭilabhīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etamatthaṃ viditvā"
      },
      "ti etaṃ pāpānaṃ aparivajjane ādīnavaṃ, parivajjane ca ānisaṃsaṃ sabbākārato viditvā tadatthavibhāvanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "imaṃ udānaṃ udānesi"
      },
      "."
    ],
    "innerText": "Etamatthaṃ viditvāti etaṃ pāpānaṃ aparivajjane ādīnavaṃ, parivajjane ca ānisaṃsaṃ sabbākārato viditvā tadatthavibhāvanaṃ imaṃ udānaṃ udānesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tassāyaṃ ",
      " saṅkhepattho – yathā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cakkhumā"
      },
      " puriso ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "parakkame"
      },
      " kāyikavīriye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vijjamāne"
      },
      " sarīre vahante ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "visamāni"
      },
      " papātādiṭṭhānāni caṇḍabhāvena vā visamāni hatthiassaahikukkuragorūpādīni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "parivajjaye,"
      },
      " evaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jīvalokasmiṃ"
      },
      " imasmiṃ sattaloke ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṇḍito"
      },
      " sappañño puriso tāya sappaññatāya attano hitaṃ jānanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pāpāni"
      },
      " lāmakāni duccaritāni parivajjeyya. Evañhi yathāyaṃ suppabuddho tagarasikhimhi paccekabuddhe pāpaṃ aparivajjetvā mahantaṃ anayabyasanaṃ āpajji, evaṃ āpajjeyyāti adhippāyo. Yathā vā suppabuddho kuṭṭhī mama dhammadesanaṃ āgamma idāni saṃvegappatto pāpāni parivajjento uḷāraṃ visesaṃ adhigañchi, evaṃ aññopi uḷāraṃ visesādhigamaṃ icchanto pāpāni parivajjeyyāti adhippāyo."
    ],
    "innerText": "Tassāyaṃ saṅkhepattho – yathā cakkhumā puriso parakkame kāyikavīriye vijjamāne sarīre vahante visamāni papātādiṭṭhānāni caṇḍabhāvena vā visamāni hatthiassaahikukkuragorūpādīni parivajjaye, evaṃ jīvalokasmiṃ imasmiṃ sattaloke paṇḍito sappañño puriso tāya sappaññatāya attano hitaṃ jānanto pāpāni lāmakāni duccaritāni parivajjeyya. Evañhi yathāyaṃ suppabuddho tagarasikhimhi paccekabuddhe pāpaṃ aparivajjetvā mahantaṃ anayabyasanaṃ āpajji, evaṃ āpajjeyyāti adhippāyo. Yathā vā suppabuddho kuṭṭhī mama dhammadesanaṃ āgamma idāni saṃvegappatto pāpāni parivajjento uḷāraṃ visesaṃ adhigañchi, evaṃ aññopi uḷāraṃ visesādhigamaṃ icchanto pāpāni parivajjeyyāti adhippāyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tatiyasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Kumārakasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "44"
      },
      ". Catutthe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kumārakā"
      },
      "ti taruṇapuggalā. Ye subhāsitadubbhāsitassa atthaṃ jānanti, te idha kumārakāti adhippetā. Ime hi sattā jātadivasato paṭṭhāya yāva pañcadasavassakā, tāva ‘‘kumārakā, bālā’’ti ca vuccanti, tato paraṃ vīsativassāni ‘‘yuvāno’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Macchake bādhentī"
      },
      "ti maggasamīpe ekasmiṃ taḷāke nidāghakāle udake parikkhīṇe ninnaṭṭhāne ṭhitaṃ udakaṃ ussiñcitvā khuddakamacche gaṇhanti ceva hananti ca ‘‘pacitvā khādissāmā’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tenupasaṅkamī"
      },
      "ti maggato thokaṃ taḷākaṃ atikkamitvā ṭhito, tasmā ‘‘upasaṅkamī’’ti vadati. Kasmā pana upasaṅkami? Te kumārake attani vissāsaṃ janetuṃ upasaṅkami. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhāyatha vo"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vo"
      },
      "ti nipātamattaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dukkhassā"
      },
      "ti nissakke sāmivacanaṃ, dukkhasmāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appiyaṃ vo dukkha"
      },
      "nti ‘‘kiṃ tumhākaṃ sarīre uppajjanakadukkhaṃ appiyaṃ aniṭṭha’’nti pucchati."
    ],
    "innerText": "44. Catutthe kumārakāti taruṇapuggalā. Ye subhāsitadubbhāsitassa atthaṃ jānanti, te idha kumārakāti adhippetā. Ime hi sattā jātadivasato paṭṭhāya yāva pañcadasavassakā, tāva ‘‘kumārakā, bālā’’ti ca vuccanti, tato paraṃ vīsativassāni ‘‘yuvāno’’ti. Macchake bādhentīti maggasamīpe ekasmiṃ taḷāke nidāghakāle udake parikkhīṇe ninnaṭṭhāne ṭhitaṃ udakaṃ ussiñcitvā khuddakamacche gaṇhanti ceva hananti ca ‘‘pacitvā khādissāmā’’ti. Tenupasaṅkamīti maggato thokaṃ taḷākaṃ atikkamitvā ṭhito, tasmā ‘‘upasaṅkamī’’ti vadati. Kasmā pana upasaṅkami? Te kumārake attani vissāsaṃ janetuṃ upasaṅkami. Bhāyatha voti ettha voti nipātamattaṃ. Dukkhassāti nissakke sāmivacanaṃ, dukkhasmāti attho. Appiyaṃ vo dukkhanti ‘‘kiṃ tumhākaṃ sarīre uppajjanakadukkhaṃ appiyaṃ aniṭṭha’’nti pucchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etamatthaṃ viditvā"
      },
      "ti ime sattā ",
      " attano dukkhaṃ anicchantā eva hutvā dukkhahetuṃ paṭipajjantā attano taṃ icchantā eva nāma hontīti etamatthaṃ sabbākārato viditvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Imaṃ udāna"
      },
      "nti imaṃ pāpakiriyāya nisedhanaṃ ādīnavavibhāvanañca udānaṃ udānesi."
    ],
    "innerText": "Etamatthaṃ viditvāti ime sattā attano dukkhaṃ anicchantā eva hutvā dukkhahetuṃ paṭipajjantā attano taṃ icchantā eva nāma hontīti etamatthaṃ sabbākārato viditvā. Imaṃ udānanti imaṃ pāpakiriyāya nisedhanaṃ ādīnavavibhāvanañca udānaṃ udānesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tassattho – yadi tumhākaṃ sakalamāpāyikaṃ, sugatiyañca appāyukatāmanussadobhaggiyādibhedaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dukkhaṃ appiyaṃ"
      },
      " aniṭṭhaṃ, yadi tumhe tato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhāyatha, āvi vā"
      },
      " paresaṃ pākaṭabhāvavasena appaṭicchannaṃ katvā kāyena ",
      " vā vācāya vā pāṇātipātādippabhedaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yadi vā raho"
      },
      " apākaṭabhāvavasena paṭicchannaṃ katvā manodvāre eva abhijjhādippabhedaṃ aṇumattampi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pāpakaṃ"
      },
      " lāmakadhammaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mākattha"
      },
      " mā karittha, atha pana taṃ pāpakammaṃ etarahi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "karotha,"
      },
      " āyatiṃ vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "karissatha,"
      },
      " nirayādīsu catūsu apāyesu manussesu ca tassa phalabhūtaṃ dukkhaṃ ito vā etto vā palāyante amhe nānubandhissatīti adhippāyena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upecca"
      },
      " apecca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "palāyata"
      },
      "mpi tumhākaṃ tato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mutti"
      },
      " mokkho natthi. Gatikālādipaccayantarasamavāye vipaccissatiyevāti dasseti. ‘‘Palāyane’’tipi paṭhanti, vuttanayena yattha katthaci gamane pakkamane satīti attho. Ayañca attho ‘‘na antalikkhe na samuddamajjhe…pe… pāpakammā’’ti (dha. pa. 127; mi. pa. 4.2.4) imāya gāthāya dīpetabbo."
    ],
    "innerText": "Tassattho – yadi tumhākaṃ sakalamāpāyikaṃ, sugatiyañca appāyukatāmanussadobhaggiyādibhedaṃ dukkhaṃ appiyaṃ aniṭṭhaṃ, yadi tumhe tato bhāyatha, āvi vā paresaṃ pākaṭabhāvavasena appaṭicchannaṃ katvā kāyena vā vācāya vā pāṇātipātādippabhedaṃ yadi vā raho apākaṭabhāvavasena paṭicchannaṃ katvā manodvāre eva abhijjhādippabhedaṃ aṇumattampi pāpakaṃ lāmakadhammaṃ mākattha mā karittha, atha pana taṃ pāpakammaṃ etarahi karotha, āyatiṃ vā karissatha, nirayādīsu catūsu apāyesu manussesu ca tassa phalabhūtaṃ dukkhaṃ ito vā etto vā palāyante amhe nānubandhissatīti adhippāyena upecca apecca palāyatampi tumhākaṃ tato mutti mokkho natthi. Gatikālādipaccayantarasamavāye vipaccissatiyevāti dasseti. ‘‘Palāyane’’tipi paṭhanti, vuttanayena yattha katthaci gamane pakkamane satīti attho. Ayañca attho ‘‘na antalikkhe na samuddamajjhe…pe… pāpakammā’’ti (dha. pa. 127; mi. pa. 4.2.4) imāya gāthāya dīpetabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Catutthasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Uposathasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "45"
      },
      ". Pañcame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tadahū"
      },
      "ti tasmiṃ ahani tasmiṃ divase. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uposathe"
      },
      "ti ettha upavasanti etthāti uposatho, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upavasantī"
      },
      "ti sīlena vā anasanena vā upetā hutvā vasantīti attho. Ayañhi uposathasaddo ‘‘aṭṭhaṅgasamannāgataṃ uposathaṃ upavasāmī’’tiādīsu (a. ni. 3.71; 10.46) sīle āgato. ‘‘Uposatho vā pavāraṇā vā’’tiādīsu (mahāva. 155) pātimokkhuddesādivinayakamme. ‘‘Gopālakūposatho nigaṇṭhūposatho’’tiādīsu (a. ni. 3.71) upavāse. ‘‘Uposatho nāma nāgarājā’’tiādīsu (dī. ni. 2.246) paññattiyaṃ. ‘‘Ajjuposatho pannaraso’’tiādīsu (mahāva. 168) divase. Idhāpi divaseyeva daṭṭhabbo, tasmā ‘‘tadahuposathe’’ti tasmiṃ uposathadivasabhūte ahanīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nisinno hotī"
      },
      "ti mahābhikkhusaṅghaparivuto ovādapātimokkhaṃ uddisituṃ nisinno hoti. Nisajja pana bhikkhūnaṃ cittāni olokento ekaṃ dussīlapuggalaṃ disvā, ‘‘sacāhaṃ imasmiṃ puggale idha nisinneyeva pātimokkhaṃ uddisissāmi, sattadhāssa muddhā phalissatī’’ti tasmiṃ anukampāya tuṇhīyeva ahosi."
    ],
    "innerText": "45. Pañcame tadahūti tasmiṃ ahani tasmiṃ divase. Uposatheti ettha upavasanti etthāti uposatho, upavasantīti sīlena vā anasanena vā upetā hutvā vasantīti attho. Ayañhi uposathasaddo ‘‘aṭṭhaṅgasamannāgataṃ uposathaṃ upavasāmī’’tiādīsu (a. ni. 3.71; 10.46) sīle āgato. ‘‘Uposatho vā pavāraṇā vā’’tiādīsu (mahāva. 155) pātimokkhuddesādivinayakamme. ‘‘Gopālakūposatho nigaṇṭhūposatho’’tiādīsu (a. ni. 3.71) upavāse. ‘‘Uposatho nāma nāgarājā’’tiādīsu (dī. ni. 2.246) paññattiyaṃ. ‘‘Ajjuposatho pannaraso’’tiādīsu (mahāva. 168) divase. Idhāpi divaseyeva daṭṭhabbo, tasmā ‘‘tadahuposathe’’ti tasmiṃ uposathadivasabhūte ahanīti attho. Nisinno hotīti mahābhikkhusaṅghaparivuto ovādapātimokkhaṃ uddisituṃ nisinno hoti. Nisajja pana bhikkhūnaṃ cittāni olokento ekaṃ dussīlapuggalaṃ disvā, ‘‘sacāhaṃ imasmiṃ puggale idha nisinneyeva pātimokkhaṃ uddisissāmi, sattadhāssa muddhā phalissatī’’ti tasmiṃ anukampāya tuṇhīyeva ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettha ",
      " ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uddhastaṃ aruṇa"
      },
      "nti aruṇuggamanaṃ vatvāpi ‘‘uddisatu, bhante bhagavā, bhikkhūnaṃ pātimokkha’’nti thero bhagavantaṃ pātimokkhuddesaṃ yāci tasmiṃ kāle ‘‘na, bhikkhave, anuposathe uposatho kātabbo’’tisikkhāpadassa (mahāva. 183) apaññattattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aparisuddhā, ānanda, parisā"
      },
      "ti tikkhattuṃ therena pātimokkhuddesassa yācitattā anuddesassa kāraṇaṃ kathento ‘‘asukapuggalo aparisuddho’’ti avatvā ‘‘aparisuddhā, ānanda, parisā’’ti āha. Kasmā pana bhagavā tiyāmarattiṃ tathā vītināmesi? Tato paṭṭhāya ovādapātimokkhaṃ anuddisitukāmo tassa vatthuṃ pākaṭaṃ kātuṃ."
    ],
    "innerText": "Ettha ca uddhastaṃ aruṇanti aruṇuggamanaṃ vatvāpi ‘‘uddisatu, bhante bhagavā, bhikkhūnaṃ pātimokkha’’nti thero bhagavantaṃ pātimokkhuddesaṃ yāci tasmiṃ kāle ‘‘na, bhikkhave, anuposathe uposatho kātabbo’’tisikkhāpadassa (mahāva. 183) apaññattattā. Aparisuddhā, ānanda, parisāti tikkhattuṃ therena pātimokkhuddesassa yācitattā anuddesassa kāraṇaṃ kathento ‘‘asukapuggalo aparisuddho’’ti avatvā ‘‘aparisuddhā, ānanda, parisā’’ti āha. Kasmā pana bhagavā tiyāmarattiṃ tathā vītināmesi? Tato paṭṭhāya ovādapātimokkhaṃ anuddisitukāmo tassa vatthuṃ pākaṭaṃ kātuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Addasā"
      },
      "ti kathaṃ addasa. Attano cetopariyañāṇena tassaṃ parisati bhikkhūnaṃ cittāni parijānanto tassa moghapurisassa dussīlyacittaṃ passi. Yasmā pana citte diṭṭhe taṃsamaṅgīpuggalo diṭṭho nāma hoti, tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘addasā kho āyasmā mahāmoggallāno taṃ puggalaṃ dussīla’’"
      },
      "ntiādi",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": " vuttaṃ"
      },
      ". Yatheva hi anāgate sattasu divasesu pavattamānaṃ paresaṃ cittaṃ cetopariyañāṇalābhī jānāti, evaṃ atītepīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dussīla"
      },
      "nti nissīlaṃ, sīlavirahitanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāpadhamma"
      },
      "nti dussīlattā eva hīnajjhāsayatāya lāmakasabhāvaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asuci"
      },
      "nti aparisuddhehi kāyakammādīhi samannāgatattā na suciṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅkassarasamācāra"
      },
      "nti kiñcideva asāruppaṃ disvā ‘‘idaṃ ",
      " iminā kataṃ bhavissatī’’ti evaṃ paresaṃ āsaṅkanīyatāya saṅkāya saritabbasamācāraṃ, atha vā kenacideva karaṇīyena mantayante bhikkhū disvā ‘‘kacci nu kho ime mayā katakammaṃ jānitvā mantentī’’ti attanoyeva saṅkāya saritabbasamācāraṃ."
    ],
    "innerText": "Addasāti kathaṃ addasa. Attano cetopariyañāṇena tassaṃ parisati bhikkhūnaṃ cittāni parijānanto tassa moghapurisassa dussīlyacittaṃ passi. Yasmā pana citte diṭṭhe taṃsamaṅgīpuggalo diṭṭho nāma hoti, tasmā ‘‘addasā kho āyasmā mahāmoggallāno taṃ puggalaṃ dussīla’’ntiādi vuttaṃ. Yatheva hi anāgate sattasu divasesu pavattamānaṃ paresaṃ cittaṃ cetopariyañāṇalābhī jānāti, evaṃ atītepīti. Dussīlanti nissīlaṃ, sīlavirahitanti attho. Pāpadhammanti dussīlattā eva hīnajjhāsayatāya lāmakasabhāvaṃ. Asucinti aparisuddhehi kāyakammādīhi samannāgatattā na suciṃ. Saṅkassarasamācāranti kiñcideva asāruppaṃ disvā ‘‘idaṃ iminā kataṃ bhavissatī’’ti evaṃ paresaṃ āsaṅkanīyatāya saṅkāya saritabbasamācāraṃ, atha vā kenacideva karaṇīyena mantayante bhikkhū disvā ‘‘kacci nu kho ime mayā katakammaṃ jānitvā mantentī’’ti attanoyeva saṅkāya saritabbasamācāraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Lajjitabbatāya paṭicchādetabbakāraṇato paṭicchannaṃ kammantaṃ etassāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭicchannakammantaṃ"
      },
      ". Kucchitasamaṇavesadhāritāya na samaṇanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "assamaṇaṃ"
      },
      ". Salākaggahaṇādīsu ‘‘kittakā samaṇā’’ti ca gaṇanāya ‘‘ahampi samaṇomhī’’ti micchāpaṭiññāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samaṇapaṭiññaṃ"
      },
      ". Aseṭṭhacāritāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abrahmacāriṃ"
      },
      ". Aññe brahmacārino sunivatthe supārute supattadhare gāmanigamādīsu piṇḍāya caritvā jīvikaṃ kappente disvā abrahmacārī samāno sayampi tādisena ākārena paṭipajjanto uposathādīsu sandissanto ‘‘ahampi ",
      " brahmacārī’’ti paṭiññaṃ dento viya hotīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "brahmacāripaṭiññaṃ"
      },
      ". Pūtinā kammena sīlavipattiyā anto anupaviṭṭhattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "antopūtiṃ"
      },
      ". Chahi dvārehi rāgādikilesavassanena tintattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avassutaṃ"
      },
      ". Sañjātarāgādikacavarattā sīlavantehi chaḍḍetabbattā ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kasambujātaṃ. Majjhe bhikkhusaṅghassa nisinna"
      },
      "nti saṅghapariyāpanno viya bhikkhusaṅghassa anto nisinnaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Diṭṭhosī"
      },
      "ti ayaṃ pana na pakatattoti bhagavatā diṭṭho asi. Yasmā ca evaṃ diṭṭho, tasmā natthi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "te"
      },
      " tava ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhikkhūhi saddhiṃ"
      },
      " ekakammādisaṃvāso. Yasmā pana so ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṃvāso"
      },
      " tava ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "natthi,"
      },
      " tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uṭṭhehi, āvuso"
      },
      "ti evamettha padayojanā veditabbā."
    ],
    "innerText": "Lajjitabbatāya paṭicchādetabbakāraṇato paṭicchannaṃ kammantaṃ etassāti paṭicchannakammantaṃ. Kucchitasamaṇavesadhāritāya na samaṇanti assamaṇaṃ. Salākaggahaṇādīsu ‘‘kittakā samaṇā’’ti ca gaṇanāya ‘‘ahampi samaṇomhī’’ti micchāpaṭiññāya samaṇapaṭiññaṃ. Aseṭṭhacāritāya abrahmacāriṃ. Aññe brahmacārino sunivatthe supārute supattadhare gāmanigamādīsu piṇḍāya caritvā jīvikaṃ kappente disvā abrahmacārī samāno sayampi tādisena ākārena paṭipajjanto uposathādīsu sandissanto ‘‘ahampi brahmacārī’’ti paṭiññaṃ dento viya hotīti brahmacāripaṭiññaṃ. Pūtinā kammena sīlavipattiyā anto anupaviṭṭhattā antopūtiṃ. Chahi dvārehi rāgādikilesavassanena tintattā avassutaṃ. Sañjātarāgādikacavarattā sīlavantehi chaḍḍetabbattā ca kasambujātaṃ. Majjhe bhikkhusaṅghassa nisinnanti saṅghapariyāpanno viya bhikkhusaṅghassa anto nisinnaṃ. Diṭṭhosīti ayaṃ pana na pakatattoti bhagavatā diṭṭho asi. Yasmā ca evaṃ diṭṭho, tasmā natthi te tava bhikkhūhi saddhiṃ ekakammādisaṃvāso. Yasmā pana so saṃvāso tava natthi, tasmā uṭṭhehi, āvusoti evamettha padayojanā veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatiyampi kho so puggalo tuṇhī ahosī"
      },
      "ti anekavāraṃ vatvāpi thero ‘‘sayameva nibbinno oramissatī’’ti vā, ‘‘idāni imesaṃ paṭipattiṃ jānissāmī’’ti vā adhippāyena tuṇhī ahosi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bāhāyaṃ gahetvā"
      },
      "ti bhagavatā mayā ca yāthāvato diṭṭho, yāvatatiyaṃ uṭṭhehīti vutto na uṭṭhāti, ‘‘idānissa nikkaḍḍhanakālo ",
      " mā saṅghassa uposathantarāyo ahosī’’ti taṃ bāhāyaṃ aggahesi, tathā gahetvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bahidvārakoṭṭhakā nikkhāmetvā"
      },
      "ti dvārakoṭṭhakasālato bahi nikkhāmetvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bahī"
      },
      "ti pana nikkhāmitaṭṭhānadassanaṃ, atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bahidvārakoṭṭhakā"
      },
      "ti bahidvārakoṭṭhakatopi nikkhāmetvā, na antodvārakoṭṭhakato, evaṃ ubhayathāpi vihārato bahi katvāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sūcighaṭikaṃ datvā"
      },
      "ti aggaḷasūciñca uparighaṭikañca ādahitvā, suṭṭhutaraṃ kavāṭaṃ thaketvāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yāva bāhāgahaṇāpi nāmā"
      },
      "ti iminā ‘‘aparisuddhā, ānanda, parisā’’ti vacanaṃ sutvā eva hi tena pakkamitabbaṃ siyā, evaṃ apakkamitvā yāva bāhāgahaṇāpi nāma so moghapuriso āgamessatīti acchariyamidanti dasseti. Idampi garahaṇacchariyamevāti veditabbaṃ."
    ],
    "innerText": "Tatiyampi kho so puggalo tuṇhī ahosīti anekavāraṃ vatvāpi thero ‘‘sayameva nibbinno oramissatī’’ti vā, ‘‘idāni imesaṃ paṭipattiṃ jānissāmī’’ti vā adhippāyena tuṇhī ahosi. Bāhāyaṃ gahetvāti bhagavatā mayā ca yāthāvato diṭṭho, yāvatatiyaṃ uṭṭhehīti vutto na uṭṭhāti, ‘‘idānissa nikkaḍḍhanakālo mā saṅghassa uposathantarāyo ahosī’’ti taṃ bāhāyaṃ aggahesi, tathā gahetvā. Bahidvārakoṭṭhakā nikkhāmetvāti dvārakoṭṭhakasālato bahi nikkhāmetvā. Bahīti pana nikkhāmitaṭṭhānadassanaṃ, atha vā bahidvārakoṭṭhakāti bahidvārakoṭṭhakatopi nikkhāmetvā, na antodvārakoṭṭhakato, evaṃ ubhayathāpi vihārato bahi katvāti attho. Sūcighaṭikaṃ datvāti aggaḷasūciñca uparighaṭikañca ādahitvā, suṭṭhutaraṃ kavāṭaṃ thaketvāti attho. Yāva bāhāgahaṇāpi nāmāti iminā ‘‘aparisuddhā, ānanda, parisā’’ti vacanaṃ sutvā eva hi tena pakkamitabbaṃ siyā, evaṃ apakkamitvā yāva bāhāgahaṇāpi nāma so moghapuriso āgamessatīti acchariyamidanti dasseti. Idampi garahaṇacchariyamevāti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " bhagavā cintesi – ‘‘idāni bhikkhusaṅgho abbudajāto, aparisuddhā puggalā uposathaṃ āgacchanti, na ca tathāgatā aparisuddhāya parisāya uposathaṃ karonti, pātimokkhaṃ uddisanti, anuddisante ca bhikkhusaṅghassa uposatho pacchijjati, yaṃnūnāhaṃ ito paṭṭhāya bhikkhūnaṃyeva pātimokkhuddesaṃ anujāneyya’’nti. Evaṃ pana cintetvā bhikkhūnaṃyeva pātimokkhuddesaṃ anujāni. Tena vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘atha kho bhagavā…pe… pātimokkhaṃ uddiseyyāthā’’"
      },
      "ti."
    ],
    "innerText": "Atha bhagavā cintesi – ‘‘idāni bhikkhusaṅgho abbudajāto, aparisuddhā puggalā uposathaṃ āgacchanti, na ca tathāgatā aparisuddhāya parisāya uposathaṃ karonti, pātimokkhaṃ uddisanti, anuddisante ca bhikkhusaṅghassa uposatho pacchijjati, yaṃnūnāhaṃ ito paṭṭhāya bhikkhūnaṃyeva pātimokkhuddesaṃ anujāneyya’’nti. Evaṃ pana cintetvā bhikkhūnaṃyeva pātimokkhuddesaṃ anujāni. Tena vuttaṃ – ‘‘atha kho bhagavā…pe… pātimokkhaṃ uddiseyyāthā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na dānāha"
      },
      "nti idāni ahaṃ uposathaṃ na karissāmi, pātimokkhaṃ na uddisissāmīti paccekaṃ na-kārena sambandho. Duvidhañhi pātimokkhaṃ āṇāpātimokkhaṃ ovādapātimokkhanti. Tesu ‘‘suṇātu me, bhante’’tiādikaṃ (mahāva. 134) āṇāpātimokkhaṃ, taṃ sāvakāva uddisanti, na buddhā, ayaṃ anvaddhamāsaṃ uddisiyati. ‘‘Khantī paramaṃ…pe… sabbapāpassa akaraṇaṃ…pe… anūpavādo anūpaghāto…pe… etaṃ buddhāna sāsana’’nti (dī. ni. 2.90; dha. pa. 183-185) imā pana tisso gāthā ovādapātimokkhaṃ nāma, taṃ buddhāva uddisanti, na sāvakā, channampi vassānaṃ accayena uddisanti. Dīghāyukabuddhānañhi dharamānakāle ayameva pātimokkhuddeso ",
      ", appāyukabuddhānaṃ pana paṭhamabodhiyaṃyeva. Tato paraṃ itaro, tañca kho bhikkhū eva uddisanti, na buddhā, tasmā amhākampi bhagavā vīsativassamattaṃ ovādapātimokkhaṃ uddisitvā imaṃ antarāyaṃ disvā tato paraṃ na uddisi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭhāna"
      },
      "nti akāraṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anavakāso"
      },
      "ti tasseva vevacanaṃ. Kāraṇañhi yathā tiṭṭhati ettha phalaṃ tadāyattavuttitāyāti ṭhānanti vuccati, evaṃ anavakāsotipi vuccatīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ya"
      },
      "nti kiriyāparāmasanaṃ, taṃ heṭṭhā vuttanayena yojetabbaṃ."
    ],
    "innerText": "Tattha na dānāhanti idāni ahaṃ uposathaṃ na karissāmi, pātimokkhaṃ na uddisissāmīti paccekaṃ na-kārena sambandho. Duvidhañhi pātimokkhaṃ āṇāpātimokkhaṃ ovādapātimokkhanti. Tesu ‘‘suṇātu me, bhante’’tiādikaṃ (mahāva. 134) āṇāpātimokkhaṃ, taṃ sāvakāva uddisanti, na buddhā, ayaṃ anvaddhamāsaṃ uddisiyati. ‘‘Khantī paramaṃ…pe… sabbapāpassa akaraṇaṃ…pe… anūpavādo anūpaghāto…pe… etaṃ buddhāna sāsana’’nti (dī. ni. 2.90; dha. pa. 183-185) imā pana tisso gāthā ovādapātimokkhaṃ nāma, taṃ buddhāva uddisanti, na sāvakā, channampi vassānaṃ accayena uddisanti. Dīghāyukabuddhānañhi dharamānakāle ayameva pātimokkhuddeso , appāyukabuddhānaṃ pana paṭhamabodhiyaṃyeva. Tato paraṃ itaro, tañca kho bhikkhū eva uddisanti, na buddhā, tasmā amhākampi bhagavā vīsativassamattaṃ ovādapātimokkhaṃ uddisitvā imaṃ antarāyaṃ disvā tato paraṃ na uddisi. Aṭṭhānanti akāraṇaṃ. Anavakāsoti tasseva vevacanaṃ. Kāraṇañhi yathā tiṭṭhati ettha phalaṃ tadāyattavuttitāyāti ṭhānanti vuccati, evaṃ anavakāsotipi vuccatīti. Yanti kiriyāparāmasanaṃ, taṃ heṭṭhā vuttanayena yojetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭhime, bhikkhave, mahāsamudde"
      },
      "ti ko anusandhi? Yvāyaṃ aparisuddhāya parisāya pātimokkhassa anuddeso vutto, so imasmiṃ dhammavinaye acchariyo abbhuto dhammoti taṃ aparehi sattahi acchariyabbhutadhammehi saddhiṃ vibhajitvā dassetukāmo paṭhamaṃ tāva tesaṃ upamābhāvena mahāsamudde aṭṭha acchariyabbhutadhamme dassento satthā ‘‘aṭṭhime, bhikkhave, mahāsamudde’’tiādimāha."
    ],
    "innerText": "Aṭṭhime, bhikkhave, mahāsamuddeti ko anusandhi? Yvāyaṃ aparisuddhāya parisāya pātimokkhassa anuddeso vutto, so imasmiṃ dhammavinaye acchariyo abbhuto dhammoti taṃ aparehi sattahi acchariyabbhutadhammehi saddhiṃ vibhajitvā dassetukāmo paṭhamaṃ tāva tesaṃ upamābhāvena mahāsamudde aṭṭha acchariyabbhutadhamme dassento satthā ‘‘aṭṭhime, bhikkhave, mahāsamudde’’tiādimāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pakatidevā viya na suranti na isanti na virocantīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asurā,"
      },
      " surā nāma devā, tesaṃ paṭipakkhāti vā asurā, vepacittipahārādādayo. Tesaṃ bhavanaṃ sinerussa heṭṭhābhāge, te tattha pavisantā nikkhamantā sinerupāde maṇḍapādiṃ nimminitvā kīḷantāva abhiramanti. Tattha tesaṃ ",
      " abhirati ime guṇe disvāti āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ye disvā disvā asurā mahāsamudde abhiramantī’’"
      },
      "ti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhiramantī"
      },
      "ti ratiṃ vindanti, anukkaṇṭhamānā vasantīti attho."
    ],
    "innerText": "Pakatidevā viya na suranti na isanti na virocantīti asurā, surā nāma devā, tesaṃ paṭipakkhāti vā asurā, vepacittipahārādādayo. Tesaṃ bhavanaṃ sinerussa heṭṭhābhāge, te tattha pavisantā nikkhamantā sinerupāde maṇḍapādiṃ nimminitvā kīḷantāva abhiramanti. Tattha tesaṃ abhirati ime guṇe disvāti āha – ‘‘ye disvā disvā asurā mahāsamudde abhiramantī’’ti. Tattha abhiramantīti ratiṃ vindanti, anukkaṇṭhamānā vasantīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anupubbaninno"
      },
      "tiādīni sabbāni anupaṭipāṭiyā ninnabhāvasseva vevacanāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na āyatakeneva papāto"
      },
      "ti na chinnataṭo mahāsobbho viya ",
      " ādito eva papāto. So hi tīradesato paṭṭhāya ekaṅguladvaṅgulavidatthiratanayaṭṭhiusabhaaḍḍhagāvutagāvutaḍḍhayojanādivasena gambhīro hutvā gacchanto gacchanto sinerupādamūle caturāsītiyojanasahassagambhīro hutvā ṭhitoti dasseti."
    ],
    "innerText": "Anupubbaninnotiādīni sabbāni anupaṭipāṭiyā ninnabhāvasseva vevacanāni. Na āyatakeneva papātoti na chinnataṭo mahāsobbho viya ādito eva papāto. So hi tīradesato paṭṭhāya ekaṅguladvaṅgulavidatthiratanayaṭṭhiusabhaaḍḍhagāvutagāvutaḍḍhayojanādivasena gambhīro hutvā gacchanto gacchanto sinerupādamūle caturāsītiyojanasahassagambhīro hutvā ṭhitoti dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ṭhitadhammo"
      },
      "ti ṭhitasabhāvo avaṭṭhitasabhāvo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na matena kuṇapena saṃvasatī"
      },
      "ti yena kenaci hatthiassādīnaṃ kaḷevarena saddhiṃ na saṃvasati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tīraṃ vāhetī"
      },
      "ti tīraṃ apaneti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Thalaṃ ussāretī"
      },
      "ti ",
      " hatthena gahetvā viya vīcippahāreneva thale khipati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gaṅgā yamunā"
      },
      "ti anotattadahassa dakkhiṇamukhato nikkhantanadī pañca dhārā hutvā pavattaṭṭhāne gaṅgātiādinā pañcadhā saṅkhaṃ gatā."
    ],
    "innerText": "Ṭhitadhammoti ṭhitasabhāvo avaṭṭhitasabhāvo. Na matena kuṇapena saṃvasatīti yena kenaci hatthiassādīnaṃ kaḷevarena saddhiṃ na saṃvasati. Tīraṃ vāhetīti tīraṃ apaneti. Thalaṃ ussāretīti hatthena gahetvā viya vīcippahāreneva thale khipati. Gaṅgā yamunāti anotattadahassa dakkhiṇamukhato nikkhantanadī pañca dhārā hutvā pavattaṭṭhāne gaṅgātiādinā pañcadhā saṅkhaṃ gatā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tatrāyaṃ imāsaṃ nadīnaṃ ādito paṭṭhāya uppattikathā – ayañhi jambudīpo dasasahassayojanaparimāṇo, tattha catusahassayojanappamāṇo padeso udakena ajjhotthaṭo samuddoti saṅkhaṃ gato, tisahassayojanappamāṇe manussā vasanti, tisahassayojanappamāṇe himavā patiṭṭhito ubbedhena pañcayojanasatiko caturāsītikūṭasahassapaṭimaṇḍito samantato sandamānapañcasatanadīvicitto, yattha āyāmena vitthārena gambhīratāya ca paṇṇāsayojanappamāṇo diyaḍḍhayojanasataparimaṇḍalo anotattadaho kaṇṇamuṇḍadaho rathakāradaho chaddantadaho kuṇāladaho mandākinidaho sīhapapātadahoti satta mahāsarā patiṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tesu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anotattadaho"
      },
      " sudassanakūṭaṃ cittakūṭaṃ kāḷakūṭaṃ gandhamādanakūṭaṃ kelāsakūṭanti imehi pañcahi pabbatakūṭehi parikkhitto. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sudassanakūṭaṃ"
      },
      " sovaṇṇamayaṃ tiyojanasatubbedhaṃ antovaṅkaṃ kākamukhasaṇṭhānaṃ tameva saraṃ paṭicchādetvā ṭhitaṃ, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cittakūṭaṃ"
      },
      " sattaratanamayaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāḷakūṭaṃ"
      },
      " añjanamayaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gandhamādanakūṭaṃ"
      },
      " masāragallamayaṃ abbhantare muggavaṇṇaṃ; mūlagandho, sāragandho, pheggugandho, tacagandho, papaṭikāgandho, khandhagandho, rasagandho, pupphagandho, phalagandho, pattagandhoti imehi dasahi gandhehi ussannaṃ, nānappakāraosadhasañchannaṃ, kāḷapakkhuposathadivase ādittaṃ viya aṅgāraṃ pajjalantaṃ tiṭṭhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kelāsakūṭaṃ"
      },
      " rajatamayaṃ. Sabbāni cetāni sudassanena ",
      " samānubbedhasaṇṭhānāni ",
      " tameva saraṃ paṭicchādetvā ṭhitāni. Tattha devānubhāvena nāgānubhāvena ca devo vassati, nadiyo ca sandanti, taṃ sabbampi udakaṃ anotattameva pavisati, candimasūriyā dakkhiṇena ",
      " vā uttarena vā gacchantā pabbatantarena tattha obhāsaṃ karonti, ujukaṃ gacchantā na karonti, tenevassa ‘‘anotatta’’nti saṅkhā udapādi."
    ],
    "innerText": "Tesu anotattadaho sudassanakūṭaṃ cittakūṭaṃ kāḷakūṭaṃ gandhamādanakūṭaṃ kelāsakūṭanti imehi pañcahi pabbatakūṭehi parikkhitto. Tattha sudassanakūṭaṃ sovaṇṇamayaṃ tiyojanasatubbedhaṃ antovaṅkaṃ kākamukhasaṇṭhānaṃ tameva saraṃ paṭicchādetvā ṭhitaṃ, cittakūṭaṃ sattaratanamayaṃ. Kāḷakūṭaṃ añjanamayaṃ. Gandhamādanakūṭaṃ masāragallamayaṃ abbhantare muggavaṇṇaṃ; mūlagandho, sāragandho, pheggugandho, tacagandho, papaṭikāgandho, khandhagandho, rasagandho, pupphagandho, phalagandho, pattagandhoti imehi dasahi gandhehi ussannaṃ, nānappakāraosadhasañchannaṃ, kāḷapakkhuposathadivase ādittaṃ viya aṅgāraṃ pajjalantaṃ tiṭṭhati. Kelāsakūṭaṃ rajatamayaṃ. Sabbāni cetāni sudassanena samānubbedhasaṇṭhānāni tameva saraṃ paṭicchādetvā ṭhitāni. Tattha devānubhāvena nāgānubhāvena ca devo vassati, nadiyo ca sandanti, taṃ sabbampi udakaṃ anotattameva pavisati, candimasūriyā dakkhiṇena vā uttarena vā gacchantā pabbatantarena tattha obhāsaṃ karonti, ujukaṃ gacchantā na karonti, tenevassa ‘‘anotatta’’nti saṅkhā udapādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha ratanamayamanuññasopānasilātalāni nimmacchakacchapāni phalikasadisāni nimmalūdakāni tadupabhogasattānaṃ kammanibbattāneva nahānatitthāni ca honti, yattha buddhapaccekabuddhā iddhimanto sāvakā isayo ca nahānādīni karonti, devayakkhādayo udakakīḷaṃ kīḷanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassa catūsu passesu sīhamukhaṃ, hatthimukhaṃ, assamukhaṃ, usabhamukhanti cattāri udakanikkhamanamukhāni honti, yehi catasso nadiyo sandanti. Sīhamukhena nikkhantanadītīre kesarasīhā bahutarā honti, tathā hatthimukhādīhi hatthiassausabhā. Puratthimadisato nikkhantanadī anotattaṃ tikkhattuṃ padakkhiṇaṃ katvā itarā tisso nadiyo anupagamma pācīnahimavanteneva amanussapathaṃ gantvā mahāsamuddaṃ pavisati. Pacchimadisato uttaradisato ca nikkhantanadiyopi tatheva padakkhiṇaṃ katvā pacchimahimavanteneva uttarahimavanteneva ca amanussapathaṃ gantvā mahāsamuddaṃ pavisanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dakkhiṇadisato nikkhantanadī pana taṃ tikkhattuṃ padakkhiṇaṃ katvā dakkhiṇena ujukaṃ pāsāṇapiṭṭheneva saṭṭhiyojanāni gantvā pabbataṃ paharitvā uṭṭhāya parikkhepena tigāvutappamāṇaudakadhārā hutvā ākāsena saṭṭhiyojanāni gantvā tiyaggaḷe nāma pāsāṇe patitā, pāsāṇo udakadhārāvegena bhinno. Tattha paññāsayojanappamāṇā tiyaggaḷā nāma pokkharaṇī jātā, pokkharaṇiyā kūlaṃ bhinditvā pāsāṇaṃ pavisitvā saṭṭhiyojanāni gantvā tato ghanapathaviṃ bhinditvā umaṅgena saṭṭhiyojanāni gantvā viñjhaṃ nāma tiracchānapabbataṃ paharitvā hatthatale pañcaṅgulisadisā ",
      " pañcadhārā hutvā pavattanti."
    ],
    "innerText": "Dakkhiṇadisato nikkhantanadī pana taṃ tikkhattuṃ padakkhiṇaṃ katvā dakkhiṇena ujukaṃ pāsāṇapiṭṭheneva saṭṭhiyojanāni gantvā pabbataṃ paharitvā uṭṭhāya parikkhepena tigāvutappamāṇaudakadhārā hutvā ākāsena saṭṭhiyojanāni gantvā tiyaggaḷe nāma pāsāṇe patitā, pāsāṇo udakadhārāvegena bhinno. Tattha paññāsayojanappamāṇā tiyaggaḷā nāma pokkharaṇī jātā, pokkharaṇiyā kūlaṃ bhinditvā pāsāṇaṃ pavisitvā saṭṭhiyojanāni gantvā tato ghanapathaviṃ bhinditvā umaṅgena saṭṭhiyojanāni gantvā viñjhaṃ nāma tiracchānapabbataṃ paharitvā hatthatale pañcaṅgulisadisā pañcadhārā hutvā pavattanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sā tikkhattuṃ anotattaṃ padakkhiṇaṃ katvā gataṭṭhāne ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘āvaṭṭagaṅgā’’"
      },
      "ti vuccati, ujukaṃ pāsāṇapiṭṭhena saṭṭhiyojanāni gataṭṭhāne ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kaṇhagaṅgā’’"
      },
      "ti, ākāsena ",
      " saṭṭhiyojanāni gataṭṭhāne ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ākāsagaṅgā’’"
      },
      "ti, tiyaggaḷapāsāṇe paññāsayojanokāse ṭhitā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tiyaggaḷapokkharaṇī’’"
      },
      "ti, kūlaṃ bhinditvā pāsāṇaṃ pavisitvā saṭṭhiyojanāni ",
      " gataṭṭhāne ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘bahalagaṅgā’’"
      },
      "ti, umaṅgena saṭṭhiyojanāni gataṭṭhāne ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘umaṅgagaṅgā’’"
      },
      "ti vuccati, viñjhaṃ nāma tiracchānapabbataṃ paharitvā pañcadhārā hutvā pavattaṭṭhāne gaṅgā, yamunā, aciravatī, sarabhū, mahīti pañcadhā saṅkhaṃ gatā. Evametā pañca mahānadiyo himavantato pavattantīti veditabbā."
    ],
    "innerText": "Sā tikkhattuṃ anotattaṃ padakkhiṇaṃ katvā gataṭṭhāne ‘‘āvaṭṭagaṅgā’’ti vuccati, ujukaṃ pāsāṇapiṭṭhena saṭṭhiyojanāni gataṭṭhāne ‘‘kaṇhagaṅgā’’ti, ākāsena saṭṭhiyojanāni gataṭṭhāne ‘‘ākāsagaṅgā’’ti, tiyaggaḷapāsāṇe paññāsayojanokāse ṭhitā ‘‘tiyaggaḷapokkharaṇī’’ti, kūlaṃ bhinditvā pāsāṇaṃ pavisitvā saṭṭhiyojanāni gataṭṭhāne ‘‘bahalagaṅgā’’ti, umaṅgena saṭṭhiyojanāni gataṭṭhāne ‘‘umaṅgagaṅgā’’ti vuccati, viñjhaṃ nāma tiracchānapabbataṃ paharitvā pañcadhārā hutvā pavattaṭṭhāne gaṅgā, yamunā, aciravatī, sarabhū, mahīti pañcadhā saṅkhaṃ gatā. Evametā pañca mahānadiyo himavantato pavattantīti veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nadī ninnagā"
      },
      "tiādikaṃ gottaṃ, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gaṅgā yamunā"
      },
      "tiādikaṃ nāmaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Savantiyo"
      },
      "ti yā kāci savamānā sandamānā gacchantiyo mahānadiyo vā kunnadiyo vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appentī"
      },
      "ti allīyanti osaranti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhārā"
      },
      "ti vuṭṭhidhārā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pūratta"
      },
      "nti puṇṇabhāvo. Mahāsamuddassa hi ayaṃ dhammatā – ‘‘imasmiṃ kāle devo mando jāto, jālakkhipādīni ādāya macchakacchape gaṇhissāmā’’ti vā ‘‘imasmiṃ kāle atimahantī vuṭṭhi, na labhissāma nu kho piṭṭhipasāraṇaṭṭhāna’’nti vā taṃ na sakkā vattuṃ. Paṭhamakappikakālato paṭṭhāya hi yaṃ vassitvā sinerumekhalaṃ āhacca udakaṃ ṭhitaṃ, taṃ tato ekaṅgulamattampi udakaṃ neva heṭṭhā otarati, na uddhaṃ uttarati."
    ],
    "innerText": "Tattha nadī ninnagātiādikaṃ gottaṃ, gaṅgā yamunātiādikaṃ nāmaṃ. Savantiyoti yā kāci savamānā sandamānā gacchantiyo mahānadiyo vā kunnadiyo vā. Appentīti allīyanti osaranti. Dhārāti vuṭṭhidhārā. Pūrattanti puṇṇabhāvo. Mahāsamuddassa hi ayaṃ dhammatā – ‘‘imasmiṃ kāle devo mando jāto, jālakkhipādīni ādāya macchakacchape gaṇhissāmā’’ti vā ‘‘imasmiṃ kāle atimahantī vuṭṭhi, na labhissāma nu kho piṭṭhipasāraṇaṭṭhāna’’nti vā taṃ na sakkā vattuṃ. Paṭhamakappikakālato paṭṭhāya hi yaṃ vassitvā sinerumekhalaṃ āhacca udakaṃ ṭhitaṃ, taṃ tato ekaṅgulamattampi udakaṃ neva heṭṭhā otarati, na uddhaṃ uttarati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekaraso"
      },
      "ti asambhinnaraso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Muttā"
      },
      "ti khuddakamahantavaṭṭadīghādibhedā anekavidhā muttā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Maṇī"
      },
      "ti rattanīlādibhedo anekavidho maṇi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Veḷuriyo"
      },
      "ti vaṃsavaṇṇasirīsapupphavaṇṇādisaṇṭhānato anekavidho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅkho"
      },
      "ti dakkhiṇāvattatambakucchikadhamanasaṅkhādibhedo anekavidho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Silā"
      },
      "ti setakāḷamuggavaṇṇādibhedā anekavidhā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pavāḷa"
      },
      "nti khuddakamahantamandarattaghanarattādibhedaṃ anekavidhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lohitaṅgo"
      },
      "ti padumarāgādibhedo anekavidho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "masāragalla"
      },
      "nti kabaramaṇi. ‘‘Cittaphalika’’ntipi vadanti."
    ],
    "innerText": "Ekarasoti asambhinnaraso. Muttāti khuddakamahantavaṭṭadīghādibhedā anekavidhā muttā. Maṇīti rattanīlādibhedo anekavidho maṇi. Veḷuriyoti vaṃsavaṇṇasirīsapupphavaṇṇādisaṇṭhānato anekavidho. Saṅkhoti dakkhiṇāvattatambakucchikadhamanasaṅkhādibhedo anekavidho. Silāti setakāḷamuggavaṇṇādibhedā anekavidhā. Pavāḷanti khuddakamahantamandarattaghanarattādibhedaṃ anekavidhaṃ. Lohitaṅgoti padumarāgādibhedo anekavidho masāragallanti kabaramaṇi. ‘‘Cittaphalika’’ntipi vadanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahataṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhūtāna"
      },
      "nti mahantānaṃ sattānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Timitimiṅgalā"
      },
      "dikā tisso macchajātiyo. Timiṃ gilanasamatthā timiṅgalā, timiñca timiṅgalañca gilanasamatthā ‘‘timitimiṅgalā’’ti vadanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nāgā"
      },
      "ti ūmipiṭṭhivāsinopi vimānaṭṭhakanāgāpi."
    ],
    "innerText": "Mahataṃbhūtānanti mahantānaṃ sattānaṃ. Timitimiṅgalādikā tisso macchajātiyo. Timiṃ gilanasamatthā timiṅgalā, timiñca timiṅgalañca gilanasamatthā ‘‘timitimiṅgalā’’ti vadanti. Nāgāti ūmipiṭṭhivāsinopi vimānaṭṭhakanāgāpi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evameva"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kho"
      },
      "ti kiñcāpi satthā imasmiṃ dhammavinaye soḷasapi bāttiṃsapi tato bhiyyopi acchariyabbhutadhamme vibhajitvā dassetuṃ sakkoti, tadā upamābhāvena pana gahitānaṃ aṭṭhannaṃ anurūpavasena aṭṭheva te upametabbadhamme vibhajitvā dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘evameva kho, bhikkhave, imasmiṃ dhammavinaye aṭṭha acchariyā abbhutā dhammā’’"
      },
      "tiādimāha."
    ],
    "innerText": "Evamevakhoti kiñcāpi satthā imasmiṃ dhammavinaye soḷasapi bāttiṃsapi tato bhiyyopi acchariyabbhutadhamme vibhajitvā dassetuṃ sakkoti, tadā upamābhāvena pana gahitānaṃ aṭṭhannaṃ anurūpavasena aṭṭheva te upametabbadhamme vibhajitvā dassento ‘‘evameva kho, bhikkhave, imasmiṃ dhammavinaye aṭṭha acchariyā abbhutā dhammā’’tiādimāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anupubbasikkhāya"
      },
      " tisso bhikkhā gahitā, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anupubbakiriyāya"
      },
      " terasa dhutaṅgadhammā, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anupubbapaṭipadāya"
      },
      " satta anupassanā aṭṭhārasa mahāvipassanā aṭṭhatiṃsa ārammaṇavibhattiyo sattatiṃsa bodhipakkhiyadhammā ca gahitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na āyatakeneva aññāpaṭivedho"
      },
      "ti maṇḍūkassa uppatitvā gamanaṃ viya āditova sīlapūraṇādīni akatvā arahattapaṭivedho nāma natthi, paṭipāṭiyā pana sīlasamādhipaññāyo pūretvāva arahattappattīti attho."
    ],
    "innerText": "Tattha anupubbasikkhāya tisso bhikkhā gahitā, anupubbakiriyāya terasa dhutaṅgadhammā, anupubbapaṭipadāya satta anupassanā aṭṭhārasa mahāvipassanā aṭṭhatiṃsa ārammaṇavibhattiyo sattatiṃsa bodhipakkhiyadhammā ca gahitā. Na āyatakeneva aññāpaṭivedhoti maṇḍūkassa uppatitvā gamanaṃ viya āditova sīlapūraṇādīni akatvā arahattapaṭivedho nāma natthi, paṭipāṭiyā pana sīlasamādhipaññāyo pūretvāva arahattappattīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mama sāvakā"
      },
      "ti sotāpannādike ariyapuggale sandhāya vadati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na saṃvasatī"
      },
      "ti uposathakammādivasena saṃvāsaṃ na karoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ukkhipatī"
      },
      "ti apaneti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ārakāvā"
      },
      "ti dūreyeva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na tena nibbānadhātuyā ūnattaṃ vā pūrattaṃ vā"
      },
      "ti asaṅkhyeyyepi mahākappe buddhesu anuppajjantesu ekasattopi parinibbātuṃ na sakkoti, tadāpi ‘‘tucchā nibbānadhātū’’ti na sakkā vattuṃ, buddhakāle pana ekekasmiṃ samāgame asaṅkhyeyyāpi sattā amataṃ ārādhenti, tadāpi na sakkā vattuṃ ‘‘pūrā nibbānadhātū’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vimuttiraso"
      },
      "ti kilesehi vimuccanaraso. Sabbā hi sāsanassa sampatti yāvadeva anupādāya āsavehi cittassa vimuttiyā hoti."
    ],
    "innerText": "Mama sāvakāti sotāpannādike ariyapuggale sandhāya vadati. Na saṃvasatīti uposathakammādivasena saṃvāsaṃ na karoti. Ukkhipatīti apaneti. Ārakāvāti dūreyeva. Na tena nibbānadhātuyā ūnattaṃ vā pūrattaṃ vāti asaṅkhyeyyepi mahākappe buddhesu anuppajjantesu ekasattopi parinibbātuṃ na sakkoti, tadāpi ‘‘tucchā nibbānadhātū’’ti na sakkā vattuṃ, buddhakāle pana ekekasmiṃ samāgame asaṅkhyeyyāpi sattā amataṃ ārādhenti, tadāpi na sakkā vattuṃ ‘‘pūrā nibbānadhātū’’ti. Vimuttirasoti kilesehi vimuccanaraso. Sabbā hi sāsanassa sampatti yāvadeva anupādāya āsavehi cittassa vimuttiyā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ratanānī"
      },
      "ti ratijananaṭṭhena ratanāni. Satipaṭṭhānādayo hi bhāviyamānā pubbabhāgepi anappakaṃ pītipāmojjaṃ nibbattenti, pageva aparabhāge. Vuttañhetaṃ –"
    ],
    "innerText": "Ratanānīti ratijananaṭṭhena ratanāni. Satipaṭṭhānādayo hi bhāviyamānā pubbabhāgepi anappakaṃ pītipāmojjaṃ nibbattenti, pageva aparabhāge. Vuttañhetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Yato ",
      " yato sammasati, khandhānaṃ udayabbayaṃ;"
    ],
    "innerText": "‘‘Yato yato sammasati, khandhānaṃ udayabbayaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Labhatī pītipāmojjaṃ, amataṃ taṃ vijānata’’nti. (dha. pa. 374) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Lokiyaratananimittaṃ pana pītipāmojjaṃ na tassa kalabhāgampi agghatīti ayamattho heṭṭhā dassito eva. Apica –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Cittīkataṃ ",
      " mahagghañca, atulaṃ dullabhadassanaṃ;"
    ],
    "innerText": "‘‘Cittīkataṃ mahagghañca, atulaṃ dullabhadassanaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Anomasattaparibhogaṃ, ‘ratana’nti pavuccatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yadi ca cittīkatādibhāvena ratanaṃ nāma hoti, satipaṭṭhānādīnaṃyeva bhūtato ratanabhāvo. Bodhipakkhiyadhammānañhi so ānubhāvo, yaṃ sāvakā sāvakapāramīñāṇaṃ, paccekabuddhā paccekabodhiñāṇaṃ, sammāsambuddhā sammāsambodhiṃ adhigacchantīti āsannakāraṇattā. Paramparakāraṇañhi dānādiupanissayoti evaṃ ratijananaṭṭhena cittīkatādiatthena ca ratanabhāvo bodhipakkhiyadhammānaṃ ",
      " sātisayo. Tena vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tatrimāni ratanāni, seyyathidaṃ, cattāro satipaṭṭhānā’’"
      },
      "tiādi."
    ],
    "innerText": "Yadi ca cittīkatādibhāvena ratanaṃ nāma hoti, satipaṭṭhānādīnaṃyeva bhūtato ratanabhāvo. Bodhipakkhiyadhammānañhi so ānubhāvo, yaṃ sāvakā sāvakapāramīñāṇaṃ, paccekabuddhā paccekabodhiñāṇaṃ, sammāsambuddhā sammāsambodhiṃ adhigacchantīti āsannakāraṇattā. Paramparakāraṇañhi dānādiupanissayoti evaṃ ratijananaṭṭhena cittīkatādiatthena ca ratanabhāvo bodhipakkhiyadhammānaṃ sātisayo. Tena vuttaṃ – ‘‘tatrimāni ratanāni, seyyathidaṃ, cattāro satipaṭṭhānā’’tiādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ārammaṇe pakkhanditvā upaṭṭhānaṭṭhena paṭṭhānaṃ, satiyeva paṭṭhānaṃ satipaṭṭhānaṃ. Ārammaṇassa pana kāyādivasena catubbidhattā vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘cattāro satipaṭṭhānā’’"
      },
      "ti. Tathā hi kāyavedanācittadhammesu subhasukhaniccaattasaññānaṃ pahānato asubhadukkhāniccānattatāgahaṇato ca nesaṃ kāyānupassanādibhāvo vibhatto."
    ],
    "innerText": "Tattha ārammaṇe pakkhanditvā upaṭṭhānaṭṭhena paṭṭhānaṃ, satiyeva paṭṭhānaṃ satipaṭṭhānaṃ. Ārammaṇassa pana kāyādivasena catubbidhattā vuttaṃ ‘‘cattāro satipaṭṭhānā’’ti. Tathā hi kāyavedanācittadhammesu subhasukhaniccaattasaññānaṃ pahānato asubhadukkhāniccānattatāgahaṇato ca nesaṃ kāyānupassanādibhāvo vibhatto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sammā padahanti etena, sayaṃ vā sammā padahati, pasatthaṃ, sundaraṃ vā padahanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammappadhānaṃ"
      },
      ". Puggalassa vā sammadeva padhānabhāvakaraṇato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammappadhānaṃ"
      },
      ". Vīriyassetaṃ adhivacanaṃ. Tampi anuppannuppannānaṃ akusalānaṃ anuppādanapahānavasena anuppannuppannānaṃ kusalānaṃ dhammānaṃ uppādanabhāvanavasena ca catukiccaṃ katvā vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘cattāro sammappadhānā’’"
      },
      "ti."
    ],
    "innerText": "Sammā padahanti etena, sayaṃ vā sammā padahati, pasatthaṃ, sundaraṃ vā padahanti sammappadhānaṃ. Puggalassa vā sammadeva padhānabhāvakaraṇato sammappadhānaṃ. Vīriyassetaṃ adhivacanaṃ. Tampi anuppannuppannānaṃ akusalānaṃ anuppādanapahānavasena anuppannuppannānaṃ kusalānaṃ dhammānaṃ uppādanabhāvanavasena ca catukiccaṃ katvā vuttaṃ ‘‘cattāro sammappadhānā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ijjhatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "iddhi,"
      },
      " samijjhati nipphajjatīti attho. Ijjhanti vā etāya sattā iddhā vuddhā ukkaṃsagatā hontīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "iddhi"
      },
      ". Iti paṭhamena atthena iddhi eva pādo iddhipādo, iddhikoṭṭhāsoti attho ",
      ". Dutiyena atthena iddhiyā pādo patiṭṭhā adhigamūpāyoti iddhipādo. Tena hi uparūparivisesasaṅkhātaṃ iddhiṃ pajjanti pāpuṇanti, svāyaṃ iddhipādo yasmā chandādike cattāro adhipatidhamme dhure jeṭṭhake katvā nibbattiyati, tasmā vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘cattāro iddhipādā’’"
      },
      "ti."
    ],
    "innerText": "Ijjhatīti iddhi, samijjhati nipphajjatīti attho. Ijjhanti vā etāya sattā iddhā vuddhā ukkaṃsagatā hontīti iddhi. Iti paṭhamena atthena iddhi eva pādo iddhipādo, iddhikoṭṭhāsoti attho . Dutiyena atthena iddhiyā pādo patiṭṭhā adhigamūpāyoti iddhipādo. Tena hi uparūparivisesasaṅkhātaṃ iddhiṃ pajjanti pāpuṇanti, svāyaṃ iddhipādo yasmā chandādike cattāro adhipatidhamme dhure jeṭṭhake katvā nibbattiyati, tasmā vuttaṃ ‘‘cattāro iddhipādā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañcindriyānī"
      },
      "ti saddhādīni pañca indriyāni. Tattha assaddhiyaṃ abhibhavitvā adhimokkhalakkhaṇe indaṭṭhaṃ kāretīti saddhindriyaṃ, kosajjaṃ abhibhavitvā paggahalakkhaṇe ",
      ", pamādaṃ abhibhavitvā upaṭṭhānalakkhaṇe, vikkhepaṃ abhibhavitvā avikkhepalakkhaṇe, aññāṇaṃ abhibhavitvā dassanalakkhaṇe indaṭṭhaṃ kāretīti paññindriyaṃ."
    ],
    "innerText": "Pañcindriyānīti saddhādīni pañca indriyāni. Tattha assaddhiyaṃ abhibhavitvā adhimokkhalakkhaṇe indaṭṭhaṃ kāretīti saddhindriyaṃ, kosajjaṃ abhibhavitvā paggahalakkhaṇe , pamādaṃ abhibhavitvā upaṭṭhānalakkhaṇe, vikkhepaṃ abhibhavitvā avikkhepalakkhaṇe, aññāṇaṃ abhibhavitvā dassanalakkhaṇe indaṭṭhaṃ kāretīti paññindriyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tāniyeva assaddhiyādīhi anabhibhavanīyato akampiyaṭṭhena sampayuttadhammesu thirabhāvena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘balānī’’"
      },
      "ti veditabbāni."
    ],
    "innerText": "Tāniyeva assaddhiyādīhi anabhibhavanīyato akampiyaṭṭhena sampayuttadhammesu thirabhāvena ‘‘balānī’’ti veditabbāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Satta bojjhaṅgā"
      },
      "ti bodhiyā, bodhissa vā aṅgāti bojjhaṅgā. Yā hi esā dhammasāmaggī yāya lokuttaramaggakkhaṇe uppajjamānāya līnuddhaccapatiṭṭhānāyūhanakāmasukhattakilamathānuyoga- ucchedasassatābhinivesādīnaṃ anekesaṃ upaddavānaṃ paṭipakkhabhūtāya satidhammavicayavīriyapītipassaddhisamādhiupekkhāsaṅkhātāya ",
      " dhammasāmaggiyā ariyasāvako bujjhati, kilesaniddāya vuṭṭhahati, cattāri vā ariyasaccāni paṭivijjhati, nibbānameva vā sacchikarotīti ‘‘bodhī’’ti vuccati, tassā dhammasāmaggisaṅkhātāya bodhiyā aṅgātipi bojjhaṅgā jhānaṅgamaggaṅgādayo viya. Yopesa vuttappakārāya dhammasāmaggiyā bujjhatīti katvā ariyasāvako ‘‘bodhī’’ti vuccati, tassa bodhissa aṅgātipi bojjhaṅgā senaṅgarathaṅgādayo viya. Tenāhu porāṇā – ‘‘bujjhanakassa puggalassa aṅgāti bojjhaṅgā’’ti. ‘‘Bodhiyā saṃvattantīti bojjhaṅgā’’tiādinā nayenapi bojjhaṅgānaṃ bojjhaṅgattho veditabbo."
    ],
    "innerText": "Satta bojjhaṅgāti bodhiyā, bodhissa vā aṅgāti bojjhaṅgā. Yā hi esā dhammasāmaggī yāya lokuttaramaggakkhaṇe uppajjamānāya līnuddhaccapatiṭṭhānāyūhanakāmasukhattakilamathānuyoga- ucchedasassatābhinivesādīnaṃ anekesaṃ upaddavānaṃ paṭipakkhabhūtāya satidhammavicayavīriyapītipassaddhisamādhiupekkhāsaṅkhātāya dhammasāmaggiyā ariyasāvako bujjhati, kilesaniddāya vuṭṭhahati, cattāri vā ariyasaccāni paṭivijjhati, nibbānameva vā sacchikarotīti ‘‘bodhī’’ti vuccati, tassā dhammasāmaggisaṅkhātāya bodhiyā aṅgātipi bojjhaṅgā jhānaṅgamaggaṅgādayo viya. Yopesa vuttappakārāya dhammasāmaggiyā bujjhatīti katvā ariyasāvako ‘‘bodhī’’ti vuccati, tassa bodhissa aṅgātipi bojjhaṅgā senaṅgarathaṅgādayo viya. Tenāhu porāṇā – ‘‘bujjhanakassa puggalassa aṅgāti bojjhaṅgā’’ti. ‘‘Bodhiyā saṃvattantīti bojjhaṅgā’’tiādinā nayenapi bojjhaṅgānaṃ bojjhaṅgattho veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ariyo aṭṭhaṅgiko maggo"
      },
      "ti taṃtaṃmaggavajjhakilesehi ārakattā ariyabhāvakarattā ariyaphalapaṭilābhakarattā ca ariyo. Sammādiṭṭhiādīni aṭṭhaṅgāni assa atthi, aṭṭha aṅgāniyeva vā aṭṭhaṅgiko. Kilese mārento gacchati, nibbānatthikehi ",
      " maggiyati, sayaṃ vā nibbānaṃ maggatīti maggoti. Evametesaṃ satipaṭṭhānādīnaṃ atthavibhāgo veditabbo."
    ],
    "innerText": "Ariyo aṭṭhaṅgiko maggoti taṃtaṃmaggavajjhakilesehi ārakattā ariyabhāvakarattā ariyaphalapaṭilābhakarattā ca ariyo. Sammādiṭṭhiādīni aṭṭhaṅgāni assa atthi, aṭṭha aṅgāniyeva vā aṭṭhaṅgiko. Kilese mārento gacchati, nibbānatthikehi maggiyati, sayaṃ vā nibbānaṃ maggatīti maggoti. Evametesaṃ satipaṭṭhānādīnaṃ atthavibhāgo veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sotāpanno"
      },
      "ti maggasaṅkhātaṃ sotaṃ āpajjitvā pāpuṇitvā ṭhito, sotāpattiphalaṭṭhoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sotāpattiphalasacchikiriyāya paṭipanno"
      },
      "ti sotāpattiphalassa attapaccakkhakaraṇāya paṭipajjamāno paṭhamamaggaṭṭho, yo aṭṭhamakotipi vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sakadāgāmī"
      },
      "ti sakideva imaṃ lokaṃ paṭisandhiggahaṇavasena āgamanasīlo dutiyaphalaṭṭho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anāgāmī"
      },
      "ti paṭisandhiggahaṇavasena kāmalokaṃ anāgamanasīlo tatiyaphalaṭṭho ",
      ". Yo pana saddhānusārī dhammānusārī ekabījīti evamādiko ariyapuggalavibhāgo, so etesaṃyeva pabhedoti. Sesaṃ vuttanayameva."
    ],
    "innerText": "Sotāpannoti maggasaṅkhātaṃ sotaṃ āpajjitvā pāpuṇitvā ṭhito, sotāpattiphalaṭṭhoti attho. Sotāpattiphalasacchikiriyāya paṭipannoti sotāpattiphalassa attapaccakkhakaraṇāya paṭipajjamāno paṭhamamaggaṭṭho, yo aṭṭhamakotipi vuccati. Sakadāgāmīti sakideva imaṃ lokaṃ paṭisandhiggahaṇavasena āgamanasīlo dutiyaphalaṭṭho. Anāgāmīti paṭisandhiggahaṇavasena kāmalokaṃ anāgamanasīlo tatiyaphalaṭṭho . Yo pana saddhānusārī dhammānusārī ekabījīti evamādiko ariyapuggalavibhāgo, so etesaṃyeva pabhedoti. Sesaṃ vuttanayameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etamatthaṃ viditvā"
      },
      "ti etaṃ attano dhammavinaye matakuṇapasadisena dussīlapuggalena saddhiṃ saṃvāsābhāvasaṅkhātaṃ atthaṃ viditvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Imaṃ udāna"
      },
      "nti imaṃ asaṃvāsārahasaṃvāsārahavibhāgakāraṇaparidīpanaṃ udānaṃ udānesi."
    ],
    "innerText": "Etamatthaṃ viditvāti etaṃ attano dhammavinaye matakuṇapasadisena dussīlapuggalena saddhiṃ saṃvāsābhāvasaṅkhātaṃ atthaṃ viditvā. Imaṃ udānanti imaṃ asaṃvāsārahasaṃvāsārahavibhāgakāraṇaparidīpanaṃ udānaṃ udānesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "channamativassatī"
      },
      "ti āpattiṃ āpajjitvā paṭicchādento aññaṃ navaṃ āpattiṃ āpajjati, tato paraṃ tato paranti evaṃ āpattivassaṃ kilesavassaṃ ativiya vassati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vivaṭaṃ nātivassatī"
      },
      "ti āpattiṃ āpanno taṃ appaṭicchādetvā vivaranto sabrahmacārīnaṃ pakāsento yathādhammaṃ yathāvinayaṃ paṭikaronto desento vuṭṭhahanto aññaṃ navaṃ āpattiṃ na āpajjati, tenassa vivaṭaṃ puna āpattivassaṃ kilesavassaṃ na vassati. Yasmā ca etadevaṃ, tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "channaṃ"
      },
      " chāditaṃ āpattiṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vivaretha"
      },
      " pakāsetha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ taṃ nātivassatī"
      },
      "ti evaṃ sante taṃ āpattiāpajjanakaṃ āpannapuggalaṃ ",
      " attabhāvaṃ ativijjhitvā kilesavassaṃ na vassati na temeti. Evaṃ so kilesehi anavassuto parisuddhasīlo samāhito hutvā vipassanaṃ paṭṭhapetvā sammasanto anukkamena nibbānaṃ pāpuṇātīti adhippāyo."
    ],
    "innerText": "Tattha channamativassatīti āpattiṃ āpajjitvā paṭicchādento aññaṃ navaṃ āpattiṃ āpajjati, tato paraṃ tato paranti evaṃ āpattivassaṃ kilesavassaṃ ativiya vassati. Vivaṭaṃ nātivassatīti āpattiṃ āpanno taṃ appaṭicchādetvā vivaranto sabrahmacārīnaṃ pakāsento yathādhammaṃ yathāvinayaṃ paṭikaronto desento vuṭṭhahanto aññaṃ navaṃ āpattiṃ na āpajjati, tenassa vivaṭaṃ puna āpattivassaṃ kilesavassaṃ na vassati. Yasmā ca etadevaṃ, tasmā channaṃ chāditaṃ āpattiṃ vivaretha pakāsetha. Evaṃ taṃ nātivassatīti evaṃ sante taṃ āpattiāpajjanakaṃ āpannapuggalaṃ attabhāvaṃ ativijjhitvā kilesavassaṃ na vassati na temeti. Evaṃ so kilesehi anavassuto parisuddhasīlo samāhito hutvā vipassanaṃ paṭṭhapetvā sammasanto anukkamena nibbānaṃ pāpuṇātīti adhippāyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pañcamasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Soṇasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "46"
      },
      ". Chaṭṭhe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avantīsū"
      },
      "ti avantiraṭṭhe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kuraraghare"
      },
      "ti evaṃnāmake nagare. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pavatte pabbate"
      },
      "ti pavattanāmake pabbate. ‘‘Papāte pabbate’’tipi paṭhanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Soṇo upāsako kuṭikaṇṇo"
      },
      "ti nāmena soṇo nāma, tīhi saraṇagamanehi upāsakabhāvappaṭivedanena upāsako, koṭiagghanakassa kaṇṇapiḷandhanassa dhāraṇena ‘‘koṭikaṇṇo’’ti vattabbe ‘‘kuṭikaṇṇo’’ti evaṃ abhiññāto, na sukhumālasoṇoti adhippāyo ",
      ". Ayañhi āyasmato mahākaccāyanassa santike dhammaṃ sutvā sāsane abhippasanno, saraṇesu ca sīlesu ca patiṭṭhito pavatte pabbate chāyūdakasampanne ṭhāne vihāraṃ kāretvā theraṃ tattha vasāpetvā catūhi paccayehi upaṭṭhāti. Tena vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘āyasmato mahākaccānassa upaṭṭhāko hotī’’"
      },
      "ti."
    ],
    "innerText": "46. Chaṭṭhe avantīsūti avantiraṭṭhe. Kuraraghareti evaṃnāmake nagare. Pavatte pabbateti pavattanāmake pabbate. ‘‘Papāte pabbate’’tipi paṭhanti. Soṇo upāsako kuṭikaṇṇoti nāmena soṇo nāma, tīhi saraṇagamanehi upāsakabhāvappaṭivedanena upāsako, koṭiagghanakassa kaṇṇapiḷandhanassa dhāraṇena ‘‘koṭikaṇṇo’’ti vattabbe ‘‘kuṭikaṇṇo’’ti evaṃ abhiññāto, na sukhumālasoṇoti adhippāyo . Ayañhi āyasmato mahākaccāyanassa santike dhammaṃ sutvā sāsane abhippasanno, saraṇesu ca sīlesu ca patiṭṭhito pavatte pabbate chāyūdakasampanne ṭhāne vihāraṃ kāretvā theraṃ tattha vasāpetvā catūhi paccayehi upaṭṭhāti. Tena vuttaṃ – ‘‘āyasmato mahākaccānassa upaṭṭhāko hotī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "So kālena kālaṃ therassa upaṭṭhānaṃ gacchati. Thero cassa dhammaṃ deseti. Tena saṃvegabahulo dhammacariyāya ussāhajāto viharati. So ekadā satthena saddhiṃ vāṇijjatthāya ujjeniṃ gacchanto antarāmagge aṭaviyaṃ satthe niviṭṭhe rattiyaṃ janasambādhabhayena ekamantaṃ apakkamma niddaṃ upagañchi. Sattho paccūsavelāyaṃ uṭṭhāya gato, na ekopi soṇaṃ pabodhesi, sabbepi visaritvā agamaṃsu. So pabhātāya rattiyā pabujjhitvā uṭṭhāya kañci apassanto sattheneva gatamaggaṃ gahetvā sīghaṃ sīghaṃ gacchanto ekaṃ vaṭarukkhaṃ upagañchi. Tattha addasa ekaṃ mahākāyaṃ virūpadassanaṃ gacchantaṃ purisaṃ aṭṭhito muttāni attano maṃsāni sayameva khādantaṃ, disvāna ‘‘kosi tva’’nti pucchi. ‘‘Petomhi, bhante’’ti. ‘‘Kasmā evaṃ karosī’’ti. ‘‘Attano pubbakammenā’’ti. ‘‘Kiṃ pana taṃ kamma’’nti. ‘‘Ahaṃ pubbe bhārukacchanagaravāsī kūṭavāṇijo hutvā paresaṃ santakaṃ vañcetvā khādiṃ, samaṇe ca bhikkhāya upagate ‘tumhākaṃ maṃsaṃ ",
      " khādathā’ti akkosiṃ, tena kammena etarahi imaṃ dukkhaṃ anubhavāmī’’ti. Taṃ ",
      " sutvā soṇo ativiya saṃvegaṃ paṭilabhi."
    ],
    "innerText": "So kālena kālaṃ therassa upaṭṭhānaṃ gacchati. Thero cassa dhammaṃ deseti. Tena saṃvegabahulo dhammacariyāya ussāhajāto viharati. So ekadā satthena saddhiṃ vāṇijjatthāya ujjeniṃ gacchanto antarāmagge aṭaviyaṃ satthe niviṭṭhe rattiyaṃ janasambādhabhayena ekamantaṃ apakkamma niddaṃ upagañchi. Sattho paccūsavelāyaṃ uṭṭhāya gato, na ekopi soṇaṃ pabodhesi, sabbepi visaritvā agamaṃsu. So pabhātāya rattiyā pabujjhitvā uṭṭhāya kañci apassanto sattheneva gatamaggaṃ gahetvā sīghaṃ sīghaṃ gacchanto ekaṃ vaṭarukkhaṃ upagañchi. Tattha addasa ekaṃ mahākāyaṃ virūpadassanaṃ gacchantaṃ purisaṃ aṭṭhito muttāni attano maṃsāni sayameva khādantaṃ, disvāna ‘‘kosi tva’’nti pucchi. ‘‘Petomhi, bhante’’ti. ‘‘Kasmā evaṃ karosī’’ti. ‘‘Attano pubbakammenā’’ti. ‘‘Kiṃ pana taṃ kamma’’nti. ‘‘Ahaṃ pubbe bhārukacchanagaravāsī kūṭavāṇijo hutvā paresaṃ santakaṃ vañcetvā khādiṃ, samaṇe ca bhikkhāya upagate ‘tumhākaṃ maṃsaṃ khādathā’ti akkosiṃ, tena kammena etarahi imaṃ dukkhaṃ anubhavāmī’’ti. Taṃ sutvā soṇo ativiya saṃvegaṃ paṭilabhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tato paraṃ gacchanto mukhato paggharitakāḷalohite dve petadārake passitvā tatheva pucchi. Tepissa attano kammaṃ kathesuṃ. Te kira bhārukacchanagare dārakakāle gandhavāṇijjāya jīvikaṃ kappentā attano mātari khīṇāsave nimantetvā bhojentiyā gehaṃ gantvā ‘‘amhākaṃ santakaṃ kasmā samaṇānaṃ desi, tayā dinnaṃ bhojanaṃ bhuñjanakasamaṇānaṃ mukhato kāḷalohitaṃ paggharatū’’ti akkosiṃsu. Te tena kammena niraye paccitvā tassa vipākāvasesena petayoniyaṃ nibbattitvā tadā imaṃ dukkhaṃ anubhavanti. Tampi sutvā soṇo ativiya saṃvegajāto ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "So ",
      " ujjeniṃ gantvā taṃ karaṇīyaṃ tīretvā kulagharaṃ paccāgato theraṃ upasaṅkamitvā katapaṭisanthāro therassa tamatthaṃ ārocesi. Theropissa pavattinivattīsu ādīnavānisaṃse vibhāvento dhammaṃ desesi. So theraṃ vanditvā gehaṃ gato sāyamāsaṃ bhuñjitvā sayanaṃ upagato thokaṃyeva niddāyitvā pabujjhitvā sayanatale nisajja yathāsutaṃ dhammaṃ paccavekkhituṃ āraddho. Tassa taṃ dhammaṃ paccavekkhato, te ca petattabhāve anussarato saṃsāradukkhaṃ ativiya bhayānakaṃ hutvā upaṭṭhāsi, pabbajjāya cittaṃ nami. So vibhātāya rattiyā sarīrapaṭijagganaṃ katvā theraṃ upasaṅkamitvā attano ajjhāsayaṃ ārocetvā pabbajjaṃ yāci. Tena vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘atha kho soṇassa upāsakassa kuṭikaṇṇassa rahogatassa…pe… pabbājetu maṃ, bhante, ayyo mahākaccāno’’"
      },
      "ti."
    ],
    "innerText": "So ujjeniṃ gantvā taṃ karaṇīyaṃ tīretvā kulagharaṃ paccāgato theraṃ upasaṅkamitvā katapaṭisanthāro therassa tamatthaṃ ārocesi. Theropissa pavattinivattīsu ādīnavānisaṃse vibhāvento dhammaṃ desesi. So theraṃ vanditvā gehaṃ gato sāyamāsaṃ bhuñjitvā sayanaṃ upagato thokaṃyeva niddāyitvā pabujjhitvā sayanatale nisajja yathāsutaṃ dhammaṃ paccavekkhituṃ āraddho. Tassa taṃ dhammaṃ paccavekkhato, te ca petattabhāve anussarato saṃsāradukkhaṃ ativiya bhayānakaṃ hutvā upaṭṭhāsi, pabbajjāya cittaṃ nami. So vibhātāya rattiyā sarīrapaṭijagganaṃ katvā theraṃ upasaṅkamitvā attano ajjhāsayaṃ ārocetvā pabbajjaṃ yāci. Tena vuttaṃ – ‘‘atha kho soṇassa upāsakassa kuṭikaṇṇassa rahogatassa…pe… pabbājetu maṃ, bhante, ayyo mahākaccāno’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yathā yathā"
      },
      "tiādīnaṃ padānaṃ ayaṃ saṅkhepattho – yena yena ākārena ayyo mahākaccāno dhammaṃ deseti ācikkhati paññapeti paṭṭhapeti vivarati vibhajati uttānīkaroti pakāseti, tena tena me upaparikkhato evaṃ hoti, yadetaṃ sikkhattayabrahmacariyaṃ ekampi divasaṃ akkhaṇḍaṃ katvā carimakacittaṃ pāpetabbatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekantaparipuṇṇaṃ"
      },
      ". Ekadivasampi kilesamalena amalinaṃ katvā carimakacittaṃ pāpetabbatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekantaparisuddhaṃ. Saṅkhalikhita"
      },
      "nti likhitasaṅkhasadisaṃ dhotasaṅkhasappaṭibhāgaṃ caritabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idaṃ na"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sukaraṃ agāraṃ ajjhāvasatā"
      },
      " agāramajjhe vasantena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekanta paripuṇṇaṃ…pe… carituṃ yaṃnūnāhaṃ"
      },
      " kese ceva massūni ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ohāretvā"
      },
      " voropetvā kāsāyarasapītatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāsāyāni"
      },
      " brahmacariyaṃ carantānaṃ anucchavikāni vatthāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "acchādetvā"
      },
      " nivāsetvā ceva pārupitvā ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "agārasmā"
      },
      " nikkhamitvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anagāriyaṃ pabbajeyyaṃ"
      },
      ". Yasmā agārassa hitaṃ kasivāṇijjādikammaṃ agāriyanti vuccati, tañca pabbajjāya natthi, tasmā pabbajjā anagāriyā nāma. Taṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anagāriyaṃ"
      },
      " pabbajjaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pabbajeyyaṃ"
      },
      " upagaccheyyaṃ, paṭipajjeyyanti attho."
    ],
    "innerText": "Tattha yathā yathātiādīnaṃ padānaṃ ayaṃ saṅkhepattho – yena yena ākārena ayyo mahākaccāno dhammaṃ deseti ācikkhati paññapeti paṭṭhapeti vivarati vibhajati uttānīkaroti pakāseti, tena tena me upaparikkhato evaṃ hoti, yadetaṃ sikkhattayabrahmacariyaṃ ekampi divasaṃ akkhaṇḍaṃ katvā carimakacittaṃ pāpetabbatāya ekantaparipuṇṇaṃ. Ekadivasampi kilesamalena amalinaṃ katvā carimakacittaṃ pāpetabbatāya ekantaparisuddhaṃ. Saṅkhalikhitanti likhitasaṅkhasadisaṃ dhotasaṅkhasappaṭibhāgaṃ caritabbaṃ. Idaṃ nasukaraṃ agāraṃ ajjhāvasatā agāramajjhe vasantena ekanta paripuṇṇaṃ…pe… carituṃ yaṃnūnāhaṃ kese ceva massūni ca ohāretvā voropetvā kāsāyarasapītatāya kāsāyāni brahmacariyaṃ carantānaṃ anucchavikāni vatthāni acchādetvā nivāsetvā ceva pārupitvā ca agārasmā nikkhamitvā anagāriyaṃ pabbajeyyaṃ. Yasmā agārassa hitaṃ kasivāṇijjādikammaṃ agāriyanti vuccati, tañca pabbajjāya natthi, tasmā pabbajjā anagāriyā nāma. Taṃ anagāriyaṃ pabbajjaṃ pabbajeyyaṃ upagaccheyyaṃ, paṭipajjeyyanti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ attanā rahovitakkitaṃ soṇo upāsako therassa ārocetvā taṃ paṭipajjitukāmo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘pabbājetu maṃ, bhante, ayyo mahākaccāno’’"
      },
      "ti āha. Thero pana ‘‘tāvassa ñāṇaparipākaṃ katha’’nti upadhāretvā ",
      " ñāṇaparipākaṃ āgamayamāno ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘dukkaraṃ kho’’"
      },
      "tiādinā pabbajjāchandaṃ nivāresi."
    ],
    "innerText": "Evaṃ attanā rahovitakkitaṃ soṇo upāsako therassa ārocetvā taṃ paṭipajjitukāmo ‘‘pabbājetu maṃ, bhante, ayyo mahākaccāno’’ti āha. Thero pana ‘‘tāvassa ñāṇaparipākaṃ katha’’nti upadhāretvā ñāṇaparipākaṃ āgamayamāno ‘‘dukkaraṃ kho’’tiādinā pabbajjāchandaṃ nivāresi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekabhatta"
      },
      "nti ‘‘ekabhattiko hoti rattūparato virato vikālabhojanā’’ti (dī. ni. 1.194; a. ni. 3.71) evaṃ vuttaṃ vikālabhojanaviratiṃ sandhāya vadati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekaseyya"
      },
      "nti adutiyaseyyaṃ. Ettha ca seyyāsīsena ‘‘eko tiṭṭhati, eko gacchati, eko nisīdatī’’tiādinā (mahāni. 7; 49) nayena vuttesu catūsu iriyāpathesu kāyavivekaṃ dīpeti, na ekākinā hutvā sayanamattaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Brahmacariya"
      },
      "nti methunaviratibrahmacariyaṃ, sikkhattayānuyogasaṅkhātaṃ sāsanabrahmacariyaṃ vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iṅghā"
      },
      "ti codanatthe nipāto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatthevā"
      },
      "ti geheyeva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Buddhānaṃ sāsanaṃ anuyuñjā"
      },
      "ti niccasīlauposathasīlādibhedaṃ pañcaṅgaaṭṭhaṅgadasaṅgasīlaṃ, tadanurūpañca samādhipaññābhāvanaṃ anuyuñja. Etañhi upāsakena pubbabhāge anuyuñjitabbaṃ buddhasāsanaṃ nāma. Tenāha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kālayuttaṃ ekabhattaṃ ekaseyyaṃ brahmariya’’"
      },
      "nti."
    ],
    "innerText": "Tattha ekabhattanti ‘‘ekabhattiko hoti rattūparato virato vikālabhojanā’’ti (dī. ni. 1.194; a. ni. 3.71) evaṃ vuttaṃ vikālabhojanaviratiṃ sandhāya vadati. Ekaseyyanti adutiyaseyyaṃ. Ettha ca seyyāsīsena ‘‘eko tiṭṭhati, eko gacchati, eko nisīdatī’’tiādinā (mahāni. 7; 49) nayena vuttesu catūsu iriyāpathesu kāyavivekaṃ dīpeti, na ekākinā hutvā sayanamattaṃ. Brahmacariyanti methunaviratibrahmacariyaṃ, sikkhattayānuyogasaṅkhātaṃ sāsanabrahmacariyaṃ vā. Iṅghāti codanatthe nipāto. Tatthevāti geheyeva. Buddhānaṃ sāsanaṃ anuyuñjāti niccasīlauposathasīlādibhedaṃ pañcaṅgaaṭṭhaṅgadasaṅgasīlaṃ, tadanurūpañca samādhipaññābhāvanaṃ anuyuñja. Etañhi upāsakena pubbabhāge anuyuñjitabbaṃ buddhasāsanaṃ nāma. Tenāha – ‘‘kālayuttaṃ ekabhattaṃ ekaseyyaṃ brahmariya’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kālayutta"
      },
      "nti cātuddasīpañcadasīaṭṭhamīpāṭihāriyapakkhasaṅkhātena kālena yuttaṃ, yathāvuttakāle vā tuyhaṃ anuyuñjantassa yuttaṃ patirūpaṃ sakkuṇeyyaṃ, na sabbakālaṃ pabbajjāti adhippāyo. Sabbametaṃ ñāṇassa aparipakkattā tassa kāmānaṃ ",
      " duppahānatāya sammāpaṭipattiyaṃ yogyaṃ kārāpetuṃ vadati, na pabbajjāchandaṃ nivāretuṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pabbajjābhisaṅkhāro"
      },
      "ti pabbajituṃ ārambho ussāho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭipassambhī"
      },
      "ti indriyānaṃ aparipakkattā, saṃvegassa ca nātitikkhabhāvato vūpasami. Kiñcāpi paṭipassambhi, therena vuttavidhiṃ pana anutiṭṭhanto kālena kālaṃ theraṃ upasaṅkamitvā payirupāsanto dhammaṃ suṇāti. Tassa vuttanayeneva dutiyaṃ pabbajjāya cittaṃ uppajji, therassa ca ārocesi. Dutiyampi thero paṭikkhipi. Tatiyavāre pana ñāṇassa paripakkabhāvaṃ ñatvā ‘‘idāni naṃ pabbājetuṃ kālo’’ti thero pabbājesi, pabbajitañca taṃ tīṇi saṃvaccharāni atikkamitvā gaṇaṃ pariyesitvā upasampādesi. Taṃ sandhāya vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘dutiyampi kho soṇo…pe… upasampādesī’’"
      },
      "ti."
    ],
    "innerText": "Tattha kālayuttanti cātuddasīpañcadasīaṭṭhamīpāṭihāriyapakkhasaṅkhātena kālena yuttaṃ, yathāvuttakāle vā tuyhaṃ anuyuñjantassa yuttaṃ patirūpaṃ sakkuṇeyyaṃ, na sabbakālaṃ pabbajjāti adhippāyo. Sabbametaṃ ñāṇassa aparipakkattā tassa kāmānaṃ duppahānatāya sammāpaṭipattiyaṃ yogyaṃ kārāpetuṃ vadati, na pabbajjāchandaṃ nivāretuṃ. Pabbajjābhisaṅkhāroti pabbajituṃ ārambho ussāho. Paṭipassambhīti indriyānaṃ aparipakkattā, saṃvegassa ca nātitikkhabhāvato vūpasami. Kiñcāpi paṭipassambhi, therena vuttavidhiṃ pana anutiṭṭhanto kālena kālaṃ theraṃ upasaṅkamitvā payirupāsanto dhammaṃ suṇāti. Tassa vuttanayeneva dutiyaṃ pabbajjāya cittaṃ uppajji, therassa ca ārocesi. Dutiyampi thero paṭikkhipi. Tatiyavāre pana ñāṇassa paripakkabhāvaṃ ñatvā ‘‘idāni naṃ pabbājetuṃ kālo’’ti thero pabbājesi, pabbajitañca taṃ tīṇi saṃvaccharāni atikkamitvā gaṇaṃ pariyesitvā upasampādesi. Taṃ sandhāya vuttaṃ – ‘‘dutiyampi kho soṇo…pe… upasampādesī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "appabhikkhuko"
      },
      "ti katipayabhikkhuko. Tadā kira bhikkhū yebhuyyena majjhimadese eva vasiṃsu. Tasmā tattha katipayā eva ahesuṃ ",
      ", te ca ekasmiṃ nigame eko, ekasmiṃ dveti evaṃ visuṃ visuṃ vasiṃsu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kicchenā"
      },
      "ti dukkhena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kasirenā"
      },
      "ti āyāsena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tato tato"
      },
      "ti tasmā tasmā gāmanigamādito. Therena hi katipaye bhikkhū ānetvā aññesu ānīyamānesu pubbe ānītā kenacideva karaṇīyena pakkamiṃsu, kiñci kālaṃ āgametvā puna tesu ānīyamānesu itare pakkamiṃsu. Evaṃ punappunaṃ ānayanena sannipāto cireneva ahosi, thero ca tadā ekavihārī ahosi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dasavaggaṃ bhikkhusaṅghaṃ sannipātetvā"
      },
      "ti tadā bhagavatā paccantadesepi dasavaggeneva saṅghena upasampadā anuññātā. Itonidānañhi therena yācito pañcavaggena saṅghena paccantadese upasampadaṃ anujāni. Tena vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tiṇṇaṃ vassānaṃ…pe… sannipātetvā’’"
      },
      "ti."
    ],
    "innerText": "Tattha appabhikkhukoti katipayabhikkhuko. Tadā kira bhikkhū yebhuyyena majjhimadese eva vasiṃsu. Tasmā tattha katipayā eva ahesuṃ , te ca ekasmiṃ nigame eko, ekasmiṃ dveti evaṃ visuṃ visuṃ vasiṃsu. Kicchenāti dukkhena. Kasirenāti āyāsena. Tato tatoti tasmā tasmā gāmanigamādito. Therena hi katipaye bhikkhū ānetvā aññesu ānīyamānesu pubbe ānītā kenacideva karaṇīyena pakkamiṃsu, kiñci kālaṃ āgametvā puna tesu ānīyamānesu itare pakkamiṃsu. Evaṃ punappunaṃ ānayanena sannipāto cireneva ahosi, thero ca tadā ekavihārī ahosi. Dasavaggaṃ bhikkhusaṅghaṃ sannipātetvāti tadā bhagavatā paccantadesepi dasavaggeneva saṅghena upasampadā anuññātā. Itonidānañhi therena yācito pañcavaggena saṅghena paccantadese upasampadaṃ anujāni. Tena vuttaṃ – ‘‘tiṇṇaṃ vassānaṃ…pe… sannipātetvā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vassaṃvuṭṭhassā"
      },
      "ti upasampajjitvā paṭhamavassaṃ upagantvā vusitavato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Īdiso ca īdiso cā"
      },
      "ti evarūpo ca evarūpo ca, evarūpāya nāmakāyarūpakāyasampattiyā samannāgato, evarūpāya dhammakāyasampattiyā samannāgatoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sutoyeva me so bhagavā. Na kho me so bhagavā sammukhā diṭṭho"
      },
      "ti etena puthujjanasaddhāya evaṃ āyasmā soṇo bhagavantaṃ daṭṭhukāmo ahosi. Aparabhāge pana satthārā saddhiṃ ekagandhakuṭiyaṃ vasitvā paccūsasamayaṃ ajjhiṭṭho soḷasa aṭṭhakavaggikāni satthu ",
      " sammukhā aṭṭhiṃ katvā manasi katvā sabbaṃ cetaso samannāharitvā atthadhammappaṭisaṃvedī hutvā bhaṇanto dhammūpasañhitapāmojjādimukhena samāhito sarabhaññapariyosāne vipassanaṃ paṭṭhapetvā saṅkhāre sammasanto anupubbena arahattaṃ pāpuṇi. Etadatthameva hissa bhagavatā attanā saddhiṃ ekagandhakuṭiyaṃ vāso āṇattoti vadanti."
    ],
    "innerText": "Vassaṃvuṭṭhassāti upasampajjitvā paṭhamavassaṃ upagantvā vusitavato. Īdiso ca īdiso cāti evarūpo ca evarūpo ca, evarūpāya nāmakāyarūpakāyasampattiyā samannāgato, evarūpāya dhammakāyasampattiyā samannāgatoti sutoyeva me so bhagavā. Na kho me so bhagavā sammukhā diṭṭhoti etena puthujjanasaddhāya evaṃ āyasmā soṇo bhagavantaṃ daṭṭhukāmo ahosi. Aparabhāge pana satthārā saddhiṃ ekagandhakuṭiyaṃ vasitvā paccūsasamayaṃ ajjhiṭṭho soḷasa aṭṭhakavaggikāni satthu sammukhā aṭṭhiṃ katvā manasi katvā sabbaṃ cetaso samannāharitvā atthadhammappaṭisaṃvedī hutvā bhaṇanto dhammūpasañhitapāmojjādimukhena samāhito sarabhaññapariyosāne vipassanaṃ paṭṭhapetvā saṅkhāre sammasanto anupubbena arahattaṃ pāpuṇi. Etadatthameva hissa bhagavatā attanā saddhiṃ ekagandhakuṭiyaṃ vāso āṇattoti vadanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Keci panāhu – ‘‘na kho me so bhagavā sammukhā diṭṭho’’ti idaṃ rūpakāyadassanameva sandhāya vuttanti. Āyasmā hi soṇo pabbajitvāva therassa santike kammaṭṭhānaṃ gahetvā ghaṭento vāyamanto anupasampannova sotāpanno hutvā upasampajjitvā ‘‘upāsakāpi sotāpannā honti, ahampi sotāpanno, kimettha citta’’nti uparimaggatthāya vipassanaṃ vaḍḍhetvā antovasseyeva chaḷabhiñño hutvā visuddhipavāraṇāya pavāresi ",
      ". Ariyasaccadassanena hi bhagavato dhammakāyo diṭṭho nāma hoti. Vuttañhetaṃ –"
    ],
    "innerText": "Keci panāhu – ‘‘na kho me so bhagavā sammukhā diṭṭho’’ti idaṃ rūpakāyadassanameva sandhāya vuttanti. Āyasmā hi soṇo pabbajitvāva therassa santike kammaṭṭhānaṃ gahetvā ghaṭento vāyamanto anupasampannova sotāpanno hutvā upasampajjitvā ‘‘upāsakāpi sotāpannā honti, ahampi sotāpanno, kimettha citta’’nti uparimaggatthāya vipassanaṃ vaḍḍhetvā antovasseyeva chaḷabhiñño hutvā visuddhipavāraṇāya pavāresi . Ariyasaccadassanena hi bhagavato dhammakāyo diṭṭho nāma hoti. Vuttañhetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Yo kho, vakkali, dhammaṃ passati, so maṃ passati. Yo maṃ passati, so dhammaṃ passatī’’ti (saṃ. ni. 3.87)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tasmāssa ",
      " dhammakāyadassanaṃ pageva siddhaṃ, pavāretvā pana rūpakāyaṃ daṭṭhukāmo ahosīti."
    ],
    "innerText": "Tasmāssa dhammakāyadassanaṃ pageva siddhaṃ, pavāretvā pana rūpakāyaṃ daṭṭhukāmo ahosīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace maṃ upajjhāyo anujānātī’’tipi pāṭho. ‘‘Bhante’’ti pana likhanti. Tathā ‘‘sādhu sādhu, āvuso soṇa, gaccha tvaṃ, āvuso soṇā’’tipi pāṭho. ‘‘Āvuso’’ti pana kesuci potthakesu natthi. Tathā ‘‘evamāvusoti kho āyasmā soṇo’’tipi pāṭho. Āvusovādoyeva hi aññamaññaṃ bhikkhūnaṃ bhagavato dharamānakāle āciṇṇo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhagavantaṃ pāsādika"
      },
      "ntiādīnaṃ padānaṃ attho heṭṭhā vuttoyeva."
    ],
    "innerText": "‘‘Sace maṃ upajjhāyo anujānātī’’tipi pāṭho. ‘‘Bhante’’ti pana likhanti. Tathā ‘‘sādhu sādhu, āvuso soṇa, gaccha tvaṃ, āvuso soṇā’’tipi pāṭho. ‘‘Āvuso’’ti pana kesuci potthakesu natthi. Tathā ‘‘evamāvusoti kho āyasmā soṇo’’tipi pāṭho. Āvusovādoyeva hi aññamaññaṃ bhikkhūnaṃ bhagavato dharamānakāle āciṇṇo. Bhagavantaṃ pāsādikantiādīnaṃ padānaṃ attho heṭṭhā vuttoyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kacci bhikkhu khamanīya"
      },
      "nti bhikkhu idaṃ tuyhaṃ catucakkaṃ navadvāraṃ sarīrayantaṃ kacci khamanīyaṃ, kiṃ sakkā khamituṃ sahituṃ pariharituṃ, kiṃ dukkhabhāro nābhibhavati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kacci yāpanīya"
      },
      "nti kiṃ taṃtaṃkiccesu yāpetuṃ gametuṃ sakkā, na kañci antarāyanti dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kaccisi appakilamathenā"
      },
      "ti anāyāsena imaṃ ettakaṃ addhānaṃ kacci āgatosi."
    ],
    "innerText": "Kacci bhikkhu khamanīyanti bhikkhu idaṃ tuyhaṃ catucakkaṃ navadvāraṃ sarīrayantaṃ kacci khamanīyaṃ, kiṃ sakkā khamituṃ sahituṃ pariharituṃ, kiṃ dukkhabhāro nābhibhavati. Kacci yāpanīyanti kiṃ taṃtaṃkiccesu yāpetuṃ gametuṃ sakkā, na kañci antarāyanti dasseti. Kaccisi appakilamathenāti anāyāsena imaṃ ettakaṃ addhānaṃ kacci āgatosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etadahosī"
      },
      "ti buddhāciṇṇaṃ anussarantassa āyasmato ānandassa ",
      " etaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yassa kho maṃ bhagavā’’"
      },
      "tiādinā idāni vuccamānaṃ citte āciṇṇaṃ ahosi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekavihāre"
      },
      "ti ekagandhakuṭiyaṃ. Gandhakuṭi hi idha vihāroti adhippetā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vatthu"
      },
      "nti vasituṃ."
    ],
    "innerText": "Etadahosīti buddhāciṇṇaṃ anussarantassa āyasmato ānandassa etaṃ ‘‘yassa kho maṃ bhagavā’’tiādinā idāni vuccamānaṃ citte āciṇṇaṃ ahosi. Ekavihāreti ekagandhakuṭiyaṃ. Gandhakuṭi hi idha vihāroti adhippetā. Vatthunti vasituṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nisajjāya vītināmetvā"
      },
      "ti ettha yasmā bhagavā āyasmato soṇassa samāpattisamāpajjane paṭisanthāraṃ karonto sāvakasādhāraṇā sabbā samāpattiyo anulomapaṭilomaṃ samāpajjanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bahudeva rattiṃ…pe… vihāraṃ pāvisi,"
      },
      " tasmā āyasmāpi soṇo bhagavato adhippāyaṃ ñatvā tadanurūpaṃ sabbā tā samāpattiyo samāpajjanto ‘‘bahudeva rattiṃ…pe… vihāraṃ pāvisī’’ti keci vadanti. Pavisitvā ca bhagavatā ",
      " anuññāto cīvaraṃ tirokaraṇīyaṃ katvāpi bhagavato pādapasse nisajjāya vītināmesi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ajjhesī"
      },
      "ti āṇāpesi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭibhātu taṃ bhikkhu dhammo bhāsitu"
      },
      "nti bhikkhu tuyhaṃ dhammo bhāsituṃ upaṭṭhātu ñāṇamukhe āgacchatu, yathāsutaṃ yathāpariyattaṃ dhammaṃ bhaṇāhīti attho."
    ],
    "innerText": "Nisajjāya vītināmetvāti ettha yasmā bhagavā āyasmato soṇassa samāpattisamāpajjane paṭisanthāraṃ karonto sāvakasādhāraṇā sabbā samāpattiyo anulomapaṭilomaṃ samāpajjanto bahudeva rattiṃ…pe… vihāraṃ pāvisi, tasmā āyasmāpi soṇo bhagavato adhippāyaṃ ñatvā tadanurūpaṃ sabbā tā samāpattiyo samāpajjanto ‘‘bahudeva rattiṃ…pe… vihāraṃ pāvisī’’ti keci vadanti. Pavisitvā ca bhagavatā anuññāto cīvaraṃ tirokaraṇīyaṃ katvāpi bhagavato pādapasse nisajjāya vītināmesi. Ajjhesīti āṇāpesi. Paṭibhātu taṃ bhikkhu dhammo bhāsitunti bhikkhu tuyhaṃ dhammo bhāsituṃ upaṭṭhātu ñāṇamukhe āgacchatu, yathāsutaṃ yathāpariyattaṃ dhammaṃ bhaṇāhīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Soḷasa aṭṭhakavaggikānī"
      },
      "ti aṭṭhakavaggabhūtāni kāmasuttādīni soḷasa suttāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sarena abhaṇī"
      },
      "ti suttussāraṇasarena abhāsi, sarabhaññavasena kathesīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sarabhaññapariyosāne"
      },
      "ti ussāraṇāvasāne. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suggahitānī"
      },
      "ti sammā uggahitāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sumanasikatānī"
      },
      "ti suṭṭhu manasi katāni. Ekacco uggahaṇakāle sammā uggahetvāpi pacchā sajjhāyādivasena manasi karaṇakāle ",
      " byañjanāni vā micchā ropeti, padapacchābhaṭṭhaṃ vā karoti, na evamayaṃ. Iminā pana sammadeva yathuggahitaṃ manasi katāni. Tena vuttaṃ – ‘‘sumanasikatānīti suṭṭhu manasi katānī’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sūpadhāritānī"
      },
      "ti atthatopi suṭṭhu upadhāritāni. Atthe hi suṭṭu upadhārite sakkā pāḷiṃ sammā ussāretuṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kalyāṇiyāsi vācāya samannāgato"
      },
      "ti sithiladhanitādīnaṃ yathāvidhānavacanena parimaṇḍalapadabyañjanaparipuṇṇāya poriyā vācāya samannāgato āsi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissaṭṭhāyā"
      },
      "ti vimuttāya. Etenassa vimuttavāditaṃ ",
      " dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anelagaḷāyā"
      },
      "ti elā vuccati doso, taṃ na paggharatīti anelagaḷā, tāya niddosāyāti attho. Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anelagaḷāyā"
      },
      "ti anelāya ca agaḷāya ca niddosāya agaḷitapadabyañjanāya, aparihīnapadabyañjanāyāti attho. Tathā hi naṃ bhagavā ‘‘etadaggaṃ, bhikkhave, mama sāvakānaṃ bhikkhūnaṃ kalyāṇavākkaraṇānaṃ yadidaṃ soṇo kuṭikaṇṇo’’ti (a. ni. 1.206) etadagge ṭhapesi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atthassa viññāpaniyā"
      },
      "ti yathādhippetaṃ atthaṃ viññāpetuṃ samatthāya."
    ],
    "innerText": "Soḷasa aṭṭhakavaggikānīti aṭṭhakavaggabhūtāni kāmasuttādīni soḷasa suttāni. Sarena abhaṇīti suttussāraṇasarena abhāsi, sarabhaññavasena kathesīti attho. Sarabhaññapariyosāneti ussāraṇāvasāne. Suggahitānīti sammā uggahitāni. Sumanasikatānīti suṭṭhu manasi katāni. Ekacco uggahaṇakāle sammā uggahetvāpi pacchā sajjhāyādivasena manasi karaṇakāle byañjanāni vā micchā ropeti, padapacchābhaṭṭhaṃ vā karoti, na evamayaṃ. Iminā pana sammadeva yathuggahitaṃ manasi katāni. Tena vuttaṃ – ‘‘sumanasikatānīti suṭṭhu manasi katānī’’ti. Sūpadhāritānīti atthatopi suṭṭhu upadhāritāni. Atthe hi suṭṭu upadhārite sakkā pāḷiṃ sammā ussāretuṃ. Kalyāṇiyāsi vācāya samannāgatoti sithiladhanitādīnaṃ yathāvidhānavacanena parimaṇḍalapadabyañjanaparipuṇṇāya poriyā vācāya samannāgato āsi. Vissaṭṭhāyāti vimuttāya. Etenassa vimuttavāditaṃ dasseti. Anelagaḷāyāti elā vuccati doso, taṃ na paggharatīti anelagaḷā, tāya niddosāyāti attho. Atha vā anelagaḷāyāti anelāya ca agaḷāya ca niddosāya agaḷitapadabyañjanāya, aparihīnapadabyañjanāyāti attho. Tathā hi naṃ bhagavā ‘‘etadaggaṃ, bhikkhave, mama sāvakānaṃ bhikkhūnaṃ kalyāṇavākkaraṇānaṃ yadidaṃ soṇo kuṭikaṇṇo’’ti (a. ni. 1.206) etadagge ṭhapesi. Atthassa viññāpaniyāti yathādhippetaṃ atthaṃ viññāpetuṃ samatthāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kativasso"
      },
      "ti so kira majjhimavayassa tatiyakoṭṭhāse ṭhito ākappasampanno ca paresaṃ ciratarapabbajito viya khāyati. Taṃ sandhāya bhagavā pucchatīti keci, taṃ akāraṇaṃ. Evaṃ sante samādhisukhaṃ anubhavituṃ yutto, ettakaṃ kālaṃ kasmā pamādamāpannoti puna anuyuñjituṃ satthā ‘‘kativassosī’’ti taṃ pucchati. Tenevāha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kissa pana tvaṃ bhikkhu evaṃ ciraṃ akāsī’’"
      },
      "ti."
    ],
    "innerText": "Kativassoti so kira majjhimavayassa tatiyakoṭṭhāse ṭhito ākappasampanno ca paresaṃ ciratarapabbajito viya khāyati. Taṃ sandhāya bhagavā pucchatīti keci, taṃ akāraṇaṃ. Evaṃ sante samādhisukhaṃ anubhavituṃ yutto, ettakaṃ kālaṃ kasmā pamādamāpannoti puna anuyuñjituṃ satthā ‘‘kativassosī’’ti taṃ pucchati. Tenevāha – ‘‘kissa pana tvaṃ bhikkhu evaṃ ciraṃ akāsī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kissā"
      },
      "ti kiṃ kāraṇā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ ciraṃ akāsī"
      },
      "ti evaṃ cirāyi, kena kāraṇena evaṃ cirakālaṃ pabbajjaṃ anupagantvā agāramajjhe vasīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ciraṃ diṭṭho me"
      },
      "ti cirena cirakālena mayā diṭṭho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāmesū"
      },
      "ti kilesakāmesu ca vatthukāmesu ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ādīnavo"
      },
      "ti doso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Api cā"
      },
      "ti kāmesu ādīnave kenaci pakārena diṭṭhepi na tāvāhaṃ gharāvāsato nikkhamituṃ asakkhiṃ. Kasmā? ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sambādho gharāvāso"
      },
      " uccāvacehi kiccakaraṇīyehi samupabyūḷho agāriyabhāvo. Tenevāha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘bahukicco bahukaraṇīyo’’"
      },
      "ti."
    ],
    "innerText": "Tattha kissāti kiṃ kāraṇā. Evaṃ ciraṃ akāsīti evaṃ cirāyi, kena kāraṇena evaṃ cirakālaṃ pabbajjaṃ anupagantvā agāramajjhe vasīti attho. Ciraṃ diṭṭho meti cirena cirakālena mayā diṭṭho. Kāmesūti kilesakāmesu ca vatthukāmesu ca. Ādīnavoti doso. Api cāti kāmesu ādīnave kenaci pakārena diṭṭhepi na tāvāhaṃ gharāvāsato nikkhamituṃ asakkhiṃ. Kasmā? Sambādho gharāvāso uccāvacehi kiccakaraṇīyehi samupabyūḷho agāriyabhāvo. Tenevāha – ‘‘bahukicco bahukaraṇīyo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etamatthaṃ viditvā"
      },
      "ti kāmesu yathābhūtaṃ ādīnavadassino cittaṃ cirāyitvāpi na patiṭṭhāti, aññadatthu padumapalāse udakabindu viya vinivattatiyevāti etamatthaṃ sabbākārato viditvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Imaṃ udāna"
      },
      "nti pavattiṃ nivattiñca sammadeva jānanto pavattiyaṃ tannimitte ca na kadācipi ramatīti idamatthadīpakaṃ imaṃ udānaṃ udānesi."
    ],
    "innerText": "Etamatthaṃ viditvāti kāmesu yathābhūtaṃ ādīnavadassino cittaṃ cirāyitvāpi na patiṭṭhāti, aññadatthu padumapalāse udakabindu viya vinivattatiyevāti etamatthaṃ sabbākārato viditvā. Imaṃ udānanti pavattiṃ nivattiñca sammadeva jānanto pavattiyaṃ tannimitte ca na kadācipi ramatīti idamatthadīpakaṃ imaṃ udānaṃ udānesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "disvā ādīnavaṃ loke"
      },
      "ti sabbasmiṃ saṅkhāraloke ‘‘anicco dukkho vipariṇāmadhammo’’tiādinā ādīnavaṃ dosaṃ paññāya passitvā. Etena vipassanāvāro kathito ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñatvā dhammaṃ nirupadhi"
      },
      "nti sabbūpadhipaṭinissaggattā nirupadhiṃ nibbānadhammaṃ yathābhūtaṃ ñatvā nissaraṇavivekāsaṅkhatāmatasabhāvato maggañāṇena paṭivijjhitvā. ‘‘Disvā ñatvā’’ti imesaṃ padānaṃ ‘‘sappiṃ pivitvā balaṃ hoti, sīhaṃ disvā bhayaṃ hoti, paññāya disvā āsavā parikkhīṇā hontī’’tiādīsu (pu. pa. 208; a. ni. 9.42-43) viya hetuatthatā daṭṭhabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ariyo na ramatī pāpe"
      },
      "ti kilesehi ārakattā ariyo sappuriso aṇumattepi pāpe na ramati. Kasmā? ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāpe na ramatī sucī"
      },
      "ti suvisuddhakāyasamācārāditāya visuddhapuggalo rājahaṃso viya ukkāraṭṭhāne pāpe saṃkiliṭṭhadhamme na ramati nābhinandati. ‘‘Pāpo na ramatī suci’’ntipi pāṭho. Tassattho – pāpo pāpapuggalo suciṃ anavajjaṃ vodānadhammaṃ na ramati, aññadatthu gāmasūkarādayo viya ukkāraṭṭhānaṃ asuciṃ saṃkilesadhammaṃyeva ramatīti paṭipakkhato desanaṃ parivatteti."
    ],
    "innerText": "Tattha disvā ādīnavaṃ loketi sabbasmiṃ saṅkhāraloke ‘‘anicco dukkho vipariṇāmadhammo’’tiādinā ādīnavaṃ dosaṃ paññāya passitvā. Etena vipassanāvāro kathito . Ñatvā dhammaṃ nirupadhinti sabbūpadhipaṭinissaggattā nirupadhiṃ nibbānadhammaṃ yathābhūtaṃ ñatvā nissaraṇavivekāsaṅkhatāmatasabhāvato maggañāṇena paṭivijjhitvā. ‘‘Disvā ñatvā’’ti imesaṃ padānaṃ ‘‘sappiṃ pivitvā balaṃ hoti, sīhaṃ disvā bhayaṃ hoti, paññāya disvā āsavā parikkhīṇā hontī’’tiādīsu (pu. pa. 208; a. ni. 9.42-43) viya hetuatthatā daṭṭhabbā. Ariyo na ramatī pāpeti kilesehi ārakattā ariyo sappuriso aṇumattepi pāpe na ramati. Kasmā? Pāpe na ramatī sucīti suvisuddhakāyasamācārāditāya visuddhapuggalo rājahaṃso viya ukkāraṭṭhāne pāpe saṃkiliṭṭhadhamme na ramati nābhinandati. ‘‘Pāpo na ramatī suci’’ntipi pāṭho. Tassattho – pāpo pāpapuggalo suciṃ anavajjaṃ vodānadhammaṃ na ramati, aññadatthu gāmasūkarādayo viya ukkāraṭṭhānaṃ asuciṃ saṃkilesadhammaṃyeva ramatīti paṭipakkhato desanaṃ parivatteti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ bhagavatā udāne udānite āyasmā soṇo uṭṭhāyāsanā bhagavantaṃ vanditvā attano upajjhāyassa vacanena paccantadese pañcavaggena ",
      " upasampadādipañcavatthūni yāci. Bhagavāpi tāni anujānīti taṃ sabbaṃ khandhake (mahāva. 242 ādayo) āgatanayena veditabbaṃ."
    ],
    "innerText": "Evaṃ bhagavatā udāne udānite āyasmā soṇo uṭṭhāyāsanā bhagavantaṃ vanditvā attano upajjhāyassa vacanena paccantadese pañcavaggena upasampadādipañcavatthūni yāci. Bhagavāpi tāni anujānīti taṃ sabbaṃ khandhake (mahāva. 242 ādayo) āgatanayena veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Chaṭṭhasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Kaṅkhārevatasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "47"
      },
      ". Sattame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kaṅkhārevato"
      },
      "ti tassa therassa nāmaṃ. So hi sāsane pabbajitvā laddhūpasampado sīlavā kalyāṇadhammo viharati, ‘‘akappiyā muggā, na kappanti muggā paribhuñjituṃ, akappiyo guḷo’’ti (mahāva. 272) ca ādinā vinayakukkuccasaṅkhātakaṅkhābahulo pana hoti. Tena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kaṅkhārevato"
      },
      "ti paññāyittha. So aparabhāge satthu santike kammaṭṭhānaṃ gahetvā ghaṭento vāyamanto chaḷabhiññā sacchikatvā jhānasukhena ",
      " phalasukhena vītināmeti, yebhuyyena pana attanā adhigataṃ ariyamaggaṃ garuṃ katvā paccavekkhati. Tena vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘attano kaṅkhāvitaraṇavisuddhiṃ paccavekkhamāno’’"
      },
      "ti. Maggapaññā hi ‘‘ahosiṃ ",
      " nu kho ahaṃ atītamaddhāna’’ntiādinayapavattāya (ma. ni. 1.18; saṃ. ni. 2.20) soḷasavatthukāya, ‘‘buddhe kaṅkhati…pe… paṭiccasamuppannesu dhammesu kaṅkhatī’’ti (dha. sa. 1008) evaṃ vuttāya aṭṭhavatthukāya, pageva itarāsanti anavasesato sabbakaṅkhānaṃ vitaraṇato samatikkamanato, aññehi ca attanā pahātabbakilesehi accantavisujjhanato ‘‘kaṅkhāvitaraṇavisuddhī’’ti idhādhippetā. Tañhi ayamāyasmā dīgharattaṃ kaṅkhāpakatattā ‘‘imaṃ maggadhammaṃ adhigamma imā me kaṅkhā anavasesā pahīnā’’ti garuṃ katvā paccavekkhamāno nisīdi, na sappaccayanāmarūpadassanaṃ aniccantikattā tassa kaṅkhāvitaraṇassa."
    ],
    "innerText": "47. Sattame kaṅkhārevatoti tassa therassa nāmaṃ. So hi sāsane pabbajitvā laddhūpasampado sīlavā kalyāṇadhammo viharati, ‘‘akappiyā muggā, na kappanti muggā paribhuñjituṃ, akappiyo guḷo’’ti (mahāva. 272) ca ādinā vinayakukkuccasaṅkhātakaṅkhābahulo pana hoti. Tena kaṅkhārevatoti paññāyittha. So aparabhāge satthu santike kammaṭṭhānaṃ gahetvā ghaṭento vāyamanto chaḷabhiññā sacchikatvā jhānasukhena phalasukhena vītināmeti, yebhuyyena pana attanā adhigataṃ ariyamaggaṃ garuṃ katvā paccavekkhati. Tena vuttaṃ – ‘‘attano kaṅkhāvitaraṇavisuddhiṃ paccavekkhamāno’’ti. Maggapaññā hi ‘‘ahosiṃ nu kho ahaṃ atītamaddhāna’’ntiādinayapavattāya (ma. ni. 1.18; saṃ. ni. 2.20) soḷasavatthukāya, ‘‘buddhe kaṅkhati…pe… paṭiccasamuppannesu dhammesu kaṅkhatī’’ti (dha. sa. 1008) evaṃ vuttāya aṭṭhavatthukāya, pageva itarāsanti anavasesato sabbakaṅkhānaṃ vitaraṇato samatikkamanato, aññehi ca attanā pahātabbakilesehi accantavisujjhanato ‘‘kaṅkhāvitaraṇavisuddhī’’ti idhādhippetā. Tañhi ayamāyasmā dīgharattaṃ kaṅkhāpakatattā ‘‘imaṃ maggadhammaṃ adhigamma imā me kaṅkhā anavasesā pahīnā’’ti garuṃ katvā paccavekkhamāno nisīdi, na sappaccayanāmarūpadassanaṃ aniccantikattā tassa kaṅkhāvitaraṇassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etamatthaṃ viditvā"
      },
      "ti etaṃ ariyamaggassa anavasesakaṅkhāvitaraṇasaṅkhātaṃ atthaṃ viditvā tadatthadīpakaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "imaṃ udānaṃ udānesi"
      },
      "."
    ],
    "innerText": "Etamatthaṃ viditvāti etaṃ ariyamaggassa anavasesakaṅkhāvitaraṇasaṅkhātaṃ atthaṃ viditvā tadatthadīpakaṃ imaṃ udānaṃ udānesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yā kāci kaṅkhā idha vā huraṃ vā"
      },
      "ti idha imasmiṃ paccuppanne attabhāve ‘‘ahaṃ nu khosmi no nu khosmī’’tiādinā huraṃ vā, atītānāgatesu attabhāvesu ‘‘ahosiṃ nu kho ahaṃ atītamaddhāna’’ntiādinā uppajjanakā kaṅkhā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sakavediyā vā paravediyā vā"
      },
      "ti tā evaṃ vuttanayeneva ",
      " sakaattabhāve ārammaṇavasena paṭilabhitabbāya pavattiyā sakavediyā vā parassa attabhāve paṭilabhitabbāya ‘‘buddho nu kho, no nu kho’’tiādinā vā parasmiṃ padhāne uttame paṭilabhitabbāya pavattiyā paravediyā vā yā kāci kaṅkhā vicikicchā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ye jhāyino tā pajahanti sabbā, ātāpino brahmacariyaṃ carantā"
      },
      "ti ye ārammaṇūpanijjhānena lakkhaṇūpanijjhānena jhāyino vipassanaṃ ussukkāpetvā catubbidhasammappadhānapāripūriyā ātāpino maggabrahmacariyaṃ carantā adhigacchantā saddhānusārīādippabhedā paṭhamamaggaṭṭhā puggalā, tā sabbā kaṅkhā pajahanti samucchindanti maggakkhaṇe. Tato paraṃ pana tā pahīnā nāma honti, tasmā ito aññaṃ tāsaṃ accantappahānaṃ nāma natthīti adhippāyo."
    ],
    "innerText": "Tattha yā kāci kaṅkhā idha vā huraṃ vāti idha imasmiṃ paccuppanne attabhāve ‘‘ahaṃ nu khosmi no nu khosmī’’tiādinā huraṃ vā, atītānāgatesu attabhāvesu ‘‘ahosiṃ nu kho ahaṃ atītamaddhāna’’ntiādinā uppajjanakā kaṅkhā. Sakavediyā vā paravediyā vāti tā evaṃ vuttanayeneva sakaattabhāve ārammaṇavasena paṭilabhitabbāya pavattiyā sakavediyā vā parassa attabhāve paṭilabhitabbāya ‘‘buddho nu kho, no nu kho’’tiādinā vā parasmiṃ padhāne uttame paṭilabhitabbāya pavattiyā paravediyā vā yā kāci kaṅkhā vicikicchā. Ye jhāyino tā pajahanti sabbā, ātāpino brahmacariyaṃ carantāti ye ārammaṇūpanijjhānena lakkhaṇūpanijjhānena jhāyino vipassanaṃ ussukkāpetvā catubbidhasammappadhānapāripūriyā ātāpino maggabrahmacariyaṃ carantā adhigacchantā saddhānusārīādippabhedā paṭhamamaggaṭṭhā puggalā, tā sabbā kaṅkhā pajahanti samucchindanti maggakkhaṇe. Tato paraṃ pana tā pahīnā nāma honti, tasmā ito aññaṃ tāsaṃ accantappahānaṃ nāma natthīti adhippāyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Iti ",
      " bhagavā jhānamukhena āyasmato kaṅkhārevatassa jhānasīsena ariyamaggādhigamaṃ thomento thomanāvasena udānaṃ udānesi. Teneva ca naṃ ‘‘etadaggaṃ, bhikkhave, mama sāvakānaṃ bhikkhūnaṃ jhāyīnaṃ yadidaṃ kaṅkhārevato’’ti (a. ni. 1.204) jhāyībhāvena etadagge ṭhapesīti."
    ],
    "innerText": "Iti bhagavā jhānamukhena āyasmato kaṅkhārevatassa jhānasīsena ariyamaggādhigamaṃ thomento thomanāvasena udānaṃ udānesi. Teneva ca naṃ ‘‘etadaggaṃ, bhikkhave, mama sāvakānaṃ bhikkhūnaṃ jhāyīnaṃ yadidaṃ kaṅkhārevato’’ti (a. ni. 1.204) jhāyībhāvena etadagge ṭhapesīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sattamasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Saṅghabhedasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "48"
      },
      ". Aṭṭhame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āyasmantaṃ ānandaṃ etadavocā"
      },
      "ti abhimāre payojetvā nāḷāgiriṃ vissajjāpetvā silaṃ pavaṭṭetvā bhagavato anatthaṃ kātuṃ asakkonto ‘‘saṅghaṃ bhinditvā cakkabhedaṃ karissāmī’’ti adhippāyena etaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ajjatagge’’"
      },
      "tiādivacanaṃ avoca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aññatreva bhagavatā"
      },
      "ti vinā eva bhagavantaṃ, satthāraṃ akatvāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aññatra bhikkhusaṅghā"
      },
      "ti vinā eva bhikkhusaṅghaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uposathaṃ karissāmi saṅghakammāni cā"
      },
      "ti bhagavato ovādakārakaṃ bhikkhusaṅghaṃ visuṃ katvā maṃ anuvattantehi bhikkhūhi saddhiṃ āveṇikaṃ uposathaṃ saṅghakammāni ca karissāmīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Devadatto saṅghaṃ bhindissatī"
      },
      "ti bhedakarānaṃ sabbesaṃ devadattena sajjitattā ekaṃseneva devadatto ajja ",
      " saṅghaṃ bhindissati dvidhā karissati. ‘‘Adhammaṃ dhammo’’tiādīsu hi aṭṭhārasasu bhedakaravatthūsu yaṃkiñci ekampi vatthuṃ dīpetvā tena tena kāraṇena ‘‘imaṃ gaṇhatha, imaṃ rocethā’’ti saññāpetvā salākaṃ gāhetvā visuṃ saṅghakamme kate saṅgho bhinno hoti. Vuttañhetaṃ –"
    ],
    "innerText": "48. Aṭṭhame āyasmantaṃ ānandaṃ etadavocāti abhimāre payojetvā nāḷāgiriṃ vissajjāpetvā silaṃ pavaṭṭetvā bhagavato anatthaṃ kātuṃ asakkonto ‘‘saṅghaṃ bhinditvā cakkabhedaṃ karissāmī’’ti adhippāyena etaṃ ‘‘ajjatagge’’tiādivacanaṃ avoca. Aññatreva bhagavatāti vinā eva bhagavantaṃ, satthāraṃ akatvāti attho. Aññatra bhikkhusaṅghāti vinā eva bhikkhusaṅghaṃ. Uposathaṃ karissāmi saṅghakammāni cāti bhagavato ovādakārakaṃ bhikkhusaṅghaṃ visuṃ katvā maṃ anuvattantehi bhikkhūhi saddhiṃ āveṇikaṃ uposathaṃ saṅghakammāni ca karissāmīti attho. Devadatto saṅghaṃ bhindissatīti bhedakarānaṃ sabbesaṃ devadattena sajjitattā ekaṃseneva devadatto ajja saṅghaṃ bhindissati dvidhā karissati. ‘‘Adhammaṃ dhammo’’tiādīsu hi aṭṭhārasasu bhedakaravatthūsu yaṃkiñci ekampi vatthuṃ dīpetvā tena tena kāraṇena ‘‘imaṃ gaṇhatha, imaṃ rocethā’’ti saññāpetvā salākaṃ gāhetvā visuṃ saṅghakamme kate saṅgho bhinno hoti. Vuttañhetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Pañcahi, upāli, ākārehi saṅgho bhijjati kammena uddesena voharanto anussāvanena salākaggāhenā’’ti (pari. 458)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kammenā"
      },
      "ti apalokanakammādīsu catūsu kammesu aññatarena kammena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uddesenā"
      },
      "ti ",
      " pañcasu pātimokkhuddesesu aññatarena uddesena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Voharanto"
      },
      "ti tāhi tāhi uppattīhi ‘‘adhammaṃ dhammo’’tiādīni (a. ni. 10.37; cūḷava. 352) aṭṭhārasabhedakaravatthūni dīpento. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anussāvanenā"
      },
      "ti ‘‘nanu tumhe jānātha mayhaṃ uccākulā pabbajitabhāvaṃ bahussutabhāvañca, mādiso nāma uddhammaṃ ubbinayaṃ gāheyyāti kiṃ tumhākaṃ cittampi uppādetuṃ yuttaṃ, kimahaṃ apāyato na bhāyāmī’’tiādinā nayena kaṇṇamūle vacībhedaṃ katvā anussāvanena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Salākaggāhenā"
      },
      "ti evaṃ anussāvetvā tesaṃ cittaṃ upatthambhetvā anāvattidhamme katvā ‘‘gaṇhatha imaṃ salāka’’nti salākaggāhena."
    ],
    "innerText": "Tattha kammenāti apalokanakammādīsu catūsu kammesu aññatarena kammena. Uddesenāti pañcasu pātimokkhuddesesu aññatarena uddesena. Voharantoti tāhi tāhi uppattīhi ‘‘adhammaṃ dhammo’’tiādīni (a. ni. 10.37; cūḷava. 352) aṭṭhārasabhedakaravatthūni dīpento. Anussāvanenāti ‘‘nanu tumhe jānātha mayhaṃ uccākulā pabbajitabhāvaṃ bahussutabhāvañca, mādiso nāma uddhammaṃ ubbinayaṃ gāheyyāti kiṃ tumhākaṃ cittampi uppādetuṃ yuttaṃ, kimahaṃ apāyato na bhāyāmī’’tiādinā nayena kaṇṇamūle vacībhedaṃ katvā anussāvanena. Salākaggāhenāti evaṃ anussāvetvā tesaṃ cittaṃ upatthambhetvā anāvattidhamme katvā ‘‘gaṇhatha imaṃ salāka’’nti salākaggāhena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettha ca kammameva uddeso vā pamāṇaṃ, vohārānussāvanasalākaggāhā pana pubbabhāgā. Aṭṭhārasavatthudīpanavasena hi voharantena tattha rucijananatthaṃ anussāvetvā salākāya gāhitāyapi abhinnova hoti saṅgho. Yadā panevaṃ cattāro vā atirekā vā salākaṃ gāhetvā āveṇikaṃ uddesaṃ vā kammaṃ vā karonti, tadā saṅgho bhinno nāma hoti. Devadatto ca sabbaṃ saṅghabhedassa pubbabhāgaṃ ",
      " nipphādetvā ‘‘ekaṃseneva ajja āveṇikaṃ uposathaṃ saṅghakammañca karissāmī’’ti cintetvā ‘‘ajjatagge’’tiādivacanaṃ avoca. Tenāha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ajja, bhante, devadatto saṅghaṃ bhindissatī’’"
      },
      "ti. Yato avocumhā ‘‘bhedakarānaṃ sabbesaṃ devadattena sajjitattā’’ti."
    ],
    "innerText": "Ettha ca kammameva uddeso vā pamāṇaṃ, vohārānussāvanasalākaggāhā pana pubbabhāgā. Aṭṭhārasavatthudīpanavasena hi voharantena tattha rucijananatthaṃ anussāvetvā salākāya gāhitāyapi abhinnova hoti saṅgho. Yadā panevaṃ cattāro vā atirekā vā salākaṃ gāhetvā āveṇikaṃ uddesaṃ vā kammaṃ vā karonti, tadā saṅgho bhinno nāma hoti. Devadatto ca sabbaṃ saṅghabhedassa pubbabhāgaṃ nipphādetvā ‘‘ekaṃseneva ajja āveṇikaṃ uposathaṃ saṅghakammañca karissāmī’’ti cintetvā ‘‘ajjatagge’’tiādivacanaṃ avoca. Tenāha – ‘‘ajja, bhante, devadatto saṅghaṃ bhindissatī’’ti. Yato avocumhā ‘‘bhedakarānaṃ sabbesaṃ devadattena sajjitattā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etamatthaṃ viditvā"
      },
      "ti etaṃ avīcimahānirayuppattisaṃvattaniyaṃ kappaṭṭhiyaṃ atekicchaṃ devadattena nibbattiyamānaṃ saṅghabhedakammaṃ sabbākārato viditvā ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Imaṃ udāna"
      },
      "nti kusalākusalesu yathākkamaṃ sappurisāsappurisasabhāgavisabhāgapaṭipattivasena pana sukusalāti idamatthavibhāvanaṃ imaṃ udānaṃ udānesi."
    ],
    "innerText": "Etamatthaṃ viditvāti etaṃ avīcimahānirayuppattisaṃvattaniyaṃ kappaṭṭhiyaṃ atekicchaṃ devadattena nibbattiyamānaṃ saṅghabhedakammaṃ sabbākārato viditvā . Imaṃ udānanti kusalākusalesu yathākkamaṃ sappurisāsappurisasabhāgavisabhāgapaṭipattivasena pana sukusalāti idamatthavibhāvanaṃ imaṃ udānaṃ udānesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sukaraṃ sādhunā sādhū"
      },
      "ti attano paresañca hitaṃ sādhetīti ",
      " sādhu, sammāpaṭipanno. Tena sādhunā sāriputtādinā sāvakena paccekabuddhena sammāsambuddhena aññena vā lokiyasādhunā sādhu sundaraṃ bhaddakaṃ attano paresañca hitasukhāvahaṃ sukaraṃ sukhena kātuṃ sakkā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sādhu pāpena dukkara"
      },
      "nti tadeva pana vuttalakkhaṇaṃ sādhu pāpena devadattādinā pāpapuggalena dukkaraṃ kātuṃ na sakkā, na so taṃ kātuṃ sakkotīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāpaṃ pāpena sukara"
      },
      "nti pāpaṃ asundaraṃ attano paresañca anatthāvahaṃ pāpena yathāvuttapāpapuggalena sukaraṃ sukhena kātuṃ sakkuṇeyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāpamariyehi dukkara"
      },
      "nti ariyehi pana buddhādīhi taṃ taṃ pāpaṃ dukkaraṃ durabhisambhavaṃ. Setughātoyeva hi tesanti satthā dīpeti."
    ],
    "innerText": "Tattha sukaraṃ sādhunā sādhūti attano paresañca hitaṃ sādhetīti sādhu, sammāpaṭipanno. Tena sādhunā sāriputtādinā sāvakena paccekabuddhena sammāsambuddhena aññena vā lokiyasādhunā sādhu sundaraṃ bhaddakaṃ attano paresañca hitasukhāvahaṃ sukaraṃ sukhena kātuṃ sakkā. Sādhu pāpena dukkaranti tadeva pana vuttalakkhaṇaṃ sādhu pāpena devadattādinā pāpapuggalena dukkaraṃ kātuṃ na sakkā, na so taṃ kātuṃ sakkotīti attho. Pāpaṃ pāpena sukaranti pāpaṃ asundaraṃ attano paresañca anatthāvahaṃ pāpena yathāvuttapāpapuggalena sukaraṃ sukhena kātuṃ sakkuṇeyya. Pāpamariyehi dukkaranti ariyehi pana buddhādīhi taṃ taṃ pāpaṃ dukkaraṃ durabhisambhavaṃ. Setughātoyeva hi tesanti satthā dīpeti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Aṭṭhamasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Sadhāyamānasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "49"
      },
      ". Navame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "māṇavakā"
      },
      "ti taruṇā. Paṭhame yobbane ṭhitā brāhmaṇakumārakā idhādhippetā."
    ],
    "innerText": "49. Navame māṇavakāti taruṇā. Paṭhame yobbane ṭhitā brāhmaṇakumārakā idhādhippetā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sadhāyamānarūpā"
      },
      "ti uppaṇḍanajātikaṃ vacanaṃ sandhāya vuttaṃ. Aññesaṃ uppaṇḍentā sadhanti, tadatthavacanasīlāti attho. Tassāyaṃ vacanattho – sadhanaṃ sadho, taṃ ācikkhantīti sadhayamānāti vattabbe dīghaṃ katvā ‘‘sadhāyamānā’’ti vuttaṃ. Atha vā visesato sasedhe viya attānaṃ āvadantīti sadhāyamānā. Te evaṃ sabhāvatāya ‘‘sadhāyamānarūpā’’ti vuttaṃ. ‘‘Saddāyamānarūpā’’tipi ",
      " pāṭho, uccāsaddamahāsaddaṃ karontāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhagavato avidūre atikkamantī"
      },
      "ti bhagavato savanavisaye taṃ taṃ mukhāruḷhaṃ vadantā atiyanti."
    ],
    "innerText": "Sadhāyamānarūpāti uppaṇḍanajātikaṃ vacanaṃ sandhāya vuttaṃ. Aññesaṃ uppaṇḍentā sadhanti, tadatthavacanasīlāti attho. Tassāyaṃ vacanattho – sadhanaṃ sadho, taṃ ācikkhantīti sadhayamānāti vattabbe dīghaṃ katvā ‘‘sadhāyamānā’’ti vuttaṃ. Atha vā visesato sasedhe viya attānaṃ āvadantīti sadhāyamānā. Te evaṃ sabhāvatāya ‘‘sadhāyamānarūpā’’ti vuttaṃ. ‘‘Saddāyamānarūpā’’tipi pāṭho, uccāsaddamahāsaddaṃ karontāti attho. Bhagavato avidūre atikkamantīti bhagavato savanavisaye taṃ taṃ mukhāruḷhaṃ vadantā atiyanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etamatthaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "viditvā"
      },
      "ti etaṃ tesaṃ vācāya asaññatabhāvaṃ ",
      " jānitvā tadatthadīpakaṃ dhammasaṃvegavasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "imaṃ udānaṃ udānesi"
      },
      "."
    ],
    "innerText": "Etamatthaṃviditvāti etaṃ tesaṃ vācāya asaññatabhāvaṃ jānitvā tadatthadīpakaṃ dhammasaṃvegavasena imaṃ udānaṃ udānesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "parimuṭṭhā"
      },
      "ti dandhā muṭṭhassatino. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṇḍitābhāsā"
      },
      "ti paṇḍitapatirūpakā ‘‘ke aññe jānanti, mayamevettha jānāmā’’ti tasmiṃ tasmiṃ atthe attānameva jānantaṃ katvā samudācaraṇato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vācāgocarabhāṇino"
      },
      "ti yesaṃ vācā eva gocaro visayo, te vācāgocarabhāṇino, vācāvatthumattasseva bhāṇino atthassa apariññātattā. Atha vā vācāya agocaraṃ ariyānaṃ kathāya avisayaṃ musāvādaṃ bhaṇantīti vācāgocarabhāṇino. Atha vā ‘‘gocarabhāṇino’’ti ettha ākārassa rassabhāvo kato. Vācāgocarā, na satipaṭṭhānādigocarā bhāṇinova. Kathaṃ bhāṇino? ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yāvicchanti mukhāyāmaṃ"
      },
      " attano yāva mukhāyāmaṃ yāva mukhappasāraṇaṃ icchanti, tāva pasāretvā bhāṇino, paresu gāravena, attano avisayatāya ca mukhasaṅkocaṃ na karontīti attho. Atha vā vācāgocarā eva hutvā bhāṇino, sayaṃ ajānitvā parapattikā eva hutvā vattāroti attho. Tato eva yāvicchanti mukhāyāmaṃ yena vacanena sāvetabbā, taṃ acintetvā yāvadeva attano mukhappasāraṇamattaṃ icchantīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yena nītā na taṃ vidū"
      },
      "ti yena muṭṭhassaccādinā nillajjabhāvaṃ paṇḍitamānībhāvañca nītā ‘‘mayamevaṃ bhaṇāmā’’ti, taṃ tathā attano bhaṇantassa kāraṇaṃ na vidū, aviddasuno asūrā na jānantīti attho."
    ],
    "innerText": "Tattha parimuṭṭhāti dandhā muṭṭhassatino. Paṇḍitābhāsāti paṇḍitapatirūpakā ‘‘ke aññe jānanti, mayamevettha jānāmā’’ti tasmiṃ tasmiṃ atthe attānameva jānantaṃ katvā samudācaraṇato. Vācāgocarabhāṇinoti yesaṃ vācā eva gocaro visayo, te vācāgocarabhāṇino, vācāvatthumattasseva bhāṇino atthassa apariññātattā. Atha vā vācāya agocaraṃ ariyānaṃ kathāya avisayaṃ musāvādaṃ bhaṇantīti vācāgocarabhāṇino. Atha vā ‘‘gocarabhāṇino’’ti ettha ākārassa rassabhāvo kato. Vācāgocarā, na satipaṭṭhānādigocarā bhāṇinova. Kathaṃ bhāṇino? Yāvicchanti mukhāyāmaṃ attano yāva mukhāyāmaṃ yāva mukhappasāraṇaṃ icchanti, tāva pasāretvā bhāṇino, paresu gāravena, attano avisayatāya ca mukhasaṅkocaṃ na karontīti attho. Atha vā vācāgocarā eva hutvā bhāṇino, sayaṃ ajānitvā parapattikā eva hutvā vattāroti attho. Tato eva yāvicchanti mukhāyāmaṃ yena vacanena sāvetabbā, taṃ acintetvā yāvadeva attano mukhappasāraṇamattaṃ icchantīti attho. Yena nītā na taṃ vidūti yena muṭṭhassaccādinā nillajjabhāvaṃ paṇḍitamānībhāvañca nītā ‘‘mayamevaṃ bhaṇāmā’’ti, taṃ tathā attano bhaṇantassa kāraṇaṃ na vidū, aviddasuno asūrā na jānantīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Navamasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Cūḷapanthakasuttavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "50"
      },
      ". Dasame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cūḷapanthako"
      },
      "ti mahāpanthakattherassa kaniṭṭhabhātikattā panthe jātattā ca daharakāle laddhavohārena aparabhāgepi ayamāyasmā ‘‘cūḷapanthako’’tveva paññāyittha. Guṇavisesehi pana chaḷabhiñño pabhinnapaṭisambhido ‘‘etadaggaṃ, bhikkhave, mama sāvakānaṃ bhikkhūnaṃ ",
      " manomayaṃ kāyaṃ abhinimminantānaṃ yadidaṃ cūḷapanthako, cetovivaṭṭakusalānaṃ ",
      " yadidaṃ cūḷapanthako’’ti dvīsu (a. ni. 1.199) ṭhānesu bhagavatā etadagge ṭhapito asītiyā mahāsāvakesu abbhantaro."
    ],
    "innerText": "50. Dasame cūḷapanthakoti mahāpanthakattherassa kaniṭṭhabhātikattā panthe jātattā ca daharakāle laddhavohārena aparabhāgepi ayamāyasmā ‘‘cūḷapanthako’’tveva paññāyittha. Guṇavisesehi pana chaḷabhiñño pabhinnapaṭisambhido ‘‘etadaggaṃ, bhikkhave, mama sāvakānaṃ bhikkhūnaṃ manomayaṃ kāyaṃ abhinimminantānaṃ yadidaṃ cūḷapanthako, cetovivaṭṭakusalānaṃ yadidaṃ cūḷapanthako’’ti dvīsu (a. ni. 1.199) ṭhānesu bhagavatā etadagge ṭhapito asītiyā mahāsāvakesu abbhantaro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "So ekadivasaṃ pacchābhattaṃ piṇḍapātappaṭikkanto attano divāṭṭhāne divāvihāraṃ nisinno samāpattīhi divasabhāgaṃ vītināmetvā sāyanhasamayaṃ upāsakesu dhammassavanatthaṃ anāgatesu eva vihāramajjhaṃ pavisitvā bhagavati gandhakuṭiyaṃ nisinne ‘‘akālo tāva bhagavato upaṭṭhānaṃ upasaṅkamitu’’nti gandhakuṭipamukhe ekamantaṃ nisīdi pallaṅkaṃ ābhujitvā. Tena vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tena kho pana samayena āyasmā cūḷapanthako bhagavato avidūre nisinno hoti pallaṅkaṃ ābhujitvā ujuṃ kāyaṃ paṇidhāya parimukhaṃ satiṃ upaṭṭhapetvā’’"
      },
      "ti. So hi tadā kālaparicchedaṃ katvā samāpattiṃ samāpajjitvā nisīdi."
    ],
    "innerText": "So ekadivasaṃ pacchābhattaṃ piṇḍapātappaṭikkanto attano divāṭṭhāne divāvihāraṃ nisinno samāpattīhi divasabhāgaṃ vītināmetvā sāyanhasamayaṃ upāsakesu dhammassavanatthaṃ anāgatesu eva vihāramajjhaṃ pavisitvā bhagavati gandhakuṭiyaṃ nisinne ‘‘akālo tāva bhagavato upaṭṭhānaṃ upasaṅkamitu’’nti gandhakuṭipamukhe ekamantaṃ nisīdi pallaṅkaṃ ābhujitvā. Tena vuttaṃ – ‘‘tena kho pana samayena āyasmā cūḷapanthako bhagavato avidūre nisinno hoti pallaṅkaṃ ābhujitvā ujuṃ kāyaṃ paṇidhāya parimukhaṃ satiṃ upaṭṭhapetvā’’ti. So hi tadā kālaparicchedaṃ katvā samāpattiṃ samāpajjitvā nisīdi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etamatthaṃ viditvā"
      },
      "ti etaṃ āyasmato cūḷapanthakassa kāyacittānaṃ sammāpaṇihitabhāvasaṅkhātaṃ atthaṃ jānitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Imaṃ udāna"
      },
      "nti aññopi yo passaddhakāyo sabbiriyāpathesu upaṭṭhitassati samāhito, tassa bhikkhuno anupādā parinibbānapariyosānassa visesādhigamassa tattha pātubhāvavibhāvanaṃ imaṃ udānaṃ udānesi."
    ],
    "innerText": "Etamatthaṃ viditvāti etaṃ āyasmato cūḷapanthakassa kāyacittānaṃ sammāpaṇihitabhāvasaṅkhātaṃ atthaṃ jānitvā. Imaṃ udānanti aññopi yo passaddhakāyo sabbiriyāpathesu upaṭṭhitassati samāhito, tassa bhikkhuno anupādā parinibbānapariyosānassa visesādhigamassa tattha pātubhāvavibhāvanaṃ imaṃ udānaṃ udānesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ṭhitena kāyenā"
      },
      "ti kāyadvārikassa asaṃvarassa pahānena akaraṇena sammā ṭhapitena copanakāyena, tathā cakkhādīnaṃ indriyānaṃ nibbisevanabhāvakaraṇena suṭṭhu ṭhapitena pañcadvārikakāyena, saṃyatahatthapādatāya hatthakukkuccādīnaṃ abhāvato apariphandanena ṭhitena karajakāyena cāti saṅkhepato sabbenapi kāyena nibbikāratāsaṅkhātena niccalabhāvena ṭhitena. Etenassa sīlapārisuddhi dassitā. Itthambhūtalakkhaṇe ca idaṃ karaṇavacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ṭhitena cetasā"
      },
      "ti cittassa ṭhitiparidīpanena samādhisampadaṃ dasseti. Samādhi hi cittassa ‘ṭhitī’ti vuccati. Tasmā samathavasena vipassanāvaseneva vā ekaggatāya sati cittaṃ ārammaṇe ekodibhāvūpagamanena ṭhitaṃ nāma hoti, na aññathā. Idañca yathāvuttakāyacittānaṃ ṭhapanaṃ samādahanaṃ sabbasmiṃ kāle sabbesu ca iriyāpathesu icchitabbanti dassento āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tiṭṭhaṃ nisinno uda vā sayāno’’"
      },
      "ti ",
      ". Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vā"
      },
      "-saddo aniyamattho. Tena tiṭṭhanto vā nisinno vā sayāno vā tadaññiriyāpatho vāti ayamattho dīpito hotīti caṅkamanassāpi idha saṅgaho veditabbo."
    ],
    "innerText": "Tattha ṭhitena kāyenāti kāyadvārikassa asaṃvarassa pahānena akaraṇena sammā ṭhapitena copanakāyena, tathā cakkhādīnaṃ indriyānaṃ nibbisevanabhāvakaraṇena suṭṭhu ṭhapitena pañcadvārikakāyena, saṃyatahatthapādatāya hatthakukkuccādīnaṃ abhāvato apariphandanena ṭhitena karajakāyena cāti saṅkhepato sabbenapi kāyena nibbikāratāsaṅkhātena niccalabhāvena ṭhitena. Etenassa sīlapārisuddhi dassitā. Itthambhūtalakkhaṇe ca idaṃ karaṇavacanaṃ. Ṭhitena cetasāti cittassa ṭhitiparidīpanena samādhisampadaṃ dasseti. Samādhi hi cittassa ‘ṭhitī’ti vuccati. Tasmā samathavasena vipassanāvaseneva vā ekaggatāya sati cittaṃ ārammaṇe ekodibhāvūpagamanena ṭhitaṃ nāma hoti, na aññathā. Idañca yathāvuttakāyacittānaṃ ṭhapanaṃ samādahanaṃ sabbasmiṃ kāle sabbesu ca iriyāpathesu icchitabbanti dassento āha – ‘‘tiṭṭhaṃ nisinno uda vā sayāno’’ti . Tattha vā-saddo aniyamattho. Tena tiṭṭhanto vā nisinno vā sayāno vā tadaññiriyāpatho vāti ayamattho dīpito hotīti caṅkamanassāpi idha saṅgaho veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "satiṃ bhikkhu adhiṭṭhahāno"
      },
      "ti yāya pageva parisuddhasamācāro kāyacittaduṭṭhullabhāvūpasamanena kāyaṃ cittañca asāraddhaṃ katvā paṭiladdhāya anavajjasukhādhiṭṭhāya kāyacittapassaddhivasena cittaṃ lahuṃ muduṃ kammaññañca katvā sammā ṭhapento samādahanto kammaṭṭhānaṃ paribrūheti matthakañca pāpeti, taṃ eva kammaṭṭhānānuyogassa ādimajjhapariyosānesu bahūpakāraṃ satiṃ bhikkhu adhiṭṭhahāno sīlavisodhanaṃ ādiṃ katvā yāva visesādhigamā tattha tattha adhiṭṭhahantoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Labhetha pubbāpariyaṃ visesa"
      },
      "nti so evaṃ satiārakkhena cetasā kammaṭṭhānaṃ uparūpari vaḍḍhento brūhento phātiṃ karonto pubbāpariyaṃ pubbāpariyavantaṃ pubbāparabhāgena pavattaṃ uḷāruḷāratarādibhedavisesaṃ labheyya."
    ],
    "innerText": "Etaṃsatiṃ bhikkhu adhiṭṭhahānoti yāya pageva parisuddhasamācāro kāyacittaduṭṭhullabhāvūpasamanena kāyaṃ cittañca asāraddhaṃ katvā paṭiladdhāya anavajjasukhādhiṭṭhāya kāyacittapassaddhivasena cittaṃ lahuṃ muduṃ kammaññañca katvā sammā ṭhapento samādahanto kammaṭṭhānaṃ paribrūheti matthakañca pāpeti, taṃ eva kammaṭṭhānānuyogassa ādimajjhapariyosānesu bahūpakāraṃ satiṃ bhikkhu adhiṭṭhahāno sīlavisodhanaṃ ādiṃ katvā yāva visesādhigamā tattha tattha adhiṭṭhahantoti attho. Labhetha pubbāpariyaṃ visesanti so evaṃ satiārakkhena cetasā kammaṭṭhānaṃ uparūpari vaḍḍhento brūhento phātiṃ karonto pubbāpariyaṃ pubbāpariyavantaṃ pubbāparabhāgena pavattaṃ uḷāruḷāratarādibhedavisesaṃ labheyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha duvidho pubbāpariyaviseso samathavasena vipassanāvasena cāti. Tesu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samathavasena"
      },
      " tāva nimittuppattito paṭṭhāya yāva nevasaññānāsaññāyatanavasībhāvo, tāva pavatto bhāvanāviseso pubbāpariyaviseso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vipassanāvasena"
      },
      " pana rūpamukhena abhinivisantassa rūpadhammapariggahato, itarassa nāmadhammapariggahato paṭṭhāya yāva arahattādhigamo, tāva pavatto bhāvanāviseso pubbāpariyaviseso. Ayameva ca idhādhippeto."
    ],
    "innerText": "Tattha duvidho pubbāpariyaviseso samathavasena vipassanāvasena cāti. Tesu samathavasena tāva nimittuppattito paṭṭhāya yāva nevasaññānāsaññāyatanavasībhāvo, tāva pavatto bhāvanāviseso pubbāpariyaviseso. Vipassanāvasena pana rūpamukhena abhinivisantassa rūpadhammapariggahato, itarassa nāmadhammapariggahato paṭṭhāya yāva arahattādhigamo, tāva pavatto bhāvanāviseso pubbāpariyaviseso. Ayameva ca idhādhippeto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Laddhāna pubbāpariyaṃ visesa"
      },
      "nti pubbāpariyavisesaṃ ukkaṃsapāramippattaṃ arahattaṃ labhitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adassanaṃ maccurājassa gacche"
      },
      "ti jīvitupacchedavasena sabbesaṃ sattānaṃ abhibhavanato maccurājasaṅkhātassa maraṇassa visayabhūtaṃ bhavattayaṃ samatikkantattā adassanaṃ agocaraṃ gaccheyya. Imasmiṃ vagge yaṃ avuttaṃ, taṃ heṭṭhā vuttanayamevāti."
    ],
    "innerText": "Laddhāna pubbāpariyaṃ visesanti pubbāpariyavisesaṃ ukkaṃsapāramippattaṃ arahattaṃ labhitvā. Adassanaṃ maccurājassa gaccheti jīvitupacchedavasena sabbesaṃ sattānaṃ abhibhavanato maccurājasaṅkhātassa maraṇassa visayabhūtaṃ bhavattayaṃ samatikkantattā adassanaṃ agocaraṃ gaccheyya. Imasmiṃ vagge yaṃ avuttaṃ, taṃ heṭṭhā vuttanayamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dasamasuttavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Niṭṭhitā ca mahāvaggavaṇṇanā."
  }
]