[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "13. Mahāviyūhasuttaniddeso"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " mahāviyūhasuttaniddesaṃ vakkhati –"
    ],
    "innerText": "Atha mahāviyūhasuttaniddesaṃ vakkhati –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "130"
      },
      "."
    ],
    "innerText": "130."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ye"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kecime diṭṭhiparibbasānā, idameva saccanti ca vādayanti"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[saccanti pavādayanti (syā.)]"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": ";"
      }
    ],
    "innerText": "Yekecime diṭṭhiparibbasānā, idameva saccanti ca vādayanti[saccanti pavādayanti (syā.)];"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sabbeva te nindamanvānayanti, atho pasaṃsampi labhanti tattha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ye kecime diṭṭhiparibbasānā"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ye kecī"
      },
      "ti sabbena sabbaṃ sabbathā sabbaṃ asesaṃ nissesaṃ pariyādiyanavacanametaṃ – ye kecīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Diṭṭhiparibbasānā"
      },
      "ti. Santeke samaṇabrāhmaṇā diṭṭhigatikā; te dvāsaṭṭhiyā diṭṭhigatānaṃ aññataraññataraṃ diṭṭhigataṃ gahetvā uggahetvā gaṇhitvā parāmasitvā ",
      " abhinivisitvā sakāya sakāya diṭṭhiyā vasanti saṃvasanti āvasanti parivasanti. Yathā agārikā vā gharesu vasanti, sāpattikā vā āpattīsu vasanti, sakilesā vā kilesesu vasanti; evameva santeke…pe… parivasantīti – ye kecime diṭṭhiparibbasānā."
    ],
    "innerText": "Ye kecime diṭṭhiparibbasānāti. Ye kecīti sabbena sabbaṃ sabbathā sabbaṃ asesaṃ nissesaṃ pariyādiyanavacanametaṃ – ye kecīti. Diṭṭhiparibbasānāti. Santeke samaṇabrāhmaṇā diṭṭhigatikā; te dvāsaṭṭhiyā diṭṭhigatānaṃ aññataraññataraṃ diṭṭhigataṃ gahetvā uggahetvā gaṇhitvā parāmasitvā abhinivisitvā sakāya sakāya diṭṭhiyā vasanti saṃvasanti āvasanti parivasanti. Yathā agārikā vā gharesu vasanti, sāpattikā vā āpattīsu vasanti, sakilesā vā kilesesu vasanti; evameva santeke…pe… parivasantīti – ye kecime diṭṭhiparibbasānā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idameva saccanti ca vādayantī"
      },
      "ti. ‘‘Sassato loko, idameva saccaṃ moghamañña’’nti vadanti kathenti bhaṇanti dīpayanti voharanti. ‘‘Asassato loko…pe… neva hoti na na hoti tathāgato paraṃ maraṇā, idameva saccaṃ ",
      " moghamañña’’nti vadanti kathenti bhaṇanti dīpayanti ",
      " voharantīti – idameva saccanti ca vādayanti."
    ],
    "innerText": "Idameva saccanti ca vādayantīti. ‘‘Sassato loko, idameva saccaṃ moghamañña’’nti vadanti kathenti bhaṇanti dīpayanti voharanti. ‘‘Asassato loko…pe… neva hoti na na hoti tathāgato paraṃ maraṇā, idameva saccaṃ moghamañña’’nti vadanti kathenti bhaṇanti dīpayanti voharantīti – idameva saccanti ca vādayanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbeva te nindamanvānayantī"
      },
      "ti. Sabbeva te samaṇabrāhmaṇā nindameva anventi, garahameva anventi, akittimeva anventi; sabbe ninditāyeva honti, garahitāyeva honti, akittitāyeva hontīti – sabbeva te nindamanvānayanti."
    ],
    "innerText": "Sabbeva te nindamanvānayantīti. Sabbeva te samaṇabrāhmaṇā nindameva anventi, garahameva anventi, akittimeva anventi; sabbe ninditāyeva honti, garahitāyeva honti, akittitāyeva hontīti – sabbeva te nindamanvānayanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atho pasaṃsampi labhanti tatthā"
      },
      "ti. Tattha sakāya diṭṭhiyā sakāya khantiyā sakāya ruciyā sakāya laddhiyā pasaṃsaṃ thomanaṃ kittiṃ vaṇṇahārikaṃ labhanti paṭilabhanti upagacchanti vindantīti – atho pasaṃsampi labhanti tattha."
    ],
    "innerText": "Atho pasaṃsampi labhanti tatthāti. Tattha sakāya diṭṭhiyā sakāya khantiyā sakāya ruciyā sakāya laddhiyā pasaṃsaṃ thomanaṃ kittiṃ vaṇṇahārikaṃ labhanti paṭilabhanti upagacchanti vindantīti – atho pasaṃsampi labhanti tattha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tenāha ",
      " so nimmito –"
    ],
    "innerText": "Tenāha so nimmito –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ye kecime diṭṭhiparibbasānā, idameva saccanti ca vādayanti;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sabbeva te nindamanvānayanti, atho pasaṃsampi labhanti tatthā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "131"
      },
      "."
    ],
    "innerText": "131."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Appañhi etaṃ na alaṃ samāya, duve vivādassa phalāni brūmi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Etampi disvā na vivādayetha, khemābhipassaṃ avivādabhūmiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appañhi etaṃ na alaṃ samāyā"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appañhi eta"
      },
      "nti appakaṃ etaṃ, omakaṃ etaṃ, thokakaṃ etaṃ, lāmakaṃ etaṃ, chatukkaṃ etaṃ, parittakaṃ etanti – appañhi etaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na alaṃ samāyā"
      },
      "ti nālaṃ rāgassa ",
      " samāya, dosassa samāya, mohassa samāya ",
      ", kodhassa… upanāhassa… makkhassa… paḷāsassa… issāya… macchariyassa… māyāya… sāṭheyyassa… thambhassa… sārambhassa… mānassa… atimānassa… madassa… pamādassa… sabbakilesānaṃ… sabbaduccaritānaṃ… sabbadarathānaṃ ",
      " … sabbapariḷāhānaṃ… sabbasantāpānaṃ… sabbākusalābhisaṅkhārānaṃ samāya upasamāya vūpasamāya nibbānāya paṭinissaggāya paṭipassaddhiyāti – appañhi etaṃ na alaṃ samāya."
    ],
    "innerText": "Appañhi etaṃ na alaṃ samāyāti. Appañhi etanti appakaṃ etaṃ, omakaṃ etaṃ, thokakaṃ etaṃ, lāmakaṃ etaṃ, chatukkaṃ etaṃ, parittakaṃ etanti – appañhi etaṃ. Na alaṃ samāyāti nālaṃ rāgassa samāya, dosassa samāya, mohassa samāya , kodhassa… upanāhassa… makkhassa… paḷāsassa… issāya… macchariyassa… māyāya… sāṭheyyassa… thambhassa… sārambhassa… mānassa… atimānassa… madassa… pamādassa… sabbakilesānaṃ… sabbaduccaritānaṃ… sabbadarathānaṃ … sabbapariḷāhānaṃ… sabbasantāpānaṃ… sabbākusalābhisaṅkhārānaṃ samāya upasamāya vūpasamāya nibbānāya paṭinissaggāya paṭipassaddhiyāti – appañhi etaṃ na alaṃ samāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Duve vivādassa phalāni brūmī"
      },
      "ti. Diṭṭhikalahassa diṭṭhibhaṇḍanassa diṭṭhiviggahassa diṭṭhivivādassa diṭṭhimedhagassa dve phalāni honti – jayaparājayo hoti, lābhālābho hoti, yasāyaso hoti, nindāpasaṃso hoti, sukhadukkhaṃ hoti, somanassadomanassaṃ hoti, iṭṭhāniṭṭhaṃ hoti, anunayapaṭighaṃ hoti, ugghātinigghāti hoti, anurodhavirodho hoti. Atha vā taṃ kammaṃ nirayasaṃvattanikaṃ, tiracchānayonisaṃvattanikaṃ, pettivisayasaṃvattanikanti brūmi ācikkhāmi desemi paññapemi paṭṭhapemi vivarāmi vibhajāmi uttānīkaromi pakāsemīti – duve vivādassa phalāni brūmi."
    ],
    "innerText": "Duve vivādassa phalāni brūmīti. Diṭṭhikalahassa diṭṭhibhaṇḍanassa diṭṭhiviggahassa diṭṭhivivādassa diṭṭhimedhagassa dve phalāni honti – jayaparājayo hoti, lābhālābho hoti, yasāyaso hoti, nindāpasaṃso hoti, sukhadukkhaṃ hoti, somanassadomanassaṃ hoti, iṭṭhāniṭṭhaṃ hoti, anunayapaṭighaṃ hoti, ugghātinigghāti hoti, anurodhavirodho hoti. Atha vā taṃ kammaṃ nirayasaṃvattanikaṃ, tiracchānayonisaṃvattanikaṃ, pettivisayasaṃvattanikanti brūmi ācikkhāmi desemi paññapemi paṭṭhapemi vivarāmi vibhajāmi uttānīkaromi pakāsemīti – duve vivādassa phalāni brūmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etampi disvā na vivādayethā"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etampi disvā"
      },
      "ti etaṃ ādīnavaṃ disvā passitvā tulayitvā tīrayitvā vibhāvayitvā vibhūtaṃ katvā diṭṭhikalahesu diṭṭhibhaṇḍanesu diṭṭhiviggahesu diṭṭhivivādesu diṭṭhimedhagesūti – etampi disvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na vivādayethā"
      },
      "ti na kalahaṃ ",
      " kareyya, na bhaṇḍanaṃ kareyya, na viggahaṃ kareyya, na vivādaṃ kareyya, na medhagaṃ kareyya, kalahaṃ bhaṇḍanaṃ viggahaṃ vivādaṃ medhagaṃ pajaheyya vinodeyya byantiṃ kareyya anabhāvaṃ gameyya, kalahā bhaṇḍanā viggahā ",
      " vivādā medhagā ārato assa virato paṭivirato nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā vihareyyāti – etampi disvā na vivādayetha."
    ],
    "innerText": "Etampi disvā na vivādayethāti. Etampi disvāti etaṃ ādīnavaṃ disvā passitvā tulayitvā tīrayitvā vibhāvayitvā vibhūtaṃ katvā diṭṭhikalahesu diṭṭhibhaṇḍanesu diṭṭhiviggahesu diṭṭhivivādesu diṭṭhimedhagesūti – etampi disvā. Na vivādayethāti na kalahaṃ kareyya, na bhaṇḍanaṃ kareyya, na viggahaṃ kareyya, na vivādaṃ kareyya, na medhagaṃ kareyya, kalahaṃ bhaṇḍanaṃ viggahaṃ vivādaṃ medhagaṃ pajaheyya vinodeyya byantiṃ kareyya anabhāvaṃ gameyya, kalahā bhaṇḍanā viggahā vivādā medhagā ārato assa virato paṭivirato nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā vihareyyāti – etampi disvā na vivādayetha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khemābhipassaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avivādabhūmi"
      },
      "nti. Avivādabhūmiṃ vuccati amataṃ nibbānaṃ. Yo so sabbasaṅkhārasamatho sabbūpadhipaṭinissaggo taṇhakkhayo virāgo nirodho nibbānaṃ. Etaṃ avivādabhūmiṃ khemato tāṇato leṇato saraṇato abhayato accutato amatato nibbānato passanto dakkhanto olokento nijjhāyanto upaparikkhantoti – khemābhipassaṃ avivādabhūmiṃ."
    ],
    "innerText": "Khemābhipassaṃavivādabhūminti. Avivādabhūmiṃ vuccati amataṃ nibbānaṃ. Yo so sabbasaṅkhārasamatho sabbūpadhipaṭinissaggo taṇhakkhayo virāgo nirodho nibbānaṃ. Etaṃ avivādabhūmiṃ khemato tāṇato leṇato saraṇato abhayato accutato amatato nibbānato passanto dakkhanto olokento nijjhāyanto upaparikkhantoti – khemābhipassaṃ avivādabhūmiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Appañhi ",
      " etaṃ na alaṃ samāya, duve vivādassa phalāni brūmi;"
    ],
    "innerText": "‘‘Appañhi etaṃ na alaṃ samāya, duve vivādassa phalāni brūmi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Etampi disvā na vivādayetha, khemābhipassaṃ avivādabhūmi’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "132"
      },
      "."
    ],
    "innerText": "132."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Yā kācimā sammutiyo puthujjā, sabbāva etā na upeti vidvā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Anūpayo so upayaṃ kimeyya, diṭṭhe sute khantimakubbamāno."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kācimā sammutiyo puthujjā"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yā kācī"
      },
      "ti sabbena sabbaṃ sabbathā sabbaṃ asesaṃ nissesaṃ pariyādiyanavacanametaṃ – yā kācīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammutiyo"
      },
      "ti. Sammutiyo vuccanti dvāsaṭṭhi diṭṭhigatāni diṭṭhisammutiyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puthujjā"
      },
      "ti puthujjanehi janitā sammutiyoti puthujjā, puthu nānājanehi janitā vā sammutiyoti puthujjāti – yā kācimā sammutiyo puthujjā."
    ],
    "innerText": "Yākācimā sammutiyo puthujjāti. Yā kācīti sabbena sabbaṃ sabbathā sabbaṃ asesaṃ nissesaṃ pariyādiyanavacanametaṃ – yā kācīti. Sammutiyoti. Sammutiyo vuccanti dvāsaṭṭhi diṭṭhigatāni diṭṭhisammutiyo. Puthujjāti puthujjanehi janitā sammutiyoti puthujjā, puthu nānājanehi janitā vā sammutiyoti puthujjāti – yā kācimā sammutiyo puthujjā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbāva etā na upeti vidvā"
      },
      "ti. Vidvā vijjāgato ñāṇī vibhāvī medhāvī. Sabbāva etā diṭṭhisammutiyo neti na upeti na upagacchati na gaṇhāti na parāmasati nābhinivisatīti – sabbāva etā na upeti vidvā."
    ],
    "innerText": "Sabbāva etā na upeti vidvāti. Vidvā vijjāgato ñāṇī vibhāvī medhāvī. Sabbāva etā diṭṭhisammutiyo neti na upeti na upagacchati na gaṇhāti na parāmasati nābhinivisatīti – sabbāva etā na upeti vidvā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anūpayo so upayaṃ kimeyyā"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upayo"
      },
      "ti dve upayā – taṇhūpayo ca diṭṭhūpayo ca…pe… ayaṃ taṇhūpayo…pe… ayaṃ diṭṭhūpayo. Tassa taṇhūpayo pahīno, diṭṭhūpayo paṭinissaṭṭho; taṇhūpayassa pahīnattā, diṭṭhūpayassa paṭinissaṭṭhattā anūpayo puggalo kiṃ rūpaṃ upeyya upagaccheyya gaṇheyya parāmaseyya abhiniviseyya ",
      " attā meti. Kiṃ vedanaṃ… kiṃ saññaṃ… kiṃ saṅkhāre… kiṃ viññāṇaṃ… kiṃ gatiṃ… kiṃ upapattiṃ… kiṃ paṭisandhiṃ… kiṃ bhavaṃ ",
      "… kiṃ saṃsāraṃ… kiṃ vaṭṭaṃ upeyya upagaccheyya gaṇheyya parāmaseyya abhiniveseyyāti – anūpayo so upayaṃ kimeyya."
    ],
    "innerText": "Anūpayo so upayaṃ kimeyyāti. Upayoti dve upayā – taṇhūpayo ca diṭṭhūpayo ca…pe… ayaṃ taṇhūpayo…pe… ayaṃ diṭṭhūpayo. Tassa taṇhūpayo pahīno, diṭṭhūpayo paṭinissaṭṭho; taṇhūpayassa pahīnattā, diṭṭhūpayassa paṭinissaṭṭhattā anūpayo puggalo kiṃ rūpaṃ upeyya upagaccheyya gaṇheyya parāmaseyya abhiniviseyya attā meti. Kiṃ vedanaṃ… kiṃ saññaṃ… kiṃ saṅkhāre… kiṃ viññāṇaṃ… kiṃ gatiṃ… kiṃ upapattiṃ… kiṃ paṭisandhiṃ… kiṃ bhavaṃ … kiṃ saṃsāraṃ… kiṃ vaṭṭaṃ upeyya upagaccheyya gaṇheyya parāmaseyya abhiniveseyyāti – anūpayo so upayaṃ kimeyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Diṭṭhe sute khantimakubbamāno"
      },
      "ti. Diṭṭhe vā diṭṭhasuddhiyā vā sute vā sutasuddhiyā vā mute vā mutasuddhiyā vā khantiṃ ",
      " akubbamāno chandaṃ akubbamāno pemaṃ akubbamāno rāgaṃ akubbamāno ajanayamāno asañjanayamāno anibbattayamāno anabhinibbattayamānoti – diṭṭhe sute khantimakubbamāno."
    ],
    "innerText": "Diṭṭhe sute khantimakubbamānoti. Diṭṭhe vā diṭṭhasuddhiyā vā sute vā sutasuddhiyā vā mute vā mutasuddhiyā vā khantiṃ akubbamāno chandaṃ akubbamāno pemaṃ akubbamāno rāgaṃ akubbamāno ajanayamāno asañjanayamāno anibbattayamāno anabhinibbattayamānoti – diṭṭhe sute khantimakubbamāno."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Yā ",
      " kācimā sammutiyo puthujjā, sabbāva etā na upeti vidvā;"
    ],
    "innerText": "‘‘Yā kācimā sammutiyo puthujjā, sabbāva etā na upeti vidvā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Anūpayo so upayaṃ kimeyya, diṭṭhe sute khantimakubbamāno’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "133"
      },
      "."
    ],
    "innerText": "133."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sīluttamā saññamenāhu suddhiṃ, vataṃ samādāya upaṭṭhitāse;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Idheva sikkhema athassa suddhiṃ, bhavūpanītā kusalāvadānā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sīluttamā saññamenāhu suddhi"
      },
      "nti. Santeke samaṇabrāhmaṇā sīluttamavādā; te sīlamattena saññamamattena saṃvaramattena avītikkamamattena suddhiṃ visuddhiṃ parivisuddhiṃ, muttiṃ vimuttiṃ parivimuttiṃ āhu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[āhaṃsu (sī. ka.)]"
      },
      " vadanti kathenti bhaṇanti dīpayanti voharanti."
    ],
    "innerText": "Sīluttamā saññamenāhu suddhinti. Santeke samaṇabrāhmaṇā sīluttamavādā; te sīlamattena saññamamattena saṃvaramattena avītikkamamattena suddhiṃ visuddhiṃ parivisuddhiṃ, muttiṃ vimuttiṃ parivimuttiṃ āhu [āhaṃsu (sī. ka.)] vadanti kathenti bhaṇanti dīpayanti voharanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Samaṇamuṇḍikāputto evamāha – ‘‘catūhi kho ahaṃ, gahapati, dhammehi samannāgataṃ purisapuggalaṃ paññapemi sampannakusalaṃ paramakusalaṃ uttamapattipattaṃ ",
      " samaṇaṃ ayojjhaṃ. Katamehi catūhi? Idha, gahapati, na kāyena pāpakammaṃ karoti, na pāpikaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pāpakaṃ (sī.)]"
      },
      " vācaṃ bhāsati, na pāpakaṃ saṅkappaṃ saṅkappeti, na pāpakaṃ ājīvaṃ ājīvati. Imehi kho ahaṃ, gahapati ",
      ", catūhi dhammehi samannāgataṃ purisapuggalaṃ paññapemi sampannakusalaṃ paramakusalaṃ uttamapattipattaṃ samaṇaṃ ayojjhaṃ; evameva santeke samaṇabrāhmaṇā sīluttamavādā; te sīlamattena saññamamattena saṃvaramattena avītikkamamattena suddhiṃ visuddhiṃ parisuddhiṃ, muttiṃ vimuttiṃ parimuttiṃ āhu vadanti kathenti bhaṇanti dīpayanti voharantī’’ti – sīluttamā saññamenāhu suddhiṃ."
    ],
    "innerText": "Samaṇamuṇḍikāputto evamāha – ‘‘catūhi kho ahaṃ, gahapati, dhammehi samannāgataṃ purisapuggalaṃ paññapemi sampannakusalaṃ paramakusalaṃ uttamapattipattaṃ samaṇaṃ ayojjhaṃ. Katamehi catūhi? Idha, gahapati, na kāyena pāpakammaṃ karoti, na pāpikaṃ [pāpakaṃ (sī.)] vācaṃ bhāsati, na pāpakaṃ saṅkappaṃ saṅkappeti, na pāpakaṃ ājīvaṃ ājīvati. Imehi kho ahaṃ, gahapati , catūhi dhammehi samannāgataṃ purisapuggalaṃ paññapemi sampannakusalaṃ paramakusalaṃ uttamapattipattaṃ samaṇaṃ ayojjhaṃ; evameva santeke samaṇabrāhmaṇā sīluttamavādā; te sīlamattena saññamamattena saṃvaramattena avītikkamamattena suddhiṃ visuddhiṃ parisuddhiṃ, muttiṃ vimuttiṃ parimuttiṃ āhu vadanti kathenti bhaṇanti dīpayanti voharantī’’ti – sīluttamā saññamenāhu suddhiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vataṃ samādāya upaṭṭhitāse"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vata"
      },
      "nti hatthivataṃ vā assavataṃ vā govataṃ vā kukkuravataṃ vā kākavataṃ vā vāsudevavataṃ vā baladevavataṃ vā puṇṇabhaddavataṃ vā maṇibhaddavataṃ vā aggivataṃ ",
      " vā nāgavataṃ vā supaṇṇavataṃ vā yakkhavataṃ vā asuravataṃ vā gandhabbavataṃ vā mahārājavataṃ vā candavataṃ vā sūriyavataṃ vā indavataṃ vā brahmavataṃ vā devavataṃ vā disāvataṃ vā ādāya samādāya ādiyitvā samādiyitvā gaṇhitvā parāmasitvā abhinivisitvā ",
      " upaṭṭhitā paccupaṭṭhitā allīnā upagatā ajjhositā adhimuttāti – vataṃ samādāya upaṭṭhitāse."
    ],
    "innerText": "Vataṃ samādāya upaṭṭhitāseti. Vatanti hatthivataṃ vā assavataṃ vā govataṃ vā kukkuravataṃ vā kākavataṃ vā vāsudevavataṃ vā baladevavataṃ vā puṇṇabhaddavataṃ vā maṇibhaddavataṃ vā aggivataṃ vā nāgavataṃ vā supaṇṇavataṃ vā yakkhavataṃ vā asuravataṃ vā gandhabbavataṃ vā mahārājavataṃ vā candavataṃ vā sūriyavataṃ vā indavataṃ vā brahmavataṃ vā devavataṃ vā disāvataṃ vā ādāya samādāya ādiyitvā samādiyitvā gaṇhitvā parāmasitvā abhinivisitvā upaṭṭhitā paccupaṭṭhitā allīnā upagatā ajjhositā adhimuttāti – vataṃ samādāya upaṭṭhitāse."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idheva sikkhema athassa suddhi"
      },
      "nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idhā"
      },
      "ti sakāya diṭṭhiyā sakāya khantiyā sakāya ruciyā sakāya laddhiyā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sikkhemā"
      },
      "ti sikkhema ācarema samācarema samādāya vattemāti – idheva sikkhema. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Athassa suddhi"
      },
      "nti athassa suddhiṃ visuddhiṃ parisuddhiṃ, muttiṃ vimuttiṃ parimuttinti – idheva sikkhema athassa suddhiṃ."
    ],
    "innerText": "Idheva sikkhema athassa suddhinti. Idhāti sakāya diṭṭhiyā sakāya khantiyā sakāya ruciyā sakāya laddhiyā. Sikkhemāti sikkhema ācarema samācarema samādāya vattemāti – idheva sikkhema. Athassa suddhinti athassa suddhiṃ visuddhiṃ parisuddhiṃ, muttiṃ vimuttiṃ parimuttinti – idheva sikkhema athassa suddhiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhavūpanītā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kusalāvadānā"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhavūpanītā"
      },
      "ti bhavūpanītā bhavūpagatā bhavajjhositā bhavādhimuttāti – bhavūpanītā ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kusalāvadānā"
      },
      "ti kusalavādā paṇḍitavādā thiravādā ñāyavādā hetuvādā lakkhaṇavādā kāraṇavādā ṭhānavādā sakāya laddhiyāti – bhavūpanītā kusalāvadānā."
    ],
    "innerText": "Bhavūpanītākusalāvadānāti. Bhavūpanītāti bhavūpanītā bhavūpagatā bhavajjhositā bhavādhimuttāti – bhavūpanītā . Kusalāvadānāti kusalavādā paṇḍitavādā thiravādā ñāyavādā hetuvādā lakkhaṇavādā kāraṇavādā ṭhānavādā sakāya laddhiyāti – bhavūpanītā kusalāvadānā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sīluttamā saññamenāhu suddhiṃ, vataṃ samādāya upaṭṭhitāse;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Idheva sikkhema athassa suddhiṃ, bhavūpanītā kusalāvadānā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "134"
      },
      "."
    ],
    "innerText": "134."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sace cuto sīlavatato hoti, pavedhatī"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sa vedhatī (sī syā.)]"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kammavirādhayitvā;"
      }
    ],
    "innerText": "Sace cuto sīlavatato hoti, pavedhatī[sa vedhatī (sī syā.)]kammavirādhayitvā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pajappatī"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sa jappatī (sī. syā.)]"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "patthayatī ca suddhiṃ, satthāva hīno pavasaṃ gharamhā."
      }
    ],
    "innerText": "Pajappatī[sa jappatī (sī. syā.)]patthayatī ca suddhiṃ, satthāva hīno pavasaṃ gharamhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sace cuto sīlavatato hotī"
      },
      "ti. Dvīhi kāraṇehi sīlavatato cavati – paravicchindanāya vā cavati, anabhisambhuṇanto vā cavati. Kathaṃ paravicchindanāya cavati? Paro vicchindati so satthā na sabbaññū, dhammo na svākkhāto, gaṇo na suppaṭipanno, diṭṭhi na bhaddikā, paṭipadā na supaññattā, maggo na niyyāniko, natthettha suddhi vā visuddhi vā parisuddhi vā, mutti vā vimutti vā parimutti ",
      " vā, natthettha sujjhanti vā visujjhanti vā parisujjhanti vā, muccanti vā vimuccanti vā, parimuccanti vā, hīnā nihīnā omakā lāmakā chatukkā parittāti. Evaṃ paro vicchindati. Evaṃ vicchindiyamāno satthārā cavati, dhammakkhānā ",
      " cavati, gaṇā cavati, diṭṭhiyā cavati, paṭipadāya cavati, maggato cavati. Evaṃ parivicchindanāya ",
      " cavati. Kathaṃ ",
      " anabhisambhuṇanto cavati? Sīlaṃ anabhisambhuṇanto sīlato cavati, vataṃ anabhisambhuṇanto vatato cavati, sīlabbataṃ anabhisambhuṇanto sīlabbatato cavati. Evaṃ anabhisambhuṇanto cavatīti – sace cuto sīlavatato hoti."
    ],
    "innerText": "Sace cuto sīlavatato hotīti. Dvīhi kāraṇehi sīlavatato cavati – paravicchindanāya vā cavati, anabhisambhuṇanto vā cavati. Kathaṃ paravicchindanāya cavati? Paro vicchindati so satthā na sabbaññū, dhammo na svākkhāto, gaṇo na suppaṭipanno, diṭṭhi na bhaddikā, paṭipadā na supaññattā, maggo na niyyāniko, natthettha suddhi vā visuddhi vā parisuddhi vā, mutti vā vimutti vā parimutti vā, natthettha sujjhanti vā visujjhanti vā parisujjhanti vā, muccanti vā vimuccanti vā, parimuccanti vā, hīnā nihīnā omakā lāmakā chatukkā parittāti. Evaṃ paro vicchindati. Evaṃ vicchindiyamāno satthārā cavati, dhammakkhānā cavati, gaṇā cavati, diṭṭhiyā cavati, paṭipadāya cavati, maggato cavati. Evaṃ parivicchindanāya cavati. Kathaṃ anabhisambhuṇanto cavati? Sīlaṃ anabhisambhuṇanto sīlato cavati, vataṃ anabhisambhuṇanto vatato cavati, sīlabbataṃ anabhisambhuṇanto sīlabbatato cavati. Evaṃ anabhisambhuṇanto cavatīti – sace cuto sīlavatato hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pavedhati kammavirādhayitvā"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pavedhatī"
      },
      "ti sīlaṃ vā vataṃ vā sīlabbataṃ vā ‘‘viraddhaṃ mayā, aparaddhaṃ mayā, khalitaṃ mayā, galitaṃ mayā, aññāya aparaddho aha’’nti vedhati pavedhati sampavedhatīti – pavedhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammavirādhayitvā"
      },
      "ti puññābhisaṅkhāraṃ vā apuññābhisaṅkhāraṃ vā āneñjābhisaṅkhāraṃ vā ‘‘viraddhaṃ mayā, aparaddhaṃ mayā, khalitaṃ mayā, galitaṃ mayā, aññāya aparaddho aha’’nti vedhati pavedhati sampavedhatīti – pavedhati kammavirādhayitvā."
    ],
    "innerText": "Pavedhati kammavirādhayitvāti. Pavedhatīti sīlaṃ vā vataṃ vā sīlabbataṃ vā ‘‘viraddhaṃ mayā, aparaddhaṃ mayā, khalitaṃ mayā, galitaṃ mayā, aññāya aparaddho aha’’nti vedhati pavedhati sampavedhatīti – pavedhati. Kammavirādhayitvāti puññābhisaṅkhāraṃ vā apuññābhisaṅkhāraṃ vā āneñjābhisaṅkhāraṃ vā ‘‘viraddhaṃ mayā, aparaddhaṃ mayā, khalitaṃ mayā, galitaṃ mayā, aññāya aparaddho aha’’nti vedhati pavedhati sampavedhatīti – pavedhati kammavirādhayitvā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pajappatī patthayatī ca suddhi"
      },
      "nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pajappatī"
      },
      "ti sīlaṃ vā jappati, vataṃ vā jappati, sīlabbataṃ vā jappati pajappati abhijappatīti – pajappati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Patthayatī ca suddhi"
      },
      "nti sīlasuddhiṃ vā pattheti, vatasuddhiṃ vā pattheti, sīlabbatasuddhiṃ vā pattheti piheti abhijappatīti ",
      " – pajappatī patthayatī ca suddhiṃ."
    ],
    "innerText": "Pajappatī patthayatī ca suddhinti. Pajappatīti sīlaṃ vā jappati, vataṃ vā jappati, sīlabbataṃ vā jappati pajappati abhijappatīti – pajappati. Patthayatī ca suddhinti sīlasuddhiṃ vā pattheti, vatasuddhiṃ vā pattheti, sīlabbatasuddhiṃ vā pattheti piheti abhijappatīti – pajappatī patthayatī ca suddhiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Satthāva hīno pavasaṃ gharamhā"
      },
      "ti. Yathā puriso gharato nikkhanto satthena pavasaṃ vasanto satthā ohīno, taṃ vā satthaṃ anubandhati sakaṃ vā gharaṃ paccāgacchati; evameva so diṭṭhigatiko taṃ vā satthāraṃ gaṇhāti aññaṃ vā satthāraṃ gaṇhāti, taṃ vā dhammakkhānaṃ gaṇhāti aññaṃ vā dhammakkhānaṃ gaṇhāti, taṃ vā gaṇaṃ gaṇhāti aññaṃ vā gaṇaṃ gaṇhāti, taṃ vā diṭṭhiṃ gaṇhāti aññaṃ vā diṭṭhiṃ gaṇhāti, taṃ vā paṭipadaṃ gaṇhāti aññaṃ vā paṭipadaṃ gaṇhāti, taṃ vā maggaṃ gaṇhāti aññaṃ vā maggaṃ gaṇhāti parāmasati abhinivisatīti ",
      " – satthāva hīno pavasaṃ gharamhā."
    ],
    "innerText": "Satthāva hīno pavasaṃ gharamhāti. Yathā puriso gharato nikkhanto satthena pavasaṃ vasanto satthā ohīno, taṃ vā satthaṃ anubandhati sakaṃ vā gharaṃ paccāgacchati; evameva so diṭṭhigatiko taṃ vā satthāraṃ gaṇhāti aññaṃ vā satthāraṃ gaṇhāti, taṃ vā dhammakkhānaṃ gaṇhāti aññaṃ vā dhammakkhānaṃ gaṇhāti, taṃ vā gaṇaṃ gaṇhāti aññaṃ vā gaṇaṃ gaṇhāti, taṃ vā diṭṭhiṃ gaṇhāti aññaṃ vā diṭṭhiṃ gaṇhāti, taṃ vā paṭipadaṃ gaṇhāti aññaṃ vā paṭipadaṃ gaṇhāti, taṃ vā maggaṃ gaṇhāti aññaṃ vā maggaṃ gaṇhāti parāmasati abhinivisatīti – satthāva hīno pavasaṃ gharamhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sace cuto sīlavatato hoti, pavedhatī kammavirādhayitvā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pajappatī patthayatī ca suddhiṃ, satthāva hīno pavasaṃ gharamhā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "135"
      },
      "."
    ],
    "innerText": "135."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sīlabbataṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vāpi pahāya sabbaṃ, kammañca sāvajjanavajjametaṃ;"
      }
    ],
    "innerText": "Sīlabbataṃvāpi pahāya sabbaṃ, kammañca sāvajjanavajjametaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Suddhiṃ asuddhinti apatthayāno, virato care santimanuggahāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sīlabbataṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vāpi pahāya sabba"
      },
      "nti. Sabbā sīlasuddhiyo pahāya ",
      " pajahitvā vinodetvā byantiṃ karitvā anabhāvaṃ gametvā, sabbā vatasuddhiyo pahāya pajahitvā vinodetvā byantiṃ karitvā anabhāvaṃ gametvā, sabbā sīlabbatasuddhiyo pahāya pajahitvā vinodetvā byantiṃ karitvā anabhāvaṃ gametvāti – sīlabbataṃ vāpi pahāya sabbaṃ."
    ],
    "innerText": "Sīlabbataṃvāpi pahāya sabbanti. Sabbā sīlasuddhiyo pahāya pajahitvā vinodetvā byantiṃ karitvā anabhāvaṃ gametvā, sabbā vatasuddhiyo pahāya pajahitvā vinodetvā byantiṃ karitvā anabhāvaṃ gametvā, sabbā sīlabbatasuddhiyo pahāya pajahitvā vinodetvā byantiṃ karitvā anabhāvaṃ gametvāti – sīlabbataṃ vāpi pahāya sabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammañca sāvajjanavajjameta"
      },
      "nti. Sāvajjakammaṃ vuccati – kaṇhaṃ kaṇhavipākaṃ. Anavajjakammaṃ vuccati – sukkaṃ sukkavipākaṃ. Sāvajjañca kammaṃ anavajjañca kammaṃ pahāya pajahitvā vinodetvā byantiṃ karitvā anabhāvaṃ gametvāti – kammañca sāvajjanavajjametaṃ."
    ],
    "innerText": "Kammañca sāvajjanavajjametanti. Sāvajjakammaṃ vuccati – kaṇhaṃ kaṇhavipākaṃ. Anavajjakammaṃ vuccati – sukkaṃ sukkavipākaṃ. Sāvajjañca kammaṃ anavajjañca kammaṃ pahāya pajahitvā vinodetvā byantiṃ karitvā anabhāvaṃ gametvāti – kammañca sāvajjanavajjametaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suddhiṃ asuddhinti apatthayāno"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asuddhi"
      },
      "nti asuddhiṃ patthenti, akusale dhamme patthenti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suddhi"
      },
      "nti suddhiṃ patthenti, pañca kāmaguṇe patthenti; asuddhiṃ patthenti, akusale dhamme patthenti, pañca kāmaguṇe patthenti; suddhiṃ patthenti, dvāsaṭṭhi diṭṭhigatāni patthenti, asuddhiṃ patthenti, akusale dhamme patthenti, pañca kāmaguṇe patthenti, dvāsaṭṭhi diṭṭhigatāni patthenti; suddhiṃ patthenti, tedhātuke kusale dhamme patthenti, asuddhiṃ patthenti, akusale dhamme patthenti, pañca kāmaguṇe patthenti, dvāsaṭṭhi diṭṭhigatāni patthenti, tedhātuke kusale ",
      " dhamme patthenti; suddhiṃ patthenti, puthujjanakalyāṇakā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kalyāṇaputhujjanā (syā.) evamīdisesu ṭhānesu]"
      },
      " niyāmāvakkantiṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[niyāmāvattantiṃ (ka.)]"
      },
      " patthenti. Sekkhā aggadhammaṃ ",
      " arahattaṃ patthenti. Arahatte patte arahā neva akusale dhamme pattheti, napi pañca kāmaguṇe pattheti, napi dvāsaṭṭhi diṭṭhigatāni pattheti, napi tedhātuke kusale dhamme pattheti, napi niyāmāvakkantiṃ pattheti, napi aggadhammaṃ arahattaṃ pattheti. Patthanā samatikkanto arahā vuddhipārihānivītivatto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vuddhipārihāniṃ vītivatto (sī.)]"
      },
      ". So vuṭṭhavāso ciṇṇacaraṇo…pe… jātijarāmaraṇasaṃsāro natthi tassa punabbhavoti – suddhiṃ asuddhinti apatthayāno."
    ],
    "innerText": "Suddhiṃ asuddhinti apatthayānoti. Asuddhinti asuddhiṃ patthenti, akusale dhamme patthenti. Suddhinti suddhiṃ patthenti, pañca kāmaguṇe patthenti; asuddhiṃ patthenti, akusale dhamme patthenti, pañca kāmaguṇe patthenti; suddhiṃ patthenti, dvāsaṭṭhi diṭṭhigatāni patthenti, asuddhiṃ patthenti, akusale dhamme patthenti, pañca kāmaguṇe patthenti, dvāsaṭṭhi diṭṭhigatāni patthenti; suddhiṃ patthenti, tedhātuke kusale dhamme patthenti, asuddhiṃ patthenti, akusale dhamme patthenti, pañca kāmaguṇe patthenti, dvāsaṭṭhi diṭṭhigatāni patthenti, tedhātuke kusale dhamme patthenti; suddhiṃ patthenti, puthujjanakalyāṇakā [kalyāṇaputhujjanā (syā.) evamīdisesu ṭhānesu] niyāmāvakkantiṃ [niyāmāvattantiṃ (ka.)] patthenti. Sekkhā aggadhammaṃ arahattaṃ patthenti. Arahatte patte arahā neva akusale dhamme pattheti, napi pañca kāmaguṇe pattheti, napi dvāsaṭṭhi diṭṭhigatāni pattheti, napi tedhātuke kusale dhamme pattheti, napi niyāmāvakkantiṃ pattheti, napi aggadhammaṃ arahattaṃ pattheti. Patthanā samatikkanto arahā vuddhipārihānivītivatto [vuddhipārihāniṃ vītivatto (sī.)]. So vuṭṭhavāso ciṇṇacaraṇo…pe… jātijarāmaraṇasaṃsāro natthi tassa punabbhavoti – suddhiṃ asuddhinti apatthayāno."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Virato"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "care santimanuggahāyā"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Virato"
      },
      "ti suddhiasuddhiyā ārato assa virato paṭivirato nikkhanto nissaṭo vippamutto visaññutto, vimariyādikatena cetasā viharatīti – virato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Care"
      },
      "ti careyya vicareyya vihareyya iriyeyya vatteyya pāleyya yapeyya yāpeyyāti – virato care. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Santimanuggahāyā"
      },
      "ti santiyo vuccanti dvāsaṭṭhi diṭṭhigatāni diṭṭhisantiyo agaṇhanto aparāmasanto anabhinivisantoti – virato care santimanuggahāya."
    ],
    "innerText": "Viratocare santimanuggahāyāti. Viratoti suddhiasuddhiyā ārato assa virato paṭivirato nikkhanto nissaṭo vippamutto visaññutto, vimariyādikatena cetasā viharatīti – virato. Careti careyya vicareyya vihareyya iriyeyya vatteyya pāleyya yapeyya yāpeyyāti – virato care. Santimanuggahāyāti santiyo vuccanti dvāsaṭṭhi diṭṭhigatāni diṭṭhisantiyo agaṇhanto aparāmasanto anabhinivisantoti – virato care santimanuggahāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tenāha ",
      " bhagavā –"
    ],
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sīlabbataṃ vāpi pahāya sabbaṃ, kammañca sāvajjanavajjametaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Suddhiṃ asuddhinti apatthayāno, virato care santimanuggahāyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "136"
      },
      "."
    ],
    "innerText": "136."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tamūpanissāya"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jigucchitaṃ vā, atha vāpi diṭṭhaṃ va sutaṃ mutaṃ vā;"
      }
    ],
    "innerText": "Tamūpanissāyajigucchitaṃ vā, atha vāpi diṭṭhaṃ va sutaṃ mutaṃ vā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Uddhaṃsarā suddhimanutthunanti, avītataṇhāse bhavābhavesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tamūpanissāya jigucchitaṃ vā"
      },
      "ti. Santeke samaṇabrāhmaṇā tapojigucchavādā tapojigucchasārā tapojigucchanissitā ānissitā allīnā upagatā ajjhositā adhimuttāti – tamūpanissāya jigucchitaṃ vā."
    ],
    "innerText": "Tamūpanissāya jigucchitaṃ vāti. Santeke samaṇabrāhmaṇā tapojigucchavādā tapojigucchasārā tapojigucchanissitā ānissitā allīnā upagatā ajjhositā adhimuttāti – tamūpanissāya jigucchitaṃ vā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atha vāpi diṭṭhaṃ va sutaṃ mutaṃ vā"
      },
      "ti. Diṭṭhaṃ vā diṭṭhasuddhiṃ vā sutaṃ vā sutasuddhiṃ vā mutaṃ vā mutasuddhiṃ vā nissāya upanissāya gaṇhitvā parāmasitvā abhinivisitvāti – atha vāpi diṭṭhaṃ va sutaṃ mutaṃ vā."
    ],
    "innerText": "Atha vāpi diṭṭhaṃ va sutaṃ mutaṃ vāti. Diṭṭhaṃ vā diṭṭhasuddhiṃ vā sutaṃ vā sutasuddhiṃ vā mutaṃ vā mutasuddhiṃ vā nissāya upanissāya gaṇhitvā parāmasitvā abhinivisitvāti – atha vāpi diṭṭhaṃ va sutaṃ mutaṃ vā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uddhaṃsarā suddhimanutthunantī"
      },
      "ti. Santeke samaṇabrāhmaṇā uddhaṃsarāvādā. Katame te samaṇabrāhmaṇā uddhaṃsarāvādā? Ye te samaṇabrāhmaṇā accantasuddhikā, saṃsārasuddhikā, akiriyadiṭṭhikā, sassatavādā – ime te samaṇabrāhmaṇā uddhaṃsarāvādā. Te saṃsāre suddhiṃ visuddhiṃ parisuddhiṃ, muttiṃ vimuttiṃ parimuttiṃ thunanti vadanti kathenti bhaṇanti dīpayanti voharantīti – uddhaṃsarā suddhimanutthunanti."
    ],
    "innerText": "Uddhaṃsarā suddhimanutthunantīti. Santeke samaṇabrāhmaṇā uddhaṃsarāvādā. Katame te samaṇabrāhmaṇā uddhaṃsarāvādā? Ye te samaṇabrāhmaṇā accantasuddhikā, saṃsārasuddhikā, akiriyadiṭṭhikā, sassatavādā – ime te samaṇabrāhmaṇā uddhaṃsarāvādā. Te saṃsāre suddhiṃ visuddhiṃ parisuddhiṃ, muttiṃ vimuttiṃ parimuttiṃ thunanti vadanti kathenti bhaṇanti dīpayanti voharantīti – uddhaṃsarā suddhimanutthunanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avītataṇhāse bhavābhavesū"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṇhā"
      },
      "ti rūpataṇhā saddataṇhā gandhataṇhā rasataṇhā phoṭṭhabbataṇhā dhammataṇhā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhavābhavesū"
      },
      "ti bhavābhave kammabhave punabbhave kāmabhave, kammabhave kāmabhave punabbhave rūpabhave ",
      ", kammabhave rūpabhave punabbhave arūpabhave, kammabhave arūpabhave punabbhave punappunabbhave punappunagatiyā punappunaupapattiyā punappunapaṭisandhiyā punappunaattabhāvābhinibbattiyā ",
      " avītataṇhā avigatataṇhā acattataṇhā avantataṇhā amuttataṇhā appahīnataṇhā appaṭinissaṭṭhataṇhāti – avītataṇhāse bhavābhavesu."
    ],
    "innerText": "Avītataṇhāse bhavābhavesūti. Taṇhāti rūpataṇhā saddataṇhā gandhataṇhā rasataṇhā phoṭṭhabbataṇhā dhammataṇhā. Bhavābhavesūti bhavābhave kammabhave punabbhave kāmabhave, kammabhave kāmabhave punabbhave rūpabhave , kammabhave rūpabhave punabbhave arūpabhave, kammabhave arūpabhave punabbhave punappunabbhave punappunagatiyā punappunaupapattiyā punappunapaṭisandhiyā punappunaattabhāvābhinibbattiyā avītataṇhā avigatataṇhā acattataṇhā avantataṇhā amuttataṇhā appahīnataṇhā appaṭinissaṭṭhataṇhāti – avītataṇhāse bhavābhavesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tenāha ",
      " bhagavā –"
    ],
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Tamūpanissāya ",
      " jigucchitaṃ vā, atha vāpi diṭṭhaṃ va sutaṃ mutaṃ vā;"
    ],
    "innerText": "‘‘Tamūpanissāya jigucchitaṃ vā, atha vāpi diṭṭhaṃ va sutaṃ mutaṃ vā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Uddhaṃsarā suddhimanutthunanti, avītataṇhāse bhavābhavesū’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "137"
      },
      "."
    ],
    "innerText": "137."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Patthayamānassa hi jappitāni, pavedhitaṃ vāpi pakappitesu;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Cutūpapāto idha yassa natthi, sa kena vedheyya kuhiṃ va jappe."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Patthayamānassa hi jappitānī"
      },
      "ti. Patthanā vuccati taṇhā. Yo rāgo sārāgo…pe… abhijjhā lobho akusalamūlaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Patthayamānassā"
      },
      "ti patthayamānassa icchamānassa sādiyamānassa pihayamānassa abhijappayamānassāti – patthayamānassa hi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jappitānī"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jappanā"
      },
      " vuccati taṇhā. Yo rāgo sārāgo…pe… abhijjhā lobho akusalamūlanti – patthayamānassa hi jappitāni."
    ],
    "innerText": "Patthayamānassa hi jappitānīti. Patthanā vuccati taṇhā. Yo rāgo sārāgo…pe… abhijjhā lobho akusalamūlaṃ. Patthayamānassāti patthayamānassa icchamānassa sādiyamānassa pihayamānassa abhijappayamānassāti – patthayamānassa hi. Jappitānīti. Jappanā vuccati taṇhā. Yo rāgo sārāgo…pe… abhijjhā lobho akusalamūlanti – patthayamānassa hi jappitāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pavedhitaṃ vāpi pakappitesū"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pakappanā"
      },
      "ti dve pakappanā – taṇhāpakappanā ca diṭṭhipakappanā ca…pe… ayaṃ taṇhāpakappanā…pe… ayaṃ diṭṭhipakappanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pavedhitaṃ vāpi pakappitesū"
      },
      "ti. Pakappitaṃ vatthuṃ acchedasaṅkinopi vedhenti, acchijjantepi ",
      " vedhenti, acchinnepi vedhenti; pakappitaṃ vatthuṃ vipariṇāmasaṅkinopi vedhenti, vipariṇamantepi vedhenti, vipariṇatepi vedhenti pavedhenti sampavedhentīti – pavedhitaṃ vāpi pakappitesu."
    ],
    "innerText": "Pavedhitaṃ vāpi pakappitesūti. Pakappanāti dve pakappanā – taṇhāpakappanā ca diṭṭhipakappanā ca…pe… ayaṃ taṇhāpakappanā…pe… ayaṃ diṭṭhipakappanā. Pavedhitaṃ vāpi pakappitesūti. Pakappitaṃ vatthuṃ acchedasaṅkinopi vedhenti, acchijjantepi vedhenti, acchinnepi vedhenti; pakappitaṃ vatthuṃ vipariṇāmasaṅkinopi vedhenti, vipariṇamantepi vedhenti, vipariṇatepi vedhenti pavedhenti sampavedhentīti – pavedhitaṃ vāpi pakappitesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cutūpapāto idha yassa natthī"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yassā"
      },
      "ti arahato khīṇāsavassa. Yassa gamanaṃ āgamanaṃ gamanāgamanaṃ kālaṃgati bhavābhavo cuti ca upapatti ca nibbatti ca bhedo ca jāti ca jarāmaraṇañca natthi na santi na saṃvijjanti nupalabbhanti, pahīnā samucchinnā vūpasantā paṭipassaddhā abhabbuppattikā ",
      " ñāṇagginā daḍḍhāti – cutūpapāto idha yassa natthi."
    ],
    "innerText": "Cutūpapāto idha yassa natthīti. Yassāti arahato khīṇāsavassa. Yassa gamanaṃ āgamanaṃ gamanāgamanaṃ kālaṃgati bhavābhavo cuti ca upapatti ca nibbatti ca bhedo ca jāti ca jarāmaraṇañca natthi na santi na saṃvijjanti nupalabbhanti, pahīnā samucchinnā vūpasantā paṭipassaddhā abhabbuppattikā ñāṇagginā daḍḍhāti – cutūpapāto idha yassa natthi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sa"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kena vedheyya kuhiṃ va jappe"
      },
      "ti. So kena rāgena vedheyya, kena dosena vedheyya, kena mohena vedheyya, kena mānena vedheyya, kāya diṭṭhiyā vedheyya, kena uddhaccena vedheyya, kāya vicikicchāya vedheyya, kehi anusayehi vedheyya – rattoti vā duṭṭhoti vā mūḷhoti vā vinibaddhoti vā parāmaṭṭhoti vā vikkhepagatoti vā aniṭṭhaṅgatoti vā thāmagatoti vā. Te abhisaṅkhārā pahīnā; abhisaṅkhārānaṃ pahīnattā gatiyā kena vedheyya – nerayikoti vā tiracchānayonikoti vā pettivisayikoti vā manussoti vā devoti vā rūpīti vā arūpīti ",
      " vā saññīti vā asaññīti vā nevasaññīnāsaññīti vā, so hetu natthi paccayo natthi kāraṇaṃ natthi yena vedheyya pavedheyya sampavedheyyāti ",
      " – sa kena vedheyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kuhiṃva jappe"
      },
      "ti kuhiṃ vā jappeyya kimhi jappeyya, kattha jappeyya pajappeyya abhijappeyyāti – sa kena vedheyya kuhiṃ va jappe."
    ],
    "innerText": "Sakena vedheyya kuhiṃ va jappeti. So kena rāgena vedheyya, kena dosena vedheyya, kena mohena vedheyya, kena mānena vedheyya, kāya diṭṭhiyā vedheyya, kena uddhaccena vedheyya, kāya vicikicchāya vedheyya, kehi anusayehi vedheyya – rattoti vā duṭṭhoti vā mūḷhoti vā vinibaddhoti vā parāmaṭṭhoti vā vikkhepagatoti vā aniṭṭhaṅgatoti vā thāmagatoti vā. Te abhisaṅkhārā pahīnā; abhisaṅkhārānaṃ pahīnattā gatiyā kena vedheyya – nerayikoti vā tiracchānayonikoti vā pettivisayikoti vā manussoti vā devoti vā rūpīti vā arūpīti vā saññīti vā asaññīti vā nevasaññīnāsaññīti vā, so hetu natthi paccayo natthi kāraṇaṃ natthi yena vedheyya pavedheyya sampavedheyyāti – sa kena vedheyya. Kuhiṃva jappeti kuhiṃ vā jappeyya kimhi jappeyya, kattha jappeyya pajappeyya abhijappeyyāti – sa kena vedheyya kuhiṃ va jappe."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Patthayamānassa hi jappitāni, pavedhitaṃ vāpi pakappitesu;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Cutūpapāto idha yassa natthi, sa kena vedheyya kuhiṃ va jappe’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "138"
      },
      "."
    ],
    "innerText": "138."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Yamāhu dhammaṃ paramanti eke, tameva hīnanti panāhu aññe;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sacco nu vādo katamo imesaṃ, sabbeva hīme kusalāvadānā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yamāhu dhammaṃ paramanti eke"
      },
      "ti. Yaṃ dhammaṃ diṭṭhiṃ paṭipadaṃ maggaṃ eke samaṇabrāhmaṇā ‘‘idaṃ paramaṃ aggaṃ seṭṭhaṃ visiṭṭhaṃ pāmokkhaṃ uttamaṃ pavara’’nti ",
      ", evamāhaṃsu evaṃ kathenti evaṃ bhaṇanti evaṃ dīpayanti evaṃ voharantīti – yamāhu dhammaṃ paramanti eke."
    ],
    "innerText": "Yamāhu dhammaṃ paramanti eketi. Yaṃ dhammaṃ diṭṭhiṃ paṭipadaṃ maggaṃ eke samaṇabrāhmaṇā ‘‘idaṃ paramaṃ aggaṃ seṭṭhaṃ visiṭṭhaṃ pāmokkhaṃ uttamaṃ pavara’’nti , evamāhaṃsu evaṃ kathenti evaṃ bhaṇanti evaṃ dīpayanti evaṃ voharantīti – yamāhu dhammaṃ paramanti eke."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tameva hīnanti panāhu aññe"
      },
      "ti tameva dhammaṃ diṭṭhiṃ paṭipadaṃ maggaṃ eke samaṇabrāhmaṇā ‘‘hīnaṃ etaṃ, nihīnaṃ etaṃ, omakaṃ etaṃ, lāmakaṃ etaṃ, chatukkaṃ etaṃ, parittakaṃ eta’’nti, evamāhaṃsu evaṃ kathenti evaṃ bhaṇanti evaṃ dīpayanti evaṃ voharantīti – tameva hīnanti panāhu aññe."
    ],
    "innerText": "Tameva hīnanti panāhu aññeti tameva dhammaṃ diṭṭhiṃ paṭipadaṃ maggaṃ eke samaṇabrāhmaṇā ‘‘hīnaṃ etaṃ, nihīnaṃ etaṃ, omakaṃ etaṃ, lāmakaṃ etaṃ, chatukkaṃ etaṃ, parittakaṃ eta’’nti, evamāhaṃsu evaṃ kathenti evaṃ bhaṇanti evaṃ dīpayanti evaṃ voharantīti – tameva hīnanti panāhu aññe."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sacco"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nu vādo katamo imesa"
      },
      "nti. Imesaṃ samaṇabrāhmaṇānaṃ vādo katamo sacco taccho tatho bhūto yāthāvo aviparītoti – sacco nu vādo katamo imesaṃ."
    ],
    "innerText": "Sacconu vādo katamo imesanti. Imesaṃ samaṇabrāhmaṇānaṃ vādo katamo sacco taccho tatho bhūto yāthāvo aviparītoti – sacco nu vādo katamo imesaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbeva hīme kusalāvadānā"
      },
      "ti. Sabbevime samaṇabrāhmaṇā kusalavādā paṇḍitavādā thiravādā ñāyavādā hetuvādā lakkhaṇavādā kāraṇavādā ṭhānavādā sakāya laddhiyāti – sabbeva hīme kusalāvadānā."
    ],
    "innerText": "Sabbeva hīme kusalāvadānāti. Sabbevime samaṇabrāhmaṇā kusalavādā paṇḍitavādā thiravādā ñāyavādā hetuvādā lakkhaṇavādā kāraṇavādā ṭhānavādā sakāya laddhiyāti – sabbeva hīme kusalāvadānā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tenāha ",
      " so nimmito –"
    ],
    "innerText": "Tenāha so nimmito –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yamāhu dhammaṃ paramanti eke, tameva hīnanti panāhu aññe;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sacco nu vādo katamo imesaṃ, sabbeva hīme kusalāvadānā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "139"
      },
      "."
    ],
    "innerText": "139."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sakañhi dhammaṃ paripuṇṇamāhu, aññassa dhammaṃ pana hīnamāhu;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Evampi viggayha vivādayanti, sakaṃ sakaṃ sammutimāhu saccaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sakañhi dhammaṃ paripuṇṇamāhū"
      },
      "ti sakaṃ dhammaṃ diṭṭhiṃ paṭipadaṃ maggaṃ eke samaṇabrāhmaṇā ‘‘idaṃ samattaṃ paripuṇṇaṃ anoma’’nti, evamāhaṃsu…pe… evaṃ voharantīti – sakañhi dhammaṃ paripuṇṇamāhu."
    ],
    "innerText": "Sakañhi dhammaṃ paripuṇṇamāhūti sakaṃ dhammaṃ diṭṭhiṃ paṭipadaṃ maggaṃ eke samaṇabrāhmaṇā ‘‘idaṃ samattaṃ paripuṇṇaṃ anoma’’nti, evamāhaṃsu…pe… evaṃ voharantīti – sakañhi dhammaṃ paripuṇṇamāhu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aññassa"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammaṃ pana hīnamāhū"
      },
      "ti. Aññassa dhammaṃ diṭṭhiṃ paṭipadaṃ ",
      " maggaṃ eke samaṇabrāhmaṇā ‘‘hīnaṃ etaṃ, nihīnaṃ etaṃ, omakaṃ etaṃ, lāmakaṃ etaṃ, chatukkaṃ etaṃ, parittakaṃ eta’’nti, evamāhaṃsu evaṃ kathenti evaṃ bhaṇanti evaṃ dīpayanti evaṃ voharantīti – aññassa dhammaṃ pana hīnamāhu."
    ],
    "innerText": "Aññassadhammaṃ pana hīnamāhūti. Aññassa dhammaṃ diṭṭhiṃ paṭipadaṃ maggaṃ eke samaṇabrāhmaṇā ‘‘hīnaṃ etaṃ, nihīnaṃ etaṃ, omakaṃ etaṃ, lāmakaṃ etaṃ, chatukkaṃ etaṃ, parittakaṃ eta’’nti, evamāhaṃsu evaṃ kathenti evaṃ bhaṇanti evaṃ dīpayanti evaṃ voharantīti – aññassa dhammaṃ pana hīnamāhu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evampi viggayha vivādayantī"
      },
      "ti evaṃ gahetvā uggahetvā gaṇhitvā parāmasitvā abhinivisitvā vivādayanti, kalahaṃ karonti, bhaṇḍanaṃ karonti, viggahaṃ karonti, vivādaṃ karonti, medhagaṃ karonti – ‘‘na tvaṃ imaṃ dhammavinayaṃ ājānāsi…pe… nibbeṭhehi vā sace pahosī’’ti – evampi viggayha vivādayanti."
    ],
    "innerText": "Evampi viggayha vivādayantīti evaṃ gahetvā uggahetvā gaṇhitvā parāmasitvā abhinivisitvā vivādayanti, kalahaṃ karonti, bhaṇḍanaṃ karonti, viggahaṃ karonti, vivādaṃ karonti, medhagaṃ karonti – ‘‘na tvaṃ imaṃ dhammavinayaṃ ājānāsi…pe… nibbeṭhehi vā sace pahosī’’ti – evampi viggayha vivādayanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sakaṃ sakaṃ sammutimāhu sacca"
      },
      "nti. ‘‘Sassato loko, idameva saccaṃ moghamañña’’nti – sakaṃ sakaṃ sammutimāhu saccaṃ. ‘‘Asassato loko ",
      " …pe… neva hoti na na hoti tathāgato paraṃ maraṇā, idameva saccaṃ moghamañña’’nti – sakaṃ sakaṃ sammutimāhu saccaṃ."
    ],
    "innerText": "Sakaṃ sakaṃ sammutimāhu saccanti. ‘‘Sassato loko, idameva saccaṃ moghamañña’’nti – sakaṃ sakaṃ sammutimāhu saccaṃ. ‘‘Asassato loko …pe… neva hoti na na hoti tathāgato paraṃ maraṇā, idameva saccaṃ moghamañña’’nti – sakaṃ sakaṃ sammutimāhu saccaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sakañhi dhammaṃ paripuṇṇamāhu, aññassa dhammaṃ pana hīnamāhu;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Evampi viggayha vivādayanti, sakaṃ sakaṃ sammutimāhu sacca’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "140"
      },
      "."
    ],
    "innerText": "140."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parassa"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ce vambhayitena hīno, na koci dhammesu visesi assa;"
      }
    ],
    "innerText": "Parassace vambhayitena hīno, na koci dhammesu visesi assa;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Puthū hi aññassa vadanti dhammaṃ, nihīnato samhi daḷhaṃ vadānā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parassa"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ce vambhayitena hīno"
      },
      "ti parassa ce vambhayitakāraṇā ninditakāraṇā garahitakāraṇā upavaditakāraṇā paro bālo hoti hīno nihīno omako lāmako chatukko parittoti – parassa ce vambhayitena hīno."
    ],
    "innerText": "Parassace vambhayitena hīnoti parassa ce vambhayitakāraṇā ninditakāraṇā garahitakāraṇā upavaditakāraṇā paro bālo hoti hīno nihīno omako lāmako chatukko parittoti – parassa ce vambhayitena hīno."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na koci dhammesu visesi assā"
      },
      "ti. Dhammesu na koci aggo seṭṭho visiṭṭho pāmokkho uttamo pavaro assāti – na koci dhammesu visesi assa."
    ],
    "innerText": "Na koci dhammesu visesi assāti. Dhammesu na koci aggo seṭṭho visiṭṭho pāmokkho uttamo pavaro assāti – na koci dhammesu visesi assa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puthū"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hi aññassa vadanti dhammaṃ, nihīnato"
      },
      "ti. Bahukāpi bahūnaṃ dhammaṃ vadanti upavadanti nindanti garahanti hīnato nihīnato omakato lāmakato chatukkato parittato, bahukāpi ekassa dhammaṃ vadanti upavadanti nindanti garahanti hīnato nihīnato omakato lāmakato chatukkato parittato, ekopi bahūnaṃ dhammaṃ vadati upavadati nindati garahati hīnato nihīnato omakato lāmakato chatukkato parittato, ekopi ekassa dhammaṃ vadati upavadati nindati garahati hīnato nihīnato omakato lāmakato chatukkato parittatoti – puthū hi aññassa vadanti dhammaṃ."
    ],
    "innerText": "Puthūhi aññassa vadanti dhammaṃ, nihīnatoti. Bahukāpi bahūnaṃ dhammaṃ vadanti upavadanti nindanti garahanti hīnato nihīnato omakato lāmakato chatukkato parittato, bahukāpi ekassa dhammaṃ vadanti upavadanti nindanti garahanti hīnato nihīnato omakato lāmakato chatukkato parittato, ekopi bahūnaṃ dhammaṃ vadati upavadati nindati garahati hīnato nihīnato omakato lāmakato chatukkato parittato, ekopi ekassa dhammaṃ vadati upavadati nindati garahati hīnato nihīnato omakato lāmakato chatukkato parittatoti – puthū hi aññassa vadanti dhammaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nihīnato samhi daḷhaṃ vadānā"
      },
      "ti. Dhammo sakāyanaṃ, diṭṭhi sakāyanaṃ, paṭipadā sakāyanaṃ, maggo sakāyanaṃ, sakāyane daḷhavādā thiravādā balikavādā ",
      " aṭṭhitavādāti – nihīnato samhi daḷhaṃ vadānā."
    ],
    "innerText": "Nihīnato samhi daḷhaṃ vadānāti. Dhammo sakāyanaṃ, diṭṭhi sakāyanaṃ, paṭipadā sakāyanaṃ, maggo sakāyanaṃ, sakāyane daḷhavādā thiravādā balikavādā aṭṭhitavādāti – nihīnato samhi daḷhaṃ vadānā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Parassa ",
      " ce vambhayitena hīno, na koci dhammesu visesi assa;"
    ],
    "innerText": "‘‘Parassa ce vambhayitena hīno, na koci dhammesu visesi assa;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Puthū hi aññassa vadanti dhammaṃ, nihīnato samhi daḷhaṃ vadānā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "141"
      },
      "."
    ],
    "innerText": "141."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddhammapūjāpi"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[saddhammapūjā ca (sī. syā.)]"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "panā tatheva, yathā pasaṃsanti sakāyanāni;"
      }
    ],
    "innerText": "Saddhammapūjāpi[saddhammapūjā ca (sī. syā.)]panā tatheva, yathā pasaṃsanti sakāyanāni;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbeva vādā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sabbe pavādā (syā.)]"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tathiyā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[tathi vā (bahūsu)]"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhaveyyuṃ, suddhī hi nesaṃ paccattameva."
      }
    ],
    "innerText": "Sabbeva vādā[sabbe pavādā (syā.)]tathiyā[tathi vā (bahūsu)]bhaveyyuṃ, suddhī hi nesaṃ paccattameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddhammapūjāpi panā tathevā"
      },
      "ti. Katamā saddhammapūjā? Sakaṃ satthāraṃ sakkaroti garuṃ karoti ",
      " māneti pūjeti ‘‘ayaṃ satthā sabbaññū’’ti – ayaṃ saddhammapūjā. Sakaṃ dhammakkhānaṃ sakaṃ gaṇaṃ sakaṃ diṭṭhiṃ sakaṃ paṭipadaṃ sakaṃ maggaṃ sakkaroti garuṃ karoti māneti pūjeti ‘‘ayaṃ maggo niyyāniko’’ti – ayaṃ saddhammapūjā ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddhammapūjāpi panā tathevā"
      },
      "ti saddhammapūjā tathā tacchā bhūtā yāthāvā aviparītāti – saddhammapūjāpi panā tatheva."
    ],
    "innerText": "Saddhammapūjāpi panā tathevāti. Katamā saddhammapūjā? Sakaṃ satthāraṃ sakkaroti garuṃ karoti māneti pūjeti ‘‘ayaṃ satthā sabbaññū’’ti – ayaṃ saddhammapūjā. Sakaṃ dhammakkhānaṃ sakaṃ gaṇaṃ sakaṃ diṭṭhiṃ sakaṃ paṭipadaṃ sakaṃ maggaṃ sakkaroti garuṃ karoti māneti pūjeti ‘‘ayaṃ maggo niyyāniko’’ti – ayaṃ saddhammapūjā . Saddhammapūjāpi panā tathevāti saddhammapūjā tathā tacchā bhūtā yāthāvā aviparītāti – saddhammapūjāpi panā tatheva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathā pasaṃsanti sakāyanānī"
      },
      "ti. Dhammo sakāyanaṃ diṭṭhi sakāyanaṃ paṭipadā sakāyanaṃ maggo sakāyanaṃ, sakāyanāni pasaṃsanti thomenti kittenti vaṇṇentīti – yathā pasaṃsanti sakāyanāni."
    ],
    "innerText": "Yathā pasaṃsanti sakāyanānīti. Dhammo sakāyanaṃ diṭṭhi sakāyanaṃ paṭipadā sakāyanaṃ maggo sakāyanaṃ, sakāyanāni pasaṃsanti thomenti kittenti vaṇṇentīti – yathā pasaṃsanti sakāyanāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbeva vādā tathiyā bhaveyyu"
      },
      "nti sabbeva vādā tathā tacchā bhūtā yāthāvā aviparītā bhaveyyunti – sabbeva vādā tathiyā bhaveyyuṃ."
    ],
    "innerText": "Sabbeva vādā tathiyā bhaveyyunti sabbeva vādā tathā tacchā bhūtā yāthāvā aviparītā bhaveyyunti – sabbeva vādā tathiyā bhaveyyuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suddhī"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hi nesaṃ paccattamevā"
      },
      "ti. Paccattameva tesaṃ samaṇabrāhmaṇānaṃ suddhi visuddhi parisuddhi, mutti vimutti parimuttīti – suddhī hi nesaṃ paccattameva."
    ],
    "innerText": "Suddhīhi nesaṃ paccattamevāti. Paccattameva tesaṃ samaṇabrāhmaṇānaṃ suddhi visuddhi parisuddhi, mutti vimutti parimuttīti – suddhī hi nesaṃ paccattameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Saddhammapūjāpi panā tatheva, yathā pasaṃsanti sakāyanāni;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sabbeva vādā tathiyā bhaveyyuṃ, suddhī hi nesaṃ paccattamevā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "142"
      },
      "."
    ],
    "innerText": "142."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "brāhmaṇassa paraneyyamatthi, dhammesu niccheyya samuggahītaṃ;"
      }
    ],
    "innerText": "Nabrāhmaṇassa paraneyyamatthi, dhammesu niccheyya samuggahītaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tasmā vivādāni upātivatto, na hi seṭṭhato passati dhammamaññaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na brāhmaṇassa paraneyyamatthī"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nā"
      },
      "ti paṭikkhepo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Brāhmaṇo"
      },
      "ti sattannaṃ dhammānaṃ bāhitattā brāhmaṇo…pe… asito tādi pavuccate sa brahmā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na brāhmaṇassa paraneyyamatthī"
      },
      "ti brāhmaṇassa paraneyyatā natthi, brāhmaṇo na paraneyyo, na parapattiyo, na parapaccayo, na parapaṭibaddhagū ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[parapaṭibandhagū (ka.)]"
      },
      " jānāti passati asammūḷho sampajāno paṭissato. ‘‘Sabbe saṅkhārā aniccā’’ti brāhmaṇassa paraneyyatā natthi, brāhmaṇo na paraneyyo, na parapattiyo, na parapaccayo, na parapaṭibaddhagū jānāti ",
      " passati asammūḷho sampajāno paṭissato. ‘‘Sabbe saṅkhārā dukkhā’’ti…pe… ‘‘yaṃ ",
      " kiñci samudayadhammaṃ sabbaṃ taṃ nirodhadhamma’’nti brāhmaṇassa paraneyyatā natthi, brāhmaṇo na paraneyyo ",
      ", na parapattiyo, na parapaccayo, na parapaṭibaddhagū jānāti passati asammūḷho sampajāno paṭissatoti – na brāhmaṇassa paraneyyamatthi."
    ],
    "innerText": "Na brāhmaṇassa paraneyyamatthīti. Nāti paṭikkhepo. Brāhmaṇoti sattannaṃ dhammānaṃ bāhitattā brāhmaṇo…pe… asito tādi pavuccate sa brahmā. Na brāhmaṇassa paraneyyamatthīti brāhmaṇassa paraneyyatā natthi, brāhmaṇo na paraneyyo, na parapattiyo, na parapaccayo, na parapaṭibaddhagū [parapaṭibandhagū (ka.)] jānāti passati asammūḷho sampajāno paṭissato. ‘‘Sabbe saṅkhārā aniccā’’ti brāhmaṇassa paraneyyatā natthi, brāhmaṇo na paraneyyo, na parapattiyo, na parapaccayo, na parapaṭibaddhagū jānāti passati asammūḷho sampajāno paṭissato. ‘‘Sabbe saṅkhārā dukkhā’’ti…pe… ‘‘yaṃ kiñci samudayadhammaṃ sabbaṃ taṃ nirodhadhamma’’nti brāhmaṇassa paraneyyatā natthi, brāhmaṇo na paraneyyo , na parapattiyo, na parapaccayo, na parapaṭibaddhagū jānāti passati asammūḷho sampajāno paṭissatoti – na brāhmaṇassa paraneyyamatthi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammesu niccheyya samuggahīta"
      },
      "nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammesū"
      },
      "ti dvāsaṭṭhiyā diṭṭhigatesu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Niccheyyā"
      },
      "ti nicchinitvā vinicchinitvā vicinitvā pavicinitvā tulayitvā tīrayitvā vibhāvayitvā vibhūtaṃ katvā. Odhiggāho bilaggāho varaggāho koṭṭhāsaggāho uccayaggāho samuccayaggāho ‘‘idaṃ saccaṃ tathaṃ bhūtaṃ yāthāvaṃ aviparīta’’nti gahitaṃ parāmaṭṭhaṃ abhiniviṭṭhaṃ ajjhositaṃ adhimuttaṃ natthi na santi na saṃvijjati nupalabbhati, pahīnaṃ samucchinnaṃ vūpasantaṃ paṭipassaddhaṃ abhabbuppattikaṃ ñāṇagginā daḍḍhanti – dhammesu niccheyya samuggahītaṃ."
    ],
    "innerText": "Dhammesu niccheyya samuggahītanti. Dhammesūti dvāsaṭṭhiyā diṭṭhigatesu. Niccheyyāti nicchinitvā vinicchinitvā vicinitvā pavicinitvā tulayitvā tīrayitvā vibhāvayitvā vibhūtaṃ katvā. Odhiggāho bilaggāho varaggāho koṭṭhāsaggāho uccayaggāho samuccayaggāho ‘‘idaṃ saccaṃ tathaṃ bhūtaṃ yāthāvaṃ aviparīta’’nti gahitaṃ parāmaṭṭhaṃ abhiniviṭṭhaṃ ajjhositaṃ adhimuttaṃ natthi na santi na saṃvijjati nupalabbhati, pahīnaṃ samucchinnaṃ vūpasantaṃ paṭipassaddhaṃ abhabbuppattikaṃ ñāṇagginā daḍḍhanti – dhammesu niccheyya samuggahītaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasmā vivādāni upātivatto"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasmā"
      },
      "ti tasmā taṃkāraṇā taṃhetu tappaccayā taṃnidānā diṭṭhikalahāni diṭṭhibhaṇḍanāni diṭṭhiviggahāni diṭṭhivivādāni diṭṭhimedhagāni upātivatto atikkanto samatikkanto vītivattoti – tasmā vivādāni upātivatto."
    ],
    "innerText": "Tasmā vivādāni upātivattoti. Tasmāti tasmā taṃkāraṇā taṃhetu tappaccayā taṃnidānā diṭṭhikalahāni diṭṭhibhaṇḍanāni diṭṭhiviggahāni diṭṭhivivādāni diṭṭhimedhagāni upātivatto atikkanto samatikkanto vītivattoti – tasmā vivādāni upātivatto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na hi seṭṭhato passati dhammamañña"
      },
      "nti. Aññaṃ satthāraṃ dhammakkhānaṃ gaṇaṃ diṭṭhiṃ paṭipadaṃ maggaṃ aññatra satipaṭṭhānehi, aññatra sammappadhānehi, aññatra iddhipādehi ",
      ", aññatra indriyehi, aññatra balehi, aññatra bojjhaṅgehi, aññatra ariyā ",
      " aṭṭhaṅgikā maggā, aggaṃ seṭṭhaṃ visiṭṭhaṃ pāmokkhaṃ uttamaṃ pavaraṃ dhammaṃ na passati na dakkhati na oloketi na nijjhāyati ",
      " na upaparikkhatīti – na hi seṭṭhato passati dhammamaññaṃ."
    ],
    "innerText": "Na hi seṭṭhato passati dhammamaññanti. Aññaṃ satthāraṃ dhammakkhānaṃ gaṇaṃ diṭṭhiṃ paṭipadaṃ maggaṃ aññatra satipaṭṭhānehi, aññatra sammappadhānehi, aññatra iddhipādehi , aññatra indriyehi, aññatra balehi, aññatra bojjhaṅgehi, aññatra ariyā aṭṭhaṅgikā maggā, aggaṃ seṭṭhaṃ visiṭṭhaṃ pāmokkhaṃ uttamaṃ pavaraṃ dhammaṃ na passati na dakkhati na oloketi na nijjhāyati na upaparikkhatīti – na hi seṭṭhato passati dhammamaññaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Na brāhmaṇassa paraneyyamatthi, dhammesu niccheyya samuggahītaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tasmā vivādāni upātivatto, na hi seṭṭhato passati dhammamañña’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "143"
      },
      "."
    ],
    "innerText": "143."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Jānāmi passāmi tatheva etaṃ, diṭṭhiyā eke paccenti suddhiṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Adakkhi ce kiñhi tumassa tena, atisitvā aññena vadanti suddhiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jānāmi passāmi tatheva eta"
      },
      "nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jānāmī"
      },
      "ti paracittañāṇena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[paracittavijānanañāṇena (sī.) aṭṭhakathā oloketabbā]"
      },
      " vā jānāmi, pubbenivāsānussatiñāṇena vā jānāmi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Passāmī"
      },
      "ti maṃsacakkhunā vā passāmi, dibbena cakkhunā ",
      " vā passāmi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatheva eta"
      },
      "nti etaṃ tathaṃ tacchaṃ bhūtaṃ yāthāvaṃ aviparītanti – jānāmi passāmi tatheva etaṃ."
    ],
    "innerText": "Jānāmi passāmi tatheva etanti. Jānāmīti paracittañāṇena [paracittavijānanañāṇena (sī.) aṭṭhakathā oloketabbā] vā jānāmi, pubbenivāsānussatiñāṇena vā jānāmi. Passāmīti maṃsacakkhunā vā passāmi, dibbena cakkhunā vā passāmi. Tatheva etanti etaṃ tathaṃ tacchaṃ bhūtaṃ yāthāvaṃ aviparītanti – jānāmi passāmi tatheva etaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Diṭṭhiyā eke paccenti suddhi"
      },
      "nti. Diṭṭhiyā eke samaṇabrāhmaṇā suddhiṃ visuddhiṃ parisuddhiṃ, muttiṃ vimuttiṃ parimuttiṃ paccenti. ‘‘Sassato loko, idameva saccaṃ moghamañña’’nti diṭṭhiyā eke samaṇabrāhmaṇā suddhiṃ visuddhiṃ parisuddhiṃ, muttiṃ vimuttiṃ parimuttiṃ ",
      " paccenti. ‘‘Asassato loko…pe… neva hoti na na hoti tathāgato paraṃ maraṇā, idameva saccaṃ moghamañña’’nti diṭṭhiyā eke samaṇabrāhmaṇā suddhiṃ visuddhiṃ parisuddhiṃ, muttiṃ vimuttiṃ parimuttiṃ paccentīti – diṭṭhiyā eke paccenti suddhiṃ."
    ],
    "innerText": "Diṭṭhiyā eke paccenti suddhinti. Diṭṭhiyā eke samaṇabrāhmaṇā suddhiṃ visuddhiṃ parisuddhiṃ, muttiṃ vimuttiṃ parimuttiṃ paccenti. ‘‘Sassato loko, idameva saccaṃ moghamañña’’nti diṭṭhiyā eke samaṇabrāhmaṇā suddhiṃ visuddhiṃ parisuddhiṃ, muttiṃ vimuttiṃ parimuttiṃ paccenti. ‘‘Asassato loko…pe… neva hoti na na hoti tathāgato paraṃ maraṇā, idameva saccaṃ moghamañña’’nti diṭṭhiyā eke samaṇabrāhmaṇā suddhiṃ visuddhiṃ parisuddhiṃ, muttiṃ vimuttiṃ parimuttiṃ paccentīti – diṭṭhiyā eke paccenti suddhiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adakkhi ce kiñhi tumassa tenā"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adakkhī"
      },
      "ti paracittañāṇena vā adakkhi, pubbenivāsānussatiñāṇena vā adakkhi, maṃsacakkhunā vā adakkhi, dibbena cakkhunā vā adakkhīti – adakkhi ce. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kiñhi tumassa tenā"
      },
      "ti. Tassa tena dassanena kiṃ kataṃ? Na dukkhapariññā atthi, na samudayassa pahānaṃ atthi, na maggabhāvanā atthi, na ",
      " phalasacchikiriyā atthi, na rāgassa samucchedapahānaṃ atthi, na dosassa samucchedapahānaṃ atthi, na mohassa samucchedapahānaṃ atthi ",
      ", na kilesānaṃ samucchedapahānaṃ atthi, na saṃsāravaṭṭassa upacchedo atthīti – adakkhi ce kiñhi tumassa tena."
    ],
    "innerText": "Adakkhi ce kiñhi tumassa tenāti. Adakkhīti paracittañāṇena vā adakkhi, pubbenivāsānussatiñāṇena vā adakkhi, maṃsacakkhunā vā adakkhi, dibbena cakkhunā vā adakkhīti – adakkhi ce. Kiñhi tumassa tenāti. Tassa tena dassanena kiṃ kataṃ? Na dukkhapariññā atthi, na samudayassa pahānaṃ atthi, na maggabhāvanā atthi, na phalasacchikiriyā atthi, na rāgassa samucchedapahānaṃ atthi, na dosassa samucchedapahānaṃ atthi, na mohassa samucchedapahānaṃ atthi , na kilesānaṃ samucchedapahānaṃ atthi, na saṃsāravaṭṭassa upacchedo atthīti – adakkhi ce kiñhi tumassa tena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atisitvā aññena vadanti suddhi"
      },
      "nti te titthiyā suddhimaggaṃ visuddhimaggaṃ parisuddhimaggaṃ vodātamaggaṃ parivodātamaggaṃ atikkamitvā samatikkamitvā vītivattitvā aññatra satipaṭṭhānehi, aññatra sammappadhānehi, aññatra iddhipādehi, aññatra indriyehi, aññatra balehi aññatra bojjhaṅgehi, aññatra ariyā aṭṭhaṅgikā maggā suddhiṃ visuddhiṃ parisuddhiṃ, muttiṃ vimuttiṃ parimuttiṃ vadanti kathenti bhaṇanti dīpayanti voharantīti. Evampi atisitvā aññena ",
      " vadanti suddhiṃ."
    ],
    "innerText": "Atisitvā aññena vadanti suddhinti te titthiyā suddhimaggaṃ visuddhimaggaṃ parisuddhimaggaṃ vodātamaggaṃ parivodātamaggaṃ atikkamitvā samatikkamitvā vītivattitvā aññatra satipaṭṭhānehi, aññatra sammappadhānehi, aññatra iddhipādehi, aññatra indriyehi, aññatra balehi aññatra bojjhaṅgehi, aññatra ariyā aṭṭhaṅgikā maggā suddhiṃ visuddhiṃ parisuddhiṃ, muttiṃ vimuttiṃ parimuttiṃ vadanti kathenti bhaṇanti dīpayanti voharantīti. Evampi atisitvā aññena vadanti suddhiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha vā buddhā ca buddhasāvakā ca paccekabuddhā ca tesaṃ titthiyānaṃ asuddhimaggaṃ avisuddhimaggaṃ aparisuddhimaggaṃ avodātamaggaṃ aparivodātamaggaṃ atikkamitvā samatikkamitvā vītivattitvā catūhi satipaṭṭhānehi catūhi sammappadhānehi catūhi iddhipādehi pañcahi indriyehi pañcahi balehi sattahi bojjhaṅgehi ariyena aṭṭhaṅgikena maggena suddhiṃ visuddhiṃ ",
      " parisuddhiṃ, muttiṃ vimuttiṃ parimuttiṃ vadanti kathenti bhaṇanti dīpayanti voharantīti – evampi atisitvā aññena vadanti suddhiṃ."
    ],
    "innerText": "Atha vā buddhā ca buddhasāvakā ca paccekabuddhā ca tesaṃ titthiyānaṃ asuddhimaggaṃ avisuddhimaggaṃ aparisuddhimaggaṃ avodātamaggaṃ aparivodātamaggaṃ atikkamitvā samatikkamitvā vītivattitvā catūhi satipaṭṭhānehi catūhi sammappadhānehi catūhi iddhipādehi pañcahi indriyehi pañcahi balehi sattahi bojjhaṅgehi ariyena aṭṭhaṅgikena maggena suddhiṃ visuddhiṃ parisuddhiṃ, muttiṃ vimuttiṃ parimuttiṃ vadanti kathenti bhaṇanti dīpayanti voharantīti – evampi atisitvā aññena vadanti suddhiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Jānāmi passāmi tatheva etaṃ, diṭṭhiyā eke paccenti suddhiṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Adakkhi ce kiñhi tumassa tena, atisitvā aññena vadanti suddhi’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "144"
      },
      "."
    ],
    "innerText": "144."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Passaṃ naro dakkhati nāmarūpaṃ, disvāna vā ñāyati"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ñassati (sī. syā.)]"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tānimeva;"
      }
    ],
    "innerText": "Passaṃ naro dakkhati nāmarūpaṃ, disvāna vā ñāyati[ñassati (sī. syā.)]tānimeva;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kāmaṃ bahuṃ passatu appakaṃ vā, na hi tena suddhiṃ kusalā vadanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Passaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "naro dakkhati nāmarūpa"
      },
      "nti passaṃ naro dakkhati paracittañāṇena vā passanto, pubbenivāsānussatiñāṇena vā passanto, maṃsacakkhunā vā passanto, dibbena cakkhunā vā passanto nāmarūpaṃyeva dakkhati niccato sukhato attato, na tesaṃ dhammānaṃ samudayaṃ vā ",
      " atthaṅgamaṃ vā assādaṃ vā ādīnavaṃ vā nissaraṇaṃ vā dakkhatīti – passaṃ naro dakkhati nāmarūpaṃ."
    ],
    "innerText": "Passaṃnaro dakkhati nāmarūpanti passaṃ naro dakkhati paracittañāṇena vā passanto, pubbenivāsānussatiñāṇena vā passanto, maṃsacakkhunā vā passanto, dibbena cakkhunā vā passanto nāmarūpaṃyeva dakkhati niccato sukhato attato, na tesaṃ dhammānaṃ samudayaṃ vā atthaṅgamaṃ vā assādaṃ vā ādīnavaṃ vā nissaraṇaṃ vā dakkhatīti – passaṃ naro dakkhati nāmarūpaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Disvāna"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vā ñāyati tānimevā"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Disvā"
      },
      "ti paracittañāṇena vā disvā, pubbenivāsānussatiñāṇena vā disvā, maṃsacakkhunā vā disvā, dibbena cakkhunā vā disvā, nāmarūpaṃyeva disvā ñāyati niccato sukhato attato, na tesaṃ dhammānaṃ samudayaṃ vā atthaṅgamaṃ vā assādaṃ vā ādīnavaṃ vā nissaraṇaṃ vā ñāyatīti – disvāna vā ñāyati tānimeva."
    ],
    "innerText": "Disvānavā ñāyati tānimevāti. Disvāti paracittañāṇena vā disvā, pubbenivāsānussatiñāṇena vā disvā, maṃsacakkhunā vā disvā, dibbena cakkhunā vā disvā, nāmarūpaṃyeva disvā ñāyati niccato sukhato attato, na tesaṃ dhammānaṃ samudayaṃ vā atthaṅgamaṃ vā assādaṃ vā ādīnavaṃ vā nissaraṇaṃ vā ñāyatīti – disvāna vā ñāyati tānimeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāmaṃ bahuṃ passatu appakaṃ vā"
      },
      "ti. Kāmaṃ bahukaṃ vā passanto nāmarūpaṃ appakaṃ vā niccato sukhato attatoti – kāmaṃ bahuṃ passatu appakaṃ vā."
    ],
    "innerText": "Kāmaṃ bahuṃ passatu appakaṃ vāti. Kāmaṃ bahukaṃ vā passanto nāmarūpaṃ appakaṃ vā niccato sukhato attatoti – kāmaṃ bahuṃ passatu appakaṃ vā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na hi tena suddhiṃ kusalā vadantī"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kusalā"
      },
      "ti ye te khandhakusalā dhātukusalā āyatanakusalā paṭiccasamuppādakusalā satipaṭṭhānakusalā sammappadhānakusalā iddhipādakusalā indriyakusalā balakusalā bojjhaṅgakusalā maggakusalā phalakusalā nibbānakusalā, te kusalā paracittañāṇena vā pubbenivāsānussatiñāṇena vā maṃsacakkhunā vā dibbena cakkhunā vā nāmarūpadassanena ",
      " suddhiṃ visuddhiṃ parisuddhiṃ muttiṃ vimuttiṃ parimuttiṃ na vadanti na kathenti na bhaṇanti na dīpayanti na voharantīti – na hi tena suddhiṃ kusalā vadanti."
    ],
    "innerText": "Na hi tena suddhiṃ kusalā vadantīti. Kusalāti ye te khandhakusalā dhātukusalā āyatanakusalā paṭiccasamuppādakusalā satipaṭṭhānakusalā sammappadhānakusalā iddhipādakusalā indriyakusalā balakusalā bojjhaṅgakusalā maggakusalā phalakusalā nibbānakusalā, te kusalā paracittañāṇena vā pubbenivāsānussatiñāṇena vā maṃsacakkhunā vā dibbena cakkhunā vā nāmarūpadassanena suddhiṃ visuddhiṃ parisuddhiṃ muttiṃ vimuttiṃ parimuttiṃ na vadanti na kathenti na bhaṇanti na dīpayanti na voharantīti – na hi tena suddhiṃ kusalā vadanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Passaṃ ",
      " naro dakkhati nāmarūpaṃ, disvāna vā ñāyati tānimeva;"
    ],
    "innerText": "‘‘Passaṃ naro dakkhati nāmarūpaṃ, disvāna vā ñāyati tānimeva;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kāmaṃ bahuṃ passatu appakaṃ vā, na hi tena suddhiṃ kusalā vadantī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "145"
      },
      "."
    ],
    "innerText": "145."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nivissavādī"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na hi subbināyo, pakappitā diṭṭhipurekkharāno;"
      }
    ],
    "innerText": "Nivissavādīna hi subbināyo, pakappitā diṭṭhipurekkharāno;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yaṃ nissito tattha subhaṃ vadāno, suddhiṃ vado tattha tathaddasā so."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nivissavādī na hi subbināyo"
      },
      "ti. ‘‘Sassato loko, idameva saccaṃ moghamañña’’nti nivissavādī, ‘‘asassato loko…pe… neva hoti na na hoti tathāgato paraṃ maraṇā, idameva saccaṃ moghamañña’’nti – nivissavādī. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na hi subbināyo"
      },
      "ti. Nivissavādī dubbinayo duppaññāpayo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[duppaññāpiyo (sī.) evamīdisesu ṭhānesu]"
      },
      " dunnijjhāpayo ",
      " duppekkhāpayo duppasādayoti – nivissavādī na hi subbināyo."
    ],
    "innerText": "Nivissavādī na hi subbināyoti. ‘‘Sassato loko, idameva saccaṃ moghamañña’’nti nivissavādī, ‘‘asassato loko…pe… neva hoti na na hoti tathāgato paraṃ maraṇā, idameva saccaṃ moghamañña’’nti – nivissavādī. Na hi subbināyoti. Nivissavādī dubbinayo duppaññāpayo [duppaññāpiyo (sī.) evamīdisesu ṭhānesu] dunnijjhāpayo duppekkhāpayo duppasādayoti – nivissavādī na hi subbināyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pakappitā diṭṭhipurekkharāno"
      },
      "ti. Kappitā pakappitā abhisaṅkhatā saṇṭhapitā diṭṭhiṃ purekkhato katvā carati. Diṭṭhidhajo diṭṭhiketu diṭṭhādhipateyyo diṭṭhiyā parivārito caratīti – pakappitā diṭṭhipurekkharāno."
    ],
    "innerText": "Pakappitā diṭṭhipurekkharānoti. Kappitā pakappitā abhisaṅkhatā saṇṭhapitā diṭṭhiṃ purekkhato katvā carati. Diṭṭhidhajo diṭṭhiketu diṭṭhādhipateyyo diṭṭhiyā parivārito caratīti – pakappitā diṭṭhipurekkharāno."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yaṃ nissito tattha subhaṃ vadāno"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yaṃ nissito"
      },
      "ti yaṃ satthāraṃ dhammakkhānaṃ gaṇaṃ diṭṭhiṃ paṭipadaṃ maggaṃ nissito ānissito allīno ",
      " upagato ajjhosito adhimuttoti – yaṃ nissito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatthā"
      },
      "ti sakāya diṭṭhiyā sakāya khantiyā sakāya ruciyā sakāya laddhiyā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Subhaṃ vadāno"
      },
      "ti subhavādo sobhanavādo paṇḍitavādo thiravādo ñāyavādo hetuvādo lakkhaṇavādo kāraṇavādo ṭhānavādo sakāya laddhiyāti – yaṃ nissito tattha subhaṃ vadāno."
    ],
    "innerText": "Yaṃ nissito tattha subhaṃ vadānoti. Yaṃ nissitoti yaṃ satthāraṃ dhammakkhānaṃ gaṇaṃ diṭṭhiṃ paṭipadaṃ maggaṃ nissito ānissito allīno upagato ajjhosito adhimuttoti – yaṃ nissito. Tatthāti sakāya diṭṭhiyā sakāya khantiyā sakāya ruciyā sakāya laddhiyā. Subhaṃ vadānoti subhavādo sobhanavādo paṇḍitavādo thiravādo ñāyavādo hetuvādo lakkhaṇavādo kāraṇavādo ṭhānavādo sakāya laddhiyāti – yaṃ nissito tattha subhaṃ vadāno."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suddhiṃ vado tattha tathaddasā so"
      },
      "ti. Suddhivādo ",
      " visuddhivādo parisuddhivādo vodātavādo parivodātavādo. Atha vā suddhidassano visuddhidassano parisuddhidassano vodātadassano parivodātadassanoti – suddhiṃ vādo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatthā"
      },
      "ti sakāya diṭṭhiyā sakāya khantiyā sakāya ruciyā ",
      " sakāya laddhiyā tathaṃ tacchaṃ bhūtaṃ yāthāvaṃ aviparītanti addassa adakkhi apassi paṭivijjhīti – suddhiṃ vādo tattha tathaddasā so."
    ],
    "innerText": "Suddhiṃ vado tattha tathaddasā soti. Suddhivādo visuddhivādo parisuddhivādo vodātavādo parivodātavādo. Atha vā suddhidassano visuddhidassano parisuddhidassano vodātadassano parivodātadassanoti – suddhiṃ vādo. Tatthāti sakāya diṭṭhiyā sakāya khantiyā sakāya ruciyā sakāya laddhiyā tathaṃ tacchaṃ bhūtaṃ yāthāvaṃ aviparītanti addassa adakkhi apassi paṭivijjhīti – suddhiṃ vādo tattha tathaddasā so."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Nivissavādī na hi subbināyo, pakappitā diṭṭhipurekkharāno;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yaṃ nissito tattha subhaṃ vadāno, suddhiṃ vado tattha tathaddasā so’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "146"
      },
      "."
    ],
    "innerText": "146."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Na brāhmaṇo kappamupeti saṅkhā, na diṭṭhisārī napi ñāṇabandhu;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ñatvā ca so sammutiyo puthujjā, upekkhatī uggahaṇanti maññe."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "brāhmaṇo kappamupeti saṅkhā"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nā"
      },
      "ti paṭikkhepo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Brāhmaṇo"
      },
      "ti sattannaṃ dhammānaṃ bāhitattā brāhmaṇo…pe… asito tādi pavuccate sa brahmā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kappā"
      },
      "ti dve kappā – taṇhākappo ca diṭṭhikappo ca…pe… ayaṃ taṇhākappo…pe… ayaṃ diṭṭhikappo. Saṅkhā vuccati ñāṇaṃ. Yā paññā pajānanā…pe… amoho ",
      " dhammavicayo sammādiṭṭhi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na brāhmaṇo kappamupeti saṅkhā"
      },
      "ti. Brāhmaṇo saṅkhāya jānitvā tulayitvā tīrayitvā vibhāvayitvā vibhūtaṃ katvā. ‘‘Sabbe saṅkhārā aniccā… sabbe saṅkhārā dukkhā…pe… yaṃ kiñci samudayadhammaṃ sabbaṃ taṃ nirodhadhamma’’nti saṅkhāya jānitvā tulayitvā tīrayitvā vibhāvayitvā vibhūtaṃ katvā taṇhākappaṃ vā diṭṭhikappaṃ ",
      " vā neti na upeti na upagacchati na gaṇhāti na parāmasati nābhinivisatīti – na brāhmaṇo kappamupeti saṅkhā."
    ],
    "innerText": "Nabrāhmaṇo kappamupeti saṅkhāti. Nāti paṭikkhepo. Brāhmaṇoti sattannaṃ dhammānaṃ bāhitattā brāhmaṇo…pe… asito tādi pavuccate sa brahmā. Kappāti dve kappā – taṇhākappo ca diṭṭhikappo ca…pe… ayaṃ taṇhākappo…pe… ayaṃ diṭṭhikappo. Saṅkhā vuccati ñāṇaṃ. Yā paññā pajānanā…pe… amoho dhammavicayo sammādiṭṭhi. Na brāhmaṇo kappamupeti saṅkhāti. Brāhmaṇo saṅkhāya jānitvā tulayitvā tīrayitvā vibhāvayitvā vibhūtaṃ katvā. ‘‘Sabbe saṅkhārā aniccā… sabbe saṅkhārā dukkhā…pe… yaṃ kiñci samudayadhammaṃ sabbaṃ taṃ nirodhadhamma’’nti saṅkhāya jānitvā tulayitvā tīrayitvā vibhāvayitvā vibhūtaṃ katvā taṇhākappaṃ vā diṭṭhikappaṃ vā neti na upeti na upagacchati na gaṇhāti na parāmasati nābhinivisatīti – na brāhmaṇo kappamupeti saṅkhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na diṭṭhisārī napi ñāṇabandhū"
      },
      "ti. Tassa dvāsaṭṭhi diṭṭhigatāni pahīnāni samucchinnāni vūpasantāni paṭipassaddhāni abhabbuppattikāni ñāṇagginā daḍḍhāni. So diṭṭhiyā na yāyati na nīyati na vuyhati na saṃharīyati napi taṃ diṭṭhigataṃ sārato pacceti na paccāgacchatīti – na diṭṭhisārī. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Napi ñāṇabandhū"
      },
      "ti aṭṭhasamāpattiñāṇena vā pañcābhiññāñāṇena vā taṇhābandhuṃ vā diṭṭhibandhuṃ vā na karoti na janeti na sañjaneti na nibbatteti ",
      " nābhinibbattetīti – na diṭṭhisārī napi ñāṇabandhu."
    ],
    "innerText": "Na diṭṭhisārī napi ñāṇabandhūti. Tassa dvāsaṭṭhi diṭṭhigatāni pahīnāni samucchinnāni vūpasantāni paṭipassaddhāni abhabbuppattikāni ñāṇagginā daḍḍhāni. So diṭṭhiyā na yāyati na nīyati na vuyhati na saṃharīyati napi taṃ diṭṭhigataṃ sārato pacceti na paccāgacchatīti – na diṭṭhisārī. Napi ñāṇabandhūti aṭṭhasamāpattiñāṇena vā pañcābhiññāñāṇena vā taṇhābandhuṃ vā diṭṭhibandhuṃ vā na karoti na janeti na sañjaneti na nibbatteti nābhinibbattetīti – na diṭṭhisārī napi ñāṇabandhu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñatvā ca so sammutiyo puthujjā"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñatvā"
      },
      "ti ñatvā jānitvā tulayitvā tīrayitvā vibhāvayitvā vibhūtaṃ katvā. ‘‘Sabbe saṅkhārā aniccā’’ti ñatvā jānitvā tulayitvā tīrayitvā vibhāvayitvā vibhūtaṃ katvā, ‘‘sabbe saṅkhārā dukkhā’’ti…pe… ‘‘yaṃ kiñci samudayadhammaṃ ",
      " sabbaṃ taṃ nirodhadhamma’’nti ñatvā jānitvā tulayitvā tīrayitvā vibhāvayitvā vibhūtaṃ katvāti – ñatvā ca so. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammutiyo"
      },
      " vuccanti dvāsaṭṭhi diṭṭhigatāni diṭṭhisammutiyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puthujjā"
      },
      "ti puthujjanehi janitā vā tā sammutiyoti – puthujjā. Puthu nānājanehi janitā vā sammutiyoti puthujjāti – ñatvā ca so sammutiyo puthujjā."
    ],
    "innerText": "Ñatvā ca so sammutiyo puthujjāti. Ñatvāti ñatvā jānitvā tulayitvā tīrayitvā vibhāvayitvā vibhūtaṃ katvā. ‘‘Sabbe saṅkhārā aniccā’’ti ñatvā jānitvā tulayitvā tīrayitvā vibhāvayitvā vibhūtaṃ katvā, ‘‘sabbe saṅkhārā dukkhā’’ti…pe… ‘‘yaṃ kiñci samudayadhammaṃ sabbaṃ taṃ nirodhadhamma’’nti ñatvā jānitvā tulayitvā tīrayitvā vibhāvayitvā vibhūtaṃ katvāti – ñatvā ca so. Sammutiyo vuccanti dvāsaṭṭhi diṭṭhigatāni diṭṭhisammutiyo. Puthujjāti puthujjanehi janitā vā tā sammutiyoti – puthujjā. Puthu nānājanehi janitā vā sammutiyoti puthujjāti – ñatvā ca so sammutiyo puthujjā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upekkhatī uggahaṇanti maññe"
      },
      "ti. Aññe taṇhāvasena diṭṭhivasena gaṇhanti parāmasanti abhinivisanti. Arahā upekkhati na gaṇhāti na parāmasati nābhinivisatīti – upekkhatī uggahaṇanti maññe."
    ],
    "innerText": "Upekkhatī uggahaṇanti maññeti. Aññe taṇhāvasena diṭṭhivasena gaṇhanti parāmasanti abhinivisanti. Arahā upekkhati na gaṇhāti na parāmasati nābhinivisatīti – upekkhatī uggahaṇanti maññe."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Na brāhmaṇo kappamupeti saṅkhā, na diṭṭhisārī napi ñāṇabandhu;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ñatvā ca so sammutiyo puthujjā, upekkhatī uggahaṇanti maññe’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "147"
      },
      "."
    ],
    "innerText": "147."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajja"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ganthāni munīdha loke, vivādajātesu na vaggasārī;"
      }
    ],
    "innerText": "Vissajjaganthāni munīdha loke, vivādajātesu na vaggasārī;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Santo"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asantesu upekkhako so, anuggaho uggahaṇanti maññe."
      }
    ],
    "innerText": "Santoasantesu upekkhako so, anuggaho uggahaṇanti maññe."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajja ganthāni munīdha loke"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ganthā"
      },
      "ti cattāro ganthā – abhijjhā kāyagantho, byāpādo kāyagantho, sīlabbataparāmāso kāyagantho, idaṃsaccābhiniveso kāyagantho. Attano diṭṭhiyā rāgo abhijjhā kāyagantho, paravādesu āghāto appaccayo byāpādo kāyagantho, attano sīlaṃ vā vataṃ vā sīlabbataṃ vā parāmasati sīlabbataparāmāso kāyagantho, attano diṭṭhiṃ abhiniveso kāyagantho idaṃsaccābhiniveso kāyagantho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjā"
      },
      "ti ganthe vossajjitvā vissajja. Atha vā ganthe gadhite ganthite ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[gathite gaṇṭhite (bahūsu) suddhaṭṭhakasutte sattamagāthāvaṇṇanā oloketabbā]"
      },
      " bandhe vibandhe ābandhe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[baddhe vibaddhe ābaddhe (sī.)]"
      },
      " lagge laggite palibuddhe bandhane phoṭayitvā vissajja. Yathā vayhaṃ vā rathaṃ vā sakaṭaṃ vā sandamānikaṃ vā sajjaṃ vissajjaṃ karonti vikopenti; evameva ganthe vossajjitvā vissajja. Atha vā ganthe gathite gaṇṭhite bandhe vibandhe ābandhe lagge laggite palibuddhe bandhane phoṭayitvā vissajja. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Munī"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Monaṃ"
      },
      " vuccati ñāṇaṃ…pe… saṅgajālamaticca so muni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idhā"
      },
      "ti imissā diṭṭhiyā…pe… imasmiṃ manussaloketi – vissajja ganthāni munīdha loke."
    ],
    "innerText": "Vissajja ganthāni munīdha loketi. Ganthāti cattāro ganthā – abhijjhā kāyagantho, byāpādo kāyagantho, sīlabbataparāmāso kāyagantho, idaṃsaccābhiniveso kāyagantho. Attano diṭṭhiyā rāgo abhijjhā kāyagantho, paravādesu āghāto appaccayo byāpādo kāyagantho, attano sīlaṃ vā vataṃ vā sīlabbataṃ vā parāmasati sīlabbataparāmāso kāyagantho, attano diṭṭhiṃ abhiniveso kāyagantho idaṃsaccābhiniveso kāyagantho. Vissajjāti ganthe vossajjitvā vissajja. Atha vā ganthe gadhite ganthite [gathite gaṇṭhite (bahūsu) suddhaṭṭhakasutte sattamagāthāvaṇṇanā oloketabbā] bandhe vibandhe ābandhe [baddhe vibaddhe ābaddhe (sī.)] lagge laggite palibuddhe bandhane phoṭayitvā vissajja. Yathā vayhaṃ vā rathaṃ vā sakaṭaṃ vā sandamānikaṃ vā sajjaṃ vissajjaṃ karonti vikopenti; evameva ganthe vossajjitvā vissajja. Atha vā ganthe gathite gaṇṭhite bandhe vibandhe ābandhe lagge laggite palibuddhe bandhane phoṭayitvā vissajja. Munīti. Monaṃ vuccati ñāṇaṃ…pe… saṅgajālamaticca so muni. Idhāti imissā diṭṭhiyā…pe… imasmiṃ manussaloketi – vissajja ganthāni munīdha loke."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vivādajātesu na vaggasārī"
      },
      "ti. Vivādajātesu sañjātesu nibbattesu abhinibbattesu pātubhūtesu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vivāde jāte sañjāte nibbatte abhinibbatte pātubhūte (sī. ka.)]"
      },
      " chandāgatiṃ gacchantesu dosāgatiṃ ",
      " gacchantesu ",
      " bhayāgatiṃ gacchantesu mohāgatiṃ gacchantesu ",
      " na chandāgatiṃ gacchati, na dosāgatiṃ gacchati, na bhayāgatiṃ gacchati, na mohāgatiṃ gacchati, na rāgavasena gacchati, na dosavasena gacchati, na mohavasena gacchati, na mānavasena gacchati, na diṭṭhivasena gacchati, na uddhaccavasena gacchati, na vicikicchāvasena gacchati, na anusayavasena gacchati, na vaggehi dhammehi yāyati nīyati vuyhati saṃharīyatīti – vivādajātesu na vaggasārī."
    ],
    "innerText": "Vivādajātesu na vaggasārīti. Vivādajātesu sañjātesu nibbattesu abhinibbattesu pātubhūtesu [vivāde jāte sañjāte nibbatte abhinibbatte pātubhūte (sī. ka.)] chandāgatiṃ gacchantesu dosāgatiṃ gacchantesu bhayāgatiṃ gacchantesu mohāgatiṃ gacchantesu na chandāgatiṃ gacchati, na dosāgatiṃ gacchati, na bhayāgatiṃ gacchati, na mohāgatiṃ gacchati, na rāgavasena gacchati, na dosavasena gacchati, na mohavasena gacchati, na mānavasena gacchati, na diṭṭhivasena gacchati, na uddhaccavasena gacchati, na vicikicchāvasena gacchati, na anusayavasena gacchati, na vaggehi dhammehi yāyati nīyati vuyhati saṃharīyatīti – vivādajātesu na vaggasārī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Santo asantesu upekkhako so"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Santo"
      },
      "ti rāgassa santattā santo, dosassa santattā santo, mohassa santattā santo…pe… sabbākusalābhisaṅkhārānaṃ santattā samitattā vūpasamitattā vijjhātattā nibbutattā ",
      " vigatattā paṭipassaddhattā santo upasanto vūpasanto nibbuto paṭipassaddhoti – santo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asantesū"
      },
      "ti asantesu anupasantesu avūpasantesu anibbutesu appaṭipassaddhesūti – santo asantesu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upekkhako so"
      },
      "ti arahā chaḷaṅgupekkhāya samannāgato cakkhunā rūpaṃ disvā neva sumano hoti na dummano upekkhako viharati sato sampajāno. Sotena saddaṃ sutvā…pe… kālaṃ kaṅkhati bhāvito santoti – santo asantesu upekkhako so."
    ],
    "innerText": "Santo asantesu upekkhako soti. Santoti rāgassa santattā santo, dosassa santattā santo, mohassa santattā santo…pe… sabbākusalābhisaṅkhārānaṃ santattā samitattā vūpasamitattā vijjhātattā nibbutattā vigatattā paṭipassaddhattā santo upasanto vūpasanto nibbuto paṭipassaddhoti – santo. Asantesūti asantesu anupasantesu avūpasantesu anibbutesu appaṭipassaddhesūti – santo asantesu. Upekkhako soti arahā chaḷaṅgupekkhāya samannāgato cakkhunā rūpaṃ disvā neva sumano hoti na dummano upekkhako viharati sato sampajāno. Sotena saddaṃ sutvā…pe… kālaṃ kaṅkhati bhāvito santoti – santo asantesu upekkhako so."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anuggaho uggahaṇanti maññe"
      },
      "ti. Aññe taṇhāvasena diṭṭhivasena gaṇhante parāmasante abhinivisante. Arahā upekkhati na ",
      " gaṇhāti na parāmasati nābhinivisatīti – anuggaho uggahaṇanti maññe."
    ],
    "innerText": "Anuggaho uggahaṇanti maññeti. Aññe taṇhāvasena diṭṭhivasena gaṇhante parāmasante abhinivisante. Arahā upekkhati na gaṇhāti na parāmasati nābhinivisatīti – anuggaho uggahaṇanti maññe."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Vissajja ganthāni munīdha loke, vivādajātesu na vaggasārī;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Santo asantesu upekkhako so, anuggaho uggahaṇanti maññe’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "148"
      },
      "."
    ],
    "innerText": "148."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Pubbāsave hitvā nave akubbaṃ, na chandagū nopi nivissavādī;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sa vippamutto diṭṭhigatehi dhīro, na limpati loke anattagarahī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pubbāsave"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hitvā nave akubba"
      },
      "nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pubbāsavā"
      },
      " vuccanti atītā rūpavedanāsaññāsaṅkhāraviññāṇā. Atīte saṅkhāre ārabbha ye kilesā uppajjeyyuṃ te kilese hitvā cajitvā pariccajitvā pajahitvā vinodetvā byantiṃ karitvā anabhāvaṃ gametvāti – pubbāsave hitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nave akubba"
      },
      "nti navā vuccanti paccuppannā rūpavedanāsaññāsaṅkhāraviññāṇā. Paccuppanne ",
      " saṅkhāre ārabbha chandaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[khantiṃ (ka.)]"
      },
      " akubbamāno pemaṃ akubbamāno rāgaṃ akubbamāno ajanayamāno asañjanayamāno anibbattayamāno anabhinibbattayamānoti – pubbāsave hitvā nave akubbaṃ."
    ],
    "innerText": "Pubbāsavehitvā nave akubbanti. Pubbāsavā vuccanti atītā rūpavedanāsaññāsaṅkhāraviññāṇā. Atīte saṅkhāre ārabbha ye kilesā uppajjeyyuṃ te kilese hitvā cajitvā pariccajitvā pajahitvā vinodetvā byantiṃ karitvā anabhāvaṃ gametvāti – pubbāsave hitvā. Nave akubbanti navā vuccanti paccuppannā rūpavedanāsaññāsaṅkhāraviññāṇā. Paccuppanne saṅkhāre ārabbha chandaṃ [khantiṃ (ka.)] akubbamāno pemaṃ akubbamāno rāgaṃ akubbamāno ajanayamāno asañjanayamāno anibbattayamāno anabhinibbattayamānoti – pubbāsave hitvā nave akubbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na chandagū nopi nivissavādī"
      },
      "ti. Na chandāgatiṃ gacchati ",
      ", na dosāgatiṃ gacchati, na mohāgatiṃ gacchati, na bhayāgatiṃ gacchati, na rāgavasena gacchati ",
      ", na dosavasena gacchati, na mohavasena gacchati, na mānavasena gacchati, na diṭṭhivasena gacchati, na uddhaccavasena gacchati, na vicikicchāvasena gacchati, na anusayavasena gacchati, na vaggehi dhammehi yāyati nīyati vuyhati na saṃharīyatīti – na chandagū. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nopi nivissavādī"
      },
      "ti ‘‘sassato loko, idameva saccaṃ moghamañña’’nti na nivissavādī…pe… ‘‘neva hoti na na hoti tathāgato paraṃ maraṇā, idameva saccaṃ moghamañña’’nti na nivissavādīti – na chandagū nopi nivissavādī."
    ],
    "innerText": "Na chandagū nopi nivissavādīti. Na chandāgatiṃ gacchati , na dosāgatiṃ gacchati, na mohāgatiṃ gacchati, na bhayāgatiṃ gacchati, na rāgavasena gacchati , na dosavasena gacchati, na mohavasena gacchati, na mānavasena gacchati, na diṭṭhivasena gacchati, na uddhaccavasena gacchati, na vicikicchāvasena gacchati, na anusayavasena gacchati, na vaggehi dhammehi yāyati nīyati vuyhati na saṃharīyatīti – na chandagū. Nopi nivissavādīti ‘‘sassato loko, idameva saccaṃ moghamañña’’nti na nivissavādī…pe… ‘‘neva hoti na na hoti tathāgato paraṃ maraṇā, idameva saccaṃ moghamañña’’nti na nivissavādīti – na chandagū nopi nivissavādī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sa vippamutto diṭṭhigatehi dhīro"
      },
      "ti tassa dvāsaṭṭhi diṭṭhigatāni pahīnāni samucchinnāni vūpasantāni paṭipassaddhāni abhabbuppattikāni ñāṇagginā daḍḍhāni. So diṭṭhigatehi vippamutto visaññutto vimariyādikatena cetasā viharati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhīro"
      },
      "ti dhīro paṇḍito paññavā buddhimā ñāṇī vibhāvī medhāvīti – sa vippamutto diṭṭhigatehi dhīro."
    ],
    "innerText": "Sa vippamutto diṭṭhigatehi dhīroti tassa dvāsaṭṭhi diṭṭhigatāni pahīnāni samucchinnāni vūpasantāni paṭipassaddhāni abhabbuppattikāni ñāṇagginā daḍḍhāni. So diṭṭhigatehi vippamutto visaññutto vimariyādikatena cetasā viharati. Dhīroti dhīro paṇḍito paññavā buddhimā ñāṇī vibhāvī medhāvīti – sa vippamutto diṭṭhigatehi dhīro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na limpati loke anattagarahī"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lepā"
      },
      "ti dve lepā – taṇhālepo ca diṭṭhilepo ca…pe… ayaṃ taṇhālepo ",
      " …pe… ayaṃ diṭṭhilepo. Tassa taṇhālepo pahīno, diṭṭhilepo paṭinissaṭṭho; tassa taṇhālepassa pahīnattā, diṭṭhilepassa paṭinissaṭṭhattā apāyaloke na limpati, manussaloke na limpati, devaloke na ",
      " limpati, khandhaloke na limpati, dhātuloke na limpati, āyatanaloke na limpati na palimpati na upalimpati, alitto apalitto anupalitto nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā viharatīti – na limpati loke."
    ],
    "innerText": "Na limpati loke anattagarahīti. Lepāti dve lepā – taṇhālepo ca diṭṭhilepo ca…pe… ayaṃ taṇhālepo …pe… ayaṃ diṭṭhilepo. Tassa taṇhālepo pahīno, diṭṭhilepo paṭinissaṭṭho; tassa taṇhālepassa pahīnattā, diṭṭhilepassa paṭinissaṭṭhattā apāyaloke na limpati, manussaloke na limpati, devaloke na limpati, khandhaloke na limpati, dhātuloke na limpati, āyatanaloke na limpati na palimpati na upalimpati, alitto apalitto anupalitto nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā viharatīti – na limpati loke."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anattagarahī"
      },
      "ti dvīhi kāraṇehi attānaṃ garahati – katattā ca akatattā ca. Kathaṃ katattā ca akatattā ca attānaṃ garahati? ‘‘Kataṃ me kāyaduccaritaṃ, akataṃ me kāyasucarita’’nti attānaṃ garahati. ‘‘Kataṃ me vacīduccaritaṃ…pe… kataṃ me manoduccaritaṃ ",
      "… kato me pāṇātipāto…pe… katā me micchādiṭṭhi, akatā me sammādiṭṭhī’’ti attānaṃ garahati. Evaṃ katattā ca akatattā ca attānaṃ garahati."
    ],
    "innerText": "Anattagarahīti dvīhi kāraṇehi attānaṃ garahati – katattā ca akatattā ca. Kathaṃ katattā ca akatattā ca attānaṃ garahati? ‘‘Kataṃ me kāyaduccaritaṃ, akataṃ me kāyasucarita’’nti attānaṃ garahati. ‘‘Kataṃ me vacīduccaritaṃ…pe… kataṃ me manoduccaritaṃ … kato me pāṇātipāto…pe… katā me micchādiṭṭhi, akatā me sammādiṭṭhī’’ti attānaṃ garahati. Evaṃ katattā ca akatattā ca attānaṃ garahati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha vā ‘‘sīlesumhi na paripūrakārī’’ti attānaṃ garahati. ‘‘Indriyesumhi aguttadvāro’’ti… ‘‘bhojanemhi amattaññū’’ti… ‘‘jāgariyamhi ananuyutto’’ti… ‘‘na satisampajaññenāmhi samannāgato’’ti… ‘‘abhāvitā me ",
      " cattāro satipaṭṭhānā’’ti… ‘‘abhāvitā me cattāro sammappadhānā’’ti… ‘‘abhāvitā me cattāro iddhipādā’’ti… ‘‘abhāvitāni me pañcindriyānī’’ti… ‘‘abhāvitāni me pañca balānī’’ti… ‘‘abhāvitā me satta bojjhaṅgā’’ti… ‘‘abhāvito me ariyo aṭṭhaṅgiko maggo’’ti… ‘‘dukkhaṃ me apariññāta’’nti… ‘‘dukkhasamudayo me appahīno’’ti… ‘‘maggo me abhāvito’’ti… ‘‘nirodho me asacchikato’’ti attānaṃ garahati. Evaṃ katattā ca akatattā ca attānaṃ garahati. Evaṃ attagarahī. Tayidaṃ kammaṃ akubbamāno ajanayamāno asañjanayamāno ",
      " anibbattayamāno anabhinibbattayamāno anattagarahīti – na limpati loke anattagarahī."
    ],
    "innerText": "Atha vā ‘‘sīlesumhi na paripūrakārī’’ti attānaṃ garahati. ‘‘Indriyesumhi aguttadvāro’’ti… ‘‘bhojanemhi amattaññū’’ti… ‘‘jāgariyamhi ananuyutto’’ti… ‘‘na satisampajaññenāmhi samannāgato’’ti… ‘‘abhāvitā me cattāro satipaṭṭhānā’’ti… ‘‘abhāvitā me cattāro sammappadhānā’’ti… ‘‘abhāvitā me cattāro iddhipādā’’ti… ‘‘abhāvitāni me pañcindriyānī’’ti… ‘‘abhāvitāni me pañca balānī’’ti… ‘‘abhāvitā me satta bojjhaṅgā’’ti… ‘‘abhāvito me ariyo aṭṭhaṅgiko maggo’’ti… ‘‘dukkhaṃ me apariññāta’’nti… ‘‘dukkhasamudayo me appahīno’’ti… ‘‘maggo me abhāvito’’ti… ‘‘nirodho me asacchikato’’ti attānaṃ garahati. Evaṃ katattā ca akatattā ca attānaṃ garahati. Evaṃ attagarahī. Tayidaṃ kammaṃ akubbamāno ajanayamāno asañjanayamāno anibbattayamāno anabhinibbattayamāno anattagarahīti – na limpati loke anattagarahī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Pubbāsave hitvā nave akubbaṃ, na chandagū nopi nivissavādī;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sa vippamutto diṭṭhigatehi dhīro, na limpati loke anattagarahī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "149"
      },
      "."
    ],
    "innerText": "149."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sa sabbadhammesu visenibhūto, yaṃ kiñci diṭṭhaṃ va sutaṃ mutaṃ vā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sa pannabhāro muni vippamutto, na kappiyo nūparato na patthiyo."
      },
      "[iti bhagavā]"
    ],
    "innerText": "Sa pannabhāro muni vippamutto, na kappiyo nūparato na patthiyo.[iti bhagavā]"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sa sabbadhammesu visenibhūto yaṃ kiñci diṭṭhaṃ va sutaṃ mutaṃ vā"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Senā"
      },
      " vuccati mārasenā. Kāyaduccaritaṃ mārasenā, vacīduccaritaṃ mārasenā, manoduccaritaṃ mārasenā, rāgo… doso… moho… kodho… upanāho… makkho… paḷāso… issā… macchariyaṃ… māyā… sāṭheyyaṃ… thambho… sārambho… māno… atimāno… mado… pamādo… sabbe kilesā… sabbe duccaritā… sabbe darathā… sabbe pariḷāhā… sabbe santāpā… sabbākusalābhisaṅkhārā mārasenā."
    ],
    "innerText": "Sa sabbadhammesu visenibhūto yaṃ kiñci diṭṭhaṃ va sutaṃ mutaṃ vāti. Senā vuccati mārasenā. Kāyaduccaritaṃ mārasenā, vacīduccaritaṃ mārasenā, manoduccaritaṃ mārasenā, rāgo… doso… moho… kodho… upanāho… makkho… paḷāso… issā… macchariyaṃ… māyā… sāṭheyyaṃ… thambho… sārambho… māno… atimāno… mado… pamādo… sabbe kilesā… sabbe duccaritā… sabbe darathā… sabbe pariḷāhā… sabbe santāpā… sabbākusalābhisaṅkhārā mārasenā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vuttañhetaṃ ",
      " bhagavatā –"
    ],
    "innerText": "Vuttañhetaṃ bhagavatā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Kāmā te paṭhamā senā, dutiyā arati vuccati…pe… ",
      ";"
    ],
    "innerText": "‘‘Kāmā te paṭhamā senā, dutiyā arati vuccati…pe… ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Na naṃ asuro jināti, jetvāva labhate sukha’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yato catūhi ariyamaggehi sabbā ca mārasenā sabbe ca paṭisenikarā kilesā jitā ca parājitā ca bhaggā vippaluggā parammukhā – so vuccati visenibhūto. So diṭṭhe visenibhūto, sute… mute ",
      "… viññāte visenibhūtoti – sa sabbadhammesu visenibhūto, yaṃ kiñci diṭṭhaṃ va sutaṃ mutaṃ vā."
    ],
    "innerText": "Yato catūhi ariyamaggehi sabbā ca mārasenā sabbe ca paṭisenikarā kilesā jitā ca parājitā ca bhaggā vippaluggā parammukhā – so vuccati visenibhūto. So diṭṭhe visenibhūto, sute… mute … viññāte visenibhūtoti – sa sabbadhammesu visenibhūto, yaṃ kiñci diṭṭhaṃ va sutaṃ mutaṃ vā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sa pannabhāro muni vippamutto"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhārā"
      },
      "ti tayo bhārā – khandhabhāro, kilesabhāro, abhisaṅkhārabhāro. Katamo khandhabhāro? Paṭisandhiyā rūpaṃ vedanā saññā saṅkhārā viññāṇaṃ – ayaṃ khandhabhāro. Katamo kilesabhāro? Rāgo doso moho…pe… sabbākusalābhisaṅkhārā – ayaṃ kilesabhāro. Katamo abhisaṅkhārabhāro? Puññābhisaṅkhāro apuññābhisaṅkhāro āneñjābhisaṅkhāro – ayaṃ abhisaṅkhārabhāro. Yato khandhabhāro ca kilesabhāro ca abhisaṅkhārabhāro ca pahīnā honti ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā, so vuccati pannabhāro patitabhāro oropitabhāro samoropitabhāro nikkhittabhāro paṭipassaddhabhāro."
    ],
    "innerText": "Sa pannabhāro muni vippamuttoti. Bhārāti tayo bhārā – khandhabhāro, kilesabhāro, abhisaṅkhārabhāro. Katamo khandhabhāro? Paṭisandhiyā rūpaṃ vedanā saññā saṅkhārā viññāṇaṃ – ayaṃ khandhabhāro. Katamo kilesabhāro? Rāgo doso moho…pe… sabbākusalābhisaṅkhārā – ayaṃ kilesabhāro. Katamo abhisaṅkhārabhāro? Puññābhisaṅkhāro apuññābhisaṅkhāro āneñjābhisaṅkhāro – ayaṃ abhisaṅkhārabhāro. Yato khandhabhāro ca kilesabhāro ca abhisaṅkhārabhāro ca pahīnā honti ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā, so vuccati pannabhāro patitabhāro oropitabhāro samoropitabhāro nikkhittabhāro paṭipassaddhabhāro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Munī"
      },
      "ti ",
      " monaṃ vuccati ñāṇaṃ. Yā paññā pajānanā vicayo pavicayo dhammavicayo sallakkhaṇā upalakkhaṇā paccupalakkhaṇā, paṇḍiccaṃ kosallaṃ nepuññaṃ vebhabyā cintā upaparikkhā bhūri medhā parināyikā vipassanā sampajaññaṃ patodo paññā paññindriyaṃ paññābalaṃ paññāsatthaṃ paññāpāsādo paññāāloko paññāobhāso paññāpajjoto paññāratanaṃ ",
      " amoho dhammavicayo sammādiṭṭhi. Tena ñāṇena samannāgato muni monappatto."
    ],
    "innerText": "Munīti monaṃ vuccati ñāṇaṃ. Yā paññā pajānanā vicayo pavicayo dhammavicayo sallakkhaṇā upalakkhaṇā paccupalakkhaṇā, paṇḍiccaṃ kosallaṃ nepuññaṃ vebhabyā cintā upaparikkhā bhūri medhā parināyikā vipassanā sampajaññaṃ patodo paññā paññindriyaṃ paññābalaṃ paññāsatthaṃ paññāpāsādo paññāāloko paññāobhāso paññāpajjoto paññāratanaṃ amoho dhammavicayo sammādiṭṭhi. Tena ñāṇena samannāgato muni monappatto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tīṇi moneyyāni – kāyamoneyyaṃ, vacīmoneyyaṃ, manomoneyyaṃ. Katamaṃ kāyamoneyyaṃ? Tividhānaṃ kāyaduccaritānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[tividhakāyaduccaritānaṃ (ka.) mahāni. 14]"
      },
      " pahānaṃ kāyamoneyyaṃ, tividhaṃ kāyasucaritaṃ kāyamoneyyaṃ, kāyārammaṇe ñāṇaṃ kāyamoneyyaṃ, kāyapariññā kāyamoneyyaṃ, pariññāsahagato maggo kāyamoneyyaṃ, kāye chandarāgassa pahānaṃ kāyamoneyyaṃ, kāyasaṅkhāranirodho catutthajjhānasamāpatti kāyamoneyyaṃ – idaṃ kāyamoneyyaṃ."
    ],
    "innerText": "Tīṇi moneyyāni – kāyamoneyyaṃ, vacīmoneyyaṃ, manomoneyyaṃ. Katamaṃ kāyamoneyyaṃ? Tividhānaṃ kāyaduccaritānaṃ [tividhakāyaduccaritānaṃ (ka.) mahāni. 14] pahānaṃ kāyamoneyyaṃ, tividhaṃ kāyasucaritaṃ kāyamoneyyaṃ, kāyārammaṇe ñāṇaṃ kāyamoneyyaṃ, kāyapariññā kāyamoneyyaṃ, pariññāsahagato maggo kāyamoneyyaṃ, kāye chandarāgassa pahānaṃ kāyamoneyyaṃ, kāyasaṅkhāranirodho catutthajjhānasamāpatti kāyamoneyyaṃ – idaṃ kāyamoneyyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katamaṃ ",
      " vacīmoneyyaṃ? Catubbidhānaṃ vacīduccaritānaṃ pahānaṃ vacīmoneyyaṃ, catubbidhaṃ vacīsucaritaṃ vacīmoneyyaṃ, vācārammaṇe ñāṇaṃ vacīmoneyyaṃ, vācāpariññā vacīmoneyyaṃ, pariññāsahagato maggo vacīmoneyyaṃ, vācāya chandarāgassa pahānaṃ vacīmoneyyaṃ, vacīsaṅkhāranirodho dutiyajjhānasamāpatti vacīmoneyyaṃ – idaṃ vacīmoneyyaṃ."
    ],
    "innerText": "Katamaṃ vacīmoneyyaṃ? Catubbidhānaṃ vacīduccaritānaṃ pahānaṃ vacīmoneyyaṃ, catubbidhaṃ vacīsucaritaṃ vacīmoneyyaṃ, vācārammaṇe ñāṇaṃ vacīmoneyyaṃ, vācāpariññā vacīmoneyyaṃ, pariññāsahagato maggo vacīmoneyyaṃ, vācāya chandarāgassa pahānaṃ vacīmoneyyaṃ, vacīsaṅkhāranirodho dutiyajjhānasamāpatti vacīmoneyyaṃ – idaṃ vacīmoneyyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katamaṃ ",
      " manomoneyyaṃ? Tividhānaṃ manoduccaritānaṃ pahānaṃ manomoneyyaṃ, tividhaṃ manosucaritaṃ manomoneyyaṃ, cittārammaṇe ",
      " ñāṇaṃ manomoneyyaṃ, cittapariññā manomoneyyaṃ, pariññāsahagato maggo manomoneyyaṃ, citte chandarāgassa pahānaṃ manomoneyyaṃ, cittasaṅkhāranirodho saññāvedayitanirodhasamāpatti manomoneyyaṃ – idaṃ manomoneyyaṃ."
    ],
    "innerText": "Katamaṃ manomoneyyaṃ? Tividhānaṃ manoduccaritānaṃ pahānaṃ manomoneyyaṃ, tividhaṃ manosucaritaṃ manomoneyyaṃ, cittārammaṇe ñāṇaṃ manomoneyyaṃ, cittapariññā manomoneyyaṃ, pariññāsahagato maggo manomoneyyaṃ, citte chandarāgassa pahānaṃ manomoneyyaṃ, cittasaṅkhāranirodho saññāvedayitanirodhasamāpatti manomoneyyaṃ – idaṃ manomoneyyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kāyamuniṃ vācāmuniṃ, manomunimanāsavaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Muniṃ moneyyasampannaṃ, āhu sabbappahāyinaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kāyamuniṃ vācāmuniṃ, manomunimanāsavaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Muniṃ moneyyasampannaṃ, āhu ninhātapāpaka’’nti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ninahātapāpakanti (sī.)]"
      },
      "."
    ],
    "innerText": "Muniṃ moneyyasampannaṃ, āhu ninhātapāpaka’’nti [ninahātapāpakanti (sī.)]."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Imehi ",
      " tīhi moneyyehi dhammehi samannāgatā cha munino ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[munayo (sī. syā. ka.)]"
      },
      " – agāramunino, anagāramunino, sekhamunino, asekhamunino, paccekamunino, munimuninoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[munimunino (sī. syā. ka.) mahāni. 14]"
      },
      ". Katame agāramunino? Ye te agārikā diṭṭhapadā viññātasāsanā – ime agāramunino. Katame anagāramunino? Ye te pabbajitā diṭṭhapadā viññātasāsanā – ime anagāramunino. Satta sekhā sekhamunino, arahanto asekhamunino. Paccekabuddhā paccekamunino. Munimunino vuccanti tathāgatā arahanto sammāsambuddhā."
    ],
    "innerText": "Imehi tīhi moneyyehi dhammehi samannāgatā cha munino [munayo (sī. syā. ka.)] – agāramunino, anagāramunino, sekhamunino, asekhamunino, paccekamunino, munimuninoti [munimunino (sī. syā. ka.) mahāni. 14]. Katame agāramunino? Ye te agārikā diṭṭhapadā viññātasāsanā – ime agāramunino. Katame anagāramunino? Ye te pabbajitā diṭṭhapadā viññātasāsanā – ime anagāramunino. Satta sekhā sekhamunino, arahanto asekhamunino. Paccekabuddhā paccekamunino. Munimunino vuccanti tathāgatā arahanto sammāsambuddhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Na monena muni hoti, mūḷharūpo aviddasu;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yo ca tulaṃva paggayha, varamādāya paṇḍito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Pāpāni ",
      " parivajjeti, sa muni tena so muni;"
    ],
    "innerText": "‘‘Pāpāni parivajjeti, sa muni tena so muni;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yo munāti ubho loke, muni tena pavuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Asatañca ",
      " satañca ñatvā dhammaṃ, ajjhattaṃ bahiddhā ca sabbaloke;"
    ],
    "innerText": "‘‘Asatañca satañca ñatvā dhammaṃ, ajjhattaṃ bahiddhā ca sabbaloke;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Devamanussehi pūjito yo, saṅgajālamaticca so muni’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vippamutto"
      },
      "ti munino rāgā cittaṃ muttaṃ vimuttaṃ suvimuttaṃ; dosā cittaṃ… mohā cittaṃ muttaṃ vimuttaṃ suvimuttaṃ…pe… sabbākusalābhisaṅkhārehi cittaṃ muttaṃ vimuttaṃ suvimuttanti – sa pannabhāro muni vippamutto."
    ],
    "innerText": "Vippamuttoti munino rāgā cittaṃ muttaṃ vimuttaṃ suvimuttaṃ; dosā cittaṃ… mohā cittaṃ muttaṃ vimuttaṃ suvimuttaṃ…pe… sabbākusalābhisaṅkhārehi cittaṃ muttaṃ vimuttaṃ suvimuttanti – sa pannabhāro muni vippamutto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na kappiyo nūparato na patthiyoti bhagavā"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kappā"
      },
      "ti dve kappā – taṇhākappo ca diṭṭhikappo ca…pe… ayaṃ taṇhākappo…pe… ayaṃ diṭṭhikappo. Tassa taṇhākappo pahīno, diṭṭhikappo paṭinissaṭṭho; taṇhākappassa pahīnattā ",
      " diṭṭhikappassa paṭinissaṭṭhattā taṇhākappaṃ ",
      " vā diṭṭhikappaṃ vā na kappeti na janeti na sañjaneti na nibbatteti nābhinibbattetīti – na kappiyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nūparato"
      },
      "ti. Sabbe bālaputhujjanā rajjanti, puthujjanakalyāṇakaṃ upādāya satta sekhā appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya āramanti viramanti paṭiviramanti, arahā ārato virato paṭivirato nikkhanto nissaṭo vippamutto visaññutto ",
      " vimariyādikatena cetasā viharatīti – na kappiyo nūparato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na patthiyo"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Patthanā"
      },
      " vuccati taṇhā. Yo rāgo sārāgo…pe… abhijjhā lobho akusalamūlaṃ. Yassesā patthanā taṇhā pahīnā samucchinnā vūpasantā paṭipassaddhā abhabbuppattikā ñāṇagginā daḍḍhā, so vuccati na patthiyo."
    ],
    "innerText": "Na kappiyo nūparato na patthiyoti bhagavāti. Kappāti dve kappā – taṇhākappo ca diṭṭhikappo ca…pe… ayaṃ taṇhākappo…pe… ayaṃ diṭṭhikappo. Tassa taṇhākappo pahīno, diṭṭhikappo paṭinissaṭṭho; taṇhākappassa pahīnattā diṭṭhikappassa paṭinissaṭṭhattā taṇhākappaṃ vā diṭṭhikappaṃ vā na kappeti na janeti na sañjaneti na nibbatteti nābhinibbattetīti – na kappiyo. Nūparatoti. Sabbe bālaputhujjanā rajjanti, puthujjanakalyāṇakaṃ upādāya satta sekhā appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya āramanti viramanti paṭiviramanti, arahā ārato virato paṭivirato nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā viharatīti – na kappiyo nūparato. Na patthiyoti. Patthanā vuccati taṇhā. Yo rāgo sārāgo…pe… abhijjhā lobho akusalamūlaṃ. Yassesā patthanā taṇhā pahīnā samucchinnā vūpasantā paṭipassaddhā abhabbuppattikā ñāṇagginā daḍḍhā, so vuccati na patthiyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhagavā"
      },
      "ti gāravādhivacanaṃ. Api ca bhaggarāgoti bhagavā, bhaggadosoti bhagavā, bhaggamohoti bhagavā, bhaggamānoti bhagavā, bhaggadiṭṭhīti bhagavā, bhaggakaṇḍakoti bhagavā, bhaggakilesoti bhagavā, bhaji vibhaji pavibhaji dhammaratananti bhagavā, bhavānaṃ antakaroti bhagavā, bhāvitakāyo bhāvitasīlo bhāvitacitto bhāvitapaññoti bhagavā; bhāgī vā bhagavā araññavanapatthāni pantāni senāsanāni appasaddāni appanigghosāni vijanavātāni manussarāhasseyyakāni paṭisallānasāruppānīti bhagavā, bhāgī vā bhagavā cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārānanti bhagavā, bhāgī vā bhagavā attharasassa dhammarasassa vimuttirasassa adhisīlassa adhicittassa adhipaññāyāti bhagavā, bhāgī vā bhagavā catunnaṃ jhānānaṃ catunnaṃ appamaññānaṃ catunnaṃ arūpasamāpattīnanti bhagavā, bhāgī vā bhagavā aṭṭhannaṃ vimokkhānaṃ aṭṭhannaṃ abhibhāyatanānaṃ navannaṃ anupubbavihārasamāpattīnanti bhagavā, bhāgī vā bhagavā ",
      " dasannaṃ saññābhāvanānaṃ dasannaṃ kasiṇasamāpattīnaṃ ānāpānassatisamādhissa asubhasamāpattiyāti ",
      " bhagavā, bhāgī vā bhagavā ",
      " catunnaṃ satipaṭṭhānānaṃ catunnaṃ sammappadhānānaṃ catunnaṃ iddhipādānaṃ pañcannaṃ indriyānaṃ pañcannaṃ balānaṃ sattannaṃ bojjhaṅgānaṃ ariyassa aṭṭhaṅgikassa maggassāti bhagavā, bhāgī vā bhagavā dasannaṃ tathāgatabalānaṃ catunnaṃ vesārajjānaṃ catunnaṃ paṭisambhidānaṃ channaṃ abhiññānaṃ channaṃ buddhadhammānanti bhagavā, bhagavāti netaṃ nāmaṃ mātarā kataṃ na pitarā kataṃ na bhātarā kataṃ na bhaginiyā kataṃ na mittāmaccehi kataṃ na ñātisālohitehi ",
      " kataṃ na samaṇabrāhmaṇehi kataṃ na devatāhi kataṃ; vimokkhantikametaṃ buddhānaṃ bhagavantānaṃ bodhiyā mūle saha sabbaññutaññāṇassa paṭilābhā sacchikā paññatti yadidaṃ bhagavāti – na kappiyo nūparato na patthiyo iti bhagavā."
    ],
    "innerText": "Bhagavāti gāravādhivacanaṃ. Api ca bhaggarāgoti bhagavā, bhaggadosoti bhagavā, bhaggamohoti bhagavā, bhaggamānoti bhagavā, bhaggadiṭṭhīti bhagavā, bhaggakaṇḍakoti bhagavā, bhaggakilesoti bhagavā, bhaji vibhaji pavibhaji dhammaratananti bhagavā, bhavānaṃ antakaroti bhagavā, bhāvitakāyo bhāvitasīlo bhāvitacitto bhāvitapaññoti bhagavā; bhāgī vā bhagavā araññavanapatthāni pantāni senāsanāni appasaddāni appanigghosāni vijanavātāni manussarāhasseyyakāni paṭisallānasāruppānīti bhagavā, bhāgī vā bhagavā cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārānanti bhagavā, bhāgī vā bhagavā attharasassa dhammarasassa vimuttirasassa adhisīlassa adhicittassa adhipaññāyāti bhagavā, bhāgī vā bhagavā catunnaṃ jhānānaṃ catunnaṃ appamaññānaṃ catunnaṃ arūpasamāpattīnanti bhagavā, bhāgī vā bhagavā aṭṭhannaṃ vimokkhānaṃ aṭṭhannaṃ abhibhāyatanānaṃ navannaṃ anupubbavihārasamāpattīnanti bhagavā, bhāgī vā bhagavā dasannaṃ saññābhāvanānaṃ dasannaṃ kasiṇasamāpattīnaṃ ānāpānassatisamādhissa asubhasamāpattiyāti bhagavā, bhāgī vā bhagavā catunnaṃ satipaṭṭhānānaṃ catunnaṃ sammappadhānānaṃ catunnaṃ iddhipādānaṃ pañcannaṃ indriyānaṃ pañcannaṃ balānaṃ sattannaṃ bojjhaṅgānaṃ ariyassa aṭṭhaṅgikassa maggassāti bhagavā, bhāgī vā bhagavā dasannaṃ tathāgatabalānaṃ catunnaṃ vesārajjānaṃ catunnaṃ paṭisambhidānaṃ channaṃ abhiññānaṃ channaṃ buddhadhammānanti bhagavā, bhagavāti netaṃ nāmaṃ mātarā kataṃ na pitarā kataṃ na bhātarā kataṃ na bhaginiyā kataṃ na mittāmaccehi kataṃ na ñātisālohitehi kataṃ na samaṇabrāhmaṇehi kataṃ na devatāhi kataṃ; vimokkhantikametaṃ buddhānaṃ bhagavantānaṃ bodhiyā mūle saha sabbaññutaññāṇassa paṭilābhā sacchikā paññatti yadidaṃ bhagavāti – na kappiyo nūparato na patthiyo iti bhagavā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sa sabbadhammesu visenibhūto, yaṃ kiñci diṭṭhaṃ va sutaṃ mutaṃ vā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sa pannabhāro muni vippamutto, na kappiyo nūparato na patthiyo’’.[iti bhagavāti]"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Mahāviyūhasuttaniddeso terasamo."
  }
]