[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "15. Piyadassībuddhavaṃsavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sujātassa ",
      " pana aparabhāge ito aṭṭhakappasatādhikasahassakappamatthake ekasmiṃ kappe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "piyadassī, atthadassī, dhammadassī"
      },
      "ti tayo buddhā nibbattiṃsu. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "piyadassī"
      },
      " nāma bhagavā pāramiyo pūretvā tusitapure nibbattitvā tato cavitvā sudhaññavatīnagare sudattassa nāma rañño aggamahesiyā ",
      " candasadisavadanāya candādeviyā nāma kucchismiṃ paṭisandhiṃ gahetvā dasannaṃ māsānaṃ accayena varuṇuyyāne mātukucchito nikkhami. Tassa pana nāmaggahaṇadivase lokassa piyānaṃ pāṭihāriyavisesānaṃ dassitattā ‘‘piyadassī’’tveva nāmamakaṃsu. So navavassasahassāni agāraṃ ajjhāvasi. Tassa kira sunimmalavimalagiribrahānāmakā tayo pāsādā ahesuṃ. Vimalāmahādevippamukhāni tettiṃsa itthisahassāni paccupaṭṭhitāni ahesuṃ."
    ],
    "innerText": "Sujātassa pana aparabhāge ito aṭṭhakappasatādhikasahassakappamatthake ekasmiṃ kappe piyadassī, atthadassī, dhammadassīti tayo buddhā nibbattiṃsu. Tattha piyadassī nāma bhagavā pāramiyo pūretvā tusitapure nibbattitvā tato cavitvā sudhaññavatīnagare sudattassa nāma rañño aggamahesiyā candasadisavadanāya candādeviyā nāma kucchismiṃ paṭisandhiṃ gahetvā dasannaṃ māsānaṃ accayena varuṇuyyāne mātukucchito nikkhami. Tassa pana nāmaggahaṇadivase lokassa piyānaṃ pāṭihāriyavisesānaṃ dassitattā ‘‘piyadassī’’tveva nāmamakaṃsu. So navavassasahassāni agāraṃ ajjhāvasi. Tassa kira sunimmalavimalagiribrahānāmakā tayo pāsādā ahesuṃ. Vimalāmahādevippamukhāni tettiṃsa itthisahassāni paccupaṭṭhitāni ahesuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "So cattāri nimittāni disvā vimalādeviyā kañcanaveḷe nāma putte uppanne ājaññarathena mahābhinikkhamanaṃ nikkhamitvā pabbaji. Ekā ca naṃ purisakoṭi anupabbaji. So tehi parivuto mahāpuriso cha māse padhānacariyaṃ caritvā visākhapuṇṇamāya varuṇabrāhmaṇagāme vasabhabrāhmaṇassa dhītāya dinnaṃ madhupāyāsaṃ paribhuñjitvā sālavane divāvihāraṃ vītināmetvā sujātājīvakena dinnā aṭṭha tiṇamuṭṭhiyo gahetvā kakudhabodhiṃ upasaṅkamitvā tepaññāsahatthavitthataṃ tiṇasantharaṃ santharitvā pallaṅkaṃ ābhujitvā sabbaññutaññāṇaṃ paṭivijjhitvā ‘‘anekajātisaṃsāra’’nti udānaṃ udānetvā tattheva sattasattāhaṃ vītināmetvā attanā saha pabbajitānaṃ ariyadhammapaṭivedhasamatthataṃ ñatvā ākāsena tattha gantvā usabhavatīnagarasamīpe usabhavatuyyāne otaritvā bhikkhukoṭiparivuto dhammacakkaṃ pavattesi. Tadā koṭisatasahassānaṃ dhammābhisamayo ahosi. Ayaṃ paṭhamo abhisamayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Puna ",
      " usabhavatiyā nāma nagarassa avidūre sudassanapabbate sudassano nāma devarājā paṭivasati. So micchādiṭṭhiko ahosi. Sakalajambudīpe pana manussā tassa anusaṃvaccharaṃ satasahassagghanikaṃ baliṃ upasaṃharanti. So sudassano devarājā nararājena saddhiṃ ekāsane nisīditvā baliṃ sampaṭicchati. Atha piyadassī bhagavā ‘‘tassa sudassanassa devarājassa taṃ diṭṭhigataṃ ",
      " vinodessāmī’’ti tasmiṃ devarāje yakkhasamāgamaṃ gate tassa bhavanaṃ pavisitvā sirisayanaṃ āruhitvā chabbaṇṇaraṃsiyo muñcanto yugandharapabbate saradasamaye sūriyo viya nisīdi. Tassa parivāraparicārikā devatāyo mālāgandhavilepanādīhi dasabalaṃ pūjetvā parivāretvā aṭṭhaṃsu."
    ],
    "innerText": "Puna usabhavatiyā nāma nagarassa avidūre sudassanapabbate sudassano nāma devarājā paṭivasati. So micchādiṭṭhiko ahosi. Sakalajambudīpe pana manussā tassa anusaṃvaccharaṃ satasahassagghanikaṃ baliṃ upasaṃharanti. So sudassano devarājā nararājena saddhiṃ ekāsane nisīditvā baliṃ sampaṭicchati. Atha piyadassī bhagavā ‘‘tassa sudassanassa devarājassa taṃ diṭṭhigataṃ vinodessāmī’’ti tasmiṃ devarāje yakkhasamāgamaṃ gate tassa bhavanaṃ pavisitvā sirisayanaṃ āruhitvā chabbaṇṇaraṃsiyo muñcanto yugandharapabbate saradasamaye sūriyo viya nisīdi. Tassa parivāraparicārikā devatāyo mālāgandhavilepanādīhi dasabalaṃ pūjetvā parivāretvā aṭṭhaṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sudassanopi ",
      " devarājā yakkhasamāgamato āgacchanto attano bhavanato chabbaṇṇarasmiyo niccharante disvā cintesi – ‘‘aññesu pana divasesu mama bhavanassa edisī anekaraṃsijālasamujjalavibhūti na diṭṭhapubbā. Ko nu kho idha paviṭṭho devo vā manusso vā’’ti olokento udayagirisikharamatthake saradasamayadivasakaramiva chabbaṇṇaraṃsijālena abhijjalantaṃ nisinnaṃ bhagavantaṃ disvā cintesi – ‘‘ayaṃ muṇḍakasamaṇo mama parivārena parijanena parivuto varasayane nisinno’’ti kodhābhibhūtamānaso – ‘‘handāhaṃ imassa attano balaṃ dassessāmī’’ti cintetvā sakalaṃ taṃ pabbataṃ ekajālamakāsi. ‘‘Iminā aggijālena chārikābhūto muṇḍakasamaṇo’’ti olokento anekaraṃsijālavisaravipphuritavarasarīraṃ pasannavadanavaṇṇasobhaṃ vippasannacchavirāgaṃ dasabalamabhijjalantaṃ disvā cintesi – ‘‘ayaṃ samaṇo aggidāhaṃ sahati, handāhaṃ imaṃ samaṇaṃ udakoghena osādetvā māressāmī’’ti atigambhīraṃ udakoghaṃ vimānābhimukhaṃ pavattesi."
    ],
    "innerText": "Sudassanopi devarājā yakkhasamāgamato āgacchanto attano bhavanato chabbaṇṇarasmiyo niccharante disvā cintesi – ‘‘aññesu pana divasesu mama bhavanassa edisī anekaraṃsijālasamujjalavibhūti na diṭṭhapubbā. Ko nu kho idha paviṭṭho devo vā manusso vā’’ti olokento udayagirisikharamatthake saradasamayadivasakaramiva chabbaṇṇaraṃsijālena abhijjalantaṃ nisinnaṃ bhagavantaṃ disvā cintesi – ‘‘ayaṃ muṇḍakasamaṇo mama parivārena parijanena parivuto varasayane nisinno’’ti kodhābhibhūtamānaso – ‘‘handāhaṃ imassa attano balaṃ dassessāmī’’ti cintetvā sakalaṃ taṃ pabbataṃ ekajālamakāsi. ‘‘Iminā aggijālena chārikābhūto muṇḍakasamaṇo’’ti olokento anekaraṃsijālavisaravipphuritavarasarīraṃ pasannavadanavaṇṇasobhaṃ vippasannacchavirāgaṃ dasabalamabhijjalantaṃ disvā cintesi – ‘‘ayaṃ samaṇo aggidāhaṃ sahati, handāhaṃ imaṃ samaṇaṃ udakoghena osādetvā māressāmī’’ti atigambhīraṃ udakoghaṃ vimānābhimukhaṃ pavattesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tato udakoghena puṇṇe tasmiṃ vimāne nisinnassa tassa bhagavato cīvare aṃsumattaṃ vā sarīre lomamattaṃ vā na temittha. Tato sudassano devarājā – ‘‘iminā samaṇo nirassāso mato bhavissatī’’ti mantvā udakaṃ saṅkhipitvā olokento bhagavantaṃ asitajaladharavivaragataṃ saradasamayarajanikaramiva vividharaṃsijālavisarena virocamānaṃ sakaparisaparivutaṃ nisinnaṃ disvā attano makkhaṃ asahamāno – ‘‘handa māressāmi na’’nti kodhena navavidhaāvudhavassaṃ vassesi. Athassa bhagavato ānubhāvena sabbāvudhāni nānāvidhaparamaruciradassanā surabhikusumamālā hutvā dasabalassa pādamūle nipatiṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tato taṃ acchariyaṃ disvā sudassano devarājā paramakupitamānaso bhagavantaṃ ubhohi hatthehi pādesu gahetvā attano bhavanato nīharitukāmo ukkhipitvā mahāsamuddaṃ atikkamitvā cakkavāḷapabbataṃ gantvā – ‘‘kiṃ nu kho samaṇo jīvati vā mato vā’’ti olokento tasmiṃyeva āsane nisinnaṃ disvā – ‘‘aho mahānubhāvo ayaṃ samaṇo, nāhaṃ imaṃ samaṇaṃ ito ",
      " nikkaḍḍhituṃ sakkomi. Yadi ",
      " hi maṃ koci jānissati, anappako me ayaso bhavissati. Yāvimaṃ koci ",
      " na passati, tāva naṃ vissajjetvā gamissāmī’’ti cintesi."
    ],
    "innerText": "Tato taṃ acchariyaṃ disvā sudassano devarājā paramakupitamānaso bhagavantaṃ ubhohi hatthehi pādesu gahetvā attano bhavanato nīharitukāmo ukkhipitvā mahāsamuddaṃ atikkamitvā cakkavāḷapabbataṃ gantvā – ‘‘kiṃ nu kho samaṇo jīvati vā mato vā’’ti olokento tasmiṃyeva āsane nisinnaṃ disvā – ‘‘aho mahānubhāvo ayaṃ samaṇo, nāhaṃ imaṃ samaṇaṃ ito nikkaḍḍhituṃ sakkomi. Yadi hi maṃ koci jānissati, anappako me ayaso bhavissati. Yāvimaṃ koci na passati, tāva naṃ vissajjetvā gamissāmī’’ti cintesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha dasabalo tassa cittācāraṃ ñatvā tathā adhiṭṭhāsi, yathā naṃ sabbe devamanussā passanti. Tasmiñca divase sakalajambudīpe ekasatarājāno tasseva upahāradānatthāya sannipatiṃsu. Te bhagavato pāde gahetvā nisinnaṃ sudassanaṃ devarājānaṃ nararājāno disvā – ‘‘amhākaṃ devarājā munirājassa piyadassissa satthuno pādaparicariyaṃ karoti, aho buddhā nāma acchariyā, aho buddhaguṇā visiṭṭhā’’ti bhagavati, pasannacittā sabbe bhagavantaṃ namassamānā sirasmiṃ añjaliṃ katvā aṭṭhaṃsu. Tattha piyadassī bhagavā taṃ sudassanaṃ devarājānaṃ pamukhaṃ katvā dhammaṃ desesi. Tadā devamanussānaṃ navutikoṭisahassāni arahattaṃ pāpuṇiṃsu. So dutiyo abhisamayo ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yadā pana navayojanappamāṇe kumudanagare buddhapaccatthiko devadatto viya soṇatthero nāma mahāpadumakumārena saddhiṃ mantetvā tassa pitaraṃ ghātetvā puna piyadassībuddhassa vadhāya nānappakāraṃ payogaṃ katvāpi ghātetuṃ asakkonto so doṇamukhanāgarājārohaṃ pakkosāpetvā taṃ palobhetvā tamatthaṃ ārocesi – ‘‘yadā panāyaṃ samaṇo piyadassī imaṃ nagaraṃ piṇḍāya pavisati, tadā doṇamukhaṃ nāma gajavaraṃ vissajjetvā piyadassīsamaṇaṃ mārehī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha so āroho hitāhitavicāraṇarahito rājavallabho – ‘‘ayaṃ samaṇo ṭhānantarāpi maṃ cāveyyā’’ti mantvā ‘‘sādhū’’ti sampaṭicchitvā dutiyadivase dasabalassa nagarappavesanasamayaṃ sallakkhetvā sujātamatthakapiṇḍakumbhanalāṭaṃ dhanusadisadīghasuṇḍataṭaṃ suvipulamudukaṇṇaṃ madhupiṅgalanayanaṃ sundarakkhandhāsanaṃ anuvaṭṭaghanajaghanaṃ nicitagūḷhajāṇuantaraṃ īsāsadisaruciradantaṃ suvāladhiṃ apacitamecakaṃ sabbalakkhaṇasampannaṃ asitajaladharasadisacārudassanaṃ sīhavikkantalalitagāminaṃ jaṅgamamiva dharādharaṃ sattappatiṭṭhaṃ sattadhā pabhinnaṃ sabbaso vissavantaṃ viggahavantamiva antakaṃ upasaṅkamitvā piṇḍakabaḷañjanadhūpalepādivisesehi bhiyyopi mattappamattaṃ katvā arivāraṇavāraṇaṃ erāvaṇavāraṇamiva arijanavāraṇaṃ munivāraṇaṃ māraṇatthāya pesesi. Atha ",
      " so dviradavaro muttamattova gajamahiṃsaturaṅganaranāriyo hantvā hatarudhiraparirañjitasadantakarasarīro antajālapariyonaddhanayano sakaṭakavāṭakūṭāgāradvāratoraṇādīni bhañjitvā kāka-kulala-gijjhādīhi anupariyāyamāno hatamahiṃsanaraturaṅgadiradādīnaṃ aṅgāni ālumpitvā manussabhakkho ",
      " yakkho viya bhakkhayanto dūratova dasabalaṃ sissagaṇaparivutaṃ āgacchantaṃ disvā anilagaruḷasadisavego vegena bhagavantamabhigañchi."
    ],
    "innerText": "Atha so āroho hitāhitavicāraṇarahito rājavallabho – ‘‘ayaṃ samaṇo ṭhānantarāpi maṃ cāveyyā’’ti mantvā ‘‘sādhū’’ti sampaṭicchitvā dutiyadivase dasabalassa nagarappavesanasamayaṃ sallakkhetvā sujātamatthakapiṇḍakumbhanalāṭaṃ dhanusadisadīghasuṇḍataṭaṃ suvipulamudukaṇṇaṃ madhupiṅgalanayanaṃ sundarakkhandhāsanaṃ anuvaṭṭaghanajaghanaṃ nicitagūḷhajāṇuantaraṃ īsāsadisaruciradantaṃ suvāladhiṃ apacitamecakaṃ sabbalakkhaṇasampannaṃ asitajaladharasadisacārudassanaṃ sīhavikkantalalitagāminaṃ jaṅgamamiva dharādharaṃ sattappatiṭṭhaṃ sattadhā pabhinnaṃ sabbaso vissavantaṃ viggahavantamiva antakaṃ upasaṅkamitvā piṇḍakabaḷañjanadhūpalepādivisesehi bhiyyopi mattappamattaṃ katvā arivāraṇavāraṇaṃ erāvaṇavāraṇamiva arijanavāraṇaṃ munivāraṇaṃ māraṇatthāya pesesi. Atha so dviradavaro muttamattova gajamahiṃsaturaṅganaranāriyo hantvā hatarudhiraparirañjitasadantakarasarīro antajālapariyonaddhanayano sakaṭakavāṭakūṭāgāradvāratoraṇādīni bhañjitvā kāka-kulala-gijjhādīhi anupariyāyamāno hatamahiṃsanaraturaṅgadiradādīnaṃ aṅgāni ālumpitvā manussabhakkho yakkho viya bhakkhayanto dūratova dasabalaṃ sissagaṇaparivutaṃ āgacchantaṃ disvā anilagaruḷasadisavego vegena bhagavantamabhigañchi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha puravāsino pana janā bhayasantāpaparipūritamānasā pāsādapākāracayatarūpagatā tathāgatābhimukhamabhidhāvantaṃ disvā hāhākārasaddamakaṃsu. Keci ",
      " pana upāsakā taṃ nānappakārehi nayehi nivārayitumārabhiṃsu. Atha so buddhanāgo hatthināgamāyantamoloketvā karuṇāvipphārasītalahadayo mettāya taṃ phari. Tato so hatthināgo mettāpharaṇena mudukatahadayasantāno attano dosāparādhaṃ ñatvā lajjāya bhagavato purato ṭhātuṃ asakkonto pathaviyaṃ pavisanto viya sirasā bhagavato pādesu nipati. Evaṃ nipanno pana so timiranikarasadisasarīro sañchāppabhānurañjitavarakanakagirisikharasamīpamupagato asitasaliladharanikaro viya virocittha."
    ],
    "innerText": "Atha puravāsino pana janā bhayasantāpaparipūritamānasā pāsādapākāracayatarūpagatā tathāgatābhimukhamabhidhāvantaṃ disvā hāhākārasaddamakaṃsu. Keci pana upāsakā taṃ nānappakārehi nayehi nivārayitumārabhiṃsu. Atha so buddhanāgo hatthināgamāyantamoloketvā karuṇāvipphārasītalahadayo mettāya taṃ phari. Tato so hatthināgo mettāpharaṇena mudukatahadayasantāno attano dosāparādhaṃ ñatvā lajjāya bhagavato purato ṭhātuṃ asakkonto pathaviyaṃ pavisanto viya sirasā bhagavato pādesu nipati. Evaṃ nipanno pana so timiranikarasadisasarīro sañchāppabhānurañjitavarakanakagirisikharasamīpamupagato asitasaliladharanikaro viya virocittha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Athevaṃ munirājapādamūle karirājānaṃ sirasā nipatantaṃ disvā nāgarajanā paramapītipūritahadayā sādhukārasīhanādaṃ ukkuṭṭhisaddaṃ pavattayiṃsu. Surabhikusumamālācandanagandhacuṇṇālaṅkārādīhi taṃ anekappakāraṃ pūjesuṃ. Samantato celukkhepā pavattiṃsu. Gaganatale suradundubhiyo abhinadiṃsu. Atha bhagavā tamasitagirisikharamiva pādamūle nipannaṃ diradavaraṃ oloketvā aṅkusadhajajālasaṅkhacakkālaṅkatena karatalena gajavaramatthakaṃ parāmasitvā tassa cittācārānukūlāya dhammadesanāya taṃ anusāsi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Gajavara vadato suṇohi vācaṃ, mama hitamatthayutañca taṃ bhajāhi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tava vadhanirataṃ paduṭṭhabhāvaṃ, apanaya santamupehi cārudanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Lobhena ",
      " dosena ca mohato vā, yo pāṇino hiṃsati vāraṇinda;"
    ],
    "innerText": "‘‘Lobhena dosena ca mohato vā, yo pāṇino hiṃsati vāraṇinda;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "So pāṇaghātī sucirampi kālaṃ, dukkhaṃ sughoraṃ narakenubhoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Mākāsi mātaṅga punevarūpaṃ, kammaṃ pamādena madena vāpi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Avīciyaṃ dukkhamasayha kappaṃ, pappoti pāṇaṃ atipātayanto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Dukkhaṃ sughoraṃ narakenubhotvā, manussalokaṃ yadi yāti bhiyyo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Appāyuko hoti virūparūpo, vihiṃsako dukkhavisesabhāgī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Yathā ",
      " ca pāṇā paramaṃ piyā te, mahājane kuñjara mandanāga;"
    ],
    "innerText": "‘‘Yathā ca pāṇā paramaṃ piyā te, mahājane kuñjara mandanāga;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tathā parassāpi piyāti ñatvā, pāṇātipāto parivajjanīyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Dose ",
      " ca hiṃsānirate viditvā, pāṇātipātā virate guṇe ca;"
    ],
    "innerText": "‘‘Dose ca hiṃsānirate viditvā, pāṇātipātā virate guṇe ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pāṇātipātaṃ parivajjaya tvaṃ, sagge sukhaṃ icchasi ce parattha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Pāṇātipātā virato sudanto, piyo manāpo bhavatīdha loke;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kāyassa bhedā ca paraṃ panassa, saggādhivāsaṃ kathayanti buddhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Dukkhāgamaṃ nicchati koci loke, sabbopi jāto sukhamesateva;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tasmā mahānāga vihāya hiṃsaṃ, bhāvehi mettaṃ karuṇañca kāle’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Athevaṃ ",
      " dasabalenānusāsiyamāno dantivaro saññaṃ paṭilabhitvā paramavinīto vinayācārasampanno sisso viya ahosi. Evaṃ so piyadassī bhagavā amhākaṃ satthā viya dhanapālaṃ doṇamukhaṃ karivaraṃ damitvā tattha mahājanasamāgame dhammaṃ desesi. Tadā asītikoṭisahassānaṃ dhammābhisamayo ahosi. Ayaṃ tatiyo abhisamayo ahosi. Tena vuttaṃ –"
    ],
    "innerText": "Athevaṃ dasabalenānusāsiyamāno dantivaro saññaṃ paṭilabhitvā paramavinīto vinayācārasampanno sisso viya ahosi. Evaṃ so piyadassī bhagavā amhākaṃ satthā viya dhanapālaṃ doṇamukhaṃ karivaraṃ damitvā tattha mahājanasamāgame dhammaṃ desesi. Tadā asītikoṭisahassānaṃ dhammābhisamayo ahosi. Ayaṃ tatiyo abhisamayo ahosi. Tena vuttaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      "."
    ],
    "innerText": "1."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sujātassa aparena, sayambhū lokanāyako;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Durāsado asamasamo, piyadassī mahāyaso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "2"
      },
      "."
    ],
    "innerText": "2."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sopi buddho amitayaso, ādiccova virocati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sabbaṃ tamaṃ nihantvāna, dhammacakkaṃ pavattayi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "3"
      },
      "."
    ],
    "innerText": "3."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tassāpi atulatejassa, ahesuṃ abhisamayā tayo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Koṭisatasahassānaṃ, paṭhamābhisamayo ahu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "4"
      },
      "."
    ],
    "innerText": "4."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sudassano devarājā, micchādiṭṭhimarocayi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tassa diṭṭhiṃ vinodento, satthā dhammamadesayi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "5"
      },
      "."
    ],
    "innerText": "5."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " ‘‘Janasannipāto ",
      " atulo, mahāsannipatī tadā;"
    ],
    "innerText": "‘‘Janasannipāto atulo, mahāsannipatī tadā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Navutikoṭisahassānaṃ, dutiyābhisamayo ahu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "6"
      },
      "."
    ],
    "innerText": "6."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yadā doṇamukhaṃ hatthiṃ, vinesi narasārathi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Asītikoṭisahassānaṃ, tatiyābhisamayo ahū’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sumaṅgalanagare pālito nāma rājaputto ca purohitaputto sabbadassikumāro cāti dve sahāyakā ahesuṃ. Te piyadassimhi sammāsambuddhe cārikaṃ carante ‘‘attano nagaraṃ sampatto’’ti sutvā koṭisatasahassaparivārā paccuggamanaṃ katvā tassa dhammaṃ sutvā sattāhaṃ ",
      " mahādānaṃ datvā sattame divase bhagavato bhattānumodanāvasāne koṭisatasahassehi saddhiṃ pabbajitvā arahattaṃ pāpuṇiṃsu. Tesaṃ pana majjhe bhagavā pātimokkhaṃ uddisi, so paṭhamo sannipāto ahosi. Athāparena samayena sudassanadevarājassa samāgame navutikoṭiyo arahattaṃ pāpuṇiṃsu. Tehi parivuto satthā pātimokkhaṃ uddisi, ayaṃ dutiyo ",
      " sannipāto ahosi. Puna doṇamukhavinayane asītikoṭiyo pabbajitvā arahattaṃ pāpuṇiṃsu. Tesaṃ majjhe bhagavā pātimokkhaṃ uddisi, ayaṃ tatiyo sannipāto ahosi. Tena vuttaṃ –"
    ],
    "innerText": "Sumaṅgalanagare pālito nāma rājaputto ca purohitaputto sabbadassikumāro cāti dve sahāyakā ahesuṃ. Te piyadassimhi sammāsambuddhe cārikaṃ carante ‘‘attano nagaraṃ sampatto’’ti sutvā koṭisatasahassaparivārā paccuggamanaṃ katvā tassa dhammaṃ sutvā sattāhaṃ mahādānaṃ datvā sattame divase bhagavato bhattānumodanāvasāne koṭisatasahassehi saddhiṃ pabbajitvā arahattaṃ pāpuṇiṃsu. Tesaṃ pana majjhe bhagavā pātimokkhaṃ uddisi, so paṭhamo sannipāto ahosi. Athāparena samayena sudassanadevarājassa samāgame navutikoṭiyo arahattaṃ pāpuṇiṃsu. Tehi parivuto satthā pātimokkhaṃ uddisi, ayaṃ dutiyo sannipāto ahosi. Puna doṇamukhavinayane asītikoṭiyo pabbajitvā arahattaṃ pāpuṇiṃsu. Tesaṃ majjhe bhagavā pātimokkhaṃ uddisi, ayaṃ tatiyo sannipāto ahosi. Tena vuttaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "7"
      },
      "."
    ],
    "innerText": "7."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sannipātā tayo āsuṃ, tassāpi piyadassino;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Koṭisatasahassānaṃ, paṭhamo āsi samāgamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "8"
      },
      "."
    ],
    "innerText": "8."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tato paraṃ navutikoṭī, samiṃsu ekato munī;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tatiye sannipātamhi, asītikoṭiyo ahū’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tadā amhākaṃ bodhisatto kassapo nāma brāhmaṇamāṇavo itihāsapañcamānaṃ tiṇṇaṃ vedānaṃ pāragū hutvā satthu dhammadesanaṃ sutvā koṭisatasahassapariccāgena paramārāmaṃ saṅghārāmaṃ kāretvā saraṇesu ca pañcasīlesu ca patiṭṭhāsi. Atha naṃ satthā – ‘‘ito aṭṭhārasakappasataccayena gotamo nāma buddho loke bhavissatī’’ti byākāsi. Tena vuttaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "9"
      },
      "."
    ],
    "innerText": "9."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ahaṃ tena samayena, kassapo nāma brāhmaṇo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ajjhāyako mantadharo, tiṇṇaṃ vedāna pāragū."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "10"
      },
      "."
    ],
    "innerText": "10."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " ‘‘Tassa ",
      " dhammaṃ suṇitvāna, pasādaṃ janayiṃ ahaṃ;"
    ],
    "innerText": "‘‘Tassa dhammaṃ suṇitvāna, pasādaṃ janayiṃ ahaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Koṭisatasahassehi, saṅghārāmaṃ amāpayiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "11"
      },
      "."
    ],
    "innerText": "11."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tassa datvāna ārāmaṃ, haṭṭho saṃviggamānaso;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Saraṇe pañcasīle ca, daḷahaṃ katvā samādiyiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "12"
      },
      "."
    ],
    "innerText": "12."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sopi maṃ buddho byākāsi, saṅghamajjhe nisīdiya;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Aṭṭhārase kappasate, ayaṃ buddho bhavissati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "13"
      },
      "."
    ],
    "innerText": "13."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Padhānaṃ padahitvāna…pe… hessāma sammukhā imaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "14"
      },
      "."
    ],
    "innerText": "14."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tassāpi vacanaṃ sutvā, bhiyyo cittaṃ pasādayiṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Uttariṃ vatamadhiṭṭhāsiṃ, dasapāramipūriyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saraṇe pañcasīle cā"
      },
      "ti tīṇi saraṇāni pañca sīlāni cāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭhārase kappasate"
      },
      "ti ito aṭṭhasatādhikassa kappasahassassa accayenāti attho."
    ],
    "innerText": "Tattha saraṇe pañcasīle cāti tīṇi saraṇāni pañca sīlāni cāti attho. Aṭṭhārase kappasateti ito aṭṭhasatādhikassa kappasahassassa accayenāti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tassa ",
      " pana bhagavato sudhaññaṃ nāma nagaraṃ ahosi. Pitā sudatto nāma rājā, mātā sucandā nāma devī, pālito ca sabbadassī ca dve aggasāvakā, sobhito nāmupaṭṭhāko, sujātā ca dhammadinnā ca dve aggasāvikā, kakudharukkho bodhi, sarīraṃ asītihatthubbedhaṃ ahosi, navutivassasahassāni āyu, vimalā nāmassa aggamahesī ahosi, kañcanāveḷo nāma putto, so ājaññarathena nikkhamīti. Tena vuttaṃ –"
    ],
    "innerText": "Tassa pana bhagavato sudhaññaṃ nāma nagaraṃ ahosi. Pitā sudatto nāma rājā, mātā sucandā nāma devī, pālito ca sabbadassī ca dve aggasāvakā, sobhito nāmupaṭṭhāko, sujātā ca dhammadinnā ca dve aggasāvikā, kakudharukkho bodhi, sarīraṃ asītihatthubbedhaṃ ahosi, navutivassasahassāni āyu, vimalā nāmassa aggamahesī ahosi, kañcanāveḷo nāma putto, so ājaññarathena nikkhamīti. Tena vuttaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "15"
      },
      "."
    ],
    "innerText": "15."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sudhaññaṃ nāma nagaraṃ, sudatto nāma khattiyo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Candā nāmāsi janikā, piyadassissa satthuno."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "20"
      },
      "."
    ],
    "innerText": "20."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Pālito sabbadassī ca, ahesuṃ aggasāvakā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sobhito nāmupaṭṭhāko, piyadassissa satthuno."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "21"
      },
      "."
    ],
    "innerText": "21."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " ‘‘Sujātā ",
      " dhammadinnā ca, ahesuṃ aggasāvikā;"
    ],
    "innerText": "‘‘Sujātā dhammadinnā ca, ahesuṃ aggasāvikā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bodhi tassa bhagavato, kakudhoti pavuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "23"
      },
      "."
    ],
    "innerText": "23."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sopi buddho amitayaso, dvattiṃsavaralakkhaṇo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Asītihatthamubbedho, sālarājāva dissati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "24"
      },
      "."
    ],
    "innerText": "24."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Aggicandasūriyānaṃ, natthi tādisikā pabhā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yathā ahu pabhā tassa, asamassa mahesino."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "25"
      },
      "."
    ],
    "innerText": "25."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tassāpi devadevassa, āyu tāvatakaṃ ahu;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Navutivassasahassāni, loke aṭṭhāsi cakkhumā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "26"
      },
      "."
    ],
    "innerText": "26."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sopi buddho asamasamo, yugānipi tāni atuliyāni;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sabbaṃ tamantarahitaṃ, nanu rittā sabbasaṅkhārā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sālarājā vā"
      },
      "ti sabbaphāliphullo paramaramaṇīyadassano samavaṭṭakkhandho sālarājā viya dissati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yugānipi tānī"
      },
      "ti aggasāvakayugādīni yugaḷāni. Sesagāthāsu sabbattha uttānamevāti."
    ],
    "innerText": "Tattha sālarājā vāti sabbaphāliphullo paramaramaṇīyadassano samavaṭṭakkhandho sālarājā viya dissati. Yugānipi tānīti aggasāvakayugādīni yugaḷāni. Sesagāthāsu sabbattha uttānamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Piyadassībuddhavaṃsavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Niṭṭhito terasamo buddhavaṃso."
  }
]