[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "3. Subhūtivaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Subhūtittheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Himavantassāvidūre"
      },
      "tiādikaṃ ",
      " āyasmato subhūtittherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto ito kappasatasahassamatthake anuppanneyeva padumuttare bhagavati lokanāthe haṃsavatīnagare ",
      " aññatarassa brāhmaṇamahāsālassa ekaputtako hutvā nibbatti, tassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nandamāṇavo"
      },
      "ti nāmaṃ akaṃsu. So vayappatto tayo vede uggaṇhitvā tattha sāraṃ apassanto attano parivārabhūtehi catucattālīsāya māṇavasahassehi saddhiṃ pabbatapāde isipabbajjaṃ pabbajitvā aṭṭha samāpattiyo pañcābhiññāyo ca nibbattesi. Antevāsikānampi kammaṭṭhānaṃ ācikkhi. Tepi nacirasseva jhānalābhino ahesuṃ."
    ],
    "innerText": "Himavantassāvidūretiādikaṃ āyasmato subhūtittherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto ito kappasatasahassamatthake anuppanneyeva padumuttare bhagavati lokanāthe haṃsavatīnagare aññatarassa brāhmaṇamahāsālassa ekaputtako hutvā nibbatti, tassa nandamāṇavoti nāmaṃ akaṃsu. So vayappatto tayo vede uggaṇhitvā tattha sāraṃ apassanto attano parivārabhūtehi catucattālīsāya māṇavasahassehi saddhiṃ pabbatapāde isipabbajjaṃ pabbajitvā aṭṭha samāpattiyo pañcābhiññāyo ca nibbattesi. Antevāsikānampi kammaṭṭhānaṃ ācikkhi. Tepi nacirasseva jhānalābhino ahesuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena ca samayena padumuttaro bhagavā loke uppajjitvā haṃsavatīnagaraṃ upanissāya viharanto ekadivasaṃ paccūsasamaye lokaṃ volokento nandatāpasassa antevāsikajaṭilānaṃ arahattūpanissayaṃ, nandatāpasassa ca dvīhaṅgehi samannāgatassa sāvakaṭṭhānantarassa patthanaṃ disvā pātova sarīrapaṭijagganaṃ katvā pubbaṇhasamaye pattacīvaramādāya aññaṃ kañci anāmantetvā sīho viya ekacaro nandatāpasassa antevāsikesu phalāphalatthāya gatesu ‘‘buddhabhāvaṃ me jānātū’’ti passantasseva nandatāpasassa ākāsato otaritvā pathaviyaṃ patiṭṭhāsi. Nandatāpaso buddhānubhāvañceva lakkhaṇapāripūriñca disvā lakkhaṇamante sammasitvā ‘‘imehi lakkhaṇehi samannāgato nāma agāraṃ ajjhāvasanto rājā hoti cakkavattī, pabbajanto loke vivaṭacchedo ",
      " sabbaññū buddho hoti, ayaṃ purisājānīyo nissaṃsayaṃ buddho’’ti ñatvā paccuggamanaṃ katvā pañcapatiṭṭhitena vanditvā āsanaṃ paññāpetvā adāsi. Nisīdi bhagavā paññatte āsane. Nandatāpasopi attano anucchavikaṃ āsanaṃ gahetvā ekamantaṃ nisīdi. Tasmiṃ samaye catucattālīsasahassajaṭilā paṇītapaṇītāni ojavantāni phalāphalāni gahetvā ācariyassa santikaṃ sampattā buddhānañceva ācariyassa ca nisinnākāraṃ oloketvā āhaṃsu – ‘‘ācariya, mayaṃ ‘imasmiṃ loke tumhehi mahantataro natthī’ti vicarāma, ayaṃ pana puriso tumhehi mahantataro maññe’’ti. Nandatāpaso – ‘‘tātā ",
      ", kiṃ vadetha, tumhe sāsapena saddhiṃ aṭṭhasaṭṭhiyojanasatasahassubbedhaṃ sineruṃ upametuṃ icchatha, sabbaññubuddhena saddhiṃ mā maṃ upamitthā’’ti āha. Atha te tāpasā – ‘‘sace ayaṃ orako abhavissa, na amhākaṃ ācariyo evaṃ upamaṃ āhareyya. Yāva mahāvatāyaṃ purisājānīyo’’ti pādesu nipatitvā sirasā vandiṃsu. Atha te ācariyo āha – ‘‘tātā, amhākaṃ buddhānaṃ anucchaviko deyyadhammo natthi, bhagavā ca bhikkhācāravelāyaṃ idhāgato, tasmā mayaṃ yathābalaṃ deyyadhammaṃ dassāma, tumhehi yaṃ yaṃ paṇītaṃ phalāphalaṃ ābhataṃ, taṃ taṃ āharathā’’ti āharāpetvā sahattheneva dhovitvā sayaṃ ",
      " tathāgatassa patte patiṭṭhāpesi. Satthārā phalāphale paṭiggahitamatte devatā dibbojaṃ pakkhipiṃsu. Tāpaso udakampi sayameva parissāvetvā adāsi. Tato bhojanakiccaṃ niṭṭhāpetvā nisinne satthari sabbe antevāsike pakkositvā satthu santike sāraṇīyaṃ kathaṃ kathento nisīdi. Satthā ‘‘bhikkhusaṅgho āgacchatū’’ti cintesi. Satthu cittaṃ ñatvā satasahassamattā khīṇāsavā āgantvā satthāraṃ vanditvā aṭṭhaṃsu."
    ],
    "innerText": "Tena ca samayena padumuttaro bhagavā loke uppajjitvā haṃsavatīnagaraṃ upanissāya viharanto ekadivasaṃ paccūsasamaye lokaṃ volokento nandatāpasassa antevāsikajaṭilānaṃ arahattūpanissayaṃ, nandatāpasassa ca dvīhaṅgehi samannāgatassa sāvakaṭṭhānantarassa patthanaṃ disvā pātova sarīrapaṭijagganaṃ katvā pubbaṇhasamaye pattacīvaramādāya aññaṃ kañci anāmantetvā sīho viya ekacaro nandatāpasassa antevāsikesu phalāphalatthāya gatesu ‘‘buddhabhāvaṃ me jānātū’’ti passantasseva nandatāpasassa ākāsato otaritvā pathaviyaṃ patiṭṭhāsi. Nandatāpaso buddhānubhāvañceva lakkhaṇapāripūriñca disvā lakkhaṇamante sammasitvā ‘‘imehi lakkhaṇehi samannāgato nāma agāraṃ ajjhāvasanto rājā hoti cakkavattī, pabbajanto loke vivaṭacchedo sabbaññū buddho hoti, ayaṃ purisājānīyo nissaṃsayaṃ buddho’’ti ñatvā paccuggamanaṃ katvā pañcapatiṭṭhitena vanditvā āsanaṃ paññāpetvā adāsi. Nisīdi bhagavā paññatte āsane. Nandatāpasopi attano anucchavikaṃ āsanaṃ gahetvā ekamantaṃ nisīdi. Tasmiṃ samaye catucattālīsasahassajaṭilā paṇītapaṇītāni ojavantāni phalāphalāni gahetvā ācariyassa santikaṃ sampattā buddhānañceva ācariyassa ca nisinnākāraṃ oloketvā āhaṃsu – ‘‘ācariya, mayaṃ ‘imasmiṃ loke tumhehi mahantataro natthī’ti vicarāma, ayaṃ pana puriso tumhehi mahantataro maññe’’ti. Nandatāpaso – ‘‘tātā , kiṃ vadetha, tumhe sāsapena saddhiṃ aṭṭhasaṭṭhiyojanasatasahassubbedhaṃ sineruṃ upametuṃ icchatha, sabbaññubuddhena saddhiṃ mā maṃ upamitthā’’ti āha. Atha te tāpasā – ‘‘sace ayaṃ orako abhavissa, na amhākaṃ ācariyo evaṃ upamaṃ āhareyya. Yāva mahāvatāyaṃ purisājānīyo’’ti pādesu nipatitvā sirasā vandiṃsu. Atha te ācariyo āha – ‘‘tātā, amhākaṃ buddhānaṃ anucchaviko deyyadhammo natthi, bhagavā ca bhikkhācāravelāyaṃ idhāgato, tasmā mayaṃ yathābalaṃ deyyadhammaṃ dassāma, tumhehi yaṃ yaṃ paṇītaṃ phalāphalaṃ ābhataṃ, taṃ taṃ āharathā’’ti āharāpetvā sahattheneva dhovitvā sayaṃ tathāgatassa patte patiṭṭhāpesi. Satthārā phalāphale paṭiggahitamatte devatā dibbojaṃ pakkhipiṃsu. Tāpaso udakampi sayameva parissāvetvā adāsi. Tato bhojanakiccaṃ niṭṭhāpetvā nisinne satthari sabbe antevāsike pakkositvā satthu santike sāraṇīyaṃ kathaṃ kathento nisīdi. Satthā ‘‘bhikkhusaṅgho āgacchatū’’ti cintesi. Satthu cittaṃ ñatvā satasahassamattā khīṇāsavā āgantvā satthāraṃ vanditvā aṭṭhaṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha nandatāpaso antevāsike āmantesi – ‘‘tātā, buddhānaṃ nisinnāsanampi nīcaṃ, samaṇasatasahassassapi āsanaṃ natthi. Tumhehi ajja uḷāraṃ bhagavato bhikkhusaṅghassa ca sakkāraṃ kātuṃ vaṭṭati, pabbatapādato vaṇṇagandhasampannāni pupphāni āharathā’’ti āha. Acinteyyattā iddhivisayassa te muhutteneva vaṇṇagandharasasampannāni pupphāni āharitvā buddhānaṃ yojanappamāṇaṃ pupphāsanaṃ paññāpesuṃ. Aggasāvakānaṃ tigāvutaṃ, sesabhikkhūnaṃ ",
      " aḍḍhayojanādibhedaṃ, saṅghanavakassa usabhamattaṃ paññāpesuṃ. Evaṃ paññattesu āsanesu nandatāpaso tathāgatassa purato añjaliṃ paggayha ṭhito, ‘‘bhante, amhākaṃ dīgharattaṃ hitāya sukhāya imaṃ pupphāsanaṃ āruyha nisīdathā’’ti āha. Nisīdi bhagavā pupphāsane. Evaṃ nisinne satthari satthu ākāraṃ ñatvā bhikkhū attano attano pattāsane nisīdiṃsu. Nandatāpaso mahantaṃ pupphacchattaṃ gahetvā tathāgatassa matthake dhārento aṭṭhāsi. Satthā ‘‘tāpasānaṃ ayaṃ sakkāro mahapphalo hotū’’ti nirodhasamāpattiṃ samāpajji. Satthu samāpannabhāvaṃ ñatvā bhikkhūpi samāpattiṃ samāpajjiṃsu. Tathāgate sattāhaṃ nirodhaṃ samāpajjitvā nisinne antevāsikā bhikkhācārakāle sampatte vanamūlaphalāphalaṃ paribhuñjitvā sesakāle buddhānaṃ añjaliṃ paggayha aṭṭhaṃsu. Nandatāpaso pana bhikkhācārampi agantvā pupphacchattaṃ dhārentoyeva sattāhaṃ pītisukheneva vītināmesi."
    ],
    "innerText": "Atha nandatāpaso antevāsike āmantesi – ‘‘tātā, buddhānaṃ nisinnāsanampi nīcaṃ, samaṇasatasahassassapi āsanaṃ natthi. Tumhehi ajja uḷāraṃ bhagavato bhikkhusaṅghassa ca sakkāraṃ kātuṃ vaṭṭati, pabbatapādato vaṇṇagandhasampannāni pupphāni āharathā’’ti āha. Acinteyyattā iddhivisayassa te muhutteneva vaṇṇagandharasasampannāni pupphāni āharitvā buddhānaṃ yojanappamāṇaṃ pupphāsanaṃ paññāpesuṃ. Aggasāvakānaṃ tigāvutaṃ, sesabhikkhūnaṃ aḍḍhayojanādibhedaṃ, saṅghanavakassa usabhamattaṃ paññāpesuṃ. Evaṃ paññattesu āsanesu nandatāpaso tathāgatassa purato añjaliṃ paggayha ṭhito, ‘‘bhante, amhākaṃ dīgharattaṃ hitāya sukhāya imaṃ pupphāsanaṃ āruyha nisīdathā’’ti āha. Nisīdi bhagavā pupphāsane. Evaṃ nisinne satthari satthu ākāraṃ ñatvā bhikkhū attano attano pattāsane nisīdiṃsu. Nandatāpaso mahantaṃ pupphacchattaṃ gahetvā tathāgatassa matthake dhārento aṭṭhāsi. Satthā ‘‘tāpasānaṃ ayaṃ sakkāro mahapphalo hotū’’ti nirodhasamāpattiṃ samāpajji. Satthu samāpannabhāvaṃ ñatvā bhikkhūpi samāpattiṃ samāpajjiṃsu. Tathāgate sattāhaṃ nirodhaṃ samāpajjitvā nisinne antevāsikā bhikkhācārakāle sampatte vanamūlaphalāphalaṃ paribhuñjitvā sesakāle buddhānaṃ añjaliṃ paggayha aṭṭhaṃsu. Nandatāpaso pana bhikkhācārampi agantvā pupphacchattaṃ dhārentoyeva sattāhaṃ pītisukheneva vītināmesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Satthā nirodhato vuṭṭhāya araṇavihāriaṅgena dakkhiṇeyyaṅgena cāti dvīhi aṅgehi samannāgataṃ ekaṃ sāvakaṃ ‘‘isigaṇassa pupphāsanānumodanaṃ karohī’’ti āṇāpesi. So cakkavattirañño santikā paṭiladdhamahālābho mahāyodho viya tuṭṭhamānaso attano visaye ṭhatvā tepiṭakaṃ buddhavacanaṃ sammasitvā ",
      " anumodanamakāsi. Tassa desanāvasāne satthā sayaṃ dhammaṃ desesi. Satthu desanāvasāne sabbepi catucattālīsasahassatāpasā arahattaṃ pāpuṇiṃsu. Satthā – ‘‘etha bhikkhavo’’ti hatthaṃ pasāresi. Tesaṃ tāvadeva kesamassū antaradhāyiṃsu ",
      ". Aṭṭha parikkhārā sarīre paṭimukkāva ahesuṃ. Te saṭṭhivassikattherā viya satthāraṃ parivārayiṃsu. Nandatāpaso pana vikkhittacittatāya visesaṃ nādhigañchi. Tassa kira araṇavihārittherassa dhammaṃ sotuṃ āraddhakālato paṭṭhāya – ‘‘aho vatāhampi anāgate ekassa buddhassa sāsane iminā sāvakena laddhaguṇaṃ labheyya’’nti cittaṃ udapādi. So tena vitakkena maggaphalapaṭivedhaṃ kātuṃ nāsakkhi. Tathāgataṃ pana vanditvā añjaliṃ paggayha sammukhe ṭhito evamāha – ‘‘bhante, yena bhikkhunā isigaṇassa pupphāsanānumodanā katā, ko nāmāyaṃ tumhākaṃ sāsane’’ti? ‘‘Araṇavihāriaṅgena ca dakkhiṇeyyaṅgena ca etadaggaṭṭhānaṃ patto eso bhikkhū’’ti. ‘‘Bhante, yvāyaṃ mayā sattāhaṃ pupphacchattaṃ dhārentena ",
      " sakkāro kato, tena adhikārena aññaṃ sampattiṃ na patthemi, anāgate pana ekassa buddhassa sāsane ayaṃ thero viya dvīhaṅgehi samannāgato sāvako bhaveyya’’nti patthanaṃ akāsi."
    ],
    "innerText": "Satthā nirodhato vuṭṭhāya araṇavihāriaṅgena dakkhiṇeyyaṅgena cāti dvīhi aṅgehi samannāgataṃ ekaṃ sāvakaṃ ‘‘isigaṇassa pupphāsanānumodanaṃ karohī’’ti āṇāpesi. So cakkavattirañño santikā paṭiladdhamahālābho mahāyodho viya tuṭṭhamānaso attano visaye ṭhatvā tepiṭakaṃ buddhavacanaṃ sammasitvā anumodanamakāsi. Tassa desanāvasāne satthā sayaṃ dhammaṃ desesi. Satthu desanāvasāne sabbepi catucattālīsasahassatāpasā arahattaṃ pāpuṇiṃsu. Satthā – ‘‘etha bhikkhavo’’ti hatthaṃ pasāresi. Tesaṃ tāvadeva kesamassū antaradhāyiṃsu . Aṭṭha parikkhārā sarīre paṭimukkāva ahesuṃ. Te saṭṭhivassikattherā viya satthāraṃ parivārayiṃsu. Nandatāpaso pana vikkhittacittatāya visesaṃ nādhigañchi. Tassa kira araṇavihārittherassa dhammaṃ sotuṃ āraddhakālato paṭṭhāya – ‘‘aho vatāhampi anāgate ekassa buddhassa sāsane iminā sāvakena laddhaguṇaṃ labheyya’’nti cittaṃ udapādi. So tena vitakkena maggaphalapaṭivedhaṃ kātuṃ nāsakkhi. Tathāgataṃ pana vanditvā añjaliṃ paggayha sammukhe ṭhito evamāha – ‘‘bhante, yena bhikkhunā isigaṇassa pupphāsanānumodanā katā, ko nāmāyaṃ tumhākaṃ sāsane’’ti? ‘‘Araṇavihāriaṅgena ca dakkhiṇeyyaṅgena ca etadaggaṭṭhānaṃ patto eso bhikkhū’’ti. ‘‘Bhante, yvāyaṃ mayā sattāhaṃ pupphacchattaṃ dhārentena sakkāro kato, tena adhikārena aññaṃ sampattiṃ na patthemi, anāgate pana ekassa buddhassa sāsane ayaṃ thero viya dvīhaṅgehi samannāgato sāvako bhaveyya’’nti patthanaṃ akāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Satthā ‘‘samijjhissati nu kho imassa tāpasassa patthanā’’ti anāgataṃsañāṇaṃ pesetvā olokento kappasatasahassaṃ atikkamitvā samijjhanakabhāvaṃ disvā, ‘‘tāpasa, na te ayaṃ patthanā moghaṃ bhavissati, anāgate kappasatasahassaṃ atikkamitvā gotamo nāma buddho uppajjissati, tassa santike samijjhissatī’’ti dhammakathaṃ kathetvā bhikkhusaṅghaparivuto ākāsaṃ pakkhandi. Nandatāpaso yāva cakkhupathaṃ na samatikkamati, tāva satthu bhikkhusaṅghassa ca añjaliṃ paggahetvā aṭṭhāsi. So aparabhāge kālena kālaṃ satthāraṃ upasaṅkamitvā dhammaṃ suṇitvā aparihīnajjhānova kālaṃ katvā brahmaloke nibbatto. Tato pana cuto aparānipi pañca jātisatāni pabbajitvā āraññakova ahosi, kassapasammāsambuddhakālepi pabbajitvā āraññako hutvā gatapaccāgatavattaṃ pūresi. Etaṃ kira vattaṃ aparipūretvā mahāsāvakabhāvaṃ pāpuṇantā nāma natthi, gatapaccāgatavattaṃ pana āgamaṭṭhakathāsu vuttanayeneva veditabbaṃ. So vīsativassasahassāni gatapaccāgatavattaṃ pūretvā kālaṃ katvā tāvatiṃsadevaloke nibbatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ so tāvatiṃsabhavane aparāparaṃ uppajjanavasena dibbasampattiṃ anubhavitvā tato cuto manussaloke anekasatakkhattuṃ cakkavattirājā padesarājā ca hutvā uḷāraṃ manussasampattiṃ anubhavitvā amhākaṃ bhagavato uppannakāle sāvatthiyaṃ sumanaseṭṭhissa gehe anāthapiṇḍikassa ",
      " kaniṭṭho hutvā nibbatti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Subhūtī"
      },
      "tissa nāmaṃ ahosi."
    ],
    "innerText": "Evaṃ so tāvatiṃsabhavane aparāparaṃ uppajjanavasena dibbasampattiṃ anubhavitvā tato cuto manussaloke anekasatakkhattuṃ cakkavattirājā padesarājā ca hutvā uḷāraṃ manussasampattiṃ anubhavitvā amhākaṃ bhagavato uppannakāle sāvatthiyaṃ sumanaseṭṭhissa gehe anāthapiṇḍikassa kaniṭṭho hutvā nibbatti. Subhūtītissa nāmaṃ ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena ",
      " ca samayena amhākaṃ bhagavā loke uppajjitvā pavattitavaradhammacakko anupubbena rājagahaṃ gantvā tattha veḷuvanapaṭiggahaṇādinā lokānuggahaṃ karonto rājagahaṃ upanissāya sītavane vihāsi. Tadā anāthapiṇḍiko seṭṭhi sāvatthiyaṃ uṭṭhānakaṃ bhaṇḍaṃ gahetvā attano sahāyassa rājagahaseṭṭhino gehaṃ gantvā buddhuppādaṃ sutvā satthāraṃ sītavane viharantaṃ upasaṅkamitvā paṭhamadassaneneva sotāpattiphale patiṭṭhāya ",
      " satthāraṃ sāvatthiṃ āgamanatthāya yācitvā tato pañcacattālīsayojane magge yojane yojane satasahassapariccāgena vihāre patiṭṭhāpetvā sāvatthiyaṃ aṭṭhakarīsappamāṇaṃ jetassa kumārassa uyyānabhūmiṃ koṭisanthārena kiṇitvā tattha bhagavato vihāraṃ kāretvā adāsi. Vihāramahadivase ayaṃ subhūtikuṭumbiko anāthapiṇḍikaseṭṭhinā saddhiṃ gantvā dhammaṃ suṇanto saddhaṃ paṭilabhitvā pabbaji. So upasampanno dve mātikā paguṇā katvā kammaṭṭhānaṃ kathāpetvā araññe samaṇadhammaṃ karonto mettājhānaṃ nibbattetvā taṃ pādakaṃ katvā vipassanaṃ vaḍḍhetvā arahattaṃ pāpuṇi."
    ],
    "innerText": "Tena ca samayena amhākaṃ bhagavā loke uppajjitvā pavattitavaradhammacakko anupubbena rājagahaṃ gantvā tattha veḷuvanapaṭiggahaṇādinā lokānuggahaṃ karonto rājagahaṃ upanissāya sītavane vihāsi. Tadā anāthapiṇḍiko seṭṭhi sāvatthiyaṃ uṭṭhānakaṃ bhaṇḍaṃ gahetvā attano sahāyassa rājagahaseṭṭhino gehaṃ gantvā buddhuppādaṃ sutvā satthāraṃ sītavane viharantaṃ upasaṅkamitvā paṭhamadassaneneva sotāpattiphale patiṭṭhāya satthāraṃ sāvatthiṃ āgamanatthāya yācitvā tato pañcacattālīsayojane magge yojane yojane satasahassapariccāgena vihāre patiṭṭhāpetvā sāvatthiyaṃ aṭṭhakarīsappamāṇaṃ jetassa kumārassa uyyānabhūmiṃ koṭisanthārena kiṇitvā tattha bhagavato vihāraṃ kāretvā adāsi. Vihāramahadivase ayaṃ subhūtikuṭumbiko anāthapiṇḍikaseṭṭhinā saddhiṃ gantvā dhammaṃ suṇanto saddhaṃ paṭilabhitvā pabbaji. So upasampanno dve mātikā paguṇā katvā kammaṭṭhānaṃ kathāpetvā araññe samaṇadhammaṃ karonto mettājhānaṃ nibbattetvā taṃ pādakaṃ katvā vipassanaṃ vaḍḍhetvā arahattaṃ pāpuṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "So dhammaṃ desento yasmā satthārā desitaniyāmena anodissakaṃ katvā deseti, tasmā araṇavihārīnaṃ aggo nāma jāto. Yasmā ca piṇḍāya caranto ghare ghare mettājhānaṃ samāpajjitvā vuṭṭhāya bhikkhaṃ paṭiggaṇhāti ‘‘evaṃ dāyakānaṃ mahapphalaṃ bhavissatī’’ti, tasmā dakkhiṇeyyānaṃ aggo nāma jāto. Tena naṃ bhagavā ‘‘etadaggaṃ, bhikkhave, mama sāvakānaṃ bhikkhūnaṃ araṇavihārīnaṃ dakkhiṇeyyānañca yadidaṃ subhūtī’’ti (a. ni. 1.198, 201) dvayaṅgasamannāgate aggaṭṭhāne ṭhapesi. Evamayaṃ mahāthero attanā pūritapāramīnaṃ phalassa matthakaṃ arahattaṃ patvā loke abhiññāto abhilakkhito hutvā bahujanahitāya janapadacārikaṃ caranto anupubbena rājagahaṃ agamāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Rājā bimbisāro therassa āgamanaṃ sutvā upasaṅkamitvā vanditvā ‘‘idheva, bhante, vasatha, vasanaṭṭhānaṃ vo karissāmī’’ti vatvā pakkanto vissari. Thero senāsanaṃ alabhanto abbhokāse vītināmesi. Therassānubhāvena devo na vassati. Manussā avuṭṭhitāya upaddutā rañño nivesanadvāre ukkuṭṭhiṃ akaṃsu. Rājā ‘‘kena nu kho kāraṇena devo na vassatī’’ti vīmaṃsanto ‘‘therassa abbhokāsavāsena maññe na vassatī’’ti cintetvā tassa paṇṇakuṭiṃ kārāpetvā ‘‘imissaṃ, bhante, paṇṇakuṭiyaṃ vasathā’’ti vatvā vanditvā pakkāmi. Thero kuṭiṃ pavisitvā tiṇasanthārake pallaṅkena nisīdi. Tadā devo thokaṃ ",
      " thokaṃ phusāyati, na sammādhāraṃ anupavecchati. Atha thero lokassa avuṭṭhikabhayaṃ vidhamitukāmo ",
      " attano ajjhattikabāhiravatthukassa ",
      " parissayassa abhāvaṃ pavedento ‘‘channā me kuṭikā’’ti (theragā. 1) gāthamāha. Tassattho theragāthāyaṃ vuttoyeva."
    ],
    "innerText": "Rājā bimbisāro therassa āgamanaṃ sutvā upasaṅkamitvā vanditvā ‘‘idheva, bhante, vasatha, vasanaṭṭhānaṃ vo karissāmī’’ti vatvā pakkanto vissari. Thero senāsanaṃ alabhanto abbhokāse vītināmesi. Therassānubhāvena devo na vassati. Manussā avuṭṭhitāya upaddutā rañño nivesanadvāre ukkuṭṭhiṃ akaṃsu. Rājā ‘‘kena nu kho kāraṇena devo na vassatī’’ti vīmaṃsanto ‘‘therassa abbhokāsavāsena maññe na vassatī’’ti cintetvā tassa paṇṇakuṭiṃ kārāpetvā ‘‘imissaṃ, bhante, paṇṇakuṭiyaṃ vasathā’’ti vatvā vanditvā pakkāmi. Thero kuṭiṃ pavisitvā tiṇasanthārake pallaṅkena nisīdi. Tadā devo thokaṃ thokaṃ phusāyati, na sammādhāraṃ anupavecchati. Atha thero lokassa avuṭṭhikabhayaṃ vidhamitukāmo attano ajjhattikabāhiravatthukassa parissayassa abhāvaṃ pavedento ‘‘channā me kuṭikā’’ti (theragā. 1) gāthamāha. Tassattho theragāthāyaṃ vuttoyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kasmā panete mahātherā attano guṇe pakāsentīti? Iminā dīghena addhunā anadhigatapubbaṃ paramagambhīraṃ ativiya santaṃ paṇītaṃ attanā adhigatalokuttaradhammaṃ paccavekkhitvā pītivegasamussāhitaudānadīpanatthaṃ sāsanassa niyyānikabhāvavibhāvanatthañca paramappicchā ariyā attano guṇe pakāsenti. Yathā taṃ lokanātho bodhaneyyānaṃ ajjhāsayavasena ‘‘dasabalasamannāgato, bhikkhave, tathāgato catuvesārajjavisārado’’tiādinā (a. ni. 10.21; ma. ni. 1. 148 atthato samānaṃ) attano guṇe pakāseti. Evamayaṃ therassa aññābyākaraṇagāthāpi ahosīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      ". Evaṃ so pattaarahattaphalo pattaetadaggaṭṭhāno ca attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "himavantassāvidūre"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "himavantassā"
      },
      "ti himālayapabbatassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avidūre"
      },
      " āsanne samīpe pabbatapāde manussānaṃ gamanāgamanasampanne sañcaraṇaṭṭhāneti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nisabho nāma pabbato"
      },
      "ti pabbatānaṃ jeṭṭhattā nāmena nisabho nāma selamayapabbato ahosīti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Assamo sukato mayha"
      },
      "nti tattha pabbate mayhaṃ vasanatthāya assamo araññāvāso suṭṭhu kato. Kuṭirattiṭṭhānadivāṭṭhānavatiparikkhepādivasena sundarākārena katoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṇṇasālā sumāpitā"
      },
      "ti paṇṇehi chāditā sālā mayhaṃ nivāsanatthāya suṭṭhu māpitā niṭṭhāpitāti attho."
    ],
    "innerText": "1. Evaṃ so pattaarahattaphalo pattaetadaggaṭṭhāno ca attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento himavantassāvidūretiādimāha. Tattha himavantassāti himālayapabbatassa avidūre āsanne samīpe pabbatapāde manussānaṃ gamanāgamanasampanne sañcaraṇaṭṭhāneti attho. Nisabho nāma pabbatoti pabbatānaṃ jeṭṭhattā nāmena nisabho nāma selamayapabbato ahosīti sambandho. Assamo sukato mayhanti tattha pabbate mayhaṃ vasanatthāya assamo araññāvāso suṭṭhu kato. Kuṭirattiṭṭhānadivāṭṭhānavatiparikkhepādivasena sundarākārena katoti attho. Paṇṇasālā sumāpitāti paṇṇehi chāditā sālā mayhaṃ nivāsanatthāya suṭṭhu māpitā niṭṭhāpitāti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "2"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kosiyo nāma nāmenā"
      },
      "ti mātāpitūhi katanāmadheyyena kosiyo nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uggatāpano"
      },
      " pākaṭatapo ghoratapo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekākiyo"
      },
      " aññesaṃ abhāvā ahaṃ eva eko. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adutiyo"
      },
      " dutiyatāpasarahito ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jaṭilo"
      },
      " jaṭādhārī tāpaso ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tadā"
      },
      " tasmiṃ kāle ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nisabhe"
      },
      " pabbate ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vasāmi"
      },
      " viharāmīti sambandho."
    ],
    "innerText": "2.Kosiyo nāma nāmenāti mātāpitūhi katanāmadheyyena kosiyo nāma. Uggatāpano pākaṭatapo ghoratapo. Ekākiyo aññesaṃ abhāvā ahaṃ eva eko. Adutiyo dutiyatāpasarahito jaṭilo jaṭādhārī tāpaso tadā tasmiṃ kāle nisabhe pabbate vasāmi viharāmīti sambandho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "3"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Phalaṃ mūlañca paṇṇañca, na bhuñjāmi ahaṃ tadā"
      },
      "ti tadā tasmiṃ nisabhapabbate vasanakāle tiṇḍukādiphalaṃ muḷālādimūlaṃ, kārapaṇṇādipaṇṇañca rukkhato ",
      " ocinitvā na bhuñjāmīti attho. Evaṃ sati kathaṃ jīvatīti taṃ dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pavattaṃva supātāha"
      },
      "nti ",
      " āha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pavattaṃ"
      },
      " sayameva jātaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "supātaṃ"
      },
      " attano dhammatāya patitaṃ paṇṇādikaṃ nissāya āhāraṃ katvā ahaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tāvade"
      },
      " tasmiṃ kāle ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jīvāmi"
      },
      " jīvikaṃ kappemīti sambandho. ‘‘Pavattapaṇḍupaṇṇānī’’ti ",
      " vā pāṭho, tassa sayameva patitāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṇḍupaṇṇāni rukkhapattāni"
      },
      " upanissāya jīvāmīti attho."
    ],
    "innerText": "3.Phalaṃ mūlañca paṇṇañca, na bhuñjāmi ahaṃ tadāti tadā tasmiṃ nisabhapabbate vasanakāle tiṇḍukādiphalaṃ muḷālādimūlaṃ, kārapaṇṇādipaṇṇañca rukkhato ocinitvā na bhuñjāmīti attho. Evaṃ sati kathaṃ jīvatīti taṃ dassento pavattaṃva supātāhanti āha. Tattha pavattaṃ sayameva jātaṃ supātaṃ attano dhammatāya patitaṃ paṇṇādikaṃ nissāya āhāraṃ katvā ahaṃ tāvade tasmiṃ kāle jīvāmi jīvikaṃ kappemīti sambandho. ‘‘Pavattapaṇḍupaṇṇānī’’ti vā pāṭho, tassa sayameva patitāni paṇḍupaṇṇāni rukkhapattāni upanissāya jīvāmīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "4"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nāhaṃ kopemi ājīva"
      },
      "nti ahaṃ jīvitaṃ cajamānopi pariccāgaṃ kurumānopi taṇhāvasena phalamūlādiāhārapariyesanāya sammā ājīvaṃ na kopemi na nāsemīti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ārādhemi sakaṃ citta"
      },
      "nti sakaṃ cittaṃ attano manaṃ appicchatāya santuṭṭhiyā ca ārādhemi pasādemi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vivajjemi anesana"
      },
      "nti vejjakammadūtakammādivasena anesanaṃ ayuttapariyesanaṃ vivajjemi dūraṃ karomi."
    ],
    "innerText": "4.Nāhaṃ kopemi ājīvanti ahaṃ jīvitaṃ cajamānopi pariccāgaṃ kurumānopi taṇhāvasena phalamūlādiāhārapariyesanāya sammā ājīvaṃ na kopemi na nāsemīti sambandho. Ārādhemi sakaṃ cittanti sakaṃ cittaṃ attano manaṃ appicchatāya santuṭṭhiyā ca ārādhemi pasādemi. Vivajjemi anesananti vejjakammadūtakammādivasena anesanaṃ ayuttapariyesanaṃ vivajjemi dūraṃ karomi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "5"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rāgūpasaṃhitaṃ citta"
      },
      "nti yadā yasmiṃ kāle mama rāgena sampayuttaṃ cittaṃ uppajjati, tadā sayameva attanāyeva paccavekkhāmi ñāṇena paṭivekkhitvā vinodemi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekaggo taṃ damemaha"
      },
      "nti ahaṃ ekasmiṃ kammaṭṭhānārammaṇe aggo samāhito taṃ rāgacittaṃ damemi damanaṃ karomi."
    ],
    "innerText": "5.Rāgūpasaṃhitaṃ cittanti yadā yasmiṃ kāle mama rāgena sampayuttaṃ cittaṃ uppajjati, tadā sayameva attanāyeva paccavekkhāmi ñāṇena paṭivekkhitvā vinodemi. Ekaggo taṃ damemahanti ahaṃ ekasmiṃ kammaṭṭhānārammaṇe aggo samāhito taṃ rāgacittaṃ damemi damanaṃ karomi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "6"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rajjase rajjanīye cā"
      },
      "ti rajjanīye allīyitabbe rūpārammaṇādivatthusmiṃ rajjase allīno asi bhavasi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dussanīye ca dussase"
      },
      "ti dūsitabbe dosakaraṇavatthusmiṃ dūsako asi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Muyhase mohanīye cā"
      },
      "ti mohitabbe mohakaraṇavatthusmiṃ moyhasi mūḷho asi bhavasi. Tasmā tuvaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vanā"
      },
      " vanato araññavāsato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nikkhamassu"
      },
      " apagacchāhīti evaṃ attānaṃ damemīti sambandho."
    ],
    "innerText": "6.Rajjase rajjanīye cāti rajjanīye allīyitabbe rūpārammaṇādivatthusmiṃ rajjase allīno asi bhavasi. Dussanīye ca dussaseti dūsitabbe dosakaraṇavatthusmiṃ dūsako asi. Muyhase mohanīye cāti mohitabbe mohakaraṇavatthusmiṃ moyhasi mūḷho asi bhavasi. Tasmā tuvaṃ vanā vanato araññavāsato nikkhamassu apagacchāhīti evaṃ attānaṃ damemīti sambandho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "24"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Timbarūsakavaṇṇābho"
      },
      "ti suvaṇṇatimbarūsakavaṇṇābho, jambonadasuvaṇṇavaṇṇoti attho. Sesaṃ suviññeyyamevāti."
    ],
    "innerText": "24.Timbarūsakavaṇṇābhoti suvaṇṇatimbarūsakavaṇṇābho, jambonadasuvaṇṇavaṇṇoti attho. Sesaṃ suviññeyyamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Subhūtittheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Upavānattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Padumuttaro"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nāma jino"
      },
      "tiādikaṃ āyasmato upavānattherassa apadānaṃ. Ayampāyasmā purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto padumuttarassa bhagavato kāle daliddakule nibbattitvā viññutaṃ patto bhagavati parinibbute tassa dhātuṃ gahetvā manussadevanāgagaruḷakumbhaṇḍayakkhagandhabbehi sattaratanamaye sattayojanike thūpe kate tattha sudhotaṃ attano uttarasāṭakaṃ veḷagge laggetvā ābandhitvā dhajaṃ katvā pūjaṃ akāsi. Taṃ gahetvā abhisammatako ",
      " nāma yakkhasenāpati devehi cetiyapūjārakkhaṇatthaṃ ṭhapito adissamānakāyo taṃ ākāse dhārento cetiyaṃ tikkhattuṃ padakkhiṇaṃ akāsi. So taṃ disvā bhiyyosomattāya pasannamānaso hutvā tena puññakammena devamanussesu saṃsaranto imasmiṃ buddhuppāde sāvatthiyaṃ brāhmaṇakule nibbattitvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upavāno"
      },
      "ti laddhanāmo vayappatto jetavanapaṭiggahaṇe buddhānubhāvaṃ disvā paṭiladdhasaddho pabbajitvā vipassanāya kammaṃ karonto arahattaṃ patvā chaḷabhiñño ahosi. Yadā bhagavato aphāsu ahosi, tadā thero uṇhodakaṃ tathārūpaṃ pānakañca bhesajjaṃ bhagavato upanāmesi. Tenassa satthuno rogo vūpasami. Tassa bhagavā anumodanaṃ akāsi."
    ],
    "innerText": "Padumuttaronāma jinotiādikaṃ āyasmato upavānattherassa apadānaṃ. Ayampāyasmā purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto padumuttarassa bhagavato kāle daliddakule nibbattitvā viññutaṃ patto bhagavati parinibbute tassa dhātuṃ gahetvā manussadevanāgagaruḷakumbhaṇḍayakkhagandhabbehi sattaratanamaye sattayojanike thūpe kate tattha sudhotaṃ attano uttarasāṭakaṃ veḷagge laggetvā ābandhitvā dhajaṃ katvā pūjaṃ akāsi. Taṃ gahetvā abhisammatako nāma yakkhasenāpati devehi cetiyapūjārakkhaṇatthaṃ ṭhapito adissamānakāyo taṃ ākāse dhārento cetiyaṃ tikkhattuṃ padakkhiṇaṃ akāsi. So taṃ disvā bhiyyosomattāya pasannamānaso hutvā tena puññakammena devamanussesu saṃsaranto imasmiṃ buddhuppāde sāvatthiyaṃ brāhmaṇakule nibbattitvā upavānoti laddhanāmo vayappatto jetavanapaṭiggahaṇe buddhānubhāvaṃ disvā paṭiladdhasaddho pabbajitvā vipassanāya kammaṃ karonto arahattaṃ patvā chaḷabhiñño ahosi. Yadā bhagavato aphāsu ahosi, tadā thero uṇhodakaṃ tathārūpaṃ pānakañca bhesajjaṃ bhagavato upanāmesi. Tenassa satthuno rogo vūpasami. Tassa bhagavā anumodanaṃ akāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "52"
      },
      ". Evaṃ so pattaarahattaphalo adhigataetadaggaṭṭhāno attano pubbakammaṃ saritvā somanassavasena pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "padumuttaro nāma jino"
      },
      "tiādimāha. Tattha sabbesaṃ lokiyalokuttaradhammānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pāragū"
      },
      " pariyosānaṃ nibbānaṃ gato patto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "padumuttaro nāma jino"
      },
      " jitapañcamāro bhagavā aggikkhandho iva chabbaṇṇā buddharaṃsiyo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jalitvā"
      },
      " sabbalokaṃ dhammapajjotena obhāsetvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sambuddho"
      },
      " suṭṭhu buddho avijjāniddūpagatāya pajāya savāsanāya kilesaniddāya paṭibuddho vikasitanettapaṅkajo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "parinibbuto"
      },
      " khandhaparinibbānena nibbuto adassanaṃ gatoti sambandho."
    ],
    "innerText": "52. Evaṃ so pattaarahattaphalo adhigataetadaggaṭṭhāno attano pubbakammaṃ saritvā somanassavasena pubbacaritāpadānaṃ pakāsento padumuttaro nāma jinotiādimāha. Tattha sabbesaṃ lokiyalokuttaradhammānaṃ pāragū pariyosānaṃ nibbānaṃ gato patto padumuttaro nāma jino jitapañcamāro bhagavā aggikkhandho iva chabbaṇṇā buddharaṃsiyo jalitvā sabbalokaṃ dhammapajjotena obhāsetvā sambuddho suṭṭhu buddho avijjāniddūpagatāya pajāya savāsanāya kilesaniddāya paṭibuddho vikasitanettapaṅkajo parinibbuto khandhaparinibbānena nibbuto adassanaṃ gatoti sambandho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "57"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jaṅghā"
      },
      "ti cetiyakaraṇakāle upacinitabbānaṃ iṭṭhakānaṃ ṭhapanatthāya, nibandhiyamānasopānapanti."
    ],
    "innerText": "57.Jaṅghāti cetiyakaraṇakāle upacinitabbānaṃ iṭṭhakānaṃ ṭhapanatthāya, nibandhiyamānasopānapanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "88"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sudhotaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rajakenāha"
      },
      "nti vatthadhovakena purisena suṭṭhu dhovitaṃ suvisuddhakataṃ, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uttareyyapaṭaṃ mama"
      },
      " uttarasāṭakaṃ ahaṃ veḷagge laggitvā dhajaṃ katvā ukkhipiṃ, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ambare"
      },
      " ākāse ussāpesinti attho. Sesaṃ suviññeyyamevāti."
    ],
    "innerText": "88.Sudhotaṃrajakenāhanti vatthadhovakena purisena suṭṭhu dhovitaṃ suvisuddhakataṃ, uttareyyapaṭaṃ mama uttarasāṭakaṃ ahaṃ veḷagge laggitvā dhajaṃ katvā ukkhipiṃ, ambare ākāse ussāpesinti attho. Sesaṃ suviññeyyamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Upavānattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Tisaraṇagamaniyattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nagare bandhumatiyā"
      },
      "tiādikaṃ āyasmato tisaraṇagamaniyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto vipassissa bhagavato kāle bandhumatīnagare kulagehe nibbattitvā andhamātāpitaro upaṭṭhāsi. So ekadivasaṃ cintesi – ‘‘ahaṃ mātāpitaro upaṭṭhahanto pabbajituṃ na labhāmi, yaṃnūnāhaṃ tīṇi saraṇāni ",
      " gaṇhissāmi ",
      ", evaṃ duggatito mocessāmī’’ti nisabhaṃ nāma vipassissa bhagavato aggasāvakaṃ upasaṅkamitvā tīṇi saraṇāni gaṇhi. So tāni vassasatasahassāni rakkhitvā teneva kammena tāvatiṃsabhavane nibbatto, tato paraṃ devamanussesu saṃsaranto ubhayasampattiyo anubhavitvā imasmiṃ buddhuppāde sāvatthinagare mahāsālakule nibbatto viññutaṃ patto sattavassikova dārakehi parivuto ekaṃ saṅghārāmaṃ agamāsi. Tattha eko khīṇāsavatthero tassa dhammaṃ desetvā saraṇāni adāsi. So tāni gahetvā pubbe attano rakkhitāni saraṇāni saritvā vipassanaṃ vaḍḍhetvā arahattaṃ pāpuṇi. Taṃ arahattappattaṃ bhagavā upasampādesi."
    ],
    "innerText": "Nagare bandhumatiyātiādikaṃ āyasmato tisaraṇagamaniyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto vipassissa bhagavato kāle bandhumatīnagare kulagehe nibbattitvā andhamātāpitaro upaṭṭhāsi. So ekadivasaṃ cintesi – ‘‘ahaṃ mātāpitaro upaṭṭhahanto pabbajituṃ na labhāmi, yaṃnūnāhaṃ tīṇi saraṇāni gaṇhissāmi , evaṃ duggatito mocessāmī’’ti nisabhaṃ nāma vipassissa bhagavato aggasāvakaṃ upasaṅkamitvā tīṇi saraṇāni gaṇhi. So tāni vassasatasahassāni rakkhitvā teneva kammena tāvatiṃsabhavane nibbatto, tato paraṃ devamanussesu saṃsaranto ubhayasampattiyo anubhavitvā imasmiṃ buddhuppāde sāvatthinagare mahāsālakule nibbatto viññutaṃ patto sattavassikova dārakehi parivuto ekaṃ saṅghārāmaṃ agamāsi. Tattha eko khīṇāsavatthero tassa dhammaṃ desetvā saraṇāni adāsi. So tāni gahetvā pubbe attano rakkhitāni saraṇāni saritvā vipassanaṃ vaḍḍhetvā arahattaṃ pāpuṇi. Taṃ arahattappattaṃ bhagavā upasampādesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "106"
      },
      ". So arahattappatto upasampanno hutvā attano pubbakammaṃ saritvā somanassavasena pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nagare bandhumatiyā"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mātu upaṭṭhāko ahu"
      },
      "nti ahaṃ mātāpitūnaṃ upaṭṭhāko bharako bandhumatīnagare ahosinti sambandho."
    ],
    "innerText": "106. So arahattappatto upasampanno hutvā attano pubbakammaṃ saritvā somanassavasena pubbacaritāpadānaṃ pakāsento nagare bandhumatiyātiādimāha. Tattha mātu upaṭṭhāko ahunti ahaṃ mātāpitūnaṃ upaṭṭhāko bharako bandhumatīnagare ahosinti sambandho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "108"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tamandhakārapihitā"
      },
      "ti ",
      " mohandhakārena pihitā chāditā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tividhaggīhi ḍayhare"
      },
      "ti rāgaggidosaggimohaggisaṅkhātehi tīhi aggīhi ḍayhare ḍayhanti sabbe sattāti sambandho."
    ],
    "innerText": "108.Tamandhakārapihitāti mohandhakārena pihitā chāditā. Tividhaggīhi ḍayhareti rāgaggidosaggimohaggisaṅkhātehi tīhi aggīhi ḍayhare ḍayhanti sabbe sattāti sambandho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "114"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭha hetū labhāmaha"
      },
      "nti aṭṭha kāraṇāni sukhassa paccayabhūtāni kāraṇāni labhāmi ahanti attho. Sesaṃ suviññeyyamevāti."
    ],
    "innerText": "114.Aṭṭha hetū labhāmahanti aṭṭha kāraṇāni sukhassa paccayabhūtāni kāraṇāni labhāmi ahanti attho. Sesaṃ suviññeyyamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tisaraṇagamaniyattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Pañcasīlasamādāniyattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nagare candavatiyā"
      },
      "tiādikaṃ āyasmato pañcasīlasamādāniyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto anomadassissa bhagavato kāle ekasmiṃ kule nibbatto purimabhave katākusalakammānurūpena daliddo hutvā appannapānabhojano paresaṃ bhatiṃ katvā jīvanto saṃsāre ādīnavaṃ ñatvā pabbajitukāmopi pabbajjaṃ alabhamāno anomadassissa bhagavato sāvakassa nisabhattherassa santike pañca sikkhāpadāni samādiyi. Dīghāyukakāle uppannattā vassasatasahassāni sīlaṃ paripālesi. Tena kammena so devamanussesu saṃsaranto imasmiṃ buddhuppāde vesāliyaṃ mahābhogakule nibbatto. Mātāpitaro sīlaṃ samādiyante disvā attano sīlaṃ saritvā vipassanaṃ vaḍḍhetvā arahattaṃ patvā pabbaji."
    ],
    "innerText": "Nagare candavatiyātiādikaṃ āyasmato pañcasīlasamādāniyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto anomadassissa bhagavato kāle ekasmiṃ kule nibbatto purimabhave katākusalakammānurūpena daliddo hutvā appannapānabhojano paresaṃ bhatiṃ katvā jīvanto saṃsāre ādīnavaṃ ñatvā pabbajitukāmopi pabbajjaṃ alabhamāno anomadassissa bhagavato sāvakassa nisabhattherassa santike pañca sikkhāpadāni samādiyi. Dīghāyukakāle uppannattā vassasatasahassāni sīlaṃ paripālesi. Tena kammena so devamanussesu saṃsaranto imasmiṃ buddhuppāde vesāliyaṃ mahābhogakule nibbatto. Mātāpitaro sīlaṃ samādiyante disvā attano sīlaṃ saritvā vipassanaṃ vaḍḍhetvā arahattaṃ patvā pabbaji."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "134"
      },
      ". So attano pubbakammaṃ saritvā somanassajāto udānavasena pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nagare candavatiyā"
      },
      "tiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhatako"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āsahaṃ tadā"
      },
      "ti tadā mama puññakaraṇakāle ahaṃ bhatako bhatiyā kammakārako āsiṃ ahosiṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parakammāyane yutto"
      },
      "ti bhatiyā paresaṃ kammakaraṇe āyutto yojito okāsābhāvena saṃsārato muccanatthāya ahaṃ pabbajjaṃ na labhāmi."
    ],
    "innerText": "134. So attano pubbakammaṃ saritvā somanassajāto udānavasena pubbacaritāpadānaṃ pakāsento nagare candavatiyātiādimāha. Bhatakoāsahaṃ tadāti tadā mama puññakaraṇakāle ahaṃ bhatako bhatiyā kammakārako āsiṃ ahosiṃ. Parakammāyane yuttoti bhatiyā paresaṃ kammakaraṇe āyutto yojito okāsābhāvena saṃsārato muccanatthāya ahaṃ pabbajjaṃ na labhāmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "135"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahandhakārapihitā"
      },
      "ti mahantehi kilesandhakārehi pihitā saṃvutā thakitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tividhaggīhi ḍayhare"
      },
      "ti narakaggipetaggisaṃsāraggisaṅkhātehi tīhi ",
      " aggīhi ḍayhanti. Ahaṃ pana kena upāyena kena kāraṇena visaṃyutto bhaveyyanti attho."
    ],
    "innerText": "135.Mahandhakārapihitāti mahantehi kilesandhakārehi pihitā saṃvutā thakitā. Tividhaggīhi ḍayhareti narakaggipetaggisaṃsāraggisaṅkhātehi tīhi aggīhi ḍayhanti. Ahaṃ pana kena upāyena kena kāraṇena visaṃyutto bhaveyyanti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "136"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Deyyadhammo"
      },
      " annapānādidātabbayuttakaṃ vatthu mayhaṃ natthi, tassābhāvena ahaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "varāko"
      },
      " dukkhito ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhatako"
      },
      " bhatiyā jīvanako ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yaṃnūnāhaṃ pañcasīlaṃ rakkheyyaṃ paripūraya"
      },
      "nti pañcasīlaṃ samādiyitvā paripūrento yaṃnūna rakkheyyaṃ sādhukaṃ bhaddakaṃ sundaraṃ katvā paripāleyyanti attho."
    ],
    "innerText": "136.Deyyadhammo annapānādidātabbayuttakaṃ vatthu mayhaṃ natthi, tassābhāvena ahaṃ varāko dukkhito bhatako bhatiyā jīvanako yaṃnūnāhaṃ pañcasīlaṃ rakkheyyaṃ paripūrayanti pañcasīlaṃ samādiyitvā paripūrento yaṃnūna rakkheyyaṃ sādhukaṃ bhaddakaṃ sundaraṃ katvā paripāleyyanti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "148"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Svāhaṃ yasamanubhavi"
      },
      "nti so ahaṃ devamanussesu mahantaṃ yasaṃ anubhaviṃ tesaṃ sīlānaṃ vāhasā ānubhāvenāti attho. Kappakoṭimpi tesaṃ sīlānaṃ phalaṃ kittento ekakoṭṭhāsameva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kittaye"
      },
      " pākaṭaṃ kareyyanti attho. Sesaṃ suviññeyyamevāti."
    ],
    "innerText": "148.Svāhaṃ yasamanubhavinti so ahaṃ devamanussesu mahantaṃ yasaṃ anubhaviṃ tesaṃ sīlānaṃ vāhasā ānubhāvenāti attho. Kappakoṭimpi tesaṃ sīlānaṃ phalaṃ kittento ekakoṭṭhāsameva kittaye pākaṭaṃ kareyyanti attho. Sesaṃ suviññeyyamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pañcasīlasamādāniyattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Annasaṃsāvakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suvaṇṇavaṇṇaṃ sambuddha"
      },
      "ntiādikaṃ āyasmato annasaṃsāvakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto siddhatthassa bhagavato kāle ekasmiṃ kulagehe nibbatto piṇḍāya carantaṃ dvattiṃsamahāpurisalakkhaṇabyāmappabhāmaṇḍalopasobhitaṃ bhagavantaṃ disvā pasannamānaso bhagavantaṃ nimantetvā gehaṃ netvā varaannapānena santappetvā sampavāretvā bhojesi. So teneva cittappasādena tato cuto devaloke nibbattitvā dibbasampattiṃ anubhavitvā tato cavitvā manussaloke nibbattitvā manussasampattiṃ anubhavitvā tato aparāparaṃ devamanussasampattiyo anubhavitvā imasmiṃ buddhuppāde ekasmiṃ kule nibbatto sāsane pasīditvā pabbajitvā vipassanaṃ vaḍḍhetvā arahattaṃ pāpuṇi. So pubbe katapuññanāmavasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "annasaṃsāvakatthero"
      },
      "ti pākaṭanāmo ahosi."
    ],
    "innerText": "Suvaṇṇavaṇṇaṃ sambuddhantiādikaṃ āyasmato annasaṃsāvakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto siddhatthassa bhagavato kāle ekasmiṃ kulagehe nibbatto piṇḍāya carantaṃ dvattiṃsamahāpurisalakkhaṇabyāmappabhāmaṇḍalopasobhitaṃ bhagavantaṃ disvā pasannamānaso bhagavantaṃ nimantetvā gehaṃ netvā varaannapānena santappetvā sampavāretvā bhojesi. So teneva cittappasādena tato cuto devaloke nibbattitvā dibbasampattiṃ anubhavitvā tato cavitvā manussaloke nibbattitvā manussasampattiṃ anubhavitvā tato aparāparaṃ devamanussasampattiyo anubhavitvā imasmiṃ buddhuppāde ekasmiṃ kule nibbatto sāsane pasīditvā pabbajitvā vipassanaṃ vaḍḍhetvā arahattaṃ pāpuṇi. So pubbe katapuññanāmavasena annasaṃsāvakattheroti pākaṭanāmo ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "155-6"
      },
      ". So ",
      " aparabhāge attano pubbakammaṃ saritvā somanassajāto ‘‘evaṃ mayā iminā puññasambhārānubhāvena pattaṃ arahatta’’nti attano pubbacaritāpadānaṃ udānavasena pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "suvaṇṇavaṇṇa"
      },
      "ntiādimāha ",
      ". Tattha suvaṇṇassa vaṇṇo viya vaṇṇo yassa bhagavato soyaṃ suvaṇṇavaṇṇo, taṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "suvaṇṇavaṇṇaṃ sambuddhaṃ"
      },
      " siddhatthanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gacchantaṃ antarāpaṇe"
      },
      "ti vessānaṃ āpaṇapantīnaṃ antaravīthiyaṃ gacchamānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kañcanagghiyasaṃkāsa"
      },
      "nti suvaṇṇatoraṇasadisaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bāttiṃsavaralakkhaṇaṃ"
      },
      " dvattiṃsavaralakkhaṇehi sampannaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "lokapajjotaṃ"
      },
      " sakalalokadīpabhūtaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "appameyyaṃ"
      },
      " pamāṇavirahitaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anopamaṃ"
      },
      " upamāvirahitaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jutindharaṃ"
      },
      " pabhādhāraṃ nīlapītādichabbaṇṇabuddharaṃsiyo dhārakaṃ siddhatthaṃ disvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paramaṃ"
      },
      " uttamaṃ pītiṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "alatthaṃ"
      },
      " alabhinti sambandho. Sesaṃ suviññeyyamevāti."
    ],
    "innerText": "155-6. So aparabhāge attano pubbakammaṃ saritvā somanassajāto ‘‘evaṃ mayā iminā puññasambhārānubhāvena pattaṃ arahatta’’nti attano pubbacaritāpadānaṃ udānavasena pakāsento suvaṇṇavaṇṇantiādimāha . Tattha suvaṇṇassa vaṇṇo viya vaṇṇo yassa bhagavato soyaṃ suvaṇṇavaṇṇo, taṃ suvaṇṇavaṇṇaṃ sambuddhaṃ siddhatthanti attho. Gacchantaṃ antarāpaṇeti vessānaṃ āpaṇapantīnaṃ antaravīthiyaṃ gacchamānaṃ. Kañcanagghiyasaṃkāsanti suvaṇṇatoraṇasadisaṃ bāttiṃsavaralakkhaṇaṃ dvattiṃsavaralakkhaṇehi sampannaṃ lokapajjotaṃ sakalalokadīpabhūtaṃ appameyyaṃ pamāṇavirahitaṃ anopamaṃ upamāvirahitaṃ jutindharaṃ pabhādhāraṃ nīlapītādichabbaṇṇabuddharaṃsiyo dhārakaṃ siddhatthaṃ disvā paramaṃ uttamaṃ pītiṃ alatthaṃ alabhinti sambandho. Sesaṃ suviññeyyamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Annasaṃsāvakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Dhūpadāyakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Siddhatthassa bhagavato"
      },
      "tiādikaṃ āyasmato dhūpadāyakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto siddhatthassa bhagavato kāle kulagehe nibbatto siddhatthe bhagavati cittaṃ pasādetvā tassa bhagavato gandhakuṭiyaṃ candanāgarukāḷānusāriādinā katehi anekehi dhūpehi dhūpapūjaṃ akāsi. So tena puññena devesu ca manussesu ca ubhayasampattiyo anubhavanto nibbattanibbattabhave pūjanīyo hutvā imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbatto puññasambhārānubhāvena sāsane pabbajitvā vipassanaṃ vaḍḍhetvā arahattaṃ patvā katadhūpapūjāpuññattā nāmena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhūpadāyakatthero"
      },
      "ti sabbattha pākaṭo. So pattaarahattaphalo attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "siddhatthassa bhagavato"
      },
      "tiādimāha. Siddho paripuṇṇo sabbaññutaññāṇādiguṇasaṅkhāto attho payojanaṃ yassa bhagavato soyaṃ siddhattho, tassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "siddhatthassa bhagavato"
      },
      " bhagyādiguṇavantassa lokajeṭṭhassa sakalalokuttamassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tādino"
      },
      " iṭṭhāniṭṭhesu ",
      " tādisassa acalasabhāvassāti attho. Sesaṃ uttānatthamevāti."
    ],
    "innerText": "Siddhatthassa bhagavatotiādikaṃ āyasmato dhūpadāyakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto siddhatthassa bhagavato kāle kulagehe nibbatto siddhatthe bhagavati cittaṃ pasādetvā tassa bhagavato gandhakuṭiyaṃ candanāgarukāḷānusāriādinā katehi anekehi dhūpehi dhūpapūjaṃ akāsi. So tena puññena devesu ca manussesu ca ubhayasampattiyo anubhavanto nibbattanibbattabhave pūjanīyo hutvā imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbatto puññasambhārānubhāvena sāsane pabbajitvā vipassanaṃ vaḍḍhetvā arahattaṃ patvā katadhūpapūjāpuññattā nāmena dhūpadāyakattheroti sabbattha pākaṭo. So pattaarahattaphalo attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ dassento siddhatthassa bhagavatotiādimāha. Siddho paripuṇṇo sabbaññutaññāṇādiguṇasaṅkhāto attho payojanaṃ yassa bhagavato soyaṃ siddhattho, tassa siddhatthassa bhagavato bhagyādiguṇavantassa lokajeṭṭhassa sakalalokuttamassa tādino iṭṭhāniṭṭhesu tādisassa acalasabhāvassāti attho. Sesaṃ uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dhūpadāyakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Pulinapūjakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vipassissa"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhagavato"
      },
      "tiādikaṃ āyasmato pulinapūjakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto vipassissa bhagavato kāle ekasmiṃ kule nibbatto sāsane pasannacitto cetiyaṅgaṇabodhiyaṅgaṇesu ",
      " purāṇavālukaṃ apanetvā navaṃ muttādalasadisapaṇḍarapulinaṃ okiritvā māḷakaṃ alaṅkari. Tena kammena so devaloke nibbatto tattha dibbehi ratanehi vijjotamāne anekayojane kanakavimāne dibbasampattiṃ anubhavitvā tato cuto manussaloke sattaratanasampanno cakkavattī rājā hutvā manussasampattiṃ anubhavitvā aparāparaṃ saṃsaranto imasmiṃ buddhuppāde vibhavasampanne ekasmiṃ kule nibbatto sāsane pasanno pabbajitvā vipassanaṃ vaḍḍhetvā arahattaṃ pāpuṇi. So attano katapuññanāmasadisena nāmena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pulinapūjakatthero"
      },
      "ti pākaṭo."
    ],
    "innerText": "Vipassissabhagavatotiādikaṃ āyasmato pulinapūjakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto vipassissa bhagavato kāle ekasmiṃ kule nibbatto sāsane pasannacitto cetiyaṅgaṇabodhiyaṅgaṇesu purāṇavālukaṃ apanetvā navaṃ muttādalasadisapaṇḍarapulinaṃ okiritvā māḷakaṃ alaṅkari. Tena kammena so devaloke nibbatto tattha dibbehi ratanehi vijjotamāne anekayojane kanakavimāne dibbasampattiṃ anubhavitvā tato cuto manussaloke sattaratanasampanno cakkavattī rājā hutvā manussasampattiṃ anubhavitvā aparāparaṃ saṃsaranto imasmiṃ buddhuppāde vibhavasampanne ekasmiṃ kule nibbatto sāsane pasanno pabbajitvā vipassanaṃ vaḍḍhetvā arahattaṃ pāpuṇi. So attano katapuññanāmasadisena nāmena pulinapūjakattheroti pākaṭo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "165"
      },
      ". So attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vipassissa bhagavato"
      },
      "tiādimāha. Tattha vividhaṃ passatīti vipassī, vivicca passatīti vā vipassī, vividhe attatthaparatthādibhede atthe passatīti vā vipassī, vividhe vohāraparamatthādibhede passatīti vā vipassī, tassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vipassissa bodhiyā pādaputtame"
      },
      " uttame bodhirukkhamaṇḍalamāḷake ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "purāṇapulinaṃ"
      },
      " vālukaṃ chaḍḍetvā suddhaṃ paṇḍaraṃ pulinaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ākiriṃ"
      },
      " santhariṃ. Sesaṃ suviññeyyamevāti."
    ],
    "innerText": "165. So attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ dassento vipassissa bhagavatotiādimāha. Tattha vividhaṃ passatīti vipassī, vivicca passatīti vā vipassī, vividhe attatthaparatthādibhede atthe passatīti vā vipassī, vividhe vohāraparamatthādibhede passatīti vā vipassī, tassa vipassissa bodhiyā pādaputtame uttame bodhirukkhamaṇḍalamāḷake purāṇapulinaṃ vālukaṃ chaḍḍetvā suddhaṃ paṇḍaraṃ pulinaṃ ākiriṃ santhariṃ. Sesaṃ suviññeyyamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pulinapūjakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Uttiyattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Candabhāgānadītīre"
      },
      "tiādikaṃ ",
      " āyasmato uttiyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto siddhatthassa bhagavato kāle candabhāgānadiyaṃ susumāro hutvā nibbatto nadītīraṃ upagataṃ bhagavantaṃ disvā pasannacitto pāraṃ netukāmo tīrasamīpeyeva nipajji. Bhagavā tassa anukampāya piṭṭhiyaṃ pāde ṭhapesi. So tuṭṭho udaggo pītivegena mahussāho hutvā sotaṃ chindanto sīghena javena bhagavantaṃ paratīraṃ nesi. Bhagavā tassa cittappasādaṃ ñatvā ‘‘ayaṃ ito cuto devaloke nibbattissati ",
      ", tato paṭṭhāya sugatīsuyeva saṃsaranto ito catunnavutikappe amataṃ pāpuṇissatī’’ti byākaritvā pakkāmi."
    ],
    "innerText": "Candabhāgānadītīretiādikaṃ āyasmato uttiyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto siddhatthassa bhagavato kāle candabhāgānadiyaṃ susumāro hutvā nibbatto nadītīraṃ upagataṃ bhagavantaṃ disvā pasannacitto pāraṃ netukāmo tīrasamīpeyeva nipajji. Bhagavā tassa anukampāya piṭṭhiyaṃ pāde ṭhapesi. So tuṭṭho udaggo pītivegena mahussāho hutvā sotaṃ chindanto sīghena javena bhagavantaṃ paratīraṃ nesi. Bhagavā tassa cittappasādaṃ ñatvā ‘‘ayaṃ ito cuto devaloke nibbattissati , tato paṭṭhāya sugatīsuyeva saṃsaranto ito catunnavutikappe amataṃ pāpuṇissatī’’ti byākaritvā pakkāmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "So tathā sugatīsuyeva saṃsaranto imasmiṃ buddhuppāde sāvatthiyaṃ aññatarassa brāhmaṇassa putto hutvā nibbatti, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uttiyo"
      },
      "tissa nāmaṃ akaṃsu. So vayappatto ‘‘amataṃ pariyesissāmī’’ti paribbājako hutvā ekadivasaṃ bhagavantaṃ disvā upasaṅkamitvā vanditvā dhammaṃ sutvā paṭiladdhasaddho hutvā sāsane pabbajitvā sīladiṭṭhīnaṃ avisodhitattā visesaṃ nibbattetuṃ asakkonto aññaṃ bhikkhuṃ visesaṃ nibbattetvā aññaṃ byākarontaṃ disvā satthāraṃ upasaṅkamitvā saṅkhepena ovādaṃ yāci. Satthāpi tassa ",
      ", ‘‘tasmātiha tvaṃ, uttiya, ādimeva visodhehī’’tiādinā (saṃ. ni. 5.382) saṅkhepeneva ovādaṃ adāsi. So satthu ovāde ṭhatvā vipassanaṃ ārabhi. Tassa āraddhavipassakassa ābādho uppajji. Uppanne ābādhe jātasaṃvego vīriyārambhavatthuṃ ñatvā vipassanaṃ vaḍḍhetvā arahattaṃ pāpuṇi."
    ],
    "innerText": "So tathā sugatīsuyeva saṃsaranto imasmiṃ buddhuppāde sāvatthiyaṃ aññatarassa brāhmaṇassa putto hutvā nibbatti, uttiyotissa nāmaṃ akaṃsu. So vayappatto ‘‘amataṃ pariyesissāmī’’ti paribbājako hutvā ekadivasaṃ bhagavantaṃ disvā upasaṅkamitvā vanditvā dhammaṃ sutvā paṭiladdhasaddho hutvā sāsane pabbajitvā sīladiṭṭhīnaṃ avisodhitattā visesaṃ nibbattetuṃ asakkonto aññaṃ bhikkhuṃ visesaṃ nibbattetvā aññaṃ byākarontaṃ disvā satthāraṃ upasaṅkamitvā saṅkhepena ovādaṃ yāci. Satthāpi tassa , ‘‘tasmātiha tvaṃ, uttiya, ādimeva visodhehī’’tiādinā (saṃ. ni. 5.382) saṅkhepeneva ovādaṃ adāsi. So satthu ovāde ṭhatvā vipassanaṃ ārabhi. Tassa āraddhavipassakassa ābādho uppajji. Uppanne ābādhe jātasaṃvego vīriyārambhavatthuṃ ñatvā vipassanaṃ vaḍḍhetvā arahattaṃ pāpuṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "169"
      },
      ". Evaṃ so katasambhārānurūpena pattaarahattaphalo attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "candabhāgānadītīre"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "candabhāgānadītīre"
      },
      "ti parisuddhapaṇḍarapulinatalehi ca pabhāsampannapasannamadhurodakaparipuṇṇatāya ca candappabhākiraṇasassirīkābhā nadamānā saddaṃ kurumānā gacchatīti candabhāgānadī, tassā candabhāgānadiyā tīre susumāro ahosinti sambandho. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "susumāro"
      },
      "ti khuddakamacchagumbe khaṇḍākhaṇḍikaṃ karonto māretīti susumāro, caṇḍamaccho kumbhīloti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabhojanapasutoha"
      },
      "nti ahaṃ sabhojane sakagocare pasuto byāvaṭo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nadītitthaṃ agacchaha"
      },
      "nti bhagavato āgamanakāle ahaṃ nadītitthaṃ agacchiṃ pattomhi."
    ],
    "innerText": "169. Evaṃ so katasambhārānurūpena pattaarahattaphalo attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento candabhāgānadītīretiādimāha. Tattha candabhāgānadītīreti parisuddhapaṇḍarapulinatalehi ca pabhāsampannapasannamadhurodakaparipuṇṇatāya ca candappabhākiraṇasassirīkābhā nadamānā saddaṃ kurumānā gacchatīti candabhāgānadī, tassā candabhāgānadiyā tīre susumāro ahosinti sambandho. Tattha susumāroti khuddakamacchagumbe khaṇḍākhaṇḍikaṃ karonto māretīti susumāro, caṇḍamaccho kumbhīloti attho. Sabhojanapasutohanti ahaṃ sabhojane sakagocare pasuto byāvaṭo. Nadītitthaṃ agacchahanti bhagavato āgamanakāle ahaṃ nadītitthaṃ agacchiṃ pattomhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "170"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Siddhattho tamhi samaye"
      },
      "ti tasmiṃ mama titthagamanakāle siddhattho bhagavā aggapuggalo sabbasattesu jeṭṭho seṭṭho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sayambhū"
      },
      " sayameva bhūto jāto buddhabhūto so bhagavā nadiṃ taritukāmo nadītīraṃ upāgami."
    ],
    "innerText": "170.Siddhattho tamhi samayeti tasmiṃ mama titthagamanakāle siddhattho bhagavā aggapuggalo sabbasattesu jeṭṭho seṭṭho sayambhū sayameva bhūto jāto buddhabhūto so bhagavā nadiṃ taritukāmo nadītīraṃ upāgami."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "172"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pettikaṃ visayaṃ mayha"
      },
      "nti mayhaṃ pitupitāmahādīhi paramparānītaṃ, yadidaṃ sampattasampattamahānubhāvānaṃ taraṇanti attho."
    ],
    "innerText": "172.Pettikaṃ visayaṃ mayhanti mayhaṃ pitupitāmahādīhi paramparānītaṃ, yadidaṃ sampattasampattamahānubhāvānaṃ taraṇanti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "173"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mama"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uggajjanaṃ sutvā"
      },
      "ti mayhaṃ uggajjanaṃ ārādhanaṃ sutvā mahāmuni bhagavā abhiruhīti sambandho. Sesaṃ uttānatthamevāti."
    ],
    "innerText": "173.Mamauggajjanaṃ sutvāti mayhaṃ uggajjanaṃ ārādhanaṃ sutvā mahāmuni bhagavā abhiruhīti sambandho. Sesaṃ uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Uttiyattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Ekañjalikattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suvaṇṇavaṇṇa"
      },
      "ntiādikaṃ āyasmato ekañjalikattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto vipassissa bhagavato kāle ekasmiṃ kulagehe nibbatto viññutaṃ patto ratanattaye pasanno piṇḍāya carantaṃ vipassiṃ bhagavantaṃ disvā pasannamānaso añjaliṃ paggahetvā aṭṭhāsi. So tena puññakammena devamanussesu saṃsaranto sabbattha pūjanīyo hutvā ubhayasampattiyo anubhavitvā ",
      " imasmiṃ buddhuppāde vibhavasampanne kule nibbattitvā sāsane pasīditvā pabbajitvā vipassanaṃ vaḍḍhetvā arahatte patiṭṭhāsi. Pubbe katapuññavasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekañjalikatthero"
      },
      "ti pākaṭo."
    ],
    "innerText": "Suvaṇṇavaṇṇantiādikaṃ āyasmato ekañjalikattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto vipassissa bhagavato kāle ekasmiṃ kulagehe nibbatto viññutaṃ patto ratanattaye pasanno piṇḍāya carantaṃ vipassiṃ bhagavantaṃ disvā pasannamānaso añjaliṃ paggahetvā aṭṭhāsi. So tena puññakammena devamanussesu saṃsaranto sabbattha pūjanīyo hutvā ubhayasampattiyo anubhavitvā imasmiṃ buddhuppāde vibhavasampanne kule nibbattitvā sāsane pasīditvā pabbajitvā vipassanaṃ vaḍḍhetvā arahatte patiṭṭhāsi. Pubbe katapuññavasena ekañjalikattheroti pākaṭo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "180"
      },
      ". So attano pubbakammaṃ saritvā taṃ hatthatale āmalakaṃ viya disvā udānavasena pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "suvaṇṇavaṇṇa"
      },
      "ntiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vipassiṃ satthavāhagga"
      },
      "nti vāṇije kantārā vahati tāretīti satthavāho ",
      ". Vāḷakantārā coḷakantārā dubbhikkhakantārā nirudakakantārā yakkhakantārā appabhakkhakantārā ca tāreti uttāreti patāreti nittāreti khemantabhūmiṃ pāpetīti attho. Ko so? Vāṇijajeṭṭhako. Satthavāhasadisattā ayampi bhagavā satthavāho. Tathā hi so tividhaṃ bodhiṃ patthayante katapuññasambhāre satte jātikantārā jarākantārā byādhikantārā maraṇakantārā sokaparidevadukkhadomanassupāyāsakantārā ca sabbasmā saṃsārakantārā ca tāreti uttāreti patāreti nittāreti nibbānathalaṃ pāpetīti attho. Satthavāho ca so aggo seṭṭho padhāno cāti satthavāhaggo, taṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "satthavāhaggaṃ"
      },
      " vipassiṃ sambuddhanti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Naravaraṃ vināyaka"
      },
      "nti narānaṃ antare asithilaparakkamoti naravīro, taṃ. Visesena katapuññasambhāre satte neti nibbānapuraṃ pāpetīti vināyako, taṃ."
    ],
    "innerText": "180. So attano pubbakammaṃ saritvā taṃ hatthatale āmalakaṃ viya disvā udānavasena pubbacaritāpadānaṃ pakāsento suvaṇṇavaṇṇantiādimāha. Vipassiṃ satthavāhagganti vāṇije kantārā vahati tāretīti satthavāho . Vāḷakantārā coḷakantārā dubbhikkhakantārā nirudakakantārā yakkhakantārā appabhakkhakantārā ca tāreti uttāreti patāreti nittāreti khemantabhūmiṃ pāpetīti attho. Ko so? Vāṇijajeṭṭhako. Satthavāhasadisattā ayampi bhagavā satthavāho. Tathā hi so tividhaṃ bodhiṃ patthayante katapuññasambhāre satte jātikantārā jarākantārā byādhikantārā maraṇakantārā sokaparidevadukkhadomanassupāyāsakantārā ca sabbasmā saṃsārakantārā ca tāreti uttāreti patāreti nittāreti nibbānathalaṃ pāpetīti attho. Satthavāho ca so aggo seṭṭho padhāno cāti satthavāhaggo, taṃ satthavāhaggaṃ vipassiṃ sambuddhanti sambandho. Naravaraṃ vināyakanti narānaṃ antare asithilaparakkamoti naravīro, taṃ. Visesena katapuññasambhāre satte neti nibbānapuraṃ pāpetīti vināyako, taṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "181"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adantadamanaṃ tādi"
      },
      "nti rāgadosamohādikilesasampayuttattā kāyavacīmanodvārehi adante satte dametīti adantadamano, taṃ. Iṭṭhāniṭṭhesu akampiyatādiguṇayuttoti tādī, taṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahāvādiṃ mahāmati"
      },
      "nti sakasamayaparasamayavādīnaṃ antare attanā samadhikapuggalavirahitattā mahāvādī ",
      ", mahatī pathavisamānā merusamānā ca mati yassa so mahāmati, taṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mahāvādiṃ mahāmatiṃ"
      },
      " sambuddhanti iminā tulyādhikaraṇaṃ. Sesaṃ suviññeyyamevāti."
    ],
    "innerText": "181.Adantadamanaṃ tādinti rāgadosamohādikilesasampayuttattā kāyavacīmanodvārehi adante satte dametīti adantadamano, taṃ. Iṭṭhāniṭṭhesu akampiyatādiguṇayuttoti tādī, taṃ. Mahāvādiṃ mahāmatinti sakasamayaparasamayavādīnaṃ antare attanā samadhikapuggalavirahitattā mahāvādī , mahatī pathavisamānā merusamānā ca mati yassa so mahāmati, taṃ mahāvādiṃ mahāmatiṃ sambuddhanti iminā tulyādhikaraṇaṃ. Sesaṃ suviññeyyamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ekañjalikattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Khomadāyakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nagare bandhumatiyā"
      },
      "tiādikaṃ āyasmato khomadāyakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto vipassissa bhagavato kāle ekasmiṃ kulagehe nibbatto vayappatto sāsane abhippasanno ratanattayamāmako vipassissa bhagavato santike dhammaṃ sutvā pasannamānaso khomadussena pūjaṃ akāsi. So tadeva mūlaṃ katvā yāvajīvaṃ puññāni katvā tato devaloke nibbatto. Chasu ",
      " devesu aparāparaṃ dibbasukhaṃ ",
      " anubhavitvā tato cavitvā manussaloke cakkavattiādianekavidhamanussasampattiṃ anubhavitvā paripākagate puññasambhāre imasmiṃ buddhuppāde kulagehe nibbatto vayappatto satthu santike dhammaṃ sutvā paṭiladdhasaddho pabbajitvā vipassanaṃ vaḍḍhetvā nacirasseva arahattaṃ pāpuṇi. Katapuññanāmena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "khomadāyakatthero"
      },
      "ti pākaṭo."
    ],
    "innerText": "Nagare bandhumatiyātiādikaṃ āyasmato khomadāyakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto vipassissa bhagavato kāle ekasmiṃ kulagehe nibbatto vayappatto sāsane abhippasanno ratanattayamāmako vipassissa bhagavato santike dhammaṃ sutvā pasannamānaso khomadussena pūjaṃ akāsi. So tadeva mūlaṃ katvā yāvajīvaṃ puññāni katvā tato devaloke nibbatto. Chasu devesu aparāparaṃ dibbasukhaṃ anubhavitvā tato cavitvā manussaloke cakkavattiādianekavidhamanussasampattiṃ anubhavitvā paripākagate puññasambhāre imasmiṃ buddhuppāde kulagehe nibbatto vayappatto satthu santike dhammaṃ sutvā paṭiladdhasaddho pabbajitvā vipassanaṃ vaḍḍhetvā nacirasseva arahattaṃ pāpuṇi. Katapuññanāmena khomadāyakattheroti pākaṭo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "184"
      },
      ". So attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nagare bandhumatiyā"
      },
      "tiādimāha. Tattha bandhu vuccati ñātako, te bandhū yasmiṃ nagare aññamaññaṃ saṅghaṭitā vasanti, taṃ nagaraṃ ‘‘bandhumatī’’ti vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ropemi bījasampada"
      },
      "nti dānasīlādipuññabījasampattiṃ ropemi paṭṭhapemīti attho."
    ],
    "innerText": "184. So attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ dassento nagare bandhumatiyātiādimāha. Tattha bandhu vuccati ñātako, te bandhū yasmiṃ nagare aññamaññaṃ saṅghaṭitā vasanti, taṃ nagaraṃ ‘‘bandhumatī’’ti vuccati. Ropemi bījasampadanti dānasīlādipuññabījasampattiṃ ropemi paṭṭhapemīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Khomadāyakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tatiyassa subhūtivaggassa vaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Catubhāṇavāravaṇṇanā niṭṭhitā."
  }
]