[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "15. Chattavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Atichattiyattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parinibbute"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhagavatī"
      },
      "tiādikaṃ āyasmato atichattiyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto atthadassissa bhagavato kāle ekasmiṃ kulagehe nibbatto dharamānassa bhagavato adiṭṭhattā parinibbutakāle ‘‘aho mama parihānī’’ti cintetvā ‘‘mama jātiṃ saphalaṃ karissāmī’’ti katasanniṭṭhāno chattādhichattaṃ kāretvā tassa bhagavato sarīradhātuṃ nihitadhātugabbhaṃ pūjesi. Aparabhāge pupphacchattaṃ kāretvā tameva dhātugabbhaṃ ",
      " pūjesi. So teneva puññena devamanussesu saṃsaranto ubhayasampattiyo anubhavitvā imasmiṃ buddhuppāde gahapatikule nibbatto viññutaṃ patto satthari pasanno pabbajitvā kammaṭṭhānaṃ gahetvā vāyamanto nacirasseva arahattaṃ pāpuṇi."
    ],
    "innerText": "Parinibbutebhagavatītiādikaṃ āyasmato atichattiyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto atthadassissa bhagavato kāle ekasmiṃ kulagehe nibbatto dharamānassa bhagavato adiṭṭhattā parinibbutakāle ‘‘aho mama parihānī’’ti cintetvā ‘‘mama jātiṃ saphalaṃ karissāmī’’ti katasanniṭṭhāno chattādhichattaṃ kāretvā tassa bhagavato sarīradhātuṃ nihitadhātugabbhaṃ pūjesi. Aparabhāge pupphacchattaṃ kāretvā tameva dhātugabbhaṃ pūjesi. So teneva puññena devamanussesu saṃsaranto ubhayasampattiyo anubhavitvā imasmiṃ buddhuppāde gahapatikule nibbatto viññutaṃ patto satthari pasanno pabbajitvā kammaṭṭhānaṃ gahetvā vāyamanto nacirasseva arahattaṃ pāpuṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      ". So attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "parinibbute bhagavatī"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "chattātichatta"
      },
      "nti chādiyati saṃvariyati ātapādinti chattaṃ, chattassa atichattaṃ chattassa upari katachattaṃ chattātichattaṃ, chattassa uparūpari chattanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Thūpamhi abhiropayi"
      },
      "nti thūpiyati rāsikarīyatīti thūpo, atha vā thūpati thirabhāvena vuddhiṃ virūḷhiṃ vepullaṃ āpajjamāno patiṭṭhātīti thūpo, tasmiṃ thūpamhi mayā kāritaṃ chattaṃ uparūpari ṭhapanavasena abhi visesena āropayiṃ pūjesinti attho."
    ],
    "innerText": "1. So attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento parinibbute bhagavatītiādimāha. Tattha chattātichattanti chādiyati saṃvariyati ātapādinti chattaṃ, chattassa atichattaṃ chattassa upari katachattaṃ chattātichattaṃ, chattassa uparūpari chattanti attho. Thūpamhi abhiropayinti thūpiyati rāsikarīyatīti thūpo, atha vā thūpati thirabhāvena vuddhiṃ virūḷhiṃ vepullaṃ āpajjamāno patiṭṭhātīti thūpo, tasmiṃ thūpamhi mayā kāritaṃ chattaṃ uparūpari ṭhapanavasena abhi visesena āropayiṃ pūjesinti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "2"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pupphacchadanaṃ katvānā"
      },
      "ti vikasitehi sugandhehi anekehi phupphehi chadanaṃ chattupari vitānaṃ katvā pūjesinti attho. Sesaṃ sabbattha uttānatthamevāti."
    ],
    "innerText": "2.Pupphacchadanaṃ katvānāti vikasitehi sugandhehi anekehi phupphehi chadanaṃ chattupari vitānaṃ katvā pūjesinti attho. Sesaṃ sabbattha uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Atichattiyattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Thambhāropakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nibbute"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "lokanāthamhī"
      },
      "tiādikaṃ āyasmato thambhāropakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto dhammadassissa bhagavato ",
      " kāle kulagehe nibbatto saddho pasanno parinibbute bhagavati tassa bhagavato dhātugabbhamāḷake thambhaṃ nikhanitvā dhajaṃ āropesi. Bahūni jātisumanapupphāni ganthitvā nisseṇiyā ārohitvā pūjesi."
    ],
    "innerText": "Nibbutelokanāthamhītiādikaṃ āyasmato thambhāropakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto dhammadassissa bhagavato kāle kulagehe nibbatto saddho pasanno parinibbute bhagavati tassa bhagavato dhātugabbhamāḷake thambhaṃ nikhanitvā dhajaṃ āropesi. Bahūni jātisumanapupphāni ganthitvā nisseṇiyā ārohitvā pūjesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "5"
      },
      ". So yāvatāyukaṃ ṭhatvā kālaṃ katvā devamanussesu saṃsaranto ubhayasampattiyo anubhavitvā sabbattha pūjito imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbatto daharakālato pabhuti pūjanīyo sāsane baddhasaddho pabbajitvā saha paṭisambhidāhi arahattaṃ patto ",
      " attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nibbute lokanāthamhī"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nibbute lokanāthamhī"
      },
      "ti sakalalokassa nāthe padhānabhūte paṭisaraṇe ca satthari khandhaparinibbānena nibbute nibbutadīpasikhā viya adassanaṃ gateti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammadassīnarāsabhe"
      },
      "ti catusaccadhammaṃ passatīti dhammadassī, atha vā satipaṭṭhānādike sattatiṃsabodhipakkhiyadhamme dassanasīlo passanasīloti dhammadassī, narānaṃ āsabho pavaro uttamoti narāsabho, dhammadassī ca so narāsabho ceti dhammadassīnarāsabho, tasmiṃ dhammadassīnarāsabhe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āropesiṃ dhajaṃ thambha"
      },
      "nti cetiyamāḷake thambhaṃ nikhanitvā tattha dhajaṃ āropesiṃ bandhitvā ṭhapesinti attho."
    ],
    "innerText": "5. So yāvatāyukaṃ ṭhatvā kālaṃ katvā devamanussesu saṃsaranto ubhayasampattiyo anubhavitvā sabbattha pūjito imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbatto daharakālato pabhuti pūjanīyo sāsane baddhasaddho pabbajitvā saha paṭisambhidāhi arahattaṃ patto attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento nibbute lokanāthamhītiādimāha. Tattha nibbute lokanāthamhīti sakalalokassa nāthe padhānabhūte paṭisaraṇe ca satthari khandhaparinibbānena nibbute nibbutadīpasikhā viya adassanaṃ gateti attho. Dhammadassīnarāsabheti catusaccadhammaṃ passatīti dhammadassī, atha vā satipaṭṭhānādike sattatiṃsabodhipakkhiyadhamme dassanasīlo passanasīloti dhammadassī, narānaṃ āsabho pavaro uttamoti narāsabho, dhammadassī ca so narāsabho ceti dhammadassīnarāsabho, tasmiṃ dhammadassīnarāsabhe. Āropesiṃ dhajaṃ thambhanti cetiyamāḷake thambhaṃ nikhanitvā tattha dhajaṃ āropesiṃ bandhitvā ṭhapesinti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "6"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nisseṇiṃ māpayitvānā"
      },
      "ti nissāya taṃ iṇanti gacchanti ārohanti uparīti nisseṇi, taṃ nisseṇiṃ māpayitvā kāretvā bandhitvā thūpaseṭṭhaṃ samāruhinti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jātipupphaṃ gahetvānā"
      },
      "ti jāyamānameva janānaṃ sundaraṃ manaṃ karotīti jātisumanaṃ, jātisumanameva pupphaṃ ‘‘jātisumanapuppha’’nti vattabbe gāthābandhasukhatthaṃ sumanasaddassa lopaṃ katvā ‘‘jātipuppha’’nti vuttaṃ, taṃ jātisumanapupphaṃ gahetvā ganthitvā thūpamhi āropayiṃ, āropetvā pūjesinti attho. Sesaṃ suviññeyyamevāti."
    ],
    "innerText": "6.Nisseṇiṃ māpayitvānāti nissāya taṃ iṇanti gacchanti ārohanti uparīti nisseṇi, taṃ nisseṇiṃ māpayitvā kāretvā bandhitvā thūpaseṭṭhaṃ samāruhinti sambandho. Jātipupphaṃ gahetvānāti jāyamānameva janānaṃ sundaraṃ manaṃ karotīti jātisumanaṃ, jātisumanameva pupphaṃ ‘‘jātisumanapuppha’’nti vattabbe gāthābandhasukhatthaṃ sumanasaddassa lopaṃ katvā ‘‘jātipuppha’’nti vuttaṃ, taṃ jātisumanapupphaṃ gahetvā ganthitvā thūpamhi āropayiṃ, āropetvā pūjesinti attho. Sesaṃ suviññeyyamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Thambhāropakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Vedikārakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nibbute"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "lokanāthamhī"
      },
      "tiādikaṃ āyasmato vedikārakattherassa apadānaṃ. Ayampi purimajinavaresu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto piyadassissa bhagavato kāle vibhavasampanne ekasmiṃ kule nibbatto viññutaṃ patvā gharāvāsaṃ saṇṭhapetvā nibbute satthari pasanno tassa cetiye valayaṃ kāresi, sattahi ratanehi paripūretvā mahāpūjaṃ kāresi. So ",
      " tena puññena devamanussesu saṃsaranto anekesu jātisatasahassesu pūjanīyo mahaddhano mahābhogo ubhayasukhaṃ anubhavitvā imasmiṃ buddhuppāde kulagehe nibbatto vibhavasampanno pabbajitvā vāyamanto nacirasseva arahā ahosi."
    ],
    "innerText": "Nibbutelokanāthamhītiādikaṃ āyasmato vedikārakattherassa apadānaṃ. Ayampi purimajinavaresu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto piyadassissa bhagavato kāle vibhavasampanne ekasmiṃ kule nibbatto viññutaṃ patvā gharāvāsaṃ saṇṭhapetvā nibbute satthari pasanno tassa cetiye valayaṃ kāresi, sattahi ratanehi paripūretvā mahāpūjaṃ kāresi. So tena puññena devamanussesu saṃsaranto anekesu jātisatasahassesu pūjanīyo mahaddhano mahābhogo ubhayasukhaṃ anubhavitvā imasmiṃ buddhuppāde kulagehe nibbatto vibhavasampanno pabbajitvā vāyamanto nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "10"
      },
      ". So ",
      " ekadivasaṃ attano pubbe katakusalaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nibbute lokanāthamhī"
      },
      "tiādimāha. Taṃ heṭṭhā vuttatthameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Piyadassīnaruttame"
      },
      "ti piyaṃ somanassākāraṃ dassanaṃ yassa so piyadassī, ārohapariṇāhadvattiṃsamahāpurisalakkhaṇaasītānubyañjanabyāmappabhāmaṇḍalehi sādhu mahājanappasādaṃ janayanākāradassanoti attho. Narānaṃ uttamoti naruttamo, piyadassī ca so naruttamo ceti piyadassīnaruttamo, tasmiṃ piyadassīnaruttame nibbute dhātugabbhamhi muttavediṃ ahaṃ akāsinti sambandho. Pupphādhāratthāya pariyosāne vedikāvalayaṃ akāsinti attho."
    ],
    "innerText": "10. So ekadivasaṃ attano pubbe katakusalaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento nibbute lokanāthamhītiādimāha. Taṃ heṭṭhā vuttatthameva. Piyadassīnaruttameti piyaṃ somanassākāraṃ dassanaṃ yassa so piyadassī, ārohapariṇāhadvattiṃsamahāpurisalakkhaṇaasītānubyañjanabyāmappabhāmaṇḍalehi sādhu mahājanappasādaṃ janayanākāradassanoti attho. Narānaṃ uttamoti naruttamo, piyadassī ca so naruttamo ceti piyadassīnaruttamo, tasmiṃ piyadassīnaruttame nibbute dhātugabbhamhi muttavediṃ ahaṃ akāsinti sambandho. Pupphādhāratthāya pariyosāne vedikāvalayaṃ akāsinti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "11"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Maṇīhi parivāretvā"
      },
      "ti maṇati jotati pabhāsatīti maṇi, atha vā janānaṃ manaṃ pūrento somanassaṃ karonto ito gato pavattoti maṇi, jātiraṅgamaṇiveḷuriyamaṇiādīhi anekehi maṇīhi katavedikāvalayaṃ parivāretvā uttamaṃ mahāpūjaṃ akāsinti attho. Sesaṃ uttānatthamevāti."
    ],
    "innerText": "11.Maṇīhi parivāretvāti maṇati jotati pabhāsatīti maṇi, atha vā janānaṃ manaṃ pūrento somanassaṃ karonto ito gato pavattoti maṇi, jātiraṅgamaṇiveḷuriyamaṇiādīhi anekehi maṇīhi katavedikāvalayaṃ parivāretvā uttamaṃ mahāpūjaṃ akāsinti attho. Sesaṃ uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vedikārakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Saparivāriyattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Padumuttaro nāma jino"
      },
      "tiādikaṃ āyasmato saparivāriyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro anekāsu jātīsu vivaṭṭūpanissayāni puññāni upacinanto padumuttarassa bhagavato ",
      " kāle kulagehe nibbatto viññutaṃ patto mahaddhano mahābhogo ahosi. Atha padumuttare bhagavati parinibbute mahājano tassa dhātuṃ nidahitvā mahantaṃ cetiyaṃ kāretvā pūjesi. Tasmiṃ kāle ayaṃ upāsako tassupari candanasārena cetiyagharaṃ karitvā mahāpūjaṃ akāsi. So teneva puññena devamanussesu saṃsaranto ubhayasampattiyo anubhavitvā imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbatto vuddhimanvāya kusalaṃ katvā saddhāya sāsane pabbajitvā nacirasseva arahā ahosi."
    ],
    "innerText": "Padumuttaro nāma jinotiādikaṃ āyasmato saparivāriyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro anekāsu jātīsu vivaṭṭūpanissayāni puññāni upacinanto padumuttarassa bhagavato kāle kulagehe nibbatto viññutaṃ patto mahaddhano mahābhogo ahosi. Atha padumuttare bhagavati parinibbute mahājano tassa dhātuṃ nidahitvā mahantaṃ cetiyaṃ kāretvā pūjesi. Tasmiṃ kāle ayaṃ upāsako tassupari candanasārena cetiyagharaṃ karitvā mahāpūjaṃ akāsi. So teneva puññena devamanussesu saṃsaranto ubhayasampattiyo anubhavitvā imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbatto vuddhimanvāya kusalaṃ katvā saddhāya sāsane pabbajitvā nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "15-8"
      },
      ". So ",
      " aparabhāge attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "padumuttaro nāma jino"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "omatta"
      },
      "nti lāmakabhāvaṃ nīcabhāvaṃ dukkhitabhāvaṃ vā na passāmi na jānāmi, na diṭṭhapubbo mayā nīcabhāvoti attho. Sesaṃ pākaṭamevāti."
    ],
    "innerText": "15-8. So aparabhāge attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento padumuttaro nāma jinotiādimāha. Tattha omattanti lāmakabhāvaṃ nīcabhāvaṃ dukkhitabhāvaṃ vā na passāmi na jānāmi, na diṭṭhapubbo mayā nīcabhāvoti attho. Sesaṃ pākaṭamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Saparivāriyattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Umāpupphiyattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nibbute lokamahite"
      },
      "tiādikaṃ āyasmato umāpupphiyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto siddhatthassa bhagavato kāle kulagehe nibbatto vuddhippatto gharāvāsaṃ saṇṭhapetvā vasanto nibbutassa bhagavato cetiyamahe vattamāne indanīlamaṇivaṇṇaṃ umāpupphaṃ gahetvā pūjesi. So tena puññena sugatīsuyeva saṃsaranto dibbamānusasampattiyo anubhavitvā uppannuppannabhave bahulaṃ nīlavaṇṇo jātisampanno vibhavasampanno ahosi. So imasmiṃ buddhuppāde vibhavasampanne ekasmiṃ kulagehe nibbatto viññutaṃ patvā saddhājāto pabbajito nacirasseva arahattaṃ pāpuṇi."
    ],
    "innerText": "Nibbute lokamahitetiādikaṃ āyasmato umāpupphiyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto siddhatthassa bhagavato kāle kulagehe nibbatto vuddhippatto gharāvāsaṃ saṇṭhapetvā vasanto nibbutassa bhagavato cetiyamahe vattamāne indanīlamaṇivaṇṇaṃ umāpupphaṃ gahetvā pūjesi. So tena puññena sugatīsuyeva saṃsaranto dibbamānusasampattiyo anubhavitvā uppannuppannabhave bahulaṃ nīlavaṇṇo jātisampanno vibhavasampanno ahosi. So imasmiṃ buddhuppāde vibhavasampanne ekasmiṃ kulagehe nibbatto viññutaṃ patvā saddhājāto pabbajito nacirasseva arahattaṃ pāpuṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "21"
      },
      ". So pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nibbute lokamahite"
      },
      "tiādi vuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "lokamahite"
      },
      "ti lokehi mahito pūjitoti lokamahito, tasmiṃ lokamahite siddhatthamhi bhagavati parinibbuteti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āhutīnaṃpaṭiggahe"
      },
      "ti āhutino vuccanti pūjāsakkārā, tesaṃ āhutīnaṃ paṭiggahetuṃ arahatīti āhutīnaṃpaṭiggaho, aluttakitantasamāso, tasmiṃ āhutīnaṃpaṭiggahe bhagavati parinibbuteti attho."
    ],
    "innerText": "21. So pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento nibbute lokamahitetiādi vuttaṃ. Tattha lokamahiteti lokehi mahito pūjitoti lokamahito, tasmiṃ lokamahite siddhatthamhi bhagavati parinibbuteti sambandho. Āhutīnaṃpaṭiggaheti āhutino vuccanti pūjāsakkārā, tesaṃ āhutīnaṃ paṭiggahetuṃ arahatīti āhutīnaṃpaṭiggaho, aluttakitantasamāso, tasmiṃ āhutīnaṃpaṭiggahe bhagavati parinibbuteti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "22"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Umāpuppha"
      },
      "nti ",
      " uddhamuddhaṃ nīlapabhaṃ muñcamānaṃ pupphati vikasatīti umāpupphaṃ, taṃ umāpupphaṃ gahetvā cetiye pūjaṃ akāsinti attho. Sesaṃ uttānatthamevāti."
    ],
    "innerText": "22.Umāpupphanti uddhamuddhaṃ nīlapabhaṃ muñcamānaṃ pupphati vikasatīti umāpupphaṃ, taṃ umāpupphaṃ gahetvā cetiye pūjaṃ akāsinti attho. Sesaṃ uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Umāpupphiyattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Anulepadāyakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anomadassīmunino"
      },
      "tiādikaṃ ",
      " āyasmato anulepadāyakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto anomadassissa bhagavato kāle kulagehe nibbatto mahaddhano mahābhogo tassa bhagavato bodhirukkhassa vedikāvalayaṃ kāretvā sudhākammañca kāretvā vālukasantharaṇaṃ daddaḷhamānaṃ rajatavimānamiva kāresi. So tena puññena sukhappatto uppannuppannabhave rajatavimānarajatageharajatapāsādesu ",
      " sukhamanubhavitvā imasmiṃ buddhuppāde kulagehe nibbatto viññutaṃ patvā satthari pasanno pabbajitvā vipassanamanuyutto nacirasseva arahā ahosi."
    ],
    "innerText": "Anomadassīmuninotiādikaṃ āyasmato anulepadāyakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto anomadassissa bhagavato kāle kulagehe nibbatto mahaddhano mahābhogo tassa bhagavato bodhirukkhassa vedikāvalayaṃ kāretvā sudhākammañca kāretvā vālukasantharaṇaṃ daddaḷhamānaṃ rajatavimānamiva kāresi. So tena puññena sukhappatto uppannuppannabhave rajatavimānarajatageharajatapāsādesu sukhamanubhavitvā imasmiṃ buddhuppāde kulagehe nibbatto viññutaṃ patvā satthari pasanno pabbajitvā vipassanamanuyutto nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "26"
      },
      ". So aparabhāge ‘‘kiṃ nu kho kusalaṃ katvā mayā ayaṃ viseso adhigato’’ti pubbenivāsānussatiñāṇena paṭipāṭiyā anussaritvā pubbe katakusalaṃ jānitvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anomadassīmunino"
      },
      "tiādimāha. Tattha anomaṃ alāmakaṃ dassanaṃ dassanīyaṃ sarīraṃ yassa so anomadassī, dvattiṃsamahāpurisalakkhaṇaasītānubyañjanabyāmappabhāsamujjalavirājitasarīrattā sundaradassanoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sudhāya piṇḍaṃ datvānā"
      },
      "ti bodhighare vedikāvalayaṃ kāretvā sakale bodhighare sudhālepanaṃ katvāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāṇikammaṃ akāsaha"
      },
      "nti sārakaṭṭhena phalakapāṇiyo katvā tāhi pāṇīhi maṭṭhakammaṃ akāsinti attho. Sesaṃ suviññeyyamevāti."
    ],
    "innerText": "26. So aparabhāge ‘‘kiṃ nu kho kusalaṃ katvā mayā ayaṃ viseso adhigato’’ti pubbenivāsānussatiñāṇena paṭipāṭiyā anussaritvā pubbe katakusalaṃ jānitvā somanassajāto pubbacaritāpadānaṃ pakāsento anomadassīmuninotiādimāha. Tattha anomaṃ alāmakaṃ dassanaṃ dassanīyaṃ sarīraṃ yassa so anomadassī, dvattiṃsamahāpurisalakkhaṇaasītānubyañjanabyāmappabhāsamujjalavirājitasarīrattā sundaradassanoti attho. Sudhāya piṇḍaṃ datvānāti bodhighare vedikāvalayaṃ kāretvā sakale bodhighare sudhālepanaṃ katvāti attho. Pāṇikammaṃ akāsahanti sārakaṭṭhena phalakapāṇiyo katvā tāhi pāṇīhi maṭṭhakammaṃ akāsinti attho. Sesaṃ suviññeyyamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Anulepadāyakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Maggadāyakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uttaritvāna nadika"
      },
      "ntiādikaṃ āyasmato maggadāyakattherassa apadānaṃ. Ayampi purimajinavaresu ",
      " katādhikāro anekesu bhavesu nibbānādhigamatthāya puññāni upacinanto siddhatthassa bhagavato kāle lokasammate kule nibbatto vuddhimanvāya gharāvāsaṃ vasanto ekadivasaṃ bhagavantaṃ ekaṃ nadiṃ uttaritvā vanantaraṃ gacchantaṃ disvā pasannamānaso ‘‘idāni mayā bhagavato maggaṃ samaṃ kātuṃ vaṭṭatī’’ti cintetvā kudālañca piṭakañca ",
      " ādāya bhagavato gamanamaggaṃ samaṃ katvā vālukaṃ okiritvā bhagavato pāde vanditvā, ‘‘bhante, iminā maggālaṅkārakaraṇena nibbattanibbattaṭṭhāne pūjanīyo bhaveyyaṃ, nibbānañca pāpuṇeyya’’nti patthanaṃ akāsi. Bhagavā ‘‘yathādhippāyaṃ samijjhatū’’ti anumodanaṃ vatvā pakkāmi."
    ],
    "innerText": "Uttaritvāna nadikantiādikaṃ āyasmato maggadāyakattherassa apadānaṃ. Ayampi purimajinavaresu katādhikāro anekesu bhavesu nibbānādhigamatthāya puññāni upacinanto siddhatthassa bhagavato kāle lokasammate kule nibbatto vuddhimanvāya gharāvāsaṃ vasanto ekadivasaṃ bhagavantaṃ ekaṃ nadiṃ uttaritvā vanantaraṃ gacchantaṃ disvā pasannamānaso ‘‘idāni mayā bhagavato maggaṃ samaṃ kātuṃ vaṭṭatī’’ti cintetvā kudālañca piṭakañca ādāya bhagavato gamanamaggaṃ samaṃ katvā vālukaṃ okiritvā bhagavato pāde vanditvā, ‘‘bhante, iminā maggālaṅkārakaraṇena nibbattanibbattaṭṭhāne pūjanīyo bhaveyyaṃ, nibbānañca pāpuṇeyya’’nti patthanaṃ akāsi. Bhagavā ‘‘yathādhippāyaṃ samijjhatū’’ti anumodanaṃ vatvā pakkāmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "32-3"
      },
      ". So tena puññena devamanussesu saṃsaranto sabbattha pūjito ahosi. Imasmiṃ pana buddhuppāde pākaṭe ekasmiṃ kule nibbatto satthari pasanno pabbajitvā vipassanaṃ vaḍḍhetvā nacirasseva arahattaṃ patvā attano pubbakammaṃ paccakkhato ñatvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uttaritvāna nadika"
      },
      "ntiādimāha. Tattha nadati saddaṃ karoti gacchatīti nadī, nadīyeva nadikā, taṃ nadikaṃ uttaritvā atikkamitvāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kudālapiṭakamādāyā"
      },
      "ti ",
      " ku vuccati pathavī, taṃ vidālane padālane chindane alanti kudālaṃ, piṭakaṃ vuccati paṃsuvālikādivāhakaṃ, tālapaṇṇavettalatādīhi katabhājanaṃ, kudālañca piṭakañca kudālapiṭakaṃ, taṃ ādāya gahetvāti attho. Sesaṃ uttānatthamevāti."
    ],
    "innerText": "32-3. So tena puññena devamanussesu saṃsaranto sabbattha pūjito ahosi. Imasmiṃ pana buddhuppāde pākaṭe ekasmiṃ kule nibbatto satthari pasanno pabbajitvā vipassanaṃ vaḍḍhetvā nacirasseva arahattaṃ patvā attano pubbakammaṃ paccakkhato ñatvā somanassajāto pubbacaritāpadānaṃ pakāsento uttaritvāna nadikantiādimāha. Tattha nadati saddaṃ karoti gacchatīti nadī, nadīyeva nadikā, taṃ nadikaṃ uttaritvā atikkamitvāti attho. Kudālapiṭakamādāyāti ku vuccati pathavī, taṃ vidālane padālane chindane alanti kudālaṃ, piṭakaṃ vuccati paṃsuvālikādivāhakaṃ, tālapaṇṇavettalatādīhi katabhājanaṃ, kudālañca piṭakañca kudālapiṭakaṃ, taṃ ādāya gahetvāti attho. Sesaṃ uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Maggadāyakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Phalakadāyakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yānakāro pure āsi"
      },
      "ntiādikaṃ āyasmato phalakadāyakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro anekesu attabhāvesu katapuññasambhāro siddhatthassa bhagavato kāle vaḍḍhakikule nibbatto ratanattaye pasanno candanena ālambanaphalakaṃ katvā bhagavato adāsi. Bhagavā tassānumodanaṃ akāsi."
    ],
    "innerText": "Yānakāro pure āsintiādikaṃ āyasmato phalakadāyakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro anekesu attabhāvesu katapuññasambhāro siddhatthassa bhagavato kāle vaḍḍhakikule nibbatto ratanattaye pasanno candanena ālambanaphalakaṃ katvā bhagavato adāsi. Bhagavā tassānumodanaṃ akāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "37"
      },
      ". So tena puññena devamanussesu saṃsaranto sabbattha kāle cittasukhapīṇito ubhayasampattiyo anubhavitvā imasmiṃ buddhuppāde kulagehe nibbatto viññutaṃ patvā satthu dhammadesanaṃ sutvā sañjātappasādo pabbajitvā vāyamanto nacirasseva saha paṭisambhidāhi arahattaṃ ",
      " patvā attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yānakāro pure āsi"
      },
      "ntiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yānakāro"
      },
      "ti yanti etena icchiticchitaṭṭhānanti yānaṃ, taṃ karotīti yānakāro, pure buddhadassanasamaye ahaṃ yānakāro āsiṃ ahosinti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Candanaṃ phalakaṃ katvā"
      },
      "ti candati pariḷāhaṃ vūpasametīti candanaṃ. Atha vā candanti sugandhavāsanatthaṃ sarīraṃ vilimpanti etenāti candanaṃ, taṃ ālambanaphalakaṃ katvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lokabandhuno"
      },
      "ti sakalalokassa bandhu ñātibhūtoti lokabandhu, tassa lokabandhuno satthussa adāsinti attho. Sesaṃ suviññeyyamevāti."
    ],
    "innerText": "37. So tena puññena devamanussesu saṃsaranto sabbattha kāle cittasukhapīṇito ubhayasampattiyo anubhavitvā imasmiṃ buddhuppāde kulagehe nibbatto viññutaṃ patvā satthu dhammadesanaṃ sutvā sañjātappasādo pabbajitvā vāyamanto nacirasseva saha paṭisambhidāhi arahattaṃ patvā attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento yānakāro pure āsintiādimāha. Tattha yānakāroti yanti etena icchiticchitaṭṭhānanti yānaṃ, taṃ karotīti yānakāro, pure buddhadassanasamaye ahaṃ yānakāro āsiṃ ahosinti attho. Candanaṃ phalakaṃ katvāti candati pariḷāhaṃ vūpasametīti candanaṃ. Atha vā candanti sugandhavāsanatthaṃ sarīraṃ vilimpanti etenāti candanaṃ, taṃ ālambanaphalakaṃ katvā. Lokabandhunoti sakalalokassa bandhu ñātibhūtoti lokabandhu, tassa lokabandhuno satthussa adāsinti attho. Sesaṃ suviññeyyamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Phalakadāyakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Vaṭaṃsakiyattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sumedho nāma nāmenā"
      },
      "tiādikaṃ āyasmato vaṭaṃsakiyattherassa apadānaṃ. Ayampi purimamunindesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto sumedhassa bhagavato kāle kulagehe nibbatto viññutaṃ patto gharāvāsaṃ saṇṭhapetvā tattha ādīnavaṃ disvā gehaṃ pahāya tāpasapabbajjaṃ pabbajitvā mahāvane vihāsi. Tasmiṃ samaye sumedho bhagavā vivekakāmatāya taṃ vanaṃ sampāpuṇi. Atha so tāpaso bhagavantaṃ ",
      " disvā pasannamānaso vikasitaṃ saḷalapupphaṃ gahetvā vaṭaṃsakākārena ganthetvā bhagavato pādamūle ṭhapetvā pūjesi. Bhagavā tassa cittappasādatthāya anumodanamakāsi. So tena puññena devamanussesu saṃsaranto ubhayasampattiyo anubhavitvā imasmiṃ buddhuppāde vibhavasampanne kule jāto vuddhimanvāya saddho pasanno pabbajitvā nacirasseva arahā ahosi."
    ],
    "innerText": "Sumedho nāma nāmenātiādikaṃ āyasmato vaṭaṃsakiyattherassa apadānaṃ. Ayampi purimamunindesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto sumedhassa bhagavato kāle kulagehe nibbatto viññutaṃ patto gharāvāsaṃ saṇṭhapetvā tattha ādīnavaṃ disvā gehaṃ pahāya tāpasapabbajjaṃ pabbajitvā mahāvane vihāsi. Tasmiṃ samaye sumedho bhagavā vivekakāmatāya taṃ vanaṃ sampāpuṇi. Atha so tāpaso bhagavantaṃ disvā pasannamānaso vikasitaṃ saḷalapupphaṃ gahetvā vaṭaṃsakākārena ganthetvā bhagavato pādamūle ṭhapetvā pūjesi. Bhagavā tassa cittappasādatthāya anumodanamakāsi. So tena puññena devamanussesu saṃsaranto ubhayasampattiyo anubhavitvā imasmiṃ buddhuppāde vibhavasampanne kule jāto vuddhimanvāya saddho pasanno pabbajitvā nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "43"
      },
      ". So aparabhāge pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sumedho nāma nāmenā"
      },
      "tiādi vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vivekamanubrūhanto"
      },
      "ti janākiṇṇataṃ pahāya janavivekaṃ cittavivekañca anubrūhanto vaḍḍhento bahulīkaronto mahāvanaṃ ajjhogāhi pāvisīti attho. Sesaṃ uttānatthamevāti."
    ],
    "innerText": "43. So aparabhāge pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento sumedho nāma nāmenātiādi vuttaṃ. Vivekamanubrūhantoti janākiṇṇataṃ pahāya janavivekaṃ cittavivekañca anubrūhanto vaḍḍhento bahulīkaronto mahāvanaṃ ajjhogāhi pāvisīti attho. Sesaṃ uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vaṭaṃsakiyattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Pallaṅkadāyakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sumedhassa"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhagavato"
      },
      "tiādikaṃ āyasmato pallaṅkadāyakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro anekesu bhavesu nibbānādhigamatthāya katapuññūpacayo sumedhassa bhagavato kāle gahapatikule nibbatto vuddhimanvāya mahābhogasampanno satthari pasīditvā dhammaṃ sutvā tassa satthuno sattaratanamayaṃ pallaṅkaṃ kāretvā mahantaṃ pūjaṃ akāsi. So tena puññena devamanussesu saṃsaranto sabbattha pūjito ahosi. So anukkamena imasmiṃ buddhuppāde vibhavasampanne ekasmiṃ kule nibbatto viññutaṃ patto gharāvāsaṃ saṇṭhapetvā satthu dhammadesanaṃ sutvā pasanno pabbajitvā nacirasseva arahattaṃ patvā pubbe katapuññanāmena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pallaṅkadāyakatthero"
      },
      "ti pākaṭo ahosi. Heṭṭhā viya uparipi pubbe katapuññanāmena therānaṃ nāmāni evameva veditabbāni."
    ],
    "innerText": "Sumedhassabhagavatotiādikaṃ āyasmato pallaṅkadāyakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro anekesu bhavesu nibbānādhigamatthāya katapuññūpacayo sumedhassa bhagavato kāle gahapatikule nibbatto vuddhimanvāya mahābhogasampanno satthari pasīditvā dhammaṃ sutvā tassa satthuno sattaratanamayaṃ pallaṅkaṃ kāretvā mahantaṃ pūjaṃ akāsi. So tena puññena devamanussesu saṃsaranto sabbattha pūjito ahosi. So anukkamena imasmiṃ buddhuppāde vibhavasampanne ekasmiṃ kule nibbatto viññutaṃ patto gharāvāsaṃ saṇṭhapetvā satthu dhammadesanaṃ sutvā pasanno pabbajitvā nacirasseva arahattaṃ patvā pubbe katapuññanāmena pallaṅkadāyakattheroti pākaṭo ahosi. Heṭṭhā viya uparipi pubbe katapuññanāmena therānaṃ nāmāni evameva veditabbāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "47"
      },
      ". So ekadivasaṃ attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sumedhassa bhagavato"
      },
      "tiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pallaṅko hi mayā dinno"
      },
      "ti pallaṅkaṃ ūrubaddhāsanaṃ katvā yattha upavīsanti nisīdanti, so pallaṅkoti vuccati, so pallaṅko sattaratanamayo mayā dinno pūjitoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sauttarasapacchado"
      },
      "ti saha uttaracchadena saha pacchadena sauttarasapacchado, uparivitānaṃ bandhitvā āsanaṃ uttamavatthehi acchādetvāti attho. Sesaṃ pākaṭamevāti."
    ],
    "innerText": "47. So ekadivasaṃ attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento sumedhassa bhagavatotiādimāha. Pallaṅko hi mayā dinnoti pallaṅkaṃ ūrubaddhāsanaṃ katvā yattha upavīsanti nisīdanti, so pallaṅkoti vuccati, so pallaṅko sattaratanamayo mayā dinno pūjitoti attho. Sauttarasapacchadoti saha uttaracchadena saha pacchadena sauttarasapacchado, uparivitānaṃ bandhitvā āsanaṃ uttamavatthehi acchādetvāti attho. Sesaṃ pākaṭamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pallaṅkadāyakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pannarasamavaggavaṇṇanā samattā."
  }
]