[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "28. Buddhapakiṇṇakakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1-18"
      },
      "."
    ],
    "innerText": "1-18."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      " ‘‘Aparimeyyito ",
      " kappe, caturo āsuṃ vināyakā’’tiādikā aṭṭhārasagāthā saṅgītikārakehi ṭhapitā nigamanagāthāti veditabbā. Sesagāthāsu sabbattha pākaṭamevāti."
    ],
    "innerText": "‘‘Aparimeyyito kappe, caturo āsuṃ vināyakā’’tiādikā aṭṭhārasagāthā saṅgītikārakehi ṭhapitā nigamanagāthāti veditabbā. Sesagāthāsu sabbattha pākaṭamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Vemattakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Imasmiṃ ",
      " pana sakalepi buddhavaṃse niddiṭṭhānaṃ pañcavīsatiyā buddhānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṭṭha vemattāni"
      },
      " veditabbāni. Katamāni aṭṭha? Āyuvemattaṃ, pamāṇavemattaṃ, kulavemattaṃ, padhānavemattaṃ, rasmivemattaṃ, yānavemattaṃ, bodhivemattaṃ, pallaṅkavemattanti."
    ],
    "innerText": "Imasmiṃ pana sakalepi buddhavaṃse niddiṭṭhānaṃ pañcavīsatiyā buddhānaṃ aṭṭha vemattāni veditabbāni. Katamāni aṭṭha? Āyuvemattaṃ, pamāṇavemattaṃ, kulavemattaṃ, padhānavemattaṃ, rasmivemattaṃ, yānavemattaṃ, bodhivemattaṃ, pallaṅkavemattanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āyuvemattaṃ"
      },
      " nāma keci dīghāyukā honti keci appāyukā. Tathā hi dīpaṅkaro koṇḍañño anomadassī padumo padumuttaro atthadassī dhammadassī siddhattho tissoti ime nava buddhā vassasatasahassāyukā ahesuṃ. Maṅgalo sumano sobhito nārado ",
      " sumedho sujāto piyadassī phussoti ime aṭṭha buddhā navutivassasahassāyukā ahesuṃ. Revato vessabhū cāti ime dve buddhā saṭṭhivassasahassāyukā ahesuṃ. Vipassī bhagavā asītivassasahassāyukā ahosi. Sikhī kakusandho koṇāgamano kassapoti ime cattāro buddhā yathākkamena sattaticattālīsatiṃsavīsavassasahassāyukā ahesuṃ. Amhākaṃ pana bhagavato vassasataṃ āyuppamāṇaṃ ahosi. Upacitapuññasambhārānaṃ dīghāyukasaṃvattaniyakammasamupetānampi buddhānaṃ yugavasena āyuppamāṇaṃ appamāṇaṃ ahosi. Ayaṃ pañcavīsatiyā buddhānaṃ āyuvemattaṃ nāma."
    ],
    "innerText": "Tattha āyuvemattaṃ nāma keci dīghāyukā honti keci appāyukā. Tathā hi dīpaṅkaro koṇḍañño anomadassī padumo padumuttaro atthadassī dhammadassī siddhattho tissoti ime nava buddhā vassasatasahassāyukā ahesuṃ. Maṅgalo sumano sobhito nārado sumedho sujāto piyadassī phussoti ime aṭṭha buddhā navutivassasahassāyukā ahesuṃ. Revato vessabhū cāti ime dve buddhā saṭṭhivassasahassāyukā ahesuṃ. Vipassī bhagavā asītivassasahassāyukā ahosi. Sikhī kakusandho koṇāgamano kassapoti ime cattāro buddhā yathākkamena sattaticattālīsatiṃsavīsavassasahassāyukā ahesuṃ. Amhākaṃ pana bhagavato vassasataṃ āyuppamāṇaṃ ahosi. Upacitapuññasambhārānaṃ dīghāyukasaṃvattaniyakammasamupetānampi buddhānaṃ yugavasena āyuppamāṇaṃ appamāṇaṃ ahosi. Ayaṃ pañcavīsatiyā buddhānaṃ āyuvemattaṃ nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pamāṇavemattaṃ"
      },
      " nāma keci dīghā honti keci rassā. Tathā hi dīpaṅkara-revata-piyadassī-atthadassī-dhammadassī-vipassībuddhānaṃ asītihatthubbedhaṃ sarīrappamāṇaṃ ahosi. Koṇḍañña-maṅgala-nārada-sumedhānaṃ aṭṭhāsītihatthubbedho kāyo ahosi. Sumanassa navutihatthubbedhaṃ sarīraṃ ahosi. Sobhita-anomadassī-paduma-padumuttara-phussabuddhānaṃ aṭṭhapaṇṇāsahatthubbedhaṃ ",
      " sarīraṃ ahosi. Sujāto paṇṇāsahatthubbedhasarīro ahosi. Siddhattha-tissa-vessabhuno saṭṭhihatthubbedhā ahesuṃ. Sikhī sattatihatthubbedho ahosi. Kakusandha-koṇāgamana-kassapā yathākkamena cattālīsatiṃsavīsatihatthubbedhā ahesuṃ. Amhākaṃ bhagavā aṭṭhārasahatthubbedho ahosi. Ayaṃ pañcavīsatiyā buddhānaṃ pamāṇavemattaṃ nāma."
    ],
    "innerText": "Pamāṇavemattaṃ nāma keci dīghā honti keci rassā. Tathā hi dīpaṅkara-revata-piyadassī-atthadassī-dhammadassī-vipassībuddhānaṃ asītihatthubbedhaṃ sarīrappamāṇaṃ ahosi. Koṇḍañña-maṅgala-nārada-sumedhānaṃ aṭṭhāsītihatthubbedho kāyo ahosi. Sumanassa navutihatthubbedhaṃ sarīraṃ ahosi. Sobhita-anomadassī-paduma-padumuttara-phussabuddhānaṃ aṭṭhapaṇṇāsahatthubbedhaṃ sarīraṃ ahosi. Sujāto paṇṇāsahatthubbedhasarīro ahosi. Siddhattha-tissa-vessabhuno saṭṭhihatthubbedhā ahesuṃ. Sikhī sattatihatthubbedho ahosi. Kakusandha-koṇāgamana-kassapā yathākkamena cattālīsatiṃsavīsatihatthubbedhā ahesuṃ. Amhākaṃ bhagavā aṭṭhārasahatthubbedho ahosi. Ayaṃ pañcavīsatiyā buddhānaṃ pamāṇavemattaṃ nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kulavemattaṃ"
      },
      " nāma keci khattiyakule nibbattiṃsu keci brāhmaṇakule. Tathā hi kakusandhakoṇāgamanakassapasammāsambuddhā brāhmaṇakule nibbattiṃsu. Dīpaṅkarādigotamabuddhapariyantā dvāvīsati buddhā khattiyakuleyeva nibbattiṃsu. Ayaṃ pañcavīsatiyā buddhānaṃ kulavemattaṃ nāma."
    ],
    "innerText": "Kulavemattaṃ nāma keci khattiyakule nibbattiṃsu keci brāhmaṇakule. Tathā hi kakusandhakoṇāgamanakassapasammāsambuddhā brāhmaṇakule nibbattiṃsu. Dīpaṅkarādigotamabuddhapariyantā dvāvīsati buddhā khattiyakuleyeva nibbattiṃsu. Ayaṃ pañcavīsatiyā buddhānaṃ kulavemattaṃ nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Padhānavemattaṃ"
      },
      " nāma dīpaṅkara-koṇḍañña-sumana-anomadassī-sujātasiddhattha-kakusandhānaṃ dasamāsikā padhānacariyā. Maṅgala-sumedhatissa sikhīnaṃ aṭṭhamāsikā. Revatassa sattamāsikā. Sobhitassa cattāro māsā. Padumaatthadassī vipassīnaṃ aḍḍhamāsikā. Nārada-padumuttara-dhammadassī-kassapānaṃ sattāhāni ",
      ". Piyadassī-phussa-vessabhū koṇāgamanānaṃ chamāsikā. Amhākaṃ buddhassa chabbassāni padhānacariyā ahosi. Ayaṃ padhānavemattaṃ nāma."
    ],
    "innerText": "Padhānavemattaṃ nāma dīpaṅkara-koṇḍañña-sumana-anomadassī-sujātasiddhattha-kakusandhānaṃ dasamāsikā padhānacariyā. Maṅgala-sumedhatissa sikhīnaṃ aṭṭhamāsikā. Revatassa sattamāsikā. Sobhitassa cattāro māsā. Padumaatthadassī vipassīnaṃ aḍḍhamāsikā. Nārada-padumuttara-dhammadassī-kassapānaṃ sattāhāni . Piyadassī-phussa-vessabhū koṇāgamanānaṃ chamāsikā. Amhākaṃ buddhassa chabbassāni padhānacariyā ahosi. Ayaṃ padhānavemattaṃ nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rasmivemattaṃ"
      },
      " nāma maṅgalassa kira sammāsambuddhassa sarīrasmi dasasahassilokadhātuṃ pharitvā aṭṭhāsi. Padumuttarabuddhassa dvādasayojanikā ahosi. Vipassissa bhagavato sattayojanikā ahosi. Sikhissa tiyojanappamāṇā. Kakusandhassa dasayojanikā. Amhākaṃ bhagavato samantato byāmappamāṇā. Sesānaṃ aniyatā ahosi. Ayaṃ rasmivemattaṃ nāma ajjhāsayapaṭibaddhaṃ, yo yattakaṃ icchati, tassa sarīrappabhā tattakaṃ pharati, paṭividdhaguṇe pana kassaci vemattaṃ nāma natthi. Ayaṃ rasmivemattaṃ nāma."
    ],
    "innerText": "Rasmivemattaṃ nāma maṅgalassa kira sammāsambuddhassa sarīrasmi dasasahassilokadhātuṃ pharitvā aṭṭhāsi. Padumuttarabuddhassa dvādasayojanikā ahosi. Vipassissa bhagavato sattayojanikā ahosi. Sikhissa tiyojanappamāṇā. Kakusandhassa dasayojanikā. Amhākaṃ bhagavato samantato byāmappamāṇā. Sesānaṃ aniyatā ahosi. Ayaṃ rasmivemattaṃ nāma ajjhāsayapaṭibaddhaṃ, yo yattakaṃ icchati, tassa sarīrappabhā tattakaṃ pharati, paṭividdhaguṇe pana kassaci vemattaṃ nāma natthi. Ayaṃ rasmivemattaṃ nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yānavemattaṃ"
      },
      " nāma keci hatthiyānena keci assayānena keci rathapada-pāsāda-sivikādīsu aññatarena nikkhamanti. Tathā hi dīpaṅkara-sumana-sumedha-phussa-sikhī-koṇāgamanā hatthiyānena nikkhamiṃsu. Koṇḍañña-revata-paduma-piyadassī-vipassī-kakusandhā rathayānena. Maṅgala-sujāta-atthadassī-tissa-gotamā assayānena. Anomadassīsiddhatthavessabhuno sivikāyānena. Nārado padasā nikkhami. Sobhita-padumuttara-dhammadassī-kassapā pāsādena nikkhamiṃsu. Ayaṃ yānavemattaṃ nāma."
    ],
    "innerText": "Yānavemattaṃ nāma keci hatthiyānena keci assayānena keci rathapada-pāsāda-sivikādīsu aññatarena nikkhamanti. Tathā hi dīpaṅkara-sumana-sumedha-phussa-sikhī-koṇāgamanā hatthiyānena nikkhamiṃsu. Koṇḍañña-revata-paduma-piyadassī-vipassī-kakusandhā rathayānena. Maṅgala-sujāta-atthadassī-tissa-gotamā assayānena. Anomadassīsiddhatthavessabhuno sivikāyānena. Nārado padasā nikkhami. Sobhita-padumuttara-dhammadassī-kassapā pāsādena nikkhamiṃsu. Ayaṃ yānavemattaṃ nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bodhivemattaṃ"
      },
      " nāma dīpaṅkarassa bhagavato kapītanarukkho bodhi; koṇḍaññassa bhagavato sālakalyāṇirukkho ",
      ", maṅgala-sumana-revata-sobhitānaṃ nāgarukkho, anomadassissa ajjunarukkho, padumanāradānaṃ mahāsoṇarukkho, padumuttarassa salalarukkho, sumedhassa nīpo, sujātassa veḷu, piyadassino kakudho, atthadassissa campakarukkho, dhammadassissa rattakuravakarukkho, siddhatthassa kaṇikārarukkho, tissassa asanarukkho, phussassa āmalakarukkho, vipassissa pāṭalirukkho, sikhissa puṇḍarīkarukkho, vessabhussa sālarukkho, kakusandhassa sirīsarukkho, koṇāgamanassa udumbararukkho, kassapassa nigrodho, gotamassa assatthoti ayaṃ bodhivemattaṃ nāma."
    ],
    "innerText": "Bodhivemattaṃ nāma dīpaṅkarassa bhagavato kapītanarukkho bodhi; koṇḍaññassa bhagavato sālakalyāṇirukkho , maṅgala-sumana-revata-sobhitānaṃ nāgarukkho, anomadassissa ajjunarukkho, padumanāradānaṃ mahāsoṇarukkho, padumuttarassa salalarukkho, sumedhassa nīpo, sujātassa veḷu, piyadassino kakudho, atthadassissa campakarukkho, dhammadassissa rattakuravakarukkho, siddhatthassa kaṇikārarukkho, tissassa asanarukkho, phussassa āmalakarukkho, vipassissa pāṭalirukkho, sikhissa puṇḍarīkarukkho, vessabhussa sālarukkho, kakusandhassa sirīsarukkho, koṇāgamanassa udumbararukkho, kassapassa nigrodho, gotamassa assatthoti ayaṃ bodhivemattaṃ nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pallaṅkavemattaṃ"
      },
      " nāma dīpaṅkara-revata-piyadassī-atthadassī-dhammadassī-vipassīnaṃ tepaṇṇāsahatthapallaṅkā ahesuṃ; koṇḍañña-maṅgala-nārada-sumedhānaṃ sattapaṇṇāsahatthā; sumanassa saṭṭhihattho pallaṅko ahosi; sobhita-anomadassī-paduma-padumuttara-phussānaṃ aṭṭhattiṃsahatthā, sujātassa dvattiṃsahattho, siddhattha-tissa-vessabhūnaṃ cattālīsahatthā, sikhissa dvattiṃsahattho ",
      ", kakusandhassa chabbīsatihattho, koṇāgamanassa vīsatihattho, kassapassa pannarasahattho, gotamassa cuddasahattho pallaṅko ahosi. Ayaṃ pallaṅkavemattaṃ nāma. Imāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṭṭha vemattāni"
      },
      " nāma."
    ],
    "innerText": "Pallaṅkavemattaṃ nāma dīpaṅkara-revata-piyadassī-atthadassī-dhammadassī-vipassīnaṃ tepaṇṇāsahatthapallaṅkā ahesuṃ; koṇḍañña-maṅgala-nārada-sumedhānaṃ sattapaṇṇāsahatthā; sumanassa saṭṭhihattho pallaṅko ahosi; sobhita-anomadassī-paduma-padumuttara-phussānaṃ aṭṭhattiṃsahatthā, sujātassa dvattiṃsahattho, siddhattha-tissa-vessabhūnaṃ cattālīsahatthā, sikhissa dvattiṃsahattho , kakusandhassa chabbīsatihattho, koṇāgamanassa vīsatihattho, kassapassa pannarasahattho, gotamassa cuddasahattho pallaṅko ahosi. Ayaṃ pallaṅkavemattaṃ nāma. Imāni aṭṭha vemattāni nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Avijahitaṭṭhānakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sabbabuddhānaṃ pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cattāri avijahitaṭṭhānāni"
      },
      " nāma honti. Sabbabuddhānañhi ",
      " bodhipallaṅko avijahito ekasmiṃyeva ṭhāne hoti. Dhammacakkappavattanaṃ isipatane migadāye avijahitameva hoti. Devorohaṇakāle saṅkassanagaradvāre paṭhamakkapādaṭṭhānaṃ avijahitameva hoti. Jetavane gandhakuṭiyā cattāri mañcapādaṭṭhānāni avijahitāneva honti. Vihāro pana khuddakopi mahantopi hoti. Vihāro na vijahatiyeva, nagaraṃ pana vijahati."
    ],
    "innerText": "Sabbabuddhānaṃ pana cattāri avijahitaṭṭhānāni nāma honti. Sabbabuddhānañhi bodhipallaṅko avijahito ekasmiṃyeva ṭhāne hoti. Dhammacakkappavattanaṃ isipatane migadāye avijahitameva hoti. Devorohaṇakāle saṅkassanagaradvāre paṭhamakkapādaṭṭhānaṃ avijahitameva hoti. Jetavane gandhakuṭiyā cattāri mañcapādaṭṭhānāni avijahitāneva honti. Vihāro pana khuddakopi mahantopi hoti. Vihāro na vijahatiyeva, nagaraṃ pana vijahati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Sahajātapariccheda-nakkhattaparicchedakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aparaṃ pana amhākaṃyeva bhagavato sahajātaparicchedañca nakkhattaparicchedañca dīpesuṃ. Amhākaṃ sabbaññubodhisattena kira saddhiṃ rāhulamātā ānandatthero channo kaṇḍako assarājā nidhikumbho mahābodhi kāḷudāyīti imāni satta sahajātāni. Ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sahajātaparicchedo"
      },
      ". Mahāpuriso ",
      " pana uttarāsāḷhanakkhatteneva mātukucchiṃ okkami, mahābhinikkhamanaṃ nikkhami, dhammacakkaṃ pavattesi, yamakapāṭihāriyaṃ akāsi. Visākhanakkhattena jāto ca abhisambuddho ca parinibbuto ca. Māghanakkhattena tassa sāvakasannipāto ca āyusaṅkhāravosajjanañca ahosi. Assayujanakkhattena devorohaṇaṃ. Ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nakkhattaparicchedo"
      },
      "ti."
    ],
    "innerText": "Aparaṃ pana amhākaṃyeva bhagavato sahajātaparicchedañca nakkhattaparicchedañca dīpesuṃ. Amhākaṃ sabbaññubodhisattena kira saddhiṃ rāhulamātā ānandatthero channo kaṇḍako assarājā nidhikumbho mahābodhi kāḷudāyīti imāni satta sahajātāni. Ayaṃ sahajātaparicchedo. Mahāpuriso pana uttarāsāḷhanakkhatteneva mātukucchiṃ okkami, mahābhinikkhamanaṃ nikkhami, dhammacakkaṃ pavattesi, yamakapāṭihāriyaṃ akāsi. Visākhanakkhattena jāto ca abhisambuddho ca parinibbuto ca. Māghanakkhattena tassa sāvakasannipāto ca āyusaṅkhāravosajjanañca ahosi. Assayujanakkhattena devorohaṇaṃ. Ayaṃ nakkhattaparicchedoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Sadhammatākathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni pana sabbesaṃ buddhānaṃ sādhāraṇadhammataṃ pakāsayissāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbabuddhānaṃ samattiṃsavidhā dhammatā"
      },
      ". Seyyathidaṃ – pacchimabhavikabodhisattassa sampajānassa mātukucchiokkamanaṃ, mātukucchiyaṃ pallaṅkena nisīditvā bahimukholokanaṃ, ṭhitāya bodhisattamātuyā vijāyanaṃ, araññeyeva mātukucchito nikkhamanaṃ, kañcanapaṭṭesu patiṭṭhitapādānaṃ uttarābhimukhānaṃ ",
      " sattapadavītihārānaṃ gantvā catuddisaṃ oloketvā sīhanādanadanaṃ, cattāri nimittāni disvā jātamattaputtānaṃ mahāsattānaṃ mahābhinikkhamanaṃ, arahaddhajamādāya pabbajitvā sabbaheṭṭhimena paricchedena sattāhaṃ padhānacariyā, sambodhiṃ pāpuṇanadivase pāyāsabhojanaṃ, tiṇasanthare nisīditvā sabbaññutaññāṇādhigamo, ānāpānassatikammaṭṭhānaparikammaṃ, mārabalaviddhaṃsanaṃ, bodhipallaṅkeyeva tisso vijjā ādiṃ katvā asādhāraṇañāṇādiguṇapaṭilābho, sattasattāhaṃ bodhisamīpeyeva vītināmanaṃ, mahābrahmuno dhammadesanatthāya āyācanaṃ, isipatane migadāye dhammacakkappavattanaṃ, māghapuṇṇamāya caturaṅgikasannipāte pātimokkhuddeso, jetavanaṭṭhāne nibaddhavāso, sāvatthinagaradvāre yamakapāṭihāriyakaraṇaṃ, tāvatiṃsabhavane abhidhammadesanā, saṅkassanagaradvāre devalokato otaraṇaṃ satataṃ phalasamāpattisamāpajjanaṃ, dvīsu vāresu veneyyajanāvalokanaṃ, uppanne vatthumhi sikkhāpadapaññāpanaṃ uppannāya aṭṭhuppattiyā jātakakathanaṃ, ñātisamāgame buddhavaṃsakathanaṃ, āgantukehi bhikkhūhi paṭisanthārakaraṇaṃ, nimantitānaṃ vuṭṭhavassānaṃ anāpucchā agamanaṃ, divase divase purebhattapacchābhattapaṭhamamajjhimapacchimayāmakiccakaraṇaṃ, parinibbānadivase maṃsarasabhojanaṃ, catuvīsatikoṭisatasahassasamāpattiyo samāpajjitvā parinibbānanti imā ",
      " samattiṃsa sabbabuddhānaṃ dhammatāti."
    ],
    "innerText": "Idāni pana sabbesaṃ buddhānaṃ sādhāraṇadhammataṃ pakāsayissāma. Sabbabuddhānaṃ samattiṃsavidhā dhammatā. Seyyathidaṃ – pacchimabhavikabodhisattassa sampajānassa mātukucchiokkamanaṃ, mātukucchiyaṃ pallaṅkena nisīditvā bahimukholokanaṃ, ṭhitāya bodhisattamātuyā vijāyanaṃ, araññeyeva mātukucchito nikkhamanaṃ, kañcanapaṭṭesu patiṭṭhitapādānaṃ uttarābhimukhānaṃ sattapadavītihārānaṃ gantvā catuddisaṃ oloketvā sīhanādanadanaṃ, cattāri nimittāni disvā jātamattaputtānaṃ mahāsattānaṃ mahābhinikkhamanaṃ, arahaddhajamādāya pabbajitvā sabbaheṭṭhimena paricchedena sattāhaṃ padhānacariyā, sambodhiṃ pāpuṇanadivase pāyāsabhojanaṃ, tiṇasanthare nisīditvā sabbaññutaññāṇādhigamo, ānāpānassatikammaṭṭhānaparikammaṃ, mārabalaviddhaṃsanaṃ, bodhipallaṅkeyeva tisso vijjā ādiṃ katvā asādhāraṇañāṇādiguṇapaṭilābho, sattasattāhaṃ bodhisamīpeyeva vītināmanaṃ, mahābrahmuno dhammadesanatthāya āyācanaṃ, isipatane migadāye dhammacakkappavattanaṃ, māghapuṇṇamāya caturaṅgikasannipāte pātimokkhuddeso, jetavanaṭṭhāne nibaddhavāso, sāvatthinagaradvāre yamakapāṭihāriyakaraṇaṃ, tāvatiṃsabhavane abhidhammadesanā, saṅkassanagaradvāre devalokato otaraṇaṃ satataṃ phalasamāpattisamāpajjanaṃ, dvīsu vāresu veneyyajanāvalokanaṃ, uppanne vatthumhi sikkhāpadapaññāpanaṃ uppannāya aṭṭhuppattiyā jātakakathanaṃ, ñātisamāgame buddhavaṃsakathanaṃ, āgantukehi bhikkhūhi paṭisanthārakaraṇaṃ, nimantitānaṃ vuṭṭhavassānaṃ anāpucchā agamanaṃ, divase divase purebhattapacchābhattapaṭhamamajjhimapacchimayāmakiccakaraṇaṃ, parinibbānadivase maṃsarasabhojanaṃ, catuvīsatikoṭisatasahassasamāpattiyo samāpajjitvā parinibbānanti imā samattiṃsa sabbabuddhānaṃ dhammatāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Anantarāyikadhammakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sabbabuddhānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cattāro anantarāyikā dhammā"
      },
      ". Katame cattāro? Buddhānaṃ uddissa abhihaṭānaṃ catunnaṃ paccayānaṃ na sakkā kenaci antarāyo kātuṃ. Buddhānaṃ āyuno na sakkā kenaci antarāyo kātuṃ. Vuttañhetaṃ – ‘‘aṭṭhānametaṃ anavakāso, yaṃ parūpakkamena tathāgataṃ jīvitā voropeyyā’’ti (cūḷava. 342). Buddhānaṃ dvattiṃsamahāpurisalakkhaṇānaṃ asītiyā anubyañjanānañca na sakkā kenaci antarāyo kātuṃ. Buddharaṃsīnaṃ na sakkā kenaci antarāyo kātunti. Ime cattāro anantarāyikā dhammā nāmāti."
    ],
    "innerText": "Sabbabuddhānaṃ cattāro anantarāyikā dhammā. Katame cattāro? Buddhānaṃ uddissa abhihaṭānaṃ catunnaṃ paccayānaṃ na sakkā kenaci antarāyo kātuṃ. Buddhānaṃ āyuno na sakkā kenaci antarāyo kātuṃ. Vuttañhetaṃ – ‘‘aṭṭhānametaṃ anavakāso, yaṃ parūpakkamena tathāgataṃ jīvitā voropeyyā’’ti (cūḷava. 342). Buddhānaṃ dvattiṃsamahāpurisalakkhaṇānaṃ asītiyā anubyañjanānañca na sakkā kenaci antarāyo kātuṃ. Buddharaṃsīnaṃ na sakkā kenaci antarāyo kātunti. Ime cattāro anantarāyikā dhammā nāmāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Nigamanakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Ettāvatā ",
      " gatā siddhiṃ, buddhavaṃsassa vaṇṇanā;"
    ],
    "innerText": "Ettāvatā gatā siddhiṃ, buddhavaṃsassa vaṇṇanā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Suvaṇṇapadaviññātavicittanayasobhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Porāṇaṭṭhakathāmaggaṃ, pāḷiatthappakāsakaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Ādāyeva katā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "buddha-vaṃsassaṭṭhakathā"
      },
      " mayā."
    ],
    "innerText": "Ādāyeva katā buddha-vaṃsassaṭṭhakathā mayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Papañcatthaṃ vivajjetvā, madhuratthassa sabbaso;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Sampakāsanato tasmā, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "madhuratthappakāsinī"
      },
      "."
    ],
    "innerText": "Sampakāsanato tasmā, madhuratthappakāsinī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Kāvīrajalasampāta-paripūtamahītale;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kāvīrapaṭṭane ramme, nānānārinarākule."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Kārite kaṇhadāsena, saṇhavācena sādhunā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vihāre vividhākāra-cārupākāragopure."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Chāyāsalilasampanne, dassanīye manorame;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Hatadujjanasambādhe, pavivekasukhe sive."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Tattha ",
      " pācīnapāsāda-tale paramasītale;"
    ],
    "innerText": "Tattha pācīnapāsāda-tale paramasītale;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vasatā buddhavaṃsassa, mayā saṃvaṇṇanā katā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Yathā buddhavaṃsassa saṃvaṇṇanāyaṃ, gatā sādhu siddhiṃ vinā antarāyaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tathā dhammayuttā janānaṃ vitakkā, vināvantarāyena siddhiṃ vajantu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Imaṃ buddhavaṃsassa saṃvaṇṇanaṃ me, karontena yaṃ patthitaṃ puññajātaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sadā tassa devānubhāvena loko, dhuvaṃ santamaccantamatthaṃ payātaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Vinassantu ",
      " rogā manussesu sabbe, pavassantu devāpi vassantakāle;"
    ],
    "innerText": "Vinassantu rogā manussesu sabbe, pavassantu devāpi vassantakāle;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sukhaṃ hotu niccaṃ varaṃ nārakāpi, pisācāpayātā pipāsā bhavantu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Surā accharānaṃ gaṇādīhi saddhiṃ, ciraṃ devaloke sukhaṃ cānubhontu;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ciraṃ ṭhātu dhammo munindassa loke, sukhaṃ lokapālā mahiṃ pālayantu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Garūhi gītanāmena, buddhadattoti vissuto;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Thero katvā aṭṭhakathaṃ, madhuratthavilāsiniṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Potthakaṃ ",
      " ṭhapayitvemaṃ, parampare hitāvahaṃ;"
    ],
    "innerText": "Potthakaṃ ṭhapayitvemaṃ, parampare hitāvahaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Aciraṭṭhitabhāvena, aho maccuvasaṃ gato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Iti bhāṇavāravasena chabbīsatibhāṇavārā, ganthavasena pañcasatādhikachasahassaganthā, akkharavasena tisahassādhikāni dvesatasahassakkharāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Antarāyaṃ vinā esā, yathā niṭṭhaṃ upāgatā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tathā sijjhantu saṅkappā, sattānaṃ dhammanissitāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti madhuratthavilāsinī nāma"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Buddhavaṃsa-aṭṭhakathā niṭṭhitā."
  }
]