[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "8. Nāgasamālavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Nāgasamālattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āpāṭaliṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ahaṃ puppha"
      },
      "ntiādikaṃ āyasmato nāgasamālattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto sikhissa bhagavato kāle ekasmiṃ kulagehe nibbatto viññutaṃ patto gharāvāsaṃ saṇṭhapetvā tathārūpasajjanasaṃsaggassa ",
      " alābhena satthari dharamānakāle dassanasavanapūjākammamakaritvā parinibbutakāle tassa bhagavato sārīrikadhātuṃ nidahitvā katacetiyamhi cittaṃ pasādetvā pāṭalipupphaṃ pūjetvā somanassaṃ uppādetvā yāvatāyukaṃ ṭhatvā teneva somanassena tato kālaṃ kato tusitādīsu chasu devalokesu sukhamanubhavitvā aparabhāge manussesu manussasampattiṃ anubhavitvā imasmiṃ buddhuppāde kulagehe nibbatto viññutaṃ patto nāgarukkhapallavakomaḷasadisasarīrattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nāgasamālo"
      },
      "ti mātāpitūhi katanāmadheyyo bhagavati pasanno pabbajitvā nacirasseva arahā ahosi."
    ],
    "innerText": "Āpāṭaliṃahaṃ pupphantiādikaṃ āyasmato nāgasamālattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto sikhissa bhagavato kāle ekasmiṃ kulagehe nibbatto viññutaṃ patto gharāvāsaṃ saṇṭhapetvā tathārūpasajjanasaṃsaggassa alābhena satthari dharamānakāle dassanasavanapūjākammamakaritvā parinibbutakāle tassa bhagavato sārīrikadhātuṃ nidahitvā katacetiyamhi cittaṃ pasādetvā pāṭalipupphaṃ pūjetvā somanassaṃ uppādetvā yāvatāyukaṃ ṭhatvā teneva somanassena tato kālaṃ kato tusitādīsu chasu devalokesu sukhamanubhavitvā aparabhāge manussesu manussasampattiṃ anubhavitvā imasmiṃ buddhuppāde kulagehe nibbatto viññutaṃ patto nāgarukkhapallavakomaḷasadisasarīrattā nāgasamāloti mātāpitūhi katanāmadheyyo bhagavati pasanno pabbajitvā nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      ". So ",
      " pacchā attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āpāṭaliṃ ahaṃ puppha"
      },
      "ntiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āpāṭali"
      },
      "nti ā samantato, ādarena vā pāṭalipupphaṃ gahetvā ahaṃ thūpamhi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhiropesiṃ"
      },
      " pūjesinti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ujjhitaṃ sumahāpathe"
      },
      "ti sabbanagaravāsīnaṃ vandanapūjanatthāya mahāpathe nagaramajjhe vīthiyaṃ ujjhitaṃ uṭṭhāpitaṃ, iṭṭhakakammasudhākammādīhi nipphāditanti attho. Sesaṃ heṭṭhā vuttanayattā uttānatthattā ca suviññeyyamevāti."
    ],
    "innerText": "1. So pacchā attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento āpāṭaliṃ ahaṃ pupphantiādimāha. Tattha āpāṭalinti ā samantato, ādarena vā pāṭalipupphaṃ gahetvā ahaṃ thūpamhi abhiropesiṃ pūjesinti attho. Ujjhitaṃ sumahāpatheti sabbanagaravāsīnaṃ vandanapūjanatthāya mahāpathe nagaramajjhe vīthiyaṃ ujjhitaṃ uṭṭhāpitaṃ, iṭṭhakakammasudhākammādīhi nipphāditanti attho. Sesaṃ heṭṭhā vuttanayattā uttānatthattā ca suviññeyyamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Nāgasamālattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Padasaññakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akkantañca padaṃ disvā"
      },
      "tiādikaṃ āyasmato padasaññakattherassa apadānaṃ. Ayampi purimabuddhesu ",
      " katādhikāro uppannuppannabhave vivaṭṭūpanissayāni puññāni upacinanto tissassa bhagavato kāle ekasmiṃ saddhāsampanne upāsakagehe nibbatto viññutaṃ patto ratanattaye pasanno bhagavatā tassa anukampāya dassitaṃ padacetiyaṃ disvā pasanno lomahaṭṭhajāto vandanapūjanādibahumānamakāsi. So teneva sukhette sukatena puññena tato cuto sagge nibbatto tattha dibbasukhamanubhavitvā aparabhāge manussesu jāto manussasampattiṃ sabbamanubhavitvā imasmiṃ buddhuppāde vibhavasampannakule nibbatto vuddhimanvāya saddhājāto ",
      " pabbajitvā nacirasseva arahā ahosi, purākatapuññanāmena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "padasaññakatthero"
      },
      "ti pākaṭo."
    ],
    "innerText": "Akkantañca padaṃ disvātiādikaṃ āyasmato padasaññakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro uppannuppannabhave vivaṭṭūpanissayāni puññāni upacinanto tissassa bhagavato kāle ekasmiṃ saddhāsampanne upāsakagehe nibbatto viññutaṃ patto ratanattaye pasanno bhagavatā tassa anukampāya dassitaṃ padacetiyaṃ disvā pasanno lomahaṭṭhajāto vandanapūjanādibahumānamakāsi. So teneva sukhette sukatena puññena tato cuto sagge nibbatto tattha dibbasukhamanubhavitvā aparabhāge manussesu jāto manussasampattiṃ sabbamanubhavitvā imasmiṃ buddhuppāde vibhavasampannakule nibbatto vuddhimanvāya saddhājāto pabbajitvā nacirasseva arahā ahosi, purākatapuññanāmena padasaññakattheroti pākaṭo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "5"
      },
      ". So ekadivasaṃ attano pubbakammaṃ saritvā pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "akkantañca padaṃ disvā"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "akkanta"
      },
      "nti akkamitaṃ dassitaṃ. Sabbabuddhānaṃ sabbadā caturaṅgulopariyeva gamanaṃ, ayaṃ pana tassa saddhāsampannataṃ ñatvā ‘‘eso imaṃ passatū’’ti padacetiyaṃ dassesi, tasmā so tasmiṃ pasīditvā vandanapūjanādisakkāramakāsīti attho. Sesaṃ sabbattha uttānatthamevāti."
    ],
    "innerText": "5. So ekadivasaṃ attano pubbakammaṃ saritvā pubbacaritāpadānaṃ pakāsento akkantañca padaṃ disvātiādimāha. Tattha akkantanti akkamitaṃ dassitaṃ. Sabbabuddhānaṃ sabbadā caturaṅgulopariyeva gamanaṃ, ayaṃ pana tassa saddhāsampannataṃ ñatvā ‘‘eso imaṃ passatū’’ti padacetiyaṃ dassesi, tasmā so tasmiṃ pasīditvā vandanapūjanādisakkāramakāsīti attho. Sesaṃ sabbattha uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Padasaññakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Buddhasaññakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dumagge paṃsukūlika"
      },
      "ntiādikaṃ āyasmato buddhasaññakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto tissassa bhagavato kāle ekasmiṃ kulagehe ",
      " nibbatto vuddhippatto saddhājāto dumagge laggitaṃ bhagavato paṃsukūlacīvaraṃ disvā pasannamānaso ‘‘arahaddhaja’’nti cintetvā vandanapūjanādisakkāramakāsi. So tena puññakammena devamanussasampattimanubhavitvā imasmiṃ buddhuppāde vibhavasampanne ekasmiṃ kulagehe nibbatto saddhājāto pabbajitvā nacirasseva arahā ahosi."
    ],
    "innerText": "Dumagge paṃsukūlikantiādikaṃ āyasmato buddhasaññakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto tissassa bhagavato kāle ekasmiṃ kulagehe nibbatto vuddhippatto saddhājāto dumagge laggitaṃ bhagavato paṃsukūlacīvaraṃ disvā pasannamānaso ‘‘arahaddhaja’’nti cintetvā vandanapūjanādisakkāramakāsi. So tena puññakammena devamanussasampattimanubhavitvā imasmiṃ buddhuppāde vibhavasampanne ekasmiṃ kulagehe nibbatto saddhājāto pabbajitvā nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "9"
      },
      ". So pattaarahattādhigamo attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dumagge paṃsukūlika"
      },
      "ntiādimāha. Tattha dhunāti kampatīti dumo. Duhati pūreti ākāsatalanti vā dumo, dumassa aggo koṭīti dumaggo, tasmiṃ dumagge. Paṃsumiva paṭikkūlabhāvaṃ amanuññabhāvaṃ ulati gacchatīti paṃsukūlaṃ, paṃsukūlameva paṃsukūlikaṃ, satthuno ",
      " paṃsukūlaṃ dumagge laggitaṃ disvā ahaṃ añjaliṃ paggahetvā taṃ paṃsukūlaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avandiṃ"
      },
      " paṇāmamakāsinti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ta"
      },
      "nti nipātamattaṃ. Sesaṃ sabbattha uttānatthamevāti."
    ],
    "innerText": "9. So pattaarahattādhigamo attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento dumagge paṃsukūlikantiādimāha. Tattha dhunāti kampatīti dumo. Duhati pūreti ākāsatalanti vā dumo, dumassa aggo koṭīti dumaggo, tasmiṃ dumagge. Paṃsumiva paṭikkūlabhāvaṃ amanuññabhāvaṃ ulati gacchatīti paṃsukūlaṃ, paṃsukūlameva paṃsukūlikaṃ, satthuno paṃsukūlaṃ dumagge laggitaṃ disvā ahaṃ añjaliṃ paggahetvā taṃ paṃsukūlaṃ avandiṃ paṇāmamakāsinti attho. Tanti nipātamattaṃ. Sesaṃ sabbattha uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Buddhasaññakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Bhisāluvadāyakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kānanaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vanamoggayhā"
      },
      "tiādikaṃ āyasmato bhisāluvadāyakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto vipassissa bhagavato kāle himavantassa samīpe araññāvāse vasanto vanamūlaphalāhāro vivekavasenāgataṃ vipassiṃ bhagavantaṃ disvā pasannamānaso pañcabhisāluve adāsi. Bhagavā tassa cittaṃ pasādetuṃ passantasseva paribhuñji. So tena cittappasādena kālaṃ katvā tusitādīsu sampattimanubhavitvā pacchā manussasampattiñca anubhavitvā imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbatto vibhavasampattiṃ patto taṃ pahāya sāsane pabbajito nacirasseva arahattaṃ pāpuṇi."
    ],
    "innerText": "Kānanaṃvanamoggayhātiādikaṃ āyasmato bhisāluvadāyakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto vipassissa bhagavato kāle himavantassa samīpe araññāvāse vasanto vanamūlaphalāhāro vivekavasenāgataṃ vipassiṃ bhagavantaṃ disvā pasannamānaso pañcabhisāluve adāsi. Bhagavā tassa cittaṃ pasādetuṃ passantasseva paribhuñji. So tena cittappasādena kālaṃ katvā tusitādīsu sampattimanubhavitvā pacchā manussasampattiñca anubhavitvā imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbatto vibhavasampattiṃ patto taṃ pahāya sāsane pabbajito nacirasseva arahattaṃ pāpuṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "13"
      },
      ". So tato attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kānanaṃ vanamoggayhā"
      },
      "tiādimāha. Taṃ heṭṭhā vuttatthameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vasāmi vipine aha"
      },
      "nti vivekavāso ahaṃ vasāmīti sambandho. Sesaṃ uttānatthamevāti."
    ],
    "innerText": "13. So tato attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento kānanaṃ vanamoggayhātiādimāha. Taṃ heṭṭhā vuttatthameva. Vasāmi vipine ahanti vivekavāso ahaṃ vasāmīti sambandho. Sesaṃ uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Bhisāluvadāyakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Chaṭṭhabhāṇavāravaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Ekasaññakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khaṇḍo"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nāmāsi nāmenā"
      },
      "tiādikaṃ āyasmato ekasaññakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto vipassissa bhagavato kāle kulagehe nibbatto viññutaṃ patto ratanattaye pasannamānaso tassa satthuno khaṇḍaṃ nāma aggasāvakaṃ bhikkhāya caramānaṃ disvā saddahitvā piṇḍapātamadāsi. So tena puññakammena ",
      " devamanussasampattiyo anubhavitvā imasmiṃ buddhuppāde sāvatthiyaṃ ekasmiṃ kulagehe nibbatto viññutaṃ patto satthu dhammadesanaṃ sutvā paṭiladdhasaddho pabbajitvā nacirasseva arahā ahosi. So ekadivasaṃ piṇḍapātassa saññaṃ manasikaritvā paṭiladdhavisesattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekasaññakatthero"
      },
      "ti pākaṭo."
    ],
    "innerText": "Khaṇḍonāmāsi nāmenātiādikaṃ āyasmato ekasaññakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto vipassissa bhagavato kāle kulagehe nibbatto viññutaṃ patto ratanattaye pasannamānaso tassa satthuno khaṇḍaṃ nāma aggasāvakaṃ bhikkhāya caramānaṃ disvā saddahitvā piṇḍapātamadāsi. So tena puññakammena devamanussasampattiyo anubhavitvā imasmiṃ buddhuppāde sāvatthiyaṃ ekasmiṃ kulagehe nibbatto viññutaṃ patto satthu dhammadesanaṃ sutvā paṭiladdhasaddho pabbajitvā nacirasseva arahā ahosi. So ekadivasaṃ piṇḍapātassa saññaṃ manasikaritvā paṭiladdhavisesattā ekasaññakattheroti pākaṭo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "18"
      },
      ". So ",
      " aparabhāge attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "khaṇḍo nāmāsi nāmenā"
      },
      "tiādimāha. Tattha tassa aggasāvakattherassa kilesānaṃ khaṇḍitattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "khaṇḍo"
      },
      "ti nāmaṃ. Sesaṃ sabbattha uttānamevāti."
    ],
    "innerText": "18. So aparabhāge attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento khaṇḍo nāmāsi nāmenātiādimāha. Tattha tassa aggasāvakattherassa kilesānaṃ khaṇḍitattā khaṇḍoti nāmaṃ. Sesaṃ sabbattha uttānamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ekasaññakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Tiṇasantharadāyakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Himavantassāvidūre"
      },
      "tiādikaṃ āyasmato tiṇasantharadāyakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto tissassa bhagavato kāle ekasmiṃ kulagehe nibbatto buddhuppādato pageva uppannattā gharāvāsaṃ pahāya tāpasapabbajjaṃ pabbajitvā himavantassa avidūre ekaṃ saraṃ nissāya paṭivasati. Tasmiṃ samaye tisso bhagavā tassānukampāya ākāsena agamāsi. Atha kho so tāpaso ākāsato oruyha ṭhitaṃ taṃ bhagavantaṃ disvā pasannamānaso tiṇaṃ lāyitvā tiṇasantharaṃ katvā nisīdāpetvā bahumānādarena pañcapatiṭṭhitena vanditvā paṭikuṭiko hutvā pakkāmi. So yāvatāyukaṃ ṭhatvā tato cavitvā devamanussesu saṃsaranto anekavidhasampattiṃ anubhavitvā imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbatto vuddhippatto satthari pasīditvā pabbajito nacirasseva arahā ahosi."
    ],
    "innerText": "Himavantassāvidūretiādikaṃ āyasmato tiṇasantharadāyakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto tissassa bhagavato kāle ekasmiṃ kulagehe nibbatto buddhuppādato pageva uppannattā gharāvāsaṃ pahāya tāpasapabbajjaṃ pabbajitvā himavantassa avidūre ekaṃ saraṃ nissāya paṭivasati. Tasmiṃ samaye tisso bhagavā tassānukampāya ākāsena agamāsi. Atha kho so tāpaso ākāsato oruyha ṭhitaṃ taṃ bhagavantaṃ disvā pasannamānaso tiṇaṃ lāyitvā tiṇasantharaṃ katvā nisīdāpetvā bahumānādarena pañcapatiṭṭhitena vanditvā paṭikuṭiko hutvā pakkāmi. So yāvatāyukaṃ ṭhatvā tato cavitvā devamanussesu saṃsaranto anekavidhasampattiṃ anubhavitvā imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbatto vuddhippatto satthari pasīditvā pabbajito nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "22"
      },
      ". So aparabhāge attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "himavantassāvidūre"
      },
      "tiādimāha. Taṃ heṭṭhā vuttatthameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahājātassaro"
      },
      "ti ettha pana saranti ettha pānīyatthikā dvipadacatuppadādayo sattāti saraṃ, atha vā saranti ettha nadīkandarādayoti saraṃ, mahanto ",
      " ca so sayameva jātattā saro ceti mahājātassaro. Anotattachaddantadahādayo viya apākaṭanāmattā ‘‘mahājātassaro’’ti vuttoti daṭṭhabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Satapattehi"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sañchanno"
      },
      "ti ekekasmiṃ pupphe satasatapattānaṃ vasena satapatto, satapattasetapadumehi ",
      " sañchanno gahanībhūtoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nānāsakuṇamālayo"
      },
      "ti aneke haṃsakukkuṭakukkuhadeṇḍibhādayo ekato kuṇanti saddaṃ karontīti sakuṇāti laddhanāmānaṃ pakkhīnaṃ ālayo ādhārabhūtoti attho. Sesaṃ sabbattha uttānatthamevāti."
    ],
    "innerText": "22. So aparabhāge attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento himavantassāvidūretiādimāha. Taṃ heṭṭhā vuttatthameva. Mahājātassaroti ettha pana saranti ettha pānīyatthikā dvipadacatuppadādayo sattāti saraṃ, atha vā saranti ettha nadīkandarādayoti saraṃ, mahanto ca so sayameva jātattā saro ceti mahājātassaro. Anotattachaddantadahādayo viya apākaṭanāmattā ‘‘mahājātassaro’’ti vuttoti daṭṭhabbo. Satapattehisañchannoti ekekasmiṃ pupphe satasatapattānaṃ vasena satapatto, satapattasetapadumehi sañchanno gahanībhūtoti attho. Nānāsakuṇamālayoti aneke haṃsakukkuṭakukkuhadeṇḍibhādayo ekato kuṇanti saddaṃ karontīti sakuṇāti laddhanāmānaṃ pakkhīnaṃ ālayo ādhārabhūtoti attho. Sesaṃ sabbattha uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tiṇasantharadāyakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Sūcidāyakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tiṃsakappasahassamhī"
      },
      "tiādikaṃ āyasmato sūcidāyakattherassa apadānaṃ. Ayampi purimajinavaresu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto sumedhassa bhagavato kāle ekasmiṃ kulagehe nibbatto vuddhimanvāya bhagavato cīvarakammaṃ kātuṃ pañca sūciyo adāsi. So tena puññena devamanussesu puññamanubhavitvā vicaranto uppannuppannabhave tikkhapañño hutvā pākaṭo imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbatto vuddhimanvāya satthari pasīditvā pabbajanto tikkhapaññatāya khuraggeyeva arahattaṃ pāpuṇi."
    ],
    "innerText": "Tiṃsakappasahassamhītiādikaṃ āyasmato sūcidāyakattherassa apadānaṃ. Ayampi purimajinavaresu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto sumedhassa bhagavato kāle ekasmiṃ kulagehe nibbatto vuddhimanvāya bhagavato cīvarakammaṃ kātuṃ pañca sūciyo adāsi. So tena puññena devamanussesu puññamanubhavitvā vicaranto uppannuppannabhave tikkhapañño hutvā pākaṭo imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbatto vuddhimanvāya satthari pasīditvā pabbajanto tikkhapaññatāya khuraggeyeva arahattaṃ pāpuṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "30"
      },
      ". So aparabhāge puññaṃ paccavekkhanto taṃ disvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tiṃsakappasahassamhī"
      },
      "tiādimāha. Antarantaraṃ panettha suviññeyyameva."
    ],
    "innerText": "30. So aparabhāge puññaṃ paccavekkhanto taṃ disvā somanassajāto pubbacaritāpadānaṃ pakāsento tiṃsakappasahassamhītiādimāha. Antarantaraṃ panettha suviññeyyameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "31"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañcasūcī mayā dinnā"
      },
      "ti ettha sūcati chiddaṃ karoti vijjhatīti sūci, pañcamattā sūcī pañcasūcī mayā dinnāti attho. Sesaṃ suviññeyyamevāti."
    ],
    "innerText": "31.Pañcasūcī mayā dinnāti ettha sūcati chiddaṃ karoti vijjhatīti sūci, pañcamattā sūcī pañcasūcī mayā dinnāti attho. Sesaṃ suviññeyyamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sūcidāyakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Pāṭalipupphiyattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suvaṇṇavaṇṇaṃ sambuddha"
      },
      "ntiādikaṃ āyasmato pāṭalipupphiyattherassa apadānaṃ. Ayampi purimajinavaresu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto tissassa bhagavato kāle ekasmiṃ ",
      " kulagehe seṭṭhiputto hutvā nibbatto vuddhippatto kusalākusalaññū satthari pasīditvā pāṭalipupphaṃ gahetvā satthu pūjesi. So tena puññena bahudhā ",
      " sukhasampattiyo anubhavanto devamanussesu saṃsaranto imasmiṃ buddhuppāde kulagehe nibbatto vuddhimanvāya satthari pasanno pabbajitvā nacirasseva arahā ahosi."
    ],
    "innerText": "Suvaṇṇavaṇṇaṃ sambuddhantiādikaṃ āyasmato pāṭalipupphiyattherassa apadānaṃ. Ayampi purimajinavaresu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto tissassa bhagavato kāle ekasmiṃ kulagehe seṭṭhiputto hutvā nibbatto vuddhippatto kusalākusalaññū satthari pasīditvā pāṭalipupphaṃ gahetvā satthu pūjesi. So tena puññena bahudhā sukhasampattiyo anubhavanto devamanussesu saṃsaranto imasmiṃ buddhuppāde kulagehe nibbatto vuddhimanvāya satthari pasanno pabbajitvā nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "36"
      },
      ". So aparabhāge ",
      " attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "suvaṇṇavaṇṇaṃ sambuddha"
      },
      "ntiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "antarāpaṇe"
      },
      "ti ā samantato hiraññasuvaṇṇādikaṃ bhaṇḍaṃ paṇenti vikkiṇanti pattharanti etthāti āpaṇaṃ, āpaṇassa antaraṃ vīthīti antarāpaṇaṃ, tasmiṃ antarāpaṇe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suvaṇṇavaṇṇaṃ"
      },
      " kañcanagghiyasaṃkāsaṃ dvattiṃsavaralakkhaṇaṃ sambuddhaṃ disvā pāṭalipupphaṃ pūjesinti attho. Sesaṃ sabbattha uttānatthamevāti."
    ],
    "innerText": "36. So aparabhāge attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento suvaṇṇavaṇṇaṃ sambuddhantiādimāha. Tattha antarāpaṇeti ā samantato hiraññasuvaṇṇādikaṃ bhaṇḍaṃ paṇenti vikkiṇanti pattharanti etthāti āpaṇaṃ, āpaṇassa antaraṃ vīthīti antarāpaṇaṃ, tasmiṃ antarāpaṇe. Suvaṇṇavaṇṇaṃ kañcanagghiyasaṃkāsaṃ dvattiṃsavaralakkhaṇaṃ sambuddhaṃ disvā pāṭalipupphaṃ pūjesinti attho. Sesaṃ sabbattha uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pāṭalipupphiyattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Ṭhitañjaliyattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Migaluddo pure āsi"
      },
      "ntiādikaṃ āyasmato ṭhitañjaliyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tatthuppannabhave vivaṭṭūpanissayāni puññāni upacinanto tissassa bhagavato kāle purākatena ekena kammacchiddena nesādayoniyaṃ nibbattitvā viññutaṃ patto migasūkarādayo māretvā nesādakammena araññe vāsaṃ kappesi. Tasmiṃ samaye tisso bhagavā tassānukampāya himavantaṃ agamāsi. So taṃ dvattiṃsavaralakkhaṇehi asītānubyañjanabyāmappabhāhi ca jalamānaṃ bhagavantaṃ disvā somanassajāto paṇāmaṃ katvā gantvā paṇṇasanthare nisīdi. Tasmiṃ khaṇe devo gajjanto asani pati, tato maraṇasamaye buddhamanussaritvā punañjalimakāsi. So tena puññena sukhette katakusalattā akusalavipākaṃ paṭibāhitvā sagge nibbatto kāmāvacarasampattiyo anubhavitvā manussesu manussasampattiyo ca anubhavitvā aparabhāge imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbatto vuddhimanvāya purākatavāsanāya satthari pasīditvā pabbajito nacirasseva arahā ahosi."
    ],
    "innerText": "Migaluddo pure āsintiādikaṃ āyasmato ṭhitañjaliyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tatthuppannabhave vivaṭṭūpanissayāni puññāni upacinanto tissassa bhagavato kāle purākatena ekena kammacchiddena nesādayoniyaṃ nibbattitvā viññutaṃ patto migasūkarādayo māretvā nesādakammena araññe vāsaṃ kappesi. Tasmiṃ samaye tisso bhagavā tassānukampāya himavantaṃ agamāsi. So taṃ dvattiṃsavaralakkhaṇehi asītānubyañjanabyāmappabhāhi ca jalamānaṃ bhagavantaṃ disvā somanassajāto paṇāmaṃ katvā gantvā paṇṇasanthare nisīdi. Tasmiṃ khaṇe devo gajjanto asani pati, tato maraṇasamaye buddhamanussaritvā punañjalimakāsi. So tena puññena sukhette katakusalattā akusalavipākaṃ paṭibāhitvā sagge nibbatto kāmāvacarasampattiyo anubhavitvā manussesu manussasampattiyo ca anubhavitvā aparabhāge imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbatto vuddhimanvāya purākatavāsanāya satthari pasīditvā pabbajito nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "42"
      },
      ". So ",
      " tato paraṃ attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "migaluddo pure āsi"
      },
      "ntiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "migaluddo"
      },
      "ti migānaṃ māraṇaṃ upagacchatīti migaluddo. Miganti sīghaṃ vātavegena gacchanti dhāvantīti migā, tesaṃ migānaṃ māraṇe luddo dāruṇo lobhīti migaluddo. So ahaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pure"
      },
      " bhagavato dassanasamaye migaluddo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āsiṃ"
      },
      " ahosinti attho ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Araññe kānane"
      },
      "ti arati gacchati migasamūho etthāti araññaṃ, atha vā ā samantato rajjanti tattha vivekābhiratā buddhapaccekabuddhādayo ",
      " mahāsārappattā sappurisāti araññaṃ. Kā kucchitākārena vā bhayānakākārena vā nadanti saddaṃ karonti, ānanti vindantīti vā kānanaṃ, tasmiṃ araññe kānane migaluddo pure āsinti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tattha addasaṃ sambuddha"
      },
      "nti tattha tasmiṃ araññe upagataṃ sambuddhaṃ addasaṃ addakkhinti attho. Dassanaṃ pure ahosi avidūre, tasmā manodvārānusārena cakkhuviññāṇaṃ purecārikaṃ kāyaviññāṇasamaṅgiṃ pāpeti appetīti attho."
    ],
    "innerText": "42. So tato paraṃ attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento migaluddo pure āsintiādimāha. Tattha migaluddoti migānaṃ māraṇaṃ upagacchatīti migaluddo. Miganti sīghaṃ vātavegena gacchanti dhāvantīti migā, tesaṃ migānaṃ māraṇe luddo dāruṇo lobhīti migaluddo. So ahaṃ pure bhagavato dassanasamaye migaluddo āsiṃ ahosinti attho . Araññe kānaneti arati gacchati migasamūho etthāti araññaṃ, atha vā ā samantato rajjanti tattha vivekābhiratā buddhapaccekabuddhādayo mahāsārappattā sappurisāti araññaṃ. Kā kucchitākārena vā bhayānakākārena vā nadanti saddaṃ karonti, ānanti vindantīti vā kānanaṃ, tasmiṃ araññe kānane migaluddo pure āsinti sambandho. Tattha addasaṃ sambuddhanti tattha tasmiṃ araññe upagataṃ sambuddhaṃ addasaṃ addakkhinti attho. Dassanaṃ pure ahosi avidūre, tasmā manodvārānusārena cakkhuviññāṇaṃ purecārikaṃ kāyaviññāṇasamaṅgiṃ pāpeti appetīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "44"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tato me asanīpāto"
      },
      "ti ā samantato sananto gajjanto patatīti asani, asaniyā pāto patanaṃ asanīpāto, devadaṇḍoti attho. Sesaṃ sabbattha uttānatthamevāti."
    ],
    "innerText": "44.Tato me asanīpātoti ā samantato sananto gajjanto patatīti asani, asaniyā pāto patanaṃ asanīpāto, devadaṇḍoti attho. Sesaṃ sabbattha uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ṭhitañjaliyattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Tipadumiyattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Padumuttaro nāma jino"
      },
      "tiādikaṃ āyasmato tipadumiyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto padumuttarassa bhagavato kāle haṃsavatiyaṃ mālākārakulagehe nibbatto vuddhippatto mālākārakammaṃ katvā vasanto ekadivasaṃ anekavidhāni jalajathalajapupphāni gahetvā rañño santikaṃ gantukāmo evaṃ cintesi – ‘‘rājā imāni tāva pupphāni disvā pasanno sahassaṃ vā dhanaṃ gāmādikaṃ vā dadeyya, lokanāthaṃ pana pūjetvā nibbānāmatadhanaṃ labhāmi, kiṃ me etesu sundara’’nti tena ‘‘bhagavantaṃ ",
      " pūjetvā saggamokkhasampattiyo nipphādetuṃ vaṭṭatī’’ti cintetvā vaṇṇavantaṃ atīva rattapupphattayaṃ gahetvā pūjesi. Tāni gantvā ākāsaṃ chādetvā pattharitvā aṭṭhaṃsu. Nagaravāsino acchariyabbhutacittajātā celukkhepasahassāni pavattayiṃsu. Taṃ disvā bhagavā anumodanaṃ akāsi. So tena puññena devamanussesu sampattiyo anubhavitvā imasmiṃ buddhuppāde gahapatikule nibbatto vuddhimanvāya satthari pasīditvā dhammaṃ sutvā paṭiladdhasaddho pabbajitvā nacirasseva arahā ahosi."
    ],
    "innerText": "Padumuttaro nāma jinotiādikaṃ āyasmato tipadumiyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto padumuttarassa bhagavato kāle haṃsavatiyaṃ mālākārakulagehe nibbatto vuddhippatto mālākārakammaṃ katvā vasanto ekadivasaṃ anekavidhāni jalajathalajapupphāni gahetvā rañño santikaṃ gantukāmo evaṃ cintesi – ‘‘rājā imāni tāva pupphāni disvā pasanno sahassaṃ vā dhanaṃ gāmādikaṃ vā dadeyya, lokanāthaṃ pana pūjetvā nibbānāmatadhanaṃ labhāmi, kiṃ me etesu sundara’’nti tena ‘‘bhagavantaṃ pūjetvā saggamokkhasampattiyo nipphādetuṃ vaṭṭatī’’ti cintetvā vaṇṇavantaṃ atīva rattapupphattayaṃ gahetvā pūjesi. Tāni gantvā ākāsaṃ chādetvā pattharitvā aṭṭhaṃsu. Nagaravāsino acchariyabbhutacittajātā celukkhepasahassāni pavattayiṃsu. Taṃ disvā bhagavā anumodanaṃ akāsi. So tena puññena devamanussesu sampattiyo anubhavitvā imasmiṃ buddhuppāde gahapatikule nibbatto vuddhimanvāya satthari pasīditvā dhammaṃ sutvā paṭiladdhasaddho pabbajitvā nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "48"
      },
      ". So attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "padumuttaro"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nāma jino"
      },
      "tiādimāha. Tassattho heṭṭhā vuttova. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbadhammāna pāragū"
      },
      "ti sabbesaṃ navalokuttaradhammānaṃ pāraṃ nibbānaṃ gato paccakkhaṃ katoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Danto dantaparivuto"
      },
      "ti sayaṃ kāyavācādīhi ",
      " danto etadagge ṭhapitehi sāvakehi parivutoti attho. Sesaṃ sabbattha sambandhavasena uttānatthamevāti."
    ],
    "innerText": "48. So attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento padumuttaronāma jinotiādimāha. Tassattho heṭṭhā vuttova. Sabbadhammāna pāragūti sabbesaṃ navalokuttaradhammānaṃ pāraṃ nibbānaṃ gato paccakkhaṃ katoti attho. Danto dantaparivutoti sayaṃ kāyavācādīhi danto etadagge ṭhapitehi sāvakehi parivutoti attho. Sesaṃ sabbattha sambandhavasena uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tipadumiyattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Aṭṭhamavaggavaṇṇanā samattā."
  }
]