[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "7. Sakacintaniyavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Sakacintaniyattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pavanaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kānanaṃ disvā"
      },
      "tiādikaṃ āyasmato sakacintaniyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto vipassissa bhagavato kāle ekasmiṃ kulagehe nibbatto vuddhimanvāya tassa bhagavato āyupariyosāne uppanno ",
      " dharamānaṃ bhagavantaṃ apāpuṇitvā parinibbutakāle isipabbajjaṃ pabbajitvā himavante vasanto vivekaṃ ramaṇīyaṃ ekaṃ vanaṃ patvā tatthevekāya kandarāya pulinacetiyaṃ katvā bhagavati saññaṃ katvā sadhātukasaññañca katvā vanapupphehi pūjetvā namassamāno paricari. So tena puññakammena devamanussesu saṃsaranto dvīsu aggaṃ aggasampattiṃ aggañca cakkavattisampattiṃ anubhavitvā imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbatto vibhavasampanno saddhāsampanno satthari pasīditvā pabbajitvā arahā chaḷabhiñño ahosi."
    ],
    "innerText": "Pavanaṃkānanaṃ disvātiādikaṃ āyasmato sakacintaniyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto vipassissa bhagavato kāle ekasmiṃ kulagehe nibbatto vuddhimanvāya tassa bhagavato āyupariyosāne uppanno dharamānaṃ bhagavantaṃ apāpuṇitvā parinibbutakāle isipabbajjaṃ pabbajitvā himavante vasanto vivekaṃ ramaṇīyaṃ ekaṃ vanaṃ patvā tatthevekāya kandarāya pulinacetiyaṃ katvā bhagavati saññaṃ katvā sadhātukasaññañca katvā vanapupphehi pūjetvā namassamāno paricari. So tena puññakammena devamanussesu saṃsaranto dvīsu aggaṃ aggasampattiṃ aggañca cakkavattisampattiṃ anubhavitvā imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbatto vibhavasampanno saddhāsampanno satthari pasīditvā pabbajitvā arahā chaḷabhiñño ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      ". So attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pavanaṃ kānanaṃ disvā"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pavana"
      },
      "nti pakārena vanaṃ patthaṭaṃ vitthiṇṇaṃ gahanabhūtanti pavanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kānanaṃ"
      },
      " avakucchitaṃ ānanaṃ avahanaṃ satataṃ sīhabyagghayakkharakkhasamaddahatthiassasupaṇṇauragehi vihaṅgagaṇasaddakukkuṭakokilehi vā bahalanti kānanaṃ, taṃ kānanasaṅkhātaṃ pavanaṃ manussasaddavirahitattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "appasaddaṃ"
      },
      " nissaddanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anāvila"
      },
      "nti na āvilaṃ upaddavarahitanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Isīnaṃ anuciṇṇa"
      },
      "nti buddhapaccekabuddhaarahantakhīṇāsavasaṅkhātānaṃ isīnaṃ anuciṇṇaṃ nisevitanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āhutīnaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭiggaha"
      },
      "nti āhunaṃ vuccati pūjāsakkāraṃ paṭiggahaṃ gehasadisanti attho."
    ],
    "innerText": "1. So attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento pavanaṃ kānanaṃ disvātiādimāha. Tattha pavananti pakārena vanaṃ patthaṭaṃ vitthiṇṇaṃ gahanabhūtanti pavanaṃ. Kānanaṃ avakucchitaṃ ānanaṃ avahanaṃ satataṃ sīhabyagghayakkharakkhasamaddahatthiassasupaṇṇauragehi vihaṅgagaṇasaddakukkuṭakokilehi vā bahalanti kānanaṃ, taṃ kānanasaṅkhātaṃ pavanaṃ manussasaddavirahitattā appasaddaṃ nissaddanti attho. Anāvilanti na āvilaṃ upaddavarahitanti attho. Isīnaṃ anuciṇṇanti buddhapaccekabuddhaarahantakhīṇāsavasaṅkhātānaṃ isīnaṃ anuciṇṇaṃ nisevitanti attho. Āhutīnaṃpaṭiggahanti āhunaṃ vuccati pūjāsakkāraṃ paṭiggahaṃ gehasadisanti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "2"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Thūpaṃ katvāna veḷunā"
      },
      "ti veḷupesikāhi cetiyaṃ katvāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nānāpupphaṃ samokiri"
      },
      "nti campakādīhi anekehi pupphehi samokiriṃ pūjesinti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammukhā viya sambuddha"
      },
      "nti ",
      " sajīvamānassa sambuddhassa sammukhā iva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nimmitaṃ"
      },
      " uppāditaṃ cetiyaṃ ahaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhi"
      },
      " visesena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vandiṃ"
      },
      " paṇāmamakāsinti attho. Sesaṃ suviññeyyamevāti."
    ],
    "innerText": "2.Thūpaṃ katvāna veḷunāti veḷupesikāhi cetiyaṃ katvāti attho. Nānāpupphaṃ samokirinti campakādīhi anekehi pupphehi samokiriṃ pūjesinti attho. Sammukhā viya sambuddhanti sajīvamānassa sambuddhassa sammukhā iva nimmitaṃ uppāditaṃ cetiyaṃ ahaṃ abhi visesena vandiṃ paṇāmamakāsinti attho. Sesaṃ suviññeyyamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sakacintaniyattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Avopupphiyattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vihārā abhinikkhammā"
      },
      "tiādikaṃ āyasmato avopupphiyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto sikhissa bhagavato kāle kulagehe nibbatto viññutaṃ patto saddhāsampanno dhammaṃ sutvā somanassappatto nānāpupphāni ubhohi hatthehi gahetvā buddhassa upari abbhukkiri. So tena puññena devamanussesu saṃsaranto ",
      " saggasampattiñca cakkavattisampattiñca anubhavitvā sabbattha pūjito imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbato vuddhippatto sāsane pasīditvā pabbajitvā nacirasseva arahā ahosi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ā"
      },
      " samantato kāsati dippatīti ākāso, tasmiṃ ākāse pupphānaṃ avakiritattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avopupphiyatthero"
      },
      "ti pākaṭo."
    ],
    "innerText": "Vihārā abhinikkhammātiādikaṃ āyasmato avopupphiyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto sikhissa bhagavato kāle kulagehe nibbatto viññutaṃ patto saddhāsampanno dhammaṃ sutvā somanassappatto nānāpupphāni ubhohi hatthehi gahetvā buddhassa upari abbhukkiri. So tena puññena devamanussesu saṃsaranto saggasampattiñca cakkavattisampattiñca anubhavitvā sabbattha pūjito imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbato vuddhippatto sāsane pasīditvā pabbajitvā nacirasseva arahā ahosi. Ā samantato kāsati dippatīti ākāso, tasmiṃ ākāse pupphānaṃ avakiritattā avopupphiyattheroti pākaṭo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "7"
      },
      ". Evaṃ pattasantipado attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vihārā abhinikkhammā"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vihārā"
      },
      "ti visesena harati catūhi iriyāpathehi apatantaṃ attabhāvaṃ āharati pavatteti etthāti vihāro, tasmā vihārā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhi"
      },
      " visesena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nikkhamma"
      },
      " nikkhamitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abbhuṭṭhāsi ca caṅkame"
      },
      "ti caṅkamanatthāya saṭṭhiratane caṅkame abhivisesena uṭṭhāsi, abhiruhīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Catusaccaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pakāsento"
      },
      "ti tasmiṃ caṅkame caṅkamanto dukkhasamudayanirodhamaggasaccasaṅkhātaṃ catusaccaṃ pakāsento pākaṭaṃ karonto amataṃ padaṃ nibbānaṃ desento vibhajanto uttānīkaronto tasmiṃ caṅkameti sambandho."
    ],
    "innerText": "7. Evaṃ pattasantipado attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento vihārā abhinikkhammātiādimāha. Tattha vihārāti visesena harati catūhi iriyāpathehi apatantaṃ attabhāvaṃ āharati pavatteti etthāti vihāro, tasmā vihārā abhi visesena nikkhamma nikkhamitvā. Abbhuṭṭhāsi ca caṅkameti caṅkamanatthāya saṭṭhiratane caṅkame abhivisesena uṭṭhāsi, abhiruhīti attho. Catusaccaṃpakāsentoti tasmiṃ caṅkame caṅkamanto dukkhasamudayanirodhamaggasaccasaṅkhātaṃ catusaccaṃ pakāsento pākaṭaṃ karonto amataṃ padaṃ nibbānaṃ desento vibhajanto uttānīkaronto tasmiṃ caṅkameti sambandho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "8"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sikhissa giramaññāya, buddhaseṭṭhassa tādino"
      },
      "ti seṭṭhassa tādiguṇasamaṅgissa sikhissa buddhassa giraṃ saddaṃ ghosaṃ aññāya jānitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nānāpupphaṃ gahetvānā"
      },
      "ti nāgapunnāgādianekāni pupphāni gahetvā āharitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ākāsamhi samokiri"
      },
      "nti caṅkamantassa bhagavato muddhani ākāse okiriṃ pūjesiṃ."
    ],
    "innerText": "8.Sikhissa giramaññāya, buddhaseṭṭhassa tādinoti seṭṭhassa tādiguṇasamaṅgissa sikhissa buddhassa giraṃ saddaṃ ghosaṃ aññāya jānitvā. Nānāpupphaṃ gahetvānāti nāgapunnāgādianekāni pupphāni gahetvā āharitvā. Ākāsamhi samokirinti caṅkamantassa bhagavato muddhani ākāse okiriṃ pūjesiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "9"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tena kammena dvipadindā"
      },
      "ti dvipadānaṃ devabrahmamanussānaṃ inda padhānabhūta. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Narāsabha"
      },
      " narānaṃ ",
      " āsabhabhūta. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pattomhi acalaṃ ṭhāna"
      },
      "nti tumhākaṃ santike pabbajitvā acalaṃ ṭhānaṃ nibbānaṃ patto amhi bhavāmi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hitvā jayaparājaya"
      },
      "nti dibbamanussasampattisaṅkhātaṃ jayañca caturāpāyadukkhasaṅkhātaṃ parājayañca hitvā chaḍḍetvā nibbānaṃ pattosmīti attho. Sesaṃ suviññeyyamevāti."
    ],
    "innerText": "9.Tena kammena dvipadindāti dvipadānaṃ devabrahmamanussānaṃ inda padhānabhūta. Narāsabha narānaṃ āsabhabhūta. Pattomhi acalaṃ ṭhānanti tumhākaṃ santike pabbajitvā acalaṃ ṭhānaṃ nibbānaṃ patto amhi bhavāmi. Hitvā jayaparājayanti dibbamanussasampattisaṅkhātaṃ jayañca caturāpāyadukkhasaṅkhātaṃ parājayañca hitvā chaḍḍetvā nibbānaṃ pattosmīti attho. Sesaṃ suviññeyyamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Avopupphiyattheraapadānavaṇṇanā samatto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Paccāgamaniyattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sindhuyā nadiyā tīre"
      },
      "tiādikaṃ āyasmato paccāgamaniyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto vipassissa bhagavato kāle sindhuyā gaṅgāya samīpe cakkavākayoniyaṃ nibbatto pubbasambhārayuttattā pāṇino akhādanto sevālameva bhakkhayanto carati. Tasmiṃ samaye vipassibhagavā sattānuggahaṃ karonto tattha agamāsi. Tasmiṃ khaṇe so cakkavāko vijjotamānaṃ ",
      " bhagavantaṃ disvā pasannamānaso tuṇḍena sālarukkhato sālapupphaṃ chinditvā āgamma pūjesi. So teneva cittappasādena tato cuto devaloke uppanno aparāparaṃ chakāmāvacarasampattiṃ anubhavitvā tato cuto manussaloke uppajjitvā cakkavattisampattiādayo anubhavitvā imasmiṃ buddhuppāde ekasmiṃ kulagehe ",
      " nibbatto viññutaṃ patto pubbacaritavasena satthari pasanno pabbajitvā nacirasseva arahā ahosi, cakkavāko hutvā bhagavantaṃ disvā katthaci gantvā pupphamāharitvā pūjitattā pubbapuññanāmena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paccāgamaniyatthero"
      },
      "ti pākaṭo."
    ],
    "innerText": "Sindhuyā nadiyā tīretiādikaṃ āyasmato paccāgamaniyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto vipassissa bhagavato kāle sindhuyā gaṅgāya samīpe cakkavākayoniyaṃ nibbatto pubbasambhārayuttattā pāṇino akhādanto sevālameva bhakkhayanto carati. Tasmiṃ samaye vipassibhagavā sattānuggahaṃ karonto tattha agamāsi. Tasmiṃ khaṇe so cakkavāko vijjotamānaṃ bhagavantaṃ disvā pasannamānaso tuṇḍena sālarukkhato sālapupphaṃ chinditvā āgamma pūjesi. So teneva cittappasādena tato cuto devaloke uppanno aparāparaṃ chakāmāvacarasampattiṃ anubhavitvā tato cuto manussaloke uppajjitvā cakkavattisampattiādayo anubhavitvā imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbatto viññutaṃ patto pubbacaritavasena satthari pasanno pabbajitvā nacirasseva arahā ahosi, cakkavāko hutvā bhagavantaṃ disvā katthaci gantvā pupphamāharitvā pūjitattā pubbapuññanāmena paccāgamaniyattheroti pākaṭo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "13"
      },
      ". Attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sindhuyā nadiyā tīre"
      },
      "tiādimāha. Sīti saddaṃ kurumānā dhunāti kampatīti sindhu, nadati saddaṃ karonto gacchatīti nadi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cakkavāko ahaṃ tadā"
      },
      "ti cakkaṃ sīghaṃ gacchantaṃ iva udake vā thale vā ākāse vā sīghaṃ vāti gacchatīti cakkavāko. Tadā vipassiṃ bhagavantaṃ dassanakāle ahaṃ cakkavāko ahosinti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suddhasevālabhakkhoha"
      },
      "nti aññagocaraamissattā suddhasevālameva khādanto ahaṃ vasāmi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāpesu ca susaññato"
      },
      "ti pubbavāsanāvasena pāpakaraṇe suṭṭhu saññato tīhi dvārehi saññato susikkhito."
    ],
    "innerText": "13. Attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento sindhuyā nadiyā tīretiādimāha. Sīti saddaṃ kurumānā dhunāti kampatīti sindhu, nadati saddaṃ karonto gacchatīti nadi. Cakkavāko ahaṃ tadāti cakkaṃ sīghaṃ gacchantaṃ iva udake vā thale vā ākāse vā sīghaṃ vāti gacchatīti cakkavāko. Tadā vipassiṃ bhagavantaṃ dassanakāle ahaṃ cakkavāko ahosinti attho. Suddhasevālabhakkhohanti aññagocaraamissattā suddhasevālameva khādanto ahaṃ vasāmi. Pāpesu ca susaññatoti pubbavāsanāvasena pāpakaraṇe suṭṭhu saññato tīhi dvārehi saññato susikkhito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "14"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Addasaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "virajaṃ buddha"
      },
      "nti rāgadosamohavirahitattā virajaṃ nikkilesaṃ buddhaṃ addasaṃ addakkhiṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gacchantaṃ anilañjase"
      },
      "ti anilañjase ākāsapathe gacchantaṃ buddhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tuṇḍena"
      },
      " mayhaṃ mukhatuṇḍena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tālaṃ"
      },
      " sālapupphaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paggayha"
      },
      " paggahetvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vipassissābhiropayiṃ"
      },
      " vipassissa bhagavato pūjesinti attho. Sesaṃ suviññeyyamevāti."
    ],
    "innerText": "14.Addasaṃvirajaṃ buddhanti rāgadosamohavirahitattā virajaṃ nikkilesaṃ buddhaṃ addasaṃ addakkhiṃ. Gacchantaṃ anilañjaseti anilañjase ākāsapathe gacchantaṃ buddhaṃ. Tuṇḍena mayhaṃ mukhatuṇḍena tālaṃ sālapupphaṃ paggayha paggahetvā vipassissābhiropayiṃ vipassissa bhagavato pūjesinti attho. Sesaṃ suviññeyyamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paccāgamaniyattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Parappasādakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Usabhaṃ pavaraṃ vīra"
      },
      "ntiādikaṃ āyasmato parappasādakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto siddhatthassa bhagavato kāle brāhmaṇakule nibbatto tiṇṇaṃ vedānaṃ pāragū itihāsapañcamānaṃ padako veyyākaraṇo sanighaṇḍukeṭubhānaṃ sākkharappabhedānaṃ lokāyatamahāpurisalakkhaṇesu anavayo nāmena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "selabrāhmaṇo"
      },
      "ti pākaṭo siddhatthaṃ bhagavantaṃ disvā dvattiṃsamahāpurisalakkhaṇehi asītianubyañjanehi cāti sayaṃ sobhamānaṃ disvā pasannamānaso anekehi kāraṇehi ",
      " anekāhi ",
      " upamāhi thomanaṃ pakāsesi. So tena puññakammena devaloke sakkamārādayo cha kāmāvacarasampattiyo anubhavitvā manussesu cakkavattisampattiṃ anubhavitvā imasmiṃ buddhuppāde vibhavasampanne ekasmiṃ kulagehe nibbatto viññutaṃ patto satthari pasīdisvā pabbajito nacirasseva catupaṭisambhidāchaḷabhiññappatto mahākhīṇāsavo ahosi, buddhassa thutiyā sattānaṃ sabbesaṃ cittappasādakaraṇato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "parappasādakatthero"
      },
      "ti pākaṭo."
    ],
    "innerText": "Usabhaṃ pavaraṃ vīrantiādikaṃ āyasmato parappasādakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto siddhatthassa bhagavato kāle brāhmaṇakule nibbatto tiṇṇaṃ vedānaṃ pāragū itihāsapañcamānaṃ padako veyyākaraṇo sanighaṇḍukeṭubhānaṃ sākkharappabhedānaṃ lokāyatamahāpurisalakkhaṇesu anavayo nāmena selabrāhmaṇoti pākaṭo siddhatthaṃ bhagavantaṃ disvā dvattiṃsamahāpurisalakkhaṇehi asītianubyañjanehi cāti sayaṃ sobhamānaṃ disvā pasannamānaso anekehi kāraṇehi anekāhi upamāhi thomanaṃ pakāsesi. So tena puññakammena devaloke sakkamārādayo cha kāmāvacarasampattiyo anubhavitvā manussesu cakkavattisampattiṃ anubhavitvā imasmiṃ buddhuppāde vibhavasampanne ekasmiṃ kulagehe nibbatto viññutaṃ patto satthari pasīdisvā pabbajito nacirasseva catupaṭisambhidāchaḷabhiññappatto mahākhīṇāsavo ahosi, buddhassa thutiyā sattānaṃ sabbesaṃ cittappasādakaraṇato parappasādakattheroti pākaṭo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "20"
      },
      ". Ekadivasaṃ attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "usabhaṃ pavaraṃ vīra"
      },
      "ntiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "usabha"
      },
      "nti vasabho nisabho visabho āsabhoti cattāro jeṭṭhapuṅgavā. Tattha gavasatajeṭṭhako vasabho, gavasahassajeṭṭhako nisabho, gavasatasahassajeṭṭhako visabho, gavakoṭisatasahassajeṭṭhako āsabhoti ca yassa kassaci thutiṃ karontā brāhmaṇapaṇḍitā bahussutā attano attano paññāvasena thutiṃ karonti, buddhānaṃ pana sabbākārena thutiṃ kātuṃ samattho ekopi natthi. Appameyyo hi buddho. Vuttañhetaṃ –"
    ],
    "innerText": "20. Ekadivasaṃ attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento usabhaṃ pavaraṃ vīrantiādimāha. Tattha usabhanti vasabho nisabho visabho āsabhoti cattāro jeṭṭhapuṅgavā. Tattha gavasatajeṭṭhako vasabho, gavasahassajeṭṭhako nisabho, gavasatasahassajeṭṭhako visabho, gavakoṭisatasahassajeṭṭhako āsabhoti ca yassa kassaci thutiṃ karontā brāhmaṇapaṇḍitā bahussutā attano attano paññāvasena thutiṃ karonti, buddhānaṃ pana sabbākārena thutiṃ kātuṃ samattho ekopi natthi. Appameyyo hi buddho. Vuttañhetaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Buddhopi ",
      " buddhassa bhaṇeyya vaṇṇaṃ, kappampi ce aññamabhāsamāno;"
    ],
    "innerText": "‘‘Buddhopi buddhassa bhaṇeyya vaṇṇaṃ, kappampi ce aññamabhāsamāno;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Khīyetha kappo ciradīghamantare, vaṇṇo na khīyetha tathāgatassā’’ti. (dī. ni. aṭṭha. 1.304; 3.141; ma. ni. aṭṭha. 2.425; udā. aṭṭha. 53) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Ādikaṃ. Ayampi brāhmaṇo mukhārūḷhavasena ekapasīdanavasena ‘‘āsabha’’nti vattabbe ‘‘usabha’’ntiādimāha. Varitabbo patthetabboti varo. Anekesu kappasatasahassesu katavīriyattā vīro. Mahantaṃ sīlakkhandhādikaṃ esati gavesatīti mahesī, taṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mahesiṃ"
      },
      " buddhaṃ. Visesena kilesakhandhamārādayo māre jitavāti vijitāvī, taṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vijitāvinaṃ"
      },
      " sambuddhaṃ. Suvaṇṇassa vaṇṇo iva vaṇṇo yassa sambuddhassa so suvaṇṇavaṇṇo, taṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "suvaṇṇavaṇṇaṃ"
      },
      " sambuddhaṃ disvā ko nāma satto nappasīdatīti."
    ],
    "innerText": "Ādikaṃ. Ayampi brāhmaṇo mukhārūḷhavasena ekapasīdanavasena ‘‘āsabha’’nti vattabbe ‘‘usabha’’ntiādimāha. Varitabbo patthetabboti varo. Anekesu kappasatasahassesu katavīriyattā vīro. Mahantaṃ sīlakkhandhādikaṃ esati gavesatīti mahesī, taṃ mahesiṃ buddhaṃ. Visesena kilesakhandhamārādayo māre jitavāti vijitāvī, taṃ vijitāvinaṃ sambuddhaṃ. Suvaṇṇassa vaṇṇo iva vaṇṇo yassa sambuddhassa so suvaṇṇavaṇṇo, taṃ suvaṇṇavaṇṇaṃ sambuddhaṃ disvā ko nāma satto nappasīdatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Parappasādakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Bhisadāyakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vessabhū"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nāma nāmenā"
      },
      "tiādikaṃ āyasmato bhisadāyakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto vessabhussa bhagavato kāle himavantasmiṃ hatthiyoniyaṃ nibbatto tasmiṃ paṭivasati. Tasmiṃ samaye vessabhū bhagavā vivekakāmo himavantamagamāsi. Taṃ disvā so hatthināgo pasannamānaso bhisamuḷālaṃ ",
      " gahetvā bhagavantaṃ bhojesi. So tena puññakammena hatthiyonito cuto devaloke uppajjitvā tattha cha kāmāvacarasampattiyo anubhavitvā manussattamāgato manussesu cakkavattisampattiādayo anubhavitvā imasmiṃ buddhuppāde mahābhoge aññatarasmiṃ kule nibbatto pubbavāsanābalena satthari pasanno pabbajitvā nacirasseva arahā ahosi, so pubbe katakusalanāmena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhisadāyakatthero"
      },
      "ti pākaṭo."
    ],
    "innerText": "Vessabhūnāma nāmenātiādikaṃ āyasmato bhisadāyakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto vessabhussa bhagavato kāle himavantasmiṃ hatthiyoniyaṃ nibbatto tasmiṃ paṭivasati. Tasmiṃ samaye vessabhū bhagavā vivekakāmo himavantamagamāsi. Taṃ disvā so hatthināgo pasannamānaso bhisamuḷālaṃ gahetvā bhagavantaṃ bhojesi. So tena puññakammena hatthiyonito cuto devaloke uppajjitvā tattha cha kāmāvacarasampattiyo anubhavitvā manussattamāgato manussesu cakkavattisampattiādayo anubhavitvā imasmiṃ buddhuppāde mahābhoge aññatarasmiṃ kule nibbatto pubbavāsanābalena satthari pasanno pabbajitvā nacirasseva arahā ahosi, so pubbe katakusalanāmena bhisadāyakattheroti pākaṭo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "29"
      },
      ". So attano pubbakammaṃ saritvā pubbacaritāpadānaṃ dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vessabhū nāma nāmenā"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vessabhū"
      },
      "ti vessaṃ bhunāti atikkamatīti vessabhū. Atha vā vesse vāṇijakamme vā kāmarāgādike vā kusalādikamme vā vatthukāmakilesakāme vā bhunāti abhibhavatīti ",
      " vessabhū, so nāmena vessabhū nāma bhagavā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Isīnaṃ tatiyo ahū"
      },
      "ti kusaladhamme esati gavesatīti isi, ‘‘vipassī, sikhī, vessabhū’’ti vuttattā tatiyo isi tatiyo bhagavā ahu ahosīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kānanaṃ vanamoggayhā"
      },
      "ti kānanasaṅkhātaṃ vanaṃ ogayha ogahetvā pāvisīti attho."
    ],
    "innerText": "29. So attano pubbakammaṃ saritvā pubbacaritāpadānaṃ dassento vessabhū nāma nāmenātiādimāha. Tattha vessabhūti vessaṃ bhunāti atikkamatīti vessabhū. Atha vā vesse vāṇijakamme vā kāmarāgādike vā kusalādikamme vā vatthukāmakilesakāme vā bhunāti abhibhavatīti vessabhū, so nāmena vessabhū nāma bhagavā. Isīnaṃ tatiyo ahūti kusaladhamme esati gavesatīti isi, ‘‘vipassī, sikhī, vessabhū’’ti vuttattā tatiyo isi tatiyo bhagavā ahu ahosīti attho. Kānanaṃ vanamoggayhāti kānanasaṅkhātaṃ vanaṃ ogayha ogahetvā pāvisīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "30"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhisamuḷālaṃ gaṇhitvā"
      },
      "ti dvipadacatuppadānaṃ chātakaṃ bhisati hiṃsati vināsetīti bhisaṃ, ko so? Padumakando, bhisañca muḷālañca bhisamuḷālaṃ, taṃ bhisamuḷālaṃ gahetvāti attho."
    ],
    "innerText": "30.Bhisamuḷālaṃ gaṇhitvāti dvipadacatuppadānaṃ chātakaṃ bhisati hiṃsati vināsetīti bhisaṃ, ko so? Padumakando, bhisañca muḷālañca bhisamuḷālaṃ, taṃ bhisamuḷālaṃ gahetvāti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "31"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Karena ca parāmaṭṭho"
      },
      "ti taṃ mayā dinnadānaṃ, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vessabhūvarabuddhinā"
      },
      " uttamabuddhinā vessabhunā karena hatthatalena parāmaṭṭho katasamphasso ahosi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sukhāhaṃ nābhijānāmi, samaṃ tena kutottari"
      },
      "nti tena sukhena ",
      " samaṃ sukhaṃ nābhijānāmi, tato uttariṃ tato paraṃ tato adhikaṃ sukhaṃ kutoti attho. Sesaṃ nayānusārena suviññeyyanti."
    ],
    "innerText": "31.Karena ca parāmaṭṭhoti taṃ mayā dinnadānaṃ, vessabhūvarabuddhinā uttamabuddhinā vessabhunā karena hatthatalena parāmaṭṭho katasamphasso ahosi. Sukhāhaṃ nābhijānāmi, samaṃ tena kutottarinti tena sukhena samaṃ sukhaṃ nābhijānāmi, tato uttariṃ tato paraṃ tato adhikaṃ sukhaṃ kutoti attho. Sesaṃ nayānusārena suviññeyyanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Bhisadāyakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Sucintitattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Giriduggacaro āsi"
      },
      "ntiādikaṃ āyasmato sucintitattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto atthadassissa bhagavato kāle himavantappadese nesādakule uppanno migasūkarādayo vadhitvā khādanto viharati. Tadā lokanātho lokānuggahaṃ sattānuddayatañca paṭicca himavantamagamāsi. Tadā so nesādo bhagavantaṃ disvā pasannamānaso attano khādanatthāya ānītaṃ varamadhuramaṃsaṃ adāsi. Paṭiggahesi bhagavā tassānukampāya, taṃ bhuñjitvā anumodanaṃ vatvā pakkāmi. So teneva puññena ",
      " teneva somanassena tato cuto sugatīsu saṃsaranto cha kāmāvacarasampattiyo anubhavitvā manussesu cakkavattisampattiādayo anubhavitvā imasmiṃ buddhuppāde kulagehe nibbatto satthari pasīditvā pabbajito nacirasseva arahā ahosi."
    ],
    "innerText": "Giriduggacaro āsintiādikaṃ āyasmato sucintitattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto atthadassissa bhagavato kāle himavantappadese nesādakule uppanno migasūkarādayo vadhitvā khādanto viharati. Tadā lokanātho lokānuggahaṃ sattānuddayatañca paṭicca himavantamagamāsi. Tadā so nesādo bhagavantaṃ disvā pasannamānaso attano khādanatthāya ānītaṃ varamadhuramaṃsaṃ adāsi. Paṭiggahesi bhagavā tassānukampāya, taṃ bhuñjitvā anumodanaṃ vatvā pakkāmi. So teneva puññena teneva somanassena tato cuto sugatīsu saṃsaranto cha kāmāvacarasampattiyo anubhavitvā manussesu cakkavattisampattiādayo anubhavitvā imasmiṃ buddhuppāde kulagehe nibbatto satthari pasīditvā pabbajito nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "36"
      },
      ". Catupaṭisambhidāpañcābhiññādibhedaṃ patvā attano pubbakammaṃ saritvā somanassajāto ",
      " pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "giriduggacaro āsi"
      },
      "ntiādimāha. Girati saddaṃ karotīti giri, ko so? Silāpaṃsumayapabbato, duṭṭhu dukkhena gamanīyaṃ duggaṃ, girīhi duggaṃ giriduggaṃ, duggamoti attho. Tasmiṃ giridugge pabbatantare caro caraṇasīlo āsiṃ ahosiṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhijātova kesarī"
      },
      "ti abhi visesena jāto nibbatto kesarīva kesarasīho iva giriduggasmiṃ carāmīti attho."
    ],
    "innerText": "36. Catupaṭisambhidāpañcābhiññādibhedaṃ patvā attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento giriduggacaro āsintiādimāha. Girati saddaṃ karotīti giri, ko so? Silāpaṃsumayapabbato, duṭṭhu dukkhena gamanīyaṃ duggaṃ, girīhi duggaṃ giriduggaṃ, duggamoti attho. Tasmiṃ giridugge pabbatantare caro caraṇasīlo āsiṃ ahosiṃ. Abhijātova kesarīti abhi visesena jāto nibbatto kesarīva kesarasīho iva giriduggasmiṃ carāmīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "40"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Giriduggaṃ pavisiṃ aha"
      },
      "nti ahaṃ tadā tena maṃsadānena pītisomanassajāto pabbatantaraṃ pāvisiṃ. Sesaṃ uttānatthamevāti."
    ],
    "innerText": "40.Giriduggaṃ pavisiṃ ahanti ahaṃ tadā tena maṃsadānena pītisomanassajāto pabbatantaraṃ pāvisiṃ. Sesaṃ uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sucintitattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Vatthadāyakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pakkhijāto"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tadā āsi"
      },
      "ntiādikaṃ āyasmato vatthadāyakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto atthadassissa bhagavato kāle supaṇṇayoniyaṃ nibbatto gandhamādanapabbataṃ gacchantaṃ atthadassiṃ bhagavantaṃ disvā pasannamānaso supaṇṇavaṇṇaṃ vijahitvā māṇavakavaṇṇaṃ nimminitvā mahagghaṃ dibbavatthaṃ ādāya bhagavantaṃ pūjesi. Sopi bhagavā paṭiggahetvā anumodanaṃ vatvā pakkāmi. So teneva somanassena vītināmetvā yāvatāyukaṃ ṭhatvā tato cuto devaloke nibbatto tattha aparāparaṃ saṃsaranto puññāni anubhavitvā tato manussesu manussasampattinti sabbattha mahagghaṃ vatthābharaṇaṃ laddhaṃ, tato uppannuppannabhave vatthacchāyāya gatagataṭṭhāne vasanto imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbatto viññutaṃ patto satthari pasīditvā pabbajito nacirasseva chaḷabhiññappattakhīṇāsavo ahosi, pubbe katapuññanāmena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vatthadāyakatthero"
      },
      "ti pākaṭo."
    ],
    "innerText": "Pakkhijātotadā āsintiādikaṃ āyasmato vatthadāyakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto atthadassissa bhagavato kāle supaṇṇayoniyaṃ nibbatto gandhamādanapabbataṃ gacchantaṃ atthadassiṃ bhagavantaṃ disvā pasannamānaso supaṇṇavaṇṇaṃ vijahitvā māṇavakavaṇṇaṃ nimminitvā mahagghaṃ dibbavatthaṃ ādāya bhagavantaṃ pūjesi. Sopi bhagavā paṭiggahetvā anumodanaṃ vatvā pakkāmi. So teneva somanassena vītināmetvā yāvatāyukaṃ ṭhatvā tato cuto devaloke nibbatto tattha aparāparaṃ saṃsaranto puññāni anubhavitvā tato manussesu manussasampattinti sabbattha mahagghaṃ vatthābharaṇaṃ laddhaṃ, tato uppannuppannabhave vatthacchāyāya gatagataṭṭhāne vasanto imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbatto viññutaṃ patto satthari pasīditvā pabbajito nacirasseva chaḷabhiññappattakhīṇāsavo ahosi, pubbe katapuññanāmena vatthadāyakattheroti pākaṭo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "45"
      },
      ". So attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pakkhijāto tadā āsi"
      },
      "ntiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pakkhijāto"
      },
      "ti pakkhandati upalavati sakuṇo etenāti pakkhaṃ, pakkhamassa atthīti pakkhī, pakkhiyoniyaṃ jāto nibbattoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Supaṇṇo"
      },
      "ti sundaraṃ paṇṇaṃ pattaṃ yassa so supaṇṇo, vātaggāhasuvaṇṇavaṇṇajalamānapattamahābhāroti ",
      " attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Garuḷādhipo"
      },
      "ti nāge gaṇhanatthāya garuṃ bhāraṃ pāsāṇaṃ giḷantīti garuḷā, garuḷānaṃ adhipo rājāti garuḷādhipo, virajaṃ buddhaṃ addasāhanti sambandho."
    ],
    "innerText": "45. So attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento pakkhijāto tadā āsintiādimāha. Tattha pakkhijātoti pakkhandati upalavati sakuṇo etenāti pakkhaṃ, pakkhamassa atthīti pakkhī, pakkhiyoniyaṃ jāto nibbattoti attho. Supaṇṇoti sundaraṃ paṇṇaṃ pattaṃ yassa so supaṇṇo, vātaggāhasuvaṇṇavaṇṇajalamānapattamahābhāroti attho. Garuḷādhipoti nāge gaṇhanatthāya garuṃ bhāraṃ pāsāṇaṃ giḷantīti garuḷā, garuḷānaṃ adhipo rājāti garuḷādhipo, virajaṃ buddhaṃ addasāhanti sambandho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vatthadāyakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Ambadāyakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anomadassī bhagavā"
      },
      "tiādikaṃ āyasmato ambadāyakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto anomadassissa bhagavato kāle vānarayoniyaṃ ",
      " nibbatto himavante kapirājā hutvā paṭivasati. Tasmiṃ samaye anomadassī bhagavā tassānukampāya himavantamagamāsi. Atha so kapirājā bhagavantaṃ disvā pasannamānaso sumadhuraṃ ambaphalaṃ khuddamadhunā adāsi. Atha bhagavā tassa passantasseva taṃ sabbaṃ paribhuñjitvā anumodanaṃ vatvā pakkāmi. Atha so somanassasampannahadayo teneva pītisomanassena yāvatāyukaṃ ṭhatvā tato cuto devaloke nibbatto aparāparaṃ tattha dibbasukhamanubhavitvā manussesu ca manussasampattiṃ anubhavitvā imasmiṃ buddhuppāde vibhavasampanne ekasmiṃ kulagehe nibbatto satthari pasīditvā pabbajitvā nacirasseva chaḷabhiññappatto ahosi. Pubbapuññanāmena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ambadāyakatthero"
      },
      "ti pākaṭo."
    ],
    "innerText": "Anomadassī bhagavātiādikaṃ āyasmato ambadāyakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto anomadassissa bhagavato kāle vānarayoniyaṃ nibbatto himavante kapirājā hutvā paṭivasati. Tasmiṃ samaye anomadassī bhagavā tassānukampāya himavantamagamāsi. Atha so kapirājā bhagavantaṃ disvā pasannamānaso sumadhuraṃ ambaphalaṃ khuddamadhunā adāsi. Atha bhagavā tassa passantasseva taṃ sabbaṃ paribhuñjitvā anumodanaṃ vatvā pakkāmi. Atha so somanassasampannahadayo teneva pītisomanassena yāvatāyukaṃ ṭhatvā tato cuto devaloke nibbatto aparāparaṃ tattha dibbasukhamanubhavitvā manussesu ca manussasampattiṃ anubhavitvā imasmiṃ buddhuppāde vibhavasampanne ekasmiṃ kulagehe nibbatto satthari pasīditvā pabbajitvā nacirasseva chaḷabhiññappatto ahosi. Pubbapuññanāmena ambadāyakattheroti pākaṭo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "53"
      },
      ". So aparabhāge attanā katakusalabījaṃ disvā somanassajāto attano pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anomadassī bhagavā"
      },
      "tiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mettāya aphari loke, appamāṇe nirūpadhī"
      },
      "ti so bhagavā sabbaloke appamāṇe satte ‘‘sukhī hontū’’tiādinā nirupadhi upadhivirahitaṃ katvā mettāya mettacittena aphari patthari vaḍḍhesīti attho."
    ],
    "innerText": "53. So aparabhāge attanā katakusalabījaṃ disvā somanassajāto attano pubbacaritāpadānaṃ pakāsento anomadassī bhagavātiādimāha. Mettāya aphari loke, appamāṇe nirūpadhīti so bhagavā sabbaloke appamāṇe satte ‘‘sukhī hontū’’tiādinā nirupadhi upadhivirahitaṃ katvā mettāya mettacittena aphari patthari vaḍḍhesīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "54"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kapi ahaṃ tadā āsi"
      },
      "nti tadā tassāgamanakāle kapirājā ahosinti attho."
    ],
    "innerText": "54.Kapi ahaṃ tadā āsinti tadā tassāgamanakāle kapirājā ahosinti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ambadāyakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Sumanattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sumano"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nāma nāmenā"
      },
      "tiādikaṃ āyasmato sumanattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto sikhissa bhagavato kāle mālākārassa kulagehe nibbatto vuddhimanvāya saddhājāto bhagavati pasannamānaso sumanamālāmuṭṭhiyo gahetvā ubhohi ",
      " hatthehi pūjesi. So tena puññena devamanussesu dve sampattiyo anubhavitvā imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbatto vuddhimanvāya puttadārehi vaḍḍhitvā sumananāmena ",
      " pākaṭo satthari pasīditvā pabbajito nacirasseva arahā ahosi."
    ],
    "innerText": "Sumanonāma nāmenātiādikaṃ āyasmato sumanattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto sikhissa bhagavato kāle mālākārassa kulagehe nibbatto vuddhimanvāya saddhājāto bhagavati pasannamānaso sumanamālāmuṭṭhiyo gahetvā ubhohi hatthehi pūjesi. So tena puññena devamanussesu dve sampattiyo anubhavitvā imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbatto vuddhimanvāya puttadārehi vaḍḍhitvā sumananāmena pākaṭo satthari pasīditvā pabbajito nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "62"
      },
      ". So arahā hutvā attano pubbakammaṃ saritvā somanassajāto attano pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sumano nāma nāmenā"
      },
      "tiādimāha. Sundaraṃ manaṃ cittaṃ yassa so sumano. Saddhāpasādabahumānena yutto nāmena sumano nāma mālākāro tadā ahaṃ ahosiṃ."
    ],
    "innerText": "62. So arahā hutvā attano pubbakammaṃ saritvā somanassajāto attano pubbacaritāpadānaṃ pakāsento sumano nāma nāmenātiādimāha. Sundaraṃ manaṃ cittaṃ yassa so sumano. Saddhāpasādabahumānena yutto nāmena sumano nāma mālākāro tadā ahaṃ ahosiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "63"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sikhino lokabandhuno"
      },
      "ti sikhā muddhā kāsatīti sikhī. Atha vā sampayuttasampayoge khādati viddhaṃsetīti sikhī, kā sā? Aggisikhā, aggisikhā viya sikhāya dippanato sikhī. Yathā aggisikhā jotati pākaṭā hoti, sikhī pattatiṇakaṭṭhapalāsādike dahati, evamayampi bhagavā nīlapītādiraṃsīhi jotati sakalalokasannivāse pākaṭo hoti. Sakasantānagatasabbakilese soseti viddhaṃseti jhāpetīti vohāranāmaṃ nāmakammaṃ nāmadheyyaṃ, tassa sikhino. Sakalalokassa bandhuñātakoti lokabandhu, tassa sikhino lokabandhuno bhagavato sumanapupphaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhiropayiṃ"
      },
      " pūjesinti attho."
    ],
    "innerText": "63.Sikhino lokabandhunoti sikhā muddhā kāsatīti sikhī. Atha vā sampayuttasampayoge khādati viddhaṃsetīti sikhī, kā sā? Aggisikhā, aggisikhā viya sikhāya dippanato sikhī. Yathā aggisikhā jotati pākaṭā hoti, sikhī pattatiṇakaṭṭhapalāsādike dahati, evamayampi bhagavā nīlapītādiraṃsīhi jotati sakalalokasannivāse pākaṭo hoti. Sakasantānagatasabbakilese soseti viddhaṃseti jhāpetīti vohāranāmaṃ nāmakammaṃ nāmadheyyaṃ, tassa sikhino. Sakalalokassa bandhuñātakoti lokabandhu, tassa sikhino lokabandhuno bhagavato sumanapupphaṃ abhiropayiṃ pūjesinti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sumanattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Pupphacaṅkoṭiyattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhītarūpaṃ sīhaṃ vā"
      },
      "tiādikaṃ āyasmato pupphacaṅkoṭiyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto sikhissa bhagavato kāle ekasmiṃ kulagehe nibbatto viññutaṃ patto mahāvibhavasampanno satthari pasīditvā pasannākāraṃ dassento suvaṇṇavaṇṇaṃ anojapupphamocinitvā caṅkoṭakaṃ pūretvā bhagavantaṃ pūjetvā ‘‘bhagavā ",
      ", imassa nissandena nibbattanibbattaṭṭhāne suvaṇṇavaṇṇo pūjanīyo hutvā nibbānaṃ pāpuṇeyya’’nti patthanamakāsi. So tena puññakammena devamanussesu nibbatto sabbattha pūjito ",
      " suvaṇṇavaṇṇo abhirūpo ahosi. So aparabhāge imasmiṃ buddhuppāde vibhavasampanne ekasmiṃ kulagehe nibbatto vuddhippatto satthari pasīditvā pabbajito vipassanaṃ vaḍḍhetvā nacirasseva arahā ahosi."
    ],
    "innerText": "Abhītarūpaṃ sīhaṃ vātiādikaṃ āyasmato pupphacaṅkoṭiyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto sikhissa bhagavato kāle ekasmiṃ kulagehe nibbatto viññutaṃ patto mahāvibhavasampanno satthari pasīditvā pasannākāraṃ dassento suvaṇṇavaṇṇaṃ anojapupphamocinitvā caṅkoṭakaṃ pūretvā bhagavantaṃ pūjetvā ‘‘bhagavā , imassa nissandena nibbattanibbattaṭṭhāne suvaṇṇavaṇṇo pūjanīyo hutvā nibbānaṃ pāpuṇeyya’’nti patthanamakāsi. So tena puññakammena devamanussesu nibbatto sabbattha pūjito suvaṇṇavaṇṇo abhirūpo ahosi. So aparabhāge imasmiṃ buddhuppāde vibhavasampanne ekasmiṃ kulagehe nibbatto vuddhippatto satthari pasīditvā pabbajito vipassanaṃ vaḍḍhetvā nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "68-9"
      },
      ". So ",
      " pattaarahattaphalo attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhītarūpaṃ sīhaṃ vā"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sīha"
      },
      "nti dvipadacatuppadādayo satte abhibhavati ajjhottharatīti sīho, abhītarūpo abhītasabhāvo, taṃ abhītarūpaṃ sīhaṃ iva nisinnaṃ pūjesinti sambandho. Pakkhīnaṃ aggaṃ garuḷarājaṃ iva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pavaraṃ"
      },
      " uttamaṃ byaggharājaṃ iva abhi visesena jātaṃ sabbasīhānaṃ visesaṃ kesarasīhaṃ iva tilokassa saraṇaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sikhiṃ"
      },
      " sammāsambuddhaṃ. Kiṃ bhūtaṃ? Anejaṃ nikkilesaṃ khandhamārādīhi aparājitaṃ nisinnaṃ sikhinti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Māraṇānagga"
      },
      "nti sabbakilesānaṃ māraṇe sosane viddhaṃsane aggaṃ seṭṭhaṃ kilese mārentānaṃ paccekabuddhabuddhasāvakānaṃ vijjamānānampi tesaṃ agganti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhikkhusaṅghapurakkhataṃ"
      },
      " parivāritaṃ parivāretvā nisinnaṃ sikhinti sambandho."
    ],
    "innerText": "68-9. So pattaarahattaphalo attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento abhītarūpaṃ sīhaṃ vātiādimāha. Tattha sīhanti dvipadacatuppadādayo satte abhibhavati ajjhottharatīti sīho, abhītarūpo abhītasabhāvo, taṃ abhītarūpaṃ sīhaṃ iva nisinnaṃ pūjesinti sambandho. Pakkhīnaṃ aggaṃ garuḷarājaṃ iva pavaraṃ uttamaṃ byaggharājaṃ iva abhi visesena jātaṃ sabbasīhānaṃ visesaṃ kesarasīhaṃ iva tilokassa saraṇaṃ sikhiṃ sammāsambuddhaṃ. Kiṃ bhūtaṃ? Anejaṃ nikkilesaṃ khandhamārādīhi aparājitaṃ nisinnaṃ sikhinti sambandho. Māraṇānagganti sabbakilesānaṃ māraṇe sosane viddhaṃsane aggaṃ seṭṭhaṃ kilese mārentānaṃ paccekabuddhabuddhasāvakānaṃ vijjamānānampi tesaṃ agganti attho. Bhikkhusaṅghapurakkhataṃ parivāritaṃ parivāretvā nisinnaṃ sikhinti sambandho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "70"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Caṅkoṭake ṭhapetvānā"
      },
      "ti uttamaṃ anojapupphaṃ karaṇḍake pūretvā sikhīsambuddhaṃ seṭṭhaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samokiriṃ"
      },
      " pūjesinti attho."
    ],
    "innerText": "70.Caṅkoṭake ṭhapetvānāti uttamaṃ anojapupphaṃ karaṇḍake pūretvā sikhīsambuddhaṃ seṭṭhaṃ samokiriṃ pūjesinti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pupphacaṅkoṭiyattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sattamavaggavaṇṇanā samattā."
  }
]