[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "1. Mahāpaññākathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "Mahāpaññākathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      ". Idāni ",
      " visesato paññāpadaṭṭhānabhūtāya suññakathāya anantaraṃ kathitāya paññākathāya apubbatthānuvaṇṇanā. Tattha ādito tāva sattasu anupassanāsu ekekamūlakā satta paññā pucchāpubbaṅgamaṃ katvā niddiṭṭhā, puna sattānupassanāmūlakā ekekuttaramūlakā ca tisso paññā pucchaṃ akatvāva niddiṭṭhā, evamādito dasapaññāpāripūrī niddiṭṭhā. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aniccānupassanā"
      },
      " tāva yasmā aniccato diṭṭhesu saṅkhāresu ‘‘yadaniccaṃ, taṃ dukkha’’nti dukkhato ca ‘‘yaṃ dukkhaṃ, tadanattā’’ti anattato ca javati, tasmā sā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhāvitā bahulīkatā javanapaññaṃ paripūreti"
      },
      ". Sā hi sakavisayesu javatīti javanā, javanā ca sā paññā cāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "javanapaññā. Dukkhānupassanā"
      },
      " samādhindriyanissitattā balavatī hutvā paṇidhiṃ nibbijjhati padāleti, tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nibbedhikapaññaṃ paripūreti"
      },
      ". Sā hi nibbijjhatīti nibbedhikā, nibbedhikā ca sā paññā cāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nibbedhikapaññā. Anattānupassanā"
      },
      " suññatādassanena vuddhippattiyā mahattappattattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mahāpaññaṃ paripūreti"
      },
      ". Sā hi vuddhippattattā mahatī ca sā paññā cāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mahāpaññā. Nibbidānupassanā"
      },
      " yasmā tissannaṃyeva anupassanānaṃ purimatopi āsevanāya balappattāvatthattā sabbasaṅkhāresu nibbindanasamatthā hutvā tikkhā hoti, tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tikkhapaññaṃ paripūreti. Virāgānupassanā"
      },
      "pi yasmā tissannaṃyeva anupassanānaṃ purimatopi āsevanābalappattānaṃ vuddhatarāvatthattā sabbasaṅkhārehi virajjanasamatthā hutvā vipulā hoti, tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vipulapaññaṃ paripūreti"
      },
      "."
    ],
    "innerText": "1. Idāni visesato paññāpadaṭṭhānabhūtāya suññakathāya anantaraṃ kathitāya paññākathāya apubbatthānuvaṇṇanā. Tattha ādito tāva sattasu anupassanāsu ekekamūlakā satta paññā pucchāpubbaṅgamaṃ katvā niddiṭṭhā, puna sattānupassanāmūlakā ekekuttaramūlakā ca tisso paññā pucchaṃ akatvāva niddiṭṭhā, evamādito dasapaññāpāripūrī niddiṭṭhā. Tattha aniccānupassanā tāva yasmā aniccato diṭṭhesu saṅkhāresu ‘‘yadaniccaṃ, taṃ dukkha’’nti dukkhato ca ‘‘yaṃ dukkhaṃ, tadanattā’’ti anattato ca javati, tasmā sā bhāvitā bahulīkatā javanapaññaṃ paripūreti. Sā hi sakavisayesu javatīti javanā, javanā ca sā paññā cāti javanapaññā. Dukkhānupassanā samādhindriyanissitattā balavatī hutvā paṇidhiṃ nibbijjhati padāleti, tasmā nibbedhikapaññaṃ paripūreti. Sā hi nibbijjhatīti nibbedhikā, nibbedhikā ca sā paññā cāti nibbedhikapaññā. Anattānupassanā suññatādassanena vuddhippattiyā mahattappattattā mahāpaññaṃ paripūreti. Sā hi vuddhippattattā mahatī ca sā paññā cāti mahāpaññā. Nibbidānupassanā yasmā tissannaṃyeva anupassanānaṃ purimatopi āsevanāya balappattāvatthattā sabbasaṅkhāresu nibbindanasamatthā hutvā tikkhā hoti, tasmā tikkhapaññaṃ paripūreti. Virāgānupassanāpi yasmā tissannaṃyeva anupassanānaṃ purimatopi āsevanābalappattānaṃ vuddhatarāvatthattā sabbasaṅkhārehi virajjanasamatthā hutvā vipulā hoti, tasmā vipulapaññaṃ paripūreti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nirodhānupassanā"
      },
      "pi yasmā tissannaṃyeva anupassanānaṃ purimatopi āsevanābalappattānaṃ vuddhatarāvatthattā vayalakkhaṇavasena sabbasaṅkhārānaṃ nirodhadassanasamatthā hutvā gambhīrā hoti, tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gambhīrapaññaṃ paripūreti"
      },
      ". Nirodho hi uttānapaññehi alabbhaneyyapatiṭṭhattā gambhīro, tasmiṃ ",
      " gambhīre gādhappattā paññāpi gambhīrā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭinissaggānupassanā"
      },
      "pi yasmā tissannaṃyeva anupassanānaṃ purimatopi āsevanābalappattānaṃ vuddhatarāvatthattā vayalakkhaṇavasena sabbasaṅkhārapaṭinissajjanasamatthā ",
      " hutvā asāmantā hoti, vuddhipariyantappattattā chahi paññāhi dūre hotīti attho. Tasmā ",
      " sayaṃ asāmantattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asāmantapaññaṃ paripūreti"
      },
      ". Sā hi heṭṭhimapaññāhi dūrattā asāmantā, asamīpā vā paññāti asāmantapaññā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṇḍiccaṃ paripūrentī"
      },
      "ti paṇḍitabhāvaṃ paripūrenti. Yasmā yathāvuttā satta paññā paripuṇṇā bhāvetvā paṇḍitalakkhaṇappatto sikhappattavuṭṭhānagāminivipassanāsaṅkhātehi saṅkhārupekkhānulomagotrabhuñāṇehi paṇḍito hutvā paṇḍiccena samannāgato hoti, tasmā ‘‘paṇḍiccaṃ paripūrentī’’ti vuttaṃ."
    ],
    "innerText": "Nirodhānupassanāpi yasmā tissannaṃyeva anupassanānaṃ purimatopi āsevanābalappattānaṃ vuddhatarāvatthattā vayalakkhaṇavasena sabbasaṅkhārānaṃ nirodhadassanasamatthā hutvā gambhīrā hoti, tasmā gambhīrapaññaṃ paripūreti. Nirodho hi uttānapaññehi alabbhaneyyapatiṭṭhattā gambhīro, tasmiṃ gambhīre gādhappattā paññāpi gambhīrā. Paṭinissaggānupassanāpi yasmā tissannaṃyeva anupassanānaṃ purimatopi āsevanābalappattānaṃ vuddhatarāvatthattā vayalakkhaṇavasena sabbasaṅkhārapaṭinissajjanasamatthā hutvā asāmantā hoti, vuddhipariyantappattattā chahi paññāhi dūre hotīti attho. Tasmā sayaṃ asāmantattā asāmantapaññaṃ paripūreti. Sā hi heṭṭhimapaññāhi dūrattā asāmantā, asamīpā vā paññāti asāmantapaññā. Paṇḍiccaṃ paripūrentīti paṇḍitabhāvaṃ paripūrenti. Yasmā yathāvuttā satta paññā paripuṇṇā bhāvetvā paṇḍitalakkhaṇappatto sikhappattavuṭṭhānagāminivipassanāsaṅkhātehi saṅkhārupekkhānulomagotrabhuñāṇehi paṇḍito hutvā paṇḍiccena samannāgato hoti, tasmā ‘‘paṇḍiccaṃ paripūrentī’’ti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭha paññā"
      },
      "ti paṇḍiccasaṅkhātāya paññāya saha sabbā aṭṭha paññā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puthupaññaṃ paripūrentī"
      },
      "ti yasmā tena paṇḍiccena samannāgato hutvā so paṇḍito gotrabhuñāṇānantaraṃ nibbānaṃ ārammaṇaṃ katvā lokuttarabhāvappattiyā lokiyato puthubhūtattā visuṃbhūtattā puthupaññātisaṅkhātaṃ maggaphalapaññaṃ pāpuṇāti, tasmā ‘‘aṭṭha paññā puthupaññaṃ paripūrentī’’ti vuttaṃ."
    ],
    "innerText": "Aṭṭha paññāti paṇḍiccasaṅkhātāya paññāya saha sabbā aṭṭha paññā. Puthupaññaṃ paripūrentīti yasmā tena paṇḍiccena samannāgato hutvā so paṇḍito gotrabhuñāṇānantaraṃ nibbānaṃ ārammaṇaṃ katvā lokuttarabhāvappattiyā lokiyato puthubhūtattā visuṃbhūtattā puthupaññātisaṅkhātaṃ maggaphalapaññaṃ pāpuṇāti, tasmā ‘‘aṭṭha paññā puthupaññaṃ paripūrentī’’ti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Imā nava paññā"
      },
      "tiādīsu tasseva kamena adhigatamaggaphalassa ariyapuggalassa paṇītalokuttaradhammopayogena paṇītacittasantānattā pahaṭṭhākāreneva ca pavattamānacittasantānassa phalānantaraṃ otiṇṇabhavaṅgato vuṭṭhitassa maggapaccavekkhaṇā, tato ca bhavaṅgaṃ otaritvā vuṭṭhitassa phalapaccavekkhaṇā, imināva nayena pahīnakilesapaccavekkhaṇā, avasiṭṭhakilesapaccavekkhaṇā, nibbānapaccavekkhaṇāti pañca paccavekkhaṇā pavattanti. Tāsu paccavekkhaṇāsu maggapaccavekkhaṇā phalapaccavekkhaṇā ca paṭibhānapaṭisambhidā hoti. Kathaṃ? ‘‘Yaṃkiñci paccayasambhūtaṃ nibbānaṃ bhāsitattho vipāko kiriyāti ime pañca dhammā attho’’ti abhidhamme pāḷiṃ anugantvā tadaṭṭhakathāyaṃ vuttaṃ. Nibbānassa ca atthattā tadārammaṇaṃ maggaphalañāṇaṃ ‘‘atthesu ñāṇaṃ atthapaṭisambhidā’’ti (vibha. 718; paṭi. ma. 1.110) vacanato atthapaṭisambhidā hoti. Tassa atthapaṭisambhidābhūtassa maggaphalañāṇassa paccavekkhaṇañāṇaṃ ‘‘ñāṇesu ñāṇaṃ paṭibhānapaṭisambhidā’’ti vacanato paṭibhānapaṭisambhidā hoti. Sā ca paccavekkhaṇapaññā hāsākārena pavattamānacittasantānassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hāsapaññā"
      },
      " nāma hoti. Tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nava paññā hāsapaññaṃ paripūrentī"
      },
      "ti ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hāsapaññā paṭibhānapaṭisambhidā"
      },
      "ti ca vuttaṃ. Sabbappakārāpi paññā tassa tassa atthassa pākaṭakaraṇasaṅkhātena paññāpanaṭṭhena paññā, tena tena vā pakārena dhamme jānātīti paññā."
    ],
    "innerText": "Imā nava paññātiādīsu tasseva kamena adhigatamaggaphalassa ariyapuggalassa paṇītalokuttaradhammopayogena paṇītacittasantānattā pahaṭṭhākāreneva ca pavattamānacittasantānassa phalānantaraṃ otiṇṇabhavaṅgato vuṭṭhitassa maggapaccavekkhaṇā, tato ca bhavaṅgaṃ otaritvā vuṭṭhitassa phalapaccavekkhaṇā, imināva nayena pahīnakilesapaccavekkhaṇā, avasiṭṭhakilesapaccavekkhaṇā, nibbānapaccavekkhaṇāti pañca paccavekkhaṇā pavattanti. Tāsu paccavekkhaṇāsu maggapaccavekkhaṇā phalapaccavekkhaṇā ca paṭibhānapaṭisambhidā hoti. Kathaṃ? ‘‘Yaṃkiñci paccayasambhūtaṃ nibbānaṃ bhāsitattho vipāko kiriyāti ime pañca dhammā attho’’ti abhidhamme pāḷiṃ anugantvā tadaṭṭhakathāyaṃ vuttaṃ. Nibbānassa ca atthattā tadārammaṇaṃ maggaphalañāṇaṃ ‘‘atthesu ñāṇaṃ atthapaṭisambhidā’’ti (vibha. 718; paṭi. ma. 1.110) vacanato atthapaṭisambhidā hoti. Tassa atthapaṭisambhidābhūtassa maggaphalañāṇassa paccavekkhaṇañāṇaṃ ‘‘ñāṇesu ñāṇaṃ paṭibhānapaṭisambhidā’’ti vacanato paṭibhānapaṭisambhidā hoti. Sā ca paccavekkhaṇapaññā hāsākārena pavattamānacittasantānassa hāsapaññā nāma hoti. Tasmā nava paññā hāsapaññaṃ paripūrentīti ca hāsapaññā paṭibhānapaṭisambhidāti ca vuttaṃ. Sabbappakārāpi paññā tassa tassa atthassa pākaṭakaraṇasaṅkhātena paññāpanaṭṭhena paññā, tena tena vā pakārena dhamme jānātīti paññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tassā"
      },
      "ti ",
      " tassa vuttappakārassa ariyapuggalassa. Karaṇatthe sāmivacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atthavavatthānato"
      },
      "ti yathāvuttassa pañcavidhassa atthassa vavatthāpanavasena. Vuttampi cetaṃ samaṇakaraṇīyakathāyaṃ ",
      " ‘‘hetuphalaṃ nibbānaṃ vacanattho atha vipākaṃ kiriyāti atthe pañca pabhede paṭhamantapabhedagataṃ ñāṇa’’nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adhigatā hotī"
      },
      "ti paṭiladdhā hoti. Sāyeva paṭilābhasacchikiriyāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sacchikatā"
      },
      ". Paṭilābhaphasseneva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "phassitā paññāya. Dhammavavatthānato"
      },
      "ti ‘‘yo koci phalanibbattako hetu ariyamaggo bhāsitaṃ kusalaṃ akusalanti ime pañca dhammā dhammo’’ti abhidhamme pāḷiyānusārena vuttānaṃ pañcannaṃ dhammānaṃ vavatthāpanavasena. Vuttampi cetaṃ samaṇakaraṇīyakathāyaṃ ‘‘hetu ariyamaggo vacanaṃ kusalañca akusalañcāti dhamme pañca pabhede dutiyantapabhedagataṃ ñāṇa’’nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Niruttivavatthānato"
      },
      "ti tesaṃ tesaṃ atthadhammānaṃ anurūpaniruttīnaṃ vavatthāpanavasena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭibhānavavatthānato"
      },
      "ti paṭibhānasaṅkhātānaṃ tiṇṇaṃ paṭisambhidāñāṇānaṃ vavatthāpanavasena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tassimā"
      },
      "ti nigamanavacanametaṃ."
    ],
    "innerText": "Tassāti tassa vuttappakārassa ariyapuggalassa. Karaṇatthe sāmivacanaṃ. Atthavavatthānatoti yathāvuttassa pañcavidhassa atthassa vavatthāpanavasena. Vuttampi cetaṃ samaṇakaraṇīyakathāyaṃ ‘‘hetuphalaṃ nibbānaṃ vacanattho atha vipākaṃ kiriyāti atthe pañca pabhede paṭhamantapabhedagataṃ ñāṇa’’nti. Adhigatā hotīti paṭiladdhā hoti. Sāyeva paṭilābhasacchikiriyāya sacchikatā. Paṭilābhaphasseneva phassitā paññāya. Dhammavavatthānatoti ‘‘yo koci phalanibbattako hetu ariyamaggo bhāsitaṃ kusalaṃ akusalanti ime pañca dhammā dhammo’’ti abhidhamme pāḷiyānusārena vuttānaṃ pañcannaṃ dhammānaṃ vavatthāpanavasena. Vuttampi cetaṃ samaṇakaraṇīyakathāyaṃ ‘‘hetu ariyamaggo vacanaṃ kusalañca akusalañcāti dhamme pañca pabhede dutiyantapabhedagataṃ ñāṇa’’nti. Niruttivavatthānatoti tesaṃ tesaṃ atthadhammānaṃ anurūpaniruttīnaṃ vavatthāpanavasena. Paṭibhānavavatthānatoti paṭibhānasaṅkhātānaṃ tiṇṇaṃ paṭisambhidāñāṇānaṃ vavatthāpanavasena. Tassimāti nigamanavacanametaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "2"
      },
      ". Evaṃ sabbasaṅgāhakavasena anupassanānaṃ visesaṃ dassetvā idāni vatthubhedavasena dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpe aniccānupassanā"
      },
      "tiādimāha. Taṃ heṭṭhā vuttatthameva. Puna rūpādīsuyeva atītānāgatapaccuppannavasena javanapaññaṃ dassetukāmo kevalaṃ rūpādivasena ca atītānāgatapaccuppannarūpādivasena ca pucchaṃ katvā pucchākameneva vissajjanaṃ akāsi. Tattha suddharūpādivissajjanesu paṭhamaṃ niddiṭṭhā eva paññā atītānāgatapaccuppannamūlakesu sabbavissajjanesu tesu atītādīsu javanavasena javanapaññāti niddiṭṭhā."
    ],
    "innerText": "2. Evaṃ sabbasaṅgāhakavasena anupassanānaṃ visesaṃ dassetvā idāni vatthubhedavasena dassento rūpe aniccānupassanātiādimāha. Taṃ heṭṭhā vuttatthameva. Puna rūpādīsuyeva atītānāgatapaccuppannavasena javanapaññaṃ dassetukāmo kevalaṃ rūpādivasena ca atītānāgatapaccuppannarūpādivasena ca pucchaṃ katvā pucchākameneva vissajjanaṃ akāsi. Tattha suddharūpādivissajjanesu paṭhamaṃ niddiṭṭhā eva paññā atītānāgatapaccuppannamūlakesu sabbavissajjanesu tesu atītādīsu javanavasena javanapaññāti niddiṭṭhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "3"
      },
      ". Puna anekasuttantapubbaṅgamaṃ paññāpabhedaṃ dassetukāmo paṭhamaṃ tāva suttante uddisi. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sappurisasaṃsevo"
      },
      "ti heṭṭhā vuttappakārānaṃ sappurisānaṃ bhajanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddhammassavana"
      },
      "nti tesaṃ sappurisānaṃ santike sīlādipaṭipattidīpakassa saddhammavacanassa savanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yonisomanasikāro"
      },
      "ti sutānaṃ dhammānaṃ atthūpaparikkhaṇavasena upāyena manasikāro. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammānudhammapaṭipattī"
      },
      "ti lokuttaradhamme anugatassa sīlādipaṭipadādhammassa paṭipajjanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññāpaṭilābhāya"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paññāvuddhiyā paññāvepullāya paññābāhullāyā"
      },
      "ti imāni cattāri paññāvasena bhāvavacanāni. Sesāni dvādasa puggalavasena bhāvavacanāni."
    ],
    "innerText": "3. Puna anekasuttantapubbaṅgamaṃ paññāpabhedaṃ dassetukāmo paṭhamaṃ tāva suttante uddisi. Tattha sappurisasaṃsevoti heṭṭhā vuttappakārānaṃ sappurisānaṃ bhajanaṃ. Saddhammassavananti tesaṃ sappurisānaṃ santike sīlādipaṭipattidīpakassa saddhammavacanassa savanaṃ. Yonisomanasikāroti sutānaṃ dhammānaṃ atthūpaparikkhaṇavasena upāyena manasikāro. Dhammānudhammapaṭipattīti lokuttaradhamme anugatassa sīlādipaṭipadādhammassa paṭipajjanaṃ. Paññāpaṭilābhāyapaññāvuddhiyā paññāvepullāya paññābāhullāyāti imāni cattāri paññāvasena bhāvavacanāni. Sesāni dvādasa puggalavasena bhāvavacanāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Soḷasapaññāniddesavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "4"
      },
      ". Suttantaniddese ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "channaṃ abhiññāñāṇāna"
      },
      "nti iddhividhadibbasotacetopariyapubbenivāsadibbacakkhuāsavānaṃ khayañāṇānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tesattatīnaṃ ñāṇāna"
      },
      "nti ñāṇakathāya niddiṭṭhānaṃ sāvakasādhāraṇānaṃ ñāṇānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sattasattatīnaṃ ñāṇāna"
      },
      "nti ettha –"
    ],
    "innerText": "4. Suttantaniddese channaṃ abhiññāñāṇānanti iddhividhadibbasotacetopariyapubbenivāsadibbacakkhuāsavānaṃ khayañāṇānaṃ. Tesattatīnaṃ ñāṇānanti ñāṇakathāya niddiṭṭhānaṃ sāvakasādhāraṇānaṃ ñāṇānaṃ. Sattasattatīnaṃ ñāṇānanti ettha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Sattasattari ",
      " vo, bhikkhave, ñāṇavatthūni desessāmi, taṃ suṇātha sādhukaṃ manasi karotha, bhāsissāmīti. Katamāni, bhikkhave, sattasattari ñāṇavatthūni? Jātipaccayā jarāmaraṇanti ñāṇaṃ, asati jātiyā natthi jarāmaraṇanti ñāṇaṃ. Atītampi addhānaṃ jātipaccayā jarāmaraṇanti ñāṇaṃ, asati jātiyā natthi jarāmaraṇanti ñāṇaṃ, anāgatampi addhānaṃ jātipaccayā jarāmaraṇanti ñāṇaṃ, asati jātiyā natthi jarāmaraṇanti ñāṇaṃ. Yampissa taṃ dhammaṭṭhitiñāṇaṃ, tampi khayadhammaṃ vayadhammaṃ virāgadhammaṃ nirodhadhammanti ñāṇaṃ. Bhavapaccayā jātīti ñāṇaṃ…pe… upādānapaccayā bhavoti ñāṇaṃ… taṇhāpaccayā upādānanti ñāṇaṃ… vedanāpaccayā taṇhāti ñāṇaṃ… phassapaccayā vedanāti ñāṇaṃ… saḷāyatanapaccayā phassoti ñāṇaṃ… nāmarūpapaccayā saḷāyatananti ñāṇaṃ… viññāṇapaccayā nāmarūpanti ñāṇaṃ… saṅkhārapaccayā viññāṇanti ñāṇaṃ… avijjāpaccayā saṅkhārāti ñāṇaṃ, asati avijjāya natthi saṅkhārāti ñāṇaṃ. Atītampi addhānaṃ avijjāpaccayā saṅkhārāti ñāṇaṃ, asati avijjāya natthi saṅkhārāti ñāṇaṃ, anāgatampi addhānaṃ avijjāpaccayā saṅkhārāti ñāṇaṃ, asati avijjāya natthi saṅkhārāti ñāṇaṃ. Yampissa taṃ dhammaṭṭhitiñāṇaṃ, tampi khayadhammaṃ vayadhammaṃ virāgadhammaṃ nirodhadhammanti ñāṇaṃ. Imāni vuccanti, bhikkhave, sattasattari ñāṇavatthūnī’’ti (saṃ. ni. 2.34) –"
    ],
    "innerText": "‘‘Sattasattari vo, bhikkhave, ñāṇavatthūni desessāmi, taṃ suṇātha sādhukaṃ manasi karotha, bhāsissāmīti. Katamāni, bhikkhave, sattasattari ñāṇavatthūni? Jātipaccayā jarāmaraṇanti ñāṇaṃ, asati jātiyā natthi jarāmaraṇanti ñāṇaṃ. Atītampi addhānaṃ jātipaccayā jarāmaraṇanti ñāṇaṃ, asati jātiyā natthi jarāmaraṇanti ñāṇaṃ, anāgatampi addhānaṃ jātipaccayā jarāmaraṇanti ñāṇaṃ, asati jātiyā natthi jarāmaraṇanti ñāṇaṃ. Yampissa taṃ dhammaṭṭhitiñāṇaṃ, tampi khayadhammaṃ vayadhammaṃ virāgadhammaṃ nirodhadhammanti ñāṇaṃ. Bhavapaccayā jātīti ñāṇaṃ…pe… upādānapaccayā bhavoti ñāṇaṃ… taṇhāpaccayā upādānanti ñāṇaṃ… vedanāpaccayā taṇhāti ñāṇaṃ… phassapaccayā vedanāti ñāṇaṃ… saḷāyatanapaccayā phassoti ñāṇaṃ… nāmarūpapaccayā saḷāyatananti ñāṇaṃ… viññāṇapaccayā nāmarūpanti ñāṇaṃ… saṅkhārapaccayā viññāṇanti ñāṇaṃ… avijjāpaccayā saṅkhārāti ñāṇaṃ, asati avijjāya natthi saṅkhārāti ñāṇaṃ. Atītampi addhānaṃ avijjāpaccayā saṅkhārāti ñāṇaṃ, asati avijjāya natthi saṅkhārāti ñāṇaṃ, anāgatampi addhānaṃ avijjāpaccayā saṅkhārāti ñāṇaṃ, asati avijjāya natthi saṅkhārāti ñāṇaṃ. Yampissa taṃ dhammaṭṭhitiñāṇaṃ, tampi khayadhammaṃ vayadhammaṃ virāgadhammaṃ nirodhadhammanti ñāṇaṃ. Imāni vuccanti, bhikkhave, sattasattari ñāṇavatthūnī’’ti (saṃ. ni. 2.34) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ ",
      " bhagavatā nidānavagge vuttāni sattasattati ñāṇāni. ‘‘Jarāmaraṇe ñāṇaṃ, jarāmaraṇasamudaye ñāṇaṃ, jarāmaraṇanirodhe ñāṇaṃ, jarāmaraṇanirodhagāminiyā paṭipadāya ñāṇa’’nti (saṃ. ni. 2.33) iminā nayena ekādasasu aṅgesu cattāri cattāri katvā vuttāni catucattārīsa ñāṇavatthūni pana idha na gahitāni. Ubhayattha ca ñāṇāniyeva hitasukhassa vatthūnīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ñāṇavatthūni. Lābho"
      },
      "tiādīsu lābhoyeva upasaggena visesetvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭilābho"
      },
      "ti vutto. Puna tasseva atthavivaraṇavasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "patti sampattī"
      },
      "ti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Phassanā"
      },
      "ti adhigamavasena phusanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sacchikiriyā"
      },
      "ti paṭilābhasacchikiriyā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upasampadā"
      },
      "ti nipphādanā."
    ],
    "innerText": "Evaṃ bhagavatā nidānavagge vuttāni sattasattati ñāṇāni. ‘‘Jarāmaraṇe ñāṇaṃ, jarāmaraṇasamudaye ñāṇaṃ, jarāmaraṇanirodhe ñāṇaṃ, jarāmaraṇanirodhagāminiyā paṭipadāya ñāṇa’’nti (saṃ. ni. 2.33) iminā nayena ekādasasu aṅgesu cattāri cattāri katvā vuttāni catucattārīsa ñāṇavatthūni pana idha na gahitāni. Ubhayattha ca ñāṇāniyeva hitasukhassa vatthūnīti ñāṇavatthūni. Lābhotiādīsu lābhoyeva upasaggena visesetvā paṭilābhoti vutto. Puna tasseva atthavivaraṇavasena patti sampattīti vuttaṃ. Phassanāti adhigamavasena phusanā. Sacchikiriyāti paṭilābhasacchikiriyā. Upasampadāti nipphādanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sattannañca sekkhāna"
      },
      "nti tisso sikkhā sikkhantīti sekkhasaññitānaṃ sotāpattimaggaṭṭhādīnaṃ sattannaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puthujjanakalyāṇakassa cā"
      },
      "ti nibbānagāminiyā paṭipadāya yuttattā sundaraṭṭhena kalyāṇasaññitassa puthujjanassa. Vaḍḍhitaṃ vaḍḍhanaṃ etāyāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vaḍḍhitavaḍḍhanā"
      },
      ". Yathāvuttānaṃ aṭṭhannampi paññānaṃ vasena visesato ca arahato paññāvasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paññāvuddhiyā"
      },
      ". Tathā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paññāvepullāya. Mahante"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atthe pariggaṇhātī"
      },
      "tiādīsu paṭisambhidappatto ariyasāvako atthādayo ",
      " ārammaṇakaraṇena pariggaṇhāti. Sabbāpi mahāpaññā ariyasāvakānaṃyeva. Tassā ca paññāya visayā heṭṭhā vuttatthā eva."
    ],
    "innerText": "Sattannañca sekkhānanti tisso sikkhā sikkhantīti sekkhasaññitānaṃ sotāpattimaggaṭṭhādīnaṃ sattannaṃ. Puthujjanakalyāṇakassa cāti nibbānagāminiyā paṭipadāya yuttattā sundaraṭṭhena kalyāṇasaññitassa puthujjanassa. Vaḍḍhitaṃ vaḍḍhanaṃ etāyāti vaḍḍhitavaḍḍhanā. Yathāvuttānaṃ aṭṭhannampi paññānaṃ vasena visesato ca arahato paññāvasena paññāvuddhiyā. Tathā paññāvepullāya. Mahanteatthe pariggaṇhātītiādīsu paṭisambhidappatto ariyasāvako atthādayo ārammaṇakaraṇena pariggaṇhāti. Sabbāpi mahāpaññā ariyasāvakānaṃyeva. Tassā ca paññāya visayā heṭṭhā vuttatthā eva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puthunānākhandhesū"
      },
      "tiādīsu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nānā"
      },
      "saddo puthusaddassa atthavacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñāṇaṃ pavattatīti puthupaññā"
      },
      "ti tesu tathāvuttesu khandhādīsu ñāṇaṃ pavattatīti katvā taṃ ñāṇaṃ puthupaññā nāmāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nānāpaṭiccasamuppādesū"
      },
      "ti paṭiccasamuppannānaṃ dhammānaṃ vasena paccayabahuttā vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nānāsuññatamanupalabbhesū"
      },
      "ti upalabbhanaṃ upalabbho, gahaṇanti attho. Na upalabbho anupalabbho, anupalabbhānaṃ bahuttā bahuvacanena anupalabbhā, pañcavīsatisuññatāvasena vā nānāsuññatāsu attattaniyādīnaṃ anupalabbhā nānāsuññatānupalabbhā, tesu. ‘‘Nānāsuññatānupalabbhesū’’ti vattabbe ‘‘adukkhamasukhā’’tiādīsu (dha. sa. tikamātikā 2) viya ma-kāro padasandhivasena vutto. Imā pañca paññā kalyāṇaputhujjanehi sādhāraṇā, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nānāatthā"
      },
      "dīsu paññā ariyānaṃyeva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puthujjanasādhāraṇe dhamme"
      },
      "ti lokiyadhamme. Iminā avasānapariyāyena ",
      " lokiyato puthubhūtanibbānārammaṇattā puthubhūtā visuṃbhūtā paññāti puthupaññā nāmāti vuttaṃ hoti."
    ],
    "innerText": "Puthunānākhandhesūtiādīsu nānāsaddo puthusaddassa atthavacanaṃ. Ñāṇaṃ pavattatīti puthupaññāti tesu tathāvuttesu khandhādīsu ñāṇaṃ pavattatīti katvā taṃ ñāṇaṃ puthupaññā nāmāti attho. Nānāpaṭiccasamuppādesūti paṭiccasamuppannānaṃ dhammānaṃ vasena paccayabahuttā vuttaṃ. Nānāsuññatamanupalabbhesūti upalabbhanaṃ upalabbho, gahaṇanti attho. Na upalabbho anupalabbho, anupalabbhānaṃ bahuttā bahuvacanena anupalabbhā, pañcavīsatisuññatāvasena vā nānāsuññatāsu attattaniyādīnaṃ anupalabbhā nānāsuññatānupalabbhā, tesu. ‘‘Nānāsuññatānupalabbhesū’’ti vattabbe ‘‘adukkhamasukhā’’tiādīsu (dha. sa. tikamātikā 2) viya ma-kāro padasandhivasena vutto. Imā pañca paññā kalyāṇaputhujjanehi sādhāraṇā, nānāatthādīsu paññā ariyānaṃyeva. Puthujjanasādhāraṇe dhammeti lokiyadhamme. Iminā avasānapariyāyena lokiyato puthubhūtanibbānārammaṇattā puthubhūtā visuṃbhūtā paññāti puthupaññā nāmāti vuttaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vipulapaññā"
      },
      " mahāpaññānayena veditabbā. Yathāvutte dhamme pariggaṇhantassa guṇamahantatāya tesaṃ dhammānaṃ pariggāhikāya ca paññāya mahantatā, tesaṃ dhammānaṃ sayameva mahantattā uḷārattā dhammānañca paññāya ca vipulatā veditabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gambhīrapaññā"
      },
      " puthupaññānayena veditabbā. Te ca dhammā te ca anupalabbhā sā ca paññā pakatijanena alabbhaneyyapatiṭṭhattā gambhīrā."
    ],
    "innerText": "Vipulapaññā mahāpaññānayena veditabbā. Yathāvutte dhamme pariggaṇhantassa guṇamahantatāya tesaṃ dhammānaṃ pariggāhikāya ca paññāya mahantatā, tesaṃ dhammānaṃ sayameva mahantattā uḷārattā dhammānañca paññāya ca vipulatā veditabbā. Gambhīrapaññā puthupaññānayena veditabbā. Te ca dhammā te ca anupalabbhā sā ca paññā pakatijanena alabbhaneyyapatiṭṭhattā gambhīrā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yassa puggalassā"
      },
      "ti ariyapuggalasseva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Añño kocī"
      },
      "ti puthujjano. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhisambhavitu"
      },
      "nti sampāpuṇituṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anabhisambhavanīyo"
      },
      "ti sampāpuṇituṃ asakkuṇeyyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aññehī"
      },
      "ti puthujjaneheva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭhamakassā"
      },
      "ti arahattaphalaṭṭhato paṭṭhāya gaṇiyamāne aṭṭhamabhūtassa sotāpattimaggaṭṭhassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dūre"
      },
      "ti vippakaṭṭhe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vidūre"
      },
      "ti visesena vippakaṭṭhe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suvidūre"
      },
      "ti suṭṭhu visesena vippakaṭṭhe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na santike"
      },
      "ti na samīpe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na sāmantā"
      },
      "ti na samīpabhāge. Imāni dve paṭisedhasahitāni vacanāni dūrabhāvasseva niyamanāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upādāyā"
      },
      "ti paṭicca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sotāpannassā"
      },
      "ti sotāpattiphalaṭṭhassa. Eteneva taṃtaṃmaggapaññā taṃtaṃphalapaññāya dūreti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paccekasambuddho"
      },
      "ti ",
      " upasaggena visesitaṃ. Itaradvayaṃ pana suddhameva āgataṃ."
    ],
    "innerText": "Yassa puggalassāti ariyapuggalasseva. Añño kocīti puthujjano. Abhisambhavitunti sampāpuṇituṃ. Anabhisambhavanīyoti sampāpuṇituṃ asakkuṇeyyo. Aññehīti puthujjaneheva. Aṭṭhamakassāti arahattaphalaṭṭhato paṭṭhāya gaṇiyamāne aṭṭhamabhūtassa sotāpattimaggaṭṭhassa. Dūreti vippakaṭṭhe. Vidūreti visesena vippakaṭṭhe. Suvidūreti suṭṭhu visesena vippakaṭṭhe. Na santiketi na samīpe. Na sāmantāti na samīpabhāge. Imāni dve paṭisedhasahitāni vacanāni dūrabhāvasseva niyamanāni. Upādāyāti paṭicca. Sotāpannassāti sotāpattiphalaṭṭhassa. Eteneva taṃtaṃmaggapaññā taṃtaṃphalapaññāya dūreti vuttaṃ hoti. Paccekasambuddhoti upasaggena visesitaṃ. Itaradvayaṃ pana suddhameva āgataṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "5"
      },
      ". ‘‘Paccekabuddhassa sadevakassa ca lokassa paññā tathāgatassa paññāya dūre’’tiādīni vatvā tameva dūraṭṭhaṃ anekappakārato dassetukāmo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paññāpabhedakusalo"
      },
      "tiādimāha ",
      ". Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paññāpabhedakusalo"
      },
      "ti attano anantavikappe paññāpabhede cheko. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pabhinnañāṇo"
      },
      "ti anantappabhedapattañāṇo. Etena paññāpabhedakusalattepi sati tāsaṃ paññānaṃ anantabhedattaṃ dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adhigatapaṭisambhido"
      },
      "ti paṭiladdhaaggacatupaṭisambhidāñāṇo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Catuvesārajjappatto"
      },
      "ti cattāri visāradabhāvasaṅkhātāni ñāṇāni patto. Yathāha –"
    ],
    "innerText": "5. ‘‘Paccekabuddhassa sadevakassa ca lokassa paññā tathāgatassa paññāya dūre’’tiādīni vatvā tameva dūraṭṭhaṃ anekappakārato dassetukāmo paññāpabhedakusalotiādimāha . Tattha paññāpabhedakusaloti attano anantavikappe paññāpabhede cheko. Pabhinnañāṇoti anantappabhedapattañāṇo. Etena paññāpabhedakusalattepi sati tāsaṃ paññānaṃ anantabhedattaṃ dasseti. Adhigatapaṭisambhidoti paṭiladdhaaggacatupaṭisambhidāñāṇo. Catuvesārajjappattoti cattāri visāradabhāvasaṅkhātāni ñāṇāni patto. Yathāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Sammāsambuddhassa te paṭijānato ‘ime dhammā anabhisambuddhā’ti, tatra vata maṃ samaṇo vā brāhmaṇo vā devo vā ",
      " māro vā brahmā vā koci vā lokasmiṃ saha dhammena paṭicodessatīti nimittametaṃ, bhikkhave, na samanupassāmi, etamahaṃ, bhikkhave, nimittaṃ asamanupassanto khemappatto abhayappatto vesārajjappatto viharāmi. Khīṇāsavassa te paṭijānato ‘ime āsavā aparikkhīṇā’ti, ‘ye kho pana te antarāyikā dhammā vuttā, te paṭisevato nālaṃ antarāyāyā’ti, ‘yassa kho pana te atthāya dhammo desito, so na niyyāti takkarassa sammā dukkhakkhayāyā’ti, tatra vata maṃ samaṇo vā brāhmaṇo vā devo vā māro vā brahmā vā koci vā lokasmiṃ saha dhammena paṭicodessatīti nimittametaṃ, bhikkhave, na samanupassāmi, etamahaṃ, bhikkhave, nimittaṃ asamanupassanto khemappatto abhayappatto vesārajjappatto viharāmī’’ti (a. ni. 4.8; ma. ni. 1.150)."
    ],
    "innerText": "‘‘Sammāsambuddhassa te paṭijānato ‘ime dhammā anabhisambuddhā’ti, tatra vata maṃ samaṇo vā brāhmaṇo vā devo vā māro vā brahmā vā koci vā lokasmiṃ saha dhammena paṭicodessatīti nimittametaṃ, bhikkhave, na samanupassāmi, etamahaṃ, bhikkhave, nimittaṃ asamanupassanto khemappatto abhayappatto vesārajjappatto viharāmi. Khīṇāsavassa te paṭijānato ‘ime āsavā aparikkhīṇā’ti, ‘ye kho pana te antarāyikā dhammā vuttā, te paṭisevato nālaṃ antarāyāyā’ti, ‘yassa kho pana te atthāya dhammo desito, so na niyyāti takkarassa sammā dukkhakkhayāyā’ti, tatra vata maṃ samaṇo vā brāhmaṇo vā devo vā māro vā brahmā vā koci vā lokasmiṃ saha dhammena paṭicodessatīti nimittametaṃ, bhikkhave, na samanupassāmi, etamahaṃ, bhikkhave, nimittaṃ asamanupassanto khemappatto abhayappatto vesārajjappatto viharāmī’’ti (a. ni. 4.8; ma. ni. 1.150)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dasabalabaladhārī"
      },
      "ti dasa balāni etesanti dasabalā, dasabalānaṃ balāni dasabalabalāni, tāni dasabalabalāni dhārayatīti dasabalabaladhārī, dasabalañāṇabaladhārīti attho. Etehi tīhi vacanehi anantappabhedānaṃ neyyānaṃ pabhedamukhamattaṃ dassitaṃ. Soyeva paññāpayogavasena abhimaṅgalasammataṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "purisāsabho"
      },
      ". Asantāsaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "purisasīho"
      },
      ". Mahantaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "purisanāgo"
      },
      ". Pajānanaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "purisājañño"
      },
      ". Lokakiccadhuravahanaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "purisadhorayho"
      },
      "."
    ],
    "innerText": "Dasabalabaladhārīti dasa balāni etesanti dasabalā, dasabalānaṃ balāni dasabalabalāni, tāni dasabalabalāni dhārayatīti dasabalabaladhārī, dasabalañāṇabaladhārīti attho. Etehi tīhi vacanehi anantappabhedānaṃ neyyānaṃ pabhedamukhamattaṃ dassitaṃ. Soyeva paññāpayogavasena abhimaṅgalasammataṭṭhena purisāsabho. Asantāsaṭṭhena purisasīho. Mahantaṭṭhena purisanāgo. Pajānanaṭṭhena purisājañño. Lokakiccadhuravahanaṭṭhena purisadhorayho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha tejādikaṃ anantañāṇato laddhaṃ guṇavisesaṃ dassetukāmo tesaṃ tejādīnaṃ anantañāṇamūlakabhāvaṃ dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anantañāṇo"
      },
      "ti vatvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anantatejo"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anantañāṇo"
      },
      "ti gaṇanavasena ca pabhāvavasena ca antavirahitañāṇo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anantatejo"
      },
      "ti veneyyasantāne mohatamavidhamanena anantañāṇatejo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anantayaso"
      },
      "ti paññāguṇeheva lokattayavitthatānantakittighoso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aḍḍho"
      },
      "ti paññādhanasamiddhiyā samiddho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahaddhano"
      },
      "ti paññādhanavaḍḍhattepi pabhāvamahattena mahantaṃ paññādhanamassāti mahaddhano ",
      ". Mahādhanotipi pāṭho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhanavā"
      },
      "ti ",
      " pasaṃsitabbapaññādhanavattā niccayuttapaññādhanavattā atisayabhūtapaññādhanavattā dhanavā. Etesupi hi tīsu atthesu idaṃ vacanaṃ saddavidū icchanti."
    ],
    "innerText": "Atha tejādikaṃ anantañāṇato laddhaṃ guṇavisesaṃ dassetukāmo tesaṃ tejādīnaṃ anantañāṇamūlakabhāvaṃ dassento anantañāṇoti vatvā anantatejotiādimāha. Tattha anantañāṇoti gaṇanavasena ca pabhāvavasena ca antavirahitañāṇo. Anantatejoti veneyyasantāne mohatamavidhamanena anantañāṇatejo. Anantayasoti paññāguṇeheva lokattayavitthatānantakittighoso. Aḍḍhoti paññādhanasamiddhiyā samiddho. Mahaddhanoti paññādhanavaḍḍhattepi pabhāvamahattena mahantaṃ paññādhanamassāti mahaddhano . Mahādhanotipi pāṭho. Dhanavāti pasaṃsitabbapaññādhanavattā niccayuttapaññādhanavattā atisayabhūtapaññādhanavattā dhanavā. Etesupi hi tīsu atthesu idaṃ vacanaṃ saddavidū icchanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ ",
      " paññāguṇena bhagavato attasampattisiddhiṃ dassetvā puna paññāguṇeneva lokahitasampattisiddhiṃ dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "netā"
      },
      "tiādimāha. Tattha veneyye saṃsārasaṅkhātabhayaṭṭhānato nibbānasaṅkhātakhemaṭṭhānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "netā"
      },
      ". Tattha nayanakāle eva saṃvaravinayapahānavinayavasena veneyye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vinetā"
      },
      ". Dhammadesanākāle eva saṃsayacchedanena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anunetā"
      },
      ". Saṃsayaṃ chinditvā paññāpetabbaṃ atthaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paññāpetā"
      },
      ". Tathā paññāpitānaṃ nicchayakaraṇena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nijjhāpetā"
      },
      ". Tathā nijjhāyitassa atthassa paṭipattipayojanavasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pekkhetā"
      },
      ". Tathāpaṭipanne paṭipattiphalena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pasādetā. So hi bhagavā"
      },
      "ti ettha hi-kāro anantaraṃ vuttassa atthassa kāraṇopadese nipāto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anuppannassa maggassa uppādetā"
      },
      "ti sakasantāne na uppannapubbassa chaasādhāraṇañāṇahetubhūtassa ariyamaggassa bodhimūle lokahitatthaṃ sakasantāne uppādetā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asañjātassa maggassa sañjanetā"
      },
      "ti veneyyasantāne asañjātapubbassa sāvakapāramiñāṇahetubhūtassa ariyamaggassa dhammacakkappavattanato pabhuti yāvajjakālā veneyyasantāne sañjanetā. Sāvakaveneyyānampi hi santāne bhagavato vuttavacaneneva ariyamaggassa sañjananato bhagavā sañjanetā nāma hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anakkhātassa maggassa akkhātā"
      },
      "ti aṭṭhadhammasamannāgatānaṃ buddhabhāvāya katābhinīhārānaṃ bodhisattānaṃ buddhabhāvāya byākaraṇaṃ datvā anakkhātapubbassa pāramitāmaggassa, ‘‘buddho bhavissatī’’ti byākaraṇamatteneva vā bodhimūle uppajjitabbassa ariyamaggassa akkhātā. Ayaṃ nayo paccekabodhisattabyākaraṇepi labbhatiyeva."
    ],
    "innerText": "Evaṃ paññāguṇena bhagavato attasampattisiddhiṃ dassetvā puna paññāguṇeneva lokahitasampattisiddhiṃ dassento netātiādimāha. Tattha veneyye saṃsārasaṅkhātabhayaṭṭhānato nibbānasaṅkhātakhemaṭṭhānaṃ netā. Tattha nayanakāle eva saṃvaravinayapahānavinayavasena veneyye vinetā. Dhammadesanākāle eva saṃsayacchedanena anunetā. Saṃsayaṃ chinditvā paññāpetabbaṃ atthaṃ paññāpetā. Tathā paññāpitānaṃ nicchayakaraṇena nijjhāpetā. Tathā nijjhāyitassa atthassa paṭipattipayojanavasena pekkhetā. Tathāpaṭipanne paṭipattiphalena pasādetā. So hi bhagavāti ettha hi-kāro anantaraṃ vuttassa atthassa kāraṇopadese nipāto. Anuppannassa maggassa uppādetāti sakasantāne na uppannapubbassa chaasādhāraṇañāṇahetubhūtassa ariyamaggassa bodhimūle lokahitatthaṃ sakasantāne uppādetā. Asañjātassa maggassa sañjanetāti veneyyasantāne asañjātapubbassa sāvakapāramiñāṇahetubhūtassa ariyamaggassa dhammacakkappavattanato pabhuti yāvajjakālā veneyyasantāne sañjanetā. Sāvakaveneyyānampi hi santāne bhagavato vuttavacaneneva ariyamaggassa sañjananato bhagavā sañjanetā nāma hoti. Anakkhātassa maggassa akkhātāti aṭṭhadhammasamannāgatānaṃ buddhabhāvāya katābhinīhārānaṃ bodhisattānaṃ buddhabhāvāya byākaraṇaṃ datvā anakkhātapubbassa pāramitāmaggassa, ‘‘buddho bhavissatī’’ti byākaraṇamatteneva vā bodhimūle uppajjitabbassa ariyamaggassa akkhātā. Ayaṃ nayo paccekabodhisattabyākaraṇepi labbhatiyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Maggaññū"
      },
      "ti paccavekkhaṇāvasena attanā uppāditaariyamaggassa ñātā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Maggavidū"
      },
      "ti veneyyasantāne janetabbassa ariyamaggassa kusalo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Maggakovido"
      },
      "ti bodhisattānaṃ akkhātabbamagge vicakkhaṇo. Atha vā abhisambodhipaṭipattimaggaññū, paccekabodhipaṭipattimaggavidū, sāvakabodhipaṭipattimaggakovido. Atha vā ‘‘etena maggena ataṃsu pubbe, tarissantiyeva taranti ogha’’nti (saṃ. ni. 5.409) vacanato yathāyogaṃ atītānāgatapaccuppannabuddhapaccekabuddhasāvakānaṃ maggavasena ca suññatānimittaappaṇihitamaggavasena ",
      " ca ugghaṭitaññūvipañcitaññūneyyapuggalānaṃ maggavasena ca yathākkamenatthayojanaṃ karonti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Maggānugāmī ca panā"
      },
      "ti bhagavatā gatamaggānugāmino hutvā ",
      ". Ettha ca-saddo hetuatthe nipāto. Etena ca bhagavato magguppādanādiguṇādhigamāya hetu vutto hoti. Pana-saddo katatthe nipāto. Tena bhagavatā katamaggakaraṇaṃ vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pacchā samannāgatā"
      },
      "ti paṭhamaṃ gatassa bhagavato pacchāgatasīlādiguṇena samannāgatā. Iti thero ‘‘anuppannassa maggassa uppādetā’’tiādīhi ",
      " yasmā sabbepi bhagavato sīlādayo guṇā arahattamaggameva nissāya āgatā, tasmā arahattamaggameva nissāya guṇaṃ kathesi."
    ],
    "innerText": "Maggaññūti paccavekkhaṇāvasena attanā uppāditaariyamaggassa ñātā. Maggavidūti veneyyasantāne janetabbassa ariyamaggassa kusalo. Maggakovidoti bodhisattānaṃ akkhātabbamagge vicakkhaṇo. Atha vā abhisambodhipaṭipattimaggaññū, paccekabodhipaṭipattimaggavidū, sāvakabodhipaṭipattimaggakovido. Atha vā ‘‘etena maggena ataṃsu pubbe, tarissantiyeva taranti ogha’’nti (saṃ. ni. 5.409) vacanato yathāyogaṃ atītānāgatapaccuppannabuddhapaccekabuddhasāvakānaṃ maggavasena ca suññatānimittaappaṇihitamaggavasena ca ugghaṭitaññūvipañcitaññūneyyapuggalānaṃ maggavasena ca yathākkamenatthayojanaṃ karonti. Maggānugāmī ca panāti bhagavatā gatamaggānugāmino hutvā . Ettha ca-saddo hetuatthe nipāto. Etena ca bhagavato magguppādanādiguṇādhigamāya hetu vutto hoti. Pana-saddo katatthe nipāto. Tena bhagavatā katamaggakaraṇaṃ vuttaṃ hoti. Pacchā samannāgatāti paṭhamaṃ gatassa bhagavato pacchāgatasīlādiguṇena samannāgatā. Iti thero ‘‘anuppannassa maggassa uppādetā’’tiādīhi yasmā sabbepi bhagavato sīlādayo guṇā arahattamaggameva nissāya āgatā, tasmā arahattamaggameva nissāya guṇaṃ kathesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jānaṃ jānātī"
      },
      "ti jānitabbaṃ jānāti, sabbaññutāya yaṃkiñci paññāya jānitabbaṃ nāma atthi, taṃ sabbaṃ pañcaneyyapathabhūtaṃ paññāya jānātīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Passaṃ passatī"
      },
      "ti passitabbaṃ passati, sabbadassāvitāya taṃyeva neyyapathaṃ cakkhunā diṭṭhaṃ viya karonto paññācakkhunā passatīti attho. Yathā vā ekacco viparītaṃ gaṇhanto jānantopi na jānāti, passantopi na passati, na evaṃ bhagavā. Bhagavā pana yathāsabhāvaṃ gaṇhanto jānanto jānātiyeva, passanto passatiyeva. Svāyaṃ dassanapariṇāyakaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cakkhubhūto"
      },
      ". Viditatādiatthena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ñāṇabhūto"
      },
      ". Aviparītasabhāvaṭṭhena vā pariyattidhammapavattanato hadayena cintetvā vācāya nicchāritadhammamayoti vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammabhūto"
      },
      ". Seṭṭhaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "brahmabhūto"
      },
      ". Atha vā cakkhu viya bhūtoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cakkhubhūto"
      },
      ". Ñāṇaṃ viya bhūtoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ñāṇabhūto"
      },
      ". Dhammo viya bhūtoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammabhūto"
      },
      ". Brahmā viya bhūtoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "brahmabhūto"
      },
      ". Svāyaṃ dhammassa vacanato, vattanato vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vattā"
      },
      ". Nānappakārehi vacanato, vattanato vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pavattā"
      },
      ". Atthaṃ nīharitvā nīharitvā nayanato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atthassa ninnetā"
      },
      ". Amatādhigamāya paṭipattidesanato, amatappakāsanāya vā dhammadesanāya amatassa adhigamāpanato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "amatassa dātā"
      },
      ". Lokuttaradhammassa uppāditattā veneyyānurūpena yathāsukhaṃ lokuttaradhammassa dānena ca, dhammesu ca issaroti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammassāmī. Tathāgata"
      },
      "padaṃ heṭṭhā vuttatthaṃ."
    ],
    "innerText": "Jānaṃ jānātīti jānitabbaṃ jānāti, sabbaññutāya yaṃkiñci paññāya jānitabbaṃ nāma atthi, taṃ sabbaṃ pañcaneyyapathabhūtaṃ paññāya jānātīti attho. Passaṃ passatīti passitabbaṃ passati, sabbadassāvitāya taṃyeva neyyapathaṃ cakkhunā diṭṭhaṃ viya karonto paññācakkhunā passatīti attho. Yathā vā ekacco viparītaṃ gaṇhanto jānantopi na jānāti, passantopi na passati, na evaṃ bhagavā. Bhagavā pana yathāsabhāvaṃ gaṇhanto jānanto jānātiyeva, passanto passatiyeva. Svāyaṃ dassanapariṇāyakaṭṭhena cakkhubhūto. Viditatādiatthena ñāṇabhūto. Aviparītasabhāvaṭṭhena vā pariyattidhammapavattanato hadayena cintetvā vācāya nicchāritadhammamayoti vā dhammabhūto. Seṭṭhaṭṭhena brahmabhūto. Atha vā cakkhu viya bhūtoti cakkhubhūto. Ñāṇaṃ viya bhūtoti ñāṇabhūto. Dhammo viya bhūtoti dhammabhūto. Brahmā viya bhūtoti brahmabhūto. Svāyaṃ dhammassa vacanato, vattanato vā vattā. Nānappakārehi vacanato, vattanato vā pavattā. Atthaṃ nīharitvā nīharitvā nayanato atthassa ninnetā. Amatādhigamāya paṭipattidesanato, amatappakāsanāya vā dhammadesanāya amatassa adhigamāpanato amatassa dātā. Lokuttaradhammassa uppāditattā veneyyānurūpena yathāsukhaṃ lokuttaradhammassa dānena ca, dhammesu ca issaroti dhammassāmī. Tathāgatapadaṃ heṭṭhā vuttatthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni ‘‘jānaṃ jānātī’’tiādīhi vuttaṃ guṇaṃ sabbaññutāya visesetvā dassetukāmo sabbaññutaṃ sādhento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "natthī"
      },
      "tiādimāha. Evaṃbhūtassa hi tassa bhagavato pāramitāpuññabalappabhāvanipphannena arahattamaggañāṇena sabbadhammesu savāsanassa sammohassa vihatattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asacchikataṃ"
      },
      " nāma natthi. Asammohato sabbadhammānaṃ ñātattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aññātaṃ"
      },
      " nāma natthi. Tatheva ",
      " ca sabbadhammānaṃ cakkhunā viya ñāṇacakkhunā diṭṭhattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "adiṭṭhaṃ"
      },
      " nāma natthi. Ñāṇena pana pattattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aviditaṃ"
      },
      " nāma natthi. Asammohasacchikiriyāya sacchikatattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asacchikataṃ"
      },
      " nāma natthi. Asammohapaññāya phuṭṭhattā paññāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aphassitaṃ"
      },
      " nāma natthi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paccuppanna"
      },
      "nti paccuppannaṃ kālaṃ vā dhammaṃ vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upādāyā"
      },
      "ti ādāya, antokatvāti attho. ‘‘Upādāyā’’ti vacaneneva kālavinimuttaṃ nibbānampi gahitameva hoti. ‘‘Atītā’’divacanāni ca ‘‘natthī’’tiādivacaneneva ghaṭīyanti, ‘‘sabbe’’tiādivacanena vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbe dhammā"
      },
      "ti sabbasaṅkhatāsaṅkhatadhammapariyādānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbākārenā"
      },
      "ti sabbadhammesu ekekasseva dhammassa aniccākārādisabbākārapariyādānaṃ ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñāṇamukhe"
      },
      "ti ñāṇābhimukhe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āpāthaṃ āgacchantī"
      },
      "ti osaraṇaṃ upenti. ‘‘Jānitabba’’ntipadaṃ ‘‘neyya’’ntipadassa atthavivaraṇatthaṃ vuttaṃ."
    ],
    "innerText": "Idāni ‘‘jānaṃ jānātī’’tiādīhi vuttaṃ guṇaṃ sabbaññutāya visesetvā dassetukāmo sabbaññutaṃ sādhento natthītiādimāha. Evaṃbhūtassa hi tassa bhagavato pāramitāpuññabalappabhāvanipphannena arahattamaggañāṇena sabbadhammesu savāsanassa sammohassa vihatattā asacchikataṃ nāma natthi. Asammohato sabbadhammānaṃ ñātattā aññātaṃ nāma natthi. Tatheva ca sabbadhammānaṃ cakkhunā viya ñāṇacakkhunā diṭṭhattā adiṭṭhaṃ nāma natthi. Ñāṇena pana pattattā aviditaṃ nāma natthi. Asammohasacchikiriyāya sacchikatattā asacchikataṃ nāma natthi. Asammohapaññāya phuṭṭhattā paññāya aphassitaṃ nāma natthi. Paccuppannanti paccuppannaṃ kālaṃ vā dhammaṃ vā. Upādāyāti ādāya, antokatvāti attho. ‘‘Upādāyā’’ti vacaneneva kālavinimuttaṃ nibbānampi gahitameva hoti. ‘‘Atītā’’divacanāni ca ‘‘natthī’’tiādivacaneneva ghaṭīyanti, ‘‘sabbe’’tiādivacanena vā. Sabbe dhammāti sabbasaṅkhatāsaṅkhatadhammapariyādānaṃ. Sabbākārenāti sabbadhammesu ekekasseva dhammassa aniccākārādisabbākārapariyādānaṃ . Ñāṇamukheti ñāṇābhimukhe. Āpāthaṃ āgacchantīti osaraṇaṃ upenti. ‘‘Jānitabba’’ntipadaṃ ‘‘neyya’’ntipadassa atthavivaraṇatthaṃ vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attattho vā"
      },
      "tiādīsu vā-saddo samuccayattho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attattho"
      },
      "ti attano attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parattho"
      },
      "ti paresaṃ tiṇṇaṃ lokānaṃ attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ubhayattho"
      },
      "ti attano ca paresañcāti sakiṃyeva ubhinnaṃ attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Diṭṭhadhammiko"
      },
      "ti diṭṭhadhamme niyutto, diṭṭhadhammappayojano vā attho. Samparāye niyutto, samparāyappayojano vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samparāyiko. Uttāno"
      },
      "tiādīsu vohāravasena vattabbo sukhapatiṭṭhattā uttāno. Vohāraṃ atikkamitvā vattabbo suññatāpaṭisaṃyutto dukkhapatiṭṭhattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gambhīro"
      },
      ". Lokuttaro accantatirokkhattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gūḷho"
      },
      ". Aniccatādiko ghanādīhi paṭicchannattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭicchanno"
      },
      ". Appacuravohārena vattabbo yathārutaṃ aggahetvā adhippāyassa netabbattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "neyyo"
      },
      ". Pacuravohārena vattabbo vacanamattena adhippāyassa nītattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nīto"
      },
      ". Suparisuddhasīlasamādhivipassanattho tadaṅgavikkhambhanavasena vajjavirahitattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anavajjo"
      },
      ". Kilesasamucchedanato ariyamaggattho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nikkileso"
      },
      ". Kilesapaṭippassaddhattā ariyaphalattho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vodāno"
      },
      ". Saṅkhatāsaṅkhatesu aggadhammattā nibbānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paramattho. Parivattatī"
      },
      "ti buddhañāṇassa visayabhāvato abahibhūtattā antobuddhañāṇe byāpitvā vā samantā vā āliṅgitvā vā visesena vā vattati."
    ],
    "innerText": "Attattho vātiādīsu vā-saddo samuccayattho. Attatthoti attano attho. Paratthoti paresaṃ tiṇṇaṃ lokānaṃ attho. Ubhayatthoti attano ca paresañcāti sakiṃyeva ubhinnaṃ attho. Diṭṭhadhammikoti diṭṭhadhamme niyutto, diṭṭhadhammappayojano vā attho. Samparāye niyutto, samparāyappayojano vā samparāyiko. Uttānotiādīsu vohāravasena vattabbo sukhapatiṭṭhattā uttāno. Vohāraṃ atikkamitvā vattabbo suññatāpaṭisaṃyutto dukkhapatiṭṭhattā gambhīro. Lokuttaro accantatirokkhattā gūḷho. Aniccatādiko ghanādīhi paṭicchannattā paṭicchanno. Appacuravohārena vattabbo yathārutaṃ aggahetvā adhippāyassa netabbattā neyyo. Pacuravohārena vattabbo vacanamattena adhippāyassa nītattā nīto. Suparisuddhasīlasamādhivipassanattho tadaṅgavikkhambhanavasena vajjavirahitattā anavajjo. Kilesasamucchedanato ariyamaggattho nikkileso. Kilesapaṭippassaddhattā ariyaphalattho vodāno. Saṅkhatāsaṅkhatesu aggadhammattā nibbānaṃ paramattho. Parivattatīti buddhañāṇassa visayabhāvato abahibhūtattā antobuddhañāṇe byāpitvā vā samantā vā āliṅgitvā vā visesena vā vattati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbaṃ kāyakamma"
      },
      "ntiādīhi bhagavato ñāṇamayataṃ dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñāṇānuparivattatī"
      },
      "ti ñāṇaṃ anuparivattati, ñāṇavirahitaṃ na hotīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appaṭihata"
      },
      "nti nirāvaraṇataṃ dasseti. Puna sabbaññutaṃ upamāya sādhetukāmo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yāvataka"
      },
      "ntiādimāha. Tattha jānitabbanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "neyyaṃ,"
      },
      " neyyapariyanto neyyāvasānamassa atthīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "neyyapariyantikaṃ"
      },
      ". Asabbaññūnaṃ pana neyyāvasānameva natthi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñāṇapariyantike"
      },
      "pi eseva nayo. Purimayamake vuttatthameva iminā yamakena visesetvā dasseti, tatiyayamakena paṭisedhavasena niyamitvā dasseti ",
      ". Ettha ca neyyaṃ ñāṇassa pathattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "neyyapatho. Aññamaññapariyantaṭṭhāyino"
      },
      "ti neyyañca ñāṇañca khepetvā ṭhānato aññamaññassa pariyante ṭhānasīlā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āvajjanappaṭibaddhā"
      },
      "ti manodvārāvajjanāyattā, āvajjitānantarameva jānātīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ākaṅkhappaṭibaddhā"
      },
      "ti ruciāyattā, āvajjanānantaraṃ javanañāṇena jānātīti attho. Itarāni dve padāni imesaṃ dvinnaṃ padānaṃ yathākkamena atthappakāsanatthaṃ vuttāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Buddho āsayaṃ jānātī"
      },
      "tiādīni ñāṇakathāyaṃ vaṇṇitāni. Mahāniddese pana ‘‘bhagavā āsayaṃ jānātī’’ti (mahāni. 69) āgataṃ. Tattha ‘‘buddhassa bhagavato’’ti (mahāni. 69) āgataṭṭhāne ca idha katthaci ‘‘buddhassā’’ti āgataṃ."
    ],
    "innerText": "Sabbaṃ kāyakammantiādīhi bhagavato ñāṇamayataṃ dasseti. Ñāṇānuparivattatīti ñāṇaṃ anuparivattati, ñāṇavirahitaṃ na hotīti attho. Appaṭihatanti nirāvaraṇataṃ dasseti. Puna sabbaññutaṃ upamāya sādhetukāmo yāvatakantiādimāha. Tattha jānitabbanti neyyaṃ, neyyapariyanto neyyāvasānamassa atthīti neyyapariyantikaṃ. Asabbaññūnaṃ pana neyyāvasānameva natthi. Ñāṇapariyantikepi eseva nayo. Purimayamake vuttatthameva iminā yamakena visesetvā dasseti, tatiyayamakena paṭisedhavasena niyamitvā dasseti . Ettha ca neyyaṃ ñāṇassa pathattā neyyapatho. Aññamaññapariyantaṭṭhāyinoti neyyañca ñāṇañca khepetvā ṭhānato aññamaññassa pariyante ṭhānasīlā. Āvajjanappaṭibaddhāti manodvārāvajjanāyattā, āvajjitānantarameva jānātīti attho. Ākaṅkhappaṭibaddhāti ruciāyattā, āvajjanānantaraṃ javanañāṇena jānātīti attho. Itarāni dve padāni imesaṃ dvinnaṃ padānaṃ yathākkamena atthappakāsanatthaṃ vuttāni. Buddho āsayaṃ jānātītiādīni ñāṇakathāyaṃ vaṇṇitāni. Mahāniddese pana ‘‘bhagavā āsayaṃ jānātī’’ti (mahāni. 69) āgataṃ. Tattha ‘‘buddhassa bhagavato’’ti (mahāni. 69) āgataṭṭhāne ca idha katthaci ‘‘buddhassā’’ti āgataṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Antamaso"
      },
      "ti ",
      " uparimantena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Timitimiṅgala"
      },
      "nti ettha timi nāma ekā macchajāti, timiṃ gilituṃ samatthā tato mahantasarīrā timiṅgalā nāma ekā macchajāti, timiṅgalampi gilituṃ samatthā pañcayojanasatikasarīrā timitimiṅgalā nāma ekā macchajāti. Idha jātiggahaṇena ekavacanaṃ katanti veditabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Garuḷaṃ venateyya"
      },
      "nti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "garuḷo"
      },
      "ti jātivasena nāmaṃ, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "venateyyo"
      },
      "ti gottavasena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Padese"
      },
      "ti ekadese. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sāriputtasamā"
      },
      "ti sabbabuddhānaṃ dhammasenāpatitthere gahetvā vuttanti veditabbaṃ. Sesasāvakā hi paññāya dhammasenāpatittherena samā nāma natthi. Yathāha – ‘‘etadaggaṃ, bhikkhave, mama sāvakānaṃ bhikkhūnaṃ mahāpaññānaṃ yadidaṃ sāriputto’’ti (a. ni. 1.188-189). Aṭṭhakathāyañca vuttaṃ –"
    ],
    "innerText": "Antamasoti uparimantena. Timitimiṅgalanti ettha timi nāma ekā macchajāti, timiṃ gilituṃ samatthā tato mahantasarīrā timiṅgalā nāma ekā macchajāti, timiṅgalampi gilituṃ samatthā pañcayojanasatikasarīrā timitimiṅgalā nāma ekā macchajāti. Idha jātiggahaṇena ekavacanaṃ katanti veditabbaṃ. Garuḷaṃ venateyyanti ettha garuḷoti jātivasena nāmaṃ, venateyyoti gottavasena. Padeseti ekadese. Sāriputtasamāti sabbabuddhānaṃ dhammasenāpatitthere gahetvā vuttanti veditabbaṃ. Sesasāvakā hi paññāya dhammasenāpatittherena samā nāma natthi. Yathāha – ‘‘etadaggaṃ, bhikkhave, mama sāvakānaṃ bhikkhūnaṃ mahāpaññānaṃ yadidaṃ sāriputto’’ti (a. ni. 1.188-189). Aṭṭhakathāyañca vuttaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Lokanāthaṃ ṭhapetvāna, ye caññe santi pāṇino;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Paññāya sāriputtassa, kalaṃ nāgghanti soḷasi’’nti. (visuddhi. 1.171);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pharitvā"
      },
      "ti buddhañāṇaṃ sabbadevamanussānampi paññaṃ pāpuṇitvā ṭhānato tesaṃ paññaṃ pharitvā byāpitvā tiṭṭhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atighaṃsitvā"
      },
      "ti buddhañāṇaṃ sabbadevamanussānampi paññaṃ atikkamitvā tesaṃ avisayabhūtampi sabbaṃ neyyaṃ ghaṃsitvā ",
      " bhañjitvā tiṭṭhati. Mahāniddese pana (mahāni. 69) ‘‘abhibhavitvā’’ti pāṭho, madditvātipi attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yepi te"
      },
      "tiādīhi evaṃ pharitvā atighaṃsitvā ṭhānassa paccakkhakāraṇaṃ dasseti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṇḍitā"
      },
      "ti paṇḍiccena samannāgatā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nipuṇā"
      },
      "ti saṇhasukhumabuddhino sukhume atthantare paṭivijjhanasamatthā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kataparappavādā"
      },
      "ti ñātaparappavādā ceva parehi saddhiṃ katavādaparicayā ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vālavedhirūpā"
      },
      "ti vālavedhidhanuggahasadisā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vobhindantā maññe caranti paññāgatena diṭṭhigatānī"
      },
      "ti ",
      " vālavedhī viya vālaṃ sukhumānipi paresaṃ diṭṭhigamanāni attano paññāgamanena bhindantā viya carantīti attho. Atha vā ‘‘gūthagataṃ muttagata’’ntiādīsu (a. ni. 9.11) viya paññā eva paññāgatāni, diṭṭhiyo eva diṭṭhigatāni."
    ],
    "innerText": "Pharitvāti buddhañāṇaṃ sabbadevamanussānampi paññaṃ pāpuṇitvā ṭhānato tesaṃ paññaṃ pharitvā byāpitvā tiṭṭhati. Atighaṃsitvāti buddhañāṇaṃ sabbadevamanussānampi paññaṃ atikkamitvā tesaṃ avisayabhūtampi sabbaṃ neyyaṃ ghaṃsitvā bhañjitvā tiṭṭhati. Mahāniddese pana (mahāni. 69) ‘‘abhibhavitvā’’ti pāṭho, madditvātipi attho. Yepi tetiādīhi evaṃ pharitvā atighaṃsitvā ṭhānassa paccakkhakāraṇaṃ dasseti. Tattha paṇḍitāti paṇḍiccena samannāgatā. Nipuṇāti saṇhasukhumabuddhino sukhume atthantare paṭivijjhanasamatthā. Kataparappavādāti ñātaparappavādā ceva parehi saddhiṃ katavādaparicayā ca. Vālavedhirūpāti vālavedhidhanuggahasadisā. Vobhindantā maññe caranti paññāgatena diṭṭhigatānīti vālavedhī viya vālaṃ sukhumānipi paresaṃ diṭṭhigamanāni attano paññāgamanena bhindantā viya carantīti attho. Atha vā ‘‘gūthagataṃ muttagata’’ntiādīsu (a. ni. 9.11) viya paññā eva paññāgatāni, diṭṭhiyo eva diṭṭhigatāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañhaṃ abhisaṅkharitvā"
      },
      "ti dvipadampi tipadampi catuppadampi pucchaṃ racayitvā. Tesaṃ pañhānaṃ atibahukattā sabbasaṅgahatthaṃ dvikkhattuṃ vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gūḷhāni ca paṭicchannāni"
      },
      " atthajātānīti pāṭhaseso. Tesaṃ tathā vinayaṃ disvā ‘‘attanā abhisaṅkhatapañhaṃ pucchatū’’ti evaṃ bhagavatā adhippetattā pañhaṃ pucchanti. Aññesaṃ pana pucchāya okāsameva adatvā bhagavā upasaṅkamantānaṃ dhammaṃ deseti. Yathāha –"
    ],
    "innerText": "Pañhaṃ abhisaṅkharitvāti dvipadampi tipadampi catuppadampi pucchaṃ racayitvā. Tesaṃ pañhānaṃ atibahukattā sabbasaṅgahatthaṃ dvikkhattuṃ vuttaṃ. Gūḷhāni ca paṭicchannāni atthajātānīti pāṭhaseso. Tesaṃ tathā vinayaṃ disvā ‘‘attanā abhisaṅkhatapañhaṃ pucchatū’’ti evaṃ bhagavatā adhippetattā pañhaṃ pucchanti. Aññesaṃ pana pucchāya okāsameva adatvā bhagavā upasaṅkamantānaṃ dhammaṃ deseti. Yathāha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Te ",
      " pañhaṃ abhisaṅkharonti ‘imaṃ mayaṃ pañhaṃ samaṇaṃ gotamaṃ upasaṅkamitvā pucchissāma, sace no samaṇo gotamo evaṃ puṭṭho evaṃ byākarissati, evamassa mayaṃ vādaṃ āropessāma. Evaṃ cepi no puṭṭho evaṃ byākarissati, evaṃpissa mayaṃ vādaṃ āropessāmā’ti. Te yena samaṇo gotamo, tenupasaṅkamanti, te samaṇo gotamo dhammiyā kathāya sandasseti samādapeti samuttejeti sampahaṃseti. Te samaṇena gotamena dhammiyā kathāya sandassitā samādapitā samuttejitā sampahaṃsitā na ceva samaṇaṃ gotamaṃ pañhaṃ pucchanti, kutossa vādaṃ āropessanti? Aññadatthu samaṇasseva gotamassa sāvakā sampajjantī’’ti (ma. ni. 1.289)."
    ],
    "innerText": "‘‘Te pañhaṃ abhisaṅkharonti ‘imaṃ mayaṃ pañhaṃ samaṇaṃ gotamaṃ upasaṅkamitvā pucchissāma, sace no samaṇo gotamo evaṃ puṭṭho evaṃ byākarissati, evamassa mayaṃ vādaṃ āropessāma. Evaṃ cepi no puṭṭho evaṃ byākarissati, evaṃpissa mayaṃ vādaṃ āropessāmā’ti. Te yena samaṇo gotamo, tenupasaṅkamanti, te samaṇo gotamo dhammiyā kathāya sandasseti samādapeti samuttejeti sampahaṃseti. Te samaṇena gotamena dhammiyā kathāya sandassitā samādapitā samuttejitā sampahaṃsitā na ceva samaṇaṃ gotamaṃ pañhaṃ pucchanti, kutossa vādaṃ āropessanti? Aññadatthu samaṇasseva gotamassa sāvakā sampajjantī’’ti (ma. ni. 1.289)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kasmā pañhaṃ na pucchantīti ce? Bhagavā kira parisamajjhe dhammaṃ desento parisāya ajjhāsayaṃ oloketi. Tato passati ‘‘ime paṇḍitā gūḷhaṃ rahassaṃ pañhaṃ ovaṭṭikasāraṃ katvā āgatā’’ti. So tehi apuṭṭhoyeva ",
      " ‘‘pañhapucchāya ettakā dosā, vissajjane ettakā, atthe pade akkhare ettakāti ime pañhe pucchanto evaṃ puccheyya, vissajjento evaṃ vissajjeyyā’’ti iti ovaṭṭikasāraṃ katvā ānīte pañhe dhammakathāya antare pakkhipitvā vidaṃseti. Te paṇḍitā ‘‘seyyā vata no, ye mayaṃ ime pañhe na pucchimha. Sacepi mayaṃ puccheyyāma, appatiṭṭhite no katvā samaṇo gotamo khipeyyā’’ti attamanā bhavanti. Apica buddhā nāma dhammaṃ desentā parisaṃ mettāya pharanti. Mettāya ca pharaṇena dasabalesu mahājanassa cittaṃ pasīdati. Buddhā nāma rūpaggappattā honti dassanasampannā madhurassarā mudujivhā suphusitadantāvaraṇā amatena hadayaṃ siñcantā viya dhammaṃ kathenti. Tatra nesaṃ mettāpharaṇena pasannacittānaṃ evaṃ hoti – evarūpaṃ advejjhakathaṃ amoghakathaṃ niyyānikakathaṃ kathentena bhagavatā saddhiṃ na sakkhissāma ",
      " paccanīkaggāhaṃ gaṇhitunti attano pasannabhāveneva pañhaṃ na pucchantīti."
    ],
    "innerText": "Kasmā pañhaṃ na pucchantīti ce? Bhagavā kira parisamajjhe dhammaṃ desento parisāya ajjhāsayaṃ oloketi. Tato passati ‘‘ime paṇḍitā gūḷhaṃ rahassaṃ pañhaṃ ovaṭṭikasāraṃ katvā āgatā’’ti. So tehi apuṭṭhoyeva ‘‘pañhapucchāya ettakā dosā, vissajjane ettakā, atthe pade akkhare ettakāti ime pañhe pucchanto evaṃ puccheyya, vissajjento evaṃ vissajjeyyā’’ti iti ovaṭṭikasāraṃ katvā ānīte pañhe dhammakathāya antare pakkhipitvā vidaṃseti. Te paṇḍitā ‘‘seyyā vata no, ye mayaṃ ime pañhe na pucchimha. Sacepi mayaṃ puccheyyāma, appatiṭṭhite no katvā samaṇo gotamo khipeyyā’’ti attamanā bhavanti. Apica buddhā nāma dhammaṃ desentā parisaṃ mettāya pharanti. Mettāya ca pharaṇena dasabalesu mahājanassa cittaṃ pasīdati. Buddhā nāma rūpaggappattā honti dassanasampannā madhurassarā mudujivhā suphusitadantāvaraṇā amatena hadayaṃ siñcantā viya dhammaṃ kathenti. Tatra nesaṃ mettāpharaṇena pasannacittānaṃ evaṃ hoti – evarūpaṃ advejjhakathaṃ amoghakathaṃ niyyānikakathaṃ kathentena bhagavatā saddhiṃ na sakkhissāma paccanīkaggāhaṃ gaṇhitunti attano pasannabhāveneva pañhaṃ na pucchantīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kathitā visajjitā cā"
      },
      "ti evaṃ tumhe pucchathāti pucchitapañhānaṃ uccāraṇena te pañhā bhagavatā kathitā eva honti. Yathā ca te visajjetabbā, tathā visajjitā eva honti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Niddiṭṭhakāraṇā"
      },
      "ti iminā kāraṇena iminā hetunā evaṃ hotīti evaṃ sahetukaṃ katvā visajjanena bhagavatā niddiṭṭhakāraṇā eva honti te pañhā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upakkhittakā ca te bhagavato sampajjantī"
      },
      "ti te khattiyapaṇḍitādayo bhagavato pañhavisajjaneneva bhagavato samīpe khittakā pādakhittakā sampajjanti, sāvakā vā sampajjanti upāsakā vāti attho, sāvakasampattiṃ vā pāpuṇanti upāsakasampattiṃ vāti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Athā"
      },
      "ti anantaratthe, tesaṃ upakkhittakasampattisamanantaramevāti attho ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatthā"
      },
      "ti tasmiṃ ṭhāne, tasmiṃ adhikāre vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atirocatī"
      },
      "ti ativiya joteti pakāsati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yadidaṃ paññāyā"
      },
      "ti yāyaṃ bhagavato paññā, tāya paññāya bhagavāva atirocatīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iti"
      },
      "saddo kāraṇatthe, iminā kāraṇena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aggo asāmantapañño"
      },
      "ti attho."
    ],
    "innerText": "Kathitā visajjitā cāti evaṃ tumhe pucchathāti pucchitapañhānaṃ uccāraṇena te pañhā bhagavatā kathitā eva honti. Yathā ca te visajjetabbā, tathā visajjitā eva honti. Niddiṭṭhakāraṇāti iminā kāraṇena iminā hetunā evaṃ hotīti evaṃ sahetukaṃ katvā visajjanena bhagavatā niddiṭṭhakāraṇā eva honti te pañhā. Upakkhittakā ca te bhagavato sampajjantīti te khattiyapaṇḍitādayo bhagavato pañhavisajjaneneva bhagavato samīpe khittakā pādakhittakā sampajjanti, sāvakā vā sampajjanti upāsakā vāti attho, sāvakasampattiṃ vā pāpuṇanti upāsakasampattiṃ vāti vuttaṃ hoti. Athāti anantaratthe, tesaṃ upakkhittakasampattisamanantaramevāti attho . Tatthāti tasmiṃ ṭhāne, tasmiṃ adhikāre vā. Atirocatīti ativiya joteti pakāsati. Yadidaṃ paññāyāti yāyaṃ bhagavato paññā, tāya paññāya bhagavāva atirocatīti attho. Itisaddo kāraṇatthe, iminā kāraṇena aggo asāmantapaññoti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "6"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rāgaṃ abhibhuyyatīti bhūripaññā"
      },
      "ti sā sā maggapaññā attanā vajjhaṃ rāgaṃ abhibhuyyati abhibhavati maddatīti bhūripaññā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhūrī"
      },
      "ti hi phuṭaṭṭho visadattho ",
      ". Yā ca phuṭā, sā paṭipakkhaṃ abhibhavati na aphuṭā, tasmā bhūripaññāya abhibhavanattho vutto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhibhavitā"
      },
      "ti sā sā phalapaññā taṃ taṃ rāgaṃ abhibhavitavatī madditavatīti bhūripaññā. Abhibhavatāti vā pāṭho. Sesesupi eseva nayo. Rāgādīsu pana rajjanalakkhaṇo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rāgo"
      },
      ". Dussanalakkhaṇo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "doso"
      },
      ". Muyhanalakkhaṇo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "moho"
      },
      ". Kujjhanalakkhaṇo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kodho"
      },
      ". Upanandhanalakkhaṇo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upanāho"
      },
      ". Pubbakālaṃ kodho, aparakālaṃ upanāho. Paraguṇamakkhanalakkhaṇo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "makkho"
      },
      ". Yugaggāhalakkhaṇo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paḷāso"
      },
      ". Parasampattikhīyanalakkhaṇā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "issā"
      },
      ". Attano sampattinigūhaṇalakkhaṇaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "macchariyaṃ"
      },
      ". Attanā katapāpapaṭicchādanalakkhaṇā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "māyā"
      },
      ". Attano avijjamānaguṇappakāsanalakkhaṇaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sāṭheyyaṃ"
      },
      ". Cittassa uddhumātabhāvalakkhaṇo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "thambho"
      },
      ". Karaṇuttariyalakkhaṇo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sārambho"
      },
      ". Unnatilakkhaṇo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "māno"
      },
      ". Abbhunnatilakkhaṇo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atimāno"
      },
      ". Mattabhāvalakkhaṇo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mado"
      },
      ". Pañcasu kāmaguṇesu cittavosaggalakkhaṇo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pamādo"
      },
      "."
    ],
    "innerText": "6.Rāgaṃ abhibhuyyatīti bhūripaññāti sā sā maggapaññā attanā vajjhaṃ rāgaṃ abhibhuyyati abhibhavati maddatīti bhūripaññā. Bhūrīti hi phuṭaṭṭho visadattho . Yā ca phuṭā, sā paṭipakkhaṃ abhibhavati na aphuṭā, tasmā bhūripaññāya abhibhavanattho vutto. Abhibhavitāti sā sā phalapaññā taṃ taṃ rāgaṃ abhibhavitavatī madditavatīti bhūripaññā. Abhibhavatāti vā pāṭho. Sesesupi eseva nayo. Rāgādīsu pana rajjanalakkhaṇo rāgo. Dussanalakkhaṇo doso. Muyhanalakkhaṇo moho. Kujjhanalakkhaṇo kodho. Upanandhanalakkhaṇo upanāho. Pubbakālaṃ kodho, aparakālaṃ upanāho. Paraguṇamakkhanalakkhaṇo makkho. Yugaggāhalakkhaṇo paḷāso. Parasampattikhīyanalakkhaṇā issā. Attano sampattinigūhaṇalakkhaṇaṃ macchariyaṃ. Attanā katapāpapaṭicchādanalakkhaṇā māyā. Attano avijjamānaguṇappakāsanalakkhaṇaṃ sāṭheyyaṃ. Cittassa uddhumātabhāvalakkhaṇo thambho. Karaṇuttariyalakkhaṇo sārambho. Unnatilakkhaṇo māno. Abbhunnatilakkhaṇo atimāno. Mattabhāvalakkhaṇo mado. Pañcasu kāmaguṇesu cittavosaggalakkhaṇo pamādo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rāgo ari, taṃ ariṃ maddanipaññā"
      },
      "tiādīhi kiṃ vuttaṃ hoti? Rāgādiko kileso cittasantāne bhūto arīti bhū-ari, padasandhivasena a-kāra lopaṃ katvā bhūrīti vutto. Tassa bhūrissa maddanī paññā bhūrimaddanipaññāti ",
      " vattabbe maddani sadda lopaṃ katvā ‘‘bhūripaññā’’ti vuttanti veditabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃ ariṃ maddanī"
      },
      "ti ca tesaṃ arīnaṃ maddanīti padacchedo kātabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pathavīsamāyā"
      },
      "ti vitthatavipulaṭṭheneva pathavīsamāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vitthatāyā"
      },
      "ti pajānitabbe visaye patthaṭāya, na ekadese vattamānāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vipulāyā"
      },
      "ti oḷārikabhūtāya. Mahāniddese pana ‘‘vipulāya vitthatāyā’’ti (mahāni. 27) āgataṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samannāgato"
      },
      "ti puggalo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iti"
      },
      "saddo kāraṇatthe, iminā kāraṇena puggalassa bhūripaññāya samannāgatattā tassa paññā bhūripaññā nāmāti bhūte atthe ramatīti attho. Bhūripaññassa paññā bhūripaññapaññāti vattabbe ekassa paññāsaddassa lopaṃ katvā ‘‘bhūripaññā’’ti vuttaṃ. Bhūrisamā paññāti vā bhūripaññā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Apicā"
      },
      "ti aññapariyāyadassanatthaṃ vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññāyameta"
      },
      "nti paññāya etaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adhivacana"
      },
      "nti adhikavacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhūrī"
      },
      "ti bhūte atthe ramatīti bhūri. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Medhā"
      },
      "ti asani viya siluccaye kilese medhati ",
      " hiṃsatīti medhā, khippaṃ gahaṇadhāraṇaṭṭhena vā ",
      " medhā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pariṇāyikā"
      },
      "ti yassuppajjati, taṃ sattaṃ hitapaṭipattiyaṃ sampayuttadhamme ca yāthāvalakkhaṇapaṭivedhe ca parinetīti pariṇāyikā. Imeheva aññānipi paññāpariyāyavacanāni vuttāni honti."
    ],
    "innerText": "Rāgo ari, taṃ ariṃ maddanipaññātiādīhi kiṃ vuttaṃ hoti? Rāgādiko kileso cittasantāne bhūto arīti bhū-ari, padasandhivasena a-kāra lopaṃ katvā bhūrīti vutto. Tassa bhūrissa maddanī paññā bhūrimaddanipaññāti vattabbe maddani sadda lopaṃ katvā ‘‘bhūripaññā’’ti vuttanti veditabbaṃ. Taṃ ariṃ maddanīti ca tesaṃ arīnaṃ maddanīti padacchedo kātabbo. Pathavīsamāyāti vitthatavipulaṭṭheneva pathavīsamāya. Vitthatāyāti pajānitabbe visaye patthaṭāya, na ekadese vattamānāya. Vipulāyāti oḷārikabhūtāya. Mahāniddese pana ‘‘vipulāya vitthatāyā’’ti (mahāni. 27) āgataṃ. Samannāgatoti puggalo. Itisaddo kāraṇatthe, iminā kāraṇena puggalassa bhūripaññāya samannāgatattā tassa paññā bhūripaññā nāmāti bhūte atthe ramatīti attho. Bhūripaññassa paññā bhūripaññapaññāti vattabbe ekassa paññāsaddassa lopaṃ katvā ‘‘bhūripaññā’’ti vuttaṃ. Bhūrisamā paññāti vā bhūripaññā. Apicāti aññapariyāyadassanatthaṃ vuttaṃ. Paññāyametanti paññāya etaṃ. Adhivacananti adhikavacanaṃ. Bhūrīti bhūte atthe ramatīti bhūri. Medhāti asani viya siluccaye kilese medhati hiṃsatīti medhā, khippaṃ gahaṇadhāraṇaṭṭhena vā medhā. Pariṇāyikāti yassuppajjati, taṃ sattaṃ hitapaṭipattiyaṃ sampayuttadhamme ca yāthāvalakkhaṇapaṭivedhe ca parinetīti pariṇāyikā. Imeheva aññānipi paññāpariyāyavacanāni vuttāni honti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññābāhulla"
      },
      "nti paññā bahulā assāti paññābahulo, tassa bhāvo paññābāhullaṃ. Tañca bahulaṃ pavattamānā paññā eva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idhekacco"
      },
      "tiādīsu puthujjanakalyāṇako vā ariyo vā. Paññā garukā assāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paññāgaruko"
      },
      ". Paññā caritaṃ pavattaṃ assāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paññācarito"
      },
      ". Paññā āsayo assāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paññāsayo"
      },
      ". Paññāya adhimuttoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paññādhimutto"
      },
      ". Paññā eva dhajabhūtā assāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paññādhajo"
      },
      ". Paññā eva ketubhūtā assāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paññāketu"
      },
      ". Paññā eva adhipati paññādhipati, paññādhipatito āgatattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paññādhipateyyo"
      },
      ". Dhammasabhāvavicinanaṃ bahulamassāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vicayabahulo"
      },
      ". Nānappakārena dhammasabhāvavicinanaṃ bahulamassāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pavicayabahulo"
      },
      ". Paññāya ogāhetvā tassa tassa dhammassa khāyanaṃ pākaṭakaraṇaṃ okkhāyanaṃ, okkhāyanaṃ bahulamassāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "okkhāyanabahulo"
      },
      ". Paññāya tassa tassa dhammassa sammā pekkhaṇā sampekkhā, sampekkhāya ayanaṃ pavattanaṃ sampekkhāyanaṃ, sampekkhāyanaṃ dhammo pakati assāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sampekkhāyanadhammo"
      },
      ". Taṃ taṃ dhammaṃ vibhūtaṃ pākaṭaṃ katvā viharatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vibhūtavihārī,"
      },
      " vibhūto vihāro vā assa atthīti vibhūtavihārī. Sā paññā caritaṃ, garukā, bahulā assāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "taccarito taggaruko tabbahulo"
      },
      ". Tassaṃ paññāyaṃ ninno, poṇo, pabbhāro, adhimuttoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tanninno tappoṇo tappabbhāro tadadhimutto"
      },
      ". Sā paññā adhipati tadadhipati, tato āgato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tadadhipateyyo"
      },
      ". ‘‘Paññāgaruko’’tiādīni ‘‘kāmaṃ sevantaṃyeva jānāti ayaṃ ",
      " puggalo kāmagaruko’’tiādīsu (paṭi. ma. 1.113) viya purimajātito pabhuti vuttāni. ‘‘Taccarito’’tiādīni imissā jātiyā vuttāni."
    ],
    "innerText": "Paññābāhullanti paññā bahulā assāti paññābahulo, tassa bhāvo paññābāhullaṃ. Tañca bahulaṃ pavattamānā paññā eva. Idhekaccotiādīsu puthujjanakalyāṇako vā ariyo vā. Paññā garukā assāti paññāgaruko. Paññā caritaṃ pavattaṃ assāti paññācarito. Paññā āsayo assāti paññāsayo. Paññāya adhimuttoti paññādhimutto. Paññā eva dhajabhūtā assāti paññādhajo. Paññā eva ketubhūtā assāti paññāketu. Paññā eva adhipati paññādhipati, paññādhipatito āgatattā paññādhipateyyo. Dhammasabhāvavicinanaṃ bahulamassāti vicayabahulo. Nānappakārena dhammasabhāvavicinanaṃ bahulamassāti pavicayabahulo. Paññāya ogāhetvā tassa tassa dhammassa khāyanaṃ pākaṭakaraṇaṃ okkhāyanaṃ, okkhāyanaṃ bahulamassāti okkhāyanabahulo. Paññāya tassa tassa dhammassa sammā pekkhaṇā sampekkhā, sampekkhāya ayanaṃ pavattanaṃ sampekkhāyanaṃ, sampekkhāyanaṃ dhammo pakati assāti sampekkhāyanadhammo. Taṃ taṃ dhammaṃ vibhūtaṃ pākaṭaṃ katvā viharatīti vibhūtavihārī, vibhūto vihāro vā assa atthīti vibhūtavihārī. Sā paññā caritaṃ, garukā, bahulā assāti taccarito taggaruko tabbahulo. Tassaṃ paññāyaṃ ninno, poṇo, pabbhāro, adhimuttoti tanninno tappoṇo tappabbhāro tadadhimutto. Sā paññā adhipati tadadhipati, tato āgato tadadhipateyyo. ‘‘Paññāgaruko’’tiādīni ‘‘kāmaṃ sevantaṃyeva jānāti ayaṃ puggalo kāmagaruko’’tiādīsu (paṭi. ma. 1.113) viya purimajātito pabhuti vuttāni. ‘‘Taccarito’’tiādīni imissā jātiyā vuttāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sīghapaññā ca lahupaññā ca hāsapaññā ca javanapaññā ca lokiyalokuttaramissakā. Khippaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sīghapaññā"
      },
      ". Lahukaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "lahupaññā"
      },
      ". Hāsabahulaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hāsapaññā"
      },
      ". Vipassanūpagasaṅkhāresu ca visaṅkhāre ca javanaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "javanapaññā. Sīghaṃ sīgha"
      },
      "nti bahunnaṃ sīlādīnaṃ saṅgahatthaṃ dvikkhattuṃ vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sīlānī"
      },
      "ti cārittavārittavasena paññattāni pātimokkhasaṃvarasīlāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Indriyasaṃvara"
      },
      "nti ",
      " cakkhādīnaṃ channaṃ indriyānaṃ rāgapaṭighappavesaṃ akatvā satikavāṭena vāraṇaṃ thakanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhojane mattaññuta"
      },
      "nti paccavekkhitaparibhogavasena bhojane pamāṇaññubhāvaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jāgariyānuyoga"
      },
      "nti divasassa tīsu koṭṭhāsesu, rattiyā paṭhamapacchimakoṭṭhāsesu ca jāgarati na niddāyati, samaṇadhammameva ca karotīti jāgaro, jāgarassa bhāvo, kammaṃ vā jāgariyaṃ, jāgariyassa anuyogo jāgariyānuyogo. Taṃ jāgariyānuyogaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sīlakkhandha"
      },
      "nti sekkhaṃ asekkhaṃ vā sīlakkhandhaṃ. Evamitarepi ",
      " khandhā veditabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññākkhandha"
      },
      "nti maggapaññañca sekkhāsekkhānaṃ lokiyapaññañca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vimuttikkhandha"
      },
      "nti phalavimuttiṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vimuttiñāṇadassanakkhandha"
      },
      "nti paccavekkhaṇañāṇaṃ."
    ],
    "innerText": "Sīghapaññā ca lahupaññā ca hāsapaññā ca javanapaññā ca lokiyalokuttaramissakā. Khippaṭṭhena sīghapaññā. Lahukaṭṭhena lahupaññā. Hāsabahulaṭṭhena hāsapaññā. Vipassanūpagasaṅkhāresu ca visaṅkhāre ca javanaṭṭhena javanapaññā. Sīghaṃ sīghanti bahunnaṃ sīlādīnaṃ saṅgahatthaṃ dvikkhattuṃ vuttaṃ. Sīlānīti cārittavārittavasena paññattāni pātimokkhasaṃvarasīlāni. Indriyasaṃvaranti cakkhādīnaṃ channaṃ indriyānaṃ rāgapaṭighappavesaṃ akatvā satikavāṭena vāraṇaṃ thakanaṃ. Bhojane mattaññutanti paccavekkhitaparibhogavasena bhojane pamāṇaññubhāvaṃ. Jāgariyānuyoganti divasassa tīsu koṭṭhāsesu, rattiyā paṭhamapacchimakoṭṭhāsesu ca jāgarati na niddāyati, samaṇadhammameva ca karotīti jāgaro, jāgarassa bhāvo, kammaṃ vā jāgariyaṃ, jāgariyassa anuyogo jāgariyānuyogo. Taṃ jāgariyānuyogaṃ. Sīlakkhandhanti sekkhaṃ asekkhaṃ vā sīlakkhandhaṃ. Evamitarepi khandhā veditabbā. Paññākkhandhanti maggapaññañca sekkhāsekkhānaṃ lokiyapaññañca. Vimuttikkhandhanti phalavimuttiṃ. Vimuttiñāṇadassanakkhandhanti paccavekkhaṇañāṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hāsabahulo"
      },
      "ti mūlapadaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vedabahulo"
      },
      "ti tassā eva pītiyā sampayuttasomanassavedanāvasena niddesapadaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tuṭṭhibahulo"
      },
      "ti nātibalavapītiyā tuṭṭhākāravasena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāmojjabahulo"
      },
      "ti balavapītiyā pamuditabhāvavasena."
    ],
    "innerText": "Hāsabahuloti mūlapadaṃ. Vedabahuloti tassā eva pītiyā sampayuttasomanassavedanāvasena niddesapadaṃ. Tuṭṭhibahuloti nātibalavapītiyā tuṭṭhākāravasena. Pāmojjabahuloti balavapītiyā pamuditabhāvavasena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "7"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yaṃ kiñci rūpa"
      },
      "ntiādi sammasanañāṇaniddese vuttatthaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tulayitvā"
      },
      "ti kalāpasammasanavasena tuletvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tīrayitvā"
      },
      "ti udayabbayānupassanāvasena tīrayitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vibhāvayitvā"
      },
      "ti bhaṅgānupassanādivasena pākaṭaṃ katvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vibhūtaṃ katvā"
      },
      "ti saṅkhārupekkhānulomavasena phuṭaṃ katvā. Tikkhapaññā lokuttarā eva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uppanna"
      },
      "nti samathavipassanāvasena vikkhambhanatadaṅgavasena pahīnampi ariyamaggena asamūhatattā uppattidhammataṃ anatītatāya asamūhatuppannanti vuccati, taṃ idha adhippetaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nādhivāsetī"
      },
      "ti santānaṃ āropetvā na vāseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pajahatī"
      },
      "ti samucchedavasena pajahati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vinodetī"
      },
      "ti khipati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Byantīkarotī"
      },
      "ti vigatantaṃ karoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anabhāvaṃ gametī"
      },
      "ti anu abhāvaṃ gameti, vipassanānukkamena ariyamaggaṃ patvā samucchedavaseneva abhāvaṃ gamayatīti attho. Ettha ca kāmapaṭisaṃyutto vitakko ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāmavitakko"
      },
      ". ‘‘Ime sattā marantū’’ti paresaṃ ",
      " maraṇapaṭisaṃyutto vitakko ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "byāpādavitakko"
      },
      ". ‘‘Ime sattā vihiṃsīyantū’’ti paresaṃ vihiṃsāpaṭisaṃyutto vitakko ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vihiṃsāvitakko. Pāpake"
      },
      "ti lāmake. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akusale dhamme"
      },
      "ti akosallasambhūte dhamme."
    ],
    "innerText": "7.Yaṃ kiñci rūpantiādi sammasanañāṇaniddese vuttatthaṃ. Tulayitvāti kalāpasammasanavasena tuletvā. Tīrayitvāti udayabbayānupassanāvasena tīrayitvā. Vibhāvayitvāti bhaṅgānupassanādivasena pākaṭaṃ katvā. Vibhūtaṃ katvāti saṅkhārupekkhānulomavasena phuṭaṃ katvā. Tikkhapaññā lokuttarā eva. Uppannanti samathavipassanāvasena vikkhambhanatadaṅgavasena pahīnampi ariyamaggena asamūhatattā uppattidhammataṃ anatītatāya asamūhatuppannanti vuccati, taṃ idha adhippetaṃ. Nādhivāsetīti santānaṃ āropetvā na vāseti. Pajahatīti samucchedavasena pajahati. Vinodetīti khipati. Byantīkarotīti vigatantaṃ karoti. Anabhāvaṃ gametīti anu abhāvaṃ gameti, vipassanānukkamena ariyamaggaṃ patvā samucchedavaseneva abhāvaṃ gamayatīti attho. Ettha ca kāmapaṭisaṃyutto vitakko kāmavitakko. ‘‘Ime sattā marantū’’ti paresaṃ maraṇapaṭisaṃyutto vitakko byāpādavitakko. ‘‘Ime sattā vihiṃsīyantū’’ti paresaṃ vihiṃsāpaṭisaṃyutto vitakko vihiṃsāvitakko. Pāpaketi lāmake. Akusale dhammeti akosallasambhūte dhamme."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nibbedhikapaññā"
      },
      "ti nibbidābahulassa puggalassa uppannamaggapaññā eva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ubbegabahulo"
      },
      "ti ñāṇabhayavasena bhayabahulo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uttāsabahulo"
      },
      "ti balavabhayabahulo ",
      ". Idaṃ purimasseva atthavivaraṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ukkaṇṭhanabahulo"
      },
      "ti saṅkhārato uddhaṃ visaṅkhārābhimukhatāya ukkaṇṭhanabahulo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anabhiratibahulo"
      },
      "ti ukkaṇṭhanavaseneva abhiratiabhāvaṃ dīpeti. Idānipi tamatthaṃ dvīhi vacanehi vivarati. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bahimukho"
      },
      "ti saṅkhārato bahibhūtanibbānābhimukho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na ramatī"
      },
      "ti nābhiramati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anibbiddhapubba"
      },
      "nti anamatagge saṃsāre antaṃ pāpetvā anibbiddhapubbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appadālitapubba"
      },
      "nti tasseva atthavacanaṃ, antakaraṇeneva apadālitapubbanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lobhakkhandha"
      },
      "nti lobharāsiṃ, lobhakoṭṭhāsaṃ vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Imāhi soḷasahi paññāhi samannāgato"
      },
      "ti ukkaṭṭhaparicchedena arahāyeva vutto. Upari ‘‘eko sekkhapaṭisambhidappatto’’ti (paṭi. ma. 3.8) vuttattā sotāpannasakadāgāmianāgāminopi labbhantiyeva."
    ],
    "innerText": "Nibbedhikapaññāti nibbidābahulassa puggalassa uppannamaggapaññā eva. Ubbegabahuloti ñāṇabhayavasena bhayabahulo. Uttāsabahuloti balavabhayabahulo . Idaṃ purimasseva atthavivaraṇaṃ. Ukkaṇṭhanabahuloti saṅkhārato uddhaṃ visaṅkhārābhimukhatāya ukkaṇṭhanabahulo. Anabhiratibahuloti ukkaṇṭhanavaseneva abhiratiabhāvaṃ dīpeti. Idānipi tamatthaṃ dvīhi vacanehi vivarati. Tattha bahimukhoti saṅkhārato bahibhūtanibbānābhimukho. Na ramatīti nābhiramati. Anibbiddhapubbanti anamatagge saṃsāre antaṃ pāpetvā anibbiddhapubbaṃ. Appadālitapubbanti tasseva atthavacanaṃ, antakaraṇeneva apadālitapubbanti attho. Lobhakkhandhanti lobharāsiṃ, lobhakoṭṭhāsaṃ vā. Imāhi soḷasahi paññāhi samannāgatoti ukkaṭṭhaparicchedena arahāyeva vutto. Upari ‘‘eko sekkhapaṭisambhidappatto’’ti (paṭi. ma. 3.8) vuttattā sotāpannasakadāgāmianāgāminopi labbhantiyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Puggalavisesaniddesavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "8"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dve"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "puggalā"
      },
      "tiādīhi paṭisambhidappattapuggalavisesapaṭipāṭiṃ dasseti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pubbayogo"
      },
      "ti atītajātīsu paṭisambhidappattihetubhūto puññapayogo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tenā"
      },
      "ti tena pubbayogakāraṇena. Evaṃ sesesupi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atireko hotī"
      },
      "ti atiritto hoti, atirekayogato vā ‘‘atireko’’ti vutto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adhiko hotī"
      },
      "ti aggo hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Viseso hotī"
      },
      "ti visiṭṭho hoti, visesayogato vā viseso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñāṇaṃ pabhijjatī"
      },
      "ti paṭisambhidāñāṇappabhedaṃ pāpuṇāti."
    ],
    "innerText": "8.Dvepuggalātiādīhi paṭisambhidappattapuggalavisesapaṭipāṭiṃ dasseti. Tattha pubbayogoti atītajātīsu paṭisambhidappattihetubhūto puññapayogo. Tenāti tena pubbayogakāraṇena. Evaṃ sesesupi. Atireko hotīti atiritto hoti, atirekayogato vā ‘‘atireko’’ti vutto. Adhiko hotīti aggo hoti. Viseso hotīti visiṭṭho hoti, visesayogato vā viseso. Ñāṇaṃ pabhijjatīti paṭisambhidāñāṇappabhedaṃ pāpuṇāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bahussuto"
      },
      "ti buddhavacanavasena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Desanābahulo"
      },
      "ti dhammadesanāvasena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Garūpanissito"
      },
      "ti paññāya adhikaṃ garuṃ upanissito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vihārabahulo"
      },
      "ti vipassanāvihārabahulo, phalasamāpattivihārabahulo vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paccavekkhaṇābahulo"
      },
      "ti vipassanāvihāre sati vipassanāpaccavekkhaṇābahulo, phalasamāpattivihāre sati phalasamāpattipaccavekkhaṇābahulo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sekhapaṭisambhidappatto"
      },
      "ti sekho hutvā paṭisambhidappatto. Evaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asekhapaṭisambhidappatto. Sāvakapāramippatto"
      },
      "ti ettha mahāpaññānaṃ aggassa mahāsāvakassa sattasaṭṭhiyā sāvakañāṇānaṃ pāragamanaṃ pāramī, sāvakassa pāramī sāvakapāramī, taṃ sāvakapāramiṃ pattoti sāvakapāramippatto. Sāvakapāramitāppattoti vā pāṭho. Sattasaṭṭhiyā ",
      " sāvakañāṇānaṃ pālako pūrako ca so mahāsāvako paramo, tassa paramassa ayaṃ sattasaṭṭhibhedā ñāṇakiriyā paramassa bhāvo, kammaṃ vāti pāramī, tassa sāvakassa pāramī sāvakapāramī ",
      ", taṃ pattoti sāvakapāramippatto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sāvakapāramippatto"
      },
      "ti mahāmoggallānattherādiko yo koci sāvako. Sāvakapāramippattasāvakato atirekassa aññassa sāvakassa abhāvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "eko paccekasambuddho"
      },
      "ti āha. Puna ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paññāpabhedakusalo"
      },
      "tiādīhi vuttatthameva nigametvā dassesīti. Ñāṇakathāya yebhuyyena anekāni ñāṇāni niddiṭṭhāni. Paññākathāya yebhuyyena ekāpi paññā nānākāravasena nānākatvā vuttāti ayaṃ viseso."
    ],
    "innerText": "Bahussutoti buddhavacanavasena. Desanābahuloti dhammadesanāvasena. Garūpanissitoti paññāya adhikaṃ garuṃ upanissito. Vihārabahuloti vipassanāvihārabahulo, phalasamāpattivihārabahulo vā. Paccavekkhaṇābahuloti vipassanāvihāre sati vipassanāpaccavekkhaṇābahulo, phalasamāpattivihāre sati phalasamāpattipaccavekkhaṇābahulo. Sekhapaṭisambhidappattoti sekho hutvā paṭisambhidappatto. Evaṃ asekhapaṭisambhidappatto. Sāvakapāramippattoti ettha mahāpaññānaṃ aggassa mahāsāvakassa sattasaṭṭhiyā sāvakañāṇānaṃ pāragamanaṃ pāramī, sāvakassa pāramī sāvakapāramī, taṃ sāvakapāramiṃ pattoti sāvakapāramippatto. Sāvakapāramitāppattoti vā pāṭho. Sattasaṭṭhiyā sāvakañāṇānaṃ pālako pūrako ca so mahāsāvako paramo, tassa paramassa ayaṃ sattasaṭṭhibhedā ñāṇakiriyā paramassa bhāvo, kammaṃ vāti pāramī, tassa sāvakassa pāramī sāvakapāramī , taṃ pattoti sāvakapāramippatto. Sāvakapāramippattoti mahāmoggallānattherādiko yo koci sāvako. Sāvakapāramippattasāvakato atirekassa aññassa sāvakassa abhāvā eko paccekasambuddhoti āha. Puna paññāpabhedakusalotiādīhi vuttatthameva nigametvā dassesīti. Ñāṇakathāya yebhuyyena anekāni ñāṇāni niddiṭṭhāni. Paññākathāya yebhuyyena ekāpi paññā nānākāravasena nānākatvā vuttāti ayaṃ viseso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Mahāpaññākathāvaṇṇanā niṭṭhitā."
  }
]