[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "6. Bījanivaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Vidhūpanadāyakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Padumuttarabuddhassā"
      },
      "tiādikaṃ ",
      " āyasmato vidhūpanadāyakattherassa apadānaṃ. Ayampi purimajinavaresu pūritapuññasambhāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto padumuttarassa bhagavato kāle ekasmiṃ kulagehe nibbatto viññutaṃ patto vibhavasampanno saddhājāto bhagavati pasanno gimhakāle suvaṇṇarajatamuttāmaṇimayaṃ bījaniṃ kāretvā bhagavato adāsi. So tena puññakammena devesu ca manussesu ca saṃsaranto ",
      " dve sampattiyo anubhavitvā imassa amhākaṃ sammāsambuddhassa uppannakāle ekasmiṃ kulagehe nibbatto gharabandhanena bandhitvā gharāvāse ādīnavaṃ disvā pabbajjāya ca ānisaṃsaṃ disvā saddhāsampanno sāsane pabbajitvā vipassanaṃ vaḍḍhetvā nacirasseva arahā ahosi."
    ],
    "innerText": "Padumuttarabuddhassātiādikaṃ āyasmato vidhūpanadāyakattherassa apadānaṃ. Ayampi purimajinavaresu pūritapuññasambhāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto padumuttarassa bhagavato kāle ekasmiṃ kulagehe nibbatto viññutaṃ patto vibhavasampanno saddhājāto bhagavati pasanno gimhakāle suvaṇṇarajatamuttāmaṇimayaṃ bījaniṃ kāretvā bhagavato adāsi. So tena puññakammena devesu ca manussesu ca saṃsaranto dve sampattiyo anubhavitvā imassa amhākaṃ sammāsambuddhassa uppannakāle ekasmiṃ kulagehe nibbatto gharabandhanena bandhitvā gharāvāse ādīnavaṃ disvā pabbajjāya ca ānisaṃsaṃ disvā saddhāsampanno sāsane pabbajitvā vipassanaṃ vaḍḍhetvā nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      ". So ‘‘kena mayā puññakammena ayaṃ lokuttarasampatti laddhā’’ti attano pubbakammaṃ anussaranto taṃ paccakkhato ñatvā pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "padumuttarabuddhassā"
      },
      "tiādimāha. Taṃ heṭṭhā vuttatthameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bījanikā mayā dinnā"
      },
      "ti visesena santāpayantānaṃ sattānaṃ santāpaṃ nibbāpenti sītalaṃ vātaṃ janetīti bījanī, bījanīyeva bījanikā, sā sattaratanamayā vijjotamānā bījanikā mayā kārāpetvā dinnāti attho."
    ],
    "innerText": "1. So ‘‘kena mayā puññakammena ayaṃ lokuttarasampatti laddhā’’ti attano pubbakammaṃ anussaranto taṃ paccakkhato ñatvā pubbacaritāpadānaṃ pakāsento padumuttarabuddhassātiādimāha. Taṃ heṭṭhā vuttatthameva. Bījanikā mayā dinnāti visesena santāpayantānaṃ sattānaṃ santāpaṃ nibbāpenti sītalaṃ vātaṃ janetīti bījanī, bījanīyeva bījanikā, sā sattaratanamayā vijjotamānā bījanikā mayā kārāpetvā dinnāti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vidhūpanadāyakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Sataraṃsittheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ucciyaṃ selamāruyhā"
      },
      "tiādikaṃ āyasmato sataraṃsittherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto padumuttarassa bhagavato kāle brāhmaṇakule nibbatto viññutaṃ patto sakkaṭabyākaraṇe vedattaye ca pāraṅgato gharāvāsaṃ ",
      " pahāya araññaṃ pavisitvā isipabbajjaṃ pabbajitvā himavante vāsaṃ kappesi. Tasmiṃ ",
      " samaye padumuttaro bhagavā vivekakāmatāya uccaṃ ekaṃ pabbataṃ āruyha jalitaggikkhanto viya nisīdi. Taṃ tathānisinnaṃ bhagavantaṃ disvā tāpaso somanassajāto añjaliṃ paggayha anekehi kāraṇehi thomesi. So tena puññakammena tato cuto chasu kāmāvacaradevesu dibbasampattiṃ anubhavitvā tato manussaloke sataraṃsī nāma cakkavattī rājā hutvā nibbatti. Tampi sampattiṃ anekakkhattuṃ anubhavitvā imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbatto pubbapuññasambhāravasena ñāṇassa paripakkattā sattavassikova pabbajitvā arahattaṃ pāpuṇi."
    ],
    "innerText": "Ucciyaṃ selamāruyhātiādikaṃ āyasmato sataraṃsittherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto padumuttarassa bhagavato kāle brāhmaṇakule nibbatto viññutaṃ patto sakkaṭabyākaraṇe vedattaye ca pāraṅgato gharāvāsaṃ pahāya araññaṃ pavisitvā isipabbajjaṃ pabbajitvā himavante vāsaṃ kappesi. Tasmiṃ samaye padumuttaro bhagavā vivekakāmatāya uccaṃ ekaṃ pabbataṃ āruyha jalitaggikkhanto viya nisīdi. Taṃ tathānisinnaṃ bhagavantaṃ disvā tāpaso somanassajāto añjaliṃ paggayha anekehi kāraṇehi thomesi. So tena puññakammena tato cuto chasu kāmāvacaradevesu dibbasampattiṃ anubhavitvā tato manussaloke sataraṃsī nāma cakkavattī rājā hutvā nibbatti. Tampi sampattiṃ anekakkhattuṃ anubhavitvā imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbatto pubbapuññasambhāravasena ñāṇassa paripakkattā sattavassikova pabbajitvā arahattaṃ pāpuṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "8-9"
      },
      ". So ",
      " ‘‘ahaṃ kena kammena sattavassikova santipadaṃ anuppattosmī’’ti saramāno pubbakammaṃ ñāṇena paccakkhato disvā somanassajāto pubbacaritāpadānaṃ udānavasena pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ucciyaṃ selamāruyhā"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ucciya"
      },
      "nti uccaṃ selamayaṃ pabbataṃ āruyha nisīdi padumuttaroti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pabbatassāvidūramhī"
      },
      "ti bhagavato nisinnassa pabbatassa āsannaṭṭhāneti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Brāhmaṇo mantapāragū"
      },
      "ti mantasaṅkhātassa vedattayassa pāraṃ pariyosānaṃ koṭiṃ gato eko brāhmaṇoti attho, aññaṃ viya attānaṃ niddisati ayaṃ mantapāragūti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upaviṭṭhaṃ mahāvīra"
      },
      "nti tasmiṃ pabbate nisinnaṃ vīravantaṃ jinaṃ, kiṃ visiṭṭhaṃ? ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Devadevaṃ"
      },
      " sakalachakāmāvacarabrahmadevānaṃ atidevaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "narāsabhaṃ"
      },
      " narānaṃ āsataṃ seṭṭhaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "lokanāyakaṃ"
      },
      " sakalasattalokaṃ nayantaṃ nibbānaṃ pāpentaṃ ahaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "añjaliṃ"
      },
      " dasanakhasamodhānañjalipuṭaṃ sirasi muddhani ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paggahetvāna"
      },
      " patiṭṭhapetvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "santhaviṃ"
      },
      " suṭṭhuṃ thomesinti sambandho."
    ],
    "innerText": "8-9. So ‘‘ahaṃ kena kammena sattavassikova santipadaṃ anuppattosmī’’ti saramāno pubbakammaṃ ñāṇena paccakkhato disvā somanassajāto pubbacaritāpadānaṃ udānavasena pakāsento ucciyaṃ selamāruyhātiādimāha. Tattha ucciyanti uccaṃ selamayaṃ pabbataṃ āruyha nisīdi padumuttaroti sambandho. Pabbatassāvidūramhīti bhagavato nisinnassa pabbatassa āsannaṭṭhāneti attho. Brāhmaṇo mantapāragūti mantasaṅkhātassa vedattayassa pāraṃ pariyosānaṃ koṭiṃ gato eko brāhmaṇoti attho, aññaṃ viya attānaṃ niddisati ayaṃ mantapāragūti. Upaviṭṭhaṃ mahāvīranti tasmiṃ pabbate nisinnaṃ vīravantaṃ jinaṃ, kiṃ visiṭṭhaṃ? Devadevaṃ sakalachakāmāvacarabrahmadevānaṃ atidevaṃ narāsabhaṃ narānaṃ āsataṃ seṭṭhaṃ lokanāyakaṃ sakalasattalokaṃ nayantaṃ nibbānaṃ pāpentaṃ ahaṃ añjaliṃ dasanakhasamodhānañjalipuṭaṃ sirasi muddhani paggahetvāna patiṭṭhapetvā santhaviṃ suṭṭhuṃ thomesinti sambandho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "12"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhāsathā"
      },
      "ti ‘‘yenāyaṃ añjalī dinno…pe… arahā so bhavissatī’’ti byākāsi. Sesaṃ uttānatthamevāti."
    ],
    "innerText": "12.Abhāsathāti ‘‘yenāyaṃ añjalī dinno…pe… arahā so bhavissatī’’ti byākāsi. Sesaṃ uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sataraṃsittheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Sayanadāyakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Padumuttarabuddhassā"
      },
      "tiādikaṃ āyasmato sayanadāyakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto padumuttarassa bhagavato ",
      " kāle ekasmiṃ kulagehe nibbatto viññutaṃ patto gharāvāsaṃ saṇṭhapetvā sukhamanubhavanto satthu dhammadesanaṃ sutvā satthari pasanno dantasuvaṇṇarajatamuttamaṇimayaṃ mahārahaṃ mañcaṃ kārāpetvā cīnapaṭṭakambalādīni attharitvā sayanatthāya bhagavato adāsi. Bhagavā tassa anuggahaṃ karonto tattha sayi ",
      ". So tena puññakammena devamanussesu saṃsaranto tadanurūpaṃ ākāsagamanasukhaseyyādisukhaṃ anubhavitvā imasmiṃ buddhuppāde vibhavasampanne ekasmiṃ kule nibbattitvā viññutaṃ pāpuṇitvā satthu dhammadesanaṃ sutvā pasannamānaso pabbajitvā vipassanto nacirasseva arahā ahosi."
    ],
    "innerText": "Padumuttarabuddhassātiādikaṃ āyasmato sayanadāyakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto padumuttarassa bhagavato kāle ekasmiṃ kulagehe nibbatto viññutaṃ patto gharāvāsaṃ saṇṭhapetvā sukhamanubhavanto satthu dhammadesanaṃ sutvā satthari pasanno dantasuvaṇṇarajatamuttamaṇimayaṃ mahārahaṃ mañcaṃ kārāpetvā cīnapaṭṭakambalādīni attharitvā sayanatthāya bhagavato adāsi. Bhagavā tassa anuggahaṃ karonto tattha sayi . So tena puññakammena devamanussesu saṃsaranto tadanurūpaṃ ākāsagamanasukhaseyyādisukhaṃ anubhavitvā imasmiṃ buddhuppāde vibhavasampanne ekasmiṃ kule nibbattitvā viññutaṃ pāpuṇitvā satthu dhammadesanaṃ sutvā pasannamānaso pabbajitvā vipassanto nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "20"
      },
      ". So ",
      " attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "padumuttarabuddhassā"
      },
      "tiādimāha. Taṃ heṭṭhā vuttatthameva."
    ],
    "innerText": "20. So attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento padumuttarabuddhassātiādimāha. Taṃ heṭṭhā vuttatthameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "21"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sukhette bījasampadā"
      },
      "ti yathā tiṇakacavararahite kaddamādisampanne sukhette vuttabījāni sāduphalāni nipphādenti, evameva rāgadosādidiyaḍḍhasahassakilesasaṅkhātatiṇakacavararahite suddhasantāne puññakkhette vuttadānāni appānipi samānāni mahapphalāni hontīti attho. Sesaṃ suviññeyyamevāti."
    ],
    "innerText": "21.Sukhette bījasampadāti yathā tiṇakacavararahite kaddamādisampanne sukhette vuttabījāni sāduphalāni nipphādenti, evameva rāgadosādidiyaḍḍhasahassakilesasaṅkhātatiṇakacavararahite suddhasantāne puññakkhette vuttadānāni appānipi samānāni mahapphalāni hontīti attho. Sesaṃ suviññeyyamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sayanadāyakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Gandhodakiyattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Padumuttarabuddhassā"
      },
      "tiādikaṃ āyasmato gandhodakiyattherassa apadānaṃ. Ayampi purimamunivaresu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto padumuttarassa bhagavato kāle kulagehe nibbatto parinibbute bhagavati nagaravāsino bodhipūjaṃ kurumāne disvā vicittaghaṭe candanakappurāgaruādimissakasugandhodakena pūretvā bodhirukkhaṃ abhisiñci. Tasmiṃ khaṇe devo mahādhārāhi pavassi. Tadā so asanivegena kālaṃ kato. Teneva puññakammena devaloke nibbatti, tattheva ṭhito ‘‘aho buddho, aho dhammo’’tiādigāthāyo abhāsi. Evaṃ so devamanussesu sampattiyo anubhavitvā sabbapariḷāhavippamutto nibbattanibbattaṭṭhāne sītibhāvamupagato sukhito imasmiṃ buddhuppāde kulagehe ",
      " nibbatto viññutaṃ patto satthari pasanno pabbajitvā kammaṭṭhānaṃ ārabhitvā vipassanto nacirasseva arahattaṃ pāpuṇi. Pubbe katapuññena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gandhodakiyatthero"
      },
      "ti pākaṭo ahosi."
    ],
    "innerText": "Padumuttarabuddhassātiādikaṃ āyasmato gandhodakiyattherassa apadānaṃ. Ayampi purimamunivaresu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto padumuttarassa bhagavato kāle kulagehe nibbatto parinibbute bhagavati nagaravāsino bodhipūjaṃ kurumāne disvā vicittaghaṭe candanakappurāgaruādimissakasugandhodakena pūretvā bodhirukkhaṃ abhisiñci. Tasmiṃ khaṇe devo mahādhārāhi pavassi. Tadā so asanivegena kālaṃ kato. Teneva puññakammena devaloke nibbatti, tattheva ṭhito ‘‘aho buddho, aho dhammo’’tiādigāthāyo abhāsi. Evaṃ so devamanussesu sampattiyo anubhavitvā sabbapariḷāhavippamutto nibbattanibbattaṭṭhāne sītibhāvamupagato sukhito imasmiṃ buddhuppāde kulagehe nibbatto viññutaṃ patto satthari pasanno pabbajitvā kammaṭṭhānaṃ ārabhitvā vipassanto nacirasseva arahattaṃ pāpuṇi. Pubbe katapuññena gandhodakiyattheroti pākaṭo ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "25"
      },
      ". So ekadivasaṃ attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "padumutarassā"
      },
      "tiādimāha. Taṃ vuttatthameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahābodhimaho ahū"
      },
      "ti mahābodhirukkhassa pūjā ahosīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vicittaṃ ghaṭamādāyā"
      },
      "ti anekehi cittakammasuvaṇṇakammehi vicittaṃ sobhamānaṃ gandhodakapuṇṇaṃ ghaṭaṃ gahetvāti attho ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gandhodakamadāsaha"
      },
      "nti gandhodakaṃ adāsiṃ, ahaṃ gandhodakena abhisiñcinti attho."
    ],
    "innerText": "25. So ekadivasaṃ attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento padumutarassātiādimāha. Taṃ vuttatthameva. Mahābodhimaho ahūti mahābodhirukkhassa pūjā ahosīti attho. Vicittaṃ ghaṭamādāyāti anekehi cittakammasuvaṇṇakammehi vicittaṃ sobhamānaṃ gandhodakapuṇṇaṃ ghaṭaṃ gahetvāti attho . Gandhodakamadāsahanti gandhodakaṃ adāsiṃ, ahaṃ gandhodakena abhisiñcinti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "26"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nhānakāle"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ca bodhiyā"
      },
      "ti bodhiyā pūjākaraṇasamayeti attho. Sesaṃ uttānatthamevāti."
    ],
    "innerText": "26.Nhānakāleca bodhiyāti bodhiyā pūjākaraṇasamayeti attho. Sesaṃ uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Gandhodakiyattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Opavayhattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Padumuttarabuddhassā"
      },
      "tiādikaṃ āyasmato opavayhattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto padumuttarajinādicce loke pātubhūte ekasmiṃ vibhavasampannakule nibbatto vuddhimanvāya mahaddhano mahābhogo gharāvāsaṃ vasamāno sāsane pasanno satthari pasādabahumāno ājānīyena sindhavena pūjaṃ akāsi, pūjetvā ca pana ‘‘buddhādīnaṃ samaṇānaṃ hatthiassādayo na kappanti, kappiyabhaṇḍaṃ dassāmī’’ti cintetvā taṃ agghāpetvā tadagghanakena kahāpaṇena kappiyaṃ kappāsikakambalakojavādikaṃ cīvaraṃ kappūratakkolādikaṃ bhesajjaparikkhārañca adāsi. So tena puññakammena yāvatāyukaṃ ṭhatvā tato cuto devesu ca manussesu ca hatthiassādianekavāhanasampanno sukhaṃ anubhavitvā imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbatto viññutaṃ patto saddhāsampanno sāsane pabbajitvā kammaṭṭhānaṃ gahetvā vipassanaṃ vaḍḍhetvā maggapaṭipāṭiyā arahatte patiṭṭhāsi, pubbe katapuññasambhāravasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "opavayhatthero"
      },
      "ti pākaṭo ahosi."
    ],
    "innerText": "Padumuttarabuddhassātiādikaṃ āyasmato opavayhattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto padumuttarajinādicce loke pātubhūte ekasmiṃ vibhavasampannakule nibbatto vuddhimanvāya mahaddhano mahābhogo gharāvāsaṃ vasamāno sāsane pasanno satthari pasādabahumāno ājānīyena sindhavena pūjaṃ akāsi, pūjetvā ca pana ‘‘buddhādīnaṃ samaṇānaṃ hatthiassādayo na kappanti, kappiyabhaṇḍaṃ dassāmī’’ti cintetvā taṃ agghāpetvā tadagghanakena kahāpaṇena kappiyaṃ kappāsikakambalakojavādikaṃ cīvaraṃ kappūratakkolādikaṃ bhesajjaparikkhārañca adāsi. So tena puññakammena yāvatāyukaṃ ṭhatvā tato cuto devesu ca manussesu ca hatthiassādianekavāhanasampanno sukhaṃ anubhavitvā imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbatto viññutaṃ patto saddhāsampanno sāsane pabbajitvā kammaṭṭhānaṃ gahetvā vipassanaṃ vaḍḍhetvā maggapaṭipāṭiyā arahatte patiṭṭhāsi, pubbe katapuññasambhāravasena opavayhattheroti pākaṭo ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "33"
      },
      ". So ‘‘kena nu kho kāraṇena idaṃ mayā santipadaṃ adhigata’’nti upadhārento pubbakammaṃ ",
      " ñāṇena paccakkhato ñatvā somanassajāto pubbacaritāpadānaṃ udānavasena pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "padumuttarabuddhassā"
      },
      "tiādimāha. Taṃ vuttatthameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ājānīyamadāsaha"
      },
      "nti ājānīyaṃ uttamajātisindhavaṃ ahaṃ adāsiṃ pūjesinti attho."
    ],
    "innerText": "33. So ‘‘kena nu kho kāraṇena idaṃ mayā santipadaṃ adhigata’’nti upadhārento pubbakammaṃ ñāṇena paccakkhato ñatvā somanassajāto pubbacaritāpadānaṃ udānavasena pakāsento padumuttarabuddhassātiādimāha. Taṃ vuttatthameva. Ājānīyamadāsahanti ājānīyaṃ uttamajātisindhavaṃ ahaṃ adāsiṃ pūjesinti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "35"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sapattabhāro"
      },
      "ti sassa attano pattāni aṭṭha parikkhārāni bhārāni yassa so sapattabhāro, aṭṭhaparikkhārayuttoti attho."
    ],
    "innerText": "35.Sapattabhāroti sassa attano pattāni aṭṭha parikkhārāni bhārāni yassa so sapattabhāro, aṭṭhaparikkhārayuttoti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "36"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khamanīyamadāsaha"
      },
      "nti ",
      " khamanīyayoggaṃ cīvarādikappiyaparikkhāranti attho."
    ],
    "innerText": "36.Khamanīyamadāsahanti khamanīyayoggaṃ cīvarādikappiyaparikkhāranti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "40"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Carimo"
      },
      "ti pariyosāno koṭippatto bhavoti attho. Sesaṃ suviññeyyamevāti."
    ],
    "innerText": "40.Carimoti pariyosāno koṭippatto bhavoti attho. Sesaṃ suviññeyyamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Opavayhattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Saparivārāsanattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Padumuttarabuddhassā"
      },
      "tiādikaṃ āyasmato saparivārāsanattherassa apadānaṃ. Sopi purimabuddhesu katādhikāro tattha ",
      " tattha bhavesu vivaṭṭūpanissayāni puññāni upacinanto padumuttarassa bhagavato kāle vibhavasampanne kulagehe nibbatto vuddhippatto saddhājāto sāsane pasanno dānaphalaṃ saddahanto nānaggarasabhojanena bhagavato piṇḍapātaṃ adāsi, datvā ca pana bhojanasālāyaṃ bhojanatthāya nisinnāsanaṃ jātisumanamallikādīhi alaṅkari. Bhagavā ca bhattānumodanamakāsi. So tena puññakammena devamanussesu saṃsaranto anekavidhaṃ sampattiṃ anubhavitvā imasmiṃ buddhuppāde vibhavasampanne kulagehe nibbatto vuddhimanvāya saddho pasanno pabbajitvā na cirasseva arahā ahosi."
    ],
    "innerText": "Padumuttarabuddhassātiādikaṃ āyasmato saparivārāsanattherassa apadānaṃ. Sopi purimabuddhesu katādhikāro tattha tattha bhavesu vivaṭṭūpanissayāni puññāni upacinanto padumuttarassa bhagavato kāle vibhavasampanne kulagehe nibbatto vuddhippatto saddhājāto sāsane pasanno dānaphalaṃ saddahanto nānaggarasabhojanena bhagavato piṇḍapātaṃ adāsi, datvā ca pana bhojanasālāyaṃ bhojanatthāya nisinnāsanaṃ jātisumanamallikādīhi alaṅkari. Bhagavā ca bhattānumodanamakāsi. So tena puññakammena devamanussesu saṃsaranto anekavidhaṃ sampattiṃ anubhavitvā imasmiṃ buddhuppāde vibhavasampanne kulagehe nibbatto vuddhimanvāya saddho pasanno pabbajitvā na cirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "43"
      },
      ". So evaṃ pattasantipado ‘‘kena nu kho puññena idaṃ santipadaṃ anuppatta’’nti ñāṇena upadhārento pubbakammaṃ disvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "padumuttarabuddhassā"
      },
      "tiādimāha. Taṃ vuttatthameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Piṇḍapātaṃ adāsaha"
      },
      "nti tattha tattha laddhānaṃ piṇḍānaṃ kabaḷaṃ kabaḷaṃ katvā pātabbato khāditabbato āhāro piṇḍapāto, taṃ piṇḍapātaṃ bhagavato adāsiṃ, bhagavantaṃ bhojesinti attho."
    ],
    "innerText": "43. So evaṃ pattasantipado ‘‘kena nu kho puññena idaṃ santipadaṃ anuppatta’’nti ñāṇena upadhārento pubbakammaṃ disvā somanassajāto pubbacaritāpadānaṃ pakāsento padumuttarabuddhassātiādimāha. Taṃ vuttatthameva. Piṇḍapātaṃ adāsahanti tattha tattha laddhānaṃ piṇḍānaṃ kabaḷaṃ kabaḷaṃ katvā pātabbato khāditabbato āhāro piṇḍapāto, taṃ piṇḍapātaṃ bhagavato adāsiṃ, bhagavantaṃ bhojesinti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "44"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akittayi"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "piṇḍapāta"
      },
      "nti mayā dinnapiṇḍapātassa guṇaṃ ānisaṃsaṃ pakāsesīti attho."
    ],
    "innerText": "44.Akittayipiṇḍapātanti mayā dinnapiṇḍapātassa guṇaṃ ānisaṃsaṃ pakāsesīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "48"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṃvuto pātimokkhasmi"
      },
      "nti pātimokkhasaṃvarasīlena saṃvuto pihito paṭicchannoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Indriyesu ca pañcasū"
      },
      "ti cakkhundriyādīsu pañcasu ",
      " indriyesu rūpādīhi gopito indriyasaṃvarasīlañca gopitoti attho. Sesaṃ suviññeyyamevāti."
    ],
    "innerText": "48.Saṃvuto pātimokkhasminti pātimokkhasaṃvarasīlena saṃvuto pihito paṭicchannoti attho. Indriyesu ca pañcasūti cakkhundriyādīsu pañcasu indriyesu rūpādīhi gopito indriyasaṃvarasīlañca gopitoti attho. Sesaṃ suviññeyyamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Saparivārāsanattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Pañcadīpakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Padumuttarabuddhassā"
      },
      "tiādikaṃ āyasmato pañcadīpakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro uppannuppannabhavesu vivaṭṭūpanissayāni puññāni upacinanto padumuttarassa bhagavato kāle kulagehe nibbatto vuddhimanvāya gharāvāse vasanto bhagavato dhammaṃ sutvā sammādiṭṭhiyaṃ patiṭṭhito saddho pasanno mahājanehi bodhipūjaṃ kayiramānaṃ disvā sayampi bodhiṃ parivāretvā dīpaṃ jāletvā pūjesi. So tena puññakammena devamanussesu saṃsaranto cakkavattisampattiādayo anubhavitvā sabbattheva uppannabhave jalamāno jotisampannavimānādīsu vasitvā imasmiṃ buddhuppāde ekasmiṃ vibhavasampanne kulagehe nibbatto vuddhippatto saddhājāto pabbajitvā nacirasseva arahā ahosi, dīpapūjānissandena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dīpakatthero"
      },
      "ti pākaṭo."
    ],
    "innerText": "Padumuttarabuddhassātiādikaṃ āyasmato pañcadīpakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro uppannuppannabhavesu vivaṭṭūpanissayāni puññāni upacinanto padumuttarassa bhagavato kāle kulagehe nibbatto vuddhimanvāya gharāvāse vasanto bhagavato dhammaṃ sutvā sammādiṭṭhiyaṃ patiṭṭhito saddho pasanno mahājanehi bodhipūjaṃ kayiramānaṃ disvā sayampi bodhiṃ parivāretvā dīpaṃ jāletvā pūjesi. So tena puññakammena devamanussesu saṃsaranto cakkavattisampattiādayo anubhavitvā sabbattheva uppannabhave jalamāno jotisampannavimānādīsu vasitvā imasmiṃ buddhuppāde ekasmiṃ vibhavasampanne kulagehe nibbatto vuddhippatto saddhājāto pabbajitvā nacirasseva arahā ahosi, dīpapūjānissandena dīpakattheroti pākaṭo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "50"
      },
      ". So ",
      " ekadivasaṃ attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "padumuttarabuddhassā"
      },
      "tiādimāha. Taṃ vuttatthameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ujudiṭṭhi ahosaha"
      },
      "nti vaṅkaṃ micchādiṭṭhiṃ chaḍḍetvā uju avaṅkaṃ nibbānābhimukhaṃ pāpuṇanasammādiṭṭhi ahosinti attho."
    ],
    "innerText": "50. So ekadivasaṃ attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento padumuttarabuddhassātiādimāha. Taṃ vuttatthameva. Ujudiṭṭhi ahosahanti vaṅkaṃ micchādiṭṭhiṃ chaḍḍetvā uju avaṅkaṃ nibbānābhimukhaṃ pāpuṇanasammādiṭṭhi ahosinti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "51"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Padīpadānaṃ pādāsi"
      },
      "nti ettha pakārena dibbati jotatīti padīpo, tassa dānaṃ padīpadānaṃ, taṃ adāsiṃ padīpapūjaṃ akāsinti attho. Sesaṃ sabbattha uttānatthamevāti."
    ],
    "innerText": "51.Padīpadānaṃ pādāsinti ettha pakārena dibbati jotatīti padīpo, tassa dānaṃ padīpadānaṃ, taṃ adāsiṃ padīpapūjaṃ akāsinti attho. Sesaṃ sabbattha uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pañcadīpakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Dhajadāyakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Padumuttarabuddhassā"
      },
      "tiādikaṃ ",
      " āyasmato dhajadāyakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto padumuttarassa bhagavato kāle ekasmiṃ kulagehe nibbatto vuddhimanvāya satthari pasīditvā sundarehi anekehi vatthehi dhajaṃ kārāpetvā dhajapūjaṃ akāsi. So tena puññakammena uppannuppannabhave uccakule nibbatto pūjaniyo ahosi. Aparabhāge imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbatto vuddhimanvāya puttadārehi vaḍḍhitvā mahābhogo yasavā saddhājāto satthari pasanno gharāvāsaṃ pahāya pabbajitvā nacirasseva arahā ahosi."
    ],
    "innerText": "Padumuttarabuddhassātiādikaṃ āyasmato dhajadāyakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto padumuttarassa bhagavato kāle ekasmiṃ kulagehe nibbatto vuddhimanvāya satthari pasīditvā sundarehi anekehi vatthehi dhajaṃ kārāpetvā dhajapūjaṃ akāsi. So tena puññakammena uppannuppannabhave uccakule nibbatto pūjaniyo ahosi. Aparabhāge imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbatto vuddhimanvāya puttadārehi vaḍḍhitvā mahābhogo yasavā saddhājāto satthari pasanno gharāvāsaṃ pahāya pabbajitvā nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "57"
      },
      ". So pattaarahattaphalo pubbakammaṃ saritvā somanassajāto attano pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "padumuttarabuddhassā"
      },
      "tiādimāha. Tassattho pubbe vuttoyeva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Haṭṭho haṭṭhena cittenā"
      },
      "ti somanassasahagatacittayuttattā haṭṭho paripuṇṇarūpakāyo saddhāsampayuttacittatāya haṭṭhena cittena santuṭṭhena cittenāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhajamāropayiṃ aha"
      },
      "nti dhunāti kampati calatīti dhajaṃ, taṃ dhajaṃ āropayiṃ veḷagge laggetvā pūjesinti attho."
    ],
    "innerText": "57. So pattaarahattaphalo pubbakammaṃ saritvā somanassajāto attano pubbacaritāpadānaṃ pakāsento padumuttarabuddhassātiādimāha. Tassattho pubbe vuttoyeva. Haṭṭho haṭṭhena cittenāti somanassasahagatacittayuttattā haṭṭho paripuṇṇarūpakāyo saddhāsampayuttacittatāya haṭṭhena cittena santuṭṭhena cittenāti attho. Dhajamāropayiṃ ahanti dhunāti kampati calatīti dhajaṃ, taṃ dhajaṃ āropayiṃ veḷagge laggetvā pūjesinti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "58-9"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Patitapattāni gaṇhitvā"
      },
      "ti patitāni bodhipattāni gahetvā ahaṃ bahi chaḍḍesinti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Antosuddhaṃ bahisuddha"
      },
      "nti anto cittasantānanāmakāyato ca bahi cakkhusotādirūpakāyato ca suddhiṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "adhi"
      },
      " visesena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "muttaṃ"
      },
      " kilesato vimuttaṃ anāsavaṃ sambuddhaṃ viya sammukhā uttamaṃ bodhiṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avandiṃ"
      },
      " paṇāmamakāsinti attho. Sesaṃ sabbattha uttānatthamevāti."
    ],
    "innerText": "58-9.Patitapattāni gaṇhitvāti patitāni bodhipattāni gahetvā ahaṃ bahi chaḍḍesinti attho. Antosuddhaṃ bahisuddhanti anto cittasantānanāmakāyato ca bahi cakkhusotādirūpakāyato ca suddhiṃ adhi visesena muttaṃ kilesato vimuttaṃ anāsavaṃ sambuddhaṃ viya sammukhā uttamaṃ bodhiṃ avandiṃ paṇāmamakāsinti attho. Sesaṃ sabbattha uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dhajadāyakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Padumattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Catusaccaṃ pakāsento"
      },
      "tiādikaṃ āyasmato padumattherassa apadānaṃ. Ayampi purimabuddhesu katakusalasambhāro padumuttaramuninā ",
      " dhammapajjote jotamāne ekasmiṃ kulagehe nibbatto gharāvāsaṃ saṇṭhapetvā ",
      " bhogasampannoti pākaṭo. So satthari pasīditvā mahājanena saddhiṃ dhammaṃ suṇanto dhajena saha padumakalāpaṃ gahetvā aṭṭhāsi, sadhajaṃ taṃ padumakalāpaṃ ākāsamukkhipiṃ, taṃ ",
      " acchariyaṃ disvā ativiya somanassajāto ahosi. So yāvajīvaṃ kusalaṃ katvā jīvitapariyosāne sagge nibbatto dhajamiva chakāmāvacare pākaṭo pūjito ca dibbasampattimanubhavitvā manussesu ca cakkavattisampattimanubhavitvā imasmiṃ buddhuppāde vibhavasampanne saddhāsampanne ekasmiṃ kulagehe nibbatto vuddhimanvāya saddhājāto pañcavassikova pabbajitvā nacirasseva arahā hutvā katapuññanāmena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "padumatthero"
      },
      "ti pākaṭo."
    ],
    "innerText": "Catusaccaṃ pakāsentotiādikaṃ āyasmato padumattherassa apadānaṃ. Ayampi purimabuddhesu katakusalasambhāro padumuttaramuninā dhammapajjote jotamāne ekasmiṃ kulagehe nibbatto gharāvāsaṃ saṇṭhapetvā bhogasampannoti pākaṭo. So satthari pasīditvā mahājanena saddhiṃ dhammaṃ suṇanto dhajena saha padumakalāpaṃ gahetvā aṭṭhāsi, sadhajaṃ taṃ padumakalāpaṃ ākāsamukkhipiṃ, taṃ acchariyaṃ disvā ativiya somanassajāto ahosi. So yāvajīvaṃ kusalaṃ katvā jīvitapariyosāne sagge nibbatto dhajamiva chakāmāvacare pākaṭo pūjito ca dibbasampattimanubhavitvā manussesu ca cakkavattisampattimanubhavitvā imasmiṃ buddhuppāde vibhavasampanne saddhāsampanne ekasmiṃ kulagehe nibbatto vuddhimanvāya saddhājāto pañcavassikova pabbajitvā nacirasseva arahā hutvā katapuññanāmena padumattheroti pākaṭo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "67"
      },
      ". Attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "catusaccaṃ pakāsento"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sacca"
      },
      "nti tathaṃ avitathaṃ aviparītaṃ saccaṃ, dukkhasamudayanirodhamaggavasena cattāri saccāni samāhaṭānīti catusaccaṃ, taṃ catusaccaṃ pakāsento loke pākaṭaṃ karontoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Varadhammappavattako"
      },
      "ti uttamadhammappavattako pakāsakoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Amataṃ vuṭṭhi"
      },
      "nti amatamahānibbānavuṭṭhidhāraṃ pavassanto paggharanto sadevakaṃ lokaṃ temento sabbakilesapariḷāhaṃ nibbāpento dhammavassaṃ vassatīti attho."
    ],
    "innerText": "67. Attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento catusaccaṃ pakāsentotiādimāha. Tattha saccanti tathaṃ avitathaṃ aviparītaṃ saccaṃ, dukkhasamudayanirodhamaggavasena cattāri saccāni samāhaṭānīti catusaccaṃ, taṃ catusaccaṃ pakāsento loke pākaṭaṃ karontoti attho. Varadhammappavattakoti uttamadhammappavattako pakāsakoti attho. Amataṃ vuṭṭhinti amatamahānibbānavuṭṭhidhāraṃ pavassanto paggharanto sadevakaṃ lokaṃ temento sabbakilesapariḷāhaṃ nibbāpento dhammavassaṃ vassatīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "68"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sadhajaṃ padumaṃ gayhā"
      },
      "ti dhajena saha ekato katvā padumaṃ padumakalāpaṃ gahetvāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aḍḍhakose ṭhito aha"
      },
      "nti ubho ukkhipitvā ṭhito ahanti attho. Sesaṃ sabbattha uttānatthamevāti."
    ],
    "innerText": "68.Sadhajaṃ padumaṃ gayhāti dhajena saha ekato katvā padumaṃ padumakalāpaṃ gahetvāti attho. Aḍḍhakose ṭhito ahanti ubho ukkhipitvā ṭhito ahanti attho. Sesaṃ sabbattha uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Padumattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Asanabodhiyattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jātiyā sattavassoha"
      },
      "ntiādikaṃ āyasmato asanabodhiyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto tissassa bhagavato kāle aññatarasmiṃ kulagehe nibbatto vuddhippatto sukhappatto sāsane pasanno ",
      " asanabodhito phalaṃ gahetvā tato vuṭṭhitabodhitaruṇe gahetvā bodhiṃ ropesi, yathā na vinassati tathā udakāsiñcanādikammena rakkhitvā pūjesi. So tena puññena devamanussesu sampattiyo anubhavitvā imasmiṃ buddhuppāde kulagehe nibbatto paripakkasambhārattā ",
      " sattavassikova samāno pabbajitvā khuraggeyeva arahattaṃ pāpuṇi, purākatapuññanāmena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asanabodhiyatthero"
      },
      "ti pākaṭo."
    ],
    "innerText": "Jātiyā sattavassohantiādikaṃ āyasmato asanabodhiyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto tissassa bhagavato kāle aññatarasmiṃ kulagehe nibbatto vuddhippatto sukhappatto sāsane pasanno asanabodhito phalaṃ gahetvā tato vuṭṭhitabodhitaruṇe gahetvā bodhiṃ ropesi, yathā na vinassati tathā udakāsiñcanādikammena rakkhitvā pūjesi. So tena puññena devamanussesu sampattiyo anubhavitvā imasmiṃ buddhuppāde kulagehe nibbatto paripakkasambhārattā sattavassikova samāno pabbajitvā khuraggeyeva arahattaṃ pāpuṇi, purākatapuññanāmena asanabodhiyattheroti pākaṭo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "78"
      },
      ". So ",
      " pubbasambhāramanussaritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jātiyā sattavassoha"
      },
      "ntiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jātiyā"
      },
      "ti mātugabbhato nikkhantakālato paṭṭhāyāti attho. Sattavasso paripuṇṇasarado ahaṃ lokanāyakaṃ tissaṃ bhagavantaṃ addasanti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pasannacitto sumano"
      },
      "ti pakārena pasannaanāluḷitaavikampitacitto, sumano sundaramano somanassasahagatacittoti attho."
    ],
    "innerText": "78. So pubbasambhāramanussaritvā somanassajāto pubbacaritāpadānaṃ pakāsento jātiyā sattavassohantiādimāha. Tattha jātiyāti mātugabbhato nikkhantakālato paṭṭhāyāti attho. Sattavasso paripuṇṇasarado ahaṃ lokanāyakaṃ tissaṃ bhagavantaṃ addasanti sambandho. Pasannacitto sumanoti pakārena pasannaanāluḷitaavikampitacitto, sumano sundaramano somanassasahagatacittoti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "79"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tissassāhaṃ bhagavato"
      },
      "ti tikkhattuṃ jātoti tisso, so mātugabbhato, manussajātito, pañcakkhandhato ca mutto hutvā jāto nibbatto buddho jātoti attho. Tassa tissassa bhagavato tādino, lokajeṭṭhassa asanabodhiṃ uttamaṃ ropayinti sambandho."
    ],
    "innerText": "79.Tissassāhaṃ bhagavatoti tikkhattuṃ jātoti tisso, so mātugabbhato, manussajātito, pañcakkhandhato ca mutto hutvā jāto nibbatto buddho jātoti attho. Tassa tissassa bhagavato tādino, lokajeṭṭhassa asanabodhiṃ uttamaṃ ropayinti sambandho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "80"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asano nāmadheyyenā"
      },
      "ti nāmapaññattiyā nāmasaññāya asano nāma asanarukkho bodhi ahosīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dharaṇīruhapādapo"
      },
      "ti vallirukkhapabbatagaṅgāsāgarādayo dhāretīti dharaṇī, kā sā? Pathavī, tassaṃ ruhati patiṭṭhahatīti dharaṇīruho, pādena pivatīti pādapo, pādasaṅkhātena mūlena siñcitodakaṃ pivati āporasaṃ sinehaṃ dhāretīti attho. Dharaṇīruho ca so pādapo cāti dharaṇīruhapādapo, taṃ uttamaṃ asanaṃ bodhiṃ pañca vassāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paricariṃ"
      },
      " posesinti attho."
    ],
    "innerText": "80.Asano nāmadheyyenāti nāmapaññattiyā nāmasaññāya asano nāma asanarukkho bodhi ahosīti attho. Dharaṇīruhapādapoti vallirukkhapabbatagaṅgāsāgarādayo dhāretīti dharaṇī, kā sā? Pathavī, tassaṃ ruhati patiṭṭhahatīti dharaṇīruho, pādena pivatīti pādapo, pādasaṅkhātena mūlena siñcitodakaṃ pivati āporasaṃ sinehaṃ dhāretīti attho. Dharaṇīruho ca so pādapo cāti dharaṇīruhapādapo, taṃ uttamaṃ asanaṃ bodhiṃ pañca vassāni paricariṃ posesinti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "81"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pupphitaṃ pādapaṃ disvā"
      },
      "ti taṃ mayā positaṃ asanabodhirukkhaṃ pupphitaṃ accharayoggabhūtapupphattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abbhutaṃ"
      },
      " lomahaṃsakaraṇaṃ disvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sakaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kammaṃ"
      },
      " attano kammaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pakittento"
      },
      " pakārena kathayanto buddhaseṭṭhassa santikaṃ agamāsinti attho. Sesaṃ sabbattha uttānatthamevāti."
    ],
    "innerText": "81.Pupphitaṃ pādapaṃ disvāti taṃ mayā positaṃ asanabodhirukkhaṃ pupphitaṃ accharayoggabhūtapupphattā abbhutaṃ lomahaṃsakaraṇaṃ disvā sakaṃkammaṃ attano kammaṃ pakittento pakārena kathayanto buddhaseṭṭhassa santikaṃ agamāsinti attho. Sesaṃ sabbattha uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Asanabodhiyattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Chaṭṭhavaggavaṇṇanā samattā."
  }
]