[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "14. Tuvaṭṭakasuttaniddeso"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " tuvaṭṭakasuttaniddesaṃ vakkhati –"
    ],
    "innerText": "Atha tuvaṭṭakasuttaniddesaṃ vakkhati –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "150"
      },
      "."
    ],
    "innerText": "150."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchāmi"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "taṃ ādiccabandhu,"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ādiccabandhū (sī. syā.)]"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vivekaṃ santipadañca mahesi"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mahesiṃ (sī. syā.)]"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": ";"
      }
    ],
    "innerText": "Pucchāmitaṃ ādiccabandhu,[ādiccabandhū (sī. syā.)]vivekaṃ santipadañca mahesi[mahesiṃ (sī. syā.)];"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kathaṃ disvā nibbāti bhikkhu, anupādiyāno lokasmiṃ kiñci."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchāmi taṃ ādiccabandhū"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchā"
      },
      "ti tisso pucchā – adiṭṭhajotanā pucchā, diṭṭhasaṃsandanā pucchā, vimaticchedanā pucchā. Katamā adiṭṭhajotanā pucchā? Pakatiyā lakkhaṇaṃ aññātaṃ hoti adiṭṭhaṃ atulitaṃ atīritaṃ avibhūtaṃ avibhāvitaṃ, tassa ñāṇāya dassanāya tulanāya tīraṇāya vibhāvanāya pañhaṃ pucchati – ayaṃ adiṭṭhajotanā pucchā. Katamā diṭṭhasaṃsandanā pucchā? Pakatiyā lakkhaṇaṃ ñātaṃ hoti diṭṭhaṃ tulitaṃ tīritaṃ vibhūtaṃ vibhāvitaṃ, aññehi paṇḍitehi saddhiṃ saṃsandanatthāya pañhaṃ pucchati – ayaṃ diṭṭhasaṃsandanā pucchā. Katamā vimaticchedanā pucchā? Pakatiyā saṃsayapakkhando ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[saṃsayapakkhanno (sī. syā.)]"
      },
      " hoti vimatipakkhando dveḷhakajāto, ‘‘evaṃ nu kho, na nu kho, kiṃ nu kho, kathaṃ nu kho’’ti so vimaticchedanatthāya pañhaṃ pucchati – ayaṃ vimaticchedanā pucchā. Imā tisso pucchā."
    ],
    "innerText": "Pucchāmi taṃ ādiccabandhūti. Pucchāti tisso pucchā – adiṭṭhajotanā pucchā, diṭṭhasaṃsandanā pucchā, vimaticchedanā pucchā. Katamā adiṭṭhajotanā pucchā? Pakatiyā lakkhaṇaṃ aññātaṃ hoti adiṭṭhaṃ atulitaṃ atīritaṃ avibhūtaṃ avibhāvitaṃ, tassa ñāṇāya dassanāya tulanāya tīraṇāya vibhāvanāya pañhaṃ pucchati – ayaṃ adiṭṭhajotanā pucchā. Katamā diṭṭhasaṃsandanā pucchā? Pakatiyā lakkhaṇaṃ ñātaṃ hoti diṭṭhaṃ tulitaṃ tīritaṃ vibhūtaṃ vibhāvitaṃ, aññehi paṇḍitehi saddhiṃ saṃsandanatthāya pañhaṃ pucchati – ayaṃ diṭṭhasaṃsandanā pucchā. Katamā vimaticchedanā pucchā? Pakatiyā saṃsayapakkhando [saṃsayapakkhanno (sī. syā.)] hoti vimatipakkhando dveḷhakajāto, ‘‘evaṃ nu kho, na nu kho, kiṃ nu kho, kathaṃ nu kho’’ti so vimaticchedanatthāya pañhaṃ pucchati – ayaṃ vimaticchedanā pucchā. Imā tisso pucchā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aparāpi ",
      " tisso pucchā – manussapucchā, amanussapucchā, nimmitapucchā. Katamā ",
      " manussapucchā? Manussā buddhaṃ bhagavantaṃ upasaṅkamitvā pañhaṃ pucchanti, bhikkhū pucchanti, bhikkhuniyo pucchanti, upāsakā pucchanti, upāsikāyo pucchanti, rājāno pucchanti, khattiyā pucchanti, brāhmaṇā pucchanti, vessā pucchanti, suddā pucchanti, gahaṭṭhā pucchanti, pabbajitā pucchanti – ayaṃ manussapucchā. Katamā amanussapucchā? Amanussā buddhaṃ bhagavantaṃ upasaṅkamitvā pañhaṃ pucchanti, nāgā pucchanti, supaṇṇā pucchanti, yakkhā pucchanti, asurā pucchanti, gandhabbā pucchanti, mahārājāno pucchanti, indā pucchanti, brahmāno pucchanti, devatāyo pucchanti – ayaṃ amanussapucchā. Katamā nimmitapucchā? Yaṃ bhagavā rūpaṃ abhinimmināti manomayaṃ sabbaṅgapaccaṅgaṃ ahīnindriyaṃ taṃ so nimmito buddhaṃ bhagavantaṃ upasaṅkamitvā ",
      " pañhaṃ pucchati, bhagavā tassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[natthi sī. syā. potthakesu]"
      },
      " visajjeti – ayaṃ nimmitapucchā. Imā tisso pucchā."
    ],
    "innerText": "Aparāpi tisso pucchā – manussapucchā, amanussapucchā, nimmitapucchā. Katamā manussapucchā? Manussā buddhaṃ bhagavantaṃ upasaṅkamitvā pañhaṃ pucchanti, bhikkhū pucchanti, bhikkhuniyo pucchanti, upāsakā pucchanti, upāsikāyo pucchanti, rājāno pucchanti, khattiyā pucchanti, brāhmaṇā pucchanti, vessā pucchanti, suddā pucchanti, gahaṭṭhā pucchanti, pabbajitā pucchanti – ayaṃ manussapucchā. Katamā amanussapucchā? Amanussā buddhaṃ bhagavantaṃ upasaṅkamitvā pañhaṃ pucchanti, nāgā pucchanti, supaṇṇā pucchanti, yakkhā pucchanti, asurā pucchanti, gandhabbā pucchanti, mahārājāno pucchanti, indā pucchanti, brahmāno pucchanti, devatāyo pucchanti – ayaṃ amanussapucchā. Katamā nimmitapucchā? Yaṃ bhagavā rūpaṃ abhinimmināti manomayaṃ sabbaṅgapaccaṅgaṃ ahīnindriyaṃ taṃ so nimmito buddhaṃ bhagavantaṃ upasaṅkamitvā pañhaṃ pucchati, bhagavā tassa [natthi sī. syā. potthakesu] visajjeti – ayaṃ nimmitapucchā. Imā tisso pucchā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aparāpi ",
      " tisso pucchā – attatthapucchā, paratthapucchā, ubhayatthapucchā. Aparāpi tisso pucchā – diṭṭhadhammikatthapucchā, samparāyikatthapucchā, paramatthapucchā. Aparāpi tisso pucchā – anavajjatthapucchā, nikkilesatthapucchā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[nikkhepatthapucchā (sī. ka.)]"
      },
      ", vodānatthapucchā. Aparāpi tisso pucchā – atītapucchā, anāgatapucchā, paccuppannapucchā. Aparāpi tisso pucchā – ajjhattapucchā, bahiddhāpucchā, ajjhattabahiddhāpucchā. Aparāpi tisso pucchā – kusalapucchā, akusalapucchā, abyākatapucchā. Aparāpi tisso pucchā – khandhapucchā, dhātupucchā, āyatanapucchā. Aparāpi tisso pucchā – satipaṭṭhānapucchā, sammappadhānapucchā, iddhipādapucchā. Aparāpi ",
      " tisso pucchā – indriyapucchā, balapucchā, bojjhaṅgapucchā. Aparāpi tisso pucchā – maggapucchā, phalapucchā, nibbānapucchā."
    ],
    "innerText": "Aparāpi tisso pucchā – attatthapucchā, paratthapucchā, ubhayatthapucchā. Aparāpi tisso pucchā – diṭṭhadhammikatthapucchā, samparāyikatthapucchā, paramatthapucchā. Aparāpi tisso pucchā – anavajjatthapucchā, nikkilesatthapucchā [nikkhepatthapucchā (sī. ka.)], vodānatthapucchā. Aparāpi tisso pucchā – atītapucchā, anāgatapucchā, paccuppannapucchā. Aparāpi tisso pucchā – ajjhattapucchā, bahiddhāpucchā, ajjhattabahiddhāpucchā. Aparāpi tisso pucchā – kusalapucchā, akusalapucchā, abyākatapucchā. Aparāpi tisso pucchā – khandhapucchā, dhātupucchā, āyatanapucchā. Aparāpi tisso pucchā – satipaṭṭhānapucchā, sammappadhānapucchā, iddhipādapucchā. Aparāpi tisso pucchā – indriyapucchā, balapucchā, bojjhaṅgapucchā. Aparāpi tisso pucchā – maggapucchā, phalapucchā, nibbānapucchā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchāmi ta"
      },
      "nti pucchāmi taṃ yācāmi taṃ ajjhesāmi taṃ pasādemi taṃ, ‘‘kathayassu me’’ti – pucchāmi taṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ādiccabandhū"
      },
      "ti. Ādicco vuccati sūriyo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[suriyo (sī. syā.)]"
      },
      ". Sūriyo gotamo gottena, bhagavāpi gotamo gottena, bhagavā sūriyassa gottañātako gottabandhu; tasmā buddho ādiccabandhūti – pucchāmi taṃ ādiccabandhu."
    ],
    "innerText": "Pucchāmi tanti pucchāmi taṃ yācāmi taṃ ajjhesāmi taṃ pasādemi taṃ, ‘‘kathayassu me’’ti – pucchāmi taṃ. Ādiccabandhūti. Ādicco vuccati sūriyo [suriyo (sī. syā.)]. Sūriyo gotamo gottena, bhagavāpi gotamo gottena, bhagavā sūriyassa gottañātako gottabandhu; tasmā buddho ādiccabandhūti – pucchāmi taṃ ādiccabandhu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vivekaṃ santipadañca mahesī"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vivekā"
      },
      "ti tayo vivekā – kāyaviveko ",
      ", cittaviveko, upadhiviveko. Katamo kāyaviveko? Idha ",
      " bhikkhu vivittaṃ senāsanaṃ bhajati araññaṃ rukkhamūlaṃ pabbataṃ kandaraṃ giriguhaṃ susānaṃ vanapatthaṃ abbhokāsaṃ palālapuñjaṃ kāyena vivittena viharati. So eko gacchati, eko tiṭṭhati, eko nisīdati, eko seyyaṃ kappeti, eko gāmaṃ piṇḍāya pavisati, eko paṭikkamati, eko raho nisīdati, eko caṅkamaṃ adhiṭṭhāti, eko carati viharati iriyati vattati pāleti yapeti yāpeti – ayaṃ kāyaviveko."
    ],
    "innerText": "Vivekaṃ santipadañca mahesīti. Vivekāti tayo vivekā – kāyaviveko , cittaviveko, upadhiviveko. Katamo kāyaviveko? Idha bhikkhu vivittaṃ senāsanaṃ bhajati araññaṃ rukkhamūlaṃ pabbataṃ kandaraṃ giriguhaṃ susānaṃ vanapatthaṃ abbhokāsaṃ palālapuñjaṃ kāyena vivittena viharati. So eko gacchati, eko tiṭṭhati, eko nisīdati, eko seyyaṃ kappeti, eko gāmaṃ piṇḍāya pavisati, eko paṭikkamati, eko raho nisīdati, eko caṅkamaṃ adhiṭṭhāti, eko carati viharati iriyati vattati pāleti yapeti yāpeti – ayaṃ kāyaviveko."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katamo cittaviveko? Paṭhamaṃ jhānaṃ samāpannassa nīvaraṇehi cittaṃ vivittaṃ hoti, dutiyaṃ jhānaṃ samāpannassa vitakkavicārehi cittaṃ vivittaṃ hoti, tatiyaṃ jhānaṃ samāpannassa pītiyā cittaṃ vivittaṃ hoti, catutthaṃ jhānaṃ samāpannassa sukhadukkhehi cittaṃ vivittaṃ hoti, ākāsānañcāyatanaṃ samāpannassa rūpasaññāya paṭighasaññāya nānattasaññāya cittaṃ vivittaṃ hoti, viññāṇañcāyatanaṃ samāpannassa ākāsānañcāyatanasaññāya cittaṃ vivittaṃ hoti, ākiñcaññāyatanaṃ ",
      " samāpannassa viññāṇañcāyatanasaññāya cittaṃ vivittaṃ hoti ",
      ", nevasaññānāsaññāyatanaṃ samāpannassa ākiñcaññāyatanasaññāya cittaṃ vivittaṃ hoti. Sotāpannassa sakkāyadiṭṭhiyā vicikicchāya sīlabbataparāmāsā diṭṭhānusayā vicikicchānusayā, tadekaṭṭhehi ca kilesehi cittaṃ vivittaṃ hoti. Sakadāgāmissa oḷārikā kāmarāgasaññojanā ",
      " paṭighasaññojanā oḷārikā kāmarāgānusayā paṭighānusayā, tadekaṭṭhehi ca kilesehi cittaṃ vivittaṃ hoti. Anāgāmissa anusahagatā kāmarāgasaññojanā paṭighasaññojanā anusahagatā kāmarāgānusayā paṭighānusayā, tadekaṭṭhehi ca kilesehi cittaṃ vivittaṃ hoti. Arahato rūparāgā arūparāgā mānā uddhaccā avijjāya mānānusayā bhavarāgānusayā avijjānusayā, tadekaṭṭhehi ca kilesehi bahiddhā ca sabbanimittehi cittaṃ vivittaṃ hoti – ayaṃ cittaviveko."
    ],
    "innerText": "Katamo cittaviveko? Paṭhamaṃ jhānaṃ samāpannassa nīvaraṇehi cittaṃ vivittaṃ hoti, dutiyaṃ jhānaṃ samāpannassa vitakkavicārehi cittaṃ vivittaṃ hoti, tatiyaṃ jhānaṃ samāpannassa pītiyā cittaṃ vivittaṃ hoti, catutthaṃ jhānaṃ samāpannassa sukhadukkhehi cittaṃ vivittaṃ hoti, ākāsānañcāyatanaṃ samāpannassa rūpasaññāya paṭighasaññāya nānattasaññāya cittaṃ vivittaṃ hoti, viññāṇañcāyatanaṃ samāpannassa ākāsānañcāyatanasaññāya cittaṃ vivittaṃ hoti, ākiñcaññāyatanaṃ samāpannassa viññāṇañcāyatanasaññāya cittaṃ vivittaṃ hoti , nevasaññānāsaññāyatanaṃ samāpannassa ākiñcaññāyatanasaññāya cittaṃ vivittaṃ hoti. Sotāpannassa sakkāyadiṭṭhiyā vicikicchāya sīlabbataparāmāsā diṭṭhānusayā vicikicchānusayā, tadekaṭṭhehi ca kilesehi cittaṃ vivittaṃ hoti. Sakadāgāmissa oḷārikā kāmarāgasaññojanā paṭighasaññojanā oḷārikā kāmarāgānusayā paṭighānusayā, tadekaṭṭhehi ca kilesehi cittaṃ vivittaṃ hoti. Anāgāmissa anusahagatā kāmarāgasaññojanā paṭighasaññojanā anusahagatā kāmarāgānusayā paṭighānusayā, tadekaṭṭhehi ca kilesehi cittaṃ vivittaṃ hoti. Arahato rūparāgā arūparāgā mānā uddhaccā avijjāya mānānusayā bhavarāgānusayā avijjānusayā, tadekaṭṭhehi ca kilesehi bahiddhā ca sabbanimittehi cittaṃ vivittaṃ hoti – ayaṃ cittaviveko."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katamo upadhiviveko? ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upadhi"
      },
      " vuccati kilesā ca khandhā ca abhisaṅkhārā ca. Upadhiviveko vuccati amataṃ nibbānaṃ. Yo so sabbasaṅkhārasamatho sabbūpadhipaṭinissaggo taṇhakkhayo virāgo nirodho nibbānaṃ – ayaṃ upadhiviveko. Kāyaviveko ca vivekaṭṭhakāyānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vūpakaṭṭhakāyānaṃ (sī.)]"
      },
      " nekkhammābhiratānaṃ, cittaviveko ca parisuddhacittānaṃ paramavodānapattānaṃ, upadhiviveko ca ",
      " nirupadhīnaṃ puggalānaṃ visaṅkhāragatānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Santī"
      },
      "ti ekena ākārena santipi santipadampi taṃyeva amataṃ nibbānaṃ, yo so sabbasaṅkhārasamatho sabbūpadhipaṭinissaggo taṇhakkhayo virāgo nirodho nibbānaṃ. Vuttañhetaṃ bhagavatā – ‘‘santametaṃ padaṃ, paṇītametaṃ padaṃ, yadidaṃ sabbasaṅkhārasamatho sabbūpadhipaṭinissaggo taṇhakkhayo virāgo nirodho nibbāna’’nti. Atha aparena ",
      " ākārena ye dhammā santādhigamāya ",
      " santiphusanāya santisacchikiriyāya saṃvattanti, seyyathidaṃ – cattāro satipaṭṭhānā, cattāro sammappadhānā, cattāro iddhipādā, pañcindriyāni, pañca balāni, satta bojjhaṅgā, ariyo aṭṭhaṅgiko maggo – ime vuccanti santipadaṃ tāṇapadaṃ leṇapadaṃ saraṇapadaṃ abhayapadaṃ accutapadaṃ amatapadaṃ nibbānapadaṃ."
    ],
    "innerText": "Katamo upadhiviveko? Upadhi vuccati kilesā ca khandhā ca abhisaṅkhārā ca. Upadhiviveko vuccati amataṃ nibbānaṃ. Yo so sabbasaṅkhārasamatho sabbūpadhipaṭinissaggo taṇhakkhayo virāgo nirodho nibbānaṃ – ayaṃ upadhiviveko. Kāyaviveko ca vivekaṭṭhakāyānaṃ [vūpakaṭṭhakāyānaṃ (sī.)] nekkhammābhiratānaṃ, cittaviveko ca parisuddhacittānaṃ paramavodānapattānaṃ, upadhiviveko ca nirupadhīnaṃ puggalānaṃ visaṅkhāragatānaṃ. Santīti ekena ākārena santipi santipadampi taṃyeva amataṃ nibbānaṃ, yo so sabbasaṅkhārasamatho sabbūpadhipaṭinissaggo taṇhakkhayo virāgo nirodho nibbānaṃ. Vuttañhetaṃ bhagavatā – ‘‘santametaṃ padaṃ, paṇītametaṃ padaṃ, yadidaṃ sabbasaṅkhārasamatho sabbūpadhipaṭinissaggo taṇhakkhayo virāgo nirodho nibbāna’’nti. Atha aparena ākārena ye dhammā santādhigamāya santiphusanāya santisacchikiriyāya saṃvattanti, seyyathidaṃ – cattāro satipaṭṭhānā, cattāro sammappadhānā, cattāro iddhipādā, pañcindriyāni, pañca balāni, satta bojjhaṅgā, ariyo aṭṭhaṅgiko maggo – ime vuccanti santipadaṃ tāṇapadaṃ leṇapadaṃ saraṇapadaṃ abhayapadaṃ accutapadaṃ amatapadaṃ nibbānapadaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahesī"
      },
      "ti mahesi bhagavā. Mahantaṃ sīlakkhandhaṃ esī gavesī pariyesīti mahesi, mahantaṃ samādhikkhandhaṃ…pe… mahantaṃ paññākkhandhaṃ… mahantaṃ vimuttikkhandhaṃ… mahantaṃ vimuttiñāṇadassanakkhandhaṃ esī gavesī pariyesīti mahesi; mahato tamokāyassa padālanaṃ, mahato vipallāsassa bhedanaṃ, mahato taṇhāsallassa abbahanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[abbūhanaṃ (sī. syā.), abbhuhanaṃ (ka.)]"
      },
      ", mahato diṭṭhisaṅghātassa viniveṭhanaṃ, mahato mānadhajassa papātanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pavāhanaṃ (syā.)]"
      },
      ", mahato abhisaṅkhārassa vūpasamaṃ, mahato oghassa nittharaṇaṃ, mahato bhārassa nikkhepanaṃ, mahato saṃsāravaṭṭassa upacchedaṃ, mahato santāpassa nibbāpanaṃ ",
      ", mahato pariḷāhassa paṭipassaddhiṃ, mahato dhammadhajassa ussāpanaṃ esī gavesī pariyesīti mahesi, mahante satipaṭṭhāne mahante sammappadhāne mahante iddhipāde mahantāni indriyāni mahantāni balāni mahante bojjhaṅge mahantaṃ ariyaṃ aṭṭhaṅgikaṃ maggaṃ mahantaṃ paramatthaṃ amataṃ nibbānaṃ esī gavesī pariyesīti mahesi; mahesakkhehi vā sattehi esito gavesito pariyesito kahaṃ ",
      " buddho kahaṃ bhagavā kahaṃ devadevo kahaṃ narāsabhoti mahesīti – vivekaṃ santipadañca mahesi."
    ],
    "innerText": "Mahesīti mahesi bhagavā. Mahantaṃ sīlakkhandhaṃ esī gavesī pariyesīti mahesi, mahantaṃ samādhikkhandhaṃ…pe… mahantaṃ paññākkhandhaṃ… mahantaṃ vimuttikkhandhaṃ… mahantaṃ vimuttiñāṇadassanakkhandhaṃ esī gavesī pariyesīti mahesi; mahato tamokāyassa padālanaṃ, mahato vipallāsassa bhedanaṃ, mahato taṇhāsallassa abbahanaṃ [abbūhanaṃ (sī. syā.), abbhuhanaṃ (ka.)], mahato diṭṭhisaṅghātassa viniveṭhanaṃ, mahato mānadhajassa papātanaṃ [pavāhanaṃ (syā.)], mahato abhisaṅkhārassa vūpasamaṃ, mahato oghassa nittharaṇaṃ, mahato bhārassa nikkhepanaṃ, mahato saṃsāravaṭṭassa upacchedaṃ, mahato santāpassa nibbāpanaṃ , mahato pariḷāhassa paṭipassaddhiṃ, mahato dhammadhajassa ussāpanaṃ esī gavesī pariyesīti mahesi, mahante satipaṭṭhāne mahante sammappadhāne mahante iddhipāde mahantāni indriyāni mahantāni balāni mahante bojjhaṅge mahantaṃ ariyaṃ aṭṭhaṅgikaṃ maggaṃ mahantaṃ paramatthaṃ amataṃ nibbānaṃ esī gavesī pariyesīti mahesi; mahesakkhehi vā sattehi esito gavesito pariyesito kahaṃ buddho kahaṃ bhagavā kahaṃ devadevo kahaṃ narāsabhoti mahesīti – vivekaṃ santipadañca mahesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kathaṃ disvā nibbāti bhikkhū"
      },
      "ti. Kathaṃ disvā passitvā tulayitvā ",
      " tīrayitvā vibhāvayitvā vibhūtaṃ katvā attano rāgaṃ nibbāpeti, dosaṃ nibbāpeti, mohaṃ nibbāpeti, kodhaṃ…pe… upanāhaṃ… makkhaṃ… paḷāsaṃ… issaṃ… macchariyaṃ… māyaṃ… sāṭheyyaṃ… thambhaṃ… sārambhaṃ… mānaṃ… atimānaṃ… madaṃ… pamādaṃ… sabbe kilese… sabbe duccarite… sabbe darathe… sabbe pariḷāhe… sabbe santāpe ",
      "… sabbākusalābhisaṅkhāre nibbāpeti sameti upasameti vūpasameti paṭipassambheti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhikkhū"
      },
      "ti puthujjanakalyāṇako vā bhikkhu sekho vā bhikkhūti – kathaṃ disvā nibbāti bhikkhu."
    ],
    "innerText": "Kathaṃ disvā nibbāti bhikkhūti. Kathaṃ disvā passitvā tulayitvā tīrayitvā vibhāvayitvā vibhūtaṃ katvā attano rāgaṃ nibbāpeti, dosaṃ nibbāpeti, mohaṃ nibbāpeti, kodhaṃ…pe… upanāhaṃ… makkhaṃ… paḷāsaṃ… issaṃ… macchariyaṃ… māyaṃ… sāṭheyyaṃ… thambhaṃ… sārambhaṃ… mānaṃ… atimānaṃ… madaṃ… pamādaṃ… sabbe kilese… sabbe duccarite… sabbe darathe… sabbe pariḷāhe… sabbe santāpe … sabbākusalābhisaṅkhāre nibbāpeti sameti upasameti vūpasameti paṭipassambheti. Bhikkhūti puthujjanakalyāṇako vā bhikkhu sekho vā bhikkhūti – kathaṃ disvā nibbāti bhikkhu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anupādiyāno lokasmiṃ kiñcī"
      },
      "ti. Catūhi upādānehi anupādiyamāno agaṇhayamāno aparāmasamāno anabhinivisamāno. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lokasmi"
      },
      "nti apāyaloke manussaloke devaloke, khandhaloke dhātuloke āyatanaloke. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kiñcī"
      },
      "ti kiñci rūpagataṃ vedanāgataṃ saññāgataṃ saṅkhāragataṃ viññāṇagatanti – anupādiyāno lokasmiṃ kiñci."
    ],
    "innerText": "Anupādiyāno lokasmiṃ kiñcīti. Catūhi upādānehi anupādiyamāno agaṇhayamāno aparāmasamāno anabhinivisamāno. Lokasminti apāyaloke manussaloke devaloke, khandhaloke dhātuloke āyatanaloke. Kiñcīti kiñci rūpagataṃ vedanāgataṃ saññāgataṃ saṅkhāragataṃ viññāṇagatanti – anupādiyāno lokasmiṃ kiñci."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha so nimmito –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Pucchāmi taṃ ādiccabandhu, vivekaṃ santipadañca mahesi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kathaṃ disvā nibbāti bhikkhu, anupādiyāno lokasmiṃ kiñcī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "151"
      },
      "."
    ],
    "innerText": "151."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mūlaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "papañcasaṅkhāya, [iti bhagavā]"
      }
    ],
    "innerText": "Mūlaṃpapañcasaṅkhāya, [iti bhagavā]"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mantā asmīti sabbamuparundhe"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sabbamuparuddhe (syā.)]"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": ";"
      }
    ],
    "innerText": "Mantā asmīti sabbamuparundhe[sabbamuparuddhe (syā.)];"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yā kāci taṇhā ajjhattaṃ, tāsaṃ vinayā sadā sato sikkhe."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mūlaṃ papañcasaṅkhāya, [iti bhagavā] mantā asmīti sabbamuparundhe"
      },
      "ti. Papañcāyeva papañcasaṅkhā. Taṇhāpapañcasaṅkhā diṭṭhipapañcasaṅkhā. Katamaṃ taṇhāpapañcassa mūlaṃ? Avijjāmūlaṃ, ayonisomanasikāro ",
      " mūlaṃ, asmimāno mūlaṃ, ahirikaṃ mūlaṃ ",
      ", anottappaṃ mūlaṃ, uddhaccaṃ mūlaṃ – idaṃ taṇhāpapañcassa mūlaṃ. Katamaṃ diṭṭhipapañcassa mūlaṃ? Avijjāmūlaṃ, ayonisomanasikāro mūlaṃ, asmimāno mūlaṃ, ahirikaṃ mūlaṃ, anottappaṃ mūlaṃ, uddhaccaṃ mūlaṃ – idaṃ diṭṭhipapañcassa mūlaṃ."
    ],
    "innerText": "Mūlaṃ papañcasaṅkhāya, [iti bhagavā] mantā asmīti sabbamuparundheti. Papañcāyeva papañcasaṅkhā. Taṇhāpapañcasaṅkhā diṭṭhipapañcasaṅkhā. Katamaṃ taṇhāpapañcassa mūlaṃ? Avijjāmūlaṃ, ayonisomanasikāro mūlaṃ, asmimāno mūlaṃ, ahirikaṃ mūlaṃ , anottappaṃ mūlaṃ, uddhaccaṃ mūlaṃ – idaṃ taṇhāpapañcassa mūlaṃ. Katamaṃ diṭṭhipapañcassa mūlaṃ? Avijjāmūlaṃ, ayonisomanasikāro mūlaṃ, asmimāno mūlaṃ, ahirikaṃ mūlaṃ, anottappaṃ mūlaṃ, uddhaccaṃ mūlaṃ – idaṃ diṭṭhipapañcassa mūlaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhagavā"
      },
      "ti gāravādhivacanaṃ. Api ca bhaggarāgoti bhagavā, bhaggadosoti bhagavā, bhaggamohoti bhagavā, bhaggamānoti bhagavā, bhaggadiṭṭhīti bhagavā, bhaggakaṇḍakoti bhagavā, bhaggakilesoti bhagavā, bhaji vibhaji pavibhaji dhammaratananti bhagavā, bhavānaṃ antakaroti bhagavā, bhāvitakāyo bhāvitasīlo bhāvitacitto bhāvitapaññoti bhagavā; bhāgī vā bhagavā ",
      " araññavanapatthāni ",
      " pantāni senāsanāni appasaddāni appanigghosāni vijanavātāni manussarāhasseyyakāni paṭisallānasāruppānīti bhagavā, bhāgī vā bhagavā cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārānanti bhagavā, bhāgī vā bhagavā attharasassa dhammarasassa vimuttirasassa adhisīlassa adhicittassa adhipaññāyāti bhagavā, bhāgī vā bhagavā catunnaṃ jhānānaṃ catunnaṃ appamaññānaṃ catunnaṃ arūpasamāpattīnanti bhagavā, bhāgī vā bhagavā aṭṭhannaṃ vimokkhānaṃ aṭṭhannaṃ abhibhāyatanānaṃ navannaṃ anupubbavihārasamāpattīnanti bhagavā, bhāgī vā bhagavā dasannaṃ saññābhāvanānaṃ dasannaṃ kasiṇasamāpattīnaṃ ānāpānassatisamādhissa asubhasamāpattiyāti bhagavā, bhāgī vā bhagavā catunnaṃ satipaṭṭhānānaṃ catunnaṃ sammappadhānānaṃ catunnaṃ iddhipādānaṃ pañcannaṃ indriyānaṃ pañcannaṃ balānaṃ sattannaṃ bojjhaṅgānaṃ ariyassa aṭṭhaṅgikassa maggassāti bhagavā, bhāgī vā bhagavā dasannaṃ tathāgatabalānaṃ catunnaṃ vesārajjānaṃ catunnaṃ paṭisambhidānaṃ channaṃ abhiññānaṃ channaṃ buddhadhammānanti ",
      " bhagavā, bhagavāti netaṃ nāmaṃ mātarā kataṃ na pitarā kataṃ na bhātarā kataṃ na bhaginiyā kataṃ na mittāmaccehi kataṃ na ñātisālohitehi kataṃ na samaṇabrāhmaṇehi kataṃ na devatāhi kataṃ; vimokkhantikametaṃ buddhānaṃ bhagavantānaṃ bodhiyā mūle saha sabbaññutañāṇassa paṭilābhā sacchikā paññatti yadidaṃ bhagavāti – mūlaṃ papañcasaṅkhāya iti bhagavā."
    ],
    "innerText": "Bhagavāti gāravādhivacanaṃ. Api ca bhaggarāgoti bhagavā, bhaggadosoti bhagavā, bhaggamohoti bhagavā, bhaggamānoti bhagavā, bhaggadiṭṭhīti bhagavā, bhaggakaṇḍakoti bhagavā, bhaggakilesoti bhagavā, bhaji vibhaji pavibhaji dhammaratananti bhagavā, bhavānaṃ antakaroti bhagavā, bhāvitakāyo bhāvitasīlo bhāvitacitto bhāvitapaññoti bhagavā; bhāgī vā bhagavā araññavanapatthāni pantāni senāsanāni appasaddāni appanigghosāni vijanavātāni manussarāhasseyyakāni paṭisallānasāruppānīti bhagavā, bhāgī vā bhagavā cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārānanti bhagavā, bhāgī vā bhagavā attharasassa dhammarasassa vimuttirasassa adhisīlassa adhicittassa adhipaññāyāti bhagavā, bhāgī vā bhagavā catunnaṃ jhānānaṃ catunnaṃ appamaññānaṃ catunnaṃ arūpasamāpattīnanti bhagavā, bhāgī vā bhagavā aṭṭhannaṃ vimokkhānaṃ aṭṭhannaṃ abhibhāyatanānaṃ navannaṃ anupubbavihārasamāpattīnanti bhagavā, bhāgī vā bhagavā dasannaṃ saññābhāvanānaṃ dasannaṃ kasiṇasamāpattīnaṃ ānāpānassatisamādhissa asubhasamāpattiyāti bhagavā, bhāgī vā bhagavā catunnaṃ satipaṭṭhānānaṃ catunnaṃ sammappadhānānaṃ catunnaṃ iddhipādānaṃ pañcannaṃ indriyānaṃ pañcannaṃ balānaṃ sattannaṃ bojjhaṅgānaṃ ariyassa aṭṭhaṅgikassa maggassāti bhagavā, bhāgī vā bhagavā dasannaṃ tathāgatabalānaṃ catunnaṃ vesārajjānaṃ catunnaṃ paṭisambhidānaṃ channaṃ abhiññānaṃ channaṃ buddhadhammānanti bhagavā, bhagavāti netaṃ nāmaṃ mātarā kataṃ na pitarā kataṃ na bhātarā kataṃ na bhaginiyā kataṃ na mittāmaccehi kataṃ na ñātisālohitehi kataṃ na samaṇabrāhmaṇehi kataṃ na devatāhi kataṃ; vimokkhantikametaṃ buddhānaṃ bhagavantānaṃ bodhiyā mūle saha sabbaññutañāṇassa paṭilābhā sacchikā paññatti yadidaṃ bhagavāti – mūlaṃ papañcasaṅkhāya iti bhagavā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mantā asmīti sabbamuparundhe"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mantā"
      },
      " vuccati paññā. Yā paññā ",
      " pajānanā…pe… amoho dhammavicayo sammādiṭṭhi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asmī"
      },
      "ti rūpe asmīti māno asmīti chando asmīti anusayo; vedanāya… saññāya… saṅkhāresu… viññāṇe asmīti māno asmīti chando asmīti anusayoti. Mūlaṃ papañcasaṅkhāya iti bhagavā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mantā asmīti sabbamuparundhe"
      },
      "ti. Papañcasaṅkhāya mūlañca asmimānañca mantāya sabbaṃ rundheyya uparundheyya nirodheyya vūpasameyya atthaṅgameyya ",
      " paṭipassambheyyāti – mūlaṃ papañcasaṅkhāya iti bhagavā, mantā asmīti sabbamuparundhe."
    ],
    "innerText": "Mantā asmīti sabbamuparundheti. Mantā vuccati paññā. Yā paññā pajānanā…pe… amoho dhammavicayo sammādiṭṭhi. Asmīti rūpe asmīti māno asmīti chando asmīti anusayo; vedanāya… saññāya… saṅkhāresu… viññāṇe asmīti māno asmīti chando asmīti anusayoti. Mūlaṃ papañcasaṅkhāya iti bhagavā. Mantā asmīti sabbamuparundheti. Papañcasaṅkhāya mūlañca asmimānañca mantāya sabbaṃ rundheyya uparundheyya nirodheyya vūpasameyya atthaṅgameyya paṭipassambheyyāti – mūlaṃ papañcasaṅkhāya iti bhagavā, mantā asmīti sabbamuparundhe."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yā kāci taṇhā ajjhatta"
      },
      "nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yā kācī"
      },
      "ti sabbena sabbaṃ sabbathā sabbaṃ asesaṃ nissesaṃ pariyādiyanavacanametaṃ – yā kācīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṇhā"
      },
      "ti rūpataṇhā…pe… dhammataṇhā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ajjhatta"
      },
      "nti ajjhattasamuṭṭhānā vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ajjhattaṃ samuṭṭhāti (syā.)]"
      },
      " sā taṇhāti – ajjhattaṃ ",
      ". Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ajjhattikaṃ"
      },
      " vuccati cittaṃ. Yaṃ cittaṃ mano mānasaṃ hadayaṃ paṇḍaraṃ mano manāyatanaṃ manindriyaṃ viññāṇaṃ viññāṇakkhandho tajjā manoviññāṇadhātu. Cittena sā taṇhā sahagatā sahajātā saṃsaṭṭhā sampayuttā ekuppādā ekanirodhā ekavatthukā ekārammaṇātipi ajjhattanti – yā kāci taṇhā ajjhattaṃ."
    ],
    "innerText": "Yā kāci taṇhā ajjhattanti. Yā kācīti sabbena sabbaṃ sabbathā sabbaṃ asesaṃ nissesaṃ pariyādiyanavacanametaṃ – yā kācīti. Taṇhāti rūpataṇhā…pe… dhammataṇhā. Ajjhattanti ajjhattasamuṭṭhānā vā [ajjhattaṃ samuṭṭhāti (syā.)] sā taṇhāti – ajjhattaṃ . Atha vā ajjhattikaṃ vuccati cittaṃ. Yaṃ cittaṃ mano mānasaṃ hadayaṃ paṇḍaraṃ mano manāyatanaṃ manindriyaṃ viññāṇaṃ viññāṇakkhandho tajjā manoviññāṇadhātu. Cittena sā taṇhā sahagatā sahajātā saṃsaṭṭhā sampayuttā ekuppādā ekanirodhā ekavatthukā ekārammaṇātipi ajjhattanti – yā kāci taṇhā ajjhattaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tāsaṃ vinayā sadā sato sikkhe"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sadā"
      },
      "ti sadā sabbadā ",
      " sabbakālaṃ niccakālaṃ dhuvakālaṃ, satataṃ samitaṃ abbokiṇṇaṃ poṅkhānupoṅkhaṃ udakūmigajātaṃ avīcisantatisahitaṃ phusitaṃ, purebhattaṃ pacchābhattaṃ ",
      ", purimaṃ yāmaṃ majjhimaṃ yāmaṃ pacchimaṃ yāmaṃ, kāḷe juṇhe, vasse hemante gimhe, purime vayokhandhe majjhime vayokhandhe pacchime vayokhandhe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sato"
      },
      "ti catūhi kāraṇehi sato – kāye kāyānupassanāsatipaṭṭhānaṃ bhāvento sato, vedanāsu…pe… citte…pe… dhammesu dhammānupassanāsatipaṭṭhānaṃ bhāvento sato. Aparehipi catūhi kāraṇehi sato – asati parivajjanāya sato, satikaraṇīyānaṃ dhammānaṃ katattā sato, satipaṭipakkhānaṃ dhammānaṃ hatattā sato, satinimittānaṃ asammuṭṭhattā sato. Aparehipi catūhi kāraṇehi sato – satiyā samannāgatattā sato, satiyā vasitattā sato, satiyā pāguññatāya sato, satiyā apaccorohanatāya sato. Aparehipi catūhi kāraṇehi sato – sattattā sato, santattā sato, samitattā sato, santadhammasamannāgatattā sato. Buddhānussatiyā sato, dhammānussatiyā sato, saṅghānussatiyā sato, sīlānussatiyā sato, cāgānussatiyā sato, devatānussatiyā sato, ānāpānassatiyā sato, maraṇassatiyā sato, kāyagatāsatiyā sato, upasamānussatiyā sato. Yā sati anussati paṭissati, sati saraṇatā dhāraṇatā apilāpanatā asammussanatā, sati satindriyaṃ satibalaṃ sammāsati satisambojjhaṅgo ekāyanamaggo – ayaṃ vuccati sati. Imāya satiyā upeto samupeto, upagato samupagato, upapanno samupapanno, samannāgato so vuccati sato."
    ],
    "innerText": "Tāsaṃ vinayā sadā sato sikkheti. Sadāti sadā sabbadā sabbakālaṃ niccakālaṃ dhuvakālaṃ, satataṃ samitaṃ abbokiṇṇaṃ poṅkhānupoṅkhaṃ udakūmigajātaṃ avīcisantatisahitaṃ phusitaṃ, purebhattaṃ pacchābhattaṃ , purimaṃ yāmaṃ majjhimaṃ yāmaṃ pacchimaṃ yāmaṃ, kāḷe juṇhe, vasse hemante gimhe, purime vayokhandhe majjhime vayokhandhe pacchime vayokhandhe. Satoti catūhi kāraṇehi sato – kāye kāyānupassanāsatipaṭṭhānaṃ bhāvento sato, vedanāsu…pe… citte…pe… dhammesu dhammānupassanāsatipaṭṭhānaṃ bhāvento sato. Aparehipi catūhi kāraṇehi sato – asati parivajjanāya sato, satikaraṇīyānaṃ dhammānaṃ katattā sato, satipaṭipakkhānaṃ dhammānaṃ hatattā sato, satinimittānaṃ asammuṭṭhattā sato. Aparehipi catūhi kāraṇehi sato – satiyā samannāgatattā sato, satiyā vasitattā sato, satiyā pāguññatāya sato, satiyā apaccorohanatāya sato. Aparehipi catūhi kāraṇehi sato – sattattā sato, santattā sato, samitattā sato, santadhammasamannāgatattā sato. Buddhānussatiyā sato, dhammānussatiyā sato, saṅghānussatiyā sato, sīlānussatiyā sato, cāgānussatiyā sato, devatānussatiyā sato, ānāpānassatiyā sato, maraṇassatiyā sato, kāyagatāsatiyā sato, upasamānussatiyā sato. Yā sati anussati paṭissati, sati saraṇatā dhāraṇatā apilāpanatā asammussanatā, sati satindriyaṃ satibalaṃ sammāsati satisambojjhaṅgo ekāyanamaggo – ayaṃ vuccati sati. Imāya satiyā upeto samupeto, upagato samupagato, upapanno samupapanno, samannāgato so vuccati sato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sikkhe"
      },
      "ti ",
      " tisso sikkhā – adhisīlasikkhā, adhicittasikkhā, adhipaññāsikkhā. Katamā ",
      " adhisīlasikkhā? Idha bhikkhu sīlavā hoti, pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno, aṇumattesu vajjesu ",
      " bhayadassāvī, samādāya sikkhati sikkhāpadesu, khuddako sīlakkhandho… mahanto ",
      " sīlakkhandho, sīlaṃ patiṭṭhā ādi caraṇaṃ saṃyamo saṃvaro mukhaṃ pamukhaṃ kusalānaṃ dhammānaṃ samāpattiyā – ayaṃ adhisīlasikkhā."
    ],
    "innerText": "Sikkheti tisso sikkhā – adhisīlasikkhā, adhicittasikkhā, adhipaññāsikkhā. Katamā adhisīlasikkhā? Idha bhikkhu sīlavā hoti, pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno, aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu, khuddako sīlakkhandho… mahanto sīlakkhandho, sīlaṃ patiṭṭhā ādi caraṇaṃ saṃyamo saṃvaro mukhaṃ pamukhaṃ kusalānaṃ dhammānaṃ samāpattiyā – ayaṃ adhisīlasikkhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katamā adhicittasikkhā? Idha bhikkhu vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati. Vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja viharati. Pītiyā ca virāgā upekkhako ca viharati sato ca sampajāno sukhañca kāyena paṭisaṃvedeti, yaṃ taṃ ariyā ācikkhanti ‘‘upekkhako satimā sukhavihārī’’ti tatiyaṃ jhānaṃ upasampajja viharati. Sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ atthaṅgamā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "adukkhamasukhaṃ"
      },
      " upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharati – ayaṃ adhicittasikkhā."
    ],
    "innerText": "Katamā adhicittasikkhā? Idha bhikkhu vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati. Vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja viharati. Pītiyā ca virāgā upekkhako ca viharati sato ca sampajāno sukhañca kāyena paṭisaṃvedeti, yaṃ taṃ ariyā ācikkhanti ‘‘upekkhako satimā sukhavihārī’’ti tatiyaṃ jhānaṃ upasampajja viharati. Sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharati – ayaṃ adhicittasikkhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katamā adhipaññāsikkhā? Idha bhikkhu paññavā hoti, udayatthagāminiyā paññāya samannāgato ariyāya nibbedhikāya sammādukkhakkhayagāminiyā. So idaṃ dukkhanti yathābhūtaṃ pajānāti, ayaṃ dukkhasamudayoti yathābhūtaṃ pajānāti, ayaṃ dukkhanirodhoti yathābhūtaṃ pajānāti ",
      ", ayaṃ dukkhanirodhagāminī paṭipadāti yathābhūtaṃ pajānāti, ime āsavāti yathābhūtaṃ pajānāti, ayaṃ āsavasamudayoti yathābhūtaṃ pajānāti, ayaṃ āsavanirodhoti yathābhūtaṃ pajānāti, ayaṃ āsavanirodhagāminī paṭipadāti yathābhūtaṃ pajānāti – ayaṃ adhipaññāsikkhā."
    ],
    "innerText": "Katamā adhipaññāsikkhā? Idha bhikkhu paññavā hoti, udayatthagāminiyā paññāya samannāgato ariyāya nibbedhikāya sammādukkhakkhayagāminiyā. So idaṃ dukkhanti yathābhūtaṃ pajānāti, ayaṃ dukkhasamudayoti yathābhūtaṃ pajānāti, ayaṃ dukkhanirodhoti yathābhūtaṃ pajānāti , ayaṃ dukkhanirodhagāminī paṭipadāti yathābhūtaṃ pajānāti, ime āsavāti yathābhūtaṃ pajānāti, ayaṃ āsavasamudayoti yathābhūtaṃ pajānāti, ayaṃ āsavanirodhoti yathābhūtaṃ pajānāti, ayaṃ āsavanirodhagāminī paṭipadāti yathābhūtaṃ pajānāti – ayaṃ adhipaññāsikkhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tāsaṃ vinayā sadā sato sikkhe"
      },
      "ti. Tāsaṃ taṇhānaṃ vinayāya paṭivinayāya pahānāya vūpasamāya paṭinissaggāya paṭipassaddhiyā adhisīlampi sikkheyya, adhicittampi sikkheyya, adhipaññampi sikkheyya; imā tisso sikkhāyo āvajjanto sikkheyya, pajānanto sikkheyya, passanto ",
      " sikkheyya, paccavekkhanto sikkheyya, cittaṃ adhiṭṭhahanto sikkheyya, saddhāya adhimuccanto sikkheyya, vīriyaṃ paggaṇhanto sikkheyya, satiṃ upaṭṭhapento sikkheyya, cittaṃ samādahanto sikkheyya, paññāya pajānanto sikkheyya, abhiññeyyaṃ abhijānanto sikkheyya, pariññeyyaṃ parijānanto sikkheyya, pahātabbaṃ pajahanto sikkheyya, bhāvetabbaṃ bhāvento sikkheyya, sacchikātabbaṃ ",
      " sacchikaronto sikkheyya ācareyya samācareyya samādāya vatteyyāti – tāsaṃ vinayā sadā sato sikkhe."
    ],
    "innerText": "Tāsaṃ vinayā sadā sato sikkheti. Tāsaṃ taṇhānaṃ vinayāya paṭivinayāya pahānāya vūpasamāya paṭinissaggāya paṭipassaddhiyā adhisīlampi sikkheyya, adhicittampi sikkheyya, adhipaññampi sikkheyya; imā tisso sikkhāyo āvajjanto sikkheyya, pajānanto sikkheyya, passanto sikkheyya, paccavekkhanto sikkheyya, cittaṃ adhiṭṭhahanto sikkheyya, saddhāya adhimuccanto sikkheyya, vīriyaṃ paggaṇhanto sikkheyya, satiṃ upaṭṭhapento sikkheyya, cittaṃ samādahanto sikkheyya, paññāya pajānanto sikkheyya, abhiññeyyaṃ abhijānanto sikkheyya, pariññeyyaṃ parijānanto sikkheyya, pahātabbaṃ pajahanto sikkheyya, bhāvetabbaṃ bhāvento sikkheyya, sacchikātabbaṃ sacchikaronto sikkheyya ācareyya samācareyya samādāya vatteyyāti – tāsaṃ vinayā sadā sato sikkhe."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tenāha ",
      " bhagavā –"
    ],
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Mūlaṃ papañcasaṅkhāya, [iti bhagavā]"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Mantā asmīti sabbamuparundhe;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yā kāci taṇhā ajjhattaṃ, tāsaṃ vinayā sadā sato sikkhe’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "152"
      },
      "."
    ],
    "innerText": "152."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kiñci dhammamabhijaññā, ajjhattaṃ atha vāpi bahiddhā;"
      }
    ],
    "innerText": "Yaṃkiñci dhammamabhijaññā, ajjhattaṃ atha vāpi bahiddhā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Na tena thāmaṃ kubbetha, na hi sā nibbuti sataṃ vuttā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yaṃ kiñci dhammamabhijaññā ajjhatta"
      },
      "nti. Yaṃ kiñci attano guṇaṃ jāneyya kusale vā dhamme abyākate vā dhamme. Katame attano guṇā? Uccā kulā pabbajito vā assaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[assa (syā.)]"
      },
      ", mahābhogakulā pabbajito vā assaṃ, uḷārabhogakulā pabbajito vā assaṃ, ñāto yasassī sagahaṭṭhapabbajitānanti vā assaṃ, lābhimhi cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārānanti vā assaṃ, suttantiko vā assaṃ, vinayadharo vā assaṃ, dhammakathiko vā assaṃ, āraññiko vā assaṃ, piṇḍapātiko vā assaṃ, paṃsukūliko vā assaṃ, tecīvariko vā assaṃ, sapadānacāriko vā assaṃ, khalupacchābhattiko vā assaṃ, nesajjiko vā assaṃ, yathāsanthatiko vā assaṃ, paṭhamassa jhānassa lābhīti vā assaṃ, dutiyassa jhānassa lābhīti vā assaṃ, tatiyassa jhānassa ",
      " lābhīti vā assaṃ, catutthassa jhānassa lābhīti vā assaṃ, ākāsānañcāyatanasamāpattiyā lābhīti vā assaṃ, viññāṇañcāyatanasamāpattiyā… ākiñcaññāyatanasamāpattiyā… nevasaññānāsaññāyatanasamāpattiyā lābhīti vā assaṃ – ime vuccanti attano guṇā ",
      ". Yaṃ kiñci attano guṇaṃ jāneyya ājāneyya vijāneyya paṭivijāneyya paṭivijjheyyāti – yaṃ kiñci dhammamabhijaññā ajjhattaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atha vāpi bahiddhā"
      },
      "ti. Upajjhāyassa vā ācariyassa vā te guṇā assūti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[assūti ajjhattaṃ (bahūsu)]"
      },
      " – atha vāpi bahiddhā."
    ],
    "innerText": "Yaṃ kiñci dhammamabhijaññā ajjhattanti. Yaṃ kiñci attano guṇaṃ jāneyya kusale vā dhamme abyākate vā dhamme. Katame attano guṇā? Uccā kulā pabbajito vā assaṃ [assa (syā.)], mahābhogakulā pabbajito vā assaṃ, uḷārabhogakulā pabbajito vā assaṃ, ñāto yasassī sagahaṭṭhapabbajitānanti vā assaṃ, lābhimhi cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārānanti vā assaṃ, suttantiko vā assaṃ, vinayadharo vā assaṃ, dhammakathiko vā assaṃ, āraññiko vā assaṃ, piṇḍapātiko vā assaṃ, paṃsukūliko vā assaṃ, tecīvariko vā assaṃ, sapadānacāriko vā assaṃ, khalupacchābhattiko vā assaṃ, nesajjiko vā assaṃ, yathāsanthatiko vā assaṃ, paṭhamassa jhānassa lābhīti vā assaṃ, dutiyassa jhānassa lābhīti vā assaṃ, tatiyassa jhānassa lābhīti vā assaṃ, catutthassa jhānassa lābhīti vā assaṃ, ākāsānañcāyatanasamāpattiyā lābhīti vā assaṃ, viññāṇañcāyatanasamāpattiyā… ākiñcaññāyatanasamāpattiyā… nevasaññānāsaññāyatanasamāpattiyā lābhīti vā assaṃ – ime vuccanti attano guṇā . Yaṃ kiñci attano guṇaṃ jāneyya ājāneyya vijāneyya paṭivijāneyya paṭivijjheyyāti – yaṃ kiñci dhammamabhijaññā ajjhattaṃ. Atha vāpi bahiddhāti. Upajjhāyassa vā ācariyassa vā te guṇā assūti [assūti ajjhattaṃ (bahūsu)] – atha vāpi bahiddhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tena thāmaṃ kubbethā"
      },
      "ti. Attano vā guṇena paresaṃ vā guṇena thāmaṃ na kareyya, thambhaṃ na kareyya, mānaṃ na kareyya, unnatiṃ na kareyya, unnamaṃ na kareyya, na tena mānaṃ janeyya, na tena thaddho assa patthaddho paggahitasiroti – na tena thāmaṃ kubbetha."
    ],
    "innerText": "Natena thāmaṃ kubbethāti. Attano vā guṇena paresaṃ vā guṇena thāmaṃ na kareyya, thambhaṃ na kareyya, mānaṃ na kareyya, unnatiṃ na kareyya, unnamaṃ na kareyya, na tena mānaṃ janeyya, na tena thaddho assa patthaddho paggahitasiroti – na tena thāmaṃ kubbetha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na hi sā nibbuti sataṃ vuttā"
      },
      "ti. Satānaṃ santānaṃ sappurisānaṃ buddhānaṃ buddhasāvakānaṃ paccekabuddhānaṃ sā nibbutīti na vuttā na pavuttā na ācikkhitā na desitā na paññapitā ",
      " na paṭṭhapitā na vivaṭā na vibhattā na uttānīkatā nappakāsitāti – na hi sā nibbuti sataṃ vuttā."
    ],
    "innerText": "Na hi sā nibbuti sataṃ vuttāti. Satānaṃ santānaṃ sappurisānaṃ buddhānaṃ buddhasāvakānaṃ paccekabuddhānaṃ sā nibbutīti na vuttā na pavuttā na ācikkhitā na desitā na paññapitā na paṭṭhapitā na vivaṭā na vibhattā na uttānīkatā nappakāsitāti – na hi sā nibbuti sataṃ vuttā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yaṃ kiñci dhammamabhijaññā, ajjhattaṃ atha vāpi bahiddhā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Na tena thāmaṃ kubbetha, na hi sā nibbuti sataṃ vuttā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "153"
      },
      "."
    ],
    "innerText": "153."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Seyyo na tena maññeyya, nīceyyo atha vāpi sarikkho;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Phuṭṭho"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anekarūpehi, nātumānaṃ vikappayaṃ tiṭṭhe."
      }
    ],
    "innerText": "Phuṭṭhoanekarūpehi, nātumānaṃ vikappayaṃ tiṭṭhe."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Seyyo na tena maññeyyā"
      },
      "ti. ‘‘Seyyohamasmī’’ti atimānaṃ na janeyya jātiyā vā gottena vā kolaputtiyena vā vaṇṇapokkharatāya ",
      " vā dhanena vā ajjhenena vā kammāyatanena vā sippāyatanena vā vijjāṭṭhānena vā sutena vā paṭibhānena vā aññataraññatarena vā vatthunāti – seyyo na tena maññeyya."
    ],
    "innerText": "Seyyo na tena maññeyyāti. ‘‘Seyyohamasmī’’ti atimānaṃ na janeyya jātiyā vā gottena vā kolaputtiyena vā vaṇṇapokkharatāya vā dhanena vā ajjhenena vā kammāyatanena vā sippāyatanena vā vijjāṭṭhānena vā sutena vā paṭibhānena vā aññataraññatarena vā vatthunāti – seyyo na tena maññeyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nīceyyo atha vāpi sarikkho"
      },
      "ti. ‘‘Hīnohamasmī’’ti omānaṃ na janeyya jātiyā vā gottena vā…pe… aññataraññatarena vā vatthunā. ‘‘Sadisohamasmī’’ti mānaṃ na janeyya jātiyā vā gottena vā kolaputtiyena vā vaṇṇapokkharatāya vā dhanena vā ajjhenena vā kammāyatanena vā sippāyatanena vā vijjāṭṭhānena vā sutena vā paṭibhānena vā aññataraññatarena vā vatthunāti – nīceyyo atha vāpi sarikkho."
    ],
    "innerText": "Nīceyyo atha vāpi sarikkhoti. ‘‘Hīnohamasmī’’ti omānaṃ na janeyya jātiyā vā gottena vā…pe… aññataraññatarena vā vatthunā. ‘‘Sadisohamasmī’’ti mānaṃ na janeyya jātiyā vā gottena vā kolaputtiyena vā vaṇṇapokkharatāya vā dhanena vā ajjhenena vā kammāyatanena vā sippāyatanena vā vijjāṭṭhānena vā sutena vā paṭibhānena vā aññataraññatarena vā vatthunāti – nīceyyo atha vāpi sarikkho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Phuṭṭho anekarūpehī"
      },
      "ti. Anekavidhehi ākārehi phuṭṭho pareto samohito samannāgatoti – phuṭṭho anekarūpehi."
    ],
    "innerText": "Phuṭṭho anekarūpehīti. Anekavidhehi ākārehi phuṭṭho pareto samohito samannāgatoti – phuṭṭho anekarūpehi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nātumānaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vikappayaṃ tiṭṭhe"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ātumā"
      },
      " vuccati attā. Attānaṃ kappento vikappento vikappaṃ āpajjanto na tiṭṭheyyāti – nātumānaṃ vikappayaṃ tiṭṭhe."
    ],
    "innerText": "Nātumānaṃvikappayaṃ tiṭṭheti. Ātumā vuccati attā. Attānaṃ kappento vikappento vikappaṃ āpajjanto na tiṭṭheyyāti – nātumānaṃ vikappayaṃ tiṭṭhe."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Seyyo ",
      " na tena maññeyya, nīceyyo atha vāpi sarikkho;"
    ],
    "innerText": "‘‘Seyyo na tena maññeyya, nīceyyo atha vāpi sarikkho;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Phuṭṭho anekarūpehi, nātumānaṃ vikappayaṃ tiṭṭhe’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "154"
      },
      "."
    ],
    "innerText": "154."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Ajjhattamevupasame , na aññato bhikkhu santimeseyya;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ajjhattaṃ upasantassa, natthi attā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[attaṃ (syā.)]"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kuto nirattā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[nirattaṃ (syā.)]"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vā."
      }
    ],
    "innerText": "Ajjhattaṃ upasantassa, natthi attā[attaṃ (syā.)]kuto nirattā[nirattaṃ (syā.)]vā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ajjhattamevupasame"
      },
      "ti. Ajjhattaṃ rāgaṃ sameyya, dosaṃ sameyya, mohaṃ sameyya, kodhaṃ…pe… upanāhaṃ… makkhaṃ… paḷāsaṃ… issaṃ… macchariyaṃ… māyaṃ… sāṭheyyaṃ… thambhaṃ… sārambhaṃ ",
      " … mānaṃ… atimānaṃ… madaṃ… pamādaṃ… sabbe kilese… sabbe duccarite… sabbe darathe… sabbe pariḷāhe… sabbe santāpe… sabbākusalābhisaṅkhāre sameyya upasameyya vūpasameyya nibbāpeyya paṭipassambheyyāti – ajjhattamevupasame."
    ],
    "innerText": "Ajjhattamevupasameti. Ajjhattaṃ rāgaṃ sameyya, dosaṃ sameyya, mohaṃ sameyya, kodhaṃ…pe… upanāhaṃ… makkhaṃ… paḷāsaṃ… issaṃ… macchariyaṃ… māyaṃ… sāṭheyyaṃ… thambhaṃ… sārambhaṃ … mānaṃ… atimānaṃ… madaṃ… pamādaṃ… sabbe kilese… sabbe duccarite… sabbe darathe… sabbe pariḷāhe… sabbe santāpe… sabbākusalābhisaṅkhāre sameyya upasameyya vūpasameyya nibbāpeyya paṭipassambheyyāti – ajjhattamevupasame."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na aññato bhikkhu santimeseyyā"
      },
      "ti. Aññato asuddhimaggena, micchāpaṭipadāya, aniyyānapatena, aññatra satipaṭṭhānehi, aññatra sammappadhānehi, aññatra iddhipādehi, aññatra indriyehi, aññatra balehi, aññatra bojjhaṅgehi, aññatra ariyā aṭṭhaṅgikā maggā santiṃ upasantiṃ vūpasantiṃ nibbutiṃ paṭipassaddhiṃ na eseyya na gaveseyya na pariyeseyyāti – na aññato bhikkhu santimeseyya."
    ],
    "innerText": "Na aññato bhikkhu santimeseyyāti. Aññato asuddhimaggena, micchāpaṭipadāya, aniyyānapatena, aññatra satipaṭṭhānehi, aññatra sammappadhānehi, aññatra iddhipādehi, aññatra indriyehi, aññatra balehi, aññatra bojjhaṅgehi, aññatra ariyā aṭṭhaṅgikā maggā santiṃ upasantiṃ vūpasantiṃ nibbutiṃ paṭipassaddhiṃ na eseyya na gaveseyya na pariyeseyyāti – na aññato bhikkhu santimeseyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ajjhattaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upasantassā"
      },
      "ti. Ajjhattaṃ rāgaṃ santassa, dosaṃ santassa, mohaṃ santassa…pe… sabbākusalābhisaṅkhāre santassa upasantassa vūpasantassa nibbutassa paṭipassaddhiyāti – ajjhattaṃ upasantassa."
    ],
    "innerText": "Ajjhattaṃupasantassāti. Ajjhattaṃ rāgaṃ santassa, dosaṃ santassa, mohaṃ santassa…pe… sabbākusalābhisaṅkhāre santassa upasantassa vūpasantassa nibbutassa paṭipassaddhiyāti – ajjhattaṃ upasantassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Natthi attā kuto nirattā vā"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Natthī"
      },
      "ti paṭikkhepo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attā"
      },
      "ti attadiṭṭhi natthi; ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nirattā"
      },
      "ti ucchedadiṭṭhi natthi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attā"
      },
      "ti gahitaṃ natthi; ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nirattā"
      },
      "ti muñcitabbaṃ natthi. Yassatthi gahitaṃ, tassatthi muñcitabbaṃ. Tassa gahitaṃ gāhaṃ ",
      " muñcanaṃ samatikkanto arahā vuddhipārihānivītivatto. So vuṭṭhavāso ciṇṇacaraṇo…pe… jātimaraṇasaṃsāro, natthi tassa punabbhavoti – natthi attā kuto nirattā vā."
    ],
    "innerText": "Natthi attā kuto nirattā vāti. Natthīti paṭikkhepo. Attāti attadiṭṭhi natthi; nirattāti ucchedadiṭṭhi natthi. Attāti gahitaṃ natthi; nirattāti muñcitabbaṃ natthi. Yassatthi gahitaṃ, tassatthi muñcitabbaṃ. Tassa gahitaṃ gāhaṃ muñcanaṃ samatikkanto arahā vuddhipārihānivītivatto. So vuṭṭhavāso ciṇṇacaraṇo…pe… jātimaraṇasaṃsāro, natthi tassa punabbhavoti – natthi attā kuto nirattā vā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ajjhattamevupasame, na aññato bhikkhu santimeseyya;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ajjhattaṃ upasantassa, natthi attā kuto nirattā vā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "155"
      },
      "."
    ],
    "innerText": "155."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Majjhe"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yathā samuddassa, ūmi no jāyatī ṭhito hoti;"
      }
    ],
    "innerText": "Majjheyathā samuddassa, ūmi no jāyatī ṭhito hoti;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ ṭhito anejassa, ussadaṃ bhikkhu na kareyya"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kare (sī.)]"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kuhiñci."
      }
    ],
    "innerText": "Evaṃ ṭhito anejassa, ussadaṃ bhikkhu na kareyya[kare (sī.)]kuhiñci."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Majjhe yathā samuddassa, ūmi no jāyatī ṭhito hotī"
      },
      "ti. Samuddo caturāsītiyojanasahassāni ubbedhena gambhīro. Heṭṭhā cattārīsayojanasahassāni ",
      " udakaṃ macchakacchapehi kampati. Upari cattārīsayojanasahassāni udakaṃ vātehi kampati. Majjhe cattārīsayojanasahassāni udakaṃ na kampati na vikampati na calati na vedhati nappavedhati na sampavedhati. Anerito aghaṭṭito acalito aluḷito abhanto vūpasanto tatra ūmi no jāyati, ṭhito hoti samuddoti. Evampi majjhe yathā samuddassa ūmi no jāyatī ṭhito hoti."
    ],
    "innerText": "Majjhe yathā samuddassa, ūmi no jāyatī ṭhito hotīti. Samuddo caturāsītiyojanasahassāni ubbedhena gambhīro. Heṭṭhā cattārīsayojanasahassāni udakaṃ macchakacchapehi kampati. Upari cattārīsayojanasahassāni udakaṃ vātehi kampati. Majjhe cattārīsayojanasahassāni udakaṃ na kampati na vikampati na calati na vedhati nappavedhati na sampavedhati. Anerito aghaṭṭito acalito aluḷito abhanto vūpasanto tatra ūmi no jāyati, ṭhito hoti samuddoti. Evampi majjhe yathā samuddassa ūmi no jāyatī ṭhito hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha vā sattannaṃ pabbatānaṃ antarikāsu sattasīdantarā mahāsamuddā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sīdantarasamuddo (syā.)]"
      },
      " Tatra udakaṃ na kampati na vikampati na calati na vedhati nappavedhati na sampavedhati. Anerito aghaṭṭito acalito aluḷito abhanto vūpasanto tatra ūmi no jāyati, ṭhito hoti samuddoti. Evampi majjhe yathā samuddassa ūmi no jāyatī ṭhito hoti."
    ],
    "innerText": "Atha vā sattannaṃ pabbatānaṃ antarikāsu sattasīdantarā mahāsamuddā. [sīdantarasamuddo (syā.)] Tatra udakaṃ na kampati na vikampati na calati na vedhati nappavedhati na sampavedhati. Anerito aghaṭṭito acalito aluḷito abhanto vūpasanto tatra ūmi no jāyati, ṭhito hoti samuddoti. Evampi majjhe yathā samuddassa ūmi no jāyatī ṭhito hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ ṭhito anejassā"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Eva"
      },
      "nti opammasampaṭipādanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ṭhito"
      },
      "ti lābhepi na kampati, alābhepi na kampati, yasepi na kampati, ayasepi na kampati, pasaṃsāyapi na kampati, nindāyapi na kampati, sukhepi na kampati, dukkhepi na kampati na vikampati na calati na vedhati nappavedhati na sampavedhatīti – evaṃ ṭhito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anejassā"
      },
      "ti ejā vuccati taṇhā. Yo rāgo ",
      " sārāgo…pe… abhijjhā lobho akusalamūlaṃ. Yassesā ejā taṇhā pahīnā ucchinnā samucchinnā vūpasantā paṭipassaddhā abhabbuppattikā ñāṇagginā daḍḍhā, so vuccati anejo. Ejāya pahīnattā anejo ",
      "; so lābhepi na iñjati, alābhepi na iñjati, yasepi na iñjati, ayasepi ",
      " na iñjati, pasaṃsāyapi na iñjati, nindāyapi na iñjati, sukhepi na iñjati, dukkhepi na iñjati, na calati na vedhati nappavedhati na sampavedhatīti – evaṃ ṭhito anejassa."
    ],
    "innerText": "Evaṃ ṭhito anejassāti. Evanti opammasampaṭipādanaṃ. Ṭhitoti lābhepi na kampati, alābhepi na kampati, yasepi na kampati, ayasepi na kampati, pasaṃsāyapi na kampati, nindāyapi na kampati, sukhepi na kampati, dukkhepi na kampati na vikampati na calati na vedhati nappavedhati na sampavedhatīti – evaṃ ṭhito. Anejassāti ejā vuccati taṇhā. Yo rāgo sārāgo…pe… abhijjhā lobho akusalamūlaṃ. Yassesā ejā taṇhā pahīnā ucchinnā samucchinnā vūpasantā paṭipassaddhā abhabbuppattikā ñāṇagginā daḍḍhā, so vuccati anejo. Ejāya pahīnattā anejo ; so lābhepi na iñjati, alābhepi na iñjati, yasepi na iñjati, ayasepi na iñjati, pasaṃsāyapi na iñjati, nindāyapi na iñjati, sukhepi na iñjati, dukkhepi na iñjati, na calati na vedhati nappavedhati na sampavedhatīti – evaṃ ṭhito anejassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ussadaṃ bhikkhu na kareyya kuhiñcī"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ussadā"
      },
      "ti sattussadā – rāgussadaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[rāgussado (syā.)]"
      },
      ", dosussadaṃ, mohussadaṃ, mānussadaṃ, diṭṭhussadaṃ, kilesussadaṃ, kammussadaṃ na kareyya na janeyya na sañjaneyya na ",
      " nibbatteyya nābhinibbatteyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kuhiñcī"
      },
      "ti kuhiñci kismiñci katthaci ajjhattaṃ vā bahiddhā vā ajjhattabahiddhā vāti – ussadaṃ bhikkhu na kareyya kuhiñci."
    ],
    "innerText": "Ussadaṃ bhikkhu na kareyya kuhiñcīti. Ussadāti sattussadā – rāgussadaṃ [rāgussado (syā.)], dosussadaṃ, mohussadaṃ, mānussadaṃ, diṭṭhussadaṃ, kilesussadaṃ, kammussadaṃ na kareyya na janeyya na sañjaneyya na nibbatteyya nābhinibbatteyya. Kuhiñcīti kuhiñci kismiñci katthaci ajjhattaṃ vā bahiddhā vā ajjhattabahiddhā vāti – ussadaṃ bhikkhu na kareyya kuhiñci."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Majjhe yathā samuddassa, ūmi no jāyatī ṭhito hoti;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Evaṃ ṭhito anejassa, ussadaṃ bhikkhu na kareyya kuhiñcī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "156"
      },
      "."
    ],
    "innerText": "156."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Akittayī vivaṭacakkhu, sakkhidhammaṃ parissayavinayaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Paṭipadaṃ vadehi bhaddante, pātimokkhaṃ atha vāpi samādhiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akittayī vivaṭacakkhū"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akittayī"
      },
      "ti kittitaṃ ācikkhitaṃ desitaṃ paññapitaṃ paṭṭhapitaṃ vivaṭaṃ vibhattaṃ uttānīkataṃ pakāsitanti ",
      " – akittayi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[akittayīti akittayi parikittayi ācikkhi desesi paññapesi paṭṭhapesi vivari vibhaji uttānimakāsi pakāsesīti akittayi (syā.)]"
      },
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vivaṭacakkhū"
      },
      "ti bhagavā pañcahi cakkhūhi vivaṭacakkhu – maṃsacakkhunāpi vivaṭacakkhu, dibbena cakkhunāpi vivaṭacakkhu, paññācakkhunāpi vivaṭacakkhu, buddhacakkhunāpi vivaṭacakkhu, samantacakkhunāpi vivaṭacakkhu."
    ],
    "innerText": "Akittayī vivaṭacakkhūti. Akittayīti kittitaṃ ācikkhitaṃ desitaṃ paññapitaṃ paṭṭhapitaṃ vivaṭaṃ vibhattaṃ uttānīkataṃ pakāsitanti – akittayi [akittayīti akittayi parikittayi ācikkhi desesi paññapesi paṭṭhapesi vivari vibhaji uttānimakāsi pakāsesīti akittayi (syā.)]. Vivaṭacakkhūti bhagavā pañcahi cakkhūhi vivaṭacakkhu – maṃsacakkhunāpi vivaṭacakkhu, dibbena cakkhunāpi vivaṭacakkhu, paññācakkhunāpi vivaṭacakkhu, buddhacakkhunāpi vivaṭacakkhu, samantacakkhunāpi vivaṭacakkhu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ bhagavā maṃsacakkhunāpi vivaṭacakkhu? Maṃsacakkhumhipi bhagavato pañca vaṇṇā saṃvijjanti – nīlo ca vaṇṇo, pītako ca vaṇṇo, lohitako ca ",
      " vaṇṇo, kaṇho ca vaṇṇo, odāto ",
      " ca vaṇṇo. Akkhilomāni ca bhagavato yattha ca akkhilomāni patiṭṭhitāni taṃ nīlaṃ hoti sunīlaṃ pāsādikaṃ dassaneyyaṃ umāpupphasamānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ummāpupphasamānaṃ (sī. ka.), ummārapupphasamānaṃ (syā.)]"
      },
      ". Tassa parato pītakaṃ hoti supītakaṃ suvaṇṇavaṇṇaṃ pāsādikaṃ dassaneyyaṃ kaṇikārapupphasamānaṃ. Ubhayato ca akkhikūṭāni bhagavato lohitakāni honti sulohitakāni pāsādikāni dassaneyyāni indagopakasamānāni. Majjhe kaṇhaṃ hoti sukaṇhaṃ alūkhaṃ siniddhaṃ pāsādikaṃ dassaneyyaṃ addāriṭṭhakasamānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[aḷāriṭṭhakasamānaṃ (syā.)]"
      },
      ". Tassa parato odātaṃ hoti suodātaṃ setaṃ paṇḍaraṃ pāsādikaṃ dassaneyyaṃ osadhitārakasamānaṃ. Tena bhagavā pākatikena maṃsacakkhunā attabhāvapariyāpannena purimasucaritakammābhinibbattena samantā yojanaṃ passati divā ceva rattiñca. Yadā hipi caturaṅgasamannāgato andhakāro hoti. Sūriyo vā atthaṅgato hoti. Kāḷapakkho ca uposatho hoti. Tibbo ca vanasaṇḍo hoti. Mahā ca kāḷamegho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[akālamegho (syā.)]"
      },
      " abbhuṭṭhito hoti. Evarūpepi caturaṅgasamannāgate andhakāre samantā yojanaṃ ",
      " passati. Natthi so kuṭṭo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kuḍḍo (sī.)]"
      },
      " vā kavāṭaṃ vā pākāro vā pabbato vā gaccho vā latā vā āvaraṇaṃ rūpānaṃ dassanāya. Ekañce tilaphalaṃ nimittaṃ ",
      " katvā tilavāhe pakkhipeyya. Taññeva tilaphalaṃ uddhareyya. Evaṃ parisuddhaṃ bhagavato pākatikaṃ maṃsacakkhu. Evaṃ bhagavā maṃsacakkhunāpi vivaṭacakkhu."
    ],
    "innerText": "Kathaṃ bhagavā maṃsacakkhunāpi vivaṭacakkhu? Maṃsacakkhumhipi bhagavato pañca vaṇṇā saṃvijjanti – nīlo ca vaṇṇo, pītako ca vaṇṇo, lohitako ca vaṇṇo, kaṇho ca vaṇṇo, odāto ca vaṇṇo. Akkhilomāni ca bhagavato yattha ca akkhilomāni patiṭṭhitāni taṃ nīlaṃ hoti sunīlaṃ pāsādikaṃ dassaneyyaṃ umāpupphasamānaṃ [ummāpupphasamānaṃ (sī. ka.), ummārapupphasamānaṃ (syā.)]. Tassa parato pītakaṃ hoti supītakaṃ suvaṇṇavaṇṇaṃ pāsādikaṃ dassaneyyaṃ kaṇikārapupphasamānaṃ. Ubhayato ca akkhikūṭāni bhagavato lohitakāni honti sulohitakāni pāsādikāni dassaneyyāni indagopakasamānāni. Majjhe kaṇhaṃ hoti sukaṇhaṃ alūkhaṃ siniddhaṃ pāsādikaṃ dassaneyyaṃ addāriṭṭhakasamānaṃ [aḷāriṭṭhakasamānaṃ (syā.)]. Tassa parato odātaṃ hoti suodātaṃ setaṃ paṇḍaraṃ pāsādikaṃ dassaneyyaṃ osadhitārakasamānaṃ. Tena bhagavā pākatikena maṃsacakkhunā attabhāvapariyāpannena purimasucaritakammābhinibbattena samantā yojanaṃ passati divā ceva rattiñca. Yadā hipi caturaṅgasamannāgato andhakāro hoti. Sūriyo vā atthaṅgato hoti. Kāḷapakkho ca uposatho hoti. Tibbo ca vanasaṇḍo hoti. Mahā ca kāḷamegho [akālamegho (syā.)] abbhuṭṭhito hoti. Evarūpepi caturaṅgasamannāgate andhakāre samantā yojanaṃ passati. Natthi so kuṭṭo [kuḍḍo (sī.)] vā kavāṭaṃ vā pākāro vā pabbato vā gaccho vā latā vā āvaraṇaṃ rūpānaṃ dassanāya. Ekañce tilaphalaṃ nimittaṃ katvā tilavāhe pakkhipeyya. Taññeva tilaphalaṃ uddhareyya. Evaṃ parisuddhaṃ bhagavato pākatikaṃ maṃsacakkhu. Evaṃ bhagavā maṃsacakkhunāpi vivaṭacakkhu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ bhagavā dibbena cakkhunāpi vivaṭacakkhu? Bhagavā dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe sugate duggate. Yathākammūpage satte pajānāti – ‘‘ime vata bhonto sattā kāyaduccaritena samannāgatā vacīduccaritena samannāgatā manoduccaritena samannāgatā ariyānaṃ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā ",
      ", te kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannā. Ime vā pana bhonto sattā kāyasucaritena samannāgatā vacīsucaritena samannāgatā manosucaritena samannāgatā ariyānaṃ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā, te kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapannā’’ti ",
      ". Iti dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe sugate duggate; yathākammūpage satte pajānāti. Ākaṅkhamāno ca bhagavā ekampi lokadhātuṃ passeyya, dvepi lokadhātuyo passeyya, tissopi lokadhātuyo ",
      " passeyya, catassopi lokadhātuyo passeyya, pañcapi lokadhātuyo passeyya, dasapi lokadhātuyo passeyya, vīsampi lokadhātuyo passeyya, tiṃsampi lokadhātuyo passeyya, cattālīsampi lokadhātuyo passeyya, paññāsampi lokadhātuyo passeyya, satampi lokadhātuyo passeyya, sahassimpi cūḷanikaṃ lokadhātuṃ passeyya, dvisahassimpi majjhimikaṃ lokadhātuṃ passeyya, tisahassimpi lokadhātuṃ passeyya, mahāsahassimpi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[tisahassiṃ mahāsahassimpi (sī. ka.)]"
      },
      " lokadhātuṃ passeyya. Yāvatakaṃ vā pana ākaṅkheyya tāvatakaṃ passeyya. Evaṃ parisuddhaṃ bhagavato dibbacakkhu. Evaṃ bhagavā dibbena cakkhunāpi vivaṭacakkhu."
    ],
    "innerText": "Kathaṃ bhagavā dibbena cakkhunāpi vivaṭacakkhu? Bhagavā dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe sugate duggate. Yathākammūpage satte pajānāti – ‘‘ime vata bhonto sattā kāyaduccaritena samannāgatā vacīduccaritena samannāgatā manoduccaritena samannāgatā ariyānaṃ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā , te kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannā. Ime vā pana bhonto sattā kāyasucaritena samannāgatā vacīsucaritena samannāgatā manosucaritena samannāgatā ariyānaṃ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā, te kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapannā’’ti . Iti dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe sugate duggate; yathākammūpage satte pajānāti. Ākaṅkhamāno ca bhagavā ekampi lokadhātuṃ passeyya, dvepi lokadhātuyo passeyya, tissopi lokadhātuyo passeyya, catassopi lokadhātuyo passeyya, pañcapi lokadhātuyo passeyya, dasapi lokadhātuyo passeyya, vīsampi lokadhātuyo passeyya, tiṃsampi lokadhātuyo passeyya, cattālīsampi lokadhātuyo passeyya, paññāsampi lokadhātuyo passeyya, satampi lokadhātuyo passeyya, sahassimpi cūḷanikaṃ lokadhātuṃ passeyya, dvisahassimpi majjhimikaṃ lokadhātuṃ passeyya, tisahassimpi lokadhātuṃ passeyya, mahāsahassimpi [tisahassiṃ mahāsahassimpi (sī. ka.)] lokadhātuṃ passeyya. Yāvatakaṃ vā pana ākaṅkheyya tāvatakaṃ passeyya. Evaṃ parisuddhaṃ bhagavato dibbacakkhu. Evaṃ bhagavā dibbena cakkhunāpi vivaṭacakkhu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kathaṃ bhagavā paññācakkhunāpi vivaṭacakkhu? Bhagavā mahāpañño puthupañño hāsapañño javanapañño tikkhapañño nibbedhikapañño paññāpabhedakusalo pabhinnañāṇo adhigatapaṭisambhido catuvesārajjappatto dasabaladhārī purisāsabho purisasīho purisanāgo purisājañño purisadhorayho anantañāṇo anantatejo anantayaso aḍḍho mahaddhano dhanavā netā vinetā anunetā paññāpetā anijjhāpetā pekkhetā pasādetā. So hi bhagavā anuppannassa maggassa uppādetā, asañjātassa maggassa sañjanetā, anakkhātassa maggassa akkhātā, maggaññū maggavidū maggakovido maggānugā ca pana etarahi sāvakā viharanti pacchā samannāgatā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "So ",
      " hi bhagavā jānaṃ jānāti ",
      " passaṃ passati, cakkhubhūto ñāṇabhūto ",
      " dhammabhūto brahmabhūto vattā pavattā atthassa ninnetā amatassa dātā dhammassāmī tathāgato. Natthi tassa bhagavato aññātaṃ adiṭṭhaṃ aviditaṃ asacchikataṃ aphassitaṃ paññāya. Atītaṃ anāgataṃ paccuppannaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[atītānāgatapaccuppannaṃ (syā.) mahāni. 69]"
      },
      " upādāya sabbe dhammā sabbākārena buddhassa bhagavato ñāṇamukhe āpāthaṃ āgacchanti. Yaṃ kiñci neyyaṃ nāma atthi jānitabbaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[atthi dhammaṃ jānitabbaṃ (sī. ka.)]"
      },
      " attattho vā parattho vā ubhayattho vā diṭṭhadhammiko vā attho ",
      " samparāyiko vā attho uttāno vā attho gambhīro vā attho gūḷho vā attho paṭicchanno vā attho neyyo vā attho nīto vā attho anavajjo vā attho nikkileso vā attho vodāno vā attho paramattho vā attho, sabbaṃ taṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[paramattho vā, sabbantaṃ (syā.)]"
      },
      " antobuddhañāṇe parivattati."
    ],
    "innerText": "So hi bhagavā jānaṃ jānāti passaṃ passati, cakkhubhūto ñāṇabhūto dhammabhūto brahmabhūto vattā pavattā atthassa ninnetā amatassa dātā dhammassāmī tathāgato. Natthi tassa bhagavato aññātaṃ adiṭṭhaṃ aviditaṃ asacchikataṃ aphassitaṃ paññāya. Atītaṃ anāgataṃ paccuppannaṃ [atītānāgatapaccuppannaṃ (syā.) mahāni. 69] upādāya sabbe dhammā sabbākārena buddhassa bhagavato ñāṇamukhe āpāthaṃ āgacchanti. Yaṃ kiñci neyyaṃ nāma atthi jānitabbaṃ [atthi dhammaṃ jānitabbaṃ (sī. ka.)] attattho vā parattho vā ubhayattho vā diṭṭhadhammiko vā attho samparāyiko vā attho uttāno vā attho gambhīro vā attho gūḷho vā attho paṭicchanno vā attho neyyo vā attho nīto vā attho anavajjo vā attho nikkileso vā attho vodāno vā attho paramattho vā attho, sabbaṃ taṃ [paramattho vā, sabbantaṃ (syā.)] antobuddhañāṇe parivattati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sabbaṃ kāyakammaṃ buddhassa bhagavato ñāṇānuparivatti sabbaṃ vacīkammaṃ… sabbaṃ manokammaṃ… atīte buddhassa bhagavato appaṭihataṃ ñāṇaṃ, anāgate paccuppanne appaṭihataṃ ñāṇaṃ. Yāvatakaṃ neyyaṃ tāvatakaṃ ñāṇaṃ, yāvatakaṃ ñāṇaṃ tāvatakaṃ neyyaṃ; neyyapariyantikaṃ ñāṇaṃ ñāṇapariyantikaṃ neyyaṃ, neyyaṃ atikkamitvā ñāṇaṃ nappavattati, ñāṇaṃ atikkamitvā neyyapatho natthi. Aññamaññapariyantaṭṭhāyino te dhammā. Yathā dvinnaṃ samuggapaṭalānaṃ sammāphusitānaṃ heṭṭhimaṃ samuggapaṭalaṃ uparimaṃ nātivattati, uparimaṃ samuggapaṭalaṃ heṭṭhimaṃ nātivattati, aññamaññapariyantaṭṭhāyino; evameva buddhassa ",
      " bhagavato neyyañca ñāṇañca aññamaññapariyantaṭṭhāyino. Yāvatakaṃ neyyaṃ tāvatakaṃ ",
      " ñāṇaṃ, yāvatakaṃ ñāṇaṃ tāvatakaṃ neyyaṃ; neyyapariyantikaṃ ñāṇaṃ ñāṇapariyantikaṃ neyyaṃ. Neyyaṃ atikkamitvā ñāṇaṃ nappavattati, ñāṇaṃ atikkamitvā neyyapatho natthi. Aññamaññapariyantaṭṭhāyino te dhammā."
    ],
    "innerText": "Sabbaṃ kāyakammaṃ buddhassa bhagavato ñāṇānuparivatti sabbaṃ vacīkammaṃ… sabbaṃ manokammaṃ… atīte buddhassa bhagavato appaṭihataṃ ñāṇaṃ, anāgate paccuppanne appaṭihataṃ ñāṇaṃ. Yāvatakaṃ neyyaṃ tāvatakaṃ ñāṇaṃ, yāvatakaṃ ñāṇaṃ tāvatakaṃ neyyaṃ; neyyapariyantikaṃ ñāṇaṃ ñāṇapariyantikaṃ neyyaṃ, neyyaṃ atikkamitvā ñāṇaṃ nappavattati, ñāṇaṃ atikkamitvā neyyapatho natthi. Aññamaññapariyantaṭṭhāyino te dhammā. Yathā dvinnaṃ samuggapaṭalānaṃ sammāphusitānaṃ heṭṭhimaṃ samuggapaṭalaṃ uparimaṃ nātivattati, uparimaṃ samuggapaṭalaṃ heṭṭhimaṃ nātivattati, aññamaññapariyantaṭṭhāyino; evameva buddhassa bhagavato neyyañca ñāṇañca aññamaññapariyantaṭṭhāyino. Yāvatakaṃ neyyaṃ tāvatakaṃ ñāṇaṃ, yāvatakaṃ ñāṇaṃ tāvatakaṃ neyyaṃ; neyyapariyantikaṃ ñāṇaṃ ñāṇapariyantikaṃ neyyaṃ. Neyyaṃ atikkamitvā ñāṇaṃ nappavattati, ñāṇaṃ atikkamitvā neyyapatho natthi. Aññamaññapariyantaṭṭhāyino te dhammā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sabbadhammesu buddhassa bhagavato ñāṇaṃ pavattati. Sabbe dhammā buddhassa bhagavato āvajjanapaṭibaddhā ākaṅkhapaṭibaddhā manasikārapaṭibaddhā cittuppādapaṭibaddhā. Sabbasattesu buddhassa bhagavato ñāṇaṃ pavattati. Sabbesaṃ sattānaṃ bhagavā āsayaṃ jānāti, anusayaṃ jānāti, caritaṃ jānāti, adhimuttiṃ jānāti, apparajakkhe mahārajakkhe tikkhindriye mudindriye svākāre dvākāre suviññāpaye duviññāpaye bhabbābhabbe satte pajānāti. Sadevako loko samārako sabrahmako sassamaṇabrāhmaṇī pajā sadevamanussā antobuddhañāṇe parivattati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[parivattanti (ka.) pasūrasuttaniddese avasānepi]"
      },
      "."
    ],
    "innerText": "Sabbadhammesu buddhassa bhagavato ñāṇaṃ pavattati. Sabbe dhammā buddhassa bhagavato āvajjanapaṭibaddhā ākaṅkhapaṭibaddhā manasikārapaṭibaddhā cittuppādapaṭibaddhā. Sabbasattesu buddhassa bhagavato ñāṇaṃ pavattati. Sabbesaṃ sattānaṃ bhagavā āsayaṃ jānāti, anusayaṃ jānāti, caritaṃ jānāti, adhimuttiṃ jānāti, apparajakkhe mahārajakkhe tikkhindriye mudindriye svākāre dvākāre suviññāpaye duviññāpaye bhabbābhabbe satte pajānāti. Sadevako loko samārako sabrahmako sassamaṇabrāhmaṇī pajā sadevamanussā antobuddhañāṇe parivattati [parivattanti (ka.) pasūrasuttaniddese avasānepi]."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yathā ye keci macchakacchapā antamaso timitimiṅgalaṃ upādāya antomahāsamudde parivattanti; evameva sadevako loko samārako sabrahmako sassamaṇabrāhmaṇī pajā sadevamanussā ",
      " antobuddhañāṇe parivattati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[parivattanti (ka.) pasūrasuttaniddese avasānepi]"
      },
      ". Yathā ye keci pakkhī antamaso garuḷaṃ venateyyaṃ upādāya ākāsassa padese parivattanti; evameva yepi te ",
      " sāriputtasamā paññāya tepi buddhañāṇassa padese parivattanti; buddhañāṇaṃ devamanussānaṃ paññaṃ pharitvā abhibhavitvā tiṭṭhati. Yepi te khattiyapaṇḍitā brāhmaṇapaṇḍitā ",
      " gahapatipaṇḍitā samaṇapaṇḍitā nipuṇā kataparappavādā vālavedhirūpā vobhindantā maññe caranti paññāgatena diṭṭhigatāni, te pañhaṃ abhisaṅkharitvā abhisaṅkharitvā tathāgataṃ upasaṅkamitvā pucchanti gūḷhāni ca paṭicchannāni ca. Kathitā visajjitā ca te pañhā bhagavatā honti niddiṭṭhakāraṇā. Upakkhittakā ca ",
      " te bhagavato sampajjanti. Atha kho bhagavā tattha atirocati yadidaṃ paññāyāti. Evaṃ bhagavā paññācakkhunāpi vivaṭacakkhu."
    ],
    "innerText": "Yathā ye keci macchakacchapā antamaso timitimiṅgalaṃ upādāya antomahāsamudde parivattanti; evameva sadevako loko samārako sabrahmako sassamaṇabrāhmaṇī pajā sadevamanussā antobuddhañāṇe parivattati [parivattanti (ka.) pasūrasuttaniddese avasānepi]. Yathā ye keci pakkhī antamaso garuḷaṃ venateyyaṃ upādāya ākāsassa padese parivattanti; evameva yepi te sāriputtasamā paññāya tepi buddhañāṇassa padese parivattanti; buddhañāṇaṃ devamanussānaṃ paññaṃ pharitvā abhibhavitvā tiṭṭhati. Yepi te khattiyapaṇḍitā brāhmaṇapaṇḍitā gahapatipaṇḍitā samaṇapaṇḍitā nipuṇā kataparappavādā vālavedhirūpā vobhindantā maññe caranti paññāgatena diṭṭhigatāni, te pañhaṃ abhisaṅkharitvā abhisaṅkharitvā tathāgataṃ upasaṅkamitvā pucchanti gūḷhāni ca paṭicchannāni ca. Kathitā visajjitā ca te pañhā bhagavatā honti niddiṭṭhakāraṇā. Upakkhittakā ca te bhagavato sampajjanti. Atha kho bhagavā tattha atirocati yadidaṃ paññāyāti. Evaṃ bhagavā paññācakkhunāpi vivaṭacakkhu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ bhagavā buddhacakkhunāpi vivaṭacakkhu? Bhagavā buddhacakkhunā lokaṃ volokento addasa satte apparajakkhe mahārajakkhe tikkhindriye mudindriye svākāre dvākāre suviññāpaye duviññāpaye appekacce paralokavajjabhayadassāvino viharante, appekacce na paralokavajjabhayadassāvino viharante. Seyyathāpi nāma uppaliniyaṃ vā paduminiyaṃ vā puṇḍarīkiniyaṃ vā appekaccāni uppalāni vā padumāni vā puṇḍarīkāni vā udake jātāni udake saṃvaḍḍhāni udakā anuggatāni antonimuggaposīni, appekaccāni uppalāni vā padumāni vā puṇḍarīkāni vā udake jātāni udake saṃvaḍḍhāni samodakaṃ ṭhitāni, appekaccāni uppalāni vā padumāni vā puṇḍarīkāni vā udake jātāni udake saṃvaḍḍhāni udakā accuggamma tiṭṭhanti anupalittāni udakena; evameva bhagavā buddhacakkhunā lokaṃ volokento addasa satte apparajakkhe mahārajakkhe tikkhindriye mudindriye svākāre dvākāre suviññāpaye duviññāpaye appekacce paralokavajjabhayadassāvino ",
      " viharante, appekacce na paralokavajjabhayadassāvino viharante. Jānāti bhagavā – ‘‘ayaṃ puggalo rāgacarito, ayaṃ dosacarito, ayaṃ mohacarito, ayaṃ vitakkacarito, ayaṃ saddhācarito, ayaṃ ñāṇacarito’’ti. Rāgacaritassa bhagavā puggalassa asubhakathaṃ katheti; dosacaritassa bhagavā puggalassa mettābhāvanaṃ ācikkhati; mohacaritassa bhagavā puggalassa uddese paripucchāya kālena dhammassavane kālena dhammasākacchāya garusaṃvāse niveseti; vitakkacaritassa bhagavā puggalassa ānāpānassatiṃ ācikkhati; saddhācaritassa bhagavā puggalassa pasādanīyaṃ nimittaṃ ācikkhati buddhasubodhiṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[buddhasubuddhataṃ (ka.)]"
      },
      " dhammasudhammataṃ saṅghasuppaṭipattiṃ sīlāni ca; attano ñāṇacaritassa bhagavā puggalassa ācikkhati vipassanānimittaṃ aniccākāraṃ dukkhākāraṃ anattākāraṃ."
    ],
    "innerText": "Kathaṃ bhagavā buddhacakkhunāpi vivaṭacakkhu? Bhagavā buddhacakkhunā lokaṃ volokento addasa satte apparajakkhe mahārajakkhe tikkhindriye mudindriye svākāre dvākāre suviññāpaye duviññāpaye appekacce paralokavajjabhayadassāvino viharante, appekacce na paralokavajjabhayadassāvino viharante. Seyyathāpi nāma uppaliniyaṃ vā paduminiyaṃ vā puṇḍarīkiniyaṃ vā appekaccāni uppalāni vā padumāni vā puṇḍarīkāni vā udake jātāni udake saṃvaḍḍhāni udakā anuggatāni antonimuggaposīni, appekaccāni uppalāni vā padumāni vā puṇḍarīkāni vā udake jātāni udake saṃvaḍḍhāni samodakaṃ ṭhitāni, appekaccāni uppalāni vā padumāni vā puṇḍarīkāni vā udake jātāni udake saṃvaḍḍhāni udakā accuggamma tiṭṭhanti anupalittāni udakena; evameva bhagavā buddhacakkhunā lokaṃ volokento addasa satte apparajakkhe mahārajakkhe tikkhindriye mudindriye svākāre dvākāre suviññāpaye duviññāpaye appekacce paralokavajjabhayadassāvino viharante, appekacce na paralokavajjabhayadassāvino viharante. Jānāti bhagavā – ‘‘ayaṃ puggalo rāgacarito, ayaṃ dosacarito, ayaṃ mohacarito, ayaṃ vitakkacarito, ayaṃ saddhācarito, ayaṃ ñāṇacarito’’ti. Rāgacaritassa bhagavā puggalassa asubhakathaṃ katheti; dosacaritassa bhagavā puggalassa mettābhāvanaṃ ācikkhati; mohacaritassa bhagavā puggalassa uddese paripucchāya kālena dhammassavane kālena dhammasākacchāya garusaṃvāse niveseti; vitakkacaritassa bhagavā puggalassa ānāpānassatiṃ ācikkhati; saddhācaritassa bhagavā puggalassa pasādanīyaṃ nimittaṃ ācikkhati buddhasubodhiṃ [buddhasubuddhataṃ (ka.)] dhammasudhammataṃ saṅghasuppaṭipattiṃ sīlāni ca; attano ñāṇacaritassa bhagavā puggalassa ācikkhati vipassanānimittaṃ aniccākāraṃ dukkhākāraṃ anattākāraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Sele ",
      " yathā pabbatamuddhaniṭṭhito, yathāpi passe janataṃ samantato;"
    ],
    "innerText": "‘‘Sele yathā pabbatamuddhaniṭṭhito, yathāpi passe janataṃ samantato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Tathūpamaṃ dhammamayaṃ sumedha, pāsādamāruyha samantacakkhu;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sokāvatiṇṇaṃ janatamapetasoko, avekkhassu jātijarābhibhūta’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ bhagavā buddhacakkhunāpi vivaṭacakkhu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ bhagavā samantacakkhunāpi vivaṭacakkhu? ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samantacakkhu"
      },
      " vuccati sabbaññutañāṇaṃ. Bhagavā sabbaññutañāṇena upeto samupeto upagato ",
      " samupagato upapanno samupapanno samannāgato."
    ],
    "innerText": "Kathaṃ bhagavā samantacakkhunāpi vivaṭacakkhu? Samantacakkhu vuccati sabbaññutañāṇaṃ. Bhagavā sabbaññutañāṇena upeto samupeto upagato samupagato upapanno samupapanno samannāgato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Na tassa adiṭṭhamidhatthi kiñci, atho aviññātamajānitabbaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sabbaṃ abhiññāsi yadatthi neyyaṃ, tathāgato tena samantacakkhū’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ bhagavā samantacakkhunāpi vivaṭacakkhūti – akittayi vivaṭacakkhu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sakkhidhammaṃ parissayavinaya"
      },
      "nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sakkhidhamma"
      },
      "nti na itihitihaṃ, na itikirāya, na paramparāya, na piṭakasampadāya, na takkahetu, na nayahetu, na ākāraparivitakkena, na diṭṭhinijjhānakkhantiyā sāmaṃ sayamabhiññātaṃ attapaccakkhaṃ dhammanti – sakkhidhammaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parissayavinaya"
      },
      "nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parissayā"
      },
      "ti dve parissayā – pākaṭaparissayā ca paṭicchannaparissayā ca. Katame pākaṭaparissayā? Sīhā byagghā dīpī acchā taracchā ",
      " kokā mahiṃsā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[gomahisā (syā.) mahāni. 5]"
      },
      " hatthī ahi vicchikā satapadī, corā vā assu mānavā vā katakammā vā akatakammā vā, cakkhurogo sotarogo ghānarogo jivhārogo kāyarogo sīsarogo kaṇṇarogo mukharogo dantarogo kāso sāso pināso ḍāho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ḍaho (sī. syā.) mahāni. 5]"
      },
      " jaro kucchirogo mucchā pakkhandikā sūlā visūcikā kuṭṭhaṃ gaṇḍo kilāso soso apamāro ",
      " daddu kaṇḍu kacchu rakhasā vitacchikā lohitapittaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[lohitaṃ pittaṃ (syā. ka.)]"
      },
      " madhumeho aṃsā piḷakā bhagandalā, pittasamuṭṭhānā ābādhā semhasamuṭṭhānā ābādhā ",
      " vātasamuṭṭhānā ābādhā sannipātikā ābādhā utupariṇāmajā ābādhā visamaparihārajā ābādhā opakkamikā ābādhā kammavipākajā ābādhā, sītaṃ uṇhaṃ jighacchā pipāsā uccāro passāvo ḍaṃsamakasavātātapasarīsapasamphassā iti vā – ime vuccanti pākaṭaparissayā."
    ],
    "innerText": "Sakkhidhammaṃ parissayavinayanti. Sakkhidhammanti na itihitihaṃ, na itikirāya, na paramparāya, na piṭakasampadāya, na takkahetu, na nayahetu, na ākāraparivitakkena, na diṭṭhinijjhānakkhantiyā sāmaṃ sayamabhiññātaṃ attapaccakkhaṃ dhammanti – sakkhidhammaṃ. Parissayavinayanti. Parissayāti dve parissayā – pākaṭaparissayā ca paṭicchannaparissayā ca. Katame pākaṭaparissayā? Sīhā byagghā dīpī acchā taracchā kokā mahiṃsā [gomahisā (syā.) mahāni. 5] hatthī ahi vicchikā satapadī, corā vā assu mānavā vā katakammā vā akatakammā vā, cakkhurogo sotarogo ghānarogo jivhārogo kāyarogo sīsarogo kaṇṇarogo mukharogo dantarogo kāso sāso pināso ḍāho [ḍaho (sī. syā.) mahāni. 5] jaro kucchirogo mucchā pakkhandikā sūlā visūcikā kuṭṭhaṃ gaṇḍo kilāso soso apamāro daddu kaṇḍu kacchu rakhasā vitacchikā lohitapittaṃ [lohitaṃ pittaṃ (syā. ka.)] madhumeho aṃsā piḷakā bhagandalā, pittasamuṭṭhānā ābādhā semhasamuṭṭhānā ābādhā vātasamuṭṭhānā ābādhā sannipātikā ābādhā utupariṇāmajā ābādhā visamaparihārajā ābādhā opakkamikā ābādhā kammavipākajā ābādhā, sītaṃ uṇhaṃ jighacchā pipāsā uccāro passāvo ḍaṃsamakasavātātapasarīsapasamphassā iti vā – ime vuccanti pākaṭaparissayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katame paṭicchannaparissayā? Kāyaduccaritaṃ vacīduccaritaṃ manoduccaritaṃ kāmacchandanīvaraṇaṃ ",
      " byāpādanīvaraṇaṃ thinamiddhanīvaraṇaṃ uddhaccakukkuccanīvaraṇaṃ vicikicchānīvaraṇaṃ rāgo doso moho kodho upanāho makkho paḷāso issā macchariyaṃ māyā sāṭheyyaṃ thambho sārambho māno atimāno mado pamādo, sabbe kilesā sabbe duccaritā sabbe darathā sabbe pariḷāhā sabbe santāpā sabbākusalābhisaṅkhārā – ime vuccanti paṭicchannaparissayā."
    ],
    "innerText": "Katame paṭicchannaparissayā? Kāyaduccaritaṃ vacīduccaritaṃ manoduccaritaṃ kāmacchandanīvaraṇaṃ byāpādanīvaraṇaṃ thinamiddhanīvaraṇaṃ uddhaccakukkuccanīvaraṇaṃ vicikicchānīvaraṇaṃ rāgo doso moho kodho upanāho makkho paḷāso issā macchariyaṃ māyā sāṭheyyaṃ thambho sārambho māno atimāno mado pamādo, sabbe kilesā sabbe duccaritā sabbe darathā sabbe pariḷāhā sabbe santāpā sabbākusalābhisaṅkhārā – ime vuccanti paṭicchannaparissayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parissayā"
      },
      "ti kenaṭṭhena parissayā? Parisahantīti parissayā, parihānāya saṃvattantīti parissayā, tatrāsayāti parissayā. Kathaṃ parisahantīti parissayā? Te parissayā taṃ puggalaṃ sahanti parisahanti abhibhavanti ajjhottharanti pariyādiyanti maddanti. Evaṃ parisahantīti – parissayā."
    ],
    "innerText": "Parissayāti kenaṭṭhena parissayā? Parisahantīti parissayā, parihānāya saṃvattantīti parissayā, tatrāsayāti parissayā. Kathaṃ parisahantīti parissayā? Te parissayā taṃ puggalaṃ sahanti parisahanti abhibhavanti ajjhottharanti pariyādiyanti maddanti. Evaṃ parisahantīti – parissayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ parihānāya saṃvattantīti parissayā? Te parissayā kusalānaṃ dhammānaṃ antarāyāya parihānāya saṃvattanti. Katamesaṃ kusalānaṃ dhammānaṃ? Sammāpaṭipadāya anulomapaṭipadāya apaccanīkapaṭipadāya ",
      " aviruddhapaṭipadāya anvatthapaṭipadāya dhammānudhammapaṭipadāya sīlesu paripūrakāritāya indriyesu guttadvāratāya bhojane mattaññutāya jāgariyānuyogassa satisampajaññassa catunnaṃ satipaṭṭhānānaṃ bhāvanānuyogassa catunnaṃ sammappadhānānaṃ catunnaṃ iddhipādānaṃ pañcannaṃ indriyānaṃ pañcannaṃ balānaṃ sattannaṃ bojjhaṅgānaṃ ariyassa aṭṭhaṅgikassa maggassa bhāvanānuyogassa – imesaṃ kusalānaṃ dhammānaṃ antarāyāya parihānāya saṃvattanti. Evampi parihānāya saṃvattantīti – parissayā."
    ],
    "innerText": "Kathaṃ parihānāya saṃvattantīti parissayā? Te parissayā kusalānaṃ dhammānaṃ antarāyāya parihānāya saṃvattanti. Katamesaṃ kusalānaṃ dhammānaṃ? Sammāpaṭipadāya anulomapaṭipadāya apaccanīkapaṭipadāya aviruddhapaṭipadāya anvatthapaṭipadāya dhammānudhammapaṭipadāya sīlesu paripūrakāritāya indriyesu guttadvāratāya bhojane mattaññutāya jāgariyānuyogassa satisampajaññassa catunnaṃ satipaṭṭhānānaṃ bhāvanānuyogassa catunnaṃ sammappadhānānaṃ catunnaṃ iddhipādānaṃ pañcannaṃ indriyānaṃ pañcannaṃ balānaṃ sattannaṃ bojjhaṅgānaṃ ariyassa aṭṭhaṅgikassa maggassa bhāvanānuyogassa – imesaṃ kusalānaṃ dhammānaṃ antarāyāya parihānāya saṃvattanti. Evampi parihānāya saṃvattantīti – parissayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ ",
      " tatrāsayāti parissayā? Tatthete pāpakā akusalā dhammā uppajjanti attabhāvasannissayā. Yathā bile bilāsayā pāṇā sayanti, dake dakāsayā pāṇā sayanti, vane vanāsayā pāṇā sayanti, rukkhe rukkhāsayā pāṇā sayanti; evameva tatthete pāpakā akusalā dhammā uppajjanti attabhāvasannissayāti. Evampi tatrāsayāti – parissayā."
    ],
    "innerText": "Kathaṃ tatrāsayāti parissayā? Tatthete pāpakā akusalā dhammā uppajjanti attabhāvasannissayā. Yathā bile bilāsayā pāṇā sayanti, dake dakāsayā pāṇā sayanti, vane vanāsayā pāṇā sayanti, rukkhe rukkhāsayā pāṇā sayanti; evameva tatthete pāpakā akusalā dhammā uppajjanti attabhāvasannissayāti. Evampi tatrāsayāti – parissayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vuttañhetaṃ bhagavatā – ‘‘sāntevāsiko, bhikkhave, bhikkhu sācariyako dukkhaṃ na phāsu viharati. Kathañca, bhikkhave, bhikkhu sāntevāsiko sācariyako dukkhaṃ na phāsu viharati? Idha, bhikkhave, bhikkhuno cakkhunā rūpaṃ disvā uppajjanti pāpakā akusalā dhammā sarasaṅkappā saññojaniyā, tyassa anto vasanti anvāssavanti pāpakā akusalā dhammāti. Tasmā ",
      " sāntevāsikoti vuccati. Te naṃ samudācaranti, samudācaranti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[samudācārenti (sī.)]"
      },
      " naṃ pāpakā ",
      " akusalā dhammāti. Tasmā sācariyakoti vuccati."
    ],
    "innerText": "Vuttañhetaṃ bhagavatā – ‘‘sāntevāsiko, bhikkhave, bhikkhu sācariyako dukkhaṃ na phāsu viharati. Kathañca, bhikkhave, bhikkhu sāntevāsiko sācariyako dukkhaṃ na phāsu viharati? Idha, bhikkhave, bhikkhuno cakkhunā rūpaṃ disvā uppajjanti pāpakā akusalā dhammā sarasaṅkappā saññojaniyā, tyassa anto vasanti anvāssavanti pāpakā akusalā dhammāti. Tasmā sāntevāsikoti vuccati. Te naṃ samudācaranti, samudācaranti [samudācārenti (sī.)] naṃ pāpakā akusalā dhammāti. Tasmā sācariyakoti vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhikkhave, bhikkhuno sotena saddaṃ sutvā…pe… ghānena gandhaṃ ghāyitvā… jivhāya rasaṃ sāyitvā… kāyena phoṭṭhabbaṃ phusitvā ",
      "… manasā dhammaṃ viññāya uppajjanti pāpakā akusalā dhammā sarasaṅkappā saññojaniyā, tyassa anto vasanti anvāssavanti pāpakā akusalā dhammāti. Tasmā sāntevāsikoti vuccati. Te naṃ samudācaranti, samudācaranti naṃ pāpakā akusalā dhammāti. Tasmā sācariyakoti vuccati. Evaṃ kho, bhikkhave, bhikkhu sāntevāsiko sācariyako dukkhaṃ na phāsu viharatī’’ti. Evampi tatrāsayāti – parissayā."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, bhikkhuno sotena saddaṃ sutvā…pe… ghānena gandhaṃ ghāyitvā… jivhāya rasaṃ sāyitvā… kāyena phoṭṭhabbaṃ phusitvā … manasā dhammaṃ viññāya uppajjanti pāpakā akusalā dhammā sarasaṅkappā saññojaniyā, tyassa anto vasanti anvāssavanti pāpakā akusalā dhammāti. Tasmā sāntevāsikoti vuccati. Te naṃ samudācaranti, samudācaranti naṃ pāpakā akusalā dhammāti. Tasmā sācariyakoti vuccati. Evaṃ kho, bhikkhave, bhikkhu sāntevāsiko sācariyako dukkhaṃ na phāsu viharatī’’ti. Evampi tatrāsayāti – parissayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vuttañhetaṃ bhagavatā – ‘‘tayome, bhikkhave, antarāmalā antarāamittā antarāsapattā antarāvadhakā antarāpaccatthikā. Katame tayo? Lobho, bhikkhave, antarāmalo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[antarāmalaṃ (sī. ka.) itivu. 88]"
      },
      " antarāamitto antarāsapatto antarāvadhako antarāpaccatthiko; doso, bhikkhave…pe… moho, bhikkhave, antarāmalo antarāamitto antarāsapatto antarāvadhako antarāpaccatthiko. Ime kho, bhikkhave, tayo antarāmalā antarāamittā antarāsapattā antarāvadhakā antarāpaccatthikā’’ti."
    ],
    "innerText": "Vuttañhetaṃ bhagavatā – ‘‘tayome, bhikkhave, antarāmalā antarāamittā antarāsapattā antarāvadhakā antarāpaccatthikā. Katame tayo? Lobho, bhikkhave, antarāmalo [antarāmalaṃ (sī. ka.) itivu. 88] antarāamitto antarāsapatto antarāvadhako antarāpaccatthiko; doso, bhikkhave…pe… moho, bhikkhave, antarāmalo antarāamitto antarāsapatto antarāvadhako antarāpaccatthiko. Ime kho, bhikkhave, tayo antarāmalā antarāamittā antarāsapattā antarāvadhakā antarāpaccatthikā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Anatthajanano ",
      " lobho, lobho cittappakopano;"
    ],
    "innerText": "‘‘Anatthajanano lobho, lobho cittappakopano;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhayamantarato jātaṃ, taṃ jano nāvabujjhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Luddho ",
      " atthaṃ na jānāti, luddho dhammaṃ na passati;"
    ],
    "innerText": "‘‘Luddho atthaṃ na jānāti, luddho dhammaṃ na passati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Andhantamaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[andhatamaṃ (syā.) itivu. 88]"
      },
      " tadā hoti, yaṃ lobho sahate naraṃ."
    ],
    "innerText": "Andhantamaṃ [andhatamaṃ (syā.) itivu. 88] tadā hoti, yaṃ lobho sahate naraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Anatthajanano doso, doso cittappakopano;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhayamantarato jātaṃ, taṃ jano nāvabujjhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kuddho atthaṃ na jānāti, kuddho dhammaṃ na passati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Andhantamaṃ tadā hoti, yaṃ doso sahate naraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Anatthajanano ",
      " moho, moho cittappakopano;"
    ],
    "innerText": "‘‘Anatthajanano moho, moho cittappakopano;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhayamantarato jātaṃ, taṃ jano nāvabujjhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Mūḷho atthaṃ na jānāti, mūḷho dhammaṃ na passati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Andhantamaṃ tadā hoti, yaṃ moho sahate nara’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evampi tatrāsayāti – parissayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Vuttañhetaṃ bhagavatā – ‘‘tayo kho, mahārāja, purisassa dhammā ajjhattaṃ uppajjamānā uppajjanti ahitāya dukkhāya aphāsuvihārāya. Katame tayo? Lobho kho, mahārāja, purisassa dhammo ajjhattaṃ uppajjamāno uppajjati ahitāya dukkhāya aphāsuvihārāya; doso kho, mahārāja…pe… moho kho, mahārāja, purisassa dhammo ajjhattaṃ uppajjamāno uppajjati ahitāya dukkhāya aphāsuvihārāya. Ime kho, mahārāja, tayo purisassa dhammā ajjhattaṃ uppajjamānā uppajjanti ahitāya dukkhāya aphāsuvihārāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Lobho ",
      " doso ca moho ca, purisaṃ pāpacetasaṃ;"
    ],
    "innerText": "‘‘Lobho doso ca moho ca, purisaṃ pāpacetasaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Hiṃsanti attasambhūtā, tacasāraṃva samphala’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evampi tatrāsayāti – parissayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vuttañhetaṃ ",
      " bhagavatā –"
    ],
    "innerText": "Vuttañhetaṃ bhagavatā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Rāgo ca doso ca ito nidānā, aratī ratī lomahaṃso itojā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ito samuṭṭhāya manovitakkā, kumārakā dhaṅkamivossajantī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evampi tatrāsayāti – parissayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parissayavinaya"
      },
      "nti ",
      " parissayavinayaṃ parissayappahānaṃ parissayavūpasamaṃ parissayapaṭinissaggaṃ parissayapaṭipassaddhiṃ amataṃ nibbānanti – sakkhidhammaṃ parissayavinayaṃ."
    ],
    "innerText": "Parissayavinayanti parissayavinayaṃ parissayappahānaṃ parissayavūpasamaṃ parissayapaṭinissaggaṃ parissayapaṭipassaddhiṃ amataṃ nibbānanti – sakkhidhammaṃ parissayavinayaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭipadaṃ vadehi bhaddante"
      },
      "ti. Paṭipadaṃ vadehi – sammāpaṭipadaṃ anulomapaṭipadaṃ apaccanīkapaṭipadaṃ ",
      " aviruddhapaṭipadaṃ anvatthapaṭipadaṃ dhammānudhammapaṭipadaṃ sīlesu paripūrakāritaṃ indriyesu guttadvārataṃ bhojane mattaññutaṃ jāgariyānuyogaṃ satisampajaññaṃ cattāro satipaṭṭhāne cattāro sammappadhāne cattāro iddhipāde pañcindriyāni pañca balāni satta bojjhaṅge ariyaṃ aṭṭhaṅgikaṃ maggaṃ nibbānañca nibbānagāminiñca paṭipadaṃ vadehi ācikkha desehi paññapehi paṭṭhapehi vivara vibhaja uttānīkarohi pakāsehīti – paṭipadaṃ vadehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhaddante"
      },
      "ti so nimmito ",
      " buddhaṃ bhagavantaṃ ālapati. Atha vā yaṃ tvaṃ dhammaṃ ācikkhasi desesi paññapesi paṭṭhapesi vivari vibhaji uttānīakāsi pakāsesi sabbaṃ taṃ sundaraṃ bhaddakaṃ kalyāṇaṃ anavajjaṃ sevitabbanti – paṭipadaṃ vadehi bhaddante."
    ],
    "innerText": "Paṭipadaṃ vadehi bhaddanteti. Paṭipadaṃ vadehi – sammāpaṭipadaṃ anulomapaṭipadaṃ apaccanīkapaṭipadaṃ aviruddhapaṭipadaṃ anvatthapaṭipadaṃ dhammānudhammapaṭipadaṃ sīlesu paripūrakāritaṃ indriyesu guttadvārataṃ bhojane mattaññutaṃ jāgariyānuyogaṃ satisampajaññaṃ cattāro satipaṭṭhāne cattāro sammappadhāne cattāro iddhipāde pañcindriyāni pañca balāni satta bojjhaṅge ariyaṃ aṭṭhaṅgikaṃ maggaṃ nibbānañca nibbānagāminiñca paṭipadaṃ vadehi ācikkha desehi paññapehi paṭṭhapehi vivara vibhaja uttānīkarohi pakāsehīti – paṭipadaṃ vadehi. Bhaddanteti so nimmito buddhaṃ bhagavantaṃ ālapati. Atha vā yaṃ tvaṃ dhammaṃ ācikkhasi desesi paññapesi paṭṭhapesi vivari vibhaji uttānīakāsi pakāsesi sabbaṃ taṃ sundaraṃ bhaddakaṃ kalyāṇaṃ anavajjaṃ sevitabbanti – paṭipadaṃ vadehi bhaddante."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pātimokkhaṃ atha vāpi samādhi"
      },
      "nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pātimokkha"
      },
      "nti sīlaṃ patiṭṭhā ādi caraṇaṃ saṃyamo saṃvaro mukhaṃ pamukhaṃ kusalānaṃ dhammānaṃ samāpattiyā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atha vāpi samādhi"
      },
      "nti yā cittassa ṭhiti saṇṭhiti avaṭṭhiti avisāhāro avikkhepo avisāhatamānasatā samatho samādhindriyaṃ samādhibalaṃ sammāsamādhīti – pātimokkhaṃ atha vāpi samādhiṃ."
    ],
    "innerText": "Pātimokkhaṃ atha vāpi samādhinti. Pātimokkhanti sīlaṃ patiṭṭhā ādi caraṇaṃ saṃyamo saṃvaro mukhaṃ pamukhaṃ kusalānaṃ dhammānaṃ samāpattiyā. Atha vāpi samādhinti yā cittassa ṭhiti saṇṭhiti avaṭṭhiti avisāhāro avikkhepo avisāhatamānasatā samatho samādhindriyaṃ samādhibalaṃ sammāsamādhīti – pātimokkhaṃ atha vāpi samādhiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha so nimmito –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Akittayī vivaṭacakkhu, sakkhidhammaṃ parissayavinayaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Paṭipadaṃ vadehi bhaddante, pātimokkhaṃ atha vāpi samādhi’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "157"
      },
      "."
    ],
    "innerText": "157."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cakkhūhi"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "neva lolassa, gāmakathāya āvaraye sotaṃ;"
      }
    ],
    "innerText": "Cakkhūhineva lolassa, gāmakathāya āvaraye sotaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Rase ca nānugijjheyya, na ca mamāyetha kiñci lokasmiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cakkhūhi"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "neva lolassā"
      },
      "ti. Kathaṃ cakkhuloloti? Idhekacco cakkhuloliyena samannāgato hoti – ‘‘adiṭṭhaṃ dakkhitabbaṃ ",
      ", diṭṭhaṃ samatikkamitabba’’nti ārāmena ārāmaṃ uyyānena uyyānaṃ gāmena gāmaṃ nigamena nigamaṃ nagarena nagaraṃ raṭṭhena raṭṭhaṃ janapadena janapadaṃ dīghacārikaṃ anavaṭṭhitacārikaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[anavatthitacārikaṃ (sī. syā.)]"
      },
      " anuyutto ca hoti rūpassa dassanāya. Evampi cakkhulolo hoti."
    ],
    "innerText": "Cakkhūhineva lolassāti. Kathaṃ cakkhuloloti? Idhekacco cakkhuloliyena samannāgato hoti – ‘‘adiṭṭhaṃ dakkhitabbaṃ , diṭṭhaṃ samatikkamitabba’’nti ārāmena ārāmaṃ uyyānena uyyānaṃ gāmena gāmaṃ nigamena nigamaṃ nagarena nagaraṃ raṭṭhena raṭṭhaṃ janapadena janapadaṃ dīghacārikaṃ anavaṭṭhitacārikaṃ [anavatthitacārikaṃ (sī. syā.)] anuyutto ca hoti rūpassa dassanāya. Evampi cakkhulolo hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha vā bhikkhu antaragharaṃ paviṭṭho vīthiṃ paṭipanno asaṃvuto gacchati hatthiṃ olokento, assaṃ olokento, rathaṃ olokento, pattiṃ olokento, itthiyo olokento, purise olokento, kumārake olokento, kumārikāyo olokento, antarāpaṇaṃ olokento ",
      ", gharamukhāni olokento, uddhaṃ olokento, adho olokento, disāvidisaṃ vipekkhamāno gacchati. Evampi cakkhulolo hoti."
    ],
    "innerText": "Atha vā bhikkhu antaragharaṃ paviṭṭho vīthiṃ paṭipanno asaṃvuto gacchati hatthiṃ olokento, assaṃ olokento, rathaṃ olokento, pattiṃ olokento, itthiyo olokento, purise olokento, kumārake olokento, kumārikāyo olokento, antarāpaṇaṃ olokento , gharamukhāni olokento, uddhaṃ olokento, adho olokento, disāvidisaṃ vipekkhamāno gacchati. Evampi cakkhulolo hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha vā bhikkhu cakkhunā rūpaṃ disvā nimittaggāhī hoti anubyañjanaggāhī. Yatvādhikaraṇamenaṃ cakkhundriyaṃ asaṃvutaṃ viharantaṃ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṃ, tassa saṃvarāya na paṭipajjati, na rakkhati cakkhundriyaṃ, cakkhundriye na saṃvaraṃ āpajjati. Evampi cakkhulolo hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṃ visūkadassanaṃ anuyuttā viharanti, seyyathidaṃ – naccaṃ gītaṃ vāditaṃ pekkhaṃ akkhānaṃ pāṇissaraṃ vetāḷaṃ kumbhathūṇaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kumbhathūnaṃ (sī. syā. ka.)]"
      },
      " sobhanakaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sobhanagarakaṃ (sī. syā.)]"
      },
      " caṇḍālaṃ vaṃsaṃ dhovanaṃ hatthiyuddhaṃ assayuddhaṃ mahiṃsayuddhaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mahisayuddhaṃ (sī. syā.)]"
      },
      " usabhayuddhaṃ ajayuddhaṃ meṇḍayuddhaṃ kukkuṭayuddhaṃ vaṭṭakayuddhaṃ daṇḍayuddhaṃ muṭṭhiyuddhaṃ nibbuddhaṃ uyyodhikaṃ ",
      " balaggaṃ senābyūhaṃ anīkadassanaṃ iti vā ",
      ". Evampi cakkhulolo hoti."
    ],
    "innerText": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṃ visūkadassanaṃ anuyuttā viharanti, seyyathidaṃ – naccaṃ gītaṃ vāditaṃ pekkhaṃ akkhānaṃ pāṇissaraṃ vetāḷaṃ kumbhathūṇaṃ [kumbhathūnaṃ (sī. syā. ka.)] sobhanakaṃ [sobhanagarakaṃ (sī. syā.)] caṇḍālaṃ vaṃsaṃ dhovanaṃ hatthiyuddhaṃ assayuddhaṃ mahiṃsayuddhaṃ [mahisayuddhaṃ (sī. syā.)] usabhayuddhaṃ ajayuddhaṃ meṇḍayuddhaṃ kukkuṭayuddhaṃ vaṭṭakayuddhaṃ daṇḍayuddhaṃ muṭṭhiyuddhaṃ nibbuddhaṃ uyyodhikaṃ balaggaṃ senābyūhaṃ anīkadassanaṃ iti vā . Evampi cakkhulolo hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ ",
      " na cakkhulolo hoti? Idha bhikkhu antaragharaṃ paviṭṭho vīthiṃ paṭipanno saṃvuto gacchati na hatthiṃ olokento, na assaṃ olokento, na rathaṃ olokento, na pattiṃ olokento, na itthiyo olokento, na purise olokento, na kumārake olokento, na kumārikāyo olokento, na antarāpaṇaṃ olokento, na gharamukhāni olokento, na uddhaṃ olokento, na adho olokento, na disāvidisāvipekkhamāno gacchati. Evampi na cakkhulolo hoti."
    ],
    "innerText": "Kathaṃ na cakkhulolo hoti? Idha bhikkhu antaragharaṃ paviṭṭho vīthiṃ paṭipanno saṃvuto gacchati na hatthiṃ olokento, na assaṃ olokento, na rathaṃ olokento, na pattiṃ olokento, na itthiyo olokento, na purise olokento, na kumārake olokento, na kumārikāyo olokento, na antarāpaṇaṃ olokento, na gharamukhāni olokento, na uddhaṃ olokento, na adho olokento, na disāvidisāvipekkhamāno gacchati. Evampi na cakkhulolo hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha vā bhikkhu cakkhunā rūpaṃ disvā na nimittaggāhī hoti nānubyañjanaggāhī. Yatvādhikaraṇamenaṃ cakkhundriyaṃ asaṃvutaṃ viharantaṃ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṃ, tassa saṃvarāya paṭipajjati, rakkhati cakkhundriyaṃ, cakkhundriye saṃvaraṃ āpajjati. Evampi na cakkhulolo hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṃ visūkadassanaṃ ananuyuttā viharanti, seyyathidaṃ – naccaṃ gītaṃ vāditaṃ pekkhaṃ akkhānaṃ…pe… anīkadassanaṃ iti vā. Evarūpā visūkadassanā paṭivirato hoti. Evampi na cakkhulolo hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cakkhūhi"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "neva lolassā"
      },
      "ti. Cakkhuloliyaṃ pajaheyya vinodeyya byantiṃ kareyya anabhāvaṃ gameyya, cakkhuloliyā ārato assa virato paṭivirato nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā ",
      " vihareyyāti – cakkhūhi neva lolassa."
    ],
    "innerText": "Cakkhūhineva lolassāti. Cakkhuloliyaṃ pajaheyya vinodeyya byantiṃ kareyya anabhāvaṃ gameyya, cakkhuloliyā ārato assa virato paṭivirato nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā vihareyyāti – cakkhūhi neva lolassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gāmakathāya āvaraye sota"
      },
      "nti. Gāmakathā vuccati bāttiṃsa tiracchānakathā, seyyathidaṃ – rājakathā corakathā mahāmattakathā senākathā bhayakathā yuddhakathā annakathā pānakathā vatthakathā yānakathā sayanakathā mālākathā gandhakathā ñātikathā gāmakathā nigamakathā ",
      " nagarakathā janapadakathā itthikathā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[itthikathā purisakathā (bahūsu)]"
      },
      " sūrakathā visikhākathā kumbhaṭṭhānakathā pubbapetakathā nānattakathā lokakkhāyikā samuddakkhāyikā itibhavābhavakathā iti vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gāmakathāya āvaraye sota"
      },
      "nti ",
      ". Gāmakathāya sotaṃ āvareyya nivāreyya saṃvareyya rakkheyya gopeyya pidaheyya pacchindeyyāti – gāmakathāya āvaraye sotaṃ."
    ],
    "innerText": "Gāmakathāya āvaraye sotanti. Gāmakathā vuccati bāttiṃsa tiracchānakathā, seyyathidaṃ – rājakathā corakathā mahāmattakathā senākathā bhayakathā yuddhakathā annakathā pānakathā vatthakathā yānakathā sayanakathā mālākathā gandhakathā ñātikathā gāmakathā nigamakathā nagarakathā janapadakathā itthikathā [itthikathā purisakathā (bahūsu)] sūrakathā visikhākathā kumbhaṭṭhānakathā pubbapetakathā nānattakathā lokakkhāyikā samuddakkhāyikā itibhavābhavakathā iti vā. Gāmakathāya āvaraye sotanti . Gāmakathāya sotaṃ āvareyya nivāreyya saṃvareyya rakkheyya gopeyya pidaheyya pacchindeyyāti – gāmakathāya āvaraye sotaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rase ca nānugijjheyyā"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rase cā"
      },
      "ti mūlaraso khandharaso tacaraso pattaraso puppharaso phalaraso ambilaṃ madhuraṃ tittakaṃ kaṭukaṃ loṇikaṃ khārikaṃ lambikaṃ kasāvo sādu asādu sītaṃ uṇhaṃ. Santeke samaṇabrāhmaṇā rasagiddhā; te jivhaggena rasaggāni pariyesantā āhiṇḍanti, te ambilaṃ labhitvā anambilaṃ pariyesanti, anambilaṃ labhitvā ambilaṃ pariyesanti…pe… sītaṃ labhitvā uṇhaṃ pariyesanti, uṇhaṃ labhitvā sītaṃ pariyesanti. Te yaṃ yaṃ labhitvā tena tena na tussanti, aparāparaṃ pariyesanti, manāpikesu rasesu rattā giddhā gadhitā mucchitā ajjhosannā laggā laggitā palibuddhā. Yassesā rasataṇhā pahīnā samucchinnā…pe… ñāṇagginā ",
      " daḍḍhā, so paṭisaṅkhā yoniso āhāraṃ āhāreti neva davāya…pe… anavajjatā ca phāsuvihāro cāti."
    ],
    "innerText": "Rase ca nānugijjheyyāti. Rase cāti mūlaraso khandharaso tacaraso pattaraso puppharaso phalaraso ambilaṃ madhuraṃ tittakaṃ kaṭukaṃ loṇikaṃ khārikaṃ lambikaṃ kasāvo sādu asādu sītaṃ uṇhaṃ. Santeke samaṇabrāhmaṇā rasagiddhā; te jivhaggena rasaggāni pariyesantā āhiṇḍanti, te ambilaṃ labhitvā anambilaṃ pariyesanti, anambilaṃ labhitvā ambilaṃ pariyesanti…pe… sītaṃ labhitvā uṇhaṃ pariyesanti, uṇhaṃ labhitvā sītaṃ pariyesanti. Te yaṃ yaṃ labhitvā tena tena na tussanti, aparāparaṃ pariyesanti, manāpikesu rasesu rattā giddhā gadhitā mucchitā ajjhosannā laggā laggitā palibuddhā. Yassesā rasataṇhā pahīnā samucchinnā…pe… ñāṇagginā daḍḍhā, so paṭisaṅkhā yoniso āhāraṃ āhāreti neva davāya…pe… anavajjatā ca phāsuvihāro cāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yathā vaṇaṃ ālimpeyya yāvadeva āruhaṇatthāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[āruhanatthāya (ka.) purābhedasuttaniddese sattamagāthāvaṇṇanāyaṃ]"
      },
      ", yathā vā pana akkhaṃ abbhañjeyya yāvadeva bhārassa nittharaṇatthāya, yathā vā puttamaṃsaṃ āhāraṃ āhāreyya yāvadeva kantārassa nittharaṇatthāya; evamevaṃ bhikkhu paṭisaṅkhā yoniso āhāraṃ ",
      " āhāreti neva davāya…pe… anavajjatā ca phāsuvihāro cāti rasataṇhaṃ pajaheyya vinodeyya byantiṃ kareyya anabhāvaṃ gameyya, rasataṇhāya ārato assa virato paṭivirato nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā vihareyyāti – rase ca nānugijjheyya."
    ],
    "innerText": "Yathā vaṇaṃ ālimpeyya yāvadeva āruhaṇatthāya [āruhanatthāya (ka.) purābhedasuttaniddese sattamagāthāvaṇṇanāyaṃ], yathā vā pana akkhaṃ abbhañjeyya yāvadeva bhārassa nittharaṇatthāya, yathā vā puttamaṃsaṃ āhāraṃ āhāreyya yāvadeva kantārassa nittharaṇatthāya; evamevaṃ bhikkhu paṭisaṅkhā yoniso āhāraṃ āhāreti neva davāya…pe… anavajjatā ca phāsuvihāro cāti rasataṇhaṃ pajaheyya vinodeyya byantiṃ kareyya anabhāvaṃ gameyya, rasataṇhāya ārato assa virato paṭivirato nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā vihareyyāti – rase ca nānugijjheyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na ca mamāyetha kiñci lokasmi"
      },
      "nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mamattā"
      },
      "ti dve mamattā – taṇhāmamattañca diṭṭhimamattañca ",
      " …pe… idaṃ taṇhāmamattaṃ…pe… idaṃ diṭṭhimamattaṃ. Taṇhāmamattaṃ pahāya diṭṭhimamattaṃ paṭinissajjitvā cakkhuṃ na mamāyeyya na gaṇheyya na parāmaseyya nābhiniviseyya; sotaṃ… ghānaṃ… jivhaṃ… kāyaṃ… rūpe… sadde… gandhe… rase… phoṭṭhabbe… kulaṃ… gaṇaṃ… āvāsaṃ… lābhaṃ… yasaṃ… pasaṃsaṃ… sukhaṃ… cīvaraṃ… piṇḍapātaṃ… senāsanaṃ… gilānapaccayabhesajjaparikkhāraṃ… kāmadhātuṃ… rūpadhātuṃ… arūpadhātuṃ… kāmabhavaṃ… rūpabhavaṃ… arūpabhavaṃ… saññābhavaṃ… asaññābhavaṃ… nevasaññānāsaññābhavaṃ ",
      "… ekavokārabhavaṃ… catuvokārabhavaṃ… pañcavokārabhavaṃ ",
      "… atītaṃ… anāgataṃ… paccuppannaṃ… diṭṭhasutamutaviññātabbe dhamme na mamāyeyya na gaṇheyya na parāmaseyya nābhiniviseyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kiñcī"
      },
      "ti kiñci rūpagataṃ vedanāgataṃ saññāgataṃ saṅkhāragataṃ viññāṇagataṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lokasmi"
      },
      "nti apāyaloke…pe… āyatanaloketi – na ca mamāyetha kiñci lokasmiṃ."
    ],
    "innerText": "Na ca mamāyetha kiñci lokasminti. Mamattāti dve mamattā – taṇhāmamattañca diṭṭhimamattañca …pe… idaṃ taṇhāmamattaṃ…pe… idaṃ diṭṭhimamattaṃ. Taṇhāmamattaṃ pahāya diṭṭhimamattaṃ paṭinissajjitvā cakkhuṃ na mamāyeyya na gaṇheyya na parāmaseyya nābhiniviseyya; sotaṃ… ghānaṃ… jivhaṃ… kāyaṃ… rūpe… sadde… gandhe… rase… phoṭṭhabbe… kulaṃ… gaṇaṃ… āvāsaṃ… lābhaṃ… yasaṃ… pasaṃsaṃ… sukhaṃ… cīvaraṃ… piṇḍapātaṃ… senāsanaṃ… gilānapaccayabhesajjaparikkhāraṃ… kāmadhātuṃ… rūpadhātuṃ… arūpadhātuṃ… kāmabhavaṃ… rūpabhavaṃ… arūpabhavaṃ… saññābhavaṃ… asaññābhavaṃ… nevasaññānāsaññābhavaṃ … ekavokārabhavaṃ… catuvokārabhavaṃ… pañcavokārabhavaṃ … atītaṃ… anāgataṃ… paccuppannaṃ… diṭṭhasutamutaviññātabbe dhamme na mamāyeyya na gaṇheyya na parāmaseyya nābhiniviseyya. Kiñcīti kiñci rūpagataṃ vedanāgataṃ saññāgataṃ saṅkhāragataṃ viññāṇagataṃ. Lokasminti apāyaloke…pe… āyatanaloketi – na ca mamāyetha kiñci lokasmiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Cakkhūhi neva lolassa, gāmakathāya āvaraye sotaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Rase ca nānugijjheyya, na ca mamāyetha kiñci lokasmi’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "158"
      },
      "."
    ],
    "innerText": "158."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Phassena yadā phuṭṭhassa, paridevaṃ bhikkhu na kareyya kuhiñci;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhavañca nābhijappeyya, bheravesu ca na sampavedheyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Phassena"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yadā phuṭṭhassā"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Phasso"
      },
      "ti rogaphasso. Rogaphassena phuṭṭho pareto samohito samannāgato assa; cakkhurogena phuṭṭho pareto samohito samannāgato assa, sotarogena…pe… ghānarogena… jivhārogena… kāyarogena… sīsarogena… kaṇṇarogena… mukharogena… dantarogena… kāsena… sāsena… pināsena… ḍāhena… jarena… kucchirogena… mucchāya… pakkhandikāya… sūlāya… visūcikāya… kuṭṭhena… gaṇḍena… kilāsena… sosena… apamārena… dadduyā… kaṇḍuyā ",
      "… kacchuyā… rakhasāya… vitacchikāya… lohitena… pittena… madhumehena… aṃsāya… piḷakāya… bhagandalena… pittasamuṭṭhānena ābādhena… semhasamuṭṭhānena ābādhena… vātasamuṭṭhānena ābādhena… sannipātikena ābādhena… utupariṇāmajena ābādhena… visamaparihārajena ābādhena… opakkamikena ābādhena… kammavipākajena ābādhena… sītena… uṇhena… jighacchāya… pipāsāya… uccārena… passāvena… ḍaṃsamakasavātātapasarīsapasamphassehi phuṭṭho pareto samohito samannāgato assāti – phassena yadā phuṭṭhassa."
    ],
    "innerText": "Phassenayadā phuṭṭhassāti. Phassoti rogaphasso. Rogaphassena phuṭṭho pareto samohito samannāgato assa; cakkhurogena phuṭṭho pareto samohito samannāgato assa, sotarogena…pe… ghānarogena… jivhārogena… kāyarogena… sīsarogena… kaṇṇarogena… mukharogena… dantarogena… kāsena… sāsena… pināsena… ḍāhena… jarena… kucchirogena… mucchāya… pakkhandikāya… sūlāya… visūcikāya… kuṭṭhena… gaṇḍena… kilāsena… sosena… apamārena… dadduyā… kaṇḍuyā … kacchuyā… rakhasāya… vitacchikāya… lohitena… pittena… madhumehena… aṃsāya… piḷakāya… bhagandalena… pittasamuṭṭhānena ābādhena… semhasamuṭṭhānena ābādhena… vātasamuṭṭhānena ābādhena… sannipātikena ābādhena… utupariṇāmajena ābādhena… visamaparihārajena ābādhena… opakkamikena ābādhena… kammavipākajena ābādhena… sītena… uṇhena… jighacchāya… pipāsāya… uccārena… passāvena… ḍaṃsamakasavātātapasarīsapasamphassehi phuṭṭho pareto samohito samannāgato assāti – phassena yadā phuṭṭhassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paridevaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhikkhu na kareyya kuhiñcī"
      },
      "ti. Ādevaṃ paridevaṃ ādevanaṃ paridevanaṃ ādevitattaṃ paridevitattaṃ vācā palāpaṃ vippalāpaṃ lālappaṃ lālappāyanaṃ lālappāyitattaṃ na kareyya na janeyya na sañjaneyya na ",
      " nibbatteyya nābhinibbatteyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kuhiñcī"
      },
      "ti kuhiñci kimhici katthaci ajjhattaṃ vā bahiddhā vā ajjhattabahiddhā vāti – paridevaṃ bhikkhu na kareyya kuhiñci."
    ],
    "innerText": "Paridevaṃbhikkhu na kareyya kuhiñcīti. Ādevaṃ paridevaṃ ādevanaṃ paridevanaṃ ādevitattaṃ paridevitattaṃ vācā palāpaṃ vippalāpaṃ lālappaṃ lālappāyanaṃ lālappāyitattaṃ na kareyya na janeyya na sañjaneyya na nibbatteyya nābhinibbatteyya. Kuhiñcīti kuhiñci kimhici katthaci ajjhattaṃ vā bahiddhā vā ajjhattabahiddhā vāti – paridevaṃ bhikkhu na kareyya kuhiñci."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhavañca nābhijappeyyā"
      },
      "ti. Kāmabhavaṃ na jappeyya, rūpabhavaṃ na jappeyya, arūpabhavaṃ na jappeyya na pajappeyya nābhijappeyyāti – bhavañca nābhijappeyya."
    ],
    "innerText": "Bhavañca nābhijappeyyāti. Kāmabhavaṃ na jappeyya, rūpabhavaṃ na jappeyya, arūpabhavaṃ na jappeyya na pajappeyya nābhijappeyyāti – bhavañca nābhijappeyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bheravesu ca na sampavedheyyā"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bheravā"
      },
      "ti ekenākārena bhayampi bheravampi taññeva. Vuttañhetaṃ ",
      " bhagavatā – ‘‘etaṃ nūna taṃ bhayaṃ bheravaṃ na jahe āgacchatī’’ti. Bahiddhārammaṇaṃ vuttaṃ sīhā byagghā ",
      " dīpī acchā taracchā kokā mahiṃsā assā hatthī ahi vicchikā satapadī, corā vā assu mānavā vā katakammā vā akatakammā vā. Athāparena ākārena bhayaṃ vuccati ajjhattikaṃ cittasamuṭṭhānaṃ bhayaṃ bhayānakaṃ chambhitattaṃ lomahaṃso cetaso ubbego utrāso, jātibhayaṃ jarābhayaṃ byādhibhayaṃ maraṇabhayaṃ rājabhayaṃ corabhayaṃ aggibhayaṃ udakabhayaṃ attānuvādabhayaṃ parānuvādabhayaṃ daṇḍabhayaṃ duggatibhayaṃ ūmibhayaṃ kumbhīlabhayaṃ āvaṭṭabhayaṃ susukābhayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[suṃsukābhayaṃ (syā.)]"
      },
      " ājīvikabhayaṃ asilokabhayaṃ parisāya sārajjabhayaṃ madanabhayaṃ duggatibhayaṃ bhayaṃ bhayānakaṃ chambhitattaṃ lomahaṃso cetaso ubbego utrāso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bheravesu ca na sampavedheyyā"
      },
      "ti bherave passitvā vā suṇitvā vā na vedheyya na pavedheyya na sampavedheyya na taseyya na uttaseyya na paritaseyya na bhāyeyya na santāsaṃ āpajjeyya, abhīrū assa achambhī anutrāsī apalāyī, pahīnabhayabheravo vigatalomahaṃso vihareyyāti – bheravesu ca na sampavedheyya."
    ],
    "innerText": "Bheravesu ca na sampavedheyyāti. Bheravāti ekenākārena bhayampi bheravampi taññeva. Vuttañhetaṃ bhagavatā – ‘‘etaṃ nūna taṃ bhayaṃ bheravaṃ na jahe āgacchatī’’ti. Bahiddhārammaṇaṃ vuttaṃ sīhā byagghā dīpī acchā taracchā kokā mahiṃsā assā hatthī ahi vicchikā satapadī, corā vā assu mānavā vā katakammā vā akatakammā vā. Athāparena ākārena bhayaṃ vuccati ajjhattikaṃ cittasamuṭṭhānaṃ bhayaṃ bhayānakaṃ chambhitattaṃ lomahaṃso cetaso ubbego utrāso, jātibhayaṃ jarābhayaṃ byādhibhayaṃ maraṇabhayaṃ rājabhayaṃ corabhayaṃ aggibhayaṃ udakabhayaṃ attānuvādabhayaṃ parānuvādabhayaṃ daṇḍabhayaṃ duggatibhayaṃ ūmibhayaṃ kumbhīlabhayaṃ āvaṭṭabhayaṃ susukābhayaṃ [suṃsukābhayaṃ (syā.)] ājīvikabhayaṃ asilokabhayaṃ parisāya sārajjabhayaṃ madanabhayaṃ duggatibhayaṃ bhayaṃ bhayānakaṃ chambhitattaṃ lomahaṃso cetaso ubbego utrāso. Bheravesu ca na sampavedheyyāti bherave passitvā vā suṇitvā vā na vedheyya na pavedheyya na sampavedheyya na taseyya na uttaseyya na paritaseyya na bhāyeyya na santāsaṃ āpajjeyya, abhīrū assa achambhī anutrāsī apalāyī, pahīnabhayabheravo vigatalomahaṃso vihareyyāti – bheravesu ca na sampavedheyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Phassena yadā phuṭṭhassa, paridevaṃ bhikkhu na kareyya kuhiñci;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhavañca nābhijappeyya, bheravesu ca na sampavedheyyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "159"
      },
      "."
    ],
    "innerText": "159."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Annānamatho pānānaṃ, khādanīyānamathopi vatthānaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Laddhā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na sannidhiṃ kayirā, na ca parittase tāni alabhamāno."
      }
    ],
    "innerText": "Laddhāna sannidhiṃ kayirā, na ca parittase tāni alabhamāno."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Annānamatho"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pānānaṃ, khādanīyānamathopi vatthāna"
      },
      "nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Annāna"
      },
      "nti odano kummāso sattu maccho maṃsaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pānāna"
      },
      "nti aṭṭha pānāni – ambapānaṃ, jambupānaṃ, cocapānaṃ, mocapānaṃ, madhupānaṃ ",
      ", muddikapānaṃ, sālukapānaṃ, phārusakapānaṃ. Aparānipi aṭṭha pānāni – kosambapānaṃ, kolapānaṃ, badarapānaṃ, ghatapānaṃ, telapānaṃ, payopānaṃ, yāgupānaṃ, rasapānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khādanīyāna"
      },
      "nti piṭṭhakhajjakaṃ, pūvakhajjakaṃ, mūlakhajjakaṃ, tacakhajjakaṃ, pattakhajjakaṃ, pupphakhajjakaṃ, phalakhajjakaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vatthāna"
      },
      "nti cha cīvarāni – khomaṃ, kappāsikaṃ, koseyyaṃ, kambalaṃ, sāṇaṃ, bhaṅganti – annānamatho pānānaṃ khādanīyānamathopi vatthānaṃ."
    ],
    "innerText": "Annānamathopānānaṃ, khādanīyānamathopi vatthānanti. Annānanti odano kummāso sattu maccho maṃsaṃ. Pānānanti aṭṭha pānāni – ambapānaṃ, jambupānaṃ, cocapānaṃ, mocapānaṃ, madhupānaṃ , muddikapānaṃ, sālukapānaṃ, phārusakapānaṃ. Aparānipi aṭṭha pānāni – kosambapānaṃ, kolapānaṃ, badarapānaṃ, ghatapānaṃ, telapānaṃ, payopānaṃ, yāgupānaṃ, rasapānaṃ. Khādanīyānanti piṭṭhakhajjakaṃ, pūvakhajjakaṃ, mūlakhajjakaṃ, tacakhajjakaṃ, pattakhajjakaṃ, pupphakhajjakaṃ, phalakhajjakaṃ. Vatthānanti cha cīvarāni – khomaṃ, kappāsikaṃ, koseyyaṃ, kambalaṃ, sāṇaṃ, bhaṅganti – annānamatho pānānaṃ khādanīyānamathopi vatthānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Laddhā na sannidhiṃ kayirā"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Laddhā"
      },
      "ti laddhā labhitvā adhigantvā vinditvā paṭilabhitvā na kuhanāya, na lapanāya, na nemittikatāya, na nippesikatāya, na lābhena lābhaṃ nijigīsanatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[nijigiṃsanatāya (sī. syā.)]"
      },
      ", na kaṭṭhadānena, na veḷudānena, na pattadānena, na pupphadānena, na phaladānena, na sinānadānena, na cuṇṇadānena, na mattikādānena, na dantakaṭṭhadānena, na mukhodakadānena, na cāṭukamyatāya, na muggasūpyatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[na muggasuppatāya (sī.), na muggasūpatāya (syā.)]"
      },
      ", na pāribhaṭayayatāya, na pīṭhamaddikatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[piṭṭhimaṃsikatāya (sī.), piṭṭhimaddikatāya (ka.)]"
      },
      ", na vatthuvijjāya, na tiracchānavijjāya, na aṅgavijjāya, na nakkhattavijjāya, na dūtagamanena, na pahiṇagamanena, na jaṅghapesaniyena, na vejjakammena, na navakammena, na piṇḍapaṭipiṇḍakena, na ",
      " dānānuppadānena dhammena samena laddhā labhitvā adhigantvā vinditvā paṭilabhitvāti – laddhā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na sannidhiṃ kayirā"
      },
      "ti annasannidhiṃ pānasannidhiṃ vatthasannidhiṃ yānasannidhiṃ sayanasannidhiṃ gandhasannidhiṃ āmisasannidhiṃ na kareyya na janeyya na sañjaneyya na nibbatteyya nābhinibbatteyyāti – laddhā na sannidhiṃ kayirā."
    ],
    "innerText": "Laddhā na sannidhiṃ kayirāti. Laddhāti laddhā labhitvā adhigantvā vinditvā paṭilabhitvā na kuhanāya, na lapanāya, na nemittikatāya, na nippesikatāya, na lābhena lābhaṃ nijigīsanatāya [nijigiṃsanatāya (sī. syā.)], na kaṭṭhadānena, na veḷudānena, na pattadānena, na pupphadānena, na phaladānena, na sinānadānena, na cuṇṇadānena, na mattikādānena, na dantakaṭṭhadānena, na mukhodakadānena, na cāṭukamyatāya, na muggasūpyatāya [na muggasuppatāya (sī.), na muggasūpatāya (syā.)], na pāribhaṭayayatāya, na pīṭhamaddikatāya [piṭṭhimaṃsikatāya (sī.), piṭṭhimaddikatāya (ka.)], na vatthuvijjāya, na tiracchānavijjāya, na aṅgavijjāya, na nakkhattavijjāya, na dūtagamanena, na pahiṇagamanena, na jaṅghapesaniyena, na vejjakammena, na navakammena, na piṇḍapaṭipiṇḍakena, na dānānuppadānena dhammena samena laddhā labhitvā adhigantvā vinditvā paṭilabhitvāti – laddhā. Na sannidhiṃ kayirāti annasannidhiṃ pānasannidhiṃ vatthasannidhiṃ yānasannidhiṃ sayanasannidhiṃ gandhasannidhiṃ āmisasannidhiṃ na kareyya na janeyya na sañjaneyya na nibbatteyya nābhinibbatteyyāti – laddhā na sannidhiṃ kayirā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na ca parittase tāni alabhamāno"
      },
      "ti. Annaṃ vā na labhāmi ",
      ", pānaṃ vā na labhāmi, vatthaṃ vā na labhāmi, kulaṃ vā na labhāmi, gaṇaṃ vā na labhāmi, āvāsaṃ vā na labhāmi, lābhaṃ vā na labhāmi, yasaṃ vā na labhāmi, pasaṃsaṃ vā na labhāmi, sukhaṃ vā na labhāmi, cīvaraṃ vā na labhāmi, piṇḍapātaṃ vā na labhāmi, senāsanaṃ vā na labhāmi, gilānapaccayabhesajjaparikkhāraṃ vā na labhāmi, gilānupaṭṭhākaṃ vā na labhāmi, ‘‘appaññātomhī’’ti na taseyya na uttaseyya na parittaseyya na bhāyeyya na santāsaṃ āpajjeyya ",
      ", abhīrū assa achambhī anutrāsī apalāyī, pahīnabhayabheravo vigatalomahaṃso vihareyyāti – na ca parittase tāni alabhamāno."
    ],
    "innerText": "Na ca parittase tāni alabhamānoti. Annaṃ vā na labhāmi , pānaṃ vā na labhāmi, vatthaṃ vā na labhāmi, kulaṃ vā na labhāmi, gaṇaṃ vā na labhāmi, āvāsaṃ vā na labhāmi, lābhaṃ vā na labhāmi, yasaṃ vā na labhāmi, pasaṃsaṃ vā na labhāmi, sukhaṃ vā na labhāmi, cīvaraṃ vā na labhāmi, piṇḍapātaṃ vā na labhāmi, senāsanaṃ vā na labhāmi, gilānapaccayabhesajjaparikkhāraṃ vā na labhāmi, gilānupaṭṭhākaṃ vā na labhāmi, ‘‘appaññātomhī’’ti na taseyya na uttaseyya na parittaseyya na bhāyeyya na santāsaṃ āpajjeyya , abhīrū assa achambhī anutrāsī apalāyī, pahīnabhayabheravo vigatalomahaṃso vihareyyāti – na ca parittase tāni alabhamāno."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Annānamatho pānānaṃ, khādanīyānamathopi vatthānaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Laddhā na sannidhiṃ kayirā, na ca parittase tāni alabhamāno’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "160"
      },
      "."
    ],
    "innerText": "160."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jhāyī"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na pādalolassa, virame kukkuccā nappamajjeyya;"
      }
    ],
    "innerText": "Jhāyīna pādalolassa, virame kukkuccā nappamajjeyya;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Athāsanesu sayanesu, appasaddesu bhikkhu vihareyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jhāyī na pādalolassā"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jhāyī"
      },
      "ti paṭhamenapi jhānena jhāyī, dutiyenapi jhānena jhāyī, tatiyenapi jhānena jhāyī, catutthenapi jhānena jhāyī, savitakkasavicārenapi jhānena jhāyī, avitakkavicāramattenapi jhānena jhāyī, avitakkaavicārenapi jhānena jhāyī, sappītikenapi jhānena jhāyī, nippītikenapi jhānena jhāyī, pītisahagatenapi jhānena jhāyī, sātasahagatenapi jhānena jhāyī, sukhasahagatenapi jhānena jhāyī, upekkhāsahagatenapi jhānena jhāyī, suññatenapi jhānena jhāyī, animittenapi jhānena jhāyī, appaṇihitenapi jhānena jhāyī, lokiyenapi jhānena jhāyī, lokuttarenapi jhānena jhāyī, jhānarato ekattamanuyutto paramatthagarukoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sadatthagarukoti (sī. syā.)]"
      },
      " – jhāyī."
    ],
    "innerText": "Jhāyī na pādalolassāti. Jhāyīti paṭhamenapi jhānena jhāyī, dutiyenapi jhānena jhāyī, tatiyenapi jhānena jhāyī, catutthenapi jhānena jhāyī, savitakkasavicārenapi jhānena jhāyī, avitakkavicāramattenapi jhānena jhāyī, avitakkaavicārenapi jhānena jhāyī, sappītikenapi jhānena jhāyī, nippītikenapi jhānena jhāyī, pītisahagatenapi jhānena jhāyī, sātasahagatenapi jhānena jhāyī, sukhasahagatenapi jhānena jhāyī, upekkhāsahagatenapi jhānena jhāyī, suññatenapi jhānena jhāyī, animittenapi jhānena jhāyī, appaṇihitenapi jhānena jhāyī, lokiyenapi jhānena jhāyī, lokuttarenapi jhānena jhāyī, jhānarato ekattamanuyutto paramatthagarukoti [sadatthagarukoti (sī. syā.)] – jhāyī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pādalolassā"
      },
      "ti. Kathaṃ pādalolo hoti? Idhekacco pādaloliyena samannāgato hoti ārāmena ārāmaṃ uyyānena uyyānaṃ gāmena gāmaṃ nigamena nigamaṃ nagarena nagaraṃ raṭṭhena raṭṭhaṃ janapadena janapadaṃ dīghacārikaṃ anavaṭṭhitacārikaṃ anuyutto viharati. Evampi pādalolo hoti."
    ],
    "innerText": "Napādalolassāti. Kathaṃ pādalolo hoti? Idhekacco pādaloliyena samannāgato hoti ārāmena ārāmaṃ uyyānena uyyānaṃ gāmena gāmaṃ nigamena nigamaṃ nagarena nagaraṃ raṭṭhena raṭṭhaṃ janapadena janapadaṃ dīghacārikaṃ anavaṭṭhitacārikaṃ anuyutto viharati. Evampi pādalolo hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha vā bhikkhu antopisaṅghārāme pādaloliyena samannāgato hoti. Na atthahetu na kāraṇahetu uddhato avūpasantacitto ",
      " pariveṇato pariveṇaṃ gacchati vihārato vihāraṃ gacchati aḍḍhayogato ",
      " aḍḍhayogaṃ gacchati pāsādato pāsādaṃ gacchati hammiyato hammiyaṃ gacchati guhāya guhaṃ gacchati leṇato leṇaṃ gacchati kuṭito kuṭiṃ gacchati kūṭāgārato kūṭāgāraṃ gacchati aṭṭato aṭṭaṃ gacchati māḷato māḷaṃ gacchati uddaṇḍato uddaṇḍaṃ gacchati upaṭṭhānasālato upaṭṭhānasālaṃ gacchati maṇḍalamāḷato maṇḍalamāḷaṃ gacchati rukkhamūlato rukkhamūlaṃ gacchati. Yattha vā pana bhikkhū nisīdanti tahiṃ gacchati, tattha ekassa vā dutiyo hoti, dvinnaṃ vā tatiyo hoti, tiṇṇaṃ vā catuttho hoti. Tattha bahuṃ samphappalāpaṃ palapati, seyyathidaṃ – rājakathaṃ corakathaṃ mahāmattakathaṃ senākathaṃ bhayakathaṃ yuddhakathaṃ annakathaṃ pānakathaṃ vatthakathaṃ yānakathaṃ sayanakathaṃ mālākathaṃ gandhakathaṃ ñātikathaṃ gāmakathaṃ nigamakathaṃ nagarakathaṃ janapadakathaṃ itthikathaṃ sūrakathaṃ visikhākathaṃ kumbhaṭṭhānakathaṃ pubbapetakathaṃ nānattakathaṃ lokakkhāyikaṃ samuddakkhāyikaṃ iti bhavābhavakathaṃ iti vā. Evampi pādalolo hoti."
    ],
    "innerText": "Atha vā bhikkhu antopisaṅghārāme pādaloliyena samannāgato hoti. Na atthahetu na kāraṇahetu uddhato avūpasantacitto pariveṇato pariveṇaṃ gacchati vihārato vihāraṃ gacchati aḍḍhayogato aḍḍhayogaṃ gacchati pāsādato pāsādaṃ gacchati hammiyato hammiyaṃ gacchati guhāya guhaṃ gacchati leṇato leṇaṃ gacchati kuṭito kuṭiṃ gacchati kūṭāgārato kūṭāgāraṃ gacchati aṭṭato aṭṭaṃ gacchati māḷato māḷaṃ gacchati uddaṇḍato uddaṇḍaṃ gacchati upaṭṭhānasālato upaṭṭhānasālaṃ gacchati maṇḍalamāḷato maṇḍalamāḷaṃ gacchati rukkhamūlato rukkhamūlaṃ gacchati. Yattha vā pana bhikkhū nisīdanti tahiṃ gacchati, tattha ekassa vā dutiyo hoti, dvinnaṃ vā tatiyo hoti, tiṇṇaṃ vā catuttho hoti. Tattha bahuṃ samphappalāpaṃ palapati, seyyathidaṃ – rājakathaṃ corakathaṃ mahāmattakathaṃ senākathaṃ bhayakathaṃ yuddhakathaṃ annakathaṃ pānakathaṃ vatthakathaṃ yānakathaṃ sayanakathaṃ mālākathaṃ gandhakathaṃ ñātikathaṃ gāmakathaṃ nigamakathaṃ nagarakathaṃ janapadakathaṃ itthikathaṃ sūrakathaṃ visikhākathaṃ kumbhaṭṭhānakathaṃ pubbapetakathaṃ nānattakathaṃ lokakkhāyikaṃ samuddakkhāyikaṃ iti bhavābhavakathaṃ iti vā. Evampi pādalolo hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pādalolassā"
      },
      "ti. Pādaloliyaṃ pajaheyya vinodeyya byantiṃ kareyya anabhāvaṃ gameyya, pādaloliyā ārato assa virato paṭivirato ",
      " nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā vihareyya careyya vicareyya iriyeyya vatteyya pāleyya yapeyya yāpeyya, paṭisallānārāmo assa paṭisallānarato ajjhattaṃ cetosamathamanuyutto ",
      " anirākatajjhāno vipassanā samannāgato brūhetā suññāgārānaṃ jhāyī jhānarato ekattamanuyutto paramatthagarukoti – jhāyī na pādalolassa."
    ],
    "innerText": "Napādalolassāti. Pādaloliyaṃ pajaheyya vinodeyya byantiṃ kareyya anabhāvaṃ gameyya, pādaloliyā ārato assa virato paṭivirato nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā vihareyya careyya vicareyya iriyeyya vatteyya pāleyya yapeyya yāpeyya, paṭisallānārāmo assa paṭisallānarato ajjhattaṃ cetosamathamanuyutto anirākatajjhāno vipassanā samannāgato brūhetā suññāgārānaṃ jhāyī jhānarato ekattamanuyutto paramatthagarukoti – jhāyī na pādalolassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Virame kukkuccā nappamajjeyyā"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kukkucca"
      },
      "nti hatthakukkuccampi kukkuccaṃ, pādakukkuccampi kukkuccaṃ, hatthapādakukkuccampi kukkuccaṃ, akappiye kappiyasaññitā, kappiye akappiyasaññitā, avajje vajjasaññitā, vajje avajjasaññitā, yaṃ evarūpaṃ kukkuccaṃ kukkuccāyanā kukkuccāyitattaṃ cetaso vippaṭisāro manovilekho – idaṃ vuccati kukkuccaṃ."
    ],
    "innerText": "Virame kukkuccā nappamajjeyyāti. Kukkuccanti hatthakukkuccampi kukkuccaṃ, pādakukkuccampi kukkuccaṃ, hatthapādakukkuccampi kukkuccaṃ, akappiye kappiyasaññitā, kappiye akappiyasaññitā, avajje vajjasaññitā, vajje avajjasaññitā, yaṃ evarūpaṃ kukkuccaṃ kukkuccāyanā kukkuccāyitattaṃ cetaso vippaṭisāro manovilekho – idaṃ vuccati kukkuccaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Api ca dvīhi kāraṇehi uppajjati kukkuccaṃ cetaso vippaṭisāro manovilekho – katattā ca akatattā ca. Kathaṃ katattā ca akatattā ca uppajjati kukkuccaṃ cetaso vippaṭisāro manovilekho? ‘‘Kataṃ me kāyaduccaritaṃ, akataṃ me kāyasucarita’’nti uppajjati kukkuccaṃ cetaso ",
      " vippaṭisāro manovilekho, ‘‘kataṃ me vacīduccaritaṃ, akataṃ me vacīsucarita’’nti uppajjati kukkuccaṃ cetaso vippaṭisāro manovilekho, ‘‘kataṃ me manoduccaritaṃ, akataṃ me manosucaritanti…pe… ‘‘kato me pāṇātipāto, akatā me pāṇātipātā veramaṇī’’ti uppajjati kukkuccaṃ…pe… manovilekho, ‘‘kataṃ me adinnādānaṃ… kato me kāmesumicchācāro… kato me musāvādo… katā me pisuṇavācā… katā me pharusavācā… kato me samphappalāpo… katā me abhijjhā… kato me byāpādo… katā me micchādiṭṭhi, akatā me sammādiṭṭhī’’ti uppajjati kukkuccaṃ cetaso vippaṭisāro manovilekho ",
      ". Evaṃ katattā ca akatattā ca uppajjati kukkuccaṃ cetaso vippaṭisāro manovilekho."
    ],
    "innerText": "Api ca dvīhi kāraṇehi uppajjati kukkuccaṃ cetaso vippaṭisāro manovilekho – katattā ca akatattā ca. Kathaṃ katattā ca akatattā ca uppajjati kukkuccaṃ cetaso vippaṭisāro manovilekho? ‘‘Kataṃ me kāyaduccaritaṃ, akataṃ me kāyasucarita’’nti uppajjati kukkuccaṃ cetaso vippaṭisāro manovilekho, ‘‘kataṃ me vacīduccaritaṃ, akataṃ me vacīsucarita’’nti uppajjati kukkuccaṃ cetaso vippaṭisāro manovilekho, ‘‘kataṃ me manoduccaritaṃ, akataṃ me manosucaritanti…pe… ‘‘kato me pāṇātipāto, akatā me pāṇātipātā veramaṇī’’ti uppajjati kukkuccaṃ…pe… manovilekho, ‘‘kataṃ me adinnādānaṃ… kato me kāmesumicchācāro… kato me musāvādo… katā me pisuṇavācā… katā me pharusavācā… kato me samphappalāpo… katā me abhijjhā… kato me byāpādo… katā me micchādiṭṭhi, akatā me sammādiṭṭhī’’ti uppajjati kukkuccaṃ cetaso vippaṭisāro manovilekho . Evaṃ katattā ca akatattā ca uppajjati kukkuccaṃ cetaso vippaṭisāro manovilekho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha vā ‘‘sīlesumhi ",
      " na paripūrakārī’’ti uppajjati kukkuccaṃ cetaso vippaṭisāro manovilekho, ‘‘indriyesumhi aguttadvāro’’ti…pe… ‘‘bhojane amattaññumhī’’ti… ‘‘jāgariyaṃ ananuyuttomhī’’ti… ‘‘na satisampajaññena samannāgatomhī’’ti… ‘‘abhāvitā me cattāro satipaṭṭhānā’’ti… ‘‘abhāvitā me cattāro sammappadhānā’’ti… ‘‘abhāvitā me cattāro ",
      " iddhipādā’’ti… ‘‘abhāvitāni me pañcindriyānī’’ti… ‘‘abhāvitāni me pañca balānī’’ti… ‘‘abhāvitā me satta bojjhaṅgā’’ti… ‘‘abhāvito me ariyo aṭṭhaṅgiko maggo’’ti… ‘‘dukkhaṃ me apariññāta’’nti… ‘‘samudayo me appahīno’’ti… ‘‘maggo me abhāvito’’ti… ‘‘nirodho me asacchikato’’ti uppajjati kukkuccaṃ cetaso vippaṭisāro manovilekho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Virame kukkuccā"
      },
      "ti kukkuccā ārameyya virameyya paṭivirameyya kukkuccaṃ pajaheyya vinodeyya byantiṃ kareyya anabhāvaṃ gameyya. Kukkuccā ārato assa virato paṭivirato nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā vihareyyāti – virame kukkuccā."
    ],
    "innerText": "Atha vā ‘‘sīlesumhi na paripūrakārī’’ti uppajjati kukkuccaṃ cetaso vippaṭisāro manovilekho, ‘‘indriyesumhi aguttadvāro’’ti…pe… ‘‘bhojane amattaññumhī’’ti… ‘‘jāgariyaṃ ananuyuttomhī’’ti… ‘‘na satisampajaññena samannāgatomhī’’ti… ‘‘abhāvitā me cattāro satipaṭṭhānā’’ti… ‘‘abhāvitā me cattāro sammappadhānā’’ti… ‘‘abhāvitā me cattāro iddhipādā’’ti… ‘‘abhāvitāni me pañcindriyānī’’ti… ‘‘abhāvitāni me pañca balānī’’ti… ‘‘abhāvitā me satta bojjhaṅgā’’ti… ‘‘abhāvito me ariyo aṭṭhaṅgiko maggo’’ti… ‘‘dukkhaṃ me apariññāta’’nti… ‘‘samudayo me appahīno’’ti… ‘‘maggo me abhāvito’’ti… ‘‘nirodho me asacchikato’’ti uppajjati kukkuccaṃ cetaso vippaṭisāro manovilekho. Virame kukkuccāti kukkuccā ārameyya virameyya paṭivirameyya kukkuccaṃ pajaheyya vinodeyya byantiṃ kareyya anabhāvaṃ gameyya. Kukkuccā ārato assa virato paṭivirato nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā vihareyyāti – virame kukkuccā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nappamajjeyyā"
      },
      "ti sakkaccakārī assa sātaccakārī aṭṭhitakārī anolīnavuttiko anikkhittacchando anikkhittadhuro appamādo kusalesu dhammesu. ‘‘Kadāhaṃ aparipūraṃ vā sīlakkhandhaṃ paripūreyyaṃ, paripūraṃ vā sīlakkhandhaṃ tattha tattha paññāya anuggaṇheyya’’nti? Yo tattha chando ca vāyāmo ca ussāho ca ussoḷhī ca thāmo ca appaṭivānī ca sati ",
      " ca sampajaññañca ātappaṃ padhānaṃ adhiṭṭhānaṃ anuyogo appamādo kusalesu dhammesu ",
      ". ‘‘Kadāhaṃ aparipūraṃ vā samādhikkhandhaṃ…pe… paññākkhandhaṃ… vimuttikkhandhaṃ… vimuttiñāṇadassanakkhandhaṃ… kadāhaṃ apariññātaṃ vā dukkhaṃ parijāneyyaṃ, appahīne vā kilese pajaheyyaṃ, abhāvitaṃ vā maggaṃ bhāveyyaṃ, asacchikataṃ vā nirodhaṃ sacchikareyya’’nti? Yo tattha chando ca vāyāmo ca ussāho ca ussoḷhī ca thāmo ca appaṭivānī ca sati ca sampajaññañca ātappaṃ ",
      " padhānaṃ adhiṭṭhānaṃ anuyogo appamādo kusalesu dhammesūti – virame kukkuccā nappamajjeyya."
    ],
    "innerText": "Nappamajjeyyāti sakkaccakārī assa sātaccakārī aṭṭhitakārī anolīnavuttiko anikkhittacchando anikkhittadhuro appamādo kusalesu dhammesu. ‘‘Kadāhaṃ aparipūraṃ vā sīlakkhandhaṃ paripūreyyaṃ, paripūraṃ vā sīlakkhandhaṃ tattha tattha paññāya anuggaṇheyya’’nti? Yo tattha chando ca vāyāmo ca ussāho ca ussoḷhī ca thāmo ca appaṭivānī ca sati ca sampajaññañca ātappaṃ padhānaṃ adhiṭṭhānaṃ anuyogo appamādo kusalesu dhammesu . ‘‘Kadāhaṃ aparipūraṃ vā samādhikkhandhaṃ…pe… paññākkhandhaṃ… vimuttikkhandhaṃ… vimuttiñāṇadassanakkhandhaṃ… kadāhaṃ apariññātaṃ vā dukkhaṃ parijāneyyaṃ, appahīne vā kilese pajaheyyaṃ, abhāvitaṃ vā maggaṃ bhāveyyaṃ, asacchikataṃ vā nirodhaṃ sacchikareyya’’nti? Yo tattha chando ca vāyāmo ca ussāho ca ussoḷhī ca thāmo ca appaṭivānī ca sati ca sampajaññañca ātappaṃ padhānaṃ adhiṭṭhānaṃ anuyogo appamādo kusalesu dhammesūti – virame kukkuccā nappamajjeyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Athāsanesu sayanesu, appasaddesu bhikkhu vihareyyā"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Athā"
      },
      "ti padasandhi…pe… āsanaṃ vuccati yattha nisīdati – mañco pīṭhaṃ bhisi taṭṭikā cammakhaṇḍo tiṇasanthāro paṇṇasanthāro palālasanthāro. Sayanaṃ vuccati senāsanaṃ vihāro aḍḍhayogo pāsādo hammiyaṃ guhāti – athāsanesu sayanesu."
    ],
    "innerText": "Athāsanesu sayanesu, appasaddesu bhikkhu vihareyyāti. Athāti padasandhi…pe… āsanaṃ vuccati yattha nisīdati – mañco pīṭhaṃ bhisi taṭṭikā cammakhaṇḍo tiṇasanthāro paṇṇasanthāro palālasanthāro. Sayanaṃ vuccati senāsanaṃ vihāro aḍḍhayogo pāsādo hammiyaṃ guhāti – athāsanesu sayanesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appasaddesu bhikkhu vihareyyā"
      },
      "ti. Appasaddesu appanigghosesu vijanavātesu manussarāhasseyyakesu paṭisallānasāruppesu senāsanesu careyya vicareyya vihareyya iriyeyya vatteyya pāleyya yapeyya yāpeyyāti – athāsanesu sayanesu appasaddesu bhikkhu vihareyya."
    ],
    "innerText": "Appasaddesu bhikkhu vihareyyāti. Appasaddesu appanigghosesu vijanavātesu manussarāhasseyyakesu paṭisallānasāruppesu senāsanesu careyya vicareyya vihareyya iriyeyya vatteyya pāleyya yapeyya yāpeyyāti – athāsanesu sayanesu appasaddesu bhikkhu vihareyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tenāha ",
      " bhagavā –"
    ],
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Jhāyī na pādalolassa, virame kukkuccā nappamajjeyya;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Athāsanesu ",
      " sayanesu, appasaddesu bhikkhu vihareyyā’’ti."
    ],
    "innerText": "Athāsanesu sayanesu, appasaddesu bhikkhu vihareyyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "161"
      },
      "."
    ],
    "innerText": "161."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Niddaṃ na bahulīkareyya, jāgariyaṃ bhajeyya ātāpī;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tandiṃ māyaṃ hassaṃ khiḍḍaṃ, methunaṃ vippajahe savibhūsaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Niddaṃ na bahulīkareyyā"
      },
      "ti. Rattindivaṃ chakoṭṭhāsaṃ kāretvā pañcakoṭṭhāsaṃ paṭipajjeyya ekakoṭṭhāsaṃ nippajjeyyāti – niddaṃ na bahulīkareyya."
    ],
    "innerText": "Niddaṃ na bahulīkareyyāti. Rattindivaṃ chakoṭṭhāsaṃ kāretvā pañcakoṭṭhāsaṃ paṭipajjeyya ekakoṭṭhāsaṃ nippajjeyyāti – niddaṃ na bahulīkareyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jāgariyaṃ bhajeyya ātāpī"
      },
      "ti. Idha bhikkhu divasaṃ caṅkamena nisajjāya āvaraṇīyehi dhammehi cittaṃ parisodheyya, rattiyā paṭhamaṃ yāmaṃ caṅkamena nisajjāya āvaraṇīyehi dhammehi cittaṃ parisodheyya, rattiyā majjhimaṃ ",
      " yāmaṃ ",
      " dakkhiṇena passena sīhaseyyaṃ kappeyya pādepādaṃ accādhāya sato sampajāno uṭṭhānasaññaṃ manasikaritvā, rattiyā pacchimaṃ yāmaṃ paccuṭṭhāya caṅkamena nisajjāya āvaraṇīyehi dhammehi cittaṃ parisodheyya."
    ],
    "innerText": "Jāgariyaṃ bhajeyya ātāpīti. Idha bhikkhu divasaṃ caṅkamena nisajjāya āvaraṇīyehi dhammehi cittaṃ parisodheyya, rattiyā paṭhamaṃ yāmaṃ caṅkamena nisajjāya āvaraṇīyehi dhammehi cittaṃ parisodheyya, rattiyā majjhimaṃ yāmaṃ dakkhiṇena passena sīhaseyyaṃ kappeyya pādepādaṃ accādhāya sato sampajāno uṭṭhānasaññaṃ manasikaritvā, rattiyā pacchimaṃ yāmaṃ paccuṭṭhāya caṅkamena nisajjāya āvaraṇīyehi dhammehi cittaṃ parisodheyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jāgariyaṃ bhajeyyā"
      },
      "ti jāgariyaṃ bhajeyya sambhajeyya seveyya niseveyya saṃseveyya paṭiseveyyāti – jāgariyaṃ bhajeyya."
    ],
    "innerText": "Jāgariyaṃ bhajeyyāti jāgariyaṃ bhajeyya sambhajeyya seveyya niseveyya saṃseveyya paṭiseveyyāti – jāgariyaṃ bhajeyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ātāpī"
      },
      "ti. Ātappaṃ vuccati vīriyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[viriyaṃ (sī. syā.)]"
      },
      ". Yo cetasiko vīriyārambho nikkamo parakkamo uyyāmo vāyāmo ussāho ussoḷhī thāmo ṭhiti asithilaparakkamatā anikkhittacchandatā anikkhittadhuratā dhurasampaggaho vīriyaṃ ",
      " vīriyindriyaṃ vīriyabalaṃ sammāvāyāmo. Iminā ātāpena upeto samupeto upagato samupagato upapanno samupapanno samannāgato so vuccati ātāpīti – jāgariyaṃ bhajeyya ātāpī."
    ],
    "innerText": "Ātāpīti. Ātappaṃ vuccati vīriyaṃ [viriyaṃ (sī. syā.)]. Yo cetasiko vīriyārambho nikkamo parakkamo uyyāmo vāyāmo ussāho ussoḷhī thāmo ṭhiti asithilaparakkamatā anikkhittacchandatā anikkhittadhuratā dhurasampaggaho vīriyaṃ vīriyindriyaṃ vīriyabalaṃ sammāvāyāmo. Iminā ātāpena upeto samupeto upagato samupagato upapanno samupapanno samannāgato so vuccati ātāpīti – jāgariyaṃ bhajeyya ātāpī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tandiṃ māyaṃ hassaṃ khiḍḍaṃ, methunaṃ vippajahe savibhūsa"
      },
      "nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tandī"
      },
      "ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[tandinti (sī.)]"
      },
      " tandī tandiyanā tandiyitattaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[natthi attadaṇḍasuttaniddese khuddakavatthuvibhaṅgepi]"
      },
      " tandimanakatā ālasyaṃ ālasyāyanā ālasyāyitattaṃ. Māyā vuccati vañcanikā cariyā. Idhekacco kāyena duccaritaṃ caritvā…pe… vācāya manasā duccaritaṃ caritvā tassa paṭicchādanahetu pāpikaṃ icchaṃ paṇidahati. Mā maṃ jaññāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[jaññūti (ka.)]"
      },
      " icchati, mā maṃ jaññāti saṅkappeti, mā maṃ jaññāti vācaṃ bhāsati, mā maṃ jaññāti kāyena parakkamati. Yā evarūpā ",
      " māyāvitā accasarā vañcanā nikati nikiraṇā pariharaṇā gūhanā parigūhanā chādanā paricchādanā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[paṭicchādanā (sī. ka.) mahāniddese]"
      },
      " anuttānīkammaṃ anāvikammaṃ vocchādanā pāpakiriyā – ayaṃ vuccati māyā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hassa"
      },
      "nti idhekacco ativelaṃ dantavidaṃsakaṃ hasati. Vuttañhetaṃ bhagavatā – ‘‘kumārakamidaṃ, bhikkhave ",
      ", ariyassa vinaye yadidaṃ ativelaṃ dantavidaṃsakaṃ hasita’’nti."
    ],
    "innerText": "Tandiṃ māyaṃ hassaṃ khiḍḍaṃ, methunaṃ vippajahe savibhūsanti. Tandīti [tandinti (sī.)] tandī tandiyanā tandiyitattaṃ [natthi attadaṇḍasuttaniddese khuddakavatthuvibhaṅgepi] tandimanakatā ālasyaṃ ālasyāyanā ālasyāyitattaṃ. Māyā vuccati vañcanikā cariyā. Idhekacco kāyena duccaritaṃ caritvā…pe… vācāya manasā duccaritaṃ caritvā tassa paṭicchādanahetu pāpikaṃ icchaṃ paṇidahati. Mā maṃ jaññāti [jaññūti (ka.)] icchati, mā maṃ jaññāti saṅkappeti, mā maṃ jaññāti vācaṃ bhāsati, mā maṃ jaññāti kāyena parakkamati. Yā evarūpā māyāvitā accasarā vañcanā nikati nikiraṇā pariharaṇā gūhanā parigūhanā chādanā paricchādanā [paṭicchādanā (sī. ka.) mahāniddese] anuttānīkammaṃ anāvikammaṃ vocchādanā pāpakiriyā – ayaṃ vuccati māyā. Hassanti idhekacco ativelaṃ dantavidaṃsakaṃ hasati. Vuttañhetaṃ bhagavatā – ‘‘kumārakamidaṃ, bhikkhave , ariyassa vinaye yadidaṃ ativelaṃ dantavidaṃsakaṃ hasita’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khiḍḍā"
      },
      "ti dve khiḍḍā – kāyikā ca khiḍḍā vācasikā ca khiḍḍā. Katamā kāyikā khiḍḍā? Hatthīhipi kīḷanti, assehipi kīḷanti, rathehipi kīḷanti, dhanūhipi kīḷanti, aṭṭhapadehipi kīḷanti, dasapadehipi kīḷanti, ākāsepi kīḷanti, parihārapathepi kīḷanti, santikāyapi kīḷanti ",
      ", khalikāyapi kīḷanti, ghaṭikāyapi kīḷanti, salākahatthenapi kīḷanti, akkhenapi kīḷanti, paṅkacīrenapi kīḷanti ",
      ", vaṅkakenapi kīḷanti, mokkhacikāyapi kīḷanti, ciṅgulakenapi kīḷanti, pattāḷhakenapi kīḷanti, rathakenapi kīḷanti, dhanukenapi kīḷanti, akkharikāyapi kīḷanti, manesikāyapi kīḷanti, yathāvajjenapi kīḷanti – ayaṃ kāyikā khiḍḍā. Katamā vācasikā khiḍḍā? Mukhabherikaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mukhabheriyaṃ (syā.)]"
      },
      " mukhālambaraṃ mukhaḍiṇḍimakaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mukhadeṇḍimakaṃ (sī. syā.)]"
      },
      " mukhavalimakaṃ mukhabheruḷakaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mukhabherulakaṃ (sī.)]"
      },
      " mukhadaddarikaṃ nāṭakaṃ lāpaṃ gītaṃ davakammaṃ – ayaṃ vācasikā khiḍḍā."
    ],
    "innerText": "Khiḍḍāti dve khiḍḍā – kāyikā ca khiḍḍā vācasikā ca khiḍḍā. Katamā kāyikā khiḍḍā? Hatthīhipi kīḷanti, assehipi kīḷanti, rathehipi kīḷanti, dhanūhipi kīḷanti, aṭṭhapadehipi kīḷanti, dasapadehipi kīḷanti, ākāsepi kīḷanti, parihārapathepi kīḷanti, santikāyapi kīḷanti , khalikāyapi kīḷanti, ghaṭikāyapi kīḷanti, salākahatthenapi kīḷanti, akkhenapi kīḷanti, paṅkacīrenapi kīḷanti , vaṅkakenapi kīḷanti, mokkhacikāyapi kīḷanti, ciṅgulakenapi kīḷanti, pattāḷhakenapi kīḷanti, rathakenapi kīḷanti, dhanukenapi kīḷanti, akkharikāyapi kīḷanti, manesikāyapi kīḷanti, yathāvajjenapi kīḷanti – ayaṃ kāyikā khiḍḍā. Katamā vācasikā khiḍḍā? Mukhabherikaṃ [mukhabheriyaṃ (syā.)] mukhālambaraṃ mukhaḍiṇḍimakaṃ [mukhadeṇḍimakaṃ (sī. syā.)] mukhavalimakaṃ mukhabheruḷakaṃ [mukhabherulakaṃ (sī.)] mukhadaddarikaṃ nāṭakaṃ lāpaṃ gītaṃ davakammaṃ – ayaṃ vācasikā khiḍḍā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Methunadhammo nāma yo so asaddhammo gāmadhammo vasaladhammo duṭṭhullo odakantiko rahasso dvayaṃdvayasamāpatti. Kiṃkāraṇā vuccati methunadhammo? Ubhinnaṃ rattānaṃ sārattānaṃ avassutānaṃ pariyuṭṭhitānaṃ pariyādinnacittānaṃ ubhinnaṃ sadisānaṃ dhammoti, taṃkāraṇā vuccati methunadhammo. Yathā ubho kalahakārakā methunakāti vuccanti, ubho bhaṇḍanakārakā…pe… ubho bhassakārakā… ubho adhikaraṇakārakā… ubho vivādakārakā… ubho vādino… ubho sallāpakā methunakāti vuccanti ",
      "; evameva ubhinnaṃ rattānaṃ sārattānaṃ avassutānaṃ pariyuṭṭhitānaṃ pariyādinnacittānaṃ ubhinnaṃ sadisānaṃ dhammoti, taṃkāraṇā vuccati methunadhammo."
    ],
    "innerText": "Methunadhammo nāma yo so asaddhammo gāmadhammo vasaladhammo duṭṭhullo odakantiko rahasso dvayaṃdvayasamāpatti. Kiṃkāraṇā vuccati methunadhammo? Ubhinnaṃ rattānaṃ sārattānaṃ avassutānaṃ pariyuṭṭhitānaṃ pariyādinnacittānaṃ ubhinnaṃ sadisānaṃ dhammoti, taṃkāraṇā vuccati methunadhammo. Yathā ubho kalahakārakā methunakāti vuccanti, ubho bhaṇḍanakārakā…pe… ubho bhassakārakā… ubho adhikaraṇakārakā… ubho vivādakārakā… ubho vādino… ubho sallāpakā methunakāti vuccanti ; evameva ubhinnaṃ rattānaṃ sārattānaṃ avassutānaṃ pariyuṭṭhitānaṃ pariyādinnacittānaṃ ubhinnaṃ sadisānaṃ dhammoti, taṃkāraṇā vuccati methunadhammo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vibhūsā"
      },
      "ti dve vibhūsā – atthi agāriyassa vibhūsā, atthi pabbajitassa vibhūsā. Katamā agāriyassa vibhūsā? Kesā ca massu ca mālā ca gandhā ",
      " ca vilepanā ca ābharaṇā ca pilandhanā ca vatthañca sayanāsanañca veṭhanañca ucchādanaṃ parimaddanaṃ nhāpanaṃ sambāhanaṃ ādāsaṃ añjanaṃ mālāvilepanaṃ mukhacuṇṇakaṃ mukhalepaṃ hatthabandhaṃ sikhābandhaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vasikkhābandhaṃ (syā.)]"
      },
      " daṇḍanāḷiyaṃ khaggaṃ chattaṃ citrā upāhanā uṇhīsaṃ maṇiṃ vāḷabījaniṃ odātāni vatthāni dīghadasāni iti vā – ayaṃ agāriyassa vibhūsā. Katamā pabbajitassa vibhūsā? Cīvaramaṇḍanā ",
      " pattamaṇḍanā senāsanamaṇḍanā imassa vā pūtikāyassa bāhirānaṃ vā parikkhārānaṃ maṇḍanā vibhūsanā keḷanā parikeḷanā gedhitatā gedhitattaṃ capalatā cāpalyaṃ – ayaṃ pabbajitassa vibhūsā."
    ],
    "innerText": "Vibhūsāti dve vibhūsā – atthi agāriyassa vibhūsā, atthi pabbajitassa vibhūsā. Katamā agāriyassa vibhūsā? Kesā ca massu ca mālā ca gandhā ca vilepanā ca ābharaṇā ca pilandhanā ca vatthañca sayanāsanañca veṭhanañca ucchādanaṃ parimaddanaṃ nhāpanaṃ sambāhanaṃ ādāsaṃ añjanaṃ mālāvilepanaṃ mukhacuṇṇakaṃ mukhalepaṃ hatthabandhaṃ sikhābandhaṃ [vasikkhābandhaṃ (syā.)] daṇḍanāḷiyaṃ khaggaṃ chattaṃ citrā upāhanā uṇhīsaṃ maṇiṃ vāḷabījaniṃ odātāni vatthāni dīghadasāni iti vā – ayaṃ agāriyassa vibhūsā. Katamā pabbajitassa vibhūsā? Cīvaramaṇḍanā pattamaṇḍanā senāsanamaṇḍanā imassa vā pūtikāyassa bāhirānaṃ vā parikkhārānaṃ maṇḍanā vibhūsanā keḷanā parikeḷanā gedhitatā gedhitattaṃ capalatā cāpalyaṃ – ayaṃ pabbajitassa vibhūsā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tandiṃ māyaṃ hassaṃ khiḍḍaṃ, methunaṃ vippajahe savibhūsa"
      },
      "nti. Tandiñca māyañca hassañca khiḍḍañca methunadhammañca savibhūsaṃ saparivāraṃ saparibhaṇḍaṃ saparikkhāraṃ pajaheyya vinodeyya byantiṃ kareyya anabhāvaṃ gameyyāti – tandiṃ māyaṃ hassaṃ khiḍḍaṃ, methunaṃ vippajahe savibhūsaṃ."
    ],
    "innerText": "Tandiṃ māyaṃ hassaṃ khiḍḍaṃ, methunaṃ vippajahe savibhūsanti. Tandiñca māyañca hassañca khiḍḍañca methunadhammañca savibhūsaṃ saparivāraṃ saparibhaṇḍaṃ saparikkhāraṃ pajaheyya vinodeyya byantiṃ kareyya anabhāvaṃ gameyyāti – tandiṃ māyaṃ hassaṃ khiḍḍaṃ, methunaṃ vippajahe savibhūsaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Niddaṃ ",
      " na bahulīkareyya, jāgariyaṃ bhajeyya ātāpī;"
    ],
    "innerText": "‘‘Niddaṃ na bahulīkareyya, jāgariyaṃ bhajeyya ātāpī;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tandiṃ māyaṃ hassaṃ khiḍḍaṃ, methunaṃ vippajahe savibhūsa’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "162"
      },
      "."
    ],
    "innerText": "162."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āthabbaṇaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "supinaṃ lakkhaṇaṃ, no vidahe athopi nakkhattaṃ;"
      }
    ],
    "innerText": "Āthabbaṇaṃsupinaṃ lakkhaṇaṃ, no vidahe athopi nakkhattaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Virutañca"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gabbhakaraṇaṃ, tikicchaṃ māmako na seveyya."
      }
    ],
    "innerText": "Virutañcagabbhakaraṇaṃ, tikicchaṃ māmako na seveyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āthabbaṇaṃ supinaṃ lakkhaṇaṃ, no vidahe athopi nakkhatta"
      },
      "nti. Āthabbaṇikā āthabbaṇaṃ payojenti, nagare vā ruddhe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[rundhe (ka.)]"
      },
      " saṅgāme vā paccupaṭṭhite parasenapaccatthikesu paccāmittesu ītiṃ uppādenti, upaddavaṃ uppādenti, rogaṃ uppādenti, pajjarakaṃ karonti, sūlaṃ karonti, visūcikaṃ karonti, pakkhandikaṃ karonti. Evaṃ āthabbaṇikā āthabbaṇaṃ payojenti."
    ],
    "innerText": "Āthabbaṇaṃ supinaṃ lakkhaṇaṃ, no vidahe athopi nakkhattanti. Āthabbaṇikā āthabbaṇaṃ payojenti, nagare vā ruddhe [rundhe (ka.)] saṅgāme vā paccupaṭṭhite parasenapaccatthikesu paccāmittesu ītiṃ uppādenti, upaddavaṃ uppādenti, rogaṃ uppādenti, pajjarakaṃ karonti, sūlaṃ karonti, visūcikaṃ karonti, pakkhandikaṃ karonti. Evaṃ āthabbaṇikā āthabbaṇaṃ payojenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Supinapāṭhakā supinaṃ ādisanti, yo pubbaṇhasamayaṃ supinaṃ passati, evaṃ vipāko hoti. Yo majjhanhikasamayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[majjhantikasamayaṃ (bahūsu)]"
      },
      " supinaṃ passati, evaṃ vipāko hoti. Yo sāyanhasamayaṃ supinaṃ passati, evaṃ vipāko hoti. Yo purime yāme…pe… yo majjhime yāme… yo pacchime yāme… yo dakkhiṇena passena nipanno… yo vāmena passena nipanno… yo uttānaṃ nipanno… yo avakujja nipanno… yo candaṃ passati… yo sūriyaṃ passati… yo mahāsamuddaṃ passati… yo sineruṃ pabbatarājānaṃ passati… yo hatthiṃ passati… yo assaṃ passati… yo rathaṃ passati… yo pattiṃ passati… yo senābyūhaṃ passati… yo ārāmarāmaṇeyyakaṃ passati… yo vanarāmaṇeyyakaṃ passati… yo bhūmirāmaṇeyyakaṃ passati… yo pokkharaṇīrāmaṇeyyakaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pokkharaṇirāmaṇeyyakaṃ (syā.)]"
      },
      " passati, evaṃ vipāko hotīti. Evaṃ supinapāṭhakā supinaṃ ādisanti."
    ],
    "innerText": "Supinapāṭhakā supinaṃ ādisanti, yo pubbaṇhasamayaṃ supinaṃ passati, evaṃ vipāko hoti. Yo majjhanhikasamayaṃ [majjhantikasamayaṃ (bahūsu)] supinaṃ passati, evaṃ vipāko hoti. Yo sāyanhasamayaṃ supinaṃ passati, evaṃ vipāko hoti. Yo purime yāme…pe… yo majjhime yāme… yo pacchime yāme… yo dakkhiṇena passena nipanno… yo vāmena passena nipanno… yo uttānaṃ nipanno… yo avakujja nipanno… yo candaṃ passati… yo sūriyaṃ passati… yo mahāsamuddaṃ passati… yo sineruṃ pabbatarājānaṃ passati… yo hatthiṃ passati… yo assaṃ passati… yo rathaṃ passati… yo pattiṃ passati… yo senābyūhaṃ passati… yo ārāmarāmaṇeyyakaṃ passati… yo vanarāmaṇeyyakaṃ passati… yo bhūmirāmaṇeyyakaṃ passati… yo pokkharaṇīrāmaṇeyyakaṃ [pokkharaṇirāmaṇeyyakaṃ (syā.)] passati, evaṃ vipāko hotīti. Evaṃ supinapāṭhakā supinaṃ ādisanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Lakkhaṇapāṭhakā ",
      " lakkhaṇaṃ ādisanti – maṇilakkhaṇaṃ daṇḍalakkhaṇaṃ ",
      " vatthalakkhaṇaṃ asilakkhaṇaṃ usulakkhaṇaṃ dhanulakkhaṇaṃ āvudhalakkhaṇaṃ itthilakkhaṇaṃ purisalakkhaṇaṃ kumārikālakkhaṇaṃ kumāralakkhaṇaṃ dāsilakkhaṇaṃ dāsalakkhaṇaṃ hatthilakkhaṇaṃ assalakkhaṇaṃ mahiṃsalakkhaṇaṃ usabhalakkhaṇaṃ goṇalakkhaṇaṃ ",
      " ajalakkhaṇaṃ meṇḍalakkhaṇaṃ ",
      " kukkuṭalakkhaṇaṃ vaṭṭalakkhaṇaṃ godhālakkhaṇaṃ kaṇṇikālakkhaṇaṃ kacchapalakkhaṇaṃ migalakkhaṇaṃ iti vāti. Evaṃ lakkhaṇapāṭhakā lakkhaṇaṃ ādisanti."
    ],
    "innerText": "Lakkhaṇapāṭhakā lakkhaṇaṃ ādisanti – maṇilakkhaṇaṃ daṇḍalakkhaṇaṃ vatthalakkhaṇaṃ asilakkhaṇaṃ usulakkhaṇaṃ dhanulakkhaṇaṃ āvudhalakkhaṇaṃ itthilakkhaṇaṃ purisalakkhaṇaṃ kumārikālakkhaṇaṃ kumāralakkhaṇaṃ dāsilakkhaṇaṃ dāsalakkhaṇaṃ hatthilakkhaṇaṃ assalakkhaṇaṃ mahiṃsalakkhaṇaṃ usabhalakkhaṇaṃ goṇalakkhaṇaṃ ajalakkhaṇaṃ meṇḍalakkhaṇaṃ kukkuṭalakkhaṇaṃ vaṭṭalakkhaṇaṃ godhālakkhaṇaṃ kaṇṇikālakkhaṇaṃ kacchapalakkhaṇaṃ migalakkhaṇaṃ iti vāti. Evaṃ lakkhaṇapāṭhakā lakkhaṇaṃ ādisanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nakkhattapāṭhakā nakkhattaṃ ādisanti. Aṭṭhavīsati nakkhattāni. Iminā nakkhattena gharappaveso kattabbo, iminā nakkhattena makuṭaṃ bandhitabbaṃ, iminā nakkhattena vāreyyaṃ kāretabbaṃ, iminā nakkhattena bījanīhāro ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[bījanihāro (syā. ka.)]"
      },
      " kattabbo, iminā nakkhattena saṃvāso ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[gharavāso (syā.)]"
      },
      " gantabboti. Evaṃ nakkhattapāṭhakā nakkhattaṃ ādisanti."
    ],
    "innerText": "Nakkhattapāṭhakā nakkhattaṃ ādisanti. Aṭṭhavīsati nakkhattāni. Iminā nakkhattena gharappaveso kattabbo, iminā nakkhattena makuṭaṃ bandhitabbaṃ, iminā nakkhattena vāreyyaṃ kāretabbaṃ, iminā nakkhattena bījanīhāro [bījanihāro (syā. ka.)] kattabbo, iminā nakkhattena saṃvāso [gharavāso (syā.)] gantabboti. Evaṃ nakkhattapāṭhakā nakkhattaṃ ādisanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āthabbaṇaṃ supinaṃ lakkhaṇaṃ, no vidahe athopi nakkhatta"
      },
      "nti. Āthabbaṇañca supinañca lakkhaṇañca nakkhattañca no vidaheyya na careyya na samācareyya na samādāya vatteyya. Atha vā na gaṇheyya na uggaṇheyya na dhāreyya na upadhāreyya na upalakkheyya nappayojeyyāti – āthabbaṇaṃ supinaṃ lakkhaṇaṃ, no vidahe athopi nakkhattaṃ."
    ],
    "innerText": "Āthabbaṇaṃ supinaṃ lakkhaṇaṃ, no vidahe athopi nakkhattanti. Āthabbaṇañca supinañca lakkhaṇañca nakkhattañca no vidaheyya na careyya na samācareyya na samādāya vatteyya. Atha vā na gaṇheyya na uggaṇheyya na dhāreyya na upadhāreyya na upalakkheyya nappayojeyyāti – āthabbaṇaṃ supinaṃ lakkhaṇaṃ, no vidahe athopi nakkhattaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Virutañca gabbhakaraṇaṃ, tikicchaṃ māmako na seveyyā"
      },
      "ti. Virutaṃ vuccati migavākkaṃ. Migavākkapāṭhakā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[migacakkaṃ. migacakkapāṭhakā (syā.)]"
      },
      " migavākkaṃ ādisanti – sakuntānaṃ vā catuppadānaṃ vā rutaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[rudaṃ (syā.)]"
      },
      " vassitaṃ jānantīti. Evaṃ migavākkapāṭhakā migavākkaṃ ādisanti. Gabbhakaraṇīyā gabbhaṃ saṇṭhāpenti. Dvīhi ",
      " kāraṇehi gabbho na saṇṭhāti – pāṇakehi vā vātakuppehi vā. Pāṇakānaṃ vā vātakuppānaṃ vā paṭighātāya osadhaṃ dentīti. Evaṃ gabbhakaraṇīyā gabbhaṃ saṇṭhāpenti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tikicchā"
      },
      "ti pañca tikicchā – sālākiyaṃ, sallakattiyaṃ, kāyatikicchaṃ, bhūtiyaṃ, komārabhaccaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Māmako"
      },
      "ti buddhamāmako dhammamāmako saṅghamāmako, so vā bhagavantaṃ mamāyati bhagavā vā taṃ puggalaṃ pariggaṇhāti. Vuttañhetaṃ ",
      " bhagavatā – ‘‘ye te, bhikkhave, bhikkhū kuhā thaddhā lapā siṅgī unnaḷā asamāhitā na me te, bhikkhave, bhikkhū māmakā, apagatā ca te, bhikkhave, bhikkhū imasmā dhammavinayā, na ca te bhikkhū imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjanti. Ye ca kho, bhikkhave, bhikkhū nikkuhā nillapā dhīrā atthaddhā susamāhitā te kho me, bhikkhave, bhikkhū māmakā na ca apagatā te ",
      ", bhikkhave, bhikkhū imasmā dhammavinayā, te ca bhikkhū imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjanti’’."
    ],
    "innerText": "Virutañca gabbhakaraṇaṃ, tikicchaṃ māmako na seveyyāti. Virutaṃ vuccati migavākkaṃ. Migavākkapāṭhakā [migacakkaṃ. migacakkapāṭhakā (syā.)] migavākkaṃ ādisanti – sakuntānaṃ vā catuppadānaṃ vā rutaṃ [rudaṃ (syā.)] vassitaṃ jānantīti. Evaṃ migavākkapāṭhakā migavākkaṃ ādisanti. Gabbhakaraṇīyā gabbhaṃ saṇṭhāpenti. Dvīhi kāraṇehi gabbho na saṇṭhāti – pāṇakehi vā vātakuppehi vā. Pāṇakānaṃ vā vātakuppānaṃ vā paṭighātāya osadhaṃ dentīti. Evaṃ gabbhakaraṇīyā gabbhaṃ saṇṭhāpenti. Tikicchāti pañca tikicchā – sālākiyaṃ, sallakattiyaṃ, kāyatikicchaṃ, bhūtiyaṃ, komārabhaccaṃ. Māmakoti buddhamāmako dhammamāmako saṅghamāmako, so vā bhagavantaṃ mamāyati bhagavā vā taṃ puggalaṃ pariggaṇhāti. Vuttañhetaṃ bhagavatā – ‘‘ye te, bhikkhave, bhikkhū kuhā thaddhā lapā siṅgī unnaḷā asamāhitā na me te, bhikkhave, bhikkhū māmakā, apagatā ca te, bhikkhave, bhikkhū imasmā dhammavinayā, na ca te bhikkhū imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjanti. Ye ca kho, bhikkhave, bhikkhū nikkuhā nillapā dhīrā atthaddhā susamāhitā te kho me, bhikkhave, bhikkhū māmakā na ca apagatā te , bhikkhave, bhikkhū imasmā dhammavinayā, te ca bhikkhū imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjanti’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Kuhā ",
      " thaddhā lapā siṅgī, unnaḷā asamāhitā;"
    ],
    "innerText": "‘‘Kuhā thaddhā lapā siṅgī, unnaḷā asamāhitā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Na te dhamme virūhanti, sammāsambuddhadesite."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Nikkuhā nillapā dhīrā, atthaddhā susamāhitā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Te ve dhamme virūhanti, sammāsambuddhadesite’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Virutañca gabbhakaraṇaṃ, tikicchaṃ māmako na seveyyā"
      },
      "ti. Virutañca gabbhakaraṇañca tikicchañca māmako na seveyya na niseveyya na saṃseveyya nappaṭiseveyya na careyya na samācareyya na samādāya vatteyya. Atha ",
      " vā na gaṇheyya na uggaṇheyya na dhāreyya na upadhāreyya na upalakkheyya nappayojeyyāti – virutañca gabbhakaraṇaṃ tikicchaṃ māmako na seveyya."
    ],
    "innerText": "Virutañca gabbhakaraṇaṃ, tikicchaṃ māmako na seveyyāti. Virutañca gabbhakaraṇañca tikicchañca māmako na seveyya na niseveyya na saṃseveyya nappaṭiseveyya na careyya na samācareyya na samādāya vatteyya. Atha vā na gaṇheyya na uggaṇheyya na dhāreyya na upadhāreyya na upalakkheyya nappayojeyyāti – virutañca gabbhakaraṇaṃ tikicchaṃ māmako na seveyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Āthabbaṇaṃ supinaṃ lakkhaṇaṃ, no vidahe athopi nakkhattaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Virutañca gabbhakaraṇaṃ, tikicchaṃ māmako na seveyyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "163"
      },
      "."
    ],
    "innerText": "163."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nindāya"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nappavedheyya, na unnameyya pasaṃsito bhikkhu;"
      }
    ],
    "innerText": "Nindāyanappavedheyya, na unnameyya pasaṃsito bhikkhu;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Lobhaṃ saha macchariyena, kodhaṃ pesuṇiyañca panudeyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nindāya nappavedheyyā"
      },
      "ti. Idhekacce bhikkhū nindanti jātiyā vā gottena vā kolaputtiyena vā vaṇṇapokkharatāya vā dhanena vā ajjhenena vā kammāyatanena vā sippāyatanena vā vijjāṭṭhānena vā sutena vā paṭibhānena vā aññataraññatarena vā vatthunā nindanti garahanti upavadanti, nindito garahito upavadito nindāya garahāya upavādena akittiyā avaṇṇahārikāya na vedheyya nappavedheyya na sampavedheyya na taseyya na uttaseyya na paritaseyya na bhāyeyya na santāsaṃ āpajjeyya, abhīrū assa achambhī anutrāsī apalāyī, pahīnabhayabheravo vigatalomahaṃso vihareyyāti ",
      " – nindāya nappavedheyya."
    ],
    "innerText": "Nindāya nappavedheyyāti. Idhekacce bhikkhū nindanti jātiyā vā gottena vā kolaputtiyena vā vaṇṇapokkharatāya vā dhanena vā ajjhenena vā kammāyatanena vā sippāyatanena vā vijjāṭṭhānena vā sutena vā paṭibhānena vā aññataraññatarena vā vatthunā nindanti garahanti upavadanti, nindito garahito upavadito nindāya garahāya upavādena akittiyā avaṇṇahārikāya na vedheyya nappavedheyya na sampavedheyya na taseyya na uttaseyya na paritaseyya na bhāyeyya na santāsaṃ āpajjeyya, abhīrū assa achambhī anutrāsī apalāyī, pahīnabhayabheravo vigatalomahaṃso vihareyyāti – nindāya nappavedheyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "unnameyya pasaṃsito bhikkhū"
      },
      "ti. Idhekacce bhikkhū pasaṃsanti jātiyā vā gottena vā kolaputtiyena vā vaṇṇapokkharatāya vā dhanena vā ajjhenena vā kammāyatanena vā sippāyatanena vā vijjāṭṭhānena vā ",
      " sutena vā paṭibhānena vā aññataraññatarena vā vatthunā pasaṃsanti thomenti kittenti vaṇṇenti, pasaṃsito thomito kittito vaṇṇito pasaṃsāya thomanena kittiyā vaṇṇahārikāya unnatiṃ na kareyya unnamaṃ na kareyya mānaṃ na kareyya thambhaṃ na kareyya, na tena mānaṃ janeyya na tena thaddho assa patthaddho paggahitasiroti – na unnameyya pasaṃsito bhikkhu."
    ],
    "innerText": "Naunnameyya pasaṃsito bhikkhūti. Idhekacce bhikkhū pasaṃsanti jātiyā vā gottena vā kolaputtiyena vā vaṇṇapokkharatāya vā dhanena vā ajjhenena vā kammāyatanena vā sippāyatanena vā vijjāṭṭhānena vā sutena vā paṭibhānena vā aññataraññatarena vā vatthunā pasaṃsanti thomenti kittenti vaṇṇenti, pasaṃsito thomito kittito vaṇṇito pasaṃsāya thomanena kittiyā vaṇṇahārikāya unnatiṃ na kareyya unnamaṃ na kareyya mānaṃ na kareyya thambhaṃ na kareyya, na tena mānaṃ janeyya na tena thaddho assa patthaddho paggahitasiroti – na unnameyya pasaṃsito bhikkhu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lobhaṃ saha macchariyena, kodhaṃ pesuṇiyañca panudeyyā"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lobho"
      },
      "ti yo lobho lubbhanā lubbhitattaṃ sārāgo sārajjanā sārajjitattaṃ abhijjhā lobho akusalamūlaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Macchariya"
      },
      "nti pañca macchariyāni – āvāsamacchariyaṃ…pe… gāho vuccati macchariyaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kodho"
      },
      "ti yo cittassa āghāto paṭighāto paṭighaṃ paṭivirodho, kopo pakopo sampakopo, doso padoso sampadoso, cittassa byāpatti manopadoso, kodho kujjhanā kujjhitattaṃ, doso dussanā dussitattaṃ, byāpattiṃ byāpajjanā byāpajjitattaṃ, virodho ",
      " paṭivirodho caṇḍikkaṃ asuropo anattamanatā cittassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pesuñña"
      },
      "nti idhekacco pisuṇavāco hoti ito sutvā amutra akkhātā imesaṃ bhedāya, amutra vā sutvā imesaṃ akkhātā amūsaṃ bhedāya. Iti samaggānaṃ vā bhettā bhinnānaṃ vā anuppadātā, vaggārāmo vaggarato vagganandī vaggakaraṇiṃ ",
      " vācaṃ bhāsitā hoti – idaṃ vuccati pesuññaṃ."
    ],
    "innerText": "Lobhaṃ saha macchariyena, kodhaṃ pesuṇiyañca panudeyyāti. Lobhoti yo lobho lubbhanā lubbhitattaṃ sārāgo sārajjanā sārajjitattaṃ abhijjhā lobho akusalamūlaṃ. Macchariyanti pañca macchariyāni – āvāsamacchariyaṃ…pe… gāho vuccati macchariyaṃ. Kodhoti yo cittassa āghāto paṭighāto paṭighaṃ paṭivirodho, kopo pakopo sampakopo, doso padoso sampadoso, cittassa byāpatti manopadoso, kodho kujjhanā kujjhitattaṃ, doso dussanā dussitattaṃ, byāpattiṃ byāpajjanā byāpajjitattaṃ, virodho paṭivirodho caṇḍikkaṃ asuropo anattamanatā cittassa. Pesuññanti idhekacco pisuṇavāco hoti ito sutvā amutra akkhātā imesaṃ bhedāya, amutra vā sutvā imesaṃ akkhātā amūsaṃ bhedāya. Iti samaggānaṃ vā bhettā bhinnānaṃ vā anuppadātā, vaggārāmo vaggarato vagganandī vaggakaraṇiṃ vācaṃ bhāsitā hoti – idaṃ vuccati pesuññaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Api ca dvīhi kāraṇehi pesuññaṃ upasaṃharati – piyakamyatāya vā bhedādhippāyena vā. Kathaṃ piyakamyatāya pesuññaṃ upasaṃharati? Imassa piyo bhavissāmi manāpo bhavissāmi vissāsiko bhavissāmi abbhantariko bhavissāmi suhadayo bhavissāmīti. Evaṃ piyakamyatāya pesuññaṃ upasaṃharati. Kathaṃ bhedādhippāyena pesuññaṃ upasaṃharati? Kathaṃ ime nānā assu vinā assu vaggā assu dvedhā assu dvejjhā assu dve pakkhā assu bhijjheyyuṃ na samāgaccheyyuṃ dukkhaṃ na phāsu vihareyyunti. Evaṃ bhedādhippāyena pesuññaṃ upasaṃharati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lobhaṃ saha macchariyena, kodhaṃ pesuṇiyañca panudeyyā"
      },
      "ti. Lobhañca macchariyañca kodhañca pesuññañca nudeyya panudeyya pajaheyya vinodeyya byantiṃ kareyya anabhāvaṃ gameyyāti – lobhaṃ saha macchariyena, kodhaṃ pesuṇiyañca panudeyya."
    ],
    "innerText": "Api ca dvīhi kāraṇehi pesuññaṃ upasaṃharati – piyakamyatāya vā bhedādhippāyena vā. Kathaṃ piyakamyatāya pesuññaṃ upasaṃharati? Imassa piyo bhavissāmi manāpo bhavissāmi vissāsiko bhavissāmi abbhantariko bhavissāmi suhadayo bhavissāmīti. Evaṃ piyakamyatāya pesuññaṃ upasaṃharati. Kathaṃ bhedādhippāyena pesuññaṃ upasaṃharati? Kathaṃ ime nānā assu vinā assu vaggā assu dvedhā assu dvejjhā assu dve pakkhā assu bhijjheyyuṃ na samāgaccheyyuṃ dukkhaṃ na phāsu vihareyyunti. Evaṃ bhedādhippāyena pesuññaṃ upasaṃharati. Lobhaṃ saha macchariyena, kodhaṃ pesuṇiyañca panudeyyāti. Lobhañca macchariyañca kodhañca pesuññañca nudeyya panudeyya pajaheyya vinodeyya byantiṃ kareyya anabhāvaṃ gameyyāti – lobhaṃ saha macchariyena, kodhaṃ pesuṇiyañca panudeyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tenāha ",
      " bhagavā –"
    ],
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Nindāya ",
      " nappavedheyya, na unnameyya pasaṃsito bhikkhu;"
    ],
    "innerText": "‘‘Nindāya nappavedheyya, na unnameyya pasaṃsito bhikkhu;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Lobhaṃ saha macchariyena, kodhaṃ pesuṇiyañca panudeyyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "164"
      },
      "."
    ],
    "innerText": "164."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Kayavikkaye na tiṭṭheyya, upavādaṃ bhikkhu na kareyya kuhiñci;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Gāme ca nābhisajjeyya, lābhakamyā janaṃ na lapayeyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kayavikkaye"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na tiṭṭheyyā"
      },
      "ti. Ye kayavikkayā vinaye paṭikkhittā na te imasmiṃ atthe adhippetā. Kathaṃ kayavikkaye tiṭṭhati? Pañcannaṃ saddhiṃ pattaṃ vā cīvaraṃ vā aññaṃ vā kiñci parikkhāraṃ vañcaniyaṃ vā karonto udayaṃ vā patthayanto parivatteti. Evaṃ kayavikkaye tiṭṭhati. Kathaṃ kayavikkaye na tiṭṭhati? Pañcannaṃ saddhiṃ pattaṃ vā cīvaraṃ vā aññaṃ vā kiñci parikkhāraṃ na vañcaniyaṃ vā karonto na udayaṃ vā patthayanto parivatteti. Evaṃ kayavikkaye na tiṭṭhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kayavikkaye na tiṭṭheyyā"
      },
      "ti. Kayavikkaye na tiṭṭheyya na santiṭṭheyya, kayavikkayaṃ pajaheyya vinodeyya byantiṃ kareyya anabhāvaṃ gameyya, kayavikkayā ārato assa virato paṭivirato nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā vihareyyāti – kayavikkaye na tiṭṭheyya."
    ],
    "innerText": "Kayavikkayena tiṭṭheyyāti. Ye kayavikkayā vinaye paṭikkhittā na te imasmiṃ atthe adhippetā. Kathaṃ kayavikkaye tiṭṭhati? Pañcannaṃ saddhiṃ pattaṃ vā cīvaraṃ vā aññaṃ vā kiñci parikkhāraṃ vañcaniyaṃ vā karonto udayaṃ vā patthayanto parivatteti. Evaṃ kayavikkaye tiṭṭhati. Kathaṃ kayavikkaye na tiṭṭhati? Pañcannaṃ saddhiṃ pattaṃ vā cīvaraṃ vā aññaṃ vā kiñci parikkhāraṃ na vañcaniyaṃ vā karonto na udayaṃ vā patthayanto parivatteti. Evaṃ kayavikkaye na tiṭṭhati. Kayavikkaye na tiṭṭheyyāti. Kayavikkaye na tiṭṭheyya na santiṭṭheyya, kayavikkayaṃ pajaheyya vinodeyya byantiṃ kareyya anabhāvaṃ gameyya, kayavikkayā ārato assa virato paṭivirato nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā vihareyyāti – kayavikkaye na tiṭṭheyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upavādaṃ bhikkhu na kareyya kuhiñcī"
      },
      "ti. Katame upavādakarāti kilesā? Santeke samaṇabrāhmaṇā iddhimanto dibbacakkhukā paracittaviduno, te dūratopi passanti āsannāpi na dissanti cetasāpi cittaṃ pajānanti, devatāpi kho santi iddhimantiniyo dibbacakkhukā paracittaviduniyo, tā dūratopi passanti, āsannāpi na dissanti cetasāpi cittaṃ pajānanti. Te oḷārikehi vā kilesehi majjhimehi vā kilesehi sukhumehi vā kilesehi upavadeyyuṃ. Katame oḷārikā kilesā? Kāyaduccaritaṃ vacīduccaritaṃ manoduccaritaṃ – ime ",
      " vuccanti oḷārikā kilesā. Katame majjhimā kilesā? Kāmavitakko byāpādavitakko vihiṃsāvitakko – ime vuccanti majjhimā kilesā. Katame sukhumā kilesā? Ñātivitakko, janapadavitakko, aparavitakko, parānudayatā paṭisaññutto vitakko ",
      ", lābhasakkārasilokapaṭisaññutto vitakko, anavaññattipaṭisaññutto vitakko – ime vuccanti sukhumā kilesā. Te oḷārikehi vā kilesehi majjhimehi vā kilesehi sukhumehi vā kilesehi na upavadeyya upavādaṃ na kareyya upavādakare kilese na kareyya na janeyya na sañjaneyya na nibbatteyya nābhinibbatteyya, upavādakare kilese pajaheyya vinodeyya ",
      " byantiṃ kareyya anabhāvaṃ gameyya, upavādakarehi kilesehi ārato assa virato paṭivirato nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā vihareyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kuhiñcī"
      },
      "ti kuhiñci kimhici katthaci ajjhattaṃ vā bahiddhā vā ajjhattabahiddhā vāti – upavādaṃ bhikkhu na kareyya kuhiñci."
    ],
    "innerText": "Upavādaṃ bhikkhu na kareyya kuhiñcīti. Katame upavādakarāti kilesā? Santeke samaṇabrāhmaṇā iddhimanto dibbacakkhukā paracittaviduno, te dūratopi passanti āsannāpi na dissanti cetasāpi cittaṃ pajānanti, devatāpi kho santi iddhimantiniyo dibbacakkhukā paracittaviduniyo, tā dūratopi passanti, āsannāpi na dissanti cetasāpi cittaṃ pajānanti. Te oḷārikehi vā kilesehi majjhimehi vā kilesehi sukhumehi vā kilesehi upavadeyyuṃ. Katame oḷārikā kilesā? Kāyaduccaritaṃ vacīduccaritaṃ manoduccaritaṃ – ime vuccanti oḷārikā kilesā. Katame majjhimā kilesā? Kāmavitakko byāpādavitakko vihiṃsāvitakko – ime vuccanti majjhimā kilesā. Katame sukhumā kilesā? Ñātivitakko, janapadavitakko, aparavitakko, parānudayatā paṭisaññutto vitakko , lābhasakkārasilokapaṭisaññutto vitakko, anavaññattipaṭisaññutto vitakko – ime vuccanti sukhumā kilesā. Te oḷārikehi vā kilesehi majjhimehi vā kilesehi sukhumehi vā kilesehi na upavadeyya upavādaṃ na kareyya upavādakare kilese na kareyya na janeyya na sañjaneyya na nibbatteyya nābhinibbatteyya, upavādakare kilese pajaheyya vinodeyya byantiṃ kareyya anabhāvaṃ gameyya, upavādakarehi kilesehi ārato assa virato paṭivirato nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā vihareyya. Kuhiñcīti kuhiñci kimhici katthaci ajjhattaṃ vā bahiddhā vā ajjhattabahiddhā vāti – upavādaṃ bhikkhu na kareyya kuhiñci."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gāme ca nābhisajjeyyā"
      },
      "ti. Kathaṃ gāme sajjati? Idha bhikkhu gāme gihīhi saṃsaṭṭho viharati sahanandī sahasokī sukhitesu sukhito dukkhitesu dukkhito, uppannesu kiccakaraṇīyesu attanā voyogaṃ āpajjati. Evampi gāme sajjati."
    ],
    "innerText": "Gāme ca nābhisajjeyyāti. Kathaṃ gāme sajjati? Idha bhikkhu gāme gihīhi saṃsaṭṭho viharati sahanandī sahasokī sukhitesu sukhito dukkhitesu dukkhito, uppannesu kiccakaraṇīyesu attanā voyogaṃ āpajjati. Evampi gāme sajjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha vā bhikkhu pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya gāmaṃ vā nigamaṃ vā piṇḍāya pavisati arakkhiteneva kāyena arakkhitāya vācāya arakkhitena cittena anupaṭṭhitāya ",
      " satiyā asaṃvutehi indriyehi. So tatra tatra sajjati tatra tatra gaṇhāti tatra tatra bajjhati tatra tatra anayabyasanaṃ āpajjati. Evampi gāme sajjati."
    ],
    "innerText": "Atha vā bhikkhu pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya gāmaṃ vā nigamaṃ vā piṇḍāya pavisati arakkhiteneva kāyena arakkhitāya vācāya arakkhitena cittena anupaṭṭhitāya satiyā asaṃvutehi indriyehi. So tatra tatra sajjati tatra tatra gaṇhāti tatra tatra bajjhati tatra tatra anayabyasanaṃ āpajjati. Evampi gāme sajjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kathaṃ gāme na sajjati? Idha bhikkhu gāme gihīhi asaṃsaṭṭho viharati na sahanandī na sahasokī na sukhitesu sukhito na dukkhitesu dukkhito, uppannesu kiccakaraṇīyesu na attanā voyogaṃ āpajjati. Evampi gāme na sajjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha vā bhikkhu pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya gāmaṃ vā nigamaṃ vā piṇḍāya pavisati rakkhiteneva kāyena rakkhitāya vācāya rakkhitena cittena upaṭṭhitāya satiyā saṃvutehi indriyehi. So tatra tatra na sajjati tatra tatra na gaṇhāti tatra tatra na bajjhati tatra tatra na anayabyasanaṃ āpajjati. Evampi gāme na sajjati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gāme ca nābhisajjeyyā"
      },
      "ti gāme na sajjeyya na gaṇheyya na bajjheyya na palibajjheyya, agiddho ",
      " assa agadhito amucchito anajjhosanno vītagedho vigatagedho cattagedho…pe… brahmabhūtena attanā vihareyyāti – gāme ca nābhisajjeyya."
    ],
    "innerText": "Atha vā bhikkhu pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya gāmaṃ vā nigamaṃ vā piṇḍāya pavisati rakkhiteneva kāyena rakkhitāya vācāya rakkhitena cittena upaṭṭhitāya satiyā saṃvutehi indriyehi. So tatra tatra na sajjati tatra tatra na gaṇhāti tatra tatra na bajjhati tatra tatra na anayabyasanaṃ āpajjati. Evampi gāme na sajjati. Gāme ca nābhisajjeyyāti gāme na sajjeyya na gaṇheyya na bajjheyya na palibajjheyya, agiddho assa agadhito amucchito anajjhosanno vītagedho vigatagedho cattagedho…pe… brahmabhūtena attanā vihareyyāti – gāme ca nābhisajjeyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lābhakamyā janaṃ na lapayeyyā"
      },
      "ti. Katamā lapanā? Lābhasakkārasilokasannissitassa pāpicchassa icchāpakatassa āmisacakkhukassa ",
      " lokadhammagarukassa yā paresaṃ ālapanā lapanā sallapanā ullapanā samullapanā unnahanā samunnahanā ukkācanā samukkācanā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ukkāpanā samukkāpanā (syā.)]"
      },
      " anupiyabhāṇitā ",
      " cātukamyatā muggasūpyatā pāribhaṭayatā parapiṭṭhimaṃsikatā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[piṭṭhimaṃsikatā (ka.) visuddhimagge sīlaniddesavaṇṇanā oloketabbā]"
      },
      ", yā ",
      " tattha saṇhavācatā sakhilavācatā sithilavācatā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mettavācakatā (syā.)]"
      },
      " apharusavācatā – ayaṃ vuccati lapanā."
    ],
    "innerText": "Lābhakamyā janaṃ na lapayeyyāti. Katamā lapanā? Lābhasakkārasilokasannissitassa pāpicchassa icchāpakatassa āmisacakkhukassa lokadhammagarukassa yā paresaṃ ālapanā lapanā sallapanā ullapanā samullapanā unnahanā samunnahanā ukkācanā samukkācanā [ukkāpanā samukkāpanā (syā.)] anupiyabhāṇitā cātukamyatā muggasūpyatā pāribhaṭayatā parapiṭṭhimaṃsikatā [piṭṭhimaṃsikatā (ka.) visuddhimagge sīlaniddesavaṇṇanā oloketabbā], yā tattha saṇhavācatā sakhilavācatā sithilavācatā [mettavācakatā (syā.)] apharusavācatā – ayaṃ vuccati lapanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Api ca dvīhi kāraṇehi janaṃ lapati – attānaṃ vā nīcaṃ ṭhapento paraṃ uccaṃ ṭhapento janaṃ lapati, attānaṃ vā uccaṃ ṭhapento paraṃ nīcaṃ ṭhapento janaṃ lapati. Kathaṃ attānaṃ nīcaṃ ṭhapento paraṃ uccaṃ ṭhapento janaṃ lapati? ‘‘Tumhe me bahūpakārā, ahaṃ tumhe nissāya labhāmi cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhāraṃ, yepi me aññe dātuṃ vā kātuṃ vā maññanti, tumhe nissāya tumhe sampassantā yampi me purāṇaṃ mātāpettikaṃ nāmadheyyaṃ tampi me antarahitaṃ. Tumhehi ahaṃ ñāyāmi asukassa kulūpako asukāya kulūpako’’ti. Evaṃ attānaṃ nīcaṃ ṭhapento paraṃ uccaṃ ṭhapento janaṃ lapati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ attānaṃ uccaṃ ṭhapento paraṃ nīcaṃ ṭhapento janaṃ lapati? ‘‘Ahaṃ tumhākaṃ bahūpakāro, tumhe maṃ āgamma buddhaṃ saraṇaṃ gatā, dhammaṃ saraṇaṃ gatā, saṅghaṃ saraṇaṃ gatā, pāṇātipātā paṭiviratā, adinnādānā paṭiviratā, kāmesumicchācārā paṭiviratā, musāvādā paṭiviratā, surāmerayamajjappamādaṭṭhānā paṭiviratā. Ahaṃ tumhākaṃ uddesaṃ demi, paripucchaṃ demi, uposathaṃ ācikkhāmi, navakammaṃ adhiṭṭhāmi. Atha pana tumhe maṃ ujjhitvā aññe sakkarotha garuṃ karotha mānetha pūjethā’’ti. Evaṃ attānaṃ uccaṃ ṭhapento paraṃ nīcaṃ ṭhapento ",
      " janaṃ lapati."
    ],
    "innerText": "Kathaṃ attānaṃ uccaṃ ṭhapento paraṃ nīcaṃ ṭhapento janaṃ lapati? ‘‘Ahaṃ tumhākaṃ bahūpakāro, tumhe maṃ āgamma buddhaṃ saraṇaṃ gatā, dhammaṃ saraṇaṃ gatā, saṅghaṃ saraṇaṃ gatā, pāṇātipātā paṭiviratā, adinnādānā paṭiviratā, kāmesumicchācārā paṭiviratā, musāvādā paṭiviratā, surāmerayamajjappamādaṭṭhānā paṭiviratā. Ahaṃ tumhākaṃ uddesaṃ demi, paripucchaṃ demi, uposathaṃ ācikkhāmi, navakammaṃ adhiṭṭhāmi. Atha pana tumhe maṃ ujjhitvā aññe sakkarotha garuṃ karotha mānetha pūjethā’’ti. Evaṃ attānaṃ uccaṃ ṭhapento paraṃ nīcaṃ ṭhapento janaṃ lapati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lābhakamyā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "janaṃ na lapayeyyā"
      },
      "ti. Lābhahetu lābhapaccayā lābhakāraṇā lābhābhinibbattiyā lābhaṃ paripācento janaṃ na lapayeyya, lapanaṃ pajaheyya vinodeyya byantiṃ kareyya anabhāvaṃ gameyya, lapanā ārato assa virato paṭivirato nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā vihareyyāti – lābhakamyā janaṃ na lapayeyya."
    ],
    "innerText": "Lābhakamyājanaṃ na lapayeyyāti. Lābhahetu lābhapaccayā lābhakāraṇā lābhābhinibbattiyā lābhaṃ paripācento janaṃ na lapayeyya, lapanaṃ pajaheyya vinodeyya byantiṃ kareyya anabhāvaṃ gameyya, lapanā ārato assa virato paṭivirato nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā vihareyyāti – lābhakamyā janaṃ na lapayeyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kayavikkaye na tiṭṭheyya, upavādaṃ bhikkhu na kareyya kuhiñci;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Gāme ca nābhisajjeyya, lābhakamyā janaṃ na lapayeyyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "165"
      },
      "."
    ],
    "innerText": "165."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na ca katthiko"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[katthitā (syā. ka.)]"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "siyā bhikkhu, na ca vācaṃ payuttaṃ bhāseyya;"
      }
    ],
    "innerText": "Na ca katthiko[katthitā (syā. ka.)]siyā bhikkhu, na ca vācaṃ payuttaṃ bhāseyya;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pāgabbhiyaṃ na sikkheyya, kathaṃ viggāhikaṃ na kathayeyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ca katthiko siyā bhikkhū"
      },
      "ti. Idhekacco katthī hoti vikatthī. So katthati vikatthati ahamasmi sīlasampannoti vā vatasampannoti vā sīlabbatasampannoti vā jātiyā vā gottena vā kolaputtiyena vā vaṇṇapokkharatāya vā dhanena vā ajjhenena vā kammāyatanena vā sippāyatanena vā vijjāṭṭhānena vā sutena vā paṭibhānena vā aññataraññatarena vā vatthunā. Uccā kulā pabbajitoti ",
      " vā mahābhogakulā pabbajitoti vā uḷārabhogakulā pabbajitoti vā suttantikoti vā vinayadharoti vā dhammakathikoti vā āraññikoti vā…pe… nevasaññānāsaññāyatanasamāpattiyā lābhīti vā katthati vikatthati. Evaṃ na kattheyya na vikattheyya, katthaṃ pajaheyya vinodeyya byantiṃ kareyya anabhāvaṃ gameyya, katthanā ārato assa virato paṭivirato nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā vihareyyāti – na ca katthiko siyā bhikkhu."
    ],
    "innerText": "Naca katthiko siyā bhikkhūti. Idhekacco katthī hoti vikatthī. So katthati vikatthati ahamasmi sīlasampannoti vā vatasampannoti vā sīlabbatasampannoti vā jātiyā vā gottena vā kolaputtiyena vā vaṇṇapokkharatāya vā dhanena vā ajjhenena vā kammāyatanena vā sippāyatanena vā vijjāṭṭhānena vā sutena vā paṭibhānena vā aññataraññatarena vā vatthunā. Uccā kulā pabbajitoti vā mahābhogakulā pabbajitoti vā uḷārabhogakulā pabbajitoti vā suttantikoti vā vinayadharoti vā dhammakathikoti vā āraññikoti vā…pe… nevasaññānāsaññāyatanasamāpattiyā lābhīti vā katthati vikatthati. Evaṃ na kattheyya na vikattheyya, katthaṃ pajaheyya vinodeyya byantiṃ kareyya anabhāvaṃ gameyya, katthanā ārato assa virato paṭivirato nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā vihareyyāti – na ca katthiko siyā bhikkhu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ca vācaṃ payuttaṃ bhāseyyā"
      },
      "ti. Katamā payuttavācā? Idhekacco ",
      " cīvarapayuttaṃ vācaṃ bhāsati, piṇḍapātapayuttaṃ vācaṃ bhāsati, senāsanapayuttaṃ vācaṃ bhāsati, gilānapaccayabhesajjaparikkhārapayuttaṃ vācaṃ bhāsati – ayampi vuccati payuttavācā."
    ],
    "innerText": "Naca vācaṃ payuttaṃ bhāseyyāti. Katamā payuttavācā? Idhekacco cīvarapayuttaṃ vācaṃ bhāsati, piṇḍapātapayuttaṃ vācaṃ bhāsati, senāsanapayuttaṃ vācaṃ bhāsati, gilānapaccayabhesajjaparikkhārapayuttaṃ vācaṃ bhāsati – ayampi vuccati payuttavācā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha vā cīvarahetu piṇḍapātahetu senāsanahetu gilānapaccayabhesajjaparikkhārahetu saccampi bhaṇati musāpi bhaṇati, pisuṇampi bhaṇati apisuṇampi bhaṇati, pharusampi bhaṇati apharusampi bhaṇati, samphappalāpampi bhaṇati asamphappalāpampi bhaṇati, mantāpi vācaṃ bhāsati – ayampi vuccati payuttavācā. Atha vā pasannacitto paresaṃ dhammaṃ deseti – ‘‘aho vata me dhammaṃ suṇeyyuṃ, sutvāva dhammaṃ pasīdeyyuṃ, pasannā ca me pasannākāraṃ kareyyu’’nti – ayaṃ vuccati payuttavācā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na ca vācaṃ payuttaṃ bhāseyyā"
      },
      "ti. Antamaso dhammadesanaṃ vācaṃ upādāya payuttavācaṃ na bhāseyya ",
      " na katheyya na bhaṇeyya na dīpeyya na vohareyya, payuttaṃ vācaṃ pajaheyya vinodeyya byantiṃ kareyya anabhāvaṃ gameyya, payuttavācāya ārato assa virato paṭivirato nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā vihareyyāti – na ca vācaṃ payuttaṃ bhāseyya."
    ],
    "innerText": "Atha vā cīvarahetu piṇḍapātahetu senāsanahetu gilānapaccayabhesajjaparikkhārahetu saccampi bhaṇati musāpi bhaṇati, pisuṇampi bhaṇati apisuṇampi bhaṇati, pharusampi bhaṇati apharusampi bhaṇati, samphappalāpampi bhaṇati asamphappalāpampi bhaṇati, mantāpi vācaṃ bhāsati – ayampi vuccati payuttavācā. Atha vā pasannacitto paresaṃ dhammaṃ deseti – ‘‘aho vata me dhammaṃ suṇeyyuṃ, sutvāva dhammaṃ pasīdeyyuṃ, pasannā ca me pasannākāraṃ kareyyu’’nti – ayaṃ vuccati payuttavācā. Na ca vācaṃ payuttaṃ bhāseyyāti. Antamaso dhammadesanaṃ vācaṃ upādāya payuttavācaṃ na bhāseyya na katheyya na bhaṇeyya na dīpeyya na vohareyya, payuttaṃ vācaṃ pajaheyya vinodeyya byantiṃ kareyya anabhāvaṃ gameyya, payuttavācāya ārato assa virato paṭivirato nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā vihareyyāti – na ca vācaṃ payuttaṃ bhāseyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāgabbhiyaṃ na sikkheyyā"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāgabbhiya"
      },
      "nti tīṇi pāgabbhiyāni – kāyikaṃ pāgabbhiyaṃ, vācasikaṃ pāgabbhiyaṃ, cetasikaṃ pāgabbhiyaṃ. Katamaṃ kāyikaṃ pāgabbhiyaṃ? Idhekacco saṅghagatopi kāyikaṃ pāgabbhiyaṃ dasseti, gaṇagatopi kāyikaṃ pāgabbhiyaṃ dasseti, bhojanasālāyapi kāyikaṃ pāgabbhiyaṃ dasseti, jantāgharepi kāyikaṃ pāgabbhiyaṃ dasseti, udakatitthepi ",
      " kāyikaṃ pāgabbhiyaṃ dasseti, antaragharaṃ pavisantopi kāyikaṃ pāgabbhiyaṃ dasseti, antaragharaṃ paviṭṭhopi kāyikaṃ pāgabbhiyaṃ dasseti."
    ],
    "innerText": "Pāgabbhiyaṃ na sikkheyyāti. Pāgabbhiyanti tīṇi pāgabbhiyāni – kāyikaṃ pāgabbhiyaṃ, vācasikaṃ pāgabbhiyaṃ, cetasikaṃ pāgabbhiyaṃ. Katamaṃ kāyikaṃ pāgabbhiyaṃ? Idhekacco saṅghagatopi kāyikaṃ pāgabbhiyaṃ dasseti, gaṇagatopi kāyikaṃ pāgabbhiyaṃ dasseti, bhojanasālāyapi kāyikaṃ pāgabbhiyaṃ dasseti, jantāgharepi kāyikaṃ pāgabbhiyaṃ dasseti, udakatitthepi kāyikaṃ pāgabbhiyaṃ dasseti, antaragharaṃ pavisantopi kāyikaṃ pāgabbhiyaṃ dasseti, antaragharaṃ paviṭṭhopi kāyikaṃ pāgabbhiyaṃ dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ saṅghagato kāyikaṃ pāgabbhiyaṃ dasseti? Idhekacco saṅghagato acittīkārakato there bhikkhū ghaṭṭayantopi tiṭṭhati, ghaṭṭayantopi nisīdati, puratopi tiṭṭhati, puratopi nisīdati, uccepi āsane nisīdati, sasīsaṃ pārupitvā nisīdati ",
      ", ṭhitakopi bhaṇati, bāhāvikkhepakopi bhaṇati. Evaṃ saṅghagato kāyikaṃ pāgabbhiyaṃ dasseti."
    ],
    "innerText": "Kathaṃ saṅghagato kāyikaṃ pāgabbhiyaṃ dasseti? Idhekacco saṅghagato acittīkārakato there bhikkhū ghaṭṭayantopi tiṭṭhati, ghaṭṭayantopi nisīdati, puratopi tiṭṭhati, puratopi nisīdati, uccepi āsane nisīdati, sasīsaṃ pārupitvā nisīdati , ṭhitakopi bhaṇati, bāhāvikkhepakopi bhaṇati. Evaṃ saṅghagato kāyikaṃ pāgabbhiyaṃ dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ ",
      " gaṇagato kāyikaṃ pāgabbhiyaṃ dasseti? Idhekacco gaṇagato acittīkārakato therānaṃ bhikkhūnaṃ anupāhanānaṃ caṅkamantānaṃ saupāhano caṅkamati ",
      ", nīce caṅkame caṅkamantānaṃ ucce caṅkame caṅkamati, chamāya caṅkamantānaṃ caṅkame caṅkamati, ghaṭṭayantopi tiṭṭhati, ghaṭṭayantopi nisīdati, puratopi tiṭṭhati, puratopi nisīdati, uccepi āsane nisīdati, sasīsaṃ pārupitvāpi nisīdati, ṭhitopi bhaṇati, bāhāvikkhepakopi bhaṇati. Evaṃ gaṇagato kāyikaṃ pāgabbhiyaṃ dasseti."
    ],
    "innerText": "Kathaṃ gaṇagato kāyikaṃ pāgabbhiyaṃ dasseti? Idhekacco gaṇagato acittīkārakato therānaṃ bhikkhūnaṃ anupāhanānaṃ caṅkamantānaṃ saupāhano caṅkamati , nīce caṅkame caṅkamantānaṃ ucce caṅkame caṅkamati, chamāya caṅkamantānaṃ caṅkame caṅkamati, ghaṭṭayantopi tiṭṭhati, ghaṭṭayantopi nisīdati, puratopi tiṭṭhati, puratopi nisīdati, uccepi āsane nisīdati, sasīsaṃ pārupitvāpi nisīdati, ṭhitopi bhaṇati, bāhāvikkhepakopi bhaṇati. Evaṃ gaṇagato kāyikaṃ pāgabbhiyaṃ dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kathaṃ bhojanasālāya kāyikaṃ pāgabbhiyaṃ dasseti? Idhekacco bhojanasālāya acittīkārakato there bhikkhū anupakhajja nisīdati, navepi bhikkhū āsanena paṭibāhati, ghaṭṭayantopi tiṭṭhati, ghaṭṭayantopi nisīdati, puratopi tiṭṭhati, puratopi nisīdati, uccepi āsane nisīdati, sasīsaṃ pārupitvā nisīdati, ṭhitakopi bhaṇati, bāhāvikkhepakopi bhaṇati. Evaṃ bhojanasālāya kāyikaṃ pāgabbhiyaṃ dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kathaṃ jantāghare kāyikaṃ pāgabbhiyaṃ dasseti? Idhekacco jantāghare acittīkārakato there bhikkhū ghaṭṭayantopi tiṭṭhati, ghaṭṭayantopi nisīdati, puratopi tiṭṭhati, puratopi nisīdati, uccepi āsane nisīdati, anāpucchāpi kaṭṭhaṃ pakkhipati, anāpucchāpi dvāraṃ pidahati. Evaṃ jantāghare kāyikaṃ pāgabbhiyaṃ dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ udakatitthe kāyikaṃ pāgabbhiyaṃ dasseti? Idhekacco udakatitthe acittīkārakato there bhikkhū ghaṭṭayantopi otarati, puratopi otarati, ghaṭṭayantopi nhāyati, puratopi nhāyati, uparitopi nhāyati, ghaṭṭayantopi uttarati, puratopi uttarati ",
      ". Evaṃ udakatitthe kāyikaṃ pāgabbhiyaṃ dasseti."
    ],
    "innerText": "Kathaṃ udakatitthe kāyikaṃ pāgabbhiyaṃ dasseti? Idhekacco udakatitthe acittīkārakato there bhikkhū ghaṭṭayantopi otarati, puratopi otarati, ghaṭṭayantopi nhāyati, puratopi nhāyati, uparitopi nhāyati, ghaṭṭayantopi uttarati, puratopi uttarati . Evaṃ udakatitthe kāyikaṃ pāgabbhiyaṃ dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ ",
      " antaragharaṃ pavisanto kāyikaṃ pāgabbhiyaṃ dasseti? Idhekacco antaragharaṃ pavisanto acittīkārakato there bhikkhū ghaṭṭayantopi gacchati, puratopi gacchati, vokkammapi therānaṃ bhikkhūnaṃ purato gacchati ",
      ". Evaṃ antaragharaṃ pavisanto kāyikaṃ pāgabbhiyaṃ dasseti."
    ],
    "innerText": "Kathaṃ antaragharaṃ pavisanto kāyikaṃ pāgabbhiyaṃ dasseti? Idhekacco antaragharaṃ pavisanto acittīkārakato there bhikkhū ghaṭṭayantopi gacchati, puratopi gacchati, vokkammapi therānaṃ bhikkhūnaṃ purato gacchati . Evaṃ antaragharaṃ pavisanto kāyikaṃ pāgabbhiyaṃ dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ antaragharaṃ paviṭṭho kāyikaṃ pāgabbhiyaṃ dasseti? Idhekacco antaragharaṃ paviṭṭho ‘‘na pavisa, bhante’’ti vuccamāno pavisati, ‘‘na tiṭṭha, bhante’’ti vuccamāno ",
      " tiṭṭhati, ‘‘na nisīda, bhante’’ti vuccamāno nisīdati, anokāsampi pavisati, anokāsepi tiṭṭhati, anokāsepi nisīdati, yānipi tāni honti kulānaṃ ovarakāni gūḷhāni ca paṭicchannāni ca, yattha kulitthiyo kuladhītaro kulasuṇhāyo kulakumāriyo nisīdanti tatthapi sahasā pavisati, kumārakassa sīsampi parāmasati. Evaṃ antaragharaṃ paviṭṭho kāyikaṃ pāgabbhiyaṃ dasseti – idaṃ kāyikaṃ pāgabbhiyaṃ."
    ],
    "innerText": "Kathaṃ antaragharaṃ paviṭṭho kāyikaṃ pāgabbhiyaṃ dasseti? Idhekacco antaragharaṃ paviṭṭho ‘‘na pavisa, bhante’’ti vuccamāno pavisati, ‘‘na tiṭṭha, bhante’’ti vuccamāno tiṭṭhati, ‘‘na nisīda, bhante’’ti vuccamāno nisīdati, anokāsampi pavisati, anokāsepi tiṭṭhati, anokāsepi nisīdati, yānipi tāni honti kulānaṃ ovarakāni gūḷhāni ca paṭicchannāni ca, yattha kulitthiyo kuladhītaro kulasuṇhāyo kulakumāriyo nisīdanti tatthapi sahasā pavisati, kumārakassa sīsampi parāmasati. Evaṃ antaragharaṃ paviṭṭho kāyikaṃ pāgabbhiyaṃ dasseti – idaṃ kāyikaṃ pāgabbhiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katamaṃ vācasikaṃ pāgabbhiyaṃ? Idhekacco saṅghagatopi vācasikaṃ pāgabbhiyaṃ dasseti, gaṇagatopi vācasikaṃ pāgabbhiyaṃ dasseti, antaragharaṃ paviṭṭhopi vācasikaṃ pāgabbhiyaṃ dasseti. Kathaṃ saṅghagato vācasikaṃ pāgabbhiyaṃ dasseti? Idhekacco saṅghagato acittīkārakato there bhikkhū anāpucchaṃ vā anajjhiṭṭho vā ārāmagatānaṃ bhikkhūnaṃ dhammaṃ bhaṇati, pañhaṃ visajjeti, pātimokkhaṃ uddisati ",
      ", ṭhitakopi bhaṇati, bāhāvikkhepakopi bhaṇati. Evaṃ saṅghagato vācasikaṃ pāgabbhiyaṃ dasseti."
    ],
    "innerText": "Katamaṃ vācasikaṃ pāgabbhiyaṃ? Idhekacco saṅghagatopi vācasikaṃ pāgabbhiyaṃ dasseti, gaṇagatopi vācasikaṃ pāgabbhiyaṃ dasseti, antaragharaṃ paviṭṭhopi vācasikaṃ pāgabbhiyaṃ dasseti. Kathaṃ saṅghagato vācasikaṃ pāgabbhiyaṃ dasseti? Idhekacco saṅghagato acittīkārakato there bhikkhū anāpucchaṃ vā anajjhiṭṭho vā ārāmagatānaṃ bhikkhūnaṃ dhammaṃ bhaṇati, pañhaṃ visajjeti, pātimokkhaṃ uddisati , ṭhitakopi bhaṇati, bāhāvikkhepakopi bhaṇati. Evaṃ saṅghagato vācasikaṃ pāgabbhiyaṃ dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kathaṃ gaṇagato vācasikaṃ pāgabbhiyaṃ dasseti? Idhekacco gaṇagato acittīkārakato there bhikkhū anāpucchaṃ vā anajjhiṭṭho vā ārāmagatānaṃ bhikkhūnaṃ dhammaṃ bhaṇati, pañhaṃ visajjeti, ṭhitakopi bhaṇati, bāhāvikkhepakopi bhaṇati; ārāmagatānaṃ bhikkhunīnaṃ upāsakānaṃ upāsikānaṃ dhammaṃ bhaṇati, pañhaṃ visajjeti, ṭhitakopi bhaṇati, bāhāvikkhepakopi bhaṇati. Evaṃ gaṇagato vācasikaṃ pāgabbhiyaṃ dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ antaragharaṃ paviṭṭho vācasikaṃ pāgabbhiyaṃ dasseti? Idhekacco antaragharaṃ paviṭṭho itthiṃ vā kumāriṃ vā evamāha – ‘‘itthannāme itthaṃgotte kiṃ atthi? Yāgu atthi, bhattaṃ atthi, khādanīyaṃ atthi? Kiṃ pivissāma ",
      ", kiṃ bhuñjissāma, kiṃ khādissāma, kiṃ vā atthi, kiṃ ",
      " vā me dassathā’’ti vippalapati. Evaṃ antaragharaṃ paviṭṭho vācasikaṃ pāgabbhiyaṃ dasseti – idaṃ vācasikaṃ pāgabbhiyaṃ."
    ],
    "innerText": "Kathaṃ antaragharaṃ paviṭṭho vācasikaṃ pāgabbhiyaṃ dasseti? Idhekacco antaragharaṃ paviṭṭho itthiṃ vā kumāriṃ vā evamāha – ‘‘itthannāme itthaṃgotte kiṃ atthi? Yāgu atthi, bhattaṃ atthi, khādanīyaṃ atthi? Kiṃ pivissāma , kiṃ bhuñjissāma, kiṃ khādissāma, kiṃ vā atthi, kiṃ vā me dassathā’’ti vippalapati. Evaṃ antaragharaṃ paviṭṭho vācasikaṃ pāgabbhiyaṃ dasseti – idaṃ vācasikaṃ pāgabbhiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katamaṃ cetasikaṃ pāgabbhiyaṃ? Idhekacco na uccā kulā pabbajito samāno uccā kulā pabbajitena saddhiṃ sadisaṃ attānaṃ karoti cittena, na mahābhogakulā pabbajito samāno mahābhogakulā pabbajitena saddhiṃ sadisaṃ attānaṃ karoti cittena, na uḷārabhogakulā pabbajito ",
      " samāno uḷārabhogakulā pabbajitena saddhiṃ sadisaṃ attānaṃ karoti cittena, na suttantiko ",
      " samāno suttantikena saddhiṃ sadisaṃ attānaṃ karoti cittena, na vinayadharo samāno vinayadharena… na dhammakathiko samāno dhammakathikena… na āraññiko samāno āraññakena… na piṇḍapātiko samāno piṇḍapātikena… na paṃsukūliko samāno paṃsukūlikena… na tecīvariko samāno tecīvarakena… na sapadānacāriko samāno sapadānacārikena… na khalupacchābhattiko samāno khalupacchābhattikena… na nesajjiko samāno nesaññikena… na yathāsanthatiko samāno yathāsanthatikena saddhiṃ sadisaṃ attānaṃ karoti cittena, na paṭhamassa jhānassa lābhī samāno paṭhamassa jhānassa lābhinā saddhiṃ sadisaṃ attānaṃ karoti cittena, na dutiyassa jhānassa lābhī samāno dutiyassa… na tatiyassa jhānassa lābhī samāno tatiyassa… na catutthassa jhānassa lābhī samāno lābhī samāno catutthassa… na ākāsānañcāyatanasamāpattiyā lābhī samāno ākāsanañcāyatanasamāpattiyā… na viññāṇañcāyatanasamāpattiyā lābhī samāno viññāṇañcāyatana samāpattiyā… na ākiñcaññāyatanasamāpattiyā lābhī samāno ākiñcaññāyatana samāpattiyā… na nevasaññānāsaññāyatanasamāpattiyā lābhī samāno nevasaññānāsaññāyatanasamāpattiyā lābhinā saddhiṃ sadisaṃ attānaṃ karoti cittena – idaṃ cetasikaṃ pāgabbhiyaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na sikkheyyā"
      },
      "ti pāgabbhiyaṃ na sikkheyya na careyya na ācareyya na samācareyya na samādāya vatteyya, pāgabbhiyaṃ pajaheyya vinodeyya byantiṃ kareyya anabhāvaṃ gameyya, pāgabbhiyā ārato assa virato paṭivirato nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā vihareyyāti – pāgabbhiyaṃ na sikkheyya."
    ],
    "innerText": "Katamaṃ cetasikaṃ pāgabbhiyaṃ? Idhekacco na uccā kulā pabbajito samāno uccā kulā pabbajitena saddhiṃ sadisaṃ attānaṃ karoti cittena, na mahābhogakulā pabbajito samāno mahābhogakulā pabbajitena saddhiṃ sadisaṃ attānaṃ karoti cittena, na uḷārabhogakulā pabbajito samāno uḷārabhogakulā pabbajitena saddhiṃ sadisaṃ attānaṃ karoti cittena, na suttantiko samāno suttantikena saddhiṃ sadisaṃ attānaṃ karoti cittena, na vinayadharo samāno vinayadharena… na dhammakathiko samāno dhammakathikena… na āraññiko samāno āraññakena… na piṇḍapātiko samāno piṇḍapātikena… na paṃsukūliko samāno paṃsukūlikena… na tecīvariko samāno tecīvarakena… na sapadānacāriko samāno sapadānacārikena… na khalupacchābhattiko samāno khalupacchābhattikena… na nesajjiko samāno nesaññikena… na yathāsanthatiko samāno yathāsanthatikena saddhiṃ sadisaṃ attānaṃ karoti cittena, na paṭhamassa jhānassa lābhī samāno paṭhamassa jhānassa lābhinā saddhiṃ sadisaṃ attānaṃ karoti cittena, na dutiyassa jhānassa lābhī samāno dutiyassa… na tatiyassa jhānassa lābhī samāno tatiyassa… na catutthassa jhānassa lābhī samāno lābhī samāno catutthassa… na ākāsānañcāyatanasamāpattiyā lābhī samāno ākāsanañcāyatanasamāpattiyā… na viññāṇañcāyatanasamāpattiyā lābhī samāno viññāṇañcāyatana samāpattiyā… na ākiñcaññāyatanasamāpattiyā lābhī samāno ākiñcaññāyatana samāpattiyā… na nevasaññānāsaññāyatanasamāpattiyā lābhī samāno nevasaññānāsaññāyatanasamāpattiyā lābhinā saddhiṃ sadisaṃ attānaṃ karoti cittena – idaṃ cetasikaṃ pāgabbhiyaṃ. Na sikkheyyāti pāgabbhiyaṃ na sikkheyya na careyya na ācareyya na samācareyya na samādāya vatteyya, pāgabbhiyaṃ pajaheyya vinodeyya byantiṃ kareyya anabhāvaṃ gameyya, pāgabbhiyā ārato assa virato paṭivirato nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā vihareyyāti – pāgabbhiyaṃ na sikkheyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kathaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "viggāhikaṃ na kathayeyyā"
      },
      "ti. Katamā viggāhikā kathā? Idhekacco evarūpiṃ kathaṃ kattā hoti – ‘‘na tvaṃ imaṃ dhammavinayaṃ ājānāsi…pe… nibbeṭhehi vā sace pahosī’’ti. Vuttañhetaṃ bhagavatā – ‘‘viggāhikāya kho, moggallāna, kathāya sati kathābāhullaṃ pāṭikaṅkhaṃ, kathābāhulle sati uddhaccaṃ, uddhatassa asaṃvaro, asaṃvutassa ārā cittaṃ ",
      " samādhimhā’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kathaṃ viggāhikaṃ na kathayeyyā"
      },
      "ti. Viggāhikaṃ kathaṃ na katheyya na bhaṇeyya na dīpeyya na vohareyya, viggāhikaṃ kathaṃ pajaheyya vinodeyya byantiṃ kareyya anabhāvaṃ gameyya, viggāhikakathāya ārato assa virato paṭivirato nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā vihareyyāti – kathaṃ viggāhikaṃ na kathayeyya."
    ],
    "innerText": "Kathaṃviggāhikaṃ na kathayeyyāti. Katamā viggāhikā kathā? Idhekacco evarūpiṃ kathaṃ kattā hoti – ‘‘na tvaṃ imaṃ dhammavinayaṃ ājānāsi…pe… nibbeṭhehi vā sace pahosī’’ti. Vuttañhetaṃ bhagavatā – ‘‘viggāhikāya kho, moggallāna, kathāya sati kathābāhullaṃ pāṭikaṅkhaṃ, kathābāhulle sati uddhaccaṃ, uddhatassa asaṃvaro, asaṃvutassa ārā cittaṃ samādhimhā’’ti. Kathaṃ viggāhikaṃ na kathayeyyāti. Viggāhikaṃ kathaṃ na katheyya na bhaṇeyya na dīpeyya na vohareyya, viggāhikaṃ kathaṃ pajaheyya vinodeyya byantiṃ kareyya anabhāvaṃ gameyya, viggāhikakathāya ārato assa virato paṭivirato nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā vihareyyāti – kathaṃ viggāhikaṃ na kathayeyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Na ",
      " ca katthiko siyā bhikkhu, na ca vācaṃ payuttaṃ bhāseyya;"
    ],
    "innerText": "‘‘Na ca katthiko siyā bhikkhu, na ca vācaṃ payuttaṃ bhāseyya;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pāgabbhiyaṃ na sikkheyya, kathaṃ viggāhikaṃ na kathayeyyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "166"
      },
      "."
    ],
    "innerText": "166."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Mosavajje na niyyetha, sampajāno saṭhāni na kayirā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Atha jīvitena paññāya, sīlabbatena nāññamatimaññe."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mosavajje na niyyethā"
      },
      "ti. Mosavajjaṃ vuccati musāvādo. Idhekacco ",
      " sabhaggato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sabhāgaggato (sī. ka.)]"
      },
      " vā parisaggato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[parisagato (sī. ka.)]"
      },
      " vā…pe… āmisakiñcikkhahetu vā sampajānamusā bhāsitā hoti – idaṃ vuccati mosavajjaṃ. Api ca tīhākārehi musāvādo hoti – pubbevassa hoti ‘‘musā bhaṇissa’’nti, bhaṇantassa hoti ‘‘musā bhaṇāmī’’ti, bhaṇitassa hoti ‘‘musā mayā bhaṇita’’nti, imehi tīhākārehi musāvādo hoti. Api ca catūhākārehi… pañcahākārehi… chahākārehi… sattahākārehi… aṭṭhahākārehi… musāvādo hoti – pubbevassa hoti ‘‘musā bhaṇissa’’nti, bhaṇantassa hoti ‘‘musā bhaṇāmī’’ti, bhaṇitassa hoti ‘‘musā mayā ",
      " bhaṇita’’nti vinidhāya diṭṭhiṃ vinidhāya khantiṃ vinidhāya ruciṃ vinidhāya saññaṃ vinidhāya bhāvaṃ – imehi aṭṭhahākārehi musāvādo hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mosavajje na niyyethā"
      },
      "ti. Mosavajje na yāyeyya na niyyāyeyya na vaheyya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[na vuyheyya (sī. ka.), natthi syā. potthake]"
      },
      " na saṃhareyya, mosavajjaṃ pajaheyya vinodeyya byantiṃ kareyya anabhāvaṃ gameyya, mosavajjā ārato assa virato paṭivirato nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā vihareyyāti – mosavajje na niyyetha."
    ],
    "innerText": "Mosavajje na niyyethāti. Mosavajjaṃ vuccati musāvādo. Idhekacco sabhaggato [sabhāgaggato (sī. ka.)] vā parisaggato [parisagato (sī. ka.)] vā…pe… āmisakiñcikkhahetu vā sampajānamusā bhāsitā hoti – idaṃ vuccati mosavajjaṃ. Api ca tīhākārehi musāvādo hoti – pubbevassa hoti ‘‘musā bhaṇissa’’nti, bhaṇantassa hoti ‘‘musā bhaṇāmī’’ti, bhaṇitassa hoti ‘‘musā mayā bhaṇita’’nti, imehi tīhākārehi musāvādo hoti. Api ca catūhākārehi… pañcahākārehi… chahākārehi… sattahākārehi… aṭṭhahākārehi… musāvādo hoti – pubbevassa hoti ‘‘musā bhaṇissa’’nti, bhaṇantassa hoti ‘‘musā bhaṇāmī’’ti, bhaṇitassa hoti ‘‘musā mayā bhaṇita’’nti vinidhāya diṭṭhiṃ vinidhāya khantiṃ vinidhāya ruciṃ vinidhāya saññaṃ vinidhāya bhāvaṃ – imehi aṭṭhahākārehi musāvādo hoti. Mosavajje na niyyethāti. Mosavajje na yāyeyya na niyyāyeyya na vaheyya [na vuyheyya (sī. ka.), natthi syā. potthake] na saṃhareyya, mosavajjaṃ pajaheyya vinodeyya byantiṃ kareyya anabhāvaṃ gameyya, mosavajjā ārato assa virato paṭivirato nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā vihareyyāti – mosavajje na niyyetha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sampajāno saṭhāni na kayirā"
      },
      "ti. Katamaṃ sāṭheyyaṃ? Idhekacco saṭho hoti parisaṭho, yaṃ tattha saṭhaṃ saṭhatā sāṭheyyaṃ kakkaratā kakkariyaṃ parikkhattatā pārikkhattiyaṃ – idaṃ vuccati sāṭheyyaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sampajāno saṭhāni na kayirā"
      },
      "ti. Sampajāno hutvā sāṭheyyaṃ na kareyya na janeyya na sañjaneyya na nibbatteyya nābhinibbatteyya, sāṭheyyaṃ ",
      " pajaheyya vinodeyya byantiṃ kareyya ",
      " anabhāvaṃ gameyya, sāṭheyyā ārato assa ",
      " virato paṭivirato nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā vihareyyāti – sampajāno saṭhāni na kayirā."
    ],
    "innerText": "Sampajāno saṭhāni na kayirāti. Katamaṃ sāṭheyyaṃ? Idhekacco saṭho hoti parisaṭho, yaṃ tattha saṭhaṃ saṭhatā sāṭheyyaṃ kakkaratā kakkariyaṃ parikkhattatā pārikkhattiyaṃ – idaṃ vuccati sāṭheyyaṃ. Sampajāno saṭhāni na kayirāti. Sampajāno hutvā sāṭheyyaṃ na kareyya na janeyya na sañjaneyya na nibbatteyya nābhinibbatteyya, sāṭheyyaṃ pajaheyya vinodeyya byantiṃ kareyya anabhāvaṃ gameyya, sāṭheyyā ārato assa virato paṭivirato nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā vihareyyāti – sampajāno saṭhāni na kayirā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atha jīvitena paññāya, sīlabbatena nāññamatimaññe"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Athā"
      },
      "ti padasandhi…pe… padānupubbatāpetaṃ – athāti. Idhekacco lūkhajīvitaṃ jīvanto paraṃ paṇītajīvitaṃ jīvantaṃ atimaññati – ‘‘kiṃ panāyaṃ bahulājīvo sabbaṃ saṃbhakkheti, seyyathidaṃ – mūlabījaṃ khandhabījaṃ phaḷubījaṃ aggabījaṃ bījabījameva pañcamaṃ asanivicakkadantakūṭasamaṇappadhānenā’’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[asanīva cakkaṃ dantakūṭaṃ samaṇappadhānenāti (sī.)]"
      },
      ". So tāya lūkhajīvitāya paraṃ paṇītajīvitaṃ jīvantaṃ atimaññati."
    ],
    "innerText": "Atha jīvitena paññāya, sīlabbatena nāññamatimaññeti. Athāti padasandhi…pe… padānupubbatāpetaṃ – athāti. Idhekacco lūkhajīvitaṃ jīvanto paraṃ paṇītajīvitaṃ jīvantaṃ atimaññati – ‘‘kiṃ panāyaṃ bahulājīvo sabbaṃ saṃbhakkheti, seyyathidaṃ – mūlabījaṃ khandhabījaṃ phaḷubījaṃ aggabījaṃ bījabījameva pañcamaṃ asanivicakkadantakūṭasamaṇappadhānenā’’ti [asanīva cakkaṃ dantakūṭaṃ samaṇappadhānenāti (sī.)]. So tāya lūkhajīvitāya paraṃ paṇītajīvitaṃ jīvantaṃ atimaññati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idhekacco paṇītajīvitaṃ jīvanto paraṃ lūkhajīvitaṃ jīvantaṃ atimaññati – ‘‘kiṃ panāyaṃ appapuñño appesakkho na lābhī cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārāna’’nti. So tāya paṇītajīvitāya ",
      " paraṃ lūkhajīvitaṃ jīvantaṃ atimaññati. Idhekacco paññāsampanno hoti. So puṭṭho pañhaṃ visajjeti. Tassa evaṃ hoti – ‘‘ahamasmi paññāsampanno, ime panaññe na paññāsampannā’’ti. So tāya paññāsampadāya paraṃ atimaññati. Idhekacco sīlasampanno hoti, pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno, aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu. Tassa evaṃ hoti – ‘‘ahamasmi sīlasampanno, ime panaññe ",
      " bhikkhū dussīlā pāpadhammā’’ti. So tāya sīlasampadāya paraṃ atimaññati. Idhekacco vatasampanno hoti āraññiko vā piṇḍapātiko vā paṃsukūliko vā tecīvariko vā sapadānacāriko vā khalupacchābhattiko vā nesajjiko vā yathāsanthatiko vā. Tassa evaṃ hoti – ‘‘ahamasmi vata sampanno, ime panaññe na vatasampannā’’ti. So tāya vatasampadāya paraṃ atimaññati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atha jīvitena paññāya, sīlabbatena nāññamatimaññe"
      },
      "ti. Lūkhajīvitāya vā paṇītajīvitāya vā paññāsampadāya vā sīlasampadāya vā vatasampadāya vā paraṃ nātimaññeyya, nāvajāneyya, na tena mānaṃ janeyya, na tena thaddho assa, patthaddho paggahitasiroti – atha jīvitena paññāya sīlabbatena nāññamatimaññe."
    ],
    "innerText": "Idhekacco paṇītajīvitaṃ jīvanto paraṃ lūkhajīvitaṃ jīvantaṃ atimaññati – ‘‘kiṃ panāyaṃ appapuñño appesakkho na lābhī cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārāna’’nti. So tāya paṇītajīvitāya paraṃ lūkhajīvitaṃ jīvantaṃ atimaññati. Idhekacco paññāsampanno hoti. So puṭṭho pañhaṃ visajjeti. Tassa evaṃ hoti – ‘‘ahamasmi paññāsampanno, ime panaññe na paññāsampannā’’ti. So tāya paññāsampadāya paraṃ atimaññati. Idhekacco sīlasampanno hoti, pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno, aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu. Tassa evaṃ hoti – ‘‘ahamasmi sīlasampanno, ime panaññe bhikkhū dussīlā pāpadhammā’’ti. So tāya sīlasampadāya paraṃ atimaññati. Idhekacco vatasampanno hoti āraññiko vā piṇḍapātiko vā paṃsukūliko vā tecīvariko vā sapadānacāriko vā khalupacchābhattiko vā nesajjiko vā yathāsanthatiko vā. Tassa evaṃ hoti – ‘‘ahamasmi vata sampanno, ime panaññe na vatasampannā’’ti. So tāya vatasampadāya paraṃ atimaññati. Atha jīvitena paññāya, sīlabbatena nāññamatimaññeti. Lūkhajīvitāya vā paṇītajīvitāya vā paññāsampadāya vā sīlasampadāya vā vatasampadāya vā paraṃ nātimaññeyya, nāvajāneyya, na tena mānaṃ janeyya, na tena thaddho assa, patthaddho paggahitasiroti – atha jīvitena paññāya sīlabbatena nāññamatimaññe."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Mosavajje na niyyetha, sampajāno saṭhāni na kayirā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Atha jīvitena paññāya, sīlabbatena nāññamatimaññe’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "167"
      },
      "."
    ],
    "innerText": "167."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sutvā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rusito"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[dūsito (sī. syā.)]"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bahuṃ vācaṃ, samaṇānaṃ vā puthujanānaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[puthuvacanānaṃ (sī. syā.)]"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": ";"
      }
    ],
    "innerText": "Sutvārusito[dūsito (sī. syā.)]bahuṃ vācaṃ, samaṇānaṃ vā puthujanānaṃ[puthuvacanānaṃ (sī. syā.)];"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pharusena ne na paṭivajjā, na hi santo paṭiseniṃ karonti"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[paṭiseni karoti (syā.)]"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "."
      }
    ],
    "innerText": "Pharusena ne na paṭivajjā, na hi santo paṭiseniṃ karonti[paṭiseni karoti (syā.)]."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sutvā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rusito bahuṃ vācaṃ, samaṇānaṃ puthujanāna"
      },
      "nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rusito"
      },
      "ti dūsito khuṃsito ghaṭṭito vambhito garahito upavadito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samaṇāna"
      },
      "nti ye keci ito bahiddhā paribbajūpagatā paribbajasamāpannā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puthujanāna"
      },
      "nti khattiyā ca brāhmaṇā ca vessā ca suddā ca gahaṭṭhā ca pabbajitā ca devā ca manussā ca, te bahukāhi vācāhi aniṭṭhāhi akantāhi amanāpāhi akkoseyyuṃ paribhāseyyuṃ roseyyuṃ viroseyyuṃ hiṃseyyuṃ vihiṃseyyuṃ heṭheyyuṃ viheṭheyyuṃ ghāteyyuṃ upaghāteyyuṃ upaghātaṃ kareyyuṃ tesaṃ bahuṃ vācaṃ aniṭṭhaṃ akantaṃ amanāpaṃ sutvā suṇitvā uggahitvā upadhārayitvā upalakkhayitvāti – sutvā rusito bahuṃ vācaṃ, samaṇānaṃ vā puthujanānaṃ."
    ],
    "innerText": "Sutvārusito bahuṃ vācaṃ, samaṇānaṃ puthujanānanti. Rusitoti dūsito khuṃsito ghaṭṭito vambhito garahito upavadito. Samaṇānanti ye keci ito bahiddhā paribbajūpagatā paribbajasamāpannā. Puthujanānanti khattiyā ca brāhmaṇā ca vessā ca suddā ca gahaṭṭhā ca pabbajitā ca devā ca manussā ca, te bahukāhi vācāhi aniṭṭhāhi akantāhi amanāpāhi akkoseyyuṃ paribhāseyyuṃ roseyyuṃ viroseyyuṃ hiṃseyyuṃ vihiṃseyyuṃ heṭheyyuṃ viheṭheyyuṃ ghāteyyuṃ upaghāteyyuṃ upaghātaṃ kareyyuṃ tesaṃ bahuṃ vācaṃ aniṭṭhaṃ akantaṃ amanāpaṃ sutvā suṇitvā uggahitvā upadhārayitvā upalakkhayitvāti – sutvā rusito bahuṃ vācaṃ, samaṇānaṃ vā puthujanānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pharusena ne na paṭivajjā"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pharusenā"
      },
      "ti pharusena kakkhaḷena na paṭivajjā nappaṭibhaṇeyya, akkosantaṃ na paccakkoseyya, rosantaṃ nappaṭiroseyya, bhaṇḍanaṃ nappaṭibhaṇḍeyya na kalahaṃ kareyya na bhaṇḍanaṃ kareyya na viggahaṃ kareyya na vivādaṃ kareyya na medhagaṃ kareyya, kalahabhaṇḍanaviggahavivādamedhagaṃ pajaheyya vinodeyya byantiṃ kareyya anabhāvaṃ gameyya, kalahabhaṇḍanaviggahavivādamedhagā ārato assa virato paṭivirato nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā vihareyyāti – pharusena ne na paṭivajjā."
    ],
    "innerText": "Pharusena ne na paṭivajjāti. Pharusenāti pharusena kakkhaḷena na paṭivajjā nappaṭibhaṇeyya, akkosantaṃ na paccakkoseyya, rosantaṃ nappaṭiroseyya, bhaṇḍanaṃ nappaṭibhaṇḍeyya na kalahaṃ kareyya na bhaṇḍanaṃ kareyya na viggahaṃ kareyya na vivādaṃ kareyya na medhagaṃ kareyya, kalahabhaṇḍanaviggahavivādamedhagaṃ pajaheyya vinodeyya byantiṃ kareyya anabhāvaṃ gameyya, kalahabhaṇḍanaviggahavivādamedhagā ārato assa virato paṭivirato nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā vihareyyāti – pharusena ne na paṭivajjā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na hi santo paṭiseniṃ karontī"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Santo"
      },
      "ti rāgassa santattā santo, dosassa… mohassa… kodhassa… upanāhassa…pe… sabbākusalābhisaṅkhārānaṃ ",
      " santattā samitattā vūpasamitattā vijjhātattā nibbutattā vigatattā paṭipassaddhattā santo upasanto vūpasanto nibbuto paṭipassaddhoti – santo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na hi santo paṭiseniṃ karontī"
      },
      "ti. Santo paṭiseniṃ paṭimallaṃ paṭikaṇṭakaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[paṭibandhanaṃ (sī.)]"
      },
      " paṭipakkhaṃ na karonti na janenti ",
      " na sañjanenti ",
      " na nibbattenti nābhinibbattentīti – na hi santo paṭiseniṃ karonti."
    ],
    "innerText": "Na hi santo paṭiseniṃ karontīti. Santoti rāgassa santattā santo, dosassa… mohassa… kodhassa… upanāhassa…pe… sabbākusalābhisaṅkhārānaṃ santattā samitattā vūpasamitattā vijjhātattā nibbutattā vigatattā paṭipassaddhattā santo upasanto vūpasanto nibbuto paṭipassaddhoti – santo. Na hi santo paṭiseniṃ karontīti. Santo paṭiseniṃ paṭimallaṃ paṭikaṇṭakaṃ [paṭibandhanaṃ (sī.)] paṭipakkhaṃ na karonti na janenti na sañjanenti na nibbattenti nābhinibbattentīti – na hi santo paṭiseniṃ karonti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sutvā rusito bahuṃ vācaṃ, samaṇānaṃ vā puthujanānaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pharusena ne na paṭivajjā, na hi santo paṭiseniṃ karontī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "168"
      },
      "."
    ],
    "innerText": "168."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etañca"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammamaññāya, vicinaṃ bhikkhu sadā sato sikkhe;"
      }
    ],
    "innerText": "Etañcadhammamaññāya, vicinaṃ bhikkhu sadā sato sikkhe;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Santīti nibbutiṃ ñatvā, sāsane gotamassa nappamajjeyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etañca dhammamaññāyā"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Eta"
      },
      "nti ācikkhitaṃ desitaṃ paññapitaṃ paṭṭhapitaṃ vivaṭaṃ vibhattaṃ uttānīkataṃ pakāsitaṃ dhammaṃ aññāya jānitvā tulayitvā tīrayitvā vibhāvayitvā vibhūtaṃ katvāti. Evampi etañca dhammamaññāya. Atha vā samañca visamañca pathañca vipathañca sāvajjañca anavajjañca hīnañca paṇītañca kaṇhañca sukkañca viññūgarahitañca viññūpasatthañca dhammaṃ aññāya jānitvā ",
      " tulayitvā tīrayitvā vibhāvayitvā vibhūtaṃ katvāti. Evampi etañca dhammamaññāya. Atha vā sammāpaṭipadaṃ anulomapaṭipadaṃ apaccanīkapaṭipadaṃ aviruddhapaṭipadaṃ anvatthapaṭipadaṃ dhammānudhammapaṭipadaṃ sīlesu paripūrakāritaṃ indriyesu guttadvārataṃ bhojane mattaññutaṃ jāgariyānuyogaṃ satisampajaññaṃ, cattāro satipaṭṭhāne cattāro sammappadhāne cattāro iddhipāde pañcindriyāni pañca balāni satta bojjhaṅge ariyaṃ aṭṭhaṅgikaṃ maggaṃ, nibbānañca nibbānagāminiñca paṭipadaṃ dhammaṃ aññāya jānitvā tulayitvā tīrayitvā vibhāvayitvā vibhūtaṃ katvāti. Evampi tañca dhammamaññāya."
    ],
    "innerText": "Etañca dhammamaññāyāti. Etanti ācikkhitaṃ desitaṃ paññapitaṃ paṭṭhapitaṃ vivaṭaṃ vibhattaṃ uttānīkataṃ pakāsitaṃ dhammaṃ aññāya jānitvā tulayitvā tīrayitvā vibhāvayitvā vibhūtaṃ katvāti. Evampi etañca dhammamaññāya. Atha vā samañca visamañca pathañca vipathañca sāvajjañca anavajjañca hīnañca paṇītañca kaṇhañca sukkañca viññūgarahitañca viññūpasatthañca dhammaṃ aññāya jānitvā tulayitvā tīrayitvā vibhāvayitvā vibhūtaṃ katvāti. Evampi etañca dhammamaññāya. Atha vā sammāpaṭipadaṃ anulomapaṭipadaṃ apaccanīkapaṭipadaṃ aviruddhapaṭipadaṃ anvatthapaṭipadaṃ dhammānudhammapaṭipadaṃ sīlesu paripūrakāritaṃ indriyesu guttadvārataṃ bhojane mattaññutaṃ jāgariyānuyogaṃ satisampajaññaṃ, cattāro satipaṭṭhāne cattāro sammappadhāne cattāro iddhipāde pañcindriyāni pañca balāni satta bojjhaṅge ariyaṃ aṭṭhaṅgikaṃ maggaṃ, nibbānañca nibbānagāminiñca paṭipadaṃ dhammaṃ aññāya jānitvā tulayitvā tīrayitvā vibhāvayitvā vibhūtaṃ katvāti. Evampi tañca dhammamaññāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vicinaṃ bhikkhu sadā sato sikkhe"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vicina"
      },
      "nti vicinanto pavicinanto tulayanto tīrayanto vibhāvayanto vibhūtaṃ karonto. ‘‘Sabbe saṅkhārā aniccā’’ti…pe… ‘‘yaṃ kiñci samudayadhammaṃ sabbaṃ taṃ nirodhadhamma’’nti vicinanto ",
      " pavicinanto tulayanto tīrayanto vibhāvayanto vibhūtaṃ karontoti – vicinaṃ bhikkhu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sadā"
      },
      "ti sadā sabbadā sabbakālaṃ…pe… pacchime vayokhandhe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sato"
      },
      "ti catūhi kāraṇehi sato – kāye kāyānupassanāsatipaṭṭhānaṃ bhāvento sato…pe… so vuccati sato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sikkhe"
      },
      "ti ",
      " tisso sikkhāyo – adhisīlasikkhā, adhicittasikkhā, adhipaññāsikkhā…pe… ayaṃ adhipaññāsikkhā. Imā tisso sikkhāyo āvajjanto sikkheyya…pe… sikkheyya ācareyya samācareyya samādāya vatteyyāti – vicinaṃ bhikkhu sadā sato sikkhe."
    ],
    "innerText": "Vicinaṃ bhikkhu sadā sato sikkheti. Vicinanti vicinanto pavicinanto tulayanto tīrayanto vibhāvayanto vibhūtaṃ karonto. ‘‘Sabbe saṅkhārā aniccā’’ti…pe… ‘‘yaṃ kiñci samudayadhammaṃ sabbaṃ taṃ nirodhadhamma’’nti vicinanto pavicinanto tulayanto tīrayanto vibhāvayanto vibhūtaṃ karontoti – vicinaṃ bhikkhu. Sadāti sadā sabbadā sabbakālaṃ…pe… pacchime vayokhandhe. Satoti catūhi kāraṇehi sato – kāye kāyānupassanāsatipaṭṭhānaṃ bhāvento sato…pe… so vuccati sato. Sikkheti tisso sikkhāyo – adhisīlasikkhā, adhicittasikkhā, adhipaññāsikkhā…pe… ayaṃ adhipaññāsikkhā. Imā tisso sikkhāyo āvajjanto sikkheyya…pe… sikkheyya ācareyya samācareyya samādāya vatteyyāti – vicinaṃ bhikkhu sadā sato sikkhe."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Santīti"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nibbutiṃ ñatvā"
      },
      "ti. Rāgassa nibbutiṃ santīti ñatvā, dosassa… mohassa…pe… sabbākusalābhisaṅkhārānaṃ nibbutiṃ santīti ñatvā jānitvā tulayitvā tīrayitvā vibhāvayitvā vibhūtaṃ katvāti – santīti nibbutiṃ ñatvā."
    ],
    "innerText": "Santītinibbutiṃ ñatvāti. Rāgassa nibbutiṃ santīti ñatvā, dosassa… mohassa…pe… sabbākusalābhisaṅkhārānaṃ nibbutiṃ santīti ñatvā jānitvā tulayitvā tīrayitvā vibhāvayitvā vibhūtaṃ katvāti – santīti nibbutiṃ ñatvā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sāsane gotamassa nappamajjeyyā"
      },
      "ti. Gotamassa sāsane buddhasāsane jinasāsane tathāgatasāsane ",
      " devasāsane arahantasāsane. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nappamajjeyyā"
      },
      "ti sakkaccakārī assa sātaccakārī aṭṭhitakārī anolīnavuttiko anikkhittacchando anikkhittadhuro kusalesu dhammesu. ‘‘Kadāhaṃ aparipūraṃ vā sīlakkhandhaṃ paripūreyyaṃ…pe… aparipūraṃ vā samādhikkhandhaṃ… paññākkhandhaṃ… vimuttikkhandhaṃ… vimuttiñāṇadassanakkhandhaṃ? Kadāhaṃ apariññātaṃ vā dukkhaṃ parijāneyyaṃ, appahīne vā kilese pajaheyyaṃ, abhāvitaṃ vā maggaṃ bhāveyyaṃ, asacchikataṃ vā nirodhaṃ sacchikareyya’’nti? Yo tattha chando ca vāyāmo ca ussāho ca ussoḷhī ca thāmo ca appaṭivānī ca sati ca sampajaññañca ātappaṃ padhānaṃ adhiṭṭhānaṃ anuyogo appamādo kusalesu dhammesūti – sāsane gotamassa nappamajjeyya."
    ],
    "innerText": "Sāsane gotamassa nappamajjeyyāti. Gotamassa sāsane buddhasāsane jinasāsane tathāgatasāsane devasāsane arahantasāsane. Nappamajjeyyāti sakkaccakārī assa sātaccakārī aṭṭhitakārī anolīnavuttiko anikkhittacchando anikkhittadhuro kusalesu dhammesu. ‘‘Kadāhaṃ aparipūraṃ vā sīlakkhandhaṃ paripūreyyaṃ…pe… aparipūraṃ vā samādhikkhandhaṃ… paññākkhandhaṃ… vimuttikkhandhaṃ… vimuttiñāṇadassanakkhandhaṃ? Kadāhaṃ apariññātaṃ vā dukkhaṃ parijāneyyaṃ, appahīne vā kilese pajaheyyaṃ, abhāvitaṃ vā maggaṃ bhāveyyaṃ, asacchikataṃ vā nirodhaṃ sacchikareyya’’nti? Yo tattha chando ca vāyāmo ca ussāho ca ussoḷhī ca thāmo ca appaṭivānī ca sati ca sampajaññañca ātappaṃ padhānaṃ adhiṭṭhānaṃ anuyogo appamādo kusalesu dhammesūti – sāsane gotamassa nappamajjeyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Etañca dhammamaññāya, vicinaṃ bhikkhu sadā sato sikkhe;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Santīti nibbutiṃ ñatvā, sāsane gotamassa nappamajjeyyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "169"
      },
      "."
    ],
    "innerText": "169."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhibhū"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hi so anabhibhūto, sakkhidhammamanītihamaddasi;"
      }
    ],
    "innerText": "Abhibhūhi so anabhibhūto, sakkhidhammamanītihamaddasi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasmā hi tassa bhagavato sāsane, appamatto sadā namassamanusikkhe."
      },
      "[iti bhagavā]"
    ],
    "innerText": "Tasmā hi tassa bhagavato sāsane, appamatto sadā namassamanusikkhe.[iti bhagavā]"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhibhū"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hi so anabhibhūto"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhibhū"
      },
      "ti rūpābhibhū ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[abhibhūtarūpā (syā.) evamaññesu pañcapadesupi]"
      },
      " saddābhibhū gandhābhibhū rasābhibhū phoṭṭhabbābhibhū dhammābhibhū, anabhibhūto kehici kilesehi, abhibhosi ne pāpake ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[abhibhū hi ne hīne pāpake (sī. ka.), abhibhū hi pāpake (syā.)]"
      },
      " akusale dhamme saṃkilesike ponobhavike sadare dukkhavipāke āyatiṃ jātijarāmaraṇiyeti – abhibhū hi so anabhibhūto."
    ],
    "innerText": "Abhibhūhi so anabhibhūtoti. Abhibhūti rūpābhibhū [abhibhūtarūpā (syā.) evamaññesu pañcapadesupi] saddābhibhū gandhābhibhū rasābhibhū phoṭṭhabbābhibhū dhammābhibhū, anabhibhūto kehici kilesehi, abhibhosi ne pāpake [abhibhū hi ne hīne pāpake (sī. ka.), abhibhū hi pāpake (syā.)] akusale dhamme saṃkilesike ponobhavike sadare dukkhavipāke āyatiṃ jātijarāmaraṇiyeti – abhibhū hi so anabhibhūto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sakkhidhammamanītihamaddasī"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sakkhidhamma"
      },
      "nti na itihitihaṃ na itikiriyāya na paramparāya na piṭakasampadāya na takkahetu na nayahetu na ākāraparivitakkena na diṭṭhinijjhānakkhantiyā sāmaṃ sayamabhiññātaṃ attapaccakkhadhammaṃ addasi addakkhi apassi paṭivijjhīti – sakkhidhammamanītihamaddasi."
    ],
    "innerText": "Sakkhidhammamanītihamaddasīti. Sakkhidhammanti na itihitihaṃ na itikiriyāya na paramparāya na piṭakasampadāya na takkahetu na nayahetu na ākāraparivitakkena na diṭṭhinijjhānakkhantiyā sāmaṃ sayamabhiññātaṃ attapaccakkhadhammaṃ addasi addakkhi apassi paṭivijjhīti – sakkhidhammamanītihamaddasi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasmā hi tassa bhagavato sāsane"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasmā"
      },
      "ti tasmā taṃkāraṇā taṃhetu tappaccayā taṃnidānā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tassa bhagavato sāsane"
      },
      "ti. Tassa bhagavato sāsane gotamasāsane buddhasāsane jinasāsane tathāgatasāsane devasāsane arahantasāsaneti – tasmā tassa bhagavato sāsane."
    ],
    "innerText": "Tasmā hi tassa bhagavato sāsaneti. Tasmāti tasmā taṃkāraṇā taṃhetu tappaccayā taṃnidānā. Tassa bhagavato sāsaneti. Tassa bhagavato sāsane gotamasāsane buddhasāsane jinasāsane tathāgatasāsane devasāsane arahantasāsaneti – tasmā tassa bhagavato sāsane."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appamatto"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sadā namassamanusikkhe (iti bhagavā)"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appamatto"
      },
      "ti sakkaccakārī…pe… appamādo kusalesu dhammesu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sadā"
      },
      "ti sadā sabbakālaṃ…pe… pacchime vayokhandhe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Namassa"
      },
      "nti kāyena vā namassamāno vācāya vā namassamāno cittena vā namassamāno anvatthapaṭipattiyā vā namassamāno dhammānudhammapaṭipattiyā ",
      " vā namassamāno sakkurumāno garukurumāno ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sakkāramāno garukāramāno (syā.)]"
      },
      " mānayamāno pūjayamāno apacayamāno. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anusikkhe"
      },
      "ti tisso sikkhāyo – adhisīlasikkhā, adhicittasikkhā, adhipaññāsikkhā…pe… ayaṃ adhipaññāsikkhā. Imā tisso sikkhāyo āvajjanto sikkheyya…pe… sacchikātabbaṃ sacchikaronto sikkheyya careyya ācareyya samācareyya samādāya vatteyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhagavā"
      },
      "ti gāravādhivacanaṃ…pe… sacchikā paññatti yadidaṃ bhagavāti – appamatto sadā namassamanusikkhe. (Iti bhagavā)."
    ],
    "innerText": "Appamattosadā namassamanusikkhe (iti bhagavā)ti. Appamattoti sakkaccakārī…pe… appamādo kusalesu dhammesu. Sadāti sadā sabbakālaṃ…pe… pacchime vayokhandhe. Namassanti kāyena vā namassamāno vācāya vā namassamāno cittena vā namassamāno anvatthapaṭipattiyā vā namassamāno dhammānudhammapaṭipattiyā vā namassamāno sakkurumāno garukurumāno [sakkāramāno garukāramāno (syā.)] mānayamāno pūjayamāno apacayamāno. Anusikkheti tisso sikkhāyo – adhisīlasikkhā, adhicittasikkhā, adhipaññāsikkhā…pe… ayaṃ adhipaññāsikkhā. Imā tisso sikkhāyo āvajjanto sikkheyya…pe… sacchikātabbaṃ sacchikaronto sikkheyya careyya ācareyya samācareyya samādāya vatteyya. Bhagavāti gāravādhivacanaṃ…pe… sacchikā paññatti yadidaṃ bhagavāti – appamatto sadā namassamanusikkhe. (Iti bhagavā)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Abhibhū ",
      " hi so anabhibhūto, sakkhidhammamanītihamaddasi;"
    ],
    "innerText": "‘‘Abhibhū hi so anabhibhūto, sakkhidhammamanītihamaddasi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tasmā hi tassa bhagavato sāsane, appamatto sadā namassamanusikkhe’’. [iti bhagavāti]"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "children": [
      "Tuvaṭṭakasuttaniddeso ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[tuvaṭakasuttaniddeso (sī. syā.) suttanipātepi]"
      },
      " cuddasamo."
    ],
    "innerText": "Tuvaṭṭakasuttaniddeso [tuvaṭakasuttaniddeso (sī. syā.) suttanipātepi] cuddasamo."
  }
]