[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "10. Purābhedasuttaniddeso"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " purābhedasuttaniddesaṃ vakkhati –"
    ],
    "innerText": "Atha purābhedasuttaniddesaṃ vakkhati –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "83"
      },
      "."
    ],
    "innerText": "83."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kathaṃdassī"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kathaṃsīlo, upasantoti vuccati;"
      }
    ],
    "innerText": "Kathaṃdassīkathaṃsīlo, upasantoti vuccati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Taṃ me gotama pabrūhi, pucchito uttamaṃ naraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kathaṃdassī kathaṃsīlo, upasantoti vuccatī"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kathaṃdassī"
      },
      "ti kīdisena dassanena samannāgato, kiṃsaṇṭhitena, kiṃpakārena, kiṃpaṭibhāgenāti – kathaṃdassī. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kathaṃsīlo"
      },
      "ti kīdisena sīlena samannāgato, kiṃsaṇṭhitena, kiṃpakārena, kiṃpaṭibhāgenāti – kathaṃdassī kathaṃsīlo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upasantoti vuccatī"
      },
      "ti santo upasanto vūpasanto nibbuto paṭipassaddhoti vuccati pavuccati kathīyati bhaṇīyati dīpīyati voharīyati. Kathaṃdassīti adhipaññaṃ pucchati, kathaṃsīloti adhisīlaṃ pucchati, upasantoti adhicittaṃ pucchatīti – kathaṃdassī kathaṃsīlo upasantoti vuccati."
    ],
    "innerText": "Kathaṃdassī kathaṃsīlo, upasantoti vuccatīti. Kathaṃdassīti kīdisena dassanena samannāgato, kiṃsaṇṭhitena, kiṃpakārena, kiṃpaṭibhāgenāti – kathaṃdassī. Kathaṃsīloti kīdisena sīlena samannāgato, kiṃsaṇṭhitena, kiṃpakārena, kiṃpaṭibhāgenāti – kathaṃdassī kathaṃsīlo. Upasantoti vuccatīti santo upasanto vūpasanto nibbuto paṭipassaddhoti vuccati pavuccati kathīyati bhaṇīyati dīpīyati voharīyati. Kathaṃdassīti adhipaññaṃ pucchati, kathaṃsīloti adhisīlaṃ pucchati, upasantoti adhicittaṃ pucchatīti – kathaṃdassī kathaṃsīlo upasantoti vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃ me gotama pabrūhī"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ta"
      },
      "nti yaṃ pucchāmi, yaṃ yācāmi, yaṃ ajjhesāmi, yaṃ pasādemi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gotamā"
      },
      "ti so nimmito buddhaṃ bhagavantaṃ gottena ālapati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pabrūhī"
      },
      "ti ",
      " brūhi ācikkha desehi paññapehi paṭṭhapehi vivara vibhaja uttānīkarohi pakāsehīti – taṃ me gotama pabrūhi."
    ],
    "innerText": "Taṃ me gotama pabrūhīti. Tanti yaṃ pucchāmi, yaṃ yācāmi, yaṃ ajjhesāmi, yaṃ pasādemi. Gotamāti so nimmito buddhaṃ bhagavantaṃ gottena ālapati. Pabrūhīti brūhi ācikkha desehi paññapehi paṭṭhapehi vivara vibhaja uttānīkarohi pakāsehīti – taṃ me gotama pabrūhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchito uttamaṃ nara"
      },
      "nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchito"
      },
      "ti puṭṭho pucchito yācito ajjhesito pasādito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uttamaṃ nara"
      },
      "nti aggaṃ seṭṭhaṃ visiṭṭhaṃ pāmokkhaṃ uttamaṃ pavaraṃ naranti – pucchito uttamaṃ naraṃ."
    ],
    "innerText": "Pucchito uttamaṃ naranti. Pucchitoti puṭṭho pucchito yācito ajjhesito pasādito. Uttamaṃ naranti aggaṃ seṭṭhaṃ visiṭṭhaṃ pāmokkhaṃ uttamaṃ pavaraṃ naranti – pucchito uttamaṃ naraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tenāha ",
      " so nimmito –"
    ],
    "innerText": "Tenāha so nimmito –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kathaṃdassī kathaṃsīlo, upasantoti vuccati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Taṃ me gotama pabrūhi, pucchito uttamaṃ nara’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "84"
      },
      "."
    ],
    "innerText": "84."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vītataṇho"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "purābhedā, [iti bhagavā]"
      }
    ],
    "innerText": "Vītataṇhopurābhedā, [iti bhagavā]"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Pubbamantamanissito;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Vemajjhe nupasaṅkheyyo,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tassa natthi purakkhataṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vītataṇho purābhedā"
      },
      "ti. Purā kāyassa bhedā, purā attabhāvassa bhedā, purā kaḷevarassa nikkhepā, purā jīvitindriyassa upacchedā vītataṇho vigatataṇho cattataṇho vantataṇho muttataṇho pahīnataṇho paṭinissaṭṭhataṇho, vītarāgo vigatarāgo cattarāgo vantarāgo muttarāgo pahīnarāgo paṭinissaṭṭharāgo, nicchāto nibbuto sītibhūto sukhappaṭisaṃvedī brahmabhūtena attanā viharati."
    ],
    "innerText": "Vītataṇho purābhedāti. Purā kāyassa bhedā, purā attabhāvassa bhedā, purā kaḷevarassa nikkhepā, purā jīvitindriyassa upacchedā vītataṇho vigatataṇho cattataṇho vantataṇho muttataṇho pahīnataṇho paṭinissaṭṭhataṇho, vītarāgo vigatarāgo cattarāgo vantarāgo muttarāgo pahīnarāgo paṭinissaṭṭharāgo, nicchāto nibbuto sītibhūto sukhappaṭisaṃvedī brahmabhūtena attanā viharati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhagavā"
      },
      "ti gāravādhivacanaṃ. Api ca bhaggarāgoti bhagavā, bhaggadosoti bhagavā, bhaggamohoti bhagavā, bhaggamānoti bhagavā, bhaggadiṭṭhīti bhagavā, bhaggataṇhoti bhagavā, bhaggakilesoti bhagavā, bhaji vibhaji pavibhaji dhammaratananti bhagavā, bhavānaṃ antakaroti bhagavā, bhāvitakāyo bhāvitasīlo bhāvitacitto bhāvitapaññoti bhagavā, bhaji vā bhagavā araññavanapatthāni ",
      " pantāni senāsanāni appasaddāni appanigghosāni vijanavātāni manussarāhasseyyakāni ",
      " paṭisallānasāruppānīti bhagavā, bhāgī vā bhagavā cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārānanti bhagavā, bhāgī vā bhagavā attharasassa dhammarasassa vimuttirasassa adhisīlassa adhicittassa adhipaññāyāti bhagavā, bhāgī vā bhagavā catunnaṃ jhānānaṃ catunnaṃ appamaññānaṃ catunnaṃ arūpasamāpattīnanti bhagavā, bhāgī vā bhagavā aṭṭhannaṃ vimokkhānaṃ aṭṭhannaṃ abhibhāyatanānaṃ navannaṃ anupubbavihārasamāpattīnanti bhagavā, bhāgī vā bhagavā dasannaṃ paññābhāvanānaṃ dasannaṃ kasiṇasamāpattīnaṃ ānāpānassatisamādhissa asubhasamāpattiyāti bhagavā, bhāgī vā bhagavā catunnaṃ satipaṭṭhānānaṃ catunnaṃ sammappadhānānaṃ catunnaṃ iddhipādānaṃ pañcannaṃ indriyānaṃ pañcannaṃ balānaṃ sattannaṃ bojjhaṅgānaṃ ariyassa aṭṭhaṅgikassa maggassāti bhagavā, bhāgī vā bhagavā dasannaṃ tathāgatabalānaṃ catunnaṃ vesārajjānaṃ catunnaṃ paṭisambhidānaṃ channaṃ abhiññānaṃ channaṃ buddhadhammānanti bhagavā. Bhagavāti netaṃ nāmaṃ mātarā kataṃ, na pitarā kataṃ, na bhātarā kataṃ, na bhaginiyā kataṃ, na mittāmaccehi kataṃ, na ñātisālohitehi kataṃ ",
      ", na samaṇabrāhmaṇehi kataṃ, na devatāhi kataṃ; vimokkhantikametaṃ buddhānaṃ bhagavantānaṃ bodhiyā mūle saha sabbaññutañāṇassa paṭilābhā sacchikā paññatti yadidaṃ bhagavāti – vītataṇho purābhedāti bhagavā."
    ],
    "innerText": "Bhagavāti gāravādhivacanaṃ. Api ca bhaggarāgoti bhagavā, bhaggadosoti bhagavā, bhaggamohoti bhagavā, bhaggamānoti bhagavā, bhaggadiṭṭhīti bhagavā, bhaggataṇhoti bhagavā, bhaggakilesoti bhagavā, bhaji vibhaji pavibhaji dhammaratananti bhagavā, bhavānaṃ antakaroti bhagavā, bhāvitakāyo bhāvitasīlo bhāvitacitto bhāvitapaññoti bhagavā, bhaji vā bhagavā araññavanapatthāni pantāni senāsanāni appasaddāni appanigghosāni vijanavātāni manussarāhasseyyakāni paṭisallānasāruppānīti bhagavā, bhāgī vā bhagavā cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārānanti bhagavā, bhāgī vā bhagavā attharasassa dhammarasassa vimuttirasassa adhisīlassa adhicittassa adhipaññāyāti bhagavā, bhāgī vā bhagavā catunnaṃ jhānānaṃ catunnaṃ appamaññānaṃ catunnaṃ arūpasamāpattīnanti bhagavā, bhāgī vā bhagavā aṭṭhannaṃ vimokkhānaṃ aṭṭhannaṃ abhibhāyatanānaṃ navannaṃ anupubbavihārasamāpattīnanti bhagavā, bhāgī vā bhagavā dasannaṃ paññābhāvanānaṃ dasannaṃ kasiṇasamāpattīnaṃ ānāpānassatisamādhissa asubhasamāpattiyāti bhagavā, bhāgī vā bhagavā catunnaṃ satipaṭṭhānānaṃ catunnaṃ sammappadhānānaṃ catunnaṃ iddhipādānaṃ pañcannaṃ indriyānaṃ pañcannaṃ balānaṃ sattannaṃ bojjhaṅgānaṃ ariyassa aṭṭhaṅgikassa maggassāti bhagavā, bhāgī vā bhagavā dasannaṃ tathāgatabalānaṃ catunnaṃ vesārajjānaṃ catunnaṃ paṭisambhidānaṃ channaṃ abhiññānaṃ channaṃ buddhadhammānanti bhagavā. Bhagavāti netaṃ nāmaṃ mātarā kataṃ, na pitarā kataṃ, na bhātarā kataṃ, na bhaginiyā kataṃ, na mittāmaccehi kataṃ, na ñātisālohitehi kataṃ , na samaṇabrāhmaṇehi kataṃ, na devatāhi kataṃ; vimokkhantikametaṃ buddhānaṃ bhagavantānaṃ bodhiyā mūle saha sabbaññutañāṇassa paṭilābhā sacchikā paññatti yadidaṃ bhagavāti – vītataṇho purābhedāti bhagavā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pubbamantamanissito"
      },
      "ti ",
      " pubbanto vuccati atīto addhā. Atītaṃ addhānaṃ ārabbha taṇhā pahīnā, diṭṭhi paṭinissaṭṭhā taṇhāya pahīnattā, diṭṭhiyā paṭinissaṭṭhattā. Evampi pubbamantamanissito. Atha vā ‘‘evaṃrūpo ahosiṃ atītamaddhāna’’nti tattha nandiṃ na samannāneti, ‘‘evaṃvedano ahosiṃ… evaṃsañño ahosiṃ… evaṃsaṅkhāro ",
      " ahosiṃ… evaṃviññāṇo ahosiṃ atītamaddhāna’’nti tattha nandiṃ na samannāneti. Evampi pubbamantamanissito. Atha vā ‘‘iti me cakkhu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[cakkhuṃ (sī. ka.)]"
      },
      " ahosi atītamaddhānaṃ – iti rūpā’’ti tattha na chandarāgapaṭibaddhaṃ hoti viññāṇaṃ, na chandarāgapaṭibaddhattā viññāṇassa na tadabhinandati; na tadabhinandanto. Evampi pubbamantamanissito. ‘‘Iti me sotaṃ ahosi atītamaddhānaṃ – iti saddā’’ti, ‘‘iti me ghānaṃ ahosi atītamaddhānaṃ – iti gandhā’’ti, ‘‘iti me jivhā ahosi atītamaddhānaṃ – iti rasā’’ti, ‘‘iti me kāyo ahosi atītamaddhānaṃ – iti phoṭṭhabbā’’ti, ‘‘iti me mano ahosi atītamaddhānaṃ – iti dhammā’’ti tattha na chandarāgapaṭibaddhaṃ hoti viññāṇaṃ, na chandarāgapaṭibaddhattā viññāṇassa na tadabhinandati; na tadabhinandanto. Evampi pubbamantamanissito. Atha vā yāni tāni pubbe mātugāmena saddhiṃ hasitalapitakīḷitāni na tadassādeti, na taṃ nikāmeti, na ca tena vittiṃ āpajjati. Evampi pubbamantamanissito."
    ],
    "innerText": "Pubbamantamanissitoti pubbanto vuccati atīto addhā. Atītaṃ addhānaṃ ārabbha taṇhā pahīnā, diṭṭhi paṭinissaṭṭhā taṇhāya pahīnattā, diṭṭhiyā paṭinissaṭṭhattā. Evampi pubbamantamanissito. Atha vā ‘‘evaṃrūpo ahosiṃ atītamaddhāna’’nti tattha nandiṃ na samannāneti, ‘‘evaṃvedano ahosiṃ… evaṃsañño ahosiṃ… evaṃsaṅkhāro ahosiṃ… evaṃviññāṇo ahosiṃ atītamaddhāna’’nti tattha nandiṃ na samannāneti. Evampi pubbamantamanissito. Atha vā ‘‘iti me cakkhu [cakkhuṃ (sī. ka.)] ahosi atītamaddhānaṃ – iti rūpā’’ti tattha na chandarāgapaṭibaddhaṃ hoti viññāṇaṃ, na chandarāgapaṭibaddhattā viññāṇassa na tadabhinandati; na tadabhinandanto. Evampi pubbamantamanissito. ‘‘Iti me sotaṃ ahosi atītamaddhānaṃ – iti saddā’’ti, ‘‘iti me ghānaṃ ahosi atītamaddhānaṃ – iti gandhā’’ti, ‘‘iti me jivhā ahosi atītamaddhānaṃ – iti rasā’’ti, ‘‘iti me kāyo ahosi atītamaddhānaṃ – iti phoṭṭhabbā’’ti, ‘‘iti me mano ahosi atītamaddhānaṃ – iti dhammā’’ti tattha na chandarāgapaṭibaddhaṃ hoti viññāṇaṃ, na chandarāgapaṭibaddhattā viññāṇassa na tadabhinandati; na tadabhinandanto. Evampi pubbamantamanissito. Atha vā yāni tāni pubbe mātugāmena saddhiṃ hasitalapitakīḷitāni na tadassādeti, na taṃ nikāmeti, na ca tena vittiṃ āpajjati. Evampi pubbamantamanissito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vemajjhe nupasaṅkheyyo"
      },
      "ti. Vemajjhaṃ vuccati paccuppanno addhā. Paccuppannaṃ addhānaṃ ārabbha taṇhā pahīnā, diṭṭhi paṭinissaṭṭhā ",
      ". Taṇhāya pahīnattā, diṭṭhiyā paṭinissaṭṭhattā rattoti nupasaṅkheyyo, duṭṭhoti nupasaṅkheyyo, mūḷhoti nupasaṅkheyyo, vinibaddhoti nupasaṅkheyyo, parāmaṭṭhoti nupasaṅkheyyo, vikkhepagatoti nupasaṅkheyyo, aniṭṭhaṅgatoti nupasaṅkheyyo, thāmagatoti nupasaṅkheyyo; te abhisaṅkhārā pahīnā; abhisaṅkhārānaṃ pahīnattā gatiyā nupasaṅkheyyo, nerayikoti vā tiracchānayonikoti vā pettivisayikoti vā manussoti vā ",
      " devoti vā rūpīti ",
      " vā arūpīti vā saññīti vā asaññīti vā nevasaññīnāsaññīti vā. So hetu natthi paccayo natthi kāraṇaṃ natthi yena saṅkhaṃ gaccheyyāti – vemajjhe nupasaṅkheyyo."
    ],
    "innerText": "Vemajjhe nupasaṅkheyyoti. Vemajjhaṃ vuccati paccuppanno addhā. Paccuppannaṃ addhānaṃ ārabbha taṇhā pahīnā, diṭṭhi paṭinissaṭṭhā . Taṇhāya pahīnattā, diṭṭhiyā paṭinissaṭṭhattā rattoti nupasaṅkheyyo, duṭṭhoti nupasaṅkheyyo, mūḷhoti nupasaṅkheyyo, vinibaddhoti nupasaṅkheyyo, parāmaṭṭhoti nupasaṅkheyyo, vikkhepagatoti nupasaṅkheyyo, aniṭṭhaṅgatoti nupasaṅkheyyo, thāmagatoti nupasaṅkheyyo; te abhisaṅkhārā pahīnā; abhisaṅkhārānaṃ pahīnattā gatiyā nupasaṅkheyyo, nerayikoti vā tiracchānayonikoti vā pettivisayikoti vā manussoti vā devoti vā rūpīti vā arūpīti vā saññīti vā asaññīti vā nevasaññīnāsaññīti vā. So hetu natthi paccayo natthi kāraṇaṃ natthi yena saṅkhaṃ gaccheyyāti – vemajjhe nupasaṅkheyyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tassa natthi purakkhata"
      },
      "nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tassā"
      },
      "ti arahato khīṇāsavassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purekkhārā"
      },
      "ti dve purekkhārā – taṇhāpurekkhāro ca diṭṭhipurekkhāro ca…pe… ayaṃ taṇhāpurekkhāro…pe… ayaṃ diṭṭhipurekkhāro. Tassa taṇhāpurekkhāro pahīno, diṭṭhipurekkhāro paṭinissaṭṭho. Taṇhāpurekkhārassa pahīnattā, diṭṭhipurekkhārassa paṭinissaṭṭhattā na taṇhaṃ vā diṭṭhiṃ vā purato katvā carati, na taṇhādhajo na taṇhāketu na taṇhādhipateyyo, na diṭṭhidhajo na diṭṭhiketu na diṭṭhādhipateyyo, na taṇhāya ",
      " vā diṭṭhiyā vā parivārito carati. Evampi tassa natthi purakkhataṃ. Atha vā ‘‘evaṃrūpo siyaṃ anāgatamaddhāna’’nti tattha nandiṃ na samannāneti, ‘‘evaṃvedano ",
      " siyaṃ… evaṃsañño siyaṃ… evaṃsaṅkhāro siyaṃ… evaṃviññāṇo siyaṃ anāgatamaddhāna’’nti tattha nandiṃ na samannāneti. Evampi tassa natthi purakkhataṃ. Atha vā ‘‘iti me cakkhu siyā anāgatamaddhānaṃ – iti rūpā’’ti appaṭiladdhassa paṭilābhāya cittaṃ na paṇidahati, cetaso appaṇidhānappaccayā na tadabhinandati; na tadabhinandanto. Evampi tassa natthi purakkhataṃ. ‘‘Iti me sotaṃ siyā anāgatamaddhānaṃ – iti saddā’’ti, ‘‘iti me ghānaṃ siyā anāgatamaddhānaṃ – iti gandhā’’ti, ‘‘iti me jivhā siyā anāgatamaddhānaṃ – iti rasā’’ti, ‘‘iti me kāyo siyā anāgatamaddhānaṃ – iti phoṭṭhabbā’’ti, ‘‘iti me mano siyā anāgatamaddhānaṃ – iti dhammā’’ti appaṭiladdhassa paṭilābhāya cittaṃ na paṇidahati, cetaso appaṇidhānappaccayā na tadabhinandati; na tadabhinandanto. Evampi tassa natthi purakkhataṃ. Atha vā ‘‘imināhaṃ ",
      " sīlena vā vatena vā tapena vā brahmacariyena vā devo vā bhavissāmi devaññataro’’ti vā appaṭiladdhassa paṭilābhāya cittaṃ na paṇidahati, cetaso appaṇidhānappaccayā na tadabhinandati; na tadabhinandato. Evampi tassa natthi purakkhataṃ."
    ],
    "innerText": "Tassa natthi purakkhatanti. Tassāti arahato khīṇāsavassa. Purekkhārāti dve purekkhārā – taṇhāpurekkhāro ca diṭṭhipurekkhāro ca…pe… ayaṃ taṇhāpurekkhāro…pe… ayaṃ diṭṭhipurekkhāro. Tassa taṇhāpurekkhāro pahīno, diṭṭhipurekkhāro paṭinissaṭṭho. Taṇhāpurekkhārassa pahīnattā, diṭṭhipurekkhārassa paṭinissaṭṭhattā na taṇhaṃ vā diṭṭhiṃ vā purato katvā carati, na taṇhādhajo na taṇhāketu na taṇhādhipateyyo, na diṭṭhidhajo na diṭṭhiketu na diṭṭhādhipateyyo, na taṇhāya vā diṭṭhiyā vā parivārito carati. Evampi tassa natthi purakkhataṃ. Atha vā ‘‘evaṃrūpo siyaṃ anāgatamaddhāna’’nti tattha nandiṃ na samannāneti, ‘‘evaṃvedano siyaṃ… evaṃsañño siyaṃ… evaṃsaṅkhāro siyaṃ… evaṃviññāṇo siyaṃ anāgatamaddhāna’’nti tattha nandiṃ na samannāneti. Evampi tassa natthi purakkhataṃ. Atha vā ‘‘iti me cakkhu siyā anāgatamaddhānaṃ – iti rūpā’’ti appaṭiladdhassa paṭilābhāya cittaṃ na paṇidahati, cetaso appaṇidhānappaccayā na tadabhinandati; na tadabhinandanto. Evampi tassa natthi purakkhataṃ. ‘‘Iti me sotaṃ siyā anāgatamaddhānaṃ – iti saddā’’ti, ‘‘iti me ghānaṃ siyā anāgatamaddhānaṃ – iti gandhā’’ti, ‘‘iti me jivhā siyā anāgatamaddhānaṃ – iti rasā’’ti, ‘‘iti me kāyo siyā anāgatamaddhānaṃ – iti phoṭṭhabbā’’ti, ‘‘iti me mano siyā anāgatamaddhānaṃ – iti dhammā’’ti appaṭiladdhassa paṭilābhāya cittaṃ na paṇidahati, cetaso appaṇidhānappaccayā na tadabhinandati; na tadabhinandanto. Evampi tassa natthi purakkhataṃ. Atha vā ‘‘imināhaṃ sīlena vā vatena vā tapena vā brahmacariyena vā devo vā bhavissāmi devaññataro’’ti vā appaṭiladdhassa paṭilābhāya cittaṃ na paṇidahati, cetaso appaṇidhānappaccayā na tadabhinandati; na tadabhinandato. Evampi tassa natthi purakkhataṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Vītataṇho purābhedā, [iti bhagavā]"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Pubbamantamanissito;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Vemajjhe nupasaṅkheyyo,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tassa natthi purakkhata’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "85"
      },
      "."
    ],
    "innerText": "85."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akkodhano"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asantāsī, avikatthī akukkuco;"
      }
    ],
    "innerText": "Akkodhanoasantāsī, avikatthī akukkuco;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Mantabhāṇī anuddhato, sa ve vācāyato muni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akkodhano asantāsī"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akkodhano"
      },
      "ti yañhi kho vuttaṃ. Api ca kodho tāva vattabbo. Dasahākārehi kodho jāyati – ‘‘anatthaṃ me acarī’’ti kodho jāyati, ‘‘anatthaṃ me caratī’’ti kodho jāyati, ‘‘anatthaṃ me carissatī’’ti kodho jāyati, ‘‘piyassa me manāpassa anatthaṃ acari… anatthaṃ carati… anatthaṃ carissatī’’ti kodho jāyati, ‘‘appiyassa me amanāpassa atthaṃ acari… atthaṃ carati… atthaṃ carissatī’’ti kodho jāyati, aṭṭhāne vā pana kodho jāyati. Yo evarūpo cittassa āghāto paṭighāto, paṭighaṃ paṭivirodho, kopo pakopo sampakopo, doso padoso sampadoso, cittassa byāpatti manopadoso ",
      ", kodho kujjhanā kujjhitattaṃ, doso dussanā dussitattaṃ, byāpatti byāpajjanā byāpajjitattaṃ, virodho paṭivirodho caṇḍikkaṃ, asuropo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[assuropo (sī. ka.)]"
      },
      " anattamanatā cittassa – ayaṃ vuccati kodho."
    ],
    "innerText": "Akkodhano asantāsīti. Akkodhanoti yañhi kho vuttaṃ. Api ca kodho tāva vattabbo. Dasahākārehi kodho jāyati – ‘‘anatthaṃ me acarī’’ti kodho jāyati, ‘‘anatthaṃ me caratī’’ti kodho jāyati, ‘‘anatthaṃ me carissatī’’ti kodho jāyati, ‘‘piyassa me manāpassa anatthaṃ acari… anatthaṃ carati… anatthaṃ carissatī’’ti kodho jāyati, ‘‘appiyassa me amanāpassa atthaṃ acari… atthaṃ carati… atthaṃ carissatī’’ti kodho jāyati, aṭṭhāne vā pana kodho jāyati. Yo evarūpo cittassa āghāto paṭighāto, paṭighaṃ paṭivirodho, kopo pakopo sampakopo, doso padoso sampadoso, cittassa byāpatti manopadoso , kodho kujjhanā kujjhitattaṃ, doso dussanā dussitattaṃ, byāpatti byāpajjanā byāpajjitattaṃ, virodho paṭivirodho caṇḍikkaṃ, asuropo [assuropo (sī. ka.)] anattamanatā cittassa – ayaṃ vuccati kodho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Api ",
      " ca kodhassa adhimattaparittatā veditabbā. Atthi kañci ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kiñci (ka.)]"
      },
      " kālaṃ kodho cittāvilakaraṇamatto hoti, na ca tāva mukhakulānavikulāno hoti; atthi kañci kālaṃ kodho mukhakulānavikulānamatto hoti, na ca tāva hanusañcopano hoti; atthi kañci kālaṃ kodho hanusañcopanamatto hoti, na ca tāva pharusavācaṃ nicchāraṇo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pharusavācanicchāraṇo (syā.)]"
      },
      " hoti; atthi kañci kālaṃ kodho pharusavācaṃ nicchāraṇamatto hoti, na ca tāva disāvidisānuvilokano ",
      " hoti; atthi kañci kālaṃ kodho disāvidisānuvilokanamatto hoti, na ca tāva daṇḍasatthaparāmasano hoti; atthi kañci kālaṃ kodho daṇḍasatthaparāmasanamatto hoti, na ca tāva daṇḍasatthaabbhukkiraṇo hoti; atthi kañci kālaṃ kodho daṇḍasatthaabbhukkiraṇamatto hoti, na ca tāva daṇḍasatthaabhinipātano hoti; atthi kañci kālaṃ kodho ",
      " daṇḍasatthaabhinipātamatto hoti, na ca tāva chinnavicchinnakaraṇo hoti; atthi kañci kālaṃ kodho chinnavicchinnakaraṇamatto hoti, na ca tāva sambhañjanapalibhañjano hoti; atthi kañci kālaṃ kodho sambhañjanapalibhañjanamatto hoti, na ca tāva aṅgamaṅgaapakaḍḍhano hoti; atthi kañci kālaṃ kodho aṅgamaṅgaapakaḍḍhanamatto hoti, na ca tāva jīvitāvoropano ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[jīvitapanāsano (syā.)]"
      },
      " hoti; atthi kañci kālaṃ kodho jīvitāvoropanamatto hoti, na ca tāva sabbacāgapariccāgāya saṇṭhito hoti. Yato kodho parapuggalaṃ ghāṭetvā attānaṃ ghāṭeti, ettāvatā kodho paramussadagato paramavepullappatto hoti. Yassa so kodho pahīno samucchinno vūpasanto paṭipassaddho ",
      " abhabbuppattiko ñāṇagginā daḍḍho, so vuccati akkodhano. Kodhassa pahīnattā akkodhano, kodhavatthussa pariññātattā akkodhano, kodhahetussa upacchinnattā akkodhanoti – akkodhano."
    ],
    "innerText": "Api ca kodhassa adhimattaparittatā veditabbā. Atthi kañci [kiñci (ka.)] kālaṃ kodho cittāvilakaraṇamatto hoti, na ca tāva mukhakulānavikulāno hoti; atthi kañci kālaṃ kodho mukhakulānavikulānamatto hoti, na ca tāva hanusañcopano hoti; atthi kañci kālaṃ kodho hanusañcopanamatto hoti, na ca tāva pharusavācaṃ nicchāraṇo [pharusavācanicchāraṇo (syā.)] hoti; atthi kañci kālaṃ kodho pharusavācaṃ nicchāraṇamatto hoti, na ca tāva disāvidisānuvilokano hoti; atthi kañci kālaṃ kodho disāvidisānuvilokanamatto hoti, na ca tāva daṇḍasatthaparāmasano hoti; atthi kañci kālaṃ kodho daṇḍasatthaparāmasanamatto hoti, na ca tāva daṇḍasatthaabbhukkiraṇo hoti; atthi kañci kālaṃ kodho daṇḍasatthaabbhukkiraṇamatto hoti, na ca tāva daṇḍasatthaabhinipātano hoti; atthi kañci kālaṃ kodho daṇḍasatthaabhinipātamatto hoti, na ca tāva chinnavicchinnakaraṇo hoti; atthi kañci kālaṃ kodho chinnavicchinnakaraṇamatto hoti, na ca tāva sambhañjanapalibhañjano hoti; atthi kañci kālaṃ kodho sambhañjanapalibhañjanamatto hoti, na ca tāva aṅgamaṅgaapakaḍḍhano hoti; atthi kañci kālaṃ kodho aṅgamaṅgaapakaḍḍhanamatto hoti, na ca tāva jīvitāvoropano [jīvitapanāsano (syā.)] hoti; atthi kañci kālaṃ kodho jīvitāvoropanamatto hoti, na ca tāva sabbacāgapariccāgāya saṇṭhito hoti. Yato kodho parapuggalaṃ ghāṭetvā attānaṃ ghāṭeti, ettāvatā kodho paramussadagato paramavepullappatto hoti. Yassa so kodho pahīno samucchinno vūpasanto paṭipassaddho abhabbuppattiko ñāṇagginā daḍḍho, so vuccati akkodhano. Kodhassa pahīnattā akkodhano, kodhavatthussa pariññātattā akkodhano, kodhahetussa upacchinnattā akkodhanoti – akkodhano."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asantāsī"
      },
      "ti idhekacco tāsī hoti uttāsī parittāsī, so ",
      " tasati na uttasati parittasati bhāyati santāsaṃ āpajjati. Kulaṃ vā na labhāmi, gaṇaṃ vā na labhāmi, āvāsaṃ vā na labhāmi, lābhaṃ vā na labhāmi, yasaṃ vā na labhāmi, pasaṃsaṃ vā na labhāmi, sukhaṃ vā na labhāmi, cīvaraṃ vā na labhāmi, piṇḍapātaṃ vā na labhāmi, senāsanaṃ vā na labhāmi, gilānapaccayabhesajjaparikkhāraṃ vā na labhāmi, gilānupaṭṭhākaṃ vā na labhāmi, appaññātomhīti tasati uttasati parittasati bhāyati santāsaṃ āpajjati."
    ],
    "innerText": "Asantāsīti idhekacco tāsī hoti uttāsī parittāsī, so tasati na uttasati parittasati bhāyati santāsaṃ āpajjati. Kulaṃ vā na labhāmi, gaṇaṃ vā na labhāmi, āvāsaṃ vā na labhāmi, lābhaṃ vā na labhāmi, yasaṃ vā na labhāmi, pasaṃsaṃ vā na labhāmi, sukhaṃ vā na labhāmi, cīvaraṃ vā na labhāmi, piṇḍapātaṃ vā na labhāmi, senāsanaṃ vā na labhāmi, gilānapaccayabhesajjaparikkhāraṃ vā na labhāmi, gilānupaṭṭhākaṃ vā na labhāmi, appaññātomhīti tasati uttasati parittasati bhāyati santāsaṃ āpajjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      " bhikkhu asantāsī hoti anuttāsī aparittāsī; so na tasati na uttasati na parittasati na bhāyati na santāsaṃ āpajjati. Kulaṃ vā na labhāmi, gaṇaṃ vā na labhāmi, āvāsaṃ vā na labhāmi, lābhaṃ vā na labhāmi, yasaṃ vā na labhāmi, pasaṃsaṃ vā na labhāmi, sukhaṃ vā na labhāmi, cīvaraṃ vā na labhāmi, piṇḍapātaṃ vā na labhāmi, senāsanaṃ vā na labhāmi, gilānapaccayabhesajjaparikkhāraṃ vā na labhāmi, gilānupaṭṭhākaṃ vā na labhāmi, appaññātomhīti na tasati na uttasati na parittasati na bhāyati na santāsaṃ āpajjatīti – akkodhano asantāsī."
    ],
    "innerText": "Idha bhikkhu asantāsī hoti anuttāsī aparittāsī; so na tasati na uttasati na parittasati na bhāyati na santāsaṃ āpajjati. Kulaṃ vā na labhāmi, gaṇaṃ vā na labhāmi, āvāsaṃ vā na labhāmi, lābhaṃ vā na labhāmi, yasaṃ vā na labhāmi, pasaṃsaṃ vā na labhāmi, sukhaṃ vā na labhāmi, cīvaraṃ vā na labhāmi, piṇḍapātaṃ vā na labhāmi, senāsanaṃ vā na labhāmi, gilānapaccayabhesajjaparikkhāraṃ vā na labhāmi, gilānupaṭṭhākaṃ vā na labhāmi, appaññātomhīti na tasati na uttasati na parittasati na bhāyati na santāsaṃ āpajjatīti – akkodhano asantāsī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avikatthī akukkuco"
      },
      "ti. Idhekacco katthī hoti vikatthī, so katthati vikatthati – ahamasmi sīlasampannoti vā vatasampannoti vā sīlabbatasampannoti vā jātiyā vā gottena vā kolaputtiyena vā vaṇṇapokkharatāya ",
      " vā dhanena vā ajjhenena vā kammāyatanena vā sippāyatanena vā vijjāṭṭhānena vā sutena vā ",
      " paṭibhānena vā aññataraññatarena vā vatthunā. Uccā kulā ",
      " pabbajitoti vā mahākulā pabbajitoti vā, mahābhogakulā pabbajitoti vā uḷārabhogakulā pabbajitoti vā, ñāto yasassī gahaṭṭhapabbajitānanti vā, lābhimhi cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārānanti vā, suttantikoti vā vinayadharoti vā dhammakathikoti vā, āraññikoti vā piṇḍapātikoti vā paṃsukūlikoti vā tecīvarikoti vā, sapadānacārikoti vā khalupacchābhattikoti vā nesajjikoti vā yathāsanthatikoti vā, paṭhamassa jhānassa lābhīti vā dutiyassa jhānassa lābhīti vā tatiyassa jhānassa lābhīti vā catutthassa jhānassa lābhīti vā, ākāsānañcāyatanasamāpattiyā… viññāṇañcāyatanasamāpattiyā… ākiñcaññāyatanasamāpattiyā… nevasaññānāsaññāyatanasamāpattiyā lābhīti vā katthati vikatthati. Evaṃ na katthati na vikatthati, katthanā vikatthanā ārato virato paṭivirato nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā viharatīti – avikatthī."
    ],
    "innerText": "Avikatthī akukkucoti. Idhekacco katthī hoti vikatthī, so katthati vikatthati – ahamasmi sīlasampannoti vā vatasampannoti vā sīlabbatasampannoti vā jātiyā vā gottena vā kolaputtiyena vā vaṇṇapokkharatāya vā dhanena vā ajjhenena vā kammāyatanena vā sippāyatanena vā vijjāṭṭhānena vā sutena vā paṭibhānena vā aññataraññatarena vā vatthunā. Uccā kulā pabbajitoti vā mahākulā pabbajitoti vā, mahābhogakulā pabbajitoti vā uḷārabhogakulā pabbajitoti vā, ñāto yasassī gahaṭṭhapabbajitānanti vā, lābhimhi cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārānanti vā, suttantikoti vā vinayadharoti vā dhammakathikoti vā, āraññikoti vā piṇḍapātikoti vā paṃsukūlikoti vā tecīvarikoti vā, sapadānacārikoti vā khalupacchābhattikoti vā nesajjikoti vā yathāsanthatikoti vā, paṭhamassa jhānassa lābhīti vā dutiyassa jhānassa lābhīti vā tatiyassa jhānassa lābhīti vā catutthassa jhānassa lābhīti vā, ākāsānañcāyatanasamāpattiyā… viññāṇañcāyatanasamāpattiyā… ākiñcaññāyatanasamāpattiyā… nevasaññānāsaññāyatanasamāpattiyā lābhīti vā katthati vikatthati. Evaṃ na katthati na vikatthati, katthanā vikatthanā ārato virato paṭivirato nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā viharatīti – avikatthī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akukkuco"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kukkucca"
      },
      "nti hatthakukkuccampi kukkuccaṃ, pādakukkuccampi kukkuccaṃ, hatthapādakukkuccampi kukkuccaṃ, akappiye kappiyasaññitā kappiye akappiyasaññitā, vikāle kālasaññitā kāle vikālasaññitā, avajje vajjasaññitā vajje avajjasaññitā; yaṃ evarūpaṃ kukkuccaṃ kukkuccāyanā kukkuccāyitattaṃ cetaso vippaṭisāro manovilekho – idaṃ vuccati kukkuccaṃ."
    ],
    "innerText": "Akukkucoti. Kukkuccanti hatthakukkuccampi kukkuccaṃ, pādakukkuccampi kukkuccaṃ, hatthapādakukkuccampi kukkuccaṃ, akappiye kappiyasaññitā kappiye akappiyasaññitā, vikāle kālasaññitā kāle vikālasaññitā, avajje vajjasaññitā vajje avajjasaññitā; yaṃ evarūpaṃ kukkuccaṃ kukkuccāyanā kukkuccāyitattaṃ cetaso vippaṭisāro manovilekho – idaṃ vuccati kukkuccaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Api ",
      " ca dvīhi kāraṇehi uppajjati kukkuccaṃ cetaso vippaṭisāro manovilekho katattā ca akatattā ca. Kathaṃ katattā ca akatattā ca uppajjati kukkuccaṃ cetaso vippaṭisāro manovilekho? ‘‘Kataṃ me kāyaduccaritaṃ, akataṃ me kāyasucarita’’ntiuppajjati kukkuccaṃ cetaso vippaṭisāro manovilekho; ‘‘kataṃ me vacīduccaritaṃ, akataṃ me vacīsucaritaṃ… kataṃ me manoduccaritaṃ, akataṃ me manosucarita’’nti – uppajjati kukkuccaṃ cetaso vippaṭisāro manovilekho; ‘‘kato me pāṇātipāto, akatā me pāṇātipātā veramaṇī’’ti – uppajjati kukkuccaṃ ",
      " cetaso vippaṭisāro manovilekho; ‘‘kataṃ me adinnādānaṃ ",
      ", akatā me adinnādānā veramaṇī’’ti – uppajjati kukkuccaṃ cetaso vippaṭisāro manovilekho; ‘‘kato me kāmesumicchācāro, akatā me kāmesumicchācārā veramaṇī’’ti – uppajjati kukkuccaṃ cetaso vippaṭisāro manovilekho; ‘‘kato me musāvādo, akatā me musāvādā veramaṇī’’ti… ‘‘katā me pisuṇā vācā, akatā me pisuṇāya vācāya veramaṇī’’ti… ‘‘katā me pharusā vācā, akatā me pharusāya vācāya veramaṇī’’ti… ‘‘kato me samphappalāpo, akatā me samphappalāpā veramaṇī’’ti… ‘‘katā me abhijjhā, akatā me anabhijjhā’’ti… ‘‘kato me byāpādo, akato me abyāpādo’’ti… ‘‘katā me micchādiṭṭhi, akatā me sammādiṭṭhī’’ti – uppajjati kukkuccaṃ cetaso ",
      " vippaṭisāro manovilekho. Evaṃ katattā ca akatattā ca uppajjati kukkuccaṃ cetaso vippaṭisāro manovilekho."
    ],
    "innerText": "Api ca dvīhi kāraṇehi uppajjati kukkuccaṃ cetaso vippaṭisāro manovilekho katattā ca akatattā ca. Kathaṃ katattā ca akatattā ca uppajjati kukkuccaṃ cetaso vippaṭisāro manovilekho? ‘‘Kataṃ me kāyaduccaritaṃ, akataṃ me kāyasucarita’’ntiuppajjati kukkuccaṃ cetaso vippaṭisāro manovilekho; ‘‘kataṃ me vacīduccaritaṃ, akataṃ me vacīsucaritaṃ… kataṃ me manoduccaritaṃ, akataṃ me manosucarita’’nti – uppajjati kukkuccaṃ cetaso vippaṭisāro manovilekho; ‘‘kato me pāṇātipāto, akatā me pāṇātipātā veramaṇī’’ti – uppajjati kukkuccaṃ cetaso vippaṭisāro manovilekho; ‘‘kataṃ me adinnādānaṃ , akatā me adinnādānā veramaṇī’’ti – uppajjati kukkuccaṃ cetaso vippaṭisāro manovilekho; ‘‘kato me kāmesumicchācāro, akatā me kāmesumicchācārā veramaṇī’’ti – uppajjati kukkuccaṃ cetaso vippaṭisāro manovilekho; ‘‘kato me musāvādo, akatā me musāvādā veramaṇī’’ti… ‘‘katā me pisuṇā vācā, akatā me pisuṇāya vācāya veramaṇī’’ti… ‘‘katā me pharusā vācā, akatā me pharusāya vācāya veramaṇī’’ti… ‘‘kato me samphappalāpo, akatā me samphappalāpā veramaṇī’’ti… ‘‘katā me abhijjhā, akatā me anabhijjhā’’ti… ‘‘kato me byāpādo, akato me abyāpādo’’ti… ‘‘katā me micchādiṭṭhi, akatā me sammādiṭṭhī’’ti – uppajjati kukkuccaṃ cetaso vippaṭisāro manovilekho. Evaṃ katattā ca akatattā ca uppajjati kukkuccaṃ cetaso vippaṭisāro manovilekho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha vā ‘‘sīlesumhi na paripūrakārī’’ti – uppajjati kukkuccaṃ cetaso vippaṭisāro manovilekho; ‘‘indriyesumhi aguttadvāro’’ti… ‘‘bhojane amattaññumhī’’ti… ‘‘jāgariyaṃ ananuyuttomhī’’ti… ‘‘na satisampajaññena samannāgatomhī’’ti… ‘‘abhāvitā me cattāro satipaṭṭhānā’’ti… ‘‘abhāvitā me cattāro sammappadhānā’’ti… ‘‘abhāvitā me cattāro iddhipādā’’ti… ‘‘abhāvitāni me pañcindriyānī’’ti… ‘‘abhāvitāni me pañca balānī’’ti… ‘‘abhāvitā me satta bojjhaṅgā’’ti… ‘‘abhāvito me ariyo aṭṭhaṅgiko maggo’’ti… ‘‘dukkhaṃ me apariññāta’’nti… ‘‘samudayo me appahīno’’ti… ‘‘maggo me abhāvito’’ti… ‘‘nirodho me asacchikato’’ti – uppajjati kukkuccaṃ cetaso vippaṭisāro manovilekho. Yassetaṃ kukkuccaṃ pahīnaṃ samucchinnaṃ vūpasantaṃ paṭipassaddhaṃ abhabbuppattikaṃ ñāṇagginā daḍḍhaṃ, so vuccati akukkuccoti – avikatthī akukkuco."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mantabhāṇī anuddhato"
      },
      "ti. Mantā vuccati paññā. Yā paññā pajānanā…pe… amoho dhammavicayo sammādiṭṭhi. Mantāya pariggahetvā pariggahetvā vācaṃ bhāsati bahumpi kathento bahumpi ",
      " bhaṇanto bahumpi dīpayanto bahumpi voharanto. Dukkathitaṃ dubbhaṇitaṃ ",
      " dullapitaṃ duruttaṃ dubbhāsitaṃ vācaṃ na bhāsatīti – mantabhāṇī. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anuddhato"
      },
      "ti. Tattha katamaṃ ",
      " uddhaccaṃ? Yaṃ cittassa uddhaccaṃ ",
      " avūpasamo cetaso vikkhepo bhantattaṃ cittassa – idaṃ vuccati uddhaccaṃ. Yassetaṃ uddhaccaṃ pahīnaṃ samucchinnaṃ vūpasantaṃ paṭipassaddhaṃ abhabbuppattikaṃ ñāṇagginā daḍḍhaṃ, so vuccati anuddhatoti – mantabhāṇī anuddhato."
    ],
    "innerText": "Mantabhāṇī anuddhatoti. Mantā vuccati paññā. Yā paññā pajānanā…pe… amoho dhammavicayo sammādiṭṭhi. Mantāya pariggahetvā pariggahetvā vācaṃ bhāsati bahumpi kathento bahumpi bhaṇanto bahumpi dīpayanto bahumpi voharanto. Dukkathitaṃ dubbhaṇitaṃ dullapitaṃ duruttaṃ dubbhāsitaṃ vācaṃ na bhāsatīti – mantabhāṇī. Anuddhatoti. Tattha katamaṃ uddhaccaṃ? Yaṃ cittassa uddhaccaṃ avūpasamo cetaso vikkhepo bhantattaṃ cittassa – idaṃ vuccati uddhaccaṃ. Yassetaṃ uddhaccaṃ pahīnaṃ samucchinnaṃ vūpasantaṃ paṭipassaddhaṃ abhabbuppattikaṃ ñāṇagginā daḍḍhaṃ, so vuccati anuddhatoti – mantabhāṇī anuddhato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sa ve vācāyato munī"
      },
      "ti. Idha bhikkhu musāvādaṃ pahāya musāvādā paṭivirato hoti saccavādī saccasandho theto paccayiko avisaṃvādako lokassa. Pisuṇaṃ vācaṃ pahāya pisuṇāya vācāya paṭivirato hoti – ito sutvā na amutra akkhātā imesaṃ bhedāya, amutra vā sutvā na imesaṃ akkhātā amūsaṃ bhedāya. Iti bhinnānaṃ vā sandhātā, sahitānaṃ vā anuppadātā, samaggārāmo samaggarato samagganandī samaggakaraṇiṃ vācaṃ bhāsitā hoti. Pharusaṃ vācaṃ pahāya pharusāya vācāya paṭivirato hoti – yā sā vācā nelā kaṇṇasukhā pemanīyā hadayaṅgamā porī bahujanakantā bahujanamanāpā tathārūpiṃ vācaṃ bhāsitā hoti. Samphappalāpaṃ pahāya samphappalāpā paṭivirato hoti – kālavādī bhūtavādī atthavādī dhammavādī vinayavādī nidhānavatiṃ vācaṃ bhāsitā hoti kālena sāpadesaṃ pariyantavatiṃ atthasaṃhitaṃ. Catūhi vacīsucaritehi samannāgato catuddosāpagataṃ vācaṃ bhāsati, bāttiṃsāya tiracchānakathāya ārato assa virato paṭivirato nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā viharati."
    ],
    "innerText": "Sa ve vācāyato munīti. Idha bhikkhu musāvādaṃ pahāya musāvādā paṭivirato hoti saccavādī saccasandho theto paccayiko avisaṃvādako lokassa. Pisuṇaṃ vācaṃ pahāya pisuṇāya vācāya paṭivirato hoti – ito sutvā na amutra akkhātā imesaṃ bhedāya, amutra vā sutvā na imesaṃ akkhātā amūsaṃ bhedāya. Iti bhinnānaṃ vā sandhātā, sahitānaṃ vā anuppadātā, samaggārāmo samaggarato samagganandī samaggakaraṇiṃ vācaṃ bhāsitā hoti. Pharusaṃ vācaṃ pahāya pharusāya vācāya paṭivirato hoti – yā sā vācā nelā kaṇṇasukhā pemanīyā hadayaṅgamā porī bahujanakantā bahujanamanāpā tathārūpiṃ vācaṃ bhāsitā hoti. Samphappalāpaṃ pahāya samphappalāpā paṭivirato hoti – kālavādī bhūtavādī atthavādī dhammavādī vinayavādī nidhānavatiṃ vācaṃ bhāsitā hoti kālena sāpadesaṃ pariyantavatiṃ atthasaṃhitaṃ. Catūhi vacīsucaritehi samannāgato catuddosāpagataṃ vācaṃ bhāsati, bāttiṃsāya tiracchānakathāya ārato assa virato paṭivirato nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā viharati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dasa kathāvatthūni kathesi, seyyathidaṃ – appicchakathaṃ katheti, santuṭṭhīkathaṃ ",
      " katheti, pavivekakathaṃ… asaṃsaggakathaṃ… vīriyārambhakathaṃ… sīlakathaṃ… samādhikathaṃ… paññākathaṃ… vimuttikathaṃ ",
      "… vimuttiñāṇadassanakathaṃ… satipaṭṭhānakathaṃ… sammappadhānakathaṃ… iddhipādakathaṃ… indriyakathaṃ… balakathaṃ… bojjhaṅgakathaṃ… maggakathaṃ… phalakathaṃ… nibbānakathaṃ katheti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vācāyato"
      },
      "ti yatto pariyatto gutto gopito rakkhito vūpasanto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Munī"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mona"
      },
      "ṃ vuccati ñāṇaṃ. Yā paññā pajānanā…pe… amoho dhammavicayo sammādiṭṭhi…pe… saṅgajālamaticca so munīti – sa ve vācāyato muni."
    ],
    "innerText": "Dasa kathāvatthūni kathesi, seyyathidaṃ – appicchakathaṃ katheti, santuṭṭhīkathaṃ katheti, pavivekakathaṃ… asaṃsaggakathaṃ… vīriyārambhakathaṃ… sīlakathaṃ… samādhikathaṃ… paññākathaṃ… vimuttikathaṃ … vimuttiñāṇadassanakathaṃ… satipaṭṭhānakathaṃ… sammappadhānakathaṃ… iddhipādakathaṃ… indriyakathaṃ… balakathaṃ… bojjhaṅgakathaṃ… maggakathaṃ… phalakathaṃ… nibbānakathaṃ katheti. Vācāyatoti yatto pariyatto gutto gopito rakkhito vūpasanto. Munīti. Monaṃ vuccati ñāṇaṃ. Yā paññā pajānanā…pe… amoho dhammavicayo sammādiṭṭhi…pe… saṅgajālamaticca so munīti – sa ve vācāyato muni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Akkodhano asantāsī, avikatthī akukkuco;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Mantabhāṇī anuddhato, sa ve vācāyato munī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "86"
      },
      "."
    ],
    "innerText": "86."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nirāsatti"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anāgate, atītaṃ nānusocati;"
      }
    ],
    "innerText": "Nirāsattianāgate, atītaṃ nānusocati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vivekadassī phassesu, diṭṭhīsu ca na nīyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nirāsatti anāgate"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āsatti"
      },
      " vuccati taṇhā. Yo rāgo sārāgo…pe… abhijjhā lobho akusalamūlaṃ. Yassesā āsatti taṇhā pahīnā samucchinnā vūpasantā paṭipassaddhā abhabbuppattikā ñāṇagginā daḍḍhāti. Evampi nirāsatti anāgate. Atha vā ‘‘evaṃrūpo siyaṃ anāgatamaddhāna’’nti tattha nandiṃ na samannāneti, ‘‘evaṃvedano siyaṃ… evaṃsañño siyaṃ… evaṃsaṅkhāro siyaṃ… evaṃviññāṇo siyaṃ anāgatamaddhāna’’nti tattha nandiṃ na samannāneti. Evampi nirāsatti anāgate. Atha vā ‘‘iti me cakkhu siyā anāgatamaddhānaṃ – iti rūpā’’ti appaṭiladdhassa paṭilābhāya cittaṃ na paṇidahati ",
      ", cetaso appaṇidhānappaccayā na tadabhinandati; na tadabhinandanto. Evampi nirāsatti anāgate. ‘‘Iti me sotaṃ siyā anāgatamaddhānaṃ – iti saddā’’ti…pe… ‘‘iti me mano siyā anāgatamaddhānaṃ – iti dhammā’’ti appaṭiladdhassa paṭilābhāya cittaṃ na paṇidahati, cetaso appaṇidhānappaccayā ",
      " na tadabhinandati; na tadabhinandanto. Evampi nirāsatti anāgate. Atha vā ‘‘imināhaṃ sīlena vā vatena vā tapena vā brahmacariyena vā devo vā bhavissāmi devaññataro vā’’ti appaṭiladdhassa paṭilābhāya cittaṃ na paṇidahati, cetaso appaṇidhānappaccayā na tadabhinandati; na tadabhinandanto. Evampi nirāsatti anāgate."
    ],
    "innerText": "Nirāsatti anāgateti. Āsatti vuccati taṇhā. Yo rāgo sārāgo…pe… abhijjhā lobho akusalamūlaṃ. Yassesā āsatti taṇhā pahīnā samucchinnā vūpasantā paṭipassaddhā abhabbuppattikā ñāṇagginā daḍḍhāti. Evampi nirāsatti anāgate. Atha vā ‘‘evaṃrūpo siyaṃ anāgatamaddhāna’’nti tattha nandiṃ na samannāneti, ‘‘evaṃvedano siyaṃ… evaṃsañño siyaṃ… evaṃsaṅkhāro siyaṃ… evaṃviññāṇo siyaṃ anāgatamaddhāna’’nti tattha nandiṃ na samannāneti. Evampi nirāsatti anāgate. Atha vā ‘‘iti me cakkhu siyā anāgatamaddhānaṃ – iti rūpā’’ti appaṭiladdhassa paṭilābhāya cittaṃ na paṇidahati , cetaso appaṇidhānappaccayā na tadabhinandati; na tadabhinandanto. Evampi nirāsatti anāgate. ‘‘Iti me sotaṃ siyā anāgatamaddhānaṃ – iti saddā’’ti…pe… ‘‘iti me mano siyā anāgatamaddhānaṃ – iti dhammā’’ti appaṭiladdhassa paṭilābhāya cittaṃ na paṇidahati, cetaso appaṇidhānappaccayā na tadabhinandati; na tadabhinandanto. Evampi nirāsatti anāgate. Atha vā ‘‘imināhaṃ sīlena vā vatena vā tapena vā brahmacariyena vā devo vā bhavissāmi devaññataro vā’’ti appaṭiladdhassa paṭilābhāya cittaṃ na paṇidahati, cetaso appaṇidhānappaccayā na tadabhinandati; na tadabhinandanto. Evampi nirāsatti anāgate."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atītaṃ nānusocatī"
      },
      "ti. Vipariṇataṃ vā vatthuṃ na socati, vipariṇatasmiṃ vā vatthusmiṃ na socati, ‘‘cakkhu me vipariṇata’’nti na socati, ‘‘sotaṃ me… ghānaṃ me… jivhā me… kāyo me… rūpā me… saddā me… gandhā me… rasā me… phoṭṭhabbā me… kulaṃ me… gaṇo me… āvāso me… lābho me… yaso me… pasaṃsā me… sukhaṃ me… cīvaraṃ me… piṇḍapāto me… senāsanaṃ me… gilānapaccayabhesajjaparikkhāro me… mātā me… pitā me… bhātā me… bhaginī me… putto me… dhītā me… mittā me… amaccā me… ñātakā me… sālohitā me vipariṇatā’’ti na socati na kilamati na paridevati na urattāḷiṃ kandati na sammohaṃ āpajjatīti – atītaṃ nānusocati."
    ],
    "innerText": "Atītaṃ nānusocatīti. Vipariṇataṃ vā vatthuṃ na socati, vipariṇatasmiṃ vā vatthusmiṃ na socati, ‘‘cakkhu me vipariṇata’’nti na socati, ‘‘sotaṃ me… ghānaṃ me… jivhā me… kāyo me… rūpā me… saddā me… gandhā me… rasā me… phoṭṭhabbā me… kulaṃ me… gaṇo me… āvāso me… lābho me… yaso me… pasaṃsā me… sukhaṃ me… cīvaraṃ me… piṇḍapāto me… senāsanaṃ me… gilānapaccayabhesajjaparikkhāro me… mātā me… pitā me… bhātā me… bhaginī me… putto me… dhītā me… mittā me… amaccā me… ñātakā me… sālohitā me vipariṇatā’’ti na socati na kilamati na paridevati na urattāḷiṃ kandati na sammohaṃ āpajjatīti – atītaṃ nānusocati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vivekadassī"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "phassesū"
      },
      "ti. Cakkhusamphasso sotasamphasso ghānasamphasso jivhāsamphasso kāyasamphasso manosamphasso, adhivacanasamphasso paṭighasamphasso, sukhavedanīyo phasso dukkhavedanīyo phasso adukkhamasukhavedanīyo phasso, kusalo phasso akusalo phasso abyākato ",
      " phasso, kāmāvacaro phasso rūpāvacaro phasso arūpāvacaro phasso, suññato phasso animitto phasso appaṇihito phasso, lokiyo phasso lokuttaro phasso, atīto phasso anāgato phasso paccuppanno phasso; yo evarūpo phasso phusanā samphusanā samphusitattaṃ – ayaṃ vuccati phasso."
    ],
    "innerText": "Vivekadassīphassesūti. Cakkhusamphasso sotasamphasso ghānasamphasso jivhāsamphasso kāyasamphasso manosamphasso, adhivacanasamphasso paṭighasamphasso, sukhavedanīyo phasso dukkhavedanīyo phasso adukkhamasukhavedanīyo phasso, kusalo phasso akusalo phasso abyākato phasso, kāmāvacaro phasso rūpāvacaro phasso arūpāvacaro phasso, suññato phasso animitto phasso appaṇihito phasso, lokiyo phasso lokuttaro phasso, atīto phasso anāgato phasso paccuppanno phasso; yo evarūpo phasso phusanā samphusanā samphusitattaṃ – ayaṃ vuccati phasso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vivekadassī phassesū"
      },
      "ti. Cakkhusamphassaṃ vivittaṃ passati attena vā attaniyena vā niccena vā dhuvena vā sassatena vā avipariṇāmadhammena vā, sotasamphassaṃ vivittaṃ ",
      " passati… ghānasamphassaṃ vivittaṃ passati… jivhāsamphassaṃ vivittaṃ passati… kāyasamphassaṃ vivittaṃ passati… manosamphassaṃ vivittaṃ passati… adhivacanasamphassaṃ vivittaṃ passati… paṭighasamphassaṃ vivittaṃ passati… sukhavedanīyaṃ phassaṃ… dukkhavedanīyaṃ phassaṃ… adukkhamasukhavedanīyaṃ phassaṃ… kusalaṃ phassaṃ… akusalaṃ phassaṃ… abyākataṃ phassaṃ… kāmāvacaraṃ phassaṃ… rūpāvacaraṃ phassaṃ… arūpāvacaraṃ phassaṃ… lokiyaṃ phassaṃ vivittaṃ passati attena vā attaniyena vā niccena vā dhuvena vā sassatena vā avipariṇāmadhammena vā."
    ],
    "innerText": "Vivekadassī phassesūti. Cakkhusamphassaṃ vivittaṃ passati attena vā attaniyena vā niccena vā dhuvena vā sassatena vā avipariṇāmadhammena vā, sotasamphassaṃ vivittaṃ passati… ghānasamphassaṃ vivittaṃ passati… jivhāsamphassaṃ vivittaṃ passati… kāyasamphassaṃ vivittaṃ passati… manosamphassaṃ vivittaṃ passati… adhivacanasamphassaṃ vivittaṃ passati… paṭighasamphassaṃ vivittaṃ passati… sukhavedanīyaṃ phassaṃ… dukkhavedanīyaṃ phassaṃ… adukkhamasukhavedanīyaṃ phassaṃ… kusalaṃ phassaṃ… akusalaṃ phassaṃ… abyākataṃ phassaṃ… kāmāvacaraṃ phassaṃ… rūpāvacaraṃ phassaṃ… arūpāvacaraṃ phassaṃ… lokiyaṃ phassaṃ vivittaṃ passati attena vā attaniyena vā niccena vā dhuvena vā sassatena vā avipariṇāmadhammena vā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha vā atītaṃ phassaṃ anāgatehi ca paccuppannehi ca phassehi ",
      " vivittaṃ passati, anāgataṃ phassaṃ atītehi ca paccuppannehi ca phassehi vivittaṃ passati, paccuppannaṃ phassaṃ atītehi ca anāgatehi ca phassehi vivittaṃ passati. Atha vā ye te phassā ariyā anāsavā lokuttarā suññatapaṭisaññuttā, te phasse vivitte passati rāgena dosena mohena kodhena upanāhena makkhena paḷāsena issāya macchariyena māyāya sāṭheyyena thambhena sārambhena mānena atimānena madena pamādena sabbakilesehi sabbaduccaritehi sabbadarathehi sabbapariḷāhehi sabbasantāpehi sabbākusalābhisaṅkhārehi vivitte passatīti – vivekadassī phassesu."
    ],
    "innerText": "Atha vā atītaṃ phassaṃ anāgatehi ca paccuppannehi ca phassehi vivittaṃ passati, anāgataṃ phassaṃ atītehi ca paccuppannehi ca phassehi vivittaṃ passati, paccuppannaṃ phassaṃ atītehi ca anāgatehi ca phassehi vivittaṃ passati. Atha vā ye te phassā ariyā anāsavā lokuttarā suññatapaṭisaññuttā, te phasse vivitte passati rāgena dosena mohena kodhena upanāhena makkhena paḷāsena issāya macchariyena māyāya sāṭheyyena thambhena sārambhena mānena atimānena madena pamādena sabbakilesehi sabbaduccaritehi sabbadarathehi sabbapariḷāhehi sabbasantāpehi sabbākusalābhisaṅkhārehi vivitte passatīti – vivekadassī phassesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Diṭṭhīsu ca na nīyatī"
      },
      "ti. Tassa dvāsaṭṭhi diṭṭhigatāni pahīnāni samucchinnāni vūpasantāni paṭipassaddhāni abhabbuppattikāni ñāṇagginā daḍḍhāni. So diṭṭhiyā na ",
      " yāyati na nīyati na vuyhati na saṃharīyati; napi taṃ diṭṭhigataṃ sārato pacceti na paccāgacchatīti – diṭṭhīsu ca na nīyati."
    ],
    "innerText": "Diṭṭhīsu ca na nīyatīti. Tassa dvāsaṭṭhi diṭṭhigatāni pahīnāni samucchinnāni vūpasantāni paṭipassaddhāni abhabbuppattikāni ñāṇagginā daḍḍhāni. So diṭṭhiyā na yāyati na nīyati na vuyhati na saṃharīyati; napi taṃ diṭṭhigataṃ sārato pacceti na paccāgacchatīti – diṭṭhīsu ca na nīyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tenāha ",
      " bhagavā –"
    ],
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Nirāsatti ",
      " anāgate, atītaṃ nānusocati;"
    ],
    "innerText": "‘‘Nirāsatti anāgate, atītaṃ nānusocati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vivekadassī phassesu, diṭṭhīsu ca na nīyatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "87"
      },
      "."
    ],
    "innerText": "87."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Patilīno akuhako, apihālu amaccharī;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Appagabbho ajeguccho, pesuṇeyye ca no yuto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Patilīno akuhako"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Patilīno"
      },
      "ti rāgassa pahīnattā patilīno, dosassa pahīnattā patilīno, mohassa pahīnattā patilīno, kodhassa… upanāhassa ",
      "… makkhassa… paḷāsassa… issāya… macchariyassa…pe… sabbākusalābhisaṅkhārānaṃ pahīnattā patilīno. Vuttañhetaṃ bhagavatā – ‘‘kathañca, bhikkhave, bhikkhu patilīno hoti? Imassa, bhikkhave, bhikkhuno asmimāno pahīno hoti ucchinnamūlo tālāvatthukato anabhāvaṃkato āyatiṃ anuppādadhammo. Evaṃ kho, bhikkhave, bhikkhu patilīno hotī’’ti – patilīno."
    ],
    "innerText": "Patilīno akuhakoti. Patilīnoti rāgassa pahīnattā patilīno, dosassa pahīnattā patilīno, mohassa pahīnattā patilīno, kodhassa… upanāhassa … makkhassa… paḷāsassa… issāya… macchariyassa…pe… sabbākusalābhisaṅkhārānaṃ pahīnattā patilīno. Vuttañhetaṃ bhagavatā – ‘‘kathañca, bhikkhave, bhikkhu patilīno hoti? Imassa, bhikkhave, bhikkhuno asmimāno pahīno hoti ucchinnamūlo tālāvatthukato anabhāvaṃkato āyatiṃ anuppādadhammo. Evaṃ kho, bhikkhave, bhikkhu patilīno hotī’’ti – patilīno."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akuhako"
      },
      "ti tīṇi kuhanavatthūni – paccayapaṭisevanasaṅkhātaṃ kuhanavatthu, iriyāpathasaṅkhātaṃ kuhanavatthu, sāmantajappanasaṅkhātaṃ kuhanavatthu."
    ],
    "innerText": "Akuhakoti tīṇi kuhanavatthūni – paccayapaṭisevanasaṅkhātaṃ kuhanavatthu, iriyāpathasaṅkhātaṃ kuhanavatthu, sāmantajappanasaṅkhātaṃ kuhanavatthu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katamaṃ paccayapaṭisevanasaṅkhātaṃ kuhanavatthu? Idha gahapatikā bhikkhuṃ nimantenti cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārehi. So pāpiccho icchāpakato atthiko cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārānaṃ bhiyyokamyataṃ upādāya cīvaraṃ paccakkhāti, piṇḍapātaṃ paccakkhāti, senāsanaṃ paccakkhāti, gilānapaccayabhesajjaparikkhāraṃ paccakkhāti. So evamāha – ‘‘kiṃ samaṇassa mahagghena cīvarena! Etaṃ sāruppaṃ yaṃ samaṇo susānā vā saṅkārakūṭā vā pāpaṇikā vā nantakāni uccinitvā saṅghāṭiṃ katvā dhāreyya. Kiṃ samaṇassa mahagghena piṇḍapātena ",
      "! Etaṃ sāruppaṃ yaṃ samaṇo uñchācariyāya piṇḍiyālopena jīvikaṃ kappeyya. Kiṃ samaṇassa mahagghena senāsanena! Etaṃ sāruppaṃ yaṃ samaṇo rukkhamūliko vā assa sosāniko vā abbhokāsiko ",
      " vā. Kiṃ samaṇassa mahagghena gilānapaccayabhesajjaparikkhārena! Etaṃ sāruppaṃ yaṃ samaṇo pūtimuttena vā haritakīkhaṇḍena vā osadhaṃ kareyyā’’ti. Tadupādāya lūkhaṃ cīvaraṃ dhāreti, lūkhaṃ piṇḍapātaṃ paribhuñjati, lūkhaṃ senāsanaṃ paṭisevati ",
      ", lūkhaṃ gilānapaccayabhesajjaparikkhāraṃ paṭisevati. Tamenaṃ gahapatikā evaṃ jānanti – ‘‘ayaṃ samaṇo appiccho santuṭṭho pavivitto asaṃsaṭṭho āraddhavīriyo ",
      " dhutavādo’’ti bhiyyo bhiyyo nimantenti cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārehi. So evamāha – ‘‘tiṇṇaṃ sammukhībhāvā saddho kulaputto bahuṃ puññaṃ pasavati. Saddhāya sammukhībhāvā saddho kulaputto bahuṃ puññaṃ pasavati, deyyadhammassa sammukhībhāvā saddho kulaputto bahuṃ puññaṃ pasavati, dakkhiṇeyyānaṃ sammukhībhāvā saddho kulaputto bahuṃ puññaṃ pasavati. ‘Tumhākañcevāyaṃ saddhā atthi, deyyadhammo ca saṃvijjati, ahañca paṭiggāhako. Sacehaṃ na paṭiggahessāmi, evaṃ tumhe puññena paribāhirā bhavissanti. Na mayhaṃ iminā attho. Api ca tumhākaṃyeva anukampāya paṭiggaṇhāmī’’’ti. Tadupādāya bahumpi cīvaraṃ paṭiggaṇhāti, bahumpi piṇḍapātaṃ paṭiggaṇhāti, bahumpi gilānapaccayabhesajjaparikkhāraṃ paṭiggaṇhāti. Yā evarūpā bhākuṭikā bhākuṭiyaṃ kuhanā kuhāyanā kuhitattaṃ – idaṃ paccayapaṭisevanasaṅkhātaṃ kuhanavatthu."
    ],
    "innerText": "Katamaṃ paccayapaṭisevanasaṅkhātaṃ kuhanavatthu? Idha gahapatikā bhikkhuṃ nimantenti cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārehi. So pāpiccho icchāpakato atthiko cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārānaṃ bhiyyokamyataṃ upādāya cīvaraṃ paccakkhāti, piṇḍapātaṃ paccakkhāti, senāsanaṃ paccakkhāti, gilānapaccayabhesajjaparikkhāraṃ paccakkhāti. So evamāha – ‘‘kiṃ samaṇassa mahagghena cīvarena! Etaṃ sāruppaṃ yaṃ samaṇo susānā vā saṅkārakūṭā vā pāpaṇikā vā nantakāni uccinitvā saṅghāṭiṃ katvā dhāreyya. Kiṃ samaṇassa mahagghena piṇḍapātena ! Etaṃ sāruppaṃ yaṃ samaṇo uñchācariyāya piṇḍiyālopena jīvikaṃ kappeyya. Kiṃ samaṇassa mahagghena senāsanena! Etaṃ sāruppaṃ yaṃ samaṇo rukkhamūliko vā assa sosāniko vā abbhokāsiko vā. Kiṃ samaṇassa mahagghena gilānapaccayabhesajjaparikkhārena! Etaṃ sāruppaṃ yaṃ samaṇo pūtimuttena vā haritakīkhaṇḍena vā osadhaṃ kareyyā’’ti. Tadupādāya lūkhaṃ cīvaraṃ dhāreti, lūkhaṃ piṇḍapātaṃ paribhuñjati, lūkhaṃ senāsanaṃ paṭisevati , lūkhaṃ gilānapaccayabhesajjaparikkhāraṃ paṭisevati. Tamenaṃ gahapatikā evaṃ jānanti – ‘‘ayaṃ samaṇo appiccho santuṭṭho pavivitto asaṃsaṭṭho āraddhavīriyo dhutavādo’’ti bhiyyo bhiyyo nimantenti cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārehi. So evamāha – ‘‘tiṇṇaṃ sammukhībhāvā saddho kulaputto bahuṃ puññaṃ pasavati. Saddhāya sammukhībhāvā saddho kulaputto bahuṃ puññaṃ pasavati, deyyadhammassa sammukhībhāvā saddho kulaputto bahuṃ puññaṃ pasavati, dakkhiṇeyyānaṃ sammukhībhāvā saddho kulaputto bahuṃ puññaṃ pasavati. ‘Tumhākañcevāyaṃ saddhā atthi, deyyadhammo ca saṃvijjati, ahañca paṭiggāhako. Sacehaṃ na paṭiggahessāmi, evaṃ tumhe puññena paribāhirā bhavissanti. Na mayhaṃ iminā attho. Api ca tumhākaṃyeva anukampāya paṭiggaṇhāmī’’’ti. Tadupādāya bahumpi cīvaraṃ paṭiggaṇhāti, bahumpi piṇḍapātaṃ paṭiggaṇhāti, bahumpi gilānapaccayabhesajjaparikkhāraṃ paṭiggaṇhāti. Yā evarūpā bhākuṭikā bhākuṭiyaṃ kuhanā kuhāyanā kuhitattaṃ – idaṃ paccayapaṭisevanasaṅkhātaṃ kuhanavatthu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katamaṃ ",
      " iriyāpathasaṅkhātaṃ kuhanavatthu? Idhekacco pāpiccho icchāpakato sambhāvanādhippāyo, ‘‘evaṃ maṃ jano sambhāvessatī’’ti, gamanaṃ saṇṭhapeti ṭhānaṃ saṇṭhapeti ",
      " nisajjaṃ saṇṭhapeti sayanaṃ saṇṭhapeti, paṇidhāya gacchati paṇidhāya tiṭṭhati paṇidhāya nisīdati paṇidhāya seyyaṃ kappeti, samāhito viya gacchati samāhito viya tiṭṭhati samāhito viya nisīdati samāhito viya seyyaṃ kappeti, āpāthakajjhāyīva hoti. Yā evarūpā iriyāpathassa ṭhapanā āṭhapanā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[aṭṭhapanā (sī.)]"
      },
      " saṇṭhapanā bhākuṭikā bhākuṭiyaṃ kuhanā kuhāyanā kuhitattaṃ – idaṃ iriyāpathasaṅkhātaṃ kuhanavatthu."
    ],
    "innerText": "Katamaṃ iriyāpathasaṅkhātaṃ kuhanavatthu? Idhekacco pāpiccho icchāpakato sambhāvanādhippāyo, ‘‘evaṃ maṃ jano sambhāvessatī’’ti, gamanaṃ saṇṭhapeti ṭhānaṃ saṇṭhapeti nisajjaṃ saṇṭhapeti sayanaṃ saṇṭhapeti, paṇidhāya gacchati paṇidhāya tiṭṭhati paṇidhāya nisīdati paṇidhāya seyyaṃ kappeti, samāhito viya gacchati samāhito viya tiṭṭhati samāhito viya nisīdati samāhito viya seyyaṃ kappeti, āpāthakajjhāyīva hoti. Yā evarūpā iriyāpathassa ṭhapanā āṭhapanā [aṭṭhapanā (sī.)] saṇṭhapanā bhākuṭikā bhākuṭiyaṃ kuhanā kuhāyanā kuhitattaṃ – idaṃ iriyāpathasaṅkhātaṃ kuhanavatthu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katamaṃ sāmantajappanasaṅkhātaṃ kuhanavatthu? Idhekacco pāpiccho icchāpakato sambhāvanādhippāyo, ‘‘evaṃ maṃ jano sambhāvessatī’’ti, ariyadhammasannissitaṃ vācaṃ bhāsati. ‘‘Yo evarūpaṃ cīvaraṃ dhāreti so samaṇo mahesakkho’’ti bhaṇati; ‘‘yo evarūpaṃ pattaṃ dhāreti… lohathālakaṃ dhāreti… dhammakaraṇaṃ dhāreti… parisāvanaṃ dhāreti… kuñcikaṃ dhāreti… upāhanaṃ dhāreti… kāyabandhanaṃ dhāreti… āyogaṃ dhāreti so samaṇo ",
      " mahesakkho’’ti bhaṇati; ‘‘yassa evarūpo upajjhāyo so samaṇo mahesakkho’’ti bhaṇati; ‘‘yassa evarūpo ācariyo… evarūpā samānupajjhāyakā… samānācariyakā… mittā… sandiṭṭhā… sambhattā… sahāyā so samaṇo mahesakkho’’ti bhaṇati; ‘‘yo evarūpe vihāre vasati so samaṇo mahesakkho’’ti bhaṇati; ‘‘yo evarūpe ",
      " aḍḍhayoge vasati… pāsāde vasati… hammiye vasati… guhāyaṃ vasati… leṇe vasati… kuṭiyā vasati… kūṭāgāre vasati… aṭṭe vasati ",
      "… māḷe vasati… uddaṇḍe vasati… upaṭṭhānasālāyaṃ vasati… maṇḍape vasati… rukkhamūle vasati, so samaṇo mahesakkho’’ti bhaṇati."
    ],
    "innerText": "Katamaṃ sāmantajappanasaṅkhātaṃ kuhanavatthu? Idhekacco pāpiccho icchāpakato sambhāvanādhippāyo, ‘‘evaṃ maṃ jano sambhāvessatī’’ti, ariyadhammasannissitaṃ vācaṃ bhāsati. ‘‘Yo evarūpaṃ cīvaraṃ dhāreti so samaṇo mahesakkho’’ti bhaṇati; ‘‘yo evarūpaṃ pattaṃ dhāreti… lohathālakaṃ dhāreti… dhammakaraṇaṃ dhāreti… parisāvanaṃ dhāreti… kuñcikaṃ dhāreti… upāhanaṃ dhāreti… kāyabandhanaṃ dhāreti… āyogaṃ dhāreti so samaṇo mahesakkho’’ti bhaṇati; ‘‘yassa evarūpo upajjhāyo so samaṇo mahesakkho’’ti bhaṇati; ‘‘yassa evarūpo ācariyo… evarūpā samānupajjhāyakā… samānācariyakā… mittā… sandiṭṭhā… sambhattā… sahāyā so samaṇo mahesakkho’’ti bhaṇati; ‘‘yo evarūpe vihāre vasati so samaṇo mahesakkho’’ti bhaṇati; ‘‘yo evarūpe aḍḍhayoge vasati… pāsāde vasati… hammiye vasati… guhāyaṃ vasati… leṇe vasati… kuṭiyā vasati… kūṭāgāre vasati… aṭṭe vasati … māḷe vasati… uddaṇḍe vasati… upaṭṭhānasālāyaṃ vasati… maṇḍape vasati… rukkhamūle vasati, so samaṇo mahesakkho’’ti bhaṇati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha vā korajikakorajiko ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[korañjikakorañjiko (sī.)]"
      },
      " bhākuṭikabhākuṭiko kuhakakuhako lapakalapako mukhasambhāviko, ‘‘ayaṃ samaṇo imāsaṃ evarūpānaṃ santānaṃ vihārasamāpattīnaṃ lābhī’’ti tādisaṃ gambhīraṃ gūḷhaṃ nipuṇaṃ paṭicchannaṃ lokuttaraṃ suññatāpaṭisaṃyuttaṃ ",
      " kathaṃ kathesi. Yā evarūpā bhākuṭikā bhākuṭiyaṃ kuhanā kuhāyanā kuhitattaṃ – idaṃ sāmantajappanasaṅkhātaṃ kuhanavatthu. Yassimāni tīṇi kuhanavatthūni pahīnāni samucchinnāni vūpasantāni paṭipassaddhāni abhabbuppattikāni ñāṇagginā daḍḍhāni, so vuccati akuhakoti – patilīno akuhako."
    ],
    "innerText": "Atha vā korajikakorajiko [korañjikakorañjiko (sī.)] bhākuṭikabhākuṭiko kuhakakuhako lapakalapako mukhasambhāviko, ‘‘ayaṃ samaṇo imāsaṃ evarūpānaṃ santānaṃ vihārasamāpattīnaṃ lābhī’’ti tādisaṃ gambhīraṃ gūḷhaṃ nipuṇaṃ paṭicchannaṃ lokuttaraṃ suññatāpaṭisaṃyuttaṃ kathaṃ kathesi. Yā evarūpā bhākuṭikā bhākuṭiyaṃ kuhanā kuhāyanā kuhitattaṃ – idaṃ sāmantajappanasaṅkhātaṃ kuhanavatthu. Yassimāni tīṇi kuhanavatthūni pahīnāni samucchinnāni vūpasantāni paṭipassaddhāni abhabbuppattikāni ñāṇagginā daḍḍhāni, so vuccati akuhakoti – patilīno akuhako."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Apihālu amaccharī"
      },
      "ti. Pihā vuccati taṇhā. Yo rāgo sārāgo…pe… abhijjhā lobho akusalamūlaṃ. Yassesā pihā taṇhā pahīnā samucchinnā vūpasantā paṭipassaddhā abhabbuppattikā ñāṇagginā daḍḍhā, so vuccati apihālu. So rūpe na piheti, sadde… gandhe… rase… phoṭṭhabbe… kulaṃ… gaṇaṃ… āvāsaṃ… lābhaṃ… yasaṃ… pasaṃsaṃ… sukhaṃ… cīvaraṃ… piṇḍapātaṃ… senāsanaṃ… gilānapaccayabhesajjaparikkhāraṃ… kāmadhātuṃ… rūpadhātuṃ… arūpadhātuṃ… kāmabhavaṃ… rūpabhavaṃ… arūpabhavaṃ… saññābhavaṃ… asaññābhavaṃ ",
      "… nevasaññānāsaññābhavaṃ… ekavokārabhavaṃ… catuvokārabhavaṃ… pañcavokārabhavaṃ… atītaṃ… anāgataṃ… paccuppannaṃ… diṭṭhasutamutaviññātabbe dhamme na piheti na icchati na sādiyati na pattheti nābhijappatīti – apihālu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Amaccharī"
      },
      "ti pañca macchariyāni – āvāsamacchariyaṃ, kulamacchariyaṃ, lābhamacchariyaṃ, vaṇṇamacchariyaṃ, dhammamacchariyaṃ. Yaṃ evarūpaṃ maccharaṃ maccharāyanā maccharāyitattaṃ vevicchaṃ kadariyaṃ kaṭukañcukatā ",
      " aggahitattaṃ cittassa – idaṃ vuccati macchariyaṃ. Api ca khandhamacchariyampi macchariyaṃ, dhātumacchariyampi macchariyaṃ, āyatanamacchariyampi macchariyaṃ gāho – idaṃ vuccati macchariyaṃ. Yassetaṃ macchariyaṃ pahīnaṃ samucchinnaṃ vūpasantaṃ paṭipassaddhaṃ abhabbuppattikaṃ ñāṇagginā daḍḍhaṃ, so vuccati amaccharīti – apihālu amaccharī."
    ],
    "innerText": "Apihālu amaccharīti. Pihā vuccati taṇhā. Yo rāgo sārāgo…pe… abhijjhā lobho akusalamūlaṃ. Yassesā pihā taṇhā pahīnā samucchinnā vūpasantā paṭipassaddhā abhabbuppattikā ñāṇagginā daḍḍhā, so vuccati apihālu. So rūpe na piheti, sadde… gandhe… rase… phoṭṭhabbe… kulaṃ… gaṇaṃ… āvāsaṃ… lābhaṃ… yasaṃ… pasaṃsaṃ… sukhaṃ… cīvaraṃ… piṇḍapātaṃ… senāsanaṃ… gilānapaccayabhesajjaparikkhāraṃ… kāmadhātuṃ… rūpadhātuṃ… arūpadhātuṃ… kāmabhavaṃ… rūpabhavaṃ… arūpabhavaṃ… saññābhavaṃ… asaññābhavaṃ … nevasaññānāsaññābhavaṃ… ekavokārabhavaṃ… catuvokārabhavaṃ… pañcavokārabhavaṃ… atītaṃ… anāgataṃ… paccuppannaṃ… diṭṭhasutamutaviññātabbe dhamme na piheti na icchati na sādiyati na pattheti nābhijappatīti – apihālu. Amaccharīti pañca macchariyāni – āvāsamacchariyaṃ, kulamacchariyaṃ, lābhamacchariyaṃ, vaṇṇamacchariyaṃ, dhammamacchariyaṃ. Yaṃ evarūpaṃ maccharaṃ maccharāyanā maccharāyitattaṃ vevicchaṃ kadariyaṃ kaṭukañcukatā aggahitattaṃ cittassa – idaṃ vuccati macchariyaṃ. Api ca khandhamacchariyampi macchariyaṃ, dhātumacchariyampi macchariyaṃ, āyatanamacchariyampi macchariyaṃ gāho – idaṃ vuccati macchariyaṃ. Yassetaṃ macchariyaṃ pahīnaṃ samucchinnaṃ vūpasantaṃ paṭipassaddhaṃ abhabbuppattikaṃ ñāṇagginā daḍḍhaṃ, so vuccati amaccharīti – apihālu amaccharī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appagabbho"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ajeguccho"
      },
      "ti. Pāgabbhiyanti tīṇi pāgabbhiyāni – kāyikaṃ pāgabbhiyaṃ, vācasikaṃ pāgabbhiyaṃ, cetasikaṃ pāgabbhiyaṃ. Katamaṃ kāyikaṃ pāgabbhiyaṃ? Idhekacco saṅghagatopi kāyikaṃ pāgabbhiyaṃ dasseti, gaṇagatopi kāyikaṃ pāgabbhiyaṃ dasseti, bhojanasālāyampi ",
      " kāyikaṃ pāgabbhiyaṃ dasseti, jantāgharepi kāyikaṃ pāgabbhiyaṃ dasseti, udakatitthepi kāyikaṃ pāgabbhiyaṃ dasseti, antaragharaṃ pavisantopi kāyikaṃ pāgabbhiyaṃ dasseti, antaragharaṃ paviṭṭhopi kāyikaṃ pāgabbhiyaṃ dasseti."
    ],
    "innerText": "Appagabbhoajegucchoti. Pāgabbhiyanti tīṇi pāgabbhiyāni – kāyikaṃ pāgabbhiyaṃ, vācasikaṃ pāgabbhiyaṃ, cetasikaṃ pāgabbhiyaṃ. Katamaṃ kāyikaṃ pāgabbhiyaṃ? Idhekacco saṅghagatopi kāyikaṃ pāgabbhiyaṃ dasseti, gaṇagatopi kāyikaṃ pāgabbhiyaṃ dasseti, bhojanasālāyampi kāyikaṃ pāgabbhiyaṃ dasseti, jantāgharepi kāyikaṃ pāgabbhiyaṃ dasseti, udakatitthepi kāyikaṃ pāgabbhiyaṃ dasseti, antaragharaṃ pavisantopi kāyikaṃ pāgabbhiyaṃ dasseti, antaragharaṃ paviṭṭhopi kāyikaṃ pāgabbhiyaṃ dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ saṅghagato kāyikaṃ pāgabbhiyaṃ dasseti? Idhekacco saṅghagato acittīkārakato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[acittikārakato (syā. ka.)]"
      },
      " there bhikkhū ghaṭṭayantopi tiṭṭhati, ghaṭṭayantopi nisīdati, puratopi tiṭṭhati, puratopi nisīdati, uccepi āsane nisīdati, sasīsaṃ pārupitvāpi nisīdati, ṭhitakopi bhaṇati, bāhāvikkhepakopi bhaṇati. Evaṃ saṅghagato kāyikaṃ pāgabbhiyaṃ dasseti."
    ],
    "innerText": "Kathaṃ saṅghagato kāyikaṃ pāgabbhiyaṃ dasseti? Idhekacco saṅghagato acittīkārakato [acittikārakato (syā. ka.)] there bhikkhū ghaṭṭayantopi tiṭṭhati, ghaṭṭayantopi nisīdati, puratopi tiṭṭhati, puratopi nisīdati, uccepi āsane nisīdati, sasīsaṃ pārupitvāpi nisīdati, ṭhitakopi bhaṇati, bāhāvikkhepakopi bhaṇati. Evaṃ saṅghagato kāyikaṃ pāgabbhiyaṃ dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kathaṃ gaṇagato kāyikaṃ pāgabbhiyaṃ dasseti? Idhekacco gaṇagato acittīkārakato therānaṃ bhikkhūnaṃ anupāhanānaṃ caṅkamantānaṃ saupāhano caṅkamati, nīce caṅkame caṅkamantānaṃ ucce caṅkame caṅkamati, chamāya caṅkamantānaṃ caṅkame caṅkamati, ghaṭṭayantopi tiṭṭhati, ghaṭṭayantopi nisīdati, puratopi tiṭṭhati, puratopi nisīdati, uccepi āsane nisīdati, sasīsaṃ pārupitvā nisīdati, ṭhitakopi bhaṇati, bāhāvikkhepakopi bhaṇati. Evaṃ gaṇagato kāyikaṃ pāgabbhiyaṃ dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ bhojanasālāyaṃ kāyikaṃ pāgabbhiyaṃ dasseti? Idhekacco bhojanasālāyaṃ acittīkārakato there bhikkhū anupakhajja nisīdati, navepi bhikkhū āsanena paṭibāhati, ghaṭṭayantopi tiṭṭhati, ghaṭṭayantopi nisīdati, puratopi tiṭṭhati, puratopi nisīdati, uccepi āsane nisīdati, sasīsaṃ pārupitvāpi nisīdati, ṭhitakopi bhaṇati, bāhāvikkhepakopi ",
      " bhaṇati. Evaṃ bhojanasālāyaṃ kāyikaṃ pāgabbhiyaṃ dasseti."
    ],
    "innerText": "Kathaṃ bhojanasālāyaṃ kāyikaṃ pāgabbhiyaṃ dasseti? Idhekacco bhojanasālāyaṃ acittīkārakato there bhikkhū anupakhajja nisīdati, navepi bhikkhū āsanena paṭibāhati, ghaṭṭayantopi tiṭṭhati, ghaṭṭayantopi nisīdati, puratopi tiṭṭhati, puratopi nisīdati, uccepi āsane nisīdati, sasīsaṃ pārupitvāpi nisīdati, ṭhitakopi bhaṇati, bāhāvikkhepakopi bhaṇati. Evaṃ bhojanasālāyaṃ kāyikaṃ pāgabbhiyaṃ dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ ",
      " jantāghare kāyikaṃ pāgabbhiyaṃ dasseti? Idhekacco jantāghare acittīkārakato there bhikkhū ghaṭṭayantopi tiṭṭhati, ghaṭṭayantopi nisīdati, puratopi tiṭṭhati, puratopi nisīdati, uccepi āsane nisīdati ",
      ", anāpucchampi anajjhiṭṭhopi kaṭṭhaṃ pakkhipati, dvārampi pidahati, bāhāvikkhepakopi bhaṇati. Evaṃ jantāghare kāyikaṃ pāgabbhiyaṃ dasseti."
    ],
    "innerText": "Kathaṃ jantāghare kāyikaṃ pāgabbhiyaṃ dasseti? Idhekacco jantāghare acittīkārakato there bhikkhū ghaṭṭayantopi tiṭṭhati, ghaṭṭayantopi nisīdati, puratopi tiṭṭhati, puratopi nisīdati, uccepi āsane nisīdati , anāpucchampi anajjhiṭṭhopi kaṭṭhaṃ pakkhipati, dvārampi pidahati, bāhāvikkhepakopi bhaṇati. Evaṃ jantāghare kāyikaṃ pāgabbhiyaṃ dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ udakatitthe kāyikaṃ pāgabbhiyaṃ dasseti? Idhekacco udakatitthe acittīkārakato there bhikkhū ghaṭṭayantopi otarati, puratopi otarati, ghaṭṭayantopi nhāyati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[nahāyati (sī.)]"
      },
      ", puratopi nhāyati ",
      ", uparitopi nhāyati, ghaṭṭayantopi uttarati, puratopi uttarati, uparitopi uttarati. Evaṃ udakatitthe kāyikaṃ pāgabbhiyaṃ dasseti."
    ],
    "innerText": "Kathaṃ udakatitthe kāyikaṃ pāgabbhiyaṃ dasseti? Idhekacco udakatitthe acittīkārakato there bhikkhū ghaṭṭayantopi otarati, puratopi otarati, ghaṭṭayantopi nhāyati [nahāyati (sī.)], puratopi nhāyati , uparitopi nhāyati, ghaṭṭayantopi uttarati, puratopi uttarati, uparitopi uttarati. Evaṃ udakatitthe kāyikaṃ pāgabbhiyaṃ dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kathaṃ antaragharaṃ pavisanto kāyikaṃ pāgabbhiyaṃ dasseti? Idhekacco antaragharaṃ pavisanto acittīkārakato there bhikkhū ghaṭṭayantopi gacchati, puratopi gacchati, vokkammāpi therānaṃ bhikkhūnaṃ purato purato gacchati. Evaṃ antaragharaṃ pavisanto kāyikaṃ pāgabbhiyaṃ dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ antaragharaṃ paviṭṭho kāyikaṃ pāgabbhiyaṃ dasseti? Idhekacco antaragharaṃ paviṭṭho, ‘‘na pavisa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pavisatha (sī.) evamaññesu padadvayesupi]"
      },
      ", bhante’’ti vuccamāno pavisati, ‘‘na tiṭṭha, bhante’’ti vuccamāno tiṭṭhati, ‘‘na nisīda, bhante’’ti vuccamāno nisīdati, anokāsampi pavisati, anokāsepi tiṭṭhati, anokāsepi nisīdati, yānipi tāni honti kulānaṃ ovarakāni gūḷhāni ca paṭicchannāni ca. Yattha kulitthiyo kuladhītaro kulasuṇhāyo kulakumāriyo nisīdanti, tatthapi sahasā pavisati kumārakassapi siraṃ parāmasati. Evaṃ antaragharaṃ paviṭṭho kāyikaṃ pāgabbhiyaṃ dasseti – idaṃ kāyikaṃ pāgabbhiyaṃ dasseti."
    ],
    "innerText": "Kathaṃ antaragharaṃ paviṭṭho kāyikaṃ pāgabbhiyaṃ dasseti? Idhekacco antaragharaṃ paviṭṭho, ‘‘na pavisa [pavisatha (sī.) evamaññesu padadvayesupi], bhante’’ti vuccamāno pavisati, ‘‘na tiṭṭha, bhante’’ti vuccamāno tiṭṭhati, ‘‘na nisīda, bhante’’ti vuccamāno nisīdati, anokāsampi pavisati, anokāsepi tiṭṭhati, anokāsepi nisīdati, yānipi tāni honti kulānaṃ ovarakāni gūḷhāni ca paṭicchannāni ca. Yattha kulitthiyo kuladhītaro kulasuṇhāyo kulakumāriyo nisīdanti, tatthapi sahasā pavisati kumārakassapi siraṃ parāmasati. Evaṃ antaragharaṃ paviṭṭho kāyikaṃ pāgabbhiyaṃ dasseti – idaṃ kāyikaṃ pāgabbhiyaṃ dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katamaṃ ",
      " vācasikaṃ pāgabbhiyaṃ dasseti? Idhekacco saṅghagatopi vācasikaṃ pāgabbhiyaṃ ",
      " dasseti, gaṇagatopi vācasikaṃ pāgabbhiyaṃ dasseti, antaragharaṃ paviṭṭhopi vācasikaṃ pāgabbhiyaṃ dasseti."
    ],
    "innerText": "Katamaṃ vācasikaṃ pāgabbhiyaṃ dasseti? Idhekacco saṅghagatopi vācasikaṃ pāgabbhiyaṃ dasseti, gaṇagatopi vācasikaṃ pāgabbhiyaṃ dasseti, antaragharaṃ paviṭṭhopi vācasikaṃ pāgabbhiyaṃ dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ ",
      " saṅghagato vācasikaṃ pāgabbhiyaṃ dasseti? Idhekacco saṅghagato acittīkārakato there bhikkhū anāpucchaṃ vā anajjhiṭṭho vā ārāmagatānaṃ bhikkhūnaṃ dhammaṃ bhaṇati, pañhaṃ visajjeti, pātimokkhaṃ uddisati, ṭhitakopi bhaṇati, bāhāvikkhepakopi bhaṇati. Evaṃ saṅghagato vācasikaṃ pāgabbhiyaṃ dasseti."
    ],
    "innerText": "Kathaṃ saṅghagato vācasikaṃ pāgabbhiyaṃ dasseti? Idhekacco saṅghagato acittīkārakato there bhikkhū anāpucchaṃ vā anajjhiṭṭho vā ārāmagatānaṃ bhikkhūnaṃ dhammaṃ bhaṇati, pañhaṃ visajjeti, pātimokkhaṃ uddisati, ṭhitakopi bhaṇati, bāhāvikkhepakopi bhaṇati. Evaṃ saṅghagato vācasikaṃ pāgabbhiyaṃ dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kathaṃ gaṇagato vācasikaṃ pāgabbhiyaṃ dasseti? Idhekacco gaṇagato acittīkārakato there bhikkhū anāpucchaṃ vā anajjhiṭṭho vā ārāmagatānaṃ bhikkhūnaṃ dhammaṃ bhaṇati, pañhaṃ visajjeti, ṭhitakopi bhaṇati, bāhāvikkhepakopi bhaṇati. Ārāmagatānaṃ bhikkhunīnaṃ upāsakānaṃ upāsikānaṃ dhammaṃ bhaṇati, pañhaṃ visajjeti, ṭhitakopi bhaṇati, bāhāvikkhepakopi bhaṇati. Evaṃ gaṇagato vācasikaṃ pāgabbhiyaṃ dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ ",
      " antaragharaṃ paviṭṭho vācasikaṃ pāgabbhiyaṃ dasseti? Idhekacco antaragharaṃ paviṭṭho itthiṃ vā kumāriṃ vā evamāha – ‘‘itthaṃnāme itthaṃgotte kiṃ atthi? Yāgu atthi, bhattaṃ atthi, khādanīyaṃ atthi. Kiṃ pivissāma, kiṃ bhuñjissāma, kiṃ khādissāma? Kiṃ vā atthi, kiṃ vā me dassathā’’ti vippalapati, yā evarūpā vācā palāpo vippalāpo lālappo lālappanā lālappitattaṃ. Evaṃ antaragharaṃ paviṭṭho vācasikaṃ pāgabbhiyaṃ dasseti – idaṃ vācasikaṃ pāgabbhiyaṃ."
    ],
    "innerText": "Kathaṃ antaragharaṃ paviṭṭho vācasikaṃ pāgabbhiyaṃ dasseti? Idhekacco antaragharaṃ paviṭṭho itthiṃ vā kumāriṃ vā evamāha – ‘‘itthaṃnāme itthaṃgotte kiṃ atthi? Yāgu atthi, bhattaṃ atthi, khādanīyaṃ atthi. Kiṃ pivissāma, kiṃ bhuñjissāma, kiṃ khādissāma? Kiṃ vā atthi, kiṃ vā me dassathā’’ti vippalapati, yā evarūpā vācā palāpo vippalāpo lālappo lālappanā lālappitattaṃ. Evaṃ antaragharaṃ paviṭṭho vācasikaṃ pāgabbhiyaṃ dasseti – idaṃ vācasikaṃ pāgabbhiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katamaṃ ",
      " cetasikaṃ pāgabbhiyaṃ? Idhekacco na uccā kulā pabbajito samāno uccā kulā pabbajitena saddhiṃ sadisaṃ attānaṃ dahati cittena, na mahākulā pabbajito samāno mahākulā pabbajitena saddhiṃ sadisaṃ attānaṃ dahati cittena, na mahābhogakulā pabbajito samāno mahābhogakulā pabbajitena saddhiṃ sadisaṃ attānaṃ dahati ",
      " cittena, na uḷārabhogakulā pabbajito samāno… na suttantiko samāno suttantikena saddhiṃ sadisaṃ attānaṃ dahati cittena, na vinayadharo samāno… na dhammakathiko samāno… na āraññiko samāno… na piṇḍapātiko samāno… na paṃsukūliko samāno… na tecīvariko samāno… na sapadānacāriko samāno… na khalupacchābhattiko samāno… na nesajjiko samāno… na yathāsanthatiko samāno… na paṭhamassa jhānassa lābhī samāno paṭhamassa jhānassa lābhinā saddhiṃ sadisaṃ attānaṃ dahati cittena…pe… na nevasaññānāsaññāyatanasamāpattiyā lābhī ",
      " samāno nevasaññānāsaññāyatanasamāpattiyā lābhinā saddhiṃ sadisaṃ attānaṃ dahati cittena – idaṃ cetasikaṃ pāgabbhiyaṃ. Yassimāni tīṇi pāgabbhiyāni pahīnāni samucchinnāni vūpasantāni paṭipassaddhāni abhabbuppattikāni ñāṇagginā daḍḍhāni, so vuccati appagabbhoti – appagabbho."
    ],
    "innerText": "Katamaṃ cetasikaṃ pāgabbhiyaṃ? Idhekacco na uccā kulā pabbajito samāno uccā kulā pabbajitena saddhiṃ sadisaṃ attānaṃ dahati cittena, na mahākulā pabbajito samāno mahākulā pabbajitena saddhiṃ sadisaṃ attānaṃ dahati cittena, na mahābhogakulā pabbajito samāno mahābhogakulā pabbajitena saddhiṃ sadisaṃ attānaṃ dahati cittena, na uḷārabhogakulā pabbajito samāno… na suttantiko samāno suttantikena saddhiṃ sadisaṃ attānaṃ dahati cittena, na vinayadharo samāno… na dhammakathiko samāno… na āraññiko samāno… na piṇḍapātiko samāno… na paṃsukūliko samāno… na tecīvariko samāno… na sapadānacāriko samāno… na khalupacchābhattiko samāno… na nesajjiko samāno… na yathāsanthatiko samāno… na paṭhamassa jhānassa lābhī samāno paṭhamassa jhānassa lābhinā saddhiṃ sadisaṃ attānaṃ dahati cittena…pe… na nevasaññānāsaññāyatanasamāpattiyā lābhī samāno nevasaññānāsaññāyatanasamāpattiyā lābhinā saddhiṃ sadisaṃ attānaṃ dahati cittena – idaṃ cetasikaṃ pāgabbhiyaṃ. Yassimāni tīṇi pāgabbhiyāni pahīnāni samucchinnāni vūpasantāni paṭipassaddhāni abhabbuppattikāni ñāṇagginā daḍḍhāni, so vuccati appagabbhoti – appagabbho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ajeguccho"
      },
      "ti ",
      ". Atthi puggalo jeguccho, atthi ajeguccho. Katamo ca puggalo jeguccho? Idhekacco puggalo dussīlo hoti pāpadhammo asucisaṅkassarasamācāro paṭicchannakammanto assamaṇo samaṇapaṭiñño abrahmacārī brahmacāripaṭiñño antopūti avassuto kasambujāto – ayaṃ vuccati puggalo jeguccho. Atha vā kodhano hoti upāyāsabahulo, appampi vutto samāno abhisajjati kuppati byāpajjati patiṭṭhīyati, kopañca dosañca appaccayañca pātukaroti – ayaṃ vuccati puggalo jeguccho. Atha vā kodhano hoti upanāhī, makkhī hoti paḷāsī, issukī hoti maccharī, saṭho hoti māyāvī ",
      ", thaddho hoti atimānī, pāpiccho hoti micchādiṭṭhi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[micchādiṭṭhī (sī.)]"
      },
      ", sandiṭṭhiparāmāsī hoti ādānaggāhī duppaṭinissaggī – ayaṃ vuccati puggalo jeguccho."
    ],
    "innerText": "Ajegucchoti . Atthi puggalo jeguccho, atthi ajeguccho. Katamo ca puggalo jeguccho? Idhekacco puggalo dussīlo hoti pāpadhammo asucisaṅkassarasamācāro paṭicchannakammanto assamaṇo samaṇapaṭiñño abrahmacārī brahmacāripaṭiñño antopūti avassuto kasambujāto – ayaṃ vuccati puggalo jeguccho. Atha vā kodhano hoti upāyāsabahulo, appampi vutto samāno abhisajjati kuppati byāpajjati patiṭṭhīyati, kopañca dosañca appaccayañca pātukaroti – ayaṃ vuccati puggalo jeguccho. Atha vā kodhano hoti upanāhī, makkhī hoti paḷāsī, issukī hoti maccharī, saṭho hoti māyāvī , thaddho hoti atimānī, pāpiccho hoti micchādiṭṭhi [micchādiṭṭhī (sī.)], sandiṭṭhiparāmāsī hoti ādānaggāhī duppaṭinissaggī – ayaṃ vuccati puggalo jeguccho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katamo ca puggalo ajeguccho? Idha bhikkhu sīlavā hoti pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno ",
      " aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu – ayaṃ vuccati puggalo ajeguccho. Atha vā akkodhano hoti anupāyāsabahulo, bahumpi vutto samāno na abhisajjati na kuppati na byāpajjati na patiṭṭhīyati, na kopañca dosañca appaccayañca pātukaroti – ayaṃ vuccati puggalo ajeguccho. Atha vā akkodhano hoti anupanāhī, amakkhī hoti apaḷāsī, anissukī hoti amaccharī, asaṭho hoti amāyāvī, athaddho hoti anatimānī ",
      ", na pāpiccho hoti na micchādiṭṭhi, asandiṭṭhiparāmāsī hoti anādānaggāhī suppaṭinissaggī – ayaṃ vuccati puggalo ajeguccho. Sabbe bālaputhujjanā jegucchā, puthujjanakalyāṇakaṃ upādāya aṭṭha ariyapuggalā ajegucchāti – appagabbho ajeguccho."
    ],
    "innerText": "Katamo ca puggalo ajeguccho? Idha bhikkhu sīlavā hoti pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu – ayaṃ vuccati puggalo ajeguccho. Atha vā akkodhano hoti anupāyāsabahulo, bahumpi vutto samāno na abhisajjati na kuppati na byāpajjati na patiṭṭhīyati, na kopañca dosañca appaccayañca pātukaroti – ayaṃ vuccati puggalo ajeguccho. Atha vā akkodhano hoti anupanāhī, amakkhī hoti apaḷāsī, anissukī hoti amaccharī, asaṭho hoti amāyāvī, athaddho hoti anatimānī , na pāpiccho hoti na micchādiṭṭhi, asandiṭṭhiparāmāsī hoti anādānaggāhī suppaṭinissaggī – ayaṃ vuccati puggalo ajeguccho. Sabbe bālaputhujjanā jegucchā, puthujjanakalyāṇakaṃ upādāya aṭṭha ariyapuggalā ajegucchāti – appagabbho ajeguccho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pesuṇeyye ca no yuto"
      },
      "ti. Pesuññanti idhekacco pisuṇavāco hoti, ito sutvā amutra akkhātā imesaṃ bhedāya, amutra vā sutvā ",
      " imesaṃ akkhātā amūsaṃ bhedāya. Iti samaggānaṃ vā bhettā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[bhedo (ka.)]"
      },
      ", bhinnānaṃ vā anuppadātā, vaggārāmo, vaggarato, vagganandī, vaggakaraṇiṃ vācaṃ bhāsitā hoti – idaṃ vuccati pesuññaṃ."
    ],
    "innerText": "Pesuṇeyye ca no yutoti. Pesuññanti idhekacco pisuṇavāco hoti, ito sutvā amutra akkhātā imesaṃ bhedāya, amutra vā sutvā imesaṃ akkhātā amūsaṃ bhedāya. Iti samaggānaṃ vā bhettā [bhedo (ka.)], bhinnānaṃ vā anuppadātā, vaggārāmo, vaggarato, vagganandī, vaggakaraṇiṃ vācaṃ bhāsitā hoti – idaṃ vuccati pesuññaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Api ca dvīhi kāraṇehi pesuññaṃ upasaṃharati – piyakamyatāya vā, bhedādhippāyena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[bhedādhippāyo (bahūsu)]"
      },
      " vā. Kathaṃ piyakamyatāya pesuññaṃ upasaṃharati? Imassa piyo bhavissāmi, manāpo bhavissāmi, vissāsiko bhavissāmi, abbhantariko bhavissāmi, suhadayo bhavissāmīti. Evaṃ piyakamyatāya pesuññaṃ upasaṃharati. Kathaṃ bhedādhippāyena pesuññaṃ upasaṃharati? ‘‘Kathaṃ ime nānā assu vinā assu vaggā assu dvedhā assu dvejjhā assu dve pakkhā assu bhijjeyyuṃ na samāgaccheyyuṃ dukkhaṃ na phāsu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[aphāsuṃ (sī.)]"
      },
      " vihareyyu’’nti. Evaṃ ",
      " bhedādhippāyena pesuññaṃ upasaṃharati. Yassetaṃ pesuññaṃ pahīnaṃ samucchinnaṃ vūpasantaṃ paṭipassaddhaṃ abhabbuppattikaṃ ñāṇagginā daḍḍhaṃ, so pesuññe no yuto na yutto na ",
      " payutto na sammāyuttoti – pesuṇeyye ca no yuto."
    ],
    "innerText": "Api ca dvīhi kāraṇehi pesuññaṃ upasaṃharati – piyakamyatāya vā, bhedādhippāyena [bhedādhippāyo (bahūsu)] vā. Kathaṃ piyakamyatāya pesuññaṃ upasaṃharati? Imassa piyo bhavissāmi, manāpo bhavissāmi, vissāsiko bhavissāmi, abbhantariko bhavissāmi, suhadayo bhavissāmīti. Evaṃ piyakamyatāya pesuññaṃ upasaṃharati. Kathaṃ bhedādhippāyena pesuññaṃ upasaṃharati? ‘‘Kathaṃ ime nānā assu vinā assu vaggā assu dvedhā assu dvejjhā assu dve pakkhā assu bhijjeyyuṃ na samāgaccheyyuṃ dukkhaṃ na phāsu [aphāsuṃ (sī.)] vihareyyu’’nti. Evaṃ bhedādhippāyena pesuññaṃ upasaṃharati. Yassetaṃ pesuññaṃ pahīnaṃ samucchinnaṃ vūpasantaṃ paṭipassaddhaṃ abhabbuppattikaṃ ñāṇagginā daḍḍhaṃ, so pesuññe no yuto na yutto na payutto na sammāyuttoti – pesuṇeyye ca no yuto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tenāha ",
      " bhagavā –"
    ],
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Patilīno akuhako, apihālu amaccharī;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Appagabbho ajeguccho, pesuṇeyye ca no yuto’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "88"
      },
      "."
    ],
    "innerText": "88."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sātiyesu anassāvī, atimāne ca no yuto;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Saṇho ca paṭibhānavā, na saddho na virajjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sātiyesu anassāvī"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sātiyā"
      },
      " vuccanti pañca kāmaguṇā. Kiṃkāraṇā sātiyā vuccanti pañca kāmaguṇā? Yebhuyyena devamanussā pañca kāmaguṇe icchanti sātiyanti patthayanti pihayanti abhijappanti, taṃkāraṇā sātiyā vuccanti pañca kāmaguṇā. Yesaṃ esā sātiyā taṇhā appahīnā tesaṃ cakkhuto rūpataṇhā savati āsavati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pasavati (syā.)]"
      },
      " sandati pavattati, sotato saddataṇhā… ghānato gandhataṇhā… jivhāto rasataṇhā… kāyato phoṭṭhabbataṇhā… manato dhammataṇhā savati āsavati sandati pavattati. Yesaṃ esā sātiyā taṇhā pahīnā samucchinnā vūpasantā paṭipassaddhā abhabbuppattikā ñāṇagginā daḍḍhā tesaṃ cakkhuto rūpataṇhā na savati nāsavati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[na pasavati (syā.)]"
      },
      " na sandati na pavattati ",
      ", sotato saddataṇhā…pe… manato dhammataṇhā na savati nāsavati na sandati na pavattatīti – sātiyesu anassāvī."
    ],
    "innerText": "Sātiyesu anassāvīti. Sātiyā vuccanti pañca kāmaguṇā. Kiṃkāraṇā sātiyā vuccanti pañca kāmaguṇā? Yebhuyyena devamanussā pañca kāmaguṇe icchanti sātiyanti patthayanti pihayanti abhijappanti, taṃkāraṇā sātiyā vuccanti pañca kāmaguṇā. Yesaṃ esā sātiyā taṇhā appahīnā tesaṃ cakkhuto rūpataṇhā savati āsavati [pasavati (syā.)] sandati pavattati, sotato saddataṇhā… ghānato gandhataṇhā… jivhāto rasataṇhā… kāyato phoṭṭhabbataṇhā… manato dhammataṇhā savati āsavati sandati pavattati. Yesaṃ esā sātiyā taṇhā pahīnā samucchinnā vūpasantā paṭipassaddhā abhabbuppattikā ñāṇagginā daḍḍhā tesaṃ cakkhuto rūpataṇhā na savati nāsavati [na pasavati (syā.)] na sandati na pavattati , sotato saddataṇhā…pe… manato dhammataṇhā na savati nāsavati na sandati na pavattatīti – sātiyesu anassāvī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atimāne ca no yuto"
      },
      "ti. Katamo atimāno? Idhekacco paraṃ ",
      " atimaññati jātiyā vā gottena vā…pe… aññataraññatarena vā vatthunā. Yo evarūpo māno maññanā maññitattaṃ unnati unnamo dhajo sampaggāho ketukamyatā ",
      " cittassa – ayaṃ vuccati atimāno. Yasseso atimāno pahīno samucchinno vūpasanto paṭipassaddho abhabbuppattiko ñāṇagginā daḍḍho, so atimāne ca no yuto na yutto nappayutto na sammāyuttoti – atimāne ca no yuto."
    ],
    "innerText": "Atimāne ca no yutoti. Katamo atimāno? Idhekacco paraṃ atimaññati jātiyā vā gottena vā…pe… aññataraññatarena vā vatthunā. Yo evarūpo māno maññanā maññitattaṃ unnati unnamo dhajo sampaggāho ketukamyatā cittassa – ayaṃ vuccati atimāno. Yasseso atimāno pahīno samucchinno vūpasanto paṭipassaddho abhabbuppattiko ñāṇagginā daḍḍho, so atimāne ca no yuto na yutto nappayutto na sammāyuttoti – atimāne ca no yuto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṇho ca paṭibhānavā"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṇho"
      },
      "ti saṇhena kāyakammena samannāgatoti saṇho, saṇhena vacīkammena… saṇhena manokammena samannāgatoti saṇho, saṇhehi satipaṭṭhānehi samannāgatoti saṇho, saṇhehi sammappadhānehi… saṇhehi iddhipādehi… saṇhehi indriyehi… saṇhehi balehi… saṇhehi bojjhaṅgehi samannāgatoti saṇho, saṇhena ariyena aṭṭhaṅgikena maggena samannāgatoti – saṇho."
    ],
    "innerText": "Saṇho ca paṭibhānavāti. Saṇhoti saṇhena kāyakammena samannāgatoti saṇho, saṇhena vacīkammena… saṇhena manokammena samannāgatoti saṇho, saṇhehi satipaṭṭhānehi samannāgatoti saṇho, saṇhehi sammappadhānehi… saṇhehi iddhipādehi… saṇhehi indriyehi… saṇhehi balehi… saṇhehi bojjhaṅgehi samannāgatoti saṇho, saṇhena ariyena aṭṭhaṅgikena maggena samannāgatoti – saṇho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭibhānavā"
      },
      "ti ",
      " tayo paṭibhānavanto – pariyattipaṭibhānavā, paripucchāpaṭibhānavā, adhigamapaṭibhānavā. Katamo pariyattipaṭibhānavā? Idhekaccassa pakatiyā pariyāpuṭaṃ hoti – suttaṃ geyyaṃ veyyākaraṇaṃ gāthā udānaṃ itivuttakaṃ jātakaṃ abbhutadhammaṃ vedallaṃ, tassa pariyattiṃ nissāya paṭibhāyati – ayaṃ pariyattipaṭibhānavā. Katamo ",
      " paripucchāpaṭibhānavā? Idhekacco paripucchitā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[paripucchitaṃ (sī.), paripucchako (syā.)]"
      },
      " hoti attatthe ca ñāyatthe ca lakkhaṇe ca kāraṇe ca ṭhānāṭhāne ca, tassa taṃ paripucchaṃ nissāya paṭibhāyati – ayaṃ paripucchāpaṭibhānavā. Katamo adhigamapaṭibhānavā? Idhekaccassa adhigatā honti cattāro satipaṭṭhānā cattāro sammappadhānā cattāro iddhipādā pañcindriyāni pañca balāni satta bojjhaṅgā ariyo aṭṭhaṅgiko maggo cattāro ariyamaggā cattāri sāmaññaphalāni catasso paṭisambhidāyo cha abhiññāyo, tassa attho ñāto dhammo ñāto nirutti ñātā, atthe ñāte attho paṭibhāyati ",
      ", dhamme ñāte dhammo paṭibhāyati, niruttiyā ñātāya nirutti paṭibhāyati; imesu tīsu ",
      " ñāṇesu ñāṇaṃ paṭibhānapaṭisambhidā. Imāya paṭibhānapaṭisambhidāya upeto samupeto upagato samupagato upapanno samupapanno samannāgato so vuccati paṭibhānavā. Yassa pariyatti natthi, paripucchā natthi, adhigamo natthi, kiṃ tassa paṭibhāyissatīti – saṇho ca paṭibhānavā."
    ],
    "innerText": "Paṭibhānavāti tayo paṭibhānavanto – pariyattipaṭibhānavā, paripucchāpaṭibhānavā, adhigamapaṭibhānavā. Katamo pariyattipaṭibhānavā? Idhekaccassa pakatiyā pariyāpuṭaṃ hoti – suttaṃ geyyaṃ veyyākaraṇaṃ gāthā udānaṃ itivuttakaṃ jātakaṃ abbhutadhammaṃ vedallaṃ, tassa pariyattiṃ nissāya paṭibhāyati – ayaṃ pariyattipaṭibhānavā. Katamo paripucchāpaṭibhānavā? Idhekacco paripucchitā [paripucchitaṃ (sī.), paripucchako (syā.)] hoti attatthe ca ñāyatthe ca lakkhaṇe ca kāraṇe ca ṭhānāṭhāne ca, tassa taṃ paripucchaṃ nissāya paṭibhāyati – ayaṃ paripucchāpaṭibhānavā. Katamo adhigamapaṭibhānavā? Idhekaccassa adhigatā honti cattāro satipaṭṭhānā cattāro sammappadhānā cattāro iddhipādā pañcindriyāni pañca balāni satta bojjhaṅgā ariyo aṭṭhaṅgiko maggo cattāro ariyamaggā cattāri sāmaññaphalāni catasso paṭisambhidāyo cha abhiññāyo, tassa attho ñāto dhammo ñāto nirutti ñātā, atthe ñāte attho paṭibhāyati , dhamme ñāte dhammo paṭibhāyati, niruttiyā ñātāya nirutti paṭibhāyati; imesu tīsu ñāṇesu ñāṇaṃ paṭibhānapaṭisambhidā. Imāya paṭibhānapaṭisambhidāya upeto samupeto upagato samupagato upapanno samupapanno samannāgato so vuccati paṭibhānavā. Yassa pariyatti natthi, paripucchā natthi, adhigamo natthi, kiṃ tassa paṭibhāyissatīti – saṇho ca paṭibhānavā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na saddho na virajjatī"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na saddho"
      },
      "ti sāmaṃ sayaṃ abhiññātaṃ attapaccakkhaṃ dhammaṃ na kassaci saddahati aññassa samaṇassa vā brāhmaṇassa vā devassa vā mārassa vā brahmuno vā. ‘‘Sabbe saṅkhārā aniccā’’ti sāmaṃ sayaṃ abhiññātaṃ…pe… ",
      " ‘‘sabbe saṅkhārā dukkhā’’ti… ‘‘sabbe dhammā anattā’’ti… ‘‘avijjāpaccayā saṅkhārā’’ti…pe… ‘‘jātipaccayā jarāmaraṇa’’nti… ‘‘avijjānirodhā saṅkhāranirodho’’ti…pe… ‘‘jātinirodhā jarāmaraṇanirodho’’ti… ‘‘idaṃ dukkha’’nti…pe… ‘‘ayaṃ dukkhanirodhagāminī paṭipadā’’ti… ‘‘ime āsavā’’ti…pe… ‘‘ayaṃ āsavanirodhagāminī paṭipadā’’ti… ‘‘ime dhammā abhiññeyyā’’ti…pe… ‘‘ime dhammā sacchikātabbā’’ti sāmaṃ sayaṃ abhiññātaṃ…pe… channaṃ phassāyatanānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca, pañcannaṃ upādānakkhandhānaṃ samudayañca…pe… catunnaṃ mahābhūtānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca sāmaṃ sayaṃ abhiññātaṃ…pe… ‘‘yaṃ kiñci samudayadhammaṃ sabbaṃ taṃ nirodhadhamma’’nti sāmaṃ sayaṃ abhiññātaṃ attapaccakkhaṃ dhammaṃ na kassaci saddahati aññassa samaṇassa ",
      " vā brāhmaṇassa vā devassa vā mārassa vā brahmuno vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[brahmuno vā…pe… (sī. ka.)]"
      },
      "."
    ],
    "innerText": "Na saddho na virajjatīti. Na saddhoti sāmaṃ sayaṃ abhiññātaṃ attapaccakkhaṃ dhammaṃ na kassaci saddahati aññassa samaṇassa vā brāhmaṇassa vā devassa vā mārassa vā brahmuno vā. ‘‘Sabbe saṅkhārā aniccā’’ti sāmaṃ sayaṃ abhiññātaṃ…pe… ‘‘sabbe saṅkhārā dukkhā’’ti… ‘‘sabbe dhammā anattā’’ti… ‘‘avijjāpaccayā saṅkhārā’’ti…pe… ‘‘jātipaccayā jarāmaraṇa’’nti… ‘‘avijjānirodhā saṅkhāranirodho’’ti…pe… ‘‘jātinirodhā jarāmaraṇanirodho’’ti… ‘‘idaṃ dukkha’’nti…pe… ‘‘ayaṃ dukkhanirodhagāminī paṭipadā’’ti… ‘‘ime āsavā’’ti…pe… ‘‘ayaṃ āsavanirodhagāminī paṭipadā’’ti… ‘‘ime dhammā abhiññeyyā’’ti…pe… ‘‘ime dhammā sacchikātabbā’’ti sāmaṃ sayaṃ abhiññātaṃ…pe… channaṃ phassāyatanānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca, pañcannaṃ upādānakkhandhānaṃ samudayañca…pe… catunnaṃ mahābhūtānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca sāmaṃ sayaṃ abhiññātaṃ…pe… ‘‘yaṃ kiñci samudayadhammaṃ sabbaṃ taṃ nirodhadhamma’’nti sāmaṃ sayaṃ abhiññātaṃ attapaccakkhaṃ dhammaṃ na kassaci saddahati aññassa samaṇassa vā brāhmaṇassa vā devassa vā mārassa vā brahmuno vā [brahmuno vā…pe… (sī. ka.)]."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vuttañhetaṃ bhagavatā – ‘‘saddahasi tvaṃ, sāriputta, saddhindriyaṃ bhāvitaṃ bahulīkataṃ amatogadhaṃ ",
      " hoti amataparāyanaṃ amatapariyosānaṃ; vīriyindriyaṃ… satindriyaṃ… samādhindriyaṃ… paññindriyaṃ bhāvitaṃ bahulīkataṃ amatogadhaṃ hoti amataparāyanaṃ amatapariyosāna’’nti?"
    ],
    "innerText": "Vuttañhetaṃ bhagavatā – ‘‘saddahasi tvaṃ, sāriputta, saddhindriyaṃ bhāvitaṃ bahulīkataṃ amatogadhaṃ hoti amataparāyanaṃ amatapariyosānaṃ; vīriyindriyaṃ… satindriyaṃ… samādhindriyaṃ… paññindriyaṃ bhāvitaṃ bahulīkataṃ amatogadhaṃ hoti amataparāyanaṃ amatapariyosāna’’nti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Na khvāhaṃ ettha, bhante, bhagavato saddhāya gacchāmi saddhindriyaṃ… vīriyindriyaṃ… satindriyaṃ… samādhindriyaṃ… paññindriyaṃ bhāvitaṃ bahulīkataṃ amatogadhaṃ hoti amataparāyanaṃ amatapariyosānaṃ. Yesaṃ nūnetaṃ, bhante ",
      ", aññātaṃ assa adiṭṭhaṃ aviditaṃ asacchikataṃ aphassitaṃ paññāya, te tattha paresaṃ saddhāya gaccheyyuṃ saddhindriyaṃ bhāvitaṃ bahulīkataṃ amatogadhaṃ hoti amataparāyanaṃ amatapariyosānaṃ. Vīriyindriyaṃ… satindriyaṃ… samādhindriyaṃ ",
      "… paññindriyaṃ bhāvitaṃ bahulīkataṃ amatogadhaṃ hoti amataparāyanaṃ amatapariyosānaṃ. Yesañca kho etaṃ, bhante, ñātaṃ diṭṭhaṃ viditaṃ sacchikataṃ phassitaṃ paññāya, nikkaṅkhā te tattha nibbicikicchā. Saddhindriyaṃ… vīriyindriyaṃ… satindriyaṃ… samādhindriyaṃ… paññindriyaṃ bhāvitaṃ bahulīkataṃ amatogadhaṃ hoti amataparāyanaṃ amatapariyosānaṃ. Mayhañca kho, etaṃ bhante, ñātaṃ diṭṭhaṃ viditaṃ sacchikataṃ phassitaṃ paññāya, nikkaṅkhohaṃ tattha nibbicikiccho. Saddhindriyaṃ… vīriyindriyaṃ… satindriyaṃ… samādhindriyaṃ… paññindriyaṃ bhāvitaṃ bahulīkataṃ amatogadhaṃ hoti amataparāyanaṃ amatapariyosāna’’nti."
    ],
    "innerText": "‘‘Na khvāhaṃ ettha, bhante, bhagavato saddhāya gacchāmi saddhindriyaṃ… vīriyindriyaṃ… satindriyaṃ… samādhindriyaṃ… paññindriyaṃ bhāvitaṃ bahulīkataṃ amatogadhaṃ hoti amataparāyanaṃ amatapariyosānaṃ. Yesaṃ nūnetaṃ, bhante , aññātaṃ assa adiṭṭhaṃ aviditaṃ asacchikataṃ aphassitaṃ paññāya, te tattha paresaṃ saddhāya gaccheyyuṃ saddhindriyaṃ bhāvitaṃ bahulīkataṃ amatogadhaṃ hoti amataparāyanaṃ amatapariyosānaṃ. Vīriyindriyaṃ… satindriyaṃ… samādhindriyaṃ … paññindriyaṃ bhāvitaṃ bahulīkataṃ amatogadhaṃ hoti amataparāyanaṃ amatapariyosānaṃ. Yesañca kho etaṃ, bhante, ñātaṃ diṭṭhaṃ viditaṃ sacchikataṃ phassitaṃ paññāya, nikkaṅkhā te tattha nibbicikicchā. Saddhindriyaṃ… vīriyindriyaṃ… satindriyaṃ… samādhindriyaṃ… paññindriyaṃ bhāvitaṃ bahulīkataṃ amatogadhaṃ hoti amataparāyanaṃ amatapariyosānaṃ. Mayhañca kho, etaṃ bhante, ñātaṃ diṭṭhaṃ viditaṃ sacchikataṃ phassitaṃ paññāya, nikkaṅkhohaṃ tattha nibbicikiccho. Saddhindriyaṃ… vīriyindriyaṃ… satindriyaṃ… samādhindriyaṃ… paññindriyaṃ bhāvitaṃ bahulīkataṃ amatogadhaṃ hoti amataparāyanaṃ amatapariyosāna’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sādhu sādhu, sāriputta! Yesañhetaṃ, sāriputta, aññātaṃ assa adiṭṭhaṃ aviditaṃ asacchikataṃ aphassitaṃ paññāya, te tattha paresaṃ saddhāya gaccheyyuṃ saddhindriyaṃ…pe… paññindriyaṃ ",
      " bhāvitaṃ bahulīkataṃ amatogadhaṃ hoti amataparāyanaṃ amatapariyosānanti."
    ],
    "innerText": "‘‘Sādhu sādhu, sāriputta! Yesañhetaṃ, sāriputta, aññātaṃ assa adiṭṭhaṃ aviditaṃ asacchikataṃ aphassitaṃ paññāya, te tattha paresaṃ saddhāya gaccheyyuṃ saddhindriyaṃ…pe… paññindriyaṃ bhāvitaṃ bahulīkataṃ amatogadhaṃ hoti amataparāyanaṃ amatapariyosānanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Assaddho akataññū ca, sandhicchedo ca yo naro;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Hatāvakāso vantāso, sa ve uttamaporiso’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na saddho na virajjatī"
      },
      "ti. Sabbe bālaputhujjanā rajjanti, puthujjanakalyāṇakaṃ upādāya satta sekkhā virajjanti. Arahā neva rajjati no virajjati, viratto so khayā rāgassa vītarāgattā khayā dosassa vītadosattā, khayā mohassa vītamohattā. So vuṭṭhavāso ciṇṇacaraṇo…pe… jātimaraṇasaṃsāro natthi ",
      " tassa punabbhavoti – na saddho na virajjati."
    ],
    "innerText": "Na saddho na virajjatīti. Sabbe bālaputhujjanā rajjanti, puthujjanakalyāṇakaṃ upādāya satta sekkhā virajjanti. Arahā neva rajjati no virajjati, viratto so khayā rāgassa vītarāgattā khayā dosassa vītadosattā, khayā mohassa vītamohattā. So vuṭṭhavāso ciṇṇacaraṇo…pe… jātimaraṇasaṃsāro natthi tassa punabbhavoti – na saddho na virajjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tenāha ",
      " bhagavā –"
    ],
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sātiyesu anassāvī, atimāne ca no yuto;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Saṇho ca paṭibhānavā, na saddho na virajjatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "89"
      },
      "."
    ],
    "innerText": "89."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Lābhakamyā na sikkhati, alābhe ca na kuppati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aviruddho ca taṇhāya, rasesu"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[rase ca (sī. syā.)]"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nānugijjhati."
      }
    ],
    "innerText": "Aviruddho ca taṇhāya, rasesu[rase ca (sī. syā.)]nānugijjhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lābhakamyā na sikkhati, alābhe ca na kuppatī"
      },
      "ti. Kathaṃ lābhakamyā sikkhati? Idha, bhikkhave, bhikkhu bhikkhuṃ passati lābhiṃ cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārānaṃ. Tassa evaṃ hoti – ‘‘kena nu ",
      " kho ayamāyasmā lābhī cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārāna’’nti? Tassa evaṃ hoti – ‘‘ayaṃ kho āyasmā suttantiko, tenāyamāyasmā lābhī cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārāna’’nti. So lābhahetu lābhapaccayā lābhakāraṇā lābhābhinibbattiyā lābhaṃ paripācento suttantaṃ pariyāpuṇāti. Evampi lābhakamyā sikkhati."
    ],
    "innerText": "Lābhakamyā na sikkhati, alābhe ca na kuppatīti. Kathaṃ lābhakamyā sikkhati? Idha, bhikkhave, bhikkhu bhikkhuṃ passati lābhiṃ cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārānaṃ. Tassa evaṃ hoti – ‘‘kena nu kho ayamāyasmā lābhī cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārāna’’nti? Tassa evaṃ hoti – ‘‘ayaṃ kho āyasmā suttantiko, tenāyamāyasmā lābhī cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārāna’’nti. So lābhahetu lābhapaccayā lābhakāraṇā lābhābhinibbattiyā lābhaṃ paripācento suttantaṃ pariyāpuṇāti. Evampi lābhakamyā sikkhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha vā ",
      " bhikkhu bhikkhuṃ passati lābhiṃ cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārānaṃ. Tassa evaṃ hoti – ‘‘kena nu kho ayamāyasmā lābhī cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārāna’’nti? Tassa evaṃ hoti – ‘‘ayaṃ kho āyasmā vinayadharo…pe… dhammakathiko… ābhidhammiko, tenāyamāyasmā lābhī cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārāna’’nti. So lābhahetu lābhapaccayā lābhakāraṇā ",
      " lābhābhinibbattiyā lābhaṃ paripācento abhidhammaṃ pariyāpuṇāti. Evampi lābhakamyā sikkhati."
    ],
    "innerText": "Atha vā bhikkhu bhikkhuṃ passati lābhiṃ cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārānaṃ. Tassa evaṃ hoti – ‘‘kena nu kho ayamāyasmā lābhī cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārāna’’nti? Tassa evaṃ hoti – ‘‘ayaṃ kho āyasmā vinayadharo…pe… dhammakathiko… ābhidhammiko, tenāyamāyasmā lābhī cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārāna’’nti. So lābhahetu lābhapaccayā lābhakāraṇā lābhābhinibbattiyā lābhaṃ paripācento abhidhammaṃ pariyāpuṇāti. Evampi lābhakamyā sikkhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha vā bhikkhu bhikkhuṃ passati lābhiṃ cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārānaṃ. Tassa evaṃ hoti – ‘‘kena nu kho ayamāyasmā lābhī cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārāna’’nti? Tassa evaṃ hoti – ‘‘ayaṃ kho āyasmā āraññiko… piṇḍapātiko… paṃsukūliko… tecīvariko… sapadānacāriko… khalupacchābhattiko… nesajjiko… yathāsanthatiko, tenāyamāyasmā lābhī cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārāna’’nti. So lābhahetu lābhapaccayā lābhakāraṇā ",
      " lābhābhinibbattiyā lābhaṃ paripācento āraññiko hoti…pe… yathāsanthatiko hoti. Evampi lābhakamyā sikkhati."
    ],
    "innerText": "Atha vā bhikkhu bhikkhuṃ passati lābhiṃ cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārānaṃ. Tassa evaṃ hoti – ‘‘kena nu kho ayamāyasmā lābhī cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārāna’’nti? Tassa evaṃ hoti – ‘‘ayaṃ kho āyasmā āraññiko… piṇḍapātiko… paṃsukūliko… tecīvariko… sapadānacāriko… khalupacchābhattiko… nesajjiko… yathāsanthatiko, tenāyamāyasmā lābhī cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārāna’’nti. So lābhahetu lābhapaccayā lābhakāraṇā lābhābhinibbattiyā lābhaṃ paripācento āraññiko hoti…pe… yathāsanthatiko hoti. Evampi lābhakamyā sikkhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kathaṃ na lābhakamyā sikkhati? Idha bhikkhu na lābhahetu, na lābhapaccayā, na lābhakāraṇā, na lābhābhinibbattiyā, na lābhaṃ paripācento, yāvadeva attadamatthāya attasamatthāya attaparinibbāpanatthāya suttantaṃ pariyāpuṇāti, vinayaṃ pariyāpuṇāti, abhidhammaṃ pariyāpuṇāti. Evampi na lābhakamyā sikkhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " vā bhikkhu na lābhahetu, na lābhapaccayā, na lābhakāraṇā, na lābhābhinibbattiyā, na lābhaṃ paripācento, yāvadeva appicchaññeva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[appicchaṃyeva (sī.)]"
      },
      " nissāya santuṭṭhiññeva nissāya sallekhaññeva nissāya pavivekaññeva nissāya idamatthitaññeva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[idamatthikataññeva (sī.)]"
      },
      " nissāya āraññiko hoti, piṇḍapātiko hoti, paṃsukūliko hoti, tecīvariko hoti ",
      ", sapadānacāriko hoti, khalupacchābhattiko hoti, nesajjiko hoti, yathāsanthatiko hoti. Evampi na lābhakamyā sikkhatīti – lābhakamyā na sikkhati."
    ],
    "innerText": "Atha vā bhikkhu na lābhahetu, na lābhapaccayā, na lābhakāraṇā, na lābhābhinibbattiyā, na lābhaṃ paripācento, yāvadeva appicchaññeva [appicchaṃyeva (sī.)] nissāya santuṭṭhiññeva nissāya sallekhaññeva nissāya pavivekaññeva nissāya idamatthitaññeva [idamatthikataññeva (sī.)] nissāya āraññiko hoti, piṇḍapātiko hoti, paṃsukūliko hoti, tecīvariko hoti , sapadānacāriko hoti, khalupacchābhattiko hoti, nesajjiko hoti, yathāsanthatiko hoti. Evampi na lābhakamyā sikkhatīti – lābhakamyā na sikkhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Alābhe"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ca na kuppatī"
      },
      "ti. Kathaṃ alābhe kuppati? Idhekacco ‘‘kulaṃ vā na labhāmi, gaṇaṃ vā na labhāmi, āvāsaṃ vā na labhāmi, lābhaṃ vā na labhāmi, yasaṃ vā na labhāmi, pasaṃsaṃ vā na labhāmi, sukhaṃ vā na labhāmi, cīvaraṃ vā na labhāmi, piṇḍapātaṃ vā na labhāmi, senāsanaṃ vā na labhāmi, gilānapaccayabhesajjaparikkhāraṃ vā na labhāmi, gilānupaṭṭhākaṃ vā na labhāmi, appaññātomhī’’ti kuppati byāpajjati patiṭṭhīyati, kopañca dosañca appaccayañca pātukaroti. Evaṃ alābhe kuppati."
    ],
    "innerText": "Alābheca na kuppatīti. Kathaṃ alābhe kuppati? Idhekacco ‘‘kulaṃ vā na labhāmi, gaṇaṃ vā na labhāmi, āvāsaṃ vā na labhāmi, lābhaṃ vā na labhāmi, yasaṃ vā na labhāmi, pasaṃsaṃ vā na labhāmi, sukhaṃ vā na labhāmi, cīvaraṃ vā na labhāmi, piṇḍapātaṃ vā na labhāmi, senāsanaṃ vā na labhāmi, gilānapaccayabhesajjaparikkhāraṃ vā na labhāmi, gilānupaṭṭhākaṃ vā na labhāmi, appaññātomhī’’ti kuppati byāpajjati patiṭṭhīyati, kopañca dosañca appaccayañca pātukaroti. Evaṃ alābhe kuppati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kathaṃ alābhe na kuppati? Idha bhikkhu ‘‘kulaṃ vā na labhāmi gaṇaṃ vā na labhāmi…pe… appaññātomhī’’ti na kuppati na byāpajjati na patiṭṭhīyati, na kopañca dosañca appaccayañca pātukaroti. Evaṃ alābhe na kuppatīti – lābhakamyā na sikkhati alābhe ca na kuppati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aviruddho"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ca taṇhāya, rasesu nānugijjhatī"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Viruddho"
      },
      "ti yo cittassa āghāto paṭighāto, paṭighaṃ paṭivirodho, kopo pakopo sampakopo, doso padoso sampadoso, cittassa byāpatti manopadoso, kodho kujjhanā kujjhitattaṃ, doso dussanā dussitattaṃ, byāpatti byāpajjanā ",
      " byāpajjitattaṃ virodho paṭivirodho, caṇḍikkaṃ, asuropo, anattamanatā cittassa – ayaṃ vuccati virodho. Yasseso virodho pahīno samucchinno vūpasanto paṭipassaddho abhabbuppattiko ñāṇagginā daḍḍho, so vuccati aviruddho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṇhā"
      },
      "ti ",
      " rūpataṇhā saddataṇhā gandhataṇhā rasataṇhā phoṭṭhabbataṇhā dhammataṇhā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Raso"
      },
      "ti mūlaraso khandharaso tacaraso pattaraso puppharaso phalaraso, ambilaṃ ",
      " madhuraṃ tittakaṃ kaṭukaṃ loṇikaṃ khārikaṃ lambikaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[lapilaṃ (sī.), lambilaṃ (syā.), labilaṃ (ka.), āyatanavibhaṅge]"
      },
      " kasāvo sādu asādu sītaṃ uṇhaṃ. Santeke samaṇabrāhmaṇā rasagiddhā. Te jivhaggena rasaggāni pariyesantā āhiṇḍanti, te ambilaṃ labhitvā anambilaṃ pariyesanti, anambilaṃ labhitvā ambilaṃ pariyesanti; madhuraṃ labhitvā amadhuraṃ pariyesanti, amadhuraṃ labhitvā madhuraṃ pariyesanti; tittakaṃ labhitvā atittakaṃ pariyesanti, atittakaṃ labhitvā tittakaṃ pariyesanti; kaṭukaṃ labhitvā akaṭukaṃ pariyesanti, akaṭukaṃ labhitvā kaṭukaṃ pariyesanti; loṇikaṃ labhitvā aloṇikaṃ pariyesanti, aloṇikaṃ labhitvā loṇikaṃ pariyesanti; khārikaṃ labhitvā akhārikaṃ pariyesanti, akhārikaṃ labhitvā khārikaṃ pariyesanti; lambikaṃ labhitvā kasāvaṃ pariyesanti ",
      ", kasāvaṃ labhitvā lambikaṃ pariyesanti; sāduṃ labhitvā asāduṃ pariyesanti, asāduṃ labhitvā sāduṃ pariyesanti; sītaṃ labhitvā uṇhaṃ pariyesanti, uṇhaṃ labhitvā sītaṃ pariyesanti. Te yaṃ yaṃ labhitvā tena tena na santussanti aparāparaṃ pariyesanti, manāpikesu rasesu rattā giddhā gadhitā mucchitā ajjhosannā laggā laggitā palibuddhā. Yassesā rasataṇhā pahīnā samucchinnā vūpasantā paṭipassaddhā abhabbuppattikā ñāṇagginā daḍḍhā, so paṭisaṅkhā yoniso āhāraṃ āhāreti – ‘‘neva davāya na madāya na maṇḍanāya na vibhūsanāya, yāvadeva imassa kāyassa ṭhitiyā yāpanāya vihiṃsūparatiyā brahmacariyānuggahāya. Iti purāṇañca vedanaṃ paṭihaṅkhāmi, navañca vedanaṃ na uppādessāmi, yātrā ca me bhavissati anavajjatā ca phāsuvihāro cā’’ti."
    ],
    "innerText": "Aviruddhoca taṇhāya, rasesu nānugijjhatīti. Viruddhoti yo cittassa āghāto paṭighāto, paṭighaṃ paṭivirodho, kopo pakopo sampakopo, doso padoso sampadoso, cittassa byāpatti manopadoso, kodho kujjhanā kujjhitattaṃ, doso dussanā dussitattaṃ, byāpatti byāpajjanā byāpajjitattaṃ virodho paṭivirodho, caṇḍikkaṃ, asuropo, anattamanatā cittassa – ayaṃ vuccati virodho. Yasseso virodho pahīno samucchinno vūpasanto paṭipassaddho abhabbuppattiko ñāṇagginā daḍḍho, so vuccati aviruddho. Taṇhāti rūpataṇhā saddataṇhā gandhataṇhā rasataṇhā phoṭṭhabbataṇhā dhammataṇhā. Rasoti mūlaraso khandharaso tacaraso pattaraso puppharaso phalaraso, ambilaṃ madhuraṃ tittakaṃ kaṭukaṃ loṇikaṃ khārikaṃ lambikaṃ [lapilaṃ (sī.), lambilaṃ (syā.), labilaṃ (ka.), āyatanavibhaṅge] kasāvo sādu asādu sītaṃ uṇhaṃ. Santeke samaṇabrāhmaṇā rasagiddhā. Te jivhaggena rasaggāni pariyesantā āhiṇḍanti, te ambilaṃ labhitvā anambilaṃ pariyesanti, anambilaṃ labhitvā ambilaṃ pariyesanti; madhuraṃ labhitvā amadhuraṃ pariyesanti, amadhuraṃ labhitvā madhuraṃ pariyesanti; tittakaṃ labhitvā atittakaṃ pariyesanti, atittakaṃ labhitvā tittakaṃ pariyesanti; kaṭukaṃ labhitvā akaṭukaṃ pariyesanti, akaṭukaṃ labhitvā kaṭukaṃ pariyesanti; loṇikaṃ labhitvā aloṇikaṃ pariyesanti, aloṇikaṃ labhitvā loṇikaṃ pariyesanti; khārikaṃ labhitvā akhārikaṃ pariyesanti, akhārikaṃ labhitvā khārikaṃ pariyesanti; lambikaṃ labhitvā kasāvaṃ pariyesanti , kasāvaṃ labhitvā lambikaṃ pariyesanti; sāduṃ labhitvā asāduṃ pariyesanti, asāduṃ labhitvā sāduṃ pariyesanti; sītaṃ labhitvā uṇhaṃ pariyesanti, uṇhaṃ labhitvā sītaṃ pariyesanti. Te yaṃ yaṃ labhitvā tena tena na santussanti aparāparaṃ pariyesanti, manāpikesu rasesu rattā giddhā gadhitā mucchitā ajjhosannā laggā laggitā palibuddhā. Yassesā rasataṇhā pahīnā samucchinnā vūpasantā paṭipassaddhā abhabbuppattikā ñāṇagginā daḍḍhā, so paṭisaṅkhā yoniso āhāraṃ āhāreti – ‘‘neva davāya na madāya na maṇḍanāya na vibhūsanāya, yāvadeva imassa kāyassa ṭhitiyā yāpanāya vihiṃsūparatiyā brahmacariyānuggahāya. Iti purāṇañca vedanaṃ paṭihaṅkhāmi, navañca vedanaṃ na uppādessāmi, yātrā ca me bhavissati anavajjatā ca phāsuvihāro cā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yathā ",
      " vanaṃ ālimpeyya yāvadeva ropanatthāya, yathā vā pana akkhaṃ abbhañjeyya yāvadeva bhārassa nittharaṇatthāya, yathā vā pana puttamaṃsaṃ āhāraṃ āhareyya yāvadeva kantārassa nittharaṇatthāya; evameva bhikkhu paṭisaṅkhā yoniso āhāraṃ āhāreti – ‘‘neva davāya…pe… phāsuvihāro cā’’ti. Rasataṇhaṃ pajahati vinodeti byantiṃ karoti anabhāvaṃ ",
      " gameti, rasataṇhāya ārato assa virato paṭivirato nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā viharatīti – aviruddho ca taṇhāya rasesu nānugijjhati."
    ],
    "innerText": "Yathā vanaṃ ālimpeyya yāvadeva ropanatthāya, yathā vā pana akkhaṃ abbhañjeyya yāvadeva bhārassa nittharaṇatthāya, yathā vā pana puttamaṃsaṃ āhāraṃ āhareyya yāvadeva kantārassa nittharaṇatthāya; evameva bhikkhu paṭisaṅkhā yoniso āhāraṃ āhāreti – ‘‘neva davāya…pe… phāsuvihāro cā’’ti. Rasataṇhaṃ pajahati vinodeti byantiṃ karoti anabhāvaṃ gameti, rasataṇhāya ārato assa virato paṭivirato nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā viharatīti – aviruddho ca taṇhāya rasesu nānugijjhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tenāha ",
      " bhagavā –"
    ],
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Lābhakamyā ",
      " na sikkhati, alābhe ca na kuppati;"
    ],
    "innerText": "‘‘Lābhakamyā na sikkhati, alābhe ca na kuppati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Aviruddho ca taṇhāya, rasesu nānugijjhatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "90"
      },
      "."
    ],
    "innerText": "90."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Upekkhako sadā sato, na loke maññate samaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Na visesī na nīceyyo, tassa no santi ussadā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upekkhako sadā sato"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upekkhako"
      },
      "ti chaḷaṅgupekkhāya samannāgato. Cakkhunā rūpaṃ disvā neva sumano hoti na dummano, upekkhako viharati sato sampajāno. Sotena saddaṃ sutvā…pe… manasā dhammaṃ viññāya neva sumano hoti na dummano, upekkhako viharati sato sampajāno. Cakkhunā rūpaṃ disvā manāpaṃ nābhigijjhati nābhihaṃsati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[nābhihasati (sī. syā.)]"
      },
      " na rāgaṃ janeti, tassa ṭhitova kāyo hoti, ṭhitaṃ cittaṃ ajjhattaṃ susaṇṭhitaṃ suvimuttaṃ. Cakkhunā ",
      " kho paneva rūpaṃ disvā amanāpaṃ na maṅku hoti appatiṭṭhitacitto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[appatiṭṭhīna citto (syā.), appatiṭṭhanacitto (ka.)]"
      },
      " alīnamanaso ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ādinamanaso (syā.)]"
      },
      " abyāpannacetaso, tassa ṭhitova kāyo hoti, ṭhitaṃ cittaṃ ajjhattaṃ susaṇṭhitaṃ suvimuttaṃ. Sotena saddaṃ sutvā… ghānena gandhaṃ ghāyitvā… jivhāya rasaṃ sāyitvā… kāyena phoṭṭhabbaṃ phusitvā… manasā dhammaṃ viññāya manāpaṃ nābhigijjhati nābhihaṃsati na ",
      " rāgaṃ janeti, tassa ṭhitova kāyo hoti, ṭhitaṃ cittaṃ ajjhattaṃ susaṇṭhitaṃ suvimuttaṃ. Manasā kho paneva dhammaṃ viññāya amanāpaṃ na maṅku hoti appatiṭṭhitacitto alīnamanaso abyāpannacetaso, tassa ṭhitova kāyo hoti, ṭhitaṃ cittaṃ ajjhattaṃ susaṇṭhitaṃ suvimuttaṃ."
    ],
    "innerText": "Upekkhako sadā satoti. Upekkhakoti chaḷaṅgupekkhāya samannāgato. Cakkhunā rūpaṃ disvā neva sumano hoti na dummano, upekkhako viharati sato sampajāno. Sotena saddaṃ sutvā…pe… manasā dhammaṃ viññāya neva sumano hoti na dummano, upekkhako viharati sato sampajāno. Cakkhunā rūpaṃ disvā manāpaṃ nābhigijjhati nābhihaṃsati [nābhihasati (sī. syā.)] na rāgaṃ janeti, tassa ṭhitova kāyo hoti, ṭhitaṃ cittaṃ ajjhattaṃ susaṇṭhitaṃ suvimuttaṃ. Cakkhunā kho paneva rūpaṃ disvā amanāpaṃ na maṅku hoti appatiṭṭhitacitto [appatiṭṭhīna citto (syā.), appatiṭṭhanacitto (ka.)] alīnamanaso [ādinamanaso (syā.)] abyāpannacetaso, tassa ṭhitova kāyo hoti, ṭhitaṃ cittaṃ ajjhattaṃ susaṇṭhitaṃ suvimuttaṃ. Sotena saddaṃ sutvā… ghānena gandhaṃ ghāyitvā… jivhāya rasaṃ sāyitvā… kāyena phoṭṭhabbaṃ phusitvā… manasā dhammaṃ viññāya manāpaṃ nābhigijjhati nābhihaṃsati na rāgaṃ janeti, tassa ṭhitova kāyo hoti, ṭhitaṃ cittaṃ ajjhattaṃ susaṇṭhitaṃ suvimuttaṃ. Manasā kho paneva dhammaṃ viññāya amanāpaṃ na maṅku hoti appatiṭṭhitacitto alīnamanaso abyāpannacetaso, tassa ṭhitova kāyo hoti, ṭhitaṃ cittaṃ ajjhattaṃ susaṇṭhitaṃ suvimuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Cakkhunā rūpaṃ disvā manāpāmanāpesu rūpesu tassa ṭhitova kāyo hoti, ṭhitaṃ cittaṃ ajjhattaṃ susaṇṭhitaṃ suvimuttaṃ. Sotena saddaṃ sutvā…pe… manasā dhammaṃ viññāya manāpāmanāpesu dhammesu tassa ṭhitova kāyo hoti, ṭhitaṃ cittaṃ ajjhattaṃ susaṇṭhitaṃ suvimuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Cakkhunā rūpaṃ disvā rajanīye na rajjati, dussanīye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[dosanīye (bahūsu)]"
      },
      " na dussati, mohanīye na muyhati, kopanīye na kuppati, madanīye na majjati, kilesanīye na kilissati. Sotena saddaṃ sutvā…pe… manasā dhammaṃ viññāya rajanīye na rajjati dussanīye na dussati, mohanīye na muyhati, kopanīye na kuppati, madanīye na majjati, kilesanīye na kilissati. Diṭṭhe ",
      " diṭṭhamatto, sute sutamatto, mute mutamatto, viññāte viññātamatto. Diṭṭhe na ",
      " limpati, sute na limpati, mute na limpati, viññāte na limpati. Diṭṭhe anūpayo anapāyo anissito appaṭibaddho vippamutto visaññutto vimariyādikatena cetasā viharati. Sute… mute… viññāte ",
      " anūpayo anapāyo anissito appaṭibaddho vippamutto visaññutto vimariyādikatena cetasā viharati."
    ],
    "innerText": "Cakkhunā rūpaṃ disvā rajanīye na rajjati, dussanīye [dosanīye (bahūsu)] na dussati, mohanīye na muyhati, kopanīye na kuppati, madanīye na majjati, kilesanīye na kilissati. Sotena saddaṃ sutvā…pe… manasā dhammaṃ viññāya rajanīye na rajjati dussanīye na dussati, mohanīye na muyhati, kopanīye na kuppati, madanīye na majjati, kilesanīye na kilissati. Diṭṭhe diṭṭhamatto, sute sutamatto, mute mutamatto, viññāte viññātamatto. Diṭṭhe na limpati, sute na limpati, mute na limpati, viññāte na limpati. Diṭṭhe anūpayo anapāyo anissito appaṭibaddho vippamutto visaññutto vimariyādikatena cetasā viharati. Sute… mute… viññāte anūpayo anapāyo anissito appaṭibaddho vippamutto visaññutto vimariyādikatena cetasā viharati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Saṃvijjati arahato cakkhu, passati arahā cakkhunā rūpaṃ. Chandarāgo ",
      " arahato natthi, suvimuttacitto arahā. Saṃvijjati arahato sotaṃ, suṇāti arahā sotena saddaṃ. Chandarāgo arahato natthi, suvimuttacitto arahā. Saṃvijjati arahato ghānaṃ, ghāyati arahā ghānena gandhaṃ. Chandarāgo arahato natthi, suvimuttacitto arahā. Saṃvijjati arahato jivhā, sāyati arahā jivhāya rasaṃ…pe… saṃvijjati arahato kāyo, phusati arahā kāyena phoṭṭhabbaṃ…pe… saṃvijjati arahato mano, vijānāti arahā manasā dhammaṃ. Chandarāgo arahato natthi suvimuttacitto arahā."
    ],
    "innerText": "Saṃvijjati arahato cakkhu, passati arahā cakkhunā rūpaṃ. Chandarāgo arahato natthi, suvimuttacitto arahā. Saṃvijjati arahato sotaṃ, suṇāti arahā sotena saddaṃ. Chandarāgo arahato natthi, suvimuttacitto arahā. Saṃvijjati arahato ghānaṃ, ghāyati arahā ghānena gandhaṃ. Chandarāgo arahato natthi, suvimuttacitto arahā. Saṃvijjati arahato jivhā, sāyati arahā jivhāya rasaṃ…pe… saṃvijjati arahato kāyo, phusati arahā kāyena phoṭṭhabbaṃ…pe… saṃvijjati arahato mano, vijānāti arahā manasā dhammaṃ. Chandarāgo arahato natthi suvimuttacitto arahā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Cakkhu rūpārāmaṃ rūparataṃ rūpasammuditaṃ, taṃ arahato dantaṃ guttaṃ rakkhitaṃ saṃvutaṃ, tassa ca saṃvarāya dhammaṃ deseti. Sotaṃ saddārāmaṃ…pe… ghānaṃ gandhārāmaṃ… jivhā rasārāmā rasaratā rasasammuditā, sā arahato dantā guttā rakkhitā saṃvutā, tassā ca saṃvarāya dhammaṃ deseti. Kāyo phoṭṭhabbārāmo…pe… mano dhammārāmo dhammarato dhammasammudito, so arahato danto gutto rakkhito saṃvuto, tassa ca saṃvarāya dhammaṃ deseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Dantaṃ nayanti samitiṃ, dantaṃ rājābhirūhati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Danto seṭṭho manussesu, yotivākyaṃ titikkhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Varamassatarā ",
      " dantā, ājānīyā ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ājāniyāva (syā.)]"
      },
      " sindhavā;"
    ],
    "innerText": "‘‘Varamassatarā dantā, ājānīyā ca [ājāniyāva (syā.)] sindhavā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kuñjarā ca mahānāgā, attadanto tato varaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Na hi etehi yānehi, gaccheyya agataṃ disaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yathāttanā sudantena, danto dantena gacchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Vidhāsu ",
      " na vikampanti, vippamuttā punabbhavā;"
    ],
    "innerText": "‘‘Vidhāsu na vikampanti, vippamuttā punabbhavā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dantabhūmimanuppattā, te loke vijitāvino."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Yassindriyāni ",
      " bhāvitāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vibhāvitāni (sī.)]"
      },
      ", ajjhattaṃ bahiddhā ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ajjhattabahiddhā ca (sī.), ajjhattañca bahiddhā ca (syā. ka.) su. ni. 521]"
      },
      " sabbaloke;"
    ],
    "innerText": "‘‘Yassindriyāni bhāvitāni [vibhāvitāni (sī.)], ajjhattaṃ bahiddhā ca [ajjhattabahiddhā ca (sī.), ajjhattañca bahiddhā ca (syā. ka.) su. ni. 521] sabbaloke;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Nibbijjha imaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[nibbijjhimaṃ (syā.), nibbijja imaṃ (ka.)]"
      },
      " parañca lokaṃ, kālaṃ kaṅkhati bhāvito sa danto’’ti."
    ],
    "innerText": "Nibbijjha imaṃ [nibbijjhimaṃ (syā.), nibbijja imaṃ (ka.)] parañca lokaṃ, kālaṃ kaṅkhati bhāvito sa danto’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upekkhako sadā"
      },
      "ti. Sadā sabbadā sabbakālaṃ niccakālaṃ dhuvakālaṃ…pe… pacchime vayokhandhe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sato"
      },
      "ti catūhi kāraṇehi sato – kāye kāyānupassanāsatipaṭṭhānaṃ bhāvento sato, vedanāsu… citte… dhammesu dhammānupassanāsatipaṭṭhānaṃ bhāvento sato…pe… so vuccati satoti – upekkhako sadā sato."
    ],
    "innerText": "Upekkhako sadāti. Sadā sabbadā sabbakālaṃ niccakālaṃ dhuvakālaṃ…pe… pacchime vayokhandhe. Satoti catūhi kāraṇehi sato – kāye kāyānupassanāsatipaṭṭhānaṃ bhāvento sato, vedanāsu… citte… dhammesu dhammānupassanāsatipaṭṭhānaṃ bhāvento sato…pe… so vuccati satoti – upekkhako sadā sato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na loke maññate sama"
      },
      "nti. ‘‘Sadisohamasmī’’ti mānaṃ na janeti jātiyā vā gottena vā…pe… aññataraññatarena vā vatthunāti – na loke maññate samaṃ."
    ],
    "innerText": "Na loke maññate samanti. ‘‘Sadisohamasmī’’ti mānaṃ na janeti jātiyā vā gottena vā…pe… aññataraññatarena vā vatthunāti – na loke maññate samaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na visesī na nīceyyo"
      },
      "ti. ‘‘Seyyohamasmī’’ti atimānaṃ na janeti jātiyā vā gottena vā…pe… aññataraññatarena vā vatthunā ",
      ". ‘‘Hīnohamasmī’’ti omānaṃ na janeti jātiyā vā gottena vā…pe… aññataraññatarena vā vatthunāti – na visesī na nīceyyo."
    ],
    "innerText": "Na visesī na nīceyyoti. ‘‘Seyyohamasmī’’ti atimānaṃ na janeti jātiyā vā gottena vā…pe… aññataraññatarena vā vatthunā . ‘‘Hīnohamasmī’’ti omānaṃ na janeti jātiyā vā gottena vā…pe… aññataraññatarena vā vatthunāti – na visesī na nīceyyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tassa no santi ussadā"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tassā"
      },
      "ti arahato khīṇāsavassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ussadā"
      },
      "ti sattussadā – rāgussado dosussado mohussado mānussado diṭṭhussado kilesussado kammussado. Tassime ussadā natthi na santi na saṃvijjanti nupalabbhanti, pahīnā samucchinnā vūpasantā paṭipassaddhā abhabbuppattikā ñāṇagginā daḍḍhāti – tassa no santi ussadā."
    ],
    "innerText": "Tassa no santi ussadāti. Tassāti arahato khīṇāsavassa. Ussadāti sattussadā – rāgussado dosussado mohussado mānussado diṭṭhussado kilesussado kammussado. Tassime ussadā natthi na santi na saṃvijjanti nupalabbhanti, pahīnā samucchinnā vūpasantā paṭipassaddhā abhabbuppattikā ñāṇagginā daḍḍhāti – tassa no santi ussadā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Upekkhako sadā sato, na loke maññate samaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Na visesī na nīceyyo, tassa no santi ussadā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "91"
      },
      "."
    ],
    "innerText": "91."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yassa"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nissayatā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[nissayanā (ka.)]"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "natthi, ñatvā dhammaṃ anissito;"
      }
    ],
    "innerText": "Yassanissayatā[nissayanā (ka.)]natthi, ñatvā dhammaṃ anissito;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhavāya vibhavāya vā, taṇhā yassa na vijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yassa"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nissayatā natthī"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yassā"
      },
      "ti arahato khīṇāsavassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nissayā"
      },
      "ti dve nissayā – taṇhānissayo ca diṭṭhinissayo ca…pe… ayaṃ taṇhānissayo…pe… ayaṃ diṭṭhinissayo ",
      ". Tassa taṇhānissayo pahīno, diṭṭhinissayo paṭinissaṭṭho; taṇhānissayassa pahīnattā diṭṭhinissayassa paṭinissaṭṭhattā nissayatā yassa natthi na santi na saṃvijjati nupalabbhati, pahīnā samucchinnā vūpasantā paṭipassaddhā abhabbuppattikā ñāṇagginā daḍḍhāti – yassa nissayatā natthi."
    ],
    "innerText": "Yassanissayatā natthīti. Yassāti arahato khīṇāsavassa. Nissayāti dve nissayā – taṇhānissayo ca diṭṭhinissayo ca…pe… ayaṃ taṇhānissayo…pe… ayaṃ diṭṭhinissayo . Tassa taṇhānissayo pahīno, diṭṭhinissayo paṭinissaṭṭho; taṇhānissayassa pahīnattā diṭṭhinissayassa paṭinissaṭṭhattā nissayatā yassa natthi na santi na saṃvijjati nupalabbhati, pahīnā samucchinnā vūpasantā paṭipassaddhā abhabbuppattikā ñāṇagginā daḍḍhāti – yassa nissayatā natthi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñatvā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammaṃ anissito"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñatvā"
      },
      "ti ñatvā jānitvā tulayitvā tīrayitvā vibhāvayitvā vibhūtaṃ katvā, ‘‘sabbe saṅkhārā aniccā’’ti ñatvā jānitvā tulayitvā tīrayitvā vibhāvayitvā vibhūtaṃ katvā, ‘‘sabbe saṅkhārā dukkhā’’ti… ‘‘sabbe dhammā anattā’’ti…pe… ‘‘yaṃ kiñci samudayadhammaṃ sabbaṃ taṃ nirodhadhamma’’nti ñatvā jānitvā tulayitvā tīrayitvā vibhāvayitvā vibhūtaṃ katvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anissito"
      },
      "ti dve nissayā – taṇhānissayo ca diṭṭhinissayo ca…pe… ayaṃ taṇhānissayo…pe… ayaṃ diṭṭhinissayo. Taṇhānissayaṃ pahāya diṭṭhinissayaṃ paṭinissajjitvā cakkhuṃ anissito, sotaṃ anissito, ghānaṃ anissito, jivhaṃ anissito, kāyaṃ anissito, manaṃ anissito, rūpe… sadde… gandhe… rase… phoṭṭhabbe… kulaṃ… gaṇaṃ… āvāsaṃ…pe… diṭṭhasutamutaviññātabbe dhamme anissito anallīno anupagato anajjhosito anadhimutto nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā viharatīti – ñatvā dhammaṃ anissito."
    ],
    "innerText": "Ñatvādhammaṃ anissitoti. Ñatvāti ñatvā jānitvā tulayitvā tīrayitvā vibhāvayitvā vibhūtaṃ katvā, ‘‘sabbe saṅkhārā aniccā’’ti ñatvā jānitvā tulayitvā tīrayitvā vibhāvayitvā vibhūtaṃ katvā, ‘‘sabbe saṅkhārā dukkhā’’ti… ‘‘sabbe dhammā anattā’’ti…pe… ‘‘yaṃ kiñci samudayadhammaṃ sabbaṃ taṃ nirodhadhamma’’nti ñatvā jānitvā tulayitvā tīrayitvā vibhāvayitvā vibhūtaṃ katvā. Anissitoti dve nissayā – taṇhānissayo ca diṭṭhinissayo ca…pe… ayaṃ taṇhānissayo…pe… ayaṃ diṭṭhinissayo. Taṇhānissayaṃ pahāya diṭṭhinissayaṃ paṭinissajjitvā cakkhuṃ anissito, sotaṃ anissito, ghānaṃ anissito, jivhaṃ anissito, kāyaṃ anissito, manaṃ anissito, rūpe… sadde… gandhe… rase… phoṭṭhabbe… kulaṃ… gaṇaṃ… āvāsaṃ…pe… diṭṭhasutamutaviññātabbe dhamme anissito anallīno anupagato anajjhosito anadhimutto nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā viharatīti – ñatvā dhammaṃ anissito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhavāya vibhavāya vā, taṇhā yassa na vijjatī"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṇhā"
      },
      "ti rūpataṇhā saddataṇhā gandhataṇhā rasataṇhā phoṭṭhabbataṇhā dhammataṇhā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yassā"
      },
      "ti arahato khīṇāsavassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhavāyā"
      },
      "ti bhavadiṭṭhiyā, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vibhavāyā"
      },
      "ti vibhavadiṭṭhiyā; ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhavāyā"
      },
      "ti sassatadiṭṭhiyā, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vibhavāyā"
      },
      "ti ucchedadiṭṭhiyā; ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhavāyā"
      },
      "ti punappunabhavāya punappunagatiyā punappunaupapattiyā punappunapaṭisandhiyā ",
      " punappunaattabhāvābhinibbattiyā ",
      ". Taṇhā yassa natthi na santi ",
      " na saṃvijjati nupalabbhati, pahīnā samucchinnā vūpasantā paṭipassaddhā abhabbuppattikā ñāṇagginā daḍḍhāti – bhavāya vibhavāya vā taṇhā yassa na vijjati."
    ],
    "innerText": "Bhavāya vibhavāya vā, taṇhā yassa na vijjatīti. Taṇhāti rūpataṇhā saddataṇhā gandhataṇhā rasataṇhā phoṭṭhabbataṇhā dhammataṇhā. Yassāti arahato khīṇāsavassa. Bhavāyāti bhavadiṭṭhiyā, vibhavāyāti vibhavadiṭṭhiyā; bhavāyāti sassatadiṭṭhiyā, vibhavāyāti ucchedadiṭṭhiyā; bhavāyāti punappunabhavāya punappunagatiyā punappunaupapattiyā punappunapaṭisandhiyā punappunaattabhāvābhinibbattiyā . Taṇhā yassa natthi na santi na saṃvijjati nupalabbhati, pahīnā samucchinnā vūpasantā paṭipassaddhā abhabbuppattikā ñāṇagginā daḍḍhāti – bhavāya vibhavāya vā taṇhā yassa na vijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yassa nissayatā natthi, ñatvā dhammaṃ anissito;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhavāya vibhavāya vā, taṇhā yassa na vijjatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "92"
      },
      "."
    ],
    "innerText": "92."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "brūmi upasantoti, kāmesu anapekkhinaṃ;"
      }
    ],
    "innerText": "Taṃbrūmi upasantoti, kāmesu anapekkhinaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ganthā tassa na vijjanti, atarī so visattikaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃ brūmi upasanto"
      },
      "ti. Upasanto vūpasanto nibbuto paṭipassaddhoti. Taṃ brūmi taṃ kathemi taṃ bhaṇāmi taṃ dīpayāmi taṃ voharāmīti – taṃ brūmi upasantoti."
    ],
    "innerText": "Taṃ brūmi upasantoti. Upasanto vūpasanto nibbuto paṭipassaddhoti. Taṃ brūmi taṃ kathemi taṃ bhaṇāmi taṃ dīpayāmi taṃ voharāmīti – taṃ brūmi upasantoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāmesu anapekkhina"
      },
      "nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāmā"
      },
      "ti uddānato dve kāmā – vatthukāmā ca kilesakāmā ca…pe… ime vuccanti vatthukāmā…pe… ime vuccanti kilesakāmā. Vatthukāme parijānitvā, kilesakāme pahāya pajahitvā vinodetvā byantiṃ karitvā anabhāvaṃ gametvā kāmesu anapekkhino vītakāmo cattakāmo vantakāmo muttakāmo pahīnakāmo paṭinissaṭṭhakāmo, kāmesu vītarāgo vigatarāgo cattarāgo vantarāgo muttarāgo pahīnarāgo paṭinissaṭṭharāgo nicchāto nibbuto sītibhūto sukhappaṭisaṃvedī brahmabhūtena attanā viharatīti – kāmesu anapekkhinaṃ."
    ],
    "innerText": "Kāmesu anapekkhinanti. Kāmāti uddānato dve kāmā – vatthukāmā ca kilesakāmā ca…pe… ime vuccanti vatthukāmā…pe… ime vuccanti kilesakāmā. Vatthukāme parijānitvā, kilesakāme pahāya pajahitvā vinodetvā byantiṃ karitvā anabhāvaṃ gametvā kāmesu anapekkhino vītakāmo cattakāmo vantakāmo muttakāmo pahīnakāmo paṭinissaṭṭhakāmo, kāmesu vītarāgo vigatarāgo cattarāgo vantarāgo muttarāgo pahīnarāgo paṭinissaṭṭharāgo nicchāto nibbuto sītibhūto sukhappaṭisaṃvedī brahmabhūtena attanā viharatīti – kāmesu anapekkhinaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ganthā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tassa na vijjantī"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ganthā"
      },
      "ti cattāro ganthā – abhijjhā kāyagantho, byāpādo kāyagantho, sīlabbataparāmāso kāyagantho, idaṃsaccābhiniveso kāyagantho. Attano ",
      " diṭṭhiyā rāgo abhijjhā kāyagantho, paravādesu āghāto appaccayo byāpādo kāyagantho, attano sīlaṃ vā vataṃ vā sīlabbataṃ vā parāmāso sīlabbataparāmāso kāyagantho, attano diṭṭhi idaṃsaccābhiniveso kāyagantho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tassā"
      },
      "ti arahato khīṇāsavassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ganthā tassa na vijjantī"
      },
      "ti. Ganthā tassa natthi na santi na saṃvijjanti nupalabbhanti, pahīnā samucchinnā vūpasantā paṭipassaddhā abhabbuppattikā ñāṇagginā daḍḍhāti – ganthā tassa na vijjanti."
    ],
    "innerText": "Ganthātassa na vijjantīti. Ganthāti cattāro ganthā – abhijjhā kāyagantho, byāpādo kāyagantho, sīlabbataparāmāso kāyagantho, idaṃsaccābhiniveso kāyagantho. Attano diṭṭhiyā rāgo abhijjhā kāyagantho, paravādesu āghāto appaccayo byāpādo kāyagantho, attano sīlaṃ vā vataṃ vā sīlabbataṃ vā parāmāso sīlabbataparāmāso kāyagantho, attano diṭṭhi idaṃsaccābhiniveso kāyagantho. Tassāti arahato khīṇāsavassa. Ganthā tassa na vijjantīti. Ganthā tassa natthi na santi na saṃvijjanti nupalabbhanti, pahīnā samucchinnā vūpasantā paṭipassaddhā abhabbuppattikā ñāṇagginā daḍḍhāti – ganthā tassa na vijjanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atarī so visattika"
      },
      "nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Visattikā"
      },
      " vuccati taṇhā. Yo rāgo sārāgo…pe… abhijjhā lobho akusalamūlaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Visattikā"
      },
      "ti kenaṭṭhena visattikā ",
      "? Visatāti visattikā, visālāti visattikā, visaṭāti visattikā, visamāti visattikā, visakkatīti visattikā, visaṃharatīti visattikā, visaṃvādikāti visattikā, visamūlāti visattikā, visaphalāti visattikā, visaparibhogāti visattikā, visālā vā pana sā taṇhā rūpe… sadde… gandhe… rase… phoṭṭhabbe… kule… gaṇe… āvāse…pe… diṭṭhasutamutaviññātabbesu dhammesu visataṃ vitthatāti visattikā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atarī so visattika"
      },
      "nti. So imaṃ visattikaṃ taṇhaṃ atari uttari patari samatikkami vītivattīti – atarī ",
      " so visattikaṃ."
    ],
    "innerText": "Atarī so visattikanti. Visattikā vuccati taṇhā. Yo rāgo sārāgo…pe… abhijjhā lobho akusalamūlaṃ. Visattikāti kenaṭṭhena visattikā ? Visatāti visattikā, visālāti visattikā, visaṭāti visattikā, visamāti visattikā, visakkatīti visattikā, visaṃharatīti visattikā, visaṃvādikāti visattikā, visamūlāti visattikā, visaphalāti visattikā, visaparibhogāti visattikā, visālā vā pana sā taṇhā rūpe… sadde… gandhe… rase… phoṭṭhabbe… kule… gaṇe… āvāse…pe… diṭṭhasutamutaviññātabbesu dhammesu visataṃ vitthatāti visattikā. Atarī so visattikanti. So imaṃ visattikaṃ taṇhaṃ atari uttari patari samatikkami vītivattīti – atarī so visattikaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tenāha ",
      " bhagavā –"
    ],
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Taṃ brūmi upasantoti, kāmesu anapekkhinaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ganthā tassa na vijjanti, atarī so visattika’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "93"
      },
      "."
    ],
    "innerText": "93."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Na tassa puttā pasavo, khettaṃ vatthuñca vijjati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Attā vāpi nirattā vā, na tasmiṃ upalabbhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na tassa puttā pasavo, khettaṃ vatthuñca vijjatī"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nā"
      },
      "ti paṭikkhepo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tassā"
      },
      "ti arahato khīṇāsavassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puttā"
      },
      "ti cattāro puttā – attajo putto, khettajo putto, dinnako putto ",
      ", antevāsiko putto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pasavo"
      },
      "ti. Ajeḷakā kukkuṭasūkarā hatthigāvāssavaḷavā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khetta"
      },
      "nti sālikhettaṃ vīhikhettaṃ muggakhettaṃ māsakhettaṃ yavakhettaṃ godhumakhettaṃ tilakhettaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vatthu"
      },
      "nti gharavatthuṃ koṭṭhavatthuṃ purevatthuṃ pacchāvatthuṃ ārāmavatthuṃ vihāravatthuṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na tassa puttā pasavo, khettaṃ vatthuñca vijjatī"
      },
      "ti. Tassa puttapariggaho vā pasupariggaho vā khettapariggaho vā vatthupariggaho vā natthi na santi na saṃvijjanti nupalabbhanti, pahīnā samucchinnā vūpasantā paṭipassaddhā abhabbuppattikā ñāṇagginā daḍḍhāti – na tassa puttā pasavo, khettaṃ vatthuñca vijjati."
    ],
    "innerText": "Na tassa puttā pasavo, khettaṃ vatthuñca vijjatīti. Nāti paṭikkhepo. Tassāti arahato khīṇāsavassa. Puttāti cattāro puttā – attajo putto, khettajo putto, dinnako putto , antevāsiko putto. Pasavoti. Ajeḷakā kukkuṭasūkarā hatthigāvāssavaḷavā. Khettanti sālikhettaṃ vīhikhettaṃ muggakhettaṃ māsakhettaṃ yavakhettaṃ godhumakhettaṃ tilakhettaṃ. Vatthunti gharavatthuṃ koṭṭhavatthuṃ purevatthuṃ pacchāvatthuṃ ārāmavatthuṃ vihāravatthuṃ. Na tassa puttā pasavo, khettaṃ vatthuñca vijjatīti. Tassa puttapariggaho vā pasupariggaho vā khettapariggaho vā vatthupariggaho vā natthi na santi na saṃvijjanti nupalabbhanti, pahīnā samucchinnā vūpasantā paṭipassaddhā abhabbuppattikā ñāṇagginā daḍḍhāti – na tassa puttā pasavo, khettaṃ vatthuñca vijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attā vāpi nirattā vā, na tasmiṃ upalabbhatī"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attā"
      },
      "ti attadiṭṭhi, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nirattā"
      },
      "ti ucchedadiṭṭhi; ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "attā"
      },
      "ti gahitaṃ natthi, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nirattā"
      },
      "ti muñcitabbaṃ natthi. Yassa natthi gahitaṃ tassa natthi ",
      " muñcitabbaṃ. Yassa natthi muñcitabbaṃ tassa natthi gahitaṃ. Gāhamuñcanasamatikkanto arahā vuddhiparihānivītivatto. So vuṭṭhavāso ciṇṇacaraṇo…pe… jātimaraṇasaṃsāro natthi tassa punabbhavoti – attā vāpi nirattā vā, na tasmiṃ upalabbhati."
    ],
    "innerText": "Attā vāpi nirattā vā, na tasmiṃ upalabbhatīti. Attāti attadiṭṭhi, nirattāti ucchedadiṭṭhi; attāti gahitaṃ natthi, nirattāti muñcitabbaṃ natthi. Yassa natthi gahitaṃ tassa natthi muñcitabbaṃ. Yassa natthi muñcitabbaṃ tassa natthi gahitaṃ. Gāhamuñcanasamatikkanto arahā vuddhiparihānivītivatto. So vuṭṭhavāso ciṇṇacaraṇo…pe… jātimaraṇasaṃsāro natthi tassa punabbhavoti – attā vāpi nirattā vā, na tasmiṃ upalabbhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Na ",
      " tassa puttā pasavo, khettaṃ vatthuñca vijjati;"
    ],
    "innerText": "‘‘Na tassa puttā pasavo, khettaṃ vatthuñca vijjati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Attā vāpi nirattā vā, na tasmiṃ upalabbhatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "94"
      },
      "."
    ],
    "innerText": "94."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Yena naṃ vajjuṃ puthujjanā, atho samaṇabrāhmaṇā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Taṃ tassa apurakkhataṃ, tasmā vādesu nejati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yena naṃ vajjuṃ puthujjanā, atho samaṇabrāhmaṇā"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puthujjanā"
      },
      "ti puthu kilese janentīti ",
      " puthujjanā ",
      ", puthu avihatasakkāyadiṭṭhikāti puthujjanā, puthu satthārānaṃ mukhullokikāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mukhullokakāti (sī.)]"
      },
      " puthujjanā, puthu sabbagatīhi avuṭṭhitāti puthujjanā, puthu nānābhisaṅkhāre abhisaṅkharontīti puthujjanā, puthu nānāoghehi vuyhantīti puthujjanā, puthu nānāsantāpehi santappentīti puthujjanā, puthu nānāpariḷāhehi pariḍayhantīti puthujjanā, puthu pañcasu kāmaguṇesu rattā giddhā gadhitā mucchitā ajjhosannā laggā laggitā palibuddhāti puthujjanā, puthu pañcahi nīvaraṇehi āvutā nivutā ovutā pihitā paṭicchannā paṭikujjitāti – puthujjanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samaṇā"
      },
      "ti ye keci ito bahiddhā paribbajūpagatā paribbajasamāpannā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Brāhmaṇā"
      },
      "ti ye keci bhovādikā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yena naṃ vajjuṃ puthujjanā, atho samaṇabrāhmaṇā"
      },
      "ti ",
      ". Puthujjanā yena taṃ rāgena vadeyyuṃ, yena dosena vadeyyuṃ, yena mohena vadeyyuṃ, yena mānena vadeyyuṃ, yāya diṭṭhiyā vadeyyuṃ, yena uddhaccena vadeyyuṃ, yāya vicikicchāya vadeyyuṃ, yehi anusayehi vadeyyuṃ, rattoti vā duṭṭhoti vā mūḷhoti vā vinibaddhoti vā parāmaṭṭhoti vā vikkhepagatoti vā aniṭṭhaṅgatoti vā thāmagatoti vā te abhisaṅkhārā pahīnā; abhisaṅkhārānaṃ pahīnattā gatiyā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[gatiyo (syā.)]"
      },
      " yena taṃ vadeyyuṃ – nerayikoti vā tiracchānayonikoti vā pettivisayikoti vā manussoti vā devoti vā rūpīti vā arūpīti vā saññīti vā asaññīti vā nevasaññīnāsaññīti vā. So hetu natthi paccayo natthi kāraṇaṃ natthi yena naṃ vadeyyuṃ katheyyuṃ bhaṇeyyuṃ dīpayeyyuṃ vohareyyunti – yena naṃ vajjuṃ puthujjanā, atho samaṇabrāhmaṇā."
    ],
    "innerText": "Yena naṃ vajjuṃ puthujjanā, atho samaṇabrāhmaṇāti. Puthujjanāti puthu kilese janentīti puthujjanā , puthu avihatasakkāyadiṭṭhikāti puthujjanā, puthu satthārānaṃ mukhullokikāti [mukhullokakāti (sī.)] puthujjanā, puthu sabbagatīhi avuṭṭhitāti puthujjanā, puthu nānābhisaṅkhāre abhisaṅkharontīti puthujjanā, puthu nānāoghehi vuyhantīti puthujjanā, puthu nānāsantāpehi santappentīti puthujjanā, puthu nānāpariḷāhehi pariḍayhantīti puthujjanā, puthu pañcasu kāmaguṇesu rattā giddhā gadhitā mucchitā ajjhosannā laggā laggitā palibuddhāti puthujjanā, puthu pañcahi nīvaraṇehi āvutā nivutā ovutā pihitā paṭicchannā paṭikujjitāti – puthujjanā. Samaṇāti ye keci ito bahiddhā paribbajūpagatā paribbajasamāpannā. Brāhmaṇāti ye keci bhovādikā. Yena naṃ vajjuṃ puthujjanā, atho samaṇabrāhmaṇāti . Puthujjanā yena taṃ rāgena vadeyyuṃ, yena dosena vadeyyuṃ, yena mohena vadeyyuṃ, yena mānena vadeyyuṃ, yāya diṭṭhiyā vadeyyuṃ, yena uddhaccena vadeyyuṃ, yāya vicikicchāya vadeyyuṃ, yehi anusayehi vadeyyuṃ, rattoti vā duṭṭhoti vā mūḷhoti vā vinibaddhoti vā parāmaṭṭhoti vā vikkhepagatoti vā aniṭṭhaṅgatoti vā thāmagatoti vā te abhisaṅkhārā pahīnā; abhisaṅkhārānaṃ pahīnattā gatiyā [gatiyo (syā.)] yena taṃ vadeyyuṃ – nerayikoti vā tiracchānayonikoti vā pettivisayikoti vā manussoti vā devoti vā rūpīti vā arūpīti vā saññīti vā asaññīti vā nevasaññīnāsaññīti vā. So hetu natthi paccayo natthi kāraṇaṃ natthi yena naṃ vadeyyuṃ katheyyuṃ bhaṇeyyuṃ dīpayeyyuṃ vohareyyunti – yena naṃ vajjuṃ puthujjanā, atho samaṇabrāhmaṇā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃ tassa apurakkhata"
      },
      "nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tassā"
      },
      "ti arahato khīṇāsavassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purekkhārā"
      },
      "ti dve purekkhārā – taṇhāpurekkhāro ca ",
      " diṭṭhipurekkhāro ca…pe… ayaṃ ",
      " taṇhāpurekkhāro…pe… ayaṃ diṭṭhipurekkhāro. Tassa taṇhāpurekkhāro pahīno, diṭṭhipurekkhāro paṭinissaṭṭho; taṇhāpurekkhārassa pahīnattā, diṭṭhipurekkhārassa paṭinissaṭṭhattā na taṇhaṃ vā diṭṭhiṃ vā purato katvā carati, na taṇhādhajo na taṇhāketu na taṇhādhipateyyo, na diṭṭhidhajo na diṭṭhiketu na diṭṭhādhipateyyo, na taṇhāya vā na diṭṭhiyā vā parivārito ",
      " caratīti – taṃ tassa apurakkhataṃ."
    ],
    "innerText": "Taṃ tassa apurakkhatanti. Tassāti arahato khīṇāsavassa. Purekkhārāti dve purekkhārā – taṇhāpurekkhāro ca diṭṭhipurekkhāro ca…pe… ayaṃ taṇhāpurekkhāro…pe… ayaṃ diṭṭhipurekkhāro. Tassa taṇhāpurekkhāro pahīno, diṭṭhipurekkhāro paṭinissaṭṭho; taṇhāpurekkhārassa pahīnattā, diṭṭhipurekkhārassa paṭinissaṭṭhattā na taṇhaṃ vā diṭṭhiṃ vā purato katvā carati, na taṇhādhajo na taṇhāketu na taṇhādhipateyyo, na diṭṭhidhajo na diṭṭhiketu na diṭṭhādhipateyyo, na taṇhāya vā na diṭṭhiyā vā parivārito caratīti – taṃ tassa apurakkhataṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasmā vādesu nejatī"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasmā"
      },
      "ti tasmā taṃkāraṇā taṃhetu tappaccayā taṃnidānā vādesu upavādesu nindāya garahāya akittiyā avaṇṇahārikāya nejati na iñjati na calati na vedhati nappavedhati na sampavedhatīti – tasmā vādesu nejati."
    ],
    "innerText": "Tasmā vādesu nejatīti. Tasmāti tasmā taṃkāraṇā taṃhetu tappaccayā taṃnidānā vādesu upavādesu nindāya garahāya akittiyā avaṇṇahārikāya nejati na iñjati na calati na vedhati nappavedhati na sampavedhatīti – tasmā vādesu nejati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tenāha ",
      " bhagavā –"
    ],
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yena naṃ vajjuṃ puthujjanā, atho samaṇabrāhmaṇā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Taṃ tassa apurakkhataṃ, tasmā vādesu nejatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "95"
      },
      "."
    ],
    "innerText": "95."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Vītagedho amaccharī, na ussesu vadate muni;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Na samesu na omesu, kappaṃ neti akappiyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vītagedho amaccharī"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gedho"
      },
      " vuccati taṇhā. Yo rāgo sārāgo…pe… abhijjhā lobho akusalamūlaṃ. Yasseso gedho pahīno samucchinno vūpasanto paṭipassaddho abhabbuppattiko ñāṇagginā daḍḍho, so vuccati vītagedho. So rūpe agiddho…pe… diṭṭhasutamutaviññātabbesu dhammesu agiddho agadhito amucchito anajjhosito, vītagedho vigatagedho cattagedho vantagedho muttagedho pahīnagedho paṭinissaṭṭhagedho nicchāto…pe… brahmabhūtena attanā viharatīti – vītagedho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Amaccharī"
      },
      "ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "macchariyanti"
      },
      " pañca macchariyāni – āvāsamacchariyaṃ, kulamacchariyaṃ, lābhamacchariyaṃ, vaṇṇamacchariyaṃ, dhammamacchariyaṃ. Yaṃ evarūpaṃ…pe… gāho – idaṃ vuccati macchariyaṃ. Yassetaṃ macchariyaṃ pahīnaṃ samucchinnaṃ vūpasantaṃ paṭipassaddhaṃ abhabbuppattikaṃ ",
      " ñāṇagginā daḍḍhaṃ, so vuccati amaccharīti – vītagedho amaccharī."
    ],
    "innerText": "Vītagedho amaccharīti. Gedho vuccati taṇhā. Yo rāgo sārāgo…pe… abhijjhā lobho akusalamūlaṃ. Yasseso gedho pahīno samucchinno vūpasanto paṭipassaddho abhabbuppattiko ñāṇagginā daḍḍho, so vuccati vītagedho. So rūpe agiddho…pe… diṭṭhasutamutaviññātabbesu dhammesu agiddho agadhito amucchito anajjhosito, vītagedho vigatagedho cattagedho vantagedho muttagedho pahīnagedho paṭinissaṭṭhagedho nicchāto…pe… brahmabhūtena attanā viharatīti – vītagedho. Amaccharīti macchariyanti pañca macchariyāni – āvāsamacchariyaṃ, kulamacchariyaṃ, lābhamacchariyaṃ, vaṇṇamacchariyaṃ, dhammamacchariyaṃ. Yaṃ evarūpaṃ…pe… gāho – idaṃ vuccati macchariyaṃ. Yassetaṃ macchariyaṃ pahīnaṃ samucchinnaṃ vūpasantaṃ paṭipassaddhaṃ abhabbuppattikaṃ ñāṇagginā daḍḍhaṃ, so vuccati amaccharīti – vītagedho amaccharī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na ussesu vadate muni, na samesu na omesū"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Munī"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Monaṃ"
      },
      " vuccati ñāṇaṃ…pe… saṅgajālamaticca so muni. ‘‘Seyyohamasmī’’ti vā, ‘‘sadisohamasmī’’ti vā, ‘‘hīnohamasmī’’ti vā na vadati na katheti na bhaṇati na dīpayati na voharatīti – na ussesu vadate muni, na ",
      " samesu na omesu."
    ],
    "innerText": "Na ussesu vadate muni, na samesu na omesūti. Munīti. Monaṃ vuccati ñāṇaṃ…pe… saṅgajālamaticca so muni. ‘‘Seyyohamasmī’’ti vā, ‘‘sadisohamasmī’’ti vā, ‘‘hīnohamasmī’’ti vā na vadati na katheti na bhaṇati na dīpayati na voharatīti – na ussesu vadate muni, na samesu na omesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kappaṃ neti akappiyo"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kappā"
      },
      "ti dve kappā – taṇhākappo ca diṭṭhikappo ca…pe… ayaṃ taṇhākappo…pe… ayaṃ diṭṭhikappo. Tassa taṇhākappo pahīno, diṭṭhikappo paṭinissaṭṭho; taṇhākappassa pahīnattā, diṭṭhikappassa paṭinissaṭṭhattā taṇhākappaṃ vā diṭṭhikappaṃ vā neti na upeti na upagacchati na gaṇhāti na parāmasati nābhinivisatīti – kappaṃ neti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akappiyo"
      },
      "ti. Kappāti dve kappā – taṇhākappo ca diṭṭhikappo ca…pe… ayaṃ taṇhākappo…pe… ayaṃ diṭṭhikappo. Tassa taṇhākappo pahīno, diṭṭhikappo paṭinissaṭṭho; tassa ",
      " taṇhākappassa pahīnattā, diṭṭhikappassa paṭinissaṭṭhattā taṇhākappaṃ vā diṭṭhikappaṃ vā na kappeti na janeti na sañjaneti na nibbatteti nābhinibbattetīti – kappaṃ neti akappiyo."
    ],
    "innerText": "Kappaṃ neti akappiyoti. Kappāti dve kappā – taṇhākappo ca diṭṭhikappo ca…pe… ayaṃ taṇhākappo…pe… ayaṃ diṭṭhikappo. Tassa taṇhākappo pahīno, diṭṭhikappo paṭinissaṭṭho; taṇhākappassa pahīnattā, diṭṭhikappassa paṭinissaṭṭhattā taṇhākappaṃ vā diṭṭhikappaṃ vā neti na upeti na upagacchati na gaṇhāti na parāmasati nābhinivisatīti – kappaṃ neti. Akappiyoti. Kappāti dve kappā – taṇhākappo ca diṭṭhikappo ca…pe… ayaṃ taṇhākappo…pe… ayaṃ diṭṭhikappo. Tassa taṇhākappo pahīno, diṭṭhikappo paṭinissaṭṭho; tassa taṇhākappassa pahīnattā, diṭṭhikappassa paṭinissaṭṭhattā taṇhākappaṃ vā diṭṭhikappaṃ vā na kappeti na janeti na sañjaneti na nibbatteti nābhinibbattetīti – kappaṃ neti akappiyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Vītagedho ",
      " amaccharī, na ussesu vadate muni;"
    ],
    "innerText": "‘‘Vītagedho amaccharī, na ussesu vadate muni;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Na samesu na omesu, kappaṃ neti akappiyo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "96"
      },
      "."
    ],
    "innerText": "96."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Yassa loke sakaṃ natthi, asatā ca na socati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dhammesu ca na gacchati, sa ve santoti vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yassa"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "loke sakaṃ natthī"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yassā"
      },
      "ti arahato khīṇāsavassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Loke sakaṃ natthī"
      },
      "ti. Tassa mayhaṃ vā idaṃ paresaṃ vā idanti kiñci rūpagataṃ vedanāgataṃ saññāgataṃ saṅkhāragataṃ viññāṇagataṃ, gahitaṃ parāmaṭṭhaṃ abhiniviṭṭhaṃ ajjhositaṃ adhimuttaṃ, natthi na santi…pe… ñāṇagginā daḍḍhanti – yassa loke sakaṃ natthi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asatā ca na socatī"
      },
      "ti. Vipariṇataṃ vā vatthuṃ na socati, vipariṇatasmiṃ vā vatthusmiṃ na socati. Cakkhu me vipariṇatanti na socati. Sotaṃ me… ghānaṃ me… jivhā me… kāyo me… mano me… rūpā me… saddā me… gandhā me… rasā me… phoṭṭhabbā me… kulaṃ me… gaṇo me… āvāso me… lābho me… yaso me… pasaṃsā me… sukhaṃ me… cīvaraṃ me… piṇḍapāto me… senāsanaṃ me… gilānapaccayabhesajjaparikkhāro me… mātā me… pitā me… bhātā me… bhaginī me… putto me… dhītā me… mittā me… amaccā me… ñātakā me… sālohitā me vipariṇatāti na socati na kilamati na paridevati na urattāḷiṃ kandati na sammohaṃ āpajjatīti. Evampi, asatā ca na socati."
    ],
    "innerText": "Yassaloke sakaṃ natthīti. Yassāti arahato khīṇāsavassa. Loke sakaṃ natthīti. Tassa mayhaṃ vā idaṃ paresaṃ vā idanti kiñci rūpagataṃ vedanāgataṃ saññāgataṃ saṅkhāragataṃ viññāṇagataṃ, gahitaṃ parāmaṭṭhaṃ abhiniviṭṭhaṃ ajjhositaṃ adhimuttaṃ, natthi na santi…pe… ñāṇagginā daḍḍhanti – yassa loke sakaṃ natthi. Asatā ca na socatīti. Vipariṇataṃ vā vatthuṃ na socati, vipariṇatasmiṃ vā vatthusmiṃ na socati. Cakkhu me vipariṇatanti na socati. Sotaṃ me… ghānaṃ me… jivhā me… kāyo me… mano me… rūpā me… saddā me… gandhā me… rasā me… phoṭṭhabbā me… kulaṃ me… gaṇo me… āvāso me… lābho me… yaso me… pasaṃsā me… sukhaṃ me… cīvaraṃ me… piṇḍapāto me… senāsanaṃ me… gilānapaccayabhesajjaparikkhāro me… mātā me… pitā me… bhātā me… bhaginī me… putto me… dhītā me… mittā me… amaccā me… ñātakā me… sālohitā me vipariṇatāti na socati na kilamati na paridevati na urattāḷiṃ kandati na sammohaṃ āpajjatīti. Evampi, asatā ca na socati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha vā asantāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[asatāya (sī.), asātāya (syā.)]"
      },
      " dukkhāya vedanāya phuṭṭho pareto samohito samannāgato na ",
      " socati na kilamati na paridevati na urattāḷiṃ ",
      " kandati na sammohaṃ āpajjati. Cakkhurogena phuṭṭho pareto samohito samannāgato na socati na kilamati na paridevati na urattāḷiṃ kandati na sammohaṃ āpajjati, sotarogena… ghānarogena… jivhārogena… kāyarogena… sīsarogena… kaṇṇarogena… mukharogena… dantarogena… kāsena… sāsena… pināsena… ḍāhena… jarena… kucchirogena… mucchāya… pakkhandikāya… sūlena… visūcikāya… kuṭṭhena… gaṇḍena… kilāsena… sosena… apamārena… dadduyā… kaṇḍuyā… kacchuyā… rakhasāya ",
      "… vitacchikāya… lohitena… pittena… madhumehena… aṃsāya… piḷakāya… bhagandalena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[bhagandalāya (sī. syā.)]"
      },
      " … pittasamuṭṭhānena ābādhena… semhasamuṭṭhānena ābādhena… vātasamuṭṭhānena ",
      " ābādhena… sannipātikena ābādhena… utupariṇāmajena ābādhena… visamaparihārajena ābādhena… opakkamikena ābādhena… kammavipākajena ābādhena… sītena… uṇhena… jighacchāya… pipāsāya… ḍaṃsamakasavātātapasarīsapasamphassehi phuṭṭho pareto samohito samannāgato na socati na kilamati na paridevati na urattāḷiṃ kandati na sammohaṃ āpajjatīti. Evampi, asatā ca na socati."
    ],
    "innerText": "Atha vā asantāya [asatāya (sī.), asātāya (syā.)] dukkhāya vedanāya phuṭṭho pareto samohito samannāgato na socati na kilamati na paridevati na urattāḷiṃ kandati na sammohaṃ āpajjati. Cakkhurogena phuṭṭho pareto samohito samannāgato na socati na kilamati na paridevati na urattāḷiṃ kandati na sammohaṃ āpajjati, sotarogena… ghānarogena… jivhārogena… kāyarogena… sīsarogena… kaṇṇarogena… mukharogena… dantarogena… kāsena… sāsena… pināsena… ḍāhena… jarena… kucchirogena… mucchāya… pakkhandikāya… sūlena… visūcikāya… kuṭṭhena… gaṇḍena… kilāsena… sosena… apamārena… dadduyā… kaṇḍuyā… kacchuyā… rakhasāya … vitacchikāya… lohitena… pittena… madhumehena… aṃsāya… piḷakāya… bhagandalena [bhagandalāya (sī. syā.)] … pittasamuṭṭhānena ābādhena… semhasamuṭṭhānena ābādhena… vātasamuṭṭhānena ābādhena… sannipātikena ābādhena… utupariṇāmajena ābādhena… visamaparihārajena ābādhena… opakkamikena ābādhena… kammavipākajena ābādhena… sītena… uṇhena… jighacchāya… pipāsāya… ḍaṃsamakasavātātapasarīsapasamphassehi phuṭṭho pareto samohito samannāgato na socati na kilamati na paridevati na urattāḷiṃ kandati na sammohaṃ āpajjatīti. Evampi, asatā ca na socati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha vā asante asaṃvijjamāne anupalabbhamāne ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[anupalabbhiyamāne (syā. ka.)]"
      },
      " – ‘‘aho vata me taṃ natthi, siyā vata me taṃ, taṃ vatāhaṃ na ca labhāmī’’ti na socati na kilamati na paridevati na urattāḷiṃ kandati na sammohaṃ āpajjatīti. Evampi asatā ca na socati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammesu"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ca na gacchatī"
      },
      "ti na chandāgatiṃ gacchati, na dosāgatiṃ gacchati, na mohāgatiṃ gacchati, na bhayāgatiṃ gacchati, na rāgavasena gacchati, na dosavasena gacchati, na mohavasena gacchati, na mānavasena gacchati, na diṭṭhivasena gacchati, na uddhaccavasena gacchati, na vicikicchāvasena gacchati, na anusayavasena gacchati na ca vaggehi dhammehi yāyati nīyati vuyhati saṃharīyatīti – dhammesu ca na gacchati."
    ],
    "innerText": "Atha vā asante asaṃvijjamāne anupalabbhamāne [anupalabbhiyamāne (syā. ka.)] – ‘‘aho vata me taṃ natthi, siyā vata me taṃ, taṃ vatāhaṃ na ca labhāmī’’ti na socati na kilamati na paridevati na urattāḷiṃ kandati na sammohaṃ āpajjatīti. Evampi asatā ca na socati. Dhammesuca na gacchatīti na chandāgatiṃ gacchati, na dosāgatiṃ gacchati, na mohāgatiṃ gacchati, na bhayāgatiṃ gacchati, na rāgavasena gacchati, na dosavasena gacchati, na mohavasena gacchati, na mānavasena gacchati, na diṭṭhivasena gacchati, na uddhaccavasena gacchati, na vicikicchāvasena gacchati, na anusayavasena gacchati na ca vaggehi dhammehi yāyati nīyati vuyhati saṃharīyatīti – dhammesu ca na gacchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sa ve santoti vuccatī"
      },
      "ti. So santo upasanto vūpasanto nibbuto paṭipassaddhoti vuccati pavuccati kathīyati bhaṇīyati dīpīyati ",
      " voharīyatīti – sa ve santoti vuccati."
    ],
    "innerText": "Sa ve santoti vuccatīti. So santo upasanto vūpasanto nibbuto paṭipassaddhoti vuccati pavuccati kathīyati bhaṇīyati dīpīyati voharīyatīti – sa ve santoti vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Yassa ",
      " loke sakaṃ natthi, asatā ca na socati;"
    ],
    "innerText": "‘‘Yassa loke sakaṃ natthi, asatā ca na socati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dhammesu ca na gacchati, sa ve santoti vuccatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Purābhedasuttaniddeso dasamo."
  }
]