[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "1. Saṅgahavāravaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ ",
      " anekabhedavibhatte nettippakaraṇe yadidaṃ vuttaṃ ‘‘saṅgahavibhāgavāravasena duvidha’’nti, tattha saṅgahavāro ādi. Tassāpi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yaṃ loko pūjayate’’"
      },
      "ti ayaṃ gāthā ādi. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ya"
      },
      "nti aniyamato upayoganiddeso, tassa ‘‘tassā’’ti iminā niyamanaṃ veditabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Loko"
      },
      "ti kattuniddeso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pūjayate"
      },
      "ti kiriyāniddeso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Salokapālo"
      },
      "ti kattuvisesanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sadā"
      },
      "ti kālaniddeso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Namassati cā"
      },
      "ti upacayena kiriyāniddeso ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tassā"
      },
      "ti sāminiddeso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Eta"
      },
      "nti paccattaniddeso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sāsanavara"
      },
      "nti paccattaniddesena niddiṭṭhadhammanidassanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vidūhī"
      },
      "ti karaṇavacanena kattuniddeso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñeyya"
      },
      "nti kammavācakakiriyāniddeso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Naravarassā"
      },
      "ti ‘‘tassā’’ti niyametvā dassitassa sarūpato dassanaṃ."
    ],
    "innerText": "Evaṃ anekabhedavibhatte nettippakaraṇe yadidaṃ vuttaṃ ‘‘saṅgahavibhāgavāravasena duvidha’’nti, tattha saṅgahavāro ādi. Tassāpi ‘‘yaṃ loko pūjayate’’ti ayaṃ gāthā ādi. Tattha yanti aniyamato upayoganiddeso, tassa ‘‘tassā’’ti iminā niyamanaṃ veditabbaṃ. Lokoti kattuniddeso. Pūjayateti kiriyāniddeso. Salokapāloti kattuvisesanaṃ. Sadāti kālaniddeso. Namassati cāti upacayena kiriyāniddeso . Tassāti sāminiddeso. Etanti paccattaniddeso. Sāsanavaranti paccattaniddesena niddiṭṭhadhammanidassanaṃ. Vidūhīti karaṇavacanena kattuniddeso. Ñeyyanti kammavācakakiriyāniddeso. Naravarassāti ‘‘tassā’’ti niyametvā dassitassa sarūpato dassanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha lokiyanti ettha puññāpuññāni tabbipāko cāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "loko,"
      },
      " pajā, sattanikāyoti attho. Loka-saddo hi jātisaddatāya sāmaññavasena niravasesato satte saṅgaṇhāti. Kiñcāpi hi lokasaddo saṅkhārabhājanesupi diṭṭhappayogo, pūjanakiriyāyogyabhūtatāvasena pana sattalokavacano eva idha gahitoti daṭṭhabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pūjayate"
      },
      "ti mānayati, apacāyatīti attho."
    ],
    "innerText": "Tattha lokiyanti ettha puññāpuññāni tabbipāko cāti loko, pajā, sattanikāyoti attho. Loka-saddo hi jātisaddatāya sāmaññavasena niravasesato satte saṅgaṇhāti. Kiñcāpi hi lokasaddo saṅkhārabhājanesupi diṭṭhappayogo, pūjanakiriyāyogyabhūtatāvasena pana sattalokavacano eva idha gahitoti daṭṭhabbaṃ. Pūjayateti mānayati, apacāyatīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Lokaṃ pālentīti lokapālā, cattāro mahārājāno. Lokiyā pana indayamavaruṇakuverā lokapālāti vadanti. Saha lokapālehīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "salokapālo,"
      },
      " ‘‘loko’’ti iminā tulyādhikaraṇaṃ. Atha vā issariyādhipaccena taṃtaṃsattalokassa pālanato rakkhaṇato khattiyacatumahārājasakkasuyāmasantusitasunimmitaparanimmitavasavattimahābrahmādayo lokapālā. Tehi saha taṃtaṃsattanikāyo salokapālo lokoti vutto. Atha vā ‘‘dveme, bhikkhave, sukkā dhammā lokaṃ pālentī’’ti (a. ni. 2.9; itivu. 42) vacanato hirottappadhammā lokapālā. Tehi samannāgato loko ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "salokapālo"
      },
      ". Hirottappasampannā hi pāpagarahino sappurisā dhammacchandavantatāya bhagavati pūjānamakkāraparā hontīti."
    ],
    "innerText": "Lokaṃ pālentīti lokapālā, cattāro mahārājāno. Lokiyā pana indayamavaruṇakuverā lokapālāti vadanti. Saha lokapālehīti salokapālo, ‘‘loko’’ti iminā tulyādhikaraṇaṃ. Atha vā issariyādhipaccena taṃtaṃsattalokassa pālanato rakkhaṇato khattiyacatumahārājasakkasuyāmasantusitasunimmitaparanimmitavasavattimahābrahmādayo lokapālā. Tehi saha taṃtaṃsattanikāyo salokapālo lokoti vutto. Atha vā ‘‘dveme, bhikkhave, sukkā dhammā lokaṃ pālentī’’ti (a. ni. 2.9; itivu. 42) vacanato hirottappadhammā lokapālā. Tehi samannāgato loko salokapālo. Hirottappasampannā hi pāpagarahino sappurisā dhammacchandavantatāya bhagavati pūjānamakkāraparā hontīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sadā"
      },
      "ti ",
      " sabbakālaṃ rattiñceva divā ca, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sadā"
      },
      "ti vā bhagavato dharamānakāle tato parañca. Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sadā"
      },
      "ti abhinīhārato paṭṭhāya yāva sāsanantaradhānā, tato parampi vā. Mahābhinīhārato paṭṭhāya hi mahābodhisattā bodhiyā niyatatāya buddhaṅkurabhūtā sadevakassa lokassa pūjanīyā ceva vandanīyā ca honti. Yathāha bhagavā sumedhabhūto –"
    ],
    "innerText": "Sadāti sabbakālaṃ rattiñceva divā ca, sadāti vā bhagavato dharamānakāle tato parañca. Atha vā sadāti abhinīhārato paṭṭhāya yāva sāsanantaradhānā, tato parampi vā. Mahābhinīhārato paṭṭhāya hi mahābodhisattā bodhiyā niyatatāya buddhaṅkurabhūtā sadevakassa lokassa pūjanīyā ceva vandanīyā ca honti. Yathāha bhagavā sumedhabhūto –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Dīpaṅkaro lokavidū, āhutīnaṃ paṭiggaho;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Mama kammaṃ pakittetvā, dakkhiṇaṃ pādamuddhari."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Ye ",
      " tatthāsuṃ jinaputtā, padakkhiṇamakaṃsu maṃ;"
    ],
    "innerText": "‘‘Ye tatthāsuṃ jinaputtā, padakkhiṇamakaṃsu maṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Devā manussā asurā ca, abhivādetvāna pakkamu’’nti. (bu. vaṃ. 2.75-76);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Namassati cā"
      },
      "ti keci kesañci pūjāsakkārādīni karontāpi tesaṃ apākaṭaguṇatāya namakkāraṃ na karonti, na evaṃ bhagavato, yathābhūtaabbhuggatakittisaddatāya pana bhagavantaṃ sadevako loko pūjayati ceva namassati cāti attho. ‘‘Sadā naramanusso’’ti keci paṭhanti, taṃ na sundaraṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tassā"
      },
      "ti yaṃ sadevako loko pūjayati ceva namassati ca, tassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Eta"
      },
      "nti idāni vattabbaṃ buddhiyaṃ viparivattamānaṃ sāmaññena dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sāsanavara"
      },
      "nti taṃ sarūpato dasseti. Tattha diṭṭhadhammikasamparāyikaparamatthehi yathārahaṃ satte sāsati vineti etenāti sāsanaṃ, tadeva ekantaniyyānaṭṭhena anaññasādhāraṇaguṇatāya ca uttamaṭṭhena taṃtaṃabhipatthitasamiddhihetutāya paṇḍitehi varitabbato vā varaṃ, sāsanameva varanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sāsanavaraṃ. Vidūhī"
      },
      "ti yathāsabhāvato kammakammaphalāni kusalādibhede ca dhamme vidantīti vidū, paṇḍitamanussā, tehi. Ñātabbaṃ, ñāṇamarahatīti vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ñeyyaṃ. Naravarassā"
      },
      "ti purisavarassa, aggapuggalassāti attho."
    ],
    "innerText": "Namassati cāti keci kesañci pūjāsakkārādīni karontāpi tesaṃ apākaṭaguṇatāya namakkāraṃ na karonti, na evaṃ bhagavato, yathābhūtaabbhuggatakittisaddatāya pana bhagavantaṃ sadevako loko pūjayati ceva namassati cāti attho. ‘‘Sadā naramanusso’’ti keci paṭhanti, taṃ na sundaraṃ. Tassāti yaṃ sadevako loko pūjayati ceva namassati ca, tassa. Etanti idāni vattabbaṃ buddhiyaṃ viparivattamānaṃ sāmaññena dasseti. Sāsanavaranti taṃ sarūpato dasseti. Tattha diṭṭhadhammikasamparāyikaparamatthehi yathārahaṃ satte sāsati vineti etenāti sāsanaṃ, tadeva ekantaniyyānaṭṭhena anaññasādhāraṇaguṇatāya ca uttamaṭṭhena taṃtaṃabhipatthitasamiddhihetutāya paṇḍitehi varitabbato vā varaṃ, sāsanameva varanti sāsanavaraṃ. Vidūhīti yathāsabhāvato kammakammaphalāni kusalādibhede ca dhamme vidantīti vidū, paṇḍitamanussā, tehi. Ñātabbaṃ, ñāṇamarahatīti vā ñeyyaṃ. Naravarassāti purisavarassa, aggapuggalassāti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idaṃ vuttaṃ hoti – yo anaññasādhāraṇamahākaruṇāsabbaññutaññāṇādiguṇavisesayogena sadevakena lokena pūjanīyo namassanīyo ca bhagavā arahaṃ sammāsambuddho, tassa loke uttamapuggalassa etaṃ idāni amhehi vibhajitabbahāranayapaṭṭhānavicāraṇavisayabhūtaṃ sāsanaṃ ādikalyāṇatādiguṇasampattiyā varaṃ aggaṃ uttamaṃ nipuṇañāṇagocaratāya paṇḍitavedanīyamevāti. Bhagavato hi vacanaṃ ekagāthāmattampi saccapaṭiccasamuppādakhandhāyatanadhātindriyasatipaṭṭhānādisabhāvadhammaniddhāraṇakkhamatāya ",
      " soḷasahārapañcanayasoḷasaaṭṭhavīsatividhapaṭṭhānavicārayogyabhāvena ca paramagambhīraṃ atthato agādhapāraṃ saṇhasukhumañāṇavisayamevāti. Tenevāha – ‘‘paññavantassāyaṃ dhammo, nāyaṃ dhammo duppaññassā’’ti (dī. ni. 3.358; a. ni. 8.30). Atha vā bhagavato sāsanaṃ pariññākkamena lakkhaṇāvabodhappaṭipattiyā suññatamukhādīhi ogāhitabbattā aviññūnaṃ supinantenapi na visayo hotīti āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘vidūhi ñeyya’’"
      },
      "nti. Tathā ca vuttaṃ – ‘‘etu viññū puriso’’tiādi."
    ],
    "innerText": "Idaṃ vuttaṃ hoti – yo anaññasādhāraṇamahākaruṇāsabbaññutaññāṇādiguṇavisesayogena sadevakena lokena pūjanīyo namassanīyo ca bhagavā arahaṃ sammāsambuddho, tassa loke uttamapuggalassa etaṃ idāni amhehi vibhajitabbahāranayapaṭṭhānavicāraṇavisayabhūtaṃ sāsanaṃ ādikalyāṇatādiguṇasampattiyā varaṃ aggaṃ uttamaṃ nipuṇañāṇagocaratāya paṇḍitavedanīyamevāti. Bhagavato hi vacanaṃ ekagāthāmattampi saccapaṭiccasamuppādakhandhāyatanadhātindriyasatipaṭṭhānādisabhāvadhammaniddhāraṇakkhamatāya soḷasahārapañcanayasoḷasaaṭṭhavīsatividhapaṭṭhānavicārayogyabhāvena ca paramagambhīraṃ atthato agādhapāraṃ saṇhasukhumañāṇavisayamevāti. Tenevāha – ‘‘paññavantassāyaṃ dhammo, nāyaṃ dhammo duppaññassā’’ti (dī. ni. 3.358; a. ni. 8.30). Atha vā bhagavato sāsanaṃ pariññākkamena lakkhaṇāvabodhappaṭipattiyā suññatamukhādīhi ogāhitabbattā aviññūnaṃ supinantenapi na visayo hotīti āha – ‘‘vidūhi ñeyya’’nti. Tathā ca vuttaṃ – ‘‘etu viññū puriso’’tiādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Apare ",
      " pana ‘‘taṃ tassa sāsanavara’’nti paṭhanti, tesaṃ matena yaṃ-saddo sāsana-saddena samānādhikaraṇoti daṭṭhabbo. Idaṃ vuttaṃ hoti yaṃ sāsanavaraṃ salokapālo loko pūjayati namassati ca, taṃ sāsanavaraṃ vidūhi ñātabbanti. Imasmiñca naye lokapāla-saddena bhagavāpi vuccati. Bhagavā hi lokaggatāyakattā nippariyāyena lokapālo, tasmā ‘‘tassā’’ti lokapālassa satthunoti attho. Salokapāloti cettha lokapāla-saddo guṇībhūtopi satthuvisayattā sāsana-saddāpekkhatāya sāmibhāvena sambandhīvisesabhūto padhānabhūto viya paṭiniddesaṃ arahatīti."
    ],
    "innerText": "Apare pana ‘‘taṃ tassa sāsanavara’’nti paṭhanti, tesaṃ matena yaṃ-saddo sāsana-saddena samānādhikaraṇoti daṭṭhabbo. Idaṃ vuttaṃ hoti yaṃ sāsanavaraṃ salokapālo loko pūjayati namassati ca, taṃ sāsanavaraṃ vidūhi ñātabbanti. Imasmiñca naye lokapāla-saddena bhagavāpi vuccati. Bhagavā hi lokaggatāyakattā nippariyāyena lokapālo, tasmā ‘‘tassā’’ti lokapālassa satthunoti attho. Salokapāloti cettha lokapāla-saddo guṇībhūtopi satthuvisayattā sāsana-saddāpekkhatāya sāmibhāvena sambandhīvisesabhūto padhānabhūto viya paṭiniddesaṃ arahatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kathaṃ pana sayaṃ dhammassāmī bhagavā dhammaṃ pūjayatīti? Nāyaṃ virodho. Dhammagaruno hi buddhā bhagavanto, te sabbakālaṃ dhammaṃ apacāyamānāva viharantīti. Vuttañhetaṃ – ‘‘yaṃnūnāhaṃ yvāyaṃ dhammo mayā abhisambuddho, tameva dhammaṃ sakkatvā garuṃ katvā upanissāya vihareyya’’nti (saṃ. ni. 1.173; a. ni. 4.21)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Api ca bhagavato dhammapūjanā sattasattāhappaṭipattiādīhi dīpetabbā. Dhammassāmīti ca dhammena sadevakassa lokassa sāmīti attho, na dhammassa sāmīti. Evampi namassatīti vacanaṃ na yujjati. Na hi bhagavā kañci namassatīti, esopi niddoso. Na hi namassatīti padassa namakkāraṃ karotīti ayameva attho, atha kho garukaraṇena tanninno tappoṇo tappabbhāroti ayampi attho labbhati. Bhagavā ca dhammagarutāya sabbakālaṃ dhammaninnapoṇapabbhārabhāvena viharatīti. Ayañca attho ‘‘yena sudaṃ svāhaṃ niccakappaṃ viharāmī’’ti (ma. ni. 1.387) evamādīhi suttapadehi dīpetabbo. ‘‘Vidūhi neyya’’ntipi ",
      " pāṭho, tassa paṇḍitehi saparasantānesu netabbaṃ pāpetabbanti attho. Tattha attasantāne pāpanaṃ bujjhanaṃ, parasantāne bodhananti daṭṭhabbaṃ."
    ],
    "innerText": "Api ca bhagavato dhammapūjanā sattasattāhappaṭipattiādīhi dīpetabbā. Dhammassāmīti ca dhammena sadevakassa lokassa sāmīti attho, na dhammassa sāmīti. Evampi namassatīti vacanaṃ na yujjati. Na hi bhagavā kañci namassatīti, esopi niddoso. Na hi namassatīti padassa namakkāraṃ karotīti ayameva attho, atha kho garukaraṇena tanninno tappoṇo tappabbhāroti ayampi attho labbhati. Bhagavā ca dhammagarutāya sabbakālaṃ dhammaninnapoṇapabbhārabhāvena viharatīti. Ayañca attho ‘‘yena sudaṃ svāhaṃ niccakappaṃ viharāmī’’ti (ma. ni. 1.387) evamādīhi suttapadehi dīpetabbo. ‘‘Vidūhi neyya’’ntipi pāṭho, tassa paṇḍitehi saparasantānesu netabbaṃ pāpetabbanti attho. Tattha attasantāne pāpanaṃ bujjhanaṃ, parasantāne bodhananti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ bhagavato sadevakassa lokassa pūjanīyavandanīyabhāvo aggapuggalabhāvo ca vuccamāno guṇavisiṭṭhataṃ dīpeti, sā ca guṇavisiṭṭhatā mahābodhiyā veditabbā. Āsavakkhayañāṇapadaṭṭhānañhi sabbaññutaññāṇaṃ sabbaññutaññāṇapadaṭṭhānañca āsavakkhayañāṇaṃ ‘‘mahābodhī’’ti vuccati. Sā aviparītadhammadesanato tathāgate suppatiṭṭhitāti viññāyati ",
      ". Na hi savāsananiravasesakilesappahānaṃ anāvaraṇañāṇañca vinā tādisī dhammadesanā sambhavati. Iccassa catuvesārajjayogo. Tena dasabalachaasādhāraṇañāṇaaṭṭhārasāveṇikabuddhadhammādisakalasabbaññuguṇapāripūrī pakāsitā hoti. Etādisī ca guṇavibhūti mahākaruṇāpubbaṅgamaṃ abhinīhārasampattiṃ purassaraṃ katvā sampāditaṃ samattiṃsapāramisaṅkhātaṃ puññañāṇasambhāramantarena na upalabbhatīti hetusampadāpi atthato vibhāvitā hotīti evaṃ bhagavato tīsupi avatthāsu sabbasattānaṃ ekantahitappaṭilābhahetubhūtā ādimajjhapariyosānakalyāṇā niravasesā buddhaguṇā imāya gāthāya pakāsitāti veditabbaṃ."
    ],
    "innerText": "Evaṃ bhagavato sadevakassa lokassa pūjanīyavandanīyabhāvo aggapuggalabhāvo ca vuccamāno guṇavisiṭṭhataṃ dīpeti, sā ca guṇavisiṭṭhatā mahābodhiyā veditabbā. Āsavakkhayañāṇapadaṭṭhānañhi sabbaññutaññāṇaṃ sabbaññutaññāṇapadaṭṭhānañca āsavakkhayañāṇaṃ ‘‘mahābodhī’’ti vuccati. Sā aviparītadhammadesanato tathāgate suppatiṭṭhitāti viññāyati . Na hi savāsananiravasesakilesappahānaṃ anāvaraṇañāṇañca vinā tādisī dhammadesanā sambhavati. Iccassa catuvesārajjayogo. Tena dasabalachaasādhāraṇañāṇaaṭṭhārasāveṇikabuddhadhammādisakalasabbaññuguṇapāripūrī pakāsitā hoti. Etādisī ca guṇavibhūti mahākaruṇāpubbaṅgamaṃ abhinīhārasampattiṃ purassaraṃ katvā sampāditaṃ samattiṃsapāramisaṅkhātaṃ puññañāṇasambhāramantarena na upalabbhatīti hetusampadāpi atthato vibhāvitā hotīti evaṃ bhagavato tīsupi avatthāsu sabbasattānaṃ ekantahitappaṭilābhahetubhūtā ādimajjhapariyosānakalyāṇā niravasesā buddhaguṇā imāya gāthāya pakāsitāti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dutiyanaye pana yasmā sikkhattayasaṅgahaṃ saphalaṃ ariyamaggasāsanaṃ tassa ārammaṇabhūtañca amatadhātuṃ tadadhigamūpāyañca pubbabhāgapaṭipattisāsanaṃ tadatthaparidīpanañca pariyattisāsanaṃ yathārahaṃ saccābhisamayavasena abhisamento svākkhātatādiguṇavisesayuttataṃ manasikaronto sakkaccaṃ savanadhāraṇaparipucchādīhi paricayaṃ karonto ca sadevako loko pūjayati nāma. Lokanātho ca sammāsambodhippattiyā veneyyānaṃ sakkaccaṃ dhammadesanena ‘‘ariyaṃ vo, bhikkhave, sammāsamādhiṃ desessāmi’’ (ma. ni. 3.136; saṃ. ni. 5.28; peṭako. 24), ‘‘maggānaṭṭhaṅgiko seṭṭho’’ (dha. pa. 273; kathā. 872; netti. 125; peṭako. 30), ‘‘yāvatā, bhikkhave, dhammā saṅkhatā vā asaṅkhatā vā, virāgo tesaṃ aggamakkhāyati’’ (itivu. 90; a. ni. 4.34), ‘‘khayaṃ virāgaṃ amataṃ paṇītaṃ’’ (khu. pā. 6.4; su. ni. 227), ‘‘ekāyano ayaṃ, bhikkhave, maggo sattānaṃ visuddhiyā’’ (dī. ni. 2.373; ma. ni. 1.106; saṃ. ni. 5.367), ‘‘dhammaṃ vo, bhikkhave, desessāmi ādikalyāṇa’’ntiādīhi (ma. ni. 3.420; netti. 5) vacanehi thomanena ca pūjayati nāma. Tasmā sāsanavarassa pūjanīyabhāvo idha vuccamāno anavasesato dhammaguṇe dīpetīti ye ariyabhāvādayo niyyānādayo khayavirāgādayo madanimmadanādayo asaṅkhatādayo svākkhātatādayo ",
      " ādikalyāṇatādayo ca anekehi suttapadehi paveditā aneke dhammaguṇā, te niravasesato imāya gāthāya pakāsitāti veditabbā."
    ],
    "innerText": "Dutiyanaye pana yasmā sikkhattayasaṅgahaṃ saphalaṃ ariyamaggasāsanaṃ tassa ārammaṇabhūtañca amatadhātuṃ tadadhigamūpāyañca pubbabhāgapaṭipattisāsanaṃ tadatthaparidīpanañca pariyattisāsanaṃ yathārahaṃ saccābhisamayavasena abhisamento svākkhātatādiguṇavisesayuttataṃ manasikaronto sakkaccaṃ savanadhāraṇaparipucchādīhi paricayaṃ karonto ca sadevako loko pūjayati nāma. Lokanātho ca sammāsambodhippattiyā veneyyānaṃ sakkaccaṃ dhammadesanena ‘‘ariyaṃ vo, bhikkhave, sammāsamādhiṃ desessāmi’’ (ma. ni. 3.136; saṃ. ni. 5.28; peṭako. 24), ‘‘maggānaṭṭhaṅgiko seṭṭho’’ (dha. pa. 273; kathā. 872; netti. 125; peṭako. 30), ‘‘yāvatā, bhikkhave, dhammā saṅkhatā vā asaṅkhatā vā, virāgo tesaṃ aggamakkhāyati’’ (itivu. 90; a. ni. 4.34), ‘‘khayaṃ virāgaṃ amataṃ paṇītaṃ’’ (khu. pā. 6.4; su. ni. 227), ‘‘ekāyano ayaṃ, bhikkhave, maggo sattānaṃ visuddhiyā’’ (dī. ni. 2.373; ma. ni. 1.106; saṃ. ni. 5.367), ‘‘dhammaṃ vo, bhikkhave, desessāmi ādikalyāṇa’’ntiādīhi (ma. ni. 3.420; netti. 5) vacanehi thomanena ca pūjayati nāma. Tasmā sāsanavarassa pūjanīyabhāvo idha vuccamāno anavasesato dhammaguṇe dīpetīti ye ariyabhāvādayo niyyānādayo khayavirāgādayo madanimmadanādayo asaṅkhatādayo svākkhātatādayo ādikalyāṇatādayo ca anekehi suttapadehi paveditā aneke dhammaguṇā, te niravasesato imāya gāthāya pakāsitāti veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yasmā ",
      " pana ariyasaccappaṭivedhena samugghāṭitasammohāyeva paramatthato paṇḍitā bālyādisamatikkamanato, tasmā bhāvitalokuttaramaggā sacchikatasāmaññaphalā ca ariyapuggalā visesato vidūti vuccanti. Te hi yathāvuttasāsanavaraṃ aviparītato ñātuṃ netuñca saparasantāne sakkuṇantīti aṭṭhaariyapuggalasamūhassa paramatthasaṅghassāpi idha gahitattā ye suppaṭipannatādayo anekehi suttapadehi saṃvaṇṇitā ariyasaṅghaguṇā, tepi niravasesato idha pakāsitāti veditabbā."
    ],
    "innerText": "Yasmā pana ariyasaccappaṭivedhena samugghāṭitasammohāyeva paramatthato paṇḍitā bālyādisamatikkamanato, tasmā bhāvitalokuttaramaggā sacchikatasāmaññaphalā ca ariyapuggalā visesato vidūti vuccanti. Te hi yathāvuttasāsanavaraṃ aviparītato ñātuṃ netuñca saparasantāne sakkuṇantīti aṭṭhaariyapuggalasamūhassa paramatthasaṅghassāpi idha gahitattā ye suppaṭipannatādayo anekehi suttapadehi saṃvaṇṇitā ariyasaṅghaguṇā, tepi niravasesato idha pakāsitāti veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ paṭhamagāthāya sātisayaṃ ratanattayaguṇaparidīpanaṃ katvā idāni –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sabbapāpassa akaraṇaṃ, kusalassa upasampadā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sacittapariyodapanaṃ, etaṃ buddhāna sāsana’’nti. (dī. ni. 2.90; dha. pa. 183; netti. 30, 50, 116, 124) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Vacanato saṅkhepato sikkhattayasaṅgahaṃ sāsanaṃ, taṃ pana sikkhattayaṃ ñāṇavisesavisayabhāvabhedato avatthābhedato ca tividhaṃ hoti. Kathaṃ? Sutamayañāṇagocaro ca yo ‘‘pariyattisaddhammo’’ti vuccati. Cintāmayañāṇagocaro ca yo ākāraparivitakkadiṭṭhinijjhānakkhantīhi gahetabbākāro vimuttāyatanaviseso ‘‘paṭipattisaddhammo’’ti vuccati. Vipassanāñāṇādisahagato bhāvanāmayañāṇagocaro ca yo ‘‘paṭivedhasaddhammo’’ti vuccati. Evaṃ tividhampi sāsanaṃ sāsanavaranti padena saṅgaṇhitvā tattha yaṃ paṭhamaṃ, taṃ itaresaṃ adhigamūpāyoti sabbasāsanamūlabhūtaṃ attano pakaraṇassa ca visayabhūtaṃ pariyattisāsanameva tāva saṅkhepato vibhajanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘dvādasa padānī’’"
      },
      "ti gāthamāha."
    ],
    "innerText": "Vacanato saṅkhepato sikkhattayasaṅgahaṃ sāsanaṃ, taṃ pana sikkhattayaṃ ñāṇavisesavisayabhāvabhedato avatthābhedato ca tividhaṃ hoti. Kathaṃ? Sutamayañāṇagocaro ca yo ‘‘pariyattisaddhammo’’ti vuccati. Cintāmayañāṇagocaro ca yo ākāraparivitakkadiṭṭhinijjhānakkhantīhi gahetabbākāro vimuttāyatanaviseso ‘‘paṭipattisaddhammo’’ti vuccati. Vipassanāñāṇādisahagato bhāvanāmayañāṇagocaro ca yo ‘‘paṭivedhasaddhammo’’ti vuccati. Evaṃ tividhampi sāsanaṃ sāsanavaranti padena saṅgaṇhitvā tattha yaṃ paṭhamaṃ, taṃ itaresaṃ adhigamūpāyoti sabbasāsanamūlabhūtaṃ attano pakaraṇassa ca visayabhūtaṃ pariyattisāsanameva tāva saṅkhepato vibhajanto ‘‘dvādasa padānī’’ti gāthamāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dvādasā"
      },
      "ti gaṇanaparicchedo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Padānī"
      },
      "ti paricchinnadhammanidassanaṃ. Tesu byañjanapadāni pajjati attho etehīti padāni. Atthapadāni pana pajjanti ñāyantīti padāni. Ubhayampi vā ubhayathā yojetabbaṃ byañjanapadānampi aviparītaṃ paṭipajjitabbattā, atthapadānaṃ uttarivisesādhigamassa ",
      " kāraṇabhāvato, tāni padāni parato pāḷiyaññeva āvi bhavissantīti tattheva vaṇṇayissāma. Atthasūcanādiatthato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "suttaṃ"
      },
      ". Vuttañhetaṃ saṅgahesu –"
    ],
    "innerText": "Tattha dvādasāti gaṇanaparicchedo. Padānīti paricchinnadhammanidassanaṃ. Tesu byañjanapadāni pajjati attho etehīti padāni. Atthapadāni pana pajjanti ñāyantīti padāni. Ubhayampi vā ubhayathā yojetabbaṃ byañjanapadānampi aviparītaṃ paṭipajjitabbattā, atthapadānaṃ uttarivisesādhigamassa kāraṇabhāvato, tāni padāni parato pāḷiyaññeva āvi bhavissantīti tattheva vaṇṇayissāma. Atthasūcanādiatthato suttaṃ. Vuttañhetaṃ saṅgahesu –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Atthānaṃ sūcanato, suvuttato savanatotha sūdanato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Suttāṇā suttasabhāgato ca, ‘sutta’nti akkhāta’’nti. (pārā. aṭṭha. 1.paṭhamamahāsaṅgītikathā; dī. ni. aṭṭha. 1.paṭhamamahāsaṅgītikathā; dha. sa. aṭṭha. nidānakathā);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tadetaṃ ",
      " tattha suttapiṭakavasena āgataṃ, idha pana piṭakattayavasena yojetabbaṃ. ‘‘Dvādasa padāni sutta’’nti vuttaṃ, yaṃ pariyattisāsananti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃ sabba"
      },
      "nti taṃ ‘‘sutta’’nti vuttaṃ sakalaṃ buddhavacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Byañjanañca attho cā"
      },
      "ti byañjanañceva tadattho ca. Yato ‘‘dvādasa padāni sutta’’nti vuttaṃ. Idaṃ vuttaṃ hoti – atthasūcanādito suttaṃ pariyattidhammo, tañca sabbaṃ atthato dvādasa padāni cha byañjanapadāni ceva cha atthapadāni cāti. Atha vā yadetaṃ ‘‘sāsanavara’’nti vuttaṃ, taṃ sabbaṃ suttaṃ, pariyattisāsanassa adhippetattā. Atthato pana dvādasa padāni, byañjanatthapadasamudāyabhāvato. Yathāha – ‘‘byañjanañca attho cā’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃ viññeyyaṃ ubhaya"
      },
      "nti yasmiṃ byañjane atthe ca vacanavacanīyabhāvena sambandhe suttavohāro, tadubhayaṃ sarūpato viññātabbaṃ tattha katamaṃ byañjanaṃ katamo atthoti? Tenevāha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ko attho byañjanaṃ katama’’"
      },
      "nti."
    ],
    "innerText": "Tadetaṃ tattha suttapiṭakavasena āgataṃ, idha pana piṭakattayavasena yojetabbaṃ. ‘‘Dvādasa padāni sutta’’nti vuttaṃ, yaṃ pariyattisāsananti attho. Taṃ sabbanti taṃ ‘‘sutta’’nti vuttaṃ sakalaṃ buddhavacanaṃ. Byañjanañca attho cāti byañjanañceva tadattho ca. Yato ‘‘dvādasa padāni sutta’’nti vuttaṃ. Idaṃ vuttaṃ hoti – atthasūcanādito suttaṃ pariyattidhammo, tañca sabbaṃ atthato dvādasa padāni cha byañjanapadāni ceva cha atthapadāni cāti. Atha vā yadetaṃ ‘‘sāsanavara’’nti vuttaṃ, taṃ sabbaṃ suttaṃ, pariyattisāsanassa adhippetattā. Atthato pana dvādasa padāni, byañjanatthapadasamudāyabhāvato. Yathāha – ‘‘byañjanañca attho cā’’ti. Taṃ viññeyyaṃ ubhayanti yasmiṃ byañjane atthe ca vacanavacanīyabhāvena sambandhe suttavohāro, tadubhayaṃ sarūpato viññātabbaṃ tattha katamaṃ byañjanaṃ katamo atthoti? Tenevāha – ‘‘ko attho byañjanaṃ katama’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ ‘‘sāsanavara’’nti vuttassa suttassa pariyattibhāvaṃ tassa ca atthabyañjanapadabhāvena veditabbataṃ dassetvā idāni tassa pavicayupāyaṃ nettippakaraṇaṃ padatthavibhāgena dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘soḷasahārā’’"
      },
      "ti gāthamāha."
    ],
    "innerText": "Evaṃ ‘‘sāsanavara’’nti vuttassa suttassa pariyattibhāvaṃ tassa ca atthabyañjanapadabhāvena veditabbataṃ dassetvā idāni tassa pavicayupāyaṃ nettippakaraṇaṃ padatthavibhāgena dassetuṃ ‘‘soḷasahārā’’ti gāthamāha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha soḷasa hārā etissāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "soḷasahārā. Pañcanayā aṭṭhārasamūlapadā"
      },
      "ti etthāpi eseva nayo. Atha vā soḷasa hārā soḷasahārā. Evaṃ itaratthāpi. Hāranayamūlapadāni eva hi saṅkhepato vitthārato ca bhāsitāni nettīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sāsanassa pariyeṭṭhī"
      },
      "ti sāsanassa atthapariyesanā, pariyattisāsanassa atthasaṃvaṇṇanāti attho, sakalasseva vā sāsanassa atthavicāraṇāti attho. Paṭipattipaṭivedhepi hi nettinayānusārena adhigacchantīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahakaccānenā"
      },
      "ti kaccoti purātano isi, tassa vaṃsālaṅkārabhūtoyaṃ mahāthero ‘‘kaccāno’’ti vuccati. Mahakaccānoti pana ",
      " pūjāvacanaṃ, yathā mahāmoggallānoti, ‘‘kaccāyanagottaniddiṭṭhā’’tipi pāṭho. Ayañca gāthā nettiṃ saṅgāyantehi pakaraṇatthasaṅgaṇhanavasena ṭhapitāti daṭṭhabbā. Yathā cāyaṃ, evaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hāravibhaṅgavāre"
      },
      " taṃtaṃhāraniddesanigamane ‘‘tenāha āyasmā’’tiādivacanaṃ, hārādisamudāyabhūtāyaṃ nettiyaṃ byañjanatthasamudāye ca sutte kiṃ kena viciyatīti vicāraṇāyaṃ āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘hārā byañjanavicayo’’"
      },
      "tiādi."
    ],
    "innerText": "Tattha soḷasa hārā etissāti soḷasahārā. Pañcanayā aṭṭhārasamūlapadāti etthāpi eseva nayo. Atha vā soḷasa hārā soḷasahārā. Evaṃ itaratthāpi. Hāranayamūlapadāni eva hi saṅkhepato vitthārato ca bhāsitāni nettīti. Sāsanassa pariyeṭṭhīti sāsanassa atthapariyesanā, pariyattisāsanassa atthasaṃvaṇṇanāti attho, sakalasseva vā sāsanassa atthavicāraṇāti attho. Paṭipattipaṭivedhepi hi nettinayānusārena adhigacchantīti. Mahakaccānenāti kaccoti purātano isi, tassa vaṃsālaṅkārabhūtoyaṃ mahāthero ‘‘kaccāno’’ti vuccati. Mahakaccānoti pana pūjāvacanaṃ, yathā mahāmoggallānoti, ‘‘kaccāyanagottaniddiṭṭhā’’tipi pāṭho. Ayañca gāthā nettiṃ saṅgāyantehi pakaraṇatthasaṅgaṇhanavasena ṭhapitāti daṭṭhabbā. Yathā cāyaṃ, evaṃ hāravibhaṅgavāre taṃtaṃhāraniddesanigamane ‘‘tenāha āyasmā’’tiādivacanaṃ, hārādisamudāyabhūtāyaṃ nettiyaṃ byañjanatthasamudāye ca sutte kiṃ kena viciyatīti vicāraṇāyaṃ āha – ‘‘hārā byañjanavicayo’’tiādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      " soḷasapi hārā mūlapadaniddhāraṇamantarena byañjanamukheneva suttassa saṃvaṇṇanā honti, na nayā viya mūlapadasaṅkhātasabhāvadhammaniddhāraṇamukhenāti te ‘‘byañjanavicayo suttassā’’ti vuttā. Atthanayā pana yathāvuttaatthamukheneva suttassa atthasampaṭipattiyā hontīti āha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘nayā tayo ca suttattho’’"
      },
      "ti. Ayañca vicāraṇā paratopi āgamissati. Keci ‘‘nayo cā’’ti paṭhanti, taṃ na sundaraṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ubhayaṃ pariggahīta"
      },
      "nti hārā nayā cāti etaṃ ubhayaṃ suttassa atthaniddhāraṇavasena parisamantato gahitaṃ sabbathā sutte yojitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vuccati suttaṃ"
      },
      " vadati saṃvaṇṇeti. Kathaṃ? ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathāsuttaṃ"
      },
      " suttānurūpaṃ, yaṃ suttaṃ yathā saṃvaṇṇetabbaṃ, tathā saṃvaṇṇetīti attho. Yaṃ yaṃ suttanti vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yathāsuttaṃ,"
      },
      " sabbaṃ suttanti attho. Nettinayena hi saṃvaṇṇetuṃ asakkuṇeyyaṃ nāma suttaṃ natthīti."
    ],
    "innerText": "Tattha soḷasapi hārā mūlapadaniddhāraṇamantarena byañjanamukheneva suttassa saṃvaṇṇanā honti, na nayā viya mūlapadasaṅkhātasabhāvadhammaniddhāraṇamukhenāti te ‘‘byañjanavicayo suttassā’’ti vuttā. Atthanayā pana yathāvuttaatthamukheneva suttassa atthasampaṭipattiyā hontīti āha – ‘‘nayā tayo ca suttattho’’ti. Ayañca vicāraṇā paratopi āgamissati. Keci ‘‘nayo cā’’ti paṭhanti, taṃ na sundaraṃ. Ubhayaṃ pariggahītanti hārā nayā cāti etaṃ ubhayaṃ suttassa atthaniddhāraṇavasena parisamantato gahitaṃ sabbathā sutte yojitaṃ. Vuccati suttaṃ vadati saṃvaṇṇeti. Kathaṃ? Yathāsuttaṃ suttānurūpaṃ, yaṃ suttaṃ yathā saṃvaṇṇetabbaṃ, tathā saṃvaṇṇetīti attho. Yaṃ yaṃ suttanti vā yathāsuttaṃ, sabbaṃ suttanti attho. Nettinayena hi saṃvaṇṇetuṃ asakkuṇeyyaṃ nāma suttaṃ natthīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni yaṃ vuttaṃ – ‘‘sāsanavaraṃ vidūhi ñeyya’’nti, tattha nettisaṃvaṇṇanāya visayabhūtaṃ pariyattidhammameva pakārantarena niyametvā dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yā cevā’’"
      },
      "tiādi vuttaṃ."
    ],
    "innerText": "Idāni yaṃ vuttaṃ – ‘‘sāsanavaraṃ vidūhi ñeyya’’nti, tattha nettisaṃvaṇṇanāya visayabhūtaṃ pariyattidhammameva pakārantarena niyametvā dassetuṃ ‘‘yā cevā’’tiādi vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha atthesu kataparicchedo byañjanappabandho desanā, yo pāṭhoti vuccati. Tadattho desitaṃ tāya desanāya pabodhitattā. Tadubhayañca vimuttāyatanasīsena paricayaṃ karontānaṃ anupādāparinibbānapariyosānānaṃ sampattīnaṃ hetubhāvato ekantena viññeyyaṃ, tadubhayavinimuttassa vā ñeyyassa abhāvato tadeva dvayaṃ viññeyyanti imamatthaṃ dasseti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yā ceva…pe… viññeyya"
      },
      "nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatrā"
      },
      "ti tasmiṃ vijānane sādhetabbe, nipphādetabbe cetaṃ bhummaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayamānupubbī"
      },
      "ti ayaṃ vakkhamānā anupubbi hāranayānaṃ anukkamo, anukkamena vakkhamānā hāranayāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Navavidhasuttantapariyeṭṭhī"
      },
      "ti suttādivasena navaṅgassa sāsanassa pariyesanā, atthavicāraṇāti attho. Sāmiatthe vā etaṃ paccattaṃ navavidhasuttantapariyeṭṭhiyā anupubbīti. Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anupubbī"
      },
      "ti karaṇatthe paccattaṃ. Idaṃ vuttaṃ hoti – yathāvuttavijānane sādhetabbe vakkhamānāya hāranayānupubbiyā ayaṃ navavidhasuttantassa atthapariyesanāti."
    ],
    "innerText": "Tattha atthesu kataparicchedo byañjanappabandho desanā, yo pāṭhoti vuccati. Tadattho desitaṃ tāya desanāya pabodhitattā. Tadubhayañca vimuttāyatanasīsena paricayaṃ karontānaṃ anupādāparinibbānapariyosānānaṃ sampattīnaṃ hetubhāvato ekantena viññeyyaṃ, tadubhayavinimuttassa vā ñeyyassa abhāvato tadeva dvayaṃ viññeyyanti imamatthaṃ dasseti yā ceva…pe… viññeyyanti. Tatrāti tasmiṃ vijānane sādhetabbe, nipphādetabbe cetaṃ bhummaṃ. Ayamānupubbīti ayaṃ vakkhamānā anupubbi hāranayānaṃ anukkamo, anukkamena vakkhamānā hāranayāti attho. Navavidhasuttantapariyeṭṭhīti suttādivasena navaṅgassa sāsanassa pariyesanā, atthavicāraṇāti attho. Sāmiatthe vā etaṃ paccattaṃ navavidhasuttantapariyeṭṭhiyā anupubbīti. Atha vā anupubbīti karaṇatthe paccattaṃ. Idaṃ vuttaṃ hoti – yathāvuttavijānane sādhetabbe vakkhamānāya hāranayānupubbiyā ayaṃ navavidhasuttantassa atthapariyesanāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Etthāha ",
      " – kathaṃ panettha geyyaṅgādīnaṃ suttabhāvo, suttabhāve ca tesaṃ kathaṃ sāsanassa navaṅgabhāvo. Yañca saṅgahesu vuccati ‘‘sagāthakaṃ suttaṃ geyyaṃ, niggāthakaṃ suttaṃ veyyākaraṇa’’nti, tathā ca sati suttaṅgameva na ",
      " siyā. Athāpi visuṃ suttaṅgaṃ siyā, maṅgalasuttādīnaṃ (khu. pā. 5.1 ādayo; su. ni. 261 ādayo) suttaṅgasaṅgaho na siyā, gāthābhāvato dhammapadādīnaṃ viya, geyyaṅgasaṅgaho vā siyā, sagāthakattā sagāthāvaggassa viya, tathā ubhatovibhaṅgādīsu sagāthakappadesānanti. Vuccate –"
    ],
    "innerText": "Etthāha – kathaṃ panettha geyyaṅgādīnaṃ suttabhāvo, suttabhāve ca tesaṃ kathaṃ sāsanassa navaṅgabhāvo. Yañca saṅgahesu vuccati ‘‘sagāthakaṃ suttaṃ geyyaṃ, niggāthakaṃ suttaṃ veyyākaraṇa’’nti, tathā ca sati suttaṅgameva na siyā. Athāpi visuṃ suttaṅgaṃ siyā, maṅgalasuttādīnaṃ (khu. pā. 5.1 ādayo; su. ni. 261 ādayo) suttaṅgasaṅgaho na siyā, gāthābhāvato dhammapadādīnaṃ viya, geyyaṅgasaṅgaho vā siyā, sagāthakattā sagāthāvaggassa viya, tathā ubhatovibhaṅgādīsu sagāthakappadesānanti. Vuccate –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Suttanti sāmaññavidhi, visesavidhayo pare;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sanimittā niruḷhattā, sahatāññena nāññato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sabbassāpi hi buddhavacanassa suttanti ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sāmaññavidhi"
      },
      ". Tathā hi ‘‘ettakaṃ tassa bhagavato suttāgataṃ suttapariyāpannaṃ (pāci. 1242), sāvatthiyā suttavibhaṅge, sakavāde pañca suttasatānī’’tiādivacanato vinayābhidhammapariyattivisesepi suttavohāro dissati. Tadekadesesu pana geyyādayo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "visesavidhayo"
      },
      " tena tena nimittena patiṭṭhitā. Tathā hi geyyassa sagāthakattaṃ tabbhāvanimittaṃ. Lokepi hi sasilokaṃ sagāthakaṃ cuṇṇiyaganthaṃ geyya’’nti vadanti. Gāthāvirahe pana sati pucchitvā vissajjanabhāvo veyyākaraṇassa. Pucchāvissajjanañhi ‘‘byākaraṇa’’nti vuccati. Byākaraṇameva veyyākaraṇanti. Evaṃ sante sagāthakādīnampi pañhāvissajjanavasena pavattānaṃ veyyākaraṇabhāvo āpajjatīti? Nāpajjati, geyyādisaññānaṃ anokāsabhāvato ‘‘gāthāvirahe satī’’ti visesitattā ca. Tathā hi dhammapadādīsu kevalaṃ gāthābandhesu sagāthakattepi somanassañāṇamayikagāthāyuttesu ‘‘vuttañheta’’ntiādivacanasambandhesu abbhutadhammapaṭisaṃyuttesu ca suttavisesesu yathākkamaṃ gāthāudānaitivuttakaabbhutadhammasaññā patiṭṭhitā, tathā satipi gāthābandhabhāve bhagavato atītāsu jātīsu cariyānubhāvappakāsakesu jātakasaññā. Satipi pañhāvissajjanabhāve sagāthakatte ca kesuci suttantesu vedassa labhāpanato vedallasaññā patiṭṭhitāti evaṃ tena tena sagāthakattādinā nimittena tesu tesu suttavisesesu geyyaṅgādisaññā patiṭṭhitāti visesavidhayo suttaṅgato pare geyyādayo."
    ],
    "innerText": "Sabbassāpi hi buddhavacanassa suttanti ayaṃ sāmaññavidhi. Tathā hi ‘‘ettakaṃ tassa bhagavato suttāgataṃ suttapariyāpannaṃ (pāci. 1242), sāvatthiyā suttavibhaṅge, sakavāde pañca suttasatānī’’tiādivacanato vinayābhidhammapariyattivisesepi suttavohāro dissati. Tadekadesesu pana geyyādayo visesavidhayo tena tena nimittena patiṭṭhitā. Tathā hi geyyassa sagāthakattaṃ tabbhāvanimittaṃ. Lokepi hi sasilokaṃ sagāthakaṃ cuṇṇiyaganthaṃ geyya’’nti vadanti. Gāthāvirahe pana sati pucchitvā vissajjanabhāvo veyyākaraṇassa. Pucchāvissajjanañhi ‘‘byākaraṇa’’nti vuccati. Byākaraṇameva veyyākaraṇanti. Evaṃ sante sagāthakādīnampi pañhāvissajjanavasena pavattānaṃ veyyākaraṇabhāvo āpajjatīti? Nāpajjati, geyyādisaññānaṃ anokāsabhāvato ‘‘gāthāvirahe satī’’ti visesitattā ca. Tathā hi dhammapadādīsu kevalaṃ gāthābandhesu sagāthakattepi somanassañāṇamayikagāthāyuttesu ‘‘vuttañheta’’ntiādivacanasambandhesu abbhutadhammapaṭisaṃyuttesu ca suttavisesesu yathākkamaṃ gāthāudānaitivuttakaabbhutadhammasaññā patiṭṭhitā, tathā satipi gāthābandhabhāve bhagavato atītāsu jātīsu cariyānubhāvappakāsakesu jātakasaññā. Satipi pañhāvissajjanabhāve sagāthakatte ca kesuci suttantesu vedassa labhāpanato vedallasaññā patiṭṭhitāti evaṃ tena tena sagāthakattādinā nimittena tesu tesu suttavisesesu geyyaṅgādisaññā patiṭṭhitāti visesavidhayo suttaṅgato pare geyyādayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yaṃ panettha geyyaṅgādinimittarahitaṃ suttaṃ, taṃ suttaṅgaṃ visesasaññāparihārena sāmaññasaññāya pavattanatoti. Nanu ca sagāthakaṃ ",
      " suttaṃ geyyaṃ, niggāthakaṃ suttaṃ veyyākaraṇanti suttaṅgaṃ na sambhavatīti codanā tadavatthā evāti? Na tadavatthā, sodhitattā. Sodhitañhi ",
      " pubbe gāthāvirahe sati pucchāvissajjanabhāvo veyyākaraṇassa tabbhāvanimittanti. Yañca vuttaṃ – ‘‘gāthābhāvato maṅgalasuttādīnaṃ suttaṅgasaṅgaho na siyā’’ti, tampi na, niruḷhattā. Niruḷho hi maṅgalasuttādīsu suttabhāvo, na hi tāni dhammapadabuddhavaṃsādayo viya gāthābhāvena paññātāni, kintu suttabhāveneva. Teneva hi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṭṭhakathāyaṃ"
      },
      " ‘‘suttanāmaka’’nti nāmaggahaṇaṃ kataṃ."
    ],
    "innerText": "Yaṃ panettha geyyaṅgādinimittarahitaṃ suttaṃ, taṃ suttaṅgaṃ visesasaññāparihārena sāmaññasaññāya pavattanatoti. Nanu ca sagāthakaṃ suttaṃ geyyaṃ, niggāthakaṃ suttaṃ veyyākaraṇanti suttaṅgaṃ na sambhavatīti codanā tadavatthā evāti? Na tadavatthā, sodhitattā. Sodhitañhi pubbe gāthāvirahe sati pucchāvissajjanabhāvo veyyākaraṇassa tabbhāvanimittanti. Yañca vuttaṃ – ‘‘gāthābhāvato maṅgalasuttādīnaṃ suttaṅgasaṅgaho na siyā’’ti, tampi na, niruḷhattā. Niruḷho hi maṅgalasuttādīsu suttabhāvo, na hi tāni dhammapadabuddhavaṃsādayo viya gāthābhāvena paññātāni, kintu suttabhāveneva. Teneva hi aṭṭhakathāyaṃ ‘‘suttanāmaka’’nti nāmaggahaṇaṃ kataṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yaṃ pana vuttaṃ ‘‘sagāthakattā geyyaṅgasaṅgaho vā siyā’’ti, tadapi natthi, yasmā sahatāññena. Saha gāthāhīti hi sagāthakaṃ. Sahabhāvo ca nāma atthato aññena hoti, na ca maṅgalasuttādīsu gāthāvinimutto koci suttappadeso atthi. Yo saha gāthāhīti vucceyya, na ca samudāyo nāma koci atthi. Yadapi vuttaṃ – ‘‘ubhatovibhaṅgādīsu sagāthakappadesānaṃ geyyaṅgasaṅgaho siyā’’ti, tadapi na aññato. Aññā eva hi tā gāthā, jātakādipariyāpannattā. Ato na tāhi ubhatovibhaṅgādīnaṃ geyyaṅgabhāvoti evaṃ suttādīnaṃ aṅgānaṃ aññamaññasaṅkarābhāvo veditabbo. Yasmā pana sabbampi buddhavacanaṃ yathāvuttanayena atthānaṃ sūcanādiatthena suttantveva vuccati, tasmā vuttaṃ – ‘‘navavidhasuttantapariyeṭṭhī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Saṅgahavāravaṇṇanā niṭṭhitā."
  }
]