[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "16. Bandhujīvakavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Bandhujīvakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Candaṃva"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vimalaṃ suddha"
      },
      "ntiādikaṃ āyasmato bandhujīvakattherassa apadānaṃ. Ayampāyasmā purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto sikhissa bhagavato kāle kulagehe nibbatto ",
      " viññutaṃ patto gharāvāsaṃ saṇṭhapetvā vasanto sikhissa bhagavato rūpakāyasampattiṃ disvā pasannamānaso bandhujīvakapupphāni gahetvā bhagavato pādamūle pūjesi. Bhagavā tassa cittappasādavaḍḍhanatthāya anumodanamakāsi. So yāvatāyutaṃ ṭhatvā teneva puññena devaloke nibbatto cha kāmāvacarasampattiyo anubhavitvā manussesu ca cakkavattiādisampattiyo anubhavitvā imassa amhākaṃ sammāsambuddhassa uppannakāle gahapatikule nibbatto rūpaggayasaggappatto satthu dhammadesanaṃ sutvā saddhājāto gehaṃ pahāya pabbajito arahattaṃ pāpuṇi."
    ],
    "innerText": "Candaṃvavimalaṃ suddhantiādikaṃ āyasmato bandhujīvakattherassa apadānaṃ. Ayampāyasmā purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto sikhissa bhagavato kāle kulagehe nibbatto viññutaṃ patto gharāvāsaṃ saṇṭhapetvā vasanto sikhissa bhagavato rūpakāyasampattiṃ disvā pasannamānaso bandhujīvakapupphāni gahetvā bhagavato pādamūle pūjesi. Bhagavā tassa cittappasādavaḍḍhanatthāya anumodanamakāsi. So yāvatāyutaṃ ṭhatvā teneva puññena devaloke nibbatto cha kāmāvacarasampattiyo anubhavitvā manussesu ca cakkavattiādisampattiyo anubhavitvā imassa amhākaṃ sammāsambuddhassa uppannakāle gahapatikule nibbatto rūpaggayasaggappatto satthu dhammadesanaṃ sutvā saddhājāto gehaṃ pahāya pabbajito arahattaṃ pāpuṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      ". So pubbenivāsañāṇena pubbe katakusalakammaṃ anussaritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "candaṃva vimalaṃ suddha"
      },
      "ntiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "candaṃva vimalaṃ suddha"
      },
      "nti abbhā, mahikā, dhumo, rajo, rāhūti imehi upakkilesamalehi vimuttaṃ candaṃ iva diyaḍḍhasahassupakkilesamalānaṃ pahīnattā vimalaṃ nikkilesattā suddhaṃ pasannaṃ sikhiṃ sambuddhanti sambandho. Kilesakaddamānaṃ abhāvena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anāvilaṃ"
      },
      ". Nandībhavasaṅkhātāya balavasnehāya parisamantato khīṇattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nandībhavaparikkhīṇaṃ. Tiṇṇaṃ loke"
      },
      "ti lokattayato tiṇṇaṃ uttiṇṇaṃ atikkantaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Visattika"
      },
      "nti visattikaṃ vuccati taṇhā, nittaṇhanti attho."
    ],
    "innerText": "1. So pubbenivāsañāṇena pubbe katakusalakammaṃ anussaritvā somanassajāto pubbacaritāpadānaṃ pakāsento candaṃva vimalaṃ suddhantiādimāha. Tattha candaṃva vimalaṃ suddhanti abbhā, mahikā, dhumo, rajo, rāhūti imehi upakkilesamalehi vimuttaṃ candaṃ iva diyaḍḍhasahassupakkilesamalānaṃ pahīnattā vimalaṃ nikkilesattā suddhaṃ pasannaṃ sikhiṃ sambuddhanti sambandho. Kilesakaddamānaṃ abhāvena anāvilaṃ. Nandībhavasaṅkhātāya balavasnehāya parisamantato khīṇattā nandībhavaparikkhīṇaṃ. Tiṇṇaṃ loketi lokattayato tiṇṇaṃ uttiṇṇaṃ atikkantaṃ. Visattikanti visattikaṃ vuccati taṇhā, nittaṇhanti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "2"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nibbāpayantaṃ janata"
      },
      "nti dhammavassaṃ vassanto janataṃ janasamūhaṃ kilesapariḷāhābhāvena nibbāpayantaṃ vūpasamentaṃ. Sayaṃ saṃsārato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tiṇṇaṃ,"
      },
      " sabbasatte saṃsārato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tārayantaṃ"
      },
      " atikkamentaṃ catunnaṃ saccānaṃ munanato jānanato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "muniṃ"
      },
      " sikhiṃ sambuddhanti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vanasmiṃ jhāyamāna"
      },
      "nti ārammaṇūpanijjhānalakkhaṇūpanijjhānehi jhāyantaṃ cintentaṃ cittena bhāventaṃ vanamajjheti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekaggaṃ"
      },
      " ekaggacittaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "susamāhitaṃ"
      },
      " suṭṭhu ārammaṇe āhitaṃ ṭhapitacittaṃ sikhiṃ muniṃ disvāti sambandho."
    ],
    "innerText": "2.Nibbāpayantaṃ janatanti dhammavassaṃ vassanto janataṃ janasamūhaṃ kilesapariḷāhābhāvena nibbāpayantaṃ vūpasamentaṃ. Sayaṃ saṃsārato tiṇṇaṃ, sabbasatte saṃsārato tārayantaṃ atikkamentaṃ catunnaṃ saccānaṃ munanato jānanato muniṃ sikhiṃ sambuddhanti sambandho. Vanasmiṃ jhāyamānanti ārammaṇūpanijjhānalakkhaṇūpanijjhānehi jhāyantaṃ cintentaṃ cittena bhāventaṃ vanamajjheti attho. Ekaggaṃ ekaggacittaṃ susamāhitaṃ suṭṭhu ārammaṇe āhitaṃ ṭhapitacittaṃ sikhiṃ muniṃ disvāti sambandho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "3"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bandhujīvakapupphānī"
      },
      "ti bandhūnaṃ ñātīnaṃ jīvakaṃ jīvitanissayaṃ hadayamaṃsalohitaṃ bandhujīvakaṃ hadayamaṃsalohitasamānavaṇṇaṃ pupphaṃ bandhujīvakapupphaṃ gahetvā sikhino lokabandhuno pūjesinti attho. Sesaṃ uttānatthamevāti."
    ],
    "innerText": "3.Bandhujīvakapupphānīti bandhūnaṃ ñātīnaṃ jīvakaṃ jīvitanissayaṃ hadayamaṃsalohitaṃ bandhujīvakaṃ hadayamaṃsalohitasamānavaṇṇaṃ pupphaṃ bandhujīvakapupphaṃ gahetvā sikhino lokabandhuno pūjesinti attho. Sesaṃ uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Bandhujīvakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Tambapupphiyattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parakammāyane"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yutto"
      },
      "tiādikaṃ āyasmato tambapupphiyattherassa apadānaṃ. Ayampi āyasmā purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto piyadassissa bhagavato kāle kenaci pure katena akusalakammena duggatakule nibbatto vuddhippatto paresaṃ kammaṃ katvā bhatiyā jīvikaṃ kappesi. So evaṃ dukkhena vasanto paresaṃ aparādhaṃ katvā maraṇabhayena palāyitvā vanaṃ pāvisi. Tattha gataṭṭhāne pāṭalibodhiṃ disvā vanditvā sammajjitvā ekasmiṃ rukkhe tambavaṇṇaṃ pupphaṃ disvā taṃ sabbaṃ kaṇṇike ocinitvā bodhipūjaṃ akāsi. Tattha cittaṃ pasādetvā vanditvā pallaṅkamābhujitvā nisīdi. Tasmiṃ khaṇe te manussā padānupadikaṃ anubandhitvā tattha agamaṃsu. So te disvā bodhiṃ āvajjentova palāyitvā bhayānake gīriduggapapāte patitvā mari."
    ],
    "innerText": "Parakammāyaneyuttotiādikaṃ āyasmato tambapupphiyattherassa apadānaṃ. Ayampi āyasmā purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto piyadassissa bhagavato kāle kenaci pure katena akusalakammena duggatakule nibbatto vuddhippatto paresaṃ kammaṃ katvā bhatiyā jīvikaṃ kappesi. So evaṃ dukkhena vasanto paresaṃ aparādhaṃ katvā maraṇabhayena palāyitvā vanaṃ pāvisi. Tattha gataṭṭhāne pāṭalibodhiṃ disvā vanditvā sammajjitvā ekasmiṃ rukkhe tambavaṇṇaṃ pupphaṃ disvā taṃ sabbaṃ kaṇṇike ocinitvā bodhipūjaṃ akāsi. Tattha cittaṃ pasādetvā vanditvā pallaṅkamābhujitvā nisīdi. Tasmiṃ khaṇe te manussā padānupadikaṃ anubandhitvā tattha agamaṃsu. So te disvā bodhiṃ āvajjentova palāyitvā bhayānake gīriduggapapāte patitvā mari."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "7"
      },
      ". So bodhipūjāya anussaritattā teneva pītisomanassena tāvatiṃsādīsu upapanno cha kāmāvacarasampattiṃ anubhavitvā manussesu ca cakkavattiādisampattiṃ anubhavitvā imasmiṃ buddhuppāde vibhavasampanne kule nibbatto vuddhippatto satthu dhammadesanaṃ sutvā pasannamānaso pabbajitvā nacirasseva arahā hutvā attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "parakammāyane yutto"
      },
      "tiādimāha. Tattha paresaṃ kammāni parakammāni, parakammānaṃ āyane karaṇe vāhane dhāraṇe yutto yojito ahosinti attho. Sesaṃ pākaṭamevāti."
    ],
    "innerText": "7. So bodhipūjāya anussaritattā teneva pītisomanassena tāvatiṃsādīsu upapanno cha kāmāvacarasampattiṃ anubhavitvā manussesu ca cakkavattiādisampattiṃ anubhavitvā imasmiṃ buddhuppāde vibhavasampanne kule nibbatto vuddhippatto satthu dhammadesanaṃ sutvā pasannamānaso pabbajitvā nacirasseva arahā hutvā attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento parakammāyane yuttotiādimāha. Tattha paresaṃ kammāni parakammāni, parakammānaṃ āyane karaṇe vāhane dhāraṇe yutto yojito ahosinti attho. Sesaṃ pākaṭamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tambapupphiyattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Vīthisammajjakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Udentaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sataraṃsiṃ vā"
      },
      "tiādikaṃ āyasmato vīthisammajjakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro anekesu jātisatesu katapuññasañcayo sikhissa bhagavato kāle kulagehe nibbatto gharāvāsaṃ vasanto nagaravāsīhi saddhiṃ vīthiṃ sajjetvā nīyamānaṃ bhagavantaṃ disvā pasannamānaso vīthiṃ samaṃ katvā dhajaṃ tattha ussāpesi."
    ],
    "innerText": "Udentaṃsataraṃsiṃ vātiādikaṃ āyasmato vīthisammajjakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro anekesu jātisatesu katapuññasañcayo sikhissa bhagavato kāle kulagehe nibbatto gharāvāsaṃ vasanto nagaravāsīhi saddhiṃ vīthiṃ sajjetvā nīyamānaṃ bhagavantaṃ disvā pasannamānaso vīthiṃ samaṃ katvā dhajaṃ tattha ussāpesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "15"
      },
      ". So ",
      " teneva puññena devamanussesu saṃsaranto ubhayasampattiyo anubhavitvā imasmiṃ buddhuppāde ekasmiṃ kule nibbatto viññutaṃ patvā satthu dhammadesanaṃ sutvā paṭiladdhasaddho bahumānahadayo pabbajitvā laddhūpasampado nacirasseva arahā hutvā attano pubbakammaṃ anussaranto paccakkhato jānitvā pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "udentaṃ sataraṃsiṃ vā"
      },
      "tiādimāha. Tattha ",
      " udentaṃ uggacchantaṃ sataraṃsiṃ satapabhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sataraṃsī"
      },
      "ti desanāsīsamattaṃ, anekasatasahassapabhaṃ sūriyaṃ ivāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pītaraṃsiṃva bhāṇuma"
      },
      "nti pītaraṃsiṃ saṃkucitapabhaṃ bhāṇumaṃ pabhāvantaṃ candamaṇḍalaṃ iva sambuddhaṃ disvāti attho. Sesaṃ suviññeyyamevāti."
    ],
    "innerText": "15. So teneva puññena devamanussesu saṃsaranto ubhayasampattiyo anubhavitvā imasmiṃ buddhuppāde ekasmiṃ kule nibbatto viññutaṃ patvā satthu dhammadesanaṃ sutvā paṭiladdhasaddho bahumānahadayo pabbajitvā laddhūpasampado nacirasseva arahā hutvā attano pubbakammaṃ anussaranto paccakkhato jānitvā pubbacaritāpadānaṃ pakāsento udentaṃ sataraṃsiṃ vātiādimāha. Tattha udentaṃ uggacchantaṃ sataraṃsiṃ satapabhaṃ. Sataraṃsīti desanāsīsamattaṃ, anekasatasahassapabhaṃ sūriyaṃ ivāti attho. Pītaraṃsiṃva bhāṇumanti pītaraṃsiṃ saṃkucitapabhaṃ bhāṇumaṃ pabhāvantaṃ candamaṇḍalaṃ iva sambuddhaṃ disvāti attho. Sesaṃ suviññeyyamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vīthisammajjakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Kakkārupupphapūjakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Devaputto ahaṃ santo"
      },
      "tiādikaṃ āyasmato kakkārupupphapūjakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave katapuññasañcayo sikhissa bhagavato kāle bhummaṭṭhakadevaputto hutvā nibbatto sikhiṃ sammāsambuddhaṃ disvā dibbakakkārupupphaṃ gahetvā pūjesi."
    ],
    "innerText": "Devaputto ahaṃ santotiādikaṃ āyasmato kakkārupupphapūjakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave katapuññasañcayo sikhissa bhagavato kāle bhummaṭṭhakadevaputto hutvā nibbatto sikhiṃ sammāsambuddhaṃ disvā dibbakakkārupupphaṃ gahetvā pūjesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "21"
      },
      ". So tena puññena devamanussesu saṃsaranto ekatiṃsakappabbhantare ubhayasukhaṃ anubhavitvā imasmiṃ buddhuppāde sāvatthiyaṃ kulagehe nibbatto vuddhimanvāya satthari pasanno pabbajitvā nacirasseva arahā hutvā attano pubbakammaṃ paccakkhato ñatvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "devaputto ahaṃ santo"
      },
      "tiādimāha. Tattha dibbanti kīḷanti pañcahi dibbehi kāmaguṇehīti devā, devānaṃ putto, devo eva vā putto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "devaputto,"
      },
      " ahaṃ devaputto ",
      " santo vijjamāno dibbaṃ kakkārupupphaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paggayha"
      },
      " pakārena, gahetvā sikhissa bhagavato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhiropayiṃ"
      },
      " pūjesinti attho. Sesaṃ uttānatthamevāti."
    ],
    "innerText": "21. So tena puññena devamanussesu saṃsaranto ekatiṃsakappabbhantare ubhayasukhaṃ anubhavitvā imasmiṃ buddhuppāde sāvatthiyaṃ kulagehe nibbatto vuddhimanvāya satthari pasanno pabbajitvā nacirasseva arahā hutvā attano pubbakammaṃ paccakkhato ñatvā somanassajāto pubbacaritāpadānaṃ pakāsento devaputto ahaṃ santotiādimāha. Tattha dibbanti kīḷanti pañcahi dibbehi kāmaguṇehīti devā, devānaṃ putto, devo eva vā putto devaputto, ahaṃ devaputto santo vijjamāno dibbaṃ kakkārupupphaṃ paggayha pakārena, gahetvā sikhissa bhagavato abhiropayiṃ pūjesinti attho. Sesaṃ uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Kakkārupupphapūjakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Mandāravapupphapūjakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Devaputto"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ahaṃ santo"
      },
      "tiādikaṃ āyasmato mandāravapupphapūjakattherassa apadānaṃ. Ayampi thero purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto sikhissa bhagavato kāle bhummaṭṭhakadevaputto hutvā nibbatto sikhiṃ bhagavantaṃ disvā pasannamānaso dibbamandāravapupphehi pūjesi."
    ],
    "innerText": "Devaputtoahaṃ santotiādikaṃ āyasmato mandāravapupphapūjakattherassa apadānaṃ. Ayampi thero purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto sikhissa bhagavato kāle bhummaṭṭhakadevaputto hutvā nibbatto sikhiṃ bhagavantaṃ disvā pasannamānaso dibbamandāravapupphehi pūjesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "25"
      },
      ". So tena puññenātiādikaṃ sabbaṃ anantarattherassa apadānavaṇṇanāya vuttanayeneva veditabbanti."
    ],
    "innerText": "25. So tena puññenātiādikaṃ sabbaṃ anantarattherassa apadānavaṇṇanāya vuttanayeneva veditabbanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Mandāravapupphapūjakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Kadambapupphiyattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Himavantassāvidūre"
      },
      "tiādikaṃ āyasmato kadambapupphiyattherassa apadānaṃ. Ayampi purimajinavaresu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto sammāsambuddhasuññe loke ekasmiṃ ",
      " kule nibbatto vuddhimanvāya gharāvāsaṃ vasanto tattha ādīnavaṃ disvā gharāvāsaṃ pahāya tāpasapabbajjaṃ pabbajitvā himavantasamīpe kukkuṭe nāma pabbate assamaṃ katvā vihāsi. So tattha satta paccekabuddhe disvā pasannamānaso pupphitaṃ kadambapupphaṃ ocinitvā te paccekabuddhe pūjesi. Tepi ‘‘icchitaṃ patthita’’ntiādinā anumodanaṃ akaṃsu."
    ],
    "innerText": "Himavantassāvidūretiādikaṃ āyasmato kadambapupphiyattherassa apadānaṃ. Ayampi purimajinavaresu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto sammāsambuddhasuññe loke ekasmiṃ kule nibbatto vuddhimanvāya gharāvāsaṃ vasanto tattha ādīnavaṃ disvā gharāvāsaṃ pahāya tāpasapabbajjaṃ pabbajitvā himavantasamīpe kukkuṭe nāma pabbate assamaṃ katvā vihāsi. So tattha satta paccekabuddhe disvā pasannamānaso pupphitaṃ kadambapupphaṃ ocinitvā te paccekabuddhe pūjesi. Tepi ‘‘icchitaṃ patthita’’ntiādinā anumodanaṃ akaṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "30"
      },
      ". So tena puññena devamanussesu saṃsaranto ubhayasampattiyo anubhavitvā imasmiṃ buddhuppāde sāvatthiyaṃ kulagehe nibbatto vuddhimanvāya satthu dhammadesanaṃ sutvā paṭiladdhasaddho pabbajitvā nacirasseva arahā hutvā pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "himavantassāvidūre"
      },
      "tiādimāha. Taṃ vuttatthameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kukkuṭo nāma pabbato"
      },
      "ti tassa ubhosu passesu kukkuṭacūḷākārena pabbatakūṭānaṃ vijjamānattā kukkuṭoti saṅkhaṃ gato. Pakārena tiro hutvā patiṭṭhahatīti pabbato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tamhi pabbatapādamhī"
      },
      "ti tasmiṃ pabbatasamīpe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Satta buddhā vasantī"
      },
      "ti satta paccekabuddhā tasmiṃ kukkuṭapabbatapāde paṇṇasālāyaṃ vasantīti attho."
    ],
    "innerText": "30. So tena puññena devamanussesu saṃsaranto ubhayasampattiyo anubhavitvā imasmiṃ buddhuppāde sāvatthiyaṃ kulagehe nibbatto vuddhimanvāya satthu dhammadesanaṃ sutvā paṭiladdhasaddho pabbajitvā nacirasseva arahā hutvā pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento himavantassāvidūretiādimāha. Taṃ vuttatthameva. Kukkuṭo nāma pabbatoti tassa ubhosu passesu kukkuṭacūḷākārena pabbatakūṭānaṃ vijjamānattā kukkuṭoti saṅkhaṃ gato. Pakārena tiro hutvā patiṭṭhahatīti pabbato. Tamhi pabbatapādamhīti tasmiṃ pabbatasamīpe. Satta buddhā vasantīti satta paccekabuddhā tasmiṃ kukkuṭapabbatapāde paṇṇasālāyaṃ vasantīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "31"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dīparājaṃva"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uggata"
      },
      "nti dīpānaṃ rājā dīparājā, sabbesaṃ dīpānaṃ jalamānānaṃ tārakānaṃ rājā candoti attho. Atha vā sabbesu jambudīpapubbavidehaaparagoyānauttarakurusaṅkhātesu catūsu dīpesu dvisahassaparittadīpesu ca rājā ālokapharaṇato cando dīparājāti vuccati, taṃ nabhe uggataṃ candaṃ iva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pupphitaṃ"
      },
      " phullitaṃ kadambarukkhaṃ disvā tato pupphaṃ ocinitvā ubhohi hatthehi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paggayha"
      },
      " pakārena gahetvā satta paccekabuddhe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samokiriṃ"
      },
      " suṭṭhu okiriṃ, ādarena pūjesinti attho. Sesaṃ uttānatthamevāti."
    ],
    "innerText": "31.Dīparājaṃvauggatanti dīpānaṃ rājā dīparājā, sabbesaṃ dīpānaṃ jalamānānaṃ tārakānaṃ rājā candoti attho. Atha vā sabbesu jambudīpapubbavidehaaparagoyānauttarakurusaṅkhātesu catūsu dīpesu dvisahassaparittadīpesu ca rājā ālokapharaṇato cando dīparājāti vuccati, taṃ nabhe uggataṃ candaṃ iva pupphitaṃ phullitaṃ kadambarukkhaṃ disvā tato pupphaṃ ocinitvā ubhohi hatthehi paggayha pakārena gahetvā satta paccekabuddhe samokiriṃ suṭṭhu okiriṃ, ādarena pūjesinti attho. Sesaṃ uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Kadambapupphiyattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Tiṇasūlakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Himavantassāvidūre"
      },
      "tiādikaṃ āyasmato tiṇasūlakattherassa apadānaṃ. Ayampi thero purimajinavaresu katapuññasambhāro uppannuppannabhave kusalāni upacinanto sikhissa bhagavato kāle kulagehe nibbatto gharāvāsaṃ saṇṭhapetvā tattha dosaṃ disvā taṃ pahāya tāpasapabbajjaṃ pabbajitvā vasanto himavantasamīpe bhūtagaṇe nāma pabbate vasantaṃ ekataṃ vivekamanubrūhantaṃ sikhiṃ sambuddhaṃ disvā pasannamānaso tiṇasūlapupphaṃ gahetvā pādamūle pūjesi. Buddhopi tassa anumodanaṃ akāsi."
    ],
    "innerText": "Himavantassāvidūretiādikaṃ āyasmato tiṇasūlakattherassa apadānaṃ. Ayampi thero purimajinavaresu katapuññasambhāro uppannuppannabhave kusalāni upacinanto sikhissa bhagavato kāle kulagehe nibbatto gharāvāsaṃ saṇṭhapetvā tattha dosaṃ disvā taṃ pahāya tāpasapabbajjaṃ pabbajitvā vasanto himavantasamīpe bhūtagaṇe nāma pabbate vasantaṃ ekataṃ vivekamanubrūhantaṃ sikhiṃ sambuddhaṃ disvā pasannamānaso tiṇasūlapupphaṃ gahetvā pādamūle pūjesi. Buddhopi tassa anumodanaṃ akāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "35"
      },
      ". So tena puññena devamanussesu saṃsaranto ubhayasampattiyo anubhavitvā imasmiṃ buddhuppāde sāvatthiyaṃ vibhavasampanne ",
      " ekasmiṃ kule nibbatto vuddhimanvāya sāsane pasanno pabbajitvā upanissayasampannattā nacirasseva arahattaṃ pāpuṇitvā pubbakammaṃ saritvā somanassappatto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "himavantassāvidūre"
      },
      "tiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhūtagaṇo nāma pabbato"
      },
      "ti bhūtagaṇānaṃ devayakkhasamūhānaṃ āvāsabhūtattā bhavanasadisattā avirūḷhabhāvena pavattattā ",
      " ca bhūtagaṇo nāma pabbato, tasmiṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "eko"
      },
      " adutiyo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jino"
      },
      " jitamāro buddho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vasate"
      },
      " dibbabrahmaariyairiyāpathavihārehi viharatīti attho."
    ],
    "innerText": "35. So tena puññena devamanussesu saṃsaranto ubhayasampattiyo anubhavitvā imasmiṃ buddhuppāde sāvatthiyaṃ vibhavasampanne ekasmiṃ kule nibbatto vuddhimanvāya sāsane pasanno pabbajitvā upanissayasampannattā nacirasseva arahattaṃ pāpuṇitvā pubbakammaṃ saritvā somanassappatto pubbacaritāpadānaṃ pakāsento himavantassāvidūretiādimāha. Bhūtagaṇo nāma pabbatoti bhūtagaṇānaṃ devayakkhasamūhānaṃ āvāsabhūtattā bhavanasadisattā avirūḷhabhāvena pavattattā ca bhūtagaṇo nāma pabbato, tasmiṃ eko adutiyo jino jitamāro buddho vasate dibbabrahmaariyairiyāpathavihārehi viharatīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "36"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekūnasatasahassaṃ , kappaṃ na vinipātiko"
      },
      "ti tena tiṇasūlapupphapūjākaraṇaphalena nirantaraṃ ekūnasatasahassakappānaṃ avinipātako caturāpāyavinimutto saggasampattibhavameva upapannoti attho. Sesaṃ suviññeyyamevāti."
    ],
    "innerText": "36.Ekūnasatasahassaṃ , kappaṃ na vinipātikoti tena tiṇasūlapupphapūjākaraṇaphalena nirantaraṃ ekūnasatasahassakappānaṃ avinipātako caturāpāyavinimutto saggasampattibhavameva upapannoti attho. Sesaṃ suviññeyyamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tiṇasūlakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Nāgapupphiyattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suvaccho nāma nāmenā"
      },
      "tiādikaṃ āyasmato nāgapupphiyattherassa apadānaṃ. Ayampi thero purimajinanisabhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto padumuttarabhagavato kāle brāhmaṇakule nibbatto vuddhippatto vedattayādīsu sakasippesu nipphattiṃ patvā tattha sāraṃ adisvā himavantaṃ pavisitvā tāpasapabbajjaṃ pabbajitvā jhānasamāpattisukhena vītināmesi. Tasmiṃ samaye padumuttaro bhagavā tassānukampāya tattha agamāsi. So tāpaso taṃ bhagavantaṃ disvā lakkhaṇasatthesu chekattā bhagavato lakkhaṇarūpasampattiyā pasanno vanditvā añjaliṃ paggayha aṭṭhāsi. Ākāsato anotiṇṇattā pūjāsakkāre akateyeva ākāseneva pakkāmi. Atha so tāpaso sasisso nāgapupphaṃ ocinitvā tena pupphena bhagavato gatadisābhāgamaggaṃ pūjesi."
    ],
    "innerText": "Suvaccho nāma nāmenātiādikaṃ āyasmato nāgapupphiyattherassa apadānaṃ. Ayampi thero purimajinanisabhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto padumuttarabhagavato kāle brāhmaṇakule nibbatto vuddhippatto vedattayādīsu sakasippesu nipphattiṃ patvā tattha sāraṃ adisvā himavantaṃ pavisitvā tāpasapabbajjaṃ pabbajitvā jhānasamāpattisukhena vītināmesi. Tasmiṃ samaye padumuttaro bhagavā tassānukampāya tattha agamāsi. So tāpaso taṃ bhagavantaṃ disvā lakkhaṇasatthesu chekattā bhagavato lakkhaṇarūpasampattiyā pasanno vanditvā añjaliṃ paggayha aṭṭhāsi. Ākāsato anotiṇṇattā pūjāsakkāre akateyeva ākāseneva pakkāmi. Atha so tāpaso sasisso nāgapupphaṃ ocinitvā tena pupphena bhagavato gatadisābhāgamaggaṃ pūjesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "39"
      },
      ". So tena puññena devamanussesu saṃsaranto ubhayasampattiyo anubhavanto sabbattha pūjito imasmiṃ buddhuppāde sāvatthiyaṃ kulagehe nibbatto vuddhimanvāya saddhāsampanno pabbajitvā vattapaṭipattiyā sāsanaṃ sobhayamāno nacirasseva arahā hutvā ‘‘kena nu kho kusalakammena mayā ayaṃ lokuttarasampatti laddhā’’ti atītakammaṃ saranto pubbakammaṃ paccakkhato ñatvā sañjātasomanasso pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "suvaccho nāma nāmenā"
      },
      "tiādimāha. Tattha vacchagotte jātattā vaccho, sundaro ca so vaccho ceti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "suvaccho"
      },
      ". Nāmena suvaccho nāma brāhmaṇo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mantapāragū"
      },
      " vedattayādisakalamantasatthe ",
      " koṭippattoti attho. Sesaṃ heṭṭhā vuttanayattā uttānatthamevāti."
    ],
    "innerText": "39. So tena puññena devamanussesu saṃsaranto ubhayasampattiyo anubhavanto sabbattha pūjito imasmiṃ buddhuppāde sāvatthiyaṃ kulagehe nibbatto vuddhimanvāya saddhāsampanno pabbajitvā vattapaṭipattiyā sāsanaṃ sobhayamāno nacirasseva arahā hutvā ‘‘kena nu kho kusalakammena mayā ayaṃ lokuttarasampatti laddhā’’ti atītakammaṃ saranto pubbakammaṃ paccakkhato ñatvā sañjātasomanasso pubbacaritāpadānaṃ pakāsento suvaccho nāma nāmenātiādimāha. Tattha vacchagotte jātattā vaccho, sundaro ca so vaccho ceti suvaccho. Nāmena suvaccho nāma brāhmaṇo mantapāragū vedattayādisakalamantasatthe koṭippattoti attho. Sesaṃ heṭṭhā vuttanayattā uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Nāgapupphiyattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Punnāgapupphiyattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kānanaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vanamogayhā"
      },
      "tiādikaṃ āyasmato punnāgapupphiyattherassa apadānaṃ. Ayampi purimajinavaresu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto phussassa bhagavato kāle nesādakule nibbatto mahāvanaṃ paviṭṭho tattha supupphitapunnāgapupphaṃ disvā hetusampannattā buddhārammaṇapītivasena bhagavantaṃ saritvā taṃ pupphaṃ saha kaṇṇikāhi ocinitvā vālukāhi cetiyaṃ katvā pūjesi."
    ],
    "innerText": "Kānanaṃvanamogayhātiādikaṃ āyasmato punnāgapupphiyattherassa apadānaṃ. Ayampi purimajinavaresu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto phussassa bhagavato kāle nesādakule nibbatto mahāvanaṃ paviṭṭho tattha supupphitapunnāgapupphaṃ disvā hetusampannattā buddhārammaṇapītivasena bhagavantaṃ saritvā taṃ pupphaṃ saha kaṇṇikāhi ocinitvā vālukāhi cetiyaṃ katvā pūjesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "46"
      },
      ". So tena puññena dvenavutikappe nirantaraṃ devamanussasampattiyoyeva anubhavitvā imasmiṃ buddhuppāde sāvatthiyaṃ vibhavasampanne kule nibbatto vuddhimanvāya pubbavāsanābalena sāsane pasanno pabbajitvā vāyamanto nacirasseva arahā hutvā pubbe katakusalaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kānanaṃ vanamogayhā"
      },
      "tiādimāha. Taṃ sabbaṃ heṭṭhā vuttattā uttānatthamevāti."
    ],
    "innerText": "46. So tena puññena dvenavutikappe nirantaraṃ devamanussasampattiyoyeva anubhavitvā imasmiṃ buddhuppāde sāvatthiyaṃ vibhavasampanne kule nibbatto vuddhimanvāya pubbavāsanābalena sāsane pasanno pabbajitvā vāyamanto nacirasseva arahā hutvā pubbe katakusalaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento kānanaṃ vanamogayhātiādimāha. Taṃ sabbaṃ heṭṭhā vuttattā uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Punnāgapupphiyattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Kumudadāyakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Himavantassāvidūre"
      },
      "tiādikaṃ āyasmato kumudadāyakattherassa apadānaṃ. Ayampi thero purimabuddhesu katādhikāro anekesu bhavesu vivaṭṭūpanissayāni puññāni upacinanto padumuttarassa bhagavato kāle himavantassa āsanne mahante jātassare kukuttho nāma pakkhī hutvā nibbatto kenaci akusalena pakkhī samānopi pubbe katasambhārena buddhisampanno puññāpuññesu cheko sīlavā pāṇagocarato paṭivirato ahosi. Tasmiṃ samaye padumuttaro bhagavā ākāsenāgantvā tassa samīpe caṅkamati. Atha so sakuṇo bhagavantaṃ disvā pasannacitto kumudapupphaṃ ḍaṃsitvā bhagavato pādamūle pūjesi. Bhagavā tassa somanassuppādanatthaṃ paṭiggahetvā anumodanamakāsi."
    ],
    "innerText": "Himavantassāvidūretiādikaṃ āyasmato kumudadāyakattherassa apadānaṃ. Ayampi thero purimabuddhesu katādhikāro anekesu bhavesu vivaṭṭūpanissayāni puññāni upacinanto padumuttarassa bhagavato kāle himavantassa āsanne mahante jātassare kukuttho nāma pakkhī hutvā nibbatto kenaci akusalena pakkhī samānopi pubbe katasambhārena buddhisampanno puññāpuññesu cheko sīlavā pāṇagocarato paṭivirato ahosi. Tasmiṃ samaye padumuttaro bhagavā ākāsenāgantvā tassa samīpe caṅkamati. Atha so sakuṇo bhagavantaṃ disvā pasannacitto kumudapupphaṃ ḍaṃsitvā bhagavato pādamūle pūjesi. Bhagavā tassa somanassuppādanatthaṃ paṭiggahetvā anumodanamakāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "51"
      },
      ". So ",
      " tena puññena devamanussesu ubhayasampattisukhaṃ anubhavitvā imasmiṃ buddhuppāde sāvatthiyaṃ aññatarasmiṃ kule nibbatto vuddhimanvāya mahaddhano mahābhogo ratanattaye pasanno satthu dhammadesanaṃ sutvā paṭiladdhasaddho pabbajitvā nacirasseva arahā hutvā attano pubbakammaṃ paccakkhato ñatvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "himavantassāvidūre"
      },
      "tiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Padumuppalasañchanno"
      },
      "ti ",
      " ettha satapattehi sampuṇṇo setapadumo ca tīṇi nīlarattasetuppalāni ca padumuppalāni tehi sañchanno gahanībhūto sampuṇṇo mahājātassaro ahūti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puṇḍarīkasamotthaṭo"
      },
      "ti puṇḍarīkehi rattapadumehi otthaṭo sampuṇṇoti attho. Sesaṃ suviññeyyamevāti."
    ],
    "innerText": "51. So tena puññena devamanussesu ubhayasampattisukhaṃ anubhavitvā imasmiṃ buddhuppāde sāvatthiyaṃ aññatarasmiṃ kule nibbatto vuddhimanvāya mahaddhano mahābhogo ratanattaye pasanno satthu dhammadesanaṃ sutvā paṭiladdhasaddho pabbajitvā nacirasseva arahā hutvā attano pubbakammaṃ paccakkhato ñatvā somanassajāto pubbacaritāpadānaṃ pakāsento himavantassāvidūretiādimāha. Padumuppalasañchannoti ettha satapattehi sampuṇṇo setapadumo ca tīṇi nīlarattasetuppalāni ca padumuppalāni tehi sañchanno gahanībhūto sampuṇṇo mahājātassaro ahūti sambandho. Puṇḍarīkasamotthaṭoti puṇḍarīkehi rattapadumehi otthaṭo sampuṇṇoti attho. Sesaṃ suviññeyyamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Kumudadāyakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Soḷasamavaggavaṇṇanā samattā."
  }
]