[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "5. Vimokkhakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Vimokkhuddesavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "209"
      },
      ". Idāni ",
      " indriyakathānantaraṃ kathitāya vimokkhakathāya apubbatthānuvaṇṇanā anuppattā. Ayañhi vimokkhakathā indriyabhāvanānuyuttassa vimokkhasabbhāvato indriyakathānantaraṃ kathitā. Tañca kathento bhagavato sammukhā sutasuttantadesanāpubbaṅgamaṃ katvā kathesi. Tattha suttante tāva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "suññato vimokkho"
      },
      "tiādīsu suññatākārena nibbānaṃ ārammaṇaṃ katvā pavatto ariyamaggo suññato vimokkho. So hi suññatāya dhātuyā uppannattā suññato, kilesehi vimuttattā vimokkho. Eteneva nayena animittākārena nibbānaṃ ārammaṇaṃ katvā pavatto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "animitto,"
      },
      " appaṇihitākārena nibbānaṃ ārammaṇaṃ katvā pavatto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "appaṇihito"
      },
      "ti veditabbo."
    ],
    "innerText": "209. Idāni indriyakathānantaraṃ kathitāya vimokkhakathāya apubbatthānuvaṇṇanā anuppattā. Ayañhi vimokkhakathā indriyabhāvanānuyuttassa vimokkhasabbhāvato indriyakathānantaraṃ kathitā. Tañca kathento bhagavato sammukhā sutasuttantadesanāpubbaṅgamaṃ katvā kathesi. Tattha suttante tāva suññato vimokkhotiādīsu suññatākārena nibbānaṃ ārammaṇaṃ katvā pavatto ariyamaggo suññato vimokkho. So hi suññatāya dhātuyā uppannattā suññato, kilesehi vimuttattā vimokkho. Eteneva nayena animittākārena nibbānaṃ ārammaṇaṃ katvā pavatto animitto, appaṇihitākārena nibbānaṃ ārammaṇaṃ katvā pavatto appaṇihitoti veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Eko ",
      " hi āditova aniccato saṅkhāre sammasati. Yasmā pana na aniccato sammasanamatteneva maggavuṭṭhānaṃ hoti, dukkhatopi anattatopi sammasitabbameva, tasmā dukkhatopi anattatopi sammasati. Tassa evaṃ paṭipannassa aniccato ce sammasanakāle maggavuṭṭhānaṃ hoti, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aniccato abhinivisitvā aniccato vuṭṭhāti"
      },
      " nāma. Sace panassa dukkhato anattato sammasanakāle maggavuṭṭhānaṃ hoti, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aniccato abhinivisitvā dukkhato, anattato vuṭṭhāti"
      },
      " nāma. Esa nayo dukkhato anattato abhinivisitvā vuṭṭhānesupi. Ettha ca yopi aniccato abhiniviṭṭho, yopi dukkhato, yopi anattato. Vuṭṭhānakāle ce aniccato vuṭṭhānaṃ hoti, tayopi janā adhimokkhabahulā honti, saddhindriyaṃ paṭilabhanti, animittavimokkhena vimuccanti, paṭhamamaggakkhaṇe saddhānusārino honti, sattasu ṭhānesu saddhāvimuttā. Sace pana dukkhato vuṭṭhānaṃ hoti, tayopi janā passaddhibahulā honti, samādhindriyaṃ paṭilabhanti, appaṇihitavimokkhena vimuccanti, sabbattha kāyasakkhino honti. Yassa panettha arūpajjhānaṃ pādakaṃ hoti, so aggaphale ubhatobhāgavimutto hoti. Atha nesaṃ anattato vuṭṭhānaṃ hoti, tayopi janā vedabahulā honti, paññindriyaṃ paṭilabhanti, suññatavimokkhena ",
      " vimuccanti, paṭhamamaggakkhaṇe dhammānusārino honti, chasu ṭhānesu diṭṭhippattā, aggaphale paññāvimuttāti."
    ],
    "innerText": "Eko hi āditova aniccato saṅkhāre sammasati. Yasmā pana na aniccato sammasanamatteneva maggavuṭṭhānaṃ hoti, dukkhatopi anattatopi sammasitabbameva, tasmā dukkhatopi anattatopi sammasati. Tassa evaṃ paṭipannassa aniccato ce sammasanakāle maggavuṭṭhānaṃ hoti, ayaṃ aniccato abhinivisitvā aniccato vuṭṭhāti nāma. Sace panassa dukkhato anattato sammasanakāle maggavuṭṭhānaṃ hoti, ayaṃ aniccato abhinivisitvā dukkhato, anattato vuṭṭhāti nāma. Esa nayo dukkhato anattato abhinivisitvā vuṭṭhānesupi. Ettha ca yopi aniccato abhiniviṭṭho, yopi dukkhato, yopi anattato. Vuṭṭhānakāle ce aniccato vuṭṭhānaṃ hoti, tayopi janā adhimokkhabahulā honti, saddhindriyaṃ paṭilabhanti, animittavimokkhena vimuccanti, paṭhamamaggakkhaṇe saddhānusārino honti, sattasu ṭhānesu saddhāvimuttā. Sace pana dukkhato vuṭṭhānaṃ hoti, tayopi janā passaddhibahulā honti, samādhindriyaṃ paṭilabhanti, appaṇihitavimokkhena vimuccanti, sabbattha kāyasakkhino honti. Yassa panettha arūpajjhānaṃ pādakaṃ hoti, so aggaphale ubhatobhāgavimutto hoti. Atha nesaṃ anattato vuṭṭhānaṃ hoti, tayopi janā vedabahulā honti, paññindriyaṃ paṭilabhanti, suññatavimokkhena vimuccanti, paṭhamamaggakkhaṇe dhammānusārino honti, chasu ṭhānesu diṭṭhippattā, aggaphale paññāvimuttāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Apica maggo nāma pañcahi kāraṇehi nāmaṃ labhati sarasena vā paccanīkena vā saguṇena vā ārammaṇena vā āgamanena vā. Sace hi saṅkhārupekkhā aniccato saṅkhāre sammasitvā vuṭṭhāti, animittavimokkhena vimuccati. Sace dukkhato sammasitvā vuṭṭhāti, appaṇihitavimokkhena ",
      " vimuccati. Sace anattato sammasitvā vuṭṭhāti, suññatavimokkhena vimuccati. Idaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sarasato"
      },
      " nāmaṃ nāma. Aniccānupassanāya pana saṅkhārānaṃ ghanavinibbhogaṃ katvā niccanimittadhuvanimittasassatanimittāni pahāya āgatattā animitto, dukkhānupassanāya sukhasaññaṃ pahāya paṇidhipatthanaṃ sukkhāpetvā āgatattā appaṇihito, anattānupassanāya attasattapuggalasaññaṃ pahāya saṅkhāre suññato diṭṭhattā suññatoti idaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paccanīkato"
      },
      " nāmaṃ nāma. Rāgādīhi pana suññattā suññato, rūpanimittādīnaṃ, rāganimittādīnaṃyeva ",
      " vā abhāvena animitto, rāgapaṇidhiādīnaṃ abhāvato appaṇihitoti idamassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saguṇato"
      },
      " nāmaṃ nāma. Soyaṃ suññaṃ animittaṃ appaṇihitañca nibbānaṃ ārammaṇaṃ karotītipi suññato animitto appaṇihitoti vuccati. Idamassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ārammaṇato"
      },
      " nāmaṃ nāma. Āgamanaṃ pana duvidhaṃ vipassanāgamanaṃ maggāgamanañca. Tattha magge vipassanāgamanaṃ labbhati, phale maggāgamanaṃ. Anattānupassanā hi suññatā nāma, suññatavipassanāya maggo suññato, suññatamaggassa phalaṃ suññataṃ. Aniccānupassanā animittā nāma, animittavipassanāya maggo animitto. Idaṃ pana nāmaṃ abhidhammapariyāye na labbhati, suttantapariyāye pana labbhati. Tattha hi gotrabhuñāṇaṃ animittaṃ nibbānaṃ ārammaṇaṃ katvā animittanāmakaṃ hutvā sayaṃ āgamanīyaṭṭhāne ṭhatvā maggassa nāmaṃ detīti vadanti. Tena maggo animittoti vutto. Maggāgamanena phalaṃ animittanti yujjatiyeva. Dukkhānupassanā saṅkhāresu paṇidhiṃ sukkhāpetvā āgatattā appaṇihitā nāma, appaṇihitavipassanāya maggo appaṇihito, appaṇihitamaggassa phalaṃ appaṇihitanti evaṃ vipassanā attano nāmaṃ maggassa deti, maggo phalassāti idaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āgamanato"
      },
      " nāmaṃ nāma. Evaṃ saṅkhārupekkhā vimokkhavisesaṃ niyametīti."
    ],
    "innerText": "Apica maggo nāma pañcahi kāraṇehi nāmaṃ labhati sarasena vā paccanīkena vā saguṇena vā ārammaṇena vā āgamanena vā. Sace hi saṅkhārupekkhā aniccato saṅkhāre sammasitvā vuṭṭhāti, animittavimokkhena vimuccati. Sace dukkhato sammasitvā vuṭṭhāti, appaṇihitavimokkhena vimuccati. Sace anattato sammasitvā vuṭṭhāti, suññatavimokkhena vimuccati. Idaṃ sarasato nāmaṃ nāma. Aniccānupassanāya pana saṅkhārānaṃ ghanavinibbhogaṃ katvā niccanimittadhuvanimittasassatanimittāni pahāya āgatattā animitto, dukkhānupassanāya sukhasaññaṃ pahāya paṇidhipatthanaṃ sukkhāpetvā āgatattā appaṇihito, anattānupassanāya attasattapuggalasaññaṃ pahāya saṅkhāre suññato diṭṭhattā suññatoti idaṃ paccanīkato nāmaṃ nāma. Rāgādīhi pana suññattā suññato, rūpanimittādīnaṃ, rāganimittādīnaṃyeva vā abhāvena animitto, rāgapaṇidhiādīnaṃ abhāvato appaṇihitoti idamassa saguṇato nāmaṃ nāma. Soyaṃ suññaṃ animittaṃ appaṇihitañca nibbānaṃ ārammaṇaṃ karotītipi suññato animitto appaṇihitoti vuccati. Idamassa ārammaṇato nāmaṃ nāma. Āgamanaṃ pana duvidhaṃ vipassanāgamanaṃ maggāgamanañca. Tattha magge vipassanāgamanaṃ labbhati, phale maggāgamanaṃ. Anattānupassanā hi suññatā nāma, suññatavipassanāya maggo suññato, suññatamaggassa phalaṃ suññataṃ. Aniccānupassanā animittā nāma, animittavipassanāya maggo animitto. Idaṃ pana nāmaṃ abhidhammapariyāye na labbhati, suttantapariyāye pana labbhati. Tattha hi gotrabhuñāṇaṃ animittaṃ nibbānaṃ ārammaṇaṃ katvā animittanāmakaṃ hutvā sayaṃ āgamanīyaṭṭhāne ṭhatvā maggassa nāmaṃ detīti vadanti. Tena maggo animittoti vutto. Maggāgamanena phalaṃ animittanti yujjatiyeva. Dukkhānupassanā saṅkhāresu paṇidhiṃ sukkhāpetvā āgatattā appaṇihitā nāma, appaṇihitavipassanāya maggo appaṇihito, appaṇihitamaggassa phalaṃ appaṇihitanti evaṃ vipassanā attano nāmaṃ maggassa deti, maggo phalassāti idaṃ āgamanato nāmaṃ nāma. Evaṃ saṅkhārupekkhā vimokkhavisesaṃ niyametīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ bhagavatā desite tayo mahāvatthuke vimokkhe uddisitvā taṃniddesavaseneva aparepi vimokkhe niddisitukāmo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "apica aṭṭhasaṭṭhi vimokkhā"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "apicā"
      },
      "ti aparapariyāyadassanaṃ. Kathaṃ te aṭṭhasaṭṭhi honti, nanu te pañcasattatīti? Saccaṃ yathārutavasena pañcasattati. Bhagavatā pana desite tayo vimokkhe ṭhapetvā aññavimokkhe niddisanato imesaṃ ",
      " tadavarodhato ca ime tayo na gaṇetabbā, ajjhattavimokkhādayo tayopi vimokkhā ",
      " catudhā vitthāravacaneyeva antogadhattā na gaṇetabbā, ‘‘paṇihito vimokkho, appaṇihito vimokkho’’ti ettha appaṇihito vimokkho paṭhamaṃ uddiṭṭhena ekanāmikattā na gaṇetabbo, evaṃ imesu sattasu apanītesu sesā aṭṭhasaṭṭhi vimokkhā honti. Evaṃ sante suññatavimokkhādayo tayo puna kasmā uddiṭṭhāti ce? Uddesena saṅgahetvā tesampi niddesakaraṇatthaṃ. Ajjhattavuṭṭhānādayo pana tayo pabhedaṃ vinā mūlarāsivasena ",
      " uddiṭṭhā, paṇihitavimokkhapaṭipakkhavasena puna appaṇihito vimokkho uddiṭṭhoti veditabbo."
    ],
    "innerText": "Evaṃ bhagavatā desite tayo mahāvatthuke vimokkhe uddisitvā taṃniddesavaseneva aparepi vimokkhe niddisitukāmo apica aṭṭhasaṭṭhi vimokkhātiādimāha. Tattha apicāti aparapariyāyadassanaṃ. Kathaṃ te aṭṭhasaṭṭhi honti, nanu te pañcasattatīti? Saccaṃ yathārutavasena pañcasattati. Bhagavatā pana desite tayo vimokkhe ṭhapetvā aññavimokkhe niddisanato imesaṃ tadavarodhato ca ime tayo na gaṇetabbā, ajjhattavimokkhādayo tayopi vimokkhā catudhā vitthāravacaneyeva antogadhattā na gaṇetabbā, ‘‘paṇihito vimokkho, appaṇihito vimokkho’’ti ettha appaṇihito vimokkho paṭhamaṃ uddiṭṭhena ekanāmikattā na gaṇetabbo, evaṃ imesu sattasu apanītesu sesā aṭṭhasaṭṭhi vimokkhā honti. Evaṃ sante suññatavimokkhādayo tayo puna kasmā uddiṭṭhāti ce? Uddesena saṅgahetvā tesampi niddesakaraṇatthaṃ. Ajjhattavuṭṭhānādayo pana tayo pabhedaṃ vinā mūlarāsivasena uddiṭṭhā, paṇihitavimokkhapaṭipakkhavasena puna appaṇihito vimokkho uddiṭṭhoti veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ajjhattavuṭṭhānādīsu ajjhattato vuṭṭhātīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ajjhattavuṭṭhāno"
      },
      ". Anulomentīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anulomā"
      },
      ". Ajjhattavuṭṭhānānaṃ paṭippassaddhi apagamā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ajjhattavuṭṭhānapaṭippassaddhi. Rūpī"
      },
      "ti ajjhattaṃ kesādīsu uppāditaṃ rūpajjhānaṃ rūpaṃ, taṃ rūpamassa atthīti rūpī ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rūpāni passatī"
      },
      "ti bahiddhā nīlakasiṇādirūpāni jhānacakkhunā passati. Iminā ajjhattabahiddhāvatthukesu kasiṇesu jhānapaṭilābho dassito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ajjhattaṃ arūpasaññī"
      },
      "ti ajjhattaṃ na rūpasaññī, attano kesādīsu anuppāditarūpāvacarajjhānoti attho. Iminā bahiddhā parikammaṃ katvā bahiddhāva paṭiladdhajjhānatā dassitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Subhanteva adhimutto"
      },
      "ti ‘‘subha’’micceva ārammaṇe adhimutto. Tattha kiñcāpi antoappanāyaṃ ‘‘subha’’nti ābhogo natthi, yo pana appaṭikūlākārena sattārammaṇaṃ pharanto viharati, so yasmā ‘‘subha’’nteva adhimutto hoti, tasmā evaṃ uddeso katoti. Appitappitasamaye eva vikkhambhanavimuttisabbhāvato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samayavimokkho"
      },
      ". Soyeva sakiccakaraṇavasena appitasamaye eva niyuttoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sāmayiko"
      },
      ". Sāmāyikotipi pāṭho. Kopetuṃ bhañjituṃ sakkuṇeyyatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kuppo"
      },
      ". Lokaṃ anatikkamanato loke niyuttoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "lokiko"
      },
      ". Lokiyotipi pāṭho. Lokaṃ uttarati, uttiṇṇoti vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "lokuttaro"
      },
      ". Ārammaṇakaraṇavasena saha āsavehīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sāsavo"
      },
      ". Ārammaṇakaraṇavasena sampayogavasena ca natthettha āsavāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anāsavo"
      },
      ". Rūpasaṅkhātena saha āmisenāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sāmiso"
      },
      ". Sabbaso rūpārūpappahānā nirāmisatopi nirāmisataroti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nirāmisā nirāmisataro. Paṇihito"
      },
      "ti taṇhāvasena paṇihito patthito. Ārammaṇakaraṇavasena saññojanehi saṃyuttattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saññutto. Ekattavimokkho"
      },
      "ti kilesehi anajjhāruḷhattā ekasabhāvo vimokkho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saññāvimokkho"
      },
      "ti vipassanāñāṇameva viparītasaññāya vimuccanato saññāvimokkho. Tadeva vipassanāñāṇaṃ sammohato vimuccanavasena ñāṇameva vimokkhoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ñāṇavimokkho. Sītisiyāvimokkho"
      },
      "ti vipassanāñāṇameva sīti bhaveyyāti ",
      " pavatto vimokkho sītisiyāvimokkho ",
      ". Sītisikāvimokkhotipi pāṭho, sītibhāvikāya vimokkhoti tassa atthaṃ vaṇṇayanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jhānavimokkho"
      },
      "ti ",
      " upacārappanābhedaṃ lokiyalokuttarabhedañca jhānameva vimokkho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anupādā cittassa vimokkho"
      },
      "ti anupādiyitvā gahaṇaṃ akatvā cittassa vimokkho. Sesaṃ vuttanayeneva veditabbanti."
    ],
    "innerText": "Ajjhattavuṭṭhānādīsu ajjhattato vuṭṭhātīti ajjhattavuṭṭhāno. Anulomentīti anulomā. Ajjhattavuṭṭhānānaṃ paṭippassaddhi apagamā ajjhattavuṭṭhānapaṭippassaddhi. Rūpīti ajjhattaṃ kesādīsu uppāditaṃ rūpajjhānaṃ rūpaṃ, taṃ rūpamassa atthīti rūpī rūpāni passatīti bahiddhā nīlakasiṇādirūpāni jhānacakkhunā passati. Iminā ajjhattabahiddhāvatthukesu kasiṇesu jhānapaṭilābho dassito. Ajjhattaṃ arūpasaññīti ajjhattaṃ na rūpasaññī, attano kesādīsu anuppāditarūpāvacarajjhānoti attho. Iminā bahiddhā parikammaṃ katvā bahiddhāva paṭiladdhajjhānatā dassitā. Subhanteva adhimuttoti ‘‘subha’’micceva ārammaṇe adhimutto. Tattha kiñcāpi antoappanāyaṃ ‘‘subha’’nti ābhogo natthi, yo pana appaṭikūlākārena sattārammaṇaṃ pharanto viharati, so yasmā ‘‘subha’’nteva adhimutto hoti, tasmā evaṃ uddeso katoti. Appitappitasamaye eva vikkhambhanavimuttisabbhāvato samayavimokkho. Soyeva sakiccakaraṇavasena appitasamaye eva niyuttoti sāmayiko. Sāmāyikotipi pāṭho. Kopetuṃ bhañjituṃ sakkuṇeyyatāya kuppo. Lokaṃ anatikkamanato loke niyuttoti lokiko. Lokiyotipi pāṭho. Lokaṃ uttarati, uttiṇṇoti vā lokuttaro. Ārammaṇakaraṇavasena saha āsavehīti sāsavo. Ārammaṇakaraṇavasena sampayogavasena ca natthettha āsavāti anāsavo. Rūpasaṅkhātena saha āmisenāti sāmiso. Sabbaso rūpārūpappahānā nirāmisatopi nirāmisataroti nirāmisā nirāmisataro. Paṇihitoti taṇhāvasena paṇihito patthito. Ārammaṇakaraṇavasena saññojanehi saṃyuttattā saññutto. Ekattavimokkhoti kilesehi anajjhāruḷhattā ekasabhāvo vimokkho. Saññāvimokkhoti vipassanāñāṇameva viparītasaññāya vimuccanato saññāvimokkho. Tadeva vipassanāñāṇaṃ sammohato vimuccanavasena ñāṇameva vimokkhoti ñāṇavimokkho. Sītisiyāvimokkhoti vipassanāñāṇameva sīti bhaveyyāti pavatto vimokkho sītisiyāvimokkho . Sītisikāvimokkhotipi pāṭho, sītibhāvikāya vimokkhoti tassa atthaṃ vaṇṇayanti. Jhānavimokkhoti upacārappanābhedaṃ lokiyalokuttarabhedañca jhānameva vimokkho. Anupādā cittassa vimokkhoti anupādiyitvā gahaṇaṃ akatvā cittassa vimokkho. Sesaṃ vuttanayeneva veditabbanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vimokkhuddesavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2. Vimokkhaniddesavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "210"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Katamo"
      },
      "tiādike uddesassa niddese ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "iti paṭisañcikkhatī"
      },
      "ti evaṃ upaparikkhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suññamida"
      },
      "nti idaṃ khandhapañcakaṃ suññaṃ. Kena suññaṃ? Attena vā attaniyena vā. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "attena vā"
      },
      "ti bālajanaparikappitassa attano abhāvā tena attanā ca suññaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attaniyena vā"
      },
      "ti tassa parikappitassa attano santakena ca suññaṃ. Attano abhāveneva attaniyābhāvo. Attaniyañca nāma niccaṃ vā siyā sukhaṃ vā, tadubhayampi natthi. Tena niccapaṭikkhepena aniccānupassanā, sukhapaṭikkhepena dukkhānupassanā ca vuttā hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suññamidaṃ attena vā"
      },
      "ti anattānupassanāyeva vuttā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "So"
      },
      "ti so evaṃ tīhi anupassanāhi vipassamāno bhikkhu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhinivesaṃ na karotī"
      },
      "ti anattānupassanāvasena attābhinivesaṃ na karoti."
    ],
    "innerText": "210.Katamotiādike uddesassa niddese iti paṭisañcikkhatīti evaṃ upaparikkhati. Suññamidanti idaṃ khandhapañcakaṃ suññaṃ. Kena suññaṃ? Attena vā attaniyena vā. Tattha attena vāti bālajanaparikappitassa attano abhāvā tena attanā ca suññaṃ. Attaniyena vāti tassa parikappitassa attano santakena ca suññaṃ. Attano abhāveneva attaniyābhāvo. Attaniyañca nāma niccaṃ vā siyā sukhaṃ vā, tadubhayampi natthi. Tena niccapaṭikkhepena aniccānupassanā, sukhapaṭikkhepena dukkhānupassanā ca vuttā hoti. Suññamidaṃ attena vāti anattānupassanāyeva vuttā. Soti so evaṃ tīhi anupassanāhi vipassamāno bhikkhu. Abhinivesaṃ na karotīti anattānupassanāvasena attābhinivesaṃ na karoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nimittaṃ na karotī"
      },
      "ti aniccānupassanāvasena niccanimittaṃ na karoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṇidhiṃ na karotī"
      },
      "ti dukkhānupassanāvasena paṇidhiṃ na karoti. Ime tayo vimokkhā pariyāyena vipassanākkhaṇe tadaṅgavasenāpi labbhanti, nippariyāyena pana samucchedavasena maggakkhaṇeyeva. Cattāri jhānāni ajjhattaṃ nīvaraṇādīhi vuṭṭhānato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ajjhattavuṭṭhāno vimokkho"
      },
      ". Catasso arūpasamāpattiyo ārammaṇehi vuṭṭhānato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bahiddhāvuṭṭhāno vimokkho"
      },
      ". Ārammaṇampi hi bāhirāyatanāni viya idha ‘‘bahiddhā’’ti vuttaṃ. Ime dve vikkhambhanavimokkhā, dubhato vuṭṭhāno pana samucchedavimokkho."
    ],
    "innerText": "Nimittaṃ na karotīti aniccānupassanāvasena niccanimittaṃ na karoti. Paṇidhiṃ na karotīti dukkhānupassanāvasena paṇidhiṃ na karoti. Ime tayo vimokkhā pariyāyena vipassanākkhaṇe tadaṅgavasenāpi labbhanti, nippariyāyena pana samucchedavasena maggakkhaṇeyeva. Cattāri jhānāni ajjhattaṃ nīvaraṇādīhi vuṭṭhānato ajjhattavuṭṭhāno vimokkho. Catasso arūpasamāpattiyo ārammaṇehi vuṭṭhānato bahiddhāvuṭṭhāno vimokkho. Ārammaṇampi hi bāhirāyatanāni viya idha ‘‘bahiddhā’’ti vuttaṃ. Ime dve vikkhambhanavimokkhā, dubhato vuṭṭhāno pana samucchedavimokkho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nīvaraṇehi vuṭṭhātī"
      },
      "tiādīhi ajjhattavuṭṭhānaṃ sarūpato vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rūpasaññāyā"
      },
      "tiādīhi kasiṇādiārammaṇasamatikkamassa pākaṭattā taṃ ",
      " avatvā suttantesu vuttarūpasaññādisamatikkamo ",
      " vutto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sakkāyadiṭṭhivicikicchāsīlabbataparāmāsā"
      },
      "ti samāsapadaṃ, sakkāyadiṭṭhiyā vicikicchāya sīlabbataparāmāsāti vicchedo. Ayameva vā pāṭho."
    ],
    "innerText": "Nīvaraṇehi vuṭṭhātītiādīhi ajjhattavuṭṭhānaṃ sarūpato vuttaṃ. Rūpasaññāyātiādīhi kasiṇādiārammaṇasamatikkamassa pākaṭattā taṃ avatvā suttantesu vuttarūpasaññādisamatikkamo vutto. Sakkāyadiṭṭhivicikicchāsīlabbataparāmāsāti samāsapadaṃ, sakkāyadiṭṭhiyā vicikicchāya sīlabbataparāmāsāti vicchedo. Ayameva vā pāṭho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "211"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vitakko cā"
      },
      "tiādīhi jhānānaṃ samāpattīnañca upacārabhūmiyo vuttā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aniccānupassanā"
      },
      "tiādīhi catunnaṃ maggānaṃ pubbabhāgavipassanā vuttā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭilābho"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vā"
      },
      "ti pañcavidhavasippattiyā byāpito patthaṭo lābhoti paṭilābho. Vasippattiyā hi sabbo jhānapayogo ca samāpattipayogo ca paṭippassaddho hoti, tasmā paṭilābho ‘‘paṭippassaddhivimokkho’’ti vutto. Vipāko pana jhānassa samāpattiyā ca paṭippassaddhi hotīti ujukameva. Keci pana ‘‘upacārapayogassa paṭippassaddhattā jhānassa samāpattiyā ca paṭilābho hoti, tasmā jhānasamāpattipaṭilābho ‘paṭippassaddhivimokkho’ti vuccatī’’ti vadanti."
    ],
    "innerText": "211.Vitakko cātiādīhi jhānānaṃ samāpattīnañca upacārabhūmiyo vuttā. Aniccānupassanātiādīhi catunnaṃ maggānaṃ pubbabhāgavipassanā vuttā. Paṭilābhovāti pañcavidhavasippattiyā byāpito patthaṭo lābhoti paṭilābho. Vasippattiyā hi sabbo jhānapayogo ca samāpattipayogo ca paṭippassaddho hoti, tasmā paṭilābho ‘‘paṭippassaddhivimokkho’’ti vutto. Vipāko pana jhānassa samāpattiyā ca paṭippassaddhi hotīti ujukameva. Keci pana ‘‘upacārapayogassa paṭippassaddhattā jhānassa samāpattiyā ca paṭilābho hoti, tasmā jhānasamāpattipaṭilābho ‘paṭippassaddhivimokkho’ti vuccatī’’ti vadanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "212"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ajjhatta"
      },
      "nti attānaṃ adhikicca pavattaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paccatta"
      },
      "nti attānaṃ paṭicca pavattaṃ. Ubhayenāpi niyakajjhattameva dīpeti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nīlanimitta"
      },
      "nti nīlameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nīlasaññaṃ paṭilabhatī"
      },
      "ti tasmiṃ nīlanimitte nīlamitisaññaṃ paṭilabhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suggahitaṃ karotī"
      },
      "ti parikammabhūmiyaṃ suṭṭhu uggahitaṃ karoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sūpadhāritaṃ upadhāretī"
      },
      "ti upacārabhūmiyaṃ suṭṭhu upadhāritaṃ katvā upadhāreti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Svāvatthitaṃ avatthāpetī"
      },
      "ti appanābhūmiyaṃ suṭṭhu nicchitaṃ nicchināti. Vavatthāpetītipi pāṭho. Ajjhattañhi nīlaparikammaṃ karonto kese vā pitte vā akkhitārakāyaṃ vā karoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bahiddhā nīlanimitte"
      },
      "ti nīlapupphanīlavatthanīladhātūnaṃ aññatare nīlakasiṇe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cittaṃ upasaṃharatī"
      },
      "ti cittaṃ upaneti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pītā"
      },
      "dīsupi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āsevatī"
      },
      "ti tameva saññaṃ ādito sevati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhāvetī"
      },
      "ti vaḍḍheti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bahulīkarotī"
      },
      "ti punappunaṃ karoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rūpa"
      },
      "nti nīlanimittaṃ rūpaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rūpasaññī"
      },
      "ti tasmiṃ rūpe saññā rūpasaññā, sā assa atthīti rūpasaññī. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ajjhattaṃ pītanimittā"
      },
      "dīsu pītaparikammaṃ karonto mede vā chaviyā vā akkhīnaṃ pītaṭṭhāne vā karoti. Lohitaparikammaṃ karonto maṃse vā lohite vā jivhāya vā hatthatalapādatalesu vā akkhīnaṃ rattaṭṭhāne vā karoti. Odātaparikammaṃ karonto aṭṭhimhi vā dante vā nakhe vā akkhīnaṃ setaṭṭhāne vā karoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ajjhattaṃ arūpa"
      },
      "nti ajjhattaṃ rūpanimittaṃ natthīti attho."
    ],
    "innerText": "212.Ajjhattanti attānaṃ adhikicca pavattaṃ. Paccattanti attānaṃ paṭicca pavattaṃ. Ubhayenāpi niyakajjhattameva dīpeti nīlanimittanti nīlameva. Nīlasaññaṃ paṭilabhatīti tasmiṃ nīlanimitte nīlamitisaññaṃ paṭilabhati. Suggahitaṃ karotīti parikammabhūmiyaṃ suṭṭhu uggahitaṃ karoti. Sūpadhāritaṃ upadhāretīti upacārabhūmiyaṃ suṭṭhu upadhāritaṃ katvā upadhāreti. Svāvatthitaṃ avatthāpetīti appanābhūmiyaṃ suṭṭhu nicchitaṃ nicchināti. Vavatthāpetītipi pāṭho. Ajjhattañhi nīlaparikammaṃ karonto kese vā pitte vā akkhitārakāyaṃ vā karoti. Bahiddhā nīlanimitteti nīlapupphanīlavatthanīladhātūnaṃ aññatare nīlakasiṇe. Cittaṃ upasaṃharatīti cittaṃ upaneti. Pītādīsupi eseva nayo. Āsevatīti tameva saññaṃ ādito sevati. Bhāvetīti vaḍḍheti. Bahulīkarotīti punappunaṃ karoti. Rūpanti nīlanimittaṃ rūpaṃ. Rūpasaññīti tasmiṃ rūpe saññā rūpasaññā, sā assa atthīti rūpasaññī. Ajjhattaṃ pītanimittādīsu pītaparikammaṃ karonto mede vā chaviyā vā akkhīnaṃ pītaṭṭhāne vā karoti. Lohitaparikammaṃ karonto maṃse vā lohite vā jivhāya vā hatthatalapādatalesu vā akkhīnaṃ rattaṭṭhāne vā karoti. Odātaparikammaṃ karonto aṭṭhimhi vā dante vā nakhe vā akkhīnaṃ setaṭṭhāne vā karoti. Ajjhattaṃ arūpanti ajjhattaṃ rūpanimittaṃ natthīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mettāsahagatenā"
      },
      "ti ",
      " paṭhamadutiyatatiyajjhānavasena mettāya samannāgatena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cetasā"
      },
      "ti cittena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekaṃ disa"
      },
      "nti ekaṃ ekissā disāya paṭhamapariggahitaṃ sattaṃ upādāya ekadisāpariyāpannasattapharaṇavasena vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pharitvā"
      },
      "ti phusitvā ārammaṇaṃ katvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Viharatī"
      },
      "ti brahmavihārādhiṭṭhitaṃ ",
      " iriyāpathavihāraṃ pavatteti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tathā dutiya"
      },
      "nti yathā puratthimādīsu yaṃkiñci ekaṃ disaṃ pharitvā viharati, tatheva tadanantaraṃ dutiyaṃ tatiyaṃ catutthaṃ vāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iti uddha"
      },
      "nti eteneva nayena uparimaṃ disanti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adho tiriya"
      },
      "nti adhodisampi tiriyaṃ disampi evameva ",
      ". Tattha ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "adho"
      },
      "ti heṭṭhā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tiriya"
      },
      "nti anudisā. Evaṃ sabbadisāsu assamaṇḍalikāya assamiva mettāsahagataṃ cittaṃ sāretipi paccāsāretipīti. Ettāvatā ekamekaṃ disaṃ pariggahetvā odhiso mettāpharaṇaṃ dassitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbadhī"
      },
      "tiādi pana anodhiso dassanatthaṃ vuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sabbadhī"
      },
      "ti sabbattha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbattatāyā"
      },
      "ti sabbesu hīnamajjhimukkaṭṭhamittasapattamajjhattādippabhedesu attatāya, ‘‘ayaṃ parasatto’’ti vibhāgaṃ akatvā attasamatāyāti vuttaṃ hoti. Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sabbattatāyā"
      },
      "ti sabbena cittabhāvena, īsakampi bahi avikkhipamānoti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbāvanta"
      },
      "nti sabbasattavantaṃ, sabbasattayuttanti attho. Sabbavantantipi pāṭho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Loka"
      },
      "nti sattalokaṃ."
    ],
    "innerText": "Mettāsahagatenāti paṭhamadutiyatatiyajjhānavasena mettāya samannāgatena. Cetasāti cittena. Ekaṃ disanti ekaṃ ekissā disāya paṭhamapariggahitaṃ sattaṃ upādāya ekadisāpariyāpannasattapharaṇavasena vuttaṃ. Pharitvāti phusitvā ārammaṇaṃ katvā. Viharatīti brahmavihārādhiṭṭhitaṃ iriyāpathavihāraṃ pavatteti. Tathā dutiyanti yathā puratthimādīsu yaṃkiñci ekaṃ disaṃ pharitvā viharati, tatheva tadanantaraṃ dutiyaṃ tatiyaṃ catutthaṃ vāti attho. Iti uddhanti eteneva nayena uparimaṃ disanti vuttaṃ hoti. Adho tiriyanti adhodisampi tiriyaṃ disampi evameva . Tattha ca adhoti heṭṭhā. Tiriyanti anudisā. Evaṃ sabbadisāsu assamaṇḍalikāya assamiva mettāsahagataṃ cittaṃ sāretipi paccāsāretipīti. Ettāvatā ekamekaṃ disaṃ pariggahetvā odhiso mettāpharaṇaṃ dassitaṃ. Sabbadhītiādi pana anodhiso dassanatthaṃ vuttaṃ. Tattha sabbadhīti sabbattha. Sabbattatāyāti sabbesu hīnamajjhimukkaṭṭhamittasapattamajjhattādippabhedesu attatāya, ‘‘ayaṃ parasatto’’ti vibhāgaṃ akatvā attasamatāyāti vuttaṃ hoti. Atha vā sabbattatāyāti sabbena cittabhāvena, īsakampi bahi avikkhipamānoti vuttaṃ hoti. Sabbāvantanti sabbasattavantaṃ, sabbasattayuttanti attho. Sabbavantantipi pāṭho. Lokanti sattalokaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vipulenā"
      },
      "ti evamādipariyāyadassanato panettha puna ‘‘mettāsahagatenā’’ti vuttaṃ. Yasmā vā ettha odhiso pharaṇe viya puna tathāsaddo vā iti-saddo vā na vutto, tasmā puna ‘‘mettāsahagatena cetasā’’ti vuttaṃ, nigamanavasena vā etaṃ vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vipulenā"
      },
      "ti ettha pharaṇavasena vipulatā daṭṭhabbā. Bhūmivasena pana taṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mahaggataṃ"
      },
      ". Tañhi kilesavikkhambhanasamatthatāya vipulaphalatāya dīghasantānatāya ca mahantabhāvaṃ gataṃ, mahantehi vā uḷāracchandavīriyacittapaññehi gataṃ paṭipannanti mahaggataṃ. Paguṇavasena appamāṇasattārammaṇavasena ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "appamāṇaṃ"
      },
      ". Byāpādapaccatthikappahānena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "averaṃ"
      },
      ". Domanassappahānato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abyāpajjaṃ,"
      },
      " niddukkhanti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appaṭikūlā hontī"
      },
      "ti bhikkhuno cittassa appaṭikūlā hutvā upaṭṭhahanti. Sesesupi vuttanayeneva karuṇāmuditāupekkhāvasena yojetabbaṃ. Karuṇāya vihesāpaccatthikappahānena averaṃ, muditāya aratipaccatthikappahānena."
    ],
    "innerText": "Vipulenāti evamādipariyāyadassanato panettha puna ‘‘mettāsahagatenā’’ti vuttaṃ. Yasmā vā ettha odhiso pharaṇe viya puna tathāsaddo vā iti-saddo vā na vutto, tasmā puna ‘‘mettāsahagatena cetasā’’ti vuttaṃ, nigamanavasena vā etaṃ vuttaṃ. Vipulenāti ettha pharaṇavasena vipulatā daṭṭhabbā. Bhūmivasena pana taṃ mahaggataṃ. Tañhi kilesavikkhambhanasamatthatāya vipulaphalatāya dīghasantānatāya ca mahantabhāvaṃ gataṃ, mahantehi vā uḷāracchandavīriyacittapaññehi gataṃ paṭipannanti mahaggataṃ. Paguṇavasena appamāṇasattārammaṇavasena ca appamāṇaṃ. Byāpādapaccatthikappahānena averaṃ. Domanassappahānato abyāpajjaṃ, niddukkhanti vuttaṃ hoti. Appaṭikūlā hontīti bhikkhuno cittassa appaṭikūlā hutvā upaṭṭhahanti. Sesesupi vuttanayeneva karuṇāmuditāupekkhāvasena yojetabbaṃ. Karuṇāya vihesāpaccatthikappahānena averaṃ, muditāya aratipaccatthikappahānena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upekkhāsahagatenā"
      },
      "ti ",
      " catutthajjhānavasena upekkhāya samannāgatena. Rāgapaccatthikappahānena averaṃ, gehasitasomanassappahānato abyāpajjaṃ. Sabbampi hi akusalaṃ kilesapariḷāhayogato sabyāpajjamevāti ayametesaṃ viseso."
    ],
    "innerText": "Upekkhāsahagatenāti catutthajjhānavasena upekkhāya samannāgatena. Rāgapaccatthikappahānena averaṃ, gehasitasomanassappahānato abyāpajjaṃ. Sabbampi hi akusalaṃ kilesapariḷāhayogato sabyāpajjamevāti ayametesaṃ viseso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "213"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbaso"
      },
      "ti sabbākārena, sabbāsaṃ vā, anavasesānanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rūpasaññāna"
      },
      "nti saññāsīsena vuttarūpāvacarajjhānānañceva tadārammaṇānañca. Rūpāvacarajjhānampi hi rūpanti vuccati ‘‘rūpī rūpāni passatī’’tiādīsu (paṭi. ma. 1.209; dha. sa. 248), tassa ārammaṇampi ",
      " bahiddhā rūpāni passati ‘‘suvaṇṇadubbaṇṇānī’’tiādīsu (dha. sa. 223). Tasmā idha rūpe saññā rūpasaññāti evaṃ saññāsīsena vuttarūpāvacarajjhānassetaṃ adhivacanaṃ. Rūpaṃ saññā assāti rūpasaññaṃ, rūpamassa nāmanti ",
      " vuttaṃ hoti. Evaṃ pathavīkasiṇādibhedassa tadārammaṇassa cetaṃ adhivacananti veditabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samatikkamā"
      },
      "ti virāgā nirodhā ca. Kiṃ vuttaṃ hoti? Etāsaṃ kusalavipākakiriyāvasena pañcadasannaṃ jhānasaṅkhātānaṃ rūpasaññānaṃ, etesañca pathavīkasiṇādivasena navannaṃ ārammaṇasaṅkhātānaṃ rūpasaññānaṃ sabbākārena, anavasesānaṃ vā virāgā ca nirodhā ca virāgahetu ceva nirodhahetu ca ākāsānañcāyatanaṃ upasampajja viharati. Na hi sakkā sabbaso anatikkantarūpasaññena etaṃ upasampajja viharitunti. Yasmā pana ārammaṇasamatikkamena pattabbā etā samāpattiyo, na ekasmiṃyeva ārammaṇe paṭhamajjhānādīni viya. Ārammaṇe avirattassa ca saññāsamatikkamo na hoti, tasmā ayaṃ ārammaṇasamatikkamavasenāpi atthavaṇṇanā katāti veditabbā."
    ],
    "innerText": "213.Sabbasoti sabbākārena, sabbāsaṃ vā, anavasesānanti attho. Rūpasaññānanti saññāsīsena vuttarūpāvacarajjhānānañceva tadārammaṇānañca. Rūpāvacarajjhānampi hi rūpanti vuccati ‘‘rūpī rūpāni passatī’’tiādīsu (paṭi. ma. 1.209; dha. sa. 248), tassa ārammaṇampi bahiddhā rūpāni passati ‘‘suvaṇṇadubbaṇṇānī’’tiādīsu (dha. sa. 223). Tasmā idha rūpe saññā rūpasaññāti evaṃ saññāsīsena vuttarūpāvacarajjhānassetaṃ adhivacanaṃ. Rūpaṃ saññā assāti rūpasaññaṃ, rūpamassa nāmanti vuttaṃ hoti. Evaṃ pathavīkasiṇādibhedassa tadārammaṇassa cetaṃ adhivacananti veditabbaṃ. Samatikkamāti virāgā nirodhā ca. Kiṃ vuttaṃ hoti? Etāsaṃ kusalavipākakiriyāvasena pañcadasannaṃ jhānasaṅkhātānaṃ rūpasaññānaṃ, etesañca pathavīkasiṇādivasena navannaṃ ārammaṇasaṅkhātānaṃ rūpasaññānaṃ sabbākārena, anavasesānaṃ vā virāgā ca nirodhā ca virāgahetu ceva nirodhahetu ca ākāsānañcāyatanaṃ upasampajja viharati. Na hi sakkā sabbaso anatikkantarūpasaññena etaṃ upasampajja viharitunti. Yasmā pana ārammaṇasamatikkamena pattabbā etā samāpattiyo, na ekasmiṃyeva ārammaṇe paṭhamajjhānādīni viya. Ārammaṇe avirattassa ca saññāsamatikkamo na hoti, tasmā ayaṃ ārammaṇasamatikkamavasenāpi atthavaṇṇanā katāti veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭighasaññānaṃ atthaṅgamā"
      },
      "ti cakkhādīnaṃ vatthūnaṃ rūpādīnaṃ ārammaṇānañca paṭighātena uppannā saññā paṭighasaññā, rūpasaññādīnaṃ etaṃ adhivacanaṃ. Tāsaṃ kusalavipākānaṃ pañcannaṃ, akusalavipākānaṃ pañcannanti sabbaso dasannampi paṭighasaññānaṃ atthaṅgamā pahānā asamuppādā, appavattiṃ katvāti vuttaṃ hoti. Kāmañcetā paṭhamajjhānādīni samāpannassapi na santi, na hi tasmiṃ samaye pañcadvāravasena cittaṃ pavattati, evaṃ santepi aññattha pahīnānaṃ sukhadukkhānaṃ catutthajjhāne viya sakkāyadiṭṭhādīnaṃ tatiyamagge viya ca imasmiṃ jhāne ussāhajananatthaṃ imassa jhānassa pasaṃsāvasena etāsaṃ ettha ",
      " vacanaṃ veditabbaṃ. Atha vā kiñcāpi tā rūpāvacaraṃ samāpannassa na santi, atha kho na pahīnattā na santi. Na hi rūpavirāgāya rūpāvacarabhāvanā saṃvattati, rūpāyattāyeva ca etāsaṃ pavatti. Ayaṃ pana bhāvanā rūpavirāgāya saṃvattati, tasmā tā ettha pahīnāti vattuṃ vaṭṭati. Na kevalañca vattuṃ, ekaṃseneva evaṃ dhāretumpi vaṭṭati. Tāsañhi ito pubbe appahīnattāyeva ‘‘paṭhamajjhānaṃ samāpannassa saddo kaṇṭako’’ti (a. ni. 10.72) vutto bhagavatā. Idha ca pahīnattāyeva arūpasamāpattīnaṃ āneñjatā santavimokkhatā ca vuttā."
    ],
    "innerText": "Paṭighasaññānaṃ atthaṅgamāti cakkhādīnaṃ vatthūnaṃ rūpādīnaṃ ārammaṇānañca paṭighātena uppannā saññā paṭighasaññā, rūpasaññādīnaṃ etaṃ adhivacanaṃ. Tāsaṃ kusalavipākānaṃ pañcannaṃ, akusalavipākānaṃ pañcannanti sabbaso dasannampi paṭighasaññānaṃ atthaṅgamā pahānā asamuppādā, appavattiṃ katvāti vuttaṃ hoti. Kāmañcetā paṭhamajjhānādīni samāpannassapi na santi, na hi tasmiṃ samaye pañcadvāravasena cittaṃ pavattati, evaṃ santepi aññattha pahīnānaṃ sukhadukkhānaṃ catutthajjhāne viya sakkāyadiṭṭhādīnaṃ tatiyamagge viya ca imasmiṃ jhāne ussāhajananatthaṃ imassa jhānassa pasaṃsāvasena etāsaṃ ettha vacanaṃ veditabbaṃ. Atha vā kiñcāpi tā rūpāvacaraṃ samāpannassa na santi, atha kho na pahīnattā na santi. Na hi rūpavirāgāya rūpāvacarabhāvanā saṃvattati, rūpāyattāyeva ca etāsaṃ pavatti. Ayaṃ pana bhāvanā rūpavirāgāya saṃvattati, tasmā tā ettha pahīnāti vattuṃ vaṭṭati. Na kevalañca vattuṃ, ekaṃseneva evaṃ dhāretumpi vaṭṭati. Tāsañhi ito pubbe appahīnattāyeva ‘‘paṭhamajjhānaṃ samāpannassa saddo kaṇṭako’’ti (a. ni. 10.72) vutto bhagavatā. Idha ca pahīnattāyeva arūpasamāpattīnaṃ āneñjatā santavimokkhatā ca vuttā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nānattasaññānaṃ amanasikārā"
      },
      "ti nānatte vā gocare pavattānaṃ saññānaṃ, nānattānaṃ vā saññānaṃ. Yasmā hetā rūpasaddādibhede nānatte nānāsabhāve gocare pavattanti, yasmā cetā aṭṭha kāmāvacarakusalasaññā, dvādasa akusalasaññā, ekādasa kāmāvacarakusalavipākasaññā, dve ",
      " akusalavipākasaññā, ekādasa kāmāvacarakiriyāsaññāti evaṃ catucattālīsampi saññā nānattā nānāsabhāvā aññamaññavisadisā, tasmā ‘‘nānattasaññā’’ti vuttā. Tāsaṃ sabbaso nānattasaññānaṃ ",
      " amanasikārā anāvajjanā citte ca anuppādanā. Yasmā tā nāvajjati citte ca na uppādeti na manasikaroti na paccavekkhati, tasmāti vuttaṃ hoti. Yasmā cettha purimā rūpasaññā paṭighasaññā ca iminā jhānena nibbatte bhavepi na vijjanti, pageva tasmiṃ bhave imaṃ jhānaṃ upasampajja viharaṇakāle, tasmā tāsaṃ samatikkamā atthaṅgamāti dvedhāpi abhāvoyeva vutto. Nānattasaññāsu pana yasmā aṭṭha kāmāvacarakusalasaññā, nava kiriyāsaññā, dasākusalasaññāti imā sattavīsati saññā iminā jhānena nibbatte bhave vijjanti, tasmā tāsaṃ amanasikārāti vuttanti veditabbaṃ. Tatthāpi hi imaṃ jhānaṃ upasampajja viharanto tāsaṃ amanasikārāyeva upasampajja viharati. Tā pana manasikaronto asamāpanno hotīti. Saṅkhepato cettha ‘‘rūpasaññānaṃ samatikkamā’’tiiminā sabbarūpāvacaradhammānaṃ pahānaṃ vuttaṃ. ‘‘Paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā’’tiiminā sabbesaṃ kāmāvacaracittacetasikānaṃ pahānañca amanasikāro ca vuttoti veditabbo."
    ],
    "innerText": "Nānattasaññānaṃ amanasikārāti nānatte vā gocare pavattānaṃ saññānaṃ, nānattānaṃ vā saññānaṃ. Yasmā hetā rūpasaddādibhede nānatte nānāsabhāve gocare pavattanti, yasmā cetā aṭṭha kāmāvacarakusalasaññā, dvādasa akusalasaññā, ekādasa kāmāvacarakusalavipākasaññā, dve akusalavipākasaññā, ekādasa kāmāvacarakiriyāsaññāti evaṃ catucattālīsampi saññā nānattā nānāsabhāvā aññamaññavisadisā, tasmā ‘‘nānattasaññā’’ti vuttā. Tāsaṃ sabbaso nānattasaññānaṃ amanasikārā anāvajjanā citte ca anuppādanā. Yasmā tā nāvajjati citte ca na uppādeti na manasikaroti na paccavekkhati, tasmāti vuttaṃ hoti. Yasmā cettha purimā rūpasaññā paṭighasaññā ca iminā jhānena nibbatte bhavepi na vijjanti, pageva tasmiṃ bhave imaṃ jhānaṃ upasampajja viharaṇakāle, tasmā tāsaṃ samatikkamā atthaṅgamāti dvedhāpi abhāvoyeva vutto. Nānattasaññāsu pana yasmā aṭṭha kāmāvacarakusalasaññā, nava kiriyāsaññā, dasākusalasaññāti imā sattavīsati saññā iminā jhānena nibbatte bhave vijjanti, tasmā tāsaṃ amanasikārāti vuttanti veditabbaṃ. Tatthāpi hi imaṃ jhānaṃ upasampajja viharanto tāsaṃ amanasikārāyeva upasampajja viharati. Tā pana manasikaronto asamāpanno hotīti. Saṅkhepato cettha ‘‘rūpasaññānaṃ samatikkamā’’tiiminā sabbarūpāvacaradhammānaṃ pahānaṃ vuttaṃ. ‘‘Paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā’’tiiminā sabbesaṃ kāmāvacaracittacetasikānaṃ pahānañca amanasikāro ca vuttoti veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ananto"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ākāso"
      },
      "ti ettha paññattimattattā nāssa uppādanto vā vayanto vā paññāyatīti ananto, anantapharaṇavasenāpi ananto. Na hi so yogī ekadesavasena pharati, sakalavaseneva pharati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ākāso"
      },
      "ti kasiṇugghāṭimākāso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ākāsānañcāyatanā"
      },
      "dīni vuttatthāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upasampajja viharatī"
      },
      "ti taṃ patvā nipphādetvā tadanurūpena iriyāpathena viharati. Tadeva samāpajjitabbato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samāpatti"
      },
      "."
    ],
    "innerText": "Anantoākāsoti ettha paññattimattattā nāssa uppādanto vā vayanto vā paññāyatīti ananto, anantapharaṇavasenāpi ananto. Na hi so yogī ekadesavasena pharati, sakalavaseneva pharati. Ākāsoti kasiṇugghāṭimākāso. Ākāsānañcāyatanādīni vuttatthāni. Upasampajja viharatīti taṃ patvā nipphādetvā tadanurūpena iriyāpathena viharati. Tadeva samāpajjitabbato samāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ākāsānañcāyatanaṃ samatikkammā"
      },
      "ti pubbe vuttanayena jhānampi ākāsānañcāyatanaṃ ārammaṇampi. Ārammaṇampi hi pubbe vuttanayeneva ākāsānañcaṃ ca taṃ paṭhamassa āruppajjhānassa ārammaṇattā devānaṃ devāyatanaṃ viya adhiṭṭhānaṭṭhena āyatanañcāti ākāsānañcāyatanaṃ, tathā ākāsānañcaṃ ca taṃ tassa jhānassa sañjātihetuttā ‘‘kambojā assānaṃ āyatana’’ntiādīni viya sañjātidesaṭṭhena āyatanañcātipi ākāsānañcāyatanaṃ. Evametaṃ jhānañca ārammaṇañcāti ubhayampi appavattikaraṇena ca amanasikaraṇena ca samatikkamitvāva yasmā idaṃ viññāṇañcāyatanaṃ upasampajja vihātabbaṃ, tasmā ubhayampetamekajjhaṃ katvā ‘‘ākāsānañcāyatanaṃ samatikkammā’’ti idaṃ vuttanti veditabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anantaṃ viññāṇa"
      },
      "nti taṃyeva ‘‘ananto ākāso’’ti pharitvā pavattaṃ viññāṇaṃ ‘‘anantaṃ viññāṇa’’nti ",
      " manasikarontoti vuttaṃ hoti. Manasikāravasena vā anantaṃ. So hi taṃ ākāsārammaṇaṃ viññāṇaṃ anavasesato manasikaronto anantaṃ manasi karoti."
    ],
    "innerText": "Ākāsānañcāyatanaṃ samatikkammāti pubbe vuttanayena jhānampi ākāsānañcāyatanaṃ ārammaṇampi. Ārammaṇampi hi pubbe vuttanayeneva ākāsānañcaṃ ca taṃ paṭhamassa āruppajjhānassa ārammaṇattā devānaṃ devāyatanaṃ viya adhiṭṭhānaṭṭhena āyatanañcāti ākāsānañcāyatanaṃ, tathā ākāsānañcaṃ ca taṃ tassa jhānassa sañjātihetuttā ‘‘kambojā assānaṃ āyatana’’ntiādīni viya sañjātidesaṭṭhena āyatanañcātipi ākāsānañcāyatanaṃ. Evametaṃ jhānañca ārammaṇañcāti ubhayampi appavattikaraṇena ca amanasikaraṇena ca samatikkamitvāva yasmā idaṃ viññāṇañcāyatanaṃ upasampajja vihātabbaṃ, tasmā ubhayampetamekajjhaṃ katvā ‘‘ākāsānañcāyatanaṃ samatikkammā’’ti idaṃ vuttanti veditabbaṃ. Anantaṃ viññāṇanti taṃyeva ‘‘ananto ākāso’’ti pharitvā pavattaṃ viññāṇaṃ ‘‘anantaṃ viññāṇa’’nti manasikarontoti vuttaṃ hoti. Manasikāravasena vā anantaṃ. So hi taṃ ākāsārammaṇaṃ viññāṇaṃ anavasesato manasikaronto anantaṃ manasi karoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Viññāṇañcāyatanaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samatikkammā"
      },
      "ti etthāpi ca pubbe vuttanayeneva jhānampi viññāṇañcāyatanaṃ ārammaṇampi. Ārammaṇampi hi pubbe vuttanayeneva viññāṇañcaṃ ca taṃ dutiyassa āruppajjhānassa ārammaṇattā adhiṭṭhānaṭṭhena āyatanañcāti viññāṇañcāyatanaṃ, tathā viññāṇañcaṃ ca taṃ tasseva jhānassa sañjātihetuttā sañjātidesaṭṭhena āyatanañcātipi viññāṇañcāyatanaṃ. Evametaṃ jhānañca ārammaṇañcāti ubhayampi appavattikaraṇena ca amanasikaraṇena ca samatikkamitvāva yasmā idaṃ ākiñcaññāyatanaṃ upasampajja vihātabbaṃ, tasmā ubhayampetamekajjhaṃ katvā ‘‘viññāṇañcāyatanaṃ samatikkammā’’ti idaṃ vuttanti veditabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Natthi kiñcī"
      },
      "ti natthi natthi, suññaṃ suññaṃ, vivittaṃ vivittanti evaṃ manasikarontoti vuttaṃ hoti."
    ],
    "innerText": "Viññāṇañcāyatanaṃsamatikkammāti etthāpi ca pubbe vuttanayeneva jhānampi viññāṇañcāyatanaṃ ārammaṇampi. Ārammaṇampi hi pubbe vuttanayeneva viññāṇañcaṃ ca taṃ dutiyassa āruppajjhānassa ārammaṇattā adhiṭṭhānaṭṭhena āyatanañcāti viññāṇañcāyatanaṃ, tathā viññāṇañcaṃ ca taṃ tasseva jhānassa sañjātihetuttā sañjātidesaṭṭhena āyatanañcātipi viññāṇañcāyatanaṃ. Evametaṃ jhānañca ārammaṇañcāti ubhayampi appavattikaraṇena ca amanasikaraṇena ca samatikkamitvāva yasmā idaṃ ākiñcaññāyatanaṃ upasampajja vihātabbaṃ, tasmā ubhayampetamekajjhaṃ katvā ‘‘viññāṇañcāyatanaṃ samatikkammā’’ti idaṃ vuttanti veditabbaṃ. Natthi kiñcīti natthi natthi, suññaṃ suññaṃ, vivittaṃ vivittanti evaṃ manasikarontoti vuttaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ākiñcaññāyatanaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samatikkammā"
      },
      "ti etthāpi pubbe vuttanayeneva jhānampi ākiñcaññāyatanaṃ ārammaṇampi. Ārammaṇampi hi pubbe vuttanayeneva ākiñcaññañca taṃ tatiyassa āruppajjhānassa ārammaṇattā adhiṭṭhānaṭṭhena āyatanañcāti ākiñcaññāyatanaṃ, tathā ākiñcaññañca taṃ tasseva jhānassa sañjātihetuttā sañjātidesaṭṭhena āyatanañcātipi ākiñcaññāyatanaṃ. Evametaṃ jhānañca ārammaṇañcāti ubhayampi appavattikaraṇena ca amanasikaraṇena ca samatikkamitvāva yasmā idaṃ nevasaññānāsaññāyatanaṃ upasampajja vihātabbaṃ, tasmā ubhayampetamekajjhaṃ katvā ‘‘ākiñcaññāyatanaṃ samatikkammā’’ti idaṃ vuttanti veditabbaṃ. Saññāvedayitanirodhakathā heṭṭhā kathitāva."
    ],
    "innerText": "Ākiñcaññāyatanaṃsamatikkammāti etthāpi pubbe vuttanayeneva jhānampi ākiñcaññāyatanaṃ ārammaṇampi. Ārammaṇampi hi pubbe vuttanayeneva ākiñcaññañca taṃ tatiyassa āruppajjhānassa ārammaṇattā adhiṭṭhānaṭṭhena āyatanañcāti ākiñcaññāyatanaṃ, tathā ākiñcaññañca taṃ tasseva jhānassa sañjātihetuttā sañjātidesaṭṭhena āyatanañcātipi ākiñcaññāyatanaṃ. Evametaṃ jhānañca ārammaṇañcāti ubhayampi appavattikaraṇena ca amanasikaraṇena ca samatikkamitvāva yasmā idaṃ nevasaññānāsaññāyatanaṃ upasampajja vihātabbaṃ, tasmā ubhayampetamekajjhaṃ katvā ‘‘ākiñcaññāyatanaṃ samatikkammā’’ti idaṃ vuttanti veditabbaṃ. Saññāvedayitanirodhakathā heṭṭhā kathitāva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Rūpī rūpāni passatī’’tiādikā satta vimokkhā paccanīkadhammehi suṭṭhu vimuccanaṭṭhena ārammaṇe abhirativasena suṭṭhu muccanaṭṭhena ca vimokkhā, nirodhasamāpatti pana cittacetasikehi vimuttaṭṭhena vimokkho. Samāpattisamāpannasamaye vimutto hoti, vuṭṭhitasamaye avimutto hotīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samayavimokkho"
      },
      ". Samucchedavimuttivasena accantavimuttattā ariyamaggā, paṭippassaddhivimuttivasena accantavimuttattā sāmaññaphalāni, nissaraṇavimuttivasena accantavimuttattā nibbānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asamayavimokkho"
      },
      ". Tathā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sāmayikāsāmayikavimokkhā"
      },
      "."
    ],
    "innerText": "‘‘Rūpī rūpāni passatī’’tiādikā satta vimokkhā paccanīkadhammehi suṭṭhu vimuccanaṭṭhena ārammaṇe abhirativasena suṭṭhu muccanaṭṭhena ca vimokkhā, nirodhasamāpatti pana cittacetasikehi vimuttaṭṭhena vimokkho. Samāpattisamāpannasamaye vimutto hoti, vuṭṭhitasamaye avimutto hotīti samayavimokkho. Samucchedavimuttivasena accantavimuttattā ariyamaggā, paṭippassaddhivimuttivasena accantavimuttattā sāmaññaphalāni, nissaraṇavimuttivasena accantavimuttattā nibbānaṃ asamayavimokkho. Tathā sāmayikāsāmayikavimokkhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pamādaṃ āgamma parihāyatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kuppo"
      },
      ". Tathā na parihāyatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "akuppo"
      },
      ". Lokāya saṃvattatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "lokiyo"
      },
      ". Ariyamaggā lokaṃ uttarantīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "lokuttarā,"
      },
      " sāmaññaphalāni nibbānañca lokato uttiṇṇāti lokuttarā. Ādittaṃ ayoguḷaṃ makkhikā viya tejussadaṃ lokuttaraṃ dhammaṃ āsavā nālambantīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anāsavo. Rūpappaṭisaññutto"
      },
      "ti ",
      " rūpajjhānāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Arūpappaṭisaññutto"
      },
      "ti arūpasamāpattiyo. Taṇhāya ālambito ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṇihito"
      },
      ". Anālambito ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "appaṇihito"
      },
      ". Maggaphalāni ekārammaṇattā ekaniṭṭhattā ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekattavimokkho,"
      },
      " nibbānaṃ adutiyattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekattavimokkho,"
      },
      " ārammaṇanānattā vipākanānattā ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nānattavimokkho"
      },
      "."
    ],
    "innerText": "Pamādaṃ āgamma parihāyatīti kuppo. Tathā na parihāyatīti akuppo. Lokāya saṃvattatīti lokiyo. Ariyamaggā lokaṃ uttarantīti lokuttarā, sāmaññaphalāni nibbānañca lokato uttiṇṇāti lokuttarā. Ādittaṃ ayoguḷaṃ makkhikā viya tejussadaṃ lokuttaraṃ dhammaṃ āsavā nālambantīti anāsavo. Rūpappaṭisaññuttoti rūpajjhānāni. Arūpappaṭisaññuttoti arūpasamāpattiyo. Taṇhāya ālambito paṇihito. Anālambito appaṇihito. Maggaphalāni ekārammaṇattā ekaniṭṭhattā ca ekattavimokkho, nibbānaṃ adutiyattā ekattavimokkho, ārammaṇanānattā vipākanānattā ca nānattavimokkho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "214"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Siyā"
      },
      "ti bhaveyya, dasa hontīti ca eko hotīti ca bhaveyyāti attho. ‘‘Siyā’’ti ca etaṃ vidhivacanaṃ, na pucchāvacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vatthuvasenā"
      },
      "ti niccasaññādidasavatthuvasena dasa honti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pariyāyenā"
      },
      "ti vimuccanapariyāyena ",
      " eko hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Siyāti kathañca siyā"
      },
      "ti yaṃ vā siyāti vihitaṃ, taṃ kathaṃ siyāti pucchati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aniccānupassanañāṇa"
      },
      "nti samāsapadaṃ. Aniccānupassanāñāṇanti vā pāṭho. Tathā sesesupi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Niccato saññāyā"
      },
      "ti niccato pavattāya saññāya, ‘‘nicca’’nti pavattāya saññāyāti attho. Esa nayo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sukhato attato nimittato saññāyā"
      },
      "ti etthāpi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nimittato"
      },
      "ti ca niccanimittato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nandiyā saññāyā"
      },
      "ti nandivasena pavattāya saññāya, nandisampayuttāya saññāyāti attho. Esa nayo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rāgato samudayato ādānato paṇidhito abhinivesato saññāyā"
      },
      "ti etthāpi. Yasmā pana khayavayavipariṇāmānupassanā tisso aniccānupassanādīnaṃ balavabhāvāya balavapaccayabhūtā bhaṅgānupassanāvisesā. Bhaṅgadassanena hi aniccānupassanā balavatī hoti. Aniccānupassanāya ca balavatiyā jātāya ‘‘yadaniccaṃ taṃ dukkhaṃ, yaṃ dukkhaṃ tadanattā’’ti (saṃ. ni. 3.15) dukkhānattānupassanāpi balavatiyo honti. Tasmā aniccānupassanādīsu vuttāsu tāpi tisso vuttāva honti. Yasmā ca suññatānupassanā ‘‘abhinivesato saññāya muccatī’’ti vacaneneva sārādānābhinivesasammohābhinivesaālayābhinivesasaññogābhinivesato saññāya muccatīti vuttameva hoti, abhinivesābhāveneva appaṭisaṅkhāto saññāya muccatīti vuttameva hoti, tasmā adhipaññādhammavipassanādayo pañcapi anupassanā na vuttāti veditabbā. Evaṃ aṭṭhārasasu mahāvipassanāsu etā aṭṭha anupassanā avatvā daseva anupassanā vuttāti veditabbā."
    ],
    "innerText": "214.Siyāti bhaveyya, dasa hontīti ca eko hotīti ca bhaveyyāti attho. ‘‘Siyā’’ti ca etaṃ vidhivacanaṃ, na pucchāvacanaṃ. Vatthuvasenāti niccasaññādidasavatthuvasena dasa honti. Pariyāyenāti vimuccanapariyāyena eko hoti. Siyāti kathañca siyāti yaṃ vā siyāti vihitaṃ, taṃ kathaṃ siyāti pucchati. Aniccānupassanañāṇanti samāsapadaṃ. Aniccānupassanāñāṇanti vā pāṭho. Tathā sesesupi. Niccato saññāyāti niccato pavattāya saññāya, ‘‘nicca’’nti pavattāya saññāyāti attho. Esa nayo sukhato attato nimittato saññāyāti etthāpi. Nimittatoti ca niccanimittato. Nandiyā saññāyāti nandivasena pavattāya saññāya, nandisampayuttāya saññāyāti attho. Esa nayo rāgato samudayato ādānato paṇidhito abhinivesato saññāyāti etthāpi. Yasmā pana khayavayavipariṇāmānupassanā tisso aniccānupassanādīnaṃ balavabhāvāya balavapaccayabhūtā bhaṅgānupassanāvisesā. Bhaṅgadassanena hi aniccānupassanā balavatī hoti. Aniccānupassanāya ca balavatiyā jātāya ‘‘yadaniccaṃ taṃ dukkhaṃ, yaṃ dukkhaṃ tadanattā’’ti (saṃ. ni. 3.15) dukkhānattānupassanāpi balavatiyo honti. Tasmā aniccānupassanādīsu vuttāsu tāpi tisso vuttāva honti. Yasmā ca suññatānupassanā ‘‘abhinivesato saññāya muccatī’’ti vacaneneva sārādānābhinivesasammohābhinivesaālayābhinivesasaññogābhinivesato saññāya muccatīti vuttameva hoti, abhinivesābhāveneva appaṭisaṅkhāto saññāya muccatīti vuttameva hoti, tasmā adhipaññādhammavipassanādayo pañcapi anupassanā na vuttāti veditabbā. Evaṃ aṭṭhārasasu mahāvipassanāsu etā aṭṭha anupassanā avatvā daseva anupassanā vuttāti veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "215"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aniccānupassanā yathābhūtaṃ ñāṇa"
      },
      "nti aniccānupassanāyeva yathābhūtañāṇaṃ. Ubhayampi paccattavacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathābhūtañāṇa"
      },
      "nti ñāṇattho vutto. Evaṃ sesesupi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammohā aññāṇā"
      },
      "ti sammohabhūtā aññāṇā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Muccatī"
      },
      "ti vimokkhattho vutto."
    ],
    "innerText": "215.Aniccānupassanā yathābhūtaṃ ñāṇanti aniccānupassanāyeva yathābhūtañāṇaṃ. Ubhayampi paccattavacanaṃ. Yathābhūtañāṇanti ñāṇattho vutto. Evaṃ sesesupi. Sammohā aññāṇāti sammohabhūtā aññāṇā. Muccatīti vimokkhattho vutto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "216"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aniccānupassanā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anuttaraṃ sītibhāvañāṇa"
      },
      "nti ettha sāsaneyeva sabbhāvato uttamaṭṭhena anuttaraṃ, anuttarassa paccayattā vā anuttaraṃ, sītibhāvo eva ñāṇaṃ sītibhāvañāṇaṃ. Taṃ aniccānupassanāsaṅkhātaṃ ",
      " anuttaraṃ sītibhāvañāṇaṃ. ‘‘Chahi, bhikkhave, dhammehi samannāgato bhikkhu bhabbo ",
      " anuttaraṃ sītibhāvaṃ sacchikātu’’nti (a. ni. 6.85) ettha nibbānaṃ anuttaro sītibhāvo nāma. Idha pana vipassanā anuttaro sītibhāvo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Niccato santāpapariḷāhadarathā muccatī"
      },
      "ti etthāpi ‘‘nicca’’nti pavattakilesā eva idha cāmutra ca santāpanaṭṭhena santāpo, paridahanaṭṭhena pariḷāho, uṇhaṭṭhena darathoti vuccanti."
    ],
    "innerText": "216.Aniccānupassanāanuttaraṃ sītibhāvañāṇanti ettha sāsaneyeva sabbhāvato uttamaṭṭhena anuttaraṃ, anuttarassa paccayattā vā anuttaraṃ, sītibhāvo eva ñāṇaṃ sītibhāvañāṇaṃ. Taṃ aniccānupassanāsaṅkhātaṃ anuttaraṃ sītibhāvañāṇaṃ. ‘‘Chahi, bhikkhave, dhammehi samannāgato bhikkhu bhabbo anuttaraṃ sītibhāvaṃ sacchikātu’’nti (a. ni. 6.85) ettha nibbānaṃ anuttaro sītibhāvo nāma. Idha pana vipassanā anuttaro sītibhāvo. Niccato santāpapariḷāhadarathā muccatīti etthāpi ‘‘nicca’’nti pavattakilesā eva idha cāmutra ca santāpanaṭṭhena santāpo, paridahanaṭṭhena pariḷāho, uṇhaṭṭhena darathoti vuccanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "217"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nekkhammaṃ jhāyatīti jhāna"
      },
      "ntiādayo heṭṭhā vuttatthā. Nekkhammādīni cettha aṭṭha samāpattiyo ca nibbedhabhāgiyāneva."
    ],
    "innerText": "217.Nekkhammaṃ jhāyatīti jhānantiādayo heṭṭhā vuttatthā. Nekkhammādīni cettha aṭṭha samāpattiyo ca nibbedhabhāgiyāneva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "218"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anupādā cittassa vimokkho"
      },
      "ti idha vipassanāyeva. ‘‘Etadatthā kathā, etadatthā mantanā, yadidaṃ anupādā cittassa vimokkho’’ti (pari. 366; a. ni. 3.68) ettha pana nibbānaṃ anupādā cittassa vimokkho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Katihupādānehī"
      },
      "ti katihi upādānehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Katamā ekupādānā"
      },
      "ti katamato ekupādānato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idaṃ ekupādānā"
      },
      "ti ito ekato upādānato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ida"
      },
      "nti pubbañāṇāpekkhaṃ vā. Upādānato muccanesu yasmā ādito saṅkhārānaṃ udayabbayaṃ passitvā passitvā aniccānupassanāya vipassati, pacchā saṅkhārānaṃ bhaṅgameva passitvā animittānupassanāya vipassati. Aniccānupassanāvisesoyeva hi animittānupassanā. Saṅkhārānaṃ udayabbayadassanena ca bhaṅgadassanena ca attābhāvo pākaṭo hoti. Tena diṭṭhupādānassa ca attavādupādānassa ca pahānaṃ hoti. Diṭṭhippahāneneva ca ‘‘sīlabbatena attā sujjhatī’’ti dassanassa abhāvato sīlabbatupādānassa pahānaṃ hoti. Yasmā ca anattānupassanāya ujukameva attābhāvaṃ passati, anattānupassanāvisesoyeva ca suññatānupassanā, tasmā imāni cattāri ñāṇāni diṭṭhupādānādīhi tīhi upādānehi muccanti. Dukkhānupassanādīnaṃyeva pana catassannaṃ taṇhāya ujuvipaccanīkattā aniccānupassanādīnaṃ catassannaṃ kāmupādānato muccanaṃ na vuttaṃ. Yasmā ādito dukkhānupassanāya ‘‘saṅkhārā dukkhā’’ti passato pacchā appaṇihitānupassanāya ca ‘‘saṅkhārā dukkhā’’ti passato saṅkhārānaṃ patthanā pahīyati. Dukkhānupassanāvisesoyeva hi appaṇihitānupassanā. Yasmā ca saṅkhāresu nibbidānupassanāya nibbindantassa virāgānupassanāya ",
      " virajjantassa saṅkhārānaṃ patthanā pahīyati, tasmā imāni cattāri ñāṇāni kāmupādānato muccanti. Yasmā nirodhānupassanāya kilese nirodheti, paṭinissaggānupassanāya kilese ",
      " pariccajati, tasmā imāni dve ñāṇāni catūhi upādānehi muccantīti evaṃ sabhāvanānattena ca ākāranānattena ca aṭṭhasaṭṭhi vimokkhā niddiṭṭhā."
    ],
    "innerText": "218.Anupādā cittassa vimokkhoti idha vipassanāyeva. ‘‘Etadatthā kathā, etadatthā mantanā, yadidaṃ anupādā cittassa vimokkho’’ti (pari. 366; a. ni. 3.68) ettha pana nibbānaṃ anupādā cittassa vimokkho. Katihupādānehīti katihi upādānehi. Katamā ekupādānāti katamato ekupādānato. Idaṃ ekupādānāti ito ekato upādānato. Idanti pubbañāṇāpekkhaṃ vā. Upādānato muccanesu yasmā ādito saṅkhārānaṃ udayabbayaṃ passitvā passitvā aniccānupassanāya vipassati, pacchā saṅkhārānaṃ bhaṅgameva passitvā animittānupassanāya vipassati. Aniccānupassanāvisesoyeva hi animittānupassanā. Saṅkhārānaṃ udayabbayadassanena ca bhaṅgadassanena ca attābhāvo pākaṭo hoti. Tena diṭṭhupādānassa ca attavādupādānassa ca pahānaṃ hoti. Diṭṭhippahāneneva ca ‘‘sīlabbatena attā sujjhatī’’ti dassanassa abhāvato sīlabbatupādānassa pahānaṃ hoti. Yasmā ca anattānupassanāya ujukameva attābhāvaṃ passati, anattānupassanāvisesoyeva ca suññatānupassanā, tasmā imāni cattāri ñāṇāni diṭṭhupādānādīhi tīhi upādānehi muccanti. Dukkhānupassanādīnaṃyeva pana catassannaṃ taṇhāya ujuvipaccanīkattā aniccānupassanādīnaṃ catassannaṃ kāmupādānato muccanaṃ na vuttaṃ. Yasmā ādito dukkhānupassanāya ‘‘saṅkhārā dukkhā’’ti passato pacchā appaṇihitānupassanāya ca ‘‘saṅkhārā dukkhā’’ti passato saṅkhārānaṃ patthanā pahīyati. Dukkhānupassanāvisesoyeva hi appaṇihitānupassanā. Yasmā ca saṅkhāresu nibbidānupassanāya nibbindantassa virāgānupassanāya virajjantassa saṅkhārānaṃ patthanā pahīyati, tasmā imāni cattāri ñāṇāni kāmupādānato muccanti. Yasmā nirodhānupassanāya kilese nirodheti, paṭinissaggānupassanāya kilese pariccajati, tasmā imāni dve ñāṇāni catūhi upādānehi muccantīti evaṃ sabhāvanānattena ca ākāranānattena ca aṭṭhasaṭṭhi vimokkhā niddiṭṭhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "219"
      },
      ". Idāni ",
      " ādito uddiṭṭhānaṃ tiṇṇaṃ vimokkhānaṃ mukhāni dassetvā vimokkhamukhapubbaṅgamaṃ indriyavisesaṃ puggalavisesañca dassetukāmo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tīṇi kho panimānī"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vimokkhamukhānī"
      },
      "ti tiṇṇaṃ vimokkhānaṃ mukhāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lokaniyyānāya saṃvattantī"
      },
      "ti tedhātukalokato niyyānāya niggamanāya saṃvattanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbasaṅkhāre paricchedaparivaṭumato samanupassanatāyā"
      },
      "ti sabbesaṃ saṅkhārānaṃ udayabbayavasena paricchedato ceva parivaṭumato ca samanupassanatāya. Lokaniyyānaṃ hotīti pāṭhaseso. Aniccānupassanā hi udayato pubbe saṅkhārā natthīti paricchinditvā tesaṃ gatiṃ samannesamānā vayato paraṃ na gacchanti, ettheva antaradhāyantīti parivaṭumato pariyantato samanupassati. Sabbasaṅkhārā hi udayena pubbantaparicchinnā, vayena aparantaparicchinnā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Animittāya ca dhātuyā cittasampakkhandanatāyā"
      },
      "ti vipassanākkhaṇepi nibbānaninnatāya animittākārena upaṭṭhānato animittasaṅkhātāya nibbānadhātuyā cittapavisanatāya ca lokaniyyānaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Manosamuttejanatāyā"
      },
      "ti cittasaṃvejanatāya. Dukkhānupassanāya hi saṅkhāresu cittaṃ saṃvijjati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appaṇihitāya ca dhātuyā"
      },
      "ti vipassanākkhaṇepi nibbānaninnatāya appaṇihitākārena upaṭṭhānato appaṇihitasaṅkhātāya nibbānadhātuyā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbadhamme"
      },
      "ti nibbānassa avipassanupagattepi anattasabhāvasabbhāvato ‘‘sabbasaṅkhāre’’ti avatvā ‘‘sabbadhamme’’ti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parato samanupassanatāyā"
      },
      "ti paccayāyattattā avasatāya avidheyyatāya ca ‘‘nāhaṃ na mama’’nti evaṃ anattato samanupassanatāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suññatāya ca dhātuyā"
      },
      "ti vipassanākkhaṇepi nibbānaninnatāya suññatākārena upaṭṭhānato suññatāsaṅkhātāya nibbānadhātuyā. Iti imāni tīṇi vacanāni aniccadukkhānattānupassanānaṃ vasena vuttāni. Teneva tadanantaraṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aniccato manasikaroto"
      },
      "tiādi vuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "khayato"
      },
      "ti khīyanato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhayato"
      },
      "ti sabhayato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suññato"
      },
      "ti attarahitato."
    ],
    "innerText": "219. Idāni ādito uddiṭṭhānaṃ tiṇṇaṃ vimokkhānaṃ mukhāni dassetvā vimokkhamukhapubbaṅgamaṃ indriyavisesaṃ puggalavisesañca dassetukāmo tīṇi kho panimānītiādimāha. Tattha vimokkhamukhānīti tiṇṇaṃ vimokkhānaṃ mukhāni. Lokaniyyānāya saṃvattantīti tedhātukalokato niyyānāya niggamanāya saṃvattanti. Sabbasaṅkhāre paricchedaparivaṭumato samanupassanatāyāti sabbesaṃ saṅkhārānaṃ udayabbayavasena paricchedato ceva parivaṭumato ca samanupassanatāya. Lokaniyyānaṃ hotīti pāṭhaseso. Aniccānupassanā hi udayato pubbe saṅkhārā natthīti paricchinditvā tesaṃ gatiṃ samannesamānā vayato paraṃ na gacchanti, ettheva antaradhāyantīti parivaṭumato pariyantato samanupassati. Sabbasaṅkhārā hi udayena pubbantaparicchinnā, vayena aparantaparicchinnā. Animittāya ca dhātuyā cittasampakkhandanatāyāti vipassanākkhaṇepi nibbānaninnatāya animittākārena upaṭṭhānato animittasaṅkhātāya nibbānadhātuyā cittapavisanatāya ca lokaniyyānaṃ hoti. Manosamuttejanatāyāti cittasaṃvejanatāya. Dukkhānupassanāya hi saṅkhāresu cittaṃ saṃvijjati. Appaṇihitāya ca dhātuyāti vipassanākkhaṇepi nibbānaninnatāya appaṇihitākārena upaṭṭhānato appaṇihitasaṅkhātāya nibbānadhātuyā. Sabbadhammeti nibbānassa avipassanupagattepi anattasabhāvasabbhāvato ‘‘sabbasaṅkhāre’’ti avatvā ‘‘sabbadhamme’’ti vuttaṃ. Parato samanupassanatāyāti paccayāyattattā avasatāya avidheyyatāya ca ‘‘nāhaṃ na mama’’nti evaṃ anattato samanupassanatāya. Suññatāya ca dhātuyāti vipassanākkhaṇepi nibbānaninnatāya suññatākārena upaṭṭhānato suññatāsaṅkhātāya nibbānadhātuyā. Iti imāni tīṇi vacanāni aniccadukkhānattānupassanānaṃ vasena vuttāni. Teneva tadanantaraṃ aniccato manasikarototiādi vuttaṃ. Tattha khayatoti khīyanato. Bhayatoti sabhayato. Suññatoti attarahitato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adhimokkhabahula"
      },
      "nti ",
      " aniccānupassanāya ‘‘khaṇabhaṅgavasena saṅkhārā bhijjantī’’ti saddhāya paṭipannassa paccakkhato khaṇabhaṅgadassanena ‘‘saccaṃ vatāha bhagavā’’ti bhagavati saddhāya saddhābahulaṃ cittaṃ hoti. Atha vā paccuppannānaṃ padesasaṅkhārānaṃ aniccataṃ passitvā ‘‘evaṃ aniccā atītānāgatapaccuppannā sabbe saṅkhārā’’ti adhimuccanato adhimokkhabahulaṃ cittaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Passaddhibahula"
      },
      "nti dukkhānupassanāya cittakkhobhakarāya paṇidhiyā pajahanato cittadarathābhāvena passaddhibahulaṃ cittaṃ hoti. Atha vā dukkhānupassanāya saṃvegajananato saṃviggassa ",
      " ca yoniso padahanato vikkhepābhāvena passaddhibahulaṃ ",
      " cittaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vedabahula"
      },
      "nti anattānupassanāya bāhirakehi adiṭṭhaṃ gambhīraṃ anattalakkhaṇaṃ passato ñāṇabahulaṃ cittaṃ hoti. Atha vā ‘‘sadevakena lokena adiṭṭhaṃ anattalakkhaṇaṃ diṭṭha’’nti tuṭṭhassa tuṭṭhibahulaṃ cittaṃ hoti."
    ],
    "innerText": "Adhimokkhabahulanti aniccānupassanāya ‘‘khaṇabhaṅgavasena saṅkhārā bhijjantī’’ti saddhāya paṭipannassa paccakkhato khaṇabhaṅgadassanena ‘‘saccaṃ vatāha bhagavā’’ti bhagavati saddhāya saddhābahulaṃ cittaṃ hoti. Atha vā paccuppannānaṃ padesasaṅkhārānaṃ aniccataṃ passitvā ‘‘evaṃ aniccā atītānāgatapaccuppannā sabbe saṅkhārā’’ti adhimuccanato adhimokkhabahulaṃ cittaṃ hoti. Passaddhibahulanti dukkhānupassanāya cittakkhobhakarāya paṇidhiyā pajahanato cittadarathābhāvena passaddhibahulaṃ cittaṃ hoti. Atha vā dukkhānupassanāya saṃvegajananato saṃviggassa ca yoniso padahanato vikkhepābhāvena passaddhibahulaṃ cittaṃ hoti. Vedabahulanti anattānupassanāya bāhirakehi adiṭṭhaṃ gambhīraṃ anattalakkhaṇaṃ passato ñāṇabahulaṃ cittaṃ hoti. Atha vā ‘‘sadevakena lokena adiṭṭhaṃ anattalakkhaṇaṃ diṭṭha’’nti tuṭṭhassa tuṭṭhibahulaṃ cittaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adhimokkhabahulo saddhindriyaṃ paṭilabhatī"
      },
      "ti pubbabhāge adhimokkho bahulaṃ pavattamāno bhāvanāpāripūriyā saddhindriyaṃ nāma hoti, taṃ so paṭilabhati nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Passaddhibahulo samādhindriyaṃ paṭilabhatī"
      },
      "ti pubbabhāge passaddhibahulassa ‘‘passaddhakāyo sukhaṃ vedeti, sukhino cittaṃ samādhiyatī’’ti (paṭi. ma. 1.73; a. ni. 5.26) vacanato bhāvanāpāripūriyā passaddhipaccayā samādhindriyaṃ hoti, taṃ so paṭilabhati nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vedabahulo paññindriyaṃ paṭilabhatī"
      },
      "ti pubbabhāge vedo bahulaṃ pavattamāno bhāvanāpāripūriyā paññindriyaṃ nāma hoti, taṃ so paṭilabhati nāma."
    ],
    "innerText": "Adhimokkhabahulo saddhindriyaṃ paṭilabhatīti pubbabhāge adhimokkho bahulaṃ pavattamāno bhāvanāpāripūriyā saddhindriyaṃ nāma hoti, taṃ so paṭilabhati nāma. Passaddhibahulo samādhindriyaṃ paṭilabhatīti pubbabhāge passaddhibahulassa ‘‘passaddhakāyo sukhaṃ vedeti, sukhino cittaṃ samādhiyatī’’ti (paṭi. ma. 1.73; a. ni. 5.26) vacanato bhāvanāpāripūriyā passaddhipaccayā samādhindriyaṃ hoti, taṃ so paṭilabhati nāma. Vedabahulo paññindriyaṃ paṭilabhatīti pubbabhāge vedo bahulaṃ pavattamāno bhāvanāpāripūriyā paññindriyaṃ nāma hoti, taṃ so paṭilabhati nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ādhipateyyaṃ hotī"
      },
      "ti chandādike adhipatibhūtepi sakiccanipphādanavasena adhipati hoti padhāno hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhāvanāyā"
      },
      "ti bhummavacanaṃ, uparūpari bhāvanatthāya vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tadanvayā hontī"
      },
      "ti taṃ anugāminī taṃ anuvattinī honti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahajātapaccayā hontī"
      },
      "ti uppajjamānā ca sahauppādanabhāvena upakārakā honti pakāsassa padīpo viya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aññamaññapaccayā hontī"
      },
      "ti aññamaññaṃ uppādanupatthambhanabhāvena upakārakā honti aññamaññūpatthambhakaṃ tidaṇḍaṃ viya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nissayapaccayā hontī"
      },
      "ti adhiṭṭhānākārena nissayākārena ca upakārakā honti tarucittakammānaṃ pathavīpaṭādi viya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sampayuttapaccayā hontī"
      },
      "ti ekavatthukaekārammaṇaekuppādaekanirodhasaṅkhātena sampayuttabhāvena upakārakā honti."
    ],
    "innerText": "Ādhipateyyaṃ hotīti chandādike adhipatibhūtepi sakiccanipphādanavasena adhipati hoti padhāno hoti. Bhāvanāyāti bhummavacanaṃ, uparūpari bhāvanatthāya vā. Tadanvayā hontīti taṃ anugāminī taṃ anuvattinī honti. Sahajātapaccayā hontīti uppajjamānā ca sahauppādanabhāvena upakārakā honti pakāsassa padīpo viya. Aññamaññapaccayā hontīti aññamaññaṃ uppādanupatthambhanabhāvena upakārakā honti aññamaññūpatthambhakaṃ tidaṇḍaṃ viya. Nissayapaccayā hontīti adhiṭṭhānākārena nissayākārena ca upakārakā honti tarucittakammānaṃ pathavīpaṭādi viya. Sampayuttapaccayā hontīti ekavatthukaekārammaṇaekuppādaekanirodhasaṅkhātena sampayuttabhāvena upakārakā honti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "220"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭivedhakāle"
      },
      "ti ",
      " maggakkhaṇe saccapaṭivedhakāle. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññindriyaṃ ādhipateyyaṃ hotī"
      },
      "ti maggakkhaṇe nibbānaṃ ārammaṇaṃ katvā saccadassanakiccakaraṇavasena ca kilesappahānakiccakaraṇavasena ca paññindriyameva jeṭṭhakaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭivedhāyā"
      },
      "ti saccapaṭivijjhanatthāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekarasā"
      },
      "ti vimuttirasena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dassanaṭṭhenā"
      },
      "ti saccadassanaṭṭhena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ paṭivijjhantopi bhāveti, bhāventopi paṭivijjhatī"
      },
      "ti maggakkhaṇe sakiṃyeva bhāvanāya ca paṭivedhassa ca sabbhāvadassanatthaṃ vuttaṃ. Anattānupassanāya vipassanākkhaṇepi paññindriyasseva ādhipateyyattā ‘‘paṭivedhakālepī’’ti apisaddo payutto."
    ],
    "innerText": "220.Paṭivedhakāleti maggakkhaṇe saccapaṭivedhakāle. Paññindriyaṃ ādhipateyyaṃ hotīti maggakkhaṇe nibbānaṃ ārammaṇaṃ katvā saccadassanakiccakaraṇavasena ca kilesappahānakiccakaraṇavasena ca paññindriyameva jeṭṭhakaṃ hoti. Paṭivedhāyāti saccapaṭivijjhanatthāya. Ekarasāti vimuttirasena. Dassanaṭṭhenāti saccadassanaṭṭhena. Evaṃ paṭivijjhantopi bhāveti, bhāventopi paṭivijjhatīti maggakkhaṇe sakiṃyeva bhāvanāya ca paṭivedhassa ca sabbhāvadassanatthaṃ vuttaṃ. Anattānupassanāya vipassanākkhaṇepi paññindriyasseva ādhipateyyattā ‘‘paṭivedhakālepī’’ti apisaddo payutto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "221"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aniccato"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "manasikaroto katamindriyaṃ adhimattaṃ hotī"
      },
      "tiādi indriyavisesena puggalavisesaṃ dassetuṃ vuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "adhimatta"
      },
      "nti adhikaṃ. Tattha saddhindriyasamādhindriyapaññindriyānaṃ adhimattatā saṅkhārupekkhāya ",
      " veditabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddhāvimutto"
      },
      "ti ettha avisesetvā vuttepi upari visesetvā vuttattā sotāpattimaggaṃ ṭhapetvā sesesu sattasu ṭhānesu saddhāvimuttoti vuttaṃ hoti. Saddhāvimutto saddhindriyassa adhimattattā hoti, na saddhindriyassa adhimattattā sabbattha saddhāvimuttotipi vuttaṃ hoti. Sotāpattimaggakkhaṇe saddhindriyassa adhimattattāyeva sesesu samādhindriyapaññindriyādhimattattepi sati saddhāvimuttoyeva nāma hotīti vadanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāyasakkhī hotī"
      },
      "ti aṭṭhasupi ṭhānesu kāyasakkhī nāma hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Diṭṭhippatto hotī"
      },
      "ti saddhāvimutte vuttanayeneva veditabbaṃ."
    ],
    "innerText": "221.Aniccatomanasikaroto katamindriyaṃ adhimattaṃ hotītiādi indriyavisesena puggalavisesaṃ dassetuṃ vuttaṃ. Tattha adhimattanti adhikaṃ. Tattha saddhindriyasamādhindriyapaññindriyānaṃ adhimattatā saṅkhārupekkhāya veditabbā. Saddhāvimuttoti ettha avisesetvā vuttepi upari visesetvā vuttattā sotāpattimaggaṃ ṭhapetvā sesesu sattasu ṭhānesu saddhāvimuttoti vuttaṃ hoti. Saddhāvimutto saddhindriyassa adhimattattā hoti, na saddhindriyassa adhimattattā sabbattha saddhāvimuttotipi vuttaṃ hoti. Sotāpattimaggakkhaṇe saddhindriyassa adhimattattāyeva sesesu samādhindriyapaññindriyādhimattattepi sati saddhāvimuttoyeva nāma hotīti vadanti. Kāyasakkhī hotīti aṭṭhasupi ṭhānesu kāyasakkhī nāma hoti. Diṭṭhippatto hotīti saddhāvimutte vuttanayeneva veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddahanto vimuttoti saddhāvimutto"
      },
      "ti saddhindriyassa adhimattattā sotāpattimaggakkhaṇe saddahanto catūsupi phalakkhaṇesu vimuttoti saddhāvimuttoti vuttaṃ hoti. Uparimaggattayakkhaṇe saddhāvimuttattaṃ idāni vakkhati. Sotāpattimaggakkhaṇe pana saddhānusārittaṃ pacchā vakkhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Phuṭṭhattā sacchikatoti kāyasakkhī"
      },
      "ti sukkhavipassakatte sati upacārajjhānaphassassa rūpārūpajjhānalābhitte sati rūpārūpajjhānaphassassa phuṭṭhattā nibbānaṃ sacchikatoti kāyasakkhī, nāmakāyena vuttappakāre jhānaphasse ca nibbāne ca sakkhīti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Diṭṭhattā pattoti diṭṭhippatto"
      },
      "ti sotāpattimaggakkhaṇe sampayuttena paññindriyena paṭhamaṃ nibbānassa diṭṭhattā pacchā sotāpattiphalādivasena nibbānaṃ pattoti diṭṭhippatto, paññindriyasaṅkhātāya diṭṭhiyā ",
      " nibbānaṃ pattoti vuttaṃ hoti. Sotāpattimaggakkhaṇe pana dhammānusārittaṃ pacchā vakkhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddahanto vimuccatīti saddhāvimutto"
      },
      "ti saddhindriyassa adhimattattā sakadāgāmianāgāmiarahattamaggakkhaṇesu saddahanto vimuccatīti saddhāvimutto. Ettha vimuccamānopi āsaṃsāya bhūtavacanavasena ‘‘vimutto’’ti vutto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jhānaphassa"
      },
      "nti tividhaṃ jhānaphassaṃ. ‘‘Jhānaphassa’’ntiādīni ‘‘dukkhā saṅkhārā’’tiādīni ca paṭhamaṃ vuttaṃ dvayameva visesetvā vuttāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñātaṃ hotī"
      },
      "tiādīni heṭṭhā vuttatthāni. Ettha ca jhānalābhī puggalo samādhindriyassa anukūlāya dukkhānupassanāya eva vuṭṭhahitvā maggaphalāni pāpuṇātīti ācariyānaṃ adhippāyo."
    ],
    "innerText": "Saddahanto vimuttoti saddhāvimuttoti saddhindriyassa adhimattattā sotāpattimaggakkhaṇe saddahanto catūsupi phalakkhaṇesu vimuttoti saddhāvimuttoti vuttaṃ hoti. Uparimaggattayakkhaṇe saddhāvimuttattaṃ idāni vakkhati. Sotāpattimaggakkhaṇe pana saddhānusārittaṃ pacchā vakkhati. Phuṭṭhattā sacchikatoti kāyasakkhīti sukkhavipassakatte sati upacārajjhānaphassassa rūpārūpajjhānalābhitte sati rūpārūpajjhānaphassassa phuṭṭhattā nibbānaṃ sacchikatoti kāyasakkhī, nāmakāyena vuttappakāre jhānaphasse ca nibbāne ca sakkhīti vuttaṃ hoti. Diṭṭhattā pattoti diṭṭhippattoti sotāpattimaggakkhaṇe sampayuttena paññindriyena paṭhamaṃ nibbānassa diṭṭhattā pacchā sotāpattiphalādivasena nibbānaṃ pattoti diṭṭhippatto, paññindriyasaṅkhātāya diṭṭhiyā nibbānaṃ pattoti vuttaṃ hoti. Sotāpattimaggakkhaṇe pana dhammānusārittaṃ pacchā vakkhati. Saddahanto vimuccatīti saddhāvimuttoti saddhindriyassa adhimattattā sakadāgāmianāgāmiarahattamaggakkhaṇesu saddahanto vimuccatīti saddhāvimutto. Ettha vimuccamānopi āsaṃsāya bhūtavacanavasena ‘‘vimutto’’ti vutto. Jhānaphassanti tividhaṃ jhānaphassaṃ. ‘‘Jhānaphassa’’ntiādīni ‘‘dukkhā saṅkhārā’’tiādīni ca paṭhamaṃ vuttaṃ dvayameva visesetvā vuttāni. Ñātaṃ hotītiādīni heṭṭhā vuttatthāni. Ettha ca jhānalābhī puggalo samādhindriyassa anukūlāya dukkhānupassanāya eva vuṭṭhahitvā maggaphalāni pāpuṇātīti ācariyānaṃ adhippāyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Siyā"
      },
      "ti siyuṃ, bhaveyyunti attho. ‘‘Siyā’’ti etaṃ vidhivacanameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tayo puggalā"
      },
      "ti vipassanāniyamena indriyaniyamena ca vuttā tayo puggalā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vatthuvasenā"
      },
      "ti tīsu anupassanāsu ekekaindriyavatthuvasena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pariyāyenā"
      },
      "ti teneva pariyāyena. Iminā vārena kiṃ dassitaṃ hoti ",
      "? Heṭṭhā ",
      " ekekissā anupassanāya ekekassa indriyassa ādhipaccaṃ yebhuyyavasena vuttanti ca, kadāci tīsupi anupassanāsu ekekasseva indriyassa ādhipaccaṃ hotīti ca dassitaṃ hoti. Atha vā pubbabhāgavipassanākkhaṇe tissannampi anupassanānaṃ sabbhāvato tāsu pubbabhāgavipassanāsu tesaṃ tesaṃ indriyānaṃ ādhipaccaṃ apekkhitvā maggaphalakkhaṇesu saddhāvimuttādīni nāmāni hontīti. Evañhi vuccamāne heṭṭhā vuṭṭhānagāminivipassanāya upari ca kato indriyādhipaccapuggalaniyamo sukatoyeva niccaloyeva ca hoti. Anantaravāre ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "siyā"
      },
      "ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aññoyevā"
      },
      "ti evaṃ siyāti attho. Ettha pubbe vuttoyeva niyamo."
    ],
    "innerText": "Siyāti siyuṃ, bhaveyyunti attho. ‘‘Siyā’’ti etaṃ vidhivacanameva. Tayo puggalāti vipassanāniyamena indriyaniyamena ca vuttā tayo puggalā. Vatthuvasenāti tīsu anupassanāsu ekekaindriyavatthuvasena. Pariyāyenāti teneva pariyāyena. Iminā vārena kiṃ dassitaṃ hoti ? Heṭṭhā ekekissā anupassanāya ekekassa indriyassa ādhipaccaṃ yebhuyyavasena vuttanti ca, kadāci tīsupi anupassanāsu ekekasseva indriyassa ādhipaccaṃ hotīti ca dassitaṃ hoti. Atha vā pubbabhāgavipassanākkhaṇe tissannampi anupassanānaṃ sabbhāvato tāsu pubbabhāgavipassanāsu tesaṃ tesaṃ indriyānaṃ ādhipaccaṃ apekkhitvā maggaphalakkhaṇesu saddhāvimuttādīni nāmāni hontīti. Evañhi vuccamāne heṭṭhā vuṭṭhānagāminivipassanāya upari ca kato indriyādhipaccapuggalaniyamo sukatoyeva niccaloyeva ca hoti. Anantaravāre siyāti aññoyevāti evaṃ siyāti attho. Ettha pubbe vuttoyeva niyamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni maggaphalavasena puggalavisesaṃ vibhajitvā dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aniccato manasikaroto…pe… sotāpattimaggaṃ paṭilabhatī"
      },
      "tiādimāha. Tattha saddhaṃ anussarati anugacchati, saddhāya vā nibbānaṃ anussarati anugacchatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saddhānusārī. Sacchikata"
      },
      "nti paccakkhakataṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Arahatta"
      },
      "nti arahattaphalaṃ. Paññāsaṅkhātaṃ dhammaṃ anussarati, tena vā dhammena nibbānaṃ anussaratīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammānusārī"
      },
      "."
    ],
    "innerText": "Idāni maggaphalavasena puggalavisesaṃ vibhajitvā dassetuṃ aniccato manasikaroto…pe… sotāpattimaggaṃ paṭilabhatītiādimāha. Tattha saddhaṃ anussarati anugacchati, saddhāya vā nibbānaṃ anussarati anugacchatīti saddhānusārī. Sacchikatanti paccakkhakataṃ. Arahattanti arahattaphalaṃ. Paññāsaṅkhātaṃ dhammaṃ anussarati, tena vā dhammena nibbānaṃ anussaratīti dhammānusārī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "222"
      },
      ". Puna ",
      " aparehi pariyāyehi indriyattayavisesena puggalavisesaṃ vaṇṇetukāmo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ye hi kecī"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhāvitā vā"
      },
      "ti atīte bhāvayiṃsu vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhāventi vā"
      },
      "ti paccuppanne. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhāvissanti vā"
      },
      "ti anāgate. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adhigatā vā"
      },
      "tiādi ekekantikaṃ purimassa purimassa atthavivaraṇatthaṃ vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Phassitā vā"
      },
      "ti ñāṇaphusanāya phusiṃsu vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vasippattā"
      },
      "ti issarabhāvaṃ pattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāramippattā"
      },
      "ti vosānaṃ pattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vesārajjappattā"
      },
      "ti visāradabhāvaṃ pattā. Sabbattha saddhāvimuttādayo heṭṭhā vuttakkhaṇesuyeva, satipaṭṭhānādayo maggakkhaṇeyeva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭha vimokkhe"
      },
      "ti ‘‘rūpī rūpāni passatī’’tiādike (paṭi. ma. 1.209; dha. sa. 248) paṭisambhidāmaggappattiyā eva pattā."
    ],
    "innerText": "222. Puna aparehi pariyāyehi indriyattayavisesena puggalavisesaṃ vaṇṇetukāmo ye hi kecītiādimāha. Tattha bhāvitā vāti atīte bhāvayiṃsu vā. Bhāventi vāti paccuppanne. Bhāvissanti vāti anāgate. Adhigatā vātiādi ekekantikaṃ purimassa purimassa atthavivaraṇatthaṃ vuttaṃ. Phassitā vāti ñāṇaphusanāya phusiṃsu vā. Vasippattāti issarabhāvaṃ pattā. Pāramippattāti vosānaṃ pattā. Vesārajjappattāti visāradabhāvaṃ pattā. Sabbattha saddhāvimuttādayo heṭṭhā vuttakkhaṇesuyeva, satipaṭṭhānādayo maggakkhaṇeyeva. Aṭṭha vimokkheti ‘‘rūpī rūpāni passatī’’tiādike (paṭi. ma. 1.209; dha. sa. 248) paṭisambhidāmaggappattiyā eva pattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tisso sikkhā"
      },
      "ti adhisīlasikkhā adhicittasikkhā adhipaññāsikkhā maggappattā eva sikkhamānā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dukkhaṃ parijānantī"
      },
      "tiādīni maggakkhaṇeyeva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pariññāpaṭivedhaṃ paṭivijjhatī"
      },
      "ti pariññāpaṭivedhena paṭivijjhati, pariññāya paṭivijjhitabbanti vā pariññāpaṭivedhaṃ. Evaṃ sesesupi. Sabbadhammādīhi visesetvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhiññāpaṭivedhā"
      },
      "dayo vuttā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sacchikiriyāpaṭivedho"
      },
      " pana maggakkhaṇeyeva nibbānapaccavekkhaṇañāṇasiddhivasena ",
      " veditabboti. Evamidha pañca ariyapuggalā niddiṭṭhā honti, ubhatobhāgavimutto ca paññāvimutto cāti ime dve aniddiṭṭhā. Aññattha (visuddhi. 2.773) pana ‘‘yo pana dukkhato manasikaronto passaddhibahulo samādhindriyaṃ ",
      " paṭilabhati, so sabbattha kāyasakkhī nāma hoti, arūpajjhānaṃ pana patvā aggaphalaṃ patto ubhatobhāgavimutto nāma hoti. Yo pana anattato manasikaronto vedabahulo paññindriyaṃ paṭilabhati, sotāpattimaggakkhaṇe dhammānusārī hoti, chasu ṭhānesu diṭṭhippatto, aggaphale paññāvimutto’’ti vuttaṃ. Te idha kāyasakkhidiṭṭhippattehiyeva saṅgahitā. Atthato pana arūpajjhānena ceva ariyamaggena cāti ubhatobhāgena vimuttoti ubhatobhāgavimutto. Pajānanto vimuttoti paññāvimuttoti. Ettāvatā indriyapuggalavisesā niddiṭṭhā honti."
    ],
    "innerText": "Tisso sikkhāti adhisīlasikkhā adhicittasikkhā adhipaññāsikkhā maggappattā eva sikkhamānā. Dukkhaṃ parijānantītiādīni maggakkhaṇeyeva. Pariññāpaṭivedhaṃ paṭivijjhatīti pariññāpaṭivedhena paṭivijjhati, pariññāya paṭivijjhitabbanti vā pariññāpaṭivedhaṃ. Evaṃ sesesupi. Sabbadhammādīhi visesetvā abhiññāpaṭivedhādayo vuttā. Sacchikiriyāpaṭivedho pana maggakkhaṇeyeva nibbānapaccavekkhaṇañāṇasiddhivasena veditabboti. Evamidha pañca ariyapuggalā niddiṭṭhā honti, ubhatobhāgavimutto ca paññāvimutto cāti ime dve aniddiṭṭhā. Aññattha (visuddhi. 2.773) pana ‘‘yo pana dukkhato manasikaronto passaddhibahulo samādhindriyaṃ paṭilabhati, so sabbattha kāyasakkhī nāma hoti, arūpajjhānaṃ pana patvā aggaphalaṃ patto ubhatobhāgavimutto nāma hoti. Yo pana anattato manasikaronto vedabahulo paññindriyaṃ paṭilabhati, sotāpattimaggakkhaṇe dhammānusārī hoti, chasu ṭhānesu diṭṭhippatto, aggaphale paññāvimutto’’ti vuttaṃ. Te idha kāyasakkhidiṭṭhippattehiyeva saṅgahitā. Atthato pana arūpajjhānena ceva ariyamaggena cāti ubhatobhāgena vimuttoti ubhatobhāgavimutto. Pajānanto vimuttoti paññāvimuttoti. Ettāvatā indriyapuggalavisesā niddiṭṭhā honti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "223-226"
      },
      ". Idāni vimokkhapubbaṅgamameva vimokkhavisesaṃ puggalavisesañca dassetukāmo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aniccato manasikaroto"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dve vimokkhā"
      },
      "ti appaṇihitasuññatavimokkhā. Aniccānupassanāgamanavasena hi animittavimokkhoti laddhanāmo maggo rāgadosamohapaṇidhīnaṃ abhāvā ",
      " saguṇato ca tesaṃyeva paṇidhīnaṃ abhāvā appaṇihitanti laddhanāmaṃ nibbānaṃ ārammaṇaṃ karotīti ārammaṇato ca appaṇihitavimokkhoti nāmampi labhati. Tathā rāgadosamohehi suññattā saguṇato ca rāgādīhiyeva suññattā suññatanti laddhanāmaṃ nibbānaṃ ārammaṇaṃ karotīti ārammaṇato ca suññatavimokkhoti nāmampi labhati. Tasmā te dve vimokkhā animittavimokkhanvayā nāma honti. Animittamaggato anaññepi aṭṭhannaṃ maggaṅgānaṃ ekekassa maggaṅgassa vasena sahajātādipaccayā ca hontīti veditabbā. Puna ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dve vimokkhā"
      },
      "ti suññatānimittavimokkhā. Dukkhānupassanāgamanavasena hi appaṇihitavimokkhoti laddhanāmo maggo rūpanimittādīnaṃ rāganimittādīnaṃ niccanimittādīnañca abhāvā saguṇato ca tesaṃyeva nimittānaṃ abhāvā animittasaṅkhātaṃ nibbānaṃ ārammaṇaṃ karotīti ārammaṇato ca animittavimokkhoti nāmampi labhati. Sesaṃ vuttanayeneva yojetabbaṃ. Puna ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dve vimokkhā"
      },
      "ti animittaappaṇihitavimokkhā. Yojanā panettha vuttanayā eva."
    ],
    "innerText": "223-226. Idāni vimokkhapubbaṅgamameva vimokkhavisesaṃ puggalavisesañca dassetukāmo aniccato manasikarototiādimāha. Tattha dve vimokkhāti appaṇihitasuññatavimokkhā. Aniccānupassanāgamanavasena hi animittavimokkhoti laddhanāmo maggo rāgadosamohapaṇidhīnaṃ abhāvā saguṇato ca tesaṃyeva paṇidhīnaṃ abhāvā appaṇihitanti laddhanāmaṃ nibbānaṃ ārammaṇaṃ karotīti ārammaṇato ca appaṇihitavimokkhoti nāmampi labhati. Tathā rāgadosamohehi suññattā saguṇato ca rāgādīhiyeva suññattā suññatanti laddhanāmaṃ nibbānaṃ ārammaṇaṃ karotīti ārammaṇato ca suññatavimokkhoti nāmampi labhati. Tasmā te dve vimokkhā animittavimokkhanvayā nāma honti. Animittamaggato anaññepi aṭṭhannaṃ maggaṅgānaṃ ekekassa maggaṅgassa vasena sahajātādipaccayā ca hontīti veditabbā. Puna dve vimokkhāti suññatānimittavimokkhā. Dukkhānupassanāgamanavasena hi appaṇihitavimokkhoti laddhanāmo maggo rūpanimittādīnaṃ rāganimittādīnaṃ niccanimittādīnañca abhāvā saguṇato ca tesaṃyeva nimittānaṃ abhāvā animittasaṅkhātaṃ nibbānaṃ ārammaṇaṃ karotīti ārammaṇato ca animittavimokkhoti nāmampi labhati. Sesaṃ vuttanayeneva yojetabbaṃ. Puna dve vimokkhāti animittaappaṇihitavimokkhā. Yojanā panettha vuttanayā eva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭivedhakāle"
      },
      "ti indriyānaṃ vuttakkameneva vuttaṃ. Maggakkhaṇaṃ pana muñcitvā vipassanākkhaṇe vimokkho nāma natthi ",
      ". Paṭhamaṃ vuttoyeva pana maggavimokkho ‘‘paṭivedhakāle’’ti vacanena visesetvā dassito. ‘‘Yo cāyaṃ puggalo saddhāvimutto’’tiādikā dve vārā ca ‘‘aniccato manasikaronto sotāpattimaggaṃ paṭilabhatī’’tiādiko vāro ca saṅkhitto, vimokkhavasena pana yojetvā vitthārato veditabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ye hi keci nekkhamma"
      },
      "ntiādiko vāro vuttanayeneva veditabboti. Ettāvatā vimokkhapuggalavisesā niddiṭṭhā hontīti."
    ],
    "innerText": "Paṭivedhakāleti indriyānaṃ vuttakkameneva vuttaṃ. Maggakkhaṇaṃ pana muñcitvā vipassanākkhaṇe vimokkho nāma natthi . Paṭhamaṃ vuttoyeva pana maggavimokkho ‘‘paṭivedhakāle’’ti vacanena visesetvā dassito. ‘‘Yo cāyaṃ puggalo saddhāvimutto’’tiādikā dve vārā ca ‘‘aniccato manasikaronto sotāpattimaggaṃ paṭilabhatī’’tiādiko vāro ca saṅkhitto, vimokkhavasena pana yojetvā vitthārato veditabbo. Ye hi keci nekkhammantiādiko vāro vuttanayeneva veditabboti. Ettāvatā vimokkhapuggalavisesā niddiṭṭhā hontīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "227"
      },
      ". Puna ",
      " vimokkhamukhāni ca vimokkhe ca anekadhā niddisitukāmo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aniccato manasikaronto"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yathābhūta"
      },
      "nti yathāsabhāvena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jānātī"
      },
      "ti ñāṇena jānāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Passatī"
      },
      "ti teneva ñāṇena cakkhunā viya passati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tadanvayenā"
      },
      "ti tadanugamanena, tassa paccakkhato ñāṇena diṭṭhassa anugamanenāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kaṅkhā pahīyatī"
      },
      "ti aniccānupassanāya niccāniccakaṅkhā, itarāhi itarakaṅkhā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nimitta"
      },
      "nti santatighanavinibbhogena niccasaññāya pahīnattā ārammaṇabhūtaṃ saṅkhāranimittaṃ yathābhūtaṃ jānāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tena vuccati sammādassana"
      },
      "nti tena yathābhūtajānanena taṃ ñāṇaṃ ‘‘sammādassana’’nti ",
      " vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pavatta"
      },
      "nti dukkhappattākāre sukhasaññaṃ ugghāṭetvā sukhasaññāya pahānena paṇidhisaṅkhātāya taṇhāya pahīnattā sukhasammatampi vipākapavattaṃ yathābhūtaṃ jānāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nimittañca pavattañcā"
      },
      "ti nānādhātumanasikārasambhavena samūhaghanavinibbhogena ubhayathāpi attasaññāya pahīnattā saṅkhāranimittañca vipākapavattañca yathābhūtaṃ jānāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yañca yathābhūtaṃ ñāṇa"
      },
      "ntiādittayaṃ idāni vuttameva, na aññaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhayato upaṭṭhātī"
      },
      "ti niccasukhaattābhāvadassanato yathākkamaṃ taṃ taṃ bhayato upaṭṭhāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yā ca bhayatupaṭṭhāne paññā"
      },
      "tiādinā ‘‘udayabbayānupassanāñāṇaṃ bhaṅgānupassanāñāṇaṃ bhayatupaṭṭhānañāṇaṃ ādīnavānupassanāñāṇaṃ nibbidānupassanāñāṇaṃ muñcitukamyatāñāṇaṃ paṭisaṅkhānupassanāñāṇaṃ saṅkhārupekkhāñāṇaṃ anulomañāṇa’’nti vuttesu paṭipadāñāṇadassanavisuddhisaṅkhātesu navasu vipassanāñāṇesu bhayatupaṭṭhānasambandhena avatthābhedena bhinnāni ekaṭṭhāni tīṇi ñāṇāni vuttāni, na sesāni."
    ],
    "innerText": "227. Puna vimokkhamukhāni ca vimokkhe ca anekadhā niddisitukāmo aniccato manasikarontotiādimāha. Tattha yathābhūtanti yathāsabhāvena. Jānātīti ñāṇena jānāti. Passatīti teneva ñāṇena cakkhunā viya passati. Tadanvayenāti tadanugamanena, tassa paccakkhato ñāṇena diṭṭhassa anugamanenāti attho. Kaṅkhā pahīyatīti aniccānupassanāya niccāniccakaṅkhā, itarāhi itarakaṅkhā. Nimittanti santatighanavinibbhogena niccasaññāya pahīnattā ārammaṇabhūtaṃ saṅkhāranimittaṃ yathābhūtaṃ jānāti. Tena vuccati sammādassananti tena yathābhūtajānanena taṃ ñāṇaṃ ‘‘sammādassana’’nti vuccati. Pavattanti dukkhappattākāre sukhasaññaṃ ugghāṭetvā sukhasaññāya pahānena paṇidhisaṅkhātāya taṇhāya pahīnattā sukhasammatampi vipākapavattaṃ yathābhūtaṃ jānāti. Nimittañca pavattañcāti nānādhātumanasikārasambhavena samūhaghanavinibbhogena ubhayathāpi attasaññāya pahīnattā saṅkhāranimittañca vipākapavattañca yathābhūtaṃ jānāti. Yañca yathābhūtaṃ ñāṇantiādittayaṃ idāni vuttameva, na aññaṃ. Bhayato upaṭṭhātīti niccasukhaattābhāvadassanato yathākkamaṃ taṃ taṃ bhayato upaṭṭhāti. Yā ca bhayatupaṭṭhāne paññātiādinā ‘‘udayabbayānupassanāñāṇaṃ bhaṅgānupassanāñāṇaṃ bhayatupaṭṭhānañāṇaṃ ādīnavānupassanāñāṇaṃ nibbidānupassanāñāṇaṃ muñcitukamyatāñāṇaṃ paṭisaṅkhānupassanāñāṇaṃ saṅkhārupekkhāñāṇaṃ anulomañāṇa’’nti vuttesu paṭipadāñāṇadassanavisuddhisaṅkhātesu navasu vipassanāñāṇesu bhayatupaṭṭhānasambandhena avatthābhedena bhinnāni ekaṭṭhāni tīṇi ñāṇāni vuttāni, na sesāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Puna tīsu anupassanāsu ante ṭhitāya anantarāya anattānupassanāya ",
      " sambandhena tāya saha suññatānupassanāya ekaṭṭhataṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yā ca anattānupassanā yā ca suññatānupassanā"
      },
      "tiādimāha. Imāni hi dve ñāṇāni atthato ekameva, avatthābhedena pana bhinnāni. Yathā ca imāni, tathā aniccānupassanā ca animittānupassanā ca atthato ekameva ñāṇaṃ, dukkhānupassanā ca appaṇihitānupassanā ca atthato ekameva ñāṇaṃ, kevalaṃ avatthābhedeneva bhinnāni. Anattānupassanāsuññatānupassanānañca ekaṭṭhatāya vuttāya tesaṃ dvinnaṃ dvinnampi ñāṇānaṃ ekalakkhaṇattā ekaṭṭhatā vuttāva hotīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nimittaṃ paṭisaṅkhā ñāṇaṃ uppajjatī"
      },
      "ti ‘‘saṅkhāranimittaṃ addhuvaṃ tāvakālika’’nti aniccalakkhaṇavasena jānitvā ñāṇaṃ uppajjati. Kāmañca na paṭhamaṃ jānitvā pacchā ñāṇaṃ uppajjati, vohāravasena pana ‘‘manañca paṭicca dhamme ca uppajjati manoviññāṇa’’ntiādīni (saṃ. ni. 4.60; ma. ni. 1.400; 3.421) viya evaṃ vuccati. Saddasatthavidūpi ca ‘‘ādiccaṃ pāpuṇitvā tamo vigacchatī’’tiādīsu viya samānakālepi imaṃ padaṃ icchanti. Ekattanayena vā ",
      " purimañca pacchimañca ekaṃ katvā evaṃ vuttanti veditabbaṃ. Iminā nayena itarasmimpi padadvaye attho veditabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Muñcitukamyatā"
      },
      "dīnaṃ tiṇṇaṃ ñāṇānaṃ ekaṭṭhatā heṭṭhā vuttanayā eva."
    ],
    "innerText": "Puna tīsu anupassanāsu ante ṭhitāya anantarāya anattānupassanāya sambandhena tāya saha suññatānupassanāya ekaṭṭhataṃ dassetuṃ yā ca anattānupassanā yā ca suññatānupassanātiādimāha. Imāni hi dve ñāṇāni atthato ekameva, avatthābhedena pana bhinnāni. Yathā ca imāni, tathā aniccānupassanā ca animittānupassanā ca atthato ekameva ñāṇaṃ, dukkhānupassanā ca appaṇihitānupassanā ca atthato ekameva ñāṇaṃ, kevalaṃ avatthābhedeneva bhinnāni. Anattānupassanāsuññatānupassanānañca ekaṭṭhatāya vuttāya tesaṃ dvinnaṃ dvinnampi ñāṇānaṃ ekalakkhaṇattā ekaṭṭhatā vuttāva hotīti. Nimittaṃ paṭisaṅkhā ñāṇaṃ uppajjatīti ‘‘saṅkhāranimittaṃ addhuvaṃ tāvakālika’’nti aniccalakkhaṇavasena jānitvā ñāṇaṃ uppajjati. Kāmañca na paṭhamaṃ jānitvā pacchā ñāṇaṃ uppajjati, vohāravasena pana ‘‘manañca paṭicca dhamme ca uppajjati manoviññāṇa’’ntiādīni (saṃ. ni. 4.60; ma. ni. 1.400; 3.421) viya evaṃ vuccati. Saddasatthavidūpi ca ‘‘ādiccaṃ pāpuṇitvā tamo vigacchatī’’tiādīsu viya samānakālepi imaṃ padaṃ icchanti. Ekattanayena vā purimañca pacchimañca ekaṃ katvā evaṃ vuttanti veditabbaṃ. Iminā nayena itarasmimpi padadvaye attho veditabbo. Muñcitukamyatādīnaṃ tiṇṇaṃ ñāṇānaṃ ekaṭṭhatā heṭṭhā vuttanayā eva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nimittā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cittaṃ vuṭṭhātī"
      },
      "ti saṅkhāranimitte dosadassanena tattha anallīnatāya saṅkhāranimittā cittaṃ vuṭṭhāti nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Animitte cittaṃ pakkhandatī"
      },
      "ti saṅkhāranimittapaṭipakkhena animittasaṅkhāte nibbāne tanninnatāya cittaṃ pavisati. Sesānupassanādvayepi iminā nayena attho veditabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nirodhe nibbānadhātuyā"
      },
      "ti idha vutteneva paṭhamānupassanādvayampi vuttameva hoti. Nirodhetipi pāṭho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bahiddhāvuṭṭhānavivaṭṭane paññā"
      },
      "ti vuṭṭhānasambandhena gotrabhuñāṇaṃ vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gotrabhū dhammā"
      },
      "ti gotrabhuñāṇameva. Itarathā hi ekaṭṭhatā na yujjati. ‘‘Asaṅkhatā dhammā, appaccayā dhammā’’tiādīsu (dha. sa. dukamātikā 7, 8) viya vā catumaggavasena vā bahuvacanaṃ katanti veditabbaṃ. Yasmā vimokkhoti maggo, maggo ca dubhatovuṭṭhāno, tasmā tena sambandhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yā ca dubhatovuṭṭhānavivaṭṭane paññā"
      },
      "tiādi vuttaṃ."
    ],
    "innerText": "Nimittācittaṃ vuṭṭhātīti saṅkhāranimitte dosadassanena tattha anallīnatāya saṅkhāranimittā cittaṃ vuṭṭhāti nāma. Animitte cittaṃ pakkhandatīti saṅkhāranimittapaṭipakkhena animittasaṅkhāte nibbāne tanninnatāya cittaṃ pavisati. Sesānupassanādvayepi iminā nayena attho veditabbo. Nirodhe nibbānadhātuyāti idha vutteneva paṭhamānupassanādvayampi vuttameva hoti. Nirodhetipi pāṭho. Bahiddhāvuṭṭhānavivaṭṭane paññāti vuṭṭhānasambandhena gotrabhuñāṇaṃ vuttaṃ. Gotrabhū dhammāti gotrabhuñāṇameva. Itarathā hi ekaṭṭhatā na yujjati. ‘‘Asaṅkhatā dhammā, appaccayā dhammā’’tiādīsu (dha. sa. dukamātikā 7, 8) viya vā catumaggavasena vā bahuvacanaṃ katanti veditabbaṃ. Yasmā vimokkhoti maggo, maggo ca dubhatovuṭṭhāno, tasmā tena sambandhena yā ca dubhatovuṭṭhānavivaṭṭane paññātiādi vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "228"
      },
      ". Puna vimokkhānaṃ nānākkhaṇānaṃ ekakkhaṇapariyāyaṃ dassetukāmo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "katihākārehī"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ādhipateyyaṭṭhenā"
      },
      "ti jeṭṭhakaṭṭhena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adhiṭṭhānaṭṭhenā"
      },
      "ti patiṭṭhānaṭṭhena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhinīhāraṭṭhenā"
      },
      "ti vipassanāvīthito nīharaṇaṭṭhena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Niyyānaṭṭhenā"
      },
      "ti nibbānupagamanaṭṭhena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aniccato manasikaroto"
      },
      "ti vuṭṭhānagāminivipassanākkhaṇeyeva ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Animitto vimokkho"
      },
      "ti maggakkhaṇeyeva. Esa nayo sesesu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cittaṃ adhiṭṭhātī"
      },
      "ti cittaṃ adhikaṃ katvā ṭhāti, cittaṃ patiṭṭhāpetīti adhippāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cittaṃ abhinīharatī"
      },
      "ti vipassanāvīthito cittaṃ nīharati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nirodhaṃ nibbānaṃ niyyātī"
      },
      "ti nirodhasaṅkhātaṃ nibbānaṃ upagacchatīti evaṃ ākāranānattato catudhā nānākkhaṇatā dassitā."
    ],
    "innerText": "228. Puna vimokkhānaṃ nānākkhaṇānaṃ ekakkhaṇapariyāyaṃ dassetukāmo katihākārehītiādimāha. Tattha ādhipateyyaṭṭhenāti jeṭṭhakaṭṭhena. Adhiṭṭhānaṭṭhenāti patiṭṭhānaṭṭhena. Abhinīhāraṭṭhenāti vipassanāvīthito nīharaṇaṭṭhena. Niyyānaṭṭhenāti nibbānupagamanaṭṭhena. Aniccato manasikarototi vuṭṭhānagāminivipassanākkhaṇeyeva . Animitto vimokkhoti maggakkhaṇeyeva. Esa nayo sesesu. Cittaṃ adhiṭṭhātīti cittaṃ adhikaṃ katvā ṭhāti, cittaṃ patiṭṭhāpetīti adhippāyo. Cittaṃ abhinīharatīti vipassanāvīthito cittaṃ nīharati. Nirodhaṃ nibbānaṃ niyyātīti nirodhasaṅkhātaṃ nibbānaṃ upagacchatīti evaṃ ākāranānattato catudhā nānākkhaṇatā dassitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ekakkhaṇatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samodhānaṭṭhenā"
      },
      "ti ekajjhaṃ samosaraṇaṭṭhena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adhigamanaṭṭhenā"
      },
      "ti vindanaṭṭhena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭilābhaṭṭhenā"
      },
      "ti pāpuṇanaṭṭhena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭivedhaṭṭhenā"
      },
      "ti ñāṇena paṭivijjhanaṭṭhena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sacchikiriyaṭṭhenā"
      },
      "ti paccakkhakaraṇaṭṭhena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Phassanaṭṭhenā"
      },
      "ti ñāṇaphusanāya phusanaṭṭhena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhisamayaṭṭhenā"
      },
      "ti abhimukhaṃ samāgamanaṭṭhena. Ettha ‘‘samodhānaṭṭhenā’’ti mūlapadaṃ, sesāni adhigamavevacanāni. Tasmāyeva hi sabbesaṃ ekato vissajjanaṃ kataṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nimittā muccatī"
      },
      "ti niccanimittato muccati. Iminā vimokkhaṭṭho vutto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yato muccatī"
      },
      "ti yato nimittato muccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tattha na paṇidahatī"
      },
      "ti tasmiṃ nimitte ",
      " patthanaṃ na karoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yattha na paṇidahatī"
      },
      "ti yasmiṃ nimitte na paṇidahati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tena suñño"
      },
      "ti ",
      " tena nimittena suñño. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yena suñño"
      },
      "ti yena nimittena suñño. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tena nimittena animitto"
      },
      "ti iminā animittaṭṭho vutto."
    ],
    "innerText": "Ekakkhaṇatāya samodhānaṭṭhenāti ekajjhaṃ samosaraṇaṭṭhena. Adhigamanaṭṭhenāti vindanaṭṭhena. Paṭilābhaṭṭhenāti pāpuṇanaṭṭhena. Paṭivedhaṭṭhenāti ñāṇena paṭivijjhanaṭṭhena. Sacchikiriyaṭṭhenāti paccakkhakaraṇaṭṭhena. Phassanaṭṭhenāti ñāṇaphusanāya phusanaṭṭhena. Abhisamayaṭṭhenāti abhimukhaṃ samāgamanaṭṭhena. Ettha ‘‘samodhānaṭṭhenā’’ti mūlapadaṃ, sesāni adhigamavevacanāni. Tasmāyeva hi sabbesaṃ ekato vissajjanaṃ kataṃ. Nimittā muccatīti niccanimittato muccati. Iminā vimokkhaṭṭho vutto. Yato muccatīti yato nimittato muccati. Tattha na paṇidahatīti tasmiṃ nimitte patthanaṃ na karoti. Yattha na paṇidahatīti yasmiṃ nimitte na paṇidahati. Tena suññoti tena nimittena suñño. Yena suññoti yena nimittena suñño. Tena nimittena animittoti iminā animittaṭṭho vutto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṇidhiyā muccatī"
      },
      "ti paṇidhito muccati. ‘‘Paṇidhi muccatī’’ti pāṭho nissakkatthoyeva. Iminā vimokkhaṭṭho vutto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yattha na paṇidahatī"
      },
      "ti yasmiṃ dukkhe na paṇidahati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tena suñño"
      },
      "ti tena dukkhena suñño. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yena suñño"
      },
      "ti yena dukkhanimittena suñño. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yena nimittenā"
      },
      "ti yena dukkhanimittena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tattha na paṇidahatī"
      },
      "ti iminā appaṇihitaṭṭho vutto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhinivesā muccatī"
      },
      "ti iminā vimokkhaṭṭho vutto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yena suñño"
      },
      "ti yena abhinivesanimittena suñño. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yena nimittenā"
      },
      "ti yena abhinivesanimittena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yattha na paṇidahati, tena suñño"
      },
      "ti yasmiṃ abhinivesanimitte na paṇidahati, tena abhinivesanimittena suñño. Iminā suññataṭṭho vutto."
    ],
    "innerText": "Paṇidhiyā muccatīti paṇidhito muccati. ‘‘Paṇidhi muccatī’’ti pāṭho nissakkatthoyeva. Iminā vimokkhaṭṭho vutto. Yattha na paṇidahatīti yasmiṃ dukkhe na paṇidahati. Tena suññoti tena dukkhena suñño. Yena suññoti yena dukkhanimittena suñño. Yena nimittenāti yena dukkhanimittena. Tattha na paṇidahatīti iminā appaṇihitaṭṭho vutto. Abhinivesā muccatīti iminā vimokkhaṭṭho vutto. Yena suññoti yena abhinivesanimittena suñño. Yena nimittenāti yena abhinivesanimittena. Yattha na paṇidahati, tena suññoti yasmiṃ abhinivesanimitte na paṇidahati, tena abhinivesanimittena suñño. Iminā suññataṭṭho vutto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "229"
      },
      ". Puna aṭṭhavimokkhādīni niddisitukāmo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atthi vimokkho"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "niccato abhinivesā"
      },
      "tiādīni saññāvimokkhe vuttanayena veditabbāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbābhinivesehī"
      },
      "ti vuttappakārehi abhinivesehi. Iti abhinivesamuccanavasena suññatavimokkhā nāma jātā, teyeva niccādinimittamuccanavasena animittavimokkhā, niccantiādipaṇidhīhi muccanavasena appaṇihitavimokkhā. Ettha ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṇidhi muccatī"
      },
      "ti sabbattha nissakkattho veditabbo. Paṇidhiyā ",
      " muccatīti vā pāṭho. ‘‘Sabbapaṇidhīhi muccatī’’ti cettha sādhakaṃ. Evaṃ tisso anupassanā tadaṅgavimokkhattā ca samucchedavimokkhassa paccayattā ca pariyāyena vimokkhāti vuttā."
    ],
    "innerText": "229. Puna aṭṭhavimokkhādīni niddisitukāmo atthi vimokkhotiādimāha. Tattha niccato abhinivesātiādīni saññāvimokkhe vuttanayena veditabbāni. Sabbābhinivesehīti vuttappakārehi abhinivesehi. Iti abhinivesamuccanavasena suññatavimokkhā nāma jātā, teyeva niccādinimittamuccanavasena animittavimokkhā, niccantiādipaṇidhīhi muccanavasena appaṇihitavimokkhā. Ettha ca paṇidhi muccatīti sabbattha nissakkattho veditabbo. Paṇidhiyā muccatīti vā pāṭho. ‘‘Sabbapaṇidhīhi muccatī’’ti cettha sādhakaṃ. Evaṃ tisso anupassanā tadaṅgavimokkhattā ca samucchedavimokkhassa paccayattā ca pariyāyena vimokkhāti vuttā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "230"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tattha jātā"
      },
      "ti anantare vipassanāvimokkhepi sati imissā kathāya maggavimokkhādhikārattā tasmiṃ maggavimokkhe jātāti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anavajjakusalā"
      },
      "ti rāgādivajjavirahitā kusalā. Vicchedaṃ katvā vā pāṭho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bodhipakkhiyā dhammā"
      },
      "ti ‘‘cattāro satipaṭṭhānā, cattāro sammappadhānā, cattāro iddhipādā, pañcindriyāni, pañca balāni, satta bojjhaṅgā ",
      ", ariyo aṭṭhaṅgiko maggo’’ti (ma. ni. 3.35, 43; cūḷani. mettagūmāṇavapucchāniddesa 22; mi. pa. 5.4.1) vuttā sattatiṃsa bodhipakkhiyadhammā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idaṃ mukha"
      },
      "nti idaṃ vuttappakāraṃ dhammajātaṃ ārammaṇato nibbānapavesāya mukhattā mukhaṃ nāmāti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tesaṃ dhammāna"
      },
      "nti tesaṃ bodhipakkhiyānaṃ dhammānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idaṃ vimokkhamukha"
      },
      "nti nibbānaṃ vikkhambhanatadaṅgasamucchedapaṭippassaddhinissaraṇavimokkhesu nissaraṇavimokkhova, ‘‘yāvatā, bhikkhave ",
      ", dhammā saṅkhatā vā asaṅkhatā vā, virāgo tesaṃ dhammānaṃ aggamakkhāyatī’’ti (itivu. 90; a. ni. 4.34) vuttattā uttamaṭṭhena mukhañcāti vimokkhamukhaṃ. Vimokkhañca taṃ mukhañca vimokkhamukhanti kammadhārayasamāsavasena ayameva attho vutto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vimokkhañcā"
      },
      "ti ettha liṅgavipallāso kato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tīṇi akusalamūlānī"
      },
      "ti lobhadosamohā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tīṇi duccaritānī"
      },
      "ti kāyavacīmanoduccaritāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbepi akusalā dhammā"
      },
      "ti akusalamūlehi sampayuttā duccaritehi sampayuttā ca asampayuttā ca sevitabbadomanassādīni ṭhapetvā sabbepi akusalā dhammā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kusalamūlasucaritāni"
      },
      " vuttapaṭipakkhena veditabbāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbepi kusalā dhammā"
      },
      "ti vuttanayeneva sampayuttā asampayuttā ca vimokkhassa upanissayabhūtā sabbepi kusalā dhammā. Vivaṭṭakathā heṭṭhā vuttā. Vimokkhavivaṭṭasambandhena panettha sesavivaṭṭāpi vuttā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āsevanā"
      },
      "ti ādito sevanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhāvanā"
      },
      "ti tasseva vaḍḍhanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bahulīkamma"
      },
      "nti tasseva vasippattiyā punappunaṃ karaṇaṃ. Maggassa pana ekakkhaṇeyeva kiccasādhanavasena āsevanādīni veditabbāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭilābho vā vipāko vā"
      },
      "tiādīni heṭṭhā vuttatthānevāti."
    ],
    "innerText": "230.Tattha jātāti anantare vipassanāvimokkhepi sati imissā kathāya maggavimokkhādhikārattā tasmiṃ maggavimokkhe jātāti vuttaṃ hoti. Anavajjakusalāti rāgādivajjavirahitā kusalā. Vicchedaṃ katvā vā pāṭho. Bodhipakkhiyā dhammāti ‘‘cattāro satipaṭṭhānā, cattāro sammappadhānā, cattāro iddhipādā, pañcindriyāni, pañca balāni, satta bojjhaṅgā , ariyo aṭṭhaṅgiko maggo’’ti (ma. ni. 3.35, 43; cūḷani. mettagūmāṇavapucchāniddesa 22; mi. pa. 5.4.1) vuttā sattatiṃsa bodhipakkhiyadhammā. Idaṃ mukhanti idaṃ vuttappakāraṃ dhammajātaṃ ārammaṇato nibbānapavesāya mukhattā mukhaṃ nāmāti vuttaṃ hoti. Tesaṃ dhammānanti tesaṃ bodhipakkhiyānaṃ dhammānaṃ. Idaṃ vimokkhamukhanti nibbānaṃ vikkhambhanatadaṅgasamucchedapaṭippassaddhinissaraṇavimokkhesu nissaraṇavimokkhova, ‘‘yāvatā, bhikkhave , dhammā saṅkhatā vā asaṅkhatā vā, virāgo tesaṃ dhammānaṃ aggamakkhāyatī’’ti (itivu. 90; a. ni. 4.34) vuttattā uttamaṭṭhena mukhañcāti vimokkhamukhaṃ. Vimokkhañca taṃ mukhañca vimokkhamukhanti kammadhārayasamāsavasena ayameva attho vutto. Vimokkhañcāti ettha liṅgavipallāso kato. Tīṇi akusalamūlānīti lobhadosamohā. Tīṇi duccaritānīti kāyavacīmanoduccaritāni. Sabbepi akusalā dhammāti akusalamūlehi sampayuttā duccaritehi sampayuttā ca asampayuttā ca sevitabbadomanassādīni ṭhapetvā sabbepi akusalā dhammā. Kusalamūlasucaritāni vuttapaṭipakkhena veditabbāni. Sabbepi kusalā dhammāti vuttanayeneva sampayuttā asampayuttā ca vimokkhassa upanissayabhūtā sabbepi kusalā dhammā. Vivaṭṭakathā heṭṭhā vuttā. Vimokkhavivaṭṭasambandhena panettha sesavivaṭṭāpi vuttā. Āsevanāti ādito sevanā. Bhāvanāti tasseva vaḍḍhanā. Bahulīkammanti tasseva vasippattiyā punappunaṃ karaṇaṃ. Maggassa pana ekakkhaṇeyeva kiccasādhanavasena āsevanādīni veditabbāni. Paṭilābho vā vipāko vātiādīni heṭṭhā vuttatthānevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vimokkhaniddesavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Saddhammappakāsiniyā paṭisambhidāmagga-aṭṭhakathāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vimokkhakathāvaṇṇanā niṭṭhitā."
  }
]