[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "10. Maṇḍapeyyakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "Maṇḍapeyyakathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "238"
      },
      ". Idāni ",
      " tassa maggassa maṇḍapeyyattaṃ dassentena kathitāya bhagavato vacanekadesapubbaṅgamāya maṇḍapeyyakathāya apubbatthānuvaṇṇanā. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "maṇḍapeyya"
      },
      "nti yathā sampannaṃ nimmalaṃ vippasannaṃ sappi sappimaṇḍoti vuccati, evaṃ vippasannaṭṭhena maṇḍo, pātabbaṭṭhena peyyaṃ. Yañhi pivitvā antaravīthiyaṃ patitā visaññino attano sāṭakādīnampi assāmikā honti, taṃ pasannampi na pātabbaṃ. Mayhaṃ pana idaṃ sikkhattayasaṅgahitaṃ sāsanabrahmacariyaṃ sampannattā nimmalattā vippasannattā maṇḍañca hitasukhāvahattā peyyañcāti maṇḍapeyyanti dīpeti. Maṇḍo peyyo etthāti maṇḍapeyyaṃ. Kiṃ taṃ? Sāsana",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "brahmacariyaṃ"
      },
      ". Kasmā sikkhattayaṃ brahmacariyaṃ nāma? Uttamaṭṭhena nibbānaṃ brahmaṃ nāma, sikkhattayaṃ nibbānatthāya pavattanato brahmatthāya cariyāti brahmacariyanti vuccati. Sāsanabrahmacariyanti taṃyeva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Satthā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammukhībhūto"
      },
      "ti idamettha kāraṇavacanaṃ. Yasmā pana satthā sammukhībhūto, tasmā vīriyapayogaṃ katvā pivathetaṃ maṇḍaṃ. Bāhirakañhi bhesajjamaṇḍaṃ vejjassa asammukhā pivantānaṃ pamāṇaṃ vā uggamananiggamanaṃ vā na jānāmāti āsaṅkā hoti. Vejjassa sammukhā pana vejjo jānissatīti nirāsaṅkā pivanti. Evamevaṃ amhākañca dhammassāmī satthā sammukhībhūtoti vīriyaṃ katvā pivathāti maṇḍapāne sanniyojeti. Diṭṭhadhammikasamparāyikaparamatthehi yathārahaṃ anusāsatīti satthā. Apica ‘‘satthā bhagavā satthavāho’’tiādinā (mahāni. 190) niddesanayenapettha attho veditabbo. Sandissamāno mukho bhūtoti sammukhībhūto."
    ],
    "innerText": "238. Idāni tassa maggassa maṇḍapeyyattaṃ dassentena kathitāya bhagavato vacanekadesapubbaṅgamāya maṇḍapeyyakathāya apubbatthānuvaṇṇanā. Tattha maṇḍapeyyanti yathā sampannaṃ nimmalaṃ vippasannaṃ sappi sappimaṇḍoti vuccati, evaṃ vippasannaṭṭhena maṇḍo, pātabbaṭṭhena peyyaṃ. Yañhi pivitvā antaravīthiyaṃ patitā visaññino attano sāṭakādīnampi assāmikā honti, taṃ pasannampi na pātabbaṃ. Mayhaṃ pana idaṃ sikkhattayasaṅgahitaṃ sāsanabrahmacariyaṃ sampannattā nimmalattā vippasannattā maṇḍañca hitasukhāvahattā peyyañcāti maṇḍapeyyanti dīpeti. Maṇḍo peyyo etthāti maṇḍapeyyaṃ. Kiṃ taṃ? Sāsanabrahmacariyaṃ. Kasmā sikkhattayaṃ brahmacariyaṃ nāma? Uttamaṭṭhena nibbānaṃ brahmaṃ nāma, sikkhattayaṃ nibbānatthāya pavattanato brahmatthāya cariyāti brahmacariyanti vuccati. Sāsanabrahmacariyanti taṃyeva. Satthāsammukhībhūtoti idamettha kāraṇavacanaṃ. Yasmā pana satthā sammukhībhūto, tasmā vīriyapayogaṃ katvā pivathetaṃ maṇḍaṃ. Bāhirakañhi bhesajjamaṇḍaṃ vejjassa asammukhā pivantānaṃ pamāṇaṃ vā uggamananiggamanaṃ vā na jānāmāti āsaṅkā hoti. Vejjassa sammukhā pana vejjo jānissatīti nirāsaṅkā pivanti. Evamevaṃ amhākañca dhammassāmī satthā sammukhībhūtoti vīriyaṃ katvā pivathāti maṇḍapāne sanniyojeti. Diṭṭhadhammikasamparāyikaparamatthehi yathārahaṃ anusāsatīti satthā. Apica ‘‘satthā bhagavā satthavāho’’tiādinā (mahāni. 190) niddesanayenapettha attho veditabbo. Sandissamāno mukho bhūtoti sammukhībhūto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Maṇḍapeyyaniddese ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tidhattamaṇḍo"
      },
      "ti tidhābhāvo tidhattaṃ. Tidhattena maṇḍo tidhattamaṇḍo, tividhena maṇḍoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Satthari sammukhībhūte"
      },
      "ti idaṃ sabbākāraparipuṇṇamaṇḍattayadassanatthaṃ vuttaṃ. Parinibbutepi pana ",
      " satthari ekadesena maṇḍattayaṃ pavattatiyeva. Teneva cassa niddese ‘‘satthari sammukhībhūte’’ti avatvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "katamo desanāmaṇḍo"
      },
      "tiādi vuttanti veditabbaṃ."
    ],
    "innerText": "Maṇḍapeyyaniddese tidhattamaṇḍoti tidhābhāvo tidhattaṃ. Tidhattena maṇḍo tidhattamaṇḍo, tividhena maṇḍoti attho. Satthari sammukhībhūteti idaṃ sabbākāraparipuṇṇamaṇḍattayadassanatthaṃ vuttaṃ. Parinibbutepi pana satthari ekadesena maṇḍattayaṃ pavattatiyeva. Teneva cassa niddese ‘‘satthari sammukhībhūte’’ti avatvā katamo desanāmaṇḍotiādi vuttanti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Desanāmaṇḍo"
      },
      "ti ",
      " dhammadesanā eva maṇḍo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭiggahamaṇḍo"
      },
      "ti desanāpaṭiggāhako eva maṇḍo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Brahmacariyamaṇḍo"
      },
      "ti maggabrahmacariyameva maṇḍo."
    ],
    "innerText": "Desanāmaṇḍoti dhammadesanā eva maṇḍo. Paṭiggahamaṇḍoti desanāpaṭiggāhako eva maṇḍo. Brahmacariyamaṇḍoti maggabrahmacariyameva maṇḍo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ācikkhanā"
      },
      "ti desetabbānaṃ saccādīnaṃ imāni nāmānīti nāmavasena kathanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Desanā"
      },
      "ti dassanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññāpanā"
      },
      "ti jānāpanā, ñāṇamukhe ṭhapanā vā. Āsanaṃ ṭhapento hi ‘‘āsanaṃ paññāpetī’’ti vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭṭhapanā"
      },
      "ti paññāpanā, pavattanāti attho, ñāṇamukhe ṭhapanā vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vivaraṇā"
      },
      "ti vivaṭakaraṇaṃ, vivaritvā dassanāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vibhajanā"
      },
      "ti vibhāgakiriyā, vibhāgato dassanāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uttānīkamma"
      },
      "nti pākaṭabhāvakaraṇaṃ. Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ācikkhanā"
      },
      "ti desanādīnaṃ channaṃ padānaṃ mūlapadaṃ. Desanādīni cha padāni tassa atthavivaraṇatthaṃ vuttāni. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "desanā"
      },
      "ti ugghaṭitaññūnaṃ vasena saṅkhepato paṭhamaṃ uddesavasena desanā. Ugghaṭitaññū hi saṅkhepena vuttaṃ paṭhamaṃ vuttañca paṭivijjhanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññāpanā"
      },
      "ti vipañcitaññūnaṃ vasena tesaṃ cittatosanena buddhinisānena ca paṭhamaṃ saṅkhittassa vitthārato niddesavasena paññāpanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭṭhapanā"
      },
      "ti tesaṃyeva niddiṭṭhassa niddesassa paṭiniddesavasena vitthārataravacanena paññāpanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vivaraṇā"
      },
      "ti niddiṭṭhassāpi punappunaṃ vacanena vivaraṇā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vibhajanā"
      },
      "ti ",
      " punappunaṃ vuttassāpi vibhāgakaraṇena vibhajanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uttānīkamma"
      },
      "nti vivaṭassa vitthārataravacanena, vibhattassa ca nidassanavacanena uttānīkaraṇaṃ. Ayaṃ desanā neyyānampi paṭivedhāya hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yevāpanaññepi kecī"
      },
      "ti piyaṅkaramātādikā vinipātikā gahitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Viññātāro"
      },
      "ti paṭivedhavasena lokuttaradhammaṃ viññātāro. Ete hi bhikkhuādayo paṭivedhavasena dhammadesanaṃ paṭiggaṇhantīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭiggahā. Ayamevā"
      },
      "tiādīni paṭhamañāṇaniddese vuttatthāni. Ariyamaggo nibbānena saṃsandanato brahmatthāya cariyāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "brahmacariya"
      },
      "nti vuccati."
    ],
    "innerText": "Ācikkhanāti desetabbānaṃ saccādīnaṃ imāni nāmānīti nāmavasena kathanā. Desanāti dassanā. Paññāpanāti jānāpanā, ñāṇamukhe ṭhapanā vā. Āsanaṃ ṭhapento hi ‘‘āsanaṃ paññāpetī’’ti vuccati. Paṭṭhapanāti paññāpanā, pavattanāti attho, ñāṇamukhe ṭhapanā vā. Vivaraṇāti vivaṭakaraṇaṃ, vivaritvā dassanāti attho. Vibhajanāti vibhāgakiriyā, vibhāgato dassanāti attho. Uttānīkammanti pākaṭabhāvakaraṇaṃ. Atha vā ācikkhanāti desanādīnaṃ channaṃ padānaṃ mūlapadaṃ. Desanādīni cha padāni tassa atthavivaraṇatthaṃ vuttāni. Tattha desanāti ugghaṭitaññūnaṃ vasena saṅkhepato paṭhamaṃ uddesavasena desanā. Ugghaṭitaññū hi saṅkhepena vuttaṃ paṭhamaṃ vuttañca paṭivijjhanti. Paññāpanāti vipañcitaññūnaṃ vasena tesaṃ cittatosanena buddhinisānena ca paṭhamaṃ saṅkhittassa vitthārato niddesavasena paññāpanā. Paṭṭhapanāti tesaṃyeva niddiṭṭhassa niddesassa paṭiniddesavasena vitthārataravacanena paññāpanā. Vivaraṇāti niddiṭṭhassāpi punappunaṃ vacanena vivaraṇā. Vibhajanāti punappunaṃ vuttassāpi vibhāgakaraṇena vibhajanā. Uttānīkammanti vivaṭassa vitthārataravacanena, vibhattassa ca nidassanavacanena uttānīkaraṇaṃ. Ayaṃ desanā neyyānampi paṭivedhāya hoti. Yevāpanaññepi kecīti piyaṅkaramātādikā vinipātikā gahitā. Viññātāroti paṭivedhavasena lokuttaradhammaṃ viññātāro. Ete hi bhikkhuādayo paṭivedhavasena dhammadesanaṃ paṭiggaṇhantīti paṭiggahā. Ayamevātiādīni paṭhamañāṇaniddese vuttatthāni. Ariyamaggo nibbānena saṃsandanato brahmatthāya cariyāti brahmacariyanti vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "239"
      },
      ". Idāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "adhimokkhamaṇḍo"
      },
      "tiādīhi tasmiṃ maggakkhaṇe vijjamānāni indriyabalabojjhaṅgamaggaṅgāni maṇḍapeyyavidhāne yojetvā dasseti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "adhimokkhamaṇḍo"
      },
      "ti adhimokkhasaṅkhāto maṇḍo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kasaṭo"
      },
      "ti pasādavirahito āvilo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Chaḍḍetvā"
      },
      "ti samucchedavasena pahāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddhindriyassa adhimokkhamaṇḍaṃ pivatīti maṇḍapeyya"
      },
      "nti saddhindriyato adhimokkhamaṇḍassa anaññattepi sati aññaṃ viya katvā vohāravasena vuccati, yathā loke nisadapotako nisadapotasarīrassa anaññattepi sati nisadapotassa sarīranti vuccati, yathā ca pāḷiyaṃ ‘‘phusitatta’’ntiādīsu dhammato anaññopi bhāvo añño viya vutto, yathā ca aṭṭhakathāyaṃ ‘‘phusanalakkhaṇo phasso’’tiādīsu (dha. sa. aṭṭha. 1 dhammuddesavāra phassapañcamakarāsivaṇṇanā) dhammato anaññampi lakkhaṇaṃ aññaṃ viya vuttaṃ, evamidanti veditabbaṃ ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pivatī"
      },
      "ti cettha taṃsamaṅgipuggaloti vuttaṃ hoti. Taṃsamaṅgipuggalo taṃ maṇḍaṃ pivatīti katvā tena puggalena so maṇḍo pātabbato maṇḍapeyyaṃ nāma hotīti vuttaṃ hoti. ‘‘Maṇḍapeyyo’’ti ca vattabbe ‘‘maṇḍapeyya’’nti liṅgavipallāso kato. Sesānampi iminā nayena attho veditabbo. Apubbesu pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pariḷāho"
      },
      "ti pīṇanalakkhaṇāya pītiyā paṭipakkho kilesasantāpo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Duṭṭhulla"
      },
      "nti upasamapaṭipakkho kilesavasena oḷārikabhāvo asantabhāvo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appaṭisaṅkhā"
      },
      "ti paṭisaṅkhānapaṭipakkho kilesavasena asamavāhitabhāvo."
    ],
    "innerText": "239. Idāni adhimokkhamaṇḍotiādīhi tasmiṃ maggakkhaṇe vijjamānāni indriyabalabojjhaṅgamaggaṅgāni maṇḍapeyyavidhāne yojetvā dasseti. Tattha adhimokkhamaṇḍoti adhimokkhasaṅkhāto maṇḍo. Kasaṭoti pasādavirahito āvilo. Chaḍḍetvāti samucchedavasena pahāya. Saddhindriyassa adhimokkhamaṇḍaṃ pivatīti maṇḍapeyyanti saddhindriyato adhimokkhamaṇḍassa anaññattepi sati aññaṃ viya katvā vohāravasena vuccati, yathā loke nisadapotako nisadapotasarīrassa anaññattepi sati nisadapotassa sarīranti vuccati, yathā ca pāḷiyaṃ ‘‘phusitatta’’ntiādīsu dhammato anaññopi bhāvo añño viya vutto, yathā ca aṭṭhakathāyaṃ ‘‘phusanalakkhaṇo phasso’’tiādīsu (dha. sa. aṭṭha. 1 dhammuddesavāra phassapañcamakarāsivaṇṇanā) dhammato anaññampi lakkhaṇaṃ aññaṃ viya vuttaṃ, evamidanti veditabbaṃ . Pivatīti cettha taṃsamaṅgipuggaloti vuttaṃ hoti. Taṃsamaṅgipuggalo taṃ maṇḍaṃ pivatīti katvā tena puggalena so maṇḍo pātabbato maṇḍapeyyaṃ nāma hotīti vuttaṃ hoti. ‘‘Maṇḍapeyyo’’ti ca vattabbe ‘‘maṇḍapeyya’’nti liṅgavipallāso kato. Sesānampi iminā nayena attho veditabbo. Apubbesu pana pariḷāhoti pīṇanalakkhaṇāya pītiyā paṭipakkho kilesasantāpo. Duṭṭhullanti upasamapaṭipakkho kilesavasena oḷārikabhāvo asantabhāvo. Appaṭisaṅkhāti paṭisaṅkhānapaṭipakkho kilesavasena asamavāhitabhāvo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "240"
      },
      ". Puna aññena pariyāyena maṇḍapeyyavidhiṃ niddisitukāmo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atthi maṇḍo"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tatthā"
      },
      "ti tasmiṃ saddhindriye. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attharaso"
      },
      "tiādīsu saddhindriyassa adhimuccanaṃ attho, saddhindriyaṃ dhammo, tadeva nānākilesehi vimuttattā vimutti, tassa atthassa sampatti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "attharaso"
      },
      ". Tassa dhammassa sampatti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammaraso"
      },
      ". Tassā vimuttiyā sampatti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vimuttiraso"
      },
      ". Atha vā atthapaṭilābharati attharaso, dhammapaṭilābharati dhammaraso, vimuttipaṭilābharati vimuttiraso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ratī"
      },
      "ti ca taṃsampayuttā, tadārammaṇā vā pīti. Iminā nayena sesapadesupi attho veditabbo. Imasmiṃ pariyāye maṇḍassa ",
      " peyyaṃ maṇḍapeyyanti attho vutto hoti."
    ],
    "innerText": "240. Puna aññena pariyāyena maṇḍapeyyavidhiṃ niddisitukāmo atthi maṇḍotiādimāha. Tattha tatthāti tasmiṃ saddhindriye. Attharasotiādīsu saddhindriyassa adhimuccanaṃ attho, saddhindriyaṃ dhammo, tadeva nānākilesehi vimuttattā vimutti, tassa atthassa sampatti attharaso. Tassa dhammassa sampatti dhammaraso. Tassā vimuttiyā sampatti vimuttiraso. Atha vā atthapaṭilābharati attharaso, dhammapaṭilābharati dhammaraso, vimuttipaṭilābharati vimuttiraso. Ratīti ca taṃsampayuttā, tadārammaṇā vā pīti. Iminā nayena sesapadesupi attho veditabbo. Imasmiṃ pariyāye maṇḍassa peyyaṃ maṇḍapeyyanti attho vutto hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ indriyādibodhipakkhiyadhammapaṭipāṭiyā indriyabalabojjhaṅgamaggaṅgānaṃ vasena maṇḍapeyyaṃ dassetvā puna ante ṭhitaṃ brahmacariyamaṇḍaṃ dassento maggassa padhānattā maggaṃ pubbaṅgamaṃ katvā uppaṭipāṭivasena maggaṅgabojjhaṅgabalaindriyāni dassesi ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ādhipateyyaṭṭhena indriyā maṇḍo"
      },
      "tiādayo yathāyogaṃ lokiyalokuttarā maṇḍā. Taṃ heṭṭhā vuttanayena veditabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tathaṭṭhena saccā maṇḍo"
      },
      "ti ettha pana dukkhasamudayānaṃ maṇḍattābhāvā mahāhatthipadasutte (ma. ni. 1.300) viya saccañāṇāni saccāti vuttanti veditabbaṃ."
    ],
    "innerText": "Evaṃ indriyādibodhipakkhiyadhammapaṭipāṭiyā indriyabalabojjhaṅgamaggaṅgānaṃ vasena maṇḍapeyyaṃ dassetvā puna ante ṭhitaṃ brahmacariyamaṇḍaṃ dassento maggassa padhānattā maggaṃ pubbaṅgamaṃ katvā uppaṭipāṭivasena maggaṅgabojjhaṅgabalaindriyāni dassesi . Ādhipateyyaṭṭhena indriyā maṇḍotiādayo yathāyogaṃ lokiyalokuttarā maṇḍā. Taṃ heṭṭhā vuttanayena veditabbaṃ. Tathaṭṭhena saccā maṇḍoti ettha pana dukkhasamudayānaṃ maṇḍattābhāvā mahāhatthipadasutte (ma. ni. 1.300) viya saccañāṇāni saccāti vuttanti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Saddhammappakāsiniyā paṭisambhidāmagga-aṭṭhakathāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Maṇḍapeyyakathāvaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Niṭṭhitā ca mahāvaggavaṇṇanā."
  }
]