[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "Nayasamuṭṭhānaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "79"
      },
      ". Tattha katamaṃ nayasamuṭṭhānaṃ? Pubbā koṭi na paññāyati avijjāyaca bhavataṇhāya ca, tattha avijjānīvaraṇaṃ taṇhāsaṃyojanaṃ. Avijjānīvaraṇā sattā avijjāsaṃyuttā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[avijjāya saṃyuttā (sī. ka.)]"
      },
      " avijjāpakkhena vicaranti, te vuccanti diṭṭhicaritāti. Taṇhāsaṃyojanā sattā taṇhāsaṃyuttā taṇhāpakkhena vicaranti, te vuccanti taṇhācaritāti. Diṭṭhicaritā ",
      " ito bahiddhā pabbajitā attakilamathānuyogamanuyuttā viharanti. Taṇhācaritā ito bahiddhā pabbajitā kāmesu kāmasukhallikānuyogamanuyuttā viharanti."
    ],
    "innerText": "79. Tattha katamaṃ nayasamuṭṭhānaṃ? Pubbā koṭi na paññāyati avijjāyaca bhavataṇhāya ca, tattha avijjānīvaraṇaṃ taṇhāsaṃyojanaṃ. Avijjānīvaraṇā sattā avijjāsaṃyuttā [avijjāya saṃyuttā (sī. ka.)] avijjāpakkhena vicaranti, te vuccanti diṭṭhicaritāti. Taṇhāsaṃyojanā sattā taṇhāsaṃyuttā taṇhāpakkhena vicaranti, te vuccanti taṇhācaritāti. Diṭṭhicaritā ito bahiddhā pabbajitā attakilamathānuyogamanuyuttā viharanti. Taṇhācaritā ito bahiddhā pabbajitā kāmesu kāmasukhallikānuyogamanuyuttā viharanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      " kiṃkāraṇaṃ yaṃ diṭṭhicaritā ito bahiddhā pabbajitā attakilamathānuyogamanuyuttā viharanti, taṇhācaritā ito bahiddhā pabbajitā kāmesu kāmasukhallikānuyogamanuyuttā viharanti? Ito bahiddhā natthi saccavavatthānaṃ, kuto catusaccappakāsanā vā samathavipassanākosallaṃ vā upasamasukhappatti vā! Te upasamasukhassa anabhiññā viparītacetā evamāhaṃsu ‘‘natthi sukhena sukhaṃ, dukkhena nāma sukhaṃ adhigantabba’’nti. Yo kāme paṭisevati, so lokaṃ vaḍḍhayati, yo lokaṃ vaḍḍhayati, so bahuṃ puññaṃ pasavatīti te evaṃsaññī evaṃdiṭṭhī dukkhena sukhaṃ patthayamānā kāmesu puññasaññī attakilamathānuyogamanuyuttā ca viharanti kāmasukhallikānuyogamanuyuttā ca, te tadabhiññā santā rogameva vaḍḍhayanti, gaṇḍameva vaḍḍhayanti, sallameva vaḍḍhayanti, te rogābhitunnā gaṇḍapaṭipīḷitā sallānuviddhā nirayatiracchānayonipetāsuresu ummujjanimujjāni karontā ugghātanigghātaṃ paccanubhontā rogagaṇḍasallabhesajjaṃ na vindanti. Tattha attakilamathānuyogo kāmasukhallikānuyogo ca saṃkileso, samathavipassanā vodānaṃ. Attakilamathānuyogo kāmasukhallikānuyogo ca rogo, samathavipassanā roganigghātakabhesajjaṃ. Attakilamathānuyogo kāmasukhallikānuyogo ca gaṇḍo, samathavipassanā gaṇḍanigghātakabhesajjaṃ ",
      ". Attakilamathānuyogo kāmasukhallikānuyogo ca sallo, samathavipassanā salluddharaṇabhesajjaṃ."
    ],
    "innerText": "Tattha kiṃkāraṇaṃ yaṃ diṭṭhicaritā ito bahiddhā pabbajitā attakilamathānuyogamanuyuttā viharanti, taṇhācaritā ito bahiddhā pabbajitā kāmesu kāmasukhallikānuyogamanuyuttā viharanti? Ito bahiddhā natthi saccavavatthānaṃ, kuto catusaccappakāsanā vā samathavipassanākosallaṃ vā upasamasukhappatti vā! Te upasamasukhassa anabhiññā viparītacetā evamāhaṃsu ‘‘natthi sukhena sukhaṃ, dukkhena nāma sukhaṃ adhigantabba’’nti. Yo kāme paṭisevati, so lokaṃ vaḍḍhayati, yo lokaṃ vaḍḍhayati, so bahuṃ puññaṃ pasavatīti te evaṃsaññī evaṃdiṭṭhī dukkhena sukhaṃ patthayamānā kāmesu puññasaññī attakilamathānuyogamanuyuttā ca viharanti kāmasukhallikānuyogamanuyuttā ca, te tadabhiññā santā rogameva vaḍḍhayanti, gaṇḍameva vaḍḍhayanti, sallameva vaḍḍhayanti, te rogābhitunnā gaṇḍapaṭipīḷitā sallānuviddhā nirayatiracchānayonipetāsuresu ummujjanimujjāni karontā ugghātanigghātaṃ paccanubhontā rogagaṇḍasallabhesajjaṃ na vindanti. Tattha attakilamathānuyogo kāmasukhallikānuyogo ca saṃkileso, samathavipassanā vodānaṃ. Attakilamathānuyogo kāmasukhallikānuyogo ca rogo, samathavipassanā roganigghātakabhesajjaṃ. Attakilamathānuyogo kāmasukhallikānuyogo ca gaṇḍo, samathavipassanā gaṇḍanigghātakabhesajjaṃ . Attakilamathānuyogo kāmasukhallikānuyogo ca sallo, samathavipassanā salluddharaṇabhesajjaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha saṃkileso dukkhaṃ, tadabhisaṅgo taṇhā samudayo, taṇhānirodho dukkhanirodho, samathavipassanā dukkhanirodhagāminī paṭipadā, imāni ",
      " cattāri saccāni. Dukkhaṃ pariññeyyaṃ, samudayo pahātabbo, maggo bhāvetabbo, nirodho sacchikātabbo."
    ],
    "innerText": "Tattha saṃkileso dukkhaṃ, tadabhisaṅgo taṇhā samudayo, taṇhānirodho dukkhanirodho, samathavipassanā dukkhanirodhagāminī paṭipadā, imāni cattāri saccāni. Dukkhaṃ pariññeyyaṃ, samudayo pahātabbo, maggo bhāvetabbo, nirodho sacchikātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "80"
      },
      ". Tattha diṭṭhicaritā rūpaṃ attato upagacchanti. Vedanaṃ…pe… saññaṃ…pe… saṅkhāre…pe… viññāṇaṃ attato upagacchanti. Taṇhācaritā rūpavantaṃ attānaṃ upagacchanti. Attani vā rūpaṃ, rūpasmiṃ vā attānaṃ, vedanāvantaṃ…pe… saññāvantaṃ…pe… saṅkhāravantaṃ…pe… viññāṇavantaṃ attānaṃ upagacchanti, attani vā viññāṇaṃ, viññāṇasmiṃ vā attānaṃ, ayaṃ vuccati vīsativatthukā sakkāyadiṭṭhi."
    ],
    "innerText": "80. Tattha diṭṭhicaritā rūpaṃ attato upagacchanti. Vedanaṃ…pe… saññaṃ…pe… saṅkhāre…pe… viññāṇaṃ attato upagacchanti. Taṇhācaritā rūpavantaṃ attānaṃ upagacchanti. Attani vā rūpaṃ, rūpasmiṃ vā attānaṃ, vedanāvantaṃ…pe… saññāvantaṃ…pe… saṅkhāravantaṃ…pe… viññāṇavantaṃ attānaṃ upagacchanti, attani vā viññāṇaṃ, viññāṇasmiṃ vā attānaṃ, ayaṃ vuccati vīsativatthukā sakkāyadiṭṭhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tassā paṭipakkho lokuttarā sammādiṭṭhi, anvāyikā sammāsaṅkappo sammāvācā sammākammanto sammāājīvo sammāvāyāmo sammāsati sammāsamādhi, ayaṃ ariyo aṭṭhaṅgiko maggo. Te tayo khandhā sīlakkhandho samādhikkhandho paññākkhandho. Sīlakkhandho samādhikkhandho ca samatho, paññākkhandho vipassanā. Tattha sakkāyo dukkhaṃ, sakkāyasamudayo dukkhasamudayo, sakkāyanirodho ",
      " dukkhanirodho, ariyo aṭṭhaṅgiko maggo dukkhanirodhagāminī paṭipadā, imāni cattāri saccāni. Dukkhaṃ pariññeyyaṃ, samudayo pahātabbo, maggo bhāvetabbo, nirodho sacchikātabbo."
    ],
    "innerText": "Tassā paṭipakkho lokuttarā sammādiṭṭhi, anvāyikā sammāsaṅkappo sammāvācā sammākammanto sammāājīvo sammāvāyāmo sammāsati sammāsamādhi, ayaṃ ariyo aṭṭhaṅgiko maggo. Te tayo khandhā sīlakkhandho samādhikkhandho paññākkhandho. Sīlakkhandho samādhikkhandho ca samatho, paññākkhandho vipassanā. Tattha sakkāyo dukkhaṃ, sakkāyasamudayo dukkhasamudayo, sakkāyanirodho dukkhanirodho, ariyo aṭṭhaṅgiko maggo dukkhanirodhagāminī paṭipadā, imāni cattāri saccāni. Dukkhaṃ pariññeyyaṃ, samudayo pahātabbo, maggo bhāvetabbo, nirodho sacchikātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ye rūpaṃ attato upagacchanti. Vedanaṃ…pe… saññaṃ…pe… saṅkhāre…pe… viññāṇaṃ attato upagacchanti. Ime vuccanti ‘‘ucchedavādino’’ti. Ye rūpavantaṃ attānaṃ upagacchanti. Attani vā rūpaṃ, rūpasmiṃ vā attānaṃ. Ye vedanāvantaṃ…pe… ye saññāvantaṃ…pe… ye saṅkhāravantaṃ…pe… ye viññāṇavantaṃ attānaṃ upagacchanti, attani vā viññāṇaṃ, viññāṇasmiṃ vā attānaṃ. Ime vuccanti ‘‘sassatavādino’’ti, tattha ucchedasassatavādā ubho antā, ayaṃ saṃsārapavatti. Tassa ",
      " paṭipakkho majjhimā paṭipadā ariyo aṭṭhaṅgiko maggo, ayaṃ saṃsāranivatti. Tattha pavatti dukkhaṃ, tadabhisaṅgo taṇhā samudayo, taṇhānirodho dukkhanirodho, ariyo aṭṭhaṅgiko maggo dukkhanirodhagāminī ",
      " paṭipadā, imāni cattāri saccāni. Dukkhaṃ pariññeyyaṃ, samudayo pahātabbo, maggo bhāvetabbo, nirodho sacchikātabbo."
    ],
    "innerText": "Tattha ye rūpaṃ attato upagacchanti. Vedanaṃ…pe… saññaṃ…pe… saṅkhāre…pe… viññāṇaṃ attato upagacchanti. Ime vuccanti ‘‘ucchedavādino’’ti. Ye rūpavantaṃ attānaṃ upagacchanti. Attani vā rūpaṃ, rūpasmiṃ vā attānaṃ. Ye vedanāvantaṃ…pe… ye saññāvantaṃ…pe… ye saṅkhāravantaṃ…pe… ye viññāṇavantaṃ attānaṃ upagacchanti, attani vā viññāṇaṃ, viññāṇasmiṃ vā attānaṃ. Ime vuccanti ‘‘sassatavādino’’ti, tattha ucchedasassatavādā ubho antā, ayaṃ saṃsārapavatti. Tassa paṭipakkho majjhimā paṭipadā ariyo aṭṭhaṅgiko maggo, ayaṃ saṃsāranivatti. Tattha pavatti dukkhaṃ, tadabhisaṅgo taṇhā samudayo, taṇhānirodho dukkhanirodho, ariyo aṭṭhaṅgiko maggo dukkhanirodhagāminī paṭipadā, imāni cattāri saccāni. Dukkhaṃ pariññeyyaṃ, samudayo pahātabbo, maggo bhāvetabbo, nirodho sacchikātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ucchedasassataṃ samāsato vīsativatthukā sakkāyadiṭṭhi, vitthārato dvāsaṭṭhi diṭṭhigatāni, tesaṃ paṭipakkho tecattālīsaṃ bodhipakkhiyā dhammā aṭṭha vimokkhā dasa kasiṇāyatanāni. Dvāsaṭṭhi diṭṭhigatāni mohajālaṃ anādianidhanappavattaṃ. Tecattālīsaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[tetālīsaṃ (sī.)]"
      },
      " bodhipakkhiyā dhammā ñāṇavajiraṃ mohajālappadālanaṃ. Tattha moho avijjā, jālaṃ bhavataṇhā, tena vuccati ‘‘pubbā koṭi na paññāyati avijjāya ca bhavataṇhāya cā’’ti."
    ],
    "innerText": "Tattha ucchedasassataṃ samāsato vīsativatthukā sakkāyadiṭṭhi, vitthārato dvāsaṭṭhi diṭṭhigatāni, tesaṃ paṭipakkho tecattālīsaṃ bodhipakkhiyā dhammā aṭṭha vimokkhā dasa kasiṇāyatanāni. Dvāsaṭṭhi diṭṭhigatāni mohajālaṃ anādianidhanappavattaṃ. Tecattālīsaṃ [tetālīsaṃ (sī.)] bodhipakkhiyā dhammā ñāṇavajiraṃ mohajālappadālanaṃ. Tattha moho avijjā, jālaṃ bhavataṇhā, tena vuccati ‘‘pubbā koṭi na paññāyati avijjāya ca bhavataṇhāya cā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "81"
      },
      ". Tattha diṭṭhicarito asmiṃ sāsane pabbajito sallekhānusantatavutti bhavati sallekhe tibbagāravo. Taṇhācarito asmiṃ sāsane pabbajito sikkhānusantatavutti bhavati sikkhāya tibbagāravo. Diṭṭhicarito sammattaniyāmaṃ okkamanto dhammānusārī bhavati. Taṇhācarito sammattaniyāmaṃ okkamanto saddhānusārī bhavati, diṭṭhicarito sukhāya paṭipadāya dandhābhiññāya khippābhiññāya ca niyyāti. Taṇhācarito dukkhāya paṭipadāya dandhābhiññāya khippābhiññāya ca niyyāti."
    ],
    "innerText": "81. Tattha diṭṭhicarito asmiṃ sāsane pabbajito sallekhānusantatavutti bhavati sallekhe tibbagāravo. Taṇhācarito asmiṃ sāsane pabbajito sikkhānusantatavutti bhavati sikkhāya tibbagāravo. Diṭṭhicarito sammattaniyāmaṃ okkamanto dhammānusārī bhavati. Taṇhācarito sammattaniyāmaṃ okkamanto saddhānusārī bhavati, diṭṭhicarito sukhāya paṭipadāya dandhābhiññāya khippābhiññāya ca niyyāti. Taṇhācarito dukkhāya paṭipadāya dandhābhiññāya khippābhiññāya ca niyyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha kiṃkāraṇaṃ, yaṃ taṇhācarito dukkhāya paṭipadāya dandhābhiññāya khippābhiññāya ca niyyāti, tassa hi kāmā apariccattā bhavanti, so ",
      " kāmehi viveciyamāno dukkhena paṭinissarati ",
      " dandhañca dhammaṃ ājānāti? Yo panāyaṃ diṭṭhicarito ayaṃ āditoyeva kāmehi anatthiko bhavati. So tato viveciyamāno khippañca paṭinissarati, khippañca dhammaṃ ājānāti. Dukkhāpi paṭipadā duvidhā dandhābhiññā ca khippābhiññā ca. Sukhāpi paṭipadā duvidhā dandhābhiññā ca khippābhiññā ca. Sattāpi duvidhā mudindriyāpi tikkhindriyāpi. Ye mudindriyā, te dandhañca paṭinissaranti dandhañca dhammaṃ ājānanti. Ye tikkhindriyā, te khippañca paṭinissaranti, khippañca dhammaṃ ājānanti, imā catasso paṭipadā. Ye hi keci niyyiṃsu vā niyyanti vā niyyissanti vā, te imāhi eva catūhi paṭipadāhi. Evaṃ ariyā catukkamaggaṃ paññāpenti abudhajanasevitāya bālakantāya rattavāsiniyā nandiyā bhavataṇhāya avaṭṭanatthaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[āvaṭṭanatthaṃ (sī. ka.)]"
      },
      ". Ayaṃ vuccati nandiyāvaṭṭassa nayassa bhūmīti, tenāha ‘‘taṇhañca avijjampi ca samathenā’’ti."
    ],
    "innerText": "Tattha kiṃkāraṇaṃ, yaṃ taṇhācarito dukkhāya paṭipadāya dandhābhiññāya khippābhiññāya ca niyyāti, tassa hi kāmā apariccattā bhavanti, so kāmehi viveciyamāno dukkhena paṭinissarati dandhañca dhammaṃ ājānāti? Yo panāyaṃ diṭṭhicarito ayaṃ āditoyeva kāmehi anatthiko bhavati. So tato viveciyamāno khippañca paṭinissarati, khippañca dhammaṃ ājānāti. Dukkhāpi paṭipadā duvidhā dandhābhiññā ca khippābhiññā ca. Sukhāpi paṭipadā duvidhā dandhābhiññā ca khippābhiññā ca. Sattāpi duvidhā mudindriyāpi tikkhindriyāpi. Ye mudindriyā, te dandhañca paṭinissaranti dandhañca dhammaṃ ājānanti. Ye tikkhindriyā, te khippañca paṭinissaranti, khippañca dhammaṃ ājānanti, imā catasso paṭipadā. Ye hi keci niyyiṃsu vā niyyanti vā niyyissanti vā, te imāhi eva catūhi paṭipadāhi. Evaṃ ariyā catukkamaggaṃ paññāpenti abudhajanasevitāya bālakantāya rattavāsiniyā nandiyā bhavataṇhāya avaṭṭanatthaṃ [āvaṭṭanatthaṃ (sī. ka.)]. Ayaṃ vuccati nandiyāvaṭṭassa nayassa bhūmīti, tenāha ‘‘taṇhañca avijjampi ca samathenā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "82"
      },
      ". Veyyākaraṇesu ",
      " hi ye kusalākusalāti te duvidhā upaparikkhitabbā – lokavaṭṭānusārī ca lokavivaṭṭānusārī ca. Vaṭṭaṃ nāma saṃsāro. Vivaṭṭaṃ nibbānaṃ. Kammakilesā hetu saṃsārassa. Tattha kammaṃ cetanā cetasikañca niddisitabbaṃ. Taṃ kathaṃ daṭṭhabbaṃ? Upacayena sabbepi kilesā catūhi vipallāsehi niddisitabbā. Te kattha daṭṭhabbā? Dasa vatthuke kilesapuñje. Katamāni ",
      " dasa vatthūni? Cattāro āhārā, cattāro vipallāsā, cattāri upādānāni, cattāro yogā, cattāro ganthā, cattāro āsavā, cattāro oghā, cattāro sallā, catasso viññāṇaṭṭhitiyo cattāri agatigamanāni. Paṭhame āhāre paṭhamo vipallāso, dutiye āhāre dutiyo vipallāso, tatiye āhāre tatiyo vipallāso, catutthe āhāre catuttho vipallāso. Paṭhame vipallāse paṭhamaṃ upādānaṃ. Dutiye vipallāse dutiyaṃ upādānaṃ, tatiye vipallāse tatiyaṃ upādānaṃ, catutthe vipallāse catutthaṃ upādānaṃ. Paṭhame upādāne paṭhamo yogo, dutiye upādāne dutiyo yogo, tatiye upādāne tatiyo yogo, catutthe upādāne catuttho yogo. Paṭhame yoge paṭhamo gantho, dutiye yoge dutiyo gantho, tatiye yoge tatiyo gantho, catutthe yoge catuttho gantho, paṭhame ganthe paṭhamo āsavo, dutiye ganthe dutiyo āsavo, tatiye ganthe tatiyo āsavo, catutthe ganthe catuttho āsavo. Paṭhame āsave paṭhamo ogho, dutiye āsave dutiyo ogho, tatiye āsave tatiyo ogho, catutthe āsave catuttho ogho. Paṭhame oghe paṭhamo sallo, dutiye oghe dutiyo sallo, tatiye oghe tatiyo sallo, catutthe oghe catuttho sallo. Paṭhame salle paṭhamā viññāṇaṭṭhiti, dutiye salle dutiyā viññāṇaṭṭhiti, tatiye salle tatiyā viññāṇaṭṭhiti, catutthe salle catutthī ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[catutthā (sī.)]"
      },
      " viññāṇaṭṭhiti, paṭhamāyaṃ viññāṇaṭṭhitiyaṃ paṭhamaṃ agatigamanaṃ. Dutiyāyaṃ viññāṇaṭṭhitiyaṃ ",
      " dutiyaṃ agatigamanaṃ. Tatiyāyaṃ viññāṇaṭṭhitiyaṃ tatiyaṃ agatigamanaṃ, catutthiyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[catutthāyaṃ (sī.)]"
      },
      " viññāṇaṭṭhitiyaṃ catutthaṃ agatigamanaṃ."
    ],
    "innerText": "82. Veyyākaraṇesu hi ye kusalākusalāti te duvidhā upaparikkhitabbā – lokavaṭṭānusārī ca lokavivaṭṭānusārī ca. Vaṭṭaṃ nāma saṃsāro. Vivaṭṭaṃ nibbānaṃ. Kammakilesā hetu saṃsārassa. Tattha kammaṃ cetanā cetasikañca niddisitabbaṃ. Taṃ kathaṃ daṭṭhabbaṃ? Upacayena sabbepi kilesā catūhi vipallāsehi niddisitabbā. Te kattha daṭṭhabbā? Dasa vatthuke kilesapuñje. Katamāni dasa vatthūni? Cattāro āhārā, cattāro vipallāsā, cattāri upādānāni, cattāro yogā, cattāro ganthā, cattāro āsavā, cattāro oghā, cattāro sallā, catasso viññāṇaṭṭhitiyo cattāri agatigamanāni. Paṭhame āhāre paṭhamo vipallāso, dutiye āhāre dutiyo vipallāso, tatiye āhāre tatiyo vipallāso, catutthe āhāre catuttho vipallāso. Paṭhame vipallāse paṭhamaṃ upādānaṃ. Dutiye vipallāse dutiyaṃ upādānaṃ, tatiye vipallāse tatiyaṃ upādānaṃ, catutthe vipallāse catutthaṃ upādānaṃ. Paṭhame upādāne paṭhamo yogo, dutiye upādāne dutiyo yogo, tatiye upādāne tatiyo yogo, catutthe upādāne catuttho yogo. Paṭhame yoge paṭhamo gantho, dutiye yoge dutiyo gantho, tatiye yoge tatiyo gantho, catutthe yoge catuttho gantho, paṭhame ganthe paṭhamo āsavo, dutiye ganthe dutiyo āsavo, tatiye ganthe tatiyo āsavo, catutthe ganthe catuttho āsavo. Paṭhame āsave paṭhamo ogho, dutiye āsave dutiyo ogho, tatiye āsave tatiyo ogho, catutthe āsave catuttho ogho. Paṭhame oghe paṭhamo sallo, dutiye oghe dutiyo sallo, tatiye oghe tatiyo sallo, catutthe oghe catuttho sallo. Paṭhame salle paṭhamā viññāṇaṭṭhiti, dutiye salle dutiyā viññāṇaṭṭhiti, tatiye salle tatiyā viññāṇaṭṭhiti, catutthe salle catutthī [catutthā (sī.)] viññāṇaṭṭhiti, paṭhamāyaṃ viññāṇaṭṭhitiyaṃ paṭhamaṃ agatigamanaṃ. Dutiyāyaṃ viññāṇaṭṭhitiyaṃ dutiyaṃ agatigamanaṃ. Tatiyāyaṃ viññāṇaṭṭhitiyaṃ tatiyaṃ agatigamanaṃ, catutthiyaṃ [catutthāyaṃ (sī.)] viññāṇaṭṭhitiyaṃ catutthaṃ agatigamanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "83"
      },
      ". Tattha ",
      " yo ca kabaḷīkāro āhāro phasso āhāro, ime taṇhācaritassa puggalassa upakkilesā. Yo ca manosañcetanāhāro yo ca viññāṇāhāro, ime diṭṭhicaritassa puggalassa upakkilesā. Tattha yo ca ‘‘asubhe subha’’nti vipallāso, yo ca ‘‘dukkhe sukha’’nti vipallāso, ime taṇhācaritassa puggalassa upakkilesā. Yo ca ‘‘anicce nicca’’nti vipallāso, yo ca ‘‘anattani attā’’ti vipallāso, ime diṭṭhicaritassa puggalassa upakkilesā. Tattha ",
      " yañca kāmupādānaṃ yañca bhavupādānaṃ, ime taṇhācaritassa puggalassa upakkilesā. Yañca diṭṭhupādānaṃ yañca attavādupādānaṃ, ime diṭṭhicaritassa puggalassa upakkilesā. Tattha yo ca kāmayogo, yo ca bhavayogo, ime taṇhācaritassa puggalassa upakkilesā. Yo ca diṭṭhiyogo, yo ca avijjāyogo, ime diṭṭhicaritassa puggalassa upakkilesā. Tattha yo ca abhijjhākāyagantho, yo ca byāpādo kāyagantho, ime taṇhācaritassa puggalassa upakkilesā. Yo ca parāmāsakāyagantho, yo ca idaṃsaccābhinivesakāyagantho, ime diṭṭhicaritassa puggalassa upakkilesā. Tattha yo ca kāmāsavo, yo ca bhavāsavo, ime taṇhācaritassa puggalassa upakkilesā. Yo ca diṭṭhāsavo, yo ca avijjāsavo, ime diṭṭhicaritassa puggalassa upakkilesā. Tattha yo ca kāmogho, yo ca bhavogho, ime taṇhācaritassa puggalassa upakkilesā. Yo ca diṭṭhogho, yo ca avijjogho, ime diṭṭhicaritassa puggalassa upakkilesā. Tattha yo ca rāgasallo, yo ca dosasallo, ime taṇhācaritassa puggalassa upakkilesā. Yo ca mānasallo, yo ca mohasallo, ime diṭṭhicaritassa puggalassa upakkilesā. Tattha yā ca rūpūpagā viññāṇaṭṭhiti, yā ca vedanūpagā viññāṇaṭṭhiti, ime taṇhācaritassa puggalassa upakkilesā. Yā ca saññūpagā viññāṇaṭṭhiti, yā ca saṅkhārūpagā viññāṇaṭṭhiti, ime diṭṭhicaritassa puggalassa upakkilesā. Tattha yañca chandā agatigamanaṃ yañca dosā agatigamanaṃ, ime taṇhācaritassa puggalassa upakkilesā. Yañca bhayā agatigamanaṃ, yañca mohā agatigamanaṃ, ime diṭṭhicaritassa puggalassa upakkilesā."
    ],
    "innerText": "83. Tattha yo ca kabaḷīkāro āhāro phasso āhāro, ime taṇhācaritassa puggalassa upakkilesā. Yo ca manosañcetanāhāro yo ca viññāṇāhāro, ime diṭṭhicaritassa puggalassa upakkilesā. Tattha yo ca ‘‘asubhe subha’’nti vipallāso, yo ca ‘‘dukkhe sukha’’nti vipallāso, ime taṇhācaritassa puggalassa upakkilesā. Yo ca ‘‘anicce nicca’’nti vipallāso, yo ca ‘‘anattani attā’’ti vipallāso, ime diṭṭhicaritassa puggalassa upakkilesā. Tattha yañca kāmupādānaṃ yañca bhavupādānaṃ, ime taṇhācaritassa puggalassa upakkilesā. Yañca diṭṭhupādānaṃ yañca attavādupādānaṃ, ime diṭṭhicaritassa puggalassa upakkilesā. Tattha yo ca kāmayogo, yo ca bhavayogo, ime taṇhācaritassa puggalassa upakkilesā. Yo ca diṭṭhiyogo, yo ca avijjāyogo, ime diṭṭhicaritassa puggalassa upakkilesā. Tattha yo ca abhijjhākāyagantho, yo ca byāpādo kāyagantho, ime taṇhācaritassa puggalassa upakkilesā. Yo ca parāmāsakāyagantho, yo ca idaṃsaccābhinivesakāyagantho, ime diṭṭhicaritassa puggalassa upakkilesā. Tattha yo ca kāmāsavo, yo ca bhavāsavo, ime taṇhācaritassa puggalassa upakkilesā. Yo ca diṭṭhāsavo, yo ca avijjāsavo, ime diṭṭhicaritassa puggalassa upakkilesā. Tattha yo ca kāmogho, yo ca bhavogho, ime taṇhācaritassa puggalassa upakkilesā. Yo ca diṭṭhogho, yo ca avijjogho, ime diṭṭhicaritassa puggalassa upakkilesā. Tattha yo ca rāgasallo, yo ca dosasallo, ime taṇhācaritassa puggalassa upakkilesā. Yo ca mānasallo, yo ca mohasallo, ime diṭṭhicaritassa puggalassa upakkilesā. Tattha yā ca rūpūpagā viññāṇaṭṭhiti, yā ca vedanūpagā viññāṇaṭṭhiti, ime taṇhācaritassa puggalassa upakkilesā. Yā ca saññūpagā viññāṇaṭṭhiti, yā ca saṅkhārūpagā viññāṇaṭṭhiti, ime diṭṭhicaritassa puggalassa upakkilesā. Tattha yañca chandā agatigamanaṃ yañca dosā agatigamanaṃ, ime taṇhācaritassa puggalassa upakkilesā. Yañca bhayā agatigamanaṃ, yañca mohā agatigamanaṃ, ime diṭṭhicaritassa puggalassa upakkilesā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "84"
      },
      ". Tattha kabaḷīkāre āhāre ‘‘asubhe subha’’nti vipallāso, phasse āhāre ‘‘dukkhe sukha’’nti vipallāso, viññāṇe āhāre ‘‘anicce ",
      " nicca’’nti vipallāso, manosañcetanāya āhāre ‘‘anattani attā’’ti vipallāso. Paṭhame vipallāse ṭhito kāme upādiyati ",
      ", idaṃ vuccati kāmupādānaṃ; dutiye vipallāse ṭhito anāgataṃ bhavaṃ upādiyati ",
      ", idaṃ vuccati bhavupādānaṃ; tatiye vipallāse ṭhito saṃsārābhinandiniṃ diṭṭhiṃ upādiyati, idaṃ vuccati diṭṭhupādānaṃ; catutthe vipallāse ṭhito attānaṃ kappiyaṃ upādiyati, idaṃ vuccati attavādupādānaṃ."
    ],
    "innerText": "84. Tattha kabaḷīkāre āhāre ‘‘asubhe subha’’nti vipallāso, phasse āhāre ‘‘dukkhe sukha’’nti vipallāso, viññāṇe āhāre ‘‘anicce nicca’’nti vipallāso, manosañcetanāya āhāre ‘‘anattani attā’’ti vipallāso. Paṭhame vipallāse ṭhito kāme upādiyati , idaṃ vuccati kāmupādānaṃ; dutiye vipallāse ṭhito anāgataṃ bhavaṃ upādiyati , idaṃ vuccati bhavupādānaṃ; tatiye vipallāse ṭhito saṃsārābhinandiniṃ diṭṭhiṃ upādiyati, idaṃ vuccati diṭṭhupādānaṃ; catutthe vipallāse ṭhito attānaṃ kappiyaṃ upādiyati, idaṃ vuccati attavādupādānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kāmupādānena kāmehi saṃyujjati, ayaṃ vuccati kāmayogo; bhavupādānena bhavehi saṃyujjati, ayaṃ vuccati bhavayogo; diṭṭhupādānena pāpikāya diṭṭhiyā saṃyujjati, ayaṃ vuccati diṭṭhiyogo; attavādupādānena avijjāya saṃyujjati, ayaṃ vuccati avijjāyogo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Paṭhame yoge ṭhito abhijjhāya kāyaṃ ganthati, ayaṃ vuccati abhijjhākāyagantho; dutiye yoge ṭhito byāpādena kāyaṃ ganthati, ayaṃ vuccati byāpādakāyagantho; tatiye yoge ṭhito parāmāsena kāyaṃ ganthati, ayaṃ vuccati parāmāsakāyagantho; catutthe yoge ṭhito idaṃsaccābhinivesena kāyaṃ ganthati, ayaṃ vuccati idaṃsaccābhinivesakāyagantho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassa evaṃganthitā kilesā āsavanti. Kuto ca vuccati āsavantīti? Anusayato vā pariyuṭṭhānato vā. Tattha abhijjhākāyaganthena kāmāsavo, byāpādakāyaganthena bhavāsavo, parāmāsakāyaganthena diṭṭhāsavo, idaṃsaccābhinivesakāyaganthena avijjāsavo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassa ime cattāro āsavā vepullaṃ gatā oghā bhavanti. Iti āsavavepullā oghavepullaṃ. Tattha kāmāsavena kāmogho, bhavāsavena bhavogho, diṭṭhāsavena diṭṭhogho, avijjāsavena avijjogho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassa ime cattāro oghā anusayasahagatā ajjhāsayaṃ anupaviṭṭhā hadayaṃ āhacca tiṭṭhanti, tena vuccanti sallāiti. Tattha kāmoghena rāgasallo, bhavoghena dosasallo, diṭṭhoghena mānasallo, avijjoghena mohasallo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tassa ",
      " imehi catūhi sallehi pariyādinnaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pariyādiṇṇaṃ (ka.)]"
      },
      " viññāṇaṃ catūsu dhammesu saṇṭhahati rūpe vedanāya saññāya saṅkhāresu. Tattha rāgasallena nandūpasecanena viññāṇena rūpūpagā ",
      " viññāṇaṭṭhiti, dosasallena nandūpasecanena viññāṇena vedanūpagā viññāṇaṭṭhiti, mānasallena nandūpasecanena ",
      " viññāṇena saññūpagā viññāṇaṭṭhiti, mohasallena nandūpasecanena viññāṇena saṅkhārūpagā viññāṇaṭṭhiti."
    ],
    "innerText": "Tassa imehi catūhi sallehi pariyādinnaṃ [pariyādiṇṇaṃ (ka.)] viññāṇaṃ catūsu dhammesu saṇṭhahati rūpe vedanāya saññāya saṅkhāresu. Tattha rāgasallena nandūpasecanena viññāṇena rūpūpagā viññāṇaṭṭhiti, dosasallena nandūpasecanena viññāṇena vedanūpagā viññāṇaṭṭhiti, mānasallena nandūpasecanena viññāṇena saññūpagā viññāṇaṭṭhiti, mohasallena nandūpasecanena viññāṇena saṅkhārūpagā viññāṇaṭṭhiti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassa imāhi catūhi viññāṇaṭṭhitīhi upatthaddhaṃ viññāṇaṃ catūhi dhammehi agatiṃ gacchati chandā dosā bhayā mohā. Tattha rāgena chandāgatiṃ gacchati, dosena dosāgatiṃ gacchati, bhayena bhayāgatiṃ gacchati, mohena mohāgatiṃ gacchati. Iti kho tañca kammaṃ ime ca kilesā, esa hetu saṃsārassa, evaṃ sabbe kilesā catūhi vipallāsehi niddisitabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "85"
      },
      ". Tattha imā catasso disā kabaḷīkāro āhāro ‘‘asubhe subha’’nti vipallāso, kāmupādānaṃ, kāmayogo, abhijjhākāyagantho, kāmāsavo, kāmogho, rāgasallo, rūpūpagā viññāṇaṭṭhiti, chandā agatigamananti paṭhamā disā."
    ],
    "innerText": "85. Tattha imā catasso disā kabaḷīkāro āhāro ‘‘asubhe subha’’nti vipallāso, kāmupādānaṃ, kāmayogo, abhijjhākāyagantho, kāmāsavo, kāmogho, rāgasallo, rūpūpagā viññāṇaṭṭhiti, chandā agatigamananti paṭhamā disā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Phasso āhāro, ‘‘dukkhe sukha’’nti vipallāso, bhavupādānaṃ, bhavayogo, byāpādakāyagantho, bhavāsavo, bhavogho, dosasallo, vedanūpagā viññāṇaṭṭhiti, dosā agatigamananti dutiyā disā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Viññāṇāhāro ‘‘anicce nicca’’nti vipallāso, diṭṭhupādānaṃ, diṭṭhiyogo parāmāsakāyagantho, diṭṭhāsavo, diṭṭhogho, mānasallo, saññūpagā viññāṇaṭṭhiti, bhayā agatigamananti tatiyā disā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Manosañcetanāhāro ‘‘anattani attā’’ti vipallāso, attavādupādānaṃ, avijjāyogo, idaṃsaccābhinivesakāyagantho, avijjāsavo, avijjogho, mohasallo, saṅkhārūpagā viññāṇaṭṭhiti, mohā agatigamananti catutthī disā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha yo ca kabaḷīkāro āhāro yo ca ‘‘asubhe subha’’nti vipallāso, kāmupādānaṃ, kāmayogo, abhijjhākāyagantho, kāmāsavo ",
      ", kāmogho, rāgasallo, rūpūpagā viññāṇaṭṭhiti chandā agatigamananti, imesaṃ dasannaṃ suttānaṃ eko attho, byañjanameva nānaṃ. Ime rāgacaritassa puggalassa upakkilesā."
    ],
    "innerText": "Tattha yo ca kabaḷīkāro āhāro yo ca ‘‘asubhe subha’’nti vipallāso, kāmupādānaṃ, kāmayogo, abhijjhākāyagantho, kāmāsavo , kāmogho, rāgasallo, rūpūpagā viññāṇaṭṭhiti chandā agatigamananti, imesaṃ dasannaṃ suttānaṃ eko attho, byañjanameva nānaṃ. Ime rāgacaritassa puggalassa upakkilesā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      " yo ca phasso āhāro yo ca ‘‘dukkhe sukha’’nti vipallāso, bhavupādānaṃ, bhavayogo ",
      ", byāpādakāyagantho, bhavāsavo, bhavogho, dosasallo, vedanūpagā viññāṇaṭṭhiti, dosā agatigamananti imesaṃ dasannaṃ suttānaṃ eko attho byañjanameva nānaṃ, ime dosacaritassa puggalassa upakkilesā."
    ],
    "innerText": "Tattha yo ca phasso āhāro yo ca ‘‘dukkhe sukha’’nti vipallāso, bhavupādānaṃ, bhavayogo , byāpādakāyagantho, bhavāsavo, bhavogho, dosasallo, vedanūpagā viññāṇaṭṭhiti, dosā agatigamananti imesaṃ dasannaṃ suttānaṃ eko attho byañjanameva nānaṃ, ime dosacaritassa puggalassa upakkilesā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha yo ca viññāṇāhāro yo ca ‘‘anicce nicca’’nti vipallāso, diṭṭhupādānaṃ, diṭṭhiyogo, parāmāsakāyagantho, diṭṭhāsavo, diṭṭhogho, mānasallo, saññūpagā viññāṇaṭṭhiti, bhayā agatigamananti imesaṃ dasannaṃ suttānaṃ eko attho, byañjanameva nānaṃ. Ime diṭṭhicaritassa mandassa upakkilesā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha yo ca manosañcetanāhāro yo ca ‘‘anattani attā’’ti vipallāso, attavādupādānaṃ, avijjāyogo, idaṃsaccābhinivesakāyagantho, avijjāsavo, avijjogho, mohasallo, saṅkhārūpagā viññāṇaṭṭhiti, mohā agatigamananti, imesaṃ dasannaṃ suttānaṃ eko attho, byañjanameva nānaṃ. Ime diṭṭhicaritassa udattassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[udatthassa (sī. ka.)]"
      },
      " upakkilesā."
    ],
    "innerText": "Tattha yo ca manosañcetanāhāro yo ca ‘‘anattani attā’’ti vipallāso, attavādupādānaṃ, avijjāyogo, idaṃsaccābhinivesakāyagantho, avijjāsavo, avijjogho, mohasallo, saṅkhārūpagā viññāṇaṭṭhiti, mohā agatigamananti, imesaṃ dasannaṃ suttānaṃ eko attho, byañjanameva nānaṃ. Ime diṭṭhicaritassa udattassa [udatthassa (sī. ka.)] upakkilesā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha yo ca kabaḷīkāro āhāro yo ca phasso āhāro, ime appaṇihitena vimokkhamukhena pariññaṃ gacchanti, viññāṇāhāro suññatāya, manosañcetanāhāro animittena, tattha yo ca ‘‘asubhe subha’’nti vipallāso, yo ca ‘‘dukkhe sukha’’nti vipallāso, ime appaṇihitena vimokkhamukhena pahānaṃ abbhatthaṃ gacchanti. ‘‘Anicce nicca’’nti vipallāso suññatāya, ‘‘anattani attā’’ti vipallāso animittena. Tattha kāmupādānañca bhavupādānañca appaṇihitena vimokkhamukhena pahānaṃ gacchanti. Diṭṭhupādānaṃ suññatāya, attavādupādānaṃ animittena. Tattha kāmayogo ca bhavayogo ca appaṇihitena vimokkhamukhena pahānaṃ gacchanti, diṭṭhiyogo suññatāya, avijjāyogo animittena. Tattha abhijjhākāyagantho ca byāpādakāyagantho ca appaṇihitena ",
      " vimokkhamukhena pahānaṃ gacchanti, parāmāsakāyagantho ",
      " suññatāya, idaṃsaccābhinivesakāyagantho animittena."
    ],
    "innerText": "Tattha yo ca kabaḷīkāro āhāro yo ca phasso āhāro, ime appaṇihitena vimokkhamukhena pariññaṃ gacchanti, viññāṇāhāro suññatāya, manosañcetanāhāro animittena, tattha yo ca ‘‘asubhe subha’’nti vipallāso, yo ca ‘‘dukkhe sukha’’nti vipallāso, ime appaṇihitena vimokkhamukhena pahānaṃ abbhatthaṃ gacchanti. ‘‘Anicce nicca’’nti vipallāso suññatāya, ‘‘anattani attā’’ti vipallāso animittena. Tattha kāmupādānañca bhavupādānañca appaṇihitena vimokkhamukhena pahānaṃ gacchanti. Diṭṭhupādānaṃ suññatāya, attavādupādānaṃ animittena. Tattha kāmayogo ca bhavayogo ca appaṇihitena vimokkhamukhena pahānaṃ gacchanti, diṭṭhiyogo suññatāya, avijjāyogo animittena. Tattha abhijjhākāyagantho ca byāpādakāyagantho ca appaṇihitena vimokkhamukhena pahānaṃ gacchanti, parāmāsakāyagantho suññatāya, idaṃsaccābhinivesakāyagantho animittena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha kāmāsavo ca bhavāsavo ca appaṇihitena vimokkhamukhena pahānaṃ gacchanti, diṭṭhāsavo suññatāya, avijjāsavo animittena. Tattha kāmogho ca bhavogho ca appaṇihitena vimokkhamukhena pahānaṃ gacchanti, diṭṭhogho suññatāya, avijjogho animittena. Tattha rāgasallo ca dosasallo ca appaṇihitena vimokkhamukhena pahānaṃ gacchanti, mānasallo suññatāya, mohasallo animittena. Tattha rūpūpagā ca viññāṇaṭṭhiti vedanūpagā ",
      " ca viññāṇaṭṭhiti appaṇihitena vimokkhamukhena pariññaṃ gacchanti, saññūpagā suññatāya, saṅkhārūpagā animittena."
    ],
    "innerText": "Tattha kāmāsavo ca bhavāsavo ca appaṇihitena vimokkhamukhena pahānaṃ gacchanti, diṭṭhāsavo suññatāya, avijjāsavo animittena. Tattha kāmogho ca bhavogho ca appaṇihitena vimokkhamukhena pahānaṃ gacchanti, diṭṭhogho suññatāya, avijjogho animittena. Tattha rāgasallo ca dosasallo ca appaṇihitena vimokkhamukhena pahānaṃ gacchanti, mānasallo suññatāya, mohasallo animittena. Tattha rūpūpagā ca viññāṇaṭṭhiti vedanūpagā ca viññāṇaṭṭhiti appaṇihitena vimokkhamukhena pariññaṃ gacchanti, saññūpagā suññatāya, saṅkhārūpagā animittena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha chandā ca agatigamanaṃ dosā ca agatigamanaṃ appaṇihitena vimokkhamukhena pahānaṃ gacchanti, bhayā agatigamanaṃ suññatāya, mohā agatigamanaṃ animittena vimokkhamukhena pahānaṃ gacchanti. Iti sabbe lokavaṭṭānusārino dhammā niyyanti. Te lokā tīhi vimokkhamukhehi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "86"
      },
      ". Tatridaṃ niyyānaṃ –"
    ],
    "innerText": "86. Tatridaṃ niyyānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Catasso paṭipadā, cattāro satipaṭṭhānā, cattāri jhānāni, cattāro vihārā, cattāro sammappadhānā, cattāro acchariyā abbhutā dhammā, cattāri adhiṭṭhānāni, catasso samādhibhāvanā, cattāro sukhabhāgiyā dhammā, catasso appamāṇā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Paṭhamā paṭipadā paṭhamaṃ satipaṭṭhānaṃ, dutiyā paṭipadā dutiyaṃ satipaṭṭhānaṃ, tatiyā paṭipadā tatiyaṃ satipaṭṭhānaṃ, catutthī paṭipadā catutthaṃ satipaṭṭhānaṃ. Paṭhamaṃ satipaṭṭhānaṃ paṭhamaṃ jhānaṃ, dutiyaṃ satipaṭṭhānaṃ dutiyaṃ jhānaṃ, tatiyaṃ satipaṭṭhānaṃ tatiyaṃ jhānaṃ. Catutthaṃ satipaṭṭhānaṃ catutthaṃ jhānaṃ. Paṭhamaṃ jhānaṃ paṭhamo vihāro, dutiyaṃ jhānaṃ dutiyo vihāro, tatiyaṃ jhānaṃ tatiyo vihāro, catutthaṃ jhānaṃ catuttho vihāro. Paṭhamo vihāro paṭhamaṃ sammappadhānaṃ, dutiyo vihāro dutiyaṃ sammappadhānaṃ, tatiyo vihāro tatiyaṃ sammappadhānaṃ, catuttho vihāro catutthaṃ ",
      " sammappadhānaṃ. Paṭhamaṃ sammappadhānaṃ paṭhamo acchariyo abbhuto dhammo, dutiyaṃ dutiyo, tatiyaṃ tatiyo, catutthaṃ sammappadhānaṃ catuttho acchariyo abbhuto dhammo. Paṭhamo acchariyo abbhuto dhammo paṭhamaṃ ",
      " adhiṭṭhānaṃ, dutiyo acchariyo abbhuto dhammo dutiyaṃ adhiṭṭhānaṃ, tatiyo acchariyo abbhuto dhammo tatiyaṃ adhiṭṭhānaṃ, catuttho acchariyo abbhuto dhammo catutthaṃ adhiṭṭhānaṃ. Paṭhamaṃ adhiṭṭhānaṃ paṭhamā samādhibhāvanā, dutiyaṃ adhiṭṭhānaṃ dutiyā samādhibhāvanā, tatiyaṃ adhiṭṭhānaṃ tatiyā samādhibhāvanā, catutthaṃ adhiṭṭhānaṃ catutthī samādhibhāvanā. Paṭhamā samādhibhāvanā paṭhamo sukhabhāgiyo dhammo, dutiyā samādhibhāvanā dutiyo sukhabhāgiyo dhammo, tatiyā samādhibhāvanā tatiyo sukhabhāgiyo dhammo, catutthī samādhibhāvanā catuttho sukhabhāgiyo dhammo. Paṭhamo sukhabhāgiyo dhammo paṭhamaṃ appamāṇaṃ, dutiyo sukhabhāgiyo dhammo dutiyaṃ appamāṇaṃ, tatiyo sukhabhāgiyo dhammo tatiyaṃ appamāṇaṃ, catuttho sukhabhāgiyo dhammo catutthaṃ ",
      " appamāṇaṃ. Paṭhamā paṭipadā bhāvitā bahulīkatā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[bahulikatā (ka.)]"
      },
      " paṭhamaṃ satipaṭṭhānaṃ paripūreti, dutiyā paṭipadā bhāvitā bahulīkatā dutiyaṃ satipaṭṭhānaṃ paripūreti, tatiyā paṭipadā bhāvitā bahulīkatā tatiyaṃ satipaṭṭhānaṃ paripūreti, catutthī paṭipadā bhāvitā bahulīkatā catutthaṃ satipaṭṭhānaṃ paripūreti. Paṭhamo satipaṭṭhāno bhāvito bahulīkato paṭhamaṃ jhānaṃ paripūreti, dutiyo satipaṭṭhāno bhāvito bahulīkato dutiyaṃ jhānaṃ paripūreti, tatiyo satipaṭṭhāno bhāvito bahulīkato tatiyaṃ jhānaṃ paripūreti, catuttho satipaṭṭhāno bhāvito bahulīkato catutthaṃ jhānaṃ paripūreti."
    ],
    "innerText": "Paṭhamā paṭipadā paṭhamaṃ satipaṭṭhānaṃ, dutiyā paṭipadā dutiyaṃ satipaṭṭhānaṃ, tatiyā paṭipadā tatiyaṃ satipaṭṭhānaṃ, catutthī paṭipadā catutthaṃ satipaṭṭhānaṃ. Paṭhamaṃ satipaṭṭhānaṃ paṭhamaṃ jhānaṃ, dutiyaṃ satipaṭṭhānaṃ dutiyaṃ jhānaṃ, tatiyaṃ satipaṭṭhānaṃ tatiyaṃ jhānaṃ. Catutthaṃ satipaṭṭhānaṃ catutthaṃ jhānaṃ. Paṭhamaṃ jhānaṃ paṭhamo vihāro, dutiyaṃ jhānaṃ dutiyo vihāro, tatiyaṃ jhānaṃ tatiyo vihāro, catutthaṃ jhānaṃ catuttho vihāro. Paṭhamo vihāro paṭhamaṃ sammappadhānaṃ, dutiyo vihāro dutiyaṃ sammappadhānaṃ, tatiyo vihāro tatiyaṃ sammappadhānaṃ, catuttho vihāro catutthaṃ sammappadhānaṃ. Paṭhamaṃ sammappadhānaṃ paṭhamo acchariyo abbhuto dhammo, dutiyaṃ dutiyo, tatiyaṃ tatiyo, catutthaṃ sammappadhānaṃ catuttho acchariyo abbhuto dhammo. Paṭhamo acchariyo abbhuto dhammo paṭhamaṃ adhiṭṭhānaṃ, dutiyo acchariyo abbhuto dhammo dutiyaṃ adhiṭṭhānaṃ, tatiyo acchariyo abbhuto dhammo tatiyaṃ adhiṭṭhānaṃ, catuttho acchariyo abbhuto dhammo catutthaṃ adhiṭṭhānaṃ. Paṭhamaṃ adhiṭṭhānaṃ paṭhamā samādhibhāvanā, dutiyaṃ adhiṭṭhānaṃ dutiyā samādhibhāvanā, tatiyaṃ adhiṭṭhānaṃ tatiyā samādhibhāvanā, catutthaṃ adhiṭṭhānaṃ catutthī samādhibhāvanā. Paṭhamā samādhibhāvanā paṭhamo sukhabhāgiyo dhammo, dutiyā samādhibhāvanā dutiyo sukhabhāgiyo dhammo, tatiyā samādhibhāvanā tatiyo sukhabhāgiyo dhammo, catutthī samādhibhāvanā catuttho sukhabhāgiyo dhammo. Paṭhamo sukhabhāgiyo dhammo paṭhamaṃ appamāṇaṃ, dutiyo sukhabhāgiyo dhammo dutiyaṃ appamāṇaṃ, tatiyo sukhabhāgiyo dhammo tatiyaṃ appamāṇaṃ, catuttho sukhabhāgiyo dhammo catutthaṃ appamāṇaṃ. Paṭhamā paṭipadā bhāvitā bahulīkatā [bahulikatā (ka.)] paṭhamaṃ satipaṭṭhānaṃ paripūreti, dutiyā paṭipadā bhāvitā bahulīkatā dutiyaṃ satipaṭṭhānaṃ paripūreti, tatiyā paṭipadā bhāvitā bahulīkatā tatiyaṃ satipaṭṭhānaṃ paripūreti, catutthī paṭipadā bhāvitā bahulīkatā catutthaṃ satipaṭṭhānaṃ paripūreti. Paṭhamo satipaṭṭhāno bhāvito bahulīkato paṭhamaṃ jhānaṃ paripūreti, dutiyo satipaṭṭhāno bhāvito bahulīkato dutiyaṃ jhānaṃ paripūreti, tatiyo satipaṭṭhāno bhāvito bahulīkato tatiyaṃ jhānaṃ paripūreti, catuttho satipaṭṭhāno bhāvito bahulīkato catutthaṃ jhānaṃ paripūreti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Paṭhamaṃ jhānaṃ bhāvitaṃ bahulīkataṃ paṭhamaṃ vihāraṃ paripūreti, dutiyaṃ jhānaṃ bhāvitaṃ bahulīkataṃ dutiyaṃ vihāraṃ paripūreti, tatiyaṃ jhānaṃ bhāvitaṃ bahulīkataṃ tatiyaṃ vihāraṃ paripūreti, catutthaṃ jhānaṃ bhāvitaṃ bahulīkataṃ ",
      " catutthaṃ vihāraṃ paripūreti. Paṭhamo vihāro bhāvito bahulīkato anuppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ anuppādaṃ paripūreti, dutiyo vihāro bhāvito bahulīkato uppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ pahānaṃ paripūreti, tatiyo vihāro bhāvito bahulīkato anuppannānaṃ kusalānaṃ dhammānaṃ uppādaṃ paripūreti, catuttho vihāro bhāvito bahulīkato uppannānaṃ kusalānaṃ dhammānaṃ ṭhitiṃ asammosaṃ bhiyyobhāvaṃ paripūreti. Paṭhamaṃ sammappadhānaṃ bhāvitaṃ bahulīkataṃ mānappahānaṃ ",
      " paripūreti, dutiyaṃ sammappadhānaṃ bhāvitaṃ bahulīkataṃ ālayasamugghātaṃ paripūreti, tatiyaṃ sammappadhānaṃ bhāvitaṃ bahulīkataṃ avijjāpahānaṃ paripūreti, catutthaṃ sammappadhānaṃ bhāvitaṃ bahulīkataṃ bhavūpasamaṃ paripūreti. Mānappahānaṃ bhāvitaṃ bahulīkataṃ saccādhiṭṭhānaṃ paripūreti, ālayasamugghāto bhāvito bahulīkato cāgādhiṭṭhānaṃ paripūreti, avijjāpahānaṃ bhāvitaṃ bahulīkataṃ paññādhiṭṭhānaṃ paripūreti, bhavūpasamo bhāvito bahulīkato upasamādhiṭṭhānaṃ paripūreti. Saccādhiṭṭhānaṃ bhāvitaṃ bahulīkataṃ chandasamādhiṃ paripūreti, cāgādhiṭṭhānaṃ bhāvitaṃ bahulīkataṃ vīriyasamādhiṃ paripūreti, paññādhiṭṭhānaṃ bhāvitaṃ bahulīkataṃ cittasamādhiṃ paripūreti, upasamādhiṭṭhānaṃ bhāvitaṃ bahulīkataṃ vīmaṃsāsamādhiṃ paripūreti. Chandasamādhi bhāvito bahulīkato indriyasaṃvaraṃ paripūreti, vīriyasamādhi bhāvito bahulīkato tapaṃ paripūreti, cittasamādhi bhāvito bahulīkato buddhiṃ paripūreti, vīmaṃsāsamādhi bhāvito bahulīkato sabbūpadhipaṭinissaggaṃ paripūreti. Indriyasaṃvaro bhāvito bahulīkato mettaṃ paripūreti, tapo bhāvito bahulīkato karuṇaṃ paripūreti, buddhi bhāvitā bahulīkatā muditaṃ paripūreti, sabbūpadhipaṭinissaggo bhāvito bahulīkato upekkhaṃ paripūreti."
    ],
    "innerText": "Paṭhamaṃ jhānaṃ bhāvitaṃ bahulīkataṃ paṭhamaṃ vihāraṃ paripūreti, dutiyaṃ jhānaṃ bhāvitaṃ bahulīkataṃ dutiyaṃ vihāraṃ paripūreti, tatiyaṃ jhānaṃ bhāvitaṃ bahulīkataṃ tatiyaṃ vihāraṃ paripūreti, catutthaṃ jhānaṃ bhāvitaṃ bahulīkataṃ catutthaṃ vihāraṃ paripūreti. Paṭhamo vihāro bhāvito bahulīkato anuppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ anuppādaṃ paripūreti, dutiyo vihāro bhāvito bahulīkato uppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ pahānaṃ paripūreti, tatiyo vihāro bhāvito bahulīkato anuppannānaṃ kusalānaṃ dhammānaṃ uppādaṃ paripūreti, catuttho vihāro bhāvito bahulīkato uppannānaṃ kusalānaṃ dhammānaṃ ṭhitiṃ asammosaṃ bhiyyobhāvaṃ paripūreti. Paṭhamaṃ sammappadhānaṃ bhāvitaṃ bahulīkataṃ mānappahānaṃ paripūreti, dutiyaṃ sammappadhānaṃ bhāvitaṃ bahulīkataṃ ālayasamugghātaṃ paripūreti, tatiyaṃ sammappadhānaṃ bhāvitaṃ bahulīkataṃ avijjāpahānaṃ paripūreti, catutthaṃ sammappadhānaṃ bhāvitaṃ bahulīkataṃ bhavūpasamaṃ paripūreti. Mānappahānaṃ bhāvitaṃ bahulīkataṃ saccādhiṭṭhānaṃ paripūreti, ālayasamugghāto bhāvito bahulīkato cāgādhiṭṭhānaṃ paripūreti, avijjāpahānaṃ bhāvitaṃ bahulīkataṃ paññādhiṭṭhānaṃ paripūreti, bhavūpasamo bhāvito bahulīkato upasamādhiṭṭhānaṃ paripūreti. Saccādhiṭṭhānaṃ bhāvitaṃ bahulīkataṃ chandasamādhiṃ paripūreti, cāgādhiṭṭhānaṃ bhāvitaṃ bahulīkataṃ vīriyasamādhiṃ paripūreti, paññādhiṭṭhānaṃ bhāvitaṃ bahulīkataṃ cittasamādhiṃ paripūreti, upasamādhiṭṭhānaṃ bhāvitaṃ bahulīkataṃ vīmaṃsāsamādhiṃ paripūreti. Chandasamādhi bhāvito bahulīkato indriyasaṃvaraṃ paripūreti, vīriyasamādhi bhāvito bahulīkato tapaṃ paripūreti, cittasamādhi bhāvito bahulīkato buddhiṃ paripūreti, vīmaṃsāsamādhi bhāvito bahulīkato sabbūpadhipaṭinissaggaṃ paripūreti. Indriyasaṃvaro bhāvito bahulīkato mettaṃ paripūreti, tapo bhāvito bahulīkato karuṇaṃ paripūreti, buddhi bhāvitā bahulīkatā muditaṃ paripūreti, sabbūpadhipaṭinissaggo bhāvito bahulīkato upekkhaṃ paripūreti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "87"
      },
      ". Tattha imā catasso disā paṭhamā paṭipadā paṭhamo satipaṭṭhāno paṭhamaṃ jhānaṃ paṭhamo ",
      " vihāro paṭhamo sammappadhāno paṭhamo acchariyo abbhuto dhammo saccādhiṭṭhānaṃ chandasamādhi indriyasaṃvaro mettā iti paṭhamā ",
      " disā."
    ],
    "innerText": "87. Tattha imā catasso disā paṭhamā paṭipadā paṭhamo satipaṭṭhāno paṭhamaṃ jhānaṃ paṭhamo vihāro paṭhamo sammappadhāno paṭhamo acchariyo abbhuto dhammo saccādhiṭṭhānaṃ chandasamādhi indriyasaṃvaro mettā iti paṭhamā disā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dutiyā paṭipadā dutiyo satipaṭṭhāno dutiyo vihāro dutiyo sammappadhāno dutiyo acchariyo abbhuto dhammo bhavādhiṭṭhānaṃ vīriyasamādhi tapo karuṇā iti dutiyā disā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tatiyā paṭipadā tatiyo satipaṭṭhāno tatiyaṃ jhānaṃ tatiyo vihāro tatiyo sammappadhāno tatiyo acchariyo abbhuto dhammo paññādhiṭṭhānaṃ cittasamādhi buddhi muditā iti tatiyā disā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Catutthī paṭipadā catuttho satipaṭṭhāno catutthaṃ jhānaṃ catuttho vihāro catuttho sammappadhāno catuttho acchariyo abbhuto dhammo upasamādhiṭṭhānaṃ vīmaṃsāsamādhi sabbūpadhipaṭinissaggo upekkhā iti catutthī disā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      " paṭhamā paṭipadā paṭhamo satipaṭṭhāno paṭhamaṃ jhānaṃ paṭhamo vihāro paṭhamo sammappadhāno paṭhamo acchariyo abbhuto dhammo saccādhiṭṭhānaṃ chandasamādhi indriyasaṃvaro, mettā iti imesaṃ dasannaṃ suttānaṃ eko attho, byañjanameva nānaṃ. Idaṃ rāgacaritassa puggalassa bhesajjaṃ."
    ],
    "innerText": "Tattha paṭhamā paṭipadā paṭhamo satipaṭṭhāno paṭhamaṃ jhānaṃ paṭhamo vihāro paṭhamo sammappadhāno paṭhamo acchariyo abbhuto dhammo saccādhiṭṭhānaṃ chandasamādhi indriyasaṃvaro, mettā iti imesaṃ dasannaṃ suttānaṃ eko attho, byañjanameva nānaṃ. Idaṃ rāgacaritassa puggalassa bhesajjaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dutiyā paṭipadā dutiyo satipaṭṭhāno dutiyaṃ jhānaṃ dutiyo vihāro dutiyo sammappadhāno dutiyo acchariyo abbhuto dhammo cāgādhiṭṭhānaṃ vīriyasamādhi tapo karuṇā iti imesaṃ dasannaṃ suttānaṃ eko attho, byañjanameva nānaṃ. Idaṃ dosacaritassa puggalassa bhesajjaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tatiyā paṭipadā tatiyo satipaṭṭhāno tatiyaṃ jhānaṃ tatiyo vihāro tatiyo sammappadhāno tatiyo acchariyo abbhuto dhammo paññādhiṭṭhānaṃ cittasamādhi buddhi muditā iti imesaṃ dasannaṃ suttānaṃ eko attho, byañjanameva nānaṃ. Idaṃ diṭṭhicaritassa mandassa bhesajjaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Catutthī paṭipadā catuttho satipaṭṭhāno catutthaṃ jhānaṃ catuttho vihāro catuttho sammappadhāno catuttho acchariyo abbhuto dhammo upasamādhiṭṭhānaṃ vīmaṃsāsamādhi sabbūpadhipaṭinissaggo upekkhā ",
      " iti imesaṃ dasannaṃ suttānaṃ eko attho, byañjanameva nānaṃ. Idaṃ ",
      " diṭṭhicaritassa udattassa bhesajjaṃ."
    ],
    "innerText": "Catutthī paṭipadā catuttho satipaṭṭhāno catutthaṃ jhānaṃ catuttho vihāro catuttho sammappadhāno catuttho acchariyo abbhuto dhammo upasamādhiṭṭhānaṃ vīmaṃsāsamādhi sabbūpadhipaṭinissaggo upekkhā iti imesaṃ dasannaṃ suttānaṃ eko attho, byañjanameva nānaṃ. Idaṃ diṭṭhicaritassa udattassa bhesajjaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha dukkhā ca paṭipadā dandhābhiññā dukkhā ca paṭipadā khippābhiññā appaṇihitaṃ vimokkhamukhaṃ, sukhā paṭipadā dandhābhiññā suññataṃ vimokkhamukhaṃ, sukhā paṭipadā khippābhiññā animittaṃ vimokkhamukhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha kāye kāyānupassitā satipaṭṭhānañca vedanāsu vedanānupassitā satipaṭṭhānañca appaṇihitaṃ vimokkhamukhaṃ, citte cittānupassitā suññataṃ vimokkhamukhaṃ. Dhammesu dhammānupassitā animittaṃ vimokkhamukhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha paṭhamañca jhānaṃ dutiyañca jhānaṃ appaṇihitaṃ vimokkhamukhaṃ, tatiyaṃ jhānaṃ suññataṃ vimokkhamukhaṃ, catutthaṃ jhānaṃ animittaṃ vimokkhamukhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha paṭhamo ca vihāro dutiyo ca vihāro appaṇihitaṃ vimokkhamukhaṃ, tatiyo vihāro suññataṃ vimokkhamukhaṃ, catuttho vihāro animittaṃ vimokkhamukhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yattha ",
      " paṭhamañca sammappadhānaṃ dutiyañca sammappadhānaṃ appaṇihitaṃ vimokkhamukhaṃ, tatiyaṃ sammappadhānaṃ suññataṃ vimokkhamukhaṃ, catutthaṃ sammappadhānaṃ animittaṃ vimokkhamukhaṃ."
    ],
    "innerText": "Yattha paṭhamañca sammappadhānaṃ dutiyañca sammappadhānaṃ appaṇihitaṃ vimokkhamukhaṃ, tatiyaṃ sammappadhānaṃ suññataṃ vimokkhamukhaṃ, catutthaṃ sammappadhānaṃ animittaṃ vimokkhamukhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha mānappahānañca ālayasamugghāto ca appaṇihitaṃ vimokkhamukhaṃ, avijjāpahānaṃ suññataṃ vimokkhamukhaṃ, bhavūpasamo animittaṃ vimokkhamukhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha saccādhiṭṭhānañca cāgādhiṭṭhānañca appaṇihitaṃ vimokkhamukhaṃ, paññādhiṭṭhānaṃ suññataṃ vimokkhamukhaṃ, upasamādhiṭṭhānaṃ animittaṃ vimokkhamukhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha chandasamādhi ca vīriyasamādhi ca appaṇihitaṃ vimokkhamukhaṃ, cittasamādhi suññataṃ vimokkhamukhaṃ, vīmaṃsāsamādhi animittaṃ vimokkhamukhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      " indriyasaṃvaro ca tapo ca appaṇihitaṃ vimokkhamukhaṃ, buddhi suññataṃ vimokkhamukhaṃ sabbūpadhipaṭinissaggo animittaṃ vimokkhamukhaṃ."
    ],
    "innerText": "Tattha indriyasaṃvaro ca tapo ca appaṇihitaṃ vimokkhamukhaṃ, buddhi suññataṃ vimokkhamukhaṃ sabbūpadhipaṭinissaggo animittaṃ vimokkhamukhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      " mettā ca karuṇā ca appaṇihitaṃ vimokkhamukhaṃ, muditā suññataṃ vimokkhamukhaṃ upekkhā animittaṃ vimokkhamukhaṃ."
    ],
    "innerText": "Tattha mettā ca karuṇā ca appaṇihitaṃ vimokkhamukhaṃ, muditā suññataṃ vimokkhamukhaṃ upekkhā animittaṃ vimokkhamukhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tesaṃ vikkīḷitaṃ. Cattāro āhārā tesaṃ paṭipakkho catasso paṭipadā…pe… cattāro vipallāsā tesaṃ paṭipakkho cattāro satipaṭṭhānā. Cattāri upādānāni tesaṃ paṭipakkho cattāri jhānāni. Cattāro yogā tesaṃ paṭipakkho cattāro vihārā. Cattāro ganthā tesaṃ paṭipakkho cattāro sammappadhānā. Cattāro āsavā tesaṃ paṭipakkho cattāro acchariyā abbhutā dhammā. Cattāro oghā tesaṃ paṭipakkho cattāri adhiṭṭhānāni. Cattāro sallā tesaṃ paṭipakkho catasso samādhibhāvanā. Catasso viññāṇaṭṭhitiyo tāsaṃ paṭipakkho cattāro sukhabhāgiyā dhammā. Cattāri agatigamanāni tesaṃ paṭipakkho catasso appamāṇā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sīhā buddhā paccekabuddhā sāvakā ca hatarāgadosamohā, tesaṃ vikkīḷitaṃ bhāvanā sacchikiriyā byantīkiriyā ca. Vikkīḷitaṃ indriyādhiṭṭhānaṃ vikkīḷitaṃ vipariyāsānadhiṭṭhānañca. Indriyāni saddhammagocaro vipariyāsā kilesagocaro. Ayaṃ vuccati sīhavikkīḷitassa ca nayassa disālocanassa ca nayassa bhūmīti. Tenāha ‘‘yo neti vipallāsehi saṃkilese’’ti. Veyyākaraṇesu hi ye ‘‘kusalākusalā’’ti ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      " ye dukkhāya paṭipadāya dandhābhiññāya khippābhiññāya ca niyyanti, ime dve ",
      " puggalā; ye sukhāya paṭipadāya dandhābhiññāya khippābhiññāya ca niyyanti, ime dve puggalā. Tesaṃ catunnaṃ puggalānaṃ ayaṃ saṃkileso, cattāro āhārā, cattāro vipallāsā, cattāri upādānāni, cattāro yogā, cattāro ganthā, cattāro āsavā, cattāro oghā, cattāro sallā, catasso viññāṇaṭṭhitiyo, cattāri agatigamanānīti. Tesaṃ ",
      " catunnaṃ puggalānaṃ idaṃ vodānaṃ, catasso paṭipadā, cattāro satipaṭṭhānā, cattāri jhānāni, cattāro vihārā, cattāro sammappadhānā, cattāro acchariyā abbhutā dhammā, cattāri adhiṭṭhānāni, catasso samādhibhāvanā, cattāro sukhabhāgiyā dhammā, catasso appamāṇā iti."
    ],
    "innerText": "Tattha ye dukkhāya paṭipadāya dandhābhiññāya khippābhiññāya ca niyyanti, ime dve puggalā; ye sukhāya paṭipadāya dandhābhiññāya khippābhiññāya ca niyyanti, ime dve puggalā. Tesaṃ catunnaṃ puggalānaṃ ayaṃ saṃkileso, cattāro āhārā, cattāro vipallāsā, cattāri upādānāni, cattāro yogā, cattāro ganthā, cattāro āsavā, cattāro oghā, cattāro sallā, catasso viññāṇaṭṭhitiyo, cattāri agatigamanānīti. Tesaṃ catunnaṃ puggalānaṃ idaṃ vodānaṃ, catasso paṭipadā, cattāro satipaṭṭhānā, cattāri jhānāni, cattāro vihārā, cattāro sammappadhānā, cattāro acchariyā abbhutā dhammā, cattāri adhiṭṭhānāni, catasso samādhibhāvanā, cattāro sukhabhāgiyā dhammā, catasso appamāṇā iti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "88"
      },
      ". Tattha ye dukkhāya paṭipadāya dandhābhiññāya khippābhiññāya ca niyyanti ime dve puggalā. Ye sukhāya paṭipadāya dandhābhiññāya khippābhiññāya ca niyyanti, ime dve puggalā. Tattha yo sukhāya paṭipadāya khippābhiññāya niyyāti, ayaṃ ugghaṭitaññū. Yo sādhāraṇāya, ayaṃ vipañcitaññū. Yo dukkhāya paṭipadāya dandhābhiññāya niyyāti, ayaṃ neyyo."
    ],
    "innerText": "88. Tattha ye dukkhāya paṭipadāya dandhābhiññāya khippābhiññāya ca niyyanti ime dve puggalā. Ye sukhāya paṭipadāya dandhābhiññāya khippābhiññāya ca niyyanti, ime dve puggalā. Tattha yo sukhāya paṭipadāya khippābhiññāya niyyāti, ayaṃ ugghaṭitaññū. Yo sādhāraṇāya, ayaṃ vipañcitaññū. Yo dukkhāya paṭipadāya dandhābhiññāya niyyāti, ayaṃ neyyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha bhagavā ugghaṭitaññussa puggalassa samathaṃ upadisati, neyyassa vipassanaṃ, samathavipassanaṃ vipañcitaññussa. Tattha bhagavā ugghaṭitaññussa puggalassa mudukaṃ dhammadesanaṃ upadisati, tikkhaṃ neyyassa, mudutikkhaṃ vipañcitaññussa, tattha bhagavā ugghaṭitaññussa puggalassa saṃkhittena dhammaṃ desayati, saṃkhittavitthārena vipañcitaññussa, vitthārena neyyassa. Tattha bhagavā ugghaṭitaññussa puggalassa nissaraṇaṃ upadisati, vipañcitaññussa ādīnavañca nissaraṇañca upadisati, neyyassa assādañca ādīnavañca nissaraṇañca upadisati. Tattha bhagavā ugghaṭitaññussa adhipaññāsikkhaṃ paññāpayati, adhicittaṃ vipañcitaññussa, adhisīlaṃ neyyassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha ye dukkhāya paṭipadāya dandhābhiññāya khippābhiññāya ca niyyanti, ime dve puggalā. Ye sukhāya paṭipadāya dandhābhiññāya khippābhiññāya ca niyyanti. Ime dve puggalā. Iti kho cattāri hutvā tīṇi bhavanti ugghaṭitaññū vipañcitaññū neyyoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tesaṃ tiṇṇaṃ puggalānaṃ ayaṃ saṃkileso, tīṇi akusalamūlāni lobho akusalamūlaṃ doso akusalamūlaṃ moho akusalamūlaṃ ",
      ", tīṇi ",
      " duccaritāni – kāyaduccaritaṃ vacīduccaritaṃ manoduccaritaṃ; tayo akusalavitakkā – kāmavitakko byāpādavitakko vihiṃsāvitakko; tisso akusalasaññā – kāmasaññā byāpādasaññā vihiṃsāsaññā; tisso viparītasaññā – niccasaññā sukhasaññā attasaññā; tisso vedanā – sukhā vedanā dukkhā vedanā adukkhamasukhā vedanā; tisso dukkhatā – dukkhadukkhatā saṅkhāradukkhatā vipariṇāmadukkhatā; tayo aggī – rāgaggi dosaggi mohaggi; tayo sallā – rāgasallo dosasallo mohasallo; tisso jaṭā – rāgajaṭā dosajaṭā mohajaṭā; tisso akusalūpaparikkhā – akusalaṃ kāyakammaṃ akusalaṃ vacīkammaṃ akusalaṃ manokammaṃ. Tisso vipattiyo – sīlavipatti diṭṭhivipatti ācāravipattīti. Tesaṃ tiṇṇaṃ puggalānaṃ idaṃ vodānaṃ. Tīṇi kusalamūlāni – alobho kusalamūlaṃ adoso kusalamūlaṃ amoho kusalamūlaṃ. Tīṇi sucaritāni – kāyasucaritaṃ vacīsucaritaṃ manosucaritaṃ. Tayo kusalavitakkā – nekkhammavitakko abyāpādavitakko ",
      " avihiṃsāvitakko. Tayo samādhī – savitakko savicāro samādhi avitakko vicāramatto samādhi avitakko avicāro samādhi. Tisso kusalasaññā – nekkhammasaññā abyāpādasaññā avihiṃsāsaññā. Tisso aviparītasaññā – aniccasaññā dukkhasaññā anattasaññā. Tisso kusalūpaparikkhā – kusalaṃ kāyakammaṃ kusalaṃ vacīkammaṃ kusalaṃ manokammaṃ. Tīṇi soceyyāni – kāyasoceyyaṃ vacīsoceyyaṃ manosoceyyaṃ; tisso sampattiyo – sīlasampatti samādhisampatti paññāsampatti. Tisso sikkhā – adhisīlasikkhā adhicittasikkhā adhipaññāsikkhā; tayo khandhā – sīlakkhandho samādhikkhandho paññākkhandho. Tīṇi vimokkhamukhāni – suññataṃ animittaṃ appaṇihitanti."
    ],
    "innerText": "Tesaṃ tiṇṇaṃ puggalānaṃ ayaṃ saṃkileso, tīṇi akusalamūlāni lobho akusalamūlaṃ doso akusalamūlaṃ moho akusalamūlaṃ , tīṇi duccaritāni – kāyaduccaritaṃ vacīduccaritaṃ manoduccaritaṃ; tayo akusalavitakkā – kāmavitakko byāpādavitakko vihiṃsāvitakko; tisso akusalasaññā – kāmasaññā byāpādasaññā vihiṃsāsaññā; tisso viparītasaññā – niccasaññā sukhasaññā attasaññā; tisso vedanā – sukhā vedanā dukkhā vedanā adukkhamasukhā vedanā; tisso dukkhatā – dukkhadukkhatā saṅkhāradukkhatā vipariṇāmadukkhatā; tayo aggī – rāgaggi dosaggi mohaggi; tayo sallā – rāgasallo dosasallo mohasallo; tisso jaṭā – rāgajaṭā dosajaṭā mohajaṭā; tisso akusalūpaparikkhā – akusalaṃ kāyakammaṃ akusalaṃ vacīkammaṃ akusalaṃ manokammaṃ. Tisso vipattiyo – sīlavipatti diṭṭhivipatti ācāravipattīti. Tesaṃ tiṇṇaṃ puggalānaṃ idaṃ vodānaṃ. Tīṇi kusalamūlāni – alobho kusalamūlaṃ adoso kusalamūlaṃ amoho kusalamūlaṃ. Tīṇi sucaritāni – kāyasucaritaṃ vacīsucaritaṃ manosucaritaṃ. Tayo kusalavitakkā – nekkhammavitakko abyāpādavitakko avihiṃsāvitakko. Tayo samādhī – savitakko savicāro samādhi avitakko vicāramatto samādhi avitakko avicāro samādhi. Tisso kusalasaññā – nekkhammasaññā abyāpādasaññā avihiṃsāsaññā. Tisso aviparītasaññā – aniccasaññā dukkhasaññā anattasaññā. Tisso kusalūpaparikkhā – kusalaṃ kāyakammaṃ kusalaṃ vacīkammaṃ kusalaṃ manokammaṃ. Tīṇi soceyyāni – kāyasoceyyaṃ vacīsoceyyaṃ manosoceyyaṃ; tisso sampattiyo – sīlasampatti samādhisampatti paññāsampatti. Tisso sikkhā – adhisīlasikkhā adhicittasikkhā adhipaññāsikkhā; tayo khandhā – sīlakkhandho samādhikkhandho paññākkhandho. Tīṇi vimokkhamukhāni – suññataṃ animittaṃ appaṇihitanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Iti kho cattāri hutvā tīṇi bhavanti, tīṇi hutvā dve bhavanti taṇhācarito ca diṭṭhicarito ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tesaṃ dvinnaṃ puggalānaṃ ayaṃ saṃkileso, taṇhā ca avijjā ca ahirikañca anottappañca assati ca asampajaññañca ",
      " ayoniso manasikāro ca kosajjañca dovacassañca ahaṃkāro ca mamaṃkāro ca assaddhā ca pamādo ca asaddhammassavanañca asaṃvaro ca abhijjhā ca byāpādo ca nīvaraṇañca saṃyojanañca kodho ca upanāho ca makkho ca palāso ca issā ca maccherañca māyā ca sāṭheyyañca sassatadiṭṭhi ca ucchedadiṭṭhicāti."
    ],
    "innerText": "Tesaṃ dvinnaṃ puggalānaṃ ayaṃ saṃkileso, taṇhā ca avijjā ca ahirikañca anottappañca assati ca asampajaññañca ayoniso manasikāro ca kosajjañca dovacassañca ahaṃkāro ca mamaṃkāro ca assaddhā ca pamādo ca asaddhammassavanañca asaṃvaro ca abhijjhā ca byāpādo ca nīvaraṇañca saṃyojanañca kodho ca upanāho ca makkho ca palāso ca issā ca maccherañca māyā ca sāṭheyyañca sassatadiṭṭhi ca ucchedadiṭṭhicāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tesaṃ ",
      " dvinnaṃ puggalānaṃ idaṃ vodānaṃ, samatho ca vipassanā ca hirī ca ottappañca sati ca sampajaññañca yoniso manasikāro ca vīriyārambho ca sovacassañca dhamme ñāṇañca anvaye ñāṇañca khaye ñāṇañca anuppāde ñāṇañca saddhā ca appamādo ca saddhammassavanañca saṃvaro ca anabhijjhā ca abyāpādo ca rāgavirāgā ca cetovimutti avijjāvirāgā ca paññāvimutti abhisamayo ca appicchatā ca santuṭṭhi ca akkodho ca anupanāho ca amakkho ca apalāso ca issāpahānañca macchariyappahānañca vijjā ca vimutti ca saṅkhatārammaṇo ca vimokkho asaṅkhatārammaṇo ca vimokkho saupādisesā ca nibbānadhātu anupādisesā ca nibbānadhātūti."
    ],
    "innerText": "Tesaṃ dvinnaṃ puggalānaṃ idaṃ vodānaṃ, samatho ca vipassanā ca hirī ca ottappañca sati ca sampajaññañca yoniso manasikāro ca vīriyārambho ca sovacassañca dhamme ñāṇañca anvaye ñāṇañca khaye ñāṇañca anuppāde ñāṇañca saddhā ca appamādo ca saddhammassavanañca saṃvaro ca anabhijjhā ca abyāpādo ca rāgavirāgā ca cetovimutti avijjāvirāgā ca paññāvimutti abhisamayo ca appicchatā ca santuṭṭhi ca akkodho ca anupanāho ca amakkho ca apalāso ca issāpahānañca macchariyappahānañca vijjā ca vimutti ca saṅkhatārammaṇo ca vimokkho asaṅkhatārammaṇo ca vimokkho saupādisesā ca nibbānadhātu anupādisesā ca nibbānadhātūti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ayaṃ vuccati tipukkhalassa ca nayassa aṅkusassa ca nayassa bhūmīti. Tenāha ‘‘yo akusale samūlehi netī’’ti ‘‘oloketvā disalocanenā’’ti ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Niyuttaṃ nayasamuṭṭhānaṃ."
  }
]