[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "11. Bhikkhadāyivaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Bhikkhādāyakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suvaṇṇavaṇṇaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sambuddha"
      },
      "ntiādikaṃ āyasmato bhikkhādāyakattherassa apadānaṃ. Ayampi purimajinavaresu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto siddhatthassa bhagavato kāle ekasmiṃ kulagehe nibbatto vuddhimanvāya vibhavasampanno saddhājāto vihārato nikkhamitvā piṇḍāya caramānaṃ siddhatthaṃ bhagavantaṃ disvā pasannamānaso āhāramadāsi. Bhagavā taṃ paṭiggahetvā anumodanaṃ vatvā ",
      " pakkāmi. So teneva kusalena yāvatāyukaṃ ṭhatvā āyupariyosāne devaloke nibbatto tattha cha kāmāvacarasampattiyo anubhavitvā manussesu ca manussasampattimanubhavitvā imasmiṃ buddhuppāde kulagehe nibbatto vuddhimanvāya saddhājāto pabbajitvā nacirasseva arahā ahosi."
    ],
    "innerText": "Suvaṇṇavaṇṇaṃsambuddhantiādikaṃ āyasmato bhikkhādāyakattherassa apadānaṃ. Ayampi purimajinavaresu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto siddhatthassa bhagavato kāle ekasmiṃ kulagehe nibbatto vuddhimanvāya vibhavasampanno saddhājāto vihārato nikkhamitvā piṇḍāya caramānaṃ siddhatthaṃ bhagavantaṃ disvā pasannamānaso āhāramadāsi. Bhagavā taṃ paṭiggahetvā anumodanaṃ vatvā pakkāmi. So teneva kusalena yāvatāyukaṃ ṭhatvā āyupariyosāne devaloke nibbatto tattha cha kāmāvacarasampattiyo anubhavitvā manussesu ca manussasampattimanubhavitvā imasmiṃ buddhuppāde kulagehe nibbatto vuddhimanvāya saddhājāto pabbajitvā nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      ". So aparabhāge attano pubbakammaṃ anussaritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "suvaṇṇavaṇṇaṃ sambuddha"
      },
      "ntiādimāha. Taṃ sabbaṃ heṭṭhā vuttanayameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pavarā abhinikkhanta"
      },
      "nti pakārena varitabbaṃ patthetabbanti pavaraṃ, rammabhūtato vivekabhūtato sakavihārato abhi visesena nikkhantanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vānā nibbānamāgata"
      },
      "nti vānaṃ vuccati taṇhā, tato nikkhantattā nibbānaṃ, vānanāmaṃ taṇhaṃ padhānaṃ katvā sabbakilese pahāya nibbānaṃ pattanti attho."
    ],
    "innerText": "1. So aparabhāge attano pubbakammaṃ anussaritvā somanassajāto pubbacaritāpadānaṃ pakāsento suvaṇṇavaṇṇaṃ sambuddhantiādimāha. Taṃ sabbaṃ heṭṭhā vuttanayameva. Pavarā abhinikkhantanti pakārena varitabbaṃ patthetabbanti pavaraṃ, rammabhūtato vivekabhūtato sakavihārato abhi visesena nikkhantanti attho. Vānā nibbānamāgatanti vānaṃ vuccati taṇhā, tato nikkhantattā nibbānaṃ, vānanāmaṃ taṇhaṃ padhānaṃ katvā sabbakilese pahāya nibbānaṃ pattanti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "2"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kaṭacchubhikkhaṃ datvānā"
      },
      "ti karatalena gahetabbā dabbi kaṭacchu, bhikkhīyati āyācīyatīti bhikkhā, abhi visesena khāditabbā bhakkhitabbāti vā bhikkhā, kaṭacchunā gahetabbā bhikkhā kaṭacchubhikkhā, dabbiyā bhattaṃ datvāti attho. Sesaṃ sabbattha uttānatthamevāti."
    ],
    "innerText": "2.Kaṭacchubhikkhaṃ datvānāti karatalena gahetabbā dabbi kaṭacchu, bhikkhīyati āyācīyatīti bhikkhā, abhi visesena khāditabbā bhakkhitabbāti vā bhikkhā, kaṭacchunā gahetabbā bhikkhā kaṭacchubhikkhā, dabbiyā bhattaṃ datvāti attho. Sesaṃ sabbattha uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Bhikkhādāyakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Ñāṇasaññikattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suvaṇṇavaṇṇaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sambuddha"
      },
      "ntiādikaṃ āyasmato ñāṇasaññikattherassa apadānaṃ. Kā uppatti? Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto siddhatthassa bhagavato kāle kulagehe nibbatto vuddhimanvāya saddhājāto saddhammassavane sādaro sālayo bhagavato dhammadesanānusārena ñāṇaṃ pesetvā ghosapamāṇattā bhagavato ñāṇe pasanno pañcaṅgaaṭṭhaṅganamakkāravasena paṇāmaṃ katvā pakkāmi. So tato cuto devalokesu uppanno tattha cha kāmāvacare dibbasampattimanubhavanto tato cavitvā manussaloke jāto tatthaggabhūtā cakkavattisampadādayo ",
      " anubhavitvā imasmiṃ ",
      " buddhuppāde vibhavasampanne ekasmiṃ kulagehe nibbatto vuddhimanvāya satthari pasīditvā pabbajito nacirasseva arahā ahosi."
    ],
    "innerText": "Suvaṇṇavaṇṇaṃsambuddhantiādikaṃ āyasmato ñāṇasaññikattherassa apadānaṃ. Kā uppatti? Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto siddhatthassa bhagavato kāle kulagehe nibbatto vuddhimanvāya saddhājāto saddhammassavane sādaro sālayo bhagavato dhammadesanānusārena ñāṇaṃ pesetvā ghosapamāṇattā bhagavato ñāṇe pasanno pañcaṅgaaṭṭhaṅganamakkāravasena paṇāmaṃ katvā pakkāmi. So tato cuto devalokesu uppanno tattha cha kāmāvacare dibbasampattimanubhavanto tato cavitvā manussaloke jāto tatthaggabhūtā cakkavattisampadādayo anubhavitvā imasmiṃ buddhuppāde vibhavasampanne ekasmiṃ kulagehe nibbatto vuddhimanvāya satthari pasīditvā pabbajito nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "7"
      },
      ". So aparabhāge attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "suvaṇṇavaṇṇaṃ sambuddha"
      },
      "ntiādimāha. Taṃ vuttatthameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nisabhājāniyaṃ yathā"
      },
      "ti gavasatasahassajeṭṭho nisabho, nisabho ca so ājāniyo seṭṭho uttamo ceti nisabhājāniyo. Yathā nisabhājāniyo, tatheva bhagavāti attho. Lokavisayasaññātaṃ paññattivasena evaṃ vuttaṃ. Anupameyyo hi bhagavā. Sesaṃ sabbattha uttānatthamevāti."
    ],
    "innerText": "7. So aparabhāge attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento suvaṇṇavaṇṇaṃ sambuddhantiādimāha. Taṃ vuttatthameva. Nisabhājāniyaṃ yathāti gavasatasahassajeṭṭho nisabho, nisabho ca so ājāniyo seṭṭho uttamo ceti nisabhājāniyo. Yathā nisabhājāniyo, tatheva bhagavāti attho. Lokavisayasaññātaṃ paññattivasena evaṃ vuttaṃ. Anupameyyo hi bhagavā. Sesaṃ sabbattha uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ñāṇasaññikattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Uppalahatthiyattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tivarāyaṃ nivāsīha"
      },
      "ntiādikaṃ āyasmato uppalahatthakattherassa apadānaṃ. Ayampi purimajinavaresu katakusalo tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto siddhatthassa bhagavato kāle mālākārakule nibbatto vuddhimanvāya mālākārakammena anekāni pupphāni vikkiṇanto jīvati. Athekadivasaṃ pupphāni gahetvā caranto bhagavantaṃ ratanagghikamiva caramānaṃ disvā rattuppalakalāpena pūjesi. So tato cuto teneva puññena sugatīsu puññamanubhavitvā imasmiṃ buddhuppāde kulagehe nibbatto vuddhimanvāya saddhājāto pabbajitvā nacirasseva arahā ahosi."
    ],
    "innerText": "Tivarāyaṃ nivāsīhantiādikaṃ āyasmato uppalahatthakattherassa apadānaṃ. Ayampi purimajinavaresu katakusalo tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto siddhatthassa bhagavato kāle mālākārakule nibbatto vuddhimanvāya mālākārakammena anekāni pupphāni vikkiṇanto jīvati. Athekadivasaṃ pupphāni gahetvā caranto bhagavantaṃ ratanagghikamiva caramānaṃ disvā rattuppalakalāpena pūjesi. So tato cuto teneva puññena sugatīsu puññamanubhavitvā imasmiṃ buddhuppāde kulagehe nibbatto vuddhimanvāya saddhājāto pabbajitvā nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "13"
      },
      ". So ",
      " aparabhāge attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tivarāyaṃ nivāsīha"
      },
      "ntiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tivarā"
      },
      "ti tīhi vārehi kāritaṃ sañcaritaṃ paṭicchannaṃ nagaraṃ, tassaṃ tivarāyaṃ nivāsī, vasanasīlo nivāsanaṭṭhānagehe vā vasanto ahanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ahosiṃ māliko tadā"
      },
      "ti tadā nibbānatthāya puññasambhārakaraṇasamaye māliko mālākārova pupphāni kayavikkayaṃ katvā jīvanto ahosinti attho."
    ],
    "innerText": "13. So aparabhāge attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento tivarāyaṃ nivāsīhantiādimāha. Tattha tivarāti tīhi vārehi kāritaṃ sañcaritaṃ paṭicchannaṃ nagaraṃ, tassaṃ tivarāyaṃ nivāsī, vasanasīlo nivāsanaṭṭhānagehe vā vasanto ahanti attho. Ahosiṃ māliko tadāti tadā nibbānatthāya puññasambhārakaraṇasamaye māliko mālākārova pupphāni kayavikkayaṃ katvā jīvanto ahosinti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "14"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pupphahatthamadāsaha"
      },
      "nti ",
      " siddhatthaṃ bhagavantaṃ disvā uppalakalāpaṃ adāsiṃ pūjesinti attho. Sesaṃ sabbattha uttānatthamevāti."
    ],
    "innerText": "14.Pupphahatthamadāsahanti siddhatthaṃ bhagavantaṃ disvā uppalakalāpaṃ adāsiṃ pūjesinti attho. Sesaṃ sabbattha uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Uppalahatthakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Padapūjakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Siddhatthassa"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhagavato"
      },
      "tiādikaṃ āyasmato padapūjakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro siddhatthassa bhagavato kāle kulagehe nibbatto vuddhimanvāya satthari pasanno sumanapupphena pādamūle pūjesi. So tena puññena devamanussesu saṃsaranto sakkasampattiṃ anubhavitvā imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbatto vuddhimanvāya satthari pasīditvā pabbajito vipassanaṃ vaḍḍhetvā arahattaphale patiṭṭhāsi."
    ],
    "innerText": "Siddhatthassabhagavatotiādikaṃ āyasmato padapūjakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro siddhatthassa bhagavato kāle kulagehe nibbatto vuddhimanvāya satthari pasanno sumanapupphena pādamūle pūjesi. So tena puññena devamanussesu saṃsaranto sakkasampattiṃ anubhavitvā imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbatto vuddhimanvāya satthari pasīditvā pabbajito vipassanaṃ vaḍḍhetvā arahattaphale patiṭṭhāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "19"
      },
      ". So aparabhāge attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "siddhatthassa bhagavato"
      },
      "tiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jātipupphamadāsaha"
      },
      "nti jātisumanapupphaṃ adāsiṃ ahanti vattabbe gāthābandhasukhatthaṃ sumanasaddassa lopaṃ katvā vuttaṃ. Tattha jātiyā nibbatto vikasamānoyeva sumanaṃ janānaṃ somanassaṃ karotīti sumanaṃ, pupphanaṭṭhena vikasanaṭṭhena pupphaṃ, sumanañca taṃ pupphañcāti sumanapupphaṃ, tāni sumanapupphāni siddhatthassa bhagavato ahaṃ pūjesinti attho. Sesaṃ sabbattha uttānamevāti."
    ],
    "innerText": "19. So aparabhāge attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento siddhatthassa bhagavatotiādimāha. Jātipupphamadāsahanti jātisumanapupphaṃ adāsiṃ ahanti vattabbe gāthābandhasukhatthaṃ sumanasaddassa lopaṃ katvā vuttaṃ. Tattha jātiyā nibbatto vikasamānoyeva sumanaṃ janānaṃ somanassaṃ karotīti sumanaṃ, pupphanaṭṭhena vikasanaṭṭhena pupphaṃ, sumanañca taṃ pupphañcāti sumanapupphaṃ, tāni sumanapupphāni siddhatthassa bhagavato ahaṃ pūjesinti attho. Sesaṃ sabbattha uttānamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Padapūjakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Muṭṭhipupphiyattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sudassano"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nāma nāmenā"
      },
      "tiādikaṃ āyasmato muṭṭhipupphiyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto padumuttarassa bhagavato kāle mālākārakule nibbatto vuddhimanvāya sakasippe nipphattiṃ patto ekadivasaṃ ",
      " bhagavantaṃ disvā pasannamānaso jātisumanapupphāni ubhohi hatthehi bhagavato pādamūle okiritvā pūjesi. So tena kusalasambhārena devamanussesu saṃsaranto ubho sampattiyo anubhavitvā imasmiṃ buddhuppāde kulagehe nibbatto vuddhippatto pubbavāsanāvasena satthari pasīditvā pabbajito nacirasseva arahā ahosi."
    ],
    "innerText": "Sudassanonāma nāmenātiādikaṃ āyasmato muṭṭhipupphiyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto padumuttarassa bhagavato kāle mālākārakule nibbatto vuddhimanvāya sakasippe nipphattiṃ patto ekadivasaṃ bhagavantaṃ disvā pasannamānaso jātisumanapupphāni ubhohi hatthehi bhagavato pādamūle okiritvā pūjesi. So tena kusalasambhārena devamanussesu saṃsaranto ubho sampattiyo anubhavitvā imasmiṃ buddhuppāde kulagehe nibbatto vuddhippatto pubbavāsanāvasena satthari pasīditvā pabbajito nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "14-25"
      },
      ". So aparabhāge attano pubbakammaṃ anussaritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sudassano nāma nāmenā"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sudassano"
      },
      "ti ārohapariṇāharūpasaṇṭhānayobbaññasobhanena sundaro dassanoti sudassano, nāmena sudassano nāma mālākāro hutvā jātisumanapupphehi padumuttaraṃ bhagavantaṃ pūjesinti attho. Sesaṃ sabbattha uttānamevāti."
    ],
    "innerText": "14-25. So aparabhāge attano pubbakammaṃ anussaritvā somanassajāto pubbacaritāpadānaṃ pakāsento sudassano nāma nāmenātiādimāha. Tattha sudassanoti ārohapariṇāharūpasaṇṭhānayobbaññasobhanena sundaro dassanoti sudassano, nāmena sudassano nāma mālākāro hutvā jātisumanapupphehi padumuttaraṃ bhagavantaṃ pūjesinti attho. Sesaṃ sabbattha uttānamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Muṭṭhipupphiyattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Udakapūjakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suvaṇṇavaṇṇaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sambuddha"
      },
      "ntiādikaṃ āyasmato udakapūjakattherassa apadānaṃ. Ayampi purimajinavaresu pūritakusalasañcayo tattha tattha bhave vivaṭṭūpanissayāni puññāni paripūriyamāno pudumuttarassa bhagavato kāle ekasmiṃ kulagehe nibbatto vuddhimanvāya kusalākusalaṃ jānanto padumuttarassa bhagavato ākāse gacchato nikkhantachabbaṇṇabuddharaṃsīsu pasanno ubhohi hatthehi udakaṃ gahetvā pūjesi. Tena pūjitaṃ udakaṃ rajatabubbulaṃ viya ākāse aṭṭhāsi. So abhippasanno teneva somanassena tusitādīsu nibbatto dibbasampattiyo anubhavitvā aparabhāge manussasampattiyo ca anubhavitvā imasmiṃ buddhuppāde kulagehe nibbatto viññutaṃ patto satthari pasīditvā pabbajito nacirasseva arahā ahosi."
    ],
    "innerText": "Suvaṇṇavaṇṇaṃsambuddhantiādikaṃ āyasmato udakapūjakattherassa apadānaṃ. Ayampi purimajinavaresu pūritakusalasañcayo tattha tattha bhave vivaṭṭūpanissayāni puññāni paripūriyamāno pudumuttarassa bhagavato kāle ekasmiṃ kulagehe nibbatto vuddhimanvāya kusalākusalaṃ jānanto padumuttarassa bhagavato ākāse gacchato nikkhantachabbaṇṇabuddharaṃsīsu pasanno ubhohi hatthehi udakaṃ gahetvā pūjesi. Tena pūjitaṃ udakaṃ rajatabubbulaṃ viya ākāse aṭṭhāsi. So abhippasanno teneva somanassena tusitādīsu nibbatto dibbasampattiyo anubhavitvā aparabhāge manussasampattiyo ca anubhavitvā imasmiṃ buddhuppāde kulagehe nibbatto viññutaṃ patto satthari pasīditvā pabbajito nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "29"
      },
      ". So ",
      " aparabhāge attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "suvaṇṇavaṇṇaṃ sambuddha"
      },
      "ntiādimāha. Taṃ heṭṭhā vuttameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ghatāsanaṃva jalita"
      },
      "nti ghataṃ vuccati sappi, ghatassa āsanaṃ ādhāranti ghatāsanaṃ, aggi, atha vā taṃ asati bhuñjatīti ghatāsanaṃ ",
      ", aggiyeva. Yathā ghate āsitte aggimhi aggisikhā atīva jalati, evaṃ aggikkhandhaṃ iva jalamānaṃ bhagavantanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ādittaṃva hutāsana"
      },
      "nti hutaṃ vuccati pūjāsakkāre, hutassa pūjāsakkārassa āsananti hutāsanaṃ, jalamānaṃ sūriyaṃ iva dvattiṃsamahāpurisalakkhaṇehi byāmappabhāmaṇḍalehi vijjotamānaṃ suvaṇṇavaṇṇaṃ sambuddhaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anilañjase"
      },
      " ākāse gacchantaṃ addasanti sambandho. Sesaṃ sabbattha uttānamevāti."
    ],
    "innerText": "29. So aparabhāge attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento suvaṇṇavaṇṇaṃ sambuddhantiādimāha. Taṃ heṭṭhā vuttameva. Ghatāsanaṃva jalitanti ghataṃ vuccati sappi, ghatassa āsanaṃ ādhāranti ghatāsanaṃ, aggi, atha vā taṃ asati bhuñjatīti ghatāsanaṃ , aggiyeva. Yathā ghate āsitte aggimhi aggisikhā atīva jalati, evaṃ aggikkhandhaṃ iva jalamānaṃ bhagavantanti attho. Ādittaṃva hutāsananti hutaṃ vuccati pūjāsakkāre, hutassa pūjāsakkārassa āsananti hutāsanaṃ, jalamānaṃ sūriyaṃ iva dvattiṃsamahāpurisalakkhaṇehi byāmappabhāmaṇḍalehi vijjotamānaṃ suvaṇṇavaṇṇaṃ sambuddhaṃ anilañjase ākāse gacchantaṃ addasanti sambandho. Sesaṃ sabbattha uttānamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Udakapūjakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Naḷamāliyattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Padumuttarabuddhassā"
      },
      "tiādikaṃ āyasmato naḷamāliyattherassa apadānaṃ. Esopi purimajinavaresu katādhikāro anekāsu jātīsu vivaṭṭūpanissayāni kusalakammāni upacinanto padumuttarassa bhagavato kāle kulagehe nibbatto vuddhimanvāya gharāvāsaṃ saṇṭhapetvā kāme ādīnavaṃ disvā gehaṃ pahāya tāpasapabbajjaṃ pabbajitvā himavante vasanto tatthāgataṃ bhagavantaṃ disvā pasanno vanditvā tiṇasantharaṃ santharitvā tattha nisinnassa bhagavato naḷamālehi bījaniṃ katvā bījetvā adāsi. Paṭiggahesi bhagavā tassānukampāya, anumodanañca akāsi. So tena puññena devamanussesu saṃsaranto uppannuppannabhave pariḷāhasantāpavivajjito kāyacittacetasikasukhappatto anekasukhamanubhavitvā ",
      " imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbatto vuddhimanvāya pubbavāsanābalena satthari pasanno pabbajitvā nacirasseva arahā ahosi."
    ],
    "innerText": "Padumuttarabuddhassātiādikaṃ āyasmato naḷamāliyattherassa apadānaṃ. Esopi purimajinavaresu katādhikāro anekāsu jātīsu vivaṭṭūpanissayāni kusalakammāni upacinanto padumuttarassa bhagavato kāle kulagehe nibbatto vuddhimanvāya gharāvāsaṃ saṇṭhapetvā kāme ādīnavaṃ disvā gehaṃ pahāya tāpasapabbajjaṃ pabbajitvā himavante vasanto tatthāgataṃ bhagavantaṃ disvā pasanno vanditvā tiṇasantharaṃ santharitvā tattha nisinnassa bhagavato naḷamālehi bījaniṃ katvā bījetvā adāsi. Paṭiggahesi bhagavā tassānukampāya, anumodanañca akāsi. So tena puññena devamanussesu saṃsaranto uppannuppannabhave pariḷāhasantāpavivajjito kāyacittacetasikasukhappatto anekasukhamanubhavitvā imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbatto vuddhimanvāya pubbavāsanābalena satthari pasanno pabbajitvā nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "36"
      },
      ". So aparabhāge attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "padumuttarabuddhassā"
      },
      "tiādimāha. Taṃ heṭṭhā vuttameva."
    ],
    "innerText": "36. So aparabhāge attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento padumuttarabuddhassātiādimāha. Taṃ heṭṭhā vuttameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "37"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Naḷamālaṃ gahetvānā"
      },
      "ti naḷati asāro nissāro hutvā veḷuvaṃsatopi tanuko sallahuko jātoti naḷo, naḷassa mālā ",
      " pupphaṃ naḷamālaṃ, tena naḷamālena bījaniṃ kāresinti sambandho ",
      ". Bījissati janissati vāto anenāti bījanī, taṃ bījaniṃ buddhassa upanāmesiṃ, paṭiggahesinti attho. Sesaṃ sabbattha uttānamevāti."
    ],
    "innerText": "37.Naḷamālaṃ gahetvānāti naḷati asāro nissāro hutvā veḷuvaṃsatopi tanuko sallahuko jātoti naḷo, naḷassa mālā pupphaṃ naḷamālaṃ, tena naḷamālena bījaniṃ kāresinti sambandho . Bījissati janissati vāto anenāti bījanī, taṃ bījaniṃ buddhassa upanāmesiṃ, paṭiggahesinti attho. Sesaṃ sabbattha uttānamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Naḷamāliyattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sattamabhāṇavāravaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Āsanupaṭṭhāhakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kānanaṃ vanamoggayhā"
      },
      "tiādikaṃ āyasmato āsanupaṭṭhāhakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto atthadassissa bhagavato kāle kulagehe nibbatto gharāvāsaṃ vasanto tattha dosaṃ disvā gharāvāsaṃ pahāya tāpasapabbajjaṃ pabbajitvā himavante vasanto tattha sampattaṃ bhagavantaṃ disvā pasanno sīhāsanaṃ adāsi, tattha nisinnaṃ bhagavantaṃ mālākalāpaṃ gahetvā pūjetvā taṃ padakkhiṇaṃ katvā pakkāmi. So tena puññena devamanussesu saṃsaranto nibbattanibbattabhave uccakuliko vibhavasampanno ahosi. So kālantarena imasmiṃ buddhuppāde kulagehe nibbatto vuddhimanvāya satthari pasīditvā pabbajito nacirasseva arahā ahosi."
    ],
    "innerText": "Kānanaṃ vanamoggayhātiādikaṃ āyasmato āsanupaṭṭhāhakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto atthadassissa bhagavato kāle kulagehe nibbatto gharāvāsaṃ vasanto tattha dosaṃ disvā gharāvāsaṃ pahāya tāpasapabbajjaṃ pabbajitvā himavante vasanto tattha sampattaṃ bhagavantaṃ disvā pasanno sīhāsanaṃ adāsi, tattha nisinnaṃ bhagavantaṃ mālākalāpaṃ gahetvā pūjetvā taṃ padakkhiṇaṃ katvā pakkāmi. So tena puññena devamanussesu saṃsaranto nibbattanibbattabhave uccakuliko vibhavasampanno ahosi. So kālantarena imasmiṃ buddhuppāde kulagehe nibbatto vuddhimanvāya satthari pasīditvā pabbajito nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "47"
      },
      ". So arahā samāno attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kānanaṃ vanamoggayhā"
      },
      "tiādimāha. Taṃ sabbaṃ heṭṭhā vuttatthamevāti."
    ],
    "innerText": "47. So arahā samāno attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento kānanaṃ vanamoggayhātiādimāha. Taṃ sabbaṃ heṭṭhā vuttatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Āsanupaṭṭhāhakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Biḷālidāyakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Himavantassāvidūre"
      },
      "tiādikaṃ āyasmato biḷālidāyakattherassa apadānaṃ. Ayampi purimajinavaresu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto padumuttarassa bhagavato kāle kulagehe ",
      " nibbatto viññutaṃ patto gharāvāsaṃ vasanto tatthādīnavaṃ ",
      " disvā gharāvāsaṃ pahāya tāpasapabbajjaṃ pabbajitvā himavante vasanto atīva appicchasantuṭṭho āluvādīhi yāpento vasati. Tadā padumuttaro bhagavā tassa anukampāya taṃ himavantaṃ agamāsi ",
      ". Taṃ disvā pasanno vanditvā biḷāliyo gahetvā patte okiri. Taṃ tathāgato tassānukampāya somanassuppādayanto paribhuñji. So tena kammena tato cuto devamanussesu ubhayasampattiyo anubhavitvā imasmiṃ buddhuppāde kulagehe nibbattitvā vuddhimanvāya satthari pasanno sāsane pabbajitvā nacirasseva arahā ahosi."
    ],
    "innerText": "Himavantassāvidūretiādikaṃ āyasmato biḷālidāyakattherassa apadānaṃ. Ayampi purimajinavaresu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto padumuttarassa bhagavato kāle kulagehe nibbatto viññutaṃ patto gharāvāsaṃ vasanto tatthādīnavaṃ disvā gharāvāsaṃ pahāya tāpasapabbajjaṃ pabbajitvā himavante vasanto atīva appicchasantuṭṭho āluvādīhi yāpento vasati. Tadā padumuttaro bhagavā tassa anukampāya taṃ himavantaṃ agamāsi . Taṃ disvā pasanno vanditvā biḷāliyo gahetvā patte okiri. Taṃ tathāgato tassānukampāya somanassuppādayanto paribhuñji. So tena kammena tato cuto devamanussesu ubhayasampattiyo anubhavitvā imasmiṃ buddhuppāde kulagehe nibbattitvā vuddhimanvāya satthari pasanno sāsane pabbajitvā nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "53"
      },
      ". So aparabhāge attano kusalakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "himavantassāvidūre"
      },
      "tiādimāha. Taṃ sabbaṃ heṭṭhā vuttanayattā uttānatthameva. Āluvakarambhādayo tesaṃ tesaṃ kandajātīnaṃ nāmānevāti."
    ],
    "innerText": "53. So aparabhāge attano kusalakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento himavantassāvidūretiādimāha. Taṃ sabbaṃ heṭṭhā vuttanayattā uttānatthameva. Āluvakarambhādayo tesaṃ tesaṃ kandajātīnaṃ nāmānevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Biḷālidāyakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Reṇupūjakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suvaṇṇavaṇṇaṃ sambuddha"
      },
      "ntiādikaṃ āyasmato reṇupūjakattherassa apadānaṃ. Ayampi purimajinavaresu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto vipassissa bhagavato kāle kulagehe nibbatto vuddhimanvāya satthari pasanno viññutaṃ patto aggikkhandhaṃ viya vijjotamānaṃ bhagavantaṃ disvā pasannamānaso nāgapupphakesaraṃ gahetvā pūjesi. Atha bhagavā anumodanamakāsi."
    ],
    "innerText": "Suvaṇṇavaṇṇaṃ sambuddhantiādikaṃ āyasmato reṇupūjakattherassa apadānaṃ. Ayampi purimajinavaresu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto vipassissa bhagavato kāle kulagehe nibbatto vuddhimanvāya satthari pasanno viññutaṃ patto aggikkhandhaṃ viya vijjotamānaṃ bhagavantaṃ disvā pasannamānaso nāgapupphakesaraṃ gahetvā pūjesi. Atha bhagavā anumodanamakāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "62-3"
      },
      ". So tena puññena tato cuto devamanussesu saṃsaranto ubhayasampattiyo anubhavitvā uppannuppannabhave sabbattha pūjito imasmiṃ buddhuppāde kulagehe nibbatto viññutaṃ patto pubbavāsanābalena satthari pasanno sāsane pabbajito nacirasseva arahā hutvā dibbacakkhunā attano pubbakammaṃ disvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "suvaṇṇavaṇṇaṃ sambuddha"
      },
      "ntiādimāha. Taṃ heṭṭhā vuttatthameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sataraṃsiṃva bhāṇuma"
      },
      "nti satamattā satappamāṇā raṃsi pabhā yassa sūriyassa ",
      " so sataraṃsi, gāthābandhasukhatthaṃ sataraṃsīti vuttaṃ, anekasatassa anekasatasahassaraṃsīti attho. Bhāṇu vuccati pabhā, bhāṇu pabhā yassa so bhāṇumā, bhāṇumasaṅkhātaṃ sūriyaṃ iva vipassiṃ bhagavantaṃ disvā sakesaraṃ nāgapupphaṃ gahetvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhiropayiṃ"
      },
      " pūjesinti attho. Sesaṃ uttānamevāti."
    ],
    "innerText": "62-3. So tena puññena tato cuto devamanussesu saṃsaranto ubhayasampattiyo anubhavitvā uppannuppannabhave sabbattha pūjito imasmiṃ buddhuppāde kulagehe nibbatto viññutaṃ patto pubbavāsanābalena satthari pasanno sāsane pabbajito nacirasseva arahā hutvā dibbacakkhunā attano pubbakammaṃ disvā somanassajāto pubbacaritāpadānaṃ pakāsento suvaṇṇavaṇṇaṃ sambuddhantiādimāha. Taṃ heṭṭhā vuttatthameva. Sataraṃsiṃva bhāṇumanti satamattā satappamāṇā raṃsi pabhā yassa sūriyassa so sataraṃsi, gāthābandhasukhatthaṃ sataraṃsīti vuttaṃ, anekasatassa anekasatasahassaraṃsīti attho. Bhāṇu vuccati pabhā, bhāṇu pabhā yassa so bhāṇumā, bhāṇumasaṅkhātaṃ sūriyaṃ iva vipassiṃ bhagavantaṃ disvā sakesaraṃ nāgapupphaṃ gahetvā abhiropayiṃ pūjesinti attho. Sesaṃ uttānamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Reṇupūjakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ekādasamavaggavaṇṇanā samattā."
  }
]