[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "3. Paññāvaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Mahāpaññākathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      ". Aniccānupassanā ",
      " bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti? Dukkhānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti? Anattānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti…pe… ",
      " paṭinissaggānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti?"
    ],
    "innerText": "1. Aniccānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti? Dukkhānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti? Anattānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti…pe… paṭinissaggānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aniccānupassanā bhāvitā bahulīkatā javanapaññaṃ paripūreti. Dukkhānupassanā bhāvitā bahulīkatā nibbedhikapaññaṃ paripūreti. Anattānupassanā bhāvitā bahulīkatā mahāpaññaṃ paripūreti. Nibbidānupassanā bhāvitā bahulīkatā tikkhapaññaṃ paripūreti. Virāgānupassanā bhāvitā bahulīkatā vipulapaññaṃ paripūreti. Nirodhānupassanā bhāvitā bahulīkatā gambhīrapaññaṃ paripūreti. Paṭinissaggānupassanā bhāvitā bahulīkatā asāmantapaññaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[assāmantapaññaṃ (syā.)]"
      },
      " paripūreti. Imā satta paññā bhāvitā bahulīkatā paṇḍiccaṃ paripūrenti. Imā aṭṭha paññā bhāvitā bahulīkatā puthupaññaṃ paripūrenti. Imā nava paññā bhāvitā bahulīkatā hāsapaññaṃ paripūrenti."
    ],
    "innerText": "Aniccānupassanā bhāvitā bahulīkatā javanapaññaṃ paripūreti. Dukkhānupassanā bhāvitā bahulīkatā nibbedhikapaññaṃ paripūreti. Anattānupassanā bhāvitā bahulīkatā mahāpaññaṃ paripūreti. Nibbidānupassanā bhāvitā bahulīkatā tikkhapaññaṃ paripūreti. Virāgānupassanā bhāvitā bahulīkatā vipulapaññaṃ paripūreti. Nirodhānupassanā bhāvitā bahulīkatā gambhīrapaññaṃ paripūreti. Paṭinissaggānupassanā bhāvitā bahulīkatā asāmantapaññaṃ [assāmantapaññaṃ (syā.)] paripūreti. Imā satta paññā bhāvitā bahulīkatā paṇḍiccaṃ paripūrenti. Imā aṭṭha paññā bhāvitā bahulīkatā puthupaññaṃ paripūrenti. Imā nava paññā bhāvitā bahulīkatā hāsapaññaṃ paripūrenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Hāsapaññā paṭibhānapaṭisambhidā. Tassā atthavavatthānato atthapaṭisambhidā adhigatā hoti sacchikatā phassitā paññāya. Dhammavavatthānato dhammapaṭisambhidā adhigatā hoti sacchikatā phassitā paññāya. Niruttivavatthānato niruttipaṭisambhidā adhigatā hoti sacchikatā ",
      " phassitā paññāya. Paṭibhānavavatthānato paṭibhānapaṭisambhidā adhigatā ",
      " hoti sacchikatā phassitā paññāya. Tassimā catasso paṭisambhidāyo adhigatā honti sacchikatā phassitā paññāya."
    ],
    "innerText": "Hāsapaññā paṭibhānapaṭisambhidā. Tassā atthavavatthānato atthapaṭisambhidā adhigatā hoti sacchikatā phassitā paññāya. Dhammavavatthānato dhammapaṭisambhidā adhigatā hoti sacchikatā phassitā paññāya. Niruttivavatthānato niruttipaṭisambhidā adhigatā hoti sacchikatā phassitā paññāya. Paṭibhānavavatthānato paṭibhānapaṭisambhidā adhigatā hoti sacchikatā phassitā paññāya. Tassimā catasso paṭisambhidāyo adhigatā honti sacchikatā phassitā paññāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Rūpe ",
      " aniccānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti…pe… rūpe paṭinissaggānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti? Rūpe aniccānupassanā bhāvitā bahulīkatā javanapaññaṃ paripūreti…pe… rūpe paṭinissaggānupassanā bhāvitā bahulīkatā asāmantapaññaṃ paripūreti. Imā satta paññā bhāvitā bahulīkatā paṇḍiccaṃ paripūrenti. Imā aṭṭha paññā ",
      " bhāvitā bahulīkatā puthupaññaṃ paripūrenti. Imā nava paññā bhāvitā bahulīkatā hāsapaññaṃ paripūrenti."
    ],
    "innerText": "Rūpe aniccānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti…pe… rūpe paṭinissaggānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti? Rūpe aniccānupassanā bhāvitā bahulīkatā javanapaññaṃ paripūreti…pe… rūpe paṭinissaggānupassanā bhāvitā bahulīkatā asāmantapaññaṃ paripūreti. Imā satta paññā bhāvitā bahulīkatā paṇḍiccaṃ paripūrenti. Imā aṭṭha paññā bhāvitā bahulīkatā puthupaññaṃ paripūrenti. Imā nava paññā bhāvitā bahulīkatā hāsapaññaṃ paripūrenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Hāsapaññā paṭibhānapaṭisambhidā. Tassā atthavavatthānato atthapaṭisambhidā adhigatā hoti sacchikatā phassitā paññāya. Dhammavavatthānato dhammapaṭisambhidā adhigatā hoti sacchikatā phassitā paññāya. Niruttivavatthānato niruttipaṭisambhidā adhigatā hoti sacchikatā phassitā paññāya. Paṭibhānavavatthānato paṭibhānapaṭisambhidā adhigatā hoti, sacchikatā phassitā paññāya. Tassimā catasso paṭisambhidāyo adhigatā honti sacchikatā phassitā paññāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vedanāya…pe… saññāya… saṅkhāresu… viññāṇe… cakkhusmiṃ…pe… jarāmaraṇe aniccānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti…pe… jarāmaraṇe paṭinissaggānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti? Jarāmaraṇe aniccānupassanā bhāvitā bahulīkatā javanapaññaṃ paripūreti…pe… jarāmaraṇe paṭinissaggānupassanā bhāvitā bahulīkatā ",
      " asāmantapaññaṃ paripūreti. Imā satta paññā bhāvitā bahulīkatā paṇḍiccaṃ paripūrenti. Imā aṭṭha paññā bhāvitā bahulīkatā puthupaññaṃ paripūrenti. Imā nava paññā bhāvitā bahulīkatā hāsapaññaṃ paripūrenti."
    ],
    "innerText": "Vedanāya…pe… saññāya… saṅkhāresu… viññāṇe… cakkhusmiṃ…pe… jarāmaraṇe aniccānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti…pe… jarāmaraṇe paṭinissaggānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti? Jarāmaraṇe aniccānupassanā bhāvitā bahulīkatā javanapaññaṃ paripūreti…pe… jarāmaraṇe paṭinissaggānupassanā bhāvitā bahulīkatā asāmantapaññaṃ paripūreti. Imā satta paññā bhāvitā bahulīkatā paṇḍiccaṃ paripūrenti. Imā aṭṭha paññā bhāvitā bahulīkatā puthupaññaṃ paripūrenti. Imā nava paññā bhāvitā bahulīkatā hāsapaññaṃ paripūrenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Hāsapaññā paṭibhānapaṭisambhidā. Tassā atthavavatthānato atthapaṭisambhidā adhigatā hoti sacchikatā phassitā paññāya ",
      ". Dhammavavatthānato dhammapaṭisambhidā adhigatā hoti sacchikatā phassitā paññāya. Niruttivavatthānato niruttipaṭisambhidā adhigatā hoti sacchikatā phassitā paññāya. Paṭibhānavavatthānato paṭibhānapaṭisambhidā adhigatā hoti sacchikatā ",
      " phassitā paññāya. Tassimā catasso paṭisambhidāyo adhigatā honti sacchikatā phassitā paññāya."
    ],
    "innerText": "Hāsapaññā paṭibhānapaṭisambhidā. Tassā atthavavatthānato atthapaṭisambhidā adhigatā hoti sacchikatā phassitā paññāya . Dhammavavatthānato dhammapaṭisambhidā adhigatā hoti sacchikatā phassitā paññāya. Niruttivavatthānato niruttipaṭisambhidā adhigatā hoti sacchikatā phassitā paññāya. Paṭibhānavavatthānato paṭibhānapaṭisambhidā adhigatā hoti sacchikatā phassitā paññāya. Tassimā catasso paṭisambhidāyo adhigatā honti sacchikatā phassitā paññāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "2"
      },
      ". Rūpe aniccānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti? Atītānāgatapaccuppanne rūpe aniccānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti? Rūpe dukkhānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti? Atītānāgatapaccuppanne rūpe dukkhānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti? Rūpe anattānupassanā ",
      " bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti? Atītānāgatapaccuppanne rūpe anattānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti? Rūpe nibbidānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti? Atītānāgatapaccuppanne rūpe nibbidānupassanā ",
      " bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti? Rūpe virāgānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti? Atītānāgatapaccuppanne rūpe virāgānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti? Rūpe nirodhānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti? Atītānāgatapaccuppanne rūpe nirodhānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti? Rūpe paṭinissaggānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti? Atītānāgatapaccuppanne rūpe paṭinissaggānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti?"
    ],
    "innerText": "2. Rūpe aniccānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti? Atītānāgatapaccuppanne rūpe aniccānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti? Rūpe dukkhānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti? Atītānāgatapaccuppanne rūpe dukkhānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti? Rūpe anattānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti? Atītānāgatapaccuppanne rūpe anattānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti? Rūpe nibbidānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti? Atītānāgatapaccuppanne rūpe nibbidānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti? Rūpe virāgānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti? Atītānāgatapaccuppanne rūpe virāgānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti? Rūpe nirodhānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti? Atītānāgatapaccuppanne rūpe nirodhānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti? Rūpe paṭinissaggānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti? Atītānāgatapaccuppanne rūpe paṭinissaggānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Rūpe aniccānupassanā bhāvitā bahulīkatā javanapaññaṃ paripūreti. Atītānāgatapaccuppanne rūpe aniccānupassanā bhāvitā bahulīkatā javanapaññaṃ paripūreti. Rūpe dukkhānupassanā bhāvitā bahulīkatā nibbedhikapaññaṃ paripūreti. Atītānāgatapaccuppanne rūpe dukkhānupassanā bhāvitā bahulīkatā javanapaññaṃ paripūreti. Rūpe anattānupassanā bhāvitā bahulīkatā mahāpaññaṃ paripūreti. Atītānāgatapaccuppanne rūpe anattānupassanā bhāvitā bahulīkatā javanapaññaṃ paripūreti. Rūpe nibbidānupassanā ",
      " bhāvitā bahulīkatā tikkhapaññaṃ paripūreti. Atītānāgatapaccuppanne rūpe nibbidānupassanā bhāvitā bahulīkatā javanapaññaṃ paripūreti. Rūpe virāgānupassanā bhāvitā bahulīkatā vipulapaññaṃ paripūreti. Atītānāgatapaccuppanne rūpe virāgānupassanā bhāvitā bahulīkatā javanapaññaṃ ",
      " paripūreti. Rūpe nirodhānupassanā bhāvitā bahulīkatā gambhīrapaññaṃ paripūreti. Atītānāgatapaccuppanne rūpe nirodhānupassanā bhāvitā bahulīkatā javanapaññaṃ paripūreti. Rūpe paṭinissaggānupassanā bhāvitā bahulīkatā asāmantapaññaṃ paripūreti. Atītānāgatapaccuppanne rūpe paṭinissaggānupassanā ",
      " bhāvitā bahulīkatā javanapaññaṃ paripūreti. Imā satta paññā bhāvitā bahulīkatā paṇḍiccaṃ paripūrenti. Imā aṭṭha paññā bhāvitā bahulīkatā puthupaññaṃ paripūrenti. Imā nava paññā bhāvitā bahulīkatā hāsapaññaṃ paripūrenti."
    ],
    "innerText": "Rūpe aniccānupassanā bhāvitā bahulīkatā javanapaññaṃ paripūreti. Atītānāgatapaccuppanne rūpe aniccānupassanā bhāvitā bahulīkatā javanapaññaṃ paripūreti. Rūpe dukkhānupassanā bhāvitā bahulīkatā nibbedhikapaññaṃ paripūreti. Atītānāgatapaccuppanne rūpe dukkhānupassanā bhāvitā bahulīkatā javanapaññaṃ paripūreti. Rūpe anattānupassanā bhāvitā bahulīkatā mahāpaññaṃ paripūreti. Atītānāgatapaccuppanne rūpe anattānupassanā bhāvitā bahulīkatā javanapaññaṃ paripūreti. Rūpe nibbidānupassanā bhāvitā bahulīkatā tikkhapaññaṃ paripūreti. Atītānāgatapaccuppanne rūpe nibbidānupassanā bhāvitā bahulīkatā javanapaññaṃ paripūreti. Rūpe virāgānupassanā bhāvitā bahulīkatā vipulapaññaṃ paripūreti. Atītānāgatapaccuppanne rūpe virāgānupassanā bhāvitā bahulīkatā javanapaññaṃ paripūreti. Rūpe nirodhānupassanā bhāvitā bahulīkatā gambhīrapaññaṃ paripūreti. Atītānāgatapaccuppanne rūpe nirodhānupassanā bhāvitā bahulīkatā javanapaññaṃ paripūreti. Rūpe paṭinissaggānupassanā bhāvitā bahulīkatā asāmantapaññaṃ paripūreti. Atītānāgatapaccuppanne rūpe paṭinissaggānupassanā bhāvitā bahulīkatā javanapaññaṃ paripūreti. Imā satta paññā bhāvitā bahulīkatā paṇḍiccaṃ paripūrenti. Imā aṭṭha paññā bhāvitā bahulīkatā puthupaññaṃ paripūrenti. Imā nava paññā bhāvitā bahulīkatā hāsapaññaṃ paripūrenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Hāsapaññā ",
      " paṭibhānapaṭisambhidā. Tassā atthavavatthānato atthapaṭisambhidā adhigatā hoti sacchikatā phassitā paññāya. Dhammavavatthānato dhammapaṭisambhidā adhigatā hoti sacchikatā phassitā paññāya. Niruttivavatthānato niruttipaṭisambhidā adhigatā hoti sacchikatā phassitā paññāya. Paṭibhānavavatthānato paṭibhānapaṭisambhidā adhigatā hoti sacchikatā phassitā paññāya. Tassimā catasso paṭisambhidāyo adhigatā honti sacchikatā phassitā paññāya."
    ],
    "innerText": "Hāsapaññā paṭibhānapaṭisambhidā. Tassā atthavavatthānato atthapaṭisambhidā adhigatā hoti sacchikatā phassitā paññāya. Dhammavavatthānato dhammapaṭisambhidā adhigatā hoti sacchikatā phassitā paññāya. Niruttivavatthānato niruttipaṭisambhidā adhigatā hoti sacchikatā phassitā paññāya. Paṭibhānavavatthānato paṭibhānapaṭisambhidā adhigatā hoti sacchikatā phassitā paññāya. Tassimā catasso paṭisambhidāyo adhigatā honti sacchikatā phassitā paññāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vedanāya…pe… saññāya… saṅkhāresu… viññāṇe… cakkhusmiṃ…pe… jarāmaraṇe aniccānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti? Atītānāgatapaccuppanne jarāmaraṇe aniccānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti…pe… jarāmaraṇe paṭinissaggānupassanā ",
      " bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti? Atītānāgatapaccuppanne jarāmaraṇe paṭinissaggānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti? Jarāmaraṇe aniccānupassanā bhāvitā bahulīkatā javanapaññaṃ paripūreti. Atītānāgatapaccuppanne jarāmaraṇe aniccānupassanā bhāvitā bahulīkatā javanapaññaṃ paripūreti…pe… tassimā catasso paṭisambhidāyo adhigatā honti sacchikatā phassitā paññāya."
    ],
    "innerText": "Vedanāya…pe… saññāya… saṅkhāresu… viññāṇe… cakkhusmiṃ…pe… jarāmaraṇe aniccānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti? Atītānāgatapaccuppanne jarāmaraṇe aniccānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti…pe… jarāmaraṇe paṭinissaggānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti? Atītānāgatapaccuppanne jarāmaraṇe paṭinissaggānupassanā bhāvitā bahulīkatā katamaṃ paññaṃ paripūreti? Jarāmaraṇe aniccānupassanā bhāvitā bahulīkatā javanapaññaṃ paripūreti. Atītānāgatapaccuppanne jarāmaraṇe aniccānupassanā bhāvitā bahulīkatā javanapaññaṃ paripūreti…pe… tassimā catasso paṭisambhidāyo adhigatā honti sacchikatā phassitā paññāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "3"
      },
      ". ‘‘Cattārome ",
      ", bhikkhave ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[saṃ. ni. 5.1851]"
      },
      ", dhammā bhāvitā bahulīkatā sotāpattiphalasacchikiriyāya saṃvattanti. Katame cattāro? Sappurisasaṃsevo, saddhammassavanaṃ, yonisomanasikāro, dhammānudhammapaṭipatti – ime kho, bhikkhave, cattāro dhammā bhāvitā bahulīkatā sotāpattiphalasacchikiriyāya saṃvattanti."
    ],
    "innerText": "3. ‘‘Cattārome , bhikkhave [saṃ. ni. 5.1851], dhammā bhāvitā bahulīkatā sotāpattiphalasacchikiriyāya saṃvattanti. Katame cattāro? Sappurisasaṃsevo, saddhammassavanaṃ, yonisomanasikāro, dhammānudhammapaṭipatti – ime kho, bhikkhave, cattāro dhammā bhāvitā bahulīkatā sotāpattiphalasacchikiriyāya saṃvattanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Cattārome, bhikkhave, dhammā bhāvitā bahulīkatā sakadāgāmiphalasacchikiriyāya saṃvattanti…pe… anāgāmiphalasacchikiriyāya saṃvattanti…pe… arahattaphalasacchikiriyāya saṃvattanti. Katame cattāro? Sappurisasaṃsevo, saddhammassavanaṃ, yonisomanasikāro, dhammānudhammapaṭipatti – ime kho, bhikkhave, cattāro dhammā bhāvitā bahulīkatā arahattamaggaphalasacchikiriyāya saṃvattanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Cattārome ",
      ", bhikkhave, dhammā bhāvitā bahulīkatā paññāpaṭilābhāya ",
      " saṃvattanti…pe… paññābuddhiyā saṃvattanti, paññāvepullāya saṃvattanti, mahāpaññatāya saṃvattanti, puthupaññatāya saṃvattanti, vipulapaññatāya saṃvattanti, gambhīrapaññatāya saṃvattanti, asāmantapaññatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[assāmantapaññatāya (syā.) saṃ. ni. 3 passitabbā]"
      },
      " saṃvattanti, bhūripaññatāya saṃvattanti, paññābāhullāya saṃvattanti, sīghapaññatāya saṃvattanti, lahupaññatāya saṃvattanti, hāsapaññatāya saṃvattanti, javanapaññatāya saṃvattanti, tikkhapaññatāya saṃvattanti, nibbedhikapaññatāya saṃvattanti. Katame cattāro? Sappurisasaṃsevo, saddhammassavanaṃ, yonisomanasikāro, dhammānudhammapaṭipatti – ime kho, bhikkhave, cattāro dhammā bhāvitā bahulīkatā paññāpaṭilābhāya saṃvattanti, paññābuddhiyā saṃvattanti…pe… nibbedhikapaññatāya saṃvattanti’’."
    ],
    "innerText": "‘‘Cattārome , bhikkhave, dhammā bhāvitā bahulīkatā paññāpaṭilābhāya saṃvattanti…pe… paññābuddhiyā saṃvattanti, paññāvepullāya saṃvattanti, mahāpaññatāya saṃvattanti, puthupaññatāya saṃvattanti, vipulapaññatāya saṃvattanti, gambhīrapaññatāya saṃvattanti, asāmantapaññatāya [assāmantapaññatāya (syā.) saṃ. ni. 3 passitabbā] saṃvattanti, bhūripaññatāya saṃvattanti, paññābāhullāya saṃvattanti, sīghapaññatāya saṃvattanti, lahupaññatāya saṃvattanti, hāsapaññatāya saṃvattanti, javanapaññatāya saṃvattanti, tikkhapaññatāya saṃvattanti, nibbedhikapaññatāya saṃvattanti. Katame cattāro? Sappurisasaṃsevo, saddhammassavanaṃ, yonisomanasikāro, dhammānudhammapaṭipatti – ime kho, bhikkhave, cattāro dhammā bhāvitā bahulīkatā paññāpaṭilābhāya saṃvattanti, paññābuddhiyā saṃvattanti…pe… nibbedhikapaññatāya saṃvattanti’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Soḷasapaññāniddeso"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "4"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññāpaṭilābhāya saṃvattantī"
      },
      "ti katamo paññāpaṭilābho? Catunnaṃ maggañāṇānaṃ, catunnaṃ phalañāṇānaṃ, catunnaṃ paṭisambhidāñāṇānaṃ, channaṃ abhiññāñāṇānaṃ, tesattatīnaṃ ñāṇānaṃ, sattasattatīnaṃ ñāṇānaṃ lābho paṭilābho patti sampatti phassanā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[phusanā (ka.)]"
      },
      " sacchikiriyā upasampadā. Paññāpaṭilābhāya saṃvattantīti – ayaṃ paññā paṭilābho."
    ],
    "innerText": "4.Paññāpaṭilābhāya saṃvattantīti katamo paññāpaṭilābho? Catunnaṃ maggañāṇānaṃ, catunnaṃ phalañāṇānaṃ, catunnaṃ paṭisambhidāñāṇānaṃ, channaṃ abhiññāñāṇānaṃ, tesattatīnaṃ ñāṇānaṃ, sattasattatīnaṃ ñāṇānaṃ lābho paṭilābho patti sampatti phassanā [phusanā (ka.)] sacchikiriyā upasampadā. Paññāpaṭilābhāya saṃvattantīti – ayaṃ paññā paṭilābho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññābuddhiyā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṃvattantī"
      },
      "ti katamā paññābuddhi? Sattannañca sekkhānaṃ puthujjanakalyāṇakassa ca paññā vaḍḍhati, arahato paññā vaḍḍhati. Vaḍḍhitavaḍḍhanā paññābuddhiyā saṃvattantīti – ayaṃ ",
      " paññābuddhi."
    ],
    "innerText": "Paññābuddhiyāsaṃvattantīti katamā paññābuddhi? Sattannañca sekkhānaṃ puthujjanakalyāṇakassa ca paññā vaḍḍhati, arahato paññā vaḍḍhati. Vaḍḍhitavaḍḍhanā paññābuddhiyā saṃvattantīti – ayaṃ paññābuddhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññāvepullāya saṃvattantī"
      },
      "ti katamaṃ paññāvepullaṃ? Sattannaṃ sekkhānaṃ puthujjanakalyāṇakassa ca paññāvepullaṃ gacchati. Arahato paññā vepullagatā paññāvepullāya saṃvattantīti – idaṃ paññāvepullaṃ."
    ],
    "innerText": "Paññāvepullāya saṃvattantīti katamaṃ paññāvepullaṃ? Sattannaṃ sekkhānaṃ puthujjanakalyāṇakassa ca paññāvepullaṃ gacchati. Arahato paññā vepullagatā paññāvepullāya saṃvattantīti – idaṃ paññāvepullaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahāpaññatāya saṃvattantī"
      },
      "ti katamā mahāpaññā? Mahante atthe pariggaṇhātīti – mahāpaññā. Mahante dhamme pariggaṇhātīti – mahāpaññā. Mahantā niruttiyo pariggaṇhātīti – mahāpaññā. Mahantāni paṭibhānāni pariggaṇhātīti – mahāpaññā. Mahante sīlakkhandhe pariggaṇhātīti – mahāpaññā. Mahante samādhikkhandhe pariggaṇhātīti – mahāpaññā. Mahante paññākkhandhe pariggaṇhātīti ",
      " – mahāpaññā. Mahante vimuttikkhandhe pariggaṇhātīti – mahāpaññā ",
      ". Mahante vimuttiñāṇadassanakkhandhe pariggaṇhātīti – mahāpaññā. Mahantāni ṭhānāṭṭhānāni pariggaṇhātīti – mahāpaññā. Mahantā vihārasamāpattiyo pariggaṇhātīti – mahāpaññā. Mahantāni ariyasaccāni pariggaṇhātīti – mahāpaññā. Mahante satipaṭṭhāne pariggaṇhātīti – mahāpaññā. Mahante sammappadhāne pariggaṇhātīti – mahāpaññā. Mahante iddhipāde pariggaṇhātīti – mahāpaññā. Mahantāni indriyāni pariggaṇhātīti – mahāpaññā. Mahantāni balāni pariggaṇhātīti – mahāpaññā. Mahante bojjhaṅge pariggaṇhātīti ",
      " – mahāpaññā. Mahantaṃ ariyamaggaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mahante ariyamagge (ka.)]"
      },
      " pariggaṇhātīti – mahāpaññā. Mahantāni sāmaññaphalāni pariggaṇhātīti – mahāpaññā. Mahantā abhiññāyo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mahābhiññāyo (ka.)]"
      },
      " pariggaṇhātīti – mahāpaññā. Mahantaṃ paramatthaṃ ",
      " nibbānaṃ pariggaṇhātīti – mahāpaññā. Mahāpaññatāya saṃvattantīti – ayaṃ mahāpaññā."
    ],
    "innerText": "Mahāpaññatāya saṃvattantīti katamā mahāpaññā? Mahante atthe pariggaṇhātīti – mahāpaññā. Mahante dhamme pariggaṇhātīti – mahāpaññā. Mahantā niruttiyo pariggaṇhātīti – mahāpaññā. Mahantāni paṭibhānāni pariggaṇhātīti – mahāpaññā. Mahante sīlakkhandhe pariggaṇhātīti – mahāpaññā. Mahante samādhikkhandhe pariggaṇhātīti – mahāpaññā. Mahante paññākkhandhe pariggaṇhātīti – mahāpaññā. Mahante vimuttikkhandhe pariggaṇhātīti – mahāpaññā . Mahante vimuttiñāṇadassanakkhandhe pariggaṇhātīti – mahāpaññā. Mahantāni ṭhānāṭṭhānāni pariggaṇhātīti – mahāpaññā. Mahantā vihārasamāpattiyo pariggaṇhātīti – mahāpaññā. Mahantāni ariyasaccāni pariggaṇhātīti – mahāpaññā. Mahante satipaṭṭhāne pariggaṇhātīti – mahāpaññā. Mahante sammappadhāne pariggaṇhātīti – mahāpaññā. Mahante iddhipāde pariggaṇhātīti – mahāpaññā. Mahantāni indriyāni pariggaṇhātīti – mahāpaññā. Mahantāni balāni pariggaṇhātīti – mahāpaññā. Mahante bojjhaṅge pariggaṇhātīti – mahāpaññā. Mahantaṃ ariyamaggaṃ [mahante ariyamagge (ka.)] pariggaṇhātīti – mahāpaññā. Mahantāni sāmaññaphalāni pariggaṇhātīti – mahāpaññā. Mahantā abhiññāyo [mahābhiññāyo (ka.)] pariggaṇhātīti – mahāpaññā. Mahantaṃ paramatthaṃ nibbānaṃ pariggaṇhātīti – mahāpaññā. Mahāpaññatāya saṃvattantīti – ayaṃ mahāpaññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puthupaññatāya saṃvattantī"
      },
      "ti katamā puthupaññā? Puthunānākhandhesu ñāṇaṃ pavattatīti – puthupaññā. Puthunānādhātūsu ñāṇaṃ pavattatīti – puthupaññā. Puthunānāāyatanesu ñāṇaṃ pavattatīti – puthupaññā. Puthunānāpaṭiccasamuppādesu ñāṇaṃ pavattatīti – puthupaññā. Puthunānāsuññatamanupalabbhesu ñāṇaṃ pavattatīti – puthupaññā. Puthunānāatthesu ñāṇaṃ pavattatīti – puthupaññā. Puthunānādhammesu ñāṇaṃ pavattatīti – puthupaññā. Puthunānāniruttīsu ñāṇaṃ pavattatīti – puthupaññā. Puthunānāpaṭibhānesu ñāṇaṃ pavattatīti – puthupaññā. Puthunānāsīlakkhandhesu ñāṇaṃ pavattatīti – puthupaññā. Puthunānāsamādhikkhandhesu ñāṇaṃ pavattatīti – puthupaññā. Puthunānāpaññākkhandhesu ñāṇaṃ pavattatīti – puthupaññā. Puthunānāvimuttikkhandhesu ñāṇaṃ pavattatīti – puthupaññā. Puthunānāvimuttiñāṇadassanakkhandhesu ñāṇaṃ pavattatīti – puthupaññā. Puthunānāṭhānāṭṭhānesu ñāṇaṃ pavattatīti – puthupaññā. Puthunānāvihārasamāpattīsu ñāṇaṃ pavattatīti – puthupaññā. Puthunānāariyasaccesu ñāṇaṃ pavattatīti ",
      " – puthupaññā. Puthunānāsatipaṭṭhānesu ñāṇaṃ pavattatīti – puthupaññā. Puthunānāsammappadhānesu ñāṇaṃ pavattatīti – puthupaññā. Puthunānāiddhipādesu ñāṇaṃ pavattatīti – puthupaññā. Puthunānāindriyesu ñāṇaṃ pavattatīti – puthupaññā. Puthunānābalesu ñāṇaṃ pavattatīti ",
      " – puthupaññā. Puthunānābojjhaṅgesu ñāṇaṃ pavattatīti – puthupaññā. Puthunānāariyamaggesu ñāṇaṃ pavattatīti – puthupaññā. Puthunānāsāmaññaphalesu ñāṇaṃ pavattatīti – puthupaññā. Puthunānāabhiññāsu ñāṇaṃ pavattatīti – puthupaññā. Puthujjanasādhāraṇe dhamme atikkamma ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[samatikkamma (syā.)]"
      },
      " paramatthe nibbāne ñāṇaṃ pavattatīti – puthupaññā. Puthupaññatāya saṃvattantīti – ayaṃ puthupaññā."
    ],
    "innerText": "Puthupaññatāya saṃvattantīti katamā puthupaññā? Puthunānākhandhesu ñāṇaṃ pavattatīti – puthupaññā. Puthunānādhātūsu ñāṇaṃ pavattatīti – puthupaññā. Puthunānāāyatanesu ñāṇaṃ pavattatīti – puthupaññā. Puthunānāpaṭiccasamuppādesu ñāṇaṃ pavattatīti – puthupaññā. Puthunānāsuññatamanupalabbhesu ñāṇaṃ pavattatīti – puthupaññā. Puthunānāatthesu ñāṇaṃ pavattatīti – puthupaññā. Puthunānādhammesu ñāṇaṃ pavattatīti – puthupaññā. Puthunānāniruttīsu ñāṇaṃ pavattatīti – puthupaññā. Puthunānāpaṭibhānesu ñāṇaṃ pavattatīti – puthupaññā. Puthunānāsīlakkhandhesu ñāṇaṃ pavattatīti – puthupaññā. Puthunānāsamādhikkhandhesu ñāṇaṃ pavattatīti – puthupaññā. Puthunānāpaññākkhandhesu ñāṇaṃ pavattatīti – puthupaññā. Puthunānāvimuttikkhandhesu ñāṇaṃ pavattatīti – puthupaññā. Puthunānāvimuttiñāṇadassanakkhandhesu ñāṇaṃ pavattatīti – puthupaññā. Puthunānāṭhānāṭṭhānesu ñāṇaṃ pavattatīti – puthupaññā. Puthunānāvihārasamāpattīsu ñāṇaṃ pavattatīti – puthupaññā. Puthunānāariyasaccesu ñāṇaṃ pavattatīti – puthupaññā. Puthunānāsatipaṭṭhānesu ñāṇaṃ pavattatīti – puthupaññā. Puthunānāsammappadhānesu ñāṇaṃ pavattatīti – puthupaññā. Puthunānāiddhipādesu ñāṇaṃ pavattatīti – puthupaññā. Puthunānāindriyesu ñāṇaṃ pavattatīti – puthupaññā. Puthunānābalesu ñāṇaṃ pavattatīti – puthupaññā. Puthunānābojjhaṅgesu ñāṇaṃ pavattatīti – puthupaññā. Puthunānāariyamaggesu ñāṇaṃ pavattatīti – puthupaññā. Puthunānāsāmaññaphalesu ñāṇaṃ pavattatīti – puthupaññā. Puthunānāabhiññāsu ñāṇaṃ pavattatīti – puthupaññā. Puthujjanasādhāraṇe dhamme atikkamma [samatikkamma (syā.)] paramatthe nibbāne ñāṇaṃ pavattatīti – puthupaññā. Puthupaññatāya saṃvattantīti – ayaṃ puthupaññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vipulapaññatāya"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṃvattantī"
      },
      "ti katamā vipulapaññā? Vipule ",
      " atthe pariggaṇhātīti – vipulapaññā. Vipule dhamme pariggaṇhātīti – vipulapaññā. Vipulā niruttiyo pariggaṇhātīti – vipulapaññā. Vipulāni paṭibhānāni pariggaṇhātīti – vipulapaññā. Vipule sīlakkhandhe pariggaṇhātīti – vipulapaññā. Vipule samādhikkhandhe pariggaṇhātīti – vipulapaññā. Vipule paññākkhandhe pariggaṇhātīti – vipulapaññā. Vipule vimuttikkhandhe pariggaṇhātīti – vipulapaññā. Vipule vimuttiñāṇadassanakkhandhe pariggaṇhātīti – vipulapaññā. Vipulāni ṭhānāṭṭhānāni pariggaṇhātīti – vipulapaññā. Vipulā vihārasamāpattiyo pariggaṇhātīti – vipulapaññā. Vipulāni ariyasaccāni ",
      " pariggaṇhātīti – vipulapaññā. Vipule satipaṭṭhāne pariggaṇhātīti – vipulapaññā. Vipule sammappadhāne pariggaṇhātīti – vipulapaññā. Vipule iddhipāde pariggaṇhātīti – vipulapaññā. Vipulāni indriyāni pariggaṇhātīti – vipulapaññā. Vipulāni balāni pariggaṇhātīti – vipulapaññā. Vipule bojjhaṅge pariggaṇhātīti – vipulapaññā. Vipule ariyamagge pariggaṇhātīti – vipulapaññā. Vipulāni sāmaññaphalāni pariggaṇhātīti – vipulapaññā. Vipulā abhiññāyo pariggaṇhātīti – vipulapaññā. Vipulaṃ paramatthaṃ nibbānaṃ pariggaṇhātīti – vipulapaññā. Vipulapaññatāya saṃvattantīti – ayaṃ vipulapaññā."
    ],
    "innerText": "Vipulapaññatāyasaṃvattantīti katamā vipulapaññā? Vipule atthe pariggaṇhātīti – vipulapaññā. Vipule dhamme pariggaṇhātīti – vipulapaññā. Vipulā niruttiyo pariggaṇhātīti – vipulapaññā. Vipulāni paṭibhānāni pariggaṇhātīti – vipulapaññā. Vipule sīlakkhandhe pariggaṇhātīti – vipulapaññā. Vipule samādhikkhandhe pariggaṇhātīti – vipulapaññā. Vipule paññākkhandhe pariggaṇhātīti – vipulapaññā. Vipule vimuttikkhandhe pariggaṇhātīti – vipulapaññā. Vipule vimuttiñāṇadassanakkhandhe pariggaṇhātīti – vipulapaññā. Vipulāni ṭhānāṭṭhānāni pariggaṇhātīti – vipulapaññā. Vipulā vihārasamāpattiyo pariggaṇhātīti – vipulapaññā. Vipulāni ariyasaccāni pariggaṇhātīti – vipulapaññā. Vipule satipaṭṭhāne pariggaṇhātīti – vipulapaññā. Vipule sammappadhāne pariggaṇhātīti – vipulapaññā. Vipule iddhipāde pariggaṇhātīti – vipulapaññā. Vipulāni indriyāni pariggaṇhātīti – vipulapaññā. Vipulāni balāni pariggaṇhātīti – vipulapaññā. Vipule bojjhaṅge pariggaṇhātīti – vipulapaññā. Vipule ariyamagge pariggaṇhātīti – vipulapaññā. Vipulāni sāmaññaphalāni pariggaṇhātīti – vipulapaññā. Vipulā abhiññāyo pariggaṇhātīti – vipulapaññā. Vipulaṃ paramatthaṃ nibbānaṃ pariggaṇhātīti – vipulapaññā. Vipulapaññatāya saṃvattantīti – ayaṃ vipulapaññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gambhīrapaññatāya saṃvattantī"
      },
      "ti katamā gambhīrapaññā? Gambhīresu khandhesu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīrāsu dhātūsu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīresu āyatanesu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīresu paṭiccasamuppādesu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīresu suññatamanupalabbhesu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīresu atthesu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīresu dhammesu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīrāsu niruttīsu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīresu paṭibhānesu ñāṇaṃ pavattatīti ",
      " – gambhīrapaññā. Gambhīresu sīlakkhandhesu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīresu samādhikkhandhesu ñāṇaṃ ",
      " pavattatīti – gambhīrapaññā ",
      ". Gambhīresu paññākkhandhesu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīresu vimuttikkhandhesu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīresu vimuttiñāṇadassanakkhandhesu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīresu ṭhānāṭṭhānesu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīrāsu vihārasamāpattīsu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīresu ariyasaccesu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīresu satipaṭṭhānesu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīresu sammappadhānesu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīresu iddhipādesu ñāṇaṃ pavattatīti ",
      " – gambhīrapaññā. Gambhīresu indriyesu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīresu balesu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīresu bojjhaṅgesu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīresu ariyamaggesu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīresu sāmaññaphalesu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīrāsu abhiññāsu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīre paramatthe nibbāne ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīrapaññatāya saṃvattantīti – ayaṃ gambhīrapaññā."
    ],
    "innerText": "Gambhīrapaññatāya saṃvattantīti katamā gambhīrapaññā? Gambhīresu khandhesu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīrāsu dhātūsu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīresu āyatanesu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīresu paṭiccasamuppādesu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīresu suññatamanupalabbhesu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīresu atthesu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīresu dhammesu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīrāsu niruttīsu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīresu paṭibhānesu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīresu sīlakkhandhesu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīresu samādhikkhandhesu ñāṇaṃ pavattatīti – gambhīrapaññā . Gambhīresu paññākkhandhesu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīresu vimuttikkhandhesu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīresu vimuttiñāṇadassanakkhandhesu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīresu ṭhānāṭṭhānesu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīrāsu vihārasamāpattīsu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīresu ariyasaccesu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīresu satipaṭṭhānesu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīresu sammappadhānesu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīresu iddhipādesu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīresu indriyesu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīresu balesu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīresu bojjhaṅgesu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīresu ariyamaggesu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīresu sāmaññaphalesu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīrāsu abhiññāsu ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīre paramatthe nibbāne ñāṇaṃ pavattatīti – gambhīrapaññā. Gambhīrapaññatāya saṃvattantīti – ayaṃ gambhīrapaññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asāmantapaññatāya saṃvattantī"
      },
      "ti katamā asāmantapaññā? Yassa puggalassa atthavavatthānato atthapaṭisambhidā adhigatā hoti sacchikatā phassitā paññāya, dhammavavatthānato dhammapaṭisambhidā ",
      " adhigatā hoti sacchikatā phassitā paññāya, niruttivavatthānato niruttipaṭisambhidā adhigatā hoti sacchikatā phassitā paññāya, paṭibhānavavatthānato paṭibhānapaṭisambhidā adhigatā hoti sacchikatā phassitā paññāya, tassa atthe ca dhamme ca niruttiyā ca paṭibhāne ca na añño koci sakkoti abhisambhavituṃ. Anabhisambhavanīyo ca so aññehīti – asāmantapañño."
    ],
    "innerText": "Asāmantapaññatāya saṃvattantīti katamā asāmantapaññā? Yassa puggalassa atthavavatthānato atthapaṭisambhidā adhigatā hoti sacchikatā phassitā paññāya, dhammavavatthānato dhammapaṭisambhidā adhigatā hoti sacchikatā phassitā paññāya, niruttivavatthānato niruttipaṭisambhidā adhigatā hoti sacchikatā phassitā paññāya, paṭibhānavavatthānato paṭibhānapaṭisambhidā adhigatā hoti sacchikatā phassitā paññāya, tassa atthe ca dhamme ca niruttiyā ca paṭibhāne ca na añño koci sakkoti abhisambhavituṃ. Anabhisambhavanīyo ca so aññehīti – asāmantapañño."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Puthujjanakalyāṇakassa paññā aṭṭhamakassa paññāya dūre vidūre suvidūre na santike na sāmantā. Puthujjanakalyāṇakaṃ upādāya aṭṭhamako asāmantapañño. Aṭṭhamakassa paññā sotāpannassa paññāya dūre vidūre suvidūre na santike ",
      " na sāmantā. Aṭṭhamakaṃ upādāya sotāpanno asāmantapañño. Sotāpannassa paññā sakadāgāmissa paññāya dūre vidūre suvidūre na santike na sāmantā. Sotāpannaṃ upādāya sakadāgāmi asāmantapañño. Sakadāgāmissa paññā anāgāmissa paññāya dūre ",
      " vidūre suvidūre na santike na sāmantā. Sakadāgāmiṃ upādāya anāgāmī asāmantapañño. Anāgāmissa paññā arahato paññāya dūre vidūre suvidūre na santike na sāmantā. Anāgāmiṃ upādāya arahā asāmantapañño. Arahato paññā paccekasambuddhassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[paccekabuddhassa (syā. ka.) aṭṭhakathā oloketabbā]"
      },
      " paññāya dūre vidūre suvidūre na santike na sāmantā. Arahantaṃ upādāya paccekabuddho asāmantapañño. Paccekabuddhañca sadevakañca lokaṃ upādāya tathāgato arahaṃ sammāsambuddho aggo ",
      " asāmantapañño."
    ],
    "innerText": "Puthujjanakalyāṇakassa paññā aṭṭhamakassa paññāya dūre vidūre suvidūre na santike na sāmantā. Puthujjanakalyāṇakaṃ upādāya aṭṭhamako asāmantapañño. Aṭṭhamakassa paññā sotāpannassa paññāya dūre vidūre suvidūre na santike na sāmantā. Aṭṭhamakaṃ upādāya sotāpanno asāmantapañño. Sotāpannassa paññā sakadāgāmissa paññāya dūre vidūre suvidūre na santike na sāmantā. Sotāpannaṃ upādāya sakadāgāmi asāmantapañño. Sakadāgāmissa paññā anāgāmissa paññāya dūre vidūre suvidūre na santike na sāmantā. Sakadāgāmiṃ upādāya anāgāmī asāmantapañño. Anāgāmissa paññā arahato paññāya dūre vidūre suvidūre na santike na sāmantā. Anāgāmiṃ upādāya arahā asāmantapañño. Arahato paññā paccekasambuddhassa [paccekabuddhassa (syā. ka.) aṭṭhakathā oloketabbā] paññāya dūre vidūre suvidūre na santike na sāmantā. Arahantaṃ upādāya paccekabuddho asāmantapañño. Paccekabuddhañca sadevakañca lokaṃ upādāya tathāgato arahaṃ sammāsambuddho aggo asāmantapañño."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "5"
      },
      ". Paññāpabhedakusalo pabhinnañāṇo adhigatappaṭisambhido catuvesārajjappatto dasabaladhārī purisāsabho purisasīho purisanāgo purisājañño purisadhorayho anantañāṇo anantatejo anantayaso aḍḍho mahaddhano dhanavā netā vinetā anunetā paññāpetā nijjhāpetā pekkhetā ",
      " pasādetā. So hi bhagavā anuppannassa maggassa uppādetā, asañjātassa maggassa sañjanetā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sañjānetā (syā.)]"
      },
      ", anakkhātassa maggassa akkhātā, maggaññū maggavidū maggakovido maggānugāmī ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[maggānugā (syā.) mahāni. 69 passitabbo]"
      },
      " ca panassa etarahi sāvakā viharanti pacchā samannāgatā."
    ],
    "innerText": "5. Paññāpabhedakusalo pabhinnañāṇo adhigatappaṭisambhido catuvesārajjappatto dasabaladhārī purisāsabho purisasīho purisanāgo purisājañño purisadhorayho anantañāṇo anantatejo anantayaso aḍḍho mahaddhano dhanavā netā vinetā anunetā paññāpetā nijjhāpetā pekkhetā pasādetā. So hi bhagavā anuppannassa maggassa uppādetā, asañjātassa maggassa sañjanetā [sañjānetā (syā.)], anakkhātassa maggassa akkhātā, maggaññū maggavidū maggakovido maggānugāmī [maggānugā (syā.) mahāni. 69 passitabbo] ca panassa etarahi sāvakā viharanti pacchā samannāgatā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "So hi bhagavā jānaṃ jānāti, passaṃ passati, cakkhubhūto ñāṇabhūto dhammabhūto brahmabhūto vattā pavattā atthassa ninnetā amatassa dātā dhammassāmī tathāgato. Natthi tassa bhagavato aññātaṃ adiṭṭhaṃ aviditaṃ asacchikataṃ aphassitaṃ paññāya. Atītaṃ anāgataṃ paccuppannaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[atītānāgatapaccuppannaṃ (syā.) mahāni. 69]"
      },
      " upādāya sabbe dhammā sabbākārena buddhassa bhagavato ñāṇamukhe āpāthaṃ āgacchanti. Yaṃ kiñci neyyaṃ nāma atthi taṃ sabbaṃ jānitabbaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sabbaṃ dhammaṃ jānitabbaṃ (ka.)]"
      },
      ". Attattho vā parattho vā ubhayattho vā diṭṭhadhammiko vā attho samparāyiko vā attho uttāno vā attho gambhīro ",
      " vā attho gūḷho vā attho paṭicchanno vā attho neyyo vā attho nīto vā attho anavajjo vā attho nikkileso vā attho vodāno vā attho paramattho vā attho, sabbaṃ taṃ antobuddhañāṇe parivattati."
    ],
    "innerText": "So hi bhagavā jānaṃ jānāti, passaṃ passati, cakkhubhūto ñāṇabhūto dhammabhūto brahmabhūto vattā pavattā atthassa ninnetā amatassa dātā dhammassāmī tathāgato. Natthi tassa bhagavato aññātaṃ adiṭṭhaṃ aviditaṃ asacchikataṃ aphassitaṃ paññāya. Atītaṃ anāgataṃ paccuppannaṃ [atītānāgatapaccuppannaṃ (syā.) mahāni. 69] upādāya sabbe dhammā sabbākārena buddhassa bhagavato ñāṇamukhe āpāthaṃ āgacchanti. Yaṃ kiñci neyyaṃ nāma atthi taṃ sabbaṃ jānitabbaṃ [sabbaṃ dhammaṃ jānitabbaṃ (ka.)]. Attattho vā parattho vā ubhayattho vā diṭṭhadhammiko vā attho samparāyiko vā attho uttāno vā attho gambhīro vā attho gūḷho vā attho paṭicchanno vā attho neyyo vā attho nīto vā attho anavajjo vā attho nikkileso vā attho vodāno vā attho paramattho vā attho, sabbaṃ taṃ antobuddhañāṇe parivattati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sabbaṃ ",
      " kāyakammaṃ buddhassa bhagavato ñāṇānuparivatti ",
      ". Sabbaṃ vacīkammaṃ buddhassa bhagavato ñāṇānuparivatti. Sabbaṃ manokammaṃ buddhassa bhagavato ñāṇānuparivatti. Atīte buddhassa bhagavato appaṭihataṃ ñāṇaṃ. Anāgate buddhassa bhagavato appaṭihataṃ ñāṇaṃ. Paccuppanne buddhassa bhagavato appaṭihataṃ ñāṇaṃ. Yāvatakaṃ neyyaṃ tāvatakaṃ ñāṇaṃ, yāvatakaṃ ñāṇaṃ tāvatakaṃ neyyaṃ. Neyyapariyantikaṃ ñāṇaṃ, ñāṇapariyantikaṃ neyyaṃ. Neyyaṃ atikkamitvā ñāṇaṃ nappavattati. Ñāṇaṃ atikkamitvā neyyapatho natthi. Aññamaññapariyantaṭṭhāyino te dhammā. Yathā dvinnaṃ samuggapaṭalānaṃ sammā phusitānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[suphussitānaṃ (syā. ka.)]"
      },
      " heṭṭhimaṃ samuggapaṭalaṃ uparimaṃ nātivattati, uparimaṃ samuggapaṭalaṃ heṭṭhimaṃ nātivattati, aññamaññapariyantaṭṭhāyino; evameva buddhassa bhagavato neyyañca ñāṇañca aññamaññapariyantaṭṭhāyino. Yāvatakaṃ neyyaṃ tāvatakaṃ ñāṇaṃ, yāvatakaṃ ñāṇaṃ tāvatakaṃ neyyaṃ. Neyyapariyantikaṃ ñāṇaṃ, ñāṇapariyantikaṃ neyyaṃ. Neyyaṃ atikkamitvā ñāṇaṃ nappavattati. Ñāṇaṃ atikkamitvā neyyapatho natthi. Aññamaññapariyantaṭṭhāyino te dhammā. Sabbadhammesu buddhassa bhagavato ñāṇaṃ pavattati."
    ],
    "innerText": "Sabbaṃ kāyakammaṃ buddhassa bhagavato ñāṇānuparivatti . Sabbaṃ vacīkammaṃ buddhassa bhagavato ñāṇānuparivatti. Sabbaṃ manokammaṃ buddhassa bhagavato ñāṇānuparivatti. Atīte buddhassa bhagavato appaṭihataṃ ñāṇaṃ. Anāgate buddhassa bhagavato appaṭihataṃ ñāṇaṃ. Paccuppanne buddhassa bhagavato appaṭihataṃ ñāṇaṃ. Yāvatakaṃ neyyaṃ tāvatakaṃ ñāṇaṃ, yāvatakaṃ ñāṇaṃ tāvatakaṃ neyyaṃ. Neyyapariyantikaṃ ñāṇaṃ, ñāṇapariyantikaṃ neyyaṃ. Neyyaṃ atikkamitvā ñāṇaṃ nappavattati. Ñāṇaṃ atikkamitvā neyyapatho natthi. Aññamaññapariyantaṭṭhāyino te dhammā. Yathā dvinnaṃ samuggapaṭalānaṃ sammā phusitānaṃ [suphussitānaṃ (syā. ka.)] heṭṭhimaṃ samuggapaṭalaṃ uparimaṃ nātivattati, uparimaṃ samuggapaṭalaṃ heṭṭhimaṃ nātivattati, aññamaññapariyantaṭṭhāyino; evameva buddhassa bhagavato neyyañca ñāṇañca aññamaññapariyantaṭṭhāyino. Yāvatakaṃ neyyaṃ tāvatakaṃ ñāṇaṃ, yāvatakaṃ ñāṇaṃ tāvatakaṃ neyyaṃ. Neyyapariyantikaṃ ñāṇaṃ, ñāṇapariyantikaṃ neyyaṃ. Neyyaṃ atikkamitvā ñāṇaṃ nappavattati. Ñāṇaṃ atikkamitvā neyyapatho natthi. Aññamaññapariyantaṭṭhāyino te dhammā. Sabbadhammesu buddhassa bhagavato ñāṇaṃ pavattati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sabbe dhammā buddhassa bhagavato āvajjanappaṭibaddhā ākaṅkhappaṭibaddhā manasikārappaṭibaddhā cittuppādappaṭibaddhā. Sabbasattesu buddhassa bhagavato ñāṇaṃ pavattati. Sabbesaṃ sattānaṃ buddho āsayaṃ jānāti, anusayaṃ jānāti, caritaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[cariyaṃ (syā.) mahāni. 69 passitabbā]"
      },
      " jānāti, adhimuttiṃ jānāti ",
      ". Apparajakkhe mahārajakkhe tikkhindriye mudindriye svākāre ",
      " dvākāre suviññāpaye duviññāpaye bhabbābhabbe satte pajānāti. Sadevako loko samārako sabrahmako sassamaṇabrāhmaṇī pajā sadevamanussā antobuddhañāṇe parivattati."
    ],
    "innerText": "Sabbe dhammā buddhassa bhagavato āvajjanappaṭibaddhā ākaṅkhappaṭibaddhā manasikārappaṭibaddhā cittuppādappaṭibaddhā. Sabbasattesu buddhassa bhagavato ñāṇaṃ pavattati. Sabbesaṃ sattānaṃ buddho āsayaṃ jānāti, anusayaṃ jānāti, caritaṃ [cariyaṃ (syā.) mahāni. 69 passitabbā] jānāti, adhimuttiṃ jānāti . Apparajakkhe mahārajakkhe tikkhindriye mudindriye svākāre dvākāre suviññāpaye duviññāpaye bhabbābhabbe satte pajānāti. Sadevako loko samārako sabrahmako sassamaṇabrāhmaṇī pajā sadevamanussā antobuddhañāṇe parivattati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yathā ye keci macchakacchapā, antamaso ",
      " timitimiṅgalaṃ upādāya, antomahāsamudde parivattanti, evamevaṃ sadevako loko samārako sabrahmako sassamaṇabrāhmaṇī pajā sadevamanussā antobuddhañāṇe parivattati. Yathā ye keci pakkhino, antamaso garuḷaṃ venateyyaṃ upādāya, ākāsassa padese parivattanti; evameva yepi te sāriputtasamā paññāya tepi buddhañāṇassa padese parivattanti. Buddhañāṇaṃ devamanussānaṃ ",
      " paññaṃ pharitvā atighaṃsitvā tiṭṭhati. Yepi te khattiyapaṇḍitā brāhmaṇapaṇḍitā gahapatipaṇḍitā samaṇapaṇḍitā nipuṇā kataparappavādā vālavedhirūpā vobhindantā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[te bhindantā (syā. ka.)]"
      },
      " maññe caranti paññāgatena diṭṭhigatāni, te pañhaṃ abhisaṅkharitvā abhisaṅkharitvā tathāgataṃ upasaṅkamitvā pucchanti gūḷhāni ca paṭicchannāni ca, kathitā visajjitā ca te pañhā bhagavatā honti niddiṭṭhakāraṇā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[niddiṭṭhikāraṇā (syā.)]"
      },
      ". Upakkhittakā ca te bhagavato sampajjanti. Atha kho bhagavā tattha atirocati yadidaṃ paññāyāti. Aggo asāmantapañño, asāmantapaññatāya saṃvattantīti – ayaṃ asāmantapaññā."
    ],
    "innerText": "Yathā ye keci macchakacchapā, antamaso timitimiṅgalaṃ upādāya, antomahāsamudde parivattanti, evamevaṃ sadevako loko samārako sabrahmako sassamaṇabrāhmaṇī pajā sadevamanussā antobuddhañāṇe parivattati. Yathā ye keci pakkhino, antamaso garuḷaṃ venateyyaṃ upādāya, ākāsassa padese parivattanti; evameva yepi te sāriputtasamā paññāya tepi buddhañāṇassa padese parivattanti. Buddhañāṇaṃ devamanussānaṃ paññaṃ pharitvā atighaṃsitvā tiṭṭhati. Yepi te khattiyapaṇḍitā brāhmaṇapaṇḍitā gahapatipaṇḍitā samaṇapaṇḍitā nipuṇā kataparappavādā vālavedhirūpā vobhindantā [te bhindantā (syā. ka.)] maññe caranti paññāgatena diṭṭhigatāni, te pañhaṃ abhisaṅkharitvā abhisaṅkharitvā tathāgataṃ upasaṅkamitvā pucchanti gūḷhāni ca paṭicchannāni ca, kathitā visajjitā ca te pañhā bhagavatā honti niddiṭṭhakāraṇā [niddiṭṭhikāraṇā (syā.)]. Upakkhittakā ca te bhagavato sampajjanti. Atha kho bhagavā tattha atirocati yadidaṃ paññāyāti. Aggo asāmantapañño, asāmantapaññatāya saṃvattantīti – ayaṃ asāmantapaññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "6"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhūripaññatāya"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṃvattantī"
      },
      "ti katamā bhūripaññā? Rāgaṃ abhibhuyyatīti – bhūripaññā. Abhibhavitāti – bhūripaññā. Dosaṃ abhibhuyyatīti – bhūripaññā. Abhibhavitāti – bhūripaññā. Mohaṃ abhibhuyyatīti – bhūripaññā. Abhibhavitāti – bhūripaññā. Kodhaṃ…pe… upanāhaṃ ",
      "… makkhaṃ… paḷāsaṃ… issaṃ… macchariyaṃ… māyaṃ… sāṭheyyaṃ… thambhaṃ… sārambhaṃ… mānaṃ… atimānaṃ… madaṃ… pamādaṃ… sabbe kilese… sabbe duccarite… sabbe abhisaṅkhāre…pe… sabbe bhavagāmikamme abhibhuyyatīti – bhūripaññā. Abhibhavitāti – bhūripaññā. Rāgo ari. Taṃ ariṃ maddanipaññāti – bhūripaññā. Doso ari. Taṃ ariṃ maddanipaññāti – bhūripaññā. Moho ari. Taṃ ariṃ maddanipaññāti – bhūripaññā. Kodho…pe… upanāho… makkho… paḷāso… issā… macchariyaṃ… māyā… sāṭheyyaṃ… thambho… sārambho… māno… atimāno… mado… pamādo… sabbe kilesā… sabbe duccaritā… sabbe abhisaṅkhārā…pe… sabbe bhavagāmikammā ari. Taṃ ariṃ maddanipaññāti – bhūripaññā. Bhūri vuccati pathavī ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[paṭhavī (syā.)]"
      },
      ". Tāya pathavisamāya vitthatāya vipulāya paññāya samannāgatoti – bhūripaññā. Api ca, paññāya metaṃ adhivacanaṃ. Bhūri medhā pariṇāyikāti – bhūripaññā. Bhūripaññatāya saṃvattantīti – ayaṃ bhūripaññā."
    ],
    "innerText": "6.Bhūripaññatāyasaṃvattantīti katamā bhūripaññā? Rāgaṃ abhibhuyyatīti – bhūripaññā. Abhibhavitāti – bhūripaññā. Dosaṃ abhibhuyyatīti – bhūripaññā. Abhibhavitāti – bhūripaññā. Mohaṃ abhibhuyyatīti – bhūripaññā. Abhibhavitāti – bhūripaññā. Kodhaṃ…pe… upanāhaṃ … makkhaṃ… paḷāsaṃ… issaṃ… macchariyaṃ… māyaṃ… sāṭheyyaṃ… thambhaṃ… sārambhaṃ… mānaṃ… atimānaṃ… madaṃ… pamādaṃ… sabbe kilese… sabbe duccarite… sabbe abhisaṅkhāre…pe… sabbe bhavagāmikamme abhibhuyyatīti – bhūripaññā. Abhibhavitāti – bhūripaññā. Rāgo ari. Taṃ ariṃ maddanipaññāti – bhūripaññā. Doso ari. Taṃ ariṃ maddanipaññāti – bhūripaññā. Moho ari. Taṃ ariṃ maddanipaññāti – bhūripaññā. Kodho…pe… upanāho… makkho… paḷāso… issā… macchariyaṃ… māyā… sāṭheyyaṃ… thambho… sārambho… māno… atimāno… mado… pamādo… sabbe kilesā… sabbe duccaritā… sabbe abhisaṅkhārā…pe… sabbe bhavagāmikammā ari. Taṃ ariṃ maddanipaññāti – bhūripaññā. Bhūri vuccati pathavī [paṭhavī (syā.)]. Tāya pathavisamāya vitthatāya vipulāya paññāya samannāgatoti – bhūripaññā. Api ca, paññāya metaṃ adhivacanaṃ. Bhūri medhā pariṇāyikāti – bhūripaññā. Bhūripaññatāya saṃvattantīti – ayaṃ bhūripaññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññābāhullāya"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṃvattantī"
      },
      "ti katamaṃ paññābāhullaṃ? Idhekacco ",
      " paññāgaruko hoti paññācarito paññāsayo paññādhimutto paññādhajo paññāketu paññādhipateyyo vicayabahulo pavicayabahulo okkhāyanabahulo samokkhāyanabahulo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sampekkhāyanabahulo (syā. ka.) mahāni. 204 passitabbā]"
      },
      " sampekkhāyanadhammo vibhūtavihārī taccarito taggaruko tabbahulo tanninno tappoṇo ",
      " tappabbhāro tadadhimutto tadadhipateyyo. Yathā gaṇagaruko vuccati ‘‘gaṇabāhuliko’’ti, cīvaragaruko vuccati ‘‘cīvarabāhuliko’’ti, pattagaruko vuccati ‘‘pattabāhuliko’’ti, senāsanagaruko vuccati ‘‘senāsanabāhuliko’’ti; evamevaṃ idhekacco paññā garuko ",
      " hoti paññācarito paññāsayo paññādhimutto paññādhajo paññāketu paññādhipateyyo vicayabahulo pavicayabahulo okkhāyanabahulo samokkhāyanabahulo sampekkhāyanadhammo vibhūtavihārī taccarito taggaruko tabbahulo tanninno tappoṇo tappabbhāro tadadhimutto tadadhipateyyo. Paññābāhullāya saṃvattantīti – idaṃ paññābāhullaṃ."
    ],
    "innerText": "Paññābāhullāyasaṃvattantīti katamaṃ paññābāhullaṃ? Idhekacco paññāgaruko hoti paññācarito paññāsayo paññādhimutto paññādhajo paññāketu paññādhipateyyo vicayabahulo pavicayabahulo okkhāyanabahulo samokkhāyanabahulo [sampekkhāyanabahulo (syā. ka.) mahāni. 204 passitabbā] sampekkhāyanadhammo vibhūtavihārī taccarito taggaruko tabbahulo tanninno tappoṇo tappabbhāro tadadhimutto tadadhipateyyo. Yathā gaṇagaruko vuccati ‘‘gaṇabāhuliko’’ti, cīvaragaruko vuccati ‘‘cīvarabāhuliko’’ti, pattagaruko vuccati ‘‘pattabāhuliko’’ti, senāsanagaruko vuccati ‘‘senāsanabāhuliko’’ti; evamevaṃ idhekacco paññā garuko hoti paññācarito paññāsayo paññādhimutto paññādhajo paññāketu paññādhipateyyo vicayabahulo pavicayabahulo okkhāyanabahulo samokkhāyanabahulo sampekkhāyanadhammo vibhūtavihārī taccarito taggaruko tabbahulo tanninno tappoṇo tappabbhāro tadadhimutto tadadhipateyyo. Paññābāhullāya saṃvattantīti – idaṃ paññābāhullaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sīghapaññatāya saṃvattantī"
      },
      "ti katamā sīghapaññā? Sīghaṃ sīghaṃ sīlāni paripūretīti – sīghapaññā. Sīghaṃ sīghaṃ indriyasaṃvaraṃ paripūretīti – sīghapaññā. Sīghaṃ sīghaṃ bhojane mattaññutaṃ paripūretīti – sīghapaññā. Sīghaṃ sīghaṃ jāgariyānuyogaṃ paripūretīti – sīghapaññā. Sīghaṃ sīghaṃ sīlakkhandhaṃ paripūretīti – sīghapaññā. Sīghaṃ sīghaṃ samādhikkhandhaṃ paripūretīti – sīghapaññā. Sīghaṃ sīghaṃ paññākkhandhaṃ paripūretīti – sīghapaññā ",
      ". Sīghaṃ sīghaṃ vimuttikkhandhaṃ paripūretīti – sīghapaññā. Sīghaṃ sīghaṃ vimuttiñāṇadassanakkhandhaṃ paripūretīti – sīghapaññā. Sīghaṃ sīghaṃ ṭhānāṭṭhānāni paṭivijjhatīti – sīghapaññā. Sīghaṃ sīghaṃ vihārasamāpattiyo paripūretīti – sīghapaññā. Sīghaṃ sīghaṃ ariyasaccāni paṭivijjhatīti – sīghapaññā. Sīghaṃ sīghaṃ satipaṭṭhāne bhāvetīti – sīghapaññā. Sīghaṃ sīghaṃ sammappadhāne bhāvetīti – sīghapaññā. Sīghaṃ sīghaṃ iddhipāde bhāvetīti – sīghapaññā. Sīghaṃ sīghaṃ indriyāni bhāvetīti – sīghapaññā. Sīghaṃ sīghaṃ balāni bhāvetīti – sīghapaññā. Sīghaṃ sīghaṃ bojjhaṅge bhāvetīti – sīghapaññā. Sīghaṃ sīghaṃ ariyamaggaṃ bhāvetīti – sīghapaññā. Sīghaṃ sīghaṃ sāmaññaphalāni sacchikarotīti – sīghapaññā. Sīghaṃ sīghaṃ abhiññāyo paṭivijjhatīti – sīghapaññā. Sīghaṃ sīghaṃ paramatthaṃ nibbānaṃ sacchikarotīti – sīghapaññā. Sīghapaññatāya saṃvattantīti – ayaṃ sīghapaññā."
    ],
    "innerText": "Sīghapaññatāya saṃvattantīti katamā sīghapaññā? Sīghaṃ sīghaṃ sīlāni paripūretīti – sīghapaññā. Sīghaṃ sīghaṃ indriyasaṃvaraṃ paripūretīti – sīghapaññā. Sīghaṃ sīghaṃ bhojane mattaññutaṃ paripūretīti – sīghapaññā. Sīghaṃ sīghaṃ jāgariyānuyogaṃ paripūretīti – sīghapaññā. Sīghaṃ sīghaṃ sīlakkhandhaṃ paripūretīti – sīghapaññā. Sīghaṃ sīghaṃ samādhikkhandhaṃ paripūretīti – sīghapaññā. Sīghaṃ sīghaṃ paññākkhandhaṃ paripūretīti – sīghapaññā . Sīghaṃ sīghaṃ vimuttikkhandhaṃ paripūretīti – sīghapaññā. Sīghaṃ sīghaṃ vimuttiñāṇadassanakkhandhaṃ paripūretīti – sīghapaññā. Sīghaṃ sīghaṃ ṭhānāṭṭhānāni paṭivijjhatīti – sīghapaññā. Sīghaṃ sīghaṃ vihārasamāpattiyo paripūretīti – sīghapaññā. Sīghaṃ sīghaṃ ariyasaccāni paṭivijjhatīti – sīghapaññā. Sīghaṃ sīghaṃ satipaṭṭhāne bhāvetīti – sīghapaññā. Sīghaṃ sīghaṃ sammappadhāne bhāvetīti – sīghapaññā. Sīghaṃ sīghaṃ iddhipāde bhāvetīti – sīghapaññā. Sīghaṃ sīghaṃ indriyāni bhāvetīti – sīghapaññā. Sīghaṃ sīghaṃ balāni bhāvetīti – sīghapaññā. Sīghaṃ sīghaṃ bojjhaṅge bhāvetīti – sīghapaññā. Sīghaṃ sīghaṃ ariyamaggaṃ bhāvetīti – sīghapaññā. Sīghaṃ sīghaṃ sāmaññaphalāni sacchikarotīti – sīghapaññā. Sīghaṃ sīghaṃ abhiññāyo paṭivijjhatīti – sīghapaññā. Sīghaṃ sīghaṃ paramatthaṃ nibbānaṃ sacchikarotīti – sīghapaññā. Sīghapaññatāya saṃvattantīti – ayaṃ sīghapaññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lahupaññatāya saṃvattantī"
      },
      "ti katamā lahupaññā? Lahuṃ lahuṃ sīlāni paripūretīti – lahupaññā. Lahuṃ lahuṃ indriyasaṃvaraṃ paripūretīti – lahupaññā. Lahuṃ lahuṃ ",
      " bhojane mattaññutaṃ paripūretīti – lahupaññā. Lahuṃ lahuṃ jāgariyānuyogaṃ paripūretīti – lahupaññā. Lahuṃ lahuṃ sīlakkhandhaṃ ",
      " …pe… samādhikkhandhaṃ ",
      "… paññākkhandhaṃ… vimuttikkhandhaṃ… vimuttiñāṇadassanakkhandhaṃ paripūretīti – lahupaññā. Lahuṃ lahuṃ ṭhānāṭṭhānāni paṭivijjhatīti – lahupaññā. Lahuṃ lahuṃ vihārasamāpattiyo paripūretīti ",
      " – lahupaññā. Lahuṃ lahuṃ ariyasaccāni paṭivijjhatīti – lahupaññā. Lahuṃ lahuṃ satipaṭṭhāne bhāvetīti – lahupaññā. Lahuṃ lahuṃ sammappadhāne bhāvetīti – lahupaññā. Lahuṃ lahuṃ iddhipāde bhāvetīti – lahupaññā. Lahuṃ lahuṃ indriyāni bhāvetīti – lahupaññā. Lahuṃ lahuṃ balāni bhāvetīti – lahupaññā. Lahuṃ lahuṃ bojjhaṅge bhāvetīti – lahupaññā. Lahuṃ lahuṃ ariyamaggaṃ bhāvetīti – lahupaññā. Lahuṃ lahuṃ sāmaññaphalāni sacchikarotīti – lahupaññā. Lahuṃ lahuṃ abhiññāyo paṭivijjhatīti – lahupaññā. Lahuṃ lahuṃ paramatthaṃ nibbānaṃ sacchikarotīti – lahupaññā. Lahupaññatāya saṃvattantīti – ayaṃ lahupaññā."
    ],
    "innerText": "Lahupaññatāya saṃvattantīti katamā lahupaññā? Lahuṃ lahuṃ sīlāni paripūretīti – lahupaññā. Lahuṃ lahuṃ indriyasaṃvaraṃ paripūretīti – lahupaññā. Lahuṃ lahuṃ bhojane mattaññutaṃ paripūretīti – lahupaññā. Lahuṃ lahuṃ jāgariyānuyogaṃ paripūretīti – lahupaññā. Lahuṃ lahuṃ sīlakkhandhaṃ …pe… samādhikkhandhaṃ … paññākkhandhaṃ… vimuttikkhandhaṃ… vimuttiñāṇadassanakkhandhaṃ paripūretīti – lahupaññā. Lahuṃ lahuṃ ṭhānāṭṭhānāni paṭivijjhatīti – lahupaññā. Lahuṃ lahuṃ vihārasamāpattiyo paripūretīti – lahupaññā. Lahuṃ lahuṃ ariyasaccāni paṭivijjhatīti – lahupaññā. Lahuṃ lahuṃ satipaṭṭhāne bhāvetīti – lahupaññā. Lahuṃ lahuṃ sammappadhāne bhāvetīti – lahupaññā. Lahuṃ lahuṃ iddhipāde bhāvetīti – lahupaññā. Lahuṃ lahuṃ indriyāni bhāvetīti – lahupaññā. Lahuṃ lahuṃ balāni bhāvetīti – lahupaññā. Lahuṃ lahuṃ bojjhaṅge bhāvetīti – lahupaññā. Lahuṃ lahuṃ ariyamaggaṃ bhāvetīti – lahupaññā. Lahuṃ lahuṃ sāmaññaphalāni sacchikarotīti – lahupaññā. Lahuṃ lahuṃ abhiññāyo paṭivijjhatīti – lahupaññā. Lahuṃ lahuṃ paramatthaṃ nibbānaṃ sacchikarotīti – lahupaññā. Lahupaññatāya saṃvattantīti – ayaṃ lahupaññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hāsapaññatāya saṃvattantī"
      },
      "ti katamā hāsapaññā? Idhekacco hāsabahulo vedabahulo tuṭṭhibahulo pāmojjabahulo sīlāni paripūretīti – hāsapaññā. Hāsabahulo vedabahulo tuṭṭhibahulo pāmojjabahulo indriyasaṃvaraṃ paripūretīti – hāsapaññā. Hāsabahulo vedabahulo tuṭṭhibahulo pāmojjabahulo bhojane mattaññutaṃ paripūretīti – hāsapaññā. Hāsabahulo vedabahulo tuṭṭhibahulo pāmojjabahulo jāgariyānuyogaṃ paripūretīti – hāsapaññā. Hāsabahulo vedabahulo tuṭṭhibahulo pāmojjabahulo sīlakkhandhaṃ…pe… samādhikkhandhaṃ… paññākkhandhaṃ… vimuttikkhandhaṃ… vimuttiñāṇadassanakkhandhaṃ paripūretīti…pe… ṭhānāṭṭhānāni paṭivijjhatīti… vihārasamāpattiyo paripūretīti ",
      "… ariyasaccāni paṭivijjhatīti… satipaṭṭhāne bhāvetīti… sammappadhāne bhāvetīti… iddhipāde bhāvetīti… indriyāni bhāvetīti… balāni bhāvetīti… bojjhaṅge bhāvetīti ",
      " … ariyamaggaṃ bhāvetīti…pe… sāmaññaphalāni sacchikarotīti – hāsapaññā. Hāsabahulo vedabahulo tuṭṭhibahulo pāmojjabahulo abhiññāyo paṭivijjhatīti – hāsapaññā. Hāsabahulo vedabahulo tuṭṭhibahulo pāmojjabahulo paramatthaṃ nibbānaṃ sacchikarotīti – hāsapaññā. Hāsapaññatāya saṃvattantīti – ayaṃ hāsapaññā."
    ],
    "innerText": "Hāsapaññatāya saṃvattantīti katamā hāsapaññā? Idhekacco hāsabahulo vedabahulo tuṭṭhibahulo pāmojjabahulo sīlāni paripūretīti – hāsapaññā. Hāsabahulo vedabahulo tuṭṭhibahulo pāmojjabahulo indriyasaṃvaraṃ paripūretīti – hāsapaññā. Hāsabahulo vedabahulo tuṭṭhibahulo pāmojjabahulo bhojane mattaññutaṃ paripūretīti – hāsapaññā. Hāsabahulo vedabahulo tuṭṭhibahulo pāmojjabahulo jāgariyānuyogaṃ paripūretīti – hāsapaññā. Hāsabahulo vedabahulo tuṭṭhibahulo pāmojjabahulo sīlakkhandhaṃ…pe… samādhikkhandhaṃ… paññākkhandhaṃ… vimuttikkhandhaṃ… vimuttiñāṇadassanakkhandhaṃ paripūretīti…pe… ṭhānāṭṭhānāni paṭivijjhatīti… vihārasamāpattiyo paripūretīti … ariyasaccāni paṭivijjhatīti… satipaṭṭhāne bhāvetīti… sammappadhāne bhāvetīti… iddhipāde bhāvetīti… indriyāni bhāvetīti… balāni bhāvetīti… bojjhaṅge bhāvetīti … ariyamaggaṃ bhāvetīti…pe… sāmaññaphalāni sacchikarotīti – hāsapaññā. Hāsabahulo vedabahulo tuṭṭhibahulo pāmojjabahulo abhiññāyo paṭivijjhatīti – hāsapaññā. Hāsabahulo vedabahulo tuṭṭhibahulo pāmojjabahulo paramatthaṃ nibbānaṃ sacchikarotīti – hāsapaññā. Hāsapaññatāya saṃvattantīti – ayaṃ hāsapaññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "7"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Javanapaññatāya saṃvattantī"
      },
      "ti katamā javanapaññā? Yaṃ kiñci rūpaṃ atītānāgatapaccuppannaṃ ajjhattaṃ vā bahiddhā vā oḷārikaṃ vā sukhumaṃ vā hīnaṃ vā paṇītaṃ ",
      " vā yaṃ dūre santike vā, sabbaṃ rūpaṃ aniccato khippaṃ javatīti – javanapaññā. Dukkhato khippaṃ javatīti – javanapaññā. Anattato khippaṃ javatīti – javanapaññā. Yā kāci ",
      " vedanā…pe… yā kāci saññā… ye keci saṅkhārā… yaṃ kiñci viññāṇaṃ atītānāgatapaccuppannaṃ ajjhattaṃ vā bahiddhā vā oḷārikaṃ vā sukhumaṃ vā hīnaṃ vā paṇītaṃ vā yaṃ dūre santike vā, sabbaṃ viññāṇaṃ aniccato khippaṃ javatīti – javanapaññā. Dukkhato khippaṃ javatīti – javanapaññā. Anattato khippaṃ javatīti – javanapaññā. Cakkhu…pe… jarāmaraṇaṃ atītānāgatapaccuppannaṃ aniccato khippaṃ javatīti – javanapaññā. Dukkhato khippaṃ javatīti – javanapaññā ",
      ". Anattato khippaṃ javatīti – javanapaññā."
    ],
    "innerText": "7.Javanapaññatāya saṃvattantīti katamā javanapaññā? Yaṃ kiñci rūpaṃ atītānāgatapaccuppannaṃ ajjhattaṃ vā bahiddhā vā oḷārikaṃ vā sukhumaṃ vā hīnaṃ vā paṇītaṃ vā yaṃ dūre santike vā, sabbaṃ rūpaṃ aniccato khippaṃ javatīti – javanapaññā. Dukkhato khippaṃ javatīti – javanapaññā. Anattato khippaṃ javatīti – javanapaññā. Yā kāci vedanā…pe… yā kāci saññā… ye keci saṅkhārā… yaṃ kiñci viññāṇaṃ atītānāgatapaccuppannaṃ ajjhattaṃ vā bahiddhā vā oḷārikaṃ vā sukhumaṃ vā hīnaṃ vā paṇītaṃ vā yaṃ dūre santike vā, sabbaṃ viññāṇaṃ aniccato khippaṃ javatīti – javanapaññā. Dukkhato khippaṃ javatīti – javanapaññā. Anattato khippaṃ javatīti – javanapaññā. Cakkhu…pe… jarāmaraṇaṃ atītānāgatapaccuppannaṃ aniccato khippaṃ javatīti – javanapaññā. Dukkhato khippaṃ javatīti – javanapaññā . Anattato khippaṃ javatīti – javanapaññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Rūpaṃ atītānāgatapaccuppannaṃ aniccaṃ khayaṭṭhena dukkhaṃ bhayaṭṭhena anattā asārakaṭṭhenāti tulayitvā tīrayitvā vibhāvayitvā vibhūtaṃ katvā rūpanirodhe nibbāne khippaṃ javatīti – javanapaññā. Vedanā…pe… saññā… saṅkhārā… viññāṇaṃ… cakkhu…pe… jarāmaraṇaṃ atītānāgatapaccuppannaṃ aniccaṃ khayaṭṭhena dukkhaṃ bhayaṭṭhena anattā asārakaṭṭhenāti tulayitvā tīrayitvā vibhāvayitvā vibhūtaṃ katvā jarāmaraṇanirodhe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[jarāmaraṇaṃ rūpanirodhe (syā.)]"
      },
      " nibbāne khippaṃ javatīti – javanapaññā."
    ],
    "innerText": "Rūpaṃ atītānāgatapaccuppannaṃ aniccaṃ khayaṭṭhena dukkhaṃ bhayaṭṭhena anattā asārakaṭṭhenāti tulayitvā tīrayitvā vibhāvayitvā vibhūtaṃ katvā rūpanirodhe nibbāne khippaṃ javatīti – javanapaññā. Vedanā…pe… saññā… saṅkhārā… viññāṇaṃ… cakkhu…pe… jarāmaraṇaṃ atītānāgatapaccuppannaṃ aniccaṃ khayaṭṭhena dukkhaṃ bhayaṭṭhena anattā asārakaṭṭhenāti tulayitvā tīrayitvā vibhāvayitvā vibhūtaṃ katvā jarāmaraṇanirodhe [jarāmaraṇaṃ rūpanirodhe (syā.)] nibbāne khippaṃ javatīti – javanapaññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Rūpaṃ atītānāgatapaccuppannaṃ aniccaṃ saṅkhataṃ paṭiccasamuppannaṃ khayadhammaṃ vayadhammaṃ virāgadhammaṃ nirodhadhammanti tulayitvā tīrayitvā vibhāvayitvā vibhūtaṃ katvā rūpanirodhe nibbāne khippaṃ javatīti – javanapaññā. Vedanā…pe… saññā… saṅkhārā… viññāṇaṃ… cakkhu…pe… jarāmaraṇaṃ atītānāgatapaccuppannaṃ aniccaṃ saṅkhataṃ paṭiccasamuppannaṃ khayadhammaṃ vayadhammaṃ virāgadhammaṃ nirodhadhammanti tulayitvā tīrayitvā vibhāvayitvā vibhūtaṃ katvā jarāmaraṇanirodhe nibbāne khippaṃ javatīti – javanapaññā. Javanapaññatāya saṃvattantīti – ayaṃ javanapaññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tikkhapaññatāya saṃvattantī"
      },
      "ti katamā tikkhapaññā? Khippaṃ ",
      " kilese chindatīti – tikkhapaññā. Uppannaṃ kāmavitakkaṃ nādhivāseti pajahati vinodeti byantīkaroti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[byantiṃ karoti (ka.)]"
      },
      " anabhāvaṃ gametīti – tikkhapaññā. Uppannaṃ byāpādavitakkaṃ nādhivāseti pajahati vinodeti byantīkaroti ",
      " anabhāvaṃ gametīti – tikkhapaññā. Uppannaṃ vihiṃsāvitakkaṃ nādhivāseti…pe… uppannuppanne pāpake akusale dhamme nādhivāseti pajahati vinodeti byantīkaroti anabhāvaṃ ",
      " gametīti – tikkhapaññā. Uppannaṃ rāgaṃ nādhivāseti pajahati vinodeti byantīkaroti anabhāvaṃ gametīti – tikkhapaññā. Uppannaṃ dosaṃ…pe… uppannaṃ mohaṃ ",
      "… uppannaṃ kodhaṃ… uppannaṃ upanāhaṃ… makkhaṃ… paḷāsaṃ… issaṃ… macchariyaṃ… māyaṃ… sāṭheyyaṃ… thambhaṃ… sārambhaṃ… mānaṃ… atimānaṃ… madaṃ… pamādaṃ… sabbe kilese… sabbe duccarite… sabbe abhisaṅkhāre…pe… sabbe bhavagāmikamme nādhivāseti pajahati vinodeti byantīkaroti anabhāvaṃ gametīti – tikkhapaññā. Ekasmiṃ āsane cattāro ca ariyamaggā cattāri ca sāmaññaphalāni catasso paṭisambhidāyo cha abhiññāyo adhigatā honti sacchikatā phassitā paññāyāti – tikkhapaññā. Tikkhapaññatāya saṃvattantīti – ayaṃ tikkhapaññā."
    ],
    "innerText": "Tikkhapaññatāya saṃvattantīti katamā tikkhapaññā? Khippaṃ kilese chindatīti – tikkhapaññā. Uppannaṃ kāmavitakkaṃ nādhivāseti pajahati vinodeti byantīkaroti [byantiṃ karoti (ka.)] anabhāvaṃ gametīti – tikkhapaññā. Uppannaṃ byāpādavitakkaṃ nādhivāseti pajahati vinodeti byantīkaroti anabhāvaṃ gametīti – tikkhapaññā. Uppannaṃ vihiṃsāvitakkaṃ nādhivāseti…pe… uppannuppanne pāpake akusale dhamme nādhivāseti pajahati vinodeti byantīkaroti anabhāvaṃ gametīti – tikkhapaññā. Uppannaṃ rāgaṃ nādhivāseti pajahati vinodeti byantīkaroti anabhāvaṃ gametīti – tikkhapaññā. Uppannaṃ dosaṃ…pe… uppannaṃ mohaṃ … uppannaṃ kodhaṃ… uppannaṃ upanāhaṃ… makkhaṃ… paḷāsaṃ… issaṃ… macchariyaṃ… māyaṃ… sāṭheyyaṃ… thambhaṃ… sārambhaṃ… mānaṃ… atimānaṃ… madaṃ… pamādaṃ… sabbe kilese… sabbe duccarite… sabbe abhisaṅkhāre…pe… sabbe bhavagāmikamme nādhivāseti pajahati vinodeti byantīkaroti anabhāvaṃ gametīti – tikkhapaññā. Ekasmiṃ āsane cattāro ca ariyamaggā cattāri ca sāmaññaphalāni catasso paṭisambhidāyo cha abhiññāyo adhigatā honti sacchikatā phassitā paññāyāti – tikkhapaññā. Tikkhapaññatāya saṃvattantīti – ayaṃ tikkhapaññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nibbedhikapaññatāya saṃvattantī"
      },
      "ti katamā nibbedhikapaññā? Idhekacco sabbasaṅkhāresu ubbegabahulo hoti uttāsabahulo ukkaṇṭhanabahulo aratibahulo anabhiratibahulo. Bahimukho na ramati sabbasaṅkhāresu. Anibbiddhapubbaṃ appadālitapubbaṃ lobhakkhandhaṃ nibbijjhati padāletīti – nibbedhikapaññā. Anibbiddhapubbaṃ appadālitapubbaṃ dosakkhandhaṃ nibbijjhati padāletīti – nibbedhikapaññā. Anibbiddhapubbaṃ appadālitapubbaṃ mohakkhandhaṃ ",
      " nibbijjhati padāletīti – nibbedhikapaññā ",
      ". Anibbiddhapubbaṃ appadālitapubbaṃ kodhaṃ…pe… upanāhaṃ… makkhaṃ… paḷāsaṃ… issaṃ… macchariyaṃ… māyaṃ… sāṭheyyaṃ… thambhaṃ… sārambhaṃ… mānaṃ… atimānaṃ… madaṃ… pamādaṃ… sabbe kilese… sabbe duccarite… sabbe abhisaṅkhāre…pe… sabbe bhavagāmikamme nibbijjhati padāletīti – nibbedhikapaññā. Nibbedhikapaññatāya saṃvattantīti – ayaṃ nibbedhikapaññā."
    ],
    "innerText": "Nibbedhikapaññatāya saṃvattantīti katamā nibbedhikapaññā? Idhekacco sabbasaṅkhāresu ubbegabahulo hoti uttāsabahulo ukkaṇṭhanabahulo aratibahulo anabhiratibahulo. Bahimukho na ramati sabbasaṅkhāresu. Anibbiddhapubbaṃ appadālitapubbaṃ lobhakkhandhaṃ nibbijjhati padāletīti – nibbedhikapaññā. Anibbiddhapubbaṃ appadālitapubbaṃ dosakkhandhaṃ nibbijjhati padāletīti – nibbedhikapaññā. Anibbiddhapubbaṃ appadālitapubbaṃ mohakkhandhaṃ nibbijjhati padāletīti – nibbedhikapaññā . Anibbiddhapubbaṃ appadālitapubbaṃ kodhaṃ…pe… upanāhaṃ… makkhaṃ… paḷāsaṃ… issaṃ… macchariyaṃ… māyaṃ… sāṭheyyaṃ… thambhaṃ… sārambhaṃ… mānaṃ… atimānaṃ… madaṃ… pamādaṃ… sabbe kilese… sabbe duccarite… sabbe abhisaṅkhāre…pe… sabbe bhavagāmikamme nibbijjhati padāletīti – nibbedhikapaññā. Nibbedhikapaññatāya saṃvattantīti – ayaṃ nibbedhikapaññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Imā soḷasa paññāyo. Imāhi soḷasahi paññāhi samannāgato puggalo paṭisambhidappatto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Puggalavisesaniddeso"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "8"
      },
      ". Dve puggalā paṭisambhidappattā – eko pubbayogasampanno, eko na pubbayogasampanno. Yo pubbayogasampanno so tena atireko hoti, adhiko hoti, viseso hoti. Tassa ñāṇaṃ pabhijjati."
    ],
    "innerText": "8. Dve puggalā paṭisambhidappattā – eko pubbayogasampanno, eko na pubbayogasampanno. Yo pubbayogasampanno so tena atireko hoti, adhiko hoti, viseso hoti. Tassa ñāṇaṃ pabhijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dve puggalā paṭisambhidappattā, dvepi pubbayogasampannā – eko bahussuto, eko na bahussuto ",
      ". Yo bahussuto, so tena atireko ",
      " hoti, adhiko hoti, viseso hoti. Tassa ñāṇaṃ pabhijjati."
    ],
    "innerText": "Dve puggalā paṭisambhidappattā, dvepi pubbayogasampannā – eko bahussuto, eko na bahussuto . Yo bahussuto, so tena atireko hoti, adhiko hoti, viseso hoti. Tassa ñāṇaṃ pabhijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dve puggalā paṭisambhidappattā, dvepi pubbayogasampannā, dvepi bahussutā – eko desanābahulo, eko na desanābahulo. Yo desanābahulo, so tena atireko hoti, adhiko hoti, viseso hoti. Tassa ñāṇaṃ pabhijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dve puggalā paṭisambhidappattā, dvepi pubbayogasampannā, dvepi bahussutā, dvepi desanābahulā – eko garūpanissito, eko na garūpanissito ",
      ". Yo garūpanissito, so tena atireko hoti, adhiko hoti, viseso hoti. Tassa ñāṇaṃ pabhijjati."
    ],
    "innerText": "Dve puggalā paṭisambhidappattā, dvepi pubbayogasampannā, dvepi bahussutā, dvepi desanābahulā – eko garūpanissito, eko na garūpanissito . Yo garūpanissito, so tena atireko hoti, adhiko hoti, viseso hoti. Tassa ñāṇaṃ pabhijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dve puggalā paṭisambhidappattā, dvepi pubbayogasampannā, dvepi bahussutā, dvepi desanābahulā, dvepi garūpanissitā – eko vihārabahulo, eko na vihārabahulo. Yo vihārabahulo, so tena atireko hoti, adhiko hoti, viseso hoti. Tassa ñāṇaṃ pabhijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dve puggalā paṭisambhidappattā, dvepi pubbayogasampannā, dvepi bahussutā, dvepi desanābahulā, dvepi garūpanissitā, dvepi vihārabahulā – eko paccavekkhaṇābahulo ",
      ", eko na paccavekkhaṇābahulo. Yo paccavekkhaṇābahulo, so tena atireko hoti, adhiko hoti, viseso hoti. Tassa ñāṇaṃ pabhijjati."
    ],
    "innerText": "Dve puggalā paṭisambhidappattā, dvepi pubbayogasampannā, dvepi bahussutā, dvepi desanābahulā, dvepi garūpanissitā, dvepi vihārabahulā – eko paccavekkhaṇābahulo , eko na paccavekkhaṇābahulo. Yo paccavekkhaṇābahulo, so tena atireko hoti, adhiko hoti, viseso hoti. Tassa ñāṇaṃ pabhijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dve puggalā paṭisambhidappattā, dvepi pubbayogasampannā, dvepi bahussutā, dvepi desanābahulā, dvepi garūpanissitā, dvepi vihārabahulā, dvepi paccavekkhaṇābahulā – eko sekhapaṭisambhidappatto, eko asekhapaṭisambhidappatto. Yo asekhapaṭisambhidappatto, so tena atireko hoti, adhiko hoti, viseso hoti. Tassa ñāṇaṃ pabhijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dve puggalā paṭisambhidappattā, dvepi pubbayogasampannā, dvepi bahussutā, dvepi desanābahulā, dvepi garūpanissitā, dvepi vihārabahulā, dvepi paccavekkhaṇābahulā, dvepi asekhapaṭisambhidappattā – eko sāvakapāramippatto, eko na ",
      " sāvakapāramippatto. Yo sāvakapāramippatto ",
      ", so ",
      " tena atireko hoti, adhiko hoti, viseso hoti. Tassa ñāṇaṃ pabhijjati."
    ],
    "innerText": "Dve puggalā paṭisambhidappattā, dvepi pubbayogasampannā, dvepi bahussutā, dvepi desanābahulā, dvepi garūpanissitā, dvepi vihārabahulā, dvepi paccavekkhaṇābahulā, dvepi asekhapaṭisambhidappattā – eko sāvakapāramippatto, eko na sāvakapāramippatto. Yo sāvakapāramippatto , so tena atireko hoti, adhiko hoti, viseso hoti. Tassa ñāṇaṃ pabhijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dve puggalā paṭisambhidappattā, dvepi pubbayogasampannā, dvepi bahussutā, dvepi desanābahulā, dvepi garūpanissitā, dvepi vihārabahulā, dvepi paccavekkhaṇābahulā, dvepi asekhapaṭisambhidappattā – eko sāvakapāramippatto, eko paccekasambuddho. Yo paccekasambuddho, so tena atireko hoti, adhiko hoti, viseso hoti. Tassa ñāṇaṃ pabhijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Paccekabuddhañca sadevakañca lokaṃ upādāya tathāgato arahaṃ sammāsambuddho aggo paṭisambhidappatto paññāpabhedakusalo pabhinnañāṇo adhigatapaṭisambhido catuvesārajjappatto dasabaladhārī purisāsabho purisasīho…pe… yepi te khattiyapaṇḍitā brāhmaṇapaṇḍitā gahapatipaṇḍitā samaṇapaṇḍitā nipuṇā kataparappavādā vālavedhirūpā vobhindantā maññe caranti paññāgatena diṭṭhigatāni, te pañhaṃ abhisaṅkharitvā abhisaṅkharitvā tathāgataṃ upasaṅkamitvā pucchanti gūḷhāni ca ",
      " paṭicchannāni ca. Kathitā visajjitā ca te pañhā bhagavatā honti niddiṭṭhakāraṇā, upakkhittakā ca te bhagavato sampajjanti. Atha kho bhagavā tattha atirocati, yadidaṃ paññāyāti aggo paṭisambhidappattoti."
    ],
    "innerText": "Paccekabuddhañca sadevakañca lokaṃ upādāya tathāgato arahaṃ sammāsambuddho aggo paṭisambhidappatto paññāpabhedakusalo pabhinnañāṇo adhigatapaṭisambhido catuvesārajjappatto dasabaladhārī purisāsabho purisasīho…pe… yepi te khattiyapaṇḍitā brāhmaṇapaṇḍitā gahapatipaṇḍitā samaṇapaṇḍitā nipuṇā kataparappavādā vālavedhirūpā vobhindantā maññe caranti paññāgatena diṭṭhigatāni, te pañhaṃ abhisaṅkharitvā abhisaṅkharitvā tathāgataṃ upasaṅkamitvā pucchanti gūḷhāni ca paṭicchannāni ca. Kathitā visajjitā ca te pañhā bhagavatā honti niddiṭṭhakāraṇā, upakkhittakā ca te bhagavato sampajjanti. Atha kho bhagavā tattha atirocati, yadidaṃ paññāyāti aggo paṭisambhidappattoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Mahāpaññākathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2. Iddhikathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "9"
      },
      ". Kā ",
      " iddhi? Kati iddhiyo? Iddhiyā kati bhūmiyo, kati pādā, kati padāni, kati mūlāni? ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kā iddhī"
      },
      "ti? Ijjhanaṭṭhena iddhi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kati iddhiyo"
      },
      "ti? Dasa iddhiyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iddhiyā kati bhūmiyo"
      },
      "ti? Iddhiyā catasso bhūmiyo, cattāro pādā, aṭṭha padāni, soḷasa mūlāni."
    ],
    "innerText": "9. Kā iddhi? Kati iddhiyo? Iddhiyā kati bhūmiyo, kati pādā, kati padāni, kati mūlāni? Kā iddhīti? Ijjhanaṭṭhena iddhi. Kati iddhiyoti? Dasa iddhiyo. Iddhiyā kati bhūmiyoti? Iddhiyā catasso bhūmiyo, cattāro pādā, aṭṭha padāni, soḷasa mūlāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "10"
      },
      ". Katamā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dasa iddhiyo?"
      },
      " Adhiṭṭhānā iddhi, vikubbanā iddhi, manomayā iddhi, ñāṇavipphārā iddhi, samādhivipphārā iddhi, ariyā iddhi, kammavipākajā iddhi, puññavato ",
      " iddhi, vijjāmayā iddhi, tattha tattha sammā payogapaccayā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sammappayogapaccayā (syā. ka.)]"
      },
      " ijjhanaṭṭhena iddhi."
    ],
    "innerText": "10. Katamā dasa iddhiyo? Adhiṭṭhānā iddhi, vikubbanā iddhi, manomayā iddhi, ñāṇavipphārā iddhi, samādhivipphārā iddhi, ariyā iddhi, kammavipākajā iddhi, puññavato iddhi, vijjāmayā iddhi, tattha tattha sammā payogapaccayā [sammappayogapaccayā (syā. ka.)] ijjhanaṭṭhena iddhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iddhiyā katamā catasso bhūmiyo?"
      },
      " Vivekajābhūmi paṭhamaṃ jhānaṃ, pītisukhabhūmi dutiyaṃ jhānaṃ, upekkhāsukhabhūmi tatiyaṃ jhānaṃ, adukkhamasukhābhūmi catutthaṃ jhānaṃ. Iddhiyā imā catasso bhūmiyo iddhilābhāya iddhipaṭilābhāya iddhivikubbanatāya iddhivisavitāya iddhivasībhāvāya iddhivesārajjāya saṃvattantīti."
    ],
    "innerText": "Iddhiyā katamā catasso bhūmiyo? Vivekajābhūmi paṭhamaṃ jhānaṃ, pītisukhabhūmi dutiyaṃ jhānaṃ, upekkhāsukhabhūmi tatiyaṃ jhānaṃ, adukkhamasukhābhūmi catutthaṃ jhānaṃ. Iddhiyā imā catasso bhūmiyo iddhilābhāya iddhipaṭilābhāya iddhivikubbanatāya iddhivisavitāya iddhivasībhāvāya iddhivesārajjāya saṃvattantīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iddhiyā katame cattāro pādā?"
      },
      " Idha bhikkhu chandasamādhipadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, cittasamādhipadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhipadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīmaṃsāsamādhipadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Iddhiyā ime cattāro pādā iddhilābhāya iddhipaṭilābhāya ",
      " iddhivikubbanatāya iddhivisavitāya iddhivasībhāvāya iddhivesārajjāya saṃvattantīti."
    ],
    "innerText": "Iddhiyā katame cattāro pādā? Idha bhikkhu chandasamādhipadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, cittasamādhipadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhipadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīmaṃsāsamādhipadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Iddhiyā ime cattāro pādā iddhilābhāya iddhipaṭilābhāya iddhivikubbanatāya iddhivisavitāya iddhivasībhāvāya iddhivesārajjāya saṃvattantīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iddhiyā katamāni aṭṭha padāni?"
      },
      " Chandaṃ ce bhikkhu ",
      " nissāya labhati samādhiṃ, labhati cittassa ",
      " ekaggataṃ. Chando na samādhi, samādhi na chando. Añño chando, añño samādhi. Vīriyaṃ ce bhikkhu nissāya labhati samādhiṃ, labhati cittassa ekaggataṃ. Vīriyaṃ na samādhi, samādhi na vīriyaṃ. Aññaṃ vīriyaṃ, añño samādhi. Cittaṃ ce bhikkhu nissāya labhati samādhiṃ, labhati cittassa ekaggataṃ. Cittaṃ na samādhi, samādhi na cittaṃ. Aññaṃ cittaṃ, añño samādhi. Vīmaṃsaṃ ce bhikkhu nissāya labhati samādhiṃ, labhati cittassa ekaggataṃ. Vīmaṃsā na samādhi, samādhi na vīmaṃsā. Aññā vīmaṃsā, añño samādhi. Iddhiyā imāni aṭṭha padāni iddhilābhāya iddhipaṭilābhāya iddhivikubbanatāya iddhivisavitāya iddhivasībhāvāya iddhivesārajjāya saṃvattantīti."
    ],
    "innerText": "Iddhiyā katamāni aṭṭha padāni? Chandaṃ ce bhikkhu nissāya labhati samādhiṃ, labhati cittassa ekaggataṃ. Chando na samādhi, samādhi na chando. Añño chando, añño samādhi. Vīriyaṃ ce bhikkhu nissāya labhati samādhiṃ, labhati cittassa ekaggataṃ. Vīriyaṃ na samādhi, samādhi na vīriyaṃ. Aññaṃ vīriyaṃ, añño samādhi. Cittaṃ ce bhikkhu nissāya labhati samādhiṃ, labhati cittassa ekaggataṃ. Cittaṃ na samādhi, samādhi na cittaṃ. Aññaṃ cittaṃ, añño samādhi. Vīmaṃsaṃ ce bhikkhu nissāya labhati samādhiṃ, labhati cittassa ekaggataṃ. Vīmaṃsā na samādhi, samādhi na vīmaṃsā. Aññā vīmaṃsā, añño samādhi. Iddhiyā imāni aṭṭha padāni iddhilābhāya iddhipaṭilābhāya iddhivikubbanatāya iddhivisavitāya iddhivasībhāvāya iddhivesārajjāya saṃvattantīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iddhiyā katamāni soḷasa mūlāni?"
      },
      " Anonataṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[anoṇataṃ (ka.)]"
      },
      " cittaṃ kosajje na iñjatīti – āneñjaṃ. Anunnataṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[(anuṇṇataṃ (ka.)]"
      },
      " cittaṃ uddhacce na iñjatīti – āneñjaṃ. Anabhinataṃ cittaṃ rāge na iñjatīti – āneñjaṃ. Anapanataṃ cittaṃ byāpāde na iñjatīti – āneñjaṃ. Anissitaṃ cittaṃ diṭṭhiyā na iñjatīti – āneñjaṃ. Appaṭibaddhaṃ cittaṃ chandarāge na iñjatīti – āneñjaṃ. Vippamuttaṃ cittaṃ kāmarāge na iñjatīti – āneñjaṃ ",
      ". Visaññuttaṃ cittaṃ kilese na iñjatīti – āneñjaṃ. Vimariyādikataṃ cittaṃ kilesamariyāde ",
      " na iñjatīti – āneñjaṃ. Ekattagataṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ekaggataṃ (syā.)]"
      },
      " cittaṃ nānattakilesehi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[nānattakilese (syā.)]"
      },
      " na iñjatīti – āneñjaṃ. Saddhāya pariggahitaṃ cittaṃ assaddhiye na iñjatīti – āneñjaṃ. Vīriyena pariggahitaṃ cittaṃ kosajje na iñjatīti – āneñjaṃ. Satiyā pariggahitaṃ cittaṃ pamāde na iñjatīti – āneñjaṃ. Samādhinā pariggahitaṃ cittaṃ uddhacce na iñjatīti – āneñjaṃ. Paññāya pariggahitaṃ cittaṃ avijjāya na iñjatīti – āneñjaṃ. Obhāsagataṃ cittaṃ avijjandhakāre na iñjatīti – āneñjaṃ. Iddhiyā imāni soḷasa mūlāni iddhilābhāya iddhipaṭilābhāya iddhivikubbanatāya iddhivisavitāya iddhivasībhāvāya iddhivesārajjāya saṃvattantīti."
    ],
    "innerText": "Iddhiyā katamāni soḷasa mūlāni? Anonataṃ [anoṇataṃ (ka.)] cittaṃ kosajje na iñjatīti – āneñjaṃ. Anunnataṃ [(anuṇṇataṃ (ka.)] cittaṃ uddhacce na iñjatīti – āneñjaṃ. Anabhinataṃ cittaṃ rāge na iñjatīti – āneñjaṃ. Anapanataṃ cittaṃ byāpāde na iñjatīti – āneñjaṃ. Anissitaṃ cittaṃ diṭṭhiyā na iñjatīti – āneñjaṃ. Appaṭibaddhaṃ cittaṃ chandarāge na iñjatīti – āneñjaṃ. Vippamuttaṃ cittaṃ kāmarāge na iñjatīti – āneñjaṃ . Visaññuttaṃ cittaṃ kilese na iñjatīti – āneñjaṃ. Vimariyādikataṃ cittaṃ kilesamariyāde na iñjatīti – āneñjaṃ. Ekattagataṃ [ekaggataṃ (syā.)] cittaṃ nānattakilesehi [nānattakilese (syā.)] na iñjatīti – āneñjaṃ. Saddhāya pariggahitaṃ cittaṃ assaddhiye na iñjatīti – āneñjaṃ. Vīriyena pariggahitaṃ cittaṃ kosajje na iñjatīti – āneñjaṃ. Satiyā pariggahitaṃ cittaṃ pamāde na iñjatīti – āneñjaṃ. Samādhinā pariggahitaṃ cittaṃ uddhacce na iñjatīti – āneñjaṃ. Paññāya pariggahitaṃ cittaṃ avijjāya na iñjatīti – āneñjaṃ. Obhāsagataṃ cittaṃ avijjandhakāre na iñjatīti – āneñjaṃ. Iddhiyā imāni soḷasa mūlāni iddhilābhāya iddhipaṭilābhāya iddhivikubbanatāya iddhivisavitāya iddhivasībhāvāya iddhivesārajjāya saṃvattantīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Dasaiddhiniddeso"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "10"
      },
      ". Katamā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "adhiṭṭhānā iddhi? "
      },
      " Idha bhikkhu anekavihitaṃ iddhividhaṃ paccanubhoti – ekopi hutvā bahudhā hoti, bahudhāpi hutvā eko hoti; āvibhāvaṃ tirobhāvaṃ; tirokuṭṭaṃ tiropākāraṃ tiropabbataṃ asajjamāno gacchati, seyyathāpi ākāse. Pathaviyāpi ummujjanimujjaṃ karoti, seyyathāpi udake. Udakepi abhijjamāne ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[abhijjamāno (ka.) dī. ni. 1.238 passitabbā]"
      },
      " gacchati, seyyathāpi pathaviyaṃ. Ākāsepi pallaṅkena kamati, seyyathāpi pakkhī sakuṇo. Imepi candimasūriye evaṃmahiddhike ",
      " evaṃmahānubhāve pāṇinā parāmasati parimajjati. Yāva brahmalokāpi kāyena vasaṃ vattetīti."
    ],
    "innerText": "10. Katamā adhiṭṭhānā iddhi? Idha bhikkhu anekavihitaṃ iddhividhaṃ paccanubhoti – ekopi hutvā bahudhā hoti, bahudhāpi hutvā eko hoti; āvibhāvaṃ tirobhāvaṃ; tirokuṭṭaṃ tiropākāraṃ tiropabbataṃ asajjamāno gacchati, seyyathāpi ākāse. Pathaviyāpi ummujjanimujjaṃ karoti, seyyathāpi udake. Udakepi abhijjamāne [abhijjamāno (ka.) dī. ni. 1.238 passitabbā] gacchati, seyyathāpi pathaviyaṃ. Ākāsepi pallaṅkena kamati, seyyathāpi pakkhī sakuṇo. Imepi candimasūriye evaṃmahiddhike evaṃmahānubhāve pāṇinā parāmasati parimajjati. Yāva brahmalokāpi kāyena vasaṃ vattetīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idhā"
      },
      "ti ",
      " imissā diṭṭhiyā imissā khantiyā imissā ruciyā imasmiṃ ādāye imasmiṃ dhamme imasmiṃ vinaye imasmiṃ dhammavinaye imasmiṃ pāvacane imasmiṃ brahmacariye imasmiṃ satthusāsane. Tena vuccati – ‘‘idhā’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhikkhū"
      },
      "ti puthujjanakalyāṇako vā hoti bhikkhu sekho vā arahā vā akuppadhammo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anekavihitaṃ iddhividhaṃ paccanubhotī"
      },
      "ti nānappakāraṃ iddhividhaṃ paccanubhoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekopi hutvā bahudhā hotī"
      },
      "ti pakatiyā eko bahukaṃ āvajjati, sataṃ vā sahassaṃ vā satasahassaṃ vā āvajjati. Āvajjitvā ñāṇena adhiṭṭhāti – ‘‘bahulo homī’’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[hotūti (ka.)]"
      },
      ". Bahulo hoti. Yathāyasmā cūḷapanthako ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[cullapanthako (syā.)]"
      },
      " ekopi hutvā bahudhā hoti, evamevaṃ so ",
      " iddhimā cetovasippatto ekopi hutvā bahudhā hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bahudhāpi hutvā eko hotī"
      },
      "ti pakatiyā bahuko ekaṃ āvajjati; āvajjitvā ñāṇena adhiṭṭhāti – ‘‘eko homī’’ti. Eko hoti. Yathāyasmā cūḷapanthako bahudhāpi hutvā eko hoti, evamevaṃ so iddhimā cetovasippatto bahudhāpi hutvā eko hoti."
    ],
    "innerText": "Idhāti imissā diṭṭhiyā imissā khantiyā imissā ruciyā imasmiṃ ādāye imasmiṃ dhamme imasmiṃ vinaye imasmiṃ dhammavinaye imasmiṃ pāvacane imasmiṃ brahmacariye imasmiṃ satthusāsane. Tena vuccati – ‘‘idhā’’ti. Bhikkhūti puthujjanakalyāṇako vā hoti bhikkhu sekho vā arahā vā akuppadhammo. Anekavihitaṃ iddhividhaṃ paccanubhotīti nānappakāraṃ iddhividhaṃ paccanubhoti. Ekopi hutvā bahudhā hotīti pakatiyā eko bahukaṃ āvajjati, sataṃ vā sahassaṃ vā satasahassaṃ vā āvajjati. Āvajjitvā ñāṇena adhiṭṭhāti – ‘‘bahulo homī’’ti [hotūti (ka.)]. Bahulo hoti. Yathāyasmā cūḷapanthako [cullapanthako (syā.)] ekopi hutvā bahudhā hoti, evamevaṃ so iddhimā cetovasippatto ekopi hutvā bahudhā hoti. Bahudhāpi hutvā eko hotīti pakatiyā bahuko ekaṃ āvajjati; āvajjitvā ñāṇena adhiṭṭhāti – ‘‘eko homī’’ti. Eko hoti. Yathāyasmā cūḷapanthako bahudhāpi hutvā eko hoti, evamevaṃ so iddhimā cetovasippatto bahudhāpi hutvā eko hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "11"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āvibhāva"
      },
      "nti kenaci anāvaṭaṃ hoti appaṭicchannaṃ vivaṭaṃ pākaṭaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tirobhāva"
      },
      "nti kenaci āvaṭaṃ hoti paṭicchannaṃ pihitaṃ paṭikujjitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tirokuṭṭaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tiropākāraṃ tiropabbataṃ asajjamāno gacchati, seyyathāpi"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ākāse"
      },
      "ti pakatiyā ākāsakasiṇasamāpattiyā lābhī hoti. Tirokuṭṭaṃ tiropākāraṃ tiropabbataṃ āvajjati. Āvajjitvā ñāṇena adhiṭṭhāti – ‘‘ākāso hotū’’ti. Ākāso hoti. Tirokuṭṭaṃ tiropākāraṃ tiropabbataṃ asajjamāno gacchati. Yathā manussā pakatiyā aniddhimanto kenaci anāvaṭe aparikkhitte asajjamānā gacchanti, evamevaṃ so iddhimā cetovasippatto tirokuṭṭaṃ tiropākāraṃ tiropabbataṃ asajjamāno gacchati, seyyathāpi ākāse."
    ],
    "innerText": "11.Āvibhāvanti kenaci anāvaṭaṃ hoti appaṭicchannaṃ vivaṭaṃ pākaṭaṃ. Tirobhāvanti kenaci āvaṭaṃ hoti paṭicchannaṃ pihitaṃ paṭikujjitaṃ. Tirokuṭṭaṃtiropākāraṃ tiropabbataṃ asajjamāno gacchati, seyyathāpiākāseti pakatiyā ākāsakasiṇasamāpattiyā lābhī hoti. Tirokuṭṭaṃ tiropākāraṃ tiropabbataṃ āvajjati. Āvajjitvā ñāṇena adhiṭṭhāti – ‘‘ākāso hotū’’ti. Ākāso hoti. Tirokuṭṭaṃ tiropākāraṃ tiropabbataṃ asajjamāno gacchati. Yathā manussā pakatiyā aniddhimanto kenaci anāvaṭe aparikkhitte asajjamānā gacchanti, evamevaṃ so iddhimā cetovasippatto tirokuṭṭaṃ tiropākāraṃ tiropabbataṃ asajjamāno gacchati, seyyathāpi ākāse."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pathaviyāpi ummujjanimujjaṃ karoti, seyyathāpi udake"
      },
      "ti pakatiyā āpokasiṇasamāpattiyā lābhī hoti. Pathaviṃ āvajjati. Āvajjitvā ñāṇena adhiṭṭhāti – ‘‘udakaṃ hotū’’ti. Udakaṃ hoti. So pathaviyā ummujjanimujjaṃ karoti. Yathā manussā pakatiyā aniddhimanto udake ummujjanimujjaṃ karonti, evamevaṃ so iddhimā cetovasippatto pathaviyā ummujjanimujjaṃ karoti, seyyathāpi udake."
    ],
    "innerText": "Pathaviyāpi ummujjanimujjaṃ karoti, seyyathāpi udaketi pakatiyā āpokasiṇasamāpattiyā lābhī hoti. Pathaviṃ āvajjati. Āvajjitvā ñāṇena adhiṭṭhāti – ‘‘udakaṃ hotū’’ti. Udakaṃ hoti. So pathaviyā ummujjanimujjaṃ karoti. Yathā manussā pakatiyā aniddhimanto udake ummujjanimujjaṃ karonti, evamevaṃ so iddhimā cetovasippatto pathaviyā ummujjanimujjaṃ karoti, seyyathāpi udake."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Udakepi"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhijjamāne gacchati, seyyathāpi pathaviya"
      },
      "nti pakatiyā pathavīkasiṇasamāpattiyā lābhī hoti. Udakaṃ āvajjati. Āvajjitvā ñāṇena adhiṭṭhāti – ‘‘pathavī hotū’’ti. Pathavī hoti. So abhijjamāne udake gacchati. Yathā manussā pakatiyā aniddhimanto abhijjamānāya pathaviyā gacchanti, evamevaṃ so iddhimā cetovasippatto abhijjamāne ",
      " udake gacchati, seyyathāpi pathaviyaṃ."
    ],
    "innerText": "Udakepiabhijjamāne gacchati, seyyathāpi pathaviyanti pakatiyā pathavīkasiṇasamāpattiyā lābhī hoti. Udakaṃ āvajjati. Āvajjitvā ñāṇena adhiṭṭhāti – ‘‘pathavī hotū’’ti. Pathavī hoti. So abhijjamāne udake gacchati. Yathā manussā pakatiyā aniddhimanto abhijjamānāya pathaviyā gacchanti, evamevaṃ so iddhimā cetovasippatto abhijjamāne udake gacchati, seyyathāpi pathaviyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ākāsepi pallaṅkena kamati, seyyathāpi pakkhī sakuṇo"
      },
      "ti pakatiyā pathavīkasiṇasamāpattiyā lābhī hoti. Ākāsaṃ āvajjati ",
      ". Āvajjitvā ñāṇena adhiṭṭhāti – ‘‘pathavī hotū’’ti. Pathavī hoti. So ākāse antalikkhe caṅkamatipi tiṭṭhatipi nisīdatipi seyyampi kappeti. Yathā manussā pakatiyā aniddhimanto pathaviyā caṅkamantipi tiṭṭhantipi nisīdantipi seyyampi kappenti, evamevaṃ so iddhimā cetovasippatto ākāse antalikkhe caṅkamatipi tiṭṭhatipi nisīdatipi seyyampi kappeti, seyyathāpi pakkhī sakuṇo."
    ],
    "innerText": "Ākāsepi pallaṅkena kamati, seyyathāpi pakkhī sakuṇoti pakatiyā pathavīkasiṇasamāpattiyā lābhī hoti. Ākāsaṃ āvajjati . Āvajjitvā ñāṇena adhiṭṭhāti – ‘‘pathavī hotū’’ti. Pathavī hoti. So ākāse antalikkhe caṅkamatipi tiṭṭhatipi nisīdatipi seyyampi kappeti. Yathā manussā pakatiyā aniddhimanto pathaviyā caṅkamantipi tiṭṭhantipi nisīdantipi seyyampi kappenti, evamevaṃ so iddhimā cetovasippatto ākāse antalikkhe caṅkamatipi tiṭṭhatipi nisīdatipi seyyampi kappeti, seyyathāpi pakkhī sakuṇo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "12"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Imepi candimasūriye evaṃmahiddhike evaṃmahānubhāve pāṇinā parāmasati parimajjatī"
      },
      "ti idha so iddhimā cetovasippatto ",
      " nisinnako vā nipannako vā candimasūriye āvajjati. Āvajjitvā ñāṇena adhiṭṭhāti – ‘‘hatthapāse hotū’’ti. Hatthapāse hoti. So nisinnako vā nipannako vā candimasūriye pāṇinā āmasati parāmasati parimajjati. Yathā manussā pakatiyā aniddhimanto kiñcideva rūpagataṃ hatthapāse āmasanti parāmasanti parimajjanti, evamevaṃ so iddhimā cetovasippatto nisinnako vā nipannako vā candimasūriye pāṇinā āmasati parāmasati parimajjati."
    ],
    "innerText": "12.Imepi candimasūriye evaṃmahiddhike evaṃmahānubhāve pāṇinā parāmasati parimajjatīti idha so iddhimā cetovasippatto nisinnako vā nipannako vā candimasūriye āvajjati. Āvajjitvā ñāṇena adhiṭṭhāti – ‘‘hatthapāse hotū’’ti. Hatthapāse hoti. So nisinnako vā nipannako vā candimasūriye pāṇinā āmasati parāmasati parimajjati. Yathā manussā pakatiyā aniddhimanto kiñcideva rūpagataṃ hatthapāse āmasanti parāmasanti parimajjanti, evamevaṃ so iddhimā cetovasippatto nisinnako vā nipannako vā candimasūriye pāṇinā āmasati parāmasati parimajjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yāva brahmalokāpi kāyena vasaṃ vattetī"
      },
      "ti sace so iddhimā cetovasippatto brahmalokaṃ gantukāmo hoti, dūrepi santike adhiṭṭhāti ",
      " – ‘‘santike hotū’’ti. Santike hoti. Santikepi dūre adhiṭṭhāti – ‘‘dūre hotū’’ti. Dūre hoti. Bahukampi thokaṃ adhiṭṭhāti – ‘‘thokaṃ hotū’’ti. Thokaṃ hoti. Thokampi bahukaṃ adhiṭṭhāti – ‘‘bahukaṃ hotū’’ti. Bahukaṃ hoti. Dibbena cakkhunā tassa brahmuno rūpaṃ passati. Dibbāya sotadhātuyā tassa brahmuno saddaṃ suṇāti. Cetopariyañāṇena tassa brahmuno cittaṃ pajānāti. Sace so iddhimā cetovasippatto dissamānena kāyena brahmalokaṃ gantukāmo hoti, kāyavasena cittaṃ pariṇāmeti, kāyavasena cittaṃ adhiṭṭhāti. Kāyavasena cittaṃ pariṇāmetvā, kāyavasena cittaṃ adhiṭṭhahitvā, sukhasaññañca ",
      " lahusaññañca okkamitvā dissamānena kāyena brahmalokaṃ gacchati. Sace so iddhimā cetovasippatto adissamānena kāyena brahmalokaṃ gantukāmo hoti, cittavasena kāyaṃ pariṇāmeti, cittavasena kāyaṃ adhiṭṭhāti. Cittavasena kāyaṃ pariṇāmetvā, cittavasena kāyaṃ adhiṭṭhahitvā sukhasaññañca lahusaññañca okkamitvā ",
      " adissamānena kāyena brahmalokaṃ gacchati. So tassa brahmuno purato rūpiṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[rūpaṃ (syā. ka.) dī. ni. 1.236 passitabbā]"
      },
      " abhinimmināti manomayaṃ sabbaṅgapaccaṅgiṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sabbaṅgapaccaṅgaṃ (syā. ka.)]"
      },
      " ahīnindriyaṃ. Sace so iddhimā caṅkamati, nimmitopi tattha caṅkamati. Sace so iddhimā tiṭṭhati, nimmitopi tattha tiṭṭhati. Sace so iddhimā nisīdati, nimmitopi tattha nisīdati. Sace so iddhimā seyyaṃ kappeti, nimmitopi tattha ",
      " seyyaṃ kappeti. Sace ",
      " so iddhimā dhūmāyati, nimmitopi tattha dhūmāyati. Sace so iddhimā pajjalati, nimmitopi tattha pajjalati. Sace so iddhimā dhammaṃ bhāsati, nimmitopi tattha dhammaṃ bhāsati. Sace so iddhimā pañhaṃ pucchati, nimmitopi tattha pañhaṃ pucchati. Sace so iddhimā pañhaṃ puṭṭho visajjeti, nimmitopi tattha pañhaṃ puṭṭho visajjeti. Sace so iddhimā tena brahmunā saddhiṃ santiṭṭhati sallapati sākacchaṃ samāpajjati, nimmitopi tattha tena brahmunā saddhiṃ santiṭṭhati sallapati sākacchaṃ samāpajjati. Yaññadeva so iddhimā karoti, taṃ tadeva hi so nimmito karotīti – ayaṃ adhiṭṭhānā iddhi."
    ],
    "innerText": "Yāva brahmalokāpi kāyena vasaṃ vattetīti sace so iddhimā cetovasippatto brahmalokaṃ gantukāmo hoti, dūrepi santike adhiṭṭhāti – ‘‘santike hotū’’ti. Santike hoti. Santikepi dūre adhiṭṭhāti – ‘‘dūre hotū’’ti. Dūre hoti. Bahukampi thokaṃ adhiṭṭhāti – ‘‘thokaṃ hotū’’ti. Thokaṃ hoti. Thokampi bahukaṃ adhiṭṭhāti – ‘‘bahukaṃ hotū’’ti. Bahukaṃ hoti. Dibbena cakkhunā tassa brahmuno rūpaṃ passati. Dibbāya sotadhātuyā tassa brahmuno saddaṃ suṇāti. Cetopariyañāṇena tassa brahmuno cittaṃ pajānāti. Sace so iddhimā cetovasippatto dissamānena kāyena brahmalokaṃ gantukāmo hoti, kāyavasena cittaṃ pariṇāmeti, kāyavasena cittaṃ adhiṭṭhāti. Kāyavasena cittaṃ pariṇāmetvā, kāyavasena cittaṃ adhiṭṭhahitvā, sukhasaññañca lahusaññañca okkamitvā dissamānena kāyena brahmalokaṃ gacchati. Sace so iddhimā cetovasippatto adissamānena kāyena brahmalokaṃ gantukāmo hoti, cittavasena kāyaṃ pariṇāmeti, cittavasena kāyaṃ adhiṭṭhāti. Cittavasena kāyaṃ pariṇāmetvā, cittavasena kāyaṃ adhiṭṭhahitvā sukhasaññañca lahusaññañca okkamitvā adissamānena kāyena brahmalokaṃ gacchati. So tassa brahmuno purato rūpiṃ [rūpaṃ (syā. ka.) dī. ni. 1.236 passitabbā] abhinimmināti manomayaṃ sabbaṅgapaccaṅgiṃ [sabbaṅgapaccaṅgaṃ (syā. ka.)] ahīnindriyaṃ. Sace so iddhimā caṅkamati, nimmitopi tattha caṅkamati. Sace so iddhimā tiṭṭhati, nimmitopi tattha tiṭṭhati. Sace so iddhimā nisīdati, nimmitopi tattha nisīdati. Sace so iddhimā seyyaṃ kappeti, nimmitopi tattha seyyaṃ kappeti. Sace so iddhimā dhūmāyati, nimmitopi tattha dhūmāyati. Sace so iddhimā pajjalati, nimmitopi tattha pajjalati. Sace so iddhimā dhammaṃ bhāsati, nimmitopi tattha dhammaṃ bhāsati. Sace so iddhimā pañhaṃ pucchati, nimmitopi tattha pañhaṃ pucchati. Sace so iddhimā pañhaṃ puṭṭho visajjeti, nimmitopi tattha pañhaṃ puṭṭho visajjeti. Sace so iddhimā tena brahmunā saddhiṃ santiṭṭhati sallapati sākacchaṃ samāpajjati, nimmitopi tattha tena brahmunā saddhiṃ santiṭṭhati sallapati sākacchaṃ samāpajjati. Yaññadeva so iddhimā karoti, taṃ tadeva hi so nimmito karotīti – ayaṃ adhiṭṭhānā iddhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "13"
      },
      ". Katamā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vikubbanā iddhi?"
      },
      " Sikhissa bhagavato arahato sammāsambuddhassa abhibhū nāma sāvako brahmaloke ṭhito sahassilokadhātuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sahassīlokadhātuṃ (syā.) vatthu saṃ. ni. 1.185]"
      },
      " sarena viññāpesi. So dissamānenapi kāyena dhammaṃ desesi; adissamānenapi kāyena dhammaṃ desesi; dissamānenapi heṭṭhimena upaḍḍhakāyena adissamānenapi uparimena upaḍḍhakāyena dhammaṃ desesi. Dissamānenapi uparimena upaḍḍhakāyena, adissamānenapi heṭṭhimena upaḍḍhakāyena dhammaṃ desesi. So pakativaṇṇaṃ vijahitvā kumārakavaṇṇaṃ vā dasseti, nāgavaṇṇaṃ vā dasseti, supaṇṇavaṇṇaṃ vā dasseti, yakkhavaṇṇaṃ vā dasseti, indavaṇṇaṃ vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[asuravaṇṇaṃ vā dasseti, indavaṇṇaṃ vā (syā.)]"
      },
      " dasseti, devavaṇṇaṃ vā dasseti ",
      ", brahmavaṇṇaṃ vā dasseti, samuddavaṇṇaṃ vā dasseti, pabbatavaṇṇaṃ vā dasseti, vanavaṇṇaṃ vā dasseti, sīhavaṇṇaṃ vā dasseti, byagghavaṇṇaṃ vā dasseti, dīpivaṇṇaṃ vā dasseti, hatthimpi dasseti, assampi dasseti, rathampi dasseti, pattimpi dasseti, vividhampi senābyūhaṃ dassetīti – ayaṃ vikubbanā iddhi."
    ],
    "innerText": "13. Katamā vikubbanā iddhi? Sikhissa bhagavato arahato sammāsambuddhassa abhibhū nāma sāvako brahmaloke ṭhito sahassilokadhātuṃ [sahassīlokadhātuṃ (syā.) vatthu saṃ. ni. 1.185] sarena viññāpesi. So dissamānenapi kāyena dhammaṃ desesi; adissamānenapi kāyena dhammaṃ desesi; dissamānenapi heṭṭhimena upaḍḍhakāyena adissamānenapi uparimena upaḍḍhakāyena dhammaṃ desesi. Dissamānenapi uparimena upaḍḍhakāyena, adissamānenapi heṭṭhimena upaḍḍhakāyena dhammaṃ desesi. So pakativaṇṇaṃ vijahitvā kumārakavaṇṇaṃ vā dasseti, nāgavaṇṇaṃ vā dasseti, supaṇṇavaṇṇaṃ vā dasseti, yakkhavaṇṇaṃ vā dasseti, indavaṇṇaṃ vā [asuravaṇṇaṃ vā dasseti, indavaṇṇaṃ vā (syā.)] dasseti, devavaṇṇaṃ vā dasseti , brahmavaṇṇaṃ vā dasseti, samuddavaṇṇaṃ vā dasseti, pabbatavaṇṇaṃ vā dasseti, vanavaṇṇaṃ vā dasseti, sīhavaṇṇaṃ vā dasseti, byagghavaṇṇaṃ vā dasseti, dīpivaṇṇaṃ vā dasseti, hatthimpi dasseti, assampi dasseti, rathampi dasseti, pattimpi dasseti, vividhampi senābyūhaṃ dassetīti – ayaṃ vikubbanā iddhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "14"
      },
      ". Katamā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "manomayā iddhi? "
      },
      " Idha bhikkhu imamhā kāyā aññaṃ kāyaṃ abhinimmināti rūpiṃ manomayaṃ sabbaṅgapaccaṅgiṃ ",
      " ahīnindriyaṃ. Seyyathāpi puriso muñjamhā īsikaṃ ",
      " pavāheyya. Tassa evamassa – ‘‘ayaṃ muñjo, ayaṃ īsikā. Añño muñjo, aññā īsikā. Muñjamhā tveva īsikā pavāḷhā’’ti. Seyyathā vā pana puriso asiṃ kosiyā pavāheyya. Tassa evamassa – ‘‘ayaṃ asi, ayaṃ kosi. Añño asi, aññā kosi. Kosiyā tveva asi pavāḷho’’ti. Seyyathā vā pana puriso ahiṃ karaṇḍā uddhareyya. Tassa evamassa – ‘‘ayaṃ ahi, ayaṃ karaṇḍo. Añño ahi, añño karaṇḍo. Karaṇḍā tveva ahi ubbhato’’ti. Evamevaṃ bhikkhu imamhā kāyā aññaṃ kāyaṃ abhinimmināti rūpiṃ manomayaṃ sabbaṅgapaccaṅgiṃ ahīnindriyaṃ. Ayaṃ manomayā iddhi."
    ],
    "innerText": "14. Katamā manomayā iddhi? Idha bhikkhu imamhā kāyā aññaṃ kāyaṃ abhinimmināti rūpiṃ manomayaṃ sabbaṅgapaccaṅgiṃ ahīnindriyaṃ. Seyyathāpi puriso muñjamhā īsikaṃ pavāheyya. Tassa evamassa – ‘‘ayaṃ muñjo, ayaṃ īsikā. Añño muñjo, aññā īsikā. Muñjamhā tveva īsikā pavāḷhā’’ti. Seyyathā vā pana puriso asiṃ kosiyā pavāheyya. Tassa evamassa – ‘‘ayaṃ asi, ayaṃ kosi. Añño asi, aññā kosi. Kosiyā tveva asi pavāḷho’’ti. Seyyathā vā pana puriso ahiṃ karaṇḍā uddhareyya. Tassa evamassa – ‘‘ayaṃ ahi, ayaṃ karaṇḍo. Añño ahi, añño karaṇḍo. Karaṇḍā tveva ahi ubbhato’’ti. Evamevaṃ bhikkhu imamhā kāyā aññaṃ kāyaṃ abhinimmināti rūpiṃ manomayaṃ sabbaṅgapaccaṅgiṃ ahīnindriyaṃ. Ayaṃ manomayā iddhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "15"
      },
      ". Katamā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ñāṇavipphārā iddhi?"
      },
      " Aniccānupassanā niccasaññāya pahānaṭṭho ijjhatīti – ñāṇavipphārā iddhi. Dukkhānupassanā sukhasaññāya… anattānupassanā attasaññāya… nibbidānupassanāya ",
      " nandiyā… virāgānupassanāya rāgassa… nirodhānupassanāya samudayassa… paṭinissaggānupassanāya ādānassa pahānaṭṭho ijjhatīti – ñāṇavipphārā iddhi. Āyasmato bākulassa ñāṇavipphārā iddhi, āyasmato saṃkiccassa ñāṇavipphārā iddhi, āyasmato bhūtapālassa ñāṇavipphārā iddhi. Ayaṃ ñāṇavipphārā iddhi."
    ],
    "innerText": "15. Katamā ñāṇavipphārā iddhi? Aniccānupassanā niccasaññāya pahānaṭṭho ijjhatīti – ñāṇavipphārā iddhi. Dukkhānupassanā sukhasaññāya… anattānupassanā attasaññāya… nibbidānupassanāya nandiyā… virāgānupassanāya rāgassa… nirodhānupassanāya samudayassa… paṭinissaggānupassanāya ādānassa pahānaṭṭho ijjhatīti – ñāṇavipphārā iddhi. Āyasmato bākulassa ñāṇavipphārā iddhi, āyasmato saṃkiccassa ñāṇavipphārā iddhi, āyasmato bhūtapālassa ñāṇavipphārā iddhi. Ayaṃ ñāṇavipphārā iddhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "16"
      },
      ". Katamā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samādhivipphārā iddhi?"
      },
      " Paṭhamena jhānena nīvaraṇānaṃ pahānaṭṭho ijjhatīti – samādhivipphārā iddhi. Dutiyena jhānena vitakkavicārānaṃ pahānaṭṭho ijjhatīti – samādhivipphārā iddhi. Tatiyena jhānena pītiyā pahānaṭṭho ijjhatīti…pe… catutthena jhānena sukhadukkhānaṃ pahānaṭṭho ijjhatīti…pe… ākāsānañcāyatanasamāpattiyā rūpasaññāya paṭighasaññāya nānattasaññāya pahānaṭṭho ijjhatīti…pe… viññāṇañcāyatanasamāpattiyā ākāsānañcāyatanasaññāya pahānaṭṭho ijjhatīti…pe… ākiñcaññāyatanasamāpattiyā viññāṇañcāyatanasaññāya ",
      " pahānaṭṭho ijjhatīti…pe… nevasaññānāsaññāyatanasamāpattiyā ākiñcaññāyatanasaññāya pahānaṭṭho ijjhatīti – samādhivipphārā iddhi. Āyasmato sāriputtassa samādhivipphārā iddhi, āyasmato sañjīvassa samādhivipphārā iddhi ",
      ", āyasmato khāṇukoṇḍaññassa samādhivipphārā iddhi, uttarāya upāsikāya samādhivipphārā iddhi, sāmāvatiyā upāsikāya ",
      " samādhivipphārā iddhi. Ayaṃ samādhivipphārā iddhi."
    ],
    "innerText": "16. Katamā samādhivipphārā iddhi? Paṭhamena jhānena nīvaraṇānaṃ pahānaṭṭho ijjhatīti – samādhivipphārā iddhi. Dutiyena jhānena vitakkavicārānaṃ pahānaṭṭho ijjhatīti – samādhivipphārā iddhi. Tatiyena jhānena pītiyā pahānaṭṭho ijjhatīti…pe… catutthena jhānena sukhadukkhānaṃ pahānaṭṭho ijjhatīti…pe… ākāsānañcāyatanasamāpattiyā rūpasaññāya paṭighasaññāya nānattasaññāya pahānaṭṭho ijjhatīti…pe… viññāṇañcāyatanasamāpattiyā ākāsānañcāyatanasaññāya pahānaṭṭho ijjhatīti…pe… ākiñcaññāyatanasamāpattiyā viññāṇañcāyatanasaññāya pahānaṭṭho ijjhatīti…pe… nevasaññānāsaññāyatanasamāpattiyā ākiñcaññāyatanasaññāya pahānaṭṭho ijjhatīti – samādhivipphārā iddhi. Āyasmato sāriputtassa samādhivipphārā iddhi, āyasmato sañjīvassa samādhivipphārā iddhi , āyasmato khāṇukoṇḍaññassa samādhivipphārā iddhi, uttarāya upāsikāya samādhivipphārā iddhi, sāmāvatiyā upāsikāya samādhivipphārā iddhi. Ayaṃ samādhivipphārā iddhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "17"
      },
      ". Katamā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ariyā iddhi?"
      },
      " Idha bhikkhu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ma. ni. 3.462 passitabbā]"
      },
      " sace ākaṅkhati – ‘‘paṭikūle appaṭikūlasaññī vihareyya’’nti, appaṭikūlasaññī tattha viharati. Sace ākaṅkhati – ‘‘appaṭikūle paṭikūlasaññī vihareyya’’nti, paṭikūlasaññī tattha viharati. Sace ākaṅkhati – ‘‘paṭikūle ca appaṭikūle ca appaṭikūlasaññī vihareyya’’nti, appaṭikūlasaññī tattha viharati. Sace ākaṅkhati – ‘‘appaṭikūle ca paṭikūle ",
      " ca paṭikūlasaññī vihareyya’’nti, paṭikūlasaññī tattha viharati. Sace ākaṅkhati – ‘‘paṭikūle ca appaṭikūle ca tadubhayaṃ abhinivajjetvā upekkhako vihareyyaṃ sato sampajāno’’ti, upekkhako tattha viharati sato sampajāno."
    ],
    "innerText": "17. Katamā ariyā iddhi? Idha bhikkhu [ma. ni. 3.462 passitabbā] sace ākaṅkhati – ‘‘paṭikūle appaṭikūlasaññī vihareyya’’nti, appaṭikūlasaññī tattha viharati. Sace ākaṅkhati – ‘‘appaṭikūle paṭikūlasaññī vihareyya’’nti, paṭikūlasaññī tattha viharati. Sace ākaṅkhati – ‘‘paṭikūle ca appaṭikūle ca appaṭikūlasaññī vihareyya’’nti, appaṭikūlasaññī tattha viharati. Sace ākaṅkhati – ‘‘appaṭikūle ca paṭikūle ca paṭikūlasaññī vihareyya’’nti, paṭikūlasaññī tattha viharati. Sace ākaṅkhati – ‘‘paṭikūle ca appaṭikūle ca tadubhayaṃ abhinivajjetvā upekkhako vihareyyaṃ sato sampajāno’’ti, upekkhako tattha viharati sato sampajāno."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭikūle appaṭikūlasaññī viharati?"
      },
      " Aniṭṭhasmiṃ vatthusmiṃ mettāya vā pharati, dhātuto vā upasaṃharati. Evaṃ paṭikūle appaṭikūlasaññī viharati."
    ],
    "innerText": "Kathaṃ paṭikūle appaṭikūlasaññī viharati? Aniṭṭhasmiṃ vatthusmiṃ mettāya vā pharati, dhātuto vā upasaṃharati. Evaṃ paṭikūle appaṭikūlasaññī viharati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "appaṭikūle paṭikūlasaññī viharati?"
      },
      " Iṭṭhasmiṃ vatthusmiṃ asubhāya vā pharati, aniccato vā upasaṃharati. Evaṃ appaṭikūle paṭikūlasaññī viharati."
    ],
    "innerText": "Kathaṃ appaṭikūle paṭikūlasaññī viharati? Iṭṭhasmiṃ vatthusmiṃ asubhāya vā pharati, aniccato vā upasaṃharati. Evaṃ appaṭikūle paṭikūlasaññī viharati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭikūle ca appaṭikūle ca appaṭikūlasaññī viharati? "
      },
      " Aniṭṭhasmiñca iṭṭhasmiñca vatthusmiṃ mettāya vā pharati, dhātuto vā upasaṃharati. Evaṃ paṭikūle ca appaṭikūle ca appaṭikūlasaññī viharati ",
      "."
    ],
    "innerText": "Kathaṃ paṭikūle ca appaṭikūle ca appaṭikūlasaññī viharati? Aniṭṭhasmiñca iṭṭhasmiñca vatthusmiṃ mettāya vā pharati, dhātuto vā upasaṃharati. Evaṃ paṭikūle ca appaṭikūle ca appaṭikūlasaññī viharati ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "appaṭikūle ca paṭikūle ca paṭikūlasaññī viharati? "
      },
      " Iṭṭhasmiñca aniṭṭhasmiñca vatthusmiṃ asubhāya vā pharati, aniccato vā upasaṃharati. Evaṃ appaṭikūle ca paṭikūle ca paṭikūlasaññī viharati."
    ],
    "innerText": "Kathaṃ appaṭikūle ca paṭikūle ca paṭikūlasaññī viharati? Iṭṭhasmiñca aniṭṭhasmiñca vatthusmiṃ asubhāya vā pharati, aniccato vā upasaṃharati. Evaṃ appaṭikūle ca paṭikūle ca paṭikūlasaññī viharati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭikūle ca appaṭikūle ca tadubhayaṃ abhinivajjetvā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upekkhako viharati sato sampajāno?"
      },
      " Idha bhikkhu cakkhunā rūpaṃ disvā neva sumano hoti na dummano, upekkhako viharati sato sampajāno. Sotena saddaṃ sutvā…pe… ghānena gandhaṃ ghāyitvā… jivhāya rasaṃ sāyitvā… kāyena ",
      " phoṭṭhabbaṃ phusitvā… manasā dhammaṃ viññāya neva sumano hoti na dummano, upekkhako viharati sato sampajāno. Evaṃ paṭikūle ca appaṭikūle ca tadubhayaṃ abhinivajjetvā upekkhako viharati sato sampajāno. Ayaṃ ariyā iddhi."
    ],
    "innerText": "Kathaṃ paṭikūle ca appaṭikūle ca tadubhayaṃ abhinivajjetvāupekkhako viharati sato sampajāno? Idha bhikkhu cakkhunā rūpaṃ disvā neva sumano hoti na dummano, upekkhako viharati sato sampajāno. Sotena saddaṃ sutvā…pe… ghānena gandhaṃ ghāyitvā… jivhāya rasaṃ sāyitvā… kāyena phoṭṭhabbaṃ phusitvā… manasā dhammaṃ viññāya neva sumano hoti na dummano, upekkhako viharati sato sampajāno. Evaṃ paṭikūle ca appaṭikūle ca tadubhayaṃ abhinivajjetvā upekkhako viharati sato sampajāno. Ayaṃ ariyā iddhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "18"
      },
      ". Katamā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kammavipākajā iddhi?"
      },
      " Sabbesaṃ pakkhīnaṃ, sabbesaṃ devānaṃ, ekaccānaṃ manussānaṃ, ekaccānaṃ vinipātikānaṃ. Ayaṃ kammavipākajā iddhi."
    ],
    "innerText": "18. Katamā kammavipākajā iddhi? Sabbesaṃ pakkhīnaṃ, sabbesaṃ devānaṃ, ekaccānaṃ manussānaṃ, ekaccānaṃ vinipātikānaṃ. Ayaṃ kammavipākajā iddhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katamā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "puññavato iddhi?"
      },
      " Rājā cakkavattī ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[cakkavatti (syā.)]"
      },
      " vehāsaṃ gacchati saddhiṃ caturaṅginiyā senāya, antamaso assabandhagopurise ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[assabandhagopake purise (syā.)]"
      },
      " upādāya. Jotikassa gahapatissa puññavato iddhi, jaṭilassa gahapatissa puññavato iddhi, meṇḍakassa gahapatissa puññavato ",
      " iddhi, ghositassa gahapatissa puññavato iddhi, pañcannaṃ mahāpuññānaṃ puññavato iddhi. Ayaṃ puññavato iddhi."
    ],
    "innerText": "Katamā puññavato iddhi? Rājā cakkavattī [cakkavatti (syā.)] vehāsaṃ gacchati saddhiṃ caturaṅginiyā senāya, antamaso assabandhagopurise [assabandhagopake purise (syā.)] upādāya. Jotikassa gahapatissa puññavato iddhi, jaṭilassa gahapatissa puññavato iddhi, meṇḍakassa gahapatissa puññavato iddhi, ghositassa gahapatissa puññavato iddhi, pañcannaṃ mahāpuññānaṃ puññavato iddhi. Ayaṃ puññavato iddhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katamā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vijjāmayā iddhi?"
      },
      " Vijjādharā vijjaṃ parijappetvā vehāsaṃ gacchanti, ākāse antalikkhe hatthimpi dassenti, assampi dassenti, rathampi dassenti, pattimpi dassenti, vividhampi senābyūhaṃ dassenti. Ayaṃ vijjāmayā iddhi."
    ],
    "innerText": "Katamā vijjāmayā iddhi? Vijjādharā vijjaṃ parijappetvā vehāsaṃ gacchanti, ākāse antalikkhe hatthimpi dassenti, assampi dassenti, rathampi dassenti, pattimpi dassenti, vividhampi senābyūhaṃ dassenti. Ayaṃ vijjāmayā iddhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tattha tattha sammā payogapaccayā ijjhanaṭṭhena iddhi?"
      },
      " Nekkhammena kāmacchandassa pahānaṭṭho ijjhatīti – tattha tattha sammā payogapaccayā ijjhanaṭṭhena ",
      " iddhi. Abyāpādena byāpādassa pahānaṭṭho ijjhatīti – tattha tattha sammā payogapaccayā ijjhanaṭṭhena iddhi…pe… arahattamaggena sabbakilesānaṃ pahānaṭṭho ijjhatīti – tattha tattha sammā payogapaccayā ijjhanaṭṭhena iddhi. Evaṃ tattha tattha sammā payogapaccayā ijjhanaṭṭhena iddhi. Imā dasa iddhiyo."
    ],
    "innerText": "Kathaṃ tattha tattha sammā payogapaccayā ijjhanaṭṭhena iddhi? Nekkhammena kāmacchandassa pahānaṭṭho ijjhatīti – tattha tattha sammā payogapaccayā ijjhanaṭṭhena iddhi. Abyāpādena byāpādassa pahānaṭṭho ijjhatīti – tattha tattha sammā payogapaccayā ijjhanaṭṭhena iddhi…pe… arahattamaggena sabbakilesānaṃ pahānaṭṭho ijjhatīti – tattha tattha sammā payogapaccayā ijjhanaṭṭhena iddhi. Evaṃ tattha tattha sammā payogapaccayā ijjhanaṭṭhena iddhi. Imā dasa iddhiyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iddhikathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "3. Abhisamayakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "19"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhisamayo"
      },
      "ti ",
      ". Kena abhisameti? Cittena abhisameti."
    ],
    "innerText": "19.Abhisamayoti . Kena abhisameti? Cittena abhisameti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Hañci cittena abhisameti, tena hi aññāṇī abhisameti? Na aññāṇī abhisameti. Ñāṇena abhisameti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Hañci ",
      " ñāṇena abhisameti, tena hi acittena ca ñāṇena ca acittako ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[tena hi acittako (syā.)]"
      },
      " abhisameti? Na acittako abhisameti. Cittena ca ñāṇena ca abhisameti."
    ],
    "innerText": "Hañci ñāṇena abhisameti, tena hi acittena ca ñāṇena ca acittako [tena hi acittako (syā.)] abhisameti? Na acittako abhisameti. Cittena ca ñāṇena ca abhisameti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Hañci cittena ca ñāṇena ca abhisameti, tena hi kāmāvacaracittena ca ñāṇena ca abhisameti? Na kāmāvacaracittena ca ñāṇena ca abhisameti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena hi rūpāvacaracittena ca ñāṇena ca abhisameti? Na rūpāvacaracittena ca ñāṇena ca abhisameti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena hi arūpāvacaracittena ca ñāṇena ca abhisameti? Na arūpāvacaracittena ca ñāṇena ca abhisameti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena hi kammassakatacittena ca ñāṇena ca abhisameti? Na kammassakatacittena ca ñāṇena ca abhisameti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena ",
      " hi saccānulomikacittena ca ñāṇena ca abhisameti? Na saccānulomikacittena ca ñāṇena ca abhisameti."
    ],
    "innerText": "Tena hi saccānulomikacittena ca ñāṇena ca abhisameti? Na saccānulomikacittena ca ñāṇena ca abhisameti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena hi atītacittena ca ñāṇena ca abhisameti? Na atītacittena ca ñāṇena ca abhisameti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena hi anāgatacittena ca ñāṇena ca abhisameti? Na anāgatacittena ca ñāṇena ca abhisameti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena hi paccuppannalokiyacittena ca ñāṇena ca abhisameti? Na paccuppannalokiyacittena ca ñāṇena ca abhisameti. Lokuttaramaggakkhaṇe paccuppannacittena ca ñāṇena ca abhisameti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ lokuttaramaggakkhaṇe paccuppannacittena ca ñāṇena ",
      " ca abhisameti? Lokuttaramaggakkhaṇe uppādādhipateyyaṃ cittaṃ ñāṇassa hetu paccayo ca. Taṃsampayuttaṃ ",
      " nirodhagocaraṃ dassanādhipateyyaṃ ñāṇaṃ cittassa hetu paccayo ca. Taṃsampayuttaṃ ñāṇaṃ nirodhagocaraṃ. Evaṃ lokuttaramaggakkhaṇe paccuppannacittena ca ñāṇena ca abhisameti."
    ],
    "innerText": "Kathaṃ lokuttaramaggakkhaṇe paccuppannacittena ca ñāṇena ca abhisameti? Lokuttaramaggakkhaṇe uppādādhipateyyaṃ cittaṃ ñāṇassa hetu paccayo ca. Taṃsampayuttaṃ nirodhagocaraṃ dassanādhipateyyaṃ ñāṇaṃ cittassa hetu paccayo ca. Taṃsampayuttaṃ ñāṇaṃ nirodhagocaraṃ. Evaṃ lokuttaramaggakkhaṇe paccuppannacittena ca ñāṇena ca abhisameti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "20"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kiṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nu ettakoyeva abhisamayoti? Na hi."
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lokuttara"
      },
      "maggakkhaṇe dassanābhisamayo sammādiṭṭhi, abhiniropanābhisamayo sammāsaṅkappo, pariggahābhisamayo sammāvācā, samuṭṭhānābhisamayo sammākammanto, vodānābhisamayo sammāājīvo, paggahābhisamayo sammāvāyāmo, upaṭṭhānābhisamayo sammāsati, avikkhepābhisamayo sammāsamādhi; upaṭṭhānābhisamayo satisambojjhaṅgo, pavicayābhisamayo dhammavicayasambojjhaṅgo, paggahābhisamayo vīriyasambojjhaṅgo, pharaṇābhisamayo pītisambojjhaṅgo, upasamābhisamayo passaddhisambojjhaṅgo, avikkhepābhisamayo samādhisambojjhaṅgo, paṭisaṅkhānābhisamayo upekkhāsambojjhaṅgo; assaddhiye akampiyābhisamayo saddhābalaṃ, kosajje akampiyābhisamayo vīriyabalaṃ, pamāde akampiyābhisamayo satibalaṃ, uddhacce akampiyābhisamayo samādhibalaṃ, avijjāya akampiyābhisamayo paññābalaṃ; adhimokkhābhisamayo saddhindriyaṃ, paggahābhisamayo vīriyindriyaṃ, upaṭṭhānābhisamayo satindriyaṃ, avikkhepābhisamayo samādhindriyaṃ, dassanābhisamayo paññindriyaṃ. Ādhipateyyaṭṭhena indriyābhisamayo, akampiyaṭṭhena balābhisamayo, niyyānaṭṭhena ",
      " bojjhaṅgābhisamayo, hetuṭṭhena maggābhisamayo, upaṭṭhānaṭṭhena satipaṭṭhānābhisamayo, padahaṭṭhena sammappadhānābhisamayo ",
      ", ijjhanaṭṭhena iddhipādābhisamayo, tathaṭṭhena saccābhisamayo, avikkhepaṭṭhena samathābhisamayo, anupassanaṭṭhena vipassanābhisamayo, ekarasaṭṭhena samathavipassanābhisamayo, anativattanaṭṭhena yuganaddhābhisamayo, saṃvaraṭṭhena sīlavisuddhiabhisamayo, avikkhepaṭṭhena visuddhiabhisamayo, dassanaṭṭhena diṭṭhivisuddhiabhisamayo, muttaṭṭhena vimokkhābhisamayo, paṭivedhaṭṭhena vijjābhisamayo, pariccāgaṭṭhena vimuttiabhisamayo, samucchedaṭṭhena khaye ñāṇaṃ abhisamayo. Chando mūlaṭṭhena abhisamayo, manasikāro samuṭṭhānaṭṭhena abhisamayo, phasso samodhānaṭṭhena abhisamayo, vedanā samosaraṇaṭṭhena abhisamayo, samādhi pamukhaṭṭhena abhisamayo ",
      ", sati ādhipateyyaṭṭhena abhisamayo, paññā tatuttaraṭṭhena abhisamayo, vimutti sāraṭṭhena abhisamayo, amatogadhaṃ nibbānaṃ pariyosānaṭṭhena abhisamayo."
    ],
    "innerText": "20.Kiṃnu ettakoyeva abhisamayoti? Na hi.Lokuttaramaggakkhaṇe dassanābhisamayo sammādiṭṭhi, abhiniropanābhisamayo sammāsaṅkappo, pariggahābhisamayo sammāvācā, samuṭṭhānābhisamayo sammākammanto, vodānābhisamayo sammāājīvo, paggahābhisamayo sammāvāyāmo, upaṭṭhānābhisamayo sammāsati, avikkhepābhisamayo sammāsamādhi; upaṭṭhānābhisamayo satisambojjhaṅgo, pavicayābhisamayo dhammavicayasambojjhaṅgo, paggahābhisamayo vīriyasambojjhaṅgo, pharaṇābhisamayo pītisambojjhaṅgo, upasamābhisamayo passaddhisambojjhaṅgo, avikkhepābhisamayo samādhisambojjhaṅgo, paṭisaṅkhānābhisamayo upekkhāsambojjhaṅgo; assaddhiye akampiyābhisamayo saddhābalaṃ, kosajje akampiyābhisamayo vīriyabalaṃ, pamāde akampiyābhisamayo satibalaṃ, uddhacce akampiyābhisamayo samādhibalaṃ, avijjāya akampiyābhisamayo paññābalaṃ; adhimokkhābhisamayo saddhindriyaṃ, paggahābhisamayo vīriyindriyaṃ, upaṭṭhānābhisamayo satindriyaṃ, avikkhepābhisamayo samādhindriyaṃ, dassanābhisamayo paññindriyaṃ. Ādhipateyyaṭṭhena indriyābhisamayo, akampiyaṭṭhena balābhisamayo, niyyānaṭṭhena bojjhaṅgābhisamayo, hetuṭṭhena maggābhisamayo, upaṭṭhānaṭṭhena satipaṭṭhānābhisamayo, padahaṭṭhena sammappadhānābhisamayo , ijjhanaṭṭhena iddhipādābhisamayo, tathaṭṭhena saccābhisamayo, avikkhepaṭṭhena samathābhisamayo, anupassanaṭṭhena vipassanābhisamayo, ekarasaṭṭhena samathavipassanābhisamayo, anativattanaṭṭhena yuganaddhābhisamayo, saṃvaraṭṭhena sīlavisuddhiabhisamayo, avikkhepaṭṭhena visuddhiabhisamayo, dassanaṭṭhena diṭṭhivisuddhiabhisamayo, muttaṭṭhena vimokkhābhisamayo, paṭivedhaṭṭhena vijjābhisamayo, pariccāgaṭṭhena vimuttiabhisamayo, samucchedaṭṭhena khaye ñāṇaṃ abhisamayo. Chando mūlaṭṭhena abhisamayo, manasikāro samuṭṭhānaṭṭhena abhisamayo, phasso samodhānaṭṭhena abhisamayo, vedanā samosaraṇaṭṭhena abhisamayo, samādhi pamukhaṭṭhena abhisamayo , sati ādhipateyyaṭṭhena abhisamayo, paññā tatuttaraṭṭhena abhisamayo, vimutti sāraṭṭhena abhisamayo, amatogadhaṃ nibbānaṃ pariyosānaṭṭhena abhisamayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "21"
      },
      ". Kiṃ ",
      " nu ettakoyeva abhisamayoti? Na hi. Sotāpattimaggakkhaṇe dassanābhisamayo sammādiṭṭhi…pe… amatogadhaṃ nibbānaṃ pariyosānaṭṭhena abhisamayo."
    ],
    "innerText": "21. Kiṃ nu ettakoyeva abhisamayoti? Na hi. Sotāpattimaggakkhaṇe dassanābhisamayo sammādiṭṭhi…pe… amatogadhaṃ nibbānaṃ pariyosānaṭṭhena abhisamayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kiṃ nu ettakoyeva abhisamayoti? Na hi. Sotāpattiphalakkhaṇe dassanābhisamayo sammādiṭṭhi…pe… paṭippassaddhaṭṭhena anuppāde ñāṇaṃ abhisamayo. Chando mūlaṭṭhena abhisamayo…pe… amatogadhaṃ ",
      "5 nibbānaṃ pariyosānaṭṭhena abhisamayo."
    ],
    "innerText": "Kiṃ nu ettakoyeva abhisamayoti? Na hi. Sotāpattiphalakkhaṇe dassanābhisamayo sammādiṭṭhi…pe… paṭippassaddhaṭṭhena anuppāde ñāṇaṃ abhisamayo. Chando mūlaṭṭhena abhisamayo…pe… amatogadhaṃ 5 nibbānaṃ pariyosānaṭṭhena abhisamayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kiṃ nu ettakoyeva abhisamayoti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Na hi. Sakadāgāmimaggakkhaṇe…pe… sakadāgāmiphalakkhaṇe… anāgāmimaggakkhaṇe… anāgāmiphalakkhaṇe… arahattamaggakkhaṇe…pe… arahattaphalakkhaṇe dassanābhisamayo sammādiṭṭhi, abhiniropanābhisamayo sammāsaṅkappo…pe… paṭippassaddhaṭṭhena anuppāde ñāṇaṃ abhisamayo. Chando mūlaṭṭhena abhisamayo…pe… amatogadhaṃ nibbānaṃ pariyosānaṭṭhena abhisamayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yvāyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[syāyaṃ (syā. pī.)]"
      },
      " kilese pajahati, atīte kilese pajahati…pe… anāgate kilese pajahati, paccuppanne kilese pajahati, atīte kilese pajahatīti. Hañci atīte kilese pajahati, tena hi khīṇaṃ khepeti, niruddhaṃ nirodheti, vigataṃ vigameti, atthaṅgataṃ atthaṅgameti, atītaṃ yaṃ na atthi taṃ pajahatīti? Na atīte kilese pajahatīti. Anāgate kilese pajahatīti. Hañci ",
      " anāgate kilese pajahati, tena hi ajātaṃ pajahati, anibbattaṃ pajahati, anuppannaṃ pajahati, apātubhūtaṃ pajahati, anāgataṃ yaṃ na atthi taṃ pajahatīti? Na anāgate kilese pajahatīti. Paccuppanne kilese pajahatīti. Hañci paccuppanne kilese pajahati, tena hi ratto rāgaṃ pajahati, duṭṭho dosaṃ pajahati, mūḷho mohaṃ pajahati, vinibaddho mānaṃ pajahati, parāmaṭṭho diṭṭhiṃ pajahati ",
      ","
    ],
    "innerText": "Yvāyaṃ [syāyaṃ (syā. pī.)] kilese pajahati, atīte kilese pajahati…pe… anāgate kilese pajahati, paccuppanne kilese pajahati, atīte kilese pajahatīti. Hañci atīte kilese pajahati, tena hi khīṇaṃ khepeti, niruddhaṃ nirodheti, vigataṃ vigameti, atthaṅgataṃ atthaṅgameti, atītaṃ yaṃ na atthi taṃ pajahatīti? Na atīte kilese pajahatīti. Anāgate kilese pajahatīti. Hañci anāgate kilese pajahati, tena hi ajātaṃ pajahati, anibbattaṃ pajahati, anuppannaṃ pajahati, apātubhūtaṃ pajahati, anāgataṃ yaṃ na atthi taṃ pajahatīti? Na anāgate kilese pajahatīti. Paccuppanne kilese pajahatīti. Hañci paccuppanne kilese pajahati, tena hi ratto rāgaṃ pajahati, duṭṭho dosaṃ pajahati, mūḷho mohaṃ pajahati, vinibaddho mānaṃ pajahati, parāmaṭṭho diṭṭhiṃ pajahati ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vikkhepagato uddhaccaṃ pajahati, aniṭṭhaṅgato vicikicchaṃ pajahati, thāmagato anusayaṃ pajahati, kaṇhasukkadhammā yuganaddhā ",
      " samameva vattanti, saṃkilesikā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[taṃsaṃkilesikā (syā. ka.)]"
      },
      " maggabhāvanā hoti?"
    ],
    "innerText": "Vikkhepagato uddhaccaṃ pajahati, aniṭṭhaṅgato vicikicchaṃ pajahati, thāmagato anusayaṃ pajahati, kaṇhasukkadhammā yuganaddhā samameva vattanti, saṃkilesikā [taṃsaṃkilesikā (syā. ka.)] maggabhāvanā hoti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Na hi atīte kilese pajahati, na anāgate kilese pajahati, na paccuppanne kilese pajahatīti. Hañci na atīte kilese pajahati, na ",
      " anāgate…pe… na paccuppanne kilese pajahati, tena hi natthi maggabhāvanā, natthi phalasacchikiriyā, natthi kilesappahānaṃ, natthi dhammābhisamayoti? Atthi maggabhāvanā, atthi phalasacchikiriyā, atthi kilesappahānaṃ, atthi dhammābhisamayo. Yathā kathaṃ viya? Seyyathāpi taruṇo rukkho ajātaphalo. Tamenaṃ puriso mūlaṃ chindeyya. Ye tassa rukkhassa ajātaphalā, te ajātāyeva na jāyanti, anibbattāyeva na nibbattanti, anuppannāyeva na uppajjanti, apātubhūtāyeva na pātubhavanti. Evamevaṃ uppādo hetu, uppādo paccayo kilesānaṃ nibbattiyāti. Uppāde ādīnavaṃ disvā anuppāde cittaṃ pakkhandati. Anuppāde cittassa pakkhandattā ye uppādapaccayā kilesā nibbatteyyuṃ, te ajātāyeva na jāyanti, anibbattāyeva na nibbattanti, anuppannāyeva na uppajjanti, apātubhūtāyeva na pātubhavanti. Evaṃ hetunirodhā dukkhanirodho. Pavattaṃ hetu, nimittaṃ hetu, āyūhanā hetu. Āyūhanā paccayo kilesānaṃ nibbattiyāti. Āyūhane ādīnavaṃ disvā anāyūhane cittaṃ pakkhandati. Anāyūhane ",
      " cittassa pakkhandattā, ye āyūhanapaccayā kilesā nibbatteyyuṃ, te ajātāyeva na jāyanti, anibbattāyeva na nibbattanti, anuppannāyeva na uppajjanti, apātubhūtāyeva na pātubhavanti. Evaṃ hetunirodhā dukkhanirodho. Evaṃ atthi maggabhāvanā, atthi phalasacchikiriyā, atthi kilesappahānaṃ, atthi dhammābhisamayoti."
    ],
    "innerText": "Na hi atīte kilese pajahati, na anāgate kilese pajahati, na paccuppanne kilese pajahatīti. Hañci na atīte kilese pajahati, na anāgate…pe… na paccuppanne kilese pajahati, tena hi natthi maggabhāvanā, natthi phalasacchikiriyā, natthi kilesappahānaṃ, natthi dhammābhisamayoti? Atthi maggabhāvanā, atthi phalasacchikiriyā, atthi kilesappahānaṃ, atthi dhammābhisamayo. Yathā kathaṃ viya? Seyyathāpi taruṇo rukkho ajātaphalo. Tamenaṃ puriso mūlaṃ chindeyya. Ye tassa rukkhassa ajātaphalā, te ajātāyeva na jāyanti, anibbattāyeva na nibbattanti, anuppannāyeva na uppajjanti, apātubhūtāyeva na pātubhavanti. Evamevaṃ uppādo hetu, uppādo paccayo kilesānaṃ nibbattiyāti. Uppāde ādīnavaṃ disvā anuppāde cittaṃ pakkhandati. Anuppāde cittassa pakkhandattā ye uppādapaccayā kilesā nibbatteyyuṃ, te ajātāyeva na jāyanti, anibbattāyeva na nibbattanti, anuppannāyeva na uppajjanti, apātubhūtāyeva na pātubhavanti. Evaṃ hetunirodhā dukkhanirodho. Pavattaṃ hetu, nimittaṃ hetu, āyūhanā hetu. Āyūhanā paccayo kilesānaṃ nibbattiyāti. Āyūhane ādīnavaṃ disvā anāyūhane cittaṃ pakkhandati. Anāyūhane cittassa pakkhandattā, ye āyūhanapaccayā kilesā nibbatteyyuṃ, te ajātāyeva na jāyanti, anibbattāyeva na nibbattanti, anuppannāyeva na uppajjanti, apātubhūtāyeva na pātubhavanti. Evaṃ hetunirodhā dukkhanirodho. Evaṃ atthi maggabhāvanā, atthi phalasacchikiriyā, atthi kilesappahānaṃ, atthi dhammābhisamayoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Abhisamayakathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "4. Vivekakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "22"
      },
      ". Sāvatthinidānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[saṃ ni. 3.5.149 passitabbā]"
      },
      ". ‘‘Seyyathāpi ",
      ", bhikkhave, ye keci balakaraṇīyā kammantā karīyanti, sabbe te pathaviṃ nissāya pathaviyaṃ patiṭṭhāya evamete balakaraṇīyā kammantā karīyanti, evamevaṃ, bhikkhave, bhikkhu sīlaṃ nissāya sīle patiṭṭhāya ariyaṃ aṭṭhaṅgikaṃ maggaṃ bhāveti, ariyaṃ aṭṭhaṅgikaṃ maggaṃ bahulīkaroti."
    ],
    "innerText": "22. Sāvatthinidānaṃ [saṃ ni. 3.5.149 passitabbā]. ‘‘Seyyathāpi , bhikkhave, ye keci balakaraṇīyā kammantā karīyanti, sabbe te pathaviṃ nissāya pathaviyaṃ patiṭṭhāya evamete balakaraṇīyā kammantā karīyanti, evamevaṃ, bhikkhave, bhikkhu sīlaṃ nissāya sīle patiṭṭhāya ariyaṃ aṭṭhaṅgikaṃ maggaṃ bhāveti, ariyaṃ aṭṭhaṅgikaṃ maggaṃ bahulīkaroti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, bhikkhu sīlaṃ nissāya sīle patiṭṭhāya ariyaṃ aṭṭhaṅgikaṃ maggaṃ bhāveti, ariyaṃ aṭṭhaṅgikaṃ maggaṃ bahulīkaroti? Idha, bhikkhave, bhikkhu ",
      " sammādiṭṭhiṃ bhāveti vivekanissitaṃ virāganissitaṃ ",
      " nirodhanissitaṃ vossaggapariṇāmiṃ. Sammāsaṅkappaṃ…pe… sammāvācaṃ… sammākammantaṃ… sammāājīvaṃ… sammāvāyāmaṃ… sammāsatiṃ… sammāsamādhiṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ. Evaṃ kho, bhikkhave, bhikkhu sīlaṃ nissāya sīle patiṭṭhāya ariyaṃ aṭṭhaṅgikaṃ maggaṃ bhāveti, ariyaṃ aṭṭhaṅgikaṃ maggaṃ bahulīkaroti."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu sīlaṃ nissāya sīle patiṭṭhāya ariyaṃ aṭṭhaṅgikaṃ maggaṃ bhāveti, ariyaṃ aṭṭhaṅgikaṃ maggaṃ bahulīkaroti? Idha, bhikkhave, bhikkhu sammādiṭṭhiṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ. Sammāsaṅkappaṃ…pe… sammāvācaṃ… sammākammantaṃ… sammāājīvaṃ… sammāvāyāmaṃ… sammāsatiṃ… sammāsamādhiṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ. Evaṃ kho, bhikkhave, bhikkhu sīlaṃ nissāya sīle patiṭṭhāya ariyaṃ aṭṭhaṅgikaṃ maggaṃ bhāveti, ariyaṃ aṭṭhaṅgikaṃ maggaṃ bahulīkaroti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "23"
      },
      ". ‘‘Seyyathāpi, bhikkhave, ye keci ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yepime (syā.) saṃ. ni. 5.150 passitabbā]"
      },
      " bījagāmabhūtagāmā vuddhiṃ virūḷhiṃ vepullaṃ āpajjanti, sabbe te pathaviṃ nissāya pathaviyaṃ patiṭṭhāya evamete bījagāmabhūtagāmā vuddhiṃ virūḷhiṃ vepullaṃ āpajjanti; evamevaṃ kho, bhikkhave, bhikkhu sīlaṃ nissāya sīle patiṭṭhāya ariyaṃ ",
      " aṭṭhaṅgikaṃ maggaṃ bhāvento ariyaṃ aṭṭhaṅgikaṃ maggaṃ bahulīkaronto vuddhiṃ virūḷhiṃ vepullaṃ pāpuṇāti dhammesu."
    ],
    "innerText": "23. ‘‘Seyyathāpi, bhikkhave, ye keci [yepime (syā.) saṃ. ni. 5.150 passitabbā] bījagāmabhūtagāmā vuddhiṃ virūḷhiṃ vepullaṃ āpajjanti, sabbe te pathaviṃ nissāya pathaviyaṃ patiṭṭhāya evamete bījagāmabhūtagāmā vuddhiṃ virūḷhiṃ vepullaṃ āpajjanti; evamevaṃ kho, bhikkhave, bhikkhu sīlaṃ nissāya sīle patiṭṭhāya ariyaṃ aṭṭhaṅgikaṃ maggaṃ bhāvento ariyaṃ aṭṭhaṅgikaṃ maggaṃ bahulīkaronto vuddhiṃ virūḷhiṃ vepullaṃ pāpuṇāti dhammesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, bhikkhu sīlaṃ nissāya sīle patiṭṭhāya ariyaṃ aṭṭhaṅgikaṃ maggaṃ bhāvento ariyaṃ aṭṭhaṅgikaṃ maggaṃ bahulīkaronto vuddhiṃ virūḷhiṃ vepullaṃ pāpuṇāti dhammesu? Idha ",
      ", bhikkhave, bhikkhu sammādiṭṭhiṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ. Sammāsaṅkappaṃ bhāveti…pe… sammāvācaṃ bhāveti… sammākammantaṃ bhāveti… sammāājīvaṃ bhāveti… sammāvāyāmaṃ bhāveti… sammāsatiṃ bhāveti… sammāsamādhiṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ. Evaṃ kho, bhikkhave, bhikkhu sīlaṃ nissāya sīle patiṭṭhāya ariyaṃ aṭṭhaṅgikaṃ maggaṃ bhāvento ariyaṃ aṭṭhaṅgikaṃ maggaṃ bahulīkaronto vuddhiṃ virūḷhiṃ vepullaṃ pāpuṇāti dhammesū’’ti."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, bhikkhu sīlaṃ nissāya sīle patiṭṭhāya ariyaṃ aṭṭhaṅgikaṃ maggaṃ bhāvento ariyaṃ aṭṭhaṅgikaṃ maggaṃ bahulīkaronto vuddhiṃ virūḷhiṃ vepullaṃ pāpuṇāti dhammesu? Idha , bhikkhave, bhikkhu sammādiṭṭhiṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ. Sammāsaṅkappaṃ bhāveti…pe… sammāvācaṃ bhāveti… sammākammantaṃ bhāveti… sammāājīvaṃ bhāveti… sammāvāyāmaṃ bhāveti… sammāsatiṃ bhāveti… sammāsamādhiṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ. Evaṃ kho, bhikkhave, bhikkhu sīlaṃ nissāya sīle patiṭṭhāya ariyaṃ aṭṭhaṅgikaṃ maggaṃ bhāvento ariyaṃ aṭṭhaṅgikaṃ maggaṃ bahulīkaronto vuddhiṃ virūḷhiṃ vepullaṃ pāpuṇāti dhammesū’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Maggaṅganiddeso"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "24"
      },
      ". Sammādiṭṭhiyā ",
      " pañca vivekā, pañca virāgā, pañca nirodhā, pañca vossaggā, dvādasa nissayā. Sammāsaṅkappassa…pe… sammāvācāya… sammākammantassa… sammāājīvassa… sammāvāyāmassa… sammāsatiyā… sammāsamādhissa pañca vivekā, pañca virāgā, pañca nirodhā, pañca vossaggā, dvādasa nissayā."
    ],
    "innerText": "24. Sammādiṭṭhiyā pañca vivekā, pañca virāgā, pañca nirodhā, pañca vossaggā, dvādasa nissayā. Sammāsaṅkappassa…pe… sammāvācāya… sammākammantassa… sammāājīvassa… sammāvāyāmassa… sammāsatiyā… sammāsamādhissa pañca vivekā, pañca virāgā, pañca nirodhā, pañca vossaggā, dvādasa nissayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammādiṭṭhiyā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "katame pañca vivekā? "
      },
      " Vikkhambhanaviveko, tadaṅgaviveko samucchedaviveko, paṭippassaddhiviveko, nissaraṇaviveko. Vikkhambhanaviveko ca nīvaraṇānaṃ paṭhamajjhānaṃ bhāvayato ",
      ", tadaṅgaviveko ca diṭṭhigatānaṃ nibbedhabhāgiyaṃ samādhiṃ bhāvayato, samucchedaviveko ca lokuttaraṃ khayagāmimaggaṃ bhāvayato, paṭippassaddhiviveko ca phalakkhaṇe, nissaraṇaviveko ca nirodho nibbānaṃ. Sammādiṭṭhiyā ime pañca vivekā. Imesu pañcasu vivekesu chandajāto hoti saddhādhimutto, cittañcassa svādhiṭṭhitaṃ."
    ],
    "innerText": "Sammādiṭṭhiyākatame pañca vivekā? Vikkhambhanaviveko, tadaṅgaviveko samucchedaviveko, paṭippassaddhiviveko, nissaraṇaviveko. Vikkhambhanaviveko ca nīvaraṇānaṃ paṭhamajjhānaṃ bhāvayato , tadaṅgaviveko ca diṭṭhigatānaṃ nibbedhabhāgiyaṃ samādhiṃ bhāvayato, samucchedaviveko ca lokuttaraṃ khayagāmimaggaṃ bhāvayato, paṭippassaddhiviveko ca phalakkhaṇe, nissaraṇaviveko ca nirodho nibbānaṃ. Sammādiṭṭhiyā ime pañca vivekā. Imesu pañcasu vivekesu chandajāto hoti saddhādhimutto, cittañcassa svādhiṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammādiṭṭhiyā katame pañca virāgā?"
      },
      " Vikkhambhanavirāgo, tadaṅgavirāgo, samucchedavirāgo, paṭippassaddhivirāgo, nissaraṇavirāgo. Vikkhambhanavirāgo ca nīvaraṇānaṃ paṭhamajjhānaṃ bhāvayato, tadaṅgavirāgo ca diṭṭhigatānaṃ nibbedhabhāgiyaṃ samādhiṃ bhāvayato, samucchedavirāgo ca lokuttaraṃ khayagāmimaggaṃ bhāvayato, paṭippassaddhivirāgo ca phalakkhaṇe, nissaraṇavirāgo ca nirodho nibbānaṃ. Sammādiṭṭhiyā ime pañca virāgā. Imesu pañcasu virāgesu chandajāto hoti ",
      " saddhādhimutto, cittañcassa svādhiṭṭhitaṃ."
    ],
    "innerText": "Sammādiṭṭhiyā katame pañca virāgā? Vikkhambhanavirāgo, tadaṅgavirāgo, samucchedavirāgo, paṭippassaddhivirāgo, nissaraṇavirāgo. Vikkhambhanavirāgo ca nīvaraṇānaṃ paṭhamajjhānaṃ bhāvayato, tadaṅgavirāgo ca diṭṭhigatānaṃ nibbedhabhāgiyaṃ samādhiṃ bhāvayato, samucchedavirāgo ca lokuttaraṃ khayagāmimaggaṃ bhāvayato, paṭippassaddhivirāgo ca phalakkhaṇe, nissaraṇavirāgo ca nirodho nibbānaṃ. Sammādiṭṭhiyā ime pañca virāgā. Imesu pañcasu virāgesu chandajāto hoti saddhādhimutto, cittañcassa svādhiṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammādiṭṭhiyā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "katame pañca nirodhā? "
      },
      " Vikkhambhananirodho, tadaṅganirodho, samucchedanirodho, paṭippassaddhinirodho, nissaraṇanirodho. Vikkhambhananirodho ca nīvaraṇānaṃ paṭhamajjhānaṃ bhāvayato, tadaṅganirodho ca diṭṭhigatānaṃ nibbedhabhāgiyaṃ samādhiṃ bhāvayato, samucchedanirodho ca lokuttaraṃ khayagāmimaggaṃ bhāvayato, paṭippassaddhinirodho ca phalakkhaṇe, nissaraṇanirodho ca amatā dhātu. Sammādiṭṭhiyā ime pañca nirodhā. Imesu pañcasu nirodhesu chandajāto hoti saddhādhimutto, cittañcassa svādhiṭṭhitaṃ."
    ],
    "innerText": "Sammādiṭṭhiyākatame pañca nirodhā? Vikkhambhananirodho, tadaṅganirodho, samucchedanirodho, paṭippassaddhinirodho, nissaraṇanirodho. Vikkhambhananirodho ca nīvaraṇānaṃ paṭhamajjhānaṃ bhāvayato, tadaṅganirodho ca diṭṭhigatānaṃ nibbedhabhāgiyaṃ samādhiṃ bhāvayato, samucchedanirodho ca lokuttaraṃ khayagāmimaggaṃ bhāvayato, paṭippassaddhinirodho ca phalakkhaṇe, nissaraṇanirodho ca amatā dhātu. Sammādiṭṭhiyā ime pañca nirodhā. Imesu pañcasu nirodhesu chandajāto hoti saddhādhimutto, cittañcassa svādhiṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammādiṭṭhiyā katame pañca vossaggā?"
      },
      " Vikkhambhanavossaggo, tadaṅgavossaggo, samucchedavossaggo, paṭippassaddhivossaggo, nissaraṇavossaggo. Vikkhambhanavossaggo ca nīvaraṇānaṃ paṭhamajjhānaṃ bhāvayato, tadaṅgavossaggo ca diṭṭhigatānaṃ nibbedhabhāgiyaṃ samādhiṃ bhāvayato, samucchedavossaggo ca lokuttaraṃ khayagāmimaggaṃ bhāvayato, paṭippassaddhivossaggo ca phalakkhaṇe, nissaraṇavossaggo ca nirodho nibbānaṃ. Sammādiṭṭhiyā ime pañca vossaggā. Imesu pañcasu vossaggesu chandajāto hoti ",
      " saddhādhimutto, cittañcassa svādhiṭṭhitaṃ. Sammādiṭṭhiyā ime pañca vivekā, pañca virāgā, pañca nirodhā, pañca vossaggā, dvādasa nissayā."
    ],
    "innerText": "Sammādiṭṭhiyā katame pañca vossaggā? Vikkhambhanavossaggo, tadaṅgavossaggo, samucchedavossaggo, paṭippassaddhivossaggo, nissaraṇavossaggo. Vikkhambhanavossaggo ca nīvaraṇānaṃ paṭhamajjhānaṃ bhāvayato, tadaṅgavossaggo ca diṭṭhigatānaṃ nibbedhabhāgiyaṃ samādhiṃ bhāvayato, samucchedavossaggo ca lokuttaraṃ khayagāmimaggaṃ bhāvayato, paṭippassaddhivossaggo ca phalakkhaṇe, nissaraṇavossaggo ca nirodho nibbānaṃ. Sammādiṭṭhiyā ime pañca vossaggā. Imesu pañcasu vossaggesu chandajāto hoti saddhādhimutto, cittañcassa svādhiṭṭhitaṃ. Sammādiṭṭhiyā ime pañca vivekā, pañca virāgā, pañca nirodhā, pañca vossaggā, dvādasa nissayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "25"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammāsaṅkappassa"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "…pe… sammāvācāya… sammākammantassa… sammāājīvassa… sammāvāyāmassa… sammāsatiyā… sammāsamādhissa katame pañca vivekā?"
      },
      " Vikkhambhanaviveko, tadaṅgaviveko, samucchedaviveko, paṭippassaddhiviveko, nissaraṇaviveko. Vikkhambhanaviveko ca nīvaraṇānaṃ paṭhamajjhānaṃ bhāvayato, tadaṅgaviveko ca diṭṭhigatānaṃ nibbedhabhāgiyaṃ samādhiṃ bhāvayato, samucchedaviveko ca lokuttaraṃ khayagāmimaggaṃ bhāvayato, paṭippassaddhiviveko ca phalakkhaṇe nissaraṇaviveko ca nirodho nibbānaṃ. Sammāsamādhissa ",
      " ime pañca vivekā. Imesu pañcasu vivekesu chandajāto hoti saddhādhimutto, cittañcassa svādhiṭṭhitaṃ."
    ],
    "innerText": "25.Sammāsaṅkappassa…pe… sammāvācāya… sammākammantassa… sammāājīvassa… sammāvāyāmassa… sammāsatiyā… sammāsamādhissa katame pañca vivekā? Vikkhambhanaviveko, tadaṅgaviveko, samucchedaviveko, paṭippassaddhiviveko, nissaraṇaviveko. Vikkhambhanaviveko ca nīvaraṇānaṃ paṭhamajjhānaṃ bhāvayato, tadaṅgaviveko ca diṭṭhigatānaṃ nibbedhabhāgiyaṃ samādhiṃ bhāvayato, samucchedaviveko ca lokuttaraṃ khayagāmimaggaṃ bhāvayato, paṭippassaddhiviveko ca phalakkhaṇe nissaraṇaviveko ca nirodho nibbānaṃ. Sammāsamādhissa ime pañca vivekā. Imesu pañcasu vivekesu chandajāto hoti saddhādhimutto, cittañcassa svādhiṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammāsamādhissa katame pañca virāgā?"
      },
      " Vikkhambhanavirāgo, tadaṅgavirāgo, samucchedavirāgo ",
      ", paṭippassaddhivirāgo, nissaraṇavirāgo. Vikkhambhanavirāgo ca nīvaraṇānaṃ paṭhamajjhānaṃ bhāvayato, tadaṅgavirāgo ca diṭṭhigatānaṃ nibbedhabhāgiyaṃ samādhiṃ bhāvayato, samucchedavirāgo ca lokuttaraṃ khayagāmimaggaṃ bhāvayato, paṭippassaddhivirāgo ca phalakkhaṇe, nissaraṇavirāgo ca nirodho nibbānaṃ. Sammāsamādhissa ime pañca virāgā. Imesu pañcasu virāgesu chandajāto hoti saddhādhimutto, cittañcassa svādhiṭṭhitaṃ."
    ],
    "innerText": "Sammāsamādhissa katame pañca virāgā? Vikkhambhanavirāgo, tadaṅgavirāgo, samucchedavirāgo , paṭippassaddhivirāgo, nissaraṇavirāgo. Vikkhambhanavirāgo ca nīvaraṇānaṃ paṭhamajjhānaṃ bhāvayato, tadaṅgavirāgo ca diṭṭhigatānaṃ nibbedhabhāgiyaṃ samādhiṃ bhāvayato, samucchedavirāgo ca lokuttaraṃ khayagāmimaggaṃ bhāvayato, paṭippassaddhivirāgo ca phalakkhaṇe, nissaraṇavirāgo ca nirodho nibbānaṃ. Sammāsamādhissa ime pañca virāgā. Imesu pañcasu virāgesu chandajāto hoti saddhādhimutto, cittañcassa svādhiṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammāsamādhissa katame pañca nirodhā?"
      },
      " Vikkhambhananirodho ",
      ", tadaṅganirodho, samucchedanirodho, paṭippassaddhinirodho, nissaraṇanirodho. Vikkhambhananirodho ca nīvaraṇānaṃ paṭhamajjhānaṃ bhāvayato, tadaṅganirodho ca diṭṭhigatānaṃ nibbedhabhāgiyaṃ samādhiṃ bhāvayato, samucchedanirodho ca lokuttaraṃ khayagāmimaggaṃ bhāvayato, paṭippassaddhinirodho ca phalakkhaṇe, nissaraṇanirodho ca amatā dhātu. Sammāsamādhissa ime pañca nirodhā. Imesu pañcasu nirodhesu chandajāto hoti saddhādhimutto, cittañcassa svādhiṭṭhitaṃ."
    ],
    "innerText": "Sammāsamādhissa katame pañca nirodhā? Vikkhambhananirodho , tadaṅganirodho, samucchedanirodho, paṭippassaddhinirodho, nissaraṇanirodho. Vikkhambhananirodho ca nīvaraṇānaṃ paṭhamajjhānaṃ bhāvayato, tadaṅganirodho ca diṭṭhigatānaṃ nibbedhabhāgiyaṃ samādhiṃ bhāvayato, samucchedanirodho ca lokuttaraṃ khayagāmimaggaṃ bhāvayato, paṭippassaddhinirodho ca phalakkhaṇe, nissaraṇanirodho ca amatā dhātu. Sammāsamādhissa ime pañca nirodhā. Imesu pañcasu nirodhesu chandajāto hoti saddhādhimutto, cittañcassa svādhiṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammāsamādhissa katame pañca vossaggā?"
      },
      " Vikkhambhanavossaggo, tadaṅgavossaggo, samucchedavossaggo, paṭippassaddhivossaggo, nissaraṇavossaggo. Vikkhambhanavossaggo ca nīvaraṇānaṃ paṭhamajjhānaṃ bhāvayato, tadaṅgavossaggo ca diṭṭhigatānaṃ nibbedhabhāgiyaṃ samādhiṃ bhāvayato, samucchedavossaggo ca lokuttaraṃ ",
      " khayagāmimaggaṃ bhāvayato, paṭippassaddhivossaggo ca phalakkhaṇe, nissaraṇavossaggo ca nirodho nibbānaṃ. Sammāsamādhissa ime pañca vossaggā. Imesu pañcasu vossaggesu chandajāto hoti saddhādhimutto, cittañcassa svādhiṭṭhitaṃ. Sammāsamādhissa ime pañca vivekā, pañca virāgā, pañca nirodhā, pañca vossaggā, dvādasa nissayā."
    ],
    "innerText": "Sammāsamādhissa katame pañca vossaggā? Vikkhambhanavossaggo, tadaṅgavossaggo, samucchedavossaggo, paṭippassaddhivossaggo, nissaraṇavossaggo. Vikkhambhanavossaggo ca nīvaraṇānaṃ paṭhamajjhānaṃ bhāvayato, tadaṅgavossaggo ca diṭṭhigatānaṃ nibbedhabhāgiyaṃ samādhiṃ bhāvayato, samucchedavossaggo ca lokuttaraṃ khayagāmimaggaṃ bhāvayato, paṭippassaddhivossaggo ca phalakkhaṇe, nissaraṇavossaggo ca nirodho nibbānaṃ. Sammāsamādhissa ime pañca vossaggā. Imesu pañcasu vossaggesu chandajāto hoti saddhādhimutto, cittañcassa svādhiṭṭhitaṃ. Sammāsamādhissa ime pañca vivekā, pañca virāgā, pañca nirodhā, pañca vossaggā, dvādasa nissayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "26"
      },
      ". ‘‘Seyyathāpi, bhikkhave, ye keci balakaraṇīyā kammantā karīyanti ",
      ", sabbe te pathaviṃ nissāya pathaviyaṃ patiṭṭhāya evamete balakaraṇīyā kammantā karīyanti; evamevaṃ kho, bhikkhave, bhikkhu sīlaṃ nissāya sīle patiṭṭhāya ",
      " satta bojjhaṅge bhāveti, satta bojjhaṅge bahulīkaroti…pe… satta bojjhaṅge bhāvento satta bojjhaṅge bahulīkaronto vuddhiṃ virūḷhiṃ vepullaṃ pāpuṇāti dhammesu…pe… pañca balāni bhāveti, pañca balāni bahulīkaroti…pe… pañca balāni bhāvento pañca balāni bahulīkaronto vuddhiṃ virūḷhiṃ vepullaṃ pāpuṇāti dhammesu…pe… pañcindriyāni bhāveti, pañcindriyāni bahulīkaroti…pe…."
    ],
    "innerText": "26. ‘‘Seyyathāpi, bhikkhave, ye keci balakaraṇīyā kammantā karīyanti , sabbe te pathaviṃ nissāya pathaviyaṃ patiṭṭhāya evamete balakaraṇīyā kammantā karīyanti; evamevaṃ kho, bhikkhave, bhikkhu sīlaṃ nissāya sīle patiṭṭhāya satta bojjhaṅge bhāveti, satta bojjhaṅge bahulīkaroti…pe… satta bojjhaṅge bhāvento satta bojjhaṅge bahulīkaronto vuddhiṃ virūḷhiṃ vepullaṃ pāpuṇāti dhammesu…pe… pañca balāni bhāveti, pañca balāni bahulīkaroti…pe… pañca balāni bhāvento pañca balāni bahulīkaronto vuddhiṃ virūḷhiṃ vepullaṃ pāpuṇāti dhammesu…pe… pañcindriyāni bhāveti, pañcindriyāni bahulīkaroti…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Seyyathāpi, bhikkhave, ye keci bījagāmabhūtagāmā vuddhiṃ virūḷhiṃ vepullaṃ āpajjanti, sabbe te pathaviṃ nissāya pathaviyaṃ patiṭṭhāya evamete bījagāmabhūtagāmā vuddhiṃ virūḷhiṃ vepullaṃ āpajjanti, evamevaṃ kho, bhikkhave, bhikkhu sīlaṃ nissāya sīle patiṭṭhāya pañcindriyāni bhāvento pañcindriyāni bahulīkaronto vuddhiṃ virūḷhiṃ vepullaṃ pāpuṇāti dhammesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca ",
      ", bhikkhave, bhikkhu sīlaṃ nissāya sīle patiṭṭhāya pañcindriyāni bhāvento pañcindriyāni bahulīkaronto vuddhiṃ virūḷhiṃ vepullaṃ pāpuṇāti dhammesu? Idha, bhikkhave, bhikkhu saddhindriyaṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ. Vīriyindriyaṃ bhāveti…pe… satindriyaṃ bhāveti…pe… samādhindriyaṃ ",
      " bhāveti…pe… paññindriyaṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ. Evaṃ kho, bhikkhave, bhikkhu sīlaṃ nissāya…pe… pāpuṇāti dhammesū’’ti."
    ],
    "innerText": "‘‘Kathañca , bhikkhave, bhikkhu sīlaṃ nissāya sīle patiṭṭhāya pañcindriyāni bhāvento pañcindriyāni bahulīkaronto vuddhiṃ virūḷhiṃ vepullaṃ pāpuṇāti dhammesu? Idha, bhikkhave, bhikkhu saddhindriyaṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ. Vīriyindriyaṃ bhāveti…pe… satindriyaṃ bhāveti…pe… samādhindriyaṃ bhāveti…pe… paññindriyaṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ. Evaṃ kho, bhikkhave, bhikkhu sīlaṃ nissāya…pe… pāpuṇāti dhammesū’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Indriyaniddeso"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "27"
      },
      ". Saddhindriyassa pañca vivekā, pañca virāgā, pañca nirodhā, pañca vossaggā, dvādasa nissayā. Vīriyindriyassa…pe… satindriyassa… samādhindriyassa… paññindriyassa ",
      " pañca vivekā, pañca virāgā, pañca nirodhā, pañca vossaggā, dvādasa nissayā."
    ],
    "innerText": "27. Saddhindriyassa pañca vivekā, pañca virāgā, pañca nirodhā, pañca vossaggā, dvādasa nissayā. Vīriyindriyassa…pe… satindriyassa… samādhindriyassa… paññindriyassa pañca vivekā, pañca virāgā, pañca nirodhā, pañca vossaggā, dvādasa nissayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddhindriyassa katame pañca vivekā?"
      },
      " Vikkhambhanaviveko, tadaṅgaviveko, samucchedaviveko, paṭippassaddhiviveko, nissaraṇaviveko. Vikkhambhanaviveko ca nīvaraṇānaṃ paṭhamajjhānaṃ bhāvayato, tadaṅgaviveko ca diṭṭhigatānaṃ nibbedhabhāgiyaṃ samādhiṃ bhāvayato, samucchedaviveko ca lokuttaraṃ khayagāmimaggaṃ bhāvayato, paṭippassaddhiviveko ca phalakkhaṇe, nissaraṇaviveko ca nirodho nibbānaṃ. Saddhindriyassa ime pañca vivekā. Imesu ",
      " pañcasu vivekesu chandajāto hoti saddhādhimutto, cittañcassa svādhiṭṭhitaṃ…pe… saddhindriyassa ime pañca vivekā, pañca virāgā, pañca nirodhā, pañca vossaggā, dvādasa nissayā."
    ],
    "innerText": "Saddhindriyassa katame pañca vivekā? Vikkhambhanaviveko, tadaṅgaviveko, samucchedaviveko, paṭippassaddhiviveko, nissaraṇaviveko. Vikkhambhanaviveko ca nīvaraṇānaṃ paṭhamajjhānaṃ bhāvayato, tadaṅgaviveko ca diṭṭhigatānaṃ nibbedhabhāgiyaṃ samādhiṃ bhāvayato, samucchedaviveko ca lokuttaraṃ khayagāmimaggaṃ bhāvayato, paṭippassaddhiviveko ca phalakkhaṇe, nissaraṇaviveko ca nirodho nibbānaṃ. Saddhindriyassa ime pañca vivekā. Imesu pañcasu vivekesu chandajāto hoti saddhādhimutto, cittañcassa svādhiṭṭhitaṃ…pe… saddhindriyassa ime pañca vivekā, pañca virāgā, pañca nirodhā, pañca vossaggā, dvādasa nissayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vīriyindriyassa…pe… satindriyassa…pe… samādhindriyassa… paññindriyassa katame pañca vivekā? Vikkhambhanaviveko, tadaṅgaviveko, samucchedaviveko, paṭippassaddhiviveko, nissaraṇaviveko…pe… paññindriyassa ime pañca vivekā, pañca virāgā, pañca nirodhā ",
      ", pañca vossaggā, dvādasa nissayāti."
    ],
    "innerText": "Vīriyindriyassa…pe… satindriyassa…pe… samādhindriyassa… paññindriyassa katame pañca vivekā? Vikkhambhanaviveko, tadaṅgaviveko, samucchedaviveko, paṭippassaddhiviveko, nissaraṇaviveko…pe… paññindriyassa ime pañca vivekā, pañca virāgā, pañca nirodhā , pañca vossaggā, dvādasa nissayāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vivekakathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "5. Cariyākathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "28"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cariyā"
      },
      "ti ",
      ", aṭṭha cariyāyo – iriyāpathacariyā, āyatanacariyā, saticariyā, samādhicariyā, ñāṇacariyā, maggacariyā, patticariyā, lokatthacariyāti."
    ],
    "innerText": "28.Cariyāti , aṭṭha cariyāyo – iriyāpathacariyā, āyatanacariyā, saticariyā, samādhicariyā, ñāṇacariyā, maggacariyā, patticariyā, lokatthacariyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iriyāpathacariyā"
      },
      "ti catūsu iriyāpathesu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āyatanacariyā"
      },
      "ti chasu ajjhattikabāhiresu āyatanesu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saticariyā"
      },
      "ti catūsu satipaṭṭhānesu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samādhicariyā"
      },
      "ti catūsu jhānesu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñāṇacariyā"
      },
      "ti catūsu ariyasaccesu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Maggacariyā"
      },
      "ti catūsu ariyamaggesu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Patticariyā"
      },
      "ti catūsu sāmaññaphalesu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lokatthacariyā"
      },
      "ti tathāgatesu arahantesu sammāsambuddhesu padese ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[padeso (syā.)]"
      },
      " paccekabuddhesu padese sāvakesu."
    ],
    "innerText": "Iriyāpathacariyāti catūsu iriyāpathesu. Āyatanacariyāti chasu ajjhattikabāhiresu āyatanesu. Saticariyāti catūsu satipaṭṭhānesu. Samādhicariyāti catūsu jhānesu. Ñāṇacariyāti catūsu ariyasaccesu. Maggacariyāti catūsu ariyamaggesu. Patticariyāti catūsu sāmaññaphalesu. Lokatthacariyāti tathāgatesu arahantesu sammāsambuddhesu padese [padeso (syā.)] paccekabuddhesu padese sāvakesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Iriyāpathacariyā ",
      " ca paṇidhisampannānaṃ. Āyatanacariyā ca indriyesu guttadvārānaṃ. Saticariyā ca appamādavihārīnaṃ. Samādhicariyā ca adhicittamanuyuttānaṃ. Ñāṇacariyā ca buddhisampannānaṃ. Maggacariyā ca sammāpaṭipannānaṃ. Patticariyā ca adhigataphalānaṃ. Lokatthacariyā ca tathāgatānaṃ arahantānaṃ sammāsambuddhānaṃ padese paccekabuddhānaṃ padese sāvakānaṃ. Imā aṭṭha cariyāyo."
    ],
    "innerText": "Iriyāpathacariyā ca paṇidhisampannānaṃ. Āyatanacariyā ca indriyesu guttadvārānaṃ. Saticariyā ca appamādavihārīnaṃ. Samādhicariyā ca adhicittamanuyuttānaṃ. Ñāṇacariyā ca buddhisampannānaṃ. Maggacariyā ca sammāpaṭipannānaṃ. Patticariyā ca adhigataphalānaṃ. Lokatthacariyā ca tathāgatānaṃ arahantānaṃ sammāsambuddhānaṃ padese paccekabuddhānaṃ padese sāvakānaṃ. Imā aṭṭha cariyāyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "29"
      },
      ". Aparāpi ",
      " aṭṭha cariyāyo. Adhimuccanto saddhāya carati, paggaṇhanto vīriyena carati, upaṭṭhāpento satiyā carati, avikkhepaṃ karonto samādhinā carati, pajānanto paññāya carati, vijānanto viññāṇacariyāya carati, evaṃ paṭipannassa ",
      " kusalā dhammā āyāpentīti āyatanacariyāya carati, evaṃ paṭipanno visesamadhigacchatīti visesacariyāya carati. Imā aṭṭha cariyāyo."
    ],
    "innerText": "29. Aparāpi aṭṭha cariyāyo. Adhimuccanto saddhāya carati, paggaṇhanto vīriyena carati, upaṭṭhāpento satiyā carati, avikkhepaṃ karonto samādhinā carati, pajānanto paññāya carati, vijānanto viññāṇacariyāya carati, evaṃ paṭipannassa kusalā dhammā āyāpentīti āyatanacariyāya carati, evaṃ paṭipanno visesamadhigacchatīti visesacariyāya carati. Imā aṭṭha cariyāyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aparāpi ",
      " aṭṭha cariyāyo. Dassanacariyā ca sammādiṭṭhiyā, abhiniropanacariyā ca sammāsaṅkappassa, pariggahacariyā ca sammāvācāya, samuṭṭhānacariyā ca sammākammantassa, vodānacariyā ca sammāājīvassa, paggahacariyā ca sammāvāyāmassa, upaṭṭhānacariyā ca sammāsatiyā, avikkhepacariyā ca sammāsamādhissa. Imā aṭṭha cariyāyoti."
    ],
    "innerText": "Aparāpi aṭṭha cariyāyo. Dassanacariyā ca sammādiṭṭhiyā, abhiniropanacariyā ca sammāsaṅkappassa, pariggahacariyā ca sammāvācāya, samuṭṭhānacariyā ca sammākammantassa, vodānacariyā ca sammāājīvassa, paggahacariyā ca sammāvāyāmassa, upaṭṭhānacariyā ca sammāsatiyā, avikkhepacariyā ca sammāsamādhissa. Imā aṭṭha cariyāyoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Cariyākathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "6. Pāṭihāriyakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "30"
      },
      ". ‘‘Tīṇimāni ",
      ", bhikkhave ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[a. ni. 3.61 passitabbā]"
      },
      ", pāṭihāriyāni. Katamāni tīṇi? Iddhipāṭihāriyaṃ, ādesanāpāṭihāriyaṃ, anusāsanīpāṭihāriyaṃ."
    ],
    "innerText": "30. ‘‘Tīṇimāni , bhikkhave [a. ni. 3.61 passitabbā], pāṭihāriyāni. Katamāni tīṇi? Iddhipāṭihāriyaṃ, ādesanāpāṭihāriyaṃ, anusāsanīpāṭihāriyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Katamañca, bhikkhave, iddhipāṭihāriyaṃ?"
      },
      " Idha, bhikkhave, ekacco anekavihitaṃ iddhividhaṃ paccanubhoti – ekopi hutvā bahudhā hoti ",
      ", bahudhāpi hutvā eko hoti; āvibhāvaṃ tirobhāvaṃ…pe… yāva brahmalokāpi kāyena vasaṃ vatteti. Idaṃ vuccati, bhikkhave, iddhipāṭihāriyaṃ."
    ],
    "innerText": "‘‘Katamañca, bhikkhave, iddhipāṭihāriyaṃ? Idha, bhikkhave, ekacco anekavihitaṃ iddhividhaṃ paccanubhoti – ekopi hutvā bahudhā hoti , bahudhāpi hutvā eko hoti; āvibhāvaṃ tirobhāvaṃ…pe… yāva brahmalokāpi kāyena vasaṃ vatteti. Idaṃ vuccati, bhikkhave, iddhipāṭihāriyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Katamañca"
      },
      ", ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhikkhave, ādesanāpāṭihāriyaṃ?"
      },
      " Idha, bhikkhave, ekacco nimittena ādisati – ‘evampi te mano, itthampi te mano, itipi te citta’nti. So bahuṃ cepi ādisati, tatheva taṃ hoti, no aññathā. Idha pana, bhikkhave, ekacco na heva kho nimittena ādisati, api ca kho manussānaṃ vā amanussānaṃ vā devatānaṃ vā saddaṃ sutvā ādisati – ‘evampi te mano, itthampi te mano, itipi te citta’nti. So bahuṃ cepi ādisati, tatheva taṃ hoti, no aññathā. Idha pana, bhikkhave, ekacco na heva kho nimittena ādisati, napi manussānaṃ vā amanussānaṃ vā devatānaṃ vā saddaṃ sutvā ādisati, api ca kho vitakkayato vicārayato vitakkavipphārasaddaṃ sutvā ādisati – ‘evampi te mano, itthampi te mano, itipi te citta’nti. So bahuṃ cepi ādisati, tatheva taṃ hoti, no aññathā. Idha pana, bhikkhave, ekacco na heva kho nimittena ādisati, napi manussānaṃ vā amanussānaṃ vā devatānaṃ vā saddaṃ sutvā ādisati, napi vitakkayato vicārayato vitakkavipphārasaddaṃ ",
      " sutvā ādisati, api ca kho avitakkaṃ avicāraṃ samādhiṃ samāpannassa cetasā ceto paricca pajānāti – ‘yathā imassa bhoto manosaṅkhārā ",
      " paṇihitā imassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[tathā imassa (syā.), yathā imassa (ka.) a. ni. 3.61 passitabbā]"
      },
      " cittassa anantarā amukaṃ nāma vitakkaṃ vitakkayissatī’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vitakkessatīti (syā.) a. ni. 3.61]"
      },
      ". So bahuṃ cepi ādisati, tatheva taṃ hoti, no aññathā. Idaṃ vuccati, bhikkhave, ādesanāpāṭihāriyaṃ."
    ],
    "innerText": "‘‘Katamañca, bhikkhave, ādesanāpāṭihāriyaṃ? Idha, bhikkhave, ekacco nimittena ādisati – ‘evampi te mano, itthampi te mano, itipi te citta’nti. So bahuṃ cepi ādisati, tatheva taṃ hoti, no aññathā. Idha pana, bhikkhave, ekacco na heva kho nimittena ādisati, api ca kho manussānaṃ vā amanussānaṃ vā devatānaṃ vā saddaṃ sutvā ādisati – ‘evampi te mano, itthampi te mano, itipi te citta’nti. So bahuṃ cepi ādisati, tatheva taṃ hoti, no aññathā. Idha pana, bhikkhave, ekacco na heva kho nimittena ādisati, napi manussānaṃ vā amanussānaṃ vā devatānaṃ vā saddaṃ sutvā ādisati, api ca kho vitakkayato vicārayato vitakkavipphārasaddaṃ sutvā ādisati – ‘evampi te mano, itthampi te mano, itipi te citta’nti. So bahuṃ cepi ādisati, tatheva taṃ hoti, no aññathā. Idha pana, bhikkhave, ekacco na heva kho nimittena ādisati, napi manussānaṃ vā amanussānaṃ vā devatānaṃ vā saddaṃ sutvā ādisati, napi vitakkayato vicārayato vitakkavipphārasaddaṃ sutvā ādisati, api ca kho avitakkaṃ avicāraṃ samādhiṃ samāpannassa cetasā ceto paricca pajānāti – ‘yathā imassa bhoto manosaṅkhārā paṇihitā imassa [tathā imassa (syā.), yathā imassa (ka.) a. ni. 3.61 passitabbā] cittassa anantarā amukaṃ nāma vitakkaṃ vitakkayissatī’ti [vitakkessatīti (syā.) a. ni. 3.61]. So bahuṃ cepi ādisati, tatheva taṃ hoti, no aññathā. Idaṃ vuccati, bhikkhave, ādesanāpāṭihāriyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Katamañca, bhikkhave, anusāsanīpāṭihāriyaṃ?"
      },
      " Idha, bhikkhave, ekacco evamanusāsati – ‘evaṃ vitakketha, mā evaṃ vitakkayittha. Evaṃ manasi karotha, mā evaṃ manasi karittha. Idaṃ pajahatha, idaṃ upasampajja viharathā’ti. Idaṃ vuccati, bhikkhave, anusāsanīpāṭihāriyaṃ. Imāni kho, bhikkhave, tīṇi pāṭihāriyāni’’."
    ],
    "innerText": "‘‘Katamañca, bhikkhave, anusāsanīpāṭihāriyaṃ? Idha, bhikkhave, ekacco evamanusāsati – ‘evaṃ vitakketha, mā evaṃ vitakkayittha. Evaṃ manasi karotha, mā evaṃ manasi karittha. Idaṃ pajahatha, idaṃ upasampajja viharathā’ti. Idaṃ vuccati, bhikkhave, anusāsanīpāṭihāriyaṃ. Imāni kho, bhikkhave, tīṇi pāṭihāriyāni’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "31"
      },
      ". Nekkhammaṃ ijjhatīti – iddhi. Kāmacchandaṃ paṭiharatīti – pāṭihāriyaṃ. Ye tena nekkhammena samannāgatā, sabbe te visuddhacittā anāvilasaṅkappāti – ādesanāpāṭihāriyaṃ. ‘‘Taṃ kho pana nekkhammaṃ evaṃ āsevitabbaṃ, evaṃ bhāvetabbaṃ ",
      ", evaṃ bahulīkātabbaṃ, evaṃ tadanudhammatā sati upaṭṭhāpetabbā’’ti – anusāsanīpāṭihāriyaṃ."
    ],
    "innerText": "31. Nekkhammaṃ ijjhatīti – iddhi. Kāmacchandaṃ paṭiharatīti – pāṭihāriyaṃ. Ye tena nekkhammena samannāgatā, sabbe te visuddhacittā anāvilasaṅkappāti – ādesanāpāṭihāriyaṃ. ‘‘Taṃ kho pana nekkhammaṃ evaṃ āsevitabbaṃ, evaṃ bhāvetabbaṃ , evaṃ bahulīkātabbaṃ, evaṃ tadanudhammatā sati upaṭṭhāpetabbā’’ti – anusāsanīpāṭihāriyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Abyāpādo ijjhatīti – iddhi. Byāpādaṃ paṭiharatīti – pāṭihāriyaṃ. Ye tena abyāpādena samannāgatā, sabbe te visuddhacittā anāvilasaṅkappāti – ādesanāpāṭihāriyaṃ. ‘‘So kho pana abyāpādo evaṃ āsevitabbo, evaṃ bhāvetabbo, evaṃ bahulīkātabbo, evaṃ tadanudhammatā sati upaṭṭhāpetabbā’’ti – anusāsanīpāṭihāriyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ālokasaññā ijjhatīti – iddhi. Thinamiddhaṃ paṭiharatīti – pāṭihāriyaṃ. Ye tāya ālokasaññāya samannāgatā, sabbe te visuddhacittā anāvilasaṅkappāti ",
      " – ādesanāpāṭihāriyaṃ. ‘‘Sā kho pana ālokasaññā evaṃ āsevitabbā, evaṃ bhāvetabbā, evaṃ bahulīkātabbā, evaṃ tadanudhammatā sati upaṭṭhāpetabbā’’ti – anusāsanīpāṭihāriyaṃ."
    ],
    "innerText": "Ālokasaññā ijjhatīti – iddhi. Thinamiddhaṃ paṭiharatīti – pāṭihāriyaṃ. Ye tāya ālokasaññāya samannāgatā, sabbe te visuddhacittā anāvilasaṅkappāti – ādesanāpāṭihāriyaṃ. ‘‘Sā kho pana ālokasaññā evaṃ āsevitabbā, evaṃ bhāvetabbā, evaṃ bahulīkātabbā, evaṃ tadanudhammatā sati upaṭṭhāpetabbā’’ti – anusāsanīpāṭihāriyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Avikkhepo ijjhatīti – iddhi. Uddhaccaṃ paṭiharatīti – pāṭihāriyaṃ. Ye tena avikkhepena samannāgatā, sabbe te visuddhacittā ",
      " anāvilasaṅkappāti – ādesanāpāṭihāriyaṃ. ‘‘So kho pana avikkhepo evaṃ āsevitabbo, evaṃ bhāvetabbo, evaṃ bahulīkātabbo, evaṃ tadanudhammatā sati upaṭṭhāpetabbā’’ti – anusāsanīpāṭihāriyaṃ."
    ],
    "innerText": "Avikkhepo ijjhatīti – iddhi. Uddhaccaṃ paṭiharatīti – pāṭihāriyaṃ. Ye tena avikkhepena samannāgatā, sabbe te visuddhacittā anāvilasaṅkappāti – ādesanāpāṭihāriyaṃ. ‘‘So kho pana avikkhepo evaṃ āsevitabbo, evaṃ bhāvetabbo, evaṃ bahulīkātabbo, evaṃ tadanudhammatā sati upaṭṭhāpetabbā’’ti – anusāsanīpāṭihāriyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dhammavavatthānaṃ ijjhatīti – iddhi. Vicikicchaṃ paṭiharatīti – pāṭihāriyaṃ. Ye tena dhammavavatthānena samannāgatā, sabbe te visuddhacittā anāvilasaṅkappāti – ādesanāpāṭihāriyaṃ. ‘‘Taṃ ",
      " kho pana dhammavavatthānaṃ evaṃ āsevitabbaṃ, evaṃ bhāvetabbaṃ, evaṃ bahulīkātabbaṃ, evaṃ tadanudhammatā, sati upaṭṭhāpetabbā’’ti – anusāsanīpāṭihāriyaṃ."
    ],
    "innerText": "Dhammavavatthānaṃ ijjhatīti – iddhi. Vicikicchaṃ paṭiharatīti – pāṭihāriyaṃ. Ye tena dhammavavatthānena samannāgatā, sabbe te visuddhacittā anāvilasaṅkappāti – ādesanāpāṭihāriyaṃ. ‘‘Taṃ kho pana dhammavavatthānaṃ evaṃ āsevitabbaṃ, evaṃ bhāvetabbaṃ, evaṃ bahulīkātabbaṃ, evaṃ tadanudhammatā, sati upaṭṭhāpetabbā’’ti – anusāsanīpāṭihāriyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ñāṇaṃ ijjhatīti – iddhi. Avijjaṃ paṭiharatīti – pāṭihāriyaṃ. Ye tena ñāṇena samannāgatā, sabbe te visuddhacittā anāvilasaṅkappāti – ādesanāpāṭihāriyaṃ. ‘‘Taṃ kho pana ñāṇaṃ evaṃ āsevitabbaṃ, evaṃ bhāvetabbaṃ, evaṃ bahulīkātabbaṃ, evaṃ tadanudhammatā sati upaṭṭhāpetabbā’’ti – anusāsanīpāṭihāriyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pāmojjaṃ ijjhatīti – iddhi. Aratiṃ paṭiharatīti – pāṭihāriyaṃ. Ye tena pāmojjena samannāgatā, sabbe te visuddhacittā anāvilasaṅkappāti – ādesanāpāṭihāriyaṃ. ‘‘Taṃ kho pana pāmojjaṃ evaṃ āsevitabbaṃ, evaṃ bhāvetabbaṃ ",
      ", evaṃ bahulīkātabbaṃ, evaṃ tadanudhammatā sati upaṭṭhāpetabbā’’ti – anusāsanīpāṭihāriyaṃ…pe…."
    ],
    "innerText": "Pāmojjaṃ ijjhatīti – iddhi. Aratiṃ paṭiharatīti – pāṭihāriyaṃ. Ye tena pāmojjena samannāgatā, sabbe te visuddhacittā anāvilasaṅkappāti – ādesanāpāṭihāriyaṃ. ‘‘Taṃ kho pana pāmojjaṃ evaṃ āsevitabbaṃ, evaṃ bhāvetabbaṃ , evaṃ bahulīkātabbaṃ, evaṃ tadanudhammatā sati upaṭṭhāpetabbā’’ti – anusāsanīpāṭihāriyaṃ…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Paṭhamaṃ jhānaṃ ijjhatīti – iddhi. Nīvaraṇe paṭiharatīti – pāṭihāriyaṃ. Ye tena paṭhamena jhānena samannāgatā, sabbe te visuddhacittā anāvilasaṅkappāti – ādesanāpāṭihāriyaṃ. ‘‘Taṃ kho pana paṭhamaṃ jhānaṃ evaṃ āsevitabbaṃ, evaṃ bhāvetabbaṃ, evaṃ bahulīkātabbaṃ, evaṃ tadanudhammatā sati upaṭṭhāpetabbā’’ti – anusāsanīpāṭihāriyaṃ…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Arahattamaggo ijjhatīti – iddhi. Sabbakilese paṭiharatīti – pāṭihāriyaṃ. Ye tena arahattamaggena samannāgatā, sabbe te visuddhacittā anāvilasaṅkappāti – ādesanāpāṭihāriyaṃ. ‘‘So kho pana arahattamaggo evaṃ āsevitabbo, evaṃ bhāvetabbo, evaṃ bahulīkātabbo, evaṃ tadanudhammatā sati upaṭṭhāpetabbā’’ti – anusāsanīpāṭihāriyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "32"
      },
      ". Nekkhammaṃ ijjhatīti – iddhi. Kāmacchandaṃ paṭiharatīti – pāṭihāriyaṃ. Yā ca iddhi yañca pāṭihāriyaṃ, idaṃ vuccati iddhipāṭihāriyaṃ. Abyāpādo ijjhatīti – iddhi. Byāpādaṃ paṭiharatīti – pāṭihāriyaṃ. Yā ca iddhi yañca pāṭihāriyaṃ, idaṃ vuccati iddhipāṭihāriyaṃ. Ālokasaññā ijjhatīti – iddhi. Thinamiddhaṃ paṭiharatīti – pāṭihāriyaṃ…pe… arahattamaggo ijjhatīti – iddhi. Sabbakilese paṭiharatīti – pāṭihāriyaṃ. Yā ca iddhi yañca pāṭihāriyaṃ, idaṃ vuccati iddhipāṭihāriyanti ",
      "."
    ],
    "innerText": "32. Nekkhammaṃ ijjhatīti – iddhi. Kāmacchandaṃ paṭiharatīti – pāṭihāriyaṃ. Yā ca iddhi yañca pāṭihāriyaṃ, idaṃ vuccati iddhipāṭihāriyaṃ. Abyāpādo ijjhatīti – iddhi. Byāpādaṃ paṭiharatīti – pāṭihāriyaṃ. Yā ca iddhi yañca pāṭihāriyaṃ, idaṃ vuccati iddhipāṭihāriyaṃ. Ālokasaññā ijjhatīti – iddhi. Thinamiddhaṃ paṭiharatīti – pāṭihāriyaṃ…pe… arahattamaggo ijjhatīti – iddhi. Sabbakilese paṭiharatīti – pāṭihāriyaṃ. Yā ca iddhi yañca pāṭihāriyaṃ, idaṃ vuccati iddhipāṭihāriyanti ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pāṭihāriyakathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "7. Samasīsakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "33"
      },
      ". Sabbadhammānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sabbesaṃ dhammānaṃ (ka.) paṭi. ma. 1.87 passitabbā]"
      },
      " sammāsamucchede nirodhe ca anupaṭṭhānatā paññā samasīsaṭṭhe ñāṇaṃ."
    ],
    "innerText": "33. Sabbadhammānaṃ [sabbesaṃ dhammānaṃ (ka.) paṭi. ma. 1.87 passitabbā] sammāsamucchede nirodhe ca anupaṭṭhānatā paññā samasīsaṭṭhe ñāṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbadhammāna"
      },
      "nti pañcakkhandhā, dvādasāyatanāni, aṭṭhārasa dhātuyo, kusalā dhammā, akusalā dhammā, abyākatā dhammā, kāmāvacarā dhammā, rūpāvacarā dhammā, arūpāvacarā dhammā, apariyāpannā dhammā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammā samucchede"
      },
      "ti nekkhammena ",
      " kāmacchandaṃ sammā samucchindati, abyāpādena byāpādaṃ sammā samucchindati, ālokasaññāya thinamiddhaṃ sammā samucchindati, avikkhepena uddhaccaṃ sammā samucchindati, dhammavavatthānena vicikicchaṃ sammā samucchindati, ñāṇena avijjaṃ sammā samucchindati, pāmojjena aratiṃ sammā samucchindati, paṭhamena jhānena nīvaraṇe sammā samucchindati…pe… arahattamaggena sabbakilese sammā samucchindati."
    ],
    "innerText": "Sabbadhammānanti pañcakkhandhā, dvādasāyatanāni, aṭṭhārasa dhātuyo, kusalā dhammā, akusalā dhammā, abyākatā dhammā, kāmāvacarā dhammā, rūpāvacarā dhammā, arūpāvacarā dhammā, apariyāpannā dhammā. Sammā samucchedeti nekkhammena kāmacchandaṃ sammā samucchindati, abyāpādena byāpādaṃ sammā samucchindati, ālokasaññāya thinamiddhaṃ sammā samucchindati, avikkhepena uddhaccaṃ sammā samucchindati, dhammavavatthānena vicikicchaṃ sammā samucchindati, ñāṇena avijjaṃ sammā samucchindati, pāmojjena aratiṃ sammā samucchindati, paṭhamena jhānena nīvaraṇe sammā samucchindati…pe… arahattamaggena sabbakilese sammā samucchindati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nirodhe"
      },
      "ti nekkhammena kāmacchandaṃ nirodheti, abyāpādena byāpādaṃ nirodheti, ālokasaññāya thinamiddhaṃ nirodheti, avikkhepena ",
      " uddhaccaṃ nirodheti, dhammavavatthānena vicikicchaṃ nirodheti, ñāṇena avijjaṃ nirodheti, pāmojjena aratiṃ nirodheti, paṭhamena jhānena nīvaraṇe nirodheti…pe… arahattamaggena sabbakilese nirodheti."
    ],
    "innerText": "Nirodheti nekkhammena kāmacchandaṃ nirodheti, abyāpādena byāpādaṃ nirodheti, ālokasaññāya thinamiddhaṃ nirodheti, avikkhepena uddhaccaṃ nirodheti, dhammavavatthānena vicikicchaṃ nirodheti, ñāṇena avijjaṃ nirodheti, pāmojjena aratiṃ nirodheti, paṭhamena jhānena nīvaraṇe nirodheti…pe… arahattamaggena sabbakilese nirodheti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anupaṭṭhānatā"
      },
      "ti nekkhammaṃ paṭiladdhassa kāmacchando na upaṭṭhāti, abyāpādaṃ paṭiladdhassa byāpādo na upaṭṭhāti, ālokasaññaṃ paṭiladdhassa thinamiddhaṃ na upaṭṭhāti, avikkhepaṃ paṭiladdhassa uddhaccaṃ na upaṭṭhāti, dhammavavatthānaṃ paṭiladdhassa vicikicchā na upaṭṭhāti, ñāṇaṃ paṭiladdhassa avijjā na upaṭṭhāti, pāmojjaṃ paṭiladdhassa arati na upaṭṭhāti, paṭhamaṃ jhānaṃ paṭiladdhassa ",
      " nīvaraṇā na upaṭṭhanti…pe… arahattamaggaṃ paṭiladdhassa sabbakilesā na upaṭṭhanti."
    ],
    "innerText": "Anupaṭṭhānatāti nekkhammaṃ paṭiladdhassa kāmacchando na upaṭṭhāti, abyāpādaṃ paṭiladdhassa byāpādo na upaṭṭhāti, ālokasaññaṃ paṭiladdhassa thinamiddhaṃ na upaṭṭhāti, avikkhepaṃ paṭiladdhassa uddhaccaṃ na upaṭṭhāti, dhammavavatthānaṃ paṭiladdhassa vicikicchā na upaṭṭhāti, ñāṇaṃ paṭiladdhassa avijjā na upaṭṭhāti, pāmojjaṃ paṭiladdhassa arati na upaṭṭhāti, paṭhamaṃ jhānaṃ paṭiladdhassa nīvaraṇā na upaṭṭhanti…pe… arahattamaggaṃ paṭiladdhassa sabbakilesā na upaṭṭhanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sama"
      },
      "nti kāmacchandassa pahīnattā nekkhammaṃ samaṃ, byāpādassa pahīnattā abyāpādo samaṃ, thinamiddhassa pahīnattā ālokasaññā samaṃ, uddhaccassa pahīnattā avikkhepo samaṃ, vicikicchāya pahīnattā dhammavavatthānaṃ samaṃ, avijjāya pahīnattā ñāṇaṃ samaṃ, aratiyā pahīnattā pāmojjaṃ samaṃ, nīvaraṇānaṃ pahīnattā paṭhamaṃ jhānaṃ samaṃ…pe… sabbakilesānaṃ pahīnattā arahattamaggo samaṃ."
    ],
    "innerText": "Samanti kāmacchandassa pahīnattā nekkhammaṃ samaṃ, byāpādassa pahīnattā abyāpādo samaṃ, thinamiddhassa pahīnattā ālokasaññā samaṃ, uddhaccassa pahīnattā avikkhepo samaṃ, vicikicchāya pahīnattā dhammavavatthānaṃ samaṃ, avijjāya pahīnattā ñāṇaṃ samaṃ, aratiyā pahīnattā pāmojjaṃ samaṃ, nīvaraṇānaṃ pahīnattā paṭhamaṃ jhānaṃ samaṃ…pe… sabbakilesānaṃ pahīnattā arahattamaggo samaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sīsa"
      },
      "nti terasa sīsāni – palibodhasīsañca taṇhā, vinibandhanasīsañca māno ",
      ", parāmāsasīsañca diṭṭhi, vikkhepasīsañca uddhaccaṃ, saṃkilesasīsañca avijjā, adhimokkhasīsañca saddhā, paggahasīsañca vīriyaṃ, upaṭṭhānasīsañca sati, avikkhepasīsañca samādhi, dassanasīsañca paññā, pavattasīsañca jīvitindriyaṃ, gocarasīsañca vimokkho, saṅkhārasīsañca nirodhoti."
    ],
    "innerText": "Sīsanti terasa sīsāni – palibodhasīsañca taṇhā, vinibandhanasīsañca māno , parāmāsasīsañca diṭṭhi, vikkhepasīsañca uddhaccaṃ, saṃkilesasīsañca avijjā, adhimokkhasīsañca saddhā, paggahasīsañca vīriyaṃ, upaṭṭhānasīsañca sati, avikkhepasīsañca samādhi, dassanasīsañca paññā, pavattasīsañca jīvitindriyaṃ, gocarasīsañca vimokkho, saṅkhārasīsañca nirodhoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Samasīsakathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "8. Satipaṭṭhānakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "34"
      },
      ". Sāvatthinidānaṃ ",
      ". ‘‘Cattārome ",
      ", bhikkhave, satipaṭṭhānā. Katame cattāro? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Vedanāsu…pe… citte… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Ime kho, bhikkhave, cattāro satipaṭṭhānā’’ti."
    ],
    "innerText": "34. Sāvatthinidānaṃ . ‘‘Cattārome , bhikkhave, satipaṭṭhānā. Katame cattāro? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Vedanāsu…pe… citte… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Ime kho, bhikkhave, cattāro satipaṭṭhānā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "35"
      },
      ". [Ka] kathaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāye kāyānupassī viharati? "
      },
      " Idhekacco pathavīkāyaṃ aniccato anupassati, no niccato; dukkhato anupassati, no sukhato; anattato anupassati, no attato; nibbindati, no nandati; virajjati, no rajjati; nirodheti, no samudeti, paṭinissajjati, no ādiyati ",
      ". Aniccato anupassanto niccasaññaṃ pajahati, dukkhato anupassanto sukhasaññaṃ pajahati, anattato anupassanto attasaññaṃ pajahati, nibbindanto nandiṃ pajahati, virajjanto rāgaṃ pajahati, nirodhento samudayaṃ pajahati, paṭinissajjanto ādānaṃ pajahati. Imehi sattahi ākārehi kāyaṃ anupassati. Kāyo upaṭṭhānaṃ, no sati. Sati upaṭṭhānañceva sati ca. Tāya satiyā tena ñāṇena taṃ kāyaṃ anupassati. Tena vuccati – ‘‘kāye kāyānupassanāsatipaṭṭhānā’’."
    ],
    "innerText": "35. [Ka] kathaṃ kāye kāyānupassī viharati? Idhekacco pathavīkāyaṃ aniccato anupassati, no niccato; dukkhato anupassati, no sukhato; anattato anupassati, no attato; nibbindati, no nandati; virajjati, no rajjati; nirodheti, no samudeti, paṭinissajjati, no ādiyati . Aniccato anupassanto niccasaññaṃ pajahati, dukkhato anupassanto sukhasaññaṃ pajahati, anattato anupassanto attasaññaṃ pajahati, nibbindanto nandiṃ pajahati, virajjanto rāgaṃ pajahati, nirodhento samudayaṃ pajahati, paṭinissajjanto ādānaṃ pajahati. Imehi sattahi ākārehi kāyaṃ anupassati. Kāyo upaṭṭhānaṃ, no sati. Sati upaṭṭhānañceva sati ca. Tāya satiyā tena ñāṇena taṃ kāyaṃ anupassati. Tena vuccati – ‘‘kāye kāyānupassanāsatipaṭṭhānā’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhāvanā"
      },
      "ti catasso bhāvanā – tattha jātānaṃ dhammānaṃ anativattanaṭṭhena bhāvanā, indriyānaṃ ekarasaṭṭhena bhāvanā, tadupagavīriyavāhanaṭṭhena bhāvanā, āsevanaṭṭhena bhāvanā."
    ],
    "innerText": "Bhāvanāti catasso bhāvanā – tattha jātānaṃ dhammānaṃ anativattanaṭṭhena bhāvanā, indriyānaṃ ekarasaṭṭhena bhāvanā, tadupagavīriyavāhanaṭṭhena bhāvanā, āsevanaṭṭhena bhāvanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idhekacco āpokāyaṃ…pe… tejokāyaṃ… vāyokāyaṃ… kesakāyaṃ… lomakāyaṃ… chavikāyaṃ… cammakāyaṃ… maṃsakāyaṃ… rudhirakāyaṃ… nhārukāyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[nahārukāyaṃ (syā.)]"
      },
      " … aṭṭhikāyaṃ… aṭṭhimiñjakāyaṃ ",
      " aniccato anupassati, no niccato; dukkhato anupassati, no sukhato ",
      "; anattato anupassati, no attato; nibbindati, no nandati; virajjati, no rajjati, nirodheti, no samudeti; paṭinissajjati, no ādiyati. Aniccato anupassanto niccasaññaṃ pajahati, dukkhato anupassanto sukhasaññaṃ pajahati, anattato anupassanto attasaññaṃ pajahati, nibbindanto ",
      " nandiṃ pajahati, virajjanto rāgaṃ pajahati, nirodhento samudayaṃ pajahati, paṭinissajjanto ādānaṃ pajahati ",
      ". Imehi sattahi ākārehi kāyaṃ anupassati. Kāyo upaṭṭhānaṃ, no sati. Sati upaṭṭhānañceva sati ca. Tāya satiyā tena ñāṇena taṃ kāyaṃ anupassati. Tena vuccati – ‘‘kāye kāyānupassanāsatipaṭṭhānā’’."
    ],
    "innerText": "Idhekacco āpokāyaṃ…pe… tejokāyaṃ… vāyokāyaṃ… kesakāyaṃ… lomakāyaṃ… chavikāyaṃ… cammakāyaṃ… maṃsakāyaṃ… rudhirakāyaṃ… nhārukāyaṃ [nahārukāyaṃ (syā.)] … aṭṭhikāyaṃ… aṭṭhimiñjakāyaṃ aniccato anupassati, no niccato; dukkhato anupassati, no sukhato ; anattato anupassati, no attato; nibbindati, no nandati; virajjati, no rajjati, nirodheti, no samudeti; paṭinissajjati, no ādiyati. Aniccato anupassanto niccasaññaṃ pajahati, dukkhato anupassanto sukhasaññaṃ pajahati, anattato anupassanto attasaññaṃ pajahati, nibbindanto nandiṃ pajahati, virajjanto rāgaṃ pajahati, nirodhento samudayaṃ pajahati, paṭinissajjanto ādānaṃ pajahati . Imehi sattahi ākārehi kāyaṃ anupassati. Kāyo upaṭṭhānaṃ, no sati. Sati upaṭṭhānañceva sati ca. Tāya satiyā tena ñāṇena taṃ kāyaṃ anupassati. Tena vuccati – ‘‘kāye kāyānupassanāsatipaṭṭhānā’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhāvanā"
      },
      "ti catasso bhāvanā – tattha jātānaṃ dhammānaṃ anativattanaṭṭhena bhāvanā, indriyānaṃ ekarasaṭṭhena bhāvanā, tadupagavīriyavāhanaṭṭhena bhāvanā, āsevanaṭṭhena bhāvanā. Evaṃ kāye kāyānupassī viharati."
    ],
    "innerText": "Bhāvanāti catasso bhāvanā – tattha jātānaṃ dhammānaṃ anativattanaṭṭhena bhāvanā, indriyānaṃ ekarasaṭṭhena bhāvanā, tadupagavīriyavāhanaṭṭhena bhāvanā, āsevanaṭṭhena bhāvanā. Evaṃ kāye kāyānupassī viharati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "[Kha] kathaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vedanāsu vedanānupassī viharati?"
      },
      " Idhekacco sukhaṃ vedanaṃ aniccato anupassati, no niccato…pe… paṭinissajjati, no ādiyati. Aniccato anupassanto niccasaññaṃ pajahati…pe… paṭinissajjanto ādānaṃ pajahati. Imehi sattahi ākārehi vedanaṃ anupassati. Vedanā upaṭṭhānaṃ, no sati. Sati upaṭṭhānañceva sati ca. Tāya satiyā tena ñāṇena taṃ vedanaṃ anupassati. Tena vuccati – ‘‘vedanāsu vedanānupassanāsatipaṭṭhānā’’."
    ],
    "innerText": "[Kha] kathaṃ vedanāsu vedanānupassī viharati? Idhekacco sukhaṃ vedanaṃ aniccato anupassati, no niccato…pe… paṭinissajjati, no ādiyati. Aniccato anupassanto niccasaññaṃ pajahati…pe… paṭinissajjanto ādānaṃ pajahati. Imehi sattahi ākārehi vedanaṃ anupassati. Vedanā upaṭṭhānaṃ, no sati. Sati upaṭṭhānañceva sati ca. Tāya satiyā tena ñāṇena taṃ vedanaṃ anupassati. Tena vuccati – ‘‘vedanāsu vedanānupassanāsatipaṭṭhānā’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhāvanā"
      },
      "ti catasso bhāvanā…pe… āsevanaṭṭhena bhāvanā…pe… idhekacco dukkhaṃ vedanaṃ…pe… adukkhamasukhaṃ vedanaṃ… sāmisaṃ sukhaṃ vedanaṃ… nirāmisaṃ sukhaṃ vedanaṃ… sāmisaṃ dukkhaṃ vedanaṃ… nirāmisaṃ dukkhaṃ vedanaṃ… sāmisaṃ adukkhamasukhaṃ vedanaṃ… nirāmisaṃ adukkhamasukhaṃ vedanaṃ… cakkhusamphassajaṃ vedanaṃ… sotasamphassajaṃ vedanaṃ… ghānasamphassajaṃ vedanaṃ… jivhāsamphassajaṃ vedanaṃ… kāyasamphassajaṃ vedanaṃ… manosamphassajaṃ vedanaṃ aniccato anupassati, no niccato…pe… paṭinissajjati, no ādiyati. Aniccato anupassanto niccasaññaṃ pajahati…pe… paṭinissajjanto ādānaṃ pajahati. Imehi sattahi ākārehi vedanaṃ anupassati. Vedanā upaṭṭhānaṃ, no sati. Sati upaṭṭhānañceva sati ca. Tāya satiyā tena ñāṇena taṃ vedanaṃ anupassati. Tena vuccati – ‘‘vedanāsu vedanānupassanāsatipaṭṭhānā’’."
    ],
    "innerText": "Bhāvanāti catasso bhāvanā…pe… āsevanaṭṭhena bhāvanā…pe… idhekacco dukkhaṃ vedanaṃ…pe… adukkhamasukhaṃ vedanaṃ… sāmisaṃ sukhaṃ vedanaṃ… nirāmisaṃ sukhaṃ vedanaṃ… sāmisaṃ dukkhaṃ vedanaṃ… nirāmisaṃ dukkhaṃ vedanaṃ… sāmisaṃ adukkhamasukhaṃ vedanaṃ… nirāmisaṃ adukkhamasukhaṃ vedanaṃ… cakkhusamphassajaṃ vedanaṃ… sotasamphassajaṃ vedanaṃ… ghānasamphassajaṃ vedanaṃ… jivhāsamphassajaṃ vedanaṃ… kāyasamphassajaṃ vedanaṃ… manosamphassajaṃ vedanaṃ aniccato anupassati, no niccato…pe… paṭinissajjati, no ādiyati. Aniccato anupassanto niccasaññaṃ pajahati…pe… paṭinissajjanto ādānaṃ pajahati. Imehi sattahi ākārehi vedanaṃ anupassati. Vedanā upaṭṭhānaṃ, no sati. Sati upaṭṭhānañceva sati ca. Tāya satiyā tena ñāṇena taṃ vedanaṃ anupassati. Tena vuccati – ‘‘vedanāsu vedanānupassanāsatipaṭṭhānā’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhāvanā"
      },
      "ti ",
      " catasso bhāvanā…pe… evaṃ vedanāsu vedanānupassī viharati."
    ],
    "innerText": "Bhāvanāti catasso bhāvanā…pe… evaṃ vedanāsu vedanānupassī viharati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "[Ga] kathaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "citte cittānupassī viharati? "
      },
      " Idhekacco sarāgaṃ cittaṃ aniccato anupassati, no niccato…pe… paṭinissajjati, no ādiyati. Aniccato anupassanto niccasaññaṃ pajahati…pe… paṭinissajjanto ādānaṃ pajahati ",
      ". Imehi sattahi ākārehi cittaṃ anupassati. Cittaṃ upaṭṭhānaṃ, no sati. Sati upaṭṭhānañceva sati ca. Tāya satiyā tena ñāṇena taṃ cittaṃ anupassati. Tena vuccati – ‘‘citte cittānupassanāsatipaṭṭhānā’’."
    ],
    "innerText": "[Ga] kathaṃ citte cittānupassī viharati? Idhekacco sarāgaṃ cittaṃ aniccato anupassati, no niccato…pe… paṭinissajjati, no ādiyati. Aniccato anupassanto niccasaññaṃ pajahati…pe… paṭinissajjanto ādānaṃ pajahati . Imehi sattahi ākārehi cittaṃ anupassati. Cittaṃ upaṭṭhānaṃ, no sati. Sati upaṭṭhānañceva sati ca. Tāya satiyā tena ñāṇena taṃ cittaṃ anupassati. Tena vuccati – ‘‘citte cittānupassanāsatipaṭṭhānā’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhāvanā"
      },
      "ti catasso bhāvanā…pe… āsevanaṭṭhena bhāvanā."
    ],
    "innerText": "Bhāvanāti catasso bhāvanā…pe… āsevanaṭṭhena bhāvanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idhekacco vītarāgaṃ cittaṃ…pe… sadosaṃ cittaṃ… vītadosaṃ cittaṃ… samohaṃ cittaṃ… vītamohaṃ cittaṃ… saṃkhittaṃ cittaṃ… vikkhittaṃ cittaṃ… mahaggataṃ cittaṃ… amahaggataṃ cittaṃ… sauttaraṃ cittaṃ… anuttaraṃ cittaṃ… samāhitaṃ cittaṃ… asamāhitaṃ cittaṃ… vimuttaṃ cittaṃ… avimuttaṃ cittaṃ… cakkhuviññāṇaṃ… sotaviññāṇaṃ… ghānaviññāṇaṃ… jivhāviññāṇaṃ… kāyaviññāṇaṃ… manoviññāṇaṃ aniccato anupassati, no niccato…pe… paṭinissajjati, no ādiyati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aniccato anupassanto"
      },
      " niccasaññaṃ pajahati…pe… paṭinissajjanto ādānaṃ pajahati. Imehi sattahi ākārehi cittaṃ anupassati. Cittaṃ upaṭṭhānaṃ, no sati. Sati upaṭṭhānañceva sati ca. Tāya satiyā tena ",
      " ñāṇena taṃ cittaṃ anupassati. Tena vuccati – ‘‘citte cittānupassanāsatipaṭṭhānā’’."
    ],
    "innerText": "Idhekacco vītarāgaṃ cittaṃ…pe… sadosaṃ cittaṃ… vītadosaṃ cittaṃ… samohaṃ cittaṃ… vītamohaṃ cittaṃ… saṃkhittaṃ cittaṃ… vikkhittaṃ cittaṃ… mahaggataṃ cittaṃ… amahaggataṃ cittaṃ… sauttaraṃ cittaṃ… anuttaraṃ cittaṃ… samāhitaṃ cittaṃ… asamāhitaṃ cittaṃ… vimuttaṃ cittaṃ… avimuttaṃ cittaṃ… cakkhuviññāṇaṃ… sotaviññāṇaṃ… ghānaviññāṇaṃ… jivhāviññāṇaṃ… kāyaviññāṇaṃ… manoviññāṇaṃ aniccato anupassati, no niccato…pe… paṭinissajjati, no ādiyati. Aniccato anupassanto niccasaññaṃ pajahati…pe… paṭinissajjanto ādānaṃ pajahati. Imehi sattahi ākārehi cittaṃ anupassati. Cittaṃ upaṭṭhānaṃ, no sati. Sati upaṭṭhānañceva sati ca. Tāya satiyā tena ñāṇena taṃ cittaṃ anupassati. Tena vuccati – ‘‘citte cittānupassanāsatipaṭṭhānā’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhāvanā"
      },
      "ti catasso bhāvanā…pe… āsevanaṭṭhena bhāvanā. Evaṃ citte cittānupassī viharati."
    ],
    "innerText": "Bhāvanāti catasso bhāvanā…pe… āsevanaṭṭhena bhāvanā. Evaṃ citte cittānupassī viharati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "[Gha] kathaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammesu dhammānupassī viharati?"
      },
      " Idhekacco ṭhapetvā kāyaṃ ṭhapetvā vedanaṃ ṭhapetvā cittaṃ tadavasese dhamme aniccato anupassati, no niccato; dukkhato anupassati, no sukhato; anattato anupassati, no attato; nibbindati, no nandati; virajjati, no rajjati; nirodheti, no samudeti; paṭinissajjati, no ādiyati. Aniccato anupassanto niccasaññaṃ pajahati, dukkhato anupassanto sukhasaññaṃ pajahati, anattato anupassanto attasaññaṃ pajahati, nibbindanto nandiṃ pajahati, virajjanto rāgaṃ pajahati, nirodhento samudayaṃ pajahati, paṭinissajjanto ādānaṃ pajahati. Imehi sattahi ākārehi te dhamme anupassati. Dhammā upaṭṭhānaṃ, no sati. Sati upaṭṭhānañceva sati ca. Tāya satiyā tena ñāṇena te ",
      " dhamme anupassati. Tena vuccati – ‘‘dhammesu dhammānupassanāsatipaṭṭhānā’’."
    ],
    "innerText": "[Gha] kathaṃ dhammesu dhammānupassī viharati? Idhekacco ṭhapetvā kāyaṃ ṭhapetvā vedanaṃ ṭhapetvā cittaṃ tadavasese dhamme aniccato anupassati, no niccato; dukkhato anupassati, no sukhato; anattato anupassati, no attato; nibbindati, no nandati; virajjati, no rajjati; nirodheti, no samudeti; paṭinissajjati, no ādiyati. Aniccato anupassanto niccasaññaṃ pajahati, dukkhato anupassanto sukhasaññaṃ pajahati, anattato anupassanto attasaññaṃ pajahati, nibbindanto nandiṃ pajahati, virajjanto rāgaṃ pajahati, nirodhento samudayaṃ pajahati, paṭinissajjanto ādānaṃ pajahati. Imehi sattahi ākārehi te dhamme anupassati. Dhammā upaṭṭhānaṃ, no sati. Sati upaṭṭhānañceva sati ca. Tāya satiyā tena ñāṇena te dhamme anupassati. Tena vuccati – ‘‘dhammesu dhammānupassanāsatipaṭṭhānā’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhāvanā"
      },
      "ti ",
      " catasso bhāvanā – tattha jātānaṃ dhammānaṃ anativattanaṭṭhena bhāvanā, indriyānaṃ ekarasaṭṭhena bhāvanā, tadupagavīriyavāhanaṭṭhena bhāvanā, āsevanaṭṭhena bhāvanā. Evaṃ ",
      " dhammesu dhammānupassī viharatīti."
    ],
    "innerText": "Bhāvanāti catasso bhāvanā – tattha jātānaṃ dhammānaṃ anativattanaṭṭhena bhāvanā, indriyānaṃ ekarasaṭṭhena bhāvanā, tadupagavīriyavāhanaṭṭhena bhāvanā, āsevanaṭṭhena bhāvanā. Evaṃ dhammesu dhammānupassī viharatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Satipaṭṭhānakathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "9. Vipassanākathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "36"
      },
      ". Evaṃ ",
      " me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –"
    ],
    "innerText": "36. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘So vata, bhikkhave, bhikkhu kañci ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kiñci (ka.) a. ni. 6.99-100 passitabbā]"
      },
      " saṅkhāraṃ niccato samanupassanto anulomikāya khantiyā samannāgato bhavissatīti – netaṃ ṭhānaṃ vijjati; anulomikāya khantiyā asamannāgato sammattaniyāmaṃ okkamissatīti – netaṃ ṭhānaṃ vijjati; sammattaniyāmaṃ anokkamamāno sotāpattiphalaṃ vā sakadāgāmiphalaṃ vā anāgāmiphalaṃ vā arahattaṃ vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[arahattaphalaṃ vā (syā. ka.) a. ni. 6.98 passitabbā]"
      },
      " sacchikarissatīti – netaṃ ṭhānaṃ vijjati."
    ],
    "innerText": "‘‘So vata, bhikkhave, bhikkhu kañci [kiñci (ka.) a. ni. 6.99-100 passitabbā] saṅkhāraṃ niccato samanupassanto anulomikāya khantiyā samannāgato bhavissatīti – netaṃ ṭhānaṃ vijjati; anulomikāya khantiyā asamannāgato sammattaniyāmaṃ okkamissatīti – netaṃ ṭhānaṃ vijjati; sammattaniyāmaṃ anokkamamāno sotāpattiphalaṃ vā sakadāgāmiphalaṃ vā anāgāmiphalaṃ vā arahattaṃ vā [arahattaphalaṃ vā (syā. ka.) a. ni. 6.98 passitabbā] sacchikarissatīti – netaṃ ṭhānaṃ vijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘So vata, bhikkhave, bhikkhu sabbasaṅkhāre aniccato samanupassanto anulomikāya khantiyā samannāgato bhavissatīti – ṭhānametaṃ vijjati; anulomikāya khantiyā samannāgato sammattaniyāmaṃ okkamissatīti – ṭhānametaṃ vijjati, sammattaniyāmaṃ okkamamāno sotāpattiphalaṃ vā sakadāgāmiphalaṃ vā anāgāmiphalaṃ vā arahattaṃ vā sacchikarissatīti – ṭhānametaṃ vijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘So vata, bhikkhave, bhikkhu kañci saṅkhāraṃ sukhato samanupassanto anulomikāya khantiyā samannāgato bhavissatīti – netaṃ ṭhānaṃ vijjati; anulomikāya khantiyā asamannāgato sammattaniyāmaṃ okkamissatīti ",
      " – netaṃ ",
      " ṭhānaṃ vijjati; sammattaniyāmaṃ anokkamamāno sotāpattiphalaṃ vā sakadāgāmiphalaṃ vā anāgāmiphalaṃ vā arahattaṃ vā sacchikarissatīti – netaṃ ṭhānaṃ vijjati ",
      "."
    ],
    "innerText": "‘‘So vata, bhikkhave, bhikkhu kañci saṅkhāraṃ sukhato samanupassanto anulomikāya khantiyā samannāgato bhavissatīti – netaṃ ṭhānaṃ vijjati; anulomikāya khantiyā asamannāgato sammattaniyāmaṃ okkamissatīti – netaṃ ṭhānaṃ vijjati; sammattaniyāmaṃ anokkamamāno sotāpattiphalaṃ vā sakadāgāmiphalaṃ vā anāgāmiphalaṃ vā arahattaṃ vā sacchikarissatīti – netaṃ ṭhānaṃ vijjati ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘So ",
      " vata, bhikkhave, bhikkhu sabbasaṅkhāre dukkhato samanupassanto anulomikāya khantiyā samannāgato bhavissatīti – ṭhānametaṃ vijjati; anulomikāya khantiyā samannāgato sammattaniyāmaṃ okkamissatīti – ṭhānametaṃ vijjati; sammattaniyāmaṃ okkamamāno sotāpattiphalaṃ vā sakadāgāmiphalaṃ vā anāgāmiphalaṃ vā arahattaṃ vā sacchikarissatīti – ṭhānametaṃ vijjati."
    ],
    "innerText": "‘‘So vata, bhikkhave, bhikkhu sabbasaṅkhāre dukkhato samanupassanto anulomikāya khantiyā samannāgato bhavissatīti – ṭhānametaṃ vijjati; anulomikāya khantiyā samannāgato sammattaniyāmaṃ okkamissatīti – ṭhānametaṃ vijjati; sammattaniyāmaṃ okkamamāno sotāpattiphalaṃ vā sakadāgāmiphalaṃ vā anāgāmiphalaṃ vā arahattaṃ vā sacchikarissatīti – ṭhānametaṃ vijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘So vata, bhikkhave, bhikkhu kañci dhammaṃ attato samanupassanto anulomikāya khantiyā samannāgato bhavissatīti – netaṃ ṭhānaṃ vijjati; anulomikāya khantiyā asamannāgato sammattaniyāmaṃ okkamissatīti – netaṃ ṭhānaṃ vijjati; sammattaniyāmaṃ anokkamamāno sotāpattiphalaṃ vā sakadāgāmiphalaṃ vā anāgāmiphalaṃ vā arahattaṃ vā sacchikarissatīti – netaṃ ṭhānaṃ vijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘So vata, bhikkhave, bhikkhu sabbadhamme ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kañci dhammaṃ (syā.), kiñci dhammaṃ (ka.) a. ni. 6.100 passitabbā]"
      },
      " anattato samanupassanto anulomikāya khantiyā samannāgato bhavissatīti – ṭhānametaṃ vijjati; anulomikāya khantiyā samannāgato sammattaniyāmaṃ okkamissatīti – ṭhānametaṃ vijjati; sammattaniyāmaṃ okkamamāno sotāpattiphalaṃ vā sakadāgāmiphalaṃ vā anāgāmiphalaṃ vā arahattaṃ vā sacchikarissatīti – ṭhānametaṃ vijjati."
    ],
    "innerText": "‘‘So vata, bhikkhave, bhikkhu sabbadhamme [kañci dhammaṃ (syā.), kiñci dhammaṃ (ka.) a. ni. 6.100 passitabbā] anattato samanupassanto anulomikāya khantiyā samannāgato bhavissatīti – ṭhānametaṃ vijjati; anulomikāya khantiyā samannāgato sammattaniyāmaṃ okkamissatīti – ṭhānametaṃ vijjati; sammattaniyāmaṃ okkamamāno sotāpattiphalaṃ vā sakadāgāmiphalaṃ vā anāgāmiphalaṃ vā arahattaṃ vā sacchikarissatīti – ṭhānametaṃ vijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘So vata, bhikkhave, bhikkhu nibbānaṃ dukkhato samanupassanto ",
      " anulomikāya khantiyā samannāgato bhavissatīti – netaṃ ṭhānaṃ vijjati; anulomikāya khantiyā asamannāgato sammattaniyāmaṃ okkamissatīti – netaṃ ṭhānaṃ vijjati; sammattaniyāmaṃ anokkamamāno sotāpattiphalaṃ vā sakadāgāmiphalaṃ vā anāgāmiphalaṃ vā arahattaṃ vā sacchikarissatīti – netaṃ ṭhānaṃ vijjati."
    ],
    "innerText": "‘‘So vata, bhikkhave, bhikkhu nibbānaṃ dukkhato samanupassanto anulomikāya khantiyā samannāgato bhavissatīti – netaṃ ṭhānaṃ vijjati; anulomikāya khantiyā asamannāgato sammattaniyāmaṃ okkamissatīti – netaṃ ṭhānaṃ vijjati; sammattaniyāmaṃ anokkamamāno sotāpattiphalaṃ vā sakadāgāmiphalaṃ vā anāgāmiphalaṃ vā arahattaṃ vā sacchikarissatīti – netaṃ ṭhānaṃ vijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘So vata, bhikkhave, bhikkhu nibbānaṃ sukhato samanupassanto anulomikāya khantiyā samannāgato bhavissatīti – ṭhānametaṃ vijjati; anulomikāya ",
      " khantiyā samannāgato sammattaniyāmaṃ okkamissatīti – ṭhānametaṃ vijjati; sammattaniyāmaṃ okkamamāno sotāpattiphalaṃ vā sakadāgāmiphalaṃ vā anāgāmiphalaṃ vā arahattaṃ vā sacchikarissatīti – ṭhānametaṃ vijjati’’."
    ],
    "innerText": "‘‘So vata, bhikkhave, bhikkhu nibbānaṃ sukhato samanupassanto anulomikāya khantiyā samannāgato bhavissatīti – ṭhānametaṃ vijjati; anulomikāya khantiyā samannāgato sammattaniyāmaṃ okkamissatīti – ṭhānametaṃ vijjati; sammattaniyāmaṃ okkamamāno sotāpattiphalaṃ vā sakadāgāmiphalaṃ vā anāgāmiphalaṃ vā arahattaṃ vā sacchikarissatīti – ṭhānametaṃ vijjati’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "37"
      },
      ". Katihākārehi ",
      " anulomikaṃ khantiṃ paṭilabhati, katihākārehi sammattaniyāmaṃ okkamati? Cattārīsāya ākārehi anulomikaṃ khantiṃ paṭilabhati, cattārīsāya ākārehi sammattaniyāmaṃ okkamati."
    ],
    "innerText": "37. Katihākārehi anulomikaṃ khantiṃ paṭilabhati, katihākārehi sammattaniyāmaṃ okkamati? Cattārīsāya ākārehi anulomikaṃ khantiṃ paṭilabhati, cattārīsāya ākārehi sammattaniyāmaṃ okkamati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katamehi cattārīsāya ākārehi anulomikaṃ khantiṃ paṭilabhati, katamahi cattārīsāya ākārehi sammattaniyāmaṃ okkamati? Pañcakkhandhe aniccato dukkhato rogato gaṇḍato sallato aghato ābādhato parato palokato ītito upaddavato bhayato upasaggato calato pabhaṅguto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pabhaṅgato (syā.)]"
      },
      " addhuvato atāṇato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[attāṇato (syā.)]"
      },
      " aleṇato asaraṇato rittato ",
      " tucchato suññato anattato ādīnavato vipariṇāmadhammato asārakato aghamūlato vadhakato vibhavato sāsavato saṅkhatato mārāmisato jātidhammato jarādhammato byādhidhammato maraṇadhammato sokadhammato paridevadhammato upāyāsadhammato saṃkilesikadhammato."
    ],
    "innerText": "Katamehi cattārīsāya ākārehi anulomikaṃ khantiṃ paṭilabhati, katamahi cattārīsāya ākārehi sammattaniyāmaṃ okkamati? Pañcakkhandhe aniccato dukkhato rogato gaṇḍato sallato aghato ābādhato parato palokato ītito upaddavato bhayato upasaggato calato pabhaṅguto [pabhaṅgato (syā.)] addhuvato atāṇato [attāṇato (syā.)] aleṇato asaraṇato rittato tucchato suññato anattato ādīnavato vipariṇāmadhammato asārakato aghamūlato vadhakato vibhavato sāsavato saṅkhatato mārāmisato jātidhammato jarādhammato byādhidhammato maraṇadhammato sokadhammato paridevadhammato upāyāsadhammato saṃkilesikadhammato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "38"
      },
      ". Pañcakkhandhe aniccato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho niccaṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe dukkhato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho sukhaṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe rogato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho ārogyaṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe gaṇḍato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho agaṇḍaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[nigaṇḍo (syā.)]"
      },
      " nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe sallato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho visallaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[nissallaṃ (syā.)]"
      },
      " nibbānanti passanto sammattaniyāmaṃ okkamati."
    ],
    "innerText": "38. Pañcakkhandhe aniccato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho niccaṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe dukkhato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho sukhaṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe rogato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho ārogyaṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe gaṇḍato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho agaṇḍaṃ [nigaṇḍo (syā.)] nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe sallato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho visallaṃ [nissallaṃ (syā.)] nibbānanti passanto sammattaniyāmaṃ okkamati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pañcakkhandhe ",
      " aghato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho anagho nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe ābādhato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho anābādho nibbānanti ",
      " passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe parato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho aparappaccayaṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe palokato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho apalokadhammo nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe ītito passanto ",
      " anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho anītikaṃ nibbānanti passanto sammattaniyāmaṃ okkamati."
    ],
    "innerText": "Pañcakkhandhe aghato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho anagho nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe ābādhato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho anābādho nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe parato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho aparappaccayaṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe palokato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho apalokadhammo nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe ītito passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho anītikaṃ nibbānanti passanto sammattaniyāmaṃ okkamati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pañcakkhandhe upaddavato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho anupaddavaṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe bhayato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho abhayaṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe upasaggato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho anupasaggaṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe calato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho acalaṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe pabhaṅguto passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho apabhaṅgu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[appabhaṅgaṃ (syā.)]"
      },
      " nibbānanti passanto sammattaniyāmaṃ okkamati."
    ],
    "innerText": "Pañcakkhandhe upaddavato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho anupaddavaṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe bhayato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho abhayaṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe upasaggato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho anupasaggaṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe calato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho acalaṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe pabhaṅguto passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho apabhaṅgu [appabhaṅgaṃ (syā.)] nibbānanti passanto sammattaniyāmaṃ okkamati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pañcakkhandhe addhuvato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ ",
      " nirodho dhuvaṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe atāṇato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho tāṇaṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe aleṇato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho leṇaṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe asaraṇato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho saraṇaṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe ",
      " rittato passanto anulomikaṃ ",
      " khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho arittaṃ nibbānanti passanto sammattaniyāmaṃ okkamati."
    ],
    "innerText": "Pañcakkhandhe addhuvato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho dhuvaṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe atāṇato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho tāṇaṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe aleṇato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho leṇaṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe asaraṇato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho saraṇaṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe rittato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho arittaṃ nibbānanti passanto sammattaniyāmaṃ okkamati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pañcakkhandhe tucchato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho atucchaṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe suññato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho paramasuññaṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe anattato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho paramatthaṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe ādīnavato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho anādīnavaṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe vipariṇāmadhammato ",
      " passanto anulomikaṃ ",
      " khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho avipariṇāmadhammaṃ nibbānanti passanto sammattaniyāmaṃ okkamati."
    ],
    "innerText": "Pañcakkhandhe tucchato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho atucchaṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe suññato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho paramasuññaṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe anattato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho paramatthaṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe ādīnavato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho anādīnavaṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe vipariṇāmadhammato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho avipariṇāmadhammaṃ nibbānanti passanto sammattaniyāmaṃ okkamati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Pañcakkhandhe asārakato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho sāraṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe aghamūlato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho anaghamūlaṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe vadhakato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho avadhakaṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe vibhavato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho avibhavaṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe sāsavato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho anāsavaṃ nibbānanti passanto sammattaniyāmaṃ okkamati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pañcakkhandhe saṅkhatato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho asaṅkhataṃ nibbānanti passanto sammattaniyāmaṃ ",
      " okkamati. Pañcakkhandhe mārāmisato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho nirāmisaṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe jātidhammato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho ajātaṃ nibbānanti passanto sammattaniyāmaṃ ",
      " okkamati. Pañcakkhandhe jarādhammato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ ",
      " nirodho ajaraṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe byādhidhammato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho abyādhi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[abyādhidhammaṃ (syā.)]"
      },
      " nibbānanti passanto sammattaniyāmaṃ okkamati."
    ],
    "innerText": "Pañcakkhandhe saṅkhatato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho asaṅkhataṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe mārāmisato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho nirāmisaṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe jātidhammato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho ajātaṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe jarādhammato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho ajaraṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe byādhidhammato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho abyādhi [abyādhidhammaṃ (syā.)] nibbānanti passanto sammattaniyāmaṃ okkamati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pañcakkhandhe maraṇadhammato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho amataṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe sokadhammato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho asokaṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe paridevadhammato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho aparidevaṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe upāyāsadhammato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho anupāyāsaṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe saṃkilesikadhammato ",
      " passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho asaṃkiliṭṭhaṃ nibbānanti passanto sammattaniyāmaṃ okkamati."
    ],
    "innerText": "Pañcakkhandhe maraṇadhammato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho amataṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe sokadhammato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho asokaṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe paridevadhammato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho aparidevaṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe upāyāsadhammato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho anupāyāsaṃ nibbānanti passanto sammattaniyāmaṃ okkamati. Pañcakkhandhe saṃkilesikadhammato passanto anulomikaṃ khantiṃ paṭilabhati. Pañcannaṃ khandhānaṃ nirodho asaṃkiliṭṭhaṃ nibbānanti passanto sammattaniyāmaṃ okkamati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "39"
      },
      ". Aniccatoti, aniccānupassanā. Dukkhatoti, dukkhānupassanā. Rogatoti ",
      ", dukkhānupassanā. Gaṇḍatoti, dukkhānupassanā. Sallatoti, dukkhānupassanā. Aghatoti, dukkhānupassanā. Ābādhatoti, dukkhānupassanā. Paratoti, anattānupassanā. Palokatoti, aniccānupassanā. Ītitoti, dukkhānupassanā."
    ],
    "innerText": "39. Aniccatoti, aniccānupassanā. Dukkhatoti, dukkhānupassanā. Rogatoti , dukkhānupassanā. Gaṇḍatoti, dukkhānupassanā. Sallatoti, dukkhānupassanā. Aghatoti, dukkhānupassanā. Ābādhatoti, dukkhānupassanā. Paratoti, anattānupassanā. Palokatoti, aniccānupassanā. Ītitoti, dukkhānupassanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Upaddavatoti, dukkhānupassanā. Bhayatoti, dukkhānupassanā ",
      ". Upasaggatoti, dukkhānupassanā. Calatoti, aniccānupassanā. Pabhaṅgutoti, aniccānupassanā. Addhuvatoti, aniccānupassanā. Atāṇatoti, dukkhānupassanā. Aleṇatoti, dukkhānupassanā. Asaraṇatoti, dukkhānupassanā. Rittatoti, anattānupassanā."
    ],
    "innerText": "Upaddavatoti, dukkhānupassanā. Bhayatoti, dukkhānupassanā . Upasaggatoti, dukkhānupassanā. Calatoti, aniccānupassanā. Pabhaṅgutoti, aniccānupassanā. Addhuvatoti, aniccānupassanā. Atāṇatoti, dukkhānupassanā. Aleṇatoti, dukkhānupassanā. Asaraṇatoti, dukkhānupassanā. Rittatoti, anattānupassanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tucchatoti, anattānupassanā. Suññatoti, anattānupassanā. Anattatoti ",
      ", anattānupassanā. Ādīnavatoti, dukkhānupassanā. Vipariṇāmadhammatoti, aniccānupassanā. Asārakatoti, anattānupassanā. Aghamūlatoti ",
      ", dukkhānupassanā. Vadhakatoti, dukkhānupassanā. Vibhavatoti, aniccānupassanā. Sāsavatoti, dukkhānupassanā."
    ],
    "innerText": "Tucchatoti, anattānupassanā. Suññatoti, anattānupassanā. Anattatoti , anattānupassanā. Ādīnavatoti, dukkhānupassanā. Vipariṇāmadhammatoti, aniccānupassanā. Asārakatoti, anattānupassanā. Aghamūlatoti , dukkhānupassanā. Vadhakatoti, dukkhānupassanā. Vibhavatoti, aniccānupassanā. Sāsavatoti, dukkhānupassanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Saṅkhatatoti, aniccānupassanā. Mārāmisatoti, dukkhānupassanā. Jātidhammatoti, dukkhānupassanā. Jarādhammatoti, dukkhānupassanā. Byādhidhammatoti, dukkhānupassanā. Maraṇadhammatoti, aniccānupassanā. Sokadhammatoti, dukkhānupassanā. Paridevadhammatoti, dukkhānupassanā. Upāyāsadhammatoti, dukkhānupassanā. Saṃkilesikadhammatoti, dukkhānupassanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Imehi cattālīsāya ākārehi anulomikaṃ khantiṃ paṭilabhati. Imehi cattālīsāya ākārehi sammattaniyāmaṃ okkamati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Imehi ",
      " cattālīsāya ākārehi anulomikaṃ khantiṃ paṭilabhantassa, imehi cattālīsāya ākārehi sammattaniyāmaṃ okkamantassa kati aniccānupassanā, kati dukkhānupassanā, kati anattānupassanā?"
    ],
    "innerText": "Imehi cattālīsāya ākārehi anulomikaṃ khantiṃ paṭilabhantassa, imehi cattālīsāya ākārehi sammattaniyāmaṃ okkamantassa kati aniccānupassanā, kati dukkhānupassanā, kati anattānupassanā?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Pañcavīsati ",
      " anattānupassanā, paññāsa aniccānupassanā;"
    ],
    "innerText": "Pañcavīsati anattānupassanā, paññāsa aniccānupassanā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sataṃ pañcavīsati ceva, yāni dukkhe pavuccareti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vipassanākathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "10. Mātikākathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "40"
      },
      ". Nicchāto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[nicchāto muccatīti (syā.)]"
      },
      ", mokkho vimokkho, vijjāvimutti, adhisīlaṃ, adhicittaṃ, adhipaññā, passaddhi, ñāṇaṃ, dassanaṃ visuddhi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[suddhi (syā.)]"
      },
      " nekkhammaṃ, nissaraṇaṃ paviveko, vossaggo, cariyā, jhānavimokkho, bhāvanā, adhiṭṭhānaṃ, jīvitaṃ."
    ],
    "innerText": "40. Nicchāto [nicchāto muccatīti (syā.)], mokkho vimokkho, vijjāvimutti, adhisīlaṃ, adhicittaṃ, adhipaññā, passaddhi, ñāṇaṃ, dassanaṃ visuddhi [suddhi (syā.)] nekkhammaṃ, nissaraṇaṃ paviveko, vossaggo, cariyā, jhānavimokkho, bhāvanā, adhiṭṭhānaṃ, jīvitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "41"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nicchāto"
      },
      "ti ",
      " nekkhammena kāmacchandato nicchāto, abyāpādena byāpādato nicchāto…pe… paṭhamena jhānena nīvaraṇehi nicchāto…pe… arahattamaggena sabbakilesehi nicchāto."
    ],
    "innerText": "41.Nicchātoti nekkhammena kāmacchandato nicchāto, abyāpādena byāpādato nicchāto…pe… paṭhamena jhānena nīvaraṇehi nicchāto…pe… arahattamaggena sabbakilesehi nicchāto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mokkho vimokkho"
      },
      "ti nekkhammena kāmacchandato muccatīti – mokkho vimokkho. Abyāpādena byāpādato muccatīti – mokkho vimokkho…pe… paṭhamena jhānena nīvaraṇehi muccatīti – mokkho vimokkho…pe… arahattamaggena sabbakilesehi ",
      " muccatīti – mokkho vimokkho."
    ],
    "innerText": "Mokkho vimokkhoti nekkhammena kāmacchandato muccatīti – mokkho vimokkho. Abyāpādena byāpādato muccatīti – mokkho vimokkho…pe… paṭhamena jhānena nīvaraṇehi muccatīti – mokkho vimokkho…pe… arahattamaggena sabbakilesehi muccatīti – mokkho vimokkho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vijjāvimuttī"
      },
      "ti nekkhammaṃ vijjatīti vijjā, kāmacchandato muccatīti vimutti. Vijjanto muccati, muccanto vijjatīti – vijjāvimutti. Abyāpādo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[abyāpādaṃ (syā.)]"
      },
      " vijjatīti vijjā, byāpādato vimuccatīti vimutti. Vijjanto muccati, muccanto vijjatīti – vijjāvimutti…pe… arahattamaggo vijjatīti vijjā, sabbakilesehi muccatīti vimutti. Vijjanto muccati, muccanto vijjatīti – vijjāvimutti."
    ],
    "innerText": "Vijjāvimuttīti nekkhammaṃ vijjatīti vijjā, kāmacchandato muccatīti vimutti. Vijjanto muccati, muccanto vijjatīti – vijjāvimutti. Abyāpādo [abyāpādaṃ (syā.)] vijjatīti vijjā, byāpādato vimuccatīti vimutti. Vijjanto muccati, muccanto vijjatīti – vijjāvimutti…pe… arahattamaggo vijjatīti vijjā, sabbakilesehi muccatīti vimutti. Vijjanto muccati, muccanto vijjatīti – vijjāvimutti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adhisīlaṃ adhicittaṃ adhipaññā"
      },
      "ti nekkhammena kāmacchandaṃ, saṃvaraṭṭhena sīlavisuddhi, avikkhepaṭṭhena cittavisuddhi, dassanaṭṭhena diṭṭhivisuddhi. Yo tattha saṃvaraṭṭho, ayaṃ adhisīlasikkhā ",
      ". Yo tattha avikkhepaṭṭho, ayaṃ adhicittasikkhā. Yo tattha dassanaṭṭho, ayaṃ ",
      " adhipaññāsikkhā. Abyāpādena byāpādaṃ saṃvaraṭṭhena sīlavisuddhi…pe… arahattamaggena sabbakilese saṃvaraṭṭhena sīlavisuddhi, avikkhepaṭṭhena cittavisuddhi. Dassanaṭṭhena diṭṭhivisuddhi. Yo tattha saṃvaraṭṭho, ayaṃ adhisīlasikkhā. Yo tattha avikkhepaṭṭho, ayaṃ adhicittasikkhā. Yo tattha dassanaṭṭho, ayaṃ adhipaññāsikkhā."
    ],
    "innerText": "Adhisīlaṃ adhicittaṃ adhipaññāti nekkhammena kāmacchandaṃ, saṃvaraṭṭhena sīlavisuddhi, avikkhepaṭṭhena cittavisuddhi, dassanaṭṭhena diṭṭhivisuddhi. Yo tattha saṃvaraṭṭho, ayaṃ adhisīlasikkhā . Yo tattha avikkhepaṭṭho, ayaṃ adhicittasikkhā. Yo tattha dassanaṭṭho, ayaṃ adhipaññāsikkhā. Abyāpādena byāpādaṃ saṃvaraṭṭhena sīlavisuddhi…pe… arahattamaggena sabbakilese saṃvaraṭṭhena sīlavisuddhi, avikkhepaṭṭhena cittavisuddhi. Dassanaṭṭhena diṭṭhivisuddhi. Yo tattha saṃvaraṭṭho, ayaṃ adhisīlasikkhā. Yo tattha avikkhepaṭṭho, ayaṃ adhicittasikkhā. Yo tattha dassanaṭṭho, ayaṃ adhipaññāsikkhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Passaddhī"
      },
      "ti nekkhammena kāmacchandaṃ paṭippassambheti, abyāpādena byāpādaṃ paṭippassambheti…pe… arahattamaggena sabbakilese paṭippassambheti."
    ],
    "innerText": "Passaddhīti nekkhammena kāmacchandaṃ paṭippassambheti, abyāpādena byāpādaṃ paṭippassambheti…pe… arahattamaggena sabbakilese paṭippassambheti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñāṇa"
      },
      "nti kāmacchandassa pahīnattā nekkhammaṃ ñātaṭṭhena ñāṇaṃ ",
      "; byāpādassa pahīnattā abyāpādo ñātaṭṭhena ñāṇaṃ…pe… sabbakilesānaṃ pahīnattā arahattamaggo ñātaṭṭhena ñāṇaṃ."
    ],
    "innerText": "Ñāṇanti kāmacchandassa pahīnattā nekkhammaṃ ñātaṭṭhena ñāṇaṃ ; byāpādassa pahīnattā abyāpādo ñātaṭṭhena ñāṇaṃ…pe… sabbakilesānaṃ pahīnattā arahattamaggo ñātaṭṭhena ñāṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dassana"
      },
      "nti kāmacchandassa pahīnattā nekkhammaṃ diṭṭhattā dassanaṃ. Byāpādassa pahīnattā abyāpādo diṭṭhattā dassanaṃ…pe… sabbakilesānaṃ pahīnattā arahattamaggo diṭṭhattā dassanaṃ."
    ],
    "innerText": "Dassananti kāmacchandassa pahīnattā nekkhammaṃ diṭṭhattā dassanaṃ. Byāpādassa pahīnattā abyāpādo diṭṭhattā dassanaṃ…pe… sabbakilesānaṃ pahīnattā arahattamaggo diṭṭhattā dassanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Visuddhī"
      },
      "ti ",
      " kāmacchandaṃ pajahanto nekkhammena visujjhati. Byāpādaṃ pajahanto abyāpādena visujjhati…pe… sabbakilese pajahanto arahattamaggena visujjhati."
    ],
    "innerText": "Visuddhīti kāmacchandaṃ pajahanto nekkhammena visujjhati. Byāpādaṃ pajahanto abyāpādena visujjhati…pe… sabbakilese pajahanto arahattamaggena visujjhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nekkhamma"
      },
      "nti kāmānametaṃ nissaraṇaṃ, yadidaṃ nekkhammaṃ. Rūpānametaṃ nissaraṇaṃ, yadidaṃ āruppaṃ. Yaṃ kho pana kiñci bhūtaṃ saṅkhataṃ paṭiccasamuppannaṃ, nirodho tassa nekkhammaṃ. Byāpādassa abyāpādo nekkhammaṃ. Thinamiddhassa ālokasaññā nekkhammaṃ…pe… sabbakilesānaṃ arahattamaggo nekkhammaṃ."
    ],
    "innerText": "Nekkhammanti kāmānametaṃ nissaraṇaṃ, yadidaṃ nekkhammaṃ. Rūpānametaṃ nissaraṇaṃ, yadidaṃ āruppaṃ. Yaṃ kho pana kiñci bhūtaṃ saṅkhataṃ paṭiccasamuppannaṃ, nirodho tassa nekkhammaṃ. Byāpādassa abyāpādo nekkhammaṃ. Thinamiddhassa ālokasaññā nekkhammaṃ…pe… sabbakilesānaṃ arahattamaggo nekkhammaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nissaraṇa"
      },
      "nti kāmānametaṃ nissaraṇaṃ, yadidaṃ nekkhammaṃ. Rūpānametaṃ nissaraṇaṃ, yadidaṃ āruppaṃ. Yaṃ kho pana kiñci bhūtaṃ saṅkhataṃ paṭiccasamuppannaṃ, nirodho tassa nissaraṇaṃ. Kāmacchandassa nekkhammaṃ nissaraṇaṃ. Byāpādassa abyāpādo nissaraṇaṃ…pe… sabbakilesānaṃ arahattamaggo nissaraṇaṃ."
    ],
    "innerText": "Nissaraṇanti kāmānametaṃ nissaraṇaṃ, yadidaṃ nekkhammaṃ. Rūpānametaṃ nissaraṇaṃ, yadidaṃ āruppaṃ. Yaṃ kho pana kiñci bhūtaṃ saṅkhataṃ paṭiccasamuppannaṃ, nirodho tassa nissaraṇaṃ. Kāmacchandassa nekkhammaṃ nissaraṇaṃ. Byāpādassa abyāpādo nissaraṇaṃ…pe… sabbakilesānaṃ arahattamaggo nissaraṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paviveko"
      },
      "ti kāmacchandassa nekkhammaṃ paviveko ",
      " …pe… sabbakilesānaṃ arahattamaggo paviveko ",
      "."
    ],
    "innerText": "Pavivekoti kāmacchandassa nekkhammaṃ paviveko …pe… sabbakilesānaṃ arahattamaggo paviveko ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vossaggo"
      },
      "ti ",
      " nekkhammena kāmacchandaṃ vossajjatīti – vossaggo. Abyāpādena byāpādaṃ vossajjatīti – vossaggo…pe… arahattamaggena sabbakilese vossajjatīti – vossaggo."
    ],
    "innerText": "Vossaggoti nekkhammena kāmacchandaṃ vossajjatīti – vossaggo. Abyāpādena byāpādaṃ vossajjatīti – vossaggo…pe… arahattamaggena sabbakilese vossajjatīti – vossaggo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cariyā"
      },
      "ti kāmacchandaṃ pajahanto nekkhammena carati. Byāpādaṃ pajahanto abyāpādena carati…pe… sabbakilese pajahanto arahattamaggena carati."
    ],
    "innerText": "Cariyāti kāmacchandaṃ pajahanto nekkhammena carati. Byāpādaṃ pajahanto abyāpādena carati…pe… sabbakilese pajahanto arahattamaggena carati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jhānavimokkho"
      },
      "ti nekkhammaṃ jhāyatīti – jhānaṃ. Kāmacchandaṃ jhāpetīti – jhānaṃ. Jhāyanto muccatīti – jhānavimokkho. Jhāpento muccatīti – jhānavimokkho. Jhāyantīti dhammā. Jhāpentīti kilese. Jhāte ca jhāpe ca jānātīti – jhānajhāyī ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[jhānavimokkho (syā.) aṭṭhakathā oloketabbā]"
      },
      ". Abyāpādo jhāyatīti jhānaṃ. Byāpādaṃ jhāpetīti – jhānaṃ…pe… ālokasaññā jhāyatīti – jhānaṃ. Thinamiddhaṃ jhāpetīti – jhānaṃ…pe… arahattamaggo ",
      " jhāyatīti – jhānaṃ. Sabbakilese jhāpetīti – jhānaṃ. Jhāyanto muccatīti – jhānavimokkho. Jhāpento muccatīti – jhānavimokkho. Jhāyantīti – dhammā. Jhāpentīti – kilese. Jhāte ca jhāpe ca jānātīti – jhānajhāyī."
    ],
    "innerText": "Jhānavimokkhoti nekkhammaṃ jhāyatīti – jhānaṃ. Kāmacchandaṃ jhāpetīti – jhānaṃ. Jhāyanto muccatīti – jhānavimokkho. Jhāpento muccatīti – jhānavimokkho. Jhāyantīti dhammā. Jhāpentīti kilese. Jhāte ca jhāpe ca jānātīti – jhānajhāyī [jhānavimokkho (syā.) aṭṭhakathā oloketabbā]. Abyāpādo jhāyatīti jhānaṃ. Byāpādaṃ jhāpetīti – jhānaṃ…pe… ālokasaññā jhāyatīti – jhānaṃ. Thinamiddhaṃ jhāpetīti – jhānaṃ…pe… arahattamaggo jhāyatīti – jhānaṃ. Sabbakilese jhāpetīti – jhānaṃ. Jhāyanto muccatīti – jhānavimokkho. Jhāpento muccatīti – jhānavimokkho. Jhāyantīti – dhammā. Jhāpentīti – kilese. Jhāte ca jhāpe ca jānātīti – jhānajhāyī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "42"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhāvanā adhiṭṭhānaṃ jīvita"
      },
      "nti kāmacchandaṃ pajahanto nekkhammaṃ bhāvetīti – bhāvanāsampanno. Nekkhammavasena cittaṃ adhiṭṭhātīti – adhiṭṭhānasampanno. Svāyaṃ evaṃ bhāvanāsampanno adhiṭṭhānasampanno ",
      " samaṃ jīvati, no visamaṃ; sammā jīvati, no micchā; visuddhaṃ jīvati, no kiliṭṭhanti – ājīvasampanno. Svāyaṃ evaṃ bhāvanāsampanno adhiṭṭhānasampanno ājīvasampanno yaññadeva parisaṃ upasaṅkamati – yadi khattiyaparisaṃ yadi brāhmaṇaparisaṃ yadi gahapatiparisaṃ yadi samaṇaparisaṃ – visārado upasaṅkamati amaṅkubhūto. Taṃ kissa hetu? Tathā hi so bhāvanāsampanno adhiṭṭhānasampanno ājīvasampanno."
    ],
    "innerText": "42.Bhāvanā adhiṭṭhānaṃ jīvitanti kāmacchandaṃ pajahanto nekkhammaṃ bhāvetīti – bhāvanāsampanno. Nekkhammavasena cittaṃ adhiṭṭhātīti – adhiṭṭhānasampanno. Svāyaṃ evaṃ bhāvanāsampanno adhiṭṭhānasampanno samaṃ jīvati, no visamaṃ; sammā jīvati, no micchā; visuddhaṃ jīvati, no kiliṭṭhanti – ājīvasampanno. Svāyaṃ evaṃ bhāvanāsampanno adhiṭṭhānasampanno ājīvasampanno yaññadeva parisaṃ upasaṅkamati – yadi khattiyaparisaṃ yadi brāhmaṇaparisaṃ yadi gahapatiparisaṃ yadi samaṇaparisaṃ – visārado upasaṅkamati amaṅkubhūto. Taṃ kissa hetu? Tathā hi so bhāvanāsampanno adhiṭṭhānasampanno ājīvasampanno."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Byāpādaṃ pajahanto abyāpādaṃ bhāvetīti – bhāvanāsampanno…pe… thinamiddhaṃ pajahanto ālokasaññaṃ bhāvetīti – bhāvanāsampanno…pe… uddhaccaṃ pajahanto avikkhepaṃ bhāvetīti – bhāvanāsampanno…pe… vicikicchaṃ pajahanto dhammavavatthānaṃ bhāvetīti – bhāvanāsampanno…pe… avijjaṃ pajahanto vijjaṃ bhāvetīti ",
      " – bhāvanāsampanno…pe… aratiṃ pajahanto pāmojjaṃ bhāvetīti – bhāvanāsampanno…pe… nīvaraṇe pajahanto paṭhamaṃ jhānaṃ bhāvetīti – bhāvanāsampanno…pe… sabbakilese pajahanto arahattamaggaṃ bhāvetīti – bhāvanāsampanno. Arahattamaggavasena cittaṃ adhiṭṭhātīti – adhiṭṭhānasampanno. Svāyaṃ evaṃ bhāvanāsampanno ",
      " adhiṭṭhānasampanno samaṃ jīvati, no visamaṃ; sammā jīvati, no micchā; visuddhaṃ jīvati, no kiliṭṭhanti – ājīvasampanno. Svāyaṃ evaṃ bhāvanāsampanno adhiṭṭhānasampanno ājīvasampanno yaññadeva parisaṃ upasaṅkamati – yadi khattiyaparisaṃ yadi brāhmaṇaparisaṃ yadi gahapatiparisaṃ yadi samaṇaparisaṃ – visārado upasaṅkamati amaṅkubhūto. Taṃ kissa hetu? Tathā ",
      " hi so bhāvanāsampanno adhiṭṭhānasampanno ājīvasampannoti."
    ],
    "innerText": "Byāpādaṃ pajahanto abyāpādaṃ bhāvetīti – bhāvanāsampanno…pe… thinamiddhaṃ pajahanto ālokasaññaṃ bhāvetīti – bhāvanāsampanno…pe… uddhaccaṃ pajahanto avikkhepaṃ bhāvetīti – bhāvanāsampanno…pe… vicikicchaṃ pajahanto dhammavavatthānaṃ bhāvetīti – bhāvanāsampanno…pe… avijjaṃ pajahanto vijjaṃ bhāvetīti – bhāvanāsampanno…pe… aratiṃ pajahanto pāmojjaṃ bhāvetīti – bhāvanāsampanno…pe… nīvaraṇe pajahanto paṭhamaṃ jhānaṃ bhāvetīti – bhāvanāsampanno…pe… sabbakilese pajahanto arahattamaggaṃ bhāvetīti – bhāvanāsampanno. Arahattamaggavasena cittaṃ adhiṭṭhātīti – adhiṭṭhānasampanno. Svāyaṃ evaṃ bhāvanāsampanno adhiṭṭhānasampanno samaṃ jīvati, no visamaṃ; sammā jīvati, no micchā; visuddhaṃ jīvati, no kiliṭṭhanti – ājīvasampanno. Svāyaṃ evaṃ bhāvanāsampanno adhiṭṭhānasampanno ājīvasampanno yaññadeva parisaṃ upasaṅkamati – yadi khattiyaparisaṃ yadi brāhmaṇaparisaṃ yadi gahapatiparisaṃ yadi samaṇaparisaṃ – visārado upasaṅkamati amaṅkubhūto. Taṃ kissa hetu? Tathā hi so bhāvanāsampanno adhiṭṭhānasampanno ājīvasampannoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Mātikākathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paññāvaggo tatiyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Paññā ",
      " iddhi abhisamayo, viveko cariyapañcamo;"
    ],
    "innerText": "Paññā iddhi abhisamayo, viveko cariyapañcamo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Pāṭihāri samasīsi, satipaṭṭhānā vipassanā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tatiye paññāvaggamhi, mātikāya ca te dasāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Mahāvaggo yuganaddho, paññāvaggo ca nāmato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Tayova vaggā imamhi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[tivaggo yassa vikkhepo (syā. ka.)]"
      },
      ", paṭisambhidāpakaraṇe."
    ],
    "innerText": "Tayova vaggā imamhi [tivaggo yassa vikkhepo (syā. ka.)], paṭisambhidāpakaraṇe."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Anantanayamaggesu, gambhīro sāgarūpamo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Nabhañca tārakākiṇṇaṃ, thūlo jātassaro yathā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kathikānaṃ visālāya, yogīnaṃ ñāṇajotananti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṭisambhidāmaggapāḷi niṭṭhitā."
  }
]