[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "10. Mātikākathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Mātikākathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "40"
      },
      ". Idāni ",
      " mahāthero vipassanākathānantaraṃ sakale paṭisambhidāmagge niddiṭṭhe samathavipassanāmagganibbānadhamme ākāranānattavasena nānāpariyāyehi thometukāmo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nicchāto"
      },
      "tiādīni ekūnavīsati mātikāpadāni uddisitvā tesaṃ niddesavasena mātikākathaṃ nāma kathesi. Tassā ayaṃ apubbatthānuvaṇṇanā. Mātikāya tāva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nicchāto"
      },
      "ti amilāto. Sabbepi hi kilesā pīḷāyogato milātā, rāgopi tāva nirantarappavatto sarīraṃ dahati, kiṃ panaññe kilesā ",
      ". ‘‘Tayome, bhikkhave, aggī rāgaggi dosaggi mohaggī’’ti (itivu. 93; dī. ni. 3.305) pana kilesanāyakā tayo eva kilesā vuttā, taṃsampayuttāpi pana dahantiyeva. Evaṃ chātakilesābhāvato nicchāto. Ko so? Vimokkhasambandhena vimokkhoti daṭṭhabbo. Muccatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mokkho"
      },
      ". Vimuccatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vimokkho"
      },
      "ti ",
      " attho. Idamekaṃ mātikāpadaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vijjāvimuttī"
      },
      "ti vijjāyeva vimutti. Idamekaṃ mātikāpadaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jhānavimokkho"
      },
      "ti jhānameva vimokkho. Idamekaṃ mātikāpadaṃ. Sesāni ekekānevāti evaṃ ekūnavīsati mātikāpadāni."
    ],
    "innerText": "40. Idāni mahāthero vipassanākathānantaraṃ sakale paṭisambhidāmagge niddiṭṭhe samathavipassanāmagganibbānadhamme ākāranānattavasena nānāpariyāyehi thometukāmo nicchātotiādīni ekūnavīsati mātikāpadāni uddisitvā tesaṃ niddesavasena mātikākathaṃ nāma kathesi. Tassā ayaṃ apubbatthānuvaṇṇanā. Mātikāya tāva nicchātoti amilāto. Sabbepi hi kilesā pīḷāyogato milātā, rāgopi tāva nirantarappavatto sarīraṃ dahati, kiṃ panaññe kilesā . ‘‘Tayome, bhikkhave, aggī rāgaggi dosaggi mohaggī’’ti (itivu. 93; dī. ni. 3.305) pana kilesanāyakā tayo eva kilesā vuttā, taṃsampayuttāpi pana dahantiyeva. Evaṃ chātakilesābhāvato nicchāto. Ko so? Vimokkhasambandhena vimokkhoti daṭṭhabbo. Muccatīti mokkho. Vimuccatīti vimokkhoti attho. Idamekaṃ mātikāpadaṃ. Vijjāvimuttīti vijjāyeva vimutti. Idamekaṃ mātikāpadaṃ. Jhānavimokkhoti jhānameva vimokkho. Idamekaṃ mātikāpadaṃ. Sesāni ekekānevāti evaṃ ekūnavīsati mātikāpadāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "41"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nekkhammena kāmacchandato nicchāto"
      },
      "ti nekkhammena kāmacchandato apetattā kāmacchandato nikkileso yogī. Tena paṭiladdhaṃ nekkhammampi nicchāto nikkileso vimokkho. Evaṃ sesesupi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nekkhammena kāmacchandato muccatīti vimokkho"
      },
      "ti nekkhammena kāmacchandato yogī muccatīti taṃ nekkhammaṃ vimokkhoti attho. Evaṃ sesesupi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vijjatīti vijjā"
      },
      "ti sabhāvato vijjati atthi upalabbhatīti vijjā nāmāti attho. Atha vā sabhāvajānanatthaṃ paṭipannehi yogīhi sabhāvaṃ vedīyati jānīyatīti vijjā nāmāti attho. Atha vā visesalābhatthaṃ paṭipannehi yogīhi vedīyati paṭilābhīyatīti vijjā nāmāti attho. Atha vā attanā vinditabbaṃ bhūmiṃ vindati labhatīti vijjā nāmāti attho. Atha vā sabhāvadassanahetuttā sabhāvaṃ viditaṃ karotīti vijjā nāmāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vijjanto muccati, muccanto"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vijjatī"
      },
      "ti yathāvutto dhammo yathāvuttenatthena vijjamāno yathāvuttato muccati, yathāvuttato muccamāno yathāvuttenatthena vijjatīti vijjāvimutti nāmāti attho."
    ],
    "innerText": "41.Nekkhammena kāmacchandato nicchātoti nekkhammena kāmacchandato apetattā kāmacchandato nikkileso yogī. Tena paṭiladdhaṃ nekkhammampi nicchāto nikkileso vimokkho. Evaṃ sesesupi. Nekkhammena kāmacchandato muccatīti vimokkhoti nekkhammena kāmacchandato yogī muccatīti taṃ nekkhammaṃ vimokkhoti attho. Evaṃ sesesupi. Vijjatīti vijjāti sabhāvato vijjati atthi upalabbhatīti vijjā nāmāti attho. Atha vā sabhāvajānanatthaṃ paṭipannehi yogīhi sabhāvaṃ vedīyati jānīyatīti vijjā nāmāti attho. Atha vā visesalābhatthaṃ paṭipannehi yogīhi vedīyati paṭilābhīyatīti vijjā nāmāti attho. Atha vā attanā vinditabbaṃ bhūmiṃ vindati labhatīti vijjā nāmāti attho. Atha vā sabhāvadassanahetuttā sabhāvaṃ viditaṃ karotīti vijjā nāmāti attho. Vijjanto muccati, muccantovijjatīti yathāvutto dhammo yathāvuttenatthena vijjamāno yathāvuttato muccati, yathāvuttato muccamāno yathāvuttenatthena vijjatīti vijjāvimutti nāmāti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāmacchandaṃ saṃvaraṭṭhenā"
      },
      "ti kāmacchandanivāraṇaṭṭhena taṃ nekkhammaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sīlavisuddhi"
      },
      " nāmāti attho. Taṃyeva avikkhepahetuttā avikkhepaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cittavisuddhi"
      },
      ". Dassanahetuttā dassanaṭṭhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "diṭṭhivisuddhi"
      },
      ". Sesesupi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭippassambhetī"
      },
      "ti nekkhammādinā kāmacchandādikaṃ yogāvacaro paṭippassambhetīti nekkhammādiko dhammo passaddhi nāmāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pahīnattā"
      },
      "ti tena tena pahānena pahīnattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñātaṭṭhena ñāṇa"
      },
      "nti jhānapaccavekkhaṇāvasena vipassanāvasena maggapaccavekkhaṇāvasena ñātaṭṭhena nekkhammādikaṃ ñāṇaṃ nāmāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Diṭṭhattā dassana"
      },
      "nti etthāpi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Visujjhatī"
      },
      "ti yogī, nekkhammādikā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "visuddhi"
      },
      "."
    ],
    "innerText": "Kāmacchandaṃ saṃvaraṭṭhenāti kāmacchandanivāraṇaṭṭhena taṃ nekkhammaṃ sīlavisuddhi nāmāti attho. Taṃyeva avikkhepahetuttā avikkhepaṭṭhena cittavisuddhi. Dassanahetuttā dassanaṭṭhena diṭṭhivisuddhi. Sesesupi eseva nayo. Paṭippassambhetīti nekkhammādinā kāmacchandādikaṃ yogāvacaro paṭippassambhetīti nekkhammādiko dhammo passaddhi nāmāti attho. Pahīnattāti tena tena pahānena pahīnattā. Ñātaṭṭhena ñāṇanti jhānapaccavekkhaṇāvasena vipassanāvasena maggapaccavekkhaṇāvasena ñātaṭṭhena nekkhammādikaṃ ñāṇaṃ nāmāti attho. Diṭṭhattā dassananti etthāpi eseva nayo. Visujjhatīti yogī, nekkhammādikā visuddhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nekkhammaniddese ",
      " nekkhammaṃ alobhattā kāmarāgato nissaṭanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nissaraṇaṃ"
      },
      ". Tato nikkhantanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nekkhammaṃ"
      },
      ". ‘‘Rūpānametaṃ nissaraṇaṃ yadidaṃ nekkhamma’’nti vuccamāne āruppavisesassa adissanato ",
      " visesassa dassanatthaṃ aññattha vuttapāṭhakkameneva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yadidaṃ āruppa"
      },
      "nti vuttaṃ. Tañca āruppaṃ rūpato nikkhantattā nekkhammaṃ nāmāti adhikāravaseneva vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhūta"
      },
      "nti uppādasamāyogadīpanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅkhata"
      },
      "nti paccayabalavisesadassanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭiccasamuppanna"
      },
      "nti paccayasamāyogepi paccayānaṃ abyāpārabhāvadassanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nirodho tassa nekkhamma"
      },
      "nti nibbānaṃ tato saṅkhatato nikkhantattā tassa saṅkhatassa nekkhammaṃ nāma. Āruppassa ca nirodhassa ca gahaṇaṃ aññattha pāṭhe vuttakkameneva kataṃ. ‘‘Kāmacchandassa nekkhammaṃ nekkhamma’’nti vuccamāne punaruttaṃ hoti. Nekkhammavacaneneva ca tassa nekkhammasiddhīti taṃ avatvā sesanekkhammameva vuttaṃ. Taṃ ujukameva. Nissaraṇaniddesepi imināva nayena attho veditabbo. Nissaraṇīyā dhātuyo panettha ujukameva nekkhammanti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paviveko"
      },
      "ti pavivittabhāvo nekkhammādikoyeva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vosajjatī"
      },
      "ti yogī, nekkhammādayo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vosaggo"
      },
      ". Nekkhammaṃ pavattento yogī nekkhammena caratīti vuccati. Taṃ pana nekkhammaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cariyā"
      },
      ". Esa nayo sesesupi. Jhānavimokkhaniddese vattabbaṃ vimokkhakathāyaṃ vuttaṃ. Kevalaṃ tattha ‘‘jānātīti jhānavimokkho’’ti (paṭi. ma. 1.217) vuttaṃ, idha pana ‘‘jānātīti, jhāyatī’’ti puggalādhiṭṭhānāva desanā katāti ayaṃ viseso."
    ],
    "innerText": "Nekkhammaniddese nekkhammaṃ alobhattā kāmarāgato nissaṭanti nissaraṇaṃ. Tato nikkhantanti nekkhammaṃ. ‘‘Rūpānametaṃ nissaraṇaṃ yadidaṃ nekkhamma’’nti vuccamāne āruppavisesassa adissanato visesassa dassanatthaṃ aññattha vuttapāṭhakkameneva yadidaṃ āruppanti vuttaṃ. Tañca āruppaṃ rūpato nikkhantattā nekkhammaṃ nāmāti adhikāravaseneva vuttaṃ hoti. Bhūtanti uppādasamāyogadīpanaṃ. Saṅkhatanti paccayabalavisesadassanaṃ. Paṭiccasamuppannanti paccayasamāyogepi paccayānaṃ abyāpārabhāvadassanaṃ. Nirodho tassa nekkhammanti nibbānaṃ tato saṅkhatato nikkhantattā tassa saṅkhatassa nekkhammaṃ nāma. Āruppassa ca nirodhassa ca gahaṇaṃ aññattha pāṭhe vuttakkameneva kataṃ. ‘‘Kāmacchandassa nekkhammaṃ nekkhamma’’nti vuccamāne punaruttaṃ hoti. Nekkhammavacaneneva ca tassa nekkhammasiddhīti taṃ avatvā sesanekkhammameva vuttaṃ. Taṃ ujukameva. Nissaraṇaniddesepi imināva nayena attho veditabbo. Nissaraṇīyā dhātuyo panettha ujukameva nekkhammanti vuttaṃ. Pavivekoti pavivittabhāvo nekkhammādikoyeva. Vosajjatīti yogī, nekkhammādayo vosaggo. Nekkhammaṃ pavattento yogī nekkhammena caratīti vuccati. Taṃ pana nekkhammaṃ cariyā. Esa nayo sesesupi. Jhānavimokkhaniddese vattabbaṃ vimokkhakathāyaṃ vuttaṃ. Kevalaṃ tattha ‘‘jānātīti jhānavimokkho’’ti (paṭi. ma. 1.217) vuttaṃ, idha pana ‘‘jānātīti, jhāyatī’’ti puggalādhiṭṭhānāva desanā katāti ayaṃ viseso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "42"
      },
      ". Bhāvanādhiṭṭhānajīvitaniddese ca puggalādhiṭṭhānā desanā katā. Dhammato pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhāvanā"
      },
      " nāma nekkhammādayova. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adhiṭṭhānaṃ"
      },
      " nāma nekkhammādivasena patiṭṭhāpitacittameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jīvitaṃ"
      },
      " nāma nekkhammādivasena patiṭṭhāpitacittassa sammāājīvo nāma. Ko so sammāājīvo nāma ",
      "? Micchājīvā virati, dhammena samena paccayapariyesanavāyāmo ca. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samaṃ jīvatī"
      },
      "ti samaṃ jīvitaṃ jīvati, bhāvanapuṃsakavacanaṃ vā, samena jīvatīti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "No visama"
      },
      "nti ‘‘samaṃ jīvatī’’ti vuttasseva atthassa paṭisedhavasena avadhāraṇaṃ kataṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammā jīvatī"
      },
      "ti ākāranidassanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "No micchā"
      },
      "ti tasseva niyamanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Visuddhaṃ jīvatī"
      },
      "ti sabhāvavisuddhiyā visuddhaṃ jīvitaṃ jīvati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "No kiliṭṭha"
      },
      "nti tasseva niyamanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yaññadevā"
      },
      "tiādīhi yathāvuttānaṃ ",
      " tissannaṃ sampadānaṃ ānisaṃsaṃ dasseti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yaññadevā"
      },
      "ti yaṃ yaṃ eva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khattiyaparisa"
      },
      "nti khattiyānaṃ sannipātaṃ. So hi samantato sīdanti ettha akatabuddhinoti parisāti vuccati. Eseva nayo itarattaye. Khattiyādīnaṃyeva āgamanasampattiyā ñāṇasampattiyā ca samannāgatattā tāsaṃyeva catassannaṃ gahaṇaṃ ",
      ", na suddaparisāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Visārado"
      },
      "ti tīhi sampadāhi sampanno vigatasārajjo, nibbhayoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Amaṅkubhūto"
      },
      "ti asaṅkucito na nittejabhūto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃ kissa hetū"
      },
      "ti taṃ visāradattaṃ kena hetunā kena kāraṇena hotīti ceti attho. Idāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tathā hī"
      },
      "ti tassa kāraṇavacanaṃ. Yasmā evaṃ tisampadāsampanno, tasmā ‘‘visārado hotī’’ti visāradabhāvassa kāraṇaṃ dassetvā niṭṭhapesīti."
    ],
    "innerText": "42. Bhāvanādhiṭṭhānajīvitaniddese ca puggalādhiṭṭhānā desanā katā. Dhammato pana bhāvanā nāma nekkhammādayova. Adhiṭṭhānaṃ nāma nekkhammādivasena patiṭṭhāpitacittameva. Jīvitaṃ nāma nekkhammādivasena patiṭṭhāpitacittassa sammāājīvo nāma. Ko so sammāājīvo nāma ? Micchājīvā virati, dhammena samena paccayapariyesanavāyāmo ca. Tattha samaṃ jīvatīti samaṃ jīvitaṃ jīvati, bhāvanapuṃsakavacanaṃ vā, samena jīvatīti vuttaṃ hoti. No visamanti ‘‘samaṃ jīvatī’’ti vuttasseva atthassa paṭisedhavasena avadhāraṇaṃ kataṃ. Sammā jīvatīti ākāranidassanaṃ. No micchāti tasseva niyamanaṃ. Visuddhaṃ jīvatīti sabhāvavisuddhiyā visuddhaṃ jīvitaṃ jīvati. No kiliṭṭhanti tasseva niyamanaṃ. Yaññadevātiādīhi yathāvuttānaṃ tissannaṃ sampadānaṃ ānisaṃsaṃ dasseti. Tattha yaññadevāti yaṃ yaṃ eva. Khattiyaparisanti khattiyānaṃ sannipātaṃ. So hi samantato sīdanti ettha akatabuddhinoti parisāti vuccati. Eseva nayo itarattaye. Khattiyādīnaṃyeva āgamanasampattiyā ñāṇasampattiyā ca samannāgatattā tāsaṃyeva catassannaṃ gahaṇaṃ , na suddaparisāya. Visāradoti tīhi sampadāhi sampanno vigatasārajjo, nibbhayoti attho. Amaṅkubhūtoti asaṅkucito na nittejabhūto. Taṃ kissa hetūti taṃ visāradattaṃ kena hetunā kena kāraṇena hotīti ceti attho. Idāni tathā hīti tassa kāraṇavacanaṃ. Yasmā evaṃ tisampadāsampanno, tasmā ‘‘visārado hotī’’ti visāradabhāvassa kāraṇaṃ dassetvā niṭṭhapesīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Saddhammappakāsiniyā paṭisambhidāmagga-aṭṭhakathāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Mātikākathāvaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paññāvaggavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Niṭṭhitā cūḷavaggassa apubbatthānuvaṇṇanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ettāvatā ca tivaggasaṅgahitassa"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Samatiṃsakathāpaṭimaṇḍitasspaṭisambhidāmaggassa atthavaṇṇanā niṭṭhitā hotīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Nigamanakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Mahāvaggo ",
      " majjhimo ca, cūḷavaggo ca nāmato;"
    ],
    "innerText": "Mahāvaggo majjhimo ca, cūḷavaggo ca nāmato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tayo vaggā idha vuttā, pamāṇapaṭipāṭiyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Vagge vagge dasa dasa, kathā yā tā udīritā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Uddānagāthā sabbāsaṃ, imā tāsaṃ yathākkamaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Ñāṇaṃ diṭṭhi ānāpānaṃ, indriyaṃ vimokkhapañcamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Gati kammaṃ vipallāso, maggo maṇḍoti tā dasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Yuganaddhasaccabojjhaṅgā, mettā virāgapañcamā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Paṭisambhidā dhammacakkaṃ, lokuttarabalasuññatā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Paññā iddhi abhisamayo, viveko cariyapañcamo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pāṭihīraṃ samasīsa-sati vipassanamātikā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Yo so sugatasutānaṃ, adhipatibhūtena bhūtahitaratinā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Therena thiraguṇavatā, vutto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭisambhidāmaggo"
      },
      "."
    ],
    "innerText": "Therena thiraguṇavatā, vutto paṭisambhidāmaggo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Tassa",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tthavaṇṇanā"
      },
      " yā, pubbaṭṭhakathānayaṃ tathā yuttiṃ;"
    ],
    "innerText": "Tassatthavaṇṇanā yā, pubbaṭṭhakathānayaṃ tathā yuttiṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nissāya mayāraddhā, niṭṭhānamupāgatā esā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Yaṃ taṃ uttaramantī, mantiguṇayuto yuto ca saddhāya;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kārayi mahāvihāre, pariveṇamanekasādhuguṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Therenettha ",
      " nivasatā, samāpitāyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mahābhidhānena"
      },
      ";"
    ],
    "innerText": "Therenettha nivasatā, samāpitāyaṃ mahābhidhānena;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tatiye vasse cutito, moggallānassa bhūpatino."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Samayaṃ anulomentī, therānaṃ theravādadīpānaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Niṭṭhaṃ gatā yathāyaṃ, aṭṭhakathā lokahitajananī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Dhammaṃ anulomentā, attahitaṃ parahitañca sādhentā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Niṭṭhaṃ gacchantu tathā, manorathā sabbasattānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddhammapakāsiniyā,"
      },
      " aṭṭhakathāyettha gaṇitakusalehi;"
    ],
    "innerText": "Saddhammapakāsiniyā, aṭṭhakathāyettha gaṇitakusalehi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Gaṇitā tu bhāṇavārā, viññeyyā aṭṭhapaññāsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Ānuṭṭhubhena ",
      " assā, chandobandhena gaṇiyamānā tu;"
    ],
    "innerText": "Ānuṭṭhubhena assā, chandobandhena gaṇiyamānā tu;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Cuddasasahassasaṅkhā, gāthāyo pañca ca satāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sāsanaciraṭṭhitatthaṃ, lokahitatthañca sādarena mayā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Puññaṃ imaṃ racayatā, yaṃ pattamanappakaṃ vipulaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Puññena tena loko, saddhammarasāyanaṃ dasabalassa;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Upabhuñjitvā vimalaṃ, pappotu sukhaṃ sukhenevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Saddhammappakāsinī nāma"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṭisambhidāmaggappakaraṇassa aṭṭhakathā niṭṭhitā."
  }
]