[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "3. Niddesavāravaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "4"
      },
      ". Evaṃ ",
      " uddiṭṭhe hārādayo niddisituṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tattha saṅkhepato’’"
      },
      "tiādi āraddhaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tatthā"
      },
      "ti tasmiṃ uddesapāṭhe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅkhepato netti kittitā"
      },
      "ti samāsato nettippakaraṇaṃ kathitaṃ. Hāranayamūlapadānañhi sarūpadassanaṃ uddesapāṭhena katanti. Ettha ca hāranayānaṃ –"
    ],
    "innerText": "4. Evaṃ uddiṭṭhe hārādayo niddisituṃ ‘‘tattha saṅkhepato’’tiādi āraddhaṃ. Tattha tatthāti tasmiṃ uddesapāṭhe. Saṅkhepato netti kittitāti samāsato nettippakaraṇaṃ kathitaṃ. Hāranayamūlapadānañhi sarūpadassanaṃ uddesapāṭhena katanti. Ettha ca hāranayānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sāmaññato visesena, padattho lakkhaṇaṃ kamo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ettāvatā ca hetvādī, veditabbā hi viññunā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tesu avisesato visesato ca hāranayānaṃ attho dassito. Lakkhaṇādīsu pana avisesato sabbepi hārā nayā ca yathākkamaṃ byañjanatthamukhena navaṅgassa sāsanassa atthasaṃvaṇṇanalakkhaṇā. Visesato pana tassa tassa hārassa nayassa ca lakkhaṇaṃ niddese eva kathayissāma. Kamādīni ca yasmā nesaṃ lakkhaṇesu ñātesu viññeyyāni honti, tasmā tānipi niddesato parato pakāsayissāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Hārasaṅkhepo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      ". Yā pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "assādādīnavatā"
      },
      "tiādikā niddesagāthā, tāsu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "assādādīnavatā"
      },
      "ti assādo ādīnavatāti padavibhāgo. Ādīnavatāti ca ādīnavo eva. Keci ‘‘assādādīnavato’’ti paṭhanti, taṃ na sundaraṃ. Tattha assādīyatīti assādo, sukhaṃ somanassañca. Vuttañhetaṃ – ‘‘yaṃ, bhikkhave, pañcupādānakkhandhe paṭicca uppajjati sukhaṃ somanassaṃ, ayaṃ pañcasu upādānakkhandhesu ",
      " assādo’’ti (ma. ni. 1.166; saṃ. ni. 3.26). Yathā cetaṃ sukhaṃ somanassaṃ, evaṃ iṭṭhārammaṇampi. Vuttampi cetaṃ – ‘‘so tadassādeti taṃ nikāmetī’’ti ‘‘rūpaṃ assādeti abhinandati, taṃ ārabbha rāgo uppajjatī’’ti (paṭṭhā. 1.1.424), ‘‘saṃyojanīyesu, bhikkhave, dhammesu assādānupassino’’ti (saṃ. ni. 2.53) ca ",
      ". Assādeti etāyāti vā assādo, taṇhā. Taṇhāya hi kāraṇabhūtāya puggalo sukhampi sukhārammaṇampi assādeti. Yathā ca taṇhā, evaṃ vipallāsāpi. Vipallāsavasena hi sattā aniṭṭhampi ārammaṇaṃ iṭṭhākārena assādenti, evaṃ vedanāya sabbesaṃ tebhūmakasaṅkhārānaṃ taṇhāya vipallāsānañca assādavicāro veditabbo."
    ],
    "innerText": "1. Yā pana assādādīnavatātiādikā niddesagāthā, tāsu assādādīnavatāti assādo ādīnavatāti padavibhāgo. Ādīnavatāti ca ādīnavo eva. Keci ‘‘assādādīnavato’’ti paṭhanti, taṃ na sundaraṃ. Tattha assādīyatīti assādo, sukhaṃ somanassañca. Vuttañhetaṃ – ‘‘yaṃ, bhikkhave, pañcupādānakkhandhe paṭicca uppajjati sukhaṃ somanassaṃ, ayaṃ pañcasu upādānakkhandhesu assādo’’ti (ma. ni. 1.166; saṃ. ni. 3.26). Yathā cetaṃ sukhaṃ somanassaṃ, evaṃ iṭṭhārammaṇampi. Vuttampi cetaṃ – ‘‘so tadassādeti taṃ nikāmetī’’ti ‘‘rūpaṃ assādeti abhinandati, taṃ ārabbha rāgo uppajjatī’’ti (paṭṭhā. 1.1.424), ‘‘saṃyojanīyesu, bhikkhave, dhammesu assādānupassino’’ti (saṃ. ni. 2.53) ca . Assādeti etāyāti vā assādo, taṇhā. Taṇhāya hi kāraṇabhūtāya puggalo sukhampi sukhārammaṇampi assādeti. Yathā ca taṇhā, evaṃ vipallāsāpi. Vipallāsavasena hi sattā aniṭṭhampi ārammaṇaṃ iṭṭhākārena assādenti, evaṃ vedanāya sabbesaṃ tebhūmakasaṅkhārānaṃ taṇhāya vipallāsānañca assādavicāro veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ pana dukkhādukkhamasukhavedanānaṃ assādanīyatāti? Vipallāsato sukhapariyāyasabbhāvato ca. Tathā hi vuttaṃ – ‘‘sukhā kho, āvuso visākha, vedanā ṭhitisukhā vipariṇāmadukkhā. Dukkhā vedanā ṭhitidukkhā vipariṇāmasukhā, adukkhamasukhā vedanā ñāṇasukhā aññāṇadukkhā’’ti (ma. ni. 1.465). Tattha vedanāya aṭṭhasatapariyāyavasena, tebhūmakasaṅkhārānaṃ nikkhepakaṇḍarūpakaṇḍavasena, taṇhāya saṃkilesavatthuvibhaṅge ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nikkhepakaṇḍe"
      },
      " ca taṇhāniddesavasena, vipallāsānaṃ sukhasaññādivasena dvāsaṭṭhidiṭṭhigatavasena ca vibhāgo veditabbo."
    ],
    "innerText": "Kathaṃ pana dukkhādukkhamasukhavedanānaṃ assādanīyatāti? Vipallāsato sukhapariyāyasabbhāvato ca. Tathā hi vuttaṃ – ‘‘sukhā kho, āvuso visākha, vedanā ṭhitisukhā vipariṇāmadukkhā. Dukkhā vedanā ṭhitidukkhā vipariṇāmasukhā, adukkhamasukhā vedanā ñāṇasukhā aññāṇadukkhā’’ti (ma. ni. 1.465). Tattha vedanāya aṭṭhasatapariyāyavasena, tebhūmakasaṅkhārānaṃ nikkhepakaṇḍarūpakaṇḍavasena, taṇhāya saṃkilesavatthuvibhaṅge nikkhepakaṇḍe ca taṇhāniddesavasena, vipallāsānaṃ sukhasaññādivasena dvāsaṭṭhidiṭṭhigatavasena ca vibhāgo veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ādīnavo dukkhā vedanā tissopi vā dukkhatā. Atha vā sabbepi tebhūmakā saṅkhārā ādīnavo. Ādīnaṃ ativiya kapaṇaṃ vāti pavattatīti hi ādīnavo, kapaṇamanusso, evaṃsabhāvā ca tebhūmakā dhammā aniccatādiyogena. Yato tattha ādīnavānupassanā āraddhavipassakānaṃ yathābhūtanayoti vuccati. Tathā ca vuttaṃ – ‘‘yaṃ, bhikkhave, pañcupādānakkhandhā aniccā dukkhā vipariṇāmadhammā, ayaṃ pañcasu upādānakkhandhesu ādīnavo’’ti. Tasmā ādīnavo dukkhasaccaniddesabhūtānaṃ jātiyādīnaṃ aniccatādīnaṃ dvācattālīsāya ākārānañca vasena vibhajitvā niddisitabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nissarati etenāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nissaraṇaṃ,"
      },
      " ariyamaggo. Nissaratīti vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nissaraṇaṃ"
      },
      " nibbānaṃ. Ubhayampi sāmaññaniddesena ekasesena vā ‘‘nissaraṇa’’nti ",
      " vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pi"
      },
      "-saddo purimānaṃ pacchimānañca sampiṇḍanattho. Tattha ariyamaggapakkhe satipaṭṭhānādīnaṃ sattattiṃsabodhipakkhiyadhammānaṃ kāyānupassanādīnañca tadantogadhabhedānaṃ vasena nissaraṇaṃ vibhajitvā niddisitabbaṃ."
    ],
    "innerText": "Nissarati etenāti nissaraṇaṃ, ariyamaggo. Nissaratīti vā nissaraṇaṃ nibbānaṃ. Ubhayampi sāmaññaniddesena ekasesena vā ‘‘nissaraṇa’’nti vuttaṃ. Pi-saddo purimānaṃ pacchimānañca sampiṇḍanattho. Tattha ariyamaggapakkhe satipaṭṭhānādīnaṃ sattattiṃsabodhipakkhiyadhammānaṃ kāyānupassanādīnañca tadantogadhabhedānaṃ vasena nissaraṇaṃ vibhajitvā niddisitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nibbānapakkhe pana kiñcāpi asaṅkhatāya dhātuyā nippariyāyena vibhāgo natthi. Pariyāyena pana sopādisesanirupādisesabhedena. Yato vā taṃ nissaṭaṃ, tesaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭisambhidāmagge"
      },
      " (paṭi. ma. 1.3) dassitappabhedānaṃ cakkhādīnaṃ channaṃ dvārānaṃ rūpādīnaṃ channaṃ ārammaṇānaṃ taṃtaṃdvārappavattānaṃ ",
      " channaṃ channaṃ viññāṇaphassavedanāsaññācetanātaṇhāvitakkavicārānaṃ pathavīdhātuādīnaṃ channaṃ dhātūnaṃ dasannaṃ kasiṇāyatanānaṃ asubhānaṃ kesādīnaṃ dvattiṃsāya ākārānaṃ pañcannaṃ khandhānaṃ dvādasannaṃ āyatanānaṃ aṭṭhārasannaṃ dhātūnaṃ lokiyānaṃ indriyānaṃ kāmadhātuādīnaṃ tissannaṃ dhātūnaṃ kāmabhavādīnaṃ tiṇṇaṃ tiṇṇaṃ bhavānaṃ catunnaṃ jhānānaṃ appamaññānaṃ āruppānaṃ dvādasannaṃ paṭiccasamuppādaṅgānañcāti evamādīnaṃ saṅkhatadhammānaṃ nissaraṇabhāvena ca vibhajitvā niddisitabbaṃ."
    ],
    "innerText": "Nibbānapakkhe pana kiñcāpi asaṅkhatāya dhātuyā nippariyāyena vibhāgo natthi. Pariyāyena pana sopādisesanirupādisesabhedena. Yato vā taṃ nissaṭaṃ, tesaṃ paṭisambhidāmagge (paṭi. ma. 1.3) dassitappabhedānaṃ cakkhādīnaṃ channaṃ dvārānaṃ rūpādīnaṃ channaṃ ārammaṇānaṃ taṃtaṃdvārappavattānaṃ channaṃ channaṃ viññāṇaphassavedanāsaññācetanātaṇhāvitakkavicārānaṃ pathavīdhātuādīnaṃ channaṃ dhātūnaṃ dasannaṃ kasiṇāyatanānaṃ asubhānaṃ kesādīnaṃ dvattiṃsāya ākārānaṃ pañcannaṃ khandhānaṃ dvādasannaṃ āyatanānaṃ aṭṭhārasannaṃ dhātūnaṃ lokiyānaṃ indriyānaṃ kāmadhātuādīnaṃ tissannaṃ dhātūnaṃ kāmabhavādīnaṃ tiṇṇaṃ tiṇṇaṃ bhavānaṃ catunnaṃ jhānānaṃ appamaññānaṃ āruppānaṃ dvādasannaṃ paṭiccasamuppādaṅgānañcāti evamādīnaṃ saṅkhatadhammānaṃ nissaraṇabhāvena ca vibhajitvā niddisitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Phala"
      },
      "nti desanāphalaṃ. Kiṃ pana tanti? Yaṃ desanāya nipphādīyati. Nanu ca nibbānādhigamo bhagavato desanāya nipphādīyati. Nibbānañca ‘‘nissaraṇa’’nti iminā vuttamevāti? Saccametaṃ, tañca kho paramparāya. Idha pana paccakkhato desanāphalaṃ adhippetaṃ. Taṃ pana sutamayañāṇaṃ. Atthadhammavedādiariyamaggassa pubbabhāgappaṭipattibhūtā chabbisuddhiyo. Yañca tasmiṃ khaṇe maggaṃ anabhisambhuṇantassa kālantare tadadhigamakāraṇabhūtaṃ sampattibhavahetu ca siyā. Tathā hi vakkhati – ‘‘attānudiṭṭhiṃ ūhacca, evaṃ maccutaro siyāti (su. ni. 1125; kathā. 226; cūḷani. mogharājamāṇavapucchā 144, mogharājamāṇavapucchāniddesa 88; netti. 5; peṭako. 22) idaṃ phala’’nti, ‘‘dhammo have rakkhati dhammacārinti idaṃ phala’’nti (jā. 1.10.102-103; 1.15.385) ca. Etena nayena devesu ca mānusesu ca āyuvaṇṇabalasukhayasaparivāraādhipateyyasampattiyo upadhisampattiyo cakkavattisirī devarajjasirī cattāri sampatticakkāni sīlasampadā samādhisampadā tisso vijjā cha abhiññā catasso paṭisambhidā sāvakabodhi paccekabodhi sammāsambodhīti sabbāpi sampattiyo puññasambhārahetukā bhagavato desanāya sādhetabbatāya phalanti veditabbā."
    ],
    "innerText": "Phalanti desanāphalaṃ. Kiṃ pana tanti? Yaṃ desanāya nipphādīyati. Nanu ca nibbānādhigamo bhagavato desanāya nipphādīyati. Nibbānañca ‘‘nissaraṇa’’nti iminā vuttamevāti? Saccametaṃ, tañca kho paramparāya. Idha pana paccakkhato desanāphalaṃ adhippetaṃ. Taṃ pana sutamayañāṇaṃ. Atthadhammavedādiariyamaggassa pubbabhāgappaṭipattibhūtā chabbisuddhiyo. Yañca tasmiṃ khaṇe maggaṃ anabhisambhuṇantassa kālantare tadadhigamakāraṇabhūtaṃ sampattibhavahetu ca siyā. Tathā hi vakkhati – ‘‘attānudiṭṭhiṃ ūhacca, evaṃ maccutaro siyāti (su. ni. 1125; kathā. 226; cūḷani. mogharājamāṇavapucchā 144, mogharājamāṇavapucchāniddesa 88; netti. 5; peṭako. 22) idaṃ phala’’nti, ‘‘dhammo have rakkhati dhammacārinti idaṃ phala’’nti (jā. 1.10.102-103; 1.15.385) ca. Etena nayena devesu ca mānusesu ca āyuvaṇṇabalasukhayasaparivāraādhipateyyasampattiyo upadhisampattiyo cakkavattisirī devarajjasirī cattāri sampatticakkāni sīlasampadā samādhisampadā tisso vijjā cha abhiññā catasso paṭisambhidā sāvakabodhi paccekabodhi sammāsambodhīti sabbāpi sampattiyo puññasambhārahetukā bhagavato desanāya sādhetabbatāya phalanti veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upāyo"
      },
      "ti ",
      " ariyamaggapadaṭṭhānabhūtā pubbabhāgappaṭipadā. Sā hi purimā purimā pacchimāya pacchimāya adhigamūpāyabhāvato paramparāya magganibbānādhigamassa ca hetubhāvato upāyo. Yā ca pubbe vuttaphalādhigamassa upāyapaṭipatti. Keci pana ‘‘saha vipassanāya maggo upāyo’’ti vadanti, tesaṃ matena nissaraṇanti nibbānameva vuttaṃ siyā. Phalaṃ viya upāyopi pubbabhāgoti vuttaṃ siyā, yaṃ pana vakkhati ‘‘sabbe dhammā…pe… visuddhiyāti (dha. pa. 279; theragā. 678) ayaṃ upāyo’’ti. Etthāpi pubbabhāgappaṭipadā eva udāhaṭāti sakkā viññātuṃ. Yasmā pana ‘‘te pahāya tare oghanti idaṃ nissaraṇa’’nti ariyamaggassa nissaraṇabhāvaṃ vakkhati. Ariyamaggo hi oghataraṇanti."
    ],
    "innerText": "Upāyoti ariyamaggapadaṭṭhānabhūtā pubbabhāgappaṭipadā. Sā hi purimā purimā pacchimāya pacchimāya adhigamūpāyabhāvato paramparāya magganibbānādhigamassa ca hetubhāvato upāyo. Yā ca pubbe vuttaphalādhigamassa upāyapaṭipatti. Keci pana ‘‘saha vipassanāya maggo upāyo’’ti vadanti, tesaṃ matena nissaraṇanti nibbānameva vuttaṃ siyā. Phalaṃ viya upāyopi pubbabhāgoti vuttaṃ siyā, yaṃ pana vakkhati ‘‘sabbe dhammā…pe… visuddhiyāti (dha. pa. 279; theragā. 678) ayaṃ upāyo’’ti. Etthāpi pubbabhāgappaṭipadā eva udāhaṭāti sakkā viññātuṃ. Yasmā pana ‘‘te pahāya tare oghanti idaṃ nissaraṇa’’nti ariyamaggassa nissaraṇabhāvaṃ vakkhati. Ariyamaggo hi oghataraṇanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āṇattī"
      },
      "ti ",
      " āṇārahassa bhagavato veneyyajanassa hitasiddhiyā ‘‘evaṃ paṭipajjāhī’’ti vidhānaṃ. Tathā hi vakkhati ‘‘suññato lokaṃ avekkhassu, mogharājāti (su. ni. 1125; kathā. 226; netti. 5; peṭako. 22; cūḷani. mogharājamāṇavapucchā 144, mogharājamāṇavapucchāniddesa 88) āṇattī’’ti."
    ],
    "innerText": "Āṇattīti āṇārahassa bhagavato veneyyajanassa hitasiddhiyā ‘‘evaṃ paṭipajjāhī’’ti vidhānaṃ. Tathā hi vakkhati ‘‘suññato lokaṃ avekkhassu, mogharājāti (su. ni. 1125; kathā. 226; netti. 5; peṭako. 22; cūḷani. mogharājamāṇavapucchā 144, mogharājamāṇavapucchāniddesa 88) āṇattī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yogīna"
      },
      "nti catusaccakammaṭṭhānabhāvanāya yuttappayuttānaṃ veneyyānaṃ, atthāyāti vacanaseso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Desanāhāro"
      },
      "ti etesaṃ yathāvuttānaṃ assādādīnaṃ vibhajanalakkhaṇo saṃvaṇṇanāviseso desanāhāro nāmāti attho. Etthāha – kiṃ panetesaṃ assādādīnaṃ anavasesānaṃ vacanaṃ desanāhāro, udāhu ekaccānanti? Niravasesānaṃyeva. Yasmiñhi sutte assādādīnavanissaraṇāni sarūpato āgatāni, tattha vattabbameva natthi. Yattha pana ekadesena āgatāni, na vā sarūpena. Tattha anāgataṃ atthavasena niddhāretvā hāro yojetabbo. Ayañca attho desanāhāravibhaṅge āgamissatīti idha na papañcito."
    ],
    "innerText": "Yogīnanti catusaccakammaṭṭhānabhāvanāya yuttappayuttānaṃ veneyyānaṃ, atthāyāti vacanaseso. Desanāhāroti etesaṃ yathāvuttānaṃ assādādīnaṃ vibhajanalakkhaṇo saṃvaṇṇanāviseso desanāhāro nāmāti attho. Etthāha – kiṃ panetesaṃ assādādīnaṃ anavasesānaṃ vacanaṃ desanāhāro, udāhu ekaccānanti? Niravasesānaṃyeva. Yasmiñhi sutte assādādīnavanissaraṇāni sarūpato āgatāni, tattha vattabbameva natthi. Yattha pana ekadesena āgatāni, na vā sarūpena. Tattha anāgataṃ atthavasena niddhāretvā hāro yojetabbo. Ayañca attho desanāhāravibhaṅge āgamissatīti idha na papañcito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "2"
      },
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yaṃ pucchita"
      },
      "nti yā pucchā, viciyamānāti vacanaseso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjitaṃ anugītī"
      },
      "ti etthāpi eseva nayo. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vissajjita"
      },
      "nti vissajjanā, sā ekaṃsabyākaraṇādivasena catubbidhaṃ byākaraṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ca"
      },
      "-saddo sampiṇḍanattho, tena gāthāyaṃ avuttaṃ padādiṃ saṅgaṇhāti. Tā pana pucchāvissajjanā kassāti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘suttassā’’"
      },
      "ti. Etena sutte āgataṃ pucchāvissajjanaṃ vicetabbanti dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yā ca anugīti"
      },
      "ti vuttasseva atthassa yā anu pacchā gīti anugīti, saṅgahagāthā, pucchāya vā anurūpā gīti. Etena pubbāparaṃ ",
      " gahitaṃ. Byākaraṇassa hi pucchānurūpatā idha pubbāparaṃ adhippetaṃ. Yā ‘‘pucchānusandhī’’ti vuccati. Purimaṃ ‘‘suttassā’’ti padaṃ pubbāpekkhanti puna ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘suttassā’’"
      },
      "ti vuttaṃ. Tena suttassa nissayabhūte assādādike pariggaṇhāti. Ettāvatā vicayahārassa visayo niravasesena dassito hoti. Tathā ca vakkhati vicayahāravibhaṅge ‘‘padaṃ vicinati…pe… anugītiṃ vicinatī’’ti."
    ],
    "innerText": "2. Yaṃ pucchitanti yā pucchā, viciyamānāti vacanaseso. Vissajjitaṃ anugītīti etthāpi eseva nayo. Tattha vissajjitanti vissajjanā, sā ekaṃsabyākaraṇādivasena catubbidhaṃ byākaraṇaṃ. Ca-saddo sampiṇḍanattho, tena gāthāyaṃ avuttaṃ padādiṃ saṅgaṇhāti. Tā pana pucchāvissajjanā kassāti āha ‘‘suttassā’’ti. Etena sutte āgataṃ pucchāvissajjanaṃ vicetabbanti dasseti. Yā ca anugītiti vuttasseva atthassa yā anu pacchā gīti anugīti, saṅgahagāthā, pucchāya vā anurūpā gīti. Etena pubbāparaṃ gahitaṃ. Byākaraṇassa hi pucchānurūpatā idha pubbāparaṃ adhippetaṃ. Yā ‘‘pucchānusandhī’’ti vuccati. Purimaṃ ‘‘suttassā’’ti padaṃ pubbāpekkhanti puna ‘‘suttassā’’ti vuttaṃ. Tena suttassa nissayabhūte assādādike pariggaṇhāti. Ettāvatā vicayahārassa visayo niravasesena dassito hoti. Tathā ca vakkhati vicayahāravibhaṅge ‘‘padaṃ vicinati…pe… anugītiṃ vicinatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha sutte sabbesaṃ padānaṃ anupubbena atthaso byañjanaso ca vicayo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "padavicayo"
      },
      ". ‘‘Ayaṃ pucchā adiṭṭhajotanā diṭṭhasaṃsandanā vimaticchedanā anumatipucchā kathetukamyatāpucchā sattādhiṭṭhānā dhammādhiṭṭhānā ekādhiṭṭhānā anekādhiṭṭhānā sammutivisayā paramatthavisayā atītavisayā anāgatavisayā paccuppannavisayā’’tiādinā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pucchāvicayo"
      },
      " veditabbo. ‘‘Idaṃ vissajjanaṃ ",
      " ekaṃsabyākaraṇaṃ vibhajjabyākaraṇaṃ paṭipucchābyākaraṇaṃ ṭhapanaṃ sāvasesaṃ niravasesaṃ sauttaraṃ anuttaraṃ lokiyaṃ lokuttara’’ntiādinā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vissajjanavicayo"
      },
      "."
    ],
    "innerText": "Tattha sutte sabbesaṃ padānaṃ anupubbena atthaso byañjanaso ca vicayo padavicayo. ‘‘Ayaṃ pucchā adiṭṭhajotanā diṭṭhasaṃsandanā vimaticchedanā anumatipucchā kathetukamyatāpucchā sattādhiṭṭhānā dhammādhiṭṭhānā ekādhiṭṭhānā anekādhiṭṭhānā sammutivisayā paramatthavisayā atītavisayā anāgatavisayā paccuppannavisayā’’tiādinā pucchāvicayo veditabbo. ‘‘Idaṃ vissajjanaṃ ekaṃsabyākaraṇaṃ vibhajjabyākaraṇaṃ paṭipucchābyākaraṇaṃ ṭhapanaṃ sāvasesaṃ niravasesaṃ sauttaraṃ anuttaraṃ lokiyaṃ lokuttara’’ntiādinā vissajjanavicayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ayaṃ pucchā iminā sameti, etena na sametī’’ti pucchitatthaṃ ānetvā vicayo pubbenāparaṃ saṃsanditvā ca vicayo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pubbāparavicayo"
      },
      ". ‘‘Ayaṃ anugīti vuttatthasaṅgahā avuttatthasaṅgahā tadubhayatthasaṅgahā kusalatthasaṅgahā akusalatthasaṅgahā’’tiādinā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anugītivicayo"
      },
      ". Assādādīsu sukhavedanāya ‘‘iṭṭhārammaṇānubhavanalakkhaṇā’’tiādinā, taṇhāya ‘‘ārammaṇaggahaṇalakkhaṇā’’tiādinā, vipallāsānaṃ ‘‘viparītaggahaṇalakkhaṇā’’tiādinā, avasiṭṭhānaṃ tebhūmakadhammānaṃ ‘‘yathāsakalakkhaṇā’’tiādinā sabbesañca dvāvīsatiyā tikesu dvācattālīsādhike ca dukasate labbhamānapadavasena taṃtaṃassādatthavisesaniddhāraṇaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "assādavicayo"
      },
      "."
    ],
    "innerText": "‘‘Ayaṃ pucchā iminā sameti, etena na sametī’’ti pucchitatthaṃ ānetvā vicayo pubbenāparaṃ saṃsanditvā ca vicayo pubbāparavicayo. ‘‘Ayaṃ anugīti vuttatthasaṅgahā avuttatthasaṅgahā tadubhayatthasaṅgahā kusalatthasaṅgahā akusalatthasaṅgahā’’tiādinā anugītivicayo. Assādādīsu sukhavedanāya ‘‘iṭṭhārammaṇānubhavanalakkhaṇā’’tiādinā, taṇhāya ‘‘ārammaṇaggahaṇalakkhaṇā’’tiādinā, vipallāsānaṃ ‘‘viparītaggahaṇalakkhaṇā’’tiādinā, avasiṭṭhānaṃ tebhūmakadhammānaṃ ‘‘yathāsakalakkhaṇā’’tiādinā sabbesañca dvāvīsatiyā tikesu dvācattālīsādhike ca dukasate labbhamānapadavasena taṃtaṃassādatthavisesaniddhāraṇaṃ assādavicayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dukkhavedanāya ‘‘aniṭṭhānubhavanalakkhaṇā’’tiādinā, dukkhasaccānaṃ ‘‘paṭisandhilakkhaṇā’’tiādinā, aniccatādīnaṃ ādiantavantatāya aniccantikatāya ca ‘‘aniccā’’tiādinā sabbesañca lokiyadhammānaṃ saṃkilesabhāgiyahānabhāgiyatādivasena ādīnavavuttiyā okāraniddhāraṇena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ādīnavavicayo"
      },
      ". Nissaraṇapade ariyamaggassa āgamanato ",
      " kāyānupassanādipubbabhāgappaṭipadāvibhāgavisesaniddhāraṇavasena nibbānassa yathāvuttapariyāyavibhāgavisesaniddhāraṇavasenāti evaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nissaraṇavicayo. Phalā"
      },
      "dīnaṃ taṃtaṃsuttadesanāya sādhetabbaphalassa tadupāyassa tattha tattha suttavidhivacanassa ca vibhāganiddhāraṇavasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vicayo"
      },
      " veditabbo. Evaṃ padapucchāvissajjanapubbāparānugītīnaṃ assādādīnañca visesaniddhāraṇavaseneva vicayalakkhaṇo ‘‘vicayo hāro’’ti veditabbo."
    ],
    "innerText": "Dukkhavedanāya ‘‘aniṭṭhānubhavanalakkhaṇā’’tiādinā, dukkhasaccānaṃ ‘‘paṭisandhilakkhaṇā’’tiādinā, aniccatādīnaṃ ādiantavantatāya aniccantikatāya ca ‘‘aniccā’’tiādinā sabbesañca lokiyadhammānaṃ saṃkilesabhāgiyahānabhāgiyatādivasena ādīnavavuttiyā okāraniddhāraṇena ādīnavavicayo. Nissaraṇapade ariyamaggassa āgamanato kāyānupassanādipubbabhāgappaṭipadāvibhāgavisesaniddhāraṇavasena nibbānassa yathāvuttapariyāyavibhāgavisesaniddhāraṇavasenāti evaṃ nissaraṇavicayo. Phalādīnaṃ taṃtaṃsuttadesanāya sādhetabbaphalassa tadupāyassa tattha tattha suttavidhivacanassa ca vibhāganiddhāraṇavasena vicayo veditabbo. Evaṃ padapucchāvissajjanapubbāparānugītīnaṃ assādādīnañca visesaniddhāraṇavaseneva vicayalakkhaṇo ‘‘vicayo hāro’’ti veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "3"
      },
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbesa"
      },
      "nti soḷasannaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhūmī"
      },
      "ti byañjanaṃ sandhāyāha. Byañjanañhi mūlapadāni viya nayānaṃ hārānaṃ bhūmi pavattiṭṭhānaṃ, tesaṃ byañjanavicārabhāvato. Vuttañhi – ‘‘hārā byañjanavicayo’’ti, peṭakepi hi vuttaṃ – ‘‘yattha ca sabbe hārā, sampatamānā nayanti suttatthaṃ. Byañjanavidhiputhuttā’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gocaro"
      },
      "ti suttattho. Suttassa hi padatthuddhāraṇamukhena hārayojanā. Tesaṃ byañjanatthānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yuttāyuttaparikkhā"
      },
      "ti yuttassa ca ayuttassa ca upaparikkhā. ‘‘Yuttāyuttiparikkhā’’tipi pāṭho, yuttiayuttīnaṃ vicāraṇāti attho. Kathaṃ pana tesaṃ yuttāyuttajānanā? Catūhi mahāpadesehi avirujjhanena. Tattha byañjanassa tāva sabhāvaniruttibhāvo adhippetatthavācakabhāvo ca yuttabhāvo. Atthassa pana suttavinayadhammatāhi avilomanaṃ ",
      ". Ayamettha saṅkhepo. Vitthāro pana parato āvi bhavissati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hāro yuttīti niddiṭṭho"
      },
      "ti evaṃ sutte byañjanatthānaṃ yuttāyuttabhāvavibhāvanalakkhaṇo yuttihāroti veditabbo."
    ],
    "innerText": "3. Sabbesanti soḷasannaṃ. Bhūmīti byañjanaṃ sandhāyāha. Byañjanañhi mūlapadāni viya nayānaṃ hārānaṃ bhūmi pavattiṭṭhānaṃ, tesaṃ byañjanavicārabhāvato. Vuttañhi – ‘‘hārā byañjanavicayo’’ti, peṭakepi hi vuttaṃ – ‘‘yattha ca sabbe hārā, sampatamānā nayanti suttatthaṃ. Byañjanavidhiputhuttā’’ti. Gocaroti suttattho. Suttassa hi padatthuddhāraṇamukhena hārayojanā. Tesaṃ byañjanatthānaṃ. Yuttāyuttaparikkhāti yuttassa ca ayuttassa ca upaparikkhā. ‘‘Yuttāyuttiparikkhā’’tipi pāṭho, yuttiayuttīnaṃ vicāraṇāti attho. Kathaṃ pana tesaṃ yuttāyuttajānanā? Catūhi mahāpadesehi avirujjhanena. Tattha byañjanassa tāva sabhāvaniruttibhāvo adhippetatthavācakabhāvo ca yuttabhāvo. Atthassa pana suttavinayadhammatāhi avilomanaṃ . Ayamettha saṅkhepo. Vitthāro pana parato āvi bhavissati. Hāro yuttīti niddiṭṭhoti evaṃ sutte byañjanatthānaṃ yuttāyuttabhāvavibhāvanalakkhaṇo yuttihāroti veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "4"
      },
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhamma"
      },
      "nti yaṃ kiñci suttāgataṃ kusalādidhammamāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tassa dhammassā"
      },
      "ti tassa yathāvuttassa kusalādidhammassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yaṃ padaṭṭhāna"
      },
      "nti yaṃ kāraṇaṃ, yonisomanasikārādi sutte āgataṃ vā anāgataṃ vā sambhavato niddhāretvā kathetabbanti adhippāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Itī"
      },
      "ti evaṃ, vuttanayenāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yāva sabbadhammā"
      },
      "ti yattakā tasmiṃ sutte āgatā dhammā, tesaṃ sabbesampi yathānurūpaṃ padaṭṭhānaṃ niddhāretvā kathetabbanti adhippāyo. Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yāva sabbadhammā"
      },
      "ti suttāgatassa dhammassa yaṃ padaṭṭhānaṃ, tassapi yaṃ padaṭṭhānanti sambhavato yāva sabbadhammā padaṭṭhānavicāraṇā kātabbāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Eso hāro padaṭṭhāno"
      },
      "ti evaṃ sutte āgatadhammānaṃ padaṭṭhānabhūtā dhammā tesañca padaṭṭhānabhūtāti sambhavato padaṭṭhānabhūtadhammaniddhāraṇalakkhaṇo padaṭṭhāno nāma hāroti attho."
    ],
    "innerText": "4. Dhammanti yaṃ kiñci suttāgataṃ kusalādidhammamāha. Tassa dhammassāti tassa yathāvuttassa kusalādidhammassa. Yaṃ padaṭṭhānanti yaṃ kāraṇaṃ, yonisomanasikārādi sutte āgataṃ vā anāgataṃ vā sambhavato niddhāretvā kathetabbanti adhippāyo. Itīti evaṃ, vuttanayenāti attho. Yāva sabbadhammāti yattakā tasmiṃ sutte āgatā dhammā, tesaṃ sabbesampi yathānurūpaṃ padaṭṭhānaṃ niddhāretvā kathetabbanti adhippāyo. Atha vā yāva sabbadhammāti suttāgatassa dhammassa yaṃ padaṭṭhānaṃ, tassapi yaṃ padaṭṭhānanti sambhavato yāva sabbadhammā padaṭṭhānavicāraṇā kātabbāti attho. Eso hāro padaṭṭhānoti evaṃ sutte āgatadhammānaṃ padaṭṭhānabhūtā dhammā tesañca padaṭṭhānabhūtāti sambhavato padaṭṭhānabhūtadhammaniddhāraṇalakkhaṇo padaṭṭhāno nāma hāroti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "5"
      },
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vuttamhi"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekadhamme"
      },
      "ti kusalādīsu khandhādīsu vā yasmiṃ kismiñci ekadhamme, sutte sarūpato niddhāraṇavasena vā kathite. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ye dhammā ekalakkhaṇā kecī"
      },
      "ti ye keci dhammā kusalādibhāvena rūpakkhandhādibhāvena vā tena dhammena samānalakkhaṇā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vuttā bhavanti sabbe"
      },
      "ti te sabbepi kusalādisabhāvā, khandhādisabhāvā vā dhammā sutte avuttāpi tāya samānalakkhaṇatāya vuttā bhavanti ānetvā saṃvaṇṇanāvasenāti adhippāyo. Ettha ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekalakkhaṇā"
      },
      "ti samānalakkhaṇā vuttā. Tena sahacāritā samānakiccatā samānahetutā samānaphalatā samānārammaṇatāti evamādīhi avuttānampi vuttānaṃ viya niddhāraṇaṃ veditabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "So hāro lakkhaṇo nāmā"
      },
      "ti evaṃ sutte anāgatepi dhamme vuttappakārena āgate viya niddhāretvā yā saṃvaṇṇanā, so lakkhaṇo nāma hāroti attho."
    ],
    "innerText": "5. Vuttamhiekadhammeti kusalādīsu khandhādīsu vā yasmiṃ kismiñci ekadhamme, sutte sarūpato niddhāraṇavasena vā kathite. Ye dhammā ekalakkhaṇā kecīti ye keci dhammā kusalādibhāvena rūpakkhandhādibhāvena vā tena dhammena samānalakkhaṇā. Vuttā bhavanti sabbeti te sabbepi kusalādisabhāvā, khandhādisabhāvā vā dhammā sutte avuttāpi tāya samānalakkhaṇatāya vuttā bhavanti ānetvā saṃvaṇṇanāvasenāti adhippāyo. Ettha ca ekalakkhaṇāti samānalakkhaṇā vuttā. Tena sahacāritā samānakiccatā samānahetutā samānaphalatā samānārammaṇatāti evamādīhi avuttānampi vuttānaṃ viya niddhāraṇaṃ veditabbaṃ. So hāro lakkhaṇo nāmāti evaṃ sutte anāgatepi dhamme vuttappakārena āgate viya niddhāretvā yā saṃvaṇṇanā, so lakkhaṇo nāma hāroti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "6"
      },
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nerutta"
      },
      "nti niruttaṃ, padanibbacananti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adhippāyo"
      },
      "ti buddhānaṃ sāvakānaṃ vā tassa suttassa desakānaṃ adhippāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Byañjana"
      },
      "nti byañjanena, karaṇe hi etaṃ paccattaṃ. Kāmañca sabbe hārā byañjanavicayā, ayaṃ pana visesato byañjanadvāreneva atthapariyesanāti katvā ‘‘byañjana’’nti vuttaṃ. Tathā hi vakkhati – ‘‘byañjanena suttassa neruttañca adhippāyo ca nidānañca pubbāparānusandhi ca gavesitabbā’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Athā"
      },
      "ti padapūraṇamattaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Desanānidāna"
      },
      "nti nidadāti phalanti nidānaṃ, kāraṇaṃ, yena kāraṇena desanā pavattā, taṃ desanāya pavattinimittanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pubbāparānusandhī"
      },
      "ti pubbena ca aparena ca anusandhi. ‘‘Pubbāparena sandhī’’tipi ",
      " pāṭho, suttassa pubbabhāgena aparabhāgaṃ saṃsanditvā kathananti attho. Saṅgītivasena vā pubbāparabhūtehi suttantarehi saṃvaṇṇiyamānassa suttassa saṃsandanaṃ pubbāparānusandhi. Yañca pubbapadena parapadassa sambandhanaṃ, ayampi pubbāparānusandhi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Eso hāro catubyūho"
      },
      "ti evaṃ nibbacanādhippāyādīnaṃ catunnaṃ vibhāvanalakkhaṇo catubyūho hāro nāmāti attho."
    ],
    "innerText": "6. Neruttanti niruttaṃ, padanibbacananti attho. Adhippāyoti buddhānaṃ sāvakānaṃ vā tassa suttassa desakānaṃ adhippāyo. Byañjananti byañjanena, karaṇe hi etaṃ paccattaṃ. Kāmañca sabbe hārā byañjanavicayā, ayaṃ pana visesato byañjanadvāreneva atthapariyesanāti katvā ‘‘byañjana’’nti vuttaṃ. Tathā hi vakkhati – ‘‘byañjanena suttassa neruttañca adhippāyo ca nidānañca pubbāparānusandhi ca gavesitabbā’’ti. Athāti padapūraṇamattaṃ. Desanānidānanti nidadāti phalanti nidānaṃ, kāraṇaṃ, yena kāraṇena desanā pavattā, taṃ desanāya pavattinimittanti attho. Pubbāparānusandhīti pubbena ca aparena ca anusandhi. ‘‘Pubbāparena sandhī’’tipi pāṭho, suttassa pubbabhāgena aparabhāgaṃ saṃsanditvā kathananti attho. Saṅgītivasena vā pubbāparabhūtehi suttantarehi saṃvaṇṇiyamānassa suttassa saṃsandanaṃ pubbāparānusandhi. Yañca pubbapadena parapadassa sambandhanaṃ, ayampi pubbāparānusandhi. Eso hāro catubyūhoti evaṃ nibbacanādhippāyādīnaṃ catunnaṃ vibhāvanalakkhaṇo catubyūho hāro nāmāti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "7"
      },
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekamhi padaṭṭhāne"
      },
      "ti ekasmiṃ ārambhadhātuādike parakkamadhātuādīnaṃ padaṭṭhānabhūte dhamme desanāruḷhe sati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pariyesati sesakaṃ padaṭṭhāna"
      },
      "nti tassa visabhāgatāya aggahaṇena vā sesakaṃ pamādādīnaṃ āsannakāraṇattā padaṭṭhānabhūtaṃ kosajjādikaṃ dhammantaraṃ pariyesati paññāya gavesati, pariyesitvā ca saṃvaṇṇanāya yojento desanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āvaṭṭati paṭipakkhe"
      },
      "ti vīriyārambhādimukhena āraddhasuttaṃ vuttanayena pamādādivasena niddisanto desanaṃ paṭipakkhato āvaṭṭeti nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āvaṭṭo nāma so hāro"
      },
      "ti desanāya gahitadhammānaṃ sabhāgavisabhāgadhammavasena āvaṭṭanalakkhaṇo āvaṭṭo hāro nāmāti attho."
    ],
    "innerText": "7. Ekamhi padaṭṭhāneti ekasmiṃ ārambhadhātuādike parakkamadhātuādīnaṃ padaṭṭhānabhūte dhamme desanāruḷhe sati. Pariyesati sesakaṃ padaṭṭhānanti tassa visabhāgatāya aggahaṇena vā sesakaṃ pamādādīnaṃ āsannakāraṇattā padaṭṭhānabhūtaṃ kosajjādikaṃ dhammantaraṃ pariyesati paññāya gavesati, pariyesitvā ca saṃvaṇṇanāya yojento desanaṃ āvaṭṭati paṭipakkheti vīriyārambhādimukhena āraddhasuttaṃ vuttanayena pamādādivasena niddisanto desanaṃ paṭipakkhato āvaṭṭeti nāma. Āvaṭṭo nāma so hāroti desanāya gahitadhammānaṃ sabhāgavisabhāgadhammavasena āvaṭṭanalakkhaṇo āvaṭṭo hāro nāmāti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "8"
      },
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhamma"
      },
      "nti sabhāvadhammaṃ, taṃ kusalādivasena anekavidhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Padaṭṭhāna"
      },
      "nti yasmiṃ patiṭṭhite uttari guṇavisese adhigacchati, taṃ visesādhigamanakāraṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhūmi"
      },
      "nti puthujjanabhūmi dassanabhūmīti evamādikaṃ bhūmiṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vibhajjate"
      },
      "ti vibhāgena katheti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sādhāraṇe"
      },
      "ti dassanapahātabbādināmavasena vā puthujjanasotāpannādivatthuvasena vā sādhāraṇe avisiṭṭhe samāneti attho. Vuttavipariyāyena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asādhāraṇā"
      },
      " veditabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Neyyo vibhattī"
      },
      "ti yathāvuttadhammādīnaṃ vibhajano ayaṃ hāro vibhattīti ñātabboti attho. Tasmā saṃkilesadhamme vodānadhamme ca sādhāraṇāsādhāraṇato padaṭṭhānato bhūmito ca vibhajanalakkhaṇo ‘‘vibhattihāro’’ti daṭṭhabbaṃ."
    ],
    "innerText": "8. Dhammanti sabhāvadhammaṃ, taṃ kusalādivasena anekavidhaṃ. Padaṭṭhānanti yasmiṃ patiṭṭhite uttari guṇavisese adhigacchati, taṃ visesādhigamanakāraṇaṃ. Bhūminti puthujjanabhūmi dassanabhūmīti evamādikaṃ bhūmiṃ. Vibhajjateti vibhāgena katheti. Sādhāraṇeti dassanapahātabbādināmavasena vā puthujjanasotāpannādivatthuvasena vā sādhāraṇe avisiṭṭhe samāneti attho. Vuttavipariyāyena asādhāraṇā veditabbā. Neyyo vibhattīti yathāvuttadhammādīnaṃ vibhajano ayaṃ hāro vibhattīti ñātabboti attho. Tasmā saṃkilesadhamme vodānadhamme ca sādhāraṇāsādhāraṇato padaṭṭhānato bhūmito ca vibhajanalakkhaṇo ‘‘vibhattihāro’’ti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "9"
      },
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Niddiṭṭhe"
      },
      "ti kathite sutte āgate, saṃvaṇṇite vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhāvite"
      },
      "ti yathā uppannasadisā uppannāti vuccanti, evaṃ bhāvitasadise bhāvetabbeti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pahīne"
      },
      "ti etthāpi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parivattati paṭipakkhe"
      },
      "ti vuttānaṃ dhammānaṃ ye paṭipakkhā, tesaṃ vasena parivattetīti attho. Evaṃ niddiṭṭhānaṃ dhammānaṃ paṭipakkhato parivattanalakkhaṇo ‘‘parivattano hāro’’ti veditabbo."
    ],
    "innerText": "9. Niddiṭṭheti kathite sutte āgate, saṃvaṇṇite vā. Bhāviteti yathā uppannasadisā uppannāti vuccanti, evaṃ bhāvitasadise bhāvetabbeti attho. Pahīneti etthāpi eseva nayo. Parivattati paṭipakkheti vuttānaṃ dhammānaṃ ye paṭipakkhā, tesaṃ vasena parivattetīti attho. Evaṃ niddiṭṭhānaṃ dhammānaṃ paṭipakkhato parivattanalakkhaṇo ‘‘parivattano hāro’’ti veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "10"
      },
      ". Vividhāni ekasmiṃyeva atthe vacanāni vivacanāni, vivacanāni eva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vevacanāni,"
      },
      " pariyāyasaddāti attho. Tāni vevacanāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bahūnī"
      },
      "ti anekāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tu"
      },
      "-saddo avadhāraṇe. Tena bahū eva pariyāyasaddā vevacanahārayojanāyaṃ kathetabbā, na katipayāti dasseti ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sutte vuttānī"
      },
      "ti navavidhasuttantasaṅkhāte tepiṭake buddhavacane bhāsitāni. Etthāpi tu-saddassa attho ānetvā yojetabbo, tena pāḷiyaṃ āgatāniyeva vevacanāni gahetabbānīti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekadhammassā"
      },
      "ti ekassa padatthassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yo jānāti suttavidū"
      },
      "ti yathā ‘‘sappissa jānāhī’’ti vutte ‘‘sappinā vicārehi, sappiṃ dehi, dethā’’ti vā āṇāpetīti attho, evaṃ yo suttakovido dhammakathiko ekassa ",
      " atthassa bahūpi pariyāyasadde vicāreti vibhāveti yojetīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vevacano nāma so hāro"
      },
      "ti tassa atthassa vuttappakārapariyāyasaddayojanālakkhaṇo vevacanahāro nāma. Tasmā ekasmiṃ atthe anekapariyāyasaddayojanālakkhaṇo ‘‘vevacanahāro’’ti veditabbaṃ."
    ],
    "innerText": "10. Vividhāni ekasmiṃyeva atthe vacanāni vivacanāni, vivacanāni eva vevacanāni, pariyāyasaddāti attho. Tāni vevacanāni. Bahūnīti anekāni. Tu-saddo avadhāraṇe. Tena bahū eva pariyāyasaddā vevacanahārayojanāyaṃ kathetabbā, na katipayāti dasseti . Sutte vuttānīti navavidhasuttantasaṅkhāte tepiṭake buddhavacane bhāsitāni. Etthāpi tu-saddassa attho ānetvā yojetabbo, tena pāḷiyaṃ āgatāniyeva vevacanāni gahetabbānīti vuttaṃ hoti. Ekadhammassāti ekassa padatthassa. Yo jānāti suttavidūti yathā ‘‘sappissa jānāhī’’ti vutte ‘‘sappinā vicārehi, sappiṃ dehi, dethā’’ti vā āṇāpetīti attho, evaṃ yo suttakovido dhammakathiko ekassa atthassa bahūpi pariyāyasadde vicāreti vibhāveti yojetīti attho. Vevacano nāma so hāroti tassa atthassa vuttappakārapariyāyasaddayojanālakkhaṇo vevacanahāro nāma. Tasmā ekasmiṃ atthe anekapariyāyasaddayojanālakkhaṇo ‘‘vevacanahāro’’ti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "11"
      },
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhamma"
      },
      "nti khandhādidhammaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññattīhī"
      },
      "ti paññāpanehi pakārehi ñāpanehi, asaṅkarato vā ṭhapanehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vividhāhī"
      },
      "ti nikkhepappabhavādivasena anekavidhāhi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "So ākāro"
      },
      "ti yo ekassevatthassa nikkhepappabhavapaññattiādivasena anekāhi paññattīhi paññāpanākāro. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñeyyo paññatti nāma hāro"
      },
      "ti paññattihāro nāmāti ñātabbo. Tasmā ekekassa dhammassa anekāhi paññattīhi paññāpetabbākāravibhāvanalakkhaṇo ‘‘paññattihāro’’ti veditabbaṃ."
    ],
    "innerText": "11. Dhammanti khandhādidhammaṃ. Paññattīhīti paññāpanehi pakārehi ñāpanehi, asaṅkarato vā ṭhapanehi. Vividhāhīti nikkhepappabhavādivasena anekavidhāhi. So ākāroti yo ekassevatthassa nikkhepappabhavapaññattiādivasena anekāhi paññattīhi paññāpanākāro. Ñeyyo paññatti nāma hāroti paññattihāro nāmāti ñātabbo. Tasmā ekekassa dhammassa anekāhi paññattīhi paññāpetabbākāravibhāvanalakkhaṇo ‘‘paññattihāro’’ti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "12"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": " Paṭiccuppādo"
      },
      "ti paṭiccasamuppādo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Indriyakhandhā"
      },
      "ti indriyāni ca khandhā ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhātuāyatanā"
      },
      "ti dhātuyo ca āyatanāni ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etehī"
      },
      "ti yo dvādasapadiko paccayākāro yāni ca dvāvīsatindriyāni ye ca pañcakkhandhā yā ca aṭṭhārasa dhātuyo yāni ca dvādasāyatanāni, etehi sutte āgatapadatthamukhena niddhāriyamānehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Otarati yo"
      },
      "ti yo saṃvaṇṇanānayo ogāhati, paṭiccasamuppādādike anupavisatīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Otaraṇo nāma so hāro"
      },
      "ti yo yathāvutto saṃvaṇṇanāviseso, so otaraṇahāro nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ca"
      },
      "-saddena cettha suññatamukhādīnaṃ gāthāyaṃ avuttānampi saṅgaho daṭṭhabbo. Evaṃ paṭiccasamuppādādimukhehi suttatthassa otaraṇalakkhaṇo otaraṇo hāro nāmāti veditabbaṃ."
    ],
    "innerText": "12. Paṭiccuppādoti paṭiccasamuppādo. Indriyakhandhāti indriyāni ca khandhā ca. Dhātuāyatanāti dhātuyo ca āyatanāni ca. Etehīti yo dvādasapadiko paccayākāro yāni ca dvāvīsatindriyāni ye ca pañcakkhandhā yā ca aṭṭhārasa dhātuyo yāni ca dvādasāyatanāni, etehi sutte āgatapadatthamukhena niddhāriyamānehi. Otarati yoti yo saṃvaṇṇanānayo ogāhati, paṭiccasamuppādādike anupavisatīti attho. Otaraṇo nāma so hāroti yo yathāvutto saṃvaṇṇanāviseso, so otaraṇahāro nāma. Ca-saddena cettha suññatamukhādīnaṃ gāthāyaṃ avuttānampi saṅgaho daṭṭhabbo. Evaṃ paṭiccasamuppādādimukhehi suttatthassa otaraṇalakkhaṇo otaraṇo hāro nāmāti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "13"
      },
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissajjitamhī"
      },
      "ti buddhādīhi byākate. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañhe"
      },
      "ti ñātuṃ icchite atthe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gāthāya"
      },
      "nti gāthāruḷhe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idañca pucchantā yebhuyyena gāthābandhavasena pucchantīti katvā vuttaṃ. Yamārabbhā"
      },
      "ti sā pana gāthā yaṃ atthaṃ ārabbha adhikicca pucchitā, tassa atthassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suddhāsuddhaparikkhā"
      },
      "ti padaṃ sodhitaṃ, ārambho na sodhito, padañca sodhitaṃ ārambho ca sodhitoti evaṃ padādīnaṃ sodhitāsodhitabhāvavicāro ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hāro so sodhano"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nāmā"
      },
      "ti yathāvuttavicāro sodhano hāro nāma. Evaṃ sutte padapadatthapañhārambhānaṃ sodhanalakkhaṇo ‘‘sodhano hāro’’ti veditabbaṃ."
    ],
    "innerText": "13. Vissajjitamhīti buddhādīhi byākate. Pañheti ñātuṃ icchite atthe. Gāthāyanti gāthāruḷhe. Idañca pucchantā yebhuyyena gāthābandhavasena pucchantīti katvā vuttaṃ. Yamārabbhāti sā pana gāthā yaṃ atthaṃ ārabbha adhikicca pucchitā, tassa atthassa. Suddhāsuddhaparikkhāti padaṃ sodhitaṃ, ārambho na sodhito, padañca sodhitaṃ ārambho ca sodhitoti evaṃ padādīnaṃ sodhitāsodhitabhāvavicāro . Hāro so sodhanonāmāti yathāvuttavicāro sodhano hāro nāma. Evaṃ sutte padapadatthapañhārambhānaṃ sodhanalakkhaṇo ‘‘sodhano hāro’’ti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "14"
      },
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekattatāyā"
      },
      "ti ",
      " ekassa bhāvo ekattaṃ, ekattameva ekattatā, tāya ekattatāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Eka"
      },
      "-saddo cettha samānasaddapariyāyo, tasmā sāmaññenāti attho. Visiṭṭhā mattā vimattā, vimattāva vemattaṃ, tassa bhāvo vemattatā, tāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vemattatāya,"
      },
      " visesenāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Te na vikappayitabbā"
      },
      "ti ye dhammā ‘‘dukkhaṃ samudayo’’tiādinā sāmaññena, ‘‘jāti jarā kāmataṇhā bhavataṇhā’’tiādinā visesena ca sutte desitā, te ‘‘kimettha sāmaññaṃ, ko vā viseso’’ti evaṃ sāmaññavisesavikappanavasena na vikappayitabbā. Kasmā? Sāmaññavisesakappanāya vohārabhāvena anavaṭṭhānato kāladisāvisesādīnaṃ viya apekkhāsiddhito ca. Yathā hi ‘‘ajja hiyyo sve’’ti vuccamānā kālavisesā anavaṭṭhitasabhāvā ‘‘purimā disā pacchimā disā’’ti vuccamānā disāvisesā ca, evaṃ sāmaññavisesāpi. Tathā hi ‘‘idaṃ dukkha’’nti vuccamānaṃ jātiādiapekkhāya sāmaññampi samānaṃ saccāpekkhāya viseso hoti. Esa nayo samudayādīsupi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Eso hāro adhiṭṭhāno"
      },
      "ti evaṃ suttāgatānaṃ dhammānaṃ avikappanavasena sāmaññavisesaniddhāraṇalakkhaṇo adhiṭṭhāno hāro nāmāti attho."
    ],
    "innerText": "14. Ekattatāyāti ekassa bhāvo ekattaṃ, ekattameva ekattatā, tāya ekattatāya. Eka-saddo cettha samānasaddapariyāyo, tasmā sāmaññenāti attho. Visiṭṭhā mattā vimattā, vimattāva vemattaṃ, tassa bhāvo vemattatā, tāya vemattatāya, visesenāti attho. Te na vikappayitabbāti ye dhammā ‘‘dukkhaṃ samudayo’’tiādinā sāmaññena, ‘‘jāti jarā kāmataṇhā bhavataṇhā’’tiādinā visesena ca sutte desitā, te ‘‘kimettha sāmaññaṃ, ko vā viseso’’ti evaṃ sāmaññavisesavikappanavasena na vikappayitabbā. Kasmā? Sāmaññavisesakappanāya vohārabhāvena anavaṭṭhānato kāladisāvisesādīnaṃ viya apekkhāsiddhito ca. Yathā hi ‘‘ajja hiyyo sve’’ti vuccamānā kālavisesā anavaṭṭhitasabhāvā ‘‘purimā disā pacchimā disā’’ti vuccamānā disāvisesā ca, evaṃ sāmaññavisesāpi. Tathā hi ‘‘idaṃ dukkha’’nti vuccamānaṃ jātiādiapekkhāya sāmaññampi samānaṃ saccāpekkhāya viseso hoti. Esa nayo samudayādīsupi. Eso hāro adhiṭṭhānoti evaṃ suttāgatānaṃ dhammānaṃ avikappanavasena sāmaññavisesaniddhāraṇalakkhaṇo adhiṭṭhāno hāro nāmāti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "15"
      },
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ye dhammā"
      },
      "ti ye avijjādikā paccayadhammā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yaṃ dhamma"
      },
      "nti yaṃ saṅkhārādikaṃ paccayuppannadhammaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Janayantī"
      },
      "ti nibbattenti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paccayā"
      },
      "ti sahajātapaccayabhāvena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paramparato"
      },
      "ti paramparapaccayabhāvena, anurūpasantānaghaṭanavasena paccayo hutvāti attho. Upanissayakoṭi hi idhādhippetā. Purimasmiṃ avasiṭṭho paccayabhāvo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hetumavakaḍḍhayitvā"
      },
      "ti taṃ yathāvuttapaccayasaṅkhātaṃ janakādibhedabhinnaṃ hetuṃ ākaḍḍhitvā suttato niddhāretvā yo saṃvaṇṇanāsaṅkhāto, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "eso hāro parikkhāro"
      },
      "ti evaṃ sutte āgatadhammānaṃ parikkhārasaṅkhāte hetupaccaye niddhāretvā saṃvaṇṇanalakkhaṇo parikkhāro hāroti attho."
    ],
    "innerText": "15. Ye dhammāti ye avijjādikā paccayadhammā. Yaṃ dhammanti yaṃ saṅkhārādikaṃ paccayuppannadhammaṃ. Janayantīti nibbattenti. Paccayāti sahajātapaccayabhāvena. Paramparatoti paramparapaccayabhāvena, anurūpasantānaghaṭanavasena paccayo hutvāti attho. Upanissayakoṭi hi idhādhippetā. Purimasmiṃ avasiṭṭho paccayabhāvo. Hetumavakaḍḍhayitvāti taṃ yathāvuttapaccayasaṅkhātaṃ janakādibhedabhinnaṃ hetuṃ ākaḍḍhitvā suttato niddhāretvā yo saṃvaṇṇanāsaṅkhāto, eso hāro parikkhāroti evaṃ sutte āgatadhammānaṃ parikkhārasaṅkhāte hetupaccaye niddhāretvā saṃvaṇṇanalakkhaṇo parikkhāro hāroti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "16"
      },
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ye dhammā"
      },
      "ti ye sīlādidhammā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yaṃmūlā"
      },
      "ti yesaṃ samādhiādīnaṃ mūlabhūtā, te tesaṃ samādhiādīnaṃ padaṭṭhānabhāvena samāropayitabbāti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ye cekatthā pakāsitā muninā"
      },
      "ti ye ca rāgavirāgācetovimuttisekkhaphalakāmadhātusamatikkamanādisaddā anāgāmiphalatthatāya ekatthā buddhamuninā paridīpitā, te aññamaññavevacanabhāvena samāropayitabbāti sambandho. Samāropanañcettha sutte yathārutavasena ",
      " niddhāraṇavasena vā gayhamānassa sikkhattayasaṅkhātassa ",
      " sīlādikkhandhattayassa pariyāyantaravibhāvanamukhena bhāvanāpāripūrikathanaṃ, bhāvanāpāripūrī ca pahātabbassa pahānenāti pahānasamāropanāpi atthato dassitā eva hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Esa samāropano hāro"
      },
      "ti esa sutte āgatadhammānaṃ padaṭṭhānavevacanabhāvanāpahānasamāropanavicāraṇalakkhaṇo samāropano nāma hāroti attho."
    ],
    "innerText": "16. Ye dhammāti ye sīlādidhammā. Yaṃmūlāti yesaṃ samādhiādīnaṃ mūlabhūtā, te tesaṃ samādhiādīnaṃ padaṭṭhānabhāvena samāropayitabbāti sambandho. Ye cekatthā pakāsitā munināti ye ca rāgavirāgācetovimuttisekkhaphalakāmadhātusamatikkamanādisaddā anāgāmiphalatthatāya ekatthā buddhamuninā paridīpitā, te aññamaññavevacanabhāvena samāropayitabbāti sambandho. Samāropanañcettha sutte yathārutavasena niddhāraṇavasena vā gayhamānassa sikkhattayasaṅkhātassa sīlādikkhandhattayassa pariyāyantaravibhāvanamukhena bhāvanāpāripūrikathanaṃ, bhāvanāpāripūrī ca pahātabbassa pahānenāti pahānasamāropanāpi atthato dassitā eva hoti. Esa samāropano hāroti esa sutte āgatadhammānaṃ padaṭṭhānavevacanabhāvanāpahānasamāropanavicāraṇalakkhaṇo samāropano nāma hāroti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Nayasaṅkhepo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "17"
      },
      ". Evaṃ gāthābandhavasena soḷasapi hāre niddisitvā idāni naye niddisituṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘taṇhañcā’’"
      },
      "tiādi vuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "taṇhañca avijjampi cā"
      },
      "ti sutte āgataṃ atthato niddhāraṇavasena vā gahitaṃ taṇhaṃ avijjañca yo netīti sambandho. Yo saṃvaṇṇanāviseso taṃ neti saṃkilesapakkhaṃ pāpeti saṃkilesavasena suttatthaṃ yojetīti adhippāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samathenā"
      },
      "ti samādhinā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vipassanāyā"
      },
      "ti paññāya, yo neti vodānapakkhaṃ pāpeti, tathā suttatthaṃ yojetīti adhippāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saccehi yojayitvā"
      },
      "ti nayanto ca taṇhā ca avijjā ca bhavamūlakattā samudayasaccaṃ, avasesā tebhūmakadhammā dukkhasaccaṃ, samathavipassanā maggasaccaṃ, tena pattabbā asaṅkhatadhātu nirodhasaccanti evaṃ imehi catūhi saccehi yojetvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayaṃ nayo nandiyāvaṭṭo"
      },
      "ti yo taṇhāvijjāhi saṃkilesapakkhassa suttatthassa samathavipassanāhi vodānapakkhassa catusaccayojanamukhena nayanalakkhaṇo saṃvaṇṇanāviseso, ayaṃ nandiyāvaṭṭo nayo nāmāti attho. Ettha ca nayassa bhūmi gāthāyaṃ ‘‘nayo’’ti vuttā, tasmā saṃvaṇṇanāvisesoti vuttaṃ. Na hi atthanayo saṃvaṇṇanā, catusaccapaṭivedhassa anurūpo pubbabhāge anugāhaṇanayo atthanayo. Tassa pana yā ugghaṭitaññuādīnaṃ vasena taṇhādimukhena nayabhūmiracanā, tattha nayavohāro."
    ],
    "innerText": "17. Evaṃ gāthābandhavasena soḷasapi hāre niddisitvā idāni naye niddisituṃ ‘‘taṇhañcā’’tiādi vuttaṃ. Tattha taṇhañca avijjampi cāti sutte āgataṃ atthato niddhāraṇavasena vā gahitaṃ taṇhaṃ avijjañca yo netīti sambandho. Yo saṃvaṇṇanāviseso taṃ neti saṃkilesapakkhaṃ pāpeti saṃkilesavasena suttatthaṃ yojetīti adhippāyo. Samathenāti samādhinā. Vipassanāyāti paññāya, yo neti vodānapakkhaṃ pāpeti, tathā suttatthaṃ yojetīti adhippāyo. Saccehi yojayitvāti nayanto ca taṇhā ca avijjā ca bhavamūlakattā samudayasaccaṃ, avasesā tebhūmakadhammā dukkhasaccaṃ, samathavipassanā maggasaccaṃ, tena pattabbā asaṅkhatadhātu nirodhasaccanti evaṃ imehi catūhi saccehi yojetvā. Ayaṃ nayo nandiyāvaṭṭoti yo taṇhāvijjāhi saṃkilesapakkhassa suttatthassa samathavipassanāhi vodānapakkhassa catusaccayojanamukhena nayanalakkhaṇo saṃvaṇṇanāviseso, ayaṃ nandiyāvaṭṭo nayo nāmāti attho. Ettha ca nayassa bhūmi gāthāyaṃ ‘‘nayo’’ti vuttā, tasmā saṃvaṇṇanāvisesoti vuttaṃ. Na hi atthanayo saṃvaṇṇanā, catusaccapaṭivedhassa anurūpo pubbabhāge anugāhaṇanayo atthanayo. Tassa pana yā ugghaṭitaññuādīnaṃ vasena taṇhādimukhena nayabhūmiracanā, tattha nayavohāro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "18"
      },
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akusale"
      },
      "ti dvādasacittuppādasaṅgahite sabbepi akusale dhamme. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samūlehī"
      },
      "ti attano mūlehi, lobhadosamohehīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kusale"
      },
      "ti sabbepi catubhūmake kusale dhamme. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kusalamūlehī"
      },
      "ti kusalehi alobhādimūlehi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yo neti"
      },
      ". Nayanto ca kusalākusalaṃ māyāmarīciādayo viya abhūtaṃ na hotīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhūtaṃ"
      },
      ". Paṭaghaṭādayo ",
      " viya na sammutisaccamattanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tathaṃ"
      },
      ". Akusalassa iṭṭhavipākatābhāvato kusalassa ca aniṭṭhavipākatābhāvato vipāke sati avisaṃvādakattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avitathaṃ"
      },
      " neti. Evametesaṃ tiṇṇampi padānaṃ kusalākusalavisesanatā daṭṭhabbā. Atha vā akusalamūlehi akusalāni kusalamūlehi ca kusalāni nayanto ayaṃ nayo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhūtaṃ tathaṃ avitathaṃ"
      },
      " neti, cattāri saccāni niddhāretvā yojetīti attho. Dukkhādīni hi bādhakādibhāvato ",
      " aññathābhāvābhāvena bhūtāni, saccasabhāvattā tathāni, avisaṃvādanato avitathāni. Vuttañhetaṃ bhagavatā ‘‘cattārimāni, bhikkhave, tathāni avitathāni anaññathānī’’ti (saṃ. ni. 5.1090). ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tipukkhalaṃ taṃ nayaṃ āhū"
      },
      "ti yo akusalamūlehi saṃkilesapakkhassa kusalamūlehi vodānapakkhassa suttatthassa catusaccayojanamukhena nayanalakkhaṇo saṃvaṇṇanāviseso, taṃ tipukkhalaṃ nayanti vadantīti attho."
    ],
    "innerText": "18. Akusaleti dvādasacittuppādasaṅgahite sabbepi akusale dhamme. Samūlehīti attano mūlehi, lobhadosamohehīti attho. Kusaleti sabbepi catubhūmake kusale dhamme. Kusalamūlehīti kusalehi alobhādimūlehi yo neti. Nayanto ca kusalākusalaṃ māyāmarīciādayo viya abhūtaṃ na hotīti bhūtaṃ. Paṭaghaṭādayo viya na sammutisaccamattanti tathaṃ. Akusalassa iṭṭhavipākatābhāvato kusalassa ca aniṭṭhavipākatābhāvato vipāke sati avisaṃvādakattā avitathaṃ neti. Evametesaṃ tiṇṇampi padānaṃ kusalākusalavisesanatā daṭṭhabbā. Atha vā akusalamūlehi akusalāni kusalamūlehi ca kusalāni nayanto ayaṃ nayo bhūtaṃ tathaṃ avitathaṃ neti, cattāri saccāni niddhāretvā yojetīti attho. Dukkhādīni hi bādhakādibhāvato aññathābhāvābhāvena bhūtāni, saccasabhāvattā tathāni, avisaṃvādanato avitathāni. Vuttañhetaṃ bhagavatā ‘‘cattārimāni, bhikkhave, tathāni avitathāni anaññathānī’’ti (saṃ. ni. 5.1090). Tipukkhalaṃ taṃ nayaṃ āhūti yo akusalamūlehi saṃkilesapakkhassa kusalamūlehi vodānapakkhassa suttatthassa catusaccayojanamukhena nayanalakkhaṇo saṃvaṇṇanāviseso, taṃ tipukkhalaṃ nayanti vadantīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "19"
      },
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vipallāsehī"
      },
      "ti asubhe subhantiādinayappavattehi catūhi vipallāsehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kilese"
      },
      "ti kilissanti vibādhiyantīti kilesā, saṃkiliṭṭhadhammā, saṃkilesapakkhanti attho. Keci ‘‘saṃkilese’’tipi paṭhanti, kilesasahiteti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Indriyehī"
      },
      "ti saddhādīhi indriyehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddhamme"
      },
      "ti paṭipattipaṭivedhasaddhamme, vodānapakkhanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etaṃ naya"
      },
      "nti yo subhasaññādīhi vipallāsehi sakalassa saṃkilesapakkhassa saddhindriyādīhi vodānapakkhassa catusaccayojanavasena nayanalakkhaṇo saṃvaṇṇanāviseso, etaṃ nayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nayavidū"
      },
      " saddhammanayakovidā, atthanayakusalā eva vā sīhavikkīḷitaṃ nayanti vadantīti attho."
    ],
    "innerText": "19. Vipallāsehīti asubhe subhantiādinayappavattehi catūhi vipallāsehi. Kileseti kilissanti vibādhiyantīti kilesā, saṃkiliṭṭhadhammā, saṃkilesapakkhanti attho. Keci ‘‘saṃkilese’’tipi paṭhanti, kilesasahiteti attho. Indriyehīti saddhādīhi indriyehi. Saddhammeti paṭipattipaṭivedhasaddhamme, vodānapakkhanti attho. Etaṃ nayanti yo subhasaññādīhi vipallāsehi sakalassa saṃkilesapakkhassa saddhindriyādīhi vodānapakkhassa catusaccayojanavasena nayanalakkhaṇo saṃvaṇṇanāviseso, etaṃ nayaṃ nayavidū saddhammanayakovidā, atthanayakusalā eva vā sīhavikkīḷitaṃ nayanti vadantīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "20"
      },
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Veyyākaraṇesū"
      },
      "ti tassa tassa atthanayassa yojanatthaṃ katesu suttassa atthavissajjanesūti attho. Tenevāha ‘‘tahiṃ tahi’’nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kusalākusalā"
      },
      "ti vodāniyā saṃkilesikā ca tassa tassa nayassa disābhūtadhammā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vuttā"
      },
      "ti suttato niddhāretvā kathitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Manasā volokayate"
      },
      "ti te yathāvuttadhamme citteneva ‘‘ayaṃ paṭhamā disā ayaṃ dutiyā disā’’tiādinā tassa tassa nayassa disābhāvena upaparikkhati, vicāretīti attho. ‘‘Olokayate te abahī’’tipi ",
      " pāṭho. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "te"
      },
      "ti te yathāvuttadhamme. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abahī"
      },
      "ti abbhantaraṃ, citte evāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃ khu disālocanaṃ āhū"
      },
      "ti olokayateti ettha yadetaṃ olokanaṃ, taṃ disālocanaṃ nāma nayaṃ vadanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khu"
      },
      "-ti ca nipāto avadhāraṇe. Tena olokanameva ayaṃ nayo, na koci atthavisesoti dasseti."
    ],
    "innerText": "20. Veyyākaraṇesūti tassa tassa atthanayassa yojanatthaṃ katesu suttassa atthavissajjanesūti attho. Tenevāha ‘‘tahiṃ tahi’’nti. Kusalākusalāti vodāniyā saṃkilesikā ca tassa tassa nayassa disābhūtadhammā. Vuttāti suttato niddhāretvā kathitā. Manasā volokayateti te yathāvuttadhamme citteneva ‘‘ayaṃ paṭhamā disā ayaṃ dutiyā disā’’tiādinā tassa tassa nayassa disābhāvena upaparikkhati, vicāretīti attho. ‘‘Olokayate te abahī’’tipi pāṭho. Tattha teti te yathāvuttadhamme. Abahīti abbhantaraṃ, citte evāti attho. Taṃ khu disālocanaṃ āhūti olokayateti ettha yadetaṃ olokanaṃ, taṃ disālocanaṃ nāma nayaṃ vadanti. Khu-ti ca nipāto avadhāraṇe. Tena olokanameva ayaṃ nayo, na koci atthavisesoti dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "21"
      },
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Oloketvā"
      },
      "ti paṭhamādidisābhāvena upaparikkhitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Disālocanenā"
      },
      "ti disālocananayena karaṇabhūtena. Yena hi vidhinā tassa tassa atthanayassa yojanāya disā olokīyanti, so vidhi disālocananti evaṃ vā ettha attho daṭṭhabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ukkhipiyā"
      },
      "ti uddharitvā, disābhūtadhamme suttato niddhāretvāti attho. ‘‘Ukkhipiya yo samānetī’’tipi paṭhanti, tassattho – ‘‘yo tesaṃ disābhūtadhammānaṃ samānayanaṃ karotī’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ya"
      },
      "nti vā kiriyāparāmasanaṃ ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samānetī"
      },
      "ti samaṃ, sammā vā āneti tassa tassa nayassa yojanāvasena. Ke pana āneti? Sabbe kusalākusale taṃtaṃnayadisābhūte. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayaṃ nayo"
      },
      "ti samānetīti ettha yadetaṃ taṃtaṃnayadisābhūtadhammānaṃ samānayanaṃ, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṅkuso"
      },
      " nāma nayoti attho. Etañca dvayaṃ ‘‘vohāranayo, kammanayo’’ti ca vuccati."
    ],
    "innerText": "21. Oloketvāti paṭhamādidisābhāvena upaparikkhitvā. Disālocanenāti disālocananayena karaṇabhūtena. Yena hi vidhinā tassa tassa atthanayassa yojanāya disā olokīyanti, so vidhi disālocananti evaṃ vā ettha attho daṭṭhabbo. Ukkhipiyāti uddharitvā, disābhūtadhamme suttato niddhāretvāti attho. ‘‘Ukkhipiya yo samānetī’’tipi paṭhanti, tassattho – ‘‘yo tesaṃ disābhūtadhammānaṃ samānayanaṃ karotī’’ti. Yanti vā kiriyāparāmasanaṃ . Samānetīti samaṃ, sammā vā āneti tassa tassa nayassa yojanāvasena. Ke pana āneti? Sabbe kusalākusale taṃtaṃnayadisābhūte. Ayaṃ nayoti samānetīti ettha yadetaṃ taṃtaṃnayadisābhūtadhammānaṃ samānayanaṃ, ayaṃ aṅkuso nāma nayoti attho. Etañca dvayaṃ ‘‘vohāranayo, kammanayo’’ti ca vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "22"
      },
      ". Evaṃ hāre naye ca niddisitvā idāni nesaṃ yojanakkamaṃ dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘soḷasa hārā paṭhama’’"
      },
      "ntiādimāha. Tattha paṭhamaṃ soḷasa hārā ‘‘yojetabbā’’ti vacanaseso. Hārasaṃvaṇṇanā paṭhamaṃ kātabbā byañjanapariyeṭṭhibhāvatoti adhippāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Disalocanato"
      },
      "ti disālocanena, ayameva vā pāṭho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṅkusena hī"
      },
      "ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hi"
      },
      "-saddo nipātamattaṃ. Sesaṃ uttānameva."
    ],
    "innerText": "22. Evaṃ hāre naye ca niddisitvā idāni nesaṃ yojanakkamaṃ dassento ‘‘soḷasa hārā paṭhama’’ntiādimāha. Tattha paṭhamaṃ soḷasa hārā ‘‘yojetabbā’’ti vacanaseso. Hārasaṃvaṇṇanā paṭhamaṃ kātabbā byañjanapariyeṭṭhibhāvatoti adhippāyo. Disalocanatoti disālocanena, ayameva vā pāṭho. Aṅkusena hīti hi-saddo nipātamattaṃ. Sesaṃ uttānameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Dvādasapadaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "23"
      },
      ". Idāni yesaṃ byañjanapadānaṃ atthapadānañca vasena dvādasa padāni suttanti vuttaṃ, tāni padāni niddisituṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘akkharaṃ pada’’"
      },
      "ntiādimāha. Tattha apariyosite pade vaṇṇo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "akkharaṃ"
      },
      " pariyāyavasena akkharaṇato asañcaraṇato. Na hi vaṇṇassa pariyāyo vijjati, atha vaṇṇoti kenaṭṭhena vaṇṇo? Atthasaṃvaṇṇanaṭṭhena. Vaṇṇo eva hi ittarakhaṇatāya aparāparabhāvena pavatto padādibhāvena gayhamāno yathāsambandhaṃ taṃ taṃ atthaṃ vadati ",
      ". Ekakkharaṃ vā padaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "akkharaṃ,"
      },
      " keci pana ‘‘manasā desanāvācāya akkharaṇato akkhara’’nti vadanti."
    ],
    "innerText": "23. Idāni yesaṃ byañjanapadānaṃ atthapadānañca vasena dvādasa padāni suttanti vuttaṃ, tāni padāni niddisituṃ ‘‘akkharaṃ pada’’ntiādimāha. Tattha apariyosite pade vaṇṇo akkharaṃ pariyāyavasena akkharaṇato asañcaraṇato. Na hi vaṇṇassa pariyāyo vijjati, atha vaṇṇoti kenaṭṭhena vaṇṇo? Atthasaṃvaṇṇanaṭṭhena. Vaṇṇo eva hi ittarakhaṇatāya aparāparabhāvena pavatto padādibhāvena gayhamāno yathāsambandhaṃ taṃ taṃ atthaṃ vadati . Ekakkharaṃ vā padaṃ akkharaṃ, keci pana ‘‘manasā desanāvācāya akkharaṇato akkhara’’nti vadanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pada"
      },
      "nti pajjati attho etenāti padaṃ, taṃ nāmapadaṃ ākhyātapadaṃ upasaggapadaṃ nipātapadanti catubbidhaṃ. Tattha ‘‘phasso vedanā citta’’nti evamādikaṃ satvappadhānaṃ nāmapadaṃ. ‘‘Phusati vedayati vijānātī’’ti evamādikaṃ kiriyāpadhānaṃ ākhyātapadaṃ. Kiriyāvisesaggahaṇanimittaṃ ‘‘pa’’ iti evamādikaṃ upasaggapadaṃ. Kiriyāya satvassa ca sarūpavisesappakāsanahetubhūtaṃ ‘‘eva’’nti evamādikaṃ nipātapadaṃ."
    ],
    "innerText": "Padanti pajjati attho etenāti padaṃ, taṃ nāmapadaṃ ākhyātapadaṃ upasaggapadaṃ nipātapadanti catubbidhaṃ. Tattha ‘‘phasso vedanā citta’’nti evamādikaṃ satvappadhānaṃ nāmapadaṃ. ‘‘Phusati vedayati vijānātī’’ti evamādikaṃ kiriyāpadhānaṃ ākhyātapadaṃ. Kiriyāvisesaggahaṇanimittaṃ ‘‘pa’’ iti evamādikaṃ upasaggapadaṃ. Kiriyāya satvassa ca sarūpavisesappakāsanahetubhūtaṃ ‘‘eva’’nti evamādikaṃ nipātapadaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Byañjana"
      },
      "nti saṅkhepato vuttaṃ padābhihitaṃ atthaṃ byañjayatīti byañjanaṃ, vākyaṃ. Taṃ pana atthato padasamudāyoti daṭṭhabbaṃ. Padamattasavanepi hi adhikārādivasena labbhamānehi padantarehi anusandhānaṃ katvāva atthasampaṭipatti hotīti vākyameva atthaṃ byañjayati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Niruttī"
      },
      "ti ākārābhihitaṃ nibbacanaṃ nirutti."
    ],
    "innerText": "Byañjananti saṅkhepato vuttaṃ padābhihitaṃ atthaṃ byañjayatīti byañjanaṃ, vākyaṃ. Taṃ pana atthato padasamudāyoti daṭṭhabbaṃ. Padamattasavanepi hi adhikārādivasena labbhamānehi padantarehi anusandhānaṃ katvāva atthasampaṭipatti hotīti vākyameva atthaṃ byañjayati. Niruttīti ākārābhihitaṃ nibbacanaṃ nirutti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Niddeso"
      },
      "ti ",
      " nibbacanavitthāro niravasesadesanattā niddeso. Padehi vākyassa vibhāgo ākāro. Yadi evaṃ padato ākārassa ko visesoti? Apariyosite vākye avibhajjamāne vā tadavayavo padaṃ. Uccāraṇavasena pariyosite vākye vibhajjamāne vā tadavayavo ākāroti ayametesaṃ viseso. Chaṭṭhaṃ vacanaṃ chaṭṭhavacanaṃ. Ākāro chaṭṭhavacanaṃ etassāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ākārachaṭṭhavacanaṃ,"
      },
      " byañjanapadaṃ. Ettha ca byañjananti imassa padassa anantaraṃ vattabbaṃ ākārapadaṃ niddesapadānantaraṃ vadantena ‘‘ākārachaṭṭhavacana’’nti vuttaṃ, padānupubbikaṃ pana icchantehi taṃ byañjanapadānantarameva kātabbaṃ. Tathā hi vakkhati ‘‘aparimāṇā byañjanā aparimāṇā ākārāti, byañjanehi vivarati ākārehi vibhajatī’’ti ca. Keci pana ‘‘ākārapadabyañjananiruttiyo ca niddeso’’ti paṭhanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ettāva byañjanaṃ sabba"
      },
      "nti yānimāni akkharādīni niddiṭṭhāni, ettakameva sabbaṃ byañjanaṃ, etehi asaṅgahitaṃ byañjanaṃ nāma natthīti attho."
    ],
    "innerText": "Niddesoti nibbacanavitthāro niravasesadesanattā niddeso. Padehi vākyassa vibhāgo ākāro. Yadi evaṃ padato ākārassa ko visesoti? Apariyosite vākye avibhajjamāne vā tadavayavo padaṃ. Uccāraṇavasena pariyosite vākye vibhajjamāne vā tadavayavo ākāroti ayametesaṃ viseso. Chaṭṭhaṃ vacanaṃ chaṭṭhavacanaṃ. Ākāro chaṭṭhavacanaṃ etassāti ākārachaṭṭhavacanaṃ, byañjanapadaṃ. Ettha ca byañjananti imassa padassa anantaraṃ vattabbaṃ ākārapadaṃ niddesapadānantaraṃ vadantena ‘‘ākārachaṭṭhavacana’’nti vuttaṃ, padānupubbikaṃ pana icchantehi taṃ byañjanapadānantarameva kātabbaṃ. Tathā hi vakkhati ‘‘aparimāṇā byañjanā aparimāṇā ākārāti, byañjanehi vivarati ākārehi vibhajatī’’ti ca. Keci pana ‘‘ākārapadabyañjananiruttiyo ca niddeso’’ti paṭhanti. Ettāva byañjanaṃ sabbanti yānimāni akkharādīni niddiṭṭhāni, ettakameva sabbaṃ byañjanaṃ, etehi asaṅgahitaṃ byañjanaṃ nāma natthīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "24"
      },
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅkāsanā"
      },
      "ti saṃkhittena kāsanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pakāsanā"
      },
      "ti paṭhamaṃ kāsanā, kāsīyati dīpīyatīti attho. Iminā hi atthapadadvayena akkharapadehi vibhāviyamāno atthākāro gahito. Yasmā akkharehi suyyamānehi suṇantānaṃ visesavidhānassa katattā padapariyosāne ",
      " padatthasampaṭipatti hoti. Tathā hi vakkhati ‘‘tattha bhagavā akkharehi saṅkāseti padehi pakāsetīti, akkharehi padehi ca ugghāṭetī’’ti ca."
    ],
    "innerText": "24. Saṅkāsanāti saṃkhittena kāsanā. Pakāsanāti paṭhamaṃ kāsanā, kāsīyati dīpīyatīti attho. Iminā hi atthapadadvayena akkharapadehi vibhāviyamāno atthākāro gahito. Yasmā akkharehi suyyamānehi suṇantānaṃ visesavidhānassa katattā padapariyosāne padatthasampaṭipatti hoti. Tathā hi vakkhati ‘‘tattha bhagavā akkharehi saṅkāseti padehi pakāsetīti, akkharehi padehi ca ugghāṭetī’’ti ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vivaraṇā"
      },
      "ti vitthāraṇā. Vibhajanā ca uttānīkammañca paññatti ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vibhajanuttānīkammapaññatti"
      },
      ". Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vibhajanā"
      },
      "ti vibhāgakaraṇaṃ, ubhayenāpi niddisanamāha. Idha purimanayeneva byañjanākārehi niddisiyamāno atthākāro dassitoti daṭṭhabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uttānīkammaṃ"
      },
      " pākaṭakaraṇaṃ. Pakārehi ñāpanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paññatti"
      },
      ". Dvayenāpi paṭiniddisanaṃ katheti. Etthāpi niruttiniddesasaṅkhātehi byañjanapadehi niddisiyamāno atthākāro vutto, yo paṭiniddisīyatīti vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etehī"
      },
      "ti etehi eva saṅkāsanādivinimuttassa desanātthassa abhāvato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attho"
      },
      "ti suttattho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kamma"
      },
      "nti ugghaṭanādikammaṃ. Suttatthena hi desanāya pavattiyamānena ugghaṭitaññuādiveneyyānaṃ cittasantānassa pabodhanakiriyānibbatti. So ca suttattho saṅkāsanādiākāroti. Tena vuttaṃ – ‘‘attho kammañca niddiṭṭha’’nti."
    ],
    "innerText": "Vivaraṇāti vitthāraṇā. Vibhajanā ca uttānīkammañca paññatti ca vibhajanuttānīkammapaññatti. Tattha vibhajanāti vibhāgakaraṇaṃ, ubhayenāpi niddisanamāha. Idha purimanayeneva byañjanākārehi niddisiyamāno atthākāro dassitoti daṭṭhabbaṃ. Uttānīkammaṃ pākaṭakaraṇaṃ. Pakārehi ñāpanaṃ paññatti. Dvayenāpi paṭiniddisanaṃ katheti. Etthāpi niruttiniddesasaṅkhātehi byañjanapadehi niddisiyamāno atthākāro vutto, yo paṭiniddisīyatīti vuccati. Etehīti etehi eva saṅkāsanādivinimuttassa desanātthassa abhāvato. Atthoti suttattho. Kammanti ugghaṭanādikammaṃ. Suttatthena hi desanāya pavattiyamānena ugghaṭitaññuādiveneyyānaṃ cittasantānassa pabodhanakiriyānibbatti. So ca suttattho saṅkāsanādiākāroti. Tena vuttaṃ – ‘‘attho kammañca niddiṭṭha’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "25"
      },
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tīṇī"
      },
      "ti liṅgavipallāsena vuttaṃ, tayoti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Navahi padehī"
      },
      "ti navahi koṭṭhāsehi ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attho samāyutto"
      },
      "ti attho sammā yutto na vinā vattati. Sabbassa hi buddhavacanassa catusaccappakāsanato atthanayānañca catusaccayojanavasena pavattanato sabbo pāḷiattho atthanayattayasaṅgahito saṅkāsanādiākāravisesavutti cāti."
    ],
    "innerText": "25. Tīṇīti liṅgavipallāsena vuttaṃ, tayoti vuttaṃ hoti. Navahi padehīti navahi koṭṭhāsehi . Attho samāyuttoti attho sammā yutto na vinā vattati. Sabbassa hi buddhavacanassa catusaccappakāsanato atthanayānañca catusaccayojanavasena pavattanato sabbo pāḷiattho atthanayattayasaṅgahito saṅkāsanādiākāravisesavutti cāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "26"
      },
      ". Idāni yathāniddiṭṭhe desanāhārādike nettippakaraṇassa padatthe sukhaggahaṇatthaṃ gaṇanavasena paricchinditvā dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘atthassā’’"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "catubbīsā"
      },
      "ti soḷasa hārā cha byañjanapadāni dve kammanayāti evaṃ catubbīsa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ubhaya"
      },
      "nti cha atthapadāni tayo atthanayāti idaṃ navavidhaṃ yathāvuttaṃ catubbīsavidhañcāti etaṃ ubhayaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅkalayitvā"
      },
      "ti sampiṇḍetvā. ‘‘Saṅkhepayato’’tipi pāṭho, ekato karontassāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ettikā"
      },
      "ti etappamāṇā, ito vinimutto koci nettipadatthā natthīti attho."
    ],
    "innerText": "26. Idāni yathāniddiṭṭhe desanāhārādike nettippakaraṇassa padatthe sukhaggahaṇatthaṃ gaṇanavasena paricchinditvā dassento ‘‘atthassā’’tiādimāha. Tattha catubbīsāti soḷasa hārā cha byañjanapadāni dve kammanayāti evaṃ catubbīsa. Ubhayanti cha atthapadāni tayo atthanayāti idaṃ navavidhaṃ yathāvuttaṃ catubbīsavidhañcāti etaṃ ubhayaṃ. Saṅkalayitvāti sampiṇḍetvā. ‘‘Saṅkhepayato’’tipi pāṭho, ekato karontassāti attho. Ettikāti etappamāṇā, ito vinimutto koci nettipadatthā natthīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ tettiṃsapadatthāya nettiyā suttassa atthapariyesanāya yo ‘‘soḷasa hārā paṭhama’’nti nayehi paṭhamaṃ hārā saṃvaṇṇetabbāti hāranayānaṃ saṃvaṇṇanākkamo dassito, svāyaṃ hāranayānaṃ desanākkameneva ",
      " siddho. Evaṃ siddhe sati ayaṃ ārambho imamatthaṃ dīpeti – sabbepime hārā nayā ca iminā dassitakkameneva suttesu saṃvaṇṇanāvasena yojetabbā, na uppaṭipāṭiyāti."
    ],
    "innerText": "Evaṃ tettiṃsapadatthāya nettiyā suttassa atthapariyesanāya yo ‘‘soḷasa hārā paṭhama’’nti nayehi paṭhamaṃ hārā saṃvaṇṇetabbāti hāranayānaṃ saṃvaṇṇanākkamo dassito, svāyaṃ hāranayānaṃ desanākkameneva siddho. Evaṃ siddhe sati ayaṃ ārambho imamatthaṃ dīpeti – sabbepime hārā nayā ca iminā dassitakkameneva suttesu saṃvaṇṇanāvasena yojetabbā, na uppaṭipāṭiyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kiṃ panettha kāraṇaṃ, yadete hārā nayā ca imināva kamena desitāti? Yadipi nāyamanuyogo katthaci anukkame nivisati, api ca dhammadesanāya nissayaphalatadupāyasarīrabhūtānaṃ assādādīnaṃ vibhāvanasabhāvattā pakatiyā sabbasuttānurūpāti suviññeyyabhāvato paresañca saṃvaṇṇanāvisesānaṃ vicayahārādīnaṃ patiṭṭhābhāvato paṭhamaṃ desanāhāro dassito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Padapucchāvissajjanapubbāparānugītīhi saddhiṃ desanāhārapadatthānaṃ pavicayasabhāvatāya tassa anantaraṃ vicayo. Tathā hi vakkhati ‘‘padaṃ vicinati…pe… āṇattiṃ vicinati anugītiṃ vicinatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Vicayena hārena pavicitānaṃ atthānaṃ yuttāyuttivicāraṇā yuttāti yuttivicāraṇabhāvato vicayānantaraṃ yuttihāro vutto. Tathā hi vakkhati – ‘‘vicayena hārena vicinitvā yuttihārena yojetabba’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yuttāyuttānaṃyeva ",
      " atthānaṃ upapattianurūpaṃ kāraṇaparamparāya niddhāraṇalakkhaṇaṃ padaṭṭhānacintanaṃ kattabbanti yuttihārānantaraṃ padaṭṭhānahāro dassito. Tathā hi vakkhati – ‘‘yo koci upanissayo yo koci paccayo ca, sabbo so padaṭṭhāna’’nti."
    ],
    "innerText": "Yuttāyuttānaṃyeva atthānaṃ upapattianurūpaṃ kāraṇaparamparāya niddhāraṇalakkhaṇaṃ padaṭṭhānacintanaṃ kattabbanti yuttihārānantaraṃ padaṭṭhānahāro dassito. Tathā hi vakkhati – ‘‘yo koci upanissayo yo koci paccayo ca, sabbo so padaṭṭhāna’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yuttāyuttānaṃ kāraṇaparamparāya pariggahitasabhāvānaṃyeva ca dhammānaṃ avuttānampi ekalakkhaṇatāya gahaṇaṃ kātabbanti dassanatthaṃ padaṭṭhānānantaraṃ lakkhaṇo hāro vutto. Tathā hi lakkhaṇahāravibhaṅge ‘‘avijjāpaccayā saṅkhārā’’tiādinā paṭiccasamuppādaṃ dassetvā ‘‘evaṃ ye dhammā ekalakkhaṇā’’tiādi vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atthato niddhāritānampi dhammānaṃ nibbacanādīni vattabbāni, na sutte sarūpato āgatānamevāti dassanatthaṃ lakkhaṇānantaraṃ catubyūho vutto. Evañhi niravasesato atthāvabodho hoti, evañca katvā ‘‘yadā hi bhikkhu atthassa ca nāmaṃ jānāti dhammassa ca nāmaṃ jānāti tathā tathā naṃ abhiniropetī’’ti anavasesapariyādānaṃ vakkhati. Tathā ‘‘punappunaṃ gabbhamupetī’’ti ettha ‘‘ye jarāmaraṇena aṭṭiyitukāmā bhavissanti ",
      ", te bhavissanti bhojane mattaññuno indriyesu guttadvārā’’tiādinā sammāpaṭipattiṃ adhippāyabhāvena vakkhati."
    ],
    "innerText": "Atthato niddhāritānampi dhammānaṃ nibbacanādīni vattabbāni, na sutte sarūpato āgatānamevāti dassanatthaṃ lakkhaṇānantaraṃ catubyūho vutto. Evañhi niravasesato atthāvabodho hoti, evañca katvā ‘‘yadā hi bhikkhu atthassa ca nāmaṃ jānāti dhammassa ca nāmaṃ jānāti tathā tathā naṃ abhiniropetī’’ti anavasesapariyādānaṃ vakkhati. Tathā ‘‘punappunaṃ gabbhamupetī’’ti ettha ‘‘ye jarāmaraṇena aṭṭiyitukāmā bhavissanti , te bhavissanti bhojane mattaññuno indriyesu guttadvārā’’tiādinā sammāpaṭipattiṃ adhippāyabhāvena vakkhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nibbacanādhippāyanidānavacanehi saddhiṃ sutte padatthānaṃ suttantarasaṃsandanasaṅkhāte pubbāparavicāre dassite tesaṃ sabhāgavisabhāgadhammantarāvaṭṭanaṃ sukhena sakkā dassetunti catubyūhānantaraṃ āvaṭṭo vutto. Teneva hi ‘‘ārambhatha nikkamathā’’ti gāthāyaṃ ārambhanikkamanabuddhasāsanayogadhunanehi vīriyasamādhipaññindriyāni niddhāretvā tadanuyogassa mūlaṃ ‘‘pamādo’’ti suttantare dassito pamādo āvaṭṭito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sabhāgavisabhāgadhammāvaṭṭane niyojite sādhāraṇāsādhāraṇavasena saṃkilesavodānadhammānaṃ padaṭṭhānato bhūmito ca vibhāgo sakkā sukhena yojitunti āvaṭṭānantaraṃ vibhattihāro vutto. Yato vibhattihāravibhaṅge ‘‘katame dhammā sādhāraṇā? Dve dhammā sādhāraṇā, nāmasādhāraṇā vatthusādhāraṇā cā’’ti ārabhitvā ‘‘micchattaniyatānaṃ sattānaṃ aniyatānañca sattānaṃ dassanappahātabbā kilesā sādhāraṇā, puthujjanassa sotāpannassa ca kāmarāgabyāpādā sādhāraṇā’’tiādinā sabhāgavisabhāgapariyāyavanteyeva dhamme vibhajissati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sāvajjānavajjadhammānaṃ ",
      " sappaṭibhāgābhāvato tesaṃ vibhāge kate suttāgate dhamme akasirena paṭipakkhato parivattetuṃ sakkāti vibhattianantaraṃ parivattanahāro vutto. Tathā hi ‘‘sammādiṭṭhissa purisapuggalassa micchādiṭṭhi nijjiṇṇā bhavatī’’ti paṭivibhattasabhāve eva dhamme parivattanahāravibhaṅge udāharissati."
    ],
    "innerText": "Sāvajjānavajjadhammānaṃ sappaṭibhāgābhāvato tesaṃ vibhāge kate suttāgate dhamme akasirena paṭipakkhato parivattetuṃ sakkāti vibhattianantaraṃ parivattanahāro vutto. Tathā hi ‘‘sammādiṭṭhissa purisapuggalassa micchādiṭṭhi nijjiṇṇā bhavatī’’ti paṭivibhattasabhāve eva dhamme parivattanahāravibhaṅge udāharissati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Paṭipakkhato parivattitāpi dhammā pariyāyavacanehi bodhetabbā, na sutte āgatāyevāti dassanatthaṃ parivattanānantaraṃ vevacanahāro vutto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ te dhammā pariyāyasaddatopi vibhāvitā hontīti pariyāyato pakāsitānaṃ dhammānaṃ pabhedato paññattivasena vibhajanaṃ sukhena sakkā ñātunti vevacanahārānantaraṃ paññattihāro vutto. Tathā hi sutte āgatadhammānaṃ pariyāyapaññattivibhāgaṃ subodhanañca paññattihāravibhaṅge vakkhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pabhāvapariññādipaññattivibhāgamukhena ",
      " paṭiccasamuppādasaccādidhammavibhāge kate sutte āgatadhammānaṃ paṭiccasamuppādādimukhena avadhāraṇaṃ sakkā dassetunti paññattianantaraṃ otaraṇo hāro vutto. Tathā hi ‘‘uddhaṃ adho’’ti gāthaṃ uddisitvā ‘‘vippamutto’’ti padena asekkhaṃ vijjaṃ niddhāretvā ‘‘vijjuppādā avijjānirodho’’tiādinā paṭiccasamuppādaṃ udāharissati."
    ],
    "innerText": "Pabhāvapariññādipaññattivibhāgamukhena paṭiccasamuppādasaccādidhammavibhāge kate sutte āgatadhammānaṃ paṭiccasamuppādādimukhena avadhāraṇaṃ sakkā dassetunti paññattianantaraṃ otaraṇo hāro vutto. Tathā hi ‘‘uddhaṃ adho’’ti gāthaṃ uddisitvā ‘‘vippamutto’’ti padena asekkhaṃ vijjaṃ niddhāretvā ‘‘vijjuppādā avijjānirodho’’tiādinā paṭiccasamuppādaṃ udāharissati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dhātāyatanādīsu otāritānaṃ sutte padatthānaṃ pucchārambhavisodhanaṃ sakkā sukhena sampādetunti otaraṇānantaraṃ sodhano hāro vutto. Tathā hi vakkhati – ‘‘yattha evaṃ suddho ārambho, so pañho vissajjito bhavatī’’tiādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Visodhitesu sutte padapadatthesu tattha labbhamānasāmaññavisesabhāvo sukaro hotīti dassetuṃ sodhanānantaraṃ adhiṭṭhāno hāro dassito. Sodhano hi adhiṭṭhānassa bahūpakāro, tato eva hi ‘‘yathā yathā vā pana pucchitaṃ, tathā tathā vissajjayitabba’’nti vakkhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sāmaññavisesabhūtesu sādhāraṇāsādhāraṇesu dhammesu paveditesu parikkhārasaṅkhātassa sādhāraṇāsādhāraṇarūpassa paccayaheturāsissa pabhedo suviññeyyoti adhiṭṭhānānantaraṃ parikkhāro vutto ",
      ". Tathā hi vakkhati ‘‘asādhāraṇalakkhaṇo hetu, sādhāraṇalakkhaṇo paccayo. Yathā kiṃ bhave, yathā aṅkurassa nibbattiyā bījaṃ asādhāraṇaṃ, pathavī āpo ca sādhāraṇā’’tiādi."
    ],
    "innerText": "Sāmaññavisesabhūtesu sādhāraṇāsādhāraṇesu dhammesu paveditesu parikkhārasaṅkhātassa sādhāraṇāsādhāraṇarūpassa paccayaheturāsissa pabhedo suviññeyyoti adhiṭṭhānānantaraṃ parikkhāro vutto . Tathā hi vakkhati ‘‘asādhāraṇalakkhaṇo hetu, sādhāraṇalakkhaṇo paccayo. Yathā kiṃ bhave, yathā aṅkurassa nibbattiyā bījaṃ asādhāraṇaṃ, pathavī āpo ca sādhāraṇā’’tiādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Asādhāraṇe sādhāraṇe ca kāraṇe dassite tassa attano phalesu kāraṇākāro tesaṃ hetuphalānaṃ pabhedato desanākāro bhāvetabbapahātabbadhammānaṃ bhāvanāpahānāni ca niddhāretvā vuccamānāni sammā suttassa atthaṃ tathattāvabodhāya saṃvattantīti parikkhārānantaraṃ samāropano hāro dassitoti. Idaṃ hārānaṃ anukkamakāraṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nayānaṃ pana veneyyattayappayojitattā atthanayattayūpadesassa tadanukkameneva nandiyāvaṭṭādīnaṃ tiṇṇaṃ atthanayānaṃ kamo veditabbo. Ugghaṭitaññuādayo hi tayo veneyyā nandiyāvaṭṭādayo payojenti. Tasmā te uddesaniddesapaṭiniddesā viya yathākkamaṃ tesaṃ upakārāya ",
      " savaṃttantīti. Tathā hi nesaṃ cattāro cha aṭṭha ca mūlapadā niddiṭṭhā. Itarassa pana nayadvayassa atthanayattayassa bhūmiyā ālocanaṃ tassa tattha samānayanañcāti iminā kāraṇena uddesakkamo veditabbo. Na hi sakkā anoloketvā samānetunti."
    ],
    "innerText": "Nayānaṃ pana veneyyattayappayojitattā atthanayattayūpadesassa tadanukkameneva nandiyāvaṭṭādīnaṃ tiṇṇaṃ atthanayānaṃ kamo veditabbo. Ugghaṭitaññuādayo hi tayo veneyyā nandiyāvaṭṭādayo payojenti. Tasmā te uddesaniddesapaṭiniddesā viya yathākkamaṃ tesaṃ upakārāya savaṃttantīti. Tathā hi nesaṃ cattāro cha aṭṭha ca mūlapadā niddiṭṭhā. Itarassa pana nayadvayassa atthanayattayassa bhūmiyā ālocanaṃ tassa tattha samānayanañcāti iminā kāraṇena uddesakkamo veditabbo. Na hi sakkā anoloketvā samānetunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Etaparamatā ca hārānaṃ ettakehi pakāravisesehi atthanayattayasahitehi suttassa attho niddhāriyamāno veneyyānaṃ alamanuttarāya paṭhamāya bhūmiyā samadhigamāyāti veditabbo. Dassanabhūmisamanuppattiatthā hi nettippakaraṇadesanāti. Atha vā etadantogadhattā sabbesaṃ suttassa saṃvaṇṇanāvisesānaṃ ettāvatā hārānaṃ daṭṭhabbā. Yattakā hi suttassa saṃvaṇṇanāvisesā, sabbe te nettiupadesāyattāti vuttovāyamattho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tathā hi ye keci suttassa saṃvaṇṇanāpakārā niddisīyanti. Seyyathidaṃ – suttassa samuṭṭhānaṃ vattabbaṃ, adhippāyo vibhāvetabbo, anekadhā padattho saṃvaṇṇetabbo, vidhi anuvādo ca veditabbo, virodho samādhātabbo, anusandhiyā anurūpaṃ nigametabbanti. Tathā suttassa payojanaṃ piṇḍattho padattho anusandhi codanā parihāro ca atthaṃ vadantena vattabbāti. Tathā upogghāṭapadaviggahapadatthacālanāpaccupaṭṭhānāni vattabbānīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tathā tisso kathā ekanāḷikā caturassā nisinnavattikā. Tattha pāḷiṃ vatvā ekekapadassa atthakathanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekanāḷikā"
      },
      " nāma."
    ],
    "innerText": "Tathā tisso kathā ekanāḷikā caturassā nisinnavattikā. Tattha pāḷiṃ vatvā ekekapadassa atthakathanaṃ ekanāḷikā nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Paṭipakkhaṃ ",
      " dassetvā paṭipakkhassa upamaṃ dassetvā sapakkhaṃ dassetvā sapakkhassa upamaṃ dassetvā kathanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "caturassā"
      },
      " nāma."
    ],
    "innerText": "Paṭipakkhaṃ dassetvā paṭipakkhassa upamaṃ dassetvā sapakkhaṃ dassetvā sapakkhassa upamaṃ dassetvā kathanaṃ caturassā nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Visabhāgadhammavaseneva pariyosānaṃ gantvā puna sabhāgadhammavaseneva pariyosānagamanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nisinnavattikā"
      },
      " nāma."
    ],
    "innerText": "Visabhāgadhammavaseneva pariyosānaṃ gantvā puna sabhāgadhammavaseneva pariyosānagamanaṃ nisinnavattikā nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhedakathāya tatvakathāya pariyāyavacanehi ca suttaṃ saṃvaṇṇetabbanti ca evamādayo. Tesampi ettheva avarodho, yasmā te idha katipayahārasaṅgahitāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nayānaṃ pana yasmā ugghaṭitaññuādayo tayo eva veneyyā saccābhisamayabhāgino tadatthāya ca atthanayadesanā, tasmā satipi saṃkilesavodānadhammānaṃ ",
      " yathāvuttamūlapadabhedato vaḍḍhetvā vibhajitabbappakāre tathā mūlapadāni avaḍḍhetvā veneyyattayavaseneva etaparamatā vuttā. Navasu navasu eva hi mūlapadesu sabbesaṃ saṃkilesavodānadhammānaṃ antogadhabhāvato na tāni vaḍḍhetabbāni veneyyattayādhikārato na hāpetabbānīti nayānaṃ etaparamatā daṭṭhabbā."
    ],
    "innerText": "Nayānaṃ pana yasmā ugghaṭitaññuādayo tayo eva veneyyā saccābhisamayabhāgino tadatthāya ca atthanayadesanā, tasmā satipi saṃkilesavodānadhammānaṃ yathāvuttamūlapadabhedato vaḍḍhetvā vibhajitabbappakāre tathā mūlapadāni avaḍḍhetvā veneyyattayavaseneva etaparamatā vuttā. Navasu navasu eva hi mūlapadesu sabbesaṃ saṃkilesavodānadhammānaṃ antogadhabhāvato na tāni vaḍḍhetabbāni veneyyattayādhikārato na hāpetabbānīti nayānaṃ etaparamatā daṭṭhabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kammanayānaṃ pana ālocanasamānayanato aññassa pakārantarassa asambhavato etaparamatā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hetvādī"
      },
      "ti ettha ādisaddena phalabhūmiupanisāsabhāgavisabhāgalakkhaṇanayādayo pariggahitā. Tesu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hetū"
      },
      "ti kāraṇaṃ, yo dhammotipi vuccati, so pana paccayabhāvena ekavidho. Kārako sampāpakoti duvidho. Puna kārako ñāpako sampāpakoti tividho. Hetuhetu paccayahetu uttamahetu sādhāraṇahetūti catubbidho. Paccayadhammo kusalo akusalo saddo ariyamaggoti pañcavidho. Tathā sabhāgahetu asabhāgahetu ajjhattikahetu bāhirahetu janakahetu pariggāhakahetu sādhāraṇahetu asādhāraṇahetu samanantarahetu paramparahetu sahajātahetu asahajātahetu sāsavahetu anāsavahetūtiādinā anekavidho cāti veditabbo."
    ],
    "innerText": "Kammanayānaṃ pana ālocanasamānayanato aññassa pakārantarassa asambhavato etaparamatā. Hetvādīti ettha ādisaddena phalabhūmiupanisāsabhāgavisabhāgalakkhaṇanayādayo pariggahitā. Tesu hetūti kāraṇaṃ, yo dhammotipi vuccati, so pana paccayabhāvena ekavidho. Kārako sampāpakoti duvidho. Puna kārako ñāpako sampāpakoti tividho. Hetuhetu paccayahetu uttamahetu sādhāraṇahetūti catubbidho. Paccayadhammo kusalo akusalo saddo ariyamaggoti pañcavidho. Tathā sabhāgahetu asabhāgahetu ajjhattikahetu bāhirahetu janakahetu pariggāhakahetu sādhāraṇahetu asādhāraṇahetu samanantarahetu paramparahetu sahajātahetu asahajātahetu sāsavahetu anāsavahetūtiādinā anekavidho cāti veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Phala"
      },
      "mpi paccayuppannabhāvena ekavidhaṃ. Adhigantabbatopi sampāpakahetuvasena phalapariyāyo labbhatīti nibbattetabbaadhigantabbabhāvato duvidhaṃ. Ñāpetabbanibbattetabbapattabbato tividhaṃ. Paccayuppannavipākakiriyāvacanatthanibbānavasena pañcavidhaṃ. Sabhāgahetunibbattaṃ asabhāgahetunibbattanti evamādivasena anekavidhañcāti veditabbaṃ. Tathā lokiyaṃ lokuttaranti. Tattha lokuttaraṃ cattāri sāmaññaphalāni. Lokiyaphalaṃ duvidhaṃ kāyikaṃ mānasañca ",
      ". Tattha kāyikaṃ pañcadvārikaṃ, avasiṭṭhaṃ mānasaṃ. Yañca tāya tāya suttadesanāya sādhetabbaṃ, tadapi phalanti."
    ],
    "innerText": "Phalampi paccayuppannabhāvena ekavidhaṃ. Adhigantabbatopi sampāpakahetuvasena phalapariyāyo labbhatīti nibbattetabbaadhigantabbabhāvato duvidhaṃ. Ñāpetabbanibbattetabbapattabbato tividhaṃ. Paccayuppannavipākakiriyāvacanatthanibbānavasena pañcavidhaṃ. Sabhāgahetunibbattaṃ asabhāgahetunibbattanti evamādivasena anekavidhañcāti veditabbaṃ. Tathā lokiyaṃ lokuttaranti. Tattha lokuttaraṃ cattāri sāmaññaphalāni. Lokiyaphalaṃ duvidhaṃ kāyikaṃ mānasañca . Tattha kāyikaṃ pañcadvārikaṃ, avasiṭṭhaṃ mānasaṃ. Yañca tāya tāya suttadesanāya sādhetabbaṃ, tadapi phalanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhūmī"
      },
      "ti sāsavabhūmi anāsavabhūmi saṅkhatabhūmi asaṅkhatabhūmi dassanabhūmi bhāvanābhūmi puthujjanabhūmi sekkhabhūmi asekkhabhūmi sāvakabhūmi paccekabuddhabhūmi sammāsambuddhabhūmi jhānabhūmi asamāhitabhūmi paṭipajjamānabhūmi paṭipannabhūmi paṭhamābhūmi yāva catutthībhūmi kāmāvacarabhūmi yāva lokuttarabhūmīti bahuvidhā. Tattha sāsavabhūmi parittamahaggatā dhammā. Anāsavabhūmi appamāṇā dhammā. Saṅkhatabhūmi nibbānavajjā sabbe sabhāvadhammā. Asaṅkhatabhūmi appaccayā ",
      " dhammā. Dassanabhūmi paṭhamamaggaphaladhammā. Bhāvanābhūmi avasiṭṭhamaggaphaladhammā. Puthujjanabhūmi hīnamajjhimā dhammā. Sekkhabhūmi cattāro ariyamaggadhammā heṭṭhimā ca tayo phaladhammā. Asekkhabhūmi aggaphaladhammā. Sāvakapaccekabuddhabuddhadhammā sāvakādibhūmiyo. Jhānabhūmi jhānadhammā. Asamāhitabhūmi jhānavajjitā dhammā. Paṭipajjamānabhūmi maggadhammā. Paṭipannabhūmi phaladhammā. Paṭhamādibhūmiyo saha phalena cattāro maggā apariyāpannā dhammā ‘‘paṭhamāya bhūmiyā pattiyā’’tiādivacanato. Kāmāvacarādibhūmiyo kāmāvacarādidhammā. Ye ca dhammā tesaṃ tesaṃ hāranayānaṃ patiṭṭhānabhāvena suttesu niddhārīyanti, tepi bhūmiyoti viññātabbā."
    ],
    "innerText": "Bhūmīti sāsavabhūmi anāsavabhūmi saṅkhatabhūmi asaṅkhatabhūmi dassanabhūmi bhāvanābhūmi puthujjanabhūmi sekkhabhūmi asekkhabhūmi sāvakabhūmi paccekabuddhabhūmi sammāsambuddhabhūmi jhānabhūmi asamāhitabhūmi paṭipajjamānabhūmi paṭipannabhūmi paṭhamābhūmi yāva catutthībhūmi kāmāvacarabhūmi yāva lokuttarabhūmīti bahuvidhā. Tattha sāsavabhūmi parittamahaggatā dhammā. Anāsavabhūmi appamāṇā dhammā. Saṅkhatabhūmi nibbānavajjā sabbe sabhāvadhammā. Asaṅkhatabhūmi appaccayā dhammā. Dassanabhūmi paṭhamamaggaphaladhammā. Bhāvanābhūmi avasiṭṭhamaggaphaladhammā. Puthujjanabhūmi hīnamajjhimā dhammā. Sekkhabhūmi cattāro ariyamaggadhammā heṭṭhimā ca tayo phaladhammā. Asekkhabhūmi aggaphaladhammā. Sāvakapaccekabuddhabuddhadhammā sāvakādibhūmiyo. Jhānabhūmi jhānadhammā. Asamāhitabhūmi jhānavajjitā dhammā. Paṭipajjamānabhūmi maggadhammā. Paṭipannabhūmi phaladhammā. Paṭhamādibhūmiyo saha phalena cattāro maggā apariyāpannā dhammā ‘‘paṭhamāya bhūmiyā pattiyā’’tiādivacanato. Kāmāvacarādibhūmiyo kāmāvacarādidhammā. Ye ca dhammā tesaṃ tesaṃ hāranayānaṃ patiṭṭhānabhāvena suttesu niddhārīyanti, tepi bhūmiyoti viññātabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upanisā"
      },
      "ti balavakāraṇaṃ, yo upanissayapaccayoti vuccati. Yañca sandhāya sutte ‘‘dukkhūpanisā saddhā saddhūpanisaṃ ‘sīla’nti yāva vimuttūpanisaṃ vimuttiñāṇadassana’’nti vuttaṃ. Api ca upanisāti tasmiṃ tasmiṃ samaye siddhante hadayabhūtaṃ abbhantaraṃ vuccati. Idhāpi nettihadayaṃ, yaṃ sammā pariggaṇhantā dhammakathikā tasmiṃ tasmiṃ sutte āgatadhammamukhena sabbahāranayayojanāya samatthā honti. Kiṃ panetaṃ nettihadayaṃ? Yadidaṃ etasseva tettiṃsavidhassa pakaraṇapadatthasoḷasassa aṭṭhavīsatividhapaṭṭhānavibhaṅgasahitassa visayo saha nimittavibhāgena asaṅkarato vavatthito."
    ],
    "innerText": "Upanisāti balavakāraṇaṃ, yo upanissayapaccayoti vuccati. Yañca sandhāya sutte ‘‘dukkhūpanisā saddhā saddhūpanisaṃ ‘sīla’nti yāva vimuttūpanisaṃ vimuttiñāṇadassana’’nti vuttaṃ. Api ca upanisāti tasmiṃ tasmiṃ samaye siddhante hadayabhūtaṃ abbhantaraṃ vuccati. Idhāpi nettihadayaṃ, yaṃ sammā pariggaṇhantā dhammakathikā tasmiṃ tasmiṃ sutte āgatadhammamukhena sabbahāranayayojanāya samatthā honti. Kiṃ panetaṃ nettihadayaṃ? Yadidaṃ etasseva tettiṃsavidhassa pakaraṇapadatthasoḷasassa aṭṭhavīsatividhapaṭṭhānavibhaṅgasahitassa visayo saha nimittavibhāgena asaṅkarato vavatthito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Seyyathidaṃ – desanāhārassa assādādayo visayo, tassa assādādivibhāvanalakkhaṇattā. Tassa assādo sukhaṃ somanassanti evamādivibhāgo, tassa nimittaṃ iṭṭhārammaṇādi, ayañca attho desanāhāravicayahāraniddesavaṇṇanāyaṃ vitthārato pakāsito eva. Sutte āgatadhammassa sabhāgavisabhāgadhammāvaṭṭanavisayo āvaṭṭahāro, tadubhayaāvaṭṭanalakkhaṇattā. Sutte āgatadhammānaṃ paccanīkadhammavisayo ",
      " parivattanahāro, paṭipakkhadhammaparivattanalakkhaṇattā. Padaṭṭhānaparikkhāresu āsannakāraṇaṃ upanissayakāraṇañca padaṭṭhānaṃ, hetu parikkhāroti ayametesaṃ viseso."
    ],
    "innerText": "Seyyathidaṃ – desanāhārassa assādādayo visayo, tassa assādādivibhāvanalakkhaṇattā. Tassa assādo sukhaṃ somanassanti evamādivibhāgo, tassa nimittaṃ iṭṭhārammaṇādi, ayañca attho desanāhāravicayahāraniddesavaṇṇanāyaṃ vitthārato pakāsito eva. Sutte āgatadhammassa sabhāgavisabhāgadhammāvaṭṭanavisayo āvaṭṭahāro, tadubhayaāvaṭṭanalakkhaṇattā. Sutte āgatadhammānaṃ paccanīkadhammavisayo parivattanahāro, paṭipakkhadhammaparivattanalakkhaṇattā. Padaṭṭhānaparikkhāresu āsannakāraṇaṃ upanissayakāraṇañca padaṭṭhānaṃ, hetu parikkhāroti ayametesaṃ viseso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabhāgavisabhāgadhammā"
      },
      " ca tesaṃ tesaṃ dhammānaṃ anukūlapaṭikūladhammā yathākkamaṃ veditabbā. Yathā – sammādiṭṭhiyā sammāsaṅkappo sabhāgo, micchāsaṅkappo visabhāgoti iminā nayena sabbaṃ sabhāgavisabhāgato veditabbaṃ."
    ],
    "innerText": "Sabhāgavisabhāgadhammā ca tesaṃ tesaṃ dhammānaṃ anukūlapaṭikūladhammā yathākkamaṃ veditabbā. Yathā – sammādiṭṭhiyā sammāsaṅkappo sabhāgo, micchāsaṅkappo visabhāgoti iminā nayena sabbaṃ sabhāgavisabhāgato veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lakkhaṇa"
      },
      "nti ",
      " sabhāvo. So hāranayānaṃ niddese vibhāvito eva."
    ],
    "innerText": "Lakkhaṇanti sabhāvo. So hāranayānaṃ niddese vibhāvito eva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yaṃ panetaṃ hetuādivisesavinimuttaṃ hāranayānaṃ yojanānibandhanaṃ, so nayo. Yathāha – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "lakkhaṇahāre"
      },
      " ‘‘evaṃ ye dhammā ekalakkhaṇā kiccato ca lakkhaṇato ca sāmaññato cā’’tiādi. Tathā vicayena hārena vicinitvā yuttihārena yojetabbāti. Tathā sodhanahārādīsu suddho ārambho hoti, so pañho vissajjito bhavatīti evamādi. Ekattādayopi nayā idha nayoti gahetabbā."
    ],
    "innerText": "Yaṃ panetaṃ hetuādivisesavinimuttaṃ hāranayānaṃ yojanānibandhanaṃ, so nayo. Yathāha – lakkhaṇahāre ‘‘evaṃ ye dhammā ekalakkhaṇā kiccato ca lakkhaṇato ca sāmaññato cā’’tiādi. Tathā vicayena hārena vicinitvā yuttihārena yojetabbāti. Tathā sodhanahārādīsu suddho ārambho hoti, so pañho vissajjito bhavatīti evamādi. Ekattādayopi nayā idha nayoti gahetabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ hetuphalādīni upadhāretvā nesaṃ vasena tattha tattha sutte labbhamānapadatthaniddhāraṇamukhena yathālakkhaṇaṃ ete hārā nayā ca yojetabbā. Visesato pana padaṭṭhānaparikkhārā hetuvasena. Desanāvicayacatubyūhasamāropanā hetuphalavasena. Tathā vevacanapaññattiotaraṇasodhanā phalavasenevāti keci. Vibhatti hetubhūmivasena. Parivatto visabhāgavasena. Āvaṭṭo sabhāgavisabhāgavasena. Lakkhaṇayuttiadhiṭṭhānā nayavasena yojetabbāti. Ettāvatā ca yaṃ vuttaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sāmaññato visesena, padattho lakkhaṇaṃ kamo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ettāvatā ca hetvādī, veditabbā hi viññunā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Ayaṃ gāthā vuttatthā hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Niddesavāravaṇṇanā niṭṭhitā."
  }
]