[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "6. Gatikathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "Gatikathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "231"
      },
      ". Idāni ",
      " tassā vimokkhuppattiyā hetubhūtaṃ hetusampattiṃ dassentena kathitāya gatikathāya apubbatthānuvaṇṇanā. Duhetukapaṭisandhikassāpi hi ‘‘natthi jhānaṃ apaññassā’’ti (dha. pa. 372) vacanato jhānampi na uppajjati, kiṃ ",
      " pana vimokkho. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gatisampattiyā"
      },
      "ti nirayatiracchānayonipettivisayamanussadevasaṅkhātāsu pañcasu gatīsu manussadevasaṅkhātāya gatisampattiyā. Etena purimā tisso gativipattiyo paṭikkhipati. Gatiyā sampatti gatisampatti, sugatīti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gatī"
      },
      "ti ca sahokāsā khandhā. Pañcasu ca gatīsu pettivisayaggahaṇeneva asurakāyopi gahito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Devā"
      },
      "ti cha kāmāvacaradevā brahmāno ca. Devaggahaṇena asurāpi saṅgahitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñāṇasampayutte"
      },
      "ti ñāṇasampayuttapaṭisandhikkhaṇe. Khaṇopi hi ñāṇasampayuttayogena teneva vohārena vuttoti veditabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Katinaṃ hetūna"
      },
      "nti alobhādosāmohahetūsu katinaṃ hetūnaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upapattī"
      },
      "ti upapajjanaṃ, nibbattīti attho."
    ],
    "innerText": "231. Idāni tassā vimokkhuppattiyā hetubhūtaṃ hetusampattiṃ dassentena kathitāya gatikathāya apubbatthānuvaṇṇanā. Duhetukapaṭisandhikassāpi hi ‘‘natthi jhānaṃ apaññassā’’ti (dha. pa. 372) vacanato jhānampi na uppajjati, kiṃ pana vimokkho. Tattha gatisampattiyāti nirayatiracchānayonipettivisayamanussadevasaṅkhātāsu pañcasu gatīsu manussadevasaṅkhātāya gatisampattiyā. Etena purimā tisso gativipattiyo paṭikkhipati. Gatiyā sampatti gatisampatti, sugatīti vuttaṃ hoti. Gatīti ca sahokāsā khandhā. Pañcasu ca gatīsu pettivisayaggahaṇeneva asurakāyopi gahito. Devāti cha kāmāvacaradevā brahmāno ca. Devaggahaṇena asurāpi saṅgahitā. Ñāṇasampayutteti ñāṇasampayuttapaṭisandhikkhaṇe. Khaṇopi hi ñāṇasampayuttayogena teneva vohārena vuttoti veditabbo. Katinaṃ hetūnanti alobhādosāmohahetūsu katinaṃ hetūnaṃ. Upapattīti upapajjanaṃ, nibbattīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yasmā pana suddakulajātāpi tihetukā honti, tasmā te sandhāya paṭhamapucchā. Yasmā ca yebhuyyena mahāpuññā tīsu mahāsālakulesu jāyanti, tasmā tesaṃ tiṇṇaṃ kulānaṃ vasena tisso pucchā. Pāṭho pana saṅkhitto. Mahatī sālā etesanti mahāsālā, mahāgharā mahāvibhavāti attho. Atha vā mahā sāro etesanti mahāsārāti vattabbe ra-kārassa la-kāraṃ katvā ‘‘mahāsālā’’ti vuttaṃ. Khattiyā mahāsālā, khattiyesu vā mahāsālāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "khattiyamahāsālā"
      },
      ". Sesesupi eseva nayo. Tattha yassa khattiyassa gehe pacchimantena koṭisataṃ dhanaṃ nidhānagataṃ hoti, kahāpaṇānañca vīsati ambaṇāni divasaṃ valañje nikkhamanti, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "khattiyamahāsālo"
      },
      " nāma. Yassa brāhmaṇassa gehe pacchimantena asītikoṭidhanaṃ nidhānagataṃ hoti, kahāpaṇānañca dasa ambaṇāni divasaṃ valañje nikkhamanti, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "brāhmaṇamahāsālo"
      },
      " nāma. Yassa gahapatissa gehe pacchimantena cattālīsakoṭidhanaṃ nidhānagataṃ hoti, kahāpaṇānañca pañca ambaṇāni divasaṃ valañje nikkhamanti, ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gahapatimahāsālo"
      },
      " nāma."
    ],
    "innerText": "Yasmā pana suddakulajātāpi tihetukā honti, tasmā te sandhāya paṭhamapucchā. Yasmā ca yebhuyyena mahāpuññā tīsu mahāsālakulesu jāyanti, tasmā tesaṃ tiṇṇaṃ kulānaṃ vasena tisso pucchā. Pāṭho pana saṅkhitto. Mahatī sālā etesanti mahāsālā, mahāgharā mahāvibhavāti attho. Atha vā mahā sāro etesanti mahāsārāti vattabbe ra-kārassa la-kāraṃ katvā ‘‘mahāsālā’’ti vuttaṃ. Khattiyā mahāsālā, khattiyesu vā mahāsālāti khattiyamahāsālā. Sesesupi eseva nayo. Tattha yassa khattiyassa gehe pacchimantena koṭisataṃ dhanaṃ nidhānagataṃ hoti, kahāpaṇānañca vīsati ambaṇāni divasaṃ valañje nikkhamanti, ayaṃ khattiyamahāsālo nāma. Yassa brāhmaṇassa gehe pacchimantena asītikoṭidhanaṃ nidhānagataṃ hoti, kahāpaṇānañca dasa ambaṇāni divasaṃ valañje nikkhamanti, ayaṃ brāhmaṇamahāsālo nāma. Yassa gahapatissa gehe pacchimantena cattālīsakoṭidhanaṃ nidhānagataṃ hoti, kahāpaṇānañca pañca ambaṇāni divasaṃ valañje nikkhamanti, ayaṃ gahapatimahāsālo nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Rūpāvacarānaṃ ",
      " arūpāvacarānañca ekantatihetukattā ‘‘ñāṇasampayutte’’ti na vuttaṃ, manussesu pana duhetukāhetukānañca sabbhāvato, kāmāvacaresu devesu duhetukānañca sabbhāvato sesesu ‘‘ñāṇasampayutte’’ti vuttaṃ. Ettha ca kāmāvacaradevā pañcakāmaguṇaratiyā ",
      " kīḷanti, sarīrajutiyā ca jotantīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "devā,"
      },
      " rūpāvacarabrahmāno jhānaratiyā kīḷanti ",
      ", sarīrajutiyā ca jotantīti devā, arūpāvacarabrahmāno jhānaratiyā kīḷanti, ñāṇajutiyā ca jotantīti devā."
    ],
    "innerText": "Rūpāvacarānaṃ arūpāvacarānañca ekantatihetukattā ‘‘ñāṇasampayutte’’ti na vuttaṃ, manussesu pana duhetukāhetukānañca sabbhāvato, kāmāvacaresu devesu duhetukānañca sabbhāvato sesesu ‘‘ñāṇasampayutte’’ti vuttaṃ. Ettha ca kāmāvacaradevā pañcakāmaguṇaratiyā kīḷanti, sarīrajutiyā ca jotantīti devā, rūpāvacarabrahmāno jhānaratiyā kīḷanti , sarīrajutiyā ca jotantīti devā, arūpāvacarabrahmāno jhānaratiyā kīḷanti, ñāṇajutiyā ca jotantīti devā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "232"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kusalakammassa javanakkhaṇe"
      },
      "ti atītajātiyā idha tihetukapaṭisandhijanakassa tihetukakāmāvacarakusalakammassa ca javanavīthiyaṃ punappunaṃ uppattivasena sattavāraṃ javanakkhaṇe, pavattanakāleti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tayo hetū kusalā"
      },
      "ti alobho kusalahetu adoso kusalahetu amoho kusalahetu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasmiṃ khaṇe jātacetanāyā"
      },
      "ti tasmiṃ vuttakkhaṇeyeva jātāya kusalacetanāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahajātapaccayā hontī"
      },
      "ti uppajjamānā ca sahauppādanabhāvena upakārakā honti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tena vuccatī"
      },
      "ti tena sahajātapaccayabhāveneva vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kusalamūlapaccayāpi saṅkhārā"
      },
      "ti ekacittakkhaṇikapaccayākāranayena vuttaṃ. ‘‘Saṅkhārā’’ti ca bahuvacanena tattha saṅkhārakkhandhasaṅgahitā sabbe cetasikā gahitāti veditabbaṃ. Apisaddena saṅkhārapaccayāpi kusalamūlānītipi vuttaṃ hoti."
    ],
    "innerText": "232.Kusalakammassa javanakkhaṇeti atītajātiyā idha tihetukapaṭisandhijanakassa tihetukakāmāvacarakusalakammassa ca javanavīthiyaṃ punappunaṃ uppattivasena sattavāraṃ javanakkhaṇe, pavattanakāleti attho. Tayo hetū kusalāti alobho kusalahetu adoso kusalahetu amoho kusalahetu. Tasmiṃ khaṇe jātacetanāyāti tasmiṃ vuttakkhaṇeyeva jātāya kusalacetanāya. Sahajātapaccayā hontīti uppajjamānā ca sahauppādanabhāvena upakārakā honti. Tena vuccatīti tena sahajātapaccayabhāveneva vuccati. Kusalamūlapaccayāpi saṅkhārāti ekacittakkhaṇikapaccayākāranayena vuttaṃ. ‘‘Saṅkhārā’’ti ca bahuvacanena tattha saṅkhārakkhandhasaṅgahitā sabbe cetasikā gahitāti veditabbaṃ. Apisaddena saṅkhārapaccayāpi kusalamūlānītipi vuttaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nikantikkhaṇe"
      },
      "ti attano vipākaṃ dātuṃ paccupaṭṭhitakamme vā tathā paccupaṭṭhitakammena upaṭṭhāpite kammanimitte vā gatinimitte vā uppajjamānānaṃ nikantikkhaṇe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nikantī"
      },
      "ti nikāmanā patthanā. Āsannamaraṇassa hi mohena ākulacittattā avīcijālāyapi nikanti uppajjati, kiṃ pana sesesu nimittesu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dve hetū"
      },
      "ti lobho akusalahetu moho akusalahetu. Bhavanikanti pana paṭisandhianantaraṃ pavattabhavaṅgavīthito vuṭṭhitamattasseva attano khandhasantānaṃ ārabbha sabbesampi uppajjati. ‘‘Yassa vā pana yattha akusalā dhammā na uppajjittha, tassa tattha kusalā dhammā na uppajjitthāti āmantā’’ti evamādi idameva sandhāya vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasmiṃ khaṇe jātacetanāyā"
      },
      "ti akusalacetanāya."
    ],
    "innerText": "Nikantikkhaṇeti attano vipākaṃ dātuṃ paccupaṭṭhitakamme vā tathā paccupaṭṭhitakammena upaṭṭhāpite kammanimitte vā gatinimitte vā uppajjamānānaṃ nikantikkhaṇe. Nikantīti nikāmanā patthanā. Āsannamaraṇassa hi mohena ākulacittattā avīcijālāyapi nikanti uppajjati, kiṃ pana sesesu nimittesu. Dve hetūti lobho akusalahetu moho akusalahetu. Bhavanikanti pana paṭisandhianantaraṃ pavattabhavaṅgavīthito vuṭṭhitamattasseva attano khandhasantānaṃ ārabbha sabbesampi uppajjati. ‘‘Yassa vā pana yattha akusalā dhammā na uppajjittha, tassa tattha kusalā dhammā na uppajjitthāti āmantā’’ti evamādi idameva sandhāya vuttaṃ. Tasmiṃ khaṇe jātacetanāyāti akusalacetanāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭisandhikkhaṇe"
      },
      "ti tena kammena gahitapaṭisandhikkhaṇe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tayo hetū"
      },
      "ti alobho abyākatahetu adoso abyākatahetu amoho abyākatahetu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasmiṃ khaṇe jātacetanāyā"
      },
      "ti vipākābyākatacetanāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nāmarūpapaccayāpi viññāṇa"
      },
      "nti ettha tasmiṃ paṭisandhikkhaṇe tayo vipākahetū sesacetasikā ca nāmaṃ, hadayavatthu rūpaṃ. Tato ",
      " nāmarūpapaccayatopi paṭisandhiviññāṇaṃ pavattati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Viññāṇapaccayāpi nāmarūpa"
      },
      "nti etthāpi nāmaṃ vuttappakārameva, rūpaṃ pana idha sahetukamanussapaṭisandhiyā adhippetattā gabbhaseyyakānaṃ vatthudasakaṃ kāyadasakaṃ bhāvadasakanti ",
      " samatiṃsa rūpāni, saṃsedajānaṃ opapātikānañca paripuṇṇāyatanānaṃ cakkhudasakaṃ sotadasakaṃ ghānadasakaṃ jivhādasakañcāti samasattati rūpāni. Taṃ vuttappakāraṃ nāmarūpaṃ paṭisandhikkhaṇe paṭisandhiviññāṇapaccayā pavattati."
    ],
    "innerText": "Paṭisandhikkhaṇeti tena kammena gahitapaṭisandhikkhaṇe. Tayo hetūti alobho abyākatahetu adoso abyākatahetu amoho abyākatahetu. Tasmiṃ khaṇe jātacetanāyāti vipākābyākatacetanāya. Nāmarūpapaccayāpi viññāṇanti ettha tasmiṃ paṭisandhikkhaṇe tayo vipākahetū sesacetasikā ca nāmaṃ, hadayavatthu rūpaṃ. Tato nāmarūpapaccayatopi paṭisandhiviññāṇaṃ pavattati. Viññāṇapaccayāpi nāmarūpanti etthāpi nāmaṃ vuttappakārameva, rūpaṃ pana idha sahetukamanussapaṭisandhiyā adhippetattā gabbhaseyyakānaṃ vatthudasakaṃ kāyadasakaṃ bhāvadasakanti samatiṃsa rūpāni, saṃsedajānaṃ opapātikānañca paripuṇṇāyatanānaṃ cakkhudasakaṃ sotadasakaṃ ghānadasakaṃ jivhādasakañcāti samasattati rūpāni. Taṃ vuttappakāraṃ nāmarūpaṃ paṭisandhikkhaṇe paṭisandhiviññāṇapaccayā pavattati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañcakkhandhā"
      },
      "ti ",
      " ettha paṭisandhicittena paṭisandhikkhaṇe labbhamānāni rūpāni rūpakkhandho, sahajātā vedanā vedanākkhandho, saññā saññākkhandho, sesacetasikā saṅkhārakkhandho, paṭisandhicittaṃ viññāṇakkhandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahajātapaccayā hontī"
      },
      "ti cattāro arūpino khandhā aññamaññaṃ sahajātapaccayā honti, rūpakkhandhe cattāro mahābhūtā aññamaññaṃ sahajātapaccayā honti, arūpino khandhā ca hadayarūpañca aññamaññaṃ sahajātapaccayā honti, mahābhūtāpi upādārūpānaṃ sahajātapaccayā honti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aññamaññapaccayā hontī"
      },
      "ti aññamaññaṃ uppādanupatthambhanabhāvena upakārakā honti, cattāro arūpino khandhā ca aññamaññapaccayā honti, cattāro mahābhūtā aññamaññapaccayā honti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nissayapaccayā hontī"
      },
      "ti adhiṭṭhānākārena nissayākārena ca upakārakā honti, cattāro arūpino khandhā ca aññamaññaṃ nissayapaccayā hontīti sahajātā viya vitthāretabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vippayuttapaccayā hontī"
      },
      "ti ekavatthukādibhāvānupagamanena vippayuttabhāvena upakārakā honti, arūpino khandhā paṭisandhirūpānaṃ vippayuttapaccayā honti, hadayarūpaṃ arūpīnaṃ khandhānaṃ vippayuttapaccayo hoti. ‘‘Pañcakkhandhā’’ti hettha evaṃ yathālābhavasena vuttaṃ."
    ],
    "innerText": "Pañcakkhandhāti ettha paṭisandhicittena paṭisandhikkhaṇe labbhamānāni rūpāni rūpakkhandho, sahajātā vedanā vedanākkhandho, saññā saññākkhandho, sesacetasikā saṅkhārakkhandho, paṭisandhicittaṃ viññāṇakkhandho. Sahajātapaccayā hontīti cattāro arūpino khandhā aññamaññaṃ sahajātapaccayā honti, rūpakkhandhe cattāro mahābhūtā aññamaññaṃ sahajātapaccayā honti, arūpino khandhā ca hadayarūpañca aññamaññaṃ sahajātapaccayā honti, mahābhūtāpi upādārūpānaṃ sahajātapaccayā honti. Aññamaññapaccayā hontīti aññamaññaṃ uppādanupatthambhanabhāvena upakārakā honti, cattāro arūpino khandhā ca aññamaññapaccayā honti, cattāro mahābhūtā aññamaññapaccayā honti. Nissayapaccayā hontīti adhiṭṭhānākārena nissayākārena ca upakārakā honti, cattāro arūpino khandhā ca aññamaññaṃ nissayapaccayā hontīti sahajātā viya vitthāretabbā. Vippayuttapaccayā hontīti ekavatthukādibhāvānupagamanena vippayuttabhāvena upakārakā honti, arūpino khandhā paṭisandhirūpānaṃ vippayuttapaccayā honti, hadayarūpaṃ arūpīnaṃ khandhānaṃ vippayuttapaccayo hoti. ‘‘Pañcakkhandhā’’ti hettha evaṃ yathālābhavasena vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cattāro mahābhūtā"
      },
      "ti ettha tayo paccayā paṭhamaṃ vuttāyeva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tayo jīvitasaṅkhārā"
      },
      "ti āyu ca usmā ca viññāṇañca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āyū"
      },
      "ti rūpajīvitindriyaṃ arūpajīvitindriyañca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Usmā"
      },
      "ti tejodhātu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Viññāṇa"
      },
      "nti paṭisandhiviññāṇaṃ. Etāni hi uparūpari jīvitasaṅkhāraṃ saṅkharonti pavattentīti jīvitasaṅkhārā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahajātapaccayā hontī"
      },
      "ti arūpajīvitindriyaṃ paṭisandhiviññāṇañca sampayuttakānaṃ khandhānañca hadayarūpassa ca aññamaññasahajātapaccayā honti, tejodhātu tiṇṇaṃ mahābhūtānaṃ aññamaññasahajātapaccayo hoti, upādārūpānaṃ sahajātapaccayova, rūpajīvitindriyaṃ ",
      " sahajātarūpānaṃ pariyāyena sahajātapaccayo hotīti veditabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aññamaññapaccayā honti, nissayapaccayā hontī"
      },
      "ti dvayaṃ arūpajīvitindriyaṃ paṭisandhiviññāṇañca sampayuttakhandhānaṃ aññamaññapaccayā honti. Aññamaññanissayapaccayā hontīti vuttanayeneva yojetvā veditabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vippayuttapaccayā hontī"
      },
      "ti arūpajīvitindriyaṃ paṭisandhiviññāṇañca paṭisandhirūpānaṃ vippayuttapaccayā honti. Rūpajīvitindriyaṃ pana aññamaññanissayavippayuttapaccayatte na yujjati. Tasmā ‘‘tayo jīvitasaṅkhārā’’ti yathālābhavasena ",
      " vuttaṃ. Nāmañca rūpañca vuttanayeneva catupaccayatte yojetabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cuddasa"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammā"
      },
      "ti pañcakkhandhā, cattāro mahābhūtā, tayo jīvitasaṅkhārā, nāmañca rūpañcāti evaṃ gaṇanāvasena cuddasa dhammā. Tesañca upari aññesañca sahajātādipaccayabhāvo vuttanayo eva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sampayuttapaccayā hontī"
      },
      "ti puna ekavatthukaekārammaṇaekuppādaekanirodhasaṅkhātena sampayuttabhāvena upakārakā honti."
    ],
    "innerText": "Cattāro mahābhūtāti ettha tayo paccayā paṭhamaṃ vuttāyeva. Tayo jīvitasaṅkhārāti āyu ca usmā ca viññāṇañca. Āyūti rūpajīvitindriyaṃ arūpajīvitindriyañca. Usmāti tejodhātu. Viññāṇanti paṭisandhiviññāṇaṃ. Etāni hi uparūpari jīvitasaṅkhāraṃ saṅkharonti pavattentīti jīvitasaṅkhārā. Sahajātapaccayā hontīti arūpajīvitindriyaṃ paṭisandhiviññāṇañca sampayuttakānaṃ khandhānañca hadayarūpassa ca aññamaññasahajātapaccayā honti, tejodhātu tiṇṇaṃ mahābhūtānaṃ aññamaññasahajātapaccayo hoti, upādārūpānaṃ sahajātapaccayova, rūpajīvitindriyaṃ sahajātarūpānaṃ pariyāyena sahajātapaccayo hotīti veditabbaṃ. Aññamaññapaccayā honti, nissayapaccayā hontīti dvayaṃ arūpajīvitindriyaṃ paṭisandhiviññāṇañca sampayuttakhandhānaṃ aññamaññapaccayā honti. Aññamaññanissayapaccayā hontīti vuttanayeneva yojetvā veditabbaṃ. Vippayuttapaccayā hontīti arūpajīvitindriyaṃ paṭisandhiviññāṇañca paṭisandhirūpānaṃ vippayuttapaccayā honti. Rūpajīvitindriyaṃ pana aññamaññanissayavippayuttapaccayatte na yujjati. Tasmā ‘‘tayo jīvitasaṅkhārā’’ti yathālābhavasena vuttaṃ. Nāmañca rūpañca vuttanayeneva catupaccayatte yojetabbaṃ. Cuddasadhammāti pañcakkhandhā, cattāro mahābhūtā, tayo jīvitasaṅkhārā, nāmañca rūpañcāti evaṃ gaṇanāvasena cuddasa dhammā. Tesañca upari aññesañca sahajātādipaccayabhāvo vuttanayo eva. Sampayuttapaccayā hontīti puna ekavatthukaekārammaṇaekuppādaekanirodhasaṅkhātena sampayuttabhāvena upakārakā honti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañcindriyānī"
      },
      "ti saddhindriyādīni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nāmañcā"
      },
      "ti idha vedanādayo tayo khandhā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Viññāṇañcā"
      },
      "ti paṭisandhiviññāṇaṃ. Puna ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cuddasa dhammā"
      },
      "ti cattāro khandhā, pañcindriyāni, tayo hetū, nāmañca viññāṇañcāti evaṃ gaṇanāvasena cuddasa dhammā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭhavīsati dhammā"
      },
      "ti purimā ca cuddasa, ime ca cuddasāti aṭṭhavīsati. Idha rūpassāpi paviṭṭhattā sampayuttapaccayaṃ apanetvā vippayuttapaccayo vutto."
    ],
    "innerText": "Pañcindriyānīti saddhindriyādīni. Nāmañcāti idha vedanādayo tayo khandhā. Viññāṇañcāti paṭisandhiviññāṇaṃ. Puna cuddasa dhammāti cattāro khandhā, pañcindriyāni, tayo hetū, nāmañca viññāṇañcāti evaṃ gaṇanāvasena cuddasa dhammā. Aṭṭhavīsati dhammāti purimā ca cuddasa, ime ca cuddasāti aṭṭhavīsati. Idha rūpassāpi paviṭṭhattā sampayuttapaccayaṃ apanetvā vippayuttapaccayo vutto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ paṭisandhikkhaṇe vijjamānassa tassa tassa paccayuppannassa dhammassa taṃ taṃ paccayabhedaṃ dassetvā paṭhamaṃ niddiṭṭhe hetū nigametvā dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "imesaṃ aṭṭhannaṃ hetūnaṃ paccayā upapatti hotī"
      },
      "ti āha. Kammāyūhanakkhaṇe tayo kusalahetū, nikantikkhaṇe dve akusalahetū, paṭisandhikkhaṇe tayo abyākatahetūti evaṃ aṭṭha hetū. Tattha tayo kusalahetū, dve akusalahetū ca idha paṭisandhikkhaṇe pavattiyā upanissayapaccayā honti. Tayo abyākatahetū yathāyogaṃ hetupaccayasahajātapaccayavasena paccayā honti. Sesavāresupi eseva nayo."
    ],
    "innerText": "Evaṃ paṭisandhikkhaṇe vijjamānassa tassa tassa paccayuppannassa dhammassa taṃ taṃ paccayabhedaṃ dassetvā paṭhamaṃ niddiṭṭhe hetū nigametvā dassento imesaṃ aṭṭhannaṃ hetūnaṃ paccayā upapatti hotīti āha. Kammāyūhanakkhaṇe tayo kusalahetū, nikantikkhaṇe dve akusalahetū, paṭisandhikkhaṇe tayo abyākatahetūti evaṃ aṭṭha hetū. Tattha tayo kusalahetū, dve akusalahetū ca idha paṭisandhikkhaṇe pavattiyā upanissayapaccayā honti. Tayo abyākatahetū yathāyogaṃ hetupaccayasahajātapaccayavasena paccayā honti. Sesavāresupi eseva nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Arūpāvacarānaṃ pana rūpābhāvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nāmapaccayāpi viññāṇaṃ, viññāṇapaccayāpi nāma"
      },
      "nti vuttaṃ. Rūpamissakacuddasakopi ca parihīno. Tassa parihīnattā ‘‘aṭṭhavīsati dhammā’’ti vāro ca na labbhati."
    ],
    "innerText": "Arūpāvacarānaṃ pana rūpābhāvā nāmapaccayāpi viññāṇaṃ, viññāṇapaccayāpi nāmanti vuttaṃ. Rūpamissakacuddasakopi ca parihīno. Tassa parihīnattā ‘‘aṭṭhavīsati dhammā’’ti vāro ca na labbhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "233"
      },
      ". Idāni ",
      " vimokkhassa paccayabhūtaṃ tihetukapaṭisandhiṃ dassetvā teneva sambandhena duhetukapaṭisandhivisesañca dassetukāmo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gatisampattiyā ñāṇavippayutte"
      },
      "tiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kusalakammassa javanakkhaṇe"
      },
      "ti atītajātiyā idha paṭisandhijanakassa duhetukakusalakammassa vuttanayeneva javanakkhaṇe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dve hetū"
      },
      "ti ñāṇavippayuttattā alobho kusalahetu adoso kusalahetu. Dve abyākatahetūpi alobhādosāyeva."
    ],
    "innerText": "233. Idāni vimokkhassa paccayabhūtaṃ tihetukapaṭisandhiṃ dassetvā teneva sambandhena duhetukapaṭisandhivisesañca dassetukāmo gatisampattiyā ñāṇavippayuttetiādimāha. Kusalakammassa javanakkhaṇeti atītajātiyā idha paṭisandhijanakassa duhetukakusalakammassa vuttanayeneva javanakkhaṇe. Dve hetūti ñāṇavippayuttattā alobho kusalahetu adoso kusalahetu. Dve abyākatahetūpi alobhādosāyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cattāri indriyānī"
      },
      "ti paññindriyavajjāni saddhindriyādīni cattāri. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dvādasa dhammā"
      },
      "ti ",
      " paññindriyassa ",
      " amohahetussa ca parihīnattā dvādasa. Tesaṃ dvinnaṃyeva parihīnattā chabbīsati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Channaṃ hetūna"
      },
      "nti dvinnaṃ kusalahetūnaṃ, dvinnaṃ akusalahetūnaṃ, dvinnaṃ vipākahetūnanti evaṃ channaṃ hetūnaṃ. Rūpārūpāvacarā panettha ekantatihetukattā na gahitā. Sesaṃ paṭhamavāre vuttanayeneva veditabbaṃ. Imasmiṃ vāre duhetukapaṭisandhiyā duhetukakammasseva vuttattā tihetukakammena duhetukapaṭisandhi na hotīti vuttaṃ hoti. Tasmā yaṃ dhammasaṅgahaṭṭhakathāyaṃ (dha. sa. aṭṭha. 498) tipiṭakamahādhammarakkhitattheravāde ‘‘tihetukakammena paṭisandhi tihetukāva hoti, duhetukāhetukā na hoti. Duhetukakammena duhetukāhetukā hoti, tihetukā na hotī’’ti vuttaṃ, taṃ imāya pāḷiyā sameti. Yaṃ pana tipiṭakacūḷanāgattherassa ca moravāpivāsimahādattattherassa ca vādesu ‘‘tihetukakammena paṭisandhi tihetukāpi hoti duhetukāpi, ahetukā na hoti. Duhetukakammena duhetukāpi hoti ahetukāpi, tihetukā na hotī’’ti vuttaṃ, taṃ imāya pāḷiyā viruddhaṃ viya dissati. Imissā kathāya hetuadhikārattā ahetukapaṭisandhi na vuttāti."
    ],
    "innerText": "Cattāri indriyānīti paññindriyavajjāni saddhindriyādīni cattāri. Dvādasa dhammāti paññindriyassa amohahetussa ca parihīnattā dvādasa. Tesaṃ dvinnaṃyeva parihīnattā chabbīsati. Channaṃ hetūnanti dvinnaṃ kusalahetūnaṃ, dvinnaṃ akusalahetūnaṃ, dvinnaṃ vipākahetūnanti evaṃ channaṃ hetūnaṃ. Rūpārūpāvacarā panettha ekantatihetukattā na gahitā. Sesaṃ paṭhamavāre vuttanayeneva veditabbaṃ. Imasmiṃ vāre duhetukapaṭisandhiyā duhetukakammasseva vuttattā tihetukakammena duhetukapaṭisandhi na hotīti vuttaṃ hoti. Tasmā yaṃ dhammasaṅgahaṭṭhakathāyaṃ (dha. sa. aṭṭha. 498) tipiṭakamahādhammarakkhitattheravāde ‘‘tihetukakammena paṭisandhi tihetukāva hoti, duhetukāhetukā na hoti. Duhetukakammena duhetukāhetukā hoti, tihetukā na hotī’’ti vuttaṃ, taṃ imāya pāḷiyā sameti. Yaṃ pana tipiṭakacūḷanāgattherassa ca moravāpivāsimahādattattherassa ca vādesu ‘‘tihetukakammena paṭisandhi tihetukāpi hoti duhetukāpi, ahetukā na hoti. Duhetukakammena duhetukāpi hoti ahetukāpi, tihetukā na hotī’’ti vuttaṃ, taṃ imāya pāḷiyā viruddhaṃ viya dissati. Imissā kathāya hetuadhikārattā ahetukapaṭisandhi na vuttāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Gatikathāvaṇṇanā niṭṭhitā."
  }
]