[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "17. Supāricariyavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Supāricariyattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Padumo"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nāma nāmenā"
      },
      "tiādikaṃ āyasmato supāricariyattherassa apadānaṃ. Ayampi purimamunipuṅgavesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto padumuttarassa bhagavato kāle yakkhayoniyaṃ nibbatto himavati yakkhasamāgamaṃ gato bhagavato devayakkhagandhabbanāgānaṃ dhammadesanaṃ sutvā pasannamānaso ubho hatthe ābhujitvā apphoṭesi namassi ca. So tena puññena tato cuto upari devaloke uppanno tattha dibbasukhaṃ anubhavitvā manussesu ca cakkavatiādisampattiyo anubhavitvā imasmiṃ buddhuppāde sāvatthiyaṃ gahapatikule nibbatto aḍḍho mahaddhano mahābhogo ratanattaye pasanno satthu dhammadesanaṃ sutvā saddhājāto pabbajitvā nacirasseva arahattaṃ pāpuṇi."
    ],
    "innerText": "Padumonāma nāmenātiādikaṃ āyasmato supāricariyattherassa apadānaṃ. Ayampi purimamunipuṅgavesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto padumuttarassa bhagavato kāle yakkhayoniyaṃ nibbatto himavati yakkhasamāgamaṃ gato bhagavato devayakkhagandhabbanāgānaṃ dhammadesanaṃ sutvā pasannamānaso ubho hatthe ābhujitvā apphoṭesi namassi ca. So tena puññena tato cuto upari devaloke uppanno tattha dibbasukhaṃ anubhavitvā manussesu ca cakkavatiādisampattiyo anubhavitvā imasmiṃ buddhuppāde sāvatthiyaṃ gahapatikule nibbatto aḍḍho mahaddhano mahābhogo ratanattaye pasanno satthu dhammadesanaṃ sutvā saddhājāto pabbajitvā nacirasseva arahattaṃ pāpuṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      ". So ekadivasaṃ attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "padumo nāma nāmenā"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "padumo"
      },
      "ti yassa pādanikkhepasamaye pathaviṃ bhinditvā padumaṃ uggantvā pādatalaṃ sampaṭicchati, tena saññāṇena so bhagavā padumoti saṅkhaṃ gato, idha padumuttaro bhagavā adhippeto. So bhagavā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pavanā"
      },
      " vasanavihārā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhinikkhamma"
      },
      " vanamajjhaṃ pavisitvā dhammaṃ desetīti sambandho."
    ],
    "innerText": "1. So ekadivasaṃ attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento padumo nāma nāmenātiādimāha. Tattha padumoti yassa pādanikkhepasamaye pathaviṃ bhinditvā padumaṃ uggantvā pādatalaṃ sampaṭicchati, tena saññāṇena so bhagavā padumoti saṅkhaṃ gato, idha padumuttaro bhagavā adhippeto. So bhagavā pavanā vasanavihārā abhinikkhamma vanamajjhaṃ pavisitvā dhammaṃ desetīti sambandho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yakkhānaṃ samayo"
      },
      "ti devānaṃ samāgamo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āsi"
      },
      " ahosīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ajjhāpekkhiṃsu tāvade"
      },
      "ti tasmiṃ desanākāle adhiapekkhiṃsu, visesena passanasīlā ahesunti attho. Sesaṃ pākaṭamevāti."
    ],
    "innerText": "Yakkhānaṃ samayoti devānaṃ samāgamo āsi ahosīti attho. Ajjhāpekkhiṃsu tāvadeti tasmiṃ desanākāle adhiapekkhiṃsu, visesena passanasīlā ahesunti attho. Sesaṃ pākaṭamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Supāricariyattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Kaṇaverapupphiyattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Siddhattho"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nāma bhagavā"
      },
      "tiādikaṃ āyasmato kaṇaverapupphiyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro siddhatthassa bhagavato kāle suddakule nibbatto vuddhimanvāya ",
      " rañño antepurapālako ahosi. Tasmiṃ samaye siddhattho bhagavā bhikkhusaṅghaparivuto rājavīthiṃ paṭipajji. Atha so antepurapālako caramānaṃ bhagavantaṃ disvā pasannamānaso hutvā kaṇaverapupphena bhagavantaṃ pūjetvā namassamāno aṭṭhāsi. So tena puññena sugatisampattiyoyeva anubhavitvā imasmiṃ buddhuppāde ekasmiṃ kule nibbattitvā vuddhippatto satthu dhammadesanaṃ sutvā paṭiladdhasaddho pabbajitvā nacirasseva arahā ahosi."
    ],
    "innerText": "Siddhatthonāma bhagavātiādikaṃ āyasmato kaṇaverapupphiyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro siddhatthassa bhagavato kāle suddakule nibbatto vuddhimanvāya rañño antepurapālako ahosi. Tasmiṃ samaye siddhattho bhagavā bhikkhusaṅghaparivuto rājavīthiṃ paṭipajji. Atha so antepurapālako caramānaṃ bhagavantaṃ disvā pasannamānaso hutvā kaṇaverapupphena bhagavantaṃ pūjetvā namassamāno aṭṭhāsi. So tena puññena sugatisampattiyoyeva anubhavitvā imasmiṃ buddhuppāde ekasmiṃ kule nibbattitvā vuddhippatto satthu dhammadesanaṃ sutvā paṭiladdhasaddho pabbajitvā nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "7"
      },
      ". So pattaaggaphalo pubbe katakusalaṃ saritvā sañjātasomanasso pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "siddhattho nāma bhagavā"
      },
      "tiādimāha. Taṃ sabbaṃ heṭṭhā vuttattā uttānatthamevāti."
    ],
    "innerText": "7. So pattaaggaphalo pubbe katakusalaṃ saritvā sañjātasomanasso pubbacaritāpadānaṃ pakāsento siddhattho nāma bhagavātiādimāha. Taṃ sabbaṃ heṭṭhā vuttattā uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Kaṇaverapupphiyattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Khajjakadāyakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tissassa kho bhagavato"
      },
      "tiādikaṃ āyasmato khajjakadāyakattherassa apadānaṃ. Ayampi purimajinavaresu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto tissassa bhagavato kāle ",
      " suddakule nibbatto bhagavantaṃ disvā pasannamānaso ambajambuādimanekaṃ madhuraphalāphalaṃ nāḷikeraṃ pūvakhajjakañca adāsi. Bhagavā tassa pasādavaḍḍhanatthāya passantasseva paribhuñji. So tena puññena sugatisampattiyoyeva anubhavitvā imasmiṃ buddhuppāde sāvatthiyaṃ kulagehe nibbatto viññutaṃ patvā satthu dhammadesanaṃ sutvā sañjātasaddho pasādabahumāno pabbajitvā vattapaṭipattiyā sāsanaṃ sobhento sīlālaṅkārapaṭimaṇḍito nacirasseva arahattaṃ pāpuṇi."
    ],
    "innerText": "Tissassa kho bhagavatotiādikaṃ āyasmato khajjakadāyakattherassa apadānaṃ. Ayampi purimajinavaresu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto tissassa bhagavato kāle suddakule nibbatto bhagavantaṃ disvā pasannamānaso ambajambuādimanekaṃ madhuraphalāphalaṃ nāḷikeraṃ pūvakhajjakañca adāsi. Bhagavā tassa pasādavaḍḍhanatthāya passantasseva paribhuñji. So tena puññena sugatisampattiyoyeva anubhavitvā imasmiṃ buddhuppāde sāvatthiyaṃ kulagehe nibbatto viññutaṃ patvā satthu dhammadesanaṃ sutvā sañjātasaddho pasādabahumāno pabbajitvā vattapaṭipattiyā sāsanaṃ sobhento sīlālaṅkārapaṭimaṇḍito nacirasseva arahattaṃ pāpuṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "13"
      },
      ". So pubbakammaṃ saranto ‘‘pubbe mayā sukhette kusalaṃ kataṃ sundara’’nti somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tissassa kho bhagavato"
      },
      "tiādimāha. Tattha tissopi bhavasampattiyo dadamāno jātoti mātāpitūhi katanāmavasena tisso. Atha vā tīhi ",
      " saraṇagamanehi assāsento ovadanto hetusampannapuggale saggamokkhadvaye patiṭṭhāpento buddho jātoti tisso. Samāpattiguṇādīhi bhagehi yuttoti bhagavā, tassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tissassa bhagavato"
      },
      " pubbe ahaṃ phalaṃ adāsinti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nāḷikerañca pādāsi"
      },
      "nti nāḷikākārena pavattaṃ phalaṃ nāḷikeraṃ, tañca phalaṃ adāsinti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khajjakaṃ abhisammata"
      },
      "nti khāditabbaṃ khajjakaṃ abhi visesena madhusakkarādīhi sammissaṃ ",
      " katvā nipphāditaṃ sundaraṃ madhuranti sammataṃ ñātaṃ abhisammataṃ khajjakañca adāsinti attho. Sesaṃ suviññeyyamevāti."
    ],
    "innerText": "13. So pubbakammaṃ saranto ‘‘pubbe mayā sukhette kusalaṃ kataṃ sundara’’nti somanassajāto pubbacaritāpadānaṃ pakāsento tissassa kho bhagavatotiādimāha. Tattha tissopi bhavasampattiyo dadamāno jātoti mātāpitūhi katanāmavasena tisso. Atha vā tīhi saraṇagamanehi assāsento ovadanto hetusampannapuggale saggamokkhadvaye patiṭṭhāpento buddho jātoti tisso. Samāpattiguṇādīhi bhagehi yuttoti bhagavā, tassa tissassa bhagavato pubbe ahaṃ phalaṃ adāsinti sambandho. Nāḷikerañca pādāsinti nāḷikākārena pavattaṃ phalaṃ nāḷikeraṃ, tañca phalaṃ adāsinti attho. Khajjakaṃ abhisammatanti khāditabbaṃ khajjakaṃ abhi visesena madhusakkarādīhi sammissaṃ katvā nipphāditaṃ sundaraṃ madhuranti sammataṃ ñātaṃ abhisammataṃ khajjakañca adāsinti attho. Sesaṃ suviññeyyamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Khajjakadāyakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Desapūjakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atthadassī tu bhagavā"
      },
      "tiādikaṃ āyasmato desapūjakattherassa apadānaṃ. Ayampi thero purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto atthadassissa bhagavato kāle kulagehe nibbatto vuddhimanvāya saddho pasanno buddhamāmako dhammamāmako saṅghamāmako ahosi. Tadā atthadassī bhagavā bhikkhusaṅghaparivuto cando viya sūriyo viya ca ākāsena gacchati. So upāsako bhagavato gatadisābhāgaṃ gandhamālādīhi pūjento añjaliṃ paggayha namassamāno aṭṭhāsi."
    ],
    "innerText": "Atthadassī tu bhagavātiādikaṃ āyasmato desapūjakattherassa apadānaṃ. Ayampi thero purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto atthadassissa bhagavato kāle kulagehe nibbatto vuddhimanvāya saddho pasanno buddhamāmako dhammamāmako saṅghamāmako ahosi. Tadā atthadassī bhagavā bhikkhusaṅghaparivuto cando viya sūriyo viya ca ākāsena gacchati. So upāsako bhagavato gatadisābhāgaṃ gandhamālādīhi pūjento añjaliṃ paggayha namassamāno aṭṭhāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "18"
      },
      ". So ",
      " tena puññena devaloke nibbatto saggasampattiṃ anubhavitvā manussesu ca manussasampattiṃ anubhavitvā imasmiṃ buddhuppāde ekasmiṃ kule nibbatto vuddhippatto upabhogaparibhogasampanno satthu dhammadesanaṃ sutvā pasannamānaso gharāvāse anallīno pabbajitvā vattasampanno nacirasseva arahā hutvā attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atthadassī tu bhagavā"
      },
      "tiādimāha. Taṃ heṭṭhā vuttatthameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anilañjase"
      },
      "ti ‘‘maggo pantho patho pajjo, añjasaṃ vaṭumāyana’’nti (cūḷani. pārāyanatthutigāthāniddesa 101) pariyāyassa vuttattā anilassa vātassa añjasaṃ gamanamaggoti anilañjasaṃ, tasmiṃ anilañjase, ākāseti attho. Sesaṃ uttānatthamevāti."
    ],
    "innerText": "18. So tena puññena devaloke nibbatto saggasampattiṃ anubhavitvā manussesu ca manussasampattiṃ anubhavitvā imasmiṃ buddhuppāde ekasmiṃ kule nibbatto vuddhippatto upabhogaparibhogasampanno satthu dhammadesanaṃ sutvā pasannamānaso gharāvāse anallīno pabbajitvā vattasampanno nacirasseva arahā hutvā attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento atthadassī tu bhagavātiādimāha. Taṃ heṭṭhā vuttatthameva. Anilañjaseti ‘‘maggo pantho patho pajjo, añjasaṃ vaṭumāyana’’nti (cūḷani. pārāyanatthutigāthāniddesa 101) pariyāyassa vuttattā anilassa vātassa añjasaṃ gamanamaggoti anilañjasaṃ, tasmiṃ anilañjase, ākāseti attho. Sesaṃ uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Desapūjakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Kaṇikārachattiyattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vessabhū"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nāma sambuddho"
      },
      "tiādikaṃ āyasmato kaṇikārachattiyattherassa apadānaṃ. Ayampi thero purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto vessabhussa bhagavato kāle kulagehe nibbatto viññutaṃ patto saddhāsampanno ahosi. Tasmiṃ samaye vessabhū bhagavā vivekakāmo mahāvanaṃ pavisitvā nisīdi. Atha sopi upāsako kenacideva karaṇīyena tattha gantvā bhagavantaṃ aggikkhandhaṃ viya jalamānaṃ nisinnaṃ disvā pasannamānaso kaṇikārapupphaṃ ocinitvā chattaṃ katvā bhagavato nisinnaṭṭhāne vitānaṃ katvā pūjesi, taṃ bhagavato ānubhāvena sattāhaṃ amilātaṃ hutvā tatheva aṭṭhāsi. Bhagavāpi phalasamāpattiṃ nirodhasamāpattiñca samāpajjitvā vihāsi ",
      ", so taṃ acchariyaṃ disvā somanassajāto bhagavantaṃ vanditvā añjaliṃ paggayha aṭṭhāsi. Bhagavā samāpattito vuṭṭhahitvā vihārameva agamāsi."
    ],
    "innerText": "Vessabhūnāma sambuddhotiādikaṃ āyasmato kaṇikārachattiyattherassa apadānaṃ. Ayampi thero purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto vessabhussa bhagavato kāle kulagehe nibbatto viññutaṃ patto saddhāsampanno ahosi. Tasmiṃ samaye vessabhū bhagavā vivekakāmo mahāvanaṃ pavisitvā nisīdi. Atha sopi upāsako kenacideva karaṇīyena tattha gantvā bhagavantaṃ aggikkhandhaṃ viya jalamānaṃ nisinnaṃ disvā pasannamānaso kaṇikārapupphaṃ ocinitvā chattaṃ katvā bhagavato nisinnaṭṭhāne vitānaṃ katvā pūjesi, taṃ bhagavato ānubhāvena sattāhaṃ amilātaṃ hutvā tatheva aṭṭhāsi. Bhagavāpi phalasamāpattiṃ nirodhasamāpattiñca samāpajjitvā vihāsi , so taṃ acchariyaṃ disvā somanassajāto bhagavantaṃ vanditvā añjaliṃ paggayha aṭṭhāsi. Bhagavā samāpattito vuṭṭhahitvā vihārameva agamāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "23"
      },
      ". So tena puññena devamanussesu sampattiyo anubhavitvā imasmiṃ buddhuppāde sāvatthiyaṃ kulagehe nibbatto vuddhimanvāya saddhāsampanno satthu ",
      " dhammadesanaṃ sutvā gharāvāse anallīno pabbajitvā vattapaṭipattiyā jinasāsanaṃ sobhento nacirasseva arahā hutvā attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vessabhū nāma sambuddho"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vessabhū"
      },
      "ti vesse vessajane bhunāti abhibhavatīti vessabhū. Atha vā vesse pañcavidhamāre abhibhunāti ajjhottharatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vessabhū"
      },
      ". Sāmaṃyeva bujjhitā saccānīti sambuddho, nāmena vessabhū nāma sambuddhoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Divāvihārāya munī"
      },
      "ti dibbati pakāseti taṃ taṃ vatthuṃ pākaṭaṃ karotīti divā. Sūriyuggamanato paṭṭhāya yāva atthaṅgamo, tāva paricchinnakālo, viharaṇaṃ catūhi iriyāpathehi pavattanaṃ vihāro, divāya vihāro divāvihāro, tassa divāvihārāya lokajeṭṭho narāsabho buddhamuni mahāvanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ogāhitvā"
      },
      " pavisitvāti attho. Sesaṃ uttānatthamevāti."
    ],
    "innerText": "23. So tena puññena devamanussesu sampattiyo anubhavitvā imasmiṃ buddhuppāde sāvatthiyaṃ kulagehe nibbatto vuddhimanvāya saddhāsampanno satthu dhammadesanaṃ sutvā gharāvāse anallīno pabbajitvā vattapaṭipattiyā jinasāsanaṃ sobhento nacirasseva arahā hutvā attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento vessabhū nāma sambuddhotiādimāha. Tattha vessabhūti vesse vessajane bhunāti abhibhavatīti vessabhū. Atha vā vesse pañcavidhamāre abhibhunāti ajjhottharatīti vessabhū. Sāmaṃyeva bujjhitā saccānīti sambuddho, nāmena vessabhū nāma sambuddhoti attho. Divāvihārāya munīti dibbati pakāseti taṃ taṃ vatthuṃ pākaṭaṃ karotīti divā. Sūriyuggamanato paṭṭhāya yāva atthaṅgamo, tāva paricchinnakālo, viharaṇaṃ catūhi iriyāpathehi pavattanaṃ vihāro, divāya vihāro divāvihāro, tassa divāvihārāya lokajeṭṭho narāsabho buddhamuni mahāvanaṃ ogāhitvā pavisitvāti attho. Sesaṃ uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Kaṇikārachattiyattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Sappidāyakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Phusso"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nāmātha bhagavā"
      },
      "tiādikaṃ āyasmato sappidāyakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro anekesu bhavesu vivaṭṭūpanissayāni puññāni upacinanto phussassa bhagavato kāle kulagehe nibbatto ahosi. Tadā bhagavā bhikkhusaṅghaparivuto vīthiyaṃ caramāno tassa upāsakassa gehadvāraṃ sampāpuṇi. Atha so upāsako bhagavantaṃ disvā pasannamānaso vanditvā pattapūraṃ sappitelaṃ adāsi, bhagavā anumodanaṃ katvā pakkāmi. So teneva somanassena yāvatāyukaṃ ṭhatvā tato cuto tena puññena devaloke uppanno tattha dibbasukhaṃ anubhavitvā manussesu ca nibbatto uppannuppannabhave sappitelamadhuphāṇitādimadhurāhārasamaṅgī sukhaṃ anubhavitvā imasmiṃ buddhuppāde sāvatthiyaṃ ekasmiṃ kule nibbatto vuddhippatto saddho buddhisampanno satthu dhammadesanaṃ sutvā pasannamānaso pabbajitvā vattasampanno nacirasseva arahā ahosi."
    ],
    "innerText": "Phussonāmātha bhagavātiādikaṃ āyasmato sappidāyakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro anekesu bhavesu vivaṭṭūpanissayāni puññāni upacinanto phussassa bhagavato kāle kulagehe nibbatto ahosi. Tadā bhagavā bhikkhusaṅghaparivuto vīthiyaṃ caramāno tassa upāsakassa gehadvāraṃ sampāpuṇi. Atha so upāsako bhagavantaṃ disvā pasannamānaso vanditvā pattapūraṃ sappitelaṃ adāsi, bhagavā anumodanaṃ katvā pakkāmi. So teneva somanassena yāvatāyukaṃ ṭhatvā tato cuto tena puññena devaloke uppanno tattha dibbasukhaṃ anubhavitvā manussesu ca nibbatto uppannuppannabhave sappitelamadhuphāṇitādimadhurāhārasamaṅgī sukhaṃ anubhavitvā imasmiṃ buddhuppāde sāvatthiyaṃ ekasmiṃ kule nibbatto vuddhippatto saddho buddhisampanno satthu dhammadesanaṃ sutvā pasannamānaso pabbajitvā vattasampanno nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "28"
      },
      ". So attano pubbakammaṃ saritvā jātasomanasso pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "phusso nāmātha bhagavā"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "phusso"
      },
      "ti ",
      " phussanakkhattayogena jātattā mātāpitūhi katanāmadheyyena phusso. Atha vā nibbānaṃ phusi passi sacchi akāsīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "phusso"
      },
      ". Atha vā samatiṃsapāramitāsattatiṃsabodhipakkhiyadhamme sakale ca tepiṭake pariyattidhamme phusi passi aññāsīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "phusso"
      },
      ". Bhaggavā bhagyavā yuttotiādipuññakoṭṭhāsasamaṅgitāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhagavā. Āhutīnaṃ paṭiggaho"
      },
      "ti āhutino vuccanti pūjāsakkārā, tesaṃ āhutīnaṃ paṭiggahetuṃ arahatīti āhutīnaṃ paṭiggaho. Mahājanaṃ nibbāpento vīro phusso nāma bhagavā vīthiyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atha"
      },
      " tadā gacchateti sambandho. Sesaṃ pākaṭamevāti."
    ],
    "innerText": "28. So attano pubbakammaṃ saritvā jātasomanasso pubbacaritāpadānaṃ pakāsento phusso nāmātha bhagavātiādimāha. Tattha phussoti phussanakkhattayogena jātattā mātāpitūhi katanāmadheyyena phusso. Atha vā nibbānaṃ phusi passi sacchi akāsīti phusso. Atha vā samatiṃsapāramitāsattatiṃsabodhipakkhiyadhamme sakale ca tepiṭake pariyattidhamme phusi passi aññāsīti phusso. Bhaggavā bhagyavā yuttotiādipuññakoṭṭhāsasamaṅgitāya bhagavā. Āhutīnaṃ paṭiggahoti āhutino vuccanti pūjāsakkārā, tesaṃ āhutīnaṃ paṭiggahetuṃ arahatīti āhutīnaṃ paṭiggaho. Mahājanaṃ nibbāpento vīro phusso nāma bhagavā vīthiyaṃ atha tadā gacchateti sambandho. Sesaṃ pākaṭamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sappidāyakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Yūthikāpupphiyattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Candabhāgānadītīre"
      },
      "tiādikaṃ āyasmato yūthikāpupphiyattherassa apadānaṃ. Ayampi āyasmā purimamunindesu katādhikāro anekesu ca jātisatesu vivaṭṭūpanissayāni puññāni upacinanto phussasseva bhagavato kāle suddakule nibbatto vuddhippatto candabhāgāya nadiyā tīre ",
      " kenacideva karaṇīyena anusotaṃ caramāno phussaṃ bhagavantaṃ nhāyitukāmaṃ aggikkhandhaṃ viya jalamānaṃ disvā somanassajāto tattha jātaṃ yūthikāpupphaṃ ocinitvā bhagavantaṃ pūjesi. Bhagavā tassa anumodanamakāsi."
    ],
    "innerText": "Candabhāgānadītīretiādikaṃ āyasmato yūthikāpupphiyattherassa apadānaṃ. Ayampi āyasmā purimamunindesu katādhikāro anekesu ca jātisatesu vivaṭṭūpanissayāni puññāni upacinanto phussasseva bhagavato kāle suddakule nibbatto vuddhippatto candabhāgāya nadiyā tīre kenacideva karaṇīyena anusotaṃ caramāno phussaṃ bhagavantaṃ nhāyitukāmaṃ aggikkhandhaṃ viya jalamānaṃ disvā somanassajāto tattha jātaṃ yūthikāpupphaṃ ocinitvā bhagavantaṃ pūjesi. Bhagavā tassa anumodanamakāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "33"
      },
      ". So tattha tena puññakoṭṭhāsena devamanussesu saṃsaranto ubhayasampattiyo anubhavitvā imasmiṃ buddhuppāde kulagehe nibbatto vuddhippatto bhagavato dhammadesanaṃ sutvā pasannamānaso pabbajitvā vattapaṭipattiyā sāsanaṃ sobhento nacirasseva arahā hutvā attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "candabhāgānadītīre"
      },
      "tiādimāha. Taṃ sabbaṃ uttānatthamevāti."
    ],
    "innerText": "33. So tattha tena puññakoṭṭhāsena devamanussesu saṃsaranto ubhayasampattiyo anubhavitvā imasmiṃ buddhuppāde kulagehe nibbatto vuddhippatto bhagavato dhammadesanaṃ sutvā pasannamānaso pabbajitvā vattapaṭipattiyā sāsanaṃ sobhento nacirasseva arahā hutvā attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento candabhāgānadītīretiādimāha. Taṃ sabbaṃ uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Yūthikāpupphiyattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Dussadāyakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tivarāyaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pure ramme"
      },
      "tiādikaṃ āyasmato dussadāyakattherassa apadānaṃ. Ayampāyasmā purimajinavaresu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto siddhatthassa bhagavato kāle rājakule nibbatto vuddhippattakāle yuvarājabhāvaṃ patvā pākaṭo ekaṃ janapadaṃ labhitvā tatrādhipatibhūto sakalajanapadavāsino dānapiyavacanaatthacariyāsamānatthatāsaṅkhātehi catūhi saṅgahavatthūhi saṅgaṇhāti. Tasmiṃ samaye siddhattho bhagavā taṃ janapadaṃ sampāpuṇi. Atha so yuvarājā paṇṇākāraṃ ",
      " labhitvā tattha sukhumavatthena bhagavantaṃ pūjesi. Bhagavā taṃ vatthaṃ hatthena parāmasitvā ākāsaṃ pakkhandi. Tampi vatthaṃ bhagavantameva anubandhi. Atha so yuvarājā taṃ acchariyaṃ disvā atīva pasanno añjaliṃ paggayha aṭṭhāsi. Bhagavato sampattasampattaṭṭhāne sabbe janā taṃ acchariyaṃ disvā acchariyabbhutacittā añjaliṃ paggayha aṭṭhaṃsu. Bhagavā vihārameva agamāsi. Yuvarājā teneva kusalakammena tato cuto devaloke uppanno tattha dibbasampattiṃ anubhavitvā manussesu cakkavattiādisampattiyo anubhavitvā imasmiṃ buddhuppāde vibhavasampanne ekasmiṃ kule nibbatto viññutaṃ patto gharāvāsaṃ saṇṭhapetvā ratanattaye pasanno bhagavato dhammadesanaṃ sutvā paṭiladdhasaddho pabbajitvā vāyamanto nacirasseva arahā ahosi."
    ],
    "innerText": "Tivarāyaṃpure rammetiādikaṃ āyasmato dussadāyakattherassa apadānaṃ. Ayampāyasmā purimajinavaresu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto siddhatthassa bhagavato kāle rājakule nibbatto vuddhippattakāle yuvarājabhāvaṃ patvā pākaṭo ekaṃ janapadaṃ labhitvā tatrādhipatibhūto sakalajanapadavāsino dānapiyavacanaatthacariyāsamānatthatāsaṅkhātehi catūhi saṅgahavatthūhi saṅgaṇhāti. Tasmiṃ samaye siddhattho bhagavā taṃ janapadaṃ sampāpuṇi. Atha so yuvarājā paṇṇākāraṃ labhitvā tattha sukhumavatthena bhagavantaṃ pūjesi. Bhagavā taṃ vatthaṃ hatthena parāmasitvā ākāsaṃ pakkhandi. Tampi vatthaṃ bhagavantameva anubandhi. Atha so yuvarājā taṃ acchariyaṃ disvā atīva pasanno añjaliṃ paggayha aṭṭhāsi. Bhagavato sampattasampattaṭṭhāne sabbe janā taṃ acchariyaṃ disvā acchariyabbhutacittā añjaliṃ paggayha aṭṭhaṃsu. Bhagavā vihārameva agamāsi. Yuvarājā teneva kusalakammena tato cuto devaloke uppanno tattha dibbasampattiṃ anubhavitvā manussesu cakkavattiādisampattiyo anubhavitvā imasmiṃ buddhuppāde vibhavasampanne ekasmiṃ kule nibbatto viññutaṃ patto gharāvāsaṃ saṇṭhapetvā ratanattaye pasanno bhagavato dhammadesanaṃ sutvā paṭiladdhasaddho pabbajitvā vāyamanto nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "38"
      },
      ". So ",
      " ekadivasaṃ attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tivarāyaṃ pure ramme"
      },
      "tiādimāha. Tattha tivaranāmake nagare ramaṇīye ahaṃ rājaputto hutvā siddhatthaṃ bhagavantaṃ vatthena pūjesinti attho. Sesaṃ suviññeyyamevāti."
    ],
    "innerText": "38. So ekadivasaṃ attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento tivarāyaṃ pure rammetiādimāha. Tattha tivaranāmake nagare ramaṇīye ahaṃ rājaputto hutvā siddhatthaṃ bhagavantaṃ vatthena pūjesinti attho. Sesaṃ suviññeyyamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dussadāyakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Samādapakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nagare bandhumatiyā"
      },
      "tiādikaṃ āyasmato samādapakattherassa apadānaṃ. Ayampi thero purimabuddhānaṃ santike katakusalasambhāro anekesu bhavesu vivaṭṭūpanissayāni puññāni upacinanto vipassissa bhagavato ",
      " kāle kulagehe nibbatto vuddhimanvāya gharāvāsaṃ saṇṭhapetvā puññāni karonto vasamāno saddho pasanno bahū upāsake sannipātetvā gaṇajeṭṭhako hutvā ‘‘māḷakaṃ karissāmā’’ti te sabbe samādapetvā ekaṃ māḷakaṃ samaṃ kāretvā paṇḍarapulinaṃ okiritvā bhagavato niyyādesi. So tena puññena devaloke uppanno cha kāmāvacarasampattiyo anubhavitvā manussesu ca cakkavattiādisampattiyo anubhavitvā imasmiṃ buddhuppāde kulagehe nibbatto viññutaṃ patto bhagavati pasanno dhammaṃ sutvā pasannamānaso saddhājāto pabbajitvā sīlasampanno vattasampanno nacirasseva arahattaṃ pāpuṇi."
    ],
    "innerText": "Nagare bandhumatiyātiādikaṃ āyasmato samādapakattherassa apadānaṃ. Ayampi thero purimabuddhānaṃ santike katakusalasambhāro anekesu bhavesu vivaṭṭūpanissayāni puññāni upacinanto vipassissa bhagavato kāle kulagehe nibbatto vuddhimanvāya gharāvāsaṃ saṇṭhapetvā puññāni karonto vasamāno saddho pasanno bahū upāsake sannipātetvā gaṇajeṭṭhako hutvā ‘‘māḷakaṃ karissāmā’’ti te sabbe samādapetvā ekaṃ māḷakaṃ samaṃ kāretvā paṇḍarapulinaṃ okiritvā bhagavato niyyādesi. So tena puññena devaloke uppanno cha kāmāvacarasampattiyo anubhavitvā manussesu ca cakkavattiādisampattiyo anubhavitvā imasmiṃ buddhuppāde kulagehe nibbatto viññutaṃ patto bhagavati pasanno dhammaṃ sutvā pasannamānaso saddhājāto pabbajitvā sīlasampanno vattasampanno nacirasseva arahattaṃ pāpuṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "44"
      },
      ". So aparabhāge attano katakusalaṃ saritvā sañjātasomanasso pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nagare bandhumatiyā"
      },
      "tiādimāha. Tattha bandhanti ñātigottādivasena ekasambandhā honti sakalanagaravāsinoti bandhū, bandhū etasmiṃ vijjantīti bandhumatī, tassā bandhumatiyā ",
      " nāma nagare mahāpūgagaṇo upāsakasamūho ahosīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Māḷaṃ kassāma saṅghassā"
      },
      "ti ettha māti gaṇhāti sampattasampattajanānaṃ cittanti māḷaṃ, atha vā sampattayatigaṇānaṃ cittassa vivekakaraṇe alanti māḷaṃ, māḷameva māḷakaṃ, bhikkhusaṅghassa phāsuvihāratthāya māḷakaṃ karissāmāti attho. Sesaṃ pākaṭamevāti."
    ],
    "innerText": "44. So aparabhāge attano katakusalaṃ saritvā sañjātasomanasso pubbacaritāpadānaṃ pakāsento nagare bandhumatiyātiādimāha. Tattha bandhanti ñātigottādivasena ekasambandhā honti sakalanagaravāsinoti bandhū, bandhū etasmiṃ vijjantīti bandhumatī, tassā bandhumatiyā nāma nagare mahāpūgagaṇo upāsakasamūho ahosīti attho. Māḷaṃ kassāma saṅghassāti ettha māti gaṇhāti sampattasampattajanānaṃ cittanti māḷaṃ, atha vā sampattayatigaṇānaṃ cittassa vivekakaraṇe alanti māḷaṃ, māḷameva māḷakaṃ, bhikkhusaṅghassa phāsuvihāratthāya māḷakaṃ karissāmāti attho. Sesaṃ pākaṭamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Samādapakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Pañcaṅguliyattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tisso"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nāmāsi bhagavā"
      },
      "tiādikaṃ āyasmato pañcaṅguliyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāre tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto tissassa bhagavato kāle ekasmiṃ kule nibbatto vuddhimanvāya gharāvāsaṃ saṇṭhapetvā vibhavasampanno saddho pasanno vīthito vihāraṃ paṭipannaṃ bhagavantaṃ disvā jātisumanādianekāni sugandhapupphāni candanādīni ca vilepanāni gāhāpetvā vihāraṃ gato pupphehi bhagavantaṃ pūjetvā vilepanehi bhagavato sarīre pañcaṅgulikaṃ katvā vanditvā pakkāmi."
    ],
    "innerText": "Tissonāmāsi bhagavātiādikaṃ āyasmato pañcaṅguliyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāre tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto tissassa bhagavato kāle ekasmiṃ kule nibbatto vuddhimanvāya gharāvāsaṃ saṇṭhapetvā vibhavasampanno saddho pasanno vīthito vihāraṃ paṭipannaṃ bhagavantaṃ disvā jātisumanādianekāni sugandhapupphāni candanādīni ca vilepanāni gāhāpetvā vihāraṃ gato pupphehi bhagavantaṃ pūjetvā vilepanehi bhagavato sarīre pañcaṅgulikaṃ katvā vanditvā pakkāmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "50"
      },
      ". So ",
      " tena puññena devamanussesu ubhayasampattiyo anubhavitvā imasmiṃ buddhuppāde vibhavasampanne ekasmiṃ kule nibbattitvā vuddhimanvāya satthu dhammadesanaṃ sutvā pasannamānaso pabbajitvā vipassanaṃ vaḍḍhetvā nacirasseva arahā hutvā pubbakammaṃ saranto paccakkhato ñatvā ‘‘imaṃ nāma kusalakammaṃ katvā īdisaṃ lokuttarasampattiṃ pattomhī’’ti pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tisso nāmāsi bhagavā"
      },
      "tiādimāha. Taṃ sabbaṃ uttānatthamevāti."
    ],
    "innerText": "50. So tena puññena devamanussesu ubhayasampattiyo anubhavitvā imasmiṃ buddhuppāde vibhavasampanne ekasmiṃ kule nibbattitvā vuddhimanvāya satthu dhammadesanaṃ sutvā pasannamānaso pabbajitvā vipassanaṃ vaḍḍhetvā nacirasseva arahā hutvā pubbakammaṃ saranto paccakkhato ñatvā ‘‘imaṃ nāma kusalakammaṃ katvā īdisaṃ lokuttarasampattiṃ pattomhī’’ti pubbacaritāpadānaṃ pakāsento tisso nāmāsi bhagavātiādimāha. Taṃ sabbaṃ uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pañcaṅguliyattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sattarasamavaggavaṇṇanā samattā."
  }
]