[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "2. Guhaṭṭhakasuttaniddeso"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " guhaṭṭhakasuttaniddesaṃ vakkhati –"
    ],
    "innerText": "Atha guhaṭṭhakasuttaniddesaṃ vakkhati –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "7"
      },
      "."
    ],
    "innerText": "7."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Satto"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "guhāyaṃ bahunābhichanno, tiṭṭhaṃ naro mohanasmiṃ pagāḷho;"
      }
    ],
    "innerText": "Sattoguhāyaṃ bahunābhichanno, tiṭṭhaṃ naro mohanasmiṃ pagāḷho;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dūre vivekā hi tathāvidho so, kāmā hi loke na hi suppahāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Satto guhāyaṃ bahunābhichanno"
      },
      "ti. Sattoti hi kho vuttaṃ, api ca guhā tāva vattabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Guhā"
      },
      " vuccati kāyo. Kāyoti vā guhāti vā dehoti ",
      " vā sandehoti vā nāvāti vā rathoti vā dhajoti vā vammikoti vā nagaranti vā niḍḍanti vā kuṭīti vā gaṇḍoti vā kumbhoti vā nāgoti vā kāyassetaṃ adhivacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Satto guhāya"
      },
      "nti guhāyaṃ satto visatto āsatto laggo laggito palibuddho. Yathā bhittikhile vā nāgadante vā gaṇḍaṃ sattaṃ visattaṃ āsattaṃ laggaṃ laggitaṃ palibuddhaṃ; evameva guhāyaṃ satto visatto āsatto laggo laggito palibuddho. Vuttañhetaṃ bhagavatā –"
    ],
    "innerText": "Satto guhāyaṃ bahunābhichannoti. Sattoti hi kho vuttaṃ, api ca guhā tāva vattabbā. Guhā vuccati kāyo. Kāyoti vā guhāti vā dehoti vā sandehoti vā nāvāti vā rathoti vā dhajoti vā vammikoti vā nagaranti vā niḍḍanti vā kuṭīti vā gaṇḍoti vā kumbhoti vā nāgoti vā kāyassetaṃ adhivacanaṃ. Satto guhāyanti guhāyaṃ satto visatto āsatto laggo laggito palibuddho. Yathā bhittikhile vā nāgadante vā gaṇḍaṃ sattaṃ visattaṃ āsattaṃ laggaṃ laggitaṃ palibuddhaṃ; evameva guhāyaṃ satto visatto āsatto laggo laggito palibuddho. Vuttañhetaṃ bhagavatā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Rūpe kho, rādha, yo chando yo rāgo yā nandī yā taṇhā ye upayūpādānā cetaso ",
      " adhiṭṭhānābhinivesānusayā, tatra satto tatra visatto; tasmā sattoti vuccati. Vedanāya kho, rādha…pe… saññāya kho, rādha… saṅkhāresu kho, rādha… viññāṇe kho, rādha, yo chando yo rāgo yā nandī yā taṇhā ye upayūpādānā cetaso adhiṭṭhānābhinivesānusayā, tatra satto tatra visatto; tasmā sattoti vuccati. Sattoti lagganādhivacana’’nti – satto guhāyaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bahunābhichanno"
      },
      "ti bahukehi kilesehi channo, rāgena channo dosena channo mohena channo ",
      " kodhena channo upanāhena channo makkhena channo paḷāsena channo issāya channo macchariyena channo māyāya channo sāṭheyyena channo thambhena channo sārambhena channo mānena channo atimānena channo madena channo pamādena channo. Sabbakilesehi sabbaduccaritehi sabbadarathehi sabbapariḷāhehi sabbasantāpehi sabbākusalābhisaṅkhārehi channo vichanno ucchanno āvuto nivuto ovuto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ophuto (syā.)]"
      },
      " pihito paṭicchanno paṭikujjitoti – satto guhāyaṃ bahunābhichanno."
    ],
    "innerText": "‘‘Rūpe kho, rādha, yo chando yo rāgo yā nandī yā taṇhā ye upayūpādānā cetaso adhiṭṭhānābhinivesānusayā, tatra satto tatra visatto; tasmā sattoti vuccati. Vedanāya kho, rādha…pe… saññāya kho, rādha… saṅkhāresu kho, rādha… viññāṇe kho, rādha, yo chando yo rāgo yā nandī yā taṇhā ye upayūpādānā cetaso adhiṭṭhānābhinivesānusayā, tatra satto tatra visatto; tasmā sattoti vuccati. Sattoti lagganādhivacana’’nti – satto guhāyaṃ. Bahunābhichannoti bahukehi kilesehi channo, rāgena channo dosena channo mohena channo kodhena channo upanāhena channo makkhena channo paḷāsena channo issāya channo macchariyena channo māyāya channo sāṭheyyena channo thambhena channo sārambhena channo mānena channo atimānena channo madena channo pamādena channo. Sabbakilesehi sabbaduccaritehi sabbadarathehi sabbapariḷāhehi sabbasantāpehi sabbākusalābhisaṅkhārehi channo vichanno ucchanno āvuto nivuto ovuto [ophuto (syā.)] pihito paṭicchanno paṭikujjitoti – satto guhāyaṃ bahunābhichanno."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tiṭṭhaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "naro mohanasmiṃ pagāḷho"
      },
      "ti tiṭṭhanto naro ratto rāgavasena tiṭṭhati, duṭṭho dosavasena tiṭṭhati, mūḷho mohavasena tiṭṭhati, vinibaddho mānavasena tiṭṭhati, parāmaṭṭho diṭṭhivasena tiṭṭhati, vikkhepagato uddhaccavasena tiṭṭhati, aniṭṭhaṅgato vicikicchāvasena tiṭṭhati, thāmagato anusayavasena tiṭṭhati. Evampi tiṭṭhaṃ naro."
    ],
    "innerText": "Tiṭṭhaṃnaro mohanasmiṃ pagāḷhoti tiṭṭhanto naro ratto rāgavasena tiṭṭhati, duṭṭho dosavasena tiṭṭhati, mūḷho mohavasena tiṭṭhati, vinibaddho mānavasena tiṭṭhati, parāmaṭṭho diṭṭhivasena tiṭṭhati, vikkhepagato uddhaccavasena tiṭṭhati, aniṭṭhaṅgato vicikicchāvasena tiṭṭhati, thāmagato anusayavasena tiṭṭhati. Evampi tiṭṭhaṃ naro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vuttañhetaṃ bhagavatā – ‘‘santi, bhikkhave, cakkhuviññeyyā rūpā iṭṭhā kantā manāpā piyarūpā kāmūpasaṃhitā rajanīyā, tañce bhikkhu abhinandati abhivadati ",
      " ajjhosāya tiṭṭhati. Santi, bhikkhave, sotaviññeyyā saddā…pe… ghānaviññeyyā ",
      " gandhā… jivhāviññeyyā rasā… kāyaviññeyyā phoṭṭhabbā… manoviññeyyā dhammā iṭṭhā kantā manāpā piyarūpā kāmūpasaṃhitā rajanīyā, tañce bhikkhu abhinandati abhivadati ajjhosāya tiṭṭhatī’’ti. Evampi tiṭṭhaṃ naro."
    ],
    "innerText": "Vuttañhetaṃ bhagavatā – ‘‘santi, bhikkhave, cakkhuviññeyyā rūpā iṭṭhā kantā manāpā piyarūpā kāmūpasaṃhitā rajanīyā, tañce bhikkhu abhinandati abhivadati ajjhosāya tiṭṭhati. Santi, bhikkhave, sotaviññeyyā saddā…pe… ghānaviññeyyā gandhā… jivhāviññeyyā rasā… kāyaviññeyyā phoṭṭhabbā… manoviññeyyā dhammā iṭṭhā kantā manāpā piyarūpā kāmūpasaṃhitā rajanīyā, tañce bhikkhu abhinandati abhivadati ajjhosāya tiṭṭhatī’’ti. Evampi tiṭṭhaṃ naro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vuttañhetaṃ ",
      " bhagavatā – ‘‘rūpūpayaṃ vā, bhikkhave, viññāṇaṃ tiṭṭhamānaṃ tiṭṭhati, rūpārammaṇaṃ rūpapatiṭṭhaṃ nandūpasecanaṃ vuddhiṃ virūḷhiṃ vepullaṃ āpajjati. Vedanūpayaṃ vā, bhikkhave…pe… saññūpayaṃ… saṅkhārūpayaṃ vā, bhikkhave, viññāṇaṃ tiṭṭhamānaṃ tiṭṭhati, saṅkhārārammaṇaṃ saṅkhārapatiṭṭhaṃ nandūpasecanaṃ vuddhiṃ virūḷhiṃ vepullaṃ āpajjatī’’ti. Evampi tiṭṭhaṃ naro."
    ],
    "innerText": "Vuttañhetaṃ bhagavatā – ‘‘rūpūpayaṃ vā, bhikkhave, viññāṇaṃ tiṭṭhamānaṃ tiṭṭhati, rūpārammaṇaṃ rūpapatiṭṭhaṃ nandūpasecanaṃ vuddhiṃ virūḷhiṃ vepullaṃ āpajjati. Vedanūpayaṃ vā, bhikkhave…pe… saññūpayaṃ… saṅkhārūpayaṃ vā, bhikkhave, viññāṇaṃ tiṭṭhamānaṃ tiṭṭhati, saṅkhārārammaṇaṃ saṅkhārapatiṭṭhaṃ nandūpasecanaṃ vuddhiṃ virūḷhiṃ vepullaṃ āpajjatī’’ti. Evampi tiṭṭhaṃ naro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Vuttampi hetaṃ bhagavatā – ‘‘kabaḷīkāre ce, bhikkhave, āhāre atthi rāgo atthi nandī atthi taṇhā, patiṭṭhitaṃ tattha viññāṇaṃ virūḷhaṃ. Yattha patiṭṭhitaṃ viññāṇaṃ virūḷhaṃ, atthi tattha nāmarūpassāvakkanti. Yattha atthi nāmarūpassāvakkanti, atthi tattha saṅkhārānaṃ vuddhi. Yattha atthi saṅkhārānaṃ vuddhi, atthi tattha āyatiṃ punabbhavābhinibbatti. Yattha atthi āyatiṃ punabbhavābhinibbatti, atthi tattha āyatiṃ jātijarāmaraṇaṃ. Yattha atthi āyatiṃ jātijarāmaraṇaṃ, sasokaṃ taṃ, bhikkhave, sarajaṃ saupāyāsanti vadāmī’’ti. Evampi tiṭṭhaṃ naro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Phasse ce, bhikkhave, āhāre…pe… manosañcetanāya ce, bhikkhave, āhāre… viññāṇe ce, bhikkhave, āhāre atthi rāgo atthi nandī atthi taṇhā ",
      ", patiṭṭhitaṃ tattha viññāṇaṃ virūḷhaṃ. Yattha patiṭṭhitaṃ viññāṇaṃ virūḷhaṃ, atthi tattha nāmarūpassāvakkanti. Yattha atthi nāmarūpassāvakkanti, atthi tattha saṅkhārānaṃ vuddhi. Yattha atthi saṅkhārānaṃ vuddhi, atthi tattha ",
      " āyatiṃ punabbhavābhinibbatti. Yattha atthi āyatiṃ punabbhavābhinibbatti ",
      ", atthi tattha āyatiṃ jātijarāmaraṇaṃ. Yattha atthi āyatiṃ jātijarāmaraṇaṃ, sasokaṃ taṃ, bhikkhave, sarajaṃ saupāyāsanti vadāmī’’ti. Evampi tiṭṭhaṃ naro."
    ],
    "innerText": "‘‘Phasse ce, bhikkhave, āhāre…pe… manosañcetanāya ce, bhikkhave, āhāre… viññāṇe ce, bhikkhave, āhāre atthi rāgo atthi nandī atthi taṇhā , patiṭṭhitaṃ tattha viññāṇaṃ virūḷhaṃ. Yattha patiṭṭhitaṃ viññāṇaṃ virūḷhaṃ, atthi tattha nāmarūpassāvakkanti. Yattha atthi nāmarūpassāvakkanti, atthi tattha saṅkhārānaṃ vuddhi. Yattha atthi saṅkhārānaṃ vuddhi, atthi tattha āyatiṃ punabbhavābhinibbatti. Yattha atthi āyatiṃ punabbhavābhinibbatti , atthi tattha āyatiṃ jātijarāmaraṇaṃ. Yattha atthi āyatiṃ jātijarāmaraṇaṃ, sasokaṃ taṃ, bhikkhave, sarajaṃ saupāyāsanti vadāmī’’ti. Evampi tiṭṭhaṃ naro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mohanasmiṃ pagāḷho"
      },
      "ti. Mohanā vuccanti pañca kāmaguṇā. Cakkhuviññeyyā rūpā iṭṭhā kantā manāpā piyarūpā kāmūpasaṃhitā rajanīyā; sotaviññeyyā saddā… ghānaviññeyyā gandhā… jivhāviññeyyā rasā… kāyaviññeyyā phoṭṭhabbā iṭṭhā kantā manāpā piyarūpā kāmūpasaṃhitā rajanīyā. Kiṃ kāraṇā mohanā vuccanti pañca kāmaguṇā? Yebhuyyena devamanussā ",
      " pañcasu kāmaguṇesu muyhanti sammuyhanti sampamuyhanti, mūḷhā sammūḷhā sampamūḷhā avijjāya andhīkatā āvutā nivutā ovutā pihitā paṭicchannā paṭikujjitā, taṃ kāraṇā mohanā vuccanti pañca kāmaguṇā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mohanasmiṃ pagāḷho"
      },
      "ti mohanasmiṃ pagāḷho ogāḷho ajjhogāḷho nimuggoti – tiṭṭhaṃ naro mohanasmiṃ pagāḷho."
    ],
    "innerText": "Mohanasmiṃ pagāḷhoti. Mohanā vuccanti pañca kāmaguṇā. Cakkhuviññeyyā rūpā iṭṭhā kantā manāpā piyarūpā kāmūpasaṃhitā rajanīyā; sotaviññeyyā saddā… ghānaviññeyyā gandhā… jivhāviññeyyā rasā… kāyaviññeyyā phoṭṭhabbā iṭṭhā kantā manāpā piyarūpā kāmūpasaṃhitā rajanīyā. Kiṃ kāraṇā mohanā vuccanti pañca kāmaguṇā? Yebhuyyena devamanussā pañcasu kāmaguṇesu muyhanti sammuyhanti sampamuyhanti, mūḷhā sammūḷhā sampamūḷhā avijjāya andhīkatā āvutā nivutā ovutā pihitā paṭicchannā paṭikujjitā, taṃ kāraṇā mohanā vuccanti pañca kāmaguṇā. Mohanasmiṃ pagāḷhoti mohanasmiṃ pagāḷho ogāḷho ajjhogāḷho nimuggoti – tiṭṭhaṃ naro mohanasmiṃ pagāḷho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dūre vivekā hi tathāvidho so"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vivekā"
      },
      "ti tayo vivekā – kāyaviveko, cittaviveko, upadhiviveko. Katamo kāyaviveko? Idha bhikkhu vivittaṃ senāsanaṃ bhajati araññaṃ rukkhamūlaṃ pabbataṃ kandaraṃ giriguhaṃ susānaṃ vanapatthaṃ abbhokāsaṃ palālapuñjaṃ. Kāyena vivitto viharati. So eko gacchati, eko tiṭṭhati, eko nisīdati, eko seyyaṃ kappeti, eko gāmaṃ piṇḍāya ",
      " pavisati, eko paṭikkamati, eko raho nisīdati, eko caṅkamaṃ adhiṭṭhāti, eko carati viharati iriyati vattati pāleti yapeti yāpeti. Ayaṃ kāyaviveko."
    ],
    "innerText": "Dūre vivekā hi tathāvidho soti. Vivekāti tayo vivekā – kāyaviveko, cittaviveko, upadhiviveko. Katamo kāyaviveko? Idha bhikkhu vivittaṃ senāsanaṃ bhajati araññaṃ rukkhamūlaṃ pabbataṃ kandaraṃ giriguhaṃ susānaṃ vanapatthaṃ abbhokāsaṃ palālapuñjaṃ. Kāyena vivitto viharati. So eko gacchati, eko tiṭṭhati, eko nisīdati, eko seyyaṃ kappeti, eko gāmaṃ piṇḍāya pavisati, eko paṭikkamati, eko raho nisīdati, eko caṅkamaṃ adhiṭṭhāti, eko carati viharati iriyati vattati pāleti yapeti yāpeti. Ayaṃ kāyaviveko."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katamo ",
      " cittaviveko? Paṭhamaṃ jhānaṃ samāpannassa nīvaraṇehi cittaṃ vivittaṃ hoti. Dutiyaṃ jhānaṃ samāpannassa vitakkavicārehi cittaṃ vivittaṃ hoti. Tatiyaṃ jhānaṃ samāpannassa pītiyā cittaṃ vivittaṃ hoti. Catutthaṃ jhānaṃ samāpannassa sukhadukkhehi cittaṃ vivittaṃ hoti. Ākāsānañcāyatanaṃ samāpannassa rūpasaññāya paṭighasaññāya nānattasaññāya cittaṃ vivittaṃ hoti. Viññāṇañcāyatanaṃ samāpannassa ākāsānañcāyatanasaññāya cittaṃ vivittaṃ hoti. Ākiñcaññāyatanaṃ samāpannassa viññāṇañcāyatanasaññāya cittaṃ vivittaṃ hoti. Nevasaññānāsaññāyatanaṃ samāpannassa ākiñcaññāyatanasaññāya cittaṃ vivittaṃ hoti. Sotāpannassa sakkāyadiṭṭhiyā vicikicchāya sīlabbataparāmāsā diṭṭhānusayā vicikicchānusayā, tadekaṭṭhehi ca kilesehi cittaṃ vivittaṃ hoti. Sakadāgāmissa oḷārikā kāmarāgasaññojanā paṭighasaññojanā oḷārikā kāmarāgānusayā paṭighānusayā, tadekaṭṭhehi ",
      " ca kilesehi cittaṃ vivittaṃ hoti. Anāgāmissa anusahagatā kāmarāgasaññojanā paṭighasaññojanā anusahagatā kāmarāgānusayā paṭighānusayā, tadekaṭṭhehi ca kilesehi cittaṃ vivittaṃ hoti. Arahato rūpārūparāgā mānā uddhaccā avijjāya mānānusayā bhavarāgānusayā avijjānusayā ",
      ", tadekaṭṭhehi ",
      " ca kilesehi bahiddhā ca sabbanimittehi cittaṃ vivittaṃ hoti. Ayaṃ cittaviveko."
    ],
    "innerText": "Katamo cittaviveko? Paṭhamaṃ jhānaṃ samāpannassa nīvaraṇehi cittaṃ vivittaṃ hoti. Dutiyaṃ jhānaṃ samāpannassa vitakkavicārehi cittaṃ vivittaṃ hoti. Tatiyaṃ jhānaṃ samāpannassa pītiyā cittaṃ vivittaṃ hoti. Catutthaṃ jhānaṃ samāpannassa sukhadukkhehi cittaṃ vivittaṃ hoti. Ākāsānañcāyatanaṃ samāpannassa rūpasaññāya paṭighasaññāya nānattasaññāya cittaṃ vivittaṃ hoti. Viññāṇañcāyatanaṃ samāpannassa ākāsānañcāyatanasaññāya cittaṃ vivittaṃ hoti. Ākiñcaññāyatanaṃ samāpannassa viññāṇañcāyatanasaññāya cittaṃ vivittaṃ hoti. Nevasaññānāsaññāyatanaṃ samāpannassa ākiñcaññāyatanasaññāya cittaṃ vivittaṃ hoti. Sotāpannassa sakkāyadiṭṭhiyā vicikicchāya sīlabbataparāmāsā diṭṭhānusayā vicikicchānusayā, tadekaṭṭhehi ca kilesehi cittaṃ vivittaṃ hoti. Sakadāgāmissa oḷārikā kāmarāgasaññojanā paṭighasaññojanā oḷārikā kāmarāgānusayā paṭighānusayā, tadekaṭṭhehi ca kilesehi cittaṃ vivittaṃ hoti. Anāgāmissa anusahagatā kāmarāgasaññojanā paṭighasaññojanā anusahagatā kāmarāgānusayā paṭighānusayā, tadekaṭṭhehi ca kilesehi cittaṃ vivittaṃ hoti. Arahato rūpārūparāgā mānā uddhaccā avijjāya mānānusayā bhavarāgānusayā avijjānusayā , tadekaṭṭhehi ca kilesehi bahiddhā ca sabbanimittehi cittaṃ vivittaṃ hoti. Ayaṃ cittaviveko."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katamo upadhiviveko? Upadhi vuccanti kilesā ca khandhā ca abhisaṅkhārā ca. Upadhiviveko vuccati amataṃ nibbānaṃ. Yo sabbasaṅkhārasamatho sabbūpadhipaṭinissaggo taṇhakkhayo virāgo nirodho nibbānaṃ. Ayaṃ upadhiviveko. Kāyaviveko ca vivekaṭṭhakāyānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vūpakaṭṭhakāyānaṃ (syā.)]"
      },
      " nekkhammābhiratānaṃ, cittaviveko ca parisuddhacittānaṃ paramavodānappattānaṃ, upadhiviveko ca nirūpadhīnaṃ puggalānaṃ visaṅkhāragatānaṃ."
    ],
    "innerText": "Katamo upadhiviveko? Upadhi vuccanti kilesā ca khandhā ca abhisaṅkhārā ca. Upadhiviveko vuccati amataṃ nibbānaṃ. Yo sabbasaṅkhārasamatho sabbūpadhipaṭinissaggo taṇhakkhayo virāgo nirodho nibbānaṃ. Ayaṃ upadhiviveko. Kāyaviveko ca vivekaṭṭhakāyānaṃ [vūpakaṭṭhakāyānaṃ (syā.)] nekkhammābhiratānaṃ, cittaviveko ca parisuddhacittānaṃ paramavodānappattānaṃ, upadhiviveko ca nirūpadhīnaṃ puggalānaṃ visaṅkhāragatānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dūre"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vivekā hī"
      },
      "ti. Yo so evaṃ guhāyaṃ satto, evaṃ bahukehi kilesehi channo, evaṃ mohanasmiṃ pagāḷho, so kāyavivekāpi dūre, cittavivekāpi dūre, upadhivivekāpi dūre vidūre suvidūre na santike na sāmantā anāsanne vivekaṭṭhe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vavakaṭṭhe (sī.), anupakaṭṭhe (syā.)]"
      },
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tathāvidho"
      },
      "ti tādiso tassaṇṭhito tappakāro tappaṭibhāgo yo so mohanasmiṃ pagāḷhoti – dūre vivekā hi tathāvidho so."
    ],
    "innerText": "Dūrevivekā hīti. Yo so evaṃ guhāyaṃ satto, evaṃ bahukehi kilesehi channo, evaṃ mohanasmiṃ pagāḷho, so kāyavivekāpi dūre, cittavivekāpi dūre, upadhivivekāpi dūre vidūre suvidūre na santike na sāmantā anāsanne vivekaṭṭhe [vavakaṭṭhe (sī.), anupakaṭṭhe (syā.)]. Tathāvidhoti tādiso tassaṇṭhito tappakāro tappaṭibhāgo yo so mohanasmiṃ pagāḷhoti – dūre vivekā hi tathāvidho so."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāmā hi loke na hi suppahāyā"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāmā"
      },
      "ti uddānato dve kāmā – vatthukāmā ca kilesakāmā ca. Katame vatthukāmā? Manāpikā rūpā manāpikā saddā manāpikā gandhā manāpikā rasā manāpikā phoṭṭhabbā, attharaṇā pāvuraṇā dāsidāsā ajeḷakā kukkuṭasūkarā hatthigavāssavaḷavā, khettaṃ vatthu hiraññaṃ ",
      " suvaṇṇaṃ, gāmanigamarājadhāniyo raṭṭhañca janapado ca koso ca koṭṭhāgārañca, yaṃ kiñci rajanīyaṃ vatthu – vatthukāmā. Api ca atītā kāmā anāgatā kāmā paccuppannā kāmā, ajjhattā kāmā bahiddhā kāmā ajjhattabahiddhā kāmā, hīnā kāmā majjhimā kāmā paṇītā kāmā, āpāyikā kāmā mānusikā kāmā dibbā kāmā paccupaṭṭhitā kāmā, nimmitā kāmā animmitā kāmā paranimmitā kāmā, pariggahitā kāmā apariggahitā kāmā, mamāyitā kāmā amamāyitā kāmā, sabbepi kāmāvacarā dhammā, sabbepi rūpāvacarā dhammā, sabbepi arūpāvacarā dhammā, taṇhāvatthukā taṇhārammaṇā kāmanīyaṭṭhena rajanīyaṭṭhena madanīyaṭṭhena kāmā. Ime vuccanti vatthukāmā."
    ],
    "innerText": "Kāmā hi loke na hi suppahāyāti. Kāmāti uddānato dve kāmā – vatthukāmā ca kilesakāmā ca. Katame vatthukāmā? Manāpikā rūpā manāpikā saddā manāpikā gandhā manāpikā rasā manāpikā phoṭṭhabbā, attharaṇā pāvuraṇā dāsidāsā ajeḷakā kukkuṭasūkarā hatthigavāssavaḷavā, khettaṃ vatthu hiraññaṃ suvaṇṇaṃ, gāmanigamarājadhāniyo raṭṭhañca janapado ca koso ca koṭṭhāgārañca, yaṃ kiñci rajanīyaṃ vatthu – vatthukāmā. Api ca atītā kāmā anāgatā kāmā paccuppannā kāmā, ajjhattā kāmā bahiddhā kāmā ajjhattabahiddhā kāmā, hīnā kāmā majjhimā kāmā paṇītā kāmā, āpāyikā kāmā mānusikā kāmā dibbā kāmā paccupaṭṭhitā kāmā, nimmitā kāmā animmitā kāmā paranimmitā kāmā, pariggahitā kāmā apariggahitā kāmā, mamāyitā kāmā amamāyitā kāmā, sabbepi kāmāvacarā dhammā, sabbepi rūpāvacarā dhammā, sabbepi arūpāvacarā dhammā, taṇhāvatthukā taṇhārammaṇā kāmanīyaṭṭhena rajanīyaṭṭhena madanīyaṭṭhena kāmā. Ime vuccanti vatthukāmā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katame ",
      " kilesakāmā? Chando kāmo rāgo kāmo chandarāgo kāmo, saṅkappo kāmo rāgo kāmo saṅkapparāgo kāmo, yo kāmesu kāmacchando kāmarāgo kāmanandī kāmataṇhā kāmasneho kāmapariḷāho kāmamucchā kāmajjhosānaṃ kāmogho kāmayogo kāmupādānaṃ kāmacchandanīvaraṇaṃ."
    ],
    "innerText": "Katame kilesakāmā? Chando kāmo rāgo kāmo chandarāgo kāmo, saṅkappo kāmo rāgo kāmo saṅkapparāgo kāmo, yo kāmesu kāmacchando kāmarāgo kāmanandī kāmataṇhā kāmasneho kāmapariḷāho kāmamucchā kāmajjhosānaṃ kāmogho kāmayogo kāmupādānaṃ kāmacchandanīvaraṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Addasaṃ kāma te mūlaṃ, saṅkappā kāma jāyasi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Na taṃ saṅkappayissāmi, evaṃ kāma na hohisī’’ti. –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ime vuccanti kilesakāmā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Loke"
      },
      "ti ",
      " apāyaloke manussaloke devaloke, khandhaloke dhātuloke āyatanaloke. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāmā hi loke na"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hi suppahāyā"
      },
      "ti. Kāmā hi loke duppahāyā duccajjā duppariccajjā dunnimmadayā dunniveṭhayā dubbiniveṭhayā duttarā duppatarā dussamatikkamā dubbinivattāti – kāmā hi loke na hi suppahāyā."
    ],
    "innerText": "Ime vuccanti kilesakāmā. Loketi apāyaloke manussaloke devaloke, khandhaloke dhātuloke āyatanaloke. Kāmā hi loke nahi suppahāyāti. Kāmā hi loke duppahāyā duccajjā duppariccajjā dunnimmadayā dunniveṭhayā dubbiniveṭhayā duttarā duppatarā dussamatikkamā dubbinivattāti – kāmā hi loke na hi suppahāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Satto guhāyaṃ bahunābhichanno, tiṭṭhaṃ naro mohanasmiṃ pagāḷho;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dūre vivekā hi tathāvidho so, kāmā hi loke na hi suppahāyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "8"
      },
      "."
    ],
    "innerText": "8."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Icchānidānā bhavasātabaddhā, te duppamuñcā na hi aññamokkhā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pacchā pure vāpi apekkhamānā, ime va kāme purime va jappaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Icchānidānā bhavasātabaddhā"
      },
      "ti. Icchā vuccati taṇhā. Yo rāgo sārāgo anunayo anurodho nandī nandirāgo, cittassa sārāgo icchā mucchā ajjhosānaṃ gedho paligedho saṅgo paṅko, ejā māyā janikā sañjananī sibbinī jālinī saritā visattikā, suttaṃ visaṭā āyūhinī dutiyā paṇidhi bhavanetti, vanaṃ vanatho sandhavo sneho apekkhā paṭibandhu, āsā āsīsanā āsīsitattaṃ, rūpāsā saddāsā gandhāsā rasāsā phoṭṭhabbāsā, lābhāsā dhanāsā puttāsā jīvitāsā ",
      ", jappā pajappā abhijappā ",
      " jappanā jappitattaṃ loluppaṃ loluppāyanā loluppāyitattaṃ pucchañchikatā sādhukamyatā, adhammarāgo visamalobho ",
      " nikanti nikāmanā patthanā pihanā sampatthanā, kāmataṇhā bhavataṇhā vibhavataṇhā, rūpataṇhā arūpataṇhā nirodhataṇhā, rūpataṇhā saddataṇhā gandhataṇhā rasataṇhā phoṭṭhabbataṇhā dhammataṇhā, ogho yogo gantho upādānaṃ āvaraṇaṃ nīvaraṇaṃ chadanaṃ bandhanaṃ, upakkileso anusayo pariyuṭṭhānaṃ latā vevicchaṃ ",
      ", dukkhamūlaṃ dukkhanidānaṃ dukkhappabhavo mārapāso mārabaḷisaṃ māravisayo, taṇhānadī taṇhājālaṃ taṇhāgaddulaṃ taṇhāsamuddo abhijjhā lobho akusalamūlaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Icchānidānā"
      },
      "ti icchānidānakā icchāhetukā icchāpaccayā icchākāraṇā icchāpabhavāti – icchānidānā."
    ],
    "innerText": "Icchānidānā bhavasātabaddhāti. Icchā vuccati taṇhā. Yo rāgo sārāgo anunayo anurodho nandī nandirāgo, cittassa sārāgo icchā mucchā ajjhosānaṃ gedho paligedho saṅgo paṅko, ejā māyā janikā sañjananī sibbinī jālinī saritā visattikā, suttaṃ visaṭā āyūhinī dutiyā paṇidhi bhavanetti, vanaṃ vanatho sandhavo sneho apekkhā paṭibandhu, āsā āsīsanā āsīsitattaṃ, rūpāsā saddāsā gandhāsā rasāsā phoṭṭhabbāsā, lābhāsā dhanāsā puttāsā jīvitāsā , jappā pajappā abhijappā jappanā jappitattaṃ loluppaṃ loluppāyanā loluppāyitattaṃ pucchañchikatā sādhukamyatā, adhammarāgo visamalobho nikanti nikāmanā patthanā pihanā sampatthanā, kāmataṇhā bhavataṇhā vibhavataṇhā, rūpataṇhā arūpataṇhā nirodhataṇhā, rūpataṇhā saddataṇhā gandhataṇhā rasataṇhā phoṭṭhabbataṇhā dhammataṇhā, ogho yogo gantho upādānaṃ āvaraṇaṃ nīvaraṇaṃ chadanaṃ bandhanaṃ, upakkileso anusayo pariyuṭṭhānaṃ latā vevicchaṃ , dukkhamūlaṃ dukkhanidānaṃ dukkhappabhavo mārapāso mārabaḷisaṃ māravisayo, taṇhānadī taṇhājālaṃ taṇhāgaddulaṃ taṇhāsamuddo abhijjhā lobho akusalamūlaṃ. Icchānidānāti icchānidānakā icchāhetukā icchāpaccayā icchākāraṇā icchāpabhavāti – icchānidānā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhavasātabaddhā"
      },
      "ti. Ekaṃ bhavasātaṃ – sukhā vedanā. Dve bhavasātāni – sukhā ca vedanā iṭṭhañca vatthu. Tīṇi bhavasātāni – yobbaññaṃ, ārogyaṃ, jīvitaṃ. Cattāri bhavasātāni – lābho, yaso, pasaṃsā, sukhaṃ. Pañca bhavasātāni – manāpikā rūpā, manāpikā saddā, manāpikā gandhā, manāpikā rasā, manāpikā phoṭṭhabbā. Cha bhavasātāni – cakkhusampadā, sotasampadā, ghānasampadā, jivhāsampadā, kāyasampadā, manosampadā. Bhavasātabaddhā, sukhāya vedanāya sātabaddhā, iṭṭhasmiṃ vatthusmiṃ baddhā, yobbaññe baddhā, ārogye baddhā, jīvite baddhā, lābhe baddhā, yase baddhā, pasaṃsāyaṃ baddhā, sukhe baddhā ",
      ", manāpikesu rūpesu baddhā, saddesu… gandhesu… rasesu… manāpikesu phoṭṭhabbesu baddhā, cakkhusampadāya baddhā, sotaghānajivhākāyamanosampadāya baddhā, vibaddhā ābaddhā laggā laggitā palibaddhāti – icchānidānā bhavasātabaddhā."
    ],
    "innerText": "Bhavasātabaddhāti. Ekaṃ bhavasātaṃ – sukhā vedanā. Dve bhavasātāni – sukhā ca vedanā iṭṭhañca vatthu. Tīṇi bhavasātāni – yobbaññaṃ, ārogyaṃ, jīvitaṃ. Cattāri bhavasātāni – lābho, yaso, pasaṃsā, sukhaṃ. Pañca bhavasātāni – manāpikā rūpā, manāpikā saddā, manāpikā gandhā, manāpikā rasā, manāpikā phoṭṭhabbā. Cha bhavasātāni – cakkhusampadā, sotasampadā, ghānasampadā, jivhāsampadā, kāyasampadā, manosampadā. Bhavasātabaddhā, sukhāya vedanāya sātabaddhā, iṭṭhasmiṃ vatthusmiṃ baddhā, yobbaññe baddhā, ārogye baddhā, jīvite baddhā, lābhe baddhā, yase baddhā, pasaṃsāyaṃ baddhā, sukhe baddhā , manāpikesu rūpesu baddhā, saddesu… gandhesu… rasesu… manāpikesu phoṭṭhabbesu baddhā, cakkhusampadāya baddhā, sotaghānajivhākāyamanosampadāya baddhā, vibaddhā ābaddhā laggā laggitā palibaddhāti – icchānidānā bhavasātabaddhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Te"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "duppamuñcā na hi aññamokkhā"
      },
      "ti te vā bhavasātavatthū duppamuñcā, sattā vā etto dummocayā. Kathaṃ te bhavasātavatthū duppamuñcā? Sukhā vedanā duppamuñcā, iṭṭhaṃ vatthu duppamuñcaṃ, yobbaññaṃ duppamuñcaṃ, ārogyaṃ duppamuñcaṃ, jīvitaṃ duppamuñcaṃ, lābho duppamuñco, yaso duppamuñco, pasaṃsā duppamuñcā, sukhaṃ duppamuñcaṃ, manāpikā rūpā duppamuñcā, manāpikā saddā… gandhā… rasā… phoṭṭhabbā duppamuñcā, cakkhusampadā duppamuñcā, sotaghānajivhākāyamanosampadā duppamuñcā dummocayā duppamocayā dunniveṭhayā dubbiniveṭhayā ",
      ", duttarā duppatarā dussamatikkamā dubbinivattā. Evaṃ te bhavasātavatthū duppamuñcā."
    ],
    "innerText": "Teduppamuñcā na hi aññamokkhāti te vā bhavasātavatthū duppamuñcā, sattā vā etto dummocayā. Kathaṃ te bhavasātavatthū duppamuñcā? Sukhā vedanā duppamuñcā, iṭṭhaṃ vatthu duppamuñcaṃ, yobbaññaṃ duppamuñcaṃ, ārogyaṃ duppamuñcaṃ, jīvitaṃ duppamuñcaṃ, lābho duppamuñco, yaso duppamuñco, pasaṃsā duppamuñcā, sukhaṃ duppamuñcaṃ, manāpikā rūpā duppamuñcā, manāpikā saddā… gandhā… rasā… phoṭṭhabbā duppamuñcā, cakkhusampadā duppamuñcā, sotaghānajivhākāyamanosampadā duppamuñcā dummocayā duppamocayā dunniveṭhayā dubbiniveṭhayā , duttarā duppatarā dussamatikkamā dubbinivattā. Evaṃ te bhavasātavatthū duppamuñcā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ sattā etto dummocayā? Sukhāya vedanāya sattā dummocayā, iṭṭhasmā vatthusmā dummocayā, yobbaññā dummocayā, ārogyā dummocayā, jīvitā dummocayā, lābhā dummocayā, yasā dummocayā, pasaṃsāya dummocayā, sukhā dummocayā ",
      ", manāpikehi rūpehi dummocayā, manāpikehi saddehi… gandhehi… rasehi… phoṭṭhabbehi dummocayā, cakkhusampadāya dummocayā, sotaghānajivhākāyamanosampadāya dummocayā duruddharā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[duddharā (ka.)]"
      },
      ", dussamuddharā dubbuṭṭhāpayā dussamuṭṭhāpayā dunniveṭhayā dubbiniveṭhayā duttarā duppatarā dussamatikkamā dubbinivattā. Evaṃ sattā etto dummocayāti – te duppamuñcā."
    ],
    "innerText": "Kathaṃ sattā etto dummocayā? Sukhāya vedanāya sattā dummocayā, iṭṭhasmā vatthusmā dummocayā, yobbaññā dummocayā, ārogyā dummocayā, jīvitā dummocayā, lābhā dummocayā, yasā dummocayā, pasaṃsāya dummocayā, sukhā dummocayā , manāpikehi rūpehi dummocayā, manāpikehi saddehi… gandhehi… rasehi… phoṭṭhabbehi dummocayā, cakkhusampadāya dummocayā, sotaghānajivhākāyamanosampadāya dummocayā duruddharā [duddharā (ka.)], dussamuddharā dubbuṭṭhāpayā dussamuṭṭhāpayā dunniveṭhayā dubbiniveṭhayā duttarā duppatarā dussamatikkamā dubbinivattā. Evaṃ sattā etto dummocayāti – te duppamuñcā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hi aññamokkhā"
      },
      "ti te attanā palipapalipannā na sakkonti paraṃ palipapalipannaṃ uddharituṃ. Vuttañhetaṃ bhagavatā – ‘‘so vata, cunda, attanā palipapalipanno paraṃ palipapalipannaṃ uddharissatīti netaṃ ṭhānaṃ vijjati. So vata, cunda, attanā adanto avinīto aparinibbuto paraṃ damessati vinessati parinibbāpessatīti netaṃ ṭhānaṃ vijjatī’’ti. Evampi na hi aññamokkhā."
    ],
    "innerText": "Nahi aññamokkhāti te attanā palipapalipannā na sakkonti paraṃ palipapalipannaṃ uddharituṃ. Vuttañhetaṃ bhagavatā – ‘‘so vata, cunda, attanā palipapalipanno paraṃ palipapalipannaṃ uddharissatīti netaṃ ṭhānaṃ vijjati. So vata, cunda, attanā adanto avinīto aparinibbuto paraṃ damessati vinessati parinibbāpessatīti netaṃ ṭhānaṃ vijjatī’’ti. Evampi na hi aññamokkhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha vā natthañño koci mocetā. Te yadi muñceyyuṃ, sakena thāmena sakena balena sakena vīriyena sakena parakkamena sakena purisathāmena sakena purisabalena sakena purisavīriyena sakena purisaparakkamena attanā sammāpaṭipadaṃ anulomapaṭipadaṃ apaccanīkapaṭipadaṃ anvatthapaṭipadaṃ dhammānudhammapaṭipadaṃ paṭipajjamānā muñceyyunti. Evampi na hi aññamokkhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Vuttampi hetaṃ bhagavatā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Nāhaṃ sahissāmi pamocanāya, kathaṃkathiṃ dhotaka kiñci loke;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Dhammañca ",
      " seṭṭhaṃ abhijānamāno, evaṃ tuvaṃ oghamimaṃ taresī’’ti."
    ],
    "innerText": "Dhammañca seṭṭhaṃ abhijānamāno, evaṃ tuvaṃ oghamimaṃ taresī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evampi na hi aññamokkhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Vuttampi hetaṃ bhagavatā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Attanāva ",
      " kataṃ pāpaṃ, attanā saṃkilissati;"
    ],
    "innerText": "‘‘Attanāva kataṃ pāpaṃ, attanā saṃkilissati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Attanā akataṃ pāpaṃ, attanāva visujjhati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Suddhī asuddhi paccattaṃ, nāñño aññaṃ visodhaye’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evampi na hi aññamokkhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vuttampi ",
      " hetaṃ bhagavatā – ‘‘evameva kho, brāhmaṇa, tiṭṭhateva nibbānaṃ, tiṭṭhati nibbānagāmimaggo, tiṭṭhāmahaṃ samādapetā. Atha ca pana mama sāvakā mayā evaṃ ovadiyamānā evaṃ anusāsiyamānā appekacce accantaniṭṭhaṃ nibbānaṃ ārādhenti, ekacce nārādhenti. Ettha kyāhaṃ, brāhmaṇa, karomi? Maggakkhāyī, brāhmaṇa, tathāgato. Maggaṃ buddho ācikkhati ",
      ". Attanā paṭipajjamānā muñceyyu’’nti. Evampi na hi aññamokkhāti – te duppamuñcā na hi aññamokkhā."
    ],
    "innerText": "Vuttampi hetaṃ bhagavatā – ‘‘evameva kho, brāhmaṇa, tiṭṭhateva nibbānaṃ, tiṭṭhati nibbānagāmimaggo, tiṭṭhāmahaṃ samādapetā. Atha ca pana mama sāvakā mayā evaṃ ovadiyamānā evaṃ anusāsiyamānā appekacce accantaniṭṭhaṃ nibbānaṃ ārādhenti, ekacce nārādhenti. Ettha kyāhaṃ, brāhmaṇa, karomi? Maggakkhāyī, brāhmaṇa, tathāgato. Maggaṃ buddho ācikkhati . Attanā paṭipajjamānā muñceyyu’’nti. Evampi na hi aññamokkhāti – te duppamuñcā na hi aññamokkhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pacchā pure vāpi apekkhamānā"
      },
      "ti. Pacchā vuccati anāgataṃ, pure vuccati atītaṃ. Api ca atītaṃ upādāya anāgatañca paccuppannañca pacchā, anāgataṃ upādāya atītañca paccuppannañca pure. Kathaṃ pure apekkhaṃ karoti? ‘‘Evaṃrūpo ahosiṃ atītamaddhāna’’nti tattha nandiṃ samannāneti. ‘‘Evaṃvedano ahosiṃ… evaṃsañño ahosiṃ… evaṃsaṅkhāro ",
      " ahosiṃ… evaṃviññāṇo ahosiṃ atītamaddhāna’’nti tattha nandiṃ samannāneti. Evampi pure apekkhaṃ karoti."
    ],
    "innerText": "Pacchā pure vāpi apekkhamānāti. Pacchā vuccati anāgataṃ, pure vuccati atītaṃ. Api ca atītaṃ upādāya anāgatañca paccuppannañca pacchā, anāgataṃ upādāya atītañca paccuppannañca pure. Kathaṃ pure apekkhaṃ karoti? ‘‘Evaṃrūpo ahosiṃ atītamaddhāna’’nti tattha nandiṃ samannāneti. ‘‘Evaṃvedano ahosiṃ… evaṃsañño ahosiṃ… evaṃsaṅkhāro ahosiṃ… evaṃviññāṇo ahosiṃ atītamaddhāna’’nti tattha nandiṃ samannāneti. Evampi pure apekkhaṃ karoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha vā ‘‘iti me cakkhu ahosi atītamaddhānaṃ, iti rūpā’’ti – tattha chandarāgapaṭibaddhaṃ hoti viññāṇaṃ. Chandarāgapaṭibaddhattā viññāṇassa tadabhinandati. Tadabhinandanto evampi pure apekkhaṃ karoti. ‘‘Iti me sotaṃ ahosi atītamaddhānaṃ, iti saddā’’ti…pe… ‘‘iti me ghānaṃ ahosi atītamaddhānaṃ, iti gandhā’’ti… ‘‘iti me jivhā ahosi atītamaddhānaṃ, iti rasā’’ti… ‘‘iti me kāyo ahosi atītamaddhānaṃ, iti phoṭṭhabbā’’ti… ‘‘iti me mano ahosi atītamaddhānaṃ, iti dhammā’’ti – tattha chandarāgapaṭibaddhaṃ hoti viññāṇaṃ. Chandarāgapaṭibaddhattā viññāṇassa tadabhinandati. Tadabhinandanto evampi pure apekkhaṃ karoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " vā yānissa tāni pubbe mātugāmena saddhiṃ hasitalapitakīḷitāni tadassādeti taṃ nikāmeti, tena ca vittiṃ āpajjati. Evampi pure apekkhaṃ karoti."
    ],
    "innerText": "Atha vā yānissa tāni pubbe mātugāmena saddhiṃ hasitalapitakīḷitāni tadassādeti taṃ nikāmeti, tena ca vittiṃ āpajjati. Evampi pure apekkhaṃ karoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kathaṃ pacchā apekkhaṃ karoti? ‘‘Evaṃrūpo siyaṃ anāgatamaddhāna’’nti tattha nandiṃ samannāneti. ‘‘Evaṃvedano siyaṃ… evaṃsañño siyaṃ… evaṃsaṅkhāro siyaṃ… evaṃviññāṇo siyaṃ anāgatamaddhāna’’nti tattha nandiṃ samannāneti. Evampi pacchā apekkhaṃ karoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha vā ‘‘iti me cakkhu siyā anāgatamaddhānaṃ, iti rūpā’’ti – appaṭiladdhassa paṭilābhāya cittaṃ paṇidahati. Cetaso paṇidhānapaccayā tadabhinandati. Tadabhinandanto evampi pacchā apekkhaṃ karoti. ‘‘Iti ",
      " me sotaṃ siyā anāgatamaddhānaṃ, iti saddā’’ti… ‘‘iti me ghānaṃ siyā anāgatamaddhānaṃ, iti gandhā’’ti… ‘‘iti me jivhā siyā anāgatamaddhānaṃ, iti ",
      " rasā’’ti… ‘‘iti me kāyo siyā anāgatamaddhānaṃ, iti phoṭṭhabbā’’ti… ‘‘iti me mano siyā anāgatamaddhānaṃ, iti dhammā’’ti – appaṭiladdhassa paṭilābhāya cittaṃ paṇidahati. Cetaso paṇidhānapaccayā tadabhinandati. Tadabhinandanto evampi pacchā apekkhaṃ karoti."
    ],
    "innerText": "Atha vā ‘‘iti me cakkhu siyā anāgatamaddhānaṃ, iti rūpā’’ti – appaṭiladdhassa paṭilābhāya cittaṃ paṇidahati. Cetaso paṇidhānapaccayā tadabhinandati. Tadabhinandanto evampi pacchā apekkhaṃ karoti. ‘‘Iti me sotaṃ siyā anāgatamaddhānaṃ, iti saddā’’ti… ‘‘iti me ghānaṃ siyā anāgatamaddhānaṃ, iti gandhā’’ti… ‘‘iti me jivhā siyā anāgatamaddhānaṃ, iti rasā’’ti… ‘‘iti me kāyo siyā anāgatamaddhānaṃ, iti phoṭṭhabbā’’ti… ‘‘iti me mano siyā anāgatamaddhānaṃ, iti dhammā’’ti – appaṭiladdhassa paṭilābhāya cittaṃ paṇidahati. Cetaso paṇidhānapaccayā tadabhinandati. Tadabhinandanto evampi pacchā apekkhaṃ karoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha vā ‘‘imināhaṃ sīlena vā vatena vā tapena vā brahmacariyena vā devo vā bhavissāmi devaññataro vā’’ti – appaṭiladdhassa paṭilābhāya cittaṃ paṇidahati. Cetaso paṇidhānapaccayā tadabhinandati. Tadabhinandanto evampi pacchā apekkhaṃ karotīti – pacchā pure vāpi apekkhamānā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ime va kāme purime va jappa"
      },
      "nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ime va kāme"
      },
      "ti paccuppanne ",
      " pañca kāmaguṇe icchantā sādiyantā patthayantā pihayantā abhijappantā. Purime va jappanti atīte pañca kāmaguṇe jappantā pajappantā abhijappantāti – ime va kāme purime va jappaṃ."
    ],
    "innerText": "Ime va kāme purime va jappanti. Ime va kāmeti paccuppanne pañca kāmaguṇe icchantā sādiyantā patthayantā pihayantā abhijappantā. Purime va jappanti atīte pañca kāmaguṇe jappantā pajappantā abhijappantāti – ime va kāme purime va jappaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Icchānidānā bhavasātabaddhā, te duppamuñcā na hi aññamokkhā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pacchā pure vāpi apekkhamānā, ime va kāme purime va jappa’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "9"
      },
      "."
    ],
    "innerText": "9."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāmesu"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "giddhā pasutā pamūḷhā, avadāniyā te visame niviṭṭhā;"
      }
    ],
    "innerText": "Kāmesugiddhā pasutā pamūḷhā, avadāniyā te visame niviṭṭhā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dukkhūpanītā paridevayanti, kiṃsū bhavissāma ito cutāse."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāmesu giddhā pasutā pamūḷhā"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāmā"
      },
      "ti uddānato dve kāmā – vatthukāmā ca kilesakāmā ca…pe… ime vuccanti vatthukāmā…pe… ime vuccanti kilesakāmā. Gedho vuccati taṇhā. Yo rāgo sārāgo…pe… abhijjhā lobho akusalamūlaṃ. Kilesakāmena vatthukāmesu rattā giddhā gadhitā mucchitā ajjhosannā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ajjhopannā (sī. syā.)]"
      },
      " laggā laggitā palibuddhāti – kāmesu giddhā."
    ],
    "innerText": "Kāmesu giddhā pasutā pamūḷhāti. Kāmāti uddānato dve kāmā – vatthukāmā ca kilesakāmā ca…pe… ime vuccanti vatthukāmā…pe… ime vuccanti kilesakāmā. Gedho vuccati taṇhā. Yo rāgo sārāgo…pe… abhijjhā lobho akusalamūlaṃ. Kilesakāmena vatthukāmesu rattā giddhā gadhitā mucchitā ajjhosannā [ajjhopannā (sī. syā.)] laggā laggitā palibuddhāti – kāmesu giddhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pasutā"
      },
      "ti yepi kāme esanti gavesanti pariyesanti, taccaritā tabbahulā taggarukā, tanninnā tappoṇā tappabbhārā tadadhimuttā tadadhipateyyā, tepi kāmapasutā. Yepi taṇhāvasena rūpe esanti gavesanti pariyesanti… sadde… gandhe… rase… phoṭṭhabbe…pe… pariyesanti taccaritā tabbahulā taggarukā, tanninnā tappoṇā tappabbhārā tadadhimuttā tadadhipateyyā, tepi kāmapasutā ",
      ". Yepi taṇhāvasena rūpe paṭilabhanti… sadde… gandhe ",
      "… rase… phoṭṭhabbe paṭilabhanti taccaritā tabbahulā taggarukā, tanninnā tappoṇā tappabbhārā tadadhimuttā tadadhipateyyā, tepi kāmapasutā. Yepi taṇhāvasena rūpe paribhuñjanti ",
      "… sadde… gandhe… rase… phoṭṭhabbe paribhuñjanti taccaritā tabbahulā taggarukā, tanninnā tappoṇā tappabbhārā tadadhimuttā tadadhipateyyā, tepi kāmapasutā. Yathā kalahakārako kalahapasuto, kammakārako kammapasuto, gocare caranto gocarapasuto, jhāyī jhānapasuto; evameva yepi kāme esanti gavesati pariyesanti, taccaritā tabbahulā taggarukā tanninnā tappoṇā tappabbhārā tadadhimuttā tadadhipateyyā, tepi kāmapasutā. Yepi taṇhāvasena rūpe esanti gavesanti pariyesanti… sadde… gandhe… rase… phoṭṭhabbe…pe… pariyesanti taccaritā tabbahulā taggarukā tanninnā tappoṇā tappabbhārā tadadhimuttā tadadhipateyyā, tepi kāmapasutā. Yepi taṇhāvasena rūpe paṭilabhanti… sadde… gandhe… rase… phoṭṭhabbe paṭilabhanti taccaritā tabbahulā taggarukā, tanninnā ",
      " tappoṇā tappabbhārā tadadhimuttā tadadhipateyyā, tepi kāmapasutā. Yepi taṇhāvasena rūpe paribhuñjanti… sadde… gandhe… rase… phoṭṭhabbe paribhuñjanti taccaritā tabbahulā taggarukā, tanninnā tappoṇā tappabbhārā tadadhimuttā tadadhipateyyā, tepi kāmapasutā."
    ],
    "innerText": "Pasutāti yepi kāme esanti gavesanti pariyesanti, taccaritā tabbahulā taggarukā, tanninnā tappoṇā tappabbhārā tadadhimuttā tadadhipateyyā, tepi kāmapasutā. Yepi taṇhāvasena rūpe esanti gavesanti pariyesanti… sadde… gandhe… rase… phoṭṭhabbe…pe… pariyesanti taccaritā tabbahulā taggarukā, tanninnā tappoṇā tappabbhārā tadadhimuttā tadadhipateyyā, tepi kāmapasutā . Yepi taṇhāvasena rūpe paṭilabhanti… sadde… gandhe … rase… phoṭṭhabbe paṭilabhanti taccaritā tabbahulā taggarukā, tanninnā tappoṇā tappabbhārā tadadhimuttā tadadhipateyyā, tepi kāmapasutā. Yepi taṇhāvasena rūpe paribhuñjanti … sadde… gandhe… rase… phoṭṭhabbe paribhuñjanti taccaritā tabbahulā taggarukā, tanninnā tappoṇā tappabbhārā tadadhimuttā tadadhipateyyā, tepi kāmapasutā. Yathā kalahakārako kalahapasuto, kammakārako kammapasuto, gocare caranto gocarapasuto, jhāyī jhānapasuto; evameva yepi kāme esanti gavesati pariyesanti, taccaritā tabbahulā taggarukā tanninnā tappoṇā tappabbhārā tadadhimuttā tadadhipateyyā, tepi kāmapasutā. Yepi taṇhāvasena rūpe esanti gavesanti pariyesanti… sadde… gandhe… rase… phoṭṭhabbe…pe… pariyesanti taccaritā tabbahulā taggarukā tanninnā tappoṇā tappabbhārā tadadhimuttā tadadhipateyyā, tepi kāmapasutā. Yepi taṇhāvasena rūpe paṭilabhanti… sadde… gandhe… rase… phoṭṭhabbe paṭilabhanti taccaritā tabbahulā taggarukā, tanninnā tappoṇā tappabbhārā tadadhimuttā tadadhipateyyā, tepi kāmapasutā. Yepi taṇhāvasena rūpe paribhuñjanti… sadde… gandhe… rase… phoṭṭhabbe paribhuñjanti taccaritā tabbahulā taggarukā, tanninnā tappoṇā tappabbhārā tadadhimuttā tadadhipateyyā, tepi kāmapasutā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pamūḷhā"
      },
      "ti yebhuyyena devamanussā pañcasu kāmaguṇesu muyhanti sammuyhanti sampamuyhanti mūḷhā sammūḷhā sampamūḷhā avijjāya andhīkatā āvutā ",
      " nivutā ovutā pihitā paṭicchannā paṭikujjitāti – kāmesu giddhā pasutā pamūḷhā."
    ],
    "innerText": "Pamūḷhāti yebhuyyena devamanussā pañcasu kāmaguṇesu muyhanti sammuyhanti sampamuyhanti mūḷhā sammūḷhā sampamūḷhā avijjāya andhīkatā āvutā nivutā ovutā pihitā paṭicchannā paṭikujjitāti – kāmesu giddhā pasutā pamūḷhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avadāniyā te visame niviṭṭhā"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avadāniyā"
      },
      "ti avagacchantītipi avadāniyā, maccharinopi vuccanti avadāniyā, buddhānaṃ sāvakānaṃ vacanaṃ byappathaṃ ",
      " desanaṃ anusiṭṭhiṃ nādiyantīti – avadāniyā. Kathaṃ avagacchantīti avadāniyā? Nirayaṃ gacchanti, tiracchānayoniṃ gacchanti, pettivisayaṃ gacchantīti, evaṃ āgacchantīti – avadāniyā. Kathaṃ maccharino vuccanti avadāniyā? Pañca macchariyāni – āvāsamacchariyaṃ, kulamacchariyaṃ, lābhamacchariyaṃ, vaṇṇamacchariyaṃ, dhammamacchariyaṃ. Yaṃ evarūpaṃ macchariyaṃ maccharāyanā maccharāyitattaṃ vevicchaṃ kadariyaṃ kaṭukañcukatā aggahitattaṃ cittassa, idaṃ vuccati macchariyaṃ. Api ca, khandhamacchariyampi macchariyaṃ, dhātumacchariyampi macchariyaṃ, āyatanamacchariyampi macchariyaṃ gāho. Idaṃ vuccati macchariyaṃ. Iminā macchariyena avadaññutāya samannāgatā janā pamattā. Evaṃ maccharino vuccanti avadāniyā. Kathaṃ buddhānaṃ sāvakānaṃ vacanaṃ byappathaṃ desanaṃ anusiṭṭhiṃ nādiyantīti – avadāniyā? Buddhānaṃ sāvakānaṃ vacanaṃ byappathaṃ desanaṃ anusiṭṭhiṃ ",
      " na ādiyanti na sussusanti, na sotaṃ odahanti, na aññā ",
      " cittaṃ upaṭṭhapenti, anassavā avacanakarā paṭilomavuttino, aññeneva mukhaṃ karonti. Evaṃ buddhānaṃ sāvakānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[buddhānaṃ buddhasāvakānaṃ (sī. syā.)]"
      },
      " vacanaṃ byappathaṃ desanaṃ anusiṭṭhiṃ nādiyantīti avadāniyāti – avadāniyā."
    ],
    "innerText": "Avadāniyā te visame niviṭṭhāti. Avadāniyāti avagacchantītipi avadāniyā, maccharinopi vuccanti avadāniyā, buddhānaṃ sāvakānaṃ vacanaṃ byappathaṃ desanaṃ anusiṭṭhiṃ nādiyantīti – avadāniyā. Kathaṃ avagacchantīti avadāniyā? Nirayaṃ gacchanti, tiracchānayoniṃ gacchanti, pettivisayaṃ gacchantīti, evaṃ āgacchantīti – avadāniyā. Kathaṃ maccharino vuccanti avadāniyā? Pañca macchariyāni – āvāsamacchariyaṃ, kulamacchariyaṃ, lābhamacchariyaṃ, vaṇṇamacchariyaṃ, dhammamacchariyaṃ. Yaṃ evarūpaṃ macchariyaṃ maccharāyanā maccharāyitattaṃ vevicchaṃ kadariyaṃ kaṭukañcukatā aggahitattaṃ cittassa, idaṃ vuccati macchariyaṃ. Api ca, khandhamacchariyampi macchariyaṃ, dhātumacchariyampi macchariyaṃ, āyatanamacchariyampi macchariyaṃ gāho. Idaṃ vuccati macchariyaṃ. Iminā macchariyena avadaññutāya samannāgatā janā pamattā. Evaṃ maccharino vuccanti avadāniyā. Kathaṃ buddhānaṃ sāvakānaṃ vacanaṃ byappathaṃ desanaṃ anusiṭṭhiṃ nādiyantīti – avadāniyā? Buddhānaṃ sāvakānaṃ vacanaṃ byappathaṃ desanaṃ anusiṭṭhiṃ na ādiyanti na sussusanti, na sotaṃ odahanti, na aññā cittaṃ upaṭṭhapenti, anassavā avacanakarā paṭilomavuttino, aññeneva mukhaṃ karonti. Evaṃ buddhānaṃ sāvakānaṃ [buddhānaṃ buddhasāvakānaṃ (sī. syā.)] vacanaṃ byappathaṃ desanaṃ anusiṭṭhiṃ nādiyantīti avadāniyāti – avadāniyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Te visame niviṭṭhā"
      },
      "ti visame kāyakamme niviṭṭhā, visame vacīkamme niviṭṭhā, visame manokamme niviṭṭhā, visame pāṇātipāte niviṭṭhā, visame adinnādāne niviṭṭhā, visame kāmesumicchācāre niviṭṭhā, visame musāvāde niviṭṭhā, visamāya pisuṇāya vācāya niviṭṭhā ",
      ", visamāya pharusāya vācāya… visame samphappalāpe… visamāya abhijjhāya niviṭṭhā, visame byāpāde… visamāya micchādiṭṭhiyā niviṭṭhā, visamesu saṅkhāresu niviṭṭhā, visamesu pañcasu kāmaguṇesu niviṭṭhā, visamesu pañcasu nīvaraṇesu niviṭṭhā viniviṭṭhā ",
      " patiṭṭhitā allīnā upagatā ajjhositā adhimuttā laggā laggitā palibuddhāti – avadāniyā te visame niviṭṭhā."
    ],
    "innerText": "Te visame niviṭṭhāti visame kāyakamme niviṭṭhā, visame vacīkamme niviṭṭhā, visame manokamme niviṭṭhā, visame pāṇātipāte niviṭṭhā, visame adinnādāne niviṭṭhā, visame kāmesumicchācāre niviṭṭhā, visame musāvāde niviṭṭhā, visamāya pisuṇāya vācāya niviṭṭhā , visamāya pharusāya vācāya… visame samphappalāpe… visamāya abhijjhāya niviṭṭhā, visame byāpāde… visamāya micchādiṭṭhiyā niviṭṭhā, visamesu saṅkhāresu niviṭṭhā, visamesu pañcasu kāmaguṇesu niviṭṭhā, visamesu pañcasu nīvaraṇesu niviṭṭhā viniviṭṭhā patiṭṭhitā allīnā upagatā ajjhositā adhimuttā laggā laggitā palibuddhāti – avadāniyā te visame niviṭṭhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dukkhūpanītā paridevayantī"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dukkhūpanītā"
      },
      "ti dukkhappattā dukkhasampattā dukkhūpagatā, mārappattā mārasampattā mārūpagatā, maraṇappattā maraṇasampattā maraṇūpagatā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paridevayantī"
      },
      "ti lapanti lālapanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sallapanti (sī.)]"
      },
      ", socanti kilamanti paridevanti urattāḷiṃ kandanti sammohaṃ āpajjantīti – dukkhūpanītā paridevayanti."
    ],
    "innerText": "Dukkhūpanītā paridevayantīti. Dukkhūpanītāti dukkhappattā dukkhasampattā dukkhūpagatā, mārappattā mārasampattā mārūpagatā, maraṇappattā maraṇasampattā maraṇūpagatā. Paridevayantīti lapanti lālapanti [sallapanti (sī.)], socanti kilamanti paridevanti urattāḷiṃ kandanti sammohaṃ āpajjantīti – dukkhūpanītā paridevayanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kiṃsū"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhavissāma ito cutāse"
      },
      "ti ito cutā kiṃ bhavissāma? Nerayikā bhavissāma, tiracchānayonikā bhavissāma, pettivisayikā bhavissāma, manussā bhavissāma, devā bhavissāma, rūpī bhavissāma, arūpī bhavissāma, saññī bhavissāma, asaññī bhavissāma, nevasaññīnāsaññī bhavissāma, ‘‘bhavissāma nu kho mayaṃ anāgatamaddhānaṃ, nanu kho bhavissāma anāgatamaddhānaṃ, kiṃ nu kho bhavissāma anāgatamaddhānaṃ, kathaṃ nu kho bhavissāma anāgatamaddhānaṃ, kiṃ hutvā kiṃ bhavissāma nu kho mayaṃ anāgatamaddhāna’’nti saṃsayapakkhandā vimatipakkhandā dveḷhakajātā lapanti lālapanti, socanti kilamanti paridevanti urattāḷiṃ kandanti sammohaṃ āpajjantīti – kiṃsū bhavissāma ito cutāse."
    ],
    "innerText": "Kiṃsūbhavissāma ito cutāseti ito cutā kiṃ bhavissāma? Nerayikā bhavissāma, tiracchānayonikā bhavissāma, pettivisayikā bhavissāma, manussā bhavissāma, devā bhavissāma, rūpī bhavissāma, arūpī bhavissāma, saññī bhavissāma, asaññī bhavissāma, nevasaññīnāsaññī bhavissāma, ‘‘bhavissāma nu kho mayaṃ anāgatamaddhānaṃ, nanu kho bhavissāma anāgatamaddhānaṃ, kiṃ nu kho bhavissāma anāgatamaddhānaṃ, kathaṃ nu kho bhavissāma anāgatamaddhānaṃ, kiṃ hutvā kiṃ bhavissāma nu kho mayaṃ anāgatamaddhāna’’nti saṃsayapakkhandā vimatipakkhandā dveḷhakajātā lapanti lālapanti, socanti kilamanti paridevanti urattāḷiṃ kandanti sammohaṃ āpajjantīti – kiṃsū bhavissāma ito cutāse."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Kāmesu ",
      " giddhā pasutā pamūḷhā, avadāniyā te visame niviṭṭhā;"
    ],
    "innerText": "‘‘Kāmesu giddhā pasutā pamūḷhā, avadāniyā te visame niviṭṭhā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dukkhūpanītā paridevayanti, kiṃsū bhavissāma ito cutāse’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "10"
      },
      "."
    ],
    "innerText": "10."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasmā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hi sikkhetha idheva jantu,"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yaṃ kiñci jaññā visamanti loke;"
      }
    ],
    "innerText": "Tasmāhi sikkhetha idheva jantu,yaṃ kiñci jaññā visamanti loke;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Na tassa hetū visamaṃ careyya, appañhidaṃ jīvitamāhu dhīrā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasmā hi sikkhetha idheva jantū"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasmā"
      },
      "ti taṃkāraṇā ",
      " taṃhetu tappaccayā tannidānā, etamādīnavaṃ sampassamāno kāmesūti – tasmā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sikkhethā"
      },
      "ti tisso sikkhā – adhisīlasikkhā, adhicittasikkhā, adhipaññāsikkhā."
    ],
    "innerText": "Tasmā hi sikkhetha idheva jantūti. Tasmāti taṃkāraṇā taṃhetu tappaccayā tannidānā, etamādīnavaṃ sampassamāno kāmesūti – tasmā. Sikkhethāti tisso sikkhā – adhisīlasikkhā, adhicittasikkhā, adhipaññāsikkhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katamā adhisīlasikkhā? Idha bhikkhu sīlavā hoti, pātimokkhasaṃvarasaṃvuto ",
      " viharati ācāragocarasampanno, aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu. Khuddako sīlakkhandho, mahanto sīlakkhandho, sīlaṃ patiṭṭhā ādi caraṇaṃ saṃyamo saṃvaro mokkhaṃ pāmokkhaṃ kusalānaṃ dhammānaṃ samāpattiyā – ayaṃ adhisīlasikkhā."
    ],
    "innerText": "Katamā adhisīlasikkhā? Idha bhikkhu sīlavā hoti, pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno, aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu. Khuddako sīlakkhandho, mahanto sīlakkhandho, sīlaṃ patiṭṭhā ādi caraṇaṃ saṃyamo saṃvaro mokkhaṃ pāmokkhaṃ kusalānaṃ dhammānaṃ samāpattiyā – ayaṃ adhisīlasikkhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Katamā adhicittasikkhā? Idha bhikkhu vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati. Vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja viharati. Pītiyā ca virāgā upekkhako ca viharati sato ca sampajāno sukhañca kāyena paṭisaṃvedeti, yaṃ taṃ ariyā ācikkhanti – ‘upekkhako satimā sukhavihārī’ti tatiyaṃ jhānaṃ upasampajja viharati. Sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharati – ayaṃ adhicittasikkhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katamā ",
      " adhipaññāsikkhā? Idha bhikkhu paññavā hoti udayatthagāminiyā paññāya samannāgato, ariyāya nibbedhikāya sammādukkhakkhayagāminiyā ",
      ". So ‘‘idaṃ dukkha’’nti yathābhūtaṃ pajānāti, ‘‘ayaṃ dukkhasamudayo’’ti yathābhūtaṃ pajānāti, ‘‘ayaṃ dukkhanirodho’’ti yathābhūtaṃ pajānāti, ‘‘ayaṃ dukkhanirodhagāminī paṭipadā’’ti yathābhūtaṃ pajānāti. ‘‘Ime āsavā’’ti yathābhūtaṃ pajānāti, ‘‘ayaṃ āsavasamudayo’’ti yathābhūtaṃ pajānāti, ‘‘ayaṃ āsavanirodho’’ti yathābhūtaṃ pajānāti, ‘‘ayaṃ āsavanirodhagāminī paṭipadā’’ti yathābhūtaṃ pajānāti – ayaṃ adhipaññāsikkhā."
    ],
    "innerText": "Katamā adhipaññāsikkhā? Idha bhikkhu paññavā hoti udayatthagāminiyā paññāya samannāgato, ariyāya nibbedhikāya sammādukkhakkhayagāminiyā . So ‘‘idaṃ dukkha’’nti yathābhūtaṃ pajānāti, ‘‘ayaṃ dukkhasamudayo’’ti yathābhūtaṃ pajānāti, ‘‘ayaṃ dukkhanirodho’’ti yathābhūtaṃ pajānāti, ‘‘ayaṃ dukkhanirodhagāminī paṭipadā’’ti yathābhūtaṃ pajānāti. ‘‘Ime āsavā’’ti yathābhūtaṃ pajānāti, ‘‘ayaṃ āsavasamudayo’’ti yathābhūtaṃ pajānāti, ‘‘ayaṃ āsavanirodho’’ti yathābhūtaṃ pajānāti, ‘‘ayaṃ āsavanirodhagāminī paṭipadā’’ti yathābhūtaṃ pajānāti – ayaṃ adhipaññāsikkhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Imā tisso sikkhāyo āvajjanto sikkheyya, jānanto sikkheyya, passanto sikkheyya ",
      ", paccavekkhanto sikkheyya, cittaṃ adhiṭṭhahanto sikkheyya, saddhāya adhimuccanto sikkheyya, vīriyaṃ paggaṇhanto sikkheyya, satiṃ upaṭṭhapento sikkheyya, cittaṃ samādahanto sikkheyya, paññāya pajānanto sikkheyya, abhiññeyyaṃ abhijānanto sikkheyya, pariññeyyaṃ parijānanto sikkheyya, pahātabbaṃ pajahanto sikkheyya, bhāvetabbaṃ bhāvento sikkheyya ",
      ", sacchikātabbaṃ sacchikaronto sikkheyya ācareyya samācareyya samādāya vatteyya."
    ],
    "innerText": "Imā tisso sikkhāyo āvajjanto sikkheyya, jānanto sikkheyya, passanto sikkheyya , paccavekkhanto sikkheyya, cittaṃ adhiṭṭhahanto sikkheyya, saddhāya adhimuccanto sikkheyya, vīriyaṃ paggaṇhanto sikkheyya, satiṃ upaṭṭhapento sikkheyya, cittaṃ samādahanto sikkheyya, paññāya pajānanto sikkheyya, abhiññeyyaṃ abhijānanto sikkheyya, pariññeyyaṃ parijānanto sikkheyya, pahātabbaṃ pajahanto sikkheyya, bhāvetabbaṃ bhāvento sikkheyya , sacchikātabbaṃ sacchikaronto sikkheyya ācareyya samācareyya samādāya vatteyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idhā"
      },
      "ti imissā diṭṭhiyā imissā khantiyā imissā ruciyā imasmiṃ ādāye imasmiṃ dhamme imasmiṃ vinaye imasmiṃ dhammavinaye imasmiṃ pāvacane imasmiṃ brahmacariye imasmiṃ satthusāsane imasmiṃ attabhāve imasmiṃ manussaloke – tena vuccati idhāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jantū"
      },
      "ti satto naro…pe… manujoti – tasmā hi sikkhetha idheva jantu."
    ],
    "innerText": "Idhāti imissā diṭṭhiyā imissā khantiyā imissā ruciyā imasmiṃ ādāye imasmiṃ dhamme imasmiṃ vinaye imasmiṃ dhammavinaye imasmiṃ pāvacane imasmiṃ brahmacariye imasmiṃ satthusāsane imasmiṃ attabhāve imasmiṃ manussaloke – tena vuccati idhāti. Jantūti satto naro…pe… manujoti – tasmā hi sikkhetha idheva jantu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yaṃ kiñci jaññā visamanti loke"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yaṃ kiñcī"
      },
      "ti sabbena sabbaṃ ",
      " sabbathā sabbaṃ asesaṃ nissesaṃ pariyādiyanavacanametaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[paridāyavacanametaṃ (syā.)]"
      },
      " – yaṃ kiñcīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Visamanti jaññā"
      },
      "ti visamaṃ kāyakammaṃ visamanti jāneyya, visamaṃ vacīkammaṃ visamanti jāneyya, visamaṃ manokammaṃ visamanti jāneyya, visamaṃ pāṇātipātaṃ visamoti jāneyya, visamaṃ adinnādānaṃ visamanti jāneyya, visamaṃ kāmesumicchācāraṃ visamoti jāneyya, visamaṃ musāvādaṃ visamoti jāneyya, visamaṃ pisuṇaṃ vācaṃ visamāti jāneyya, visamaṃ pharusaṃ vācaṃ visamāti jāneyya, visamaṃ samphappalāpaṃ visamoti jāneyya, visamaṃ abhijjhaṃ visamāti jāneyya, visamaṃ byāpādaṃ visamoti jāneyya, visamaṃ micchādiṭṭhiṃ visamāti jāneyya, visame saṅkhāre visamāti jāneyya, visame pañca kāmaguṇe visamāti jāneyya, visame pañca nīvaraṇe visamāti jāneyya ājāneyya vijāneyya paṭivijāneyya paṭivijjheyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Loke"
      },
      "ti apāyaloke…pe… āyatanaloketi – yaṃ kiñci jaññā visamanti loke."
    ],
    "innerText": "Yaṃ kiñci jaññā visamanti loketi. Yaṃ kiñcīti sabbena sabbaṃ sabbathā sabbaṃ asesaṃ nissesaṃ pariyādiyanavacanametaṃ [paridāyavacanametaṃ (syā.)] – yaṃ kiñcīti. Visamanti jaññāti visamaṃ kāyakammaṃ visamanti jāneyya, visamaṃ vacīkammaṃ visamanti jāneyya, visamaṃ manokammaṃ visamanti jāneyya, visamaṃ pāṇātipātaṃ visamoti jāneyya, visamaṃ adinnādānaṃ visamanti jāneyya, visamaṃ kāmesumicchācāraṃ visamoti jāneyya, visamaṃ musāvādaṃ visamoti jāneyya, visamaṃ pisuṇaṃ vācaṃ visamāti jāneyya, visamaṃ pharusaṃ vācaṃ visamāti jāneyya, visamaṃ samphappalāpaṃ visamoti jāneyya, visamaṃ abhijjhaṃ visamāti jāneyya, visamaṃ byāpādaṃ visamoti jāneyya, visamaṃ micchādiṭṭhiṃ visamāti jāneyya, visame saṅkhāre visamāti jāneyya, visame pañca kāmaguṇe visamāti jāneyya, visame pañca nīvaraṇe visamāti jāneyya ājāneyya vijāneyya paṭivijāneyya paṭivijjheyya. Loketi apāyaloke…pe… āyatanaloketi – yaṃ kiñci jaññā visamanti loke."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na tassa hetū visamaṃ careyyā"
      },
      "ti. Visamassa kāyakammassa hetu visamaṃ na careyya, visamassa vacīkammassa hetu visamaṃ na careyya, visamassa manokammassa hetu visamaṃ na careyya, visamassa pāṇātipātassa hetu visamaṃ na careyya, visamassa adinnādānassa hetu visamaṃ na careyya, visamassa kāmesumicchācārassa hetu visamaṃ ",
      " na careyya, visamassa musāvādassa hetu visamaṃ na careyya, visamāya pisuṇāya vācāya hetu visamaṃ na careyya, visamāya pharusāya vācāya hetu visamaṃ na careyya, visamassa samphappalāpassa hetu visamaṃ na careyya, visamāya abhijjhāya ",
      " hetu visamaṃ na careyya, visamassa byāpādassa hetu visamaṃ ",
      " na careyya, visamāya micchādiṭṭhiyā hetu visamaṃ na careyya, visamānaṃ saṅkhārānaṃ hetu visamaṃ na careyya, visamānaṃ ",
      " pañcannaṃ kāmaguṇānaṃ hetu visamaṃ na careyya, visamānaṃ pañcannaṃ nīvaraṇānaṃ hetu visamaṃ na careyya, visamāya cetanāya hetu visamaṃ na careyya, visamāya patthanāya hetu visamaṃ na careyya, visamāya paṇidhiyā hetu visamaṃ na careyya na ācareyya na samācareyya na samādāya vatteyyāti – na tassa hetū visamaṃ careyya."
    ],
    "innerText": "Na tassa hetū visamaṃ careyyāti. Visamassa kāyakammassa hetu visamaṃ na careyya, visamassa vacīkammassa hetu visamaṃ na careyya, visamassa manokammassa hetu visamaṃ na careyya, visamassa pāṇātipātassa hetu visamaṃ na careyya, visamassa adinnādānassa hetu visamaṃ na careyya, visamassa kāmesumicchācārassa hetu visamaṃ na careyya, visamassa musāvādassa hetu visamaṃ na careyya, visamāya pisuṇāya vācāya hetu visamaṃ na careyya, visamāya pharusāya vācāya hetu visamaṃ na careyya, visamassa samphappalāpassa hetu visamaṃ na careyya, visamāya abhijjhāya hetu visamaṃ na careyya, visamassa byāpādassa hetu visamaṃ na careyya, visamāya micchādiṭṭhiyā hetu visamaṃ na careyya, visamānaṃ saṅkhārānaṃ hetu visamaṃ na careyya, visamānaṃ pañcannaṃ kāmaguṇānaṃ hetu visamaṃ na careyya, visamānaṃ pañcannaṃ nīvaraṇānaṃ hetu visamaṃ na careyya, visamāya cetanāya hetu visamaṃ na careyya, visamāya patthanāya hetu visamaṃ na careyya, visamāya paṇidhiyā hetu visamaṃ na careyya na ācareyya na samācareyya na samādāya vatteyyāti – na tassa hetū visamaṃ careyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appañhidaṃ jīvitamāhu dhīrā"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jīvita"
      },
      "nti āyu ṭhiti yapanā yāpanā iriyanā vattanā pālanā jīvitaṃ jīvitindriyaṃ. Api ca, dvīhi kāraṇehi appakaṃ jīvitaṃ – ṭhitiparittatāya vā appakaṃ jīvitaṃ, sarasaparittatāya vā appakaṃ jīvitaṃ. Kathaṃ ṭhitiparittatāya appakaṃ jīvitaṃ? Atīte cittakkhaṇe jīvittha, na jīvati na jīvissati; anāgate cittakkhaṇe jīvissati, na jīvati na jīvittha; paccuppanne cittakkhaṇe jīvati, na jīvittha na jīvissati."
    ],
    "innerText": "Appañhidaṃ jīvitamāhu dhīrāti. Jīvitanti āyu ṭhiti yapanā yāpanā iriyanā vattanā pālanā jīvitaṃ jīvitindriyaṃ. Api ca, dvīhi kāraṇehi appakaṃ jīvitaṃ – ṭhitiparittatāya vā appakaṃ jīvitaṃ, sarasaparittatāya vā appakaṃ jīvitaṃ. Kathaṃ ṭhitiparittatāya appakaṃ jīvitaṃ? Atīte cittakkhaṇe jīvittha, na jīvati na jīvissati; anāgate cittakkhaṇe jīvissati, na jīvati na jīvittha; paccuppanne cittakkhaṇe jīvati, na jīvittha na jīvissati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Jīvitaṃ attabhāvo ca, sukhadukkhā ca kevalā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ekacittasamāyuttā, lahuso vattate khaṇo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Cullāsītisahassāni ",
      ", kappā tiṭṭhanti ye marū;"
    ],
    "innerText": "‘‘Cullāsītisahassāni , kappā tiṭṭhanti ye marū;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Natveva tepi jīvanti, dvīhi cittehi saṃyutā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ye niruddhā marantassa, tiṭṭhamānassa vā idha;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sabbepi sadisā khandhā, gatā appaṭisandhikā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Anantarā ca ye bhaggā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[bhaṅgā (sī. syā.)]"
      },
      ", ye ca bhaggā anāgatā;"
    ],
    "innerText": "‘‘Anantarā ca ye bhaggā [bhaṅgā (sī. syā.)], ye ca bhaggā anāgatā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tadantare niruddhānaṃ, vesamaṃ natthi lakkhaṇe."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Anibbattena na jāto, paccuppannena jīvati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Cittabhaggā mato loko, paññatti paramatthiyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yathā ninnā pavattanti, chandena pariṇāmitā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Acchinnadhārā vattanti, saḷāyatanapaccayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Anidhānagatā ",
      " bhaggā, puñjo natthi anāgate;"
    ],
    "innerText": "‘‘Anidhānagatā bhaggā, puñjo natthi anāgate;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Nibbattā ye ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[nibbattāyeva (sabbattha)]"
      },
      " tiṭṭhanti, āragge sāsapūpamā."
    ],
    "innerText": "Nibbattā ye ca [nibbattāyeva (sabbattha)] tiṭṭhanti, āragge sāsapūpamā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Nibbattānañca ",
      " dhammānaṃ, bhaṅgo nesaṃ purakkhato;"
    ],
    "innerText": "‘‘Nibbattānañca dhammānaṃ, bhaṅgo nesaṃ purakkhato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Palokadhammā tiṭṭhanti, purāṇehi amissitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Adassanato āyanti, bhaṅgā gacchanti dassanaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vijjuppādova ākāse, uppajjanti vayanti cā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ ṭhitiparittatāya appakaṃ jīvitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ sarasaparittatāya appakaṃ jīvitaṃ? Assāsūpanibandhaṃ jīvitaṃ, passāsūpanibandhaṃ jīvitaṃ, assāsapassāsūpanibandhaṃ jīvitaṃ, mahābhūtūpanibandhaṃ ",
      " jīvitaṃ, kabaḷīkārāhārūpanibandhaṃ jīvitaṃ, usmūpanibandhaṃ jīvitaṃ, viññāṇūpanibandhaṃ jīvitaṃ. Mūlampi imesaṃ dubbalaṃ, pubbahetūpi imesaṃ dubbalā. Ye paccayā tepi dubbalā, yepi pabhāvikā tepi dubbalā. Sahabhūmi imesaṃ dubbalā, sampayogāpi imesaṃ dubbalā, sahajāpi imesaṃ dubbalā, yāpi payojikā sāpi dubbalā, aññamaññaṃ ime niccadubbalā, aññamaññaṃ anavaṭṭhitā ime. Aññamaññaṃ paripātayanti ime, aññamaññassa hi natthi tāyitā, na cāpi ṭhapenti aññamaññaṃ ime. Yopi nibbattako so na vijjati."
    ],
    "innerText": "Kathaṃ sarasaparittatāya appakaṃ jīvitaṃ? Assāsūpanibandhaṃ jīvitaṃ, passāsūpanibandhaṃ jīvitaṃ, assāsapassāsūpanibandhaṃ jīvitaṃ, mahābhūtūpanibandhaṃ jīvitaṃ, kabaḷīkārāhārūpanibandhaṃ jīvitaṃ, usmūpanibandhaṃ jīvitaṃ, viññāṇūpanibandhaṃ jīvitaṃ. Mūlampi imesaṃ dubbalaṃ, pubbahetūpi imesaṃ dubbalā. Ye paccayā tepi dubbalā, yepi pabhāvikā tepi dubbalā. Sahabhūmi imesaṃ dubbalā, sampayogāpi imesaṃ dubbalā, sahajāpi imesaṃ dubbalā, yāpi payojikā sāpi dubbalā, aññamaññaṃ ime niccadubbalā, aññamaññaṃ anavaṭṭhitā ime. Aññamaññaṃ paripātayanti ime, aññamaññassa hi natthi tāyitā, na cāpi ṭhapenti aññamaññaṃ ime. Yopi nibbattako so na vijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Na ca kenaci koci hāyati, gandhabbā ca ime hi sabbaso;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Purimehi pabhāvikā ime, yepi pabhāvikā te pure matā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Purimāpi ca pacchimāpi ",
      " ca, aññamaññaṃ na kadāci maddasaṃsū’’ti."
    ],
    "innerText": "Purimāpi ca pacchimāpi ca, aññamaññaṃ na kadāci maddasaṃsū’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ sarasaparittatāya appakaṃ jīvitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Api ca cātumahārājikānaṃ devānaṃ jīvitaṃ upādāya manussānaṃ appakaṃ jīvitaṃ parittakaṃ jīvitaṃ thokaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[thokakaṃ (ka.)]"
      },
      " jīvitaṃ khaṇikaṃ jīvitaṃ lahukaṃ jīvitaṃ ittaraṃ jīvitaṃ anaddhanīyaṃ jīvitaṃ naciraṭṭhitikaṃ ",
      " jīvitaṃ. Tāvatiṃsānaṃ devānaṃ…pe… yāmānaṃ devānaṃ… tusitānaṃ devānaṃ… nimmānaratīnaṃ devānaṃ… paranimmitavasavattīnaṃ devānaṃ… brahmakāyikānaṃ devānaṃ jīvitaṃ ",
      " upādāya manussānaṃ appakaṃ jīvitaṃ parittakaṃ jīvitaṃ thokaṃ jīvitaṃ khaṇikaṃ jīvitaṃ lahukaṃ jīvitaṃ ittaraṃ jīvitaṃ anaddhanīyaṃ jīvitaṃ naciraṭṭhitikaṃ jīvitaṃ."
    ],
    "innerText": "Api ca cātumahārājikānaṃ devānaṃ jīvitaṃ upādāya manussānaṃ appakaṃ jīvitaṃ parittakaṃ jīvitaṃ thokaṃ [thokakaṃ (ka.)] jīvitaṃ khaṇikaṃ jīvitaṃ lahukaṃ jīvitaṃ ittaraṃ jīvitaṃ anaddhanīyaṃ jīvitaṃ naciraṭṭhitikaṃ jīvitaṃ. Tāvatiṃsānaṃ devānaṃ…pe… yāmānaṃ devānaṃ… tusitānaṃ devānaṃ… nimmānaratīnaṃ devānaṃ… paranimmitavasavattīnaṃ devānaṃ… brahmakāyikānaṃ devānaṃ jīvitaṃ upādāya manussānaṃ appakaṃ jīvitaṃ parittakaṃ jīvitaṃ thokaṃ jīvitaṃ khaṇikaṃ jīvitaṃ lahukaṃ jīvitaṃ ittaraṃ jīvitaṃ anaddhanīyaṃ jīvitaṃ naciraṭṭhitikaṃ jīvitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Vuttañhetaṃ bhagavatā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Appamidaṃ ",
      ", bhikkhave, manussānaṃ āyu. Gamaniyo samparāyo mantāya boddhabbaṃ, kattabbaṃ kusalaṃ, caritabbaṃ brahmacariyaṃ, natthi jātassa amaraṇaṃ. Yo, bhikkhave, ciraṃ jīvati so vassasataṃ appaṃ vā bhiyyo’’."
    ],
    "innerText": "‘‘Appamidaṃ , bhikkhave, manussānaṃ āyu. Gamaniyo samparāyo mantāya boddhabbaṃ, kattabbaṃ kusalaṃ, caritabbaṃ brahmacariyaṃ, natthi jātassa amaraṇaṃ. Yo, bhikkhave, ciraṃ jīvati so vassasataṃ appaṃ vā bhiyyo’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Appamāyu manussānaṃ, hīḷeyya naṃ suporiso;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Careyyādittasīsova natthi maccussanāgamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Accayanti ahorattā, jīvitaṃ uparujjhati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Āyu khiyyati maccānaṃ, kunnadīnaṃva odaka’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appañhidaṃ jīvitamāhu dhīrā"
      },
      "ti. Dhīrāti dhīrā, dhitimāti dhīrā, dhitisampannāti dhīrā, dhīkatapāpāti dhīrā. Dhī vuccati paññā. Yā paññā pajānanā vicayo pavicayo dhammavicayo ",
      " sallakkhaṇā upalakkhaṇā paccupalakkhaṇā paṇḍiccaṃ kosallaṃ nepuññaṃ vebhabyā cintā upaparikkhā bhūri medhā pariṇāyikā vipassanā sampajaññaṃ patodo paññā paññindriyaṃ paññābalaṃ paññāsatthaṃ paññāpāsādo paññāāloko paññāobhāso paññāpajjoto paññāratanaṃ amoho dhammavicayo sammādiṭṭhi, tāya paññāya samannāgatattā dhīrā. Api ca khandhadhīrā dhātudhīrā āyatanadhīrā, paṭiccasamuppādadhīrā satipaṭṭhānadhīrā sammappadhānadhīrā iddhipādadhīrā, indriyadhīrā baladhīrā bojjhaṅgadhīrā maggadhīrā phaladhīrā nibbānadhīrā. Te dhīrā evamāhaṃsu – ‘‘manussānaṃ appakaṃ jīvitaṃ, parittakaṃ jīvitaṃ ",
      ", thokaṃ jīvitaṃ, khaṇikaṃ jīvitaṃ, lahukaṃ jīvitaṃ, ittaraṃ jīvitaṃ, anaddhanīyaṃ jīvitaṃ, naciraṭṭhitikaṃ jīvita’’nti. Evamāhaṃsu evaṃ kathenti evaṃ bhaṇanti evaṃ dīpayanti evaṃ voharantīti – appañhidaṃ jīvitamāhu dhīrā."
    ],
    "innerText": "Appañhidaṃ jīvitamāhu dhīrāti. Dhīrāti dhīrā, dhitimāti dhīrā, dhitisampannāti dhīrā, dhīkatapāpāti dhīrā. Dhī vuccati paññā. Yā paññā pajānanā vicayo pavicayo dhammavicayo sallakkhaṇā upalakkhaṇā paccupalakkhaṇā paṇḍiccaṃ kosallaṃ nepuññaṃ vebhabyā cintā upaparikkhā bhūri medhā pariṇāyikā vipassanā sampajaññaṃ patodo paññā paññindriyaṃ paññābalaṃ paññāsatthaṃ paññāpāsādo paññāāloko paññāobhāso paññāpajjoto paññāratanaṃ amoho dhammavicayo sammādiṭṭhi, tāya paññāya samannāgatattā dhīrā. Api ca khandhadhīrā dhātudhīrā āyatanadhīrā, paṭiccasamuppādadhīrā satipaṭṭhānadhīrā sammappadhānadhīrā iddhipādadhīrā, indriyadhīrā baladhīrā bojjhaṅgadhīrā maggadhīrā phaladhīrā nibbānadhīrā. Te dhīrā evamāhaṃsu – ‘‘manussānaṃ appakaṃ jīvitaṃ, parittakaṃ jīvitaṃ , thokaṃ jīvitaṃ, khaṇikaṃ jīvitaṃ, lahukaṃ jīvitaṃ, ittaraṃ jīvitaṃ, anaddhanīyaṃ jīvitaṃ, naciraṭṭhitikaṃ jīvita’’nti. Evamāhaṃsu evaṃ kathenti evaṃ bhaṇanti evaṃ dīpayanti evaṃ voharantīti – appañhidaṃ jīvitamāhu dhīrā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tasmā hi sikkhetha idheva jantu, yaṃ kiñci jaññā visamanti loke;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Na tassa hetū visamaṃ careyya, appañhidaṃ jīvitamāhu dhīrā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "11"
      },
      "."
    ],
    "innerText": "11."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Passāmi"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "loke pariphandamānaṃ, pajaṃ imaṃ taṇhagataṃ bhavesu;"
      }
    ],
    "innerText": "Passāmiloke pariphandamānaṃ, pajaṃ imaṃ taṇhagataṃ bhavesu;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Hīnā narā maccumukhe lapanti, avītataṇhāse bhavābhavesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Passāmi"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "loke pariphandamāna"
      },
      "nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Passāmī"
      },
      "ti maṃsacakkhunāpi passāmi, dibbacakkhunāpi passāmi, paññācakkhunāpi passāmi, buddhacakkhunāpi passāmi, samantacakkhunāpi passāmi dakkhāmi olokemi nijjhāyāmi upaparikkhāmi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Loke"
      },
      "ti apāyaloke manussaloke devaloke khandhaloke ",
      " dhātuloke āyatanaloke."
    ],
    "innerText": "Passāmiloke pariphandamānanti. Passāmīti maṃsacakkhunāpi passāmi, dibbacakkhunāpi passāmi, paññācakkhunāpi passāmi, buddhacakkhunāpi passāmi, samantacakkhunāpi passāmi dakkhāmi olokemi nijjhāyāmi upaparikkhāmi. Loketi apāyaloke manussaloke devaloke khandhaloke dhātuloke āyatanaloke."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pariphandamāna"
      },
      "nti taṇhāphandanāya phandamānaṃ, diṭṭhiphandanāya phandamānaṃ, kilesaphandanāya phandamānaṃ, payogaphandanāya phandamānaṃ, vipākaphandanāya phandamānaṃ, duccaritaphandanāya phandamānaṃ, rattaṃ rāgena phandamānaṃ, duṭṭhaṃ ",
      " dosena phandamānaṃ, mūḷhaṃ mohena phandamānaṃ, vinibaddhaṃ mānena phandamānaṃ, parāmaṭṭhaṃ diṭṭhiyā phandamānaṃ, vikkhepagataṃ uddhaccena phandamānaṃ, aniṭṭhaṅgataṃ vicikicchāya phandamānaṃ, thāmagataṃ anusayehi phandamānaṃ, lābhena phandamānaṃ, alābhena phandamānaṃ, yasena phandamānaṃ, ayasena phandamānaṃ, pasaṃsāya phandamānaṃ, nindāya phandamānaṃ, sukhena phandamānaṃ, dukkhena phandamānaṃ, jātiyā phandamānaṃ, jarāya phandamānaṃ, byādhinā phandamānaṃ, maraṇena phandamānaṃ, sokaparidevadukkhadomanassupāyāsehi phandamānaṃ, nerayikena dukkhena phandamānaṃ, tiracchānayonikena dukkhena phandamānaṃ, pettivisayikena dukkhena phandamānaṃ, mānusikena dukkhena phandamānaṃ, gabbhokkantimūlakena dukkhena phandamānaṃ, gabbhe ṭhitimūlakena dukkhena phandamānaṃ, gabbhā vuṭṭhānamūlakena dukkhena phandamānaṃ, jātassūpanibandhakena dukkhena phandamānaṃ, jātassa parādheyyakena dukkhena phandamānaṃ, attūpakkamena dukkhena phandamānaṃ, parūpakkamena dukkhena phandamānaṃ, dukkhadukkhena phandamānaṃ, saṅkhāradukkhena phandamānaṃ, vipariṇāmadukkhena phandamānaṃ, cakkhurogena dukkhena phandamānaṃ, sotarogena dukkhena phandamānaṃ, ghānarogena ",
      " dukkhena…pe… jivhārogena… kāyarogena… sīsarogena… kaṇṇarogena… mukharogena… dantarogena… kāsena… sāsena… pināsena… dāhena… jarena… kucchirogena… mucchāya… pakkhandikāya… sūlāya ",
      "… visucikāya… kuṭṭhena… gaṇḍena… kilāsena… sosena… apamārena… dadduyā… kaṇḍuyā… kacchuyā… rakhasāya… vitacchikāya… lohitena… pittena… madhumehena… aṃsāya… piḷakāya… bhagandalena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[bhagandalāya (syā.)]"
      },
      " … pittasamuṭṭhānena ābādhena… semhasamuṭṭhānena ābādhena… vātasamuṭṭhānena ābādhena… sannipātikena ābādhena… utupariṇāmajena ābādhena… visamaparihārajena ābādhena… opakkamikena ābādhena ",
      " … kammavipākajena ābādhena… sītena… uṇhena… jighacchāya… pipāsāya ",
      "… uccārena… passāvena… ḍaṃsamakasavātātapasarīsapasamphassena dukkhena… mātumaraṇena dukkhena… pitumaraṇena dukkhena… bhātumaraṇena dukkhena… bhaginimaraṇena dukkhena… puttamaraṇena dukkhena… dhītumaraṇena dukkhena… ñātibyasanena… bhogabyasanena… rogabyasanena… sīlabyasanena… diṭṭhibyasanena dukkhena phandamānaṃ samphandamānaṃ vipphandamānaṃ vedhamānaṃ pavedhamānaṃ sampavedhamānaṃ passāmi dakkhāmi olokemi nijjhāyāmi upaparikkhāmīti – passāmi loke pariphandamānaṃ."
    ],
    "innerText": "Pariphandamānanti taṇhāphandanāya phandamānaṃ, diṭṭhiphandanāya phandamānaṃ, kilesaphandanāya phandamānaṃ, payogaphandanāya phandamānaṃ, vipākaphandanāya phandamānaṃ, duccaritaphandanāya phandamānaṃ, rattaṃ rāgena phandamānaṃ, duṭṭhaṃ dosena phandamānaṃ, mūḷhaṃ mohena phandamānaṃ, vinibaddhaṃ mānena phandamānaṃ, parāmaṭṭhaṃ diṭṭhiyā phandamānaṃ, vikkhepagataṃ uddhaccena phandamānaṃ, aniṭṭhaṅgataṃ vicikicchāya phandamānaṃ, thāmagataṃ anusayehi phandamānaṃ, lābhena phandamānaṃ, alābhena phandamānaṃ, yasena phandamānaṃ, ayasena phandamānaṃ, pasaṃsāya phandamānaṃ, nindāya phandamānaṃ, sukhena phandamānaṃ, dukkhena phandamānaṃ, jātiyā phandamānaṃ, jarāya phandamānaṃ, byādhinā phandamānaṃ, maraṇena phandamānaṃ, sokaparidevadukkhadomanassupāyāsehi phandamānaṃ, nerayikena dukkhena phandamānaṃ, tiracchānayonikena dukkhena phandamānaṃ, pettivisayikena dukkhena phandamānaṃ, mānusikena dukkhena phandamānaṃ, gabbhokkantimūlakena dukkhena phandamānaṃ, gabbhe ṭhitimūlakena dukkhena phandamānaṃ, gabbhā vuṭṭhānamūlakena dukkhena phandamānaṃ, jātassūpanibandhakena dukkhena phandamānaṃ, jātassa parādheyyakena dukkhena phandamānaṃ, attūpakkamena dukkhena phandamānaṃ, parūpakkamena dukkhena phandamānaṃ, dukkhadukkhena phandamānaṃ, saṅkhāradukkhena phandamānaṃ, vipariṇāmadukkhena phandamānaṃ, cakkhurogena dukkhena phandamānaṃ, sotarogena dukkhena phandamānaṃ, ghānarogena dukkhena…pe… jivhārogena… kāyarogena… sīsarogena… kaṇṇarogena… mukharogena… dantarogena… kāsena… sāsena… pināsena… dāhena… jarena… kucchirogena… mucchāya… pakkhandikāya… sūlāya … visucikāya… kuṭṭhena… gaṇḍena… kilāsena… sosena… apamārena… dadduyā… kaṇḍuyā… kacchuyā… rakhasāya… vitacchikāya… lohitena… pittena… madhumehena… aṃsāya… piḷakāya… bhagandalena [bhagandalāya (syā.)] … pittasamuṭṭhānena ābādhena… semhasamuṭṭhānena ābādhena… vātasamuṭṭhānena ābādhena… sannipātikena ābādhena… utupariṇāmajena ābādhena… visamaparihārajena ābādhena… opakkamikena ābādhena … kammavipākajena ābādhena… sītena… uṇhena… jighacchāya… pipāsāya … uccārena… passāvena… ḍaṃsamakasavātātapasarīsapasamphassena dukkhena… mātumaraṇena dukkhena… pitumaraṇena dukkhena… bhātumaraṇena dukkhena… bhaginimaraṇena dukkhena… puttamaraṇena dukkhena… dhītumaraṇena dukkhena… ñātibyasanena… bhogabyasanena… rogabyasanena… sīlabyasanena… diṭṭhibyasanena dukkhena phandamānaṃ samphandamānaṃ vipphandamānaṃ vedhamānaṃ pavedhamānaṃ sampavedhamānaṃ passāmi dakkhāmi olokemi nijjhāyāmi upaparikkhāmīti – passāmi loke pariphandamānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pajaṃ imaṃ taṇhagataṃ bhavesū"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pajā"
      },
      "ti sattādhivacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṇhā"
      },
      "ti rūpataṇhā, saddataṇhā, gandhataṇhā, rasataṇhā, phoṭṭhabbataṇhā, dhammataṇhā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṇhagata"
      },
      "nti taṇhāgataṃ taṇhānugataṃ taṇhāyānusaṭaṃ taṇhāyāsannaṃ taṇhāya pātitaṃ abhibhūtaṃ pariyādinnacittaṃ ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhavesū"
      },
      "ti kāmabhave rūpabhave arūpabhaveti – pajaṃ imaṃ taṇhagataṃ bhavesu."
    ],
    "innerText": "Pajaṃ imaṃ taṇhagataṃ bhavesūti. Pajāti sattādhivacanaṃ. Taṇhāti rūpataṇhā, saddataṇhā, gandhataṇhā, rasataṇhā, phoṭṭhabbataṇhā, dhammataṇhā. Taṇhagatanti taṇhāgataṃ taṇhānugataṃ taṇhāyānusaṭaṃ taṇhāyāsannaṃ taṇhāya pātitaṃ abhibhūtaṃ pariyādinnacittaṃ . Bhavesūti kāmabhave rūpabhave arūpabhaveti – pajaṃ imaṃ taṇhagataṃ bhavesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hīnā narā maccumukhe lapantī"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hīnā narā"
      },
      "ti hīnā narā hīnena kāyakammena samannāgatāti hīnā narā, hīnena vacīkammena samannāgatāti hīnā narā, hīnena manokammena samannāgatāti hīnā narā, hīnena pāṇātipātena samannāgatāti hīnā narā, hīnena adinnādānena…pe… hīnena kāmesumicchācārena… hīnena musāvādena… hīnāya pisuṇāya vācāya… hīnāya pharusāya vācāya… hīnena samphappalāpena… hīnāya abhijjhāya… hīnena byāpādena… hīnāya micchādiṭṭhiyā… hīnehi saṅkhārehi… hīnehi pañcahi kāmaguṇehi nīvaraṇehi… hīnāya cetanāya… hīnāya patthanāya… hīnāya paṇidhiyā samannāgatāti hīnā narā hīnā nihīnā ohīnā omakā lāmakā chatukkā parittāti – hīnā narā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Maccumukhe lapantī"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Maccumukhe"
      },
      "ti māramukhe maraṇamukhe, maccuppattā maccusampattā maccūpāgatā, mārappattā mārasampattā mārūpāgatā, maraṇappattā maraṇasampattā maraṇūpāgatā lapanti lālapanti socanti kilamanti paridevanti urattāḷiṃ kandanti sammohaṃ āpajjantīti – hīnā narā maccumukhe lapanti."
    ],
    "innerText": "Hīnā narā maccumukhe lapantīti. Hīnā narāti hīnā narā hīnena kāyakammena samannāgatāti hīnā narā, hīnena vacīkammena samannāgatāti hīnā narā, hīnena manokammena samannāgatāti hīnā narā, hīnena pāṇātipātena samannāgatāti hīnā narā, hīnena adinnādānena…pe… hīnena kāmesumicchācārena… hīnena musāvādena… hīnāya pisuṇāya vācāya… hīnāya pharusāya vācāya… hīnena samphappalāpena… hīnāya abhijjhāya… hīnena byāpādena… hīnāya micchādiṭṭhiyā… hīnehi saṅkhārehi… hīnehi pañcahi kāmaguṇehi nīvaraṇehi… hīnāya cetanāya… hīnāya patthanāya… hīnāya paṇidhiyā samannāgatāti hīnā narā hīnā nihīnā ohīnā omakā lāmakā chatukkā parittāti – hīnā narā. Maccumukhe lapantīti. Maccumukheti māramukhe maraṇamukhe, maccuppattā maccusampattā maccūpāgatā, mārappattā mārasampattā mārūpāgatā, maraṇappattā maraṇasampattā maraṇūpāgatā lapanti lālapanti socanti kilamanti paridevanti urattāḷiṃ kandanti sammohaṃ āpajjantīti – hīnā narā maccumukhe lapanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avītataṇhāse bhavābhavesū"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṇhā"
      },
      "ti rūpataṇhā…pe… dhammataṇhā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhavābhavesū"
      },
      "ti bhavābhave kammabhave punabbhave kāmabhave ",
      ", kammabhave kāmabhave punabbhave rūpabhave, kammabhave rūpabhave punabbhave arūpabhave, kammabhave ",
      " arūpabhave punabbhave punappunabbhave, punappunagatiyā punappunaupapattiyā ",
      " punappunapaṭisandhiyā punappunaattabhāvābhinibbattiyā, avītataṇhā avigatataṇhā ",
      " acattataṇhā avantataṇhā. Amuttataṇhā appahīnataṇhā appaṭinissaṭṭhataṇhāti – avītataṇhāse bhavābhavesu."
    ],
    "innerText": "Avītataṇhāse bhavābhavesūti. Taṇhāti rūpataṇhā…pe… dhammataṇhā. Bhavābhavesūti bhavābhave kammabhave punabbhave kāmabhave , kammabhave kāmabhave punabbhave rūpabhave, kammabhave rūpabhave punabbhave arūpabhave, kammabhave arūpabhave punabbhave punappunabbhave, punappunagatiyā punappunaupapattiyā punappunapaṭisandhiyā punappunaattabhāvābhinibbattiyā, avītataṇhā avigatataṇhā acattataṇhā avantataṇhā. Amuttataṇhā appahīnataṇhā appaṭinissaṭṭhataṇhāti – avītataṇhāse bhavābhavesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Passāmi loke pariphandamānaṃ, pajaṃ imaṃ taṇhagataṃ bhavesu;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Hīnā narā maccumukhe lapanti, avītataṇhāse bhavābhavesū’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "12"
      },
      "."
    ],
    "innerText": "12."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mamāyite passatha phandamāne,"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "maccheva"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[macchova (sī.)]"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "appodake khīṇasote;"
      }
    ],
    "innerText": "Mamāyite passatha phandamāne,maccheva[macchova (sī.)]appodake khīṇasote;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Etampi disvā amamo careyya, bhavesu āsattimakubbamāno."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mamāyite passatha phandamāne"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mamattā"
      },
      "ti dve mamattā – taṇhāmamattañca diṭṭhimamattañca. Katamaṃ taṇhāmamattaṃ? Yāvatā taṇhāsaṅkhātena sīmakataṃ mariyādikataṃ odhikataṃ pariyantakataṃ pariggahitaṃ mamāyitaṃ. Idaṃ mamaṃ, etaṃ mamaṃ, ettakaṃ mamaṃ, ettāvatā mamaṃ, mama rūpā saddā gandhā ",
      " rasā phoṭṭhabbā, attharaṇā pāvuraṇā dāsidāsā ajeḷakā kukkuṭasūkarā hatthigavāssavaḷavā khettaṃ vatthu hiraññaṃ suvaṇṇaṃ gāmanigamarājadhāniyo raṭṭhañca janapado ca koso ca koṭṭhāgārañca, kevalampi mahāpathaviṃ taṇhāvasena mamāyati. Yāvatā aṭṭhasataṃ taṇhāvicaritaṃ, idaṃ taṇhāmamattaṃ."
    ],
    "innerText": "Mamāyite passatha phandamāneti. Mamattāti dve mamattā – taṇhāmamattañca diṭṭhimamattañca. Katamaṃ taṇhāmamattaṃ? Yāvatā taṇhāsaṅkhātena sīmakataṃ mariyādikataṃ odhikataṃ pariyantakataṃ pariggahitaṃ mamāyitaṃ. Idaṃ mamaṃ, etaṃ mamaṃ, ettakaṃ mamaṃ, ettāvatā mamaṃ, mama rūpā saddā gandhā rasā phoṭṭhabbā, attharaṇā pāvuraṇā dāsidāsā ajeḷakā kukkuṭasūkarā hatthigavāssavaḷavā khettaṃ vatthu hiraññaṃ suvaṇṇaṃ gāmanigamarājadhāniyo raṭṭhañca janapado ca koso ca koṭṭhāgārañca, kevalampi mahāpathaviṃ taṇhāvasena mamāyati. Yāvatā aṭṭhasataṃ taṇhāvicaritaṃ, idaṃ taṇhāmamattaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katamaṃ diṭṭhimamattaṃ? Vīsativatthukā sakkāyadiṭṭhi, dasavatthukā micchādiṭṭhi, dasavatthukā antaggāhikā diṭṭhi; yā evarūpā diṭṭhi diṭṭhigataṃ diṭṭhigahanaṃ ",
      " diṭṭhikantāro diṭṭhivisūkāyikaṃ diṭṭhivipphandikaṃ diṭṭhisaññojanaṃ gāho paṭiggāho abhiniveso parāmāso kummaggo micchāpatho micchattaṃ titthāyatanaṃ vipariyesaggāho viparītaggāho vipallāsaggāho micchāgāho ‘‘ayāthāvakasmiṃ yāthāvaka’’nti gāho. Yāvatā dvāsaṭṭhidiṭṭhigatāni, idaṃ diṭṭhimamattaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mamāyite passatha phandamāne"
      },
      "ti mamāyitaṃ vatthuṃ acchedasaṃkinopi phandanti, acchindantepi phandanti, acchinnepi phandanti, mamāyitaṃ vatthuṃ vipariṇāmasaṃkinopi phandanti, vipariṇāmantepi phandanti, vipariṇatepi phandanti paphandanti samphandanti vipphandanti vedhanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vedhenti (syā.)]"
      },
      " pavedhanti sampavedhanti. Evaṃ phandamāne paphandamāne samphandamāne vipphandamāne vedhamāne pavedhamāne sampavedhamāne passatha ",
      " dakkhatha oloketha nijjhāyatha upaparikkhathāti – mamāyite passatha phandamāne."
    ],
    "innerText": "Katamaṃ diṭṭhimamattaṃ? Vīsativatthukā sakkāyadiṭṭhi, dasavatthukā micchādiṭṭhi, dasavatthukā antaggāhikā diṭṭhi; yā evarūpā diṭṭhi diṭṭhigataṃ diṭṭhigahanaṃ diṭṭhikantāro diṭṭhivisūkāyikaṃ diṭṭhivipphandikaṃ diṭṭhisaññojanaṃ gāho paṭiggāho abhiniveso parāmāso kummaggo micchāpatho micchattaṃ titthāyatanaṃ vipariyesaggāho viparītaggāho vipallāsaggāho micchāgāho ‘‘ayāthāvakasmiṃ yāthāvaka’’nti gāho. Yāvatā dvāsaṭṭhidiṭṭhigatāni, idaṃ diṭṭhimamattaṃ. Mamāyite passatha phandamāneti mamāyitaṃ vatthuṃ acchedasaṃkinopi phandanti, acchindantepi phandanti, acchinnepi phandanti, mamāyitaṃ vatthuṃ vipariṇāmasaṃkinopi phandanti, vipariṇāmantepi phandanti, vipariṇatepi phandanti paphandanti samphandanti vipphandanti vedhanti [vedhenti (syā.)] pavedhanti sampavedhanti. Evaṃ phandamāne paphandamāne samphandamāne vipphandamāne vedhamāne pavedhamāne sampavedhamāne passatha dakkhatha oloketha nijjhāyatha upaparikkhathāti – mamāyite passatha phandamāne."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Maccheva"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "appodake khīṇasote"
      },
      "ti. Yathā macchā appodake parittodake ",
      " udakapariyādāne kākehi vā kulalehi vā balākāhi vā paripātiyamānā ukkhipiyamānā khajjamānā phandanti paphandanti samphandanti vipphandanti vedhanti pavedhanti sampavedhanti; evameva pajā mamāyitaṃ vatthuṃ acchedasaṃkinopi phandanti, acchindantepi phandanti, acchinnepi phandanti, mamāyitaṃ vatthuṃ vipariṇāmasaṃkinopi phandanti, vipariṇāmantepi phandanti, vipariṇatepi phandanti paphandanti samphandanti vipphandanti vedhanti pavedhanti sampavedhantīti – maccheva appodake khīṇasote."
    ],
    "innerText": "Macchevaappodake khīṇasoteti. Yathā macchā appodake parittodake udakapariyādāne kākehi vā kulalehi vā balākāhi vā paripātiyamānā ukkhipiyamānā khajjamānā phandanti paphandanti samphandanti vipphandanti vedhanti pavedhanti sampavedhanti; evameva pajā mamāyitaṃ vatthuṃ acchedasaṃkinopi phandanti, acchindantepi phandanti, acchinnepi phandanti, mamāyitaṃ vatthuṃ vipariṇāmasaṃkinopi phandanti, vipariṇāmantepi phandanti, vipariṇatepi phandanti paphandanti samphandanti vipphandanti vedhanti pavedhanti sampavedhantīti – maccheva appodake khīṇasote."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etampi disvā amamo careyyā"
      },
      "ti. Etaṃ ādīnavaṃ disvā passitvā tulayitvā tīrayitvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[tirayitvā (ka.)]"
      },
      " vibhāvayitvā vibhūtaṃ katvā mamattesūti ",
      " – etampi disvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Amamo careyyā"
      },
      "ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mamattā"
      },
      "ti dve mamattā – taṇhāmamattañca diṭṭhimamattañca…pe… idaṃ taṇhāmamattaṃ…pe… idaṃ diṭṭhimamattaṃ. Taṇhāmamattaṃ pahāya diṭṭhimamattaṃ paṭinissajjitvā cakkhuṃ amamāyanto sotaṃ amamāyanto ghānaṃ amamāyanto jivhaṃ amamāyanto kāyaṃ amamāyanto manaṃ amamāyanto rūpe… sadde… gandhe… rase… phoṭṭhabbe… dhamme… kulaṃ… gaṇaṃ… āvāsaṃ… lābhaṃ… yasaṃ… pasaṃsaṃ… sukhaṃ… cīvaraṃ… piṇḍapātaṃ… senāsanaṃ… gilānapaccayabhesajjaparikkhāraṃ… kāmadhātuṃ… rūpadhātuṃ… arūpadhātuṃ… kāmabhavaṃ… rūpabhavaṃ… arūpabhavaṃ… saññābhavaṃ… asaññābhavaṃ… nevasaññānāsaññābhavaṃ… ekavokārabhavaṃ… catuvokārabhavaṃ… pañcavokārabhavaṃ… atītaṃ… anāgataṃ… paccuppannaṃ… diṭṭhasutamutaviññātabbe dhamme amamāyanto agaṇhanto aparāmasanto anabhinivisanto careyya ",
      " vihareyya iriyeyya vatteyya pāleyya yapeyya yāpeyyāti – etampi disvā amamo careyya."
    ],
    "innerText": "Etampi disvā amamo careyyāti. Etaṃ ādīnavaṃ disvā passitvā tulayitvā tīrayitvā [tirayitvā (ka.)] vibhāvayitvā vibhūtaṃ katvā mamattesūti – etampi disvā. Amamo careyyāti mamattāti dve mamattā – taṇhāmamattañca diṭṭhimamattañca…pe… idaṃ taṇhāmamattaṃ…pe… idaṃ diṭṭhimamattaṃ. Taṇhāmamattaṃ pahāya diṭṭhimamattaṃ paṭinissajjitvā cakkhuṃ amamāyanto sotaṃ amamāyanto ghānaṃ amamāyanto jivhaṃ amamāyanto kāyaṃ amamāyanto manaṃ amamāyanto rūpe… sadde… gandhe… rase… phoṭṭhabbe… dhamme… kulaṃ… gaṇaṃ… āvāsaṃ… lābhaṃ… yasaṃ… pasaṃsaṃ… sukhaṃ… cīvaraṃ… piṇḍapātaṃ… senāsanaṃ… gilānapaccayabhesajjaparikkhāraṃ… kāmadhātuṃ… rūpadhātuṃ… arūpadhātuṃ… kāmabhavaṃ… rūpabhavaṃ… arūpabhavaṃ… saññābhavaṃ… asaññābhavaṃ… nevasaññānāsaññābhavaṃ… ekavokārabhavaṃ… catuvokārabhavaṃ… pañcavokārabhavaṃ… atītaṃ… anāgataṃ… paccuppannaṃ… diṭṭhasutamutaviññātabbe dhamme amamāyanto agaṇhanto aparāmasanto anabhinivisanto careyya vihareyya iriyeyya vatteyya pāleyya yapeyya yāpeyyāti – etampi disvā amamo careyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhavesu āsattimakubbamāno"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhavesū"
      },
      "ti kāmabhave rūpabhave arūpabhave. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āsatti"
      },
      " vuccati taṇhā. Yo rāgo sārāgo…pe… abhijjhā lobho akusalamūlaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhavesu āsattimakubbamāno"
      },
      "ti. Bhavesu āsattiṃ akubbamāno, chandaṃ pemaṃ rāgaṃ khantiṃ akubbamāno ajanayamāno asañjanayamāno anibbattayamāno anabhinibbattayamānoti – bhavesu āsattimakubbamāno."
    ],
    "innerText": "Bhavesu āsattimakubbamānoti. Bhavesūti kāmabhave rūpabhave arūpabhave. Āsatti vuccati taṇhā. Yo rāgo sārāgo…pe… abhijjhā lobho akusalamūlaṃ. Bhavesu āsattimakubbamānoti. Bhavesu āsattiṃ akubbamāno, chandaṃ pemaṃ rāgaṃ khantiṃ akubbamāno ajanayamāno asañjanayamāno anibbattayamāno anabhinibbattayamānoti – bhavesu āsattimakubbamāno."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Mamāyite ",
      " passatha phandamāne, maccheva appodake khīṇasote;"
    ],
    "innerText": "‘‘Mamāyite passatha phandamāne, maccheva appodake khīṇasote;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Etampi disvā amamo careyya, bhavesu āsattimakubbamāno’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "13"
      },
      "."
    ],
    "innerText": "13."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ubhosu"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "antesu vineyya chandaṃ, phassaṃ pariññāya anānugiddho;"
      }
    ],
    "innerText": "Ubhosuantesu vineyya chandaṃ, phassaṃ pariññāya anānugiddho;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Yadattagarahī tadakubbamāno, na limpatī ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[na lippati (sī.)]"
      },
      " diṭṭhasutesu dhīro."
    ],
    "innerText": "Yadattagarahī tadakubbamāno, na limpatī [na lippati (sī.)] diṭṭhasutesu dhīro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ubhosu"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "antesu vineyya chanda"
      },
      "nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Antā"
      },
      "ti phasso eko anto phassasamudayo dutiyo anto, atīto eko anto anāgato dutiyo anto, sukhā vedanā eko anto dukkhā ",
      " vedanā dutiyo anto, nāmaṃ eko anto rūpaṃ dutiyo anto, cha ajjhattikāni āyatanāni eko anto cha bāhirāni āyatanāni dutiyo anto, sakkāyo eko anto sakkāyasamudayo dutiyo anto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Chando"
      },
      "ti yo kāmesu kāmacchando kāmarāgo kāmanandī kāmataṇhā kāmasneho kāmapariḷāho kāmamucchā kāmajjhosānaṃ kāmogho kāmayogo kāmupādānaṃ kāmacchandanīvaraṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ubhosu antesu vineyya chanda"
      },
      "nti ubhosu antesu chandaṃ vineyya paṭivineyya pajaheyya vinodeyya byantiṃ kareyya anabhāvaṃ gameyyāti – ubhosu antesu vineyya chandaṃ."
    ],
    "innerText": "Ubhosuantesu vineyya chandanti. Antāti phasso eko anto phassasamudayo dutiyo anto, atīto eko anto anāgato dutiyo anto, sukhā vedanā eko anto dukkhā vedanā dutiyo anto, nāmaṃ eko anto rūpaṃ dutiyo anto, cha ajjhattikāni āyatanāni eko anto cha bāhirāni āyatanāni dutiyo anto, sakkāyo eko anto sakkāyasamudayo dutiyo anto. Chandoti yo kāmesu kāmacchando kāmarāgo kāmanandī kāmataṇhā kāmasneho kāmapariḷāho kāmamucchā kāmajjhosānaṃ kāmogho kāmayogo kāmupādānaṃ kāmacchandanīvaraṇaṃ. Ubhosu antesu vineyya chandanti ubhosu antesu chandaṃ vineyya paṭivineyya pajaheyya vinodeyya byantiṃ kareyya anabhāvaṃ gameyyāti – ubhosu antesu vineyya chandaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Phassaṃ pariññāya anānugiddho"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Phasso"
      },
      "ti cakkhusamphasso sotasamphasso ghānasamphasso jivhāsamphasso kāyasamphasso manosamphasso, adhivacanasamphasso, paṭighasamphasso, sukhavedanīyo samphasso dukkhavedanīyo samphasso adukkhamasukhavedanīyo samphasso, kusalo phasso akusalo phasso abyākato phasso, kāmāvacaro phasso rūpāvacaro phasso arūpāvacaro phasso, suññato phasso animitto phasso appaṇihito phasso, lokiyo phasso lokuttaro phasso, atīto phasso anāgato phasso paccuppanno ",
      " phasso, yo evarūpo phasso phusanā samphusanā samphusitattaṃ – ayaṃ vuccati phasso."
    ],
    "innerText": "Phassaṃ pariññāya anānugiddhoti. Phassoti cakkhusamphasso sotasamphasso ghānasamphasso jivhāsamphasso kāyasamphasso manosamphasso, adhivacanasamphasso, paṭighasamphasso, sukhavedanīyo samphasso dukkhavedanīyo samphasso adukkhamasukhavedanīyo samphasso, kusalo phasso akusalo phasso abyākato phasso, kāmāvacaro phasso rūpāvacaro phasso arūpāvacaro phasso, suññato phasso animitto phasso appaṇihito phasso, lokiyo phasso lokuttaro phasso, atīto phasso anāgato phasso paccuppanno phasso, yo evarūpo phasso phusanā samphusanā samphusitattaṃ – ayaṃ vuccati phasso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Phassaṃ pariññāyā"
      },
      "ti phassaṃ tīhi pariññāhi parijānitvā – ñātapariññāya, tīraṇapariññāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[tiraṇapariññāya (syā.)]"
      },
      ", pahānapariññāya. Katamā ",
      " ñātapariññā? Phassaṃ jānāti – ayaṃ cakkhusamphasso, ayaṃ sotasamphasso, ayaṃ ghānasamphasso, ayaṃ jivhāsamphasso, ayaṃ kāyasamphasso, ayaṃ manosamphasso, ayaṃ adhivacanasamphasso, ayaṃ paṭighasamphasso, ayaṃ sukhavedanīyo phasso, ayaṃ dukkhavedanīyo phasso, ayaṃ adukkhamasukhavedanīyo phasso, ayaṃ kusalo phasso, ayaṃ akusalo phasso, ayaṃ abyākato phasso, ayaṃ kāmāvacaro phasso, ayaṃ rūpāvacaro phasso, ayaṃ ",
      " arūpāvacaro phasso, ayaṃ suññato phasso, ayaṃ animitto phasso, ayaṃ appaṇihito phasso, ayaṃ lokiyo phasso, ayaṃ lokuttaro phasso ",
      ", ayaṃ atīto phasso, ayaṃ anāgato phasso, ayaṃ paccuppanno phassoti jānāti passati – ayaṃ ñātapariññā."
    ],
    "innerText": "Phassaṃ pariññāyāti phassaṃ tīhi pariññāhi parijānitvā – ñātapariññāya, tīraṇapariññāya [tiraṇapariññāya (syā.)], pahānapariññāya. Katamā ñātapariññā? Phassaṃ jānāti – ayaṃ cakkhusamphasso, ayaṃ sotasamphasso, ayaṃ ghānasamphasso, ayaṃ jivhāsamphasso, ayaṃ kāyasamphasso, ayaṃ manosamphasso, ayaṃ adhivacanasamphasso, ayaṃ paṭighasamphasso, ayaṃ sukhavedanīyo phasso, ayaṃ dukkhavedanīyo phasso, ayaṃ adukkhamasukhavedanīyo phasso, ayaṃ kusalo phasso, ayaṃ akusalo phasso, ayaṃ abyākato phasso, ayaṃ kāmāvacaro phasso, ayaṃ rūpāvacaro phasso, ayaṃ arūpāvacaro phasso, ayaṃ suññato phasso, ayaṃ animitto phasso, ayaṃ appaṇihito phasso, ayaṃ lokiyo phasso, ayaṃ lokuttaro phasso , ayaṃ atīto phasso, ayaṃ anāgato phasso, ayaṃ paccuppanno phassoti jānāti passati – ayaṃ ñātapariññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Katamā tīraṇapariññā? Evaṃ ñātaṃ katvā phassaṃ tīreti. Aniccato dukkhato rogato gaṇḍato sallato aghato ābādhato parato palokato ītito upaddavato bhayato upasaggato calato pabhaṅguto adhuvato atāṇato aleṇato asaraṇato rittato tucchato suññato anattato ādīnavato vipariṇāmadhammato asārakato aghamūlato vadhakato vibhavato sāsavato saṅkhatato mārāmisato jātijarābyādhimaraṇadhammato sokaparidevadukkhadomanassupāyāsadhammato saṃkilesadhammato samudayato atthaṅgamato assādato ādīnavato nissaraṇato tīreti – ayaṃ tīraṇapariññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katamā ",
      " pahānapariññā? Evaṃ tīrayitvā phasse chandarāgaṃ pajahati vinodeti byantiṃ karoti anabhāvaṃ gameti. Vuttañhetaṃ bhagavatā – ‘‘yo, bhikkhave, phassesu chandarāgo taṃ pajahatha. Evaṃ so phasso pahīno bhavissati ucchinnamūlo tālāvatthukato anabhāvaṃ kato āyatiṃ ",
      " anuppādadhammo’’ti – ayaṃ pahānapariññā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Phassaṃ pariññāyā"
      },
      "ti. Phassaṃ imāhi tīhi pariññāhi parijānitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anānugiddho"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gedho"
      },
      " vuccati taṇhā. Yo rāgo sārāgo…pe… abhijjhā lobho akusalamūlaṃ. Yasseso gedho pahīno samucchinno vūpasanto paṭipassaddho abhabbuppattiko ñāṇagginā daḍḍho, so vuccati agiddho. So rūpe agiddho sadde agiddho gandhe agiddho rase agiddho phoṭṭhabbe agiddho kule… gaṇe… āvāse… lābhe… yase… pasaṃsāya… sukhe… cīvare… piṇḍapāte… senāsane… gilānapaccayabhesajjaparikkhāre agiddho ",
      " kāmadhātuyā… rūpadhātuyā… arūpadhātuyā… kāmabhave… rūpabhave… arūpabhave… saññābhave… asaññābhave… nevasaññānāsaññābhave… ekavokārabhave… catuvokārabhave… pañcavokārabhave… atīte… anāgate… paccuppanne… diṭṭhasutamutaviññātabbesu dhammesu agiddho agadhito amucchito anajjhāpanno vītagedho vigatagedho cattagedho vantagedho muttagedho pahīnagedho paṭinissaṭṭhagedho vītarāgo vigatarāgo cattarāgo vantarāgo muttarāgo pahīnarāgo paṭinissaṭṭharāgo nicchāto nibbuto sītibhūto sukhapaṭisaṃvedī brahmabhūtena attanā viharatīti ",
      " – phassaṃ pariññāya anānugiddho."
    ],
    "innerText": "Katamā pahānapariññā? Evaṃ tīrayitvā phasse chandarāgaṃ pajahati vinodeti byantiṃ karoti anabhāvaṃ gameti. Vuttañhetaṃ bhagavatā – ‘‘yo, bhikkhave, phassesu chandarāgo taṃ pajahatha. Evaṃ so phasso pahīno bhavissati ucchinnamūlo tālāvatthukato anabhāvaṃ kato āyatiṃ anuppādadhammo’’ti – ayaṃ pahānapariññā. Phassaṃ pariññāyāti. Phassaṃ imāhi tīhi pariññāhi parijānitvā. Anānugiddhoti. Gedho vuccati taṇhā. Yo rāgo sārāgo…pe… abhijjhā lobho akusalamūlaṃ. Yasseso gedho pahīno samucchinno vūpasanto paṭipassaddho abhabbuppattiko ñāṇagginā daḍḍho, so vuccati agiddho. So rūpe agiddho sadde agiddho gandhe agiddho rase agiddho phoṭṭhabbe agiddho kule… gaṇe… āvāse… lābhe… yase… pasaṃsāya… sukhe… cīvare… piṇḍapāte… senāsane… gilānapaccayabhesajjaparikkhāre agiddho kāmadhātuyā… rūpadhātuyā… arūpadhātuyā… kāmabhave… rūpabhave… arūpabhave… saññābhave… asaññābhave… nevasaññānāsaññābhave… ekavokārabhave… catuvokārabhave… pañcavokārabhave… atīte… anāgate… paccuppanne… diṭṭhasutamutaviññātabbesu dhammesu agiddho agadhito amucchito anajjhāpanno vītagedho vigatagedho cattagedho vantagedho muttagedho pahīnagedho paṭinissaṭṭhagedho vītarāgo vigatarāgo cattarāgo vantarāgo muttarāgo pahīnarāgo paṭinissaṭṭharāgo nicchāto nibbuto sītibhūto sukhapaṭisaṃvedī brahmabhūtena attanā viharatīti – phassaṃ pariññāya anānugiddho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yadattagarahī tadakubbamāno"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yada"
      },
      "nti yaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attagarahī"
      },
      "ti dvīhi kāraṇehi attānaṃ garahati – katattā ca akatattā ca. Kathaṃ katattā ca akatattā ca attānaṃ garahati? Kataṃ me ",
      " kāyaduccaritaṃ, akataṃ me kāyasucaritanti – attānaṃ garahati. Kataṃ me vacīduccaritaṃ, akataṃ me vacīsucaritanti – attānaṃ garahati. Kataṃ me manoduccaritaṃ, akataṃ me manosucaritanti – attānaṃ garahati. Kato me pāṇātipāto, akatā me pāṇātipātā veramaṇīti – attānaṃ garahati. Kataṃ me adinnādānaṃ, akatā me adinnādānā veramaṇīti – attānaṃ garahati. Kato me kāmesumicchācāro, akatā me kāmesumicchācārā veramaṇīti – attānaṃ garahati. Kato me musāvādo, akatā me musāvādā veramaṇīti – attānaṃ garahati. Katā me pisuṇā vācā, akatā me pisuṇāya vācāya veramaṇīti – attānaṃ garahati. Katā me pharusā vācā, akatā me pharusāya vācāya veramaṇīti – attānaṃ garahati. Kato me samphappalāpo, akatā me samphappalāpā veramaṇīti – attānaṃ ",
      " garahati. Katā me abhijjhā, akatā me anabhijjhāti – attānaṃ garahati. Kato me byāpādo, akato me abyāpādoti – attānaṃ garahati. Katā me micchādiṭṭhi, akatā me sammādiṭṭhīti – attānaṃ ",
      " garahati. Evaṃ katattā ca akatattā ca attānaṃ garahati. Atha vā, sīlesumhi na paripūrakārīti – attānaṃ garahati. Indriyesumhi ",
      " aguttadvāroti – attānaṃ garahati. Bhojanemhi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[bhojane (syā.)]"
      },
      " amattaññūti – attānaṃ garahati. Jāgariyaṃ ananuyuttoti – attānaṃ garahati. Satisampajaññena asamannāgatoti – attānaṃ garahati. Abhāvitā me cattāro satipaṭṭhānāti – attānaṃ garahati. Abhāvitā me cattāro sammappadhānāti – attānaṃ garahati. Abhāvitā me cattāro iddhipādāti – attānaṃ garahati. Abhāvitāni me pañcindriyānīti – attānaṃ garahati. Abhāvitāni me pañca balānīti – attānaṃ garahati. Abhāvitā me satta bojjhaṅgāti – attānaṃ garahati. Abhāvito me ariyo aṭṭhaṅgiko maggoti – attānaṃ garahati. Dukkhaṃ me apariññātanti – attānaṃ garahati. Samudayo me appahīnoti – attānaṃ garahati. Maggo me abhāvitoti – attānaṃ garahati. Nirodho me asacchikatoti – attānaṃ garahati. Evaṃ katattā ca akatattā ca attānaṃ garahati. Evaṃ attagarahitaṃ kammaṃ akubbamāno ajanayamāno asañjanayamāno anibbattayamāno anabhinibbattayamānoti – yadattagarahī tadakubbamāno. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na limpatī diṭṭhasutesu dhīro"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lepo"
      },
      "ti dve lepā – taṇhālepo ca diṭṭhilepo ca…pe… ayaṃ taṇhālepo…pe… ayaṃ diṭṭhilepo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhīro"
      },
      "ti paṇḍito paññavā buddhimā ñāṇī ",
      " vibhāvī medhāvī. Dhīro taṇhālepaṃ pahāya diṭṭhilepaṃ paṭinissajjitvā diṭṭhe na limpati, sute na limpati, mute na limpati, viññāte na limpati, na palimpati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[na saṃlimpati (syā.)]"
      },
      ", na upalimpati. Alitto apalitto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[asaṃlitto (syā.)]"
      },
      " anupalitto nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā viharatīti – na limpatī diṭṭhasutesu dhīroti."
    ],
    "innerText": "Yadattagarahī tadakubbamānoti. Yadanti yaṃ. Attagarahīti dvīhi kāraṇehi attānaṃ garahati – katattā ca akatattā ca. Kathaṃ katattā ca akatattā ca attānaṃ garahati? Kataṃ me kāyaduccaritaṃ, akataṃ me kāyasucaritanti – attānaṃ garahati. Kataṃ me vacīduccaritaṃ, akataṃ me vacīsucaritanti – attānaṃ garahati. Kataṃ me manoduccaritaṃ, akataṃ me manosucaritanti – attānaṃ garahati. Kato me pāṇātipāto, akatā me pāṇātipātā veramaṇīti – attānaṃ garahati. Kataṃ me adinnādānaṃ, akatā me adinnādānā veramaṇīti – attānaṃ garahati. Kato me kāmesumicchācāro, akatā me kāmesumicchācārā veramaṇīti – attānaṃ garahati. Kato me musāvādo, akatā me musāvādā veramaṇīti – attānaṃ garahati. Katā me pisuṇā vācā, akatā me pisuṇāya vācāya veramaṇīti – attānaṃ garahati. Katā me pharusā vācā, akatā me pharusāya vācāya veramaṇīti – attānaṃ garahati. Kato me samphappalāpo, akatā me samphappalāpā veramaṇīti – attānaṃ garahati. Katā me abhijjhā, akatā me anabhijjhāti – attānaṃ garahati. Kato me byāpādo, akato me abyāpādoti – attānaṃ garahati. Katā me micchādiṭṭhi, akatā me sammādiṭṭhīti – attānaṃ garahati. Evaṃ katattā ca akatattā ca attānaṃ garahati. Atha vā, sīlesumhi na paripūrakārīti – attānaṃ garahati. Indriyesumhi aguttadvāroti – attānaṃ garahati. Bhojanemhi [bhojane (syā.)] amattaññūti – attānaṃ garahati. Jāgariyaṃ ananuyuttoti – attānaṃ garahati. Satisampajaññena asamannāgatoti – attānaṃ garahati. Abhāvitā me cattāro satipaṭṭhānāti – attānaṃ garahati. Abhāvitā me cattāro sammappadhānāti – attānaṃ garahati. Abhāvitā me cattāro iddhipādāti – attānaṃ garahati. Abhāvitāni me pañcindriyānīti – attānaṃ garahati. Abhāvitāni me pañca balānīti – attānaṃ garahati. Abhāvitā me satta bojjhaṅgāti – attānaṃ garahati. Abhāvito me ariyo aṭṭhaṅgiko maggoti – attānaṃ garahati. Dukkhaṃ me apariññātanti – attānaṃ garahati. Samudayo me appahīnoti – attānaṃ garahati. Maggo me abhāvitoti – attānaṃ garahati. Nirodho me asacchikatoti – attānaṃ garahati. Evaṃ katattā ca akatattā ca attānaṃ garahati. Evaṃ attagarahitaṃ kammaṃ akubbamāno ajanayamāno asañjanayamāno anibbattayamāno anabhinibbattayamānoti – yadattagarahī tadakubbamāno. Na limpatī diṭṭhasutesu dhīroti. Lepoti dve lepā – taṇhālepo ca diṭṭhilepo ca…pe… ayaṃ taṇhālepo…pe… ayaṃ diṭṭhilepo. Dhīroti paṇḍito paññavā buddhimā ñāṇī vibhāvī medhāvī. Dhīro taṇhālepaṃ pahāya diṭṭhilepaṃ paṭinissajjitvā diṭṭhe na limpati, sute na limpati, mute na limpati, viññāte na limpati, na palimpati [na saṃlimpati (syā.)], na upalimpati. Alitto apalitto [asaṃlitto (syā.)] anupalitto nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā viharatīti – na limpatī diṭṭhasutesu dhīroti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tenāha ",
      " bhagavā –"
    ],
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ubhosu antesu vineyya chandaṃ, phassaṃ pariññāya anānugiddho;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yadattagarahī tadakubbamāno, na limpatī diṭṭhasutesu dhīro’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "14"
      },
      "."
    ],
    "innerText": "14."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saññaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pariññā vitareyya oghaṃ, pariggahesu muni nopalitto;"
      }
    ],
    "innerText": "Saññaṃpariññā vitareyya oghaṃ, pariggahesu muni nopalitto;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Abbūḷhasallo caramappamatto, nāsīsatī lokamimaṃ parañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saññaṃ pariññā vitareyya ogha"
      },
      "nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saññā"
      },
      "ti kāmasaññā byāpādasaññā vihiṃsāsaññā nekkhammasaññā abyāpādasaññā avihiṃsāsaññā rūpasaññā saddasaññā gandhasaññā rasasaññā phoṭṭhabbasaññā dhammasaññā – yā evarūpā saññā sañjānanā sañjānitattaṃ – ayaṃ vuccati saññā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saññaṃ pariññā"
      },
      "ti saññaṃ tīhi pariññāhi parijānitvā – ñātapariññāya, tīraṇapariññāya, pahānapariññāya."
    ],
    "innerText": "Saññaṃ pariññā vitareyya oghanti. Saññāti kāmasaññā byāpādasaññā vihiṃsāsaññā nekkhammasaññā abyāpādasaññā avihiṃsāsaññā rūpasaññā saddasaññā gandhasaññā rasasaññā phoṭṭhabbasaññā dhammasaññā – yā evarūpā saññā sañjānanā sañjānitattaṃ – ayaṃ vuccati saññā. Saññaṃ pariññāti saññaṃ tīhi pariññāhi parijānitvā – ñātapariññāya, tīraṇapariññāya, pahānapariññāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katamā ",
      " ñātapariññā? Saññaṃ jānāti – ayaṃ kāmasaññā, ayaṃ byāpādasaññā, ayaṃ vihiṃsāsaññā, ayaṃ nekkhammasaññā, ayaṃ abyāpādasaññā, ayaṃ avihiṃsāsaññā, ayaṃ rūpasaññā, ayaṃ saddasaññā, ayaṃ gandhasaññā, ayaṃ rasasaññā, ayaṃ phoṭṭhabbasaññā, ayaṃ dhammasaññāti jānāti passati – ayaṃ ñātapariññā."
    ],
    "innerText": "Katamā ñātapariññā? Saññaṃ jānāti – ayaṃ kāmasaññā, ayaṃ byāpādasaññā, ayaṃ vihiṃsāsaññā, ayaṃ nekkhammasaññā, ayaṃ abyāpādasaññā, ayaṃ avihiṃsāsaññā, ayaṃ rūpasaññā, ayaṃ saddasaññā, ayaṃ gandhasaññā, ayaṃ rasasaññā, ayaṃ phoṭṭhabbasaññā, ayaṃ dhammasaññāti jānāti passati – ayaṃ ñātapariññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Katamā tīraṇapariññā? Evaṃ ñātaṃ katvā saññaṃ tīreti. Aniccato dukkhato rogato gaṇḍato sallato aghato ābādhato parato palokato ītito upaddavato bhayato upasaggato calato pabhaṅguto…pe… samudayato atthaṅgamato assādato ādīnavato nissaraṇato tīreti – ayaṃ tīraṇapariññā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katamā pahānapariññā? Evaṃ tīrayitvā saññāya chandarāgaṃ pajahati vinodeti anabhāvaṃ gameti. Vuttampi hetaṃ bhagavatā – ‘‘yo, bhikkhave, saññāya chandarāgo, taṃ pajahatha. Evaṃ sā saññā pahīnā bhavissati ucchinnamūlā tālāvatthukatā anabhāvaṃ katā āyatiṃ anuppādadhammā’’ti – ayaṃ pahānapariññā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saññaṃ pariññā"
      },
      "ti saññaṃ imāhi tīhi pariññāhi parijānitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vitareyya"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ogha"
      },
      "nti kāmoghaṃ bhavoghaṃ diṭṭhoghaṃ avijjoghaṃ tareyya uttareyya patareyya samatikkameyya vītivatteyyāti – saññaṃ pariññā vitareyya oghaṃ."
    ],
    "innerText": "Katamā pahānapariññā? Evaṃ tīrayitvā saññāya chandarāgaṃ pajahati vinodeti anabhāvaṃ gameti. Vuttampi hetaṃ bhagavatā – ‘‘yo, bhikkhave, saññāya chandarāgo, taṃ pajahatha. Evaṃ sā saññā pahīnā bhavissati ucchinnamūlā tālāvatthukatā anabhāvaṃ katā āyatiṃ anuppādadhammā’’ti – ayaṃ pahānapariññā. Saññaṃ pariññāti saññaṃ imāhi tīhi pariññāhi parijānitvā. Vitareyyaoghanti kāmoghaṃ bhavoghaṃ diṭṭhoghaṃ avijjoghaṃ tareyya uttareyya patareyya samatikkameyya vītivatteyyāti – saññaṃ pariññā vitareyya oghaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pariggahesu"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "muni nopalitto"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pariggahā"
      },
      "ti dve pariggahā – taṇhāpariggaho ",
      " ca diṭṭhipariggaho ca…pe… ayaṃ taṇhāpariggaho…pe… ayaṃ diṭṭhipariggaho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Munī"
      },
      "ti. Monaṃ vuccati ñāṇaṃ. Yā paññā pajānanā…pe… amoho ",
      " dhammavicayo sammādiṭṭhi, tena ñāṇena samannāgato muni monappattoti. Tīṇi moneyyāni – kāyamoneyyaṃ, vacīmoneyyaṃ, manomoneyyaṃ."
    ],
    "innerText": "Pariggahesumuni nopalittoti. Pariggahāti dve pariggahā – taṇhāpariggaho ca diṭṭhipariggaho ca…pe… ayaṃ taṇhāpariggaho…pe… ayaṃ diṭṭhipariggaho. Munīti. Monaṃ vuccati ñāṇaṃ. Yā paññā pajānanā…pe… amoho dhammavicayo sammādiṭṭhi, tena ñāṇena samannāgato muni monappattoti. Tīṇi moneyyāni – kāyamoneyyaṃ, vacīmoneyyaṃ, manomoneyyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Katamaṃ kāyamoneyyaṃ? Tividhakāyaduccaritānaṃ pahānaṃ kāyamoneyyaṃ, tividhaṃ kāyasucaritaṃ kāyamoneyyaṃ, kāyārammaṇe ñāṇaṃ kāyamoneyyaṃ, kāyapariññā kāyamoneyyaṃ, pariññāsahagato maggo kāyamoneyyaṃ, kāye chandarāgassa pahānaṃ kāyamoneyyaṃ, kāyasaṅkhāranirodho catutthajjhānasamāpatti kāyamoneyyaṃ – idaṃ kāyamoneyyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Katamaṃ vacīmoneyyaṃ? Catubbidhavacīduccaritānaṃ pahānaṃ vacīmoneyyaṃ, catubbidhaṃ vacīsucaritaṃ vacīmoneyyaṃ, vācārammaṇe ñāṇaṃ vacīmoneyyaṃ, vācāpariññā vacīmoneyyaṃ, pariññāsahagato maggo vacīmoneyyaṃ, vācāya chandarāgassa pahānaṃ vacīmoneyyaṃ, vacīsaṅkhāranirodho dutiyajjhānasamāpatti vacīmoneyyaṃ – idaṃ vacīmoneyyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katamaṃ manomoneyyaṃ? Tividhamanoduccaritānaṃ pahānaṃ manomoneyyaṃ, tividhaṃ manosucaritaṃ manomoneyyaṃ, cittārammaṇe ñāṇaṃ manomoneyyaṃ, cittapariññā manomoneyyaṃ, pariññāsahagato ",
      " maggo manomoneyyaṃ, citte chandarāgassa pahānaṃ manomoneyyaṃ, cittasaṅkhāranirodho saññāvedayitanirodhaṃ ",
      " manomoneyyaṃ – idaṃ manomoneyyaṃ."
    ],
    "innerText": "Katamaṃ manomoneyyaṃ? Tividhamanoduccaritānaṃ pahānaṃ manomoneyyaṃ, tividhaṃ manosucaritaṃ manomoneyyaṃ, cittārammaṇe ñāṇaṃ manomoneyyaṃ, cittapariññā manomoneyyaṃ, pariññāsahagato maggo manomoneyyaṃ, citte chandarāgassa pahānaṃ manomoneyyaṃ, cittasaṅkhāranirodho saññāvedayitanirodhaṃ manomoneyyaṃ – idaṃ manomoneyyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kāyamuniṃ vācāmuniṃ, manomunimanāsavaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Muniṃ moneyyasampannaṃ, āhu sabbappahāyinaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kāyamuniṃ vācāmuniṃ, manomunimanāsavaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Muniṃ moneyyasampannaṃ, āhu ninhātapāpaka’’nti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[niṃnhātapāpakanti (syā.)]"
      },
      "."
    ],
    "innerText": "Muniṃ moneyyasampannaṃ, āhu ninhātapāpaka’’nti [niṃnhātapāpakanti (syā.)]."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Imehi tīhi moneyyehi dhammehi samannāgatā cha munino ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[cha munayo (syā.)]"
      },
      " – agāramunino, anagāramunino, sekhamunino, asekhamunino, paccekamunino, munimuninoti. Katame agāramunino? Ye te agārikā diṭṭhapadā viññātasāsanā – ime agāramunino. Katame anagāramunino ",
      "? Ye te pabbajitā diṭṭhapadā viññātasāsanā – ime anagāramunino. Satta sekhā sekhamunino. Arahanto asekhamunino. Paccekabuddhā paccekamunino. Munimunino vuccanti tathāgatā arahanto sammāsambuddhā."
    ],
    "innerText": "Imehi tīhi moneyyehi dhammehi samannāgatā cha munino [cha munayo (syā.)] – agāramunino, anagāramunino, sekhamunino, asekhamunino, paccekamunino, munimuninoti. Katame agāramunino? Ye te agārikā diṭṭhapadā viññātasāsanā – ime agāramunino. Katame anagāramunino ? Ye te pabbajitā diṭṭhapadā viññātasāsanā – ime anagāramunino. Satta sekhā sekhamunino. Arahanto asekhamunino. Paccekabuddhā paccekamunino. Munimunino vuccanti tathāgatā arahanto sammāsambuddhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Na ",
      " monena muni hoti, mūḷharūpo aviddasu;"
    ],
    "innerText": "‘‘Na monena muni hoti, mūḷharūpo aviddasu;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yo ca tulaṃva paggayha, varamādāya paṇḍito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Pāpāni parivajjeti, sa muni tena so muni;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yo munāti ubho loke, muni tena pavuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Asatañca satañca ñatvā dhammaṃ, ajjhattaṃ bahiddhā ca sabbaloke;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Devamanussehi ",
      " pūjito yo, saṅgajālamaticca so munī’’ti."
    ],
    "innerText": "Devamanussehi pūjito yo, saṅgajālamaticca so munī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lepā"
      },
      "ti dve lepā – taṇhālepo ca diṭṭhilepo ca…pe… ayaṃ taṇhālepo…pe… ayaṃ diṭṭhilepo. Muni taṇhālepaṃ pahāya diṭṭhilepaṃ paṭinissajjitvā pariggahesu ",
      " na limpati na palimpati na upalimpati. Alitto apalitto anupalitto nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā viharatīti – pariggahesu muni nopalitto."
    ],
    "innerText": "Lepāti dve lepā – taṇhālepo ca diṭṭhilepo ca…pe… ayaṃ taṇhālepo…pe… ayaṃ diṭṭhilepo. Muni taṇhālepaṃ pahāya diṭṭhilepaṃ paṭinissajjitvā pariggahesu na limpati na palimpati na upalimpati. Alitto apalitto anupalitto nikkhanto nissaṭo vippamutto visaññutto vimariyādikatena cetasā viharatīti – pariggahesu muni nopalitto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abbūḷhasallo caramappamatto"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Salla"
      },
      "nti satta sallāni – rāgasallaṃ, dosasallaṃ, mohasallaṃ, mānasallaṃ, diṭṭhisallaṃ, sokasallaṃ, kathaṃkathāsallaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[duccaritasallaṃ (sī.)]"
      },
      ". Yassete sallā pahīnā samucchinnā vūpasantā paṭipassaddhā abhabbuppattikā ñāṇagginā daḍḍhā, so vuccati abbūḷhasallo abbahitasallo uddhatasallo samuddhatasallo uppāṭitasallo samuppāṭitasallo cattasallo vantasallo muttasallo pahīnasallo paṭinissaṭṭhasallo nicchāto nibbuto sītibhūto sukhapaṭisaṃvedī brahmabhūtena attanā viharatīti – abbūḷhasallo."
    ],
    "innerText": "Abbūḷhasallo caramappamattoti. Sallanti satta sallāni – rāgasallaṃ, dosasallaṃ, mohasallaṃ, mānasallaṃ, diṭṭhisallaṃ, sokasallaṃ, kathaṃkathāsallaṃ [duccaritasallaṃ (sī.)]. Yassete sallā pahīnā samucchinnā vūpasantā paṭipassaddhā abhabbuppattikā ñāṇagginā daḍḍhā, so vuccati abbūḷhasallo abbahitasallo uddhatasallo samuddhatasallo uppāṭitasallo samuppāṭitasallo cattasallo vantasallo muttasallo pahīnasallo paṭinissaṭṭhasallo nicchāto nibbuto sītibhūto sukhapaṭisaṃvedī brahmabhūtena attanā viharatīti – abbūḷhasallo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cara"
      },
      "nti caranto viharanto iriyanto vattanto pālento yapento yāpento. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appamatto"
      },
      "ti sakkaccakārī sātaccakārī aṭṭhitakārī anolīnavuttiko anikkhittacchando anikkhittadhuro kusalesu dhammesu. ‘‘Kathāhaṃ aparipūraṃ vā sīlakkhandhaṃ paripūreyyaṃ, paripūraṃ vā sīlakkhandhaṃ tattha ",
      " tattha paññāya anuggaṇheyya’’nti yo tattha chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivāni ca sati ca sampajaññañca ātappaṃ padhānaṃ adhiṭṭhānaṃ anuyogo appamādo kusalesu ",
      " dhammesu. ‘‘Kathāhaṃ aparipūraṃ vā samādhikkhandhaṃ paripūreyyaṃ, paripūraṃ vā samādhikkhandhaṃ tattha tattha paññāya ",
      " anuggaṇheyya’’nti…pe… kusalesu dhammesu. ‘‘Kathāhaṃ aparipūraṃ vā paññākkhandhaṃ ",
      " paripūreyyaṃ… vimuttikkhandhaṃ… vimuttiñāṇadassanakkhandhaṃ paripūreyyaṃ, paripūraṃ vā vimuttiñāṇadassanakkhandhaṃ tattha tattha paññāya anuggaṇheyya’’nti yo tattha chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivāni ca sati ca sampajaññañca ātappaṃ padhānaṃ adhiṭṭhānaṃ anuyogo appamādo kusalesu dhammesu. ‘‘Kathāhaṃ apariññātaṃ vā dukkhaṃ parijāneyyaṃ, appahīne vā kilese pajaheyyaṃ, abhāvitaṃ vā maggaṃ bhāveyyaṃ, asacchikataṃ vā nirodhaṃ sacchikareyya’’nti yo tattha chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivāni ca sati ca sampajaññañca ātappaṃ padhānaṃ adhiṭṭhānaṃ anuyogo appamādo kusalesu dhammesūti – abbūḷhasallo caramappamatto."
    ],
    "innerText": "Caranti caranto viharanto iriyanto vattanto pālento yapento yāpento. Appamattoti sakkaccakārī sātaccakārī aṭṭhitakārī anolīnavuttiko anikkhittacchando anikkhittadhuro kusalesu dhammesu. ‘‘Kathāhaṃ aparipūraṃ vā sīlakkhandhaṃ paripūreyyaṃ, paripūraṃ vā sīlakkhandhaṃ tattha tattha paññāya anuggaṇheyya’’nti yo tattha chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivāni ca sati ca sampajaññañca ātappaṃ padhānaṃ adhiṭṭhānaṃ anuyogo appamādo kusalesu dhammesu. ‘‘Kathāhaṃ aparipūraṃ vā samādhikkhandhaṃ paripūreyyaṃ, paripūraṃ vā samādhikkhandhaṃ tattha tattha paññāya anuggaṇheyya’’nti…pe… kusalesu dhammesu. ‘‘Kathāhaṃ aparipūraṃ vā paññākkhandhaṃ paripūreyyaṃ… vimuttikkhandhaṃ… vimuttiñāṇadassanakkhandhaṃ paripūreyyaṃ, paripūraṃ vā vimuttiñāṇadassanakkhandhaṃ tattha tattha paññāya anuggaṇheyya’’nti yo tattha chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivāni ca sati ca sampajaññañca ātappaṃ padhānaṃ adhiṭṭhānaṃ anuyogo appamādo kusalesu dhammesu. ‘‘Kathāhaṃ apariññātaṃ vā dukkhaṃ parijāneyyaṃ, appahīne vā kilese pajaheyyaṃ, abhāvitaṃ vā maggaṃ bhāveyyaṃ, asacchikataṃ vā nirodhaṃ sacchikareyya’’nti yo tattha chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivāni ca sati ca sampajaññañca ātappaṃ padhānaṃ adhiṭṭhānaṃ anuyogo appamādo kusalesu dhammesūti – abbūḷhasallo caramappamatto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nāsīsatī lokamimaṃ parañcā"
      },
      "ti imaṃ lokaṃ nāsīsati sakattabhāvaṃ, paralokaṃ nāsīsati parattabhāvaṃ; imaṃ lokaṃ nāsīsati sakarūpavedanāsaññāsaṅkhāraviññāṇaṃ, paraṃ lokaṃ nāsīsati pararūpavedanāsaññāsaṅkhāraviññāṇaṃ; imaṃ lokaṃ nāsīsati cha ajjhattikāni āyatanāni, paraṃ ",
      " lokaṃ nāsīsati cha bāhirāni āyatanāni; imaṃ lokaṃ nāsīsati manussalokaṃ, paraṃ lokaṃ nāsīsati devalokaṃ. Imaṃ lokaṃ nāsīsati kāmadhātuṃ, paraṃ lokaṃ nāsīsati rūpadhātuṃ arūpadhātuṃ; imaṃ lokaṃ nāsīsati kāmadhātuṃ rūpadhātuṃ, paraṃ lokaṃ nāsīsati arūpadhātuṃ. Puna gatiṃ vā upapattiṃ vā paṭisandhiṃ vā bhavaṃ vā saṃsāraṃ vā vaṭṭaṃ vā nāsīsati na icchati na sādiyati na pattheti na piheti nātijappatīti – nāsīsatī lokamimaṃ parañcāti."
    ],
    "innerText": "Nāsīsatī lokamimaṃ parañcāti imaṃ lokaṃ nāsīsati sakattabhāvaṃ, paralokaṃ nāsīsati parattabhāvaṃ; imaṃ lokaṃ nāsīsati sakarūpavedanāsaññāsaṅkhāraviññāṇaṃ, paraṃ lokaṃ nāsīsati pararūpavedanāsaññāsaṅkhāraviññāṇaṃ; imaṃ lokaṃ nāsīsati cha ajjhattikāni āyatanāni, paraṃ lokaṃ nāsīsati cha bāhirāni āyatanāni; imaṃ lokaṃ nāsīsati manussalokaṃ, paraṃ lokaṃ nāsīsati devalokaṃ. Imaṃ lokaṃ nāsīsati kāmadhātuṃ, paraṃ lokaṃ nāsīsati rūpadhātuṃ arūpadhātuṃ; imaṃ lokaṃ nāsīsati kāmadhātuṃ rūpadhātuṃ, paraṃ lokaṃ nāsīsati arūpadhātuṃ. Puna gatiṃ vā upapattiṃ vā paṭisandhiṃ vā bhavaṃ vā saṃsāraṃ vā vaṭṭaṃ vā nāsīsati na icchati na sādiyati na pattheti na piheti nātijappatīti – nāsīsatī lokamimaṃ parañcāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tenāha bhagavā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Saññaṃ ",
      " pariññā vitareyya oghaṃ, pariggahesu muni nopalitto;"
    ],
    "innerText": "‘‘Saññaṃ pariññā vitareyya oghaṃ, pariggahesu muni nopalitto;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Abbūḷhasallo caramappamatto, nāsīsatī lokamimaṃ parañcā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Guhaṭṭhakasuttaniddeso dutiyo."
  }
]