[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "14. Sobhitavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Sobhitattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Padumuttaro"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nāma jino"
      },
      "tiādikaṃ āyasmato sobhitattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto padumuttarassa bhagavato kāle ekasmiṃ kulagehe nibbatto viññutaṃ patto gharāvāsaṃ saṇṭhapetvā ekadivasaṃ ",
      " satthārā dhamme desiyamāne somanassena pasannamānaso nānappakārehi thomesi. So teneva somanassena kālaṃ katvā devesu nibbatto tattha dibbasukhaṃ anubhavitvā manussesu ca manussasukhaṃ anubhavitvā imasmiṃ buddhuppāde sāvatthiyaṃ kulagehe nibbatto sattavassikova pabbajitvā nacirasseva chaḷabhiñño arahā ahosi."
    ],
    "innerText": "Padumuttaronāma jinotiādikaṃ āyasmato sobhitattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto padumuttarassa bhagavato kāle ekasmiṃ kulagehe nibbatto viññutaṃ patto gharāvāsaṃ saṇṭhapetvā ekadivasaṃ satthārā dhamme desiyamāne somanassena pasannamānaso nānappakārehi thomesi. So teneva somanassena kālaṃ katvā devesu nibbatto tattha dibbasukhaṃ anubhavitvā manussesu ca manussasukhaṃ anubhavitvā imasmiṃ buddhuppāde sāvatthiyaṃ kulagehe nibbatto sattavassikova pabbajitvā nacirasseva chaḷabhiñño arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      ". So aparabhāge attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "padumuttaro nāma jino"
      },
      "tiādimāha. Taṃ sabbaṃ heṭṭhā vuttanayattā suviññeyyamevāti."
    ],
    "innerText": "1. So aparabhāge attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento padumuttaro nāma jinotiādimāha. Taṃ sabbaṃ heṭṭhā vuttanayattā suviññeyyamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sobhitattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Sudassanattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vitthatāya nadītīre"
      },
      "tiādikaṃ āyasmato sudassanattherassa apadānaṃ. Ayampi purimajinavaresu katādhikāro tattha tattha bhave katapuññūpacayo sikhissa bhagavato kāle kulagehe nibbatto vuddhippatto gharāvāsaṃ saṇṭhapetvā vasanto vitthatāya nāma gaṅgāya samīpe pilakkhuphalitaṃ pariyesanto tassā tīre nisinnaṃ jalamānaaggisikhaṃ iva sikhiṃ sammāsambuddhaṃ disvā pasannamānaso ketakīpupphaṃ vaṇṭeneva chinditvā pūjento evamāha – ‘‘bhante, yena ñāṇena tvaṃ evaṃ mahānubhāvo sabbaññubuddho jāto, taṃ ñāṇaṃ ahaṃ pūjemī’’ti. Atha bhagavā anumodanamakāsi. So tena puññena devamanussesu jāto ubhayasampattiyo anubhavitvā imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbatto satthari pasanno pabbajitvā nacirasseva arahā ahosi."
    ],
    "innerText": "Vitthatāya nadītīretiādikaṃ āyasmato sudassanattherassa apadānaṃ. Ayampi purimajinavaresu katādhikāro tattha tattha bhave katapuññūpacayo sikhissa bhagavato kāle kulagehe nibbatto vuddhippatto gharāvāsaṃ saṇṭhapetvā vasanto vitthatāya nāma gaṅgāya samīpe pilakkhuphalitaṃ pariyesanto tassā tīre nisinnaṃ jalamānaaggisikhaṃ iva sikhiṃ sammāsambuddhaṃ disvā pasannamānaso ketakīpupphaṃ vaṇṭeneva chinditvā pūjento evamāha – ‘‘bhante, yena ñāṇena tvaṃ evaṃ mahānubhāvo sabbaññubuddho jāto, taṃ ñāṇaṃ ahaṃ pūjemī’’ti. Atha bhagavā anumodanamakāsi. So tena puññena devamanussesu jāto ubhayasampattiyo anubhavitvā imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbatto satthari pasanno pabbajitvā nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "10"
      },
      ".",
      " So ",
      " attano katakusalaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vitthatāya nadītīre"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vitthatāyā"
      },
      "ti vittharati pattharati vitthiṇṇā hotīti vitthatā, nadanti saddaṃ karonti itā gatā pavattāti nadī, nadiṃ tarantā etaṃ patvā tiṇṇā nāma hontīti tīraṃ, tassā vitthatāya nadiyā tīre tīrasamīpeti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ketakiṃ pupphitaṃ disvā"
      },
      "ti kucchitākārena gaṇhantānaṃ hatthaṃ kaṇḍako chindati vijjhatīti ketaṃ, ketassa esā ketakīpupphaṃ, taṃ disvā vaṇṭaṃ chinditvāti sambandho."
    ],
    "innerText": "10. So attano katakusalaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento vitthatāya nadītīretiādimāha. Tattha vitthatāyāti vittharati pattharati vitthiṇṇā hotīti vitthatā, nadanti saddaṃ karonti itā gatā pavattāti nadī, nadiṃ tarantā etaṃ patvā tiṇṇā nāma hontīti tīraṃ, tassā vitthatāya nadiyā tīre tīrasamīpeti attho. Ketakiṃ pupphitaṃ disvāti kucchitākārena gaṇhantānaṃ hatthaṃ kaṇḍako chindati vijjhatīti ketaṃ, ketassa esā ketakīpupphaṃ, taṃ disvā vaṇṭaṃ chinditvāti sambandho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "11"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sikhino lokabandhuno"
      },
      "ti sikhī vuccati aggi, sikhīsadisā nīlapītādibhedā jalamānā chabbaṇṇaghanaraṃsiyo yassa so sikhī, lokassa sakalalokattayassa bandhu ñātakoti lokabandhu, tassa sikhino lokabandhuno ketakīpupphaṃ ",
      " vaṇṭe chinditvā pūjesinti sambandho. Sesaṃ uttānatthamevāti."
    ],
    "innerText": "11.Sikhino lokabandhunoti sikhī vuccati aggi, sikhīsadisā nīlapītādibhedā jalamānā chabbaṇṇaghanaraṃsiyo yassa so sikhī, lokassa sakalalokattayassa bandhu ñātakoti lokabandhu, tassa sikhino lokabandhuno ketakīpupphaṃ vaṇṭe chinditvā pūjesinti sambandho. Sesaṃ uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sudassanattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Candanapūjanakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Candabhāgānadītīre"
      },
      "tiādikaṃ āyasmato candanapūjanakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto atthadassissa bhagavato kāle himavante candabhāgānadiyā samīpe kinnarayoniyaṃ nibbatto pupphabhakkho pupphanivasano candanaagaruādīsu gandhavibhūsito himavante bhummadevatā viya uyyānakīḷajalakīḷādianekasukhaṃ anubhavanto vāsaṃ kappesi. Tadā atthadassī bhagavā tassānukampāya himavantaṃ gantvā ākāsato oruyha saṅghāṭiṃ paññāpetvā nisīdi. So kinnaro taṃ bhagavantaṃ vijjotamānaṃ tattha nisinnaṃ disvā pasannamānaso sugandhacandanena pūjesi. Tassa bhagavā anumodanaṃ akāsi."
    ],
    "innerText": "Candabhāgānadītīretiādikaṃ āyasmato candanapūjanakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto atthadassissa bhagavato kāle himavante candabhāgānadiyā samīpe kinnarayoniyaṃ nibbatto pupphabhakkho pupphanivasano candanaagaruādīsu gandhavibhūsito himavante bhummadevatā viya uyyānakīḷajalakīḷādianekasukhaṃ anubhavanto vāsaṃ kappesi. Tadā atthadassī bhagavā tassānukampāya himavantaṃ gantvā ākāsato oruyha saṅghāṭiṃ paññāpetvā nisīdi. So kinnaro taṃ bhagavantaṃ vijjotamānaṃ tattha nisinnaṃ disvā pasannamānaso sugandhacandanena pūjesi. Tassa bhagavā anumodanaṃ akāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "17"
      },
      ". So tena puññena tena somanassena yāvatāyukaṃ ṭhatvā tato cuto devaloke nibbatto aparāparaṃ cha kāmāvacarasampattiyo anubhavitvā manussesu cakkavattirajjapadesarajjasampattiyo anubhavitvā ",
      " imasmiṃ buddhuppāde kulagehe nibbatto viññutaṃ patto pabbajitvā nacirasseva arahattaṃ patvā attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "candabhāgānadītīre"
      },
      "tiādimāha. Tattha candaṃ manaṃ ruciṃ ajjhāsayaṃ ñatvā viya jātoti cando. Candamaṇḍalena pasannanimmalodakena ubhosu passesu muttādalasadisasantharadhavalapulinatalena ",
      " ca samannāgatattā candena bhāgā sadisāti candabhāgā, tassā candabhāgāya nadiyā tīre samīpeti attho. Sesaṃ sabbaṃ heṭṭhā vuttanayattā suviññeyyamevāti."
    ],
    "innerText": "17. So tena puññena tena somanassena yāvatāyukaṃ ṭhatvā tato cuto devaloke nibbatto aparāparaṃ cha kāmāvacarasampattiyo anubhavitvā manussesu cakkavattirajjapadesarajjasampattiyo anubhavitvā imasmiṃ buddhuppāde kulagehe nibbatto viññutaṃ patto pabbajitvā nacirasseva arahattaṃ patvā attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento candabhāgānadītīretiādimāha. Tattha candaṃ manaṃ ruciṃ ajjhāsayaṃ ñatvā viya jātoti cando. Candamaṇḍalena pasannanimmalodakena ubhosu passesu muttādalasadisasantharadhavalapulinatalena ca samannāgatattā candena bhāgā sadisāti candabhāgā, tassā candabhāgāya nadiyā tīre samīpeti attho. Sesaṃ sabbaṃ heṭṭhā vuttanayattā suviññeyyamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Candanapūjanakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Aṭṭhamabhāṇavāravaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Pupphacchadaniyattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sunando nāma nāmenā"
      },
      "tiādikaṃ āyasmato pupphacchadaniyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro anekesu bhavesu vivaṭṭūpanissayāni puññāni upacinanto padumuttarassa bhagavato kāle brāhmaṇakule nibbatto viññutaṃ patvā sakasippesu nipphattiṃ patto mahābhogo mahāyaso dānābhirato ahosi. Ekadivasaṃ so ‘‘sakalajambudīpe ime yācakā nāma ‘ahaṃ dānaṃ na laddhosmī’ti ",
      " vattuṃ mā labhantū’’ti mahādānaṃ sajjesi. Tadā padumuttaro bhagavā saparivāro ākāsena gacchati. Brāhmaṇo taṃ disvā pasannacitto sakasisse pakkosāpetvā pupphāni āharāpetvā ākāse ukkhipitvā pūjesi. Tāni sakalanagaraṃ chādetvā satta divasāni aṭṭhaṃsu."
    ],
    "innerText": "Sunando nāma nāmenātiādikaṃ āyasmato pupphacchadaniyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro anekesu bhavesu vivaṭṭūpanissayāni puññāni upacinanto padumuttarassa bhagavato kāle brāhmaṇakule nibbatto viññutaṃ patvā sakasippesu nipphattiṃ patto mahābhogo mahāyaso dānābhirato ahosi. Ekadivasaṃ so ‘‘sakalajambudīpe ime yācakā nāma ‘ahaṃ dānaṃ na laddhosmī’ti vattuṃ mā labhantū’’ti mahādānaṃ sajjesi. Tadā padumuttaro bhagavā saparivāro ākāsena gacchati. Brāhmaṇo taṃ disvā pasannacitto sakasisse pakkosāpetvā pupphāni āharāpetvā ākāse ukkhipitvā pūjesi. Tāni sakalanagaraṃ chādetvā satta divasāni aṭṭhaṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "26"
      },
      ". So tena puññakammena devamanussesu sukhaṃ anubhavitvā imasmiṃ buddhuppāde sāvatthiyaṃ ekasmiṃ kulagehe nibbatto saddhājāto pabbajitvā khuraggeyeva arahattaṃ patvā attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sunando nāma nāmenā"
      },
      "tiādimāha. Taṃ heṭṭhā vuttanayattā suviññeyyamevāti."
    ],
    "innerText": "26. So tena puññakammena devamanussesu sukhaṃ anubhavitvā imasmiṃ buddhuppāde sāvatthiyaṃ ekasmiṃ kulagehe nibbatto saddhājāto pabbajitvā khuraggeyeva arahattaṃ patvā attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento sunando nāma nāmenātiādimāha. Taṃ heṭṭhā vuttanayattā suviññeyyamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pupphacchadaniyattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Rahosaññakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Himavantassāvidūre"
      },
      "tiādikaṃ ",
      " āyasmato rahosaññakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto ekasmiṃ buddhasuññakāle majjhimadese brāhmaṇakule nibbatto vuddhimanvāya sakasippesu nipphattiṃ patvā tattha sāraṃ apassanto kevalaṃ udaraṃ pūretvā kodhamadamānādayo akusaleyeva disvā gharāvāsaṃ pahāya himavantaṃ pavisitvā isipabbajjaṃ ",
      " pabbajitvā anekatāpasasataparivāro vasabhapabbatasamīpe assamaṃ māpetvā tīṇi vassasahassāni himavanteyeva vasamāno ‘‘ahaṃ ettakānaṃ sissānaṃ ācariyoti sammato garuṭṭhāniyo garukātabbo vandanīyo, ācariyo me natthī’’ti domanassappatto te sabbe sisse sannipātetvā buddhānaṃ abhāve nibbānādhigamābhāvaṃ pakāsetvā sayaṃ ekako raho vivekaṭṭhāneva nisinno buddhassa sammukhā nisinno viya buddhasaññaṃ manasi karitvā buddhārammaṇaṃ pītiṃ uppādetvā sālāyaṃ pallaṅkaṃ ābhujitvā nisinno kālaṃ katvā brahmaloke nibbatti."
    ],
    "innerText": "Himavantassāvidūretiādikaṃ āyasmato rahosaññakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto ekasmiṃ buddhasuññakāle majjhimadese brāhmaṇakule nibbatto vuddhimanvāya sakasippesu nipphattiṃ patvā tattha sāraṃ apassanto kevalaṃ udaraṃ pūretvā kodhamadamānādayo akusaleyeva disvā gharāvāsaṃ pahāya himavantaṃ pavisitvā isipabbajjaṃ pabbajitvā anekatāpasasataparivāro vasabhapabbatasamīpe assamaṃ māpetvā tīṇi vassasahassāni himavanteyeva vasamāno ‘‘ahaṃ ettakānaṃ sissānaṃ ācariyoti sammato garuṭṭhāniyo garukātabbo vandanīyo, ācariyo me natthī’’ti domanassappatto te sabbe sisse sannipātetvā buddhānaṃ abhāve nibbānādhigamābhāvaṃ pakāsetvā sayaṃ ekako raho vivekaṭṭhāneva nisinno buddhassa sammukhā nisinno viya buddhasaññaṃ manasi karitvā buddhārammaṇaṃ pītiṃ uppādetvā sālāyaṃ pallaṅkaṃ ābhujitvā nisinno kālaṃ katvā brahmaloke nibbatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "34"
      },
      ". So tattha jhānasukhena ciraṃ vasitvā imasmiṃ buddhuppāde kulagehe nibbatto kāmesu anallīno sattavassiko pabbajitvā khuraggeyeva arahattaṃ patvā chaḷabhiñño hutvā pubbenivāsañāṇena attano pubbakammaṃ saritvā sañjātasomanasso pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "himavantassāvidūre"
      },
      "tiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vasabho nāma pabbato"
      },
      "ti himavantapabbataṃ vinā sesapabbatānaṃ uccatarabhāvena seṭṭhatarabhāvena vasabhoti saṅkhaṃ gato pabbatoti attho. Sesaṃ sabbattha uttānatthamevāti."
    ],
    "innerText": "34. So tattha jhānasukhena ciraṃ vasitvā imasmiṃ buddhuppāde kulagehe nibbatto kāmesu anallīno sattavassiko pabbajitvā khuraggeyeva arahattaṃ patvā chaḷabhiñño hutvā pubbenivāsañāṇena attano pubbakammaṃ saritvā sañjātasomanasso pubbacaritāpadānaṃ pakāsento himavantassāvidūretiādimāha. Vasabho nāma pabbatoti himavantapabbataṃ vinā sesapabbatānaṃ uccatarabhāvena seṭṭhatarabhāvena vasabhoti saṅkhaṃ gato pabbatoti attho. Sesaṃ sabbattha uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Rahosaññakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Campakapupphiyattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kaṇikāraṃva"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jotanta"
      },
      "ntiādikaṃ āyasmato campakapupphiyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto vessabhussa bhagavato kāle brāhmaṇakule ",
      " nibbatto vuddhippatto sakasippesu nipphattiṃ patvā tattha sāraṃ apassanto gharāvāsaṃ pahāya tāpasapabbajjaṃ pabbajitvā vanantare vasanto vessabhuṃ bhagavantaṃ uddissa sissehi ānītehi campakapupphehi pūjesi. Bhagavā anumodanaṃ akāsi. So teneva kusalena devamanussesu saṃsaranto ubhayasampattiyo anubhavitvā imasmiṃ buddhuppāde kulagehe nibbatto viññutaṃ pāpuṇitvā pubbavāsanābalena gharāvāse anallīno pabbajitvā nacirasseva arahā ahosi."
    ],
    "innerText": "Kaṇikāraṃvajotantantiādikaṃ āyasmato campakapupphiyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto vessabhussa bhagavato kāle brāhmaṇakule nibbatto vuddhippatto sakasippesu nipphattiṃ patvā tattha sāraṃ apassanto gharāvāsaṃ pahāya tāpasapabbajjaṃ pabbajitvā vanantare vasanto vessabhuṃ bhagavantaṃ uddissa sissehi ānītehi campakapupphehi pūjesi. Bhagavā anumodanaṃ akāsi. So teneva kusalena devamanussesu saṃsaranto ubhayasampattiyo anubhavitvā imasmiṃ buddhuppāde kulagehe nibbatto viññutaṃ pāpuṇitvā pubbavāsanābalena gharāvāse anallīno pabbajitvā nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "41"
      },
      ". So aparabhāge attano pubbapuññakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kaṇikāraṃva jotanta"
      },
      "ntiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kaṇikāra"
      },
      "nti sakalapattapalāsāni paribhajja pātetvā pupphagahaṇasamaye kaṇṇikābaddho hutvā pupphamakuḷānaṃ gahaṇato kaṇṇikākārena pakatoti kaṇikāro, ‘‘kaṇṇikāro’’ti vattabbe niruttinayena ekassa pubba ṇa-kārassa lopaṃ katvā ‘‘kaṇikāra’’nti ",
      " vuttanti daṭṭhabbaṃ. Taṃ pupphitaṃ kaṇikārarukkhaṃ iva jotantaṃ buddhaṃ addasanti attho. Sesaṃ uttānatthamevāti."
    ],
    "innerText": "41. So aparabhāge attano pubbapuññakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento kaṇikāraṃva jotantantiādimāha. Tattha kaṇikāranti sakalapattapalāsāni paribhajja pātetvā pupphagahaṇasamaye kaṇṇikābaddho hutvā pupphamakuḷānaṃ gahaṇato kaṇṇikākārena pakatoti kaṇikāro, ‘‘kaṇṇikāro’’ti vattabbe niruttinayena ekassa pubba ṇa-kārassa lopaṃ katvā ‘‘kaṇikāra’’nti vuttanti daṭṭhabbaṃ. Taṃ pupphitaṃ kaṇikārarukkhaṃ iva jotantaṃ buddhaṃ addasanti attho. Sesaṃ uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Campakapupphiyattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Atthasandassakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Visālamāḷe āsīno"
      },
      "tiādikaṃ āyasmato atthasandassakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro anekesu attabhāvesu katapuññūpacayo padumuttarassa bhagavato kāle brāhmaṇakule nibbatto vuddhimanvāya sakasippesu nipphattiṃ patto tattha sāraṃ apassanto gehaṃ pahāya himavantaṃ gantvā ramaṇīye ṭhāne paṇṇasālaṃ katvā paṭivasati, tadā sattānukampāya himavantamāgataṃ padumuttarabhagavantaṃ disvā pasannamānaso pañcaṅgasamannāgato vanditvā thutivacanehi thomesi. So tena puññena yāvatāyukaṃ katvā kālaṅkatvā brahmalokūpago ahosi. So aparabhāge imasmiṃ buddhuppāde kulagehe nibbatto viññutaṃ patto satthu dhammadesanaṃ sutvā paṭiladdhasaddho pabbajitvā arahattaṃ pāpuṇi."
    ],
    "innerText": "Visālamāḷe āsīnotiādikaṃ āyasmato atthasandassakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro anekesu attabhāvesu katapuññūpacayo padumuttarassa bhagavato kāle brāhmaṇakule nibbatto vuddhimanvāya sakasippesu nipphattiṃ patto tattha sāraṃ apassanto gehaṃ pahāya himavantaṃ gantvā ramaṇīye ṭhāne paṇṇasālaṃ katvā paṭivasati, tadā sattānukampāya himavantamāgataṃ padumuttarabhagavantaṃ disvā pasannamānaso pañcaṅgasamannāgato vanditvā thutivacanehi thomesi. So tena puññena yāvatāyukaṃ katvā kālaṅkatvā brahmalokūpago ahosi. So aparabhāge imasmiṃ buddhuppāde kulagehe nibbatto viññutaṃ patto satthu dhammadesanaṃ sutvā paṭiladdhasaddho pabbajitvā arahattaṃ pāpuṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "47"
      },
      ". So ",
      " attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "visālamāḷe āsīno"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "visālamāḷe"
      },
      "ti visālaṃ patthaṭaṃ vitthiṇṇaṃ mahantaṃ māḷaṃ visālamāḷaṃ, tasmiṃ visālamāḷe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āsīno"
      },
      " nisinno ahaṃ lokanāyakaṃ addasanti sambandho. Tesaṃ suviññeyyamevāti."
    ],
    "innerText": "47. So attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento visālamāḷe āsīnotiādimāha. Tattha visālamāḷeti visālaṃ patthaṭaṃ vitthiṇṇaṃ mahantaṃ māḷaṃ visālamāḷaṃ, tasmiṃ visālamāḷe āsīno nisinno ahaṃ lokanāyakaṃ addasanti sambandho. Tesaṃ suviññeyyamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Atthasandassakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Ekapasādaniyattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nārado iti me nāma"
      },
      "ntiādikaṃ āyasmato ekapasādaniyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro anekāsu jātīsu katakusalo atthadassissa bhagavato kāle brāhmaṇakule nibbatto kesavoti pākaṭo hutvā viññutaṃ patvā gharāvāsaṃ pahāya pabbajitvā vasanto ekadivasaṃ satthu dhammadesanaṃ sutvā pasannamānaso añjaliṃ paggayha ativiya pītisomanassajāto pakkāmi. So yāvatāyukaṃ ṭhatvā teneva somanassena kālaṃ katvā devesu nibbatto tattha dibbasampattiṃ anubhavitvā manussesu uppanno tattha sampattiyo anubhavitvā imasmiṃ buddhuppāde aññatarasmiṃ kulagehe nibbatto vuddhippatto satthari pasīditvā pabbajito nacirasseva arahā ahosi."
    ],
    "innerText": "Nārado iti me nāmantiādikaṃ āyasmato ekapasādaniyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro anekāsu jātīsu katakusalo atthadassissa bhagavato kāle brāhmaṇakule nibbatto kesavoti pākaṭo hutvā viññutaṃ patvā gharāvāsaṃ pahāya pabbajitvā vasanto ekadivasaṃ satthu dhammadesanaṃ sutvā pasannamānaso añjaliṃ paggayha ativiya pītisomanassajāto pakkāmi. So yāvatāyukaṃ ṭhatvā teneva somanassena kālaṃ katvā devesu nibbatto tattha dibbasampattiṃ anubhavitvā manussesu uppanno tattha sampattiyo anubhavitvā imasmiṃ buddhuppāde aññatarasmiṃ kulagehe nibbatto vuddhippatto satthari pasīditvā pabbajito nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "55"
      },
      ". So ",
      " aparabhāge attano katakusalakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nārado iti me nāma"
      },
      "ntiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nārado"
      },
      "ti jātivasena suddhasarīrattā natthi rajo dhūli malaṃ etassāti nārado, ja-kārassa da-kāraṃ katvā nāradoti kuladattikaṃ nāmaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kesavo"
      },
      "ti kisavacchagotte jātattā kesavo nāradakesavo iti maṃ janā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vidū"
      },
      " jānantīti attho. Sesaṃ pākaṭamevāti."
    ],
    "innerText": "55. So aparabhāge attano katakusalakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento nārado iti me nāmantiādimāha. Tattha nāradoti jātivasena suddhasarīrattā natthi rajo dhūli malaṃ etassāti nārado, ja-kārassa da-kāraṃ katvā nāradoti kuladattikaṃ nāmaṃ. Kesavoti kisavacchagotte jātattā kesavo nāradakesavo iti maṃ janā vidū jānantīti attho. Sesaṃ pākaṭamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ekapasādaniyattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Sālapupphadāyakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Migarājā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tadā āsi"
      },
      "ntiādikaṃ āyasmato sālapupphadāyakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave katakusalasañcayo kenaci kammacchiddena himavante sīhayoniyaṃ nibbatto anekasīhaparivāro vihāsi. Tadā sikhī bhagavā tassānukampāya himavantaṃ agamāsi. Sīho taṃ upagataṃ disvā pasannamānaso sākhābhaṅgena sakaṇṇikasālapupphaṃ gahetvā pūjesi. Bhagavā tassa anumodanaṃ akāsi."
    ],
    "innerText": "Migarājātadā āsintiādikaṃ āyasmato sālapupphadāyakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave katakusalasañcayo kenaci kammacchiddena himavante sīhayoniyaṃ nibbatto anekasīhaparivāro vihāsi. Tadā sikhī bhagavā tassānukampāya himavantaṃ agamāsi. Sīho taṃ upagataṃ disvā pasannamānaso sākhābhaṅgena sakaṇṇikasālapupphaṃ gahetvā pūjesi. Bhagavā tassa anumodanaṃ akāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "60"
      },
      ". So tena puññena devamanussesu saṃsaranto ubhayasampattiyo anubhavitvā imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbatto viññutaṃ patvā satthari pasanno pabbajitvā arahattaṃ patto attano pubbakammaṃ ",
      " saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "migarājā tadā āsi"
      },
      "ntiādimāha. Tattha maraṇaṃ gacchantīti migā, atha vā ghāsaṃ magganti gavesantīti migā, migānaṃ rājā migarājā. Sakalacatuppadānaṃ rājabhāve satipi gāthābandhasukhatthaṃ mige ādiṃ katvā migarājāti vuttaṃ. Yadā bhagavantaṃ disvā sapupphaṃ sālasākhaṃ bhañjitvā pūjesiṃ, tadā ahaṃ migarājā ahosinti attho."
    ],
    "innerText": "60. So tena puññena devamanussesu saṃsaranto ubhayasampattiyo anubhavitvā imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbatto viññutaṃ patvā satthari pasanno pabbajitvā arahattaṃ patto attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento migarājā tadā āsintiādimāha. Tattha maraṇaṃ gacchantīti migā, atha vā ghāsaṃ magganti gavesantīti migā, migānaṃ rājā migarājā. Sakalacatuppadānaṃ rājabhāve satipi gāthābandhasukhatthaṃ mige ādiṃ katvā migarājāti vuttaṃ. Yadā bhagavantaṃ disvā sapupphaṃ sālasākhaṃ bhañjitvā pūjesiṃ, tadā ahaṃ migarājā ahosinti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "62"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sakosaṃ pupphamāhari"
      },
      "nti sakaṇṇikaṃ sālapupphaṃ āhariṃ pūjesinti attho. Sesaṃ uttānatthamevāti."
    ],
    "innerText": "62.Sakosaṃ pupphamāharinti sakaṇṇikaṃ sālapupphaṃ āhariṃ pūjesinti attho. Sesaṃ uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sālapupphadāyakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Piyālaphaladāyakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parodhako"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tadā āsi"
      },
      "ntiādikaṃ āyasmato piyālaphaladāyakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto sikhissa bhagavato kāle nesādakule nibbatto himavante ekasmiṃ pabbhāre mige vadhitvā jīvikaṃ kappetvā vasati. Tasmiṃ kāle tattha gataṃ sikhiṃ bhagavantaṃ disvā pasannamānaso sāyaṃ pātaṃ namassamāno kañci deyyadhammaṃ apassanto madhurāni ",
      " piyālaphalāni uccinitvā adāsi. Bhagavā tāni paribhuñji. So nesādo buddhārammaṇāya pītiyā nirantaraṃ phuṭṭhasarīro pāpakamme virattacitto mūlaphalāhāro nacirasseva kālaṃ katvā devaloke nibbatti."
    ],
    "innerText": "Parodhakotadā āsintiādikaṃ āyasmato piyālaphaladāyakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto sikhissa bhagavato kāle nesādakule nibbatto himavante ekasmiṃ pabbhāre mige vadhitvā jīvikaṃ kappetvā vasati. Tasmiṃ kāle tattha gataṃ sikhiṃ bhagavantaṃ disvā pasannamānaso sāyaṃ pātaṃ namassamāno kañci deyyadhammaṃ apassanto madhurāni piyālaphalāni uccinitvā adāsi. Bhagavā tāni paribhuñji. So nesādo buddhārammaṇāya pītiyā nirantaraṃ phuṭṭhasarīro pāpakamme virattacitto mūlaphalāhāro nacirasseva kālaṃ katvā devaloke nibbatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "66"
      },
      ". So tattha dibbasampattiyo anubhavitvā manussesu ca anekavidhasampattiyo anubhavitvā imasmiṃ buddhuppāde gahapatikule nibbatto viññutaṃ patto gharāvāsaṃ saṇṭhapetvā tattha anabhirato gehaṃ pahāya satthu santike pabbajitvā vipassanaṃ vaḍḍhetvā nacirasseva arahattaṃ patto attano kataphaladānakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "parodhako tadā āsi"
      },
      "ntiādimāha. Tattha yadā ahaṃ piyālaphalaṃ datvā cittaṃ pasādesiṃ, tadā ahaṃ parodhako āsinti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parodhako"
      },
      "ti parasattarodhako vihesako. ‘‘Pararodhako’’ti vattabbe pubbassa ra-kārassa lopaṃ katvā ‘‘parodhako’’ti vuttaṃ."
    ],
    "innerText": "66. So tattha dibbasampattiyo anubhavitvā manussesu ca anekavidhasampattiyo anubhavitvā imasmiṃ buddhuppāde gahapatikule nibbatto viññutaṃ patto gharāvāsaṃ saṇṭhapetvā tattha anabhirato gehaṃ pahāya satthu santike pabbajitvā vipassanaṃ vaḍḍhetvā nacirasseva arahattaṃ patto attano kataphaladānakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento parodhako tadā āsintiādimāha. Tattha yadā ahaṃ piyālaphalaṃ datvā cittaṃ pasādesiṃ, tadā ahaṃ parodhako āsinti sambandho. Parodhakoti parasattarodhako vihesako. ‘‘Pararodhako’’ti vattabbe pubbassa ra-kārassa lopaṃ katvā ‘‘parodhako’’ti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "69"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paricāriṃ vināyaka"
      },
      "nti taṃ nibbānapāpakaṃ satthāraṃ, ‘‘bhante ",
      ", imaṃ phalaṃ paribhuñjathā’’ti pavāriṃ nimantesiṃ ārādhesinti attho. Sesaṃ suviññeyyamevāti."
    ],
    "innerText": "69.Paricāriṃ vināyakanti taṃ nibbānapāpakaṃ satthāraṃ, ‘‘bhante , imaṃ phalaṃ paribhuñjathā’’ti pavāriṃ nimantesiṃ ārādhesinti attho. Sesaṃ suviññeyyamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Piyālaphaladāyakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Cuddasamavaggavaṇṇanā samattā."
  }
]