[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "7. Revatabuddhavaṃsavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sumanassa ",
      " pana bhagavato aparabhāge sāsane cassa antarahite navutivassasahassāyukā manussā anukkamena parihāyitvā dasavassāyukā hutvā puna anukkamena vaḍḍhitvā asaṅkhyeyyāyukā hutvā puna parihāyamānā saṭṭhivassasahassāyukā ahesuṃ. Tadā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "revato"
      },
      " nāma satthā udapādi. Sopi pāramiyo pūretvā anekaratanasamujjalitabhavane tusitabhavane nibbattitvā tato cavitvā sabbadhanadhaññavatisudhaññavatīnagare sabbālaṅkārasamalaṅkataamitaruciraparivāraparivutassa sirivibhavasamudayenākulassa sabbasamiddhivipulassa vipulassa nāma rañño kule sabbajananayanālipālisamākulāya samphullanayanakuvalayasassirikasiniddhavadanakamalākarasobhāsamujjalāya suruciramanoharaguṇagaṇavipulāya vipulāya nāma aggamahesiyā kucchismiṃ paṭisandhiṃ gahetvā dasannaṃ māsānaṃ accayena cittakūṭapabbatato suvaṇṇahaṃsarājā viya mātukucchito nikkhami."
    ],
    "innerText": "Sumanassa pana bhagavato aparabhāge sāsane cassa antarahite navutivassasahassāyukā manussā anukkamena parihāyitvā dasavassāyukā hutvā puna anukkamena vaḍḍhitvā asaṅkhyeyyāyukā hutvā puna parihāyamānā saṭṭhivassasahassāyukā ahesuṃ. Tadā revato nāma satthā udapādi. Sopi pāramiyo pūretvā anekaratanasamujjalitabhavane tusitabhavane nibbattitvā tato cavitvā sabbadhanadhaññavatisudhaññavatīnagare sabbālaṅkārasamalaṅkataamitaruciraparivāraparivutassa sirivibhavasamudayenākulassa sabbasamiddhivipulassa vipulassa nāma rañño kule sabbajananayanālipālisamākulāya samphullanayanakuvalayasassirikasiniddhavadanakamalākarasobhāsamujjalāya suruciramanoharaguṇagaṇavipulāya vipulāya nāma aggamahesiyā kucchismiṃ paṭisandhiṃ gahetvā dasannaṃ māsānaṃ accayena cittakūṭapabbatato suvaṇṇahaṃsarājā viya mātukucchito nikkhami."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tassa paṭisandhiyaṃ jātiyañca pāṭihāriyāni pubbe vuttanayāneva ahesuṃ. Sudassanaratanagghiāveḷanāmakā tayo cassa pāsādā ahesuṃ. Sudassanādevippamukhāni tettiṃsa itthisahassāni paccupaṭṭhitāni ahesuṃ. Tāhi parivuto so surayuvatīhi parivuto devakumāro viya chabbassasahassāni visayasukhamanubhavamāno agāraṃ ",
      " ajjhāvasi. So sudassanāya nāma deviyā varuṇe nāma tanaye jāte cattāri nimittāni disvā nānāvirāgatanuvaravasananivasano āmukkamuttāhāramaṇikuṇḍalo varakeyūramakuṭakaṭakadharo paramasurabhigandhakusumasamalaṅkato paramarucirakaranikaro saradasamayarajanikaro viya tārāgaṇaparivuto viya cando tidasagaṇaparivuto viya dasasatanayano brahmagaṇaparivuto viya ca hāritamahābrahmā caturaṅginiyā mahatiyā senāya parivuto ājaññarathena mahābhinikkhamanaṃ nikkhamitvā sabbābharaṇāni omuñcitvā bhaṇḍāgārikassa hatthe datvā jalajāmalāvikalanīlakuvalayadalasadisenātinisitenātitikhiṇenāsinā sakesamakuṭaṃ chinditvā ākāse khipi. Taṃ sakko devarājā suvaṇṇacaṅkoṭakena ",
      " paṭiggahetvā tāvatiṃsabhavanaṃ netvā sinerumuddhani sattaratanamayaṃ cetiyaṃ akāsi."
    ],
    "innerText": "Tassa paṭisandhiyaṃ jātiyañca pāṭihāriyāni pubbe vuttanayāneva ahesuṃ. Sudassanaratanagghiāveḷanāmakā tayo cassa pāsādā ahesuṃ. Sudassanādevippamukhāni tettiṃsa itthisahassāni paccupaṭṭhitāni ahesuṃ. Tāhi parivuto so surayuvatīhi parivuto devakumāro viya chabbassasahassāni visayasukhamanubhavamāno agāraṃ ajjhāvasi. So sudassanāya nāma deviyā varuṇe nāma tanaye jāte cattāri nimittāni disvā nānāvirāgatanuvaravasananivasano āmukkamuttāhāramaṇikuṇḍalo varakeyūramakuṭakaṭakadharo paramasurabhigandhakusumasamalaṅkato paramarucirakaranikaro saradasamayarajanikaro viya tārāgaṇaparivuto viya cando tidasagaṇaparivuto viya dasasatanayano brahmagaṇaparivuto viya ca hāritamahābrahmā caturaṅginiyā mahatiyā senāya parivuto ājaññarathena mahābhinikkhamanaṃ nikkhamitvā sabbābharaṇāni omuñcitvā bhaṇḍāgārikassa hatthe datvā jalajāmalāvikalanīlakuvalayadalasadisenātinisitenātitikhiṇenāsinā sakesamakuṭaṃ chinditvā ākāse khipi. Taṃ sakko devarājā suvaṇṇacaṅkoṭakena paṭiggahetvā tāvatiṃsabhavanaṃ netvā sinerumuddhani sattaratanamayaṃ cetiyaṃ akāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Mahāpuriso ",
      " pana devadattāni kāsāyāni paridahitvā pabbaji, ekā ca naṃ purisakoṭi anupabbaji. So tehi parivuto sattamāse padhānacariyaṃ caritvā visākhapuṇṇamāya aññatarāya sādhudeviyā nāma seṭṭhidhītāya dinnaṃ madhupāyāsaṃ paribhuñjitvā sālavane divāvihāraṃ vītināmetvā sāyanhasamaye aññatarenājīvakena dinnā aṭṭha tiṇamuṭṭhiyo gahetvā mattavaranāgagāmī nāgabodhiṃ padakkhiṇaṃ katvā tepaṇṇāsahatthavitthataṃ tiṇasantharaṃ santharitvā caturaṅgavīriyaṃ adhiṭṭhāya nisīditvā mārabalaṃ vidhamitvā sabbaññutaññāṇaṃ paṭivijjhitvā – ‘‘anekajātisaṃsāraṃ…pe… taṇhānaṃ khayamajjhagā’’ti (dha. pa. 153-154) udānaṃ udānesi. Tena vuttaṃ –"
    ],
    "innerText": "Mahāpuriso pana devadattāni kāsāyāni paridahitvā pabbaji, ekā ca naṃ purisakoṭi anupabbaji. So tehi parivuto sattamāse padhānacariyaṃ caritvā visākhapuṇṇamāya aññatarāya sādhudeviyā nāma seṭṭhidhītāya dinnaṃ madhupāyāsaṃ paribhuñjitvā sālavane divāvihāraṃ vītināmetvā sāyanhasamaye aññatarenājīvakena dinnā aṭṭha tiṇamuṭṭhiyo gahetvā mattavaranāgagāmī nāgabodhiṃ padakkhiṇaṃ katvā tepaṇṇāsahatthavitthataṃ tiṇasantharaṃ santharitvā caturaṅgavīriyaṃ adhiṭṭhāya nisīditvā mārabalaṃ vidhamitvā sabbaññutaññāṇaṃ paṭivijjhitvā – ‘‘anekajātisaṃsāraṃ…pe… taṇhānaṃ khayamajjhagā’’ti (dha. pa. 153-154) udānaṃ udānesi. Tena vuttaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      "."
    ],
    "innerText": "1."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sumanassa aparena, revato nāma nāyako;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Anupamo asadiso, atulo uttamo jino’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Revato kira satthā bodhisamīpeyeva sattasattāhāni vītināmetvā dhammadesanatthaṃ brahmāyācanaṃ sampaṭicchitvā – ‘‘kassa nu kho ahaṃ paṭhamaṃ dhammaṃ deseyya’’nti (dī. ni. 2.72; ma. ni. 1.284; 2.341; mahāva. 10) upadhārento attanā saha pabbajitabhikkhukoṭiyo aññe ca bahū devamanusse upanissayasampanne disvā ākāsena gantvā varuṇārāme otaritvā tehi parivuto gambhīraṃ nipuṇaṃ tiparivaṭṭaṃ appaṭivattiyaṃ aññena anuttaraṃ dhammacakkaṃ pavattetvā bhikkhūnaṃ koṭi arahatte patiṭṭhāpesi. Tīsu maggaphalesu patiṭṭhitānaṃ gaṇanaparicchedo natthi. Tena vuttaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "2"
      },
      "."
    ],
    "innerText": "2."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sopi dhammaṃ pakāsesi, brahmunā abhiyācito;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Khandhadhātuvavatthānaṃ, appavattaṃ bhavābhave’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "khandhadhātuvavatthāna"
      },
      "nti pañcannaṃ khandhānaṃ aṭṭhārasannaṃ dhātūnaṃ nāmarūpavavatthānādivasena vibhāgakaraṇaṃ. Sabhāvalakkhaṇasāmaññalakkhaṇādivasena rūpārūpadhammapariggaho khandhadhātuvavatthānaṃ nāma. Atha vā pheṇapiṇḍūpamaṃ rūpaṃ parimaddanāsahanato chiddāvachiddādibhāvato ca udakapubbuḷakaṃ viya ",
      " vedanā muhuttaramaṇīyabhāvato, marīcikā viya saññā vippalambhanato, kadalikkhandho viya saṅkhārā asārakato, māyā viya viññāṇaṃ vañcanakato’’ti evamādināpi nayena aniccānupassanādivasenapi khandhadhātuvavatthānaṃ veditabbaṃ (vibha. aṭṭha. 26 kamādivinicchayakathā). ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appavattaṃ bhavābhave"
      },
      "ti ettha bhavoti vaḍḍhi, abhavoti hāni. Bhavoti sassatadiṭṭhi ",
      ", abhavoti ucchedadiṭṭhi. Bhavoti khuddakabhavo, abhavoti mahābhavo. Bhavoti kāmabhavo, abhavoti rūpārūpabhavoti evamādinā nayena bhavābhavānaṃ attho veditabbo (ma. ni. aṭṭha. 2.223; saṃ. ni. aṭṭha. 3.5.1080; udā. aṭṭha. 20). Tesaṃ bhavābhavānaṃ appavattihetubhūtaṃ dhammaṃ pakāsesīti attho. Atha vā bhavati anenāti bhavo, tīsu bhavesu uppattinimittaṃ kammādikaṃ. Upapattibhavo abhavo nāma. Ubhayattha nikantiyā pahānakaraṃ appavattaṃ dhammaṃ desesīti attho. Tassa pana revatabuddhassa tayova abhisamayā ahesuṃ. Paṭhamo panassa gaṇanapathaṃ vītivatto. Tena vuttaṃ –"
    ],
    "innerText": "Tattha khandhadhātuvavatthānanti pañcannaṃ khandhānaṃ aṭṭhārasannaṃ dhātūnaṃ nāmarūpavavatthānādivasena vibhāgakaraṇaṃ. Sabhāvalakkhaṇasāmaññalakkhaṇādivasena rūpārūpadhammapariggaho khandhadhātuvavatthānaṃ nāma. Atha vā pheṇapiṇḍūpamaṃ rūpaṃ parimaddanāsahanato chiddāvachiddādibhāvato ca udakapubbuḷakaṃ viya vedanā muhuttaramaṇīyabhāvato, marīcikā viya saññā vippalambhanato, kadalikkhandho viya saṅkhārā asārakato, māyā viya viññāṇaṃ vañcanakato’’ti evamādināpi nayena aniccānupassanādivasenapi khandhadhātuvavatthānaṃ veditabbaṃ (vibha. aṭṭha. 26 kamādivinicchayakathā). Appavattaṃ bhavābhaveti ettha bhavoti vaḍḍhi, abhavoti hāni. Bhavoti sassatadiṭṭhi , abhavoti ucchedadiṭṭhi. Bhavoti khuddakabhavo, abhavoti mahābhavo. Bhavoti kāmabhavo, abhavoti rūpārūpabhavoti evamādinā nayena bhavābhavānaṃ attho veditabbo (ma. ni. aṭṭha. 2.223; saṃ. ni. aṭṭha. 3.5.1080; udā. aṭṭha. 20). Tesaṃ bhavābhavānaṃ appavattihetubhūtaṃ dhammaṃ pakāsesīti attho. Atha vā bhavati anenāti bhavo, tīsu bhavesu uppattinimittaṃ kammādikaṃ. Upapattibhavo abhavo nāma. Ubhayattha nikantiyā pahānakaraṃ appavattaṃ dhammaṃ desesīti attho. Tassa pana revatabuddhassa tayova abhisamayā ahesuṃ. Paṭhamo panassa gaṇanapathaṃ vītivatto. Tena vuttaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "3"
      },
      "."
    ],
    "innerText": "3."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tassābhisamayā tīṇi, ahesuṃ dhammadesane;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Gaṇanāya na vattabbo, paṭhamābhisamayo ahū’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tīṇī"
      },
      "ti tayo, liṅgavipallāso kato, ayaṃ paṭhamo abhisamayo ahosi."
    ],
    "innerText": "Tattha tīṇīti tayo, liṅgavipallāso kato, ayaṃ paṭhamo abhisamayo ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Athāparena samayena nagaruttare uttare nagare sabbārindamo arindamo nāma rājā ahosi. So kira bhagavantaṃ attano nagaramanuppattaṃ sutvā tīhi janakoṭīhi parivuto bhagavato paccuggamanaṃ katvā svātanāya nimantetvā buddhappamukhassa bhikkhusaṅghassa sattāhaṃ mahādānaṃ pavattetvā tigāvutavitthataṃ dīpapūjaṃ katvā bhagavantaṃ upasaṅkamitvā nisīdi. Atha bhagavā tassa manonukūlaṃ vicittanayaṃ dhammaṃ desesi. Tattha devamanussānaṃ koṭisahassassa dutiyābhisamayo ahosi. Tena vuttaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "4"
      },
      "."
    ],
    "innerText": "4."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yadā arindamaṃ rājaṃ, vinesi revato muni;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tadā koṭisahassānaṃ, dutiyābhisamayo ahū’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ayaṃ dutiyo abhisamayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Athāparena ",
      " samayena revato satthā uttaranigamaṃ nāma upanissāya viharanto sattāhaṃ nirodhasamāpattiṃ samāpajjitvā nisīdi. Tadā kira uttaranigamavāsino manussā yāgubhattakhajjakabhesajjapānakādīni āharitvā bhikkhusaṅghassa mahādānaṃ datvā bhikkhū paripucchiṃsu – ‘‘kuhiṃ, bhante, bhagavā’’ti? Tato tesaṃ bhikkhū āhaṃsu – ‘‘bhagavā, āvuso, nirodhasamāpattiṃ samāpanno’’ti. Athātīte tasmiṃ sattāhe bhagavantaṃ nirodhasamāpattito vuṭṭhitaṃ ",
      " saradasamaye sūriyo viya attano anūpamāya buddhasiriyā virocamānaṃ disvā nirodhasamāpattiyā guṇānisaṃsaṃ pucchiṃsu. Bhagavā ca tesaṃ nirodhasamāpattiyā guṇānisaṃsaṃ kathesi. Tadā devamanussānaṃ koṭisataṃ arahatte patiṭṭhāsi. Ayaṃ tatiyo abhisamayo ahosi. Tena vuttaṃ –"
    ],
    "innerText": "Athāparena samayena revato satthā uttaranigamaṃ nāma upanissāya viharanto sattāhaṃ nirodhasamāpattiṃ samāpajjitvā nisīdi. Tadā kira uttaranigamavāsino manussā yāgubhattakhajjakabhesajjapānakādīni āharitvā bhikkhusaṅghassa mahādānaṃ datvā bhikkhū paripucchiṃsu – ‘‘kuhiṃ, bhante, bhagavā’’ti? Tato tesaṃ bhikkhū āhaṃsu – ‘‘bhagavā, āvuso, nirodhasamāpattiṃ samāpanno’’ti. Athātīte tasmiṃ sattāhe bhagavantaṃ nirodhasamāpattito vuṭṭhitaṃ saradasamaye sūriyo viya attano anūpamāya buddhasiriyā virocamānaṃ disvā nirodhasamāpattiyā guṇānisaṃsaṃ pucchiṃsu. Bhagavā ca tesaṃ nirodhasamāpattiyā guṇānisaṃsaṃ kathesi. Tadā devamanussānaṃ koṭisataṃ arahatte patiṭṭhāsi. Ayaṃ tatiyo abhisamayo ahosi. Tena vuttaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "5"
      },
      "."
    ],
    "innerText": "5."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sattāhaṃ paṭisallānā, vuṭṭhahitvā narāsabho;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Koṭisataṃ naramarūnaṃ, vinesi uttame phale’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sudhaññavatīnagare paṭhamamahāpātimokkhuddese ehibhikkhupabbajjāya pabbajitānaṃ arahantānaṃ gaṇanapathaṃ vītivattānaṃ paṭhamo sannipāto ahosi. Mekhalanagare koṭisatasahassasaṅkhātānaṃ ehibhikkhupabbajjāya pabbajitānaṃ arahantānaṃ dutiyo sannipāto ahosi. Revatassa pana bhagavato dhammacakkānuvattako varuṇo nāma aggasāvako paññavantānaṃ aggo ābādhiko ahosi. Tattha gilānapucchanatthāya sampattamahājanassa lakkhaṇattayaparidīpakaṃ dhammaṃ desetvā koṭisatasahassaṃ purisānaṃ ehibhikkhupabbajjāya pabbājetvā arahatte patiṭṭhāpetvā caturaṅginike sannipāte pātimokkhaṃ uddisi. Ayaṃ tatiyo sannipāto ahosi. Tena vuttaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "6"
      },
      "."
    ],
    "innerText": "6."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sannipātā tayo āsuṃ, revatassa mahesino;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Khīṇāsavānaṃ vimalānaṃ, suvimuttāna tādinaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "7"
      },
      "."
    ],
    "innerText": "7."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Atikkantā gaṇanapathaṃ, paṭhamaṃ ye samāgatā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Koṭisatasahassānaṃ, dutiyo āsi samāgamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "8"
      },
      "."
    ],
    "innerText": "8."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yopi paññāya asamo, tassa cakkānuvattako;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "So tadā byādhito āsi, patto jīvitasaṃsayaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "9"
      },
      "."
    ],
    "innerText": "9."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " ‘‘Tassa ",
      " gilānapucchāya, ye tadā upagatā munī;"
    ],
    "innerText": "‘‘Tassa gilānapucchāya, ye tadā upagatā munī;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Koṭisatasahassā arahanto, tatiyo āsi samāgamo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cakkānuvattako"
      },
      "ti dhammacakkānuvattako. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Patto jīvitasaṃsaya"
      },
      "nti ettha jīvite saṃsayaṃ jīvitasaṃsayaṃ, jīvitakkhayaṃ ",
      " pāpuṇāti vā, na vā pāpuṇātīti evaṃ jīvitasaṃsayaṃ patto, byādhitassa ",
      " balavabhāvena marati, na maratīti jīvite saṃsayaṃ pattoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ye tadā upagatā munī"
      },
      "ti iti dīghabhāve sati bhikkhūnaṃ upari hoti, rasse anussarena saddhiṃ varuṇassa upari hoti."
    ],
    "innerText": "Tattha cakkānuvattakoti dhammacakkānuvattako. Patto jīvitasaṃsayanti ettha jīvite saṃsayaṃ jīvitasaṃsayaṃ, jīvitakkhayaṃ pāpuṇāti vā, na vā pāpuṇātīti evaṃ jīvitasaṃsayaṃ patto, byādhitassa balavabhāvena marati, na maratīti jīvite saṃsayaṃ pattoti attho. Ye tadā upagatā munīti iti dīghabhāve sati bhikkhūnaṃ upari hoti, rasse anussarena saddhiṃ varuṇassa upari hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tadā amhākaṃ bodhisatto rammavatīnagare atidevo nāma brāhmaṇo hutvā brāhmaṇadhamme pāraṃ gato revataṃ sammāsambuddhaṃ disvā tassa dhammakathaṃ sutvā saraṇesu patiṭṭhāya silokasahassena dasabalaṃ kittetvā sahassagghanikena uttarāsaṅgena bhagavantaṃ pūjesi. Sopi naṃ buddho byākāsi – ‘‘ito kappasatasahassādhikānaṃ dvinnaṃ asaṅkhyeyyānaṃ matthake gotamo nāma buddho bhavissatī’’ti. Tena vuttaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "10"
      },
      "."
    ],
    "innerText": "10."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ahaṃ tena samayena, atidevo nāma brāhmaṇo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Upagantvā revataṃ buddhaṃ, saraṇaṃ tassa gañchahaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "11"
      },
      "."
    ],
    "innerText": "11."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tassa sīlaṃ samādhiñca, paññāguṇamanuttamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Thomayitvā yathāthāmaṃ, uttarīyamadāsahaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "12"
      },
      "."
    ],
    "innerText": "12."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sopi maṃ buddho byākāsi, revato lokanāyako;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Aparimeyyito kappe, ayaṃ buddho bhavissati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "13"
      },
      "."
    ],
    "innerText": "13."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘Padhānaṃ padahitvāna…pe… hessāma sammukhā ima’’’nti. –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Aṭṭha gāthā vitthāretabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "14"
      },
      "."
    ],
    "innerText": "14."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tassāpi vacanaṃ sutvā, bhiyyo cittaṃ pasādayiṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Uttariṃ vatamadhiṭṭhāsiṃ, dasapāramipūriyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "15"
      },
      "."
    ],
    "innerText": "15."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tadāpi taṃ buddhadhammaṃ, saritvā anubrūhayiṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Āharissāmi taṃ dhammaṃ, yaṃ mayhaṃ abhipatthita’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saraṇaṃ tassa gañchaha"
      },
      "nti taṃ saraṇaṃ agañchiṃ ahaṃ, upayogatthe sāmivacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññāguṇa"
      },
      "nti ",
      " paññāsampattiṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anuttama"
      },
      "nti seṭṭhaṃ. ‘‘Paññāvimuttiguṇamuttama’’ntipi pāṭho, so uttānova. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Thomayitvā"
      },
      "ti thometvā vaṇṇayitvā. Yathāthāmanti yathābalaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uttarīya"
      },
      "nti ",
      " uttarāsaṅgaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adāsaha"
      },
      "nti adāsiṃ ahaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Buddhadhamma"
      },
      "nti buddhabhāvakaraṃ dhammaṃ, pāramīdhammanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saritvā"
      },
      "ti anussaritvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anubrūhayi"
      },
      "nti abhivaḍḍhesiṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āharissāmī"
      },
      "ti ānayissāmi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃ dhamma"
      },
      "nti taṃ buddhattaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yaṃ mayhaṃ abhipatthita"
      },
      "nti yaṃ mayā abhipatthitaṃ buddhattaṃ, taṃ āharissāmīti attho."
    ],
    "innerText": "Tattha saraṇaṃ tassa gañchahanti taṃ saraṇaṃ agañchiṃ ahaṃ, upayogatthe sāmivacanaṃ. Paññāguṇanti paññāsampattiṃ. Anuttamanti seṭṭhaṃ. ‘‘Paññāvimuttiguṇamuttama’’ntipi pāṭho, so uttānova. Thomayitvāti thometvā vaṇṇayitvā. Yathāthāmanti yathābalaṃ. Uttarīyanti uttarāsaṅgaṃ. Adāsahanti adāsiṃ ahaṃ. Buddhadhammanti buddhabhāvakaraṃ dhammaṃ, pāramīdhammanti attho. Saritvāti anussaritvā. Anubrūhayinti abhivaḍḍhesiṃ. Āharissāmīti ānayissāmi. Taṃ dhammanti taṃ buddhattaṃ. Yaṃ mayhaṃ abhipatthitanti yaṃ mayā abhipatthitaṃ buddhattaṃ, taṃ āharissāmīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tassa pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "revatassa"
      },
      " bhagavato nagaraṃ sudhaññavatī nāma ahosi, pitā vipulo nāma khattiyo, mātā vipulā nāma, varuṇo ca brahmadevo ca dve aggasāvakā, sambhavo nāma upaṭṭhāko, bhaddā ca subhaddā ca dve aggasāvikā, nāgarukkho bodhi, sarīraṃ asītihatthubbedhaṃ ahosi, āyu saṭṭhivassasahassāni, sudassanā nāma aggamahesī, varuṇo nāma putto, ājaññarathena nikkhami."
    ],
    "innerText": "Tassa pana revatassa bhagavato nagaraṃ sudhaññavatī nāma ahosi, pitā vipulo nāma khattiyo, mātā vipulā nāma, varuṇo ca brahmadevo ca dve aggasāvakā, sambhavo nāma upaṭṭhāko, bhaddā ca subhaddā ca dve aggasāvikā, nāgarukkho bodhi, sarīraṃ asītihatthubbedhaṃ ahosi, āyu saṭṭhivassasahassāni, sudassanā nāma aggamahesī, varuṇo nāma putto, ājaññarathena nikkhami."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tassa dehābhinikkhantaṃ, pabhājālamanuttaraṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Divā ceva tadā rattiṃ, niccaṃ pharati yojanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Dhātuyo mama sabbāpi, vikirantūti so jino;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Adhiṭṭhāsi mahāvīro, sabbasattānukampako."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Mahānāgavanuyyāne, mahato nagarassa so;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pūjito naramarūhi, parinibbāyi revato’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena vuttaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "16"
      },
      "."
    ],
    "innerText": "16."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Nagaraṃ sudhaññavatī nāma, vipulo nāma khattiyo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vipulā nāma janikā, revatassa mahesino."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "21"
      },
      "."
    ],
    "innerText": "21."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Varuṇo brahmadevo ca, ahesuṃ aggasāvakā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sambhavo nāmupaṭṭhāko, revatassa mahesino."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "22"
      },
      "."
    ],
    "innerText": "22."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " ‘‘Bhaddā ",
      " ceva subhaddā ca, ahesuṃ aggasāvikā;"
    ],
    "innerText": "‘‘Bhaddā ceva subhaddā ca, ahesuṃ aggasāvikā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sopi buddho asamasamo, nāgamūle abujjhatha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "23"
      },
      "."
    ],
    "innerText": "23."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " ‘‘Padumo ",
      " kuñjaro ceva, ahesuṃ aggupaṭṭhakā;"
    ],
    "innerText": "‘‘Padumo kuñjaro ceva, ahesuṃ aggupaṭṭhakā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sirimā ceva yasavatī, ahesuṃ aggupaṭṭhikā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "24"
      },
      "."
    ],
    "innerText": "24."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Uccattanena so buddho, asītihatthamuggato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Obhāseti disā sabbā, indaketuva uggato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "25"
      },
      "."
    ],
    "innerText": "25."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Tassa sarīre nibbattā, pabhāmālā anuttarā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Divā vā yadi vā rattiṃ, samantā pharati yojanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "26"
      },
      "."
    ],
    "innerText": "26."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " ‘‘Saṭṭhivassasahassāni ",
      ", āyu vijjati tāvade;"
    ],
    "innerText": "‘‘Saṭṭhivassasahassāni , āyu vijjati tāvade;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tāvatā diṭṭhamāno so, tāresi janataṃ bahuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "27"
      },
      "."
    ],
    "innerText": "27."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Dassayitvā buddhabalaṃ amataṃ loke pakāsayaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nibbāyi anupādāno, yathaggupādānasaṅkhayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "28"
      },
      "."
    ],
    "innerText": "28."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘So ca kāyo ratananibho, so ca dhammo asādiso;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sabbaṃ tamantarahitaṃ, nanu rittā sabbasaṅkhārā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "obhāsetī"
      },
      "ti pakāsayati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uggato"
      },
      "ti ussito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pabhāmālā"
      },
      "ti pabhāvelā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathaggī"
      },
      "ti aggi viya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upādānasaṅkhayā"
      },
      "ti indhanakkhayā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "So ca kāyo ratananibho"
      },
      "ti so ca tassa bhagavato kāyo suvaṇṇavaṇṇo. ‘‘Tañca kāyaṃ ratananibha’’ntipi pāṭho, liṅgavipallāsena vuttaṃ. Soyeva panassattho. Sesagāthāsu sabbattha uttānamevāti."
    ],
    "innerText": "Tattha obhāsetīti pakāsayati. Uggatoti ussito. Pabhāmālāti pabhāvelā. Yathaggīti aggi viya. Upādānasaṅkhayāti indhanakkhayā. So ca kāyo ratananibhoti so ca tassa bhagavato kāyo suvaṇṇavaṇṇo. ‘‘Tañca kāyaṃ ratananibha’’ntipi pāṭho, liṅgavipallāsena vuttaṃ. Soyeva panassattho. Sesagāthāsu sabbattha uttānamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Revatabuddhavaṃsavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Niṭṭhito pañcamo buddhavaṃso."
  }
]