[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "13. Sereyyavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Sereyyakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ajjhāyako"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mantadharo"
      },
      "tiādikaṃ āyasmato sereyyakattherassa apadānaṃ. Ayampi purimajinavaresu katādhikāro tato paresu attabhāvasahassesu vivaṭṭūpanissayāni puññāni upacinanto vipassissa bhagavato kāle brāhmaṇakule nibbatto viññutaṃ patvā tiṇṇaṃ vedānaṃ pāraṃ gantvā itihāsādisakalabrāhmaṇadhammesu koṭippatto ekasmiṃ divase abbhokāse saparivāro ṭhito bhagavantaṃ disvā pasannamānaso sereyyapupphaṃ gahetvā ākāse khipanto pūjesi. Tāni pupphāni ākāse vitānaṃ hutvā sattāhaṃ ṭhatvā pacchā antaradhāyiṃsu. So taṃ acchariyaṃ disvā atīva pasannamānaso teneva pītisomanassena kālaṃ katvā tusitādīsu nibbatto tattha dibbasukhamanubhavitvā tato manussasukhamanubhavitvā imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbatto viññutaṃ pāpuṇitvā pubbavāsanābalena satthari pasanno pabbajitvā nacirasseva arahā ahosi."
    ],
    "innerText": "Ajjhāyakomantadharotiādikaṃ āyasmato sereyyakattherassa apadānaṃ. Ayampi purimajinavaresu katādhikāro tato paresu attabhāvasahassesu vivaṭṭūpanissayāni puññāni upacinanto vipassissa bhagavato kāle brāhmaṇakule nibbatto viññutaṃ patvā tiṇṇaṃ vedānaṃ pāraṃ gantvā itihāsādisakalabrāhmaṇadhammesu koṭippatto ekasmiṃ divase abbhokāse saparivāro ṭhito bhagavantaṃ disvā pasannamānaso sereyyapupphaṃ gahetvā ākāse khipanto pūjesi. Tāni pupphāni ākāse vitānaṃ hutvā sattāhaṃ ṭhatvā pacchā antaradhāyiṃsu. So taṃ acchariyaṃ disvā atīva pasannamānaso teneva pītisomanassena kālaṃ katvā tusitādīsu nibbatto tattha dibbasukhamanubhavitvā tato manussasukhamanubhavitvā imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbatto viññutaṃ pāpuṇitvā pubbavāsanābalena satthari pasanno pabbajitvā nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      ". So aparabhāge purākatakusalaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ajjhāyako mantadharo"
      },
      "tiādimāha. Taṃ heṭṭhā vuttatthameva."
    ],
    "innerText": "1. So aparabhāge purākatakusalaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ajjhāyako mantadharotiādimāha. Taṃ heṭṭhā vuttatthameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "3"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sereyyakaṃ gahetvānā"
      },
      "ti sirise bhavaṃ jātipupphaṃ sereyyaṃ, sereyyameva sereyyakaṃ, taṃ sereyyakaṃ gahetvānāti sambandho. Bhagavati pasanno jātisumanamakuḷacampakādīni pupphāni patiṭṭhapetvā pūjetuṃ kālaṃ natthitāya tattha sampattaṃ taṃ sereyyakaṃ pupphaṃ gahetvā pūjesinti attho. Sesaṃ sabbattha uttānamevāti."
    ],
    "innerText": "3.Sereyyakaṃ gahetvānāti sirise bhavaṃ jātipupphaṃ sereyyaṃ, sereyyameva sereyyakaṃ, taṃ sereyyakaṃ gahetvānāti sambandho. Bhagavati pasanno jātisumanamakuḷacampakādīni pupphāni patiṭṭhapetvā pūjetuṃ kālaṃ natthitāya tattha sampattaṃ taṃ sereyyakaṃ pupphaṃ gahetvā pūjesinti attho. Sesaṃ sabbattha uttānamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sereyyakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Pupphathūpiyattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Himavantassāvidūre"
      },
      "tiādikaṃ ",
      " āyasmato pupphathūpiyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto vipassibuddhassa bhagavato kāle ",
      " brāhmaṇakule nibbatto viññutaṃ patvā sakasippe nipphattiṃ patto tattha sāraṃ apassanto gehaṃ pahāya himavantaṃ pavisitvā attanā sahagatehi pañcasissasahassehi saddhiṃ pañcābhiññā aṭṭha ",
      " samāpattiyo nibbattetvā kukkuranāmapabbatasamīpe paṇṇasālaṃ kāretvā paṭivasati. Tadā buddhuppādabhāvaṃ sutvā sissehi saha buddhassa santikaṃ gantukāmo kenaci byādhinā pīḷito paṇṇasālaṃ pavisitvā sissasantikā buddhassānubhāvaṃ lakkhaṇañca sutvā pasannamānaso himavantato campakāsokatilakakeṭakādyaneke pupphe āharāpetvā thūpaṃ katvā buddhaṃ viya pūjetvā kālaṃ katvā brahmalokūpago ahosi. Atha te sissā tassa āḷahanaṃ katvā buddhasantikaṃ gantvā taṃ pavattiṃ ārocesuṃ. Atha bhagavā buddhacakkhunā oloketvā anāgataṃsañāṇena pākaṭīkaraṇamakāsi. So aparabhāge imasmiṃ buddhuppāde sāvatthiyaṃ kulagehe nibbatto viññutaṃ patto pubbavāsanābalena satthari pasanno pabbajitvā nacirasseva arahā ahosi."
    ],
    "innerText": "Himavantassāvidūretiādikaṃ āyasmato pupphathūpiyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto vipassibuddhassa bhagavato kāle brāhmaṇakule nibbatto viññutaṃ patvā sakasippe nipphattiṃ patto tattha sāraṃ apassanto gehaṃ pahāya himavantaṃ pavisitvā attanā sahagatehi pañcasissasahassehi saddhiṃ pañcābhiññā aṭṭha samāpattiyo nibbattetvā kukkuranāmapabbatasamīpe paṇṇasālaṃ kāretvā paṭivasati. Tadā buddhuppādabhāvaṃ sutvā sissehi saha buddhassa santikaṃ gantukāmo kenaci byādhinā pīḷito paṇṇasālaṃ pavisitvā sissasantikā buddhassānubhāvaṃ lakkhaṇañca sutvā pasannamānaso himavantato campakāsokatilakakeṭakādyaneke pupphe āharāpetvā thūpaṃ katvā buddhaṃ viya pūjetvā kālaṃ katvā brahmalokūpago ahosi. Atha te sissā tassa āḷahanaṃ katvā buddhasantikaṃ gantvā taṃ pavattiṃ ārocesuṃ. Atha bhagavā buddhacakkhunā oloketvā anāgataṃsañāṇena pākaṭīkaraṇamakāsi. So aparabhāge imasmiṃ buddhuppāde sāvatthiyaṃ kulagehe nibbatto viññutaṃ patto pubbavāsanābalena satthari pasanno pabbajitvā nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "10"
      },
      ". Atha so attano pubbakusalaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "himavantassāvidūre"
      },
      "tiādimāha. Taṃ heṭṭhā vuttatthameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kukkuro nāma pabbato"
      },
      "ti pabbatassa sikharaṃ kukkurākārena sunakhākārena saṇṭhitattā ‘‘kukkurapabbato’’ti saṅkhyaṃ gato, tassa samīpe paṇṇasālaṃ katvā pañcatāpasasahassehi saha vasamānoti attho. Nayānusārena sesaṃ sabbaṃ uttānatthamevāti."
    ],
    "innerText": "10. Atha so attano pubbakusalaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento himavantassāvidūretiādimāha. Taṃ heṭṭhā vuttatthameva. Kukkuro nāma pabbatoti pabbatassa sikharaṃ kukkurākārena sunakhākārena saṇṭhitattā ‘‘kukkurapabbato’’ti saṅkhyaṃ gato, tassa samīpe paṇṇasālaṃ katvā pañcatāpasasahassehi saha vasamānoti attho. Nayānusārena sesaṃ sabbaṃ uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pupphathūpiyattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Pāyasadāyakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suvaṇṇavaṇṇo sambuddho"
      },
      "tiādikaṃ āyasmato pāyasadāyakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto vipassissa bhagavato kāle ekasmiṃ ",
      " vibhavasampanne kulagehe nibbatto viññutaṃ patvā gharāvāsaṃ vasanto hatthiassadhanadhaññasattaratanādivibhavasampanno saddhāsampanno kammaphalaṃ saddahitvā sahassamattā suvaṇṇapātiyo kāretvā tasmiṃ khīrapāyasasahassassa pūretvā tā sabbā gāhāpetvā simbalivanaṃ agamāsi. Tasmiṃ samaye vipassī bhagavā chabbaṇṇaraṃsiyo vissajjetvā ākāse caṅkamaṃ māpetvā caṅkamati. So pana seṭṭhi taṃ acchariyaṃ disvā atīva pasanno pātiyo ṭhapetvā vanditvā ārocesi paṭiggahaṇāya. Atha bhagavā anukampaṃ upādāya paṭiggahesi, paṭiggahetvā ca pana tassa ",
      " somanussuppādanatthaṃ sahassamattehi bhikkhusaṅghehi saddhiṃ paribhuñji, tadavasesaṃ anekasahassabhikkhū paribhuñjiṃsu. So tena puññena sugatīsuyeva saṃsaranto imasmiṃ buddhuppāde ",
      " kulagehe nibbatto viññutaṃ patto saddhājāto pabbajitvā nacirasseva arahā ahosi."
    ],
    "innerText": "Suvaṇṇavaṇṇo sambuddhotiādikaṃ āyasmato pāyasadāyakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto vipassissa bhagavato kāle ekasmiṃ vibhavasampanne kulagehe nibbatto viññutaṃ patvā gharāvāsaṃ vasanto hatthiassadhanadhaññasattaratanādivibhavasampanno saddhāsampanno kammaphalaṃ saddahitvā sahassamattā suvaṇṇapātiyo kāretvā tasmiṃ khīrapāyasasahassassa pūretvā tā sabbā gāhāpetvā simbalivanaṃ agamāsi. Tasmiṃ samaye vipassī bhagavā chabbaṇṇaraṃsiyo vissajjetvā ākāse caṅkamaṃ māpetvā caṅkamati. So pana seṭṭhi taṃ acchariyaṃ disvā atīva pasanno pātiyo ṭhapetvā vanditvā ārocesi paṭiggahaṇāya. Atha bhagavā anukampaṃ upādāya paṭiggahesi, paṭiggahetvā ca pana tassa somanussuppādanatthaṃ sahassamattehi bhikkhusaṅghehi saddhiṃ paribhuñji, tadavasesaṃ anekasahassabhikkhū paribhuñjiṃsu. So tena puññena sugatīsuyeva saṃsaranto imasmiṃ buddhuppāde kulagehe nibbatto viññutaṃ patto saddhājāto pabbajitvā nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "26"
      },
      ". So aparabhāge attano kusalaṃ paccavekkhamāno taṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "suvaṇṇavaṇṇo sambuddho"
      },
      "tiādimāha. Taṃ heṭṭhā vuttameva."
    ],
    "innerText": "26. So aparabhāge attano kusalaṃ paccavekkhamāno taṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento suvaṇṇavaṇṇo sambuddhotiādimāha. Taṃ heṭṭhā vuttameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "28"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Caṅkamaṃ susamārūḷho"
      },
      "ti cadinanto padavikkhepaṃ karonto kamati gacchatīti caṅkamaṃ, caṅkamassa padavikkhepassa ādhārabhūtapathavipadeso caṅkamaṃ nāmāti attho, etaṃ caṅkamaṃsu visesena ārūḷhoti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ambare anilāyane"
      },
      "ti varīyati chādiyati anenāti varaṃ, na baranti ambaraṃ, setavatthasadisaṃ ākāsanti attho. Natthi nilīyanaṃ gopanaṃ etthāti anilaṃ, ā samantato yanti gacchanti anena iddhimantoti āyanaṃ, anilañca taṃ āyanañceti anilāyanaṃ, tasmiṃ ambare anilāyane caṅkamaṃ māpayinti attho. Sesaṃ sabbattha uttānamevāti."
    ],
    "innerText": "28.Caṅkamaṃ susamārūḷhoti cadinanto padavikkhepaṃ karonto kamati gacchatīti caṅkamaṃ, caṅkamassa padavikkhepassa ādhārabhūtapathavipadeso caṅkamaṃ nāmāti attho, etaṃ caṅkamaṃsu visesena ārūḷhoti sambandho. Ambare anilāyaneti varīyati chādiyati anenāti varaṃ, na baranti ambaraṃ, setavatthasadisaṃ ākāsanti attho. Natthi nilīyanaṃ gopanaṃ etthāti anilaṃ, ā samantato yanti gacchanti anena iddhimantoti āyanaṃ, anilañca taṃ āyanañceti anilāyanaṃ, tasmiṃ ambare anilāyane caṅkamaṃ māpayinti attho. Sesaṃ sabbattha uttānamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pāyasadāyakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Gandhodakiyattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nisajja pāsādavare"
      },
      "tiādikaṃ āyasmato gandhodakiyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave nibbānūpanissayāni puññāni upacinanto vipassībhagavato kāle seṭṭhikule nibbatto ",
      " viññutaṃ patvā mahaddhano mahābhogo dibbasukhamanubhavanto viya manussasukhamanubhavanto ekasmiṃ divase pāsādavare nisinno hoti. Tadā bhagavā suvaṇṇamahāmeru viya vīthiyā vicarati, taṃ vicaramānaṃ bhagavantaṃ disvā pasannamānaso gantvā vanditvā sugandhodakena bhagavantaṃ osiñcamāno pūjesi. So tena puññena devamanussesu saṃsaranto imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbatto viññutaṃ patto gharāvāsena anallīno satthu santike pabbajitvā kammaṭṭhānaṃ gahetvā vipassanaṃ vaḍḍhetvā nacirasseva arahā ahosi."
    ],
    "innerText": "Nisajja pāsādavaretiādikaṃ āyasmato gandhodakiyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave nibbānūpanissayāni puññāni upacinanto vipassībhagavato kāle seṭṭhikule nibbatto viññutaṃ patvā mahaddhano mahābhogo dibbasukhamanubhavanto viya manussasukhamanubhavanto ekasmiṃ divase pāsādavare nisinno hoti. Tadā bhagavā suvaṇṇamahāmeru viya vīthiyā vicarati, taṃ vicaramānaṃ bhagavantaṃ disvā pasannamānaso gantvā vanditvā sugandhodakena bhagavantaṃ osiñcamāno pūjesi. So tena puññena devamanussesu saṃsaranto imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbatto viññutaṃ patto gharāvāsena anallīno satthu santike pabbajitvā kammaṭṭhānaṃ gahetvā vipassanaṃ vaḍḍhetvā nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "35"
      },
      ". So aparabhāge attano pubbakusalaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nisajja pāsādavare"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pāsādo"
      },
      "ti pasādaṃ somanassaṃ janeti uppādetīti pāsādo ",
      ", mālākammacittakammasuvaṇṇakammādyanekavicittaṃ disvā tattha paviṭṭhānaṃ janānaṃ pasādaṃ janayatīti attho. Pāsādo ",
      " ca so patthetabbaṭṭhena varo cāti pāsādavaro, tasmiṃ pāsādavare nisajja nisīditvā vipassiṃ jinavaraṃ addasanti sambandho. Sesaṃ sabbattha uttānamevāti."
    ],
    "innerText": "35. So aparabhāge attano pubbakusalaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento nisajja pāsādavaretiādimāha. Tattha pāsādoti pasādaṃ somanassaṃ janeti uppādetīti pāsādo , mālākammacittakammasuvaṇṇakammādyanekavicittaṃ disvā tattha paviṭṭhānaṃ janānaṃ pasādaṃ janayatīti attho. Pāsādo ca so patthetabbaṭṭhena varo cāti pāsādavaro, tasmiṃ pāsādavare nisajja nisīditvā vipassiṃ jinavaraṃ addasanti sambandho. Sesaṃ sabbattha uttānamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Gandhodakiyattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Sammukhāthavikattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jāyamāne vipassimhī"
      },
      "tiādikaṃ āyasmato sammukhāthavikattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto vipassissa bhagavato kāle brāhmaṇakule nibbatto sattavassikakāleyeva sakasippe nipphattiṃ patto gharāvāsaṃ saṇṭhapetvā vasanto vipassimhi bodhisatte uppanne sabbabuddhānaṃ lakkhaṇāni vedattaye dissamānāni tāni rājappamukhassa janakāyassa vipassībodhisattassa lakkhaṇañca buddhabhāvañca byākaritvā janānaṃ mānasaṃ nibbāpesi, anekāni ca thutivacanāni nivedesi. So tena kusalakammena cha kāmāvacarasampattiyo anubhavitvā manussesu ca cakkavattisampattiyo anubhavitvā imasmiṃ buddhuppāde kulagehe nibbatto viññutaṃ patto saddhājāto pabbajitvā nacirasseva arahā ahosi. Katakusalanāmena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammukhāthavikatthero"
      },
      "ti pākaṭo."
    ],
    "innerText": "Jāyamāne vipassimhītiādikaṃ āyasmato sammukhāthavikattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto vipassissa bhagavato kāle brāhmaṇakule nibbatto sattavassikakāleyeva sakasippe nipphattiṃ patto gharāvāsaṃ saṇṭhapetvā vasanto vipassimhi bodhisatte uppanne sabbabuddhānaṃ lakkhaṇāni vedattaye dissamānāni tāni rājappamukhassa janakāyassa vipassībodhisattassa lakkhaṇañca buddhabhāvañca byākaritvā janānaṃ mānasaṃ nibbāpesi, anekāni ca thutivacanāni nivedesi. So tena kusalakammena cha kāmāvacarasampattiyo anubhavitvā manussesu ca cakkavattisampattiyo anubhavitvā imasmiṃ buddhuppāde kulagehe nibbatto viññutaṃ patto saddhājāto pabbajitvā nacirasseva arahā ahosi. Katakusalanāmena sammukhāthavikattheroti pākaṭo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "41"
      },
      ". So ",
      " attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jāyamāne vipassimhī"
      },
      "tiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vipassimhi"
      },
      " sammāsambuddhe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jāyamāne"
      },
      " uppajjamāne mātukucchito nikkhante ahaṃ pātubhūtaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nimittaṃ"
      },
      " kāraṇaṃ buddhabhāvassa hetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "byākariṃ"
      },
      " kathesiṃ, anekāni acchariyāni pākaṭāni akāsinti attho. Sesaṃ vuttanayānusārena suviññeyyamevāti."
    ],
    "innerText": "41. So attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento jāyamāne vipassimhītiādimāha. Vipassimhi sammāsambuddhe jāyamāne uppajjamāne mātukucchito nikkhante ahaṃ pātubhūtaṃ nimittaṃ kāraṇaṃ buddhabhāvassa hetuṃ byākariṃ kathesiṃ, anekāni acchariyāni pākaṭāni akāsinti attho. Sesaṃ vuttanayānusārena suviññeyyamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sammukhāthavikattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Kusumāsaniyattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nagare dhaññavatiyā"
      },
      "tiādikaṃ āyasmato kusumāsaniyattherassa apadānaṃ. Ayampi purimajinavaresu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto vipassissa ",
      " bhagavato kāle brāhmaṇakule nibbatto viññutaṃ patto mahaddhano mahābhogo tiṇṇaṃ vedānaṃ pāraṃ gato brāhmaṇasippesu koṭippatto sakaparasamayakusalo mātāpitaro pūjetukāmo pañca uppalakalāpe attano samīpe ṭhapetvā nisinno bhikkhusaṅghaparivutaṃ vipassiṃ bhagavantaṃ āgacchantaṃ disvā nīlapītādighanabuddharasmiyo ",
      " ca disvā pasannamānaso āsanaṃ paññāpetvā tattha tāni pupphāni santharitvā bhagavantaṃ tattha nisīdāpetvā sakaghare mātu atthāya paṭiyattāni sabbāni khādanīyabhojanīyāni gahetvā saparivāraṃ bhagavantaṃ sahatthena santappento bhojesi. Bhojanāvasāne ekaṃ uppalahatthaṃ adāsi. Tena somanassajāto patthanaṃ akāsi. Bhagavāpi anumodanaṃ katvā pakāmi. So tena puññena devamanussesu dve sampattiyo anubhavitvā imasmiṃ buddhuppāde sāvatthiyaṃ vibhavasampanne ekasmiṃ kule nibbatto viññutaṃ patto bhogayasehi vaḍḍhito kāmesu ādīnavaṃ disvā gharāvāsaṃ pahāya pabbajito nacirasseva arahā ahosi."
    ],
    "innerText": "Nagare dhaññavatiyātiādikaṃ āyasmato kusumāsaniyattherassa apadānaṃ. Ayampi purimajinavaresu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto vipassissa bhagavato kāle brāhmaṇakule nibbatto viññutaṃ patto mahaddhano mahābhogo tiṇṇaṃ vedānaṃ pāraṃ gato brāhmaṇasippesu koṭippatto sakaparasamayakusalo mātāpitaro pūjetukāmo pañca uppalakalāpe attano samīpe ṭhapetvā nisinno bhikkhusaṅghaparivutaṃ vipassiṃ bhagavantaṃ āgacchantaṃ disvā nīlapītādighanabuddharasmiyo ca disvā pasannamānaso āsanaṃ paññāpetvā tattha tāni pupphāni santharitvā bhagavantaṃ tattha nisīdāpetvā sakaghare mātu atthāya paṭiyattāni sabbāni khādanīyabhojanīyāni gahetvā saparivāraṃ bhagavantaṃ sahatthena santappento bhojesi. Bhojanāvasāne ekaṃ uppalahatthaṃ adāsi. Tena somanassajāto patthanaṃ akāsi. Bhagavāpi anumodanaṃ katvā pakāmi. So tena puññena devamanussesu dve sampattiyo anubhavitvā imasmiṃ buddhuppāde sāvatthiyaṃ vibhavasampanne ekasmiṃ kule nibbatto viññutaṃ patto bhogayasehi vaḍḍhito kāmesu ādīnavaṃ disvā gharāvāsaṃ pahāya pabbajito nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "65"
      },
      ". So aparabhāge pubbe katakusalaṃ pubbenivāsañāṇena saritvā somanassappatto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nagare dhaññavatiyā"
      },
      "tiādimāha. Dhaññānaṃ puññavantānaṃ khattiyabrāhmaṇagahapatimahāsālānaṃ anekesaṃ kulānaṃ ākarattā dhaññavatī, atha vā muttāmaṇiādisattaratanānaṃ ",
      " sattavidhadhaññānaṃ upabhogaparibhogānaṃ ākarattā dhaññavatī, atha vā dhaññānaṃ buddhapaccekabuddhakhīṇāsavānaṃ vasanaṭṭhānaṃ ārāmavihārādīnaṃ ākarattā dhaññavatī, tassā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhaññavatiyā"
      },
      ". Nagaranti patthenti ettha upabhogaparibhogatthikā janāti nagaraṃ, na gacchatīti vā nagaṃ, rājayuvarājamahāmattādīnaṃ vasanaṭṭhānaṃ. Nagaṃ rāti ādadāti gaṇhātīti nagaraṃ, rājādīnaṃ vasanaṭṭhānasamūhabhūtaṃ pākāraparikhādīhi parikkhittaṃ paricchinnaṭṭhānaṃ nagaraṃ nāmāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nagare"
      },
      " yadā ahaṃ vipassissa bhagavato santike byākaraṇaṃ alabhiṃ, tadā tasmiṃ dhaññavatiyā nagare brāhmaṇo ahosinti sambandho. Sesaṃ sabbattha uttānamevāti."
    ],
    "innerText": "65. So aparabhāge pubbe katakusalaṃ pubbenivāsañāṇena saritvā somanassappatto pubbacaritāpadānaṃ pakāsento nagare dhaññavatiyātiādimāha. Dhaññānaṃ puññavantānaṃ khattiyabrāhmaṇagahapatimahāsālānaṃ anekesaṃ kulānaṃ ākarattā dhaññavatī, atha vā muttāmaṇiādisattaratanānaṃ sattavidhadhaññānaṃ upabhogaparibhogānaṃ ākarattā dhaññavatī, atha vā dhaññānaṃ buddhapaccekabuddhakhīṇāsavānaṃ vasanaṭṭhānaṃ ārāmavihārādīnaṃ ākarattā dhaññavatī, tassā dhaññavatiyā. Nagaranti patthenti ettha upabhogaparibhogatthikā janāti nagaraṃ, na gacchatīti vā nagaṃ, rājayuvarājamahāmattādīnaṃ vasanaṭṭhānaṃ. Nagaṃ rāti ādadāti gaṇhātīti nagaraṃ, rājādīnaṃ vasanaṭṭhānasamūhabhūtaṃ pākāraparikhādīhi parikkhittaṃ paricchinnaṭṭhānaṃ nagaraṃ nāmāti attho. Nagare yadā ahaṃ vipassissa bhagavato santike byākaraṇaṃ alabhiṃ, tadā tasmiṃ dhaññavatiyā nagare brāhmaṇo ahosinti sambandho. Sesaṃ sabbattha uttānamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Kusumāsaniyattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Phaladāyakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ajjhāyako mantadharo"
      },
      "tiādikaṃ āyasmato phaladāyakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro anekesu bhavesu vivaṭṭūpanissayāni puññāni upacinanto padumuttarassa bhagavato kāle brāhmaṇakule nibbatto viññutaṃ patvā vedattayādisakasippesu pārappatto anekesaṃ brāhmaṇasahassāniṃ ",
      " pāmokkho ācariyo sakasippānaṃ pariyosānaṃ adisvā tattha ca sāraṃ apassanto ",
      " gharāvāsaṃ pahāya isipabbajjaṃ pabbajitvā himavantassa avidūre assamaṃ kāretvā saha sissehi vāsaṃ kappesi, tasmiṃ samaye padumuttaro bhagavā bhikkhāya caramāno tassānukampāya taṃ padesaṃ sampāpuṇi. Tāpaso bhagavantaṃ disvā pasannamānaso attano atthāya puṭake nikkhipitvā rukkhagge laggitāni madhurāni padumaphalāni madhunā saha adāsi. Bhagavā tassa somanassuppādanatthaṃ passantasseva paribhuñjitvā ākāse ṭhito phaladānānisaṃsaṃ kathetvā pakkāmi."
    ],
    "innerText": "Ajjhāyako mantadharotiādikaṃ āyasmato phaladāyakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro anekesu bhavesu vivaṭṭūpanissayāni puññāni upacinanto padumuttarassa bhagavato kāle brāhmaṇakule nibbatto viññutaṃ patvā vedattayādisakasippesu pārappatto anekesaṃ brāhmaṇasahassāniṃ pāmokkho ācariyo sakasippānaṃ pariyosānaṃ adisvā tattha ca sāraṃ apassanto gharāvāsaṃ pahāya isipabbajjaṃ pabbajitvā himavantassa avidūre assamaṃ kāretvā saha sissehi vāsaṃ kappesi, tasmiṃ samaye padumuttaro bhagavā bhikkhāya caramāno tassānukampāya taṃ padesaṃ sampāpuṇi. Tāpaso bhagavantaṃ disvā pasannamānaso attano atthāya puṭake nikkhipitvā rukkhagge laggitāni madhurāni padumaphalāni madhunā saha adāsi. Bhagavā tassa somanassuppādanatthaṃ passantasseva paribhuñjitvā ākāse ṭhito phaladānānisaṃsaṃ kathetvā pakkāmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "75"
      },
      ". So tena puññena devamanussesu saṃsaranto ubhayasampattiyo anubhavitvā imasmiṃ buddhuppāde vibhavasampanne ekasmiṃ kulagehe nibbatto sattavassikoyeva arahattaṃ patvā pubbe katakusalakammaṃ ",
      " saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ajjhāyako mantadharo"
      },
      "tiādimāha. Tattha ajjheti cintetīti ajjhāyi, ajjhāyiyeva ajjhāyako. Ettha hi akāro ‘‘paṭisedhe vuddhitabbhāve…pe… akāro virahappake’’ti evaṃ vuttesu dasasu atthesu tabbhāve vattati. Sissānaṃ savanadhāraṇādivasena hitaṃ ajjheti cinteti sajjhāyaṃ karotīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ajjhāyako,"
      },
      " cintakoti attho. Ācariyassa santike uggahitaṃ sabbaṃ mantaṃ manena dhāreti pavattetīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mantadharo. Tiṇṇaṃ vedāna pāragū"
      },
      "ti vedaṃ vuccati ñāṇaṃ, vedena veditabbā bujjhitabbāti vedā, iruvedayajuvedasāmavedasaṅkhātā tayo ganthā, tesaṃ vedānaṃ pāraṃ pariyosānaṃ koṭiṃ gato pattoti pāragū. Sesaṃ pākaṭamevāti"
    ],
    "innerText": "75. So tena puññena devamanussesu saṃsaranto ubhayasampattiyo anubhavitvā imasmiṃ buddhuppāde vibhavasampanne ekasmiṃ kulagehe nibbatto sattavassikoyeva arahattaṃ patvā pubbe katakusalakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ajjhāyako mantadharotiādimāha. Tattha ajjheti cintetīti ajjhāyi, ajjhāyiyeva ajjhāyako. Ettha hi akāro ‘‘paṭisedhe vuddhitabbhāve…pe… akāro virahappake’’ti evaṃ vuttesu dasasu atthesu tabbhāve vattati. Sissānaṃ savanadhāraṇādivasena hitaṃ ajjheti cinteti sajjhāyaṃ karotīti ajjhāyako, cintakoti attho. Ācariyassa santike uggahitaṃ sabbaṃ mantaṃ manena dhāreti pavattetīti mantadharo. Tiṇṇaṃ vedāna pāragūti vedaṃ vuccati ñāṇaṃ, vedena veditabbā bujjhitabbāti vedā, iruvedayajuvedasāmavedasaṅkhātā tayo ganthā, tesaṃ vedānaṃ pāraṃ pariyosānaṃ koṭiṃ gato pattoti pāragū. Sesaṃ pākaṭamevāti"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Phaladāyakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Ñāṇasaññikattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pabbate himavantamhī"
      },
      "tiādikaṃ āyasmato ñāṇasaññikattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tasmiṃ tasmiṃ uppannuppanne bhave vivaṭṭūpanissayāni puññāni upacinanto vipassissa bhagavato kāle kulagehe nibbatto vuddhippatto gharāvāsaṃ pahāya tāpasapabbajjaṃ pabbajitvā himavantassa avidūre pabbatantare paṇṇasālaṃ ",
      " kāretvā pañcābhiññāaṭṭhasamāpattiyo nibbattetvā ",
      " vasanto ekadivasaṃ parisuddhaṃ paṇḍaraṃ pulinatalaṃ disvā ‘‘īdisā parisuddhā buddhā, īdisaṃva parisuddhaṃ buddhañāṇa’’nti buddhañca tassa ñāṇañca anussari thomesi ca."
    ],
    "innerText": "Pabbate himavantamhītiādikaṃ āyasmato ñāṇasaññikattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tasmiṃ tasmiṃ uppannuppanne bhave vivaṭṭūpanissayāni puññāni upacinanto vipassissa bhagavato kāle kulagehe nibbatto vuddhippatto gharāvāsaṃ pahāya tāpasapabbajjaṃ pabbajitvā himavantassa avidūre pabbatantare paṇṇasālaṃ kāretvā pañcābhiññāaṭṭhasamāpattiyo nibbattetvā vasanto ekadivasaṃ parisuddhaṃ paṇḍaraṃ pulinatalaṃ disvā ‘‘īdisā parisuddhā buddhā, īdisaṃva parisuddhaṃ buddhañāṇa’’nti buddhañca tassa ñāṇañca anussari thomesi ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "84"
      },
      ". So tena puññena devamanussesu saṃsaranto ubhayasampattiyo anubhavitvā imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbatto viññutaṃ patvā sāsane pabbajitvā nacirasseva arahattaṃ patto pubbe katapuññaṃ anussaritvā somanassajāto pubbacaritāpadānaṃ pakāsento ‘‘pabbate himavantamhī’’tiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pulinaṃ sobhanaṃ disvā"
      },
      "ti paripuṇṇakataṃ viya pulākārena parisodhitākārena pavattaṃ ṭhitanti pulinaṃ, sobhanaṃ ",
      " vālukaṃ disvā seṭṭhaṃ buddhaṃ anussarinti attho. Sesaṃ suviññeyyamevāti."
    ],
    "innerText": "84. So tena puññena devamanussesu saṃsaranto ubhayasampattiyo anubhavitvā imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbatto viññutaṃ patvā sāsane pabbajitvā nacirasseva arahattaṃ patto pubbe katapuññaṃ anussaritvā somanassajāto pubbacaritāpadānaṃ pakāsento ‘‘pabbate himavantamhī’’tiādimāha. Pulinaṃ sobhanaṃ disvāti paripuṇṇakataṃ viya pulākārena parisodhitākārena pavattaṃ ṭhitanti pulinaṃ, sobhanaṃ vālukaṃ disvā seṭṭhaṃ buddhaṃ anussarinti attho. Sesaṃ suviññeyyamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ñāṇasaññikattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Gaṇṭhipupphiyattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suvaṇṇavaṇṇo sambuddho"
      },
      "tiādikaṃ āyasmato gaṇṭhipupphiyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro anekāsu jātīsu katapuññasañcayo vipassissa bhagavato kāle ekasmiṃ kulagehe nibbatto upabhogaparibhogehi anūno ekadivasaṃ vipassiṃ bhagavantaṃ sagaṇaṃ disvā pasannamānaso lājāpañcamehi pupphehi pūjesi. So teneva cittappasādena yāvatāyukaṃ ṭhatvā tato devaloke nibbatto dibbasampattiṃ anubhavitvā aparabhāge manussesu manussasampattiṃ anubhavitvā imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbatto saddhājāto pabbajitvā nacirasseva arahattaṃ pāpuṇi."
    ],
    "innerText": "Suvaṇṇavaṇṇo sambuddhotiādikaṃ āyasmato gaṇṭhipupphiyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro anekāsu jātīsu katapuññasañcayo vipassissa bhagavato kāle ekasmiṃ kulagehe nibbatto upabhogaparibhogehi anūno ekadivasaṃ vipassiṃ bhagavantaṃ sagaṇaṃ disvā pasannamānaso lājāpañcamehi pupphehi pūjesi. So teneva cittappasādena yāvatāyukaṃ ṭhatvā tato devaloke nibbatto dibbasampattiṃ anubhavitvā aparabhāge manussesu manussasampattiṃ anubhavitvā imasmiṃ buddhuppāde ekasmiṃ kulagehe nibbatto saddhājāto pabbajitvā nacirasseva arahattaṃ pāpuṇi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "91"
      },
      ". So ekadivasaṃ pubbe katapuññaṃ saritvā somanassajāto ‘‘iminā kusalenāhaṃ nibbānaṃ patto’’ti pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "suvaṇṇavaṇṇo sambuddho"
      },
      "tiādimāha. Taṃ sabbaṃ heṭṭhā vuttanayattā uttānatthamevāti."
    ],
    "innerText": "91. So ekadivasaṃ pubbe katapuññaṃ saritvā somanassajāto ‘‘iminā kusalenāhaṃ nibbānaṃ patto’’ti pubbacaritāpadānaṃ pakāsento suvaṇṇavaṇṇo sambuddhotiādimāha. Taṃ sabbaṃ heṭṭhā vuttanayattā uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Gaṇṭhipupphiyattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Padumapūjakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Himavantassāvidūre"
      },
      "tiādikaṃ ",
      " āyasmato padumapūjakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto padumuttarassa bhagavato kāle brāhmaṇakule nibbatto viññutaṃ patvā sakasippe nipphattiṃ patvā tattha sāraṃ apassanto buddhuppattito puretaraṃ ",
      " uppannattā ovādānusāsanaṃ alabhitvā gharāvāsaṃ pahāya isipabbajjaṃ pabbajitvā himavantassa avidūre gotamakaṃ ",
      " nāma pabbataṃ nissāya assamaṃ kāretvā pañcābhiññā aṭṭha samāpattiyo nibbattetvā jhānasukheneva vihāsi. Tadā padumuttaro bhagavā buddho hutvā satte saṃsārato uddharanto tassānukampāya himavantaṃ agamāsi. Tāpaso bhagavantaṃ disvā pasannamānaso sakasisse samānetvā tehi padumapupphāni āharāpetvā pūjesi. So tena puññena devamanussesu saṃsaranto ubhayasampattiyo anubhavitvā imasmiṃ buddhuppāde sāvatthiyaṃ kulagehe nibbatto saddho pasanno pabbajitvā nacirasseva arahā ahosi."
    ],
    "innerText": "Himavantassāvidūretiādikaṃ āyasmato padumapūjakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto padumuttarassa bhagavato kāle brāhmaṇakule nibbatto viññutaṃ patvā sakasippe nipphattiṃ patvā tattha sāraṃ apassanto buddhuppattito puretaraṃ uppannattā ovādānusāsanaṃ alabhitvā gharāvāsaṃ pahāya isipabbajjaṃ pabbajitvā himavantassa avidūre gotamakaṃ nāma pabbataṃ nissāya assamaṃ kāretvā pañcābhiññā aṭṭha samāpattiyo nibbattetvā jhānasukheneva vihāsi. Tadā padumuttaro bhagavā buddho hutvā satte saṃsārato uddharanto tassānukampāya himavantaṃ agamāsi. Tāpaso bhagavantaṃ disvā pasannamānaso sakasisse samānetvā tehi padumapupphāni āharāpetvā pūjesi. So tena puññena devamanussesu saṃsaranto ubhayasampattiyo anubhavitvā imasmiṃ buddhuppāde sāvatthiyaṃ kulagehe nibbatto saddho pasanno pabbajitvā nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "97"
      },
      ". So attano puññakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "himavantassāvidūre"
      },
      "tiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gotamo nāma pabbato"
      },
      "ti anekesaṃ yakkhadevatānaṃ āvāsabhāvena adhiṭṭhānavasena gotamassa bhavanattā gotamoti pākaṭo ahosi. Pavattati tiṭṭhatīti pabbato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nāgarukkhehi sañchanno"
      },
      "ti ruhati tiṭṭhatīti rukkho. Atha vā pathaviṃ khananto uddhaṃ ruhatīti rukkho, nānā anekappakārā campakakappūranāgaagarucandanādayo rukkhāti nānārukkhā, tehi nānārukkhehi sañchanno parikiṇṇo gotamo pabbatoti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahābhūtagaṇālayo"
      },
      "ti bhavanti jāyanti uppajjanti vaḍḍhanti cāti bhūtā, mahantā ca te bhūtā cāti mahābhūtā, mahābhūtānaṃ gaṇo samūhoti mahābhūtagaṇo, mahābhūtagaṇassa ālayo patiṭṭhāti mahābhūtagaṇālayo."
    ],
    "innerText": "97. So attano puññakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento himavantassāvidūretiādimāha. Gotamo nāma pabbatoti anekesaṃ yakkhadevatānaṃ āvāsabhāvena adhiṭṭhānavasena gotamassa bhavanattā gotamoti pākaṭo ahosi. Pavattati tiṭṭhatīti pabbato. Nāgarukkhehi sañchannoti ruhati tiṭṭhatīti rukkho. Atha vā pathaviṃ khananto uddhaṃ ruhatīti rukkho, nānā anekappakārā campakakappūranāgaagarucandanādayo rukkhāti nānārukkhā, tehi nānārukkhehi sañchanno parikiṇṇo gotamo pabbatoti sambandho. Mahābhūtagaṇālayoti bhavanti jāyanti uppajjanti vaḍḍhanti cāti bhūtā, mahantā ca te bhūtā cāti mahābhūtā, mahābhūtānaṃ gaṇo samūhoti mahābhūtagaṇo, mahābhūtagaṇassa ālayo patiṭṭhāti mahābhūtagaṇālayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "98"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vemajjhamhi ca tassāsī"
      },
      "ti tassa gotamassa pabbatassa vemajjhe abbhantare assamo abhinimmito nipphādito katoti attho. Sesaṃ uttānamevāti."
    ],
    "innerText": "98.Vemajjhamhi ca tassāsīti tassa gotamassa pabbatassa vemajjhe abbhantare assamo abhinimmito nipphādito katoti attho. Sesaṃ uttānamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Padumapūjakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Terasamavaggavaṇṇanā samattā."
  }
]