[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "12. Mahāparivāravaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Mahāparivārakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vipassī"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nāma bhagavā"
      },
      "tiādikaṃ āyasmato mahāparivārakattherassa apadānaṃ. Ayampi purimajinavaresu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto vipassissa bhagavato uppannasamaye yakkhayoniyaṃ nibbatto anekayakkhasatasahassaparivāro ekasmiṃ khuddakadīpe dibbasukhamanubhavanto viharati. Tasmiñca dīpe cetiyābhisobhito vihāro atthi, tattha bhagavā agamāsi. Atha so yakkhasenādhipati taṃ bhagavantaṃ tattha gatabhāvaṃ disvā dibbavatthāni gahetvā gantvā bhagavantaṃ vanditvā dibbavatthehi pūjesi, saparivāro saraṇamagamāsi. So tena puññakammena tato cuto devaloke nibbattitvā tattha cha kāmāvacarasukhamanubhavitvā tato cuto manussesu aggacakkavattiādisukhamanubhavitvā aparabhāge imasmiṃ buddhuppāde kulagehe nibbatto viññutaṃ patto satthari pasīditvā pabbajito nacirasseva arahā ahosi."
    ],
    "innerText": "Vipassīnāma bhagavātiādikaṃ āyasmato mahāparivārakattherassa apadānaṃ. Ayampi purimajinavaresu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto vipassissa bhagavato uppannasamaye yakkhayoniyaṃ nibbatto anekayakkhasatasahassaparivāro ekasmiṃ khuddakadīpe dibbasukhamanubhavanto viharati. Tasmiñca dīpe cetiyābhisobhito vihāro atthi, tattha bhagavā agamāsi. Atha so yakkhasenādhipati taṃ bhagavantaṃ tattha gatabhāvaṃ disvā dibbavatthāni gahetvā gantvā bhagavantaṃ vanditvā dibbavatthehi pūjesi, saparivāro saraṇamagamāsi. So tena puññakammena tato cuto devaloke nibbattitvā tattha cha kāmāvacarasukhamanubhavitvā tato cuto manussesu aggacakkavattiādisukhamanubhavitvā aparabhāge imasmiṃ buddhuppāde kulagehe nibbatto viññutaṃ patto satthari pasīditvā pabbajito nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1-2"
      },
      ". So aparabhāge attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vipassī nāma bhagavā"
      },
      "tiādimāha. Tattha visesaṃ paramatthaṃ nibbānaṃ passatīti vipassī, vividhe satipaṭṭhānādayo sattatiṃsabodhipakkhiyadhamme passatīti vā vipassī, vividhe ",
      " anekappakāre bodhaneyyasatte visuṃ visuṃ passatīti vā vipassī, so vipassī bhagavā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dīpacetiyaṃ"
      },
      " dīpe pūjanīyaṭṭhānaṃ vihāramagamāsīti attho. Sesaṃ sabbattha uttānamevāti."
    ],
    "innerText": "1-2. So aparabhāge attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento vipassī nāma bhagavātiādimāha. Tattha visesaṃ paramatthaṃ nibbānaṃ passatīti vipassī, vividhe satipaṭṭhānādayo sattatiṃsabodhipakkhiyadhamme passatīti vā vipassī, vividhe anekappakāre bodhaneyyasatte visuṃ visuṃ passatīti vā vipassī, so vipassī bhagavā dīpacetiyaṃ dīpe pūjanīyaṭṭhānaṃ vihāramagamāsīti attho. Sesaṃ sabbattha uttānamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Mahāparivārakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Sumaṅgalattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atthadassī jinavaro"
      },
      "tiādikaṃ āyasmato sumaṅgalattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro ",
      " tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto atthadassissa bhagavato kāle ekasmiṃ taḷākasamīpe rukkhadevatā hutvā nibbatti. Tasmiṃ samaye bhagavā vihārato nikkhamitvā nahāyitukāmo tassa taḷākassa tīraṃ gantvā tattha nhatvā ekacīvaro jalamāno brahmā viya sūriyo viya suvaṇṇabimbaṃ viya aṭṭhāsi. Atha so devaputto somanassajāto pañjaliko thomanamakāsi, attano dibbagītatūriyehi ",
      " upahārañca akāsi. So tena puññakammena devamanussesu sampattiyo anubhavitvā aparabhāge imasmiṃ buddhuppāde kulagehe nibbatto viññutaṃ patto satthari pasīditvā pabbajitvā nacirasseva arahā ahosi."
    ],
    "innerText": "Atthadassī jinavarotiādikaṃ āyasmato sumaṅgalattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto atthadassissa bhagavato kāle ekasmiṃ taḷākasamīpe rukkhadevatā hutvā nibbatti. Tasmiṃ samaye bhagavā vihārato nikkhamitvā nahāyitukāmo tassa taḷākassa tīraṃ gantvā tattha nhatvā ekacīvaro jalamāno brahmā viya sūriyo viya suvaṇṇabimbaṃ viya aṭṭhāsi. Atha so devaputto somanassajāto pañjaliko thomanamakāsi, attano dibbagītatūriyehi upahārañca akāsi. So tena puññakammena devamanussesu sampattiyo anubhavitvā aparabhāge imasmiṃ buddhuppāde kulagehe nibbatto viññutaṃ patto satthari pasīditvā pabbajitvā nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "11"
      },
      ". So pacchā pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atthadassī jinavaro"
      },
      "tiādimāha. Tattha paramatthaṃ nibbānaṃ dakkhati passatīti atthadassī, atha vā sabbasattānaṃ caturāriyasaccasaṅkhātaṃ atthapayojanaṃ dassanasīloti atthadassī, kilese ajini jināti jinissatīti jino. Varitabbo patthetabbo sabbasattehīti varo, atthadassī jino ca so varo cāti atthadassī jinavaro. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lokajeṭṭho"
      },
      "ti lujjati palujjatīti loko, lokīyati passīyati buddhādīhi pārappattoti vā loko, loko ca loko ca loko cāti loko. Ekasesasamāsavasena ‘‘lokā’’ti vattabbe ‘‘loko’’ti vutto. Lokassa jeṭṭho lokajeṭṭho, so lokajeṭṭho narāsabhoti attho. Sesaṃ sabbattha uttānamevāti."
    ],
    "innerText": "11. So pacchā pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento atthadassī jinavarotiādimāha. Tattha paramatthaṃ nibbānaṃ dakkhati passatīti atthadassī, atha vā sabbasattānaṃ caturāriyasaccasaṅkhātaṃ atthapayojanaṃ dassanasīloti atthadassī, kilese ajini jināti jinissatīti jino. Varitabbo patthetabbo sabbasattehīti varo, atthadassī jino ca so varo cāti atthadassī jinavaro. Lokajeṭṭhoti lujjati palujjatīti loko, lokīyati passīyati buddhādīhi pārappattoti vā loko, loko ca loko ca loko cāti loko. Ekasesasamāsavasena ‘‘lokā’’ti vattabbe ‘‘loko’’ti vutto. Lokassa jeṭṭho lokajeṭṭho, so lokajeṭṭho narāsabhoti attho. Sesaṃ sabbattha uttānamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sumaṅgalattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Saraṇagamaniyattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ubhinnaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "devarājūnantyā"
      },
      "dikaṃ āyasmato saraṇagamaniyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro uppannuppannabhave vivaṭṭūpanissayāni puññāni upacinanto padumuttare bhagavati uppanne ayaṃ himavante devarājā hutvā nibbatti, tasmiṃ aparena yakkhadevaraññā saddhiṃ saṅgāmatthāya upaṭṭhite dve anekayakkhasahassaparivārā phalakāvudhādihatthā saṅgāmatthāya samupabyūḷhā ahesuṃ. Tadā padumuttaro bhagavā tesu sattesu kāruññaṃ uppādetvā ākāsena tattha gantvā saparivārānaṃ dvinnaṃ devarājūnaṃ dhammaṃ desesi. Tadā te sabbe phalakāvudhāni chaḍḍetvā bhagavantaṃ gāravabahumānena vanditvā saraṇamagamaṃsu. Tesaṃ ayaṃ paṭhamaṃ saraṇamagamāsi. So tena puññena ",
      " devamanussesu saṃsaranto ubhayasampattiyo anubhavitvā imasmiṃ buddhuppāde kulagehe nibbatto vuddhimanvāya satthari pasanno pabbajitvā nacirasseva arahā ahosi."
    ],
    "innerText": "Ubhinnaṃdevarājūnantyādikaṃ āyasmato saraṇagamaniyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro uppannuppannabhave vivaṭṭūpanissayāni puññāni upacinanto padumuttare bhagavati uppanne ayaṃ himavante devarājā hutvā nibbatti, tasmiṃ aparena yakkhadevaraññā saddhiṃ saṅgāmatthāya upaṭṭhite dve anekayakkhasahassaparivārā phalakāvudhādihatthā saṅgāmatthāya samupabyūḷhā ahesuṃ. Tadā padumuttaro bhagavā tesu sattesu kāruññaṃ uppādetvā ākāsena tattha gantvā saparivārānaṃ dvinnaṃ devarājūnaṃ dhammaṃ desesi. Tadā te sabbe phalakāvudhāni chaḍḍetvā bhagavantaṃ gāravabahumānena vanditvā saraṇamagamaṃsu. Tesaṃ ayaṃ paṭhamaṃ saraṇamagamāsi. So tena puññena devamanussesu saṃsaranto ubhayasampattiyo anubhavitvā imasmiṃ buddhuppāde kulagehe nibbatto vuddhimanvāya satthari pasanno pabbajitvā nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "20"
      },
      ". So aparabhāge pubbakusalaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ubhinnaṃ devarājūna"
      },
      "ntiādimāha. Tattha sucilomakharalomaāḷavakakumbhīrakuverādayo viya nāmagottena apākaṭā dve yakkharājāno aññāpadesena dassento ‘‘ubhinnaṃ devarājūna’’ntiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅgāmo samupaṭṭhito"
      },
      "ti ",
      " saṃ suṭṭhu gāmo kalahatthāya upagamananti saṅgāmo, so saṅgāmo saṃ suṭṭhu upaṭṭhito, ekaṭṭhāne upagantvā ṭhitoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ahosi samupabyūḷho"
      },
      "ti saṃ suṭṭhu upasamīpe rāsibhūtoti attho."
    ],
    "innerText": "20. So aparabhāge pubbakusalaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ubhinnaṃ devarājūnantiādimāha. Tattha sucilomakharalomaāḷavakakumbhīrakuverādayo viya nāmagottena apākaṭā dve yakkharājāno aññāpadesena dassento ‘‘ubhinnaṃ devarājūna’’ntiādimāha. Saṅgāmo samupaṭṭhitoti saṃ suṭṭhu gāmo kalahatthāya upagamananti saṅgāmo, so saṅgāmo saṃ suṭṭhu upaṭṭhito, ekaṭṭhāne upagantvā ṭhitoti attho. Ahosi samupabyūḷhoti saṃ suṭṭhu upasamīpe rāsibhūtoti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "21"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṃvejesi mahājana"
      },
      "nti tesaṃ rāsibhūtānaṃ yakkhānaṃ ākāse nisinno bhagavā catusaccadhammadesanāya saṃ suṭṭhu vejesi, ādīnavadassanena gaṇhāpesi viññāpesi bodhesīti attho. Sesaṃ sabbattha uttānamevāti."
    ],
    "innerText": "21.Saṃvejesi mahājananti tesaṃ rāsibhūtānaṃ yakkhānaṃ ākāse nisinno bhagavā catusaccadhammadesanāya saṃ suṭṭhu vejesi, ādīnavadassanena gaṇhāpesi viññāpesi bodhesīti attho. Sesaṃ sabbattha uttānamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Saraṇagamaniyattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Ekāsaniyattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Varuṇo"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nāma nāmenā"
      },
      "tiādikaṃ āyasmato ekāsaniyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto atthadassissa bhagavato kāle varuṇo nāma devarājā hutvā nibbatti. So bhagavantaṃ disvā pasannamānaso gandhamālādīhi gītavāditehi ca upaṭṭhayamāno saparivāro pūjesi. Tato aparabhāge bhagavati parinibbute tassa mahābodhirukkhaṃ buddhadassanaṃ viya sabbatūriyatāḷāvacarehi saparivāro upahāramakāsi. So tena puññena tato kālaṅkatvā nimmānaratidevaloke uppajji. Evaṃ devasampattimanubhavitvā manussesu ca manussabhūto cakkavattisampattiṃ anubhavitvā imasmiṃ buddhuppāde kulagehe nibbatto viññutaṃ patvā satthu sāsane pabbajitvā nacirasseva arahā ahosi."
    ],
    "innerText": "Varuṇonāma nāmenātiādikaṃ āyasmato ekāsaniyattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto atthadassissa bhagavato kāle varuṇo nāma devarājā hutvā nibbatti. So bhagavantaṃ disvā pasannamānaso gandhamālādīhi gītavāditehi ca upaṭṭhayamāno saparivāro pūjesi. Tato aparabhāge bhagavati parinibbute tassa mahābodhirukkhaṃ buddhadassanaṃ viya sabbatūriyatāḷāvacarehi saparivāro upahāramakāsi. So tena puññena tato kālaṅkatvā nimmānaratidevaloke uppajji. Evaṃ devasampattimanubhavitvā manussesu ca manussabhūto cakkavattisampattiṃ anubhavitvā imasmiṃ buddhuppāde kulagehe nibbatto viññutaṃ patvā satthu sāsane pabbajitvā nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "31"
      },
      ". So pacchā sakakammaṃ saritvā taṃ tathato ñatvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "varuṇo nāma nāmenā"
      },
      "tiādimāha. Tattha yadā ahaṃ sambodhanatthāya buddhaṃ bodhiñca pūjesiṃ, tadā varuṇo nāma devarājā ahosinti sambandho."
    ],
    "innerText": "31. So pacchā sakakammaṃ saritvā taṃ tathato ñatvā somanassajāto pubbacaritāpadānaṃ pakāsento varuṇo nāma nāmenātiādimāha. Tattha yadā ahaṃ sambodhanatthāya buddhaṃ bodhiñca pūjesiṃ, tadā varuṇo nāma devarājā ahosinti sambandho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "34"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dharaṇīruhapādapa"
      },
      "nti ettha rukkhalatāpabbatasattharatanādayo dhāretīti dharaṇī, tasmiṃ ruhati patiṭṭhahatīti dharaṇīruho. Pādena pivatīti pādapo, siñcitasiñcitodakaṃ pādena mūlena pivati rukkhakkhandhasākhāviṭapehi āporasaṃ patthariyatīti attho, taṃ dharaṇīruhapādapaṃ bodhirukkhanti sambandho."
    ],
    "innerText": "34.Dharaṇīruhapādapanti ettha rukkhalatāpabbatasattharatanādayo dhāretīti dharaṇī, tasmiṃ ruhati patiṭṭhahatīti dharaṇīruho. Pādena pivatīti pādapo, siñcitasiñcitodakaṃ pādena mūlena pivati rukkhakkhandhasākhāviṭapehi āporasaṃ patthariyatīti attho, taṃ dharaṇīruhapādapaṃ bodhirukkhanti sambandho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "35"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sakakammābhiraddho"
      },
      "ti attano kusalakammena abhiraddho pasanno uttame bodhimhi pasannoti sambandho. Sesaṃ sabbattha uttānamevāti."
    ],
    "innerText": "35.Sakakammābhiraddhoti attano kusalakammena abhiraddho pasanno uttame bodhimhi pasannoti sambandho. Sesaṃ sabbattha uttānamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ekāsaniyattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Suvaṇṇapupphiyattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vipassī"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nāma bhagavā"
      },
      "tiādikaṃ āyasmato suvaṇṇapupphiyattherassa ",
      " apadānaṃ. Ayampi purimajinavaresu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto vipassissa bhagavato kāle ekasmiṃ ṭhāne bhūmaṭṭhakadevaputto hutvā nibbatto tassa bhagavato dhammaṃ sutvā pasannamānaso catūhi suvaṇṇapupphehi pūjesi. Tāni pupphāni ākāse suvaṇṇavitānaṃ hutvā chādesuṃ, suvaṇṇapabhā ca buddhassa sarīrapabhā ca ekato hutvā mahāobhāso ahosi. So atirekataraṃ pasanno sakabhavanaṃ gatopi saratiyeva. So tena puññakammena tusitabhavanādisugatīsuyeva saṃsaranto dibbasampattiṃ anubhavitvā imasmiṃ buddhuppāde kulagehe nibbatto viññutaṃ patto satthu dhammadesanaṃ sutvā sāsane uraṃ datvā pabbajito nacirasseva arahā ahosi."
    ],
    "innerText": "Vipassīnāma bhagavātiādikaṃ āyasmato suvaṇṇapupphiyattherassa apadānaṃ. Ayampi purimajinavaresu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto vipassissa bhagavato kāle ekasmiṃ ṭhāne bhūmaṭṭhakadevaputto hutvā nibbatto tassa bhagavato dhammaṃ sutvā pasannamānaso catūhi suvaṇṇapupphehi pūjesi. Tāni pupphāni ākāse suvaṇṇavitānaṃ hutvā chādesuṃ, suvaṇṇapabhā ca buddhassa sarīrapabhā ca ekato hutvā mahāobhāso ahosi. So atirekataraṃ pasanno sakabhavanaṃ gatopi saratiyeva. So tena puññakammena tusitabhavanādisugatīsuyeva saṃsaranto dibbasampattiṃ anubhavitvā imasmiṃ buddhuppāde kulagehe nibbatto viññutaṃ patto satthu dhammadesanaṃ sutvā sāsane uraṃ datvā pabbajito nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "40"
      },
      ". So aparabhāge pubbakammaṃ saritvā somanassajāto attano pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vipassī nāma bhagavā"
      },
      "tiādimāha. Taṃ heṭṭhā vuttatthameva."
    ],
    "innerText": "40. So aparabhāge pubbakammaṃ saritvā somanassajāto attano pubbacaritāpadānaṃ pakāsento vipassī nāma bhagavātiādimāha. Taṃ heṭṭhā vuttatthameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "44"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāmojjaṃ janayitvānā"
      },
      "ti balavapītiṃ uppādetvā ‘‘pāmojjaṃ āmodanā pamodanā hāso ",
      " pahāso vitti odagyaṃ attamanatā cittassā’’tiādīsu (dha. sa. 9, 86; mahāni. 1) viya attamanatā sakabhāvaṃ uppādetvāti attho. Sesaṃ sabbattha uttānamevāti."
    ],
    "innerText": "44.Pāmojjaṃ janayitvānāti balavapītiṃ uppādetvā ‘‘pāmojjaṃ āmodanā pamodanā hāso pahāso vitti odagyaṃ attamanatā cittassā’’tiādīsu (dha. sa. 9, 86; mahāni. 1) viya attamanatā sakabhāvaṃ uppādetvāti attho. Sesaṃ sabbattha uttānamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Suvaṇṇapupphiyattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Citakapūjakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vasāmi rājāyatane"
      },
      "tiādikaṃ āyasmato citakapūjakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tato paraṃ uppannuppannabhave vivaṭṭūpanissayāni puññāni upacinanto sikhissa bhagavato kāle rājāyatanarukkhadevatā hutvā nibbatto antarantarā devatāhi saddhiṃ dhammaṃ ",
      " sutvā pasanno bhagavati parinibbute saparivāro gandhadīpadhūpapupphabheriādīni gāhāpetvā bhagavato āḷahanaṭṭhānaṃ gantvā dīpādīni pūjetvā anekehi tūriyehi anekehi vāditehi taṃ pūjesi. Tato paṭṭhāya sakabhavanaṃ upaviṭṭhopi bhagavantameva saritvā sammukhā viya vandati. So teneva puññena tena cittappasādena rājāyatanato kālaṃ kato tusitādīsu nibbatto dibbasampattiṃ anubhavitvā tato manussesu manussasampattiṃ anubhavitvā imasmiṃ buddhuppāde kulagehe nibbatto viññutaṃ patto bhagavati uppannacittappasādo bhagavato sāsane pabbajitvā nacirasseva arahā ahosi."
    ],
    "innerText": "Vasāmi rājāyatanetiādikaṃ āyasmato citakapūjakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tato paraṃ uppannuppannabhave vivaṭṭūpanissayāni puññāni upacinanto sikhissa bhagavato kāle rājāyatanarukkhadevatā hutvā nibbatto antarantarā devatāhi saddhiṃ dhammaṃ sutvā pasanno bhagavati parinibbute saparivāro gandhadīpadhūpapupphabheriādīni gāhāpetvā bhagavato āḷahanaṭṭhānaṃ gantvā dīpādīni pūjetvā anekehi tūriyehi anekehi vāditehi taṃ pūjesi. Tato paṭṭhāya sakabhavanaṃ upaviṭṭhopi bhagavantameva saritvā sammukhā viya vandati. So teneva puññena tena cittappasādena rājāyatanato kālaṃ kato tusitādīsu nibbatto dibbasampattiṃ anubhavitvā tato manussesu manussasampattiṃ anubhavitvā imasmiṃ buddhuppāde kulagehe nibbatto viññutaṃ patto bhagavati uppannacittappasādo bhagavato sāsane pabbajitvā nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "49"
      },
      ". So aparabhāge attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vasāmi rājāyatane"
      },
      "tiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rājāyatane"
      },
      "ti ",
      " devarājūnaṃ āyatanaṃ rājāyatanaṃ, tassa rukkhassa nāmadheyyo vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parinibbute bhagavatī"
      },
      "ti parisamantato kiñci anavasesetvā khandhaparinibbānakāle parinibbānasamaye parinibbānappattassa sikhino lokabandhunoti sambandho."
    ],
    "innerText": "49. So aparabhāge attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento vasāmi rājāyatanetiādimāha. Rājāyataneti devarājūnaṃ āyatanaṃ rājāyatanaṃ, tassa rukkhassa nāmadheyyo vā. Parinibbute bhagavatīti parisamantato kiñci anavasesetvā khandhaparinibbānakāle parinibbānasamaye parinibbānappattassa sikhino lokabandhunoti sambandho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "50"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Citakaṃ agamāsaha"
      },
      "nti candanāgarudevadārukappūratakkolādisugandhadārūhi citaṃ rāsigatanti citaṃ, citameva citakaṃ, buddhagāravena citakaṃ pūjanatthāya citakassa samīpaṃ ahaṃ agamāsinti attho. Tattha gantvā katakiccaṃ dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tūriyaṃ tattha vādetvā"
      },
      "tiādimāha. Taṃ sabbaṃ suviññeyyamevāti."
    ],
    "innerText": "50.Citakaṃ agamāsahanti candanāgarudevadārukappūratakkolādisugandhadārūhi citaṃ rāsigatanti citaṃ, citameva citakaṃ, buddhagāravena citakaṃ pūjanatthāya citakassa samīpaṃ ahaṃ agamāsinti attho. Tattha gantvā katakiccaṃ dassento tūriyaṃ tattha vādetvātiādimāha. Taṃ sabbaṃ suviññeyyamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Citakapūjakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Buddhasaññakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yadā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vipassī lokaggo"
      },
      "tiādikaṃ āyasmato buddhasaññakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto vipassissa bhagavato kāle ekasmiṃ bhūmaṭṭhakavimāne devaputto hutvā nibbatti. Tadā vipassī bhagavā āyusaṅkhāraṃ vossajji. Atha sakaladasasahassilokadhātu sasāgarapabbatā pakampittha. Tadā tassa devaputtassa bhavanampi kampittha. Tasmiṃ khaṇe so devaputto ",
      " saṃsayajāto – ‘‘kiṃ nu kho pathavīkampāya nibbattī’’ti cintetvā buddhassa āyusaṅkhāravossajjabhāvaṃ ñatvā mahāsokaṃ domanassaṃ uppādesi. Tadā vessavaṇo mahārājā āgantvā ‘‘mā cintayitthā’’ti assāsesi. So devaputto tato cuto tena puññena devamanussesu saṃsaranto imasmiṃ buddhuppāde kulagehe nibbatto viññutaṃ patto gharāvāsaṃ pahāya pabbajitvā nacirasseva arahā ahosi."
    ],
    "innerText": "Yadāvipassī lokaggotiādikaṃ āyasmato buddhasaññakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto vipassissa bhagavato kāle ekasmiṃ bhūmaṭṭhakavimāne devaputto hutvā nibbatti. Tadā vipassī bhagavā āyusaṅkhāraṃ vossajji. Atha sakaladasasahassilokadhātu sasāgarapabbatā pakampittha. Tadā tassa devaputtassa bhavanampi kampittha. Tasmiṃ khaṇe so devaputto saṃsayajāto – ‘‘kiṃ nu kho pathavīkampāya nibbattī’’ti cintetvā buddhassa āyusaṅkhāravossajjabhāvaṃ ñatvā mahāsokaṃ domanassaṃ uppādesi. Tadā vessavaṇo mahārājā āgantvā ‘‘mā cintayitthā’’ti assāsesi. So devaputto tato cuto tena puññena devamanussesu saṃsaranto imasmiṃ buddhuppāde kulagehe nibbatto viññutaṃ patto gharāvāsaṃ pahāya pabbajitvā nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "57"
      },
      ". So aparabhāge attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yadā vipassī lokaggo"
      },
      "tiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āyusaṅkhāramossajjī"
      },
      "ti ā samantato yunoti pāleti satteti āyu, āyussa saṅkhāro rāsibhāvo āyusaṅkhāro, taṃ āyusaṅkhāraṃ ossajji pariccaji jahāsīti attho. Tasmiṃ āyusaṅkhāravossajjane. Jalamekhalāsāgarodakamekhalāsahitā sakaladasasahassacakkavāḷapathavī kampitthāti sambandho."
    ],
    "innerText": "57. So aparabhāge attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento yadā vipassī lokaggotiādimāha. Āyusaṅkhāramossajjīti ā samantato yunoti pāleti satteti āyu, āyussa saṅkhāro rāsibhāvo āyusaṅkhāro, taṃ āyusaṅkhāraṃ ossajji pariccaji jahāsīti attho. Tasmiṃ āyusaṅkhāravossajjane. Jalamekhalāsāgarodakamekhalāsahitā sakaladasasahassacakkavāḷapathavī kampitthāti sambandho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "58"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Otataṃ vitthataṃ mayha"
      },
      "nti mayhaṃ bhavanaṃ otataṃ vitthataṃ cittaṃ vicittaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "suci"
      },
      " suparisuddhaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cittaṃ"
      },
      " anekehi ",
      " sattahi ratanehi vicittaṃ sobhamānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pakampittha"
      },
      " pakārena kampitthāti attho. Sesaṃ sabbattha uttānamevāti."
    ],
    "innerText": "58.Otataṃ vitthataṃ mayhanti mayhaṃ bhavanaṃ otataṃ vitthataṃ cittaṃ vicittaṃ suci suparisuddhaṃ cittaṃ anekehi sattahi ratanehi vicittaṃ sobhamānaṃ pakampittha pakārena kampitthāti attho. Sesaṃ sabbattha uttānamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Buddhasaññakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Maggasaññakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Padumuttarabuddhassā"
      },
      "tiādikaṃ āyasmato maggasaññakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tato oraṃ tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto padumuttarassa bhagavato kāle himavante devaputto hutvā nibbatto araññaṃ gantvā maggamūḷhānaṃ maggaṃ ",
      " gavesantānaṃ tassa sāvakānaṃ bhojetvā maggaṃ ācikkhi. So tena puññena devamanussasampattimanubhavitvā uppannuppannabhave sabbattha amūḷho saññavā ahosi. Atha imasmiṃ buddhuppāde kulagehe nibbatto viññutaṃ patto gharāvāse anallīno pabbajitvā nacirasseva arahā ahosi."
    ],
    "innerText": "Padumuttarabuddhassātiādikaṃ āyasmato maggasaññakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tato oraṃ tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto padumuttarassa bhagavato kāle himavante devaputto hutvā nibbatto araññaṃ gantvā maggamūḷhānaṃ maggaṃ gavesantānaṃ tassa sāvakānaṃ bhojetvā maggaṃ ācikkhi. So tena puññena devamanussasampattimanubhavitvā uppannuppannabhave sabbattha amūḷho saññavā ahosi. Atha imasmiṃ buddhuppāde kulagehe nibbatto viññutaṃ patto gharāvāse anallīno pabbajitvā nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "66"
      },
      ". So ",
      " aparabhāge attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "padumuttarabuddhassā"
      },
      "tiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sāvakā vanacārino"
      },
      "ti bhagavato vuttavacanaṃ sammā ādarena suṇantīti sāvakā, atha vā bhagavato desanānusārena ñāṇaṃ pesetvā saddhammaṃ suṇantīti sāvakā. Vanacārino vane vicaraṇakā sāvakā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vippanaṭṭhā"
      },
      " maggamūḷhā mahāaraññe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "andhāva"
      },
      " cakkhuvirahitāva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anusuyyare"
      },
      " vicarantīti sambandho. Sesaṃ sabbattha uttānamevāti."
    ],
    "innerText": "66. So aparabhāge attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento padumuttarabuddhassātiādimāha. Sāvakā vanacārinoti bhagavato vuttavacanaṃ sammā ādarena suṇantīti sāvakā, atha vā bhagavato desanānusārena ñāṇaṃ pesetvā saddhammaṃ suṇantīti sāvakā. Vanacārino vane vicaraṇakā sāvakā vippanaṭṭhā maggamūḷhā mahāaraññe andhāva cakkhuvirahitāva anusuyyare vicarantīti sambandho. Sesaṃ sabbattha uttānamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Maggasaññakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Paccupaṭṭhānasaññakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atthadassimhi sugate"
      },
      "tiādikaṃ āyasmato paccupaṭṭhānasaññakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto atthadassissa bhagavato kāle yakkhayoniyaṃ nibbatto bhagavati dharamāne dassanassa aladdhattā pacchā parinibbute mahāsokappatto vihāsi. Tadā hissa bhagavato sāgato nāma aggasāvako anusāsanto bhagavato sārīrikadhātupūjā bhagavati dharamāne katapūjā viya cittappasādavasā mahapphalaṃ bhavatī’’ti vatvā ‘‘thūpaṃ karohī’’ti niyojito thūpaṃ kāresi, taṃ pūjetvā tato cuto devamanussesu sakkacakkavattisampattimanubhavitvā imasmiṃ buddhuppāde sāvatthiyaṃ ekasmiṃ kulagehe nibbatto viññutaṃ ",
      " patto satthari pasīditvā pabbajitvā nacirasseva arahā ahosi."
    ],
    "innerText": "Atthadassimhi sugatetiādikaṃ āyasmato paccupaṭṭhānasaññakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto atthadassissa bhagavato kāle yakkhayoniyaṃ nibbatto bhagavati dharamāne dassanassa aladdhattā pacchā parinibbute mahāsokappatto vihāsi. Tadā hissa bhagavato sāgato nāma aggasāvako anusāsanto bhagavato sārīrikadhātupūjā bhagavati dharamāne katapūjā viya cittappasādavasā mahapphalaṃ bhavatī’’ti vatvā ‘‘thūpaṃ karohī’’ti niyojito thūpaṃ kāresi, taṃ pūjetvā tato cuto devamanussesu sakkacakkavattisampattimanubhavitvā imasmiṃ buddhuppāde sāvatthiyaṃ ekasmiṃ kulagehe nibbatto viññutaṃ patto satthari pasīditvā pabbajitvā nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "72"
      },
      ". So aparabhāge attano puññakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atthadassimhi sugate"
      },
      "tiādimāha. Taṃ heṭṭhā vuttameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yakkhayoniṃ upapajji"
      },
      "nti ettha pana attano sakāsaṃ sampattasampatte khādantā yanti gacchantīti yakkhā, yakkhānaṃ yoni jātīti yakkhayoni, yakkhayoniyaṃ nibbattoti attho."
    ],
    "innerText": "72. So aparabhāge attano puññakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento atthadassimhi sugatetiādimāha. Taṃ heṭṭhā vuttameva. Yakkhayoniṃ upapajjinti ettha pana attano sakāsaṃ sampattasampatte khādantā yanti gacchantīti yakkhā, yakkhānaṃ yoni jātīti yakkhayoni, yakkhayoniyaṃ nibbattoti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "73"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dulladdhaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vata me āsī"
      },
      "ti me mayā laddhayasaṃ dulladdhaṃ, buddhabhūtassa satthuno sakkāraṃ akatattā virādhetvā laddhanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Duppabhāta"
      },
      "nti duṭṭhu ",
      " pabhātaṃ rattiyā pabhātakaraṇaṃ, mayhaṃ na suṭṭhuṃ pabhātanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Duruṭṭhita"
      },
      "nti duuṭṭhitaṃ, sūriyassa uggamanaṃ mayhaṃ duuggamananti attho. Sesaṃ sabbattha uttānamevāti."
    ],
    "innerText": "73.Dulladdhaṃvata me āsīti me mayā laddhayasaṃ dulladdhaṃ, buddhabhūtassa satthuno sakkāraṃ akatattā virādhetvā laddhanti attho. Duppabhātanti duṭṭhu pabhātaṃ rattiyā pabhātakaraṇaṃ, mayhaṃ na suṭṭhuṃ pabhātanti attho. Duruṭṭhitanti duuṭṭhitaṃ, sūriyassa uggamanaṃ mayhaṃ duuggamananti attho. Sesaṃ sabbattha uttānamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paccupaṭṭhānasaññakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Jātipūjakattheraapadānavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jāyaṃ tassa vipassissā"
      },
      "tiādikaṃ āyasmato jātipūjakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto vipassissa bhagavato kāle kulagehe nibbatto viññutaṃ patto nakkhattapāṭhakehi vipassibodhisattassa vuttalakkhaṇanimittaṃ sutvā ‘‘ayaṃ kira kumāro buddho hutvā sakalalokassa aggo seṭṭho sutvā sabbasatte saṃsārato uddharissatī’’ti sutvā taṃ bhagavantaṃ kumārakāleyeva buddhassa viya mahāpūjamakāsi. Pacchā kamena kumārakālaṃ rājakumārakālaṃ rajjakālanti kālattayamatikkamma buddhe jātepi mahāpūjaṃ katvā tato cuto tusitādīsu nibbatto dibbasukhamanubhavitvā pacchā manussesu cakkavattādimanussasukhamanubhavitvā imasmiṃ buddhuppāde kulagehe nibbatto sattaṭṭhavassakāleyeva bhagavati pasanno pabbajitvā vipassanaṃ vaḍḍhetvā nacirasseva arahā ahosi."
    ],
    "innerText": "Jāyaṃ tassa vipassissātiādikaṃ āyasmato jātipūjakattherassa apadānaṃ. Ayampi purimabuddhesu katādhikāro tattha tattha bhave vivaṭṭūpanissayāni puññāni upacinanto vipassissa bhagavato kāle kulagehe nibbatto viññutaṃ patto nakkhattapāṭhakehi vipassibodhisattassa vuttalakkhaṇanimittaṃ sutvā ‘‘ayaṃ kira kumāro buddho hutvā sakalalokassa aggo seṭṭho sutvā sabbasatte saṃsārato uddharissatī’’ti sutvā taṃ bhagavantaṃ kumārakāleyeva buddhassa viya mahāpūjamakāsi. Pacchā kamena kumārakālaṃ rājakumārakālaṃ rajjakālanti kālattayamatikkamma buddhe jātepi mahāpūjaṃ katvā tato cuto tusitādīsu nibbatto dibbasukhamanubhavitvā pacchā manussesu cakkavattādimanussasukhamanubhavitvā imasmiṃ buddhuppāde kulagehe nibbatto sattaṭṭhavassakāleyeva bhagavati pasanno pabbajitvā vipassanaṃ vaḍḍhetvā nacirasseva arahā ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "82"
      },
      ". So aparabhāge attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jāyaṃ tassa vipassissā"
      },
      "tiādimāha. Taṃ heṭṭhā vuttatthameva."
    ],
    "innerText": "82. So aparabhāge attano pubbakammaṃ saritvā somanassajāto pubbacaritāpadānaṃ pakāsento jāyaṃ tassa vipassissātiādimāha. Taṃ heṭṭhā vuttatthameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "84"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nemittānaṃ suṇitvānā"
      },
      "ti ettha nimittaṃ kāraṇaṃ sukhadukkhappattihetuṃ jānantīti nemittā, tesaṃ nemittānaṃ nakkhattapāṭhakānaṃ ",
      " vacanaṃ suṇitvāti attho. Sesaṃ sabbattha uttānamevāti."
    ],
    "innerText": "84.Nemittānaṃ suṇitvānāti ettha nimittaṃ kāraṇaṃ sukhadukkhappattihetuṃ jānantīti nemittā, tesaṃ nemittānaṃ nakkhattapāṭhakānaṃ vacanaṃ suṇitvāti attho. Sesaṃ sabbattha uttānamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Jātipūjakattheraapadānavaṇṇanā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dvādasamavaggavaṇṇanā samattā."
  }
]