[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "Kathinabhedo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Kathinaatthatādi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "403"
      },
      ". Kassa ",
      " kathinaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kaṭhinaṃ (sī. syā.)]"
      },
      " anatthataṃ? Kassa kathinaṃ atthataṃ? Kinti kathinaṃ anatthataṃ? Kinti kathinaṃ atthataṃ?"
    ],
    "innerText": "403. Kassa kathinaṃ [kaṭhinaṃ (sī. syā.)] anatthataṃ? Kassa kathinaṃ atthataṃ? Kinti kathinaṃ anatthataṃ? Kinti kathinaṃ atthataṃ?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kassa kathinaṃ anatthata"
      },
      "nti? Dvinnaṃ puggalānaṃ anatthataṃ hoti kathinaṃ – anatthārakassa ca ananumodakassa ca. Imesaṃ dvinnaṃ puggalānaṃ anatthataṃ hoti kathinaṃ."
    ],
    "innerText": "Kassa kathinaṃ anatthatanti? Dvinnaṃ puggalānaṃ anatthataṃ hoti kathinaṃ – anatthārakassa ca ananumodakassa ca. Imesaṃ dvinnaṃ puggalānaṃ anatthataṃ hoti kathinaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kassa kathinaṃ atthata"
      },
      "nti? Dvinnaṃ puggalānaṃ atthataṃ hoti kathinaṃ – atthārakassa ca anumodakassa ca. Imesaṃ dvinnaṃ puggalānaṃ atthataṃ hoti kathinaṃ."
    ],
    "innerText": "Kassa kathinaṃ atthatanti? Dvinnaṃ puggalānaṃ atthataṃ hoti kathinaṃ – atthārakassa ca anumodakassa ca. Imesaṃ dvinnaṃ puggalānaṃ atthataṃ hoti kathinaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kinti kathinaṃ anatthata"
      },
      "nti? Catuvīsatiyā ākārehi anatthataṃ hoti kathinaṃ, na ullikhitamattena atthataṃ hoti kathinaṃ, na dhovanamattena atthataṃ hoti kathinaṃ, na cīvaravicāraṇamattena atthataṃ hoti kathinaṃ, na chedanamattena atthataṃ hoti kathinaṃ, na bandhanamattena atthataṃ hoti kathinaṃ, na ovaṭṭiyakaraṇamattena atthataṃ hoti kathinaṃ, na kaṇḍusakaraṇamattena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[na gaṇḍusakaraṇamattena (ka.)]"
      },
      " atthataṃ hoti kathinaṃ, na daḷhīkammakaraṇamattena atthataṃ hoti kathinaṃ, na anuvātakaraṇamattena atthataṃ hoti kathinaṃ, na paribhaṇḍakaraṇamattena atthataṃ hoti kathinaṃ, na ovaddheyyakaraṇamattena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[na ovaṭṭeyyakaraṇamattena (sī. syā.), na ovadeyyakaraṇamattena (ka.)]"
      },
      " atthataṃ hoti kathinaṃ, na kambalamaddanamattena atthataṃ hoti kathinaṃ, na nimittakatena atthataṃ hoti kathinaṃ, na ",
      " parikathākatena atthataṃ hoti kathinaṃ, na kukkukatena atthataṃ hoti kathinaṃ, na sannidhikatena atthataṃ hoti kathinaṃ, na nissaggiyena atthataṃ hoti kathinaṃ, na akappakatena atthataṃ hoti kathinaṃ, na aññatra saṅghāṭiyā atthataṃ hoti kathinaṃ, na aññatra uttarāsaṅgena atthataṃ hoti kathinaṃ, na aññatra antaravāsakena atthataṃ hoti kathinaṃ ",
      ", na aññatra pañcakena vā atirekapañcakena vā tadaheva sañchinnena samaṇḍalīkatena atthataṃ hoti kathinaṃ, na aññatra puggalassa atthārā atthataṃ ",
      " hoti kathinaṃ, sammā ce atthataṃ hoti kathinaṃ taṃ ce nissīmaṭṭho anumodati. Evampi anatthataṃ hoti kathinaṃ."
    ],
    "innerText": "Kinti kathinaṃ anatthatanti? Catuvīsatiyā ākārehi anatthataṃ hoti kathinaṃ, na ullikhitamattena atthataṃ hoti kathinaṃ, na dhovanamattena atthataṃ hoti kathinaṃ, na cīvaravicāraṇamattena atthataṃ hoti kathinaṃ, na chedanamattena atthataṃ hoti kathinaṃ, na bandhanamattena atthataṃ hoti kathinaṃ, na ovaṭṭiyakaraṇamattena atthataṃ hoti kathinaṃ, na kaṇḍusakaraṇamattena [na gaṇḍusakaraṇamattena (ka.)] atthataṃ hoti kathinaṃ, na daḷhīkammakaraṇamattena atthataṃ hoti kathinaṃ, na anuvātakaraṇamattena atthataṃ hoti kathinaṃ, na paribhaṇḍakaraṇamattena atthataṃ hoti kathinaṃ, na ovaddheyyakaraṇamattena [na ovaṭṭeyyakaraṇamattena (sī. syā.), na ovadeyyakaraṇamattena (ka.)] atthataṃ hoti kathinaṃ, na kambalamaddanamattena atthataṃ hoti kathinaṃ, na nimittakatena atthataṃ hoti kathinaṃ, na parikathākatena atthataṃ hoti kathinaṃ, na kukkukatena atthataṃ hoti kathinaṃ, na sannidhikatena atthataṃ hoti kathinaṃ, na nissaggiyena atthataṃ hoti kathinaṃ, na akappakatena atthataṃ hoti kathinaṃ, na aññatra saṅghāṭiyā atthataṃ hoti kathinaṃ, na aññatra uttarāsaṅgena atthataṃ hoti kathinaṃ, na aññatra antaravāsakena atthataṃ hoti kathinaṃ , na aññatra pañcakena vā atirekapañcakena vā tadaheva sañchinnena samaṇḍalīkatena atthataṃ hoti kathinaṃ, na aññatra puggalassa atthārā atthataṃ hoti kathinaṃ, sammā ce atthataṃ hoti kathinaṃ taṃ ce nissīmaṭṭho anumodati. Evampi anatthataṃ hoti kathinaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nimittakammaṃ nāma nimittaṃ karoti – ‘‘iminā dussena kathinaṃ attharissāmī’’ti. Parikathā nāma parikathaṃ karoti – ‘‘imāya parikathāya kathinadussaṃ nibbattessāmī’’ti. Kukkukataṃ nāma anādiyadānaṃ vuccati. Sannidhi nāma dve sannidhiyo – karaṇasannidhi vā nicayasannidhi vā. Nissaggiyaṃ nāma kayiramāne aruṇaṃ uṭṭhahati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[udriyati (sī. syā.)]"
      },
      ". Imehi catuvīsatiyā ākārehi anatthataṃ hoti kathinaṃ."
    ],
    "innerText": "Nimittakammaṃ nāma nimittaṃ karoti – ‘‘iminā dussena kathinaṃ attharissāmī’’ti. Parikathā nāma parikathaṃ karoti – ‘‘imāya parikathāya kathinadussaṃ nibbattessāmī’’ti. Kukkukataṃ nāma anādiyadānaṃ vuccati. Sannidhi nāma dve sannidhiyo – karaṇasannidhi vā nicayasannidhi vā. Nissaggiyaṃ nāma kayiramāne aruṇaṃ uṭṭhahati [udriyati (sī. syā.)]. Imehi catuvīsatiyā ākārehi anatthataṃ hoti kathinaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kinti kathinaṃ atthata"
      },
      "nti? Sattarasahi ākārehi atthataṃ hoti kathinaṃ. Ahatena atthataṃ hoti kathinaṃ, ahatakappena atthataṃ hoti kathinaṃ, pilotikāya atthataṃ hoti kathinaṃ, paṃsukūlena atthataṃ hoti kathinaṃ, pāpaṇikena atthataṃ hoti kathinaṃ, animittakatena atthataṃ ",
      " hoti kathinaṃ, aparikathākatena atthataṃ hoti kathinaṃ, akukkukatena atthataṃ hoti kathinaṃ, asannidhikatena atthataṃ hoti kathinaṃ, anissaggiyena atthataṃ hoti kathinaṃ, kappakatena atthataṃ hoti kathinaṃ, saṅghāṭiyā atthataṃ hoti kathinaṃ, uttarāsaṅgena atthataṃ hoti kathinaṃ, antaravāsakena atthataṃ hoti kathinaṃ, pañcakena vā atirekapañcakena vā tadaheva sañchinnena samaṇḍalīkatena atthataṃ hoti kathinaṃ, puggalassa atthārā atthataṃ hoti kathinaṃ, sammā ce atthataṃ hoti kathinaṃ, taṃ ce sīmaṭṭho anumodati, evampi atthataṃ hoti kathinaṃ. Imehi sattarasahi ākārehi atthataṃ hoti kathinaṃ."
    ],
    "innerText": "Kinti kathinaṃ atthatanti? Sattarasahi ākārehi atthataṃ hoti kathinaṃ. Ahatena atthataṃ hoti kathinaṃ, ahatakappena atthataṃ hoti kathinaṃ, pilotikāya atthataṃ hoti kathinaṃ, paṃsukūlena atthataṃ hoti kathinaṃ, pāpaṇikena atthataṃ hoti kathinaṃ, animittakatena atthataṃ hoti kathinaṃ, aparikathākatena atthataṃ hoti kathinaṃ, akukkukatena atthataṃ hoti kathinaṃ, asannidhikatena atthataṃ hoti kathinaṃ, anissaggiyena atthataṃ hoti kathinaṃ, kappakatena atthataṃ hoti kathinaṃ, saṅghāṭiyā atthataṃ hoti kathinaṃ, uttarāsaṅgena atthataṃ hoti kathinaṃ, antaravāsakena atthataṃ hoti kathinaṃ, pañcakena vā atirekapañcakena vā tadaheva sañchinnena samaṇḍalīkatena atthataṃ hoti kathinaṃ, puggalassa atthārā atthataṃ hoti kathinaṃ, sammā ce atthataṃ hoti kathinaṃ, taṃ ce sīmaṭṭho anumodati, evampi atthataṃ hoti kathinaṃ. Imehi sattarasahi ākārehi atthataṃ hoti kathinaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Saha kathinassa atthārā kati dhammā jāyanti? Saha kathinassa atthārā pannarasa dhammā jāyanti – aṭṭha mātikā, dve palibodhā, pañcānisaṃsā. Saha kathinassa atthārā ime pannarasa dhammā jāyanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Kathinaanantarapaccayādi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "404"
      },
      ". Payogassa ",
      " katame dhammā anantarapaccayena paccayo, samanantarapaccayena paccayo, nissayapaccayena paccayo, upanissayapaccayena paccayo ",
      ", purejātapaccayena paccayo, pacchājātapaccayena paccayo, sahajātapaccayena paccayo? Pubbakaraṇassa katame dhammā anantarapaccayena ",
      " paccayo…pe… paccuddhārassa katame dhammā… adhiṭṭhānassa katame dhammā… atthārassa katame dhammā… mātikānañca palibodhānañca katame dhammā… vatthussa katame dhammā anantarapaccayena paccayo, samanantarapaccayena paccayo, nissayapaccayena paccayo, upanissayapaccayena ",
      " paccayo, purejātapaccayena paccayo, pacchājātapaccayena paccayo, sahajātapaccayena paccayo?"
    ],
    "innerText": "404. Payogassa katame dhammā anantarapaccayena paccayo, samanantarapaccayena paccayo, nissayapaccayena paccayo, upanissayapaccayena paccayo , purejātapaccayena paccayo, pacchājātapaccayena paccayo, sahajātapaccayena paccayo? Pubbakaraṇassa katame dhammā anantarapaccayena paccayo…pe… paccuddhārassa katame dhammā… adhiṭṭhānassa katame dhammā… atthārassa katame dhammā… mātikānañca palibodhānañca katame dhammā… vatthussa katame dhammā anantarapaccayena paccayo, samanantarapaccayena paccayo, nissayapaccayena paccayo, upanissayapaccayena paccayo, purejātapaccayena paccayo, pacchājātapaccayena paccayo, sahajātapaccayena paccayo?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pubbakaraṇaṃ payogassa anantarapaccayena paccayo, samanantarapaccayena paccayo, nissayapaccayena paccayo, upanissayapaccayena paccayo. Payogo pubbakaraṇassa purejātapaccayena paccayo. Pubbakaraṇaṃ payogassa pacchājātapaccayena paccayo. Pannarasa dhammā sahajātapaccayena paccayo. Paccuddhāro pubbakaraṇassa anantarapaccayena paccayo, samanantarapaccayena paccayo, nissayapaccayena paccayo, upanissayapaccayena paccayo. Pubbakaraṇaṃ paccuddhārassa purejātapaccayena paccayo. Paccuddhāro pubbakaraṇassa pacchājātapaccayena paccayo. Pannarasa dhammā sahajātapaccayena paccayo. Adhiṭṭhānaṃ paccuddhārassa anantarapaccayena paccayo, samanantarapaccayena paccayo, nissayapaccayena paccayo, upanissayapaccayena paccayo. Paccuddhāro adhiṭṭhānassa purejātapaccayena paccayo. Adhiṭṭhānaṃ paccuddhārassa pacchājātapaccayena paccayo. Pannarasa dhammā sahajātapaccayena paccayo. Atthāro adhiṭṭhānassa anantarapaccayena paccayo, samanantarapaccayena paccayo, nissayapaccayena paccayo, upanissayapaccayena paccayo. Adhiṭṭhānaṃ atthārassa purejātapaccayena ",
      " paccayo. Atthāro adhiṭṭhānassa pacchājātapaccayena paccayo. Pannarasa dhammā sahajātapaccayena paccayo. Mātikā ca palibodhā ca atthārassa anantarapaccayena paccayo, samanantarapaccayena paccayo, nissayapaccayena paccayo, upanissayapaccayena paccayo. Atthāro mātikānañca palibodhānañca purejātapaccayena paccayo. Mātikā ca palibodhā ca atthārassa pacchājātapaccayena paccayo. Pannarasa dhammā sahajātapaccayena paccayo. Āsā ",
      " ca anāsā ca vatthussa anantarapaccayena paccayo, samanantarapaccayena paccayo, nissayapaccayena paccayo ",
      ", upanissayapaccayena paccayo. Vatthu āsānañca anāsānañca purejātapaccayena paccayo. Āsā ca anāsā ca vatthussa pacchājātapaccayena paccayo. Pannarasa dhammā sahajātapaccayena paccayo."
    ],
    "innerText": "Pubbakaraṇaṃ payogassa anantarapaccayena paccayo, samanantarapaccayena paccayo, nissayapaccayena paccayo, upanissayapaccayena paccayo. Payogo pubbakaraṇassa purejātapaccayena paccayo. Pubbakaraṇaṃ payogassa pacchājātapaccayena paccayo. Pannarasa dhammā sahajātapaccayena paccayo. Paccuddhāro pubbakaraṇassa anantarapaccayena paccayo, samanantarapaccayena paccayo, nissayapaccayena paccayo, upanissayapaccayena paccayo. Pubbakaraṇaṃ paccuddhārassa purejātapaccayena paccayo. Paccuddhāro pubbakaraṇassa pacchājātapaccayena paccayo. Pannarasa dhammā sahajātapaccayena paccayo. Adhiṭṭhānaṃ paccuddhārassa anantarapaccayena paccayo, samanantarapaccayena paccayo, nissayapaccayena paccayo, upanissayapaccayena paccayo. Paccuddhāro adhiṭṭhānassa purejātapaccayena paccayo. Adhiṭṭhānaṃ paccuddhārassa pacchājātapaccayena paccayo. Pannarasa dhammā sahajātapaccayena paccayo. Atthāro adhiṭṭhānassa anantarapaccayena paccayo, samanantarapaccayena paccayo, nissayapaccayena paccayo, upanissayapaccayena paccayo. Adhiṭṭhānaṃ atthārassa purejātapaccayena paccayo. Atthāro adhiṭṭhānassa pacchājātapaccayena paccayo. Pannarasa dhammā sahajātapaccayena paccayo. Mātikā ca palibodhā ca atthārassa anantarapaccayena paccayo, samanantarapaccayena paccayo, nissayapaccayena paccayo, upanissayapaccayena paccayo. Atthāro mātikānañca palibodhānañca purejātapaccayena paccayo. Mātikā ca palibodhā ca atthārassa pacchājātapaccayena paccayo. Pannarasa dhammā sahajātapaccayena paccayo. Āsā ca anāsā ca vatthussa anantarapaccayena paccayo, samanantarapaccayena paccayo, nissayapaccayena paccayo , upanissayapaccayena paccayo. Vatthu āsānañca anāsānañca purejātapaccayena paccayo. Āsā ca anāsā ca vatthussa pacchājātapaccayena paccayo. Pannarasa dhammā sahajātapaccayena paccayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Pubbakaraṇanidānādivibhāgo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "405"
      },
      ". Pubbakaraṇaṃ kiṃnidānaṃ, kiṃsamudayaṃ, kiṃjātikaṃ, kiṃpabhavaṃ, kiṃsambhāraṃ, kiṃsamuṭṭhānaṃ ",
      "? Paccuddhāro kiṃnidāno, kiṃsamudayo, kiṃjātiko, kiṃpabhavo, kiṃsambhāro, kiṃsamuṭṭhāno? Adhiṭṭhānaṃ kiṃnidānaṃ, kiṃsamudayaṃ, kiṃjātikaṃ, kiṃpabhavaṃ, kiṃsambhāraṃ, kiṃsamuṭṭhānaṃ? Atthāro kiṃnidāno, kiṃsamudayo, kiṃjātiko, kiṃpabhavo, kiṃsambhāro, kiṃsamuṭṭhāno? Mātikā ca palibodhā ca kiṃnidānā, kiṃsamudayā, kiṃjātikā, kiṃpabhavā, kiṃsambhārā kiṃsamuṭṭhānā? Āsā ca anāsā ",
      " ca kiṃnidānā, kiṃsamudayā, kiṃjātikā, kiṃpabhavā, kiṃsambhārā, kiṃsamuṭṭhānā?"
    ],
    "innerText": "405. Pubbakaraṇaṃ kiṃnidānaṃ, kiṃsamudayaṃ, kiṃjātikaṃ, kiṃpabhavaṃ, kiṃsambhāraṃ, kiṃsamuṭṭhānaṃ ? Paccuddhāro kiṃnidāno, kiṃsamudayo, kiṃjātiko, kiṃpabhavo, kiṃsambhāro, kiṃsamuṭṭhāno? Adhiṭṭhānaṃ kiṃnidānaṃ, kiṃsamudayaṃ, kiṃjātikaṃ, kiṃpabhavaṃ, kiṃsambhāraṃ, kiṃsamuṭṭhānaṃ? Atthāro kiṃnidāno, kiṃsamudayo, kiṃjātiko, kiṃpabhavo, kiṃsambhāro, kiṃsamuṭṭhāno? Mātikā ca palibodhā ca kiṃnidānā, kiṃsamudayā, kiṃjātikā, kiṃpabhavā, kiṃsambhārā kiṃsamuṭṭhānā? Āsā ca anāsā ca kiṃnidānā, kiṃsamudayā, kiṃjātikā, kiṃpabhavā, kiṃsambhārā, kiṃsamuṭṭhānā?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Pubbakaraṇaṃ payoganidānaṃ, payogasamudayaṃ, payogajātikaṃ, payogapabhavaṃ, payogasambhāraṃ, payogasamuṭṭhānaṃ. Paccuddhāro pubbakaraṇanidāno, pubbakaraṇasamudayo, pubbakaraṇajātiko, pubbakaraṇapabhavo, pubbakaraṇasambhāro, pubbakaraṇasamuṭṭhāno. Adhiṭṭhānaṃ paccuddhāranidānaṃ, paccuddhārasamudayaṃ, paccuddhārajātikaṃ, paccuddhārapabhavaṃ, paccuddhārasambhāraṃ, paccuddhārasamuṭṭhānaṃ. Atthāro adhiṭṭhānanidāno, adhiṭṭhānasamudayo, adhiṭṭhānajātiko, adhiṭṭhānapabhavo, adhiṭṭhānasambhāro, adhiṭṭhānasamuṭṭhāno. Mātikā ca palibodhā ca atthāranidānā, atthārasamudayā, atthārajātikā, atthārapabhavā, atthārasambhārā, atthārasamuṭṭhānā. Āsā ca anāsā ca vatthunidānā, vatthusamudayā, vatthujātikā, vatthupabhavā, vatthusambhārā, vatthusamuṭṭhānā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "406"
      },
      ". Payogo kiṃnidāno, kiṃsamudayo, kiṃjātiko, kiṃpabhavo, kiṃsambhāro, kiṃsamuṭṭhāno, pubbakaraṇaṃ…pe… paccuddhāro… adhiṭṭhānaṃ… atthāro… mātikā ca palibodhā ca… vatthu… āsā ca anāsā ca kiṃnidānā, kiṃsamudayā, kiṃjātikā, kiṃpabhavā, kiṃsambhārā, kiṃsamuṭṭhānā?"
    ],
    "innerText": "406. Payogo kiṃnidāno, kiṃsamudayo, kiṃjātiko, kiṃpabhavo, kiṃsambhāro, kiṃsamuṭṭhāno, pubbakaraṇaṃ…pe… paccuddhāro… adhiṭṭhānaṃ… atthāro… mātikā ca palibodhā ca… vatthu… āsā ca anāsā ca kiṃnidānā, kiṃsamudayā, kiṃjātikā, kiṃpabhavā, kiṃsambhārā, kiṃsamuṭṭhānā?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Payogo ",
      " hetunidāno, hetusamudayo, hetujātiko, hetupabhavo, hetusambhāro, hetusamuṭṭhāno. Pubbakaraṇaṃ…pe… paccuddhāro… adhiṭṭhānaṃ… atthāro ",
      "… mātikā ca palibodhā ca… vatthu… āsā ca anāsā ca hetunidānā, hetusamudayā, hetujātikā, hetupabhavā, hetusambhārā, hetusamuṭṭhānā."
    ],
    "innerText": "Payogo hetunidāno, hetusamudayo, hetujātiko, hetupabhavo, hetusambhāro, hetusamuṭṭhāno. Pubbakaraṇaṃ…pe… paccuddhāro… adhiṭṭhānaṃ… atthāro … mātikā ca palibodhā ca… vatthu… āsā ca anāsā ca hetunidānā, hetusamudayā, hetujātikā, hetupabhavā, hetusambhārā, hetusamuṭṭhānā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "407"
      },
      ". Payogo kiṃnidāno, kiṃsamudayo, kiṃjātiko, kiṃpabhavo, kiṃsambhāro, kiṃsamuṭṭhāno? Pubbakaraṇaṃ…pe… paccuddhāro… adhiṭṭhānaṃ… atthāro… mātikā ca palibodhā ca… vatthu… āsā ca anāsā ca kiṃnidānā, kiṃsamudayā, kiṃjātikā, kiṃpabhavā, kiṃsambhārā, kiṃsamuṭṭhānā?"
    ],
    "innerText": "407. Payogo kiṃnidāno, kiṃsamudayo, kiṃjātiko, kiṃpabhavo, kiṃsambhāro, kiṃsamuṭṭhāno? Pubbakaraṇaṃ…pe… paccuddhāro… adhiṭṭhānaṃ… atthāro… mātikā ca palibodhā ca… vatthu… āsā ca anāsā ca kiṃnidānā, kiṃsamudayā, kiṃjātikā, kiṃpabhavā, kiṃsambhārā, kiṃsamuṭṭhānā?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Payogo ",
      " paccayanidāno, paccayasamudayo, paccayajātiko, paccayapabhavo, paccayasambhāro, paccayasamuṭṭhāno. Pubbakaraṇaṃ…pe… paccuddhāro… adhiṭṭhānaṃ… atthāro… mātikā ca palibodhā ca… vatthu… āsā ca anāsā ca paccayanidānā, paccayasamudayā, paccayajātikā, paccayapabhavā, paccayasambhārā, paccayasamuṭṭhānā."
    ],
    "innerText": "Payogo paccayanidāno, paccayasamudayo, paccayajātiko, paccayapabhavo, paccayasambhāro, paccayasamuṭṭhāno. Pubbakaraṇaṃ…pe… paccuddhāro… adhiṭṭhānaṃ… atthāro… mātikā ca palibodhā ca… vatthu… āsā ca anāsā ca paccayanidānā, paccayasamudayā, paccayajātikā, paccayapabhavā, paccayasambhārā, paccayasamuṭṭhānā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "408"
      },
      ". Pubbakaraṇaṃ katihi dhammehi saṅgahitaṃ? Pubbakaraṇaṃ sattahi dhammehi saṅgahitaṃ. Dhovanena, vicāraṇena, chedanena, bandhanena, sibbanena, rajanena, kappakaraṇena – pubbakaraṇaṃ imehi sattahi dhammehi saṅgahitaṃ."
    ],
    "innerText": "408. Pubbakaraṇaṃ katihi dhammehi saṅgahitaṃ? Pubbakaraṇaṃ sattahi dhammehi saṅgahitaṃ. Dhovanena, vicāraṇena, chedanena, bandhanena, sibbanena, rajanena, kappakaraṇena – pubbakaraṇaṃ imehi sattahi dhammehi saṅgahitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Paccuddhāro katihi dhammehi saṅgahito? Paccuddhāro tīhi dhammehi saṅgahito – saṅghāṭiyā, uttarāsaṅgena, antaravāsakena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Adhiṭṭhānaṃ katihi dhammehi saṅgahitaṃ? Adhiṭṭhānaṃ tīhi dhammehi saṅgahitaṃ – saṅghāṭiyā, uttarāsaṅgena, antaravāsakena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atthāro katihi dhammehi saṅgahito? Atthāro ekena ",
      " dhammena saṅgahito – vacībhedena."
    ],
    "innerText": "Atthāro katihi dhammehi saṅgahito? Atthāro ekena dhammena saṅgahito – vacībhedena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathinassa kati mūlāni, kati vatthūni, kati bhūmiyo? Kathinassa ",
      " ekaṃ mūlaṃ – saṅgho; tīṇi vatthūni – saṅghāṭi, uttarāsaṅgo, antaravāsako, cha bhūmiyo – khomaṃ, kappāsikaṃ, koseyyaṃ, kambalaṃ, sāṇaṃ, bhaṅgaṃ."
    ],
    "innerText": "Kathinassa kati mūlāni, kati vatthūni, kati bhūmiyo? Kathinassa ekaṃ mūlaṃ – saṅgho; tīṇi vatthūni – saṅghāṭi, uttarāsaṅgo, antaravāsako, cha bhūmiyo – khomaṃ, kappāsikaṃ, koseyyaṃ, kambalaṃ, sāṇaṃ, bhaṅgaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathinassa ",
      " ko ādi, kiṃ majjhe, kiṃ pariyosānaṃ? Kathinassa pubbakaraṇaṃ ādi, kriyā majjhe, atthāro pariyosānaṃ."
    ],
    "innerText": "Kathinassa ko ādi, kiṃ majjhe, kiṃ pariyosānaṃ? Kathinassa pubbakaraṇaṃ ādi, kriyā majjhe, atthāro pariyosānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "409"
      },
      ". Katihaṅgehi samannāgato puggalo abhabbo kathinaṃ attharituṃ? Katihaṅgehi samannāgato puggalo bhabbo kathinaṃ attharituṃ? Aṭṭhahaṅgehi samannāgato puggalo abhabbo kathinaṃ attharituṃ. Aṭṭhahaṅgehi samannāgato puggalo bhabbo kathinaṃ attharituṃ. Katamehi aṭṭhahaṅgehi samannāgato puggalo abhabbo kathinaṃ attharituṃ? Pubbakaraṇaṃ na jānāti, paccuddhāraṃ na jānāti, adhiṭṭhānaṃ na jānāti, atthāraṃ na jānāti, mātikaṃ na jānāti, palibodhaṃ na jānāti, uddhāraṃ na jānāti, ānisaṃsaṃ na jānāti – imehi aṭṭhahaṅgehi samannāgato puggalo ",
      " abhabbo kathinaṃ attharituṃ. Katamehi aṭṭhahaṅgehi samannāgato puggalo bhabbo kathinaṃ attharituṃ? Pubbakaraṇaṃ jānāti, paccuddhāraṃ jānāti, adhiṭṭhānaṃ jānāti, atthāraṃ jānāti, mātikaṃ jānāti, palibodhaṃ jānāti, uddhāraṃ jānāti, ānisaṃsaṃ jānāti – imehi aṭṭhahaṅgehi samannāgato puggalo bhabbo kathinaṃ attharituṃ."
    ],
    "innerText": "409. Katihaṅgehi samannāgato puggalo abhabbo kathinaṃ attharituṃ? Katihaṅgehi samannāgato puggalo bhabbo kathinaṃ attharituṃ? Aṭṭhahaṅgehi samannāgato puggalo abhabbo kathinaṃ attharituṃ. Aṭṭhahaṅgehi samannāgato puggalo bhabbo kathinaṃ attharituṃ. Katamehi aṭṭhahaṅgehi samannāgato puggalo abhabbo kathinaṃ attharituṃ? Pubbakaraṇaṃ na jānāti, paccuddhāraṃ na jānāti, adhiṭṭhānaṃ na jānāti, atthāraṃ na jānāti, mātikaṃ na jānāti, palibodhaṃ na jānāti, uddhāraṃ na jānāti, ānisaṃsaṃ na jānāti – imehi aṭṭhahaṅgehi samannāgato puggalo abhabbo kathinaṃ attharituṃ. Katamehi aṭṭhahaṅgehi samannāgato puggalo bhabbo kathinaṃ attharituṃ? Pubbakaraṇaṃ jānāti, paccuddhāraṃ jānāti, adhiṭṭhānaṃ jānāti, atthāraṃ jānāti, mātikaṃ jānāti, palibodhaṃ jānāti, uddhāraṃ jānāti, ānisaṃsaṃ jānāti – imehi aṭṭhahaṅgehi samannāgato puggalo bhabbo kathinaṃ attharituṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "410"
      },
      ". Katinaṃ ",
      " puggalānaṃ kathinatthārā na ruhanti? Katinaṃ puggalānaṃ kathinatthārā ruhanti? Tiṇṇaṃ puggalānaṃ kathinatthārā na ruhanti. Tiṇṇaṃ puggalānaṃ kathinatthārā ruhanti. Katamesaṃ tiṇṇaṃ puggalānaṃ kathinatthārā na ruhanti? Nissīmaṭṭho anumodati, anumodento na vācaṃ bhindati, vācaṃ bhindanto na paraṃ viññāpeti – imesaṃ tiṇṇaṃ puggalānaṃ kathinatthārā na ruhanti. Katamesaṃ tiṇṇaṃ puggalānaṃ kathinatthārā ruhanti? Sīmaṭṭho anumodati, anumodento vācaṃ bhindati, vācaṃ bhindanto paraṃ viññāpeti – imesaṃ tiṇṇaṃ puggalānaṃ kathinatthārā ruhanti."
    ],
    "innerText": "410. Katinaṃ puggalānaṃ kathinatthārā na ruhanti? Katinaṃ puggalānaṃ kathinatthārā ruhanti? Tiṇṇaṃ puggalānaṃ kathinatthārā na ruhanti. Tiṇṇaṃ puggalānaṃ kathinatthārā ruhanti. Katamesaṃ tiṇṇaṃ puggalānaṃ kathinatthārā na ruhanti? Nissīmaṭṭho anumodati, anumodento na vācaṃ bhindati, vācaṃ bhindanto na paraṃ viññāpeti – imesaṃ tiṇṇaṃ puggalānaṃ kathinatthārā na ruhanti. Katamesaṃ tiṇṇaṃ puggalānaṃ kathinatthārā ruhanti? Sīmaṭṭho anumodati, anumodento vācaṃ bhindati, vācaṃ bhindanto paraṃ viññāpeti – imesaṃ tiṇṇaṃ puggalānaṃ kathinatthārā ruhanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "411"
      },
      ". Kati kathinatthārā na ruhanti? Kati kathinatthārā ruhanti? Tayo kathinatthārā na ruhanti. Tayo kathinatthārā ruhanti. Katame tayo kathinatthārā na ruhanti? Vatthuvipannañceva hoti, kālavipannañca, karaṇavipannañca – ime tayo kathinatthārā na ruhanti. Katame tayo kathinatthārā ruhanti? Vatthusampannañceva hoti, kālasampannañca, karaṇasampannañca – ime tayo kathinatthārā ruhanti."
    ],
    "innerText": "411. Kati kathinatthārā na ruhanti? Kati kathinatthārā ruhanti? Tayo kathinatthārā na ruhanti. Tayo kathinatthārā ruhanti. Katame tayo kathinatthārā na ruhanti? Vatthuvipannañceva hoti, kālavipannañca, karaṇavipannañca – ime tayo kathinatthārā na ruhanti. Katame tayo kathinatthārā ruhanti? Vatthusampannañceva hoti, kālasampannañca, karaṇasampannañca – ime tayo kathinatthārā ruhanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Kathinādijānitabbavibhāgo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "412"
      },
      ". Kathinaṃ ",
      " jānitabbaṃ, kathinatthāro jānitabbo, kathinassa atthāramāso jānitabbo, kathinassa atthāravipatti jānitabbā, kathinassa atthārasampatti jānitabbā, nimittakammaṃ jānitabbaṃ, parikathā jānitabbā, kukkukataṃ jānitabbaṃ, sannidhi jānitabbā, nissaggiyaṃ ",
      " jānitabbaṃ."
    ],
    "innerText": "412. Kathinaṃ jānitabbaṃ, kathinatthāro jānitabbo, kathinassa atthāramāso jānitabbo, kathinassa atthāravipatti jānitabbā, kathinassa atthārasampatti jānitabbā, nimittakammaṃ jānitabbaṃ, parikathā jānitabbā, kukkukataṃ jānitabbaṃ, sannidhi jānitabbā, nissaggiyaṃ jānitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kathinaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jānitabba"
      },
      "nti tesaññeva dhammānaṃ saṅgaho samavāyo nāmaṃ nāmakammaṃ nāmadheyyaṃ nirutti byañjanaṃ abhilāpo yadidaṃ kathinanti."
    ],
    "innerText": "Kathinaṃjānitabbanti tesaññeva dhammānaṃ saṅgaho samavāyo nāmaṃ nāmakammaṃ nāmadheyyaṃ nirutti byañjanaṃ abhilāpo yadidaṃ kathinanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kathinassa"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atthāramāso jānitabbo"
      },
      "ti vassānassa pacchimo māso jānitabbo."
    ],
    "innerText": "Kathinassaatthāramāso jānitabboti vassānassa pacchimo māso jānitabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kathinassa atthāravipatti jānitabbā"
      },
      "ti catuvīsatiyā ākārehi kathinassa atthāravipatti jānitabbā."
    ],
    "innerText": "Kathinassa atthāravipatti jānitabbāti catuvīsatiyā ākārehi kathinassa atthāravipatti jānitabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kathinassa atthārasampatti jānitabbā"
      },
      "ti sattarasahi ākārehi kathinassa atthārasampatti jānitabbā."
    ],
    "innerText": "Kathinassa atthārasampatti jānitabbāti sattarasahi ākārehi kathinassa atthārasampatti jānitabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nimittakammaṃ jānitabba"
      },
      "nti nimittaṃ karoti iminā dussena kathinaṃ attharissāmīti."
    ],
    "innerText": "Nimittakammaṃ jānitabbanti nimittaṃ karoti iminā dussena kathinaṃ attharissāmīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parikathā jānitabbā"
      },
      "ti parikathaṃ karoti imāya parikathāya kathinadussaṃ nibbattessāmīti."
    ],
    "innerText": "Parikathā jānitabbāti parikathaṃ karoti imāya parikathāya kathinadussaṃ nibbattessāmīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kukkukataṃ jānitabba"
      },
      "nti anādiyadānaṃ jānitabbaṃ."
    ],
    "innerText": "Kukkukataṃ jānitabbanti anādiyadānaṃ jānitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sannidhi jānitabbā"
      },
      "ti dve sannidhiyo jānitabbā – karaṇasannidhi vā nicayasannidhi vā."
    ],
    "innerText": "Sannidhi jānitabbāti dve sannidhiyo jānitabbā – karaṇasannidhi vā nicayasannidhi vā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nissaggiyaṃ jānitabba"
      },
      "nti kariyamāne aruṇaṃ uṭṭhahati."
    ],
    "innerText": "Nissaggiyaṃ jānitabbanti kariyamāne aruṇaṃ uṭṭhahati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kathinatthāro jānitabbo"
      },
      "ti sace saṅghassa kathinadussaṃ uppannaṃ hoti, saṅghena kathaṃ paṭipajjitabbaṃ, atthārakena kathaṃ paṭipajjitabbaṃ, anumodakena kathaṃ paṭipajjitabbaṃ."
    ],
    "innerText": "Kathinatthāro jānitabboti sace saṅghassa kathinadussaṃ uppannaṃ hoti, saṅghena kathaṃ paṭipajjitabbaṃ, atthārakena kathaṃ paṭipajjitabbaṃ, anumodakena kathaṃ paṭipajjitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "413"
      },
      ". Saṅghena ñattidutiyena kammena kathinatthārakassa bhikkhuno dātabbaṃ, tena kathinatthārakena bhikkhunā tadaheva dhovitvā vimajjitvā vicāretvā chinditvā sibbetvā rajitvā kappaṃ katvā kathinaṃ attharitabbaṃ. Sace ",
      " saṅghāṭiyā kathinaṃ attharitukāmo hoti, porāṇikā saṅghāṭi paccuddharitabbā ",
      ", navā saṅghāṭi adhiṭṭhātabbā. Imāya saṅghāṭiyā kathinaṃ attharāmīti vācā bhinditabbā. Sace uttarāsaṅgena kathinaṃ attharitukāmo hoti, porāṇako uttarāsaṅgo paccuddharitabbo, navo uttarāsaṅgo adhiṭṭhātabbo. Iminā uttarāsaṅgena kathinaṃ attharāmīti vācā bhinditabbā. Sace antaravāsakena kathinaṃ attharitukāmo hoti, porāṇako antaravāsako paccuddharitabbo, navo antaravāsako adhiṭṭhātabbo. Iminā antaravāsakena kathinaṃ attharāmīti vācā bhinditabbā. Tena kathinatthārakena bhikkhunā saṅghaṃ upasaṅkamitvā ekaṃsaṃ uttarāsaṅgaṃ ",
      " karitvā añjaliṃ paggahetvā evamassa vacanīyo – ‘‘atthataṃ, bhante, saṅghassa kathinaṃ, dhammiko kathinatthāro, anumodathā’’ti. Tehi anumodakehi bhikkhūhi ekaṃsaṃ uttarāsaṅgaṃ karitvā añjaliṃ ",
      " paggahetvā evamassa vacanīyo – ‘‘atthataṃ, āvuso, saṅghassa kathinaṃ, dhammiko kathinatthāro, anumodāmā’’ti. Tena kathinatthārakena bhikkhunā sambahule bhikkhū upasaṅkamitvā ekaṃsaṃ uttarāsaṅgaṃ karitvā añjaliṃ ",
      " paggahetvā evamassu vacanīyā – ‘‘atthataṃ, bhante, saṅghassa kathinaṃ, dhammiko kathinatthāro, anumodathā’’ti. Tehi anumodakehi bhikkhūhi ekaṃsaṃ uttarāsaṅgaṃ karitvā añjaliṃ paggahetvā evamassa vacanīyo – ‘‘atthataṃ, āvuso, saṅghassa kathinaṃ, dhammiko kathinatthāro anumodāmā’’ti. Tena kathinatthārakena bhikkhunā ekaṃ bhikkhuṃ upasaṅkamitvā ekaṃsaṃ uttarāsaṅgaṃ karitvā añjaliṃ paggahetvā evamassa vacanīyo – ‘‘atthataṃ, āvuso, saṅghassa kathinaṃ, dhammiko kathinatthāro, anumodāhī’’ti. Tena anumodakena bhikkhunā ekaṃsaṃ uttarāsaṅgaṃ karitvā añjaliṃ paggahetvā evamassa vacanīyo – ‘‘atthataṃ, āvuso, saṅghassa kathinaṃ, dhammiko kathinatthāro, anumodāmī’’ti."
    ],
    "innerText": "413. Saṅghena ñattidutiyena kammena kathinatthārakassa bhikkhuno dātabbaṃ, tena kathinatthārakena bhikkhunā tadaheva dhovitvā vimajjitvā vicāretvā chinditvā sibbetvā rajitvā kappaṃ katvā kathinaṃ attharitabbaṃ. Sace saṅghāṭiyā kathinaṃ attharitukāmo hoti, porāṇikā saṅghāṭi paccuddharitabbā , navā saṅghāṭi adhiṭṭhātabbā. Imāya saṅghāṭiyā kathinaṃ attharāmīti vācā bhinditabbā. Sace uttarāsaṅgena kathinaṃ attharitukāmo hoti, porāṇako uttarāsaṅgo paccuddharitabbo, navo uttarāsaṅgo adhiṭṭhātabbo. Iminā uttarāsaṅgena kathinaṃ attharāmīti vācā bhinditabbā. Sace antaravāsakena kathinaṃ attharitukāmo hoti, porāṇako antaravāsako paccuddharitabbo, navo antaravāsako adhiṭṭhātabbo. Iminā antaravāsakena kathinaṃ attharāmīti vācā bhinditabbā. Tena kathinatthārakena bhikkhunā saṅghaṃ upasaṅkamitvā ekaṃsaṃ uttarāsaṅgaṃ karitvā añjaliṃ paggahetvā evamassa vacanīyo – ‘‘atthataṃ, bhante, saṅghassa kathinaṃ, dhammiko kathinatthāro, anumodathā’’ti. Tehi anumodakehi bhikkhūhi ekaṃsaṃ uttarāsaṅgaṃ karitvā añjaliṃ paggahetvā evamassa vacanīyo – ‘‘atthataṃ, āvuso, saṅghassa kathinaṃ, dhammiko kathinatthāro, anumodāmā’’ti. Tena kathinatthārakena bhikkhunā sambahule bhikkhū upasaṅkamitvā ekaṃsaṃ uttarāsaṅgaṃ karitvā añjaliṃ paggahetvā evamassu vacanīyā – ‘‘atthataṃ, bhante, saṅghassa kathinaṃ, dhammiko kathinatthāro, anumodathā’’ti. Tehi anumodakehi bhikkhūhi ekaṃsaṃ uttarāsaṅgaṃ karitvā añjaliṃ paggahetvā evamassa vacanīyo – ‘‘atthataṃ, āvuso, saṅghassa kathinaṃ, dhammiko kathinatthāro anumodāmā’’ti. Tena kathinatthārakena bhikkhunā ekaṃ bhikkhuṃ upasaṅkamitvā ekaṃsaṃ uttarāsaṅgaṃ karitvā añjaliṃ paggahetvā evamassa vacanīyo – ‘‘atthataṃ, āvuso, saṅghassa kathinaṃ, dhammiko kathinatthāro, anumodāhī’’ti. Tena anumodakena bhikkhunā ekaṃsaṃ uttarāsaṅgaṃ karitvā añjaliṃ paggahetvā evamassa vacanīyo – ‘‘atthataṃ, āvuso, saṅghassa kathinaṃ, dhammiko kathinatthāro, anumodāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Puggalassevakathinatthāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "414"
      },
      ". Saṅgho kathinaṃ attharati, gaṇo kathinaṃ attharati, puggalo kathinaṃ attharatīti. Na saṅgho kathinaṃ attharati, na gaṇo kathinaṃ attharati, puggalo kathinaṃ attharatīti. Hañci na saṅgho kathinaṃ attharati, na gaṇo kathinaṃ attharati, puggalo kathinaṃ attharati. Saṅghassa anatthataṃ ",
      " hoti kathinaṃ, gaṇassa anatthataṃ hoti kathinaṃ, puggalassa atthataṃ hoti kathinaṃ. Saṅgho pātimokkhaṃ uddisati gaṇo pātimokkhaṃ uddisati puggalo pātimokkhaṃ uddisatīti na saṅgho pātimokkhaṃ uddisati, na gaṇo pātimokkhaṃ uddisati, puggalo pātimokkhaṃ uddisatīti. Hañci na saṅgho pātimokkhaṃ uddisati, na gaṇo pātimokkhaṃ uddisati, puggalo pātimokkhaṃ uddisati. Saṅghassa anuddiṭṭhaṃ hoti pātimokkhaṃ, gaṇassa anuddiṭṭhaṃ hoti pātimokkhaṃ, puggalassa uddiṭṭhaṃ hoti pātimokkhaṃ. Saṅghassa sāmaggiyā gaṇassa sāmaggiyā puggalassa uddesā saṅghassa uddiṭṭhaṃ hoti pātimokkhaṃ, gaṇassa uddiṭṭhaṃ hoti pātimokkhaṃ, puggalassa uddiṭṭhaṃ hoti pātimokkhaṃ. Evameva na saṅgho kathinaṃ attharati, na ",
      " gaṇo kathinaṃ attharati, puggalo kathinaṃ attharati. Saṅghassa anumodanāya gaṇassa anumodanāya puggalassa atthārā saṅghassa atthataṃ hoti kathinaṃ, gaṇassa atthataṃ hoti kathinaṃ, puggalassa atthataṃ hoti kathinanti."
    ],
    "innerText": "414. Saṅgho kathinaṃ attharati, gaṇo kathinaṃ attharati, puggalo kathinaṃ attharatīti. Na saṅgho kathinaṃ attharati, na gaṇo kathinaṃ attharati, puggalo kathinaṃ attharatīti. Hañci na saṅgho kathinaṃ attharati, na gaṇo kathinaṃ attharati, puggalo kathinaṃ attharati. Saṅghassa anatthataṃ hoti kathinaṃ, gaṇassa anatthataṃ hoti kathinaṃ, puggalassa atthataṃ hoti kathinaṃ. Saṅgho pātimokkhaṃ uddisati gaṇo pātimokkhaṃ uddisati puggalo pātimokkhaṃ uddisatīti na saṅgho pātimokkhaṃ uddisati, na gaṇo pātimokkhaṃ uddisati, puggalo pātimokkhaṃ uddisatīti. Hañci na saṅgho pātimokkhaṃ uddisati, na gaṇo pātimokkhaṃ uddisati, puggalo pātimokkhaṃ uddisati. Saṅghassa anuddiṭṭhaṃ hoti pātimokkhaṃ, gaṇassa anuddiṭṭhaṃ hoti pātimokkhaṃ, puggalassa uddiṭṭhaṃ hoti pātimokkhaṃ. Saṅghassa sāmaggiyā gaṇassa sāmaggiyā puggalassa uddesā saṅghassa uddiṭṭhaṃ hoti pātimokkhaṃ, gaṇassa uddiṭṭhaṃ hoti pātimokkhaṃ, puggalassa uddiṭṭhaṃ hoti pātimokkhaṃ. Evameva na saṅgho kathinaṃ attharati, na gaṇo kathinaṃ attharati, puggalo kathinaṃ attharati. Saṅghassa anumodanāya gaṇassa anumodanāya puggalassa atthārā saṅghassa atthataṃ hoti kathinaṃ, gaṇassa atthataṃ hoti kathinaṃ, puggalassa atthataṃ hoti kathinanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Palibodhapañhābyākaraṇaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "hangnum"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "415"
      },
      "."
    ],
    "innerText": "415."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      " Pakkamanantiko ",
      " kathinuddhāro, vutto ādiccabandhunā;"
    ],
    "innerText": "Pakkamanantiko kathinuddhāro, vutto ādiccabandhunā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Etañca tāhaṃ pucchāmi, katamo palibodho paṭhamaṃ chijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Pakkamanantiko ",
      " kathinuddhāro, vutto ādiccabandhunā;"
    ],
    "innerText": "Pakkamanantiko kathinuddhāro, vutto ādiccabandhunā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Etañca tāhaṃ vissajjissaṃ, cīvarapalibodho paṭhamaṃ chijjati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tassa saha bahisīmagamanā, āvāsapalibodho chijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Niṭṭhānantiko kathinuddhāro, vutto ādiccabandhunā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Etañca tāhaṃ pucchāmi, katamo palibodho paṭhamaṃ chijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Niṭṭhānantiko kathinuddhāro, vutto ādiccabandhunā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "children": [
      "Etañca tāhaṃ vissajjissaṃ, āvāsapalibodho ",
      " paṭhamaṃ chijjati;"
    ],
    "innerText": "Etañca tāhaṃ vissajjissaṃ, āvāsapalibodho paṭhamaṃ chijjati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Cīvare niṭṭhite cīvarapalibodho chijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sanniṭṭhānantiko kathinuddhāro, vutto ādiccabandhunā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Etañca tāhaṃ pucchāmi, katamo palibodho paṭhamaṃ chijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sanniṭṭhānantiko kathinuddhāro, vutto ādiccabandhunā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Etañca tāhaṃ vissajjissaṃ, dve palibodhā apubbaṃ acarimaṃ chijjanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Nāsanantiko ",
      " kathinuddhāro, vutto ādiccabandhunā;"
    ],
    "innerText": "Nāsanantiko kathinuddhāro, vutto ādiccabandhunā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Etañca tāhaṃ pucchāmi, katamo palibodho paṭhamaṃ chijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Nāsanantiko kathinuddhāro, vutto ādiccabandhunā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Etañca tāhaṃ vissajjissaṃ, āvāsapalibodho paṭhamaṃ chijjati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Cīvare naṭṭhe cīvarapalibodho chijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Savanantiko ",
      " kathinuddhāro, vutto ādiccabandhunā;"
    ],
    "innerText": "Savanantiko kathinuddhāro, vutto ādiccabandhunā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Etañca tāhaṃ pucchāmi, katamo palibodho paṭhamaṃ chijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Savanantiko kathinuddhāro, vutto ādiccabandhunā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Etañca tāhaṃ vissajjissaṃ, cīvarapalibodho paṭhamaṃ chijjati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tassa saha savanena, āvāsapalibodho chijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Āsāvacchediko kathinuddhāro, vutto ādiccabandhunā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Etañca tāhaṃ pucchāmi, katamo palibodho paṭhamaṃ chijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Āsāvacchediko kathinuddhāro, vutto ādiccabandhunā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Etañca tāhaṃ vissajjissaṃ, āvāsapalibodho paṭhamaṃ chijjati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Cīvarāsāya upacchinnāya cīvarapalibodho chijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sīmātikkamanantiko kathinuddhāro, vutto ādiccabandhunā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Etañca tāhaṃ pucchāmi, katamo ",
      " palibodho paṭhamaṃ chijjati."
    ],
    "innerText": "Etañca tāhaṃ pucchāmi, katamo palibodho paṭhamaṃ chijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sīmātikkamanantiko kathinuddhāro, vutto ādiccabandhunā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Etañca tāhaṃ vissajjissaṃ, cīvarapalibodho paṭhamaṃ chijjati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Tassa bahisīme ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[bahisīmagatassa (sī. syā.)]"
      },
      " āvāsapalibodho chijjati."
    ],
    "innerText": "Tassa bahisīme [bahisīmagatassa (sī. syā.)] āvāsapalibodho chijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Sahubbhāro kathinuddhāro ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[saubbhāro (ka.)]"
      },
      ", vutto ādiccabandhunā;"
    ],
    "innerText": "Sahubbhāro kathinuddhāro [saubbhāro (ka.)], vutto ādiccabandhunā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Etañca tāhaṃ pucchāmi, katamo palibodho paṭhamaṃ chijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sahubbhāro kathinuddhāro, vutto ādiccabandhunā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Etañca tāhaṃ vissajjissaṃ, dve palibodhā apubbaṃ acarimaṃ chijjantīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "416"
      },
      ". Kati kathinuddhārā saṅghādhīnā? Kati kathinuddhārā puggalādhīnā? Kati kathinuddhārā neva saṅghādhīnā na puggalādhīnā? Eko kathinuddhāro saṅghādhīno ",
      " – antarubbhāro. Cattāro kathinuddhārā puggalādhīnā – pakkamanantiko, niṭṭhānantiko, sanniṭṭhānantiko, sīmātikkamanantiko ",
      ". Cattāro kathinuddhārā neva saṅghādhīnā na puggalādhīnā – nāsanantiko, savanantiko, āsāvacchediko, sahubbhāro. Kati ",
      " kathinuddhārā antosīmāya uddhariyyanti? Kati kathinuddhārā bahisīmāya uddhariyyanti? Kati kathinuddhārā siyā antosīmāya uddhariyyanti siyā bahisīmāya uddhariyyanti? Dve kathinuddhārā antosīmāya uddhariyyanti – antarubbhāro, sahubbhāro. Tayo kathinuddhārā bahisīmāya uddhariyyanti – pakkamanantiko, savanantiko, sīmātikkamanantiko. Cattāro kathinuddhārā siyā antosīmāya uddhariyyanti siyā bahisīmāya uddhariyyanti – niṭṭhānantiko, sanniṭṭhānantiko, nāsanantiko, āsāvacchediko."
    ],
    "innerText": "416. Kati kathinuddhārā saṅghādhīnā? Kati kathinuddhārā puggalādhīnā? Kati kathinuddhārā neva saṅghādhīnā na puggalādhīnā? Eko kathinuddhāro saṅghādhīno – antarubbhāro. Cattāro kathinuddhārā puggalādhīnā – pakkamanantiko, niṭṭhānantiko, sanniṭṭhānantiko, sīmātikkamanantiko . Cattāro kathinuddhārā neva saṅghādhīnā na puggalādhīnā – nāsanantiko, savanantiko, āsāvacchediko, sahubbhāro. Kati kathinuddhārā antosīmāya uddhariyyanti? Kati kathinuddhārā bahisīmāya uddhariyyanti? Kati kathinuddhārā siyā antosīmāya uddhariyyanti siyā bahisīmāya uddhariyyanti? Dve kathinuddhārā antosīmāya uddhariyyanti – antarubbhāro, sahubbhāro. Tayo kathinuddhārā bahisīmāya uddhariyyanti – pakkamanantiko, savanantiko, sīmātikkamanantiko. Cattāro kathinuddhārā siyā antosīmāya uddhariyyanti siyā bahisīmāya uddhariyyanti – niṭṭhānantiko, sanniṭṭhānantiko, nāsanantiko, āsāvacchediko."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kati kathinuddhārā ekuppādā ekanirodhā? Kati kathinuddhārā ekuppādā nānānirodhā? Dve kathinuddhārā ekuppādā ekanirodhā – antarubbhāro, sahubbhāro. Avasesā kathinuddhārā ekuppādā nānānirodhāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Kathinabhedo niṭṭhito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Kassa kinti pannarasa, dhammā nidānahetu ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Paccayasaṅgahamūlā, ādi ca atthārapuggalā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[aṭṭhapuggalā (sī.)]"
      },
      "."
    ],
    "innerText": "Paccayasaṅgahamūlā, ādi ca atthārapuggalā [aṭṭhapuggalā (sī.)]."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Tiṇṇaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[bhedato tiṇṇaṃ (ka.)]"
      },
      " tayo jānitabbaṃ, atthāraṃ uddesena ca;"
    ],
    "innerText": "Tiṇṇaṃ [bhedato tiṇṇaṃ (ka.)] tayo jānitabbaṃ, atthāraṃ uddesena ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Palibodhādhinā, sīmāya uppādanirodhena cāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ito paraṃ ‘‘parivāraṃ niṭṭhitaṃ’’ itipāṭho kesuci potthakesu dissati]"
      },
      "."
    ],
    "innerText": "Palibodhādhinā, sīmāya uppādanirodhena cāti [ito paraṃ ‘‘parivāraṃ niṭṭhitaṃ’’ itipāṭho kesuci potthakesu dissati]."
  }
]