[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "Nissaggiyakaṇḍaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "1. Cīvaravaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Kathinasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nissaggiyakaṇḍe ",
      " tiṇṇaṃ kathinasikkhāpadānaṃ, vassikasāṭikaaccekacīvarasāsaṅkasikkhāpadānañca ekadesanāya tathākiṇṇāpattikkhandhāva veditabbā –"
    ],
    "innerText": "Nissaggiyakaṇḍe tiṇṇaṃ kathinasikkhāpadānaṃ, vassikasāṭikaaccekacīvarasāsaṅkasikkhāpadānañca ekadesanāya tathākiṇṇāpattikkhandhāva veditabbā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Kathinaṃ yassa cattāro, sahajā samayadvayaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Channaṃ sikkhāpadānañca, ekadesavinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kathina"
      },
      "nti ‘‘saṅghassa anumodanāya, gaṇassa anumodanāya, puggalassa atthārā saṅghassa atthataṃ hoti kathina’’nti (pari. 414) vacanato tesaṃyeva anumodanādidhammānaṃ saṅgaho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kathinaṃ"
      },
      " nāma. Yathāha ‘‘kathinaṃ jānitabbanti tesaññeva dhammānaṃ saṅgaho samavāyo nāmaṃ nāmakamma’’ntiādi (pari. 412). Tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kathina"
      },
      "nti idaṃ bahūsu dhammesu nāmamattaṃ, na paramatthato eko dhammo. Ko panassa atthāroti? Tadekadesova khīrassa dhārā viya. Yathā cāha ‘‘atthāro ekena dhammena saṅgahito vacībhedenā’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahajā"
      },
      " nāma aṭṭha mātikā, dve palibodhā, pañcānisaṃsāti ime pannarasa dhammā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samayadvayaṃ"
      },
      " nāma kathinatthārasamayo, cīvarasamayo cāti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kathinatthārasamayo"
      },
      " vassānassa pacchimo māso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cīvarasamayo"
      },
      " nāma anatthate kathine ayaṃ kattikamāso, atthate cattāro hemantikā cāti pañca māsā."
    ],
    "innerText": "Tattha kathinanti ‘‘saṅghassa anumodanāya, gaṇassa anumodanāya, puggalassa atthārā saṅghassa atthataṃ hoti kathina’’nti (pari. 414) vacanato tesaṃyeva anumodanādidhammānaṃ saṅgaho kathinaṃ nāma. Yathāha ‘‘kathinaṃ jānitabbanti tesaññeva dhammānaṃ saṅgaho samavāyo nāmaṃ nāmakamma’’ntiādi (pari. 412). Tasmā kathinanti idaṃ bahūsu dhammesu nāmamattaṃ, na paramatthato eko dhammo. Ko panassa atthāroti? Tadekadesova khīrassa dhārā viya. Yathā cāha ‘‘atthāro ekena dhammena saṅgahito vacībhedenā’’ti. Sahajā nāma aṭṭha mātikā, dve palibodhā, pañcānisaṃsāti ime pannarasa dhammā. Samayadvayaṃ nāma kathinatthārasamayo, cīvarasamayo cāti. Tattha kathinatthārasamayo vassānassa pacchimo māso. Cīvarasamayo nāma anatthate kathine ayaṃ kattikamāso, atthate cattāro hemantikā cāti pañca māsā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aṭṭha mātikā"
      },
      " nāma pakkamanantikādayo. Tā sabbāpi atthārena ekato uppajjanti nāma. Tabbhāvabhāvitāya atthāre sati uddhāro sambhavati. Tattha kathinatthārena ekuppādā ",
      " ekanirodhā antarubbhāro sahubbhāro, avasesā kathinubbhārā ekuppādā, nānānirodhā ca. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekanirodhā"
      },
      "ti atthārena saha nirodhā, antarubbhārasahubbhārānaṃ uddhārābhāvo ekakkhaṇe hotīti attho. Sesā nānā nirujjhanti nāma. Tesu hi uddhārabhāvaṃ pattesupi atthāro tiṭṭhati evāti aṭṭhakathāyaṃ atthavibhāvanā. Sace atthate kathine bhikkhusmiṃ sāpekkhe ",
      " tamhā āvāsā pakkamante saṅgho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "antarubbhāraṃ"
      },
      " karoti, tassa bhikkhuno paṭhamameva mūlāvāse niṭṭhitacīvarapalibodhābhāvepi sati antarubbhāre palibodho chijjati satipi sāpekkhatāya saussāhattā. Iminā pariyāyena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pakkamanantiko kathinuddhāro"
      },
      " atthārena ekuppādo nānānirodho hoti. Tathā antarubbhāre sati suṇantassāpi yāva cīvaraniṭṭhānaṃ na gacchati, tāva parihārasambhavato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "niṭṭhānantiko"
      },
      ". Yāva sanniṭṭhānaṃ na gacchati, tāva parihārasambhavato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sanniṭṭhānantiko"
      },
      ". Yāva na nassati, tāva parihārasambhavato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nāsanantiko"
      },
      ". Yāva na suṇāti, tāva parihārasambhavato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "savanantiko"
      },
      ". Yāva cīvarāsā na chijjati, tāva parihārasambhavato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āsāvacchediko"
      },
      ". Yāva sīmaṃ nātikkamati, tāva parihārasambhavato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sīmātikkantiko"
      },
      ". Atthārena ekuppādo nānānirodho hotīti veditabbo."
    ],
    "innerText": "Tattha aṭṭha mātikā nāma pakkamanantikādayo. Tā sabbāpi atthārena ekato uppajjanti nāma. Tabbhāvabhāvitāya atthāre sati uddhāro sambhavati. Tattha kathinatthārena ekuppādā ekanirodhā antarubbhāro sahubbhāro, avasesā kathinubbhārā ekuppādā, nānānirodhā ca. Tattha ekanirodhāti atthārena saha nirodhā, antarubbhārasahubbhārānaṃ uddhārābhāvo ekakkhaṇe hotīti attho. Sesā nānā nirujjhanti nāma. Tesu hi uddhārabhāvaṃ pattesupi atthāro tiṭṭhati evāti aṭṭhakathāyaṃ atthavibhāvanā. Sace atthate kathine bhikkhusmiṃ sāpekkhe tamhā āvāsā pakkamante saṅgho antarubbhāraṃ karoti, tassa bhikkhuno paṭhamameva mūlāvāse niṭṭhitacīvarapalibodhābhāvepi sati antarubbhāre palibodho chijjati satipi sāpekkhatāya saussāhattā. Iminā pariyāyena pakkamanantiko kathinuddhāro atthārena ekuppādo nānānirodho hoti. Tathā antarubbhāre sati suṇantassāpi yāva cīvaraniṭṭhānaṃ na gacchati, tāva parihārasambhavato niṭṭhānantiko. Yāva sanniṭṭhānaṃ na gacchati, tāva parihārasambhavato sanniṭṭhānantiko. Yāva na nassati, tāva parihārasambhavato nāsanantiko. Yāva na suṇāti, tāva parihārasambhavato savanantiko. Yāva cīvarāsā na chijjati, tāva parihārasambhavato āsāvacchediko. Yāva sīmaṃ nātikkamati, tāva parihārasambhavato sīmātikkantiko. Atthārena ekuppādo nānānirodho hotīti veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tattha antarubbhārasahubbhārā dve antosīmāyaṃ eva sambhavanti, na bahisīmāyaṃ. Pakkamanasavanasīmātikkantikā bahisīmāyameva sambhavanti, na antosīmāyaṃ. Niṭṭhānasaaāṭṭhānāsāvacchedikā antosīmāyañceva bahisīmāyañca. Antarubbhāro saṅghāyatto, pakkamananiṭṭhānasanniṭṭhānasīmātikkantikā puggalādhīnā, sesā tadubhayaviparītā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘niṭṭhitacīvarasmi’’"
      },
      "nti iminā cīvarapalibodhābhāvameva dīpeti. Na āvāsapalibodhābhāvaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Ubbhatasmiṃ kathine’’"
      },
      "ti iminā ubhayapalibodhābhāvaṃ dīpeti, tasmā ubhayapalibodhābhāvadīpanatthaṃ tadeva vattabbanti ce? Na, visesattā. Kathaṃ? Kāmañcetaṃ tasmā ‘‘ubbhatasmiṃ kathine’’ti kesañci kathinuddhārānaṃ nānānirodhattā, saṅghapuggalādhīnānadhīnattā ca antobahiubhayasīmāsu niyamāniyamato ca ubbhatasmiṃ kathine saṅghassa, na puggalassa ubbhataṃ hoti, tathāpi ‘‘ubbhatasmiṃ kathine’’ti idaṃ sāmaññavacanaṃ. Tasmā ‘‘niṭṭhitacīvarasmi’’nti iminā niyameti."
    ],
    "innerText": "Tattha ‘‘niṭṭhitacīvarasmi’’nti iminā cīvarapalibodhābhāvameva dīpeti. Na āvāsapalibodhābhāvaṃ. ‘‘Ubbhatasmiṃ kathine’’ti iminā ubhayapalibodhābhāvaṃ dīpeti, tasmā ubhayapalibodhābhāvadīpanatthaṃ tadeva vattabbanti ce? Na, visesattā. Kathaṃ? Kāmañcetaṃ tasmā ‘‘ubbhatasmiṃ kathine’’ti kesañci kathinuddhārānaṃ nānānirodhattā, saṅghapuggalādhīnānadhīnattā ca antobahiubhayasīmāsu niyamāniyamato ca ubbhatasmiṃ kathine saṅghassa, na puggalassa ubbhataṃ hoti, tathāpi ‘‘ubbhatasmiṃ kathine’’ti idaṃ sāmaññavacanaṃ. Tasmā ‘‘niṭṭhitacīvarasmi’’nti iminā niyameti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kiṃ vuttaṃ hoti – saṅghassa antarubbhārena ubbhatasmiṃ kathine acchinnacīvarapalibodho bahisīmāgato pacchā gantvā attano sīmāgato aniṭṭhitacīvaro ānisaṃsaṃ labhati evāti katvā ‘‘niṭṭhitacīvarasmi’’nti vuttanti veditabbaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āvāsapalibodho"
      },
      " nāma vasati vā tasmiṃ ",
      " āvāse, sāpekkho vā pakkamati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cīvarapalibodho"
      },
      " nāma cīvaraṃ akataṃ ",
      " vippakataṃ, cīvarāsānupacchinnā, tabbiparītena apalibodho veditabbo. Tattha anatthatakathinānaṃ cīvarakālasamaye niyamato cattāro ānisaṃsā labbhanti, asamādānacāro aniyamato. Tena sāsaṅkasikkhāpadaṃ vuttaṃ. Kathaṃ cattāro niyatāti ce? ‘‘Cīvarakālasamayo nāma anatthate kathine vassānassa pacchimo māso’’ti (pārā. 649) vacanato anatthatakathinānaṃ tasmiṃ māse yāvadatthacīvaraṃ siddhaṃ, tathā tatiyakathinasikkhāpade (pārā. 497 ādayo) akālacīvaraṃ nāma piṭṭhisamayato paṭṭhāya taṃ paṭiggahetvā saṅghato labhitabbaṃ ce, yāva cīvarakālasamayaṃ nikkhipitvā bhājetvā gahetabbaṃ. Puggalikaṃ ce, vassānassa chaṭṭhapakkhassa pañcamito paṭṭhāya yāva cīvarakālasamayaṃ anadhiṭṭhitaṃ avikappitaṃ vaṭṭati accekacīvarasikkhāpadena anuññātattā, na tato paraṃ. Tadā uppannacīvarassa paṭisiddhattā paṭhamakathinena. Tattha aṭṭhakathāyaṃ vuttanayo saṅghikaṃ sandhāya, tathā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "porāṇagaṇṭhipade"
      },
      " cāti veditabbaṃ."
    ],
    "innerText": "Kiṃ vuttaṃ hoti – saṅghassa antarubbhārena ubbhatasmiṃ kathine acchinnacīvarapalibodho bahisīmāgato pacchā gantvā attano sīmāgato aniṭṭhitacīvaro ānisaṃsaṃ labhati evāti katvā ‘‘niṭṭhitacīvarasmi’’nti vuttanti veditabbaṃ. Tattha āvāsapalibodho nāma vasati vā tasmiṃ āvāse, sāpekkho vā pakkamati. Cīvarapalibodho nāma cīvaraṃ akataṃ vippakataṃ, cīvarāsānupacchinnā, tabbiparītena apalibodho veditabbo. Tattha anatthatakathinānaṃ cīvarakālasamaye niyamato cattāro ānisaṃsā labbhanti, asamādānacāro aniyamato. Tena sāsaṅkasikkhāpadaṃ vuttaṃ. Kathaṃ cattāro niyatāti ce? ‘‘Cīvarakālasamayo nāma anatthate kathine vassānassa pacchimo māso’’ti (pārā. 649) vacanato anatthatakathinānaṃ tasmiṃ māse yāvadatthacīvaraṃ siddhaṃ, tathā tatiyakathinasikkhāpade (pārā. 497 ādayo) akālacīvaraṃ nāma piṭṭhisamayato paṭṭhāya taṃ paṭiggahetvā saṅghato labhitabbaṃ ce, yāva cīvarakālasamayaṃ nikkhipitvā bhājetvā gahetabbaṃ. Puggalikaṃ ce, vassānassa chaṭṭhapakkhassa pañcamito paṭṭhāya yāva cīvarakālasamayaṃ anadhiṭṭhitaṃ avikappitaṃ vaṭṭati accekacīvarasikkhāpadena anuññātattā, na tato paraṃ. Tadā uppannacīvarassa paṭisiddhattā paṭhamakathinena. Tattha aṭṭhakathāyaṃ vuttanayo saṅghikaṃ sandhāya, tathā porāṇagaṇṭhipade cāti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Paṭhamakathine (pārā. 459 ādayo) paṭhamapaññattiyā, avisesena vā ekādasame divase āpatti. Vassānassa hi antonivāraṇatthaṃ aṭṭhakathāya ‘‘niṭṭhitacīvarasmiṃ bhikkhunā ubbhatasmiṃ kathine’’ti (pārā. 462 ādayo) vuttaṃ. Eseva nayo dutiye, tatiye ca. Tena cīvarakālato pure vā anto vā uppannaṃ cīvarakālato uddhaṃ ekadivasampi parihāraṃ na labhati. Yadi labheyya, accekacīvarasikkhāpadavirodho. ‘‘Yāva cīvarakālasamayaṃ nikkhipitabbaṃ, tato ce uttari nikkhipeyya, nissaggiya’’nti (pārā. 648) hi tattha vuttaṃ. Vassāvāsikabhāvena saṅghato laddhaṃ vuṭṭhavassattā attano santakabhūtaṃ accekacīvaraṃ cīvarakālasamayaṃ atikkāmayato eva āpatti, na accekacīvarakālaṃ atikkāmayato āpattīti. ‘‘Anatthate kathine ekādasamāse uppanna’’nti (pārā. 500) vacanato yo ca tattha cīvaruppādo, so ca nesaṃ bhavissatīti siddhaṃ, anāmantacāragaṇabhojanasikkhāpade ‘‘aññatra samayā’’ti (pāci. 222 ādayo) vuttattā sesadvayaṃ siddhameva. Tasmā ‘‘kālepi ādissa dinnaṃ, etaṃ akālacīvara’’nti (pārā. 500) vacanato ādissa dinnacīvaraṃ parihāraṃ na labhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aparakattikāyameva vā ubbhatasmiṃ kathine labhati, evaṃ ‘‘ubbhatasmiṃ kathine’’ti vuttattāti ce? Na vattabbaṃ. Cha ṭhānāni hi sāpekkhatāya vuttāni ",
      ". Duṭṭhadosadvaye adhikaraṇacatutthaṃ, paṭhamāniyate sotassa raho, tatiyakathine ādissa dinnaṃ cīvaraṃ, accekacīvarasikkhāpade ",
      " ‘‘saññāṇaṃ katvā nikkhipitabba’’nti padaṃ, duṭṭhullārocanappaṭicchādanadvaye adhikaraṇaṃ, pārājikavacanañca, tīsu kathinasikkhāpadesu ‘‘aṭṭhannaṃ mātikānaṃ aññatarāyā’’ti vacananti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ādissa dinnaṃ cīvaraṃ"
      },
      " saṅghikaṃ bhājitabbacīvaraṃ sandhāya vuttaṃ, na puggalikaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saññāṇaṃ katvā nikkhipitabba"
      },
      "nti vassāvāsikacīvaraṃ sandhāya vuttaṃ. Avuṭṭhavassena pacchā dātabbattā saññāṇaṃ kātabbaṃ, na ñātippavāritato laddhaṃ puggalikaṃ sandhāya. Tasmā duvidhaṃ accekacīvaraṃ saṅghe ninnaṃ, puggale ninnañcāti siddhaṃ. Tattha saṅghe pariṇataṃ accekacīvaraṃ vassūpanāyikadivasato paṭṭhāya, piṭṭhisamayato paṭṭhāya vā yāva pavāraṇā nikkhipituṃ vaṭṭati eva saṅghikattā, puggalikampi ‘‘vassaṃvuṭṭhakāle gaṇhathā’’ti dinnattā. Tādisañhi yāva vassaṃvuṭṭho na hoti, tāva tasseva dāyakassa santakaṃ hoti. Ettako visesahetu."
    ],
    "innerText": "Aparakattikāyameva vā ubbhatasmiṃ kathine labhati, evaṃ ‘‘ubbhatasmiṃ kathine’’ti vuttattāti ce? Na vattabbaṃ. Cha ṭhānāni hi sāpekkhatāya vuttāni . Duṭṭhadosadvaye adhikaraṇacatutthaṃ, paṭhamāniyate sotassa raho, tatiyakathine ādissa dinnaṃ cīvaraṃ, accekacīvarasikkhāpade ‘‘saññāṇaṃ katvā nikkhipitabba’’nti padaṃ, duṭṭhullārocanappaṭicchādanadvaye adhikaraṇaṃ, pārājikavacanañca, tīsu kathinasikkhāpadesu ‘‘aṭṭhannaṃ mātikānaṃ aññatarāyā’’ti vacananti. Tattha ādissa dinnaṃ cīvaraṃ saṅghikaṃ bhājitabbacīvaraṃ sandhāya vuttaṃ, na puggalikaṃ. Saññāṇaṃ katvā nikkhipitabbanti vassāvāsikacīvaraṃ sandhāya vuttaṃ. Avuṭṭhavassena pacchā dātabbattā saññāṇaṃ kātabbaṃ, na ñātippavāritato laddhaṃ puggalikaṃ sandhāya. Tasmā duvidhaṃ accekacīvaraṃ saṅghe ninnaṃ, puggale ninnañcāti siddhaṃ. Tattha saṅghe pariṇataṃ accekacīvaraṃ vassūpanāyikadivasato paṭṭhāya, piṭṭhisamayato paṭṭhāya vā yāva pavāraṇā nikkhipituṃ vaṭṭati eva saṅghikattā, puggalikampi ‘‘vassaṃvuṭṭhakāle gaṇhathā’’ti dinnattā. Tādisañhi yāva vassaṃvuṭṭho na hoti, tāva tasseva dāyakassa santakaṃ hoti. Ettako visesahetu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Anaccekacīvare anaccekacīvarasaññī cīvarakālasamayaṃ atikkāmeti, anāpattī’’ti vacanato accekacīvarakasseva so aparādho. Yena ‘‘virodho’’ti vacanaṃ dasseyyāti na vinaye visesahetu pariyesitabbo. Buddhavisayattā pamāṇanti ce? Na, yadi evaṃ ettha attano santakabhūtampi accekacīvaraṃ saññāṇaṃ katvā nikkhipitabbameva, na adhiṭṭhātabbaṃ na vikappetabbaṃ na vissajjetabbaṃ. Tato ‘‘anāpatti, antosamaye adhiṭṭheti vikappeti vissajjetī’’tiādivacanavirodho (pārā. 651) adhivāsetabbo siyā. Tathā ‘‘vassānassa pacchime māse kathinuddhāre kate tasmiṃ māse atthate kathine kathinuddhāradivasaṃ atikkāmeti, nissaggiyaṃ hotī’’ti vacanato nissaggiyaṃ hotīti ayampi atthavirodho adhivāsetabbo siyā. Tasmiñca ‘‘anaccekacīvare anāpattī’’ti vuttaṃ, tañca anadhiṭṭhitaṃ avikappitamevāti ettako visesahetu. Atirekacīvarañcetaṃ paṭhamasikkhāpadenāpatti, itaraṃ ce anāpattiyevāti imassa atthassa ayaṃ bhagavato visesahetu. Tathā atirekadasāhānāgatāyeva kattikapuṇṇamāya saṅghassa vassāvāsikatthaṃ accekacīvaraṃ viya dadamānaṃ na ",
      " gahetabbaṃ, dasāhānāgatāya eva gahetabbanti ettako visesahetu. Tato aṭṭhakathānayavirodho ca adhivāsetabbo siyā. Tattha ‘‘adhiṭṭhitato paṭṭhāya uppannaṃ accekacīvaraṃ na hotī’’ti vatvā aññathā nayo dassito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Porāṇagaṇṭhipade"
      },
      " so ca nayo saṅghikaṃ upādāya vuttattā na virujjhatīti neva so ca paṭikkhitto. Yathā anaccekacīvaraṃ chaṭṭhito paṭṭhāya uppannaṃ atirekadasāhānāgatāyapi paṭiggahetabbaṃ, paṭiggahetvā cīvarakālasamayaṃ atikkāmayatopi anāpattīti ayampi nayo adhivāsetabbo siyā. Tato paṭhamakathinavirodho. Dasāhānāgatāya eva paṭiggahetabbaṃ, paṭiggahetvā ",
      " cīvarakālasamayaṃ atikkāmayato anāpattīti ce, taṃ dve dasāhe labhatīti ettako visesahetu."
    ],
    "innerText": "‘‘Anaccekacīvare anaccekacīvarasaññī cīvarakālasamayaṃ atikkāmeti, anāpattī’’ti vacanato accekacīvarakasseva so aparādho. Yena ‘‘virodho’’ti vacanaṃ dasseyyāti na vinaye visesahetu pariyesitabbo. Buddhavisayattā pamāṇanti ce? Na, yadi evaṃ ettha attano santakabhūtampi accekacīvaraṃ saññāṇaṃ katvā nikkhipitabbameva, na adhiṭṭhātabbaṃ na vikappetabbaṃ na vissajjetabbaṃ. Tato ‘‘anāpatti, antosamaye adhiṭṭheti vikappeti vissajjetī’’tiādivacanavirodho (pārā. 651) adhivāsetabbo siyā. Tathā ‘‘vassānassa pacchime māse kathinuddhāre kate tasmiṃ māse atthate kathine kathinuddhāradivasaṃ atikkāmeti, nissaggiyaṃ hotī’’ti vacanato nissaggiyaṃ hotīti ayampi atthavirodho adhivāsetabbo siyā. Tasmiñca ‘‘anaccekacīvare anāpattī’’ti vuttaṃ, tañca anadhiṭṭhitaṃ avikappitamevāti ettako visesahetu. Atirekacīvarañcetaṃ paṭhamasikkhāpadenāpatti, itaraṃ ce anāpattiyevāti imassa atthassa ayaṃ bhagavato visesahetu. Tathā atirekadasāhānāgatāyeva kattikapuṇṇamāya saṅghassa vassāvāsikatthaṃ accekacīvaraṃ viya dadamānaṃ na gahetabbaṃ, dasāhānāgatāya eva gahetabbanti ettako visesahetu. Tato aṭṭhakathānayavirodho ca adhivāsetabbo siyā. Tattha ‘‘adhiṭṭhitato paṭṭhāya uppannaṃ accekacīvaraṃ na hotī’’ti vatvā aññathā nayo dassito. Porāṇagaṇṭhipade so ca nayo saṅghikaṃ upādāya vuttattā na virujjhatīti neva so ca paṭikkhitto. Yathā anaccekacīvaraṃ chaṭṭhito paṭṭhāya uppannaṃ atirekadasāhānāgatāyapi paṭiggahetabbaṃ, paṭiggahetvā cīvarakālasamayaṃ atikkāmayatopi anāpattīti ayampi nayo adhivāsetabbo siyā. Tato paṭhamakathinavirodho. Dasāhānāgatāya eva paṭiggahetabbaṃ, paṭiggahetvā cīvarakālasamayaṃ atikkāmayato anāpattīti ce, taṃ dve dasāhe labhatīti ettako visesahetu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Antarā anāpattikkhettacīvarakālappaviṭṭhattā adhiṭṭhahitvā paccuddhaṭaṃ viya taṃ punapi dasāhe labhatīti ce? Na, kālappaveso adhiṭṭhānaṃ viya hotīti ce? Na, ‘‘vassikasāṭikaṃ vassānaṃ cātumāsaṃ adhiṭṭhātuṃ, tato paraṃ vikappetu’’nti vacanavirodhaṃ katvā, tato paraṃ dasāhaṃ avikappentassāpi anāpatti siyā. Apica yaṃ vuttaṃ aṭṭhakathāyaṃ ‘‘vassikasāṭikā antovasse laddhā ceva niṭṭhitā ca, antodasāhe adhiṭṭhātabbā, dasāhātikkame niṭṭhitā, tadaheva adhiṭṭhātabbā, dasāhe appahonte cīvarakālaṃ nātikkāmetabbā’’ti (pārā. aṭṭha. 2.630). Tena āpattito na mucceyya. Kālappaveso hi adhiṭṭhānapariyāyo na jātoti. Ettāvatā yathāvutto atthavikappo pāḷinayeneva patiṭṭhāpito hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Apicettha yaṃ vuttaṃ aṭṭhakathāyaṃ ‘‘dasāhe appahonte cīvarakālaṃ nātikkāmetabbā’’ti, tatthapi cīvarakāle uppannaṃ, dasāhe appahonte cassa karaṇaṃ natthi, taṃ accekacīvaraṃ akālacīvaramiva cīvarakālaṃ nātikkāmetabbanti siddhametaṃ. Pāḷito ca tañce antokāle uppajjati, dasāhe appahontepi uppajjati, evaṃ uppannaṃ accekacīvaraṃ accekacīvarameva na hoti. Na hi taṃ kālavisesavasena accekacīvarasaṅkhaṃ gacchati. Vuttañhetaṃ ‘‘accekacīvaraṃ nāma senāya vā gantukāmo hoti, pavāsaṃ vā gantukāmo hoti, gilāno vā hoti, gabbhinī vā hoti ",
      ", assaddhassa vā saddhā uppannā hoti…pe… ‘vassāvāsikaṃ dassāmī’ti evaṃ ārocitaṃ, etaṃ accekacīvaraṃ nāmā’’ti (pārā. 649). Tasmā yathā taṃ cīvaraṃ nātikkāmetabbaṃ, tathā anaccekacīvarampīti siddhaṃ hoti. Tena vuttaṃ aṭṭhakathāyaṃ ‘‘dasāhe appahonte cīvarakālaṃ nātikkāmetabbā’’ti. Apica yadi evaṃ taṃ accekacīvarasikkhāpadameva accekacīvaraṃ cīvarakālaṃ nātikkāmetabbanti imassa pana atthavisesassa dassanatthaṃ bhagavatā paññattaṃ."
    ],
    "innerText": "Apicettha yaṃ vuttaṃ aṭṭhakathāyaṃ ‘‘dasāhe appahonte cīvarakālaṃ nātikkāmetabbā’’ti, tatthapi cīvarakāle uppannaṃ, dasāhe appahonte cassa karaṇaṃ natthi, taṃ accekacīvaraṃ akālacīvaramiva cīvarakālaṃ nātikkāmetabbanti siddhametaṃ. Pāḷito ca tañce antokāle uppajjati, dasāhe appahontepi uppajjati, evaṃ uppannaṃ accekacīvaraṃ accekacīvarameva na hoti. Na hi taṃ kālavisesavasena accekacīvarasaṅkhaṃ gacchati. Vuttañhetaṃ ‘‘accekacīvaraṃ nāma senāya vā gantukāmo hoti, pavāsaṃ vā gantukāmo hoti, gilāno vā hoti, gabbhinī vā hoti , assaddhassa vā saddhā uppannā hoti…pe… ‘vassāvāsikaṃ dassāmī’ti evaṃ ārocitaṃ, etaṃ accekacīvaraṃ nāmā’’ti (pārā. 649). Tasmā yathā taṃ cīvaraṃ nātikkāmetabbaṃ, tathā anaccekacīvarampīti siddhaṃ hoti. Tena vuttaṃ aṭṭhakathāyaṃ ‘‘dasāhe appahonte cīvarakālaṃ nātikkāmetabbā’’ti. Apica yadi evaṃ taṃ accekacīvarasikkhāpadameva accekacīvaraṃ cīvarakālaṃ nātikkāmetabbanti imassa pana atthavisesassa dassanatthaṃ bhagavatā paññattaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahāaṭṭhakathāyaṃ"
      },
      " pana taṃ evaṃ vuttaṃ – kāmañcedaṃ ‘‘dasāhaparamaṃ atirekacīvaraṃ dhāretabba’’nti iminā siddhaṃ, aṭṭhuppattivasena pana apubbaṃ viya atthaṃ dassetvā sikkhāpadaṃ ṭhapitanti atthavisesadīpanapayojanato. Tasmā taṃ tassa atthavisesadassanatthaṃ vuttanti siddhameva. Tasmāpi veditabbameva yaṃ kiñci cīvaraṃ cīvarakālasamayaṃ nātikkāmetabbanti. Apica yaṃ vuttaṃ aṭṭhakathāyaṃ ‘‘chaṭṭhito paṭṭhāya pana uppannaṃ anaccekacīvarampi paccuddhāretvā ṭhapitacīvarampi ",
      " etaṃ parihāraṃ labhatī’’ti (pārā. aṭṭha. 2.646-649). Tena ‘‘anaccekacīvare anaccekacīvarasaññī cīvarakālasamayaṃ atikkāmeti, anāpattī’’ti (pārā. 650) imināpi anaccekacīvarassāpi accekacīvaraparihāralābhaṃ dīpetīti."
    ],
    "innerText": "Mahāaṭṭhakathāyaṃ pana taṃ evaṃ vuttaṃ – kāmañcedaṃ ‘‘dasāhaparamaṃ atirekacīvaraṃ dhāretabba’’nti iminā siddhaṃ, aṭṭhuppattivasena pana apubbaṃ viya atthaṃ dassetvā sikkhāpadaṃ ṭhapitanti atthavisesadīpanapayojanato. Tasmā taṃ tassa atthavisesadassanatthaṃ vuttanti siddhameva. Tasmāpi veditabbameva yaṃ kiñci cīvaraṃ cīvarakālasamayaṃ nātikkāmetabbanti. Apica yaṃ vuttaṃ aṭṭhakathāyaṃ ‘‘chaṭṭhito paṭṭhāya pana uppannaṃ anaccekacīvarampi paccuddhāretvā ṭhapitacīvarampi etaṃ parihāraṃ labhatī’’ti (pārā. aṭṭha. 2.646-649). Tena ‘‘anaccekacīvare anaccekacīvarasaññī cīvarakālasamayaṃ atikkāmeti, anāpattī’’ti (pārā. 650) imināpi anaccekacīvarassāpi accekacīvaraparihāralābhaṃ dīpetīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ettāvatā yathāvutto dutiyo atthavikappo pāḷinayena, aṭṭhakathānayena ca patiṭṭhāpito hoti. Evaṃ tāva pakiṇṇakāya adhikathā parato pāṭhato vitthāritā hotīti apakiṇṇakaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Cīvarapalibodho, āvāsapalibodho cāti dve palibodhā. Tesu ekapalibodhepi sati anāmantacārādiānisaṃsaṃ labhati, taṃ idha natthīti dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘niṭṭhitacīvarasmiṃ bhikkhunā ubbhatasmiṃ kathine’’"
      },
      "ti vuttaṃ. Tasmā eva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘atthatakathinassa hi bhikkhuno’’"
      },
      "tiādi vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kathinatthārārahassā"
      },
      "ti ettha ‘‘aṭṭhahi aṅgehi samannāgato puggalo bhabbo kathinaṃ attharituṃ – pubbakaraṇaṃ jānāti, paccuddhāraṃ jānāti, adhiṭṭhānaṃ jānāti, atthāraṃ jānāti, mātikaṃ jānāti, palibodhaṃ jānāti, uddhāraṃ jānāti, ānisaṃsaṃ jānātī’’ti (pari. 409) vacanato imehi aṭṭhahi aṅgehi samannāgato puggalo kathinatthārāraho nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pubbakaraṇaṃ"
      },
      " nāma dhovanavicāraṇacchedanasibbanarajanakappakaraṇaṃ."
    ],
    "innerText": "Cīvarapalibodho, āvāsapalibodho cāti dve palibodhā. Tesu ekapalibodhepi sati anāmantacārādiānisaṃsaṃ labhati, taṃ idha natthīti dassetuṃ ‘‘niṭṭhitacīvarasmiṃ bhikkhunā ubbhatasmiṃ kathine’’ti vuttaṃ. Tasmā eva ‘‘atthatakathinassa hi bhikkhuno’’tiādi vuttaṃ. Kathinatthārārahassāti ettha ‘‘aṭṭhahi aṅgehi samannāgato puggalo bhabbo kathinaṃ attharituṃ – pubbakaraṇaṃ jānāti, paccuddhāraṃ jānāti, adhiṭṭhānaṃ jānāti, atthāraṃ jānāti, mātikaṃ jānāti, palibodhaṃ jānāti, uddhāraṃ jānāti, ānisaṃsaṃ jānātī’’ti (pari. 409) vacanato imehi aṭṭhahi aṅgehi samannāgato puggalo kathinatthārāraho nāma. Pubbakaraṇaṃ nāma dhovanavicāraṇacchedanasibbanarajanakappakaraṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Cīvaraṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nāma khoma’’"
      },
      "ntiādinā pāḷivasena jātiñca pamāṇañca dassetvā idāni atirekacīvaraṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yaṃ pana vuttaṃ adhiṭṭhitavikappitesū’’"
      },
      "tiādi vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ṭhapitaṭṭhānaṃ sallakkhetvā’’"
      },
      "ti vuttepi yasmiṃ ṭhāne yaṃ ṭhapitaṃ, tasmiṃ taṃ pacchā hotu vā, mā vā, adhiṭṭhānaṃ ruhateva. Pure pacchā ṭhapanaṭṭhānaṃ na pamāṇaṃ."
    ],
    "innerText": "‘‘Cīvaraṃnāma khoma’’ntiādinā pāḷivasena jātiñca pamāṇañca dassetvā idāni atirekacīvaraṃ dassetuṃ ‘‘yaṃ pana vuttaṃ adhiṭṭhitavikappitesū’’tiādi vuttaṃ. Ṭhapitaṭṭhānaṃ sallakkhetvā’’ti vuttepi yasmiṃ ṭhāne yaṃ ṭhapitaṃ, tasmiṃ taṃ pacchā hotu vā, mā vā, adhiṭṭhānaṃ ruhateva. Pure pacchā ṭhapanaṭṭhānaṃ na pamāṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Antimavatthuṃ ajjhāpannassa bhikkhubhāvapariccāgavasena setavatthanivāsanaṃ vā kāsāvacajanaṃ vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hīnāyāvattanaṃ"
      },
      "."
    ],
    "innerText": "Antimavatthuṃ ajjhāpannassa bhikkhubhāvapariccāgavasena setavatthanivāsanaṃ vā kāsāvacajanaṃ vā hīnāyāvattanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekādasame aruṇuggamane"
      },
      "ti antimaṃ ṭhapetvā tato purimatarasminti attho veditabbo. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "antimaṃ"
      },
      " nāma aparakattikāya paṭhamāruṇuggamanaṃ. Tañhi kālattā nissaggiyaṃ na karoti. Idha ‘‘niṭṭhitacīvarasmiṃ bhikkhunā’’ti karaṇavacanaṃ nidānānapekkhaṃ nidāne karaṇābhāvato. Tasmā eva ‘‘dasāhaparama’’nti ayamettha anupaññattīti vuttaṃ. ‘‘Anujānāmi, bhikkhave, ticīvaraṃ adhiṭṭhātuṃ na vikappetu’’ntiādi (mahāva. 358) vacanato ca idha ‘‘vikappetī’’ti avisesena vuttavacanaṃ viruddhaṃ viya dissati, na ca viruddhaṃ tathāgatā bhāsanti, ",
      " tasmā evamassa attho veditabbo – ticīvaraṃ ticīvarasaṅkhepena parihārato adhiṭṭhātumeva anujānāmi, na vikappetuṃ. Vassikasāṭikaṃ pana catumāsato paraṃ vikappetumeva, na adhiṭṭhātunti. Evañca pana sati yo ticīvare ekena cīvarena vippavasitukāmo hoti, tassa ticīvarādhiṭṭhānaṃ paccuddharitvā vippavāsasukhatthaṃ vikappanāya okāso dinno hoti, dasāhātikkame ca anāpattīti. Etena upāyena sabbattha vikappanāya apaṭisiddhabhāvo veditabboti likhitaṃ."
    ],
    "innerText": "Ekādasame aruṇuggamaneti antimaṃ ṭhapetvā tato purimatarasminti attho veditabbo. Tattha antimaṃ nāma aparakattikāya paṭhamāruṇuggamanaṃ. Tañhi kālattā nissaggiyaṃ na karoti. Idha ‘‘niṭṭhitacīvarasmiṃ bhikkhunā’’ti karaṇavacanaṃ nidānānapekkhaṃ nidāne karaṇābhāvato. Tasmā eva ‘‘dasāhaparama’’nti ayamettha anupaññattīti vuttaṃ. ‘‘Anujānāmi, bhikkhave, ticīvaraṃ adhiṭṭhātuṃ na vikappetu’’ntiādi (mahāva. 358) vacanato ca idha ‘‘vikappetī’’ti avisesena vuttavacanaṃ viruddhaṃ viya dissati, na ca viruddhaṃ tathāgatā bhāsanti, tasmā evamassa attho veditabbo – ticīvaraṃ ticīvarasaṅkhepena parihārato adhiṭṭhātumeva anujānāmi, na vikappetuṃ. Vassikasāṭikaṃ pana catumāsato paraṃ vikappetumeva, na adhiṭṭhātunti. Evañca pana sati yo ticīvare ekena cīvarena vippavasitukāmo hoti, tassa ticīvarādhiṭṭhānaṃ paccuddharitvā vippavāsasukhatthaṃ vikappanāya okāso dinno hoti, dasāhātikkame ca anāpattīti. Etena upāyena sabbattha vikappanāya apaṭisiddhabhāvo veditabboti likhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Imassa pana sikkhāpadassa ayaṃ saṅkhepavinicchayo – anatthate kathine hemantānaṃ paṭhamadivasato paṭṭhāya, atthate kathine gimhānaṃ paṭhamadivasato paṭṭhāya uppannacīvaraṃ sandhāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘niṭṭhitacīvarasmi’’"
      },
      "ntiādi vuttaṃ. Etthāha – ‘‘rajakehi dhovāpetvā setakaṃ kārāpentassāpi adhiṭṭhānaṃ adhiṭṭhānamevā’’ti (pārā. aṭṭha. 2.465) vacanato arajitepi adhiṭṭhānaṃ ruhatīti. Tena sūcikammaṃ katvā rajitvā kappabinduṃ datvā adhiṭṭhātabbanti niyamo kātabbo, na kātabboti? Kattabbova. Patto viya adhiṭṭhito yathā puna setabhāvaṃ vā tambabhāvaṃ vā patto adhiṭṭhānaṃ na vijahati, na ca pana tādiso ",
      " yaṃ adhiṭṭhānaṃ upagacchati, evametaṃ daṭṭhabbanti. ‘‘Sve kathinaṃ uddharissatī’’ti laddhacīvaraṃ sace ajjeva na adhiṭṭhāti, aruṇuggamane eva nissaggiyaṃ hoti. Kasmā? ‘‘Niṭṭhitacīvarasmi’’ntiādinā (pārā. 462-463;) sikkhāpadassa vuttattā. Kathinabbhantare dasāhato uttaripi parihāraṃ labhati, kathinato pana pacchā ekadivasampi na labhati. Yathā kiṃ – yathā atthatakathino saṅgho ticīvaraṃ atthatadivasato paṭṭhāya yāva ubbhārā ānisaṃsaṃ labhati, na tato paraṃ, evaṃ atthatadivasato paṭṭhāya yāva ubbhārā labhati, uddhate pana kathine ekadivasampi na labhati. Etthāha – ubbhatadivasato paṭṭhāya puna dasāhaṃ labhatīti? Na, kasmā? ‘‘Anujānāmi, bhikkhave, dasāhaparamaṃ atirekacīvaraṃ dhāretu’’nti vacanato. Kathinabbhantarepi ekādase aruṇuggamane nissaggiyanti āpannaṃ. Taṃ pana atippasaṅgaṃ nivāretuṃ ‘‘niṭṭhitacīvarasmi’’ntiādi vuttaṃ, na kathinadivasāni adivasānīti dīpanatthaṃ. Ayamattho tattha tattha āvibhavissati. Atha vā vassikasāṭikā anatirittappamāṇā nāmaṃ gahetvā vuttanayeneva cattāro vassike māse adhiṭṭhātabbā, tato paraṃ paccuddharitvā vikappetabbāti vuttaṃ. Ettha ‘‘paccuddharitvā’’ti vacane uposathadivase eva paccuddharitvā vikappetvā ṭhapitaṃ hoti, tato paraṃ hemantassa paṭhamadivasato paṭṭhāya paccuddharaṇābhāvā. Evaṃ kathinabbhantare uppannacīvarampi veditabbanti likhitaṃ."
    ],
    "innerText": "Imassa pana sikkhāpadassa ayaṃ saṅkhepavinicchayo – anatthate kathine hemantānaṃ paṭhamadivasato paṭṭhāya, atthate kathine gimhānaṃ paṭhamadivasato paṭṭhāya uppannacīvaraṃ sandhāya ‘‘niṭṭhitacīvarasmi’’ntiādi vuttaṃ. Etthāha – ‘‘rajakehi dhovāpetvā setakaṃ kārāpentassāpi adhiṭṭhānaṃ adhiṭṭhānamevā’’ti (pārā. aṭṭha. 2.465) vacanato arajitepi adhiṭṭhānaṃ ruhatīti. Tena sūcikammaṃ katvā rajitvā kappabinduṃ datvā adhiṭṭhātabbanti niyamo kātabbo, na kātabboti? Kattabbova. Patto viya adhiṭṭhito yathā puna setabhāvaṃ vā tambabhāvaṃ vā patto adhiṭṭhānaṃ na vijahati, na ca pana tādiso yaṃ adhiṭṭhānaṃ upagacchati, evametaṃ daṭṭhabbanti. ‘‘Sve kathinaṃ uddharissatī’’ti laddhacīvaraṃ sace ajjeva na adhiṭṭhāti, aruṇuggamane eva nissaggiyaṃ hoti. Kasmā? ‘‘Niṭṭhitacīvarasmi’’ntiādinā (pārā. 462-463;) sikkhāpadassa vuttattā. Kathinabbhantare dasāhato uttaripi parihāraṃ labhati, kathinato pana pacchā ekadivasampi na labhati. Yathā kiṃ – yathā atthatakathino saṅgho ticīvaraṃ atthatadivasato paṭṭhāya yāva ubbhārā ānisaṃsaṃ labhati, na tato paraṃ, evaṃ atthatadivasato paṭṭhāya yāva ubbhārā labhati, uddhate pana kathine ekadivasampi na labhati. Etthāha – ubbhatadivasato paṭṭhāya puna dasāhaṃ labhatīti? Na, kasmā? ‘‘Anujānāmi, bhikkhave, dasāhaparamaṃ atirekacīvaraṃ dhāretu’’nti vacanato. Kathinabbhantarepi ekādase aruṇuggamane nissaggiyanti āpannaṃ. Taṃ pana atippasaṅgaṃ nivāretuṃ ‘‘niṭṭhitacīvarasmi’’ntiādi vuttaṃ, na kathinadivasāni adivasānīti dīpanatthaṃ. Ayamattho tattha tattha āvibhavissati. Atha vā vassikasāṭikā anatirittappamāṇā nāmaṃ gahetvā vuttanayeneva cattāro vassike māse adhiṭṭhātabbā, tato paraṃ paccuddharitvā vikappetabbāti vuttaṃ. Ettha ‘‘paccuddharitvā’’ti vacane uposathadivase eva paccuddharitvā vikappetvā ṭhapitaṃ hoti, tato paraṃ hemantassa paṭhamadivasato paṭṭhāya paccuddharaṇābhāvā. Evaṃ kathinabbhantare uppannacīvarampi veditabbanti likhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Kathinasikkhāpadavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Udositasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Atthatakathinassa ",
      " pañca māse baddhasīmāyaṃ yattha katthaci cīvaraṃ nikkhipitvā pakkamantassa anāpattī’’ti aṭṭhakathāyaṃ vuttaṃ. ‘‘Abaddhasīmāyapi vaṭṭatī’’ti idaṃ abaddhasīmāyaṃ kathinatthārañca āraññakasikkhāpadañca sādhetīti likhitaṃ. Idāni –"
    ],
    "innerText": "‘‘Atthatakathinassa pañca māse baddhasīmāyaṃ yattha katthaci cīvaraṃ nikkhipitvā pakkamantassa anāpattī’’ti aṭṭhakathāyaṃ vuttaṃ. ‘‘Abaddhasīmāyapi vaṭṭatī’’ti idaṃ abaddhasīmāyaṃ kathinatthārañca āraññakasikkhāpadañca sādhetīti likhitaṃ. Idāni –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Chinnaṃ dhutaṅgaṃ sāsaṅka-sammato santaruttaraṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Acīvarassānāpatti, paccuddhārādisiddhito’’ti. (vajira. ṭī. pārājika 479) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Idaṃ pakiṇṇakaṃ veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatrāyaṃ ",
      " codanāpubbaṅgamavinicchayo – keci ‘‘diguṇaṃ saṅghāṭi’’nti (mahāva. 348) vacanato ‘‘ekaccikā saṅghāṭi nādhiṭṭhātabbā. Sace adhiṭṭhāti, na ruhatī’’ti vatvā upasampadāpekkhānampi diguṇaṃyeva saṅghāṭiṃ datvā upasampādenti, te iminā suttalesena saññāpetabbā. Bhagavatā hi ‘‘chinnakaṃ saṅghāṭiṃ, chinnakaṃ uttarāsaṅgaṃ, chinnakaṃ antaravāsaka’’nti paṭhamaṃ anuññātaṃ. Tato ‘‘aññatarassa bhikkhuno ticīvare kariyamāne sabbaṃ chinnakaṃ nappahoti. Dve chinnakāni ekaṃ achinnakaṃ nappahoti, dve achinnakāni ekaṃ chinnakaṃ nappahotī’’ti imasmiṃ vatthusmiṃ ‘‘anujānāmi, bhikkhave, anvādhikampi āropetu’’nti (mahāva. 360) anuññātaṃ, tasmā ekaccikāpi saṅghāṭi vaṭṭatīti siddhaṃ. Yā chijjamānāpi nappahoti, tassā kuto diguṇatāti? Aṭṭhakathāyampissa vuttaṃ ‘‘anvādhikampi āropetunti āgantukapattampi dātuṃ, idaṃ pana appahonake āropetabbaṃ. Sace pahoti, āgantukapattaṃ na vaṭṭati, chinditabbamevā’’ti (mahāva. aṭṭha. 360). Kathinaṃ pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "chinnakameva"
      },
      " vaṭṭati, āveṇikalakkhaṇattā, ‘‘chinnakaṃ diguṇaṃ nappahotī’’ti vacanābhāvato cāti sanniṭṭhānamettha gantabbanti."
    ],
    "innerText": "Tatrāyaṃ codanāpubbaṅgamavinicchayo – keci ‘‘diguṇaṃ saṅghāṭi’’nti (mahāva. 348) vacanato ‘‘ekaccikā saṅghāṭi nādhiṭṭhātabbā. Sace adhiṭṭhāti, na ruhatī’’ti vatvā upasampadāpekkhānampi diguṇaṃyeva saṅghāṭiṃ datvā upasampādenti, te iminā suttalesena saññāpetabbā. Bhagavatā hi ‘‘chinnakaṃ saṅghāṭiṃ, chinnakaṃ uttarāsaṅgaṃ, chinnakaṃ antaravāsaka’’nti paṭhamaṃ anuññātaṃ. Tato ‘‘aññatarassa bhikkhuno ticīvare kariyamāne sabbaṃ chinnakaṃ nappahoti. Dve chinnakāni ekaṃ achinnakaṃ nappahoti, dve achinnakāni ekaṃ chinnakaṃ nappahotī’’ti imasmiṃ vatthusmiṃ ‘‘anujānāmi, bhikkhave, anvādhikampi āropetu’’nti (mahāva. 360) anuññātaṃ, tasmā ekaccikāpi saṅghāṭi vaṭṭatīti siddhaṃ. Yā chijjamānāpi nappahoti, tassā kuto diguṇatāti? Aṭṭhakathāyampissa vuttaṃ ‘‘anvādhikampi āropetunti āgantukapattampi dātuṃ, idaṃ pana appahonake āropetabbaṃ. Sace pahoti, āgantukapattaṃ na vaṭṭati, chinditabbamevā’’ti (mahāva. aṭṭha. 360). Kathinaṃ pana chinnakameva vaṭṭati, āveṇikalakkhaṇattā, ‘‘chinnakaṃ diguṇaṃ nappahotī’’ti vacanābhāvato cāti sanniṭṭhānamettha gantabbanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhutaṅga"
      },
      "nti anupasampannānaṃ tecīvarikadhutaṅgābhāvato ticīvareneva tecīvarikoti, tesaṃ adhiṭṭhānābhāvato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘adhiṭṭhitenevā’’"
      },
      "ti vattabbaṃ hotūti ce? Na, dhutaṅgabhedena virodhappasaṅgato. Catutthacīvarasādiyanena hi dhutaṅgabhedo, na ticīvaravippavāsena, nāpi atirekacīvarasādiyanena, nāpi atirekacīvaradhāraṇena. Yasmā pana bhikkhūnaṃ eva bhagavatā adhiṭṭhānavasena nava cīvarāni ",
      " anuññātāni, jātivasena ca vuttāni, na evaṃ anupasampannānaṃ, tasmā nesaṃ cīvaraniyamābhāvā na taṃ dhutaṅgaṃ anuññātaṃ gahaṭṭhānaṃ viya. Tasmā tassa samādānavidhāne avacanato ca sanniṭṭhānamettha gantabbanti."
    ],
    "innerText": "Dhutaṅganti anupasampannānaṃ tecīvarikadhutaṅgābhāvato ticīvareneva tecīvarikoti, tesaṃ adhiṭṭhānābhāvato ‘‘adhiṭṭhitenevā’’ti vattabbaṃ hotūti ce? Na, dhutaṅgabhedena virodhappasaṅgato. Catutthacīvarasādiyanena hi dhutaṅgabhedo, na ticīvaravippavāsena, nāpi atirekacīvarasādiyanena, nāpi atirekacīvaradhāraṇena. Yasmā pana bhikkhūnaṃ eva bhagavatā adhiṭṭhānavasena nava cīvarāni anuññātāni, jātivasena ca vuttāni, na evaṃ anupasampannānaṃ, tasmā nesaṃ cīvaraniyamābhāvā na taṃ dhutaṅgaṃ anuññātaṃ gahaṭṭhānaṃ viya. Tasmā tassa samādānavidhāne avacanato ca sanniṭṭhānamettha gantabbanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sāsaṅkasammatoti"
      },
      " kaṅkhāvitaraṇiyaṃ (kaṅkhā. aṭṭha. sāsaṅkasikkhāpadavaṇṇanā) sāsaṅkasikkhāpade visuṃ aṅgāni na vuttāni, ‘‘sesamettha cīvaravaggassa dutiyasikkhāpade vuttanayeneva veditabba’’nti vuttaṃ, na ca panetaṃ vuttaṃ. Tattha rattivippavāso catutthamaṅgaṃ, idha chārattavippavāso, ayamettha visesoti. Tasmā aṅgasāmaññato ca sammutisāmaññato ca sāsaṅkasikkhāpadamevidanti idaṃ ",
      " nippadesaṃ, taṃ sappadesaṃ māsaparamattā. Tattha bahigāmepi gāmasīmaṃ okkamitvā vasitvā pakkamantassa anāpatti, idha na tathā. Idha anantare anantare aruṇuggamane nissaggiyaṃ, tattha sattameti ayaṃ imesaṃ dvinnaṃ viseso. Aṅgāni pana cīvaranikkhepanaṅgasampattito vipariyāyena, idha vuttanayena ca siddhattā na vuttāni. Tāni kāmaṃ na vuttāni, tathāpi catutthamaṅgaṃ visesitabbaṃ, na pana visesitaṃ. Kiṃ kāraṇaṃ? Idha vuttanissajjanakkamena nissajjitvā āpattidesanato, tatthāpannāpattivimokkhadīpanatthaṃ. Saṃvaccharavippavutthampi rattivippavutthameva, pageva chārattavippavutthaṃ. Evaṃ santepi tattha yathāvuttaaṅgasampattiyā sati tattha vuttanayeneva nissajjitabbaṃ. Hemante, gimhe vā nissajjati ce? Idha vuttanayenāpi nissajjituṃ vaṭṭatīti ñāpanatthaṃ catutthamaṅgaṃ na visesitanti no takkoti ācariyo. Māsātikkantaṃ, dasāhātikkantampi cīvaraṃ ‘‘dasāhātikkanta’’nti vatvā nissaṭṭhameva, na ūnamāsaṃ hutvā ‘‘dasāhātikkanta’’nti vatvā, māsātikkanta’’nti vatvāti eke. Tathāpi sace paccāsācīvaraṃ hoti, nissaggiyaṃ. ‘‘Dasāhātikkanta’’nti vatvā mūlacīvaraṃ pana ‘‘māsātikkanta’’nti vatvā nissajjitabbaṃ."
    ],
    "innerText": "Sāsaṅkasammatoti kaṅkhāvitaraṇiyaṃ (kaṅkhā. aṭṭha. sāsaṅkasikkhāpadavaṇṇanā) sāsaṅkasikkhāpade visuṃ aṅgāni na vuttāni, ‘‘sesamettha cīvaravaggassa dutiyasikkhāpade vuttanayeneva veditabba’’nti vuttaṃ, na ca panetaṃ vuttaṃ. Tattha rattivippavāso catutthamaṅgaṃ, idha chārattavippavāso, ayamettha visesoti. Tasmā aṅgasāmaññato ca sammutisāmaññato ca sāsaṅkasikkhāpadamevidanti idaṃ nippadesaṃ, taṃ sappadesaṃ māsaparamattā. Tattha bahigāmepi gāmasīmaṃ okkamitvā vasitvā pakkamantassa anāpatti, idha na tathā. Idha anantare anantare aruṇuggamane nissaggiyaṃ, tattha sattameti ayaṃ imesaṃ dvinnaṃ viseso. Aṅgāni pana cīvaranikkhepanaṅgasampattito vipariyāyena, idha vuttanayena ca siddhattā na vuttāni. Tāni kāmaṃ na vuttāni, tathāpi catutthamaṅgaṃ visesitabbaṃ, na pana visesitaṃ. Kiṃ kāraṇaṃ? Idha vuttanissajjanakkamena nissajjitvā āpattidesanato, tatthāpannāpattivimokkhadīpanatthaṃ. Saṃvaccharavippavutthampi rattivippavutthameva, pageva chārattavippavutthaṃ. Evaṃ santepi tattha yathāvuttaaṅgasampattiyā sati tattha vuttanayeneva nissajjitabbaṃ. Hemante, gimhe vā nissajjati ce? Idha vuttanayenāpi nissajjituṃ vaṭṭatīti ñāpanatthaṃ catutthamaṅgaṃ na visesitanti no takkoti ācariyo. Māsātikkantaṃ, dasāhātikkantampi cīvaraṃ ‘‘dasāhātikkanta’’nti vatvā nissaṭṭhameva, na ūnamāsaṃ hutvā ‘‘dasāhātikkanta’’nti vatvā, māsātikkanta’’nti vatvāti eke. Tathāpi sace paccāsācīvaraṃ hoti, nissaggiyaṃ. ‘‘Dasāhātikkanta’’nti vatvā mūlacīvaraṃ pana ‘‘māsātikkanta’’nti vatvā nissajjitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Santaruttara’’"
      },
      "nti vā ‘‘saṅghāṭi’’nti vā ‘‘cīvara’’nti vā kiṃ ticīvaraṃ, udāhu aññampīti? Kiñcettha – yadi ticīvarameva paṭisiddhaṃ, pariyāpannavasena acchinnacīvaraaachandanadhovāpanaviññattiādivirodho. Atha aññampi ‘‘niṭṭhitacīvarasmi’’nti evamādinā virodhoti? Vuccate – na niyamato veditabbaṃ yathāsambhavaṃ gahetabbato. Tathā hi ‘‘cīvaraṃ nikkhipitvā santaruttarena janapadacārikaṃ pakkamantī’’ti (pārā. 471) evamādīsu ticīvarameva, ‘‘na, bhikkhave, santaruttarena gāmo pavisitabbo (mahāva. 362), santaruttaraparamaṃ tato cīvaraṃ sāditabba’’nti (pārā. 523-524) evamādīsu yaṃ kiñci, tathā ‘‘saguṇaṃ katvā saṅghāṭiyo dātabbā, nivāsanaṃ dātabbaṃ, saṅghāṭi dātabbā, handa te, āvuso ",
      ", saṅghāṭi, dehi me paṭa’’nti evamādīsu. Vuttañhetaṃ ‘‘sabbañhi cīvaraṃ saṅghaṭitaṭṭhena ‘saṅghāṭī’ti vuccatī’’ti (pāci. aṭṭha. 898). Tathā ‘‘niṭṭhitacīvarasmi’’nti etthāpīti eke. Antosamaye yāvadatthaṃ cīvaraṃ anuññātaṃ, taṃ sabbaṃ kariyamānaṃ kadā niṭṭhānaṃ gacchissati, tasmā ticīvaramevāti eke."
    ],
    "innerText": "‘‘Santaruttara’’nti vā ‘‘saṅghāṭi’’nti vā ‘‘cīvara’’nti vā kiṃ ticīvaraṃ, udāhu aññampīti? Kiñcettha – yadi ticīvarameva paṭisiddhaṃ, pariyāpannavasena acchinnacīvaraaachandanadhovāpanaviññattiādivirodho. Atha aññampi ‘‘niṭṭhitacīvarasmi’’nti evamādinā virodhoti? Vuccate – na niyamato veditabbaṃ yathāsambhavaṃ gahetabbato. Tathā hi ‘‘cīvaraṃ nikkhipitvā santaruttarena janapadacārikaṃ pakkamantī’’ti (pārā. 471) evamādīsu ticīvarameva, ‘‘na, bhikkhave, santaruttarena gāmo pavisitabbo (mahāva. 362), santaruttaraparamaṃ tato cīvaraṃ sāditabba’’nti (pārā. 523-524) evamādīsu yaṃ kiñci, tathā ‘‘saguṇaṃ katvā saṅghāṭiyo dātabbā, nivāsanaṃ dātabbaṃ, saṅghāṭi dātabbā, handa te, āvuso , saṅghāṭi, dehi me paṭa’’nti evamādīsu. Vuttañhetaṃ ‘‘sabbañhi cīvaraṃ saṅghaṭitaṭṭhena ‘saṅghāṭī’ti vuccatī’’ti (pāci. aṭṭha. 898). Tathā ‘‘niṭṭhitacīvarasmi’’nti etthāpīti eke. Antosamaye yāvadatthaṃ cīvaraṃ anuññātaṃ, taṃ sabbaṃ kariyamānaṃ kadā niṭṭhānaṃ gacchissati, tasmā ticīvaramevāti eke."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Acīvarassānāpatti"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paccuddhārādisiddhito"
      },
      "ti kiṃ vuttaṃ hoti – udositasikkhāpadassa nippayojanabhāvappasaṅgato ticīvaravippavāse tecīvarassa āpattīti eke. Tatthetaṃ vuccati na hoti āpatti paccuddhārādisiddhito. ‘‘Anāpatti antoaruṇe paccuddharati vissajjetī’’ti (pārā. 496) hi vuttaṃ. Aññathā paccuddharantassa, antoaruṇe vissajjentassa ca yāva añño nādhiṭṭhāti, tāva āpattiṃ āpajjati yathāvuttanayeneva. Aññathā sattabbhantarena vippavāsassāti vippavāsato yathārutaṃyeva sati vippavāse vippavāsato, avippavāse sati avippavāsatoti."
    ],
    "innerText": "Acīvarassānāpattipaccuddhārādisiddhitoti kiṃ vuttaṃ hoti – udositasikkhāpadassa nippayojanabhāvappasaṅgato ticīvaravippavāse tecīvarassa āpattīti eke. Tatthetaṃ vuccati na hoti āpatti paccuddhārādisiddhito. ‘‘Anāpatti antoaruṇe paccuddharati vissajjetī’’ti (pārā. 496) hi vuttaṃ. Aññathā paccuddharantassa, antoaruṇe vissajjentassa ca yāva añño nādhiṭṭhāti, tāva āpattiṃ āpajjati yathāvuttanayeneva. Aññathā sattabbhantarena vippavāsassāti vippavāsato yathārutaṃyeva sati vippavāse vippavāsato, avippavāse sati avippavāsatoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Udositasikkhāpadavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Akālacīvarasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aparikkhittassa parikkhepārahaṭṭhānassa dubbijānattā taṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘apica bhikkhūna’’"
      },
      "ntiādi vuttaṃ. Vihārapariyante niviṭṭhadhuvasannipātaṭṭhānato vā pariyante ṭhitabhojanasālato vā nibaddhavasanakaāvāsato vāti evaṃ gahetabbaṃ. Sace vihāre sannipatitabhikkhūhi saddhiṃ ekābaddhā hutvā yojanasatampi pūretvā nisīdanti, yojanasatampi upacārasīmā hotīti attho. ‘‘Samānasaṃvāsakasīmāyā’’ti vutte khaṇḍasīmādīsu ṭhitānaṃ na pāpuṇāti, tāsaṃ visuṃ samānasaṃvāsakasīmattāti ca samānasaṃvāsakaavippavāsasīmānaṃ idaṃ nānattaṃ. ‘‘Avippavāsasīmāya dammī’’ti dinnaṃ pana gāme ṭhitānaṃ na pāpuṇāti. Kasmā? ‘‘Ṭhapetvā gāmañca gāmūpacārañcā’’ti (mahāva. 144) vacanato. ‘‘Samānasaṃvāsakasīmāyā’’ti dinnaṃ pana yasmiṃ ṭhāne avippavāsasīmā atthi, tattha ṭhitānampi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Tatra ṭhitānañca pāpuṇātī’’"
      },
      "ti ca, ‘‘khaṇḍasīmāyaṃ ṭhatvā ‘sīmaṭṭhakasaṅgho gaṇhātū’ti vutte upacārasīmāya eva paricchinditvā dātabba’’nti ca, ‘‘tesaṃ bahisīmaṭṭhānampi pāpuṇāti yāva kathinassubbhārāti attho’’ti ca, ‘‘anatthate pana kathine antohemante sace vihāraṃ pavisitvā ‘vassaṃvuṭṭhasaṅghassa dammī’ti vadati, ye tattha vassacchedaṃ akatvā pacchimavassaṃvuṭṭhā, tesaṃ bahisīmaṭṭhānampi pāpuṇātī’’ti vinayadharā ",
      " paricchindanti, aṭṭhakathāyaṃ pana anāgataṃ. Tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samantapāsādikāyaṃ"
      },
      " ‘‘lakkhaṇaññū vadantī’’ti (mahāva. aṭṭha. 379) vuttanti ca, ‘‘‘cīvaramāsato paṭṭhāya yāva ",
      " hemantassa pacchimo divaso, tāva vassāvāsikaṃ demā’ti vutte kathinaṃ atthataṃ vā hotu, anatthataṃ vāti yaṃ samantapāsādikāvacanaṃ (mahāva. aṭṭha. 379), etthāpi yadi atthataṃ, purimavassaṃvuṭṭhā pañca māse. Yadi anatthataṃ, pacchimavassaṃvuṭṭhā cattāro māse labhantīti vinicchayo’’ti ca likhitaṃ."
    ],
    "innerText": "Aparikkhittassa parikkhepārahaṭṭhānassa dubbijānattā taṃ dassetuṃ ‘‘apica bhikkhūna’’ntiādi vuttaṃ. Vihārapariyante niviṭṭhadhuvasannipātaṭṭhānato vā pariyante ṭhitabhojanasālato vā nibaddhavasanakaāvāsato vāti evaṃ gahetabbaṃ. Sace vihāre sannipatitabhikkhūhi saddhiṃ ekābaddhā hutvā yojanasatampi pūretvā nisīdanti, yojanasatampi upacārasīmā hotīti attho. ‘‘Samānasaṃvāsakasīmāyā’’ti vutte khaṇḍasīmādīsu ṭhitānaṃ na pāpuṇāti, tāsaṃ visuṃ samānasaṃvāsakasīmattāti ca samānasaṃvāsakaavippavāsasīmānaṃ idaṃ nānattaṃ. ‘‘Avippavāsasīmāya dammī’’ti dinnaṃ pana gāme ṭhitānaṃ na pāpuṇāti. Kasmā? ‘‘Ṭhapetvā gāmañca gāmūpacārañcā’’ti (mahāva. 144) vacanato. ‘‘Samānasaṃvāsakasīmāyā’’ti dinnaṃ pana yasmiṃ ṭhāne avippavāsasīmā atthi, tattha ṭhitānampi. ‘‘Tatra ṭhitānañca pāpuṇātī’’ti ca, ‘‘khaṇḍasīmāyaṃ ṭhatvā ‘sīmaṭṭhakasaṅgho gaṇhātū’ti vutte upacārasīmāya eva paricchinditvā dātabba’’nti ca, ‘‘tesaṃ bahisīmaṭṭhānampi pāpuṇāti yāva kathinassubbhārāti attho’’ti ca, ‘‘anatthate pana kathine antohemante sace vihāraṃ pavisitvā ‘vassaṃvuṭṭhasaṅghassa dammī’ti vadati, ye tattha vassacchedaṃ akatvā pacchimavassaṃvuṭṭhā, tesaṃ bahisīmaṭṭhānampi pāpuṇātī’’ti vinayadharā paricchindanti, aṭṭhakathāyaṃ pana anāgataṃ. Tasmā samantapāsādikāyaṃ ‘‘lakkhaṇaññū vadantī’’ti (mahāva. aṭṭha. 379) vuttanti ca, ‘‘‘cīvaramāsato paṭṭhāya yāva hemantassa pacchimo divaso, tāva vassāvāsikaṃ demā’ti vutte kathinaṃ atthataṃ vā hotu, anatthataṃ vāti yaṃ samantapāsādikāvacanaṃ (mahāva. aṭṭha. 379), etthāpi yadi atthataṃ, purimavassaṃvuṭṭhā pañca māse. Yadi anatthataṃ, pacchimavassaṃvuṭṭhā cattāro māse labhantīti vinicchayo’’ti ca likhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Yehi mayhaṃ yāgu pītā"
      },
      "ti yehi nimantitehi mayhaṃ yāgu pītāti adhippāyo. Tasmā yehi nimantitehi yāgu pītā, tesaṃyeva pāpuṇātīti vuttaṃ. Aññathā ‘yehi mayhaṃ yāgu pītā’ti vutte nimantitā vā hontu, animantitā vā, yehi pītā, tesaṃ pāpuṇitabbānī’’ti vadanti. Ettha ‘‘niṭṭhitacīvarasmiṃ bhikkhunā ubbhatasmiṃ kathine’’ti vadanto ñāpeti etthantare tiṇṇampi akālacīvarānaṃ uppattiabhāvanti. Kasmā pana padabhājane vitthāritānīti? Vuccate – idaṃ pana sikkhāpadaṃ adhiṭṭhānaṃ sandhāya na vuttaṃ kintu paṭhamasikkhāpade dasāhaparamaṃ anujānitvā tasmiṃ appahonte sace paccāsā atthi, tameva vaḍḍhetvā māsamanujānanto imampi atthavisesaṃ dīpeti. Akālacīvaraṃ nāma sammukhībhūtena bhājetabbaṃ. Taṃ pana ‘‘ākaṅkhamānena bhikkhunā paṭiggahetabba’’nti iminā sikkhāpadena vaḍḍhetvā vuttanti. Tasmā tīṇipi padabhājane vitthāritānīti."
    ],
    "innerText": "‘‘Yehi mayhaṃ yāgu pītāti yehi nimantitehi mayhaṃ yāgu pītāti adhippāyo. Tasmā yehi nimantitehi yāgu pītā, tesaṃyeva pāpuṇātīti vuttaṃ. Aññathā ‘yehi mayhaṃ yāgu pītā’ti vutte nimantitā vā hontu, animantitā vā, yehi pītā, tesaṃ pāpuṇitabbānī’’ti vadanti. Ettha ‘‘niṭṭhitacīvarasmiṃ bhikkhunā ubbhatasmiṃ kathine’’ti vadanto ñāpeti etthantare tiṇṇampi akālacīvarānaṃ uppattiabhāvanti. Kasmā pana padabhājane vitthāritānīti? Vuccate – idaṃ pana sikkhāpadaṃ adhiṭṭhānaṃ sandhāya na vuttaṃ kintu paṭhamasikkhāpade dasāhaparamaṃ anujānitvā tasmiṃ appahonte sace paccāsā atthi, tameva vaḍḍhetvā māsamanujānanto imampi atthavisesaṃ dīpeti. Akālacīvaraṃ nāma sammukhībhūtena bhājetabbaṃ. Taṃ pana ‘‘ākaṅkhamānena bhikkhunā paṭiggahetabba’’nti iminā sikkhāpadena vaḍḍhetvā vuttanti. Tasmā tīṇipi padabhājane vitthāritānīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Khippameva kāretabbanti sīghaṃ antodasāheyeva kāretabba’’"
      },
      "nti idaṃ pana pahonakabhāve purimasikkhāpadalakkhaṇenāti dīpetuṃ vuttaṃ. Tasmā evaṃ ‘‘sīgha’’nti vā ‘‘lahu’’nti vā ādinā avatvāpi ‘‘dasāhā’’ti vuttanti. Atthatakathinassa evaṃ hotu, anatthate pana kathine kathanti vutte anatthatassa paṭikkhepataṃ dassetīti vutto apassanto vighātaṃ āpajjatīti (vajira. ṭī. pārājika 499-500) likhitaṃ."
    ],
    "innerText": "‘‘Khippameva kāretabbanti sīghaṃ antodasāheyeva kāretabba’’nti idaṃ pana pahonakabhāve purimasikkhāpadalakkhaṇenāti dīpetuṃ vuttaṃ. Tasmā evaṃ ‘‘sīgha’’nti vā ‘‘lahu’’nti vā ādinā avatvāpi ‘‘dasāhā’’ti vuttanti. Atthatakathinassa evaṃ hotu, anatthate pana kathine kathanti vutte anatthatassa paṭikkhepataṃ dassetīti vutto apassanto vighātaṃ āpajjatīti (vajira. ṭī. pārājika 499-500) likhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Akālacīvarasikkhāpadavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Purāṇacīvarasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Sākiyāniyo viya suddhabhikkhusaṅghe vā’’"
      },
      "ti idaṃ ‘‘bhikkhunī nāma ubhatosaṅghe upasampannā’’ti ",
      " (pārā. 505) iminā virujjhatīti ce? Na, adhippāyājānanato ",
      ". Bhikkhūnaṃ santike upasampadāya paṭikkhittattā tadanuppasaṅgabhayā evaṃ vuttanti veditabbaṃ."
    ],
    "innerText": "‘‘Sākiyāniyo viya suddhabhikkhusaṅghe vā’’ti idaṃ ‘‘bhikkhunī nāma ubhatosaṅghe upasampannā’’ti (pārā. 505) iminā virujjhatīti ce? Na, adhippāyājānanato . Bhikkhūnaṃ santike upasampadāya paṭikkhittattā tadanuppasaṅgabhayā evaṃ vuttanti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekena vatthunā"
      },
      "ti yena kenaci paṭhamena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avuttā vā dhovatī"
      },
      "ti avuttā dhovati, rajati ākoṭetīti attho. ‘‘‘Avuttā’ti vacanato avādāpetvā dhovanādīsu anāpattī’’ti likhitaṃ. Idha cīvaraṃ nāma nivāsanapārupanūpagameva. Yadi evaṃ ‘‘nivāsanapārupanūpagameva vattabba’’nti ce? Taṃ na vattabbaṃ ‘‘purāṇacīvara’’nti imināva siddhattā. Vuttañhetaṃ ‘‘purāṇacīvaraṃ nāma sakiṃ nivatthampi sakiṃ pārutampī’’ti (pārā. 505)."
    ],
    "innerText": "Ekena vatthunāti yena kenaci paṭhamena. Avuttā vā dhovatīti avuttā dhovati, rajati ākoṭetīti attho. ‘‘‘Avuttā’ti vacanato avādāpetvā dhovanādīsu anāpattī’’ti likhitaṃ. Idha cīvaraṃ nāma nivāsanapārupanūpagameva. Yadi evaṃ ‘‘nivāsanapārupanūpagameva vattabba’’nti ce? Taṃ na vattabbaṃ ‘‘purāṇacīvara’’nti imināva siddhattā. Vuttañhetaṃ ‘‘purāṇacīvaraṃ nāma sakiṃ nivatthampi sakiṃ pārutampī’’ti (pārā. 505)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Purāṇacīvarasikkhāpadavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Cīvarappaṭiggahaṇasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upacāro"
      },
      " dvādasahattho. Acittakattā kathaṃ paṃsukūlaṃ vaṭṭatīti ce? Tāya tassa bhikkhuno adinnattā, bhikkhunā ca tato bhikkhunito aggahitattā ca."
    ],
    "innerText": "Upacāro dvādasahattho. Acittakattā kathaṃ paṃsukūlaṃ vaṭṭatīti ce? Tāya tassa bhikkhuno adinnattā, bhikkhunā ca tato bhikkhunito aggahitattā ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Cīvarappaṭiggahaṇasikkhāpadavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Aññātakaviññattisikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñātakappavārite vā viññāpentassā"
      },
      "ti ettha ca saṅghavasena pavāritesu pamāṇameva vaṭṭati. Puggalikappavāraṇāya yaṃ yaṃ pavāreti, taṃ taṃyeva viññāpetabbanti likhitaṃ."
    ],
    "innerText": "Ñātakappavārite vā viññāpentassāti ettha ca saṅghavasena pavāritesu pamāṇameva vaṭṭati. Puggalikappavāraṇāya yaṃ yaṃ pavāreti, taṃ taṃyeva viññāpetabbanti likhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Aññātakaviññattisikkhāpadavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Tatuttarisikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pakatiyā santaruttarena carati kathinapalibodhavasena vā sāsaṅkasikkhāpadavasena vā. Ettha siyā – ‘‘na mattaṃ jānitvā bahuṃ cīvaraṃ viññāpessanti, dussavāṇijjaṃ vā’’tiādinā (pārā. 522) ujjhāyantānaṃ sutvā bhagavāpi chabbaggiye bhikkhū ",
      " ‘‘kathañhi nāma tumhe moghapurisā ",
      " na mattaṃ jānitvā bahuṃ cīvaraṃ viññāpessathā’’ti (pārā. 522) vatvā sikkhāpadassa paññattattā ca imissaṃ kaṅkhāvitaraṇiyaṃ ‘‘bahucīvaraviññāpanavatthusmiṃ paññatta’’nti vuttattā, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samantapāsādikāyaṃ"
      },
      " ‘‘na hi anacchinnacīvarā attano atthāya sākhāpalāsaṃ bhañjituṃ labhanti, acchinnacīvarānaṃ pana atthāya labhantī’’ti vuttattā ca aññassatthāya pamāṇaṃ viññāpetuṃ vaṭṭatīti ce? Na, kasmā? Aññātakaviññattisikkhāpadassa aṭṭhuppattiyā eva aññātakaviññatti vāritā. Tassa sikkhāpadassa anāpatti. Pāḷiyaṃ (pārā. 521) ‘‘aññassatthāyā’’ti imissā anāpattipāḷiyā aññassatthāya viññāpento tassa ñātakappavārite eva viññāpeti, na aññeti vacanato ca vāritā. Tasmā bhagavāpi ‘‘bahuṃ cīvaraṃ viññāpessathā’’ti (pārā. 522) vigarahitvā sikkhāpadaṃ paññāpento ‘‘abhihaṭṭhuṃ pavāreyyā’’ti vuttanayeneva pamāṇato gahaṇaṃ anujāni, na aññassatthāya pamāṇato viññāpanaṃ. Yasmā panimaṃ sikkhāpadaṃ aññassatthāya viññāpanavatthusmiṃyeva paññattaṃ, tasmā idha ‘‘aññassatthāyā’’ti na vuttaṃ, na na labbhatīti katvā."
    ],
    "innerText": "Pakatiyā santaruttarena carati kathinapalibodhavasena vā sāsaṅkasikkhāpadavasena vā. Ettha siyā – ‘‘na mattaṃ jānitvā bahuṃ cīvaraṃ viññāpessanti, dussavāṇijjaṃ vā’’tiādinā (pārā. 522) ujjhāyantānaṃ sutvā bhagavāpi chabbaggiye bhikkhū ‘‘kathañhi nāma tumhe moghapurisā na mattaṃ jānitvā bahuṃ cīvaraṃ viññāpessathā’’ti (pārā. 522) vatvā sikkhāpadassa paññattattā ca imissaṃ kaṅkhāvitaraṇiyaṃ ‘‘bahucīvaraviññāpanavatthusmiṃ paññatta’’nti vuttattā, samantapāsādikāyaṃ ‘‘na hi anacchinnacīvarā attano atthāya sākhāpalāsaṃ bhañjituṃ labhanti, acchinnacīvarānaṃ pana atthāya labhantī’’ti vuttattā ca aññassatthāya pamāṇaṃ viññāpetuṃ vaṭṭatīti ce? Na, kasmā? Aññātakaviññattisikkhāpadassa aṭṭhuppattiyā eva aññātakaviññatti vāritā. Tassa sikkhāpadassa anāpatti. Pāḷiyaṃ (pārā. 521) ‘‘aññassatthāyā’’ti imissā anāpattipāḷiyā aññassatthāya viññāpento tassa ñātakappavārite eva viññāpeti, na aññeti vacanato ca vāritā. Tasmā bhagavāpi ‘‘bahuṃ cīvaraṃ viññāpessathā’’ti (pārā. 522) vigarahitvā sikkhāpadaṃ paññāpento ‘‘abhihaṭṭhuṃ pavāreyyā’’ti vuttanayeneva pamāṇato gahaṇaṃ anujāni, na aññassatthāya pamāṇato viññāpanaṃ. Yasmā panimaṃ sikkhāpadaṃ aññassatthāya viññāpanavatthusmiṃyeva paññattaṃ, tasmā idha ‘‘aññassatthāyā’’ti na vuttaṃ, na na labbhatīti katvā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Aṭṭhakathāsu ‘‘aññātakappavāritaṭṭhāne pakatiyā bahumpi vaṭṭati, acchinnakāraṇā pamāṇameva vaṭṭatī’’ti vuttaṃ. Taṃ ‘‘anāpatti ñātakānaṃ pavāritāna’’nti (pārā. 526) vuttaanāpattipāḷiyā na sametīti samantapāsādikāyaṃ (pārā. aṭṭha. 2.526) vuttattā idhāpi vuttanayeneva ñātakappavārite viññāpentassa attano dhanena gaṇhantassa anāpattīti likhitaṃ. ‘‘Aññassatthāyā’’ti nidānavirodhato na vuttaṃ, tathāpi anantare vuttanayeneva labbhati evāti vadanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tatuttarisikkhāpadavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Upakkhaṭasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Paṭhamaupakkhaṭe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘pubbe appavārito’’"
      },
      "ti (pārā. 528) vacanato tasmiṃ khaṇe pavāritopi appavāritova hotīti veditabbaṃ."
    ],
    "innerText": "Paṭhamaupakkhaṭe ‘‘pubbe appavārito’’ti (pārā. 528) vacanato tasmiṃ khaṇe pavāritopi appavāritova hotīti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Upakkhaṭasikkhāpadavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Dutiyaupakkhaṭasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dutiyaupakkhaṭena ",
      " kiṃ payojananti ce? Natthi payojanaṃ, kevalaṃ aṭṭhuppattivasena pana paññattaṃ bhikkhuniyā rahonisajjasikkhāpadaṃ viya. Evaṃ sante saṅgītikārakehi saṅgītiṃ anāropetabbaṃ bhaveyya vināpi tena tadatthasiddhito, anissarattā, anāropetuṃ anuññātattā ca. Vuttañhetaṃ ‘‘ākaṅkhamāno, ānanda, saṅgho…pe… samūhaneyyā’’ti (dī. ni. 2.216; cūḷava. 441). Idaṃ sabbamakāraṇaṃ. Na hi buddhā appayojanaṃ vacanaṃ nicchārenti, pageva sikkhāpadaṃ. Tenevāha aṭṭhakathāyaṃ ‘‘imināva nayena attho veditabbo. Idañhi purimassa anupaññattisadisa’’ntiādi. Anupaññatti ca nippayojanaṃ natthi. Taṃsadisañcetaṃ, na nippayojananti dassitaṃ hoti. Evaṃ sante ko panettha atthavisesoti? Tato āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kevalaṃ tattha ekassa pīḷā katā, idha dvinnaṃ, ayamettha viseso’’"
      },
      "ti. Iminā atthavisesena ko panañño atirekattho dassitoti? ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Porāṇagaṇṭhipade"
      },
      " tāva vuttaṃ ‘‘ekasmimpi vatthusmiṃ ubhinnampi pīḷā kātuṃ na vaṭṭatīti ayamatirekattho dassito’’ti. Tenetaṃ dīpeti ‘‘na kevalaṃ paṭiladdhacīvaragaṇanāya eva āpattigaṇanā, pīḷitapuggalasaṅkhātavatthugaṇanāyapī’’ti."
    ],
    "innerText": "Dutiyaupakkhaṭena kiṃ payojananti ce? Natthi payojanaṃ, kevalaṃ aṭṭhuppattivasena pana paññattaṃ bhikkhuniyā rahonisajjasikkhāpadaṃ viya. Evaṃ sante saṅgītikārakehi saṅgītiṃ anāropetabbaṃ bhaveyya vināpi tena tadatthasiddhito, anissarattā, anāropetuṃ anuññātattā ca. Vuttañhetaṃ ‘‘ākaṅkhamāno, ānanda, saṅgho…pe… samūhaneyyā’’ti (dī. ni. 2.216; cūḷava. 441). Idaṃ sabbamakāraṇaṃ. Na hi buddhā appayojanaṃ vacanaṃ nicchārenti, pageva sikkhāpadaṃ. Tenevāha aṭṭhakathāyaṃ ‘‘imināva nayena attho veditabbo. Idañhi purimassa anupaññattisadisa’’ntiādi. Anupaññatti ca nippayojanaṃ natthi. Taṃsadisañcetaṃ, na nippayojananti dassitaṃ hoti. Evaṃ sante ko panettha atthavisesoti? Tato āha ‘‘kevalaṃ tattha ekassa pīḷā katā, idha dvinnaṃ, ayamettha viseso’’ti. Iminā atthavisesena ko panañño atirekattho dassitoti? Porāṇagaṇṭhipade tāva vuttaṃ ‘‘ekasmimpi vatthusmiṃ ubhinnampi pīḷā kātuṃ na vaṭṭatīti ayamatirekattho dassito’’ti. Tenetaṃ dīpeti ‘‘na kevalaṃ paṭiladdhacīvaragaṇanāya eva āpattigaṇanā, pīḷitapuggalasaṅkhātavatthugaṇanāyapī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Honti cettha –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Vatthuto gaṇanāyapi, siyā āpatti nekatā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Iti sandassanatthañca, dutiyūpakkhaṭaṃ idha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kāyasaṃsaggasikkhāya, vibhaṅge viya kintetaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ekitthiyāpi nekatā, āpattīnaṃ payogato’’ti. (vajira. ṭī. pārājika 532);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Apicetaṃ sikkhāpadaṃ taṃjātikesu sikkhāpadesu sabbesupi gahetabbavinicchayassa dassanappayojananti veditabbaṃ. Āha ca –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Aññātikāya bahutāya vimissatāya;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Āpattiyāpi bahutā ca vimissatā ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "children": [
      "Iccevamādividhisambhavadassanatthaṃ ",
      ";"
    ],
    "innerText": "Iccevamādividhisambhavadassanatthaṃ ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Satthā upakkhaṭamidaṃ dutiyaṃ avocā’’ti. (vajira. ṭī. pārājika 532);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tassāyaṃ ",
      " saṅkhepato adhippāyapubbaṅgamā vicāraṇā – purāṇacīvaraṃ ekameva bhikkhu bhikkhunīhi dvīhi, bahūhi vā dhovāpeti, bhikkhunigaṇanāya pācittiyagaṇanā. Tathā dvinnaṃ, bahūnaṃ vā sādhāraṇaṃ ekameva cīvaraṃ aññatra pārivattakā paṭiggaṇhāti, idhāpi tathā dvinnaṃ, bahūnaṃ vā sādhāraṇamekaṃ viññāpeti, viññattapuggalagaṇanāya āpattigaṇanā. Tathā aññesupi evarūpesu sikkhāpadesu nayo netabbo. Ayaṃ tāva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bahutāya"
      },
      " nayo."
    ],
    "innerText": "Tassāyaṃ saṅkhepato adhippāyapubbaṅgamā vicāraṇā – purāṇacīvaraṃ ekameva bhikkhu bhikkhunīhi dvīhi, bahūhi vā dhovāpeti, bhikkhunigaṇanāya pācittiyagaṇanā. Tathā dvinnaṃ, bahūnaṃ vā sādhāraṇaṃ ekameva cīvaraṃ aññatra pārivattakā paṭiggaṇhāti, idhāpi tathā dvinnaṃ, bahūnaṃ vā sādhāraṇamekaṃ viññāpeti, viññattapuggalagaṇanāya āpattigaṇanā. Tathā aññesupi evarūpesu sikkhāpadesu nayo netabbo. Ayaṃ tāva bahutāya nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vimissatāya"
      },
      " pana ñātikāya, aññātikāya ca ekaṃ dhovāpeti, ekato niṭṭhāpane ekaṃ pācittiyaṃ. Atha ñātikā paṭhamaṃ thokaṃ dhovitvā ṭhitā, puna aññātikā sudhotaṃ karoti, nissaggiyaṃ pācittiyaṃ. Atha aññātikā paṭhamaṃ dhovati, pacchā ñātikā sudhotaṃ karoti, aññātikāya payogavasena bhikkhuno dukkaṭameva. Aññātikāya, ñātikāya ca aññātikasaññī, vematiko, ñātikasaññī vā dhovāpeti, yathāvuttanayena nissaggiyadukkaṭādiāpattibhedagaṇanā veditabbā. Tathā aññātikāya, ñātikāya ca santakaṃ cīvaraṃ ubhohi ekato diyyamānaṃ paṭiggaṇhāti, nissaggiyameva. Atha aññātikāya eva hatthato paṭiggaṇhāti, nissaggiyameva. Atha ñātikāya hatthato paṭiggaṇhāti, anāpatti. Atha ubhosu aññātikādisaññī, vuttanayeneva nissaggiyadukkaṭādiāpattibhedagaṇanā veditabbā. Tathā aññātikaviññattiādīsupi yathāsambhavaṃ nayo netabbo. Ayaṃ vimissatāya nayo."
    ],
    "innerText": "Vimissatāya pana ñātikāya, aññātikāya ca ekaṃ dhovāpeti, ekato niṭṭhāpane ekaṃ pācittiyaṃ. Atha ñātikā paṭhamaṃ thokaṃ dhovitvā ṭhitā, puna aññātikā sudhotaṃ karoti, nissaggiyaṃ pācittiyaṃ. Atha aññātikā paṭhamaṃ dhovati, pacchā ñātikā sudhotaṃ karoti, aññātikāya payogavasena bhikkhuno dukkaṭameva. Aññātikāya, ñātikāya ca aññātikasaññī, vematiko, ñātikasaññī vā dhovāpeti, yathāvuttanayena nissaggiyadukkaṭādiāpattibhedagaṇanā veditabbā. Tathā aññātikāya, ñātikāya ca santakaṃ cīvaraṃ ubhohi ekato diyyamānaṃ paṭiggaṇhāti, nissaggiyameva. Atha aññātikāya eva hatthato paṭiggaṇhāti, nissaggiyameva. Atha ñātikāya hatthato paṭiggaṇhāti, anāpatti. Atha ubhosu aññātikādisaññī, vuttanayeneva nissaggiyadukkaṭādiāpattibhedagaṇanā veditabbā. Tathā aññātikaviññattiādīsupi yathāsambhavaṃ nayo netabbo. Ayaṃ vimissatāya nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ādi"
      },
      "saddena pana aneke aññātikā viññattā, viññattapuggalagaṇanāya dukkaṭaṃ. Eko deti, eko na deti, nissaggiyaṃ. Atha aviññatto deti, na nisaggiyaṃ. Atha viññattāviññattānaṃ sādhāraṇaṃ viññatto deti, nissaggiyaṃ. Ubho denti, nissaggiyameva. Aviññatto deti, nissaggiyena anāpatti. Viññattassa vacanena aviññatto deti, anāpatti eva. Tathā upakkhaṭādīsupi yathāsambhavaṃ nayo netabbo."
    ],
    "innerText": "Ādisaddena pana aneke aññātikā viññattā, viññattapuggalagaṇanāya dukkaṭaṃ. Eko deti, eko na deti, nissaggiyaṃ. Atha aviññatto deti, na nisaggiyaṃ. Atha viññattāviññattānaṃ sādhāraṇaṃ viññatto deti, nissaggiyaṃ. Ubho denti, nissaggiyameva. Aviññatto deti, nissaggiyena anāpatti. Viññattassa vacanena aviññatto deti, anāpatti eva. Tathā upakkhaṭādīsupi yathāsambhavaṃ nayo netabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettāvatā saṅkhepato aññātikāyādigāthā vuttādhippāyā hoti. Yaṃ panettha bhikkhuniyā rahonisajjasikkhāpadaṃ nippayojanatāya nidassanaṃ ",
      " vuttaṃ, tassa payojanaviseso tasmiṃyeva āvibhavissatīti ",
      ". Evameva aññatthapi vacanena, visesaaṭṭhuppattivasena ca sikkhāpadesu ñātabbaṃ visesappayojananti."
    ],
    "innerText": "Ettāvatā saṅkhepato aññātikāyādigāthā vuttādhippāyā hoti. Yaṃ panettha bhikkhuniyā rahonisajjasikkhāpadaṃ nippayojanatāya nidassanaṃ vuttaṃ, tassa payojanaviseso tasmiṃyeva āvibhavissatīti . Evameva aññatthapi vacanena, visesaaṭṭhuppattivasena ca sikkhāpadesu ñātabbaṃ visesappayojananti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dutiyaupakkhaṭasikkhāpadavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Rājasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Ṭhānaṃ bhañjati, āgatakāraṇaṃ vināsetī’’"
      },
      "ti vuttattā puna codanaṃ na labhatīti eke. Āgamanassa sātthakaṃ na hoti, cīvaraṃ na labhissati paṭisanthārassa katattāti eke. Codanālakkhaṇaṃ na hotīti katvā vuttanti eke. ‘‘Dhammadesanādhippāyādinā na paṭisanthāro kātabbo’’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upatissatthero"
      },
      " ‘‘‘āgatakāraṇaṃ vināsetī’ti codanāṭhānāni bhañjati, codetukāmo akattabbamakāsi, tappaccayā vattabhede dukkaṭa’’nti ca vadati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammasiritthero"
      },
      " pana ‘‘āsane ce nisīdati, ekāya nisajjāya dve ṭhānāni bhañjati. Āmisaṃ ce paṭiggaṇhāti, ekena paṭiggahaṇena dve ṭhānāni bhañjati. Dhammaṃ ce bhāsati, dhammadesanāsikkhāpade vuttaparicchedāya ekāya vācāya dve ṭhānāni bhañjati. Taṃ sandhāya ‘āgatakāraṇaṃ vināsetī’ti vutta’’nti vadati. ‘‘Eso kho’’ti vuttena saññatto eko, ‘‘ayaṃ veyyāvaccakaroti…pe… avuttepi codetuṃ vaṭṭatī’’ti vutto dutiyo, sace pana dūto gacchantova ‘‘ahaṃ tassa hatthe dassāmī’’tiādinā vutto tatiyo, ‘‘aññaṃ vā pesetvā ārocāpetī’’ti vutto catutthoti yathā bhikkhunā niddiṭṭhā cattāro, tatheva dūtena niddiṭṭhā cattāro. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mukhavevaṭikakappiyakārako, parammukhakappiyakārako ce"
      },
      "ti etesu aññātakaappavāritesu viya paṭipajjitabbanti likhitaṃ."
    ],
    "innerText": "‘‘Ṭhānaṃ bhañjati, āgatakāraṇaṃ vināsetī’’ti vuttattā puna codanaṃ na labhatīti eke. Āgamanassa sātthakaṃ na hoti, cīvaraṃ na labhissati paṭisanthārassa katattāti eke. Codanālakkhaṇaṃ na hotīti katvā vuttanti eke. ‘‘Dhammadesanādhippāyādinā na paṭisanthāro kātabbo’’ti upatissatthero ‘‘‘āgatakāraṇaṃ vināsetī’ti codanāṭhānāni bhañjati, codetukāmo akattabbamakāsi, tappaccayā vattabhede dukkaṭa’’nti ca vadati. Dhammasiritthero pana ‘‘āsane ce nisīdati, ekāya nisajjāya dve ṭhānāni bhañjati. Āmisaṃ ce paṭiggaṇhāti, ekena paṭiggahaṇena dve ṭhānāni bhañjati. Dhammaṃ ce bhāsati, dhammadesanāsikkhāpade vuttaparicchedāya ekāya vācāya dve ṭhānāni bhañjati. Taṃ sandhāya ‘āgatakāraṇaṃ vināsetī’ti vutta’’nti vadati. ‘‘Eso kho’’ti vuttena saññatto eko, ‘‘ayaṃ veyyāvaccakaroti…pe… avuttepi codetuṃ vaṭṭatī’’ti vutto dutiyo, sace pana dūto gacchantova ‘‘ahaṃ tassa hatthe dassāmī’’tiādinā vutto tatiyo, ‘‘aññaṃ vā pesetvā ārocāpetī’’ti vutto catutthoti yathā bhikkhunā niddiṭṭhā cattāro, tatheva dūtena niddiṭṭhā cattāro. Mukhavevaṭikakappiyakārako, parammukhakappiyakārako ceti etesu aññātakaappavāritesu viya paṭipajjitabbanti likhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Rājasikkhāpadavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Cīvaravaggo paṭhamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "2. Eḷakalomavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Kosiyasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kārāpeyyā"
      },
      "ti ",
      " attano ca parassa ca ubhinnañca kosiyaṃ ekato gaṇhitvā vuttaṃ, ubho vā ekato karontīti atthato veditabbaṃ. Tattha attanā kataṃ ce, ‘‘nissajjanakāle sayaṃ kataṃ nissaggiya’’nti vattabbaṃ. Ubhohi ce kataṃ, yathāpāḷimeva."
    ],
    "innerText": "Kārāpeyyāti attano ca parassa ca ubhinnañca kosiyaṃ ekato gaṇhitvā vuttaṃ, ubho vā ekato karontīti atthato veditabbaṃ. Tattha attanā kataṃ ce, ‘‘nissajjanakāle sayaṃ kataṃ nissaggiya’’nti vattabbaṃ. Ubhohi ce kataṃ, yathāpāḷimeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Kosiyasikkhāpadavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Suddhakāḷakasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yathā paṭhame ‘‘ekenapi kosiyaṃsunā’’ti (kaṅkhā. aṭṭha. kosiyasikkhāpadavaṇṇanā) vuttaṃ, tathā idha ‘‘ekenapi aññena amissitāna’’nti vacanābhāvato aññena missabhāve satipi apaññāyamānarūpakaṃ ce, ‘‘suddhakāḷaka’’micceva vuccatīti vadanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Suddhakāḷakasikkhāpadavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Dvebhāgasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tulayitvā’’ti vacanato yathā tulādhāraṇāya kāḷakādhikā na honti, tathā kāḷakānaṃ dve bhāgā gahetabbā ukkaṭṭhaparicchedena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Ekassāpi kāḷakalomassa atirekabhāve nissaggiya"
      },
      "nti vacanaṃ tulādhāraṇāya kiñcāpi na sameti, acittakattā pana sikkhāpadassa pubbe tulāya dhārayitvā ṭhapitesu ekampi lomaṃ tattha pateyya, nissaggiyanti ayamadhippāyoti no takko’’ti ācariyo. Vuttaparicchedena aggahaṇaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "akiriyā,"
      },
      " santhatakaraṇaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kiriyā"
      },
      "."
    ],
    "innerText": "‘‘Tulayitvā’’ti vacanato yathā tulādhāraṇāya kāḷakādhikā na honti, tathā kāḷakānaṃ dve bhāgā gahetabbā ukkaṭṭhaparicchedena. ‘‘Ekassāpi kāḷakalomassa atirekabhāve nissaggiyanti vacanaṃ tulādhāraṇāya kiñcāpi na sameti, acittakattā pana sikkhāpadassa pubbe tulāya dhārayitvā ṭhapitesu ekampi lomaṃ tattha pateyya, nissaggiyanti ayamadhippāyoti no takko’’ti ācariyo. Vuttaparicchedena aggahaṇaṃ akiriyā, santhatakaraṇaṃ kiriyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dvebhāgasikkhāpadavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Chabbassasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Orena"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ce channaṃ vassāna’’"
      },
      "nti vuttattā chabbasse paripuṇṇe kātuṃ vaṭṭatīti niṭṭhānadivasato paṭṭhāya channaṃ vassānaṃ paricchedo veditabbo. Yāni panettha atirekachabbassavasena vā sammutivasena vā katāni, sabbāni tāni ekato paribhuñjituṃ vaṭṭantīti. Gilānassa ca ekaṃ nappahotīti anekampi vaṭṭati. Yato paṭṭhāya rogassa mandatāya santhataṃ ādāya gantuṃ sakkoti, tato paṭṭhāya sammuti vā rogo vā na rakkhatīti eke. Apica chavassabuddhanimmalaṃ sikkhāpadaṃ vicāretuṃ gambhīrattā. Tasmā chavasse kammaṃ katanti."
    ],
    "innerText": "‘‘Orenace channaṃ vassāna’’nti vuttattā chabbasse paripuṇṇe kātuṃ vaṭṭatīti niṭṭhānadivasato paṭṭhāya channaṃ vassānaṃ paricchedo veditabbo. Yāni panettha atirekachabbassavasena vā sammutivasena vā katāni, sabbāni tāni ekato paribhuñjituṃ vaṭṭantīti. Gilānassa ca ekaṃ nappahotīti anekampi vaṭṭati. Yato paṭṭhāya rogassa mandatāya santhataṃ ādāya gantuṃ sakkoti, tato paṭṭhāya sammuti vā rogo vā na rakkhatīti eke. Apica chavassabuddhanimmalaṃ sikkhāpadaṃ vicāretuṃ gambhīrattā. Tasmā chavasse kammaṃ katanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Chabbassasikkhāpadavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Nisīdanasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kasmā panettha ‘‘santhataṃ pana bhikkhunā’’ti sikkhāpadaṃ apaññapetvā ‘‘nisīdanasanthata’’nti paññattaṃ, nanu ettha kāraṇena bhavitabbanti? Atthi kāraṇaṃ, cīvarasaññitāya santhatānaṃ ujjhitattā tesaṃ acīvarabhāvadassanatthaṃ tathā paññattaṃ bhagavatāti vuttaṃ hoti. Tasmā te bhikkhū tecīvarikadhutaṅgabhedabhayā santhate catutthacīvarasaññitāya santhatāni ujjhitvā terasa dhutaṅgāni samādayiṃsu, bhagavā ca tesaṃ santhataṃ anujāni. Tato tesaṃ bhikkhūnaṃ evaṃ hoti ‘‘nisīdanacīvarasaṇṭhānampetaṃ nisīdanasanthataṃ no bhagavatā anuññātaṃ catutthacīvarabhāvena, pageva katasanthataṃ vā’’ti. Tato ‘‘santhate tesaṃ cīvarasaññitā na bhavissatī’’ti tadatthaṃ bhagavatā ‘‘santhata’’nti apaññapetvā ‘‘nisīdanasanthata’’nti paññattanti adhippāyo. Imesu pana pañcasu santhatesu purimāni tīṇi vinayakammaṃ katvā paṭilabhitvāpi paribhuñjituṃ na vaṭṭanti akappiyattā, pacchimāni dve vaṭṭantīti (vajira. ṭī. pārājika 566-567) likhitaṃ. Kathaṃ paññāyatīti ce? ‘‘Anāpatti aññena kataṃ paṭilabhitvā paribhuñjatī’’ti (pārā. 570) vacanatoti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Nisīdanasikkhāpadavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Eḷakalomasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Addhānamaggappaṭipannassā’’"
      },
      "ti ",
      " iminā pakatiyā dīghamaggaṃ paṭipannassa uppannānipi tiyojanaparamameva haritabbāni, pageva appaṭipannassāti dasseti. Paṭipannassa ce, addhānaṃ nāma paṭipannassa akāmā vassaṃvuṭṭhabhikkhuniyā maggappaṭipatti viyāti dasseti. Addhānamaggappaṭipannassa nissaggiyanti vā sambandho. Teneva vāsādhippāyassa paṭippassaddhagamanussāhattā ‘‘appaṭipanno’’ti saṅkhaṃ gatassa anāpattīti siddhaṃ. Imasmiṃ pana atthavikappe ‘‘bhikkhuno paneva eḷakalomāni uppajjeyyuṃ…pe… asantepi hārake addhānamaggappaṭipannassa nissaggiyaṃ pācittiya’’nti yojanā veditabbā. Yasmā vā eḷakalomānaṃ uppattiṭṭhānato paṭṭhāya tiyojanaparamatā adhippetā, maggaṃ appaṭipannassa ca tiyojanaparamatā natthi, tasmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘addhānamaggappaṭipannassa uppajjeyyu’’"
      },
      "nti vuttaṃ. Tena acchinnaṃ paṭilabhitvā harato ca anāpattīti siddhaṃ. Paṭilābho hi tesaṃ uppatti nāmāti."
    ],
    "innerText": "‘‘Addhānamaggappaṭipannassā’’ti iminā pakatiyā dīghamaggaṃ paṭipannassa uppannānipi tiyojanaparamameva haritabbāni, pageva appaṭipannassāti dasseti. Paṭipannassa ce, addhānaṃ nāma paṭipannassa akāmā vassaṃvuṭṭhabhikkhuniyā maggappaṭipatti viyāti dasseti. Addhānamaggappaṭipannassa nissaggiyanti vā sambandho. Teneva vāsādhippāyassa paṭippassaddhagamanussāhattā ‘‘appaṭipanno’’ti saṅkhaṃ gatassa anāpattīti siddhaṃ. Imasmiṃ pana atthavikappe ‘‘bhikkhuno paneva eḷakalomāni uppajjeyyuṃ…pe… asantepi hārake addhānamaggappaṭipannassa nissaggiyaṃ pācittiya’’nti yojanā veditabbā. Yasmā vā eḷakalomānaṃ uppattiṭṭhānato paṭṭhāya tiyojanaparamatā adhippetā, maggaṃ appaṭipannassa ca tiyojanaparamatā natthi, tasmā ‘‘addhānamaggappaṭipannassa uppajjeyyu’’nti vuttaṃ. Tena acchinnaṃ paṭilabhitvā harato ca anāpattīti siddhaṃ. Paṭilābho hi tesaṃ uppatti nāmāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Ākaṅkhamānena bhikkhunā paṭiggahetabbānī’’"
      },
      "ti iminā attanā paṭiggahitānaṃyeva tiyojanātikkame āpattīti dasseti. Tena anākaṅkhamānena parasantakāni paṭiggahitāni harantassa anāpattīti siddhaṃ."
    ],
    "innerText": "‘‘Ākaṅkhamānena bhikkhunā paṭiggahetabbānī’’ti iminā attanā paṭiggahitānaṃyeva tiyojanātikkame āpattīti dasseti. Tena anākaṅkhamānena parasantakāni paṭiggahitāni harantassa anāpattīti siddhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aṅgesu ‘‘attano santakatā’’ti natthi, ayamattho ‘‘bhikkhuno uppajjeyyu’’nti iminā, ‘‘acchinnaṃ paṭilabhitvā’’ti iminā ca dīpito hotīti veditabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Porāṇagaṇṭhipade"
      },
      " ca ‘‘aññaṃ bhikkhuṃ harāpento gacchati ce, dvinnampi anāpattī’’ti vuttaṃ. Tasmā dve bhikkhū tiyojanaparamaṃ patvā aññamaññassa bhaṇḍaṃ parivattetvā ce haranti, anāpattīti siddhaṃ."
    ],
    "innerText": "Aṅgesu ‘‘attano santakatā’’ti natthi, ayamattho ‘‘bhikkhuno uppajjeyyu’’nti iminā, ‘‘acchinnaṃ paṭilabhitvā’’ti iminā ca dīpito hotīti veditabbo. Porāṇagaṇṭhipade ca ‘‘aññaṃ bhikkhuṃ harāpento gacchati ce, dvinnampi anāpattī’’ti vuttaṃ. Tasmā dve bhikkhū tiyojanaparamaṃ patvā aññamaññassa bhaṇḍaṃ parivattetvā ce haranti, anāpattīti siddhaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tiyojanaparamaṃ sahatthā haritabbānī"
      },
      "ti tiyojanaparamameva attanā haritabbāni, taṃ kimatthanti? Sīmāya etaparamato. Vuttañhetaṃ ‘‘anujānāmi, bhikkhave, tiyojanaparamaṃ sīmaṃ sammannitu’’nti (mahāva. 140). Vāsādhippāyena, paccāgamanādhippāyena vā gacchato etaparamatā ca. Vuttañhetaṃ ‘‘chabbaggiyā bhikkhū atimahatiyo sīmāyo sammannanti…pe… bhikkhū uposathaṃ āgacchantā uddissamānepi pātimokkhe āgacchanti, uddiṭṭhamattepi āgacchanti, antarāpi parivasantī’’ti (mahāva. 140)."
    ],
    "innerText": "Tiyojanaparamaṃ sahatthā haritabbānīti tiyojanaparamameva attanā haritabbāni, taṃ kimatthanti? Sīmāya etaparamato. Vuttañhetaṃ ‘‘anujānāmi, bhikkhave, tiyojanaparamaṃ sīmaṃ sammannitu’’nti (mahāva. 140). Vāsādhippāyena, paccāgamanādhippāyena vā gacchato etaparamatā ca. Vuttañhetaṃ ‘‘chabbaggiyā bhikkhū atimahatiyo sīmāyo sammannanti…pe… bhikkhū uposathaṃ āgacchantā uddissamānepi pātimokkhe āgacchanti, uddiṭṭhamattepi āgacchanti, antarāpi parivasantī’’ti (mahāva. 140)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asante"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hārake"
      },
      "ti āṇattiyā hārake asati. Kambalassa upari nisīditvā gacchantassa ",
      " sace ekampi lomaṃ cīvare laggaṃ hoti, tiyojanātikkame āpatti eva kambalato vijaṭitattāti likhitaṃ. Taṃ kambalassa paṭiggahitattā attano atthāya paṭiggahitameva hotīti yuttaṃ."
    ],
    "innerText": "Asantehāraketi āṇattiyā hārake asati. Kambalassa upari nisīditvā gacchantassa sace ekampi lomaṃ cīvare laggaṃ hoti, tiyojanātikkame āpatti eva kambalato vijaṭitattāti likhitaṃ. Taṃ kambalassa paṭiggahitattā attano atthāya paṭiggahitameva hotīti yuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Eḷakalomasikkhāpadavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Jātarūpasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Nibbattarukkhacchāyāpi rukkhaparicchedaṃ anatikkantā’’ti likhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Jātarūpasikkhāpadavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Rūpiyasaṃvohārasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jātarūparajataparivattana"
      },
      "nti ukkaṭṭhaparicchedena vuttaṃ."
    ],
    "innerText": "Jātarūparajataparivattananti ukkaṭṭhaparicchedena vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Rūpiyasaṃvohārasikkhāpadavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Kayavikkayasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asante pācittiyaṃ desetabbamevā"
      },
      "ti ettha kiṃ suddhikaṃ pācittiyaṃ, udāhu nissaggiyanti? Nissaggiyaṃ pācittiyameva."
    ],
    "innerText": "Asante pācittiyaṃ desetabbamevāti ettha kiṃ suddhikaṃ pācittiyaṃ, udāhu nissaggiyanti? Nissaggiyaṃ pācittiyameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Kayavikkayasikkhāpadavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Tatridaṃ pakiṇṇakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭhamasikkhāpadaṃ"
      },
      " parena attano atthāya diyyamānassa vā pārivattakabhāvena diyyamānassa vā paṃsukūlassa vā rūpiyassa uggaṇhanauggaṇhāpanasādiyanāni paṭikkhipati."
    ],
    "innerText": "Aṭṭhamasikkhāpadaṃ parena attano atthāya diyyamānassa vā pārivattakabhāvena diyyamānassa vā paṃsukūlassa vā rūpiyassa uggaṇhanauggaṇhāpanasādiyanāni paṭikkhipati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Navamaṃ"
      },
      " parassa vā attano vā rūpiyaparivattanaṃ paṭikkhipati."
    ],
    "innerText": "Navamaṃ parassa vā attano vā rūpiyaparivattanaṃ paṭikkhipati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dasamaṃ"
      },
      " arūpiyaparivattanaṃ. ‘‘Arūpiye arūpiyasaññī pañcannaṃ saha anāpattī’’ti (pārā. 591; vi. vi. ṭī. 1.591; vajira. ṭī. pārājika 587) ca vacanaṃ itarehi saha āpattīti dīpeti. Arūpiyañca dukkaṭavatthu. Tasmā tassa parivattane sati nissaggiyanti ekantena vuttaṃ. Pañcannaṃ saha dukkaṭavatthūnaṃ parivattane anāpattippasaṅgato anāpatti evāti porāṇāti ce? Na, kappiyavatthūnaṃyeva tattha āgatattā. Yadi kappiyavatthu nissaggiyaṃ, pageva dukkaṭavatthūti ce? Na, āpattigarukalahukabhāvena vatthugarukalahukaniyamābhāvato."
    ],
    "innerText": "Dasamaṃ arūpiyaparivattanaṃ. ‘‘Arūpiye arūpiyasaññī pañcannaṃ saha anāpattī’’ti (pārā. 591; vi. vi. ṭī. 1.591; vajira. ṭī. pārājika 587) ca vacanaṃ itarehi saha āpattīti dīpeti. Arūpiyañca dukkaṭavatthu. Tasmā tassa parivattane sati nissaggiyanti ekantena vuttaṃ. Pañcannaṃ saha dukkaṭavatthūnaṃ parivattane anāpattippasaṅgato anāpatti evāti porāṇāti ce? Na, kappiyavatthūnaṃyeva tattha āgatattā. Yadi kappiyavatthu nissaggiyaṃ, pageva dukkaṭavatthūti ce? Na, āpattigarukalahukabhāvena vatthugarukalahukaniyamābhāvato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nissaggiyavatthuto hi muttāmaṇiveḷuriyādi mahagghappahonakampi dukkaṭavatthūti katvā nissaggiyavatthuto muttādi lahukaṃ hoti. Lahukepi vatthusmiṃ yatheva dukkaṭavatthuno paṭiggahaṇe dukkaṭaṃ, tatheva tassa vā tena vā cetāpanepi dukkaṭaṃ yuttanti (pārā. aṭṭha. 2.589) aṭṭhakathācariyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha vā yaṃ vuttaṃ ‘‘kappiyavatthūnaṃyeva tattha āgatattā’’ti, tattha kiñcāpi dukkaṭavatthūnipi adhippetāni, na pana pāḷiyaṃ vuttāni anāpattivārappasaṅgabhayāti vuttaṃ hoti. Muttādīsupi vuttesu anāpattiyaṃ kappiyakārakassa ācikkhati, ‘‘idaṃ muttādi amhākaṃ atthi, amhākañca iminā ca iminā ca veḷuriyādinā attho’’ti bhaṇati, dasamena āpajjatīti adhippāyo siyā. Yasmā ca idaṃ kappiyakārakassa ācikkhanādisaṃvohāro ca, tasmā taṃ navamena vuttanti veditabbaṃ. Kiñcāpi kayavikkayeva hoti kappiyavatthūhi anuññātaṃ, imināva nayena kiñcāpi dukkaṭavatthupi dasame adhippetaṃ āpajjati, aṭṭhakathāvirodhato pana nādhippetamicceva gahetabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kā panettha kāraṇacchāyāti, pañcannaṃ saha tattha anāpattippasaṅgato anāpatti evāti ce? Na, tattha anāgatattā. Anāgatakāraṇā vuttanti ce? Na, pañcannaṃ saha āpattivatthukassa anāpattivāralābhe visesakāraṇābhāvā, akappiyattā pañcannaṃ sahāpi āpattiyā bhavitabbanti siddho aṭṭhakathāvādo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aparo nayo – yadi dukkaṭavatthunā kayavikkaye nissaggiyaṃ, kappiyavatthumhi vuttapariyāyo tattha labbheyya, na pana labbhatīti navame eva tāni vattabbāni. Tasmā saṃvohāro nāma kayavikkayopi aññathā parivattanaṃ ",
      " pariyādiyitvā pavatto, kayavikkayañca mocetvā ",
      " ‘‘iminā imaṃ dehī’ti cetāpeti, vaṭṭatī’’ti avatvā dasamassa anāpattivāre vuttanayeneva tesaṃ parivattane nissaggiyānumativirodhato aṭṭhakathāyaṃ vuttanayeneva dukkaṭavatthunā cetāpane dukkaṭameva. Nesaṃ kayavikkayena nissaggiyanti ce? Na, sabbassapi kayavikkayattā. Teneva vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘andhakaṭṭhakathāyaṃ"
      },
      " pana ‘sace kayavikkayaṃ samāpajjeyya, nissaggiyaṃ pācittiya’nti bhāsitaṃ, taṃ dubbhāsitaṃ. Kasmā? Na hi dānaggahaṇato añño kayavikkayo nāma atthī’’ti (pārā. aṭṭha. 2.589), attano matiyā kayavikkayalakkhaṇasammate dasamassa anāpattivāre vuttanayeneva tesaṃ parivattane nissaggiyānumativirodhato ca. Bhavatu vā attano paṭisiddhamidaṃ kāraṇaṃ, dasame avassameva jānitabbānīti tāni kayavikkayānevāti tesaṃ nissaggiyabhāvañca gatānīti evampi siddho aṭṭhakathāvādo."
    ],
    "innerText": "Aparo nayo – yadi dukkaṭavatthunā kayavikkaye nissaggiyaṃ, kappiyavatthumhi vuttapariyāyo tattha labbheyya, na pana labbhatīti navame eva tāni vattabbāni. Tasmā saṃvohāro nāma kayavikkayopi aññathā parivattanaṃ pariyādiyitvā pavatto, kayavikkayañca mocetvā ‘‘iminā imaṃ dehī’ti cetāpeti, vaṭṭatī’’ti avatvā dasamassa anāpattivāre vuttanayeneva tesaṃ parivattane nissaggiyānumativirodhato aṭṭhakathāyaṃ vuttanayeneva dukkaṭavatthunā cetāpane dukkaṭameva. Nesaṃ kayavikkayena nissaggiyanti ce? Na, sabbassapi kayavikkayattā. Teneva vuttaṃ ‘‘andhakaṭṭhakathāyaṃ pana ‘sace kayavikkayaṃ samāpajjeyya, nissaggiyaṃ pācittiya’nti bhāsitaṃ, taṃ dubbhāsitaṃ. Kasmā? Na hi dānaggahaṇato añño kayavikkayo nāma atthī’’ti (pārā. aṭṭha. 2.589), attano matiyā kayavikkayalakkhaṇasammate dasamassa anāpattivāre vuttanayeneva tesaṃ parivattane nissaggiyānumativirodhato ca. Bhavatu vā attano paṭisiddhamidaṃ kāraṇaṃ, dasame avassameva jānitabbānīti tāni kayavikkayānevāti tesaṃ nissaggiyabhāvañca gatānīti evampi siddho aṭṭhakathāvādo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Etthāhu porāṇā – ‘‘attano santakaṃ rūpiyaṃ parahatthagataṃ karoti ajjhācarati, dukkaṭaṃ. Parassa rūpiyaṃ attano hatthagataṃ karoti, aṭṭhamena nissaggiyaṃ. Uggahitavatthuparivattane kathaṃ jātaṃ? Abbohārikaṃ jātaṃ. Atha parassa rūpiyaṃ attano hatthagataṃ paṭhamaṃ karoti, rūpiyappaṭiggahaṇassa katattā aṭṭhamena nissaggiyaṃ. Attano santakaṃ rūpiyaṃ parassa hatthagataṃ pacchā karoti, saṃvohārena nissaggiya’’nti. ‘‘Rūpiyassa gahaṇamattena aṭṭhamena āpatti, pacchā parivattane navamenā’’ti hi tattha vuttaṃ, taṃ pana yuttaṃ. ‘‘Ajjhācarati, dukkaṭa’’nti duvuttaṃ. Dukkaṭassa aniyamappasaṅgato nissajjanavidhānesu dassitova. Kiṃ vuttaṃ hoti – yadi dvīhi nissaggiyehi bhavitabbaṃ, nissajjanavidhāne ‘‘ahaṃ, bhante, rūpiyaṃ paṭiggahesiṃ, nānāppakārakañca rūpiyasaṃvohāraṃ samāpajji’’nti vattabbaṃ bhaveyya ‘‘rūpiyaṃ cetāpetī’’ti sabbattha pāḷiyaṃ rūpiyappaṭiggahaṇassa vuttattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettāvatā yaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "porāṇagaṇṭhipade"
      },
      " vuttaṃ ‘‘dukkaṭavatthunā kayavikkayaṃ pariharantena catūsu nissaggiyavatthūsu ekekasmiṃ gahite aṭṭhamena nissaggiyaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dukkaṭavatthunā dukkaṭavatthu"
      },
      "nti ‘‘iminā idaṃ dehī’’ti gahite teneva nissaggiyaṃ hoti. ‘‘Kayavikkayampi nīharitvā gahite dukkaṭaṃ, cetāpitarūpiyaggahaṇe aṭṭhamena, parivattane navamenātiādinā attanā anuggahetvā kappiyavasena nīharitvā pañcahi sahadhammikehi saddhiṃ parivattetuṃ ",
      " vaṭṭatī’’ti, taṃ visodhitaṃ hoti. Aparampi tattha vuttaṃ ‘‘nissajjitabbe asati kathaṃ pācittiyaṃ, dunnissaṭṭharūpiyampi ‘na chaḍḍetī’ti vadantassa vissaṭṭho upāsako taṃ gahetvā aññaṃ ce bhikkhuno deti, kappatī’’ti, tañca duvuttaṃ. Na hi gahitattā tato aññaṃ vatthu hoti. Puna aparañca tattha vuttaṃ ‘‘imaṃ ‘gaṇhāhī’ti ",
      " vadantassa saddhādeyyavinipātadukkaṭaṃ, ‘etaṃ dehī’ti vadantassa viññattidukkaṭa’’nti, tañca duvuttaṃ. Tattha hi payogadukkaṭaṃ yuttaṃ viya paññāyati."
    ],
    "innerText": "Ettāvatā yaṃ porāṇagaṇṭhipade vuttaṃ ‘‘dukkaṭavatthunā kayavikkayaṃ pariharantena catūsu nissaggiyavatthūsu ekekasmiṃ gahite aṭṭhamena nissaggiyaṃ hoti. Dukkaṭavatthunā dukkaṭavatthunti ‘‘iminā idaṃ dehī’’ti gahite teneva nissaggiyaṃ hoti. ‘‘Kayavikkayampi nīharitvā gahite dukkaṭaṃ, cetāpitarūpiyaggahaṇe aṭṭhamena, parivattane navamenātiādinā attanā anuggahetvā kappiyavasena nīharitvā pañcahi sahadhammikehi saddhiṃ parivattetuṃ vaṭṭatī’’ti, taṃ visodhitaṃ hoti. Aparampi tattha vuttaṃ ‘‘nissajjitabbe asati kathaṃ pācittiyaṃ, dunnissaṭṭharūpiyampi ‘na chaḍḍetī’ti vadantassa vissaṭṭho upāsako taṃ gahetvā aññaṃ ce bhikkhuno deti, kappatī’’ti, tañca duvuttaṃ. Na hi gahitattā tato aññaṃ vatthu hoti. Puna aparañca tattha vuttaṃ ‘‘imaṃ ‘gaṇhāhī’ti vadantassa saddhādeyyavinipātadukkaṭaṃ, ‘etaṃ dehī’ti vadantassa viññattidukkaṭa’’nti, tañca duvuttaṃ. Tattha hi payogadukkaṭaṃ yuttaṃ viya paññāyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pakiṇṇakaṃ niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Eḷakalomavaggo dutiyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "3. Pattavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Pattasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dve apattā,"
      },
      " tasmā ete bhājanaparibhogena paribhuñjitabbā, naadhiṭṭhānūpagānavikappanūpagatāti atthoti ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samaṇasāruppena pakka"
      },
      "nti ayopatto pañcahi pākehi pakko hoti, mattikāpatto dvīhi. ‘‘Bhikkhuniyā pattasanniccayassa vāritattā (vajira. ṭī. pārājika 602) bhikkhussapi taṃ ‘ananurūpa’nti katvā ‘purāṇapattaṃ paccuddharitvā’ti vutta’’nti ca likhitaṃ, taṃ na yuttaṃ pāḷiyaṃ ‘‘sanniccayaṃ kareyyāti anadhiṭṭhito avikappito’’ti (pāci. 735) vuttattā. So hi kathinakkhandhake (mahāva. 306 ādayo) niccayasannidhi viya ekopi punadivase ‘‘sanniccayo’’ti vuccati. Anantarasikkhāpade pana ‘‘dutiyo vārito’’ti adhiṭṭhānaṃ niyataṃ. Tasmā dve patte adhiṭṭhātuṃ na labhati. Sace ekato adhiṭṭhāti, dvepi anadhiṭṭhitā honti. Visuṃ visuṃ adhiṭṭhāti, dutiyo anadhiṭṭhito. Vikappetuṃ pana bahūpi labhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kākaṇikamattampī"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pi"
      },
      "-kāro ‘‘ekapākampi janetī’’ti pākaṃ sampiṇḍeti. Atha vā sace ekapākeneva sāruppo, vaṭṭatīti pākaparimāṇaṃ na vuttanti gahetabbaṃ. Apattattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "adhiṭṭhānūpago"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na hoti. Apaccuddharantena vikappetabbo"
      },
      "ti purāṇapattaṃ apaccuddharantena so patto vikappetabboti atthoti likhitaṃ."
    ],
    "innerText": "Dve apattā, tasmā ete bhājanaparibhogena paribhuñjitabbā, naadhiṭṭhānūpagānavikappanūpagatāti atthoti ca. Samaṇasāruppena pakkanti ayopatto pañcahi pākehi pakko hoti, mattikāpatto dvīhi. ‘‘Bhikkhuniyā pattasanniccayassa vāritattā (vajira. ṭī. pārājika 602) bhikkhussapi taṃ ‘ananurūpa’nti katvā ‘purāṇapattaṃ paccuddharitvā’ti vutta’’nti ca likhitaṃ, taṃ na yuttaṃ pāḷiyaṃ ‘‘sanniccayaṃ kareyyāti anadhiṭṭhito avikappito’’ti (pāci. 735) vuttattā. So hi kathinakkhandhake (mahāva. 306 ādayo) niccayasannidhi viya ekopi punadivase ‘‘sanniccayo’’ti vuccati. Anantarasikkhāpade pana ‘‘dutiyo vārito’’ti adhiṭṭhānaṃ niyataṃ. Tasmā dve patte adhiṭṭhātuṃ na labhati. Sace ekato adhiṭṭhāti, dvepi anadhiṭṭhitā honti. Visuṃ visuṃ adhiṭṭhāti, dutiyo anadhiṭṭhito. Vikappetuṃ pana bahūpi labhati. Kākaṇikamattampīti ettha pi-kāro ‘‘ekapākampi janetī’’ti pākaṃ sampiṇḍeti. Atha vā sace ekapākeneva sāruppo, vaṭṭatīti pākaparimāṇaṃ na vuttanti gahetabbaṃ. Apattattā adhiṭṭhānūpagona hoti. Apaccuddharantena vikappetabboti purāṇapattaṃ apaccuddharantena so patto vikappetabboti atthoti likhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pattasikkhāpadavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Ūnapañcabandhanasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pavārite"
      },
      "ti ",
      " ettha saṅghavasena pavāritaṭṭhāne pañcabandhaneneva vaṭṭati, puggalikavasena pavāritaṭṭhāne ūnapañcabandhanenāpi vaṭṭatīti likhitaṃ."
    ],
    "innerText": "Pavāriteti ettha saṅghavasena pavāritaṭṭhāne pañcabandhaneneva vaṭṭati, puggalikavasena pavāritaṭṭhāne ūnapañcabandhanenāpi vaṭṭatīti likhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Yo ūnapañcabandhanatthaṃ, vuttampi cetaṃ karo so;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ūnapañcabandhanatthaṃ, patvāna santike."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ūnapañcabandhanasikkhāpadavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Bhesajjasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Paṭisāyanīyāni paṭiggahetvā’’"
      },
      "ti vadantena pādamakkhanādīnaṃ atthāya paṭiggahetvā ṭhapetuṃ vaṭṭatīti dīpitanti likhitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Yesaṃ maṃsaṃ kappatī’’"
      },
      "ti vacanena yesaṃ maṃsaṃ na kappati, tesaṃ sappiādi na kappatīti vadantā ajānitvā vadanti. Yesañhi maṃsaṃ kappati, tesaṃ sappītiādi sattāhakālikanissaggiyavatthuparicchedadassanatthaṃ vuttaṃ. Tathā paṇītabhojanasikkhāpade yesaṃ maṃsaṃ kappati, tesaṃyeva khīrādi paṇītabhojanaṃ, netaranti dassetuṃ vuttanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Madhu nāma"
      },
      " madhukaribhamaramakkhikānaṃ āsayesu niyyāsasadisaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mahāmadhu"
      },
      " hoti, taṃ yāvajīvikanti ca likhitaṃ."
    ],
    "innerText": "‘‘Paṭisāyanīyāni paṭiggahetvā’’ti vadantena pādamakkhanādīnaṃ atthāya paṭiggahetvā ṭhapetuṃ vaṭṭatīti dīpitanti likhitaṃ. ‘‘Yesaṃ maṃsaṃ kappatī’’ti vacanena yesaṃ maṃsaṃ na kappati, tesaṃ sappiādi na kappatīti vadantā ajānitvā vadanti. Yesañhi maṃsaṃ kappati, tesaṃ sappītiādi sattāhakālikanissaggiyavatthuparicchedadassanatthaṃ vuttaṃ. Tathā paṇītabhojanasikkhāpade yesaṃ maṃsaṃ kappati, tesaṃyeva khīrādi paṇītabhojanaṃ, netaranti dassetuṃ vuttanti. Madhu nāma madhukaribhamaramakkhikānaṃ āsayesu niyyāsasadisaṃ mahāmadhu hoti, taṃ yāvajīvikanti ca likhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Bhesajjasikkhāpadavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pattavaggo tatiyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Nissaggiyapācittiyavaṇṇanā niṭṭhitā."
  }
]