[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "9. Campeyyakkhandhako"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "234. Kassapagottabhikhuvatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "380"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": " . Teena"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "samayena buddho bhagavā campāyaṃ viharati gaggarāya pokkharaṇiyā tīre. Whenever you find someone you will become my beloved. Tattha kassapagotto nāma bhikkhu āvāsiko hoti tantibaddho ussukkaṃ āpanno – kinti anāgatā ca pesalā bhikkhū āgaccheyyuṃ, āgatā ca pesalā bhikkhū phāsu vihareyyuṃ, ayañca āvāso vuddhiṃ viruḷhiṃ vepullaṃ āpajjeyyāti. Tena kho pana samayena sambahulā bhikkhū kāsīsu cārikaṃ caramānā yena vāsabhagāmo tadavasaruṃ. Addasā kho kassapagotto bhikkhu te bhikkhū dūratova āgacchante, disvāna āsanaṃ paññapesi, pādodakaṃ pādapīṭhaṃ pādakathalikaṃ upanikkhipi, paccuggantvā pattacīvaraṃ paṭiggahesi, pānīyena āpucchi, nahāne ussukkaṃ akāsi, ussukkampi yāguyā khādanīye bhattasmiṃ. Atha kho tesaṃ āgantukānaṃ bhikkhūnaṃ etadahosi – ''bhaddako kho ayaṃ, āvuso, āvāsiko bhikkhu nahane ussukkaṃ karoti, ussukkampi karoti yāguyā khādanīye bhattasmiṃ. Handa, mayaṃ, āvuso, idheva vāsabhagāme nivāsaṃ kappemā''ti. Atha kho te āgantukā bhikkhū tattheva vāsabhagāme nivāsaṃ kappesuṃ."
      }
    ],
    "innerText": "380 . Teenasamayena buddho bhagavā campāyaṃ viharati gaggarāya pokkharaṇiyā tīre. Whenever you find someone you will become my beloved. Tattha kassapagotto nāma bhikkhu āvāsiko hoti tantibaddho ussukkaṃ āpanno – kinti anāgatā ca pesalā bhikkhū āgaccheyyuṃ, āgatā ca pesalā bhikkhū phāsu vihareyyuṃ, ayañca āvāso vuddhiṃ viruḷhiṃ vepullaṃ āpajjeyyāti. Tena kho pana samayena sambahulā bhikkhū kāsīsu cārikaṃ caramānā yena vāsabhagāmo tadavasaruṃ. Addasā kho kassapagotto bhikkhu te bhikkhū dūratova āgacchante, disvāna āsanaṃ paññapesi, pādodakaṃ pādapīṭhaṃ pādakathalikaṃ upanikkhipi, paccuggantvā pattacīvaraṃ paṭiggahesi, pānīyena āpucchi, nahāne ussukkaṃ akāsi, ussukkampi yāguyā khādanīye bhattasmiṃ. Atha kho tesaṃ āgantukānaṃ bhikkhūnaṃ etadahosi – ''bhaddako kho ayaṃ, āvuso, āvāsiko bhikkhu nahane ussukkaṃ karoti, ussukkampi karoti yāguyā khādanīye bhattasmiṃ. Handa, mayaṃ, āvuso, idheva vāsabhagāme nivāsaṃ kappemā''ti. Atha kho te āgantukā bhikkhū tattheva vāsabhagāme nivāsaṃ kappesuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "Atha kho kassapagottassa bhikkhuno etadahosi – ''yo kho imesaṃ"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "āgantukānaṃ bhikkhūnaṃ āgantukakilamatho so paṭippassaddho. Yepime gocare appakataññuno tedānime gocare pakataññuno. Dukkaraṃ kho pana parakulesu yāvajīvaṃ ussukkaṃ kātuṃ, viññatti ca manussānaṃ amanāpā. Yaṃnūnāhaṃ na ussukkaṃ kareyyaṃ yāguyā khādanīye bhattasmi''nti. So na ussukkaṃ akāsi yāguyā khādanīye bhattasmiṃ. Atha kho tesaṃ āgantukānaṃ bhikkhūnaṃ"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "etadahosi – ''pubbe khvāyaṃ, āvuso, āvāsiko bhikkhu nahāne ussukkaṃ akasis, ussukkampi akasis yāguyā khādanīye bhattasmiṃ. Sodānāyaṃ na ussukkaṃ karoti yāguyā khādanīye bhattasmiṃ. Duṭṭhodānāyaṃ, āvuso, āvāsiko bhikkhu. Handa, mayaṃ, āvuso, āvāsikaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[imaṃ āvāsikaṃ (syā.)]"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": " bhikkhuṃ ukkhipāmā''ti. So find out"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "āgantukā bhikkhū sannipatitvā kassapagottaṃ bhikkhuṃ etadavocuṃ – ''pubbe kho tvaṃ, āvuso, nahāne ussukkaṃ karosi, ussukkampi karosi yāguyā khādanīye bhattasmiṃ. Sodāni tvaṃ na ussukkaṃ karosi yāguyā khādanīye bhattasmiṃ. Āpattiṃ tvaṃ, āvuso, āpanno. Passasetaṃ āpatti''nti? ''Natthi me, āvuso, āpatti, yamahaṃ passeyya''nti. Atha kho te āgantukā bhikkhū kassapagottaṃ bhikkhuṃ āpattiyā adassane ukkhipiṃsu."
      }
    ],
    "innerText": "Atha kho kassapagottassa bhikkhuno etadahosi – ''yo kho imesaṃāgantukānaṃ bhikkhūnaṃ āgantukakilamatho so paṭippassaddho. Yepime gocare appakataññuno tedānime gocare pakataññuno. Dukkaraṃ kho pana parakulesu yāvajīvaṃ ussukkaṃ kātuṃ, viññatti ca manussānaṃ amanāpā. Yaṃnūnāhaṃ na ussukkaṃ kareyyaṃ yāguyā khādanīye bhattasmi''nti. So na ussukkaṃ akāsi yāguyā khādanīye bhattasmiṃ. Atha kho tesaṃ āgantukānaṃ bhikkhūnaṃetadahosi – ''pubbe khvāyaṃ, āvuso, āvāsiko bhikkhu nahāne ussukkaṃ akasis, ussukkampi akasis yāguyā khādanīye bhattasmiṃ. Sodānāyaṃ na ussukkaṃ karoti yāguyā khādanīye bhattasmiṃ. Duṭṭhodānāyaṃ, āvuso, āvāsiko bhikkhu. Handa, mayaṃ, āvuso, āvāsikaṃ[imaṃ āvāsikaṃ (syā.)] bhikkhuṃ ukkhipāmā''ti. So find outāgantukā bhikkhū sannipatitvā kassapagottaṃ bhikkhuṃ etadavocuṃ – ''pubbe kho tvaṃ, āvuso, nahāne ussukkaṃ karosi, ussukkampi karosi yāguyā khādanīye bhattasmiṃ. Sodāni tvaṃ na ussukkaṃ karosi yāguyā khādanīye bhattasmiṃ. Āpattiṃ tvaṃ, āvuso, āpanno. Passasetaṃ āpatti''nti? ''Natthi me, āvuso, āpatti, yamahaṃ passeyya''nti. Atha kho te āgantukā bhikkhū kassapagottaṃ bhikkhuṃ āpattiyā adassane ukkhipiṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "Atha kho kassapagottassa bhikkhuno etadahosi – ''ahaṃ kho etaṃ na jānāmi 'āpatti vā esā anāpatti vā, āpanno camhi "
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vamhi (?)]"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": " anāpanno vā, ukkhitto camhi"
      },
      " anukkhitto vā, dhammikena vā adhammikena vā, kuppena vā akuppena vā, ṭhānārahena vā aṭṭhānārahena vā’. Yaṃnūnāhaṃ campaṃ gantvā bhagavantaṃ etamatthaṃ puccheyya’’nti. Atha kho kassapagotto bhikkhu senāsanaṃ saṃsāmetvā pattacīvaramādāya yena campā tena pakkāmi. Anupubbena yena campā yena bhagavā tenupasaṅkami, upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Āciṇṇaṃ kho panetaṃ buddhānaṃ bhagavantānaṃ āgantukehi bhikkhūhi saddhiṃ paṭisammodituṃ. Atha kho bhagavā kassapagottaṃ bhikkhuṃ etadavoca – ‘‘kacci, bhikkhu, khamanīyaṃ, kacci yāpanīyaṃ, kacci appakilamathena addhānaṃ āgato, kuto ca tvaṃ, bhikkhu, āgacchasī’’ti? ‘‘Khamanīyaṃ, bhagavā; yāpanīyaṃ, bhagavā; appakilamathena cāhaṃ, bhante, addhānaṃ āgato. Atthi, bhante, kāsīsu janapade vāsabhagāmo nāma. Tatthāhaṃ, bhagavā, āvāsiko tantibaddho ussukkaṃ āpanno – ‘kinti anāgatā ca pesalā bhikkhū āgaccheyyuṃ, āgatā ca pesalā bhikkhū phāsu vihareyyuṃ, ayañca āvāso vuddhiṃ viruḷhiṃ vepullaṃ āpajjeyyā’ti. Atha kho, bhante, sambahulā bhikkhū kāsīsu cārikaṃ caramānā yena vāsabhagāmo tadavasaruṃ. Addasaṃ kho ahaṃ, bhante, te bhikkhū dūratova āgacchante, disvāna āsanaṃ paññapesiṃ, pādodakaṃ pādapīṭhaṃ pādakathalikaṃ upanikkhipiṃ, paccuggantvā pattacīvaraṃ paṭiggahesiṃ, pānīyena apucchiṃ, nahāne ussukkaṃ akāsiṃ, ussukkampi akāsiṃ yāguyā khādanīye bhattasmiṃ ",
      ". Atha kho tesaṃ, bhante, āgantukānaṃ bhikkhūnaṃ etadahosi – ‘bhaddako kho ",
      " ayaṃ āvuso āvāsiko bhikkhu nahāne ussukkaṃ karoti, ussukkampi karoti yāguyā khādanīye bhattasmiṃ. Handa, mayaṃ, āvuso, idheva vāsabhagāme nivāsaṃ kappemā’ti. Atha kho ",
      " te, bhante, āgantukā bhikkhū tattheva vāsabhagāme nivāsaṃ kappesuṃ. Tassa mayhaṃ, bhante, etadahosi – ‘yo kho imesaṃ āgantukānaṃ bhikkhūnaṃ āgantukakilamatho so paṭippassaddho. Yepime gocare appakataññuno tedānime gocare pakataññuno. Dukkaraṃ kho pana parakulesu ",
      " yāvajīvaṃ ussukkaṃ kātuṃ, viññatti ca manussānaṃ amanāpā. Yaṃnūnāhaṃ na ussukkaṃ kareyyaṃ yāguyā khādanīye bhattasmi’nti. So kho ahaṃ, bhante, na ussukkaṃ akāsiṃ yāguyā khādanīye bhattasmiṃ. Atha kho tesaṃ, bhante, āgantukānaṃ bhikkhūnaṃ etadahosi – ‘pubbe khvāyaṃ, āvuso, āvāsiko bhikkhu nahāne ussukkaṃ karoti, ussukkampi karoti yāguyā khādanīye bhattasmiṃ. Sodānāyaṃ na ussukkaṃ karoti yāguyā khādanīye bhattasmiṃ. Duṭṭhodānāyaṃ, āvuso, āvāsiko bhikkhu. Handa, mayaṃ, āvuso, āvāsikaṃ bhikkhuṃ ukkhipāmā’ti. Atha kho te, bhante, āgantukā bhikkhū sannipatitvā maṃ etadavocuṃ – ‘pubbe kho tvaṃ, āvuso, nahāne ussukkaṃ karosi, ussukkampi karosi yāguyā khādanīye bhattasmiṃ. Sodāni tvaṃ na ussukkaṃ karosi yāguyā khādanīye bhattasmiṃ. Āpattiṃ tvaṃ, āvuso, āpanno. Passasetaṃ āpatti’nti ",
      "? ‘Natthi me, āvuso, āpatti yamahaṃ passeyya’nti. Atha kho te, bhante, āgantukā bhikkhū maṃ āpattiyā adassane ukkhipiṃsu. Tassa mayhaṃ, bhante, etadahosi – ‘ahaṃ kho etaṃ na jānāmi ‘āpatti vā esā anāpatti vā, āpanno camhi anāpanno vā, ukkhitto camhi anukkhitto vā, dhammikena vā adhammikena vā, kuppena vā akuppena vā, ṭhānārahena vā aṭṭhānārahena vā’. Yaṃnūnāhaṃ campaṃ gantvā bhagavantaṃ etamatthaṃ puccheyya’nti. Tato ahaṃ, bhagavā, āgacchāmī’’ti. ‘‘Anāpatti esā, bhikkhu, nesā āpatti. Anāpannosi, nasi āpanno. Anukkhittosi, nasi ukkhitto. Adhammikenāsi kammena ukkhitto kuppena aṭṭhānārahena. Gaccha tvaṃ, bhikkhu, tattheva vāsabhagāme nivāsaṃ kappehī’’ti. ‘‘Evaṃ, bhante’’ti kho kassapagotto bhikkhu bhagavato paṭissuṇitvā uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā yena vāsabhagāmo tena pakkāmi."
    ],
    "innerText": "Atha kho kassapagottassa bhikkhuno etadahosi – ''ahaṃ kho etaṃ na jānāmi 'āpatti vā esā anāpatti vā, āpanno camhi [vamhi (?)] anāpanno vā, ukkhitto camhi anukkhitto vā, dhammikena vā adhammikena vā, kuppena vā akuppena vā, ṭhānārahena vā aṭṭhānārahena vā’. Yaṃnūnāhaṃ campaṃ gantvā bhagavantaṃ etamatthaṃ puccheyya’’nti. Atha kho kassapagotto bhikkhu senāsanaṃ saṃsāmetvā pattacīvaramādāya yena campā tena pakkāmi. Anupubbena yena campā yena bhagavā tenupasaṅkami, upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Āciṇṇaṃ kho panetaṃ buddhānaṃ bhagavantānaṃ āgantukehi bhikkhūhi saddhiṃ paṭisammodituṃ. Atha kho bhagavā kassapagottaṃ bhikkhuṃ etadavoca – ‘‘kacci, bhikkhu, khamanīyaṃ, kacci yāpanīyaṃ, kacci appakilamathena addhānaṃ āgato, kuto ca tvaṃ, bhikkhu, āgacchasī’’ti? ‘‘Khamanīyaṃ, bhagavā; yāpanīyaṃ, bhagavā; appakilamathena cāhaṃ, bhante, addhānaṃ āgato. Atthi, bhante, kāsīsu janapade vāsabhagāmo nāma. Tatthāhaṃ, bhagavā, āvāsiko tantibaddho ussukkaṃ āpanno – ‘kinti anāgatā ca pesalā bhikkhū āgaccheyyuṃ, āgatā ca pesalā bhikkhū phāsu vihareyyuṃ, ayañca āvāso vuddhiṃ viruḷhiṃ vepullaṃ āpajjeyyā’ti. Atha kho, bhante, sambahulā bhikkhū kāsīsu cārikaṃ caramānā yena vāsabhagāmo tadavasaruṃ. Addasaṃ kho ahaṃ, bhante, te bhikkhū dūratova āgacchante, disvāna āsanaṃ paññapesiṃ, pādodakaṃ pādapīṭhaṃ pādakathalikaṃ upanikkhipiṃ, paccuggantvā pattacīvaraṃ paṭiggahesiṃ, pānīyena apucchiṃ, nahāne ussukkaṃ akāsiṃ, ussukkampi akāsiṃ yāguyā khādanīye bhattasmiṃ . Atha kho tesaṃ, bhante, āgantukānaṃ bhikkhūnaṃ etadahosi – ‘bhaddako kho ayaṃ āvuso āvāsiko bhikkhu nahāne ussukkaṃ karoti, ussukkampi karoti yāguyā khādanīye bhattasmiṃ. Handa, mayaṃ, āvuso, idheva vāsabhagāme nivāsaṃ kappemā’ti. Atha kho te, bhante, āgantukā bhikkhū tattheva vāsabhagāme nivāsaṃ kappesuṃ. Tassa mayhaṃ, bhante, etadahosi – ‘yo kho imesaṃ āgantukānaṃ bhikkhūnaṃ āgantukakilamatho so paṭippassaddho. Yepime gocare appakataññuno tedānime gocare pakataññuno. Dukkaraṃ kho pana parakulesu yāvajīvaṃ ussukkaṃ kātuṃ, viññatti ca manussānaṃ amanāpā. Yaṃnūnāhaṃ na ussukkaṃ kareyyaṃ yāguyā khādanīye bhattasmi’nti. So kho ahaṃ, bhante, na ussukkaṃ akāsiṃ yāguyā khādanīye bhattasmiṃ. Atha kho tesaṃ, bhante, āgantukānaṃ bhikkhūnaṃ etadahosi – ‘pubbe khvāyaṃ, āvuso, āvāsiko bhikkhu nahāne ussukkaṃ karoti, ussukkampi karoti yāguyā khādanīye bhattasmiṃ. Sodānāyaṃ na ussukkaṃ karoti yāguyā khādanīye bhattasmiṃ. Duṭṭhodānāyaṃ, āvuso, āvāsiko bhikkhu. Handa, mayaṃ, āvuso, āvāsikaṃ bhikkhuṃ ukkhipāmā’ti. Atha kho te, bhante, āgantukā bhikkhū sannipatitvā maṃ etadavocuṃ – ‘pubbe kho tvaṃ, āvuso, nahāne ussukkaṃ karosi, ussukkampi karosi yāguyā khādanīye bhattasmiṃ. Sodāni tvaṃ na ussukkaṃ karosi yāguyā khādanīye bhattasmiṃ. Āpattiṃ tvaṃ, āvuso, āpanno. Passasetaṃ āpatti’nti ? ‘Natthi me, āvuso, āpatti yamahaṃ passeyya’nti. Atha kho te, bhante, āgantukā bhikkhū maṃ āpattiyā adassane ukkhipiṃsu. Tassa mayhaṃ, bhante, etadahosi – ‘ahaṃ kho etaṃ na jānāmi ‘āpatti vā esā anāpatti vā, āpanno camhi anāpanno vā, ukkhitto camhi anukkhitto vā, dhammikena vā adhammikena vā, kuppena vā akuppena vā, ṭhānārahena vā aṭṭhānārahena vā’. Yaṃnūnāhaṃ campaṃ gantvā bhagavantaṃ etamatthaṃ puccheyya’nti. Tato ahaṃ, bhagavā, āgacchāmī’’ti. ‘‘Anāpatti esā, bhikkhu, nesā āpatti. Anāpannosi, nasi āpanno. Anukkhittosi, nasi ukkhitto. Adhammikenāsi kammena ukkhitto kuppena aṭṭhānārahena. Gaccha tvaṃ, bhikkhu, tattheva vāsabhagāme nivāsaṃ kappehī’’ti. ‘‘Evaṃ, bhante’’ti kho kassapagotto bhikkhu bhagavato paṭissuṇitvā uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā yena vāsabhagāmo tena pakkāmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "381"
      },
      ". Atha ",
      " kho tesaṃ āgantukānaṃ bhikkhūnaṃ ahudeva kukkuccaṃ, ahu vippaṭisāro – ‘‘alābhā vata no, na vata no lābhā, dulladdhaṃ vata no, na vata no suladdhaṃ, ye mayaṃ suddhaṃ bhikkhuṃ anāpattikaṃ avatthusmiṃ akāraṇe ukkhipimhā. Handa, mayaṃ, āvuso, campaṃ gantvā bhagavato santike accayaṃ accayato desemā’’ti. Atha kho te āgantukā bhikkhū senāsanaṃ saṃsāmetvā pattacīvaramādāya yena campā tena pakkamiṃsu. Anupubbena ",
      " yena campā yena bhagavā tenupasaṅkamiṃsu, upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Āciṇṇaṃ kho panetaṃ buddhānaṃ bhagavantānaṃ āgantukehi bhikkhūhi saddhiṃ paṭisammodituṃ. Atha kho bhagavā te bhikkhū etadavoca – ‘‘kacci, bhikkhave, khamanīyaṃ, kacci yāpanīyaṃ, kaccittha appakilamathena addhānaṃ āgatā, kuto ca tumhe, bhikkhave, āgacchathā’’ti ",
      "? ‘‘Khamanīyaṃ, bhagavā; yāpanīyaṃ, bhagavā; appakilamathena ca mayaṃ, bhante, addhānaṃ āgatā. Atthi, bhante, kāsīsu janapade vāsabhagāmo nāma. Tato mayaṃ, bhagavā, āgacchāmā’’ti. ‘‘Tumhe, bhikkhave, āvāsikaṃ bhikkhuṃ ukkhipitthā’’ti? ‘‘Evaṃ, bhante’’ti. ‘‘Kismiṃ, bhikkhave, vatthusmiṃ kāraṇe’’ti? ‘‘Avatthusmiṃ, bhagavā, akāraṇe’’ti. Vigarahi buddho bhagavā – ‘‘ananucchavikaṃ, moghapurisā, ananulomikaṃ ",
      " appatirūpaṃ assāmaṇakaṃ akappiyaṃ akaraṇīyaṃ. Kathañhi nāma tumhe, moghapurisā, suddhaṃ bhikkhuṃ anāpattikaṃ avatthusmiṃ akāraṇe ukkhipissatha. Netaṃ, moghapurisā, appasannānaṃ vā pasādāya…pe…’’ vigarahitvā dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘na, bhikkhave, suddho bhikkhu anāpattiko avatthusmiṃ akāraṇe ukkhipitabbo. Yo ukkhipeyya, āpatti dukkaṭassā’’ti."
    ],
    "innerText": "381. Atha kho tesaṃ āgantukānaṃ bhikkhūnaṃ ahudeva kukkuccaṃ, ahu vippaṭisāro – ‘‘alābhā vata no, na vata no lābhā, dulladdhaṃ vata no, na vata no suladdhaṃ, ye mayaṃ suddhaṃ bhikkhuṃ anāpattikaṃ avatthusmiṃ akāraṇe ukkhipimhā. Handa, mayaṃ, āvuso, campaṃ gantvā bhagavato santike accayaṃ accayato desemā’’ti. Atha kho te āgantukā bhikkhū senāsanaṃ saṃsāmetvā pattacīvaramādāya yena campā tena pakkamiṃsu. Anupubbena yena campā yena bhagavā tenupasaṅkamiṃsu, upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Āciṇṇaṃ kho panetaṃ buddhānaṃ bhagavantānaṃ āgantukehi bhikkhūhi saddhiṃ paṭisammodituṃ. Atha kho bhagavā te bhikkhū etadavoca – ‘‘kacci, bhikkhave, khamanīyaṃ, kacci yāpanīyaṃ, kaccittha appakilamathena addhānaṃ āgatā, kuto ca tumhe, bhikkhave, āgacchathā’’ti ? ‘‘Khamanīyaṃ, bhagavā; yāpanīyaṃ, bhagavā; appakilamathena ca mayaṃ, bhante, addhānaṃ āgatā. Atthi, bhante, kāsīsu janapade vāsabhagāmo nāma. Tato mayaṃ, bhagavā, āgacchāmā’’ti. ‘‘Tumhe, bhikkhave, āvāsikaṃ bhikkhuṃ ukkhipitthā’’ti? ‘‘Evaṃ, bhante’’ti. ‘‘Kismiṃ, bhikkhave, vatthusmiṃ kāraṇe’’ti? ‘‘Avatthusmiṃ, bhagavā, akāraṇe’’ti. Vigarahi buddho bhagavā – ‘‘ananucchavikaṃ, moghapurisā, ananulomikaṃ appatirūpaṃ assāmaṇakaṃ akappiyaṃ akaraṇīyaṃ. Kathañhi nāma tumhe, moghapurisā, suddhaṃ bhikkhuṃ anāpattikaṃ avatthusmiṃ akāraṇe ukkhipissatha. Netaṃ, moghapurisā, appasannānaṃ vā pasādāya…pe…’’ vigarahitvā dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘na, bhikkhave, suddho bhikkhu anāpattiko avatthusmiṃ akāraṇe ukkhipitabbo. Yo ukkhipeyya, āpatti dukkaṭassā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho te bhikkhū uṭṭhāyāsanā ekaṃsaṃ uttarāsaṅgaṃ karitvā bhagavato pādesu sirasā nipatitvā bhagavantaṃ etadavocuṃ – ‘‘accayo no, bhante, accagamā yathābāle yathāmūḷhe ",
      " yathāakusale, ye mayaṃ suddhaṃ bhikkhuṃ anāpattikaṃ avatthusmiṃ akāraṇe ukkhipimhā. Tesaṃ no, bhante, bhagavā accayaṃ accayato paṭiggaṇhātu āyatiṃ saṃvarāyā’’ti. ‘‘Taggha, tumhe, bhikkhave, accayo accagamā yathābāle yathāmūḷhe yathāakusale, ye tumhe suddhaṃ bhikkhuṃ anāpattikaṃ avatthusmiṃ akāraṇe ukkhipittha. Yato ca kho tumhe, bhikkhave, accayaṃ accayato disvā yathādhammaṃ paṭikarotha, taṃ vo mayaṃ paṭiggaṇhāma. Vuddhihesā ",
      ", bhikkhave, ariyassa vinaye yo accayaṃ accayato disvā yathādhammaṃ paṭikaroti, āyatiṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[āyatiṃ ca (sī.)]"
      },
      " saṃvaraṃ āpajjatī’’ti."
    ],
    "innerText": "Atha kho te bhikkhū uṭṭhāyāsanā ekaṃsaṃ uttarāsaṅgaṃ karitvā bhagavato pādesu sirasā nipatitvā bhagavantaṃ etadavocuṃ – ‘‘accayo no, bhante, accagamā yathābāle yathāmūḷhe yathāakusale, ye mayaṃ suddhaṃ bhikkhuṃ anāpattikaṃ avatthusmiṃ akāraṇe ukkhipimhā. Tesaṃ no, bhante, bhagavā accayaṃ accayato paṭiggaṇhātu āyatiṃ saṃvarāyā’’ti. ‘‘Taggha, tumhe, bhikkhave, accayo accagamā yathābāle yathāmūḷhe yathāakusale, ye tumhe suddhaṃ bhikkhuṃ anāpattikaṃ avatthusmiṃ akāraṇe ukkhipittha. Yato ca kho tumhe, bhikkhave, accayaṃ accayato disvā yathādhammaṃ paṭikarotha, taṃ vo mayaṃ paṭiggaṇhāma. Vuddhihesā , bhikkhave, ariyassa vinaye yo accayaṃ accayato disvā yathādhammaṃ paṭikaroti, āyatiṃ [āyatiṃ ca (sī.)] saṃvaraṃ āpajjatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Kassapagottabhikkhuvatthu niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "235. Adhammena vaggādikammakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "382"
      },
      ". Tena kho pana samayena campāyaṃ bhikkhū evarūpāni kammāni karonti – adhammena vaggakammaṃ karonti, adhammena samaggakammaṃ karonti; dhammena vaggakammaṃ karonti, dhammapatirūpakena vaggakammaṃ karonti; dhammapatirūpakena samaggakammaṃ karonti; ekopi ekaṃ ukkhipati, ekopi dve ukkhipati, ekopi sambahule ukkhipati, ekopi saṅghaṃ ukkhipati; dvepi ekaṃ ukkhipanti, dvepi dve ukkhipanti, dvepi sambahule ukkhipanti, dvepi saṅghaṃ ukkhipanti ",
      "; sambahulāpi ",
      " ekaṃ ukkhipanti; sambahulāpi dve ukkhipanti, sambahulāpi sambahule ukkhipanti, sambahulāpi saṅghaṃ ukkhipanti; saṅghopi saṅghaṃ ukkhipati. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma campāyaṃ bhikkhū evarūpāni kammāni karissanti – adhammena vaggakammaṃ karissanti, adhammena samaggakammaṃ karissanti, dhammena vaggakammaṃ karissanti, dhammapatirūpakena vaggakammaṃ karissanti, dhammapatirūpakena samaggakammaṃ karissanti, ekopi ekaṃ ukkhipissati, ekopi dve ukkhipissati, ekopi sambahule ukkhipissati, ekopi saṅghaṃ ukkhipissati, dvepi ekaṃ ukkhipissanti, dvepi dve ukkhipissanti, dvepi sambahule ukkhipissanti, dvepi saṅghaṃ ukkhipissanti, sambahulāpi ekaṃ ukkhipissanti, sambahulāpi dve ukkhipissanti, sambahulāpi sambahule ukkhipissanti, sambahulāpi saṅghaṃ ukkhipissanti, saṅghopi saṅghaṃ ukkhipissatī’’ti. Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… ‘‘saccaṃ kira, bhikkhave, campāyaṃ bhikkhū evarūpāni kammāni karonti – adhammena ",
      " vaggakammaṃ karonti…pe… saṅghopi saṅghaṃ ukkhipatī’’ti? ‘‘Saccaṃ, bhagavā’’ti. Vigarahi buddho bhagavā – ‘‘ananucchavikaṃ, bhikkhave, tesaṃ moghapurisānaṃ ananulomikaṃ appatirūpaṃ assāmaṇakaṃ akappiyaṃ akaraṇīyaṃ. Kathañhi nāma te, bhikkhave, moghapurisā evarūpāni kammāni karissanti – adhammena vaggakammaṃ karissanti…pe… saṅghopi saṅghaṃ ukkhipissati. Netaṃ, bhikkhave, appasannānaṃ vā pasādāya…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi –"
    ],
    "innerText": "382. Tena kho pana samayena campāyaṃ bhikkhū evarūpāni kammāni karonti – adhammena vaggakammaṃ karonti, adhammena samaggakammaṃ karonti; dhammena vaggakammaṃ karonti, dhammapatirūpakena vaggakammaṃ karonti; dhammapatirūpakena samaggakammaṃ karonti; ekopi ekaṃ ukkhipati, ekopi dve ukkhipati, ekopi sambahule ukkhipati, ekopi saṅghaṃ ukkhipati; dvepi ekaṃ ukkhipanti, dvepi dve ukkhipanti, dvepi sambahule ukkhipanti, dvepi saṅghaṃ ukkhipanti ; sambahulāpi ekaṃ ukkhipanti; sambahulāpi dve ukkhipanti, sambahulāpi sambahule ukkhipanti, sambahulāpi saṅghaṃ ukkhipanti; saṅghopi saṅghaṃ ukkhipati. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma campāyaṃ bhikkhū evarūpāni kammāni karissanti – adhammena vaggakammaṃ karissanti, adhammena samaggakammaṃ karissanti, dhammena vaggakammaṃ karissanti, dhammapatirūpakena vaggakammaṃ karissanti, dhammapatirūpakena samaggakammaṃ karissanti, ekopi ekaṃ ukkhipissati, ekopi dve ukkhipissati, ekopi sambahule ukkhipissati, ekopi saṅghaṃ ukkhipissati, dvepi ekaṃ ukkhipissanti, dvepi dve ukkhipissanti, dvepi sambahule ukkhipissanti, dvepi saṅghaṃ ukkhipissanti, sambahulāpi ekaṃ ukkhipissanti, sambahulāpi dve ukkhipissanti, sambahulāpi sambahule ukkhipissanti, sambahulāpi saṅghaṃ ukkhipissanti, saṅghopi saṅghaṃ ukkhipissatī’’ti. Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… ‘‘saccaṃ kira, bhikkhave, campāyaṃ bhikkhū evarūpāni kammāni karonti – adhammena vaggakammaṃ karonti…pe… saṅghopi saṅghaṃ ukkhipatī’’ti? ‘‘Saccaṃ, bhagavā’’ti. Vigarahi buddho bhagavā – ‘‘ananucchavikaṃ, bhikkhave, tesaṃ moghapurisānaṃ ananulomikaṃ appatirūpaṃ assāmaṇakaṃ akappiyaṃ akaraṇīyaṃ. Kathañhi nāma te, bhikkhave, moghapurisā evarūpāni kammāni karissanti – adhammena vaggakammaṃ karissanti…pe… saṅghopi saṅghaṃ ukkhipissati. Netaṃ, bhikkhave, appasannānaṃ vā pasādāya…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "383"
      },
      ". ‘‘Adhammena ",
      " ce, bhikkhave, vaggakammaṃ akammaṃ na ca karaṇīyaṃ, adhammena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[adhammena ce bhikkhave (syā.)]"
      },
      " samaggakammaṃ akammaṃ na ca karaṇīyaṃ, dhammena vaggakammaṃ akammaṃ na ca karaṇīyaṃ; dhammapatirūpakena vaggakammaṃ akammaṃ na ca karaṇīyaṃ, dhammapatirūpakena samaggakammaṃ akammaṃ na ca karaṇīyaṃ; ekopi ekaṃ ukkhipati akammaṃ na ca karaṇīyaṃ, ekopi dve ukkhipati akammaṃ na ca karaṇīyaṃ, ekopi sambahule ukkhipati akammaṃ na ca karaṇīyaṃ, ekopi saṅghaṃ ukkhipati akammaṃ na ca karaṇīyaṃ; dvepi ekaṃ ukkhipanti akammaṃ na ca karaṇīyaṃ, dvepi dve ukkhipanti akammaṃ na ca karaṇīyaṃ, dvepi sambahule ukkhipanti akammaṃ na ca karaṇīyaṃ, dvepi ",
      " saṅghaṃ ukkhipanti akammaṃ na ca karaṇīyaṃ; sambahulāpi ekaṃ ukkhipanti akammaṃ na ca karaṇīyaṃ, sambahulāpi dve ukkhipanti akammaṃ na ca karaṇīyaṃ, sambahulāpi sambahule ukkhipanti akammaṃ na ca karaṇīyaṃ, sambahulāpi saṅghaṃ ukkhipanti akammaṃ na ca karaṇīyaṃ; saṅghopi saṅghaṃ ukkhipati akammaṃ na ca karaṇīyaṃ."
    ],
    "innerText": "383. ‘‘Adhammena ce, bhikkhave, vaggakammaṃ akammaṃ na ca karaṇīyaṃ, adhammena [adhammena ce bhikkhave (syā.)] samaggakammaṃ akammaṃ na ca karaṇīyaṃ, dhammena vaggakammaṃ akammaṃ na ca karaṇīyaṃ; dhammapatirūpakena vaggakammaṃ akammaṃ na ca karaṇīyaṃ, dhammapatirūpakena samaggakammaṃ akammaṃ na ca karaṇīyaṃ; ekopi ekaṃ ukkhipati akammaṃ na ca karaṇīyaṃ, ekopi dve ukkhipati akammaṃ na ca karaṇīyaṃ, ekopi sambahule ukkhipati akammaṃ na ca karaṇīyaṃ, ekopi saṅghaṃ ukkhipati akammaṃ na ca karaṇīyaṃ; dvepi ekaṃ ukkhipanti akammaṃ na ca karaṇīyaṃ, dvepi dve ukkhipanti akammaṃ na ca karaṇīyaṃ, dvepi sambahule ukkhipanti akammaṃ na ca karaṇīyaṃ, dvepi saṅghaṃ ukkhipanti akammaṃ na ca karaṇīyaṃ; sambahulāpi ekaṃ ukkhipanti akammaṃ na ca karaṇīyaṃ, sambahulāpi dve ukkhipanti akammaṃ na ca karaṇīyaṃ, sambahulāpi sambahule ukkhipanti akammaṃ na ca karaṇīyaṃ, sambahulāpi saṅghaṃ ukkhipanti akammaṃ na ca karaṇīyaṃ; saṅghopi saṅghaṃ ukkhipati akammaṃ na ca karaṇīyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "384"
      },
      ". ‘‘Cattārimāni ",
      ", bhikkhave, kammāni – adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena vaggakammaṃ, dhammena samaggakammaṃ. Tatra, bhikkhave, yadidaṃ adhammena vaggakammaṃ, idaṃ, bhikkhave, kammaṃ adhammattā vaggattā kuppaṃ aṭṭhānārahaṃ; na, bhikkhave, evarūpaṃ kammaṃ kātabbaṃ, na ca mayā evarūpaṃ kammaṃ anuññātaṃ. Tatra, bhikkhave, yadidaṃ adhammena samaggakammaṃ, idaṃ, bhikkhave, kammaṃ adhammattā kuppaṃ aṭṭhānārahaṃ; na, bhikkhave, evarūpaṃ kammaṃ kātabbaṃ, na ca mayā evarūpaṃ kammaṃ anuññātaṃ. Tatra, bhikkhave, yadidaṃ dhammena vaggakammaṃ, idaṃ, bhikkhave, kammaṃ vaggattā kuppaṃ aṭṭhānārahaṃ; na, bhikkhave, evarūpaṃ kammaṃ kātabbaṃ, na ca mayā evarūpaṃ kammaṃ anuññātaṃ. Tatra, bhikkhave, yadidaṃ dhammena samaggakammaṃ, idaṃ, bhikkhave, kammaṃ dhammattā samaggattā akuppaṃ ṭhānārahaṃ; evarūpaṃ, bhikkhave, kammaṃ kātabbaṃ, evarūpañca mayā kammaṃ anuññātaṃ. Tasmātiha, bhikkhave, evarūpaṃ kammaṃ karissāma yadidaṃ dhammena samagganti – evañhi ",
      " vo, bhikkhave, sikkhitabba’’nti."
    ],
    "innerText": "384. ‘‘Cattārimāni , bhikkhave, kammāni – adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena vaggakammaṃ, dhammena samaggakammaṃ. Tatra, bhikkhave, yadidaṃ adhammena vaggakammaṃ, idaṃ, bhikkhave, kammaṃ adhammattā vaggattā kuppaṃ aṭṭhānārahaṃ; na, bhikkhave, evarūpaṃ kammaṃ kātabbaṃ, na ca mayā evarūpaṃ kammaṃ anuññātaṃ. Tatra, bhikkhave, yadidaṃ adhammena samaggakammaṃ, idaṃ, bhikkhave, kammaṃ adhammattā kuppaṃ aṭṭhānārahaṃ; na, bhikkhave, evarūpaṃ kammaṃ kātabbaṃ, na ca mayā evarūpaṃ kammaṃ anuññātaṃ. Tatra, bhikkhave, yadidaṃ dhammena vaggakammaṃ, idaṃ, bhikkhave, kammaṃ vaggattā kuppaṃ aṭṭhānārahaṃ; na, bhikkhave, evarūpaṃ kammaṃ kātabbaṃ, na ca mayā evarūpaṃ kammaṃ anuññātaṃ. Tatra, bhikkhave, yadidaṃ dhammena samaggakammaṃ, idaṃ, bhikkhave, kammaṃ dhammattā samaggattā akuppaṃ ṭhānārahaṃ; evarūpaṃ, bhikkhave, kammaṃ kātabbaṃ, evarūpañca mayā kammaṃ anuññātaṃ. Tasmātiha, bhikkhave, evarūpaṃ kammaṃ karissāma yadidaṃ dhammena samagganti – evañhi vo, bhikkhave, sikkhitabba’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Adhammena vaggādikammakathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "236. Ñattivipannakammādikathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "385"
      },
      ". Tena kho pana samayena chabbaggiyā bhikkhū evarūpāni kammāni karonti – adhammena vaggakammaṃ karonti, adhammena samaggakammaṃ karonti; dhammena vaggakammaṃ ",
      " karonti, dhammapatirūpakena vaggakammaṃ karonti, dhammapatirūpakena samaggakammaṃ karonti; ñattivipannampi kammaṃ karonti anussāvanasampannaṃ, anussāvanavipannampi kammaṃ karonti ñattisampannaṃ, ñattivipannampi ",
      " anussāvanavipannampi kammaṃ karonti; aññatrāpi dhammā kammaṃ karonti, aññatrāpi vinayā kammaṃ karonti, aññatrāpi satthusāsanā kammaṃ karonti; paṭikuṭṭhakatampi kammaṃ karonti adhammikaṃ kuppaṃ aṭṭhānārahaṃ. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma chabbaggiyā bhikkhū evarūpāni kammāni karissanti – adhammena vaggakammaṃ karissanti, adhammena samaggakammaṃ karissanti; dhammena vaggakammaṃ karissanti, dhammapatirūpakena vaggakammaṃ karissanti, dhammapatirūpakena samaggakammaṃ karissanti; ñattivipannampi kammaṃ karissanti anussāvanasampannaṃ, anussāvanavipannampi kammaṃ karissanti ñattisampannaṃ, ñattivipannampi anussāvanavipannampi kammaṃ karissanti; aññatrāpi dhammā kammaṃ karissanti, aññatrāpi vinayā kammaṃ karissanti, aññatrāpi satthusāsanā kammaṃ karissanti; paṭikuṭṭhakatampi kammaṃ karissanti adhammikaṃ kuppaṃ aṭṭhānāraha’’nti. Atha kho te bhikkhū ",
      " bhagavato etamatthaṃ ārocesuṃ…pe… ‘‘saccaṃ kira, bhikkhave, chabbaggiyā bhikkhū evarūpāni kammāni karonti – adhammena vaggakammaṃ karonti…pe… paṭikuṭṭhakatampi kammaṃ karonti adhammikaṃ kuppaṃ aṭṭhānāraha’’nti? ‘‘Saccaṃ, bhagavā’’ti. Vigarahi buddho bhagavā…pe… vigarahitvā dhammiṃ kathaṃ katvā bhikkhū āmantesi –"
    ],
    "innerText": "385. Tena kho pana samayena chabbaggiyā bhikkhū evarūpāni kammāni karonti – adhammena vaggakammaṃ karonti, adhammena samaggakammaṃ karonti; dhammena vaggakammaṃ karonti, dhammapatirūpakena vaggakammaṃ karonti, dhammapatirūpakena samaggakammaṃ karonti; ñattivipannampi kammaṃ karonti anussāvanasampannaṃ, anussāvanavipannampi kammaṃ karonti ñattisampannaṃ, ñattivipannampi anussāvanavipannampi kammaṃ karonti; aññatrāpi dhammā kammaṃ karonti, aññatrāpi vinayā kammaṃ karonti, aññatrāpi satthusāsanā kammaṃ karonti; paṭikuṭṭhakatampi kammaṃ karonti adhammikaṃ kuppaṃ aṭṭhānārahaṃ. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma chabbaggiyā bhikkhū evarūpāni kammāni karissanti – adhammena vaggakammaṃ karissanti, adhammena samaggakammaṃ karissanti; dhammena vaggakammaṃ karissanti, dhammapatirūpakena vaggakammaṃ karissanti, dhammapatirūpakena samaggakammaṃ karissanti; ñattivipannampi kammaṃ karissanti anussāvanasampannaṃ, anussāvanavipannampi kammaṃ karissanti ñattisampannaṃ, ñattivipannampi anussāvanavipannampi kammaṃ karissanti; aññatrāpi dhammā kammaṃ karissanti, aññatrāpi vinayā kammaṃ karissanti, aññatrāpi satthusāsanā kammaṃ karissanti; paṭikuṭṭhakatampi kammaṃ karissanti adhammikaṃ kuppaṃ aṭṭhānāraha’’nti. Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… ‘‘saccaṃ kira, bhikkhave, chabbaggiyā bhikkhū evarūpāni kammāni karonti – adhammena vaggakammaṃ karonti…pe… paṭikuṭṭhakatampi kammaṃ karonti adhammikaṃ kuppaṃ aṭṭhānāraha’’nti? ‘‘Saccaṃ, bhagavā’’ti. Vigarahi buddho bhagavā…pe… vigarahitvā dhammiṃ kathaṃ katvā bhikkhū āmantesi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "386"
      },
      ". ‘‘Adhammena ce, bhikkhave, vaggakammaṃ akammaṃ na ca karaṇīyaṃ ",
      "; adhammena samaggakammaṃ akammaṃ na ca karaṇīyaṃ; dhammena vaggakammaṃ akammaṃ na ca karaṇīyaṃ; dhammapatirūpakena vaggakammaṃ akammaṃ na ca karaṇīyaṃ; dhammapatirūpakena samaggakammaṃ akammaṃ na ca karaṇīyaṃ. Ñattivipannañce, bhikkhave, kammaṃ anussāvanasampannaṃ akammaṃ na ca karaṇīyaṃ; anussāvanavipannañce, bhikkhave, kammaṃ ñattisampannaṃ akammaṃ na ca karaṇīyaṃ; ñattivipannañce, bhikkhave, kammaṃ anussāvanavipannaṃ akammaṃ na ca karaṇīyaṃ; aññatrāpi dhammā kammaṃ akammaṃ na ca karaṇīyaṃ; aññatrāpi vinayā kammaṃ akammaṃ na ca karaṇīyaṃ; aññatrāpi satthusāsanā kammaṃ akammaṃ na ca karaṇīyaṃ; paṭikuṭṭhakatañce, bhikkhave, kammaṃ adhammikaṃ kuppaṃ aṭṭhānārahaṃ akammaṃ na ca karaṇīyaṃ."
    ],
    "innerText": "386. ‘‘Adhammena ce, bhikkhave, vaggakammaṃ akammaṃ na ca karaṇīyaṃ ; adhammena samaggakammaṃ akammaṃ na ca karaṇīyaṃ; dhammena vaggakammaṃ akammaṃ na ca karaṇīyaṃ; dhammapatirūpakena vaggakammaṃ akammaṃ na ca karaṇīyaṃ; dhammapatirūpakena samaggakammaṃ akammaṃ na ca karaṇīyaṃ. Ñattivipannañce, bhikkhave, kammaṃ anussāvanasampannaṃ akammaṃ na ca karaṇīyaṃ; anussāvanavipannañce, bhikkhave, kammaṃ ñattisampannaṃ akammaṃ na ca karaṇīyaṃ; ñattivipannañce, bhikkhave, kammaṃ anussāvanavipannaṃ akammaṃ na ca karaṇīyaṃ; aññatrāpi dhammā kammaṃ akammaṃ na ca karaṇīyaṃ; aññatrāpi vinayā kammaṃ akammaṃ na ca karaṇīyaṃ; aññatrāpi satthusāsanā kammaṃ akammaṃ na ca karaṇīyaṃ; paṭikuṭṭhakatañce, bhikkhave, kammaṃ adhammikaṃ kuppaṃ aṭṭhānārahaṃ akammaṃ na ca karaṇīyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "387"
      },
      ". Chayimāni, bhikkhave, kammāni – adhammakammaṃ, vaggakammaṃ, samaggakammaṃ, dhammapatirūpakena vaggakammaṃ, dhammapatirūpakena samaggakammaṃ, dhammena samaggakammaṃ."
    ],
    "innerText": "387. Chayimāni, bhikkhave, kammāni – adhammakammaṃ, vaggakammaṃ, samaggakammaṃ, dhammapatirūpakena vaggakammaṃ, dhammapatirūpakena samaggakammaṃ, dhammena samaggakammaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katamañca ",
      ", bhikkhave, adhammakammaṃ? Ñattidutiye ce, bhikkhave, kamme ekāya ñattiyā kammaṃ karoti, na ca kammavācaṃ anussāveti – adhammakammaṃ. Ñattidutiye ce, bhikkhave, kamme dvīhi ñattīhi kammaṃ karoti, na ca kammavācaṃ anussāveti – adhammakammaṃ. Ñattidutiye ce, bhikkhave, kamme ekāya kammavācāya kammaṃ karoti, na ca ñattiṃ ṭhapeti ",
      " – adhammakammaṃ. Ñattidutiye ce, bhikkhave, kamme dvīhi kammavācāhi kammaṃ karoti, na ca ñattiṃ ṭhapeti – adhammakammaṃ. Ñatticatutthe ce, bhikkhave, kamme ekāya ñattiyā kammaṃ karoti, na ca kammavācaṃ anussāveti – adhammakammaṃ ",
      ". Ñatticatutthe ce, bhikkhave, kamme dvīhi ñattīhi kammaṃ karoti, na ca kammavācaṃ anussāveti – adhammakammaṃ. Ñatticatutthe ce, bhikkhave, kamme tīhi ñattīhi kammaṃ karoti, na ca kammavācaṃ anussāveti – adhammakammaṃ. Ñatticatutthe ce, bhikkhave, kamme catūhi ñattīhi kammaṃ karoti, na ca kammavācaṃ anussāveti – adhammakammaṃ. Ñatticatutthe ce, bhikkhave, kamme ekāya kammavācāya kammaṃ karoti, na ca ñattiṃ ṭhapeti – adhammakammaṃ. Ñatticatutthe ce, bhikkhave, kamme dvīhi kammavācāhi ",
      " kammaṃ karoti, na ca ñattiṃ ṭhapeti – adhammakammaṃ. Ñatticatutthe ce, bhikkhave, kamme tīhi kammavācāhi kammaṃ karoti, na ca ñattiṃ ṭhapeti – adhammakammaṃ. Ñatticatutthe ce, bhikkhave, kamme catūhi kammavācāhi kammaṃ karoti, na ca ñattiṃ ṭhapeti – adhammakammaṃ. Idaṃ vuccati, bhikkhave, adhammakammaṃ."
    ],
    "innerText": "Katamañca , bhikkhave, adhammakammaṃ? Ñattidutiye ce, bhikkhave, kamme ekāya ñattiyā kammaṃ karoti, na ca kammavācaṃ anussāveti – adhammakammaṃ. Ñattidutiye ce, bhikkhave, kamme dvīhi ñattīhi kammaṃ karoti, na ca kammavācaṃ anussāveti – adhammakammaṃ. Ñattidutiye ce, bhikkhave, kamme ekāya kammavācāya kammaṃ karoti, na ca ñattiṃ ṭhapeti – adhammakammaṃ. Ñattidutiye ce, bhikkhave, kamme dvīhi kammavācāhi kammaṃ karoti, na ca ñattiṃ ṭhapeti – adhammakammaṃ. Ñatticatutthe ce, bhikkhave, kamme ekāya ñattiyā kammaṃ karoti, na ca kammavācaṃ anussāveti – adhammakammaṃ . Ñatticatutthe ce, bhikkhave, kamme dvīhi ñattīhi kammaṃ karoti, na ca kammavācaṃ anussāveti – adhammakammaṃ. Ñatticatutthe ce, bhikkhave, kamme tīhi ñattīhi kammaṃ karoti, na ca kammavācaṃ anussāveti – adhammakammaṃ. Ñatticatutthe ce, bhikkhave, kamme catūhi ñattīhi kammaṃ karoti, na ca kammavācaṃ anussāveti – adhammakammaṃ. Ñatticatutthe ce, bhikkhave, kamme ekāya kammavācāya kammaṃ karoti, na ca ñattiṃ ṭhapeti – adhammakammaṃ. Ñatticatutthe ce, bhikkhave, kamme dvīhi kammavācāhi kammaṃ karoti, na ca ñattiṃ ṭhapeti – adhammakammaṃ. Ñatticatutthe ce, bhikkhave, kamme tīhi kammavācāhi kammaṃ karoti, na ca ñattiṃ ṭhapeti – adhammakammaṃ. Ñatticatutthe ce, bhikkhave, kamme catūhi kammavācāhi kammaṃ karoti, na ca ñattiṃ ṭhapeti – adhammakammaṃ. Idaṃ vuccati, bhikkhave, adhammakammaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katamañca, bhikkhave, vaggakammaṃ? Ñattidutiye ce, bhikkhave, kamme yāvatikā bhikkhū kammappattā te anāgatā honti, chandārahānaṃ chando anāhaṭo hoti, sammukhībhūtā paṭikkosanti – vaggakammaṃ. Ñattidutiye ce, bhikkhave, kamme yāvatikā bhikkhū kammappattā te āgatā honti, chandārahānaṃ chando anāhaṭo hoti, sammukhībhūtā paṭikkosanti – vaggakammaṃ. Ñattidutiye ce, bhikkhave, kamme yāvatikā bhikkhū kammappattā te āgatā honti, chandārahānaṃ chando āhaṭo hoti, sammukhībhūtā paṭikkosanti – vaggakammaṃ. Ñatticatutthe ce, bhikkhave, kamme yāvatikā bhikkhū kammappattā ",
      " te anāgatā honti, chandārahānaṃ chando anāhaṭo hoti, sammukhībhūtā paṭikkosanti – vaggakammaṃ. Ñatticatutthe ce, bhikkhave, kamme yāvatikā bhikkhū kammappattā te āgatā honti, chandārahānaṃ chando anāhaṭo hoti, sammukhībhūtā ",
      " paṭikkosanti – vaggakammaṃ. Ñatticatutthe ce, bhikkhave, kamme yāvatikā bhikkhū kammappattā te āgatā honti, chandārahānaṃ chando āhaṭo hoti, sammukhībhūtā paṭikkosanti – vaggakammaṃ. Idaṃ vuccati, bhikkhave, vaggakammaṃ."
    ],
    "innerText": "Katamañca, bhikkhave, vaggakammaṃ? Ñattidutiye ce, bhikkhave, kamme yāvatikā bhikkhū kammappattā te anāgatā honti, chandārahānaṃ chando anāhaṭo hoti, sammukhībhūtā paṭikkosanti – vaggakammaṃ. Ñattidutiye ce, bhikkhave, kamme yāvatikā bhikkhū kammappattā te āgatā honti, chandārahānaṃ chando anāhaṭo hoti, sammukhībhūtā paṭikkosanti – vaggakammaṃ. Ñattidutiye ce, bhikkhave, kamme yāvatikā bhikkhū kammappattā te āgatā honti, chandārahānaṃ chando āhaṭo hoti, sammukhībhūtā paṭikkosanti – vaggakammaṃ. Ñatticatutthe ce, bhikkhave, kamme yāvatikā bhikkhū kammappattā te anāgatā honti, chandārahānaṃ chando anāhaṭo hoti, sammukhībhūtā paṭikkosanti – vaggakammaṃ. Ñatticatutthe ce, bhikkhave, kamme yāvatikā bhikkhū kammappattā te āgatā honti, chandārahānaṃ chando anāhaṭo hoti, sammukhībhūtā paṭikkosanti – vaggakammaṃ. Ñatticatutthe ce, bhikkhave, kamme yāvatikā bhikkhū kammappattā te āgatā honti, chandārahānaṃ chando āhaṭo hoti, sammukhībhūtā paṭikkosanti – vaggakammaṃ. Idaṃ vuccati, bhikkhave, vaggakammaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Katamañca, bhikkhave, samaggakammaṃ? Ñattidutiye ce, bhikkhave, kamme yāvatikā bhikkhū kammappattā, te āgatā honti, chandārahānaṃ chando āhaṭo hoti, sammukhībhūtā na paṭikkosanti – samaggakammaṃ. Ñatticatutthe ce, bhikkhave, kamme yāvatikā bhikkhū kammappattā, te āgatā honti, chandārahānaṃ chando āhaṭo hoti, sammukhībhūtā na paṭikkosanti – samaggakammaṃ. Idaṃ vuccati, bhikkhave, samaggakammaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katamañca, bhikkhave, dhammapatirūpakena vaggakammaṃ? Ñattidutiye ce, bhikkhave, kamme paṭhamaṃ kammavācaṃ anussāveti, pacchā ñattiṃ ṭhapeti, yāvatikā bhikkhū kammappattā te anāgatā honti, chandārahānaṃ chando anāhaṭo hoti, sammukhībhūtā paṭikkosanti – dhammapatirūpakena vaggakammaṃ. Ñattidutiye ce, bhikkhave, kamme paṭhamaṃ kammavācaṃ anussāveti, pacchā ñattiṃ ṭhapeti, yāvatikā bhikkhū kammappattā te āgatā honti, chandārahānaṃ chando anāhaṭo hoti, sammukhībhūtā paṭikkosanti – dhammapatirūpakena vaggakammaṃ. Ñattidutiye ce, bhikkhave ",
      ", kamme paṭhamaṃ kammavācaṃ ",
      " anussāveti, pacchā ñattiṃ ṭhapeti, yāvatikā bhikkhū kammappattā te āgatā honti, chandārahānaṃ chando āhaṭo hoti, sammukhībhūtā ",
      " paṭikkosanti – dhammapatirūpakena vaggakammaṃ. Ñatticatutthe ce, bhikkhave, kamme paṭhamaṃ kammavācaṃ anussāveti, pacchā ñattiṃ ṭhapeti, yāvatikā bhikkhū kammappattā te anāgatā honti, chandārahānaṃ chando anāhaṭo hoti, sammukhībhūtā paṭikkosanti – dhammapatirūpakena vaggakammaṃ. Ñatticatutthe ce, bhikkhave, kamme paṭhamaṃ kammavācaṃ anussāveti, pacchā ñattiṃ ṭhapeti, yāvatikā bhikkhū kammappattā te āgatā honti, chandārahānaṃ chando anāhaṭo hoti, sammukhībhūtā paṭikkosanti – dhammapatirūpakena vaggakammaṃ. Ñatticatutthe ce, bhikkhave, kamme paṭhamaṃ kammavācaṃ anussāveti, pacchā ñattiṃ ṭhapeti, yāvatikā bhikkhū kammappattā te āgatā honti, chandārahānaṃ chando āhaṭo hoti ",
      ", sammukhībhūtā paṭikkosanti – dhammapatirūpakena vaggakammaṃ. Idaṃ vuccati, bhikkhave, dhammapatirūpakena vaggakammaṃ."
    ],
    "innerText": "Katamañca, bhikkhave, dhammapatirūpakena vaggakammaṃ? Ñattidutiye ce, bhikkhave, kamme paṭhamaṃ kammavācaṃ anussāveti, pacchā ñattiṃ ṭhapeti, yāvatikā bhikkhū kammappattā te anāgatā honti, chandārahānaṃ chando anāhaṭo hoti, sammukhībhūtā paṭikkosanti – dhammapatirūpakena vaggakammaṃ. Ñattidutiye ce, bhikkhave, kamme paṭhamaṃ kammavācaṃ anussāveti, pacchā ñattiṃ ṭhapeti, yāvatikā bhikkhū kammappattā te āgatā honti, chandārahānaṃ chando anāhaṭo hoti, sammukhībhūtā paṭikkosanti – dhammapatirūpakena vaggakammaṃ. Ñattidutiye ce, bhikkhave , kamme paṭhamaṃ kammavācaṃ anussāveti, pacchā ñattiṃ ṭhapeti, yāvatikā bhikkhū kammappattā te āgatā honti, chandārahānaṃ chando āhaṭo hoti, sammukhībhūtā paṭikkosanti – dhammapatirūpakena vaggakammaṃ. Ñatticatutthe ce, bhikkhave, kamme paṭhamaṃ kammavācaṃ anussāveti, pacchā ñattiṃ ṭhapeti, yāvatikā bhikkhū kammappattā te anāgatā honti, chandārahānaṃ chando anāhaṭo hoti, sammukhībhūtā paṭikkosanti – dhammapatirūpakena vaggakammaṃ. Ñatticatutthe ce, bhikkhave, kamme paṭhamaṃ kammavācaṃ anussāveti, pacchā ñattiṃ ṭhapeti, yāvatikā bhikkhū kammappattā te āgatā honti, chandārahānaṃ chando anāhaṭo hoti, sammukhībhūtā paṭikkosanti – dhammapatirūpakena vaggakammaṃ. Ñatticatutthe ce, bhikkhave, kamme paṭhamaṃ kammavācaṃ anussāveti, pacchā ñattiṃ ṭhapeti, yāvatikā bhikkhū kammappattā te āgatā honti, chandārahānaṃ chando āhaṭo hoti , sammukhībhūtā paṭikkosanti – dhammapatirūpakena vaggakammaṃ. Idaṃ vuccati, bhikkhave, dhammapatirūpakena vaggakammaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katamañca, bhikkhave, dhammapatirūpakena samaggakammaṃ? Ñattidutiye ce, bhikkhave, kamme paṭhamaṃ kammavācaṃ anussāveti, pacchā ñattiṃ ",
      " ṭhapeti, yāvatikā bhikkhū kammappattā, te āgatā honti, chandārahānaṃ chando āhaṭo hoti, sammukhībhūtā na paṭikkosanti – dhammapatirūpakena samaggakammaṃ. Ñatticatutthe ce, bhikkhave, kamme paṭhamaṃ kammavācaṃ anussāveti, pacchā ñattiṃ ṭhapeti, yāvatikā bhikkhū kammappattā te āgatā honti, chandārahānaṃ chando āhaṭo hoti, sammukhībhūtā na paṭikkosanti – dhammapatirūpakena samaggakammaṃ. Idaṃ vuccati, bhikkhave, dhammapatirūpakena samaggakammaṃ."
    ],
    "innerText": "Katamañca, bhikkhave, dhammapatirūpakena samaggakammaṃ? Ñattidutiye ce, bhikkhave, kamme paṭhamaṃ kammavācaṃ anussāveti, pacchā ñattiṃ ṭhapeti, yāvatikā bhikkhū kammappattā, te āgatā honti, chandārahānaṃ chando āhaṭo hoti, sammukhībhūtā na paṭikkosanti – dhammapatirūpakena samaggakammaṃ. Ñatticatutthe ce, bhikkhave, kamme paṭhamaṃ kammavācaṃ anussāveti, pacchā ñattiṃ ṭhapeti, yāvatikā bhikkhū kammappattā te āgatā honti, chandārahānaṃ chando āhaṭo hoti, sammukhībhūtā na paṭikkosanti – dhammapatirūpakena samaggakammaṃ. Idaṃ vuccati, bhikkhave, dhammapatirūpakena samaggakammaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Katamañca, bhikkhave, dhammena samaggakammaṃ? Ñattidutiye ce, bhikkhave, kamme paṭhamaṃ ñattiṃ ṭhapeti, pacchā ekāya kammavācāya kammaṃ karoti, yāvatikā bhikkhū kammappattā te āgatā honti, chandārahānaṃ chando āhaṭo hoti, sammukhībhūtā na paṭikkosanti – dhammena samaggakammaṃ. Ñatticatutthe ce, bhikkhave, kamme paṭhamaṃ ñattiṃ ṭhapeti, pacchā tīhi kammavācāhi kammaṃ karoti, yāvatikā bhikkhū kammappattā, te āgatā honti, chandārahānaṃ chando āhaṭo hoti, sammukhībhūtā na paṭikkosanti, dhammena samaggakammaṃ. Idaṃ vuccati, bhikkhave, dhammena samaggakammaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ñattivipannakammādikathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "237. Catuvaggakaraṇādikathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "388"
      },
      ". Pañca ",
      " saṅghā – catuvaggo bhikkhusaṅgho pañcavaggo bhikkhusaṅgho, dasavaggo bhikkhusaṅgho, vīsativaggo bhikkhusaṅgho, atirekavīsativaggo bhikkhusaṅgho. Tatra, bhikkhave, yvāyaṃ catuvaggo bhikkhusaṅgho, ṭhapetvā tīṇi kammāni – upasampadaṃ pavāraṇaṃ abbhānaṃ, dhammena samaggo ",
      " sabbakammesu kammappatto. Tatra, bhikkhave, yvāyaṃ pañcavaggo bhikkhusaṅgho, ṭhapetvā dve kammāni – majjhimesu janapadesu upasampadaṃ abbhānaṃ, dhammena samaggo sabbakammesu kammappatto. Tatra, bhikkhave, yvāyaṃ dasavaggo bhikkhusaṅgho, ṭhapetvā ekaṃ kammaṃ – abbhānaṃ, dhammena samaggo sabbakammesu kammappatto. Tatra, bhikkhave, yvāyaṃ vīsativaggo bhikkhusaṅgho dhammena samaggo sabbakammesu ",
      " kammappatto. Tatra, bhikkhave, yvāyaṃ atirekavīsativaggo bhikkhusaṅgho ",
      " dhammena samaggo sabbakammesu kammappatto."
    ],
    "innerText": "388. Pañca saṅghā – catuvaggo bhikkhusaṅgho pañcavaggo bhikkhusaṅgho, dasavaggo bhikkhusaṅgho, vīsativaggo bhikkhusaṅgho, atirekavīsativaggo bhikkhusaṅgho. Tatra, bhikkhave, yvāyaṃ catuvaggo bhikkhusaṅgho, ṭhapetvā tīṇi kammāni – upasampadaṃ pavāraṇaṃ abbhānaṃ, dhammena samaggo sabbakammesu kammappatto. Tatra, bhikkhave, yvāyaṃ pañcavaggo bhikkhusaṅgho, ṭhapetvā dve kammāni – majjhimesu janapadesu upasampadaṃ abbhānaṃ, dhammena samaggo sabbakammesu kammappatto. Tatra, bhikkhave, yvāyaṃ dasavaggo bhikkhusaṅgho, ṭhapetvā ekaṃ kammaṃ – abbhānaṃ, dhammena samaggo sabbakammesu kammappatto. Tatra, bhikkhave, yvāyaṃ vīsativaggo bhikkhusaṅgho dhammena samaggo sabbakammesu kammappatto. Tatra, bhikkhave, yvāyaṃ atirekavīsativaggo bhikkhusaṅgho dhammena samaggo sabbakammesu kammappatto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "389"
      },
      ". Catuvaggakaraṇañce, bhikkhave, kammaṃ bhikkhunicatuttho kammaṃ kareyya – akammaṃ na ca karaṇīyaṃ. Catuvaggakaraṇañce, bhikkhave, kammaṃ sikkhamānacatuttho kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ…pe…. Sāmaṇeracatuttho kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ. Sāmaṇericatuttho kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ. Sikkhaṃ paccakkhātakacatuttho kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ. Antimavatthuṃ ajjhāpannakacatuttho kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ. Āpattiyā adassane ukkhittakacatuttho kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ. Āpattiyā appaṭikamme ukkhittakacatuttho kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ. Pāpikāya diṭṭhiyā appaṭinissagge ukkhittakacatuttho kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ. Paṇḍakacatuttho kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ. Theyyasaṃvāsakacatuttho kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ. Titthiyapakkantakacatuttho kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ. Tiracchānagatacatuttho kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ. Mātughātakacatuttho kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ. Pitughātakacatuttho kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ. Arahantaghātakacatuttho kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ. Bhikkhunidūsakacatuttho kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ. Saṅghabhedakacatuttho kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ. Lohituppādakacatuttho kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ. Ubhatobyañjanakacatuttho kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ. Nānāsaṃvāsakacatuttho kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ. Nānāsīmāya ṭhitacatuttho kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ. Iddhiyā vehāse ṭhitacatuttho kammaṃ kareyya… akammaṃ ",
      " na ca karaṇīyaṃ. Yassa saṅgho kammaṃ karoti, taṃcatuttho kammaṃ kareyya ",
      "… akammaṃ na ca karaṇīyaṃ."
    ],
    "innerText": "389. Catuvaggakaraṇañce, bhikkhave, kammaṃ bhikkhunicatuttho kammaṃ kareyya – akammaṃ na ca karaṇīyaṃ. Catuvaggakaraṇañce, bhikkhave, kammaṃ sikkhamānacatuttho kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ…pe…. Sāmaṇeracatuttho kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ. Sāmaṇericatuttho kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ. Sikkhaṃ paccakkhātakacatuttho kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ. Antimavatthuṃ ajjhāpannakacatuttho kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ. Āpattiyā adassane ukkhittakacatuttho kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ. Āpattiyā appaṭikamme ukkhittakacatuttho kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ. Pāpikāya diṭṭhiyā appaṭinissagge ukkhittakacatuttho kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ. Paṇḍakacatuttho kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ. Theyyasaṃvāsakacatuttho kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ. Titthiyapakkantakacatuttho kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ. Tiracchānagatacatuttho kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ. Mātughātakacatuttho kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ. Pitughātakacatuttho kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ. Arahantaghātakacatuttho kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ. Bhikkhunidūsakacatuttho kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ. Saṅghabhedakacatuttho kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ. Lohituppādakacatuttho kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ. Ubhatobyañjanakacatuttho kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ. Nānāsaṃvāsakacatuttho kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ. Nānāsīmāya ṭhitacatuttho kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ. Iddhiyā vehāse ṭhitacatuttho kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ. Yassa saṅgho kammaṃ karoti, taṃcatuttho kammaṃ kareyya … akammaṃ na ca karaṇīyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Catuvaraṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "390"
      },
      ". Pañcavaggakaraṇañce, bhikkhave, kammaṃ bhikkhunipañcamo kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ. Pañcavaggakaraṇañce, bhikkhave, kammaṃ sikkhamānapañcamo kammaṃ kareyya…pe…. Sāmaṇerapañcamo kammaṃ kareyya… sāmaṇeripañcamo kammaṃ kareyya ",
      "… sikkhaṃ paccakkhātakapañcamo kammaṃ kareyya… antimavatthuṃ ajjhāpannakapañcamo kammaṃ kareyya… āpattiyā adassane ukkhittakapañcamo kammaṃ kareyya… āpattiyā appaṭikamme ukkhittakapañcamo kammaṃ kareyya… pāpikāya diṭṭhiyā appaṭinissagge ukkhittakapañcamo kammaṃ kareyya… paṇḍakapañcamo kammaṃ kareyya… theyyasaṃvāsakapañcamo kammaṃ kareyya… titthiyapakkantakapañcamo kammaṃ kareyya… tiracchānagatapañcamo kammaṃ kareyya… mātughātakapañcamo kammaṃ kareyya… pitughātakapañcamo kammaṃ kareyya… arahantaghātakapañcamo kammaṃ kareyya… bhikkhunidūsakapañcamo kammaṃ kareyya… saṅghabhedakapañcamo kammaṃ kareyya… lohituppādakapañcamo kammaṃ kareyya… ubhatobyañjanakapañcamo kammaṃ kareyya… nānāsaṃvāsakapañcamo kammaṃ kareyya… nānāsīmāya ṭhitapañcamo kammaṃ kareyya… iddhiyā vehāse ṭhitapañcamo kammaṃ kareyya… yassa saṅgho kammaṃ karoti, taṃpañcamo kammaṃ kareyya – akammaṃ na ca karaṇīyaṃ."
    ],
    "innerText": "390. Pañcavaggakaraṇañce, bhikkhave, kammaṃ bhikkhunipañcamo kammaṃ kareyya… akammaṃ na ca karaṇīyaṃ. Pañcavaggakaraṇañce, bhikkhave, kammaṃ sikkhamānapañcamo kammaṃ kareyya…pe…. Sāmaṇerapañcamo kammaṃ kareyya… sāmaṇeripañcamo kammaṃ kareyya … sikkhaṃ paccakkhātakapañcamo kammaṃ kareyya… antimavatthuṃ ajjhāpannakapañcamo kammaṃ kareyya… āpattiyā adassane ukkhittakapañcamo kammaṃ kareyya… āpattiyā appaṭikamme ukkhittakapañcamo kammaṃ kareyya… pāpikāya diṭṭhiyā appaṭinissagge ukkhittakapañcamo kammaṃ kareyya… paṇḍakapañcamo kammaṃ kareyya… theyyasaṃvāsakapañcamo kammaṃ kareyya… titthiyapakkantakapañcamo kammaṃ kareyya… tiracchānagatapañcamo kammaṃ kareyya… mātughātakapañcamo kammaṃ kareyya… pitughātakapañcamo kammaṃ kareyya… arahantaghātakapañcamo kammaṃ kareyya… bhikkhunidūsakapañcamo kammaṃ kareyya… saṅghabhedakapañcamo kammaṃ kareyya… lohituppādakapañcamo kammaṃ kareyya… ubhatobyañjanakapañcamo kammaṃ kareyya… nānāsaṃvāsakapañcamo kammaṃ kareyya… nānāsīmāya ṭhitapañcamo kammaṃ kareyya… iddhiyā vehāse ṭhitapañcamo kammaṃ kareyya… yassa saṅgho kammaṃ karoti, taṃpañcamo kammaṃ kareyya – akammaṃ na ca karaṇīyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pañcavaggakaraṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "391"
      },
      ". Dasavaggakaraṇañce, bhikkhave, kammaṃ bhikkhunidasamo kammaṃ kareyya, akammaṃ na ca karaṇīyaṃ. Dasavaggakaraṇañce, bhikkhave, kammaṃ sikkhamānadasamo kammaṃ kareyya, akammaṃ na ca karaṇīyaṃ…pe… ",
      ". Dasavaggakaraṇañce, bhikkhave, kammaṃ yassa saṅgho kammaṃ karoti, taṃdasamo kammaṃ kareyya – akammaṃ na ca karaṇīyaṃ."
    ],
    "innerText": "391. Dasavaggakaraṇañce, bhikkhave, kammaṃ bhikkhunidasamo kammaṃ kareyya, akammaṃ na ca karaṇīyaṃ. Dasavaggakaraṇañce, bhikkhave, kammaṃ sikkhamānadasamo kammaṃ kareyya, akammaṃ na ca karaṇīyaṃ…pe… . Dasavaggakaraṇañce, bhikkhave, kammaṃ yassa saṅgho kammaṃ karoti, taṃdasamo kammaṃ kareyya – akammaṃ na ca karaṇīyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dasavaggakaraṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "392"
      },
      ". Vīsativaggakaraṇañce, bhikkhave, kammaṃ bhikkhunivīso kammaṃ kareyya – akammaṃ na ca karaṇīyaṃ. Vīsativaggakaraṇañce, bhikkhave, kammaṃ sikkhamānavīso kammaṃ kareyya ",
      " …pe… sāmaṇeravīso kammaṃ kareyya… sāmaṇerivīso kammaṃ kareyya… sikkhaṃ paccakkhātakavīso kammaṃ kareyya… antimavatthuṃ ajjhāpannakavīso kammaṃ kareyya… āpattiyā adassane ukkhittakavīso kammaṃ kareyya… āpattiyā appaṭikamme ukkhittakavīso kammaṃ kareyya… pāpikāya diṭṭhiyā appaṭinissagge ukkhittakavīso kammaṃ kareyya… paṇḍakavīso kammaṃ kareyya… theyyasaṃvāsakavīso kammaṃ kareyya… titthiyapakkantakavīso kammaṃ kareyya… tiracchānagatavīso kammaṃ kareyya… mātughātakavīso kammaṃ kareyya… pitughātakavīso kammaṃ kareyya… arahantaghātakavīso ",
      " kammaṃ kareyya… bhikkhunidūsakavīso kammaṃ kareyya… saṅghabhedakavīso kammaṃ kareyya… lohituppādakavīso kammaṃ kareyya… ubhatobyañjanakavīso kammaṃ kareyya… nānāsaṃvāsakavīso kammaṃ kareyya… nānāsīmāya ṭhitavīso kammaṃ kareyya… iddhiyā vehāse ṭhitavīso kammaṃ kareyya… yassa saṅgho kammaṃ karoti, taṃvīso kammaṃ kareyya – akammaṃ na ca karaṇīyaṃ."
    ],
    "innerText": "392. Vīsativaggakaraṇañce, bhikkhave, kammaṃ bhikkhunivīso kammaṃ kareyya – akammaṃ na ca karaṇīyaṃ. Vīsativaggakaraṇañce, bhikkhave, kammaṃ sikkhamānavīso kammaṃ kareyya …pe… sāmaṇeravīso kammaṃ kareyya… sāmaṇerivīso kammaṃ kareyya… sikkhaṃ paccakkhātakavīso kammaṃ kareyya… antimavatthuṃ ajjhāpannakavīso kammaṃ kareyya… āpattiyā adassane ukkhittakavīso kammaṃ kareyya… āpattiyā appaṭikamme ukkhittakavīso kammaṃ kareyya… pāpikāya diṭṭhiyā appaṭinissagge ukkhittakavīso kammaṃ kareyya… paṇḍakavīso kammaṃ kareyya… theyyasaṃvāsakavīso kammaṃ kareyya… titthiyapakkantakavīso kammaṃ kareyya… tiracchānagatavīso kammaṃ kareyya… mātughātakavīso kammaṃ kareyya… pitughātakavīso kammaṃ kareyya… arahantaghātakavīso kammaṃ kareyya… bhikkhunidūsakavīso kammaṃ kareyya… saṅghabhedakavīso kammaṃ kareyya… lohituppādakavīso kammaṃ kareyya… ubhatobyañjanakavīso kammaṃ kareyya… nānāsaṃvāsakavīso kammaṃ kareyya… nānāsīmāya ṭhitavīso kammaṃ kareyya… iddhiyā vehāse ṭhitavīso kammaṃ kareyya… yassa saṅgho kammaṃ karoti, taṃvīso kammaṃ kareyya – akammaṃ na ca karaṇīyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vīsativaggakaraṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Catuvaggakaraṇādikathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "238. Pārivāsikādikathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "393"
      },
      ". Pārivāsikacatuttho ",
      " ce, bhikkhave, parivāsaṃ dadeyya, mūlāya paṭikasseyya, mānattaṃ dadeyya, taṃvīso abbheyya – akammaṃ na ca karaṇīyaṃ. Mūlāya paṭikassanārahacatuttho ce, bhikkhave, parivāsaṃ dadeyya, mūlāya paṭikasseyya, mānattaṃ dadeyya, taṃvīso abbheyya – akammaṃ na ca karaṇīyaṃ. Mānattārahacatuttho ce, bhikkhave, parivāsaṃ dadeyya, mūlāya paṭikasseyya, mānattaṃ dadeyya, taṃvīso abbheyya ",
      " – akammaṃ na ca karaṇīyaṃ. Mānattacārikacatuttho ce, bhikkhave, parivāsaṃ dadeyya, mūlāya paṭikasseyya, mānattaṃ dadeyya, taṃvīso abbheyya – akammaṃ na ca karaṇīyaṃ. Abbhānārahacatuttho ce, bhikkhave, parivāsaṃ dadeyya, mūlāya paṭikasseyya, mānattaṃ dadeyya, taṃvīso abbheyya – akammaṃ na ca karaṇīyaṃ."
    ],
    "innerText": "393. Pārivāsikacatuttho ce, bhikkhave, parivāsaṃ dadeyya, mūlāya paṭikasseyya, mānattaṃ dadeyya, taṃvīso abbheyya – akammaṃ na ca karaṇīyaṃ. Mūlāya paṭikassanārahacatuttho ce, bhikkhave, parivāsaṃ dadeyya, mūlāya paṭikasseyya, mānattaṃ dadeyya, taṃvīso abbheyya – akammaṃ na ca karaṇīyaṃ. Mānattārahacatuttho ce, bhikkhave, parivāsaṃ dadeyya, mūlāya paṭikasseyya, mānattaṃ dadeyya, taṃvīso abbheyya – akammaṃ na ca karaṇīyaṃ. Mānattacārikacatuttho ce, bhikkhave, parivāsaṃ dadeyya, mūlāya paṭikasseyya, mānattaṃ dadeyya, taṃvīso abbheyya – akammaṃ na ca karaṇīyaṃ. Abbhānārahacatuttho ce, bhikkhave, parivāsaṃ dadeyya, mūlāya paṭikasseyya, mānattaṃ dadeyya, taṃvīso abbheyya – akammaṃ na ca karaṇīyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "394"
      },
      ". Ekaccassa, bhikkhave, saṅghamajjhe paṭikkosanā ruhati, ekaccassa na ruhati. Kassa ca, bhikkhave, saṅghamajjhe paṭikkosanā na ruhati? Bhikkhuniyā, bhikkhave, saṅghamajjhe paṭikkosanā na ruhati. Sikkhamānāya, bhikkhave…pe… sāmaṇerassa, bhikkhave… sāmaṇeriyā, bhikkhave… sikkhāpaccakkhātakassa bhikkhave… antimavatthuṃ ajjhāpannakassa, bhikkhave ",
      " … ummattakassa, bhikkhave… khittacittassa, bhikkhave… vedanāṭṭassa, bhikkhave… āpattiyā adassane ukkhittakassa, bhikkhave… āpattiyā appaṭikamme ukkhittakassa, bhikkhave… pāpikāya diṭṭhiyā appaṭinissagge ",
      " ukkhittakassa, bhikkhave… paṇḍakassa, bhikkhave… theyyasaṃvāsakassa, bhikkhave… titthiyapakkantakassa, bhikkhave ",
      "… tiracchānagatassa bhikkhave… mātughātakassa, bhikkhave… pitughātakassa, bhikkhave… arahantaghātakassa, bhikkhave… bhikkhunidūsakassa, bhikkhave… saṅghabhedakassa, bhikkhave… lohituppādakassa, bhikkhave… ubhatobyañjanakassa, bhikkhave… nānāsaṃvāsakassa, bhikkhave… nānāsīmāya ṭhitassa, bhikkhave… iddhiyā vehāse ṭhitassa, bhikkhave, yassa saṅgho kammaṃ karoti, tassa ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[tassa (syā.)]"
      },
      ", bhikkhave, saṅghamajjhe paṭikkosanā na ruhati. Imesaṃ kho, bhikkhave, saṅghamajjhe paṭikkosanā na ruhati."
    ],
    "innerText": "394. Ekaccassa, bhikkhave, saṅghamajjhe paṭikkosanā ruhati, ekaccassa na ruhati. Kassa ca, bhikkhave, saṅghamajjhe paṭikkosanā na ruhati? Bhikkhuniyā, bhikkhave, saṅghamajjhe paṭikkosanā na ruhati. Sikkhamānāya, bhikkhave…pe… sāmaṇerassa, bhikkhave… sāmaṇeriyā, bhikkhave… sikkhāpaccakkhātakassa bhikkhave… antimavatthuṃ ajjhāpannakassa, bhikkhave … ummattakassa, bhikkhave… khittacittassa, bhikkhave… vedanāṭṭassa, bhikkhave… āpattiyā adassane ukkhittakassa, bhikkhave… āpattiyā appaṭikamme ukkhittakassa, bhikkhave… pāpikāya diṭṭhiyā appaṭinissagge ukkhittakassa, bhikkhave… paṇḍakassa, bhikkhave… theyyasaṃvāsakassa, bhikkhave… titthiyapakkantakassa, bhikkhave … tiracchānagatassa bhikkhave… mātughātakassa, bhikkhave… pitughātakassa, bhikkhave… arahantaghātakassa, bhikkhave… bhikkhunidūsakassa, bhikkhave… saṅghabhedakassa, bhikkhave… lohituppādakassa, bhikkhave… ubhatobyañjanakassa, bhikkhave… nānāsaṃvāsakassa, bhikkhave… nānāsīmāya ṭhitassa, bhikkhave… iddhiyā vehāse ṭhitassa, bhikkhave, yassa saṅgho kammaṃ karoti, tassa ca [tassa (syā.)], bhikkhave, saṅghamajjhe paṭikkosanā na ruhati. Imesaṃ kho, bhikkhave, saṅghamajjhe paṭikkosanā na ruhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Kassa ca, bhikkhave, saṅghamajjhe paṭikkosanā ruhati? Bhikkhussa, bhikkhave, pakatattassa"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Samānasaṃvāsakassa samānasīmāya ṭhitassa antamaso ānantarikassāpi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[anantarikassāpi (syā.)]"
      },
      " bhikkhuno viññāpentassa saṅghamajjhe paṭikkosanā ruhati. Imassa kho, bhikkhave, saṅghamajjhe paṭikkosanā ruhati."
    ],
    "innerText": "Samānasaṃvāsakassa samānasīmāya ṭhitassa antamaso ānantarikassāpi [anantarikassāpi (syā.)] bhikkhuno viññāpentassa saṅghamajjhe paṭikkosanā ruhati. Imassa kho, bhikkhave, saṅghamajjhe paṭikkosanā ruhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pārivāsikādikathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "239. Dvenissāraṇādikathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "395"
      },
      ". Dvemā, bhikkhave, nissāraṇā. Atthi, bhikkhave, puggalo appatto nissāraṇaṃ. Tañce saṅgho nissāreti, ekacco sunissārito, ekacco dunnissārito. Katamo ca, bhikkhave, puggalo appatto nissāraṇaṃ, tañce saṅgho nissāreti – dunnissārito? Idha pana, bhikkhave, bhikkhu suddho hoti anāpattiko. Tañce saṅgho nissāreti – dunnissārito. Ayaṃ vuccati, bhikkhave, puggalo appatto nissāraṇaṃ, tañce saṅgho nissāreti – dunnissārito."
    ],
    "innerText": "395. Dvemā, bhikkhave, nissāraṇā. Atthi, bhikkhave, puggalo appatto nissāraṇaṃ. Tañce saṅgho nissāreti, ekacco sunissārito, ekacco dunnissārito. Katamo ca, bhikkhave, puggalo appatto nissāraṇaṃ, tañce saṅgho nissāreti – dunnissārito? Idha pana, bhikkhave, bhikkhu suddho hoti anāpattiko. Tañce saṅgho nissāreti – dunnissārito. Ayaṃ vuccati, bhikkhave, puggalo appatto nissāraṇaṃ, tañce saṅgho nissāreti – dunnissārito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katamo ",
      " ca, bhikkhave, puggalo appatto nissāraṇaṃ, tañce saṅgho nissāreti – sunissārito? Idha pana, bhikkhave, bhikkhu bālo hoti abyatto āpattibahulo anapadāno, gihisaṃsaṭṭho ",
      " viharati ananulomikehi gihisaṃsaggehi, tañce saṅgho nissāreti – sunissārito. Ayaṃ vuccati, bhikkhave, puggalo appatto nissāraṇaṃ, tañce saṅgho nissāreti – sunissārito."
    ],
    "innerText": "Katamo ca, bhikkhave, puggalo appatto nissāraṇaṃ, tañce saṅgho nissāreti – sunissārito? Idha pana, bhikkhave, bhikkhu bālo hoti abyatto āpattibahulo anapadāno, gihisaṃsaṭṭho viharati ananulomikehi gihisaṃsaggehi, tañce saṅgho nissāreti – sunissārito. Ayaṃ vuccati, bhikkhave, puggalo appatto nissāraṇaṃ, tañce saṅgho nissāreti – sunissārito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "396"
      },
      ". Dvemā ",
      ", bhikkhave, osāraṇā. Atthi, bhikkhave, puggalo appatto osāraṇaṃ tañce saṅgho osāreti, ekacco sosārito, ekacco ",
      " dosārito. Katamo ca, bhikkhave, puggalo appatto osāraṇaṃ, tañce saṅgho osāreti – dosārito? Paṇḍako, bhikkhave, appatto osāraṇaṃ, tañce saṅgho osāreti – dosārito. Theyyasaṃvāsako, bhikkhave, appatto osāraṇaṃ, tañce saṅgho osāreti – dosārito. Titthiyapakkantako, bhikkhave…pe… tiracchānagato, bhikkhave… mātughātako, bhikkhave… pitughātako, bhikkhave… arahantaghātako, bhikkhave… bhikkhunidūsako, bhikkhave… saṅghabhedako, bhikkhave… lohituppādako, bhikkhave… ubhatobyañjanako, bhikkhave, appatto, osāraṇaṃ, tañce saṅgho osāreti – dosārito. Ayaṃ vuccati, bhikkhave, puggalo appatto osāraṇaṃ, tañce saṅgho osāreti – dosārito. Ime vuccanti, bhikkhave, puggalā appattā osāraṇaṃ, te ce saṅgho osāreti – dosāritā."
    ],
    "innerText": "396. Dvemā , bhikkhave, osāraṇā. Atthi, bhikkhave, puggalo appatto osāraṇaṃ tañce saṅgho osāreti, ekacco sosārito, ekacco dosārito. Katamo ca, bhikkhave, puggalo appatto osāraṇaṃ, tañce saṅgho osāreti – dosārito? Paṇḍako, bhikkhave, appatto osāraṇaṃ, tañce saṅgho osāreti – dosārito. Theyyasaṃvāsako, bhikkhave, appatto osāraṇaṃ, tañce saṅgho osāreti – dosārito. Titthiyapakkantako, bhikkhave…pe… tiracchānagato, bhikkhave… mātughātako, bhikkhave… pitughātako, bhikkhave… arahantaghātako, bhikkhave… bhikkhunidūsako, bhikkhave… saṅghabhedako, bhikkhave… lohituppādako, bhikkhave… ubhatobyañjanako, bhikkhave, appatto, osāraṇaṃ, tañce saṅgho osāreti – dosārito. Ayaṃ vuccati, bhikkhave, puggalo appatto osāraṇaṃ, tañce saṅgho osāreti – dosārito. Ime vuccanti, bhikkhave, puggalā appattā osāraṇaṃ, te ce saṅgho osāreti – dosāritā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Katamo ca, bhikkhave, puggalo appatto osāraṇaṃ, tañce saṅgho osāreti – sosārito? Hatthacchinno, bhikkhave, appatto osāraṇaṃ, tañce saṅgho osāreti, sosārito. Pādacchinno, bhikkhave…pe… hatthapādacchinno, bhikkhave… kaṇṇacchinno ",
      ", bhikkhave… nāsacchinno, bhikkhave… kaṇṇanāsacchinno, bhikkhave… aṅgulicchinno, bhikkhave… aḷacchinno, bhikkhave… kaṇḍaracchinno, bhikkhave… phaṇahatthako, bhikkhave… khujjo, bhikkhave… vāmano, bhikkhave… galagaṇḍī, bhikkhave… lakkhaṇāhato, bhikkhave… kasāhato, bhikkhave… likhitako, bhikkhave… sīpadiko, bhikkhave… pāparogī, bhikkhave… parisadūsako, bhikkhave… kāṇo, bhikkhave… kuṇī, bhikkhave… khañjo, bhikkhave… pakkhahato, bhikkhave… chinniriyāpatho, bhikkhave… jarādubbalo, bhikkhave… andho, bhikkhave… mūgo, bhikkhave… badhiro, bhikkhave… andhamūgo, bhikkhave… andhabadhiro, bhikkhave… mūgabadhiro, bhikkhave… andhamūgabadhiro, bhikkhave, appatto osāraṇaṃ, tañce saṅgho osāreti – sosārito. Ayaṃ vuccati, bhikkhave, puggalo appatto osāraṇaṃ, tañce saṅgho osāreti – sosārito. Ime vuccanti, bhikkhave, puggalā appattā osāraṇaṃ, te ce saṅgho osāreti – sosāritā."
    ],
    "innerText": "Katamo ca, bhikkhave, puggalo appatto osāraṇaṃ, tañce saṅgho osāreti – sosārito? Hatthacchinno, bhikkhave, appatto osāraṇaṃ, tañce saṅgho osāreti, sosārito. Pādacchinno, bhikkhave…pe… hatthapādacchinno, bhikkhave… kaṇṇacchinno , bhikkhave… nāsacchinno, bhikkhave… kaṇṇanāsacchinno, bhikkhave… aṅgulicchinno, bhikkhave… aḷacchinno, bhikkhave… kaṇḍaracchinno, bhikkhave… phaṇahatthako, bhikkhave… khujjo, bhikkhave… vāmano, bhikkhave… galagaṇḍī, bhikkhave… lakkhaṇāhato, bhikkhave… kasāhato, bhikkhave… likhitako, bhikkhave… sīpadiko, bhikkhave… pāparogī, bhikkhave… parisadūsako, bhikkhave… kāṇo, bhikkhave… kuṇī, bhikkhave… khañjo, bhikkhave… pakkhahato, bhikkhave… chinniriyāpatho, bhikkhave… jarādubbalo, bhikkhave… andho, bhikkhave… mūgo, bhikkhave… badhiro, bhikkhave… andhamūgo, bhikkhave… andhabadhiro, bhikkhave… mūgabadhiro, bhikkhave… andhamūgabadhiro, bhikkhave, appatto osāraṇaṃ, tañce saṅgho osāreti – sosārito. Ayaṃ vuccati, bhikkhave, puggalo appatto osāraṇaṃ, tañce saṅgho osāreti – sosārito. Ime vuccanti, bhikkhave, puggalā appattā osāraṇaṃ, te ce saṅgho osāreti – sosāritā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dvenissāraṇādikathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vāsabhagāmabhāṇavāro niṭṭhito paṭhamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "240. Adhammakammādikathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "397"
      },
      ". Idha ",
      " pana, bhikkhave, bhikkhussa na hoti āpatti daṭṭhabbā. Tamenaṃ codeti saṅgho vā sambahulā vā ekapuggalo vā – ‘‘āpattiṃ tvaṃ, āvuso, āpanno, passasetaṃ āpatti’’nti? So evaṃ vadeti – ‘‘natthi me, āvuso, āpatti, yamahaṃ passeyya’’nti. Taṃ ",
      " saṅgho āpattiyā adassane ukkhipati – adhammakammaṃ."
    ],
    "innerText": "397. Idha pana, bhikkhave, bhikkhussa na hoti āpatti daṭṭhabbā. Tamenaṃ codeti saṅgho vā sambahulā vā ekapuggalo vā – ‘‘āpattiṃ tvaṃ, āvuso, āpanno, passasetaṃ āpatti’’nti? So evaṃ vadeti – ‘‘natthi me, āvuso, āpatti, yamahaṃ passeyya’’nti. Taṃ saṅgho āpattiyā adassane ukkhipati – adhammakammaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, bhikkhussa na hoti āpatti paṭikātabbā. Tamenaṃ codeti saṅgho vā sambahulā vā ekapuggalo vā – ‘‘āpattiṃ tvaṃ, āvuso, āpanno, paṭikarohi ",
      " taṃ āpatti’’nti. So evaṃ vadeti – ‘‘natthi me, āvuso, āpatti, yamayaṃ paṭikareyya’’nti. Taṃ saṅgho āpattiyā appaṭikamme ukkhipati – adhammakammaṃ."
    ],
    "innerText": "Idha pana, bhikkhave, bhikkhussa na hoti āpatti paṭikātabbā. Tamenaṃ codeti saṅgho vā sambahulā vā ekapuggalo vā – ‘‘āpattiṃ tvaṃ, āvuso, āpanno, paṭikarohi taṃ āpatti’’nti. So evaṃ vadeti – ‘‘natthi me, āvuso, āpatti, yamayaṃ paṭikareyya’’nti. Taṃ saṅgho āpattiyā appaṭikamme ukkhipati – adhammakammaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, bhikkhussa na hoti pāpikā diṭṭhi paṭinissajjetā. Tamenaṃ codeti saṅgho vā sambahulā vā ekapuggalo vā – ‘‘pāpikā te, āvuso, diṭṭhi, paṭinissajjetaṃ pāpikaṃ diṭṭhi’’nti. So evaṃ vadeti – ‘‘natthi me, āvuso, pāpikā diṭṭhi, yamahaṃ paṭinissajjeyya’’nti. Taṃ saṅgho pāpikāya diṭṭhiyā appaṭinissagge ukkhipati – adhammakammaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, bhikkhussa na hoti āpatti daṭṭhabbā, na hoti āpatti paṭikātabbā. Tamenaṃ codeti saṅgho vā sambahulā vā ekapuggalo vā – ‘‘āpattiṃ tvaṃ, āvuso, āpanno, passasetaṃ āpatti? Paṭikarohi taṃ āpatti’’nti. So evaṃ vadeti – ‘‘natthi me, āvuso, āpatti, yamahaṃ passeyyaṃ. Natthi me, āvuso, āpatti, yamahaṃ paṭikareyya’’nti. Taṃ saṅgho adassane vā appaṭikamme vā ukkhipati – adhammakammaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, bhikkhussa na hoti āpatti daṭṭhabbā, na hoti pāpikā diṭṭhi paṭinissajjetā. Tamenaṃ codeti saṅgho vā sambahulā vā ekapuggalo vā – ‘‘āpattiṃ tvaṃ, āvuso, āpanno, passasetaṃ āpattiṃ? Pāpikā te diṭṭhi, paṭinissajjetaṃ pāpikaṃ diṭṭhi’’nti. So evaṃ vadeti – ‘‘natthi me, āvuso, āpatti, yamahaṃ passeyyaṃ; natthi me, āvuso, pāpikā diṭṭhi, yamahaṃ paṭinissajjeyya’’nti. Taṃ saṅgho adassane vā appaṭinissagge ",
      " vā ukkhipati – adhammakammaṃ."
    ],
    "innerText": "Idha pana, bhikkhave, bhikkhussa na hoti āpatti daṭṭhabbā, na hoti pāpikā diṭṭhi paṭinissajjetā. Tamenaṃ codeti saṅgho vā sambahulā vā ekapuggalo vā – ‘‘āpattiṃ tvaṃ, āvuso, āpanno, passasetaṃ āpattiṃ? Pāpikā te diṭṭhi, paṭinissajjetaṃ pāpikaṃ diṭṭhi’’nti. So evaṃ vadeti – ‘‘natthi me, āvuso, āpatti, yamahaṃ passeyyaṃ; natthi me, āvuso, pāpikā diṭṭhi, yamahaṃ paṭinissajjeyya’’nti. Taṃ saṅgho adassane vā appaṭinissagge vā ukkhipati – adhammakammaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      " pana, bhikkhave, bhikkhussa na hoti āpatti paṭikātabbā, na hoti pāpikā diṭṭhi paṭinissajjetā. Tamenaṃ codeti saṅgho vā sambahulā vā ekapuggalo vā – ‘‘āpattiṃ tvaṃ, āvuso, āpanno, paṭikarohi taṃ āpattiṃ; pāpikā te diṭṭhi, paṭinissajjetaṃ pāpikaṃ diṭṭhi’’nti. So evaṃ vadeti – ‘‘natthi me, āvuso, āpatti, yamahaṃ paṭikareyyaṃ. Natthi me, āvuso, pāpikā diṭṭhi, yamahaṃ paṭinissajjeyya’’nti. Taṃ saṅgho appaṭikamme vā appaṭinissagge vā ukkhipati – adhammakammaṃ."
    ],
    "innerText": "Idha pana, bhikkhave, bhikkhussa na hoti āpatti paṭikātabbā, na hoti pāpikā diṭṭhi paṭinissajjetā. Tamenaṃ codeti saṅgho vā sambahulā vā ekapuggalo vā – ‘‘āpattiṃ tvaṃ, āvuso, āpanno, paṭikarohi taṃ āpattiṃ; pāpikā te diṭṭhi, paṭinissajjetaṃ pāpikaṃ diṭṭhi’’nti. So evaṃ vadeti – ‘‘natthi me, āvuso, āpatti, yamahaṃ paṭikareyyaṃ. Natthi me, āvuso, pāpikā diṭṭhi, yamahaṃ paṭinissajjeyya’’nti. Taṃ saṅgho appaṭikamme vā appaṭinissagge vā ukkhipati – adhammakammaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, bhikkhussa na hoti āpatti daṭṭhabbā, na hoti āpatti paṭikātabbā, na hoti pāpikā diṭṭhi paṭinissajjetā. Tamenaṃ codeti saṅgho vā sambahulā vā ",
      " ekapuggalo vā – ‘‘āpattiṃ tvaṃ, āvuso, āpanno, passasetaṃ āpattiṃ? Paṭikarohi taṃ āpattiṃ; pāpikā te diṭṭhi, paṭinissajjetaṃ pāpikaṃ diṭṭhi’’nti. So evaṃ vadeti – ‘‘natthi me, āvuso, āpatti, yamahaṃ passeyyaṃ. Natthi me, āvuso, āpatti, yamahaṃ paṭikareyyaṃ. Natthi me, āvuso, pāpikā diṭṭhi, yamahaṃ paṭinissajjeyya’’nti. Taṃ saṅgho adassane vā appaṭikamme vā appaṭinissagge vā ukkhipati – adhammakammaṃ."
    ],
    "innerText": "Idha pana, bhikkhave, bhikkhussa na hoti āpatti daṭṭhabbā, na hoti āpatti paṭikātabbā, na hoti pāpikā diṭṭhi paṭinissajjetā. Tamenaṃ codeti saṅgho vā sambahulā vā ekapuggalo vā – ‘‘āpattiṃ tvaṃ, āvuso, āpanno, passasetaṃ āpattiṃ? Paṭikarohi taṃ āpattiṃ; pāpikā te diṭṭhi, paṭinissajjetaṃ pāpikaṃ diṭṭhi’’nti. So evaṃ vadeti – ‘‘natthi me, āvuso, āpatti, yamahaṃ passeyyaṃ. Natthi me, āvuso, āpatti, yamahaṃ paṭikareyyaṃ. Natthi me, āvuso, pāpikā diṭṭhi, yamahaṃ paṭinissajjeyya’’nti. Taṃ saṅgho adassane vā appaṭikamme vā appaṭinissagge vā ukkhipati – adhammakammaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "398"
      },
      ". Idha pana, bhikkhave, bhikkhussa hoti āpatti daṭṭhabbā. Tamenaṃ codeti. Saṅgho vā sambahulā vā ekapuggalo vā – ‘‘āpattiṃ tvaṃ ",
      ", āvuso, āpanno, passasetaṃ āpatti’’nti? So evaṃ vadeti – ‘‘āmāvuso, passāmī’’ti. Taṃ saṅgho āpattiyā adassane ukkhipati – adhammakammaṃ."
    ],
    "innerText": "398. Idha pana, bhikkhave, bhikkhussa hoti āpatti daṭṭhabbā. Tamenaṃ codeti. Saṅgho vā sambahulā vā ekapuggalo vā – ‘‘āpattiṃ tvaṃ , āvuso, āpanno, passasetaṃ āpatti’’nti? So evaṃ vadeti – ‘‘āmāvuso, passāmī’’ti. Taṃ saṅgho āpattiyā adassane ukkhipati – adhammakammaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, bhikkhussa hoti āpatti paṭikātabbā. Tamenaṃ codeti saṅgho vā sambahulā vā ekapuggalo vā – ‘‘āpattiṃ tvaṃ, āvuso, āpanno, paṭikarohi taṃ āpatti’’nti. So evaṃ vadeti – ‘‘āmāvuso, paṭikarissāmī’’ti. Taṃ saṅgho āpattiyā appaṭikamme ukkhipati – adhammakammaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, bhikkhussa hoti pāpikā diṭṭhi paṭinissajjetā. Tamenaṃ codeti saṅgho vā sambahulā vā ekapuggalo vā – ‘‘pāpikā te, āvuso, diṭṭhi; paṭinissajjetaṃ pāpikaṃ diṭṭhi’’nti. So evaṃ vadeti – ‘‘āmāvuso ",
      ", paṭinissajjissāmī’’ti. Taṃ saṅgho pāpikāya diṭṭhiyā appaṭinissagge ukkhipati – adhammakammaṃ."
    ],
    "innerText": "Idha pana, bhikkhave, bhikkhussa hoti pāpikā diṭṭhi paṭinissajjetā. Tamenaṃ codeti saṅgho vā sambahulā vā ekapuggalo vā – ‘‘pāpikā te, āvuso, diṭṭhi; paṭinissajjetaṃ pāpikaṃ diṭṭhi’’nti. So evaṃ vadeti – ‘‘āmāvuso , paṭinissajjissāmī’’ti. Taṃ saṅgho pāpikāya diṭṭhiyā appaṭinissagge ukkhipati – adhammakammaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      " pana, bhikkhave, bhikkhussa hoti āpatti daṭṭhabbā, hoti āpatti paṭikātabbā…pe… hoti āpatti daṭṭhabbā, hoti pāpikā diṭṭhi paṭinissajjetā…pe… hoti āpatti paṭikātabbā, hoti pāpikā diṭṭhi paṭinissajjetā…pe… hoti āpatti daṭṭhabbā, hoti āpatti paṭikātabbā, hoti pāpikā diṭṭhi paṭinissajjetā. Tamenaṃ codeti saṅgho vā sambahulā vā ekapuggalo vā – ‘‘āpattiṃ tvaṃ, āvuso, āpanno, passasetaṃ āpattiṃ? Paṭikarohi taṃ āpattiṃ; pāpikā te diṭṭhi, paṭinissajjetaṃ pāpikaṃ diṭṭhi’’nti. So evaṃ vadeti – ‘‘āmāvuso, passāmi, āma paṭikarissāmi, āma paṭinissajjissāmī’’ti ",
      ". Taṃ saṅgho adassane vā appaṭikamme vā appaṭinissagge vā ukkhipati – adhammakammaṃ."
    ],
    "innerText": "Idha pana, bhikkhave, bhikkhussa hoti āpatti daṭṭhabbā, hoti āpatti paṭikātabbā…pe… hoti āpatti daṭṭhabbā, hoti pāpikā diṭṭhi paṭinissajjetā…pe… hoti āpatti paṭikātabbā, hoti pāpikā diṭṭhi paṭinissajjetā…pe… hoti āpatti daṭṭhabbā, hoti āpatti paṭikātabbā, hoti pāpikā diṭṭhi paṭinissajjetā. Tamenaṃ codeti saṅgho vā sambahulā vā ekapuggalo vā – ‘‘āpattiṃ tvaṃ, āvuso, āpanno, passasetaṃ āpattiṃ? Paṭikarohi taṃ āpattiṃ; pāpikā te diṭṭhi, paṭinissajjetaṃ pāpikaṃ diṭṭhi’’nti. So evaṃ vadeti – ‘‘āmāvuso, passāmi, āma paṭikarissāmi, āma paṭinissajjissāmī’’ti . Taṃ saṅgho adassane vā appaṭikamme vā appaṭinissagge vā ukkhipati – adhammakammaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "399"
      },
      ". Idha pana, bhikkhave, bhikkhussa hoti āpatti daṭṭhabbā. Tamenaṃ codeti saṅgho vā sambahulā vā ekapuggalo vā – ‘‘āpattiṃ tvaṃ, āvuso, āpanno, passasetaṃ āpatti’’nti? So evaṃ vadeti – ‘‘natthi me, āvuso, āpatti, yamahaṃ passeyya’’nti. Taṃ ",
      " saṅgho āpattiyā adassane ukkhipati – dhammakammaṃ."
    ],
    "innerText": "399. Idha pana, bhikkhave, bhikkhussa hoti āpatti daṭṭhabbā. Tamenaṃ codeti saṅgho vā sambahulā vā ekapuggalo vā – ‘‘āpattiṃ tvaṃ, āvuso, āpanno, passasetaṃ āpatti’’nti? So evaṃ vadeti – ‘‘natthi me, āvuso, āpatti, yamahaṃ passeyya’’nti. Taṃ saṅgho āpattiyā adassane ukkhipati – dhammakammaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, bhikkhussa hoti āpatti paṭikātabbā. Tamenaṃ codeti saṅgho vā sambahulā vā ekapuggalo vā – ‘‘āpattiṃ tvaṃ, āvuso, āpanno, paṭikarohi taṃ āpatti’’nti. So evaṃ vadeti – ‘‘natthi me, āvuso, āpatti, yamahaṃ paṭikareyya’’nti. Taṃ saṅgho āpattiyā appaṭikamme ukkhipati – dhammakammaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, bhikkhussa hoti pāpikā diṭṭhi paṭinissajjetā. Tamenaṃ codeti saṅgho vā sambahulā vā ekapuggalo vā – ‘‘pāpikā te, āvuso, diṭṭhi, paṭinissajjetaṃ pāpikaṃ diṭṭhi’’nti. So evaṃ vadeti – ‘‘natthi me, āvuso, pāpikā diṭṭhi, yamahaṃ paṭinissajjeyya’’nti. Taṃ saṅgho pāpikāya diṭṭhiyā appaṭinissagge ukkhipati – dhammakammaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Idha pana, bhikkhave, bhikkhussa hoti āpatti daṭṭhabbā, hoti āpatti paṭikātabbā…pe…"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Hoti āpatti daṭṭhabbā, hoti pāpikā diṭṭhi paṭinissajjetā…pe… hoti āpatti paṭikātabbā, hoti pāpikā diṭṭhi paṭinissajjetā ",
      "…pe… hoti āpatti daṭṭhabbā, hoti āpatti paṭikātabbā, hoti pāpikā diṭṭhi ",
      " paṭinissajjetā. Tamenaṃ codeti saṅgho vā sambahulā vā ekapuggalo vā – ‘‘āpattiṃ tvaṃ, āvuso, āpanno, passasetaṃ ",
      " āpattiṃ? Paṭikarohi taṃ āpattiṃ. Pāpikā te diṭṭhi, paṭinissajjetaṃ pāpikaṃ diṭṭhi’’nti. So evaṃ vadeti – ‘‘natthi me, āvuso, āpatti, yamahaṃ passeyyaṃ. Natthi me, āvuso, āpatti yamahaṃ paṭikareyyaṃ. Natthi me, āvuso, pāpikā diṭṭhi, yamahaṃ paṭinissajjeyya’’nti. Taṃ saṅgho adassane vā appaṭikamme vā appaṭinissagge vā ukkhipati – dhammakammanti."
    ],
    "innerText": "Hoti āpatti daṭṭhabbā, hoti pāpikā diṭṭhi paṭinissajjetā…pe… hoti āpatti paṭikātabbā, hoti pāpikā diṭṭhi paṭinissajjetā …pe… hoti āpatti daṭṭhabbā, hoti āpatti paṭikātabbā, hoti pāpikā diṭṭhi paṭinissajjetā. Tamenaṃ codeti saṅgho vā sambahulā vā ekapuggalo vā – ‘‘āpattiṃ tvaṃ, āvuso, āpanno, passasetaṃ āpattiṃ? Paṭikarohi taṃ āpattiṃ. Pāpikā te diṭṭhi, paṭinissajjetaṃ pāpikaṃ diṭṭhi’’nti. So evaṃ vadeti – ‘‘natthi me, āvuso, āpatti, yamahaṃ passeyyaṃ. Natthi me, āvuso, āpatti yamahaṃ paṭikareyyaṃ. Natthi me, āvuso, pāpikā diṭṭhi, yamahaṃ paṭinissajjeyya’’nti. Taṃ saṅgho adassane vā appaṭikamme vā appaṭinissagge vā ukkhipati – dhammakammanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Adhammakammādikathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "241. Upālipucchākathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "400"
      },
      ". Atha kho āyasmā upāli yena bhagavā tenupasaṅkami, upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā upāli bhagavantaṃ etadavoca – ‘‘yo nu kho, bhante, samaggo saṅgho sammukhākaraṇīyaṃ kammaṃ asammukhā karoti, dhammakammaṃ nu kho taṃ, bhante, vinayakamma’’nti? ‘‘Adhammakammaṃ taṃ, upāli, avinayakamma’’nti. ‘‘Yo nu kho, bhante, samaggo saṅgho paṭipucchākaraṇīyaṃ kammaṃ appaṭipucchā karoti…pe… paṭiññāyakaraṇīyaṃ kammaṃ apaṭiññāya karoti… sativinayārahassa amūḷhavinayaṃ deti… amūḷhavinayārahassa tassapāpiyasikākammaṃ karoti… tassapāpiyasikākammārahassa tajjanīyakammaṃ karoti… tajjanīyakammārahassa niyassakammaṃ karoti ",
      "… niyassakammārahassa ",
      " pabbājanīyakammaṃ karoti… pabbājanīyakammārahassa paṭisāraṇīyakammaṃ karoti… paṭisāraṇīyakammārahassa ukkhepanīyakammaṃ karoti… ukkhepanīyakammārahassa parivāsaṃ deti… parivāsārahaṃ mūlāya paṭikassati… mūlāyapaṭikassanārahassa mānattaṃ deti… mānattārahaṃ abbheti… abbhānārahaṃ upasampādeti, dhammakammaṃ nu kho taṃ, bhante, vinayakamma’’nti? ‘‘Adhammakammaṃ taṃ, upāli, avinayakammaṃ’’."
    ],
    "innerText": "400. Atha kho āyasmā upāli yena bhagavā tenupasaṅkami, upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā upāli bhagavantaṃ etadavoca – ‘‘yo nu kho, bhante, samaggo saṅgho sammukhākaraṇīyaṃ kammaṃ asammukhā karoti, dhammakammaṃ nu kho taṃ, bhante, vinayakamma’’nti? ‘‘Adhammakammaṃ taṃ, upāli, avinayakamma’’nti. ‘‘Yo nu kho, bhante, samaggo saṅgho paṭipucchākaraṇīyaṃ kammaṃ appaṭipucchā karoti…pe… paṭiññāyakaraṇīyaṃ kammaṃ apaṭiññāya karoti… sativinayārahassa amūḷhavinayaṃ deti… amūḷhavinayārahassa tassapāpiyasikākammaṃ karoti… tassapāpiyasikākammārahassa tajjanīyakammaṃ karoti… tajjanīyakammārahassa niyassakammaṃ karoti … niyassakammārahassa pabbājanīyakammaṃ karoti… pabbājanīyakammārahassa paṭisāraṇīyakammaṃ karoti… paṭisāraṇīyakammārahassa ukkhepanīyakammaṃ karoti… ukkhepanīyakammārahassa parivāsaṃ deti… parivāsārahaṃ mūlāya paṭikassati… mūlāyapaṭikassanārahassa mānattaṃ deti… mānattārahaṃ abbheti… abbhānārahaṃ upasampādeti, dhammakammaṃ nu kho taṃ, bhante, vinayakamma’’nti? ‘‘Adhammakammaṃ taṃ, upāli, avinayakammaṃ’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yo kho, upāli, samaggo saṅgho sammukhākaraṇīyaṃ kammaṃ asammukhā karoti, evaṃ kho, upāli, adhammakammaṃ hoti avinayakammaṃ, evañca pana saṅgho sātisāro hoti. Yo kho, upāli, samaggo saṅgho paṭipucchākaraṇīyaṃ kammaṃ appaṭipucchā karoti…pe… paṭiññāyakaraṇīyaṃ kammaṃ ",
      " apaṭiññāya karoti… sativinayārahassa amūḷhavinayaṃ deti… amūḷhavinayārahassa tassapāpiyasikākammaṃ karoti… tassapāpiyasikākammārahassa tajjanīyakammaṃ karoti… tajjanīyakammārahassa niyassakammaṃ karoti… niyassakammārahassa pabbājanīyakammaṃ karoti… pabbājanīyakammārahassa paṭisāraṇīyakammaṃ karoti… paṭisāraṇīyakammārahassa ",
      " ukkhepanīyakammaṃ karoti… ukkhepanīyakammārahassa parivāsaṃ deti… parivāsārahaṃ mūlāya paṭikassati… mūlāyapaṭikassanārahassa mānattaṃ deti… mānattārahaṃ abbheti… abbhānārahaṃ upasampādeti, evaṃ kho, upāli, adhammakammaṃ hoti avinayakammaṃ. Evañca pana saṅgho sātisāro hotī’’ti."
    ],
    "innerText": "‘‘Yo kho, upāli, samaggo saṅgho sammukhākaraṇīyaṃ kammaṃ asammukhā karoti, evaṃ kho, upāli, adhammakammaṃ hoti avinayakammaṃ, evañca pana saṅgho sātisāro hoti. Yo kho, upāli, samaggo saṅgho paṭipucchākaraṇīyaṃ kammaṃ appaṭipucchā karoti…pe… paṭiññāyakaraṇīyaṃ kammaṃ apaṭiññāya karoti… sativinayārahassa amūḷhavinayaṃ deti… amūḷhavinayārahassa tassapāpiyasikākammaṃ karoti… tassapāpiyasikākammārahassa tajjanīyakammaṃ karoti… tajjanīyakammārahassa niyassakammaṃ karoti… niyassakammārahassa pabbājanīyakammaṃ karoti… pabbājanīyakammārahassa paṭisāraṇīyakammaṃ karoti… paṭisāraṇīyakammārahassa ukkhepanīyakammaṃ karoti… ukkhepanīyakammārahassa parivāsaṃ deti… parivāsārahaṃ mūlāya paṭikassati… mūlāyapaṭikassanārahassa mānattaṃ deti… mānattārahaṃ abbheti… abbhānārahaṃ upasampādeti, evaṃ kho, upāli, adhammakammaṃ hoti avinayakammaṃ. Evañca pana saṅgho sātisāro hotī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "401"
      },
      ". ‘‘Yo ",
      " nu kho, bhante, samaggo saṅgho sammukhākaraṇīyaṃ kammaṃ sammukhā karoti, dhammakammaṃ nu kho taṃ, bhante, vinayakamma’’nti? ‘‘Dhammakammaṃ taṃ, upāli, vinayakamma’’nti. ‘‘Yo nu kho, bhante, samaggo saṅgho paṭipucchākaraṇīyaṃ kammaṃ paṭipucchā karoti…pe… paṭiññāyakaraṇīyaṃ kammaṃ paṭiññāya karoti… sativinayārahassa sativinayaṃ deti… amūḷhavinayārahassa amūḷhavinayaṃ deti… tassapāpiyasikākammārahassa tassapāpiyasikākammaṃ karoti… tajjanīyakammārahassa tajjanīyakammaṃ karoti… niyassakammārahassa niyassakammaṃ karoti… pabbājanīyakammārahassa pabbājanīyakammaṃ karoti… paṭisāraṇīyakammārahassa paṭisāraṇīyakammaṃ karoti… ukkhepanīyakammārahassa ukkhepanīyakammaṃ karoti… parivāsārahassa parivāsaṃ deti mūlāyapaṭikassanārahaṃ mūlāya paṭikassati… mānattārahassa mānattaṃ deti… abbhānārahaṃ abbheti… upasampadārahaṃ upasampādeti, dhammakammaṃ nu kho taṃ, bhante, vinayakamma’’nti? ‘‘Dhammakammaṃ taṃ, upāli, vinayakammaṃ."
    ],
    "innerText": "401. ‘‘Yo nu kho, bhante, samaggo saṅgho sammukhākaraṇīyaṃ kammaṃ sammukhā karoti, dhammakammaṃ nu kho taṃ, bhante, vinayakamma’’nti? ‘‘Dhammakammaṃ taṃ, upāli, vinayakamma’’nti. ‘‘Yo nu kho, bhante, samaggo saṅgho paṭipucchākaraṇīyaṃ kammaṃ paṭipucchā karoti…pe… paṭiññāyakaraṇīyaṃ kammaṃ paṭiññāya karoti… sativinayārahassa sativinayaṃ deti… amūḷhavinayārahassa amūḷhavinayaṃ deti… tassapāpiyasikākammārahassa tassapāpiyasikākammaṃ karoti… tajjanīyakammārahassa tajjanīyakammaṃ karoti… niyassakammārahassa niyassakammaṃ karoti… pabbājanīyakammārahassa pabbājanīyakammaṃ karoti… paṭisāraṇīyakammārahassa paṭisāraṇīyakammaṃ karoti… ukkhepanīyakammārahassa ukkhepanīyakammaṃ karoti… parivāsārahassa parivāsaṃ deti mūlāyapaṭikassanārahaṃ mūlāya paṭikassati… mānattārahassa mānattaṃ deti… abbhānārahaṃ abbheti… upasampadārahaṃ upasampādeti, dhammakammaṃ nu kho taṃ, bhante, vinayakamma’’nti? ‘‘Dhammakammaṃ taṃ, upāli, vinayakammaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yo kho, upāli, samaggo saṅgho sammukhākaraṇīyaṃ kammaṃ sammukhā karoti, evaṃ kho, upāli, dhammakammaṃ hoti vinayakammaṃ. Evañca pana saṅgho anatisāro hoti. Yo kho, upāli, samaggo saṅgho paṭipucchākaraṇīyaṃ kammaṃ paṭipucchā karoti… paṭiññāyakaraṇīyaṃ kammaṃ paṭiññāya karoti… sativinayārahassa sativinayaṃ deti… amūḷhavinayārahassa amūḷhavinayaṃ deti… tassapāpiyasikākammārahassa tassapāpiyasikākammaṃ karoti… tajjanīyakammārahassa ",
      " tajjanīyakammaṃ karoti… niyassakammārahassa niyassakammaṃ karoti… pabbājanīyakammārahassa pabbājanīyakammaṃ karoti ",
      "… paṭisāraṇīyakammārahassa paṭisāraṇīyakammaṃ karoti… ukkhepanīyakammārahassa ukkhepanīyakammaṃ karoti… parivāsārahassa parivāsaṃ deti… mūlāyapaṭikassanārahaṃ mūlāya paṭikassati… mānattārahassa mānattaṃ deti… abbhānārahaṃ abbheti… upasampadārahaṃ upasampādeti, evaṃ kho, upāli, dhammakammaṃ hoti vinayakammaṃ. Evañca pana saṅgho anatisāro hotī’’ti."
    ],
    "innerText": "‘‘Yo kho, upāli, samaggo saṅgho sammukhākaraṇīyaṃ kammaṃ sammukhā karoti, evaṃ kho, upāli, dhammakammaṃ hoti vinayakammaṃ. Evañca pana saṅgho anatisāro hoti. Yo kho, upāli, samaggo saṅgho paṭipucchākaraṇīyaṃ kammaṃ paṭipucchā karoti… paṭiññāyakaraṇīyaṃ kammaṃ paṭiññāya karoti… sativinayārahassa sativinayaṃ deti… amūḷhavinayārahassa amūḷhavinayaṃ deti… tassapāpiyasikākammārahassa tassapāpiyasikākammaṃ karoti… tajjanīyakammārahassa tajjanīyakammaṃ karoti… niyassakammārahassa niyassakammaṃ karoti… pabbājanīyakammārahassa pabbājanīyakammaṃ karoti … paṭisāraṇīyakammārahassa paṭisāraṇīyakammaṃ karoti… ukkhepanīyakammārahassa ukkhepanīyakammaṃ karoti… parivāsārahassa parivāsaṃ deti… mūlāyapaṭikassanārahaṃ mūlāya paṭikassati… mānattārahassa mānattaṃ deti… abbhānārahaṃ abbheti… upasampadārahaṃ upasampādeti, evaṃ kho, upāli, dhammakammaṃ hoti vinayakammaṃ. Evañca pana saṅgho anatisāro hotī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "402"
      },
      ". ‘‘Yo nu kho, bhante, samaggo saṅgho sativinayārahassa amūḷhavinayaṃ deti, amūḷhavinayārahassa ",
      " sativinayaṃ deti, dhammakammaṃ nu kho taṃ, bhante, vinayakamma’’nti? ‘‘Adhammakammaṃ taṃ, upāli, avinayakamma’’nti. ‘‘Yo nu kho, bhante, samaggo saṅgho amūḷhavinayārahassa tassapāpiyasikākammaṃ karoti, tassapāpiyasikākammārahassa amūḷhavinayaṃ deti…pe… tassapāpiyasikākammārahassa tajjanīyakammaṃ ",
      " karoti, tajjanīyakammārahassa tassapāpiyasikākammaṃ karoti… tajjanīyakammārahassa niyassakammaṃ karoti, niyassakammārahassa tajjanīyakammaṃ karoti… niyassakammārahassa pabbājanīyakammaṃ karoti, pabbājanīyakammārahassa niyassakammaṃ karoti… pabbājanīyakammārahassa paṭisāraṇīyakammaṃ karoti, paṭisāraṇīyakammārahassa pabbājanīyakammaṃ karoti… paṭisāraṇīyakammārahassa ukkhepanīyakammaṃ karoti, ukkhepanīyakammārahassa paṭisāraṇīyakammaṃ karoti… ukkhepanīyakammārahassa parivāsaṃ deti, parivāsārahassa ",
      " ukkhepanīyakammaṃ karoti… parivāsārahaṃ mūlāya paṭikassati, mūlāyapaṭikassanārahassa parivāsaṃ deti… mūlāyapaṭikassanārahassa mānattaṃ deti, mānattārahaṃ mūlāya paṭikassati… mānattārahaṃ abbheti, abbhānārahassa mānattaṃ deti… abbhānārahaṃ upasampādeti, upasampadārahaṃ abbheti, dhammakammaṃ nu kho taṃ, bhante, vinayakamma’’nti? ‘‘Adhammakammaṃ taṃ, upāli, avinayakamma’’nti."
    ],
    "innerText": "402. ‘‘Yo nu kho, bhante, samaggo saṅgho sativinayārahassa amūḷhavinayaṃ deti, amūḷhavinayārahassa sativinayaṃ deti, dhammakammaṃ nu kho taṃ, bhante, vinayakamma’’nti? ‘‘Adhammakammaṃ taṃ, upāli, avinayakamma’’nti. ‘‘Yo nu kho, bhante, samaggo saṅgho amūḷhavinayārahassa tassapāpiyasikākammaṃ karoti, tassapāpiyasikākammārahassa amūḷhavinayaṃ deti…pe… tassapāpiyasikākammārahassa tajjanīyakammaṃ karoti, tajjanīyakammārahassa tassapāpiyasikākammaṃ karoti… tajjanīyakammārahassa niyassakammaṃ karoti, niyassakammārahassa tajjanīyakammaṃ karoti… niyassakammārahassa pabbājanīyakammaṃ karoti, pabbājanīyakammārahassa niyassakammaṃ karoti… pabbājanīyakammārahassa paṭisāraṇīyakammaṃ karoti, paṭisāraṇīyakammārahassa pabbājanīyakammaṃ karoti… paṭisāraṇīyakammārahassa ukkhepanīyakammaṃ karoti, ukkhepanīyakammārahassa paṭisāraṇīyakammaṃ karoti… ukkhepanīyakammārahassa parivāsaṃ deti, parivāsārahassa ukkhepanīyakammaṃ karoti… parivāsārahaṃ mūlāya paṭikassati, mūlāyapaṭikassanārahassa parivāsaṃ deti… mūlāyapaṭikassanārahassa mānattaṃ deti, mānattārahaṃ mūlāya paṭikassati… mānattārahaṃ abbheti, abbhānārahassa mānattaṃ deti… abbhānārahaṃ upasampādeti, upasampadārahaṃ abbheti, dhammakammaṃ nu kho taṃ, bhante, vinayakamma’’nti? ‘‘Adhammakammaṃ taṃ, upāli, avinayakamma’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yo kho, upāli, samaggo saṅgho sativinayārahassa amūḷhavinayaṃ deti, amūḷhavinayārahassa sativinayaṃ deti, evaṃ kho, upāli, adhammakammaṃ hoti avinayakammaṃ. Evañca pana saṅgho sātisāro hoti. Yo kho, upāli, samaggo saṅgho amūḷhavinayārahassa tassapāpiyasikākammaṃ karoti, tassapāpiyasikākammārahassa amūḷhavinayaṃ deti…pe… tassapāpiyasikākammārahassa tajjanīyakammaṃ karoti, tajjanīyakammārahassa tassapāpiyasikākammaṃ karoti… tajjanīyakammārahassa niyassakammaṃ karoti ",
      ", niyassakammārahassa tajjanīyakammaṃ karoti… niyassakammārahassa pabbājanīyakammaṃ karoti, pabbājanīyakammārahassa niyassakammaṃ karoti… pabbājanīyakammārahassa paṭisāraṇīyakammaṃ karoti, paṭisāraṇīyakammārahassa pabbājanīyakammaṃ karoti… paṭisāraṇīyakammārahassa ukkhepanīyakammaṃ karoti, ukkhepanīyakammārahassa paṭisāraṇīyakammaṃ karoti… ukkhepanīyakammārahassa parivāsaṃ deti, parivāsārahassa ukkhepanīyakammaṃ karoti… parivāsārahaṃ mūlāya paṭikassati, mūlāyapaṭikassanārahassa parivāsaṃ ",
      " deti… mūlāyapaṭikassanārahassa mānattaṃ deti, mānattārahaṃ mūlāya paṭikassati – mānattārahaṃ abbheti, abbhānārahassa mānattaṃ deti… abbhānārahaṃ upasampādeti, upasampadārahaṃ abbheti, evaṃ kho, upāli, adhammakammaṃ hoti avinayakammaṃ. Evañca pana saṅgho sātisāro hotī’’ti."
    ],
    "innerText": "‘‘Yo kho, upāli, samaggo saṅgho sativinayārahassa amūḷhavinayaṃ deti, amūḷhavinayārahassa sativinayaṃ deti, evaṃ kho, upāli, adhammakammaṃ hoti avinayakammaṃ. Evañca pana saṅgho sātisāro hoti. Yo kho, upāli, samaggo saṅgho amūḷhavinayārahassa tassapāpiyasikākammaṃ karoti, tassapāpiyasikākammārahassa amūḷhavinayaṃ deti…pe… tassapāpiyasikākammārahassa tajjanīyakammaṃ karoti, tajjanīyakammārahassa tassapāpiyasikākammaṃ karoti… tajjanīyakammārahassa niyassakammaṃ karoti , niyassakammārahassa tajjanīyakammaṃ karoti… niyassakammārahassa pabbājanīyakammaṃ karoti, pabbājanīyakammārahassa niyassakammaṃ karoti… pabbājanīyakammārahassa paṭisāraṇīyakammaṃ karoti, paṭisāraṇīyakammārahassa pabbājanīyakammaṃ karoti… paṭisāraṇīyakammārahassa ukkhepanīyakammaṃ karoti, ukkhepanīyakammārahassa paṭisāraṇīyakammaṃ karoti… ukkhepanīyakammārahassa parivāsaṃ deti, parivāsārahassa ukkhepanīyakammaṃ karoti… parivāsārahaṃ mūlāya paṭikassati, mūlāyapaṭikassanārahassa parivāsaṃ deti… mūlāyapaṭikassanārahassa mānattaṃ deti, mānattārahaṃ mūlāya paṭikassati – mānattārahaṃ abbheti, abbhānārahassa mānattaṃ deti… abbhānārahaṃ upasampādeti, upasampadārahaṃ abbheti, evaṃ kho, upāli, adhammakammaṃ hoti avinayakammaṃ. Evañca pana saṅgho sātisāro hotī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "403"
      },
      ". ‘‘Yo ",
      " nu kho, bhante, samaggo saṅgho sativinayārahassa sativinayaṃ deti, amūḷhavinayārahassa amūḷhavinayaṃ deti, dhammakammaṃ nu kho taṃ, bhante, vinayakamma’’nti? ‘‘Dhammakammaṃ taṃ, upāli, vinayakamma’’nti. ‘‘Yo nu kho, bhante, samaggo saṅgho amūḷhavinayārahassa amūḷhavinayaṃ deti…pe… tassapāpiyasikākammārahassa tassapāpiyasikākammaṃ karoti…pe… tajjanīyakammārahassa tajjanīyakammaṃ karoti…pe… niyassakammārahassa niyassakammaṃ karoti…pe… pabbājanīyakammārahassa pabbājanīyakammaṃ karoti…pe… paṭisāraṇīyakammārahassa paṭisāraṇīyakammaṃ karoti…pe… ukkhepanīyakammārahassa ukkhepanīyakammaṃ karoti…pe… parivāsārahassa parivāsaṃ deti…pe… mūlāyapaṭikassanārahaṃ mūlāya paṭikassati…pe… mānattārahassa mānattaṃ deti…pe… abbhānārahaṃ abbheti, upasampadārahaṃ upasampādeti, dhammakammaṃ nu kho taṃ, bhante, vinayakamma’’nti? ‘‘Dhammakammaṃ taṃ, upāli, vinayakammaṃ’’."
    ],
    "innerText": "403. ‘‘Yo nu kho, bhante, samaggo saṅgho sativinayārahassa sativinayaṃ deti, amūḷhavinayārahassa amūḷhavinayaṃ deti, dhammakammaṃ nu kho taṃ, bhante, vinayakamma’’nti? ‘‘Dhammakammaṃ taṃ, upāli, vinayakamma’’nti. ‘‘Yo nu kho, bhante, samaggo saṅgho amūḷhavinayārahassa amūḷhavinayaṃ deti…pe… tassapāpiyasikākammārahassa tassapāpiyasikākammaṃ karoti…pe… tajjanīyakammārahassa tajjanīyakammaṃ karoti…pe… niyassakammārahassa niyassakammaṃ karoti…pe… pabbājanīyakammārahassa pabbājanīyakammaṃ karoti…pe… paṭisāraṇīyakammārahassa paṭisāraṇīyakammaṃ karoti…pe… ukkhepanīyakammārahassa ukkhepanīyakammaṃ karoti…pe… parivāsārahassa parivāsaṃ deti…pe… mūlāyapaṭikassanārahaṃ mūlāya paṭikassati…pe… mānattārahassa mānattaṃ deti…pe… abbhānārahaṃ abbheti, upasampadārahaṃ upasampādeti, dhammakammaṃ nu kho taṃ, bhante, vinayakamma’’nti? ‘‘Dhammakammaṃ taṃ, upāli, vinayakammaṃ’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yo kho, upāli, samaggo saṅgho sativinayārahassa sativinayaṃ deti, amūḷhavinayārahassa amūḷhavinayaṃ deti, evaṃ kho, upāli, dhammakammaṃ hoti vinayakammaṃ. Evañca pana saṅgho anatisāro hoti ",
      ". Yo kho, upāli, samaggo saṅgho amūḷhavinayārahassa amūḷhavinayaṃ deti ",
      "…pe… tassapāpiyasikākammārahassa tassapāpiyasikākammaṃ karoti…pe… tajjanīyakammārahassa tajjanīyakammaṃ karoti…pe… niyassakammārahassa niyassakammaṃ karoti…pe… pabbājanīyakammārahassa pabbājanīyakammaṃ karoti…pe… paṭisāraṇīyakammārahassa ",
      " paṭisāraṇīyakammaṃ karoti…pe… ukkhepanīyakammārahassa ukkhepanīyakammaṃ karoti…pe… parivāsārahassa parivāsaṃ deti…pe… mūlāya paṭikassanārahaṃ mūlāya paṭikassati…pe… mānattārahassa mānattaṃ deti…pe… abbhānārahaṃ abbheti, upasampadārahaṃ upasampādeti, evaṃ kho, upāli, dhammakammaṃ hoti vinayakammaṃ. Evañca pana saṅgho anatisāro hotī’’ti."
    ],
    "innerText": "‘‘Yo kho, upāli, samaggo saṅgho sativinayārahassa sativinayaṃ deti, amūḷhavinayārahassa amūḷhavinayaṃ deti, evaṃ kho, upāli, dhammakammaṃ hoti vinayakammaṃ. Evañca pana saṅgho anatisāro hoti . Yo kho, upāli, samaggo saṅgho amūḷhavinayārahassa amūḷhavinayaṃ deti …pe… tassapāpiyasikākammārahassa tassapāpiyasikākammaṃ karoti…pe… tajjanīyakammārahassa tajjanīyakammaṃ karoti…pe… niyassakammārahassa niyassakammaṃ karoti…pe… pabbājanīyakammārahassa pabbājanīyakammaṃ karoti…pe… paṭisāraṇīyakammārahassa paṭisāraṇīyakammaṃ karoti…pe… ukkhepanīyakammārahassa ukkhepanīyakammaṃ karoti…pe… parivāsārahassa parivāsaṃ deti…pe… mūlāya paṭikassanārahaṃ mūlāya paṭikassati…pe… mānattārahassa mānattaṃ deti…pe… abbhānārahaṃ abbheti, upasampadārahaṃ upasampādeti, evaṃ kho, upāli, dhammakammaṃ hoti vinayakammaṃ. Evañca pana saṅgho anatisāro hotī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "404"
      },
      ". Atha kho bhagavā bhikkhū āmantesi – yo kho, bhikkhave, samaggo saṅgho sativinayārahassa amūḷhavinayaṃ deti, evaṃ kho, bhikkhave, adhammakammaṃ hoti avinayakammaṃ. Evañca pana saṅgho sātisāro hoti. Yo kho, bhikkhave, samaggo saṅgho sativinayārahassa tassapāpiyasikākammaṃ karoti…pe… sativinayārahassa tajjanīyakammaṃ karoti… sativinayārahassa niyassakammaṃ karoti… sativinayārahassa pabbājanīyakammaṃ karoti… sativinayārahassa paṭisāraṇīyakammaṃ karoti… sativinayārahassa ukkhepanīyakammaṃ karoti ",
      " … sativinayārahassa parivāsaṃ deti… sativinayārahaṃ mūlāya paṭikassati… sativinayārahassa mānattaṃ deti… sativinayārahaṃ abbheti… sativinayārahaṃ upasampādeti, evaṃ kho ",
      ", bhikkhave, adhammakammaṃ hoti avinayakammaṃ. Evañca pana saṅgho sātisāro hoti."
    ],
    "innerText": "404. Atha kho bhagavā bhikkhū āmantesi – yo kho, bhikkhave, samaggo saṅgho sativinayārahassa amūḷhavinayaṃ deti, evaṃ kho, bhikkhave, adhammakammaṃ hoti avinayakammaṃ. Evañca pana saṅgho sātisāro hoti. Yo kho, bhikkhave, samaggo saṅgho sativinayārahassa tassapāpiyasikākammaṃ karoti…pe… sativinayārahassa tajjanīyakammaṃ karoti… sativinayārahassa niyassakammaṃ karoti… sativinayārahassa pabbājanīyakammaṃ karoti… sativinayārahassa paṭisāraṇīyakammaṃ karoti… sativinayārahassa ukkhepanīyakammaṃ karoti … sativinayārahassa parivāsaṃ deti… sativinayārahaṃ mūlāya paṭikassati… sativinayārahassa mānattaṃ deti… sativinayārahaṃ abbheti… sativinayārahaṃ upasampādeti, evaṃ kho , bhikkhave, adhammakammaṃ hoti avinayakammaṃ. Evañca pana saṅgho sātisāro hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "405"
      },
      ". Yo kho, bhikkhave, samaggo saṅgho amūḷhavinayārahassa tassapāpiyasikākammaṃ karoti, evaṃ kho, bhikkhave, adhammakammaṃ hoti avinayakammaṃ. Evañca pana saṅgho sātisāro hoti. Yo kho, bhikkhave, samaggo saṅgho amūḷhavinayārahassa tajjanīyakammaṃ karoti…pe… amūḷhavinayārahassa niyassakammaṃ karoti… amūḷhavinayārahassa pabbājanīyakammaṃ karoti… amūḷhavinayārahassa paṭisāraṇīyakammaṃ karoti… amūḷhavinayārahassa ukkhepanīyakammaṃ karoti… amūḷhavinayārahassa parivāsaṃ deti… amūḷhavinayārahaṃ mūlāya paṭikassati… amūḷhavinayārahassa mānattaṃ deti… amūḷhavinayārahaṃ abbheti… amūḷhavinayārahaṃ upasampādeti… amūḷhavinayārahassa sativinayaṃ deti, evaṃ kho, bhikkhave, adhammakammaṃ hoti avinayakammaṃ. Evañca pana saṅgho sātisāro hoti."
    ],
    "innerText": "405. Yo kho, bhikkhave, samaggo saṅgho amūḷhavinayārahassa tassapāpiyasikākammaṃ karoti, evaṃ kho, bhikkhave, adhammakammaṃ hoti avinayakammaṃ. Evañca pana saṅgho sātisāro hoti. Yo kho, bhikkhave, samaggo saṅgho amūḷhavinayārahassa tajjanīyakammaṃ karoti…pe… amūḷhavinayārahassa niyassakammaṃ karoti… amūḷhavinayārahassa pabbājanīyakammaṃ karoti… amūḷhavinayārahassa paṭisāraṇīyakammaṃ karoti… amūḷhavinayārahassa ukkhepanīyakammaṃ karoti… amūḷhavinayārahassa parivāsaṃ deti… amūḷhavinayārahaṃ mūlāya paṭikassati… amūḷhavinayārahassa mānattaṃ deti… amūḷhavinayārahaṃ abbheti… amūḷhavinayārahaṃ upasampādeti… amūḷhavinayārahassa sativinayaṃ deti, evaṃ kho, bhikkhave, adhammakammaṃ hoti avinayakammaṃ. Evañca pana saṅgho sātisāro hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "406"
      },
      ". Yo ",
      " kho, bhikkhave, samaggo saṅgho tassapāpiyasikākammārahassa tajjanīyakammaṃ karoti…pe… tajjanīyakammārahassa… niyassakammārahassa… pabbājanīyakammārahassa… paṭisāraṇīyakammārahassa… ukkhepanīyakammārahassa… parivāsārahaṃ… mūlāyapaṭikassanārahassa… mānattārahaṃ… abbhānārahaṃ… upasampadārahassa sativinayaṃ deti, evaṃ kho, bhikkhave, adhammakammaṃ hoti avinayakammaṃ. Evañca pana saṅgho sātisāro hoti. Yo kho, bhikkhave, samaggo saṅgho upasampadārahassa amūḷhavinayaṃ deti…pe… upasampadārahassa tassapāpiyasikākammaṃ karoti… upasampadārahassa tajjanīyakammaṃ karoti… upasampadārahassa niyassakammaṃ karoti… upasampadārahassa pabbājanīyakammaṃ karoti… upasampadārahassa paṭisāraṇīyakammaṃ karoti… upasampadārahassa ukkhepanīyakammaṃ karoti… upasampadārahassa parivāsaṃ deti… upasampadārahaṃ mūlāya paṭikassati… upasampadārahassa mānattaṃ deti… upasampadārahaṃ abbheti, evaṃ kho, bhikkhave, adhammakammaṃ hoti avinayakammaṃ. Evañca pana saṅgho ",
      " sātisāro hotīti."
    ],
    "innerText": "406. Yo kho, bhikkhave, samaggo saṅgho tassapāpiyasikākammārahassa tajjanīyakammaṃ karoti…pe… tajjanīyakammārahassa… niyassakammārahassa… pabbājanīyakammārahassa… paṭisāraṇīyakammārahassa… ukkhepanīyakammārahassa… parivāsārahaṃ… mūlāyapaṭikassanārahassa… mānattārahaṃ… abbhānārahaṃ… upasampadārahassa sativinayaṃ deti, evaṃ kho, bhikkhave, adhammakammaṃ hoti avinayakammaṃ. Evañca pana saṅgho sātisāro hoti. Yo kho, bhikkhave, samaggo saṅgho upasampadārahassa amūḷhavinayaṃ deti…pe… upasampadārahassa tassapāpiyasikākammaṃ karoti… upasampadārahassa tajjanīyakammaṃ karoti… upasampadārahassa niyassakammaṃ karoti… upasampadārahassa pabbājanīyakammaṃ karoti… upasampadārahassa paṭisāraṇīyakammaṃ karoti… upasampadārahassa ukkhepanīyakammaṃ karoti… upasampadārahassa parivāsaṃ deti… upasampadārahaṃ mūlāya paṭikassati… upasampadārahassa mānattaṃ deti… upasampadārahaṃ abbheti, evaṃ kho, bhikkhave, adhammakammaṃ hoti avinayakammaṃ. Evañca pana saṅgho sātisāro hotīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Upālipucchākathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Upālipucchābhāṇavāro niṭṭhito dutiyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "242. Tajjanīyakammakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "407"
      },
      ". Idha ",
      " pana, bhikkhave, bhikkhu bhaṇḍanakārako hoti kalahakārako vivādakārako bhassakārako saṅghe adhikaraṇakārako. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu bhaṇḍanakārako kalahakārako vivādakārako bhassakārako saṅghe adhikaraṇakārako. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – adhammena vaggā. So tamhā āvāsā aññaṃ āvāsaṃ gacchati ",
      ". Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato adhammena vaggehi. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – adhammena samaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato adhammena samaggehi. Handassa mayaṃ tajjanīyakammaṃ ",
      " karomā’’ti. Te tassa tajjanīyakammaṃ karonti – dhammena vaggā. So ",
      " tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato dhammena vaggehi. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – dhammapatirūpakena vaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato dhammapatirūpakena vaggehi. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – dhammapatirūpakena samaggā."
    ],
    "innerText": "407. Idha pana, bhikkhave, bhikkhu bhaṇḍanakārako hoti kalahakārako vivādakārako bhassakārako saṅghe adhikaraṇakārako. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu bhaṇḍanakārako kalahakārako vivādakārako bhassakārako saṅghe adhikaraṇakārako. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – adhammena vaggā. So tamhā āvāsā aññaṃ āvāsaṃ gacchati . Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato adhammena vaggehi. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – adhammena samaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato adhammena samaggehi. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – dhammena vaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato dhammena vaggehi. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – dhammapatirūpakena vaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato dhammapatirūpakena vaggehi. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – dhammapatirūpakena samaggā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "408"
      },
      ". Idha pana, bhikkhave, bhikkhu bhaṇḍanakārako hoti kalahakārako vivādakārako bhassakārako saṅghe adhikaraṇakārako. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu bhaṇḍanakārako kalahakārako vivādakārako bhassakārako saṅghe adhikaraṇakārako. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti ",
      " – adhammena samaggā. So tamhā āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato adhammena samaggehi. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – dhammena vaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato dhammena vaggehi. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – dhammapatirūpakena vaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato ",
      " dhammapatirūpakena vaggehi. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – dhammapatirūpakena samaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato dhammapatirūpakena samaggehi. Handassa mayaṃ tajjanīyakammaṃ karomā’ti. Te tassa tajjanīyakammaṃ karonti – adhammena vaggā."
    ],
    "innerText": "408. Idha pana, bhikkhave, bhikkhu bhaṇḍanakārako hoti kalahakārako vivādakārako bhassakārako saṅghe adhikaraṇakārako. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu bhaṇḍanakārako kalahakārako vivādakārako bhassakārako saṅghe adhikaraṇakārako. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – adhammena samaggā. So tamhā āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato adhammena samaggehi. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – dhammena vaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato dhammena vaggehi. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – dhammapatirūpakena vaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato dhammapatirūpakena vaggehi. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – dhammapatirūpakena samaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato dhammapatirūpakena samaggehi. Handassa mayaṃ tajjanīyakammaṃ karomā’ti. Te tassa tajjanīyakammaṃ karonti – adhammena vaggā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "409"
      },
      ". Idha pana, bhikkhave, bhikkhu bhaṇḍanakārako hoti kalahakārako vivādakārako bhassakārako saṅghe adhikaraṇakārako. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu bhaṇḍanakārako ",
      " kalahakārako vivādakārako bhassakārako saṅghe adhikaraṇakārako. Handassa ",
      " mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – dhammena vaggā. So tamhā āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato dhammena vaggehi. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – dhammapatirūpakena vaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato dhammapatirūpakena vaggehi. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – dhammapatirūpakena samaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato dhammapatirūpakena samaggehi. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – adhammena vaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato adhammena vaggehi. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – adhammena samaggā."
    ],
    "innerText": "409. Idha pana, bhikkhave, bhikkhu bhaṇḍanakārako hoti kalahakārako vivādakārako bhassakārako saṅghe adhikaraṇakārako. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu bhaṇḍanakārako kalahakārako vivādakārako bhassakārako saṅghe adhikaraṇakārako. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – dhammena vaggā. So tamhā āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato dhammena vaggehi. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – dhammapatirūpakena vaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato dhammapatirūpakena vaggehi. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – dhammapatirūpakena samaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato dhammapatirūpakena samaggehi. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – adhammena vaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato adhammena vaggehi. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – adhammena samaggā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "410"
      },
      ". Idha pana, bhikkhave, bhikkhu bhaṇḍanakārako hoti kalahakārako vivādakārako bhassakārako saṅghe adhikaraṇakārako. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu bhaṇḍanakārako kalahakārako ",
      " vivādakārako bhassakārako saṅghe adhikaraṇakārako. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – dhammapatirūpakena vaggā. So tamhā āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato dhammapatirūpakena vaggehi. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – dhammapatirūpakena ",
      " samaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato dhammapatirūpakena samaggehi. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – adhammena vaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ ",
      " evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato adhammena vaggehi. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – adhammena samaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato adhammena samaggehi. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – dhammena vaggā."
    ],
    "innerText": "410. Idha pana, bhikkhave, bhikkhu bhaṇḍanakārako hoti kalahakārako vivādakārako bhassakārako saṅghe adhikaraṇakārako. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu bhaṇḍanakārako kalahakārako vivādakārako bhassakārako saṅghe adhikaraṇakārako. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – dhammapatirūpakena vaggā. So tamhā āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato dhammapatirūpakena vaggehi. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – dhammapatirūpakena samaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato dhammapatirūpakena samaggehi. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – adhammena vaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato adhammena vaggehi. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – adhammena samaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato adhammena samaggehi. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – dhammena vaggā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "411"
      },
      ". Idha pana, bhikkhave, bhikkhu bhaṇḍanakārako hoti kalahakārako vivādakārako bhassakārako saṅghe adhikaraṇakārako. Tatra ce bhikkhūnaṃ ",
      " evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu bhaṇḍanakārako kalahakārako vivādakārako bhassakārako saṅghe adhikaraṇakārako. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa ",
      " tajjanīyakammaṃ karonti – dhammapatirūpakena samaggā. So tamhā āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato dhammapatirūpakena samaggehi. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – adhammena vaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato adhammena vaggehi. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – adhammena samaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato adhammena samaggehi. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – dhammena vaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato dhammena vaggehi. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – dhammapatirūpakena vaggā."
    ],
    "innerText": "411. Idha pana, bhikkhave, bhikkhu bhaṇḍanakārako hoti kalahakārako vivādakārako bhassakārako saṅghe adhikaraṇakārako. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu bhaṇḍanakārako kalahakārako vivādakārako bhassakārako saṅghe adhikaraṇakārako. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – dhammapatirūpakena samaggā. So tamhā āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato dhammapatirūpakena samaggehi. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – adhammena vaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato adhammena vaggehi. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – adhammena samaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato adhammena samaggehi. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – dhammena vaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato dhammena vaggehi. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – dhammapatirūpakena vaggā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tajjanīyakammakathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "243. Niyassakammakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "412"
      },
      ". Idha ",
      " pana, bhikkhave, bhikkhu bālo hoti abyatto āpattibahulo ",
      " anapadāno, gihisaṃsaṭṭho viharati ananulomikehi gihisaṃsaggehi ",
      ". Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu bālo abyatto āpattibahulo anapadāno, gihisaṃsaṭṭho viharati ananulomikehi gihisaṃsaggehi. Handassa mayaṃ niyassakammaṃ karomā’’ti. Te tassa niyassakammaṃ karonti – adhammena vaggā. So tamhā āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena niyassakammakato adhammena vaggehi. Handassa mayaṃ niyassakammaṃ karomā’’ti. Te tassa niyassakammaṃ karonti – adhammena samaggā…pe… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā…pe…."
    ],
    "innerText": "412. Idha pana, bhikkhave, bhikkhu bālo hoti abyatto āpattibahulo anapadāno, gihisaṃsaṭṭho viharati ananulomikehi gihisaṃsaggehi . Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu bālo abyatto āpattibahulo anapadāno, gihisaṃsaṭṭho viharati ananulomikehi gihisaṃsaggehi. Handassa mayaṃ niyassakammaṃ karomā’’ti. Te tassa niyassakammaṃ karonti – adhammena vaggā. So tamhā āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena niyassakammakato adhammena vaggehi. Handassa mayaṃ niyassakammaṃ karomā’’ti. Te tassa niyassakammaṃ karonti – adhammena samaggā…pe… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yathā heṭṭhā, tathā cakkaṃ kātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Niyassakammakathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "244. Pabbājanīyakammakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "413"
      },
      ". Idha pana, bhikkhave, bhikkhu kuladūsako hoti pāpasamācāro. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu kuladūsako pāpasamācāro. Handassa mayaṃ pabbājanīyakammaṃ karomā’’ti. Te tassa pabbājanīyakammaṃ karonti – adhammena vaggā. So tamhā āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena pabbājanīyakammakato adhammena vaggehi. Handassa mayaṃ pabbājanīyakammaṃ karomā’’ti. Te tassa pabbājanīyakammaṃ karonti – adhammena samaggā…pe… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā…pe…."
    ],
    "innerText": "413. Idha pana, bhikkhave, bhikkhu kuladūsako hoti pāpasamācāro. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu kuladūsako pāpasamācāro. Handassa mayaṃ pabbājanīyakammaṃ karomā’’ti. Te tassa pabbājanīyakammaṃ karonti – adhammena vaggā. So tamhā āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena pabbājanīyakammakato adhammena vaggehi. Handassa mayaṃ pabbājanīyakammaṃ karomā’’ti. Te tassa pabbājanīyakammaṃ karonti – adhammena samaggā…pe… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "children": [
      "Cakkaṃ kātabbaṃ ",
      "."
    ],
    "innerText": "Cakkaṃ kātabbaṃ ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pabbājanīyakammakatā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "245. Paṭisāraṇīyakammakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "414"
      },
      ". Idha ",
      " pana, bhikkhave, bhikkhu gihī akkosati paribhāsati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu gihī akkosati paribhāsati. Handassa mayaṃ paṭisāraṇīyakammaṃ karomā’’ti. Te tassa paṭisāraṇīyakammaṃ karonti – adhammena vaggā. So tamhā āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena paṭisāraṇīyakammakato adhammena vaggehi. Handassa mayaṃ paṭisāraṇīyakammaṃ ",
      " karomā’’ti. Te tassa paṭisāraṇīyakammaṃ karonti – adhammena samaggā…pe… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā…pe…."
    ],
    "innerText": "414. Idha pana, bhikkhave, bhikkhu gihī akkosati paribhāsati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu gihī akkosati paribhāsati. Handassa mayaṃ paṭisāraṇīyakammaṃ karomā’’ti. Te tassa paṭisāraṇīyakammaṃ karonti – adhammena vaggā. So tamhā āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena paṭisāraṇīyakammakato adhammena vaggehi. Handassa mayaṃ paṭisāraṇīyakammaṃ karomā’’ti. Te tassa paṭisāraṇīyakammaṃ karonti – adhammena samaggā…pe… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Cakkaṃ kātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṭisāraṇīyakammakathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "246. Adassane ukkhepanīyakammakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "415"
      },
      ". Idha pana, bhikkhave, bhikkhu āpattiṃ āpajjitvā na icchati āpattiṃ passituṃ. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu āpattiṃ āpajjitvā na icchati āpattiṃ passituṃ. Handassa mayaṃ āpattiyā adassane ukkhepanīyakammaṃ karomā’’ti. Te tassa āpattiyā adassane ukkhepanīyakammaṃ karonti – adhammena vaggā. So tamhā āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena āpattiyā adassane ukkhepanīyakammakato adhammena vaggehi. Handassa mayaṃ āpattiyā adassane ukkhepanīyakammaṃ karomā’’ti. Te tassa āpattiyā adassane ukkhepanīyakammaṃ karonti – adhammena samaggā…pe… dhammena vaggā… dhammapatirūpakena ",
      " vaggā… dhammapatirūpakena samaggā…pe…."
    ],
    "innerText": "415. Idha pana, bhikkhave, bhikkhu āpattiṃ āpajjitvā na icchati āpattiṃ passituṃ. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu āpattiṃ āpajjitvā na icchati āpattiṃ passituṃ. Handassa mayaṃ āpattiyā adassane ukkhepanīyakammaṃ karomā’’ti. Te tassa āpattiyā adassane ukkhepanīyakammaṃ karonti – adhammena vaggā. So tamhā āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena āpattiyā adassane ukkhepanīyakammakato adhammena vaggehi. Handassa mayaṃ āpattiyā adassane ukkhepanīyakammaṃ karomā’’ti. Te tassa āpattiyā adassane ukkhepanīyakammaṃ karonti – adhammena samaggā…pe… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Cakkaṃ kātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Adassane ukkhepanīyakammakathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "247. Appaṭikamme ukkhepanīyakammakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "416"
      },
      ". Idha ",
      " pana, bhikkhave, bhikkhu āpattiṃ āpajjitvā na icchati āpattiṃ paṭikātuṃ. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu āpattiṃ āpajjitvā na icchati āpattiṃ paṭikātuṃ. Handassa mayaṃ āpattiyā appaṭikamme ukkhepanīyakammaṃ karomā’’ti ",
      ". Te tassa āpattiyā appaṭikamme ukkhepanīyakammaṃ karonti – adhammena vaggā. So tamhā āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena āpattiyā appaṭikamme ukkhepanīyakammakato adhammena vaggehi. Handassa mayaṃ āpattiyā appaṭikamme ukkhepanīyakammaṃ karomā’’ti. Te tassa āpattiyā appaṭikamme ukkhepanīyakammaṃ karonti – adhammena samaggā…pe… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā…pe…."
    ],
    "innerText": "416. Idha pana, bhikkhave, bhikkhu āpattiṃ āpajjitvā na icchati āpattiṃ paṭikātuṃ. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu āpattiṃ āpajjitvā na icchati āpattiṃ paṭikātuṃ. Handassa mayaṃ āpattiyā appaṭikamme ukkhepanīyakammaṃ karomā’’ti . Te tassa āpattiyā appaṭikamme ukkhepanīyakammaṃ karonti – adhammena vaggā. So tamhā āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena āpattiyā appaṭikamme ukkhepanīyakammakato adhammena vaggehi. Handassa mayaṃ āpattiyā appaṭikamme ukkhepanīyakammaṃ karomā’’ti. Te tassa āpattiyā appaṭikamme ukkhepanīyakammaṃ karonti – adhammena samaggā…pe… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Cakkaṃ kātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Appaṭikamme ukkhepanīyakammakathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "248. Appaṭinissagge ukkhepanīyakammakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "417"
      },
      ". Idha ",
      " pana, bhikkhave, bhikkhu na icchati pāpikaṃ diṭṭhiṃ paṭinissajjituṃ. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu na icchati pāpikaṃ diṭṭhiṃ paṭinissajjituṃ. Handassa mayaṃ pāpikāya diṭṭhiyā appaṭinissagge ukkhepanīyakammaṃ karomā’’ti. Te tassa pāpikāya diṭṭhiyā appaṭinissagge ukkhepanīyakammaṃ karonti – adhammena vaggā. So tamhā āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena pāpikāya diṭṭhiyā appaṭinissagge ukkhepanīyakammakato adhammena vaggehi. Handassa mayaṃ pāpikāya diṭṭhiyā appaṭinissagge ukkhepanīyakammaṃ karomā’’ti. Te tassa pāpikāya diṭṭhiyā appaṭinissagge ukkhepanīyakammaṃ karonti – adhammena samaggā…pe… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā…pe…."
    ],
    "innerText": "417. Idha pana, bhikkhave, bhikkhu na icchati pāpikaṃ diṭṭhiṃ paṭinissajjituṃ. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu na icchati pāpikaṃ diṭṭhiṃ paṭinissajjituṃ. Handassa mayaṃ pāpikāya diṭṭhiyā appaṭinissagge ukkhepanīyakammaṃ karomā’’ti. Te tassa pāpikāya diṭṭhiyā appaṭinissagge ukkhepanīyakammaṃ karonti – adhammena vaggā. So tamhā āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena pāpikāya diṭṭhiyā appaṭinissagge ukkhepanīyakammakato adhammena vaggehi. Handassa mayaṃ pāpikāya diṭṭhiyā appaṭinissagge ukkhepanīyakammaṃ karomā’’ti. Te tassa pāpikāya diṭṭhiyā appaṭinissagge ukkhepanīyakammaṃ karonti – adhammena samaggā…pe… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Cakkaṃ kātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Appaṭinissagge ukkhepanīyakammakathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "249. Tajjanīyakammapaṭippassaddhikathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "418"
      },
      ". Idha ",
      " pana, bhikkhave, bhikkhu saṅghena tajjanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, tajjanīyassa kammassa paṭippassaddhiṃ yācati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, tajjanīyassa kammassa paṭippassaddhiṃ yācati. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – adhammena vaggā. So tamhā āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena tajjanīyakammaṃ paṭippassaddhaṃ adhammena samaggehi. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – adhammena samaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti ",
      " – ‘‘imassa kho, āvuso, bhikkhuno saṅghena tajjanīyakammaṃ paṭippassaddhaṃ adhammena vaggehi. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – dhammena vaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena tajjanīyakammaṃ paṭippassaddhaṃ dhammena vaggehi. Handassa ",
      " mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – dhammapatirūpakena vaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena tajjanīyakammaṃ paṭippassaddhaṃ dhammapatirūpakena vaggehi. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – dhammapatirūpakena samaggā."
    ],
    "innerText": "418. Idha pana, bhikkhave, bhikkhu saṅghena tajjanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, tajjanīyassa kammassa paṭippassaddhiṃ yācati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, tajjanīyassa kammassa paṭippassaddhiṃ yācati. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – adhammena vaggā. So tamhā āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena tajjanīyakammaṃ paṭippassaddhaṃ adhammena samaggehi. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – adhammena samaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena tajjanīyakammaṃ paṭippassaddhaṃ adhammena vaggehi. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – dhammena vaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena tajjanīyakammaṃ paṭippassaddhaṃ dhammena vaggehi. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – dhammapatirūpakena vaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena tajjanīyakammaṃ paṭippassaddhaṃ dhammapatirūpakena vaggehi. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – dhammapatirūpakena samaggā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "419"
      },
      ". Idha pana, bhikkhave, bhikkhu ",
      " saṅghena tajjanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, tajjanīyassa kammassa paṭippassaddhiṃ yācati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, tajjanīyassa kammassa paṭippassaddhiṃ yācati. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – adhammena samaggā. So tamhā āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena tajjanīyakammaṃ paṭippassaddhaṃ adhammena samaggehi. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – dhammena vaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena tajjanīyakammaṃ paṭippassaddhaṃ dhammena vaggehi. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – dhammapatirūpakena vaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena tajjanīyakammaṃ paṭippassaddhaṃ dhammapatirūpakena vaggehi. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – dhammapatirūpakena samaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena tajjanīyakammaṃ paṭippassaddhaṃ dhammapatirūpakena samaggehi. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – adhammena vaggā."
    ],
    "innerText": "419. Idha pana, bhikkhave, bhikkhu saṅghena tajjanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, tajjanīyassa kammassa paṭippassaddhiṃ yācati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, tajjanīyassa kammassa paṭippassaddhiṃ yācati. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – adhammena samaggā. So tamhā āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena tajjanīyakammaṃ paṭippassaddhaṃ adhammena samaggehi. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – dhammena vaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena tajjanīyakammaṃ paṭippassaddhaṃ dhammena vaggehi. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – dhammapatirūpakena vaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena tajjanīyakammaṃ paṭippassaddhaṃ dhammapatirūpakena vaggehi. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – dhammapatirūpakena samaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena tajjanīyakammaṃ paṭippassaddhaṃ dhammapatirūpakena samaggehi. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – adhammena vaggā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "420"
      },
      ". Idha pana, bhikkhave, bhikkhu saṅghena tajjanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, tajjanīyassa kammassa paṭippassaddhiṃ yācati ",
      ". Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, tajjanīyassa kammassa paṭippassaddhiṃ yācati. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – dhammena vaggā. So tamhā āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena tajjanīyakammaṃ paṭippassaddhaṃ dhammena vaggehi. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – dhammapatirūpakena vaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena tajjanīyakammaṃ paṭippassaddhaṃ dhammapatirūpakena vaggehi. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – dhammapatirūpakena samaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena tajjanīyakammaṃ paṭippassaddhaṃ dhammapatirūpakena samaggehi. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – adhammena vaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena tajjanīyakammaṃ paṭippassaddhaṃ adhammena vaggehi. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – adhammena samaggā."
    ],
    "innerText": "420. Idha pana, bhikkhave, bhikkhu saṅghena tajjanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, tajjanīyassa kammassa paṭippassaddhiṃ yācati . Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, tajjanīyassa kammassa paṭippassaddhiṃ yācati. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – dhammena vaggā. So tamhā āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena tajjanīyakammaṃ paṭippassaddhaṃ dhammena vaggehi. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – dhammapatirūpakena vaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena tajjanīyakammaṃ paṭippassaddhaṃ dhammapatirūpakena vaggehi. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – dhammapatirūpakena samaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena tajjanīyakammaṃ paṭippassaddhaṃ dhammapatirūpakena samaggehi. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – adhammena vaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena tajjanīyakammaṃ paṭippassaddhaṃ adhammena vaggehi. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – adhammena samaggā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "421"
      },
      ". Idha ",
      " pana, bhikkhave, bhikkhu saṅghena tajjanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, tajjanīyassa kammassa paṭippassaddhiṃ yācati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, tajjanīyassa ",
      " kammassa paṭippassaddhiṃ yācati. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – dhammapatirūpakena vaggā. So tamhā āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena tajjanīyakammaṃ paṭippassaddhaṃ dhammapatirūpakena vaggehi. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – dhammapatirūpakena samaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ ",
      " hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena tajjanīyakammaṃ paṭippassaddhaṃ dhammapatirūpakena samaggehi. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – adhammena vaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena tajjanīyakammaṃ paṭippassaddhaṃ adhammena vaggehi. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – adhammena samaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena tajjanīyakammaṃ paṭippassaddhaṃ adhammena samaggehi. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – dhammena vaggā."
    ],
    "innerText": "421. Idha pana, bhikkhave, bhikkhu saṅghena tajjanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, tajjanīyassa kammassa paṭippassaddhiṃ yācati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, tajjanīyassa kammassa paṭippassaddhiṃ yācati. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – dhammapatirūpakena vaggā. So tamhā āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena tajjanīyakammaṃ paṭippassaddhaṃ dhammapatirūpakena vaggehi. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – dhammapatirūpakena samaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena tajjanīyakammaṃ paṭippassaddhaṃ dhammapatirūpakena samaggehi. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – adhammena vaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena tajjanīyakammaṃ paṭippassaddhaṃ adhammena vaggehi. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – adhammena samaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena tajjanīyakammaṃ paṭippassaddhaṃ adhammena samaggehi. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – dhammena vaggā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "422"
      },
      ". Idha pana, bhikkhave, bhikkhu saṅghena tajjanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, tajjanīyassa kammassa paṭippassaddhiṃ yācati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, tajjanīyassa kammassa paṭippassaddhiṃ yācati. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – dhammapatirūpakena samaggā. So tamhā āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena tajjanīyakammaṃ paṭippassaddhaṃ dhammapatirūpakena samaggehi. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – adhammena vaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena tajjanīyakammaṃ ",
      " paṭippassaddhaṃ adhammena vaggehi. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – adhammena samaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena tajjanīyakammaṃ paṭippassaddhaṃ adhammena samaggehi. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – dhammena vaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena tajjanīyakammaṃ paṭippassaddhaṃ ",
      " dhammena vaggehi. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – dhammapatirūpakena vaggā."
    ],
    "innerText": "422. Idha pana, bhikkhave, bhikkhu saṅghena tajjanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, tajjanīyassa kammassa paṭippassaddhiṃ yācati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, tajjanīyassa kammassa paṭippassaddhiṃ yācati. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – dhammapatirūpakena samaggā. So tamhā āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena tajjanīyakammaṃ paṭippassaddhaṃ dhammapatirūpakena samaggehi. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – adhammena vaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena tajjanīyakammaṃ paṭippassaddhaṃ adhammena vaggehi. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – adhammena samaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena tajjanīyakammaṃ paṭippassaddhaṃ adhammena samaggehi. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – dhammena vaggā. So tamhāpi āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena tajjanīyakammaṃ paṭippassaddhaṃ dhammena vaggehi. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – dhammapatirūpakena vaggā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tajjanīyakammapaṭippassaddhikathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "250. Niyassakammapaṭippassaddhikathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "423"
      },
      ". Idha pana, bhikkhave, bhikkhu saṅghena niyassakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, niyassassa kammassa paṭippassaddhiṃ yācati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena niyassakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, niyassassa kammassa paṭippassaddhiṃ yācati. Handassa mayaṃ niyassakammaṃ paṭippassambhemā’’ti. Te tassa niyassakammaṃ paṭippassambhenti – adhammena vaggā. So tamhā āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena niyassakammaṃ paṭippassaddhaṃ adhammena vaggehi. Handassa mayaṃ niyassakammaṃ paṭippassambhemā’’ti. Te tassa niyassakammaṃ paṭippassambhenti – adhammena samaggā…pe… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā…pe…."
    ],
    "innerText": "423. Idha pana, bhikkhave, bhikkhu saṅghena niyassakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, niyassassa kammassa paṭippassaddhiṃ yācati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena niyassakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, niyassassa kammassa paṭippassaddhiṃ yācati. Handassa mayaṃ niyassakammaṃ paṭippassambhemā’’ti. Te tassa niyassakammaṃ paṭippassambhenti – adhammena vaggā. So tamhā āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena niyassakammaṃ paṭippassaddhaṃ adhammena vaggehi. Handassa mayaṃ niyassakammaṃ paṭippassambhemā’’ti. Te tassa niyassakammaṃ paṭippassambhenti – adhammena samaggā…pe… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Cakkaṃ kātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Niyassakammapaṭippassaddhikathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "251. Pabbājanīyakammapaṭippassaddhikathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "424"
      },
      ". Idha ",
      " pana, bhikkhave, bhikkhu saṅghena pabbājanīyakammakato sammā vattati, lomaṃ pāteti ",
      ", netthāraṃ vattati, pabbājanīyassa kammassa paṭippassaddhiṃ yācati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena pabbājanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, pabbājanīyassa kammassa paṭippassaddhiṃ yācati. Handassa mayaṃ pabbājanīyakammaṃ paṭippassambhemā’’ti. Te tassa pabbājanīyakammaṃ paṭippassambhenti – adhammena vaggā. So tamhā āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena pabbājanīyakammaṃ paṭippassaddhaṃ adhammena vaggehi. Handassa mayaṃ pabbājanīyakammaṃ paṭippassambhemā’’ti. Te tassa pabbājanīyakammaṃ paṭippassambhenti – adhammena samaggā…pe… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā…pe…."
    ],
    "innerText": "424. Idha pana, bhikkhave, bhikkhu saṅghena pabbājanīyakammakato sammā vattati, lomaṃ pāteti , netthāraṃ vattati, pabbājanīyassa kammassa paṭippassaddhiṃ yācati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena pabbājanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, pabbājanīyassa kammassa paṭippassaddhiṃ yācati. Handassa mayaṃ pabbājanīyakammaṃ paṭippassambhemā’’ti. Te tassa pabbājanīyakammaṃ paṭippassambhenti – adhammena vaggā. So tamhā āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena pabbājanīyakammaṃ paṭippassaddhaṃ adhammena vaggehi. Handassa mayaṃ pabbājanīyakammaṃ paṭippassambhemā’’ti. Te tassa pabbājanīyakammaṃ paṭippassambhenti – adhammena samaggā…pe… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Cakkaṃ kātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pabbājanīyakammapaṭippassaddhikathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "252. Paṭisāraṇīyakammapaṭippassaddhikathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "425"
      },
      ". Idha ",
      " pana, bhikkhave, bhikkhu saṅghena paṭisāraṇīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, paṭisāraṇīyassa kammassa paṭippassaddhiṃ yācati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena paṭisāraṇīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, paṭisāraṇīyassa kammassa paṭippassaddhiṃ yācati. Handassa mayaṃ paṭisāraṇīyakammaṃ paṭippassambhemā’’ti. Te tassa paṭisāraṇīyakammaṃ paṭippassambhenti – adhammena vaggā. So tamhā āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena paṭisāraṇīyakammaṃ paṭippassaddhaṃ adhammena vaggehi. Handassa mayaṃ paṭisāraṇīyakammaṃ paṭippassambhemā’’ti. Te tassa paṭisāraṇīyakammaṃ paṭippassambhenti – adhammena samaggā…pe… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā…pe…."
    ],
    "innerText": "425. Idha pana, bhikkhave, bhikkhu saṅghena paṭisāraṇīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, paṭisāraṇīyassa kammassa paṭippassaddhiṃ yācati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena paṭisāraṇīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, paṭisāraṇīyassa kammassa paṭippassaddhiṃ yācati. Handassa mayaṃ paṭisāraṇīyakammaṃ paṭippassambhemā’’ti. Te tassa paṭisāraṇīyakammaṃ paṭippassambhenti – adhammena vaggā. So tamhā āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena paṭisāraṇīyakammaṃ paṭippassaddhaṃ adhammena vaggehi. Handassa mayaṃ paṭisāraṇīyakammaṃ paṭippassambhemā’’ti. Te tassa paṭisāraṇīyakammaṃ paṭippassambhenti – adhammena samaggā…pe… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Cakkaṃ kātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṭisāraṇīyakammapaṭippassaddhikathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "253. Adassane ukkhepanīyakammapaṭippassaddhikathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "426"
      },
      ". Idha ",
      " pana, bhikkhave, bhikkhu saṅghena āpattiyā adassane ukkhepanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, āpattiyā ",
      " adassane ukkhepanīyassa kammassa paṭippassaddhiṃ yācati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena āpattiyā adassane ukkhepanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, āpattiyā adassane ukkhepanīyassa kammassa paṭippassaddhiṃ yācati. Handassa mayaṃ āpattiyā adassane ukkhepanīyakammaṃ paṭippassambhemā’’ti. Te tassa āpattiyā adassane ukkhepanīyakammaṃ paṭippassambhenti – adhammena vaggā. So tamhā āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena āpattiyā adassane ukkhepanīyakammaṃ paṭippassaddhaṃ adhammena vaggehi. Handassa mayaṃ āpattiyā adassane ukkhepanīyakammaṃ paṭippassambhemā’’ti. Te tassa āpattiyā adassane ukkhepanīyakammaṃ ",
      " paṭippassambhenti – adhammena samaggā…pe… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā…pe…."
    ],
    "innerText": "426. Idha pana, bhikkhave, bhikkhu saṅghena āpattiyā adassane ukkhepanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, āpattiyā adassane ukkhepanīyassa kammassa paṭippassaddhiṃ yācati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena āpattiyā adassane ukkhepanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, āpattiyā adassane ukkhepanīyassa kammassa paṭippassaddhiṃ yācati. Handassa mayaṃ āpattiyā adassane ukkhepanīyakammaṃ paṭippassambhemā’’ti. Te tassa āpattiyā adassane ukkhepanīyakammaṃ paṭippassambhenti – adhammena vaggā. So tamhā āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena āpattiyā adassane ukkhepanīyakammaṃ paṭippassaddhaṃ adhammena vaggehi. Handassa mayaṃ āpattiyā adassane ukkhepanīyakammaṃ paṭippassambhemā’’ti. Te tassa āpattiyā adassane ukkhepanīyakammaṃ paṭippassambhenti – adhammena samaggā…pe… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Cakkaṃ kātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Adassane ukkhepanīyakammapaṭippassaddhikathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "254. Appaṭikamme ukkhepanīyakammapaṭippassaddhikathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "427"
      },
      ". Idha pana, bhikkhave, bhikkhu saṅghena āpattiyā appaṭikamme ukkhepanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, āpattiyā appaṭikamme ukkhepanīyassa kammassa paṭippassaddhiṃ yācati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena āpattiyā appaṭikamme ukkhepanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, āpattiyā appaṭikamme ukkhepanīyassa kammassa paṭippassaddhiṃ yācati. Handassa mayaṃ āpattiyā appaṭikamme ukkhepanīyakammaṃ paṭippassambhemā’’ti. Te tassa āpattiyā appaṭikamme ukkhepanīyakammaṃ paṭippassambhenti – adhammena vaggā. So tamhā āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena āpattiyā appaṭikamme ukkhepanīyakammaṃ paṭippassaddhaṃ – adhammena vaggehi. Handassa mayaṃ āpattiyā appaṭikamme ukkhepanīyakammaṃ paṭippassambhemā’’ti. Te tassa ",
      " āpattiyā appaṭikamme ukkhepanīyakammaṃ paṭippassambhenti – adhammena samaggā…pe… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā…pe…."
    ],
    "innerText": "427. Idha pana, bhikkhave, bhikkhu saṅghena āpattiyā appaṭikamme ukkhepanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, āpattiyā appaṭikamme ukkhepanīyassa kammassa paṭippassaddhiṃ yācati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena āpattiyā appaṭikamme ukkhepanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, āpattiyā appaṭikamme ukkhepanīyassa kammassa paṭippassaddhiṃ yācati. Handassa mayaṃ āpattiyā appaṭikamme ukkhepanīyakammaṃ paṭippassambhemā’’ti. Te tassa āpattiyā appaṭikamme ukkhepanīyakammaṃ paṭippassambhenti – adhammena vaggā. So tamhā āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena āpattiyā appaṭikamme ukkhepanīyakammaṃ paṭippassaddhaṃ – adhammena vaggehi. Handassa mayaṃ āpattiyā appaṭikamme ukkhepanīyakammaṃ paṭippassambhemā’’ti. Te tassa āpattiyā appaṭikamme ukkhepanīyakammaṃ paṭippassambhenti – adhammena samaggā…pe… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Cakkaṃ kātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Appaṭikamme ukkhepanīyakammapaṭippassaddhikathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "255. Appaṭinissagge ukkhepanīyakammapaṭippassaddhikathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "428"
      },
      ". Idha pana, bhikkhave, bhikkhu saṅghena pāpikāya diṭṭhiyā appaṭinissagge ",
      " ukkhepanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, pāpikāya diṭṭhiyā appaṭinissagge ukkhepanīyassa kammassa paṭippassaddhiṃ yācati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena pāpikāya diṭṭhiyā appaṭinissagge ukkhepanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, pāpikāya diṭṭhiyā appaṭinissagge ukkhepanīyassa kammassa paṭippassaddhiṃ yācati. Handassa mayaṃ pāpikāya diṭṭhiyā appaṭinissagge ukkhepanīyakammaṃ paṭippassambhemā’’ti. Te tassa ",
      " pāpikāya diṭṭhiyā appaṭinissagge ukkhepanīyakammaṃ paṭippassambhenti – adhammena vaggā. So tamhā āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena pāpikāya diṭṭhiyā appaṭinissagge ukkhepanīyakammaṃ paṭippassaddhaṃ – adhammena vaggehi. Handassa mayaṃ pāpikāya diṭṭhiyā appaṭinissagge ukkhepanīyakammaṃ paṭippassambhemā’’ti. Te tassa pāpikāya diṭṭhiyā appaṭinissagge ukkhepanīyakammaṃ paṭippassambhenti… adhammena samaggā…pe… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā…pe…."
    ],
    "innerText": "428. Idha pana, bhikkhave, bhikkhu saṅghena pāpikāya diṭṭhiyā appaṭinissagge ukkhepanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, pāpikāya diṭṭhiyā appaṭinissagge ukkhepanīyassa kammassa paṭippassaddhiṃ yācati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena pāpikāya diṭṭhiyā appaṭinissagge ukkhepanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, pāpikāya diṭṭhiyā appaṭinissagge ukkhepanīyassa kammassa paṭippassaddhiṃ yācati. Handassa mayaṃ pāpikāya diṭṭhiyā appaṭinissagge ukkhepanīyakammaṃ paṭippassambhemā’’ti. Te tassa pāpikāya diṭṭhiyā appaṭinissagge ukkhepanīyakammaṃ paṭippassambhenti – adhammena vaggā. So tamhā āvāsā aññaṃ āvāsaṃ gacchati. Tatthapi bhikkhūnaṃ evaṃ hoti – ‘‘imassa kho, āvuso, bhikkhuno saṅghena pāpikāya diṭṭhiyā appaṭinissagge ukkhepanīyakammaṃ paṭippassaddhaṃ – adhammena vaggehi. Handassa mayaṃ pāpikāya diṭṭhiyā appaṭinissagge ukkhepanīyakammaṃ paṭippassambhemā’’ti. Te tassa pāpikāya diṭṭhiyā appaṭinissagge ukkhepanīyakammaṃ paṭippassambhenti… adhammena samaggā…pe… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Cakkaṃ kātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Appaṭinissagge ukkhepanīyakammapaṭippassaddhikathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "256. Tajjanīyakammavivādakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "429"
      },
      ". Idha pana, bhikkhave, bhikkhu bhaṇḍanakārako hoti kalahakārako vivādakārako bhassakārako saṅghe adhikaraṇakārako. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu bhaṇḍanakārako…pe… saṅghe adhikaraṇakārako. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti ",
      ". Te tassa tajjanīyakammaṃ karonti – adhammena vaggā. Tatraṭṭho saṅgho vivadati – ‘‘adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena vaggakammaṃ, dhammapatirūpakena vaggakammaṃ, dhammapatirūpakena samaggakammaṃ, akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti. Tatra, bhikkhave, ye te bhikkhū evamāhaṃsu – ‘‘adhammena ",
      " vaggakamma’’nti, ye ca te bhikkhū evamāhaṃsu – ‘‘akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti, ime tattha bhikkhū dhammavādino."
    ],
    "innerText": "429. Idha pana, bhikkhave, bhikkhu bhaṇḍanakārako hoti kalahakārako vivādakārako bhassakārako saṅghe adhikaraṇakārako. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu bhaṇḍanakārako…pe… saṅghe adhikaraṇakārako. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti . Te tassa tajjanīyakammaṃ karonti – adhammena vaggā. Tatraṭṭho saṅgho vivadati – ‘‘adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena vaggakammaṃ, dhammapatirūpakena vaggakammaṃ, dhammapatirūpakena samaggakammaṃ, akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti. Tatra, bhikkhave, ye te bhikkhū evamāhaṃsu – ‘‘adhammena vaggakamma’’nti, ye ca te bhikkhū evamāhaṃsu – ‘‘akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti, ime tattha bhikkhū dhammavādino."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "430"
      },
      ". Idha pana, bhikkhave, bhikkhu bhaṇḍanakārako hoti…pe… saṅghe adhikaraṇakārako. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu bhaṇḍanakārako…pe… saṅghe adhikaraṇakārako. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – adhammena samaggā. Tatraṭṭho saṅgho vivadati – ‘‘adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena vaggakammaṃ, dhammapatirūpakena vaggakammaṃ, dhammapatirūpakena samaggakammaṃ, akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti. Tatra, bhikkhave, ye te bhikkhū evamāhaṃsu – ‘‘adhammena samaggakamma’’nti, ye ca te bhikkhū evamāhaṃsu – ‘‘akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti, ime tattha bhikkhū dhammavādino."
    ],
    "innerText": "430. Idha pana, bhikkhave, bhikkhu bhaṇḍanakārako hoti…pe… saṅghe adhikaraṇakārako. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu bhaṇḍanakārako…pe… saṅghe adhikaraṇakārako. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – adhammena samaggā. Tatraṭṭho saṅgho vivadati – ‘‘adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena vaggakammaṃ, dhammapatirūpakena vaggakammaṃ, dhammapatirūpakena samaggakammaṃ, akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti. Tatra, bhikkhave, ye te bhikkhū evamāhaṃsu – ‘‘adhammena samaggakamma’’nti, ye ca te bhikkhū evamāhaṃsu – ‘‘akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti, ime tattha bhikkhū dhammavādino."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "431"
      },
      ". Idha ",
      " pana, bhikkhave, bhikkhu bhaṇḍanakārako hoti…pe… saṅghe adhikaraṇakārako. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu bhaṇḍanakārako…pe… saṅghe adhikaraṇakārako handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti ",
      " – dhammena vaggā. Tatraṭṭho saṅgho vivadati – ‘‘adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena vaggakammaṃ, dhammapatirūpakena vaggakammaṃ, dhammapatirūpakena samaggakammaṃ, akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti. Tatra, bhikkhave, ye te bhikkhū evamāhaṃsu – ‘‘dhammena vaggakamma’’nti, ye ca te bhikkhū evamāhaṃsu – ‘‘akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti, ime tattha bhikkhū dhammavādino."
    ],
    "innerText": "431. Idha pana, bhikkhave, bhikkhu bhaṇḍanakārako hoti…pe… saṅghe adhikaraṇakārako. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu bhaṇḍanakārako…pe… saṅghe adhikaraṇakārako handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – dhammena vaggā. Tatraṭṭho saṅgho vivadati – ‘‘adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena vaggakammaṃ, dhammapatirūpakena vaggakammaṃ, dhammapatirūpakena samaggakammaṃ, akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti. Tatra, bhikkhave, ye te bhikkhū evamāhaṃsu – ‘‘dhammena vaggakamma’’nti, ye ca te bhikkhū evamāhaṃsu – ‘‘akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti, ime tattha bhikkhū dhammavādino."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "432"
      },
      ". Idha pana, bhikkhave, bhikkhu bhaṇḍanakārako hoti…pe… saṅghe adhikaraṇakārako. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu bhaṇḍanakārako…pe… saṅghe adhikaraṇakārako. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa ",
      " tajjanīyakammaṃ karonti – dhammapatirūpakena vaggā. Tatraṭṭho saṅgho vivadati – ‘‘adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena vaggakammaṃ, dhammapatirūpakena vaggakammaṃ, dhammapatirūpakena samaggakammaṃ, akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti. Tatra, bhikkhave, ye te bhikkhū evamāhaṃsu – ‘‘dhammapatirūpakena samaggakamma’’nti, ye ca te bhikkhū evamāhaṃsu – ‘‘akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti, ime tattha bhikkhū dhammavādino."
    ],
    "innerText": "432. Idha pana, bhikkhave, bhikkhu bhaṇḍanakārako hoti…pe… saṅghe adhikaraṇakārako. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu bhaṇḍanakārako…pe… saṅghe adhikaraṇakārako. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – dhammapatirūpakena vaggā. Tatraṭṭho saṅgho vivadati – ‘‘adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena vaggakammaṃ, dhammapatirūpakena vaggakammaṃ, dhammapatirūpakena samaggakammaṃ, akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti. Tatra, bhikkhave, ye te bhikkhū evamāhaṃsu – ‘‘dhammapatirūpakena samaggakamma’’nti, ye ca te bhikkhū evamāhaṃsu – ‘‘akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti, ime tattha bhikkhū dhammavādino."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "433"
      },
      ". Idha pana, bhikkhave, bhikkhu bhaṇḍanakārako hoti…pe… ",
      " saṅghe adhikaraṇakārako. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu bhaṇḍanakārako hoti…pe… saṅghe adhikaraṇakārako. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – dhammapatirūpakena samaggā. Tatraṭṭho saṅgho vivadati – ‘‘adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena vaggakammaṃ, dhammapatirūpakena vaggakammaṃ, dhammapatirūpakena samaggakammaṃ, akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti. Tatra, bhikkhave, ye te bhikkhū evamāhaṃsu – ‘‘dhammapatirūpakena samaggakamma’’nti, ye ca te bhikkhū evamāhaṃsu – ‘‘akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti, ime tattha bhikkhū dhammavādino."
    ],
    "innerText": "433. Idha pana, bhikkhave, bhikkhu bhaṇḍanakārako hoti…pe… saṅghe adhikaraṇakārako. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu bhaṇḍanakārako hoti…pe… saṅghe adhikaraṇakārako. Handassa mayaṃ tajjanīyakammaṃ karomā’’ti. Te tassa tajjanīyakammaṃ karonti – dhammapatirūpakena samaggā. Tatraṭṭho saṅgho vivadati – ‘‘adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena vaggakammaṃ, dhammapatirūpakena vaggakammaṃ, dhammapatirūpakena samaggakammaṃ, akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti. Tatra, bhikkhave, ye te bhikkhū evamāhaṃsu – ‘‘dhammapatirūpakena samaggakamma’’nti, ye ca te bhikkhū evamāhaṃsu – ‘‘akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti, ime tattha bhikkhū dhammavādino."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tajjanīyakammavivādakathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "257. Niyassakammavivādakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "434"
      },
      ". Idha ",
      " pana, bhikkhave, bhikkhu bālo hoti abyatto āpattibahulo anapadāno, gihisaṃsaṭṭho viharati ananulomikehi gihisaṃsaggehi. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu bālo abyatto āpattibahulo anapadāno, gihisaṃsaṭṭho viharati ananulomikehi gihisaṃsaggehi. Handassa mayaṃ niyassakammaṃ karomā’’ti. Te tassa niyassakammaṃ karonti – adhammena vaggā…pe… adhammena samaggā… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā. Tatraṭṭho saṅgho vivadati – ‘‘adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena vaggakammaṃ, dhammapatirūpakena vaggakammaṃ ",
      ", dhammapatirūpakena samaggakammaṃ, akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti. Tatra, bhikkhave, ye te bhikkhū evamāhaṃsu – ‘‘dhammapatirūpakena samaggakamma’’nti, ye ca te bhikkhū evamāhaṃsu ",
      " – ‘‘akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti, ime tattha bhikkhū dhammavādino. Ime pañca vārā saṃkhittā."
    ],
    "innerText": "434. Idha pana, bhikkhave, bhikkhu bālo hoti abyatto āpattibahulo anapadāno, gihisaṃsaṭṭho viharati ananulomikehi gihisaṃsaggehi. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu bālo abyatto āpattibahulo anapadāno, gihisaṃsaṭṭho viharati ananulomikehi gihisaṃsaggehi. Handassa mayaṃ niyassakammaṃ karomā’’ti. Te tassa niyassakammaṃ karonti – adhammena vaggā…pe… adhammena samaggā… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā. Tatraṭṭho saṅgho vivadati – ‘‘adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena vaggakammaṃ, dhammapatirūpakena vaggakammaṃ , dhammapatirūpakena samaggakammaṃ, akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti. Tatra, bhikkhave, ye te bhikkhū evamāhaṃsu – ‘‘dhammapatirūpakena samaggakamma’’nti, ye ca te bhikkhū evamāhaṃsu – ‘‘akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti, ime tattha bhikkhū dhammavādino. Ime pañca vārā saṃkhittā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Niyassakammavivādakathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "258. Pabbājanīyakammavivādakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "435"
      },
      ". Idha pana, bhikkhave, bhikkhu kuladūsako hoti pāpasamācāro. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu kuladūsako pāpasamācāro. Handassa mayaṃ pabbājanīyakammaṃ karomā’’ti. Te tassa pabbājanīyakammaṃ karonti – adhammena vaggā…pe… adhammena samaggā… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā. Tatraṭṭho saṅgho vivadati – ‘‘adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena vaggakammaṃ, dhammapatirūpakena vaggakammaṃ, dhammapatirūpakena samaggakammaṃ, akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti. Tatra, bhikkhave, ye te bhikkhū evamāhaṃsu – ‘‘dhammapatirūpakena samaggakamma’’nti ye ca te bhikkhū evamāhaṃsu – ‘‘akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti, ime tattha bhikkhū dhammavādino. Ime pañca vārā saṃkhittā."
    ],
    "innerText": "435. Idha pana, bhikkhave, bhikkhu kuladūsako hoti pāpasamācāro. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu kuladūsako pāpasamācāro. Handassa mayaṃ pabbājanīyakammaṃ karomā’’ti. Te tassa pabbājanīyakammaṃ karonti – adhammena vaggā…pe… adhammena samaggā… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā. Tatraṭṭho saṅgho vivadati – ‘‘adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena vaggakammaṃ, dhammapatirūpakena vaggakammaṃ, dhammapatirūpakena samaggakammaṃ, akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti. Tatra, bhikkhave, ye te bhikkhū evamāhaṃsu – ‘‘dhammapatirūpakena samaggakamma’’nti ye ca te bhikkhū evamāhaṃsu – ‘‘akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti, ime tattha bhikkhū dhammavādino. Ime pañca vārā saṃkhittā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pabbājanīyakammavivādakathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "259. Paṭisāraṇīyakammavivādakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "436"
      },
      ". Idha pana, bhikkhave, bhikkhu gihī akkosati paribhāsati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu gihī akkosati ",
      " paribhāsati. Handassa mayaṃ paṭisāraṇīyakammaṃ ",
      " karomā’’ti. Te ",
      " tassa paṭisāraṇīyakammaṃ karonti – adhammena vaggā…pe… adhammena samaggā… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā. Tatraṭṭho saṅgho vivadati – ‘‘adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena vaggakammaṃ, dhammapatirūpakena vaggakammaṃ, dhammapatirūpakena samaggakammaṃ, akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti. Tatra, bhikkhave, ye te bhikkhū evamāhaṃsu – ‘‘dhammapatirūpakena samaggakamma’’nti, ye ca te bhikkhū evamāhaṃsu – ‘‘akataṃ kammaṃ ",
      " dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti, ime tattha bhikkhū dhammavādino. Ime pañca vārā saṃkhittā."
    ],
    "innerText": "436. Idha pana, bhikkhave, bhikkhu gihī akkosati paribhāsati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu gihī akkosati paribhāsati. Handassa mayaṃ paṭisāraṇīyakammaṃ karomā’’ti. Te tassa paṭisāraṇīyakammaṃ karonti – adhammena vaggā…pe… adhammena samaggā… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā. Tatraṭṭho saṅgho vivadati – ‘‘adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena vaggakammaṃ, dhammapatirūpakena vaggakammaṃ, dhammapatirūpakena samaggakammaṃ, akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti. Tatra, bhikkhave, ye te bhikkhū evamāhaṃsu – ‘‘dhammapatirūpakena samaggakamma’’nti, ye ca te bhikkhū evamāhaṃsu – ‘‘akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti, ime tattha bhikkhū dhammavādino. Ime pañca vārā saṃkhittā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṭisāraṇīyakammavivādakathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "260. Adassane ukkhepanīyakammavivādakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "437"
      },
      ". Idha pana, bhikkhave, bhikkhu āpattiṃ āpajjitvā na icchati āpattiṃ passituṃ. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu āpattiṃ āpajjitvā na icchati āpattiṃ passituṃ. Handassa mayaṃ āpattiyā adassane ukkhepanīyakammaṃ karomā’’ti. Te tassa āpattiyā adassane ukkhepanīyakammaṃ karonti – adhammena vaggā…pe… adhammena samaggā… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā. Tatraṭṭho saṅgho vivadati – ‘‘adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena vaggakammaṃ, dhammapatirūpakena vaggakammaṃ, dhammapatirūpakena samaggakammaṃ, akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti. Tatra, bhikkhave, ye ",
      " te bhikkhū evamāhaṃsu – ‘‘dhammapatirūpakena samaggakamma’’nti, ye ca te bhikkhū evamāhaṃsu – ‘‘akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti, ime tattha bhikkhū dhammavādino. Ime pañca vārā saṃkhittā."
    ],
    "innerText": "437. Idha pana, bhikkhave, bhikkhu āpattiṃ āpajjitvā na icchati āpattiṃ passituṃ. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu āpattiṃ āpajjitvā na icchati āpattiṃ passituṃ. Handassa mayaṃ āpattiyā adassane ukkhepanīyakammaṃ karomā’’ti. Te tassa āpattiyā adassane ukkhepanīyakammaṃ karonti – adhammena vaggā…pe… adhammena samaggā… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā. Tatraṭṭho saṅgho vivadati – ‘‘adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena vaggakammaṃ, dhammapatirūpakena vaggakammaṃ, dhammapatirūpakena samaggakammaṃ, akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti. Tatra, bhikkhave, ye te bhikkhū evamāhaṃsu – ‘‘dhammapatirūpakena samaggakamma’’nti, ye ca te bhikkhū evamāhaṃsu – ‘‘akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti, ime tattha bhikkhū dhammavādino. Ime pañca vārā saṃkhittā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Adassane ukkhepanīyakammavivādakathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "261. Appaṭikamme ukkhepanīyakammavivādakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "438"
      },
      ". Idha pana, bhikkhave, bhikkhu āpattiṃ āpajjitvā na icchati āpattiṃ paṭikātuṃ. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu āpattiṃ āpajjitvā na icchati āpattiṃ paṭikātuṃ. Handassa mayaṃ āpattiyā appaṭikamme ukkhepanīyakammaṃ karomā’’ti. Te tassa āpattiyā appaṭikamme ukkhepanīyakammaṃ karonti – adhammena vaggā…pe… adhammena samaggā… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā. Tatraṭṭho saṅgho vivadati – ‘‘adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena ",
      " vaggakammaṃ, dhammapatirūpakena vaggakammaṃ, dhammapatirūpakena samaggakammaṃ, akataṃ ",
      " kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti. Tatra, bhikkhave, ye te bhikkhū evamāhaṃsu – ‘‘dhammapatirūpakena samaggakamma’’nti; ye ca te bhikkhū evamāhaṃsu – ‘‘akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti, ime tattha bhikkhū dhammavādino. Ime pañca vārā saṃkhittā."
    ],
    "innerText": "438. Idha pana, bhikkhave, bhikkhu āpattiṃ āpajjitvā na icchati āpattiṃ paṭikātuṃ. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu āpattiṃ āpajjitvā na icchati āpattiṃ paṭikātuṃ. Handassa mayaṃ āpattiyā appaṭikamme ukkhepanīyakammaṃ karomā’’ti. Te tassa āpattiyā appaṭikamme ukkhepanīyakammaṃ karonti – adhammena vaggā…pe… adhammena samaggā… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā. Tatraṭṭho saṅgho vivadati – ‘‘adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena vaggakammaṃ, dhammapatirūpakena vaggakammaṃ, dhammapatirūpakena samaggakammaṃ, akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti. Tatra, bhikkhave, ye te bhikkhū evamāhaṃsu – ‘‘dhammapatirūpakena samaggakamma’’nti; ye ca te bhikkhū evamāhaṃsu – ‘‘akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti, ime tattha bhikkhū dhammavādino. Ime pañca vārā saṃkhittā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Appaṭikamme ukkhepanīyakammavivādakathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "262. Appaṭinissagge ukkhepanīyakammavivādakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "439"
      },
      ". Idha pana, bhikkhave, bhikkhu na icchati pāpikaṃ diṭṭhiṃ paṭinissajjituṃ. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu na icchati pāpikaṃ diṭṭhiṃ paṭinissajjituṃ. Handassa mayaṃ pāpikāya diṭṭhiyā appaṭinissagge ",
      " ukkhepanīyakammaṃ karomā’’ti. Te tassa pāpikāya diṭṭhiyā appaṭinissagge ukkhepanīyakammaṃ karonti – adhammena vaggā…pe… adhammena samaggā… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā. Tatraṭṭho saṅgho vivadati – ‘‘adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena vaggakammaṃ, dhammapatirūpakena vaggakammaṃ, dhammapatirūpakena samaggakammaṃ, akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti. Tatra, bhikkhave, ye te bhikkhū evamāhaṃsu – ‘‘dhammapatirūpakena samaggakamma’’nti, ye ca te bhikkhū evamāhaṃsu – ‘‘akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti, ime tattha bhikkhū dhammavādino. Ime pañca vārā saṃkhittā."
    ],
    "innerText": "439. Idha pana, bhikkhave, bhikkhu na icchati pāpikaṃ diṭṭhiṃ paṭinissajjituṃ. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu na icchati pāpikaṃ diṭṭhiṃ paṭinissajjituṃ. Handassa mayaṃ pāpikāya diṭṭhiyā appaṭinissagge ukkhepanīyakammaṃ karomā’’ti. Te tassa pāpikāya diṭṭhiyā appaṭinissagge ukkhepanīyakammaṃ karonti – adhammena vaggā…pe… adhammena samaggā… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā. Tatraṭṭho saṅgho vivadati – ‘‘adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena vaggakammaṃ, dhammapatirūpakena vaggakammaṃ, dhammapatirūpakena samaggakammaṃ, akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti. Tatra, bhikkhave, ye te bhikkhū evamāhaṃsu – ‘‘dhammapatirūpakena samaggakamma’’nti, ye ca te bhikkhū evamāhaṃsu – ‘‘akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti, ime tattha bhikkhū dhammavādino. Ime pañca vārā saṃkhittā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Appaṭinissagge ukkhepanīyakammavivādakathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "263. Tajjanīyakammapaṭippassaddhikathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "440"
      },
      ". Idha pana, bhikkhave, bhikkhu saṅghena tajjanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, tajjanīyassa kammassa paṭippassaddhiṃ yācati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, tajjanīyassa kammassa paṭippassaddhiṃ yācati. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – adhammena vaggā. Tatraṭṭho saṅgho vivadati – ‘‘adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena vaggakammaṃ, dhammapatirūpakena vaggakammaṃ, dhammapatirūpakena samaggakammaṃ, akataṃ ",
      " kammaṃ dukkaṭaṃ kammaṃ ",
      " puna kātabbaṃ kamma’’nti. Tatra, bhikkhave, ye te bhikkhū evamāhaṃsu – ‘‘adhammena vaggakamma’’nti, ye ca te bhikkhū evamāhaṃsu ",
      " – ‘‘akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti, ime tattha bhikkhū dhammavādino."
    ],
    "innerText": "440. Idha pana, bhikkhave, bhikkhu saṅghena tajjanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, tajjanīyassa kammassa paṭippassaddhiṃ yācati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, tajjanīyassa kammassa paṭippassaddhiṃ yācati. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – adhammena vaggā. Tatraṭṭho saṅgho vivadati – ‘‘adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena vaggakammaṃ, dhammapatirūpakena vaggakammaṃ, dhammapatirūpakena samaggakammaṃ, akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti. Tatra, bhikkhave, ye te bhikkhū evamāhaṃsu – ‘‘adhammena vaggakamma’’nti, ye ca te bhikkhū evamāhaṃsu – ‘‘akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti, ime tattha bhikkhū dhammavādino."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "441"
      },
      ". Idha pana, bhikkhave, bhikkhu saṅghena tajjanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, tajjanīyassa kammassa paṭippassaddhiṃ yācati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, tajjanīyassa kammassa paṭippassaddhiṃ yācati. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – adhammena samaggā. Tatraṭṭho saṅgho vivadati – ‘‘adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena vaggakammaṃ, dhammapatirūpakena vaggakammaṃ, dhammapatirūpakena samaggakammaṃ, akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti. Tatra, bhikkhave, ye te bhikkhū evamāhaṃsu – ‘‘adhammena samaggakamma’’nti, ye ca te bhikkhū evamāhaṃsu – ‘‘akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti, ime tattha bhikkhū dhammavādino."
    ],
    "innerText": "441. Idha pana, bhikkhave, bhikkhu saṅghena tajjanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, tajjanīyassa kammassa paṭippassaddhiṃ yācati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, tajjanīyassa kammassa paṭippassaddhiṃ yācati. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – adhammena samaggā. Tatraṭṭho saṅgho vivadati – ‘‘adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena vaggakammaṃ, dhammapatirūpakena vaggakammaṃ, dhammapatirūpakena samaggakammaṃ, akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti. Tatra, bhikkhave, ye te bhikkhū evamāhaṃsu – ‘‘adhammena samaggakamma’’nti, ye ca te bhikkhū evamāhaṃsu – ‘‘akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti, ime tattha bhikkhū dhammavādino."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "442"
      },
      ". Idha pana, bhikkhave, bhikkhu saṅghena tajjanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, tajjanīyassa kammassa paṭippassaddhiṃ yācati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso ",
      ", bhikkhu saṅghena tajjanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, tajjanīyassa kammassa paṭippassaddhiṃ yācati. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – dhammena vaggā. Tatraṭṭho saṅgho vivadati – ‘‘adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena vaggakammaṃ, dhammapatirūpakena vaggakammaṃ, dhammapatirūpakena samaggakammaṃ, akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti. Tatra, bhikkhave, ye te bhikkhū evamāhaṃsu – ‘‘dhammena vaggakamma’’nti ye ca te bhikkhū evamāhaṃsu – ‘‘akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti, ime tattha bhikkhū dhammavādino."
    ],
    "innerText": "442. Idha pana, bhikkhave, bhikkhu saṅghena tajjanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, tajjanīyassa kammassa paṭippassaddhiṃ yācati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso , bhikkhu saṅghena tajjanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, tajjanīyassa kammassa paṭippassaddhiṃ yācati. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – dhammena vaggā. Tatraṭṭho saṅgho vivadati – ‘‘adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena vaggakammaṃ, dhammapatirūpakena vaggakammaṃ, dhammapatirūpakena samaggakammaṃ, akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti. Tatra, bhikkhave, ye te bhikkhū evamāhaṃsu – ‘‘dhammena vaggakamma’’nti ye ca te bhikkhū evamāhaṃsu – ‘‘akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti, ime tattha bhikkhū dhammavādino."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "443"
      },
      ". Idha pana, bhikkhave, bhikkhu saṅghena tajjanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, tajjanīyassa kammassa paṭippassaddhiṃ yācati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, tajjanīyassa kammassa paṭippassaddhiṃ yācati. Handassa mayaṃ tajjanīyakammaṃ ",
      " paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – dhammapatirūpakena vaggā. Tatraṭṭho saṅgho vivadati – ‘‘adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena vaggakammaṃ, dhammapatirūpakena vaggakammaṃ, dhammapatirūpakena samaggakammaṃ, akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti. Tatra ",
      ", bhikkhave, ye te bhikkhū evamāhaṃsu – ‘‘dhammapatirūpakena vaggakamma’’nti, ye ca te bhikkhū evamāhaṃsu – ‘‘akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti, ime tattha bhikkhū dhammavādino."
    ],
    "innerText": "443. Idha pana, bhikkhave, bhikkhu saṅghena tajjanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, tajjanīyassa kammassa paṭippassaddhiṃ yācati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, tajjanīyassa kammassa paṭippassaddhiṃ yācati. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – dhammapatirūpakena vaggā. Tatraṭṭho saṅgho vivadati – ‘‘adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena vaggakammaṃ, dhammapatirūpakena vaggakammaṃ, dhammapatirūpakena samaggakammaṃ, akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti. Tatra , bhikkhave, ye te bhikkhū evamāhaṃsu – ‘‘dhammapatirūpakena vaggakamma’’nti, ye ca te bhikkhū evamāhaṃsu – ‘‘akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti, ime tattha bhikkhū dhammavādino."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "444"
      },
      ". Idha pana, bhikkhave, bhikkhu saṅghena tajjanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, tajjanīyassa kammassa paṭippassaddhiṃ yācati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, tajjanīyassa kammassa paṭippassaddhiṃ yācati. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – dhammapatirūpakena samaggā. Tatraṭṭho saṅgho vivadati – ‘‘adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena vaggakammaṃ, dhammapatirūpakena vaggakammaṃ, dhammapatirūpakena samaggakammaṃ, akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti. Tatra, bhikkhave, ye te bhikkhū evamāhaṃsu – ‘‘dhammapatirūpakena samaggakamma’’nti, ye ca te bhikkhū evamāhaṃsu – ‘‘akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti, ime tattha bhikkhū dhammavādino."
    ],
    "innerText": "444. Idha pana, bhikkhave, bhikkhu saṅghena tajjanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, tajjanīyassa kammassa paṭippassaddhiṃ yācati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena tajjanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, tajjanīyassa kammassa paṭippassaddhiṃ yācati. Handassa mayaṃ tajjanīyakammaṃ paṭippassambhemā’’ti. Te tassa tajjanīyakammaṃ paṭippassambhenti – dhammapatirūpakena samaggā. Tatraṭṭho saṅgho vivadati – ‘‘adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena vaggakammaṃ, dhammapatirūpakena vaggakammaṃ, dhammapatirūpakena samaggakammaṃ, akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti. Tatra, bhikkhave, ye te bhikkhū evamāhaṃsu – ‘‘dhammapatirūpakena samaggakamma’’nti, ye ca te bhikkhū evamāhaṃsu – ‘‘akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti, ime tattha bhikkhū dhammavādino."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tajjanīyakammapaṭippassaddhikathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "264. Niyassakammapaṭippassaddhikathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "445"
      },
      ". Idha pana, bhikkhave, bhikkhu saṅghena niyassakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, niyassassa kammassa paṭippassaddhiṃ yācati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena niyassakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati ",
      ", niyassassa kammassa paṭippassaddhiṃ yācati. Handassa mayaṃ niyassakammaṃ paṭippassambhemā’’ti. Te tassa niyassakammaṃ paṭippassambhenti – adhammena vaggā…pe… adhammena samaggā… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā. Tatraṭṭho saṅgho vivadati – ‘‘adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena vaggakammaṃ, dhammapatirūpakena vaggakammaṃ, dhammapatirūpakena samaggakammaṃ, akataṃ kammaṃ dukkaṭaṃ kammaṃ ",
      " puna kātabbaṃ kamma’’nti. Tatra, bhikkhave ",
      ", ye te bhikkhū evamāhaṃsu – ‘‘dhammapatirūpakena samaggakamma’’nti, ye ca te bhikkhū evamāhaṃsu – ‘‘akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti, ime tattha bhikkhū dhammavādino. Imepi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ime (sī. syā. evamuparipi)]"
      },
      " pañca vārā saṃkhittā."
    ],
    "innerText": "445. Idha pana, bhikkhave, bhikkhu saṅghena niyassakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, niyassassa kammassa paṭippassaddhiṃ yācati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena niyassakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati , niyassassa kammassa paṭippassaddhiṃ yācati. Handassa mayaṃ niyassakammaṃ paṭippassambhemā’’ti. Te tassa niyassakammaṃ paṭippassambhenti – adhammena vaggā…pe… adhammena samaggā… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā. Tatraṭṭho saṅgho vivadati – ‘‘adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena vaggakammaṃ, dhammapatirūpakena vaggakammaṃ, dhammapatirūpakena samaggakammaṃ, akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti. Tatra, bhikkhave , ye te bhikkhū evamāhaṃsu – ‘‘dhammapatirūpakena samaggakamma’’nti, ye ca te bhikkhū evamāhaṃsu – ‘‘akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti, ime tattha bhikkhū dhammavādino. Imepi [ime (sī. syā. evamuparipi)] pañca vārā saṃkhittā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Niyassakammapaṭippassaddhikathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "265. Pabbājanīyakammapaṭippassaddhikathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "446"
      },
      ". Idha pana, bhikkhave, bhikkhu saṅghena pabbājanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, pabbājanīyassa kammassa paṭippassaddhiṃ yācati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena pabbājanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, pabbājanīyassa kammassa paṭippassaddhiṃ yācati. Handassa mayaṃ pabbājanīyakammaṃ paṭippassambhemā’’ti. Te tassa pabbājanīyakammaṃ paṭippassambhenti – adhammena vaggā…pe… adhammena samaggā… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā. Tatraṭṭho saṅgho vivadati – ‘‘adhammena vaggakammaṃ, adhammena ",
      " samaggakammaṃ, dhammena vaggakammaṃ, dhammapatirūpakena vaggakammaṃ, dhammapatirūpakena samaggakammaṃ, akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti. Tatra, bhikkhave, ye te bhikkhū evamāhaṃsu – ‘‘dhammapatirūpakena samaggakamma’’nti, ye ca te bhikkhū evamāhaṃsu – ‘‘akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti, ime tattha bhikkhū dhammavādino. Imepi pañca vārā saṃkhittā."
    ],
    "innerText": "446. Idha pana, bhikkhave, bhikkhu saṅghena pabbājanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, pabbājanīyassa kammassa paṭippassaddhiṃ yācati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena pabbājanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, pabbājanīyassa kammassa paṭippassaddhiṃ yācati. Handassa mayaṃ pabbājanīyakammaṃ paṭippassambhemā’’ti. Te tassa pabbājanīyakammaṃ paṭippassambhenti – adhammena vaggā…pe… adhammena samaggā… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā. Tatraṭṭho saṅgho vivadati – ‘‘adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena vaggakammaṃ, dhammapatirūpakena vaggakammaṃ, dhammapatirūpakena samaggakammaṃ, akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti. Tatra, bhikkhave, ye te bhikkhū evamāhaṃsu – ‘‘dhammapatirūpakena samaggakamma’’nti, ye ca te bhikkhū evamāhaṃsu – ‘‘akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti, ime tattha bhikkhū dhammavādino. Imepi pañca vārā saṃkhittā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pabbājanīyakammapaṭippassaddhikathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "266. Paṭisāraṇīyakammapaṭippassaddhikathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "447"
      },
      ". Idha pana, bhikkhave, bhikkhu saṅghena paṭisāraṇīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, paṭisāraṇīyassa kammassa paṭippassaddhiṃ yācati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena paṭisāraṇīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, paṭisāraṇīyassa kammassa paṭippassaddhiṃ yācati. Handassa mayaṃ paṭisāraṇīyakammaṃ paṭippassambhemā’’ti. Te tassa paṭisāraṇīyakammaṃ paṭippassambhenti – adhammena vaggā…pe… adhammena samaggā… dhammena vaggā… dhammapatirūpakena ",
      " vaggā… dhammapatirūpakena samaggā. Tatraṭṭho saṅgho vivadati – ‘‘adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena vaggakammaṃ ",
      ", dhammapatirūpakena vaggakammaṃ, dhammapatirūpakena samaggakammaṃ, akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti. Tatra, bhikkhave, ye te bhikkhū evamāhaṃsu – ‘‘dhammapatirūpakena samaggakamma’’nti, ye ca te bhikkhū evamāhaṃsu – ‘‘akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti. Ime ",
      " tattha bhikkhū dhammavādino. Imepi pañca vārā saṃkhittā."
    ],
    "innerText": "447. Idha pana, bhikkhave, bhikkhu saṅghena paṭisāraṇīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, paṭisāraṇīyassa kammassa paṭippassaddhiṃ yācati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena paṭisāraṇīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, paṭisāraṇīyassa kammassa paṭippassaddhiṃ yācati. Handassa mayaṃ paṭisāraṇīyakammaṃ paṭippassambhemā’’ti. Te tassa paṭisāraṇīyakammaṃ paṭippassambhenti – adhammena vaggā…pe… adhammena samaggā… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā. Tatraṭṭho saṅgho vivadati – ‘‘adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena vaggakammaṃ , dhammapatirūpakena vaggakammaṃ, dhammapatirūpakena samaggakammaṃ, akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti. Tatra, bhikkhave, ye te bhikkhū evamāhaṃsu – ‘‘dhammapatirūpakena samaggakamma’’nti, ye ca te bhikkhū evamāhaṃsu – ‘‘akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti. Ime tattha bhikkhū dhammavādino. Imepi pañca vārā saṃkhittā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṭisāraṇīyakammapaṭippassaddhikathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "267. Adassane ukkhepanīyakammapaṭippassaddhikathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "448"
      },
      ". Idha pana, bhikkhave, bhikkhu saṅghena āpattiyā adassane ukkhepanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, āpattiyā adassane ukkhepanīyassa kammassa paṭippassaddhiṃ yācati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena āpattiyā adassane ukkhepanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, āpattiyā adassane ukkhepanīyassa kammassa paṭippassaddhiṃ yācati. Handassa mayaṃ āpattiyā adassane ukkhepanīyakammaṃ paṭippassambhemā’’ti. Te tassa āpattiyā adassane ukkhepanīyakammaṃ paṭippassambhenti – adhammena vaggā…pe… adhammena samaggā… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā. Tatraṭṭho saṅgho vivadati – ‘‘adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena vaggakammaṃ, dhammapatirūpakena vaggakammaṃ, dhammapatirūpakena samaggakammaṃ, akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti. Tatra, bhikkhave, ye te bhikkhū evamāhaṃsu – ‘‘dhammapatirūpakena samaggakamma’’nti, ye ca te bhikkhū evamāhaṃsu – ‘‘akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti, ime tattha bhikkhū dhammavādino. Imepi pañca vārā saṃkhittā."
    ],
    "innerText": "448. Idha pana, bhikkhave, bhikkhu saṅghena āpattiyā adassane ukkhepanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, āpattiyā adassane ukkhepanīyassa kammassa paṭippassaddhiṃ yācati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena āpattiyā adassane ukkhepanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, āpattiyā adassane ukkhepanīyassa kammassa paṭippassaddhiṃ yācati. Handassa mayaṃ āpattiyā adassane ukkhepanīyakammaṃ paṭippassambhemā’’ti. Te tassa āpattiyā adassane ukkhepanīyakammaṃ paṭippassambhenti – adhammena vaggā…pe… adhammena samaggā… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā. Tatraṭṭho saṅgho vivadati – ‘‘adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena vaggakammaṃ, dhammapatirūpakena vaggakammaṃ, dhammapatirūpakena samaggakammaṃ, akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti. Tatra, bhikkhave, ye te bhikkhū evamāhaṃsu – ‘‘dhammapatirūpakena samaggakamma’’nti, ye ca te bhikkhū evamāhaṃsu – ‘‘akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti, ime tattha bhikkhū dhammavādino. Imepi pañca vārā saṃkhittā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Adassane ukkhepanīyakammapaṭippassaddhikathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "268. Appaṭikamme ukkhepanīyakammapaṭippassaddhikathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "449"
      },
      ". Idha pana, bhikkhave, bhikkhu saṅghena āpattiyā appaṭikamme ukkhepanīyakammakato ",
      " sammā vattati, lomaṃ pāteti, netthāraṃ vattati, āpattiyā appaṭikamme ",
      " ukkhepanīyassa kammassa paṭippassaddhiṃ yācati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena āpattiyā appaṭikamme ukkhepanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, āpattiyā appaṭikamme ukkhepanīyassa kammassa paṭippassaddhiṃ yācati. Handassa mayaṃ āpattiyā appaṭikamme ukkhepanīyakammaṃ ",
      " paṭippassambhemā’’ti. Te tassa āpattiyā appaṭikamme ukkhepanīyakammaṃ paṭippassambhenti – adhammena vaggā…pe… adhammena samaggā… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā. Tatraṭṭho saṅgho vivadati – ‘‘adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena vaggakammaṃ, dhammapatirūpakena vaggakammaṃ, dhammapatirūpakena samaggakammaṃ, akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti. Tatra, bhikkhave, ye te bhikkhū evamāhaṃsu – ‘‘dhammapatirūpakena samaggakamma’’nti, ye ca te bhikkhū evamāhaṃsu – ‘‘akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti, ime tattha bhikkhū dhammavādino. Imepi pañca vārā saṃkhittā."
    ],
    "innerText": "449. Idha pana, bhikkhave, bhikkhu saṅghena āpattiyā appaṭikamme ukkhepanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, āpattiyā appaṭikamme ukkhepanīyassa kammassa paṭippassaddhiṃ yācati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena āpattiyā appaṭikamme ukkhepanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, āpattiyā appaṭikamme ukkhepanīyassa kammassa paṭippassaddhiṃ yācati. Handassa mayaṃ āpattiyā appaṭikamme ukkhepanīyakammaṃ paṭippassambhemā’’ti. Te tassa āpattiyā appaṭikamme ukkhepanīyakammaṃ paṭippassambhenti – adhammena vaggā…pe… adhammena samaggā… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā. Tatraṭṭho saṅgho vivadati – ‘‘adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena vaggakammaṃ, dhammapatirūpakena vaggakammaṃ, dhammapatirūpakena samaggakammaṃ, akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti. Tatra, bhikkhave, ye te bhikkhū evamāhaṃsu – ‘‘dhammapatirūpakena samaggakamma’’nti, ye ca te bhikkhū evamāhaṃsu – ‘‘akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti, ime tattha bhikkhū dhammavādino. Imepi pañca vārā saṃkhittā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Appaṭikamme ukkhepanīyakammapaṭippassaddhikathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "269. Appaṭinissagge ukkhepanīyakammapaṭippassaddhikathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "450"
      },
      ". Idha pana, bhikkhave, bhikkhu saṅghena pāpikāya diṭṭhiyā appaṭinissagge ukkhepanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, pāpikāya diṭṭhiyā appaṭinissagge ukkhepanīyassa kammassa paṭippassaddhiṃ yācati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena pāpikāya diṭṭhiyā appaṭinissagge ukkhepanīyakammakato ",
      " sammā vattati, lomaṃ pāteti, netthāraṃ vattati, pāpikāya diṭṭhiyā appaṭinissagge ukkhepanīyassa kammassa paṭippassaddhiṃ yācati. Handassa mayaṃ pāpikāya diṭṭhiyā appaṭinissagge ukkhepanīyakammaṃ paṭippassambhemā’’ti. Te tassa pāpikāya diṭṭhiyā appaṭinissagge ukkhepanīyakammaṃ paṭippassambhenti – adhammena vaggā…pe… adhammena samaggā… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā. Tatraṭṭho saṅgho vivadati – ‘‘adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena vaggakammaṃ, dhammapatirūpakena vaggakammaṃ, dhammapatirūpakena samaggakammaṃ, akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti. Tatra, bhikkhave, ye te bhikkhū evamāhaṃsu – ‘‘dhammapatirūpakena samaggakamma’’nti, ye ",
      " ca te bhikkhū evamāhaṃsu – ‘‘akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti, ime tattha bhikkhū dhammavādino. Imepi pañca vārā saṃkhittā."
    ],
    "innerText": "450. Idha pana, bhikkhave, bhikkhu saṅghena pāpikāya diṭṭhiyā appaṭinissagge ukkhepanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, pāpikāya diṭṭhiyā appaṭinissagge ukkhepanīyassa kammassa paṭippassaddhiṃ yācati. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, āvuso, bhikkhu saṅghena pāpikāya diṭṭhiyā appaṭinissagge ukkhepanīyakammakato sammā vattati, lomaṃ pāteti, netthāraṃ vattati, pāpikāya diṭṭhiyā appaṭinissagge ukkhepanīyassa kammassa paṭippassaddhiṃ yācati. Handassa mayaṃ pāpikāya diṭṭhiyā appaṭinissagge ukkhepanīyakammaṃ paṭippassambhemā’’ti. Te tassa pāpikāya diṭṭhiyā appaṭinissagge ukkhepanīyakammaṃ paṭippassambhenti – adhammena vaggā…pe… adhammena samaggā… dhammena vaggā… dhammapatirūpakena vaggā… dhammapatirūpakena samaggā. Tatraṭṭho saṅgho vivadati – ‘‘adhammena vaggakammaṃ, adhammena samaggakammaṃ, dhammena vaggakammaṃ, dhammapatirūpakena vaggakammaṃ, dhammapatirūpakena samaggakammaṃ, akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti. Tatra, bhikkhave, ye te bhikkhū evamāhaṃsu – ‘‘dhammapatirūpakena samaggakamma’’nti, ye ca te bhikkhū evamāhaṃsu – ‘‘akataṃ kammaṃ dukkaṭaṃ kammaṃ puna kātabbaṃ kamma’’nti, ime tattha bhikkhū dhammavādino. Imepi pañca vārā saṃkhittā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Appaṭinissagge ukkhepanīyakammapaṭippassaddhikathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Campeyyakkhandhako navamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "270. Tassuddānaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Campāyaṃ ",
      " bhagavā āsi, vatthu vāsabhagāmake;"
    ],
    "innerText": "Campāyaṃ bhagavā āsi, vatthu vāsabhagāmake;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Āgantukānamussukkaṃ, akāsi icchitabbake ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[icchitabbako (ka.)]"
      },
      "."
    ],
    "innerText": "Āgantukānamussukkaṃ, akāsi icchitabbake [icchitabbako (ka.)]."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Pakataññunoti ñatvā, ussukkaṃ na karī tadā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Ukkhitto ",
      " na karotīti, sāgamā jinasantike."
    ],
    "innerText": "Ukkhitto na karotīti, sāgamā jinasantike."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Adhammena ",
      " vaggakammaṃ, samaggaṃ adhammena ca;"
    ],
    "innerText": "Adhammena vaggakammaṃ, samaggaṃ adhammena ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dhammena vaggakammañca, patirūpakena vaggikaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Patirūpakena samaggaṃ, eko ukkhipatekakaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Eko ca dve sambahule, saṅghaṃ ukkhipatekako."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Duvepi sambahulāpi, saṅgho saṅghañca ukkhipi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sabbaññupavaro sutvā, adhammanti paṭikkhipi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Ñattivipannaṃ yaṃ kammaṃ, sampannaṃ anusāvanaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Anussāvanavipannaṃ, sampannaṃ ñattiyā ca yaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Ubhayena vipannañca, aññatra dhammameva ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vinayā satthu paṭikuṭṭhaṃ, kuppaṃ aṭṭhānārahikaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Adhammavaggaṃ ",
      " samaggaṃ, dhamma patirūpāni ye duve;"
    ],
    "innerText": "Adhammavaggaṃ samaggaṃ, dhamma patirūpāni ye duve;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dhammeneva ca sāmaggiṃ, anuññāsi tathāgato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Catuvaggo pañcavaggo, dasavaggo ca vīsati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Parovīsativaggo ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[atirekavīsativaggo (syā.)]"
      },
      ", saṅgho pañcavidho tathā."
    ],
    "innerText": "Parovīsativaggo ca [atirekavīsativaggo (syā.)], saṅgho pañcavidho tathā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Ṭhapetvā upasampadaṃ, yañca kammaṃ pavāraṇaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Abbhānakammena saha, catuvaggehi kammiko."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Duve kamme ṭhapetvāna, majjhadesūpasampadaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Abbhānaṃ pañcavaggiko, sabbakammesu kammiko."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Abbhānekaṃ ṭhapetvāna, ye bhikkhū dasavaggikā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Sabbakammakaro ",
      " saṅgho, vīso sabbattha kammiko."
    ],
    "innerText": "Sabbakammakaro saṅgho, vīso sabbattha kammiko."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Bhikkhunī ",
      " sikkhamānā, ca sāmaṇero sāmaṇerī;"
    ],
    "innerText": "Bhikkhunī sikkhamānā, ca sāmaṇero sāmaṇerī;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Paccakkhātantimavatthū, ukkhittāpattidassane."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Appaṭikamme diṭṭhiyā, paṇḍako theyyasaṃvāsakaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Titthiyā tiracchānagataṃ, mātu pitu ca ghātakaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Arahaṃ bhikkhunīdūsi, bhedakaṃ lohituppādaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Byañjanaṃ nānāsaṃvāsaṃ, nānāsīmāya iddhiyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Yassa saṅgho kare kammaṃ, hontete catuvīsati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sambuddhena paṭikkhittā, na hete gaṇapūrakā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Pārivāsikacatuttho, parivāsaṃ dadeyya vā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Mūlā mānattamabbheyya, akammaṃ na ca karaṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Mūlā ",
      " arahamānattā, abbhānārahameva ca;"
    ],
    "innerText": "Mūlā arahamānattā, abbhānārahameva ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Na kammakārakā pañca, sambuddhena pakāsitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Bhikkhunī sikkhamānā ca, sāmaṇero sāmaṇerikā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Paccakkhantimaummattā, khittāvedanadassane."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Appaṭikamme diṭṭhiyā, paṇḍakāpi ca byañjanā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ito paraṃ syāmamūle diyaḍḍhagāthāhi abhabbapuggalā samattaṃ dassitā]"
      },
      ";"
    ],
    "innerText": "Appaṭikamme diṭṭhiyā, paṇḍakāpi ca byañjanā [ito paraṃ syāmamūle diyaḍḍhagāthāhi abhabbapuggalā samattaṃ dassitā];"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nānāsaṃvāsakā sīmā, vehāsaṃ yassa kamma ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Aṭṭhārasannametesaṃ, ",
      " paṭikkosaṃ na ruhati;"
    ],
    "innerText": "Aṭṭhārasannametesaṃ, paṭikkosaṃ na ruhati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhikkhussa pakatattassa, ruhati paṭikkosanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Suddhassa dunnisārito, bālo hi sunissārito;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Paṇḍako theyyasaṃvāso, pakkanto tiracchānagato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Mātu pitu arahanta, dūsako saṅghabhedako;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Lohituppādako ceva, ubhatobyañjano ca yo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Ekādasannaṃ etesaṃ, osāraṇaṃ na yujjati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Hatthapādaṃ tadubhayaṃ, kaṇṇanāsaṃ tadūbhayaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Aṅguli aḷakaṇḍaraṃ, phaṇaṃ khujjo ca vāmano;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Gaṇḍī lakkhaṇakasā, ca likhitako ca sīpadī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Pāpā ",
      " parisakāṇo ca, kuṇī khañjo hatopi ca;"
    ],
    "innerText": "Pāpā parisakāṇo ca, kuṇī khañjo hatopi ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Iriyāpathadubbalo, andho mūgo ca badhiro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Andhamūgandhabadhiro mūgabadhirameva ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Andhamūgabadhiro ca, dvattiṃsete anūnakā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Tesaṃ ",
      " osāraṇaṃ hoti, sambuddhena pakāsitaṃ;"
    ],
    "innerText": "Tesaṃ osāraṇaṃ hoti, sambuddhena pakāsitaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Daṭṭhabbā paṭikātabbā, nissajjetā na vijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Tassa ukkhepanā kammā, satta honti adhammikā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Āpannaṃ anuvattantaṃ, satta tepi adhammikā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Āpannaṃ nānuvattantaṃ, satta kammā sudhammikā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sammukhā paṭipucchā ca, paṭiññāya ca kāraṇā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Sati ",
      " amūḷhapāpikā, tajjanīniyassena ca;"
    ],
    "innerText": "Sati amūḷhapāpikā, tajjanīniyassena ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pabbājanīya paṭisāro, ukkhepaparivāsa ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Mūlā mānattaabbhānā, tatheva upasampadā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Aññaṃ kareyya aññassa, soḷasete adhammikā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Taṃ taṃ kareyya taṃ tassa, soḷasete sudhammikā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Paccāropeyya aññaññaṃ, soḷasete adhammikā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Dve dve tammūlakaṃ tassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[dve dve mūlā katā kassa (syā.), dodotamūlakantassa (ka.)]"
      },
      ", tepi soḷasa dhammikā;"
    ],
    "innerText": "Dve dve tammūlakaṃ tassa [dve dve mūlā katā kassa (syā.), dodotamūlakantassa (ka.)], tepi soḷasa dhammikā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ekekamūlakaṃ cakkaṃ, ‘‘adhamma’’nti jinobravi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Akāsi tajjanīyaṃ kammaṃ, saṅgho bhaṇḍanakārako;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Adhammena vaggakammaṃ, aññaṃ āvāsaṃ gacchi so."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Tatthādhammena samaggā, tassa tajjanīyaṃ karuṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Aññattha vaggādhammena, tassa tajjanīyaṃ karuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Patirūpena vaggāpi, samaggāpi tathā karuṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Adhammena samaggā ca, dhammena vaggameva ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Patirūpakena vaggā ca, samaggā ca ime padā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ekekamūlakaṃ katvā, cakkaṃ bandhe vicakkhaṇo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Bālā ",
      " byattassa niyassaṃ, pabbāje kuladūsakaṃ;"
    ],
    "innerText": "Bālā byattassa niyassaṃ, pabbāje kuladūsakaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Paṭisāraṇīyaṃ kammaṃ, kare akkosakassa ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Adassanāppaṭikamme ",
      ", yo ca diṭṭhiṃ na nissajje;"
    ],
    "innerText": "Adassanāppaṭikamme , yo ca diṭṭhiṃ na nissajje;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tesaṃ ukkhepanīyakammaṃ, satthavāhena bhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Upari ",
      " nayakammānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[upavinayakammānaṃ (syā.), ukkhepanīyakammānaṃ (ka.)]"
      },
      " pañño tajjanīyaṃ naye;"
    ],
    "innerText": "Upari nayakammānaṃ [upavinayakammānaṃ (syā.), ukkhepanīyakammānaṃ (ka.)] pañño tajjanīyaṃ naye;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Tesaṃyeva anulomaṃ, sammā vattati yācite ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yācati (syā.), yācito (sī.)]"
      },
      "."
    ],
    "innerText": "Tesaṃyeva anulomaṃ, sammā vattati yācite [yācati (syā.), yācito (sī.)]."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Passaddhi tesaṃ kammānaṃ, heṭṭhā kammanayena ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tasmiṃ tasmiṃ tu kammesu, tatraṭṭho ca vivadati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Akataṃ dukkaṭañceva, punakātabbakanti ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kamme passaddhiyā cāpi, te bhikkhū dhammavādino."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Vipattibyādhite disvā, kammappatte mahāmuni;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Paṭippassaddhimakkhāsi, sallakattova osadhanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Imamhi khandhake vatthūni chattiṃsāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Campeyyakkhandhako niṭṭhito."
  }
]