[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "3. Vassūpanāyikakkhandhako"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "107. Vassūpanāyikānujānanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "184"
      },
      ". Tena ",
      " samayena buddho bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Tena kho pana samayena bhagavatā bhikkhūnaṃ vassāvāso apaññatto hoti. Teidha bhikkhū hemantampi gimhampi vassampi cārikaṃ caranti. Manussā ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma samaṇā sakyaputtiyā hemantampi gimhampi vassampi cārikaṃ carissanti, haritāni tiṇāni sammaddantā, ekindriyaṃ jīvaṃ viheṭhentā, bahū khuddake pāṇe saṅghātaṃ āpādentā. Ime hi nāma aññatitthiyā durakkhātadhammā vassāvāsaṃ allīyissanti saṅkasāyissanti. Ime hi nāma sakuntakā rukkhaggesu kulāvakāni karitvā vassāvāsaṃ allīyissanti saṅkasāyissanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[saṅkāsayissanti (sī. syā.)]"
      },
      ". Ime pana samaṇā sakyaputtiyā hemantampi gimhampi vassampi cārikaṃ caranti, haritāni tiṇāni sammaddantā, ekindriyaṃ jīvaṃ viheṭhentā, bahū khuddake pāṇe saṅghātaṃ āpādentā’’ti. Assosuṃ kho bhikkhū tesaṃ manussānaṃ ujjhāyantānaṃ khiyyantānaṃ vipācentānaṃ. Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘anujānāmi, bhikkhave, vassaṃ upagantu’’nti. Atha kho bhikkhūnaṃ etadahosi – ‘‘kadā nu kho vassaṃ upagantabba’’nti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, vassāne vassaṃ upagantunti."
    ],
    "innerText": "184. Tena samayena buddho bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Tena kho pana samayena bhagavatā bhikkhūnaṃ vassāvāso apaññatto hoti. Teidha bhikkhū hemantampi gimhampi vassampi cārikaṃ caranti. Manussā ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma samaṇā sakyaputtiyā hemantampi gimhampi vassampi cārikaṃ carissanti, haritāni tiṇāni sammaddantā, ekindriyaṃ jīvaṃ viheṭhentā, bahū khuddake pāṇe saṅghātaṃ āpādentā. Ime hi nāma aññatitthiyā durakkhātadhammā vassāvāsaṃ allīyissanti saṅkasāyissanti. Ime hi nāma sakuntakā rukkhaggesu kulāvakāni karitvā vassāvāsaṃ allīyissanti saṅkasāyissanti [saṅkāsayissanti (sī. syā.)]. Ime pana samaṇā sakyaputtiyā hemantampi gimhampi vassampi cārikaṃ caranti, haritāni tiṇāni sammaddantā, ekindriyaṃ jīvaṃ viheṭhentā, bahū khuddake pāṇe saṅghātaṃ āpādentā’’ti. Assosuṃ kho bhikkhū tesaṃ manussānaṃ ujjhāyantānaṃ khiyyantānaṃ vipācentānaṃ. Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘anujānāmi, bhikkhave, vassaṃ upagantu’’nti. Atha kho bhikkhūnaṃ etadahosi – ‘‘kadā nu kho vassaṃ upagantabba’’nti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, vassāne vassaṃ upagantunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "children": [
      "Atha ",
      " kho bhikkhūnaṃ etadahosi – ‘‘kati nu kho vassūpanāyikā’’ti? Bhagavato etamatthaṃ"
    ],
    "innerText": "Atha kho bhikkhūnaṃ etadahosi – ‘‘kati nu kho vassūpanāyikā’’ti? Bhagavato etamatthaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ārocesuṃ. Dvemā, bhikkhave, vassūpanāyikā – purimikā, pacchimikā. Aparajjugatāya āsāḷhiyā purimikā upagantabbā, māsagatāya āsāḷhiyā pacchimikā upagantabbā – imā kho, bhikkhave, dve vassūpanāyikāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vassūpanāyikānujānanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "108. Vassāne cārikāpaṭikkhepādi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "185"
      },
      ". Tena ",
      " kho pana samayena chabbaggiyā bhikkhū vassaṃ upagantvā antarāvassaṃ cārikaṃ caranti. Manussā tatheva ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi ",
      " nāma samaṇā sakyaputtiyā hemantampi gimhampi vassampi cārikaṃ carissanti, haritāni tiṇāni sammaddantā, ekindriyaṃ jīvaṃ viheṭhentā, bahū khuddake pāṇe saṅghātaṃ āpādentā. Ime hi nāma aññatitthiyā durakkhātadhammā vassāvāsaṃ allīyissanti saṅkasāyissanti. Ime hi nāma sakuntakā rukkhaggesu kulāvakāni karitvā vassāvāsaṃ allīyissanti saṅkasāyissanti. Ime pana samaṇā sakyaputtiyā hemantampi gimhampi vassampi cārikaṃ caranti, haritāni tiṇāni sammaddantā, ekindriyaṃ jīvaṃ viheṭhentā, bahū khuddake pāṇe saṅghātaṃ āpādentā’’ti. Assosuṃ kho bhikkhū tesaṃ manussānaṃ ujjhāyantānaṃ khiyyantānaṃ vipācentānaṃ. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma chabbaggiyā bhikkhū ",
      " vassaṃ upagantvā antarāvassaṃ cārikaṃ carissantī’’ti? Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘na, bhikkhave, vassaṃ upagantvā purimaṃ vā temāsaṃ pacchimaṃ vā temāsaṃ avasitvā cārikā pakkamitabbā. Yo pakkameyya, āpatti dukkaṭassā’’ti."
    ],
    "innerText": "185. Tena kho pana samayena chabbaggiyā bhikkhū vassaṃ upagantvā antarāvassaṃ cārikaṃ caranti. Manussā tatheva ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma samaṇā sakyaputtiyā hemantampi gimhampi vassampi cārikaṃ carissanti, haritāni tiṇāni sammaddantā, ekindriyaṃ jīvaṃ viheṭhentā, bahū khuddake pāṇe saṅghātaṃ āpādentā. Ime hi nāma aññatitthiyā durakkhātadhammā vassāvāsaṃ allīyissanti saṅkasāyissanti. Ime hi nāma sakuntakā rukkhaggesu kulāvakāni karitvā vassāvāsaṃ allīyissanti saṅkasāyissanti. Ime pana samaṇā sakyaputtiyā hemantampi gimhampi vassampi cārikaṃ caranti, haritāni tiṇāni sammaddantā, ekindriyaṃ jīvaṃ viheṭhentā, bahū khuddake pāṇe saṅghātaṃ āpādentā’’ti. Assosuṃ kho bhikkhū tesaṃ manussānaṃ ujjhāyantānaṃ khiyyantānaṃ vipācentānaṃ. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma chabbaggiyā bhikkhū vassaṃ upagantvā antarāvassaṃ cārikaṃ carissantī’’ti? Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘na, bhikkhave, vassaṃ upagantvā purimaṃ vā temāsaṃ pacchimaṃ vā temāsaṃ avasitvā cārikā pakkamitabbā. Yo pakkameyya, āpatti dukkaṭassā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "186"
      },
      ". Tena kho pana samayena chabbaggiyā bhikkhū na icchanti vassaṃ upagantuṃ. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, vassaṃ na upagantabbaṃ. Yo na upagaccheyya, āpatti dukkaṭassāti."
    ],
    "innerText": "186. Tena kho pana samayena chabbaggiyā bhikkhū na icchanti vassaṃ upagantuṃ. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, vassaṃ na upagantabbaṃ. Yo na upagaccheyya, āpatti dukkaṭassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena kho pana samayena chabbaggiyā bhikkhū tadahu vassūpanāyikāya vassaṃ anupagantukāmā sañcicca āvāsaṃ atikkamanti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, tadahu vassūpanāyikāya vassaṃ anupagantukāmena sañcicca āvāso atikkamitabbo. Yo atikkameyya, āpatti dukkaṭassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tena kho pana samayena rājā māgadho seniyo bimbisāro vassaṃ ukkaḍḍhitukāmo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhikkhūnaṃ santike dūtaṃ pāhesi – yadi panāyyā āgame juṇhe vassaṃ upagaccheyyunti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, rājūnaṃ anuvattitunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vassāne cārikāpaṭikkhepādi niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "109. Sattāhakaraṇīyānujānanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "187"
      },
      ". Atha ",
      " kho bhagavā rājagahe yathābhirantaṃ viharitvā yena sāvatthi tena cārikaṃ pakkāmi. Anupubbena cārikaṃ caramāno yena sāvatthi ",
      " tadavasari. Tatra sudaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena kosalesu janapade udenena upāsakena saṅghaṃ uddissa vihāro kārāpito hoti. So bhikkhūnaṃ santike dūtaṃ pāhesi – ‘‘āgacchantu bhadantā, icchāmi dānañca dātuṃ, dhammañca sotuṃ, bhikkhū ca passitu’’nti. Bhikkhū evamāhaṃsu – ‘‘bhagavatā, āvuso, paññattaṃ ‘na vassaṃ upagantvā purimaṃ vā temāsaṃ pacchimaṃ vā temāsaṃ avasitvā cārikā pakkamitabbā’ti. Āgametu udeno upāsako, yāva bhikkhū vassaṃ vasanti. Vassaṃvuṭṭhā āgamissanti. Sace panassa accāyikaṃ karaṇīyaṃ, tattheva āvāsikānaṃ bhikkhūnaṃ santike vihāraṃ patiṭṭhāpetū’’ti. Udeno upāsako ujjhāyati khiyyati vipāceti – ‘‘kathañhi nāma bhadantā mayā pahite na āgacchissanti. Ahañhi dāyako kārako saṅghupaṭṭhāko’’ti. Assosuṃ kho bhikkhū udenassa upāsakassa ujjhāyantassa khiyyantassa vipācentassa. Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘anujānāmi, bhikkhave, sattannaṃ sattāhakaraṇīyena pahite gantuṃ, na tveva appahite. Bhikkhussa, bhikkhuniyā, sikkhamānāya, sāmaṇerassa, sāmaṇeriyā, upāsakassa, upāsikāya – anujānāmi, bhikkhave, imesaṃ sattannaṃ sattāhakaraṇīyena pahite gantuṃ, na tveva appahite. Sattāhaṃ sannivatto kātabbo’’."
    ],
    "innerText": "187. Atha kho bhagavā rājagahe yathābhirantaṃ viharitvā yena sāvatthi tena cārikaṃ pakkāmi. Anupubbena cārikaṃ caramāno yena sāvatthi tadavasari. Tatra sudaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena kosalesu janapade udenena upāsakena saṅghaṃ uddissa vihāro kārāpito hoti. So bhikkhūnaṃ santike dūtaṃ pāhesi – ‘‘āgacchantu bhadantā, icchāmi dānañca dātuṃ, dhammañca sotuṃ, bhikkhū ca passitu’’nti. Bhikkhū evamāhaṃsu – ‘‘bhagavatā, āvuso, paññattaṃ ‘na vassaṃ upagantvā purimaṃ vā temāsaṃ pacchimaṃ vā temāsaṃ avasitvā cārikā pakkamitabbā’ti. Āgametu udeno upāsako, yāva bhikkhū vassaṃ vasanti. Vassaṃvuṭṭhā āgamissanti. Sace panassa accāyikaṃ karaṇīyaṃ, tattheva āvāsikānaṃ bhikkhūnaṃ santike vihāraṃ patiṭṭhāpetū’’ti. Udeno upāsako ujjhāyati khiyyati vipāceti – ‘‘kathañhi nāma bhadantā mayā pahite na āgacchissanti. Ahañhi dāyako kārako saṅghupaṭṭhāko’’ti. Assosuṃ kho bhikkhū udenassa upāsakassa ujjhāyantassa khiyyantassa vipācentassa. Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘anujānāmi, bhikkhave, sattannaṃ sattāhakaraṇīyena pahite gantuṃ, na tveva appahite. Bhikkhussa, bhikkhuniyā, sikkhamānāya, sāmaṇerassa, sāmaṇeriyā, upāsakassa, upāsikāya – anujānāmi, bhikkhave, imesaṃ sattannaṃ sattāhakaraṇīyena pahite gantuṃ, na tveva appahite. Sattāhaṃ sannivatto kātabbo’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "188"
      },
      ". Idha pana, bhikkhave, upāsakena ",
      " saṅghaṃ uddissa vihāro kārāpito hoti. So ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘āgacchantu bhadantā, icchāmi dānañca dātuṃ, dhammañca sotuṃ, bhikkhū ca passitu’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, pahite, na tveva appahite. Sattāhaṃ sannivatto kātabbo."
    ],
    "innerText": "188. Idha pana, bhikkhave, upāsakena saṅghaṃ uddissa vihāro kārāpito hoti. So ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘āgacchantu bhadantā, icchāmi dānañca dātuṃ, dhammañca sotuṃ, bhikkhū ca passitu’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, pahite, na tveva appahite. Sattāhaṃ sannivatto kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, upāsakena saṅghaṃ uddissa aḍḍhayogo kārāpito hoti…pe… pāsādo kārāpito hoti… hammiyaṃ kārāpitaṃ hoti… guhā kārāpitā hoti… pariveṇaṃ kārāpitaṃ hoti… koṭṭhako kārāpito hoti… upaṭṭhānasālā kārāpitā hoti… aggisālā kārāpitā hoti… kappiyakuṭi kārāpitā hoti… vaccakuṭi kārāpitā hoti… caṅkamo kārāpito hoti ",
      "… caṅkamanasālā kārāpitā hoti… udapāno kārāpito hoti ",
      " … udapānasālā kārāpitā hoti… jantāgharaṃ kārāpitaṃ ",
      " hoti… jantāgharasālā kārāpitā hoti… pokkharaṇī kārāpitā hoti… maṇḍapo kārāpito hoti… ārāmo kārāpito hoti… ārāmavatthu kārāpitaṃ hoti. So ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘āgacchantu bhadantā, icchāmi dānañca dātuṃ, dhammañca sotuṃ, bhikkhū ca passitu’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, pahite, na tveva appahite. Sattāhaṃ sannivatto kātabbo."
    ],
    "innerText": "Idha pana, bhikkhave, upāsakena saṅghaṃ uddissa aḍḍhayogo kārāpito hoti…pe… pāsādo kārāpito hoti… hammiyaṃ kārāpitaṃ hoti… guhā kārāpitā hoti… pariveṇaṃ kārāpitaṃ hoti… koṭṭhako kārāpito hoti… upaṭṭhānasālā kārāpitā hoti… aggisālā kārāpitā hoti… kappiyakuṭi kārāpitā hoti… vaccakuṭi kārāpitā hoti… caṅkamo kārāpito hoti … caṅkamanasālā kārāpitā hoti… udapāno kārāpito hoti … udapānasālā kārāpitā hoti… jantāgharaṃ kārāpitaṃ hoti… jantāgharasālā kārāpitā hoti… pokkharaṇī kārāpitā hoti… maṇḍapo kārāpito hoti… ārāmo kārāpito hoti… ārāmavatthu kārāpitaṃ hoti. So ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘āgacchantu bhadantā, icchāmi dānañca dātuṃ, dhammañca sotuṃ, bhikkhū ca passitu’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, pahite, na tveva appahite. Sattāhaṃ sannivatto kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, upāsakena sambahule bhikkhū uddissa…pe… ekaṃ bhikkhuṃ uddissa vihāro kārāpito hoti… aḍḍhayogo kārāpito hoti… pāsādo kārāpito hoti ",
      "… hammiyaṃ kārāpitaṃ hoti… guhā kārāpitā hoti… pariveṇaṃ kārāpitaṃ hoti… koṭṭhako kārāpito hoti… upaṭṭhānasālā kārāpitā hoti… aggisālā kārāpitā hoti… kappiyakuṭi kārāpitā hoti… vaccakuṭi kārāpitā hoti… caṅkamo kārāpito hoti… caṅkamanasālā kārāpitā hoti… udapāno kārāpito hoti… udapānasālā kārāpitā hoti… jantāgharaṃ kārāpitaṃ hoti… jantāgharasālā kārāpitā hoti… pokkharaṇī kārāpitā hoti… maṇḍapo kārāpito hoti… ārāmo kārāpito hoti… ārāmavatthu kārāpitaṃ hoti. So ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘āgacchantu bhadantā, icchāmi dānañca dātuṃ, dhammañca sotuṃ, bhikkhū ca passitu’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, pahite, na tveva appahite. Sattāhaṃ sannivatto kātabbo."
    ],
    "innerText": "Idha pana, bhikkhave, upāsakena sambahule bhikkhū uddissa…pe… ekaṃ bhikkhuṃ uddissa vihāro kārāpito hoti… aḍḍhayogo kārāpito hoti… pāsādo kārāpito hoti … hammiyaṃ kārāpitaṃ hoti… guhā kārāpitā hoti… pariveṇaṃ kārāpitaṃ hoti… koṭṭhako kārāpito hoti… upaṭṭhānasālā kārāpitā hoti… aggisālā kārāpitā hoti… kappiyakuṭi kārāpitā hoti… vaccakuṭi kārāpitā hoti… caṅkamo kārāpito hoti… caṅkamanasālā kārāpitā hoti… udapāno kārāpito hoti… udapānasālā kārāpitā hoti… jantāgharaṃ kārāpitaṃ hoti… jantāgharasālā kārāpitā hoti… pokkharaṇī kārāpitā hoti… maṇḍapo kārāpito hoti… ārāmo kārāpito hoti… ārāmavatthu kārāpitaṃ hoti. So ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘āgacchantu bhadantā, icchāmi dānañca dātuṃ, dhammañca sotuṃ, bhikkhū ca passitu’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, pahite, na tveva appahite. Sattāhaṃ sannivatto kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, upāsakena bhikkhunisaṅghaṃ uddissa…pe… sambahulā bhikkhuniyo uddissa…pe… ekaṃ bhikkhuniṃ uddissa…pe… sambahulā sikkhamānāyo uddissa…pe… ekaṃ sikkhamānaṃ uddissa…pe… sambahule sāmaṇere uddissa…pe… ekaṃ sāmaṇeraṃ uddissa…pe… sambahulā sāmaṇeriyo uddissa…pe… ekaṃ sāmaṇeriṃ uddissa vihāro kārāpito hoti…pe… aḍḍhayogo kārāpito hoti… pāsādo kārāpito hoti… hammiyaṃ ",
      " kārāpitaṃ hoti… guhā kārāpitā hoti… pariveṇaṃ kārāpitaṃ hoti… koṭṭhako kārāpito hoti… upaṭṭhānasālā kārāpitā hoti… aggisālā kārāpitā hoti ",
      "… kappiyakuṭi kārāpitā hoti… caṅkamo kārāpito hoti… caṅkamanasālā kārāpitā hoti… udapāno kārāpito hoti… udapānasālā kārāpitā hoti… pokkharaṇī kārāpitā hoti… maṇḍapo kārāpito hoti… ārāmo kārāpito hoti… ārāmavatthu kārāpitaṃ hoti. So ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘āgacchantu bhadantā, icchāmi dānañca dātuṃ ",
      ", dhammañca sotuṃ, bhikkhū ca passitu’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, pahite, na tveva appahite. Sattāhaṃ sannivatto kātabbo."
    ],
    "innerText": "Idha pana, bhikkhave, upāsakena bhikkhunisaṅghaṃ uddissa…pe… sambahulā bhikkhuniyo uddissa…pe… ekaṃ bhikkhuniṃ uddissa…pe… sambahulā sikkhamānāyo uddissa…pe… ekaṃ sikkhamānaṃ uddissa…pe… sambahule sāmaṇere uddissa…pe… ekaṃ sāmaṇeraṃ uddissa…pe… sambahulā sāmaṇeriyo uddissa…pe… ekaṃ sāmaṇeriṃ uddissa vihāro kārāpito hoti…pe… aḍḍhayogo kārāpito hoti… pāsādo kārāpito hoti… hammiyaṃ kārāpitaṃ hoti… guhā kārāpitā hoti… pariveṇaṃ kārāpitaṃ hoti… koṭṭhako kārāpito hoti… upaṭṭhānasālā kārāpitā hoti… aggisālā kārāpitā hoti … kappiyakuṭi kārāpitā hoti… caṅkamo kārāpito hoti… caṅkamanasālā kārāpitā hoti… udapāno kārāpito hoti… udapānasālā kārāpitā hoti… pokkharaṇī kārāpitā hoti… maṇḍapo kārāpito hoti… ārāmo kārāpito hoti… ārāmavatthu kārāpitaṃ hoti. So ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘āgacchantu bhadantā, icchāmi dānañca dātuṃ , dhammañca sotuṃ, bhikkhū ca passitu’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, pahite, na tveva appahite. Sattāhaṃ sannivatto kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "189"
      },
      ". Idha pana, bhikkhave, upāsakena attano atthāya nivesanaṃ kārāpitaṃ hoti…pe… sayanigharaṃ kārāpitaṃ hoti… udosito kārāpito hoti… aṭṭo kārāpito hoti… māḷo kārāpito hoti… āpaṇo kārāpito hoti… āpaṇasālā kārāpitā hoti… pāsādo kārāpito hoti… hammiyaṃ kārāpitaṃ hoti… guhā kārāpitā hoti… pariveṇaṃ kārāpitaṃ hoti… koṭṭhako kārāpito hoti… upaṭṭhānasālā kārāpitā hoti… aggisālā kārāpitā hoti… rasavatī kārāpitā hoti… caṅkamo kārāpito hoti… caṅkamanasālā kārāpitā hoti… udapāno kārāpito hoti… udapānasālā kārāpitā hoti… pokkharaṇī kārāpitā hoti… maṇḍapo kārāpito hoti… ārāmo kārāpito hoti ",
      "… ārāmavatthu kārāpitaṃ hoti… puttassa vā vāreyyaṃ hoti… dhītuyā vā vāreyyaṃ hoti… gilāno vā hoti… abhiññātaṃ vā suttantaṃ bhaṇati. So ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘āgacchantu bhadantā, imaṃ suttantaṃ pariyāpuṇissanti, purāyaṃ suttanto ",
      " na palujjatī’ti. Aññataraṃ vā panassa kiccaṃ hoti – karaṇīyaṃ vā, so ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘āgacchantu bhadantā, icchāmi dānañca dātuṃ, dhammañca sotuṃ, bhikkhū ca passitu’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, pahite, na tveva appahite. Sattāhaṃ sannivatto kātabbo."
    ],
    "innerText": "189. Idha pana, bhikkhave, upāsakena attano atthāya nivesanaṃ kārāpitaṃ hoti…pe… sayanigharaṃ kārāpitaṃ hoti… udosito kārāpito hoti… aṭṭo kārāpito hoti… māḷo kārāpito hoti… āpaṇo kārāpito hoti… āpaṇasālā kārāpitā hoti… pāsādo kārāpito hoti… hammiyaṃ kārāpitaṃ hoti… guhā kārāpitā hoti… pariveṇaṃ kārāpitaṃ hoti… koṭṭhako kārāpito hoti… upaṭṭhānasālā kārāpitā hoti… aggisālā kārāpitā hoti… rasavatī kārāpitā hoti… caṅkamo kārāpito hoti… caṅkamanasālā kārāpitā hoti… udapāno kārāpito hoti… udapānasālā kārāpitā hoti… pokkharaṇī kārāpitā hoti… maṇḍapo kārāpito hoti… ārāmo kārāpito hoti … ārāmavatthu kārāpitaṃ hoti… puttassa vā vāreyyaṃ hoti… dhītuyā vā vāreyyaṃ hoti… gilāno vā hoti… abhiññātaṃ vā suttantaṃ bhaṇati. So ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘āgacchantu bhadantā, imaṃ suttantaṃ pariyāpuṇissanti, purāyaṃ suttanto na palujjatī’ti. Aññataraṃ vā panassa kiccaṃ hoti – karaṇīyaṃ vā, so ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘āgacchantu bhadantā, icchāmi dānañca dātuṃ, dhammañca sotuṃ, bhikkhū ca passitu’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, pahite, na tveva appahite. Sattāhaṃ sannivatto kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "190"
      },
      ". Idha ",
      " pana, bhikkhave, upāsikāya saṅghaṃ uddissa vihāro kārāpito hoti. Sā ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘āgacchantu ayyā, icchāmi dānañca dātuṃ, dhammañca sotuṃ, bhikkhū ca passitu’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, pahite, na tveva appahite. Sattāhaṃ sannivatto kātabbo."
    ],
    "innerText": "190. Idha pana, bhikkhave, upāsikāya saṅghaṃ uddissa vihāro kārāpito hoti. Sā ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘āgacchantu ayyā, icchāmi dānañca dātuṃ, dhammañca sotuṃ, bhikkhū ca passitu’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, pahite, na tveva appahite. Sattāhaṃ sannivatto kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, upāsikāya saṅghaṃ uddissa aḍḍhayogo kārāpito hoti…pe… pāsādo kārāpito hoti… hammiyaṃ kārāpitaṃ hoti… guhā kārāpitā hoti… pariveṇaṃ kārāpitaṃ hoti… koṭṭhako kārāpito hoti… upaṭṭhānasālā kārāpitā hoti… aggisālā kārāpitā hoti… kappiyakuṭi kārāpitā hoti… vaccakuṭi kārāpitā hoti… caṅkamo kārāpito hoti… caṅkamanasālā kārāpitā hoti… udapāno kārāpito hoti… udapānasālā ",
      " kārāpitā hoti… jantāgharaṃ kārāpitaṃ hoti… jantāgharasālā kārāpitā ",
      " hoti… pokkharaṇī kārāpitā hoti… maṇḍapo kārāpito hoti… ārāmo kārāpito hoti… ārāmavatthu kārāpitaṃ hoti. Sā ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘āgacchantu ayyā, icchāmi dānañca dātuṃ, dhammañca sotuṃ, bhikkhū ca passitu’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, pahite, na tveva appahite. Sattāhaṃ sannivatto kātabbo."
    ],
    "innerText": "Idha pana, bhikkhave, upāsikāya saṅghaṃ uddissa aḍḍhayogo kārāpito hoti…pe… pāsādo kārāpito hoti… hammiyaṃ kārāpitaṃ hoti… guhā kārāpitā hoti… pariveṇaṃ kārāpitaṃ hoti… koṭṭhako kārāpito hoti… upaṭṭhānasālā kārāpitā hoti… aggisālā kārāpitā hoti… kappiyakuṭi kārāpitā hoti… vaccakuṭi kārāpitā hoti… caṅkamo kārāpito hoti… caṅkamanasālā kārāpitā hoti… udapāno kārāpito hoti… udapānasālā kārāpitā hoti… jantāgharaṃ kārāpitaṃ hoti… jantāgharasālā kārāpitā hoti… pokkharaṇī kārāpitā hoti… maṇḍapo kārāpito hoti… ārāmo kārāpito hoti… ārāmavatthu kārāpitaṃ hoti. Sā ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘āgacchantu ayyā, icchāmi dānañca dātuṃ, dhammañca sotuṃ, bhikkhū ca passitu’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, pahite, na tveva appahite. Sattāhaṃ sannivatto kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, upāsikāya sambahule bhikkhū uddissa…pe… ekaṃ bhikkhuṃ uddissa…pe… bhikkhunisaṅghaṃ uddissa…pe… sambahulā bhikkhuniyo uddissa…pe… ekaṃ bhikkhuniṃ uddissa…pe… sambahulā sikkhamānāyo uddissa…pe… ekaṃ sikkhamānaṃ uddissa…pe… sambahule sāmaṇere uddissa…pe… ekaṃ sāmaṇeraṃ uddissa…pe… sambahulā sāmaṇeriyo uddissa…pe… ekaṃ sāmaṇeriṃ uddissa…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "191"
      },
      ". Idha pana, bhikkhave, upāsikāya attano atthāya nivesanaṃ kārāpitaṃ hoti…pe… sayanigharaṃ kārāpitaṃ hoti… udosito kārāpito hoti… aṭṭo kārāpito hoti… māḷo kārāpito hoti… āpaṇo kārāpito hoti… āpaṇasālā kārāpitā hoti… pāsādo kārāpito hoti… hammiyaṃ ",
      " kārāpitaṃ hoti… guhā kārāpitā hoti… pariveṇaṃ kārāpitaṃ hoti… koṭṭhako kārāpito hoti… upaṭṭhānasālā kārāpitā hoti… aggisālā kārāpitā hoti… rasavatī kārāpitā hoti… caṅkamo kārāpito hoti… caṅkamanasālā kārāpitā hoti… udapāno kārāpito hoti ",
      "… udapānasālā kārāpitā hoti… pokkharaṇī kārāpitā hoti… maṇḍapo kārāpito hoti… ārāmo kārāpito hoti… ārāmavatthu kārāpitaṃ hoti… puttassa vā vāreyyaṃ hoti… dhītuyā vā vāreyyaṃ hoti… gilānā vā hoti… abhiññātaṃ vā suttantaṃ bhaṇati. Sā ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘āgacchantu ayyā, imaṃ suttantaṃ pariyāpuṇissanti, purāyaṃ suttanto palujjatī’’ti. Aññataraṃ vā panassā kiccaṃ hoti karaṇīyaṃ vā, sā ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘āgacchantu ayyā, icchāmi dānañca dātuṃ, dhammañca sotuṃ, bhikkhū ca passitu’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, pahite, na tveva appahite. Sattāhaṃ sannivatto kātabbo."
    ],
    "innerText": "191. Idha pana, bhikkhave, upāsikāya attano atthāya nivesanaṃ kārāpitaṃ hoti…pe… sayanigharaṃ kārāpitaṃ hoti… udosito kārāpito hoti… aṭṭo kārāpito hoti… māḷo kārāpito hoti… āpaṇo kārāpito hoti… āpaṇasālā kārāpitā hoti… pāsādo kārāpito hoti… hammiyaṃ kārāpitaṃ hoti… guhā kārāpitā hoti… pariveṇaṃ kārāpitaṃ hoti… koṭṭhako kārāpito hoti… upaṭṭhānasālā kārāpitā hoti… aggisālā kārāpitā hoti… rasavatī kārāpitā hoti… caṅkamo kārāpito hoti… caṅkamanasālā kārāpitā hoti… udapāno kārāpito hoti … udapānasālā kārāpitā hoti… pokkharaṇī kārāpitā hoti… maṇḍapo kārāpito hoti… ārāmo kārāpito hoti… ārāmavatthu kārāpitaṃ hoti… puttassa vā vāreyyaṃ hoti… dhītuyā vā vāreyyaṃ hoti… gilānā vā hoti… abhiññātaṃ vā suttantaṃ bhaṇati. Sā ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘āgacchantu ayyā, imaṃ suttantaṃ pariyāpuṇissanti, purāyaṃ suttanto palujjatī’’ti. Aññataraṃ vā panassā kiccaṃ hoti karaṇīyaṃ vā, sā ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘āgacchantu ayyā, icchāmi dānañca dātuṃ, dhammañca sotuṃ, bhikkhū ca passitu’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, pahite, na tveva appahite. Sattāhaṃ sannivatto kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "192"
      },
      ". Idha pana, bhikkhave, bhikkhunā saṅghaṃ uddissa…pe… bhikkhuniyā saṅghaṃ uddissa… sikkhamānāya saṅghaṃ uddissa… sāmaṇerena saṅghaṃ uddissa… sāmaṇeriyā saṅghaṃ uddissa ",
      " … sambahule bhikkhū uddissa… ekaṃ bhikkhuṃ uddissa… bhikkhunisaṅghaṃ uddissa… sambahulā bhikkhuniyo uddissa… ekaṃ bhikkhuniṃ uddissa… sambahulā sikkhamānāyo uddissa… ekaṃ sikkhamānaṃ uddissa… sambahule sāmaṇere uddissa… ekaṃ sāmaṇeraṃ uddissa… sambahulā ",
      " sāmaṇeriyo uddissa… ekaṃ sāmaṇeriṃ uddissa… attano atthāya vihāro kārāpito hoti…pe… aḍḍhayogo kārāpito hoti… pāsādo kārāpito hoti… hammiyaṃ kārāpitaṃ hoti… guhā kārāpitā hoti… pariveṇaṃ kārāpitaṃ hoti ",
      "… koṭṭhako kārāpito hoti… upaṭṭhānasālā kārāpitā hoti… aggisālā kārāpitā hoti… kappiyakuṭi kārāpitā hoti… caṅkamo kārāpito hoti… caṅkamanasālā kārāpitā hoti… udapāno kārāpito hoti… udapānasālā kārāpitā hoti… pokkharaṇī kārāpitā hoti… maṇḍapo kārāpito hoti… ārāmo kārāpito hoti… ārāmavatthu kārāpitaṃ hoti. Sā ce bhikkhūnaṃ ",
      " santike dūtaṃ pahiṇeyya… ‘‘āgacchantu ayyā, icchāmi dānañca dātuṃ, dhammañca sotuṃ, bhikkhū ca passitu’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, pahite, na tveva appahite. Sattāhaṃ sannivatto kātabboti."
    ],
    "innerText": "192. Idha pana, bhikkhave, bhikkhunā saṅghaṃ uddissa…pe… bhikkhuniyā saṅghaṃ uddissa… sikkhamānāya saṅghaṃ uddissa… sāmaṇerena saṅghaṃ uddissa… sāmaṇeriyā saṅghaṃ uddissa … sambahule bhikkhū uddissa… ekaṃ bhikkhuṃ uddissa… bhikkhunisaṅghaṃ uddissa… sambahulā bhikkhuniyo uddissa… ekaṃ bhikkhuniṃ uddissa… sambahulā sikkhamānāyo uddissa… ekaṃ sikkhamānaṃ uddissa… sambahule sāmaṇere uddissa… ekaṃ sāmaṇeraṃ uddissa… sambahulā sāmaṇeriyo uddissa… ekaṃ sāmaṇeriṃ uddissa… attano atthāya vihāro kārāpito hoti…pe… aḍḍhayogo kārāpito hoti… pāsādo kārāpito hoti… hammiyaṃ kārāpitaṃ hoti… guhā kārāpitā hoti… pariveṇaṃ kārāpitaṃ hoti … koṭṭhako kārāpito hoti… upaṭṭhānasālā kārāpitā hoti… aggisālā kārāpitā hoti… kappiyakuṭi kārāpitā hoti… caṅkamo kārāpito hoti… caṅkamanasālā kārāpitā hoti… udapāno kārāpito hoti… udapānasālā kārāpitā hoti… pokkharaṇī kārāpitā hoti… maṇḍapo kārāpito hoti… ārāmo kārāpito hoti… ārāmavatthu kārāpitaṃ hoti. Sā ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya… ‘‘āgacchantu ayyā, icchāmi dānañca dātuṃ, dhammañca sotuṃ, bhikkhū ca passitu’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, pahite, na tveva appahite. Sattāhaṃ sannivatto kātabboti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sattāhakaraṇīyānujānatā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "110. Pañcannaṃ appahitepi anujānanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "193"
      },
      ". Tena kho pana samayena aññataro bhikkhu gilāno hoti. So bhikkhūnaṃ santike dūtaṃ pāhesi – ‘‘ahañhi gilāno, āgacchantu bhikkhū, icchāmi bhikkhūnaṃ āgata’’nti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, pañcannaṃ sattāhakaraṇīyena appahitepi gantuṃ, pageva pahite. Bhikkhussa, bhikkhuniyā, sikkhamānāya, sāmaṇerassa, sāmaṇeriyā – anujānāmi, bhikkhave, imesaṃ pañcannaṃ sattāhakaraṇīyena appahitepi gantuṃ, pageva pahite. Sattāhaṃ sannivatto kātabbo."
    ],
    "innerText": "193. Tena kho pana samayena aññataro bhikkhu gilāno hoti. So bhikkhūnaṃ santike dūtaṃ pāhesi – ‘‘ahañhi gilāno, āgacchantu bhikkhū, icchāmi bhikkhūnaṃ āgata’’nti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, pañcannaṃ sattāhakaraṇīyena appahitepi gantuṃ, pageva pahite. Bhikkhussa, bhikkhuniyā, sikkhamānāya, sāmaṇerassa, sāmaṇeriyā – anujānāmi, bhikkhave, imesaṃ pañcannaṃ sattāhakaraṇīyena appahitepi gantuṃ, pageva pahite. Sattāhaṃ sannivatto kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, bhikkhu gilāno hoti. So ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘ahañhi gilāno, āgacchantu bhikkhū, icchāmi bhikkhūnaṃ āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva ",
      " pahite – ‘‘gilānabhattaṃ vā pariyesissāmi, gilānupaṭṭhākabhattaṃ vā pariyesissāmi, gilānabhesajjaṃ vā pariyesissāmi, pucchissāmi vā, upaṭṭhahissāmi vā’’ti. Sattāhaṃ sannivatto kātabbo."
    ],
    "innerText": "Idha pana, bhikkhave, bhikkhu gilāno hoti. So ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘ahañhi gilāno, āgacchantu bhikkhū, icchāmi bhikkhūnaṃ āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘gilānabhattaṃ vā pariyesissāmi, gilānupaṭṭhākabhattaṃ vā pariyesissāmi, gilānabhesajjaṃ vā pariyesissāmi, pucchissāmi vā, upaṭṭhahissāmi vā’’ti. Sattāhaṃ sannivatto kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      " pana, bhikkhave, bhikkhussa anabhirati uppannā hoti. So ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘anabhirati me uppannā, āgacchantu bhikkhū, icchāmi bhikkhūnaṃ āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘anabhirataṃ vūpakāsessāmi vā, vūpakāsāpessāmi vā, dhammakathaṃ vāssa karissāmī’’ti. Sattāhaṃ sannivatto kātabbo."
    ],
    "innerText": "Idha pana, bhikkhave, bhikkhussa anabhirati uppannā hoti. So ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘anabhirati me uppannā, āgacchantu bhikkhū, icchāmi bhikkhūnaṃ āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘anabhirataṃ vūpakāsessāmi vā, vūpakāsāpessāmi vā, dhammakathaṃ vāssa karissāmī’’ti. Sattāhaṃ sannivatto kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, bhikkhussa kukkuccaṃ uppannaṃ hoti. So ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘kukkuccaṃ me uppannaṃ, āgacchantu bhikkhū, icchāmi bhikkhūnaṃ āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘kukkuccaṃ vinodessāmi vā, vinodāpessāmi vā, dhammakathaṃ vāssa karissāmī’’ti. Sattāhaṃ sannivatto kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      " pana, bhikkhave, bhikkhussa diṭṭhigataṃ uppannaṃ hoti. So ce bhikkhūnaṃ ",
      " santike dūtaṃ pahiṇeyya – ‘‘diṭṭhigataṃ me uppannaṃ, āgacchantu bhikkhū, icchāmi bhikkhūnaṃ āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘diṭṭhigataṃ vivecessāmi vā, vivecāpessāmi vā, dhammakathaṃ vāssa karissāmī’’ti. Sattāhaṃ sannivatto kātabbo."
    ],
    "innerText": "Idha pana, bhikkhave, bhikkhussa diṭṭhigataṃ uppannaṃ hoti. So ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘diṭṭhigataṃ me uppannaṃ, āgacchantu bhikkhū, icchāmi bhikkhūnaṃ āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘diṭṭhigataṃ vivecessāmi vā, vivecāpessāmi vā, dhammakathaṃ vāssa karissāmī’’ti. Sattāhaṃ sannivatto kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, bhikkhu garudhammaṃ ajjhāpanno hoti parivāsāraho. So ",
      " ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘ahañhi garudhammaṃ ajjhāpanno parivāsāraho, āgacchantu bhikkhū, icchāmi bhikkhūnaṃ āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘parivāsadānaṃ ussukkaṃ karissāmi vā, anussāvessāmi vā, gaṇapūrako vā bhavissāmī’’ti. Sattāhaṃ sannivatto kātabbo."
    ],
    "innerText": "Idha pana, bhikkhave, bhikkhu garudhammaṃ ajjhāpanno hoti parivāsāraho. So ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘ahañhi garudhammaṃ ajjhāpanno parivāsāraho, āgacchantu bhikkhū, icchāmi bhikkhūnaṃ āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘parivāsadānaṃ ussukkaṃ karissāmi vā, anussāvessāmi vā, gaṇapūrako vā bhavissāmī’’ti. Sattāhaṃ sannivatto kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, bhikkhu mūlāya paṭikassanāraho hoti. So ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘ahañhi mūlāya paṭikassanāraho, āgacchantu bhikkhū, icchāmi bhikkhūnaṃ āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘mūlāya paṭikassanaṃ ussukkaṃ karissāmi vā, anussāvessāmi vā, gaṇapūrako vā bhavissāmī’’ti. Sattāhaṃ sannivatto kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, bhikkhu mānattāraho hoti. So ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘ahañhi mānattāraho, āgacchantu bhikkhū, icchāmi bhikkhūnaṃ āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘mānattadānaṃ ussukkaṃ karissāmi vā, anussāvessāmi vā, gaṇapūrako vā bhavissāmī’’ti. Sattāhaṃ sannivatto kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, bhikkhu abbhānāraho hoti. So ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya ",
      " – ‘‘ahañhi abbhānāraho, āgacchantu bhikkhū, icchāmi bhikkhūnaṃ āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘abbhānaṃ ussukkaṃ karissāmi vā, anussāvessāmi ",
      " vā, gaṇapūrako vā bhavissāmī’’ti. Sattāhaṃ sannivatto kātabbo."
    ],
    "innerText": "Idha pana, bhikkhave, bhikkhu abbhānāraho hoti. So ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘ahañhi abbhānāraho, āgacchantu bhikkhū, icchāmi bhikkhūnaṃ āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘abbhānaṃ ussukkaṃ karissāmi vā, anussāvessāmi vā, gaṇapūrako vā bhavissāmī’’ti. Sattāhaṃ sannivatto kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      " pana, bhikkhave, bhikkhussa saṅgho kammaṃ kattukāmo hoti tajjanīyaṃ vā, niyassaṃ vā, pabbājanīyaṃ vā, paṭisāraṇīyaṃ vā, ukkhepanīyaṃ vā. So ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘saṅgho me kammaṃ kattukāmo, āgacchantu bhikkhū, icchāmi bhikkhūnaṃ āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘kinti nu ",
      " kho saṅgho kammaṃ na kareyya, lahukāya vā pariṇāmeyyā’’ti. Sattāhaṃ sannivatto kātabbo."
    ],
    "innerText": "Idha pana, bhikkhave, bhikkhussa saṅgho kammaṃ kattukāmo hoti tajjanīyaṃ vā, niyassaṃ vā, pabbājanīyaṃ vā, paṭisāraṇīyaṃ vā, ukkhepanīyaṃ vā. So ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘saṅgho me kammaṃ kattukāmo, āgacchantu bhikkhū, icchāmi bhikkhūnaṃ āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘kinti nu kho saṅgho kammaṃ na kareyya, lahukāya vā pariṇāmeyyā’’ti. Sattāhaṃ sannivatto kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kataṃ vā panassa hoti saṅghena kammaṃ tajjanīyaṃ vā niyassaṃ vā pabbājanīyaṃ vā paṭisāraṇīyaṃ vā ukkhepanīyaṃ vā. So ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya ‘‘saṅgho me kammaṃ akāsi, āgacchantu bhikkhū, icchāmi bhikkhūnaṃ āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘kinti nu kho sammā vatteyya, lomaṃ pāteyya, netthāraṃ vatteyya, saṅgho taṃ kammaṃ paṭippassambheyyā’’ti. Sattāhaṃ sannivatto kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "194"
      },
      ". Idha pana, bhikkhave, bhikkhunī gilānā hoti. Sā ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘ahañhi gilānā, āgacchantu ayyā, icchāmi ayyānaṃ āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘gilānabhattaṃ vā pariyesissāmi, gilānupaṭṭhākabhattaṃ vā pariyesissāmi, gilānabhesajjaṃ vā ",
      " pariyesissāmi, pucchissāmi vā, upaṭṭhahissāmi vā’’ti. Sattāhaṃ sannivatto kātabbo."
    ],
    "innerText": "194. Idha pana, bhikkhave, bhikkhunī gilānā hoti. Sā ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘ahañhi gilānā, āgacchantu ayyā, icchāmi ayyānaṃ āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘gilānabhattaṃ vā pariyesissāmi, gilānupaṭṭhākabhattaṃ vā pariyesissāmi, gilānabhesajjaṃ vā pariyesissāmi, pucchissāmi vā, upaṭṭhahissāmi vā’’ti. Sattāhaṃ sannivatto kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      " pana, bhikkhave, bhikkhuniyā anabhirati uppannā hoti. Sā ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘anabhirati me uppannā, āgacchantu ayyā, icchāmi ayyānaṃ āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘anabhirataṃ vūpakāsessāmi vā, vūpakāsāpessāmi vā, dhammakathaṃ vāssā karissāmī’’ti. Sattāhaṃ sannivatto kātabbo."
    ],
    "innerText": "Idha pana, bhikkhave, bhikkhuniyā anabhirati uppannā hoti. Sā ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘anabhirati me uppannā, āgacchantu ayyā, icchāmi ayyānaṃ āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘anabhirataṃ vūpakāsessāmi vā, vūpakāsāpessāmi vā, dhammakathaṃ vāssā karissāmī’’ti. Sattāhaṃ sannivatto kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, bhikkhuniyā kukkuccaṃ uppannaṃ hoti. Sā ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘kukkuccaṃ me uppannaṃ, āgacchantu ayyā, icchāmi ayyānaṃ āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva ",
      " pahite – ‘‘kukkuccaṃ vinodessāmi vā, vinodāpessāmi vā, dhammakathaṃ vāssā karissāmī’’ti. Sattāhaṃ sannivatto kātabbo."
    ],
    "innerText": "Idha pana, bhikkhave, bhikkhuniyā kukkuccaṃ uppannaṃ hoti. Sā ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘kukkuccaṃ me uppannaṃ, āgacchantu ayyā, icchāmi ayyānaṃ āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘kukkuccaṃ vinodessāmi vā, vinodāpessāmi vā, dhammakathaṃ vāssā karissāmī’’ti. Sattāhaṃ sannivatto kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, bhikkhuniyā diṭṭhigataṃ uppannaṃ hoti. Sā ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘diṭṭhigataṃ me uppannaṃ, āgacchantu ayyā, icchāmi ayyānaṃ āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘diṭṭhigataṃ vivecessāmi vā, vivecāpessāmi vā, dhammakathaṃ vāssā karissāmī’’ti. Sattāhaṃ sannivatto kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, bhikkhunī garudhammaṃ ajjhāpannā hoti mānattārahā. Sā ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘ahañhi garudhammaṃ ",
      " ajjhāpannā mānattārahā ",
      ", āgacchantu ayyā, icchāmi ayyānaṃ āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘mānattadānaṃ ussukkaṃ karissāmī’’ti. Sattāhaṃ sannivatto kātabbo."
    ],
    "innerText": "Idha pana, bhikkhave, bhikkhunī garudhammaṃ ajjhāpannā hoti mānattārahā. Sā ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘ahañhi garudhammaṃ ajjhāpannā mānattārahā , āgacchantu ayyā, icchāmi ayyānaṃ āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘mānattadānaṃ ussukkaṃ karissāmī’’ti. Sattāhaṃ sannivatto kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, bhikkhunī mūlāya paṭikassanārahā hoti. Sā ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘ahañhi mūlāya paṭikassanārahā, āgacchantu ayyā, icchāmi ayyānaṃ āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘mūlāya paṭikassanaṃ ussukkaṃ karissāmī’’ti. Sattāhaṃ sannivatto kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, bhikkhunī abbhānārahā hoti. Sā ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘ahañhi abbhānārahā, āgacchantu ayyā, icchāmi ayyānaṃ āgata’’nti, gantabbaṃ ",
      ", bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘abbhānaṃ ussukkaṃ karissāmī’’ti. Sattāhaṃ sannivatto kātabbo."
    ],
    "innerText": "Idha pana, bhikkhave, bhikkhunī abbhānārahā hoti. Sā ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘ahañhi abbhānārahā, āgacchantu ayyā, icchāmi ayyānaṃ āgata’’nti, gantabbaṃ , bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘abbhānaṃ ussukkaṃ karissāmī’’ti. Sattāhaṃ sannivatto kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, bhikkhuniyā saṅgho kammaṃ kattukāmo hoti – tajjanīyaṃ vā, niyassaṃ vā, pabbājanīyaṃ vā, paṭisāraṇīyaṃ vā, ukkhepanīyaṃ vā. Sā ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘saṅgho me kammaṃ kattukāmo, āgacchantu ayyā, icchāmi ayyānaṃ āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘kinti nu kho saṅgho kammaṃ na kareyya, lahukāya vā pariṇāmeyyā’’ti. Sattāhaṃ sannivatto kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kataṃ ",
      " vā panassā hoti saṅghena kammaṃ – tajjanīyaṃ vā ",
      ", niyassaṃ vā, pabbājanīyaṃ vā, paṭisāraṇīyaṃ vā, ukkhepanīyaṃ vā. Sā ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘saṅgho me kammaṃ akāsi, āgacchantu ayyā, icchāmi ayyānaṃ āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘kinti nu kho sammā vatteyya, lomaṃ pāteyya, netthāraṃ vatteyya, saṅgho taṃ kammaṃ paṭippassambheyyā’’ti. Sattāhaṃ sannivatto kātabbo."
    ],
    "innerText": "Kataṃ vā panassā hoti saṅghena kammaṃ – tajjanīyaṃ vā , niyassaṃ vā, pabbājanīyaṃ vā, paṭisāraṇīyaṃ vā, ukkhepanīyaṃ vā. Sā ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘saṅgho me kammaṃ akāsi, āgacchantu ayyā, icchāmi ayyānaṃ āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘kinti nu kho sammā vatteyya, lomaṃ pāteyya, netthāraṃ vatteyya, saṅgho taṃ kammaṃ paṭippassambheyyā’’ti. Sattāhaṃ sannivatto kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "195"
      },
      ". Idha pana, bhikkhave, sikkhamānā gilānā hoti. Sā ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘ahañhi gilānā, āgacchantu ayyā, icchāmi ayyānaṃ āgata’’nti – gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘gilānabhattaṃ vā pariyesissāmi, gilānupaṭṭhākabhattaṃ vā pariyesissāmi, gilānabhesajjaṃ vā pariyesissāmi, pucchissāmi vā, upaṭṭhahissāmi vā’’ti. Sattāhaṃ sannivatto kātabbo."
    ],
    "innerText": "195. Idha pana, bhikkhave, sikkhamānā gilānā hoti. Sā ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘ahañhi gilānā, āgacchantu ayyā, icchāmi ayyānaṃ āgata’’nti – gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘gilānabhattaṃ vā pariyesissāmi, gilānupaṭṭhākabhattaṃ vā pariyesissāmi, gilānabhesajjaṃ vā pariyesissāmi, pucchissāmi vā, upaṭṭhahissāmi vā’’ti. Sattāhaṃ sannivatto kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, sikkhamānāya ",
      " anabhirati uppannā hoti…pe… sikkhamānāya kukkuccaṃ uppannaṃ hoti… sikkhamānāya diṭṭhigataṃ uppannaṃ hoti… sikkhamānāya sikkhā kupitā hoti. Sā ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘sikkhā me kupitā, āgacchantu ayyā, icchāmi ayyānaṃ āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘sikkhāsamādānaṃ ussukkaṃ karissāmī’’ti. Sattāhaṃ sannivatto kātabbo."
    ],
    "innerText": "Idha pana, bhikkhave, sikkhamānāya anabhirati uppannā hoti…pe… sikkhamānāya kukkuccaṃ uppannaṃ hoti… sikkhamānāya diṭṭhigataṃ uppannaṃ hoti… sikkhamānāya sikkhā kupitā hoti. Sā ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘sikkhā me kupitā, āgacchantu ayyā, icchāmi ayyānaṃ āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘sikkhāsamādānaṃ ussukkaṃ karissāmī’’ti. Sattāhaṃ sannivatto kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, sikkhamānā upasampajjitukāmā hoti. Sā ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘ahañhi upasampajjitukāmā, āgacchantu ayyā ",
      ", icchāmi ayyānaṃ ",
      " āgata’’nti gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – upasampadaṃ ussukkaṃ karissāmi vā, anussāvessāmi vā, gaṇapūrako vā bhavissāmīti. Sattāhaṃ sannivatto kātabbo."
    ],
    "innerText": "Idha pana, bhikkhave, sikkhamānā upasampajjitukāmā hoti. Sā ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘ahañhi upasampajjitukāmā, āgacchantu ayyā , icchāmi ayyānaṃ āgata’’nti gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – upasampadaṃ ussukkaṃ karissāmi vā, anussāvessāmi vā, gaṇapūrako vā bhavissāmīti. Sattāhaṃ sannivatto kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "196"
      },
      ". Idha pana, bhikkhave, sāmaṇero gilāno hoti. So ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘ahañhi gilāno, āgacchantu bhikkhū ",
      ", icchāmi bhikkhūnaṃ āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘gilānabhattaṃ vā pariyesissāmi, gilānupaṭṭhākabhattaṃ vā pariyesissāmi, gilānabhesajjaṃ vā pariyesissāmi, pucchissāmi vā, upaṭṭhahissāmi vā’’ti. Sattāhaṃ sannivatto kātabbo."
    ],
    "innerText": "196. Idha pana, bhikkhave, sāmaṇero gilāno hoti. So ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘ahañhi gilāno, āgacchantu bhikkhū , icchāmi bhikkhūnaṃ āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘gilānabhattaṃ vā pariyesissāmi, gilānupaṭṭhākabhattaṃ vā pariyesissāmi, gilānabhesajjaṃ vā pariyesissāmi, pucchissāmi vā, upaṭṭhahissāmi vā’’ti. Sattāhaṃ sannivatto kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, sāmaṇerassa anabhirati uppannā hoti…pe… sāmaṇerassa kukkuccaṃ uppannaṃ hoti… sāmaṇerassa diṭṭhigataṃ uppannaṃ hoti… sāmaṇero vassaṃ pucchitukāmo hoti. So ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘ahañhi vassaṃ pucchitukāmo, āgacchantu bhikkhū, icchāmi bhikkhūnaṃ āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘pucchissāmi vā, ācikkhissāmi vā’’ti. Sattāhaṃ sannivatto kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, sāmaṇero upasampajjitukāmo hoti. So ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘ahañhi upasampajjitukāmo, āgacchantu bhikkhū, icchāmi bhikkhūnaṃ āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘upasampadaṃ ussukkaṃ karissāmi vā, anussāvessāmi ",
      " vā, gaṇapūrako vā bhavissāmī’’ti. Sattāhaṃ sannivatto kātabbo."
    ],
    "innerText": "Idha pana, bhikkhave, sāmaṇero upasampajjitukāmo hoti. So ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘ahañhi upasampajjitukāmo, āgacchantu bhikkhū, icchāmi bhikkhūnaṃ āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘upasampadaṃ ussukkaṃ karissāmi vā, anussāvessāmi vā, gaṇapūrako vā bhavissāmī’’ti. Sattāhaṃ sannivatto kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "197"
      },
      ". Idha pana, bhikkhave, sāmaṇerī gilānā hoti. Sā ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘ahañhi gilānā, āgacchantu ayyā, icchāmi ayyānaṃ āgata’’nti ",
      ", gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘gilānabhattaṃ vā pariyesissāmi, gilānupaṭṭhākabhattaṃ vā pariyesissāmi, gilānabhesajjaṃ vā pariyesissāmi, pucchissāmi vā, upaṭṭhahissāmi vā’’ti. Sattāhaṃ sannivatto kātabbo."
    ],
    "innerText": "197. Idha pana, bhikkhave, sāmaṇerī gilānā hoti. Sā ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘ahañhi gilānā, āgacchantu ayyā, icchāmi ayyānaṃ āgata’’nti , gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘gilānabhattaṃ vā pariyesissāmi, gilānupaṭṭhākabhattaṃ vā pariyesissāmi, gilānabhesajjaṃ vā pariyesissāmi, pucchissāmi vā, upaṭṭhahissāmi vā’’ti. Sattāhaṃ sannivatto kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, sāmaṇeriyā anabhirati uppannā hoti…pe… sāmaṇeriyā kukkuccaṃ ",
      " uppannaṃ hoti… sāmaṇeriyā diṭṭhigataṃ uppannaṃ hoti… sāmaṇerī vassaṃ pucchitukāmā hoti. Sā ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘ahañhi vassaṃ pucchitukāmā, āgacchantu ayyā, icchāmi ayyānaṃ āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘pucchissāmi vā, ācikkhissāmi vā’’ti. Sattāhaṃ sannivatto kātabbo."
    ],
    "innerText": "Idha pana, bhikkhave, sāmaṇeriyā anabhirati uppannā hoti…pe… sāmaṇeriyā kukkuccaṃ uppannaṃ hoti… sāmaṇeriyā diṭṭhigataṃ uppannaṃ hoti… sāmaṇerī vassaṃ pucchitukāmā hoti. Sā ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘ahañhi vassaṃ pucchitukāmā, āgacchantu ayyā, icchāmi ayyānaṃ āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘pucchissāmi vā, ācikkhissāmi vā’’ti. Sattāhaṃ sannivatto kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      " pana, bhikkhave, sāmaṇerī sikkhaṃ samādiyitukāmā hoti. Sā ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘ahañhi sikkhaṃ samādiyitukāmā, āgacchantu ayyā, icchāmi ayyānaṃ āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘sikkhāsamādānaṃ ussukkaṃ karissāmī’’ti. Sattāhaṃ sannivatto kātabboti."
    ],
    "innerText": "Idha pana, bhikkhave, sāmaṇerī sikkhaṃ samādiyitukāmā hoti. Sā ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘ahañhi sikkhaṃ samādiyitukāmā, āgacchantu ayyā, icchāmi ayyānaṃ āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘sikkhāsamādānaṃ ussukkaṃ karissāmī’’ti. Sattāhaṃ sannivatto kātabboti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pañcannaṃ appahitepi anujānanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "111. Sattannaṃ appahitepi anujānanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "198"
      },
      ". Tena kho pana samayena aññatarassa bhikkhuno mātā gilānā hoti. Sā puttassa santike dūtaṃ pāhesi – ‘‘ahañhi gilānā, āgacchatu me putto, icchāmi puttassa āgata’’nti. Atha kho tassa bhikkhuno etadahosi – ‘‘bhagavatā paññattaṃ sattannaṃ sattāhakaraṇīyena pahite gantuṃ, na tveva appahite; pañcannaṃ sattāhakaraṇīyena appahitepi gantuṃ, pageva pahiteti. Ayañca me mātā gilānā, sā ca anupāsikā, kathaṃ ",
      " nu kho mayā paṭipajjitabba’’nti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, sattannaṃ sattāhakaraṇīyena appahitepi gantuṃ, pageva pahite. Bhikkhussa, bhikkhuniyā, sikkhamānāya, sāmaṇerassa, sāmaṇeriyā, mātuyā ca pitussa ca – anujānāmi, bhikkhave, imesaṃ sattannaṃ sattāhakaraṇīyena appahitepi gantuṃ, pageva pahite. Sattāhaṃ sannivatto kātabbo."
    ],
    "innerText": "198. Tena kho pana samayena aññatarassa bhikkhuno mātā gilānā hoti. Sā puttassa santike dūtaṃ pāhesi – ‘‘ahañhi gilānā, āgacchatu me putto, icchāmi puttassa āgata’’nti. Atha kho tassa bhikkhuno etadahosi – ‘‘bhagavatā paññattaṃ sattannaṃ sattāhakaraṇīyena pahite gantuṃ, na tveva appahite; pañcannaṃ sattāhakaraṇīyena appahitepi gantuṃ, pageva pahiteti. Ayañca me mātā gilānā, sā ca anupāsikā, kathaṃ nu kho mayā paṭipajjitabba’’nti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, sattannaṃ sattāhakaraṇīyena appahitepi gantuṃ, pageva pahite. Bhikkhussa, bhikkhuniyā, sikkhamānāya, sāmaṇerassa, sāmaṇeriyā, mātuyā ca pitussa ca – anujānāmi, bhikkhave, imesaṃ sattannaṃ sattāhakaraṇīyena appahitepi gantuṃ, pageva pahite. Sattāhaṃ sannivatto kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, bhikkhussa mātā gilānā hoti. Sā ce puttassa santike dūtaṃ pahiṇeyya – ‘‘ahañhi gilānā, āgacchatu me putto, icchāmi puttassa āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘gilānabhattaṃ vā pariyesissāmi, gilānupaṭṭhākabhattaṃ vā pariyesissāmi, gilānabhesajjaṃ vā pariyesissāmi, pucchissāmi vā, upaṭṭhahissāmi vā’’ti. Sattāhaṃ sannivatto kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      " pana, bhikkhave, bhikkhussa ",
      " pitā gilāno hoti. So ce puttassa santike dūtaṃ pahiṇeyya – ‘‘ahañhi gilāno, āgacchatu me putto, icchāmi puttassa āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘gilānabhattaṃ vā pariyesissāmi, gilānupaṭṭhākabhattaṃ vā pariyesissāmi, gilānabhesajjaṃ vā pariyesissāmi, pucchissāmi vā, upaṭṭhahissāmi vā’’ti. Sattāhaṃ sannivatto kātabbo."
    ],
    "innerText": "Idha pana, bhikkhave, bhikkhussa pitā gilāno hoti. So ce puttassa santike dūtaṃ pahiṇeyya – ‘‘ahañhi gilāno, āgacchatu me putto, icchāmi puttassa āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, appahitepi, pageva pahite – ‘‘gilānabhattaṃ vā pariyesissāmi, gilānupaṭṭhākabhattaṃ vā pariyesissāmi, gilānabhesajjaṃ vā pariyesissāmi, pucchissāmi vā, upaṭṭhahissāmi vā’’ti. Sattāhaṃ sannivatto kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sattannaṃ appahitepi anujānanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "112. Pahiteyeva anujānanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "199"
      },
      ". Idha ",
      " pana, bhikkhave, bhikkhussa bhātā gilāno hoti. So ce bhātuno santike dūtaṃ pahiṇeyya – ‘‘ahañhi gilāno, āgacchatu me bhātā, icchāmi bhātuno āgata’’nti, gantabbaṃ, bhikkhave ",
      ", sattāhakaraṇīyena, pahite, na tveva appahite. Sattāhaṃ sannivatto kātabbo."
    ],
    "innerText": "199. Idha pana, bhikkhave, bhikkhussa bhātā gilāno hoti. So ce bhātuno santike dūtaṃ pahiṇeyya – ‘‘ahañhi gilāno, āgacchatu me bhātā, icchāmi bhātuno āgata’’nti, gantabbaṃ, bhikkhave , sattāhakaraṇīyena, pahite, na tveva appahite. Sattāhaṃ sannivatto kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, bhikkhussa bhaginī gilānā hoti. Sā ce bhātuno santike dūtaṃ pahiṇeyya – ‘‘ahañhi gilānā, āgacchatu me bhātā, icchāmi bhātuno āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, pahite, na tveva appahite. Sattāhaṃ sannivatto kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, bhikkhussa ñātako gilāno hoti. So ce bhikkhussa santike dūtaṃ pahiṇeyya – ‘‘ahañhi gilāno, āgacchatu bhadanto, icchāmi bhadantassa āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, pahite, na tveva appahite. Sattāhaṃ sannivatto kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, bhikkhugatiko gilāno hoti. So ce bhikkhūnaṃ santike dūtaṃ pahiṇeyya – ‘‘ahañhi gilāno, āgacchantu bhadantā, icchāmi bhadantānaṃ āgata’’nti, gantabbaṃ, bhikkhave, sattāhakaraṇīyena, pahite, na tveva appahite. Sattāhaṃ sannivatto kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena ",
      " kho pana samayena saṅghassa vihāro undriyati. Aññatarena upāsakena araññe bhaṇḍaṃ chedāpitaṃ hoti. So bhikkhūnaṃ santike dūtaṃ pāhesi – ‘‘sace bhadantā taṃ bhaṇḍaṃ āvahāpeyyuṃ, dajjāhaṃ taṃ bhaṇḍa’’nti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, saṅghakaraṇīyena gantuṃ. Sattāhaṃ sannivatto kātabboti."
    ],
    "innerText": "Tena kho pana samayena saṅghassa vihāro undriyati. Aññatarena upāsakena araññe bhaṇḍaṃ chedāpitaṃ hoti. So bhikkhūnaṃ santike dūtaṃ pāhesi – ‘‘sace bhadantā taṃ bhaṇḍaṃ āvahāpeyyuṃ, dajjāhaṃ taṃ bhaṇḍa’’nti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, saṅghakaraṇīyena gantuṃ. Sattāhaṃ sannivatto kātabboti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pahiteyeva anujānanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vassāvāsabhāṇavāro niṭṭhito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "113. Antarāye anāpattivassacchedavāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "200"
      },
      ". Tena ",
      " kho pana samayena kosalesu janapade aññatarasmiṃ āvāse vassūpagatā bhikkhū vāḷehi ubbāḷhā honti. Gaṇhiṃsupi paripātiṃsupi. Bhagavato etamatthaṃ ārocesuṃ."
    ],
    "innerText": "200. Tena kho pana samayena kosalesu janapade aññatarasmiṃ āvāse vassūpagatā bhikkhū vāḷehi ubbāḷhā honti. Gaṇhiṃsupi paripātiṃsupi. Bhagavato etamatthaṃ ārocesuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      " pana, bhikkhave, vassūpagatā bhikkhū vāḷehi ubbāḷhā honti. Gaṇhantipi paripātentipi. Eseva antarāyoti pakkamitabbaṃ. Anāpatti vassacchedassa."
    ],
    "innerText": "Idha pana, bhikkhave, vassūpagatā bhikkhū vāḷehi ubbāḷhā honti. Gaṇhantipi paripātentipi. Eseva antarāyoti pakkamitabbaṃ. Anāpatti vassacchedassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, vassūpagatā bhikkhū sarīsapehi ubbāḷhā honti. Ḍaṃsantipi paripātentipi. Eseva antarāyoti pakkamitabbaṃ. Anāpatti vassacchedassa ",
      "."
    ],
    "innerText": "Idha pana, bhikkhave, vassūpagatā bhikkhū sarīsapehi ubbāḷhā honti. Ḍaṃsantipi paripātentipi. Eseva antarāyoti pakkamitabbaṃ. Anāpatti vassacchedassa ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, vassūpagatā bhikkhū corehi ubbāḷhā honti. Vilumpantipi ākoṭentipi. Eseva antarāyoti pakkamitabbaṃ. Anāpatti vassacchedassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, vassūpagatā bhikkhū pisācehi ubbāḷhā honti. Āvisantipi hanantipi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ojampi haranti (sī.), harantipi (syā.)]"
      },
      ". Eseva antarāyoti pakkamitabbaṃ. Anāpatti vassacchedassa."
    ],
    "innerText": "Idha pana, bhikkhave, vassūpagatā bhikkhū pisācehi ubbāḷhā honti. Āvisantipi hanantipi [ojampi haranti (sī.), harantipi (syā.)]. Eseva antarāyoti pakkamitabbaṃ. Anāpatti vassacchedassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, vassūpagatānaṃ bhikkhūnaṃ gāmo agginā daḍḍho hoti. Bhikkhū piṇḍakena kilamanti. Eseva antarāyoti pakkamitabbaṃ. Anāpatti vassacchedassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, vassūpagatānaṃ bhikkhūnaṃ senāsanaṃ agginā daḍḍhaṃ hoti. Bhikkhū senāsanena kilamanti. Eseva antarāyoti pakkamitabbaṃ. Anāpatti vassacchedassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      " pana, bhikkhave, vassūpagatānaṃ bhikkhūnaṃ gāmo udakena ",
      " vūḷho hoti. Bhikkhū piṇḍakena kilamanti. Eseva antarāyoti pakkamitabbaṃ. Anāpatti vassacchedassa."
    ],
    "innerText": "Idha pana, bhikkhave, vassūpagatānaṃ bhikkhūnaṃ gāmo udakena vūḷho hoti. Bhikkhū piṇḍakena kilamanti. Eseva antarāyoti pakkamitabbaṃ. Anāpatti vassacchedassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, vassūpagatānaṃ bhikkhūnaṃ senāsanaṃ udakena vūḷhaṃ hoti. Bhikkhū senāsanena kilamanti. Eseva antarāyoti pakkamitabbaṃ. Anāpatti vassacchedassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "201"
      },
      ". Tena kho pana samayena aññatarasmiṃ āvāse vassūpagatānaṃ bhikkhūnaṃ gāmo corehi vuṭṭhāsi. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, yena gāmo tena gantunti."
    ],
    "innerText": "201. Tena kho pana samayena aññatarasmiṃ āvāse vassūpagatānaṃ bhikkhūnaṃ gāmo corehi vuṭṭhāsi. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, yena gāmo tena gantunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Gāmo ",
      " dvedhā bhijjittha. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, yena bahutarā tena gantunti."
    ],
    "innerText": "Gāmo dvedhā bhijjittha. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, yena bahutarā tena gantunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bahutarā assaddhā honti appasannā. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, yena saddhā pasannā tena gantunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena kho pana samayena kosalesu janapade aññatarasmiṃ āvāse vassūpagatā bhikkhū na labhiṃsu lūkhassa vā paṇītassa vā bhojanassa yāvadatthaṃ pāripūriṃ. Bhagavato etamatthaṃ ārocesuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, vassūpagatā bhikkhū na labhanti lūkhassa vā paṇītassa vā bhojanassa yāvadatthaṃ pāripūriṃ. Eseva antarāyoti pakkamitabbaṃ. Anāpatti vassacchedassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, vassūpagatā bhikkhū labhanti lūkhassa vā paṇītassa vā bhojanassa yāvadatthaṃ pāripūriṃ, na labhanti sappāyāni bhojanāni. Eseva antarāyoti pakkamitabbaṃ. Anāpatti ",
      " vassacchedassa."
    ],
    "innerText": "Idha pana, bhikkhave, vassūpagatā bhikkhū labhanti lūkhassa vā paṇītassa vā bhojanassa yāvadatthaṃ pāripūriṃ, na labhanti sappāyāni bhojanāni. Eseva antarāyoti pakkamitabbaṃ. Anāpatti vassacchedassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, vassūpagatā bhikkhū labhanti lūkhassa vā paṇītassa vā bhojanassa yāvadatthaṃ pāripūriṃ, labhanti sappāyāni bhojanāni ",
      ", na labhanti sappāyāni bhesajjāni. Eseva antarāyoti pakkamitabbaṃ. Anāpatti vassacchedassa."
    ],
    "innerText": "Idha pana, bhikkhave, vassūpagatā bhikkhū labhanti lūkhassa vā paṇītassa vā bhojanassa yāvadatthaṃ pāripūriṃ, labhanti sappāyāni bhojanāni , na labhanti sappāyāni bhesajjāni. Eseva antarāyoti pakkamitabbaṃ. Anāpatti vassacchedassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      " pana, bhikkhave, vassūpagatā bhikkhū labhanti lūkhassa vā paṇītassa vā bhojanassa yāvadatthaṃ pāripūriṃ, labhanti sappāyāni bhojanāni, labhanti sappāyāni bhesajjāni, na labhanti patirūpaṃ upaṭṭhākaṃ. Eseva antarāyoti pakkamitabbaṃ. Anāpatti vassacchedassa."
    ],
    "innerText": "Idha pana, bhikkhave, vassūpagatā bhikkhū labhanti lūkhassa vā paṇītassa vā bhojanassa yāvadatthaṃ pāripūriṃ, labhanti sappāyāni bhojanāni, labhanti sappāyāni bhesajjāni, na labhanti patirūpaṃ upaṭṭhākaṃ. Eseva antarāyoti pakkamitabbaṃ. Anāpatti vassacchedassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, vassūpagataṃ bhikkhuṃ itthī nimanteti – ‘‘ehi, bhante, hiraññaṃ vā te demi, suvaṇṇaṃ vā te demi, khettaṃ vā te demi, vatthuṃ vā te demi, gāvuṃ vā te demi, gāviṃ vā te demi, dāsaṃ vā te demi, dāsiṃ vā te demi, dhītaraṃ vā te demi bhariyatthāya, ahaṃ vā te bhariyā homi, aññaṃ vā te bhariyaṃ ānemī’’ti. Tatra ce bhikkhuno evaṃ hoti, ‘lahuparivattaṃ kho cittaṃ vuttaṃ bhagavatā, siyāpi me brahmacariyassa antarāyo’ti, pakkamitabbaṃ. Anāpatti vassacchedassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      " pana, bhikkhave, vassūpagataṃ bhikkhuṃ vesī nimanteti…pe… thullakumārī nimanteti… paṇḍako nimanteti… ñātakā nimantenti… rājāno nimantenti… corā nimantenti… dhuttā nimantenti – ‘‘ehi, bhante, hiraññaṃ vā te dema, suvaṇṇaṃ vā te dema, khettaṃ vā te dema, vatthuṃ vā te dema ",
      ", gāvuṃ vā te dema, gāviṃ vā te dema, dāsaṃ vā te dema, dāsiṃ vā te dema, dhītaraṃ vā te dema bhariyatthāya, aññaṃ vā te bhariyaṃ ānemā’’ti. Tatra ce bhikkhuno evaṃ hoti, ‘lahuparivattaṃ kho cittaṃ vuttaṃ bhagavatā, siyāpi me brahmacariyassa antarāyo’ti, pakkamitabbaṃ. Anāpatti vassacchedassa."
    ],
    "innerText": "Idha pana, bhikkhave, vassūpagataṃ bhikkhuṃ vesī nimanteti…pe… thullakumārī nimanteti… paṇḍako nimanteti… ñātakā nimantenti… rājāno nimantenti… corā nimantenti… dhuttā nimantenti – ‘‘ehi, bhante, hiraññaṃ vā te dema, suvaṇṇaṃ vā te dema, khettaṃ vā te dema, vatthuṃ vā te dema , gāvuṃ vā te dema, gāviṃ vā te dema, dāsaṃ vā te dema, dāsiṃ vā te dema, dhītaraṃ vā te dema bhariyatthāya, aññaṃ vā te bhariyaṃ ānemā’’ti. Tatra ce bhikkhuno evaṃ hoti, ‘lahuparivattaṃ kho cittaṃ vuttaṃ bhagavatā, siyāpi me brahmacariyassa antarāyo’ti, pakkamitabbaṃ. Anāpatti vassacchedassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, vassūpagato bhikkhu assāmikaṃ nidhiṃ passati. Tatra ce bhikkhuno evaṃ hoti, ‘lahuparivattaṃ kho cittaṃ vuttaṃ bhagavatā, siyāpi me brahmacariyassa antarāyo’ti, pakkamitabbaṃ. Anāpatti vassacchedassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Antarāye anāpattivassacchedavāro niṭṭhito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "114. Saṅghabhede anāpattivassacchedavāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "202"
      },
      ". Idha pana, bhikkhave, vassūpagato bhikkhu passati sambahule bhikkhū saṅghabhedāya parakkamante. Tatra ce bhikkhuno evaṃ hoti, ‘garuko kho saṅghabhedo vutto bhagavatā; mā mayi sammukhībhūte saṅgho bhijjī’ti, pakkamitabbaṃ. Anāpatti vassacchedassa."
    ],
    "innerText": "202. Idha pana, bhikkhave, vassūpagato bhikkhu passati sambahule bhikkhū saṅghabhedāya parakkamante. Tatra ce bhikkhuno evaṃ hoti, ‘garuko kho saṅghabhedo vutto bhagavatā; mā mayi sammukhībhūte saṅgho bhijjī’ti, pakkamitabbaṃ. Anāpatti vassacchedassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      " pana, bhikkhave, vassūpagato bhikkhu suṇāti – ‘‘asukasmiṃ kira āvāse sambahulā bhikkhū saṅghabhedāya parakkamantī’’ti. Tatra ce bhikkhuno evaṃ hoti, ‘garuko kho saṅghabhedo vutto bhagavatā; mā mayi sammukhībhūte saṅgho bhijjī’ti, pakkamitabbaṃ. Anāpatti vassacchedassa."
    ],
    "innerText": "Idha pana, bhikkhave, vassūpagato bhikkhu suṇāti – ‘‘asukasmiṃ kira āvāse sambahulā bhikkhū saṅghabhedāya parakkamantī’’ti. Tatra ce bhikkhuno evaṃ hoti, ‘garuko kho saṅghabhedo vutto bhagavatā; mā mayi sammukhībhūte saṅgho bhijjī’ti, pakkamitabbaṃ. Anāpatti vassacchedassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, vassūpagato bhikkhu suṇāti – ‘‘asukasmiṃ kira āvāse sambahulā bhikkhū saṅghabhedāya parakkamantī’’ti. Tatra ce bhikkhuno evaṃ hoti – ‘‘te kho me bhikkhū mittā. Tyāhaṃ vakkhāmi ‘garuko kho, āvuso, saṅghabhedo vutto bhagavatā; māyasmantānaṃ saṅghabhedo ruccitthā’ti. Karissanti ",
      " me vacanaṃ, sussūsissanti, sotaṃ odahissantī’’ti, pakkamitabbaṃ. Anāpatti vassacchedassa."
    ],
    "innerText": "Idha pana, bhikkhave, vassūpagato bhikkhu suṇāti – ‘‘asukasmiṃ kira āvāse sambahulā bhikkhū saṅghabhedāya parakkamantī’’ti. Tatra ce bhikkhuno evaṃ hoti – ‘‘te kho me bhikkhū mittā. Tyāhaṃ vakkhāmi ‘garuko kho, āvuso, saṅghabhedo vutto bhagavatā; māyasmantānaṃ saṅghabhedo ruccitthā’ti. Karissanti me vacanaṃ, sussūsissanti, sotaṃ odahissantī’’ti, pakkamitabbaṃ. Anāpatti vassacchedassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      " pana, bhikkhave, vassūpagato bhikkhu suṇāti – ‘‘asukasmiṃ kira āvāse sambahulā bhikkhū saṅghabhedāya ",
      " parakkamantī’’ti. Tatra ce bhikkhuno evaṃ hoti – ‘‘te kho me bhikkhū na mittā; api ca ye tesaṃ mittā, te me mittā. Tyāhaṃ vakkhāmi. Te vuttā te vakkhanti ‘garuko kho, āvuso, saṅghabhedo vutto bhagavatā; māyasmantānaṃ saṅghabhedo ruccitthā’ti. Karissanti tesaṃ vacanaṃ, sussūsissanti, sotaṃ odahissantī’’ti, pakkamitabbaṃ. Anāpatti vassacchedassa."
    ],
    "innerText": "Idha pana, bhikkhave, vassūpagato bhikkhu suṇāti – ‘‘asukasmiṃ kira āvāse sambahulā bhikkhū saṅghabhedāya parakkamantī’’ti. Tatra ce bhikkhuno evaṃ hoti – ‘‘te kho me bhikkhū na mittā; api ca ye tesaṃ mittā, te me mittā. Tyāhaṃ vakkhāmi. Te vuttā te vakkhanti ‘garuko kho, āvuso, saṅghabhedo vutto bhagavatā; māyasmantānaṃ saṅghabhedo ruccitthā’ti. Karissanti tesaṃ vacanaṃ, sussūsissanti, sotaṃ odahissantī’’ti, pakkamitabbaṃ. Anāpatti vassacchedassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, vassūpagato bhikkhu suṇāti – ‘‘asukasmiṃ kira āvāse sambahulehi bhikkhūhi saṅgho bhinno’’ti. Tatra ce bhikkhuno evaṃ hoti – ‘‘te kho me bhikkhū mittā. Tyāhaṃ vakkhāmi ‘garuko kho, āvuso, saṅghabhedo vutto bhagavatā; māyasmantānaṃ saṅghabhedo ruccitthā’ti. Karissanti me vacanaṃ, sussūsissanti, sotaṃ odahissantī’’ti, pakkamitabbaṃ. Anāpatti vassacchedassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, vassūpagato bhikkhu suṇāti – ‘‘asukasmiṃ kira āvāse sambahulehi bhikkhūhi saṅgho bhinno’’ti. Tatra ce bhikkhuno evaṃ hoti – ‘‘te kho me bhikkhū na mittā; api ca, ye tesaṃ mittā te me mittā. Tyāhaṃ vakkhāmi. Te vuttā te vakkhanti ‘garuko kho, āvuso, saṅghabhedo vutto bhagavatā; māyasmantānaṃ saṅghabhedo ruccitthā’ti. Karissanti tesaṃ vacanaṃ, sussūsissanti ",
      ", sotaṃ odahissantī’’ti, pakkamitabbaṃ. Anāpatti vassacchedassa."
    ],
    "innerText": "Idha pana, bhikkhave, vassūpagato bhikkhu suṇāti – ‘‘asukasmiṃ kira āvāse sambahulehi bhikkhūhi saṅgho bhinno’’ti. Tatra ce bhikkhuno evaṃ hoti – ‘‘te kho me bhikkhū na mittā; api ca, ye tesaṃ mittā te me mittā. Tyāhaṃ vakkhāmi. Te vuttā te vakkhanti ‘garuko kho, āvuso, saṅghabhedo vutto bhagavatā; māyasmantānaṃ saṅghabhedo ruccitthā’ti. Karissanti tesaṃ vacanaṃ, sussūsissanti , sotaṃ odahissantī’’ti, pakkamitabbaṃ. Anāpatti vassacchedassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      " pana, bhikkhave, vassūpagato bhikkhu ",
      " suṇāti – ‘‘amukasmiṃ kira āvāse sambahulā bhikkhuniyo saṅghabhedāya parakkamantī’’ti. Tatra ce bhikkhuno evaṃ hoti – ‘‘tā kho me bhikkhuniyo mittā. Tāhaṃ vakkhāmi ‘garuko kho, bhaginiyo, saṅghabhedo vutto bhagavatā; mā bhaginīnaṃ saṅghabhedo ruccitthā’ti. Karissanti me vacanaṃ, sussūsissanti, sotaṃ odahissantī’’ti, pakkamitabbaṃ. Anāpatti vassacchedassa."
    ],
    "innerText": "Idha pana, bhikkhave, vassūpagato bhikkhu suṇāti – ‘‘amukasmiṃ kira āvāse sambahulā bhikkhuniyo saṅghabhedāya parakkamantī’’ti. Tatra ce bhikkhuno evaṃ hoti – ‘‘tā kho me bhikkhuniyo mittā. Tāhaṃ vakkhāmi ‘garuko kho, bhaginiyo, saṅghabhedo vutto bhagavatā; mā bhaginīnaṃ saṅghabhedo ruccitthā’ti. Karissanti me vacanaṃ, sussūsissanti, sotaṃ odahissantī’’ti, pakkamitabbaṃ. Anāpatti vassacchedassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, vassūpagato bhikkhu suṇāti – ‘‘amukasmiṃ kira āvāse sambahulā bhikkhuniyo saṅghabhedāya parakkamantī’’ti. Tatra ce bhikkhuno evaṃ hoti – ‘‘tā kho me bhikkhuniyo na mittā. Api ca, yā tāsaṃ mittā, tā me mittā. Tāhaṃ vakkhāmi. Tā vuttā tā vakkhanti ‘garuko ",
      " kho, bhaginiyo, saṅghabhedo vutto bhagavatā. Mā bhaginīnaṃ saṅghabhedo ruccitthā’ti. Karissanti tāsaṃ vacanaṃ, sussūsissanti, sotaṃ odahissantī’’ti, pakkamitabbaṃ. Anāpatti vassacchedassati."
    ],
    "innerText": "Idha pana, bhikkhave, vassūpagato bhikkhu suṇāti – ‘‘amukasmiṃ kira āvāse sambahulā bhikkhuniyo saṅghabhedāya parakkamantī’’ti. Tatra ce bhikkhuno evaṃ hoti – ‘‘tā kho me bhikkhuniyo na mittā. Api ca, yā tāsaṃ mittā, tā me mittā. Tāhaṃ vakkhāmi. Tā vuttā tā vakkhanti ‘garuko kho, bhaginiyo, saṅghabhedo vutto bhagavatā. Mā bhaginīnaṃ saṅghabhedo ruccitthā’ti. Karissanti tāsaṃ vacanaṃ, sussūsissanti, sotaṃ odahissantī’’ti, pakkamitabbaṃ. Anāpatti vassacchedassati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, vassūpagato bhikkhu suṇāti – ‘‘amukasmiṃ kira āvāse sambahulāhi bhikkhunīhi saṅgho bhinno’’ti. Tatra ce bhikkhuno evaṃ hoti – ‘‘tā kho me bhikkhuniyo mittā. Tāhaṃ vakkhāmi ‘garuko kho, bhaginiyo, saṅghabhedo vutto bhagavatā. Mā bhaginīnaṃ saṅghabhedo ruccitthā’ti. Karissanti me vacanaṃ, sussūsissanti, sotaṃ odahissantī’’ti, pakkamitabbaṃ. Anāpatti vassacchedassati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, vassūpagato bhikkhu suṇāti – ‘‘amukasmiṃ kira āvāse sambahulāhi bhikkhunīhi saṅgho bhinno’’ti. Tatra ce bhikkhuno evaṃ hoti – ‘‘tā kho me bhikkhuniyo na mittā. Api ca, yā tāsaṃ mittā tā me mittā. Tāhaṃ vakkhāmi. Tā vuttā tā vakkhanti ‘garuko kho, bhaginiyo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ayyāyo (sī.)]"
      },
      ", saṅghabhedo vutto bhagavatā; mā bhaginīnaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ayyānaṃ (sī.)]"
      },
      " saṅghabhedo ruccitthā’ti. Karissanti tāsaṃ vacanaṃ, sussūsissanti, sotaṃ odahissantī’’ti, pakkamitabbaṃ. Anāpatti vassacchedassāti."
    ],
    "innerText": "Idha pana, bhikkhave, vassūpagato bhikkhu suṇāti – ‘‘amukasmiṃ kira āvāse sambahulāhi bhikkhunīhi saṅgho bhinno’’ti. Tatra ce bhikkhuno evaṃ hoti – ‘‘tā kho me bhikkhuniyo na mittā. Api ca, yā tāsaṃ mittā tā me mittā. Tāhaṃ vakkhāmi. Tā vuttā tā vakkhanti ‘garuko kho, bhaginiyo [ayyāyo (sī.)], saṅghabhedo vutto bhagavatā; mā bhaginīnaṃ [ayyānaṃ (sī.)] saṅghabhedo ruccitthā’ti. Karissanti tāsaṃ vacanaṃ, sussūsissanti, sotaṃ odahissantī’’ti, pakkamitabbaṃ. Anāpatti vassacchedassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Saṅghabhede anāpattivassacchedavāro niṭṭhito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "115. Vajādīsu vassūpagamanaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "203"
      },
      ". Tena ",
      " kho pana samayena aññataro bhikkhu vaje vassaṃ upagantukāmo ",
      " hoti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, vaje vassaṃ upagantunti. Vajo vuṭṭhāsi. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, yena vajo tena gantunti."
    ],
    "innerText": "203. Tena kho pana samayena aññataro bhikkhu vaje vassaṃ upagantukāmo hoti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, vaje vassaṃ upagantunti. Vajo vuṭṭhāsi. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, yena vajo tena gantunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena kho pana samayena aññataro bhikkhu upakaṭṭhāya vassūpanāyikāya satthena gantukāmo hoti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, satthe vassaṃ upagantunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena kho pana samayena aññataro bhikkhu upakaṭṭhāya vassūpanāyikāya nāvāya gantukāmo hoti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, nāvāya vassaṃ upagantunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vajādīsu vassūpagamanaṃ niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "116. Vassaṃ anupagantabbaṭṭhānāni"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "204"
      },
      ". Tena ",
      " kho pana samayena bhikkhū rukkhasusire vassaṃ upagacchanti. Manussā ujjhāyanti khiyyanti vipācenti – ‘‘seyyathāpi pisācillikā’’ti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, rukkhasusire ",
      " vassaṃ upagantabbaṃ. Yo upagaccheyya, āpatti dukkaṭassāti."
    ],
    "innerText": "204. Tena kho pana samayena bhikkhū rukkhasusire vassaṃ upagacchanti. Manussā ujjhāyanti khiyyanti vipācenti – ‘‘seyyathāpi pisācillikā’’ti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, rukkhasusire vassaṃ upagantabbaṃ. Yo upagaccheyya, āpatti dukkaṭassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena kho pana samayena bhikkhū rukkhaviṭabhiyā vassaṃ upagacchanti. Manussā ujjhāyanti khiyyanti vipācenti – ‘‘seyyathāpi migaluddakā’’ti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, rukkhaviṭabhiyā vassaṃ upagantabbaṃ. Yo upagaccheyya, āpatti dukkaṭassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena kho pana samayena bhikkhū ajjhokāse vassaṃ upagacchanti. Deve vassante rukkhamūlampi ",
      " nibbakosampi upadhāvanti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, ajjhokāse vassaṃ upagantabbaṃ. Yo upagaccheyya, āpatti dukkaṭassāti."
    ],
    "innerText": "Tena kho pana samayena bhikkhū ajjhokāse vassaṃ upagacchanti. Deve vassante rukkhamūlampi nibbakosampi upadhāvanti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, ajjhokāse vassaṃ upagantabbaṃ. Yo upagaccheyya, āpatti dukkaṭassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena kho pana samayena bhikkhū asenāsanikā vassaṃ upagacchanti. Sītenapi kilamanti, uṇhenapi kilamanti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, asenāsanikena vassaṃ upagantabbaṃ. Yo upagaccheyya, āpatti dukkaṭassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena kho pana samayena bhikkhū chavakuṭikāya vassaṃ upagacchanti. Manussā ujjhāyanti khiyyanti vipācenti – ‘‘seyyathāpi chavaḍāhakā’’ti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, chavakuṭikāya vassaṃ upagantabbaṃ. Yo upagaccheyya, āpatti dukkaṭassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena kho pana samayena bhikkhū chatte vassaṃ upagacchanti. Manussā ujjhāyanti khiyyanti vipācenti – ‘‘seyyathāpi gopālakā’’ti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, chatte vassaṃ upagantabbaṃ. Yo upagaccheyya, āpatti dukkaṭassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena ",
      " kho pana samayena bhikkhū ",
      " cāṭiyā vassaṃ upagacchanti. Manussā ujjhāyanti khiyyanti vipācenti – ‘‘seyyathāpi titthiyā’’ti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, cāṭiyā vassaṃ upagantabbaṃ. Yo upagaccheyya, āpatti dukkaṭassāti."
    ],
    "innerText": "Tena kho pana samayena bhikkhū cāṭiyā vassaṃ upagacchanti. Manussā ujjhāyanti khiyyanti vipācenti – ‘‘seyyathāpi titthiyā’’ti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, cāṭiyā vassaṃ upagantabbaṃ. Yo upagaccheyya, āpatti dukkaṭassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vassaṃ anupagantabbaṭṭhānāni niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "117. Adhammikakatikā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "205"
      },
      ". Tena ",
      " kho pana samayena sāvatthiyā saṅghena evarūpā katikā katā hoti – antarāvassaṃ na pabbājetabbanti. Visākhāya migāramātuyā nattā bhikkhū upasaṅkamitvā pabbajjaṃ yāci. Bhikkhū evamāhaṃsu – ‘‘saṅghena kho, āvuso, evarūpā katikā katā ‘antarāvassaṃ na pabbājetabba’nti. Āgamehi, āvuso, yāva bhikkhū vassaṃ vasanti. Vassaṃvuṭṭhā pabbājessantī’’ti. Atha kho te bhikkhū vassaṃvuṭṭhā visākhāya migāramātuyā nattāraṃ etadavocuṃ – ‘‘ehi, dāni, āvuso, pabbajāhī’’ti. So evamāha – ‘‘sacāhaṃ, bhante, pabbajito assaṃ, abhirameyyāmahaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[abhirameyyaṃ cāhaṃ (sī.)]"
      },
      ". Na dānāhaṃ, bhante, pabbajissāmī’’ti. Visākhā migāramātā ",
      " ujjhāyati khiyyati vipāceti – ‘‘kathañhi nāma ayyā evarūpaṃ katikaṃ karissanti ‘na antarāvassaṃ pabbājetabba’nti. Kaṃ kālaṃ dhammo na caritabbo’’ti? Assosuṃ kho bhikkhū visākhāya migāramātuyā ujjhāyantiyā khiyyantiyā vipācentiyā. Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, evarūpā katikā kātabbā – ‘na antarāvassaṃ pabbājetabba’nti. Yo kareyya, āpatti dukkaṭassāti."
    ],
    "innerText": "205. Tena kho pana samayena sāvatthiyā saṅghena evarūpā katikā katā hoti – antarāvassaṃ na pabbājetabbanti. Visākhāya migāramātuyā nattā bhikkhū upasaṅkamitvā pabbajjaṃ yāci. Bhikkhū evamāhaṃsu – ‘‘saṅghena kho, āvuso, evarūpā katikā katā ‘antarāvassaṃ na pabbājetabba’nti. Āgamehi, āvuso, yāva bhikkhū vassaṃ vasanti. Vassaṃvuṭṭhā pabbājessantī’’ti. Atha kho te bhikkhū vassaṃvuṭṭhā visākhāya migāramātuyā nattāraṃ etadavocuṃ – ‘‘ehi, dāni, āvuso, pabbajāhī’’ti. So evamāha – ‘‘sacāhaṃ, bhante, pabbajito assaṃ, abhirameyyāmahaṃ [abhirameyyaṃ cāhaṃ (sī.)]. Na dānāhaṃ, bhante, pabbajissāmī’’ti. Visākhā migāramātā ujjhāyati khiyyati vipāceti – ‘‘kathañhi nāma ayyā evarūpaṃ katikaṃ karissanti ‘na antarāvassaṃ pabbājetabba’nti. Kaṃ kālaṃ dhammo na caritabbo’’ti? Assosuṃ kho bhikkhū visākhāya migāramātuyā ujjhāyantiyā khiyyantiyā vipācentiyā. Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, evarūpā katikā kātabbā – ‘na antarāvassaṃ pabbājetabba’nti. Yo kareyya, āpatti dukkaṭassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Adhammikakatikā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "118. Paṭissavadukkaṭāpatti"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "206"
      },
      ". Tena kho pana samayena āyasmatā upanandena sakyaputtena ",
      " rañño pasenadissa kosalassa vassāvāso paṭissuto hoti purimikāya. So taṃ āvāsaṃ gacchanto addasa antarāmagge dve āvāse bahucīvarake. Tassa etadahosi – ‘‘yaṃnūnāhaṃ imesu dvīsu āvāsesu vassaṃ vaseyyaṃ. Evaṃ me bahuṃ cīvaraṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[bahucīvaraṃ (ka.)]"
      },
      " uppajjissatī’’ti. So tesu dvīsu āvāsesu vassaṃ vasi. Rājā pasenadi kosalo ujjhāyati khiyyati vipāceti – ‘‘kathañhi nāma ayyo upanando sakyaputto amhākaṃ vassāvāsaṃ paṭissuṇitvā visaṃvādessati. Nanu bhagavatā anekapariyāyena musāvādo garahito, musāvādā veramaṇī pasatthā’’ti. Assosuṃ kho bhikkhū rañño pasenadissa kosalassa ujjhāyantassa khiyyantassa vipācentassa. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma āyasmā ",
      " upanando sakyaputto ",
      " rañño pasenadissa kosalassa vassāvāsaṃ paṭissuṇitvā visaṃvādessati. Nanu bhagavatā anekapariyāyena musāvādo garahito, musāvādā veramaṇī pasatthā’’ti. Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe bhikkhusaṅghaṃ sannipātāpetvā āyasmantaṃ upanandaṃ sakyaputtaṃ paṭipucchi – ‘‘saccaṃ kira tvaṃ, upananda, rañño pasenadissa kosalassa vassāvāsaṃ paṭissuṇitvā visaṃvādesī’’ti? ‘‘Saccaṃ, bhagavā’’ti. Vigarahi buddho bhagavā…pe… kathañhi nāma tvaṃ, moghapurisa, rañño pasenadissa kosalassa vassāvāsaṃ paṭissuṇitvā visaṃvādessasi. Nanu mayā, moghapurisa, anekapariyāyena ",
      " musāvādo garahito, musāvādā veramaṇī pasatthā. Netaṃ, moghapurisa, appasannānaṃ vā pasādāya…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi –"
    ],
    "innerText": "206. Tena kho pana samayena āyasmatā upanandena sakyaputtena rañño pasenadissa kosalassa vassāvāso paṭissuto hoti purimikāya. So taṃ āvāsaṃ gacchanto addasa antarāmagge dve āvāse bahucīvarake. Tassa etadahosi – ‘‘yaṃnūnāhaṃ imesu dvīsu āvāsesu vassaṃ vaseyyaṃ. Evaṃ me bahuṃ cīvaraṃ [bahucīvaraṃ (ka.)] uppajjissatī’’ti. So tesu dvīsu āvāsesu vassaṃ vasi. Rājā pasenadi kosalo ujjhāyati khiyyati vipāceti – ‘‘kathañhi nāma ayyo upanando sakyaputto amhākaṃ vassāvāsaṃ paṭissuṇitvā visaṃvādessati. Nanu bhagavatā anekapariyāyena musāvādo garahito, musāvādā veramaṇī pasatthā’’ti. Assosuṃ kho bhikkhū rañño pasenadissa kosalassa ujjhāyantassa khiyyantassa vipācentassa. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma āyasmā upanando sakyaputto rañño pasenadissa kosalassa vassāvāsaṃ paṭissuṇitvā visaṃvādessati. Nanu bhagavatā anekapariyāyena musāvādo garahito, musāvādā veramaṇī pasatthā’’ti. Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe bhikkhusaṅghaṃ sannipātāpetvā āyasmantaṃ upanandaṃ sakyaputtaṃ paṭipucchi – ‘‘saccaṃ kira tvaṃ, upananda, rañño pasenadissa kosalassa vassāvāsaṃ paṭissuṇitvā visaṃvādesī’’ti? ‘‘Saccaṃ, bhagavā’’ti. Vigarahi buddho bhagavā…pe… kathañhi nāma tvaṃ, moghapurisa, rañño pasenadissa kosalassa vassāvāsaṃ paṭissuṇitvā visaṃvādessasi. Nanu mayā, moghapurisa, anekapariyāyena musāvādo garahito, musāvādā veramaṇī pasatthā. Netaṃ, moghapurisa, appasannānaṃ vā pasādāya…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "207"
      },
      ". Idha ",
      " pana, bhikkhave, bhikkhunā vassāvāso paṭissuto hoti purimikāya. So taṃ āvāsaṃ gacchanto passati antarāmagge dve āvāse bahucīvarake. Tassa evaṃ hoti – ‘‘yaṃnūnāhaṃ imesu dvīsu āvāsesu vassaṃ vaseyyaṃ. Evaṃ me bahuṃ cīvaraṃ uppajjissatī’’ti. So tesu dvīsu āvāsesu vassaṃ vasati. Tassa, bhikkhave, bhikkhuno purimikā ca na paññāyati, paṭissave ca āpatti dukkaṭassa."
    ],
    "innerText": "207. Idha pana, bhikkhave, bhikkhunā vassāvāso paṭissuto hoti purimikāya. So taṃ āvāsaṃ gacchanto passati antarāmagge dve āvāse bahucīvarake. Tassa evaṃ hoti – ‘‘yaṃnūnāhaṃ imesu dvīsu āvāsesu vassaṃ vaseyyaṃ. Evaṃ me bahuṃ cīvaraṃ uppajjissatī’’ti. So tesu dvīsu āvāsesu vassaṃ vasati. Tassa, bhikkhave, bhikkhuno purimikā ca na paññāyati, paṭissave ca āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, bhikkhunā vassāvāso paṭissuto hoti purimikāya. So taṃ āvāsaṃ gacchanto bahiddhā uposathaṃ karoti, pāṭipade ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pāṭipadena (ka.)]"
      },
      " vihāraṃ upeti, senāsanaṃ paññapeti, pānīyaṃ paribhojanīyaṃ upaṭṭhāpeti, pariveṇaṃ sammajjati. So tadaheva akaraṇīyo pakkamati. Tassa, bhikkhave, bhikkhuno purimikā ca na paññāyati, paṭissave ca āpatti dukkaṭassa."
    ],
    "innerText": "Idha pana, bhikkhave, bhikkhunā vassāvāso paṭissuto hoti purimikāya. So taṃ āvāsaṃ gacchanto bahiddhā uposathaṃ karoti, pāṭipade [pāṭipadena (ka.)] vihāraṃ upeti, senāsanaṃ paññapeti, pānīyaṃ paribhojanīyaṃ upaṭṭhāpeti, pariveṇaṃ sammajjati. So tadaheva akaraṇīyo pakkamati. Tassa, bhikkhave, bhikkhuno purimikā ca na paññāyati, paṭissave ca āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, bhikkhunā vassāvāso paṭissuto hoti purimikāya. So taṃ āvāsaṃ gacchanto bahiddhā uposathaṃ karoti, pāṭipade vihāraṃ upeti, senāsanaṃ paññapeti, pānīyaṃ paribhojanīyaṃ upaṭṭhāpeti, pariveṇaṃ sammajjati. So tadaheva sakaraṇīyo pakkamati. Tassa ",
      ", bhikkhave, bhikkhuno purimikā ca na paññāyati, paṭissave ca āpatti dukkaṭassa."
    ],
    "innerText": "Idha pana, bhikkhave, bhikkhunā vassāvāso paṭissuto hoti purimikāya. So taṃ āvāsaṃ gacchanto bahiddhā uposathaṃ karoti, pāṭipade vihāraṃ upeti, senāsanaṃ paññapeti, pānīyaṃ paribhojanīyaṃ upaṭṭhāpeti, pariveṇaṃ sammajjati. So tadaheva sakaraṇīyo pakkamati. Tassa , bhikkhave, bhikkhuno purimikā ca na paññāyati, paṭissave ca āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, bhikkhunā vassāvāso paṭissuto hoti purimikāya. So taṃ āvāsaṃ gacchanto ",
      " bahiddhā uposathaṃ karoti, pāṭipade vihāraṃ upeti, senāsanaṃ paññapeti, pānīyaṃ paribhojanīyaṃ upaṭṭhāpeti, pariveṇaṃ sammajjati. So dvīhatīhaṃ vasitvā akaraṇīyo pakkamati. Tassa, bhikkhave, bhikkhuno purimikā ca na paññāyati, paṭissave ca āpatti dukkaṭassa."
    ],
    "innerText": "Idha pana, bhikkhave, bhikkhunā vassāvāso paṭissuto hoti purimikāya. So taṃ āvāsaṃ gacchanto bahiddhā uposathaṃ karoti, pāṭipade vihāraṃ upeti, senāsanaṃ paññapeti, pānīyaṃ paribhojanīyaṃ upaṭṭhāpeti, pariveṇaṃ sammajjati. So dvīhatīhaṃ vasitvā akaraṇīyo pakkamati. Tassa, bhikkhave, bhikkhuno purimikā ca na paññāyati, paṭissave ca āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, bhikkhunā vassāvāso paṭissuto hoti purimikāya. So taṃ āvāsaṃ gacchanto bahiddhā uposathaṃ karoti, pāṭipade vihāraṃ upeti, senāsanaṃ paññapeti, pānīyaṃ paribhojanīyaṃ upaṭṭhāpeti, pariveṇaṃ sammajjati. So dvīhatīhaṃ vasitvā sakaraṇīyo pakkamati. Tassa, bhikkhave, bhikkhuno purimikā ca na paññāyati, paṭissave ca āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, bhikkhunā vassāvāso paṭissuto hoti purimikāya. So taṃ āvāsaṃ ",
      " gacchanto bahiddhā uposathaṃ karoti, pāṭipade vihāraṃ upeti, senāsanaṃ paññapeti, pānīyaṃ paribhojanīyaṃ upaṭṭhāpeti, pariveṇaṃ sammajjati. So dvīhatīhaṃ vasitvā sattāhakaraṇīyena pakkamati. So taṃ sattāhaṃ bahiddhā vītināmeti. Tassa, bhikkhave, bhikkhuno purimikā ca na paññāyati, paṭissave ca āpatti dukkaṭassa."
    ],
    "innerText": "Idha pana, bhikkhave, bhikkhunā vassāvāso paṭissuto hoti purimikāya. So taṃ āvāsaṃ gacchanto bahiddhā uposathaṃ karoti, pāṭipade vihāraṃ upeti, senāsanaṃ paññapeti, pānīyaṃ paribhojanīyaṃ upaṭṭhāpeti, pariveṇaṃ sammajjati. So dvīhatīhaṃ vasitvā sattāhakaraṇīyena pakkamati. So taṃ sattāhaṃ bahiddhā vītināmeti. Tassa, bhikkhave, bhikkhuno purimikā ca na paññāyati, paṭissave ca āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, bhikkhunā vassāvāso paṭissuto hoti purimikāya. So taṃ āvāsaṃ gacchanto bahiddhā uposathaṃ karoti, pāṭipade vihāraṃ upeti, senāsanaṃ paññapeti, pānīyaṃ paribhojanīyaṃ upaṭṭhāpeti, pariveṇaṃ sammajjati. So dvīhatīhaṃ vasitvā sattāhakaraṇīyena pakkamati ",
      ". So taṃ sattāhaṃ anto sannivattaṃ karoti. Tassa, bhikkhave, bhikkhuno purimikā ca paññāyati, paṭissave ca anāpatti."
    ],
    "innerText": "Idha pana, bhikkhave, bhikkhunā vassāvāso paṭissuto hoti purimikāya. So taṃ āvāsaṃ gacchanto bahiddhā uposathaṃ karoti, pāṭipade vihāraṃ upeti, senāsanaṃ paññapeti, pānīyaṃ paribhojanīyaṃ upaṭṭhāpeti, pariveṇaṃ sammajjati. So dvīhatīhaṃ vasitvā sattāhakaraṇīyena pakkamati . So taṃ sattāhaṃ anto sannivattaṃ karoti. Tassa, bhikkhave, bhikkhuno purimikā ca paññāyati, paṭissave ca anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave ",
      ", bhikkhunā vassāvāso paṭissuto hoti purimikāya. So taṃ āvāsaṃ gacchanto bahiddhā uposathaṃ karoti, pāṭipade vihāraṃ upeti, senāsanaṃ paññapeti, pānīyaṃ paribhojanīyaṃ upaṭṭhāpeti ",
      ", pariveṇaṃ sammajjati. So sattāhaṃ anāgatāya pavāraṇāya sakaraṇīyo pakkamati. Āgaccheyya vā so, bhikkhave, bhikkhu taṃ āvāsaṃ na vā āgaccheyya, tassa, bhikkhave, bhikkhuno purimikā ca paññāyati, paṭissave ca anāpatti."
    ],
    "innerText": "Idha pana, bhikkhave , bhikkhunā vassāvāso paṭissuto hoti purimikāya. So taṃ āvāsaṃ gacchanto bahiddhā uposathaṃ karoti, pāṭipade vihāraṃ upeti, senāsanaṃ paññapeti, pānīyaṃ paribhojanīyaṃ upaṭṭhāpeti , pariveṇaṃ sammajjati. So sattāhaṃ anāgatāya pavāraṇāya sakaraṇīyo pakkamati. Āgaccheyya vā so, bhikkhave, bhikkhu taṃ āvāsaṃ na vā āgaccheyya, tassa, bhikkhave, bhikkhuno purimikā ca paññāyati, paṭissave ca anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, bhikkhunā vassāvāso paṭissuto hoti purimikāya. So taṃ āvāsaṃ gantvā uposathaṃ karoti, pāṭipade vihāraṃ upeti, senāsanaṃ paññapeti, pānīyaṃ paribhojanīyaṃ upaṭṭhāpeti, pariveṇaṃ sammajjati. So tadaheva akaraṇīyo pakkamati. Tassa, bhikkhave, bhikkhuno purimikā ca na paññāyati, paṭissave ca āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, bhikkhunā vassāvāso paṭissuto hoti purimikāya. So taṃ āvāsaṃ gantvā uposathaṃ karoti, pāṭipade vihāraṃ upeti, senāsanaṃ paññapeti, pānīyaṃ paribhojanīyaṃ upaṭṭhāpeti, pariveṇaṃ sammajjati. So tadaheva sakaraṇīyo pakkamati…pe… so dvīhatīhaṃ vasitvā akaraṇīyo pakkamati…pe… so dvīhatīhaṃ vasitvā sakaraṇīyo pakkamati…pe… so dvīhatīhaṃ vasitvā sattāhakaraṇīyena pakkamati. So taṃ sattāhaṃ bahiddhā vītināmeti. Tassa, bhikkhave, bhikkhuno purimikā ca na paññāyati, paṭissave ca āpatti dukkaṭassa…pe… ",
      " so dvīhatīhaṃ vasitvā sattāhakaraṇīyena pakkamati. So taṃ sattāhaṃ anto sannivattaṃ karoti. Tassa, bhikkhave, bhikkhuno purimikā ca paññāyati, paṭissave ",
      " ca anāpatti…pe… so sattāhaṃ anāgatāya pavāraṇāya sakaraṇīyo pakkamati. Āgaccheyya vā so, bhikkhave, bhikkhu taṃ āvāsaṃ na vā āgaccheyya, tassa, bhikkhave, bhikkhuno purimikā ca paññāyati, paṭissave ca anāpatti."
    ],
    "innerText": "Idha pana, bhikkhave, bhikkhunā vassāvāso paṭissuto hoti purimikāya. So taṃ āvāsaṃ gantvā uposathaṃ karoti, pāṭipade vihāraṃ upeti, senāsanaṃ paññapeti, pānīyaṃ paribhojanīyaṃ upaṭṭhāpeti, pariveṇaṃ sammajjati. So tadaheva sakaraṇīyo pakkamati…pe… so dvīhatīhaṃ vasitvā akaraṇīyo pakkamati…pe… so dvīhatīhaṃ vasitvā sakaraṇīyo pakkamati…pe… so dvīhatīhaṃ vasitvā sattāhakaraṇīyena pakkamati. So taṃ sattāhaṃ bahiddhā vītināmeti. Tassa, bhikkhave, bhikkhuno purimikā ca na paññāyati, paṭissave ca āpatti dukkaṭassa…pe… so dvīhatīhaṃ vasitvā sattāhakaraṇīyena pakkamati. So taṃ sattāhaṃ anto sannivattaṃ karoti. Tassa, bhikkhave, bhikkhuno purimikā ca paññāyati, paṭissave ca anāpatti…pe… so sattāhaṃ anāgatāya pavāraṇāya sakaraṇīyo pakkamati. Āgaccheyya vā so, bhikkhave, bhikkhu taṃ āvāsaṃ na vā āgaccheyya, tassa, bhikkhave, bhikkhuno purimikā ca paññāyati, paṭissave ca anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "208"
      },
      ". Idha pana, bhikkhave, bhikkhunā vassāvāso paṭissuto hoti pacchimikāya. So taṃ āvāsaṃ gacchanto bahiddhā uposathaṃ karoti, pāṭipade vihāraṃ upeti, senāsanaṃ paññapeti, pānīyaṃ paribhojanīyaṃ upaṭṭhāpeti, pariveṇaṃ sammajjati. So tadaheva akaraṇīyo pakkamati. Tassa, bhikkhave, bhikkhuno pacchimikā ca na paññāyati, paṭissave ca āpatti dukkaṭassa."
    ],
    "innerText": "208. Idha pana, bhikkhave, bhikkhunā vassāvāso paṭissuto hoti pacchimikāya. So taṃ āvāsaṃ gacchanto bahiddhā uposathaṃ karoti, pāṭipade vihāraṃ upeti, senāsanaṃ paññapeti, pānīyaṃ paribhojanīyaṃ upaṭṭhāpeti, pariveṇaṃ sammajjati. So tadaheva akaraṇīyo pakkamati. Tassa, bhikkhave, bhikkhuno pacchimikā ca na paññāyati, paṭissave ca āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      " pana, bhikkhave, bhikkhunā vassāvāso paṭissuto hoti pacchimikāya. So taṃ āvāsaṃ gacchanto bahiddhā uposathaṃ karoti, pāṭipade vihāraṃ upeti, senāsanaṃ paññapeti, pānīyaṃ paribhojanīyaṃ upaṭṭhāpeti, pariveṇaṃ sammajjati. So tadaheva sakaraṇīyo pakkamati. Tassa, bhikkhave, bhikkhuno pacchimikā ca na paññāyati, paṭissave ca āpatti dukkaṭassa."
    ],
    "innerText": "Idha pana, bhikkhave, bhikkhunā vassāvāso paṭissuto hoti pacchimikāya. So taṃ āvāsaṃ gacchanto bahiddhā uposathaṃ karoti, pāṭipade vihāraṃ upeti, senāsanaṃ paññapeti, pānīyaṃ paribhojanīyaṃ upaṭṭhāpeti, pariveṇaṃ sammajjati. So tadaheva sakaraṇīyo pakkamati. Tassa, bhikkhave, bhikkhuno pacchimikā ca na paññāyati, paṭissave ca āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, bhikkhunā vassāvāso paṭissuto hoti pacchimikāya. So taṃ āvāsaṃ gacchanto bahiddhā uposathaṃ karoti, pāṭipade vihāraṃ upeti, senāsanaṃ paññapeti, pānīyaṃ paribhojanīyaṃ upaṭṭhāpeti, pariveṇaṃ sammajjati. So dvīhatīhaṃ vasitvā akaraṇīyo pakkamati ",
      ". Tassa, bhikkhave, bhikkhuno pacchimikā ca na paññāyati, paṭissave ca āpatti dukkaṭassa."
    ],
    "innerText": "Idha pana, bhikkhave, bhikkhunā vassāvāso paṭissuto hoti pacchimikāya. So taṃ āvāsaṃ gacchanto bahiddhā uposathaṃ karoti, pāṭipade vihāraṃ upeti, senāsanaṃ paññapeti, pānīyaṃ paribhojanīyaṃ upaṭṭhāpeti, pariveṇaṃ sammajjati. So dvīhatīhaṃ vasitvā akaraṇīyo pakkamati . Tassa, bhikkhave, bhikkhuno pacchimikā ca na paññāyati, paṭissave ca āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, bhikkhunā vassāvāso paṭissuto hoti pacchimikāya. So taṃ āvāsaṃ gacchanto bahiddhā uposathaṃ karoti, pāṭipade vihāraṃ upeti, senāsanaṃ paññapeti, pānīyaṃ paribhojanīyaṃ upaṭṭhāpeti, pariveṇaṃ sammajjati. So dvīhatīhaṃ vasitvā sakaraṇīyo pakkamati. Tassa, bhikkhave, bhikkhuno pacchimikā ca na paññāyati, paṭissave ca āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, bhikkhunā vassāvāso paṭissuto hoti pacchimikāya. So taṃ āvāsaṃ gacchanto bahiddhā uposathaṃ karoti, pāṭipade vihāraṃ upeti, senāsanaṃ paññapeti, pānīyaṃ ",
      " paribhojanīyaṃ upaṭṭhāpeti, pariveṇaṃ sammajjati. So dvīhatīhaṃ vasitvā sattāhakaraṇīyena pakkamati. So taṃ sattāhaṃ bahiddhā vītināmeti. Tassa, bhikkhave, bhikkhuno pacchimikā ca na paññāyati, paṭissave ca āpatti dukkaṭassa."
    ],
    "innerText": "Idha pana, bhikkhave, bhikkhunā vassāvāso paṭissuto hoti pacchimikāya. So taṃ āvāsaṃ gacchanto bahiddhā uposathaṃ karoti, pāṭipade vihāraṃ upeti, senāsanaṃ paññapeti, pānīyaṃ paribhojanīyaṃ upaṭṭhāpeti, pariveṇaṃ sammajjati. So dvīhatīhaṃ vasitvā sattāhakaraṇīyena pakkamati. So taṃ sattāhaṃ bahiddhā vītināmeti. Tassa, bhikkhave, bhikkhuno pacchimikā ca na paññāyati, paṭissave ca āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, bhikkhunā vassāvāso paṭissuto hoti pacchimikāya. So taṃ āvāsaṃ gacchanto bahiddhā uposathaṃ karoti, pāṭipade vihāraṃ upeti, senāsanaṃ paññapeti, pānīyaṃ paribhojanīyaṃ upaṭṭhāpeti, pariveṇaṃ sammajjati. So dvīhatīhaṃ vasitvā sattāhakaraṇīyena pakkamati. So taṃ sattāhaṃ anto sannivattaṃ karoti. Tassa, bhikkhave, bhikkhuno pacchimikā ca paññāyati, paṭissave ca anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      " pana, bhikkhave, bhikkhunā vassāvāso paṭissuto hoti pacchimikāya. So taṃ āvāsaṃ gacchanto bahiddhā uposathaṃ karoti, pāṭipade vihāraṃ upeti, senāsanaṃ paññapeti, pānīyaṃ paribhojanīyaṃ upaṭṭhāpeti, pariveṇaṃ sammajjati. So sattāhaṃ anāgatāya komudiyā cātumāsiniyā sakaraṇīyo pakkamati. Āgaccheyya vā so, bhikkhave, bhikkhu taṃ āvāsaṃ na vā āgaccheyya, tassa, bhikkhave, bhikkhuno pacchimikā ca paññāyati, paṭissave ca anāpatti."
    ],
    "innerText": "Idha pana, bhikkhave, bhikkhunā vassāvāso paṭissuto hoti pacchimikāya. So taṃ āvāsaṃ gacchanto bahiddhā uposathaṃ karoti, pāṭipade vihāraṃ upeti, senāsanaṃ paññapeti, pānīyaṃ paribhojanīyaṃ upaṭṭhāpeti, pariveṇaṃ sammajjati. So sattāhaṃ anāgatāya komudiyā cātumāsiniyā sakaraṇīyo pakkamati. Āgaccheyya vā so, bhikkhave, bhikkhu taṃ āvāsaṃ na vā āgaccheyya, tassa, bhikkhave, bhikkhuno pacchimikā ca paññāyati, paṭissave ca anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, bhikkhunā vassāvāso paṭissuto hoti pacchimikāya. So taṃ āvāsaṃ gantvā uposathaṃ karoti, pāṭipade vihāraṃ upeti, senāsanaṃ paññapeti, pānīyaṃ paribhojanīyaṃ upaṭṭhāpeti, pariveṇaṃ sammajjati. So tadaheva akaraṇīyo pakkamati. Tassa, bhikkhave, bhikkhuno pacchimikā ca na paññāyati, paṭissave ca āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, bhikkhunā vassāvāso paṭissuto hoti pacchimikāya. So taṃ āvāsaṃ gantvā uposathaṃ karoti, pāṭipade vihāraṃ upeti, senāsanaṃ paññapeti, pānīyaṃ paribhojanīyaṃ upaṭṭhāpeti, pariveṇaṃ sammajjati. So tadaheva sakaraṇīyo pakkamati…pe… so dvīhatīhaṃ vasitvā akaraṇīyo pakkamati ",
      " …pe… so dvīhatīhaṃ vasitvā sakaraṇīyo pakkamati…pe… so dvīhatīhaṃ vasitvā sattāhakaraṇīyena pakkamati. So taṃ sattāhaṃ bahiddhā vītināmeti. Tassa, bhikkhave, bhikkhuno pacchimikā ca na paññāyati, paṭissave ca āpatti dukkaṭassa…pe… so dvīhatīhaṃ vasitvā sattāhakaraṇīyena pakkamati. So taṃ sattāhaṃ ",
      " anto sannivattaṃ karoti. Tassa bhikkhave, bhikkhuno pacchimikā ca paññāyati, paṭissave ca anāpatti."
    ],
    "innerText": "Idha pana, bhikkhave, bhikkhunā vassāvāso paṭissuto hoti pacchimikāya. So taṃ āvāsaṃ gantvā uposathaṃ karoti, pāṭipade vihāraṃ upeti, senāsanaṃ paññapeti, pānīyaṃ paribhojanīyaṃ upaṭṭhāpeti, pariveṇaṃ sammajjati. So tadaheva sakaraṇīyo pakkamati…pe… so dvīhatīhaṃ vasitvā akaraṇīyo pakkamati …pe… so dvīhatīhaṃ vasitvā sakaraṇīyo pakkamati…pe… so dvīhatīhaṃ vasitvā sattāhakaraṇīyena pakkamati. So taṃ sattāhaṃ bahiddhā vītināmeti. Tassa, bhikkhave, bhikkhuno pacchimikā ca na paññāyati, paṭissave ca āpatti dukkaṭassa…pe… so dvīhatīhaṃ vasitvā sattāhakaraṇīyena pakkamati. So taṃ sattāhaṃ anto sannivattaṃ karoti. Tassa bhikkhave, bhikkhuno pacchimikā ca paññāyati, paṭissave ca anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, bhikkhunā vassāvāso paṭissuto hoti pacchimikāya. So taṃ āvāsaṃ gantvā uposathaṃ karoti, pāṭipade vihāraṃ upeti, senāsanaṃ paññapeti, pānīyaṃ paribhojanīyaṃ upaṭṭhāpeti, pariveṇaṃ sammajjati. So sattāhaṃ anāgatāya komudiyā cātumāsiniyā sakaraṇīyo pakkamati. Āgaccheyya vā so, bhikkhave, bhikkhu taṃ āvāsaṃ na vā āgaccheyya, tassa, bhikkhave, bhikkhuno pacchimikā ca paññāyati, paṭissave ca anāpattīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṭissavadukkaṭāpatti niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vassūpanāyikakkhandhako tatiyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "119. Tassuddānaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Upagantuṃ ",
      " kadā ceva, kati antarāvassa ca;"
    ],
    "innerText": "Upagantuṃ kadā ceva, kati antarāvassa ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Na icchanti ca sañcicca, ukkaḍḍhituṃ upāsako."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Gilāno ",
      " mātā ca pitā, bhātā ca atha ñātako;"
    ],
    "innerText": "Gilāno mātā ca pitā, bhātā ca atha ñātako;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhikkhugatiko vihāro, vāḷā cāpi sarīsapā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Coro ceva pisācā ca, daḍḍhā tadubhayena ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vūḷhodakena vuṭṭhāsi, bahutarā ca dāyakā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Lūkhappaṇītasappāya, bhesajjupaṭṭhakena ",
      " ca;"
    ],
    "innerText": "Lūkhappaṇītasappāya, bhesajjupaṭṭhakena ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Itthī vesī kumārī ca, paṇḍako ñātakena ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Rājā corā dhuttā nidhi, bhedaaṭṭhavidhena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[bhedā aṭṭhavidhena (sī. syā.)]"
      },
      " ca;"
    ],
    "innerText": "Rājā corā dhuttā nidhi, bhedaaṭṭhavidhena [bhedā aṭṭhavidhena (sī. syā.)] ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vajasatthā ca nāvā ca, susire viṭabhiyā ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Ajjhokāse ",
      " vassāvāso, asenāsanikena ca;"
    ],
    "innerText": "Ajjhokāse vassāvāso, asenāsanikena ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Chavakuṭikā chatte ca, cāṭiyā ca upenti te."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Katikā paṭissuṇitvā, bahiddhā ca uposathā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Purimikā pacchimikā, yathāñāyena yojaye."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Akaraṇī pakkamati, sakaraṇī tatheva ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Dvīhatīhā ca puna ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[dvīhatīhaṃ vasitvāna (sī.)]"
      },
      ", sattāhakaraṇīyena ca."
    ],
    "innerText": "Dvīhatīhā ca puna ca [dvīhatīhaṃ vasitvāna (sī.)], sattāhakaraṇīyena ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sattāhanāgatā ceva, āgaccheyya na eyya vā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vatthuddāne antarikā, tantimaggaṃ nisāmayeti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Imamhi khandhake vatthūni dvepaṇṇāsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vassūpanāyikakkhandhako niṭṭhito."
  }
]