[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "4. Viññattivinicchayakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "21"
      },
      ". Evaṃ ",
      " bhesajjādivinicchayaṃ kathetvā idāni viññattivinicchayaṃ kathetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘viññattīti yācanā’’"
      },
      "tiādimāha. Tattha viññāpanā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "viññatti,"
      },
      " ‘‘iminā no attho’’ti viññāpanā, yācanāti vuttaṃ hoti. Tenāha ‘‘viññattīti yācanā’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatra"
      },
      " viññattiyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ayaṃ"
      },
      " mayā vakkhamāno ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vinicchayo"
      },
      " veditabboti yojanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mūlacchejjāyā"
      },
      "ti (vi. vi. ṭī. 1.342) parasantakabhāvato mocetvā attano eva santakakaraṇavasena. Evaṃ yācato aññātakaviññattidukkaṭañceva dāsapaṭiggahadukkaṭañca hoti ‘‘dāsidāsapaṭiggahaṇā paṭivirato (dī. ni. 1.10, 194) hotī’’ti vacanaṃ nissāya aṭṭhakathāyaṃ paṭikkhittattā. Ñātakapavāritaṭṭhānato pana dāsaṃ mūlacchejjāya yācantassa sādiyanavaseneva dukkaṭaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sakakamma"
      },
      "nti pāṇavadhakammaṃ. Idañca pāṇātipātadosaparihārāya vuttaṃ, na viññattiparihārāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aniyametvāpi na yācitabbā"
      },
      "ti sāmīcidassanatthaṃ vuttaṃ, suddhacittena pana hatthakammaṃ yācantassa āpatti nāma natthi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yadicchakaṃ kārāpetuṃ vaṭṭatī"
      },
      "ti ‘‘hatthakammaṃ yācāmi, dethā’’tiādinā ayācitvāpi ",
      " vaṭṭati, sakiccapasutampi evaṃ kārāpentassa viññatti natthi eva, sāmīcidassanatthaṃ pana vibhajitvā vuttaṃ."
    ],
    "innerText": "21. Evaṃ bhesajjādivinicchayaṃ kathetvā idāni viññattivinicchayaṃ kathetuṃ ‘‘viññattīti yācanā’’tiādimāha. Tattha viññāpanā viññatti, ‘‘iminā no attho’’ti viññāpanā, yācanāti vuttaṃ hoti. Tenāha ‘‘viññattīti yācanā’’ti. Tatra viññattiyaṃ ayaṃ mayā vakkhamāno vinicchayo veditabboti yojanā. Mūlacchejjāyāti (vi. vi. ṭī. 1.342) parasantakabhāvato mocetvā attano eva santakakaraṇavasena. Evaṃ yācato aññātakaviññattidukkaṭañceva dāsapaṭiggahadukkaṭañca hoti ‘‘dāsidāsapaṭiggahaṇā paṭivirato (dī. ni. 1.10, 194) hotī’’ti vacanaṃ nissāya aṭṭhakathāyaṃ paṭikkhittattā. Ñātakapavāritaṭṭhānato pana dāsaṃ mūlacchejjāya yācantassa sādiyanavaseneva dukkaṭaṃ. Sakakammanti pāṇavadhakammaṃ. Idañca pāṇātipātadosaparihārāya vuttaṃ, na viññattiparihārāya. Aniyametvāpi na yācitabbāti sāmīcidassanatthaṃ vuttaṃ, suddhacittena pana hatthakammaṃ yācantassa āpatti nāma natthi. Yadicchakaṃ kārāpetuṃ vaṭṭatīti ‘‘hatthakammaṃ yācāmi, dethā’’tiādinā ayācitvāpi vaṭṭati, sakiccapasutampi evaṃ kārāpentassa viññatti natthi eva, sāmīcidassanatthaṃ pana vibhajitvā vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbakappiyabhāvadīpanattha"
      },
      "nti sabbaso kappiyabhāvadassanatthaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mūlaṃ dethāti vattuṃ vaṭṭatī"
      },
      "ti ‘‘mūlaṃ dassāmā’’ti paṭhamaṃ vuttattā viññatti vā ‘‘mūla’’nti vacanassa kappiyākappiyavatthusāmaññavacanattā akappiyavacanaṃ vā niṭṭhitabhatikiccānaṃ dāpanato akappiyavatthusādiyanaṃ vā na hotīti katvā vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mūlacchejjāya vā"
      },
      "ti idaṃ idha thambhādīnaṃ dāsidāsādibhāvābhāvato vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anajjhāvutthaka"
      },
      "nti apariggahitaṃ, assāmikanti attho."
    ],
    "innerText": "Sabbakappiyabhāvadīpanatthanti sabbaso kappiyabhāvadassanatthaṃ. Mūlaṃ dethāti vattuṃ vaṭṭatīti ‘‘mūlaṃ dassāmā’’ti paṭhamaṃ vuttattā viññatti vā ‘‘mūla’’nti vacanassa kappiyākappiyavatthusāmaññavacanattā akappiyavacanaṃ vā niṭṭhitabhatikiccānaṃ dāpanato akappiyavatthusādiyanaṃ vā na hotīti katvā vuttaṃ. Mūlacchejjāya vāti idaṃ idha thambhādīnaṃ dāsidāsādibhāvābhāvato vuttaṃ. Anajjhāvutthakanti apariggahitaṃ, assāmikanti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "22"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na kevalañca…pe… cīvarādīni kārāpetukāmenā"
      },
      "tiādīsu cīvaraṃ kārāpetukāmassa aññātakaappavāritatantavāyehi hatthakammayācanavasena vāyāpane viññattipaccayā dukkaṭābhāvepi cīvaravāyāpanasikkhāpadena yathārahaṃ pācittiyadukkaṭāni hontīti veditabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akappiyakahāpaṇādi na dātabba"
      },
      "nti kappiyamukhena laddhampi tattha kammakaraṇatthāya imassa kahāpaṇaṃ dehīti vatvā ‘‘dātuṃ vaṭṭatī’’ti vuttaṃ. Pubbe katakammassa dāpane kiñcāpi doso na dissati, tathāpi asāruppamevāti vadanti. Katakammatthāyapi kappiyavohārena ",
      " pariyāyato bhatiṃ dāpentassa natthi doso, sāratthadīpaniyaṃ (sārattha. ṭī. 1.342) pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘akappiyakahāpaṇādi na dātabba"
      },
      "nti kiñcāpi akappiyakahāpaṇādiṃ asādiyantena kappiyavohārato dātuṃ vaṭṭati, tathāpi sāruppaṃ na hoti, manussā ca etassa santakaṃ kiñci atthīti viheṭhetabbaṃ maññantīti akappiyakahāpaṇādidānaṃ paṭikkhitta’’nti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatheva pācetvā"
      },
      "ti hatthakammavaseneva pācetvā. ‘‘Kiṃ bhante’’ti ettakepi pucchite yadatthāya paviṭṭho, taṃ kathetuṃ labhati pucchitapañhattā."
    ],
    "innerText": "22.Na kevalañca…pe… cīvarādīni kārāpetukāmenātiādīsu cīvaraṃ kārāpetukāmassa aññātakaappavāritatantavāyehi hatthakammayācanavasena vāyāpane viññattipaccayā dukkaṭābhāvepi cīvaravāyāpanasikkhāpadena yathārahaṃ pācittiyadukkaṭāni hontīti veditabbaṃ. Akappiyakahāpaṇādi na dātabbanti kappiyamukhena laddhampi tattha kammakaraṇatthāya imassa kahāpaṇaṃ dehīti vatvā ‘‘dātuṃ vaṭṭatī’’ti vuttaṃ. Pubbe katakammassa dāpane kiñcāpi doso na dissati, tathāpi asāruppamevāti vadanti. Katakammatthāyapi kappiyavohārena pariyāyato bhatiṃ dāpentassa natthi doso, sāratthadīpaniyaṃ (sārattha. ṭī. 1.342) pana ‘‘akappiyakahāpaṇādi na dātabbanti kiñcāpi akappiyakahāpaṇādiṃ asādiyantena kappiyavohārato dātuṃ vaṭṭati, tathāpi sāruppaṃ na hoti, manussā ca etassa santakaṃ kiñci atthīti viheṭhetabbaṃ maññantīti akappiyakahāpaṇādidānaṃ paṭikkhitta’’nti vuttaṃ. Tatheva pācetvāti hatthakammavaseneva pācetvā. ‘‘Kiṃ bhante’’ti ettakepi pucchite yadatthāya paviṭṭho, taṃ kathetuṃ labhati pucchitapañhattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "23"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vatta"
      },
      "nti ",
      " cārittaṃ, āpatti pana na hotīti adhippāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kappiyaṃ kārāpetvā paṭiggahetabbānī"
      },
      "ti sākhāya makkhikabījanena paṇṇādichede bījagāmakopanassa ceva tattha laggarajādiappaṭiggahitakassa ca parihāratthāya vuttaṃ, tadubhayāsaṅkāya asati tathā akaraṇe doso natthi. Sāratthadīpaniyaṃ (sārattha. ṭī. 1.342) pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kappiyaṃ kārāpetvā paṭiggahetabbānī"
      },
      "ti sākhāya laggarajasmiṃ patte patitepi sākhaṃ chinditvā khāditukāmatāyapi sati sukhaparibhogatthaṃ vutta’’nti vuttaṃ. Nadiyādīsu udakassa apariggahitattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘āharāti vattuṃ vaṭṭatī’’"
      },
      "ti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gehato…pe… neva vaṭṭatī"
      },
      "ti pariggahitudakattā viññattiyā dukkaṭaṃ hotīti adhippāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Na āhaṭaṃ paribhuñjitu’’"
      },
      "nti vacanato viññattiyā āpannaṃ dukkaṭaṃ desetvāpi taṃ vatthuṃ paribhuñjantassa paribhoge paribhoge dukkaṭameva, pañcannampi sahadhammikānaṃ na vaṭṭati."
    ],
    "innerText": "23.Vattanti cārittaṃ, āpatti pana na hotīti adhippāyo. Kappiyaṃ kārāpetvā paṭiggahetabbānīti sākhāya makkhikabījanena paṇṇādichede bījagāmakopanassa ceva tattha laggarajādiappaṭiggahitakassa ca parihāratthāya vuttaṃ, tadubhayāsaṅkāya asati tathā akaraṇe doso natthi. Sāratthadīpaniyaṃ (sārattha. ṭī. 1.342) pana ‘‘kappiyaṃ kārāpetvā paṭiggahetabbānīti sākhāya laggarajasmiṃ patte patitepi sākhaṃ chinditvā khāditukāmatāyapi sati sukhaparibhogatthaṃ vutta’’nti vuttaṃ. Nadiyādīsu udakassa apariggahitattā ‘‘āharāti vattuṃ vaṭṭatī’’ti vuttaṃ. Gehato…pe… neva vaṭṭatīti pariggahitudakattā viññattiyā dukkaṭaṃ hotīti adhippāyo. ‘‘Na āhaṭaṃ paribhuñjitu’’nti vacanato viññattiyā āpannaṃ dukkaṭaṃ desetvāpi taṃ vatthuṃ paribhuñjantassa paribhoge paribhoge dukkaṭameva, pañcannampi sahadhammikānaṃ na vaṭṭati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Alajjīhi pana bhikkhūhi vā sāmaṇerehi vā hatthakammaṃ na kāretabba’’"
      },
      "nti sāmaññato vuttattā attano atthāya yaṃ kiñci hatthakammaṃ kāretuṃ na vaṭṭati. Yaṃ pana alajjī nivāriyamānopi bījanādiṃ karoti, tattha doso natthi, cetiyakammādīni pana tehi kārāpetuṃ vaṭṭatīti vimativinodaniyaṃ (vi. vi. ṭī. 1.342) vuttaṃ. Sāratthadīpaniyaṃ (sārattha. ṭī. 2.342) pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘alajjīhi…pe… na kāretabba"
      },
      "nti idaṃ uttaribhaṅgādhikārattā ajjhoharaṇīyaṃ sandhāya vuttaṃ, bāhiraparibhogesu pana alajjīhipi hatthakammaṃ kāretuṃ vaṭṭatī’’ti vuttaṃ. Ettha ca ‘‘alajjīhi sāmaṇerehī’’ti vuttattā ‘‘sañcicca āpattiṃ āpajjatī’’ti (pari. 359) alajjilakkhaṇaṃ ukkaṭṭhavasena upasampanne paṭicca upalakkhaṇato vuttanti taṃlakkhaṇavirahitānaṃ sāmaṇerādīnaṃ liṅgatthenagotrabhupariyosānānaṃ ",
      " bhikkhupaṭiññānaṃ dussīlānampi sādhāraṇavasena alajjilakkhaṇaṃ yathāṭhapitapaṭipattiyā atiṭṭhanamevāti gahetabbaṃ."
    ],
    "innerText": "‘‘Alajjīhi pana bhikkhūhi vā sāmaṇerehi vā hatthakammaṃ na kāretabba’’nti sāmaññato vuttattā attano atthāya yaṃ kiñci hatthakammaṃ kāretuṃ na vaṭṭati. Yaṃ pana alajjī nivāriyamānopi bījanādiṃ karoti, tattha doso natthi, cetiyakammādīni pana tehi kārāpetuṃ vaṭṭatīti vimativinodaniyaṃ (vi. vi. ṭī. 1.342) vuttaṃ. Sāratthadīpaniyaṃ (sārattha. ṭī. 2.342) pana ‘‘alajjīhi…pe… na kāretabbanti idaṃ uttaribhaṅgādhikārattā ajjhoharaṇīyaṃ sandhāya vuttaṃ, bāhiraparibhogesu pana alajjīhipi hatthakammaṃ kāretuṃ vaṭṭatī’’ti vuttaṃ. Ettha ca ‘‘alajjīhi sāmaṇerehī’’ti vuttattā ‘‘sañcicca āpattiṃ āpajjatī’’ti (pari. 359) alajjilakkhaṇaṃ ukkaṭṭhavasena upasampanne paṭicca upalakkhaṇato vuttanti taṃlakkhaṇavirahitānaṃ sāmaṇerādīnaṃ liṅgatthenagotrabhupariyosānānaṃ bhikkhupaṭiññānaṃ dussīlānampi sādhāraṇavasena alajjilakkhaṇaṃ yathāṭhapitapaṭipattiyā atiṭṭhanamevāti gahetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "24"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Goṇaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pana…pe… āharāpentassa dukkaṭa"
      },
      "nti viññattikkhaṇe viññattipaccayā, paṭilābhakkhaṇe goṇānaṃ sādiyanapaccayā ca dukkaṭaṃ. Goṇañhi attano atthāya aviññattiyā laddhampi sādituṃ na vaṭṭati ‘‘hatthigavāssavaḷavapaṭiggahaṇā paṭivirato hotī’’ti (dī. ni. 1.10, 194) vuttattā. Tenevāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ñātakapavāritaṭṭhānatopi mūlacchejjāya yācituṃ na vaṭṭatī’’"
      },
      "ti. Ettha ca viññattidukkaṭābhāvepi akappiyavatthuyācanepi paṭiggahaṇepi dukkaṭameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rakkhitvā"
      },
      "ti corādiupaddavato rakkhitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jaggitvā"
      },
      "ti tiṇaannādīhi posetvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na sampaṭicchitabba"
      },
      "nti attano atthāya gosādiyanassa paṭikkhittattā vuttaṃ."
    ],
    "innerText": "24.Goṇaṃpana…pe… āharāpentassa dukkaṭanti viññattikkhaṇe viññattipaccayā, paṭilābhakkhaṇe goṇānaṃ sādiyanapaccayā ca dukkaṭaṃ. Goṇañhi attano atthāya aviññattiyā laddhampi sādituṃ na vaṭṭati ‘‘hatthigavāssavaḷavapaṭiggahaṇā paṭivirato hotī’’ti (dī. ni. 1.10, 194) vuttattā. Tenevāha ‘‘ñātakapavāritaṭṭhānatopi mūlacchejjāya yācituṃ na vaṭṭatī’’ti. Ettha ca viññattidukkaṭābhāvepi akappiyavatthuyācanepi paṭiggahaṇepi dukkaṭameva. Rakkhitvāti corādiupaddavato rakkhitvā. Jaggitvāti tiṇaannādīhi posetvā. Na sampaṭicchitabbanti attano atthāya gosādiyanassa paṭikkhittattā vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "25"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñātakapavāritaṭṭhāne pana vaṭṭatī"
      },
      "ti sakaṭassa sampaṭicchitabbattā mūlacchejjavasena yācituṃ vaṭṭati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tāvakālikaṃ vaṭṭatī"
      },
      "ti ubhayatthāpi vaṭṭatīti atthoti vimativinodaniyaṃ (vi. vi. ṭī. 1.342) vuttaṃ. Sāratthadīpaniyaṃ (sārattha. ṭī. 2.342) pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sakaṭaṃ dethāti…pe… na vaṭṭatī"
      },
      "ti mūlacchejjavasena sakaṭaṃ dethāti vattuṃ na vaṭṭati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tāvakālikaṃ vaṭṭatī"
      },
      "ti tāvakālikaṃ katvā sabbattha yācituṃ vaṭṭatī’’ti vuttaṃ. Vāsiādīni puggalikānipi vaṭṭantīti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘esa nayo vāsī’’"
      },
      "tiādi. Valliādīsu ca parapariggahitesu esa nayoti yojetabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Garubhaṇḍappahonakesuyevā"
      },
      "ti idaṃ viññattiṃ sandhāya vuttaṃ, adinnādāne pana tiṇasalākaṃ upādāya parapariggahitaṃ theyyacittena gaṇhato avahāro eva, bhaṇḍagghena kāretabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Valliādīsū"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ādi"
      },
      "-saddena pāḷiāgatānaṃ veḷumuñjapabbajatiṇamattikānaṃ saṅgaho daṭṭhabbo. Tattha ca yasmiṃ padese ",
      " haritālajātihiṅgulikādi appakampi mahagghaṃ hoti, tattha taṃ tālapakkappamāṇato ūnampi garubhaṇḍameva, viññāpetuñca na vaṭṭati."
    ],
    "innerText": "25.Ñātakapavāritaṭṭhāne pana vaṭṭatīti sakaṭassa sampaṭicchitabbattā mūlacchejjavasena yācituṃ vaṭṭati. Tāvakālikaṃ vaṭṭatīti ubhayatthāpi vaṭṭatīti atthoti vimativinodaniyaṃ (vi. vi. ṭī. 1.342) vuttaṃ. Sāratthadīpaniyaṃ (sārattha. ṭī. 2.342) pana ‘‘sakaṭaṃ dethāti…pe… na vaṭṭatīti mūlacchejjavasena sakaṭaṃ dethāti vattuṃ na vaṭṭati. Tāvakālikaṃ vaṭṭatīti tāvakālikaṃ katvā sabbattha yācituṃ vaṭṭatī’’ti vuttaṃ. Vāsiādīni puggalikānipi vaṭṭantīti āha ‘‘esa nayo vāsī’’tiādi. Valliādīsu ca parapariggahitesu esa nayoti yojetabbaṃ. Garubhaṇḍappahonakesuyevāti idaṃ viññattiṃ sandhāya vuttaṃ, adinnādāne pana tiṇasalākaṃ upādāya parapariggahitaṃ theyyacittena gaṇhato avahāro eva, bhaṇḍagghena kāretabbo. Valliādīsūti ettha ādi-saddena pāḷiāgatānaṃ veḷumuñjapabbajatiṇamattikānaṃ saṅgaho daṭṭhabbo. Tattha ca yasmiṃ padese haritālajātihiṅgulikādi appakampi mahagghaṃ hoti, tattha taṃ tālapakkappamāṇato ūnampi garubhaṇḍameva, viññāpetuñca na vaṭṭati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "26"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sā"
      },
      "ti viññatti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parikathā"
      },
      "dīsu ‘‘senāsanaṃ sambādha’’ntiādinā pariyāyena kathanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "parikathā"
      },
      " nāma. Ujukameva akathetvā ‘‘bhikkhūnaṃ kiṃ pāsādo na vaṭṭatī’’tiādinā adhippāyo yathā vibhūto hoti, evaṃ kathanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "obhāso"
      },
      " nāma. Senāsanādiatthaṃ bhūmiparikammādikaraṇavasena paccayuppādāya nimittakaraṇaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nimittakammaṃ"
      },
      " nāma. Tīsu paccayesu viññattiādayo dassitā, gilānapaccaye pana kathanti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘gilānapaccaye panā’’"
      },
      "tiādi. Tathā uppannaṃ pana bhesajjaṃ roge vūpasante bhuñjituṃ vaṭṭati, na vaṭṭatīti? Tattha vinayadharā ‘‘bhagavatā rogasīsena paribhogassa dvāraṃ dinnaṃ, tasmā arogakālepi bhuñjituṃ vaṭṭati, āpatti na ",
      " hotī’’ti vadanti, suttantikā pana ‘‘kiñcāpi āpatti na hoti, ājīvaṃ pana kopeti, tasmā sallekhapaṭipattiyaṃ ṭhitassa na vaṭṭati, sallekhaṃ kopetī’’ti vadantīti."
    ],
    "innerText": "26.Sāti viññatti. Parikathādīsu ‘‘senāsanaṃ sambādha’’ntiādinā pariyāyena kathanaṃ parikathā nāma. Ujukameva akathetvā ‘‘bhikkhūnaṃ kiṃ pāsādo na vaṭṭatī’’tiādinā adhippāyo yathā vibhūto hoti, evaṃ kathanaṃ obhāso nāma. Senāsanādiatthaṃ bhūmiparikammādikaraṇavasena paccayuppādāya nimittakaraṇaṃ nimittakammaṃ nāma. Tīsu paccayesu viññattiādayo dassitā, gilānapaccaye pana kathanti āha ‘‘gilānapaccaye panā’’tiādi. Tathā uppannaṃ pana bhesajjaṃ roge vūpasante bhuñjituṃ vaṭṭati, na vaṭṭatīti? Tattha vinayadharā ‘‘bhagavatā rogasīsena paribhogassa dvāraṃ dinnaṃ, tasmā arogakālepi bhuñjituṃ vaṭṭati, āpatti na hotī’’ti vadanti, suttantikā pana ‘‘kiñcāpi āpatti na hoti, ājīvaṃ pana kopeti, tasmā sallekhapaṭipattiyaṃ ṭhitassa na vaṭṭati, sallekhaṃ kopetī’’ti vadantīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti vinayasaṅgahasaṃvaṇṇanābhūte vinayālaṅkāre"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Viññattivinicchayakathālaṅkāro nāma"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Catuttho paricchedo."
  }
]