[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "7. Anāmāsavinicchayakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "40"
      },
      ". Evaṃ ",
      " macchamaṃsavinicchayaṃ kathetvā idāni anāmāsavinicchayaṃ kathetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘anāmāsa’’"
      },
      "ntiādimāha. Tattha āmasiyateti āmāsaṃ, na āmāsaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anāmāsaṃ,"
      },
      " aparāmasitabbanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāripanthikā"
      },
      "ti vikuppanikā, antarāyikāti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nadīsotena vuyhamānaṃ mātara"
      },
      "nti etaṃ ukkaṭṭhaparicchedadassanatthaṃ vuttaṃ. Aññāsu pana itthīsu kāruññādhippāyena mātari vuttanayena paṭipajjantassa nevatthi dosoti vadanti. ‘‘Mātara’’nti vuttattā aññāsu na vaṭṭatīti vadantāpi atthi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ettha gaṇhāhīti na vattabbā"
      },
      "ti gehassitapemena kāyappaṭibaddhena phusane dukkaṭaṃ sandhāya vuttaṃ. Kāruññena pana vatthādiṃ gahetuṃ asakkontiṃ ‘‘gaṇhāhī’’ti vadantassapi avasabhāvappattito udake nimujjantiṃ kāruññena sahasā anāmāsanti acintetvā kesādīsu gahetvā mokkhādhippāyena ākaḍḍhatopi anāpattiyeva. Na hi mīyamānaṃ mātaraṃ upekkhituṃ vaṭṭati. Aññātikāya itthiyāpi eseva nayo. Ukkaṭṭhāya mātuyāpi āmāso na vaṭṭatīti dassanatthaṃ ‘‘mātara’’nti vuttaṃ. Tassa kātabbaṃ pana aññāsampi itthīnaṃ karontassapi anāpattiyeva anāmāsatte visesābhāvā."
    ],
    "innerText": "40. Evaṃ macchamaṃsavinicchayaṃ kathetvā idāni anāmāsavinicchayaṃ kathetuṃ ‘‘anāmāsa’’ntiādimāha. Tattha āmasiyateti āmāsaṃ, na āmāsaṃ anāmāsaṃ, aparāmasitabbanti attho. Pāripanthikāti vikuppanikā, antarāyikāti vuttaṃ hoti. Nadīsotena vuyhamānaṃ mātaranti etaṃ ukkaṭṭhaparicchedadassanatthaṃ vuttaṃ. Aññāsu pana itthīsu kāruññādhippāyena mātari vuttanayena paṭipajjantassa nevatthi dosoti vadanti. ‘‘Mātara’’nti vuttattā aññāsu na vaṭṭatīti vadantāpi atthi. Ettha gaṇhāhīti na vattabbāti gehassitapemena kāyappaṭibaddhena phusane dukkaṭaṃ sandhāya vuttaṃ. Kāruññena pana vatthādiṃ gahetuṃ asakkontiṃ ‘‘gaṇhāhī’’ti vadantassapi avasabhāvappattito udake nimujjantiṃ kāruññena sahasā anāmāsanti acintetvā kesādīsu gahetvā mokkhādhippāyena ākaḍḍhatopi anāpattiyeva. Na hi mīyamānaṃ mātaraṃ upekkhituṃ vaṭṭati. Aññātikāya itthiyāpi eseva nayo. Ukkaṭṭhāya mātuyāpi āmāso na vaṭṭatīti dassanatthaṃ ‘‘mātara’’nti vuttaṃ. Tassa kātabbaṃ pana aññāsampi itthīnaṃ karontassapi anāpattiyeva anāmāsatte visesābhāvā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tiṇaṇḍupaka"
      },
      "nti ",
      " hiriverādimūlehi kesālaṅkāratthāya katacumbaṭakaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tālapaṇṇamuddika"
      },
      "nti tālapaṇṇehi kataṃ aṅgulimuddikaṃ. Tena tālapaṇṇādimayaṃ kaṭisuttakaṇṇapiḷandhanādi sabbaṃ na vaṭṭatīti siddhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parivattetvā"
      },
      "ti attano nivāsanapārupanabhāvato apanetvā, cīvaratthāya pariṇāmetvāti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cīvaratthāya pādamūle ṭhapetī"
      },
      "ti idaṃ nidassanamattaṃ. Paccattharaṇavitānādiatthampi vaṭṭatiyeva, pūjādiatthaṃ tāvakālikampi āmasituṃ vaṭṭati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sīsapasādhanadantasūcī"
      },
      "ti idaṃ sīsālaṅkāratthāya paṭapilotikāhi katasīsapasādhanakañceva dantasūciādi cāti dve tayo. Sīsapasādhanaṃ sipāṭikopakaraṇatthāya ceva dantasūciṃ sūciupakaraṇatthāya ca gahetabbanti yathākkamaṃ atthaṃ dasseti. Kesakalāpaṃ bandhitvā tattha tiriyaṃ pavesanatthāya katā sūci eva sīsapasādhanakadantasūcīti ekameva katvā sipāṭikāya pakkhipitvā pariharitabbasūciyeva tassa tassa kiccassa upakaraṇanti sipāṭikasūciupakaraṇaṃ, evaṃ vā yojanā kātabbā."
    ],
    "innerText": "Tiṇaṇḍupakanti hiriverādimūlehi kesālaṅkāratthāya katacumbaṭakaṃ. Tālapaṇṇamuddikanti tālapaṇṇehi kataṃ aṅgulimuddikaṃ. Tena tālapaṇṇādimayaṃ kaṭisuttakaṇṇapiḷandhanādi sabbaṃ na vaṭṭatīti siddhaṃ. Parivattetvāti attano nivāsanapārupanabhāvato apanetvā, cīvaratthāya pariṇāmetvāti vuttaṃ hoti. Cīvaratthāya pādamūle ṭhapetīti idaṃ nidassanamattaṃ. Paccattharaṇavitānādiatthampi vaṭṭatiyeva, pūjādiatthaṃ tāvakālikampi āmasituṃ vaṭṭati. Sīsapasādhanadantasūcīti idaṃ sīsālaṅkāratthāya paṭapilotikāhi katasīsapasādhanakañceva dantasūciādi cāti dve tayo. Sīsapasādhanaṃ sipāṭikopakaraṇatthāya ceva dantasūciṃ sūciupakaraṇatthāya ca gahetabbanti yathākkamaṃ atthaṃ dasseti. Kesakalāpaṃ bandhitvā tattha tiriyaṃ pavesanatthāya katā sūci eva sīsapasādhanakadantasūcīti ekameva katvā sipāṭikāya pakkhipitvā pariharitabbasūciyeva tassa tassa kiccassa upakaraṇanti sipāṭikasūciupakaraṇaṃ, evaṃ vā yojanā kātabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Potthakarūpa"
      },
      "nti sudhādīhi kataṃ pārājikavatthubhūtānaṃ tiracchānagatitthīnaṃ saṇṭhānena katampi anāmāsameva ",
      ". Itthirūpāni dassetvā kataṃ vatthubhittiādiñca itthirūpaṃ anāmasitvā vaḷañjetuṃ vaṭṭati. Evarūpe hi anāmāse kāyasaṃsaggarāge asati kāyappaṭibaddhena āmasato doso natthi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhinditvā"
      },
      "ti ettha hatthena aggahetvāva kenaci daṇḍādinā bhinditabbaṃ. Ettha ca anāmāsampi daṇḍapāsāṇādīhi bhedanassa aṭṭhakathāyaṃ vuttattā, pāḷiyampi āpadāsu mokkhādhippāyassa āmasanepi anāpattiyā vuttattā ca sappiniādivāḷamigīhi gahitapāṇakānaṃ mocanatthāya taṃ taṃ sappiniādivatthuṃ daṇḍādīhi paṭikkhipitvā gahetuṃ, mātuādiṃ udake mīyamānaṃ vatthādīhi gahetuṃ, asakkontiṃ ",
      " kesādīsu gahetvā kāruññena ukkhipituñca vaṭṭatīti ayamattho gahetabbova. ‘‘Aṭṭhakathāyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘na tveva āmasitabbā’"
      },
      "ti idaṃ pana vacanaṃ amīyamānaṃ vatthuṃ sandhāya vuttanti ayaṃ amhākaṃ khantī’’ti vimativinodaniyaṃ (vi. vi. ṭī. 1.281) vuttaṃ."
    ],
    "innerText": "Potthakarūpanti sudhādīhi kataṃ pārājikavatthubhūtānaṃ tiracchānagatitthīnaṃ saṇṭhānena katampi anāmāsameva . Itthirūpāni dassetvā kataṃ vatthubhittiādiñca itthirūpaṃ anāmasitvā vaḷañjetuṃ vaṭṭati. Evarūpe hi anāmāse kāyasaṃsaggarāge asati kāyappaṭibaddhena āmasato doso natthi. Bhinditvāti ettha hatthena aggahetvāva kenaci daṇḍādinā bhinditabbaṃ. Ettha ca anāmāsampi daṇḍapāsāṇādīhi bhedanassa aṭṭhakathāyaṃ vuttattā, pāḷiyampi āpadāsu mokkhādhippāyassa āmasanepi anāpattiyā vuttattā ca sappiniādivāḷamigīhi gahitapāṇakānaṃ mocanatthāya taṃ taṃ sappiniādivatthuṃ daṇḍādīhi paṭikkhipitvā gahetuṃ, mātuādiṃ udake mīyamānaṃ vatthādīhi gahetuṃ, asakkontiṃ kesādīsu gahetvā kāruññena ukkhipituñca vaṭṭatīti ayamattho gahetabbova. ‘‘Aṭṭhakathāyaṃ ‘na tveva āmasitabbā’ti idaṃ pana vacanaṃ amīyamānaṃ vatthuṃ sandhāya vuttanti ayaṃ amhākaṃ khantī’’ti vimativinodaniyaṃ (vi. vi. ṭī. 1.281) vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "41"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Maggaṃ adhiṭṭhāyā"
      },
      "ti ‘‘maggo aya’’nti maggasaññaṃ uppādetvāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññapetvā dentī"
      },
      "ti idaṃ sāmīcivasena vuttaṃ, tehi pana ‘‘āsanaṃ paññapetvāva nisīdathā’’ti vutte sayameva paññapetvā nisīdituṃ vaṭṭati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tattha jātakānī"
      },
      "ti acchinditvā bhūtagāmabhāveneva ṭhitāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Kīḷantenā’’"
      },
      "ti vuttattā sati paccaye āmasantassa anāpatti, idañca gihisantakaṃ sandhāya vuttaṃ, bhikkhusantakaṃ pana paribhogārahaṃ sabbathā āmasituṃ na vaṭṭati durūpaciṇṇattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tālapanasādīnī"
      },
      "ti cettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ādi"
      },
      "-saddena nāḷikeralabujatipusaalābukumbhaṇḍapussaphalaeḷālukaphalānaṃ saṅgaho daṭṭhabbo. ‘‘Yathāvuttaphalānaṃyeva cettha kīḷādhippāyena āmasanaṃ na vaṭṭatī’’ti vuttattā pāsāṇasakkharādīni kīḷādhippāyenapi āmasituṃ vaṭṭati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anupasampannānaṃ dassāmī"
      },
      "ti idaṃ apaṭiggahetvā gahaṇaṃ sandhāya vuttaṃ. Attanopi atthāya paṭiggahetvā gahaṇe doso natthi anāmāsattābhāvā."
    ],
    "innerText": "41.Maggaṃ adhiṭṭhāyāti ‘‘maggo aya’’nti maggasaññaṃ uppādetvāti attho. Paññapetvā dentīti idaṃ sāmīcivasena vuttaṃ, tehi pana ‘‘āsanaṃ paññapetvāva nisīdathā’’ti vutte sayameva paññapetvā nisīdituṃ vaṭṭati. Tattha jātakānīti acchinditvā bhūtagāmabhāveneva ṭhitāni. ‘‘Kīḷantenā’’ti vuttattā sati paccaye āmasantassa anāpatti, idañca gihisantakaṃ sandhāya vuttaṃ, bhikkhusantakaṃ pana paribhogārahaṃ sabbathā āmasituṃ na vaṭṭati durūpaciṇṇattā. Tālapanasādīnīti cettha ādi-saddena nāḷikeralabujatipusaalābukumbhaṇḍapussaphalaeḷālukaphalānaṃ saṅgaho daṭṭhabbo. ‘‘Yathāvuttaphalānaṃyeva cettha kīḷādhippāyena āmasanaṃ na vaṭṭatī’’ti vuttattā pāsāṇasakkharādīni kīḷādhippāyenapi āmasituṃ vaṭṭati. Anupasampannānaṃ dassāmīti idaṃ apaṭiggahetvā gahaṇaṃ sandhāya vuttaṃ. Attanopi atthāya paṭiggahetvā gahaṇe doso natthi anāmāsattābhāvā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "42"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Muttā"
      },
      "ti (ma. ni. ṭī. 1.2 pathavīvāravaṇṇanā; sārattha. ṭī. 2.281) hatthikumbhajātikā aṭṭhavidhā muttā. Tathā hi hatthikumbhaṃ, varāhadāṭhaṃ, bhujagasīsaṃ, valāhakaṃ, veḷu, macchasiro, saṅkho, sippīti aṭṭha muttāyoniyo. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hatthikumbhajā"
      },
      " pītavaṇṇā pabhāhīnā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Varāhadāṭhā"
      },
      " varāhadāṭhāvaṇṇāva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhujagasīsajā"
      },
      " nīlādivaṇṇā suvisuddhā vaṭṭalā ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Valāhakajā"
      },
      " bhāsurā dubbibhāgā rattibhāge andhakāraṃ vidhamentiyo tiṭṭhanti, devūpabhogā eva ca honti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Veḷujā"
      },
      " karakaphalasamānavaṇṇā na bhāsurā, te ",
      " ca veḷū amanussagocareyeva padese jāyanti ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Macchasirajā"
      },
      " pāṭhīnapiṭṭhisamānavaṇṇā vaṭṭalā laghavo ca tejavantā honti pabhāvihīnā ca, te ca macchā samuddamajjheyeva jāyanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅkhajā"
      },
      " saṅkhaudaracchavivaṇṇā kolaphalappamāṇāpi honti pabhāvihīnāva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sippijā"
      },
      " pabhāvisesayuttā honti nānāsaṇṭhānā. Evaṃ jātito aṭṭhavidhāsu muttāsu yā macchasaṅkhasippijā, tā sāmuddikā. Bhujagajāpi kāci sāmuddikā honti, itarā asāmuddikā. Yasmā bahulaṃ sāmuddikāva muttā loke dissanti, tatthāpi sippijāva, itarā kadāci kāci, tasmā sammohavinodaniyaṃ (vibha. aṭṭha. 173) ‘‘muttāti sāmuddikā muttā’’ti vuttaṃ."
    ],
    "innerText": "42.Muttāti (ma. ni. ṭī. 1.2 pathavīvāravaṇṇanā; sārattha. ṭī. 2.281) hatthikumbhajātikā aṭṭhavidhā muttā. Tathā hi hatthikumbhaṃ, varāhadāṭhaṃ, bhujagasīsaṃ, valāhakaṃ, veḷu, macchasiro, saṅkho, sippīti aṭṭha muttāyoniyo. Tattha hatthikumbhajā pītavaṇṇā pabhāhīnā. Varāhadāṭhā varāhadāṭhāvaṇṇāva. Bhujagasīsajā nīlādivaṇṇā suvisuddhā vaṭṭalā ca. Valāhakajā bhāsurā dubbibhāgā rattibhāge andhakāraṃ vidhamentiyo tiṭṭhanti, devūpabhogā eva ca honti. Veḷujā karakaphalasamānavaṇṇā na bhāsurā, te ca veḷū amanussagocareyeva padese jāyanti . Macchasirajā pāṭhīnapiṭṭhisamānavaṇṇā vaṭṭalā laghavo ca tejavantā honti pabhāvihīnā ca, te ca macchā samuddamajjheyeva jāyanti. Saṅkhajā saṅkhaudaracchavivaṇṇā kolaphalappamāṇāpi honti pabhāvihīnāva. Sippijā pabhāvisesayuttā honti nānāsaṇṭhānā. Evaṃ jātito aṭṭhavidhāsu muttāsu yā macchasaṅkhasippijā, tā sāmuddikā. Bhujagajāpi kāci sāmuddikā honti, itarā asāmuddikā. Yasmā bahulaṃ sāmuddikāva muttā loke dissanti, tatthāpi sippijāva, itarā kadāci kāci, tasmā sammohavinodaniyaṃ (vibha. aṭṭha. 173) ‘‘muttāti sāmuddikā muttā’’ti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Maṇī"
      },
      "ti veḷuriyādito añño jotirasādibhedo sabbo maṇi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Veḷuriyo"
      },
      "ti allaveḷuvaṇṇo maṇi, ‘‘majjārakkhimaṇḍalavaṇṇo’’tipi vadanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅkho"
      },
      "ti sāmuddikasaṅkho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Silā"
      },
      "ti muggavaṇṇā atisiniddhā kāḷasilā. Maṇivohāraṃ agatā rattasetādivaṇṇā sumaṭṭhāpi silā anāmāsā evāti vadanti. Sāratthadīpaniyaṃ (sārattha. ṭī. 2.281) pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘saṅkho"
      },
      "ti sāmuddikasaṅkho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Silā"
      },
      "ti kāḷasilāpaṇḍusilāsetasilādibhedā sabbāpi silā’’ti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pavāḷaṃ"
      },
      " samuddato jātanātirattamaṇi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rajata"
      },
      "nti kahāpaṇamāsādibhedaṃ jatumāsādiṃ upādāya sabbaṃ vuttāvasesarūpiyaṃ gahitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jātarūpa"
      },
      "nti suvaṇṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lohitaṅko"
      },
      "ti rattamaṇi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Masāragalla"
      },
      "nti kabaravaṇṇo maṇi. ‘‘Marakata’’ntipi vadanti."
    ],
    "innerText": "Maṇīti veḷuriyādito añño jotirasādibhedo sabbo maṇi. Veḷuriyoti allaveḷuvaṇṇo maṇi, ‘‘majjārakkhimaṇḍalavaṇṇo’’tipi vadanti. Saṅkhoti sāmuddikasaṅkho. Silāti muggavaṇṇā atisiniddhā kāḷasilā. Maṇivohāraṃ agatā rattasetādivaṇṇā sumaṭṭhāpi silā anāmāsā evāti vadanti. Sāratthadīpaniyaṃ (sārattha. ṭī. 2.281) pana ‘‘saṅkhoti sāmuddikasaṅkho. Silāti kāḷasilāpaṇḍusilāsetasilādibhedā sabbāpi silā’’ti vuttaṃ. Pavāḷaṃ samuddato jātanātirattamaṇi. Rajatanti kahāpaṇamāsādibhedaṃ jatumāsādiṃ upādāya sabbaṃ vuttāvasesarūpiyaṃ gahitaṃ. Jātarūpanti suvaṇṇaṃ. Lohitaṅkoti rattamaṇi. Masāragallanti kabaravaṇṇo maṇi. ‘‘Marakata’’ntipi vadanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhaṇḍamūlatthāyā"
      },
      "ti pattacīvarādimūlatthāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kuṭṭharogassā"
      },
      "ti nidassanamattaṃ. Tāya vūpasametabbassa yassa kassaci rogassa atthāya vaṭṭatiyeva. ‘‘Bhesajjatthañca aviddhāyeva muttā vaṭṭatī’’ti tīsupi gaṇṭhipadesu vuttā. Bhesajjatthāya pisitvā yojitānaṃ muttānaṃ ratanabhāvavijahanato gahaṇakkhaṇepi ",
      " ratanākārena apekkhābhāvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘bhesajjatthāya pana vaṭṭatī’’"
      },
      "ti vuttaṃ. Yāva pana tā muttā ratanarūpena tiṭṭhanti, tāva āmasituṃ na vaṭṭanti. Evaṃ aññampi ratanapāsāṇaṃ pisitvā bhesajje yojanatthāya gahetuṃ vaṭṭati eva. Jātarūparajataṃ pana missetvā yojanabhesajjatthāyapi sampaṭicchituṃ na vaṭṭati. Gahaṭṭhehi yojetvā dinnampi yadi bhesajje suvaṇṇādirūpena tiṭṭhati, viyojetuñca sakkā, tādisaṃ bhesajjampi na vaṭṭati. Taṃ abbohārikattagatañce vaṭṭati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Jātiphalikaṃ upādāyā’’"
      },
      "ti vuttattā sūriyakantacandakantādikaṃ jātipāsāṇaṃ maṇimhi eva saṅgahitanti daṭṭhabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ākaramutto"
      },
      "ti ākarato muttamatto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhaṇḍamūlatthaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sampaṭicchituṃ vaṭṭatī"
      },
      "ti imināva āmasitumpi vaṭṭatīti dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pacitvā kato"
      },
      "ti kācakārehi pacitvā kato."
    ],
    "innerText": "Bhaṇḍamūlatthāyāti pattacīvarādimūlatthāya. Kuṭṭharogassāti nidassanamattaṃ. Tāya vūpasametabbassa yassa kassaci rogassa atthāya vaṭṭatiyeva. ‘‘Bhesajjatthañca aviddhāyeva muttā vaṭṭatī’’ti tīsupi gaṇṭhipadesu vuttā. Bhesajjatthāya pisitvā yojitānaṃ muttānaṃ ratanabhāvavijahanato gahaṇakkhaṇepi ratanākārena apekkhābhāvā ‘‘bhesajjatthāya pana vaṭṭatī’’ti vuttaṃ. Yāva pana tā muttā ratanarūpena tiṭṭhanti, tāva āmasituṃ na vaṭṭanti. Evaṃ aññampi ratanapāsāṇaṃ pisitvā bhesajje yojanatthāya gahetuṃ vaṭṭati eva. Jātarūparajataṃ pana missetvā yojanabhesajjatthāyapi sampaṭicchituṃ na vaṭṭati. Gahaṭṭhehi yojetvā dinnampi yadi bhesajje suvaṇṇādirūpena tiṭṭhati, viyojetuñca sakkā, tādisaṃ bhesajjampi na vaṭṭati. Taṃ abbohārikattagatañce vaṭṭati. ‘‘Jātiphalikaṃ upādāyā’’ti vuttattā sūriyakantacandakantādikaṃ jātipāsāṇaṃ maṇimhi eva saṅgahitanti daṭṭhabbaṃ. Ākaramuttoti ākarato muttamatto. Bhaṇḍamūlatthaṃsampaṭicchituṃ vaṭṭatīti imināva āmasitumpi vaṭṭatīti dasseti. Pacitvā katoti kācakārehi pacitvā kato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dhamanasaṅkho ca dhotaviddho ca ratanamisso cāti yojetabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Viddho"
      },
      "tiādibhāvena katachiddo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ratanamisso"
      },
      "ti kañcanalatādivicitto muttādiratanakhacito ca. Etena dhamanasaṅkhato añño ratanasammisso anāmāsoti dasseti. Silāyampi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pānīyasaṅkho"
      },
      "ti iminā thālakādiākārena katasaṅkhamayabhājanāni bhikkhūnaṃ sampaṭicchituṃ vaṭṭantīti siddhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sesa"
      },
      "nti ratanamissaṃ ṭhapetvā avasesaṃ. Muggavaṇṇaṃyeva ratanasammissaṃ karonti, na aññanti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘muggavaṇṇāvā’’"
      },
      "ti, muggavaṇṇā ratanasammissāva na vaṭṭatīti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sesā"
      },
      "ti ratanasammissaṃ ṭhapetvā avasesā silā."
    ],
    "innerText": "Dhamanasaṅkho ca dhotaviddho ca ratanamisso cāti yojetabbaṃ. Viddhotiādibhāvena katachiddo. Ratanamissoti kañcanalatādivicitto muttādiratanakhacito ca. Etena dhamanasaṅkhato añño ratanasammisso anāmāsoti dasseti. Silāyampi eseva nayo. Pānīyasaṅkhoti iminā thālakādiākārena katasaṅkhamayabhājanāni bhikkhūnaṃ sampaṭicchituṃ vaṭṭantīti siddhaṃ. Sesanti ratanamissaṃ ṭhapetvā avasesaṃ. Muggavaṇṇaṃyeva ratanasammissaṃ karonti, na aññanti āha ‘‘muggavaṇṇāvā’’ti, muggavaṇṇā ratanasammissāva na vaṭṭatīti vuttaṃ hoti. Sesāti ratanasammissaṃ ṭhapetvā avasesā silā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bījato paṭṭhāyā"
      },
      "ti dhātupāsāṇato paṭṭhāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suvaṇṇacetiya"
      },
      "nti dhātukaraṇḍakaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭikkhipī"
      },
      "ti ‘‘dhātuṭṭhapanatthāya gaṇhathā’’ti avatvā ‘‘tumhākaṃ gaṇhathā’’ti pesitattā ",
      " paṭikkhipi. Vimativinodaniyaṃ (vi. vi. ṭī. 1.281) pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘paṭikkhipī"
      },
      "ti suvaṇṇamayassa dhātukaraṇḍakassa buddhādirūpassa ca attano santakakaraṇe nissaggiyattā vutta’’nti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suvaṇṇabubbuḷaka"
      },
      "nti suvaṇṇatārakaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Rūpiyachaḍḍakaṭṭhāne’’"
      },
      "ti vuttattā rūpiyachaḍḍakassa jātarūparajataṃ āmasitvā chaḍḍetuṃ vaṭṭatīti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Keḷāpayitu"
      },
      "nti āmasitvā ito cito ca sañcāretuṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vutta"
      },
      "nti mahāaṭṭhakathāyaṃ vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kacavarameva harituṃ vaṭṭatī"
      },
      "ti gopakā vā hontu aññe vā, hatthenapi puñchitvā kacavaraṃ apanetuṃ vaṭṭati, ‘‘malampi pamajjituṃ vaṭṭatiyevā’’ti sāratthadīpaniyaṃ (sārattha. ṭī. 2.281) vuttaṃ. Vimativinodaniyaṃ (vi. vi. ṭī. 1.281) pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kacavarameva harituṃ vaṭṭatī"
      },
      "ti gopakā vā hontu aññe vā, hatthenapi puñchitvā kacavaraṃ apanetuṃ vaṭṭati, malampi majjituṃ vaṭṭati evāti vadanti, taṃ aṭṭhakathāya na sameti keḷāyanasadisattā’’ti vuttaṃ. Kathaṃ na sameti? Mahāaṭṭhakathāyaṃ cetiyagharagopakā rūpiyachaḍḍakaṭṭhāne ṭhitāti tesaṃyeva keḷāyanaṃ anuññātaṃ, na aññesaṃ, tasmā ‘‘gopakā vā hontu aññe vā’’ti vacanaṃ mahāaṭṭhakathāya na sameti."
    ],
    "innerText": "Bījato paṭṭhāyāti dhātupāsāṇato paṭṭhāya. Suvaṇṇacetiyanti dhātukaraṇḍakaṃ. Paṭikkhipīti ‘‘dhātuṭṭhapanatthāya gaṇhathā’’ti avatvā ‘‘tumhākaṃ gaṇhathā’’ti pesitattā paṭikkhipi. Vimativinodaniyaṃ (vi. vi. ṭī. 1.281) pana ‘‘paṭikkhipīti suvaṇṇamayassa dhātukaraṇḍakassa buddhādirūpassa ca attano santakakaraṇe nissaggiyattā vutta’’nti vuttaṃ. Suvaṇṇabubbuḷakanti suvaṇṇatārakaṃ. ‘‘Rūpiyachaḍḍakaṭṭhāne’’ti vuttattā rūpiyachaḍḍakassa jātarūparajataṃ āmasitvā chaḍḍetuṃ vaṭṭatīti vuttaṃ. Keḷāpayitunti āmasitvā ito cito ca sañcāretuṃ. Vuttanti mahāaṭṭhakathāyaṃ vuttaṃ. Kacavarameva harituṃ vaṭṭatīti gopakā vā hontu aññe vā, hatthenapi puñchitvā kacavaraṃ apanetuṃ vaṭṭati, ‘‘malampi pamajjituṃ vaṭṭatiyevā’’ti sāratthadīpaniyaṃ (sārattha. ṭī. 2.281) vuttaṃ. Vimativinodaniyaṃ (vi. vi. ṭī. 1.281) pana ‘‘kacavarameva harituṃ vaṭṭatīti gopakā vā hontu aññe vā, hatthenapi puñchitvā kacavaraṃ apanetuṃ vaṭṭati, malampi majjituṃ vaṭṭati evāti vadanti, taṃ aṭṭhakathāya na sameti keḷāyanasadisattā’’ti vuttaṃ. Kathaṃ na sameti? Mahāaṭṭhakathāyaṃ cetiyagharagopakā rūpiyachaḍḍakaṭṭhāne ṭhitāti tesaṃyeva keḷāyanaṃ anuññātaṃ, na aññesaṃ, tasmā ‘‘gopakā vā hontu aññe vā’’ti vacanaṃ mahāaṭṭhakathāya na sameti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kurundiyaṃ pana tampi paṭikkhittaṃ, suvaṇṇacetiye kacavarameva harituṃ vaṭṭatīti ettakameva anuññātaṃ,"
      },
      " tasmā sāvadhāraṇaṃ katvā vuttattā ‘‘hatthenapi puñchitvā’’ti ca ‘‘malampi pamajjituṃ vaṭṭati ",
      " evā’’ti ca vacanaṃ kurundaṭṭhakathāya na sameti, tasmā vicāretabbametanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ārakūṭaloha"
      },
      "nti suvaṇṇavaṇṇo kittimalohaviseso. Tividhañhi kittimalohaṃ – kaṃsalohaṃ vaṭṭalohaṃ ārakūṭalohanti. Tattha tiputambe missetvā kataṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kaṃsalohaṃ"
      },
      " nāma, sīsatambe missetvā kataṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vaṭṭalohaṃ,"
      },
      " rasatutthehi rañjitaṃ tambaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ārakūṭalohaṃ"
      },
      " nāma. ‘‘Pakatirasatambe missetvā kataṃ ",
      " ārakūṭa’’nti ca sāratthadīpaniyaṃ (sārattha. ṭī. 2.281) vuttaṃ. Taṃ pana ‘‘jātarūpagatika’’nti vuttattā uggaṇhato nissaggiyampi hotīti keci vadanti, rūpiyesu pana agaṇitattā nissaggiyaṃ na hoti, āmasane sampaṭicchane ca dukkaṭamevāti veditabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbopi kappiyo"
      },
      "ti yathāvuttasuvaṇṇādimayānaṃ senāsanaparikkhārānaṃ āmasanagopanādivasena paribhogo sabbathā kappiyoti adhippāyo. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tasmā’’"
      },
      "tiādi. ‘‘Bhikkhūnaṃ dhammavinayavaṇṇanaṭṭhāne’’ti vuttattā saṅghikameva suvaṇṇādimayaṃ senāsanaṃ senāsanaparikkhārā ca vaṭṭanti, na puggalikānīti gahetabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭijaggituṃ vaṭṭantī"
      },
      "ti senāsanapaṭibandhato vuttaṃ."
    ],
    "innerText": "Kurundiyaṃ pana tampi paṭikkhittaṃ, suvaṇṇacetiye kacavarameva harituṃ vaṭṭatīti ettakameva anuññātaṃ, tasmā sāvadhāraṇaṃ katvā vuttattā ‘‘hatthenapi puñchitvā’’ti ca ‘‘malampi pamajjituṃ vaṭṭati evā’’ti ca vacanaṃ kurundaṭṭhakathāya na sameti, tasmā vicāretabbametanti. Ārakūṭalohanti suvaṇṇavaṇṇo kittimalohaviseso. Tividhañhi kittimalohaṃ – kaṃsalohaṃ vaṭṭalohaṃ ārakūṭalohanti. Tattha tiputambe missetvā kataṃ kaṃsalohaṃ nāma, sīsatambe missetvā kataṃ vaṭṭalohaṃ, rasatutthehi rañjitaṃ tambaṃ ārakūṭalohaṃ nāma. ‘‘Pakatirasatambe missetvā kataṃ ārakūṭa’’nti ca sāratthadīpaniyaṃ (sārattha. ṭī. 2.281) vuttaṃ. Taṃ pana ‘‘jātarūpagatika’’nti vuttattā uggaṇhato nissaggiyampi hotīti keci vadanti, rūpiyesu pana agaṇitattā nissaggiyaṃ na hoti, āmasane sampaṭicchane ca dukkaṭamevāti veditabbaṃ. Sabbopi kappiyoti yathāvuttasuvaṇṇādimayānaṃ senāsanaparikkhārānaṃ āmasanagopanādivasena paribhogo sabbathā kappiyoti adhippāyo. Tenāha ‘‘tasmā’’tiādi. ‘‘Bhikkhūnaṃ dhammavinayavaṇṇanaṭṭhāne’’ti vuttattā saṅghikameva suvaṇṇādimayaṃ senāsanaṃ senāsanaparikkhārā ca vaṭṭanti, na puggalikānīti gahetabbaṃ. Paṭijaggituṃ vaṭṭantīti senāsanapaṭibandhato vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "43"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sāmikānaṃ pesetabba"
      },
      "nti sāmikānaṃ sāsanaṃ pesetabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhinditvā"
      },
      "ti paṭhamameva anāmasitvā pāsāṇādinā kiñcimattaṃ bhedaṃ katvā pacchā kappiyabhaṇḍatthāya adhiṭṭhahitvā hatthena gahetuṃ vaṭṭati. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kappiyabhaṇḍaṃ karissāmīti sampaṭicchituṃ vaṭṭatī’’"
      },
      "ti. Etthāpi tañca viyojetvā āmasitabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Phalakajālikādīnī"
      },
      "ti ettha saraparittāṇāya hatthena gahetabbaṃ. Kiṭikāphalakaṃ akkhirakkhaṇatthāya ayalohādīhi jālākārena katvā sīsādīsu paṭimuñcitabbaṃ jālikaṃ nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ādi"
      },
      "-saddena kavacādikaṃ saṅgaṇhāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anāmāsānī"
      },
      "ti macchajālādiparūparodhaṃ sandhāya vuttaṃ, na saraparittāṇaṃ tassa āvudhabhaṇḍattābhāvā. Tena vakkhati ‘‘parūparodhanivāraṇañhī’’tiādi (vi. saṅga. aṭṭha. 43). ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āsanassā"
      },
      "ti cetiyassasamantā kataparibhaṇḍassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bandhissāmī"
      },
      "ti kākādīnaṃ adūsanatthāya bandhissāmi."
    ],
    "innerText": "43.Sāmikānaṃ pesetabbanti sāmikānaṃ sāsanaṃ pesetabbaṃ. Bhinditvāti paṭhamameva anāmasitvā pāsāṇādinā kiñcimattaṃ bhedaṃ katvā pacchā kappiyabhaṇḍatthāya adhiṭṭhahitvā hatthena gahetuṃ vaṭṭati. Tenāha ‘‘kappiyabhaṇḍaṃ karissāmīti sampaṭicchituṃ vaṭṭatī’’ti. Etthāpi tañca viyojetvā āmasitabbaṃ. Phalakajālikādīnīti ettha saraparittāṇāya hatthena gahetabbaṃ. Kiṭikāphalakaṃ akkhirakkhaṇatthāya ayalohādīhi jālākārena katvā sīsādīsu paṭimuñcitabbaṃ jālikaṃ nāma. Ādi-saddena kavacādikaṃ saṅgaṇhāti. Anāmāsānīti macchajālādiparūparodhaṃ sandhāya vuttaṃ, na saraparittāṇaṃ tassa āvudhabhaṇḍattābhāvā. Tena vakkhati ‘‘parūparodhanivāraṇañhī’’tiādi (vi. saṅga. aṭṭha. 43). Āsanassāti cetiyassasamantā kataparibhaṇḍassa. Bandhissāmīti kākādīnaṃ adūsanatthāya bandhissāmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Bherisaṅghāṭo"
      },
      "ti saṅghaṭitacammabherī. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vīṇāsaṅghāṭo"
      },
      "ti saṅghaṭitacammavīṇā’’ti sāratthadīpaniyaṃ (sārattha. ṭī. 2.281) vuttaṃ. ‘‘Cammavinaddhā vīṇābheriādīnī’’ti mahāaṭṭhakathāyaṃ vuttavacanato visesābhāvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kurundiyaṃ panā’’"
      },
      "tiādinā tato visesassa vattumāraddhattā ca bheriādīnaṃ vinaddhopakaraṇasamūho bherivīṇāsaṅghāṭoti veditabbo ‘‘saṅghaṭitabboti saṅghāṭo’’ti katvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tucchapokkhara"
      },
      "nti avinaddhacammabherivīṇānaṃ pokkharaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āropitacamma"
      },
      "nti pubbe āropitaṃ hutvā pacchā tato apanetvā visuṃ ṭhapitamukhacammamattaṃ, na sesopakaraṇasahitaṃ, taṃ pana saṅghātoti ",
      " ayaṃ viseso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Onahitu"
      },
      "nti bheripokkharādīni cammaṃ āropetvā cammavaddhiādīhi sabbehi upakaraṇehi vinandhituṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Onahāpetu"
      },
      "nti tatheva aññehi vinandhāpetuṃ."
    ],
    "innerText": "‘‘Bherisaṅghāṭoti saṅghaṭitacammabherī. Vīṇāsaṅghāṭoti saṅghaṭitacammavīṇā’’ti sāratthadīpaniyaṃ (sārattha. ṭī. 2.281) vuttaṃ. ‘‘Cammavinaddhā vīṇābheriādīnī’’ti mahāaṭṭhakathāyaṃ vuttavacanato visesābhāvā ‘‘kurundiyaṃ panā’’tiādinā tato visesassa vattumāraddhattā ca bheriādīnaṃ vinaddhopakaraṇasamūho bherivīṇāsaṅghāṭoti veditabbo ‘‘saṅghaṭitabboti saṅghāṭo’’ti katvā. Tucchapokkharanti avinaddhacammabherivīṇānaṃ pokkharaṃ. Āropitacammanti pubbe āropitaṃ hutvā pacchā tato apanetvā visuṃ ṭhapitamukhacammamattaṃ, na sesopakaraṇasahitaṃ, taṃ pana saṅghātoti ayaṃ viseso. Onahitunti bheripokkharādīni cammaṃ āropetvā cammavaddhiādīhi sabbehi upakaraṇehi vinandhituṃ. Onahāpetunti tatheva aññehi vinandhāpetuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti vinayasaṅgahasaṃvaṇṇanābhūte vinayālaṅkāre"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Anāmāsavinicchayakathālaṅkāro nāma"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sattamo paricchedo."
  }
]