[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "4. Pavāraṇākkhandhako"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "120. Aphāsukavihāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "209"
      },
      ". Tena ",
      " samayena buddho bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena sambahulā sandiṭṭhā sambhattā bhikkhū kosalesu janapade aññatarasmiṃ āvāse vassaṃ upagacchiṃsu. Atha kho tesaṃ bhikkhūnaṃ etadahosi – ‘‘kena nu kho mayaṃ upāyena samaggā sammodamānā avivadamānā phāsukaṃ vassaṃ vaseyyāma, na ca piṇḍakena kilameyyāmā’’ti. Atha kho tesaṃ bhikkhūnaṃ etadahosi – ‘‘sace kho mayaṃ aññamaññaṃ neva ālapeyyāma na sallapeyyāma – yo paṭhamaṃ gāmato piṇḍāya paṭikkameyya so āsanaṃ paññapeyya, pādodakaṃ pādapīṭhaṃ pādakathalikaṃ upanikkhipeyya, avakkārapātiṃ dhovitvā upaṭṭhāpeyya, pānīyaṃ paribhojanīyaṃ upaṭṭhāpeyya; yo pacchā gāmato piṇḍāya paṭikkameyya, sacassa bhuttāvaseso, sace ākaṅkheyya bhuñjeyya, no ce ākaṅkheyya appaharite vā chaḍḍeyya, appāṇake vā udake opilāpeyya; so āsanaṃ uddhareyya, pādodakaṃ pādapīṭhaṃ pādakathalikaṃ paṭisāmeyya, avakkārapātiṃ dhovitvā paṭisāmeyya, pānīyaṃ paribhojanīyaṃ paṭisāmeyya, bhattaggaṃ sammajjeyya; yo passeyya pānīyaghaṭaṃ vā paribhojanīyaghaṭaṃ vā vaccaghaṭaṃ vā rittaṃ tucchaṃ so upaṭṭhāpeyya; sacassa hoti avisayhaṃ, hatthavikārena dutiyaṃ āmantetvā hatthavilaṅghakena upaṭṭhāpeyya; na tveva tappaccayā vācaṃ bhindeyya – evaṃ kho mayaṃ samaggā ",
      " sammodamānā avivadamānā phāsukaṃ vassaṃ vaseyyāma, na ca piṇḍakena kilameyyāmā’’ti. Atha kho te bhikkhū aññamaññaṃ neva ālapiṃsu, na sallapiṃsu. Yo paṭhamaṃ gāmato piṇḍāya paṭikkamati, so āsanaṃ paññapeti, pādodakaṃ pādapīṭhaṃ pādakathalikaṃ upanikkhipati, avakkārapātiṃ dhovitvā upaṭṭhāpeti, pānīyaṃ paribhojanīyaṃ upaṭṭhāpeti ",
      ". Yo pacchā gāmato piṇḍāya paṭikkamati, sace hoti bhuttāvaseso, sace ākaṅkhati bhuñjati, no ce ākaṅkhati appaharite vā chaḍḍeti, appāṇake vā udake opilāpeti; so āsanaṃ uddharati, pādodakaṃ pādapīṭhaṃ ",
      " pādakathalikaṃ paṭisāmeti, avakkārapātiṃ dhovitvā paṭisāmeti, pānīyaṃ paribhojanīyaṃ paṭisāmeti, bhattaggaṃ ",
      " sammajjati. Yo passati pānīyaghaṭaṃ vā paribhojanīyaghaṭaṃ vā vaccaghaṭaṃ vā rittaṃ tucchaṃ so upaṭṭhāpeti. Sacassa hoti avisayhaṃ, hatthavikārena dutiyaṃ āmantetvā hatthavilaṅghakena upaṭṭhāpeti, na tveva tappaccayā vācaṃ bhindati."
    ],
    "innerText": "209. Tena samayena buddho bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena sambahulā sandiṭṭhā sambhattā bhikkhū kosalesu janapade aññatarasmiṃ āvāse vassaṃ upagacchiṃsu. Atha kho tesaṃ bhikkhūnaṃ etadahosi – ‘‘kena nu kho mayaṃ upāyena samaggā sammodamānā avivadamānā phāsukaṃ vassaṃ vaseyyāma, na ca piṇḍakena kilameyyāmā’’ti. Atha kho tesaṃ bhikkhūnaṃ etadahosi – ‘‘sace kho mayaṃ aññamaññaṃ neva ālapeyyāma na sallapeyyāma – yo paṭhamaṃ gāmato piṇḍāya paṭikkameyya so āsanaṃ paññapeyya, pādodakaṃ pādapīṭhaṃ pādakathalikaṃ upanikkhipeyya, avakkārapātiṃ dhovitvā upaṭṭhāpeyya, pānīyaṃ paribhojanīyaṃ upaṭṭhāpeyya; yo pacchā gāmato piṇḍāya paṭikkameyya, sacassa bhuttāvaseso, sace ākaṅkheyya bhuñjeyya, no ce ākaṅkheyya appaharite vā chaḍḍeyya, appāṇake vā udake opilāpeyya; so āsanaṃ uddhareyya, pādodakaṃ pādapīṭhaṃ pādakathalikaṃ paṭisāmeyya, avakkārapātiṃ dhovitvā paṭisāmeyya, pānīyaṃ paribhojanīyaṃ paṭisāmeyya, bhattaggaṃ sammajjeyya; yo passeyya pānīyaghaṭaṃ vā paribhojanīyaghaṭaṃ vā vaccaghaṭaṃ vā rittaṃ tucchaṃ so upaṭṭhāpeyya; sacassa hoti avisayhaṃ, hatthavikārena dutiyaṃ āmantetvā hatthavilaṅghakena upaṭṭhāpeyya; na tveva tappaccayā vācaṃ bhindeyya – evaṃ kho mayaṃ samaggā sammodamānā avivadamānā phāsukaṃ vassaṃ vaseyyāma, na ca piṇḍakena kilameyyāmā’’ti. Atha kho te bhikkhū aññamaññaṃ neva ālapiṃsu, na sallapiṃsu. Yo paṭhamaṃ gāmato piṇḍāya paṭikkamati, so āsanaṃ paññapeti, pādodakaṃ pādapīṭhaṃ pādakathalikaṃ upanikkhipati, avakkārapātiṃ dhovitvā upaṭṭhāpeti, pānīyaṃ paribhojanīyaṃ upaṭṭhāpeti . Yo pacchā gāmato piṇḍāya paṭikkamati, sace hoti bhuttāvaseso, sace ākaṅkhati bhuñjati, no ce ākaṅkhati appaharite vā chaḍḍeti, appāṇake vā udake opilāpeti; so āsanaṃ uddharati, pādodakaṃ pādapīṭhaṃ pādakathalikaṃ paṭisāmeti, avakkārapātiṃ dhovitvā paṭisāmeti, pānīyaṃ paribhojanīyaṃ paṭisāmeti, bhattaggaṃ sammajjati. Yo passati pānīyaghaṭaṃ vā paribhojanīyaghaṭaṃ vā vaccaghaṭaṃ vā rittaṃ tucchaṃ so upaṭṭhāpeti. Sacassa hoti avisayhaṃ, hatthavikārena dutiyaṃ āmantetvā hatthavilaṅghakena upaṭṭhāpeti, na tveva tappaccayā vācaṃ bhindati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Āciṇṇaṃ kho panetaṃ vassaṃvuṭṭhānaṃ bhikkhūnaṃ bhagavantaṃ dassanāya upasaṅkamituṃ. Atha kho te bhikkhū vassaṃvuṭṭhā temāsaccayena senāsanaṃ saṃsāmetvā pattacīvaramādāya yena sāvatthi tena pakkamiṃsu. Anupubbena yena sāvatthi jetavanaṃ anāthapiṇḍikassa ārāmo yena bhagavā tenupasaṅkamiṃsu, upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Āciṇṇaṃ kho panetaṃ buddhānaṃ ",
      " bhagavantānaṃ āgantukehi bhikkhūhi saddhiṃ paṭisammodituṃ. Atha kho bhagavā te bhikkhū etadavoca – ‘‘kacci, bhikkhave, khamanīyaṃ, kacci yāpanīyaṃ, kacci samaggā sammodamānā avivadamānā phāsukaṃ vassaṃ vasittha, na ca piṇḍakena kilamitthā’’ti? ‘‘Khamanīyaṃ bhagavā, yāpanīyaṃ bhagavā. Samaggā ca mayaṃ, bhante, sammodamānā avivadamānā phāsukaṃ vassaṃ vasimhā, na ca piṇḍakena kilamimhā’’ti. Jānantāpi tathāgatā pucchanti, jānantāpi na pucchanti. Kālaṃ viditvā pucchanti, kālaṃ viditvā na pucchanti. Atthasaṃhitaṃ tathāgatā pucchanti, no anatthasaṃhitaṃ. Anatthasaṃhite setughāto tathāgatānaṃ. Dvīhākārehi buddhā bhagavanto bhikkhū paṭipucchanti – dhammaṃ vā desessāma, sāvakānaṃ vā sikkhāpadaṃ paññapessāmāti. Atha kho bhagavā te bhikkhū etadavoca – ‘‘yathākathaṃ pana tumhe, bhikkhave, samaggā sammodamānā avivadamānā phāsukaṃ vassaṃ vasittha, na ca piṇḍakena kilamitthā’’ti."
    ],
    "innerText": "Āciṇṇaṃ kho panetaṃ vassaṃvuṭṭhānaṃ bhikkhūnaṃ bhagavantaṃ dassanāya upasaṅkamituṃ. Atha kho te bhikkhū vassaṃvuṭṭhā temāsaccayena senāsanaṃ saṃsāmetvā pattacīvaramādāya yena sāvatthi tena pakkamiṃsu. Anupubbena yena sāvatthi jetavanaṃ anāthapiṇḍikassa ārāmo yena bhagavā tenupasaṅkamiṃsu, upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Āciṇṇaṃ kho panetaṃ buddhānaṃ bhagavantānaṃ āgantukehi bhikkhūhi saddhiṃ paṭisammodituṃ. Atha kho bhagavā te bhikkhū etadavoca – ‘‘kacci, bhikkhave, khamanīyaṃ, kacci yāpanīyaṃ, kacci samaggā sammodamānā avivadamānā phāsukaṃ vassaṃ vasittha, na ca piṇḍakena kilamitthā’’ti? ‘‘Khamanīyaṃ bhagavā, yāpanīyaṃ bhagavā. Samaggā ca mayaṃ, bhante, sammodamānā avivadamānā phāsukaṃ vassaṃ vasimhā, na ca piṇḍakena kilamimhā’’ti. Jānantāpi tathāgatā pucchanti, jānantāpi na pucchanti. Kālaṃ viditvā pucchanti, kālaṃ viditvā na pucchanti. Atthasaṃhitaṃ tathāgatā pucchanti, no anatthasaṃhitaṃ. Anatthasaṃhite setughāto tathāgatānaṃ. Dvīhākārehi buddhā bhagavanto bhikkhū paṭipucchanti – dhammaṃ vā desessāma, sāvakānaṃ vā sikkhāpadaṃ paññapessāmāti. Atha kho bhagavā te bhikkhū etadavoca – ‘‘yathākathaṃ pana tumhe, bhikkhave, samaggā sammodamānā avivadamānā phāsukaṃ vassaṃ vasittha, na ca piṇḍakena kilamitthā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha mayaṃ, bhante, sambahulā sandiṭṭhā sambhattā bhikkhū kosalesu janapade aññatarasmiṃ āvāse vassaṃ upagacchimhā. Tesaṃ no, bhante, amhākaṃ etadahosi – ‘‘kena nu kho mayaṃ upāyena samaggā sammodamānā avivadamānā phāsukaṃ vassaṃ vaseyyāma, na ca ",
      " piṇḍakena kilameyyāmā’’ti. Tesaṃ no, bhante, amhākaṃ etadahosi – ‘‘sace kho mayaṃ aññamaññaṃ neva ālapeyyāma na sallapeyyāma – yo paṭhamaṃ gāmato piṇḍāya paṭikkameyya so āsanaṃ paññapeyya, pādodakaṃ pādapīṭhaṃ ",
      " pādakathalikaṃ upanikkhipeyya, avakkārapātiṃ dhovitvā upaṭṭhāpeyya, pānīyaṃ paribhojanīyaṃ upaṭṭhāpeyya; yo pacchā gāmato piṇḍāya paṭikkameyya, sacassa bhuttāvaseso ",
      ", sace ākaṅkheyya bhuñjeyya, no ce ākaṅkheyya appaharite vā chaḍḍeyya, appāṇake vā udake opilāpeyya; so āsanaṃ uddhareyya, pādodakaṃ pādapīṭhaṃ pādakathalikaṃ paṭisāmeyya ",
      ", avakkārapātiṃ dhovitvā paṭisāmeyya, pānīyaṃ paribhojanīyaṃ paṭisāmeyya, bhattaggaṃ sammajjeyya; yo passeyya pānīyaghaṭaṃ vā paribhojanīyaghaṭaṃ vā vaccaghaṭaṃ vā rittaṃ tucchaṃ so upaṭṭhāpeyya; sacassa hoti avisayhaṃ, hatthavikārena dutiyaṃ āmantetvā hatthavilaṅghakena upaṭṭhāpeyya; na tveva tappaccayā vācaṃ bhindeyya – evaṃ kho mayaṃ samaggā sammodamānā avivadamānā phāsukaṃ vassaṃ vaseyyāma, na ca piṇḍakena kilameyyāmā’’ti. Atha kho mayaṃ, bhante, aññamaññaṃ neva ālapimhā na sallavimhā. Yo paṭhamaṃ gāmato piṇḍāya paṭikkamati so āsanaṃ paññapeti, pādodakaṃ pādapīṭhaṃ pādakathalikaṃ upanikkhipati, avakkārapātiṃ dhovitvā upaṭṭhāpeti, pānīyaṃ paribhojanīyaṃ upaṭṭhāpeti. Yo pacchā gāmato piṇḍāya paṭikkamati, sace hoti bhuttāvaseso, sace ākaṅkhati bhuñjati, no ce ākaṅkhati appaharite vā chaḍḍeti, appāṇake vā udake opilāpeti, so āsanaṃ uddharati, pādodakaṃ pādapīṭhaṃ pādakathalikaṃ paṭisāmeti, avakkārapātiṃ dhovitvā paṭisāmeti, pānīyaṃ paribhojanīyaṃ ",
      " paṭisāmeti, bhattaggaṃ sammajjati. Yo passati pānīyaghaṭaṃ vā paribhojanīyaghaṭaṃ vā vaccaghaṭaṃ vā rittaṃ tucchaṃ so upaṭṭhāpeti. Sacassa hoti avisayhaṃ, hatthavikārena dutiyaṃ āmantetvā hatthavilaṅghakena upaṭṭhāpeti, na tveva tappaccayā vācaṃ bhindati. Evaṃ kho mayaṃ, bhante, samaggā sammodamānā avivadamānā phāsukaṃ vassaṃ vasimhā, na ca piṇḍakena kilamimhāti."
    ],
    "innerText": "Idha mayaṃ, bhante, sambahulā sandiṭṭhā sambhattā bhikkhū kosalesu janapade aññatarasmiṃ āvāse vassaṃ upagacchimhā. Tesaṃ no, bhante, amhākaṃ etadahosi – ‘‘kena nu kho mayaṃ upāyena samaggā sammodamānā avivadamānā phāsukaṃ vassaṃ vaseyyāma, na ca piṇḍakena kilameyyāmā’’ti. Tesaṃ no, bhante, amhākaṃ etadahosi – ‘‘sace kho mayaṃ aññamaññaṃ neva ālapeyyāma na sallapeyyāma – yo paṭhamaṃ gāmato piṇḍāya paṭikkameyya so āsanaṃ paññapeyya, pādodakaṃ pādapīṭhaṃ pādakathalikaṃ upanikkhipeyya, avakkārapātiṃ dhovitvā upaṭṭhāpeyya, pānīyaṃ paribhojanīyaṃ upaṭṭhāpeyya; yo pacchā gāmato piṇḍāya paṭikkameyya, sacassa bhuttāvaseso , sace ākaṅkheyya bhuñjeyya, no ce ākaṅkheyya appaharite vā chaḍḍeyya, appāṇake vā udake opilāpeyya; so āsanaṃ uddhareyya, pādodakaṃ pādapīṭhaṃ pādakathalikaṃ paṭisāmeyya , avakkārapātiṃ dhovitvā paṭisāmeyya, pānīyaṃ paribhojanīyaṃ paṭisāmeyya, bhattaggaṃ sammajjeyya; yo passeyya pānīyaghaṭaṃ vā paribhojanīyaghaṭaṃ vā vaccaghaṭaṃ vā rittaṃ tucchaṃ so upaṭṭhāpeyya; sacassa hoti avisayhaṃ, hatthavikārena dutiyaṃ āmantetvā hatthavilaṅghakena upaṭṭhāpeyya; na tveva tappaccayā vācaṃ bhindeyya – evaṃ kho mayaṃ samaggā sammodamānā avivadamānā phāsukaṃ vassaṃ vaseyyāma, na ca piṇḍakena kilameyyāmā’’ti. Atha kho mayaṃ, bhante, aññamaññaṃ neva ālapimhā na sallavimhā. Yo paṭhamaṃ gāmato piṇḍāya paṭikkamati so āsanaṃ paññapeti, pādodakaṃ pādapīṭhaṃ pādakathalikaṃ upanikkhipati, avakkārapātiṃ dhovitvā upaṭṭhāpeti, pānīyaṃ paribhojanīyaṃ upaṭṭhāpeti. Yo pacchā gāmato piṇḍāya paṭikkamati, sace hoti bhuttāvaseso, sace ākaṅkhati bhuñjati, no ce ākaṅkhati appaharite vā chaḍḍeti, appāṇake vā udake opilāpeti, so āsanaṃ uddharati, pādodakaṃ pādapīṭhaṃ pādakathalikaṃ paṭisāmeti, avakkārapātiṃ dhovitvā paṭisāmeti, pānīyaṃ paribhojanīyaṃ paṭisāmeti, bhattaggaṃ sammajjati. Yo passati pānīyaghaṭaṃ vā paribhojanīyaghaṭaṃ vā vaccaghaṭaṃ vā rittaṃ tucchaṃ so upaṭṭhāpeti. Sacassa hoti avisayhaṃ, hatthavikārena dutiyaṃ āmantetvā hatthavilaṅghakena upaṭṭhāpeti, na tveva tappaccayā vācaṃ bhindati. Evaṃ kho mayaṃ, bhante, samaggā sammodamānā avivadamānā phāsukaṃ vassaṃ vasimhā, na ca piṇḍakena kilamimhāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho bhagavā bhikkhū āmantesi – ‘‘aphāsuññeva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[aphāsukaññeva (sī.)]"
      },
      " kirame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kirime (ka.)]"
      },
      ", bhikkhave, moghapurisā vuṭṭhā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vutthā (ka.)]"
      },
      " samānā phāsumhā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[phāsukamhā (sī.)]"
      },
      " vuṭṭhāti paṭijānanti. Pasusaṃvāsaññeva kirame, bhikkhave, moghapurisā vuṭṭhā samānā phāsumhā vuṭṭhāti paṭijānanti. Eḷakasaṃvāsaññeva kirame, bhikkhave, moghapurisā vuṭṭhā samānā phāsumhā vuṭṭhāti paṭijānanti. Sapattasaṃvāsaññeva kirame, bhikkhave, moghapurisā vuṭṭhā samānā phāsumhā vuṭṭhāti paṭijānanti. Kathañhi nāmime, bhikkhave, moghapurisā mūgabbataṃ titthiyasamādānaṃ samādiyissa’’nti. Netaṃ, bhikkhave, appasannānaṃ vā pasādāya…pe… vigarahitvā dhammiṃ ",
      " kathaṃ katvā bhikkhū āmantesi – na, bhikkhave, mūgabbataṃ titthiyasamādānaṃ samādiyitabbaṃ. Yo samādiyeyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, vassaṃvuṭṭhānaṃ bhikkhūnaṃ tīhi ṭhānehi pavāretuṃ – diṭṭhena vā sutena vā parisaṅkāya vā. Sā vo bhavissati aññamaññānulomatā āpattivuṭṭhānatā vinayapurekkhāratā. Evañca pana, bhikkhave, pavāretabbaṃ. Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo ",
      " –"
    ],
    "innerText": "Atha kho bhagavā bhikkhū āmantesi – ‘‘aphāsuññeva [aphāsukaññeva (sī.)] kirame [kirime (ka.)], bhikkhave, moghapurisā vuṭṭhā [vutthā (ka.)] samānā phāsumhā [phāsukamhā (sī.)] vuṭṭhāti paṭijānanti. Pasusaṃvāsaññeva kirame, bhikkhave, moghapurisā vuṭṭhā samānā phāsumhā vuṭṭhāti paṭijānanti. Eḷakasaṃvāsaññeva kirame, bhikkhave, moghapurisā vuṭṭhā samānā phāsumhā vuṭṭhāti paṭijānanti. Sapattasaṃvāsaññeva kirame, bhikkhave, moghapurisā vuṭṭhā samānā phāsumhā vuṭṭhāti paṭijānanti. Kathañhi nāmime, bhikkhave, moghapurisā mūgabbataṃ titthiyasamādānaṃ samādiyissa’’nti. Netaṃ, bhikkhave, appasannānaṃ vā pasādāya…pe… vigarahitvā dhammiṃ kathaṃ katvā bhikkhū āmantesi – na, bhikkhave, mūgabbataṃ titthiyasamādānaṃ samādiyitabbaṃ. Yo samādiyeyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, vassaṃvuṭṭhānaṃ bhikkhūnaṃ tīhi ṭhānehi pavāretuṃ – diṭṭhena vā sutena vā parisaṅkāya vā. Sā vo bhavissati aññamaññānulomatā āpattivuṭṭhānatā vinayapurekkhāratā. Evañca pana, bhikkhave, pavāretabbaṃ. Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "210"
      },
      ". ‘‘Suṇātu ",
      " me, bhante, saṅgho. Ajja pavāraṇā. Yadi saṅghassa pattakallaṃ, saṅgho pavāreyyā’’ti."
    ],
    "innerText": "210. ‘‘Suṇātu me, bhante, saṅgho. Ajja pavāraṇā. Yadi saṅghassa pattakallaṃ, saṅgho pavāreyyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Therena bhikkhunā ekaṃsaṃ uttarāsaṅgaṃ karitvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā evamassa vacanīyo – ‘‘saṅghaṃ, āvuso, pavāremi diṭṭhena vā sutena vā parisaṅkāya vā. Vadantu maṃ āyasmanto anukampaṃ upādāya. Passanto paṭikarissāmi. Dutiyampi, āvuso, saṅghaṃ pavāremi diṭṭhena vā sutena vā parisaṅkāya vā. Vadantu maṃ āyasmanto anukampaṃ upādāya. Passanto paṭikarissāmi. Tatiyampi, āvuso, saṅghaṃ pavāremi diṭṭhena vā sutena vā parisaṅkāya vā. Vadantu maṃ āyasmanto anukampaṃ upādāya. Passanto paṭikarissāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Navakena bhikkhunā ekaṃsaṃ uttarāsaṅgaṃ karitvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā evamassa vacanīyo – ‘‘saṅghaṃ, bhante, pavāremi diṭṭhena ",
      " vā sutena vā parisaṅkāya vā. Vadantu maṃ āyasmanto anukampaṃ upādāya. Passanto paṭikarissāmi. Dutiyampi, bhante, saṅghaṃ…pe… tatiyampi, bhante, saṅghaṃ pavāremi diṭṭhena vā sutena vā parisaṅkāya vā. Vadantu maṃ āyasmanto anukampaṃ upādāya. Passanto paṭikarissāmī’’ti."
    ],
    "innerText": "Navakena bhikkhunā ekaṃsaṃ uttarāsaṅgaṃ karitvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā evamassa vacanīyo – ‘‘saṅghaṃ, bhante, pavāremi diṭṭhena vā sutena vā parisaṅkāya vā. Vadantu maṃ āyasmanto anukampaṃ upādāya. Passanto paṭikarissāmi. Dutiyampi, bhante, saṅghaṃ…pe… tatiyampi, bhante, saṅghaṃ pavāremi diṭṭhena vā sutena vā parisaṅkāya vā. Vadantu maṃ āyasmanto anukampaṃ upādāya. Passanto paṭikarissāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "211"
      },
      ". Tena kho pana samayena chabbaggiyā bhikkhū theresu bhikkhūsu ukkuṭikaṃ nisinnesu pavārayamānesu āsanesu acchanti. Ye te bhikkhū ",
      " appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma chabbaggiyā bhikkhū theresu bhikkhūsu ukkuṭikaṃ nisinnesu pavārayamānesu āsanesu acchissantī’’ti. Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… ‘‘saccaṃ kira, bhikkhave, chabbaggiyā bhikkhū theresu bhikkhūsu ukkuṭikaṃ nisinnesu pavārayamānesu āsanesu acchantī’’ti? ‘‘Saccaṃ, bhagavā’’ti. Vigarahi ",
      " buddho bhagavā…pe… ‘‘kathañhi nāma te, bhikkhave, moghapurisā theresu bhikkhūsu ukkuṭikaṃ nisinnesu pavārayamānesu āsanesu acchissa’’nti. Netaṃ, bhikkhave, appasannānaṃ vā pasādāya, pasannānaṃ vā bhiyyobhāvāya…pe… vigarahitvā dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘na, bhikkhave, theresu bhikkhūsu ukkuṭikaṃ nisinnesu pavārayamānesu āsanesu acchitabbaṃ. Yo accheyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, sabbeheva ukkuṭikaṃ nisinnehi pavāretu’’nti."
    ],
    "innerText": "211. Tena kho pana samayena chabbaggiyā bhikkhū theresu bhikkhūsu ukkuṭikaṃ nisinnesu pavārayamānesu āsanesu acchanti. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma chabbaggiyā bhikkhū theresu bhikkhūsu ukkuṭikaṃ nisinnesu pavārayamānesu āsanesu acchissantī’’ti. Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… ‘‘saccaṃ kira, bhikkhave, chabbaggiyā bhikkhū theresu bhikkhūsu ukkuṭikaṃ nisinnesu pavārayamānesu āsanesu acchantī’’ti? ‘‘Saccaṃ, bhagavā’’ti. Vigarahi buddho bhagavā…pe… ‘‘kathañhi nāma te, bhikkhave, moghapurisā theresu bhikkhūsu ukkuṭikaṃ nisinnesu pavārayamānesu āsanesu acchissa’’nti. Netaṃ, bhikkhave, appasannānaṃ vā pasādāya, pasannānaṃ vā bhiyyobhāvāya…pe… vigarahitvā dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘na, bhikkhave, theresu bhikkhūsu ukkuṭikaṃ nisinnesu pavārayamānesu āsanesu acchitabbaṃ. Yo accheyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, sabbeheva ukkuṭikaṃ nisinnehi pavāretu’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena ",
      " kho pana samayena aññataro thero jarādubbalo yāva sabbe pavārentīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yāva sabbe pavārenti (syā.)]"
      },
      " ukkuṭikaṃ nisinno āgamayamāno mucchito papati. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, tadamantarā ukkuṭikaṃ nisīdituṃ yāva pavāreti, pavāretvā āsane nisīditunti."
    ],
    "innerText": "Tena kho pana samayena aññataro thero jarādubbalo yāva sabbe pavārentīti [yāva sabbe pavārenti (syā.)] ukkuṭikaṃ nisinno āgamayamāno mucchito papati. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, tadamantarā ukkuṭikaṃ nisīdituṃ yāva pavāreti, pavāretvā āsane nisīditunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Aphāsukavihāro niṭṭhito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "121. Pavāraṇābhedā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "212"
      },
      ". Atha kho bhikkhūnaṃ etadahosi – ‘‘kati nu kho pavāraṇā’’ti? Bhagavato etamatthaṃ ārocesuṃ. Dvemā, bhikkhave, pavāraṇā – cātuddasikā ca pannarasikā ca. Imā kho, bhikkhave, dve pavāraṇāti."
    ],
    "innerText": "212. Atha kho bhikkhūnaṃ etadahosi – ‘‘kati nu kho pavāraṇā’’ti? Bhagavato etamatthaṃ ārocesuṃ. Dvemā, bhikkhave, pavāraṇā – cātuddasikā ca pannarasikā ca. Imā kho, bhikkhave, dve pavāraṇāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " kho bhikkhūnaṃ etadahosi – ‘‘kati nu kho pavāraṇakammānī’’ti? ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pavāraṇākammānīti (syā.)]"
      },
      " Bhagavato etamatthaṃ ārocesuṃ. Cattārimāni, bhikkhave, pavāraṇakammāni – adhammena vaggaṃ pavāraṇakammaṃ, adhammena samaggaṃ pavāraṇakammaṃ, dhammena vaggaṃ pavāraṇakammaṃ, dhammena samaggaṃ pavāraṇakammaṃ. Tatra, bhikkhave, yadidaṃ adhammena vaggaṃ pavāraṇakammaṃ, na, bhikkhave, evarūpaṃ pavāraṇakammaṃ kātabbaṃ; na ca mayā evarūpaṃ pavāraṇakammaṃ anuññātaṃ. Tatra, bhikkhave, yadidaṃ adhammena samaggaṃ pavāraṇakammaṃ, na, bhikkhave, evarūpaṃ pavāraṇakammaṃ kātabbaṃ; na ca mayā evarūpaṃ pavāraṇakammaṃ anuññātaṃ. Tatra, bhikkhave, yadidaṃ dhammena vaggaṃ pavāraṇakammaṃ, na, bhikkhave, evarūpaṃ pavāraṇakammaṃ kātabbaṃ; na ca mayā evarūpaṃ pavāraṇakammaṃ anuññātaṃ. Tatra, bhikkhave, yadidaṃ dhammena samaggaṃ pavāraṇakammaṃ, evarūpaṃ, bhikkhave, pavāraṇakammaṃ kātabbaṃ; evarūpañca mayā pavāraṇakammaṃ anuññātaṃ. Tasmātiha, bhikkhave, evarūpaṃ pavāraṇakammaṃ karissāma yadidaṃ dhammena samagganti, evañhi vo, bhikkhave, sikkhitabbanti."
    ],
    "innerText": "Atha kho bhikkhūnaṃ etadahosi – ‘‘kati nu kho pavāraṇakammānī’’ti? [pavāraṇākammānīti (syā.)] Bhagavato etamatthaṃ ārocesuṃ. Cattārimāni, bhikkhave, pavāraṇakammāni – adhammena vaggaṃ pavāraṇakammaṃ, adhammena samaggaṃ pavāraṇakammaṃ, dhammena vaggaṃ pavāraṇakammaṃ, dhammena samaggaṃ pavāraṇakammaṃ. Tatra, bhikkhave, yadidaṃ adhammena vaggaṃ pavāraṇakammaṃ, na, bhikkhave, evarūpaṃ pavāraṇakammaṃ kātabbaṃ; na ca mayā evarūpaṃ pavāraṇakammaṃ anuññātaṃ. Tatra, bhikkhave, yadidaṃ adhammena samaggaṃ pavāraṇakammaṃ, na, bhikkhave, evarūpaṃ pavāraṇakammaṃ kātabbaṃ; na ca mayā evarūpaṃ pavāraṇakammaṃ anuññātaṃ. Tatra, bhikkhave, yadidaṃ dhammena vaggaṃ pavāraṇakammaṃ, na, bhikkhave, evarūpaṃ pavāraṇakammaṃ kātabbaṃ; na ca mayā evarūpaṃ pavāraṇakammaṃ anuññātaṃ. Tatra, bhikkhave, yadidaṃ dhammena samaggaṃ pavāraṇakammaṃ, evarūpaṃ, bhikkhave, pavāraṇakammaṃ kātabbaṃ; evarūpañca mayā pavāraṇakammaṃ anuññātaṃ. Tasmātiha, bhikkhave, evarūpaṃ pavāraṇakammaṃ karissāma yadidaṃ dhammena samagganti, evañhi vo, bhikkhave, sikkhitabbanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pavāraṇābhedā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "122. Pavāraṇādānānujānanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "213"
      },
      ". Atha ",
      " kho bhagavā bhikkhū āmantesi – ‘‘sannipatatha, bhikkhave. Saṅgho pavāressatī’’ti. Evaṃ vutte aññataro bhikkhu bhagavantaṃ etadavoca – ‘‘atthi, bhante, bhikkhu gilāno ",
      ", so anāgato’’ti. Anujānāmi, bhikkhave, gilānena bhikkhunā pavāraṇaṃ dātuṃ. Evañca pana, bhikkhave, dātabbā – tena gilānena bhikkhunā ekaṃ bhikkhuṃ ",
      " upasaṅkamitvā ",
      " ekaṃsaṃ uttarāsaṅgaṃ karitvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā evamassa vacanīyo – ‘‘pavāraṇaṃ dammi, pavāraṇaṃ me hara, pavāraṇaṃ me ārocehi, mamatthāya pavārehī’’ti kāyena viññāpeti, vācāya viññāpeti, kāyena vācāya viññāpeti, dinnā hoti pavāraṇā; na kāyena viññāpeti, na vācāya viññāpeti, na kāyena vācāya viññāpeti, na dinnā hoti pavāraṇā. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, so, bhikkhave, gilāno bhikkhu mañcena vā pīṭhena vā saṅghamajjhe ānetvā pavāretabbaṃ. Sace, bhikkhave, gilānupaṭṭhākānaṃ bhikkhūnaṃ etadahosi – ‘‘sace kho mayaṃ gilānaṃ ṭhānā cāvessāma, ābādho vā abhivaḍḍhissati, kālaṃkiriyā vā bhavissatī’’ti na, bhikkhave, gilāno bhikkhu ṭhānā cāvetabbo. Saṅghena tattha gantvā pavāretabbaṃ; na tveva vaggena saṅghena pavāretabbaṃ. Pavāreyya ce, āpatti dukkaṭassa."
    ],
    "innerText": "213. Atha kho bhagavā bhikkhū āmantesi – ‘‘sannipatatha, bhikkhave. Saṅgho pavāressatī’’ti. Evaṃ vutte aññataro bhikkhu bhagavantaṃ etadavoca – ‘‘atthi, bhante, bhikkhu gilāno , so anāgato’’ti. Anujānāmi, bhikkhave, gilānena bhikkhunā pavāraṇaṃ dātuṃ. Evañca pana, bhikkhave, dātabbā – tena gilānena bhikkhunā ekaṃ bhikkhuṃ upasaṅkamitvā ekaṃsaṃ uttarāsaṅgaṃ karitvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā evamassa vacanīyo – ‘‘pavāraṇaṃ dammi, pavāraṇaṃ me hara, pavāraṇaṃ me ārocehi, mamatthāya pavārehī’’ti kāyena viññāpeti, vācāya viññāpeti, kāyena vācāya viññāpeti, dinnā hoti pavāraṇā; na kāyena viññāpeti, na vācāya viññāpeti, na kāyena vācāya viññāpeti, na dinnā hoti pavāraṇā. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, so, bhikkhave, gilāno bhikkhu mañcena vā pīṭhena vā saṅghamajjhe ānetvā pavāretabbaṃ. Sace, bhikkhave, gilānupaṭṭhākānaṃ bhikkhūnaṃ etadahosi – ‘‘sace kho mayaṃ gilānaṃ ṭhānā cāvessāma, ābādho vā abhivaḍḍhissati, kālaṃkiriyā vā bhavissatī’’ti na, bhikkhave, gilāno bhikkhu ṭhānā cāvetabbo. Saṅghena tattha gantvā pavāretabbaṃ; na tveva vaggena saṅghena pavāretabbaṃ. Pavāreyya ce, āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pavāraṇahārako ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pavāraṇāhārako (syā.)]"
      },
      " ce, bhikkhave, dinnāya pavāraṇāya tattheva pakkamati, aññassa dātabbā pavāraṇā. Pavāraṇahārako ce, bhikkhave, dinnāya pavāraṇāya tattheva vibbhamati…pe… kālaṃkaroti… sāmaṇero paṭijānāti… sikkhaṃ paccakkhātako paṭijānāti… antimavatthuṃ ajjhāpannako paṭijānāti… ummattako paṭijānāti… khittacitto paṭijānāti… vedanāṭṭo paṭijānāti… āpattiyā adassane ukkhittako paṭijānāti… āpattiyā appaṭikamme ukkhittako paṭijānāti… pāpikāya diṭṭhiyā appaṭinissagge ukkhittako paṭijānāti… paṇḍako ",
      " paṭijānāti… theyyasaṃvāsako paṭijānāti… titthiyapakkantako paṭijānāti… tiracchānagato paṭijānāti… mātughātako paṭijānāti… pitughātako paṭijānāti… arahantaghātako paṭijānāti… bhikkhunidūsako paṭijānāti… saṅghabhedako paṭijānāti ",
      "… lohituppādako paṭijānāti… ubhatobyañjanako paṭijānāti, aññassa dātabbā pavāraṇā."
    ],
    "innerText": "Pavāraṇahārako [pavāraṇāhārako (syā.)] ce, bhikkhave, dinnāya pavāraṇāya tattheva pakkamati, aññassa dātabbā pavāraṇā. Pavāraṇahārako ce, bhikkhave, dinnāya pavāraṇāya tattheva vibbhamati…pe… kālaṃkaroti… sāmaṇero paṭijānāti… sikkhaṃ paccakkhātako paṭijānāti… antimavatthuṃ ajjhāpannako paṭijānāti… ummattako paṭijānāti… khittacitto paṭijānāti… vedanāṭṭo paṭijānāti… āpattiyā adassane ukkhittako paṭijānāti… āpattiyā appaṭikamme ukkhittako paṭijānāti… pāpikāya diṭṭhiyā appaṭinissagge ukkhittako paṭijānāti… paṇḍako paṭijānāti… theyyasaṃvāsako paṭijānāti… titthiyapakkantako paṭijānāti… tiracchānagato paṭijānāti… mātughātako paṭijānāti… pitughātako paṭijānāti… arahantaghātako paṭijānāti… bhikkhunidūsako paṭijānāti… saṅghabhedako paṭijānāti … lohituppādako paṭijānāti… ubhatobyañjanako paṭijānāti, aññassa dātabbā pavāraṇā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pavāraṇahārako ce, bhikkhave, dinnāya pavāraṇāya antarāmagge pakkamati, anāhaṭā hoti pavāraṇā. Pavāraṇahārako ce, bhikkhave, dinnāya pavāraṇāya antarāmagge vibbhamati…pe… kālaṃkaroti… sāmaṇero paṭijānāti… sikkhaṃ paccakkhātako paṭijānāti… antimavatthuṃ ajjhāpannako paṭijānāti… ummattako paṭijānāti… khittacitto paṭijānāti… vedanāṭṭo paṭijānāti… āpattiyā adassane ukkhittako paṭijānāti… āpattiyā appaṭikamme ukkhittako paṭijānāti… pāpikāya diṭṭhiyā appaṭinissagge ",
      " ukkhittako paṭijānāti… paṇḍako paṭijānāti… theyyasaṃvāsako paṭijānāti… titthiyapakkantako paṭijānāti… tiracchānagato paṭijānāti… mātughātako paṭijānāti… pitughātako paṭijānāti… arahantaghātako paṭijānāti… bhikkhunidūsako paṭijānāti… saṅghabhedako paṭijānāti… lohituppādako paṭijānāti… ubhatobyañjanako paṭijānāti, anāhaṭā hoti pavāraṇā."
    ],
    "innerText": "Pavāraṇahārako ce, bhikkhave, dinnāya pavāraṇāya antarāmagge pakkamati, anāhaṭā hoti pavāraṇā. Pavāraṇahārako ce, bhikkhave, dinnāya pavāraṇāya antarāmagge vibbhamati…pe… kālaṃkaroti… sāmaṇero paṭijānāti… sikkhaṃ paccakkhātako paṭijānāti… antimavatthuṃ ajjhāpannako paṭijānāti… ummattako paṭijānāti… khittacitto paṭijānāti… vedanāṭṭo paṭijānāti… āpattiyā adassane ukkhittako paṭijānāti… āpattiyā appaṭikamme ukkhittako paṭijānāti… pāpikāya diṭṭhiyā appaṭinissagge ukkhittako paṭijānāti… paṇḍako paṭijānāti… theyyasaṃvāsako paṭijānāti… titthiyapakkantako paṭijānāti… tiracchānagato paṭijānāti… mātughātako paṭijānāti… pitughātako paṭijānāti… arahantaghātako paṭijānāti… bhikkhunidūsako paṭijānāti… saṅghabhedako paṭijānāti… lohituppādako paṭijānāti… ubhatobyañjanako paṭijānāti, anāhaṭā hoti pavāraṇā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Pavāraṇahārako ce, bhikkhave, dinnāya pavāraṇāya saṅghappatto pakkamati, āhaṭā hoti pavāraṇā. Pavāraṇahārako ce, bhikkhave, dinnāya pavāraṇāya saṅghappatto vibbhamati…pe… kālaṃkaroti… sāmaṇero paṭijānāti… sikkhaṃ paccakkhātako paṭijānāti… antimavatthuṃ ajjhāpannako paṭijānāti… ummattako paṭijānāti… khittacitto paṭijānāti… vedanāṭṭo paṭijānāti… āpattiyā adassane ukkhittako paṭijānāti… āpattiyā appaṭikamme ukkhittako paṭijānāti… pāpikāya diṭṭhiyā appaṭinissagge ukkhittako paṭijānāti… paṇḍako paṭijānāti… theyyasaṃvāsako paṭijānāti… titthiyapakkantako paṭijānāti… tiracchānagato paṭijānāti… mātughātako paṭijānāti… pitughātako paṭijānāti… arahantaghātako paṭijānāti… bhikkhunidūsako paṭijānāti… saṅghabhedako paṭijānāti… lohituppādako paṭijānāti… ubhatobyañjanako paṭijānāti, āhaṭā hoti pavāraṇā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pavāraṇahārako ce, bhikkhave, dinnāya pavāraṇāya saṅghappatto sutto nāroceti, āhaṭā hoti pavāraṇā. Pavāraṇahārakassa anāpatti ",
      ". Pavāraṇahārako ce, bhikkhave, dinnāya pavāraṇāya saṅghappatto pamatto nāroceti…pe… samāpanno nāroceti, āhaṭā hoti pavāraṇā. Pavāraṇahārakassa anāpatti."
    ],
    "innerText": "Pavāraṇahārako ce, bhikkhave, dinnāya pavāraṇāya saṅghappatto sutto nāroceti, āhaṭā hoti pavāraṇā. Pavāraṇahārakassa anāpatti . Pavāraṇahārako ce, bhikkhave, dinnāya pavāraṇāya saṅghappatto pamatto nāroceti…pe… samāpanno nāroceti, āhaṭā hoti pavāraṇā. Pavāraṇahārakassa anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pavāraṇahārako ce, bhikkhave ",
      ", dinnāya pavāraṇāya saṅghappatto sañcicca nāroceti, āhaṭā hoti pavāraṇā. Pavāraṇahārakassa āpatti dukkaṭassa. Anujānāmi, bhikkhave, tadahu pavāraṇāya pavāraṇaṃ dentena chandampi dātuṃ, santi saṅghassa karaṇīyanti."
    ],
    "innerText": "Pavāraṇahārako ce, bhikkhave , dinnāya pavāraṇāya saṅghappatto sañcicca nāroceti, āhaṭā hoti pavāraṇā. Pavāraṇahārakassa āpatti dukkaṭassa. Anujānāmi, bhikkhave, tadahu pavāraṇāya pavāraṇaṃ dentena chandampi dātuṃ, santi saṅghassa karaṇīyanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pavāraṇādānānujānanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "123. Ñātakādiggahaṇakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "214"
      },
      ". Tena ",
      " kho pana samayena aññataraṃ bhikkhuṃ tadahu pavāraṇāya ñātakā gaṇhiṃsu. Bhagavato etamatthaṃ ārocesuṃ. Idha pana, bhikkhave, bhikkhuṃ tadahu pavāraṇāya ñātakā gaṇhanti. Te ñātakā bhikkhūhi evamassu vacanīyā – ‘‘iṅgha, tumhe āyasmanto imaṃ bhikkhuṃ muhuttaṃ muñcatha, yāvāyaṃ bhikkhu pavāretī’’ti. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, te ñātakā bhikkhūhi evamassu vacanīyā – ‘‘iṅgha, tumhe āyasmanto muhuttaṃ ekamantaṃ hotha, yāvāyaṃ bhikkhu pavāraṇaṃ detī’’ti. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, te ñātakā bhikkhūhi evamassu vacanīyā – ‘‘iṅgha, tumhe āyasmanto imaṃ bhikkhuṃ muhuttaṃ nissīmaṃ netha, yāva saṅgho pavāretī’’ti. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, na tveva vaggena saṅghena pavāretabbaṃ. Pavāreyya ce, āpatti dukkaṭassa."
    ],
    "innerText": "214. Tena kho pana samayena aññataraṃ bhikkhuṃ tadahu pavāraṇāya ñātakā gaṇhiṃsu. Bhagavato etamatthaṃ ārocesuṃ. Idha pana, bhikkhave, bhikkhuṃ tadahu pavāraṇāya ñātakā gaṇhanti. Te ñātakā bhikkhūhi evamassu vacanīyā – ‘‘iṅgha, tumhe āyasmanto imaṃ bhikkhuṃ muhuttaṃ muñcatha, yāvāyaṃ bhikkhu pavāretī’’ti. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, te ñātakā bhikkhūhi evamassu vacanīyā – ‘‘iṅgha, tumhe āyasmanto muhuttaṃ ekamantaṃ hotha, yāvāyaṃ bhikkhu pavāraṇaṃ detī’’ti. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, te ñātakā bhikkhūhi evamassu vacanīyā – ‘‘iṅgha, tumhe āyasmanto imaṃ bhikkhuṃ muhuttaṃ nissīmaṃ netha, yāva saṅgho pavāretī’’ti. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, na tveva vaggena saṅghena pavāretabbaṃ. Pavāreyya ce, āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, bhikkhuṃ tadahu pavāraṇāya rājāno gaṇhanti…pe… corā gaṇhanti ",
      "… dhuttā gaṇhanti… bhikkhupaccatthikā gaṇhanti. Te bhikkhupaccatthikā bhikkhūhi evamassu vacanīyā – ‘‘iṅgha, tumhe āyasmanto imaṃ bhikkhuṃ muhuttaṃ muñcatha, yāvāyaṃ bhikkhu pavāretī’’ti ",
      ". Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, te bhikkhupaccatthikā bhikkhūhi evamassu vacanīyā – ‘‘iṅgha, tumhe āyasmanto muhuttaṃ ekamantaṃ hotha, yāvāyaṃ bhikkhu pavāraṇaṃ detī’’ti. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, te bhikkhupaccatthikā bhikkhūhi evamassu vacanīyā – ‘‘iṅgha, tumhe āyasmanto imaṃ bhikkhuṃ muhuttaṃ nissīmaṃ netha, yāva saṅgho pavāretī’’ti. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, na ",
      " tveva vaggena saṅghena pavāretabbaṃ. Pavāreyya ce, āpatti dukkaṭassāti."
    ],
    "innerText": "Idha pana, bhikkhave, bhikkhuṃ tadahu pavāraṇāya rājāno gaṇhanti…pe… corā gaṇhanti … dhuttā gaṇhanti… bhikkhupaccatthikā gaṇhanti. Te bhikkhupaccatthikā bhikkhūhi evamassu vacanīyā – ‘‘iṅgha, tumhe āyasmanto imaṃ bhikkhuṃ muhuttaṃ muñcatha, yāvāyaṃ bhikkhu pavāretī’’ti . Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, te bhikkhupaccatthikā bhikkhūhi evamassu vacanīyā – ‘‘iṅgha, tumhe āyasmanto muhuttaṃ ekamantaṃ hotha, yāvāyaṃ bhikkhu pavāraṇaṃ detī’’ti. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, te bhikkhupaccatthikā bhikkhūhi evamassu vacanīyā – ‘‘iṅgha, tumhe āyasmanto imaṃ bhikkhuṃ muhuttaṃ nissīmaṃ netha, yāva saṅgho pavāretī’’ti. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, na tveva vaggena saṅghena pavāretabbaṃ. Pavāreyya ce, āpatti dukkaṭassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ñātakādiggahaṇakathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "124. Saṅghapavāraṇādippabhedā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "215"
      },
      ". Tena kho pana samayena aññatarasmiṃ āvāse tadahu pavāraṇāya pañca bhikkhū viharanti. Atha kho tesaṃ bhikkhūnaṃ etadahosi – ‘‘bhagavatā paññattaṃ ‘saṅghena pavāretabba’nti. Mayañcamhā pañca janā. Kathaṃ nu kho amhehi pavāretabba’’nti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, pañcannaṃ saṅghe pavāretunti."
    ],
    "innerText": "215. Tena kho pana samayena aññatarasmiṃ āvāse tadahu pavāraṇāya pañca bhikkhū viharanti. Atha kho tesaṃ bhikkhūnaṃ etadahosi – ‘‘bhagavatā paññattaṃ ‘saṅghena pavāretabba’nti. Mayañcamhā pañca janā. Kathaṃ nu kho amhehi pavāretabba’’nti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, pañcannaṃ saṅghe pavāretunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "216"
      },
      ". Tena ",
      " kho pana samayena aññatarasmiṃ āvāse tadahu pavāraṇāya cattāro bhikkhū viharanti. Atha kho tesaṃ bhikkhūnaṃ etadahosi – ‘‘bhagavatā anuññātaṃ pañcannaṃ saṅghe pavāretunti. Mayañcamhā cattāro janā. Kathaṃ nu kho amhehi pavāretabba’’nti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, catunnaṃ aññamaññaṃ pavāretuṃ. Evañca pana, bhikkhave, pavāretabbaṃ. Byattena bhikkhunā paṭibalena te bhikkhū ñāpetabbā –"
    ],
    "innerText": "216. Tena kho pana samayena aññatarasmiṃ āvāse tadahu pavāraṇāya cattāro bhikkhū viharanti. Atha kho tesaṃ bhikkhūnaṃ etadahosi – ‘‘bhagavatā anuññātaṃ pañcannaṃ saṅghe pavāretunti. Mayañcamhā cattāro janā. Kathaṃ nu kho amhehi pavāretabba’’nti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, catunnaṃ aññamaññaṃ pavāretuṃ. Evañca pana, bhikkhave, pavāretabbaṃ. Byattena bhikkhunā paṭibalena te bhikkhū ñāpetabbā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇantu me āyasmanto. Ajja pavāraṇā. Yadāyasmantānaṃ ",
      " pattakallaṃ, mayaṃ aññamaññaṃ pavāreyyāmā’’ti."
    ],
    "innerText": "‘‘Suṇantu me āyasmanto. Ajja pavāraṇā. Yadāyasmantānaṃ pattakallaṃ, mayaṃ aññamaññaṃ pavāreyyāmā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Therena bhikkhunā ekaṃsaṃ uttarāsaṅgaṃ karitvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā te bhikkhū evamassu vacanīyā – ‘‘ahaṃ, āvuso, āyasmante pavāremi diṭṭhena vā sutena vā parisaṅkāya vā. Vadantu maṃ āyasmanto anukampaṃ upādāya. Passanto paṭikarissāmi. Dutiyampi…pe… tatiyampi ahaṃ, āvuso, āyasmante pavāremi diṭṭhena vā sutena vā parisaṅkāya vā. Vadantu maṃ āyasmanto anukampaṃ upādāya. Passanto paṭikarissāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Navakena bhikkhunā ekaṃsaṃ uttarāsaṅgaṃ karitvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā te bhikkhū evamassu vacanīyā – ‘‘ahaṃ, bhante, āyasmante pavāremi diṭṭhena vā sutena vā parisaṅkāya vā. Vadantu maṃ āyasmanto anukampaṃ upādāya. Passanto paṭikarissāmi. Dutiyampi…pe… tatiyampi ahaṃ, bhante, āyasmante pavāremi diṭṭhena vā sutena vā parisaṅkāya ",
      " vā. Vadantu maṃ āyasmanto anukampaṃ upādāya. Passanto paṭikarissāmī’’ti."
    ],
    "innerText": "Navakena bhikkhunā ekaṃsaṃ uttarāsaṅgaṃ karitvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā te bhikkhū evamassu vacanīyā – ‘‘ahaṃ, bhante, āyasmante pavāremi diṭṭhena vā sutena vā parisaṅkāya vā. Vadantu maṃ āyasmanto anukampaṃ upādāya. Passanto paṭikarissāmi. Dutiyampi…pe… tatiyampi ahaṃ, bhante, āyasmante pavāremi diṭṭhena vā sutena vā parisaṅkāya vā. Vadantu maṃ āyasmanto anukampaṃ upādāya. Passanto paṭikarissāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena kho pana samayena aññatarasmiṃ āvāse tadahu pavāraṇāya tayo bhikkhū viharanti. Atha kho tesaṃ bhikkhūnaṃ ",
      " etadahosi – ‘‘bhagavatā anuññātaṃ pañcannaṃ saṅghe pavāretuṃ, catunnaṃ aññamaññaṃ pavāretuṃ. Mayañcamhā tayo janā. Kathaṃ nu kho amhehi pavāretabba’’nti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, tiṇṇaṃ aññamaññaṃ pavāretuṃ. Evañca pana, bhikkhave, pavāretabbaṃ. Byattena bhikkhunā paṭibalena te bhikkhū ñāpetabbā –"
    ],
    "innerText": "Tena kho pana samayena aññatarasmiṃ āvāse tadahu pavāraṇāya tayo bhikkhū viharanti. Atha kho tesaṃ bhikkhūnaṃ etadahosi – ‘‘bhagavatā anuññātaṃ pañcannaṃ saṅghe pavāretuṃ, catunnaṃ aññamaññaṃ pavāretuṃ. Mayañcamhā tayo janā. Kathaṃ nu kho amhehi pavāretabba’’nti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, tiṇṇaṃ aññamaññaṃ pavāretuṃ. Evañca pana, bhikkhave, pavāretabbaṃ. Byattena bhikkhunā paṭibalena te bhikkhū ñāpetabbā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇantu ",
      " me āyasmantā. Ajja pavāraṇā. Yadāyasmantānaṃ pattakallaṃ, mayaṃ aññamaññaṃ pavāreyyāmā’’ti."
    ],
    "innerText": "‘‘Suṇantu me āyasmantā. Ajja pavāraṇā. Yadāyasmantānaṃ pattakallaṃ, mayaṃ aññamaññaṃ pavāreyyāmā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Therena bhikkhunā ekaṃsaṃ uttarāsaṅgaṃ karitvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā te bhikkhū evamassu vacanīyā – ‘‘ahaṃ, āvuso, āyasmante pavāremi diṭṭhena vā sutena vā parisaṅkāya vā. Vadantu maṃ āyasmantā anukampaṃ upādāya. Passanto paṭikarissāmi. Dutiyampi…pe… tatiyampi ahaṃ, āvuso, āyasmante pavāremi diṭṭhena vā sutena vā parisaṅkāya vā. Vadantu maṃ āyasmantā anukampaṃ upādāya. Passanto paṭikarissāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Navakena bhikkhunā ekaṃsaṃ uttarāsaṅgaṃ karitvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā te bhikkhū evamassu vacanīyā – ‘‘ahaṃ, bhante, āyasmante pavāremi diṭṭhena vā sutena vā parisaṅkāya vā. Vadantu maṃ āyasmantā anukampaṃ upādāya. Passanto paṭikarissāmi. Dutiyampi…pe… ",
      " tatiyampi ahaṃ, bhante, āyasmante pavāremi diṭṭhena vā sutena vā parisaṅkāya vā. Vadantu maṃ āyasmantā anukampaṃ upādāya. Passanto paṭikarissāmī’’ti ",
      "."
    ],
    "innerText": "Navakena bhikkhunā ekaṃsaṃ uttarāsaṅgaṃ karitvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā te bhikkhū evamassu vacanīyā – ‘‘ahaṃ, bhante, āyasmante pavāremi diṭṭhena vā sutena vā parisaṅkāya vā. Vadantu maṃ āyasmantā anukampaṃ upādāya. Passanto paṭikarissāmi. Dutiyampi…pe… tatiyampi ahaṃ, bhante, āyasmante pavāremi diṭṭhena vā sutena vā parisaṅkāya vā. Vadantu maṃ āyasmantā anukampaṃ upādāya. Passanto paṭikarissāmī’’ti ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "217"
      },
      ". Tena kho pana samayena aññatarasmiṃ āvāse tadahu pavāraṇāya dve bhikkhū viharanti. Atha kho tesaṃ bhikkhūnaṃ etadahosi – ‘‘bhagavatā anuññātaṃ pañcannaṃ saṅghe pavāretuṃ, catunnaṃ aññamaññaṃ pavāretuṃ, tiṇṇaṃ ",
      " aññamaññaṃ pavāretuṃ. Mayañcamhā dve janā. Kathaṃ nu kho amhehi pavāretabba’’nti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, dvinnaṃ aññamaññaṃ pavāretuṃ. Evañca pana, bhikkhave, pavāretabbaṃ. Therena bhikkhunā ekaṃsaṃ uttarāsaṅgaṃ karitvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā navo bhikkhu evamassa vacanīyo – ‘‘ahaṃ, āvuso, āyasmantaṃ pavāremi diṭṭhena vā sutena vā parisaṅkāya vā. Vadatu maṃ āyasmā anukampaṃ upādāya. Passanto paṭikarissāmi. Dutiyampi…pe… tatiyampi ahaṃ, āvuso, āyasmantaṃ pavāremi diṭṭhena vā sutena vā parisaṅkāya vā. Vadatu maṃ āyasmā anukampaṃ upādāya. Passanto paṭikarissāmī’’ti."
    ],
    "innerText": "217. Tena kho pana samayena aññatarasmiṃ āvāse tadahu pavāraṇāya dve bhikkhū viharanti. Atha kho tesaṃ bhikkhūnaṃ etadahosi – ‘‘bhagavatā anuññātaṃ pañcannaṃ saṅghe pavāretuṃ, catunnaṃ aññamaññaṃ pavāretuṃ, tiṇṇaṃ aññamaññaṃ pavāretuṃ. Mayañcamhā dve janā. Kathaṃ nu kho amhehi pavāretabba’’nti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, dvinnaṃ aññamaññaṃ pavāretuṃ. Evañca pana, bhikkhave, pavāretabbaṃ. Therena bhikkhunā ekaṃsaṃ uttarāsaṅgaṃ karitvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā navo bhikkhu evamassa vacanīyo – ‘‘ahaṃ, āvuso, āyasmantaṃ pavāremi diṭṭhena vā sutena vā parisaṅkāya vā. Vadatu maṃ āyasmā anukampaṃ upādāya. Passanto paṭikarissāmi. Dutiyampi…pe… tatiyampi ahaṃ, āvuso, āyasmantaṃ pavāremi diṭṭhena vā sutena vā parisaṅkāya vā. Vadatu maṃ āyasmā anukampaṃ upādāya. Passanto paṭikarissāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Navakena bhikkhunā ekaṃsaṃ uttarāsaṅgaṃ karitvā ukkuṭikaṃ nisīditvā ",
      " añjaliṃ paggahetvā thero bhikkhu evamassa vacanīyo – ‘‘ahaṃ, bhante, āyasmantaṃ pavāremi diṭṭhena vā sutena vā parisaṅkāya vā. Vadatu maṃ āyasmā anukampaṃ upādāya. Passanto paṭikarissāmi. Dutiyampi…pe… tatiyampi ahaṃ, bhante, āyasmantaṃ pavāremi diṭṭhena vā sutena ",
      " vā parisaṅkāya vā. Vadatu maṃ āyasmā anukampaṃ upādāya. Passanto paṭikarissāmī’’ti."
    ],
    "innerText": "Navakena bhikkhunā ekaṃsaṃ uttarāsaṅgaṃ karitvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā thero bhikkhu evamassa vacanīyo – ‘‘ahaṃ, bhante, āyasmantaṃ pavāremi diṭṭhena vā sutena vā parisaṅkāya vā. Vadatu maṃ āyasmā anukampaṃ upādāya. Passanto paṭikarissāmi. Dutiyampi…pe… tatiyampi ahaṃ, bhante, āyasmantaṃ pavāremi diṭṭhena vā sutena vā parisaṅkāya vā. Vadatu maṃ āyasmā anukampaṃ upādāya. Passanto paṭikarissāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "218"
      },
      ". Tena kho pana samayena aññatarasmiṃ āvāse tadahu pavāraṇāya eko bhikkhu viharati. Atha kho tassa bhikkhuno etadahosi – ‘‘bhagavatā anuññātaṃ pañcannaṃ saṅghe pavāretuṃ, catunnaṃ aññamaññaṃ pavāretuṃ, tiṇṇaṃ aññamaññaṃ pavāretuṃ, dvinnaṃ aññamaññaṃ pavāretuṃ. Ahañcamhi ekako. Kathaṃ nu kho mayā pavāretabba’’nti? Bhagavato etamatthaṃ ārocesuṃ."
    ],
    "innerText": "218. Tena kho pana samayena aññatarasmiṃ āvāse tadahu pavāraṇāya eko bhikkhu viharati. Atha kho tassa bhikkhuno etadahosi – ‘‘bhagavatā anuññātaṃ pañcannaṃ saṅghe pavāretuṃ, catunnaṃ aññamaññaṃ pavāretuṃ, tiṇṇaṃ aññamaññaṃ pavāretuṃ, dvinnaṃ aññamaññaṃ pavāretuṃ. Ahañcamhi ekako. Kathaṃ nu kho mayā pavāretabba’’nti? Bhagavato etamatthaṃ ārocesuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya eko bhikkhu viharati. Tena, bhikkhave, bhikkhunā yattha bhikkhū paṭikkamanti upaṭṭhānasālāya vā maṇḍape vā rukkhamūle vā, so deso sammajjitvā pānīyaṃ paribhojanīyaṃ upaṭṭhāpetvā āsanaṃ paññapetvā padīpaṃ katvā nisīditabbaṃ. Sace aññe bhikkhū āgacchanti, tehi saddhiṃ pavāretabbaṃ; no ce āgacchanti, ‘ajja me pavāraṇā’ti adhiṭṭhātabbaṃ. No ce adhiṭṭheyya, āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "children": [
      "Tatra ",
      ", bhikkhave, yattha ",
      " pañca bhikkhū viharanti, na ekassa pavāraṇaṃ āharitvā"
    ],
    "innerText": "Tatra , bhikkhave, yattha pañca bhikkhū viharanti, na ekassa pavāraṇaṃ āharitvā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Catūhi saṅghe pavāretabbaṃ. Pavāreyyuṃ ce, āpatti dukkaṭassa. Tatra, bhikkhave, yattha cattāro bhikkhū viharanti, na ekassa pavāraṇaṃ āharitvā tīhi aññamaññaṃ pavāretabbaṃ. Pavāreyyuṃ ce, āpatti dukkaṭassa. Tatra, bhikkhave, yattha tayo bhikkhū viharanti, na ",
      " ekassa pavāraṇaṃ āharitvā dvīhi aññamaññaṃ pavāretabbaṃ. Pavāreyyuṃ ce, āpatti dukkaṭassa. Tatra, bhikkhave, yattha dve bhikkhū viharanti, na ekassa pavāraṇaṃ āharitvā ekena adhiṭṭhātabbaṃ. Adhiṭṭheyya ce, āpatti dukkaṭassāti."
    ],
    "innerText": "Catūhi saṅghe pavāretabbaṃ. Pavāreyyuṃ ce, āpatti dukkaṭassa. Tatra, bhikkhave, yattha cattāro bhikkhū viharanti, na ekassa pavāraṇaṃ āharitvā tīhi aññamaññaṃ pavāretabbaṃ. Pavāreyyuṃ ce, āpatti dukkaṭassa. Tatra, bhikkhave, yattha tayo bhikkhū viharanti, na ekassa pavāraṇaṃ āharitvā dvīhi aññamaññaṃ pavāretabbaṃ. Pavāreyyuṃ ce, āpatti dukkaṭassa. Tatra, bhikkhave, yattha dve bhikkhū viharanti, na ekassa pavāraṇaṃ āharitvā ekena adhiṭṭhātabbaṃ. Adhiṭṭheyya ce, āpatti dukkaṭassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Saṅghapavāraṇādippabhedā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "125. Āpattipaṭikammavidhi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "219"
      },
      ". Tena kho pana samayena aññataro bhikkhu tadahu pavāraṇāya āpattiṃ āpanno hoti. Atha kho tassa bhikkhuno etadahosi – ‘‘bhagavatā paññattaṃ ‘na sāpattikena pavāretabba’nti. Ahañcamhi āpattiṃ āpanno. Kathaṃ nu kho mayā paṭipajjitabba’’nti? Bhagavato etamatthaṃ ārocesuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ārocesi (ka.)]"
      },
      "."
    ],
    "innerText": "219. Tena kho pana samayena aññataro bhikkhu tadahu pavāraṇāya āpattiṃ āpanno hoti. Atha kho tassa bhikkhuno etadahosi – ‘‘bhagavatā paññattaṃ ‘na sāpattikena pavāretabba’nti. Ahañcamhi āpattiṃ āpanno. Kathaṃ nu kho mayā paṭipajjitabba’’nti? Bhagavato etamatthaṃ ārocesuṃ [ārocesi (ka.)]."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      " pana, bhikkhave, bhikkhu tadahu pavāraṇāya āpattiṃ āpanno hoti. Tena, bhikkhave, bhikkhunā ekaṃ bhikkhuṃ upasaṅkamitvā ekaṃsaṃ uttarāsaṅgaṃ karitvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā evamassa vacanīyo – ‘‘ahaṃ, āvuso, itthannāmaṃ āpattiṃ āpanno, taṃ paṭidesemī’’ti. Tena vattabbo – ‘‘passasī’’ti. Āma passāmīti. Āyatiṃ saṃvareyyāsīti."
    ],
    "innerText": "Idha pana, bhikkhave, bhikkhu tadahu pavāraṇāya āpattiṃ āpanno hoti. Tena, bhikkhave, bhikkhunā ekaṃ bhikkhuṃ upasaṅkamitvā ekaṃsaṃ uttarāsaṅgaṃ karitvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā evamassa vacanīyo – ‘‘ahaṃ, āvuso, itthannāmaṃ āpattiṃ āpanno, taṃ paṭidesemī’’ti. Tena vattabbo – ‘‘passasī’’ti. Āma passāmīti. Āyatiṃ saṃvareyyāsīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, bhikkhu tadahu pavāraṇāya āpattiyā vematiko hoti. Tena, bhikkhave, bhikkhunā ekaṃ bhikkhuṃ upasaṅkamitvā ",
      " ekaṃsaṃ uttarāsaṅgaṃ karitvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā evamassa vacanīyo – ‘‘ahaṃ, āvuso, itthannāmāya āpattiyā vematiko; yadā nibbematiko bhavissāmi tadā taṃ āpattiṃ paṭikarissāmī’’ti vatvā pavāretabbaṃ; na tveva tappaccayā pavāraṇāya antarāyo kātabboti."
    ],
    "innerText": "Idha pana, bhikkhave, bhikkhu tadahu pavāraṇāya āpattiyā vematiko hoti. Tena, bhikkhave, bhikkhunā ekaṃ bhikkhuṃ upasaṅkamitvā ekaṃsaṃ uttarāsaṅgaṃ karitvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā evamassa vacanīyo – ‘‘ahaṃ, āvuso, itthannāmāya āpattiyā vematiko; yadā nibbematiko bhavissāmi tadā taṃ āpattiṃ paṭikarissāmī’’ti vatvā pavāretabbaṃ; na tveva tappaccayā pavāraṇāya antarāyo kātabboti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Āpattipaṭikammavidhi niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "126. Āpattiāvikaraṇavidhi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "220"
      },
      ". Tena ",
      " kho pana samayena aññataro bhikkhu pavārayamāno āpattiṃ sarati. Atha kho tassa bhikkhuno etadahosi – ‘‘bhagavatā paññattaṃ ‘na sāpattikena pavāretabba’nti. Ahañcamhi āpattiṃ āpanno. Kathaṃ nu kho mayā paṭipajjitabba’’nti? Bhagavato etamatthaṃ ārocesuṃ."
    ],
    "innerText": "220. Tena kho pana samayena aññataro bhikkhu pavārayamāno āpattiṃ sarati. Atha kho tassa bhikkhuno etadahosi – ‘‘bhagavatā paññattaṃ ‘na sāpattikena pavāretabba’nti. Ahañcamhi āpattiṃ āpanno. Kathaṃ nu kho mayā paṭipajjitabba’’nti? Bhagavato etamatthaṃ ārocesuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, bhikkhu pavārayamāno āpattiṃ sarati. Tena, bhikkhave, bhikkhunā sāmanto bhikkhu evamassa vacanīyo – ‘‘ahaṃ, āvuso, itthannāmaṃ āpattiṃ āpanno. Ito vuṭṭhahitvā taṃ āpattiṃ paṭikarissāmī’’ti vatvā pavāretabbaṃ; na tveva tappaccayā pavāraṇāya antarāyo kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Idha pana, bhikkhave, bhikkhu pavārayamāno āpattiyā vematiko hoti. Tena, bhikkhave,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhikkhunā sāmanto bhikkhu evamassa vacanīyo – ‘‘ahaṃ, āvuso, itthannāmāya āpattiyā vematiko; yadā nibbematiko bhavissāmi tadā taṃ āpattiṃ paṭikarissāmī’’ti vatvā pavāretabbaṃ; na tveva tappaccayā pavāraṇāya antarāyo kātabboti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Āpatti āvikaraṇavidhi niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "127. Sabhāgāpattipaṭikammavidhi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "221"
      },
      ". Tena ",
      " kho pana samayena aññatarasmiṃ āvāse tadahu pavāraṇāya sabbo saṅgho sabhāgaṃ āpattiṃ āpanno hoti. Atha kho tesaṃ bhikkhūnaṃ ",
      " etadahosi – ‘‘bhagavatā paññattaṃ ‘na sabhāgā āpatti desetabbā, na sabhāgā āpatti paṭiggahetabbā’ti. Ayañca sabbo saṅgho sabhāgaṃ āpattiṃ āpanno. Kathaṃ nu kho amhehi paṭipajjitabba’’nti? Bhagavato etamatthaṃ ārocesuṃ."
    ],
    "innerText": "221. Tena kho pana samayena aññatarasmiṃ āvāse tadahu pavāraṇāya sabbo saṅgho sabhāgaṃ āpattiṃ āpanno hoti. Atha kho tesaṃ bhikkhūnaṃ etadahosi – ‘‘bhagavatā paññattaṃ ‘na sabhāgā āpatti desetabbā, na sabhāgā āpatti paṭiggahetabbā’ti. Ayañca sabbo saṅgho sabhāgaṃ āpattiṃ āpanno. Kathaṃ nu kho amhehi paṭipajjitabba’’nti? Bhagavato etamatthaṃ ārocesuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sabbo saṅgho sabhāgaṃ āpattiṃ āpanno hoti. Tehi, bhikkhave, bhikkhūhi eko bhikkhu sāmantā āvāsā sajjukaṃ pāhetabbo – gacchāvuso, taṃ āpattiṃ paṭikaritvā āgaccha, mayaṃ te santike taṃ āpattiṃ paṭikarissāmāti. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu ",
      " me, bhante, saṅgho. Ayaṃ sabbo saṅgho sabhāgaṃ āpattiṃ āpanno. Yadā aññaṃ bhikkhuṃ suddhaṃ anāpattikaṃ passissati tadā tassa santike taṃ āpattiṃ paṭikarissatī’’ti vatvā pavāretabbaṃ; na tveva tappaccayā pavāraṇāya antarāyo kātabbo."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Ayaṃ sabbo saṅgho sabhāgaṃ āpattiṃ āpanno. Yadā aññaṃ bhikkhuṃ suddhaṃ anāpattikaṃ passissati tadā tassa santike taṃ āpattiṃ paṭikarissatī’’ti vatvā pavāretabbaṃ; na tveva tappaccayā pavāraṇāya antarāyo kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sabbo saṅgho sabhāgāya āpattiyā vematiko hoti. Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Ayaṃ sabbo saṅgho sabhāgāya āpattiyā vematiko. Yadā nibbematiko bhavissati tadā taṃ āpattiṃ paṭikarissatī’’ti vatvā, pavāretabbaṃ, na tveva tappaccayā pavāraṇāya antarāyo kātabboti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sabhāgāpattipaṭikammavidhi niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṭhamabhāṇavāro niṭṭhito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "128. Anāpattipannarasakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "222"
      },
      ". Tena ",
      " kho pana samayena aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatiṃsu, pañca vā atirekā vā. Te na jāniṃsu ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te dhammasaññino vinayasaññino vaggā samaggasaññino pavāresuṃ. Tehi pavāriyamāne athaññe āvāsikā bhikkhū āgacchiṃsu bahutarā. Bhagavato etamatthaṃ ārocesuṃ."
    ],
    "innerText": "222. Tena kho pana samayena aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatiṃsu, pañca vā atirekā vā. Te na jāniṃsu ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te dhammasaññino vinayasaññino vaggā samaggasaññino pavāresuṃ. Tehi pavāriyamāne athaññe āvāsikā bhikkhū āgacchiṃsu bahutarā. Bhagavato etamatthaṃ ārocesuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca ",
      " vā atirekā vā. Te na jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te dhammasaññino vinayasaññino vaggā samaggasaññino pavārenti. Tehi pavāriyamāne athaññe āvāsikā bhikkhū āgacchanti bahutarā. Tehi, bhikkhave, bhikkhūhi puna pavāretabbaṃ. Pavāritānaṃ anāpatti."
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te na jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te dhammasaññino vinayasaññino vaggā samaggasaññino pavārenti. Tehi pavāriyamāne athaññe āvāsikā bhikkhū āgacchanti bahutarā. Tehi, bhikkhave, bhikkhūhi puna pavāretabbaṃ. Pavāritānaṃ anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te na jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te dhammasaññino vinayasaññino ",
      " vaggā samaggasaññino pavārenti. Tehi pavāriyamāne athaññe āvāsikā bhikkhū āgacchanti samasamā. Pavāritā suppavāritā, avasesehi pavāretabbaṃ. Pavāritānaṃ anāpatti."
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te na jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te dhammasaññino vinayasaññino vaggā samaggasaññino pavārenti. Tehi pavāriyamāne athaññe āvāsikā bhikkhū āgacchanti samasamā. Pavāritā suppavāritā, avasesehi pavāretabbaṃ. Pavāritānaṃ anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā ",
      " vā. Te na jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te dhammasaññino vinayasaññino vaggā samaggasaññino pavārenti. Tehi pavāriyamāne athaññe āvāsikā bhikkhū āgacchanti thokatarā. Pavāritā suppavāritā, avasesehi pavāretabbaṃ. Pavāritānaṃ anāpatti."
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te na jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te dhammasaññino vinayasaññino vaggā samaggasaññino pavārenti. Tehi pavāriyamāne athaññe āvāsikā bhikkhū āgacchanti thokatarā. Pavāritā suppavāritā, avasesehi pavāretabbaṃ. Pavāritānaṃ anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te na jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te dhammasaññino vinayasaññino vaggā samaggasaññino pavārenti. Tehi ",
      " pavāritamatte athaññe āvāsikā bhikkhū āgacchanti bahutarā. Tehi, bhikkhave, bhikkhūhi puna pavāretabbaṃ. Pavāritānaṃ anāpatti."
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te na jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te dhammasaññino vinayasaññino vaggā samaggasaññino pavārenti. Tehi pavāritamatte athaññe āvāsikā bhikkhū āgacchanti bahutarā. Tehi, bhikkhave, bhikkhūhi puna pavāretabbaṃ. Pavāritānaṃ anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te na jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te dhammasaññino vinayasaññino vaggā samaggasaññino pavārenti. Tehi pavāritamatte athaññe āvāsikā bhikkhū āgacchanti samasamā. Pavāritā suppavāritā, tesaṃ santike pavāretabbaṃ. Pavāritānaṃ anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te na jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te dhammasaññino vinayasaññino vaggā samaggasaññino pavārenti. Tehi pavāritamatte athaññe āvāsikā bhikkhū āgacchanti thokatarā. Pavāritā suppavāritā, tesaṃ santike pavāretabbaṃ. Pavāritānaṃ anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te na jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te dhammasaññino vinayasaññino ",
      " vaggā samaggasaññino pavārenti. Tehi pavāritamatte, avuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti bahutarā. Tehi, bhikkhave, bhikkhūhi puna pavāretabbaṃ. Pavāritānaṃ ",
      " anāpatti."
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te na jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te dhammasaññino vinayasaññino vaggā samaggasaññino pavārenti. Tehi pavāritamatte, avuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti bahutarā. Tehi, bhikkhave, bhikkhūhi puna pavāretabbaṃ. Pavāritānaṃ anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te na jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te dhammasaññino vinayasaññino vaggā samaggasaññino pavārenti. Tehi pavāritamatte, avuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti samasamā. Pavāritā suppavāritā, tesaṃ santike pavāretabbaṃ. Pavāritānaṃ anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te na jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te dhammasaññino vinayasaññino vaggā samaggasaññino pavārenti. Tehi ",
      " pavāritamatte, avuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti thokatarā. Pavāritā suppavāritā, tesaṃ santike pavāretabbaṃ. Pavāritānaṃ anāpatti."
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te na jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te dhammasaññino vinayasaññino vaggā samaggasaññino pavārenti. Tehi pavāritamatte, avuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti thokatarā. Pavāritā suppavāritā, tesaṃ santike pavāretabbaṃ. Pavāritānaṃ anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te na jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te dhammasaññino vinayasaññino vaggā samaggasaññino pavārenti. Tehi pavāritamatte, ekaccāya vuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti bahutarā. Tehi, bhikkhave, bhikkhūhi puna pavāretabbaṃ. Pavāritānaṃ anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te na jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te dhammasaññino vinayasaññino vaggā samaggasaññino pavārenti. Tehi pavāritamatte, ekaccāya vuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti samasamā. Pavāritā suppavāritā, tesaṃ santike pavāretabbaṃ. Pavāritānaṃ anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      " pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te na jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te dhammasaññino vinayasaññino vaggā samaggasaññino pavārenti. Tehi pavāritamatte, ekaccāya vuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti thokatarā. Pavāritā suppavāritā, tesaṃ santike pavāretabbaṃ. Pavāritānaṃ anāpatti."
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te na jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te dhammasaññino vinayasaññino vaggā samaggasaññino pavārenti. Tehi pavāritamatte, ekaccāya vuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti thokatarā. Pavāritā suppavāritā, tesaṃ santike pavāretabbaṃ. Pavāritānaṃ anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      " pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te na jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te dhammasaññino vinayasaññino vaggā samaggasaññino pavārenti. Tehi pavāritamatte, sabbāya vuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti bahutarā. Tehi, bhikkhave, bhikkhūhi puna pavāretabbaṃ. Pavāritānaṃ anāpatti."
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te na jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te dhammasaññino vinayasaññino vaggā samaggasaññino pavārenti. Tehi pavāritamatte, sabbāya vuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti bahutarā. Tehi, bhikkhave, bhikkhūhi puna pavāretabbaṃ. Pavāritānaṃ anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te na jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te dhammasaññino vinayasaññino vaggā samaggasaññino pavārenti. Tehi ",
      " pavāritamatte, sabbāya vuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti samasamā. Pavāritā suppavāritā, tesaṃ santike pavāretabbaṃ. Pavāritānaṃ anāpatti."
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te na jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te dhammasaññino vinayasaññino vaggā samaggasaññino pavārenti. Tehi pavāritamatte, sabbāya vuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti samasamā. Pavāritā suppavāritā, tesaṃ santike pavāretabbaṃ. Pavāritānaṃ anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te na jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te dhammasaññino vinayasaññino vaggā samaggasaññino pavārenti. Tehi pavāritamatte, sabbāya vuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti thokatarā. Pavāritā suppavāritā, tesaṃ santike pavāretabbaṃ. Pavāritānaṃ anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Anāpattipannarasakaṃ niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "129. Vaggāvaggasaññīpannarasakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "223"
      },
      ". Idha ",
      " pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te dhammasaññino vinayasaññino vaggā vaggasaññino pavārenti. Tehi pavāriyamāne athaññe āvāsikā bhikkhū āgacchanti bahutarā. Tehi, bhikkhave, bhikkhūhi puna pavāretabbaṃ. Pavāritānaṃ āpatti dukkaṭassa."
    ],
    "innerText": "223. Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te dhammasaññino vinayasaññino vaggā vaggasaññino pavārenti. Tehi pavāriyamāne athaññe āvāsikā bhikkhū āgacchanti bahutarā. Tehi, bhikkhave, bhikkhūhi puna pavāretabbaṃ. Pavāritānaṃ āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te dhammasaññino vinayasaññino vaggā vaggasaññino pavārenti. Tehi pavāriyamāne athaññe āvāsikā bhikkhū ",
      " āgacchanti samasamā. Pavāritā suppavāritā, avasesehi pavāretabbaṃ. Pavāritānaṃ āpatti dukkaṭassa."
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te dhammasaññino vinayasaññino vaggā vaggasaññino pavārenti. Tehi pavāriyamāne athaññe āvāsikā bhikkhū āgacchanti samasamā. Pavāritā suppavāritā, avasesehi pavāretabbaṃ. Pavāritānaṃ āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te dhammasaññino vinayasaññino vaggā vaggasaññino pavārenti. Tehi pavāriyamāne athaññe āvāsikā bhikkhū āgacchanti thokatarā. Pavāritā suppavāritā, avasesehi pavāretabbaṃ. Pavāritānaṃ āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      " pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te dhammasaññino vinayasaññino vaggā vaggasaññino pavārenti. Tehi pavāritamatte,…pe… avuṭṭhitāya parisāya…pe… ekaccāya vuṭṭhitāya parisāya…pe… sabbāya vuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti bahutarā…pe… samasamā…pe… thokatarā. Pavāritā suppavāritā, tesaṃ santike pavāretabbaṃ. Pavāritānaṃ āpatti dukkaṭassa."
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te dhammasaññino vinayasaññino vaggā vaggasaññino pavārenti. Tehi pavāritamatte,…pe… avuṭṭhitāya parisāya…pe… ekaccāya vuṭṭhitāya parisāya…pe… sabbāya vuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti bahutarā…pe… samasamā…pe… thokatarā. Pavāritā suppavāritā, tesaṃ santike pavāretabbaṃ. Pavāritānaṃ āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vaggāvaggasaññīpannarasakaṃ niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "130. Vematikapannarasakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "224"
      },
      ". Idha ",
      " pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā ",
      " āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘kappati nu kho amhākaṃ pavāretuṃ, na nu kho kappatī’’ti vematikā pavārenti. Tehi pavāriyamāne athaññe āvāsikā bhikkhū āgacchanti bahutarā. Tehi, bhikkhave, bhikkhūhi puna pavāretabbaṃ. Pavāritānaṃ āpatti dukkaṭassa."
    ],
    "innerText": "224. Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘kappati nu kho amhākaṃ pavāretuṃ, na nu kho kappatī’’ti vematikā pavārenti. Tehi pavāriyamāne athaññe āvāsikā bhikkhū āgacchanti bahutarā. Tehi, bhikkhave, bhikkhūhi puna pavāretabbaṃ. Pavāritānaṃ āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘kappati nu kho amhākaṃ pavāretuṃ, na nu kho kappatī’’ti vematikā pavārenti. Tehi pavāriyamāne athaññe āvāsikā bhikkhū āgacchanti samasamā. Pavāritā suppavāritā, avasesehi pavāretabbaṃ. Pavāritānaṃ āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘kappati nu kho amhākaṃ pavāretuṃ, na nu kho kappatī’’ti vematikā pavārenti. Tehi pavāriyamāne athaññe āvāsikā bhikkhū āgacchanti thokatarā. Pavāritā suppavāritā, avasesehi pavāretabbaṃ. Pavāritānaṃ āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      " pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘kappati nu kho amhākaṃ pavāretuṃ, na nu kho kappatī’’ti vematikā pavārenti. Tehi pavāritamatte…pe… avuṭṭhitāya parisāya…pe… ekaccāya vuṭṭhitāya parisāya…pe… sabbāya vuṭṭhitāya parisāya, athaññe āvāsikā ",
      " bhikkhū āgacchanti bahutarā…pe… samasamā…pe… thokatarā. Pavāritā suppavāritā, tesaṃ santike pavāretabbaṃ. Pavāritānaṃ āpatti dukkaṭassa."
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘kappati nu kho amhākaṃ pavāretuṃ, na nu kho kappatī’’ti vematikā pavārenti. Tehi pavāritamatte…pe… avuṭṭhitāya parisāya…pe… ekaccāya vuṭṭhitāya parisāya…pe… sabbāya vuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti bahutarā…pe… samasamā…pe… thokatarā. Pavāritā suppavāritā, tesaṃ santike pavāretabbaṃ. Pavāritānaṃ āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vematikapannarasakaṃ niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "131. Kukkuccapakatapannarasakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "225"
      },
      ". Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘kappateva ",
      " amhākaṃ pavāretuṃ, nāmhākaṃ na kappatī’’ti kukkuccapakatā pavārenti. Tehi pavāriyamāne athaññe āvāsikā bhikkhū āgacchanti bahutarā. Tehi, bhikkhave, bhikkhūhi puna pavāretabbaṃ. Pavāritānaṃ āpatti dukkaṭassa."
    ],
    "innerText": "225. Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘kappateva amhākaṃ pavāretuṃ, nāmhākaṃ na kappatī’’ti kukkuccapakatā pavārenti. Tehi pavāriyamāne athaññe āvāsikā bhikkhū āgacchanti bahutarā. Tehi, bhikkhave, bhikkhūhi puna pavāretabbaṃ. Pavāritānaṃ āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘kappateva amhākaṃ pavāretuṃ, nāmhākaṃ na kappatī’’ti kukkuccapakatā pavārenti. Tehi pavāriyamāne athaññe āvāsikā bhikkhū āgacchanti samasamā. Pavāritā suppavāritā, avasesehi pavāretabbaṃ. Pavāritānaṃ āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, aññarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘kappateva amhākaṃ pavāretuṃ, nāmhākaṃ na kappatī’’ti kukkuccapakatā pavārenti. Tehi pavāriyamāne athaññe āvāsikā bhikkhū āgacchanti thokatarā. Pavāritā suppavāritā, avasesehi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[avasesehi tesaṃ santike (ka.)]"
      },
      " pavāretabbaṃ. Pavāritānaṃ āpatti dukkaṭassa."
    ],
    "innerText": "Idha pana, bhikkhave, aññarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘kappateva amhākaṃ pavāretuṃ, nāmhākaṃ na kappatī’’ti kukkuccapakatā pavārenti. Tehi pavāriyamāne athaññe āvāsikā bhikkhū āgacchanti thokatarā. Pavāritā suppavāritā, avasesehi [avasesehi tesaṃ santike (ka.)] pavāretabbaṃ. Pavāritānaṃ āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      " pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘kappateva amhākaṃ pavāretuṃ, nāmhākaṃ na kappatī’’ti kukkuccapakatā pavārenti. Tehi pavāritamatte,…pe… avuṭṭhitāya parisāya…pe… ekaccāya vuṭṭhitāya parisāya…pe… sabbāya vuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti bahutarā…pe… samasamā…pe… thokatarā. Pavāritā suppavāritā, tesaṃ santike pavāretabbaṃ. Pavāritānaṃ āpatti dukkaṭassa."
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘kappateva amhākaṃ pavāretuṃ, nāmhākaṃ na kappatī’’ti kukkuccapakatā pavārenti. Tehi pavāritamatte,…pe… avuṭṭhitāya parisāya…pe… ekaccāya vuṭṭhitāya parisāya…pe… sabbāya vuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti bahutarā…pe… samasamā…pe… thokatarā. Pavāritā suppavāritā, tesaṃ santike pavāretabbaṃ. Pavāritānaṃ āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Kukkuccapakatapannarasakaṃ niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "132. Bhedapurekkhārapannarasakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "226"
      },
      ". Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya ",
      " sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘nassantete, vinassantete, ko tehi attho’’ti bhedapurekkhārā pavārenti. Tehi pavāriyamāne athaññe āvāsikā bhikkhū āgacchanti bahutarā ",
      ". Tehi, bhikkhave, bhikkhūhi puna pavāretabbaṃ. Pavāritānaṃ āpatti thullaccayassa."
    ],
    "innerText": "226. Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘nassantete, vinassantete, ko tehi attho’’ti bhedapurekkhārā pavārenti. Tehi pavāriyamāne athaññe āvāsikā bhikkhū āgacchanti bahutarā . Tehi, bhikkhave, bhikkhūhi puna pavāretabbaṃ. Pavāritānaṃ āpatti thullaccayassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘nassantete, vinassantete, ko tehi attho’’ti bhedapurekkhārā pavārenti. Tehi pavāriyamāne athaññe āvāsikā bhikkhū āgacchanti samasamā. Pavāritā suppavāritā, avasesehi pavāretabbaṃ. Pavāritānaṃ āpatti thullaccayassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘nassantete, vinassantete ",
      ", ko tehi attho’’ti – bhedapurekkhārā pavārenti. Tehi pavāriyamāne athaññe āvāsikā bhikkhū āgacchanti thokatarā. Pavāritā suppavāritā, avasesehi pavāretabbaṃ. Pavāritānaṃ āpatti thullaccayassa."
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘nassantete, vinassantete , ko tehi attho’’ti – bhedapurekkhārā pavārenti. Tehi pavāriyamāne athaññe āvāsikā bhikkhū āgacchanti thokatarā. Pavāritā suppavāritā, avasesehi pavāretabbaṃ. Pavāritānaṃ āpatti thullaccayassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      " pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘nassantete, vinassantete, ko tehi attho’’ti – bhedapurekkhārā pavārenti. Tehi pavāritamatte athaññe āvāsikā bhikkhū āgacchanti bahutarā, tehi bhikkhave bhikkhūhi puna pavāretabbaṃ, pavāritānaṃ āpatti thullaccayassa."
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘nassantete, vinassantete, ko tehi attho’’ti – bhedapurekkhārā pavārenti. Tehi pavāritamatte athaññe āvāsikā bhikkhū āgacchanti bahutarā, tehi bhikkhave bhikkhūhi puna pavāretabbaṃ, pavāritānaṃ āpatti thullaccayassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘nassantete, vinassantete, ko tehi attho’’ti bhedapurekkhārā pavārenti. Tehi pavāritamatte athaññe āvāsikā bhikkhū āgacchanti samasamā. Pavāritā suppavāritā, tesaṃ santike pavāretabbaṃ. Pavāritānaṃ āpatti thullaccayassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘nassantete, vinassantete, ko tehi attho’’ti bhedapurekkhārā pavārenti. Tehi pavāritamatte athaññe āvāsikā bhikkhū āgacchanti thokatarā. Pavāritā suppavāritā, tesaṃ santike pavāretabbaṃ. Pavāritānaṃ āpatti thullaccayassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘nassantete, vinassantete, ko tehi attho’’ti bhedapurekkhārā pavārenti. Tehi pavāritamatte, avuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū ",
      " āgacchanti bahutarā. Tehi, bhikkhave, bhikkhūhi puna pavāretabbaṃ. Pavāritānaṃ āpatti thullaccayassa."
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘nassantete, vinassantete, ko tehi attho’’ti bhedapurekkhārā pavārenti. Tehi pavāritamatte, avuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti bahutarā. Tehi, bhikkhave, bhikkhūhi puna pavāretabbaṃ. Pavāritānaṃ āpatti thullaccayassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘nassantete, vinassantete, ko tehi attho’’ti bhedapurekkhārā pavārenti. Tehi pavāritamatte, avuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti samasamā. Pavāritā suppavāritā, tesaṃ santike pavāretabbaṃ. Pavāritānaṃ āpatti thullaccayassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      " pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘nassantete, vinassantete, ko tehi attho’’ti bhedapurekkhārā pavārenti. Tehi pavāritamatte, avuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti thokatarā. Pavāritā suppavāritā, tesaṃ santike pavāretabbaṃ. Pavāritānaṃ āpatti thullaccayassa."
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘nassantete, vinassantete, ko tehi attho’’ti bhedapurekkhārā pavārenti. Tehi pavāritamatte, avuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti thokatarā. Pavāritā suppavāritā, tesaṃ santike pavāretabbaṃ. Pavāritānaṃ āpatti thullaccayassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘nassantete, vinassantete, ko tehi attho’’ti bhedapurekkhārā pavārenti. Tehi pavāritamatte, ekaccāya vuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti bahutarā. Tehi, bhikkhave, bhikkhūhi puna pavāretabbaṃ. Pavāritānaṃ āpatti thullaccayassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘nassantete, vinassantete, ko tehi attho’’ti bhedapurekkhārā pavārenti. Tehi pavāritamatte, ekaccāya vuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti samasamā. Pavāritā suppavāritā, tesaṃ santike pavāretabbaṃ. Pavāritānaṃ āpatti thullaccayassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      " pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘nassantete, vinassantete, ko tehi attho’’ti bhedapurekkhārā pavārenti. Tehi pavāritamatte, ekaccāya vuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti thokatarā. Pavāritā suppavāritā, tesaṃ santike pavāretabbaṃ. Pavāritānaṃ āpatti thullaccayassa."
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘nassantete, vinassantete, ko tehi attho’’ti bhedapurekkhārā pavārenti. Tehi pavāritamatte, ekaccāya vuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti thokatarā. Pavāritā suppavāritā, tesaṃ santike pavāretabbaṃ. Pavāritānaṃ āpatti thullaccayassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘nassantete, vinassantete, ko tehi attho’’ti bhedapurekkhārā pavārenti. Tehi ",
      " pavāritamatte, sabbāya vuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti bahutarā. Tehi, bhikkhave, bhikkhūhi puna pavāretabbaṃ. Pavāritānaṃ āpatti thullaccayassa."
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘nassantete, vinassantete, ko tehi attho’’ti bhedapurekkhārā pavārenti. Tehi pavāritamatte, sabbāya vuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti bahutarā. Tehi, bhikkhave, bhikkhūhi puna pavāretabbaṃ. Pavāritānaṃ āpatti thullaccayassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘nassantete, vinassantete, ko tehi attho’’ti bhedapurekkhārā pavārenti. Tehi pavāritamatte, sabbāya vuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti samasamā. Pavāritā suppavāritā, tesaṃ santike pavāretabbaṃ. Pavāritānaṃ āpatti thullaccayassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhikkhū sannipatanti, pañca vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘nassantete, vinassantete, ko tehi attho’’ti bhedapurekkhārā pavārenti. Tehi pavāritamatte, sabbāya vuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti thokatarā. Pavāritā suppavāritā, tesaṃ santike pavāretabbaṃ. Pavāritānaṃ āpatti thullaccayassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Bhedapurekkhārapannarasakaṃ niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pañcavīsattikā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "133. Sīmottantikapeyyālaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "227"
      },
      ". Idha ",
      " pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te na jānanti ‘‘aññe āvāsikā bhikkhū antosīmaṃ okkamantī’’ti…pe… te na jānanti ‘‘aññe āvāsikā bhikkhū antosīmaṃ okkantā’’ti…pe… te na passanti aññe āvāsike bhikkhū antosīmaṃ ",
      " okkamante…pe… te na passanti aññe āvāsike bhikkhū antosīmaṃ okkante…pe… te na suṇanti ‘‘aññe āvāsikā bhikkhū antosīmaṃ okkamantī’’ti…pe… te na suṇanti ‘‘aññe āvāsikā bhikkhū antosīmaṃ okkantā’’ti…pe…."
    ],
    "innerText": "227. Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya sambahulā āvāsikā bhikkhū sannipatanti, pañca vā atirekā vā. Te na jānanti ‘‘aññe āvāsikā bhikkhū antosīmaṃ okkamantī’’ti…pe… te na jānanti ‘‘aññe āvāsikā bhikkhū antosīmaṃ okkantā’’ti…pe… te na passanti aññe āvāsike bhikkhū antosīmaṃ okkamante…pe… te na passanti aññe āvāsike bhikkhū antosīmaṃ okkante…pe… te na suṇanti ‘‘aññe āvāsikā bhikkhū antosīmaṃ okkamantī’’ti…pe… te na suṇanti ‘‘aññe āvāsikā bhikkhū antosīmaṃ okkantā’’ti…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Āvāsikena ",
      " āvāsikā ekasatapañcasattati tikanayato, āvāsikena āgantukā, āgantukena āvāsikā, āgantukena āgantukā, peyyālamukhena satta tikasatāni honti."
    ],
    "innerText": "Āvāsikena āvāsikā ekasatapañcasattati tikanayato, āvāsikena āgantukā, āgantukena āvāsikā, āgantukena āgantukā, peyyālamukhena satta tikasatāni honti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sīmokkantikapeyyālaṃ niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "134. Divasanānattaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "228"
      },
      ". Idha pana, bhikkhave, āvāsikānaṃ bhikkhūnaṃ cātuddaso hoti, āgantukānaṃ pannaraso. Sace āvāsikā bahutarā honti, āgantukehi āvāsikānaṃ anuvattitabbaṃ. Sace samasamā honti, āgantukehi āvāsikānaṃ anuvattitabbaṃ. Sace āgantukā bahutarā honti, āvāsikehi āgantukānaṃ anuvattitabbaṃ."
    ],
    "innerText": "228. Idha pana, bhikkhave, āvāsikānaṃ bhikkhūnaṃ cātuddaso hoti, āgantukānaṃ pannaraso. Sace āvāsikā bahutarā honti, āgantukehi āvāsikānaṃ anuvattitabbaṃ. Sace samasamā honti, āgantukehi āvāsikānaṃ anuvattitabbaṃ. Sace āgantukā bahutarā honti, āvāsikehi āgantukānaṃ anuvattitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, āvāsikānaṃ bhikkhūnaṃ pannaraso hoti, āgantukānaṃ cātuddaso. Sace āvāsikā bahutarā honti, āgantukehi āvāsikānaṃ anuvattitabbaṃ. Sace samasamā honti, āgantukehi āvāsikānaṃ anuvattitabbaṃ. Sace āgantukā bahutarā honti, āvāsikehi āgantukānaṃ anuvattitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, āvāsikānaṃ bhikkhūnaṃ pāṭipado hoti, āgantukānaṃ pannaraso. Sace āvāsikā bahutarā honti, āvāsikehi āgantukānaṃ nākāmā dātabbā sāmaggī; āgantukehi nissīmaṃ gantvā pavāretabbaṃ. Sace samasamā honti, āvāsikehi āgantukānaṃ ",
      " nākāmā dātabbā sāmaggī; āgantukehi nissīmaṃ gantvā pavāretabbaṃ ",
      ". Sace āgantukā bahutarā honti, āvāsikehi āgantukānaṃ sāmaggī vā dātabbā, nissīmaṃ vā gantabbaṃ."
    ],
    "innerText": "Idha pana, bhikkhave, āvāsikānaṃ bhikkhūnaṃ pāṭipado hoti, āgantukānaṃ pannaraso. Sace āvāsikā bahutarā honti, āvāsikehi āgantukānaṃ nākāmā dātabbā sāmaggī; āgantukehi nissīmaṃ gantvā pavāretabbaṃ. Sace samasamā honti, āvāsikehi āgantukānaṃ nākāmā dātabbā sāmaggī; āgantukehi nissīmaṃ gantvā pavāretabbaṃ . Sace āgantukā bahutarā honti, āvāsikehi āgantukānaṃ sāmaggī vā dātabbā, nissīmaṃ vā gantabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, āvāsikānaṃ bhikkhūnaṃ pannaraso hoti, āgantukānaṃ pāṭipado. Sace āvāsikā bahutarā honti, āgantukehi āvāsikānaṃ sāmaggī vā dātabbā, nissīmaṃ vā gantabbaṃ. Sace samasamā honti, āgantukehi āvāsikānaṃ sāmaggī vā dātabbā, nissīmaṃ vā gantabbaṃ. Sace āgantukā bahutarā honti, āgantukehi āvāsikānaṃ nākāmā dātabbā sāmaggī; āvāsikehi nissīmaṃ gantvā pavāretabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Divasanānattaṃ niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "135. Liṅgādidassanaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "229"
      },
      ". Idha ",
      " pana, bhikkhave, āgantukā bhikkhū passanti āvāsikānaṃ bhikkhūnaṃ āvāsikākāraṃ, āvāsikaliṅgaṃ, āvāsikanimittaṃ, āvāsikuddesaṃ, suppaññattaṃ mañcapīṭhaṃ bhisibibbohanaṃ, pānīyaṃ paribhojanīyaṃ sapaṭṭhitaṃ, pariveṇaṃ susammaṭṭhaṃ; passitvā vematikā honti – ‘‘atthi nu kho āvāsikā bhikkhū, natthi nu kho’’ti. Te vematikā na vicinanti, avicinitvā pavārenti. Āpatti dukkaṭassa…pe… te vematikā vicinanti, vicinitvā na passanti, apassitvā pavārenti. Anāpatti. Te vematikā vicinanti, vicinitvā passanti, passitvā ekato pavārenti. Anāpatti. Te vematikā vicinanti, vicinitvā passanti, passitvā pāṭekkaṃ pavārenti. Āpatti dukkaṭassa. Te vematikā vicinanti, vicinitvā passanti, passitvā – ‘‘nassantete, vinassantete, ko tehi attho’’ti – bhedapurekkhārā pavārenti. Āpatti thullaccayassa."
    ],
    "innerText": "229. Idha pana, bhikkhave, āgantukā bhikkhū passanti āvāsikānaṃ bhikkhūnaṃ āvāsikākāraṃ, āvāsikaliṅgaṃ, āvāsikanimittaṃ, āvāsikuddesaṃ, suppaññattaṃ mañcapīṭhaṃ bhisibibbohanaṃ, pānīyaṃ paribhojanīyaṃ sapaṭṭhitaṃ, pariveṇaṃ susammaṭṭhaṃ; passitvā vematikā honti – ‘‘atthi nu kho āvāsikā bhikkhū, natthi nu kho’’ti. Te vematikā na vicinanti, avicinitvā pavārenti. Āpatti dukkaṭassa…pe… te vematikā vicinanti, vicinitvā na passanti, apassitvā pavārenti. Anāpatti. Te vematikā vicinanti, vicinitvā passanti, passitvā ekato pavārenti. Anāpatti. Te vematikā vicinanti, vicinitvā passanti, passitvā pāṭekkaṃ pavārenti. Āpatti dukkaṭassa. Te vematikā vicinanti, vicinitvā passanti, passitvā – ‘‘nassantete, vinassantete, ko tehi attho’’ti – bhedapurekkhārā pavārenti. Āpatti thullaccayassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, āgantukā bhikkhū suṇanti āvāsikānaṃ bhikkhūnaṃ āvāsikākāraṃ, āvāsikaliṅgaṃ, āvāsikanimittaṃ, āvāsikuddesaṃ, caṅkamantānaṃ padasaddaṃ, sajjhāyasaddaṃ, ukkāsitasaddaṃ, khipitasaddaṃ; sutvā vematikā honti – ‘‘atthi nu kho āvāsikā bhikkhū, natthi nu kho’’ti. Te vematikā na vicinanti, avicinitvā pavārenti. Āpatti dukkaṭassa. Te vematikā vicinanti, vicinitvā na passanti, apassitvā pavārenti. Anāpatti. Te vematikā vicinanti, vicinitvā passanti, passitvā ekato pavārenti. Anāpatti. Te vematikā vicinanti, vicinitvā passanti, passitvā ",
      " pāṭekkaṃ pavārenti. Āpatti dukkaṭassa. Te ",
      " vematikā vicinanti, vicinitvā passanti, passitvā ‘‘nassantete, vinassantete, ko tehi attho’’ti bhedapurekkhārā pavārenti. Āpatti thullaccayassa."
    ],
    "innerText": "Idha pana, bhikkhave, āgantukā bhikkhū suṇanti āvāsikānaṃ bhikkhūnaṃ āvāsikākāraṃ, āvāsikaliṅgaṃ, āvāsikanimittaṃ, āvāsikuddesaṃ, caṅkamantānaṃ padasaddaṃ, sajjhāyasaddaṃ, ukkāsitasaddaṃ, khipitasaddaṃ; sutvā vematikā honti – ‘‘atthi nu kho āvāsikā bhikkhū, natthi nu kho’’ti. Te vematikā na vicinanti, avicinitvā pavārenti. Āpatti dukkaṭassa. Te vematikā vicinanti, vicinitvā na passanti, apassitvā pavārenti. Anāpatti. Te vematikā vicinanti, vicinitvā passanti, passitvā ekato pavārenti. Anāpatti. Te vematikā vicinanti, vicinitvā passanti, passitvā pāṭekkaṃ pavārenti. Āpatti dukkaṭassa. Te vematikā vicinanti, vicinitvā passanti, passitvā ‘‘nassantete, vinassantete, ko tehi attho’’ti bhedapurekkhārā pavārenti. Āpatti thullaccayassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, āvāsikā bhikkhū passanti āgantukānaṃ bhikkhūnaṃ āgantukākāraṃ, āgantukaliṅgaṃ, āgantukanimittaṃ, āgantukuddesaṃ, aññātakaṃ pattaṃ, aññātakaṃ cīvaraṃ, aññātakaṃ nisīdanaṃ, pādānaṃ dhotaṃ, udakanissekaṃ; passitvā vematikā honti – ‘‘atthi nu kho āgantukā bhikkhū, natthi nu kho’’ti. Te vematikā na vicinanti, avicinitvā pavārenti. Āpatti dukkaṭassa. Te vematikā ",
      " vicinanti, vicinitvā na passanti, apassitvā pavārenti. Anāpatti. Te vematikā vicinanti, vicinitvā ",
      " passanti, passitvā ekato pavārenti. Anāpatti. Te vematikā vicinanti, vicinitvā passanti, passitvā pāṭekkaṃ pavārenti. Āpatti dukkaṭassa. Te vematikā vicinanti, vicinitvā passanti, passitvā – nassantete, vinassantete, ko tehi atthoti – bhedapurekkhārā pavārenti. Āpatti thullaccayassa."
    ],
    "innerText": "Idha pana, bhikkhave, āvāsikā bhikkhū passanti āgantukānaṃ bhikkhūnaṃ āgantukākāraṃ, āgantukaliṅgaṃ, āgantukanimittaṃ, āgantukuddesaṃ, aññātakaṃ pattaṃ, aññātakaṃ cīvaraṃ, aññātakaṃ nisīdanaṃ, pādānaṃ dhotaṃ, udakanissekaṃ; passitvā vematikā honti – ‘‘atthi nu kho āgantukā bhikkhū, natthi nu kho’’ti. Te vematikā na vicinanti, avicinitvā pavārenti. Āpatti dukkaṭassa. Te vematikā vicinanti, vicinitvā na passanti, apassitvā pavārenti. Anāpatti. Te vematikā vicinanti, vicinitvā passanti, passitvā ekato pavārenti. Anāpatti. Te vematikā vicinanti, vicinitvā passanti, passitvā pāṭekkaṃ pavārenti. Āpatti dukkaṭassa. Te vematikā vicinanti, vicinitvā passanti, passitvā – nassantete, vinassantete, ko tehi atthoti – bhedapurekkhārā pavārenti. Āpatti thullaccayassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Idha pana, bhikkhave, āvāsikā bhikkhū suṇanti āgantukānaṃ bhikkhūnaṃ āgantukākāraṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Āgantukaliṅgaṃ, āgantukanimittaṃ, āgantukuddesaṃ, āgacchantānaṃ padasaddaṃ, upāhanapapphoṭanasaddaṃ, ukkāsitasaddaṃ, khipitasaddaṃ; sutvā vematikā honti – ‘‘atthi nu kho āgantukā bhikkhū, natthi nu kho’’ti. Te vematikā na vicinanti, avicinitvā pavārenti. Āpatti dukkaṭassa. Te vematikā vicinanti, vicinitvā na passanti, apassitvā pavārenti. Anāpatti. Te vematikā vicinanti, vicinitvā passanti, passitvā ekato pavārenti. Anāpatti. Te vematikā vicinanti, vicinitvā passanti, passitvā pāṭekkaṃ pavārenti. Āpatti dukkaṭassa. Te vematikā vicinanti, vicinitvā passanti, passitvā – nassantete, vinassantete, ko tehi atthoti – bhedapurekkhārā pavārenti. Āpatti thullaccayassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Liṅgādidassanaṃ niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "136. Nānāsaṃvāsakādīhi pavāraṇā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "230"
      },
      ". Idha pana, bhikkhave, āgantukā bhikkhū passanti āvāsike bhikkhū nānāsaṃvāsake. Te samānasaṃvāsakadiṭṭhiṃ paṭilabhanti, samānasaṃvāsakadiṭṭhiṃ ",
      " paṭilabhitvā na pucchanti, apucchitvā ekato pavārenti. Anāpatti. Te pucchanti, pucchitvā nābhivitaranti, anabhivitaritvā ekato pavārenti. Āpatti dukkaṭassa. Te pucchanti, pucchitvā nābhivitaranti, anabhivitaritvā pāṭekkaṃ pavārenti. Anāpatti."
    ],
    "innerText": "230. Idha pana, bhikkhave, āgantukā bhikkhū passanti āvāsike bhikkhū nānāsaṃvāsake. Te samānasaṃvāsakadiṭṭhiṃ paṭilabhanti, samānasaṃvāsakadiṭṭhiṃ paṭilabhitvā na pucchanti, apucchitvā ekato pavārenti. Anāpatti. Te pucchanti, pucchitvā nābhivitaranti, anabhivitaritvā ekato pavārenti. Āpatti dukkaṭassa. Te pucchanti, pucchitvā nābhivitaranti, anabhivitaritvā pāṭekkaṃ pavārenti. Anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, āgantukā bhikkhū passanti āvāsike bhikkhū samānasaṃvāsake. Te nānāsaṃvāsakadiṭṭhiṃ paṭilabhanti, nānāsaṃvāsakadiṭṭhiṃ paṭilabhitvā na pucchanti, apucchitvā ekato pavārenti. Āpatti dukkaṭassa. Te pucchanti, pucchitvā abhivitaranti, abhivitaritvā pāṭekkaṃ pavārenti. Āpatti dukkaṭassa. Te pucchanti, pucchitvā abhivitaranti, abhivitaritvā ekato pavārenti. Anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      " pana, bhikkhave, āvāsikā bhikkhū passanti āgantuke bhikkhū nānāsaṃvāsake. Te samānasaṃvāsakadiṭṭhiṃ paṭilabhanti, samānasaṃvāsakadiṭṭhiṃ paṭilabhitvā na pucchanti, apucchitvā ekato pavārenti. Anāpatti. Te pucchanti, pucchitvā nābhivitaranti, anabhivitaritvā ekato pavārenti. Āpatti dukkaṭassa. Te pucchanti, pucchitvā nābhivitaranti, anabhivitaritvā pāṭekkaṃ pavārenti. Anāpatti."
    ],
    "innerText": "Idha pana, bhikkhave, āvāsikā bhikkhū passanti āgantuke bhikkhū nānāsaṃvāsake. Te samānasaṃvāsakadiṭṭhiṃ paṭilabhanti, samānasaṃvāsakadiṭṭhiṃ paṭilabhitvā na pucchanti, apucchitvā ekato pavārenti. Anāpatti. Te pucchanti, pucchitvā nābhivitaranti, anabhivitaritvā ekato pavārenti. Āpatti dukkaṭassa. Te pucchanti, pucchitvā nābhivitaranti, anabhivitaritvā pāṭekkaṃ pavārenti. Anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, āvāsikā bhikkhū passanti āgantuke bhikkhū samānasaṃvāsake. Te nānāsaṃvāsakadiṭṭhiṃ paṭilabhanti, nānāsaṃvāsakadiṭṭhiṃ paṭilabhitvā na pucchanti, apucchitvā ",
      " ekato pavārenti. Āpatti dukkaṭassa. Te pucchanti, pucchitvā abhivitaranti, abhivitaritvā pāṭekkaṃ pavārenti. Āpatti dukkaṭassa. Te pucchanti, pucchitvā abhivitaranti, abhivitaritvā ekato pavārenti. Anāpatti."
    ],
    "innerText": "Idha pana, bhikkhave, āvāsikā bhikkhū passanti āgantuke bhikkhū samānasaṃvāsake. Te nānāsaṃvāsakadiṭṭhiṃ paṭilabhanti, nānāsaṃvāsakadiṭṭhiṃ paṭilabhitvā na pucchanti, apucchitvā ekato pavārenti. Āpatti dukkaṭassa. Te pucchanti, pucchitvā abhivitaranti, abhivitaritvā pāṭekkaṃ pavārenti. Āpatti dukkaṭassa. Te pucchanti, pucchitvā abhivitaranti, abhivitaritvā ekato pavārenti. Anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Nānāsaṃvāsakādīhi pavāraṇā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "137. Na gantabbavāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "231"
      },
      ". Na, bhikkhave, tadahu pavāraṇāya sabhikkhukā āvāsā abhikkhuko āvāso gantabbo, aññatra saṅghena, aññatra antarāyā. Na, bhikkhave, tadahu pavāraṇāya sabhikkhukā āvāsā abhikkhuko anāvāso gantabbo, aññatra saṅghena, aññatra antarāyā. Na, bhikkhave, tadahu pavāraṇāya sabhikkhukā āvāsā abhikkhuko āvāso vā anāvāso vā gantabbo, aññatra saṅghena, aññatra antarāyā."
    ],
    "innerText": "231. Na, bhikkhave, tadahu pavāraṇāya sabhikkhukā āvāsā abhikkhuko āvāso gantabbo, aññatra saṅghena, aññatra antarāyā. Na, bhikkhave, tadahu pavāraṇāya sabhikkhukā āvāsā abhikkhuko anāvāso gantabbo, aññatra saṅghena, aññatra antarāyā. Na, bhikkhave, tadahu pavāraṇāya sabhikkhukā āvāsā abhikkhuko āvāso vā anāvāso vā gantabbo, aññatra saṅghena, aññatra antarāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Na ",
      ", bhikkhave, tadahu pavāraṇāya sabhikkhukā anāvāsā abhikkhuko āvāso gantabbo, aññatra saṅghena, aññatra antarāyā. Na, bhikkhave, tadahu pavāraṇāya sabhikkhukā anāvāsā abhikkhuko anāvāso gantabbo, aññatra saṅghena, aññatra antarāyā. Na, bhikkhave, tadahu pavāraṇāya sabhikkhukā anāvāsā abhikkhuko āvāso vā anāvāso vā gantabbo, aññatra saṅghena, aññatra antarāyā."
    ],
    "innerText": "Na , bhikkhave, tadahu pavāraṇāya sabhikkhukā anāvāsā abhikkhuko āvāso gantabbo, aññatra saṅghena, aññatra antarāyā. Na, bhikkhave, tadahu pavāraṇāya sabhikkhukā anāvāsā abhikkhuko anāvāso gantabbo, aññatra saṅghena, aññatra antarāyā. Na, bhikkhave, tadahu pavāraṇāya sabhikkhukā anāvāsā abhikkhuko āvāso vā anāvāso vā gantabbo, aññatra saṅghena, aññatra antarāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Na, bhikkhave, tadahu pavāraṇāya sabhikkhukā āvāsā vā anāvāsā vā abhikkhuko āvāso gantabbo, aññatra saṅghena, aññatra antarāyā. Na, bhikkhave, tadahu pavāraṇāya sabhikkhukā ",
      " āvāsā vā anāvāsā vā abhikkhuko anāvāso gantabbo, aññatra saṅghena, aññatra antarāyā ",
      ". Na, bhikkhave, tadahu pavāraṇāya sabhikkhukā āvāsā vā anāvāsā vā abhikkhuko āvāso vā anāvāso vā gantabbo, aññatra saṅghena, aññatra antarāyā."
    ],
    "innerText": "Na, bhikkhave, tadahu pavāraṇāya sabhikkhukā āvāsā vā anāvāsā vā abhikkhuko āvāso gantabbo, aññatra saṅghena, aññatra antarāyā. Na, bhikkhave, tadahu pavāraṇāya sabhikkhukā āvāsā vā anāvāsā vā abhikkhuko anāvāso gantabbo, aññatra saṅghena, aññatra antarāyā . Na, bhikkhave, tadahu pavāraṇāya sabhikkhukā āvāsā vā anāvāsā vā abhikkhuko āvāso vā anāvāso vā gantabbo, aññatra saṅghena, aññatra antarāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Na, bhikkhave, tadahu pavāraṇāya sabhikkhukā āvāsā sabhikkhuko āvāso gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra saṅghena, aññatra antarāyā. Na, bhikkhave, tadahu pavāraṇāya sabhikkhukā āvāsā sabhikkhuko anāvāso gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra saṅghena, aññatra antarāyā. Na, bhikkhave, tadahu pavāraṇāya sabhikkhukā āvāsā sabhikkhuko āvāso vā anāvāso vā gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra saṅghena, aññatra antarāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Na, bhikkhave, tadahu pavāraṇāya sabhikkhukā anāvāsā sabhikkhuko āvāso gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra saṅghena, aññatra antarāyā. Na, bhikkhave, tadahu pavāraṇāya sabhikkhukā anāvāsā sabhikkhuko anāvāso gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra saṅghena, aññatra antarāyā. Na, bhikkhave, tadahu pavāraṇāya sabhikkhukā anāvāsā sabhikkhuko āvāso vā anāvāso vā gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra saṅghena, aññatra antarāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "children": [
      "Na ",
      ", bhikkhave, tadahu pavāraṇāya sabhikkhukā āvāsā vā anāvāsā"
    ],
    "innerText": "Na , bhikkhave, tadahu pavāraṇāya sabhikkhukā āvāsā vā anāvāsā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Vā sabhikkhuko āvāso gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra saṅghena, aññatra antarāyā. Na, bhikkhave, tadahu pavāraṇāya sabhikkhukā āvāsā vā anāvāsā vā sabhikkhuko anāvāso gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra saṅghena, aññatra antarāyā. Na, bhikkhave, tadahu pavāraṇāya sabhikkhukā āvāsā vā anāvāsā vā sabhikkhuko āvāso vā anāvāso vā gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra saṅghena, aññatra antarāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Na gantabbavāro niṭṭhito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "138. Gantabbavāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "232"
      },
      ". Gantabbo, bhikkhave, tadahu pavāraṇāya sabhikkhukā āvāsā sabhikkhuko āvāso ",
      ", yatthassu bhikkhū samānasaṃvāsakā, yaṃ jaññā ‘‘sakkomi ajjeva gantu’’nti. Gantabbo, bhikkhave, tadahu pavāraṇāya sabhikkhukā āvāsā sabhikkhuko anāvāso…pe… sabhikkhuko āvāso vā anāvāso vā, yatthassu bhikkhū samānasaṃvāsakā, yaṃ jaññā ‘‘sakkomi ajjeva gantu’’nti."
    ],
    "innerText": "232. Gantabbo, bhikkhave, tadahu pavāraṇāya sabhikkhukā āvāsā sabhikkhuko āvāso , yatthassu bhikkhū samānasaṃvāsakā, yaṃ jaññā ‘‘sakkomi ajjeva gantu’’nti. Gantabbo, bhikkhave, tadahu pavāraṇāya sabhikkhukā āvāsā sabhikkhuko anāvāso…pe… sabhikkhuko āvāso vā anāvāso vā, yatthassu bhikkhū samānasaṃvāsakā, yaṃ jaññā ‘‘sakkomi ajjeva gantu’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Gantabbo ",
      ", bhikkhave, tadahu pavāraṇāya sabhikkhukā anāvāsā sabhikkhuko āvāso…pe… sabhikkhuko anāvāso…pe… sabhikkhuko āvāso vā anāvāso vā, yatthassu bhikkhū samānasaṃvāsakā, yaṃ jaññā ‘‘sakkomi ajjeva gantu’’nti."
    ],
    "innerText": "Gantabbo , bhikkhave, tadahu pavāraṇāya sabhikkhukā anāvāsā sabhikkhuko āvāso…pe… sabhikkhuko anāvāso…pe… sabhikkhuko āvāso vā anāvāso vā, yatthassu bhikkhū samānasaṃvāsakā, yaṃ jaññā ‘‘sakkomi ajjeva gantu’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Gantabbo, bhikkhave, tadahu pavāraṇāya sabhikkhukā āvāsā vā anāvāsā vā sabhikkhuko"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Āvāso…pe… sabhikkhuko anāvāso…pe… sabhikkhuko āvāso vā anāvāso vā, yatthassu bhikkhū samānasaṃvāsakā, yaṃ jaññā ‘‘sakkomi ajjeva gantu’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Gantabbavāro niṭṭhito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "139. Vajjanīyapuggalasandassanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "233"
      },
      ". Na, bhikkhave, bhikkhuniyā nisinnaparisāya pavāretabbaṃ. Yo pavāreyya, āpatti dukkaṭassa. Na, bhikkhave, sikkhamānāya…pe… na sāmaṇerassa…pe… na sāmaṇeriyā…pe… na sikkhaṃ paccakkhātakassa…pe… na antimavatthuṃ ajjhāpannakassa nisinnaparisāya pavāretabbaṃ. Yo pavāreyya, āpatti dukkaṭassa ",
      "."
    ],
    "innerText": "233. Na, bhikkhave, bhikkhuniyā nisinnaparisāya pavāretabbaṃ. Yo pavāreyya, āpatti dukkaṭassa. Na, bhikkhave, sikkhamānāya…pe… na sāmaṇerassa…pe… na sāmaṇeriyā…pe… na sikkhaṃ paccakkhātakassa…pe… na antimavatthuṃ ajjhāpannakassa nisinnaparisāya pavāretabbaṃ. Yo pavāreyya, āpatti dukkaṭassa ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Na ",
      " āpattiyā adassane ukkhittakassa nisinnaparisāya pavāretabbaṃ. Yo pavāreyya, yathādhammo kāretabbo. Na āpattiyā appaṭikamme ukkhittakassa…pe… na pāpikāya diṭṭhiyā appaṭinissagge ukkhittakassa nisinnaparisāya pavāretabbaṃ. Yo pavāreyya, yathādhammo kāretabbo."
    ],
    "innerText": "Na āpattiyā adassane ukkhittakassa nisinnaparisāya pavāretabbaṃ. Yo pavāreyya, yathādhammo kāretabbo. Na āpattiyā appaṭikamme ukkhittakassa…pe… na pāpikāya diṭṭhiyā appaṭinissagge ukkhittakassa nisinnaparisāya pavāretabbaṃ. Yo pavāreyya, yathādhammo kāretabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Na paṇḍakassa nisinnaparisāya pavāretabbaṃ. Yo pavāreyya, āpatti dukkaṭassa. Na theyyasaṃvāsakassa…pe… na titthiyapakkantakassa…pe… na tiracchānagatassa…pe… na mātughātakassa…pe… na pitughātakassa…pe… na arahantaghātakassa…pe… na bhikkhunidūsakassa ",
      " …pe… na saṅghabhedakassa…pe… na lohituppādakassa ",
      " …pe… na ubhatobyañjanakassa nisinnaparisāya pavāretabbaṃ. Yo pavāreyya, āpatti dukkaṭassa."
    ],
    "innerText": "Na paṇḍakassa nisinnaparisāya pavāretabbaṃ. Yo pavāreyya, āpatti dukkaṭassa. Na theyyasaṃvāsakassa…pe… na titthiyapakkantakassa…pe… na tiracchānagatassa…pe… na mātughātakassa…pe… na pitughātakassa…pe… na arahantaghātakassa…pe… na bhikkhunidūsakassa …pe… na saṅghabhedakassa…pe… na lohituppādakassa …pe… na ubhatobyañjanakassa nisinnaparisāya pavāretabbaṃ. Yo pavāreyya, āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Na, bhikkhave, pārivāsikapavāraṇādānena pavāretabbaṃ, aññatra avuṭṭhitāya parisāya. Na ca, bhikkhave, appavāraṇāya pavāretabbaṃ, aññatra saṅghasāmaggiyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vajjanīyapuggalasandassanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dutiyabhāṇavāro niṭṭhito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "140. Dvevācikādipavāraṇā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "234"
      },
      ". Tena kho pana samayena kosalesu janapade aññatarasmiṃ āvāse tadahu pavāraṇāya savarabhayaṃ ahosi. Bhikkhū nāsakkhiṃsu tevācikaṃ pavāretuṃ. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, dvevācikaṃ pavāretunti."
    ],
    "innerText": "234. Tena kho pana samayena kosalesu janapade aññatarasmiṃ āvāse tadahu pavāraṇāya savarabhayaṃ ahosi. Bhikkhū nāsakkhiṃsu tevācikaṃ pavāretuṃ. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, dvevācikaṃ pavāretunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bāḷhataraṃ savarabhayaṃ ahosi. Bhikkhū nāsakkhiṃsu dvevācikaṃ pavāretuṃ. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, ekavācikaṃ pavāretunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bāḷhataraṃ savarabhayaṃ ahosi. Bhikkhū nāsakkhiṃsu ekavācikaṃ pavāretuṃ. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, samānavassikaṃ pavāretunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena kho pana samayena aññatarasmiṃ āvāse tadahu pavāraṇāya manussehi dānaṃ dentehi yebhuyyena ratti khepitā hoti. Atha kho tesaṃ ",
      " bhikkhūnaṃ etadahosi – ‘‘manussehi dānaṃ dentehi yebhuyyena ratti khepitā. Sace saṅgho tevācikaṃ pavāressati, appavāritova saṅgho bhavissati, athāyaṃ ratti vibhāyissati. Kathaṃ nu kho amhehi paṭipajjitabba’’nti? Bhagavato etamatthaṃ ārocesuṃ. Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya manussehi dānaṃ dentehi yebhuyyena ratti khepitā hoti. Tatra ce, bhikkhave, bhikkhūnaṃ evaṃ hoti – ‘‘manussehi dānaṃ ",
      " dentehi yebhuyyena ratti khepitā. Sace saṅgho tevācikaṃ pavāressati, appavāritova saṅgho bhavissati, athāyaṃ ratti vibhāyissatī’’ti, byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
    ],
    "innerText": "Tena kho pana samayena aññatarasmiṃ āvāse tadahu pavāraṇāya manussehi dānaṃ dentehi yebhuyyena ratti khepitā hoti. Atha kho tesaṃ bhikkhūnaṃ etadahosi – ‘‘manussehi dānaṃ dentehi yebhuyyena ratti khepitā. Sace saṅgho tevācikaṃ pavāressati, appavāritova saṅgho bhavissati, athāyaṃ ratti vibhāyissati. Kathaṃ nu kho amhehi paṭipajjitabba’’nti? Bhagavato etamatthaṃ ārocesuṃ. Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya manussehi dānaṃ dentehi yebhuyyena ratti khepitā hoti. Tatra ce, bhikkhave, bhikkhūnaṃ evaṃ hoti – ‘‘manussehi dānaṃ dentehi yebhuyyena ratti khepitā. Sace saṅgho tevācikaṃ pavāressati, appavāritova saṅgho bhavissati, athāyaṃ ratti vibhāyissatī’’ti, byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu ",
      " me, bhante, saṅgho. Manussehi dānaṃ ",
      " dentehi yebhuyyena ratti khepitā. Sace saṅgho tevācikaṃ pavāressati, appavāritova saṅgho bhavissati, athāyaṃ ratti vibhāyissati. Yadi saṅghassa pattakallaṃ, saṅgho dvevācikaṃ, ekavācikaṃ, samānavassikaṃ pavāreyyā’’ti."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Manussehi dānaṃ dentehi yebhuyyena ratti khepitā. Sace saṅgho tevācikaṃ pavāressati, appavāritova saṅgho bhavissati, athāyaṃ ratti vibhāyissati. Yadi saṅghassa pattakallaṃ, saṅgho dvevācikaṃ, ekavācikaṃ, samānavassikaṃ pavāreyyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya bhikkhūhi dhammaṃ bhaṇantehi…pe… suttantikehi suttantaṃ saṅgāyantehi… vinayadharehi vinayaṃ vinicchinantehi… dhammakathikehi dhammaṃ sākacchantehi… bhikkhūhi kalahaṃ karontehi yebhuyyena ratti khepitā hoti. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘bhikkhūhi kalahaṃ karontehi yebhuyyena ratti khepitā. Sace saṅgho tevācikaṃ pavāressati, appavāritova saṅgho bhavissati, athāyaṃ ratti vibhāyissatī’’ti, byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Bhikkhūhi kalahaṃ karontehi yebhuyyena ratti khepitā. Sace saṅgho tevācikaṃ pavāressati, appavāritova saṅgho bhavissati, athāyaṃ ratti vibhāyissati. Yadi saṅghassa pattakallaṃ, saṅgho dvevācikaṃ, ekavācikaṃ, samānavassikaṃ pavāreyyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena kho pana samayena kosalesu ",
      " janapade aññatarasmiṃ āvāse tadahu pavāraṇāya mahābhikkhusaṅgho sannipatito hoti ",
      ", parittañca anovassikaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[anovassakaṃ (ka.)]"
      },
      " hoti, mahā ca megho uggato hoti. Atha kho tesaṃ bhikkhūnaṃ etadahosi – ‘‘ayaṃ kho mahābhikkhusaṅgho sannipatito, parittañca anovassikaṃ, mahā ca megho uggato. Sace saṅgho tevācikaṃ pavāressati, appavāritova saṅgho bhavissati, athāyaṃ megho pavassissati. Kathaṃ nu kho amhehi paṭipajjitabba’’nti? Bhagavato etamatthaṃ ārocesuṃ. Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya mahābhikkhusaṅgho sannipatito hoti, parittañca anovassikaṃ hoti, mahā ca megho uggato hoti. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho mahābhikkhusaṅgho sannipatito, parittañca anovassikaṃ, mahā ca megho uggato. Sace saṅgho tevācikaṃ pavāressati, appavāritova saṅgho bhavissati, athāyaṃ megho pavassissatī’’ti. Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
    ],
    "innerText": "Tena kho pana samayena kosalesu janapade aññatarasmiṃ āvāse tadahu pavāraṇāya mahābhikkhusaṅgho sannipatito hoti , parittañca anovassikaṃ [anovassakaṃ (ka.)] hoti, mahā ca megho uggato hoti. Atha kho tesaṃ bhikkhūnaṃ etadahosi – ‘‘ayaṃ kho mahābhikkhusaṅgho sannipatito, parittañca anovassikaṃ, mahā ca megho uggato. Sace saṅgho tevācikaṃ pavāressati, appavāritova saṅgho bhavissati, athāyaṃ megho pavassissati. Kathaṃ nu kho amhehi paṭipajjitabba’’nti? Bhagavato etamatthaṃ ārocesuṃ. Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya mahābhikkhusaṅgho sannipatito hoti, parittañca anovassikaṃ hoti, mahā ca megho uggato hoti. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho mahābhikkhusaṅgho sannipatito, parittañca anovassikaṃ, mahā ca megho uggato. Sace saṅgho tevācikaṃ pavāressati, appavāritova saṅgho bhavissati, athāyaṃ megho pavassissatī’’ti. Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu me, bhante, saṅgho. Ayaṃ mahābhikkhusaṅgho sannipatito, parittañca anovassikaṃ, mahā ca megho uggato. Sace saṅgho tevācikaṃ pavāressati, appavāritova saṅgho ",
      " bhavissati, athāyaṃ megho pavassissati. Yadi saṅghassa pattakallaṃ, saṅgho dvevācikaṃ, ekavācikaṃ, samānavassikaṃ pavāreyyā’’ti."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Ayaṃ mahābhikkhusaṅgho sannipatito, parittañca anovassikaṃ, mahā ca megho uggato. Sace saṅgho tevācikaṃ pavāressati, appavāritova saṅgho bhavissati, athāyaṃ megho pavassissati. Yadi saṅghassa pattakallaṃ, saṅgho dvevācikaṃ, ekavācikaṃ, samānavassikaṃ pavāreyyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya rājantarāyo hoti…pe… corantarāyo hoti… agyantarāyo hoti… udakantarāyo ",
      " hoti… manussantarāyo hoti… amanussantarāyo hoti… vāḷantarāyo hoti… sarīsapantarāyo hoti… jīvitantarāyo hoti… brahmacariyantarāyo hoti. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, brahmacariyantarāyo ",
      ". Sace saṅgho tevācikaṃ pavāressati, appavāritova saṅgho bhavissati, athāyaṃ brahmacariyantarāyo bhavissatī’’ti, byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahu pavāraṇāya rājantarāyo hoti…pe… corantarāyo hoti… agyantarāyo hoti… udakantarāyo hoti… manussantarāyo hoti… amanussantarāyo hoti… vāḷantarāyo hoti… sarīsapantarāyo hoti… jīvitantarāyo hoti… brahmacariyantarāyo hoti. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘ayaṃ kho, brahmacariyantarāyo . Sace saṅgho tevācikaṃ pavāressati, appavāritova saṅgho bhavissati, athāyaṃ brahmacariyantarāyo bhavissatī’’ti, byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu me, bhante, saṅgho. Ayaṃ brahmacariyantarāyo. Sace saṅgho tevācikaṃ pavāressati, appavāritova saṅgho bhavissati, athāyaṃ ",
      " brahmacariyantarāyo bhavissati. Yadi saṅghassa pattakallaṃ, saṅgho dvevācikaṃ, ekavācikaṃ, samānavassikaṃ pavāreyyā’’ti."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Ayaṃ brahmacariyantarāyo. Sace saṅgho tevācikaṃ pavāressati, appavāritova saṅgho bhavissati, athāyaṃ brahmacariyantarāyo bhavissati. Yadi saṅghassa pattakallaṃ, saṅgho dvevācikaṃ, ekavācikaṃ, samānavassikaṃ pavāreyyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dvevācikādipavāraṇā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "141. Pavāraṇāṭhapanaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "235"
      },
      ". Tena kho pana samayena chabbaggiyā bhikkhū sāpattikā pavārenti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, sāpattikena pavāretabbaṃ. Yo pavāreyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, yo sāpattiko pavāreti, tassa okāsaṃ kārāpetvā āpattiyā codetunti."
    ],
    "innerText": "235. Tena kho pana samayena chabbaggiyā bhikkhū sāpattikā pavārenti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, sāpattikena pavāretabbaṃ. Yo pavāreyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, yo sāpattiko pavāreti, tassa okāsaṃ kārāpetvā āpattiyā codetunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena kho pana samayena chabbaggiyā bhikkhū okāsaṃ kārāpiyamānā na icchanti okāsaṃ kātuṃ. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, okāsaṃ akarontassa pavāraṇaṃ ṭhapetuṃ. Evañca pana, bhikkhave, ṭhapetabbā. Tadahu pavāraṇāya cātuddase vā pannarase vā tasmiṃ puggale sammukhībhūte saṅghamajjhe udāharitabbaṃ – ‘‘suṇātu me, bhante, saṅgho. Itthannāmo puggalo sāpattiko ",
      ". Tassa pavāraṇaṃ ṭhapemi. Na tasmiṃ sammukhībhūte pavāretabba’’nti. Ṭhapitā hoti pavāraṇāti."
    ],
    "innerText": "Tena kho pana samayena chabbaggiyā bhikkhū okāsaṃ kārāpiyamānā na icchanti okāsaṃ kātuṃ. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, okāsaṃ akarontassa pavāraṇaṃ ṭhapetuṃ. Evañca pana, bhikkhave, ṭhapetabbā. Tadahu pavāraṇāya cātuddase vā pannarase vā tasmiṃ puggale sammukhībhūte saṅghamajjhe udāharitabbaṃ – ‘‘suṇātu me, bhante, saṅgho. Itthannāmo puggalo sāpattiko . Tassa pavāraṇaṃ ṭhapemi. Na tasmiṃ sammukhībhūte pavāretabba’’nti. Ṭhapitā hoti pavāraṇāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena ",
      " kho pana samayena chabbaggiyā bhikkhū – puramhākaṃ pesalā bhikkhū pavāraṇaṃ ṭhapentīti – paṭikacceva suddhānaṃ bhikkhūnaṃ anāpattikānaṃ avatthusmiṃ akāraṇe pavāraṇaṃ ṭhapenti, pavāritānampi pavāraṇaṃ ṭhapenti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, suddhānaṃ bhikkhūnaṃ anāpattikānaṃ avatthusmiṃ akāraṇe pavāraṇā ṭhapetabbā. Yo ṭhapeyya, āpatti dukkaṭassa. Na, bhikkhave, pavāritānampi pavāraṇā ṭhapetabbā. Yo ṭhapeyya, āpatti dukkaṭassa."
    ],
    "innerText": "Tena kho pana samayena chabbaggiyā bhikkhū – puramhākaṃ pesalā bhikkhū pavāraṇaṃ ṭhapentīti – paṭikacceva suddhānaṃ bhikkhūnaṃ anāpattikānaṃ avatthusmiṃ akāraṇe pavāraṇaṃ ṭhapenti, pavāritānampi pavāraṇaṃ ṭhapenti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, suddhānaṃ bhikkhūnaṃ anāpattikānaṃ avatthusmiṃ akāraṇe pavāraṇā ṭhapetabbā. Yo ṭhapeyya, āpatti dukkaṭassa. Na, bhikkhave, pavāritānampi pavāraṇā ṭhapetabbā. Yo ṭhapeyya, āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "236"
      },
      ". Evaṃ kho, bhikkhave, ṭhapitā hoti pavāraṇā, evaṃ aṭṭhapitā. Kathañca, bhikkhave, aṭṭhapitā hoti pavāraṇā? Tevācikāya ce, bhikkhave, pavāraṇāya bhāsitāya lapitāya pariyositāya pavāraṇaṃ ṭhapeti, aṭṭhapitā hoti pavāraṇā. Dvevācikāya ce, bhikkhave,… ekavācikāya ce, bhikkhave,… samānavassikāya ce, bhikkhave, pavāraṇāya bhāsitāya lapitāya pariyositāya pavāraṇaṃ ṭhapeti ",
      ", aṭṭhapitā ",
      " hoti pavāraṇā. Evaṃ kho, bhikkhave, aṭṭhapitā hoti pavāraṇā."
    ],
    "innerText": "236. Evaṃ kho, bhikkhave, ṭhapitā hoti pavāraṇā, evaṃ aṭṭhapitā. Kathañca, bhikkhave, aṭṭhapitā hoti pavāraṇā? Tevācikāya ce, bhikkhave, pavāraṇāya bhāsitāya lapitāya pariyositāya pavāraṇaṃ ṭhapeti, aṭṭhapitā hoti pavāraṇā. Dvevācikāya ce, bhikkhave,… ekavācikāya ce, bhikkhave,… samānavassikāya ce, bhikkhave, pavāraṇāya bhāsitāya lapitāya pariyositāya pavāraṇaṃ ṭhapeti , aṭṭhapitā hoti pavāraṇā. Evaṃ kho, bhikkhave, aṭṭhapitā hoti pavāraṇā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathañca, bhikkhave, ṭhapitā hoti pavāraṇā? Tevācikāya, ce, bhikkhave, pavāraṇāya bhāsitāya lapitāya apariyositāya pavāraṇaṃ ṭhapeti, ṭhapitā hoti pavāraṇā. Dvevācikāya ce, bhikkhave,… ekavācikāya ce, bhikkhave,… samānavassikāya ce, bhikkhave, pavāraṇāya bhāsitāya lapitāya apariyositāya ",
      " pavāraṇaṃ ṭhapeti, ṭhapitā hoti pavāraṇā. Evaṃ kho, bhikkhave, ṭhapitā hoti pavāraṇā."
    ],
    "innerText": "Kathañca, bhikkhave, ṭhapitā hoti pavāraṇā? Tevācikāya, ce, bhikkhave, pavāraṇāya bhāsitāya lapitāya apariyositāya pavāraṇaṃ ṭhapeti, ṭhapitā hoti pavāraṇā. Dvevācikāya ce, bhikkhave,… ekavācikāya ce, bhikkhave,… samānavassikāya ce, bhikkhave, pavāraṇāya bhāsitāya lapitāya apariyositāya pavāraṇaṃ ṭhapeti, ṭhapitā hoti pavāraṇā. Evaṃ kho, bhikkhave, ṭhapitā hoti pavāraṇā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "237"
      },
      ". Idha pana, bhikkhave, tadahu pavāraṇāya bhikkhu bhikkhussa pavāraṇaṃ ṭhapeti. Taṃ ce bhikkhuṃ aññe bhikkhū jānanti, ‘‘ayaṃ kho āyasmā aparisuddhakāyasamācāro, aparisuddhavacīsamācāro, aparisuddhājīvo, bālo, abyatto, na paṭibalo anuyuñjīyamāno anuyogaṃ dātu’’nti, ‘alaṃ, bhikkhu, mā bhaṇḍanaṃ, mā kalahaṃ, mā viggahaṃ, mā vivāda’nti omadditvā saṅghena pavāretabbaṃ."
    ],
    "innerText": "237. Idha pana, bhikkhave, tadahu pavāraṇāya bhikkhu bhikkhussa pavāraṇaṃ ṭhapeti. Taṃ ce bhikkhuṃ aññe bhikkhū jānanti, ‘‘ayaṃ kho āyasmā aparisuddhakāyasamācāro, aparisuddhavacīsamācāro, aparisuddhājīvo, bālo, abyatto, na paṭibalo anuyuñjīyamāno anuyogaṃ dātu’’nti, ‘alaṃ, bhikkhu, mā bhaṇḍanaṃ, mā kalahaṃ, mā viggahaṃ, mā vivāda’nti omadditvā saṅghena pavāretabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, tadahu pavāraṇāya bhikkhu bhikkhussa pavāraṇaṃ ṭhapeti. Taṃ ce bhikkhuṃ aññe bhikkhū jānanti, ‘‘ayaṃ kho āyasmā parisuddhakāyasamācāro, aparisuddhavacīsamācāro, aparisuddhājīvo, bālo, abyatto, na paṭibalo anuyuñjīyamāno anuyogaṃ ",
      " dātu’’nti, ‘alaṃ, bhikkhu, mā bhaṇḍanaṃ, mā kalahaṃ, mā viggahaṃ, mā vivāda’nti omadditvā saṅghena pavāretabbaṃ."
    ],
    "innerText": "Idha pana, bhikkhave, tadahu pavāraṇāya bhikkhu bhikkhussa pavāraṇaṃ ṭhapeti. Taṃ ce bhikkhuṃ aññe bhikkhū jānanti, ‘‘ayaṃ kho āyasmā parisuddhakāyasamācāro, aparisuddhavacīsamācāro, aparisuddhājīvo, bālo, abyatto, na paṭibalo anuyuñjīyamāno anuyogaṃ dātu’’nti, ‘alaṃ, bhikkhu, mā bhaṇḍanaṃ, mā kalahaṃ, mā viggahaṃ, mā vivāda’nti omadditvā saṅghena pavāretabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, tadahu pavāraṇāya bhikkhu bhikkhussa pavāraṇaṃ ṭhapeti. Taṃ ce bhikkhuṃ aññe bhikkhū jānanti, ‘‘ayaṃ kho āyasmā parisuddhakāyasamācāro, parisuddhavacīsamācāro, aparisuddhājīvo, bālo, abyatto, na paṭibalo anuyuñjīyamāno anuyogaṃ dātu’’nti, ‘alaṃ, bhikkhu, mā bhaṇḍanaṃ, mā kalahaṃ, mā viggahaṃ, mā vivāda’nti omadditvā saṅghena pavāretabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, tadahu pavāraṇāya bhikkhu bhikkhussa pavāraṇaṃ ṭhapeti. Taṃ ce bhikkhuṃ aññe bhikkhū jānanti, ‘‘ayaṃ kho āyasmā parisuddhakāyasamācāro ",
      ", parisuddhavacīsamācāro, parisuddhājīvo, bālo, abyatto ",
      ", na paṭibalo anuyuñjīyamāno anuyogaṃ dātu’’nti, ‘alaṃ, bhikkhu, mā bhaṇḍanaṃ, mā kalahaṃ, mā viggahaṃ, mā vivāda’nti omadditvā saṅghena pavāretabbaṃ."
    ],
    "innerText": "Idha pana, bhikkhave, tadahu pavāraṇāya bhikkhu bhikkhussa pavāraṇaṃ ṭhapeti. Taṃ ce bhikkhuṃ aññe bhikkhū jānanti, ‘‘ayaṃ kho āyasmā parisuddhakāyasamācāro , parisuddhavacīsamācāro, parisuddhājīvo, bālo, abyatto , na paṭibalo anuyuñjīyamāno anuyogaṃ dātu’’nti, ‘alaṃ, bhikkhu, mā bhaṇḍanaṃ, mā kalahaṃ, mā viggahaṃ, mā vivāda’nti omadditvā saṅghena pavāretabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, tadahu pavāraṇāya bhikkhu bhikkhussa pavāraṇaṃ ṭhapeti. Taṃ ce bhikkhuṃ aññe bhikkhū jānanti, ‘‘ayaṃ kho āyasmā parisuddhakāyasamācāro, parisuddhavacīsamācāro, parisuddhājīvo, paṇḍito, byatto, paṭibalo anuyuñjīyamāno anuyogaṃ dātu’’nti, so evamassa vacanīyo, ‘‘yaṃ kho tvaṃ, āvuso, imassa bhikkhuno pavāraṇaṃ ṭhapesi, kimhi naṃ ṭhapesi, sīlavipattiyā vā ṭhapesi, ācāravipattiyā vā ṭhapesi, diṭṭhivipattiyā ",
      " vā ṭhapesī’’ti? So ce evaṃ vadeyya – ‘‘sīlavipattiyā vā ṭhapemi, ācāravipattiyā vā ṭhapemi, diṭṭhivipattiyā vā ṭhapemī’’ti, so evamassa vacanīyo – ‘‘jānāsi panāyasmā sīlavipattiṃ, jānāsi ācāravipattiṃ, jānāsi diṭṭhivipatti’’nti? So ce evaṃ vadeyya – ‘‘jānāmi kho ahaṃ, āvuso, sīlavipattiṃ, jānāmi ācāravipattiṃ, jānāmi diṭṭhivipatti’’nti, so evamassa vacanīyo – ‘‘katamā panāvuso, sīlavipatti, katamā ācāravipatti, katamā diṭṭhivipattī’’ti? So ce evaṃ vadeyya – ‘‘cattāri pārājikāni, terasa saṅghādisesā, ayaṃ sīlavipatti; thullaccayaṃ, pācittiyaṃ, pāṭidesanīyaṃ, dukkaṭaṃ, dubbhāsitaṃ, ayaṃ ācāravipatti; micchādiṭṭhi, antaggāhikādiṭṭhi, ayaṃ diṭṭhivipattī’’ti, so evamassa vacanīyo – ‘‘yaṃ kho tvaṃ ",
      ", āvuso, imassa bhikkhuno pavāraṇaṃ ṭhapesi, diṭṭhena vā ṭhapesi, sutena vā ṭhapesi, parisaṅkāya vā ṭhapesī’’ti? So ce ",
      " evaṃ vadeyya – ‘‘diṭṭhena vā ṭhapemi, sutena vā ṭhapemi, parisaṅkāya vā ṭhapemī’’ti, so evamassa vacanīyo – ‘‘yaṃ kho tvaṃ, āvuso, imassa bhikkhuno diṭṭhena pavāraṇaṃ ṭhapesi, kiṃ te diṭṭhaṃ, kinti te diṭṭhaṃ, kadā te diṭṭhaṃ, kattha te diṭṭhaṃ, pārājikaṃ ajjhāpajjanto diṭṭho, saṅghādisesaṃ ajjhāpajjanto diṭṭho, thullaccayaṃ… pācittiyaṃ… pāṭidesanīyaṃ… dukkaṭaṃ… dubbhāsitaṃ ajjhāpajjanto diṭṭho, kattha ca tvaṃ ahosi, kattha cāyaṃ bhikkhu ahosi, kiñca tvaṃ karosi, kiñcāyaṃ bhikkhu karotī’’ti? So ce evaṃ vadeyya – ‘‘na kho ahaṃ, āvuso, imassa bhikkhuno diṭṭhena pavāraṇaṃ ṭhapemi, apica sutena pavāraṇaṃ ṭhapemī’’ti, so evamassa vacanīyo – ‘‘yaṃ kho tvaṃ, āvuso, imassa bhikkhuno ",
      " sutena pavāraṇaṃ ṭhapesi, kiṃ te sutaṃ, kinti te sutaṃ, kadā te sutaṃ, kattha te sutaṃ, pārājikaṃ ajjhāpannoti sutaṃ, saṅghādisesaṃ ajjhāpannoti sutaṃ, thullaccayaṃ… pācittiyaṃ… pāṭidesanīyaṃ… dukkaṭaṃ… dubbhāsitaṃ ajjhāpannoti sutaṃ, bhikkhussa sutaṃ, bhikkhuniyā sutaṃ, sikkhamānāya sutaṃ, sāmaṇerassa sutaṃ, sāmaṇeriyā sutaṃ, upāsakassa sutaṃ, upāsikāya sutaṃ, rājūnaṃ sutaṃ, rājamahāmattānaṃ sutaṃ, titthiyānaṃ sutaṃ, titthiyasāvakānaṃ suta’’nti? So ce evaṃ vadeyya – ‘‘na kho ahaṃ, āvuso, imassa bhikkhuno sutena pavāraṇaṃ ṭhapemi ",
      ", apica parisaṅkāya pavāraṇaṃ ṭhapemī’’ti, so evamassa vacanīyo – ‘‘yaṃ kho tvaṃ, āvuso, imassa bhikkhuno parisaṅkāya pavāraṇaṃ ṭhapesi, kiṃ parisaṅkasi, kinti parisaṅkasi, kadā parisaṅkasi, kattha parisaṅkasi, pārājikaṃ ",
      " ajjhāpannoti parisaṅkasi, saṅghādisesaṃ ajjhāpannoti parisaṅkasi, thullaccayaṃ… pācittiyaṃ… pāṭidesanīyaṃ… dukkaṭaṃ… dubbhāsitaṃ ajjhāpannoti parisaṅkasi, bhikkhussa sutvā parisaṅkasi, bhikkhuniyā sutvā parisaṅkasi, sikkhamānāya sutvā parisaṅkasi, sāmaṇerassa sutvā parisaṅkasi, sāmaṇeriyā sutvā parisaṅkasi, upāsakassa sutvā parisaṅkasi, upāsikāya sutvā parisaṅkasi, rājūnaṃ sutvā parisaṅkasi, rājamahāmattānaṃ sutvā parisaṅkasi, titthiyānaṃ sutvā parisaṅkasi, titthiyasāvakānaṃ sutvā parisaṅkasī’’ti? So ce evaṃ vadeyya – ‘‘na kho ahaṃ, āvuso, imassa bhikkhuno parisaṅkāya pavāraṇaṃ ṭhapemi, api ca ahampi na jānāmi kena panāhaṃ imassa bhikkhuno pavāraṇaṃ ṭhapemī’’ti. So ce, bhikkhave, codako bhikkhu anuyogena viññūnaṃ sabrahmacārīnaṃ cittaṃ na ārādheti, ananuvādo cudito bhikkhūti alaṃ vacanāya. So ce, bhikkhave, codako bhikkhu anuyogena viññūnaṃ sabrahmacārīnaṃ cittaṃ ārādheti, sānuvādo cudito bhikkhūti alaṃ vacanāya. So ce, bhikkhave, codako bhikkhu amūlakena pārājikena anuddhaṃsitaṃ paṭijānāti, saṅghādisesaṃ āropetvā saṅghena pavāretabbaṃ. So ",
      " ce, bhikkhave, codako bhikkhu amūlakena saṅghādisesena anuddhaṃsitaṃ paṭijānāti, yathādhammaṃ kārāpetvā saṅghena pavāretabbaṃ. So ce, bhikkhave, codako, bhikkhu amūlakena thullaccayena… pācittiyena… pāṭidesanīyena… dukkaṭena… dubbhāsitena anuddhaṃsitaṃ paṭijānāti, yathādhammaṃ kārāpetvā ",
      " saṅghena pavāretabbaṃ. So ",
      " ce, bhikkhave, cudito bhikkhu pārājikaṃ ajjhāpannoti paṭijānāti, nāsetvā saṅghena pavāretabbaṃ. So ce, bhikkhave, cudito bhikkhu saṅghādisesaṃ ajjhāpannoti paṭijānāti, saṅghādisesaṃ āropetvā saṅghena pavāretabbaṃ. So ce, bhikkhave, cudito bhikkhu thullaccayaṃ… pācittiyaṃ… pāṭidesanīyaṃ… dukkaṭaṃ… dubbhāsitaṃ ajjhāpannoti paṭijānāti, yathādhammaṃ kārāpetvā saṅghena pavāretabbaṃ."
    ],
    "innerText": "Idha pana, bhikkhave, tadahu pavāraṇāya bhikkhu bhikkhussa pavāraṇaṃ ṭhapeti. Taṃ ce bhikkhuṃ aññe bhikkhū jānanti, ‘‘ayaṃ kho āyasmā parisuddhakāyasamācāro, parisuddhavacīsamācāro, parisuddhājīvo, paṇḍito, byatto, paṭibalo anuyuñjīyamāno anuyogaṃ dātu’’nti, so evamassa vacanīyo, ‘‘yaṃ kho tvaṃ, āvuso, imassa bhikkhuno pavāraṇaṃ ṭhapesi, kimhi naṃ ṭhapesi, sīlavipattiyā vā ṭhapesi, ācāravipattiyā vā ṭhapesi, diṭṭhivipattiyā vā ṭhapesī’’ti? So ce evaṃ vadeyya – ‘‘sīlavipattiyā vā ṭhapemi, ācāravipattiyā vā ṭhapemi, diṭṭhivipattiyā vā ṭhapemī’’ti, so evamassa vacanīyo – ‘‘jānāsi panāyasmā sīlavipattiṃ, jānāsi ācāravipattiṃ, jānāsi diṭṭhivipatti’’nti? So ce evaṃ vadeyya – ‘‘jānāmi kho ahaṃ, āvuso, sīlavipattiṃ, jānāmi ācāravipattiṃ, jānāmi diṭṭhivipatti’’nti, so evamassa vacanīyo – ‘‘katamā panāvuso, sīlavipatti, katamā ācāravipatti, katamā diṭṭhivipattī’’ti? So ce evaṃ vadeyya – ‘‘cattāri pārājikāni, terasa saṅghādisesā, ayaṃ sīlavipatti; thullaccayaṃ, pācittiyaṃ, pāṭidesanīyaṃ, dukkaṭaṃ, dubbhāsitaṃ, ayaṃ ācāravipatti; micchādiṭṭhi, antaggāhikādiṭṭhi, ayaṃ diṭṭhivipattī’’ti, so evamassa vacanīyo – ‘‘yaṃ kho tvaṃ , āvuso, imassa bhikkhuno pavāraṇaṃ ṭhapesi, diṭṭhena vā ṭhapesi, sutena vā ṭhapesi, parisaṅkāya vā ṭhapesī’’ti? So ce evaṃ vadeyya – ‘‘diṭṭhena vā ṭhapemi, sutena vā ṭhapemi, parisaṅkāya vā ṭhapemī’’ti, so evamassa vacanīyo – ‘‘yaṃ kho tvaṃ, āvuso, imassa bhikkhuno diṭṭhena pavāraṇaṃ ṭhapesi, kiṃ te diṭṭhaṃ, kinti te diṭṭhaṃ, kadā te diṭṭhaṃ, kattha te diṭṭhaṃ, pārājikaṃ ajjhāpajjanto diṭṭho, saṅghādisesaṃ ajjhāpajjanto diṭṭho, thullaccayaṃ… pācittiyaṃ… pāṭidesanīyaṃ… dukkaṭaṃ… dubbhāsitaṃ ajjhāpajjanto diṭṭho, kattha ca tvaṃ ahosi, kattha cāyaṃ bhikkhu ahosi, kiñca tvaṃ karosi, kiñcāyaṃ bhikkhu karotī’’ti? So ce evaṃ vadeyya – ‘‘na kho ahaṃ, āvuso, imassa bhikkhuno diṭṭhena pavāraṇaṃ ṭhapemi, apica sutena pavāraṇaṃ ṭhapemī’’ti, so evamassa vacanīyo – ‘‘yaṃ kho tvaṃ, āvuso, imassa bhikkhuno sutena pavāraṇaṃ ṭhapesi, kiṃ te sutaṃ, kinti te sutaṃ, kadā te sutaṃ, kattha te sutaṃ, pārājikaṃ ajjhāpannoti sutaṃ, saṅghādisesaṃ ajjhāpannoti sutaṃ, thullaccayaṃ… pācittiyaṃ… pāṭidesanīyaṃ… dukkaṭaṃ… dubbhāsitaṃ ajjhāpannoti sutaṃ, bhikkhussa sutaṃ, bhikkhuniyā sutaṃ, sikkhamānāya sutaṃ, sāmaṇerassa sutaṃ, sāmaṇeriyā sutaṃ, upāsakassa sutaṃ, upāsikāya sutaṃ, rājūnaṃ sutaṃ, rājamahāmattānaṃ sutaṃ, titthiyānaṃ sutaṃ, titthiyasāvakānaṃ suta’’nti? So ce evaṃ vadeyya – ‘‘na kho ahaṃ, āvuso, imassa bhikkhuno sutena pavāraṇaṃ ṭhapemi , apica parisaṅkāya pavāraṇaṃ ṭhapemī’’ti, so evamassa vacanīyo – ‘‘yaṃ kho tvaṃ, āvuso, imassa bhikkhuno parisaṅkāya pavāraṇaṃ ṭhapesi, kiṃ parisaṅkasi, kinti parisaṅkasi, kadā parisaṅkasi, kattha parisaṅkasi, pārājikaṃ ajjhāpannoti parisaṅkasi, saṅghādisesaṃ ajjhāpannoti parisaṅkasi, thullaccayaṃ… pācittiyaṃ… pāṭidesanīyaṃ… dukkaṭaṃ… dubbhāsitaṃ ajjhāpannoti parisaṅkasi, bhikkhussa sutvā parisaṅkasi, bhikkhuniyā sutvā parisaṅkasi, sikkhamānāya sutvā parisaṅkasi, sāmaṇerassa sutvā parisaṅkasi, sāmaṇeriyā sutvā parisaṅkasi, upāsakassa sutvā parisaṅkasi, upāsikāya sutvā parisaṅkasi, rājūnaṃ sutvā parisaṅkasi, rājamahāmattānaṃ sutvā parisaṅkasi, titthiyānaṃ sutvā parisaṅkasi, titthiyasāvakānaṃ sutvā parisaṅkasī’’ti? So ce evaṃ vadeyya – ‘‘na kho ahaṃ, āvuso, imassa bhikkhuno parisaṅkāya pavāraṇaṃ ṭhapemi, api ca ahampi na jānāmi kena panāhaṃ imassa bhikkhuno pavāraṇaṃ ṭhapemī’’ti. So ce, bhikkhave, codako bhikkhu anuyogena viññūnaṃ sabrahmacārīnaṃ cittaṃ na ārādheti, ananuvādo cudito bhikkhūti alaṃ vacanāya. So ce, bhikkhave, codako bhikkhu anuyogena viññūnaṃ sabrahmacārīnaṃ cittaṃ ārādheti, sānuvādo cudito bhikkhūti alaṃ vacanāya. So ce, bhikkhave, codako bhikkhu amūlakena pārājikena anuddhaṃsitaṃ paṭijānāti, saṅghādisesaṃ āropetvā saṅghena pavāretabbaṃ. So ce, bhikkhave, codako bhikkhu amūlakena saṅghādisesena anuddhaṃsitaṃ paṭijānāti, yathādhammaṃ kārāpetvā saṅghena pavāretabbaṃ. So ce, bhikkhave, codako, bhikkhu amūlakena thullaccayena… pācittiyena… pāṭidesanīyena… dukkaṭena… dubbhāsitena anuddhaṃsitaṃ paṭijānāti, yathādhammaṃ kārāpetvā saṅghena pavāretabbaṃ. So ce, bhikkhave, cudito bhikkhu pārājikaṃ ajjhāpannoti paṭijānāti, nāsetvā saṅghena pavāretabbaṃ. So ce, bhikkhave, cudito bhikkhu saṅghādisesaṃ ajjhāpannoti paṭijānāti, saṅghādisesaṃ āropetvā saṅghena pavāretabbaṃ. So ce, bhikkhave, cudito bhikkhu thullaccayaṃ… pācittiyaṃ… pāṭidesanīyaṃ… dukkaṭaṃ… dubbhāsitaṃ ajjhāpannoti paṭijānāti, yathādhammaṃ kārāpetvā saṅghena pavāretabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pavāraṇāṭhapanaṃ niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "142. Thullaccayavatthukādi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "238"
      },
      ". Idha pana, bhikkhave, bhikkhu tadahu pavāraṇāya thullaccayaṃ ajjhāpanno hoti. Ekacce bhikkhū thullaccayadiṭṭhino honti, ekacce bhikkhū saṅghādisesadiṭṭhino honti. Ye te, bhikkhave, bhikkhū thullaccayadiṭṭhino, tehi so, bhikkhave, bhikkhu ekamantaṃ apanetvā yathādhammaṃ kārāpetvā saṅghaṃ upasaṅkamitvā evamassa vacanīyo – ‘‘yaṃ kho so, āvuso, bhikkhu āpattiṃ āpanno, sāssa yathādhammaṃ paṭikatā. Yadi saṅghassa pattakallaṃ, saṅgho pavāreyyā’’ti."
    ],
    "innerText": "238. Idha pana, bhikkhave, bhikkhu tadahu pavāraṇāya thullaccayaṃ ajjhāpanno hoti. Ekacce bhikkhū thullaccayadiṭṭhino honti, ekacce bhikkhū saṅghādisesadiṭṭhino honti. Ye te, bhikkhave, bhikkhū thullaccayadiṭṭhino, tehi so, bhikkhave, bhikkhu ekamantaṃ apanetvā yathādhammaṃ kārāpetvā saṅghaṃ upasaṅkamitvā evamassa vacanīyo – ‘‘yaṃ kho so, āvuso, bhikkhu āpattiṃ āpanno, sāssa yathādhammaṃ paṭikatā. Yadi saṅghassa pattakallaṃ, saṅgho pavāreyyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, bhikkhu tadahu pavāraṇāya thullaccayaṃ ajjhāpanno hoti. Ekacce bhikkhū thullaccayadiṭṭhino honti, ekacce bhikkhū pācittiyadiṭṭhino ",
      " honti…pe… ekacce bhikkhū ",
      " thullaccayadiṭṭhino honti, ekacce bhikkhū pāṭidesanīyadiṭṭhino honti… ekacce bhikkhū thullaccayadiṭṭhino honti, ekacce bhikkhū dukkaṭadiṭṭhino honti… ekacce bhikkhū thullaccayadiṭṭhino honti, ekacce bhikkhū dubbhāsitadiṭṭhino honti. Ye te, bhikkhave, bhikkhū thullaccayadiṭṭhino, tehi so, bhikkhave, bhikkhu ekamantaṃ apanetvā yathādhammaṃ kārāpetvā saṅghaṃ upasaṅkamitvā evamassa vacanīyo – ‘‘yaṃ kho so, āvuso, bhikkhu āpattiṃ āpanno, sāssa yathādhammaṃ paṭikatā. Yadi saṅghassa pattakallaṃ, saṅgho pavāreyyā’’ti."
    ],
    "innerText": "Idha pana, bhikkhave, bhikkhu tadahu pavāraṇāya thullaccayaṃ ajjhāpanno hoti. Ekacce bhikkhū thullaccayadiṭṭhino honti, ekacce bhikkhū pācittiyadiṭṭhino honti…pe… ekacce bhikkhū thullaccayadiṭṭhino honti, ekacce bhikkhū pāṭidesanīyadiṭṭhino honti… ekacce bhikkhū thullaccayadiṭṭhino honti, ekacce bhikkhū dukkaṭadiṭṭhino honti… ekacce bhikkhū thullaccayadiṭṭhino honti, ekacce bhikkhū dubbhāsitadiṭṭhino honti. Ye te, bhikkhave, bhikkhū thullaccayadiṭṭhino, tehi so, bhikkhave, bhikkhu ekamantaṃ apanetvā yathādhammaṃ kārāpetvā saṅghaṃ upasaṅkamitvā evamassa vacanīyo – ‘‘yaṃ kho so, āvuso, bhikkhu āpattiṃ āpanno, sāssa yathādhammaṃ paṭikatā. Yadi saṅghassa pattakallaṃ, saṅgho pavāreyyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, bhikkhu tadahu pavāraṇāya pācittiyaṃ ajjhāpanno hoti…pe… pāṭidesanīyaṃ ajjhāpanno hoti… dukkaṭaṃ ajjhāpanno hoti… dubbhāsitaṃ ajjhāpanno hoti. Ekacce bhikkhū dubbhāsitadiṭṭhino honti, ekacce bhikkhū saṅghādisesadiṭṭhino honti. Ye ",
      " te, bhikkhave, bhikkhū dubbhāsitadiṭṭhino, tehi so, bhikkhave, bhikkhu ekamantaṃ ",
      " apanetvā yathādhammaṃ kārāpetvā saṅghaṃ upasaṅkamitvā evamassa vacanīyo – ‘‘yaṃ kho so, āvuso, bhikkhu āpattiṃ āpanno, sāssa yathādhammaṃ paṭikatā. Yadi saṅghassa pattakallaṃ, saṅgho pavāreyyā’’ti."
    ],
    "innerText": "Idha pana, bhikkhave, bhikkhu tadahu pavāraṇāya pācittiyaṃ ajjhāpanno hoti…pe… pāṭidesanīyaṃ ajjhāpanno hoti… dukkaṭaṃ ajjhāpanno hoti… dubbhāsitaṃ ajjhāpanno hoti. Ekacce bhikkhū dubbhāsitadiṭṭhino honti, ekacce bhikkhū saṅghādisesadiṭṭhino honti. Ye te, bhikkhave, bhikkhū dubbhāsitadiṭṭhino, tehi so, bhikkhave, bhikkhu ekamantaṃ apanetvā yathādhammaṃ kārāpetvā saṅghaṃ upasaṅkamitvā evamassa vacanīyo – ‘‘yaṃ kho so, āvuso, bhikkhu āpattiṃ āpanno, sāssa yathādhammaṃ paṭikatā. Yadi saṅghassa pattakallaṃ, saṅgho pavāreyyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, bhikkhu tadahu pavāraṇāya dubbhāsitaṃ ajjhāpanno hoti. Ekacce bhikkhū dubbhāsitadiṭṭhino honti, ekacce bhikkhū thullaccayadiṭṭhino honti…pe… ekacce bhikkhū dubbhāsitadiṭṭhino honti, ekacce bhikkhū pācittiyadiṭṭhino ",
      " honti… ekacce bhikkhū dubbhāsitadiṭṭhino honti, ekacce bhikkhū pāṭidesanīyadiṭṭhino honti… ekacce bhikkhū dubbhāsitadiṭṭhino honti, ekacce bhikkhū dukkaṭadiṭṭhino honti. Ye te, bhikkhave, bhikkhū dubbhāsitadiṭṭhino, tehi so, bhikkhave, bhikkhu ekamantaṃ apanetvā yathādhammaṃ kārāpetvā saṅghaṃ upasaṅkamitvā evamassa vacanīyo – ‘‘yaṃ kho so, āvuso, bhikkhu āpattiṃ āpanno, sāssa yathādhammaṃ paṭikatā. Yadi saṅghassa pattakallaṃ, saṅgho pavāreyyā’’ti."
    ],
    "innerText": "Idha pana, bhikkhave, bhikkhu tadahu pavāraṇāya dubbhāsitaṃ ajjhāpanno hoti. Ekacce bhikkhū dubbhāsitadiṭṭhino honti, ekacce bhikkhū thullaccayadiṭṭhino honti…pe… ekacce bhikkhū dubbhāsitadiṭṭhino honti, ekacce bhikkhū pācittiyadiṭṭhino honti… ekacce bhikkhū dubbhāsitadiṭṭhino honti, ekacce bhikkhū pāṭidesanīyadiṭṭhino honti… ekacce bhikkhū dubbhāsitadiṭṭhino honti, ekacce bhikkhū dukkaṭadiṭṭhino honti. Ye te, bhikkhave, bhikkhū dubbhāsitadiṭṭhino, tehi so, bhikkhave, bhikkhu ekamantaṃ apanetvā yathādhammaṃ kārāpetvā saṅghaṃ upasaṅkamitvā evamassa vacanīyo – ‘‘yaṃ kho so, āvuso, bhikkhu āpattiṃ āpanno, sāssa yathādhammaṃ paṭikatā. Yadi saṅghassa pattakallaṃ, saṅgho pavāreyyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Thullaccayavatthukādi niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "143. Vatthuṭhapanādi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "239"
      },
      ". Idha pana, bhikkhave, bhikkhu tadahu pavāraṇāya saṅghamajjhe udāhareyya – ‘‘suṇātu me, bhante, saṅgho. Idaṃ vatthu paññāyati, na puggalo. Yadi saṅghassa pattakallaṃ, vatthuṃ ṭhapetvā saṅgho pavāreyyā’’ti. So evamassa vacanīyo – ‘‘bhagavatā kho, āvuso, visuddhānaṃ pavāraṇā paññattā. Sace vatthu paññāyati, na puggalo, idāneva naṃ vadehī’’ti."
    ],
    "innerText": "239. Idha pana, bhikkhave, bhikkhu tadahu pavāraṇāya saṅghamajjhe udāhareyya – ‘‘suṇātu me, bhante, saṅgho. Idaṃ vatthu paññāyati, na puggalo. Yadi saṅghassa pattakallaṃ, vatthuṃ ṭhapetvā saṅgho pavāreyyā’’ti. So evamassa vacanīyo – ‘‘bhagavatā kho, āvuso, visuddhānaṃ pavāraṇā paññattā. Sace vatthu paññāyati, na puggalo, idāneva naṃ vadehī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, bhikkhu tadahu pavāraṇāya saṅghamajjhe udāhareyya – ‘‘suṇātu me, bhante, saṅgho. Ayaṃ puggalo paññāyati, na vatthu. Yadi saṅghassa pattakallaṃ, puggalaṃ ṭhapetvā saṅgho pavāreyyā’’ti. So evamassa vacanīyo – ‘‘bhagavatā kho, āvuso, samaggānaṃ pavāraṇā paññattā. Sace puggalo paññāyati, na vatthu, idāneva naṃ vadehī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, bhikkhu tadahu pavāraṇāya saṅghamajjhe udāhareyya – ‘‘suṇātu me, bhante, saṅgho. Idaṃ vatthu ca puggalo ca paññāyati. Yadi ",
      " saṅghassa pattakallaṃ, vatthuñca ",
      " puggalañca ",
      " ṭhapetvā saṅgho pavāreyyā’’ti. So evamassa vacanīyo – ‘‘bhagavatā kho, āvuso, visuddhānañca samaggānañca pavāraṇā paññattā. Sace vatthu ca puggalo ca paññāyati, idāneva naṃ vadehī’’ti."
    ],
    "innerText": "Idha pana, bhikkhave, bhikkhu tadahu pavāraṇāya saṅghamajjhe udāhareyya – ‘‘suṇātu me, bhante, saṅgho. Idaṃ vatthu ca puggalo ca paññāyati. Yadi saṅghassa pattakallaṃ, vatthuñca puggalañca ṭhapetvā saṅgho pavāreyyā’’ti. So evamassa vacanīyo – ‘‘bhagavatā kho, āvuso, visuddhānañca samaggānañca pavāraṇā paññattā. Sace vatthu ca puggalo ca paññāyati, idāneva naṃ vadehī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pubbe ce, bhikkhave, pavāraṇāya vatthu paññāyati, pacchā puggalo, kallaṃ vacanāya. Pubbe ce, bhikkhave, pavāraṇāya ",
      " puggalo paññāyati, pacchā vatthu, kallaṃ vacanāya. Pubbe ce, bhikkhave, pavāraṇāya vatthu ca puggalo ca paññāyati, taṃ ce katāya pavāraṇāya ukkoṭeti, ukkoṭanakaṃ pācittiyanti."
    ],
    "innerText": "Pubbe ce, bhikkhave, pavāraṇāya vatthu paññāyati, pacchā puggalo, kallaṃ vacanāya. Pubbe ce, bhikkhave, pavāraṇāya puggalo paññāyati, pacchā vatthu, kallaṃ vacanāya. Pubbe ce, bhikkhave, pavāraṇāya vatthu ca puggalo ca paññāyati, taṃ ce katāya pavāraṇāya ukkoṭeti, ukkoṭanakaṃ pācittiyanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vatthuṭhapanādi niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "144. Bhaṇḍanakārakavatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "240"
      },
      ". Tena kho pana samayena sambahulā sandiṭṭhā sambhattā bhikkhū kosalesu janapade aññatarasmiṃ āvāse vassaṃ upagacchiṃsu. Tesaṃ sāmantā aññe bhikkhū bhaṇḍanakārakā kalahakārakā vivādakārakā bhassakārakā saṅghe adhikaraṇakārakā vassaṃ upagacchiṃsu – mayaṃ tesaṃ bhikkhūnaṃ vassaṃvuṭṭhānaṃ pavāraṇāya pavāraṇaṃ ṭhapessāmāti. Assosuṃ kho te bhikkhū – ‘‘amhākaṃ kira sāmantā aññe bhikkhū bhaṇḍanakārakā kalahakārakā vivādakārakā bhassakārakā saṅghe adhikaraṇakārakā vassaṃ upagatā – mayaṃ tesaṃ bhikkhūnaṃ vassaṃvuṭṭhānaṃ pavāraṇāya pavāraṇaṃ ṭhapessāmā’’ti. Kathaṃ nu kho amhehi paṭipajjitabbanti? Bhagavato etamatthaṃ ārocesuṃ."
    ],
    "innerText": "240. Tena kho pana samayena sambahulā sandiṭṭhā sambhattā bhikkhū kosalesu janapade aññatarasmiṃ āvāse vassaṃ upagacchiṃsu. Tesaṃ sāmantā aññe bhikkhū bhaṇḍanakārakā kalahakārakā vivādakārakā bhassakārakā saṅghe adhikaraṇakārakā vassaṃ upagacchiṃsu – mayaṃ tesaṃ bhikkhūnaṃ vassaṃvuṭṭhānaṃ pavāraṇāya pavāraṇaṃ ṭhapessāmāti. Assosuṃ kho te bhikkhū – ‘‘amhākaṃ kira sāmantā aññe bhikkhū bhaṇḍanakārakā kalahakārakā vivādakārakā bhassakārakā saṅghe adhikaraṇakārakā vassaṃ upagatā – mayaṃ tesaṃ bhikkhūnaṃ vassaṃvuṭṭhānaṃ pavāraṇāya pavāraṇaṃ ṭhapessāmā’’ti. Kathaṃ nu kho amhehi paṭipajjitabbanti? Bhagavato etamatthaṃ ārocesuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, sambahulā sandiṭṭhā sambhattā bhikkhū aññatarasmiṃ āvāse vassaṃ upagacchanti. Tesaṃ sāmantā aññe bhikkhū bhaṇḍanakārakā kalahakārakā vivādakārakā bhassakārakā ",
      " saṅghe adhikaraṇakārakā vassaṃ upagacchanti – mayaṃ tesaṃ bhikkhūnaṃ vassaṃvuṭṭhānaṃ pavāraṇāya pavāraṇaṃ ṭhapessāmāti. Anujānāmi, bhikkhave, tehi bhikkhūhi dve tayo uposathe cātuddasike kātuṃ – kathaṃ mayaṃ tehi bhikkhūhi paṭhamataraṃ pavāreyyāmāti. Te ce, bhikkhave, bhikkhū bhaṇḍanakārakā kalahakārakā vivādakārakā bhassakārakā saṅghe adhikaraṇakārakā taṃ āvāsaṃ āgacchanti, tehi, bhikkhave, āvāsikehi bhikkhūhi lahuṃ lahuṃ sannipatitvā pavāretabbaṃ, pavāretvā vattabbā – ‘‘pavāritā ",
      " kho mayaṃ, āvuso; yathāyasmantā maññanti tathā ",
      " karontū’’ti. Te ce, bhikkhave, bhikkhū bhaṇḍanakārakā kalahakārakā vivādakārakā bhassakārakā saṅghe adhikaraṇakārakā asaṃvihitā taṃ āvāsaṃ āgacchanti, tehi, bhikkhave, āvāsikehi bhikkhūhi āsanaṃ paññapetabbaṃ, pādodakaṃ pādapīṭhaṃ pādakathalikaṃ upanikkhipitabbaṃ, paccuggantvā pattacīvaraṃ paṭiggahetabbaṃ, pānīyena paripucchitabbā; tesaṃ vikkhitvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vikkhipāpetvā (paṭivisodhakānaṃ mati), ācikkhitvā (ka.)]"
      },
      " nissīmaṃ gantvā pavāretabbaṃ, pavāretvā vattabbā – ‘‘pavāritā kho mayaṃ, āvuso; yathāyasmantā maññanti tathā karontū’’ti. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, āvāsikena bhikkhunā byattena paṭibalena āvāsikā bhikkhū ñāpetabbā –"
    ],
    "innerText": "Idha pana, bhikkhave, sambahulā sandiṭṭhā sambhattā bhikkhū aññatarasmiṃ āvāse vassaṃ upagacchanti. Tesaṃ sāmantā aññe bhikkhū bhaṇḍanakārakā kalahakārakā vivādakārakā bhassakārakā saṅghe adhikaraṇakārakā vassaṃ upagacchanti – mayaṃ tesaṃ bhikkhūnaṃ vassaṃvuṭṭhānaṃ pavāraṇāya pavāraṇaṃ ṭhapessāmāti. Anujānāmi, bhikkhave, tehi bhikkhūhi dve tayo uposathe cātuddasike kātuṃ – kathaṃ mayaṃ tehi bhikkhūhi paṭhamataraṃ pavāreyyāmāti. Te ce, bhikkhave, bhikkhū bhaṇḍanakārakā kalahakārakā vivādakārakā bhassakārakā saṅghe adhikaraṇakārakā taṃ āvāsaṃ āgacchanti, tehi, bhikkhave, āvāsikehi bhikkhūhi lahuṃ lahuṃ sannipatitvā pavāretabbaṃ, pavāretvā vattabbā – ‘‘pavāritā kho mayaṃ, āvuso; yathāyasmantā maññanti tathā karontū’’ti. Te ce, bhikkhave, bhikkhū bhaṇḍanakārakā kalahakārakā vivādakārakā bhassakārakā saṅghe adhikaraṇakārakā asaṃvihitā taṃ āvāsaṃ āgacchanti, tehi, bhikkhave, āvāsikehi bhikkhūhi āsanaṃ paññapetabbaṃ, pādodakaṃ pādapīṭhaṃ pādakathalikaṃ upanikkhipitabbaṃ, paccuggantvā pattacīvaraṃ paṭiggahetabbaṃ, pānīyena paripucchitabbā; tesaṃ vikkhitvā [vikkhipāpetvā (paṭivisodhakānaṃ mati), ācikkhitvā (ka.)] nissīmaṃ gantvā pavāretabbaṃ, pavāretvā vattabbā – ‘‘pavāritā kho mayaṃ, āvuso; yathāyasmantā maññanti tathā karontū’’ti. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, āvāsikena bhikkhunā byattena paṭibalena āvāsikā bhikkhū ñāpetabbā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇantu me, āyasmanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[āyasmantā (ka.)]"
      },
      ", āvāsikā. Yadāyasmantānaṃ pattakallaṃ, idāni uposathaṃ kareyyāma, pātimokkhaṃ uddiseyyāma ",
      ", āgame kāḷe pavāreyyāmā’’ti. Te ce, bhikkhave, bhikkhū bhaṇḍanakārakā kalahakārakā ",
      " vivādakārakā bhassakārakā saṅghe adhikaraṇakārakā te bhikkhū evaṃ vadeyyuṃ – ‘‘sādhāvuso, idāneva no pavārethā’’ti, te evamassu vacanīyā – ‘‘anissarā kho tumhe, āvuso, amhākaṃ pavāraṇāya; na tāva mayaṃ pavāreyyāmā’’ti. Te ce, bhikkhave, bhikkhū bhaṇḍanakārakā kalahakārakā vivādakārakā bhassakārakā saṅghe adhikaraṇakārakā taṃ kāḷaṃ anuvaseyyuṃ, āvāsikena, bhikkhave, bhikkhunā byattena paṭibalena āvāsikā bhikkhū ñāpetabbā –"
    ],
    "innerText": "‘‘Suṇantu me, āyasmanto [āyasmantā (ka.)], āvāsikā. Yadāyasmantānaṃ pattakallaṃ, idāni uposathaṃ kareyyāma, pātimokkhaṃ uddiseyyāma , āgame kāḷe pavāreyyāmā’’ti. Te ce, bhikkhave, bhikkhū bhaṇḍanakārakā kalahakārakā vivādakārakā bhassakārakā saṅghe adhikaraṇakārakā te bhikkhū evaṃ vadeyyuṃ – ‘‘sādhāvuso, idāneva no pavārethā’’ti, te evamassu vacanīyā – ‘‘anissarā kho tumhe, āvuso, amhākaṃ pavāraṇāya; na tāva mayaṃ pavāreyyāmā’’ti. Te ce, bhikkhave, bhikkhū bhaṇḍanakārakā kalahakārakā vivādakārakā bhassakārakā saṅghe adhikaraṇakārakā taṃ kāḷaṃ anuvaseyyuṃ, āvāsikena, bhikkhave, bhikkhunā byattena paṭibalena āvāsikā bhikkhū ñāpetabbā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇantu me, āyasmanto, āvāsikā. Yadāyasmantānaṃ pattakallaṃ, idāni uposathaṃ kareyyāma, pātimokkhaṃ uddiseyyāma, āgame juṇhe pavāreyyāmā’’ti. Te ce, bhikkhave, bhikkhū bhaṇḍanakārakā kalahakārakā vivādakārakā bhassakārakā saṅghe adhikaraṇakārakā te bhikkhū evaṃ vadeyyuṃ – ‘‘sādhāvuso, idāneva no pavāreyyāthā’’ti, te evamassu vacanīyā – ‘‘anissarā kho tumhe, āvuso, amhākaṃ pavāraṇāya, na tāva mayaṃ pavāreyyāmā’’ti. Te ce, bhikkhave, bhikkhū bhaṇḍanakārakā kalahakārakā vivādakārakā bhassakārakā saṅghe adhikaraṇakārakā ",
      " tampi juṇhaṃ anuvaseyyuṃ, tehi, bhikkhave, bhikkhūhi sabbeheva āgame juṇhe komudiyā cātumāsiniyā akāmā pavāretabbaṃ."
    ],
    "innerText": "‘‘Suṇantu me, āyasmanto, āvāsikā. Yadāyasmantānaṃ pattakallaṃ, idāni uposathaṃ kareyyāma, pātimokkhaṃ uddiseyyāma, āgame juṇhe pavāreyyāmā’’ti. Te ce, bhikkhave, bhikkhū bhaṇḍanakārakā kalahakārakā vivādakārakā bhassakārakā saṅghe adhikaraṇakārakā te bhikkhū evaṃ vadeyyuṃ – ‘‘sādhāvuso, idāneva no pavāreyyāthā’’ti, te evamassu vacanīyā – ‘‘anissarā kho tumhe, āvuso, amhākaṃ pavāraṇāya, na tāva mayaṃ pavāreyyāmā’’ti. Te ce, bhikkhave, bhikkhū bhaṇḍanakārakā kalahakārakā vivādakārakā bhassakārakā saṅghe adhikaraṇakārakā tampi juṇhaṃ anuvaseyyuṃ, tehi, bhikkhave, bhikkhūhi sabbeheva āgame juṇhe komudiyā cātumāsiniyā akāmā pavāretabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tehi ce, bhikkhave, bhikkhūhi pavāriyamāne gilāno agilānassa pavāraṇaṃ ṭhapeti, so evamassa vacanīyo – ‘‘āyasmā kho gilāno. Gilāno ca ananuyogakkhamo vutto bhagavatā. Āgamehi, āvuso, yāva arogo hosi. Arogo ākaṅkhamāno ",
      " codessasī’’ti. Evañce vuccamāno codeti, anādariye pācittiyaṃ. Tehi ce, bhikkhave, bhikkhūhi pavāriyamāne ",
      " agilāno gilānassa pavāraṇaṃ ṭhapeti, so evamassa vacanīyo – ‘‘ayaṃ kho, āvuso, bhikkhu gilāno. Gilāno ca ananuyogakkhamo vutto bhagavatā. Āgamehi, āvuso, yāvāyaṃ bhikkhu arogo hoti. Arogaṃ ākaṅkhamāno codessasī’’ti. Evañce vuccamāno codeti, anādariye pācittiyaṃ. Tehi ce, bhikkhave, bhikkhūhi pavāriyamāne gilāno gilānassa pavāraṇaṃ ṭhapeti, so evamassa vacanīyo – ‘‘āyasmantā kho gilānā. Gilāno ca ananuyogakkhamo vutto bhagavatā. Āgamehi, āvuso, yāva arogā hotha. Arogo arogaṃ ākaṅkhamāno codessasī’’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yāva arogo hoti, arogaṃ ākaṅkhamāno codessasīti (ka.)]"
      },
      ". Evañce vuccamāno codeti, anādariye pācittiyaṃ. Tehi ce, bhikkhave, bhikkhūhi pavāriyamāne agilāno agilānassa pavāraṇaṃ ṭhapeti, ubho saṅghena samanuyuñjitvā samanugāhitvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[samanubhāsitvā (sī.)]"
      },
      " yathādhammaṃ kārāpetvā saṅghena pavāretabbanti."
    ],
    "innerText": "Tehi ce, bhikkhave, bhikkhūhi pavāriyamāne gilāno agilānassa pavāraṇaṃ ṭhapeti, so evamassa vacanīyo – ‘‘āyasmā kho gilāno. Gilāno ca ananuyogakkhamo vutto bhagavatā. Āgamehi, āvuso, yāva arogo hosi. Arogo ākaṅkhamāno codessasī’’ti. Evañce vuccamāno codeti, anādariye pācittiyaṃ. Tehi ce, bhikkhave, bhikkhūhi pavāriyamāne agilāno gilānassa pavāraṇaṃ ṭhapeti, so evamassa vacanīyo – ‘‘ayaṃ kho, āvuso, bhikkhu gilāno. Gilāno ca ananuyogakkhamo vutto bhagavatā. Āgamehi, āvuso, yāvāyaṃ bhikkhu arogo hoti. Arogaṃ ākaṅkhamāno codessasī’’ti. Evañce vuccamāno codeti, anādariye pācittiyaṃ. Tehi ce, bhikkhave, bhikkhūhi pavāriyamāne gilāno gilānassa pavāraṇaṃ ṭhapeti, so evamassa vacanīyo – ‘‘āyasmantā kho gilānā. Gilāno ca ananuyogakkhamo vutto bhagavatā. Āgamehi, āvuso, yāva arogā hotha. Arogo arogaṃ ākaṅkhamāno codessasī’’ti [yāva arogo hoti, arogaṃ ākaṅkhamāno codessasīti (ka.)]. Evañce vuccamāno codeti, anādariye pācittiyaṃ. Tehi ce, bhikkhave, bhikkhūhi pavāriyamāne agilāno agilānassa pavāraṇaṃ ṭhapeti, ubho saṅghena samanuyuñjitvā samanugāhitvā [samanubhāsitvā (sī.)] yathādhammaṃ kārāpetvā saṅghena pavāretabbanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Bhaṇḍanakārakavatthu niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "145. Pavāraṇāsaṅgaho"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "241"
      },
      ". Tena kho pana samayena sambahulā sandiṭṭhā sambhattā bhikkhū ",
      " kosalesu janapade aññatarasmiṃ āvāse vassaṃ upagacchiṃsu. Tesaṃ samaggānaṃ sammodamānānaṃ avivadamānānaṃ viharataṃ aññataro phāsuvihāro adhigato hoti. Atha kho tesaṃ bhikkhūnaṃ etadahosi – ‘‘amhākaṃ kho samaggānaṃ sammodamānānaṃ avivadamānānaṃ viharataṃ aññataro phāsuvihāro adhigato. Sace mayaṃ idāni pavāressāma ",
      ", siyāpi ",
      " bhikkhū pavāretvā cārikaṃ pakkameyyuṃ. Evaṃ mayaṃ imamhā phāsuvihārā paribāhirā bhavissāma. Kathaṃ nu kho amhehi paṭipajjitabba’’nti? Bhagavato etamatthaṃ ārocesuṃ."
    ],
    "innerText": "241. Tena kho pana samayena sambahulā sandiṭṭhā sambhattā bhikkhū kosalesu janapade aññatarasmiṃ āvāse vassaṃ upagacchiṃsu. Tesaṃ samaggānaṃ sammodamānānaṃ avivadamānānaṃ viharataṃ aññataro phāsuvihāro adhigato hoti. Atha kho tesaṃ bhikkhūnaṃ etadahosi – ‘‘amhākaṃ kho samaggānaṃ sammodamānānaṃ avivadamānānaṃ viharataṃ aññataro phāsuvihāro adhigato. Sace mayaṃ idāni pavāressāma , siyāpi bhikkhū pavāretvā cārikaṃ pakkameyyuṃ. Evaṃ mayaṃ imamhā phāsuvihārā paribāhirā bhavissāma. Kathaṃ nu kho amhehi paṭipajjitabba’’nti? Bhagavato etamatthaṃ ārocesuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, sambahulā sandiṭṭhā sambhattā bhikkhū aññatarasmiṃ āvāse vassaṃ upagacchanti. Tesaṃ samaggānaṃ sammodamānānaṃ avivadamānānaṃ viharataṃ aññataro phāsuvihāro adhigato hoti. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘‘amhākaṃ kho samaggānaṃ sammodamānānaṃ avivadamānānaṃ viharataṃ aññataro phāsuvihāro adhigato. Sace mayaṃ idāni pavāressāma, siyāpi bhikkhū pavāretvā cārikaṃ pakkameyyuṃ. Evaṃ mayaṃ imamhā phāsuvihārā paribāhirā bhavissāmā’’ti, anujānāmi, bhikkhave, tehi bhikkhūhi pavāraṇāsaṅgahaṃ kātuṃ. Evañca pana, bhikkhave, kātabbo. Sabbeheva ekajjhaṃ sannipatitabbaṃ – sannipatitvā byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu ",
      " me, bhante, saṅgho. Amhākaṃ samaggānaṃ sammodamānānaṃ avivadamānānaṃ viharataṃ aññataro phāsuvihāro adhigato. Sace mayaṃ idāni pavāressāma, siyāpi bhikkhū pavāretvā cārikaṃ pakkameyyuṃ. Evaṃ mayaṃ imamhā phāsuvihārā paribāhirā bhavissāma. Yadi saṅghassa pattakallaṃ, saṅgho pavāraṇāsaṅgahaṃ kareyya, idāni uposathaṃ kareyya, pātimokkhaṃ uddiseyya, āgame juṇhe komudiyā cātumāsiniyā pavāreyya. Esā ñatti."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Amhākaṃ samaggānaṃ sammodamānānaṃ avivadamānānaṃ viharataṃ aññataro phāsuvihāro adhigato. Sace mayaṃ idāni pavāressāma, siyāpi bhikkhū pavāretvā cārikaṃ pakkameyyuṃ. Evaṃ mayaṃ imamhā phāsuvihārā paribāhirā bhavissāma. Yadi saṅghassa pattakallaṃ, saṅgho pavāraṇāsaṅgahaṃ kareyya, idāni uposathaṃ kareyya, pātimokkhaṃ uddiseyya, āgame juṇhe komudiyā cātumāsiniyā pavāreyya. Esā ñatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu me, bhante, saṅgho. Amhākaṃ samaggānaṃ sammodamānānaṃ avivadamānānaṃ viharataṃ ",
      " aññataro phāsuvihāro adhigato. Sace mayaṃ idāni pavāressāma, siyāpi bhikkhū pavāretvā cārikaṃ pakkameyyuṃ. Evaṃ mayaṃ imamhā phāsuvihārā paribāhirā bhavissāma. Saṅgho pavāraṇāsaṅgahaṃ karoti, idāni uposathaṃ karissati, pātimokkhaṃ uddisissati, āgame juṇhe komudiyā cātumāsiniyā pavāressati. Yassāyasmato khamati pavāraṇāsaṅgahassa karaṇaṃ, idāni uposathaṃ karissati, pātimokkhaṃ uddisissati, āgame juṇhe komudiyā cātumāsiniyā pavāressati, so tuṇhassa; yassa nakkhamati, so bhāseyya."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Amhākaṃ samaggānaṃ sammodamānānaṃ avivadamānānaṃ viharataṃ aññataro phāsuvihāro adhigato. Sace mayaṃ idāni pavāressāma, siyāpi bhikkhū pavāretvā cārikaṃ pakkameyyuṃ. Evaṃ mayaṃ imamhā phāsuvihārā paribāhirā bhavissāma. Saṅgho pavāraṇāsaṅgahaṃ karoti, idāni uposathaṃ karissati, pātimokkhaṃ uddisissati, āgame juṇhe komudiyā cātumāsiniyā pavāressati. Yassāyasmato khamati pavāraṇāsaṅgahassa karaṇaṃ, idāni uposathaṃ karissati, pātimokkhaṃ uddisissati, āgame juṇhe komudiyā cātumāsiniyā pavāressati, so tuṇhassa; yassa nakkhamati, so bhāseyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kato ",
      " saṅghena pavāraṇāsaṅgaho, idāni uposathaṃ karissati, pātimokkhaṃ uddisissati, āgame juṇhe komudiyā cātumāsiniyā pavāressati. Khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti."
    ],
    "innerText": "‘‘Kato saṅghena pavāraṇāsaṅgaho, idāni uposathaṃ karissati, pātimokkhaṃ uddisissati, āgame juṇhe komudiyā cātumāsiniyā pavāressati. Khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tehi ce, bhikkhave, bhikkhūhi kate pavāraṇāsaṅgahe aññataro bhikkhu evaṃ vadeyya – ‘‘icchāmahaṃ, āvuso, janapadacārikaṃ pakkamituṃ; atthi me janapade karaṇīya’’nti, so evamassa vacanīyo – ‘‘sādhāvuso, pavāretvā gacchāhī’’ti. So ce ",
      ", bhikkhave, bhikkhu pavārayamāno aññatarassa bhikkhuno pavāraṇaṃ ṭhapeti, so evamassa vacanīyo – ‘‘anissaro kho me tvaṃ, āvuso, pavāraṇāya, na tāvāhaṃ pavāressāmī’’ti. Tassa ce, bhikkhave, bhikkhuno pavārayamānassa aññataro bhikkhu tassa bhikkhuno pavāraṇaṃ ṭhapeti, ubho saṅghena samanuyuñjitvā samanugāhitvā yathādhammaṃ kārāpetabbā. So ce, bhikkhave, bhikkhu janapade taṃ karaṇīyaṃ tīretvā ",
      " punadeva anto komudiyā cātumāsiniyā taṃ āvāsaṃ āgacchati, tehi ce, bhikkhave, bhikkhūhi pavāriyamāne aññataro bhikkhu tassa bhikkhuno pavāraṇaṃ ṭhapeti, so evamassa vacanīyo – ‘‘anissaro kho me tvaṃ, āvuso, pavāraṇāya; pavārito aha’’nti. Tehi ce, bhikkhave, bhikkhūhi pavāriyamāne so bhikkhu aññatarassa bhikkhuno pavāraṇaṃ ",
      " ṭhapeti, ubho saṅghena samanuyuñjitvā samanugāhitvā yathādhammaṃ kārāpetvā saṅghena pavāretabbanti."
    ],
    "innerText": "Tehi ce, bhikkhave, bhikkhūhi kate pavāraṇāsaṅgahe aññataro bhikkhu evaṃ vadeyya – ‘‘icchāmahaṃ, āvuso, janapadacārikaṃ pakkamituṃ; atthi me janapade karaṇīya’’nti, so evamassa vacanīyo – ‘‘sādhāvuso, pavāretvā gacchāhī’’ti. So ce , bhikkhave, bhikkhu pavārayamāno aññatarassa bhikkhuno pavāraṇaṃ ṭhapeti, so evamassa vacanīyo – ‘‘anissaro kho me tvaṃ, āvuso, pavāraṇāya, na tāvāhaṃ pavāressāmī’’ti. Tassa ce, bhikkhave, bhikkhuno pavārayamānassa aññataro bhikkhu tassa bhikkhuno pavāraṇaṃ ṭhapeti, ubho saṅghena samanuyuñjitvā samanugāhitvā yathādhammaṃ kārāpetabbā. So ce, bhikkhave, bhikkhu janapade taṃ karaṇīyaṃ tīretvā punadeva anto komudiyā cātumāsiniyā taṃ āvāsaṃ āgacchati, tehi ce, bhikkhave, bhikkhūhi pavāriyamāne aññataro bhikkhu tassa bhikkhuno pavāraṇaṃ ṭhapeti, so evamassa vacanīyo – ‘‘anissaro kho me tvaṃ, āvuso, pavāraṇāya; pavārito aha’’nti. Tehi ce, bhikkhave, bhikkhūhi pavāriyamāne so bhikkhu aññatarassa bhikkhuno pavāraṇaṃ ṭhapeti, ubho saṅghena samanuyuñjitvā samanugāhitvā yathādhammaṃ kārāpetvā saṅghena pavāretabbanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pavāraṇāsaṅgaho niṭṭhito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pavāraṇākkhandhako catuttho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "146. Tassuddānaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Vassaṃvuṭṭhā kosalesu, agamuṃ satthu dassanaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Aphāsuṃ pasusaṃvāsaṃ, aññamaññānulomatā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Pavārentā paṇāmañca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pavārentāsane dve ca (sī. syā.)]"
      },
      ", kammaṃ gilānañātakā;"
    ],
    "innerText": "Pavārentā paṇāmañca [pavārentāsane dve ca (sī. syā.)], kammaṃ gilānañātakā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Rājā corā ca dhuttā ca, bhikkhupaccatthikā tathā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Pañca catutayo dveko, āpanno vematī sari;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sabbo saṅgho vematiko, bahū samā ca thokikā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Āvāsikā ",
      " cātuddasa, liṅgasaṃvāsakā ubho;"
    ],
    "innerText": "Āvāsikā cātuddasa, liṅgasaṃvāsakā ubho;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Gantabbaṃ ",
      " na nisinnāya, chandadāne pavāraṇā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[chandadānapavāraṇā (ka.)]"
      },
      "."
    ],
    "innerText": "Gantabbaṃ na nisinnāya, chandadāne pavāraṇā [chandadānapavāraṇā (ka.)]."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Savarehi khepitā megho, antarā ca pavāraṇā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Na icchanti puramhākaṃ, aṭṭhapitā ca bhikkhuno."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Kimhi vāti katamañca, diṭṭhena sutasaṅkāya;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Codako cuditako ca, thullaccayaṃ vatthu bhaṇḍanaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pavāraṇāsaṅgaho ca, anissaro pavārayeti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Imamhi khandhake vatthūni chacattārīsāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pavāraṇākkhandhako niṭṭhito."
  }
]