[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "Atthāpattisamuṭṭhānaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Pārājikaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "470"
      },
      ". Atthāpatti ",
      " acittako āpajjati, sacittako vuṭṭhāti. Atthāpatti sacittako āpajjati, acittako vuṭṭhāti. Atthāpatti acittako āpajjati, acittako vuṭṭhāti. Atthāpatti sacittako āpajjati, sacittako vuṭṭhāti. Atthāpatti kusalacitto āpajjati, kusalacitto vuṭṭhāti. Atthāpatti kusalacitto āpajjati, akusalacitto vuṭṭhāti. Atthāpatti kusalacitto āpajjati, abyākatacitto vuṭṭhāti. Atthāpatti akusalacitto āpajjati, kusalacitto vuṭṭhāti. Atthāpatti akusalacitto āpajjati, akusalacitto vuṭṭhāti. Atthāpatti akusalacitto āpajjati, abyākatacitto vuṭṭhāti. Atthāpatti abyākatacitto āpajjati, kusalacitto vuṭṭhāti. Atthāpatti abyākatacitto āpajjati, akusalacitto vuṭṭhāti. Atthāpatti abyākatacitto āpajjati, abyākatacitto vuṭṭhāti."
    ],
    "innerText": "470. Atthāpatti acittako āpajjati, sacittako vuṭṭhāti. Atthāpatti sacittako āpajjati, acittako vuṭṭhāti. Atthāpatti acittako āpajjati, acittako vuṭṭhāti. Atthāpatti sacittako āpajjati, sacittako vuṭṭhāti. Atthāpatti kusalacitto āpajjati, kusalacitto vuṭṭhāti. Atthāpatti kusalacitto āpajjati, akusalacitto vuṭṭhāti. Atthāpatti kusalacitto āpajjati, abyākatacitto vuṭṭhāti. Atthāpatti akusalacitto āpajjati, kusalacitto vuṭṭhāti. Atthāpatti akusalacitto āpajjati, akusalacitto vuṭṭhāti. Atthāpatti akusalacitto āpajjati, abyākatacitto vuṭṭhāti. Atthāpatti abyākatacitto āpajjati, kusalacitto vuṭṭhāti. Atthāpatti abyākatacitto āpajjati, akusalacitto vuṭṭhāti. Atthāpatti abyākatacitto āpajjati, abyākatacitto vuṭṭhāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Paṭhamaṃ pārājikaṃ katihi samuṭṭhānehi samuṭṭhāti? Paṭhamaṃ pārājikaṃ ekena samuṭṭhānena samuṭṭhāti. Kāyato ca cittato ca samuṭṭhāti, na vācato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dutiyaṃ pārājikaṃ katihi samuṭṭhānehi samuṭṭhāti? Dutiyaṃ pārājikaṃ tīhi samuṭṭhānehi samuṭṭhāti – siyā kāyato ca cittato ca samuṭṭhāti, na vācato; siyā vācato ca cittato ca samuṭṭhāti, na kāyato; siyā kāyato ca ",
      " vācato ca cittato ca samuṭṭhāti."
    ],
    "innerText": "Dutiyaṃ pārājikaṃ katihi samuṭṭhānehi samuṭṭhāti? Dutiyaṃ pārājikaṃ tīhi samuṭṭhānehi samuṭṭhāti – siyā kāyato ca cittato ca samuṭṭhāti, na vācato; siyā vācato ca cittato ca samuṭṭhāti, na kāyato; siyā kāyato ca vācato ca cittato ca samuṭṭhāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tatiyaṃ pārājikaṃ katihi samuṭṭhānehi samuṭṭhāti? Tatiyaṃ pārājikaṃ tīhi samuṭṭhānehi samuṭṭhāti – siyā kāyato ca cittato ca samuṭṭhāti, na vācato; siyā vācato ca cittato ca samuṭṭhāti, na kāyato; siyā kāyato ca vācato ca cittato ca samuṭṭhāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Catutthaṃ ",
      " pārājikaṃ katihi samuṭṭhānehi samuṭṭhāti? Catutthaṃ pārājikaṃ tīhi samuṭṭhānehi samuṭṭhāti – siyā kāyato ca cittato ca samuṭṭhāti ",
      ", na vācato; siyā vācato ca cittato ca samuṭṭhāti, na kāyato; siyā kāyato ca vācato ca cittato ca samuṭṭhāti."
    ],
    "innerText": "Catutthaṃ pārājikaṃ katihi samuṭṭhānehi samuṭṭhāti? Catutthaṃ pārājikaṃ tīhi samuṭṭhānehi samuṭṭhāti – siyā kāyato ca cittato ca samuṭṭhāti , na vācato; siyā vācato ca cittato ca samuṭṭhāti, na kāyato; siyā kāyato ca vācato ca cittato ca samuṭṭhāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Cattāro pārājikā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Saṅghādisesaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "471"
      },
      ". Upakkamitvā asuciṃ mocentassa saṅghādiseso katihi samuṭṭhānehi samuṭṭhāti? Upakkamitvā asuciṃ mocentassa saṅghādiseso ekena samuṭṭhānena samuṭṭhāti – kāyato ca cittato ca samuṭṭhāti, na vācato."
    ],
    "innerText": "471. Upakkamitvā asuciṃ mocentassa saṅghādiseso katihi samuṭṭhānehi samuṭṭhāti? Upakkamitvā asuciṃ mocentassa saṅghādiseso ekena samuṭṭhānena samuṭṭhāti – kāyato ca cittato ca samuṭṭhāti, na vācato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Mātugāmena saddhiṃ kāyasaṃsaggaṃ samāpajjantassa saṅghādiseso katihi samuṭṭhānehi samuṭṭhāti? Mātugāmena saddhiṃ kāyasaṃsaggaṃ samāpajjantassa saṅghādiseso ekena samuṭṭhānena samuṭṭhāti – kāyato ca cittato ca samuṭṭhāti, na vācato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Mātugāmaṃ duṭṭhullāhi vācāhi obhāsentassa saṅghādiseso katihi samuṭṭhānehi samuṭṭhāti? Mātugāmaṃ duṭṭhullāhi vācāhi obhāsentassa saṅghādiseso tīhi samuṭṭhānehi samuṭṭhāti – siyā kāyato ca ",
      " cittato ca samuṭṭhāti na vācato; siyā vācato ",
      " ca cittato ca samuṭṭhāti, na kāyato; siyā kāyato ca vācato ca cittato ca samuṭṭhāti."
    ],
    "innerText": "Mātugāmaṃ duṭṭhullāhi vācāhi obhāsentassa saṅghādiseso katihi samuṭṭhānehi samuṭṭhāti? Mātugāmaṃ duṭṭhullāhi vācāhi obhāsentassa saṅghādiseso tīhi samuṭṭhānehi samuṭṭhāti – siyā kāyato ca cittato ca samuṭṭhāti na vācato; siyā vācato ca cittato ca samuṭṭhāti, na kāyato; siyā kāyato ca vācato ca cittato ca samuṭṭhāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Mātugāmassa santike attakāmapāricariyāya vaṇṇaṃ bhāsantassa saṅghādiseso katihi samuṭṭhānehi samuṭṭhāti? Mātugāmassa santike attakāmapāricariyāya vaṇṇaṃ bhāsantassa saṅghādiseso tīhi samuṭṭhānehi samuṭṭhāti…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sañcarittaṃ samāpajjantassa saṅghādiseso katihi samuṭṭhānehi samuṭṭhāti? Sañcarittaṃ samāpajjantassa saṅghādiseso chahi samuṭṭhānehi samuṭṭhāti – siyā kāyato samuṭṭhāti, na vācato na cittato; siyā vācato samuṭṭhāti, na kāyato na cittato; siyā kāyato ca vācato ca samuṭṭhāti, na cittato; siyā kāyato ca cittato ca samuṭṭhāti, na vācato; siyā ",
      " vācato ca cittato ca samuṭṭhāti ",
      ", na kāyato; siyā kāyato ca vācato ca cittato ca samuṭṭhāti."
    ],
    "innerText": "Sañcarittaṃ samāpajjantassa saṅghādiseso katihi samuṭṭhānehi samuṭṭhāti? Sañcarittaṃ samāpajjantassa saṅghādiseso chahi samuṭṭhānehi samuṭṭhāti – siyā kāyato samuṭṭhāti, na vācato na cittato; siyā vācato samuṭṭhāti, na kāyato na cittato; siyā kāyato ca vācato ca samuṭṭhāti, na cittato; siyā kāyato ca cittato ca samuṭṭhāti, na vācato; siyā vācato ca cittato ca samuṭṭhāti , na kāyato; siyā kāyato ca vācato ca cittato ca samuṭṭhāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Saññācikāya kuṭiṃ kārāpentassa saṅghādiseso katihi samuṭṭhānehi samuṭṭhāti? Saññācikāya kuṭiṃ kārāpentassa saṅghādiseso chahi samuṭṭhānehi samuṭṭhāti…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Mahallakaṃ vihāraṃ kārāpentassa saṅghādiseso katihi samuṭṭhānehi samuṭṭhāti? Mahallakaṃ vihāraṃ kārāpentassa saṅghādiseso chahi samuṭṭhānehi samuṭṭhāti…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhikkhuṃ amūlakena pārājikena dhammena anuddhaṃsentassa saṅghādiseso katihi samuṭṭhānehi samuṭṭhāti? Bhikkhuṃ amūlakena pārājikena dhammena anuddhaṃsentassa saṅghādiseso tīhi samuṭṭhānehi ",
      " samuṭṭhāti…pe…."
    ],
    "innerText": "Bhikkhuṃ amūlakena pārājikena dhammena anuddhaṃsentassa saṅghādiseso katihi samuṭṭhānehi samuṭṭhāti? Bhikkhuṃ amūlakena pārājikena dhammena anuddhaṃsentassa saṅghādiseso tīhi samuṭṭhānehi samuṭṭhāti…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhikkhuṃ aññabhāgiyassa adhikaraṇassa kiñci desaṃ lesamattaṃ upādāya pārājikena dhammena anuddhaṃsentassa saṅghādiseso katihi samuṭṭhānehi samuṭṭhāti? Bhikkhuṃ aññabhāgiyassa adhikaraṇassa kiñci desaṃ lesamattaṃ upādāya pārājikena dhammena anuddhaṃsentassa saṅghādiseso tīhi samuṭṭhānehi samuṭṭhāti…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Saṅghabhedakassa bhikkhuno yāvatatiyaṃ samanubhāsanāya na paṭinissajjantassa saṅghādiseso katihi samuṭṭhānehi samuṭṭhāti? Saṅghabhedakassa bhikkhuno yāvatatiyaṃ samanubhāsanāya na paṭinissajjantassa saṅghādiseso ekena samuṭṭhānena samuṭṭhāti – kāyato ca vācato ca cittato ca samuṭṭhāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhedakānuvattakānaṃ bhikkhūnaṃ yāvatatiyaṃ samanubhāsanāya na paṭinissajjantānaṃ saṅghādiseso katihi samuṭṭhānehi samuṭṭhāti? Bhedakānuvattakānaṃ bhikkhūnaṃ yāvatatiyaṃ samanubhāsanāya na paṭinissajjantānaṃ saṅghādiseso ekena samuṭṭhānena samuṭṭhāti – kāyato ca vācato ca cittato ca samuṭṭhāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dubbacassa bhikkhuno yāvatatiyaṃ samanubhāsanāya na paṭinissajjantassa saṅghādiseso katihi samuṭṭhānehi samuṭṭhāti? Dubbacassa bhikkhuno yāvatatiyaṃ samanubhāsanāya na paṭinissajjantassa ",
      " saṅghādiseso ekena samuṭṭhānena samuṭṭhāti – kāyato ca vācato ca cittato ca samuṭṭhāti."
    ],
    "innerText": "Dubbacassa bhikkhuno yāvatatiyaṃ samanubhāsanāya na paṭinissajjantassa saṅghādiseso katihi samuṭṭhānehi samuṭṭhāti? Dubbacassa bhikkhuno yāvatatiyaṃ samanubhāsanāya na paṭinissajjantassa saṅghādiseso ekena samuṭṭhānena samuṭṭhāti – kāyato ca vācato ca cittato ca samuṭṭhāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kuladūsakassa ",
      " bhikkhuno yāvatatiyaṃ samanubhāsanāya na paṭinissajjantassa saṅghādiseso katihi samuṭṭhānehi samuṭṭhāti? Kuladūsakassa bhikkhuno yāvatatiyaṃ samanubhāsanāya ",
      " na paṭinissajjantassa saṅghādiseso ekena samuṭṭhānena samuṭṭhāti – kāyato ca vācato ca cittato ca samuṭṭhāti."
    ],
    "innerText": "Kuladūsakassa bhikkhuno yāvatatiyaṃ samanubhāsanāya na paṭinissajjantassa saṅghādiseso katihi samuṭṭhānehi samuṭṭhāti? Kuladūsakassa bhikkhuno yāvatatiyaṃ samanubhāsanāya na paṭinissajjantassa saṅghādiseso ekena samuṭṭhānena samuṭṭhāti – kāyato ca vācato ca cittato ca samuṭṭhāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Terasa saṅghādisesā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "472"
      },
      ". …Pe… anādariyaṃ paṭicca udake uccāraṃ vā passāvaṃ vā kheḷaṃ vā karontassa dukkaṭaṃ katihi samuṭṭhānehi samuṭṭhāti? Anādariyaṃ paṭicca udake uccāraṃ vā passāvaṃ vā kheḷaṃ vā karontassa dukkaṭaṃ ekena samuṭṭhānena samuṭṭhāti – kāyato ca cittato ca samuṭṭhāti, na vācato."
    ],
    "innerText": "472. …Pe… anādariyaṃ paṭicca udake uccāraṃ vā passāvaṃ vā kheḷaṃ vā karontassa dukkaṭaṃ katihi samuṭṭhānehi samuṭṭhāti? Anādariyaṃ paṭicca udake uccāraṃ vā passāvaṃ vā kheḷaṃ vā karontassa dukkaṭaṃ ekena samuṭṭhānena samuṭṭhāti – kāyato ca cittato ca samuṭṭhāti, na vācato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sekhiyā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Pārājikādi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "473"
      },
      ". Cattāro pārājikā katihi samuṭṭhānehi samuṭṭhanti? Cattāro pārājikā tīhi samuṭṭhānehi samuṭṭhanti – siyā kāyato ca cittato ca samuṭṭhanti, na vācato; siyā vācato ca cittato ca samuṭṭhanti, na kāyato; siyā kāyato ca vācato ca cittato ca samuṭṭhanti."
    ],
    "innerText": "473. Cattāro pārājikā katihi samuṭṭhānehi samuṭṭhanti? Cattāro pārājikā tīhi samuṭṭhānehi samuṭṭhanti – siyā kāyato ca cittato ca samuṭṭhanti, na vācato; siyā vācato ca cittato ca samuṭṭhanti, na kāyato; siyā kāyato ca vācato ca cittato ca samuṭṭhanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Terasa ",
      " saṅghādisesā katihi samuṭṭhānehi samuṭṭhanti? Terasa saṅghādisesā chahi samuṭṭhānehi samuṭṭhanti – siyā kāyato samuṭṭhanti, na vācato na cittato; siyā vācato samuṭṭhanti, na kāyato na cittato; siyā kāyato ca vācato na samuṭṭhanti, na cittato; siyā kāyato ca cittato ca samuṭṭhanti, na vācato; siyā vācato ca cittato ca samuṭṭhanti, na kāyato; siyā ",
      " kāyato ca vācato ca cittato ca samuṭṭhanti."
    ],
    "innerText": "Terasa saṅghādisesā katihi samuṭṭhānehi samuṭṭhanti? Terasa saṅghādisesā chahi samuṭṭhānehi samuṭṭhanti – siyā kāyato samuṭṭhanti, na vācato na cittato; siyā vācato samuṭṭhanti, na kāyato na cittato; siyā kāyato ca vācato na samuṭṭhanti, na cittato; siyā kāyato ca cittato ca samuṭṭhanti, na vācato; siyā vācato ca cittato ca samuṭṭhanti, na kāyato; siyā kāyato ca vācato ca cittato ca samuṭṭhanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dve aniyatā katihi samuṭṭhānehi samuṭṭhanti? Dve aniyatā tīhi samuṭṭhānehi samuṭṭhanti ",
      " – siyā kāyato ca cittato ca samuṭṭhanti, na vācato; ",
      " siyā vācato ca cittato ca samuṭṭhanti, na kāyato; siyā kāyato ca vācato ca cittato ca samuṭṭhanti."
    ],
    "innerText": "Dve aniyatā katihi samuṭṭhānehi samuṭṭhanti? Dve aniyatā tīhi samuṭṭhānehi samuṭṭhanti – siyā kāyato ca cittato ca samuṭṭhanti, na vācato; siyā vācato ca cittato ca samuṭṭhanti, na kāyato; siyā kāyato ca vācato ca cittato ca samuṭṭhanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tiṃsa nissaggiyā pācittiyā katihi samuṭṭhānehi samuṭṭhanti? Tiṃsa nissaggiyā pācittiyā chahi samuṭṭhānehi samuṭṭhanti – siyā kāyato samuṭṭhanti, na vācato na cittato; siyā vācato samuṭṭhanti, na kāyato na cittato; siyā kāyato ca vācato ca samuṭṭhanti, na cittato; siyā kāyato ca cittato ca samuṭṭhanti, na vācato; siyā vācato ca cittato ca samuṭṭhanti, na kāyato; siyā kāyato ca vācato ca cittato ca samuṭṭhanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dvenavuti pācittiyā katihi samuṭṭhānehi samuṭṭhanti? Dvenavuti pācittiyā chahi samuṭṭhānehi samuṭṭhanti – siyā kāyato samuṭṭhanti, na vācato na cittato; siyā vācato samuṭṭhanti, na kāyato na cittato; siyā kāyato ca vācato ca samuṭṭhanti, na cittato; siyā kāyato ca cittato ca samuṭṭhanti na vācato; siyā vācato ca cittato ca samuṭṭhanti, na kāyato; siyā ",
      " kāyato ca vācato ca cittato ca samuṭṭhanti."
    ],
    "innerText": "Dvenavuti pācittiyā katihi samuṭṭhānehi samuṭṭhanti? Dvenavuti pācittiyā chahi samuṭṭhānehi samuṭṭhanti – siyā kāyato samuṭṭhanti, na vācato na cittato; siyā vācato samuṭṭhanti, na kāyato na cittato; siyā kāyato ca vācato ca samuṭṭhanti, na cittato; siyā kāyato ca cittato ca samuṭṭhanti na vācato; siyā vācato ca cittato ca samuṭṭhanti, na kāyato; siyā kāyato ca vācato ca cittato ca samuṭṭhanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Cattāro pāṭidesanīyā katihi samuṭṭhānehi samuṭṭhanti? Cattāro pāṭidesanīyā catūhi samuṭṭhānehi samuṭṭhanti – siyā kāyato samuṭṭhanti, na vācato na cittato; siyā kāyato ca vācato ca samuṭṭhanti, na cittato; siyā kāyato ca cittato ca samuṭṭhanti, na vācato; siyā kāyato ca vācato ca cittato ca samuṭṭhanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Pañcasattati sekhiyā katihi samuṭṭhānehi samuṭṭhanti? Pañcasattati sekhiyā tīhi samuṭṭhānehi samuṭṭhanti – siyā kāyato ca cittato ca samuṭṭhanti, na vācato; siyā vācato ca cittato ca samuṭṭhanti, na kāyato; siyā kāyato ca vācato ca cittato ca samuṭṭhanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Samuṭṭhānaṃ niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Acittakusalā ceva, samuṭṭhānañca sabbathā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yathādhammena ñāyena, samuṭṭhānaṃ vijānathāti."
  }
]