[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "4. Samathakkhandhakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Sammukhāvinayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "185"
      },
      ". Tena ",
      " samayena buddho bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena chabbaggiyā bhikkhū asammukhībhūtānaṃ bhikkhūnaṃ kammāni karonti – tajjanīyampi, niyassampi, pabbājanīyampi, paṭisāraṇīyampi, ukkhepanīyampi. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma chabbaggiyā bhikkhū asammukhībhūtānaṃ bhikkhūnaṃ kammāni karissanti – tajjanīyampi, niyassampi, pabbājanīyampi, paṭisāraṇīyampi, ukkhepanīyampī’’ti! Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… ‘‘saccaṃ kira, bhikkhave, chabbaggiyā bhikkhū asammukhībhūtānaṃ bhikkhūnaṃ kammāni karonti – tajjanīyampi, niyassampi, pabbājanīyampi, paṭisāraṇīyampi, ukkhepanīyampī’’ti? ‘‘Saccaṃ bhagavā’’ti. Vigarahi buddho bhagavā – ‘‘ananucchavikaṃ, bhikkhave, tesaṃ moghapurisānaṃ ananulomikaṃ appatirūpaṃ assāmaṇakaṃ akappiyaṃ akaraṇīyaṃ. Kathañhi nāma te, bhikkhave, moghapurisā asammukhībhūtānaṃ bhikkhūnaṃ kammāni karissanti – tajjanīyampi, niyassampi, pabbājanīyampi, paṭisāraṇīyampi, ukkhepanīyampi! Netaṃ, bhikkhave, appasannānaṃ vā pasādāya…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi – na, bhikkhave, asammukhībhūtānaṃ bhikkhūnaṃ kammaṃ kātabbaṃ – tajjanīyaṃ vā, niyassaṃ vā, pabbājanīyaṃ vā, paṭisāraṇīyaṃ vā, ukkhepanīyaṃ vā. Yo kareyya ",
      ", āpatti dukkaṭassa."
    ],
    "innerText": "185. Tena samayena buddho bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena chabbaggiyā bhikkhū asammukhībhūtānaṃ bhikkhūnaṃ kammāni karonti – tajjanīyampi, niyassampi, pabbājanīyampi, paṭisāraṇīyampi, ukkhepanīyampi. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma chabbaggiyā bhikkhū asammukhībhūtānaṃ bhikkhūnaṃ kammāni karissanti – tajjanīyampi, niyassampi, pabbājanīyampi, paṭisāraṇīyampi, ukkhepanīyampī’’ti! Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… ‘‘saccaṃ kira, bhikkhave, chabbaggiyā bhikkhū asammukhībhūtānaṃ bhikkhūnaṃ kammāni karonti – tajjanīyampi, niyassampi, pabbājanīyampi, paṭisāraṇīyampi, ukkhepanīyampī’’ti? ‘‘Saccaṃ bhagavā’’ti. Vigarahi buddho bhagavā – ‘‘ananucchavikaṃ, bhikkhave, tesaṃ moghapurisānaṃ ananulomikaṃ appatirūpaṃ assāmaṇakaṃ akappiyaṃ akaraṇīyaṃ. Kathañhi nāma te, bhikkhave, moghapurisā asammukhībhūtānaṃ bhikkhūnaṃ kammāni karissanti – tajjanīyampi, niyassampi, pabbājanīyampi, paṭisāraṇīyampi, ukkhepanīyampi! Netaṃ, bhikkhave, appasannānaṃ vā pasādāya…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi – na, bhikkhave, asammukhībhūtānaṃ bhikkhūnaṃ kammaṃ kātabbaṃ – tajjanīyaṃ vā, niyassaṃ vā, pabbājanīyaṃ vā, paṭisāraṇīyaṃ vā, ukkhepanīyaṃ vā. Yo kareyya , āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "186"
      },
      ". ‘‘Adhammavādī puggalo adhammavādī sambahulā adhammavādī saṅgho. Dhammavādī puggalo dhammavādī sambahulā dhammavādī saṅgho."
    ],
    "innerText": "186. ‘‘Adhammavādī puggalo adhammavādī sambahulā adhammavādī saṅgho. Dhammavādī puggalo dhammavādī sambahulā dhammavādī saṅgho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Kaṇhapakkhanavakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "187"
      },
      ". ‘‘Adhammavādī ",
      " puggalo dhammavādiṃ puggalaṃ saññāpeti nijjhāpeti pekkheti anupekkheti dasseti anudasseti – ayaṃ dhammo, ayaṃ vinayo, idaṃ satthusāsanaṃ, imaṃ gaṇhāhi, imaṃ ",
      " rocehīti. Evañcetaṃ adhikaraṇaṃ vūpasammati, adhammena vūpasammati sammukhāvinayapatirūpakena."
    ],
    "innerText": "187. ‘‘Adhammavādī puggalo dhammavādiṃ puggalaṃ saññāpeti nijjhāpeti pekkheti anupekkheti dasseti anudasseti – ayaṃ dhammo, ayaṃ vinayo, idaṃ satthusāsanaṃ, imaṃ gaṇhāhi, imaṃ rocehīti. Evañcetaṃ adhikaraṇaṃ vūpasammati, adhammena vūpasammati sammukhāvinayapatirūpakena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Adhammavādī puggalo dhammavādī sambahule saññāpeti nijjhāpeti pekkheti anupekkheti dasseti anudasseti – ayaṃ dhammo, ayaṃ vinayo ",
      ", idaṃ satthusāsanaṃ, imaṃ gaṇhatha, imaṃ rocethāti. Evañcetaṃ adhikaraṇaṃ vūpasammati, adhammena vūpasammati sammukhāvinayapatirūpakena."
    ],
    "innerText": "‘‘Adhammavādī puggalo dhammavādī sambahule saññāpeti nijjhāpeti pekkheti anupekkheti dasseti anudasseti – ayaṃ dhammo, ayaṃ vinayo , idaṃ satthusāsanaṃ, imaṃ gaṇhatha, imaṃ rocethāti. Evañcetaṃ adhikaraṇaṃ vūpasammati, adhammena vūpasammati sammukhāvinayapatirūpakena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Adhammavādī puggalo dhammavādiṃ saṅghaṃ saññāpeti nijjhāpeti pekkheti anupekkheti dasseti anudasseti – ayaṃ dhammo, ayaṃ vinayo, idaṃ satthusāsanaṃ, imaṃ gaṇhāhi, imaṃ rocehīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[imaṃ gaṇhatha, imaṃ rocethāti (ka.)]"
      },
      ". Evañcetaṃ adhikaraṇaṃ vūpasammati, adhammena vūpasammati sammukhāvinayapatirūpakena."
    ],
    "innerText": "‘‘Adhammavādī puggalo dhammavādiṃ saṅghaṃ saññāpeti nijjhāpeti pekkheti anupekkheti dasseti anudasseti – ayaṃ dhammo, ayaṃ vinayo, idaṃ satthusāsanaṃ, imaṃ gaṇhāhi, imaṃ rocehīti [imaṃ gaṇhatha, imaṃ rocethāti (ka.)]. Evañcetaṃ adhikaraṇaṃ vūpasammati, adhammena vūpasammati sammukhāvinayapatirūpakena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Adhammavādī sambahulā dhammavādiṃ puggalaṃ saññāpenti nijjhāpenti pekkhenti anupekkhenti dassenti anudassenti – ayaṃ dhammo, ayaṃ vinayo, idaṃ satthusāsanaṃ, imaṃ gaṇhāhi, imaṃ rocehīti. Evañcetaṃ adhikaraṇaṃ vūpasammati, adhammena vūpasammati sammukhāvinayapatirūpakena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Adhammavādī ",
      " sambahulā dhammavādī sambahule saññāpenti nijjhāpenti pekkhenti anupekkhenti dassenti anudassenti – ayaṃ dhammo, ayaṃ vinayo, idaṃ satthusāsanaṃ, imaṃ gaṇhatha, imaṃ rocethāti. Evañcetaṃ adhikaraṇaṃ vūpasammati, adhammena vūpasammati sammukhāvinayapatirūpakena."
    ],
    "innerText": "‘‘Adhammavādī sambahulā dhammavādī sambahule saññāpenti nijjhāpenti pekkhenti anupekkhenti dassenti anudassenti – ayaṃ dhammo, ayaṃ vinayo, idaṃ satthusāsanaṃ, imaṃ gaṇhatha, imaṃ rocethāti. Evañcetaṃ adhikaraṇaṃ vūpasammati, adhammena vūpasammati sammukhāvinayapatirūpakena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Adhammavādī sambahulā dhammavādiṃ saṅghaṃ saññāpenti nijjhāpenti pekkhenti anupekkhenti dassenti anudassenti – ayaṃ dhammo, ayaṃ vinayo, idaṃ satthusāsanaṃ, imaṃ gaṇhāhi, imaṃ rocehīti. Evañcetaṃ adhikaraṇaṃ vūpasammati, adhammena vūpasammati sammukhāvinayapatirūpakena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Adhammavādī saṅgho dhammavādiṃ puggalaṃ saññāpeti nijjhāpeti pekkheti anupekkheti dasseti ",
      " anudasseti – ayaṃ dhammo, ayaṃ vinayo, idaṃ satthusāsanaṃ, imaṃ gaṇhāhi, imaṃ rocehīti. Evañcetaṃ adhikaraṇaṃ vūpasammati, adhammena vūpasammati sammukhāvinayapatirūpakena."
    ],
    "innerText": "‘‘Adhammavādī saṅgho dhammavādiṃ puggalaṃ saññāpeti nijjhāpeti pekkheti anupekkheti dasseti anudasseti – ayaṃ dhammo, ayaṃ vinayo, idaṃ satthusāsanaṃ, imaṃ gaṇhāhi, imaṃ rocehīti. Evañcetaṃ adhikaraṇaṃ vūpasammati, adhammena vūpasammati sammukhāvinayapatirūpakena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Adhammavādī saṅgho dhammavādī sambahule saññāpeti nijjhāpeti pekkheti anupekkheti dasseti anudasseti – ayaṃ dhammo, ayaṃ vinayo, idaṃ satthusāsanaṃ, imaṃ gaṇhatha, imaṃ rocethāti. Evañcetaṃ adhikaraṇaṃ vūpasammati, adhammena vūpasammati sammukhāvinayapatirūpakena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Adhammavādī saṅgho dhammavādiṃ saṅghaṃ saññāpeti nijjhāpeti pekkheti anupekkheti dasseti anudasseti – ayaṃ dhammo, ayaṃ vinayo, idaṃ ",
      " satthusāsanaṃ, imaṃ gaṇhāhi, imaṃ rocehīti. Evañcetaṃ adhikaraṇaṃ vūpasammati, adhammena ",
      " vūpasammati sammukhāvinayapatirūpakena."
    ],
    "innerText": "‘‘Adhammavādī saṅgho dhammavādiṃ saṅghaṃ saññāpeti nijjhāpeti pekkheti anupekkheti dasseti anudasseti – ayaṃ dhammo, ayaṃ vinayo, idaṃ satthusāsanaṃ, imaṃ gaṇhāhi, imaṃ rocehīti. Evañcetaṃ adhikaraṇaṃ vūpasammati, adhammena vūpasammati sammukhāvinayapatirūpakena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Kaṇhapakkhanavakaṃ niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Sukkapakkhanavakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "188"
      },
      ". ‘‘Dhammavādī puggalo adhammavādiṃ puggalaṃ saññāpeti nijjhāpeti pekkheti anupekkheti dasseti anudasseti – ayaṃ dhammo, ayaṃ vinayo, idaṃ satthusāsanaṃ, imaṃ gaṇhāhi, imaṃ rocehīti. Evañcetaṃ adhikaraṇaṃ vūpasammati, dhammena vūpasammati sammukhāvinayena."
    ],
    "innerText": "188. ‘‘Dhammavādī puggalo adhammavādiṃ puggalaṃ saññāpeti nijjhāpeti pekkheti anupekkheti dasseti anudasseti – ayaṃ dhammo, ayaṃ vinayo, idaṃ satthusāsanaṃ, imaṃ gaṇhāhi, imaṃ rocehīti. Evañcetaṃ adhikaraṇaṃ vūpasammati, dhammena vūpasammati sammukhāvinayena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Dhammavādī puggalo adhammavādī sambahule saññāpeti nijjhāpeti pekkheti anupekkheti dasseti anudasseti – ayaṃ dhammo, ayaṃ vinayo, idaṃ satthusāsanaṃ, imaṃ gaṇhatha, imaṃ rocethāti. Evañcetaṃ adhikaraṇaṃ vūpasammati, dhammena vūpasammati sammukhāvinayena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Dhammavādī puggalo adhammavādiṃ saṅghaṃ saññāpeti nijjhāpeti pekkheti anupekkheti dasseti anudasseti – ayaṃ dhammo, ayaṃ vinayo, idaṃ satthusāsanaṃ, imaṃ gaṇhāhi, imaṃ rocehīti. Evañcetaṃ adhikaraṇaṃ vūpasammati, dhammena vūpasammati sammukhāvinayena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Dhammavādī sambahulā adhammavādiṃ puggalaṃ saññāpenti nijjhāpenti pekkhenti anupekkhenti dassenti anudassenti – ayaṃ dhammo, ayaṃ vinayo, idaṃ satthusāsanaṃ, imaṃ gaṇhāhi ",
      ", imaṃ rocehīti. Evañcetaṃ adhikaraṇaṃ vūpasammati, dhammena vūpasammati sammukhāvinayena."
    ],
    "innerText": "‘‘Dhammavādī sambahulā adhammavādiṃ puggalaṃ saññāpenti nijjhāpenti pekkhenti anupekkhenti dassenti anudassenti – ayaṃ dhammo, ayaṃ vinayo, idaṃ satthusāsanaṃ, imaṃ gaṇhāhi , imaṃ rocehīti. Evañcetaṃ adhikaraṇaṃ vūpasammati, dhammena vūpasammati sammukhāvinayena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Dhammavādī sambahulā adhammavādī sambahule saññāpenti nijjhāpenti pekkhenti anupekkhenti dassenti ",
      " anudassenti – ayaṃ dhammo, ayaṃ vinayo, idaṃ satthusāsanaṃ, imaṃ gaṇhatha, imaṃ rocethāti. Evañcetaṃ adhikaraṇaṃ vūpasammati, dhammena vūpasammati sammukhāvinayena."
    ],
    "innerText": "‘‘Dhammavādī sambahulā adhammavādī sambahule saññāpenti nijjhāpenti pekkhenti anupekkhenti dassenti anudassenti – ayaṃ dhammo, ayaṃ vinayo, idaṃ satthusāsanaṃ, imaṃ gaṇhatha, imaṃ rocethāti. Evañcetaṃ adhikaraṇaṃ vūpasammati, dhammena vūpasammati sammukhāvinayena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Dhammavādī sambahulā adhammavādiṃ saṅghaṃ saññāpenti nijjhāpenti pekkhenti anupekkhenti dassenti anudassenti – ayaṃ dhammo, ayaṃ vinayo, idaṃ satthusāsanaṃ ",
      ", imaṃ gaṇhāhi, imaṃ rocehīti. Evañcetaṃ adhikaraṇaṃ vūpasammati, dhammena vūpasammati sammukhāvinayena."
    ],
    "innerText": "‘‘Dhammavādī sambahulā adhammavādiṃ saṅghaṃ saññāpenti nijjhāpenti pekkhenti anupekkhenti dassenti anudassenti – ayaṃ dhammo, ayaṃ vinayo, idaṃ satthusāsanaṃ , imaṃ gaṇhāhi, imaṃ rocehīti. Evañcetaṃ adhikaraṇaṃ vūpasammati, dhammena vūpasammati sammukhāvinayena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Dhammavādī saṅgho adhammavādiṃ puggalaṃ saññāpeti nijjhāpeti pekkheti anupekkheti dasseti anudasseti – ayaṃ dhammo, ayaṃ vinayo, idaṃ satthusāsanaṃ, imaṃ gaṇhāhi, imaṃ rocehīti. Evañcetaṃ adhikaraṇaṃ vūpasammati, dhammena vūpasammati sammukhāvinayena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Dhammavādī saṅgho adhammavādī sambahule saññāpeti nijjhāpeti pekkheti anupekkheti dasseti anudasseti – ayaṃ dhammo, ayaṃ vinayo, idaṃ satthusāsanaṃ, imaṃ gaṇhatha, imaṃ rocethāti. Evañcetaṃ adhikaraṇaṃ vūpasammati, dhammena vūpasammati sammukhāvinayena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Dhammavādī saṅgho adhammavādiṃ saṅghaṃ saññāpeti nijjhāpeti pekkheti anupekkheti dasseti anudasseti – ayaṃ dhammo, ayaṃ vinayo, idaṃ satthusāsanaṃ, imaṃ gaṇhāhi, imaṃ rocehīti. Evañcetaṃ adhikaraṇaṃ vūpasammati, dhammena vūpasammati sammukhāvinayenā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sukkapakkhanavakaṃ niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Sativinayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "189"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[idaṃ vatthu pārā. 380 ādayo]"
      },
      " Tena ",
      " samayena buddho bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Tena kho pana samayena āyasmatā dabbena mallaputtena jātiyā sattavassena arahattaṃ sacchikataṃ hoti ",
      ". Yaṃ kiñci sāvakena pattabbaṃ sabbaṃ tena anuppattaṃ hoti. Natthi cassa kiñci uttari ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[uttariṃ (sī.)]"
      },
      " karaṇīyaṃ, katassa vā paticayo. Atha kho āyasmato dabbassa mallaputtassa rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘‘mayā kho jātiyā sattavassena arahattaṃ sacchikataṃ. Yaṃ kiñci sāvakena pattabbaṃ sabbaṃ mayā anuppattaṃ. Natthi ca me kiñci uttarikaraṇīyaṃ, katassa vā paticayo. Kiṃ nu kho ahaṃ saṅghassa veyyāvaccaṃ kareyya’’nti?"
    ],
    "innerText": "189.[idaṃ vatthu pārā. 380 ādayo] Tena samayena buddho bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Tena kho pana samayena āyasmatā dabbena mallaputtena jātiyā sattavassena arahattaṃ sacchikataṃ hoti . Yaṃ kiñci sāvakena pattabbaṃ sabbaṃ tena anuppattaṃ hoti. Natthi cassa kiñci uttari [uttariṃ (sī.)] karaṇīyaṃ, katassa vā paticayo. Atha kho āyasmato dabbassa mallaputtassa rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘‘mayā kho jātiyā sattavassena arahattaṃ sacchikataṃ. Yaṃ kiñci sāvakena pattabbaṃ sabbaṃ mayā anuppattaṃ. Natthi ca me kiñci uttarikaraṇīyaṃ, katassa vā paticayo. Kiṃ nu kho ahaṃ saṅghassa veyyāvaccaṃ kareyya’’nti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " kho āyasmato dabbassa mallaputtassa etadahosi – ‘‘yaṃnūnāhaṃ saṅghassa senāsanañca ",
      " paññapeyyaṃ bhattāni ca uddiseyya’’nti. Atha kho āyasmā dabbo mallaputto sāyanhasamayaṃ paṭisallānā vuṭṭhito yena bhagavā tenupasaṅkami, upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā dabbo mallaputto bhagavantaṃ etadavoca – ‘‘idha mayhaṃ, bhante, rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘mayā kho jātiyā sattavassena arahattaṃ sacchikataṃ. Yaṃ kiñci sāvakena pattabbaṃ, sabbaṃ mayā anuppattaṃ. Natthi ca me kiñci uttarikaraṇīyaṃ, katassa vā paticayo. Kiṃ nu kho ahaṃ saṅghassa veyyāvaccaṃ kareyya’nti ",
      "? Tassa mayhaṃ, bhante, etadahosi – ‘yaṃnūnāhaṃ saṅghassa senāsanañca paññapeyyaṃ bhattāni ca uddiseyya’nti. Icchāmahaṃ, bhante, saṅghassa senāsanañca paññāpetuṃ bhattāni ca uddisitu’’nti. ‘‘Sādhu sādhu, dabba. Tena hi tvaṃ, dabba, saṅghassa senāsanañca paññapehi bhattāni ca uddisāhī’’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[uddisāti (pārā. 380)]"
      },
      ". ‘‘Evaṃ, bhante’’ti kho āyasmā dabbo mallaputto bhagavato paccassosi. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘tena hi, bhikkhave, saṅgho dabbaṃ mallaputtaṃ senāsanapaññāpakañca bhattuddesakañca sammannatu. Evañca pana, bhikkhave, sammannitabbo. Paṭhamaṃ dabbo mallaputto yācitabbo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[dabbo yācitabbo (syā. ka.)]"
      },
      ". Yācitvā byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
    ],
    "innerText": "Atha kho āyasmato dabbassa mallaputtassa etadahosi – ‘‘yaṃnūnāhaṃ saṅghassa senāsanañca paññapeyyaṃ bhattāni ca uddiseyya’’nti. Atha kho āyasmā dabbo mallaputto sāyanhasamayaṃ paṭisallānā vuṭṭhito yena bhagavā tenupasaṅkami, upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā dabbo mallaputto bhagavantaṃ etadavoca – ‘‘idha mayhaṃ, bhante, rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘mayā kho jātiyā sattavassena arahattaṃ sacchikataṃ. Yaṃ kiñci sāvakena pattabbaṃ, sabbaṃ mayā anuppattaṃ. Natthi ca me kiñci uttarikaraṇīyaṃ, katassa vā paticayo. Kiṃ nu kho ahaṃ saṅghassa veyyāvaccaṃ kareyya’nti ? Tassa mayhaṃ, bhante, etadahosi – ‘yaṃnūnāhaṃ saṅghassa senāsanañca paññapeyyaṃ bhattāni ca uddiseyya’nti. Icchāmahaṃ, bhante, saṅghassa senāsanañca paññāpetuṃ bhattāni ca uddisitu’’nti. ‘‘Sādhu sādhu, dabba. Tena hi tvaṃ, dabba, saṅghassa senāsanañca paññapehi bhattāni ca uddisāhī’’ti [uddisāti (pārā. 380)]. ‘‘Evaṃ, bhante’’ti kho āyasmā dabbo mallaputto bhagavato paccassosi. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘tena hi, bhikkhave, saṅgho dabbaṃ mallaputtaṃ senāsanapaññāpakañca bhattuddesakañca sammannatu. Evañca pana, bhikkhave, sammannitabbo. Paṭhamaṃ dabbo mallaputto yācitabbo [dabbo yācitabbo (syā. ka.)]. Yācitvā byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "190"
      },
      ". ‘‘Suṇātu me, bhante, saṅgho. Yadi saṅghassa pattakallaṃ, saṅgho āyasmantaṃ dabbaṃ mallaputtaṃ senāsanapaññāpakañca bhattuddesakañca sammanneyya. Esā ñatti."
    ],
    "innerText": "190. ‘‘Suṇātu me, bhante, saṅgho. Yadi saṅghassa pattakallaṃ, saṅgho āyasmantaṃ dabbaṃ mallaputtaṃ senāsanapaññāpakañca bhattuddesakañca sammanneyya. Esā ñatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Saṅgho āyasmantaṃ dabbaṃ mallaputtaṃ senāsanapaññāpakañca bhattuddesakañca sammannati. Yassāyasmato khamati āyasmato dabbassa mallaputtassa senāsanapaññāpakassa ca bhattuddesakassa ca sammuti, so tuṇhassa; yassa nakkhamati, so bhāseyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sammato ",
      " saṅghena āyasmā dabbo mallaputto senāsanapaññāpako ca bhattuddesako ca. Khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti ",
      "."
    ],
    "innerText": "‘‘Sammato saṅghena āyasmā dabbo mallaputto senāsanapaññāpako ca bhattuddesako ca. Khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "191"
      },
      ". Sammato ",
      " ca panāyasmā dabbo mallaputto sabhāgānaṃ bhikkhūnaṃ ekajjhaṃ senāsanaṃ paññapeti. Ye te bhikkhū suttantikā tesaṃ ekajjhaṃ senāsanaṃ paññapeti – te aññamaññaṃ suttantaṃ saṅgāyissantīti. Ye te bhikkhū vinayadharā tesaṃ ekajjhaṃ senāsanaṃ paññapeti – te aññamaññaṃ vinayaṃ vinicchinissantīti. Ye te bhikkhū dhammakathikā tesaṃ ekajjhaṃ senāsanaṃ paññapeti – te aññamaññaṃ dhammaṃ sākacchissantīti. Ye te bhikkhū jhāyino tesaṃ ekajjhaṃ senāsanaṃ paññapeti – te aññamaññaṃ na byābādhissantīti ",
      ". Ye te bhikkhū tiracchānakathikā kāyadaḷhibahulā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kāyadaḍḍhibahulā (sī.)]"
      },
      " viharanti tesampi ekajjhaṃ senāsanaṃ paññapeti – imāyapime āyasmanto ratiyā acchissantīti. Yepi te bhikkhū vikāle āgacchanti tesampi tejodhātuṃ samāpajjitvā teneva ālokena senāsanaṃ paññapeti; apisu bhikkhū sañcicca vikāle āgacchanti – mayaṃ āyasmato dabbassa mallaputtassa iddhipāṭihāriyaṃ passissāmāti."
    ],
    "innerText": "191. Sammato ca panāyasmā dabbo mallaputto sabhāgānaṃ bhikkhūnaṃ ekajjhaṃ senāsanaṃ paññapeti. Ye te bhikkhū suttantikā tesaṃ ekajjhaṃ senāsanaṃ paññapeti – te aññamaññaṃ suttantaṃ saṅgāyissantīti. Ye te bhikkhū vinayadharā tesaṃ ekajjhaṃ senāsanaṃ paññapeti – te aññamaññaṃ vinayaṃ vinicchinissantīti. Ye te bhikkhū dhammakathikā tesaṃ ekajjhaṃ senāsanaṃ paññapeti – te aññamaññaṃ dhammaṃ sākacchissantīti. Ye te bhikkhū jhāyino tesaṃ ekajjhaṃ senāsanaṃ paññapeti – te aññamaññaṃ na byābādhissantīti . Ye te bhikkhū tiracchānakathikā kāyadaḷhibahulā [kāyadaḍḍhibahulā (sī.)] viharanti tesampi ekajjhaṃ senāsanaṃ paññapeti – imāyapime āyasmanto ratiyā acchissantīti. Yepi te bhikkhū vikāle āgacchanti tesampi tejodhātuṃ samāpajjitvā teneva ālokena senāsanaṃ paññapeti; apisu bhikkhū sañcicca vikāle āgacchanti – mayaṃ āyasmato dabbassa mallaputtassa iddhipāṭihāriyaṃ passissāmāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Te āyasmantaṃ dabbaṃ mallaputtaṃ upasaṅkamitvā evaṃ vadanti – ‘‘amhākaṃ, āvuso dabba, senāsanaṃ paññapehī’’ti. Te āyasmā dabbo mallaputto evaṃ vadeti – ‘‘kattha āyasmantā icchanti kattha paññapemī’’ti? Te sañcicca dūre apadisanti – ‘‘amhākaṃ, āvuso dabba, gijjhakūṭe pabbate senāsanaṃ ",
      " paññapehi. Amhākaṃ, āvuso, corapapāte senāsanaṃ paññapehi. Amhākaṃ, āvuso, isigilipasse kāḷasilāyaṃ senāsanaṃ paññapehi. Amhākaṃ, āvuso, vebhārapasse sattapaṇṇiguhāyaṃ senāsanaṃ paññapehi. Amhākaṃ, āvuso, sītavane sappasoṇḍikapabbhāre senāsanaṃ paññapehi. Amhākaṃ, āvuso, gotamakakandarāyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[gomaṭakandarāyaṃ (syā. kaṃ.)]"
      },
      " senāsanaṃ paññapehi. Amhākaṃ, āvuso, tindukakandarāyaṃ senāsanaṃ paññapehi. Amhākaṃ, āvuso, tapodakandarāyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kapotakandarāyaṃ (ka.)]"
      },
      " senāsanaṃ paññapehi. Amhākaṃ, āvuso, tapodārāme senāsanaṃ paññapehi. Amhākaṃ, āvuso, jīvakambavane senāsanaṃ paññapehi. Amhākaṃ, āvuso, maddakucchimhi migadāye senāsanaṃ paññapehī’’ti."
    ],
    "innerText": "Te āyasmantaṃ dabbaṃ mallaputtaṃ upasaṅkamitvā evaṃ vadanti – ‘‘amhākaṃ, āvuso dabba, senāsanaṃ paññapehī’’ti. Te āyasmā dabbo mallaputto evaṃ vadeti – ‘‘kattha āyasmantā icchanti kattha paññapemī’’ti? Te sañcicca dūre apadisanti – ‘‘amhākaṃ, āvuso dabba, gijjhakūṭe pabbate senāsanaṃ paññapehi. Amhākaṃ, āvuso, corapapāte senāsanaṃ paññapehi. Amhākaṃ, āvuso, isigilipasse kāḷasilāyaṃ senāsanaṃ paññapehi. Amhākaṃ, āvuso, vebhārapasse sattapaṇṇiguhāyaṃ senāsanaṃ paññapehi. Amhākaṃ, āvuso, sītavane sappasoṇḍikapabbhāre senāsanaṃ paññapehi. Amhākaṃ, āvuso, gotamakakandarāyaṃ [gomaṭakandarāyaṃ (syā. kaṃ.)] senāsanaṃ paññapehi. Amhākaṃ, āvuso, tindukakandarāyaṃ senāsanaṃ paññapehi. Amhākaṃ, āvuso, tapodakandarāyaṃ [kapotakandarāyaṃ (ka.)] senāsanaṃ paññapehi. Amhākaṃ, āvuso, tapodārāme senāsanaṃ paññapehi. Amhākaṃ, āvuso, jīvakambavane senāsanaṃ paññapehi. Amhākaṃ, āvuso, maddakucchimhi migadāye senāsanaṃ paññapehī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tesaṃ ",
      " āyasmā dabbo mallaputto tejodhātuṃ samāpajjitvā aṅguliyā jalamānāya purato purato gacchati. Tepi teneva ālokena āyasmato dabbassa mallaputtassa piṭṭhito piṭṭhito gacchanti. Tesaṃ āyasmā dabbo mallaputto evaṃ senāsanaṃ paññapeti – ayaṃ mañco, idaṃ pīṭhaṃ ",
      ", ayaṃ bhisi, idaṃ bibbohanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[bimbohanaṃ (sī. syā. kaṃ.)]"
      },
      ", idaṃ vaccaṭṭhānaṃ, idaṃ passāvaṭṭhānaṃ, idaṃ pānīyaṃ, idaṃ paribhojanīyaṃ, ayaṃ kattaradaṇḍo, idaṃ saṅghassa katikasaṇṭhānaṃ, imaṃ kālaṃ pavisitabbaṃ ",
      ", imaṃ kālaṃ nikkhamitabbanti. Tesaṃ āyasmā dabbo mallaputto evaṃ senāsanaṃ paññapetvā punadeva veḷuvanaṃ paccāgacchati."
    ],
    "innerText": "Tesaṃ āyasmā dabbo mallaputto tejodhātuṃ samāpajjitvā aṅguliyā jalamānāya purato purato gacchati. Tepi teneva ālokena āyasmato dabbassa mallaputtassa piṭṭhito piṭṭhito gacchanti. Tesaṃ āyasmā dabbo mallaputto evaṃ senāsanaṃ paññapeti – ayaṃ mañco, idaṃ pīṭhaṃ , ayaṃ bhisi, idaṃ bibbohanaṃ [bimbohanaṃ (sī. syā. kaṃ.)], idaṃ vaccaṭṭhānaṃ, idaṃ passāvaṭṭhānaṃ, idaṃ pānīyaṃ, idaṃ paribhojanīyaṃ, ayaṃ kattaradaṇḍo, idaṃ saṅghassa katikasaṇṭhānaṃ, imaṃ kālaṃ pavisitabbaṃ , imaṃ kālaṃ nikkhamitabbanti. Tesaṃ āyasmā dabbo mallaputto evaṃ senāsanaṃ paññapetvā punadeva veḷuvanaṃ paccāgacchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "192"
      },
      ". Tena kho pana samayena mettiyabhūmajakā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mettiyabhummajakā (sī. syā. kaṃ.)]"
      },
      " bhikkhū navakā ceva honti appapuññā ca. Yāni saṅghassa lāmakāni senāsanāni tāni tesaṃ pāpuṇanti lāmakāni ca bhattāni. Tena kho pana samayena rājagahe manussā icchanti ",
      " therānaṃ bhikkhūnaṃ abhisaṅkhārikaṃ piṇḍapātaṃ dātuṃ – sappimpi, telampi, uttaribhaṅgampi. Mettiyabhūmajakānaṃ pana bhikkhūnaṃ pākatikaṃ denti – yathārandhaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yathāraddhaṃ (syā.)]"
      },
      " kaṇājakaṃ bilaṅgadutiyaṃ. Te pacchābhattaṃ piṇḍapātappaṭikkantā there bhikkhū pucchanti – ‘‘tumhākaṃ, āvuso, bhattagge kiṃ ahosi, tumhākaṃ kiṃ ahosī’’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kiṃ nāhosi (syā. kaṃ.)]"
      },
      "? Ekacce therā evaṃ vadanti – ‘‘amhākaṃ, āvuso, sappi ahosi, telaṃ ahosi, uttaribhaṅgaṃ ahosī’’ti. Mettiyabhūmajakā pana bhikkhū evaṃ vadanti – ‘‘amhākaṃ, āvuso, na kiñci ahosi – pākatikaṃ yathārandhaṃ kaṇājakaṃ bilaṅgadutiya’’nti."
    ],
    "innerText": "192. Tena kho pana samayena mettiyabhūmajakā [mettiyabhummajakā (sī. syā. kaṃ.)] bhikkhū navakā ceva honti appapuññā ca. Yāni saṅghassa lāmakāni senāsanāni tāni tesaṃ pāpuṇanti lāmakāni ca bhattāni. Tena kho pana samayena rājagahe manussā icchanti therānaṃ bhikkhūnaṃ abhisaṅkhārikaṃ piṇḍapātaṃ dātuṃ – sappimpi, telampi, uttaribhaṅgampi. Mettiyabhūmajakānaṃ pana bhikkhūnaṃ pākatikaṃ denti – yathārandhaṃ [yathāraddhaṃ (syā.)] kaṇājakaṃ bilaṅgadutiyaṃ. Te pacchābhattaṃ piṇḍapātappaṭikkantā there bhikkhū pucchanti – ‘‘tumhākaṃ, āvuso, bhattagge kiṃ ahosi, tumhākaṃ kiṃ ahosī’’ti [kiṃ nāhosi (syā. kaṃ.)]? Ekacce therā evaṃ vadanti – ‘‘amhākaṃ, āvuso, sappi ahosi, telaṃ ahosi, uttaribhaṅgaṃ ahosī’’ti. Mettiyabhūmajakā pana bhikkhū evaṃ vadanti – ‘‘amhākaṃ, āvuso, na kiñci ahosi – pākatikaṃ yathārandhaṃ kaṇājakaṃ bilaṅgadutiya’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena kho pana samayena kalyāṇabhattiko gahapati saṅghassa catukkabhattaṃ deti niccabhattaṃ. So bhattagge saputtadāro upatiṭṭhitvā parivisati – aññe odanena pucchanti, aññe sūpena pucchanti, aññe telena pucchanti, aññe uttaribhaṅgena pucchanti. Tena kho pana samayena kalyāṇabhattikassa gahapatino bhattaṃ svātanāya mettiyabhūmajakānaṃ bhikkhūnaṃ uddiṭṭhaṃ hoti. Atha ",
      " kho kalyāṇabhattiko gahapati ārāmaṃ agamāsi kenacideva karaṇīyena. So yenāyasmā dabbo mallaputto tenupasaṅkami, upasaṅkamitvā āyasmantaṃ dabbaṃ mallaputtaṃ abhivādetvā ekamantaṃ ",
      " nisīdi. Ekamantaṃ nisinnaṃ kho kalyāṇabhattikaṃ gahapatiṃ āyasmā dabbo mallaputto dhammiyā kathāya sandassesi samādapesi samuttejesi sampahaṃsesi. Atha kho kalyāṇabhattiko gahapati āyasmatā dabbena mallaputtena dhammiyā kathāya sandassito samādapito samuttejito sampahaṃsito āyasmantaṃ dabbaṃ mallaputtaṃ etadavoca – ‘‘kassa, bhante, amhākaṃ ghare svātanāya bhattaṃ uddiṭṭha’’nti? ‘‘Mettiyabhūmajakānaṃ kho, gahapati, bhikkhūnaṃ tumhākaṃ ghare svātanāya bhattaṃ uddiṭṭha’’nti. Atha kho kalyāṇabhattiko gahapati anattamano ahosi. Kathañhi nāma pāpabhikkhū amhākaṃ ghare bhuñjissantīti gharaṃ gantvā dāsiṃ āṇāpesi – ‘‘ye, je, sve bhattikā āgacchanti te koṭṭhake āsanaṃ paññapetvā kaṇājakena bilaṅgadutiyena ",
      " parivisā’’ti. ‘‘Evaṃ ayyā’’ti kho sā dāsī kalyāṇabhattikassa gahapatino paccassosi."
    ],
    "innerText": "Tena kho pana samayena kalyāṇabhattiko gahapati saṅghassa catukkabhattaṃ deti niccabhattaṃ. So bhattagge saputtadāro upatiṭṭhitvā parivisati – aññe odanena pucchanti, aññe sūpena pucchanti, aññe telena pucchanti, aññe uttaribhaṅgena pucchanti. Tena kho pana samayena kalyāṇabhattikassa gahapatino bhattaṃ svātanāya mettiyabhūmajakānaṃ bhikkhūnaṃ uddiṭṭhaṃ hoti. Atha kho kalyāṇabhattiko gahapati ārāmaṃ agamāsi kenacideva karaṇīyena. So yenāyasmā dabbo mallaputto tenupasaṅkami, upasaṅkamitvā āyasmantaṃ dabbaṃ mallaputtaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho kalyāṇabhattikaṃ gahapatiṃ āyasmā dabbo mallaputto dhammiyā kathāya sandassesi samādapesi samuttejesi sampahaṃsesi. Atha kho kalyāṇabhattiko gahapati āyasmatā dabbena mallaputtena dhammiyā kathāya sandassito samādapito samuttejito sampahaṃsito āyasmantaṃ dabbaṃ mallaputtaṃ etadavoca – ‘‘kassa, bhante, amhākaṃ ghare svātanāya bhattaṃ uddiṭṭha’’nti? ‘‘Mettiyabhūmajakānaṃ kho, gahapati, bhikkhūnaṃ tumhākaṃ ghare svātanāya bhattaṃ uddiṭṭha’’nti. Atha kho kalyāṇabhattiko gahapati anattamano ahosi. Kathañhi nāma pāpabhikkhū amhākaṃ ghare bhuñjissantīti gharaṃ gantvā dāsiṃ āṇāpesi – ‘‘ye, je, sve bhattikā āgacchanti te koṭṭhake āsanaṃ paññapetvā kaṇājakena bilaṅgadutiyena parivisā’’ti. ‘‘Evaṃ ayyā’’ti kho sā dāsī kalyāṇabhattikassa gahapatino paccassosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho mettiyabhūmajakā bhikkhū – hiyyo kho, āvuso, amhākaṃ kalyāṇabhattikassa gahapatino bhattaṃ uddiṭṭhaṃ; sve amhe kalyāṇabhattiko gahapati saputtadāro upatiṭṭhitvā parivisissati; aññe odanena pucchissanti, aññe sūpena pucchissanti, aññe ",
      " telena pucchissanti, aññe uttaribhaṅgena pucchissantīti. Te teneva somanassena ",
      " na cittarūpaṃ rattiyā supiṃsu. Atha kho mettiyabhūmajakā bhikkhū pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya yena kalyāṇabhattikassa gahapatino nivesanaṃ tenupasaṅkamiṃsu. Addasā kho sā dāsī mettiyabhūmajake bhikkhū dūratova āgacchante; disvāna koṭṭhake āsanaṃ paññāpetvā mettiyabhūmajake bhikkhū etadavoca – ‘‘nisīdatha, bhante’’ti. Atha kho mettiyabhūmajakānaṃ bhikkhūnaṃ etadahosi – ‘‘nissaṃsayaṃ kho na tāva bhattaṃ siddhaṃ bhavissati yathā mayaṃ koṭṭhake nisīdāpiyāmā’’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[nisīdāpeyyāmāti (ka.)]"
      },
      ". Atha kho sā dāsī kaṇājakena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kāṇājakena (syā. kaṃ.)]"
      },
      " bilaṅgadutiyena upagañchi – bhuñjatha, bhanteti. ‘‘Mayaṃ kho, bhagini, niccabhattikā’’ti. ‘‘Jānāmi ayyā niccabhattikāti. Api cāhaṃ hiyyova gahapatinā āṇattā – ‘ye, je, sve bhattikā āgacchanti, te koṭṭhake āsanaṃ paññāpetvā kaṇājakena bilaṅgadutiyena parivisā’ti. Bhuñjatha, bhante’’ti. Atha kho mettiyabhūmajakā bhikkhū – hiyyo kho, āvuso, kalyāṇabhattiko gahapati ārāmaṃ agamāsi dabbassa mallaputtassa ",
      " santike. Nissaṃsayaṃ kho mayaṃ dabbena mallaputtena gahapatino antare paribhinnāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[santike paribhinnāti (syā. kaṃ.)]"
      },
      ". Te teneva domanassena na cittarūpaṃ bhuñjiṃsu. Atha kho mettiyabhūmajakā bhikkhū pacchābhattaṃ piṇḍapātappaṭikkantā ārāmaṃ gantvā pattacīvaraṃ paṭisāmetvā bahārāmakoṭṭhake saṅghāṭipallatthikāya nisīdiṃsu tuṇhībhūtā maṅkubhūtā pattakkhandhā adhomukhā pajjhāyantā ",
      " appaṭibhānā."
    ],
    "innerText": "Atha kho mettiyabhūmajakā bhikkhū – hiyyo kho, āvuso, amhākaṃ kalyāṇabhattikassa gahapatino bhattaṃ uddiṭṭhaṃ; sve amhe kalyāṇabhattiko gahapati saputtadāro upatiṭṭhitvā parivisissati; aññe odanena pucchissanti, aññe sūpena pucchissanti, aññe telena pucchissanti, aññe uttaribhaṅgena pucchissantīti. Te teneva somanassena na cittarūpaṃ rattiyā supiṃsu. Atha kho mettiyabhūmajakā bhikkhū pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya yena kalyāṇabhattikassa gahapatino nivesanaṃ tenupasaṅkamiṃsu. Addasā kho sā dāsī mettiyabhūmajake bhikkhū dūratova āgacchante; disvāna koṭṭhake āsanaṃ paññāpetvā mettiyabhūmajake bhikkhū etadavoca – ‘‘nisīdatha, bhante’’ti. Atha kho mettiyabhūmajakānaṃ bhikkhūnaṃ etadahosi – ‘‘nissaṃsayaṃ kho na tāva bhattaṃ siddhaṃ bhavissati yathā mayaṃ koṭṭhake nisīdāpiyāmā’’ti [nisīdāpeyyāmāti (ka.)]. Atha kho sā dāsī kaṇājakena [kāṇājakena (syā. kaṃ.)] bilaṅgadutiyena upagañchi – bhuñjatha, bhanteti. ‘‘Mayaṃ kho, bhagini, niccabhattikā’’ti. ‘‘Jānāmi ayyā niccabhattikāti. Api cāhaṃ hiyyova gahapatinā āṇattā – ‘ye, je, sve bhattikā āgacchanti, te koṭṭhake āsanaṃ paññāpetvā kaṇājakena bilaṅgadutiyena parivisā’ti. Bhuñjatha, bhante’’ti. Atha kho mettiyabhūmajakā bhikkhū – hiyyo kho, āvuso, kalyāṇabhattiko gahapati ārāmaṃ agamāsi dabbassa mallaputtassa santike. Nissaṃsayaṃ kho mayaṃ dabbena mallaputtena gahapatino antare paribhinnāti [santike paribhinnāti (syā. kaṃ.)]. Te teneva domanassena na cittarūpaṃ bhuñjiṃsu. Atha kho mettiyabhūmajakā bhikkhū pacchābhattaṃ piṇḍapātappaṭikkantā ārāmaṃ gantvā pattacīvaraṃ paṭisāmetvā bahārāmakoṭṭhake saṅghāṭipallatthikāya nisīdiṃsu tuṇhībhūtā maṅkubhūtā pattakkhandhā adhomukhā pajjhāyantā appaṭibhānā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho mettiyā bhikkhunī yena mettiyabhūmajakā bhikkhū tenupasaṅkami, upasaṅkamitvā mettiyabhūmajake bhikkhū etadavoca – ‘‘vandāmi ayyā’’ti. Evaṃ vutte mettiyabhūmajakā bhikkhū nālapiṃsu. Dutiyampi kho…pe… tatiyampi kho mettiyā bhikkhunī mettiyabhūmajake bhikkhū etadavoca – ‘‘vandāmi ayyā’’ti. Tatiyampi kho mettiyabhūmajakā bhikkhū nālapiṃsu. ‘‘Kyāhaṃ ayyānaṃ aparajjhāmi? Kissa maṃ ayyā nālapantī’’ti? ‘‘Tathā hi pana tvaṃ, bhagini, amhe dabbena mallaputtena viheṭhiyamāne ajjhupekkhasī’’ti? ‘‘Kyāhaṃ, ayyā, karomī’’ti? ‘‘Sace kho tvaṃ, bhagini, iccheyyāsi, ajjeva bhagavā āyasmantaṃ dabbaṃ ",
      " mallaputtaṃ nāsāpeyyā’’ti. ‘‘Kyāhaṃ, ayyā, karomi? Kiṃ mayā sakkā kātu’’nti? ‘‘Ehi tvaṃ, bhagini, yena bhagavā tenupasaṅkami, upasaṅkamitvā bhagavantaṃ evaṃ vadehi – ‘idaṃ ",
      ", bhante, nacchannaṃ nappatirūpaṃ, yāyaṃ, bhante, disā abhayā anītikā anupaddavā sāyaṃ disā sabhayā saītikā saupaddavā; yato nivātaṃ tato savātaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[tato pavātaṃ (sī. syā. kaṃ.)]"
      },
      "; udakaṃ maññe ādittaṃ; ayyenamhi dabbena mallaputtena dūsitā’’’ti. ‘‘Evaṃ ayyā’’ti kho mettiyā bhikkhunī mettiyabhūmajakānaṃ bhikkhūnaṃ paṭissutvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[paṭissuṇitvā (syā. kaṃ.)]"
      },
      " yena bhagavā tenupasaṅkami, upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhitā kho mettiyā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sā mettiyā (syā. ka.)]"
      },
      " bhikkhunī bhagavantaṃ etadavoca ",
      " – ‘‘idaṃ, bhante, nacchannaṃ nappatirūpaṃ, yāyaṃ, bhante, disā abhayā anītikā anupaddavā sāyaṃ disā sabhayā saītikā saupaddavā; yato nivātaṃ tato savātaṃ; udakaṃ maññe ādittaṃ; ayyenamhi dabbena mallaputtena dūsitā’’ti."
    ],
    "innerText": "Atha kho mettiyā bhikkhunī yena mettiyabhūmajakā bhikkhū tenupasaṅkami, upasaṅkamitvā mettiyabhūmajake bhikkhū etadavoca – ‘‘vandāmi ayyā’’ti. Evaṃ vutte mettiyabhūmajakā bhikkhū nālapiṃsu. Dutiyampi kho…pe… tatiyampi kho mettiyā bhikkhunī mettiyabhūmajake bhikkhū etadavoca – ‘‘vandāmi ayyā’’ti. Tatiyampi kho mettiyabhūmajakā bhikkhū nālapiṃsu. ‘‘Kyāhaṃ ayyānaṃ aparajjhāmi? Kissa maṃ ayyā nālapantī’’ti? ‘‘Tathā hi pana tvaṃ, bhagini, amhe dabbena mallaputtena viheṭhiyamāne ajjhupekkhasī’’ti? ‘‘Kyāhaṃ, ayyā, karomī’’ti? ‘‘Sace kho tvaṃ, bhagini, iccheyyāsi, ajjeva bhagavā āyasmantaṃ dabbaṃ mallaputtaṃ nāsāpeyyā’’ti. ‘‘Kyāhaṃ, ayyā, karomi? Kiṃ mayā sakkā kātu’’nti? ‘‘Ehi tvaṃ, bhagini, yena bhagavā tenupasaṅkami, upasaṅkamitvā bhagavantaṃ evaṃ vadehi – ‘idaṃ , bhante, nacchannaṃ nappatirūpaṃ, yāyaṃ, bhante, disā abhayā anītikā anupaddavā sāyaṃ disā sabhayā saītikā saupaddavā; yato nivātaṃ tato savātaṃ [tato pavātaṃ (sī. syā. kaṃ.)]; udakaṃ maññe ādittaṃ; ayyenamhi dabbena mallaputtena dūsitā’’’ti. ‘‘Evaṃ ayyā’’ti kho mettiyā bhikkhunī mettiyabhūmajakānaṃ bhikkhūnaṃ paṭissutvā [paṭissuṇitvā (syā. kaṃ.)] yena bhagavā tenupasaṅkami, upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhitā kho mettiyā [sā mettiyā (syā. ka.)] bhikkhunī bhagavantaṃ etadavoca – ‘‘idaṃ, bhante, nacchannaṃ nappatirūpaṃ, yāyaṃ, bhante, disā abhayā anītikā anupaddavā sāyaṃ disā sabhayā saītikā saupaddavā; yato nivātaṃ tato savātaṃ; udakaṃ maññe ādittaṃ; ayyenamhi dabbena mallaputtena dūsitā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "193"
      },
      ". Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe bhikkhusaṅghaṃ sannipātāpetvā āyasmantaṃ dabbaṃ mallaputtaṃ paṭipucchi – ‘‘sarasi tvaṃ, dabba, evarūpaṃ kattā ",
      " yathāyaṃ bhikkhunī āhā’’ti? ‘‘Yathā maṃ, bhante, bhagavā jānātī’’ti. Dutiyampi kho bhagavā āyasmantaṃ dabbaṃ mallaputtaṃ etadavoca – ‘‘sarasi tvaṃ, dabba, evarūpaṃ kattā yathāyaṃ bhikkhunī āhā’’ti? ‘‘Yathā maṃ, bhante, bhagavā jānātī’’ti. Tatiyampi kho bhagavā āyasmantaṃ dabbaṃ mallaputtaṃ etadavoca – ‘‘sarasi tvaṃ, dabba, evarūpaṃ kattā yathāyaṃ bhikkhunī āhā’’ti? ‘‘Yathā maṃ, bhante, bhagavā jānātī’’ti. ‘‘Na kho, dabba, dabbā evaṃ nibbeṭhenti. Sace tayā kataṃ katanti vadehi. Sace akataṃ akatanti vadehī’’ti. ‘‘Yatohaṃ, bhante, jāto nābhijānāmi supinantenapi methunaṃ dhammaṃ paṭisevitā, pageva jāgaro’’ti. Atha kho bhagavā bhikkhū āmantesi – ‘‘tena hi, bhikkhave, mettiyaṃ bhikkhuniṃ nāsetha. Ime ca bhikkhū anuyuñjathā’’ti. Idaṃ vatvā bhagavā uṭṭhāyāsanā vihāraṃ pāvisi."
    ],
    "innerText": "193. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe bhikkhusaṅghaṃ sannipātāpetvā āyasmantaṃ dabbaṃ mallaputtaṃ paṭipucchi – ‘‘sarasi tvaṃ, dabba, evarūpaṃ kattā yathāyaṃ bhikkhunī āhā’’ti? ‘‘Yathā maṃ, bhante, bhagavā jānātī’’ti. Dutiyampi kho bhagavā āyasmantaṃ dabbaṃ mallaputtaṃ etadavoca – ‘‘sarasi tvaṃ, dabba, evarūpaṃ kattā yathāyaṃ bhikkhunī āhā’’ti? ‘‘Yathā maṃ, bhante, bhagavā jānātī’’ti. Tatiyampi kho bhagavā āyasmantaṃ dabbaṃ mallaputtaṃ etadavoca – ‘‘sarasi tvaṃ, dabba, evarūpaṃ kattā yathāyaṃ bhikkhunī āhā’’ti? ‘‘Yathā maṃ, bhante, bhagavā jānātī’’ti. ‘‘Na kho, dabba, dabbā evaṃ nibbeṭhenti. Sace tayā kataṃ katanti vadehi. Sace akataṃ akatanti vadehī’’ti. ‘‘Yatohaṃ, bhante, jāto nābhijānāmi supinantenapi methunaṃ dhammaṃ paṭisevitā, pageva jāgaro’’ti. Atha kho bhagavā bhikkhū āmantesi – ‘‘tena hi, bhikkhave, mettiyaṃ bhikkhuniṃ nāsetha. Ime ca bhikkhū anuyuñjathā’’ti. Idaṃ vatvā bhagavā uṭṭhāyāsanā vihāraṃ pāvisi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho te bhikkhū mettiyaṃ bhikkhuniṃ nāsesuṃ. Atha kho mettiyabhūmajakā bhikkhū te bhikkhū etadavocuṃ – ‘‘māvuso, mettiyaṃ bhikkhuniṃ nāsetha, na sā kiñci aparajjhati; amhehi sā ussāhitā kupitehi anattamanehi cāvanādhippāyehī’’ti. ‘‘Kiṃ pana tumhe, āvuso, āyasmantaṃ dabbaṃ ",
      " mallaputtaṃ amūlikāya sīlavipattiyā anuddhaṃsethā’’ti? ‘‘Evamāvuso’’ti. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma mettiyabhūmajakā bhikkhū āyasmantaṃ dabbaṃ mallaputtaṃ amūlikāya sīlavipattiyā anuddhaṃsessantī’’ti! Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ ",
      " …pe… ‘‘saccaṃ kira, bhikkhave, mettiyabhūmajakā bhikkhū dabbaṃ mallaputtaṃ amūlikāya sīlavipattiyā anuddhaṃsentī’’ti? ‘‘Saccaṃ bhagavā’’ti…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi –"
    ],
    "innerText": "Atha kho te bhikkhū mettiyaṃ bhikkhuniṃ nāsesuṃ. Atha kho mettiyabhūmajakā bhikkhū te bhikkhū etadavocuṃ – ‘‘māvuso, mettiyaṃ bhikkhuniṃ nāsetha, na sā kiñci aparajjhati; amhehi sā ussāhitā kupitehi anattamanehi cāvanādhippāyehī’’ti. ‘‘Kiṃ pana tumhe, āvuso, āyasmantaṃ dabbaṃ mallaputtaṃ amūlikāya sīlavipattiyā anuddhaṃsethā’’ti? ‘‘Evamāvuso’’ti. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma mettiyabhūmajakā bhikkhū āyasmantaṃ dabbaṃ mallaputtaṃ amūlikāya sīlavipattiyā anuddhaṃsessantī’’ti! Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ …pe… ‘‘saccaṃ kira, bhikkhave, mettiyabhūmajakā bhikkhū dabbaṃ mallaputtaṃ amūlikāya sīlavipattiyā anuddhaṃsentī’’ti? ‘‘Saccaṃ bhagavā’’ti…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tena hi, bhikkhave, saṅgho dabbassa mallaputtassa sativepullappattassa sativinayaṃ detu. Evañca ",
      " pana, bhikkhave, dātabbo – ‘‘tena, bhikkhave, dabbena mallaputtena saṅghaṃ upasaṅkamitvā, ekaṃsaṃ uttarāsaṅgaṃ karitvā, vuḍḍhānaṃ bhikkhūnaṃ pāde vanditvā, ukkuṭikaṃ nisīditvā, añjaliṃ paggahetvā, evamassa vacanīyo – ‘ime maṃ, bhante, mettiyabhūmajakā bhikkhū amūlikāya sīlavipattiyā anuddhaṃsenti. Sohaṃ, bhante, sativepullappatto saṅghaṃ sativinayaṃ yācāmī’ti. Dutiyampi yācitabbo. Tatiyampi yācitabbo – ‘ime maṃ, bhante mettiyabhūmajakā bhikkhū amūlikāya sīlavipattiyā anuddhaṃsenti. Sohaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sohaṃ bhante (ka.)]"
      },
      " sativepullappatto tatiyampi, bhante, saṅghaṃ sativinayaṃ yācāmī’ti. ‘‘Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
    ],
    "innerText": "‘‘Tena hi, bhikkhave, saṅgho dabbassa mallaputtassa sativepullappattassa sativinayaṃ detu. Evañca pana, bhikkhave, dātabbo – ‘‘tena, bhikkhave, dabbena mallaputtena saṅghaṃ upasaṅkamitvā, ekaṃsaṃ uttarāsaṅgaṃ karitvā, vuḍḍhānaṃ bhikkhūnaṃ pāde vanditvā, ukkuṭikaṃ nisīditvā, añjaliṃ paggahetvā, evamassa vacanīyo – ‘ime maṃ, bhante, mettiyabhūmajakā bhikkhū amūlikāya sīlavipattiyā anuddhaṃsenti. Sohaṃ, bhante, sativepullappatto saṅghaṃ sativinayaṃ yācāmī’ti. Dutiyampi yācitabbo. Tatiyampi yācitabbo – ‘ime maṃ, bhante mettiyabhūmajakā bhikkhū amūlikāya sīlavipattiyā anuddhaṃsenti. Sohaṃ [sohaṃ bhante (ka.)] sativepullappatto tatiyampi, bhante, saṅghaṃ sativinayaṃ yācāmī’ti. ‘‘Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "194"
      },
      ". Suṇātu ",
      " me, bhante, saṅgho. Ime mettiyabhūmajakā bhikkhū āyasmantaṃ dabbaṃ mallaputtaṃ amūlikāya sīlavipattiyā anuddhaṃsenti. Āyasmā dabbo mallaputto sativepullappatto saṅghaṃ sativinayaṃ yācati. Yadi saṅghassa pattakallaṃ, saṅgho āyasmato dabbassa mallaputtassa sativepullappattassa sativinayaṃ dadeyya. Esā ñatti."
    ],
    "innerText": "194. Suṇātu me, bhante, saṅgho. Ime mettiyabhūmajakā bhikkhū āyasmantaṃ dabbaṃ mallaputtaṃ amūlikāya sīlavipattiyā anuddhaṃsenti. Āyasmā dabbo mallaputto sativepullappatto saṅghaṃ sativinayaṃ yācati. Yadi saṅghassa pattakallaṃ, saṅgho āyasmato dabbassa mallaputtassa sativepullappattassa sativinayaṃ dadeyya. Esā ñatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Ime mettiyabhūmajakā bhikkhū āyasmantaṃ dabbaṃ mallaputtaṃ amūlikāya sīlavipattiyā anuddhaṃsenti. Āyasmā dabbo mallaputto sativepullappatto saṅghaṃ sativinayaṃ yācati. Saṅgho āyasmato dabbassa mallaputtassa sativepullappattassa sativinayaṃ deti. Yassāyasmato khamati āyasmato dabbassa mallaputtassa sativepullappattassa sativinayassa dānaṃ, so tuṇhassa; yassa nakkhamati, so bhāseyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Dutiyampi etamatthaṃ vadāmi…pe… tatiyampi etamatthaṃ vadāmi – suṇātu me, bhante, saṅgho. Ime mettiyabhūmajakā bhikkhū āyasmantaṃ dabbaṃ mallaputtaṃ amūlikāya sīlavipattiyā anuddhaṃsenti. Āyasmā dabbo mallaputto sativepullappatto saṅghaṃ sativinayaṃ yācati. Saṅgho āyasmato dabbassa mallaputtassa sativepullappattassa sativinayaṃ deti. Yassāyasmato khamati āyasmato ",
      " dabbassa mallaputtassa sativepullappattassa sativinayassa dānaṃ, so tuṇhassa; yassa nakkhamati, so bhāseyya."
    ],
    "innerText": "‘‘Dutiyampi etamatthaṃ vadāmi…pe… tatiyampi etamatthaṃ vadāmi – suṇātu me, bhante, saṅgho. Ime mettiyabhūmajakā bhikkhū āyasmantaṃ dabbaṃ mallaputtaṃ amūlikāya sīlavipattiyā anuddhaṃsenti. Āyasmā dabbo mallaputto sativepullappatto saṅghaṃ sativinayaṃ yācati. Saṅgho āyasmato dabbassa mallaputtassa sativepullappattassa sativinayaṃ deti. Yassāyasmato khamati āyasmato dabbassa mallaputtassa sativepullappattassa sativinayassa dānaṃ, so tuṇhassa; yassa nakkhamati, so bhāseyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Dinno saṅghena āyasmato dabbassa mallaputtassa sativepullappattassa ",
      " sativinayo. Khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti."
    ],
    "innerText": "‘‘Dinno saṅghena āyasmato dabbassa mallaputtassa sativepullappattassa sativinayo. Khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "195"
      },
      ". ‘‘Pañcimāni, bhikkhave, dhammikāni sativinayassa dānāni. Suddho hoti bhikkhu anāpattiko, anuvadanti ca naṃ, yācati ca, tassa saṅgho sativinayaṃ deti dhammena samaggena – imāni kho, bhikkhave, pañca dhammikāni sativinayassa dānānī’’ti."
    ],
    "innerText": "195. ‘‘Pañcimāni, bhikkhave, dhammikāni sativinayassa dānāni. Suddho hoti bhikkhu anāpattiko, anuvadanti ca naṃ, yācati ca, tassa saṅgho sativinayaṃ deti dhammena samaggena – imāni kho, bhikkhave, pañca dhammikāni sativinayassa dānānī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Amūḷhavinayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "196"
      },
      ". Tena ",
      " kho pana samayena gaggo bhikkhu ummattako hoti, cittavipariyāsakato. Tena ummattakena cittavipariyāsakatena bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ hoti bhāsitaparikkantaṃ. Bhikkhū gaggaṃ bhikkhuṃ ummattakena cittavipariyāsakatena ajjhāciṇṇena āpattiyā codenti – ‘‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’’ti? So evaṃ vadeti – ‘‘ahaṃ kho, āvuso ",
      ", ummattako ahosiṃ cittavipariyāsakato. Tena me ummattakena cittavipariyāsakatena bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Nāhaṃ taṃ sarāmi. Mūḷhena me etaṃ kata’’nti. Evampi naṃ vuccamānā codenteva – ‘‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’’ti? Ye te bhikkhū appicchā..pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma bhikkhū gaggaṃ bhikkhuṃ ummattakena cittavipariyāsakatena ajjhāciṇṇena āpattiyā codessanti – ‘‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’ti! So evaṃ vadeti ",
      " – ‘ahaṃ kho, āvuso, ummattako ahosiṃ cittavipariyāsakato. Tena me ummattakena cittavipariyāsakatena bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Nāhaṃ taṃ sarāmi. Mūḷhena me etaṃ kata’nti. Evampi naṃ vuccamānā codenteva – ‘‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’’ti? Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… ‘‘saccaṃ kira, bhikkhave…pe… saccaṃ bhagavā’’ti…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi –"
    ],
    "innerText": "196. Tena kho pana samayena gaggo bhikkhu ummattako hoti, cittavipariyāsakato. Tena ummattakena cittavipariyāsakatena bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ hoti bhāsitaparikkantaṃ. Bhikkhū gaggaṃ bhikkhuṃ ummattakena cittavipariyāsakatena ajjhāciṇṇena āpattiyā codenti – ‘‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’’ti? So evaṃ vadeti – ‘‘ahaṃ kho, āvuso , ummattako ahosiṃ cittavipariyāsakato. Tena me ummattakena cittavipariyāsakatena bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Nāhaṃ taṃ sarāmi. Mūḷhena me etaṃ kata’’nti. Evampi naṃ vuccamānā codenteva – ‘‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’’ti? Ye te bhikkhū appicchā..pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma bhikkhū gaggaṃ bhikkhuṃ ummattakena cittavipariyāsakatena ajjhāciṇṇena āpattiyā codessanti – ‘‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’ti! So evaṃ vadeti – ‘ahaṃ kho, āvuso, ummattako ahosiṃ cittavipariyāsakato. Tena me ummattakena cittavipariyāsakatena bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Nāhaṃ taṃ sarāmi. Mūḷhena me etaṃ kata’nti. Evampi naṃ vuccamānā codenteva – ‘‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’’ti? Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… ‘‘saccaṃ kira, bhikkhave…pe… saccaṃ bhagavā’’ti…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tena hi, bhikkhave, saṅgho gaggassa bhikkhuno amūḷhassa amūḷhavinayaṃ detu. Evañca ",
      " pana, bhikkhave, dātabbo – ‘‘tena, bhikkhave, gaggena bhikkhunā saṅghaṃ upasaṅkamitvā, ekaṃsaṃ uttarāsaṅgaṃ karitvā, vuḍḍhānaṃ bhikkhūnaṃ pāde vanditvā, ukkuṭikaṃ nisīditvā, añjaliṃ paggahetvā, evamassa vacanīyo – ‘ahaṃ, bhante, ummattako ahosiṃ cittavipariyāsakato. Tena me ummattakena cittavipariyāsakatena bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Maṃ bhikkhū ummattakena cittavipariyāsakatena ajjhāciṇṇena āpattiyā codenti – ‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’ti? Tyāhaṃ evaṃ vadāmi – ‘ahaṃ kho, āvuso, ummattako ahosiṃ cittavipariyāsakato. Tena me ummattakena cittavipariyāsakatena bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Nāhaṃ taṃ sarāmi. Mūḷhena me etaṃ kata’nti. Evampi maṃ vuccamānā codenteva ",
      " – ‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’ti? Sohaṃ ",
      ", bhante, amūḷho saṅghaṃ amūḷhavinayaṃ yācāmī’ti. Dutiyampi yācitabbo. Tatiyampi yācitabbo – ‘ahaṃ, bhante, ummattako ahosiṃ cittavipariyāsakato. Tena me ummattakena cittavipariyāsakatena bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Maṃ bhikkhū ummattakena cittavipariyāsakatena ajjhāciṇṇena āpattiyā codenti – ‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’ti? Tyāhaṃ evaṃ vadāmi – ‘ahaṃ kho, āvuso, ummattako ahosiṃ cittavipariyāsakato. Tena me ummattakena cittavipariyāsakatena bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Nāhaṃ taṃ sarāmi mūḷhena me etaṃ kata’nti. Evampi maṃ vuccamānā codenteva – ‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’ti? Sohaṃ amūḷho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sohaṃ bhante amūḷho (ka.)]"
      },
      " tatiyampi, bhante, saṅghaṃ amūḷhavinayaṃ yācāmī’ti. Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
    ],
    "innerText": "‘‘Tena hi, bhikkhave, saṅgho gaggassa bhikkhuno amūḷhassa amūḷhavinayaṃ detu. Evañca pana, bhikkhave, dātabbo – ‘‘tena, bhikkhave, gaggena bhikkhunā saṅghaṃ upasaṅkamitvā, ekaṃsaṃ uttarāsaṅgaṃ karitvā, vuḍḍhānaṃ bhikkhūnaṃ pāde vanditvā, ukkuṭikaṃ nisīditvā, añjaliṃ paggahetvā, evamassa vacanīyo – ‘ahaṃ, bhante, ummattako ahosiṃ cittavipariyāsakato. Tena me ummattakena cittavipariyāsakatena bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Maṃ bhikkhū ummattakena cittavipariyāsakatena ajjhāciṇṇena āpattiyā codenti – ‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’ti? Tyāhaṃ evaṃ vadāmi – ‘ahaṃ kho, āvuso, ummattako ahosiṃ cittavipariyāsakato. Tena me ummattakena cittavipariyāsakatena bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Nāhaṃ taṃ sarāmi. Mūḷhena me etaṃ kata’nti. Evampi maṃ vuccamānā codenteva – ‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’ti? Sohaṃ , bhante, amūḷho saṅghaṃ amūḷhavinayaṃ yācāmī’ti. Dutiyampi yācitabbo. Tatiyampi yācitabbo – ‘ahaṃ, bhante, ummattako ahosiṃ cittavipariyāsakato. Tena me ummattakena cittavipariyāsakatena bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Maṃ bhikkhū ummattakena cittavipariyāsakatena ajjhāciṇṇena āpattiyā codenti – ‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’ti? Tyāhaṃ evaṃ vadāmi – ‘ahaṃ kho, āvuso, ummattako ahosiṃ cittavipariyāsakato. Tena me ummattakena cittavipariyāsakatena bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Nāhaṃ taṃ sarāmi mūḷhena me etaṃ kata’nti. Evampi maṃ vuccamānā codenteva – ‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’ti? Sohaṃ amūḷho [sohaṃ bhante amūḷho (ka.)] tatiyampi, bhante, saṅghaṃ amūḷhavinayaṃ yācāmī’ti. Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "197"
      },
      ". ‘‘Suṇātu me, bhante, saṅgho. Ayaṃ gaggo bhikkhu ummattako ahosi cittavipariyāsakato. Tena ummattakena cittavipariyāsakatena bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Bhikkhū gaggaṃ bhikkhuṃ ummattakena cittavipariyāsakatena ajjhāciṇṇena āpattiyā codenti – ‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’ti? So evaṃ vadeti – ‘ahaṃ kho, āvuso, ummattako ahosiṃ cittavipariyāsakato. Tena me ummattakena cittavipariyāsakatena bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ ",
      " bhāsitaparikkantaṃ. Nāhaṃ taṃ sarāmi, mūḷhena ",
      " me etaṃ kata’nti. Evampi naṃ vuccamānā codenteva – ‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’ti? So amūḷho saṅghaṃ amūḷhavinayaṃ yācati. Yadi saṅghassa pattakallaṃ, saṅgho gaggassa bhikkhuno amūḷhassa amūḷhavinayaṃ dadeyya. Esā ñatti."
    ],
    "innerText": "197. ‘‘Suṇātu me, bhante, saṅgho. Ayaṃ gaggo bhikkhu ummattako ahosi cittavipariyāsakato. Tena ummattakena cittavipariyāsakatena bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Bhikkhū gaggaṃ bhikkhuṃ ummattakena cittavipariyāsakatena ajjhāciṇṇena āpattiyā codenti – ‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’ti? So evaṃ vadeti – ‘ahaṃ kho, āvuso, ummattako ahosiṃ cittavipariyāsakato. Tena me ummattakena cittavipariyāsakatena bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Nāhaṃ taṃ sarāmi, mūḷhena me etaṃ kata’nti. Evampi naṃ vuccamānā codenteva – ‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’ti? So amūḷho saṅghaṃ amūḷhavinayaṃ yācati. Yadi saṅghassa pattakallaṃ, saṅgho gaggassa bhikkhuno amūḷhassa amūḷhavinayaṃ dadeyya. Esā ñatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu ",
      " me, bhante, saṅgho. Ayaṃ gaggo bhikkhu ummattako ahosi cittavipariyāsakato. Tena ummattakena cittavipariyāsakatena bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Bhikkhū gaggaṃ bhikkhuṃ ummattakena cittavipariyāsakatena ajjhāciṇṇena āpattiyā codenti – ‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’ti? So evaṃ vadeti – ‘ahaṃ kho, āvuso, ummattako ahosiṃ cittavipariyāsakato. Tena me ummattakena cittavipariyāsakatena bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ ",
      " bhāsitaparikkantaṃ. Nāhaṃ taṃ sarāmi mūḷhena me etaṃ kata’nti. Evampi naṃ vuccamānā codenteva – ‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’ti? So amūḷho saṅghaṃ amūḷhavinayaṃ yācati. Saṅgho gaggassa bhikkhuno amūḷhassa amūḷhavinayaṃ deti. Yassāyasmato khamati gaggassa bhikkhuno amūḷhassa amūḷhavinayassa dānaṃ, so tuṇhassa; yassa nakkhamati, so bhāseyya."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Ayaṃ gaggo bhikkhu ummattako ahosi cittavipariyāsakato. Tena ummattakena cittavipariyāsakatena bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Bhikkhū gaggaṃ bhikkhuṃ ummattakena cittavipariyāsakatena ajjhāciṇṇena āpattiyā codenti – ‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’ti? So evaṃ vadeti – ‘ahaṃ kho, āvuso, ummattako ahosiṃ cittavipariyāsakato. Tena me ummattakena cittavipariyāsakatena bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Nāhaṃ taṃ sarāmi mūḷhena me etaṃ kata’nti. Evampi naṃ vuccamānā codenteva – ‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’ti? So amūḷho saṅghaṃ amūḷhavinayaṃ yācati. Saṅgho gaggassa bhikkhuno amūḷhassa amūḷhavinayaṃ deti. Yassāyasmato khamati gaggassa bhikkhuno amūḷhassa amūḷhavinayassa dānaṃ, so tuṇhassa; yassa nakkhamati, so bhāseyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Dutiyampi etamatthaṃ vadāmi…pe… tatiyampi etamatthaṃ vadāmi…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Dinno saṅghena gaggassa bhikkhuno amūḷhassa amūḷhavinayo. Khamati saṅghassa, tasmā tuṇhī ",
      ", evametaṃ dhārayāmī’’ti."
    ],
    "innerText": "‘‘Dinno saṅghena gaggassa bhikkhuno amūḷhassa amūḷhavinayo. Khamati saṅghassa, tasmā tuṇhī , evametaṃ dhārayāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "198"
      },
      ". ‘‘Tīṇimāni, bhikkhave, adhammikāni amūḷhavinayassa dānāni, tīṇi dhammikāni. Kammāni tīṇi adhammikāni amūḷhavinayassa dānāni?"
    ],
    "innerText": "198. ‘‘Tīṇimāni, bhikkhave, adhammikāni amūḷhavinayassa dānāni, tīṇi dhammikāni. Kammāni tīṇi adhammikāni amūḷhavinayassa dānāni?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Idha pana, bhikkhave, bhikkhu āpattiṃ āpanno hoti. Tamenaṃ codeti saṅgho vā, sambahulā vā, ekapuggalo vā – ‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’ti? So saramānova evaṃ vadeti – ‘na kho ahaṃ, āvuso, sarāmi evarūpiṃ āpattiṃ āpajjitā’ti. Tassa saṅgho amūḷhavinayaṃ deti. Adhammikaṃ amūḷhavinayassa dānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Idha pana, bhikkhave, bhikkhu āpattiṃ āpanno hoti. Tamenaṃ codeti saṅgho vā, sambahulā vā, ekapuggalo vā – ‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’ti? So saramānova evaṃ vadeti – ‘sarāmi kho ahaṃ, āvuso, yathāsupinantenā’ti. Tassa saṅgho amūḷhavinayaṃ deti. Adhammikaṃ amūḷhavinayassa dānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idha pana, bhikkhave, bhikkhu āpattiṃ āpanno hoti. Tamenaṃ codeti saṅgho vā, sambahulā ",
      " vā, ekapuggalo vā – ‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’ti? So anummattako ummattakālayaṃ karoti – ‘ahampi kho evaṃ karomi. Tumhepi evaṃ karotha. Mayhampi etaṃ kappati. Tumhākampetaṃ kappatī’ti. Tassa saṅgho amūḷhavinayaṃ deti. Adhammikaṃ amūḷhavinayassa dānaṃ. Imāni tīṇi adhammikāni amūḷhavinayassa dānāni."
    ],
    "innerText": "‘‘Idha pana, bhikkhave, bhikkhu āpattiṃ āpanno hoti. Tamenaṃ codeti saṅgho vā, sambahulā vā, ekapuggalo vā – ‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’ti? So anummattako ummattakālayaṃ karoti – ‘ahampi kho evaṃ karomi. Tumhepi evaṃ karotha. Mayhampi etaṃ kappati. Tumhākampetaṃ kappatī’ti. Tassa saṅgho amūḷhavinayaṃ deti. Adhammikaṃ amūḷhavinayassa dānaṃ. Imāni tīṇi adhammikāni amūḷhavinayassa dānāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "199"
      },
      ". ‘‘Katamāni ",
      " tīṇi dhammikāni amūḷhavinayassa dānāni?"
    ],
    "innerText": "199. ‘‘Katamāni tīṇi dhammikāni amūḷhavinayassa dānāni?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Idha pana, bhikkhave, bhikkhu ummattako hoti cittavipariyāsakato. Tena ummattakena cittavipariyāsakatena bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ hoti bhāsitaparikkantaṃ. Tamenaṃ codeti saṅgho vā, sambahulā vā, ekapuggalo vā – ‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’ti? So assaramānova evaṃ vadeti – ‘na kho ahaṃ, āvuso, sarāmi evarūpiṃ āpattiṃ āpajjitā’ti. Tassa saṅgho amūḷhavinayaṃ deti. Dhammikaṃ amūḷhavinayassa dānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idha pana, bhikkhave, bhikkhu ummattako hoti cittavipariyāsakato. Tena ummattakena cittavipariyāsakatena bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ hoti bhāsitaparikkantaṃ. Tamenaṃ codeti saṅgho vā, sambahulā vā, ekapuggalo vā – ‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’ti ",
      "? So assaramānova evaṃ vadeti – ‘sarāmi kho ahaṃ, āvuso, yathā supinantenā’ti. Tassa saṅgho amūḷhavinayaṃ deti. Dhammikaṃ amūḷhavinayassa dānaṃ."
    ],
    "innerText": "‘‘Idha pana, bhikkhave, bhikkhu ummattako hoti cittavipariyāsakato. Tena ummattakena cittavipariyāsakatena bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ hoti bhāsitaparikkantaṃ. Tamenaṃ codeti saṅgho vā, sambahulā vā, ekapuggalo vā – ‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’ti ? So assaramānova evaṃ vadeti – ‘sarāmi kho ahaṃ, āvuso, yathā supinantenā’ti. Tassa saṅgho amūḷhavinayaṃ deti. Dhammikaṃ amūḷhavinayassa dānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idha pana, bhikkhave, bhikkhu ummattako hoti cittavipariyāsakato. Tena ummattakena cittavipariyāsakatena bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ hoti bhāsitaparikkantaṃ. Tamenaṃ codeti saṅgho vā, sambahulā vā, ekapuggalo vā – ‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’ti? So ummattako ummattakālayaṃ karoti – ‘ahampi evaṃ ",
      " karomi. Tumhepi evaṃ karotha. Mayhampi etaṃ kappati. Tumhākampetaṃ kappatī’ti. Tassa saṅgho amūḷhavinayaṃ deti. Dhammikaṃ amūḷhavinayassa dānaṃ. ‘‘Imāni tīṇi dhammikāni amūḷhavinayassa dānānī’’ti."
    ],
    "innerText": "‘‘Idha pana, bhikkhave, bhikkhu ummattako hoti cittavipariyāsakato. Tena ummattakena cittavipariyāsakatena bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ hoti bhāsitaparikkantaṃ. Tamenaṃ codeti saṅgho vā, sambahulā vā, ekapuggalo vā – ‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’ti? So ummattako ummattakālayaṃ karoti – ‘ahampi evaṃ karomi. Tumhepi evaṃ karotha. Mayhampi etaṃ kappati. Tumhākampetaṃ kappatī’ti. Tassa saṅgho amūḷhavinayaṃ deti. Dhammikaṃ amūḷhavinayassa dānaṃ. ‘‘Imāni tīṇi dhammikāni amūḷhavinayassa dānānī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Paṭiññātakaraṇaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "200"
      },
      ". Tena kho pana samayena chabbaggiyā bhikkhū appaṭiññāya bhikkhūnaṃ kammāni karonti ",
      " – tajjanīyampi, niyassampi, pabbājanīyampi, paṭisāraṇīyampi, ukkhepanīyampi. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma chabbaggiyā bhikkhū appaṭiññāya bhikkhūnaṃ kammāni karissanti – tajjanīyampi, niyassampi, pabbājanīyampi, paṭisāraṇīyampi, ukkhepanīyampī’’ti! Atha kho ",
      " te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… ‘‘saccaṃ kira, bhikkhave…pe… ‘‘saccaṃ bhagavā’’ti…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘na, bhikkhave, appaṭiññāya bhikkhūnaṃ kammaṃ kātabbaṃ – tajjanīyaṃ vā, niyassaṃ vā, pabbājanīyaṃ vā, paṭisāraṇīyaṃ vā, ukkhepanīyaṃ vā. Yo kareyya, āpatti dukkaṭassa."
    ],
    "innerText": "200. Tena kho pana samayena chabbaggiyā bhikkhū appaṭiññāya bhikkhūnaṃ kammāni karonti – tajjanīyampi, niyassampi, pabbājanīyampi, paṭisāraṇīyampi, ukkhepanīyampi. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma chabbaggiyā bhikkhū appaṭiññāya bhikkhūnaṃ kammāni karissanti – tajjanīyampi, niyassampi, pabbājanīyampi, paṭisāraṇīyampi, ukkhepanīyampī’’ti! Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… ‘‘saccaṃ kira, bhikkhave…pe… ‘‘saccaṃ bhagavā’’ti…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘na, bhikkhave, appaṭiññāya bhikkhūnaṃ kammaṃ kātabbaṃ – tajjanīyaṃ vā, niyassaṃ vā, pabbājanīyaṃ vā, paṭisāraṇīyaṃ vā, ukkhepanīyaṃ vā. Yo kareyya, āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "201"
      },
      ". ‘‘Evaṃ kho, bhikkhave, adhammikaṃ hoti paṭiññātakaraṇaṃ, evaṃ dhammikaṃ. Kathañca, bhikkhave, adhammikaṃ hoti paṭiññātakaraṇaṃ?"
    ],
    "innerText": "201. ‘‘Evaṃ kho, bhikkhave, adhammikaṃ hoti paṭiññātakaraṇaṃ, evaṃ dhammikaṃ. Kathañca, bhikkhave, adhammikaṃ hoti paṭiññātakaraṇaṃ?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Bhikkhu pārājikaṃ ajjhāpanno hoti. Tamenaṃ codeti saṅgho vā, sambahulā vā, ekapuggalo vā – ‘pārājikaṃ āyasmā ajjhāpanno’ti? So evaṃ vadeti – ‘na kho ahaṃ, āvuso, pārājikaṃ ajjhāpanno ",
      ", saṅghādisesaṃ ajjhāpanno’ti. Taṃ saṅgho saṅghādisesena kāreti. Adhammikaṃ paṭiññātakaraṇaṃ."
    ],
    "innerText": "‘‘Bhikkhu pārājikaṃ ajjhāpanno hoti. Tamenaṃ codeti saṅgho vā, sambahulā vā, ekapuggalo vā – ‘pārājikaṃ āyasmā ajjhāpanno’ti? So evaṃ vadeti – ‘na kho ahaṃ, āvuso, pārājikaṃ ajjhāpanno , saṅghādisesaṃ ajjhāpanno’ti. Taṃ saṅgho saṅghādisesena kāreti. Adhammikaṃ paṭiññātakaraṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Bhikkhu pārājikaṃ ajjhāpanno hoti. Tamenaṃ codeti saṅgho vā, sambahulā vā, ekapuggalo vā – ‘pārājikaṃ āyasmā ajjhāpanno’ti? So evaṃ vadeti – ‘na kho ahaṃ, āvuso, pārājikaṃ ajjhāpanno, thullaccayaṃ…pe… pācittiyaṃ…pe… pāṭidesanīyaṃ…pe… dukkaṭaṃ…pe… ",
      " dubbhāsitaṃ ajjhāpanno’ti. Taṃ saṅgho dubbhāsitena kāreti. Adhammikaṃ paṭiññātakaraṇaṃ."
    ],
    "innerText": "‘‘Bhikkhu pārājikaṃ ajjhāpanno hoti. Tamenaṃ codeti saṅgho vā, sambahulā vā, ekapuggalo vā – ‘pārājikaṃ āyasmā ajjhāpanno’ti? So evaṃ vadeti – ‘na kho ahaṃ, āvuso, pārājikaṃ ajjhāpanno, thullaccayaṃ…pe… pācittiyaṃ…pe… pāṭidesanīyaṃ…pe… dukkaṭaṃ…pe… dubbhāsitaṃ ajjhāpanno’ti. Taṃ saṅgho dubbhāsitena kāreti. Adhammikaṃ paṭiññātakaraṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Bhikkhu saṅghādisesaṃ…pe… thullaccayaṃ…pe… pācittiyaṃ…pe… pāṭidesanīyaṃ…pe… dukkaṭaṃ…pe… dubbhāsitaṃ ajjhāpanno hoti. Tamenaṃ codeti saṅgho vā, sambahulā vā, ekapuggalo vā – ‘dubbhāsitaṃ āyasmā ajjhāpanno’ti ",
      "? So evaṃ vadeti – ‘na kho ahaṃ, āvuso, dubbhāsitaṃ ajjhāpanno, pārājikaṃ ajjhāpanno’ti. Taṃ saṅgho pārājikena kāreti. Adhammikaṃ paṭiññātakaraṇaṃ."
    ],
    "innerText": "‘‘Bhikkhu saṅghādisesaṃ…pe… thullaccayaṃ…pe… pācittiyaṃ…pe… pāṭidesanīyaṃ…pe… dukkaṭaṃ…pe… dubbhāsitaṃ ajjhāpanno hoti. Tamenaṃ codeti saṅgho vā, sambahulā vā, ekapuggalo vā – ‘dubbhāsitaṃ āyasmā ajjhāpanno’ti ? So evaṃ vadeti – ‘na kho ahaṃ, āvuso, dubbhāsitaṃ ajjhāpanno, pārājikaṃ ajjhāpanno’ti. Taṃ saṅgho pārājikena kāreti. Adhammikaṃ paṭiññātakaraṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Bhikkhu dubbhāsitaṃ ajjhāpanno hoti. Tamenaṃ codeti saṅgho vā, sambahulā vā, ekapuggalo ",
      " vā – ‘dubbhāsitaṃ āyasmā ajjhāpanno’ti? So evaṃ vadeti – ‘na kho ahaṃ, āvuso, dubbhāsitaṃ ajjhāpanno, saṅghādisesaṃ…pe… thullaccayaṃ…pe… pācittiyaṃ…pe… pāṭidesanīyaṃ…pe… dukkaṭaṃ ajjhāpanno’ti. Taṃ saṅgho dukkaṭena kāreti. Adhammikaṃ paṭiññātakaraṇaṃ. ‘‘Evaṃ kho, bhikkhave, adhammikaṃ hoti paṭiññātakaraṇaṃ."
    ],
    "innerText": "‘‘Bhikkhu dubbhāsitaṃ ajjhāpanno hoti. Tamenaṃ codeti saṅgho vā, sambahulā vā, ekapuggalo vā – ‘dubbhāsitaṃ āyasmā ajjhāpanno’ti? So evaṃ vadeti – ‘na kho ahaṃ, āvuso, dubbhāsitaṃ ajjhāpanno, saṅghādisesaṃ…pe… thullaccayaṃ…pe… pācittiyaṃ…pe… pāṭidesanīyaṃ…pe… dukkaṭaṃ ajjhāpanno’ti. Taṃ saṅgho dukkaṭena kāreti. Adhammikaṃ paṭiññātakaraṇaṃ. ‘‘Evaṃ kho, bhikkhave, adhammikaṃ hoti paṭiññātakaraṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca ",
      ", bhikkhave, dhammikaṃ hoti paṭiññātakaraṇaṃ? Bhikkhu pārājikaṃ ajjhāpanno hoti. Tamenaṃ codeti saṅgho vā, sambahulā vā, ekapuggalo vā – ‘pārājikaṃ āyasmā ajjhāpanno’ti? So ",
      " evaṃ vadeti – ‘āma, āvuso, pārājikaṃ ajjhāpanno’ti. Taṃ saṅgho pārājikena kāreti. Dhammikaṃ paṭiññātakaraṇaṃ."
    ],
    "innerText": "‘‘Kathañca , bhikkhave, dhammikaṃ hoti paṭiññātakaraṇaṃ? Bhikkhu pārājikaṃ ajjhāpanno hoti. Tamenaṃ codeti saṅgho vā, sambahulā vā, ekapuggalo vā – ‘pārājikaṃ āyasmā ajjhāpanno’ti? So evaṃ vadeti – ‘āma, āvuso, pārājikaṃ ajjhāpanno’ti. Taṃ saṅgho pārājikena kāreti. Dhammikaṃ paṭiññātakaraṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Bhikkhu saṅghādisesaṃ…pe… thullaccayaṃ…pe… pācittiyaṃ…pe… pāṭidesanīyaṃ…pe… dukkaṭaṃ…pe… dubbhāsitaṃ ajjhāpanno hoti. Tamenaṃ codeti saṅgho vā, sambahulā vā, ekapuggalo vā – ‘dubbhāsitaṃ āyasmā ajjhāpanno’ti? So evaṃ vadeti – ‘āma, āvuso, dubbhāsitaṃ ajjhāpanno’ti. Taṃ saṅgho dubbhāsitena kāreti. Dhammikaṃ paṭiññātakaraṇaṃ. Evaṃ kho, bhikkhave, dhammikaṃ hoti paṭiññātakaraṇa’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Yebhuyyasikā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "202"
      },
      ". Tena kho pana samayena bhikkhū saṅghamajjhe bhaṇḍanajātā kalahajātā vivādāpannā aññamaññaṃ mukhasattīhi vitudantā viharanti, na sakkonti taṃ adhikaraṇaṃ vūpasametuṃ. Bhagavato etamatthaṃ ārocesuṃ. ‘‘Anujānāmi, bhikkhave, evarūpaṃ adhikaraṇaṃ yebhuyyasikāya vūpasametuṃ. Pañcahaṅgehi samannāgato bhikkhu salākaggāhāpako sammannitabbo – yo na chandāgatiṃ gaccheyya, na dosāgatiṃ gaccheyya, na mohāgatiṃ gaccheyya, na bhayāgatiṃ gaccheyya, gahitāgahituñca jāneyya. Evañca pana, bhikkhave, sammannitabbo. Paṭhamaṃ bhikkhu yācitabbo, yācitvā byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
    ],
    "innerText": "202. Tena kho pana samayena bhikkhū saṅghamajjhe bhaṇḍanajātā kalahajātā vivādāpannā aññamaññaṃ mukhasattīhi vitudantā viharanti, na sakkonti taṃ adhikaraṇaṃ vūpasametuṃ. Bhagavato etamatthaṃ ārocesuṃ. ‘‘Anujānāmi, bhikkhave, evarūpaṃ adhikaraṇaṃ yebhuyyasikāya vūpasametuṃ. Pañcahaṅgehi samannāgato bhikkhu salākaggāhāpako sammannitabbo – yo na chandāgatiṃ gaccheyya, na dosāgatiṃ gaccheyya, na mohāgatiṃ gaccheyya, na bhayāgatiṃ gaccheyya, gahitāgahituñca jāneyya. Evañca pana, bhikkhave, sammannitabbo. Paṭhamaṃ bhikkhu yācitabbo, yācitvā byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "203"
      },
      ". ‘‘Suṇātu me, bhante, saṅgho. Yadi saṅghassa pattakallaṃ, saṅgho itthannāmaṃ bhikkhuṃ salākaggāhāpakaṃ sammanneyya. Esā ",
      " ñatti."
    ],
    "innerText": "203. ‘‘Suṇātu me, bhante, saṅgho. Yadi saṅghassa pattakallaṃ, saṅgho itthannāmaṃ bhikkhuṃ salākaggāhāpakaṃ sammanneyya. Esā ñatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu me, bhante, saṅgho. Saṅgho itthannāmaṃ bhikkhuṃ salākaggāhāpakaṃ sammannati. Yassāyasmato ",
      " khamati itthannāmassa bhikkhuno salākaggāhāpakassa sammuti, so tuṇhassa; yassa nakkhamati, so bhāseyya."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Saṅgho itthannāmaṃ bhikkhuṃ salākaggāhāpakaṃ sammannati. Yassāyasmato khamati itthannāmassa bhikkhuno salākaggāhāpakassa sammuti, so tuṇhassa; yassa nakkhamati, so bhāseyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sammato saṅghena itthannāmo bhikkhu salākaggāhāpako. Khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "204"
      },
      ". ‘‘Dasayime ",
      ", bhikkhave, adhammikā salākaggāhā, dasa dhammikā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[dasa dhammikā salākaggāhā (ka.)]"
      },
      ". Katame dasa adhammikā salākaggāhā? Oramattakañca adhikaraṇaṃ hoti, na ca gatigataṃ hoti, na ca saritasāritaṃ hoti, jānāti adhammavādī bahutarāti, appeva nāma adhammavādī bahutarā assūti, jānāti saṅgho bhijjissatīti, appeva nāma saṅgho bhijjeyyāti, adhammena gaṇhanti, vaggā gaṇhanti, na ca yathādiṭṭhiyā gaṇhanti – ime dasa adhammikā salākaggāhā."
    ],
    "innerText": "204. ‘‘Dasayime , bhikkhave, adhammikā salākaggāhā, dasa dhammikā [dasa dhammikā salākaggāhā (ka.)]. Katame dasa adhammikā salākaggāhā? Oramattakañca adhikaraṇaṃ hoti, na ca gatigataṃ hoti, na ca saritasāritaṃ hoti, jānāti adhammavādī bahutarāti, appeva nāma adhammavādī bahutarā assūti, jānāti saṅgho bhijjissatīti, appeva nāma saṅgho bhijjeyyāti, adhammena gaṇhanti, vaggā gaṇhanti, na ca yathādiṭṭhiyā gaṇhanti – ime dasa adhammikā salākaggāhā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katame dasa dhammikā salākaggāhā? Na ca oramattakaṃ adhikaraṇaṃ hoti, gatigatañca hoti, saritasāritañca hoti, jānāti dhammavādī bahutarāti, appeva nāma dhammavādī bahutarā assūti, jānāti saṅgho na bhijjissatīti, appeva nāma saṅgho na bhijjeyyāti, dhammena gaṇhanti, samaggā gaṇhanti, yathādiṭṭhiyā ca gaṇhanti – ime dasa dhammikā salākaggāhā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Tassapāpiyasikā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "205"
      },
      ". Tena kho pana samayena upavāḷo bhikkhu saṅghamajjhe āpattiyā ",
      " anuyuñjiyamāno avajānitvā paṭijānāti, paṭijānitvā avajānāti, aññenaññaṃ paṭicarati, sampajānamusā bhāsati. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma upavāḷo bhikkhu saṅghamajjhe āpattiyā anuyuñjiyamāno avajānitvā paṭijānissati, paṭijānitvā avajānissati, aññenaññaṃ paṭicarissati, sampajānamusā bhāsissatī’’ti! Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… ‘‘saccaṃ kira, bhikkhave…pe… ‘‘saccaṃ bhagavā’’ti…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi – tena hi, bhikkhave, saṅgho upavāḷassa bhikkhuno tassapāpiyasikākammaṃ karotu. Evañca pana, bhikkhave, kātabbaṃ. Paṭhamaṃ ",
      " upavāḷo bhikkhu codetabbo, codetvā sāretabbo, sāretvā āpattiṃ āropetabbo, āpattiṃ āropetvā byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
    ],
    "innerText": "205. Tena kho pana samayena upavāḷo bhikkhu saṅghamajjhe āpattiyā anuyuñjiyamāno avajānitvā paṭijānāti, paṭijānitvā avajānāti, aññenaññaṃ paṭicarati, sampajānamusā bhāsati. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma upavāḷo bhikkhu saṅghamajjhe āpattiyā anuyuñjiyamāno avajānitvā paṭijānissati, paṭijānitvā avajānissati, aññenaññaṃ paṭicarissati, sampajānamusā bhāsissatī’’ti! Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… ‘‘saccaṃ kira, bhikkhave…pe… ‘‘saccaṃ bhagavā’’ti…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi – tena hi, bhikkhave, saṅgho upavāḷassa bhikkhuno tassapāpiyasikākammaṃ karotu. Evañca pana, bhikkhave, kātabbaṃ. Paṭhamaṃ upavāḷo bhikkhu codetabbo, codetvā sāretabbo, sāretvā āpattiṃ āropetabbo, āpattiṃ āropetvā byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "206"
      },
      ". ‘‘Suṇātu me, bhante, saṅgho. Ayaṃ upavāḷo bhikkhu saṅghamajjhe āpattiyā anuyuñjiyamāno avajānitvā paṭijānāti, paṭijānitvā avajānāti, aññenaññaṃ paṭicarati, sampajānamusā ‘bhāsati. Yadi ",
      " saṅghassa pattakallaṃ, saṅgho upavāḷassa bhikkhuno tassapāpiyasikākammaṃ kareyya. Esā ñatti."
    ],
    "innerText": "206. ‘‘Suṇātu me, bhante, saṅgho. Ayaṃ upavāḷo bhikkhu saṅghamajjhe āpattiyā anuyuñjiyamāno avajānitvā paṭijānāti, paṭijānitvā avajānāti, aññenaññaṃ paṭicarati, sampajānamusā ‘bhāsati. Yadi saṅghassa pattakallaṃ, saṅgho upavāḷassa bhikkhuno tassapāpiyasikākammaṃ kareyya. Esā ñatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu me, bhante, saṅgho. Ayaṃ upavāḷo bhikkhu saṅghamajjhe āpattiyā anuyuñjiyamāno avajānitvā paṭijānāti, paṭijānitvā ",
      " avajānāti, aññenaññaṃ paṭicarati, sampajānamusā bhāsati. Saṅgho upavāḷassa bhikkhuno tassapāpiyasikākammaṃ karoti. Yassāyasmato khamati upavāḷassa bhikkhuno tassapāpiyasikākammassa karaṇaṃ, so tuṇhassa; yassa nakkhamati, so bhāseyya."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Ayaṃ upavāḷo bhikkhu saṅghamajjhe āpattiyā anuyuñjiyamāno avajānitvā paṭijānāti, paṭijānitvā avajānāti, aññenaññaṃ paṭicarati, sampajānamusā bhāsati. Saṅgho upavāḷassa bhikkhuno tassapāpiyasikākammaṃ karoti. Yassāyasmato khamati upavāḷassa bhikkhuno tassapāpiyasikākammassa karaṇaṃ, so tuṇhassa; yassa nakkhamati, so bhāseyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Dutiyampi etamatthaṃ vadāmi…pe… tatiyampi etamatthaṃ vadāmi…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kataṃ saṅghena upavāḷassa bhikkhuno tassapāpiyasikākammaṃ. Khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "207"
      },
      ". ‘‘Pañcimāni ",
      ", bhikkhave, dhammikāni tassapāpiyasikākammassa karaṇāni. Asuci ca hoti, alajjī ca, sānuvādo ca, tassa saṅgho tassapāpiyasikākammaṃ karoti dhammena, samaggena – imāni kho, bhikkhave, pañca dhammikāni tassapāpiyasikākammassa karaṇāni."
    ],
    "innerText": "207. ‘‘Pañcimāni , bhikkhave, dhammikāni tassapāpiyasikākammassa karaṇāni. Asuci ca hoti, alajjī ca, sānuvādo ca, tassa saṅgho tassapāpiyasikākammaṃ karoti dhammena, samaggena – imāni kho, bhikkhave, pañca dhammikāni tassapāpiyasikākammassa karaṇāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Adhammakammadvādasakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "208"
      },
      ". ‘‘Tīhi, bhikkhave, aṅgehi samannāgataṃ tassapāpiyasikākammaṃ adhammakammañca hoti, avinayakammañca, duvūpasantañca. Asammukhā kataṃ hoti, appaṭipucchākataṃ hoti, appaṭiññāya kataṃ hoti…pe… adhammena kataṃ hoti, vaggena kataṃ hoti – imehi kho, bhikkhave, tīhaṅgehi samannāgataṃ tassapāpiyasikākammaṃ adhammakammañca hoti, avinayakammañca, duvūpasantañca."
    ],
    "innerText": "208. ‘‘Tīhi, bhikkhave, aṅgehi samannāgataṃ tassapāpiyasikākammaṃ adhammakammañca hoti, avinayakammañca, duvūpasantañca. Asammukhā kataṃ hoti, appaṭipucchākataṃ hoti, appaṭiññāya kataṃ hoti…pe… adhammena kataṃ hoti, vaggena kataṃ hoti – imehi kho, bhikkhave, tīhaṅgehi samannāgataṃ tassapāpiyasikākammaṃ adhammakammañca hoti, avinayakammañca, duvūpasantañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Dhammakammadvādasakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "209"
      },
      ". ‘‘Tīhi ",
      ", bhikkhave, aṅgehi samannāgataṃ tassapāpiyasikākammaṃ dhammakammañca hoti, vinayakammañca, suvūpasantañca. Sammukhā kataṃ hoti, paṭipucchākataṃ hoti, paṭiññāya kataṃ hoti…pe… ",
      " dhammena kataṃ hoti, samaggena kataṃ hoti – imehi kho, bhikkhave, tīhaṅgehi samannāgataṃ tassapāpiyasikākammaṃ dhammakammañca hoti, vinayakammañca, suvūpasantañca."
    ],
    "innerText": "209. ‘‘Tīhi , bhikkhave, aṅgehi samannāgataṃ tassapāpiyasikākammaṃ dhammakammañca hoti, vinayakammañca, suvūpasantañca. Sammukhā kataṃ hoti, paṭipucchākataṃ hoti, paṭiññāya kataṃ hoti…pe… dhammena kataṃ hoti, samaggena kataṃ hoti – imehi kho, bhikkhave, tīhaṅgehi samannāgataṃ tassapāpiyasikākammaṃ dhammakammañca hoti, vinayakammañca, suvūpasantañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Ākaṅkhamānachakkaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "210"
      },
      ". ‘‘Tīhi ",
      ", bhikkhave, aṅgehi samannāgatassa bhikkhuno ākaṅkhamāno saṅgho tassapāpiyasikākammaṃ kareyya. Bhaṇḍanakārako hoti kalahakārako vivādakārako bhassakārako saṅghe adhikaraṇakārako; bālo hoti abyatto āpattibahulo anapadāno; gihisaṃsaṭṭho viharati ananulomikehi gihisaṃsaggehi – imehi kho, bhikkhave, tīhaṅgehi samannāgatassa bhikkhuno ākaṅkhamāno saṅgho tassapāpiyasikākammaṃ kareyya."
    ],
    "innerText": "210. ‘‘Tīhi , bhikkhave, aṅgehi samannāgatassa bhikkhuno ākaṅkhamāno saṅgho tassapāpiyasikākammaṃ kareyya. Bhaṇḍanakārako hoti kalahakārako vivādakārako bhassakārako saṅghe adhikaraṇakārako; bālo hoti abyatto āpattibahulo anapadāno; gihisaṃsaṭṭho viharati ananulomikehi gihisaṃsaggehi – imehi kho, bhikkhave, tīhaṅgehi samannāgatassa bhikkhuno ākaṅkhamāno saṅgho tassapāpiyasikākammaṃ kareyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi, bhikkhave, tīhaṅgehi samannāgatassa bhikkhuno ākaṅkhamāno ",
      " saṅgho tassapāpiyasikākammaṃ kareyya. Adhisīle sīlavipanno hoti, ajjhācāre ācāravipanno hoti, atidiṭṭhiyā diṭṭhivipanno hoti – imehi kho, bhikkhave…pe…."
    ],
    "innerText": "‘‘Aparehipi, bhikkhave, tīhaṅgehi samannāgatassa bhikkhuno ākaṅkhamāno saṅgho tassapāpiyasikākammaṃ kareyya. Adhisīle sīlavipanno hoti, ajjhācāre ācāravipanno hoti, atidiṭṭhiyā diṭṭhivipanno hoti – imehi kho, bhikkhave…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Aparehipi, bhikkhave…pe… buddhassa avaṇṇaṃ bhāsati, dhammassa avaṇṇaṃ bhāsati, saṅghassa avaṇṇaṃ bhāsati – imehi kho, bhikkhave, tīhaṅgehi samannāgatassa bhikkhuno ākaṅkhamāno saṅgho tassapāpiyasikākammaṃ kareyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tiṇṇaṃ, bhikkhave, bhikkhūnaṃ ākaṅkhamāno saṅgho tassapāpiyasikākammaṃ kareyya. Eko bhaṇḍanakārako hoti…pe… saṅghe adhikaraṇakārako; eko bālo hoti abyatto āpattibahulo anapadāno; eko gihisaṃsaṭṭho viharati ananulomikehi gihisaṃsaggehi – imesaṃ kho, bhikkhave, tiṇṇaṃ bhikkhūnaṃ ākaṅkhamāno saṅgho tassapāpiyasikākammaṃ kareyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Aparesampi, bhikkhave, tiṇṇaṃ bhikkhūnaṃ ākaṅkhamāno saṅgho tassapāpiyasikākammaṃ kareyya. Eko adhisīle sīlavipanno hoti, eko ajjhācāre ācāravipanno hoti, eko atidiṭṭhiyā diṭṭhivipanno hoti – imesaṃ kho, bhikkhave…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparesampi ",
      ", bhikkhave…pe… eko buddhassa avaṇṇaṃ bhāsati, eko dhammassa avaṇṇaṃ bhāsati, eko saṅghassa avaṇṇaṃ bhāsati – imesaṃ kho, bhikkhave, tiṇṇaṃ bhikkhūnaṃ ākaṅkhamāno saṅgho tassapāpiyasikākammaṃ ",
      " kareyya."
    ],
    "innerText": "‘‘Aparesampi , bhikkhave…pe… eko buddhassa avaṇṇaṃ bhāsati, eko dhammassa avaṇṇaṃ bhāsati, eko saṅghassa avaṇṇaṃ bhāsati – imesaṃ kho, bhikkhave, tiṇṇaṃ bhikkhūnaṃ ākaṅkhamāno saṅgho tassapāpiyasikākammaṃ kareyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Aṭṭhārasavattaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "211"
      },
      ". ‘‘Tassapāpiyasikākammakatena ",
      ", bhikkhave, bhikkhunā sammā vattitabbaṃ. Tatrāyaṃ sammāvattanā –"
    ],
    "innerText": "211. ‘‘Tassapāpiyasikākammakatena , bhikkhave, bhikkhunā sammā vattitabbaṃ. Tatrāyaṃ sammāvattanā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Na upasampādetabbaṃ, na nissayo dātabbo, na sāmaṇero upaṭṭhāpetabbo, na bhikkhunovādakasammuti sāditabbā, sammatenapi bhikkhuniyo na ovaditabbā…pe… na bhikkhūhi sampayojetabba’’nti. Atha kho saṅgho upavāḷassa bhikkhuno tassapāpiyasikākammaṃ akāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Tiṇavatthārakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "212"
      },
      ". Tena kho pana samayena bhikkhūnaṃ bhaṇḍanajātānaṃ kalahajātānaṃ vivādāpannānaṃ viharataṃ bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ hoti bhāsitaparikkantaṃ. Atha kho tesaṃ bhikkhūnaṃ etadahosi – ‘‘amhākaṃ kho bhaṇḍanajātānaṃ kalahajātānaṃ vivādāpannānaṃ viharataṃ bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Sace mayaṃ imāhi āpattīhi aññamaññaṃ kāressāma, siyāpi taṃ adhikaraṇaṃ kakkhaḷattāya vāḷattāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kakkhaḷatāya vāḷatāya (syā. kaṃ.)]"
      },
      " bhedāya saṃvatteyya. Kathaṃ nu kho ",
      " amhehi paṭipajjitabba’’nti? Bhagavato etamatthaṃ ārocesuṃ."
    ],
    "innerText": "212. Tena kho pana samayena bhikkhūnaṃ bhaṇḍanajātānaṃ kalahajātānaṃ vivādāpannānaṃ viharataṃ bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ hoti bhāsitaparikkantaṃ. Atha kho tesaṃ bhikkhūnaṃ etadahosi – ‘‘amhākaṃ kho bhaṇḍanajātānaṃ kalahajātānaṃ vivādāpannānaṃ viharataṃ bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Sace mayaṃ imāhi āpattīhi aññamaññaṃ kāressāma, siyāpi taṃ adhikaraṇaṃ kakkhaḷattāya vāḷattāya [kakkhaḷatāya vāḷatāya (syā. kaṃ.)] bhedāya saṃvatteyya. Kathaṃ nu kho amhehi paṭipajjitabba’’nti? Bhagavato etamatthaṃ ārocesuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idha pana, bhikkhave, bhikkhūnaṃ bhaṇḍanajātānaṃ kalahajātānaṃ vivādāpannānaṃ viharataṃ bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ hoti bhāsitaparikkantaṃ ",
      ". Tatra ce bhikkhūnaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[tatra ce bhikkhave bhikkhūnaṃ (syā.)]"
      },
      " evaṃ hoti – ‘amhākaṃ kho bhaṇḍanajātānaṃ kalahajātānaṃ vivādāpannānaṃ viharataṃ bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ; sace mayaṃ imāhi āpattīhi aññamaññaṃ kāressāma, siyāpi taṃ adhikaraṇaṃ kakkhaḷattāya vāḷattāya bhedāya saṃvatteyyā’ti, anujānāmi, bhikkhave, evarūpaṃ adhikaraṇaṃ tiṇavatthārakena vūpasametuṃ. Evañca pana, bhikkhave, vūpasametabbaṃ. Sabbeheva ekajjhaṃ sannipatitabbaṃ, sannipatitvā byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
    ],
    "innerText": "‘‘Idha pana, bhikkhave, bhikkhūnaṃ bhaṇḍanajātānaṃ kalahajātānaṃ vivādāpannānaṃ viharataṃ bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ hoti bhāsitaparikkantaṃ . Tatra ce bhikkhūnaṃ [tatra ce bhikkhave bhikkhūnaṃ (syā.)] evaṃ hoti – ‘amhākaṃ kho bhaṇḍanajātānaṃ kalahajātānaṃ vivādāpannānaṃ viharataṃ bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ; sace mayaṃ imāhi āpattīhi aññamaññaṃ kāressāma, siyāpi taṃ adhikaraṇaṃ kakkhaḷattāya vāḷattāya bhedāya saṃvatteyyā’ti, anujānāmi, bhikkhave, evarūpaṃ adhikaraṇaṃ tiṇavatthārakena vūpasametuṃ. Evañca pana, bhikkhave, vūpasametabbaṃ. Sabbeheva ekajjhaṃ sannipatitabbaṃ, sannipatitvā byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu ",
      " me, bhante, saṅgho. Amhākaṃ bhaṇḍanajātānaṃ kalahajātānaṃ vivādāpannānaṃ viharataṃ bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Sace mayaṃ imāhi āpattīhi aññamaññaṃ kāressāma, siyāpi taṃ ",
      " adhikaraṇaṃ kakkhaḷattāya vāḷattāya bhedāya saṃvatteyya. Yadi saṅghassa pattakallaṃ, saṅgho imaṃ adhikaraṇaṃ tiṇavatthārakena vūpasameyya, ṭhapetvā thullavajjaṃ, ṭhapetvā gihippaṭisaṃyutta’’nti. ‘‘Ekatopakkhikānaṃ bhikkhūnaṃ byattena bhikkhunā paṭibalena sako pakkho ñāpetabbo –"
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Amhākaṃ bhaṇḍanajātānaṃ kalahajātānaṃ vivādāpannānaṃ viharataṃ bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Sace mayaṃ imāhi āpattīhi aññamaññaṃ kāressāma, siyāpi taṃ adhikaraṇaṃ kakkhaḷattāya vāḷattāya bhedāya saṃvatteyya. Yadi saṅghassa pattakallaṃ, saṅgho imaṃ adhikaraṇaṃ tiṇavatthārakena vūpasameyya, ṭhapetvā thullavajjaṃ, ṭhapetvā gihippaṭisaṃyutta’’nti. ‘‘Ekatopakkhikānaṃ bhikkhūnaṃ byattena bhikkhunā paṭibalena sako pakkho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇantu me āyasmantā. Amhākaṃ bhaṇḍanajātānaṃ kalahajātānaṃ vivādāpannānaṃ viharataṃ bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Sace mayaṃ imāhi āpattīhi aññamaññaṃ kāressāma, siyāpi taṃ adhikaraṇaṃ kakkhaḷattāya ",
      " vāḷattāya bhedāya saṃvatteyya. Yadāyasmantānaṃ pattakallaṃ, ahaṃ yā ceva āyasmantānaṃ āpatti, yā ca attano āpatti, āyasmantānañceva atthāya, attano ca atthāya, saṅghamajjhe tiṇavatthārakena deseyyaṃ, ṭhapetvā thullavajjaṃ, ṭhapetvā gihippaṭisaṃyutta’’nti."
    ],
    "innerText": "‘‘Suṇantu me āyasmantā. Amhākaṃ bhaṇḍanajātānaṃ kalahajātānaṃ vivādāpannānaṃ viharataṃ bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Sace mayaṃ imāhi āpattīhi aññamaññaṃ kāressāma, siyāpi taṃ adhikaraṇaṃ kakkhaḷattāya vāḷattāya bhedāya saṃvatteyya. Yadāyasmantānaṃ pattakallaṃ, ahaṃ yā ceva āyasmantānaṃ āpatti, yā ca attano āpatti, āyasmantānañceva atthāya, attano ca atthāya, saṅghamajjhe tiṇavatthārakena deseyyaṃ, ṭhapetvā thullavajjaṃ, ṭhapetvā gihippaṭisaṃyutta’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Athāparesaṃ ekatopakkhikānaṃ bhikkhūnaṃ byattena bhikkhunā paṭibalena sako pakkho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Suṇantu me āyasmantā. Amhākaṃ bhaṇḍanajātānaṃ kalahajātānaṃ vivādāpannānaṃ viharataṃ bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Sace mayaṃ imāhi āpattīhi aññamaññaṃ kāressāma, siyāpi taṃ adhikaraṇaṃ kakkhaḷattāya vāḷattāya bhedāya saṃvatteyya. Yadāyasmantānaṃ pattakallaṃ, ahaṃ yā ceva āyasmantānaṃ āpatti, yā ca attano āpatti, āyasmantānañceva atthāya, attano ca atthāya, saṅghamajjhe tiṇavatthārakena deseyyaṃ, ṭhapetvā thullavajjaṃ, ṭhapetvā gihippaṭisaṃyutta’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "213"
      },
      ". ‘‘Athāparesaṃ ekatopakkhikānaṃ bhikkhūnaṃ byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
    ],
    "innerText": "213. ‘‘Athāparesaṃ ekatopakkhikānaṃ bhikkhūnaṃ byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu me, bhante, saṅgho. Amhākaṃ bhaṇḍanajātānaṃ kalahajātānaṃ vivādāpannānaṃ viharataṃ bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Sace mayaṃ imāhi āpattīhi aññamaññaṃ kāressāma, siyāpi taṃ adhikaraṇaṃ kakkhaḷattāya vāḷattāya bhedāya saṃvatteyya. Yadi ",
      " saṅghassa pattakallaṃ, ahaṃ yā ceva ",
      " imesaṃ āyasmantānaṃ āpatti, yā ca attano āpatti, imesañceva āyasmantānaṃ atthāya, attano ca ",
      " atthāya, saṅghamajjhe tiṇavatthārakena deseyyaṃ, ṭhapetvā thullavajjaṃ, ṭhapetvā gihippaṭisaṃyuttaṃ. Esā ñatti."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Amhākaṃ bhaṇḍanajātānaṃ kalahajātānaṃ vivādāpannānaṃ viharataṃ bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Sace mayaṃ imāhi āpattīhi aññamaññaṃ kāressāma, siyāpi taṃ adhikaraṇaṃ kakkhaḷattāya vāḷattāya bhedāya saṃvatteyya. Yadi saṅghassa pattakallaṃ, ahaṃ yā ceva imesaṃ āyasmantānaṃ āpatti, yā ca attano āpatti, imesañceva āyasmantānaṃ atthāya, attano ca atthāya, saṅghamajjhe tiṇavatthārakena deseyyaṃ, ṭhapetvā thullavajjaṃ, ṭhapetvā gihippaṭisaṃyuttaṃ. Esā ñatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Amhākaṃ bhaṇḍanajātānaṃ kalahajātānaṃ vivādāpannānaṃ viharataṃ bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Sace mayaṃ imāhi āpattīhi aññamaññaṃ kāressāma, siyāpi taṃ adhikaraṇaṃ kakkhaḷattāya vāḷattāya bhedāya saṃvatteyya. Ahaṃ yā ceva imesaṃ āyasmantānaṃ āpatti, yā ca attano āpatti, imesañceva āyasmantānaṃ atthāya, attano ca atthāya, saṅghamajjhe tiṇavatthārakena desemi, ṭhapetvā thullavajjaṃ, ṭhapetvā gihippaṭisaṃyuttaṃ. Yassāyasmato khamati amhākaṃ imāsaṃ āpattīnaṃ saṅghamajjhe tiṇavatthārakena desanā, ṭhapetvā thullavajjaṃ, ṭhapetvā gihippaṭisaṃyuttaṃ, so tuṇhassa; yassa nakkhamati, so bhāseyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Desitā amhākaṃ imā āpattiyo saṅghamajjhe tiṇavatthārakena, ṭhapetvā thullavajjaṃ, ṭhapetvā ",
      " gihippaṭisaṃyuttaṃ. Khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti."
    ],
    "innerText": "‘‘Desitā amhākaṃ imā āpattiyo saṅghamajjhe tiṇavatthārakena, ṭhapetvā thullavajjaṃ, ṭhapetvā gihippaṭisaṃyuttaṃ. Khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "214"
      },
      ". ‘‘Athāparesaṃ ekatopakkhikānaṃ bhikkhūnaṃ byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
    ],
    "innerText": "214. ‘‘Athāparesaṃ ekatopakkhikānaṃ bhikkhūnaṃ byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu me, bhante, saṅgho. Amhākaṃ bhaṇḍanajātānaṃ kalahajātānaṃ vivādāpannānaṃ viharataṃ bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Sace mayaṃ imāhi āpattīhi aññamaññaṃ ",
      " kāressāma, siyāpi taṃ adhikaraṇaṃ kakkhaḷattāya vāḷattāya bhedāya saṃvatteyya. Yadi saṅghassa pattakallaṃ, ahaṃ yā ceva imesaṃ āyasmantānaṃ āpatti, yā ca attano āpatti, imesañceva āyasmantānaṃ atthāya, attano ca atthāya, saṅghamajjhe tiṇavatthārakena deseyyaṃ, ṭhapetvā thullavajjaṃ, ṭhapetvā gihippaṭisaṃyuttaṃ. Esā ñatti."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Amhākaṃ bhaṇḍanajātānaṃ kalahajātānaṃ vivādāpannānaṃ viharataṃ bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Sace mayaṃ imāhi āpattīhi aññamaññaṃ kāressāma, siyāpi taṃ adhikaraṇaṃ kakkhaḷattāya vāḷattāya bhedāya saṃvatteyya. Yadi saṅghassa pattakallaṃ, ahaṃ yā ceva imesaṃ āyasmantānaṃ āpatti, yā ca attano āpatti, imesañceva āyasmantānaṃ atthāya, attano ca atthāya, saṅghamajjhe tiṇavatthārakena deseyyaṃ, ṭhapetvā thullavajjaṃ, ṭhapetvā gihippaṭisaṃyuttaṃ. Esā ñatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu me, bhante, saṅgho. Amhākaṃ bhaṇḍanajātānaṃ kalahajātānaṃ vivādāpannānaṃ viharataṃ bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Sace mayaṃ imāhi āpattīhi aññamaññaṃ kāressāma, siyāpi taṃ adhikaraṇaṃ kakkhaḷattāya vāḷattāya bhedāya saṃvatteyya. Ahaṃ yā ceva imesaṃ āyasmantānaṃ āpatti, yā ca attano āpatti, imesañceva āyasmantānaṃ ",
      " atthāya, attano ca atthāya, saṅghamajjhe tiṇavatthārakena desemi, ṭhapetvā thullavajjaṃ, ṭhapetvā gihippaṭisaṃyuttaṃ. Yassāyasmato khamati amhākaṃ imāsaṃ āpattīnaṃ saṅghamajjhe tiṇavatthārakena desanā, ṭhapetvā thullavajjaṃ, ṭhapetvā gihippaṭisaṃyuttaṃ, so tuṇhassa; yassa nakkhamati, so bhāseyya."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Amhākaṃ bhaṇḍanajātānaṃ kalahajātānaṃ vivādāpannānaṃ viharataṃ bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Sace mayaṃ imāhi āpattīhi aññamaññaṃ kāressāma, siyāpi taṃ adhikaraṇaṃ kakkhaḷattāya vāḷattāya bhedāya saṃvatteyya. Ahaṃ yā ceva imesaṃ āyasmantānaṃ āpatti, yā ca attano āpatti, imesañceva āyasmantānaṃ atthāya, attano ca atthāya, saṅghamajjhe tiṇavatthārakena desemi, ṭhapetvā thullavajjaṃ, ṭhapetvā gihippaṭisaṃyuttaṃ. Yassāyasmato khamati amhākaṃ imāsaṃ āpattīnaṃ saṅghamajjhe tiṇavatthārakena desanā, ṭhapetvā thullavajjaṃ, ṭhapetvā gihippaṭisaṃyuttaṃ, so tuṇhassa; yassa nakkhamati, so bhāseyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Desitā amhākaṃ imā āpattiyo saṅghamajjhe tiṇavatthārakena, ṭhapetvā thullavajjaṃ, ṭhapetvā gihippaṭisaṃyuttaṃ. Khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evañca pana, bhikkhave, te bhikkhū tāhi āpattīhi vuṭṭhitā honti, ṭhapetvā thullavajjaṃ, ṭhapetvā gihippaṭisaṃyuttaṃ, ṭhapetvā diṭṭhāvikammaṃ ",
      ", ṭhapetvā ye na tattha hontī’’ti."
    ],
    "innerText": "‘‘Evañca pana, bhikkhave, te bhikkhū tāhi āpattīhi vuṭṭhitā honti, ṭhapetvā thullavajjaṃ, ṭhapetvā gihippaṭisaṃyuttaṃ, ṭhapetvā diṭṭhāvikammaṃ , ṭhapetvā ye na tattha hontī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Adhikaraṇaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "215"
      },
      ". Tena kho pana samayena (bhikkhūpi bhikkhūhi vivadanti,) ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[( ) natthi (sī. syā. kaṃ.)]"
      },
      " bhikkhūpi bhikkhunīhi vivadanti, bhikkhuniyopi bhikkhūhi vivadanti, channopi bhikkhu bhikkhunīnaṃ anupakhajja bhikkhūhi saddhiṃ vivadati, bhikkhunīnaṃ pakkhaṃ gāheti. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma channo bhikkhu bhikkhunīnaṃ anupakhajja bhikkhūhi saddhiṃ vivadissati, bhikkhunīnaṃ pakkhaṃ gāhessatīti! Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… saccaṃ kira, bhikkhave…pe… saccaṃ bhagavā’’ti…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi –"
    ],
    "innerText": "215. Tena kho pana samayena (bhikkhūpi bhikkhūhi vivadanti,) [( ) natthi (sī. syā. kaṃ.)] bhikkhūpi bhikkhunīhi vivadanti, bhikkhuniyopi bhikkhūhi vivadanti, channopi bhikkhu bhikkhunīnaṃ anupakhajja bhikkhūhi saddhiṃ vivadati, bhikkhunīnaṃ pakkhaṃ gāheti. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma channo bhikkhu bhikkhunīnaṃ anupakhajja bhikkhūhi saddhiṃ vivadissati, bhikkhunīnaṃ pakkhaṃ gāhessatīti! Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… saccaṃ kira, bhikkhave…pe… saccaṃ bhagavā’’ti…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pari. 275]"
      },
      " ‘‘Cattārimāni, bhikkhave, adhikaraṇāni – vivādādhikaraṇaṃ, anuvādādhikaraṇaṃ, āpattādhikaraṇaṃ, kiccādhikaraṇaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kiccādhikaraṇañca (ka.)]"
      },
      "."
    ],
    "innerText": "[pari. 275] ‘‘Cattārimāni, bhikkhave, adhikaraṇāni – vivādādhikaraṇaṃ, anuvādādhikaraṇaṃ, āpattādhikaraṇaṃ, kiccādhikaraṇaṃ [kiccādhikaraṇañca (ka.)]."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tattha katamaṃ vivādādhikaraṇaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pari. 314]"
      },
      "? Idha pana, bhikkhave, bhikkhū ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[bhikkhū bhikkhuṃ (ka.)]"
      },
      " vivadanti – dhammoti vā adhammoti vā, vinayoti vā avinayoti vā, bhāsitaṃ lapitaṃ tathāgatenāti vā abhāsitaṃ alapitaṃ tathāgatenāti vā, āciṇṇaṃ tathāgatenāti vā anāciṇṇaṃ tathāgatenāti vā, paññattaṃ tathāgatenāti vā appaññattaṃ tathāgatenāti vā, āpattīti vā anāpattīti vā ",
      ", lahukā āpattīti vā garukā āpattīti vā, sāvasesā āpattīti vā anavasesā āpattīti vā, duṭṭhullā āpattīti vā aduṭṭhullā āpattīti vā? Yaṃ tattha ",
      " bhaṇḍanaṃ kalaho viggaho ",
      " vivādo nānāvādo aññathāvādo vipaccatāya vohāro medhagaṃ – idaṃ vuccati vivādādhikaraṇaṃ."
    ],
    "innerText": "‘‘Tattha katamaṃ vivādādhikaraṇaṃ [pari. 314]? Idha pana, bhikkhave, bhikkhū [bhikkhū bhikkhuṃ (ka.)] vivadanti – dhammoti vā adhammoti vā, vinayoti vā avinayoti vā, bhāsitaṃ lapitaṃ tathāgatenāti vā abhāsitaṃ alapitaṃ tathāgatenāti vā, āciṇṇaṃ tathāgatenāti vā anāciṇṇaṃ tathāgatenāti vā, paññattaṃ tathāgatenāti vā appaññattaṃ tathāgatenāti vā, āpattīti vā anāpattīti vā , lahukā āpattīti vā garukā āpattīti vā, sāvasesā āpattīti vā anavasesā āpattīti vā, duṭṭhullā āpattīti vā aduṭṭhullā āpattīti vā? Yaṃ tattha bhaṇḍanaṃ kalaho viggaho vivādo nānāvādo aññathāvādo vipaccatāya vohāro medhagaṃ – idaṃ vuccati vivādādhikaraṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tattha katamaṃ anuvādādhikaraṇaṃ? ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pari. 315]"
      },
      " Idha pana, bhikkhave, bhikkhū bhikkhuṃ anuvadanti sīlavipattiyā vā ācāravipattiyā vā diṭṭhivipattiyā vā ājīvavipattiyā vā. Yo tattha anuvādo anuvadanā anullapanā anubhaṇanā anusampavaṅkatā abbhussahanatā anubalappadānaṃ – idaṃ vuccati anuvādādhikaraṇaṃ."
    ],
    "innerText": "‘‘Tattha katamaṃ anuvādādhikaraṇaṃ? [pari. 315] Idha pana, bhikkhave, bhikkhū bhikkhuṃ anuvadanti sīlavipattiyā vā ācāravipattiyā vā diṭṭhivipattiyā vā ājīvavipattiyā vā. Yo tattha anuvādo anuvadanā anullapanā anubhaṇanā anusampavaṅkatā abbhussahanatā anubalappadānaṃ – idaṃ vuccati anuvādādhikaraṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tattha katamaṃ āpattādhikaraṇaṃ? Pañcapi āpattikkhandhā āpattādhikaraṇaṃ, sattapi āpattikkhandhā āpattādhikaraṇaṃ – idaṃ vuccati āpattādhikaraṇaṃ ",
      "."
    ],
    "innerText": "‘‘Tattha katamaṃ āpattādhikaraṇaṃ? Pañcapi āpattikkhandhā āpattādhikaraṇaṃ, sattapi āpattikkhandhā āpattādhikaraṇaṃ – idaṃ vuccati āpattādhikaraṇaṃ ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tattha katamaṃ kiccādhikaraṇaṃ? ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pari. 317]"
      },
      " Yā saṅghassa kiccayatā, karaṇīyatā, apalokanakammaṃ, ñattikammaṃ, ñattidutiyakammaṃ, ñatticatutthakammaṃ – idaṃ vuccati kiccādhikaraṇaṃ."
    ],
    "innerText": "‘‘Tattha katamaṃ kiccādhikaraṇaṃ? [pari. 317] Yā saṅghassa kiccayatā, karaṇīyatā, apalokanakammaṃ, ñattikammaṃ, ñattidutiyakammaṃ, ñatticatutthakammaṃ – idaṃ vuccati kiccādhikaraṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "216"
      },
      ". ‘‘Vivādādhikaraṇassa kiṃ mūlaṃ? Cha vivādamūlāni vivādādhikaraṇassa mūlaṃ. Tīṇipi akusalamūlāni vivādādhikaraṇassa mūlaṃ, tīṇipi kusalamūlāni vivādādhikaraṇassa mūlaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pari. 272; a. ni. 2.35-36; ma. ni. 3.44]"
      },
      " Katamāni cha vivādamūlāni vivādādhikaraṇassa mūlaṃ? Idha pana, bhikkhave, bhikkhu kodhano hoti upanāhī. Yo so, bhikkhave, bhikkhu kodhano hoti upanāhī, so sattharipi agāravo viharati appatisso, dhammepi agāravo viharati appatisso ",
      ", saṅghepi agāravo viharati appatisso, sikkhāyapi na paripūrakārī hoti. Yo so, bhikkhave, bhikkhu sattharipi agāravo viharati appatisso, dhammepi…pe… saṅghepi…pe… sikkhāyapi na paripūrakārī, so saṅghe vivādaṃ janeti. Yo hoti vivādo bahujanāhitāya bahujanāsukhāya bahuno janassa anatthāya ahitāya dukkhāya devamanussānaṃ. Evarūpañce tumhe, bhikkhave, vivādamūlaṃ ajjhattaṃ vā bahiddhā vā samanupasseyyātha, tatra tumhe, bhikkhave, tasseva pāpakassa vivādamūlassa pahānāya vāyameyyātha. Evarūpañce tumhe, bhikkhave, vivādamūlaṃ ajjhattaṃ vā bahiddhā vā na samanupasseyyātha, tatra tumhe, bhikkhave, tasseva pāpakassa vivādamūlassa ",
      " āyatiṃ anavassavāya paṭipajjeyyātha. Evametassa pāpakassa vivādamūlassa pahānaṃ hoti. Evametassa pāpakassa vivādamūlassa āyatiṃ anavassavo hoti."
    ],
    "innerText": "216. ‘‘Vivādādhikaraṇassa kiṃ mūlaṃ? Cha vivādamūlāni vivādādhikaraṇassa mūlaṃ. Tīṇipi akusalamūlāni vivādādhikaraṇassa mūlaṃ, tīṇipi kusalamūlāni vivādādhikaraṇassa mūlaṃ. [pari. 272; a. ni. 2.35-36; ma. ni. 3.44] Katamāni cha vivādamūlāni vivādādhikaraṇassa mūlaṃ? Idha pana, bhikkhave, bhikkhu kodhano hoti upanāhī. Yo so, bhikkhave, bhikkhu kodhano hoti upanāhī, so sattharipi agāravo viharati appatisso, dhammepi agāravo viharati appatisso , saṅghepi agāravo viharati appatisso, sikkhāyapi na paripūrakārī hoti. Yo so, bhikkhave, bhikkhu sattharipi agāravo viharati appatisso, dhammepi…pe… saṅghepi…pe… sikkhāyapi na paripūrakārī, so saṅghe vivādaṃ janeti. Yo hoti vivādo bahujanāhitāya bahujanāsukhāya bahuno janassa anatthāya ahitāya dukkhāya devamanussānaṃ. Evarūpañce tumhe, bhikkhave, vivādamūlaṃ ajjhattaṃ vā bahiddhā vā samanupasseyyātha, tatra tumhe, bhikkhave, tasseva pāpakassa vivādamūlassa pahānāya vāyameyyātha. Evarūpañce tumhe, bhikkhave, vivādamūlaṃ ajjhattaṃ vā bahiddhā vā na samanupasseyyātha, tatra tumhe, bhikkhave, tasseva pāpakassa vivādamūlassa āyatiṃ anavassavāya paṭipajjeyyātha. Evametassa pāpakassa vivādamūlassa pahānaṃ hoti. Evametassa pāpakassa vivādamūlassa āyatiṃ anavassavo hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pari.272]"
      },
      " ‘‘Puna caparaṃ, bhikkhave, bhikkhu makkhī hoti paḷāsī…pe… issukī hoti maccharī ",
      ", saṭho hoti māyāvī, pāpiccho hoti micchādiṭṭhī, sandiṭṭhiparāmāsī hoti ādhānaggāhī duppaṭinissaggī. Yo so, bhikkhave, bhikkhu sandiṭṭhiparāmāsī hoti ādhānaggāhī ",
      " duppaṭinissaggī, so sattharipi agāravo viharati appatisso, dhammepi agāravo viharati appatisso, saṅghepi agāravo viharati appatisso, sikkhāyapi na paripūrakārī hoti. Yo so, bhikkhave, bhikkhu sattharipi agāravo viharati appatisso, dhammepi…pe… saṅghepi…pe… sikkhāyapi na paripūrakārī, so saṅghe vivādaṃ janeti. Yo hoti vivādo bahujanāhitāya bahujanāsukhāya bahuno janassa anatthāya ahitāya dukkhāya devamanussānaṃ. Evarūpañce tumhe, bhikkhave, vivādamūlaṃ ajjhattaṃ vā bahiddhā vā samanupasseyyātha, tatra tumhe, bhikkhave, tasseva pāpakassa vivādamūlassa pahānāya vāyameyyātha. Evarūpañce tumhe, bhikkhave, vivādamūlaṃ ajjhattaṃ vā bahiddhā vā na samanupasseyyātha, tatra tumhe, bhikkhave, tasseva pāpakassa vivādamūlassa āyatiṃ anavassavāya paṭipajjeyyātha. Evametassa pāpakassa vivādamūlassa pahānaṃ hoti. Evametassa pāpakassa vivādamūlassa āyatiṃ anavassavo hoti. Imāni cha vivādamūlāni vivādādhikaraṇassa mūlaṃ."
    ],
    "innerText": "[pari.272] ‘‘Puna caparaṃ, bhikkhave, bhikkhu makkhī hoti paḷāsī…pe… issukī hoti maccharī , saṭho hoti māyāvī, pāpiccho hoti micchādiṭṭhī, sandiṭṭhiparāmāsī hoti ādhānaggāhī duppaṭinissaggī. Yo so, bhikkhave, bhikkhu sandiṭṭhiparāmāsī hoti ādhānaggāhī duppaṭinissaggī, so sattharipi agāravo viharati appatisso, dhammepi agāravo viharati appatisso, saṅghepi agāravo viharati appatisso, sikkhāyapi na paripūrakārī hoti. Yo so, bhikkhave, bhikkhu sattharipi agāravo viharati appatisso, dhammepi…pe… saṅghepi…pe… sikkhāyapi na paripūrakārī, so saṅghe vivādaṃ janeti. Yo hoti vivādo bahujanāhitāya bahujanāsukhāya bahuno janassa anatthāya ahitāya dukkhāya devamanussānaṃ. Evarūpañce tumhe, bhikkhave, vivādamūlaṃ ajjhattaṃ vā bahiddhā vā samanupasseyyātha, tatra tumhe, bhikkhave, tasseva pāpakassa vivādamūlassa pahānāya vāyameyyātha. Evarūpañce tumhe, bhikkhave, vivādamūlaṃ ajjhattaṃ vā bahiddhā vā na samanupasseyyātha, tatra tumhe, bhikkhave, tasseva pāpakassa vivādamūlassa āyatiṃ anavassavāya paṭipajjeyyātha. Evametassa pāpakassa vivādamūlassa pahānaṃ hoti. Evametassa pāpakassa vivādamūlassa āyatiṃ anavassavo hoti. Imāni cha vivādamūlāni vivādādhikaraṇassa mūlaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamāni tīṇi akusalamūlāni vivādādhikaraṇassa mūlaṃ? Idha pana, bhikkhave, bhikkhū luddhacittā vivadanti, duṭṭhacittā vivadanti, mūḷhacittā vivadanti – dhammoti vā adhammoti vā, vinayoti vā avinayoti vā, bhāsitaṃ lapitaṃ tathāgatenāti vā abhāsitaṃ alapitaṃ tathāgatenāti ",
      " vā, āciṇṇaṃ tathāgatenāti vā anāciṇṇaṃ tathāgatenāti vā, paññattaṃ tathāgatenāti vā appaññattaṃ tathāgatenāti vā, āpattīti vā anāpattīti vā, lahukā āpattīti vā garukā āpattīti vā, sāvasesā āpattīti vā anavasesā āpattīti vā, duṭṭhullā āpattīti vā aduṭṭhullā āpattīti vā. Imāni tīṇi akusalamūlāni vivādādhikaraṇassa mūlaṃ."
    ],
    "innerText": "‘‘Katamāni tīṇi akusalamūlāni vivādādhikaraṇassa mūlaṃ? Idha pana, bhikkhave, bhikkhū luddhacittā vivadanti, duṭṭhacittā vivadanti, mūḷhacittā vivadanti – dhammoti vā adhammoti vā, vinayoti vā avinayoti vā, bhāsitaṃ lapitaṃ tathāgatenāti vā abhāsitaṃ alapitaṃ tathāgatenāti vā, āciṇṇaṃ tathāgatenāti vā anāciṇṇaṃ tathāgatenāti vā, paññattaṃ tathāgatenāti vā appaññattaṃ tathāgatenāti vā, āpattīti vā anāpattīti vā, lahukā āpattīti vā garukā āpattīti vā, sāvasesā āpattīti vā anavasesā āpattīti vā, duṭṭhullā āpattīti vā aduṭṭhullā āpattīti vā. Imāni tīṇi akusalamūlāni vivādādhikaraṇassa mūlaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamāni ",
      " tīṇi kusalamūlāni vivādādhikaraṇassa mūlaṃ? Idha pana, bhikkhave, bhikkhū aluddhacittā vivadanti, aduṭṭhacittā vivadanti, amūḷhacittā vivadanti ",
      " – dhammoti vā adhammoti vā…pe… duṭṭhullā āpattīti vā aduṭṭhullā āpattīti vā. Imāni tīṇi kusalamūlāni vivādādhikaraṇassa mūlaṃ."
    ],
    "innerText": "‘‘Katamāni tīṇi kusalamūlāni vivādādhikaraṇassa mūlaṃ? Idha pana, bhikkhave, bhikkhū aluddhacittā vivadanti, aduṭṭhacittā vivadanti, amūḷhacittā vivadanti – dhammoti vā adhammoti vā…pe… duṭṭhullā āpattīti vā aduṭṭhullā āpattīti vā. Imāni tīṇi kusalamūlāni vivādādhikaraṇassa mūlaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "217"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pari. 272]"
      },
      " ‘‘Anuvādādhikaraṇassa kiṃ mūlaṃ? Cha anuvādamūlāni anuvādādhikaraṇassa mūlaṃ. Tīṇipi akusalamūlāni anuvādādhikaraṇassa mūlaṃ, tīṇipi kusalamūlāni anuvādādhikaraṇassa ",
      " mūlaṃ, kāyopi anuvādādhikaraṇassa mūlaṃ, vācāpi anuvādādhikaraṇassa mūlaṃ. ‘‘Katamāni cha anuvādamūlāni anuvādādhikaraṇassa mūlaṃ? Idha pana, bhikkhave, bhikkhu kodhano hoti upanāhī. Yo so, bhikkhave, bhikkhu kodhano hoti upanāhī, so sattharipi agāravo viharati appatisso, dhammepi agāravo viharati appatisso, saṅghepi agāravo viharati ",
      " appatisso, sikkhāyapi na paripūrakārī hoti. Yo so, bhikkhave, bhikkhu sattharipi agāravo viharati appatisso, dhammepi…pe… saṅghepi…pe… sikkhāyapi na paripūrakārī, so saṅghe anuvādaṃ janeti. Yo hoti anuvādo bahujanāhitāya bahujanāsukhāya bahuno janassa anatthāya ahitāya dukkhāya devamanussānaṃ. Evarūpañce tumhe, bhikkhave, anuvādamūlaṃ ajjhattaṃ vā bahiddhā vā samanupasseyyātha, tatra tumhe, bhikkhave, tasseva pāpakassa anuvādamūlassa pahānāya vāyameyyātha. Evarūpañce tumhe, bhikkhave, anuvādamūlaṃ ajjhattaṃ vā bahiddhā vā na samanupasseyyātha, tatra tumhe, bhikkhave, tasseva pāpakassa anuvādamūlassa āyatiṃ anavassavāya paṭipajjeyyātha. Evametassa pāpakassa anuvādamūlassa pahānaṃ hoti. Evametassa pāpakassa anuvādamūlassa āyatiṃ anavassavo hoti."
    ],
    "innerText": "217.[pari. 272] ‘‘Anuvādādhikaraṇassa kiṃ mūlaṃ? Cha anuvādamūlāni anuvādādhikaraṇassa mūlaṃ. Tīṇipi akusalamūlāni anuvādādhikaraṇassa mūlaṃ, tīṇipi kusalamūlāni anuvādādhikaraṇassa mūlaṃ, kāyopi anuvādādhikaraṇassa mūlaṃ, vācāpi anuvādādhikaraṇassa mūlaṃ. ‘‘Katamāni cha anuvādamūlāni anuvādādhikaraṇassa mūlaṃ? Idha pana, bhikkhave, bhikkhu kodhano hoti upanāhī. Yo so, bhikkhave, bhikkhu kodhano hoti upanāhī, so sattharipi agāravo viharati appatisso, dhammepi agāravo viharati appatisso, saṅghepi agāravo viharati appatisso, sikkhāyapi na paripūrakārī hoti. Yo so, bhikkhave, bhikkhu sattharipi agāravo viharati appatisso, dhammepi…pe… saṅghepi…pe… sikkhāyapi na paripūrakārī, so saṅghe anuvādaṃ janeti. Yo hoti anuvādo bahujanāhitāya bahujanāsukhāya bahuno janassa anatthāya ahitāya dukkhāya devamanussānaṃ. Evarūpañce tumhe, bhikkhave, anuvādamūlaṃ ajjhattaṃ vā bahiddhā vā samanupasseyyātha, tatra tumhe, bhikkhave, tasseva pāpakassa anuvādamūlassa pahānāya vāyameyyātha. Evarūpañce tumhe, bhikkhave, anuvādamūlaṃ ajjhattaṃ vā bahiddhā vā na samanupasseyyātha, tatra tumhe, bhikkhave, tasseva pāpakassa anuvādamūlassa āyatiṃ anavassavāya paṭipajjeyyātha. Evametassa pāpakassa anuvādamūlassa pahānaṃ hoti. Evametassa pāpakassa anuvādamūlassa āyatiṃ anavassavo hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhikkhave, bhikkhu makkhī hoti paḷāsī…pe… issukī hoti maccharī, saṭho hoti māyāvī, pāpiccho hoti micchādiṭṭhī, sandiṭṭhiparāmāsī hoti ādhānaggāhī duppaṭinissaggī. Yo so, bhikkhave, bhikkhu sandiṭṭhiparāmāsī hoti ādhānaggāhī duppaṭinissaggī, so sattharipi agāravo viharati appatisso, dhammepi agāravo viharati appatisso, saṅghepi agāravo viharati appatisso, sikkhāyapi na paripūrakārī hoti. Yo so, bhikkhave, bhikkhu sattharipi agāravo ",
      " viharati appatisso ",
      ", dhammepi…pe… saṅghepi…pe… sikkhāyapi na paripūrakārī, so saṅghe anuvādaṃ janeti. Yo hoti anuvādo bahujanāhitāya bahujanāsukhāya bahuno janassa anatthāya ahitāya dukkhāya devamanussānaṃ. Evarūpañce tumhe, bhikkhave, anuvādamūlaṃ ajjhattaṃ vā bahiddhā vā samanupasseyyātha, tatra tumhe, bhikkhave, tasseva pāpakassa anuvādamūlassa pahānāya vāyameyyātha. Evarūpañce tumhe, bhikkhave, anuvādamūlaṃ ajjhattaṃ vā bahiddhā vā na samanupasseyyātha, tatra tumhe, bhikkhave, tasseva pāpakassa anuvādamūlassa āyattiṃ anavassavāya paṭipajjeyyātha. Evametassa pāpakassa anuvādamūlassa pahānaṃ hoti. Evametassa pāpakassa anuvādamūlassa āyatiṃ anavassavo hoti. Imāni cha anuvādamūlāni anuvādādhikaraṇassa mūlaṃ."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, bhikkhu makkhī hoti paḷāsī…pe… issukī hoti maccharī, saṭho hoti māyāvī, pāpiccho hoti micchādiṭṭhī, sandiṭṭhiparāmāsī hoti ādhānaggāhī duppaṭinissaggī. Yo so, bhikkhave, bhikkhu sandiṭṭhiparāmāsī hoti ādhānaggāhī duppaṭinissaggī, so sattharipi agāravo viharati appatisso, dhammepi agāravo viharati appatisso, saṅghepi agāravo viharati appatisso, sikkhāyapi na paripūrakārī hoti. Yo so, bhikkhave, bhikkhu sattharipi agāravo viharati appatisso , dhammepi…pe… saṅghepi…pe… sikkhāyapi na paripūrakārī, so saṅghe anuvādaṃ janeti. Yo hoti anuvādo bahujanāhitāya bahujanāsukhāya bahuno janassa anatthāya ahitāya dukkhāya devamanussānaṃ. Evarūpañce tumhe, bhikkhave, anuvādamūlaṃ ajjhattaṃ vā bahiddhā vā samanupasseyyātha, tatra tumhe, bhikkhave, tasseva pāpakassa anuvādamūlassa pahānāya vāyameyyātha. Evarūpañce tumhe, bhikkhave, anuvādamūlaṃ ajjhattaṃ vā bahiddhā vā na samanupasseyyātha, tatra tumhe, bhikkhave, tasseva pāpakassa anuvādamūlassa āyattiṃ anavassavāya paṭipajjeyyātha. Evametassa pāpakassa anuvādamūlassa pahānaṃ hoti. Evametassa pāpakassa anuvādamūlassa āyatiṃ anavassavo hoti. Imāni cha anuvādamūlāni anuvādādhikaraṇassa mūlaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamāni ",
      " tīṇi akusalamūlāni anuvādādhikaraṇassa mūlaṃ? Idha pana, bhikkhave, bhikkhū bhikkhuṃ luddhacittā anuvadanti, duṭṭhacittā anuvadanti, mūḷhacittā anuvadanti – sīlavipattiyā vā, ācāravipattiyā vā, diṭṭhivipattiyā vā, ājīvavipattiyā vā. Imāni tīṇi akusalamūlāni anuvādādhikaraṇassa mūlaṃ."
    ],
    "innerText": "‘‘Katamāni tīṇi akusalamūlāni anuvādādhikaraṇassa mūlaṃ? Idha pana, bhikkhave, bhikkhū bhikkhuṃ luddhacittā anuvadanti, duṭṭhacittā anuvadanti, mūḷhacittā anuvadanti – sīlavipattiyā vā, ācāravipattiyā vā, diṭṭhivipattiyā vā, ājīvavipattiyā vā. Imāni tīṇi akusalamūlāni anuvādādhikaraṇassa mūlaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamāni tīṇi kusalamūlāni anuvādādhikaraṇassa mūlaṃ? Idha pana, bhikkhave, bhikkhū bhikkhuṃ aluddhacittā anuvadanti, aduṭṭhacittā anuvadanti, amūḷhacittā anuvadanti – sīlavipattiyā vā, ācaravipattiyā ",
      " vā, diṭṭhivipattiyā vā, ājīvavipattiyā vā. Imāni tīṇi kusalamūlāni anuvādādhikaraṇassa mūlaṃ."
    ],
    "innerText": "‘‘Katamāni tīṇi kusalamūlāni anuvādādhikaraṇassa mūlaṃ? Idha pana, bhikkhave, bhikkhū bhikkhuṃ aluddhacittā anuvadanti, aduṭṭhacittā anuvadanti, amūḷhacittā anuvadanti – sīlavipattiyā vā, ācaravipattiyā vā, diṭṭhivipattiyā vā, ājīvavipattiyā vā. Imāni tīṇi kusalamūlāni anuvādādhikaraṇassa mūlaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamo kāyo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[katamo ca kāyo (syā. kaṃ.)]"
      },
      " anuvādādhikaraṇassa mūlaṃ? Idhekacco dubbaṇṇo hoti, duddassiko, okoṭimako, bahvābādho, kāṇo vā, kuṇī vā, khañjo vā, pakkhahato vā, yena naṃ anuvadanti. Ayaṃ kāyo anuvādādhikaraṇassa mūlaṃ."
    ],
    "innerText": "‘‘Katamo kāyo [katamo ca kāyo (syā. kaṃ.)] anuvādādhikaraṇassa mūlaṃ? Idhekacco dubbaṇṇo hoti, duddassiko, okoṭimako, bahvābādho, kāṇo vā, kuṇī vā, khañjo vā, pakkhahato vā, yena naṃ anuvadanti. Ayaṃ kāyo anuvādādhikaraṇassa mūlaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamā vācā anuvādādhikaraṇassa mūlaṃ? Idhekacco dubbaco hoti, mammano, eḷagalavāco, yāya naṃ anuvadanti. Ayaṃ vācā anuvādādhikaraṇassa mūlaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "218"
      },
      ". ‘‘Āpattādhikaraṇassa kiṃ mūlaṃ? Cha āpattisamuṭṭhānā āpattādhikaraṇassa mūlaṃ. Atthāpatti kāyato samuṭṭhāti, na vācato, na ",
      " cittato. Atthāpatti vācato samuṭṭhāti, na kāyato, na cittato. Atthāpatti kāyato ca vācato ca samuṭṭhāti, na cittato. Atthāpatti kāyato ca cittato ca samuṭṭhāti, na vācato. Atthāpatti vācato ca cittato ca samuṭṭhāti, na kāyato. Atthāpatti kāyato ca vācato ca cittato ca samuṭṭhāti. Ime cha āpattisamuṭṭhānā āpattādhikaraṇassa mūlaṃ."
    ],
    "innerText": "218. ‘‘Āpattādhikaraṇassa kiṃ mūlaṃ? Cha āpattisamuṭṭhānā āpattādhikaraṇassa mūlaṃ. Atthāpatti kāyato samuṭṭhāti, na vācato, na cittato. Atthāpatti vācato samuṭṭhāti, na kāyato, na cittato. Atthāpatti kāyato ca vācato ca samuṭṭhāti, na cittato. Atthāpatti kāyato ca cittato ca samuṭṭhāti, na vācato. Atthāpatti vācato ca cittato ca samuṭṭhāti, na kāyato. Atthāpatti kāyato ca vācato ca cittato ca samuṭṭhāti. Ime cha āpattisamuṭṭhānā āpattādhikaraṇassa mūlaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "219"
      },
      ". ‘‘Kiccādhikaraṇassa kiṃ mūlaṃ? Kiccādhikaraṇassa ekaṃ mūlaṃ – saṅgho."
    ],
    "innerText": "219. ‘‘Kiccādhikaraṇassa kiṃ mūlaṃ? Kiccādhikaraṇassa ekaṃ mūlaṃ – saṅgho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "220"
      },
      ". ‘‘Vivādādhikaraṇaṃ ",
      " kusalaṃ, akusalaṃ, abyākataṃ. Vivādādhikaraṇaṃ siyā kusalaṃ, siyā akusalaṃ, siyā abyākataṃ. Tattha katamaṃ vivādādhikaraṇaṃ kusalaṃ? Idha pana, bhikkhave, bhikkhū kusalacittā vivadanti – dhammoti vā adhammoti vā…pe… duṭṭhullā āpattīti ",
      " vā aduṭṭhullā āpattīti vā. Yaṃ tattha bhaṇḍanaṃ kalaho viggaho vivādo nānāvādo aññathāvādo vipaccatāya vohāro medhagaṃ – idaṃ vuccati vivādādhikaraṇaṃ kusalaṃ."
    ],
    "innerText": "220. ‘‘Vivādādhikaraṇaṃ kusalaṃ, akusalaṃ, abyākataṃ. Vivādādhikaraṇaṃ siyā kusalaṃ, siyā akusalaṃ, siyā abyākataṃ. Tattha katamaṃ vivādādhikaraṇaṃ kusalaṃ? Idha pana, bhikkhave, bhikkhū kusalacittā vivadanti – dhammoti vā adhammoti vā…pe… duṭṭhullā āpattīti vā aduṭṭhullā āpattīti vā. Yaṃ tattha bhaṇḍanaṃ kalaho viggaho vivādo nānāvādo aññathāvādo vipaccatāya vohāro medhagaṃ – idaṃ vuccati vivādādhikaraṇaṃ kusalaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tattha katamaṃ vivādādhikaraṇaṃ akusalaṃ? Idha pana, bhikkhave, bhikkhū akusalacittā vivadanti – dhammoti vā adhammoti vā…pe… duṭṭhullā āpattīti vā aduṭṭhullā āpattīti vā. Yaṃ tattha bhaṇḍanaṃ kalaho viggaho vivādo nānāvādo aññathāvādo vipaccatāya vohāro medhagaṃ – idaṃ vuccati vivādādhikaraṇaṃ akusalaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tattha katamaṃ vivādādhikaraṇaṃ abyākataṃ? Idha pana, bhikkhave, bhikkhū abyākatacittā vivadanti – dhammoti vā adhammoti vā…pe… duṭṭhullā āpattīti vā aduṭṭhullā āpattīti vā. Yaṃ tattha bhaṇḍanaṃ kalaho viggaho vivādo nānāvādo aññathāvādo vipaccatāya vohāro medhagaṃ – idaṃ vuccati vivādādhikaraṇaṃ abyākataṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "221"
      },
      ". ‘‘Anuvādādhikaraṇaṃ ",
      " kusalaṃ, akusalaṃ, abyākataṃ. Anuvādādhikaraṇaṃ siyā kusalaṃ, siyā akusalaṃ, siyā abyākataṃ. Tattha katamaṃ anuvādādhikaraṇaṃ kusalaṃ? Idha, bhikkhave, bhikkhū bhikkhuṃ kusalacittā anuvadanti – sīlavipattiyā vā, ācāravipattiyā vā, diṭṭhivipattiyā vā, ājīvavipattiyā vā. Yo tattha anuvādo anuvadanā anullapanā anubhaṇanā ",
      " anusampavaṅkatā abbhussahanatā anubalappadānaṃ – idaṃ vuccati anuvādādhikaraṇaṃ kusalaṃ."
    ],
    "innerText": "221. ‘‘Anuvādādhikaraṇaṃ kusalaṃ, akusalaṃ, abyākataṃ. Anuvādādhikaraṇaṃ siyā kusalaṃ, siyā akusalaṃ, siyā abyākataṃ. Tattha katamaṃ anuvādādhikaraṇaṃ kusalaṃ? Idha, bhikkhave, bhikkhū bhikkhuṃ kusalacittā anuvadanti – sīlavipattiyā vā, ācāravipattiyā vā, diṭṭhivipattiyā vā, ājīvavipattiyā vā. Yo tattha anuvādo anuvadanā anullapanā anubhaṇanā anusampavaṅkatā abbhussahanatā anubalappadānaṃ – idaṃ vuccati anuvādādhikaraṇaṃ kusalaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tattha katamaṃ anuvādādhikaraṇaṃ akusalaṃ? Idha pana, bhikkhave, bhikkhū bhikkhuṃ akusalacittā anuvadanti – sīlavipattiyā vā, ācāravipattiyā vā, diṭṭhivipattiyā vā, ājīvavipattiyā vā. Yo tattha anuvādo anuvadanā anullapanā anubhaṇanā anusampavaṅkatā abbhussahanatā anubalappadānaṃ – idaṃ vuccati anuvādādhikaraṇaṃ akusalaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tattha katamaṃ anuvādādhikaraṇaṃ abyākataṃ? Idha pana, bhikkhave, bhikkhū bhikkhuṃ abyākatacittā anuvadanti – sīlavipattiyā vā, ācāravipattiyā vā, diṭṭhivipattiyā vā, ājīvavipattiyā vā. Yo tattha anuvādo anuvadanā anullapanā anubhaṇanā anusampavaṅkatā abbhussahanatā anubalappadānaṃ – idaṃ vuccati anuvādādhikaraṇaṃ abyākataṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "222"
      },
      ". ‘‘Āpattādhikaraṇaṃ ",
      " kusalaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[idaṃ padaṃ kesuci natthi]"
      },
      ", akusalaṃ, abyākataṃ? Āpattādhikaraṇaṃ siyā akusalaṃ, siyā abyākataṃ; natthi āpattādhikaraṇaṃ kusalaṃ. Tattha ",
      " katamaṃ āpattādhikaraṇaṃ akusalaṃ? Yaṃ jānanto sañjānanto cecca abhivitaritvā vītikkamo – idaṃ vuccati āpattādhikaraṇaṃ akusalaṃ."
    ],
    "innerText": "222. ‘‘Āpattādhikaraṇaṃ kusalaṃ [idaṃ padaṃ kesuci natthi], akusalaṃ, abyākataṃ? Āpattādhikaraṇaṃ siyā akusalaṃ, siyā abyākataṃ; natthi āpattādhikaraṇaṃ kusalaṃ. Tattha katamaṃ āpattādhikaraṇaṃ akusalaṃ? Yaṃ jānanto sañjānanto cecca abhivitaritvā vītikkamo – idaṃ vuccati āpattādhikaraṇaṃ akusalaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tattha katamaṃ āpattādhikaraṇaṃ abyākataṃ? Yaṃ ajānanto asañjānanto acecca anabhivitaritvā vītikkamo – idaṃ vuccati āpattādhikaraṇaṃ abyākataṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "223"
      },
      ". ‘‘Kiccādhikaraṇaṃ kusalaṃ, akusalaṃ, abyākataṃ? Kiccādhikaraṇaṃ siyā kusalaṃ, siyā akusalaṃ, siyā abyākataṃ. Tattha katamaṃ kiccādhikaraṇaṃ kusalaṃ? Yaṃ saṅgho kusalacitto kammaṃ karoti – apalokanakammaṃ, ñattikammaṃ, ñattidutiyakammaṃ, ñatticatutthakammaṃ – idaṃ vuccati kiccādhikaraṇaṃ kusalaṃ."
    ],
    "innerText": "223. ‘‘Kiccādhikaraṇaṃ kusalaṃ, akusalaṃ, abyākataṃ? Kiccādhikaraṇaṃ siyā kusalaṃ, siyā akusalaṃ, siyā abyākataṃ. Tattha katamaṃ kiccādhikaraṇaṃ kusalaṃ? Yaṃ saṅgho kusalacitto kammaṃ karoti – apalokanakammaṃ, ñattikammaṃ, ñattidutiyakammaṃ, ñatticatutthakammaṃ – idaṃ vuccati kiccādhikaraṇaṃ kusalaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tattha katamaṃ kiccādhikaraṇaṃ ",
      " akusalaṃ? Yaṃ saṅgho akusalacitto kammaṃ karoti – apalokanakammaṃ, ñattikammaṃ, ñattidutiyakammaṃ, ñatticatutthakammaṃ – idaṃ vuccati kiccādhikaraṇaṃ akusalaṃ."
    ],
    "innerText": "‘‘Tattha katamaṃ kiccādhikaraṇaṃ akusalaṃ? Yaṃ saṅgho akusalacitto kammaṃ karoti – apalokanakammaṃ, ñattikammaṃ, ñattidutiyakammaṃ, ñatticatutthakammaṃ – idaṃ vuccati kiccādhikaraṇaṃ akusalaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tattha ",
      " katamaṃ kiccādhikaraṇaṃ abyākataṃ? Yaṃ saṅgho abyākatacitto kammaṃ karoti – apalokanakammaṃ, ñattikammaṃ, ñattidutiyakammaṃ, ñatticatutthakammaṃ – idaṃ vuccati kiccādhikaraṇaṃ abyākataṃ."
    ],
    "innerText": "‘‘Tattha katamaṃ kiccādhikaraṇaṃ abyākataṃ? Yaṃ saṅgho abyākatacitto kammaṃ karoti – apalokanakammaṃ, ñattikammaṃ, ñattidutiyakammaṃ, ñatticatutthakammaṃ – idaṃ vuccati kiccādhikaraṇaṃ abyākataṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "224"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pari. 355]"
      },
      " ‘‘Vivādo vivādādhikaraṇaṃ, vivādo no adhikaraṇaṃ, adhikaraṇaṃ no vivādo, adhikaraṇañceva vivādo ca. Siyā vivādo vivādādhikaraṇaṃ, siyā vivādo no adhikaraṇaṃ, siyā adhikaraṇaṃ no ",
      " vivādo, siyā adhikaraṇañceva vivādo ca."
    ],
    "innerText": "224.[pari. 355] ‘‘Vivādo vivādādhikaraṇaṃ, vivādo no adhikaraṇaṃ, adhikaraṇaṃ no vivādo, adhikaraṇañceva vivādo ca. Siyā vivādo vivādādhikaraṇaṃ, siyā vivādo no adhikaraṇaṃ, siyā adhikaraṇaṃ no vivādo, siyā adhikaraṇañceva vivādo ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tattha katamo vivādo vivādādhikaraṇaṃ? Idha pana, bhikkhave, bhikkhū vivadanti – dhammoti vā adhammoti vā…pe… duṭṭhullā āpattīti vā aduṭṭhullā āpattīti vā. Yaṃ tattha bhaṇḍanaṃ kalaho viggaho vivādo nānāvādo aññathāvādo vipaccatāya vohāro medhagaṃ – ayaṃ vivādo vivādādhikaraṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tattha ",
      " katamo vivādo no adhikaraṇaṃ? Mātāpi puttena vivadati, puttopi mātarā vivadati, pitāpi puttena vivadati, puttopi pitarā vivadati, bhātāpi bhātarā vivadati, bhātāpi bhaginiyā vivadati, bhaginīpi bhātarā vivadati, sahāyopi sahāyena vivadati – ayaṃ vivādo no adhikaraṇaṃ."
    ],
    "innerText": "‘‘Tattha katamo vivādo no adhikaraṇaṃ? Mātāpi puttena vivadati, puttopi mātarā vivadati, pitāpi puttena vivadati, puttopi pitarā vivadati, bhātāpi bhātarā vivadati, bhātāpi bhaginiyā vivadati, bhaginīpi bhātarā vivadati, sahāyopi sahāyena vivadati – ayaṃ vivādo no adhikaraṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tattha katamaṃ adhikaraṇaṃ no vivādo? Anuvādādhikaraṇaṃ, āpattādhikaraṇaṃ, kiccādhikaraṇaṃ – idaṃ adhikaraṇaṃ no vivādo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tattha katamaṃ adhikaraṇañceva vivādo ca? Vivādādhikaraṇaṃ adhikaraṇañceva vivādo ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "225"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pari. 356]"
      },
      " ‘‘Anuvādo anuvādādhikaraṇaṃ, anuvādo no adhikaraṇaṃ, adhikaraṇaṃ no anuvādo, adhikaraṇañceva anuvādo ca. Siyā anuvādo anuvādādhikaraṇaṃ, siyā anuvādo no adhikaraṇaṃ, siyā adhikaraṇaṃ no anuvādo, siyā adhikaraṇañceva anuvādo ca."
    ],
    "innerText": "225.[pari. 356] ‘‘Anuvādo anuvādādhikaraṇaṃ, anuvādo no adhikaraṇaṃ, adhikaraṇaṃ no anuvādo, adhikaraṇañceva anuvādo ca. Siyā anuvādo anuvādādhikaraṇaṃ, siyā anuvādo no adhikaraṇaṃ, siyā adhikaraṇaṃ no anuvādo, siyā adhikaraṇañceva anuvādo ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tattha katamo anuvādo anuvādādhikaraṇaṃ? Idha pana, bhikkhave, bhikkhū bhikkhuṃ anuvadanti – sīlavipattiyā vā, ācāravipattiyā vā ",
      ", diṭṭhivipattiyā vā, ājīvavipattiyā vā. Yo tattha anuvādo anuvadanā anullapanā anubhaṇanā ",
      " anusampavaṅkatā abbhussahanatā anubalappadānaṃ – ayaṃ anuvādo anuvādādhikaraṇaṃ."
    ],
    "innerText": "‘‘Tattha katamo anuvādo anuvādādhikaraṇaṃ? Idha pana, bhikkhave, bhikkhū bhikkhuṃ anuvadanti – sīlavipattiyā vā, ācāravipattiyā vā , diṭṭhivipattiyā vā, ājīvavipattiyā vā. Yo tattha anuvādo anuvadanā anullapanā anubhaṇanā anusampavaṅkatā abbhussahanatā anubalappadānaṃ – ayaṃ anuvādo anuvādādhikaraṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tattha katamo anuvādo no adhikaraṇaṃ? Mātāpi puttaṃ anuvadati, puttopi mātaraṃ anuvadati, pitāpi puttaṃ anuvadati, puttopi pitaraṃ anuvadati, bhātāpi bhātaraṃ anuvadati, bhātāpi bhaginiṃ anuvadati, bhaginīpi bhātaraṃ anuvadati, sahāyopi sahāyaṃ anuvadati – ayaṃ anuvādo no adhikaraṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tattha katamaṃ adhikaraṇaṃ no anuvādo? Āpattādhikaraṇaṃ, kiccādhikaraṇaṃ, vivādādhikaraṇaṃ – idaṃ adhikaraṇaṃ no anuvādo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tattha ",
      " katamaṃ adhikaraṇañceva anuvādo ca? Anuvādādhikaraṇaṃ adhikaraṇañceva anuvādo ca."
    ],
    "innerText": "‘‘Tattha katamaṃ adhikaraṇañceva anuvādo ca? Anuvādādhikaraṇaṃ adhikaraṇañceva anuvādo ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "226"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pari. 357]"
      },
      " ‘‘Āpatti āpattādhikaraṇaṃ, āpatti no adhikaraṇaṃ, adhikaraṇaṃ no āpatti, adhikaraṇañceva āpatti ca. Siyā āpatti āpattādhikaraṇaṃ, siyā āpatti no adhikaraṇaṃ, siyā adhikaraṇaṃ no āpatti, siyā adhikaraṇañceva āpatti ca. ‘‘Tattha katamaṃ ",
      " āpatti āpattādhikaraṇaṃ? Pañcapi āpattikkhandhā āpattādhikaraṇaṃ, sattapi āpattikkhandhā āpattādhikaraṇaṃ – ayaṃ āpatti āpattādhikaraṇaṃ."
    ],
    "innerText": "226.[pari. 357] ‘‘Āpatti āpattādhikaraṇaṃ, āpatti no adhikaraṇaṃ, adhikaraṇaṃ no āpatti, adhikaraṇañceva āpatti ca. Siyā āpatti āpattādhikaraṇaṃ, siyā āpatti no adhikaraṇaṃ, siyā adhikaraṇaṃ no āpatti, siyā adhikaraṇañceva āpatti ca. ‘‘Tattha katamaṃ āpatti āpattādhikaraṇaṃ? Pañcapi āpattikkhandhā āpattādhikaraṇaṃ, sattapi āpattikkhandhā āpattādhikaraṇaṃ – ayaṃ āpatti āpattādhikaraṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tattha katamaṃ āpatti no adhikaraṇaṃ? Sotāpatti samāpatti – ayaṃ āpatti no adhikaraṇaṃ ",
      "."
    ],
    "innerText": "‘‘Tattha katamaṃ āpatti no adhikaraṇaṃ? Sotāpatti samāpatti – ayaṃ āpatti no adhikaraṇaṃ ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tattha katamaṃ adhikaraṇaṃ no āpatti? Kiccādhikaraṇaṃ, vivādādhikaraṇaṃ, anuvādādhikaraṇaṃ – idaṃ adhikaraṇaṃ no āpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tattha katamaṃ adhikaraṇañceva āpatti ca? Āpattādhikaraṇaṃ adhikaraṇañceva āpatti ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "227"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pari. 358]"
      },
      " ‘‘Kiccaṃ kiccādhikaraṇaṃ, kiccaṃ no adhikaraṇaṃ, adhikaraṇaṃ no kiccaṃ, adhikaraṇañceva kiccañca. Siyā kiccaṃ kiccādhikaraṇaṃ, siyā kiccaṃ no adhikaraṇaṃ, siyā adhikaraṇaṃ no kiccaṃ, siyā adhikaraṇañceva kiccañca."
    ],
    "innerText": "227.[pari. 358] ‘‘Kiccaṃ kiccādhikaraṇaṃ, kiccaṃ no adhikaraṇaṃ, adhikaraṇaṃ no kiccaṃ, adhikaraṇañceva kiccañca. Siyā kiccaṃ kiccādhikaraṇaṃ, siyā kiccaṃ no adhikaraṇaṃ, siyā adhikaraṇaṃ no kiccaṃ, siyā adhikaraṇañceva kiccañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tattha ",
      " katamaṃ kiccaṃ kiccādhikaraṇaṃ? Yā saṅghassa kiccayatā, karaṇīyatā, apalokanakammaṃ, ñattikammaṃ, ñattidutiyakammaṃ, ñatticatutthakammaṃ – idaṃ kiccaṃ kiccādhikaraṇaṃ."
    ],
    "innerText": "‘‘Tattha katamaṃ kiccaṃ kiccādhikaraṇaṃ? Yā saṅghassa kiccayatā, karaṇīyatā, apalokanakammaṃ, ñattikammaṃ, ñattidutiyakammaṃ, ñatticatutthakammaṃ – idaṃ kiccaṃ kiccādhikaraṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tattha katamaṃ kiccaṃ no adhikaraṇaṃ? Ācariyakiccaṃ, upajjhāyakiccaṃ, samānupajjhāyakiccaṃ, samānācariyakiccaṃ – idaṃ kiccaṃ no adhikaraṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tattha katamaṃ adhikaraṇaṃ no kiccaṃ? Vivādādhikaraṇaṃ, anuvādādhikaraṇaṃ, āpattādhikaraṇaṃ – idaṃ adhikaraṇaṃ no kiccaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tattha ",
      " katamaṃ adhikaraṇañceva kiccañca? Kiccādhikaraṇaṃ adhikaraṇañceva kiccañca."
    ],
    "innerText": "‘‘Tattha katamaṃ adhikaraṇañceva kiccañca? Kiccādhikaraṇaṃ adhikaraṇañceva kiccañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Adhikaraṇavūpasamanasamatho"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Sammukhāvinayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "228"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pari. 292-293, 307 ādayo]"
      },
      " ‘‘Vivādādhikaraṇaṃ katihi samathehi sammati? Vivādādhikaraṇaṃ dvīhi samathehi sammati – sammukhāvinayena ca, yebhuyyasikāya ca. Siyā vivādādhikaraṇaṃ ekaṃ samathaṃ anāgamma yebhuyyasikaṃ, ekena samathena sameyya – sammukhāvinayenāti? Siyātissa vacanīyaṃ. Yathā kathaṃ viya? Idha ",
      " pana, bhikkhave, bhikkhū vivadanti – dhammoti vā adhammoti vā, vinayoti vā avinayoti vā, bhāsitaṃ lapitaṃ tathāgatenāti vā abhāsitaṃ alapitaṃ tathāgatenāti vā, āciṇṇaṃ tathāgatenāti vā anāciṇṇaṃ tathāgatenāti vā, paññattaṃ tathāgatenāti vā apaññattaṃ tathāgatenāti vā, āpattīti vā anāpattīti vā, lahukā āpattīti vā garukā āpattīti vā, sāvasesā āpattīti vā anavasesā āpattīti vā, duṭṭhullā āpattīti vā aduṭṭhullā āpattīti vā."
    ],
    "innerText": "228.[pari. 292-293, 307 ādayo] ‘‘Vivādādhikaraṇaṃ katihi samathehi sammati? Vivādādhikaraṇaṃ dvīhi samathehi sammati – sammukhāvinayena ca, yebhuyyasikāya ca. Siyā vivādādhikaraṇaṃ ekaṃ samathaṃ anāgamma yebhuyyasikaṃ, ekena samathena sameyya – sammukhāvinayenāti? Siyātissa vacanīyaṃ. Yathā kathaṃ viya? Idha pana, bhikkhave, bhikkhū vivadanti – dhammoti vā adhammoti vā, vinayoti vā avinayoti vā, bhāsitaṃ lapitaṃ tathāgatenāti vā abhāsitaṃ alapitaṃ tathāgatenāti vā, āciṇṇaṃ tathāgatenāti vā anāciṇṇaṃ tathāgatenāti vā, paññattaṃ tathāgatenāti vā apaññattaṃ tathāgatenāti vā, āpattīti vā anāpattīti vā, lahukā āpattīti vā garukā āpattīti vā, sāvasesā āpattīti vā anavasesā āpattīti vā, duṭṭhullā āpattīti vā aduṭṭhullā āpattīti vā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Te ce, bhikkhave, bhikkhū sakkonti taṃ adhikaraṇaṃ vūpasametuṃ, idaṃ vuccati, bhikkhave, adhikaraṇaṃ vūpasantaṃ. Kena vūpasantaṃ? Sammukhāvinayena. Kiñca tattha sammukhāvinayasmiṃ? Saṅghasammukhatā, dhammasammukhatā, vinayasammukhatā, puggalasammukhatā. Kā ca tattha saṅghasammukhatā? Yāvatikā bhikkhū kammappattā te āgatā honti, chandārahānaṃ chando āhaṭo hoti, sammukhībhūtā na paṭikkosanti – ayaṃ tattha saṅghasammukhatā. Kā ca ",
      " tattha dhammasammukhatā, vinayasammukhatā ",
      "? Yena dhammena yena vinayena yena satthusāsanena taṃ adhikaraṇaṃ vūpasammati – ayaṃ tattha dhammasammukhatā, vinayasammukhatā. Kā ca tattha puggalasammukhatā? Yo ca vivadati, yena ca vivadati, ubho atthapaccatthikā sammukhībhūtā honti – ayaṃ tattha puggalasammukhatā. Evaṃ vūpasantaṃ ce, bhikkhave, adhikaraṇaṃ kārako ",
      " ukkoṭeti, ukkoṭanakaṃ pācittiyaṃ; chandadāyako khīyati, khīyanakaṃ pācittiyaṃ."
    ],
    "innerText": "‘‘Te ce, bhikkhave, bhikkhū sakkonti taṃ adhikaraṇaṃ vūpasametuṃ, idaṃ vuccati, bhikkhave, adhikaraṇaṃ vūpasantaṃ. Kena vūpasantaṃ? Sammukhāvinayena. Kiñca tattha sammukhāvinayasmiṃ? Saṅghasammukhatā, dhammasammukhatā, vinayasammukhatā, puggalasammukhatā. Kā ca tattha saṅghasammukhatā? Yāvatikā bhikkhū kammappattā te āgatā honti, chandārahānaṃ chando āhaṭo hoti, sammukhībhūtā na paṭikkosanti – ayaṃ tattha saṅghasammukhatā. Kā ca tattha dhammasammukhatā, vinayasammukhatā ? Yena dhammena yena vinayena yena satthusāsanena taṃ adhikaraṇaṃ vūpasammati – ayaṃ tattha dhammasammukhatā, vinayasammukhatā. Kā ca tattha puggalasammukhatā? Yo ca vivadati, yena ca vivadati, ubho atthapaccatthikā sammukhībhūtā honti – ayaṃ tattha puggalasammukhatā. Evaṃ vūpasantaṃ ce, bhikkhave, adhikaraṇaṃ kārako ukkoṭeti, ukkoṭanakaṃ pācittiyaṃ; chandadāyako khīyati, khīyanakaṃ pācittiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "229"
      },
      ". ‘‘Te ce, bhikkhave, bhikkhū na sakkonti taṃ adhikaraṇaṃ tasmiṃ āvāse vūpasametuṃ, tehi, bhikkhave, bhikkhūhi, yasmiṃ āvāse sambahulā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[bahutarā (sī. syā.)]"
      },
      " bhikkhū, so āvāso gantabbo. Te ce, bhikkhave, bhikkhū taṃ āvāsaṃ gacchantā antarāmagge sakkonti taṃ adhikaraṇaṃ vūpasametuṃ, idaṃ vuccati, bhikkhave, adhikaraṇaṃ vūpasantaṃ. Kena vūpasantaṃ? Sammukhāvinayena ",
      ". Kiñca tattha sammukhāvinayasmiṃ? Saṅghasammukhatā, dhammasammukhatā, vinayasammukhatā, puggalasammukhatā. Kā ca tattha saṅghasammukhatā? Yāvatikā bhikkhū kammappattā te āgatā honti, chandārahānaṃ chando āhaṭo hoti, sammukhībhūtā na paṭikkosanti – ayaṃ tattha saṅghasammukhatā. Kā ca tattha dhammasammukhatā, vinayasammukhatā? Yena dhammena yena vinayena yena satthusāsanena taṃ adhikaraṇaṃ vūpasammati – ayaṃ tattha dhammasammukhatā, vinayasammukhatā. Kā ca tattha puggalasammukhatā? Yo ca vivadati, yena ca vivadati, ubho atthapaccatthikā sammukhībhūtā honti – ayaṃ tattha puggalasammukhatā. Evaṃ vūpasantaṃ ce, bhikkhave, adhikaraṇaṃ kārako ukkoṭeti, ukkoṭanakaṃ pācittiyaṃ; chandadāyako khīyati, khīyanakaṃ pācittiyaṃ."
    ],
    "innerText": "229. ‘‘Te ce, bhikkhave, bhikkhū na sakkonti taṃ adhikaraṇaṃ tasmiṃ āvāse vūpasametuṃ, tehi, bhikkhave, bhikkhūhi, yasmiṃ āvāse sambahulā [bahutarā (sī. syā.)] bhikkhū, so āvāso gantabbo. Te ce, bhikkhave, bhikkhū taṃ āvāsaṃ gacchantā antarāmagge sakkonti taṃ adhikaraṇaṃ vūpasametuṃ, idaṃ vuccati, bhikkhave, adhikaraṇaṃ vūpasantaṃ. Kena vūpasantaṃ? Sammukhāvinayena . Kiñca tattha sammukhāvinayasmiṃ? Saṅghasammukhatā, dhammasammukhatā, vinayasammukhatā, puggalasammukhatā. Kā ca tattha saṅghasammukhatā? Yāvatikā bhikkhū kammappattā te āgatā honti, chandārahānaṃ chando āhaṭo hoti, sammukhībhūtā na paṭikkosanti – ayaṃ tattha saṅghasammukhatā. Kā ca tattha dhammasammukhatā, vinayasammukhatā? Yena dhammena yena vinayena yena satthusāsanena taṃ adhikaraṇaṃ vūpasammati – ayaṃ tattha dhammasammukhatā, vinayasammukhatā. Kā ca tattha puggalasammukhatā? Yo ca vivadati, yena ca vivadati, ubho atthapaccatthikā sammukhībhūtā honti – ayaṃ tattha puggalasammukhatā. Evaṃ vūpasantaṃ ce, bhikkhave, adhikaraṇaṃ kārako ukkoṭeti, ukkoṭanakaṃ pācittiyaṃ; chandadāyako khīyati, khīyanakaṃ pācittiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "230"
      },
      ". ‘‘Te ",
      " ce, bhikkhave, bhikkhū taṃ āvāsaṃ āgacchantā antarāmagge na sakkonti taṃ adhikaraṇaṃ vūpasametuṃ, tehi, bhikkhave, bhikkhūhi, taṃ āvāsaṃ gantvā āvāsikā bhikkhū evamassu vacanīyā – ‘idaṃ kho, āvuso, adhikaraṇaṃ evaṃ jātaṃ, evaṃ samuppannaṃ; sādhāyasmantā imaṃ adhikaraṇaṃ vūpasamentu dhammena vinayena satthusāsanena, yathayidaṃ adhikaraṇaṃ suvūpasantaṃ assā’ti."
    ],
    "innerText": "230. ‘‘Te ce, bhikkhave, bhikkhū taṃ āvāsaṃ āgacchantā antarāmagge na sakkonti taṃ adhikaraṇaṃ vūpasametuṃ, tehi, bhikkhave, bhikkhūhi, taṃ āvāsaṃ gantvā āvāsikā bhikkhū evamassu vacanīyā – ‘idaṃ kho, āvuso, adhikaraṇaṃ evaṃ jātaṃ, evaṃ samuppannaṃ; sādhāyasmantā imaṃ adhikaraṇaṃ vūpasamentu dhammena vinayena satthusāsanena, yathayidaṃ adhikaraṇaṃ suvūpasantaṃ assā’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace ",
      ", bhikkhave, āvāsikā bhikkhū vuḍḍhatarā honti, āgantukā bhikkhū navakatarā, tehi, bhikkhave, āvāsikehi bhikkhūhi āgantukā bhikkhū evamassu vacanīyā – ‘iṅgha tumhe, āyasmanto, muhuttaṃ ekamantaṃ hotha, yāva mayaṃ mantemā’ti. Sace pana, bhikkhave, āvāsikā bhikkhū navakatarā honti, āgantukā bhikkhū vuḍḍhatarā, tehi, bhikkhave, āvāsikehi bhikkhūhi āgantukā bhikkhū evamassu vacanīyā – ‘tena hi tumhe, āyasmanto, muhuttaṃ idheva tāva hotha, yāva mayaṃ mantemā’ti."
    ],
    "innerText": "‘‘Sace , bhikkhave, āvāsikā bhikkhū vuḍḍhatarā honti, āgantukā bhikkhū navakatarā, tehi, bhikkhave, āvāsikehi bhikkhūhi āgantukā bhikkhū evamassu vacanīyā – ‘iṅgha tumhe, āyasmanto, muhuttaṃ ekamantaṃ hotha, yāva mayaṃ mantemā’ti. Sace pana, bhikkhave, āvāsikā bhikkhū navakatarā honti, āgantukā bhikkhū vuḍḍhatarā, tehi, bhikkhave, āvāsikehi bhikkhūhi āgantukā bhikkhū evamassu vacanīyā – ‘tena hi tumhe, āyasmanto, muhuttaṃ idheva tāva hotha, yāva mayaṃ mantemā’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace pana, bhikkhave, āvāsikānaṃ bhikkhūnaṃ mantayamānānaṃ evaṃ hoti – ‘na mayaṃ sakkoma imaṃ adhikaraṇaṃ vūpasametuṃ dhammena vinayena satthusāsanenā’ti, na taṃ adhikaraṇaṃ āvāsikehi bhikkhūhi sampaṭicchitabbaṃ. Sace pana, bhikkhave, āvāsikānaṃ bhikkhūnaṃ mantayamānānaṃ evaṃ hoti – ‘sakkoma mayaṃ imaṃ adhikaraṇaṃ vūpasametuṃ dhammena vinayena satthusāsanenā’ti, tehi, bhikkhave, āvāsikehi ",
      " bhikkhūhi āgantukā bhikkhū evamassu vacanīyā – ‘sace tumhe, āyasmanto, amhākaṃ ",
      " imaṃ adhikaraṇaṃ yathājātaṃ yathāsamuppannaṃ ārocessatha, yathā ca mayaṃ imaṃ adhikaraṇaṃ vūpasamessāma dhammena vinayena satthusāsanena tathā suvūpasantaṃ ",
      " bhavissati. Evaṃ mayaṃ imaṃ adhikaraṇaṃ sampaṭicchissāma. No ce tumhe, āyasmanto, amhākaṃ imaṃ adhikaraṇaṃ yathājātaṃ yathāsamuppannaṃ ārocessatha, yathā ca mayaṃ imaṃ adhikaraṇaṃ vūpasamessāma dhammena vinayena satthusāsanena tathā na suvūpasantaṃ bhavissati, na mayaṃ imaṃ adhikaraṇaṃ sampaṭicchissāmā’ti. Evaṃ supariggahitaṃ kho, bhikkhave, katvā āvāsikehi bhikkhūhi taṃ adhikaraṇaṃ sampaṭicchitabbaṃ."
    ],
    "innerText": "‘‘Sace pana, bhikkhave, āvāsikānaṃ bhikkhūnaṃ mantayamānānaṃ evaṃ hoti – ‘na mayaṃ sakkoma imaṃ adhikaraṇaṃ vūpasametuṃ dhammena vinayena satthusāsanenā’ti, na taṃ adhikaraṇaṃ āvāsikehi bhikkhūhi sampaṭicchitabbaṃ. Sace pana, bhikkhave, āvāsikānaṃ bhikkhūnaṃ mantayamānānaṃ evaṃ hoti – ‘sakkoma mayaṃ imaṃ adhikaraṇaṃ vūpasametuṃ dhammena vinayena satthusāsanenā’ti, tehi, bhikkhave, āvāsikehi bhikkhūhi āgantukā bhikkhū evamassu vacanīyā – ‘sace tumhe, āyasmanto, amhākaṃ imaṃ adhikaraṇaṃ yathājātaṃ yathāsamuppannaṃ ārocessatha, yathā ca mayaṃ imaṃ adhikaraṇaṃ vūpasamessāma dhammena vinayena satthusāsanena tathā suvūpasantaṃ bhavissati. Evaṃ mayaṃ imaṃ adhikaraṇaṃ sampaṭicchissāma. No ce tumhe, āyasmanto, amhākaṃ imaṃ adhikaraṇaṃ yathājātaṃ yathāsamuppannaṃ ārocessatha, yathā ca mayaṃ imaṃ adhikaraṇaṃ vūpasamessāma dhammena vinayena satthusāsanena tathā na suvūpasantaṃ bhavissati, na mayaṃ imaṃ adhikaraṇaṃ sampaṭicchissāmā’ti. Evaṃ supariggahitaṃ kho, bhikkhave, katvā āvāsikehi bhikkhūhi taṃ adhikaraṇaṃ sampaṭicchitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tehi, bhikkhave, āgantukehi bhikkhūhi āvāsikā bhikkhū evamassu vacanīyā – ‘yathājātaṃ yathāsamuppannaṃ mayaṃ imaṃ adhikaraṇaṃ āyasmantānaṃ ārocessāma. Sace āyasmantā sakkonti ettakena vā ettakena vā antarena imaṃ adhikaraṇaṃ vūpasametuṃ dhammena vinayena satthusāsanena tathā suvūpasantaṃ bhavissati. Evaṃ mayaṃ imaṃ adhikaraṇaṃ āyasmantānaṃ niyyādessāma. No ce āyasmantā sakkonti ettakena vā ettakena vā antarena imaṃ adhikaraṇaṃ vūpasametuṃ dhammena vinayena satthusāsanena tathā na suvūpasantaṃ bhavissati, na mayaṃ imaṃ adhikaraṇaṃ āyasmantānaṃ niyyādessāma ",
      ". Mayameva ",
      " imassa adhikaraṇassa sāmino bhavissāmā’ti. Evaṃ supariggahitaṃ kho, bhikkhave, katvā āgantukehi bhikkhūhi taṃ adhikaraṇaṃ āvāsikānaṃ bhikkhūnaṃ niyyādetabbaṃ."
    ],
    "innerText": "‘‘Tehi, bhikkhave, āgantukehi bhikkhūhi āvāsikā bhikkhū evamassu vacanīyā – ‘yathājātaṃ yathāsamuppannaṃ mayaṃ imaṃ adhikaraṇaṃ āyasmantānaṃ ārocessāma. Sace āyasmantā sakkonti ettakena vā ettakena vā antarena imaṃ adhikaraṇaṃ vūpasametuṃ dhammena vinayena satthusāsanena tathā suvūpasantaṃ bhavissati. Evaṃ mayaṃ imaṃ adhikaraṇaṃ āyasmantānaṃ niyyādessāma. No ce āyasmantā sakkonti ettakena vā ettakena vā antarena imaṃ adhikaraṇaṃ vūpasametuṃ dhammena vinayena satthusāsanena tathā na suvūpasantaṃ bhavissati, na mayaṃ imaṃ adhikaraṇaṃ āyasmantānaṃ niyyādessāma . Mayameva imassa adhikaraṇassa sāmino bhavissāmā’ti. Evaṃ supariggahitaṃ kho, bhikkhave, katvā āgantukehi bhikkhūhi taṃ adhikaraṇaṃ āvāsikānaṃ bhikkhūnaṃ niyyādetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Te ce, bhikkhave, bhikkhū sakkonti taṃ adhikaraṇaṃ vūpasametuṃ, idaṃ vuccati, bhikkhave, adhikaraṇaṃ vūpasantaṃ. Kena vūpasantaṃ? Sammukhāvinayena. Kiñca tattha sammukhāvinayasmiṃ? Saṅghasammukhatā, dhammasammukhatā, vinayasammukhatā, puggalasammukhatā…pe… evaṃ vūpasantaṃ ce, bhikkhave, adhikaraṇaṃ kārako ukkoṭeti, ukkoṭanakaṃ pācittiyaṃ; chandadāyako khīyati, khīyanakaṃ pācittiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Ubbāhikāyavūpasamanaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "231"
      },
      ". ‘‘Tehi ce, bhikkhave, bhikkhūhi tasmiṃ adhikaraṇe vinicchiyamāne anantāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[anaggāni (sī.)]"
      },
      " ceva bhassāni jāyanti, na cekassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[na cetassa (ka.)]"
      },
      " bhāsitassa attho viññāyati, anujānāmi, bhikkhave, evarūpaṃ adhikaraṇaṃ ubbāhikāya vūpasametuṃ. ‘‘Dasahaṅgehi samannāgato bhikkhu ubbāhikāya sammannitabbo – sīlavā hoti, pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu; bahussuto hoti sutadharo sutasannicayo, ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpassa dhammā bahussutā honti, ",
      " dhātā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[dhatā (sī. syā.)]"
      },
      " vacasā paricitā manasānupekkhitā ",
      " diṭṭhiyā suppaṭividdhā; ubhayāni kho panassa pātimokkhāni vitthārena svāgatāni honti suvibhattāni suppavattīni suvinicchitāni suttaso anubyañjanaso ",
      "; vinaye kho pana ṭhito ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[cheko (ka.)]"
      },
      " hoti asaṃhīro; paṭibalo hoti ubho atthapaccatthike assāsetuṃ saññāpetuṃ nijjhāpetuṃ pekkhetuṃ pasādetuṃ; adhikaraṇasamuppādavūpasamanakusalo hoti; adhikaraṇaṃ jānāti; adhikaraṇasamudayaṃ jānāti; adhikaraṇanirodhaṃ jānāti; adhikaraṇanirodhagāminipaṭipadaṃ jānāti. Anujānāmi, bhikkhave, imehi dasahaṅgehi samannāgataṃ bhikkhuṃ ubbāhikāya sammannituṃ. Evañca ",
      " pana, bhikkhave, sammannitabbo. Paṭhamaṃ bhikkhu yācitabbo, yācitvā byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
    ],
    "innerText": "231. ‘‘Tehi ce, bhikkhave, bhikkhūhi tasmiṃ adhikaraṇe vinicchiyamāne anantāni [anaggāni (sī.)] ceva bhassāni jāyanti, na cekassa [na cetassa (ka.)] bhāsitassa attho viññāyati, anujānāmi, bhikkhave, evarūpaṃ adhikaraṇaṃ ubbāhikāya vūpasametuṃ. ‘‘Dasahaṅgehi samannāgato bhikkhu ubbāhikāya sammannitabbo – sīlavā hoti, pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu; bahussuto hoti sutadharo sutasannicayo, ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpassa dhammā bahussutā honti, dhātā [dhatā (sī. syā.)] vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā; ubhayāni kho panassa pātimokkhāni vitthārena svāgatāni honti suvibhattāni suppavattīni suvinicchitāni suttaso anubyañjanaso ; vinaye kho pana ṭhito [cheko (ka.)] hoti asaṃhīro; paṭibalo hoti ubho atthapaccatthike assāsetuṃ saññāpetuṃ nijjhāpetuṃ pekkhetuṃ pasādetuṃ; adhikaraṇasamuppādavūpasamanakusalo hoti; adhikaraṇaṃ jānāti; adhikaraṇasamudayaṃ jānāti; adhikaraṇanirodhaṃ jānāti; adhikaraṇanirodhagāminipaṭipadaṃ jānāti. Anujānāmi, bhikkhave, imehi dasahaṅgehi samannāgataṃ bhikkhuṃ ubbāhikāya sammannituṃ. Evañca pana, bhikkhave, sammannitabbo. Paṭhamaṃ bhikkhu yācitabbo, yācitvā byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "232"
      },
      ". ‘‘Suṇātu me, bhante, saṅgho. Amhākaṃ imasmiṃ adhikaraṇe vinicchiyamāne anantāni ceva bhassāni jāyanti, na cekassa bhāsitassa attho viññāyati. Yadi saṅghassa pattakallaṃ, saṅgho itthannāmañca itthannāmañca bhikkhuṃ sammanneyya ubbāhikāya imaṃ adhikaraṇaṃ vūpasametuṃ. Esā ñatti."
    ],
    "innerText": "232. ‘‘Suṇātu me, bhante, saṅgho. Amhākaṃ imasmiṃ adhikaraṇe vinicchiyamāne anantāni ceva bhassāni jāyanti, na cekassa bhāsitassa attho viññāyati. Yadi saṅghassa pattakallaṃ, saṅgho itthannāmañca itthannāmañca bhikkhuṃ sammanneyya ubbāhikāya imaṃ adhikaraṇaṃ vūpasametuṃ. Esā ñatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu me, bhante, saṅgho. Amhākaṃ imasmiṃ adhikaraṇe vinicchiyamāne anantāni ceva bhassāni jāyanti, na cekassa bhāsitassa attho viññāyati. Saṅgho itthannāmañca itthannāmañca bhikkhuṃ sammannati ubbāhikāya imaṃ adhikaraṇaṃ ",
      " vūpasametuṃ. Yassāyasmato khamati itthannāmassa ca itthannāmassa ca bhikkhuno sammuti ubbāhikāya imaṃ adhikaraṇaṃ vūpasametuṃ, so tuṇhassa; yassa nakkhamati, so bhāseyya."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Amhākaṃ imasmiṃ adhikaraṇe vinicchiyamāne anantāni ceva bhassāni jāyanti, na cekassa bhāsitassa attho viññāyati. Saṅgho itthannāmañca itthannāmañca bhikkhuṃ sammannati ubbāhikāya imaṃ adhikaraṇaṃ vūpasametuṃ. Yassāyasmato khamati itthannāmassa ca itthannāmassa ca bhikkhuno sammuti ubbāhikāya imaṃ adhikaraṇaṃ vūpasametuṃ, so tuṇhassa; yassa nakkhamati, so bhāseyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sammato saṅghena itthannāmo ca itthannāmo ca bhikkhu ubbāhikāya imaṃ adhikaraṇaṃ vūpasametuṃ. Khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Te ce, bhikkhave, bhikkhū sakkonti taṃ adhikaraṇaṃ ubbāhikāya vūpasametuṃ, idaṃ vuccati, bhikkhave, adhikaraṇaṃ vūpasantaṃ. Kena vūpasantaṃ? Sammukhāvinayena. Kiñca tattha sammukhāvinayasmiṃ? Dhammasammukhatā, vinayasammukhatā, puggalasammukhatā…pe… evaṃ vūpasantaṃ ce, bhikkhave, adhikaraṇaṃ kārako ukkoṭeti, ukkoṭanakaṃ pācittiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "233"
      },
      ". ‘‘Tehi ce, bhikkhave, bhikkhūhi tasmiṃ adhikaraṇe vinicchiyamāne tatrāssa bhikkhu dhammakathiko, tassa neva suttaṃ āgataṃ hoti, no suttavibhaṅgo, so atthaṃ asallakkhento ",
      " byañjanacchāyāya atthaṃ paṭibāhati, byattena bhikkhunā paṭibalena te bhikkhū ñāpetabbā –"
    ],
    "innerText": "233. ‘‘Tehi ce, bhikkhave, bhikkhūhi tasmiṃ adhikaraṇe vinicchiyamāne tatrāssa bhikkhu dhammakathiko, tassa neva suttaṃ āgataṃ hoti, no suttavibhaṅgo, so atthaṃ asallakkhento byañjanacchāyāya atthaṃ paṭibāhati, byattena bhikkhunā paṭibalena te bhikkhū ñāpetabbā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇantu me āyasmantā. Ayaṃ itthannāmo bhikkhu dhammakathiko. Imassa neva suttaṃ āgataṃ hoti, no suttavibhaṅgo. So atthaṃ asallakkhento byañjanacchāyāya atthaṃ paṭibāhati. Yadāyasmantānaṃ pattakallaṃ ",
      ", itthannāmaṃ bhikkhuṃ ",
      " vuṭṭhāpetvā avasesā imaṃ ",
      " adhikaraṇaṃ vūpasameyyāmāti."
    ],
    "innerText": "‘‘Suṇantu me āyasmantā. Ayaṃ itthannāmo bhikkhu dhammakathiko. Imassa neva suttaṃ āgataṃ hoti, no suttavibhaṅgo. So atthaṃ asallakkhento byañjanacchāyāya atthaṃ paṭibāhati. Yadāyasmantānaṃ pattakallaṃ , itthannāmaṃ bhikkhuṃ vuṭṭhāpetvā avasesā imaṃ adhikaraṇaṃ vūpasameyyāmāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Te ce, bhikkhave, bhikkhū taṃ bhikkhuṃ vuṭṭhāpetvā sakkonti taṃ adhikaraṇaṃ vūpasametuṃ, idaṃ vuccati, bhikkhave, adhikaraṇaṃ vūpasantaṃ. Kena vūpasantaṃ? Sammukhāvinayena. Kiñca tattha sammukhāvinayasmiṃ? Dhammasammukhatā, vinayasammukhatā, puggalasammukhatā…pe… evaṃ vūpasantaṃ ce, bhikkhave, adhikaraṇaṃ kārako ukkoṭeti, ukkoṭanakaṃ pācittiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Tehi ce, bhikkhave, bhikkhūhi tasmiṃ adhikaraṇe vinicchiyamāne tatrāssa bhikkhu dhammakathiko, tassa suttañhi kho āgataṃ hoti, no suttavibhaṅgo, so atthaṃ asallakkhento byañjanacchāyāya atthaṃ paṭibāhati, byattena bhikkhunā paṭibalena te bhikkhū ñāpetabbā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Suṇantu me āyasmantā. Ayaṃ itthannāmo bhikkhu dhammakathiko. Imassa suttañhi kho āgataṃ hoti, no suttavibhaṅgo. So atthaṃ asallakkhento byañjanacchāyāya atthaṃ paṭibāhati. Yadāyasmantānaṃ pattakallaṃ, itthannāmaṃ bhikkhuṃ vuṭṭhāpetvā avasesā imaṃ adhikaraṇaṃ vūpasameyyāmāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Te ce, bhikkhave, bhikkhū taṃ bhikkhuṃ vuṭṭhāpetvā sakkonti taṃ adhikaraṇaṃ vūpasametuṃ, idaṃ vuccati, bhikkhave, adhikaraṇaṃ vūpasantaṃ. Kena vūpasantaṃ? Sammukhāvinayena. Kiñca tattha sammukhāvinayasmiṃ? Dhammasammukhatā, vinayasammukhatā, puggalasammukhatā…pe… evaṃ vūpasantaṃ ce, bhikkhave, adhikaraṇaṃ kārako ukkoṭeti, ukkoṭanakaṃ pācittiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Yebhuyyasikāvinayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "234"
      },
      ". ‘‘Te ce, bhikkhave, bhikkhū na sakkonti taṃ adhikaraṇaṃ ubbāhikāya ",
      " vūpasametuṃ, tehi, bhikkhave, bhikkhūhi taṃ adhikaraṇaṃ saṅghassa niyyādetabbaṃ – ‘na mayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[na ca mayaṃ (ka.)]"
      },
      ", bhante, sakkoma ",
      " imaṃ adhikaraṇaṃ ubbāhikāya vūpasametuṃ, saṅghova imaṃ adhikaraṇaṃ vūpasametū’ti. Anujānāmi, bhikkhave, evarūpaṃ adhikaraṇaṃ yebhuyyasikāya vūpasametuṃ. Pañcahaṅgehi samannāgato bhikkhu salākaggāhāpako sammannitabbo – yo na chandāgatiṃ gaccheyya, na ",
      " dosāgatiṃ gaccheyya, na mohāgatiṃ gaccheyya, na bhayāgatiṃ gaccheyya, gahitāgahitañca jāneyya…pe… evañca pana, bhikkhave, sammannitabbo. Paṭhamaṃ bhikkhu yācitabbo, yācitvā byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
    ],
    "innerText": "234. ‘‘Te ce, bhikkhave, bhikkhū na sakkonti taṃ adhikaraṇaṃ ubbāhikāya vūpasametuṃ, tehi, bhikkhave, bhikkhūhi taṃ adhikaraṇaṃ saṅghassa niyyādetabbaṃ – ‘na mayaṃ [na ca mayaṃ (ka.)], bhante, sakkoma imaṃ adhikaraṇaṃ ubbāhikāya vūpasametuṃ, saṅghova imaṃ adhikaraṇaṃ vūpasametū’ti. Anujānāmi, bhikkhave, evarūpaṃ adhikaraṇaṃ yebhuyyasikāya vūpasametuṃ. Pañcahaṅgehi samannāgato bhikkhu salākaggāhāpako sammannitabbo – yo na chandāgatiṃ gaccheyya, na dosāgatiṃ gaccheyya, na mohāgatiṃ gaccheyya, na bhayāgatiṃ gaccheyya, gahitāgahitañca jāneyya…pe… evañca pana, bhikkhave, sammannitabbo. Paṭhamaṃ bhikkhu yācitabbo, yācitvā byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Yadi saṅghassa pattakallaṃ, saṅgho itthannāmaṃ bhikkhuṃ salākaggāhāpakaṃ sammanneyya. Esā ñatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Saṅgho itthannāmaṃ bhikkhuṃ salākaggāhāpakaṃ sammannati. Yassāyasmato khamati itthannāmassa bhikkhuno salākaggāhāpakassa sammuti, so tuṇhassa; yassa nakkhamati, so bhāseyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sammato saṅghena itthannāmo bhikkhu salākaggāhāpako. Khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tena salākaggāhāpakena bhikkhunā salākā gāhetabbā. Yathā bahutarā bhikkhū dhammavādino vadanti tathā taṃ adhikaraṇaṃ vūpasametabbaṃ. Idaṃ vuccati, bhikkhave, adhikaraṇaṃ vūpasantaṃ. Kena vūpasantaṃ? Sammukhāvinayena ca, yebhuyyasikāya ca. Kiñca tattha sammukhāvinayasmiṃ? Saṅghasammukhatā, dhammasammukhatā, vinayasammukhatā, puggalasammukhatā. Kā ca tattha saṅghasammukhatā? Yāvatikā bhikkhū kammappattā te āgatā honti, chandārahānaṃ chando āhaṭo hoti, sammukhībhūtā na paṭikkosanti – ayaṃ tattha saṅghasammukhatā. Kā ca tattha dhammasammukhatā, vinayasammukhatā? Yena dhammena yena vinayena yena satthusāsanena taṃ adhikaraṇaṃ vūpasammati – ayaṃ tattha dhammasammukhatā, vinayasammukhatā ",
      ". Kā ca tattha puggalasammukhatā? Yo ca vivadati, yena ca vivadati, ubho atthapaccatthikā sammukhībhūtā honti – ayaṃ tattha puggalasammukhatā. Kā ca tattha yebhuyyasikāya? Yā yebhuyyasikākammassa kiriyā karaṇaṃ upagamanaṃ ajjhupagamanaṃ adhivāsanā appaṭikkosanā – ayaṃ tattha yebhuyyasikāya. Evaṃ vūpasantaṃ ce, bhikkhave, adhikaraṇaṃ kārako ukkoṭeti, ukkoṭanakaṃ pācittiyaṃ; chandadāyako khīyati, khīyanakaṃ pācittiya’’nti."
    ],
    "innerText": "‘‘Tena salākaggāhāpakena bhikkhunā salākā gāhetabbā. Yathā bahutarā bhikkhū dhammavādino vadanti tathā taṃ adhikaraṇaṃ vūpasametabbaṃ. Idaṃ vuccati, bhikkhave, adhikaraṇaṃ vūpasantaṃ. Kena vūpasantaṃ? Sammukhāvinayena ca, yebhuyyasikāya ca. Kiñca tattha sammukhāvinayasmiṃ? Saṅghasammukhatā, dhammasammukhatā, vinayasammukhatā, puggalasammukhatā. Kā ca tattha saṅghasammukhatā? Yāvatikā bhikkhū kammappattā te āgatā honti, chandārahānaṃ chando āhaṭo hoti, sammukhībhūtā na paṭikkosanti – ayaṃ tattha saṅghasammukhatā. Kā ca tattha dhammasammukhatā, vinayasammukhatā? Yena dhammena yena vinayena yena satthusāsanena taṃ adhikaraṇaṃ vūpasammati – ayaṃ tattha dhammasammukhatā, vinayasammukhatā . Kā ca tattha puggalasammukhatā? Yo ca vivadati, yena ca vivadati, ubho atthapaccatthikā sammukhībhūtā honti – ayaṃ tattha puggalasammukhatā. Kā ca tattha yebhuyyasikāya? Yā yebhuyyasikākammassa kiriyā karaṇaṃ upagamanaṃ ajjhupagamanaṃ adhivāsanā appaṭikkosanā – ayaṃ tattha yebhuyyasikāya. Evaṃ vūpasantaṃ ce, bhikkhave, adhikaraṇaṃ kārako ukkoṭeti, ukkoṭanakaṃ pācittiyaṃ; chandadāyako khīyati, khīyanakaṃ pācittiya’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Tividhasalākaggāho"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "235"
      },
      ". Tena ",
      " kho pana samayena sāvatthiyā evaṃ jātaṃ evaṃ samuppannaṃ adhikaraṇaṃ hoti. Atha kho te bhikkhū – asantuṭṭhā sāvatthiyā saṅghassa adhikaraṇavūpasamanena – assosuṃ kho amukasmiṃ kira āvāse sambahulā therā viharanti bahussutā āgatāgamā dhammadharā vinayadharā mātikādharā paṇḍitā viyattā medhāvino lajjino kukkuccakā sikkhākāmā. Te ce therā imaṃ adhikaraṇaṃ vūpasameyyuṃ dhammena vinayena satthusāsanena, evamidaṃ adhikaraṇaṃ suvūpasantaṃ assāti. Atha kho te bhikkhū taṃ āvāsaṃ gantvā te there etadavocuṃ – ‘‘idaṃ, bhante, adhikaraṇaṃ evaṃ jātaṃ, evaṃ samuppannaṃ. Sādhu, bhante, therā imaṃ adhikaraṇaṃ vūpasamentu dhammena vinayena satthusāsanena, yathayidaṃ adhikaraṇaṃ suvūpasantaṃ assā’’ti. Atha kho te therā – yathā sāvatthiyā saṅghena adhikaraṇaṃ vūpasamitaṃ tathā suvūpasantanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yathā suvūpasantaṃ (sī. syā.)]"
      },
      " – tathā taṃ adhikaraṇaṃ vūpasamesuṃ ",
      "."
    ],
    "innerText": "235. Tena kho pana samayena sāvatthiyā evaṃ jātaṃ evaṃ samuppannaṃ adhikaraṇaṃ hoti. Atha kho te bhikkhū – asantuṭṭhā sāvatthiyā saṅghassa adhikaraṇavūpasamanena – assosuṃ kho amukasmiṃ kira āvāse sambahulā therā viharanti bahussutā āgatāgamā dhammadharā vinayadharā mātikādharā paṇḍitā viyattā medhāvino lajjino kukkuccakā sikkhākāmā. Te ce therā imaṃ adhikaraṇaṃ vūpasameyyuṃ dhammena vinayena satthusāsanena, evamidaṃ adhikaraṇaṃ suvūpasantaṃ assāti. Atha kho te bhikkhū taṃ āvāsaṃ gantvā te there etadavocuṃ – ‘‘idaṃ, bhante, adhikaraṇaṃ evaṃ jātaṃ, evaṃ samuppannaṃ. Sādhu, bhante, therā imaṃ adhikaraṇaṃ vūpasamentu dhammena vinayena satthusāsanena, yathayidaṃ adhikaraṇaṃ suvūpasantaṃ assā’’ti. Atha kho te therā – yathā sāvatthiyā saṅghena adhikaraṇaṃ vūpasamitaṃ tathā suvūpasantanti [yathā suvūpasantaṃ (sī. syā.)] – tathā taṃ adhikaraṇaṃ vūpasamesuṃ ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha kho te bhikkhū – asantuṭṭhā sāvatthiyā saṅghassa adhikaraṇavūpasamanena, asantuṭṭhā sambahulānaṃ therānaṃ adhikaraṇavūpasamanena – assosuṃ kho amukasmiṃ kira āvāse tayo therā viharanti…pe… dve therā viharanti…pe… eko thero viharati bahussuto āgatāgamo dhammadharo vinayadharo mātikādharo paṇḍito viyatto medhāvī lajjī kukkuccako sikkhākāmo. So ce thero imaṃ adhikaraṇaṃ vūpasameyya dhammena vinayena satthusāsanena, evamidaṃ adhikaraṇaṃ suvūpasantaṃ assāti. Atha kho te bhikkhū taṃ āvāsaṃ gantvā taṃ theraṃ etadavocuṃ – ‘‘idaṃ, bhante, adhikaraṇaṃ evaṃ jātaṃ, evaṃ samuppannaṃ. Sādhu, bhante, thero imaṃ adhikaraṇaṃ vūpasametu dhammena vinayena satthusāsanena, yathayidaṃ adhikaraṇaṃ suvūpasantaṃ assā’’ti. Atha kho so thero – yathā sāvatthiyā saṅghena adhikaraṇaṃ vūpasamitaṃ, yathā sambahulehi therehi adhikaraṇaṃ vūpasamitaṃ, yathā tīhi therehi adhikaraṇaṃ vūpasamitaṃ, yathā dvīhi therehi adhikaraṇaṃ vūpasamitaṃ, tathā suvūpasantanti – tathā taṃ adhikaraṇaṃ vūpasamesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " kho te bhikkhū asantuṭṭhā sāvatthiyā saṅghassa adhikaraṇavūpasamanena, asantuṭṭhā sambahulānaṃ therānaṃ adhikaraṇavūpasamanena, asantuṭṭhā tiṇṇaṃ therānaṃ adhikaraṇavūpasamanena, asantuṭṭhā dvinnaṃ therānaṃ adhikaraṇavūpasamanena, asantuṭṭhā ekassa therassa adhikaraṇavūpasamanena, yena bhagavā tenupasaṅkamiṃsu, upasaṅkamitvā bhagavato etamatthaṃ ārocesuṃ…pe… ",
      " ‘‘nihatametaṃ, bhikkhave, adhikaraṇaṃ santaṃ vūpasantaṃ suvūpasantaṃ. Anujānāmi, bhikkhave, tesaṃ bhikkhūnaṃ saññattiyā tayo salākaggāhe – gūḷhakaṃ, sakaṇṇajappakaṃ, vivaṭakaṃ."
    ],
    "innerText": "Atha kho te bhikkhū asantuṭṭhā sāvatthiyā saṅghassa adhikaraṇavūpasamanena, asantuṭṭhā sambahulānaṃ therānaṃ adhikaraṇavūpasamanena, asantuṭṭhā tiṇṇaṃ therānaṃ adhikaraṇavūpasamanena, asantuṭṭhā dvinnaṃ therānaṃ adhikaraṇavūpasamanena, asantuṭṭhā ekassa therassa adhikaraṇavūpasamanena, yena bhagavā tenupasaṅkamiṃsu, upasaṅkamitvā bhagavato etamatthaṃ ārocesuṃ…pe… ‘‘nihatametaṃ, bhikkhave, adhikaraṇaṃ santaṃ vūpasantaṃ suvūpasantaṃ. Anujānāmi, bhikkhave, tesaṃ bhikkhūnaṃ saññattiyā tayo salākaggāhe – gūḷhakaṃ, sakaṇṇajappakaṃ, vivaṭakaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca ",
      ", bhikkhave, gūḷhako salākaggāho hoti? Tena salākaggāhāpakena bhikkhunā ",
      " salākāyo vaṇṇāvaṇṇāyo katvā ekameko bhikkhu upasaṅkamitvā evamassa vacanīyo – ‘ayaṃ evaṃvādissa salākā, ayaṃ evaṃvādissa salākā. Yaṃ icchasi taṃ gaṇhāhī’ti. Gahite vattabbo – ‘mā ca kassaci dassehī’ti. Sace jānāti – adhammavādī bahutarāti, duggahoti, paccukkaḍḍhitabbaṃ. Sace jānāti – dhammavādī bahutarāti, suggahoti, sāvetabbaṃ. Evaṃ kho, bhikkhave, gūḷhako salākaggāho hoti."
    ],
    "innerText": "‘‘Kathañca , bhikkhave, gūḷhako salākaggāho hoti? Tena salākaggāhāpakena bhikkhunā salākāyo vaṇṇāvaṇṇāyo katvā ekameko bhikkhu upasaṅkamitvā evamassa vacanīyo – ‘ayaṃ evaṃvādissa salākā, ayaṃ evaṃvādissa salākā. Yaṃ icchasi taṃ gaṇhāhī’ti. Gahite vattabbo – ‘mā ca kassaci dassehī’ti. Sace jānāti – adhammavādī bahutarāti, duggahoti, paccukkaḍḍhitabbaṃ. Sace jānāti – dhammavādī bahutarāti, suggahoti, sāvetabbaṃ. Evaṃ kho, bhikkhave, gūḷhako salākaggāho hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kathañca, bhikkhave, sakaṇṇajappako salākaggāho hoti? Tena salākaggāhāpakena bhikkhunā ekamekassa bhikkhuno upakaṇṇake ārocetabbaṃ – ‘ayaṃ evaṃvādissa salākā, ayaṃ evaṃvādissa salākā. Yaṃ icchasi taṃ gaṇhāhī’ti. Gahite vattabbo – ‘mā ca kassaci ārocehī’ti. Sace jānāti – adhammavādī bahutarāti, duggahoti, paccukkaḍḍhitabbaṃ. Sace jānāti – dhammavādī bahutarāti, suggahoti, sāvetabbaṃ. Evaṃ kho, bhikkhave, sakaṇṇajappako salākaggāho hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kathañca, bhikkhave, vivaṭako salākaggāho hoti? Sace jānāti – dhammavādī bahutarāti, vissaṭṭheneva vivaṭena gāhetabbo ",
      ". Evaṃ kho, bhikkhave, vivaṭako salākaggāho hoti. Ime kho, bhikkhave, tayo salākaggāhā’’ti."
    ],
    "innerText": "‘‘Kathañca, bhikkhave, vivaṭako salākaggāho hoti? Sace jānāti – dhammavādī bahutarāti, vissaṭṭheneva vivaṭena gāhetabbo . Evaṃ kho, bhikkhave, vivaṭako salākaggāho hoti. Ime kho, bhikkhave, tayo salākaggāhā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Sativinayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "236"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pari. 292-293, 307 ādayo]"
      },
      " ‘‘Anuvādādhikaraṇaṃ ",
      " katihi samathehi sammati? Anuvādādhikaraṇaṃ catūhi samathehi sammati – sammukhāvinayena ca, sativinayena ca, amūḷhavinayena ca, tassapāpiyasikāya ca. Siyā anuvādādhikaraṇaṃ dve samathe anāgamma – amūḷhavinayañca, tassapāpiyasikañca; dvīhi samathehi sammeyya – sammukhāvinayena ca, sativinayena cāti? Siyātissa vacanīyaṃ. Yathā kathaṃ viya? Idha pana, bhikkhave, bhikkhū bhikkhuṃ amūlikāya sīlavipattiyā anuddhaṃsenti. Tassa kho, bhikkhave ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[tassa kho taṃ bhikkhave (syā. ka.)]"
      },
      ", bhikkhuno sativepullappattassa sativinayo dātabbo. Evañca pana, bhikkhave, dātabbo –"
    ],
    "innerText": "236.[pari. 292-293, 307 ādayo] ‘‘Anuvādādhikaraṇaṃ katihi samathehi sammati? Anuvādādhikaraṇaṃ catūhi samathehi sammati – sammukhāvinayena ca, sativinayena ca, amūḷhavinayena ca, tassapāpiyasikāya ca. Siyā anuvādādhikaraṇaṃ dve samathe anāgamma – amūḷhavinayañca, tassapāpiyasikañca; dvīhi samathehi sammeyya – sammukhāvinayena ca, sativinayena cāti? Siyātissa vacanīyaṃ. Yathā kathaṃ viya? Idha pana, bhikkhave, bhikkhū bhikkhuṃ amūlikāya sīlavipattiyā anuddhaṃsenti. Tassa kho, bhikkhave [tassa kho taṃ bhikkhave (syā. ka.)], bhikkhuno sativepullappattassa sativinayo dātabbo. Evañca pana, bhikkhave, dātabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tena, bhikkhave, bhikkhunā saṅghaṃ upasaṅkamitvā ekaṃsaṃ uttarāsaṅga karitvā…pe… evamassa vacanīyo – ‘maṃ, bhante, bhikkhū amūlikāya sīlavipattiyā anuddhaṃsenti. Sohaṃ, bhante ",
      ", sativepullappatto saṅghaṃ sativinayaṃ yācāmī’ti. Dutiyampi yācitabbo. Tatiyampi yācitabbo. Byattenaṃ bhikkhunā paṭibalena saṅgho ñāpetabbo –"
    ],
    "innerText": "‘‘Tena, bhikkhave, bhikkhunā saṅghaṃ upasaṅkamitvā ekaṃsaṃ uttarāsaṅga karitvā…pe… evamassa vacanīyo – ‘maṃ, bhante, bhikkhū amūlikāya sīlavipattiyā anuddhaṃsenti. Sohaṃ, bhante , sativepullappatto saṅghaṃ sativinayaṃ yācāmī’ti. Dutiyampi yācitabbo. Tatiyampi yācitabbo. Byattenaṃ bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu me, bhante, saṅgho. Bhikkhū itthannāmaṃ bhikkhuṃ amūlikāya sīlavipattiyā anuddhaṃsenti. So sativepullappatto saṅghaṃ sativinayaṃ yācati ",
      ". Yadi saṅghassa pattakallaṃ, saṅgho itthannāmassa bhikkhuno sativepullappattassa ",
      " sativinayaṃ dadeyya. Esā ñatti."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Bhikkhū itthannāmaṃ bhikkhuṃ amūlikāya sīlavipattiyā anuddhaṃsenti. So sativepullappatto saṅghaṃ sativinayaṃ yācati . Yadi saṅghassa pattakallaṃ, saṅgho itthannāmassa bhikkhuno sativepullappattassa sativinayaṃ dadeyya. Esā ñatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Bhikkhū itthannāmaṃ bhikkhuṃ amūlikāya sīlavipattiyā anuddhaṃsenti. So sativepullappatto saṅghaṃ sativinayaṃ yācati. Saṅgho itthannāmassa bhikkhuno sativepullappattassa sativinayaṃ deti. Yassāyasmato khamati itthannāmassa bhikkhuno sativepullappattassa sativinayassa dānaṃ, so tuṇhassa; yassa nakkhamati, so bhāseyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Dutiyampi etamatthaṃ vadāmi…pe… tatiyampi etamatthaṃ vadāmi…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Dinno saṅghena itthannāmassa bhikkhuno sativepullappattassa sativinayo. Khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idaṃ vuccati, bhikkhave, adhikaraṇaṃ vūpasantaṃ. Kena vūpasantaṃ? Sammukhāvinayena ca sativinayena ca. Kiñca tattha sammukhāvinayasmiṃ? Saṅghasammukhatā, dhammasammukhatā ",
      ", vinayasammukhatā, puggalasammukhatā…pe… kā ca tattha puggalasammukhatā? Yo ca anuvadati, yañca anuvadati, ubho sammukhībhūtā honti – ayaṃ tattha puggalasammukhatā. Kiñca tattha sativinayasmiṃ? Yā sativinayassa kammassa kiriyā karaṇaṃ upagamanaṃ ajjhupagamanaṃ adhivāsanā appaṭikkosanā – idaṃ tattha sativinayasmiṃ. Evaṃ vūpasantaṃ ce, bhikkhave, adhikaraṇaṃ kārako ukkoṭeti, ukkoṭanakaṃ pācittiyaṃ; chandadāyako khīyati, khīyanakaṃ pācittiyaṃ."
    ],
    "innerText": "‘‘Idaṃ vuccati, bhikkhave, adhikaraṇaṃ vūpasantaṃ. Kena vūpasantaṃ? Sammukhāvinayena ca sativinayena ca. Kiñca tattha sammukhāvinayasmiṃ? Saṅghasammukhatā, dhammasammukhatā , vinayasammukhatā, puggalasammukhatā…pe… kā ca tattha puggalasammukhatā? Yo ca anuvadati, yañca anuvadati, ubho sammukhībhūtā honti – ayaṃ tattha puggalasammukhatā. Kiñca tattha sativinayasmiṃ? Yā sativinayassa kammassa kiriyā karaṇaṃ upagamanaṃ ajjhupagamanaṃ adhivāsanā appaṭikkosanā – idaṃ tattha sativinayasmiṃ. Evaṃ vūpasantaṃ ce, bhikkhave, adhikaraṇaṃ kārako ukkoṭeti, ukkoṭanakaṃ pācittiyaṃ; chandadāyako khīyati, khīyanakaṃ pācittiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Amūḷhavinayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "237"
      },
      ". ‘‘Siyā anuvādādhikaraṇaṃ dve samathe anāgamma – sativinayañca, tassapāpiyasikañca; dvīhi samathehi sammeyya – sammukhāvinayena ca, amūḷhavinayena ",
      " cāti? Siyātissa vacanīyaṃ. Yathā kathaṃ viya? Idha pana, bhikkhave, bhikkhu ummattako hoti cittavipariyāsakato ",
      ". Tena ummattakena cittavipariyāsakatena bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ hoti bhāsitaparikkantaṃ. Taṃ bhikkhū ummattakena cittavipariyāsakatena ajjhāciṇṇena āpattiyā codenti – ‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’ti. So evaṃ vadeti – ‘ahaṃ kho, āvuso, ummattako ahosiṃ cittavipariyāsakato. Tena me ummattakena cittavipariyāsakatena bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Nāhaṃ taṃ sarāmi. Mūḷhena me etaṃ kata’nti. Evampi naṃ vuccamānā codenteva – ‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’ti. ‘‘Tassa kho, bhikkhave, bhikkhuno amūḷhassa amūḷhavinayo dātabbo. Evañca pana, bhikkhave, dātabbo –"
    ],
    "innerText": "237. ‘‘Siyā anuvādādhikaraṇaṃ dve samathe anāgamma – sativinayañca, tassapāpiyasikañca; dvīhi samathehi sammeyya – sammukhāvinayena ca, amūḷhavinayena cāti? Siyātissa vacanīyaṃ. Yathā kathaṃ viya? Idha pana, bhikkhave, bhikkhu ummattako hoti cittavipariyāsakato . Tena ummattakena cittavipariyāsakatena bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ hoti bhāsitaparikkantaṃ. Taṃ bhikkhū ummattakena cittavipariyāsakatena ajjhāciṇṇena āpattiyā codenti – ‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’ti. So evaṃ vadeti – ‘ahaṃ kho, āvuso, ummattako ahosiṃ cittavipariyāsakato. Tena me ummattakena cittavipariyāsakatena bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Nāhaṃ taṃ sarāmi. Mūḷhena me etaṃ kata’nti. Evampi naṃ vuccamānā codenteva – ‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’ti. ‘‘Tassa kho, bhikkhave, bhikkhuno amūḷhassa amūḷhavinayo dātabbo. Evañca pana, bhikkhave, dātabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tena, bhikkhave, bhikkhunā saṅghaṃ upasaṅkamitvā ekaṃsaṃ uttarāsaṅgaṃ karitvā…pe… evamassa vacanīyo – ‘ahaṃ, bhante, ummattako ahosiṃ cittavipariyāsakato. Tena me ummattakena cittavipariyāsakatena bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Maṃ bhikkhū ummattakena cittavipariyāsakatena ajjhāciṇṇena āpattiyā codenti – ‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’ti. Tyāhaṃ evaṃ vadāmi – ‘ahaṃ kho, āvuso, ummattako ahosiṃ cittavipariyāsakato. Tena me ummattakena cittavipariyāsakatena bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Nāhaṃ taṃ sarāmi. Mūḷhena me etaṃ kata’nti ",
      ". Evampi maṃ vuccamānā codenteva – ‘saratāyasmā ",
      " evarūpiṃ āpattiṃ āpajjitā’ti. ‘Sohaṃ, bhante, amūḷho saṅghaṃ amūḷhavinayaṃ yācāmī’ti. Dutiyampi yācitabbo. Tatiyampi yācitabbo. Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
    ],
    "innerText": "‘‘Tena, bhikkhave, bhikkhunā saṅghaṃ upasaṅkamitvā ekaṃsaṃ uttarāsaṅgaṃ karitvā…pe… evamassa vacanīyo – ‘ahaṃ, bhante, ummattako ahosiṃ cittavipariyāsakato. Tena me ummattakena cittavipariyāsakatena bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Maṃ bhikkhū ummattakena cittavipariyāsakatena ajjhāciṇṇena āpattiyā codenti – ‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’ti. Tyāhaṃ evaṃ vadāmi – ‘ahaṃ kho, āvuso, ummattako ahosiṃ cittavipariyāsakato. Tena me ummattakena cittavipariyāsakatena bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Nāhaṃ taṃ sarāmi. Mūḷhena me etaṃ kata’nti . Evampi maṃ vuccamānā codenteva – ‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’ti. ‘Sohaṃ, bhante, amūḷho saṅghaṃ amūḷhavinayaṃ yācāmī’ti. Dutiyampi yācitabbo. Tatiyampi yācitabbo. Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Ayaṃ itthannāmo bhikkhu ummattako ahosi cittavipariyāsakato. Tena ummattakena cittavipariyāsakatena bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Taṃ bhikkhū ummattakena cittavipariyāsakatena ajjhāciṇṇena āpattiyā codenti – ‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’ti. So evaṃ vadeti – ‘ahaṃ kho, āvuso, ummattako ahosiṃ cittavipariyāsakato. Tena me ummattakena cittavipariyāsakatena bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Nāhaṃ taṃ sarāmi. Mūḷhena me etaṃ kata’nti. Evampi naṃ vuccamānā codenteva – ‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’ti. So amūḷho saṅghaṃ amūḷhavinayaṃ yācati. Yadi saṅghassa pattakallaṃ, saṅgho itthannāmassa bhikkhuno amūḷhassa amūḷhavinayaṃ dadeyya. Esā ñatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu ",
      " me, bhante, saṅgho. Ayaṃ itthannāmo bhikkhu ummattako ahosi cittavipariyāsakato. Tena ummattakena cittavipariyāsakatena bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Taṃ bhikkhū ummattakena cittavipariyāsakatena ajjhāciṇṇena āpattiyā codenti – ‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’ti ",
      ". So evaṃ vadeti – ‘ahaṃ kho, āvuso, ummattako ahosiṃ cittavipariyāsakato. Tena me ummattakena cittavipariyāsakatena bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Nāhaṃ taṃ sarāmi. Mūḷhena me etaṃ kata’nti. Evampi naṃ vuccamānā codenteva – ‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’ti. So amūḷho saṅghaṃ amūḷhavinayaṃ yācati. Saṅgho itthannāmassa bhikkhuno amūḷhassa amūḷhavinayaṃ deti. Yassāyasmato khamati itthannāmassa bhikkhuno amūḷhassa amūḷhavinayassa dānaṃ, so tuṇhassa; yassa nakkhamati, so bhāseyya."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Ayaṃ itthannāmo bhikkhu ummattako ahosi cittavipariyāsakato. Tena ummattakena cittavipariyāsakatena bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Taṃ bhikkhū ummattakena cittavipariyāsakatena ajjhāciṇṇena āpattiyā codenti – ‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’ti . So evaṃ vadeti – ‘ahaṃ kho, āvuso, ummattako ahosiṃ cittavipariyāsakato. Tena me ummattakena cittavipariyāsakatena bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Nāhaṃ taṃ sarāmi. Mūḷhena me etaṃ kata’nti. Evampi naṃ vuccamānā codenteva – ‘saratāyasmā evarūpiṃ āpattiṃ āpajjitā’ti. So amūḷho saṅghaṃ amūḷhavinayaṃ yācati. Saṅgho itthannāmassa bhikkhuno amūḷhassa amūḷhavinayaṃ deti. Yassāyasmato khamati itthannāmassa bhikkhuno amūḷhassa amūḷhavinayassa dānaṃ, so tuṇhassa; yassa nakkhamati, so bhāseyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Dutiyampi etamatthaṃ vadāmi…pe… tatiyampi etamatthaṃ vadāmi…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Dinno saṅghena itthannāmassa bhikkhuno amūḷhassa amūḷhavinayo. Khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idaṃ ",
      " vuccati, bhikkhave, adhikaraṇaṃ vūpasantaṃ. Kena vūpasantaṃ? Sammukhāvinayena ca, amūḷhavinayena ca. Kiñca tattha sammukhāvinayasmiṃ? Saṅghasammukhatā, dhammasammukhatā, vinayasammukhatā, puggalasammukhatā…pe… kiñca tattha amūḷhavinayasmiṃ ",
      "? Yā amūḷhavinayassa kammassa kiriyā karaṇaṃ upagamanaṃ ajjhupagamanaṃ adhivāsanā appaṭikkosanā – idaṃ tattha amūḷhavinayasmiṃ. Evaṃ vūpasantaṃ ce, bhikkhave, adhikaraṇaṃ kārako ukkoṭeti, ukkoṭanakaṃ pācittiyaṃ; chandadāyako khīyati, khīyanakaṃ pācittiyaṃ."
    ],
    "innerText": "‘‘Idaṃ vuccati, bhikkhave, adhikaraṇaṃ vūpasantaṃ. Kena vūpasantaṃ? Sammukhāvinayena ca, amūḷhavinayena ca. Kiñca tattha sammukhāvinayasmiṃ? Saṅghasammukhatā, dhammasammukhatā, vinayasammukhatā, puggalasammukhatā…pe… kiñca tattha amūḷhavinayasmiṃ ? Yā amūḷhavinayassa kammassa kiriyā karaṇaṃ upagamanaṃ ajjhupagamanaṃ adhivāsanā appaṭikkosanā – idaṃ tattha amūḷhavinayasmiṃ. Evaṃ vūpasantaṃ ce, bhikkhave, adhikaraṇaṃ kārako ukkoṭeti, ukkoṭanakaṃ pācittiyaṃ; chandadāyako khīyati, khīyanakaṃ pācittiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Tassapāpiyasikāvinayo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "238"
      },
      ". ‘‘Siyā anuvādādhikaraṇaṃ dve samathe anāgamma – sativinayañca, amūḷhavinayañca ",
      "; dvīhi samathehi sammeyya – sammukhāvinayena ca, tassapāpiyasikāya cāti? Siyātissa vacanīyaṃ. Yathā kathaṃ viya? Idha pana, bhikkhave, bhikkhu bhikkhuṃ saṅghamajjhe garukāya āpattiyā codeti – ‘saratāyasmā evarūpiṃ garukaṃ āpattiṃ āpajjitā, pārājikaṃ vā pārājikasāmantaṃ vā’ti. So evaṃ vadeti – ‘na kho ahaṃ, āvuso, sarāmi evarūpiṃ garukaṃ āpattiṃ āpajjitā, pārājikaṃ vā pārājikasāmantaṃ vā’ti. Tamenaṃ so nibbeṭhentaṃ ",
      " ativeṭheti – ‘iṅghāyasmā sādhukameva jānāhi, yadi sarasi evarūpiṃ garukaṃ āpattiṃ āpajjitā, pārājikaṃ vā pārājikasāmantaṃ vā’ti. So evaṃ vadeti – ‘na kho ahaṃ, āvuso, sarāmi evarūpiṃ garukaṃ āpattiṃ āpajjitā, pārājikaṃ vā pārājikasāmantaṃ vā. Sarāmi ca kho ahaṃ, āvuso, evarūpiṃ appamattikaṃ āpattiṃ āpajjitā’ti. Tamenaṃ so nibbeṭhentaṃ ativeṭheti – ‘iṅghāyasmā sādhukameva jānāhi, yadi sarasi evarūpiṃ garukaṃ āpattiṃ āpajjitā, pārājikaṃ vā pārājikasāmantaṃ vā’ti. So evaṃ vadeti – ‘imañhi nāmāhaṃ, āvuso, appamattikaṃ āpattiṃ āpajjitvā apuṭṭho paṭijānissāmi. Kiṃ panāhaṃ evarūpiṃ garukaṃ āpattiṃ āpajjitvā, pārājikaṃ vā pārājikasāmantaṃ vā, puṭṭho na paṭijānissāmī’ti? So evaṃ vadeti – ‘imañhi nāma tvaṃ, āvuso, appamattikaṃ āpattiṃ āpajjitvā apuṭṭho na paṭijānissasi. Kiṃ pana tvaṃ evarūpiṃ ",
      " garukaṃ āpattiṃ āpajjitvā, pārājikaṃ vā pārājikasāmantaṃ vā, apuṭṭho paṭijānissasi? Iṅghāyasmā sādhukameva jānāhi, yadi sarasi evarūpiṃ garukaṃ āpattiṃ āpajjitā, pārājikaṃ vā pārājikasāmantaṃ vā’ti. So evaṃ vadesi – ‘sarāmi kho ahaṃ, āvuso, evarūpiṃ ",
      " garukaṃ āpattiṃ āpajjitā, pārājikaṃ vā pārājikasāmantaṃ vā. Davā me etaṃ vuttaṃ, ravā me etaṃ vuttaṃ – nāhaṃ taṃ sarāmi evarūpiṃ garukaṃ āpattiṃ āpajjitā, pārājikaṃ vā pārājikasāmantaṃ vā’ti. Tassa kho, bhikkhave ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[tassa kho taṃ bhikkhave (ka.) tassa khvataṃ bhikkhave (syā.)]"
      },
      ", bhikkhuno tassapāpiyasikākammaṃ kātabbaṃ. Evañca pana, bhikkhave, kātabbaṃ. Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
    ],
    "innerText": "238. ‘‘Siyā anuvādādhikaraṇaṃ dve samathe anāgamma – sativinayañca, amūḷhavinayañca ; dvīhi samathehi sammeyya – sammukhāvinayena ca, tassapāpiyasikāya cāti? Siyātissa vacanīyaṃ. Yathā kathaṃ viya? Idha pana, bhikkhave, bhikkhu bhikkhuṃ saṅghamajjhe garukāya āpattiyā codeti – ‘saratāyasmā evarūpiṃ garukaṃ āpattiṃ āpajjitā, pārājikaṃ vā pārājikasāmantaṃ vā’ti. So evaṃ vadeti – ‘na kho ahaṃ, āvuso, sarāmi evarūpiṃ garukaṃ āpattiṃ āpajjitā, pārājikaṃ vā pārājikasāmantaṃ vā’ti. Tamenaṃ so nibbeṭhentaṃ ativeṭheti – ‘iṅghāyasmā sādhukameva jānāhi, yadi sarasi evarūpiṃ garukaṃ āpattiṃ āpajjitā, pārājikaṃ vā pārājikasāmantaṃ vā’ti. So evaṃ vadeti – ‘na kho ahaṃ, āvuso, sarāmi evarūpiṃ garukaṃ āpattiṃ āpajjitā, pārājikaṃ vā pārājikasāmantaṃ vā. Sarāmi ca kho ahaṃ, āvuso, evarūpiṃ appamattikaṃ āpattiṃ āpajjitā’ti. Tamenaṃ so nibbeṭhentaṃ ativeṭheti – ‘iṅghāyasmā sādhukameva jānāhi, yadi sarasi evarūpiṃ garukaṃ āpattiṃ āpajjitā, pārājikaṃ vā pārājikasāmantaṃ vā’ti. So evaṃ vadeti – ‘imañhi nāmāhaṃ, āvuso, appamattikaṃ āpattiṃ āpajjitvā apuṭṭho paṭijānissāmi. Kiṃ panāhaṃ evarūpiṃ garukaṃ āpattiṃ āpajjitvā, pārājikaṃ vā pārājikasāmantaṃ vā, puṭṭho na paṭijānissāmī’ti? So evaṃ vadeti – ‘imañhi nāma tvaṃ, āvuso, appamattikaṃ āpattiṃ āpajjitvā apuṭṭho na paṭijānissasi. Kiṃ pana tvaṃ evarūpiṃ garukaṃ āpattiṃ āpajjitvā, pārājikaṃ vā pārājikasāmantaṃ vā, apuṭṭho paṭijānissasi? Iṅghāyasmā sādhukameva jānāhi, yadi sarasi evarūpiṃ garukaṃ āpattiṃ āpajjitā, pārājikaṃ vā pārājikasāmantaṃ vā’ti. So evaṃ vadesi – ‘sarāmi kho ahaṃ, āvuso, evarūpiṃ garukaṃ āpattiṃ āpajjitā, pārājikaṃ vā pārājikasāmantaṃ vā. Davā me etaṃ vuttaṃ, ravā me etaṃ vuttaṃ – nāhaṃ taṃ sarāmi evarūpiṃ garukaṃ āpattiṃ āpajjitā, pārājikaṃ vā pārājikasāmantaṃ vā’ti. Tassa kho, bhikkhave [tassa kho taṃ bhikkhave (ka.) tassa khvataṃ bhikkhave (syā.)], bhikkhuno tassapāpiyasikākammaṃ kātabbaṃ. Evañca pana, bhikkhave, kātabbaṃ. Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Suṇātu me, bhante saṅgho. Ayaṃ itthannāmo bhikkhu saṅghamajjhe garukāya āpattiyā anuyuñjiyamāno avajānitvā paṭijānāti, paṭijānitvā avajānāti, aññenāññaṃ paṭicarati, sampajānamusā bhāsati. Yadi saṅghassa pattakallaṃ, saṅgho itthannāmassa bhikkhuno tassapāpiyasikākammaṃ kareyya. Esā ñatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu me, bhante, saṅgho. Ayaṃ itthannāmo bhikkhu saṅghamajjhe garukāya āpattiyā anuyuñjiyamāno avajānitvā paṭijānāti, paṭijānitvā avajānāti, aññenāññaṃ paṭicarati, sampajānamusā bhāsati. Saṅgho itthannāmassa bhikkhuno tassapāpiyasikākammaṃ ",
      " karoti. Yassāyasmato khamati itthannāmassa bhikkhuno tassapāpiyasikākammassa karaṇaṃ, so tuṇhassa; yassa nakkhamati, so bhāseyya."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Ayaṃ itthannāmo bhikkhu saṅghamajjhe garukāya āpattiyā anuyuñjiyamāno avajānitvā paṭijānāti, paṭijānitvā avajānāti, aññenāññaṃ paṭicarati, sampajānamusā bhāsati. Saṅgho itthannāmassa bhikkhuno tassapāpiyasikākammaṃ karoti. Yassāyasmato khamati itthannāmassa bhikkhuno tassapāpiyasikākammassa karaṇaṃ, so tuṇhassa; yassa nakkhamati, so bhāseyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Dutiyampi etamatthaṃ vadāmi…pe… tatiyampi etamatthaṃ vadāmi…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kataṃ saṅghena itthannāmassa bhikkhuno tassapāpiyasikākammaṃ. Khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idaṃ vuccati, bhikkhave, adhikaraṇaṃ ",
      " vūpasantaṃ. Kena vūpasantaṃ? Sammukhāvinayena ca, tassapāpiyasikāya ca. Kiñca tattha sammukhāvinayasmiṃ? Saṅghasammukhatā, dhammasammukhatā, vinayasammukhatā…pe… kā ca tattha tassapāpiyasikāya? Yā tassapāpiyasikākammassa kiriyā karaṇaṃ upagamanaṃ ajjhupagamanaṃ adhivāsanā appaṭikkosanā – ayaṃ tattha tassapāpiyasikāya. Evaṃ vūpasantaṃ ce, bhikkhave, adhikaraṇaṃ kārako ukkoṭeti, ukkoṭanakaṃ pācittiyaṃ; chandadāyako khīyati, khīyanakaṃ pācittiyaṃ."
    ],
    "innerText": "‘‘Idaṃ vuccati, bhikkhave, adhikaraṇaṃ vūpasantaṃ. Kena vūpasantaṃ? Sammukhāvinayena ca, tassapāpiyasikāya ca. Kiñca tattha sammukhāvinayasmiṃ? Saṅghasammukhatā, dhammasammukhatā, vinayasammukhatā…pe… kā ca tattha tassapāpiyasikāya? Yā tassapāpiyasikākammassa kiriyā karaṇaṃ upagamanaṃ ajjhupagamanaṃ adhivāsanā appaṭikkosanā – ayaṃ tattha tassapāpiyasikāya. Evaṃ vūpasantaṃ ce, bhikkhave, adhikaraṇaṃ kārako ukkoṭeti, ukkoṭanakaṃ pācittiyaṃ; chandadāyako khīyati, khīyanakaṃ pācittiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Paṭiññātakaraṇaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "239"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pari. 295, 306, 308 ādayo]"
      },
      " ‘‘Āpattādhikaraṇaṃ katihi samathehi sammati? Āpattādhikaraṇaṃ tīhi samathehi sammati – sammukhāvinayena ca, paṭiññātakaraṇena ca, tiṇavatthārakena ",
      " ca. Siyā āpattādhikaraṇaṃ ekaṃ samathaṃ anāgamma – tiṇavatthārakaṃ, dvīhi samathehi sammeyya – sammukhāvinayena ca, paṭiññātakaraṇena cāti? Siyātissa vacanīyaṃ. Yathā kathaṃ viya? Idha pana, bhikkhave, bhikkhu lahukaṃ āpattiṃ āpanno hoti. Tena, bhikkhave, bhikkhunā ekaṃ bhikkhuṃ upasaṅkamitvā ekaṃsaṃ uttarāsaṅgaṃ karitvā ukkuṭikaṃ nisīditvā añjaliṃ ",
      " paggahetvā evamassa vacanīyo – ‘ahaṃ, āvuso, itthannāmaṃ āpattiṃ āpanno; taṃ paṭidesemī’ti. Tena vattabbo – ‘passasī’ti? ‘Āma passāmī’ti. ‘Āyatiṃ saṃvareyyāsī’ti."
    ],
    "innerText": "239.[pari. 295, 306, 308 ādayo] ‘‘Āpattādhikaraṇaṃ katihi samathehi sammati? Āpattādhikaraṇaṃ tīhi samathehi sammati – sammukhāvinayena ca, paṭiññātakaraṇena ca, tiṇavatthārakena ca. Siyā āpattādhikaraṇaṃ ekaṃ samathaṃ anāgamma – tiṇavatthārakaṃ, dvīhi samathehi sammeyya – sammukhāvinayena ca, paṭiññātakaraṇena cāti? Siyātissa vacanīyaṃ. Yathā kathaṃ viya? Idha pana, bhikkhave, bhikkhu lahukaṃ āpattiṃ āpanno hoti. Tena, bhikkhave, bhikkhunā ekaṃ bhikkhuṃ upasaṅkamitvā ekaṃsaṃ uttarāsaṅgaṃ karitvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā evamassa vacanīyo – ‘ahaṃ, āvuso, itthannāmaṃ āpattiṃ āpanno; taṃ paṭidesemī’ti. Tena vattabbo – ‘passasī’ti? ‘Āma passāmī’ti. ‘Āyatiṃ saṃvareyyāsī’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idaṃ vuccati, bhikkhave, adhikaraṇaṃ vūpasantaṃ. Kena vūpasantaṃ? Sammukhāvinayena ca, paṭiññātakaraṇena ca. Kiñca tattha sammukhāvinayasmiṃ? Dhammasammukhatā, vinayasammukhatā, puggalasammukhatā…pe… kā ca tattha puggalasammukhatā? Yo ca deseti, yassa ca deseti, ubho sammukhībhūtā honti – ayaṃ tattha puggalasammukhatā. Kiñca tattha paṭiññātakaraṇasmiṃ? Yā paṭiññātakaraṇassa kammassa kiriyā karaṇaṃ upagamanaṃ ajjhupagamanaṃ adhivāsanā appaṭikkosanā – idaṃ tattha paṭiññātakaraṇasmiṃ. Evaṃ vūpasantaṃ ce, bhikkhave, adhikaraṇaṃ paṭiggāhako ukkoṭeti, ukkoṭanakaṃ pācittiyaṃ. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, tena, bhikkhave, bhikkhunā sambahule bhikkhū upasaṅkamitvā ekaṃsaṃ uttarāsaṅgaṃ karitvā vuḍḍhānaṃ ",
      " bhikkhūnaṃ pāde vanditvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā evamassu vacanīyā – ‘ahaṃ, bhante, itthannāmaṃ āpattiṃ āpanno; taṃ paṭidesemī’ti. Byattena bhikkhunā ",
      " paṭibalena te bhikkhū ñāpetabbā –"
    ],
    "innerText": "‘‘Idaṃ vuccati, bhikkhave, adhikaraṇaṃ vūpasantaṃ. Kena vūpasantaṃ? Sammukhāvinayena ca, paṭiññātakaraṇena ca. Kiñca tattha sammukhāvinayasmiṃ? Dhammasammukhatā, vinayasammukhatā, puggalasammukhatā…pe… kā ca tattha puggalasammukhatā? Yo ca deseti, yassa ca deseti, ubho sammukhībhūtā honti – ayaṃ tattha puggalasammukhatā. Kiñca tattha paṭiññātakaraṇasmiṃ? Yā paṭiññātakaraṇassa kammassa kiriyā karaṇaṃ upagamanaṃ ajjhupagamanaṃ adhivāsanā appaṭikkosanā – idaṃ tattha paṭiññātakaraṇasmiṃ. Evaṃ vūpasantaṃ ce, bhikkhave, adhikaraṇaṃ paṭiggāhako ukkoṭeti, ukkoṭanakaṃ pācittiyaṃ. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, tena, bhikkhave, bhikkhunā sambahule bhikkhū upasaṅkamitvā ekaṃsaṃ uttarāsaṅgaṃ karitvā vuḍḍhānaṃ bhikkhūnaṃ pāde vanditvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā evamassu vacanīyā – ‘ahaṃ, bhante, itthannāmaṃ āpattiṃ āpanno; taṃ paṭidesemī’ti. Byattena bhikkhunā paṭibalena te bhikkhū ñāpetabbā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇantu me āyasmantā. Ayaṃ itthannāmo bhikkhu āpattiṃ sarati, vivarati, uttāniṃ karoti deseti. Yadāyasmantānaṃ pattakallaṃ, ahaṃ itthannāmassa bhikkhuno āpattiṃ paṭiggaṇheyyanti. Tena vattabbo – ‘passasī’ti? ‘Āma ",
      " passāmī’ti. ‘Āyatiṃ saṃvareyyāsī’ti."
    ],
    "innerText": "‘‘Suṇantu me āyasmantā. Ayaṃ itthannāmo bhikkhu āpattiṃ sarati, vivarati, uttāniṃ karoti deseti. Yadāyasmantānaṃ pattakallaṃ, ahaṃ itthannāmassa bhikkhuno āpattiṃ paṭiggaṇheyyanti. Tena vattabbo – ‘passasī’ti? ‘Āma passāmī’ti. ‘Āyatiṃ saṃvareyyāsī’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idaṃ vuccati, bhikkhave, adhikaraṇaṃ vūpasantaṃ. Kena vūpasantaṃ? Sammukhāvinayena ca, paṭiññātakaraṇena ca. Kiñca tattha sammukhāvinayasmiṃ? Dhammasammukhatā, vinayasammukhatā, puggalasammukhatā…pe… kā ca tattha puggalasammukhatā? Yo ca deseti, yassa ca deseti, ubho sammukhībhūtā honti ",
      " – ayaṃ tattha puggalasammukhatā. Kiñca tattha paṭiññātakaraṇasmiṃ? Yā paṭiññātakaraṇassa kammassa kiriyā karaṇaṃ upagamanaṃ ajjhupagamanaṃ adhivāsanā appaṭikkosanā – idaṃ tattha paṭiññātakaraṇasmiṃ. Evaṃ vūpasantaṃ ce, bhikkhave, adhikaraṇaṃ paṭiggāhako ukkoṭeti, ukkoṭanakaṃ pācittiyaṃ. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, tena, bhikkhave, bhikkhunā saṅghaṃ upasaṅkamitvā ekaṃsaṃ uttarāsaṅgaṃ karitvā vuḍḍhānaṃ bhikkhūnaṃ pāde vanditvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā evamassa vacanīyo – ‘ahaṃ, bhante, itthannāmaṃ āpattiṃ āpanno; taṃ paṭidesemī’ti. Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
    ],
    "innerText": "‘‘Idaṃ vuccati, bhikkhave, adhikaraṇaṃ vūpasantaṃ. Kena vūpasantaṃ? Sammukhāvinayena ca, paṭiññātakaraṇena ca. Kiñca tattha sammukhāvinayasmiṃ? Dhammasammukhatā, vinayasammukhatā, puggalasammukhatā…pe… kā ca tattha puggalasammukhatā? Yo ca deseti, yassa ca deseti, ubho sammukhībhūtā honti – ayaṃ tattha puggalasammukhatā. Kiñca tattha paṭiññātakaraṇasmiṃ? Yā paṭiññātakaraṇassa kammassa kiriyā karaṇaṃ upagamanaṃ ajjhupagamanaṃ adhivāsanā appaṭikkosanā – idaṃ tattha paṭiññātakaraṇasmiṃ. Evaṃ vūpasantaṃ ce, bhikkhave, adhikaraṇaṃ paṭiggāhako ukkoṭeti, ukkoṭanakaṃ pācittiyaṃ. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, tena, bhikkhave, bhikkhunā saṅghaṃ upasaṅkamitvā ekaṃsaṃ uttarāsaṅgaṃ karitvā vuḍḍhānaṃ bhikkhūnaṃ pāde vanditvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā evamassa vacanīyo – ‘ahaṃ, bhante, itthannāmaṃ āpattiṃ āpanno; taṃ paṭidesemī’ti. Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Ayaṃ itthannāmo bhikkhu āpattiṃ sarati, vivarati, uttāniṃ karoti, deseti. Yadi saṅghassa pattakallaṃ, ahaṃ itthannāmassa bhikkhuno āpattiṃ paṭiggaṇheyyanti. Tena vattabbo – ‘passasī’ti? ‘Āma passāmī’ti. ‘Āyatiṃ saṃvareyyāsī’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idaṃ vuccati, bhikkhave, adhikaraṇaṃ vūpasantaṃ. Kena vūpasantaṃ? Sammukhāvinayena ca, paṭiññātakaraṇena ca ",
      ". Kiñca tattha sammukhāvinayasmiṃ? Saṅghasammukhatā, dhammasammukhatā, vinayasammukhatā, puggalasammukhatā…pe… evaṃ vūpasantaṃ ce, bhikkhave, adhikaraṇaṃ paṭiggāhako ",
      " ukkoṭeti, ukkoṭanakaṃ pācittiyaṃ; chandadāyako khīyati, khīyanakaṃ pācittiyaṃ."
    ],
    "innerText": "‘‘Idaṃ vuccati, bhikkhave, adhikaraṇaṃ vūpasantaṃ. Kena vūpasantaṃ? Sammukhāvinayena ca, paṭiññātakaraṇena ca . Kiñca tattha sammukhāvinayasmiṃ? Saṅghasammukhatā, dhammasammukhatā, vinayasammukhatā, puggalasammukhatā…pe… evaṃ vūpasantaṃ ce, bhikkhave, adhikaraṇaṃ paṭiggāhako ukkoṭeti, ukkoṭanakaṃ pācittiyaṃ; chandadāyako khīyati, khīyanakaṃ pācittiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Tiṇavatthārakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "240"
      },
      ". ‘‘Siyā āpattādhikaraṇaṃ ekaṃ samathaṃ anāgamma – paṭiññātakaraṇaṃ, dvīhi samathehi sammeyya – sammukhāvinayena ca, tiṇavatthārakena cāti? Siyātissa vacanīyaṃ. Yathā kathaṃ viya? Idha pana, bhikkhave, bhikkhūnaṃ bhaṇḍanajātānaṃ kalahajātānaṃ vivādāpannānaṃ viharataṃ bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ hoti bhāsitaparikkantaṃ. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘amhākaṃ kho bhaṇḍanajātānaṃ kalahajātānaṃ vivādāpannānaṃ viharataṃ bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Sace mayaṃ imāhi āpattīhi aññamaññaṃ kāressāma, siyāpi taṃ adhikaraṇaṃ kakkhaḷattāya vāḷattāya bhedāya saṃvatteyyā’ti. Anujānāmi, bhikkhave, evarūpaṃ adhikaraṇaṃ tiṇavatthārakena vūpasametuṃ. Evañca pana, bhikkhave, vūpasametabbaṃ. Sabbeheva ",
      " ekajjhaṃ sannipatitabbaṃ, sannipatitvā byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
    ],
    "innerText": "240. ‘‘Siyā āpattādhikaraṇaṃ ekaṃ samathaṃ anāgamma – paṭiññātakaraṇaṃ, dvīhi samathehi sammeyya – sammukhāvinayena ca, tiṇavatthārakena cāti? Siyātissa vacanīyaṃ. Yathā kathaṃ viya? Idha pana, bhikkhave, bhikkhūnaṃ bhaṇḍanajātānaṃ kalahajātānaṃ vivādāpannānaṃ viharataṃ bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ hoti bhāsitaparikkantaṃ. Tatra ce bhikkhūnaṃ evaṃ hoti – ‘amhākaṃ kho bhaṇḍanajātānaṃ kalahajātānaṃ vivādāpannānaṃ viharataṃ bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Sace mayaṃ imāhi āpattīhi aññamaññaṃ kāressāma, siyāpi taṃ adhikaraṇaṃ kakkhaḷattāya vāḷattāya bhedāya saṃvatteyyā’ti. Anujānāmi, bhikkhave, evarūpaṃ adhikaraṇaṃ tiṇavatthārakena vūpasametuṃ. Evañca pana, bhikkhave, vūpasametabbaṃ. Sabbeheva ekajjhaṃ sannipatitabbaṃ, sannipatitvā byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu me, bhante, saṅgho. Amhākaṃ bhaṇḍanajātānaṃ kalahajātānaṃ vivādāpannānaṃ viharataṃ bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Sace mayaṃ imāhi āpattīhi aññamaññaṃ kāressāma, siyāpi taṃ adhikaraṇaṃ kakkhaḷattāya vāḷattāya bhedāya saṃvatteyya ",
      ". Yadi saṅghassa pattakallaṃ, saṅgho imaṃ adhikaraṇaṃ tiṇavatthārakena vūpasameyya, ṭhapetvā thullavajjaṃ, ṭhapetvā gihippaṭisaṃyuttanti. ‘‘Ekatopakkhikānaṃ bhikkhūnaṃ byattena bhikkhunā paṭibalena sako pakkho ñāpetabbo –"
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Amhākaṃ bhaṇḍanajātānaṃ kalahajātānaṃ vivādāpannānaṃ viharataṃ bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Sace mayaṃ imāhi āpattīhi aññamaññaṃ kāressāma, siyāpi taṃ adhikaraṇaṃ kakkhaḷattāya vāḷattāya bhedāya saṃvatteyya . Yadi saṅghassa pattakallaṃ, saṅgho imaṃ adhikaraṇaṃ tiṇavatthārakena vūpasameyya, ṭhapetvā thullavajjaṃ, ṭhapetvā gihippaṭisaṃyuttanti. ‘‘Ekatopakkhikānaṃ bhikkhūnaṃ byattena bhikkhunā paṭibalena sako pakkho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Suṇantu me āyasmantā. Amhākaṃ bhaṇḍanajātānaṃ kalahajātānaṃ vivādāpannānaṃ viharataṃ bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Sace mayaṃ imāhi āpattīhi aññamaññaṃ kāressāma, siyāpi taṃ adhikaraṇaṃ kakkhaḷattāya vāḷattāya bhedāya saṃvatteyya. Yadāyasmantānaṃ pattakallaṃ, ahaṃ yā ceva āyasmantānaṃ āpatti, yā ca attano āpatti, āyasmantānañceva atthāya, attano ca atthāya, saṅghamajjhe tiṇavatthārakena deseyyaṃ, ṭhapetvā thullavajjaṃ, ṭhapetvā gihippaṭisaṃyuttanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "241"
      },
      ". ‘‘Athāparesaṃ ",
      " ekatopakkhikānaṃ bhikkhūnaṃ byattena bhikkhunā paṭibalena sako pakkho ñāpetabbo –"
    ],
    "innerText": "241. ‘‘Athāparesaṃ ekatopakkhikānaṃ bhikkhūnaṃ byattena bhikkhunā paṭibalena sako pakkho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Suṇantu me āyasmantā. Amhākaṃ bhaṇḍanajātānaṃ kalahajātānaṃ vivādāpannānaṃ viharataṃ bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Sace mayaṃ imāhi āpattīhi aññamaññaṃ kāressāma, siyāpi taṃ adhikaraṇaṃ kakkhaḷattāya vāḷattāya bhedāya saṃvatteyya. Yadāyasmantānaṃ pattakallaṃ, ahaṃ yā ceva āyasmantānaṃ āpatti, yā ca attano āpatti, āyasmantānañceva atthāya, attano ca atthāya, saṅghamajjhe tiṇavatthārakena deseyyaṃ, ṭhapetvā thullavajjaṃ, ṭhapetvā gihippaṭisaṃyuttanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "242"
      },
      ". ‘‘Athāparesaṃ ekatopakkhikānaṃ ",
      " bhikkhūnaṃ byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
    ],
    "innerText": "242. ‘‘Athāparesaṃ ekatopakkhikānaṃ bhikkhūnaṃ byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu ",
      " me, bhante, saṅgho. Amhākaṃ bhaṇḍanajātānaṃ kalahajātānaṃ vivādāpannānaṃ viharataṃ bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Sace mayaṃ imāhi āpattīhi aññamaññaṃ kāressāma, siyāpi taṃ adhikaraṇaṃ kakkhaḷattāya vāḷattāya bhedāya saṃvatteyya. Yadi saṅghassa pattakallaṃ, ahaṃ yā ceva imesaṃ āyasmantānaṃ āpatti, yā ca attano āpatti, imesañceva āyasmantānaṃ atthāya, attano ca atthāya, saṅghamajjhe tiṇavatthārakena deseyyaṃ, ṭhapetvā thullavajjaṃ, ṭhapetvā gihippaṭisaṃyuttaṃ. Esā ñatti."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Amhākaṃ bhaṇḍanajātānaṃ kalahajātānaṃ vivādāpannānaṃ viharataṃ bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Sace mayaṃ imāhi āpattīhi aññamaññaṃ kāressāma, siyāpi taṃ adhikaraṇaṃ kakkhaḷattāya vāḷattāya bhedāya saṃvatteyya. Yadi saṅghassa pattakallaṃ, ahaṃ yā ceva imesaṃ āyasmantānaṃ āpatti, yā ca attano āpatti, imesañceva āyasmantānaṃ atthāya, attano ca atthāya, saṅghamajjhe tiṇavatthārakena deseyyaṃ, ṭhapetvā thullavajjaṃ, ṭhapetvā gihippaṭisaṃyuttaṃ. Esā ñatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Amhākaṃ bhaṇḍanajātānaṃ kalahajātānaṃ vivādāpannānaṃ viharataṃ bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ. Sace mayaṃ imāhi āpattīhi aññamaññaṃ kāressāma, siyāpi taṃ adhikaraṇaṃ kakkhaḷattāya vāḷattāya bhedāya saṃvatteyya. Ahaṃ yā ceva imesaṃ āyasmantānaṃ āpatti, yā ca attano āpatti, imesañceva āyasmantānaṃ atthāya, attano ca atthāya, saṅghamajjhe tiṇavatthārakena desemi, ṭhapetvā thullavajjaṃ, ṭhapetvā gihippaṭisaṃyuttaṃ. Yassāyasmato khamati amhākaṃ imāsaṃ āpattīnaṃ saṅghamajjhe tiṇavatthārakena desanā, ṭhapetvā thullavajjaṃ, ṭhapetvā gihippaṭisaṃyuttaṃ, so tuṇhassa; yassa nakkhamati, so bhāseyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Desitā ",
      " amhākaṃ imā āpattiyo saṅghamajjhe tiṇavatthārakena ",
      ", ṭhapetvā thullavajjaṃ, ṭhapetvā gihippaṭisaṃyuttaṃ. Khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti."
    ],
    "innerText": "‘‘Desitā amhākaṃ imā āpattiyo saṅghamajjhe tiṇavatthārakena , ṭhapetvā thullavajjaṃ, ṭhapetvā gihippaṭisaṃyuttaṃ. Khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Athāparesaṃ…pe… evametaṃ dhārayāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Idaṃ vuccati, bhikkhave, adhikaraṇaṃ vūpasantaṃ. Kena vūpasantaṃ? Sammukhāvinayena ca, tiṇavatthārakena ca. Kiñca tattha sammukhāvinayasmiṃ? Saṅghasammukhatā, dhammasammukhatā, vinayasammukhatā, puggalasammukhatā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kā ca tattha saṅghasammukhatā? Yāvatikā bhikkhū kammappattā, te āgatā honti, chandārahānaṃ chando āhaṭo hoti, sammukhībhūtā na paṭikkosanti – ayaṃ tattha saṅghasammukhatā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kā ",
      " ca tattha dhammasammukhatā, vinayasammukhatā? Yena dhammena yena vinayena yena satthusāsanena taṃ adhikaraṇaṃ vūpasammati – ayaṃ tattha dhammasammukhatā ",
      ", vinayasammukhatā."
    ],
    "innerText": "‘‘Kā ca tattha dhammasammukhatā, vinayasammukhatā? Yena dhammena yena vinayena yena satthusāsanena taṃ adhikaraṇaṃ vūpasammati – ayaṃ tattha dhammasammukhatā , vinayasammukhatā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kā ca tattha puggalasammukhatā? Yo ca deseti, yassa ca deseti, ubho sammukhībhūtā honti – ayaṃ tattha puggalasammukhatā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Kiñca tattha tiṇavatthārakasmiṃ? Yā tiṇavatthārakassa kammassa kiriyā karaṇaṃ upagamanaṃ ajjhupagamanaṃ adhivāsanā appaṭikkosanā – idaṃ tattha tiṇavatthārakasmiṃ. Evaṃ vūpasantaṃ ce, bhikkhave, adhikaraṇaṃ paṭiggāhako ukkoṭeti, ukkoṭanakaṃ pācittiyaṃ; chandadāyako khīyati, khīyanakaṃ pācittiyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pari. 295, 307, 308]"
      },
      " ‘‘Kiccādhikaraṇaṃ katihi samathehi sammati? Kiccādhikaraṇaṃ ekena samathena sammati – sammukhāvinayenā’’ti."
    ],
    "innerText": "[pari. 295, 307, 308] ‘‘Kiccādhikaraṇaṃ katihi samathehi sammati? Kiccādhikaraṇaṃ ekena samathena sammati – sammukhāvinayenā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Samathakkhandhakaṃ niṭṭhitaṃ catutthaṃ."
  }
]