[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "2. Pārivāsikakkhandhakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Pārivāsikavattakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "75"
      },
      ". Pārivāsikakkhandhake ",
      " – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pārivāsikā"
      },
      "ti parivāsaṃ parivasantā. Tattha catubbidho parivāso – appaṭicchannaparivāso, paṭicchannaparivāso, suddhantaparivāso, samodhānaparivāsoti. Tesu ‘‘yo, bhikkhave, aññopi aññatitthiyapubbo imasmiṃ dhammavinaye ākaṅkhati pabbajjaṃ, ākaṅkhati upasampadaṃ, tassa cattāro māse parivāso dātabbo’’ti (mahāva. 86) evaṃ mahākhandhake vutto titthiyaparivāso appaṭicchannaparivāso nāma. Tattha yaṃ vattabbaṃ taṃ vuttameva. Ayaṃ ",
      " pana idha anadhippeto. Sesā tayo yena saṅghādisesāpatti āpannā ceva hoti paṭicchāditā ca, tassa dātabbā. Tesu yaṃ vattabbaṃ taṃ samuccayakkhandhake vakkhāma. Ete pana idha adhippetā. Tasmā etesu yaṃkiñci parivāsaṃ parivasantā ‘‘pārivāsikā’’ti veditabbā."
    ],
    "innerText": "75. Pārivāsikakkhandhake – pārivāsikāti parivāsaṃ parivasantā. Tattha catubbidho parivāso – appaṭicchannaparivāso, paṭicchannaparivāso, suddhantaparivāso, samodhānaparivāsoti. Tesu ‘‘yo, bhikkhave, aññopi aññatitthiyapubbo imasmiṃ dhammavinaye ākaṅkhati pabbajjaṃ, ākaṅkhati upasampadaṃ, tassa cattāro māse parivāso dātabbo’’ti (mahāva. 86) evaṃ mahākhandhake vutto titthiyaparivāso appaṭicchannaparivāso nāma. Tattha yaṃ vattabbaṃ taṃ vuttameva. Ayaṃ pana idha anadhippeto. Sesā tayo yena saṅghādisesāpatti āpannā ceva hoti paṭicchāditā ca, tassa dātabbā. Tesu yaṃ vattabbaṃ taṃ samuccayakkhandhake vakkhāma. Ete pana idha adhippetā. Tasmā etesu yaṃkiñci parivāsaṃ parivasantā ‘‘pārivāsikā’’ti veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pakatattānaṃ bhikkhūna"
      },
      "nti ṭhapetvā navakataraṃ pārivāsikaṃ avasesānaṃ antamaso mūlāyapaṭikassanārahādīnampi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhivādanapaccuṭṭhāna"
      },
      "nti yaṃ te abhivādanādiṃ karonti, taṃ sādiyanti, sampaṭicchanti; na paṭikkhipantīti attho. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sāmīcikamma"
      },
      "nti ṭhapetvā abhivādanādīni aññassa anucchavikassa bījanavātadānādino ābhisamācārikassetaṃ adhivacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āsanābhihāra"
      },
      "nti āsanassa abhiharaṇaṃ, āsanaṃ gahetvā abhigamanaṃ paññāpanameva vā. Seyyābhihārepi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pādodaka"
      },
      "nti pādadhovanaudakaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pādapīṭha"
      },
      "nti dhotapādaṭṭhapanakaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pādakathalika"
      },
      "nti adhotapādaṭṭhapanakaṃ pādaghaṃsanaṃ vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āpatti dukkaṭassā"
      },
      "ti saddhivihārikānampi sādiyantassa dukkaṭameva, tasmā te vattabbā – ‘‘ahaṃ vinayakammaṃ karomi, mayhaṃ vattaṃ mā karotha, mā maṃ gāmappavesanaṃ āpucchathā’’ti. Sace saddhāpabbajitā kulaputtā ‘‘tumhe, bhante, tumhākaṃ ",
      " vinayakammaṃ karothā’’ti vatvā vattaṃ karonti, gāmappavesanampi āpucchantiyeva, vāritakālato paṭṭhāya anāpatti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mithu yathāvuḍḍha"
      },
      "nti pārivāsikabhikkhūnaṃ aññamaññaṃ yo yo vuḍḍho tena tena navakatarassa sādituṃ."
    ],
    "innerText": "Pakatattānaṃ bhikkhūnanti ṭhapetvā navakataraṃ pārivāsikaṃ avasesānaṃ antamaso mūlāyapaṭikassanārahādīnampi. Abhivādanapaccuṭṭhānanti yaṃ te abhivādanādiṃ karonti, taṃ sādiyanti, sampaṭicchanti; na paṭikkhipantīti attho. Tattha sāmīcikammanti ṭhapetvā abhivādanādīni aññassa anucchavikassa bījanavātadānādino ābhisamācārikassetaṃ adhivacanaṃ. Āsanābhihāranti āsanassa abhiharaṇaṃ, āsanaṃ gahetvā abhigamanaṃ paññāpanameva vā. Seyyābhihārepi eseva nayo. Pādodakanti pādadhovanaudakaṃ. Pādapīṭhanti dhotapādaṭṭhapanakaṃ. Pādakathalikanti adhotapādaṭṭhapanakaṃ pādaghaṃsanaṃ vā. Āpatti dukkaṭassāti saddhivihārikānampi sādiyantassa dukkaṭameva, tasmā te vattabbā – ‘‘ahaṃ vinayakammaṃ karomi, mayhaṃ vattaṃ mā karotha, mā maṃ gāmappavesanaṃ āpucchathā’’ti. Sace saddhāpabbajitā kulaputtā ‘‘tumhe, bhante, tumhākaṃ vinayakammaṃ karothā’’ti vatvā vattaṃ karonti, gāmappavesanampi āpucchantiyeva, vāritakālato paṭṭhāya anāpatti. Mithu yathāvuḍḍhanti pārivāsikabhikkhūnaṃ aññamaññaṃ yo yo vuḍḍho tena tena navakatarassa sādituṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañca"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yathāvuḍḍha"
      },
      "nti pakatattehipi saddhiṃ vuḍḍhapaṭipāṭiyā eva. Tasmā pātimokkhe uddissamāne hatthapāse nisīdituṃ vaṭṭati. Mahāpaccariyaṃ pana ‘‘pāḷiyā anisīditvā pāḷiṃ vihāya hatthapāsaṃ amuñcantena nisīditabba’’nti vuttaṃ. Pārisuddhiuposathe karīyamāne saṅghanavakaṭṭhāne nisīditvā tattheva ",
      " nisinnena attano pāḷiyā pārisuddhiuposatho kātabbo. Pavāraṇāyapi saṅghanavakaṭṭhāne nisīditvā tattheva nisinnena attano pāḷiyā pavāretabbaṃ. Saṅghena ghaṇṭiṃ paharitvā bhājīyamānaṃ vassikasāṭikampi attano pattaṭṭhāne gahetuṃ vaṭṭati."
    ],
    "innerText": "Pañcayathāvuḍḍhanti pakatattehipi saddhiṃ vuḍḍhapaṭipāṭiyā eva. Tasmā pātimokkhe uddissamāne hatthapāse nisīdituṃ vaṭṭati. Mahāpaccariyaṃ pana ‘‘pāḷiyā anisīditvā pāḷiṃ vihāya hatthapāsaṃ amuñcantena nisīditabba’’nti vuttaṃ. Pārisuddhiuposathe karīyamāne saṅghanavakaṭṭhāne nisīditvā tattheva nisinnena attano pāḷiyā pārisuddhiuposatho kātabbo. Pavāraṇāyapi saṅghanavakaṭṭhāne nisīditvā tattheva nisinnena attano pāḷiyā pavāretabbaṃ. Saṅghena ghaṇṭiṃ paharitvā bhājīyamānaṃ vassikasāṭikampi attano pattaṭṭhāne gahetuṃ vaṭṭati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Oṇojana"
      },
      "nti vissajjanaṃ vuccati. Sace hi pārivāsikassa dve tīṇi uddesabhattādīni pāpuṇanti, aññā cassa puggalikabhattapaccāsā hoti, tāni paṭipāṭiyā gahetvā ‘‘bhante, heṭṭhā gāhetha, ajja mayhaṃ bhattapaccāsā atthi, sve gaṇhissāmī’’ti vatvā vissajjetabbāni. Evaṃ tāni punadivasesu gaṇhituṃ labhati. Punadivase sabbapaṭhamaṃ etassa dātabbanti kurundiyaṃ vuttaṃ. Yadi pana na gaṇhāti na vissajjeti, punadivase na labhati, idaṃ oṇojanaṃ nāma pārivāsikasseva odissa anuññātaṃ. Kasmā? Tassa hi saṅghanavakaṭṭhāne nisinnassa bhattagge yāgukhajjakādīni pāpuṇanti vā na vā, tasmā so ‘‘bhikkhāhārena mā kilamitthā’’ti idamassa saṅgahakaraṇatthāya odissa anuññātaṃ."
    ],
    "innerText": "Oṇojananti vissajjanaṃ vuccati. Sace hi pārivāsikassa dve tīṇi uddesabhattādīni pāpuṇanti, aññā cassa puggalikabhattapaccāsā hoti, tāni paṭipāṭiyā gahetvā ‘‘bhante, heṭṭhā gāhetha, ajja mayhaṃ bhattapaccāsā atthi, sve gaṇhissāmī’’ti vatvā vissajjetabbāni. Evaṃ tāni punadivasesu gaṇhituṃ labhati. Punadivase sabbapaṭhamaṃ etassa dātabbanti kurundiyaṃ vuttaṃ. Yadi pana na gaṇhāti na vissajjeti, punadivase na labhati, idaṃ oṇojanaṃ nāma pārivāsikasseva odissa anuññātaṃ. Kasmā? Tassa hi saṅghanavakaṭṭhāne nisinnassa bhattagge yāgukhajjakādīni pāpuṇanti vā na vā, tasmā so ‘‘bhikkhāhārena mā kilamitthā’’ti idamassa saṅgahakaraṇatthāya odissa anuññātaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhatta"
      },
      "nti āgatāgatehi vuḍḍhapaṭipāṭiyā gahetvā gantabbaṃ vihāre saṅghassa catussālabhattaṃ, etaṃ yathāvuḍḍhaṃ labhati. Pāḷiyā pana gantuṃ vā ṭhātuṃ vā na labhati, tasmā pāḷito osakkitvā hatthapāse ṭhitena hatthaṃ pasāretvā yathā seno nipatitvā gaṇhāti, evaṃ gaṇhitabbaṃ. Ārāmikasamaṇuddesehi āharāpetuṃ na labhati. Sace sayameva āharanti, vaṭṭati. Rañño mahāpeḷabhattepi eseva nayo. Catussālabhatte pana sace oṇojanaṃ kattukāmo hoti, attano atthāya ukkhitte piṇḍe ‘‘ajja me bhattaṃ atthi, sve gaṇhissāmī’’ti vattabbaṃ. Punadivase dve piṇḍe labhatīti mahāpaccariyaṃ vuttaṃ. Uddesabhattādīnipi pāḷito osakkitvāva ",
      " gahetabbāni. Yattha pana nisīdāpetvā parivisanti, tattha sāmaṇerānaṃ jeṭṭhakena bhikkhūnaṃ saṅghanavakena hutvā nisīditabbaṃ."
    ],
    "innerText": "Bhattanti āgatāgatehi vuḍḍhapaṭipāṭiyā gahetvā gantabbaṃ vihāre saṅghassa catussālabhattaṃ, etaṃ yathāvuḍḍhaṃ labhati. Pāḷiyā pana gantuṃ vā ṭhātuṃ vā na labhati, tasmā pāḷito osakkitvā hatthapāse ṭhitena hatthaṃ pasāretvā yathā seno nipatitvā gaṇhāti, evaṃ gaṇhitabbaṃ. Ārāmikasamaṇuddesehi āharāpetuṃ na labhati. Sace sayameva āharanti, vaṭṭati. Rañño mahāpeḷabhattepi eseva nayo. Catussālabhatte pana sace oṇojanaṃ kattukāmo hoti, attano atthāya ukkhitte piṇḍe ‘‘ajja me bhattaṃ atthi, sve gaṇhissāmī’’ti vattabbaṃ. Punadivase dve piṇḍe labhatīti mahāpaccariyaṃ vuttaṃ. Uddesabhattādīnipi pāḷito osakkitvāva gahetabbāni. Yattha pana nisīdāpetvā parivisanti, tattha sāmaṇerānaṃ jeṭṭhakena bhikkhūnaṃ saṅghanavakena hutvā nisīditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "76"
      },
      ". Idāni ",
      " yā ayaṃ sammāvattanā vuttā, tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na upasampādetabba"
      },
      "nti upajjhāyena hutvā na upasampādetabbaṃ; vattaṃ nikkhipitvā pana upasampādetuṃ vaṭṭati. Ācariyena hutvāpi kammavācā na sāvetabbā, aññasmiṃ asati vattaṃ nikkhipitvā sāvetuṃ vaṭṭati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na nissayo"
      },
      "ti āgantukānaṃ nissayo na dātabbo. Yehipi pakatiyāva nissayo gahito, te vattabbā – ‘‘ahaṃ vinayakammaṃ karomi, asukattherassa nāma santike nissayaṃ gaṇhatha, mayhaṃ vattaṃ mā karotha, mā maṃ gāmappavesanaṃ āpucchathā’’ti. Sace evaṃ vuttepi karontiyeva, vāritakālato paṭṭhāya karontesupi anāpatti."
    ],
    "innerText": "76. Idāni yā ayaṃ sammāvattanā vuttā, tattha na upasampādetabbanti upajjhāyena hutvā na upasampādetabbaṃ; vattaṃ nikkhipitvā pana upasampādetuṃ vaṭṭati. Ācariyena hutvāpi kammavācā na sāvetabbā, aññasmiṃ asati vattaṃ nikkhipitvā sāvetuṃ vaṭṭati. Na nissayoti āgantukānaṃ nissayo na dātabbo. Yehipi pakatiyāva nissayo gahito, te vattabbā – ‘‘ahaṃ vinayakammaṃ karomi, asukattherassa nāma santike nissayaṃ gaṇhatha, mayhaṃ vattaṃ mā karotha, mā maṃ gāmappavesanaṃ āpucchathā’’ti. Sace evaṃ vuttepi karontiyeva, vāritakālato paṭṭhāya karontesupi anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na sāmaṇero"
      },
      "ti añño sāmaṇero na gahetabbo. Upajjhaṃ datvā gahitasāmaṇerāpi vattabbā – ‘‘ahaṃ vinayakammaṃ karomi, mayhaṃ vattaṃ mā karotha, mā maṃ gāmappavesanaṃ āpucchathā’’ti. Sace evaṃ vuttepi karontiyeva, vāritakālato paṭṭhāya karontesupi anāpatti. Bhikkhunovādakasammuti nāma ādhipaccaṭṭhānabhūtāti paṭikkhittā, tasmā bhikkhusaṅghassa vattabbaṃ – ‘‘bhante, ahaṃ vinayakammaṃ karomi, bhikkhunovādakaṃ jānāthā’’ti, paṭibalassa vā bhikkhussa bhāro kātabbo. Āgatā bhikkhuniyo ‘‘saṅghasantikaṃ gacchatha, saṅgho vo ovādadāyakaṃ jānissatī’’ti vā ‘‘ahaṃ vinayakammaṃ karomi, asukabhikkhussa nāma santikaṃ gacchatha, so vo ovādaṃ dassatī’’ti vā vattabbā."
    ],
    "innerText": "Na sāmaṇeroti añño sāmaṇero na gahetabbo. Upajjhaṃ datvā gahitasāmaṇerāpi vattabbā – ‘‘ahaṃ vinayakammaṃ karomi, mayhaṃ vattaṃ mā karotha, mā maṃ gāmappavesanaṃ āpucchathā’’ti. Sace evaṃ vuttepi karontiyeva, vāritakālato paṭṭhāya karontesupi anāpatti. Bhikkhunovādakasammuti nāma ādhipaccaṭṭhānabhūtāti paṭikkhittā, tasmā bhikkhusaṅghassa vattabbaṃ – ‘‘bhante, ahaṃ vinayakammaṃ karomi, bhikkhunovādakaṃ jānāthā’’ti, paṭibalassa vā bhikkhussa bhāro kātabbo. Āgatā bhikkhuniyo ‘‘saṅghasantikaṃ gacchatha, saṅgho vo ovādadāyakaṃ jānissatī’’ti vā ‘‘ahaṃ vinayakammaṃ karomi, asukabhikkhussa nāma santikaṃ gacchatha, so vo ovādaṃ dassatī’’ti vā vattabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sā āpattī"
      },
      "ti sukkavissaṭṭhiyā parivāse dinne sukkavissaṭṭhi nāpajjitabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aññā vā tādisikā"
      },
      "ti kāyasaṃsaggādigarukāpatti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tato vā pāpiṭṭhatarā"
      },
      "ti pārājikāpatti; sattasu hi āpattīsu dubbhāsitāpatti pāpiṭṭhā; dukkaṭāpatti pāpiṭṭhatarā; dukkaṭāpatti pāpiṭṭhā, pāṭidesanīyāpatti pāpiṭṭhatarāti evaṃ pācittiyathullaccayasaṅghādisesapārājikāpattīsu nayo netabbo. Tāsaṃ vatthūsupi dubbhāsitavatthu pāpiṭṭhaṃ, dukkaṭavatthu pāpiṭṭhataranti purimanayeneva bhedo veditabbo. Paṇṇattivajjasikkhāpade pana vatthupi āpattipi pāpiṭṭhā. Lokavajje ",
      " ubhayampi pāpiṭṭhataraṃ."
    ],
    "innerText": "Sā āpattīti sukkavissaṭṭhiyā parivāse dinne sukkavissaṭṭhi nāpajjitabbā. Aññā vā tādisikāti kāyasaṃsaggādigarukāpatti. Tato vā pāpiṭṭhatarāti pārājikāpatti; sattasu hi āpattīsu dubbhāsitāpatti pāpiṭṭhā; dukkaṭāpatti pāpiṭṭhatarā; dukkaṭāpatti pāpiṭṭhā, pāṭidesanīyāpatti pāpiṭṭhatarāti evaṃ pācittiyathullaccayasaṅghādisesapārājikāpattīsu nayo netabbo. Tāsaṃ vatthūsupi dubbhāsitavatthu pāpiṭṭhaṃ, dukkaṭavatthu pāpiṭṭhataranti purimanayeneva bhedo veditabbo. Paṇṇattivajjasikkhāpade pana vatthupi āpattipi pāpiṭṭhā. Lokavajje ubhayampi pāpiṭṭhataraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kamma"
      },
      "nti ",
      " parivāsakammavācā vuccati. Taṃ kammaṃ ‘‘akataṃ dukkaṭa’’ntiādīhi vā ‘‘kiṃ idaṃ kammaṃ nāma kasikammaṃ gorakkhakamma’’ntiādīhi vā vacanehi na garahitabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammikā"
      },
      "ti yehi bhikkhūhi kammaṃ kataṃ, te vuccanti, te ‘‘bālā abyattā’’tiādīhi vacanehi na garahitabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "savacanīyaṃ kātabba"
      },
      "nti palibodhatthāya vā pakkosanatthāya vā savacanīyaṃ na kātabbaṃ, palibodhatthāya hi karonto ‘‘ahaṃ āyasmantaṃ imasmiṃ vatthusmiṃ savacanīyaṃ karomi, imamhā āvāsā ekapadampi mā pakkāmi, yāva na taṃ adhikaraṇaṃ vūpasantaṃ hotī’’ti evaṃ karoti. Pakkosanatthāya karonto ‘‘ahaṃ te savacanīyaṃ karomi, ehi mayā saddhiṃ vinayadharānaṃ sammukhībhāvaṃ gacchāmā’’ti evaṃ karoti; tadubhayampi na kātabbaṃ."
    ],
    "innerText": "Kammanti parivāsakammavācā vuccati. Taṃ kammaṃ ‘‘akataṃ dukkaṭa’’ntiādīhi vā ‘‘kiṃ idaṃ kammaṃ nāma kasikammaṃ gorakkhakamma’’ntiādīhi vā vacanehi na garahitabbaṃ. Kammikāti yehi bhikkhūhi kammaṃ kataṃ, te vuccanti, te ‘‘bālā abyattā’’tiādīhi vacanehi na garahitabbā. Nasavacanīyaṃ kātabbanti palibodhatthāya vā pakkosanatthāya vā savacanīyaṃ na kātabbaṃ, palibodhatthāya hi karonto ‘‘ahaṃ āyasmantaṃ imasmiṃ vatthusmiṃ savacanīyaṃ karomi, imamhā āvāsā ekapadampi mā pakkāmi, yāva na taṃ adhikaraṇaṃ vūpasantaṃ hotī’’ti evaṃ karoti. Pakkosanatthāya karonto ‘‘ahaṃ te savacanīyaṃ karomi, ehi mayā saddhiṃ vinayadharānaṃ sammukhībhāvaṃ gacchāmā’’ti evaṃ karoti; tadubhayampi na kātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na anuvādo"
      },
      "ti vihāre jeṭṭhakaṭṭhānaṃ na kātabbaṃ. Pātimokkhuddesakena vā dhammajjhesakena vā na bhavitabbaṃ. Nāpi terasasu sammutīsu ekasammutivasenāpi issariyakammaṃ kātabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na okāso"
      },
      "ti ‘‘karotu me āyasmā okāsaṃ, ahaṃ taṃ vattukāmo’’ti evaṃ pakatattassa okāso na kāretabbo, vatthunā vā āpattiyā vā na codetabbo, ‘‘ayaṃ pubbe te doso’’ti na sāretabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na bhikkhūhi sampayojetabba"
      },
      "nti aññamaññaṃ yojetvā kalaho na kāretabbo."
    ],
    "innerText": "Na anuvādoti vihāre jeṭṭhakaṭṭhānaṃ na kātabbaṃ. Pātimokkhuddesakena vā dhammajjhesakena vā na bhavitabbaṃ. Nāpi terasasu sammutīsu ekasammutivasenāpi issariyakammaṃ kātabbaṃ. Na okāsoti ‘‘karotu me āyasmā okāsaṃ, ahaṃ taṃ vattukāmo’’ti evaṃ pakatattassa okāso na kāretabbo, vatthunā vā āpattiyā vā na codetabbo, ‘‘ayaṃ pubbe te doso’’ti na sāretabbo. Na bhikkhūhi sampayojetabbanti aññamaññaṃ yojetvā kalaho na kāretabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purato"
      },
      "ti saṅghattherena hutvā purato na gantabbaṃ, dvādasahatthaṃ upacāraṃ muñcitvā ekakena gantabbaṃ. Nisīdanepi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āsanapariyanto"
      },
      "ti bhattaggādīsu saṅghanavakāsanaṃ vuccati; svāssa dātabbo, tattha nisīditabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Seyyāpariyanto"
      },
      "ti seyyānaṃ pariyanto, sabbalāmakaṃ mañcapīṭhaṃ. Ayañhi vassaggena attano pattaṭṭhāne seyyaṃ gahetuṃ na labhati. Sabbabhikkhūhi ",
      " vicinitvā gahitāvasesā maṅkulagūthabharitā vettalatādivinaddhā lāmakaseyyā assa dātabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vihārapariyanto"
      },
      "ti yathā ca seyyā, evaṃ vasanaāvāsopi vassaggena attano pattaṭṭhāne tassa na vaṭṭati. Sabbabhikkhūhi vicinitvā gahitāvasesā pana rajohatabhūmi jatukamūsikabharitā paṇṇasālā assa dātabbā. Sace pakatattā sabbe rukkhamūlikā abbhokāsikā ca honti, channaṃ na upenti, sabbepi etehi vissaṭṭhāvāsā nāma honti. Tesu yaṃ icchati, taṃ labhati. Vassūpanāyikadivase paccayaṃ ekapasse ṭhatvā vassaggena gaṇhituṃ labhati. Senāsanaṃ na labhati, nibaddhavassāvāsikaṃ senāsanaṃ gaṇhitukāmena vattaṃ nikkhipitvā gahetabbaṃ."
    ],
    "innerText": "Puratoti saṅghattherena hutvā purato na gantabbaṃ, dvādasahatthaṃ upacāraṃ muñcitvā ekakena gantabbaṃ. Nisīdanepi eseva nayo. Āsanapariyantoti bhattaggādīsu saṅghanavakāsanaṃ vuccati; svāssa dātabbo, tattha nisīditabbaṃ. Seyyāpariyantoti seyyānaṃ pariyanto, sabbalāmakaṃ mañcapīṭhaṃ. Ayañhi vassaggena attano pattaṭṭhāne seyyaṃ gahetuṃ na labhati. Sabbabhikkhūhi vicinitvā gahitāvasesā maṅkulagūthabharitā vettalatādivinaddhā lāmakaseyyā assa dātabbā. Vihārapariyantoti yathā ca seyyā, evaṃ vasanaāvāsopi vassaggena attano pattaṭṭhāne tassa na vaṭṭati. Sabbabhikkhūhi vicinitvā gahitāvasesā pana rajohatabhūmi jatukamūsikabharitā paṇṇasālā assa dātabbā. Sace pakatattā sabbe rukkhamūlikā abbhokāsikā ca honti, channaṃ na upenti, sabbepi etehi vissaṭṭhāvāsā nāma honti. Tesu yaṃ icchati, taṃ labhati. Vassūpanāyikadivase paccayaṃ ekapasse ṭhatvā vassaggena gaṇhituṃ labhati. Senāsanaṃ na labhati, nibaddhavassāvāsikaṃ senāsanaṃ gaṇhitukāmena vattaṃ nikkhipitvā gahetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tena"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ca so sāditabbo"
      },
      "ti yaṃ assa āsanādipariyantaṃ bhikkhū denti, so eva sāditabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puresamaṇena vā pacchāsamaṇena vā"
      },
      "ti ñātipavāritaṭṭhāne ‘‘ettake bhikkhū gahetvā āgacchathā’’ti nimantitena ‘‘bhante, asukaṃ nāma kulaṃ bhikkhū nimantesi, etha tattha gacchāmā’’ti evaṃ saṃvidhāya bhikkhū puresamaṇe vā pacchāsamaṇe vā katvā na gantabbaṃ. ‘‘Bhante, asukasmiṃ nāma gāme manussā bhikkhūnaṃ āgamanaṃ icchanti, sādhu vatassa sace tesaṃ saṅgahaṃ kareyyāthā’’ti evaṃ pana pariyāyena kathetuṃ vaṭṭati."
    ],
    "innerText": "Tenaca so sāditabboti yaṃ assa āsanādipariyantaṃ bhikkhū denti, so eva sāditabbo. Puresamaṇena vā pacchāsamaṇena vāti ñātipavāritaṭṭhāne ‘‘ettake bhikkhū gahetvā āgacchathā’’ti nimantitena ‘‘bhante, asukaṃ nāma kulaṃ bhikkhū nimantesi, etha tattha gacchāmā’’ti evaṃ saṃvidhāya bhikkhū puresamaṇe vā pacchāsamaṇe vā katvā na gantabbaṃ. ‘‘Bhante, asukasmiṃ nāma gāme manussā bhikkhūnaṃ āgamanaṃ icchanti, sādhu vatassa sace tesaṃ saṅgahaṃ kareyyāthā’’ti evaṃ pana pariyāyena kathetuṃ vaṭṭati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na āraññikaṅga"
      },
      "nti āgatāgatānaṃ ārocetuṃ harāyamānena āraññikadhutaṅgaṃ na samādātabbaṃ. Yenāpi pakatiyā samādinnaṃ, tena dutiyaṃ bhikkhuṃ gahetvā araññe aruṇaṃ uṭṭhāpetabbaṃ, na ca ekakena vatthabbaṃ. Tathā bhattaggādīsu āsanapariyante nisajjāya harāyamānena piṇḍapātikadhutaṅgampi na samādātabbaṃ. Yo pana pakatiyāva piṇḍapātiko ",
      " tassa paṭisedho natthi."
    ],
    "innerText": "Na āraññikaṅganti āgatāgatānaṃ ārocetuṃ harāyamānena āraññikadhutaṅgaṃ na samādātabbaṃ. Yenāpi pakatiyā samādinnaṃ, tena dutiyaṃ bhikkhuṃ gahetvā araññe aruṇaṃ uṭṭhāpetabbaṃ, na ca ekakena vatthabbaṃ. Tathā bhattaggādīsu āsanapariyante nisajjāya harāyamānena piṇḍapātikadhutaṅgampi na samādātabbaṃ. Yo pana pakatiyāva piṇḍapātiko tassa paṭisedho natthi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na ca tappaccayā"
      },
      "ti ‘‘nīhaṭabhatto hutvā vihāreyeva nisīditvā bhuñjanto rattiyo gaṇayissāmi, gacchato me bhikkhuṃ disvā anārocentassa ratticchedo siyā’’ti iminā kāraṇena piṇḍapāto na nīharāpetabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mā maṃ jāniṃsū"
      },
      "ti ‘‘mā maṃ ekabhikkhupi jānātū’’ti ca iminā ajjhāsayena vihāre sāmaṇerehi pacāpetvā bhuñjitumpi na labhati. Gāmaṃ piṇḍāya pavisitabbameva. Gilānassa pana navakammaācariyupajjhāyakiccādipasutassa vā vihāreyeva acchituṃ vaṭṭati. Sacepi gāme anekasatā bhikkhū vicaranti, na sakkā hoti ārocetuṃ, gāmakāvāsaṃ gantvā sabhāgaṭṭhāne vasituṃ vaṭṭati."
    ],
    "innerText": "Na ca tappaccayāti ‘‘nīhaṭabhatto hutvā vihāreyeva nisīditvā bhuñjanto rattiyo gaṇayissāmi, gacchato me bhikkhuṃ disvā anārocentassa ratticchedo siyā’’ti iminā kāraṇena piṇḍapāto na nīharāpetabbo. Mā maṃ jāniṃsūti ‘‘mā maṃ ekabhikkhupi jānātū’’ti ca iminā ajjhāsayena vihāre sāmaṇerehi pacāpetvā bhuñjitumpi na labhati. Gāmaṃ piṇḍāya pavisitabbameva. Gilānassa pana navakammaācariyupajjhāyakiccādipasutassa vā vihāreyeva acchituṃ vaṭṭati. Sacepi gāme anekasatā bhikkhū vicaranti, na sakkā hoti ārocetuṃ, gāmakāvāsaṃ gantvā sabhāgaṭṭhāne vasituṃ vaṭṭati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āgantukenā"
      },
      "ti kañci vihāraṃ gatena tattha bhikkhūnaṃ ārocetabbaṃ. Sace sabbe ekaṭṭhāne ṭhite passati, ekaṭṭhāne ṭhiteneva ārocetabbaṃ. Atha rukkhamūlādīsu visuṃ visuṃ ṭhitā honti, tattha tattha gantvā ārocetabbaṃ. Sañcicca anārocentassa ratticchedo ca hoti, vattabhede ca dukkaṭaṃ. Atha vicinanto ekacce na passati, ratticchedova hoti, na vattabhedadukkaṭaṃ."
    ],
    "innerText": "Āgantukenāti kañci vihāraṃ gatena tattha bhikkhūnaṃ ārocetabbaṃ. Sace sabbe ekaṭṭhāne ṭhite passati, ekaṭṭhāne ṭhiteneva ārocetabbaṃ. Atha rukkhamūlādīsu visuṃ visuṃ ṭhitā honti, tattha tattha gantvā ārocetabbaṃ. Sañcicca anārocentassa ratticchedo ca hoti, vattabhede ca dukkaṭaṃ. Atha vicinanto ekacce na passati, ratticchedova hoti, na vattabhedadukkaṭaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āgantukassā"
      },
      "ti ",
      " attano vasanavihāraṃ āgatassāpi ekassa vā bahūnaṃ vā vuttanayeneva ārocetabbaṃ ",
      ". Ratticchedavattabhedāpi cettha vuttanayeneva veditabbā. Sace āgantukā muhuttaṃ vissamitvā vā avissamitvā eva vā vihāramajjhena gacchanti, tesampi ārocetabbaṃ. Sace tassa ajānantasseva gacchanti, ayañca pana gatakāle jānāti, gantvā ārocetabbaṃ. Sampāpuṇituṃ asakkontassa ratticchedova hoti, na vattabhedadukkaṭaṃ. Yepi antovihāraṃ appavisitvā upacārasīmaṃ okkamitvā gacchanti, ayañca nesaṃ chattasaddaṃ vā ukkāsitasaddaṃ vā khipitasaddaṃ vā sutvāva āgantukabhāvaṃ jānāti, gantvā ārocetabbaṃ ",
      ". Gatakāle jānantenapi anubandhitvā ārocetabbameva. Sampāpuṇituṃ asakkontassa ratticchedova hoti, na vattabhedadukkaṭaṃ. Yopi rattiṃyeva āgantvā rattiṃyeva gacchati, sopissa ratticchedaṃ karoti, aññātattā pana vattabhedadukkaṭaṃ natthi. Sace ajānitvāva abbhānaṃ karoti, akatameva hotīti kurundiyaṃ vuttaṃ. Tasmā adhikā rattiyo gahetvā kātabbaṃ, ayaṃ apaṇṇakapaṭipadā."
    ],
    "innerText": "Āgantukassāti attano vasanavihāraṃ āgatassāpi ekassa vā bahūnaṃ vā vuttanayeneva ārocetabbaṃ . Ratticchedavattabhedāpi cettha vuttanayeneva veditabbā. Sace āgantukā muhuttaṃ vissamitvā vā avissamitvā eva vā vihāramajjhena gacchanti, tesampi ārocetabbaṃ. Sace tassa ajānantasseva gacchanti, ayañca pana gatakāle jānāti, gantvā ārocetabbaṃ. Sampāpuṇituṃ asakkontassa ratticchedova hoti, na vattabhedadukkaṭaṃ. Yepi antovihāraṃ appavisitvā upacārasīmaṃ okkamitvā gacchanti, ayañca nesaṃ chattasaddaṃ vā ukkāsitasaddaṃ vā khipitasaddaṃ vā sutvāva āgantukabhāvaṃ jānāti, gantvā ārocetabbaṃ . Gatakāle jānantenapi anubandhitvā ārocetabbameva. Sampāpuṇituṃ asakkontassa ratticchedova hoti, na vattabhedadukkaṭaṃ. Yopi rattiṃyeva āgantvā rattiṃyeva gacchati, sopissa ratticchedaṃ karoti, aññātattā pana vattabhedadukkaṭaṃ natthi. Sace ajānitvāva abbhānaṃ karoti, akatameva hotīti kurundiyaṃ vuttaṃ. Tasmā adhikā rattiyo gahetvā kātabbaṃ, ayaṃ apaṇṇakapaṭipadā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Nadīādīsu nāvāya gacchantampi paratīre ṭhitampi ākāsena gacchantampi pabbatatalaaraññādīsu dūre ṭhitampi bhikkhuṃ disvā sace ‘‘bhikkhū’’ti vavatthānaṃ atthi, nāvādīhi vā gantvā mahāsaddaṃ katvā vā vegena anubandhitvā vā ārocetabbaṃ, anārocentassa ratticchedo ceva vattabhedadukkaṭañca. Sace vāyamantopi sampāpuṇituṃ vā sāvetuṃ vā na sakkoti, ratticchedova hoti, na vattabhedadukkaṭaṃ. Saṅghasenābhayatthero pana visayāvisayena katheti – ‘‘visaye kira anārocentassa ratticchedo ceva vattabhedadukkaṭañca hoti, avisaye pana ubhayampi natthī’’ti. Karavīkatissatthero ‘‘samaṇo ayanti vavatthānameva pamāṇaṃ, sacepi avisayo hoti, vattabhedadukkaṭameva natthi, ratticchedo pana hotiyevā’’ti āha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uposathe"
      },
      "ti ‘‘uposathaṃ sampāpuṇissāmā’’ti āgantukā bhikkhū āgacchanti, iddhiyā gacchantāpi uposathabhāvaṃ ñatvā otaritvā uposathaṃ karonti, tasmā āgantukasodhanatthaṃ uposathadivase ārocetabbaṃ. Pavāraṇāyapi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gilāno"
      },
      "ti gantuṃ asamattho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dūtenā"
      },
      "ti ettha anupasampannaṃ pesetuṃ na vaṭṭati, bhikkhuṃ pesetvā ārocāpetabbaṃ."
    ],
    "innerText": "Uposatheti ‘‘uposathaṃ sampāpuṇissāmā’’ti āgantukā bhikkhū āgacchanti, iddhiyā gacchantāpi uposathabhāvaṃ ñatvā otaritvā uposathaṃ karonti, tasmā āgantukasodhanatthaṃ uposathadivase ārocetabbaṃ. Pavāraṇāyapi eseva nayo. Gilānoti gantuṃ asamattho. Dūtenāti ettha anupasampannaṃ pesetuṃ na vaṭṭati, bhikkhuṃ pesetvā ārocāpetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhikkhuko"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āvāso"
      },
      "ti suññavihāro; yattha ekopi bhikkhu natthi, tattha vāsatthāya na gantabbaṃ. Na hi tattha vuttharattiyo gaṇanūpikā honti, pakatattena pana saddhiṃ vaṭṭati. Dasavidhantarāye ",
      " pana sacepi ",
      " rattiyo gaṇanūpikā na honti, antarāyato parimuccanatthāya gantabbameva. Tena vuttaṃ – ‘‘aññatra antarāyā’’ti. Nānāsaṃvāsakehi saddhiṃ vinayakammaṃ kātuṃ na vaṭṭati. Tesaṃ anārocanepi ratticchedo natthi, abhikkhukāvāsasadisameva hoti. Tena vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yatthassu bhikkhū nānāsaṃvāsakā’’"
      },
      "ti. Sesaṃ uposathakkhandhake vuttanayameva."
    ],
    "innerText": "Abhikkhukoāvāsoti suññavihāro; yattha ekopi bhikkhu natthi, tattha vāsatthāya na gantabbaṃ. Na hi tattha vuttharattiyo gaṇanūpikā honti, pakatattena pana saddhiṃ vaṭṭati. Dasavidhantarāye pana sacepi rattiyo gaṇanūpikā na honti, antarāyato parimuccanatthāya gantabbameva. Tena vuttaṃ – ‘‘aññatra antarāyā’’ti. Nānāsaṃvāsakehi saddhiṃ vinayakammaṃ kātuṃ na vaṭṭati. Tesaṃ anārocanepi ratticchedo natthi, abhikkhukāvāsasadisameva hoti. Tena vuttaṃ – ‘‘yatthassu bhikkhū nānāsaṃvāsakā’’ti. Sesaṃ uposathakkhandhake vuttanayameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "81"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekacchanne āvāse"
      },
      "tiādīsu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āvāso"
      },
      " nāma vasanatthāya katasenāsanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anāvāso"
      },
      " nāma cetiyagharaṃ bodhigharaṃ sammuñjaniaṭṭako dāruaṭṭako pānīyamāḷo vaccakuṭi dvārakoṭṭhakoti evamādi. Tatiyapadena tadubhayampi gahitaṃ. Etesu yattha katthaci ekacchanne chadanato udakapatanaṭṭhānaparicchinne okāse ukkhittako vasituṃ na labhati. ‘‘Pārivāsiko pana antoāvāseyeva na labhatī’’ti mahāpaccariyaṃ vuttaṃ. Mahāaṭṭhakathāyaṃ pana ‘‘avisesena udakapātena vārita’’nti vuttaṃ. Kurundiyaṃ ‘‘etesu ettakesu pañcavaṇṇacchadanabaddhaṭṭhānesu pārivāsikassa ca ukkhittakassa ca pakatattena saddhiṃ udakapātena vārita’’nti vuttaṃ. Tasmā nānūpacārepi ekacchanne na vaṭṭati. Sace panettha tadahupasampannepi pakatatte paṭhamaṃ pavisitvā nipanne saṭṭhivassopi pārivāsiko pacchā pavisitvā jānanto nipajjati, ratticchedo ceva vattabhedadukkaṭañca. Ajānantassa ratticchedova na vattabhedadukkaṭaṃ. Sace pana tasmiṃ paṭhamaṃ nipanne pacchā pakatatto pavisitvā nipajjati, pārivāsiko ca jānāti, ratticchedo ceva vattabhedadukkaṭañca. No ce jānāti, ratticchedova na vattabhedadukkaṭaṃ."
    ],
    "innerText": "81.Ekacchanne āvāsetiādīsu āvāso nāma vasanatthāya katasenāsanaṃ. Anāvāso nāma cetiyagharaṃ bodhigharaṃ sammuñjaniaṭṭako dāruaṭṭako pānīyamāḷo vaccakuṭi dvārakoṭṭhakoti evamādi. Tatiyapadena tadubhayampi gahitaṃ. Etesu yattha katthaci ekacchanne chadanato udakapatanaṭṭhānaparicchinne okāse ukkhittako vasituṃ na labhati. ‘‘Pārivāsiko pana antoāvāseyeva na labhatī’’ti mahāpaccariyaṃ vuttaṃ. Mahāaṭṭhakathāyaṃ pana ‘‘avisesena udakapātena vārita’’nti vuttaṃ. Kurundiyaṃ ‘‘etesu ettakesu pañcavaṇṇacchadanabaddhaṭṭhānesu pārivāsikassa ca ukkhittakassa ca pakatattena saddhiṃ udakapātena vārita’’nti vuttaṃ. Tasmā nānūpacārepi ekacchanne na vaṭṭati. Sace panettha tadahupasampannepi pakatatte paṭhamaṃ pavisitvā nipanne saṭṭhivassopi pārivāsiko pacchā pavisitvā jānanto nipajjati, ratticchedo ceva vattabhedadukkaṭañca. Ajānantassa ratticchedova na vattabhedadukkaṭaṃ. Sace pana tasmiṃ paṭhamaṃ nipanne pacchā pakatatto pavisitvā nipajjati, pārivāsiko ca jānāti, ratticchedo ceva vattabhedadukkaṭañca. No ce jānāti, ratticchedova na vattabhedadukkaṭaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vuṭṭhātabbaṃ nimantetabbo"
      },
      "ti tadahupasampannampi disvā vuṭṭhātabbameva; vuṭṭhāya ca ‘‘ahaṃ iminā sukhanisinno vuṭṭhāpito’’ti parammukhena na gantabbaṃ, ‘‘idaṃ ācariya-āsanaṃ, ettha nisīdathā’’ti evaṃ nimantetabboyeva. Navakena pana ‘‘mahātheraṃ obaddhaṃ karomī’’ti pārivāsikattherassa santikaṃ na gantabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekāsane"
      },
      "ti samānavassikāsane mañce vā pīṭhe vā ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na chamāyaṃ nisinne"
      },
      "ti pakatatte bhūmiyaṃ nisinne itarena antamaso tiṇasanthārepi uccatare vālikātalepi vā na nisīditabbaṃ, dvādasahatthaṃ pana upacāraṃ ",
      " muñcitvā nisīdituṃ vaṭṭati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekacaṅkame"
      },
      "ti sahāyena viya saddhiṃ caṅkamanto ekasmiṃ caṅkame."
    ],
    "innerText": "Vuṭṭhātabbaṃ nimantetabboti tadahupasampannampi disvā vuṭṭhātabbameva; vuṭṭhāya ca ‘‘ahaṃ iminā sukhanisinno vuṭṭhāpito’’ti parammukhena na gantabbaṃ, ‘‘idaṃ ācariya-āsanaṃ, ettha nisīdathā’’ti evaṃ nimantetabboyeva. Navakena pana ‘‘mahātheraṃ obaddhaṃ karomī’’ti pārivāsikattherassa santikaṃ na gantabbaṃ. Ekāsaneti samānavassikāsane mañce vā pīṭhe vā . Na chamāyaṃ nisinneti pakatatte bhūmiyaṃ nisinne itarena antamaso tiṇasanthārepi uccatare vālikātalepi vā na nisīditabbaṃ, dvādasahatthaṃ pana upacāraṃ muñcitvā nisīdituṃ vaṭṭati. Ekacaṅkameti sahāyena viya saddhiṃ caṅkamanto ekasmiṃ caṅkame."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Chamāyaṃ caṅkamanta"
      },
      "nti chamāyaṃ caṅkamante, ayameva vā pāṭho. Ayaṃ panettha attho – akataparicchedāya bhūmiyā caṅkamante paricchedaṃ katvā vālikaṃ ākiritvā ālambanaṃ yojetvā katacaṅkame ",
      " nīcepi na caṅkamitabbaṃ, ko pana vādo iṭṭhakācayasampanne vedikāparikkhitteti! Sace pana pākāraparikkhitto hoti dvārakoṭṭhakayutto pabbatantaravanantaragumbantaresu vā suppaṭicchanno, tādise caṅkame caṅkamituṃ vaṭṭati. Appaṭicchannepi upacāraṃ muñcitvā vaṭṭati."
    ],
    "innerText": "Chamāyaṃ caṅkamantanti chamāyaṃ caṅkamante, ayameva vā pāṭho. Ayaṃ panettha attho – akataparicchedāya bhūmiyā caṅkamante paricchedaṃ katvā vālikaṃ ākiritvā ālambanaṃ yojetvā katacaṅkame nīcepi na caṅkamitabbaṃ, ko pana vādo iṭṭhakācayasampanne vedikāparikkhitteti! Sace pana pākāraparikkhitto hoti dvārakoṭṭhakayutto pabbatantaravanantaragumbantaresu vā suppaṭicchanno, tādise caṅkame caṅkamituṃ vaṭṭati. Appaṭicchannepi upacāraṃ muñcitvā vaṭṭati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vuḍḍhatarenā"
      },
      "ti ettha sace vuḍḍhatare pārivāsike paṭhamaṃ nipanne itaro jānanto pacchā nipajjati, ratticchedo cassa hoti vattabhede ca dukkaṭaṃ. Vuḍḍhatarassa pana ratticchedova na vattabhedadukkaṭaṃ. Ajānitvā nipajjati, dvinnampi vattabhedo natthi, ratticchedo pana hoti. Atha navakapārivāsike paṭhamaṃ nipanne vuḍḍhataro pacchā nipajjati, navako ca jānāti, ratti cassa chijjati, vattabhede ca dukkaṭaṃ hoti. Vuḍḍhatarassa ratticchedova na vattabhedo. No ce jānāti, dvinnampi vattabhedo natthi, ratticchedo pana hoti. Sace dvepi apacchāpurimaṃ nipajjanti, vuḍḍhatarassa ratticchedova itarassa vattabhedopīti kurundiyaṃ vuttaṃ. Dve pārivāsikā samavassā, eko paṭhamaṃ nipanno, eko jānantova pacchā nipajjati, ratti ca chijjati, vattabhede ca dukkaṭaṃ. Paṭhamaṃ nipannassa ratticchedova na vattabhedo. Sace pacchā nipajjantopi na jānāti, dvinnampi vattabhedo natthi, ratticchedo ",
      " pana hoti. Sace dvepi apacchāpurimaṃ nipajjanti, dvinnampi ratticchedoyeva, na vattabhedo. Sace hi dve pārivāsikā ekato vaseyyuṃ, te aññamaññassa ajjhācāraṃ ñatvā agāravā vā vippaṭisārino vā hutvā pāpiṭṭhataraṃ vā āpattiṃ āpajjeyyuṃ vibbhameyyuṃ vā, tasmā nesaṃ sahaseyyā sabbappakārena paṭikkhittā. Sesaṃ vuttanayeneva veditabbaṃ. Mūlāyapaṭikassanārahādayo cettha pārivāsikānaṃ pakatattaṭṭhāne ṭhitāti veditabbā."
    ],
    "innerText": "Vuḍḍhatarenāti ettha sace vuḍḍhatare pārivāsike paṭhamaṃ nipanne itaro jānanto pacchā nipajjati, ratticchedo cassa hoti vattabhede ca dukkaṭaṃ. Vuḍḍhatarassa pana ratticchedova na vattabhedadukkaṭaṃ. Ajānitvā nipajjati, dvinnampi vattabhedo natthi, ratticchedo pana hoti. Atha navakapārivāsike paṭhamaṃ nipanne vuḍḍhataro pacchā nipajjati, navako ca jānāti, ratti cassa chijjati, vattabhede ca dukkaṭaṃ hoti. Vuḍḍhatarassa ratticchedova na vattabhedo. No ce jānāti, dvinnampi vattabhedo natthi, ratticchedo pana hoti. Sace dvepi apacchāpurimaṃ nipajjanti, vuḍḍhatarassa ratticchedova itarassa vattabhedopīti kurundiyaṃ vuttaṃ. Dve pārivāsikā samavassā, eko paṭhamaṃ nipanno, eko jānantova pacchā nipajjati, ratti ca chijjati, vattabhede ca dukkaṭaṃ. Paṭhamaṃ nipannassa ratticchedova na vattabhedo. Sace pacchā nipajjantopi na jānāti, dvinnampi vattabhedo natthi, ratticchedo pana hoti. Sace dvepi apacchāpurimaṃ nipajjanti, dvinnampi ratticchedoyeva, na vattabhedo. Sace hi dve pārivāsikā ekato vaseyyuṃ, te aññamaññassa ajjhācāraṃ ñatvā agāravā vā vippaṭisārino vā hutvā pāpiṭṭhataraṃ vā āpattiṃ āpajjeyyuṃ vibbhameyyuṃ vā, tasmā nesaṃ sahaseyyā sabbappakārena paṭikkhittā. Sesaṃ vuttanayeneva veditabbaṃ. Mūlāyapaṭikassanārahādayo cettha pārivāsikānaṃ pakatattaṭṭhāne ṭhitāti veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pārivāsikacatuttho ce, bhikkhave, parivāsa"
      },
      "nti ettha pārivāsikaṃ catutthaṃ katvā aññassa parivāsadānādīni kātuṃ na vaṭṭati. Etesvevāyaṃ gaṇapūrako ",
      " na hoti, sesasaṅghakammesu hoti. Gaṇe pana appahonte vattaṃ nikkhipāpetvā gaṇapūrako kātabboti."
    ],
    "innerText": "Pārivāsikacatuttho ce, bhikkhave, parivāsanti ettha pārivāsikaṃ catutthaṃ katvā aññassa parivāsadānādīni kātuṃ na vaṭṭati. Etesvevāyaṃ gaṇapūrako na hoti, sesasaṅghakammesu hoti. Gaṇe pana appahonte vattaṃ nikkhipāpetvā gaṇapūrako kātabboti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "83"
      },
      ". Imaṃ pana vattakathaṃ sutvā vinayadharaupālittherassa rahogatassa evaṃ parivitakko udapādi – ‘‘bhagavatā bahu pārivāsikavattaṃ paññattaṃ, katihi nu kho ettha kāraṇehi ratticchedo hotī’’ti! So bhagavantaṃ upasaṅkamitvā tamatthaṃ pucchi. Bhagavā cassa byākāsi. Tena vuttaṃ – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘atha kho āyasmā upāli…pe… ratticchedā’’"
      },
      "ti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sahavāso"
      },
      "ti yvāyaṃ pakatattena ",
      " bhikkhunā saddhiṃ ekacchannetiādinā nayena vutto ekato vāso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vippavāso"
      },
      "ti ekakasseva vāso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anārocanā"
      },
      "ti āgantukādīnaṃ anārocanā. Etesu tīsu ekekena kāraṇena ratticchedo hoti."
    ],
    "innerText": "83. Imaṃ pana vattakathaṃ sutvā vinayadharaupālittherassa rahogatassa evaṃ parivitakko udapādi – ‘‘bhagavatā bahu pārivāsikavattaṃ paññattaṃ, katihi nu kho ettha kāraṇehi ratticchedo hotī’’ti! So bhagavantaṃ upasaṅkamitvā tamatthaṃ pucchi. Bhagavā cassa byākāsi. Tena vuttaṃ – ‘‘atha kho āyasmā upāli…pe… ratticchedā’’ti. Tattha sahavāsoti yvāyaṃ pakatattena bhikkhunā saddhiṃ ekacchannetiādinā nayena vutto ekato vāso. Vippavāsoti ekakasseva vāso. Anārocanāti āgantukādīnaṃ anārocanā. Etesu tīsu ekekena kāraṇena ratticchedo hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "84"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na sakkontī"
      },
      "ti saṅghassa mahantatāya tattha tattha gantvā sabbesaṃ ārocetuṃ asakkontā sodhetuṃ na sakkonti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parivāsaṃ nikkhipāmi, vattaṃ nikkhipāmī"
      },
      "ti imesu dvīsu padesu ekenāpi nikkhittova hoti parivāso; dvīhi sunikkhittoyeva. Samādānepi eseva nayo. Evaṃ vattaṃ samādiyitvā parivutthaparivāsassa ",
      " mānattaṃ gaṇhato puna vattasamādānakiccaṃ natthi, samādinnavattoyeva hesa tasmāssa chārattaṃ mānattaṃ dātabbaṃ, ciṇṇamānatto abbhetabbo. Evaṃ anāpattiko hutvā suddhante patiṭṭhito tisso sikkhā pūretvā dukkhassantaṃ karissatīti."
    ],
    "innerText": "84.Na sakkontīti saṅghassa mahantatāya tattha tattha gantvā sabbesaṃ ārocetuṃ asakkontā sodhetuṃ na sakkonti. Parivāsaṃ nikkhipāmi, vattaṃ nikkhipāmīti imesu dvīsu padesu ekenāpi nikkhittova hoti parivāso; dvīhi sunikkhittoyeva. Samādānepi eseva nayo. Evaṃ vattaṃ samādiyitvā parivutthaparivāsassa mānattaṃ gaṇhato puna vattasamādānakiccaṃ natthi, samādinnavattoyeva hesa tasmāssa chārattaṃ mānattaṃ dātabbaṃ, ciṇṇamānatto abbhetabbo. Evaṃ anāpattiko hutvā suddhante patiṭṭhito tisso sikkhā pūretvā dukkhassantaṃ karissatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pārivāsikavattakathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Mūlāyapaṭikassanārahavattakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "86"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mūlāyapaṭikassanārahā bhikkhū sādiyanti pakatattāna"
      },
      "nti ṭhapetvā navakataraṃ mūlāyapaṭikassanārahaṃ avasesānaṃ antamaso pārivāsikādīnampi. Imesañhi pārivāsikamūlāyapaṭikassanārahamānattārahamānattācārikabbhānārahānaṃ pañcannaṃ ṭhapetvā attano attano navakataraṃ, sesā sabbe pakatattā eva. Kasmā? Mithu yathāvuḍḍhaṃ abhivādanādīnaṃ anuññātattā. Tena vuttaṃ – ‘‘avasesānaṃ antamaso pārivāsikādīnampī’’ti. Mūlāyapaṭikassanārahādilakkhaṇaṃ pana nesaṃ parato ",
      " āvibhavissati. Sesamettha ito paresu ca mānattārahādivattesu pārivāsikavatte vuttanayeneva veditabbaṃ."
    ],
    "innerText": "86.Mūlāyapaṭikassanārahā bhikkhū sādiyanti pakatattānanti ṭhapetvā navakataraṃ mūlāyapaṭikassanārahaṃ avasesānaṃ antamaso pārivāsikādīnampi. Imesañhi pārivāsikamūlāyapaṭikassanārahamānattārahamānattācārikabbhānārahānaṃ pañcannaṃ ṭhapetvā attano attano navakataraṃ, sesā sabbe pakatattā eva. Kasmā? Mithu yathāvuḍḍhaṃ abhivādanādīnaṃ anuññātattā. Tena vuttaṃ – ‘‘avasesānaṃ antamaso pārivāsikādīnampī’’ti. Mūlāyapaṭikassanārahādilakkhaṇaṃ pana nesaṃ parato āvibhavissati. Sesamettha ito paresu ca mānattārahādivattesu pārivāsikavatte vuttanayeneva veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "87"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mūlāyapaṭikassanārahacatuttho ce"
      },
      "tiādīsupi yatheva pārivāsiko; evaṃ etepi etesu vinayakammesu gaṇapūrakā na honti, sesasaṅghakammesu honti."
    ],
    "innerText": "87.Mūlāyapaṭikassanārahacatuttho cetiādīsupi yatheva pārivāsiko; evaṃ etepi etesu vinayakammesu gaṇapūrakā na honti, sesasaṅghakammesu honti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Mūlāyapaṭikassanārahavattakathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Mānattacārikavattakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "90"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mānattacārikassa"
      },
      " vattesu ‘‘devasikaṃ ārocetabba’’nti viseso."
    ],
    "innerText": "90.Mānattacārikassa vattesu ‘‘devasikaṃ ārocetabba’’nti viseso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "92"
      },
      ". Ratticchedesu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ūne gaṇe"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gaṇo"
      },
      "ti cattāro vā atirekā vā; tasmā sacepi tīhi bhikkhūhi saddhiṃ vasati, ratticchedo hotiyeva. Mānattanikkhepasamādānesu vuttasadisova vinicchayo. Sesaṃ sabbattha uttānamevāti."
    ],
    "innerText": "92. Ratticchedesu ūne gaṇeti ettha gaṇoti cattāro vā atirekā vā; tasmā sacepi tīhi bhikkhūhi saddhiṃ vasati, ratticchedo hotiyeva. Mānattanikkhepasamādānesu vuttasadisova vinicchayo. Sesaṃ sabbattha uttānamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Mānattacārikavattakathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pārivāsikakkhandhakavaṇṇanā niṭṭhitā."
  }
]