[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "30. Garubhaṇḍavinicchayakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "227"
      },
      ". Evaṃ ",
      " kathinavinicchayaṃ kathetvā idāni garubhaṇḍādivinicchayaṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘garubhaṇḍānīti etthā’’"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "garū"
      },
      "ti –"
    ],
    "innerText": "227. Evaṃ kathinavinicchayaṃ kathetvā idāni garubhaṇḍādivinicchayaṃ dassetuṃ ‘‘garubhaṇḍānīti etthā’’tiādimāha. Tattha garūti –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Pume ācariyādimhi, garu mātāpitūsupi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Garu tīsu mahante ca, dujjarālahukesu cā’’ti. –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Vuttesu anekatthesu alahukavācako. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhaṇḍa"
      },
      "-saddo ‘‘bhājanādiparikkhāre, bhaṇḍaṃ mūladhanepi cā’’ti ettha bhājanādiparikkhārattho hoti. Vacanattho pana garanti uggacchanti uggatā pākaṭā hontīti garūni, bhaḍitabbāni icchitabbānīti bhaṇḍāni, garūni ca tāni bhaṇḍāni cāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "garubhaṇḍāni,"
      },
      " ārāmādīni vatthūni. Iti ādinā nayena senāsanakkhandhake bhagavatā dassitāni imāni pañca vatthūni garubhaṇḍāni nāmāti yojetabbaṃ."
    ],
    "innerText": "Vuttesu anekatthesu alahukavācako. Bhaṇḍa-saddo ‘‘bhājanādiparikkhāre, bhaṇḍaṃ mūladhanepi cā’’ti ettha bhājanādiparikkhārattho hoti. Vacanattho pana garanti uggacchanti uggatā pākaṭā hontīti garūni, bhaḍitabbāni icchitabbānīti bhaṇḍāni, garūni ca tāni bhaṇḍāni cāti garubhaṇḍāni, ārāmādīni vatthūni. Iti ādinā nayena senāsanakkhandhake bhagavatā dassitāni imāni pañca vatthūni garubhaṇḍāni nāmāti yojetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Mañcesu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "masārako"
      },
      "ti mañcapāde vijjhitvā tattha aṭaniyo pavesetvā kato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bundikābaddho"
      },
      "ti aṭanīhi mañcapāde ḍaṃsāpetvā pallaṅkasaṅkhepena kato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kuḷīrapādako"
      },
      "ti assameṇḍakādīnaṃ pādasadisehi pādehi kato. Yo vā pana koci vaṅkapādako, ayaṃ vuccati ‘‘kuḷīrapādako’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āhaccapādako"
      },
      "ti ayaṃ pana ‘‘āhaccapādako nāma mañco aṅge vijjhitvā kato hotī’’ti evaṃ parato pāḷiyaṃyeva (pāci. 131) vutto, tasmā aṭaniyo vijjhitvā ",
      " tattha pādasikhaṃ pavesetvā upari āṇiṃ datvā katamañco āhaccapādakoti veditabbo. Pīṭhepi eseva nayo."
    ],
    "innerText": "Mañcesu masārakoti mañcapāde vijjhitvā tattha aṭaniyo pavesetvā kato. Bundikābaddhoti aṭanīhi mañcapāde ḍaṃsāpetvā pallaṅkasaṅkhepena kato. Kuḷīrapādakoti assameṇḍakādīnaṃ pādasadisehi pādehi kato. Yo vā pana koci vaṅkapādako, ayaṃ vuccati ‘‘kuḷīrapādako’’ti. Āhaccapādakoti ayaṃ pana ‘‘āhaccapādako nāma mañco aṅge vijjhitvā kato hotī’’ti evaṃ parato pāḷiyaṃyeva (pāci. 131) vutto, tasmā aṭaniyo vijjhitvā tattha pādasikhaṃ pavesetvā upari āṇiṃ datvā katamañco āhaccapādakoti veditabbo. Pīṭhepi eseva nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uṇṇabhisiādīnaṃ pañcannaṃ aññatarā"
      },
      "ti uṇṇabhisi coḷabhisi vākabhisi tiṇabhisi paṇṇabhisīti imesaṃ pañcannaṃ bhisīnaṃ aññatarā ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañca bhisiyo"
      },
      "ti pañcahi uṇṇādīhi pūritabhisiyo. Tūlagaṇanāya hi etāsaṃ gaṇanā. Tattha uṇṇaggahaṇena na kevalaṃ eḷakalomameva gahitaṃ, ṭhapetvā pana manussalomaṃ yaṃ kiñci kappiyākappiyamaṃsajātīnaṃ pakkhicatuppadānaṃ lomaṃ, sabbaṃ idha uṇṇaggahaṇeneva gahitaṃ, tasmā channaṃ cīvarānaṃ, channaṃ anulomacīvarānañca aññatarena bhisicchaviṃ katvā taṃ sabbaṃ pakkhipitvā bhisiṃ kātuṃ vaṭṭati. Eḷakalomāni pana apakkhipitvā kambalameva catugguṇaṃ vā pañcaguṇaṃ vā pakkhipitvā katāpi uṇṇabhisisaṅkhameva gacchati. Coḷabhisiādīsu yaṃ kiñci navacoḷaṃ vā purāṇacoḷaṃ vā saṃharitvā vā anto pakkhipitvā vā katā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "coḷabhisi,"
      },
      " yaṃ kiñci vākaṃ pakkhipitvā katā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vākabhisi,"
      },
      " yaṃ kiñci tiṇaṃ pakkhipitvā katā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tiṇabhisi,"
      },
      " aññatra suddhatamālapattaṃ yaṃ kiñci paṇṇaṃ pakkhipitvā katā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṇṇabhisī"
      },
      "ti veditabbā. Tamālapattaṃ pana aññena missameva vaṭṭati, suddhaṃ na vaṭṭati. Bhisiyā pamāṇaniyamo natthi, mañcabhisi pīṭhabhisi bhūmattharaṇabhisi caṅkamanabhisi pādapuñchanabhisīti etāsaṃ anurūpato sallakkhetvā attano rucivasena pamāṇaṃ kātabbaṃ. Yaṃ panetaṃ uṇṇādipañcavidhatūlampi bhisiyaṃ vaṭṭati, taṃ masūrakepi vaṭṭatīti kurundiyaṃ vuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "masūrake"
      },
      "ti cammamayabhisiyaṃ. Etena masūrakaṃ paribhuñjituṃ vaṭṭatīti siddhaṃ hoti."
    ],
    "innerText": "Uṇṇabhisiādīnaṃ pañcannaṃ aññatarāti uṇṇabhisi coḷabhisi vākabhisi tiṇabhisi paṇṇabhisīti imesaṃ pañcannaṃ bhisīnaṃ aññatarā . Pañca bhisiyoti pañcahi uṇṇādīhi pūritabhisiyo. Tūlagaṇanāya hi etāsaṃ gaṇanā. Tattha uṇṇaggahaṇena na kevalaṃ eḷakalomameva gahitaṃ, ṭhapetvā pana manussalomaṃ yaṃ kiñci kappiyākappiyamaṃsajātīnaṃ pakkhicatuppadānaṃ lomaṃ, sabbaṃ idha uṇṇaggahaṇeneva gahitaṃ, tasmā channaṃ cīvarānaṃ, channaṃ anulomacīvarānañca aññatarena bhisicchaviṃ katvā taṃ sabbaṃ pakkhipitvā bhisiṃ kātuṃ vaṭṭati. Eḷakalomāni pana apakkhipitvā kambalameva catugguṇaṃ vā pañcaguṇaṃ vā pakkhipitvā katāpi uṇṇabhisisaṅkhameva gacchati. Coḷabhisiādīsu yaṃ kiñci navacoḷaṃ vā purāṇacoḷaṃ vā saṃharitvā vā anto pakkhipitvā vā katā coḷabhisi, yaṃ kiñci vākaṃ pakkhipitvā katā vākabhisi, yaṃ kiñci tiṇaṃ pakkhipitvā katā tiṇabhisi, aññatra suddhatamālapattaṃ yaṃ kiñci paṇṇaṃ pakkhipitvā katā paṇṇabhisīti veditabbā. Tamālapattaṃ pana aññena missameva vaṭṭati, suddhaṃ na vaṭṭati. Bhisiyā pamāṇaniyamo natthi, mañcabhisi pīṭhabhisi bhūmattharaṇabhisi caṅkamanabhisi pādapuñchanabhisīti etāsaṃ anurūpato sallakkhetvā attano rucivasena pamāṇaṃ kātabbaṃ. Yaṃ panetaṃ uṇṇādipañcavidhatūlampi bhisiyaṃ vaṭṭati, taṃ masūrakepi vaṭṭatīti kurundiyaṃ vuttaṃ. Tattha masūraketi cammamayabhisiyaṃ. Etena masūrakaṃ paribhuñjituṃ vaṭṭatīti siddhaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bimbohane tīṇi tūlāni rukkhatūlaṃ latātūlaṃ poṭakītūlanti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rukkhatūla"
      },
      "nti simbalirukkhādīnaṃ yesaṃ kesañci rukkhānaṃ tūlaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Latātūla"
      },
      "nti khīravalliādīnaṃ yāsaṃ kāsañci latānaṃ tūlaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Poṭakītūla"
      },
      "nti poṭakītiṇādīnaṃ yesaṃ kesañci tiṇajātikānaṃ antamaso ucchunaḷādīnampi tūlaṃ. Sāratthadīpaniyaṃ (sārattha. ṭī. cūḷavagga 3.297) pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘poṭakītūla"
      },
      "nti erakatiṇatūla’’nti vuttaṃ, etehi tīhi sabbabhūtagāmā saṅgahitā honti. Rukkhavallitiṇajātiyo ",
      " hi muñcitvā añño bhūtagāmo nāma natthi, tasmā yassa kassaci bhūtagāmassa tūlaṃ bimbohane vaṭṭati, bhisiṃ pana pāpuṇitvā sabbampetaṃ ‘‘akappiyatūla’’nti vuccati na kevalañca bimbohane etaṃ tūlameva, haṃsamorādīnaṃ sabbasakuṇānaṃ, sīhādīnaṃ sabbacatuppadānañca ",
      " lomampi vaṭṭati. Piyaṅgupupphabakuḷapupphādi pana yaṃ kiñci pupphaṃ na vaṭṭati. Tamālapattaṃ suddhameva na vaṭṭati, missakaṃ pana vaṭṭati, bhisīnaṃ anuññātaṃ pañcavidhaṃ uṇṇāditūlampi vaṭṭati. Addhakāyikāni pana bimbohanāni na vaṭṭanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Addhakāyikānī"
      },
      "ti upaḍḍhakāyappamāṇāni, yesu kaṭito paṭṭhāya yāva sīsaṃ upadahanti ṭhapenti. Sīsappamāṇaṃ pana vaṭṭati, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sīsappamāṇaṃ"
      },
      " nāma yassa vitthārato tīsu kaṇṇesu dvinnaṃ kaṇṇānaṃ antaraṃ miniyamānaṃ vidatthi ceva caturaṅgulañca hoti, majjhaṭṭhānaṃ muṭṭhiratanaṃ hoti, dīghato pana diyaḍḍharatanaṃ vā dviratanaṃ vāti kurundiyaṃ vuttaṃ, ayaṃ sīsappamāṇassa ukkaṭṭhaparicchedo, ito uddhaṃ na vaṭṭati, heṭṭhā pana vaṭṭatīti aṭṭhakathāyaṃ (cūḷava. aṭṭha. 297) vuttaṃ. Tattha ‘‘tīsu kaṇṇesu dvinnaṃ kaṇṇāna’’nti pāṭhaṃ upanidhāya bimbohanassa ubhosu antesu ṭhapetabbacoḷakaṃ tikoṇameva karonti ekacce. ‘‘Idañca ṭhānaṃ gaṇṭhiṭṭhāna’’nti vadanti."
    ],
    "innerText": "Bimbohane tīṇi tūlāni rukkhatūlaṃ latātūlaṃ poṭakītūlanti. Tattha rukkhatūlanti simbalirukkhādīnaṃ yesaṃ kesañci rukkhānaṃ tūlaṃ. Latātūlanti khīravalliādīnaṃ yāsaṃ kāsañci latānaṃ tūlaṃ. Poṭakītūlanti poṭakītiṇādīnaṃ yesaṃ kesañci tiṇajātikānaṃ antamaso ucchunaḷādīnampi tūlaṃ. Sāratthadīpaniyaṃ (sārattha. ṭī. cūḷavagga 3.297) pana ‘‘poṭakītūlanti erakatiṇatūla’’nti vuttaṃ, etehi tīhi sabbabhūtagāmā saṅgahitā honti. Rukkhavallitiṇajātiyo hi muñcitvā añño bhūtagāmo nāma natthi, tasmā yassa kassaci bhūtagāmassa tūlaṃ bimbohane vaṭṭati, bhisiṃ pana pāpuṇitvā sabbampetaṃ ‘‘akappiyatūla’’nti vuccati na kevalañca bimbohane etaṃ tūlameva, haṃsamorādīnaṃ sabbasakuṇānaṃ, sīhādīnaṃ sabbacatuppadānañca lomampi vaṭṭati. Piyaṅgupupphabakuḷapupphādi pana yaṃ kiñci pupphaṃ na vaṭṭati. Tamālapattaṃ suddhameva na vaṭṭati, missakaṃ pana vaṭṭati, bhisīnaṃ anuññātaṃ pañcavidhaṃ uṇṇāditūlampi vaṭṭati. Addhakāyikāni pana bimbohanāni na vaṭṭanti. Addhakāyikānīti upaḍḍhakāyappamāṇāni, yesu kaṭito paṭṭhāya yāva sīsaṃ upadahanti ṭhapenti. Sīsappamāṇaṃ pana vaṭṭati, sīsappamāṇaṃ nāma yassa vitthārato tīsu kaṇṇesu dvinnaṃ kaṇṇānaṃ antaraṃ miniyamānaṃ vidatthi ceva caturaṅgulañca hoti, majjhaṭṭhānaṃ muṭṭhiratanaṃ hoti, dīghato pana diyaḍḍharatanaṃ vā dviratanaṃ vāti kurundiyaṃ vuttaṃ, ayaṃ sīsappamāṇassa ukkaṭṭhaparicchedo, ito uddhaṃ na vaṭṭati, heṭṭhā pana vaṭṭatīti aṭṭhakathāyaṃ (cūḷava. aṭṭha. 297) vuttaṃ. Tattha ‘‘tīsu kaṇṇesu dvinnaṃ kaṇṇāna’’nti pāṭhaṃ upanidhāya bimbohanassa ubhosu antesu ṭhapetabbacoḷakaṃ tikoṇameva karonti ekacce. ‘‘Idañca ṭhānaṃ gaṇṭhiṭṭhāna’’nti vadanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vimativinodaniyaṃ (vi. vi. ṭī. cūḷavagga 2.297) pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sīsappamāṇaṃ"
      },
      " nāma yattha gīvāya saha sakalaṃ sīsaṃ ṭhapetuṃ sakkā, tassa ca muṭṭhiratanaṃ vitthārappamāṇanti dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘vitthārato’"
      },
      "tiādimāha. Idañca bimbohanassa ubhosu antesu ṭhapetabbacoḷappamāṇadassanaṃ, tassa vasena bimbohanassa vitthārappamāṇaṃ paricchijjati, taṃ vaṭṭaṃ vā caturassaṃ vā katvā sibbitaṃ yathā koṭito koṭi vitthārato puthulaṭṭhānaṃ muṭṭhiratanappamāṇaṃ hoti, evaṃ sibbitabbaṃ, ito adhikaṃ na vaṭṭati. Taṃ pana antesu ṭhapitacoḷaṃ koṭiyā koṭiṃ āhacca diguṇaṃ kataṃ ",
      " tikaṇṇaṃ hoti, tesu tīsu kaṇṇesu dvinnaṃ kaṇṇānaṃ antaraṃ vidatthicaturaṅgulaṃ hoti, majjhaṭṭhānaṃ koṭito koṭiṃ āhacca muṭṭhiratanaṃ hoti, idamassa ukkaṭṭhappamāṇa’’nti vuttattā bimbohanassa ubhosu antesu ṭhapetabbacoḷakaṃ pakatiyāyeva tikaṇṇaṃ na hoti, atha kho koṭiyā koṭiṃ āhacca diguṇakatakāleyeva hoti, tasmā taṃ coḷakaṃ vaṭṭaṃ vā hotu caturassaṃ vā, diguṇaṃ katvā miniyamānaṃ tikaṇṇameva hoti, dvinnañca kaṇṇānaṃ antaraṃ caturaṅgulādhikavidatthimattaṃ hoti, tassa ca coḷakassa majjhaṭṭhānaṃ muṭṭhiratanaṃ hoti, tasseva coḷakassa pamāṇena bimbohanassa majjhaṭṭhānampi muṭṭhiratanaṃ hotīti viññāyatīti."
    ],
    "innerText": "Vimativinodaniyaṃ (vi. vi. ṭī. cūḷavagga 2.297) pana ‘‘sīsappamāṇaṃ nāma yattha gīvāya saha sakalaṃ sīsaṃ ṭhapetuṃ sakkā, tassa ca muṭṭhiratanaṃ vitthārappamāṇanti dassento ‘vitthārato’tiādimāha. Idañca bimbohanassa ubhosu antesu ṭhapetabbacoḷappamāṇadassanaṃ, tassa vasena bimbohanassa vitthārappamāṇaṃ paricchijjati, taṃ vaṭṭaṃ vā caturassaṃ vā katvā sibbitaṃ yathā koṭito koṭi vitthārato puthulaṭṭhānaṃ muṭṭhiratanappamāṇaṃ hoti, evaṃ sibbitabbaṃ, ito adhikaṃ na vaṭṭati. Taṃ pana antesu ṭhapitacoḷaṃ koṭiyā koṭiṃ āhacca diguṇaṃ kataṃ tikaṇṇaṃ hoti, tesu tīsu kaṇṇesu dvinnaṃ kaṇṇānaṃ antaraṃ vidatthicaturaṅgulaṃ hoti, majjhaṭṭhānaṃ koṭito koṭiṃ āhacca muṭṭhiratanaṃ hoti, idamassa ukkaṭṭhappamāṇa’’nti vuttattā bimbohanassa ubhosu antesu ṭhapetabbacoḷakaṃ pakatiyāyeva tikaṇṇaṃ na hoti, atha kho koṭiyā koṭiṃ āhacca diguṇakatakāleyeva hoti, tasmā taṃ coḷakaṃ vaṭṭaṃ vā hotu caturassaṃ vā, diguṇaṃ katvā miniyamānaṃ tikaṇṇameva hoti, dvinnañca kaṇṇānaṃ antaraṃ caturaṅgulādhikavidatthimattaṃ hoti, tassa ca coḷakassa majjhaṭṭhānaṃ muṭṭhiratanaṃ hoti, tasseva coḷakassa pamāṇena bimbohanassa majjhaṭṭhānampi muṭṭhiratanaṃ hotīti viññāyatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Kambalameva…pe… uṇṇabhisisaṅkhameva gacchatī"
      },
      "ti sāmaññato vuttattā gonakādiakappiyampi uṇṇamayattharaṇaṃ bhisiyaṃ pakkhipitvā sayituṃ vaṭṭatīti daṭṭhabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Masūrake"
      },
      "ti cammamayabhisiyaṃ, cammamayaṃ pana bimbohanaṃ tūlapuṇṇampi na vaṭṭatī’’ti ca vimativinodaniyaṃ ",
      " (vi. vi. ṭī. cūḷavagga 2.297) vuttaṃ. Sāratthadīpaniyaṃ (sārattha. ṭī. cūḷavagga 3.297) pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sīsappamāṇa"
      },
      "nti yattha galavāṭakato paṭṭhāya sabbasīsaṃ upadahanti, taṃ sīsappamāṇaṃ hoti, tañca ukkaṭṭhaparicchedato tiriyaṃ muṭṭhiratanaṃ hotīti dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘yattha vitthārato tīsu kaṇṇesū’"
      },
      "tiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Majjhaṭṭhānaṃ muṭṭhiratanaṃ hotī"
      },
      "ti bimbohanassa majjhaṭṭhānaṃ tiriyato muṭṭhiratanappamāṇaṃ hotī’’ti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Arañjaro"
      },
      "ti bahuudakagaṇhanakā mahācāṭi. Jalaṃ gaṇhituṃ alanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "arañjaro,"
      },
      " vaṭṭacāṭi viya hutvā thokaṃ dīghamukho majjhe paricchedaṃ dassetvā katoti gaṇṭhipadesu vuttaṃ. Vuttañhetaṃ aṭṭhakathāyanti ajjhāhārasambandho."
    ],
    "innerText": "‘‘Kambalameva…pe… uṇṇabhisisaṅkhameva gacchatīti sāmaññato vuttattā gonakādiakappiyampi uṇṇamayattharaṇaṃ bhisiyaṃ pakkhipitvā sayituṃ vaṭṭatīti daṭṭhabbaṃ. Masūraketi cammamayabhisiyaṃ, cammamayaṃ pana bimbohanaṃ tūlapuṇṇampi na vaṭṭatī’’ti ca vimativinodaniyaṃ (vi. vi. ṭī. cūḷavagga 2.297) vuttaṃ. Sāratthadīpaniyaṃ (sārattha. ṭī. cūḷavagga 3.297) pana ‘‘sīsappamāṇanti yattha galavāṭakato paṭṭhāya sabbasīsaṃ upadahanti, taṃ sīsappamāṇaṃ hoti, tañca ukkaṭṭhaparicchedato tiriyaṃ muṭṭhiratanaṃ hotīti dassetuṃ ‘yattha vitthārato tīsu kaṇṇesū’tiādimāha. Majjhaṭṭhānaṃ muṭṭhiratanaṃ hotīti bimbohanassa majjhaṭṭhānaṃ tiriyato muṭṭhiratanappamāṇaṃ hotī’’ti vuttaṃ. Arañjaroti bahuudakagaṇhanakā mahācāṭi. Jalaṃ gaṇhituṃ alanti arañjaro, vaṭṭacāṭi viya hutvā thokaṃ dīghamukho majjhe paricchedaṃ dassetvā katoti gaṇṭhipadesu vuttaṃ. Vuttañhetaṃ aṭṭhakathāyanti ajjhāhārasambandho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dvisaṅgahāni"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dve hontī"
      },
      "ti dve paṭhamadutiyaavissajjiyāni ‘‘ārāmo ārāmavatthū’’ti ca ‘‘vihāro vihāravatthū’’ti ca vuttadvedvevatthusaṅgahāni honti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatiyaṃ avissajjiyaṃ"
      },
      " ‘‘mañco pīṭhaṃ bhisi bimbohana’’nti vuttacatuvatthusaṅgahaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Catutthaṃ avissajjiyaṃ"
      },
      " ‘‘lohakumbhī lohabhāṇakaṃ lohavārako lohakaṭāhaṃ vāsi pharasu kuṭhārī kudālo nikhādana’’nti vuttanavakoṭṭhāsavantaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañcamaṃ avissajjiyaṃ"
      },
      " ‘‘valli veḷu muñjaṃ pabbajaṃ tiṇaṃ mattikā dārubhaṇḍaṃ mattikābhaṇḍa’’nti vuttaaṭṭhabhedanaṃ aṭṭhapabhedavantaṃ hotīti yojanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañcanimmalalocano"
      },
      "ti maṃsacakkhudibbacakkhudhammacakkhubuddhacakkhusamantacakkhūnaṃ vasena nimmalapañcalocano."
    ],
    "innerText": "Dvisaṅgahānidve hontīti dve paṭhamadutiyaavissajjiyāni ‘‘ārāmo ārāmavatthū’’ti ca ‘‘vihāro vihāravatthū’’ti ca vuttadvedvevatthusaṅgahāni honti. Tatiyaṃ avissajjiyaṃ ‘‘mañco pīṭhaṃ bhisi bimbohana’’nti vuttacatuvatthusaṅgahaṃ hoti. Catutthaṃ avissajjiyaṃ ‘‘lohakumbhī lohabhāṇakaṃ lohavārako lohakaṭāhaṃ vāsi pharasu kuṭhārī kudālo nikhādana’’nti vuttanavakoṭṭhāsavantaṃ hoti. Pañcamaṃ avissajjiyaṃ ‘‘valli veḷu muñjaṃ pabbajaṃ tiṇaṃ mattikā dārubhaṇḍaṃ mattikābhaṇḍa’’nti vuttaaṭṭhabhedanaṃ aṭṭhapabhedavantaṃ hotīti yojanā. Pañcanimmalalocanoti maṃsacakkhudibbacakkhudhammacakkhubuddhacakkhusamantacakkhūnaṃ vasena nimmalapañcalocano."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Senāsanakkhandhake avissajjiyaṃ kīṭāgirivatthusmiṃ avebhaṅgiya"
      },
      "nti ettha ‘‘senāsanakkhandhake gāmakāvāsavatthusmiṃ avissajjiyaṃ kīṭāgirivatthusmiṃ avebhaṅgiya’’nti vattabbaṃ. Kasmā? Dvinnampi vatthūnaṃ senāsanakkhandhake āgatattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Senāsanakkhandhake"
      },
      "ti ayaṃ sāmaññādhāro. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gāmakāvāsavatthusmiṃ kīṭāgirivatthusmi"
      },
      "nti visesādhāro. Ayamattho pāḷiṃ oloketvā paccetabbo. Teneva hi samantapāsādikāyaṃ (cūḷava. aṭṭha. 321) ‘‘senāsanakkhandhake’’ti avatvā ‘‘idha’’icceva vuttaṃ, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "idhā"
      },
      "ti iminā gāmakāvāsavatthuṃ dasseti, kīṭāgirivatthu pana sarūpato dassitameva. Sāmaññādhāro pana taṃsaṃvaṇṇanābhāvato avuttopi sijjhatīti na vuttoti viññāyati."
    ],
    "innerText": "Senāsanakkhandhake avissajjiyaṃ kīṭāgirivatthusmiṃ avebhaṅgiyanti ettha ‘‘senāsanakkhandhake gāmakāvāsavatthusmiṃ avissajjiyaṃ kīṭāgirivatthusmiṃ avebhaṅgiya’’nti vattabbaṃ. Kasmā? Dvinnampi vatthūnaṃ senāsanakkhandhake āgatattā. Senāsanakkhandhaketi ayaṃ sāmaññādhāro. Gāmakāvāsavatthusmiṃ kīṭāgirivatthusminti visesādhāro. Ayamattho pāḷiṃ oloketvā paccetabbo. Teneva hi samantapāsādikāyaṃ (cūḷava. aṭṭha. 321) ‘‘senāsanakkhandhake’’ti avatvā ‘‘idha’’icceva vuttaṃ, idhāti iminā gāmakāvāsavatthuṃ dasseti, kīṭāgirivatthu pana sarūpato dassitameva. Sāmaññādhāro pana taṃsaṃvaṇṇanābhāvato avuttopi sijjhatīti na vuttoti viññāyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "228"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Thāvarena ca thāvaraṃ, garubhaṇḍena ca garubhaṇḍa"
      },
      "nti ettha pañcasu koṭṭhāsesu purimadvayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "thāvaraṃ,"
      },
      " pacchimattayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "garubhaṇḍa"
      },
      "nti veditabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samakameva detī"
      },
      "ti ettha ūnakaṃ dentampi vihāravatthusāmantaṃ ",
      " gahetvā dūrataraṃ dukkhagopaṃ vissajjetuṃ vaṭṭatīti ",
      " daṭṭhabbaṃ. Vakkhati hi ‘‘bhikkhūnañce mahagghataraṃ…pe… sampaṭicchituṃ vaṭṭatī’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jānāpetvā"
      },
      "ti bhikkhusaṅghassa jānāpetvā, apaloketvāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nanu tumhākaṃ bahutaraṃ rukkhāti vattabba"
      },
      "nti idaṃ sāmikesu attano bhaṇḍassa mahagghataṃ ajānitvā dentesu taṃ ñatvā theyyacittena gaṇhato avahāro hotīti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vihārena vihāro parivattetabbo"
      },
      "ti savatthukena aññesaṃ bhūmiyaṃ katapāsādādinā, avatthukena vā savatthukaṃ parivattetabbaṃ, avatthukaṃ pana avatthukeneva parivattetabbaṃ kevalaṃ pāsādassa bhūmito athāvarattā. Evaṃ thāvaresupi thāvaravibhāgaṃ ñatvāva parivattetabbaṃ."
    ],
    "innerText": "228.Thāvarena ca thāvaraṃ, garubhaṇḍena ca garubhaṇḍanti ettha pañcasu koṭṭhāsesu purimadvayaṃ thāvaraṃ, pacchimattayaṃ garubhaṇḍanti veditabbaṃ. Samakameva detīti ettha ūnakaṃ dentampi vihāravatthusāmantaṃ gahetvā dūrataraṃ dukkhagopaṃ vissajjetuṃ vaṭṭatīti daṭṭhabbaṃ. Vakkhati hi ‘‘bhikkhūnañce mahagghataraṃ…pe… sampaṭicchituṃ vaṭṭatī’’ti. Jānāpetvāti bhikkhusaṅghassa jānāpetvā, apaloketvāti attho. Nanu tumhākaṃ bahutaraṃ rukkhāti vattabbanti idaṃ sāmikesu attano bhaṇḍassa mahagghataṃ ajānitvā dentesu taṃ ñatvā theyyacittena gaṇhato avahāro hotīti vuttaṃ. Vihārena vihāro parivattetabboti savatthukena aññesaṃ bhūmiyaṃ katapāsādādinā, avatthukena vā savatthukaṃ parivattetabbaṃ, avatthukaṃ pana avatthukeneva parivattetabbaṃ kevalaṃ pāsādassa bhūmito athāvarattā. Evaṃ thāvaresupi thāvaravibhāgaṃ ñatvāva parivattetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Kappiyamañcā sampaṭicchitabbā"
      },
      "ti iminā suvaṇṇādivicittaṃ akappiyamañcaṃ ‘saṅghassā’ti vuttepi sampaṭicchituṃ na vaṭṭatīti dasseti. ‘Vihārassa demā’ti vutte saṅghassa vaṭṭati, na puggalassa khettādi viyāti daṭṭhabba’’nti vimativinodaniyaṃ (vi. vi. ṭī. cūḷavagga 2.321) vuttaṃ. Sāratthadīpaniyaṃ (sārattha. ṭī. cūḷvagga 3.321) pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kappiyamañcā sampaṭicchitabbā"
      },
      "ti ‘saṅghassa demā’ti dinnaṃ sandhāya vuttaṃ. Sace pana ‘vihārassa demā’ti vadanti, suvaṇṇarajatamayādiakappiyamañcepi sampaṭicchituṃ vaṭṭatī’’ti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na kevalaṃ…pe… parivattetuṃ vaṭṭantī"
      },
      "ti iminā athāvarena thāvarampi athāvarampi parivattetuṃ vaṭṭatīti dasseti. Thāvarena athāvarameva hi parivattetuṃ na vaṭṭati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Akappiyaṃ vā mahagghaṃ kappiyaṃ vā"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "akappiyaṃ"
      },
      " nāma suvaṇṇamayamañcādi akappiyabhisibimbohanāni ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahagghaṃ kappiyaṃ"
      },
      " nāma dantamayamañcādi, pāvārādikappiyaattharaṇādīni cā’’ti sāratthadīpaniyaṃ vuttaṃ, vimativinodaniyaṃ pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘akappiyaṃ vā"
      },
      "ti āsandiādi, pamāṇātikkantaṃ bimbohanādi ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahagghaṃ kappiyaṃ vā"
      },
      "ti suvaṇṇādivicittaṃ kappiyavohārena dinna’’nti vuttaṃ."
    ],
    "innerText": "‘‘Kappiyamañcā sampaṭicchitabbāti iminā suvaṇṇādivicittaṃ akappiyamañcaṃ ‘saṅghassā’ti vuttepi sampaṭicchituṃ na vaṭṭatīti dasseti. ‘Vihārassa demā’ti vutte saṅghassa vaṭṭati, na puggalassa khettādi viyāti daṭṭhabba’’nti vimativinodaniyaṃ (vi. vi. ṭī. cūḷavagga 2.321) vuttaṃ. Sāratthadīpaniyaṃ (sārattha. ṭī. cūḷvagga 3.321) pana ‘‘kappiyamañcā sampaṭicchitabbāti ‘saṅghassa demā’ti dinnaṃ sandhāya vuttaṃ. Sace pana ‘vihārassa demā’ti vadanti, suvaṇṇarajatamayādiakappiyamañcepi sampaṭicchituṃ vaṭṭatī’’ti vuttaṃ. Na kevalaṃ…pe… parivattetuṃ vaṭṭantīti iminā athāvarena thāvarampi athāvarampi parivattetuṃ vaṭṭatīti dasseti. Thāvarena athāvarameva hi parivattetuṃ na vaṭṭati. ‘‘Akappiyaṃ vā mahagghaṃ kappiyaṃ vāti ettha akappiyaṃ nāma suvaṇṇamayamañcādi akappiyabhisibimbohanāni ca. Mahagghaṃ kappiyaṃ nāma dantamayamañcādi, pāvārādikappiyaattharaṇādīni cā’’ti sāratthadīpaniyaṃ vuttaṃ, vimativinodaniyaṃ pana ‘‘akappiyaṃ vāti āsandiādi, pamāṇātikkantaṃ bimbohanādi ca. Mahagghaṃ kappiyaṃ vāti suvaṇṇādivicittaṃ kappiyavohārena dinna’’nti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "229"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Kāḷaloha"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "…pe… bhājetabbo’’"
      },
      "ti vuttattā vaṭṭakaṃsalohamayampi bhājanaṃ puggalikampi sampaṭicchitumpi pariharitumpi vaṭṭati puggalānaṃ pariharitabbasseva bhājetabbattāti vadanti, taṃ upari ‘‘kaṃsalohavaṭṭalohabhājanavikati saṅghikaparibhogena vā gihivikaṭā vā vaṭṭatī’’tiādikena mahāpaccarivacanena virujjhati. Imassa hi ‘‘vaṭṭalohakaṃsalohānaṃ yena kenaci kato sīhaḷadīpe pādaggaṇhanako bhājetabbo’’ti vuttassa mahāaṭṭhakathāvacanassa paṭikkhepāya taṃ mahāpaccarivacanaṃ pacchā dassitaṃ, tasmā vaṭṭalohakaṃsalohamayaṃ yaṃ kiñci pādaggaṇhanakavārakampi upādāya abhājanīyameva, gihīhi dīyamānampi puggalassa sampaṭicchitumpi ",
      " na vaṭṭati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pārihāriyaṃ na vaṭṭatī"
      },
      "ti pattādiparikkhāraṃ viya sayameva paṭisāmetvā paribhuñjituṃ na vaṭṭati. Gihisantakaṃ viya ārāmikādayo ce sayameva gopetvā viniyogakāle ānetvā paṭidenti, paribhuñjituṃ vaṭṭati, ‘‘paṭisāmetvā bhikkhūnaṃ dethā’’ti vattumpi vaṭṭatīti."
    ],
    "innerText": "229.‘‘Kāḷaloha…pe… bhājetabbo’’ti vuttattā vaṭṭakaṃsalohamayampi bhājanaṃ puggalikampi sampaṭicchitumpi pariharitumpi vaṭṭati puggalānaṃ pariharitabbasseva bhājetabbattāti vadanti, taṃ upari ‘‘kaṃsalohavaṭṭalohabhājanavikati saṅghikaparibhogena vā gihivikaṭā vā vaṭṭatī’’tiādikena mahāpaccarivacanena virujjhati. Imassa hi ‘‘vaṭṭalohakaṃsalohānaṃ yena kenaci kato sīhaḷadīpe pādaggaṇhanako bhājetabbo’’ti vuttassa mahāaṭṭhakathāvacanassa paṭikkhepāya taṃ mahāpaccarivacanaṃ pacchā dassitaṃ, tasmā vaṭṭalohakaṃsalohamayaṃ yaṃ kiñci pādaggaṇhanakavārakampi upādāya abhājanīyameva, gihīhi dīyamānampi puggalassa sampaṭicchitumpi na vaṭṭati. Pārihāriyaṃ na vaṭṭatīti pattādiparikkhāraṃ viya sayameva paṭisāmetvā paribhuñjituṃ na vaṭṭati. Gihisantakaṃ viya ārāmikādayo ce sayameva gopetvā viniyogakāle ānetvā paṭidenti, paribhuñjituṃ vaṭṭati, ‘‘paṭisāmetvā bhikkhūnaṃ dethā’’ti vattumpi vaṭṭatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṇṇasūci"
      },
      " nāma lekhanīti vadanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attanā laddhānipī"
      },
      "tiādinā paṭiggahaṇe doso natthi, pariharitvā paribhogova āpattikaroti dasseti. Yathā cettha, evaṃ upari bhājanīyavāsiādīsu attano santakesupi."
    ],
    "innerText": "Paṇṇasūci nāma lekhanīti vadanti. Attanā laddhānipītiādinā paṭiggahaṇe doso natthi, pariharitvā paribhogova āpattikaroti dasseti. Yathā cettha, evaṃ upari bhājanīyavāsiādīsu attano santakesupi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anāmāsampī"
      },
      "ti suvaṇṇādimayampi, sabbaṃ taṃ āmasitvā paribhuñjituṃ vaṭṭati."
    ],
    "innerText": "Anāmāsampīti suvaṇṇādimayampi, sabbaṃ taṃ āmasitvā paribhuñjituṃ vaṭṭati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upakkhare"
      },
      "ti upakaraṇe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sikharaṃ"
      },
      " nāma yena paribbhamantā chindanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pattabandhako"
      },
      " nāma pattassa gaṇṭhiādikārako. ‘‘Paṭimānaṃ suvaṇṇādipattakārako’’tipi vadanti."
    ],
    "innerText": "Upakkhareti upakaraṇe. Sikharaṃ nāma yena paribbhamantā chindanti. Pattabandhako nāma pattassa gaṇṭhiādikārako. ‘‘Paṭimānaṃ suvaṇṇādipattakārako’’tipi vadanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Aḍḍhabāhū"
      },
      "ti kapparato paṭṭhāya yāva aṃsakūṭa’’nti gaṇṭhipadesu vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Aḍḍhabāhu"
      },
      " nāma vidatthicaturaṅgulantipi vadantī’’ti ",
      " sāratthadīpaniyaṃ (sārattha. ṭī. cūḷavagga 2.321) vuttaṃ. Vajirabuddhiṭīkāyampi (vajira. ṭī. cūḷavagga 321) ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘aḍḍhabāhū"
      },
      "ti kapparato paṭṭhāya yāva aṃsakūṭanti likhita’’nti vuttaṃ. Vimativinodaniyaṃ (vi. vi. ṭī. cūḷavagga 2.321) pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘aḍḍhabāhuppamāṇā"
      },
      " nāma aḍḍhabāhumattā, aḍḍhabyāmamattātipi vadantī’’ti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yottānī"
      },
      "ti cammarajjukā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatthajātakā"
      },
      "ti saṅghikabhūmiyaṃ jātā."
    ],
    "innerText": "‘‘Aḍḍhabāhūti kapparato paṭṭhāya yāva aṃsakūṭa’’nti gaṇṭhipadesu vuttaṃ. ‘‘Aḍḍhabāhu nāma vidatthicaturaṅgulantipi vadantī’’ti sāratthadīpaniyaṃ (sārattha. ṭī. cūḷavagga 2.321) vuttaṃ. Vajirabuddhiṭīkāyampi (vajira. ṭī. cūḷavagga 321) ‘‘aḍḍhabāhūti kapparato paṭṭhāya yāva aṃsakūṭanti likhita’’nti vuttaṃ. Vimativinodaniyaṃ (vi. vi. ṭī. cūḷavagga 2.321) pana ‘‘aḍḍhabāhuppamāṇā nāma aḍḍhabāhumattā, aḍḍhabyāmamattātipi vadantī’’ti vuttaṃ. Yottānīti cammarajjukā. Tatthajātakāti saṅghikabhūmiyaṃ jātā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Aṭṭhaṅgulasūcidaṇḍamatto"
      },
      "ti dīghaso aṭṭhaṅgulamatto pariṇāhato paṇṇasūcidaṇḍamatto’’ti sāratthadīpaniyaṃ (sārattha. ṭī.. Cūḷavagga 3.321) vimativinodaniyaṃ pana (vi. vi. ṭī. cūḷavagga 2.321) ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘aṭṭhaṅgulasūcidaṇḍamatto"
      },
      "ti saradaṇḍādisūciākāratanudaṇḍakamattopī’’ti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭhaṅgulappamāṇo"
      },
      "ti dīghato aṭṭhaṅgulappamāṇo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rittapotthakopī"
      },
      "ti alikhitapotthakopi, idañca paṇṇappasaṅgena vuttaṃ."
    ],
    "innerText": "‘‘Aṭṭhaṅgulasūcidaṇḍamattoti dīghaso aṭṭhaṅgulamatto pariṇāhato paṇṇasūcidaṇḍamatto’’ti sāratthadīpaniyaṃ (sārattha. ṭī.. Cūḷavagga 3.321) vimativinodaniyaṃ pana (vi. vi. ṭī. cūḷavagga 2.321) ‘‘aṭṭhaṅgulasūcidaṇḍamattoti saradaṇḍādisūciākāratanudaṇḍakamattopī’’ti vuttaṃ. Aṭṭhaṅgulappamāṇoti dīghato aṭṭhaṅgulappamāṇo. Rittapotthakopīti alikhitapotthakopi, idañca paṇṇappasaṅgena vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āsandiko"
      },
      "ti caturassapīṭhaṃ vuccati ‘‘uccakampi āsandika’’nti (cūḷava. 297) vacanato ",
      ". Ekatobhāgena dīghapīṭhameva hi aṭṭhaṅgulapādakaṃ vaṭṭati, caturassāsandiko pana pamāṇātikkantopi vaṭṭatīti veditabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sattaṅgo"
      },
      " nāma tīsu disāsu apassayaṃ katvā katamañco, ayampi pamāṇātikkantopi vaṭṭati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhaddapīṭha"
      },
      "nti vettamayaṃ pīṭhaṃ vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pīṭhikā"
      },
      "ti pilotikabandhaṃ pīṭhameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Eḷakapādapīṭhaṃ"
      },
      " nāma dārupaṭikāya uparipāde ṭhapetvā bhojanaphalakaṃ viya katapīṭhaṃ vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āmaṇḍakavaṇṭakapīṭhaṃ"
      },
      " nāma āmalakākārena yojitabahaupādapīṭhaṃ. Imāni tāva pāḷiyaṃ āgatapīṭhāni. Dārumayaṃ pana sabbampi pīṭhaṃ vaṭṭati."
    ],
    "innerText": "Āsandikoti caturassapīṭhaṃ vuccati ‘‘uccakampi āsandika’’nti (cūḷava. 297) vacanato . Ekatobhāgena dīghapīṭhameva hi aṭṭhaṅgulapādakaṃ vaṭṭati, caturassāsandiko pana pamāṇātikkantopi vaṭṭatīti veditabbo. Sattaṅgo nāma tīsu disāsu apassayaṃ katvā katamañco, ayampi pamāṇātikkantopi vaṭṭati. Bhaddapīṭhanti vettamayaṃ pīṭhaṃ vuccati. Pīṭhikāti pilotikabandhaṃ pīṭhameva. Eḷakapādapīṭhaṃ nāma dārupaṭikāya uparipāde ṭhapetvā bhojanaphalakaṃ viya katapīṭhaṃ vuccati. Āmaṇḍakavaṇṭakapīṭhaṃ nāma āmalakākārena yojitabahaupādapīṭhaṃ. Imāni tāva pāḷiyaṃ āgatapīṭhāni. Dārumayaṃ pana sabbampi pīṭhaṃ vaṭṭati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Ghaṭṭanaphalakaṃ"
      },
      " nāma yattha ṭhapetvā rajitacīvaraṃ hatthena ghaṭṭenti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ghaṭṭanamuggaro"
      },
      " nāma anuvātādighaṭṭanatthaṃ katoti vadantī’’ti sāratthadīpaniyaṃ (sārattha. ṭī. cūḷavagga 3.321) vuttaṃ. Vimativinodaniyaṃ (vi. vi. ṭī. cūḷavagga 2.321) ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ghaṭṭanaphalakaṃ ghaṭṭanamuggaro"
      },
      "ti idaṃ rajitacīvaraṃ ekasmiṃ maṭṭhe daṇḍamuggare ",
      " veṭhetvā ekassa maṭṭhaphalakassa upari ṭhapetvā upari aparena maṭṭhaphalakena nikkujjitvā eko upari akkamitvā tiṭṭhati, dve janā upariphalakaṃ dvīsu koṭīsu gahetvā aparāparaṃ ākaḍḍhanavikaḍḍhanaṃ karonti, etaṃ sandhāya vuttaṃ. Hatthe ṭhapāpetvā hatthena paharaṇaṃ pana niṭṭhitarajanassa cīvarassa allakāle kātabbaṃ, idaṃ pana phalakamuggarehi ghaṭṭanaṃ sukkhakāle thaddhabhāvavimocanatthanti daṭṭhabba’’nti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Ambaṇa"
      },
      "nti phalakehi pokkharaṇīsadisakatapānīyabhājanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rajanadoṇī"
      },
      "ti yattha pakkarajanaṃ ākiritvā ṭhapentī’’ti sāratthadīpaniyaṃ. Vimativinodaniyaṃ pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ambaṇa"
      },
      "nti ekadoṇikanāvāphalakehi pokkharaṇīsadisaṃ kataṃ. Pānīyabhājanantipi vadanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rajanadoṇī"
      },
      "ti ekadārunāva kataṃ rajanabhājanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Udakadoṇī"
      },
      "ti ekadārunāva kataṃ udakabhājana’’nti vuttaṃ."
    ],
    "innerText": "‘‘Ghaṭṭanaphalakaṃ nāma yattha ṭhapetvā rajitacīvaraṃ hatthena ghaṭṭenti. Ghaṭṭanamuggaro nāma anuvātādighaṭṭanatthaṃ katoti vadantī’’ti sāratthadīpaniyaṃ (sārattha. ṭī. cūḷavagga 3.321) vuttaṃ. Vimativinodaniyaṃ (vi. vi. ṭī. cūḷavagga 2.321) ‘‘ghaṭṭanaphalakaṃ ghaṭṭanamuggaroti idaṃ rajitacīvaraṃ ekasmiṃ maṭṭhe daṇḍamuggare veṭhetvā ekassa maṭṭhaphalakassa upari ṭhapetvā upari aparena maṭṭhaphalakena nikkujjitvā eko upari akkamitvā tiṭṭhati, dve janā upariphalakaṃ dvīsu koṭīsu gahetvā aparāparaṃ ākaḍḍhanavikaḍḍhanaṃ karonti, etaṃ sandhāya vuttaṃ. Hatthe ṭhapāpetvā hatthena paharaṇaṃ pana niṭṭhitarajanassa cīvarassa allakāle kātabbaṃ, idaṃ pana phalakamuggarehi ghaṭṭanaṃ sukkhakāle thaddhabhāvavimocanatthanti daṭṭhabba’’nti vuttaṃ. ‘‘Ambaṇanti phalakehi pokkharaṇīsadisakatapānīyabhājanaṃ. Rajanadoṇīti yattha pakkarajanaṃ ākiritvā ṭhapentī’’ti sāratthadīpaniyaṃ. Vimativinodaniyaṃ pana ‘‘ambaṇanti ekadoṇikanāvāphalakehi pokkharaṇīsadisaṃ kataṃ. Pānīyabhājanantipi vadanti. Rajanadoṇīti ekadārunāva kataṃ rajanabhājanaṃ. Udakadoṇīti ekadārunāva kataṃ udakabhājana’’nti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Bhūmattharaṇaṃ kātuṃ vaṭṭatī"
      },
      "ti akappiyacammaṃ sandhāya vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paccattharaṇagatika"
      },
      "nti iminā mañcapīṭhepi attharituṃ vaṭṭatīti dīpeti. Pāvārādipaccattharaṇampi garubhaṇḍanti eke. Noti apare, vīmaṃsitvā gahetabba’’nti sāratthadīpaniyaṃ (sārattha. ṭī. cūḷavagga 3.321) vuttaṃ. Vajirabuddhiṭīkāyaṃ (vajira. ṭī. cūḷavagga 321) pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘daṇḍamuggaro"
      },
      " nāma ‘yena rajitacīvaraṃ pothenti, tampi garubhaṇḍamevā’ti vuttattā, ‘paccattharaṇagatika’nti vuttattā ca api-saddena pāvārādipaccattharaṇaṃ sabbaṃ garubhaṇḍamevāti vadanti. Eteneva suttena aññathā atthaṃ vatvā pāvārādipaccattharaṇaṃ na garubhaṇḍaṃ, bhājanīyameva, senāsanatthāya dinnapaccattharaṇameva garubhaṇḍanti vadanti. Upaparikkhitabba’’nti vuttaṃ. Vimativinodaniyaṃ (vi. vi. ṭī. cūḷavagga 2.321) pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘bhūmattharaṇaṃ kātuṃ vaṭṭatī"
      },
      "ti akappiyacammaṃ sandhāya vuttaṃ. Tattha bhūmattharaṇasaṅkhepena sayitumpi vaṭṭatiyeva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paccattharaṇagatika"
      },
      "nti iminā mañcādīsu ",
      " attharitabbaṃ mahācammaṃ eḷakacammaṃ nāmāti dassetī’’ti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Chattamuṭṭhipaṇṇa"
      },
      "nti tālapaṇṇaṃ sandhāya vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pattakaṭāha"
      },
      "nti pattapacanakaṭāhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gaṇṭhikā"
      },
      "ti cīvaragaṇṭhikā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vidho"
      },
      "ti kāyabandhanavidho."
    ],
    "innerText": "‘‘Bhūmattharaṇaṃ kātuṃ vaṭṭatīti akappiyacammaṃ sandhāya vuttaṃ. Paccattharaṇagatikanti iminā mañcapīṭhepi attharituṃ vaṭṭatīti dīpeti. Pāvārādipaccattharaṇampi garubhaṇḍanti eke. Noti apare, vīmaṃsitvā gahetabba’’nti sāratthadīpaniyaṃ (sārattha. ṭī. cūḷavagga 3.321) vuttaṃ. Vajirabuddhiṭīkāyaṃ (vajira. ṭī. cūḷavagga 321) pana ‘‘daṇḍamuggaro nāma ‘yena rajitacīvaraṃ pothenti, tampi garubhaṇḍamevā’ti vuttattā, ‘paccattharaṇagatika’nti vuttattā ca api-saddena pāvārādipaccattharaṇaṃ sabbaṃ garubhaṇḍamevāti vadanti. Eteneva suttena aññathā atthaṃ vatvā pāvārādipaccattharaṇaṃ na garubhaṇḍaṃ, bhājanīyameva, senāsanatthāya dinnapaccattharaṇameva garubhaṇḍanti vadanti. Upaparikkhitabba’’nti vuttaṃ. Vimativinodaniyaṃ (vi. vi. ṭī. cūḷavagga 2.321) pana ‘‘bhūmattharaṇaṃ kātuṃ vaṭṭatīti akappiyacammaṃ sandhāya vuttaṃ. Tattha bhūmattharaṇasaṅkhepena sayitumpi vaṭṭatiyeva. Paccattharaṇagatikanti iminā mañcādīsu attharitabbaṃ mahācammaṃ eḷakacammaṃ nāmāti dassetī’’ti vuttaṃ. Chattamuṭṭhipaṇṇanti tālapaṇṇaṃ sandhāya vuttaṃ. Pattakaṭāhanti pattapacanakaṭāhaṃ. Gaṇṭhikāti cīvaragaṇṭhikā. Vidhoti kāyabandhanavidho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni vinayatthamañjūsāyaṃ (kaṅkhā. abhi. ṭī. dubbalasikkhāpadavaṇṇanā) āgatanayo vuccate – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ārāmo"
      },
      " nāma pupphārāmo vā phalārāmo vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ārāmavatthu"
      },
      " nāma tesaṃyeva ārāmānaṃ atthāya paricchinditvā ṭhapitokāso. Tesu vā ārāmesu vinaṭṭhesu tesaṃ porāṇakabhūmibhāgo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vihāro"
      },
      " nāma yaṃ kiñci pāsādādisenāsanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vihāravatthu"
      },
      " nāma tassa patiṭṭhānokāso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mañco"
      },
      " nāma masārako bundikābaddho kuḷīrapādako āhaccapādakoti imesaṃ pubbe vuttānaṃ catunnaṃ mañcānaṃ aññataro. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pīṭhaṃ"
      },
      " nāma masārakādīnaṃyeva catunnaṃ pīṭhānaṃ aññataraṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhisi"
      },
      " nāma uṇṇabhisiādīnaṃ pañcannaṃ bhisīnaṃ aññataraṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bimbohanaṃ"
      },
      " nāma rukkhatūlalatātūlapoṭakītūlānaṃ aññatarena puṇṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lohakumbhī"
      },
      " nāma kāḷalohena vā tambalohena vā yena kenaci katakumbhī. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lohabhāṇakā"
      },
      "dīsupi eseva nayo. Ettha pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhāṇaka"
      },
      "nti arañjaro vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vārako"
      },
      "ti ghaṭo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kaṭāhaṃ"
      },
      " kaṭāhameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vāsi"
      },
      "ādīsu valliādīsu ca duviññeyyaṃ nāma natthi…pe…."
    ],
    "innerText": "Idāni vinayatthamañjūsāyaṃ (kaṅkhā. abhi. ṭī. dubbalasikkhāpadavaṇṇanā) āgatanayo vuccate – ārāmo nāma pupphārāmo vā phalārāmo vā. Ārāmavatthu nāma tesaṃyeva ārāmānaṃ atthāya paricchinditvā ṭhapitokāso. Tesu vā ārāmesu vinaṭṭhesu tesaṃ porāṇakabhūmibhāgo. Vihāro nāma yaṃ kiñci pāsādādisenāsanaṃ. Vihāravatthu nāma tassa patiṭṭhānokāso. Mañco nāma masārako bundikābaddho kuḷīrapādako āhaccapādakoti imesaṃ pubbe vuttānaṃ catunnaṃ mañcānaṃ aññataro. Pīṭhaṃ nāma masārakādīnaṃyeva catunnaṃ pīṭhānaṃ aññataraṃ. Bhisi nāma uṇṇabhisiādīnaṃ pañcannaṃ bhisīnaṃ aññataraṃ. Bimbohanaṃ nāma rukkhatūlalatātūlapoṭakītūlānaṃ aññatarena puṇṇaṃ. Lohakumbhī nāma kāḷalohena vā tambalohena vā yena kenaci katakumbhī. Lohabhāṇakādīsupi eseva nayo. Ettha pana bhāṇakanti arañjaro vuccati. Vārakoti ghaṭo. Kaṭāhaṃ kaṭāhameva. Vāsiādīsu valliādīsu ca duviññeyyaṃ nāma natthi…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tattha thāvarena thāvara"
      },
      "nti vihāravihāravatthunā ārāmaārāmavatthuṃ vihāravihāravatthuṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Itarenā"
      },
      "ti athāvarena, pacchimarāsittayenāti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akappiyenā"
      },
      "ti suvaṇṇamayamañcādinā ceva akappiyabhisibimbohanehi ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahagghakappiyenā"
      },
      "ti dantamayamañcādinā ceva pāvārādinā ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Itara"
      },
      "nti athāvaraṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kappiyaparivattanena parivattetu"
      },
      "nti yathā akappiyaṃ na hoti, evaṃ parivattetuṃ…pe… evaṃ ",
      " tāva thāvarena thāvaraparivattanaṃ veditabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Itarena itaraparivattane"
      },
      " pana mañcapīṭhaṃ mahantaṃ vā hotu, khuddakaṃ vā, antamaso caturaṅgulapādakaṃ gāmadārakehi paṃsvāgārakesu kīḷantehi katampi saṅghassa dinnakālato paṭṭhāya garubhaṇḍaṃ hoti…pe… satagghanakena vā sahassagghanakena vā mañcena aññaṃ mañcasatampi labhati, parivattetvā gahetabbaṃ. Na kevalaṃ mañcena mañcoyeva, ārāmaārāmavatthuvihāravihāravatthupīṭhabhisibimbohanānipi parivattetuṃ vaṭṭanti. Esa nayo pīṭhabhisibimbohanesupi."
    ],
    "innerText": "Tattha thāvarena thāvaranti vihāravihāravatthunā ārāmaārāmavatthuṃ vihāravihāravatthuṃ. Itarenāti athāvarena, pacchimarāsittayenāti vuttaṃ hoti. Akappiyenāti suvaṇṇamayamañcādinā ceva akappiyabhisibimbohanehi ca. Mahagghakappiyenāti dantamayamañcādinā ceva pāvārādinā ca. Itaranti athāvaraṃ. Kappiyaparivattanena parivattetunti yathā akappiyaṃ na hoti, evaṃ parivattetuṃ…pe… evaṃ tāva thāvarena thāvaraparivattanaṃ veditabbaṃ. Itarena itaraparivattane pana mañcapīṭhaṃ mahantaṃ vā hotu, khuddakaṃ vā, antamaso caturaṅgulapādakaṃ gāmadārakehi paṃsvāgārakesu kīḷantehi katampi saṅghassa dinnakālato paṭṭhāya garubhaṇḍaṃ hoti…pe… satagghanakena vā sahassagghanakena vā mañcena aññaṃ mañcasatampi labhati, parivattetvā gahetabbaṃ. Na kevalaṃ mañcena mañcoyeva, ārāmaārāmavatthuvihāravihāravatthupīṭhabhisibimbohanānipi parivattetuṃ vaṭṭanti. Esa nayo pīṭhabhisibimbohanesupi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāḷalohatambalohakaṃsalohavaṭṭalohāna"
      },
      "nti ettha kaṃsalohaṃ vaṭṭalohañca kittimalohaṃ. Tīṇi hi ",
      " kittimalohāni kaṃsalohaṃ vaṭṭalohaṃ hārakūṭanti. Tattha tiputambe missetvā kataṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kaṃsalohaṃ"
      },
      ". Sīsatambe missetvā kataṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vaṭṭalohaṃ"
      },
      ". Rasatambe missetvā kataṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hārakūṭaṃ"
      },
      ". Tena vuttaṃ ‘‘kaṃsalohaṃ vaṭṭalohañca kittimaloha’’nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tato atireka"
      },
      "nti tato atirekagaṇhanako. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sārako"
      },
      "ti majjhe makuḷaṃ dassetvā mukhavaṭṭivitthataṃ katvā piṭṭhito nāmetvā kātabbaṃ ekaṃ bhājanaṃ. Sarāvantipi vadanti. Ādi-saddena kañcanakādīnaṃ gihiupakaraṇānaṃ gahaṇaṃ. Tāni hi khuddakānipi garubhaṇḍāneva gihiupakaraṇattā. Pi-saddena pageva mahantānīti dasseti, imāni pana bhājanīyāni bhikkhupakaraṇattāti adhippāyo. Yathā ca etāni, evaṃ kuṇḍikāpi bhājanīyā. Vakkhati hi ‘‘yathā ca mattikābhaṇḍe, evaṃ lohabhaṇḍepi kuṇḍikā bhājanīyakoṭṭhāsameva bhajatī’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅghikaparibhogenā"
      },
      "ti āgantukānaṃ vuḍḍhatarānaṃ datvā paribhogena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gihivikaṭā"
      },
      "ti gihīhi vikatā paññattā, attano vā santakakaraṇena virūpaṃ katā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puggalikaparibhogena na vaṭṭatī"
      },
      "ti āgantukānaṃ adatvā attano santakaṃ viya gahetvā ",
      " paribhuñjituṃ na vaṭṭati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pipphaliko"
      },
      "ti kattari. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ārakaṇṭakaṃ"
      },
      " sūcivedhakaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tāḷaṃ"
      },
      " yantaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kattarayaṭṭhivedhako"
      },
      " kattarayaṭṭhivalayaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathā tathā ghanakataṃ loha"
      },
      "nti lohavaṭṭi lohaguḷo lohapiṇḍi lohacakkalikanti evaṃ ghanakataṃ lohaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khīrapāsāṇamayānī"
      },
      "ti mudukakhīravaṇṇapāsāṇamayāni."
    ],
    "innerText": "Kāḷalohatambalohakaṃsalohavaṭṭalohānanti ettha kaṃsalohaṃ vaṭṭalohañca kittimalohaṃ. Tīṇi hi kittimalohāni kaṃsalohaṃ vaṭṭalohaṃ hārakūṭanti. Tattha tiputambe missetvā kataṃ kaṃsalohaṃ. Sīsatambe missetvā kataṃ vaṭṭalohaṃ. Rasatambe missetvā kataṃ hārakūṭaṃ. Tena vuttaṃ ‘‘kaṃsalohaṃ vaṭṭalohañca kittimaloha’’nti. Tato atirekanti tato atirekagaṇhanako. Sārakoti majjhe makuḷaṃ dassetvā mukhavaṭṭivitthataṃ katvā piṭṭhito nāmetvā kātabbaṃ ekaṃ bhājanaṃ. Sarāvantipi vadanti. Ādi-saddena kañcanakādīnaṃ gihiupakaraṇānaṃ gahaṇaṃ. Tāni hi khuddakānipi garubhaṇḍāneva gihiupakaraṇattā. Pi-saddena pageva mahantānīti dasseti, imāni pana bhājanīyāni bhikkhupakaraṇattāti adhippāyo. Yathā ca etāni, evaṃ kuṇḍikāpi bhājanīyā. Vakkhati hi ‘‘yathā ca mattikābhaṇḍe, evaṃ lohabhaṇḍepi kuṇḍikā bhājanīyakoṭṭhāsameva bhajatī’’ti. Saṅghikaparibhogenāti āgantukānaṃ vuḍḍhatarānaṃ datvā paribhogena. Gihivikaṭāti gihīhi vikatā paññattā, attano vā santakakaraṇena virūpaṃ katā. Puggalikaparibhogena na vaṭṭatīti āgantukānaṃ adatvā attano santakaṃ viya gahetvā paribhuñjituṃ na vaṭṭati. Pipphalikoti kattari. Ārakaṇṭakaṃ sūcivedhakaṃ. Tāḷaṃ yantaṃ. Kattarayaṭṭhivedhako kattarayaṭṭhivalayaṃ. Yathā tathā ghanakataṃ lohanti lohavaṭṭi lohaguḷo lohapiṇḍi lohacakkalikanti evaṃ ghanakataṃ lohaṃ. Khīrapāsāṇamayānīti mudukakhīravaṇṇapāsāṇamayāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gihivikaṭānipi na vaṭṭanti"
      },
      " anāmāsattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pi"
      },
      "-saddena pageva saṅghikaparibhogena vā puggalikaparibhogena vāti dasseti. Senāsanaparibhogo pana sabbakappiyo, tasmā jātarūpādimayaā sabbāpi senāsanaparikkhārā āmāsā. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘senāsanaparibhoge panā’’"
      },
      "tiādi."
    ],
    "innerText": "Gihivikaṭānipi na vaṭṭanti anāmāsattā. Pi-saddena pageva saṅghikaparibhogena vā puggalikaparibhogena vāti dasseti. Senāsanaparibhogo pana sabbakappiyo, tasmā jātarūpādimayaā sabbāpi senāsanaparikkhārā āmāsā. Tenāha ‘‘senāsanaparibhoge panā’’tiādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sesā"
      },
      "ti tato mahattarī vāsi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yā panā"
      },
      "ti yā kuṭhārī pana. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kudālo"
      },
      " antamaso caturaṅgulamattopi garubhaṇḍameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nikhādanaṃ"
      },
      " caturassamukhaṃ vā hotu doṇimukhaṃ vā vaṅkaṃ vā ujukaṃ vā, antamaso sammuñjanīdaṇḍavedhanampi, daṇḍabandhañce, garubhaṇḍameva. Tenāha ‘‘kudālo daṇḍabandhanikhādanaṃ vā agarubhaṇḍaṃ nāma natthī’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sipāṭikā"
      },
      " nāma khurakoso, sikharaṃ pana daṇḍabandhanikhādanaṃ anulometīti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sikharampi nikhādaneneva saṅgahita’’"
      },
      "nti. Sace pana vāsi adaṇḍakaṃ phalamattaṃ, bhājanīyaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upakkhare"
      },
      "ti vāsiādibhaṇḍe."
    ],
    "innerText": "Sesāti tato mahattarī vāsi. Yā panāti yā kuṭhārī pana. Kudālo antamaso caturaṅgulamattopi garubhaṇḍameva. Nikhādanaṃ caturassamukhaṃ vā hotu doṇimukhaṃ vā vaṅkaṃ vā ujukaṃ vā, antamaso sammuñjanīdaṇḍavedhanampi, daṇḍabandhañce, garubhaṇḍameva. Tenāha ‘‘kudālo daṇḍabandhanikhādanaṃ vā agarubhaṇḍaṃ nāma natthī’’ti. Sipāṭikā nāma khurakoso, sikharaṃ pana daṇḍabandhanikhādanaṃ anulometīti āha ‘‘sikharampi nikhādaneneva saṅgahita’’nti. Sace pana vāsi adaṇḍakaṃ phalamattaṃ, bhājanīyaṃ. Upakkhareti vāsiādibhaṇḍe."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pattabandhako"
      },
      " nāma pattassa gaṇṭhikādikārako. ‘‘Paṭimānaṃ suvaṇṇādipattakārako’’tipi vadanti. Tipucchedanakasatthaṃ suvaṇṇacchedanakasatthaṃ kataparikammacammacchindanakakhuddakasatthanti imāni ",
      " cettha tīṇi pipphalikaṃ anulomantīti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ayaṃ pana viseso’’"
      },
      "tiādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Itarānī"
      },
      "ti mahākattariādīni."
    ],
    "innerText": "Pattabandhako nāma pattassa gaṇṭhikādikārako. ‘‘Paṭimānaṃ suvaṇṇādipattakārako’’tipi vadanti. Tipucchedanakasatthaṃ suvaṇṇacchedanakasatthaṃ kataparikammacammacchindanakakhuddakasatthanti imāni cettha tīṇi pipphalikaṃ anulomantīti āha ‘‘ayaṃ pana viseso’’tiādi. Itarānīti mahākattariādīni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aḍḍhabāhuppamāṇā"
      },
      "ti ",
      " kapparato paṭṭhāya yāva aṃsakūṭappamāṇā, vidatthicaturaṅgulappamāṇāti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatthajātakā"
      },
      "ti saṅghikabhūmiyaṃ jātā, ārakkhasaṃvidhānena rakkhitattā rakkhitā ca sā mañjūsādīsu pakkhittaṃ viya yathā taṃ na nassati, evaṃ gopanato gopitā cāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rakkhitagopitā"
      },
      ". Tatthajātakāpi pana arakkhitā garubhaṇḍameva na hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅghakamme ca cetiyakamme ca kate"
      },
      "ti iminā saṅghasantakena cetiyasantakaṃ rakkhituṃ parivattituñca vaṭṭatīti dīpeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suttaṃ panā"
      },
      "ti vaṭṭitañceva avaṭṭitañca suttaṃ."
    ],
    "innerText": "Aḍḍhabāhuppamāṇāti kapparato paṭṭhāya yāva aṃsakūṭappamāṇā, vidatthicaturaṅgulappamāṇāti vuttaṃ hoti. Tatthajātakāti saṅghikabhūmiyaṃ jātā, ārakkhasaṃvidhānena rakkhitattā rakkhitā ca sā mañjūsādīsu pakkhittaṃ viya yathā taṃ na nassati, evaṃ gopanato gopitā cāti rakkhitagopitā. Tatthajātakāpi pana arakkhitā garubhaṇḍameva na hoti. Saṅghakamme ca cetiyakamme ca kateti iminā saṅghasantakena cetiyasantakaṃ rakkhituṃ parivattituñca vaṭṭatīti dīpeti. Suttaṃ panāti vaṭṭitañceva avaṭṭitañca suttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭhaṅgulasūcidaṇḍamatto"
      },
      "ti antamaso dīghaso aṭṭhaṅgulamatto pariṇāhato sīhaḷa-paṇṇasūcidaṇḍamatto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etthā"
      },
      "ti veḷubhaṇḍe. Daḍḍhaṃ gehaṃ yesaṃ teti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "daḍḍhagehā. Na vāretabbā"
      },
      "ti ‘‘mā gaṇhitvā gacchathā’’ti na nisedhetabbā. Desantaragatena sampattavihāre saṅghikāvāse ṭhapetabbā."
    ],
    "innerText": "Aṭṭhaṅgulasūcidaṇḍamattoti antamaso dīghaso aṭṭhaṅgulamatto pariṇāhato sīhaḷa-paṇṇasūcidaṇḍamatto. Etthāti veḷubhaṇḍe. Daḍḍhaṃ gehaṃ yesaṃ teti daḍḍhagehā. Na vāretabbāti ‘‘mā gaṇhitvā gacchathā’’ti na nisedhetabbā. Desantaragatena sampattavihāre saṅghikāvāse ṭhapetabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avasesañca chadanatiṇa"
      },
      "nti muñjapabbajehi avasesaṃ yaṃ kiñci chadanatiṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭhaṅgulappamāṇopī"
      },
      "ti vitthārato aṭṭhaṅgulappamāṇo. Likhitapotthako pana garubhaṇḍaṃ na hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kappiyacammānī"
      },
      "ti migādīnaṃ cammāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbaṃ cakkayuttayāna"
      },
      "nti rathasakaṭādikaṃ sabbaṃ cakkayuttayānaṃ. Visaṅkhatacakkaṃ pana yānaṃ bhājanīyaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anuññātavāsi"
      },
      " nāma yā sipāṭikāya pakkhipitvā pariharituṃ sakkāti vuttā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Muṭṭhipaṇṇaṃ"
      },
      " tālapattaṃ. Tañhi muṭṭhinā gahetvā pariharantīti ‘‘muṭṭhipaṇṇa’’nti vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Muṭṭhipaṇṇa"
      },
      "nti chattacchadapaṇṇamevā’’ti keci. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Araṇīsahita"
      },
      "nti araṇīyugaḷaṃ, uttarāraṇī adharāraṇīti araṇīdvayanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Phātikammaṃ katvā"
      },
      "ti antamaso taṃagghanakavālikāyapi thāvaraṃ vaḍḍhikammaṃ katvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kuṇḍikā"
      },
      "ti ayakuṇḍikā ceva tambalohakuṇḍikā ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhājanīyakoṭṭhāsameva bhajatī"
      },
      "ti bhājanīyapakkhameva sevati ",
      ", na tu garubhaṇḍanti attho. Kañcanako pana garubhaṇḍamevāti adhippāyo."
    ],
    "innerText": "Avasesañca chadanatiṇanti muñjapabbajehi avasesaṃ yaṃ kiñci chadanatiṇaṃ. Aṭṭhaṅgulappamāṇopīti vitthārato aṭṭhaṅgulappamāṇo. Likhitapotthako pana garubhaṇḍaṃ na hoti. Kappiyacammānīti migādīnaṃ cammāni. Sabbaṃ cakkayuttayānanti rathasakaṭādikaṃ sabbaṃ cakkayuttayānaṃ. Visaṅkhatacakkaṃ pana yānaṃ bhājanīyaṃ. Anuññātavāsi nāma yā sipāṭikāya pakkhipitvā pariharituṃ sakkāti vuttā. Muṭṭhipaṇṇaṃ tālapattaṃ. Tañhi muṭṭhinā gahetvā pariharantīti ‘‘muṭṭhipaṇṇa’’nti vuccati. ‘‘Muṭṭhipaṇṇanti chattacchadapaṇṇamevā’’ti keci. Araṇīsahitanti araṇīyugaḷaṃ, uttarāraṇī adharāraṇīti araṇīdvayanti attho. Phātikammaṃ katvāti antamaso taṃagghanakavālikāyapi thāvaraṃ vaḍḍhikammaṃ katvā. Kuṇḍikāti ayakuṇḍikā ceva tambalohakuṇḍikā ca. Bhājanīyakoṭṭhāsameva bhajatīti bhājanīyapakkhameva sevati , na tu garubhaṇḍanti attho. Kañcanako pana garubhaṇḍamevāti adhippāyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti vinayasaṅgahasaṃvaṇṇanābhūte vinayālaṅkāre"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Garubhaṇḍavinicchayakathālaṅkāro nāma"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tiṃsatimo paricchedo."
  }
]