[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "9. Pātimokkhaṭṭhapanakkhandhakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Pātimokkhuddesayācanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "383"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[udā. 45; a. ni. 8.20]"
      },
      " Tena ",
      " samayena buddho bhagavā sāvatthiyaṃ viharati pubbārāme migāramātu pāsāde. Tena kho pana samayena bhagavā tadahuposathe bhikkhusaṅghaparivuto nisinno hoti. Atha kho āyasmā ānando abhikkantāya rattiyā nikkhante paṭhame yāme uṭṭhāyāsanā ekaṃsaṃ uttarāsaṅgaṃ karitvā yena bhagavā tenañjaliṃ paṇāmetvā bhagavantaṃ etadavoca – ‘‘abhikkantā, bhante, ratti, nikkhanto paṭhamo yāmo, ciranisinno bhikkhusaṅgho. Uddisatu, bhante, bhagavā bhikkhūnaṃ pātimokkha’’nti. Evaṃ vutte bhagavā tuṇhī ahosi. Dutiyampi kho āyasmā ānando abhikkantāya rattiyā nikkhante majjhime yāme uṭṭhāyāsanā ekaṃsaṃ uttarāsaṅgaṃ karitvā yena bhagavā tenañjaliṃ paṇāmetvā bhagavantaṃ etadavoca – ‘‘abhikkantā, bhante, ratti, nikkhanto majjhimo yāmo, ciranisinno bhikkhusaṅgho. Uddisatu, bhante, bhagavā bhikkhūnaṃ pātimokkha’’nti. Dutiyampi kho bhagavā tuṇhī ahosi. Tatiyampi kho āyasmā ānando abhikkantāya rattiyā nikkhante pacchime yāme uddhaste aruṇe nandimukhiyā rattiyā uṭṭhāyāsanā ekaṃsaṃ uttarāsaṅgaṃ karitvā yena bhagavā tenañjaliṃ paṇāmetvā bhagavantaṃ etadavoca – ‘‘abhikkantā ",
      ", bhante, ratti, nikkhanto pacchimo yāmo, uddhastaṃ aruṇaṃ nandimukhi ratti, ciranisinno bhikkhusaṅgho. Uddisatu, bhante, bhagavā bhikkhūnaṃ pātimokkha’’nti. ‘‘Aparisuddhā, ānanda, parisā’’ti."
    ],
    "innerText": "383.[udā. 45; a. ni. 8.20] Tena samayena buddho bhagavā sāvatthiyaṃ viharati pubbārāme migāramātu pāsāde. Tena kho pana samayena bhagavā tadahuposathe bhikkhusaṅghaparivuto nisinno hoti. Atha kho āyasmā ānando abhikkantāya rattiyā nikkhante paṭhame yāme uṭṭhāyāsanā ekaṃsaṃ uttarāsaṅgaṃ karitvā yena bhagavā tenañjaliṃ paṇāmetvā bhagavantaṃ etadavoca – ‘‘abhikkantā, bhante, ratti, nikkhanto paṭhamo yāmo, ciranisinno bhikkhusaṅgho. Uddisatu, bhante, bhagavā bhikkhūnaṃ pātimokkha’’nti. Evaṃ vutte bhagavā tuṇhī ahosi. Dutiyampi kho āyasmā ānando abhikkantāya rattiyā nikkhante majjhime yāme uṭṭhāyāsanā ekaṃsaṃ uttarāsaṅgaṃ karitvā yena bhagavā tenañjaliṃ paṇāmetvā bhagavantaṃ etadavoca – ‘‘abhikkantā, bhante, ratti, nikkhanto majjhimo yāmo, ciranisinno bhikkhusaṅgho. Uddisatu, bhante, bhagavā bhikkhūnaṃ pātimokkha’’nti. Dutiyampi kho bhagavā tuṇhī ahosi. Tatiyampi kho āyasmā ānando abhikkantāya rattiyā nikkhante pacchime yāme uddhaste aruṇe nandimukhiyā rattiyā uṭṭhāyāsanā ekaṃsaṃ uttarāsaṅgaṃ karitvā yena bhagavā tenañjaliṃ paṇāmetvā bhagavantaṃ etadavoca – ‘‘abhikkantā , bhante, ratti, nikkhanto pacchimo yāmo, uddhastaṃ aruṇaṃ nandimukhi ratti, ciranisinno bhikkhusaṅgho. Uddisatu, bhante, bhagavā bhikkhūnaṃ pātimokkha’’nti. ‘‘Aparisuddhā, ānanda, parisā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho āyasmato mahāmoggallānassa etadahosi – ‘‘kaṃ nu kho bhagavā puggalaṃ sandhāya evamāha – ‘aparisuddhā, ānanda, parisā’’’ti? Atha kho āyasmā mahāmoggallāno sabbāvantaṃ bhikkhusaṅghaṃ cetasā ceto paricca manasākāsi. Addasā kho āyasmā mahāmoggallāno taṃ puggalaṃ dussīlaṃ pāpadhammaṃ asucisaṅkassarasamācāraṃ paṭicchannakammantaṃ assamaṇaṃ samaṇapaṭiññaṃ abrahmacāriṃ brahmacāripaṭiññaṃ antopūtiṃ avassutaṃ kasambujātaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kasambukajātaṃ (ka.)]"
      },
      " majjhe bhikkhusaṅghassa nisinnaṃ. Disvāna yena so puggalo ",
      " tenupasaṅkami ",
      ", upasaṅkamitvā taṃ puggalaṃ etadavoca – ‘‘uṭṭhehi, āvuso, diṭṭhosi bhagavatā; natthi te bhikkhūhi ",
      " saddhiṃ saṃvāso’’ti. Evaṃ vutte so puggalo tuṇhī ahosi. Dutiyampi kho āyasmā mahāmoggallāno taṃ puggalaṃ etadavoca – ‘‘uṭṭhehi, āvuso, diṭṭhosi bhagavatā; natthi te bhikkhūhi saddhiṃ saṃvāso’’ti. Dutiyampi kho so puggalo tuṇhī ahosi. Tatiyampi kho āyasmā mahāmoggallāno taṃ puggalaṃ etadavoca – ‘‘uṭṭhehi, āvuso, diṭṭhosi bhagavatā; natthi te bhikkhūhi saddhiṃ saṃvāso’’ti. Tatiyampi kho so puggalo tuṇhī ahosi. Atha kho āyasmā mahāmoggallāno taṃ puggalaṃ bāhāyaṃ gahetvā ",
      " bahidvārakoṭṭhakā nikkhāmetvā sūcighaṭikaṃ datvā yena bhagavā tenupasaṅkami, upasaṅkamitvā bhagavantaṃ etadavoca – ‘‘nikkhāmito so, bhante, puggalo mayā; suddhā parisā; uddisatu, bhante, bhagavā bhikkhūnaṃ pātimokkha’’nti."
    ],
    "innerText": "Atha kho āyasmato mahāmoggallānassa etadahosi – ‘‘kaṃ nu kho bhagavā puggalaṃ sandhāya evamāha – ‘aparisuddhā, ānanda, parisā’’’ti? Atha kho āyasmā mahāmoggallāno sabbāvantaṃ bhikkhusaṅghaṃ cetasā ceto paricca manasākāsi. Addasā kho āyasmā mahāmoggallāno taṃ puggalaṃ dussīlaṃ pāpadhammaṃ asucisaṅkassarasamācāraṃ paṭicchannakammantaṃ assamaṇaṃ samaṇapaṭiññaṃ abrahmacāriṃ brahmacāripaṭiññaṃ antopūtiṃ avassutaṃ kasambujātaṃ [kasambukajātaṃ (ka.)] majjhe bhikkhusaṅghassa nisinnaṃ. Disvāna yena so puggalo tenupasaṅkami , upasaṅkamitvā taṃ puggalaṃ etadavoca – ‘‘uṭṭhehi, āvuso, diṭṭhosi bhagavatā; natthi te bhikkhūhi saddhiṃ saṃvāso’’ti. Evaṃ vutte so puggalo tuṇhī ahosi. Dutiyampi kho āyasmā mahāmoggallāno taṃ puggalaṃ etadavoca – ‘‘uṭṭhehi, āvuso, diṭṭhosi bhagavatā; natthi te bhikkhūhi saddhiṃ saṃvāso’’ti. Dutiyampi kho so puggalo tuṇhī ahosi. Tatiyampi kho āyasmā mahāmoggallāno taṃ puggalaṃ etadavoca – ‘‘uṭṭhehi, āvuso, diṭṭhosi bhagavatā; natthi te bhikkhūhi saddhiṃ saṃvāso’’ti. Tatiyampi kho so puggalo tuṇhī ahosi. Atha kho āyasmā mahāmoggallāno taṃ puggalaṃ bāhāyaṃ gahetvā bahidvārakoṭṭhakā nikkhāmetvā sūcighaṭikaṃ datvā yena bhagavā tenupasaṅkami, upasaṅkamitvā bhagavantaṃ etadavoca – ‘‘nikkhāmito so, bhante, puggalo mayā; suddhā parisā; uddisatu, bhante, bhagavā bhikkhūnaṃ pātimokkha’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Acchariyaṃ, moggallāna, abbhutaṃ, moggallāna, yāva bāhāgahaṇāpi nāma so moghapuriso āgamessatī’’ti! Atha kho bhagavā bhikkhū āmantesi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Mahāsamuddeaṭṭhacchariyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "384"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[udā. 45; a. ni. 8.19]"
      },
      " ‘‘Aṭṭhime, bhikkhave, mahāsamudde acchariyā abbhutā dhammā, ye disvā disvā asurā mahāsamudde abhiramanti. Katame aṭṭha?"
    ],
    "innerText": "384.[udā. 45; a. ni. 8.19] ‘‘Aṭṭhime, bhikkhave, mahāsamudde acchariyā abbhutā dhammā, ye disvā disvā asurā mahāsamudde abhiramanti. Katame aṭṭha?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Mahāsamuddo, bhikkhave, anupubbaninno anupubbapoṇo anupubbapabbhāro na āyatakeneva papāto. Yampi, bhikkhave, mahāsamuddo anupubbaninno anupubbapoṇo anupubbapabbhāro na āyatakeneva papāto – ayaṃ, bhikkhave, mahāsamudde paṭhamo acchariyo abbhuto dhammo, yaṃ disvā disvā asurā mahāsamudde abhiramanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhikkhave, mahāsamuddo ṭhitadhammo velaṃ nātivattati. Yampi, bhikkhave, mahāsamuddo ṭhitadhammo velaṃ nātivattati – ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ayampi (syā.)]"
      },
      ", bhikkhave, mahāsamudde dutiyo acchariyo abbhuto dhammo, yaṃ disvā disvā asurā mahāsamudde abhiramanti."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, mahāsamuddo ṭhitadhammo velaṃ nātivattati. Yampi, bhikkhave, mahāsamuddo ṭhitadhammo velaṃ nātivattati – ayaṃ [ayampi (syā.)], bhikkhave, mahāsamudde dutiyo acchariyo abbhuto dhammo, yaṃ disvā disvā asurā mahāsamudde abhiramanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna ",
      " caparaṃ, bhikkhave, mahāsamuddo na matena kuṇapena saṃvasati ",
      ". Yaṃ hoti mahāsamudde mataṃ kuṇapaṃ, taṃ khippaññeva tīraṃ vāheti, thalaṃ ussāreti. Yampi, bhikkhave, mahāsamuddo na matena kuṇapena saṃvasati, yaṃ hoti mahāsamudde mataṃ kuṇapaṃ, taṃ khippaññeva tīraṃ ",
      " vāheti, thalaṃ ussāreti – ayaṃ, bhikkhave, mahāsamudde tatiyo acchariyo abbhuto dhammo, yaṃ disvā disvā asurā mahāsamudde abhiramanti."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, mahāsamuddo na matena kuṇapena saṃvasati . Yaṃ hoti mahāsamudde mataṃ kuṇapaṃ, taṃ khippaññeva tīraṃ vāheti, thalaṃ ussāreti. Yampi, bhikkhave, mahāsamuddo na matena kuṇapena saṃvasati, yaṃ hoti mahāsamudde mataṃ kuṇapaṃ, taṃ khippaññeva tīraṃ vāheti, thalaṃ ussāreti – ayaṃ, bhikkhave, mahāsamudde tatiyo acchariyo abbhuto dhammo, yaṃ disvā disvā asurā mahāsamudde abhiramanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhikkhave, yā kāci mahānadiyo, seyyathidaṃ – gaṅgā, yamunā, aciravatī, sarabhū, mahī, tā mahāsamuddaṃ pattā jahanti purimāni nāmagottāni, mahāsamuddo tveva saṅkhaṃ gacchanti. Yampi, bhikkhave, yākāci mahānadiyo, seyyathidaṃ – gaṅgā, yamunā, aciravatī, sarabhū, mahī, tā mahāsamuddaṃ pattā jahanti purimāni nāmagottāni, mahāsamuddo tveva saṅkhaṃ gacchanti – ayaṃ, bhikkhave, mahāsamudde catuttho ",
      " acchariyo abbhuto dhammo, yaṃ disvā disvā asurā mahāsamudde abhiramanti."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, yā kāci mahānadiyo, seyyathidaṃ – gaṅgā, yamunā, aciravatī, sarabhū, mahī, tā mahāsamuddaṃ pattā jahanti purimāni nāmagottāni, mahāsamuddo tveva saṅkhaṃ gacchanti. Yampi, bhikkhave, yākāci mahānadiyo, seyyathidaṃ – gaṅgā, yamunā, aciravatī, sarabhū, mahī, tā mahāsamuddaṃ pattā jahanti purimāni nāmagottāni, mahāsamuddo tveva saṅkhaṃ gacchanti – ayaṃ, bhikkhave, mahāsamudde catuttho acchariyo abbhuto dhammo, yaṃ disvā disvā asurā mahāsamudde abhiramanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhikkhave, yā ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yākāci (syā.)]"
      },
      " loke savantiyo mahāsamuddaṃ appenti, yā ca antalikkhā dhārā papatanti, na tena mahāsamuddassa ūnattaṃ vā pūrattaṃ vā paññāyati. Yampi, bhikkhave, yā ca loke savantiyo mahāsamuddaṃ appenti, yā ca ",
      " antalikkhā dhārā papatanti, na tena mahāsamuddassa ūnattaṃ vā pūrattaṃ vā paññāyati – ayaṃ, bhikkhave, mahāsamudde pañcamo acchariyo abbhuto dhammo, yaṃ disvā disvā asurā mahāsamudde abhiramanti."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, yā ca [yākāci (syā.)] loke savantiyo mahāsamuddaṃ appenti, yā ca antalikkhā dhārā papatanti, na tena mahāsamuddassa ūnattaṃ vā pūrattaṃ vā paññāyati. Yampi, bhikkhave, yā ca loke savantiyo mahāsamuddaṃ appenti, yā ca antalikkhā dhārā papatanti, na tena mahāsamuddassa ūnattaṃ vā pūrattaṃ vā paññāyati – ayaṃ, bhikkhave, mahāsamudde pañcamo acchariyo abbhuto dhammo, yaṃ disvā disvā asurā mahāsamudde abhiramanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, bhikkhave, mahāsamuddo ekaraso loṇaraso. Yampi, bhikkhave, mahāsamuddo ekaraso loṇaraso – ayaṃ, bhikkhave, mahāsamudde chaṭṭho acchariyo abbhuto dhammo, yaṃ disvā disvā asurā mahāsamudde abhiramanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhikkhave, mahāsamuddo bahuratano ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[bahūtaratano (ka.)]"
      },
      " anekaratano. Tatrimāni ratanāni, seyyathidaṃ – muttā, maṇi, veḷuriyo, saṅkho, silā, pavāḷaṃ, rajataṃ, jātarūpaṃ, lohitako, masāragallaṃ. Yampi, bhikkhave, mahāsamuddo bahuratano anekaratano, tatrimāni ratanāni, seyyathidaṃ – muttā, maṇi, veḷuriyo, saṅkho, silā, pavāḷaṃ, rajataṃ, jātarūpaṃ, lohitako ",
      ", masāragallaṃ – ayaṃ, bhikkhave, mahāsamudde sattamo acchariyo abbhuto dhammo, yaṃ disvā disvā asurā mahāsamudde abhiramanti."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, mahāsamuddo bahuratano [bahūtaratano (ka.)] anekaratano. Tatrimāni ratanāni, seyyathidaṃ – muttā, maṇi, veḷuriyo, saṅkho, silā, pavāḷaṃ, rajataṃ, jātarūpaṃ, lohitako, masāragallaṃ. Yampi, bhikkhave, mahāsamuddo bahuratano anekaratano, tatrimāni ratanāni, seyyathidaṃ – muttā, maṇi, veḷuriyo, saṅkho, silā, pavāḷaṃ, rajataṃ, jātarūpaṃ, lohitako , masāragallaṃ – ayaṃ, bhikkhave, mahāsamudde sattamo acchariyo abbhuto dhammo, yaṃ disvā disvā asurā mahāsamudde abhiramanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhikkhave, mahāsamuddo mahataṃ bhūtānaṃ āvāso. Tatrime bhūtā – timi, timiṅgalo, timitimiṅgalo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[timirapiṅgalo (sī.), timitimiṅgalo mahātimiṅgalo (syā. kaṃ.)]"
      },
      ", asurā, nāgā, gandhabbā. Santi mahāsamudde yojanasatikāpi attabhāvā, dviyojanasatikāpi ",
      " attabhāvā, tiyojanasatikāpi attabhāvā, catuyojanasatikāpi ",
      " attabhāvā, pañcayojanasatikāpi attabhāvā. Yampi, bhikkhave, mahāsamuddo mahataṃ bhūtānaṃ āvāso, tatrime bhūtā – timi, timiṅgalo, timitimiṅgalo, asurā, nāgā, gandhabbā; santi mahāsamudde, yojanasatikāpi attabhāvā…pe… pañcayojanasatikāpi attabhāvā – ayaṃ, bhikkhave, mahāsamudde aṭṭhamo acchariyo abbhuto dhammo, yaṃ disvā disvā asurā mahāsamudde abhiramanti. Ime kho, bhikkhave, mahāsamudde aṭṭha acchariyā abbhutā dhammā, ye disvā disvā asurā mahāsamudde abhirama’’nti."
    ],
    "innerText": "‘‘Puna caparaṃ, bhikkhave, mahāsamuddo mahataṃ bhūtānaṃ āvāso. Tatrime bhūtā – timi, timiṅgalo, timitimiṅgalo [timirapiṅgalo (sī.), timitimiṅgalo mahātimiṅgalo (syā. kaṃ.)], asurā, nāgā, gandhabbā. Santi mahāsamudde yojanasatikāpi attabhāvā, dviyojanasatikāpi attabhāvā, tiyojanasatikāpi attabhāvā, catuyojanasatikāpi attabhāvā, pañcayojanasatikāpi attabhāvā. Yampi, bhikkhave, mahāsamuddo mahataṃ bhūtānaṃ āvāso, tatrime bhūtā – timi, timiṅgalo, timitimiṅgalo, asurā, nāgā, gandhabbā; santi mahāsamudde, yojanasatikāpi attabhāvā…pe… pañcayojanasatikāpi attabhāvā – ayaṃ, bhikkhave, mahāsamudde aṭṭhamo acchariyo abbhuto dhammo, yaṃ disvā disvā asurā mahāsamudde abhiramanti. Ime kho, bhikkhave, mahāsamudde aṭṭha acchariyā abbhutā dhammā, ye disvā disvā asurā mahāsamudde abhirama’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Imasmiṃdhammavinayeaṭṭhacchariyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "385"
      },
      ". ‘‘Evameva kho, bhikkhave, imasmiṃ dhammavinaye aṭṭha acchariyā abbhutā dhammā, ye disvā disvā bhikkhū imasmiṃ dhammavinaye abhiramanti. Katame aṭṭha?"
    ],
    "innerText": "385. ‘‘Evameva kho, bhikkhave, imasmiṃ dhammavinaye aṭṭha acchariyā abbhutā dhammā, ye disvā disvā bhikkhū imasmiṃ dhammavinaye abhiramanti. Katame aṭṭha?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Seyyathāpi, bhikkhave, mahāsamuddo anupubbaninno anupubbapoṇo anupubbapabbhāro na āyatakeneva papāto; evameva kho, bhikkhave, imasmiṃ dhammavinaye anupubbasikkhā anupubbakiriyā anupubbapaṭipadā na āyatakeneva aññāpaṭivedho. Yampi, bhikkhave, imasmiṃ dhammavinaye anupubbasikkhā anupubbakiriyā anupubbapaṭipadā na āyatakeneva aññāpaṭivedho – ayaṃ, bhikkhave, imasmiṃ dhammavinaye paṭhamo acchariyo abbhuto dhammo, yaṃ disvā disvā bhikkhū imasmiṃ dhammavinaye abhiramanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, bhikkhave, mahāsamuddo ṭhitadhammo velaṃ nātivattati ",
      "; evameva kho, bhikkhave, yaṃ mayā sāvakānaṃ sikkhāpadaṃ paññattaṃ, taṃ mama sāvakā jīvitahetupi nātikkamanti. Yampi, bhikkhave, mayā mama sāvakānaṃ sikkhāpadaṃ ",
      " paññattaṃ, taṃ ",
      " mama sāvakā jīvitahetupi nātikkamanti – ayaṃ, bhikkhave, imasmiṃ dhammavinaye dutiyo acchariyo abbhuto dhammo, yaṃ disvā disvā bhikkhū imasmiṃ dhammavinaye abhiramanti."
    ],
    "innerText": "‘‘Seyyathāpi, bhikkhave, mahāsamuddo ṭhitadhammo velaṃ nātivattati ; evameva kho, bhikkhave, yaṃ mayā sāvakānaṃ sikkhāpadaṃ paññattaṃ, taṃ mama sāvakā jīvitahetupi nātikkamanti. Yampi, bhikkhave, mayā mama sāvakānaṃ sikkhāpadaṃ paññattaṃ, taṃ mama sāvakā jīvitahetupi nātikkamanti – ayaṃ, bhikkhave, imasmiṃ dhammavinaye dutiyo acchariyo abbhuto dhammo, yaṃ disvā disvā bhikkhū imasmiṃ dhammavinaye abhiramanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, bhikkhave, mahāsamuddo na matena kuṇapena saṃvasati, yaṃ hoti mahāsamudde mataṃ kuṇapaṃ taṃ khippameva tīraṃ vāheti, thalaṃ ussāreti; evameva kho, bhikkhave, yo so puggalo dussīlo pāpadhammo asucisaṅkassarasamācāro paṭicchannakammanto assamaṇo samaṇapaṭiñño abrahmacārī brahmacāripaṭiñño antopūti avassuto kasambujāto, na tena saṅgho saṃvasati, khippameva naṃ sannipatitvā ukkhipati, kiñcāpi kho so hoti majjhe bhikkhusaṅghassa ",
      " nisinno. Atha kho so ārakāva saṅghamhā, saṅgho ca tena. Yampi, bhikkhave, yo so puggalo dussīlo pāpadhammo asucisaṅkassarasamācāro paṭicchannakammanto assamaṇo samaṇapaṭiñño abrahmacārī brahmacāripaṭiñño antopūti avassuto kasambujāto, na tena saṅgho saṃvasati, khippameva naṃ sannipūtitvā ukkhipati, kiñcāpi kho so hoti majjhe bhikkhusaṅghassa nisinno, atha kho so ārakāva saṅghamhā, saṅgho ca tena – ayaṃ ",
      ", bhikkhave, imasmiṃ dhammavinaye tatiyo acchariyo abbhuto dhammo, yaṃ disvā disvā bhikkhū imasmiṃ dhammavinaye abhiramanti."
    ],
    "innerText": "‘‘Seyyathāpi, bhikkhave, mahāsamuddo na matena kuṇapena saṃvasati, yaṃ hoti mahāsamudde mataṃ kuṇapaṃ taṃ khippameva tīraṃ vāheti, thalaṃ ussāreti; evameva kho, bhikkhave, yo so puggalo dussīlo pāpadhammo asucisaṅkassarasamācāro paṭicchannakammanto assamaṇo samaṇapaṭiñño abrahmacārī brahmacāripaṭiñño antopūti avassuto kasambujāto, na tena saṅgho saṃvasati, khippameva naṃ sannipatitvā ukkhipati, kiñcāpi kho so hoti majjhe bhikkhusaṅghassa nisinno. Atha kho so ārakāva saṅghamhā, saṅgho ca tena. Yampi, bhikkhave, yo so puggalo dussīlo pāpadhammo asucisaṅkassarasamācāro paṭicchannakammanto assamaṇo samaṇapaṭiñño abrahmacārī brahmacāripaṭiñño antopūti avassuto kasambujāto, na tena saṅgho saṃvasati, khippameva naṃ sannipūtitvā ukkhipati, kiñcāpi kho so hoti majjhe bhikkhusaṅghassa nisinno, atha kho so ārakāva saṅghamhā, saṅgho ca tena – ayaṃ , bhikkhave, imasmiṃ dhammavinaye tatiyo acchariyo abbhuto dhammo, yaṃ disvā disvā bhikkhū imasmiṃ dhammavinaye abhiramanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi, bhikkhave, yā kāci mahānadiyo, seyyathidaṃ – gaṅgā, yamunā, aciravatī, sarabhū, mahī, tā mahāsamuddaṃ pattā jahanti purimāni nāmagottāni, mahāsamuddo tveva saṅkhaṃ gacchanti; evameva kho, bhikkhave, cattārome vaṇṇā – khattiyā, brāhmaṇā, vessā, suddā. Te tathāgatappavedite dhammavinaye agārasmā anagāriyaṃ pabbajitvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pabbajitā (sī.)]"
      },
      " jahanti purimāni nāmagottāni, samaṇā sakyaputtiyā tveva saṅkhaṃ gacchanti. Yampi, bhikkhave, cattārome vaṇṇā khattiyā brāhmaṇā vessā suddā, te tathāgatappavedite dhammavinaye agārasmā anagāriyaṃ pabbajitvā jahanti purimāni nāmagottāni, samaṇā sakyaputtiyā tveva saṅkhaṃ gacchanti – ayaṃ, bhikkhave, imasmiṃ dhammavinaye catuttho acchariyo abbhuto dhammo, yaṃ disvā disvā bhikkhū imasmiṃ dhammavinaye abhiramanti."
    ],
    "innerText": "‘‘Seyyathāpi, bhikkhave, yā kāci mahānadiyo, seyyathidaṃ – gaṅgā, yamunā, aciravatī, sarabhū, mahī, tā mahāsamuddaṃ pattā jahanti purimāni nāmagottāni, mahāsamuddo tveva saṅkhaṃ gacchanti; evameva kho, bhikkhave, cattārome vaṇṇā – khattiyā, brāhmaṇā, vessā, suddā. Te tathāgatappavedite dhammavinaye agārasmā anagāriyaṃ pabbajitvā [pabbajitā (sī.)] jahanti purimāni nāmagottāni, samaṇā sakyaputtiyā tveva saṅkhaṃ gacchanti. Yampi, bhikkhave, cattārome vaṇṇā khattiyā brāhmaṇā vessā suddā, te tathāgatappavedite dhammavinaye agārasmā anagāriyaṃ pabbajitvā jahanti purimāni nāmagottāni, samaṇā sakyaputtiyā tveva saṅkhaṃ gacchanti – ayaṃ, bhikkhave, imasmiṃ dhammavinaye catuttho acchariyo abbhuto dhammo, yaṃ disvā disvā bhikkhū imasmiṃ dhammavinaye abhiramanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi ",
      ", bhikkhave, yā ca loke savantiyo mahāsamuddaṃ appenti, yā ca antalikkhā dhārā papatanti, na tena mahāsamuddassa ūnattaṃ vā pūrattaṃ vā paññāyati; evameva kho, bhikkhave, bahū cepi bhikkhū anupādisesāya nibbānadhātuyā parinibbāyanti, na tena nibbānadhātuyā ūnattaṃ vā pūrattaṃ vā paññāyati. Yampi, bhikkhave, bahū cepi bhikkhū anupādisesāya nibbānadhātuyā parinibbāyanti ",
      ", na tena nibbānadhātuyā ūnattaṃ vā pūrattaṃ vā paññāyati – ayaṃ, bhikkhave, imasmiṃ dhammavinaye pañcamo acchariyo abbhuto dhammo yaṃ disvā disvā bhikkhū imasmiṃ dhammavinaye abhiramanti."
    ],
    "innerText": "‘‘Seyyathāpi , bhikkhave, yā ca loke savantiyo mahāsamuddaṃ appenti, yā ca antalikkhā dhārā papatanti, na tena mahāsamuddassa ūnattaṃ vā pūrattaṃ vā paññāyati; evameva kho, bhikkhave, bahū cepi bhikkhū anupādisesāya nibbānadhātuyā parinibbāyanti, na tena nibbānadhātuyā ūnattaṃ vā pūrattaṃ vā paññāyati. Yampi, bhikkhave, bahū cepi bhikkhū anupādisesāya nibbānadhātuyā parinibbāyanti , na tena nibbānadhātuyā ūnattaṃ vā pūrattaṃ vā paññāyati – ayaṃ, bhikkhave, imasmiṃ dhammavinaye pañcamo acchariyo abbhuto dhammo yaṃ disvā disvā bhikkhū imasmiṃ dhammavinaye abhiramanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Seyyathāpi, bhikkhave, mahāsamuddo ekaraso loṇaraso, evameva kho, bhikkhave, ayaṃ dhammavinayo ekaraso vimuttiraso. Yampi, bhikkhave, ayaṃ dhammavinayo ekaraso vimuttiraso – ayaṃ, bhikkhave, imasmiṃ dhammavinaye chaṭṭho acchariyo abbhuto dhammo, yaṃ disvā disvā bhikkhū imasmiṃ dhammavinaye abhiramanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi ",
      ", bhikkhave, mahāsamuddo bahuratano anekaratano, tatrimāni ratanāni, seyyathidaṃ – muttā, maṇi, veḷuriyo, saṅkho, silā, pavāḷaṃ, rajataṃ, jātarūpaṃ, lohitako, masāragallaṃ; evameva ",
      " kho, bhikkhave, ayaṃ dhammavinayo bahuratano anekaratano. Tatrimāni ratanāni, seyyathidaṃ – cattāro satipaṭṭhānā, cattāro sammappadhānā, cattāro iddhipādā, pañcindriyāni, pañca balāni, satta bojjhaṅgā, ariyo aṭṭhaṅgiko maggo. Yampi, bhikkhave, ayaṃ dhammavinayo bahuratano anekaratano, tatrimāni ratanāni, seyyathidaṃ – cattāro satipaṭṭhānā…pe… ariyo aṭṭhaṅgiko maggo – ayaṃ, bhikkhave, imasmiṃ dhammavinaye sattamo acchariyo abbhuto dhammo, yaṃ disvā disvā bhikkhū imasmiṃ dhammavinaye abhiramanti."
    ],
    "innerText": "‘‘Seyyathāpi , bhikkhave, mahāsamuddo bahuratano anekaratano, tatrimāni ratanāni, seyyathidaṃ – muttā, maṇi, veḷuriyo, saṅkho, silā, pavāḷaṃ, rajataṃ, jātarūpaṃ, lohitako, masāragallaṃ; evameva kho, bhikkhave, ayaṃ dhammavinayo bahuratano anekaratano. Tatrimāni ratanāni, seyyathidaṃ – cattāro satipaṭṭhānā, cattāro sammappadhānā, cattāro iddhipādā, pañcindriyāni, pañca balāni, satta bojjhaṅgā, ariyo aṭṭhaṅgiko maggo. Yampi, bhikkhave, ayaṃ dhammavinayo bahuratano anekaratano, tatrimāni ratanāni, seyyathidaṃ – cattāro satipaṭṭhānā…pe… ariyo aṭṭhaṅgiko maggo – ayaṃ, bhikkhave, imasmiṃ dhammavinaye sattamo acchariyo abbhuto dhammo, yaṃ disvā disvā bhikkhū imasmiṃ dhammavinaye abhiramanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Seyyathāpi ",
      ", bhikkhave, mahāsamuddo mahataṃ bhūtānaṃ āvāso, tatrime bhūtā – timi, timiṅgalo, timitimiṅgalo, asurā, nāgā, gandhabbā, santi mahāsamudde yojanasatikāpi attabhāvā, dviyojanasatikāpi attabhāvā, tiyojanasatikāpi attabhāvā, catuyojanasatikāpi attabhāvā, pañcayojanasatikāpi attabhāvā; evameva kho, bhikkhave, ayaṃ dhammavinayo mahataṃ bhūtānaṃ āvāso. Tatrime bhūtā – sotāpanno, sotāpattiphalasacchikiriyāya paṭipanno; sakadāgāmī, sakadāgāmiphalasacchikiriyāya ",
      " paṭipanno; anāgāmī, anāgāmiphalasacchikiriyāya paṭipanno; arahā, arahattaphalasacchikiriyāya paṭipanno. Yampi, bhikkhave, ayaṃ dhammavinayo mahataṃ bhūtānaṃ āvāso, tatrime bhūtā – sotāpanno, sotāpattiphalasacchikiriyāya paṭipanno…pe… arahā, arahataphalasacchikiriyāya paṭipanno – ayaṃ, bhikkhave, imasmiṃ dhammavinaye aṭṭhamo acchariyo abbhuto dhammo, yaṃ disvā disvā bhikkhū imasmiṃ dhammavinaye abhiramanti. ‘‘Ime kho, bhikkhave, imasmiṃ dhammavinaye aṭṭha acchariyā abbhutā dhammā, ye disvā disvā bhikkhū imasmiṃ dhammavinaye abhiramantī’’ti."
    ],
    "innerText": "‘‘Seyyathāpi , bhikkhave, mahāsamuddo mahataṃ bhūtānaṃ āvāso, tatrime bhūtā – timi, timiṅgalo, timitimiṅgalo, asurā, nāgā, gandhabbā, santi mahāsamudde yojanasatikāpi attabhāvā, dviyojanasatikāpi attabhāvā, tiyojanasatikāpi attabhāvā, catuyojanasatikāpi attabhāvā, pañcayojanasatikāpi attabhāvā; evameva kho, bhikkhave, ayaṃ dhammavinayo mahataṃ bhūtānaṃ āvāso. Tatrime bhūtā – sotāpanno, sotāpattiphalasacchikiriyāya paṭipanno; sakadāgāmī, sakadāgāmiphalasacchikiriyāya paṭipanno; anāgāmī, anāgāmiphalasacchikiriyāya paṭipanno; arahā, arahattaphalasacchikiriyāya paṭipanno. Yampi, bhikkhave, ayaṃ dhammavinayo mahataṃ bhūtānaṃ āvāso, tatrime bhūtā – sotāpanno, sotāpattiphalasacchikiriyāya paṭipanno…pe… arahā, arahataphalasacchikiriyāya paṭipanno – ayaṃ, bhikkhave, imasmiṃ dhammavinaye aṭṭhamo acchariyo abbhuto dhammo, yaṃ disvā disvā bhikkhū imasmiṃ dhammavinaye abhiramanti. ‘‘Ime kho, bhikkhave, imasmiṃ dhammavinaye aṭṭha acchariyā abbhutā dhammā, ye disvā disvā bhikkhū imasmiṃ dhammavinaye abhiramantī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha kho bhagavā etamatthaṃ viditvā tāyaṃ velāyaṃ imaṃ udānaṃ udānesi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[udā. 45]"
      },
      " ‘‘Channamativassati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[suchannamativassati (ka.)]"
      },
      ", vivaṭaṃ nātivassati;"
    ],
    "innerText": "[udā. 45] ‘‘Channamativassati [suchannamativassati (ka.)], vivaṭaṃ nātivassati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tasmā channaṃ vivaretha, evaṃ taṃ nātivassatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Pātimokkhasavanāraho"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "386"
      },
      ". Atha ",
      " kho bhagavā bhikkhū āmantesi – ‘‘nadānāhaṃ, bhikkhave, ito ",
      " paraṃ uposathaṃ karissāmi, pātimokkhaṃ uddisissāmi. Tumhevadāni, bhikkhave, ito paraṃ uposathaṃ kareyyātha, pātimokkhaṃ uddiseyyātha. Aṭṭhānametaṃ, bhikkhave, anavakāso yaṃ tathāgato aparisuddhāya parisāya uposathaṃ kareyya, pātimokkhaṃ uddiseyya. Na ca, bhikkhave ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[na ca bhikkhave bhikkhunā (syā. kaṃ.)]"
      },
      ", sāpattikena pātimokkhaṃ sotabbaṃ. Yo suṇeyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, yo sāpattiko pātimokkhaṃ suṇāti, tassa pātimokkhaṃ ṭhapetuṃ. Evañca pana, bhikkhave, ṭhapetabbaṃ. Tadahuposathe cātuddase vā pannarase vā tasmiṃ puggale sammukhībhūte saṅghamajjhe ",
      " udāharitabbaṃ –"
    ],
    "innerText": "386. Atha kho bhagavā bhikkhū āmantesi – ‘‘nadānāhaṃ, bhikkhave, ito paraṃ uposathaṃ karissāmi, pātimokkhaṃ uddisissāmi. Tumhevadāni, bhikkhave, ito paraṃ uposathaṃ kareyyātha, pātimokkhaṃ uddiseyyātha. Aṭṭhānametaṃ, bhikkhave, anavakāso yaṃ tathāgato aparisuddhāya parisāya uposathaṃ kareyya, pātimokkhaṃ uddiseyya. Na ca, bhikkhave [na ca bhikkhave bhikkhunā (syā. kaṃ.)], sāpattikena pātimokkhaṃ sotabbaṃ. Yo suṇeyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, yo sāpattiko pātimokkhaṃ suṇāti, tassa pātimokkhaṃ ṭhapetuṃ. Evañca pana, bhikkhave, ṭhapetabbaṃ. Tadahuposathe cātuddase vā pannarase vā tasmiṃ puggale sammukhībhūte saṅghamajjhe udāharitabbaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘Suṇātu me bhante, saṅgho. Itthannāmo puggalo sāpattiko, tassa pātimokkhaṃ ṭhapemi, na tasmiṃ sammukhībhūte pātimokkhaṃ uddisitabba’nti ṭhapitaṃ hoti pātimokkha’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena ",
      " kho pana samayena chabbaggiyā bhikkhū ‘nāmhe koci jānātī’ti sāpattikāva pātimokkhaṃ suṇanti. Therā bhikkhū paracittaviduno bhikkhūnaṃ ārocenti – ‘‘itthannāmo ca itthannāmo ca, āvuso, chabbaggiyā bhikkhū ‘nāmhe koci jānātī’ti sāpattikāva pātimokkhaṃ suṇantī’’ti. Assosuṃ kho chabbaggiyā bhikkhū – ‘‘therā kira bhikkhū paracittaviduno amhe bhikkhūnaṃ ārocenti – itthannāmo ca itthannāmo ca, āvuso, chabbaggiyā bhikkhū ‘nāmhe koci ",
      " jānātī’ti sāpattikāva pātimokkhaṃ suṇantī’’ti."
    ],
    "innerText": "Tena kho pana samayena chabbaggiyā bhikkhū ‘nāmhe koci jānātī’ti sāpattikāva pātimokkhaṃ suṇanti. Therā bhikkhū paracittaviduno bhikkhūnaṃ ārocenti – ‘‘itthannāmo ca itthannāmo ca, āvuso, chabbaggiyā bhikkhū ‘nāmhe koci jānātī’ti sāpattikāva pātimokkhaṃ suṇantī’’ti. Assosuṃ kho chabbaggiyā bhikkhū – ‘‘therā kira bhikkhū paracittaviduno amhe bhikkhūnaṃ ārocenti – itthannāmo ca itthannāmo ca, āvuso, chabbaggiyā bhikkhū ‘nāmhe koci jānātī’ti sāpattikāva pātimokkhaṃ suṇantī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Te – puramhākaṃ pesalā bhikkhū pātimokkhaṃ ṭhapentīti – paṭikacceva suddhānaṃ bhikkhūnaṃ anāpattikānaṃ avatthusmiṃ akāraṇe pātimokkhaṃ ṭhapenti. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma chabbaggiyā bhikkhū suddhānaṃ bhikkhūnaṃ anāpattikānaṃ avatthusmiṃ akāraṇe pātimokkhaṃ ṭhapessantī’’ti! Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… ‘‘saccaṃ kira, bhikkhave, chabbaggiyā bhikkhū suddhānaṃ bhikkhūnaṃ anāpattikānaṃ avatthusmiṃ akāraṇe pātimokkhaṃ ṭhapentī’’ti? ‘‘Saccaṃ bhagavā’’ti…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘na, bhikkhave, suddhānaṃ bhikkhūnaṃ anāpattikānaṃ avatthusmiṃ akāraṇe pātimokkhaṃ ṭhapetabbaṃ. Yo ṭhapeyya, āpatti dukkaṭassa’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Dhammikādhammikapātimokkhaṭṭhapanaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "387"
      },
      ". ‘‘Ekaṃ ",
      ", bhikkhave, adhammikaṃ pātimokkhaṭṭhapanaṃ, ekaṃ dhammikaṃ; pātimokkhaṭṭhapanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ekaṃ dhammikaṃ (sī. syā.)]"
      },
      ", dve adhammikāni; pātimokkhaṭṭhapanāni, dve dhammikāni; tīṇi adhammikāni pātimokkhaṭṭhapanāni, tīṇi dhammikāni, cattāri adhammikāni pātimokkhaṭṭhapanāni, cattāri dhammikāni; pañca adhammikāni pātimokkhaṭṭhapanāni, pañca dhammikāni; cha adhammikāni pātimokkhaṭṭhapanāni, cha dhammikāni; satta adhammikāni pātimokkhaṭṭhapanāni, satta dhammikāni; aṭṭha adhammikāni pātimokkhaṭṭhapanāni, aṭṭha dhammikāni; nava adhammikāni pātimokkhaṭṭhapanāni ",
      ", nava dhammikāni; dasa adhammikāni pātimokkhaṭṭhapanāni, dasa dhammikāni."
    ],
    "innerText": "387. ‘‘Ekaṃ , bhikkhave, adhammikaṃ pātimokkhaṭṭhapanaṃ, ekaṃ dhammikaṃ; pātimokkhaṭṭhapanaṃ [ekaṃ dhammikaṃ (sī. syā.)], dve adhammikāni; pātimokkhaṭṭhapanāni, dve dhammikāni; tīṇi adhammikāni pātimokkhaṭṭhapanāni, tīṇi dhammikāni, cattāri adhammikāni pātimokkhaṭṭhapanāni, cattāri dhammikāni; pañca adhammikāni pātimokkhaṭṭhapanāni, pañca dhammikāni; cha adhammikāni pātimokkhaṭṭhapanāni, cha dhammikāni; satta adhammikāni pātimokkhaṭṭhapanāni, satta dhammikāni; aṭṭha adhammikāni pātimokkhaṭṭhapanāni, aṭṭha dhammikāni; nava adhammikāni pātimokkhaṭṭhapanāni , nava dhammikāni; dasa adhammikāni pātimokkhaṭṭhapanāni, dasa dhammikāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamaṃ ",
      " ekaṃ adhammikaṃ pātimokkhaṭṭhapanaṃ? Amūlikāya sīlavipattiyā pātimokkhaṃ ṭhapeti – idaṃ ekaṃ adhammikaṃ pātimokkhaṭṭhapanaṃ. Katamaṃ ekaṃ dhammikaṃ pātimokkhaṭṭhapanaṃ? Samūlikāya sīlavipattiyā pātimokkhaṃ ṭhapeti – idaṃ ekaṃ dhammikaṃ pātimokkhaṭṭhapanaṃ."
    ],
    "innerText": "‘‘Katamaṃ ekaṃ adhammikaṃ pātimokkhaṭṭhapanaṃ? Amūlikāya sīlavipattiyā pātimokkhaṃ ṭhapeti – idaṃ ekaṃ adhammikaṃ pātimokkhaṭṭhapanaṃ. Katamaṃ ekaṃ dhammikaṃ pātimokkhaṭṭhapanaṃ? Samūlikāya sīlavipattiyā pātimokkhaṃ ṭhapeti – idaṃ ekaṃ dhammikaṃ pātimokkhaṭṭhapanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamāni dve adhammikāni pātimokkhaṭṭhapanāni? Amūlikāya sīlavipattiyā ",
      " pātimokkhaṃ ṭhapeti, amūlikāya ācāravipattiyā pātimokkhaṃ ṭhapeti – imāni dve adhammikāni pātimokkhaṭṭhapanāni. Katamāni dve dhammikāni pātimokkhaṭṭhapanāni? Samūlikāya sīlavipattiyā pātimokkhaṃ ṭhapeti, samūlikāya ācāravipattiyā pātimokkhaṃ ṭhapeti – imāni dve dhammikāni pātimokkhaṭṭhapanāni."
    ],
    "innerText": "‘‘Katamāni dve adhammikāni pātimokkhaṭṭhapanāni? Amūlikāya sīlavipattiyā pātimokkhaṃ ṭhapeti, amūlikāya ācāravipattiyā pātimokkhaṃ ṭhapeti – imāni dve adhammikāni pātimokkhaṭṭhapanāni. Katamāni dve dhammikāni pātimokkhaṭṭhapanāni? Samūlikāya sīlavipattiyā pātimokkhaṃ ṭhapeti, samūlikāya ācāravipattiyā pātimokkhaṃ ṭhapeti – imāni dve dhammikāni pātimokkhaṭṭhapanāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamāni tīṇi adhammikāni pātimokkhaṭṭhapanāni? Amūlikāya sīlavipattiyā pātimokkhaṃ ṭhapeti, amūlikāya ācāravipattiyā pātimokkhaṃ ṭhapeti, amūlikāya diṭṭhivipattiyā pātimokkhaṃ ṭhapeti – imāni tīṇi adhammikāni pātimokkhaṭṭhapanāni. Katamāni tīṇi dhammikāni pātimokkhaṭṭhapanāni? Samūlikāya ",
      " sīlavipattiyā pātimokkhaṃ ṭhapeti, samūlikāya ācāravipattiyā pātimokkhaṃ ṭhapeti, samūlikāya diṭṭhivipattiyā pātimokkhaṃ ṭhapeti – imāni tīṇi dhammikāni pātimokkhaṭṭhapanāni."
    ],
    "innerText": "‘‘Katamāni tīṇi adhammikāni pātimokkhaṭṭhapanāni? Amūlikāya sīlavipattiyā pātimokkhaṃ ṭhapeti, amūlikāya ācāravipattiyā pātimokkhaṃ ṭhapeti, amūlikāya diṭṭhivipattiyā pātimokkhaṃ ṭhapeti – imāni tīṇi adhammikāni pātimokkhaṭṭhapanāni. Katamāni tīṇi dhammikāni pātimokkhaṭṭhapanāni? Samūlikāya sīlavipattiyā pātimokkhaṃ ṭhapeti, samūlikāya ācāravipattiyā pātimokkhaṃ ṭhapeti, samūlikāya diṭṭhivipattiyā pātimokkhaṃ ṭhapeti – imāni tīṇi dhammikāni pātimokkhaṭṭhapanāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamāni cattāri adhammikāni pātimokkhaṭṭhapanāni? Amūlikāya sīlavipattiyā pātimokkhaṃ ṭhapeti, amūlikāya ācāravipattiyā pātimokkhaṃ ṭhapeti, amūlikāya diṭṭhivipattiyā ",
      " pātimokkhaṃ ṭhapeti, amūlikāya ājīvavipattiyā pātimokkhaṃ ṭhapeti – imāni cattāri adhammikāni pātimokkhaṭṭhapanāni. Katamāni cattāri dhammikāni pātimokkhaṭṭhapanāni? Samūlikāya sīlavipattiyā pātimokkhaṃ ṭhapeti, samūlikāya ācāravipattiyā pātimokkhaṃ ṭhapeti, samūlikāya diṭṭhivipattiyā pātimokkhaṃ ṭhapeti, samūlikāya ājīvavipattiyā pātimokkhaṃ ṭhapeti – imāni cattāri dhammikāni pātimokkhaṭṭhapanāni."
    ],
    "innerText": "‘‘Katamāni cattāri adhammikāni pātimokkhaṭṭhapanāni? Amūlikāya sīlavipattiyā pātimokkhaṃ ṭhapeti, amūlikāya ācāravipattiyā pātimokkhaṃ ṭhapeti, amūlikāya diṭṭhivipattiyā pātimokkhaṃ ṭhapeti, amūlikāya ājīvavipattiyā pātimokkhaṃ ṭhapeti – imāni cattāri adhammikāni pātimokkhaṭṭhapanāni. Katamāni cattāri dhammikāni pātimokkhaṭṭhapanāni? Samūlikāya sīlavipattiyā pātimokkhaṃ ṭhapeti, samūlikāya ācāravipattiyā pātimokkhaṃ ṭhapeti, samūlikāya diṭṭhivipattiyā pātimokkhaṃ ṭhapeti, samūlikāya ājīvavipattiyā pātimokkhaṃ ṭhapeti – imāni cattāri dhammikāni pātimokkhaṭṭhapanāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamāni pañca adhammikāni pātimokkhaṭṭhapanāni? Amūlakena pārājikena pātimokkhaṃ ṭhapeti, amūlakena saṅghādisesena…pe… amūlakena pācittiyena… amūlakena pāṭidesanīyena… amūlakena dukkaṭena pātimokkhaṃ ",
      " ṭhapeti – imāni pañca adhammikāni pātimokkhaṭṭhapanāni. Katamāni pañca dhammikāni pātimokkhaṭṭhapanāni? Samūlakena pārājikena pātimokkhaṃ ṭhapeti, samūlakena saṅghādisesena…pe… ",
      " pācittiyena… pāṭidesanīyena… dukkaṭena pātimokkhaṃ ṭhapeti – imāni pañca dhammikāni pātimokkhaṭṭhapanāni."
    ],
    "innerText": "‘‘Katamāni pañca adhammikāni pātimokkhaṭṭhapanāni? Amūlakena pārājikena pātimokkhaṃ ṭhapeti, amūlakena saṅghādisesena…pe… amūlakena pācittiyena… amūlakena pāṭidesanīyena… amūlakena dukkaṭena pātimokkhaṃ ṭhapeti – imāni pañca adhammikāni pātimokkhaṭṭhapanāni. Katamāni pañca dhammikāni pātimokkhaṭṭhapanāni? Samūlakena pārājikena pātimokkhaṃ ṭhapeti, samūlakena saṅghādisesena…pe… pācittiyena… pāṭidesanīyena… dukkaṭena pātimokkhaṃ ṭhapeti – imāni pañca dhammikāni pātimokkhaṭṭhapanāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Katamāni cha adhammikāni pātimokkhaṭṭhapanāni? Amūlikāya sīlavipattiyā pātimokkhaṃ ṭhapeti akatāya, amūlikāya sīlavipattiyā pātimokkhaṃ ṭhapeti katāya; amūlikāya ācāravipattiyā pātimokkhaṃ ṭhapeti akatāya, amūlikāya ācāravipattiyā pātimokkhaṃ ṭhapeti katāya; amūlikāya diṭṭhivipattiyā pātimokkhaṃ ṭhapeti akatāya, amūlikāya diṭṭhivipattiyā pātimokkhaṃ ṭhapeti katāya – imāni cha adhammikāni pātimokkhaṭṭhapanāni. Katamāni cha dhammikāni pātimokkhaṭṭhapanāni? Samūlikāya sīlavipattiyā pātimokkhaṃ ṭhapeti akatāya, samūlikāya sīlavipattiyā pātimokkhaṃ ṭhapeti katāya; samūlikāya ācāravipattiyā…pe… diṭṭhivipattiyā pātimokkhaṃ ṭhapeti akatāya…pe… katāya – imāni cha dhammikāni pātimokkhaṭṭhapanāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamāni satta adhammikāni pātimokkhaṭṭhapanāni? Amūlakena pārājikena pātimokkhaṃ ṭhapeti, amūlakena saṅghādisesena…pe… ",
      " thullaccayena pācittiyena pāṭidesanīyena dukkaṭena dubbhāsitena pātimokkhaṃ ṭhapeti – imāni satta adhammikāni pātimokkhaṭṭhapanāni. Katamāni satta dhammikāni pātimokkhaṭṭhapanāni? Samūlakena pārājikena pātimokkhaṃ ṭhapeti, samūlakena ",
      " saṅghādisesena…pe… thullaccayena pācittiyena pāṭidesanīyena dukkaṭena dubbhāsitena pātimokkhaṃ ṭhapeti – imāni satta dhammikāni pātimokkhaṭṭhapanāni."
    ],
    "innerText": "‘‘Katamāni satta adhammikāni pātimokkhaṭṭhapanāni? Amūlakena pārājikena pātimokkhaṃ ṭhapeti, amūlakena saṅghādisesena…pe… thullaccayena pācittiyena pāṭidesanīyena dukkaṭena dubbhāsitena pātimokkhaṃ ṭhapeti – imāni satta adhammikāni pātimokkhaṭṭhapanāni. Katamāni satta dhammikāni pātimokkhaṭṭhapanāni? Samūlakena pārājikena pātimokkhaṃ ṭhapeti, samūlakena saṅghādisesena…pe… thullaccayena pācittiyena pāṭidesanīyena dukkaṭena dubbhāsitena pātimokkhaṃ ṭhapeti – imāni satta dhammikāni pātimokkhaṭṭhapanāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamāni aṭṭha adhammikāni pātimokkhaṭṭhapanāni? Amūlikāya sīlavipattiyā pātimokkhaṃ ṭhapeti akatāya, amūlikāya sīlavipattiyā pātimokkhaṃ ṭhapeti katāya; amūlikāya ācāravipattiyā ",
      "…pe… diṭṭhivipattiyā…pe… ājīvavipattiyā pātimokkhaṃ ṭhapeti akatāya…pe… katāya – imāni aṭṭha adhammikāni pātimokkhaṭṭhapanāni. Katamāni ",
      " aṭṭha dhammikāni pātimokkhaṭṭhapanāni? Samūlikāya sīlavipattiyā pātimokkhaṃ ṭhapeti akatāya, samūlikāya sīlavipattiyā pātimokkhaṃ ṭhapeti ",
      " katāya; samūlikāya ācāravipattiyā…pe… diṭṭhivipattiyā…pe… ājīvavipattiyā pātimokkhaṃ ṭhapeti akatāya…pe… katāya. Imāni aṭṭha dhammikāni pātimokkhaṭṭhapanāni."
    ],
    "innerText": "‘‘Katamāni aṭṭha adhammikāni pātimokkhaṭṭhapanāni? Amūlikāya sīlavipattiyā pātimokkhaṃ ṭhapeti akatāya, amūlikāya sīlavipattiyā pātimokkhaṃ ṭhapeti katāya; amūlikāya ācāravipattiyā …pe… diṭṭhivipattiyā…pe… ājīvavipattiyā pātimokkhaṃ ṭhapeti akatāya…pe… katāya – imāni aṭṭha adhammikāni pātimokkhaṭṭhapanāni. Katamāni aṭṭha dhammikāni pātimokkhaṭṭhapanāni? Samūlikāya sīlavipattiyā pātimokkhaṃ ṭhapeti akatāya, samūlikāya sīlavipattiyā pātimokkhaṃ ṭhapeti katāya; samūlikāya ācāravipattiyā…pe… diṭṭhivipattiyā…pe… ājīvavipattiyā pātimokkhaṃ ṭhapeti akatāya…pe… katāya. Imāni aṭṭha dhammikāni pātimokkhaṭṭhapanāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamāni nava adhammikāni pātimokkhaṭṭhapanāni? Amūlikāya sīlavipattiyā pātimokkhaṃ ṭhapeti akatāya, amūlikāya sīlavipattiyā pātimokkhaṃ ṭhapeti katāya, amūlikāya sīlavipattiyā pātimokkhaṃ ṭhapeti katākatāya; amūlikāya ācāravipattiyā…pe… diṭṭhivipattiyā pātimokkhaṃ ṭhapeti akatāya…pe… katāya…pe… katākatāya imāni nava adhammikāni pātimokkhaṭṭhapanāni. Katamāni nava dhammikāni pātimokkhaṭṭhapanāni? Samūlikāya sīlavipattiyā pātimokkhaṃ ṭhapeti akatāya, samūlikāya sīlavipattiyā pātimokkhaṃ ",
      " ṭhapeti katāya, samūlikāya sīlavipattiyā pātimokkhaṃ ṭhapeti katākatāya; samūlikāya ācāravipattiyā…pe… diṭṭhivipattiyā pātimokkhaṃ ṭhapeti akatāya…pe… katāya – katākatāya…pe… imāni nava dhammikāni pātimokkhaṭṭhapanāni."
    ],
    "innerText": "‘‘Katamāni nava adhammikāni pātimokkhaṭṭhapanāni? Amūlikāya sīlavipattiyā pātimokkhaṃ ṭhapeti akatāya, amūlikāya sīlavipattiyā pātimokkhaṃ ṭhapeti katāya, amūlikāya sīlavipattiyā pātimokkhaṃ ṭhapeti katākatāya; amūlikāya ācāravipattiyā…pe… diṭṭhivipattiyā pātimokkhaṃ ṭhapeti akatāya…pe… katāya…pe… katākatāya imāni nava adhammikāni pātimokkhaṭṭhapanāni. Katamāni nava dhammikāni pātimokkhaṭṭhapanāni? Samūlikāya sīlavipattiyā pātimokkhaṃ ṭhapeti akatāya, samūlikāya sīlavipattiyā pātimokkhaṃ ṭhapeti katāya, samūlikāya sīlavipattiyā pātimokkhaṃ ṭhapeti katākatāya; samūlikāya ācāravipattiyā…pe… diṭṭhivipattiyā pātimokkhaṃ ṭhapeti akatāya…pe… katāya – katākatāya…pe… imāni nava dhammikāni pātimokkhaṭṭhapanāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Katamāni dasa adhammikāni pātimokkhaṭṭhapanāni? Na pārājiko tassaṃ parisāyaṃ nisinno hoti, na pārājikakathā vippakatā hoti; na sikkhaṃ paccakkhātako tassaṃ parisāyaṃ nisinno hoti, na sikkhaṃ paccakkhātakathā vippakatā hoti; dhammikaṃ sāmaggiṃ upeti, na dhammikaṃ sāmaggiṃ paccādiyati, na dhammikāya sāmaggiyā paccādānakathā vippakatā hoti; na sīlavipattiyā diṭṭhasutaparisaṅkito hoti, na ācāravipattiyā diṭṭhasutaparisaṅkito hoti, na diṭṭhivipattiyā diṭṭhasutaparisaṅkito hoti – imāni dasa adhammikāni ",
      " pātimokkhaṭṭhapanāni. Katamāni dasa dhammikāni pātimokkhaṭṭhapanāni? Pārājiko tassaṃ parisāyaṃ nisinno hoti, pārājikakathā vippakatā hoti; sikkhaṃ paccakkhātako tassaṃ parisāyaṃ nisinno hoti, sikkhaṃ paccakkhātakathā vippakatā hoti; dhammikaṃ sāmaggiṃ na upeti, dhammikaṃ sāmaggiṃ ",
      " paccādiyati, dhammikāya sāmaggiyā paccādānakathā vippakatā hoti; sīlavipattiyā diṭṭhasutaparisaṅkito hoti, ācāravipattiyā diṭṭhasutaparisaṅkito hoti, diṭṭhivipattiyā diṭṭhasutaparisaṅkito hoti – imāni dasa dhammikāni pātimokkhaṭṭhapanāni."
    ],
    "innerText": "‘‘Katamāni dasa adhammikāni pātimokkhaṭṭhapanāni? Na pārājiko tassaṃ parisāyaṃ nisinno hoti, na pārājikakathā vippakatā hoti; na sikkhaṃ paccakkhātako tassaṃ parisāyaṃ nisinno hoti, na sikkhaṃ paccakkhātakathā vippakatā hoti; dhammikaṃ sāmaggiṃ upeti, na dhammikaṃ sāmaggiṃ paccādiyati, na dhammikāya sāmaggiyā paccādānakathā vippakatā hoti; na sīlavipattiyā diṭṭhasutaparisaṅkito hoti, na ācāravipattiyā diṭṭhasutaparisaṅkito hoti, na diṭṭhivipattiyā diṭṭhasutaparisaṅkito hoti – imāni dasa adhammikāni pātimokkhaṭṭhapanāni. Katamāni dasa dhammikāni pātimokkhaṭṭhapanāni? Pārājiko tassaṃ parisāyaṃ nisinno hoti, pārājikakathā vippakatā hoti; sikkhaṃ paccakkhātako tassaṃ parisāyaṃ nisinno hoti, sikkhaṃ paccakkhātakathā vippakatā hoti; dhammikaṃ sāmaggiṃ na upeti, dhammikaṃ sāmaggiṃ paccādiyati, dhammikāya sāmaggiyā paccādānakathā vippakatā hoti; sīlavipattiyā diṭṭhasutaparisaṅkito hoti, ācāravipattiyā diṭṭhasutaparisaṅkito hoti, diṭṭhivipattiyā diṭṭhasutaparisaṅkito hoti – imāni dasa dhammikāni pātimokkhaṭṭhapanāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Dhammikapātimokkhaṭṭhapanaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "388"
      },
      ". ‘‘Kathaṃ ",
      " pārājiko tassaṃ parisāyaṃ nisinno hoti? Idha, bhikkhave, yehi ākārehi yehi liṅgehi yehi nimittehi pārājikassa dhammassa ajjhāpatti hoti, tehi ākārehi tehi liṅgehi tehi nimittehi bhikkhu bhikkhuṃ passati pārājikaṃ dhammaṃ ajjhāpajjantaṃ. Na heva kho bhikkhu bhikkhuṃ passati pārājikaṃ ",
      " dhammaṃ ajjhāpajjantaṃ, api ca añño bhikkhu bhikkhussa āroceti – ‘itthannāmo, āvuso, bhikkhu pārājikaṃ dhammaṃ ajjhāpanno’ti. Na heva kho bhikkhu bhikkhuṃ passati pārājikaṃ dhammaṃ ajjhāpajjantaṃ, nāpi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[nāpi ca (ka.)]"
      },
      " añño bhikkhu bhikkhussa āroceti – ‘itthannāmo, āvuso, bhikkhu pārājikaṃ dhammaṃ ajjhāpanno’ti, apica sova bhikkhu bhikkhussa āroceti – ‘ahaṃ, āvuso, pārājikaṃ dhammaṃ ajjhāpanno’ti. Ākaṅkhamāno, bhikkhave, bhikkhu tena diṭṭhena tena sutena tāya parisaṅkāya tadahuposathe cātuddase vā pannarase vā tasmiṃ puggale sammukhībhūte saṅghamajjhe udāhareyya –"
    ],
    "innerText": "388. ‘‘Kathaṃ pārājiko tassaṃ parisāyaṃ nisinno hoti? Idha, bhikkhave, yehi ākārehi yehi liṅgehi yehi nimittehi pārājikassa dhammassa ajjhāpatti hoti, tehi ākārehi tehi liṅgehi tehi nimittehi bhikkhu bhikkhuṃ passati pārājikaṃ dhammaṃ ajjhāpajjantaṃ. Na heva kho bhikkhu bhikkhuṃ passati pārājikaṃ dhammaṃ ajjhāpajjantaṃ, api ca añño bhikkhu bhikkhussa āroceti – ‘itthannāmo, āvuso, bhikkhu pārājikaṃ dhammaṃ ajjhāpanno’ti. Na heva kho bhikkhu bhikkhuṃ passati pārājikaṃ dhammaṃ ajjhāpajjantaṃ, nāpi [nāpi ca (ka.)] añño bhikkhu bhikkhussa āroceti – ‘itthannāmo, āvuso, bhikkhu pārājikaṃ dhammaṃ ajjhāpanno’ti, apica sova bhikkhu bhikkhussa āroceti – ‘ahaṃ, āvuso, pārājikaṃ dhammaṃ ajjhāpanno’ti. Ākaṅkhamāno, bhikkhave, bhikkhu tena diṭṭhena tena sutena tāya parisaṅkāya tadahuposathe cātuddase vā pannarase vā tasmiṃ puggale sammukhībhūte saṅghamajjhe udāhareyya –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu me, bhante, saṅgho. Itthannāmo puggalo pārājikaṃ dhammaṃ ajjhāpanno, tassa pātimokkhaṃ ṭhapemi, na tasmiṃ sammukhībhūte ",
      " pātimokkhaṃ uddisitabbanti – dhammikaṃ pātimokkhaṭṭhapanaṃ."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Itthannāmo puggalo pārājikaṃ dhammaṃ ajjhāpanno, tassa pātimokkhaṃ ṭhapemi, na tasmiṃ sammukhībhūte pātimokkhaṃ uddisitabbanti – dhammikaṃ pātimokkhaṭṭhapanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "389"
      },
      ". ‘‘Bhikkhussa pātimokkhe ṭhapite parisā vuṭṭhāti, dasannaṃ antarāyānaṃ aññatarena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[aññatarena antarāyena (syā. kaṃ.)]"
      },
      " – rājantarāyena vā, corantarāyena vā, agyantarāyena vā, udakantarāyena vā, manussantarāyena vā, amanussantarāyena vā, vāḷantarāyena vā, sarīsapantarāyena vā, jīvitantarāyena ",
      " vā, brahmacariyantarāyena vā. Ākaṅkhamāno, bhikkhave, bhikkhu tasmiṃ vā āvāse, aññasmiṃ vā āvāse, tasmiṃ puggale sammukhībhūte saṅghamajjhe udāhareyya –"
    ],
    "innerText": "389. ‘‘Bhikkhussa pātimokkhe ṭhapite parisā vuṭṭhāti, dasannaṃ antarāyānaṃ aññatarena [aññatarena antarāyena (syā. kaṃ.)] – rājantarāyena vā, corantarāyena vā, agyantarāyena vā, udakantarāyena vā, manussantarāyena vā, amanussantarāyena vā, vāḷantarāyena vā, sarīsapantarāyena vā, jīvitantarāyena vā, brahmacariyantarāyena vā. Ākaṅkhamāno, bhikkhave, bhikkhu tasmiṃ vā āvāse, aññasmiṃ vā āvāse, tasmiṃ puggale sammukhībhūte saṅghamajjhe udāhareyya –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Itthannāmassa puggalassa pārājikakathā vippakatā, taṃ vatthu avinicchitaṃ. Yadi saṅghassa pattakallaṃ, saṅgho taṃ vatthuṃ vinicchineyyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, tadahuposathe cātuddase vā pannarase vā tasmiṃ puggale sammukhībhūte saṅghamajjhe udāharitabbaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu ",
      " me, bhante, saṅgho. Itthannāmassa puggalassa pārājikakathā vippakatā, taṃ vatthu avinicchitaṃ. Tassa pātimokkhaṃ ṭhapemi, na tasmiṃ sammukhībhūte pātimokkhaṃ uddisitabbanti – dhammikaṃ pātimokkhaṭṭhapanaṃ."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Itthannāmassa puggalassa pārājikakathā vippakatā, taṃ vatthu avinicchitaṃ. Tassa pātimokkhaṃ ṭhapemi, na tasmiṃ sammukhībhūte pātimokkhaṃ uddisitabbanti – dhammikaṃ pātimokkhaṭṭhapanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "390"
      },
      ". ‘‘Kathaṃ sikkhaṃ paccakkhātako tassaṃ parisāyaṃ nisinno hoti? Idha pana, bhikkhave, bhikkhu yehi ākārehi yehi liṅgehi yehi ",
      " nimittehi sikkhā paccakkhātā hoti, tehi ākārehi tehi liṅgehi tehi nimittehi bhikkhu bhikkhuṃ passati sikkhaṃ paccakkhantaṃ. Na heva kho bhikkhu bhikkhuṃ passati sikkhaṃ paccakkhantaṃ, apica añño bhikkhu bhikkhussa āroceti – ‘itthannāmena, āvuso, bhikkhunā sikkhā paccakkhātā’ti. Na heva kho bhikkhu bhikkhuṃ passati sikkhaṃ paccakkhantaṃ, nāpi añño ",
      " bhikkhu bhikkhussa āroceti – ‘itthannāmena, āvuso, bhikkhunā sikkhā paccakkhātā’ti, apica sova bhikkhu bhikkhussa āroceti – ‘mayā, āvuso, sikkhā paccakkhātā’ti. Ākaṅkhamāno, bhikkhave, bhikkhu tena diṭṭhena tena sutena tāya parisaṅkāya tadahuposathe cātuddase vā pannarase vā tasmiṃ puggale sammukhībhūte saṅghamajjhe udāhareyya –"
    ],
    "innerText": "390. ‘‘Kathaṃ sikkhaṃ paccakkhātako tassaṃ parisāyaṃ nisinno hoti? Idha pana, bhikkhave, bhikkhu yehi ākārehi yehi liṅgehi yehi nimittehi sikkhā paccakkhātā hoti, tehi ākārehi tehi liṅgehi tehi nimittehi bhikkhu bhikkhuṃ passati sikkhaṃ paccakkhantaṃ. Na heva kho bhikkhu bhikkhuṃ passati sikkhaṃ paccakkhantaṃ, apica añño bhikkhu bhikkhussa āroceti – ‘itthannāmena, āvuso, bhikkhunā sikkhā paccakkhātā’ti. Na heva kho bhikkhu bhikkhuṃ passati sikkhaṃ paccakkhantaṃ, nāpi añño bhikkhu bhikkhussa āroceti – ‘itthannāmena, āvuso, bhikkhunā sikkhā paccakkhātā’ti, apica sova bhikkhu bhikkhussa āroceti – ‘mayā, āvuso, sikkhā paccakkhātā’ti. Ākaṅkhamāno, bhikkhave, bhikkhu tena diṭṭhena tena sutena tāya parisaṅkāya tadahuposathe cātuddase vā pannarase vā tasmiṃ puggale sammukhībhūte saṅghamajjhe udāhareyya –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Itthannāmena puggalena sikkhā paccakkhātā, tassa pātimokkhaṃ ṭhapemi, na tasmiṃ sammukhībhūte pātimokkhaṃ uddisitabbanti – dhammikaṃ pātimokkhaṭṭhapanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "391"
      },
      ". ‘‘Bhikkhussa pātimokkhe ṭhapite parisā vuṭṭhāti, dasannaṃ antarāyānaṃ aññatarena – rājantarāyena vā ",
      " …pe… brahmacariyantarāyena vā, ākaṅkhamāno, bhikkhave, bhikkhu tasmiṃ vā āvāse, aññasmiṃ vā āvāse, tasmiṃ puggale sammukhībhūte saṅghamajjhe udāhareyya –"
    ],
    "innerText": "391. ‘‘Bhikkhussa pātimokkhe ṭhapite parisā vuṭṭhāti, dasannaṃ antarāyānaṃ aññatarena – rājantarāyena vā …pe… brahmacariyantarāyena vā, ākaṅkhamāno, bhikkhave, bhikkhu tasmiṃ vā āvāse, aññasmiṃ vā āvāse, tasmiṃ puggale sammukhībhūte saṅghamajjhe udāhareyya –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu me, bhante, saṅgho. Itthannāmassa puggalassa sikkhaṃ paccakkhātakathā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sikkhāpaccakkhātakathā (sī.)]"
      },
      " vippakatā, taṃ vatthu avinicchitaṃ. Yadi saṅghassa pattakallaṃ, saṅgho taṃ vatthuṃ vinicchineyyāti."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Itthannāmassa puggalassa sikkhaṃ paccakkhātakathā [sikkhāpaccakkhātakathā (sī.)] vippakatā, taṃ vatthu avinicchitaṃ. Yadi saṅghassa pattakallaṃ, saṅgho taṃ vatthuṃ vinicchineyyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evañcetaṃ ",
      " labhetha, iccetaṃ kusalaṃ. No ce labhetha, tadahuposathe cātuddase vā pannarase vā tasmiṃ puggale sammukhībhūte saṅghamajjhe udāharitabbaṃ –"
    ],
    "innerText": "‘‘Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, tadahuposathe cātuddase vā pannarase vā tasmiṃ puggale sammukhībhūte saṅghamajjhe udāharitabbaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu ",
      " me, bhante, saṅgho. Itthannāmassa puggalassa sikkhaṃ paccakkhātakathā vippakatā, taṃ vatthu avinicchitaṃ. Tassa pātimokkhaṃ ṭhapemi, na tasmiṃ sammukhībhūte pātimokkhaṃ uddisitabbanti – dhammikaṃ pātimokkhaṭṭhapanaṃ."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Itthannāmassa puggalassa sikkhaṃ paccakkhātakathā vippakatā, taṃ vatthu avinicchitaṃ. Tassa pātimokkhaṃ ṭhapemi, na tasmiṃ sammukhībhūte pātimokkhaṃ uddisitabbanti – dhammikaṃ pātimokkhaṭṭhapanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "392"
      },
      ". ‘‘Kathaṃ dhammikaṃ sāmaggiṃ na upeti? Idha pana, bhikkhave, bhikkhu yehi ākārehi yehi liṅgehi yehi nimittehi dhammikāya sāmaggiyānupagamanaṃ hoti, tehi ākārehi tehi liṅgehi tehi nimittehi bhikkhu bhikkhuṃ passati dhammikaṃ sāmaggiṃ na upentaṃ. Na heva kho bhikkhu bhikkhuṃ passati dhammikaṃ sāmaggiṃ na upentaṃ, api ca añño bhikkhu bhikkhussa āroceti – ‘itthannāmo, āvuso, bhikkhu dhammikaṃ sāmaggiṃ na upetī’ti. Na heva kho bhikkhu bhikkhuṃ passati dhammikaṃ sāmaggiṃ na upentaṃ, nāpi añño bhikkhu bhikkhussa āroceti – ‘itthannāmo, āvuso, bhikkhu dhammikaṃ sāmaggiṃ na upetī’ti, api ca sova bhikkhu bhikkhussa āroceti – ‘ahaṃ, āvuso, dhammikaṃ sāmaggiṃ na upemī’ti. Ākaṅkhamāno, bhikkhave, bhikkhu tena diṭṭhena tena sutena tāya parisaṅkāya tadahuposathe cātuddase vā ",
      " pannarase vā tasmiṃ puggale sammukhībhūte saṅghamajjhe udāhareyya –"
    ],
    "innerText": "392. ‘‘Kathaṃ dhammikaṃ sāmaggiṃ na upeti? Idha pana, bhikkhave, bhikkhu yehi ākārehi yehi liṅgehi yehi nimittehi dhammikāya sāmaggiyānupagamanaṃ hoti, tehi ākārehi tehi liṅgehi tehi nimittehi bhikkhu bhikkhuṃ passati dhammikaṃ sāmaggiṃ na upentaṃ. Na heva kho bhikkhu bhikkhuṃ passati dhammikaṃ sāmaggiṃ na upentaṃ, api ca añño bhikkhu bhikkhussa āroceti – ‘itthannāmo, āvuso, bhikkhu dhammikaṃ sāmaggiṃ na upetī’ti. Na heva kho bhikkhu bhikkhuṃ passati dhammikaṃ sāmaggiṃ na upentaṃ, nāpi añño bhikkhu bhikkhussa āroceti – ‘itthannāmo, āvuso, bhikkhu dhammikaṃ sāmaggiṃ na upetī’ti, api ca sova bhikkhu bhikkhussa āroceti – ‘ahaṃ, āvuso, dhammikaṃ sāmaggiṃ na upemī’ti. Ākaṅkhamāno, bhikkhave, bhikkhu tena diṭṭhena tena sutena tāya parisaṅkāya tadahuposathe cātuddase vā pannarase vā tasmiṃ puggale sammukhībhūte saṅghamajjhe udāhareyya –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu me, bhante, saṅgho. Itthannāmo puggalo dhammikaṃ sāmaggiṃ na upeti ",
      ", tassa pātimokkhaṃ ṭhapemi, na tasmiṃ sammukhībhūte pātimokkhaṃ uddisitabbanti – dhammikaṃ pātimokkhaṭṭhapanaṃ."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Itthannāmo puggalo dhammikaṃ sāmaggiṃ na upeti , tassa pātimokkhaṃ ṭhapemi, na tasmiṃ sammukhībhūte pātimokkhaṃ uddisitabbanti – dhammikaṃ pātimokkhaṭṭhapanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "393"
      },
      ". ‘‘Kathaṃ dhammikaṃ sāmaggiṃ paccādiyati? Idha, bhikkhave, bhikkhu yehi ākārehi yehi liṅgehi yehi nimittehi dhammikāya sāmaggiyā paccādānaṃ hoti, tehi ākārehi ",
      " tehi liṅgehi tehi nimittehi bhikkhu bhikkhuṃ passati dhammikaṃ sāmaggiṃ paccādiyantaṃ na heva kho bhikkhu bhikkhuṃ passati dhammikaṃ sāmaggiṃ paccādiyantaṃ, api ca añño bhikkhu bhikkhussa āroceti – ‘itthannāmo, āvuso, bhikkhu dhammikaṃ sāmaggiṃ paccādiyatī’ti. Na heva kho bhikkhu bhikkhuṃ passati dhammikaṃ sāmaggiṃ paccādiyantaṃ, nāpi añño bhikkhu bhikkhussa āroceti – ‘itthannāmo, āvuso, bhikkhu dhammikaṃ sāmaggiṃ paccādiyatī’ti, api ca sova bhikkhu bhikkhussa āroceti – ‘ahaṃ, āvuso, dhammikaṃ sāmaggiṃ paccādiyāmī’ti ",
      ". Ākaṅkhamāno, bhikkhave, bhikkhu tena diṭṭhena tena sutena tāya parisaṅkāya tadahuposathe cātuddase vā pannarase vā tasmiṃ puggale sammukhībhūte saṅghamajjhe udāhareyya –"
    ],
    "innerText": "393. ‘‘Kathaṃ dhammikaṃ sāmaggiṃ paccādiyati? Idha, bhikkhave, bhikkhu yehi ākārehi yehi liṅgehi yehi nimittehi dhammikāya sāmaggiyā paccādānaṃ hoti, tehi ākārehi tehi liṅgehi tehi nimittehi bhikkhu bhikkhuṃ passati dhammikaṃ sāmaggiṃ paccādiyantaṃ na heva kho bhikkhu bhikkhuṃ passati dhammikaṃ sāmaggiṃ paccādiyantaṃ, api ca añño bhikkhu bhikkhussa āroceti – ‘itthannāmo, āvuso, bhikkhu dhammikaṃ sāmaggiṃ paccādiyatī’ti. Na heva kho bhikkhu bhikkhuṃ passati dhammikaṃ sāmaggiṃ paccādiyantaṃ, nāpi añño bhikkhu bhikkhussa āroceti – ‘itthannāmo, āvuso, bhikkhu dhammikaṃ sāmaggiṃ paccādiyatī’ti, api ca sova bhikkhu bhikkhussa āroceti – ‘ahaṃ, āvuso, dhammikaṃ sāmaggiṃ paccādiyāmī’ti . Ākaṅkhamāno, bhikkhave, bhikkhu tena diṭṭhena tena sutena tāya parisaṅkāya tadahuposathe cātuddase vā pannarase vā tasmiṃ puggale sammukhībhūte saṅghamajjhe udāhareyya –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Itthannāmo puggalo dhammikaṃ sāmaggiṃ paccādiyati, tassa pātimokkhaṃ ṭhapemi, na tasmiṃ sammukhībhūte pātimokkhaṃ uddisitabbanti – dhammikaṃ pātimokkhaṭṭhapanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "394"
      },
      ". ‘‘Bhikkhussa pātimokkhe ṭhapite parisā vuṭṭhāti, dasannaṃ antarāyānaṃ aññatarena – rājantarāyena vā…pe… brahmacariyantarāyena ",
      " vā. Ākaṅkhamāno, bhikkhave, bhikkhu tasmiṃ vā āvāse, aññasmiṃ vā āvāse, tasmiṃ puggale sammukhībhūte saṅghamajjhe udāhareyya –"
    ],
    "innerText": "394. ‘‘Bhikkhussa pātimokkhe ṭhapite parisā vuṭṭhāti, dasannaṃ antarāyānaṃ aññatarena – rājantarāyena vā…pe… brahmacariyantarāyena vā. Ākaṅkhamāno, bhikkhave, bhikkhu tasmiṃ vā āvāse, aññasmiṃ vā āvāse, tasmiṃ puggale sammukhībhūte saṅghamajjhe udāhareyya –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Itthannāmassa puggalassa dhammikāya sāmaggiyā paccādānakathā vippakatā, taṃ vatthu avinicchitaṃ. Yadi saṅghassa pattakallaṃ, saṅgho taṃ vatthuṃ vinicchineyyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, tadahuposathe cātuddase vā pannarase vā tasmiṃ puggale sammukhībhūte saṅghamajjhe udāharitabbaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Itthannāmassa puggalassa dhammikāya sāmaggiyā paccādānakathā vippakatā, taṃ vatthu avinicchitaṃ. Tassa pātimokkhaṃ ṭhapemi, na tasmiṃ sammukhībhūte pātimokkhaṃ uddisitabbanti – dhammikaṃ pātimokkhaṭṭhapanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "395"
      },
      ". ‘‘Kathaṃ ",
      " sīlavipattiyā diṭṭhasutaparisaṅkito hoti? Idha pana, bhikkhave, bhikkhu yehi ākārehi yehi liṅgehi yehi nimittehi sīlavipattiyā diṭṭhasutaparisaṅkito hoti, tehi ākārehi tehi liṅgehi tehi nimittehi bhikkhu bhikkhuṃ passati sīlavipattiyā diṭṭhasutaparisaṅkitaṃ. Na heva kho bhikkhu bhikkhuṃ passati sīlavipattiyā diṭṭhasutaparisaṅkitaṃ, api ca añño bhikkhu bhikkhussa āroceti – ‘itthannāmo, āvuso, bhikkhu sīlavipattiyā diṭṭhasutaparisaṅkito’ti. Na heva kho bhikkhu bhikkhuṃ passati sīlavipattiyā diṭṭhasutaparisaṅkitaṃ, nāpi añño bhikkhu bhikkhussa āroceti – ‘itthannāmo, āvuso, bhikkhu ",
      " sīlavipattiyā diṭṭhasutaparisaṅkito’ti, api ca sova bhikkhu bhikkhussa āroceti – ‘ahaṃ, āvuso, sīlavipattiyā diṭṭhasutaparisaṅkitomhī’ti. Ākaṅkhamāno, bhikkhave, bhikkhu tena diṭṭhena tena sutena tāya parisaṅkāya tadahuposathe cātuddase vā pannarase vā tasmiṃ puggale sammukhībhūte saṅghamajjhe udāhareyya –"
    ],
    "innerText": "395. ‘‘Kathaṃ sīlavipattiyā diṭṭhasutaparisaṅkito hoti? Idha pana, bhikkhave, bhikkhu yehi ākārehi yehi liṅgehi yehi nimittehi sīlavipattiyā diṭṭhasutaparisaṅkito hoti, tehi ākārehi tehi liṅgehi tehi nimittehi bhikkhu bhikkhuṃ passati sīlavipattiyā diṭṭhasutaparisaṅkitaṃ. Na heva kho bhikkhu bhikkhuṃ passati sīlavipattiyā diṭṭhasutaparisaṅkitaṃ, api ca añño bhikkhu bhikkhussa āroceti – ‘itthannāmo, āvuso, bhikkhu sīlavipattiyā diṭṭhasutaparisaṅkito’ti. Na heva kho bhikkhu bhikkhuṃ passati sīlavipattiyā diṭṭhasutaparisaṅkitaṃ, nāpi añño bhikkhu bhikkhussa āroceti – ‘itthannāmo, āvuso, bhikkhu sīlavipattiyā diṭṭhasutaparisaṅkito’ti, api ca sova bhikkhu bhikkhussa āroceti – ‘ahaṃ, āvuso, sīlavipattiyā diṭṭhasutaparisaṅkitomhī’ti. Ākaṅkhamāno, bhikkhave, bhikkhu tena diṭṭhena tena sutena tāya parisaṅkāya tadahuposathe cātuddase vā pannarase vā tasmiṃ puggale sammukhībhūte saṅghamajjhe udāhareyya –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu me, bhante, saṅgho. Itthannāmo puggalo sīlavipattiyā diṭṭhasutaparisaṅkito, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[diṭṭhasutaparisaṅkito hoti (syā. kaṃ.)]"
      },
      " tassa pātimokkhaṃ ṭhapemi, na tasmiṃ sammukhībhūte pātimokkhaṃ uddisitabbanti – dhammikaṃ pātimokkhaṭṭhapanaṃ."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Itthannāmo puggalo sīlavipattiyā diṭṭhasutaparisaṅkito, [diṭṭhasutaparisaṅkito hoti (syā. kaṃ.)] tassa pātimokkhaṃ ṭhapemi, na tasmiṃ sammukhībhūte pātimokkhaṃ uddisitabbanti – dhammikaṃ pātimokkhaṭṭhapanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "396"
      },
      ". ‘‘Kathaṃ ācāravipattiyā diṭṭhasutaparisaṅkito hoti? Idha pana, bhikkhave, bhikkhu yehi ākārehi yehi liṅgehi yehi nimittehi ācāravipattiyā diṭṭhasutaparisaṅkito hoti tehi ākārehi tehi liṅgehi tehi nimittehi bhikkhu bhikkhuṃ passati ācāravipattiyā diṭṭhasutaparisaṅkitaṃ. Na heva kho bhikkhu bhikkhuṃ passati ācāravipattiyā diṭṭhasutaparisaṅkitaṃ, api ca añño bhikkhu bhikkhussa āroceti – ‘itthannāmo, āvuso, bhikkhu ācāravipattiyā diṭṭhasutaparisaṅkito’ti. Na heva kho bhikkhu bhikkhuṃ passati ācāravipattiyā diṭṭhasutaparisaṅkitaṃ, nāpi añño bhikkhu bhikkhussa āroceti – ‘itthannāmo, āvuso, bhikkhu ācāravipattiyā diṭṭhasutaparisaṅkito’ti, api ca sova bhikkhu bhikkhussa āroceti – ‘ahaṃ, āvuso, ācāravipattiyā diṭṭhasutaparisaṅkitomhī’ti. Ākaṅkhamāno, bhikkhave, bhikkhu tena diṭṭhena tena sutena tāya ",
      " parisaṅkāya tadahuposathe cātuddase vā pannarase vā tasmiṃ puggale sammukhībhūte saṅghamajjhe udāhareyya –"
    ],
    "innerText": "396. ‘‘Kathaṃ ācāravipattiyā diṭṭhasutaparisaṅkito hoti? Idha pana, bhikkhave, bhikkhu yehi ākārehi yehi liṅgehi yehi nimittehi ācāravipattiyā diṭṭhasutaparisaṅkito hoti tehi ākārehi tehi liṅgehi tehi nimittehi bhikkhu bhikkhuṃ passati ācāravipattiyā diṭṭhasutaparisaṅkitaṃ. Na heva kho bhikkhu bhikkhuṃ passati ācāravipattiyā diṭṭhasutaparisaṅkitaṃ, api ca añño bhikkhu bhikkhussa āroceti – ‘itthannāmo, āvuso, bhikkhu ācāravipattiyā diṭṭhasutaparisaṅkito’ti. Na heva kho bhikkhu bhikkhuṃ passati ācāravipattiyā diṭṭhasutaparisaṅkitaṃ, nāpi añño bhikkhu bhikkhussa āroceti – ‘itthannāmo, āvuso, bhikkhu ācāravipattiyā diṭṭhasutaparisaṅkito’ti, api ca sova bhikkhu bhikkhussa āroceti – ‘ahaṃ, āvuso, ācāravipattiyā diṭṭhasutaparisaṅkitomhī’ti. Ākaṅkhamāno, bhikkhave, bhikkhu tena diṭṭhena tena sutena tāya parisaṅkāya tadahuposathe cātuddase vā pannarase vā tasmiṃ puggale sammukhībhūte saṅghamajjhe udāhareyya –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu me, bhante, saṅgho. Itthannāmo puggalo ācāravipattiyā diṭṭhasutaparisaṅkito, tassa ",
      " pātimokkhaṃ ṭhapemi, na tasmiṃ sammukhībhūte pātimokkhaṃ uddisitabbanti – dhammikaṃ pātimokkhaṭṭhapanaṃ."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Itthannāmo puggalo ācāravipattiyā diṭṭhasutaparisaṅkito, tassa pātimokkhaṃ ṭhapemi, na tasmiṃ sammukhībhūte pātimokkhaṃ uddisitabbanti – dhammikaṃ pātimokkhaṭṭhapanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "397"
      },
      ". ‘‘Kathaṃ diṭṭhivipattiyā diṭṭhasutaparisaṅkito hoti? Idha pana, bhikkhave, bhikkhu yehi ākārehi yehi liṅgehi yehi nimittehi diṭṭhivipattiyā ",
      " diṭṭhasutaparisaṅkito hoti, tehi ākārehi tehi liṅgehi tehi nimittehi bhikkhu bhikkhuṃ passati diṭṭhivipattiyā diṭṭhasutaparisaṅkitaṃ. Na heva kho bhikkhu bhikkhuṃ passati diṭṭhivipattiyā diṭṭhasutaparisaṅkitaṃ, api ca añño bhikkhu bhikkhussa āroceti – ‘itthannāmo, āvuso, bhikkhu diṭṭhivipattiyā diṭṭhasutaparisaṅkito’ti. Na heva kho bhikkhu bhikkhuṃ passati diṭṭhivipattiyā diṭṭhasutaparisaṅkitaṃ, nāpi añño bhikkhu bhikkhussa āroceti – ‘itthannāmo, āvuso, bhikkhu diṭṭhivipattiyā diṭṭhasutaparisaṅkito’ti, api ca sova bhikkhu bhikkhussa āroceti – ‘ahaṃ, āvuso, diṭṭhivipattiyā diṭṭhasutaparisaṅkitomhī’ti. Ākaṅkhamāno, bhikkhave, bhikkhu tena diṭṭhena tena sutena tāya parisaṅkāya tadahuposathe cātuddase vā pannarase vā tasmiṃ puggale sammukhībhūte saṅghamajjhe udāhareyya –"
    ],
    "innerText": "397. ‘‘Kathaṃ diṭṭhivipattiyā diṭṭhasutaparisaṅkito hoti? Idha pana, bhikkhave, bhikkhu yehi ākārehi yehi liṅgehi yehi nimittehi diṭṭhivipattiyā diṭṭhasutaparisaṅkito hoti, tehi ākārehi tehi liṅgehi tehi nimittehi bhikkhu bhikkhuṃ passati diṭṭhivipattiyā diṭṭhasutaparisaṅkitaṃ. Na heva kho bhikkhu bhikkhuṃ passati diṭṭhivipattiyā diṭṭhasutaparisaṅkitaṃ, api ca añño bhikkhu bhikkhussa āroceti – ‘itthannāmo, āvuso, bhikkhu diṭṭhivipattiyā diṭṭhasutaparisaṅkito’ti. Na heva kho bhikkhu bhikkhuṃ passati diṭṭhivipattiyā diṭṭhasutaparisaṅkitaṃ, nāpi añño bhikkhu bhikkhussa āroceti – ‘itthannāmo, āvuso, bhikkhu diṭṭhivipattiyā diṭṭhasutaparisaṅkito’ti, api ca sova bhikkhu bhikkhussa āroceti – ‘ahaṃ, āvuso, diṭṭhivipattiyā diṭṭhasutaparisaṅkitomhī’ti. Ākaṅkhamāno, bhikkhave, bhikkhu tena diṭṭhena tena sutena tāya parisaṅkāya tadahuposathe cātuddase vā pannarase vā tasmiṃ puggale sammukhībhūte saṅghamajjhe udāhareyya –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu me, bhante, saṅgho. Itthannāmo puggalo diṭṭhivipattiyā diṭṭhasutaparisaṅkito, tassa ",
      " pātimokkhaṃ ṭhapemi, na tasmiṃ sammukhībhūte pātimokkhaṃ uddisitabbanti – dhammikaṃ ",
      " pātimokkhaṭṭhapanaṃ."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Itthannāmo puggalo diṭṭhivipattiyā diṭṭhasutaparisaṅkito, tassa pātimokkhaṃ ṭhapemi, na tasmiṃ sammukhībhūte pātimokkhaṃ uddisitabbanti – dhammikaṃ pātimokkhaṭṭhapanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Imāni dasa dhammikāni pātimokkhaṭṭhapanānī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṭhamabhāṇavāro niṭṭhito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Attādānaaṅgaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "398"
      },
      ". Atha kho āyasmā upāli yena bhagavā tenupasaṅkami, upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā upāli bhagavantaṃ etadavoca – ‘‘attādānaṃ ādātukāmena, bhante, bhikkhunā katamaṅgasamannāgataṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kataṅgasamannāgataṃ (ka.)]"
      },
      " attādānaṃ ādātabba’’nti?"
    ],
    "innerText": "398. Atha kho āyasmā upāli yena bhagavā tenupasaṅkami, upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā upāli bhagavantaṃ etadavoca – ‘‘attādānaṃ ādātukāmena, bhante, bhikkhunā katamaṅgasamannāgataṃ [kataṅgasamannāgataṃ (ka.)] attādānaṃ ādātabba’’nti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pari. 440]"
      },
      " ‘‘Attādānaṃ ",
      " ādātukāmena, upāli, bhikkhunā pañcaṅgasamannāgataṃ attādānaṃ ādātabbaṃ. Attādānaṃ ādātukāmena, upāli, bhikkhunā evaṃ paccavekkhitabbaṃ – ‘yaṃ kho ahaṃ imaṃ attādānaṃ ādātukāmo, kālo nu kho imaṃ attādānaṃ ādātuṃ udāhu no’ti? Sace, upāli, bhikkhu paccavekkhamāno evaṃ jānāti – ‘akālo imaṃ attādānaṃ ādātuṃ, no kālo’ti, na taṃ, upāli, attādānaṃ ādātabbaṃ."
    ],
    "innerText": "[pari. 440] ‘‘Attādānaṃ ādātukāmena, upāli, bhikkhunā pañcaṅgasamannāgataṃ attādānaṃ ādātabbaṃ. Attādānaṃ ādātukāmena, upāli, bhikkhunā evaṃ paccavekkhitabbaṃ – ‘yaṃ kho ahaṃ imaṃ attādānaṃ ādātukāmo, kālo nu kho imaṃ attādānaṃ ādātuṃ udāhu no’ti? Sace, upāli, bhikkhu paccavekkhamāno evaṃ jānāti – ‘akālo imaṃ attādānaṃ ādātuṃ, no kālo’ti, na taṃ, upāli, attādānaṃ ādātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sace panupāli, bhikkhu paccavekkhamāno evaṃ jānāti – ‘kālo imaṃ attādānaṃ ādātuṃ, no akālo’ti, tenupāli, bhikkhunā uttari paccavekkhitabbaṃ – ‘yaṃ kho ahaṃ imaṃ attādānaṃ ādātukāmo, bhūtaṃ nu kho idaṃ attādānaṃ udāhu no’ti? Sace, upāli, bhikkhu paccavekkhamāno evaṃ jānāti – ‘abhūtaṃ idaṃ attādānaṃ, no bhūta’nti, na taṃ, upāli, attādānaṃ ādātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace panupāli, bhikkhu paccavekkhamāno ",
      " evaṃ jānāti – ‘bhūtaṃ idaṃ attādānaṃ, no abhūta’nti, tenupāli, bhikkhunā uttari paccavekkhitabbaṃ – ‘yaṃ kho ahaṃ imaṃ attādānaṃ ādātukāmo, atthasañhitaṃ nu kho idaṃ attādānaṃ udāhu no’ti? Sace, upāli, bhikkhu paccavekkhamāno evaṃ jānāti – ‘anatthasañhitaṃ idaṃ attādānaṃ, no atthasañhita’nti, na taṃ, upāli, attādānaṃ ādātabbaṃ."
    ],
    "innerText": "‘‘Sace panupāli, bhikkhu paccavekkhamāno evaṃ jānāti – ‘bhūtaṃ idaṃ attādānaṃ, no abhūta’nti, tenupāli, bhikkhunā uttari paccavekkhitabbaṃ – ‘yaṃ kho ahaṃ imaṃ attādānaṃ ādātukāmo, atthasañhitaṃ nu kho idaṃ attādānaṃ udāhu no’ti? Sace, upāli, bhikkhu paccavekkhamāno evaṃ jānāti – ‘anatthasañhitaṃ idaṃ attādānaṃ, no atthasañhita’nti, na taṃ, upāli, attādānaṃ ādātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sace panupāli, bhikkhu paccavekkhamāno evaṃ jānāti – ‘atthasañhitaṃ idaṃ attādānaṃ, no anatthasañhita’nti, tenupāli, bhikkhunā uttari paccavekkhitabbaṃ – ‘imaṃ kho ahaṃ attādānaṃ ādiyamāno labhissāmi sandiṭṭhe sambhatte bhikkhū dhammato vinayato pakkhe udāhu no’ti? Sace, upāli, bhikkhu paccavekkhamāno evaṃ jānāti – ‘imaṃ kho ahaṃ attādānaṃ ādiyamāno na labhissāmi sandiṭṭhe sambhatte bhikkhū dhammato vinayato pakkhe’ti, na taṃ, upāli, attādānaṃ ādātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace panupāli, bhikkhu paccavekkhamāno evaṃ jānāti – ‘imaṃ kho ahaṃ ",
      " attādānaṃ ādiyamāno labhissāmi sandiṭṭhe sambhatte bhikkhū dhammato vinayato pakkhe’ti, tenupāli, bhikkhunā uttari paccavekkhitabbaṃ – ‘imaṃ kho me attādānaṃ ādiyato bhavissati saṅghassa tatonidānaṃ bhaṇḍanaṃ kalaho viggaho vivādo saṅghabhedo saṅgharāji saṅghavavatthānaṃ saṅghanānākaraṇaṃ udāhu no’ti? Sace upāli, bhikkhu paccavekkhamāno evaṃ jānāti – ‘imaṃ kho me attādānaṃ ",
      " ādiyato bhavissati saṅghassa tatonidānaṃ bhaṇḍanaṃ kalaho viggaho vivādo saṅghabhedo saṅgharāji saṅghavavatthānaṃ ",
      " saṅghanānākaraṇa’nti, na taṃ, upāli, attādānaṃ ādātabbaṃ. Sace panupāli, bhikkhu paccavekkhamāno evaṃ jānāti – ‘imaṃ kho me attādānaṃ ādiyato na bhavissati saṅghassa tatonidānaṃ bhaṇḍanaṃ kalaho viggaho ",
      " vivādo saṅghabhedo saṅgharāji saṅghavavatthānaṃ saṅghanānākaraṇa’nti, ādātabbaṃ taṃ, upāli, attādānaṃ. Evaṃ pañcaṅgasamannāgataṃ kho, upāli, attādānaṃ ādinnaṃ, pacchāpi avippaṭisārakaraṃ bhavissatī’ti."
    ],
    "innerText": "‘‘Sace panupāli, bhikkhu paccavekkhamāno evaṃ jānāti – ‘imaṃ kho ahaṃ attādānaṃ ādiyamāno labhissāmi sandiṭṭhe sambhatte bhikkhū dhammato vinayato pakkhe’ti, tenupāli, bhikkhunā uttari paccavekkhitabbaṃ – ‘imaṃ kho me attādānaṃ ādiyato bhavissati saṅghassa tatonidānaṃ bhaṇḍanaṃ kalaho viggaho vivādo saṅghabhedo saṅgharāji saṅghavavatthānaṃ saṅghanānākaraṇaṃ udāhu no’ti? Sace upāli, bhikkhu paccavekkhamāno evaṃ jānāti – ‘imaṃ kho me attādānaṃ ādiyato bhavissati saṅghassa tatonidānaṃ bhaṇḍanaṃ kalaho viggaho vivādo saṅghabhedo saṅgharāji saṅghavavatthānaṃ saṅghanānākaraṇa’nti, na taṃ, upāli, attādānaṃ ādātabbaṃ. Sace panupāli, bhikkhu paccavekkhamāno evaṃ jānāti – ‘imaṃ kho me attādānaṃ ādiyato na bhavissati saṅghassa tatonidānaṃ bhaṇḍanaṃ kalaho viggaho vivādo saṅghabhedo saṅgharāji saṅghavavatthānaṃ saṅghanānākaraṇa’nti, ādātabbaṃ taṃ, upāli, attādānaṃ. Evaṃ pañcaṅgasamannāgataṃ kho, upāli, attādānaṃ ādinnaṃ, pacchāpi avippaṭisārakaraṃ bhavissatī’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Codakenapaccavekkhitabbadhammā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "399"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pari. 436 (a. ni. 10.44 thokaṃ visadisaṃ)]"
      },
      " ‘‘Codakena, bhante, bhikkhunā paraṃ codetukāmena kati dhamme ajjhattaṃ paccavekkhitvā paro codetabbo’’ti? ‘‘Codakena, upāli, bhikkhunā paraṃ codetukāmena pañca dhamme ajjhattaṃ paccavekkhitvā paro codetabbo."
    ],
    "innerText": "399.[pari. 436 (a. ni. 10.44 thokaṃ visadisaṃ)] ‘‘Codakena, bhante, bhikkhunā paraṃ codetukāmena kati dhamme ajjhattaṃ paccavekkhitvā paro codetabbo’’ti? ‘‘Codakena, upāli, bhikkhunā paraṃ codetukāmena pañca dhamme ajjhattaṃ paccavekkhitvā paro codetabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Codakena, upāli, bhikkhunā paraṃ codetukāmena evaṃ paccavekkhitabbaṃ – ‘parisuddhakāyasamācāro nu khomhi, parisuddhenamhi kāyasamācārena samannāgato – acchiddena appaṭimaṃsena? Saṃvijjati nu kho me eso dhammo udāhu no’ti? No ce, upāli, bhikkhu parisuddhakāyasamācāro hoti, parisuddhena kāyasamācārena samannāgato – acchiddena appaṭimaṃsena, tassa bhavanti vattāro – ‘iṅgha tāva āyasmā kāyikaṃ sikkhassū’ti. Itissa bhavanti vattāro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, upāli, codakena bhikkhunā paraṃ codetukāmena evaṃ paccavekkhitabbaṃ – ‘parisuddhavacīsamācāro nu khomhi, parisuddhenamhi vacīsamācārena samannāgato – acchiddena appaṭimaṃsena? Saṃvijjati nu ",
      " kho me eso dhammo udāhu no’ti? No ce, upāli, bhikkhu parisuddhavacīsamācāro hoti, parisuddhena vacīsamācārena samannāgato – acchiddena appaṭimaṃsena, tassa bhavanti vattāro – ‘iṅgha tāva āyasmā vācasikaṃ sikkhassū’ti. Itissa bhavanti vattāro."
    ],
    "innerText": "‘‘Puna caparaṃ, upāli, codakena bhikkhunā paraṃ codetukāmena evaṃ paccavekkhitabbaṃ – ‘parisuddhavacīsamācāro nu khomhi, parisuddhenamhi vacīsamācārena samannāgato – acchiddena appaṭimaṃsena? Saṃvijjati nu kho me eso dhammo udāhu no’ti? No ce, upāli, bhikkhu parisuddhavacīsamācāro hoti, parisuddhena vacīsamācārena samannāgato – acchiddena appaṭimaṃsena, tassa bhavanti vattāro – ‘iṅgha tāva āyasmā vācasikaṃ sikkhassū’ti. Itissa bhavanti vattāro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, upāli, codakena bhikkhunā paraṃ codetukāmena evaṃ paccavekkhitabbaṃ – ‘mettaṃ nu kho me cittaṃ paccupaṭṭhitaṃ sabrahmacārīsu anāghātaṃ ",
      ", saṃvijjati nu kho me eso dhammo udāhu no’ti? No ce, upāli, bhikkhuno mettacittaṃ paccupaṭṭhitaṃ hoti sabrahmacārīsu anāghātaṃ ",
      ", tassa ",
      " bhavanti vattāro – ‘iṅgha tāva āyasmā sabrahmacārīsu mettacittaṃ upaṭṭhāpehī’ti. Itissa bhavanti vattāro."
    ],
    "innerText": "‘‘Puna caparaṃ, upāli, codakena bhikkhunā paraṃ codetukāmena evaṃ paccavekkhitabbaṃ – ‘mettaṃ nu kho me cittaṃ paccupaṭṭhitaṃ sabrahmacārīsu anāghātaṃ , saṃvijjati nu kho me eso dhammo udāhu no’ti? No ce, upāli, bhikkhuno mettacittaṃ paccupaṭṭhitaṃ hoti sabrahmacārīsu anāghātaṃ , tassa bhavanti vattāro – ‘iṅgha tāva āyasmā sabrahmacārīsu mettacittaṃ upaṭṭhāpehī’ti. Itissa bhavanti vattāro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, upāli, codakena bhikkhunā paraṃ codetukāmena evaṃ paccavekkhitabbaṃ – ‘bahussuto nu khomhi, sutadharo, sutasanniccayo? Ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā, sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpā me dhammā bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā? Saṃvijjati nu kho me eso dhammo udāhu no’ti? No ce, upāli, bhikkhu bahussuto hoti, sutadharo, sutasanniccayo; ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā, sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ ",
      " parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpassa dhammā na bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā, tassa bhavanti vattāro – ‘iṅgha tāva āyasmā āgamaṃ pariyāpuṇassū’ti. Itissa bhavanti vattāro."
    ],
    "innerText": "‘‘Puna caparaṃ, upāli, codakena bhikkhunā paraṃ codetukāmena evaṃ paccavekkhitabbaṃ – ‘bahussuto nu khomhi, sutadharo, sutasanniccayo? Ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā, sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpā me dhammā bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā? Saṃvijjati nu kho me eso dhammo udāhu no’ti? No ce, upāli, bhikkhu bahussuto hoti, sutadharo, sutasanniccayo; ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā, sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpassa dhammā na bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā, tassa bhavanti vattāro – ‘iṅgha tāva āyasmā āgamaṃ pariyāpuṇassū’ti. Itissa bhavanti vattāro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, upāli, codakena bhikkhunā paraṃ codetukāmena evaṃ paccavekkhitabbaṃ – ‘ubhayāni kho me pātimokkhāni vitthārena svāgatāni honti, suvibhattāni, suppavattīni, suvinicchitāni – suttaso, anubyañjanaso? Saṃviñjati nu kho me eso dhammo udāhu no’ti? No ce, upāli, bhikkhuno ubhayāni pātimokkhāni vitthārena svāgatāni honti, suvibhattāni, suppavattīni, suvinicchitāni – suttaso, anubyañjanaso, ‘idaṃ panāvuso, kattha vuttaṃ bhagavatā’ti, iti puṭṭho na sampāyati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[na sampādayati (ka.)]"
      },
      ", tassa bhavanti vattāro – ‘iṅgha tāva āyasmā, vinayaṃ pariyāpuṇassū’ti. Itissa bhavanti vattāro. Codakenupāli, bhikkhunā paraṃ codetukāmena ime pañca dhamme ajjhattaṃ paccavekkhitvā paro codetabbo’’ti."
    ],
    "innerText": "‘‘Puna caparaṃ, upāli, codakena bhikkhunā paraṃ codetukāmena evaṃ paccavekkhitabbaṃ – ‘ubhayāni kho me pātimokkhāni vitthārena svāgatāni honti, suvibhattāni, suppavattīni, suvinicchitāni – suttaso, anubyañjanaso? Saṃviñjati nu kho me eso dhammo udāhu no’ti? No ce, upāli, bhikkhuno ubhayāni pātimokkhāni vitthārena svāgatāni honti, suvibhattāni, suppavattīni, suvinicchitāni – suttaso, anubyañjanaso, ‘idaṃ panāvuso, kattha vuttaṃ bhagavatā’ti, iti puṭṭho na sampāyati [na sampādayati (ka.)], tassa bhavanti vattāro – ‘iṅgha tāva āyasmā, vinayaṃ pariyāpuṇassū’ti. Itissa bhavanti vattāro. Codakenupāli, bhikkhunā paraṃ codetukāmena ime pañca dhamme ajjhattaṃ paccavekkhitvā paro codetabbo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Codakenaupaṭṭhāpetabbadhammā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "400"
      },
      ". ‘‘Codakena, bhante, bhikkhunā paraṃ codetukāmena kati dhamme ajjhattaṃ upaṭṭhāpetvā paro codetabbo’’ti? ‘‘Codakenupāli, bhikkhunā paraṃ codetukāmena pañca dhamme ajjhattaṃ upaṭṭhāpetvā paro codetabbo – kālena vakkhāmi, no akālena; bhūtena vakkhāmi, no ",
      " abhūtena; saṇhena ",
      " vakkhāmi, no pharusena; atthasaṃhitena vakkhāmi, no anatthasaṃhitena; mettacitto ",
      " vakkhāmi, no dosantaroti. Codakenupāli, bhikkhunā paraṃ codetukāmena ime pañca dhamme ajjhattaṃ upaṭṭhāpetvā paro codetabbo’’ti."
    ],
    "innerText": "400. ‘‘Codakena, bhante, bhikkhunā paraṃ codetukāmena kati dhamme ajjhattaṃ upaṭṭhāpetvā paro codetabbo’’ti? ‘‘Codakenupāli, bhikkhunā paraṃ codetukāmena pañca dhamme ajjhattaṃ upaṭṭhāpetvā paro codetabbo – kālena vakkhāmi, no akālena; bhūtena vakkhāmi, no abhūtena; saṇhena vakkhāmi, no pharusena; atthasaṃhitena vakkhāmi, no anatthasaṃhitena; mettacitto vakkhāmi, no dosantaroti. Codakenupāli, bhikkhunā paraṃ codetukāmena ime pañca dhamme ajjhattaṃ upaṭṭhāpetvā paro codetabbo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Codakacuditakapaṭisaṃyuttakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "401"
      },
      ". ‘‘Adhammacodakassa, bhante, bhikkhuno katīhākārehi vippaṭisāro ",
      " upadahātabbo’’ti? ‘‘Adhammacodakassa, upāli, bhikkhuno pañcahākārehi vippaṭisāro upadahātabbo – akālenāyasmā codesi, no kālena, alaṃ te vippaṭisārāya; abhūtenāyasmā codesi, no bhūtena, alaṃ te vippaṭisārāya; pharusenāyasmā codesi, no saṇhena, alaṃ te vippaṭisārāya; anatthasaṃhitenāyasmā codesi, no atthasaṃhitena, alaṃ te vippaṭisārāya; dosantaro āyasmā codesi, no mettacitto, alaṃ te vippaṭisārāyāti. Adhammacodakassa, upāli, bhikkhuno imehi pañcahākārehi vippaṭisāro upadahātabbo. Taṃ kissa hetu? Yathā na aññopi bhikkhu abhūtena codetabbaṃ maññeyyā’’ti."
    ],
    "innerText": "401. ‘‘Adhammacodakassa, bhante, bhikkhuno katīhākārehi vippaṭisāro upadahātabbo’’ti? ‘‘Adhammacodakassa, upāli, bhikkhuno pañcahākārehi vippaṭisāro upadahātabbo – akālenāyasmā codesi, no kālena, alaṃ te vippaṭisārāya; abhūtenāyasmā codesi, no bhūtena, alaṃ te vippaṭisārāya; pharusenāyasmā codesi, no saṇhena, alaṃ te vippaṭisārāya; anatthasaṃhitenāyasmā codesi, no atthasaṃhitena, alaṃ te vippaṭisārāya; dosantaro āyasmā codesi, no mettacitto, alaṃ te vippaṭisārāyāti. Adhammacodakassa, upāli, bhikkhuno imehi pañcahākārehi vippaṭisāro upadahātabbo. Taṃ kissa hetu? Yathā na aññopi bhikkhu abhūtena codetabbaṃ maññeyyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Adhammacuditassa pana, bhante, bhikkhuno katihākārehi avippaṭisāro upadahātabbo’’ti? ‘‘Adhammacuditassa, upāli, bhikkhuno pañcahākārehi avippaṭisāro upadahātabbo – akālenāyasmā cudito, no kālena, alaṃ te avippaṭisārāya; abhūtenāyasmā cudito, no bhūtena, alaṃ te avippaṭisārāya; pharusenāyasmā cudito ",
      ", no saṇhena, alaṃ te avippaṭisārāya; anatthasaṃhitenāyasmā cudito, no atthasaṃhitena, alaṃ te avippaṭisārāya; dosantarenāyasmā cudito, no mettacittena, alaṃ te avippaṭisārāyāti. Adhammacuditassa, upāli, bhikkhuno imehi pañcahākārehi avippaṭisāro upadahātabbo’’ti."
    ],
    "innerText": "‘‘Adhammacuditassa pana, bhante, bhikkhuno katihākārehi avippaṭisāro upadahātabbo’’ti? ‘‘Adhammacuditassa, upāli, bhikkhuno pañcahākārehi avippaṭisāro upadahātabbo – akālenāyasmā cudito, no kālena, alaṃ te avippaṭisārāya; abhūtenāyasmā cudito, no bhūtena, alaṃ te avippaṭisārāya; pharusenāyasmā cudito , no saṇhena, alaṃ te avippaṭisārāya; anatthasaṃhitenāyasmā cudito, no atthasaṃhitena, alaṃ te avippaṭisārāya; dosantarenāyasmā cudito, no mettacittena, alaṃ te avippaṭisārāyāti. Adhammacuditassa, upāli, bhikkhuno imehi pañcahākārehi avippaṭisāro upadahātabbo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Dhammacodakassa, bhante, bhikkhuno katihākārehi avippaṭisāro upadahātabbo’’ti? ‘‘Dhammacodakassa, upāli, bhikkhuno pañcahākārehi avippaṭisāro upadahātabbo – kālenāyasmā codesi, no akālena, alaṃ te avippaṭisārāya; bhūtenāyasmā codesi, no abhūtena ",
      ", alaṃ te avippaṭisārāya; saṇhenāyasmā codesi, no pharusena, alaṃ te avippaṭisārāya; atthasaṃhitenāyasmā codesi, no anatthasaṃhitena, alaṃ te avippaṭisārāya; mettacitto āyasmā codesi, no dosantaro, alaṃ te avippaṭisārāyāti. Dhammacodakassa, upāli, bhikkhuno imehi pañcahākārehi avippaṭisāro upadahātabbo. Taṃ kissa hetu? Yathā aññopi bhikkhu bhūtena codetabbaṃ maññeyyā’’ti."
    ],
    "innerText": "‘‘Dhammacodakassa, bhante, bhikkhuno katihākārehi avippaṭisāro upadahātabbo’’ti? ‘‘Dhammacodakassa, upāli, bhikkhuno pañcahākārehi avippaṭisāro upadahātabbo – kālenāyasmā codesi, no akālena, alaṃ te avippaṭisārāya; bhūtenāyasmā codesi, no abhūtena , alaṃ te avippaṭisārāya; saṇhenāyasmā codesi, no pharusena, alaṃ te avippaṭisārāya; atthasaṃhitenāyasmā codesi, no anatthasaṃhitena, alaṃ te avippaṭisārāya; mettacitto āyasmā codesi, no dosantaro, alaṃ te avippaṭisārāyāti. Dhammacodakassa, upāli, bhikkhuno imehi pañcahākārehi avippaṭisāro upadahātabbo. Taṃ kissa hetu? Yathā aññopi bhikkhu bhūtena codetabbaṃ maññeyyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Dhammacuditassa ",
      " pana, bhante, bhikkhuno katihākārehi vippaṭisāro upadahātabbo’’ti? ‘‘Dhammacuditassa, upāli, bhikkhuno pañcahākārehi vippaṭisāro upadahātabbo – kālenāyasmā cudito, no akālena, alaṃ te vippaṭisārāya; bhūtenāyasmā cudito, no abhūtena ",
      ", alaṃ te vippaṭisārāya; saṇhenāyasmā cudito, no pharusena, alaṃ te vippaṭisārāya; atthasaṃhitenāyasmā cudito, no anatthasaṃhitena, alaṃ te vippaṭisārāya; mettacittenāyasmā cudito, no dosantarena, alaṃ te vippaṭisārāyāti. Dhammacuditassa, upāli, bhikkhuno imehi pañcahākārehi vippaṭisāro upadahātabbo’’ti."
    ],
    "innerText": "‘‘Dhammacuditassa pana, bhante, bhikkhuno katihākārehi vippaṭisāro upadahātabbo’’ti? ‘‘Dhammacuditassa, upāli, bhikkhuno pañcahākārehi vippaṭisāro upadahātabbo – kālenāyasmā cudito, no akālena, alaṃ te vippaṭisārāya; bhūtenāyasmā cudito, no abhūtena , alaṃ te vippaṭisārāya; saṇhenāyasmā cudito, no pharusena, alaṃ te vippaṭisārāya; atthasaṃhitenāyasmā cudito, no anatthasaṃhitena, alaṃ te vippaṭisārāya; mettacittenāyasmā cudito, no dosantarena, alaṃ te vippaṭisārāyāti. Dhammacuditassa, upāli, bhikkhuno imehi pañcahākārehi vippaṭisāro upadahātabbo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pari. 438]"
      },
      " ‘‘Codakena, bhante, bhikkhunā paraṃ codetukāmena kati dhamme ajjhattaṃ manasi karitvā paro codetabbo’’ti? ‘‘Codakenupāli, bhikkhunā paraṃ codetukāmena pañca dhamme ajjhattaṃ manasi karitvā paro codetabbo – kāruññatā, hitesitā, anukampitā, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[anukampatā (ka.)]"
      },
      " āpattivuṭṭhānatā, vinayapurekkhāratāti. Codakenupāli, bhikkhunā paraṃ codetukāmena ime pañca dhamme ajjhattaṃ ",
      " manasi karitvā paro codetabbo’’ti."
    ],
    "innerText": "[pari. 438] ‘‘Codakena, bhante, bhikkhunā paraṃ codetukāmena kati dhamme ajjhattaṃ manasi karitvā paro codetabbo’’ti? ‘‘Codakenupāli, bhikkhunā paraṃ codetukāmena pañca dhamme ajjhattaṃ manasi karitvā paro codetabbo – kāruññatā, hitesitā, anukampitā, [anukampatā (ka.)] āpattivuṭṭhānatā, vinayapurekkhāratāti. Codakenupāli, bhikkhunā paraṃ codetukāmena ime pañca dhamme ajjhattaṃ manasi karitvā paro codetabbo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Cuditena pana, bhante, bhikkhunā katisu dhammesu patiṭṭhātabba’’nti? ‘‘Cuditenupāli, bhikkhunā dvīsu dhammesu patiṭṭhātabbaṃ – sacce ca akuppe cā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dutiyabhāṇavāro niṭṭhito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pātimokkhaṭṭhapanakkhandhako navamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Imamhi khandhake vatthū tiṃsa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Uposathe ",
      " yāvatikaṃ, pāpabhikkhu na nikkhami;"
    ],
    "innerText": "Uposathe yāvatikaṃ, pāpabhikkhu na nikkhami;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Moggallānena nicchuddho, accherā jinasāsane."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Ninnonupubbasikkhā ca, ṭhitadhammo nātikkamma;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kuṇapukkhipati saṅgho, savantiyo jahanti ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Savanti parinibbanti, ekarasa vimutti ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bahu dhammavinayopi, bhūtaṭṭhāriyapuggalā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Samuddaṃ ",
      " upamaṃ katvā, vācesi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ṭhāpesi (ka.)]"
      },
      " sāsane guṇaṃ;"
    ],
    "innerText": "Samuddaṃ upamaṃ katvā, vācesi [ṭhāpesi (ka.)] sāsane guṇaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Uposathe pātimokkhaṃ, na amhe koci jānāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Paṭikacceva ujjhanti, eko dve tīṇi cattāri;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pañca cha satta aṭṭhāni, navā ca dasamāni ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sīla-ācāra-diṭṭhi ca, ājīvaṃ catubhāgike;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pārājikañca saṅghādi, pācitti pāṭidesani."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Dukkaṭaṃ pañcabhāgesu, sīlācāravipatti ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Akatāya katāya ca, chabhāgesu yathāvidhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Pārājikañca saṅghādi, thullaṃ pācittiyena ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Pāṭidesaniyañceva ",
      ", dukkaṭañca dubbhāsitaṃ."
    ],
    "innerText": "Pāṭidesaniyañceva , dukkaṭañca dubbhāsitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sīlācāravipatti ca, diṭṭhiājīvavipatti;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yā ca aṭṭhā katākate, tenetā sīlācāradiṭṭhiyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Akatāya katāyāpi, katākatāyameva ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Evaṃ navavidhā vuttā, yathābhūtena ñāyato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Pārājiko vippakatā, paccakkhāto tatheva ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Upeti paccādiyati, paccādānakathā ca yā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sīlācāravipatti ca, tathā diṭṭhivipattiyā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Diṭṭhasutaparisaṅkitaṃ, dasadhā taṃ vijānātha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Bhikkhu ",
      " vipassati bhikkhuṃ, añño cārocayāti taṃ;"
    ],
    "innerText": "Bhikkhu vipassati bhikkhuṃ, añño cārocayāti taṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "So yeva tassa akkhāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vipassañño cārocati; taṃ suddheva tassa akkhāti (ka.)]"
      },
      ", pātimokkhaṃ ṭhapeti so."
    ],
    "innerText": "So yeva tassa akkhāti [vipassañño cārocati; taṃ suddheva tassa akkhāti (ka.)], pātimokkhaṃ ṭhapeti so."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Vuṭṭhāti ",
      " antarāyena, rājacoraggudakā ca;"
    ],
    "innerText": "Vuṭṭhāti antarāyena, rājacoraggudakā ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Manussaamanussā ca, vāḷasarīsapā jīvibrahmaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Dasannamaññatarena, tasmiṃ aññataresu vā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Dhammikādhammikā ",
      " ceva, yathā maggena jānātha."
    ],
    "innerText": "Dhammikādhammikā ceva, yathā maggena jānātha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Kālabhūtatthasaṃhitaṃ ",
      ", labhissāmi bhavissati;"
    ],
    "innerText": "Kālabhūtatthasaṃhitaṃ , labhissāmi bhavissati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kāyavācasikā mettā, bāhusaccaṃ ubhayāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Kālabhūtena saṇhena, atthamettena codaye;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Vippaṭisāradhammena, tathā vācā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[tathevāpi (syā.)]"
      },
      " vinodaye."
    ],
    "innerText": "Vippaṭisāradhammena, tathā vācā [tathevāpi (syā.)] vinodaye."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Dhammacodacuditassa, vinodeti vippaṭisāro;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Karuṇā hitānukampi, vuṭṭhānapurekkhārato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Codakassa paṭipatti, sambuddhena pakāsitā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sacce ceva akuppe ca, cuditasseva dhammatāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pātimokkhaṭṭhapanakkhandhakaṃ niṭṭhitaṃ."
  }
]