[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "Paññattivāravaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "1"
      },
      ". Visuddhaparivārassa ",
      " sīlakkhandhādidhammakkhandhasarīrassa bhagavato vinayapariyattisāsane khandhakānaṃ anantaraṃ parivāroti yo vinayo saṅgahaṃ samāruḷho, tassa dāni anuttānatthavaṇṇanaṃ karissāmīti yojanā."
    ],
    "innerText": "1. Visuddhaparivārassa sīlakkhandhādidhammakkhandhasarīrassa bhagavato vinayapariyattisāsane khandhakānaṃ anantaraṃ parivāroti yo vinayo saṅgahaṃ samāruḷho, tassa dāni anuttānatthavaṇṇanaṃ karissāmīti yojanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samantacakkhunā"
      },
      "ti sabbaññutaññāṇena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ativisuddhena maṃsacakkhunā"
      },
      "ti rattindivaṃ samantā yojanappamāṇe atisukhumānipi rūpāni passanato ativiya parisuddhena pasādacakkhunā. ‘‘Atthi tattha paññattī’’tiādīsu atthi nu kho tattha paññattītiādinā attho gahetabboti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tattha paññatti…pe… kenābhatanti pucchā’’"
      },
      "ti."
    ],
    "innerText": "Samantacakkhunāti sabbaññutaññāṇena. Ativisuddhena maṃsacakkhunāti rattindivaṃ samantā yojanappamāṇe atisukhumānipi rūpāni passanato ativiya parisuddhena pasādacakkhunā. ‘‘Atthi tattha paññattī’’tiādīsu atthi nu kho tattha paññattītiādinā attho gahetabboti āha ‘‘tattha paññatti…pe… kenābhatanti pucchā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "2"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchāvissajjane"
      },
      "ti ",
      " pucchāya vissajjane. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vinītakathā"
      },
      "ti vinītavatthukathā, ayameva vā pāṭho."
    ],
    "innerText": "2.Pucchāvissajjaneti pucchāya vissajjane. Vinītakathāti vinītavatthukathā, ayameva vā pāṭho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dvaṅgikena ekena samuṭṭhānenā"
      },
      "ti aṅgadvayasamudāyabhūtena ekena. Aṅgadvayavimuttassa samuṭṭhānassa abhāvepi tesu ekenaṅgena vinā ayaṃ āpatti na hotīti dassanatthameva ‘‘ekena samuṭṭhānenā’’ti vuttaṃ. Idāni tesu dvīsu aṅgesu padhānaṅgaṃ dassetumāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ettha hi cittaṃ aṅgaṃ hotī’’"
      },
      "tiādi. Yasmā pana maggenamaggappaṭipattisaṅkhātāya kāyaviññattiyā sevanacitteneva sambhave sati ayaṃ taṃ aṅgadvayaṃ upādāya bhagavatā paññattā āpattisammuti hoti, nāsati. Tasmā taṃ cittaṃ kāyaviññattisaṅkhātassa kāyassa aṅgaṃ kāraṇaṃ hoti, na āpattiyā. Tassa pana taṃsamuṭṭhitakāyo eva aṅgaṃ abyavahitakāraṇaṃ, cittaṃ pana kāraṇakāraṇanti adhippāyo. Evaṃ uparipi sabbattha cittaṅgayuttasamuṭṭhānesu adhippāyo ",
      " veditabbo. ‘‘Ekena samuṭṭhānena samuṭṭhātī’’tiādiparivāravacaneneva āpattiyā akusalādiparamatthasabhāvatā pāḷiaṭṭhakathāsu pariyāyatova vuttā, sammutisabhāvā eva āpattīti sijjhati samuṭṭhānasamuṭṭhitānaṃ bhedasiddhitoti gahetabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Imamatthaṃ sandhāyā"
      },
      "ti āpannāya pārājikāpattiyā kehicipi samathehi anāpattibhāvāpādanassa asakkuṇeyyattasaṅkhātamatthaṃ sandhāya."
    ],
    "innerText": "Dvaṅgikena ekena samuṭṭhānenāti aṅgadvayasamudāyabhūtena ekena. Aṅgadvayavimuttassa samuṭṭhānassa abhāvepi tesu ekenaṅgena vinā ayaṃ āpatti na hotīti dassanatthameva ‘‘ekena samuṭṭhānenā’’ti vuttaṃ. Idāni tesu dvīsu aṅgesu padhānaṅgaṃ dassetumāha ‘‘ettha hi cittaṃ aṅgaṃ hotī’’tiādi. Yasmā pana maggenamaggappaṭipattisaṅkhātāya kāyaviññattiyā sevanacitteneva sambhave sati ayaṃ taṃ aṅgadvayaṃ upādāya bhagavatā paññattā āpattisammuti hoti, nāsati. Tasmā taṃ cittaṃ kāyaviññattisaṅkhātassa kāyassa aṅgaṃ kāraṇaṃ hoti, na āpattiyā. Tassa pana taṃsamuṭṭhitakāyo eva aṅgaṃ abyavahitakāraṇaṃ, cittaṃ pana kāraṇakāraṇanti adhippāyo. Evaṃ uparipi sabbattha cittaṅgayuttasamuṭṭhānesu adhippāyo veditabbo. ‘‘Ekena samuṭṭhānena samuṭṭhātī’’tiādiparivāravacaneneva āpattiyā akusalādiparamatthasabhāvatā pāḷiaṭṭhakathāsu pariyāyatova vuttā, sammutisabhāvā eva āpattīti sijjhati samuṭṭhānasamuṭṭhitānaṃ bhedasiddhitoti gahetabbaṃ. Imamatthaṃ sandhāyāti āpannāya pārājikāpattiyā kehicipi samathehi anāpattibhāvāpādanassa asakkuṇeyyattasaṅkhātamatthaṃ sandhāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "3"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Porāṇakehi mahātherehī"
      },
      "ti saṅgītittayato pacchā potthakasaṅgītikārakehi chaḷabhiññāpaasambhidādiguṇasamujjalehi mahātherehi. Catutthasaṅgītisadisā hi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "potthakārohasaṅgīti"
      },
      "."
    ],
    "innerText": "3.Porāṇakehi mahātherehīti saṅgītittayato pacchā potthakasaṅgītikārakehi chaḷabhiññāpaasambhidādiguṇasamujjalehi mahātherehi. Catutthasaṅgītisadisā hi potthakārohasaṅgīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "188"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahāvibhaṅge"
      },
      "ti bhikkhuvibhaṅge. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Soḷasa vārā dassitā"
      },
      "ti yehi vārehi ādibhūtehi upalakkhitattā ayaṃ sakalopi parivāro soḷasaparivāroti voharīyati, te sandhāya vadati."
    ],
    "innerText": "188.Mahāvibhaṅgeti bhikkhuvibhaṅge. Soḷasa vārā dassitāti yehi vārehi ādibhūtehi upalakkhitattā ayaṃ sakalopi parivāro soḷasaparivāroti voharīyati, te sandhāya vadati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paññattivāravaṇṇanā niṭṭhitā."
  }
]