[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "8. Sivarakkhandhako"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "202. Jivakavatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "326"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": " . tena"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "samayena buddho bhagav rajagahe viharati veḷuvane kalandakanivāpe. Tena kho pana samayena vesālī iddhā ceva hoti phitā "
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[phītā (bahūsu)]"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": " ca bahujanā ca ākiṇṇamanussā ca subhikkhā ca; satta ca pāsādasahassāni satta ca pāsādasatāni satta ca pāsāda; satta ca kūṭāgārasahassāni satta ca kūṭāgārasatāni satta ca kūṭāgārāni; satta ca ārāmasahassāni satta ca ārāmasatāni satta ca ārāmā; satta ca pokkharaṇīsahassāni satta ca pokkharaṇīsatāni satta ca pokkharaṇiyo; ambapālī ca gaṇikā abhirūpā hoti dassanīyā pāsādikā paramāya vaṇṇapokkharatāya samannāgatā, padakkhiṇā "
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[padakkhā (syā.)]"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "nacce ca gīte ca vādite ca, abhisaṭā atthikānaṃ atthikānaṃ manussānaṃ paññāsāya ca rattiṃ gacchati; tāya ca vesālī bhiyyosomattāya upasobhati. Atha kho rājagahako negamo vesāliṃ agamāsi kenacideva karaṇīyena. Addasā kho rājagahako negamo vesāliṃ iddhañceva phitañca bahujanañca ākiṇṇamanussañca subhikkhañca; satta ca pāsādasahassāni satta ca pāsādasatāni satta ca pāsāde; satta ca kūṭāgārasahassāni satta ca kūṭāgārasatāni satta ca kūṭāgārāni; satta ca ārāmasahassāni satta ca ārāmasatāni satta ca ārame; satta ca pokkharaṇīsahassāni satta ca pokkharaṇīsatāni satta ca pokkharaṇiyo"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": ", ambapāliñca gaṇikaṃ abhirūpaṃ dassanīyaṃ pāsādikaṃ paramāya vaṇṇapokkharatāya samannāgataṃ, padakkhiṇaṃ "
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[padakkhaṃ (syā.)]"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": " nacce ca gīte ca vādite ca, abhisaṭaṃ atthikānaṃ atthikānaṃ manussānaṃ paññasāya ca rattiṃ gacchantiṃ, tāya ca vesāliṃ bhiyyosomattāya upasobhantiṃ."
      }
    ],
    "innerText": "326 . tenasamayena buddho bhagav rajagahe viharati veḷuvane kalandakanivāpe. Tena kho pana samayena vesālī iddhā ceva hoti phitā [phītā (bahūsu)] ca bahujanā ca ākiṇṇamanussā ca subhikkhā ca; satta ca pāsādasahassāni satta ca pāsādasatāni satta ca pāsāda; satta ca kūṭāgārasahassāni satta ca kūṭāgārasatāni satta ca kūṭāgārāni; satta ca ārāmasahassāni satta ca ārāmasatāni satta ca ārāmā; satta ca pokkharaṇīsahassāni satta ca pokkharaṇīsatāni satta ca pokkharaṇiyo; ambapālī ca gaṇikā abhirūpā hoti dassanīyā pāsādikā paramāya vaṇṇapokkharatāya samannāgatā, padakkhiṇā [padakkhā (syā.)]nacce ca gīte ca vādite ca, abhisaṭā atthikānaṃ atthikānaṃ manussānaṃ paññāsāya ca rattiṃ gacchati; tāya ca vesālī bhiyyosomattāya upasobhati. Atha kho rājagahako negamo vesāliṃ agamāsi kenacideva karaṇīyena. Addasā kho rājagahako negamo vesāliṃ iddhañceva phitañca bahujanañca ākiṇṇamanussañca subhikkhañca; satta ca pāsādasahassāni satta ca pāsādasatāni satta ca pāsāde; satta ca kūṭāgārasahassāni satta ca kūṭāgārasatāni satta ca kūṭāgārāni; satta ca ārāmasahassāni satta ca ārāmasatāni satta ca ārame; satta ca pokkharaṇīsahassāni satta ca pokkharaṇīsatāni satta ca pokkharaṇiyo, ambapāliñca gaṇikaṃ abhirūpaṃ dassanīyaṃ pāsādikaṃ paramāya vaṇṇapokkharatāya samannāgataṃ, padakkhiṇaṃ [padakkhaṃ (syā.)] nacce ca gīte ca vādite ca, abhisaṭaṃ atthikānaṃ atthikānaṃ manussānaṃ paññasāya ca rattiṃ gacchantiṃ, tāya ca vesāliṃ bhiyyosomattāya upasobhantiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "327"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": " . Atha kho rājaghako negamo vesāliyaṃ taṃ karaṇīyaṃ tīretvā punadeva rājagahaṃ paccāgañchi. Yena rājā māgadho seniyo bimbisāro tenupasaṅkami, upasaṅkamitvā rājānaṃ māgadhaṃ"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "seniyaṃ bimbisāraṃ"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "etadavoca – ''vesālī, deva, iddhā ceva phitā ca bahujanā ca ākiṇṇamanussā ca subhikkhā ca; satta ca pāsādasahassāni…pe… tāya ca vesālī bhiyyosomattāya upasobhati. Sādhu, deva, mayampi gaṇikaṃ vuṭṭhāpessāmā''ti "
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vuṭṭhāpeyāma (ka.)]"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": " . ''Tena hi, bhaṇe, tādisiṃ kumāriṃ jānātha yaṃ tumhe gaṇikaṃ vuṭṭhāpeyyāthā''ti. Tena kho pana samayena reignahe salavatī nāma"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "kumārī abhirūpā hoti dassanīyā pāsādikā paramāya vaṇṇapokkharatāya samannāgatā. Atha kho rājagahako negamo sālavatiṃ kumāriṃ gaṇikaṃ"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "vuṭṭhāpesi. Atha kho sālavatī gaṇikā nacirasseva padakkhiṇā ahosi nacce ca gīte ca vādite ca, abhisaṭā atthikānaṃ atthikānaṃ manussānaṃ paṭisatena ca rattiṃ gacchati. Atha kho sālavatī gaṇikā nacirasseva gabbhinī ahosi. Atha kho sālavatiyā gaṇikāya etadahosi – ''itthī kho gabbhinī purisānaṃ amanāpā. Sace maṃ koci jānissati sālavatī gaṇikā gabbhinīti, sabbo me sakkāro bhañjissati "
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ parihāyissati (sī. syā.)]"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": ", Yaṃnūnāhaṃ gilānaṃ paṭivedeyya''nti. Atha kho sālavatī gaṇikā dovārikaṃ āṇāpesi – ''mā, bhaṇe dovārika, koci puriso pāvisi. Yo ca maṃ pucchati, 'gilānā'ti paṭivedhī''ti. ''Evaṃ, ayye''ti kho so dovāriko sālavatiyā gaṇikāya paccassosi. Atha kho sālavatī gaṇikā tassa gabbhassa paripākamanvāya puttaṃ vijāyi. Atha kho sālavatī gaṇikā dāsiṃ āṇāpesi – ''handa, je, imaṃ dārakaṃ kattarasuppe pakkhipitvā nīharitvā saṅkārakūṭe chaḍḍehī''ti. ''Evaṃ, ayye''ti kho sā dāsī sālavatiyā gaṇikāya paṭissutvā taṃ dārakaṃ kattarasuppe pakkhipitvā nīharitvā saṅkārakūṭe chaḍḍesi."
      }
    ],
    "innerText": "327 . Atha kho rājaghako negamo vesāliyaṃ taṃ karaṇīyaṃ tīretvā punadeva rājagahaṃ paccāgañchi. Yena rājā māgadho seniyo bimbisāro tenupasaṅkami, upasaṅkamitvā rājānaṃ māgadhaṃseniyaṃ bimbisāraṃetadavoca – ''vesālī, deva, iddhā ceva phitā ca bahujanā ca ākiṇṇamanussā ca subhikkhā ca; satta ca pāsādasahassāni…pe… tāya ca vesālī bhiyyosomattāya upasobhati. Sādhu, deva, mayampi gaṇikaṃ vuṭṭhāpessāmā''ti [vuṭṭhāpeyāma (ka.)] . ''Tena hi, bhaṇe, tādisiṃ kumāriṃ jānātha yaṃ tumhe gaṇikaṃ vuṭṭhāpeyyāthā''ti. Tena kho pana samayena reignahe salavatī nāmakumārī abhirūpā hoti dassanīyā pāsādikā paramāya vaṇṇapokkharatāya samannāgatā. Atha kho rājagahako negamo sālavatiṃ kumāriṃ gaṇikaṃvuṭṭhāpesi. Atha kho sālavatī gaṇikā nacirasseva padakkhiṇā ahosi nacce ca gīte ca vādite ca, abhisaṭā atthikānaṃ atthikānaṃ manussānaṃ paṭisatena ca rattiṃ gacchati. Atha kho sālavatī gaṇikā nacirasseva gabbhinī ahosi. Atha kho sālavatiyā gaṇikāya etadahosi – ''itthī kho gabbhinī purisānaṃ amanāpā. Sace maṃ koci jānissati sālavatī gaṇikā gabbhinīti, sabbo me sakkāro bhañjissati [ parihāyissati (sī. syā.)], Yaṃnūnāhaṃ gilānaṃ paṭivedeyya''nti. Atha kho sālavatī gaṇikā dovārikaṃ āṇāpesi – ''mā, bhaṇe dovārika, koci puriso pāvisi. Yo ca maṃ pucchati, 'gilānā'ti paṭivedhī''ti. ''Evaṃ, ayye''ti kho so dovāriko sālavatiyā gaṇikāya paccassosi. Atha kho sālavatī gaṇikā tassa gabbhassa paripākamanvāya puttaṃ vijāyi. Atha kho sālavatī gaṇikā dāsiṃ āṇāpesi – ''handa, je, imaṃ dārakaṃ kattarasuppe pakkhipitvā nīharitvā saṅkārakūṭe chaḍḍehī''ti. ''Evaṃ, ayye''ti kho sā dāsī sālavatiyā gaṇikāya paṭissutvā taṃ dārakaṃ kattarasuppe pakkhipitvā nīharitvā saṅkārakūṭe chaḍḍesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "328"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": " . Tena kho pana samayena abhayo nāma rājakumāro kālasseva rājupaṭṭhānaṃ gacchanto addasa taṃ dārakaṃ kākehi samparikiṇṇaṃ"
      },
      ", disvāna manusse pucchi – ‘‘kiṃ etaṃ, bhaṇe, kākehi samparikiṇṇa’’nti? ‘‘Dārako, devā’’ti. ‘‘Jīvati, bhaṇe’’ti? ‘‘Jīvati, devā’’ti. ‘‘Tena hi, bhaṇe, taṃ dārakaṃ amhākaṃ antepuraṃ netvā dhātīnaṃ detha posetu’’nti. ‘‘Evaṃ, devā’’ti kho te manussā abhayassa rājakumārassa paṭissutvā taṃ ",
      " dārakaṃ abhayassa rājakumārassa antepuraṃ netvā dhātīnaṃ adaṃsu – ‘‘posethā’’ti. Tassa jīvatīti ‘jīvako’ti nāmaṃ akaṃsu. Kumārena posāpitoti ‘komārabhacco’ti nāmaṃ akaṃsu. Atha kho jīvako komārabhacco nacirasseva viññutaṃ pāpuṇi. Atha kho jīvako komārabhacco yena abhayo rājakumāro tenupasaṅkami; upasaṅkamitvā abhayaṃ rājakumāraṃ etadavoca – ‘‘kā me, deva, mātā, ko pitā’’ti? ‘‘Ahampi kho te, bhaṇe jīvaka, mātaraṃ na jānāmi; api cāhaṃ te pitā; mayāsi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mayāpi (ka.)]"
      },
      " posāpito’’ti. Atha kho jīvakassa komārabhaccassa etadahosi – ‘‘imāni ",
      " kho rājakulāni na sukarāni asippena upajīvituṃ. Yaṃnūnāhaṃ sippaṃ sikkheyya’’nti."
    ],
    "innerText": "328 . Tena kho pana samayena abhayo nāma rājakumāro kālasseva rājupaṭṭhānaṃ gacchanto addasa taṃ dārakaṃ kākehi samparikiṇṇaṃ, disvāna manusse pucchi – ‘‘kiṃ etaṃ, bhaṇe, kākehi samparikiṇṇa’’nti? ‘‘Dārako, devā’’ti. ‘‘Jīvati, bhaṇe’’ti? ‘‘Jīvati, devā’’ti. ‘‘Tena hi, bhaṇe, taṃ dārakaṃ amhākaṃ antepuraṃ netvā dhātīnaṃ detha posetu’’nti. ‘‘Evaṃ, devā’’ti kho te manussā abhayassa rājakumārassa paṭissutvā taṃ dārakaṃ abhayassa rājakumārassa antepuraṃ netvā dhātīnaṃ adaṃsu – ‘‘posethā’’ti. Tassa jīvatīti ‘jīvako’ti nāmaṃ akaṃsu. Kumārena posāpitoti ‘komārabhacco’ti nāmaṃ akaṃsu. Atha kho jīvako komārabhacco nacirasseva viññutaṃ pāpuṇi. Atha kho jīvako komārabhacco yena abhayo rājakumāro tenupasaṅkami; upasaṅkamitvā abhayaṃ rājakumāraṃ etadavoca – ‘‘kā me, deva, mātā, ko pitā’’ti? ‘‘Ahampi kho te, bhaṇe jīvaka, mātaraṃ na jānāmi; api cāhaṃ te pitā; mayāsi [mayāpi (ka.)] posāpito’’ti. Atha kho jīvakassa komārabhaccassa etadahosi – ‘‘imāni kho rājakulāni na sukarāni asippena upajīvituṃ. Yaṃnūnāhaṃ sippaṃ sikkheyya’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "329"
      },
      ". Tena kho pana samayena takkasilāyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[takkasīlāyaṃ (ka.)]"
      },
      " disāpāmokkho vejjo paṭivasati. Atha kho jīvako komārabhacco abhayaṃ rājakumāraṃ anāpucchā yena takkasilā tena ",
      " pakkāmi. Anupubbena yena takkasilā, yena vejjo tenupasaṅkami; upasaṅkamitvā taṃ vejjaṃ etadavoca – ‘‘icchāmahaṃ, ācariya, sippaṃ sikkhitu’’nti. ‘‘Tena hi, bhaṇe ",
      " jīvaka, sikkhassū’’ti. Atha kho jīvako komārabhacco bahuñca gaṇhāti lahuñca gaṇhāti suṭṭhu ca upadhāreti, gahitañcassa na sammussati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[na pamussati (sī. syā.)]"
      },
      ". Atha kho jīvakassa komārabhaccassa sattannaṃ vassānaṃ accayena etadahosi – ‘‘ahaṃ, kho bahuñca gaṇhāmi lahuñca gaṇhāmi suṭṭhu ca upadhāremi, gahitañca me na sammussati, satta ca me vassāni adhīyantassa, nayimassa sippassa anto paññāyati. Kadā imassa sippassa anto paññāyissatī’’ti. Atha kho jīvako komārabhacco yena so vejjo tenupasaṅkami, upasaṅkamitvā taṃ vejjaṃ etadavoca – ‘‘ahaṃ kho, ācariya, bahuñca gaṇhāmi lahuñca gaṇhāmi suṭṭhu ca upadhāremi, gahitañca me na sammussati, satta ca me vassāni adhīyantassa, nayimassa sippassa anto paññāyati. Kadā imassa sippassa anto paññāyissatī’’ti? ‘‘Tena hi, bhaṇe jīvaka, khaṇittiṃ ādāya takkasilāya samantā yojanaṃ āhiṇḍitvā yaṃ kiñci abhesajjaṃ passeyyāsi taṃ āharā’’ti. ‘‘Evaṃ, ācariyā’’ti kho jīvako komārabhacco tassa vejjassa paṭissutvā khaṇittiṃ ādāya takkasilāya ",
      " samantā yojanaṃ āhiṇḍanto na kiñci abhesajjaṃ addasa. Atha kho jīvako komārabhacco yena so vejjo tenupasaṅkami, upasaṅkamitvā taṃ vejjaṃ etadavoca – ‘‘āhiṇḍantomhi, ācariya, takkasilāya samantā yojanaṃ, na kiñci ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[āhiṇṭanto na kiñci (ka.)]"
      },
      " abhesajjaṃ addasa’’nti. ‘‘Susikkhitosi ",
      ", bhaṇe jīvaka. Alaṃ te ettakaṃ jīvikāyā’’ti jīvakassa komārabhaccassa parittaṃ pātheyyaṃ pādāsi. Atha kho jīvako komārabhacco taṃ parittaṃ pātheyyaṃ ādāya yena rājagahaṃ tena pakkāmi. Atha kho jīvakassa komārabhaccassa taṃ parittaṃ pātheyyaṃ antarāmagge sākete parikkhayaṃ agamāsi. Atha kho jīvakassa komārabhaccassa etadahosi – ‘‘ime kho maggā kantārā appodakā appabhakkhā, na sukarā apātheyyena gantuṃ. Yaṃnūnāhaṃ pātheyyaṃ pariyeseyya’’nti."
    ],
    "innerText": "329. Tena kho pana samayena takkasilāyaṃ [takkasīlāyaṃ (ka.)] disāpāmokkho vejjo paṭivasati. Atha kho jīvako komārabhacco abhayaṃ rājakumāraṃ anāpucchā yena takkasilā tena pakkāmi. Anupubbena yena takkasilā, yena vejjo tenupasaṅkami; upasaṅkamitvā taṃ vejjaṃ etadavoca – ‘‘icchāmahaṃ, ācariya, sippaṃ sikkhitu’’nti. ‘‘Tena hi, bhaṇe jīvaka, sikkhassū’’ti. Atha kho jīvako komārabhacco bahuñca gaṇhāti lahuñca gaṇhāti suṭṭhu ca upadhāreti, gahitañcassa na sammussati [na pamussati (sī. syā.)]. Atha kho jīvakassa komārabhaccassa sattannaṃ vassānaṃ accayena etadahosi – ‘‘ahaṃ, kho bahuñca gaṇhāmi lahuñca gaṇhāmi suṭṭhu ca upadhāremi, gahitañca me na sammussati, satta ca me vassāni adhīyantassa, nayimassa sippassa anto paññāyati. Kadā imassa sippassa anto paññāyissatī’’ti. Atha kho jīvako komārabhacco yena so vejjo tenupasaṅkami, upasaṅkamitvā taṃ vejjaṃ etadavoca – ‘‘ahaṃ kho, ācariya, bahuñca gaṇhāmi lahuñca gaṇhāmi suṭṭhu ca upadhāremi, gahitañca me na sammussati, satta ca me vassāni adhīyantassa, nayimassa sippassa anto paññāyati. Kadā imassa sippassa anto paññāyissatī’’ti? ‘‘Tena hi, bhaṇe jīvaka, khaṇittiṃ ādāya takkasilāya samantā yojanaṃ āhiṇḍitvā yaṃ kiñci abhesajjaṃ passeyyāsi taṃ āharā’’ti. ‘‘Evaṃ, ācariyā’’ti kho jīvako komārabhacco tassa vejjassa paṭissutvā khaṇittiṃ ādāya takkasilāya samantā yojanaṃ āhiṇḍanto na kiñci abhesajjaṃ addasa. Atha kho jīvako komārabhacco yena so vejjo tenupasaṅkami, upasaṅkamitvā taṃ vejjaṃ etadavoca – ‘‘āhiṇḍantomhi, ācariya, takkasilāya samantā yojanaṃ, na kiñci [āhiṇṭanto na kiñci (ka.)] abhesajjaṃ addasa’’nti. ‘‘Susikkhitosi , bhaṇe jīvaka. Alaṃ te ettakaṃ jīvikāyā’’ti jīvakassa komārabhaccassa parittaṃ pātheyyaṃ pādāsi. Atha kho jīvako komārabhacco taṃ parittaṃ pātheyyaṃ ādāya yena rājagahaṃ tena pakkāmi. Atha kho jīvakassa komārabhaccassa taṃ parittaṃ pātheyyaṃ antarāmagge sākete parikkhayaṃ agamāsi. Atha kho jīvakassa komārabhaccassa etadahosi – ‘‘ime kho maggā kantārā appodakā appabhakkhā, na sukarā apātheyyena gantuṃ. Yaṃnūnāhaṃ pātheyyaṃ pariyeseyya’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Jīvakavatthu niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "203. Seṭṭhibhariyāvatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "330"
      },
      ". Tena ",
      " kho pana samayena sākete seṭṭhibhariyāya sattavassiko sīsābādho hoti. Bahū mahantā mahantā disāpāmokkhā vejjā āgantvā nāsakkhiṃsu arogaṃ kātuṃ. Bahuṃ hiraññaṃ ādāya agamaṃsu. Atha kho jīvako komārabhacco sāketaṃ pavisitvā manusse pucchi – ‘‘ko, bhaṇe, gilāno, kaṃ tikicchāmī’’ti? ‘‘Etissā, ācariya, seṭṭhibhariyāya sattavassiko ",
      " sīsābādho; gaccha, ācariya, seṭṭhibhariyaṃ tikicchāhī’’ti. Atha kho jīvako komārabhacco yena seṭṭhissa gahapatissa nivesanaṃ tenupasaṅkami; upasaṅkamitvā dovārikaṃ āṇāpesi – ‘‘gaccha, bhaṇe dovārika, seṭṭhibhariyāya pāvada – ‘vejjo, ayye, āgato, so taṃ daṭṭhukāmo’’’ti. ‘‘Evaṃ, ācariyā’’ti kho so dovāriko jīvakassa komārabhaccassa paṭissutvā yena seṭṭhibhariyā tenupasaṅkami, upasaṅkamitvā seṭṭhibhariyaṃ etadavoca – ‘‘vejjo ",
      ", ayye, āgato; so taṃ daṭṭhukāmo’’ti. ‘‘Kīdiso, bhaṇe dovārika, vejjo’’ti? ‘‘Daharako, ayye’’ti. ‘‘Alaṃ, bhaṇe dovārika, kiṃ me daharako vejjo karissati? Bahū mahantā mahantā disāpāmokkhā vejjā āgantvā ",
      " nāsakkhiṃsu arogaṃ kātuṃ. Bahuṃ hiraññaṃ ādāya agamaṃsū’’ti. Atha kho so dovāriko yena jīvako komārabhacco tenupasaṅkami; upasaṅkamitvā jīvakaṃ komārabhaccaṃ etadavoca – ‘‘seṭṭhibhariyā, ācariya, evamāha – ‘alaṃ, bhaṇe dovārika, kiṃ me daharako vejjo karissati? Bahū mahantā mahantā disāpāmokkhā vejjā āgantvā nāsakkhiṃsu arogaṃ kātuṃ. Bahuṃ hiraññaṃ ādāya agamaṃsū’’’ti. ‘‘Gaccha, bhaṇe dovārika, seṭṭhibhariyāya pāvada – ‘vejjo, ayye, evamāha – mā kira, ayye, pure kiñci adāsi. Yadā arogā ahosi tadā yaṃ iccheyyāsi taṃ dajjeyyāsī’’’ti. ‘‘Evaṃ, ācariyā’’ti kho so dovāriko jīvakassa komārabhaccassa paṭissutvā yena seṭṭhibhariyā tenupasaṅkami; upasaṅkamitvā seṭṭhibhariyaṃ etadavoca – ‘‘vejjo, ayye, evamāha – ‘mā kira, ayye, pure kiñci adāsi. Yadā arogā ahosi tadā yaṃ iccheyyāsi taṃ dajjeyyāsī’’’ti. ‘‘Tena hi, bhaṇe dovārika, vejjo āgacchatū’’ti. ‘‘Evaṃ, ayye’’ti kho so dovāriko seṭṭhibhariyāya paṭissutvā yena jīvako komārabhacco tenupasaṅkami, upasaṅkamitvā jīvakaṃ komārabhaccaṃ etadavoca – ‘‘seṭṭhibhariyā taṃ, ācariya, pakkosatī’’ti ",
      "."
    ],
    "innerText": "330. Tena kho pana samayena sākete seṭṭhibhariyāya sattavassiko sīsābādho hoti. Bahū mahantā mahantā disāpāmokkhā vejjā āgantvā nāsakkhiṃsu arogaṃ kātuṃ. Bahuṃ hiraññaṃ ādāya agamaṃsu. Atha kho jīvako komārabhacco sāketaṃ pavisitvā manusse pucchi – ‘‘ko, bhaṇe, gilāno, kaṃ tikicchāmī’’ti? ‘‘Etissā, ācariya, seṭṭhibhariyāya sattavassiko sīsābādho; gaccha, ācariya, seṭṭhibhariyaṃ tikicchāhī’’ti. Atha kho jīvako komārabhacco yena seṭṭhissa gahapatissa nivesanaṃ tenupasaṅkami; upasaṅkamitvā dovārikaṃ āṇāpesi – ‘‘gaccha, bhaṇe dovārika, seṭṭhibhariyāya pāvada – ‘vejjo, ayye, āgato, so taṃ daṭṭhukāmo’’’ti. ‘‘Evaṃ, ācariyā’’ti kho so dovāriko jīvakassa komārabhaccassa paṭissutvā yena seṭṭhibhariyā tenupasaṅkami, upasaṅkamitvā seṭṭhibhariyaṃ etadavoca – ‘‘vejjo , ayye, āgato; so taṃ daṭṭhukāmo’’ti. ‘‘Kīdiso, bhaṇe dovārika, vejjo’’ti? ‘‘Daharako, ayye’’ti. ‘‘Alaṃ, bhaṇe dovārika, kiṃ me daharako vejjo karissati? Bahū mahantā mahantā disāpāmokkhā vejjā āgantvā nāsakkhiṃsu arogaṃ kātuṃ. Bahuṃ hiraññaṃ ādāya agamaṃsū’’ti. Atha kho so dovāriko yena jīvako komārabhacco tenupasaṅkami; upasaṅkamitvā jīvakaṃ komārabhaccaṃ etadavoca – ‘‘seṭṭhibhariyā, ācariya, evamāha – ‘alaṃ, bhaṇe dovārika, kiṃ me daharako vejjo karissati? Bahū mahantā mahantā disāpāmokkhā vejjā āgantvā nāsakkhiṃsu arogaṃ kātuṃ. Bahuṃ hiraññaṃ ādāya agamaṃsū’’’ti. ‘‘Gaccha, bhaṇe dovārika, seṭṭhibhariyāya pāvada – ‘vejjo, ayye, evamāha – mā kira, ayye, pure kiñci adāsi. Yadā arogā ahosi tadā yaṃ iccheyyāsi taṃ dajjeyyāsī’’’ti. ‘‘Evaṃ, ācariyā’’ti kho so dovāriko jīvakassa komārabhaccassa paṭissutvā yena seṭṭhibhariyā tenupasaṅkami; upasaṅkamitvā seṭṭhibhariyaṃ etadavoca – ‘‘vejjo, ayye, evamāha – ‘mā kira, ayye, pure kiñci adāsi. Yadā arogā ahosi tadā yaṃ iccheyyāsi taṃ dajjeyyāsī’’’ti. ‘‘Tena hi, bhaṇe dovārika, vejjo āgacchatū’’ti. ‘‘Evaṃ, ayye’’ti kho so dovāriko seṭṭhibhariyāya paṭissutvā yena jīvako komārabhacco tenupasaṅkami, upasaṅkamitvā jīvakaṃ komārabhaccaṃ etadavoca – ‘‘seṭṭhibhariyā taṃ, ācariya, pakkosatī’’ti ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho jīvako komārabhacco yena seṭṭhibhariyā tenupasaṅkami, upasaṅkamitvā seṭṭhibhariyāya vikāraṃ sallakkhetvā seṭṭhibhariyaṃ etadavoca – ‘‘pasatena, ayye, sappinā attho’’ti ",
      ". Atha kho seṭṭhibhariyā jīvakassa komārabhaccassa pasataṃ sappiṃ dāpesi. Atha kho jīvako komārabhacco taṃ pasataṃ sappiṃ nānābhesajjehi nippacitvā seṭṭhibhariyaṃ mañcake uttānaṃ nipātetvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[nipajjāpetvā (sī. syā.)]"
      },
      " natthuto adāsi. Atha kho taṃ sappiṃ natthuto dinnaṃ mukhato uggañchi. Atha kho seṭṭhibhariyā paṭiggahe niṭṭhubhitvā dāsiṃ āṇāpesi – ‘‘handa, je, imaṃ sappiṃ picunā gaṇhāhī’’ti. Atha kho jīvakassa komārabhaccassa etadahosi – ‘‘acchariyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[acchariyaṃ vata bho (syā.)]"
      },
      " yāva lūkhāyaṃ gharaṇī, yatra hi nāma imaṃ chaḍḍanīyadhammaṃ sappiṃ picunā gāhāpessati. Bahukāni ",
      " ca me mahagghāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mahagghāni mahagghāni (sī. syā.)]"
      },
      " bhesajjāni upagatāni. Kimpi māyaṃ kiñci ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kañci (syā.)]"
      },
      " deyyadhammaṃ dassatī’’ti. Atha kho seṭṭhibhariyā jīvakassa ",
      " komārabhaccassa vikāraṃ sallakkhetvā jīvakaṃ komārabhaccaṃ etadavoca – ‘‘kissa tvaṃ, ācariya, vimanosī’’ti? Idha me etadahosi – ‘‘acchariyaṃ yāva lūkhāyaṃ dharaṇī, yatra hi nāma imaṃ chaḍḍanīyadhammaṃ sappiṃ picunā gāhāpessati. Bahukāni ca me mahagghāni sajjāni upagatāni. Kimpi māyaṃ kiñci deyyadhammaṃ dassatī’’ti. ‘‘Mayaṃ ",
      " kho, ācariya, āgārikā nāma upajānāmetassa saṃyamassa. Varametaṃ sappi dāsānaṃ vā kammakarānaṃ vā pādabbhañjanaṃ vā padīpakaraṇe vā āsittaṃ. Mā kho tvaṃ, ācariya, vimano ahosi. Na te deyyadhammo hāyissatī’’ti. Atha kho jīvako komārabhacco seṭṭhibhariyāya sattavassikaṃ sīsābādhaṃ ekeneva natthukammena apakaḍḍhi. Atha kho seṭṭhibhariyā arogā samānā jīvakassa komārabhaccassa cattāri sahassāni pādāsi. Putto – mātā me arogā ṭhitāti cattāri sahassāni pādāsi. Suṇisā – sassu me arogā ṭhitāti cattāri sahassāni pādāsi. Seṭṭhi gahapati – bhariyā me arogā ṭhitāti cattāri sahassāni pādāsi dāsañca dāsiñca assarathañca."
    ],
    "innerText": "Atha kho jīvako komārabhacco yena seṭṭhibhariyā tenupasaṅkami, upasaṅkamitvā seṭṭhibhariyāya vikāraṃ sallakkhetvā seṭṭhibhariyaṃ etadavoca – ‘‘pasatena, ayye, sappinā attho’’ti . Atha kho seṭṭhibhariyā jīvakassa komārabhaccassa pasataṃ sappiṃ dāpesi. Atha kho jīvako komārabhacco taṃ pasataṃ sappiṃ nānābhesajjehi nippacitvā seṭṭhibhariyaṃ mañcake uttānaṃ nipātetvā [nipajjāpetvā (sī. syā.)] natthuto adāsi. Atha kho taṃ sappiṃ natthuto dinnaṃ mukhato uggañchi. Atha kho seṭṭhibhariyā paṭiggahe niṭṭhubhitvā dāsiṃ āṇāpesi – ‘‘handa, je, imaṃ sappiṃ picunā gaṇhāhī’’ti. Atha kho jīvakassa komārabhaccassa etadahosi – ‘‘acchariyaṃ [acchariyaṃ vata bho (syā.)] yāva lūkhāyaṃ gharaṇī, yatra hi nāma imaṃ chaḍḍanīyadhammaṃ sappiṃ picunā gāhāpessati. Bahukāni ca me mahagghāni [mahagghāni mahagghāni (sī. syā.)] bhesajjāni upagatāni. Kimpi māyaṃ kiñci [kañci (syā.)] deyyadhammaṃ dassatī’’ti. Atha kho seṭṭhibhariyā jīvakassa komārabhaccassa vikāraṃ sallakkhetvā jīvakaṃ komārabhaccaṃ etadavoca – ‘‘kissa tvaṃ, ācariya, vimanosī’’ti? Idha me etadahosi – ‘‘acchariyaṃ yāva lūkhāyaṃ dharaṇī, yatra hi nāma imaṃ chaḍḍanīyadhammaṃ sappiṃ picunā gāhāpessati. Bahukāni ca me mahagghāni sajjāni upagatāni. Kimpi māyaṃ kiñci deyyadhammaṃ dassatī’’ti. ‘‘Mayaṃ kho, ācariya, āgārikā nāma upajānāmetassa saṃyamassa. Varametaṃ sappi dāsānaṃ vā kammakarānaṃ vā pādabbhañjanaṃ vā padīpakaraṇe vā āsittaṃ. Mā kho tvaṃ, ācariya, vimano ahosi. Na te deyyadhammo hāyissatī’’ti. Atha kho jīvako komārabhacco seṭṭhibhariyāya sattavassikaṃ sīsābādhaṃ ekeneva natthukammena apakaḍḍhi. Atha kho seṭṭhibhariyā arogā samānā jīvakassa komārabhaccassa cattāri sahassāni pādāsi. Putto – mātā me arogā ṭhitāti cattāri sahassāni pādāsi. Suṇisā – sassu me arogā ṭhitāti cattāri sahassāni pādāsi. Seṭṭhi gahapati – bhariyā me arogā ṭhitāti cattāri sahassāni pādāsi dāsañca dāsiñca assarathañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha kho jīvako komārabhacco tāni soḷasasahassāni ādāya dāsañca dāsiñca assarathañca yena rājagahaṃ tena pakkāmi. Anupubbena yena rājagahaṃ yena abhayo rājakumāro tenupasaṅkami, upasaṅkamitvā abhayaṃ rājakumāraṃ etadavoca – ‘‘idaṃ me, deva, paṭhamakammaṃ soḷasasahassāni dāso ca dāsī ca assaratho ca. Paṭiggaṇhātu me devo posāvanika’’nti. ‘‘Alaṃ, bhaṇe jīvaka; tuyhameva hotu. Amhākaññeva antepure nivesanaṃ māpehī’’ti. ‘‘Evaṃ, devā’’ti kho jīvako komārabhacco abhayassa rājakumārassa paṭissutvā abhayassa rājakumārassa antepure nivesanaṃ māpesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Seṭṭhibhariyāvatthu niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "204. Bimbisārarājavatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "331"
      },
      ". Tena ",
      " kho pana samayena rañño māgadhassa seniyassa bimbisārassa bhagandalābādho hoti. Sāṭakā lohitena makkhiyanti. Deviyo disvā uppaṇḍenti – ‘‘utunī dāni devo, pupphaṃ devassa uppannaṃ, na ciraṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[nacirasseva (syā.)]"
      },
      " devo vijāyissatī’’ti. Tena rājā maṅku hoti ",
      ". Atha kho rājā māgadho seniyo bimbisāro abhayaṃ rājakumāraṃ etadavoca – ‘‘mayhaṃ kho, bhaṇe abhaya, tādiso ābādho, sāṭakā lohitena makkhiyanti, deviyo maṃ disvā uppaṇḍenti – ‘utunī dāni devo, pupphaṃ devassa uppannaṃ, na ciraṃ devo vijāyissatī’ti. Iṅgha, bhaṇe abhaya, tādisaṃ vejjaṃ jānāhi yo maṃ tikiccheyyā’’ti. ‘‘Ayaṃ, deva, amhākaṃ jīvako vejjo taruṇo bhadrako. So devaṃ tikicchissatī’’ti. ‘‘Tena hi, bhaṇe abhaya, jīvakaṃ ",
      " vejjaṃ āṇāpehi; so maṃ tikicchissatī’’ti. Atha kho abhayo rājakumāro jīvakaṃ komārabhaccaṃ āṇāpesi – ‘‘gaccha, bhaṇe jīvaka, rājānaṃ tikicchāhī’’ti. ‘‘Evaṃ, devā’’ti kho jīvako komārabhacco abhayassa rājakumārassa paṭissutvā nakhena bhesajjaṃ ādāya yena rājā māgadho seniyo bimbisāro tenupasaṅkami, upasaṅkamitvā rājānaṃ māgadhaṃ seniyaṃ bimbisāraṃ etadavoca – ‘‘ābādhaṃ te, deva, passāmā’’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[passāmīti (syā.)]"
      },
      ". Atha kho jīvako komārabhacco rañño māgadhassa seniyassa bimbisārassa bhagandalābādhaṃ ekeneva ālepena apakaḍḍhi. Atha kho rājā māgadho ",
      " seniyo bimbisāro arogo samāno pañca itthisatāni sabbālaṅkāraṃ bhūsāpetvā omuñcāpetvā puñjaṃ kārāpetvā jīvakaṃ komārabhaccaṃ etadavoca – ‘‘etaṃ, bhaṇe jīvaka, pañcannaṃ itthisatānaṃ sabbālaṅkāraṃ tuyhaṃ hotū’’ti. ‘‘Alaṃ, deva, adhikāraṃ me devo saratū’’ti. ‘‘Tena hi, bhaṇe jīvaka, maṃ upaṭṭhaha, itthāgārañca, buddhappamukhañca bhikkhusaṅgha’’nti. ‘‘Evaṃ, devā’’ti kho jīvako komārabhacco rañño māgadhassa seniyassa bimbisārassa paccassosi."
    ],
    "innerText": "331. Tena kho pana samayena rañño māgadhassa seniyassa bimbisārassa bhagandalābādho hoti. Sāṭakā lohitena makkhiyanti. Deviyo disvā uppaṇḍenti – ‘‘utunī dāni devo, pupphaṃ devassa uppannaṃ, na ciraṃ [nacirasseva (syā.)] devo vijāyissatī’’ti. Tena rājā maṅku hoti . Atha kho rājā māgadho seniyo bimbisāro abhayaṃ rājakumāraṃ etadavoca – ‘‘mayhaṃ kho, bhaṇe abhaya, tādiso ābādho, sāṭakā lohitena makkhiyanti, deviyo maṃ disvā uppaṇḍenti – ‘utunī dāni devo, pupphaṃ devassa uppannaṃ, na ciraṃ devo vijāyissatī’ti. Iṅgha, bhaṇe abhaya, tādisaṃ vejjaṃ jānāhi yo maṃ tikiccheyyā’’ti. ‘‘Ayaṃ, deva, amhākaṃ jīvako vejjo taruṇo bhadrako. So devaṃ tikicchissatī’’ti. ‘‘Tena hi, bhaṇe abhaya, jīvakaṃ vejjaṃ āṇāpehi; so maṃ tikicchissatī’’ti. Atha kho abhayo rājakumāro jīvakaṃ komārabhaccaṃ āṇāpesi – ‘‘gaccha, bhaṇe jīvaka, rājānaṃ tikicchāhī’’ti. ‘‘Evaṃ, devā’’ti kho jīvako komārabhacco abhayassa rājakumārassa paṭissutvā nakhena bhesajjaṃ ādāya yena rājā māgadho seniyo bimbisāro tenupasaṅkami, upasaṅkamitvā rājānaṃ māgadhaṃ seniyaṃ bimbisāraṃ etadavoca – ‘‘ābādhaṃ te, deva, passāmā’’ti [passāmīti (syā.)]. Atha kho jīvako komārabhacco rañño māgadhassa seniyassa bimbisārassa bhagandalābādhaṃ ekeneva ālepena apakaḍḍhi. Atha kho rājā māgadho seniyo bimbisāro arogo samāno pañca itthisatāni sabbālaṅkāraṃ bhūsāpetvā omuñcāpetvā puñjaṃ kārāpetvā jīvakaṃ komārabhaccaṃ etadavoca – ‘‘etaṃ, bhaṇe jīvaka, pañcannaṃ itthisatānaṃ sabbālaṅkāraṃ tuyhaṃ hotū’’ti. ‘‘Alaṃ, deva, adhikāraṃ me devo saratū’’ti. ‘‘Tena hi, bhaṇe jīvaka, maṃ upaṭṭhaha, itthāgārañca, buddhappamukhañca bhikkhusaṅgha’’nti. ‘‘Evaṃ, devā’’ti kho jīvako komārabhacco rañño māgadhassa seniyassa bimbisārassa paccassosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Bimbisārarājavatthu niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "205. Rājagahaseṭṭhivatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "332"
      },
      ". Tena kho pana samayena rājagahakassa seṭṭhissa sattavassiko sīsābādho hoti. Bahū mahantā mahantā disāpāmokkhā vejjā āgantvā nāsakkhiṃsu arogaṃ kātuṃ. Bahuṃ hiraññaṃ ādāya agamaṃsu. Api ca, vejjehi paccakkhāto hoti. Ekacce vejjā evamāhaṃsu – ‘‘pañcamaṃ divasaṃ seṭṭhi gahapati kālaṃ karissatī’’ti. Ekacce vejjā evamāhaṃsu ",
      " – ‘‘sattamaṃ divasaṃ seṭṭhi gahapati kālaṃ karissatī’’ti. Atha ",
      " kho rājagahakassa negamassa etadahosi – ‘‘ayaṃ kho seṭṭhi gahapati bahūpakāro rañño ceva negamassa ca. Api ca, vejjehi paccakkhāto. Ekacce vejjā evamāhaṃsu – ‘pañcamaṃ divasaṃ seṭṭhi gahapati kālaṃ karissatī’ti. Ekacce vejjā evamāhaṃsu – ‘sattamaṃ divasaṃ seṭṭhi gahapati kālaṃ karissatī’ti. Ayañca rañño jīvako vejjo taruṇo bhadrako. Yaṃnūna mayaṃ rājānaṃ jīvakaṃ vejjaṃ yāceyyāma seṭṭhiṃ gahapatiṃ ",
      " tikicchitu’’nti. Atha kho rājagahako negamo yena rājā māgadho seniyo bimbisāro tenupasaṅkami; upasaṅkamitvā rājānaṃ māgadhaṃ seniyaṃ bimbisāraṃ etadavoca – ‘‘ayaṃ, deva, seṭṭhi gahapati bahūpakāro devassa ceva negamassa ca; api ca, vejjehi paccakkhāto. Ekacce vejjā evamāhaṃsu – pañcamaṃ divasaṃ seṭṭhi gahapati kālaṃ karissatīti. Ekacce vejjā evamāhaṃsu – sattamaṃ divasaṃ seṭṭhi gahapati kālaṃ karissatīti. Sādhu devo jīvakaṃ vejjaṃ āṇāpetu seṭṭhiṃ gahapatiṃ tikicchitu’’nti ",
      "."
    ],
    "innerText": "332. Tena kho pana samayena rājagahakassa seṭṭhissa sattavassiko sīsābādho hoti. Bahū mahantā mahantā disāpāmokkhā vejjā āgantvā nāsakkhiṃsu arogaṃ kātuṃ. Bahuṃ hiraññaṃ ādāya agamaṃsu. Api ca, vejjehi paccakkhāto hoti. Ekacce vejjā evamāhaṃsu – ‘‘pañcamaṃ divasaṃ seṭṭhi gahapati kālaṃ karissatī’’ti. Ekacce vejjā evamāhaṃsu – ‘‘sattamaṃ divasaṃ seṭṭhi gahapati kālaṃ karissatī’’ti. Atha kho rājagahakassa negamassa etadahosi – ‘‘ayaṃ kho seṭṭhi gahapati bahūpakāro rañño ceva negamassa ca. Api ca, vejjehi paccakkhāto. Ekacce vejjā evamāhaṃsu – ‘pañcamaṃ divasaṃ seṭṭhi gahapati kālaṃ karissatī’ti. Ekacce vejjā evamāhaṃsu – ‘sattamaṃ divasaṃ seṭṭhi gahapati kālaṃ karissatī’ti. Ayañca rañño jīvako vejjo taruṇo bhadrako. Yaṃnūna mayaṃ rājānaṃ jīvakaṃ vejjaṃ yāceyyāma seṭṭhiṃ gahapatiṃ tikicchitu’’nti. Atha kho rājagahako negamo yena rājā māgadho seniyo bimbisāro tenupasaṅkami; upasaṅkamitvā rājānaṃ māgadhaṃ seniyaṃ bimbisāraṃ etadavoca – ‘‘ayaṃ, deva, seṭṭhi gahapati bahūpakāro devassa ceva negamassa ca; api ca, vejjehi paccakkhāto. Ekacce vejjā evamāhaṃsu – pañcamaṃ divasaṃ seṭṭhi gahapati kālaṃ karissatīti. Ekacce vejjā evamāhaṃsu – sattamaṃ divasaṃ seṭṭhi gahapati kālaṃ karissatīti. Sādhu devo jīvakaṃ vejjaṃ āṇāpetu seṭṭhiṃ gahapatiṃ tikicchitu’’nti ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho rājā māgadho seniyo bimbisāro jīvakaṃ komārabhaccaṃ āṇāpesi – ‘‘gaccha, bhaṇe jīvaka, seṭṭhiṃ gahapatiṃ tikicchāhī’’ti. ‘‘Evaṃ, devā’’ti kho jīvako komārabhacco rañño māgadhassa seniyassa bimbisārassa paṭissutvā yena seṭṭhi gahapati tenupasaṅkami; upasaṅkamitvā seṭṭhissa gahapatissa vikāraṃ sallakkhetvā seṭṭhiṃ gahapatiṃ etadavoca – ‘‘sace tvaṃ, gahapati, arogo bhaveyyāsi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sacāhaṃ taṃ gahapati arogāpeyyaṃ (sī.), sacāhaṃ taṃ gahapati arogaṃ kareyyaṃ (syā.)]"
      },
      " kiṃ me assa deyyadhammo’’ti? ‘‘Sabbaṃ sāpateyyañca te, ācariya, hotu, ahañca te dāso’’ti. ‘‘Sakkhissasi pana tvaṃ, gahapati, ekena passena sattamāse nipajjitu’’nti? ‘‘Sakkomahaṃ, ācariya, ekena passena sattamāse nipajjitu’’nti. ‘‘Sakkhissasi pana tvaṃ, gahapati, dutiyena passena sattamāse nipajjitu’’nti? ‘‘Sakkomahaṃ, ācariya, dutiyena passena sattamāse nipajjitu’’nti ",
      ". ‘‘Sakkhissasi pana tvaṃ, gahapati, uttāno sattamāse nipajjitu’’nti? ‘‘Sakkomahaṃ, ācariya, uttāno sattamāse nipajjitu’’nti."
    ],
    "innerText": "Atha kho rājā māgadho seniyo bimbisāro jīvakaṃ komārabhaccaṃ āṇāpesi – ‘‘gaccha, bhaṇe jīvaka, seṭṭhiṃ gahapatiṃ tikicchāhī’’ti. ‘‘Evaṃ, devā’’ti kho jīvako komārabhacco rañño māgadhassa seniyassa bimbisārassa paṭissutvā yena seṭṭhi gahapati tenupasaṅkami; upasaṅkamitvā seṭṭhissa gahapatissa vikāraṃ sallakkhetvā seṭṭhiṃ gahapatiṃ etadavoca – ‘‘sace tvaṃ, gahapati, arogo bhaveyyāsi [sacāhaṃ taṃ gahapati arogāpeyyaṃ (sī.), sacāhaṃ taṃ gahapati arogaṃ kareyyaṃ (syā.)] kiṃ me assa deyyadhammo’’ti? ‘‘Sabbaṃ sāpateyyañca te, ācariya, hotu, ahañca te dāso’’ti. ‘‘Sakkhissasi pana tvaṃ, gahapati, ekena passena sattamāse nipajjitu’’nti? ‘‘Sakkomahaṃ, ācariya, ekena passena sattamāse nipajjitu’’nti. ‘‘Sakkhissasi pana tvaṃ, gahapati, dutiyena passena sattamāse nipajjitu’’nti? ‘‘Sakkomahaṃ, ācariya, dutiyena passena sattamāse nipajjitu’’nti . ‘‘Sakkhissasi pana tvaṃ, gahapati, uttāno sattamāse nipajjitu’’nti? ‘‘Sakkomahaṃ, ācariya, uttāno sattamāse nipajjitu’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho jīvako komārabhacco seṭṭhiṃ gahapatiṃ mañcake nipātetvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[nipajjāpetvā (sī. syā.)]"
      },
      " mañcake ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mañcakena (sī.)]"
      },
      " sambandhitvā sīsacchaviṃ uppāṭetvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[phāletvā (sī.)]"
      },
      " sibbiniṃ vināmetvā dve ",
      " pāṇake nīharitvā mahājanassa dassesi – ‘‘passathayye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[passesyātha (sī.), passatha (syā.), passathayyo (ka.)]"
      },
      ", ime dve pāṇake, ekaṃ khuddakaṃ ekaṃ mahallakaṃ. Ye te ācariyā evamāhaṃsu – pañcamaṃ divasaṃ seṭṭhi gahapati kālaṃ karissatīti – tehāyaṃ mahallako pāṇako diṭṭho. Pañcamaṃ divasaṃ seṭṭhissa gahapatissa matthaluṅgaṃ pariyādiyissati. Matthaluṅgassa pariyādānā seṭṭhi gahapati kālaṃ karissati. Sudiṭṭho tehi ācariyehi. Ye te ācariyā evamāhaṃsu – sattamaṃ divasaṃ ",
      " seṭṭhi gahapati kālaṃ karissatīti – tehāyaṃ khuddako pāṇako diṭṭho. Sattamaṃ divasaṃ seṭṭhissa gahapatissa matthaluṅgaṃ pariyādiyissati. Matthaluṅgassa pariyādānā seṭṭhi gahapati kālaṃ karissati. Sudiṭṭho tehi ācariyehī’’ti. Sibbiniṃ sampaṭipāṭetvā sīsacchaviṃ sibbitvā ālepaṃ adāsi. Atha kho seṭṭhi gahapati sattāhassa accayena jīvakaṃ komārabhaccaṃ etadavoca – ‘‘nāhaṃ, ācariya, sakkomi ekena passena sattamāse nipajjitu’’nti. ‘‘Nanu me tvaṃ, gahapati, paṭissuṇi – sakkomahaṃ, ācariya, ekena passena sattamāse ",
      " nipajjitu’’nti? ‘‘Saccāhaṃ, ācariya, paṭissuṇiṃ, apāhaṃ marissāmi, nāhaṃ sakkomi ekena passena sattamāse nipajjitu’’nti. ‘‘Tena hi tvaṃ, gahapati, dutiyena passena sattamāse nipajjāhī’’ti. Atha kho seṭṭhi gahapati sattāhassa accayena jīvakaṃ komārabhaccaṃ etadavoca ",
      " – ‘‘nāhaṃ, ācariya, sakkomi dutiyena passena sattamāse nipajjitu’’nti. ‘‘Nanu me tvaṃ, gahapati, paṭissuṇi – sakkomahaṃ, ācariya, dutiyena passena sattamāse nipajjitu’’nti? ‘‘Saccāhaṃ, ācariya, paṭissuṇiṃ, apāhaṃ marissāmi, nāhaṃ, ācariya, sakkomi dutiyena passena sattamāse nipajjitu’’nti. ‘‘Tena hi tvaṃ, gahapati, uttāno sattamāse nipajjāhī’’ti. Atha kho seṭṭhi gahapati sattāhassa accayena jīvakaṃ komārabhaccaṃ etadavoca – ‘‘nāhaṃ, ācariya, sakkomi uttāno sattamāse nipajjitu’’nti. ‘‘Nanu me tvaṃ, gahapati, paṭissuṇi – sakkomahaṃ, ācariya, uttāno sattamāse nipajjitu’’nti? ‘‘Saccāhaṃ, ācariya, paṭissuṇiṃ, apāhaṃ marissāmi, nāhaṃ sakkomi uttāno sattamāse nipajjitu’’nti. ‘‘Ahaṃ ce taṃ, gahapati, na vadeyyaṃ, ettakampi tvaṃ na nipajjeyyāsi, api ca paṭikacceva mayā ñāto – tīhi sattāhehi seṭṭhi gahapati arogo bhavissatīti. Uṭṭhehi ",
      ", gahapati, arogosi. Jānāsi kiṃ me deyyadhammo’’ti? ‘‘Sabbaṃ sāpateyyañca te, ācariya, hotu, ahañca te dāso’’ti. ‘‘Alaṃ, gahapati, mā me ",
      " tvaṃ sabbaṃ sāpateyyaṃ adāsi, mā ca me dāso. Rañño satasahassaṃ dehi, mayhaṃ satasahassa’’nti. Atha kho seṭṭhi gahapati arogo samāno rañño satasahassaṃ adāsi, jīvakassa komārabhaccassa satasahassaṃ."
    ],
    "innerText": "Atha kho jīvako komārabhacco seṭṭhiṃ gahapatiṃ mañcake nipātetvā [nipajjāpetvā (sī. syā.)] mañcake [mañcakena (sī.)] sambandhitvā sīsacchaviṃ uppāṭetvā [phāletvā (sī.)] sibbiniṃ vināmetvā dve pāṇake nīharitvā mahājanassa dassesi – ‘‘passathayye [passesyātha (sī.), passatha (syā.), passathayyo (ka.)], ime dve pāṇake, ekaṃ khuddakaṃ ekaṃ mahallakaṃ. Ye te ācariyā evamāhaṃsu – pañcamaṃ divasaṃ seṭṭhi gahapati kālaṃ karissatīti – tehāyaṃ mahallako pāṇako diṭṭho. Pañcamaṃ divasaṃ seṭṭhissa gahapatissa matthaluṅgaṃ pariyādiyissati. Matthaluṅgassa pariyādānā seṭṭhi gahapati kālaṃ karissati. Sudiṭṭho tehi ācariyehi. Ye te ācariyā evamāhaṃsu – sattamaṃ divasaṃ seṭṭhi gahapati kālaṃ karissatīti – tehāyaṃ khuddako pāṇako diṭṭho. Sattamaṃ divasaṃ seṭṭhissa gahapatissa matthaluṅgaṃ pariyādiyissati. Matthaluṅgassa pariyādānā seṭṭhi gahapati kālaṃ karissati. Sudiṭṭho tehi ācariyehī’’ti. Sibbiniṃ sampaṭipāṭetvā sīsacchaviṃ sibbitvā ālepaṃ adāsi. Atha kho seṭṭhi gahapati sattāhassa accayena jīvakaṃ komārabhaccaṃ etadavoca – ‘‘nāhaṃ, ācariya, sakkomi ekena passena sattamāse nipajjitu’’nti. ‘‘Nanu me tvaṃ, gahapati, paṭissuṇi – sakkomahaṃ, ācariya, ekena passena sattamāse nipajjitu’’nti? ‘‘Saccāhaṃ, ācariya, paṭissuṇiṃ, apāhaṃ marissāmi, nāhaṃ sakkomi ekena passena sattamāse nipajjitu’’nti. ‘‘Tena hi tvaṃ, gahapati, dutiyena passena sattamāse nipajjāhī’’ti. Atha kho seṭṭhi gahapati sattāhassa accayena jīvakaṃ komārabhaccaṃ etadavoca – ‘‘nāhaṃ, ācariya, sakkomi dutiyena passena sattamāse nipajjitu’’nti. ‘‘Nanu me tvaṃ, gahapati, paṭissuṇi – sakkomahaṃ, ācariya, dutiyena passena sattamāse nipajjitu’’nti? ‘‘Saccāhaṃ, ācariya, paṭissuṇiṃ, apāhaṃ marissāmi, nāhaṃ, ācariya, sakkomi dutiyena passena sattamāse nipajjitu’’nti. ‘‘Tena hi tvaṃ, gahapati, uttāno sattamāse nipajjāhī’’ti. Atha kho seṭṭhi gahapati sattāhassa accayena jīvakaṃ komārabhaccaṃ etadavoca – ‘‘nāhaṃ, ācariya, sakkomi uttāno sattamāse nipajjitu’’nti. ‘‘Nanu me tvaṃ, gahapati, paṭissuṇi – sakkomahaṃ, ācariya, uttāno sattamāse nipajjitu’’nti? ‘‘Saccāhaṃ, ācariya, paṭissuṇiṃ, apāhaṃ marissāmi, nāhaṃ sakkomi uttāno sattamāse nipajjitu’’nti. ‘‘Ahaṃ ce taṃ, gahapati, na vadeyyaṃ, ettakampi tvaṃ na nipajjeyyāsi, api ca paṭikacceva mayā ñāto – tīhi sattāhehi seṭṭhi gahapati arogo bhavissatīti. Uṭṭhehi , gahapati, arogosi. Jānāsi kiṃ me deyyadhammo’’ti? ‘‘Sabbaṃ sāpateyyañca te, ācariya, hotu, ahañca te dāso’’ti. ‘‘Alaṃ, gahapati, mā me tvaṃ sabbaṃ sāpateyyaṃ adāsi, mā ca me dāso. Rañño satasahassaṃ dehi, mayhaṃ satasahassa’’nti. Atha kho seṭṭhi gahapati arogo samāno rañño satasahassaṃ adāsi, jīvakassa komārabhaccassa satasahassaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Rājagahaseṭṭhivatthu niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "206. Seṭṭhiputtavatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "333"
      },
      ". Tena kho pana samayena bārāṇaseyyakassa seṭṭhiputtassa mokkhacikāya kīḷantassa antagaṇṭhābādho hoti, yena yāgupi pītā na sammā pariṇāmaṃ gacchati, bhattampi bhuttaṃ na sammā ",
      " pariṇāmaṃ gacchati, uccāropi passāvopi na paguṇo. So tena kiso hoti lūkho dubbaṇṇo uppaṇḍuppaṇḍukajāto dhamanisanthatagatto. Atha kho bārāṇaseyyakassa seṭṭhissa etadahosi – ‘‘mayhaṃ kho puttassa tādiso ābādho, yena yāgupi pītā na sammā pariṇāmaṃ gacchati, bhattampi bhuttaṃ na sammā pariṇāmaṃ gacchati, uccāropi passāvopi na paguṇo. So tena kiso lūkho dubbaṇṇo uppaṇḍuppaṇḍukajāto dhamanisanthatagatto. Yaṃnūnāhaṃ rājagahaṃ gantvā rājānaṃ jīvakaṃ vejjaṃ yāceyyaṃ puttaṃ me tikicchitu’’nti. Atha kho bārāṇaseyyako seṭṭhi rājagahaṃ gantvā yena rājā māgadho seniyo bimbisāro tenupasaṅkami, upasaṅkamitvā rājānaṃ māgadhaṃ seniyaṃ bimbisāraṃ etadavoca – ‘‘mayhaṃ kho, deva, puttassa tādiso ābādho, yena yāgupi pītā na sammā pariṇāmaṃ gacchati, bhattampi bhuttaṃ na sammā pariṇāmaṃ gacchati, uccāropi passāvopi na paguṇo. So tena kiso lūkho ",
      " dubbaṇṇo uppaṇḍuppaṇḍukajāto dhamanisanthatagatto. Sādhu devo jīvakaṃ vejjaṃ ",
      " āṇāpetu puttaṃ me tikicchitu’’nti."
    ],
    "innerText": "333. Tena kho pana samayena bārāṇaseyyakassa seṭṭhiputtassa mokkhacikāya kīḷantassa antagaṇṭhābādho hoti, yena yāgupi pītā na sammā pariṇāmaṃ gacchati, bhattampi bhuttaṃ na sammā pariṇāmaṃ gacchati, uccāropi passāvopi na paguṇo. So tena kiso hoti lūkho dubbaṇṇo uppaṇḍuppaṇḍukajāto dhamanisanthatagatto. Atha kho bārāṇaseyyakassa seṭṭhissa etadahosi – ‘‘mayhaṃ kho puttassa tādiso ābādho, yena yāgupi pītā na sammā pariṇāmaṃ gacchati, bhattampi bhuttaṃ na sammā pariṇāmaṃ gacchati, uccāropi passāvopi na paguṇo. So tena kiso lūkho dubbaṇṇo uppaṇḍuppaṇḍukajāto dhamanisanthatagatto. Yaṃnūnāhaṃ rājagahaṃ gantvā rājānaṃ jīvakaṃ vejjaṃ yāceyyaṃ puttaṃ me tikicchitu’’nti. Atha kho bārāṇaseyyako seṭṭhi rājagahaṃ gantvā yena rājā māgadho seniyo bimbisāro tenupasaṅkami, upasaṅkamitvā rājānaṃ māgadhaṃ seniyaṃ bimbisāraṃ etadavoca – ‘‘mayhaṃ kho, deva, puttassa tādiso ābādho, yena yāgupi pītā na sammā pariṇāmaṃ gacchati, bhattampi bhuttaṃ na sammā pariṇāmaṃ gacchati, uccāropi passāvopi na paguṇo. So tena kiso lūkho dubbaṇṇo uppaṇḍuppaṇḍukajāto dhamanisanthatagatto. Sādhu devo jīvakaṃ vejjaṃ āṇāpetu puttaṃ me tikicchitu’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho rājā māgadho seniyo bimbisāro jīvakaṃ komārabhaccaṃ āṇāpesi – ‘‘gaccha, bhaṇe jīvaka, bārāṇasiṃ gantvā bārāṇaseyyakaṃ seṭṭhiputtaṃ tikicchāhī’’ti. ‘‘Evaṃ, devā’’ti kho jīvako komārabhacco rañño māgadhassa seniyassa bimbisārassa paṭissutvā bārāṇasiṃ gantvā yena bārāṇaseyyako seṭṭhiputto tenupasaṅkami, upasaṅkamitvā bārāṇaseyyakassa seṭṭhiputtassa vikāraṃ sallakkhetvā janaṃ ussāretvā ",
      " tirokaraṇiyaṃ parikkhipitvā thambhe ubbandhitvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[upanibandhitvā (sī. syā.)]"
      },
      " bhariyaṃ purato ṭhapetvā udaracchaviṃ uppāṭetvā antagaṇṭhiṃ nīharitvā bhariyāya dassesi – ‘‘passa te sāmikassa ābādhaṃ, iminā yāgupi pītā na sammā pariṇāmaṃ gacchati, bhattampi bhuttaṃ na sammā pariṇāmaṃ gacchati, uccāropi passāvopi na paguṇo; imināyaṃ kiso lūkho dubbaṇṇo uppaṇḍuppaṇḍukajāto dhamanisanthatagatto’’ti. Antagaṇṭhiṃ viniveṭhetvā antāni paṭipavesetvā udaracchaviṃ sibbitvā ālepaṃ adāsi. Atha kho bārāṇaseyyako seṭṭhiputto nacirasseva arogo ahosi. Atha kho bārāṇaseyyako seṭṭhi ‘putto me arogo ṭhito’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[arogāpitoti (sī.)]"
      },
      " jīvakassa komārabhaccassa soḷasasahassāni pādāsi. Atha kho jīvako komārabhacco tāni soḷasasahassāni ādāya punadeva rājagahaṃ paccāgañchi ",
      "."
    ],
    "innerText": "Atha kho rājā māgadho seniyo bimbisāro jīvakaṃ komārabhaccaṃ āṇāpesi – ‘‘gaccha, bhaṇe jīvaka, bārāṇasiṃ gantvā bārāṇaseyyakaṃ seṭṭhiputtaṃ tikicchāhī’’ti. ‘‘Evaṃ, devā’’ti kho jīvako komārabhacco rañño māgadhassa seniyassa bimbisārassa paṭissutvā bārāṇasiṃ gantvā yena bārāṇaseyyako seṭṭhiputto tenupasaṅkami, upasaṅkamitvā bārāṇaseyyakassa seṭṭhiputtassa vikāraṃ sallakkhetvā janaṃ ussāretvā tirokaraṇiyaṃ parikkhipitvā thambhe ubbandhitvā [upanibandhitvā (sī. syā.)] bhariyaṃ purato ṭhapetvā udaracchaviṃ uppāṭetvā antagaṇṭhiṃ nīharitvā bhariyāya dassesi – ‘‘passa te sāmikassa ābādhaṃ, iminā yāgupi pītā na sammā pariṇāmaṃ gacchati, bhattampi bhuttaṃ na sammā pariṇāmaṃ gacchati, uccāropi passāvopi na paguṇo; imināyaṃ kiso lūkho dubbaṇṇo uppaṇḍuppaṇḍukajāto dhamanisanthatagatto’’ti. Antagaṇṭhiṃ viniveṭhetvā antāni paṭipavesetvā udaracchaviṃ sibbitvā ālepaṃ adāsi. Atha kho bārāṇaseyyako seṭṭhiputto nacirasseva arogo ahosi. Atha kho bārāṇaseyyako seṭṭhi ‘putto me arogo ṭhito’ti [arogāpitoti (sī.)] jīvakassa komārabhaccassa soḷasasahassāni pādāsi. Atha kho jīvako komārabhacco tāni soḷasasahassāni ādāya punadeva rājagahaṃ paccāgañchi ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Seṭṭhiputtavatthu niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "207. Pajjotarājavatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "334"
      },
      ". Tena ",
      " kho pana samayena rañño ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ujjeniyaṃ rañño (syā.)]"
      },
      " pajjotassa paṇḍurogābādho hoti. Bahū mahantā mahantā disāpāmokkhā vejjā āgantvā nāsakkhiṃsu arogaṃ kātuṃ. Bahuṃ hiraññaṃ ādāya agamaṃsu. Atha kho rājā pajjoto rañño māgadhassa seniyassa bimbisārassa santike dūtaṃ pāhesi – ‘‘mayhaṃ kho tādiso ābādho, sādhu devo jīvakaṃ vejjaṃ āṇāpetu, so maṃ tikicchissatī’’ti. Atha kho rājā māgadho seniyo bimbisāro jīvakaṃ komārabhaccaṃ āṇāpesi – ‘‘gaccha, bhaṇe jīvaka; ujjeniṃ gantvā rājānaṃ pajjotaṃ tikicchāhī’’ti. ‘‘Evaṃ, devā’’ti kho jīvako komārabhacco rañño māgadhassa seniyassa bimbisārassa paṭissutvā ujjeniṃ gantvā yena rājā pajjoto tenupasaṅkami; upasaṅkamitvā rañño pajjotassa vikāraṃ sallakkhetvā rājānaṃ pajjotaṃ etadavoca – ‘‘sappiṃ dehi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[idaṃ padadvayaṃ sī. syā. potthakesu natthi]"
      },
      ", sappiṃ deva, nippacissāmi. Taṃ devo pivissatī’’ti. ‘‘Alaṃ, bhaṇe jīvaka, yaṃ te sakkā vinā sappinā arogaṃ kātuṃ taṃ karohi. Jegucchaṃ me sappi, paṭikūla’’nti. Atha kho jīvakassa komārabhaccassa etadahosi ",
      " – ‘‘imassa kho rañño tādiso ābādho ",
      ", na sakkā vinā sappinā arogaṃ kātuṃ. Yaṃnūnāhaṃ sappiṃ nippaceyyaṃ ",
      " kasāvavaṇṇaṃ kasāvagandhaṃ kasāvarasa’’nti. Atha kho jīvako komārabhacco nānābhesajjehi sappiṃ nippaci kasāvavaṇṇaṃ kasāvagandhaṃ kasāvarasaṃ. Atha kho jīvakassa komārabhaccassa etadahosi – ‘‘imassa kho rañño sappi pītaṃ pariṇāmentaṃ uddekaṃ dassati. Caṇḍoyaṃ rājā ghātāpeyyāpi maṃ. Yaṃnūnāhaṃ paṭikacceva āpuccheyya’’nti. Atha kho jīvako komārabhacco yena rājā pajjoto tenupasaṅkami, upasaṅkamitvā rājānaṃ pajjotaṃ etadavoca – ‘‘mayaṃ kho, deva, vejjā nāma tādisena muhuttena mūlāni uddharāma bhesajjāni saṃharāma. Sādhu devo vāhanāgāresu ca dvāresu ca āṇāpetu – yena vāhanena jīvako icchati tena vāhanena gacchatu, yena dvārena icchati tena dvārena gacchatu, yaṃ kālaṃ icchati taṃ kālaṃ gacchatu, yaṃ kālaṃ icchati taṃ kālaṃ pavisatū’’ti. Atha kho rājā pajjoto vāhanāgāresu ca dvāresu ca āṇāpesi – ‘‘yena vāhanena jīvako icchati tena vāhanena gacchatu, yena dvārena icchati tena dvārena gacchatu, yaṃ kālaṃ icchati taṃ kālaṃ gacchatu, yaṃ kālaṃ icchati taṃ kālaṃ pavisatū’’ti."
    ],
    "innerText": "334. Tena kho pana samayena rañño [ujjeniyaṃ rañño (syā.)] pajjotassa paṇḍurogābādho hoti. Bahū mahantā mahantā disāpāmokkhā vejjā āgantvā nāsakkhiṃsu arogaṃ kātuṃ. Bahuṃ hiraññaṃ ādāya agamaṃsu. Atha kho rājā pajjoto rañño māgadhassa seniyassa bimbisārassa santike dūtaṃ pāhesi – ‘‘mayhaṃ kho tādiso ābādho, sādhu devo jīvakaṃ vejjaṃ āṇāpetu, so maṃ tikicchissatī’’ti. Atha kho rājā māgadho seniyo bimbisāro jīvakaṃ komārabhaccaṃ āṇāpesi – ‘‘gaccha, bhaṇe jīvaka; ujjeniṃ gantvā rājānaṃ pajjotaṃ tikicchāhī’’ti. ‘‘Evaṃ, devā’’ti kho jīvako komārabhacco rañño māgadhassa seniyassa bimbisārassa paṭissutvā ujjeniṃ gantvā yena rājā pajjoto tenupasaṅkami; upasaṅkamitvā rañño pajjotassa vikāraṃ sallakkhetvā rājānaṃ pajjotaṃ etadavoca – ‘‘sappiṃ dehi [idaṃ padadvayaṃ sī. syā. potthakesu natthi], sappiṃ deva, nippacissāmi. Taṃ devo pivissatī’’ti. ‘‘Alaṃ, bhaṇe jīvaka, yaṃ te sakkā vinā sappinā arogaṃ kātuṃ taṃ karohi. Jegucchaṃ me sappi, paṭikūla’’nti. Atha kho jīvakassa komārabhaccassa etadahosi – ‘‘imassa kho rañño tādiso ābādho , na sakkā vinā sappinā arogaṃ kātuṃ. Yaṃnūnāhaṃ sappiṃ nippaceyyaṃ kasāvavaṇṇaṃ kasāvagandhaṃ kasāvarasa’’nti. Atha kho jīvako komārabhacco nānābhesajjehi sappiṃ nippaci kasāvavaṇṇaṃ kasāvagandhaṃ kasāvarasaṃ. Atha kho jīvakassa komārabhaccassa etadahosi – ‘‘imassa kho rañño sappi pītaṃ pariṇāmentaṃ uddekaṃ dassati. Caṇḍoyaṃ rājā ghātāpeyyāpi maṃ. Yaṃnūnāhaṃ paṭikacceva āpuccheyya’’nti. Atha kho jīvako komārabhacco yena rājā pajjoto tenupasaṅkami, upasaṅkamitvā rājānaṃ pajjotaṃ etadavoca – ‘‘mayaṃ kho, deva, vejjā nāma tādisena muhuttena mūlāni uddharāma bhesajjāni saṃharāma. Sādhu devo vāhanāgāresu ca dvāresu ca āṇāpetu – yena vāhanena jīvako icchati tena vāhanena gacchatu, yena dvārena icchati tena dvārena gacchatu, yaṃ kālaṃ icchati taṃ kālaṃ gacchatu, yaṃ kālaṃ icchati taṃ kālaṃ pavisatū’’ti. Atha kho rājā pajjoto vāhanāgāresu ca dvāresu ca āṇāpesi – ‘‘yena vāhanena jīvako icchati tena vāhanena gacchatu, yena dvārena icchati tena dvārena gacchatu, yaṃ kālaṃ icchati taṃ kālaṃ gacchatu, yaṃ kālaṃ icchati taṃ kālaṃ pavisatū’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena kho pana samayena rañño pajjotassa bhaddavatikā nāma hatthinikā paññāsayojanikā hoti. Atha kho jīvako komārabhacco rañño pajjotassa sappiṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[taṃ sappiṃ (syā.)]"
      },
      " upanāmesi ",
      " – ‘‘kasāvaṃ devo pivatū’’ti. Atha kho jīvako komārabhacco rājānaṃ pajjotaṃ sappiṃ pāyetvā hatthisālaṃ gantvā bhaddavatikāya hatthinikāya nagaramhā nippati ",
      "."
    ],
    "innerText": "Tena kho pana samayena rañño pajjotassa bhaddavatikā nāma hatthinikā paññāsayojanikā hoti. Atha kho jīvako komārabhacco rañño pajjotassa sappiṃ [taṃ sappiṃ (syā.)] upanāmesi – ‘‘kasāvaṃ devo pivatū’’ti. Atha kho jīvako komārabhacco rājānaṃ pajjotaṃ sappiṃ pāyetvā hatthisālaṃ gantvā bhaddavatikāya hatthinikāya nagaramhā nippati ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho rañño pajjotassa taṃ sappi pītaṃ pariṇāmentaṃ uddekaṃ adāsi. Atha kho rājā pajjoto manusse etadavoca – ‘‘duṭṭhena, bhaṇe, jīvakena sappiṃ pāyitomhi. Tena hi, bhaṇe, jīvakaṃ vejjaṃ vicinathā’’ti. ‘‘Bhaddavatikāya, deva, hatthinikāya nagaramhā nippatito’’ti. Tena kho pana samayena rañño pajjotassa kāko nāma dāso saṭṭhiyojaniko hoti, amanussena paṭicca jāto. Atha kho rājā pajjoto kākaṃ dāsaṃ āṇāpesi – ‘‘gaccha, bhaṇe kāka, jīvakaṃ vejjaṃ ",
      " nivattehi – rājā taṃ, ācariya, nivattāpetīti. Ete kho, bhaṇe kāka, vejjā nāma bahumāyā. Mā cassa kiñci paṭiggahesī’’ti."
    ],
    "innerText": "Atha kho rañño pajjotassa taṃ sappi pītaṃ pariṇāmentaṃ uddekaṃ adāsi. Atha kho rājā pajjoto manusse etadavoca – ‘‘duṭṭhena, bhaṇe, jīvakena sappiṃ pāyitomhi. Tena hi, bhaṇe, jīvakaṃ vejjaṃ vicinathā’’ti. ‘‘Bhaddavatikāya, deva, hatthinikāya nagaramhā nippatito’’ti. Tena kho pana samayena rañño pajjotassa kāko nāma dāso saṭṭhiyojaniko hoti, amanussena paṭicca jāto. Atha kho rājā pajjoto kākaṃ dāsaṃ āṇāpesi – ‘‘gaccha, bhaṇe kāka, jīvakaṃ vejjaṃ nivattehi – rājā taṃ, ācariya, nivattāpetīti. Ete kho, bhaṇe kāka, vejjā nāma bahumāyā. Mā cassa kiñci paṭiggahesī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Atha kho kāko dāso jīvakaṃ komārabhaccaṃ antarāmagge kosambiyaṃ sambhāvesi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pātarāsaṃ karontaṃ. Atha kho kāko dāso jīvakaṃ komārabhaccaṃ etadavoca ",
      " – ‘‘rājā taṃ, ācariya, nivattāpetī’’ti. ‘‘Āgamehi, bhaṇe kāka, yāva bhuñjāma ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[bhuñjāmi (sī. syā.)]"
      },
      ". Handa, bhaṇe kāka, bhuñjassū’’ti. ‘‘Alaṃ, ācariya, raññāmhi āṇatto – ete kho, bhaṇe kāka, vejjā nāma bahumāyā, mā cassa kiñci paṭiggahesī’’ti. Tena kho pana samayena jīvako komārabhacco nakhena bhesajjaṃ olumpetvā āmalakañca khādati pānīyañca pivati. Atha kho jīvako komārabhacco kākaṃ dāsaṃ etadavoca – ‘‘handa, bhaṇe kāka, āmalakañca khāda pānīyañca pivassū’’ti. Atha kho kāko dāso – ayaṃ kho vejjo āmalakañca ",
      " khādati pānīyañca pivati, na arahati kiñci pāpakaṃ hotunti – upaḍḍhāmalakañca khādi pānīyañca apāyi. Tassa taṃ upaḍḍhāmalakaṃ khāditaṃ tattheva nicchāresi. Atha kho kāko dāso jīvakaṃ komārabhaccaṃ etadavoca – ‘‘atthi me, ācariya, jīvita’’nti? ‘‘Mā, bhaṇe kāka, bhāyi, tvaṃ ceva arogo bhavissasi rājā ca. Caṇḍo so rājā ghātāpeyyāpi maṃ, tenāhaṃ na nivattāmī’’ti bhaddavatikaṃ hatthinikaṃ kākassa niyyādetvā yena rājagahaṃ tena pakkāmi. Anupubbena yena rājā māgadho seniyo bimbisāro tenupasaṅkami; upasaṅkamitvā rañño māgadhassa seniyassa bimbisārassa etamatthaṃ ārocesi. ‘‘Suṭṭhu, bhaṇe jīvaka, akāsi yampi na nivatto, caṇḍo so rājā ghātāpeyyāpi ta’’nti. Atha kho rājā pajjoto arogo samāno jīvakassa komārabhaccassa santike dūtaṃ pāhesi – ‘‘āgacchatu jīvako, varaṃ dassāmī’’ti. ‘‘Alaṃ, ayyo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[deva (syā.)]"
      },
      ", adhikāraṃ me devo saratū’’ti."
    ],
    "innerText": "Pātarāsaṃ karontaṃ. Atha kho kāko dāso jīvakaṃ komārabhaccaṃ etadavoca – ‘‘rājā taṃ, ācariya, nivattāpetī’’ti. ‘‘Āgamehi, bhaṇe kāka, yāva bhuñjāma [bhuñjāmi (sī. syā.)]. Handa, bhaṇe kāka, bhuñjassū’’ti. ‘‘Alaṃ, ācariya, raññāmhi āṇatto – ete kho, bhaṇe kāka, vejjā nāma bahumāyā, mā cassa kiñci paṭiggahesī’’ti. Tena kho pana samayena jīvako komārabhacco nakhena bhesajjaṃ olumpetvā āmalakañca khādati pānīyañca pivati. Atha kho jīvako komārabhacco kākaṃ dāsaṃ etadavoca – ‘‘handa, bhaṇe kāka, āmalakañca khāda pānīyañca pivassū’’ti. Atha kho kāko dāso – ayaṃ kho vejjo āmalakañca khādati pānīyañca pivati, na arahati kiñci pāpakaṃ hotunti – upaḍḍhāmalakañca khādi pānīyañca apāyi. Tassa taṃ upaḍḍhāmalakaṃ khāditaṃ tattheva nicchāresi. Atha kho kāko dāso jīvakaṃ komārabhaccaṃ etadavoca – ‘‘atthi me, ācariya, jīvita’’nti? ‘‘Mā, bhaṇe kāka, bhāyi, tvaṃ ceva arogo bhavissasi rājā ca. Caṇḍo so rājā ghātāpeyyāpi maṃ, tenāhaṃ na nivattāmī’’ti bhaddavatikaṃ hatthinikaṃ kākassa niyyādetvā yena rājagahaṃ tena pakkāmi. Anupubbena yena rājā māgadho seniyo bimbisāro tenupasaṅkami; upasaṅkamitvā rañño māgadhassa seniyassa bimbisārassa etamatthaṃ ārocesi. ‘‘Suṭṭhu, bhaṇe jīvaka, akāsi yampi na nivatto, caṇḍo so rājā ghātāpeyyāpi ta’’nti. Atha kho rājā pajjoto arogo samāno jīvakassa komārabhaccassa santike dūtaṃ pāhesi – ‘‘āgacchatu jīvako, varaṃ dassāmī’’ti. ‘‘Alaṃ, ayyo [deva (syā.)], adhikāraṃ me devo saratū’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pajjotarājavatthu niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "208. Siveyyakadussayugakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "335"
      },
      ". Tena ",
      " kho pana samayena rañño pajjotassa siveyyakaṃ dussayugaṃ uppannaṃ hoti – bahūnaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[bahunnaṃ (sī. syā.)]"
      },
      " dussānaṃ bahūnaṃ dussayugānaṃ bahūnaṃ dussayugasatānaṃ bahūnaṃ dussayugasahassānaṃ bahūnaṃ dussayugasatasahassānaṃ ",
      " aggañca seṭṭhañca mokkhañca uttamañca pavarañca. Atha kho rājā pajjoto taṃ siveyyakaṃ dussayugaṃ jīvakassa komārabhaccassa pāhesi. Atha kho jīvakassa ",
      " komārabhaccassa etadahosi – ‘‘idaṃ kho me siveyyakaṃ dussayugaṃ raññā pajjotena pahitaṃ – bahūnaṃ dussānaṃ bahūnaṃ dussayugānaṃ bahūnaṃ dussayugasatānaṃ bahūnaṃ dussayugasahassānaṃ bahūnaṃ dussayugasatasahassānaṃ aggañca seṭṭhañca mokkhañca uttamañca pavarañca. Nayidaṃ añño koci paccārahati aññatra tena bhagavatā arahatā sammāsambuddhena, raññā vā māgadhena seniyena bimbisārenā’’ti."
    ],
    "innerText": "335. Tena kho pana samayena rañño pajjotassa siveyyakaṃ dussayugaṃ uppannaṃ hoti – bahūnaṃ [bahunnaṃ (sī. syā.)] dussānaṃ bahūnaṃ dussayugānaṃ bahūnaṃ dussayugasatānaṃ bahūnaṃ dussayugasahassānaṃ bahūnaṃ dussayugasatasahassānaṃ aggañca seṭṭhañca mokkhañca uttamañca pavarañca. Atha kho rājā pajjoto taṃ siveyyakaṃ dussayugaṃ jīvakassa komārabhaccassa pāhesi. Atha kho jīvakassa komārabhaccassa etadahosi – ‘‘idaṃ kho me siveyyakaṃ dussayugaṃ raññā pajjotena pahitaṃ – bahūnaṃ dussānaṃ bahūnaṃ dussayugānaṃ bahūnaṃ dussayugasatānaṃ bahūnaṃ dussayugasahassānaṃ bahūnaṃ dussayugasatasahassānaṃ aggañca seṭṭhañca mokkhañca uttamañca pavarañca. Nayidaṃ añño koci paccārahati aññatra tena bhagavatā arahatā sammāsambuddhena, raññā vā māgadhena seniyena bimbisārenā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Siveyyakadussayugakathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "209. Samattiṃsavirecanakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "336"
      },
      ". Tena kho pana samayena bhagavato kāyo dosābhisanno hoti. Atha kho bhagavā āyasmantaṃ ānandaṃ āmantesi – ‘‘dosābhisanno ",
      " kho, ānanda, tathāgatassa kāyo. Icchati tathāgato virecanaṃ pātu’’nti. Atha kho āyasmā ānando yena jīvako komārabhacco tenupasaṅkami; upasaṅkamitvā jīvakaṃ komārabhaccaṃ etadavoca – ‘‘dosābhisanno kho, āvuso jīvaka, tathāgatassa kāyo. Icchati tathāgato virecanaṃ pātu’’nti. ‘‘Tena hi, bhante ānanda, bhagavato kāyaṃ katipāhaṃ sinehethā’’ti. Atha kho āyasmā ānando bhagavato kāyaṃ katipāhaṃ sinehetvā yena jīvako komārabhacco tenupasaṅkami; upasaṅkamitvā jīvakaṃ komārabhaccaṃ etadavoca – ‘‘siniddho kho, āvuso jīvaka, tathāgatassa kāyo. Yassa dāni kālaṃ maññasī’’ti. Atha kho jīvakassa komārabhaccassa etadahosi – ‘‘na kho metaṃ patirūpaṃ yohaṃ bhagavato oḷārikaṃ virecanaṃ dadeyya’’nti. Tīṇi uppalahatthāni nānābhesajjehi paribhāvetvā yena ",
      " bhagavā tenupasaṅkami, upasaṅkamitvā ekaṃ uppalahatthaṃ bhagavato upanāmesi – ‘‘imaṃ, bhante, bhagavā paṭhamaṃ uppalahatthaṃ upasiṅghatu. Idaṃ bhagavantaṃ dasakkhattuṃ virecessatī’’ti. Dutiyaṃ uppalahatthaṃ bhagavato upanāmesi – ‘‘imaṃ, bhante, bhagavā dutiyaṃ uppalahatthaṃ upasiṅghatu. Idaṃ bhagavantaṃ dasakkhattuṃ virecessatī’’ti. Tatiyaṃ uppalahatthaṃ bhagavato upanāmesi – ‘‘imaṃ, bhante ",
      ", bhagavā tatiyaṃ uppalahatthaṃ upasiṅghatu. Idaṃ bhagavantaṃ dasakkhattuṃ virecessatī’’ti ",
      ". Evaṃ bhagavato samattiṃsāya virecanaṃ bhavissatīti. Atha kho jīvako komārabhacco bhagavato samattiṃsāya virecanaṃ datvā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi. Atha kho jīvakassa komārabhaccassa bahi dvārakoṭṭhakā nikkhantassa etadahosi – ‘‘mayā kho bhagavato samattiṃsāya virecanaṃ dinnaṃ. Dosābhisanno tathāgatassa kāyo ",
      ". Na bhagavantaṃ samattiṃsakkhattuṃ virecessati, ekūnattiṃsakkhattuṃ bhagavantaṃ virecessati. Api ca, bhagavā viritto nahāyissati. Nahātaṃ bhagavantaṃ sakiṃ virecessati. Evaṃ bhagavato samattiṃsāya virecanaṃ bhavissatī’’ti."
    ],
    "innerText": "336. Tena kho pana samayena bhagavato kāyo dosābhisanno hoti. Atha kho bhagavā āyasmantaṃ ānandaṃ āmantesi – ‘‘dosābhisanno kho, ānanda, tathāgatassa kāyo. Icchati tathāgato virecanaṃ pātu’’nti. Atha kho āyasmā ānando yena jīvako komārabhacco tenupasaṅkami; upasaṅkamitvā jīvakaṃ komārabhaccaṃ etadavoca – ‘‘dosābhisanno kho, āvuso jīvaka, tathāgatassa kāyo. Icchati tathāgato virecanaṃ pātu’’nti. ‘‘Tena hi, bhante ānanda, bhagavato kāyaṃ katipāhaṃ sinehethā’’ti. Atha kho āyasmā ānando bhagavato kāyaṃ katipāhaṃ sinehetvā yena jīvako komārabhacco tenupasaṅkami; upasaṅkamitvā jīvakaṃ komārabhaccaṃ etadavoca – ‘‘siniddho kho, āvuso jīvaka, tathāgatassa kāyo. Yassa dāni kālaṃ maññasī’’ti. Atha kho jīvakassa komārabhaccassa etadahosi – ‘‘na kho metaṃ patirūpaṃ yohaṃ bhagavato oḷārikaṃ virecanaṃ dadeyya’’nti. Tīṇi uppalahatthāni nānābhesajjehi paribhāvetvā yena bhagavā tenupasaṅkami, upasaṅkamitvā ekaṃ uppalahatthaṃ bhagavato upanāmesi – ‘‘imaṃ, bhante, bhagavā paṭhamaṃ uppalahatthaṃ upasiṅghatu. Idaṃ bhagavantaṃ dasakkhattuṃ virecessatī’’ti. Dutiyaṃ uppalahatthaṃ bhagavato upanāmesi – ‘‘imaṃ, bhante, bhagavā dutiyaṃ uppalahatthaṃ upasiṅghatu. Idaṃ bhagavantaṃ dasakkhattuṃ virecessatī’’ti. Tatiyaṃ uppalahatthaṃ bhagavato upanāmesi – ‘‘imaṃ, bhante , bhagavā tatiyaṃ uppalahatthaṃ upasiṅghatu. Idaṃ bhagavantaṃ dasakkhattuṃ virecessatī’’ti . Evaṃ bhagavato samattiṃsāya virecanaṃ bhavissatīti. Atha kho jīvako komārabhacco bhagavato samattiṃsāya virecanaṃ datvā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi. Atha kho jīvakassa komārabhaccassa bahi dvārakoṭṭhakā nikkhantassa etadahosi – ‘‘mayā kho bhagavato samattiṃsāya virecanaṃ dinnaṃ. Dosābhisanno tathāgatassa kāyo . Na bhagavantaṃ samattiṃsakkhattuṃ virecessati, ekūnattiṃsakkhattuṃ bhagavantaṃ virecessati. Api ca, bhagavā viritto nahāyissati. Nahātaṃ bhagavantaṃ sakiṃ virecessati. Evaṃ bhagavato samattiṃsāya virecanaṃ bhavissatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho bhagavā jīvakassa komārabhaccassa cetasā cetoparivitakkamaññāya āyasmantaṃ ānandaṃ āmantesi – ‘‘idhānanda, jīvakassa komārabhaccassa bahi dvārakoṭṭhakā nikkhantassa etadahosi – ‘mayā kho bhagavato samattiṃsāya virecanaṃ dinnaṃ. Dosābhisanno tathāgatassa kāyo. Na bhagavantaṃ samatiṃsakkhattuṃ virecessati, ekūnatiṃsakkhattuṃ bhagavantaṃ virecessati. Api ca, bhagavā viritto nahāyissati. Nahātaṃ bhagavantaṃ sakiṃ virecessati. Evaṃ bhagavato samattiṃsāya virecanaṃ bhavissatī’ti. Tena hānanda, uṇhodakaṃ paṭiyādehī’’ti. ‘‘Evaṃ, bhante’’ti kho āyasmā ānando bhagavato paṭissuṇitvā uṇhodakaṃ ",
      " paṭiyādesi."
    ],
    "innerText": "Atha kho bhagavā jīvakassa komārabhaccassa cetasā cetoparivitakkamaññāya āyasmantaṃ ānandaṃ āmantesi – ‘‘idhānanda, jīvakassa komārabhaccassa bahi dvārakoṭṭhakā nikkhantassa etadahosi – ‘mayā kho bhagavato samattiṃsāya virecanaṃ dinnaṃ. Dosābhisanno tathāgatassa kāyo. Na bhagavantaṃ samatiṃsakkhattuṃ virecessati, ekūnatiṃsakkhattuṃ bhagavantaṃ virecessati. Api ca, bhagavā viritto nahāyissati. Nahātaṃ bhagavantaṃ sakiṃ virecessati. Evaṃ bhagavato samattiṃsāya virecanaṃ bhavissatī’ti. Tena hānanda, uṇhodakaṃ paṭiyādehī’’ti. ‘‘Evaṃ, bhante’’ti kho āyasmā ānando bhagavato paṭissuṇitvā uṇhodakaṃ paṭiyādesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho jīvako komārabhacco yena bhagavā tenupasaṅkami, upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho jīvako komārabhacco bhagavantaṃ etadavoca – ‘‘viritto, bhante, bhagavā’’ti? ‘‘Virittomhi, jīvakā’’ti. Idha mayhaṃ, bhante, bahi dvārakoṭṭhakā nikkhantassa etadahosi – ‘‘mayā kho bhagavato samattiṃsāya virecanaṃ dinnaṃ. Dosābhisanno tathāgatassa kāyo. Na bhagavantaṃ samattiṃsakkhattuṃ virecessati, ekūnattiṃsakkhattuṃ bhagavantaṃ virecessati. Api ca, bhagavā viritto nahāyissati. Nahātaṃ bhagavantaṃ sakiṃ virecessati. Evaṃ bhagavato samattiṃsāya virecanaṃ bhavissatī’’ti. Nahāyatu, bhante, bhagavā, nahāyatu sugatoti. Atha kho bhagavā uṇhodakaṃ nahāyi. Nahātaṃ bhagavantaṃ sakiṃ virecesi. Evaṃ bhagavato samattiṃsāya virecanaṃ ahosi. Atha kho jīvako komārabhacco bhagavantaṃ ",
      " etadavoca – ‘‘yāva, bhante, bhagavato kāyo pakatatto hoti, alaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ahaṃ tāva yūsapiṇṭapātenāti (sī.), alaṃ yūsapiṇṭakenāti (syā.)]"
      },
      " yūsapiṇḍapātenā’’ti."
    ],
    "innerText": "Atha kho jīvako komārabhacco yena bhagavā tenupasaṅkami, upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho jīvako komārabhacco bhagavantaṃ etadavoca – ‘‘viritto, bhante, bhagavā’’ti? ‘‘Virittomhi, jīvakā’’ti. Idha mayhaṃ, bhante, bahi dvārakoṭṭhakā nikkhantassa etadahosi – ‘‘mayā kho bhagavato samattiṃsāya virecanaṃ dinnaṃ. Dosābhisanno tathāgatassa kāyo. Na bhagavantaṃ samattiṃsakkhattuṃ virecessati, ekūnattiṃsakkhattuṃ bhagavantaṃ virecessati. Api ca, bhagavā viritto nahāyissati. Nahātaṃ bhagavantaṃ sakiṃ virecessati. Evaṃ bhagavato samattiṃsāya virecanaṃ bhavissatī’’ti. Nahāyatu, bhante, bhagavā, nahāyatu sugatoti. Atha kho bhagavā uṇhodakaṃ nahāyi. Nahātaṃ bhagavantaṃ sakiṃ virecesi. Evaṃ bhagavato samattiṃsāya virecanaṃ ahosi. Atha kho jīvako komārabhacco bhagavantaṃ etadavoca – ‘‘yāva, bhante, bhagavato kāyo pakatatto hoti, alaṃ [ahaṃ tāva yūsapiṇṭapātenāti (sī.), alaṃ yūsapiṇṭakenāti (syā.)] yūsapiṇḍapātenā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Samattiṃsavirecanakathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "210. Varayācanākathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "337"
      },
      ". Atha ",
      " kho bhagavato kāyo nacirasseva pakatatto ahosi. Atha kho jīvako komārabhacco taṃ siveyyakaṃ dussayugaṃ ādāya yena bhagavā tenupasaṅkami ",
      ", upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho jīvako komārabhacco bhagavantaṃ etadavoca – ‘‘ekāhaṃ, bhante, bhagavantaṃ varaṃ yācāmī’’ti. ‘‘Atikkantavarā kho, jīvaka, tathāgatā’’ti. ‘‘Yañca, bhante, kappati yañca anavajja’’nti. ‘‘Vadehi, jīvakā’’ti. ‘‘Bhagavā, bhante, paṃsukūliko, bhikkhusaṅgho ca. Idaṃ me, bhante, siveyyakaṃ dussayugaṃ raññā pajjotena pahitaṃ – bahūnaṃ dussānaṃ bahūnaṃ dussayugānaṃ bahūnaṃ dussayugasatānaṃ bahūnaṃ dussayugasahassānaṃ bahūnaṃ dussayugasatasahassānaṃ aggañca seṭṭhañca mokkhañca uttamañca pavarañca. Paṭiggaṇhātu me, bhante, bhagavā siveyyakaṃ dussayugaṃ; bhikkhusaṅghassa ca gahapaticīvaraṃ anujānātū’’ti. Paṭiggahesi bhagavā siveyyakaṃ dussayugaṃ. Atha kho bhagavā jīvakaṃ komārabhaccaṃ dhammiyā kathāya sandassesi samādapesi samuttejesi sampahaṃsesi. Atha kho jīvako komārabhacco bhagavatā dhammiyā kathāya sandassito samādapito samuttejito sampahaṃsito uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘anujānāmi, bhikkhave, gahapaticīvaraṃ. Yo icchati, paṃsukūliko hotu. Yo icchati, gahapaticīvaraṃ sādiyatu. Itarītarenapāhaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pahaṃ (sī.), cāhaṃ (syā.)]"
      },
      ", bhikkhave, santuṭṭhiṃ vaṇṇemī’’ti."
    ],
    "innerText": "337. Atha kho bhagavato kāyo nacirasseva pakatatto ahosi. Atha kho jīvako komārabhacco taṃ siveyyakaṃ dussayugaṃ ādāya yena bhagavā tenupasaṅkami , upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho jīvako komārabhacco bhagavantaṃ etadavoca – ‘‘ekāhaṃ, bhante, bhagavantaṃ varaṃ yācāmī’’ti. ‘‘Atikkantavarā kho, jīvaka, tathāgatā’’ti. ‘‘Yañca, bhante, kappati yañca anavajja’’nti. ‘‘Vadehi, jīvakā’’ti. ‘‘Bhagavā, bhante, paṃsukūliko, bhikkhusaṅgho ca. Idaṃ me, bhante, siveyyakaṃ dussayugaṃ raññā pajjotena pahitaṃ – bahūnaṃ dussānaṃ bahūnaṃ dussayugānaṃ bahūnaṃ dussayugasatānaṃ bahūnaṃ dussayugasahassānaṃ bahūnaṃ dussayugasatasahassānaṃ aggañca seṭṭhañca mokkhañca uttamañca pavarañca. Paṭiggaṇhātu me, bhante, bhagavā siveyyakaṃ dussayugaṃ; bhikkhusaṅghassa ca gahapaticīvaraṃ anujānātū’’ti. Paṭiggahesi bhagavā siveyyakaṃ dussayugaṃ. Atha kho bhagavā jīvakaṃ komārabhaccaṃ dhammiyā kathāya sandassesi samādapesi samuttejesi sampahaṃsesi. Atha kho jīvako komārabhacco bhagavatā dhammiyā kathāya sandassito samādapito samuttejito sampahaṃsito uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘anujānāmi, bhikkhave, gahapaticīvaraṃ. Yo icchati, paṃsukūliko hotu. Yo icchati, gahapaticīvaraṃ sādiyatu. Itarītarenapāhaṃ [pahaṃ (sī.), cāhaṃ (syā.)], bhikkhave, santuṭṭhiṃ vaṇṇemī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Assosuṃ kho rājagahe manussā – ‘‘bhagavatā kira ",
      " bhikkhūnaṃ gahapaticīvaraṃ ",
      " anuññāta’’nti. Te ca manussā haṭṭhā ahesuṃ udaggā ‘‘idāni kho mayaṃ dānāni dassāma puññāni karissāma, yato bhagavatā bhikkhūnaṃ gahapaticīvaraṃ anuññāta’’nti. Ekāheneva rājagahe bahūni cīvarasahassāni uppajjiṃsu."
    ],
    "innerText": "Assosuṃ kho rājagahe manussā – ‘‘bhagavatā kira bhikkhūnaṃ gahapaticīvaraṃ anuññāta’’nti. Te ca manussā haṭṭhā ahesuṃ udaggā ‘‘idāni kho mayaṃ dānāni dassāma puññāni karissāma, yato bhagavatā bhikkhūnaṃ gahapaticīvaraṃ anuññāta’’nti. Ekāheneva rājagahe bahūni cīvarasahassāni uppajjiṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Assosuṃ ",
      " kho jānapadā manussā – ‘‘bhagavatā kira bhikkhūnaṃ gahapaticīvaraṃ anuññāta’’nti. Te ca manussā haṭṭhā ahesuṃ udaggā – ‘‘idāni kho mayaṃ dānāni dassāma puññāni karissāma, yato bhagavatā bhikkhūnaṃ gahapaticīvaraṃ anuññāta’’nti. Janapadepi ekāheneva bahūni cīvarasahassāni uppajjiṃsu."
    ],
    "innerText": "Assosuṃ kho jānapadā manussā – ‘‘bhagavatā kira bhikkhūnaṃ gahapaticīvaraṃ anuññāta’’nti. Te ca manussā haṭṭhā ahesuṃ udaggā – ‘‘idāni kho mayaṃ dānāni dassāma puññāni karissāma, yato bhagavatā bhikkhūnaṃ gahapaticīvaraṃ anuññāta’’nti. Janapadepi ekāheneva bahūni cīvarasahassāni uppajjiṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena ",
      " kho pana samayena saṅghassa pāvāro uppanno hoti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, pāvāranti."
    ],
    "innerText": "Tena kho pana samayena saṅghassa pāvāro uppanno hoti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, pāvāranti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Koseyyapāvāro uppanno hoti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, koseyyapāvāranti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kojavaṃ uppannaṃ hoti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, kojavanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Varayācanākathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṭhamabhāṇavāro niṭṭhito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "211. Kambalānujānanādikathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "338"
      },
      ". Tena kho pana samayena kāsirājā jīvakassa komārabhaccassa aḍḍhakāsikaṃ kambalaṃ pāhesi upaḍḍhakāsinaṃ khamamānaṃ. Atha kho jīvako komārabhacco taṃ aḍḍhakāsikaṃ kambalaṃ ādāya yena bhagavā tenupasaṅkami, upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho jīvako komārabhacco bhagavantaṃ ",
      " etadavoca – ‘‘ayaṃ me, bhante, aḍḍhakāsiko kambalo kāsiraññā pahito upaḍḍhakāsinaṃ khamamāno. Paṭiggaṇhātu me, bhante, bhagavā kambalaṃ, yaṃ mamassa dīgharattaṃ hitāya sukhāyā’’ti. Paṭiggahesi bhagavā kambalaṃ. Atha kho bhagavā jīvakaṃ komārabhaccaṃ dhammiyā kathāya sandassesi…pe… padakkhiṇaṃ katvā pakkāmi. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘anujānāmi, bhikkhave, kambala’’nti."
    ],
    "innerText": "338. Tena kho pana samayena kāsirājā jīvakassa komārabhaccassa aḍḍhakāsikaṃ kambalaṃ pāhesi upaḍḍhakāsinaṃ khamamānaṃ. Atha kho jīvako komārabhacco taṃ aḍḍhakāsikaṃ kambalaṃ ādāya yena bhagavā tenupasaṅkami, upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho jīvako komārabhacco bhagavantaṃ etadavoca – ‘‘ayaṃ me, bhante, aḍḍhakāsiko kambalo kāsiraññā pahito upaḍḍhakāsinaṃ khamamāno. Paṭiggaṇhātu me, bhante, bhagavā kambalaṃ, yaṃ mamassa dīgharattaṃ hitāya sukhāyā’’ti. Paṭiggahesi bhagavā kambalaṃ. Atha kho bhagavā jīvakaṃ komārabhaccaṃ dhammiyā kathāya sandassesi…pe… padakkhiṇaṃ katvā pakkāmi. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘anujānāmi, bhikkhave, kambala’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "339"
      },
      ". Tena kho pana samayena saṅghassa uccāvacāni cīvarāni uppannāni honti. Atha kho bhikkhūnaṃ etadahosi – ‘‘kiṃ nu kho bhagavatā cīvaraṃ anuññātaṃ ",
      ", kiṃ ananuññāta’’nti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, cha cīvarāni – khomaṃ kappāsikaṃ koseyyaṃ kambalaṃ sāṇaṃ bhaṅganti."
    ],
    "innerText": "339. Tena kho pana samayena saṅghassa uccāvacāni cīvarāni uppannāni honti. Atha kho bhikkhūnaṃ etadahosi – ‘‘kiṃ nu kho bhagavatā cīvaraṃ anuññātaṃ , kiṃ ananuññāta’’nti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, cha cīvarāni – khomaṃ kappāsikaṃ koseyyaṃ kambalaṃ sāṇaṃ bhaṅganti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "340"
      },
      ". Tena kho pana samayena ye te bhikkhū gahapaticīvaraṃ ",
      " sādiyanti te kukkuccāyantā ",
      " paṃsukūlaṃ na sādiyanti – ekaṃyeva bhagavatā cīvaraṃ anuññātaṃ, na dveti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, gahapaticīvaraṃ sādiyantena paṃsukūlampi sādiyituṃ; tadubhayenapāhaṃ, bhikkhave, santuṭṭhiṃ vaṇṇemīti."
    ],
    "innerText": "340. Tena kho pana samayena ye te bhikkhū gahapaticīvaraṃ sādiyanti te kukkuccāyantā paṃsukūlaṃ na sādiyanti – ekaṃyeva bhagavatā cīvaraṃ anuññātaṃ, na dveti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, gahapaticīvaraṃ sādiyantena paṃsukūlampi sādiyituṃ; tadubhayenapāhaṃ, bhikkhave, santuṭṭhiṃ vaṇṇemīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Kambalānujānanādikathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "212. Paṃsukūlapariyesanakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "341"
      },
      ". Tena kho pana samayena sambahulā bhikkhū kosalesu janapade ",
      " addhānamaggappaṭipannā honti. Ekacce bhikkhū susānaṃ okkamiṃsu paṃsukūlāya, ekacce bhikkhū nāgamesuṃ. Ye te bhikkhū susānaṃ okkamiṃsu paṃsukūlāya te paṃsukūlāni labhiṃsu. Ye te bhikkhū nāgamesuṃ te evamāhaṃsu – ‘‘amhākampi, āvuso, bhāgaṃ dethā’’ti. Te evamāhaṃsu – ‘‘na mayaṃ, āvuso, tumhākaṃ bhāgaṃ dassāma. Kissa tumhe nāgamitthā’’ti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, nāgamentānaṃ nākāmā bhāgaṃ dātunti."
    ],
    "innerText": "341. Tena kho pana samayena sambahulā bhikkhū kosalesu janapade addhānamaggappaṭipannā honti. Ekacce bhikkhū susānaṃ okkamiṃsu paṃsukūlāya, ekacce bhikkhū nāgamesuṃ. Ye te bhikkhū susānaṃ okkamiṃsu paṃsukūlāya te paṃsukūlāni labhiṃsu. Ye te bhikkhū nāgamesuṃ te evamāhaṃsu – ‘‘amhākampi, āvuso, bhāgaṃ dethā’’ti. Te evamāhaṃsu – ‘‘na mayaṃ, āvuso, tumhākaṃ bhāgaṃ dassāma. Kissa tumhe nāgamitthā’’ti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, nāgamentānaṃ nākāmā bhāgaṃ dātunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena kho pana samayena sambahulā bhikkhū kosalesu janapade addhānamaggappaṭipannā honti. Ekacce bhikkhū susānaṃ okkamiṃsu paṃsukūlāya, ekacce bhikkhū āgamesuṃ. Ye te bhikkhū susānaṃ okkamiṃsu paṃsukūlāya te paṃsukūlāni labhiṃsu. Ye te bhikkhū āgamesuṃ te evamāhaṃsu – ‘‘amhākampi, āvuso, bhāgaṃ dethā’’ti. Te evamāhaṃsu – ‘‘na mayaṃ, āvuso, tumhākaṃ bhāgaṃ dassāma. Kissa tumhe na okkamitthā’’ti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, āgamentānaṃ akāmā bhāgaṃ dātunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena kho pana samayena sambahulā bhikkhū kosalesu janapade addhānamaggappaṭipannā honti. Ekacce bhikkhū paṭhamaṃ susānaṃ okkamiṃsu paṃsukūlāya, ekacce bhikkhū pacchā okkamiṃsu. Ye te bhikkhū paṭhamaṃ susānaṃ okkamiṃsu paṃsukūlāya te paṃsukūlāni labhiṃsu. Ye te bhikkhū ",
      " pacchā okkamiṃsu te na labhiṃsu. Te evamāhaṃsu – ‘‘amhākampi, āvuso ",
      ", bhāgaṃ dethā’’ti. Te evamāhaṃsu – ‘‘na mayaṃ, āvuso, tumhākaṃ bhāgaṃ dassāma. Kissa tumhe pacchā okkamitthā’’ti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, pacchā okkantānaṃ nākāmā bhāgaṃ dātunti."
    ],
    "innerText": "Tena kho pana samayena sambahulā bhikkhū kosalesu janapade addhānamaggappaṭipannā honti. Ekacce bhikkhū paṭhamaṃ susānaṃ okkamiṃsu paṃsukūlāya, ekacce bhikkhū pacchā okkamiṃsu. Ye te bhikkhū paṭhamaṃ susānaṃ okkamiṃsu paṃsukūlāya te paṃsukūlāni labhiṃsu. Ye te bhikkhū pacchā okkamiṃsu te na labhiṃsu. Te evamāhaṃsu – ‘‘amhākampi, āvuso , bhāgaṃ dethā’’ti. Te evamāhaṃsu – ‘‘na mayaṃ, āvuso, tumhākaṃ bhāgaṃ dassāma. Kissa tumhe pacchā okkamitthā’’ti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, pacchā okkantānaṃ nākāmā bhāgaṃ dātunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena ",
      " kho pana samayena sambahulā bhikkhū kosalesu janapade addhānamaggappaṭipannā honti. Te sadisā susānaṃ okkamiṃsu paṃsukūlāya. Ekacce bhikkhū paṃsukūlāni labhiṃsu, ekacce bhikkhū na labhiṃsu ",
      ". Ye te bhikkhū na labhiṃsu, te evamāhaṃsu – ‘‘amhākampi, āvuso, bhāgaṃ dethā’’ti. Te evamāhaṃsu – ‘‘na mayaṃ, āvuso, tumhākaṃ bhāgaṃ dassāma. Kissa tumhe na labhitthā’’ti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, sadisānaṃ okkantānaṃ akāmā bhāgaṃ dātunti."
    ],
    "innerText": "Tena kho pana samayena sambahulā bhikkhū kosalesu janapade addhānamaggappaṭipannā honti. Te sadisā susānaṃ okkamiṃsu paṃsukūlāya. Ekacce bhikkhū paṃsukūlāni labhiṃsu, ekacce bhikkhū na labhiṃsu . Ye te bhikkhū na labhiṃsu, te evamāhaṃsu – ‘‘amhākampi, āvuso, bhāgaṃ dethā’’ti. Te evamāhaṃsu – ‘‘na mayaṃ, āvuso, tumhākaṃ bhāgaṃ dassāma. Kissa tumhe na labhitthā’’ti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, sadisānaṃ okkantānaṃ akāmā bhāgaṃ dātunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena kho pana samayena sambahulā bhikkhū kosalesu janapade addhānamaggappaṭipannā honti. Te katikaṃ katvā susānaṃ okkamiṃsu paṃsukūlāya. Ekacce bhikkhū paṃsukūlāni labhiṃsu, ekacce bhikkhū na labhiṃsu. Ye te bhikkhū na labhiṃsu te evamāhaṃsu – ‘‘amhākampi, āvuso, bhāgaṃ dethā’’ti. Te evamāhaṃsu – ‘‘na mayaṃ, āvuso, tumhākaṃ bhāgaṃ dassāma. Kissa tumhe na labhitthā’’ti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, katikaṃ katvā okkantānaṃ akāmā bhāgaṃ dātunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṃsukūlapariyesanakathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "213. Cīvarapaṭiggāhakasammutikathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "342"
      },
      ". Tena kho pana samayena manussā cīvaraṃ ādāya ārāmaṃ āgacchanti. Te paṭiggāhakaṃ alabhamānā paṭiharanti. Cīvaraṃ parittaṃ ",
      " uppajjati. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, pañcahaṅgehi samannāgataṃ bhikkhuṃ cīvarapaṭiggāhakaṃ sammannituṃ – yo na chandāgatiṃ gaccheyya, na dosāgatiṃ gaccheyya, na mohāgatiṃ gaccheyya, na bhayāgatiṃ gaccheyya, gahitāgahitañca jāneyya. Evañca pana, bhikkhave, sammannitabbo. Paṭhamaṃ bhikkhu yācitabbo; yācitvā byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
    ],
    "innerText": "342. Tena kho pana samayena manussā cīvaraṃ ādāya ārāmaṃ āgacchanti. Te paṭiggāhakaṃ alabhamānā paṭiharanti. Cīvaraṃ parittaṃ uppajjati. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, pañcahaṅgehi samannāgataṃ bhikkhuṃ cīvarapaṭiggāhakaṃ sammannituṃ – yo na chandāgatiṃ gaccheyya, na dosāgatiṃ gaccheyya, na mohāgatiṃ gaccheyya, na bhayāgatiṃ gaccheyya, gahitāgahitañca jāneyya. Evañca pana, bhikkhave, sammannitabbo. Paṭhamaṃ bhikkhu yācitabbo; yācitvā byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Yadi saṅghassa pattakallaṃ saṅgho itthannāmaṃ bhikkhuṃ cīvarapaṭiggāhakaṃ sammanneyya. Esā ñatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu ",
      " me, bhante, saṅgho. Saṅgho itthannāmaṃ bhikkhuṃ cīvarapaṭiggāhakaṃ sammannati. Yassāyasmato ",
      " khamati itthannāmassa bhikkhuno cīvarapaṭiggāhakassa sammuti, so tuṇhassa; yassa nakkhamati, so bhāseyya."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Saṅgho itthannāmaṃ bhikkhuṃ cīvarapaṭiggāhakaṃ sammannati. Yassāyasmato khamati itthannāmassa bhikkhuno cīvarapaṭiggāhakassa sammuti, so tuṇhassa; yassa nakkhamati, so bhāseyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sammato saṅghena itthannāmo bhikkhu cīvarapaṭiggāhako. Khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena kho pana samayena cīvarapaṭiggāhakā bhikkhū cīvaraṃ paṭiggahetvā tattheva ujjhitvā pakkamanti. Cīvaraṃ nassati. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave ",
      ", pañcahaṅgehi samannāgataṃ bhikkhuṃ cīvaranidahakaṃ sammannituṃ – yo na chandāgatiṃ gaccheyya, na dosāgatiṃ gaccheyya, na mohāgatiṃ gaccheyya, na bhayāgatiṃ gaccheyya, nihitānihitañca jāneyya. Evañca pana, bhikkhave, sammannitabbo. Paṭhamaṃ bhikkhu yācitabbo; yācitvā byattena ",
      " bhikkhunā paṭibalena saṅgho ñāpetabbo –"
    ],
    "innerText": "Tena kho pana samayena cīvarapaṭiggāhakā bhikkhū cīvaraṃ paṭiggahetvā tattheva ujjhitvā pakkamanti. Cīvaraṃ nassati. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave , pañcahaṅgehi samannāgataṃ bhikkhuṃ cīvaranidahakaṃ sammannituṃ – yo na chandāgatiṃ gaccheyya, na dosāgatiṃ gaccheyya, na mohāgatiṃ gaccheyya, na bhayāgatiṃ gaccheyya, nihitānihitañca jāneyya. Evañca pana, bhikkhave, sammannitabbo. Paṭhamaṃ bhikkhu yācitabbo; yācitvā byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Yadi saṅghassa pattakallaṃ, saṅgho itthannāmaṃ bhikkhuṃ cīvaranidahakaṃ sammanneyya. Esā ñatti. ‘‘Suṇātu me, bhante, saṅgho. Saṅgho itthannāmaṃ bhikkhuṃ cīvaranidahakaṃ sammannati. Yassāyasmato khamati itthannāmassa bhikkhuno cīvaranidahakassa sammuti, so tuṇhassa; yassa nakkhamati, so bhāseyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sammato saṅghena itthannāmo bhikkhu cīvaranidahako. Khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Cīvarapaṭiggāhakasammutikathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "214. Bhaṇḍāgārasammutiādikathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "343"
      },
      ". Tena kho pana samayena cīvaranidahako bhikkhu maṇḍapepi rukkhamūlepi nibbakosepi cīvaraṃ nidahati, undūrehipi upacikāhipi khajjanti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, bhaṇḍāgāraṃ sammannituṃ, yaṃ saṅgho ākaṅkhati vihāraṃ vā aḍḍhayogaṃ vā pāsādaṃ vā hammiyaṃ vā guhaṃ vā. Evañca pana, bhikkhave, sammannitabbo. Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
    ],
    "innerText": "343. Tena kho pana samayena cīvaranidahako bhikkhu maṇḍapepi rukkhamūlepi nibbakosepi cīvaraṃ nidahati, undūrehipi upacikāhipi khajjanti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, bhaṇḍāgāraṃ sammannituṃ, yaṃ saṅgho ākaṅkhati vihāraṃ vā aḍḍhayogaṃ vā pāsādaṃ vā hammiyaṃ vā guhaṃ vā. Evañca pana, bhikkhave, sammannitabbo. Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu ",
      " me, bhante, saṅgho. Yadi saṅghassa pattakallaṃ, saṅgho itthannāmaṃ vihāraṃ bhaṇḍāgāraṃ sammanneyya. Esā ñatti."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Yadi saṅghassa pattakallaṃ, saṅgho itthannāmaṃ vihāraṃ bhaṇḍāgāraṃ sammanneyya. Esā ñatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu me, bhante, saṅgho. Saṅgho itthannāmaṃ vihāraṃ bhaṇḍāgāraṃ sammannati. Yassāyasmato khamati itthannāmassa vihārassa bhaṇḍāgārassa sammuti, so tuṇhassa; yassa ",
      " nakkhamati, so bhāseyya."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Saṅgho itthannāmaṃ vihāraṃ bhaṇḍāgāraṃ sammannati. Yassāyasmato khamati itthannāmassa vihārassa bhaṇḍāgārassa sammuti, so tuṇhassa; yassa nakkhamati, so bhāseyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sammato saṅghena itthannāmo vihāro bhaṇḍāgāraṃ. Khamati saṅghassa ",
      ", tasmā tuṇhī, evametaṃ dhārayāmī’’ti."
    ],
    "innerText": "‘‘Sammato saṅghena itthannāmo vihāro bhaṇḍāgāraṃ. Khamati saṅghassa , tasmā tuṇhī, evametaṃ dhārayāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena kho pana samayena saṅghassa bhaṇḍāgāre cīvaraṃ aguttaṃ hoti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, pañcahaṅgehi samannāgataṃ bhikkhuṃ bhaṇḍāgārikaṃ sammannituṃ – yo na chandāgatiṃ gaccheyya, na dosāgatiṃ gaccheyya, na mohāgatiṃ gaccheyya, na bhayāgatiṃ gaccheyya, guttāguttañca jāneyya. Evañca pana, bhikkhave, sammannitabbo. Paṭhamaṃ bhikkhu yācitabbo; yācitvā byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Yadi saṅghassa pattakallaṃ, saṅgho itthannāmaṃ bhikkhuṃ bhaṇḍāgārikaṃ sammanneyya. Esā ñatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Saṅgho itthannāmaṃ bhikkhuṃ bhaṇḍāgārikaṃ sammannati. Yassāyasmato khamati itthannāmassa bhikkhuno bhaṇḍāgārikassa sammuti, so tuṇhassa; yassa nakkhamati, so bhāseyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sammato saṅghena itthannāmo bhikkhu bhaṇḍāgāriko. Khamati ",
      " saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti."
    ],
    "innerText": "‘‘Sammato saṅghena itthannāmo bhikkhu bhaṇḍāgāriko. Khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena kho pana samayena chabbaggiyā bhikkhū bhaṇḍāgārikaṃ vuṭṭhāpenti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, bhaṇḍāgāriko vuṭṭhāpetabbo. Yo vuṭṭhāpeyya, āpatti dukkaṭassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena ",
      " kho pana samayena saṅghassa bhaṇḍāgāre cīvaraṃ ussannaṃ hoti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave ",
      ", sammukhībhūtena saṅghena bhājetunti."
    ],
    "innerText": "Tena kho pana samayena saṅghassa bhaṇḍāgāre cīvaraṃ ussannaṃ hoti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave , sammukhībhūtena saṅghena bhājetunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena kho pana samayena saṅgho cīvaraṃ bhājento kolāhalaṃ akāsi. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, pañcahaṅgehi samannāgataṃ bhikkhuṃ cīvarabhājakaṃ sammannituṃ – yo na chandāgatiṃ gaccheyya, na dosāgatiṃ gaccheyya, na mohāgatiṃ gaccheyya, na bhayāgatiṃ gaccheyya, bhājitābhājitañca jāneyya. Evañca pana, bhikkhave, sammannitabbo. Paṭhamaṃ bhikkhu yācitabbo; yācitvā byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu ",
      " me, bhante, saṅgho. Yadi saṅghassa pattakallaṃ, saṅgho itthannāmaṃ bhikkhuṃ cīvarabhājakaṃ sammanneyya. Esā ñatti."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Yadi saṅghassa pattakallaṃ, saṅgho itthannāmaṃ bhikkhuṃ cīvarabhājakaṃ sammanneyya. Esā ñatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Saṅgho itthannāmaṃ bhikkhuṃ cīvarabhājakaṃ sammannati. Yassāyasmato khamati itthannāmassa bhikkhuno cīvarabhājakassa sammuti, so tuṇhassa; yassa nakkhamati, so bhāseyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sammato saṅghena itthannāmo bhikkhu cīvarabhājako. Khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha kho cīvarabhājakānaṃ bhikkhūnaṃ etadahosi – ‘‘kathaṃ nu kho cīvaraṃ bhājetabba’’nti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, paṭhamaṃ uccinitvā tulayitvā vaṇṇāvaṇṇaṃ katvā bhikkhū gaṇetvā vaggaṃ bandhitvā cīvarapaṭivīsaṃ ṭhapetunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho cīvarabhājakānaṃ bhikkhūnaṃ etadahosi – ‘‘kathaṃ nu kho sāmaṇerānaṃ cīvarapaṭivīso dātabbo’’ti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, sāmaṇerānaṃ upaḍḍhapaṭivīsaṃ ",
      " dātunti."
    ],
    "innerText": "Atha kho cīvarabhājakānaṃ bhikkhūnaṃ etadahosi – ‘‘kathaṃ nu kho sāmaṇerānaṃ cīvarapaṭivīso dātabbo’’ti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, sāmaṇerānaṃ upaḍḍhapaṭivīsaṃ dātunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena kho pana samayena aññataro bhikkhu sakena bhāgena uttaritukāmo hoti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, uttarantassa sakaṃ bhāgaṃ dātunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena ",
      " kho pana samayena aññataro bhikkhu atirekabhāgena uttaritukāmo hoti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, anukkhepe dinne atirekabhāgaṃ dātunti."
    ],
    "innerText": "Tena kho pana samayena aññataro bhikkhu atirekabhāgena uttaritukāmo hoti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, anukkhepe dinne atirekabhāgaṃ dātunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho cīvarabhājakānaṃ bhikkhūnaṃ etadahosi – ‘‘kathaṃ nu kho cīvarapaṭivīso dātabbo, āgatapaṭipāṭiyā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[āgatāgatapaṭipāṭiyā (ka.)]"
      },
      " nu kho udāhu yathāvuḍḍha’’nti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, vikalake tosetvā kusapātaṃ kātunti."
    ],
    "innerText": "Atha kho cīvarabhājakānaṃ bhikkhūnaṃ etadahosi – ‘‘kathaṃ nu kho cīvarapaṭivīso dātabbo, āgatapaṭipāṭiyā [āgatāgatapaṭipāṭiyā (ka.)] nu kho udāhu yathāvuḍḍha’’nti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, vikalake tosetvā kusapātaṃ kātunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Bhaṇḍāgārasammutiādikathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "215. Cīvararajanakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "344"
      },
      ". Tena kho pana samayena bhikkhū chakaṇenapi paṇḍumattikāyapi ",
      " cīvaraṃ rajanti. Cīvaraṃ dubbaṇṇaṃ hoti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi ",
      ", bhikkhave, cha rajanāni – mūlarajanaṃ, khandharajanaṃ, tacarajanaṃ, pattarajanaṃ, puppharajanaṃ, phalarajananti."
    ],
    "innerText": "344. Tena kho pana samayena bhikkhū chakaṇenapi paṇḍumattikāyapi cīvaraṃ rajanti. Cīvaraṃ dubbaṇṇaṃ hoti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi , bhikkhave, cha rajanāni – mūlarajanaṃ, khandharajanaṃ, tacarajanaṃ, pattarajanaṃ, puppharajanaṃ, phalarajananti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena kho pana samayena bhikkhū sītudakāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sītundikāya (sī.), sītūdakāya (syā.)]"
      },
      " cīvaraṃ rajanti. Cīvaraṃ duggandhaṃ hoti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, rajanaṃ pacituṃ cullaṃ rajanakumbhinti. Rajanaṃ uttariyati. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, uttarāḷumpaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[uttarāḷupaṃ (yojanā), uttarāḷupaṃ (syā.)]"
      },
      " bandhitunti."
    ],
    "innerText": "Tena kho pana samayena bhikkhū sītudakāya [sītundikāya (sī.), sītūdakāya (syā.)] cīvaraṃ rajanti. Cīvaraṃ duggandhaṃ hoti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, rajanaṃ pacituṃ cullaṃ rajanakumbhinti. Rajanaṃ uttariyati. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, uttarāḷumpaṃ [uttarāḷupaṃ (yojanā), uttarāḷupaṃ (syā.)] bandhitunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena kho pana samayena bhikkhū na jānanti rajanaṃ pakkaṃ vā apakkaṃ vā. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, udake vā nakhapiṭṭhikāya vā thevakaṃ ",
      " dātunti."
    ],
    "innerText": "Tena kho pana samayena bhikkhū na jānanti rajanaṃ pakkaṃ vā apakkaṃ vā. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, udake vā nakhapiṭṭhikāya vā thevakaṃ dātunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena kho pana samayena bhikkhū rajanaṃ oropentā kumbhiṃ āviñchanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[āviñjanti (sī.), āvaṭṭanti (syā.)]"
      },
      ". Kumbhī bhijjati. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, rajanuḷuṅkaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[rajanāḷuṅkaṃ (yojanā)]"
      },
      " daṇḍakathālakanti."
    ],
    "innerText": "Tena kho pana samayena bhikkhū rajanaṃ oropentā kumbhiṃ āviñchanti [āviñjanti (sī.), āvaṭṭanti (syā.)]. Kumbhī bhijjati. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, rajanuḷuṅkaṃ [rajanāḷuṅkaṃ (yojanā)] daṇḍakathālakanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena kho pana samayena bhikkhūnaṃ rajanabhājanaṃ na saṃvijjati. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, rajanakolambaṃ rajanaghaṭanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena ",
      " kho pana samayena bhikkhū pātiyāpi pattepi cīvaraṃ omaddanti. Cīvaraṃ paribhijjati. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, rajanadoṇikanti."
    ],
    "innerText": "Tena kho pana samayena bhikkhū pātiyāpi pattepi cīvaraṃ omaddanti. Cīvaraṃ paribhijjati. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, rajanadoṇikanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena kho pana samayena bhikkhū chamāya cīvaraṃ pattharanti. Cīvaraṃ paṃsukitaṃ hoti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, tiṇasanthārakanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tiṇasanthārako upacikāhi khajjati. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, cīvaravaṃsaṃ cīvararajjunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Majjhena laggenti. Rajanaṃ ubhato galati. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, kaṇṇe bandhitunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kaṇṇo ",
      " jīrati. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, kaṇṇasuttakanti."
    ],
    "innerText": "Kaṇṇo jīrati. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, kaṇṇasuttakanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Rajanaṃ ekato galati. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, samparivattakaṃ samparivattakaṃ rajetuṃ, na ca acchinne theve pakkamitunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena kho pana samayena cīvaraṃ patthinnaṃ hoti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, udake osāretunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena kho pana samayena cīvaraṃ pharusaṃ hoti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi ",
      ", bhikkhave, pāṇinā ākoṭetunti ",
      "."
    ],
    "innerText": "Tena kho pana samayena cīvaraṃ pharusaṃ hoti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi , bhikkhave, pāṇinā ākoṭetunti ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena kho pana samayena bhikkhū acchinnakāni cīvarāni dhārenti dantakāsāvāni. Manussā ujjhāyanti khiyyanti vipācenti – seyyathāpi nāma ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[seyyathāpi (?)]"
      },
      " gihī kāmabhoginoti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, acchinnakāni cīvarāni dhāretabbāni. Yo dhāreyya, āpatti dukkaṭassāti."
    ],
    "innerText": "Tena kho pana samayena bhikkhū acchinnakāni cīvarāni dhārenti dantakāsāvāni. Manussā ujjhāyanti khiyyanti vipācenti – seyyathāpi nāma [seyyathāpi (?)] gihī kāmabhoginoti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, acchinnakāni cīvarāni dhāretabbāni. Yo dhāreyya, āpatti dukkaṭassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Cīvararajanakathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "216. Chinnakacīvarānujānanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "345"
      },
      ". Atha ",
      " kho bhagavā rājagahe yathābhirantaṃ viharitvā yena dakkhiṇāgiri tena cārikaṃ pakkāmi. Addasā kho bhagavā magadhakhettaṃ acchibaddhaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[accibaddhaṃ (sī. syā.), acchibandhaṃ (ka.)]"
      },
      " pāḷibaddhaṃ mariyādabaddhaṃ siṅghāṭakabaddhaṃ, disvāna āyasmantaṃ ānandaṃ āmantesi – ‘‘passasi no tvaṃ, ānanda, magadhakhettaṃ acchibaddhaṃ pāḷibaddhaṃ mariyādabaddhaṃ siṅghāṭakabaddha’’nti? ‘‘Evaṃ, bhante’’ti. ‘‘Ussahasi tvaṃ, ānanda, bhikkhūnaṃ evarūpāni cīvarāni saṃvidahitu’’nti? ‘‘Ussahāmi, bhagavā’’ti. Atha kho bhagavā dakkhiṇāgirismiṃ yathābhirantaṃ viharitvā punadeva rājagahaṃ paccāgañchi. Atha kho āyasmā ānando sambahulānaṃ bhikkhūnaṃ cīvarāni saṃvidahitvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ etadavoca – ‘‘passatu me ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[passatha tumhe (ka.)]"
      },
      ", bhante, bhagavā cīvarāni saṃvidahitānī’’ti. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe ",
      " dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘paṇḍito, bhikkhave, ānando; mahāpañño, bhikkhave, ānando; yatra hi nāma mayā saṃkhittena bhāsitassa vitthārena atthaṃ ājānissati, kusimpi nāma karissati, aḍḍhakusimpi nāma karissati, maṇḍalampi nāma karissati ",
      ", aḍḍhamaṇḍalampi nāma karissati, vivaṭṭampi nāma karissati, anuvivaṭṭampi nāma karissati, gīveyyakampi nāma karissati, jaṅgheyyakampi nāma karissati, bāhantampi nāma karissati, chinnakaṃ bhavissati, satthalūkhaṃ samaṇasāruppaṃ paccatthikānañca anabhicchitaṃ. Anujānāmi, bhikkhave, chinnakaṃ saṅghāṭiṃ chinnakaṃ uttarāsaṅgaṃ chinnakaṃ antaravāsaka’’nti."
    ],
    "innerText": "345. Atha kho bhagavā rājagahe yathābhirantaṃ viharitvā yena dakkhiṇāgiri tena cārikaṃ pakkāmi. Addasā kho bhagavā magadhakhettaṃ acchibaddhaṃ [accibaddhaṃ (sī. syā.), acchibandhaṃ (ka.)] pāḷibaddhaṃ mariyādabaddhaṃ siṅghāṭakabaddhaṃ, disvāna āyasmantaṃ ānandaṃ āmantesi – ‘‘passasi no tvaṃ, ānanda, magadhakhettaṃ acchibaddhaṃ pāḷibaddhaṃ mariyādabaddhaṃ siṅghāṭakabaddha’’nti? ‘‘Evaṃ, bhante’’ti. ‘‘Ussahasi tvaṃ, ānanda, bhikkhūnaṃ evarūpāni cīvarāni saṃvidahitu’’nti? ‘‘Ussahāmi, bhagavā’’ti. Atha kho bhagavā dakkhiṇāgirismiṃ yathābhirantaṃ viharitvā punadeva rājagahaṃ paccāgañchi. Atha kho āyasmā ānando sambahulānaṃ bhikkhūnaṃ cīvarāni saṃvidahitvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ etadavoca – ‘‘passatu me [passatha tumhe (ka.)], bhante, bhagavā cīvarāni saṃvidahitānī’’ti. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘paṇḍito, bhikkhave, ānando; mahāpañño, bhikkhave, ānando; yatra hi nāma mayā saṃkhittena bhāsitassa vitthārena atthaṃ ājānissati, kusimpi nāma karissati, aḍḍhakusimpi nāma karissati, maṇḍalampi nāma karissati , aḍḍhamaṇḍalampi nāma karissati, vivaṭṭampi nāma karissati, anuvivaṭṭampi nāma karissati, gīveyyakampi nāma karissati, jaṅgheyyakampi nāma karissati, bāhantampi nāma karissati, chinnakaṃ bhavissati, satthalūkhaṃ samaṇasāruppaṃ paccatthikānañca anabhicchitaṃ. Anujānāmi, bhikkhave, chinnakaṃ saṅghāṭiṃ chinnakaṃ uttarāsaṅgaṃ chinnakaṃ antaravāsaka’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Chinnakacīvarānujānanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "217. Ticīvarānujānanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "346"
      },
      ". Atha kho bhagavā rājagahe yathābhirantaṃ viharitvā yena vesālī tena cārikaṃ pakkāmi. Addasa kho bhagavā antarā ca rājagahaṃ antarā ca vesāliṃ addhānamaggappaṭipanno sambahule bhikkhū cīvarehi ubbhaṇḍite ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ubbhaṇḍīkate (syā.)]"
      },
      " sīsepi cīvarabhisiṃ karitvā khandhepi cīvarabhisiṃ karitvā kaṭiyāpi cīvarabhisiṃ karitvā āgacchante, disvāna bhagavato etadahosi – ‘‘atilahuṃ kho ime moghapurisā cīvare bāhullāya āvattā ",
      ". Yaṃnūnāhaṃ bhikkhūnaṃ cīvare sīmaṃ bandheyyaṃ, mariyādaṃ ṭhapeyya’’nti. Atha kho bhagavā anupubbena cārikaṃ caramāno yena vesālī tadavasari. Tatra sudaṃ bhagavā vesāliyaṃ viharati gotamake cetiye. Tena kho pana samayena ",
      " bhagavā sītāsu hemantikāsu rattīsu antaraṭṭhakāsu himapātasamaye rattiṃ ajjhokāse ekacīvaro nisīdi. Na bhagavantaṃ ",
      " sītaṃ ahosi. Nikkhante paṭhame yāme sītaṃ bhagavantaṃ ahosi. Dutiyaṃ bhagavā cīvaraṃ pārupi. Na bhagavantaṃ sītaṃ ahosi. Nikkhante majjhime yāme sītaṃ bhagavantaṃ ahosi. Tatiyaṃ bhagavā cīvaraṃ pārupi. Na bhagavantaṃ sītaṃ ahosi. Nikkhante pacchime yāme uddhaste aruṇe nandimukhiyā rattiyā sītaṃ bhagavantaṃ ahosi. Catutthaṃ bhagavā cīvaraṃ pārupi. Na bhagavantaṃ sītaṃ ahosi. Atha kho bhagavato etadahosi – ‘‘yepi kho te kulaputtā imasmiṃ dhammavinaye sītālukā sītabhīrukā tepi sakkonti ticīvarena yāpetuṃ. Yaṃnūnāhaṃ bhikkhūnaṃ cīvare sīmaṃ bandheyyaṃ, mariyādaṃ ṭhapeyyaṃ, ticīvaraṃ anujāneyya’’nti. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘idhāhaṃ, bhikkhave, antarā ca rājagahaṃ antarā ca vesāliṃ addhānamaggappaṭipanno addasaṃ sambahule bhikkhū ",
      " cīvarehi ubbhaṇḍite sīsepi cīvarabhisiṃ karitvā khandhepi cīvarabhisiṃ karitvā kaṭiyāpi cīvarabhisiṃ karitvā āgacchante, disvāna me etadahosi – ‘atilahuṃ kho ime moghapurisā cīvare bāhullāya āvattā. Yaṃnūnāhaṃ bhikkhūnaṃ cīvare sīmaṃ bandheyyaṃ, mariyādaṃ ṭhapeyya’nti. Idhāhaṃ, bhikkhave, sītāsu hemantikāsu rattīsu antaraṭṭhakāsu himapātasamaye rattiṃ ajjhokāse ekacīvaro nisīdiṃ. Na maṃ sītaṃ ahosi. Nikkhante paṭhame yāme sītaṃ maṃ ahosi. Dutiyāhaṃ cīvaraṃ pārupiṃ. Na maṃ sītaṃ ",
      " ahosi. Nikkhante majjhime yāme sītaṃ maṃ ahosi. Tatiyāhaṃ cīvaraṃ pārupiṃ. Na maṃ sītaṃ ahosi. Nikkhante pacchime yāme uddhaste aruṇe nandimukhiyā rattiyā sītaṃ maṃ ahosi. Catutthāhaṃ cīvaraṃ pārupiṃ. Na maṃ sītaṃ ahosi. Tassa mayhaṃ, bhikkhave, etadahosi – ‘‘yepi kho te kulaputtā imasmiṃ dhammavinaye sītālukā sītabhīrukā tepi sakkonti ticīvarena yāpetuṃ. Yaṃnūnāhaṃ bhikkhūnaṃ cīvare sīmaṃ bandheyyaṃ, mariyādaṃ ṭhapeyyaṃ ",
      ", ticīvaraṃ anujāneyya’nti. Anujānāmi, bhikkhave, ticīvaraṃ – diguṇaṃ saṅghāṭiṃ, ekacciyaṃ uttarāsaṅgaṃ, ekacciyaṃ antaravāsaka’’nti."
    ],
    "innerText": "346. Atha kho bhagavā rājagahe yathābhirantaṃ viharitvā yena vesālī tena cārikaṃ pakkāmi. Addasa kho bhagavā antarā ca rājagahaṃ antarā ca vesāliṃ addhānamaggappaṭipanno sambahule bhikkhū cīvarehi ubbhaṇḍite [ubbhaṇḍīkate (syā.)] sīsepi cīvarabhisiṃ karitvā khandhepi cīvarabhisiṃ karitvā kaṭiyāpi cīvarabhisiṃ karitvā āgacchante, disvāna bhagavato etadahosi – ‘‘atilahuṃ kho ime moghapurisā cīvare bāhullāya āvattā . Yaṃnūnāhaṃ bhikkhūnaṃ cīvare sīmaṃ bandheyyaṃ, mariyādaṃ ṭhapeyya’’nti. Atha kho bhagavā anupubbena cārikaṃ caramāno yena vesālī tadavasari. Tatra sudaṃ bhagavā vesāliyaṃ viharati gotamake cetiye. Tena kho pana samayena bhagavā sītāsu hemantikāsu rattīsu antaraṭṭhakāsu himapātasamaye rattiṃ ajjhokāse ekacīvaro nisīdi. Na bhagavantaṃ sītaṃ ahosi. Nikkhante paṭhame yāme sītaṃ bhagavantaṃ ahosi. Dutiyaṃ bhagavā cīvaraṃ pārupi. Na bhagavantaṃ sītaṃ ahosi. Nikkhante majjhime yāme sītaṃ bhagavantaṃ ahosi. Tatiyaṃ bhagavā cīvaraṃ pārupi. Na bhagavantaṃ sītaṃ ahosi. Nikkhante pacchime yāme uddhaste aruṇe nandimukhiyā rattiyā sītaṃ bhagavantaṃ ahosi. Catutthaṃ bhagavā cīvaraṃ pārupi. Na bhagavantaṃ sītaṃ ahosi. Atha kho bhagavato etadahosi – ‘‘yepi kho te kulaputtā imasmiṃ dhammavinaye sītālukā sītabhīrukā tepi sakkonti ticīvarena yāpetuṃ. Yaṃnūnāhaṃ bhikkhūnaṃ cīvare sīmaṃ bandheyyaṃ, mariyādaṃ ṭhapeyyaṃ, ticīvaraṃ anujāneyya’’nti. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘idhāhaṃ, bhikkhave, antarā ca rājagahaṃ antarā ca vesāliṃ addhānamaggappaṭipanno addasaṃ sambahule bhikkhū cīvarehi ubbhaṇḍite sīsepi cīvarabhisiṃ karitvā khandhepi cīvarabhisiṃ karitvā kaṭiyāpi cīvarabhisiṃ karitvā āgacchante, disvāna me etadahosi – ‘atilahuṃ kho ime moghapurisā cīvare bāhullāya āvattā. Yaṃnūnāhaṃ bhikkhūnaṃ cīvare sīmaṃ bandheyyaṃ, mariyādaṃ ṭhapeyya’nti. Idhāhaṃ, bhikkhave, sītāsu hemantikāsu rattīsu antaraṭṭhakāsu himapātasamaye rattiṃ ajjhokāse ekacīvaro nisīdiṃ. Na maṃ sītaṃ ahosi. Nikkhante paṭhame yāme sītaṃ maṃ ahosi. Dutiyāhaṃ cīvaraṃ pārupiṃ. Na maṃ sītaṃ ahosi. Nikkhante majjhime yāme sītaṃ maṃ ahosi. Tatiyāhaṃ cīvaraṃ pārupiṃ. Na maṃ sītaṃ ahosi. Nikkhante pacchime yāme uddhaste aruṇe nandimukhiyā rattiyā sītaṃ maṃ ahosi. Catutthāhaṃ cīvaraṃ pārupiṃ. Na maṃ sītaṃ ahosi. Tassa mayhaṃ, bhikkhave, etadahosi – ‘‘yepi kho te kulaputtā imasmiṃ dhammavinaye sītālukā sītabhīrukā tepi sakkonti ticīvarena yāpetuṃ. Yaṃnūnāhaṃ bhikkhūnaṃ cīvare sīmaṃ bandheyyaṃ, mariyādaṃ ṭhapeyyaṃ , ticīvaraṃ anujāneyya’nti. Anujānāmi, bhikkhave, ticīvaraṃ – diguṇaṃ saṅghāṭiṃ, ekacciyaṃ uttarāsaṅgaṃ, ekacciyaṃ antaravāsaka’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ticīvarānujānanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "218. Atirekacīvarakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "347"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pārā. 461]"
      },
      " Tena kho pana samayena chabbaggiyā bhikkhū bhagavatā ticīvaraṃ anuññātanti aññeneva ticīvarena gāmaṃ pavisanti, aññena ticīvarena ārāme acchanti, aññena ticīvarena ",
      " nahānaṃ otaranti. Ye te bhikkhū appicchā te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma chabbaggiyā bhikkhū atirekacīvaraṃ dhāressantī’’ti. Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘na, bhikkhave, atirekacīvaraṃ dhāretabbaṃ. Yo dhāreyya, yathādhammo kāretabbo’’ti."
    ],
    "innerText": "347.[pārā. 461] Tena kho pana samayena chabbaggiyā bhikkhū bhagavatā ticīvaraṃ anuññātanti aññeneva ticīvarena gāmaṃ pavisanti, aññena ticīvarena ārāme acchanti, aññena ticīvarena nahānaṃ otaranti. Ye te bhikkhū appicchā te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma chabbaggiyā bhikkhū atirekacīvaraṃ dhāressantī’’ti. Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘na, bhikkhave, atirekacīvaraṃ dhāretabbaṃ. Yo dhāreyya, yathādhammo kāretabbo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pārā. 461]"
      },
      " Tena kho pana samayena āyasmato ānandassa atirekacīvaraṃ uppannaṃ hoti. Āyasmā ca ānando taṃ cīvaraṃ āyasmato sāriputtassa dātukāmo hoti. Āyasmā ca ",
      " sāriputto sākete viharati. Atha kho āyasmato ānandassa etadahosi – ‘‘bhagavatā sikkhāpadaṃ paññattaṃ ‘na atirekacīvaraṃ dhāretabba’nti. Idañca me atirekacīvaraṃ uppannaṃ ",
      ". Ahañcimaṃ cīvaraṃ āyasmato sāriputtassa dātukāmo. Āyasmā ca sāriputto sākete viharati. Kathaṃ nu kho mayā paṭipajjitabba’’nti? Bhagavato etamatthaṃ ārocesi. ‘‘Kīvaciraṃ panānanda, sāriputto āgacchissatī’’ti? ‘‘Navamaṃ vā, bhagavā, divasaṃ, dasamaṃ vā’’ti. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘anujānāmi, bhikkhave, dasāhaparamaṃ atirekacīvaraṃ dhāretu’’nti."
    ],
    "innerText": "[pārā. 461] Tena kho pana samayena āyasmato ānandassa atirekacīvaraṃ uppannaṃ hoti. Āyasmā ca ānando taṃ cīvaraṃ āyasmato sāriputtassa dātukāmo hoti. Āyasmā ca sāriputto sākete viharati. Atha kho āyasmato ānandassa etadahosi – ‘‘bhagavatā sikkhāpadaṃ paññattaṃ ‘na atirekacīvaraṃ dhāretabba’nti. Idañca me atirekacīvaraṃ uppannaṃ . Ahañcimaṃ cīvaraṃ āyasmato sāriputtassa dātukāmo. Āyasmā ca sāriputto sākete viharati. Kathaṃ nu kho mayā paṭipajjitabba’’nti? Bhagavato etamatthaṃ ārocesi. ‘‘Kīvaciraṃ panānanda, sāriputto āgacchissatī’’ti? ‘‘Navamaṃ vā, bhagavā, divasaṃ, dasamaṃ vā’’ti. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘anujānāmi, bhikkhave, dasāhaparamaṃ atirekacīvaraṃ dhāretu’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena kho pana samayena bhikkhūnaṃ atirekacīvaraṃ uppannaṃ hoti. Atha kho bhikkhūnaṃ etadahosi – ‘‘kathaṃ nu kho amhehi atirekacīvare paṭipajjitabba’’nti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, atirekacīvaraṃ vikappetunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "348"
      },
      ". Atha kho bhagavā vesāliyaṃ yathābhirantaṃ viharitvā yena bārāṇasī tena cārikaṃ pakkāmi. Anupubbena cārikaṃ caramāno yena bārāṇasī tadavasari. Tatra sudaṃ bhagavā bārāṇasiyaṃ viharati isipatane migadāye. Tena kho pana samayena aññatarassa bhikkhuno antaravāsako chiddo hoti. Atha kho tassa bhikkhuno etadahosi – ‘‘bhagavatā ticīvaraṃ anuññātaṃ – diguṇā saṅghāṭi, ekacciyo uttarāsaṅgo ",
      ", ekacciyo antaravāsako. Ayañca me antaravāsako chiddo. Yaṃnūnāhaṃ aggaḷaṃ acchupeyyaṃ, samantato dupaṭṭaṃ bhavissati, majjhe ekacciya’’nti. Atha kho so bhikkhu aggaḷaṃ acchupesi. Addasā kho bhagavā senāsanacārikaṃ āhiṇḍanto taṃ bhikkhuṃ aggaḷaṃ acchupentaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[acchupantaṃ (ka.)]"
      },
      ", disvāna yena so bhikkhu tenupasaṅkami, upasaṅkamitvā taṃ bhikkhuṃ etadavoca – ‘‘kiṃ tvaṃ, bhikkhu, karosī’’ti? ‘‘Aggaḷaṃ, bhagavā, acchupemī’’ti. ‘‘Sādhu sādhu, bhikkhu; sādhu kho tvaṃ, bhikkhu, aggaḷaṃ acchupesī’’ti ",
      ". Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘anujānāmi, bhikkhave, ahatānaṃ dussānaṃ ahatakappānaṃ diguṇaṃ saṅghāṭiṃ, ekacciyaṃ uttarāsaṅgaṃ, ekacciyaṃ antaravāsakaṃ; utuddhaṭānaṃ dussānaṃ catugguṇaṃ saṅghāṭiṃ, diguṇaṃ uttarāsaṅgaṃ, diguṇaṃ ",
      " antaravāsakaṃ; paṃsukūle yāvadatthaṃ; pāpaṇike ussāho karaṇīyo. Anujānāmi, bhikkhave, aggaḷaṃ tunnaṃ ovaṭṭikaṃ kaṇḍusakaṃ daḷhīkamma’’nti."
    ],
    "innerText": "348. Atha kho bhagavā vesāliyaṃ yathābhirantaṃ viharitvā yena bārāṇasī tena cārikaṃ pakkāmi. Anupubbena cārikaṃ caramāno yena bārāṇasī tadavasari. Tatra sudaṃ bhagavā bārāṇasiyaṃ viharati isipatane migadāye. Tena kho pana samayena aññatarassa bhikkhuno antaravāsako chiddo hoti. Atha kho tassa bhikkhuno etadahosi – ‘‘bhagavatā ticīvaraṃ anuññātaṃ – diguṇā saṅghāṭi, ekacciyo uttarāsaṅgo , ekacciyo antaravāsako. Ayañca me antaravāsako chiddo. Yaṃnūnāhaṃ aggaḷaṃ acchupeyyaṃ, samantato dupaṭṭaṃ bhavissati, majjhe ekacciya’’nti. Atha kho so bhikkhu aggaḷaṃ acchupesi. Addasā kho bhagavā senāsanacārikaṃ āhiṇḍanto taṃ bhikkhuṃ aggaḷaṃ acchupentaṃ [acchupantaṃ (ka.)], disvāna yena so bhikkhu tenupasaṅkami, upasaṅkamitvā taṃ bhikkhuṃ etadavoca – ‘‘kiṃ tvaṃ, bhikkhu, karosī’’ti? ‘‘Aggaḷaṃ, bhagavā, acchupemī’’ti. ‘‘Sādhu sādhu, bhikkhu; sādhu kho tvaṃ, bhikkhu, aggaḷaṃ acchupesī’’ti . Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘anujānāmi, bhikkhave, ahatānaṃ dussānaṃ ahatakappānaṃ diguṇaṃ saṅghāṭiṃ, ekacciyaṃ uttarāsaṅgaṃ, ekacciyaṃ antaravāsakaṃ; utuddhaṭānaṃ dussānaṃ catugguṇaṃ saṅghāṭiṃ, diguṇaṃ uttarāsaṅgaṃ, diguṇaṃ antaravāsakaṃ; paṃsukūle yāvadatthaṃ; pāpaṇike ussāho karaṇīyo. Anujānāmi, bhikkhave, aggaḷaṃ tunnaṃ ovaṭṭikaṃ kaṇḍusakaṃ daḷhīkamma’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Atirekacīvarakathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "219. Visākhāvatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "349"
      },
      ". Atha kho bhagavā bārāṇasiyaṃ yathābhirantaṃ viharitvā yena sāvatthi tena cārikaṃ pakkāmi. Anupubbena cārikaṃ caramāno yena sāvatthi tadavasari. Tatra sudaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho visākhā migāramātā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho visākhaṃ migāramātaraṃ bhagavā ",
      " dhammiyā kathāya sandassesi samādapesi samuttejesi sampahaṃsesi. Atha kho visākhā migāramātā, bhagavatā dhammiyā kathāya sandassitā samādapitā samuttejitā sampahaṃsitā, bhagavantaṃ etadavoca – ‘‘adhivāsetu me, bhante, bhagavā svātanāya bhattaṃ saddhiṃ bhikkhusaṅghenā’’ti. Adhivāsesi bhagavā tuṇhībhāvena. Atha kho visākhā migāramātā bhagavato adhivāsanaṃ viditvā uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi."
    ],
    "innerText": "349. Atha kho bhagavā bārāṇasiyaṃ yathābhirantaṃ viharitvā yena sāvatthi tena cārikaṃ pakkāmi. Anupubbena cārikaṃ caramāno yena sāvatthi tadavasari. Tatra sudaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho visākhā migāramātā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho visākhaṃ migāramātaraṃ bhagavā dhammiyā kathāya sandassesi samādapesi samuttejesi sampahaṃsesi. Atha kho visākhā migāramātā, bhagavatā dhammiyā kathāya sandassitā samādapitā samuttejitā sampahaṃsitā, bhagavantaṃ etadavoca – ‘‘adhivāsetu me, bhante, bhagavā svātanāya bhattaṃ saddhiṃ bhikkhusaṅghenā’’ti. Adhivāsesi bhagavā tuṇhībhāvena. Atha kho visākhā migāramātā bhagavato adhivāsanaṃ viditvā uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena kho pana samayena tassā rattiyā accayena cātuddīpiko mahāmegho pāvassi. Atha kho bhagavā bhikkhū āmantesi – ‘‘yathā, bhikkhave, jetavane vassati evaṃ catūsu dīpesu vassati. Ovassāpetha, bhikkhave, kāyaṃ. Ayaṃ pacchimako cātuddīpiko mahāmegho’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paṭissuṇitvā ",
      " nikkhittacīvarā kāyaṃ ovassāpenti. Atha kho visākhā migāramātā paṇītaṃ khādanīyaṃ bhojanīyaṃ paṭiyādāpetvā dāsiṃ āṇāpesi – ‘‘gaccha, je. Ārāmaṃ gantvā kālaṃ ārocehi – kālo, bhante, niṭṭhitaṃ bhatta’’nti. ‘‘Evaṃ, ayye’’ti kho sā dāsī visākhāya migāramātuyā paṭissuṇitvā ārāmaṃ gantvā addasa bhikkhū nikkhittacīvare kāyaṃ ovassāpente, disvāna ‘natthi ārāme bhikkhū, ājīvakā kāyaṃ ovassāpentī’ti yena visākhā migāramātā tenupasaṅkami ",
      "; upasaṅkamitvā visākhaṃ migāramātaraṃ etadavoca – ‘‘natthayye, ārāme bhikkhū, ājīvakā kāyaṃ ovassāpentī’’ti. Atha kho visākhāya migāramātuyā ",
      " paṇḍitāya viyattāya medhāviniyā etadahosi – ‘‘nissaṃsayaṃ kho ayyā nikkhittacīvarā kāyaṃ ovassāpenti. Sāyaṃ ",
      " bālā maññittha – natthi ārāme bhikkhū, ājīvakā kāyaṃ ovassāpentī’’ti, puna dāsiṃ āṇāpesi – ‘‘gaccha, je. Ārāmaṃ gantvā kālaṃ ārocehi – kālo, bhante, niṭṭhitaṃ bhatta’’nti. Atha kho te bhikkhū gattāni sītiṃ karitvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sītīkaritvā (syā.)]"
      },
      " kallakāyā cīvarāni gahetvā yathāvihāraṃ pavisiṃsu. Atha kho sā dāsī ārāmaṃ gantvā bhikkhū apassantī ‘natthi ārāme bhikkhū, suñño ārāmo’ti yena visākhā migāramātā tenupasaṅkami; upasaṅkamitvā visākhaṃ migāramātaraṃ etadavoca – ‘‘natthayye, ārāme bhikkhū, suñño ārāmo’’ti. Atha kho visākhāya migāramātuyā paṇḍitāya viyattāya medhāviniyā etadahosi – ‘‘nissaṃsayaṃ kho ayyā gattāni sītiṃ karitvā kallakāyā cīvarāni gahetvā yathāvihāraṃ paviṭṭhā. Sāyaṃ bālā maññittha – natthi ārāme bhikkhū, suñño ārāmo’’ti, puna dāsiṃ āṇāpesi – ‘‘gaccha, je. Ārāmaṃ gantvā kālaṃ ārocehi – kālo, bhante, niṭṭhitaṃ bhatta’’nti."
    ],
    "innerText": "Tena kho pana samayena tassā rattiyā accayena cātuddīpiko mahāmegho pāvassi. Atha kho bhagavā bhikkhū āmantesi – ‘‘yathā, bhikkhave, jetavane vassati evaṃ catūsu dīpesu vassati. Ovassāpetha, bhikkhave, kāyaṃ. Ayaṃ pacchimako cātuddīpiko mahāmegho’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paṭissuṇitvā nikkhittacīvarā kāyaṃ ovassāpenti. Atha kho visākhā migāramātā paṇītaṃ khādanīyaṃ bhojanīyaṃ paṭiyādāpetvā dāsiṃ āṇāpesi – ‘‘gaccha, je. Ārāmaṃ gantvā kālaṃ ārocehi – kālo, bhante, niṭṭhitaṃ bhatta’’nti. ‘‘Evaṃ, ayye’’ti kho sā dāsī visākhāya migāramātuyā paṭissuṇitvā ārāmaṃ gantvā addasa bhikkhū nikkhittacīvare kāyaṃ ovassāpente, disvāna ‘natthi ārāme bhikkhū, ājīvakā kāyaṃ ovassāpentī’ti yena visākhā migāramātā tenupasaṅkami ; upasaṅkamitvā visākhaṃ migāramātaraṃ etadavoca – ‘‘natthayye, ārāme bhikkhū, ājīvakā kāyaṃ ovassāpentī’’ti. Atha kho visākhāya migāramātuyā paṇḍitāya viyattāya medhāviniyā etadahosi – ‘‘nissaṃsayaṃ kho ayyā nikkhittacīvarā kāyaṃ ovassāpenti. Sāyaṃ bālā maññittha – natthi ārāme bhikkhū, ājīvakā kāyaṃ ovassāpentī’’ti, puna dāsiṃ āṇāpesi – ‘‘gaccha, je. Ārāmaṃ gantvā kālaṃ ārocehi – kālo, bhante, niṭṭhitaṃ bhatta’’nti. Atha kho te bhikkhū gattāni sītiṃ karitvā [sītīkaritvā (syā.)] kallakāyā cīvarāni gahetvā yathāvihāraṃ pavisiṃsu. Atha kho sā dāsī ārāmaṃ gantvā bhikkhū apassantī ‘natthi ārāme bhikkhū, suñño ārāmo’ti yena visākhā migāramātā tenupasaṅkami; upasaṅkamitvā visākhaṃ migāramātaraṃ etadavoca – ‘‘natthayye, ārāme bhikkhū, suñño ārāmo’’ti. Atha kho visākhāya migāramātuyā paṇḍitāya viyattāya medhāviniyā etadahosi – ‘‘nissaṃsayaṃ kho ayyā gattāni sītiṃ karitvā kallakāyā cīvarāni gahetvā yathāvihāraṃ paviṭṭhā. Sāyaṃ bālā maññittha – natthi ārāme bhikkhū, suñño ārāmo’’ti, puna dāsiṃ āṇāpesi – ‘‘gaccha, je. Ārāmaṃ gantvā kālaṃ ārocehi – kālo, bhante, niṭṭhitaṃ bhatta’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "350"
      },
      ". Atha kho bhagavā bhikkhū āmantesi – ‘‘sandahatha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sannahatha (sī. syā.)]"
      },
      ", bhikkhave, pattacīvaraṃ; kālo bhattassā’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Atha kho bhagavā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya – seyyathāpi nāma balavā puriso sammiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya, evameva – jetavane antarahito visākhāya migāramātuyā koṭṭhake ",
      " pāturahosi. Nisīdi bhagavā paññatte āsane saddhiṃ bhikkhusaṅghena. Atha kho visākhā migāramātā – ‘‘acchariyaṃ vata bho! Abbhutaṃ vata bho! Tathāgatassa mahiddhikatā mahānubhāvatā, yatra hi nāma jaṇṇukamattesupi oghesu pavattamānesu, kaṭimattesupi oghesu pavattamānesu, na hi nāma ",
      " ekabhikkhussapi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pavattamānesu na ekabhikkhussapi (?)]"
      },
      " pādā vā cīvarāni vā allāni bhavissantī’’ti – haṭṭhā udaggā buddhappamukhaṃ bhikkhusaṅghaṃ paṇītena khādanīyena bhojanīyena sahatthā santappetvā sampavāretvā bhagavantaṃ bhuttāviṃ onītapattapāṇiṃ ekamantaṃ nisīdi. Ekamantaṃ nisinnā kho visākhā migāramātā bhagavantaṃ etadavoca – ‘‘aṭṭhāhaṃ, bhante, bhagavantaṃ varāni yācāmī’’ti. ‘‘Atikkantavarā kho, visākhe, tathāgatā’’ti. ‘‘Yāni ca, bhante, kappiyāni ",
      " yāni ca anavajjānī’’ti. ‘‘Vadehi, visākhe’’ti. ‘‘Icchāmahaṃ, bhante, saṅghassa yāvajīvaṃ vassikasāṭikaṃ dātuṃ, āgantukabhattaṃ dātuṃ, gamikabhattaṃ dātuṃ, gilānabhattaṃ dātuṃ, gilānupaṭṭhākabhattaṃ dātuṃ, gilānabhesajjaṃ dātuṃ, dhuvayāguṃ dātuṃ, bhikkhunisaṅghassa ",
      " udakasāṭikaṃ dātu’’nti. ‘‘Kiṃ pana tvaṃ, visākhe, atthavasaṃ sampassamānā tathāgataṃ aṭṭha varāni yācasī’’ti?"
    ],
    "innerText": "350. Atha kho bhagavā bhikkhū āmantesi – ‘‘sandahatha [sannahatha (sī. syā.)], bhikkhave, pattacīvaraṃ; kālo bhattassā’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Atha kho bhagavā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya – seyyathāpi nāma balavā puriso sammiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya, evameva – jetavane antarahito visākhāya migāramātuyā koṭṭhake pāturahosi. Nisīdi bhagavā paññatte āsane saddhiṃ bhikkhusaṅghena. Atha kho visākhā migāramātā – ‘‘acchariyaṃ vata bho! Abbhutaṃ vata bho! Tathāgatassa mahiddhikatā mahānubhāvatā, yatra hi nāma jaṇṇukamattesupi oghesu pavattamānesu, kaṭimattesupi oghesu pavattamānesu, na hi nāma ekabhikkhussapi [pavattamānesu na ekabhikkhussapi (?)] pādā vā cīvarāni vā allāni bhavissantī’’ti – haṭṭhā udaggā buddhappamukhaṃ bhikkhusaṅghaṃ paṇītena khādanīyena bhojanīyena sahatthā santappetvā sampavāretvā bhagavantaṃ bhuttāviṃ onītapattapāṇiṃ ekamantaṃ nisīdi. Ekamantaṃ nisinnā kho visākhā migāramātā bhagavantaṃ etadavoca – ‘‘aṭṭhāhaṃ, bhante, bhagavantaṃ varāni yācāmī’’ti. ‘‘Atikkantavarā kho, visākhe, tathāgatā’’ti. ‘‘Yāni ca, bhante, kappiyāni yāni ca anavajjānī’’ti. ‘‘Vadehi, visākhe’’ti. ‘‘Icchāmahaṃ, bhante, saṅghassa yāvajīvaṃ vassikasāṭikaṃ dātuṃ, āgantukabhattaṃ dātuṃ, gamikabhattaṃ dātuṃ, gilānabhattaṃ dātuṃ, gilānupaṭṭhākabhattaṃ dātuṃ, gilānabhesajjaṃ dātuṃ, dhuvayāguṃ dātuṃ, bhikkhunisaṅghassa udakasāṭikaṃ dātu’’nti. ‘‘Kiṃ pana tvaṃ, visākhe, atthavasaṃ sampassamānā tathāgataṃ aṭṭha varāni yācasī’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idhāhaṃ, bhante, dāsiṃ āṇāpesiṃ – ‘gaccha, je. Ārāmaṃ gantvā kālaṃ ārocehi – kālo, bhante, niṭṭhitaṃ bhatta’’’nti. Atha kho sā, bhante, dāsī ārāmaṃ gantvā addasa bhikkhū nikkhittacīvare kāyaṃ ovassāpente, disvāna ",
      " ‘‘natthi ārāme bhikkhū, ājīvakā kāyaṃ ovassāpentī’’ti yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ etadavoca – ‘‘natthayye, ārāme bhikkhū, ājīvakā kāyaṃ ovassāpentī’’ti. Asuci, bhante, naggiyaṃ jegucchaṃ paṭikūlaṃ. Imāhaṃ, bhante, atthavasaṃ sampassamānā icchāmi saṅghassa yāvajīvaṃ vassikasāṭikaṃ dātuṃ."
    ],
    "innerText": "‘‘Idhāhaṃ, bhante, dāsiṃ āṇāpesiṃ – ‘gaccha, je. Ārāmaṃ gantvā kālaṃ ārocehi – kālo, bhante, niṭṭhitaṃ bhatta’’’nti. Atha kho sā, bhante, dāsī ārāmaṃ gantvā addasa bhikkhū nikkhittacīvare kāyaṃ ovassāpente, disvāna ‘‘natthi ārāme bhikkhū, ājīvakā kāyaṃ ovassāpentī’’ti yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ etadavoca – ‘‘natthayye, ārāme bhikkhū, ājīvakā kāyaṃ ovassāpentī’’ti. Asuci, bhante, naggiyaṃ jegucchaṃ paṭikūlaṃ. Imāhaṃ, bhante, atthavasaṃ sampassamānā icchāmi saṅghassa yāvajīvaṃ vassikasāṭikaṃ dātuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, bhante, āgantuko bhikkhu na vīthikusalo na gocarakusalo kilanto piṇḍāya carati. So me āgantukabhattaṃ bhuñjitvā vīthikusalo gocarakusalo akilanto piṇḍāya carissati. Imāhaṃ, bhante, atthavasaṃ sampassamānā icchāmi saṅghassa yāvajīvaṃ āgantukabhattaṃ dātuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, bhante, gamiko bhikkhu attano bhattaṃ pariyesamāno satthā vā vihāyissati, yattha vā vāsaṃ gantukāmo bhavissati tattha vikāle upagacchissati, kilanto addhānaṃ gamissati. So me gamikabhattaṃ bhuñjitvā satthā na vihāyissati, yattha vāsaṃ gantukāmo bhavissati tattha kāle upagacchissati, akilanto addhānaṃ gamissati. Imāhaṃ, bhante, atthavasaṃ sampassamānā icchāmi saṅghassa yāvajīvaṃ gamikabhattaṃ dātuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, bhante, gilānassa bhikkhuno sappāyāni bhojanāni alabhantassa ābādho vā abhivaḍḍhissati, kālaṃkiriyā vā bhavissati. Tassa me gilānabhattaṃ bhuttassa ābādho ",
      " na abhivaḍḍhissati, kālaṃkiriyā na bhavissati. Imāhaṃ, bhante, atthavasaṃ sampassamānā icchāmi saṅghassa yāvajīvaṃ gilānabhattaṃ dātuṃ ",
      ". ‘‘Puna ",
      " caparaṃ, bhante, gilānupaṭṭhāko bhikkhu attano bhattaṃ pariyesamāno gilānassa ussūre bhattaṃ nīharissati, bhattacchedaṃ karissati. So me gilānupaṭṭhākabhattaṃ bhuñjitvā gilānassa ",
      " kālena bhattaṃ nīharissati, bhattacchedaṃ na karissati. Imāhaṃ, bhante, atthavasaṃ sampassamānā icchāmi saṅghassa yāvajīvaṃ gilānupaṭṭhākabhattaṃ dātuṃ."
    ],
    "innerText": "‘‘Puna caparaṃ, bhante, gilānassa bhikkhuno sappāyāni bhojanāni alabhantassa ābādho vā abhivaḍḍhissati, kālaṃkiriyā vā bhavissati. Tassa me gilānabhattaṃ bhuttassa ābādho na abhivaḍḍhissati, kālaṃkiriyā na bhavissati. Imāhaṃ, bhante, atthavasaṃ sampassamānā icchāmi saṅghassa yāvajīvaṃ gilānabhattaṃ dātuṃ . ‘‘Puna caparaṃ, bhante, gilānupaṭṭhāko bhikkhu attano bhattaṃ pariyesamāno gilānassa ussūre bhattaṃ nīharissati, bhattacchedaṃ karissati. So me gilānupaṭṭhākabhattaṃ bhuñjitvā gilānassa kālena bhattaṃ nīharissati, bhattacchedaṃ na karissati. Imāhaṃ, bhante, atthavasaṃ sampassamānā icchāmi saṅghassa yāvajīvaṃ gilānupaṭṭhākabhattaṃ dātuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, bhante, gilānassa bhikkhuno sappāyāni bhesajjāni alabhantassa ābādho vā abhivaḍḍhissati, kālaṃkiriyā vā bhavissati. Tassa me gilānabhesajjaṃ paribhuttassa ābādho na abhivaḍḍhissati, kālaṃkiriyā na bhavissati. Imāhaṃ, bhante, atthavasaṃ sampassamānā icchāmi saṅghassa yāvajīvaṃ gilānabhesajjaṃ dātuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, bhante, bhagavatā andhakavinde dasānisaṃse sampassamānena yāgu anuññātā. Tyāhaṃ, bhante, ānisaṃse sampassamānā icchāmi saṅghassa yāvajīvaṃ dhuvayāguṃ dātuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idha, bhante, bhikkhuniyo aciravatiyā nadiyā vesiyāhi saddhiṃ naggā ekatitthe nahāyanti. Tā, bhante, vesiyā bhikkhuniyo uppaṇḍesuṃ – ‘kiṃ nu kho nāma tumhākaṃ, ayye, daharānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[daharānaṃ daharānaṃ (sī.)]"
      },
      " brahmacariyaṃ ciṇṇena, nanu nāma kāmā paribhuñjitabbā; yadā jiṇṇā bhavissatha tadā brahmacariyaṃ carissatha. Evaṃ tumhākaṃ ubho atthā pariggahitā bhavissantī’ti. Tā, bhante, bhikkhuniyo vesiyāhi uppaṇḍiyamānā maṅkū ahesuṃ. Asuci, bhante, mātugāmassa naggiyaṃ jegucchaṃ paṭikūlaṃ. Imāhaṃ, bhante, atthavasaṃ sampassamānā icchāmi bhikkhunisaṅghassa ",
      " yāvajīvaṃ udakasāṭikaṃ dātu’’nti."
    ],
    "innerText": "‘‘Idha, bhante, bhikkhuniyo aciravatiyā nadiyā vesiyāhi saddhiṃ naggā ekatitthe nahāyanti. Tā, bhante, vesiyā bhikkhuniyo uppaṇḍesuṃ – ‘kiṃ nu kho nāma tumhākaṃ, ayye, daharānaṃ [daharānaṃ daharānaṃ (sī.)] brahmacariyaṃ ciṇṇena, nanu nāma kāmā paribhuñjitabbā; yadā jiṇṇā bhavissatha tadā brahmacariyaṃ carissatha. Evaṃ tumhākaṃ ubho atthā pariggahitā bhavissantī’ti. Tā, bhante, bhikkhuniyo vesiyāhi uppaṇḍiyamānā maṅkū ahesuṃ. Asuci, bhante, mātugāmassa naggiyaṃ jegucchaṃ paṭikūlaṃ. Imāhaṃ, bhante, atthavasaṃ sampassamānā icchāmi bhikkhunisaṅghassa yāvajīvaṃ udakasāṭikaṃ dātu’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "351"
      },
      ". ‘‘Kiṃ pana tvaṃ, visākhe, ānisaṃsaṃ sampassamānā tathāgataṃ aṭṭha varāni yācasī’’ti? ‘‘Idha, bhante, disāsu vassaṃvuṭṭhā bhikkhū sāvatthiṃ āgacchissanti bhagavantaṃ dassanāya. Te bhagavantaṃ upasaṅkamitvā pucchissanti – ‘itthannāmo, bhante, bhikkhu kālaṅkato, tassa kā gati ko abhisamparāyo’ti? Taṃ bhagavā byākarissati sotāpattiphale vā sakadāgāmiphale vā anāgāmiphale vā arahatte vā. Tyāhaṃ upasaṅkamitvā pucchissāmi – ‘āgatapubbā nu kho, bhante, tena ayyena sāvatthī’ti? Sace me ",
      " vakkhanti – ‘āgatapubbā tena bhikkhunā sāvatthī’ti niṭṭhamettha ",
      " gacchissāmi – nissaṃsayaṃ me paribhuttaṃ tena ayyena vassikasāṭikā vā āgantukabhattaṃ vā gamikabhattaṃ vā gilānabhattaṃ vā gilānupaṭṭhākabhattaṃ vā gilānabhesajjaṃ vā dhuvayāgu vāti. Tassā me tadanussarantiyā pāmujjaṃ jāyissati, pamuditāya pīti jāyissati, pītimanāya kāyo passambhissati, passaddhakāyā sukhaṃ ",
      " vediyissāmi, sukhiniyā cittaṃ samādhiyissati. Sā me bhavissati indriyabhāvanā balabhāvanā bojjhaṅgabhāvanā. Imāhaṃ, bhante, ānisaṃsaṃ sampassamānā tathāgataṃ aṭṭha varāni yācāmī’’ti. ‘‘Sādhu sādhu, visākhe; sādhu kho tvaṃ, visākhe, imaṃ ānisaṃsaṃ sampassamānā tathāgataṃ aṭṭha varāni yācasi. Anujānāmi te, visākhe, aṭṭha varānī’’ti. Atha kho bhagavā visākhaṃ migāramātaraṃ imāhi ",
      " gāthāhi anumodi –"
    ],
    "innerText": "351. ‘‘Kiṃ pana tvaṃ, visākhe, ānisaṃsaṃ sampassamānā tathāgataṃ aṭṭha varāni yācasī’’ti? ‘‘Idha, bhante, disāsu vassaṃvuṭṭhā bhikkhū sāvatthiṃ āgacchissanti bhagavantaṃ dassanāya. Te bhagavantaṃ upasaṅkamitvā pucchissanti – ‘itthannāmo, bhante, bhikkhu kālaṅkato, tassa kā gati ko abhisamparāyo’ti? Taṃ bhagavā byākarissati sotāpattiphale vā sakadāgāmiphale vā anāgāmiphale vā arahatte vā. Tyāhaṃ upasaṅkamitvā pucchissāmi – ‘āgatapubbā nu kho, bhante, tena ayyena sāvatthī’ti? Sace me vakkhanti – ‘āgatapubbā tena bhikkhunā sāvatthī’ti niṭṭhamettha gacchissāmi – nissaṃsayaṃ me paribhuttaṃ tena ayyena vassikasāṭikā vā āgantukabhattaṃ vā gamikabhattaṃ vā gilānabhattaṃ vā gilānupaṭṭhākabhattaṃ vā gilānabhesajjaṃ vā dhuvayāgu vāti. Tassā me tadanussarantiyā pāmujjaṃ jāyissati, pamuditāya pīti jāyissati, pītimanāya kāyo passambhissati, passaddhakāyā sukhaṃ vediyissāmi, sukhiniyā cittaṃ samādhiyissati. Sā me bhavissati indriyabhāvanā balabhāvanā bojjhaṅgabhāvanā. Imāhaṃ, bhante, ānisaṃsaṃ sampassamānā tathāgataṃ aṭṭha varāni yācāmī’’ti. ‘‘Sādhu sādhu, visākhe; sādhu kho tvaṃ, visākhe, imaṃ ānisaṃsaṃ sampassamānā tathāgataṃ aṭṭha varāni yācasi. Anujānāmi te, visākhe, aṭṭha varānī’’ti. Atha kho bhagavā visākhaṃ migāramātaraṃ imāhi gāthāhi anumodi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Yā annapānaṃ dadatippamoditā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Sīlūpapannā sugatassa sāvikā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Dadāti dānaṃ abhibhuyya maccharaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sovaggikaṃ sokanudaṃ sukhāvahaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Dibbaṃ sā labhate āyuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[dibbaṃ balaṃ sā labhate ca āyuṃ (sī. syā.)]"
      },
      ";"
    ],
    "innerText": "‘‘Dibbaṃ sā labhate āyuṃ [dibbaṃ balaṃ sā labhate ca āyuṃ (sī. syā.)];"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Āgamma maggaṃ virajaṃ anaṅgaṇaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Sā puññakāmā sukhinī anāmayā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Saggamhi kāyamhi ciraṃ pamodatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "352"
      },
      ". Atha kho bhagavā visākhaṃ migāramātaraṃ imāhi gāthāhi anumoditvā uṭṭhāyāsanā pakkāmi. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘anujānāmi, bhikkhave, vassikasāṭikaṃ, āgantukabhattaṃ, gamikabhattaṃ, gilānabhattaṃ, gilānupaṭṭhākabhattaṃ, gilānabhesajjaṃ, dhuvayāguṃ, bhikkhunisaṅghassa udakasāṭika’’nti."
    ],
    "innerText": "352. Atha kho bhagavā visākhaṃ migāramātaraṃ imāhi gāthāhi anumoditvā uṭṭhāyāsanā pakkāmi. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘anujānāmi, bhikkhave, vassikasāṭikaṃ, āgantukabhattaṃ, gamikabhattaṃ, gilānabhattaṃ, gilānupaṭṭhākabhattaṃ, gilānabhesajjaṃ, dhuvayāguṃ, bhikkhunisaṅghassa udakasāṭika’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Visākhāvatthu niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Visākhābhāṇavāro niṭṭhito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "220. Nisīdanādianujānanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "353"
      },
      ". Tena ",
      " kho pana samayena bhikkhū paṇītāni bhojanāni bhuñjitvā muṭṭhassatī asampajānā niddaṃ okkamanti. Tesaṃ muṭṭhassatīnaṃ asampajānānaṃ niddaṃ okkamantānaṃ supinantena asuci muccati, senāsanaṃ asucinā makkhiyati. Atha kho bhagavā āyasmatā ānandena pacchāsamaṇena senāsanacārikaṃ āhiṇḍanto addasa senāsanaṃ ",
      " asucinā makkhitaṃ, disvāna ",
      " āyasmantaṃ ānandaṃ āmantesi – ‘‘kiṃ etaṃ, ānanda, senāsanaṃ makkhita’’nti? ‘‘Etarahi, bhante, bhikkhū paṇītāni bhojanāni ",
      " bhuñjitvā muṭṭhassatī asampajānā niddaṃ okkamanti. Tesaṃ muṭṭhassatīnaṃ asampajānānaṃ niddaṃ okkamantānaṃ supinantena asuci muccati; tayidaṃ, bhagavā, senāsanaṃ asucinā makkhita’’nti. ‘‘Evametaṃ, ānanda, evametaṃ, ānanda. Muccati hi, ānanda, muṭṭhassatīnaṃ asampajānānaṃ niddaṃ okkamantānaṃ supinantena asuci. Ye te, ānanda, bhikkhū upaṭṭhitassatī sampajānā niddaṃ okkamanti, tesaṃ asuci na muccati. Yepi te, ānanda, puthujjanā kāmesu vītarāgā, tesampi asuci na muccati. Aṭṭhānametaṃ, ānanda, anavakāso yaṃ arahato asuci mucceyyā’’ti. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘idhāhaṃ, bhikkhave, ānandena pacchāsamaṇena senāsanacārikaṃ āhiṇḍanto addasaṃ senāsanaṃ asucinā makkhitaṃ, disvāna ānandaṃ āmantesiṃ ‘kiṃ etaṃ, ānanda, senāsanaṃ makkhita’nti? ‘Etarahi, bhante, bhikkhū paṇītāni bhojanāni bhuñjitvā muṭṭhassatī asampajānā niddaṃ okkamanti. Tesaṃ muṭṭhassatīnaṃ asampajānānaṃ niddaṃ okkamantānaṃ supinantena asuci muccati; tayidaṃ, bhagavā, senāsanaṃ asucinā makkhita’nti. ‘Evametaṃ, ānanda, evametaṃ, ānanda, muccati hi, ānanda, muṭṭhassatīnaṃ asampajānānaṃ niddaṃ okkamantānaṃ supinantena ",
      " asuci. Ye te, ānanda, bhikkhū upaṭṭhitassatī sampajānā niddaṃ okkamanti, tesaṃ asuci na muccati. Yepi te, ānanda, puthujjanā kāmesu vītarāgā tesampi asuci na muccati. Aṭṭhānametaṃ, ānanda, anavakāso yaṃ arahato asuci mucceyyā’’’ti."
    ],
    "innerText": "353. Tena kho pana samayena bhikkhū paṇītāni bhojanāni bhuñjitvā muṭṭhassatī asampajānā niddaṃ okkamanti. Tesaṃ muṭṭhassatīnaṃ asampajānānaṃ niddaṃ okkamantānaṃ supinantena asuci muccati, senāsanaṃ asucinā makkhiyati. Atha kho bhagavā āyasmatā ānandena pacchāsamaṇena senāsanacārikaṃ āhiṇḍanto addasa senāsanaṃ asucinā makkhitaṃ, disvāna āyasmantaṃ ānandaṃ āmantesi – ‘‘kiṃ etaṃ, ānanda, senāsanaṃ makkhita’’nti? ‘‘Etarahi, bhante, bhikkhū paṇītāni bhojanāni bhuñjitvā muṭṭhassatī asampajānā niddaṃ okkamanti. Tesaṃ muṭṭhassatīnaṃ asampajānānaṃ niddaṃ okkamantānaṃ supinantena asuci muccati; tayidaṃ, bhagavā, senāsanaṃ asucinā makkhita’’nti. ‘‘Evametaṃ, ānanda, evametaṃ, ānanda. Muccati hi, ānanda, muṭṭhassatīnaṃ asampajānānaṃ niddaṃ okkamantānaṃ supinantena asuci. Ye te, ānanda, bhikkhū upaṭṭhitassatī sampajānā niddaṃ okkamanti, tesaṃ asuci na muccati. Yepi te, ānanda, puthujjanā kāmesu vītarāgā, tesampi asuci na muccati. Aṭṭhānametaṃ, ānanda, anavakāso yaṃ arahato asuci mucceyyā’’ti. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘idhāhaṃ, bhikkhave, ānandena pacchāsamaṇena senāsanacārikaṃ āhiṇḍanto addasaṃ senāsanaṃ asucinā makkhitaṃ, disvāna ānandaṃ āmantesiṃ ‘kiṃ etaṃ, ānanda, senāsanaṃ makkhita’nti? ‘Etarahi, bhante, bhikkhū paṇītāni bhojanāni bhuñjitvā muṭṭhassatī asampajānā niddaṃ okkamanti. Tesaṃ muṭṭhassatīnaṃ asampajānānaṃ niddaṃ okkamantānaṃ supinantena asuci muccati; tayidaṃ, bhagavā, senāsanaṃ asucinā makkhita’nti. ‘Evametaṃ, ānanda, evametaṃ, ānanda, muccati hi, ānanda, muṭṭhassatīnaṃ asampajānānaṃ niddaṃ okkamantānaṃ supinantena asuci. Ye te, ānanda, bhikkhū upaṭṭhitassatī sampajānā niddaṃ okkamanti, tesaṃ asuci na muccati. Yepi te, ānanda, puthujjanā kāmesu vītarāgā tesampi asuci na muccati. Aṭṭhānametaṃ, ānanda, anavakāso yaṃ arahato asuci mucceyyā’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Pañcime, bhikkhave, ādīnavā muṭṭhassatissa asampajānassa niddaṃ okkamato – dukkhaṃ supati, dukkhaṃ paṭibujjhati, pāpakaṃ supinaṃ passati, devatā na rakkhanti, asuci muccati. Ime kho, bhikkhave, pañca ādīnavā muṭṭhassatissa asampajānassa niddaṃ okkamato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Pañcime ",
      ", bhikkhave, ānisaṃsā upaṭṭhitassatissa sampajānassa niddaṃ okkamato – sukhaṃ supati, sukhaṃ paṭibujjhati, na pāpakaṃ supinaṃ passati, devatā rakkhanti, asuci na muccati. Ime kho, bhikkhave, pañca ānisaṃsā upaṭṭhitassatissa sampajānassa niddaṃ okkamato."
    ],
    "innerText": "‘‘Pañcime , bhikkhave, ānisaṃsā upaṭṭhitassatissa sampajānassa niddaṃ okkamato – sukhaṃ supati, sukhaṃ paṭibujjhati, na pāpakaṃ supinaṃ passati, devatā rakkhanti, asuci na muccati. Ime kho, bhikkhave, pañca ānisaṃsā upaṭṭhitassatissa sampajānassa niddaṃ okkamato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Anujānāmi, bhikkhave, kāyaguttiyā cīvaraguttiyā senāsanaguttiyā nisīdana’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena ",
      " kho pana samayena atikhuddakaṃ nisīdanaṃ na sabbaṃ senāsanaṃ saṃgopeti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, yāvamahantaṃ paccattharaṇaṃ ākaṅkhati tāvamahantaṃ paccattharaṇaṃ kātunti."
    ],
    "innerText": "Tena kho pana samayena atikhuddakaṃ nisīdanaṃ na sabbaṃ senāsanaṃ saṃgopeti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, yāvamahantaṃ paccattharaṇaṃ ākaṅkhati tāvamahantaṃ paccattharaṇaṃ kātunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "354"
      },
      ". Tena kho pana samayena āyasmato ānandassa upajjhāyassa āyasmato belaṭṭhasīsassa thullakacchābādho hoti. Tassa lasikāya cīvarāni kāye lagganti. Tāni bhikkhū udakena temetvā temetvā apakaḍḍhanti. Addasā kho bhagavā senāsanacārikaṃ āhiṇḍanto te ",
      " bhikkhū tāni cīvarāni udakena temetvā temetvā apakaḍḍhante, disvāna yena te bhikkhū tenupasaṅkami, upaṅkamitvā te bhikkhū etadavoca – ‘‘kiṃ imassa, bhikkhave, bhikkhuno ābādho’’ti? ‘‘Imassa, bhante, āyasmato ",
      " thullakacchābādho. Lasikāya cīvarāni kāye lagganti. Tāni mayaṃ udakena temetvā temetvā apakaḍḍhāmā’’ti. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘anujānāmi, bhikkhave, yassa kaṇḍu vā piḷakā vā assāvo vā thullakacchu vā ābādho kaṇḍuppaṭicchādi’’nti."
    ],
    "innerText": "354. Tena kho pana samayena āyasmato ānandassa upajjhāyassa āyasmato belaṭṭhasīsassa thullakacchābādho hoti. Tassa lasikāya cīvarāni kāye lagganti. Tāni bhikkhū udakena temetvā temetvā apakaḍḍhanti. Addasā kho bhagavā senāsanacārikaṃ āhiṇḍanto te bhikkhū tāni cīvarāni udakena temetvā temetvā apakaḍḍhante, disvāna yena te bhikkhū tenupasaṅkami, upaṅkamitvā te bhikkhū etadavoca – ‘‘kiṃ imassa, bhikkhave, bhikkhuno ābādho’’ti? ‘‘Imassa, bhante, āyasmato thullakacchābādho. Lasikāya cīvarāni kāye lagganti. Tāni mayaṃ udakena temetvā temetvā apakaḍḍhāmā’’ti. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘anujānāmi, bhikkhave, yassa kaṇḍu vā piḷakā vā assāvo vā thullakacchu vā ābādho kaṇḍuppaṭicchādi’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "355"
      },
      ". Atha kho visākhā migāramātā mukhapuñchanacoḷaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mukhapuñjanacoḷaṃ (ka.)]"
      },
      " ādāya yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnā kho visākhā migāramātā bhagavantaṃ etadavoca – ‘‘paṭiggaṇhātu me, bhante, bhagavā mukhapuñchanacoḷaṃ, yaṃ mamassa dīgharattaṃ hitāya sukhāyā’’ti. Paṭiggahesi bhagavā mukhapuñchanacoḷaṃ. Atha kho bhagavā visākhaṃ migāramātaraṃ dhammiyā kathāya sandassesi samādapesi samuttejesi sampahaṃsesi. Atha kho visākhā migāramātā bhagavatā dhammiyā ",
      " kathāya sandassitā samādapitā samuttejitā sampahaṃsitā uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘anujānāmi, bhikkhave, mukhapuñchanacoḷaka’’nti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mukhapuñchanacolanti (syā.)]"
      },
      "."
    ],
    "innerText": "355. Atha kho visākhā migāramātā mukhapuñchanacoḷaṃ [mukhapuñjanacoḷaṃ (ka.)] ādāya yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnā kho visākhā migāramātā bhagavantaṃ etadavoca – ‘‘paṭiggaṇhātu me, bhante, bhagavā mukhapuñchanacoḷaṃ, yaṃ mamassa dīgharattaṃ hitāya sukhāyā’’ti. Paṭiggahesi bhagavā mukhapuñchanacoḷaṃ. Atha kho bhagavā visākhaṃ migāramātaraṃ dhammiyā kathāya sandassesi samādapesi samuttejesi sampahaṃsesi. Atha kho visākhā migāramātā bhagavatā dhammiyā kathāya sandassitā samādapitā samuttejitā sampahaṃsitā uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘anujānāmi, bhikkhave, mukhapuñchanacoḷaka’’nti [mukhapuñchanacolanti (syā.)]."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "356"
      },
      ". Tena ",
      " kho pana samayena rojo mallo āyasmato ānandassa sahāyo hoti. Rojassa mallassa khomapilotikā āyasmato ānandassa hatthe nikkhittā hoti. Āyasmato ca ānandassa khomapilotikāya attho hoti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, pañcahaṅgehi samannāgatassa vissāsaṃ gahetuṃ – sandiṭṭho ca hoti, sambhatto ca, ālapito ",
      " ca, jīvati ca, jānāti ca, gahite me attamano bhavissatīti. Anujānāmi, bhikkhave, imehi pañcahaṅgehi samannāgatassa vissāsaṃ gahetunti."
    ],
    "innerText": "356. Tena kho pana samayena rojo mallo āyasmato ānandassa sahāyo hoti. Rojassa mallassa khomapilotikā āyasmato ānandassa hatthe nikkhittā hoti. Āyasmato ca ānandassa khomapilotikāya attho hoti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, pañcahaṅgehi samannāgatassa vissāsaṃ gahetuṃ – sandiṭṭho ca hoti, sambhatto ca, ālapito ca, jīvati ca, jānāti ca, gahite me attamano bhavissatīti. Anujānāmi, bhikkhave, imehi pañcahaṅgehi samannāgatassa vissāsaṃ gahetunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "357"
      },
      ". Tena kho pana samayena bhikkhūnaṃ paripuṇṇaṃ hoti ticīvaraṃ. Attho ca hoti parissāvanehipi thavikāhipi. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, parikkhāracoḷakanti."
    ],
    "innerText": "357. Tena kho pana samayena bhikkhūnaṃ paripuṇṇaṃ hoti ticīvaraṃ. Attho ca hoti parissāvanehipi thavikāhipi. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, parikkhāracoḷakanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Nisīdanādianujānanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "221. Pacchimavikappanupagacīvarādikathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "358"
      },
      ". Atha kho bhikkhūnaṃ etadahosi – ‘‘yāni tāni bhagavatā anuññātāni ticīvaranti vā vassikasāṭikāti vā nisīdananti vā paccattharaṇanti vā kaṇḍuppaṭicchādīti ",
      " vā mukhapuñchanacoḷanti vā parikkhāracoḷanti vā, sabbāni tāni adhiṭṭhātabbāni nu kho, udāhu, vikappetabbānī’’ti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, ticīvaraṃ adhiṭṭhātuṃ na vikappetuṃ; vassikasāṭikaṃ vassānaṃ cātumāsaṃ adhiṭṭhātuṃ, tato paraṃ vikappetuṃ; nisīdanaṃ adhiṭṭhātuṃ na vikappetuṃ; paccattharaṇaṃ adhiṭṭhātuṃ ",
      " na vikappetuṃ; kaṇḍuppaṭicchādiṃ yāvaābādhā adhiṭṭhātuṃ tato paraṃ vikappetuṃ; mukhapuñchanacoḷaṃ adhiṭṭhātuṃ na vikappetuṃ; parikkhāracoḷaṃ adhiṭṭhātuṃ na vikappetunti."
    ],
    "innerText": "358. Atha kho bhikkhūnaṃ etadahosi – ‘‘yāni tāni bhagavatā anuññātāni ticīvaranti vā vassikasāṭikāti vā nisīdananti vā paccattharaṇanti vā kaṇḍuppaṭicchādīti vā mukhapuñchanacoḷanti vā parikkhāracoḷanti vā, sabbāni tāni adhiṭṭhātabbāni nu kho, udāhu, vikappetabbānī’’ti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, ticīvaraṃ adhiṭṭhātuṃ na vikappetuṃ; vassikasāṭikaṃ vassānaṃ cātumāsaṃ adhiṭṭhātuṃ, tato paraṃ vikappetuṃ; nisīdanaṃ adhiṭṭhātuṃ na vikappetuṃ; paccattharaṇaṃ adhiṭṭhātuṃ na vikappetuṃ; kaṇḍuppaṭicchādiṃ yāvaābādhā adhiṭṭhātuṃ tato paraṃ vikappetuṃ; mukhapuñchanacoḷaṃ adhiṭṭhātuṃ na vikappetuṃ; parikkhāracoḷaṃ adhiṭṭhātuṃ na vikappetunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " kho bhikkhūnaṃ etadahosi – ‘‘kittakaṃ pacchimaṃ nu kho cīvaraṃ vikappetabba’’nti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, āyāmena aṭṭhaṅgulaṃ sugataṅgulena caturaṅgulavitthataṃ pacchimaṃ cīvaraṃ vikappetunti."
    ],
    "innerText": "Atha kho bhikkhūnaṃ etadahosi – ‘‘kittakaṃ pacchimaṃ nu kho cīvaraṃ vikappetabba’’nti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, āyāmena aṭṭhaṅgulaṃ sugataṅgulena caturaṅgulavitthataṃ pacchimaṃ cīvaraṃ vikappetunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "359"
      },
      ". Tena kho pana samayena āyasmato mahākassapassa paṃsukūlakato garuko hoti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, suttalūkhaṃ kātunti. Vikaṇṇo hoti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, vikaṇṇaṃ uddharitunti. Suttā okiriyanti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, anuvātaṃ paribhaṇḍaṃ āropetunti."
    ],
    "innerText": "359. Tena kho pana samayena āyasmato mahākassapassa paṃsukūlakato garuko hoti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, suttalūkhaṃ kātunti. Vikaṇṇo hoti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, vikaṇṇaṃ uddharitunti. Suttā okiriyanti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, anuvātaṃ paribhaṇḍaṃ āropetunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena ",
      " kho pana samayena saṅghāṭiyā pattā lujjanti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, aṭṭhapadakaṃ kātunti."
    ],
    "innerText": "Tena kho pana samayena saṅghāṭiyā pattā lujjanti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, aṭṭhapadakaṃ kātunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "360"
      },
      ". Tena kho pana samayena aññatarassa bhikkhuno ticīvare kayiramāne sabbaṃ chinnakaṃ nappahoti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, dve chinnakāni ekaṃ acchinnakanti."
    ],
    "innerText": "360. Tena kho pana samayena aññatarassa bhikkhuno ticīvare kayiramāne sabbaṃ chinnakaṃ nappahoti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, dve chinnakāni ekaṃ acchinnakanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dve chinnakāni ekaṃ acchinnakaṃ nappahoti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, dve acchinnakāni ekaṃ chinnakanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dve acchinnakāni ",
      " ekaṃ chinnakaṃ nappahoti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, anvādhikampi āropetuṃ, na ca, bhikkhave, sabbaṃ acchinnakaṃ dhāretabbaṃ. Yo dhāreyya, āpatti dukkaṭassāti."
    ],
    "innerText": "Dve acchinnakāni ekaṃ chinnakaṃ nappahoti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, anvādhikampi āropetuṃ, na ca, bhikkhave, sabbaṃ acchinnakaṃ dhāretabbaṃ. Yo dhāreyya, āpatti dukkaṭassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "361"
      },
      ". Tena kho pana samayena aññatarassa bhikkhuno bahuṃ cīvaraṃ uppannaṃ hoti. So ca taṃ cīvaraṃ mātāpitūnaṃ dātukāmo hoti. Bhagavato etamatthaṃ ārocesuṃ. Mātāpitaroti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mātāpitūnaṃ kho (sī.)]"
      },
      " kho, bhikkhave, dadamāne ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vadamāno (ka.), vadamāne (?)]"
      },
      " kiṃ vadeyyāma? Anujānāmi ",
      ", bhikkhave, mātāpitūnaṃ dātuṃ. Na ca, bhikkhave, saddhādeyyaṃ vinipātetabbaṃ. Yo vinipāteyya, āpatti dukkaṭassāti."
    ],
    "innerText": "361. Tena kho pana samayena aññatarassa bhikkhuno bahuṃ cīvaraṃ uppannaṃ hoti. So ca taṃ cīvaraṃ mātāpitūnaṃ dātukāmo hoti. Bhagavato etamatthaṃ ārocesuṃ. Mātāpitaroti [mātāpitūnaṃ kho (sī.)] kho, bhikkhave, dadamāne [vadamāno (ka.), vadamāne (?)] kiṃ vadeyyāma? Anujānāmi , bhikkhave, mātāpitūnaṃ dātuṃ. Na ca, bhikkhave, saddhādeyyaṃ vinipātetabbaṃ. Yo vinipāteyya, āpatti dukkaṭassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "362"
      },
      ". Tena ",
      " kho pana samayena aññataro bhikkhu andhavane cīvaraṃ nikkhipitvā santaruttarena gāmaṃ piṇḍāya pāvisi. Corā taṃ cīvaraṃ avahariṃsu. So bhikkhu duccoḷo hoti lūkhacīvaro. Bhikkhū evamāhaṃsu – ‘‘kissa tvaṃ, āvuso, duccoḷo lūkhacīvarosī’’ti? ‘‘Idhāhaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[so ahaṃ (katthaci)]"
      },
      ", āvuso, andhavane cīvaraṃ nikkhipitvā santaruttarena gāmaṃ piṇḍāya pāvisiṃ. Corā taṃ cīvaraṃ avahariṃsu. Tenāhaṃ duccoḷo lūkhacīvaro’’ti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, santaruttarena gāmo pavisitabbo. Yo paviseyya, āpatti dukkaṭassāti."
    ],
    "innerText": "362. Tena kho pana samayena aññataro bhikkhu andhavane cīvaraṃ nikkhipitvā santaruttarena gāmaṃ piṇḍāya pāvisi. Corā taṃ cīvaraṃ avahariṃsu. So bhikkhu duccoḷo hoti lūkhacīvaro. Bhikkhū evamāhaṃsu – ‘‘kissa tvaṃ, āvuso, duccoḷo lūkhacīvarosī’’ti? ‘‘Idhāhaṃ [so ahaṃ (katthaci)], āvuso, andhavane cīvaraṃ nikkhipitvā santaruttarena gāmaṃ piṇḍāya pāvisiṃ. Corā taṃ cīvaraṃ avahariṃsu. Tenāhaṃ duccoḷo lūkhacīvaro’’ti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, santaruttarena gāmo pavisitabbo. Yo paviseyya, āpatti dukkaṭassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena kho pana samayena āyasmā ānando assatiyā santaruttarena gāmaṃ piṇḍāya pāvisi. Bhikkhū āyasmantaṃ ānandaṃ etadavocuṃ – ‘‘nanu ",
      ", āvuso ānanda, bhagavatā paññattaṃ – ‘na santaruttarena gāmo pavisitabbo’ti? Kissa tvaṃ, āvuso ānanda, santaruttarena ",
      " gāmaṃ paviṭṭho’’ti? ‘‘Saccaṃ, āvuso, bhagavatā paññattaṃ – ‘na santaruttarena gāmo pavisitabbo’ti. Api cāhaṃ assatiyā paviṭṭho’’ti. Bhagavato etamatthaṃ ārocesuṃ."
    ],
    "innerText": "Tena kho pana samayena āyasmā ānando assatiyā santaruttarena gāmaṃ piṇḍāya pāvisi. Bhikkhū āyasmantaṃ ānandaṃ etadavocuṃ – ‘‘nanu , āvuso ānanda, bhagavatā paññattaṃ – ‘na santaruttarena gāmo pavisitabbo’ti? Kissa tvaṃ, āvuso ānanda, santaruttarena gāmaṃ paviṭṭho’’ti? ‘‘Saccaṃ, āvuso, bhagavatā paññattaṃ – ‘na santaruttarena gāmo pavisitabbo’ti. Api cāhaṃ assatiyā paviṭṭho’’ti. Bhagavato etamatthaṃ ārocesuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Pañcime, bhikkhave, paccayā saṅghāṭiyā nikkhepāya – gilāno vā hoti, vassikasaṅketaṃ vā hoti, nadīpāraṃ gantuṃ vā hoti, aggaḷaguttivihāro vā hoti, atthatakathinaṃ vā hoti. Ime kho, bhikkhave, pañca paccayā saṅghāṭiyā nikkhepāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Pañcime, bhikkhave, paccayā uttarāsaṅgassa nikkhepāya…pe… antaravāsakassa nikkhepāya – gilāno vā hoti, vassikasaṅketaṃ vā hoti, nadīpāraṃ gantuṃ vā hoti, aggaḷaguttivihāro vā hoti, atthatakathinaṃ vā hoti. Ime kho, bhikkhave, pañca paccayā uttarāsaṅgassa antaravāsakassa nikkhepāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pañcime, bhikkhave, paccayā vassikasāṭikāya nikkhepāya – gilāno vā hoti, nissīmaṃ gantuṃ vā hoti, nadīpāraṃ gantuṃ vā hoti, aggaḷaguttivihāro vā hoti, vassikasāṭikā akatā vā hoti vippakatā ",
      " vā. Ime kho, bhikkhave, pañca paccayā vassikasāṭikāya nikkhepāyāti."
    ],
    "innerText": "Pañcime, bhikkhave, paccayā vassikasāṭikāya nikkhepāya – gilāno vā hoti, nissīmaṃ gantuṃ vā hoti, nadīpāraṃ gantuṃ vā hoti, aggaḷaguttivihāro vā hoti, vassikasāṭikā akatā vā hoti vippakatā vā. Ime kho, bhikkhave, pañca paccayā vassikasāṭikāya nikkhepāyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pacchimavikappanupagacīvarādikathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "222. Saṅghikacīvaruppādakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "363"
      },
      ". Tena ",
      " kho pana samayena aññataro bhikkhu eko vassaṃ vasi. Tattha manussā saṅghassa demāti cīvarāni adaṃsu. Atha kho tassa bhikkhuno etadahosi – ‘‘bhagavatā paññattaṃ ‘catuvaggo pacchimo saṅgho’ti. Ahañcamhi ekako. Ime ca manussā ",
      " saṅghassa demāti cīvarāni adaṃsu. Yaṃnūnāhaṃ imāni saṅghikāni cīvarāni sāvatthiṃ hareyya’’nti. Atha kho so bhikkhu tāni cīvarāni ādāya sāvatthiṃ gantvā bhagavato etamatthaṃ ārocesi. ‘‘Tuyheva, bhikkhu, tāni cīvarāni yāva kathinassa ubbhārāyā’’ti. Idha pana, bhikkhave, bhikkhu eko vassaṃ vasati. Tattha manussā saṅghassa demāti cīvarāni denti. Anujānāmi, bhikkhave, tasseva tāni cīvarāni yāva kathinassa ubbhārāyāti."
    ],
    "innerText": "363. Tena kho pana samayena aññataro bhikkhu eko vassaṃ vasi. Tattha manussā saṅghassa demāti cīvarāni adaṃsu. Atha kho tassa bhikkhuno etadahosi – ‘‘bhagavatā paññattaṃ ‘catuvaggo pacchimo saṅgho’ti. Ahañcamhi ekako. Ime ca manussā saṅghassa demāti cīvarāni adaṃsu. Yaṃnūnāhaṃ imāni saṅghikāni cīvarāni sāvatthiṃ hareyya’’nti. Atha kho so bhikkhu tāni cīvarāni ādāya sāvatthiṃ gantvā bhagavato etamatthaṃ ārocesi. ‘‘Tuyheva, bhikkhu, tāni cīvarāni yāva kathinassa ubbhārāyā’’ti. Idha pana, bhikkhave, bhikkhu eko vassaṃ vasati. Tattha manussā saṅghassa demāti cīvarāni denti. Anujānāmi, bhikkhave, tasseva tāni cīvarāni yāva kathinassa ubbhārāyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena ",
      " kho pana samayena aññataro bhikkhu utukālaṃ eko vasi. Tattha manussā saṅghassa demāti cīvarāni adaṃsu. Atha kho tassa bhikkhuno etadahosi – ‘‘bhagavatā paññattaṃ ‘catuvaggo pacchimo saṅgho’ti. Ahañcamhi ekako. Ime ca manussā saṅghassa demāti cīvarāni adaṃsu. Yaṃnūnāhaṃ imāni saṅghikāni cīvarāni sāvatthiṃ hareyya’’nti. Atha kho so bhikkhu tāni cīvarāni ādāya sāvatthiṃ gantvā bhikkhūnaṃ etamatthaṃ ārocesi. Bhikkhū bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave ",
      ", sammukhībhūtena saṅghena bhājetuṃ. Idha pana, bhikkhave, bhikkhu utukālaṃ eko vasati. Tattha manussā saṅghassa demāti cīvarāni denti. Anujānāmi, bhikkhave, tena bhikkhunā tāni cīvarāni adhiṭṭhātuṃ – ‘‘mayhimāni cīvarānī’’ti. Tassa ce, bhikkhave, bhikkhuno taṃ cīvaraṃ anadhiṭṭhite añño bhikkhu āgacchati, samako dātabbo bhāgo. Tehi ce, bhikkhave, bhikkhūhi taṃ cīvaraṃ bhājiyamāne, apātite kuse, añño bhikkhu āgacchati, samako dātabbo bhāgo. Tehi ce, bhikkhave, bhikkhūhi taṃ cīvaraṃ bhājiyamāne, pātite kuse, añño bhikkhu āgacchati, nākāmā dātabbo bhāgoti."
    ],
    "innerText": "Tena kho pana samayena aññataro bhikkhu utukālaṃ eko vasi. Tattha manussā saṅghassa demāti cīvarāni adaṃsu. Atha kho tassa bhikkhuno etadahosi – ‘‘bhagavatā paññattaṃ ‘catuvaggo pacchimo saṅgho’ti. Ahañcamhi ekako. Ime ca manussā saṅghassa demāti cīvarāni adaṃsu. Yaṃnūnāhaṃ imāni saṅghikāni cīvarāni sāvatthiṃ hareyya’’nti. Atha kho so bhikkhu tāni cīvarāni ādāya sāvatthiṃ gantvā bhikkhūnaṃ etamatthaṃ ārocesi. Bhikkhū bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave , sammukhībhūtena saṅghena bhājetuṃ. Idha pana, bhikkhave, bhikkhu utukālaṃ eko vasati. Tattha manussā saṅghassa demāti cīvarāni denti. Anujānāmi, bhikkhave, tena bhikkhunā tāni cīvarāni adhiṭṭhātuṃ – ‘‘mayhimāni cīvarānī’’ti. Tassa ce, bhikkhave, bhikkhuno taṃ cīvaraṃ anadhiṭṭhite añño bhikkhu āgacchati, samako dātabbo bhāgo. Tehi ce, bhikkhave, bhikkhūhi taṃ cīvaraṃ bhājiyamāne, apātite kuse, añño bhikkhu āgacchati, samako dātabbo bhāgo. Tehi ce, bhikkhave, bhikkhūhi taṃ cīvaraṃ bhājiyamāne, pātite kuse, añño bhikkhu āgacchati, nākāmā dātabbo bhāgoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena kho pana samayena dve bhātikā therā, āyasmā ca isidāso āyasmā ca isibhaṭo, sāvatthiyaṃ vassaṃvuṭṭhā aññataraṃ gāmakāvāsaṃ agamaṃsu. Manussā cirassāpi therā āgatāti sacīvarāni bhattāni ",
      " adaṃsu. Āvāsikā bhikkhū there pucchiṃsu – ‘‘imāni, bhante, saṅghikāni cīvarāni there āgamma uppannāni, sādiyissanti therā bhāga’’nti. Therā evamāhaṃsu – ‘‘yathā kho mayaṃ, āvuso, bhagavatā dhammaṃ desitaṃ ājānāma, tumhākaṃyeva tāni cīvarāni yāva kathinassa ubbhārāyā’’ti."
    ],
    "innerText": "Tena kho pana samayena dve bhātikā therā, āyasmā ca isidāso āyasmā ca isibhaṭo, sāvatthiyaṃ vassaṃvuṭṭhā aññataraṃ gāmakāvāsaṃ agamaṃsu. Manussā cirassāpi therā āgatāti sacīvarāni bhattāni adaṃsu. Āvāsikā bhikkhū there pucchiṃsu – ‘‘imāni, bhante, saṅghikāni cīvarāni there āgamma uppannāni, sādiyissanti therā bhāga’’nti. Therā evamāhaṃsu – ‘‘yathā kho mayaṃ, āvuso, bhagavatā dhammaṃ desitaṃ ājānāma, tumhākaṃyeva tāni cīvarāni yāva kathinassa ubbhārāyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tena kho pana samayena tayo bhikkhū rājagahe vassaṃ vasanti. Tattha manussā saṅghassa"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Demāti cīvarāni denti. Atha kho tesaṃ bhikkhūnaṃ etadahosi – ‘‘bhagavatā paññattaṃ ",
      " ‘catuvaggo pacchimo saṅgho’ti. Mayañcamhā tayo janā. Ime ca manussā saṅghassa demāti cīvarāni ",
      " denti. Kathaṃ nu kho amhehi paṭipajjitabba’’nti? Tena kho pana samayena sambahulā therā, āyasmā ca nilavāsī āyasmā ca sāṇavāsī āyasmā ca gotako āyasmā ca bhagu āyasmā ca phaḷikasantāno, pāṭaliputte viharanti kukkuṭārāme. Atha kho te bhikkhū pāṭaliputtaṃ gantvā there pucchiṃsu. Therā evamāhaṃsu – ‘‘yathā kho mayaṃ āvuso bhagavatā dhammaṃ desitaṃ ājānāma, tumhākaṃyeva tāni cīvarāni yāva kathinassa ubbhārāyā’’ti."
    ],
    "innerText": "Demāti cīvarāni denti. Atha kho tesaṃ bhikkhūnaṃ etadahosi – ‘‘bhagavatā paññattaṃ ‘catuvaggo pacchimo saṅgho’ti. Mayañcamhā tayo janā. Ime ca manussā saṅghassa demāti cīvarāni denti. Kathaṃ nu kho amhehi paṭipajjitabba’’nti? Tena kho pana samayena sambahulā therā, āyasmā ca nilavāsī āyasmā ca sāṇavāsī āyasmā ca gotako āyasmā ca bhagu āyasmā ca phaḷikasantāno, pāṭaliputte viharanti kukkuṭārāme. Atha kho te bhikkhū pāṭaliputtaṃ gantvā there pucchiṃsu. Therā evamāhaṃsu – ‘‘yathā kho mayaṃ āvuso bhagavatā dhammaṃ desitaṃ ājānāma, tumhākaṃyeva tāni cīvarāni yāva kathinassa ubbhārāyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Saṅghikacīvaruppādakathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "223. Upanandasakyaputtavatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "364"
      },
      ". Tena ",
      " kho pana samayena āyasmā upanando sakyaputto sāvatthiyaṃ vassaṃvuṭṭho aññataraṃ gāmakāvāsaṃ agamāsi. Tattha ca bhikkhū cīvaraṃ bhājetukāmā sannipatiṃsu. Te evamāhaṃsu – ‘‘imāni kho, āvuso, saṅghikāni cīvarāni bhājiyissanti, sādiyissasi bhāga’’nti? ‘‘Āmāvuso, sādiyissāmī’’ti. Tato cīvarabhāgaṃ gahetvā aññaṃ āvāsaṃ agamāsi. Tatthapi bhikkhū cīvaraṃ bhājetukāmā sannipatiṃsu. Tepi evamāhaṃsu – ‘‘imāni kho, āvuso, saṅghikāni cīvarāni bhājiyissanti, sādiyissasi bhāga’’nti? ‘‘Āmāvuso, sādiyissāmī’’ti. Tatopi cīvarabhāgaṃ gahetvā aññaṃ āvāsaṃ agamāsi. Tatthapi bhikkhū cīvaraṃ bhājetukāmā sannipatiṃsu. Tepi evamāhaṃsu – ‘‘imāni kho, āvuso, saṅghikāni cīvarāni bhājiyissanti, sādiyissasi bhāga’’nti? ‘‘Āmāvuso, sādiyissāmī’’ti. Tatopi cīvarabhāgaṃ gahetvā mahantaṃ cīvarabhaṇḍikaṃ ādāya punadeva sāvatthiṃ paccāgañchi. Bhikkhū evamāhaṃsu – ‘‘mahāpuññosi tvaṃ ",
      ", āvuso upananda, bahuṃ te cīvaraṃ uppanna’’nti. ‘‘Kuto me ",
      ", āvuso, puññaṃ? Idhāhaṃ, āvuso, sāvatthiyaṃ vassaṃvuṭṭho aññataraṃ gāmakāvāsaṃ agamāsiṃ. Tattha bhikkhū cīvaraṃ bhājetukāmā sannipatiṃsu. Te maṃ evamāhaṃsu – ‘imāni kho, āvuso, saṅghikāni cīvarāni bhājiyissanti, sādiyissasi bhāga’nti? ‘Āmāvuso, sādiyissāmī’ti. Tato cīvarabhāgaṃ gahetvā aññaṃ āvāsaṃ agamāsiṃ. Tatthapi bhikkhū cīvaraṃ bhājetukāmā sannipatiṃsu. Tepi maṃ evamāhaṃsu – ‘imāni kho, āvuso, saṅghikāni cīvarāni bhājiyissanti, sādiyissasi bhāga’’’nti? ‘Āmāvuso, sādiyissāmī’ti. Tatopi cīvarabhāgaṃ gahetvā aññaṃ āvāsaṃ ",
      " agamāsiṃ. Tatthapi bhikkhū cīvaraṃ bhājetukāmā sannipatiṃsu. Tepi maṃ evamāhaṃsu – ‘imāni kho, āvuso, saṅghikāni cīvarāni bhājiyissanti, sādiyissasi bhāga’nti? ‘Āmāvuso, sādiyissāmī’ti. Tatopi cīvarabhāgaṃ aggahesiṃ. Evaṃ me bahuṃ cīvaraṃ uppannanti. ‘‘Kiṃ pana tvaṃ, āvuso upananda, aññatra vassaṃvuṭṭho aññatra cīvarabhāgaṃ sādiyī’’ti? ‘‘Evamāvuso’’ti. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma āyasmā upanando sakyaputto aññatra vassaṃvuṭṭho aññatra cīvarabhāgaṃ sādiyissatī’’ti. Bhagavato etamatthaṃ ārocesuṃ…pe… ‘‘saccaṃ kira tvaṃ, upananda, aññatra vassaṃvuṭṭho aññatra cīvarabhāgaṃ sādiyī’’ti? ‘‘Saccaṃ bhagavā’’ti. Vigarahi buddho bhagavā…pe… kathañhi nāma tvaṃ, moghapurisa, aññatra vassaṃvuṭṭho aññatra ",
      " cīvarabhāgaṃ sādiyissasi. Netaṃ, moghapurisa, appasannānaṃ vā pasādāya…pe… vigarahitvā…pe… dhammiṃ ",
      " kathaṃ katvā bhikkhū āmantesi – ‘‘na, bhikkhave, aññatra vassaṃvuṭṭhena aññatra cīvarabhāgo sāditabbo. Yo sādiyeyya, āpatti dukkaṭassā’’ti."
    ],
    "innerText": "364. Tena kho pana samayena āyasmā upanando sakyaputto sāvatthiyaṃ vassaṃvuṭṭho aññataraṃ gāmakāvāsaṃ agamāsi. Tattha ca bhikkhū cīvaraṃ bhājetukāmā sannipatiṃsu. Te evamāhaṃsu – ‘‘imāni kho, āvuso, saṅghikāni cīvarāni bhājiyissanti, sādiyissasi bhāga’’nti? ‘‘Āmāvuso, sādiyissāmī’’ti. Tato cīvarabhāgaṃ gahetvā aññaṃ āvāsaṃ agamāsi. Tatthapi bhikkhū cīvaraṃ bhājetukāmā sannipatiṃsu. Tepi evamāhaṃsu – ‘‘imāni kho, āvuso, saṅghikāni cīvarāni bhājiyissanti, sādiyissasi bhāga’’nti? ‘‘Āmāvuso, sādiyissāmī’’ti. Tatopi cīvarabhāgaṃ gahetvā aññaṃ āvāsaṃ agamāsi. Tatthapi bhikkhū cīvaraṃ bhājetukāmā sannipatiṃsu. Tepi evamāhaṃsu – ‘‘imāni kho, āvuso, saṅghikāni cīvarāni bhājiyissanti, sādiyissasi bhāga’’nti? ‘‘Āmāvuso, sādiyissāmī’’ti. Tatopi cīvarabhāgaṃ gahetvā mahantaṃ cīvarabhaṇḍikaṃ ādāya punadeva sāvatthiṃ paccāgañchi. Bhikkhū evamāhaṃsu – ‘‘mahāpuññosi tvaṃ , āvuso upananda, bahuṃ te cīvaraṃ uppanna’’nti. ‘‘Kuto me , āvuso, puññaṃ? Idhāhaṃ, āvuso, sāvatthiyaṃ vassaṃvuṭṭho aññataraṃ gāmakāvāsaṃ agamāsiṃ. Tattha bhikkhū cīvaraṃ bhājetukāmā sannipatiṃsu. Te maṃ evamāhaṃsu – ‘imāni kho, āvuso, saṅghikāni cīvarāni bhājiyissanti, sādiyissasi bhāga’nti? ‘Āmāvuso, sādiyissāmī’ti. Tato cīvarabhāgaṃ gahetvā aññaṃ āvāsaṃ agamāsiṃ. Tatthapi bhikkhū cīvaraṃ bhājetukāmā sannipatiṃsu. Tepi maṃ evamāhaṃsu – ‘imāni kho, āvuso, saṅghikāni cīvarāni bhājiyissanti, sādiyissasi bhāga’’’nti? ‘Āmāvuso, sādiyissāmī’ti. Tatopi cīvarabhāgaṃ gahetvā aññaṃ āvāsaṃ agamāsiṃ. Tatthapi bhikkhū cīvaraṃ bhājetukāmā sannipatiṃsu. Tepi maṃ evamāhaṃsu – ‘imāni kho, āvuso, saṅghikāni cīvarāni bhājiyissanti, sādiyissasi bhāga’nti? ‘Āmāvuso, sādiyissāmī’ti. Tatopi cīvarabhāgaṃ aggahesiṃ. Evaṃ me bahuṃ cīvaraṃ uppannanti. ‘‘Kiṃ pana tvaṃ, āvuso upananda, aññatra vassaṃvuṭṭho aññatra cīvarabhāgaṃ sādiyī’’ti? ‘‘Evamāvuso’’ti. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma āyasmā upanando sakyaputto aññatra vassaṃvuṭṭho aññatra cīvarabhāgaṃ sādiyissatī’’ti. Bhagavato etamatthaṃ ārocesuṃ…pe… ‘‘saccaṃ kira tvaṃ, upananda, aññatra vassaṃvuṭṭho aññatra cīvarabhāgaṃ sādiyī’’ti? ‘‘Saccaṃ bhagavā’’ti. Vigarahi buddho bhagavā…pe… kathañhi nāma tvaṃ, moghapurisa, aññatra vassaṃvuṭṭho aññatra cīvarabhāgaṃ sādiyissasi. Netaṃ, moghapurisa, appasannānaṃ vā pasādāya…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘na, bhikkhave, aññatra vassaṃvuṭṭhena aññatra cīvarabhāgo sāditabbo. Yo sādiyeyya, āpatti dukkaṭassā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena kho pana samayena āyasmā upanando sakyaputto eko dvīsu āvāsesu vassaṃ vasi – ‘‘evaṃ me bahuṃ cīvaraṃ uppajjissatī’’ti. Atha kho tesaṃ bhikkhūnaṃ etadahosi – ‘‘kathaṃ nu kho āyasmato upanandassa sakyaputtassa cīvarapaṭivīso dātabbo’’ti? Bhagavato etamatthaṃ ārocesuṃ. Detha, bhikkhave, moghapurisassa ekādhippāyaṃ. Idha pana, bhikkhave, bhikkhu eko dvīsu āvāsesu vassaṃ vasati – ‘‘evaṃ me bahuṃ cīvaraṃ uppajjissatī’’ti. Sace amutra upaḍḍhaṃ amutra upaḍḍhaṃ vasati, amutra upaḍḍho amutra upaḍḍho cīvarapaṭivīso dātabbo. Yattha vā pana bahutaraṃ vasati, tato cīvarapaṭivīso dātabboti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Upanandasakyaputtavatthu niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "224. Gilānavatthukathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "365"
      },
      ". Tena ",
      " kho pana samayena aññatarassa bhikkhuno kucchivikārābādho hoti. So sake muttakarīse palipanno seti. Atha kho bhagavā āyasmatā ānandena pacchāsamaṇena senāsanacārikaṃ āhiṇḍanto yena tassa bhikkhuno vihāro tenupasaṅkami. Addasā kho bhagavā taṃ bhikkhuṃ sake muttakarīse palipannaṃ sayamānaṃ, disvāna yena so bhikkhu tenupasaṅkami, upasaṅkamitvā taṃ bhikkhuṃ etadavoca – ‘‘kiṃ te, bhikkhu, ābādho’’ti? ‘‘Kucchivikāro me, bhagavā’’ti. ‘‘Atthi ",
      " pana te, bhikkhu, upaṭṭhāko’’ti? ‘‘Natthi, bhagavā’’ti ",
      ". ‘‘Kissa taṃ bhikkhū na upaṭṭhentī’’ti? ‘‘Ahaṃ kho, bhante, bhikkhūnaṃ akārako; tena maṃ bhikkhū na upaṭṭhentī’’ti. Atha kho bhagavā āyasmantaṃ ānandaṃ āmantesi – ‘‘gacchānanda, udakaṃ āhara, imaṃ bhikkhuṃ nahāpessāmā’’ti. ‘‘Evaṃ, bhante’’ti kho āyasmā ānando bhagavato paṭissuṇitvā udakaṃ āhari. Bhagavā udakaṃ āsiñci. Āyasmā ānando paridhovi. Bhagavā sīsato aggahesi. Āyasmā ānando pādato uccāretvā mañcake nipātesuṃ. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe bhikkhusaṅghaṃ sannipātāpetvā bhikkhū paṭipucchi – ‘‘atthi, bhikkhave, amukasmiṃ vihāre bhikkhu gilāno’’ti? ‘‘Atthi, bhagavā’’ti. ‘‘Kiṃ tassa, bhikkhave, bhikkhuno ābādho’’ti? ‘‘Tassa, bhante, āyasmato kucchivikārābādho’’ti. ‘‘Atthi pana, bhikkhave, tassa bhikkhuno upaṭṭhāko’’ti? ‘‘Natthi, bhagavā’’ti ",
      ". ‘‘Kissa taṃ bhikkhū na upaṭṭhentī’’ti? ‘‘Eso, bhante, bhikkhu bhikkhūnaṃ akārako; tena taṃ bhikkhū na upaṭṭhentī’’ti. ‘‘Natthi vo, bhikkhave, mātā, natthi pitā, ye vo upaṭṭhaheyyuṃ. Tumhe ce, bhikkhave, aññamaññaṃ na upaṭṭhahissatha, atha ko carahi upaṭṭhahissati? Yo, bhikkhave, maṃ upaṭṭhaheyya so gilānaṃ upaṭṭhaheyya. Sace upajjhāyo hoti, upajjhāyena yāvajīvaṃ upaṭṭhātabbo; vuṭṭhānamassa āgametabbaṃ. Sace ācariyo hoti, ācariyena yāvajīvaṃ upaṭṭhātabbo; vuṭṭhānamassa āgametabbaṃ. Sace saddhivihāriko hoti ",
      ", saddhivihārikena yāvajīvaṃ upaṭṭhātabbo; vuṭṭhānamassa āgametabbaṃ. Sace antevāsiko hoti, antevāsikena yāvajīvaṃ upaṭṭhātabbo; vuṭṭhānamassa āgametabbaṃ. Sace samānupajjhāyako hoti, samānupajjhāyakena yāvajīvaṃ upaṭṭhātabbo ",
      "; vuṭṭhānamassa āgametabbaṃ. Sace samānācariyako hoti, samānācariyakena yāvajīvaṃ upaṭṭhātabbo; vuṭṭhānamassa āgametabbaṃ. Sace na hoti upajjhāyo vā ācariyo vā saddhivihāriko vā antevāsiko vā samānupajjhāyako vā samānācariyako vā saṅghena upaṭṭhātabbo. No ce upaṭṭhaheyya, āpatti dukkaṭassa’’."
    ],
    "innerText": "365. Tena kho pana samayena aññatarassa bhikkhuno kucchivikārābādho hoti. So sake muttakarīse palipanno seti. Atha kho bhagavā āyasmatā ānandena pacchāsamaṇena senāsanacārikaṃ āhiṇḍanto yena tassa bhikkhuno vihāro tenupasaṅkami. Addasā kho bhagavā taṃ bhikkhuṃ sake muttakarīse palipannaṃ sayamānaṃ, disvāna yena so bhikkhu tenupasaṅkami, upasaṅkamitvā taṃ bhikkhuṃ etadavoca – ‘‘kiṃ te, bhikkhu, ābādho’’ti? ‘‘Kucchivikāro me, bhagavā’’ti. ‘‘Atthi pana te, bhikkhu, upaṭṭhāko’’ti? ‘‘Natthi, bhagavā’’ti . ‘‘Kissa taṃ bhikkhū na upaṭṭhentī’’ti? ‘‘Ahaṃ kho, bhante, bhikkhūnaṃ akārako; tena maṃ bhikkhū na upaṭṭhentī’’ti. Atha kho bhagavā āyasmantaṃ ānandaṃ āmantesi – ‘‘gacchānanda, udakaṃ āhara, imaṃ bhikkhuṃ nahāpessāmā’’ti. ‘‘Evaṃ, bhante’’ti kho āyasmā ānando bhagavato paṭissuṇitvā udakaṃ āhari. Bhagavā udakaṃ āsiñci. Āyasmā ānando paridhovi. Bhagavā sīsato aggahesi. Āyasmā ānando pādato uccāretvā mañcake nipātesuṃ. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe bhikkhusaṅghaṃ sannipātāpetvā bhikkhū paṭipucchi – ‘‘atthi, bhikkhave, amukasmiṃ vihāre bhikkhu gilāno’’ti? ‘‘Atthi, bhagavā’’ti. ‘‘Kiṃ tassa, bhikkhave, bhikkhuno ābādho’’ti? ‘‘Tassa, bhante, āyasmato kucchivikārābādho’’ti. ‘‘Atthi pana, bhikkhave, tassa bhikkhuno upaṭṭhāko’’ti? ‘‘Natthi, bhagavā’’ti . ‘‘Kissa taṃ bhikkhū na upaṭṭhentī’’ti? ‘‘Eso, bhante, bhikkhu bhikkhūnaṃ akārako; tena taṃ bhikkhū na upaṭṭhentī’’ti. ‘‘Natthi vo, bhikkhave, mātā, natthi pitā, ye vo upaṭṭhaheyyuṃ. Tumhe ce, bhikkhave, aññamaññaṃ na upaṭṭhahissatha, atha ko carahi upaṭṭhahissati? Yo, bhikkhave, maṃ upaṭṭhaheyya so gilānaṃ upaṭṭhaheyya. Sace upajjhāyo hoti, upajjhāyena yāvajīvaṃ upaṭṭhātabbo; vuṭṭhānamassa āgametabbaṃ. Sace ācariyo hoti, ācariyena yāvajīvaṃ upaṭṭhātabbo; vuṭṭhānamassa āgametabbaṃ. Sace saddhivihāriko hoti , saddhivihārikena yāvajīvaṃ upaṭṭhātabbo; vuṭṭhānamassa āgametabbaṃ. Sace antevāsiko hoti, antevāsikena yāvajīvaṃ upaṭṭhātabbo; vuṭṭhānamassa āgametabbaṃ. Sace samānupajjhāyako hoti, samānupajjhāyakena yāvajīvaṃ upaṭṭhātabbo ; vuṭṭhānamassa āgametabbaṃ. Sace samānācariyako hoti, samānācariyakena yāvajīvaṃ upaṭṭhātabbo; vuṭṭhānamassa āgametabbaṃ. Sace na hoti upajjhāyo vā ācariyo vā saddhivihāriko vā antevāsiko vā samānupajjhāyako vā samānācariyako vā saṅghena upaṭṭhātabbo. No ce upaṭṭhaheyya, āpatti dukkaṭassa’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "366"
      },
      ". Pañcahi, bhikkhave, aṅgehi samannāgato gilāno dūpaṭṭho hoti – asappāyakārī hoti, sappāye mattaṃ na jānāti, bhesajjaṃ na paṭisevitā hoti, atthakāmassa gilānupaṭṭhākassa yathābhūtaṃ ābādhaṃ nāvikattā hoti ‘abhikkamantaṃ vā abhikkamatīti, paṭikkamantaṃ vā paṭikkamatīti, ṭhitaṃ vā ṭhito’ti, uppannānaṃ sārīrikānaṃ vedanānaṃ dukkhānaṃ tibbānaṃ kharānaṃ kaṭukānaṃ asātānaṃ amanāpānaṃ pāṇaharānaṃ anadhivāsakajātiko hoti. Imehi kho, bhikkhave, pañcahaṅgehi samannāgato gilāno dūpaṭṭho hoti."
    ],
    "innerText": "366. Pañcahi, bhikkhave, aṅgehi samannāgato gilāno dūpaṭṭho hoti – asappāyakārī hoti, sappāye mattaṃ na jānāti, bhesajjaṃ na paṭisevitā hoti, atthakāmassa gilānupaṭṭhākassa yathābhūtaṃ ābādhaṃ nāvikattā hoti ‘abhikkamantaṃ vā abhikkamatīti, paṭikkamantaṃ vā paṭikkamatīti, ṭhitaṃ vā ṭhito’ti, uppannānaṃ sārīrikānaṃ vedanānaṃ dukkhānaṃ tibbānaṃ kharānaṃ kaṭukānaṃ asātānaṃ amanāpānaṃ pāṇaharānaṃ anadhivāsakajātiko hoti. Imehi kho, bhikkhave, pañcahaṅgehi samannāgato gilāno dūpaṭṭho hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pañcahi, bhikkhave ",
      ", aṅgehi samannāgato gilāno sūpaṭṭho hoti – sappāyakārī hoti, sappāye mattaṃ jānāti, bhesajjaṃ paṭisevitā hoti, atthakāmassa gilānupaṭṭhākassa yathābhūtaṃ ābādhaṃ āvikattā hoti ‘abhikkamantaṃ vā abhikkamatīti, paṭikkamantaṃ vā paṭikkamatīti, ṭhitaṃ ",
      " vā ṭhito’ti, uppannānaṃ sārīrikānaṃ vedanānaṃ dukkhānaṃ tibbānaṃ kharānaṃ kaṭukānaṃ asātānaṃ amanāpānaṃ pāṇaharānaṃ adhivāsakajātiko hoti. Imehi kho, bhikkhave, pañcahaṅgehi samannāgato gilāno sūpaṭṭho hoti."
    ],
    "innerText": "Pañcahi, bhikkhave , aṅgehi samannāgato gilāno sūpaṭṭho hoti – sappāyakārī hoti, sappāye mattaṃ jānāti, bhesajjaṃ paṭisevitā hoti, atthakāmassa gilānupaṭṭhākassa yathābhūtaṃ ābādhaṃ āvikattā hoti ‘abhikkamantaṃ vā abhikkamatīti, paṭikkamantaṃ vā paṭikkamatīti, ṭhitaṃ vā ṭhito’ti, uppannānaṃ sārīrikānaṃ vedanānaṃ dukkhānaṃ tibbānaṃ kharānaṃ kaṭukānaṃ asātānaṃ amanāpānaṃ pāṇaharānaṃ adhivāsakajātiko hoti. Imehi kho, bhikkhave, pañcahaṅgehi samannāgato gilāno sūpaṭṭho hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pañcahi, bhikkhave, aṅgehi samannāgato gilānupaṭṭhāko nālaṃ gilānaṃ upaṭṭhātuṃ – na paṭibalo hoti bhesajjaṃ saṃvidhātuṃ, sappāyāsappāyaṃ na jānāti, asappāyaṃ upanāmeti sappāyaṃ apanāmeti, āmisantaro gilānaṃ upaṭṭhāti no mettacitto, jegucchī hoti uccāraṃ vā passāvaṃ ",
      " vā kheḷaṃ vā vantaṃ vā nīhātuṃ, na paṭibalo hoti gilānaṃ kālena kālaṃ dhammiyā kathāya sandassetuṃ samādapetuṃ samuttejetuṃ sampahaṃsetuṃ. Imehi kho, bhikkhave, pañcahaṅgehi samannāgato gilānupaṭṭhāko nālaṃ gilānaṃ upaṭṭhātuṃ."
    ],
    "innerText": "Pañcahi, bhikkhave, aṅgehi samannāgato gilānupaṭṭhāko nālaṃ gilānaṃ upaṭṭhātuṃ – na paṭibalo hoti bhesajjaṃ saṃvidhātuṃ, sappāyāsappāyaṃ na jānāti, asappāyaṃ upanāmeti sappāyaṃ apanāmeti, āmisantaro gilānaṃ upaṭṭhāti no mettacitto, jegucchī hoti uccāraṃ vā passāvaṃ vā kheḷaṃ vā vantaṃ vā nīhātuṃ, na paṭibalo hoti gilānaṃ kālena kālaṃ dhammiyā kathāya sandassetuṃ samādapetuṃ samuttejetuṃ sampahaṃsetuṃ. Imehi kho, bhikkhave, pañcahaṅgehi samannāgato gilānupaṭṭhāko nālaṃ gilānaṃ upaṭṭhātuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pañcahi ",
      ", bhikkhave, aṅgehi samannāgato gilānupaṭṭhāko alaṃ gilānaṃ upaṭṭhātuṃ – paṭibalo hoti bhesajjaṃ saṃvidhātuṃ, sappāyāsappāyaṃ jānāti, asappāyaṃ apanāmeti sappāyaṃ upanāmeti, mettacitto gilānaṃ upaṭṭhāti no āmisantaro, ajegucchī hoti uccāraṃ vā passāvaṃ vā kheḷaṃ vā vantaṃ vā nīhātuṃ, paṭibalo hoti gilānaṃ kālena kālaṃ dhammiyā kathāya sandassetuṃ samādapetuṃ samuttejetuṃ sampahaṃsetuṃ. Imehi kho, bhikkhave, pañcahaṅgehi samannāgato gilānupaṭṭhāko alaṃ gilānaṃ upaṭṭhātunti."
    ],
    "innerText": "Pañcahi , bhikkhave, aṅgehi samannāgato gilānupaṭṭhāko alaṃ gilānaṃ upaṭṭhātuṃ – paṭibalo hoti bhesajjaṃ saṃvidhātuṃ, sappāyāsappāyaṃ jānāti, asappāyaṃ apanāmeti sappāyaṃ upanāmeti, mettacitto gilānaṃ upaṭṭhāti no āmisantaro, ajegucchī hoti uccāraṃ vā passāvaṃ vā kheḷaṃ vā vantaṃ vā nīhātuṃ, paṭibalo hoti gilānaṃ kālena kālaṃ dhammiyā kathāya sandassetuṃ samādapetuṃ samuttejetuṃ sampahaṃsetuṃ. Imehi kho, bhikkhave, pañcahaṅgehi samannāgato gilānupaṭṭhāko alaṃ gilānaṃ upaṭṭhātunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Gilānavatthukathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "225. Matasantakakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "367"
      },
      ". Tena kho pana samayena dve bhikkhū kosalesu janapade addhānamaggappaṭipannā honti. Te aññataraṃ āvāsaṃ upagacchiṃsu. Tattha ",
      " aññataro bhikkhu gilāno hoti. Atha kho tesaṃ bhikkhūnaṃ etadahosi – ‘‘bhagavatā kho, āvuso, gilānupaṭṭhānaṃ vaṇṇitaṃ. Handa, mayaṃ, āvuso, imaṃ bhikkhuṃ upaṭṭhahemā’’ti. Te taṃ upaṭṭhahiṃsu. So tehi upaṭṭhahiyamāno kālamakāsi. Atha kho te bhikkhū tassa bhikkhuno pattacīvaramādāya sāvatthiṃ gantvā bhagavato etamatthaṃ ārocesuṃ. ‘‘Bhikkhussa, bhikkhave, kālaṅkate saṅgho sāmī pattacīvare, apica gilānupaṭṭhākā bahūpakārā. Anujānāmi, bhikkhave, saṅghena ticīvarañca ",
      " pattañca gilānupaṭṭhākānaṃ dātuṃ. Evañca pana, bhikkhave, dātabbaṃ. Tena gilānupaṭṭhākena bhikkhunā saṅghaṃ upasaṅkamitvā evamassa vacanīyo – ‘itthannāmo, bhante, bhikkhu kālaṅkato. Idaṃ tassa ticīvarañca patto cā’’’ti. Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
    ],
    "innerText": "367. Tena kho pana samayena dve bhikkhū kosalesu janapade addhānamaggappaṭipannā honti. Te aññataraṃ āvāsaṃ upagacchiṃsu. Tattha aññataro bhikkhu gilāno hoti. Atha kho tesaṃ bhikkhūnaṃ etadahosi – ‘‘bhagavatā kho, āvuso, gilānupaṭṭhānaṃ vaṇṇitaṃ. Handa, mayaṃ, āvuso, imaṃ bhikkhuṃ upaṭṭhahemā’’ti. Te taṃ upaṭṭhahiṃsu. So tehi upaṭṭhahiyamāno kālamakāsi. Atha kho te bhikkhū tassa bhikkhuno pattacīvaramādāya sāvatthiṃ gantvā bhagavato etamatthaṃ ārocesuṃ. ‘‘Bhikkhussa, bhikkhave, kālaṅkate saṅgho sāmī pattacīvare, apica gilānupaṭṭhākā bahūpakārā. Anujānāmi, bhikkhave, saṅghena ticīvarañca pattañca gilānupaṭṭhākānaṃ dātuṃ. Evañca pana, bhikkhave, dātabbaṃ. Tena gilānupaṭṭhākena bhikkhunā saṅghaṃ upasaṅkamitvā evamassa vacanīyo – ‘itthannāmo, bhante, bhikkhu kālaṅkato. Idaṃ tassa ticīvarañca patto cā’’’ti. Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Itthannāmo bhikkhu kālaṅkato. Idaṃ tassa ticīvarañca patto ca. Yadi saṅghassa pattakallaṃ, saṅgho imaṃ ticīvarañca pattañca gilānupaṭṭhākānaṃ dadeyya. Esā ñatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu ",
      " me, bhante, saṅgho. Itthannāmo bhikkhu kālaṅkato. Idaṃ tassa ticīvarañca patto ca. Saṅgho imaṃ ticīvarañca pattañca gilānupaṭṭhākānaṃ deti. Yassāyasmato khamati imassa ticīvarassa ca pattassa ca gilānupaṭṭhākānaṃ dānaṃ, so tuṇhassa; yassa nakkhamati, so bhāseyya."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Itthannāmo bhikkhu kālaṅkato. Idaṃ tassa ticīvarañca patto ca. Saṅgho imaṃ ticīvarañca pattañca gilānupaṭṭhākānaṃ deti. Yassāyasmato khamati imassa ticīvarassa ca pattassa ca gilānupaṭṭhākānaṃ dānaṃ, so tuṇhassa; yassa nakkhamati, so bhāseyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Dinnaṃ ",
      " idaṃ saṅghena ticīvarañca patto ca gilānupaṭṭhākānaṃ. Khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti ",
      "."
    ],
    "innerText": "‘‘Dinnaṃ idaṃ saṅghena ticīvarañca patto ca gilānupaṭṭhākānaṃ. Khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "368"
      },
      ". Tena kho pana samayena aññataro sāmaṇero kālaṅkato hoti. Bhagavato etamatthaṃ ārocesuṃ. Sāmaṇerassa, bhikkhave, kālaṅkate saṅgho sāmī pattacīvare, api ca gilānupaṭṭhākā bahūpakārā. Anujānāmi, bhikkhave, saṅghena cīvarañca pattañca gilānupaṭṭhākānaṃ dātuṃ. Evañca pana, bhikkhave, dātabbaṃ. Tena gilānupaṭṭhākena bhikkhunā saṅghaṃ upasaṅkamitvā evamassa vacanīyo – ‘‘itthannāmo, bhante, sāmaṇero kālaṅkato, idaṃ tassa cīvarañca patto cā’’ti. Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
    ],
    "innerText": "368. Tena kho pana samayena aññataro sāmaṇero kālaṅkato hoti. Bhagavato etamatthaṃ ārocesuṃ. Sāmaṇerassa, bhikkhave, kālaṅkate saṅgho sāmī pattacīvare, api ca gilānupaṭṭhākā bahūpakārā. Anujānāmi, bhikkhave, saṅghena cīvarañca pattañca gilānupaṭṭhākānaṃ dātuṃ. Evañca pana, bhikkhave, dātabbaṃ. Tena gilānupaṭṭhākena bhikkhunā saṅghaṃ upasaṅkamitvā evamassa vacanīyo – ‘‘itthannāmo, bhante, sāmaṇero kālaṅkato, idaṃ tassa cīvarañca patto cā’’ti. Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Itthannāmo sāmaṇero kālaṅkato. Idaṃ tassa cīvarañca patto ca. Yadi saṅghassa pattakallaṃ, saṅgho imaṃ cīvarañca pattañca gilānupaṭṭhākānaṃ dadeyya. Esā ñatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Itthannāmo sāmaṇero kālaṅkato. Idaṃ tassa cīvarañca patto ca. Saṅgho imaṃ cīvarañca pattañca gilānupaṭṭhākānaṃ deti. Yassāyasmato khamati imassa cīvarassa ca pattassa ca gilānupaṭṭhākānaṃ dānaṃ, so tuṇhassa; yassa nakkhamati, so bhāseyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Dinnaṃ idaṃ saṅghena cīvarañca patto ca gilānupaṭṭhākānaṃ. Khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "369"
      },
      ". Tena kho pana samayena aññataro bhikkhu ca sāmaṇero ca gilānaṃ upaṭṭhahiṃsu. So tehi upaṭṭhahiyamāno kālamakāsi. Atha kho tassa gilānupaṭṭhākassa bhikkhuno etadahosi ",
      " – ‘‘kathaṃ nu kho gilānupaṭṭhākassa ",
      " sāmaṇerassa cīvarapaṭivīso dātabbo’’ti ",
      "? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, gilānupaṭṭhākassa sāmaṇerassa samakaṃ paṭivīsaṃ dātunti."
    ],
    "innerText": "369. Tena kho pana samayena aññataro bhikkhu ca sāmaṇero ca gilānaṃ upaṭṭhahiṃsu. So tehi upaṭṭhahiyamāno kālamakāsi. Atha kho tassa gilānupaṭṭhākassa bhikkhuno etadahosi – ‘‘kathaṃ nu kho gilānupaṭṭhākassa sāmaṇerassa cīvarapaṭivīso dātabbo’’ti ? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, gilānupaṭṭhākassa sāmaṇerassa samakaṃ paṭivīsaṃ dātunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena kho pana samayena aññataro bhikkhu bahubhaṇḍo bahuparikkhāro kālaṅkato hoti. Bhagavato etamatthaṃ ārocesuṃ. Bhikkhussa, bhikkhave, kālaṅkate saṅgho sāmī pattacīvare, api ca gilānupaṭṭhākā bahūpakārā. Anujānāmi, bhikkhave, saṅghena ticīvarañca pattañca ",
      " gilānupaṭṭhākānaṃ dātuṃ. Yaṃ tattha lahubhaṇḍaṃ lahuparikkhāraṃ taṃ sammukhībhūtena saṅghena bhājetuṃ. Yaṃ tattha garubhaṇḍaṃ garuparikkhāraṃ taṃ āgatānāgatassa cātuddisassa saṅghassa avissajjikaṃ avebhaṅgikanti."
    ],
    "innerText": "Tena kho pana samayena aññataro bhikkhu bahubhaṇḍo bahuparikkhāro kālaṅkato hoti. Bhagavato etamatthaṃ ārocesuṃ. Bhikkhussa, bhikkhave, kālaṅkate saṅgho sāmī pattacīvare, api ca gilānupaṭṭhākā bahūpakārā. Anujānāmi, bhikkhave, saṅghena ticīvarañca pattañca gilānupaṭṭhākānaṃ dātuṃ. Yaṃ tattha lahubhaṇḍaṃ lahuparikkhāraṃ taṃ sammukhībhūtena saṅghena bhājetuṃ. Yaṃ tattha garubhaṇḍaṃ garuparikkhāraṃ taṃ āgatānāgatassa cātuddisassa saṅghassa avissajjikaṃ avebhaṅgikanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Matasantakakathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "226. Naggiyapaṭikkhepakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "370"
      },
      ". Tena kho pana samayena aññataro bhikkhu naggo hutvā yena bhagavā tenupasaṅkami, upasaṅkamitvā bhagavantaṃ etadavoca – ‘‘bhagavā, bhante, anekapariyāyena appicchassa santuṭṭhassa sallekhassa dhutassa pāsādikassa apacayassa vīriyārambhassa vaṇṇavādī. Idaṃ, bhante, naggiyaṃ anekapariyāyena appicchatāya santuṭṭhitāya sallekhāya dhutatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[dhutattāya (ka.)]"
      },
      " pāsādikatāya apacayāya vīriyārambhāya saṃvattati. Sādhu, bhante, bhagavā bhikkhūnaṃ naggiyaṃ anujānātū’’ti. Vigarahi buddho bhagavā – ‘‘ananucchavikaṃ, moghapurisa, ananulomikaṃ appatirūpaṃ assāmaṇakaṃ akappiyaṃ akaraṇīyaṃ. Kathañhi nāma tvaṃ, moghapurisa, naggiyaṃ titthiyasamādānaṃ samādiyissasi. Netaṃ, moghapurisa, appasannānaṃ vā pasādāya…pe…’’ vigarahitvā dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘na, bhikkhave, naggiyaṃ ",
      " titthiyasamādānaṃ samādiyitabbaṃ. Yo samādiyeyya, āpatti thullaccayassā’’ti."
    ],
    "innerText": "370. Tena kho pana samayena aññataro bhikkhu naggo hutvā yena bhagavā tenupasaṅkami, upasaṅkamitvā bhagavantaṃ etadavoca – ‘‘bhagavā, bhante, anekapariyāyena appicchassa santuṭṭhassa sallekhassa dhutassa pāsādikassa apacayassa vīriyārambhassa vaṇṇavādī. Idaṃ, bhante, naggiyaṃ anekapariyāyena appicchatāya santuṭṭhitāya sallekhāya dhutatāya [dhutattāya (ka.)] pāsādikatāya apacayāya vīriyārambhāya saṃvattati. Sādhu, bhante, bhagavā bhikkhūnaṃ naggiyaṃ anujānātū’’ti. Vigarahi buddho bhagavā – ‘‘ananucchavikaṃ, moghapurisa, ananulomikaṃ appatirūpaṃ assāmaṇakaṃ akappiyaṃ akaraṇīyaṃ. Kathañhi nāma tvaṃ, moghapurisa, naggiyaṃ titthiyasamādānaṃ samādiyissasi. Netaṃ, moghapurisa, appasannānaṃ vā pasādāya…pe…’’ vigarahitvā dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘na, bhikkhave, naggiyaṃ titthiyasamādānaṃ samādiyitabbaṃ. Yo samādiyeyya, āpatti thullaccayassā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Naggiyapaṭikkhepakathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "227. Kusacīrādipaṭikkhepakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "371"
      },
      ". Tena kho pana samayena aññataro bhikkhu kusacīraṃ nivāsetvā…pe… vākacīraṃ ",
      " nivāsetvā…pe… phalakacīraṃ nivāsetvā…pe… kesakambalaṃ nivāsetvā…pe… vāḷakambalaṃ nivāsetvā…pe… ulūkapakkhaṃ nivāsetvā…pe… ajinakkhipaṃ nivāsetvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ etadavoca – ‘‘bhagavā, bhante, anekapariyāyena appicchassa santuṭṭhassa sallekhassa dhutassa pāsādikassa apacayassa vīriyārambhassa vaṇṇavādī. Idaṃ, bhante, ajinakkhipaṃ anekapariyāyena appicchatāya santuṭṭhitāya sallekhāya dhutatāya pāsādikatāya apacayāya vīriyārambhāya saṃvattati. Sādhu, bhante ",
      ", bhagavā bhikkhūnaṃ ajinakkhipaṃ anujānātū’’ti. Vigarahi buddho bhagavā – ‘‘ananucchavikaṃ, moghapurisa, ananulomikaṃ appatirūpaṃ assāmaṇakaṃ ",
      " akappiyaṃ akaraṇīyaṃ. Kathañhi nāma tvaṃ, moghapurisa, ajinakkhipaṃ titthiyadhajaṃ dhāressasi. Netaṃ, moghapurisa, appasannānaṃ vā pasādāya…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘na, bhikkhave, ajinakkhipaṃ titthiyadhajaṃ dhāretabbaṃ. Yo dhāreyya, āpatti thullaccayassā’’ti."
    ],
    "innerText": "371. Tena kho pana samayena aññataro bhikkhu kusacīraṃ nivāsetvā…pe… vākacīraṃ nivāsetvā…pe… phalakacīraṃ nivāsetvā…pe… kesakambalaṃ nivāsetvā…pe… vāḷakambalaṃ nivāsetvā…pe… ulūkapakkhaṃ nivāsetvā…pe… ajinakkhipaṃ nivāsetvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ etadavoca – ‘‘bhagavā, bhante, anekapariyāyena appicchassa santuṭṭhassa sallekhassa dhutassa pāsādikassa apacayassa vīriyārambhassa vaṇṇavādī. Idaṃ, bhante, ajinakkhipaṃ anekapariyāyena appicchatāya santuṭṭhitāya sallekhāya dhutatāya pāsādikatāya apacayāya vīriyārambhāya saṃvattati. Sādhu, bhante , bhagavā bhikkhūnaṃ ajinakkhipaṃ anujānātū’’ti. Vigarahi buddho bhagavā – ‘‘ananucchavikaṃ, moghapurisa, ananulomikaṃ appatirūpaṃ assāmaṇakaṃ akappiyaṃ akaraṇīyaṃ. Kathañhi nāma tvaṃ, moghapurisa, ajinakkhipaṃ titthiyadhajaṃ dhāressasi. Netaṃ, moghapurisa, appasannānaṃ vā pasādāya…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘na, bhikkhave, ajinakkhipaṃ titthiyadhajaṃ dhāretabbaṃ. Yo dhāreyya, āpatti thullaccayassā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena kho pana samayena aññataro bhikkhu akkanāḷaṃ nivāsetvā…pe… potthakaṃ nivāsetvā yena bhagavā tenupasaṅkami, upasaṅkamitvā bhagavantaṃ etadavoca – ‘‘bhagavā, bhante, anekapariyāyena appicchassa santuṭṭhassa sallekhassa dhutassa pāsādikassa apacayassa vīriyārambhassa, vaṇṇavādī. Ayaṃ, bhante, potthako anekapariyāyena appicchatāya ",
      " santuṭṭhitāya sallekhāya dhutatāya pāsādikatāya apacayāya vīriyārambhāya saṃvattati. Sādhu, bhante, bhagavā bhikkhūnaṃ potthakaṃ anujānātū’’ti. Vigarahi buddho bhagavā – ‘‘ananucchavikaṃ, moghapurisa, ananulomikaṃ appatirūpaṃ assāmaṇakaṃ akappiyaṃ akaraṇīyaṃ. Kathañhi nāma tvaṃ, moghapurisa, potthakaṃ nivāsessasi. Netaṃ, moghapurisa, appasannānaṃ vā pasādāya…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘na, bhikkhave, potthako nivāsetabbo. Yo nivāseyya, āpatti dukkaṭassā’’ti."
    ],
    "innerText": "Tena kho pana samayena aññataro bhikkhu akkanāḷaṃ nivāsetvā…pe… potthakaṃ nivāsetvā yena bhagavā tenupasaṅkami, upasaṅkamitvā bhagavantaṃ etadavoca – ‘‘bhagavā, bhante, anekapariyāyena appicchassa santuṭṭhassa sallekhassa dhutassa pāsādikassa apacayassa vīriyārambhassa, vaṇṇavādī. Ayaṃ, bhante, potthako anekapariyāyena appicchatāya santuṭṭhitāya sallekhāya dhutatāya pāsādikatāya apacayāya vīriyārambhāya saṃvattati. Sādhu, bhante, bhagavā bhikkhūnaṃ potthakaṃ anujānātū’’ti. Vigarahi buddho bhagavā – ‘‘ananucchavikaṃ, moghapurisa, ananulomikaṃ appatirūpaṃ assāmaṇakaṃ akappiyaṃ akaraṇīyaṃ. Kathañhi nāma tvaṃ, moghapurisa, potthakaṃ nivāsessasi. Netaṃ, moghapurisa, appasannānaṃ vā pasādāya…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘na, bhikkhave, potthako nivāsetabbo. Yo nivāseyya, āpatti dukkaṭassā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Kusacīrādipaṭikkhepakathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "228. Sabbanīlakādipaṭikkhepakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "372"
      },
      ". Tena kho pana samayena chabbaggiyā bhikkhū sabbanīlakāni cīvarāni dhārenti…pe… sabbapītakāni cīvarāni dhārenti…pe… sabbalohitakāni cīvarāni dhārenti…pe… sabbamañjiṭṭhakāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sabbamañjeṭṭhakāni (sī. syā.)]"
      },
      " cīvarāni dhārenti…pe… sabbakaṇhāni cīvarāni dhārenti ",
      " …pe… sabbamahāraṅgarattāni cīvarāni dhārenti…pe… sabbamahānāmarattāni cīvarāni dhārenti…pe… acchinnadasāni cīvarāni dhārenti…pe… dīghadasāni cīvarāni dhārenti…pe… pupphadasāni cīvarāni dhārenti…pe… phaṇadasāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[phaladasāni (ka.)]"
      },
      " cīvarāni dhārenti…pe… kañcukaṃ dhārenti…pe… tirīṭakaṃ dhārenti…pe… veṭhanaṃ dhārenti. Manussā ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma samaṇā sakyaputtiyā veṭhanaṃ dhāressanti, seyyathāpi gihī kāmabhogino’’ti. Bhagavato etamatthaṃ ārocesuṃ ",
      ". Na, bhikkhave, sabbanīlakāni cīvarāni dhāretabbāni, na sabbapītakāni cīvarāni dhāretabbāni, na sabbalohitakāni cīvarāni dhāretabbāni, na sabbamañjiṭṭhakāni cīvarāni dhāretabbāni, na sabbakaṇhāni cīvarāni dhāretabbāni, na sabbamahāraṅgarattāni cīvarāni dhāretabbāni, na ",
      " sabbamahānāmarattāni cīvarāni dhāretabbāni, na acchinnadasāni cīvarāni dhāretabbāni, na dīghadasāni cīvarāni dhāretabbāni, na pupphadasāni cīvarāni dhāretabbāni, na phaṇadasāni cīvarāni dhāretabbāni, na kañcukaṃ dhāretabbaṃ, na tirīṭakaṃ dhāretabbaṃ, na veṭhanaṃ dhāretabbaṃ. Yo dhāreyya, āpatti dukkaṭassāti."
    ],
    "innerText": "372. Tena kho pana samayena chabbaggiyā bhikkhū sabbanīlakāni cīvarāni dhārenti…pe… sabbapītakāni cīvarāni dhārenti…pe… sabbalohitakāni cīvarāni dhārenti…pe… sabbamañjiṭṭhakāni [sabbamañjeṭṭhakāni (sī. syā.)] cīvarāni dhārenti…pe… sabbakaṇhāni cīvarāni dhārenti …pe… sabbamahāraṅgarattāni cīvarāni dhārenti…pe… sabbamahānāmarattāni cīvarāni dhārenti…pe… acchinnadasāni cīvarāni dhārenti…pe… dīghadasāni cīvarāni dhārenti…pe… pupphadasāni cīvarāni dhārenti…pe… phaṇadasāni [phaladasāni (ka.)] cīvarāni dhārenti…pe… kañcukaṃ dhārenti…pe… tirīṭakaṃ dhārenti…pe… veṭhanaṃ dhārenti. Manussā ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma samaṇā sakyaputtiyā veṭhanaṃ dhāressanti, seyyathāpi gihī kāmabhogino’’ti. Bhagavato etamatthaṃ ārocesuṃ . Na, bhikkhave, sabbanīlakāni cīvarāni dhāretabbāni, na sabbapītakāni cīvarāni dhāretabbāni, na sabbalohitakāni cīvarāni dhāretabbāni, na sabbamañjiṭṭhakāni cīvarāni dhāretabbāni, na sabbakaṇhāni cīvarāni dhāretabbāni, na sabbamahāraṅgarattāni cīvarāni dhāretabbāni, na sabbamahānāmarattāni cīvarāni dhāretabbāni, na acchinnadasāni cīvarāni dhāretabbāni, na dīghadasāni cīvarāni dhāretabbāni, na pupphadasāni cīvarāni dhāretabbāni, na phaṇadasāni cīvarāni dhāretabbāni, na kañcukaṃ dhāretabbaṃ, na tirīṭakaṃ dhāretabbaṃ, na veṭhanaṃ dhāretabbaṃ. Yo dhāreyya, āpatti dukkaṭassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sabbanīlakādipaṭikkhepakathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "229. Vassaṃvuṭṭhānaṃ anuppannacīvarakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "373"
      },
      ". Tena kho pana samayena vassaṃvuṭṭhā bhikkhū anuppanne cīvare ",
      " pakkamantipi, vibbhamantipi, kālampi karonti, sāmaṇerāpi paṭijānanti, sikkhaṃ paccakkhātakāpi paṭijānanti, antimavatthuṃ ajjhāpannakāpi paṭijānanti, ummattakāpi paṭijānanti, khittacittāpi paṭijānanti, vedanāṭṭāpi paṭijānanti, āpattiyā adassane ukkhittakāpi paṭijānanti, āpattiyā appaṭikamme ukkhittakāpi paṭijānanti, pāpikāya diṭṭhiyā appaṭinissagge ukkhittakāpi paṭijānanti, paṇḍakāpi paṭijānanti, theyyasaṃvāsakāpi paṭijānanti, titthiyapakkantakāpi paṭijānanti, tiracchānagatāpi paṭijānanti, mātughātakāpi paṭijānanti, pitughātakāpi paṭijānanti, arahantaghātakāpi paṭijānanti, bhikkhunidūsakāpi paṭijānanti, saṅghabhedakāpi paṭijānanti, lohituppādakāpi paṭijānanti, ubhatobyañjanakāpi paṭijānanti. Bhagavato etamatthaṃ ārocesuṃ."
    ],
    "innerText": "373. Tena kho pana samayena vassaṃvuṭṭhā bhikkhū anuppanne cīvare pakkamantipi, vibbhamantipi, kālampi karonti, sāmaṇerāpi paṭijānanti, sikkhaṃ paccakkhātakāpi paṭijānanti, antimavatthuṃ ajjhāpannakāpi paṭijānanti, ummattakāpi paṭijānanti, khittacittāpi paṭijānanti, vedanāṭṭāpi paṭijānanti, āpattiyā adassane ukkhittakāpi paṭijānanti, āpattiyā appaṭikamme ukkhittakāpi paṭijānanti, pāpikāya diṭṭhiyā appaṭinissagge ukkhittakāpi paṭijānanti, paṇḍakāpi paṭijānanti, theyyasaṃvāsakāpi paṭijānanti, titthiyapakkantakāpi paṭijānanti, tiracchānagatāpi paṭijānanti, mātughātakāpi paṭijānanti, pitughātakāpi paṭijānanti, arahantaghātakāpi paṭijānanti, bhikkhunidūsakāpi paṭijānanti, saṅghabhedakāpi paṭijānanti, lohituppādakāpi paṭijānanti, ubhatobyañjanakāpi paṭijānanti. Bhagavato etamatthaṃ ārocesuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "374"
      },
      ". Idha ",
      " pana, bhikkhave, vassaṃvuṭṭho bhikkhu anuppanne cīvare pakkamati, sante patirūpe gāhake dātabbaṃ."
    ],
    "innerText": "374. Idha pana, bhikkhave, vassaṃvuṭṭho bhikkhu anuppanne cīvare pakkamati, sante patirūpe gāhake dātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, vassaṃvuṭṭho bhikkhu anuppanne cīvare vibbhamati, kālaṃ karoti, sāmaṇero paṭijānāti, sikkhaṃ paccakkhātako paṭijānāti ",
      ", antimavatthuṃ ajjhāpannako paṭijānāti, saṅgho sāmī."
    ],
    "innerText": "Idha pana, bhikkhave, vassaṃvuṭṭho bhikkhu anuppanne cīvare vibbhamati, kālaṃ karoti, sāmaṇero paṭijānāti, sikkhaṃ paccakkhātako paṭijānāti , antimavatthuṃ ajjhāpannako paṭijānāti, saṅgho sāmī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, vassaṃvuṭṭho bhikkhu anuppanne cīvare ummattako paṭijānāti, khittacitto paṭijānāti, vedanāṭṭo paṭijānāti, āpattiyā ",
      " adassane ukkhittako paṭijānāti, āpattiyā appaṭikamme ukkhittako paṭijānāti, pāpikāya diṭṭhiyā appaṭinissagge ukkhittako paṭijānāti, sante patirūpe gāhake dātabbaṃ."
    ],
    "innerText": "Idha pana, bhikkhave, vassaṃvuṭṭho bhikkhu anuppanne cīvare ummattako paṭijānāti, khittacitto paṭijānāti, vedanāṭṭo paṭijānāti, āpattiyā adassane ukkhittako paṭijānāti, āpattiyā appaṭikamme ukkhittako paṭijānāti, pāpikāya diṭṭhiyā appaṭinissagge ukkhittako paṭijānāti, sante patirūpe gāhake dātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, vassaṃvuṭṭho bhikkhu anuppanne cīvare paṇḍako paṭijānāti, theyyasaṃvāsako paṭijānāti, titthiyapakkantako paṭijānāti, tiracchānagato paṭijānāti, mātughātako paṭijānāti, pitughātako paṭijānāti, arahantaghātako paṭijānāti, bhikkhunidūsako paṭijānāti, saṅghabhedako paṭijānāti, lohituppādako paṭijānāti, ubhatobyañjanako paṭijānāti, saṅgho sāmī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "375"
      },
      ". Idha pana, bhikkhave, vassaṃvuṭṭho bhikkhu uppanne cīvare abhājite pakkamati, sante patirūpe gāhake dātabbaṃ."
    ],
    "innerText": "375. Idha pana, bhikkhave, vassaṃvuṭṭho bhikkhu uppanne cīvare abhājite pakkamati, sante patirūpe gāhake dātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, vassaṃvuṭṭho bhikkhu uppanne cīvare abhājite vibbhamati, kālaṃ karoti, sāmaṇero paṭijānāti, sikkhaṃ paccakkhātako paṭijānāti, antimavatthuṃ ajjhāpannako paṭijānāti, saṅgho sāmī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, vassaṃvuṭṭho bhikkhu uppanne cīvare abhājite ummattako paṭijānāti. Khittacitto paṭijānāti, vedanāṭṭo paṭijānāti, āpattiyā adassane ukkhittako paṭijānāti, āpattiyā appaṭikamme ukkhittako paṭijānāti, pāpikāya diṭṭhiyā appaṭinissagge ukkhittako paṭijānāti, sante patirūpe gāhake dātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      " pana, bhikkhave, vassaṃvuṭṭho bhikkhu uppanne cīvare abhājite paṇḍako paṭijānāti, theyyasaṃvāsako paṭijānāti, titthiyapakkantako paṭijānāti, tiracchānagato paṭijānāti, mātughātako paṭijānāti, pitughātako paṭijānāti, arahantaghātako paṭijānāti, bhikkhunidūsako paṭijānāti, saṅghabhedako paṭijānāti, lohituppādako paṭijānāti, ubhatobyañjanako paṭijānāti, saṅgho sāmī."
    ],
    "innerText": "Idha pana, bhikkhave, vassaṃvuṭṭho bhikkhu uppanne cīvare abhājite paṇḍako paṭijānāti, theyyasaṃvāsako paṭijānāti, titthiyapakkantako paṭijānāti, tiracchānagato paṭijānāti, mātughātako paṭijānāti, pitughātako paṭijānāti, arahantaghātako paṭijānāti, bhikkhunidūsako paṭijānāti, saṅghabhedako paṭijānāti, lohituppādako paṭijānāti, ubhatobyañjanako paṭijānāti, saṅgho sāmī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vassaṃ vuṭṭhānaṃ anuppannacīvarakathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "230. Saṅghe bhinne cīvaruppādakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "376"
      },
      ". Idha ",
      " pana, bhikkhave, vassaṃvuṭṭhānaṃ ",
      " bhikkhūnaṃ anuppanne cīvare saṅgho bhijjati. Tattha manussā ekasmiṃ pakkhe udakaṃ denti, ekasmiṃ pakkhe cīvaraṃ denti – saṅghassa demāti. Saṅghassevetaṃ."
    ],
    "innerText": "376. Idha pana, bhikkhave, vassaṃvuṭṭhānaṃ bhikkhūnaṃ anuppanne cīvare saṅgho bhijjati. Tattha manussā ekasmiṃ pakkhe udakaṃ denti, ekasmiṃ pakkhe cīvaraṃ denti – saṅghassa demāti. Saṅghassevetaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, vassaṃvuṭṭhānaṃ bhikkhūnaṃ anuppanne cīvare saṅgho bhijjati. Tattha manussā ekasmiṃ pakkhe udakaṃ denti, tasmiṃyeva pakkhe cīvaraṃ denti – saṅghassa ",
      " demāti. Saṅghassevetaṃ."
    ],
    "innerText": "Idha pana, bhikkhave, vassaṃvuṭṭhānaṃ bhikkhūnaṃ anuppanne cīvare saṅgho bhijjati. Tattha manussā ekasmiṃ pakkhe udakaṃ denti, tasmiṃyeva pakkhe cīvaraṃ denti – saṅghassa demāti. Saṅghassevetaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, vassaṃvuṭṭhānaṃ bhikkhūnaṃ anuppanne cīvare saṅgho bhijjati. Tattha manussā ekasmiṃ pakkhe udakaṃ denti, ekasmiṃ pakkhe cīvaraṃ denti – pakkhassa demāti. Pakkhassevetaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, vassaṃvuṭṭhānaṃ bhikkhūnaṃ anuppanne cīvare saṅgho bhijjati. Tattha manussā ekasmiṃ pakkhe udakaṃ denti, tasmiṃyeva pakkhe cīvaraṃ denti – pakkhassa demāti. Pakkhassevetaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, vassaṃvuṭṭhānaṃ bhikkhūnaṃ uppanne cīvare abhājite saṅgho bhijjati. Sabbesaṃ samakaṃ bhājetabbanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Saṅghe bhinne cīvaruppādakathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "231. Duggahitasuggahitādikathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "377"
      },
      ". Tena ",
      " kho pana samayena āyasmā revato aññatarassa bhikkhuno hatthe āyasmato sāriputtassa cīvaraṃ pāhesi – ‘‘imaṃ cīvaraṃ therassa dehī’’ti. Atha kho so bhikkhu antarāmagge āyasmato revatassa vissāsā taṃ cīvaraṃ aggahesi. Atha kho āyasmā revato āyasmatā sāriputtena samāgantvā pucchi – ‘‘ahaṃ, bhante, therassa cīvaraṃ pāhesiṃ. Sampattaṃ taṃ cīvara’’nti? ‘‘Nāhaṃ taṃ, āvuso, cīvaraṃ passāmī’’ti. Atha kho āyasmā revato taṃ bhikkhuṃ etadavoca – ‘‘ahaṃ, āvuso ",
      ", āyasmato hatthe therassa cīvaraṃ pāhesiṃ. Kahaṃ taṃ cīvara’’nti? ‘‘Ahaṃ, bhante, āyasmato vissāsā taṃ cīvaraṃ aggahesi’’nti. Bhagavato etamatthaṃ ārocesuṃ."
    ],
    "innerText": "377. Tena kho pana samayena āyasmā revato aññatarassa bhikkhuno hatthe āyasmato sāriputtassa cīvaraṃ pāhesi – ‘‘imaṃ cīvaraṃ therassa dehī’’ti. Atha kho so bhikkhu antarāmagge āyasmato revatassa vissāsā taṃ cīvaraṃ aggahesi. Atha kho āyasmā revato āyasmatā sāriputtena samāgantvā pucchi – ‘‘ahaṃ, bhante, therassa cīvaraṃ pāhesiṃ. Sampattaṃ taṃ cīvara’’nti? ‘‘Nāhaṃ taṃ, āvuso, cīvaraṃ passāmī’’ti. Atha kho āyasmā revato taṃ bhikkhuṃ etadavoca – ‘‘ahaṃ, āvuso , āyasmato hatthe therassa cīvaraṃ pāhesiṃ. Kahaṃ taṃ cīvara’’nti? ‘‘Ahaṃ, bhante, āyasmato vissāsā taṃ cīvaraṃ aggahesi’’nti. Bhagavato etamatthaṃ ārocesuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "378"
      },
      ". Idha ",
      " pana, bhikkhave, bhikkhu bhikkhussa hatthe cīvaraṃ pahiṇati – ‘‘imaṃ cīvaraṃ itthannāmassa dehī’’ti. So antarāmagge yo pahiṇati tassa vissāsā gaṇhāti. Suggahitaṃ. Yassa pahiyyati tassa vissāsā gaṇhāti. Duggahitaṃ."
    ],
    "innerText": "378. Idha pana, bhikkhave, bhikkhu bhikkhussa hatthe cīvaraṃ pahiṇati – ‘‘imaṃ cīvaraṃ itthannāmassa dehī’’ti. So antarāmagge yo pahiṇati tassa vissāsā gaṇhāti. Suggahitaṃ. Yassa pahiyyati tassa vissāsā gaṇhāti. Duggahitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, bhikkhu bhikkhussa hatthe cīvaraṃ pahiṇati – ‘‘imaṃ cīvaraṃ itthannāmassa dehī’’ti. So antarāmagge yassa pahiyyati tassa vissāsā gaṇhāti. Duggahitaṃ. Yo pahiṇati tassa vissāsā gaṇhāti. Suggahitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, bhikkhu bhikkhussa hatthe cīvaraṃ pahiṇati – ‘‘imaṃ cīvaraṃ itthannāmassa dehī’’ti. So antarāmagge suṇāti – yo pahiṇati so kālaṅkatoti. Tassa matakacīvaraṃ adhiṭṭhāti. Svādhiṭṭhitaṃ. Yassa pahiyyati tassa vissāsā gaṇhāti. Duggahitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, bhikkhu bhikkhussa hatthe cīvaraṃ pahiṇati – ‘‘imaṃ cīvaraṃ itthannāmassa dehī’’ti. So antarāmagge suṇāti – yassa pahiyyati so kālaṅkatoti. Tassa matakacīvaraṃ adhiṭṭhāti. Dvādhiṭṭhitaṃ. Yo pahiṇati tassa vissāsā gaṇhāti. Suggahitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, bhikkhu bhikkhussa hatthe cīvaraṃ pahiṇati – ‘‘imaṃ cīvaraṃ itthannāmassa dehī’’ti. So ",
      " antarāmagge suṇāti – ubho kālaṅkatāti. Yo pahiṇati tassa matakacīvaraṃ ",
      " adhiṭṭhāti. Svādhiṭṭhitaṃ. Yassa pahiyyati ",
      " tassa matakacīvaraṃ adhiṭṭhāti. Dvādhiṭṭhitaṃ."
    ],
    "innerText": "Idha pana, bhikkhave, bhikkhu bhikkhussa hatthe cīvaraṃ pahiṇati – ‘‘imaṃ cīvaraṃ itthannāmassa dehī’’ti. So antarāmagge suṇāti – ubho kālaṅkatāti. Yo pahiṇati tassa matakacīvaraṃ adhiṭṭhāti. Svādhiṭṭhitaṃ. Yassa pahiyyati tassa matakacīvaraṃ adhiṭṭhāti. Dvādhiṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, bhikkhu bhikkhussa hatthe cīvaraṃ pahiṇati – ‘‘imaṃ cīvaraṃ itthannāmassa dammī’’ti. So antarāmagge yo pahiṇati tassa vissāsā gaṇhāti. Duggahitaṃ. Yassa pahiyyati tassa vissāsā gaṇhāti. Suggahitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, bhikkhu bhikkhussa hatthe cīvaraṃ pahiṇati – ‘‘imaṃ cīvaraṃ itthannāmassa dammī’’ti. So antarāmagge yassa pahiyyati tassa vissāsā gaṇhāti. Suggahitaṃ. Yo pahiṇati tassa vissāsā gaṇhāti. Duggahitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, bhikkhu bhikkhussa hatthe cīvaraṃ pahiṇati – ‘‘imaṃ cīvaraṃ itthannāmassa dammī’’ti. So antarāmagge suṇāti – ‘‘yo pahiṇati so ",
      " kālaṅkato’’ti. Tassa matakacīvaraṃ adhiṭṭhāti. Dvādhiṭṭhitaṃ. Yassa pahiyyati tassa vissāsā gaṇhāti. Suggahitaṃ."
    ],
    "innerText": "Idha pana, bhikkhave, bhikkhu bhikkhussa hatthe cīvaraṃ pahiṇati – ‘‘imaṃ cīvaraṃ itthannāmassa dammī’’ti. So antarāmagge suṇāti – ‘‘yo pahiṇati so kālaṅkato’’ti. Tassa matakacīvaraṃ adhiṭṭhāti. Dvādhiṭṭhitaṃ. Yassa pahiyyati tassa vissāsā gaṇhāti. Suggahitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, bhikkhu bhikkhussa hatthe cīvaraṃ pahiṇati – ‘‘imaṃ cīvaraṃ itthannāmassa dammī’’ti. So antarāmagge suṇāti – ‘‘yassa pahiyyati so kālaṅkato’’ti. Tassa matakacīvaraṃ adhiṭṭhāti. Svādhiṭṭhitaṃ. Yo pahiṇati tassa vissāsā gaṇhāti. Duggahitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, bhikkhu bhikkhussa hatthe cīvaraṃ pahiṇati – ‘‘imaṃ cīvaraṃ itthannāmassa dammī’’ti. So antarāmagge suṇāti ‘‘ubho kālaṅkatā’’ti. Yo pahiṇati tassa matakacīvaraṃ adhiṭṭhāti. Dvādhiṭṭhitaṃ. Yassa pahiyyati tassa matakacīvaraṃ adhiṭṭhāti. Svādhiṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Duggahitasuggahitādikathā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "232. Aṭṭhacīvaramātikā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "379"
      },
      ". Aṭṭhimā ",
      ", bhikkhave, mātikā cīvarassa uppādāya – sīmāya deti ",
      ", katikāya deti, bhikkhāpaññattiyā deti, saṅghassa deti, ubhatosaṅghassa deti, vassaṃvuṭṭhasaṅghassa deti, ādissa deti, puggalassa deti."
    ],
    "innerText": "379. Aṭṭhimā , bhikkhave, mātikā cīvarassa uppādāya – sīmāya deti , katikāya deti, bhikkhāpaññattiyā deti, saṅghassa deti, ubhatosaṅghassa deti, vassaṃvuṭṭhasaṅghassa deti, ādissa deti, puggalassa deti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sīmāya deti – yāvatikā bhikkhū antosīmagatā tehi bhājetabbaṃ. Katikāya deti – sambahulā āvāsā samānalābhā honti ekasmiṃ āvāse dinne sabbattha dinnaṃ hoti. Bhikkhāpaññattiyā deti, yattha saṅghassa dhuvakārā kariyyanti, tattha deti. Saṅghassa deti, sammukhībhūtena saṅghena bhājetabbaṃ. Ubhatosaṅghassa deti, bahukāpi bhikkhū honti, ekā bhikkhunī hoti, upaḍḍhaṃ dātabbaṃ, bahukāpi bhikkhuniyo honti, eko bhikkhu hoti, upaḍḍhaṃ dātabbaṃ. Vassaṃvuṭṭhasaṅghassa deti, yāvatikā bhikkhū tasmiṃ āvāse vassaṃvuṭṭhā, tehi bhājetabbaṃ. Ādissa deti, yāguyā vā bhatte vā khādanīye vā cīvare vā senāsane vā bhesajje vā ",
      ". Puggalassa deti, ‘‘imaṃ cīvaraṃ itthannāmassa dammī’’ti."
    ],
    "innerText": "Sīmāya deti – yāvatikā bhikkhū antosīmagatā tehi bhājetabbaṃ. Katikāya deti – sambahulā āvāsā samānalābhā honti ekasmiṃ āvāse dinne sabbattha dinnaṃ hoti. Bhikkhāpaññattiyā deti, yattha saṅghassa dhuvakārā kariyyanti, tattha deti. Saṅghassa deti, sammukhībhūtena saṅghena bhājetabbaṃ. Ubhatosaṅghassa deti, bahukāpi bhikkhū honti, ekā bhikkhunī hoti, upaḍḍhaṃ dātabbaṃ, bahukāpi bhikkhuniyo honti, eko bhikkhu hoti, upaḍḍhaṃ dātabbaṃ. Vassaṃvuṭṭhasaṅghassa deti, yāvatikā bhikkhū tasmiṃ āvāse vassaṃvuṭṭhā, tehi bhājetabbaṃ. Ādissa deti, yāguyā vā bhatte vā khādanīye vā cīvare vā senāsane vā bhesajje vā . Puggalassa deti, ‘‘imaṃ cīvaraṃ itthannāmassa dammī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Aṭṭhacīvaramātikā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Cīvarakkhandhako aṭṭhamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "233. Tassuddānaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Rājagahako ",
      " negamo, disvā vesāliyaṃ gaṇiṃ;"
    ],
    "innerText": "Rājagahako negamo, disvā vesāliyaṃ gaṇiṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Puna rājagahaṃ gantvā, rañño taṃ paṭivedayi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Putto ",
      " sālavatikāya, abhayassa hi atrajo;"
    ],
    "innerText": "Putto sālavatikāya, abhayassa hi atrajo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Jīvatīti kumārena, saṅkhāto jīvako iti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "So hi takkasīlaṃ gantvā, uggahetvā mahābhiso;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sattavassikaābādhaṃ, natthukammena nāsayi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Rañño ",
      " bhagandalābādhaṃ, ālepena apākaḍḍhi;"
    ],
    "innerText": "Rañño bhagandalābādhaṃ, ālepena apākaḍḍhi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Mamañca itthāgārañca, buddhasaṅghaṃ cupaṭṭhahi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Rājagahako ca seṭṭhi, antagaṇṭhi tikicchitaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pajjotassa mahārogaṃ, ghatapānena nāsayi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Adhikārañca siveyyaṃ, abhisannaṃ sinehati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tīhi uppalahatthehi, samattiṃsavirecanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Pakatattaṃ varaṃ yāci, siveyyañca paṭiggahi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Cīvarañca gihidānaṃ, anuññāsi tathāgato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Rājagahe janapade bahuṃ, uppajji cīvaraṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pāvāro kosiyañceva, kojavo aḍḍhakāsikaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Uccāvacā ca santuṭṭhi, nāgamesāgamesuṃ ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Paṭhamaṃ pacchā sadisā, katikā ca paṭiharuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Bhaṇḍāgāraṃ aguttañca, vuṭṭhāpenti tatheva ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ussannaṃ kolāhalañca, kathaṃ bhāje kathaṃ dade."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sakātirekabhāgena, paṭivīso kathaṃ dade;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Chakaṇena ",
      " sītudakā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sītundī ca (sī.), sītuṇhi ca (katthaci)]"
      },
      ", uttaritu na jānare."
    ],
    "innerText": "Chakaṇena sītudakā [sītundī ca (sī.), sītuṇhi ca (katthaci)], uttaritu na jānare."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Āropentā bhājanañca, pātiyā ca chamāya ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Upacikāmajjhe jīranti, ekato patthinnena ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Pharusācchinnacchibandhā ",
      ", addasāsi ubbhaṇḍite;"
    ],
    "innerText": "Pharusācchinnacchibandhā , addasāsi ubbhaṇḍite;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vīmaṃsitvā sakyamuni, anuññāsi ticīvaraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Aññena ",
      " atirekena, uppajji chiddameva ca;"
    ],
    "innerText": "Aññena atirekena, uppajji chiddameva ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Cātuddīpo varaṃ yāci, dātuṃ vassikasāṭikaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Āgantugamigilānaṃ, upaṭṭhākañca bhesajjaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dhuvaṃ udakasāṭiñca, paṇītaṃ atikhuddakaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Thullakacchumukhaṃ khomaṃ, paripuṇṇaṃ adhiṭṭhānaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pacchimaṃ kato garuko, vikaṇṇo suttamokiri."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Lujjanti ",
      " nappahonti, ca anvādhikaṃ bahūni ca;"
    ],
    "innerText": "Lujjanti nappahonti, ca anvādhikaṃ bahūni ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Andhavane assatiyā, eko vassaṃ utumhi ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Dve bhātukā rājagahe, upanando puna dvisu;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Kucchivikāro gilāno, ubho ceva gilānakā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[gilāyanā (ka.)]"
      },
      "."
    ],
    "innerText": "Kucchivikāro gilāno, ubho ceva gilānakā [gilāyanā (ka.)]."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Naggā kusā vākacīraṃ, phalako kesakambalaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vāḷaulūkapakkhañca, ajinaṃ akkanāḷakaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Potthakaṃ nīlapītañca, lohitaṃ mañjiṭṭhena ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kaṇhā mahāraṅganāma, acchinnadasikā tathā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Dīghapupphaphaṇadasā ",
      ", kañcutirīṭaveṭhanaṃ;"
    ],
    "innerText": "Dīghapupphaphaṇadasā , kañcutirīṭaveṭhanaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Anuppanne pakkamati, saṅgho bhijjati tāvade."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Pakkhe dadanti saṅghassa, āyasmā revato pahi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vissāsagāhādhiṭṭhāti, aṭṭha cīvaramātikāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Imamhi khandhake vatthū channavuti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Cīvarakkhandhako niṭṭhito."
  }
]