[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "2. Uposathakkhandhako"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "68. Sannipātānujānanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "132"
      },
      ". Tena ",
      " samayena buddho bhagavā rājagahe viharati gijjhakūṭe pabbate. Tena kho pana samayena aññatitthiyā paribbājakā cātuddase pannarase aṭṭhamiyā ca pakkhassa sannipatitvā dhammaṃ bhāsanti. Te manussā upasaṅkamanti dhammassavanāya. Te labhanti aññatitthiyesu paribbājakesu pemaṃ, labhanti pasādaṃ, labhanti aññatitthiyā paribbājakā pakkhaṃ. Atha kho rañño māgadhassa seniyassa bimbisārassa rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘‘etarahi kho aññatitthiyā paribbājakā cātuddase pannarase aṭṭhamiyā ca pakkhassa sannipatitvā dhammaṃ bhāsanti. Te manussā upasaṅkamanti dhammassavanāya. Te labhanti aññatitthiyesu paribbājakesu pemaṃ, labhanti pasādaṃ, labhanti aññatitthiyā paribbājakā pakkhaṃ. Yaṃnūna ayyāpi cātuddase pannarase aṭṭhamiyā ca pakkhassa sannipateyyu’’nti. Atha kho rājā māgadho seniyo bimbisāro yena bhagavā tenupasaṅkami, upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho rājā māgadho seniyo bimbisāro bhagavantaṃ etadavoca – ‘‘idha mayhaṃ, bhante, rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi ‘etarahi kho aññatitthiyā paribbājakā cātuddase pannarase aṭṭhamiyā ca pakkhassa sannipatitvā dhammaṃ bhāsanti. Te manussā ",
      " upasaṅkamanti dhammassavanāya. Te labhanti aññatitthiyesu paribbājakesu pemaṃ, labhanti pasādaṃ, labhanti aññatitthiyā paribbājakā pakkhaṃ. Yaṃnūna ayyāpi cātuddase pannarase aṭṭhamiyā ca pakkhassa sannipateyyu’nti. Sādhu, bhante, ayyāpi cātuddase pannarase aṭṭhamiyā ca pakkhassa sannipateyyu’’nti. Atha kho bhagavā rājānaṃ māgadhaṃ seniyaṃ bimbisāraṃ dhammiyā kathāya sandassesi samādapesi samuttejesi sampahaṃsesi. Atha kho rājā māgadho seniyo bimbisāro bhagavatā dhammiyā kathāya sandassito samādapito samuttejito sampahaṃsito uṭṭhāyāsanā bhagavantaṃ ",
      " abhivādetvā ",
      " padakkhiṇaṃ katvā pakkāmi. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi ",
      " – ‘‘anujānāmi, bhikkhave, cātuddase pannarase aṭṭhamiyā ca pakkhassa sannipatitu’’nti."
    ],
    "innerText": "132. Tena samayena buddho bhagavā rājagahe viharati gijjhakūṭe pabbate. Tena kho pana samayena aññatitthiyā paribbājakā cātuddase pannarase aṭṭhamiyā ca pakkhassa sannipatitvā dhammaṃ bhāsanti. Te manussā upasaṅkamanti dhammassavanāya. Te labhanti aññatitthiyesu paribbājakesu pemaṃ, labhanti pasādaṃ, labhanti aññatitthiyā paribbājakā pakkhaṃ. Atha kho rañño māgadhassa seniyassa bimbisārassa rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘‘etarahi kho aññatitthiyā paribbājakā cātuddase pannarase aṭṭhamiyā ca pakkhassa sannipatitvā dhammaṃ bhāsanti. Te manussā upasaṅkamanti dhammassavanāya. Te labhanti aññatitthiyesu paribbājakesu pemaṃ, labhanti pasādaṃ, labhanti aññatitthiyā paribbājakā pakkhaṃ. Yaṃnūna ayyāpi cātuddase pannarase aṭṭhamiyā ca pakkhassa sannipateyyu’’nti. Atha kho rājā māgadho seniyo bimbisāro yena bhagavā tenupasaṅkami, upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho rājā māgadho seniyo bimbisāro bhagavantaṃ etadavoca – ‘‘idha mayhaṃ, bhante, rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi ‘etarahi kho aññatitthiyā paribbājakā cātuddase pannarase aṭṭhamiyā ca pakkhassa sannipatitvā dhammaṃ bhāsanti. Te manussā upasaṅkamanti dhammassavanāya. Te labhanti aññatitthiyesu paribbājakesu pemaṃ, labhanti pasādaṃ, labhanti aññatitthiyā paribbājakā pakkhaṃ. Yaṃnūna ayyāpi cātuddase pannarase aṭṭhamiyā ca pakkhassa sannipateyyu’nti. Sādhu, bhante, ayyāpi cātuddase pannarase aṭṭhamiyā ca pakkhassa sannipateyyu’’nti. Atha kho bhagavā rājānaṃ māgadhaṃ seniyaṃ bimbisāraṃ dhammiyā kathāya sandassesi samādapesi samuttejesi sampahaṃsesi. Atha kho rājā māgadho seniyo bimbisāro bhagavatā dhammiyā kathāya sandassito samādapito samuttejito sampahaṃsito uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘anujānāmi, bhikkhave, cātuddase pannarase aṭṭhamiyā ca pakkhassa sannipatitu’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena kho pana samayena bhikkhū – bhagavatā anuññātā cātuddase pannarase aṭṭhamiyā ca pakkhassa sannipatitunti – cātuddase pannarase aṭṭhamiyā ca pakkhassa sannipatitvā tuṇhī nisīdanti. Te manussā upasaṅkamanti dhammassavanāya. Te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma samaṇā sakyaputtiyā cātuddase pannarase aṭṭhamiyā ca pakkhassa sannipatitvā tuṇhī nisīdissanti, seyyathāpi mūgasūkarā. Nanu nāma sannipatitehi dhammo bhāsitabbo’’ti. Assosuṃ kho bhikkhū tesaṃ manussānaṃ ujjhāyantānaṃ khiyyantānaṃ ",
      " vipācentānaṃ. Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘anujānāmi, bhikkhave, cātuddase pannarase aṭṭhamiyā ca pakkhassa sannipatitvā dhammaṃ bhāsitu’’nti."
    ],
    "innerText": "Tena kho pana samayena bhikkhū – bhagavatā anuññātā cātuddase pannarase aṭṭhamiyā ca pakkhassa sannipatitunti – cātuddase pannarase aṭṭhamiyā ca pakkhassa sannipatitvā tuṇhī nisīdanti. Te manussā upasaṅkamanti dhammassavanāya. Te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma samaṇā sakyaputtiyā cātuddase pannarase aṭṭhamiyā ca pakkhassa sannipatitvā tuṇhī nisīdissanti, seyyathāpi mūgasūkarā. Nanu nāma sannipatitehi dhammo bhāsitabbo’’ti. Assosuṃ kho bhikkhū tesaṃ manussānaṃ ujjhāyantānaṃ khiyyantānaṃ vipācentānaṃ. Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘anujānāmi, bhikkhave, cātuddase pannarase aṭṭhamiyā ca pakkhassa sannipatitvā dhammaṃ bhāsitu’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "69. Pātimokkhuddesānujānanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "133"
      },
      ". Atha kho bhagavato rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘‘yaṃnūnāhaṃ yāni mayā bhikkhūnaṃ paññattāni sikkhāpadāni, tāni nesaṃ pātimokkhuddesaṃ anujāneyyaṃ. So nesaṃ bhavissati uposathakamma’’nti. Atha kho bhagavā sāyanhasamayaṃ paṭisallānā vuṭṭhito etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – idha mayhaṃ, bhikkhave, rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi ‘yaṃnūnāhaṃ yāni mayā bhikkhūnaṃ paññattāni sikkhāpadāni, tāni nesaṃ pātimokkhuddesaṃ anujāneyyaṃ. So nesaṃ bhavissati uposathakamma’nti. Anujānāmi, bhikkhave, pātimokkhaṃ uddisituṃ. Evañca pana, bhikkhave, uddisitabbaṃ. Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
    ],
    "innerText": "133. Atha kho bhagavato rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘‘yaṃnūnāhaṃ yāni mayā bhikkhūnaṃ paññattāni sikkhāpadāni, tāni nesaṃ pātimokkhuddesaṃ anujāneyyaṃ. So nesaṃ bhavissati uposathakamma’’nti. Atha kho bhagavā sāyanhasamayaṃ paṭisallānā vuṭṭhito etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – idha mayhaṃ, bhikkhave, rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi ‘yaṃnūnāhaṃ yāni mayā bhikkhūnaṃ paññattāni sikkhāpadāni, tāni nesaṃ pātimokkhuddesaṃ anujāneyyaṃ. So nesaṃ bhavissati uposathakamma’nti. Anujānāmi, bhikkhave, pātimokkhaṃ uddisituṃ. Evañca pana, bhikkhave, uddisitabbaṃ. Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "134"
      },
      ". ‘‘Suṇātu me, bhante, saṅgho. Yadi saṅghassa ",
      " pattakallaṃ, saṅgho uposathaṃ kareyya, pātimokkhaṃ uddiseyya. Kiṃ saṅghassa pubbakiccaṃ? Pārisuddhiṃ āyasmanto ārocetha ",
      ". Pātimokkhaṃ uddisissāmi. Taṃ sabbeva santā sādhukaṃ suṇoma manasi karoma. Yassa siyā āpatti ",
      ", so āvikareyya. Asantiyā āpattiyā tuṇhī bhavitabbaṃ. Tuṇhībhāvena kho panāyasmante ",
      " parisuddhāti vedissāmi. Yathā kho pana paccekapuṭṭhassa veyyākaraṇaṃ hoti, evamevaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[evameva (ka)]"
      },
      " evarūpāya parisāya yāvatatiyaṃ anussāvitaṃ hoti. Yo pana bhikkhu yāvatatiyaṃ anussāviyamāne saramāno santiṃ āpattiṃ nāvikareyya, sampajānamusāvādassa hoti. Sampajānamusāvādo kho panāyasmanto antarāyiko dhammo vutto bhagavatā. Tasmā, saramānena bhikkhunā āpannena visuddhāpekkhena santī āpatti āvikātabbā; āvikatā hissa phāsu hotī’’ti."
    ],
    "innerText": "134. ‘‘Suṇātu me, bhante, saṅgho. Yadi saṅghassa pattakallaṃ, saṅgho uposathaṃ kareyya, pātimokkhaṃ uddiseyya. Kiṃ saṅghassa pubbakiccaṃ? Pārisuddhiṃ āyasmanto ārocetha . Pātimokkhaṃ uddisissāmi. Taṃ sabbeva santā sādhukaṃ suṇoma manasi karoma. Yassa siyā āpatti , so āvikareyya. Asantiyā āpattiyā tuṇhī bhavitabbaṃ. Tuṇhībhāvena kho panāyasmante parisuddhāti vedissāmi. Yathā kho pana paccekapuṭṭhassa veyyākaraṇaṃ hoti, evamevaṃ [evameva (ka)] evarūpāya parisāya yāvatatiyaṃ anussāvitaṃ hoti. Yo pana bhikkhu yāvatatiyaṃ anussāviyamāne saramāno santiṃ āpattiṃ nāvikareyya, sampajānamusāvādassa hoti. Sampajānamusāvādo kho panāyasmanto antarāyiko dhammo vutto bhagavatā. Tasmā, saramānena bhikkhunā āpannena visuddhāpekkhena santī āpatti āvikātabbā; āvikatā hissa phāsu hotī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "135"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pātimokkha"
      },
      "nti ādimetaṃ mukhametaṃ pamukhametaṃ kusalānaṃ dhammānaṃ. Tena vuccati pātimokkhanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āyasmanto"
      },
      "ti piyavacanametaṃ garuvacanametaṃ sagāravasappatissādhivacanametaṃ āyasmantoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uddisissāmī"
      },
      "ti ācikkhissāmi desessāmi paññapessāmi paṭṭhapessāmi vivarissāmi vibhajissāmi ",
      " uttāniṃ karissāmi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[uttānī karissāmi (sī. syā.)]"
      },
      " pakāsessāmi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ta"
      },
      "nti pātimokkhaṃ vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbeva santā"
      },
      "ti yāvatikā tassā parisāya therā ca navā ca majjhimā ca, ete vuccanti sabbeva santāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sādhukaṃ suṇomā"
      },
      "ti aṭṭhiṃ katvā manasi katvā sabbacetasā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sabbaṃ cetasā (syā. ka.)]"
      },
      " samannāharāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Manasi karomā"
      },
      "ti ekaggacittā avikkhittacittā avisāhaṭacittā nisāmema. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yassa siyā āpattī"
      },
      "ti therassa vā navassa vā majjhimassa vā, pañcannaṃ vā āpattikkhandhānaṃ aññatarā āpatti, sattannaṃ vā āpattikkhandhānaṃ aññatarā āpatti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "So āvikareyyā"
      },
      "ti so deseyya, so vivareyya, so uttāniṃ kareyya, so pakāseyya saṅghamajjhe vā gaṇamajjhe vā ekapuggale vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asantī"
      },
      " nāma ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āpatti"
      },
      " anajjhāpannā vā hoti, āpajjitvā vā vuṭṭhitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tuṇhī bhavitabba"
      },
      "nti adhivāsetabbaṃ na byāharitabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parisuddhāti vedissāmī"
      },
      "ti jānissāmi dhāressāmi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathā kho pana paccekapuṭṭhassa veyyākaraṇaṃ hotī"
      },
      "ti yathā ekena eko puṭṭho byākareyya, evameva tassā parisāya jānitabbaṃ maṃ pucchatīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evarūpā"
      },
      " nāma ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "parisā"
      },
      " bhikkhuparisā vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yāvatatiyaṃ anussāvitaṃ hotī"
      },
      "ti sakimpi anussāvitaṃ hoti, dutiyampi anussāvitaṃ hoti, tatiyampi anussāvitaṃ ",
      " hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saramāno"
      },
      "ti jānamāno sañjānamāno. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Santī"
      },
      " nāma ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āpatti"
      },
      " ajjhāpannā vā hoti, āpajjitvā vā avuṭṭhitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nāvikareyyā"
      },
      "ti na deseyya, na vivareyya, na uttāniṃ kareyya, na pakāseyya saṅghamajjhe ",
      " vā gaṇamajjhe vā ekapuggale vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sampajānamusāvādassa hotī"
      },
      "ti. Sampajānamusāvāde kiṃ hoti? Dukkaṭaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Antarāyiko dhammo vutto bhagavatā"
      },
      "ti. Kissa antarāyiko? Paṭhamassa jhānassa adhigamāya antarāyiko, dutiyassa jhānassa adhigamāya antarāyiko, tatiyassa jhānassa adhigamāya antarāyiko, catutthassa jhānassa adhigamāya antarāyiko, jhānānaṃ vimokkhānaṃ samādhīnaṃ samāpattīnaṃ nekkhammānaṃ nissaraṇānaṃ pavivekānaṃ kusalānaṃ dhammānaṃ adhigamāya ",
      " antarāyiko. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasmā"
      },
      "ti taṅkāraṇā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saramānenā"
      },
      "ti jānamānena sañjānamānena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Visuddhāpekkhenā"
      },
      "ti vuṭṭhātukāmena visujjhitukāmena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Santī"
      },
      " nāma ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āpatti"
      },
      " ajjhāpannā vā hoti, āpajjitvā vā avuṭṭhitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āvikātabbā"
      },
      "ti āvikātabbā saṅghamajjhe vā gaṇamajjhe vā ekapuggale vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āvikatā hissa phāsu hotī"
      },
      "ti. Kissa phāsu hoti? Paṭhamassa jhānassa adhigamāya phāsu hoti, dutiyassa jhānassa adhigamāya phāsu hoti, tatiyassa jhānassa ",
      " adhigamāya phāsu hoti, catutthassa jhānassa adhigamāya phāsu hoti, jhānānaṃ vimokkhānaṃ samādhīnaṃ samāpattīnaṃ nekkhammānaṃ nissaraṇānaṃ pavivekānaṃ kusalānaṃ dhammānaṃ adhigamāya phāsu hotīti."
    ],
    "innerText": "135.Pātimokkhanti ādimetaṃ mukhametaṃ pamukhametaṃ kusalānaṃ dhammānaṃ. Tena vuccati pātimokkhanti. Āyasmantoti piyavacanametaṃ garuvacanametaṃ sagāravasappatissādhivacanametaṃ āyasmantoti. Uddisissāmīti ācikkhissāmi desessāmi paññapessāmi paṭṭhapessāmi vivarissāmi vibhajissāmi uttāniṃ karissāmi [uttānī karissāmi (sī. syā.)] pakāsessāmi. Tanti pātimokkhaṃ vuccati. Sabbeva santāti yāvatikā tassā parisāya therā ca navā ca majjhimā ca, ete vuccanti sabbeva santāti. Sādhukaṃ suṇomāti aṭṭhiṃ katvā manasi katvā sabbacetasā [sabbaṃ cetasā (syā. ka.)] samannāharāma. Manasi karomāti ekaggacittā avikkhittacittā avisāhaṭacittā nisāmema. Yassa siyā āpattīti therassa vā navassa vā majjhimassa vā, pañcannaṃ vā āpattikkhandhānaṃ aññatarā āpatti, sattannaṃ vā āpattikkhandhānaṃ aññatarā āpatti. So āvikareyyāti so deseyya, so vivareyya, so uttāniṃ kareyya, so pakāseyya saṅghamajjhe vā gaṇamajjhe vā ekapuggale vā. Asantī nāma āpatti anajjhāpannā vā hoti, āpajjitvā vā vuṭṭhitā. Tuṇhī bhavitabbanti adhivāsetabbaṃ na byāharitabbaṃ. Parisuddhāti vedissāmīti jānissāmi dhāressāmi. Yathā kho pana paccekapuṭṭhassa veyyākaraṇaṃ hotīti yathā ekena eko puṭṭho byākareyya, evameva tassā parisāya jānitabbaṃ maṃ pucchatīti. Evarūpā nāma parisā bhikkhuparisā vuccati. Yāvatatiyaṃ anussāvitaṃ hotīti sakimpi anussāvitaṃ hoti, dutiyampi anussāvitaṃ hoti, tatiyampi anussāvitaṃ hoti. Saramānoti jānamāno sañjānamāno. Santī nāma āpatti ajjhāpannā vā hoti, āpajjitvā vā avuṭṭhitā. Nāvikareyyāti na deseyya, na vivareyya, na uttāniṃ kareyya, na pakāseyya saṅghamajjhe vā gaṇamajjhe vā ekapuggale vā. Sampajānamusāvādassa hotīti. Sampajānamusāvāde kiṃ hoti? Dukkaṭaṃ hoti. Antarāyiko dhammo vutto bhagavatāti. Kissa antarāyiko? Paṭhamassa jhānassa adhigamāya antarāyiko, dutiyassa jhānassa adhigamāya antarāyiko, tatiyassa jhānassa adhigamāya antarāyiko, catutthassa jhānassa adhigamāya antarāyiko, jhānānaṃ vimokkhānaṃ samādhīnaṃ samāpattīnaṃ nekkhammānaṃ nissaraṇānaṃ pavivekānaṃ kusalānaṃ dhammānaṃ adhigamāya antarāyiko. Tasmāti taṅkāraṇā. Saramānenāti jānamānena sañjānamānena. Visuddhāpekkhenāti vuṭṭhātukāmena visujjhitukāmena. Santī nāma āpatti ajjhāpannā vā hoti, āpajjitvā vā avuṭṭhitā. Āvikātabbāti āvikātabbā saṅghamajjhe vā gaṇamajjhe vā ekapuggale vā. Āvikatā hissa phāsu hotīti. Kissa phāsu hoti? Paṭhamassa jhānassa adhigamāya phāsu hoti, dutiyassa jhānassa adhigamāya phāsu hoti, tatiyassa jhānassa adhigamāya phāsu hoti, catutthassa jhānassa adhigamāya phāsu hoti, jhānānaṃ vimokkhānaṃ samādhīnaṃ samāpattīnaṃ nekkhammānaṃ nissaraṇānaṃ pavivekānaṃ kusalānaṃ dhammānaṃ adhigamāya phāsu hotīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "136"
      },
      ". Tena kho pana samayena bhikkhū – bhagavatā pātimokkhuddeso anuññātoti – devasikaṃ pātimokkhaṃ uddisanti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, devasikaṃ pātimokkhaṃ uddisitabbaṃ. Yo uddiseyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, uposathe pātimokkhaṃ uddisitunti."
    ],
    "innerText": "136. Tena kho pana samayena bhikkhū – bhagavatā pātimokkhuddeso anuññātoti – devasikaṃ pātimokkhaṃ uddisanti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, devasikaṃ pātimokkhaṃ uddisitabbaṃ. Yo uddiseyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, uposathe pātimokkhaṃ uddisitunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena kho pana samayena bhikkhū – bhagavatā uposathe pātimokkhuddeso anuññātoti – pakkhassa tikkhattuṃ pātimokkhaṃ uddisanti, cātuddase pannarase aṭṭhamiyā ca pakkhassa. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, pakkhassa tikkhattuṃ pātimokkhaṃ uddisitabbaṃ. Yo uddiseyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, sakiṃ pakkhassa cātuddase vā pannarase vā pātimokkhaṃ uddisitunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena ",
      " kho pana samayena chabbaggiyā bhikkhū yathāparisāya pātimokkhaṃ uddisanti sakāya sakāya parisāya. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, yathāparisāya ",
      " pātimokkhaṃ uddisitabbaṃ sakāya sakāya parisāya. Yo uddiseyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, samaggānaṃ uposathakammanti."
    ],
    "innerText": "Tena kho pana samayena chabbaggiyā bhikkhū yathāparisāya pātimokkhaṃ uddisanti sakāya sakāya parisāya. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, yathāparisāya pātimokkhaṃ uddisitabbaṃ sakāya sakāya parisāya. Yo uddiseyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, samaggānaṃ uposathakammanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho bhikkhūnaṃ etadahosi – ‘‘bhagavatā paññattaṃ ‘samaggānaṃ uposathakamma’nti. Kittāvatā ",
      " nu kho sāmaggī hoti, yāvatā ekāvāso, udāhu sabbā pathavī’’ti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, ettāvatā sāmaggī yāvatā ekāvāsoti."
    ],
    "innerText": "Atha kho bhikkhūnaṃ etadahosi – ‘‘bhagavatā paññattaṃ ‘samaggānaṃ uposathakamma’nti. Kittāvatā nu kho sāmaggī hoti, yāvatā ekāvāso, udāhu sabbā pathavī’’ti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, ettāvatā sāmaggī yāvatā ekāvāsoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "70. Mahākappinavatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "137"
      },
      ". Tena ",
      " kho pana samayena āyasmā mahākappino rājagahe viharati maddakucchimhi migadāye. Atha kho āyasmato mahākappinassa rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘‘gaccheyyaṃ vāhaṃ uposathaṃ na vā gaccheyyaṃ, gaccheyyaṃ vāhaṃ saṅghakammaṃ na vā gaccheyyaṃ, atha khvāhaṃ visuddho paramāya visuddhiyā’’ti? Atha kho bhagavā āyasmato mahākappinassa cetasā cetoparivitakkamaññāya – seyyathāpi nāma balavā puriso samiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya, evameva – gijjhakūṭe pabbate antarahito maddakucchimhi migadāye āyasmato mahākappinassa sammukhe pāturahosi. Nisīdi bhagavā paññatte āsane. Āyasmāpi kho mahākappino bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ mahākappinaṃ bhagavā etadavoca – ‘‘nanu te, kappina, rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – gaccheyyaṃ vāhaṃ uposathaṃ na vā gaccheyyaṃ, gaccheyyaṃ vāhaṃ saṅghakammaṃ na vā gaccheyyaṃ, atha khvāhaṃ visuddho paramāya visuddhiyā’’ti? ‘‘Evaṃ, bhante’’. ‘‘Tumhe ce brāhmaṇā uposathaṃ na sakkarissatha na ",
      " garukarissatha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[na garuṃ karissatha (ka.)]"
      },
      " na mānessatha na pūjessatha, atha ko carahi uposathaṃ sakkarissati garukarissati mānessati pūjessati? Gaccha tvaṃ, brāhmaṇa, uposathaṃ, mā no agamāsi. Gaccha tvaṃ saṅghakammaṃ, mā no agamāsī’’ti. ‘‘Evaṃ, bhante’’ti kho āyasmā mahākappino ",
      " bhagavato paccassosi. Atha kho bhagavā āyasmantaṃ mahākappinaṃ dhammiyā kathāya sandassetvā samādapetvā samuttejetvā sampahaṃsetvā – seyyathāpi nāma balavā puriso samiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya, evameva – maddakucchimhi migadāye āyasmato mahākappinassa sammukhe antarahito gijjhakūṭe pabbate pāturahosi."
    ],
    "innerText": "137. Tena kho pana samayena āyasmā mahākappino rājagahe viharati maddakucchimhi migadāye. Atha kho āyasmato mahākappinassa rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘‘gaccheyyaṃ vāhaṃ uposathaṃ na vā gaccheyyaṃ, gaccheyyaṃ vāhaṃ saṅghakammaṃ na vā gaccheyyaṃ, atha khvāhaṃ visuddho paramāya visuddhiyā’’ti? Atha kho bhagavā āyasmato mahākappinassa cetasā cetoparivitakkamaññāya – seyyathāpi nāma balavā puriso samiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya, evameva – gijjhakūṭe pabbate antarahito maddakucchimhi migadāye āyasmato mahākappinassa sammukhe pāturahosi. Nisīdi bhagavā paññatte āsane. Āyasmāpi kho mahākappino bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ mahākappinaṃ bhagavā etadavoca – ‘‘nanu te, kappina, rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – gaccheyyaṃ vāhaṃ uposathaṃ na vā gaccheyyaṃ, gaccheyyaṃ vāhaṃ saṅghakammaṃ na vā gaccheyyaṃ, atha khvāhaṃ visuddho paramāya visuddhiyā’’ti? ‘‘Evaṃ, bhante’’. ‘‘Tumhe ce brāhmaṇā uposathaṃ na sakkarissatha na garukarissatha [na garuṃ karissatha (ka.)] na mānessatha na pūjessatha, atha ko carahi uposathaṃ sakkarissati garukarissati mānessati pūjessati? Gaccha tvaṃ, brāhmaṇa, uposathaṃ, mā no agamāsi. Gaccha tvaṃ saṅghakammaṃ, mā no agamāsī’’ti. ‘‘Evaṃ, bhante’’ti kho āyasmā mahākappino bhagavato paccassosi. Atha kho bhagavā āyasmantaṃ mahākappinaṃ dhammiyā kathāya sandassetvā samādapetvā samuttejetvā sampahaṃsetvā – seyyathāpi nāma balavā puriso samiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya, evameva – maddakucchimhi migadāye āyasmato mahākappinassa sammukhe antarahito gijjhakūṭe pabbate pāturahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "71. Sīmānujānanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "138"
      },
      ". Atha ",
      " kho bhikkhūnaṃ etadahosi – ‘‘bhagavatā paññattaṃ ‘ettāvatā sāmaggī yāvatā ekāvāso’ti, kittāvatā nu kho ekāvāso hotī’’ti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, sīmaṃ sammannituṃ. Evañca pana, bhikkhave, sammannitabbā – paṭhamaṃ nimittā kittetabbā – pabbatanimittaṃ, pāsāṇanimittaṃ, vananimittaṃ, rukkhanimittaṃ, magganimittaṃ, vammikanimittaṃ, nadīnimittaṃ, udakanimittaṃ. Nimitte kittetvā byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
    ],
    "innerText": "138. Atha kho bhikkhūnaṃ etadahosi – ‘‘bhagavatā paññattaṃ ‘ettāvatā sāmaggī yāvatā ekāvāso’ti, kittāvatā nu kho ekāvāso hotī’’ti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, sīmaṃ sammannituṃ. Evañca pana, bhikkhave, sammannitabbā – paṭhamaṃ nimittā kittetabbā – pabbatanimittaṃ, pāsāṇanimittaṃ, vananimittaṃ, rukkhanimittaṃ, magganimittaṃ, vammikanimittaṃ, nadīnimittaṃ, udakanimittaṃ. Nimitte kittetvā byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "139"
      },
      ". ‘‘Suṇātu ",
      " me, bhante, saṅgho ",
      ". Yāvatā samantā nimittā kittitā. Yadi saṅghassa pattakallaṃ, saṅgho etehi nimittehi sīmaṃ sammanneyya samānasaṃvāsaṃ ekuposathaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ekūposathaṃ (ka.)]"
      },
      ". Esā ñatti."
    ],
    "innerText": "139. ‘‘Suṇātu me, bhante, saṅgho . Yāvatā samantā nimittā kittitā. Yadi saṅghassa pattakallaṃ, saṅgho etehi nimittehi sīmaṃ sammanneyya samānasaṃvāsaṃ ekuposathaṃ [ekūposathaṃ (ka.)]. Esā ñatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu me, bhante, saṅgho. Yāvatā samantā nimittā kittitā. Saṅgho etehi nimittehi sīmaṃ sammannati samānasaṃvāsaṃ ekuposathaṃ. Yassāyasmato khamati etehi nimittehi sīmāya sammuti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sammati (syā.)]"
      },
      " samānasaṃvāsāya ekuposathāya, so tuṇhassa; yassa nakkhamati, so bhāseyya. Sammatā sīmā saṅghena etehi nimittehi samānasaṃvāsā ekuposathā. Khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Yāvatā samantā nimittā kittitā. Saṅgho etehi nimittehi sīmaṃ sammannati samānasaṃvāsaṃ ekuposathaṃ. Yassāyasmato khamati etehi nimittehi sīmāya sammuti [sammati (syā.)] samānasaṃvāsāya ekuposathāya, so tuṇhassa; yassa nakkhamati, so bhāseyya. Sammatā sīmā saṅghena etehi nimittehi samānasaṃvāsā ekuposathā. Khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "140"
      },
      ". Tena kho pana samayena chabbaggiyā bhikkhū – bhagavatā sīmāsammuti anuññātāti – atimahatiyo sīmāyo sammannanti, catuyojanikāpi pañcayojanikāpi chayojanikāpi. Bhikkhū uposathaṃ āgacchantā uddissamānepi pātimokkhe āgacchanti, uddiṭṭhamattepi āgacchanti, antarāpi ",
      " parivasanti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, atimahatī sīmā sammannitabbā, catuyojanikā vā pañcayojanikā vā chayojanikā vā. Yo sammanneyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, tiyojanaparamaṃ sīmaṃ sammannitunti."
    ],
    "innerText": "140. Tena kho pana samayena chabbaggiyā bhikkhū – bhagavatā sīmāsammuti anuññātāti – atimahatiyo sīmāyo sammannanti, catuyojanikāpi pañcayojanikāpi chayojanikāpi. Bhikkhū uposathaṃ āgacchantā uddissamānepi pātimokkhe āgacchanti, uddiṭṭhamattepi āgacchanti, antarāpi parivasanti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, atimahatī sīmā sammannitabbā, catuyojanikā vā pañcayojanikā vā chayojanikā vā. Yo sammanneyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, tiyojanaparamaṃ sīmaṃ sammannitunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena kho pana samayena chabbaggiyā bhikkhū nadīpārasīmaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[nadīpāraṃ sīmaṃ (sī. syā.)]"
      },
      " sammannanti. Uposathaṃ āgacchantā bhikkhūpi vuyhanti, pattāpi vuyhanti ",
      ", cīvarānipi vuyhanti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, nadīpārasīmā sammannitabbā. Yo sammanneyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, yatthassa dhuvanāvā vā dhuvasetu vā, evarūpaṃ nadīpārasīmaṃ sammannitunti."
    ],
    "innerText": "Tena kho pana samayena chabbaggiyā bhikkhū nadīpārasīmaṃ [nadīpāraṃ sīmaṃ (sī. syā.)] sammannanti. Uposathaṃ āgacchantā bhikkhūpi vuyhanti, pattāpi vuyhanti , cīvarānipi vuyhanti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, nadīpārasīmā sammannitabbā. Yo sammanneyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, yatthassa dhuvanāvā vā dhuvasetu vā, evarūpaṃ nadīpārasīmaṃ sammannitunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "72. Uposathāgārakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "141"
      },
      ". Tena kho pana samayena bhikkhū anupariveṇiyaṃ pātimokkhaṃ ",
      " uddisanti asaṅketena. Āgantukā bhikkhū na jānanti – ‘‘kattha vā ajjuposatho karīyissatī’’ti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, anupariveṇiyaṃ pātimokkhaṃ uddisitabbaṃ asaṅketena. Yo uddiseyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, uposathāgāraṃ sammannitvā uposathaṃ kātuṃ, yaṃ saṅgho ākaṅkhati vihāraṃ vā aḍḍhayogaṃ vā pāsādaṃ vā hammiyaṃ vā ",
      " guhaṃ vā. Evañca pana, bhikkhave, sammannitabbaṃ. Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
    ],
    "innerText": "141. Tena kho pana samayena bhikkhū anupariveṇiyaṃ pātimokkhaṃ uddisanti asaṅketena. Āgantukā bhikkhū na jānanti – ‘‘kattha vā ajjuposatho karīyissatī’’ti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, anupariveṇiyaṃ pātimokkhaṃ uddisitabbaṃ asaṅketena. Yo uddiseyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, uposathāgāraṃ sammannitvā uposathaṃ kātuṃ, yaṃ saṅgho ākaṅkhati vihāraṃ vā aḍḍhayogaṃ vā pāsādaṃ vā hammiyaṃ vā guhaṃ vā. Evañca pana, bhikkhave, sammannitabbaṃ. Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Yadi saṅghassa pattakallaṃ, saṅgho itthannāmaṃ vihāraṃ uposathāgāraṃ sammanneyya. Esā ñatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Saṅgho itthannāmaṃ vihāraṃ uposathāgāraṃ sammannati. Yassāyasmato khamati itthannāmassa vihārassa uposathāgārassa sammuti, so tuṇhassa; yassa nakkhamati, so bhāseyya. Sammato saṅghena itthannāmo vihāro uposathāgāraṃ. Khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena ",
      " kho pana samayena aññatarasmiṃ āvāse dve uposathāgārāni sammatāni honti. Bhikkhū ubhayattha sannipatanti – ‘‘idha uposatho karīyissati, idha uposatho karīyissatī’’ti. Bhagavato etamatthaṃ ārocesuṃ ",
      ". Na, bhikkhave, ekasmiṃ āvāse dve uposathāgārāni sammannitabbāni. Yo sammanneyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, ekaṃ samūhanitvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[samuhanitvā (ka.)]"
      },
      " ekattha uposathaṃ kātuṃ. Evañca pana, bhikkhave, samūhantabbaṃ. Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
    ],
    "innerText": "Tena kho pana samayena aññatarasmiṃ āvāse dve uposathāgārāni sammatāni honti. Bhikkhū ubhayattha sannipatanti – ‘‘idha uposatho karīyissati, idha uposatho karīyissatī’’ti. Bhagavato etamatthaṃ ārocesuṃ . Na, bhikkhave, ekasmiṃ āvāse dve uposathāgārāni sammannitabbāni. Yo sammanneyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, ekaṃ samūhanitvā [samuhanitvā (ka.)] ekattha uposathaṃ kātuṃ. Evañca pana, bhikkhave, samūhantabbaṃ. Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu me, bhante, saṅgho. Yadi saṅghassa pattakallaṃ, saṅgho itthannāmaṃ uposathāgāraṃ samūhaneyya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[samuhaneyya (ka.)]"
      },
      ". Esā ñatti."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Yadi saṅghassa pattakallaṃ, saṅgho itthannāmaṃ uposathāgāraṃ samūhaneyya [samuhaneyya (ka.)]. Esā ñatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Saṅgho itthannāmaṃ uposathāgāraṃ samūhanati. Yassāyasmato khamati itthannāmassa uposathāgārassa samugghāto, so tuṇhassa; yassa nakkhamati, so bhāseyya. Samūhataṃ saṅghena itthannāmaṃ uposathāgāraṃ. Khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "73. Uposathappamukhānujānanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "142"
      },
      ". Tena kho pana samayena aññatarasmiṃ āvāse atikhuddakaṃ uposathāgāraṃ sammataṃ hoti, tadahuposathe mahābhikkhusaṅgho sannipatito hoti. Bhikkhū asammatāya bhūmiyā nisinnā pātimokkhaṃ ",
      " assosuṃ. Atha kho tesaṃ bhikkhūnaṃ etadahosi ‘‘bhagavatā paññattaṃ ‘uposathāgāraṃ sammannitvā ",
      " uposatho kātabbo’ti, mayañcamhā asammatāya bhūmiyā nisinno pātimokkhaṃ assumhā, kato nu kho amhākaṃ uposatho, akato ",
      " nu kho’’ti. Bhagavato etamatthaṃ ārocesuṃ. Sammatāya vā, bhikkhave, bhūmiyā nisinnā asammatāya vā yato pātimokkhaṃ suṇāti, katovassa uposatho. Tena hi, bhikkhave, saṅgho yāva mahantaṃ uposathappamukhaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[uposathamukhaṃ (syā.)]"
      },
      " ākaṅkhati, tāva mahantaṃ uposathappamukhaṃ sammannatu. Evañca pana, bhikkhave, sammannitabbaṃ. Paṭhamaṃ nimittā kittetabbā. Nimitte kittetvā byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
    ],
    "innerText": "142. Tena kho pana samayena aññatarasmiṃ āvāse atikhuddakaṃ uposathāgāraṃ sammataṃ hoti, tadahuposathe mahābhikkhusaṅgho sannipatito hoti. Bhikkhū asammatāya bhūmiyā nisinnā pātimokkhaṃ assosuṃ. Atha kho tesaṃ bhikkhūnaṃ etadahosi ‘‘bhagavatā paññattaṃ ‘uposathāgāraṃ sammannitvā uposatho kātabbo’ti, mayañcamhā asammatāya bhūmiyā nisinno pātimokkhaṃ assumhā, kato nu kho amhākaṃ uposatho, akato nu kho’’ti. Bhagavato etamatthaṃ ārocesuṃ. Sammatāya vā, bhikkhave, bhūmiyā nisinnā asammatāya vā yato pātimokkhaṃ suṇāti, katovassa uposatho. Tena hi, bhikkhave, saṅgho yāva mahantaṃ uposathappamukhaṃ [uposathamukhaṃ (syā.)] ākaṅkhati, tāva mahantaṃ uposathappamukhaṃ sammannatu. Evañca pana, bhikkhave, sammannitabbaṃ. Paṭhamaṃ nimittā kittetabbā. Nimitte kittetvā byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Yāvatā samantā nimittā kittitā. Yadi saṅghassa pattakallaṃ, saṅgho etehi nimittehi uposathappamukhaṃ sammanneyya. Esā ñatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu me, bhante, saṅgho. Yāvatā samantā nimittā kittitā. Saṅgho etehi nimittehi uposathappamukhaṃ sammannati. Yassāyasmato ",
      " khamati etehi nimittehi uposathappamukhassa sammuti, so tuṇhassa; yassa nakkhamati, so bhāseyya. Sammataṃ saṅghena etehi nimittehi uposathappamukhaṃ. Khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Yāvatā samantā nimittā kittitā. Saṅgho etehi nimittehi uposathappamukhaṃ sammannati. Yassāyasmato khamati etehi nimittehi uposathappamukhassa sammuti, so tuṇhassa; yassa nakkhamati, so bhāseyya. Sammataṃ saṅghena etehi nimittehi uposathappamukhaṃ. Khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena kho pana samayena aññatarasmiṃ āvāse tadahuposathe navakā bhikkhū paṭhamataraṃ sannipatitvā – ‘‘na tāva therā āgacchantī’’ti – pakkamiṃsu. Uposatho vikāle ahosi. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, tadahuposathe therehi bhikkhūhi paṭhamataraṃ sannipatitunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena ",
      " kho pana samayena rājagahe sambahulā āvāsā samānasīmā honti. Tattha bhikkhū vivadanti – ‘‘amhākaṃ āvāse uposatho karīyatu, amhākaṃ āvāse uposatho karīyatū’’ti. Bhagavato etamatthaṃ ārocesuṃ. Idha pana, bhikkhave, sambahulā āvāsā samānasīmā honti. Tattha bhikkhū vivadanti – ‘‘amhākaṃ āvāse uposatho karīyatu, amhākaṃ āvāse uposatho karīyatū’’ti. Tehi, bhikkhave, bhikkhūhi sabbeheva ekajjhaṃ sannipatitvā uposatho kātabbo. Yattha vā pana thero bhikkhu viharati, tattha sannipatitvā uposatho kātabbo, na tveva vaggena saṅghena uposatho kātabbo. Yo kareyya, āpatti dukkaṭassāti."
    ],
    "innerText": "Tena kho pana samayena rājagahe sambahulā āvāsā samānasīmā honti. Tattha bhikkhū vivadanti – ‘‘amhākaṃ āvāse uposatho karīyatu, amhākaṃ āvāse uposatho karīyatū’’ti. Bhagavato etamatthaṃ ārocesuṃ. Idha pana, bhikkhave, sambahulā āvāsā samānasīmā honti. Tattha bhikkhū vivadanti – ‘‘amhākaṃ āvāse uposatho karīyatu, amhākaṃ āvāse uposatho karīyatū’’ti. Tehi, bhikkhave, bhikkhūhi sabbeheva ekajjhaṃ sannipatitvā uposatho kātabbo. Yattha vā pana thero bhikkhu viharati, tattha sannipatitvā uposatho kātabbo, na tveva vaggena saṅghena uposatho kātabbo. Yo kareyya, āpatti dukkaṭassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "74. Avippavāsasīmānujānanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "143"
      },
      ". Tena ",
      " kho pana samayena āyasmā mahākassapo andhakavindā rājagahaṃ uposathaṃ āgacchanto antarāmagge nadiṃ taranto manaṃ vūḷho ahosi, cīvarānissa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[tena cīvarānissa (ka.)]"
      },
      " allāni. Bhikkhū āyasmantaṃ mahākassapaṃ etadavocuṃ – ‘‘kissa te, āvuso, cīvarāni allānī’’ti? ‘‘Idhāhaṃ, āvuso, andhakavindā rājagahaṃ uposathaṃ āgacchanto antarāmagge nadiṃ taranto manamhi vūḷho. Tena me cīvarāni allānī’’ti. Bhagavato etamatthaṃ ārocesuṃ. Yā sā, bhikkhave, saṅghena sīmā sammatā samānasaṃvāsā ekuposathā, saṅgho taṃ sīmaṃ ticīvarena avippavāsaṃ sammannatu. Evañca pana, bhikkhave, sammannitabbā. Byattena ",
      " bhikkhunā paṭibalena saṅgho ñāpetabbo –"
    ],
    "innerText": "143. Tena kho pana samayena āyasmā mahākassapo andhakavindā rājagahaṃ uposathaṃ āgacchanto antarāmagge nadiṃ taranto manaṃ vūḷho ahosi, cīvarānissa [tena cīvarānissa (ka.)] allāni. Bhikkhū āyasmantaṃ mahākassapaṃ etadavocuṃ – ‘‘kissa te, āvuso, cīvarāni allānī’’ti? ‘‘Idhāhaṃ, āvuso, andhakavindā rājagahaṃ uposathaṃ āgacchanto antarāmagge nadiṃ taranto manamhi vūḷho. Tena me cīvarāni allānī’’ti. Bhagavato etamatthaṃ ārocesuṃ. Yā sā, bhikkhave, saṅghena sīmā sammatā samānasaṃvāsā ekuposathā, saṅgho taṃ sīmaṃ ticīvarena avippavāsaṃ sammannatu. Evañca pana, bhikkhave, sammannitabbā. Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu ",
      " me, bhante, saṅgho. Yā sā saṅghena sīmā sammatā samānasaṃvāsā ekuposathā, yadi saṅghassa pattakallaṃ saṅgho taṃ sīmaṃ ticīvarena avippavāsaṃ sammanneyya. Esā ñatti."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Yā sā saṅghena sīmā sammatā samānasaṃvāsā ekuposathā, yadi saṅghassa pattakallaṃ saṅgho taṃ sīmaṃ ticīvarena avippavāsaṃ sammanneyya. Esā ñatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu me, bhante, saṅgho. Yā sā saṅghena sīmā sammatā samānasaṃvāsā ekuposathā, saṅgho taṃ sīmaṃ ticīvarena avippavāsaṃ sammannati. Yassāyasmato khamati etissā sīmāya ticīvarena avippavāsāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[avippavāsassa (syā.)]"
      },
      " sammuti, so tuṇhassa; yassa nakkhamati, so bhāseyya. Sammatā sā sīmā saṅghena ticīvarena avippavāsā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[avippavāso (syā.)]"
      },
      ". Khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Yā sā saṅghena sīmā sammatā samānasaṃvāsā ekuposathā, saṅgho taṃ sīmaṃ ticīvarena avippavāsaṃ sammannati. Yassāyasmato khamati etissā sīmāya ticīvarena avippavāsāya [avippavāsassa (syā.)] sammuti, so tuṇhassa; yassa nakkhamati, so bhāseyya. Sammatā sā sīmā saṅghena ticīvarena avippavāsā [avippavāso (syā.)]. Khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena kho pana samayena bhikkhū bhagavatā ticīvarena avippavāsasammuti anuññātāti antaraghare cīvarāni nikkhipanti. Tāni cīvarāni nassantipi ḍayhantipi undūrehipi khajjanti. Bhikkhū duccoḷā honti lūkhacīvarā. Bhikkhū evamāhaṃsu – ‘‘kissa tumhe, āvuso, duccoḷā lūkhacīvarā’’ti? ‘‘Idha mayaṃ, āvuso, bhagavatā ticīvarena avippavāsasammuti anuññātāti antaraghare cīvarāni nikkhipimhā ",
      ". Tāni cīvarāni naṭṭhānipi daḍḍhānipi, undūrehipi khāyitāni, tena mayaṃ duccoḷā lūkhacīvarā’’ti. Bhagavato etamatthaṃ ārocesuṃ. Yā sā, bhikkhave, saṅghena sīmā sammatā samānasaṃvāsā ekuposathā, saṅgho taṃ sīmaṃ ticīvarena avippavāsaṃ sammannatu, ṭhapetvā gāmañca gāmūpacārañca. Evañca pana, bhikkhave, sammannitabbā. Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
    ],
    "innerText": "Tena kho pana samayena bhikkhū bhagavatā ticīvarena avippavāsasammuti anuññātāti antaraghare cīvarāni nikkhipanti. Tāni cīvarāni nassantipi ḍayhantipi undūrehipi khajjanti. Bhikkhū duccoḷā honti lūkhacīvarā. Bhikkhū evamāhaṃsu – ‘‘kissa tumhe, āvuso, duccoḷā lūkhacīvarā’’ti? ‘‘Idha mayaṃ, āvuso, bhagavatā ticīvarena avippavāsasammuti anuññātāti antaraghare cīvarāni nikkhipimhā . Tāni cīvarāni naṭṭhānipi daḍḍhānipi, undūrehipi khāyitāni, tena mayaṃ duccoḷā lūkhacīvarā’’ti. Bhagavato etamatthaṃ ārocesuṃ. Yā sā, bhikkhave, saṅghena sīmā sammatā samānasaṃvāsā ekuposathā, saṅgho taṃ sīmaṃ ticīvarena avippavāsaṃ sammannatu, ṭhapetvā gāmañca gāmūpacārañca. Evañca pana, bhikkhave, sammannitabbā. Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "144"
      },
      ". ‘‘Suṇātu ",
      " me, bhante, saṅgho. Yā sā saṅghena sīmā sammatā samānasaṃvāsā ekuposathā yadi saṅghassa pattakallaṃ, saṅgho taṃ sīmaṃ ticīvarena avippavāsaṃ sammanneyya, ṭhapetvā gāmañca ",
      " gāmūpacārañca. Esā ñatti."
    ],
    "innerText": "144. ‘‘Suṇātu me, bhante, saṅgho. Yā sā saṅghena sīmā sammatā samānasaṃvāsā ekuposathā yadi saṅghassa pattakallaṃ, saṅgho taṃ sīmaṃ ticīvarena avippavāsaṃ sammanneyya, ṭhapetvā gāmañca gāmūpacārañca. Esā ñatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu me, bhante, saṅgho. Yā sā saṅghena sīmā sammatā samānasaṃvāsā ekuposathā, saṅgho taṃ sīmaṃ ticīvarena avippavāsaṃ sammannati, ṭhapetvā gāmañca gāmūpacārañca. Yassāyasmato khamati etissā sīmāya ticīvarena avippavāsāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[avippavāsassa (syā.)]"
      },
      " sammuti, ṭhapetvā gāmañca gāmūpacārañca, so tuṇhassa; yassa nakkhamati, so bhāseyya. Sammatā sā ",
      " sīmā saṅghena ticīvarena avippavāsā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[avippavāso (syā.)]"
      },
      ", ṭhapetvā gāmañca gāmūpacārañca. Khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Yā sā saṅghena sīmā sammatā samānasaṃvāsā ekuposathā, saṅgho taṃ sīmaṃ ticīvarena avippavāsaṃ sammannati, ṭhapetvā gāmañca gāmūpacārañca. Yassāyasmato khamati etissā sīmāya ticīvarena avippavāsāya [avippavāsassa (syā.)] sammuti, ṭhapetvā gāmañca gāmūpacārañca, so tuṇhassa; yassa nakkhamati, so bhāseyya. Sammatā sā sīmā saṅghena ticīvarena avippavāsā [avippavāso (syā.)], ṭhapetvā gāmañca gāmūpacārañca. Khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "75. Sīmāsamūhanana"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sīmaṃ, bhikkhave, sammannantena paṭhamaṃ samānasaṃvāsasīmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[samānasaṃvāsā sīmā (syā.)]"
      },
      " sammannitabbā ",
      ", pacchā ticīvarena avippavāso sammannitabbo. Sīmaṃ, bhikkhave, samūhanantena paṭhamaṃ ticīvarena avippavāso samūhantabbo, pacchā samānasaṃvāsasīmā samūhantabbā. Evañca pana, bhikkhave, ticīvarena avippavāso samūhantabbo. Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
    ],
    "innerText": "‘‘Sīmaṃ, bhikkhave, sammannantena paṭhamaṃ samānasaṃvāsasīmā [samānasaṃvāsā sīmā (syā.)] sammannitabbā , pacchā ticīvarena avippavāso sammannitabbo. Sīmaṃ, bhikkhave, samūhanantena paṭhamaṃ ticīvarena avippavāso samūhantabbo, pacchā samānasaṃvāsasīmā samūhantabbā. Evañca pana, bhikkhave, ticīvarena avippavāso samūhantabbo. Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "145"
      },
      ". ‘‘Suṇātu me, bhante, saṅgho. Yo so saṅghena ticīvarena avippavāso sammato, yadi saṅghassa pattakallaṃ, saṅgho taṃ ticīvarena avippavāsaṃ samūhaneyya. Esā ñatti."
    ],
    "innerText": "145. ‘‘Suṇātu me, bhante, saṅgho. Yo so saṅghena ticīvarena avippavāso sammato, yadi saṅghassa pattakallaṃ, saṅgho taṃ ticīvarena avippavāsaṃ samūhaneyya. Esā ñatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Yo so saṅghena ticīvarena avippavāso sammato, saṅgho taṃ ticīvarena avippavāsaṃ samūhanati. Yassāyasmato khamati etassa ticīvarena avippavāsassa samugghāto, so tuṇhassa; yassa nakkhamati, so bhāseyya. Samūhato so saṅghena ticīvarena avippavāso. Khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evañca pana, bhikkhave, sīmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[samānasaṃvāsā sīmā (syā.)]"
      },
      ". Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
    ],
    "innerText": "Evañca pana, bhikkhave, sīmā [samānasaṃvāsā sīmā (syā.)]. Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "146"
      },
      ". ‘‘Suṇātu me, bhante, saṅgho. Yā sā saṅghena sīmā sammatā samānasaṃvāsā ekuposathā ",
      ", yadi saṅghassa pattakallaṃ, saṅgho taṃ sīmaṃ samūhaneyya samānasaṃvāsaṃ ekuposathaṃ. Esā ñatti."
    ],
    "innerText": "146. ‘‘Suṇātu me, bhante, saṅgho. Yā sā saṅghena sīmā sammatā samānasaṃvāsā ekuposathā , yadi saṅghassa pattakallaṃ, saṅgho taṃ sīmaṃ samūhaneyya samānasaṃvāsaṃ ekuposathaṃ. Esā ñatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu me, bhante, saṅgho. Yā sā saṅghena sīmā sammatā samānasaṃvāsā ekuposathā, saṅgho taṃ ",
      " sīmaṃ samūhanati samānasaṃvāsaṃ ekuposathaṃ. Yassāyasmato khamati etissā sīmāya samānasaṃvāsāya ekuposathāya samugghāto, so tuṇhassa; yassa nakkhamati, so bhāseyya. Samūhatā sā sīmā saṅghena samānasaṃvāsā ekuposathā. Khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Yā sā saṅghena sīmā sammatā samānasaṃvāsā ekuposathā, saṅgho taṃ sīmaṃ samūhanati samānasaṃvāsaṃ ekuposathaṃ. Yassāyasmato khamati etissā sīmāya samānasaṃvāsāya ekuposathāya samugghāto, so tuṇhassa; yassa nakkhamati, so bhāseyya. Samūhatā sā sīmā saṅghena samānasaṃvāsā ekuposathā. Khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "76. Gāmasīmādi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "147"
      },
      ". Asammatāya ",
      ", bhikkhave, sīmāya aṭṭhapitāya, yaṃ gāmaṃ vā nigamaṃ vā upanissāya viharati, yā tassa vā gāmassa gāmasīmā, nigamassa ",
      " vā nigamasīmā, ayaṃ tattha samānasaṃvāsā ",
      " ekuposathā. Agāmake ce, bhikkhave, araññe samantā sattabbhantarā, ayaṃ tattha samānasaṃvāsā ekuposathā. Sabbā, bhikkhave, nadī asīmā; sabbo samuddo asīmo; sabbo jātassaro asīmo. Nadiyā vā, bhikkhave, samudde vā jātassare vā yaṃ majjhimassa purisassa samantā udakukkhepā, ayaṃ tattha samānasaṃvāsā ekuposathāti."
    ],
    "innerText": "147. Asammatāya , bhikkhave, sīmāya aṭṭhapitāya, yaṃ gāmaṃ vā nigamaṃ vā upanissāya viharati, yā tassa vā gāmassa gāmasīmā, nigamassa vā nigamasīmā, ayaṃ tattha samānasaṃvāsā ekuposathā. Agāmake ce, bhikkhave, araññe samantā sattabbhantarā, ayaṃ tattha samānasaṃvāsā ekuposathā. Sabbā, bhikkhave, nadī asīmā; sabbo samuddo asīmo; sabbo jātassaro asīmo. Nadiyā vā, bhikkhave, samudde vā jātassare vā yaṃ majjhimassa purisassa samantā udakukkhepā, ayaṃ tattha samānasaṃvāsā ekuposathāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "148"
      },
      ". Tena kho pana samayena chabbaggiyā bhikkhū sīmāya sīmaṃ sambhindanti. Bhagavato etamatthaṃ ārocesuṃ. Yesaṃ, bhikkhave, sīmā paṭhamaṃ sammatā tesaṃ taṃ kammaṃ dhammikaṃ akuppaṃ ṭhānārahaṃ. Yesaṃ, bhikkhave, sīmā pacchā sammatā tesaṃ taṃ kammaṃ adhammikaṃ kuppaṃ aṭṭhānārahaṃ. Na, bhikkhave, sīmāya sīmā sambhinditabbā. Yo sambhindeyya, āpatti dukkaṭassāti."
    ],
    "innerText": "148. Tena kho pana samayena chabbaggiyā bhikkhū sīmāya sīmaṃ sambhindanti. Bhagavato etamatthaṃ ārocesuṃ. Yesaṃ, bhikkhave, sīmā paṭhamaṃ sammatā tesaṃ taṃ kammaṃ dhammikaṃ akuppaṃ ṭhānārahaṃ. Yesaṃ, bhikkhave, sīmā pacchā sammatā tesaṃ taṃ kammaṃ adhammikaṃ kuppaṃ aṭṭhānārahaṃ. Na, bhikkhave, sīmāya sīmā sambhinditabbā. Yo sambhindeyya, āpatti dukkaṭassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena kho pana samayena chabbaggiyā bhikkhū sīmāya sīmaṃ ajjhottharanti. Bhagavato etamatthaṃ ārocesuṃ. Yesaṃ, bhikkhave, sīmā paṭhamaṃ sammatā tesaṃ taṃ kammaṃ dhammikaṃ akuppaṃ ṭhānārahaṃ. Yesaṃ, bhikkhave, sīmā pacchā sammatā tesaṃ taṃ kammaṃ adhammikaṃ kuppaṃ aṭṭhānārahaṃ. Na, bhikkhave, sīmāya sīmā ajjhottharitabbā. Yo ajjhotthareyya, āpatti dukkaṭassāti. Anujānāmi, bhikkhave, sīmaṃ sammannantena sīmantarikaṃ ṭhapetvā sīmaṃ sammannitunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "77. Uposathabhedādi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "149"
      },
      ". Atha ",
      " kho bhikkhūnaṃ etadahosi – ‘‘kati nu kho uposathā’’ti? Bhagavato ",
      " etamatthaṃ ārocesuṃ. Dveme, bhikkhave, uposathā – cātuddasiko ca pannarasiko ca. Ime kho, bhikkhave, dve uposathāti."
    ],
    "innerText": "149. Atha kho bhikkhūnaṃ etadahosi – ‘‘kati nu kho uposathā’’ti? Bhagavato etamatthaṃ ārocesuṃ. Dveme, bhikkhave, uposathā – cātuddasiko ca pannarasiko ca. Ime kho, bhikkhave, dve uposathāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho bhikkhūnaṃ etadahosi – ‘‘kati nu kho uposathakammānī’’ti? Bhagavato etamatthaṃ ārocesuṃ. Cattārimāni, bhikkhave, uposathakammāni ",
      " – adhammena vaggaṃ uposathakammaṃ, adhammena samaggaṃ uposathakammaṃ, dhammena vaggaṃ uposathakammaṃ, dhammena samaggaṃ uposathakammanti. Tatra, bhikkhave, yadidaṃ adhammena vaggaṃ uposathakammaṃ, na, bhikkhave, evarūpaṃ uposathakammaṃ, kātabbaṃ. Na ca mayā evarūpaṃ uposathakammaṃ anuññātaṃ. Tatra, bhikkhave, yadidaṃ adhammena samaggaṃ uposathakammaṃ, na, bhikkhave, evarūpaṃ ",
      " uposathakammaṃ kātabbaṃ. Na ca mayā evarūpaṃ uposathakammaṃ anuññātaṃ. Tatra, bhikkhave, yadidaṃ dhammena vaggaṃ uposathakammaṃ, na, bhikkhave, evarūpaṃ uposathakammaṃ kātabbaṃ. Na ca mayā evarūpaṃ uposathakammaṃ anuññātaṃ. Tatra, bhikkhave, yadidaṃ dhammena samaggaṃ uposathakammaṃ, evarūpaṃ, bhikkhave, uposathakammaṃ kātabbaṃ, evarūpañca mayā uposathakammaṃ anuññātaṃ. Tasmātiha, bhikkhave, evarūpaṃ uposathakammaṃ karissāma yadidaṃ dhammena samagganti – evañhi vo, bhikkhave, sikkhitabbanti."
    ],
    "innerText": "Atha kho bhikkhūnaṃ etadahosi – ‘‘kati nu kho uposathakammānī’’ti? Bhagavato etamatthaṃ ārocesuṃ. Cattārimāni, bhikkhave, uposathakammāni – adhammena vaggaṃ uposathakammaṃ, adhammena samaggaṃ uposathakammaṃ, dhammena vaggaṃ uposathakammaṃ, dhammena samaggaṃ uposathakammanti. Tatra, bhikkhave, yadidaṃ adhammena vaggaṃ uposathakammaṃ, na, bhikkhave, evarūpaṃ uposathakammaṃ, kātabbaṃ. Na ca mayā evarūpaṃ uposathakammaṃ anuññātaṃ. Tatra, bhikkhave, yadidaṃ adhammena samaggaṃ uposathakammaṃ, na, bhikkhave, evarūpaṃ uposathakammaṃ kātabbaṃ. Na ca mayā evarūpaṃ uposathakammaṃ anuññātaṃ. Tatra, bhikkhave, yadidaṃ dhammena vaggaṃ uposathakammaṃ, na, bhikkhave, evarūpaṃ uposathakammaṃ kātabbaṃ. Na ca mayā evarūpaṃ uposathakammaṃ anuññātaṃ. Tatra, bhikkhave, yadidaṃ dhammena samaggaṃ uposathakammaṃ, evarūpaṃ, bhikkhave, uposathakammaṃ kātabbaṃ, evarūpañca mayā uposathakammaṃ anuññātaṃ. Tasmātiha, bhikkhave, evarūpaṃ uposathakammaṃ karissāma yadidaṃ dhammena samagganti – evañhi vo, bhikkhave, sikkhitabbanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "78. Saṃkhittena pātimokkhuddesādi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "150"
      },
      ". Atha kho bhikkhūnaṃ etadahosi – ‘‘kati nu kho pātimokkhuddesā’’ti? Bhagavato etamatthaṃ ārocesuṃ. Pañcime, bhikkhave, pātimokkhuddesā – nidānaṃ uddisitvā avasesaṃ sutena sāvetabbaṃ. Ayaṃ ",
      " paṭhamo pātimokkhuddeso. Nidānaṃ uddisitvā cattāri pārājikāni uddisitvā avasesaṃ sutena sāvetabbaṃ. Ayaṃ dutiyo pātimokkhuddeso. Nidānaṃ uddisitvā cattāri pārājikāni uddisitvā terasa saṅghādisese uddisitvā avasesaṃ sutena sāvetabbaṃ. Ayaṃ tatiyo pātimokkhuddeso. Nidānaṃ uddisitvā cattāri pārājikāni uddisitvā terasa saṅghādisese uddisitvā dve aniyate uddisitvā avasesaṃ sutena sāvetabbaṃ. Ayaṃ catuttho pātimokkhuddeso. Vitthāreneva pañcamo. Ime kho, bhikkhave, pañca pātimokkhuddesāti."
    ],
    "innerText": "150. Atha kho bhikkhūnaṃ etadahosi – ‘‘kati nu kho pātimokkhuddesā’’ti? Bhagavato etamatthaṃ ārocesuṃ. Pañcime, bhikkhave, pātimokkhuddesā – nidānaṃ uddisitvā avasesaṃ sutena sāvetabbaṃ. Ayaṃ paṭhamo pātimokkhuddeso. Nidānaṃ uddisitvā cattāri pārājikāni uddisitvā avasesaṃ sutena sāvetabbaṃ. Ayaṃ dutiyo pātimokkhuddeso. Nidānaṃ uddisitvā cattāri pārājikāni uddisitvā terasa saṅghādisese uddisitvā avasesaṃ sutena sāvetabbaṃ. Ayaṃ tatiyo pātimokkhuddeso. Nidānaṃ uddisitvā cattāri pārājikāni uddisitvā terasa saṅghādisese uddisitvā dve aniyate uddisitvā avasesaṃ sutena sāvetabbaṃ. Ayaṃ catuttho pātimokkhuddeso. Vitthāreneva pañcamo. Ime kho, bhikkhave, pañca pātimokkhuddesāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena ",
      " kho pana samayena bhikkhū – bhagavatā saṃkhittena pātimokkhuddeso anuññātoti – sabbakālaṃ saṃkhittena pātimokkhaṃ uddisanti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, saṃkhittena pātimokkhaṃ uddisitabbaṃ. Yo uddiseyya, āpatti dukkaṭassāti."
    ],
    "innerText": "Tena kho pana samayena bhikkhū – bhagavatā saṃkhittena pātimokkhuddeso anuññātoti – sabbakālaṃ saṃkhittena pātimokkhaṃ uddisanti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, saṃkhittena pātimokkhaṃ uddisitabbaṃ. Yo uddiseyya, āpatti dukkaṭassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena ",
      " kho pana samayena kosalesu janapade aññatarasmiṃ āvāse tadahuposathe savarabhayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[saṃcarabhayaṃ (syā.)]"
      },
      " ahosi. Bhikkhū nāsakkhiṃsu vitthārena pātimokkhaṃ uddisituṃ. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, sati antarāye saṃkhittena pātimokkhaṃ uddisitunti."
    ],
    "innerText": "Tena kho pana samayena kosalesu janapade aññatarasmiṃ āvāse tadahuposathe savarabhayaṃ [saṃcarabhayaṃ (syā.)] ahosi. Bhikkhū nāsakkhiṃsu vitthārena pātimokkhaṃ uddisituṃ. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, sati antarāye saṃkhittena pātimokkhaṃ uddisitunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena kho pana samayena chabbaggiyā bhikkhū ",
      " asatipi antarāye saṃkhittena pātimokkhaṃ uddisanti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, asati antarāye saṃkhittena pātimokkhaṃ uddisitabbaṃ. Yo uddiseyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, sati antarāye saṃkhittena pātimokkhaṃ uddisituṃ. Tatrime antarāyā – rājantarāyo, corantarāyo, agyantarāyo, udakantarāyo, manussantarāyo, amanussantarāyo ",
      ", vāḷantarāyo, sarīsapantarāyo, jīvitantarāyo, brahmacariyantarāyoti. Anujānāmi, bhikkhave, evarūpesu antarāyesu saṃkhittena pātimokkhaṃ uddisituṃ, asati antarāye vitthārenāti."
    ],
    "innerText": "Tena kho pana samayena chabbaggiyā bhikkhū asatipi antarāye saṃkhittena pātimokkhaṃ uddisanti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, asati antarāye saṃkhittena pātimokkhaṃ uddisitabbaṃ. Yo uddiseyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, sati antarāye saṃkhittena pātimokkhaṃ uddisituṃ. Tatrime antarāyā – rājantarāyo, corantarāyo, agyantarāyo, udakantarāyo, manussantarāyo, amanussantarāyo , vāḷantarāyo, sarīsapantarāyo, jīvitantarāyo, brahmacariyantarāyoti. Anujānāmi, bhikkhave, evarūpesu antarāyesu saṃkhittena pātimokkhaṃ uddisituṃ, asati antarāye vitthārenāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena kho pana samayena chabbaggiyā bhikkhū saṅghamajjhe anajjhiṭṭhā dhammaṃ bhāsanti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, saṅghamajjhe anajjhiṭṭhena dhammo bhāsitabbo. Yo bhāseyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, therena bhikkhunā sāmaṃ vā dhammaṃ bhāsituṃ paraṃ vā ajjhesitunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "79. Vinayapucchanakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "151"
      },
      ". Tena kho pana samayena chabbaggiyā bhikkhū saṅghamajjhe asammatā vinayaṃ pucchanti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, saṅghamajjhe asammatena vinayo pucchitabbo. Yo puccheyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, saṅghamajjhe sammatena vinayaṃ pucchituṃ. Evañca pana, bhikkhave, sammannitabbo – attanā vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[attanāva (syā.)]"
      },
      " attānaṃ sammannitabbaṃ, parena vā paro sammannitabbo. Kathañca ",
      " attanāva attānaṃ sammannitabbaṃ? Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
    ],
    "innerText": "151. Tena kho pana samayena chabbaggiyā bhikkhū saṅghamajjhe asammatā vinayaṃ pucchanti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, saṅghamajjhe asammatena vinayo pucchitabbo. Yo puccheyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, saṅghamajjhe sammatena vinayaṃ pucchituṃ. Evañca pana, bhikkhave, sammannitabbo – attanā vā [attanāva (syā.)] attānaṃ sammannitabbaṃ, parena vā paro sammannitabbo. Kathañca attanāva attānaṃ sammannitabbaṃ? Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu ",
      " me, bhante, saṅgho. Yadi saṅghassa pattakallaṃ, ahaṃ itthannāmaṃ vinayaṃ puccheyya’’nti. Evaṃ attanāva attānaṃ sammannitabbaṃ."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Yadi saṅghassa pattakallaṃ, ahaṃ itthannāmaṃ vinayaṃ puccheyya’’nti. Evaṃ attanāva attānaṃ sammannitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kathañca parena paro sammannitabbo? Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Yadi saṅghassa pattakallaṃ, itthannāmo itthannāmaṃ vinayaṃ puccheyyā’’ti. Evaṃ parena paro sammannitabboti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena kho pana samayena pesalā bhikkhū saṅghamajjhe sammatā vinayaṃ pucchanti. Chabbaggiyā bhikkhū labhanti āghātaṃ, labhanti appaccayaṃ, vadhena tajjenti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, saṅghamajjhe sammatenapi parisaṃ oloketvā puggalaṃ tulayitvā vinayaṃ pucchitunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "80. Vinayavissajjanakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "152"
      },
      ". Tena kho pana samayena chabbaggiyā bhikkhū saṅghamajjhe asammatā vinayaṃ vissajjenti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vissajjanti (ka.)]"
      },
      ". Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, saṅghamajjhe asammatena vinayo vissajjetabbo. Yo vissajjeyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, saṅghamajjhe sammatena vinayaṃ vissajjetuṃ. Evañca pana, bhikkhave, sammannitabbaṃ. Attanā vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[attanāva (syā.)]"
      },
      " attānaṃ sammannitabbaṃ, parena vā paro sammannitabbo. Kathañca ",
      " attanāva attānaṃ sammannitabbaṃ? Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
    ],
    "innerText": "152. Tena kho pana samayena chabbaggiyā bhikkhū saṅghamajjhe asammatā vinayaṃ vissajjenti [vissajjanti (ka.)]. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, saṅghamajjhe asammatena vinayo vissajjetabbo. Yo vissajjeyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, saṅghamajjhe sammatena vinayaṃ vissajjetuṃ. Evañca pana, bhikkhave, sammannitabbaṃ. Attanā vā [attanāva (syā.)] attānaṃ sammannitabbaṃ, parena vā paro sammannitabbo. Kathañca attanāva attānaṃ sammannitabbaṃ? Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu me, bhante, saṅgho. Yadi saṅghassa pattakallaṃ, ahaṃ ",
      " itthannāmena vinayaṃ puṭṭho vissajjeyya’’nti. Evaṃ attanāva attānaṃ sammannitabbaṃ."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Yadi saṅghassa pattakallaṃ, ahaṃ itthannāmena vinayaṃ puṭṭho vissajjeyya’’nti. Evaṃ attanāva attānaṃ sammannitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kathañca parena paro sammannitabbo? Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Yadi saṅghassa pattakallaṃ, itthannāmo itthannāmena vinayaṃ puṭṭho vissajjeyyā’’ti. Evaṃ parena paro sammannitabboti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena ",
      " kho pana samayena pesalā bhikkhū saṅghamajjhe sammatā vinayaṃ vissajjenti. Chabbaggiyā bhikkhū labhanti āghātaṃ, labhanti appaccayaṃ, vadhena tajjenti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, saṅghamajjhe sammatenapi parisaṃ oloketvā puggalaṃ tulayitvā vinayaṃ vissajjetunti."
    ],
    "innerText": "Tena kho pana samayena pesalā bhikkhū saṅghamajjhe sammatā vinayaṃ vissajjenti. Chabbaggiyā bhikkhū labhanti āghātaṃ, labhanti appaccayaṃ, vadhena tajjenti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, saṅghamajjhe sammatenapi parisaṃ oloketvā puggalaṃ tulayitvā vinayaṃ vissajjetunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "81. Codanākathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "153"
      },
      ". Tena kho pana samayena chabbaggiyā bhikkhū anokāsakataṃ bhikkhuṃ āpattiyā codenti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, anokāsakato bhikkhu āpattiyā codetabbo. Yo codeyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, okāsaṃ kārāpetvā āpattiyā codetuṃ – karotu āyasmā okāsaṃ, ahaṃ taṃ vattukāmoti."
    ],
    "innerText": "153. Tena kho pana samayena chabbaggiyā bhikkhū anokāsakataṃ bhikkhuṃ āpattiyā codenti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, anokāsakato bhikkhu āpattiyā codetabbo. Yo codeyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, okāsaṃ kārāpetvā āpattiyā codetuṃ – karotu āyasmā okāsaṃ, ahaṃ taṃ vattukāmoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena kho pana samayena pesalā bhikkhū chabbaggiye bhikkhū okāsaṃ kārāpetvā āpattiyā codenti. Chabbaggiyā bhikkhū labhanti āghātaṃ, labhanti appaccayaṃ, vadhena tajjenti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, katepi okāse puggalaṃ tulayitvā āpattiyā codetunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena kho pana samayena chabbaggiyā ",
      " bhikkhū – puramhākaṃ pesalā bhikkhū okāsaṃ kārāpentīti – paṭikacceva suddhānaṃ bhikkhūnaṃ anāpattikānaṃ avatthusmiṃ akāraṇe okāsaṃ kārāpenti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, suddhānaṃ bhikkhūnaṃ anāpattikānaṃ avatthusmiṃ akāraṇe okāso kārāpetabbo. Yo kārāpeyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, puggalaṃ tulayitvā okāsaṃ kātu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kārāpetuṃ (syā.)]"
      },
      " nti."
    ],
    "innerText": "Tena kho pana samayena chabbaggiyā bhikkhū – puramhākaṃ pesalā bhikkhū okāsaṃ kārāpentīti – paṭikacceva suddhānaṃ bhikkhūnaṃ anāpattikānaṃ avatthusmiṃ akāraṇe okāsaṃ kārāpenti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, suddhānaṃ bhikkhūnaṃ anāpattikānaṃ avatthusmiṃ akāraṇe okāso kārāpetabbo. Yo kārāpeyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, puggalaṃ tulayitvā okāsaṃ kātu [kārāpetuṃ (syā.)] nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "82. Adhammakammapaṭikkosanādi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "154"
      },
      ". Tena kho pana samayena chabbaggiyā bhikkhū saṅghamajjhe adhammakammaṃ karonti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, adhammakammaṃ kātabbaṃ. Yo kareyya, āpatti dukkaṭassāti. Karontiyeva adhammakammaṃ. Bhagavato etamatthaṃ ārocesuṃ ",
      ". Anujānāmi, bhikkhave, adhammakamme kayiramāne paṭikkositunti."
    ],
    "innerText": "154. Tena kho pana samayena chabbaggiyā bhikkhū saṅghamajjhe adhammakammaṃ karonti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, adhammakammaṃ kātabbaṃ. Yo kareyya, āpatti dukkaṭassāti. Karontiyeva adhammakammaṃ. Bhagavato etamatthaṃ ārocesuṃ . Anujānāmi, bhikkhave, adhammakamme kayiramāne paṭikkositunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena ",
      " kho pana samayena pesalā bhikkhū chabbaggiyehi bhikkhūhi adhammakamme kayiramāne paṭikkosanti. Chabbaggiyā bhikkhū labhanti āghātaṃ, labhanti appaccayaṃ, vadhena tajjenti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, diṭṭhimpi āvikātunti. Tesaṃyeva santike diṭṭhiṃ āvikaronti. Chabbaggiyā bhikkhū labhanti āghātaṃ, labhanti appaccayaṃ, vadhena tajjenti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, catūhi pañcahi paṭikkosituṃ, dvīhi tīhi diṭṭhiṃ āvikātuṃ, ekena adhiṭṭhātuṃ – ‘na metaṃ khamatī’ti."
    ],
    "innerText": "Tena kho pana samayena pesalā bhikkhū chabbaggiyehi bhikkhūhi adhammakamme kayiramāne paṭikkosanti. Chabbaggiyā bhikkhū labhanti āghātaṃ, labhanti appaccayaṃ, vadhena tajjenti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, diṭṭhimpi āvikātunti. Tesaṃyeva santike diṭṭhiṃ āvikaronti. Chabbaggiyā bhikkhū labhanti āghātaṃ, labhanti appaccayaṃ, vadhena tajjenti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, catūhi pañcahi paṭikkosituṃ, dvīhi tīhi diṭṭhiṃ āvikātuṃ, ekena adhiṭṭhātuṃ – ‘na metaṃ khamatī’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena kho pana samayena chabbaggiyā bhikkhū saṅghamajjhe pātimokkhaṃ ",
      " uddisamānā sañcicca na sāventi. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, pātimokkhuddesakena sañcicca na sāvetabbaṃ. Yo na sāveyya, āpatti dukkaṭassāti."
    ],
    "innerText": "Tena kho pana samayena chabbaggiyā bhikkhū saṅghamajjhe pātimokkhaṃ uddisamānā sañcicca na sāventi. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, pātimokkhuddesakena sañcicca na sāvetabbaṃ. Yo na sāveyya, āpatti dukkaṭassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena kho pana samayena āyasmā udāyī saṅghassa pātimokkhuddesako hoti kākassarako. Atha kho āyasmato udāyissa etadahosi – ‘‘bhagavatā paññattaṃ ‘pātimokkhuddesakena sāvetabba’nti, ahañcamhi kākassarako, kathaṃ nu kho mayā paṭipajjitabba’’nti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, pātimokkhuddesakena vāyamituṃ – ‘kathaṃ sāveyya’nti. Vāyamantassa anāpattīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena kho pana samayena devadatto sagahaṭṭhāya parisāya pātimokkhaṃ uddisati. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, sagahaṭṭhāya parisāya pātimokkhaṃ uddisitabbaṃ. Yo uddiseyya, āpatti dukkaṭassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena kho pana samayena chabbaggiyā bhikkhū saṅghamajjhe anajjhiṭṭhā pātimokkhaṃ uddisanti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, saṅghamajjhe anajjhiṭṭhena pātimokkhaṃ uddisitabbaṃ. Yo uddiseyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, therādhikaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[therādheyyaṃ (aṭṭhakathāyaṃ pāṭhantaraṃ)]"
      },
      " pātimokkhanti."
    ],
    "innerText": "Tena kho pana samayena chabbaggiyā bhikkhū saṅghamajjhe anajjhiṭṭhā pātimokkhaṃ uddisanti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, saṅghamajjhe anajjhiṭṭhena pātimokkhaṃ uddisitabbaṃ. Yo uddiseyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, therādhikaṃ [therādheyyaṃ (aṭṭhakathāyaṃ pāṭhantaraṃ)] pātimokkhanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "children": [
      "Aññatitthiyabhāṇavāro niṭṭhito paṭhamo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ekādasamo (ka.)]"
      },
      "."
    ],
    "innerText": "Aññatitthiyabhāṇavāro niṭṭhito paṭhamo [ekādasamo (ka.)]."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "83. Pātimokkhuddesakaajjhesanādi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "155"
      },
      ". Atha ",
      " kho bhagavā rājagahe yathābhirantaṃ viharitvā yena codanāvatthu tena cārikaṃ pakkāmi. Anupubbena cārikaṃ caramāno yena codanāvatthu tadavasari. Tena kho pana samayena aññatarasmiṃ āvāse sambahulā bhikkhū viharanti ",
      ". Tattha thero bhikkhu bālo hoti abyatto. So na jānāti uposathaṃ vā uposathakammaṃ vā, pātimokkhaṃ vā pātimokkhuddesaṃ vā. Atha kho tesaṃ bhikkhūnaṃ etadahosi – ‘‘bhagavatā paññattaṃ ‘therādhikaṃ pātimokkha’nti, ayañca amhākaṃ thero bālo abyatto, na jānāti uposathaṃ vā uposathakammaṃ vā, pātimokkhaṃ vā pātimokkhuddesaṃ vā. Kathaṃ nu kho amhehi paṭipajjitabba’’nti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, yo tattha bhikkhu byatto paṭibalo tassādheyyaṃ pātimokkhanti."
    ],
    "innerText": "155. Atha kho bhagavā rājagahe yathābhirantaṃ viharitvā yena codanāvatthu tena cārikaṃ pakkāmi. Anupubbena cārikaṃ caramāno yena codanāvatthu tadavasari. Tena kho pana samayena aññatarasmiṃ āvāse sambahulā bhikkhū viharanti . Tattha thero bhikkhu bālo hoti abyatto. So na jānāti uposathaṃ vā uposathakammaṃ vā, pātimokkhaṃ vā pātimokkhuddesaṃ vā. Atha kho tesaṃ bhikkhūnaṃ etadahosi – ‘‘bhagavatā paññattaṃ ‘therādhikaṃ pātimokkha’nti, ayañca amhākaṃ thero bālo abyatto, na jānāti uposathaṃ vā uposathakammaṃ vā, pātimokkhaṃ vā pātimokkhuddesaṃ vā. Kathaṃ nu kho amhehi paṭipajjitabba’’nti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, yo tattha bhikkhu byatto paṭibalo tassādheyyaṃ pātimokkhanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena kho pana samayena aññatarasmiṃ āvāse tadahuposathe sambahulā bhikkhū viharanti bālā abyattā. Te na jānanti uposathaṃ vā uposathakammaṃ vā, pātimokkhaṃ vā pātimokkhuddesaṃ vā. Te theraṃ ajjhesiṃsu – ‘‘uddisatu, bhante, thero pātimokkha’’nti. So evamāha – ‘‘na me, āvuso, vattatī’’ti. Dutiyaṃ theraṃ ajjhesiṃsu – ‘‘uddisatu, bhante, thero pātimokkha’’nti. Sopi evamāha – ‘‘na me, āvuso, vattatī’’ti. Tatiyaṃ theraṃ ajjhesiṃsu – ‘‘uddisatu ",
      ", bhante, thero pātimokkha’’nti. Sopi evamāha – ‘‘na me, āvuso, vattatī’’ti. Eteneva upāyena yāva saṅghanavakaṃ ajjhesiṃsu – ‘‘uddisatu āyasmā pātimokkha’’nti. Sopi evamāha – ‘‘na me, bhante, vattatī’’ti. Bhagavato etamatthaṃ ārocesuṃ."
    ],
    "innerText": "Tena kho pana samayena aññatarasmiṃ āvāse tadahuposathe sambahulā bhikkhū viharanti bālā abyattā. Te na jānanti uposathaṃ vā uposathakammaṃ vā, pātimokkhaṃ vā pātimokkhuddesaṃ vā. Te theraṃ ajjhesiṃsu – ‘‘uddisatu, bhante, thero pātimokkha’’nti. So evamāha – ‘‘na me, āvuso, vattatī’’ti. Dutiyaṃ theraṃ ajjhesiṃsu – ‘‘uddisatu, bhante, thero pātimokkha’’nti. Sopi evamāha – ‘‘na me, āvuso, vattatī’’ti. Tatiyaṃ theraṃ ajjhesiṃsu – ‘‘uddisatu , bhante, thero pātimokkha’’nti. Sopi evamāha – ‘‘na me, āvuso, vattatī’’ti. Eteneva upāyena yāva saṅghanavakaṃ ajjhesiṃsu – ‘‘uddisatu āyasmā pātimokkha’’nti. Sopi evamāha – ‘‘na me, bhante, vattatī’’ti. Bhagavato etamatthaṃ ārocesuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā bhikkhū viharanti bālā abyattā. Te na jānanti uposathaṃ vā uposathakammaṃ vā, pātimokkhaṃ vā pātimokkhuddesaṃ vā. Te theraṃ ajjhesanti – ‘‘uddisatu, bhante, thero pātimokkha’’nti. So evaṃ vadeti – ‘‘na me, āvuso, vattatī’’ti. Dutiyaṃ theraṃ ajjhesanti – ‘‘uddisatu, bhante, thero pātimokkha’’nti. Sopi evaṃ vadeti – ‘‘na me, āvuso, vattatī’’ti. Tatiyaṃ ",
      " theraṃ ajjhesanti – ‘‘uddisatu, bhante, thero pātimokkha’’nti. Sopi evaṃ vadeti – ‘‘na me, āvuso, vattatī’’ti. Eteneva upāyena yāva saṅghanavakaṃ ajjhesanti – ‘‘uddisatu āyasmā pātimokkha’’nti. Sopi evaṃ vadeti – ‘‘na me, bhante, vattatī’’ti. Tehi, bhikkhave, bhikkhūhi ",
      " eko bhikkhu sāmantā āvāsā sajjukaṃ pāhetabbo – gacchāvuso, saṃkhittena vā vitthārena vā pātimokkhaṃ pariyāpuṇitvāna āgacchāhīti."
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā bhikkhū viharanti bālā abyattā. Te na jānanti uposathaṃ vā uposathakammaṃ vā, pātimokkhaṃ vā pātimokkhuddesaṃ vā. Te theraṃ ajjhesanti – ‘‘uddisatu, bhante, thero pātimokkha’’nti. So evaṃ vadeti – ‘‘na me, āvuso, vattatī’’ti. Dutiyaṃ theraṃ ajjhesanti – ‘‘uddisatu, bhante, thero pātimokkha’’nti. Sopi evaṃ vadeti – ‘‘na me, āvuso, vattatī’’ti. Tatiyaṃ theraṃ ajjhesanti – ‘‘uddisatu, bhante, thero pātimokkha’’nti. Sopi evaṃ vadeti – ‘‘na me, āvuso, vattatī’’ti. Eteneva upāyena yāva saṅghanavakaṃ ajjhesanti – ‘‘uddisatu āyasmā pātimokkha’’nti. Sopi evaṃ vadeti – ‘‘na me, bhante, vattatī’’ti. Tehi, bhikkhave, bhikkhūhi eko bhikkhu sāmantā āvāsā sajjukaṃ pāhetabbo – gacchāvuso, saṃkhittena vā vitthārena vā pātimokkhaṃ pariyāpuṇitvāna āgacchāhīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho bhikkhūnaṃ etadahosi – ‘‘kena nu kho pāhetabbo’’ti? Bhagavato ",
      " etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, therena bhikkhunā navaṃ bhikkhuṃ āṇāpetunti. Therena āṇattā navā bhikkhū na gacchanti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, therena ",
      " āṇattena agilānena na gantabbaṃ. Yo na gaccheyya, āpatti dukkaṭassāti."
    ],
    "innerText": "Atha kho bhikkhūnaṃ etadahosi – ‘‘kena nu kho pāhetabbo’’ti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, therena bhikkhunā navaṃ bhikkhuṃ āṇāpetunti. Therena āṇattā navā bhikkhū na gacchanti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, therena āṇattena agilānena na gantabbaṃ. Yo na gaccheyya, āpatti dukkaṭassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "84. Pakkhagaṇanādiuggahaṇānujānanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "156"
      },
      ". Atha kho bhagavā codanāvatthusmiṃ yathābhirantaṃ viharitvā punadeva rājagahaṃ paccāgañchi."
    ],
    "innerText": "156. Atha kho bhagavā codanāvatthusmiṃ yathābhirantaṃ viharitvā punadeva rājagahaṃ paccāgañchi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena kho pana samayena manussā bhikkhū piṇḍāya carante pucchanti – ‘‘katimī, bhante, pakkhassā’’ti? Bhikkhū evamāhaṃsu – ‘‘na kho mayaṃ, āvuso, jānāmā’’ti. Manussā ujjhāyanti khiyyanti vipācenti – ‘‘pakkhagaṇanamattamampime samaṇā sakyaputtiyā na jānanti, kiṃ panime aññaṃ kiñci kalyāṇaṃ jānissantī’’ti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, pakkhagaṇanaṃ uggahetunti. Atha kho bhikkhūnaṃ etadahosi – ‘‘kena nu kho pakkhagaṇanā uggahetabbā’’ti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, sabbeheva pakkhagaṇanaṃ uggahetunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "157"
      },
      ". Tena kho pana samayena manussā bhikkhū piṇḍāya carante pucchanti – ‘‘kīvatikā, bhante, bhikkhū’’ti? Bhikkhū evamāhaṃsu – ‘‘na kho mayaṃ, āvuso, jānāmā’’ti. Manussā ujjhāyanti khiyyanti vipācenti – ‘‘aññamaññampime samaṇā sakyaputtiyā na jānanti, kiṃ panime aññaṃ kiñci ",
      " kalyāṇaṃ jānissantī’’ti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, bhikkhū gaṇetunti."
    ],
    "innerText": "157. Tena kho pana samayena manussā bhikkhū piṇḍāya carante pucchanti – ‘‘kīvatikā, bhante, bhikkhū’’ti? Bhikkhū evamāhaṃsu – ‘‘na kho mayaṃ, āvuso, jānāmā’’ti. Manussā ujjhāyanti khiyyanti vipācenti – ‘‘aññamaññampime samaṇā sakyaputtiyā na jānanti, kiṃ panime aññaṃ kiñci kalyāṇaṃ jānissantī’’ti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, bhikkhū gaṇetunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " kho bhikkhūnaṃ etadahosi – ‘‘kadā nu kho bhikkhū gaṇetabbā’’ti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, tadahuposathe nāmaggena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[nāmamattena (syā.), gaṇamaggena (ka.)]"
      },
      " gaṇetuṃ, salākaṃ vā gāhetunti."
    ],
    "innerText": "Atha kho bhikkhūnaṃ etadahosi – ‘‘kadā nu kho bhikkhū gaṇetabbā’’ti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, tadahuposathe nāmaggena [nāmamattena (syā.), gaṇamaggena (ka.)] gaṇetuṃ, salākaṃ vā gāhetunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "158"
      },
      ". Tena ",
      " kho pana samayena bhikkhū ajānantā ajjuposathoti dūraṃ gāmaṃ piṇḍāya caranti. Te uddissamānepi pātimokkhe āgacchanti, uddiṭṭhamattepi āgacchanti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, ārocetuṃ ‘ajjuposatho’ti."
    ],
    "innerText": "158. Tena kho pana samayena bhikkhū ajānantā ajjuposathoti dūraṃ gāmaṃ piṇḍāya caranti. Te uddissamānepi pātimokkhe āgacchanti, uddiṭṭhamattepi āgacchanti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, ārocetuṃ ‘ajjuposatho’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha kho bhikkhūnaṃ etadahosi – ‘‘kena nu kho ārocetabbo’’ti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, therena bhikkhunā kālavato ārocetunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena kho pana samayena aññataro thero kālavato nassarati. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, bhattakālepi ārocetunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Bhattakālepi nassarati. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, yaṃ kālaṃ sarati, taṃ kālaṃ ārocetunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "85. Pubbakaraṇānujānanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "159"
      },
      ". Tena ",
      " kho pana samayena aññatarasmiṃ āvāse uposathāgāraṃ uklāpaṃ hoti. Āgantukā bhikkhū ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi ",
      " nāma āvāsikā bhikkhū uposathāgāraṃ na sammajjissantī’’ti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, uposathāgāraṃ sammajjitunti."
    ],
    "innerText": "159. Tena kho pana samayena aññatarasmiṃ āvāse uposathāgāraṃ uklāpaṃ hoti. Āgantukā bhikkhū ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma āvāsikā bhikkhū uposathāgāraṃ na sammajjissantī’’ti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, uposathāgāraṃ sammajjitunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha kho bhikkhūnaṃ etadahosi – ‘‘kena nu kho uposathāgāraṃ sammajjitabba’’nti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, therena bhikkhunā navaṃ bhikkhuṃ āṇāpetunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Therena āṇattā navā bhikkhū na sammajjanti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, therena āṇattena agilānena na sammajjitabbaṃ. Yo na sammajjeyya, āpatti dukkaṭassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "160"
      },
      ". Tena ",
      " kho pana samayena uposathāgāre āsanaṃ apaññattaṃ hoti. Bhikkhū chamāyaṃ ",
      " nisīdanti, gattānipi cīvarānipi paṃsukitāni honti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, uposathāgāre āsanaṃ paññapetunti."
    ],
    "innerText": "160. Tena kho pana samayena uposathāgāre āsanaṃ apaññattaṃ hoti. Bhikkhū chamāyaṃ nisīdanti, gattānipi cīvarānipi paṃsukitāni honti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, uposathāgāre āsanaṃ paññapetunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha kho bhikkhūnaṃ etadahosi – ‘‘kena nu kho uposathāgāre āsanaṃ paññapetabba’’nti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, therena bhikkhunā navaṃ bhikkhuṃ āṇāpetunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Therena āṇattā navā bhikkhū na paññapenti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, therena āṇattena agilānena na paññapetabbaṃ. Yo na paññapeyya, āpatti dukkaṭassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "161"
      },
      ". Tena kho pana samayena uposathāgāre padīpo na hoti. Bhikkhū andhakāre kāyampi cīvarampi akkamanti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, uposathāgāre padīpaṃ ",
      " kātunti."
    ],
    "innerText": "161. Tena kho pana samayena uposathāgāre padīpo na hoti. Bhikkhū andhakāre kāyampi cīvarampi akkamanti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, uposathāgāre padīpaṃ kātunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha kho bhikkhūnaṃ etadahosi – ‘‘kena nu kho uposathāgāre padīpo kātabbo’’ti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, therena bhikkhunā navaṃ bhikkhuṃ āṇāpetunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Therena āṇattā navā bhikkhū na padīpenti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, therena āṇattena agilānena na padīpetabbo. Yo na padīpeyya, āpatti dukkaṭassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "162"
      },
      ". Tena kho pana samayena aññatarasmiṃ āvāse āvāsikā bhikkhū neva pānīyaṃ upaṭṭhāpenti, na paribhojanīyaṃ upaṭṭhāpenti. Āgantukā bhikkhū ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma āvāsikā bhikkhū neva pānīyaṃ upaṭṭhāpessanti, na paribhojanīyaṃ upaṭṭhāpessantī’’ti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave ",
      ", pānīyaṃ paribhojanīyaṃ upaṭṭhāpetunti."
    ],
    "innerText": "162. Tena kho pana samayena aññatarasmiṃ āvāse āvāsikā bhikkhū neva pānīyaṃ upaṭṭhāpenti, na paribhojanīyaṃ upaṭṭhāpenti. Āgantukā bhikkhū ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma āvāsikā bhikkhū neva pānīyaṃ upaṭṭhāpessanti, na paribhojanīyaṃ upaṭṭhāpessantī’’ti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave , pānīyaṃ paribhojanīyaṃ upaṭṭhāpetunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho bhikkhūnaṃ etadahosi – ‘‘kena nu kho pānīyaṃ paribhojanīyaṃ upaṭṭhāpetabba’’nti ",
      "? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, therena bhikkhunā navaṃ bhikkhuṃ āṇāpetunti."
    ],
    "innerText": "Atha kho bhikkhūnaṃ etadahosi – ‘‘kena nu kho pānīyaṃ paribhojanīyaṃ upaṭṭhāpetabba’’nti ? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, therena bhikkhunā navaṃ bhikkhuṃ āṇāpetunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Therena ",
      " āṇattā navā bhikkhū na upaṭṭhāpenti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, therena āṇattena agilānena na upaṭṭhāpetabbaṃ. Yo na upaṭṭhāpeyya, āpatti dukkaṭassāti."
    ],
    "innerText": "Therena āṇattā navā bhikkhū na upaṭṭhāpenti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, therena āṇattena agilānena na upaṭṭhāpetabbaṃ. Yo na upaṭṭhāpeyya, āpatti dukkaṭassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "86. Disaṃgamikādivatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "163"
      },
      ". Tena kho pana samayena sambahulā bhikkhū bālā abyattā disaṃgamikā ",
      " ācariyupajjhāye na āpucchiṃsu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[na āpucchiṃsu (ka.)]"
      },
      ". Bhagavato etamatthaṃ ārocesuṃ."
    ],
    "innerText": "163. Tena kho pana samayena sambahulā bhikkhū bālā abyattā disaṃgamikā ācariyupajjhāye na āpucchiṃsu [na āpucchiṃsu (ka.)]. Bhagavato etamatthaṃ ārocesuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, sambahulā bhikkhū bālā abyattā disaṃgamikā ācariyupajjhāye na āpucchanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[na āpucchanti (ka.)]"
      },
      ". Te ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[tehi (ka.)]"
      },
      ", bhikkhave, ācariyupajjhāyehi pucchitabbā – ‘‘kahaṃ gamissatha, kena saddhiṃ gamissathā’’ti? Te ce, bhikkhave, bālā abyattā aññe bāle abyatte apadiseyyuṃ, na, bhikkhave, ācariyupajjhāyehi anujānitabbā. Anujāneyyuṃ ce, āpatti dukkaṭassa. Te ca, bhikkhave, bālā abyattā ananuññātā ācariyupajjhāyehi gaccheyyuṃ ce, āpatti dukkaṭassa."
    ],
    "innerText": "Idha pana, bhikkhave, sambahulā bhikkhū bālā abyattā disaṃgamikā ācariyupajjhāye na āpucchanti [na āpucchanti (ka.)]. Te [tehi (ka.)], bhikkhave, ācariyupajjhāyehi pucchitabbā – ‘‘kahaṃ gamissatha, kena saddhiṃ gamissathā’’ti? Te ce, bhikkhave, bālā abyattā aññe bāle abyatte apadiseyyuṃ, na, bhikkhave, ācariyupajjhāyehi anujānitabbā. Anujāneyyuṃ ce, āpatti dukkaṭassa. Te ca, bhikkhave, bālā abyattā ananuññātā ācariyupajjhāyehi gaccheyyuṃ ce, āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse sambahulā bhikkhū viharanti bālā abyattā. Te na jānanti uposathaṃ vā uposathakammaṃ vā, pātimokkhaṃ vā pātimokkhuddesaṃ vā. Tattha añño bhikkhu āgacchati bahussuto āgatāgamo dhammadharo vinayadharo mātikādharo paṇḍito byatto medhāvī lajjī kukkuccako sikkhākāmo. Tehi, bhikkhave, bhikkhūhi so bhikkhu saṅgahetabbo anuggahetabbo upalāpetabbo upaṭṭhāpetabbo cuṇṇena mattikāya dantakaṭṭhena mukhodakena. No ce saṅgaṇheyyuṃ anuggaṇheyyuṃ upalāpeyyuṃ upaṭṭhāpeyyuṃ cuṇṇena mattikāya dantakaṭṭhena mukhodakena, āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā bhikkhū ",
      " viharanti bālā abyattā. Te na jānanti uposathaṃ vā uposathakammaṃ vā, pātimokkhaṃ vā pātimokkhuddesaṃ vā. Tehi, bhikkhave, bhikkhūhi eko bhikkhu sāmantā āvāsā sajjukaṃ pāhetabbo ",
      " – ‘‘gacchāvuso, saṃkhittena vā vitthārena vā pātimokkhaṃ pariyāpuṇitvā āgacchā’’ti. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, tehi, bhikkhave, bhikkhūhi ",
      " sabbeheva yattha jānanti uposathaṃ vā uposathakammaṃ vā pātimokkhaṃ vā pātimokkhuddesaṃ vā, so āvāso gantabbo ",
      ". No ce gaccheyyuṃ, āpatti dukkaṭassa."
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā bhikkhū viharanti bālā abyattā. Te na jānanti uposathaṃ vā uposathakammaṃ vā, pātimokkhaṃ vā pātimokkhuddesaṃ vā. Tehi, bhikkhave, bhikkhūhi eko bhikkhu sāmantā āvāsā sajjukaṃ pāhetabbo – ‘‘gacchāvuso, saṃkhittena vā vitthārena vā pātimokkhaṃ pariyāpuṇitvā āgacchā’’ti. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, tehi, bhikkhave, bhikkhūhi sabbeheva yattha jānanti uposathaṃ vā uposathakammaṃ vā pātimokkhaṃ vā pātimokkhuddesaṃ vā, so āvāso gantabbo . No ce gaccheyyuṃ, āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse sambahulā bhikkhū vassaṃ vasanti bālā abyattā. Te na jānanti uposathaṃ vā uposathakammaṃ vā pātimokkhaṃ vā pātimokkhuddesaṃ vā. Tehi, bhikkhave, bhikkhūhi eko bhikkhu sāmantā āvāsā sajjukaṃ pāhetabbo – ‘‘gacchāvuso, saṃkhittena vā vitthārena vā pātimokkhaṃ pariyāpuṇitvā āgacchā’’ti. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, eko bhikkhu sattāhakālikaṃ pāhetabbo – ‘‘gacchāvuso, saṃkhittena vā vitthārena vā pātimokkhaṃ pariyāpuṇitvā āgacchā’’ti. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, na, bhikkhave, tehi bhikkhūhi tasmiṃ āvāse vassaṃ vasitabbaṃ. Vaseyyuṃ ce, āpatti dukkaṭassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "87. Pārisuddhidānakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "164"
      },
      ". Atha kho bhagavā bhikkhū āmantesi – ‘‘sannipatatha, bhikkhave, saṅgho uposathaṃ karissatī’’ti. Evaṃ vutte aññataro bhikkhu bhagavantaṃ etadavoca ",
      " – ‘‘atthi, bhante, bhikkhu gilāno, so anāgato’’ti. Anujānāmi, bhikkhave, gilānena bhikkhunā pārisuddhiṃ dātuṃ. Evañca pana, bhikkhave, dātabbā – tena gilānena bhikkhunā ekaṃ bhikkhuṃ upasaṅkamitvā ekaṃsaṃ uttarāsaṅgaṃ karitvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā evamassa vacanīyo – ‘‘pārisuddhiṃ dammi, pārisuddhiṃ me hara, pārisuddhiṃ me ārocehī’’ti. Kāyena viññāpeti, vācāya viññāpeti, kāyena vācāya viññāpeti, dinnā hoti pārisuddhi. Na kāyena viññāpeti, na vācāya viññāpeti, na kāyena vācāya viññāpeti, na dinnā hoti pārisuddhi. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, so, bhikkhave, gilāno bhikkhu mañcena vā pīṭhena vā saṅghamajjhe ānetvā uposatho kātabbo. Sace, bhikkhave, gilānupaṭṭhākānaṃ bhikkhūnaṃ evaṃ hoti – ‘‘sace kho mayaṃ gilānaṃ ṭhānā cāvessāma, ābādho vā abhivaḍḍhissati kālaṃkiriyā vā bhavissatī’’ti, na, bhikkhave, gilāno bhikkhu ṭhānā cāvetabbo. Saṅghena tattha gantvā uposatho ",
      " kātabbo. Na tveva vaggena saṅghena uposatho kātabbo. Kareyya ce, āpatti dukkaṭassa."
    ],
    "innerText": "164. Atha kho bhagavā bhikkhū āmantesi – ‘‘sannipatatha, bhikkhave, saṅgho uposathaṃ karissatī’’ti. Evaṃ vutte aññataro bhikkhu bhagavantaṃ etadavoca – ‘‘atthi, bhante, bhikkhu gilāno, so anāgato’’ti. Anujānāmi, bhikkhave, gilānena bhikkhunā pārisuddhiṃ dātuṃ. Evañca pana, bhikkhave, dātabbā – tena gilānena bhikkhunā ekaṃ bhikkhuṃ upasaṅkamitvā ekaṃsaṃ uttarāsaṅgaṃ karitvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā evamassa vacanīyo – ‘‘pārisuddhiṃ dammi, pārisuddhiṃ me hara, pārisuddhiṃ me ārocehī’’ti. Kāyena viññāpeti, vācāya viññāpeti, kāyena vācāya viññāpeti, dinnā hoti pārisuddhi. Na kāyena viññāpeti, na vācāya viññāpeti, na kāyena vācāya viññāpeti, na dinnā hoti pārisuddhi. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, so, bhikkhave, gilāno bhikkhu mañcena vā pīṭhena vā saṅghamajjhe ānetvā uposatho kātabbo. Sace, bhikkhave, gilānupaṭṭhākānaṃ bhikkhūnaṃ evaṃ hoti – ‘‘sace kho mayaṃ gilānaṃ ṭhānā cāvessāma, ābādho vā abhivaḍḍhissati kālaṃkiriyā vā bhavissatī’’ti, na, bhikkhave, gilāno bhikkhu ṭhānā cāvetabbo. Saṅghena tattha gantvā uposatho kātabbo. Na tveva vaggena saṅghena uposatho kātabbo. Kareyya ce, āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pārisuddhihārako ",
      " ce, bhikkhave, dinnāya pārisuddhiyā tattheva pakkamati, aññassa dātabbā pārisuddhi. Pārisuddhihārako ce, bhikkhave, dinnāya pārisuddhiyā tattheva vibbhamati,…pe… kālaṃ karoti – sāmaṇero paṭijānāti ",
      " – sikkhaṃ paccakkhātako paṭijānāti – antimavatthuṃ ajjhāpannako ",
      " paṭijānāti – ummattako paṭijānāti – khittacitto paṭijānāti – vedanāṭṭo paṭijānāti – āpattiyā adassane ukkhittako paṭijānāti – āpattiyā appaṭikamme ukkhittako paṭijānāti – pāpikāya diṭṭhiyā appaṭinissagge ukkhittako paṭijānāti – paṇḍako paṭijānāti – theyyasaṃvāsako paṭijānāti – titthiyapakkantako paṭijānāti – tiracchānagato paṭijānāti – mātughātako paṭijānāti – pitughātako paṭijānāti – arahantaghātako paṭijānāti – bhikkhunidūsako paṭijānāti – saṅghabhedako paṭijānāti – lohituppādako paṭijānāti – ubhatobyañjanako paṭijānāti, aññassa dātabbā pārisuddhi."
    ],
    "innerText": "Pārisuddhihārako ce, bhikkhave, dinnāya pārisuddhiyā tattheva pakkamati, aññassa dātabbā pārisuddhi. Pārisuddhihārako ce, bhikkhave, dinnāya pārisuddhiyā tattheva vibbhamati,…pe… kālaṃ karoti – sāmaṇero paṭijānāti – sikkhaṃ paccakkhātako paṭijānāti – antimavatthuṃ ajjhāpannako paṭijānāti – ummattako paṭijānāti – khittacitto paṭijānāti – vedanāṭṭo paṭijānāti – āpattiyā adassane ukkhittako paṭijānāti – āpattiyā appaṭikamme ukkhittako paṭijānāti – pāpikāya diṭṭhiyā appaṭinissagge ukkhittako paṭijānāti – paṇḍako paṭijānāti – theyyasaṃvāsako paṭijānāti – titthiyapakkantako paṭijānāti – tiracchānagato paṭijānāti – mātughātako paṭijānāti – pitughātako paṭijānāti – arahantaghātako paṭijānāti – bhikkhunidūsako paṭijānāti – saṅghabhedako paṭijānāti – lohituppādako paṭijānāti – ubhatobyañjanako paṭijānāti, aññassa dātabbā pārisuddhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Pārisuddhihārako ce, bhikkhave, dinnāya pārisuddhiyā antarāmagge pakkamati, anāhaṭā hoti pārisuddhi. Pārisuddhihārako ce, bhikkhave, dinnāya pārisuddhiyā antarāmagge vibbhamati,…pe… ubhatobyañjanako paṭijānāti, anāhaṭā hoti pārisuddhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Pārisuddhihārako ce, bhikkhave, dinnāya pārisuddhiyā saṅghappatto pakkamati, āhaṭā hoti pārisuddhi. Pārisuddhihārako ce, bhikkhave, dinnāya pārisuddhiyā saṅghappatto vibbhamati,…pe… ubhatobyañjanako paṭijānāti, āhaṭā hoti pārisuddhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Pārisuddhihārako ce, bhikkhave, dinnāya pārisuddhiyā saṅghappatto sutto na āroceti, pamatto na āroceti, samāpanno na āroceti, āhaṭā hoti pārisuddhi. Pārisuddhihārakassa anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pārisuddhihārako ce, bhikkhave ",
      ", dinnāya pārisuddhiyā saṅghappatto sañcicca na āroceti, āhaṭā hoti pārisuddhi. Pārisuddhihārakassa āpatti dukkaṭassāti."
    ],
    "innerText": "Pārisuddhihārako ce, bhikkhave , dinnāya pārisuddhiyā saṅghappatto sañcicca na āroceti, āhaṭā hoti pārisuddhi. Pārisuddhihārakassa āpatti dukkaṭassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "88. Chandadānakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "165"
      },
      ". Atha ",
      " kho bhagavā bhikkhū āmantesi – ‘‘sannipatatha, bhikkhave, saṅgho kammaṃ karissatī’’ti ",
      ". Evaṃ vutte aññataro bhikkhu bhagavantaṃ etadavoca – ‘‘atthi, bhante, bhikkhu gilāno, so anāgato’’ti. Anujānāmi, bhikkhave, gilānena bhikkhunā chandaṃ dātuṃ. Evañca pana, bhikkhave, dātabbo. Tena gilānena bhikkhunā ekaṃ bhikkhuṃ upasaṅkamitvā ekaṃsaṃ uttarāsaṅgaṃ karitvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā evamassa vacanīyo – ‘‘chandaṃ dammi, chandaṃ me hara, chandaṃ me ārocehī’’ti. Kāyena viññāpeti, vācāya viññāpeti, kāyena vācāya viññāpeti, dinno hoti chando. Na kāyena viññāpeti, na vācāya viññāpeti, na kāyena vācāya viññāpeti, na dinno hoti chando. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, so, bhikkhave ",
      ", gilāno bhikkhu mañcena vā pīṭhena vā saṅghamajjhe ānetvā kammaṃ kātabbaṃ. Sace, bhikkhave, gilānupaṭṭhākānaṃ bhikkhūnaṃ evaṃ hoti – ‘‘sace kho mayaṃ gilānaṃ ṭhānā cāvessāma, ābādho vā abhivaḍḍhissati kālaṃkiriyā vā bhavissatī’’ti, na, bhikkhave, gilāno bhikkhu ṭhānā cāvetabbo. Saṅghena tattha gantvā kammaṃ kātabbaṃ. Na tveva vaggena saṅghena kammaṃ kātabbaṃ. Kareyya ce, āpatti dukkaṭassa."
    ],
    "innerText": "165. Atha kho bhagavā bhikkhū āmantesi – ‘‘sannipatatha, bhikkhave, saṅgho kammaṃ karissatī’’ti . Evaṃ vutte aññataro bhikkhu bhagavantaṃ etadavoca – ‘‘atthi, bhante, bhikkhu gilāno, so anāgato’’ti. Anujānāmi, bhikkhave, gilānena bhikkhunā chandaṃ dātuṃ. Evañca pana, bhikkhave, dātabbo. Tena gilānena bhikkhunā ekaṃ bhikkhuṃ upasaṅkamitvā ekaṃsaṃ uttarāsaṅgaṃ karitvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā evamassa vacanīyo – ‘‘chandaṃ dammi, chandaṃ me hara, chandaṃ me ārocehī’’ti. Kāyena viññāpeti, vācāya viññāpeti, kāyena vācāya viññāpeti, dinno hoti chando. Na kāyena viññāpeti, na vācāya viññāpeti, na kāyena vācāya viññāpeti, na dinno hoti chando. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, so, bhikkhave , gilāno bhikkhu mañcena vā pīṭhena vā saṅghamajjhe ānetvā kammaṃ kātabbaṃ. Sace, bhikkhave, gilānupaṭṭhākānaṃ bhikkhūnaṃ evaṃ hoti – ‘‘sace kho mayaṃ gilānaṃ ṭhānā cāvessāma, ābādho vā abhivaḍḍhissati kālaṃkiriyā vā bhavissatī’’ti, na, bhikkhave, gilāno bhikkhu ṭhānā cāvetabbo. Saṅghena tattha gantvā kammaṃ kātabbaṃ. Na tveva vaggena saṅghena kammaṃ kātabbaṃ. Kareyya ce, āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Chandahārako ",
      " ce, bhikkhave, dinne chande tattheva pakkamati, aññassa dātabbo chando. Chandahārako ce, bhikkhave, dinne chande tattheva vibbhamati…pe… kālaṃkaroti – sāmaṇero paṭijānāti – sikkhaṃ paccakkhātako paṭijānāti – antimavatthuṃ ajjhāpannako paṭijānāti – ummattako paṭijānāti – khittacitto paṭijānāti – vedanāṭṭo paṭijānāti – āpattiyā adassane ukkhittako paṭijānāti – āpattiyā appaṭikamme ukkhittako paṭijānāti – pāpikāya diṭṭhiyā appaṭinissagge ukkhittako paṭijānāti – paṇḍako paṭijānāti – theyyasaṃvāsako paṭijānāti – titthiyapakkantako paṭijānāti – tiracchānagato paṭijānāti – mātughātako paṭijānāti – pitughātako paṭijānāti – arahantaghātako paṭijānāti – bhikkhunidūsako paṭijānāti – saṅghabhedako paṭijānāti – lohituppādako paṭijānāti – ubhatobyañjanako paṭijānāti, aññassa dātabbo chando."
    ],
    "innerText": "Chandahārako ce, bhikkhave, dinne chande tattheva pakkamati, aññassa dātabbo chando. Chandahārako ce, bhikkhave, dinne chande tattheva vibbhamati…pe… kālaṃkaroti – sāmaṇero paṭijānāti – sikkhaṃ paccakkhātako paṭijānāti – antimavatthuṃ ajjhāpannako paṭijānāti – ummattako paṭijānāti – khittacitto paṭijānāti – vedanāṭṭo paṭijānāti – āpattiyā adassane ukkhittako paṭijānāti – āpattiyā appaṭikamme ukkhittako paṭijānāti – pāpikāya diṭṭhiyā appaṭinissagge ukkhittako paṭijānāti – paṇḍako paṭijānāti – theyyasaṃvāsako paṭijānāti – titthiyapakkantako paṭijānāti – tiracchānagato paṭijānāti – mātughātako paṭijānāti – pitughātako paṭijānāti – arahantaghātako paṭijānāti – bhikkhunidūsako paṭijānāti – saṅghabhedako paṭijānāti – lohituppādako paṭijānāti – ubhatobyañjanako paṭijānāti, aññassa dātabbo chando."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Chandahārako ",
      " ce, bhikkhave, dinne chande antarāmagge pakkamati, anāhaṭo hoti chando. Chandahārako ce, bhikkhave, dinne chande antarāmagge vibbhamati…pe… ubhatobyañjanako paṭijānāti, anāhaṭo hoti chando."
    ],
    "innerText": "Chandahārako ce, bhikkhave, dinne chande antarāmagge pakkamati, anāhaṭo hoti chando. Chandahārako ce, bhikkhave, dinne chande antarāmagge vibbhamati…pe… ubhatobyañjanako paṭijānāti, anāhaṭo hoti chando."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Chandahārako ce, bhikkhave, dinne chande saṅghappatto pakkamati, āhaṭo hoti chando. Chandahārako ",
      " ce, bhikkhave, dinne chande saṅghappatto vibbhamati…pe… ubhatobyañjanako paṭijānāti, āhaṭo hoti chando."
    ],
    "innerText": "Chandahārako ce, bhikkhave, dinne chande saṅghappatto pakkamati, āhaṭo hoti chando. Chandahārako ce, bhikkhave, dinne chande saṅghappatto vibbhamati…pe… ubhatobyañjanako paṭijānāti, āhaṭo hoti chando."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Chandahārako ce, bhikkhave, dinne ",
      " chande saṅghappatto sutto na āroceti, pamatto na āroceti, samāpanno na āroceti, āhaṭo hoti chando. Chandahārakassa anāpatti."
    ],
    "innerText": "Chandahārako ce, bhikkhave, dinne chande saṅghappatto sutto na āroceti, pamatto na āroceti, samāpanno na āroceti, āhaṭo hoti chando. Chandahārakassa anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Chandahārako ce, bhikkhave, dinne chande saṅghappatto sañcicca na āroceti, āhaṭo hoti chando. Chandahārakassa āpatti dukkaṭassa. Anujānāmi, bhikkhave, tadahuposathe pārisuddhiṃ dentena chandampi dātuṃ, santi saṅghassa karaṇīyanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "89. Ñātakādiggahaṇakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "166"
      },
      ". Tena kho pana samayena aññataraṃ bhikkhuṃ tadahuposathe ñātakā gaṇhiṃsuṃ. Bhagavato etamatthaṃ ārocesuṃ."
    ],
    "innerText": "166. Tena kho pana samayena aññataraṃ bhikkhuṃ tadahuposathe ñātakā gaṇhiṃsuṃ. Bhagavato etamatthaṃ ārocesuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, bhikkhuṃ tadahuposathe ñātakā gaṇhanti. Te ñātakā bhikkhūhi evamassu vacanīyā – ‘‘iṅgha, tumhe āyasmanto imaṃ bhikkhuṃ muhuttaṃ muñcatha, yāvāyaṃ bhikkhu uposathaṃ karotī’’ti. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, te ñātakā bhikkhūhi evamassu vacanīyā – ‘‘iṅgha, tumhe āyasmanto muhuttaṃ ekamantaṃ hotha, yāvāyaṃ bhikkhu pārisuddhiṃ detī’’ti. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, te ñātakā bhikkhūhi evamassu vacanīyā – ‘‘iṅgha, tumhe āyasmanto imaṃ bhikkhuṃ muhuttaṃ nissīmaṃ netha, yāva saṅgho uposathaṃ karotī’’ti. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, na tveva vaggena saṅghena uposatho kātabbo. Kareyya ce, āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      " pana, bhikkhave, bhikkhuṃ tadahuposathe rājāno gaṇhanti,…pe… corā gaṇhanti – dhuttā ",
      " gaṇhanti – bhikkhupaccatthikā gaṇhanti, te bhikkhupaccatthikā bhikkhūhi evamassu vacanīyā – ‘‘iṅgha, tumhe āyasmanto imaṃ bhikkhuṃ muhuttaṃ muñcatha, yāvāyaṃ bhikkhu uposathaṃ karotī’’ti. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, te bhikkhupaccatthikā bhikkhūhi evamassu vacanīyā – ‘‘iṅgha, tumhe āyasmanto muhuttaṃ ekamantaṃ hotha, yāvāyaṃ bhikkhu pārisuddhiṃ detī’’ti. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, te bhikkhupaccatthikā ",
      " bhikkhūhi evamassu vacanīyā – ‘‘iṅgha, tumhe āyasmanto imaṃ bhikkhuṃ muhuttaṃ nissīmaṃ netha, yāva saṅgho uposathaṃ karotī’’ti. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, na tveva vaggena saṅghena uposatho kātabbo. Kareyya ce, āpatti dukkaṭassāti."
    ],
    "innerText": "Idha pana, bhikkhave, bhikkhuṃ tadahuposathe rājāno gaṇhanti,…pe… corā gaṇhanti – dhuttā gaṇhanti – bhikkhupaccatthikā gaṇhanti, te bhikkhupaccatthikā bhikkhūhi evamassu vacanīyā – ‘‘iṅgha, tumhe āyasmanto imaṃ bhikkhuṃ muhuttaṃ muñcatha, yāvāyaṃ bhikkhu uposathaṃ karotī’’ti. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, te bhikkhupaccatthikā bhikkhūhi evamassu vacanīyā – ‘‘iṅgha, tumhe āyasmanto muhuttaṃ ekamantaṃ hotha, yāvāyaṃ bhikkhu pārisuddhiṃ detī’’ti. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, te bhikkhupaccatthikā bhikkhūhi evamassu vacanīyā – ‘‘iṅgha, tumhe āyasmanto imaṃ bhikkhuṃ muhuttaṃ nissīmaṃ netha, yāva saṅgho uposathaṃ karotī’’ti. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, na tveva vaggena saṅghena uposatho kātabbo. Kareyya ce, āpatti dukkaṭassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "90. Ummattakasammuti"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "167"
      },
      ". Atha ",
      " kho bhagavā bhikkhū āmantesi – ‘‘sannipatatha, bhikkhave, atthi saṅghassa karaṇīya’’nti. Evaṃ vutte aññataro bhikkhu bhagavantaṃ etadavoca – ‘‘atthi, bhante, gaggo nāma bhikkhu ummattako, so anāgato’’ti."
    ],
    "innerText": "167. Atha kho bhagavā bhikkhū āmantesi – ‘‘sannipatatha, bhikkhave, atthi saṅghassa karaṇīya’’nti. Evaṃ vutte aññataro bhikkhu bhagavantaṃ etadavoca – ‘‘atthi, bhante, gaggo nāma bhikkhu ummattako, so anāgato’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Dveme, bhikkhave, ummattakā – atthi, bhikkhave, bhikkhu ummattako saratipi uposathaṃ napi sarati, saratipi saṅghakammaṃ napi sarati, atthi neva sarati; āgacchatipi uposathaṃ napi āgacchati, āgacchatipi saṅghakammaṃ napi āgacchati, atthi neva āgacchati. Tatra, bhikkhave, yvāyaṃ ummattako saratipi uposathaṃ napi sarati, saratipi saṅghakammaṃ napi sarati, āgacchatipi uposathaṃ napi āgacchati, āgacchatipi saṅghakammaṃ ",
      " napi āgacchati, anujānāmi, bhikkhave, evarūpassa ummattakassa ummattakasammuttiṃ dātuṃ. Evañca pana, bhikkhave, dātabbā. Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
    ],
    "innerText": "‘‘Dveme, bhikkhave, ummattakā – atthi, bhikkhave, bhikkhu ummattako saratipi uposathaṃ napi sarati, saratipi saṅghakammaṃ napi sarati, atthi neva sarati; āgacchatipi uposathaṃ napi āgacchati, āgacchatipi saṅghakammaṃ napi āgacchati, atthi neva āgacchati. Tatra, bhikkhave, yvāyaṃ ummattako saratipi uposathaṃ napi sarati, saratipi saṅghakammaṃ napi sarati, āgacchatipi uposathaṃ napi āgacchati, āgacchatipi saṅghakammaṃ napi āgacchati, anujānāmi, bhikkhave, evarūpassa ummattakassa ummattakasammuttiṃ dātuṃ. Evañca pana, bhikkhave, dātabbā. Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu me, bhante, saṅgho. Gaggo bhikkhu ummattako – saratipi uposathaṃ napi sarati, saratipi saṅghakammaṃ napi sarati, āgacchatipi uposathaṃ napi āgacchati, āgacchatipi saṅghakammaṃ napi āgacchati. Yadi saṅghassa pattakallaṃ, saṅgho gaggassa bhikkhuno ummattakassa ummattakasammutiṃ ",
      " dadeyya. Sareyya vā gaggo bhikkhu uposathaṃ na vā sareyya, sareyya vā saṅghakammaṃ na vā sareyya, āgaccheyya vā uposathaṃ na vā āgaccheyya, āgaccheyya vā saṅghakammaṃ na vā āgaccheyya, saṅgho saha vā gaggena vinā vā gaggena uposathaṃ kareyya, saṅghakammaṃ kareyya. Esā ñatti."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Gaggo bhikkhu ummattako – saratipi uposathaṃ napi sarati, saratipi saṅghakammaṃ napi sarati, āgacchatipi uposathaṃ napi āgacchati, āgacchatipi saṅghakammaṃ napi āgacchati. Yadi saṅghassa pattakallaṃ, saṅgho gaggassa bhikkhuno ummattakassa ummattakasammutiṃ dadeyya. Sareyya vā gaggo bhikkhu uposathaṃ na vā sareyya, sareyya vā saṅghakammaṃ na vā sareyya, āgaccheyya vā uposathaṃ na vā āgaccheyya, āgaccheyya vā saṅghakammaṃ na vā āgaccheyya, saṅgho saha vā gaggena vinā vā gaggena uposathaṃ kareyya, saṅghakammaṃ kareyya. Esā ñatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suṇātu me, bhante, saṅgho. Gaggo bhikkhu ummattako – saratipi uposathaṃ napi sarati, saratipi saṅghakammaṃ napi sarati, āgacchatipi uposathaṃ napi āgacchati, āgacchatipi saṅghakammaṃ napi āgacchati. Saṅgho gaggassa bhikkhuno ummattakassa ummattakasammutiṃ ",
      " deti. Sareyya vā gaggo bhikkhu uposathaṃ na vā sareyya, sareyya vā saṅghakammaṃ na vā sareyyaṃ, āgaccheyya vā uposathaṃ na vā āgaccheyya, āgaccheyya vā saṅghakammaṃ na vā āgaccheyya, saṅgho saha vā gaggena, vinā vā gaggena uposathaṃ karissati, saṅghakammaṃ karissati. Yassāyasmato khamati gaggassa bhikkhuno ",
      " ummattakassa ummattakasammutiyā dānaṃ – sareyya vā gaggo bhikkhu uposathaṃ na vā sareyya, sareyya vā saṅghakammaṃ na vā sareyya, āgaccheyya vā uposathaṃ na vā āgaccheyya, āgaccheyya vā saṅghakammaṃ na vā āgaccheyya, saṅgho saha vā gaggena, vinā vā gaggena uposathaṃ karissati, saṅghakammaṃ karissati, so tuṇhassa; yassa nakkhamati, so bhāseyya."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Gaggo bhikkhu ummattako – saratipi uposathaṃ napi sarati, saratipi saṅghakammaṃ napi sarati, āgacchatipi uposathaṃ napi āgacchati, āgacchatipi saṅghakammaṃ napi āgacchati. Saṅgho gaggassa bhikkhuno ummattakassa ummattakasammutiṃ deti. Sareyya vā gaggo bhikkhu uposathaṃ na vā sareyya, sareyya vā saṅghakammaṃ na vā sareyyaṃ, āgaccheyya vā uposathaṃ na vā āgaccheyya, āgaccheyya vā saṅghakammaṃ na vā āgaccheyya, saṅgho saha vā gaggena, vinā vā gaggena uposathaṃ karissati, saṅghakammaṃ karissati. Yassāyasmato khamati gaggassa bhikkhuno ummattakassa ummattakasammutiyā dānaṃ – sareyya vā gaggo bhikkhu uposathaṃ na vā sareyya, sareyya vā saṅghakammaṃ na vā sareyya, āgaccheyya vā uposathaṃ na vā āgaccheyya, āgaccheyya vā saṅghakammaṃ na vā āgaccheyya, saṅgho saha vā gaggena, vinā vā gaggena uposathaṃ karissati, saṅghakammaṃ karissati, so tuṇhassa; yassa nakkhamati, so bhāseyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Dinnā saṅghena gaggassa bhikkhuno ummattakassa ummattakasammuti. Sareyya vā gaggo bhikkhu uposathaṃ na vā sareyya, sareyya vā saṅghakammaṃ na vā sareyya, āgaccheyya vā uposathaṃ na vā āgaccheyya, āgaccheyya vā saṅghakammaṃ na vā āgaccheyya, saṅgho saha vā gaggena vinā vā gaggena uposathaṃ karissati, saṅghakammaṃ karissati. Khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "91. Saṅghuposathādippabhedaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "168"
      },
      ". Tena ",
      " kho pana samayena aññatarasmiṃ āvāse tadahuposathe cattāro bhikkhū viharanti. Atha kho tesaṃ bhikkhūnaṃ etadahosi – ‘‘bhagavatā paññattaṃ ‘uposatho kātabbo’ti, mayañcamhā cattāro janā, kathaṃ nu kho amhehi uposatho kātabbo’’ti? Bhagavato etamatthaṃ ",
      " ārocesuṃ. Anujānāmi, bhikkhave, catunnaṃ pātimokkhaṃ uddisitunti."
    ],
    "innerText": "168. Tena kho pana samayena aññatarasmiṃ āvāse tadahuposathe cattāro bhikkhū viharanti. Atha kho tesaṃ bhikkhūnaṃ etadahosi – ‘‘bhagavatā paññattaṃ ‘uposatho kātabbo’ti, mayañcamhā cattāro janā, kathaṃ nu kho amhehi uposatho kātabbo’’ti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, catunnaṃ pātimokkhaṃ uddisitunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena kho pana samayena aññatarasmiṃ āvāse tadahuposathe tayo bhikkhū viharanti. Atha kho tesaṃ bhikkhūnaṃ etadahosi – ‘‘bhagavatā anuññātaṃ catunnaṃ pātimokkhaṃ uddisituṃ, mayañcamhā tayo ",
      " janā, kathaṃ nu kho amhehi uposatho kātabbo’’ti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, tiṇṇaṃ pārisuddhiuposathaṃ kātuṃ. Evañca pana, bhikkhave, kātabbo. Byattena bhikkhunā paṭibalena te bhikkhū ñāpetabbā –"
    ],
    "innerText": "Tena kho pana samayena aññatarasmiṃ āvāse tadahuposathe tayo bhikkhū viharanti. Atha kho tesaṃ bhikkhūnaṃ etadahosi – ‘‘bhagavatā anuññātaṃ catunnaṃ pātimokkhaṃ uddisituṃ, mayañcamhā tayo janā, kathaṃ nu kho amhehi uposatho kātabbo’’ti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, tiṇṇaṃ pārisuddhiuposathaṃ kātuṃ. Evañca pana, bhikkhave, kātabbo. Byattena bhikkhunā paṭibalena te bhikkhū ñāpetabbā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Suṇantu me āyasmantā. Ajjuposatho pannaraso. Yadāyasmantānaṃ pattakallaṃ, mayaṃ aññamaññaṃ pārisuddhiuposathaṃ kareyyāmā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Therena ",
      " bhikkhunā ekaṃsaṃ uttarāsaṅgaṃ karitvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā te bhikkhū evamassu vacanīyā – ‘‘parisuddho ahaṃ, āvuso; parisuddhoti maṃ dhāretha. Parisuddho ahaṃ, āvuso; parisuddhoti maṃ dhāretha. Parisuddho ahaṃ, āvuso; parisuddhoti maṃ dhārethā’’ti."
    ],
    "innerText": "Therena bhikkhunā ekaṃsaṃ uttarāsaṅgaṃ karitvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā te bhikkhū evamassu vacanīyā – ‘‘parisuddho ahaṃ, āvuso; parisuddhoti maṃ dhāretha. Parisuddho ahaṃ, āvuso; parisuddhoti maṃ dhāretha. Parisuddho ahaṃ, āvuso; parisuddhoti maṃ dhārethā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Navakena bhikkhunā ekaṃsaṃ uttarāsaṅgaṃ karitvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā te bhikkhū evamassu vacanīyā – ‘‘parisuddho ahaṃ, bhante; parisuddhoti maṃ dhāretha. Parisuddho ahaṃ, bhante; parisuddhoti maṃ dhāretha. Parisuddho ahaṃ, bhante; parisuddhoti maṃ dhārethā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena kho pana samayena aññatarasmiṃ āvāse tadahuposathe dve bhikkhū viharanti. Atha kho tesaṃ bhikkhūnaṃ etadahosi – ‘‘bhagavatā anuññātaṃ catunnaṃ pātimokkhaṃ uddisituṃ, tiṇṇannaṃ pārisuddhiuposathaṃ kātuṃ. Mayañcamhā dve janā. Kathaṃ nu kho amhehi uposatho kātabbo’’ti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, dvinnaṃ pārisuddhiuposathaṃ kātuṃ ",
      ". Evañca pana, bhikkhave, kātabbo. Therena bhikkhunā ekaṃsaṃ uttarāsaṅgaṃ karitvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā navo bhikkhu evamassa vacanīyo – ‘‘parisuddho ahaṃ, āvuso; parisuddhoti maṃ dhārehi. Parisuddho ahaṃ, āvuso; parisuddhoti ",
      " maṃ dhārehi. Parisuddho ahaṃ, āvuso; parisuddhoti maṃ dhārehī’’ti."
    ],
    "innerText": "Tena kho pana samayena aññatarasmiṃ āvāse tadahuposathe dve bhikkhū viharanti. Atha kho tesaṃ bhikkhūnaṃ etadahosi – ‘‘bhagavatā anuññātaṃ catunnaṃ pātimokkhaṃ uddisituṃ, tiṇṇannaṃ pārisuddhiuposathaṃ kātuṃ. Mayañcamhā dve janā. Kathaṃ nu kho amhehi uposatho kātabbo’’ti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, dvinnaṃ pārisuddhiuposathaṃ kātuṃ . Evañca pana, bhikkhave, kātabbo. Therena bhikkhunā ekaṃsaṃ uttarāsaṅgaṃ karitvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā navo bhikkhu evamassa vacanīyo – ‘‘parisuddho ahaṃ, āvuso; parisuddhoti maṃ dhārehi. Parisuddho ahaṃ, āvuso; parisuddhoti maṃ dhārehi. Parisuddho ahaṃ, āvuso; parisuddhoti maṃ dhārehī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Navakena ",
      " bhikkhunā ekaṃsaṃ uttarāsaṅgaṃ karitvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā thero bhikkhu evamassa vacanīyo – ‘‘parisuddho ahaṃ, bhante; parisuddhoti maṃ dhāretha. Parisuddho ahaṃ, bhante; parisuddhoti maṃ dhāretha. Parisuddho ahaṃ, bhante; parisuddhoti maṃ dhārethā’’ti."
    ],
    "innerText": "Navakena bhikkhunā ekaṃsaṃ uttarāsaṅgaṃ karitvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā thero bhikkhu evamassa vacanīyo – ‘‘parisuddho ahaṃ, bhante; parisuddhoti maṃ dhāretha. Parisuddho ahaṃ, bhante; parisuddhoti maṃ dhāretha. Parisuddho ahaṃ, bhante; parisuddhoti maṃ dhārethā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena kho pana samayena aññatarasmiṃ āvāse tadahuposathe eko bhikkhu viharati. Atha kho tassa bhikkhuno etadahosi – ‘‘bhagavatā anuññātaṃ catunnaṃ pātimokkhaṃ uddisituṃ, tiṇṇannaṃ pārisuddhiuposathaṃ kātuṃ, dvinnaṃ pārisuddhiuposathaṃ kātuṃ. Ahañcamhi ekako. Kathaṃ nu kho mayā uposatho kātabbo’’ti? Bhagavato etamatthaṃ ārocesuṃ. Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe eko bhikkhu viharati. Tena, bhikkhave, bhikkhunā yattha bhikkhū paṭikkamanti upaṭṭhānasālāya vā, maṇḍape vā, rukkhamūle vā, so deso sammajjitvā ",
      " pānīyaṃ paribhojanīyaṃ upaṭṭhāpetvā āsanaṃ ",
      " paññapetvā padīpaṃ katvā nisīditabbaṃ. Sace aññe bhikkhū āgacchanti, tehi saddhiṃ uposatho kātabbo. No ce āgacchanti, ajja me uposathoti adhiṭṭhātabbo. No ce adhiṭṭhaheyya, āpatti dukkaṭassa."
    ],
    "innerText": "Tena kho pana samayena aññatarasmiṃ āvāse tadahuposathe eko bhikkhu viharati. Atha kho tassa bhikkhuno etadahosi – ‘‘bhagavatā anuññātaṃ catunnaṃ pātimokkhaṃ uddisituṃ, tiṇṇannaṃ pārisuddhiuposathaṃ kātuṃ, dvinnaṃ pārisuddhiuposathaṃ kātuṃ. Ahañcamhi ekako. Kathaṃ nu kho mayā uposatho kātabbo’’ti? Bhagavato etamatthaṃ ārocesuṃ. Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe eko bhikkhu viharati. Tena, bhikkhave, bhikkhunā yattha bhikkhū paṭikkamanti upaṭṭhānasālāya vā, maṇḍape vā, rukkhamūle vā, so deso sammajjitvā pānīyaṃ paribhojanīyaṃ upaṭṭhāpetvā āsanaṃ paññapetvā padīpaṃ katvā nisīditabbaṃ. Sace aññe bhikkhū āgacchanti, tehi saddhiṃ uposatho kātabbo. No ce āgacchanti, ajja me uposathoti adhiṭṭhātabbo. No ce adhiṭṭhaheyya, āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tatra, bhikkhave, yattha cattāro bhikkhū viharanti, na ekassa pārisuddhiṃ āharitvā tīhi pātimokkhaṃ uddisitabbaṃ. Uddiseyyuṃ ce, āpatti dukkaṭassa. Tatra, bhikkhave, yattha tayo bhikkhū viharanti, na ekassa pārisuddhiṃ āharitvā dvīhi pārisuddhiuposatho kātabbo. Kareyyuṃ ce, āpatti dukkaṭassa. Tatra, bhikkhave, yattha dve bhikkhū viharanti, na ekassa pārisuddhiṃ āharitvā ekena adhiṭṭhātabbo. Adhiṭṭhaheyya ce, āpatti dukkaṭassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "92. Āpattipaṭikammavidhi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "169"
      },
      ". Tena kho pana samayena aññataro bhikkhu tadahuposathe āpattiṃ āpanno hoti. Atha kho tassa bhikkhuno etadahosi – ‘‘bhagavatā paññattaṃ ‘na sāpattikena uposatho kātabbo’ti. Ahañcamhi āpattiṃ āpanno. Kathaṃ nu kho mayā paṭipajjitabba’’nti? Bhagavato etamatthaṃ ārocesuṃ. Idha pana, bhikkhave, bhikkhu tadahuposathe āpattiṃ āpanno hoti. Tena, bhikkhave, bhikkhunā ekaṃ bhikkhuṃ upasaṅkamitvā ekaṃsaṃ uttarāsaṅgaṃ karitvā ukkuṭikaṃ nisīditvā ",
      " añjaliṃ paggahetvā ",
      " evamassa vacanīyo – ‘‘ahaṃ, āvuso, itthannāmaṃ āpattiṃ āpanno, taṃ paṭidesemī’’ti. Tena vattabbo – ‘‘passasī’’ti. ‘‘Āma ",
      " passāmī’’ti. ‘‘Āyatiṃ saṃvareyyāsī’’ti."
    ],
    "innerText": "169. Tena kho pana samayena aññataro bhikkhu tadahuposathe āpattiṃ āpanno hoti. Atha kho tassa bhikkhuno etadahosi – ‘‘bhagavatā paññattaṃ ‘na sāpattikena uposatho kātabbo’ti. Ahañcamhi āpattiṃ āpanno. Kathaṃ nu kho mayā paṭipajjitabba’’nti? Bhagavato etamatthaṃ ārocesuṃ. Idha pana, bhikkhave, bhikkhu tadahuposathe āpattiṃ āpanno hoti. Tena, bhikkhave, bhikkhunā ekaṃ bhikkhuṃ upasaṅkamitvā ekaṃsaṃ uttarāsaṅgaṃ karitvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā evamassa vacanīyo – ‘‘ahaṃ, āvuso, itthannāmaṃ āpattiṃ āpanno, taṃ paṭidesemī’’ti. Tena vattabbo – ‘‘passasī’’ti. ‘‘Āma passāmī’’ti. ‘‘Āyatiṃ saṃvareyyāsī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, bhikkhu tadahuposathe āpattiyā vematiko hoti. Tena, bhikkhave, bhikkhunā ekaṃ bhikkhuṃ upasaṅkamitvā ekaṃsaṃ uttarāsaṅgaṃ karitvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā evamassa vacanīyo – ‘‘ahaṃ, āvuso, itthannāmāya āpattiyā vematiko; yadā nibbematiko bhavissāmi, tadā taṃ āpattiṃ paṭikarissāmī’’ti vatvā uposatho kātabbo, pātimokkhaṃ sotabbaṃ, na tveva tappaccayā uposathassa antarāyo kātabboti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena kho pana samayena chabbaggiyā bhikkhū sabhāgaṃ āpattiṃ desenti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, sabhāgā āpatti desetabbā. Yo deseyya, āpatti dukkaṭassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena ",
      " kho pana samayena chabbaggiyā bhikkhū sabhāgaṃ āpattiṃ paṭiggaṇhanti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, sabhāgā āpatti paṭiggahetabbā. Yo paṭiggaṇheyya, āpatti dukkaṭassāti."
    ],
    "innerText": "Tena kho pana samayena chabbaggiyā bhikkhū sabhāgaṃ āpattiṃ paṭiggaṇhanti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, sabhāgā āpatti paṭiggahetabbā. Yo paṭiggaṇheyya, āpatti dukkaṭassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "93. Āpattiāvikaraṇavidhi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "170"
      },
      ". Tena kho pana samayena aññataro bhikkhu pātimokkhe uddissamāne āpattiṃ sarati. Atha kho tassa bhikkhuno etadahosi – ‘‘bhagavatā paññattaṃ ‘na sāpattikena uposatho kātabbo’ti. Ahañcamhi āpattiṃ āpanno. Kathaṃ nu kho mayā paṭipajjitabba’’nti? Bhagavato etamatthaṃ ārocesuṃ."
    ],
    "innerText": "170. Tena kho pana samayena aññataro bhikkhu pātimokkhe uddissamāne āpattiṃ sarati. Atha kho tassa bhikkhuno etadahosi – ‘‘bhagavatā paññattaṃ ‘na sāpattikena uposatho kātabbo’ti. Ahañcamhi āpattiṃ āpanno. Kathaṃ nu kho mayā paṭipajjitabba’’nti? Bhagavato etamatthaṃ ārocesuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, bhikkhu pātimokkhe uddissamāne ",
      " āpattiṃ sarati. Tena, bhikkhave, bhikkhunā sāmanto bhikkhu evamassa vacanīyo – ‘‘ahaṃ, āvuso, itthannāmaṃ āpattiṃ āpanno. Ito vuṭṭhahitvā taṃ āpattiṃ paṭikarissāmī’’ti vatvā uposatho kātabbo, pātimokkhaṃ sotabbaṃ, na tveva tappaccayā uposathassa antarāyo kātabbo."
    ],
    "innerText": "Idha pana, bhikkhave, bhikkhu pātimokkhe uddissamāne āpattiṃ sarati. Tena, bhikkhave, bhikkhunā sāmanto bhikkhu evamassa vacanīyo – ‘‘ahaṃ, āvuso, itthannāmaṃ āpattiṃ āpanno. Ito vuṭṭhahitvā taṃ āpattiṃ paṭikarissāmī’’ti vatvā uposatho kātabbo, pātimokkhaṃ sotabbaṃ, na tveva tappaccayā uposathassa antarāyo kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, bhikkhu pātimokkhe uddissamāne āpattiyā vematiko hoti. Tena, bhikkhave, bhikkhunā sāmanto bhikkhu evamassa vacanīyo ",
      " – ‘‘ahaṃ, āvuso, itthannāmāya āpattiyā vematiko. Yadā nibbematiko bhavissāmi, tadā taṃ āpattiṃ paṭikarissāmī’’ti vatvā uposatho kātabbo, pātimokkhaṃ sotabbaṃ; na tveva tappaccayā uposathassa antarāyo kātabboti."
    ],
    "innerText": "Idha pana, bhikkhave, bhikkhu pātimokkhe uddissamāne āpattiyā vematiko hoti. Tena, bhikkhave, bhikkhunā sāmanto bhikkhu evamassa vacanīyo – ‘‘ahaṃ, āvuso, itthannāmāya āpattiyā vematiko. Yadā nibbematiko bhavissāmi, tadā taṃ āpattiṃ paṭikarissāmī’’ti vatvā uposatho kātabbo, pātimokkhaṃ sotabbaṃ; na tveva tappaccayā uposathassa antarāyo kātabboti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "94. Sabhāgāpattipaṭikammavidhi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "171"
      },
      ". Tena kho pana samayena aññatarasmiṃ āvāse tadahuposathe sabbo saṅgho sabhāgaṃ āpattiṃ āpanno hoti. Atha kho tesaṃ bhikkhūnaṃ etadahosi – ‘‘bhagavatā paññattaṃ ‘na sabhāgā āpatti desetabbā, na sabhāgā āpatti paṭiggahetabbā’ti ",
      ". Ayañca sabbo saṅgho sabhāgaṃ āpattiṃ āpanno. Kathaṃ nu kho amhehi paṭipajjitabba’’nti? Bhagavato etamatthaṃ ārocesuṃ."
    ],
    "innerText": "171. Tena kho pana samayena aññatarasmiṃ āvāse tadahuposathe sabbo saṅgho sabhāgaṃ āpattiṃ āpanno hoti. Atha kho tesaṃ bhikkhūnaṃ etadahosi – ‘‘bhagavatā paññattaṃ ‘na sabhāgā āpatti desetabbā, na sabhāgā āpatti paṭiggahetabbā’ti . Ayañca sabbo saṅgho sabhāgaṃ āpattiṃ āpanno. Kathaṃ nu kho amhehi paṭipajjitabba’’nti? Bhagavato etamatthaṃ ārocesuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      " pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sabbo saṅgho sabhāgaṃ āpattiṃ āpanno hoti. Tehi, bhikkhave, bhikkhūhi eko bhikkhu sāmantā āvāsā sajjukaṃ pāhetabbo – gacchāvuso, taṃ āpattiṃ paṭikaritvā ",
      " āgaccha; mayaṃ te santike āpattiṃ paṭikarissāmāti. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sabbo saṅgho sabhāgaṃ āpattiṃ āpanno hoti. Tehi, bhikkhave, bhikkhūhi eko bhikkhu sāmantā āvāsā sajjukaṃ pāhetabbo – gacchāvuso, taṃ āpattiṃ paṭikaritvā āgaccha; mayaṃ te santike āpattiṃ paṭikarissāmāti. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Ayaṃ sabbo saṅgho sabhāgaṃ āpattiṃ āpanno. Yadā aññaṃ bhikkhuṃ suddhaṃ anāpattikaṃ passissati, tadā tassa santike taṃ āpattiṃ paṭikarissatī’’ti vatvā uposatho kātabbo, pātimokkhaṃ uddisitabbaṃ, na tveva tappaccayā uposathassa antarāyo kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sabbo saṅgho sabhāgāya āpattiyā vematiko hoti. Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Suṇātu me, bhante, saṅgho. Ayaṃ sabbo saṅgho sabhāgāya āpattiyā vematiko. Yadā nibbematiko bhavissati, tadā taṃ āpattiṃ paṭikarissatī’’ti vatvā uposatho kātabbo, pātimokkhaṃ uddisitabbaṃ; na tveva tappaccayā uposathassa antarāyo kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      " pana, bhikkhave, aññatarasmiṃ āvāse vassūpagato saṅgho sabhāgaṃ āpattiṃ āpanno hoti. Tehi, bhikkhave, bhikkhūhi eko bhikkhu sāmantā āvāsā sajjukaṃ pāhetabbo – gacchāvuso, taṃ āpattiṃ paṭikaritvā āgaccha; mayaṃ te santike taṃ āpattiṃ paṭikarissāmāti. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, eko bhikkhu sattāhakālikaṃ pāhetabbo – gacchāvuso, taṃ āpattiṃ paṭikaritvā āgaccha; mayaṃ te santike taṃ ",
      " āpattiṃ paṭikarissāmāti."
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse vassūpagato saṅgho sabhāgaṃ āpattiṃ āpanno hoti. Tehi, bhikkhave, bhikkhūhi eko bhikkhu sāmantā āvāsā sajjukaṃ pāhetabbo – gacchāvuso, taṃ āpattiṃ paṭikaritvā āgaccha; mayaṃ te santike taṃ āpattiṃ paṭikarissāmāti. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, eko bhikkhu sattāhakālikaṃ pāhetabbo – gacchāvuso, taṃ āpattiṃ paṭikaritvā āgaccha; mayaṃ te santike taṃ āpattiṃ paṭikarissāmāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena kho pana samayena aññatarasmiṃ āvāse sabbo saṅgho sabhāgaṃ āpattiṃ āpanno hoti. So na jānāti tassā āpattiyā nāmagottaṃ. Tattha añño bhikkhu āgacchati bahussuto āgatāgamo dhammadharo vinayadharo mātikādharo paṇḍito byatto medhāvī lajjī kukkuccako sikkhākāmo. Tamenaṃ aññataro bhikkhu yena so bhikkhu tenupasaṅkami, upasaṅkamitvā taṃ bhikkhuṃ etadavoca – ‘‘yo nu kho, āvuso, evañcevañca karoti, kiṃ nāma ",
      " so āpattiṃ āpajjatī’’ti? So evamāha – ‘‘yo kho, āvuso, evañcevañca karoti, imaṃ nāma so āpattiṃ āpajjati. Imaṃ nāma tvaṃ, āvuso, āpattiṃ āpanno; paṭikarohi taṃ āpatti’’nti. So evamāha – ‘‘na kho ahaṃ, āvuso, ekova imaṃ āpattiṃ āpanno; ayaṃ sabbo ",
      " saṅgho imaṃ āpattiṃ āpanno’’ti. So evamāha – ‘‘kiṃ te, āvuso, karissati paro āpanno vā anāpanno vā. Iṅgha, tvaṃ, āvuso, sakāya āpattiyā vuṭṭhāhī’’ti. Atha kho so bhikkhu tassa bhikkhuno vacanena taṃ āpattiṃ paṭikaritvā yena te bhikkhū tenupasaṅkami, upasaṅkamitvā te bhikkhū etadavoca – ‘‘yo kira, āvuso, evañcevañca karoti, imaṃ nāma so āpattiṃ āpajjati. Imaṃ nāma tumhe, āvuso, āpattiṃ āpannā; paṭikarotha taṃ āpatti’’nti. Atha kho te bhikkhū na icchiṃsu tassa bhikkhuno vacanena ",
      " taṃ āpattiṃ paṭikātuṃ. Bhagavato etamatthaṃ ārocesuṃ."
    ],
    "innerText": "Tena kho pana samayena aññatarasmiṃ āvāse sabbo saṅgho sabhāgaṃ āpattiṃ āpanno hoti. So na jānāti tassā āpattiyā nāmagottaṃ. Tattha añño bhikkhu āgacchati bahussuto āgatāgamo dhammadharo vinayadharo mātikādharo paṇḍito byatto medhāvī lajjī kukkuccako sikkhākāmo. Tamenaṃ aññataro bhikkhu yena so bhikkhu tenupasaṅkami, upasaṅkamitvā taṃ bhikkhuṃ etadavoca – ‘‘yo nu kho, āvuso, evañcevañca karoti, kiṃ nāma so āpattiṃ āpajjatī’’ti? So evamāha – ‘‘yo kho, āvuso, evañcevañca karoti, imaṃ nāma so āpattiṃ āpajjati. Imaṃ nāma tvaṃ, āvuso, āpattiṃ āpanno; paṭikarohi taṃ āpatti’’nti. So evamāha – ‘‘na kho ahaṃ, āvuso, ekova imaṃ āpattiṃ āpanno; ayaṃ sabbo saṅgho imaṃ āpattiṃ āpanno’’ti. So evamāha – ‘‘kiṃ te, āvuso, karissati paro āpanno vā anāpanno vā. Iṅgha, tvaṃ, āvuso, sakāya āpattiyā vuṭṭhāhī’’ti. Atha kho so bhikkhu tassa bhikkhuno vacanena taṃ āpattiṃ paṭikaritvā yena te bhikkhū tenupasaṅkami, upasaṅkamitvā te bhikkhū etadavoca – ‘‘yo kira, āvuso, evañcevañca karoti, imaṃ nāma so āpattiṃ āpajjati. Imaṃ nāma tumhe, āvuso, āpattiṃ āpannā; paṭikarotha taṃ āpatti’’nti. Atha kho te bhikkhū na icchiṃsu tassa bhikkhuno vacanena taṃ āpattiṃ paṭikātuṃ. Bhagavato etamatthaṃ ārocesuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, aññatarasmiṃ āvāse sabbo saṅgho sabhāgaṃ āpattiṃ āpanno hoti. So na jānāti tassā āpattiyā nāmagottaṃ. Tattha añño bhikkhu āgacchati bahussuto āgatāgamo dhammadharo ",
      " vinayadharo mātikādharo paṇḍito byatto medhāvī lajjī kukkuccako sikkhākāmo. Tamenaṃ aññataro bhikkhu yena so bhikkhu tenupasaṅkami, upasaṅkamitvā taṃ bhikkhuṃ evaṃ vadeti – ‘‘yo nu kho, āvuso, evañcevañca karoti, kiṃ nāma so āpattiṃ āpajjatī’’ti? So evaṃ vadeti – ‘‘yo kho, āvuso, evañcevañca karoti, imaṃ nāma so āpattiṃ āpajjati. Imaṃ nāma tvaṃ, āvuso, āpattiṃ āpanno; paṭikarohi taṃ āpatti’’nti. So evaṃ vadeti – ‘‘na kho ahaṃ, āvuso, ekova imaṃ āpattiṃ āpanno. Ayaṃ sabbo saṅgho imaṃ āpattiṃ āpanno’’ti. So evaṃ vadeti – ‘‘kiṃ te, āvuso, karissati paro āpanno vā anāpanno vā. Iṅgha, tvaṃ, āvuso, sakāya āpattiyā vuṭṭhāhī’’ti. So ce, bhikkhave, bhikkhu tassa bhikkhuno vacanena taṃ āpattiṃ paṭikaritvā yena te bhikkhū tenupasaṅkami, upasaṅkamitvā te bhikkhū evaṃ vadeti – ‘‘yo kira, āvuso, evañcevañca karoti imaṃ nāma so āpattiṃ āpajjati, imaṃ nāma tumhe āvuso āpattiṃ āpannā, paṭikarotha taṃ āpatti’’nti. Te ce, bhikkhave, bhikkhū tassa bhikkhuno vacanena taṃ āpattiṃ ",
      " paṭikareyyuṃ, iccetaṃ kusalaṃ. No ce paṭikareyyuṃ, na te, bhikkhave, bhikkhū tena bhikkhunā akāmā vacanīyāti."
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse sabbo saṅgho sabhāgaṃ āpattiṃ āpanno hoti. So na jānāti tassā āpattiyā nāmagottaṃ. Tattha añño bhikkhu āgacchati bahussuto āgatāgamo dhammadharo vinayadharo mātikādharo paṇḍito byatto medhāvī lajjī kukkuccako sikkhākāmo. Tamenaṃ aññataro bhikkhu yena so bhikkhu tenupasaṅkami, upasaṅkamitvā taṃ bhikkhuṃ evaṃ vadeti – ‘‘yo nu kho, āvuso, evañcevañca karoti, kiṃ nāma so āpattiṃ āpajjatī’’ti? So evaṃ vadeti – ‘‘yo kho, āvuso, evañcevañca karoti, imaṃ nāma so āpattiṃ āpajjati. Imaṃ nāma tvaṃ, āvuso, āpattiṃ āpanno; paṭikarohi taṃ āpatti’’nti. So evaṃ vadeti – ‘‘na kho ahaṃ, āvuso, ekova imaṃ āpattiṃ āpanno. Ayaṃ sabbo saṅgho imaṃ āpattiṃ āpanno’’ti. So evaṃ vadeti – ‘‘kiṃ te, āvuso, karissati paro āpanno vā anāpanno vā. Iṅgha, tvaṃ, āvuso, sakāya āpattiyā vuṭṭhāhī’’ti. So ce, bhikkhave, bhikkhu tassa bhikkhuno vacanena taṃ āpattiṃ paṭikaritvā yena te bhikkhū tenupasaṅkami, upasaṅkamitvā te bhikkhū evaṃ vadeti – ‘‘yo kira, āvuso, evañcevañca karoti imaṃ nāma so āpattiṃ āpajjati, imaṃ nāma tumhe āvuso āpattiṃ āpannā, paṭikarotha taṃ āpatti’’nti. Te ce, bhikkhave, bhikkhū tassa bhikkhuno vacanena taṃ āpattiṃ paṭikareyyuṃ, iccetaṃ kusalaṃ. No ce paṭikareyyuṃ, na te, bhikkhave, bhikkhū tena bhikkhunā akāmā vacanīyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Codanāvatthubhāṇavāro niṭṭhito dutiyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "95. Anāpattipannarasakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "172"
      },
      ". Tena ",
      " kho pana samayena aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatiṃsu cattāro vā atirekā vā. Te na jāniṃsu ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti ",
      ". Te dhammasaññino vinayasaññino vaggā samaggasaññino uposathaṃ akaṃsu, pātimokkhaṃ uddisiṃsu. Tehi uddissamāne pātimokkhe, athaññe āvāsikā bhikkhū āgacchiṃsu bahutarā. Bhagavato etamatthaṃ ārocesuṃ."
    ],
    "innerText": "172. Tena kho pana samayena aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatiṃsu cattāro vā atirekā vā. Te na jāniṃsu ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti . Te dhammasaññino vinayasaññino vaggā samaggasaññino uposathaṃ akaṃsu, pātimokkhaṃ uddisiṃsu. Tehi uddissamāne pātimokkhe, athaññe āvāsikā bhikkhū āgacchiṃsu bahutarā. Bhagavato etamatthaṃ ārocesuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te na jānanti ‘‘atthaññe ",
      " āvāsikā bhikkhū anāgatā’’ti. Te dhammasaññino vinayasaññino vaggā samaggasaññino uposathaṃ karonti, pātimokkhaṃ uddisanti. Tehi uddissamāne pātimokkhe, athaññe āvāsikā bhikkhū āgacchanti bahutarā. Tehi, bhikkhave, bhikkhūhi puna pātimokkhaṃ uddisitabbaṃ. Uddesakānaṃ anāpatti."
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te na jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te dhammasaññino vinayasaññino vaggā samaggasaññino uposathaṃ karonti, pātimokkhaṃ uddisanti. Tehi uddissamāne pātimokkhe, athaññe āvāsikā bhikkhū āgacchanti bahutarā. Tehi, bhikkhave, bhikkhūhi puna pātimokkhaṃ uddisitabbaṃ. Uddesakānaṃ anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te na jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te dhammasaññino vinayasaññino ",
      " vaggā samaggasaññino uposathaṃ karonti, pātimokkhaṃ uddisanti. Tehi uddissamāne pātimokkhe, athaññe āvāsikā bhikkhū āgacchanti samasamā. Uddiṭṭhaṃ suuddiṭṭhaṃ, avasesaṃ sotabbaṃ. Uddesakānaṃ anāpatti."
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te na jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te dhammasaññino vinayasaññino vaggā samaggasaññino uposathaṃ karonti, pātimokkhaṃ uddisanti. Tehi uddissamāne pātimokkhe, athaññe āvāsikā bhikkhū āgacchanti samasamā. Uddiṭṭhaṃ suuddiṭṭhaṃ, avasesaṃ sotabbaṃ. Uddesakānaṃ anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te na jānanti atthaññe āvāsikā bhikkhū anāgatāti, te dhammasaññino vinayasaññino vaggā samaggasaññino uposathaṃ karonti pātimokkhaṃ uddisanti. Tehi uddissamāne pātimokkhe, athaññe āvāsikā bhikkhū āgacchanti thokatarā. Uddiṭṭhaṃ suuddiṭṭhaṃ, avasesaṃ sotabbaṃ. Uddesakānaṃ anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te na jānanti atthaññe āvāsikā bhikkhū anāgatāti, te dhammasaññino vinayasaññino vaggā samaggasaññino uposathaṃ karonti pātimokkhaṃ ",
      " uddisanti. Tehi uddiṭṭhamatte pātimokkhe, athaññe āvāsikā bhikkhū āgacchanti bahutarā. Tehi, bhikkhave, bhikkhūhi puna pātimokkhaṃ uddisitabbaṃ. Uddesakānaṃ anāpatti."
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te na jānanti atthaññe āvāsikā bhikkhū anāgatāti, te dhammasaññino vinayasaññino vaggā samaggasaññino uposathaṃ karonti pātimokkhaṃ uddisanti. Tehi uddiṭṭhamatte pātimokkhe, athaññe āvāsikā bhikkhū āgacchanti bahutarā. Tehi, bhikkhave, bhikkhūhi puna pātimokkhaṃ uddisitabbaṃ. Uddesakānaṃ anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te na jānanti atthaññe āvāsikā bhikkhū anāgatāti, te dhammasaññino ",
      " vinayasaññino vaggā samaggasaññino uposathaṃ karonti pātimokkhaṃ uddisanti. Tehi ",
      " uddiṭṭhamatte pātimokkhe, athaññe āvāsikā bhikkhū āgacchanti samasamā. Uddiṭṭhaṃ suuddiṭṭhaṃ, tesaṃ santike pārisuddhi ārocetabbā. Uddesakānaṃ anāpatti."
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te na jānanti atthaññe āvāsikā bhikkhū anāgatāti, te dhammasaññino vinayasaññino vaggā samaggasaññino uposathaṃ karonti pātimokkhaṃ uddisanti. Tehi uddiṭṭhamatte pātimokkhe, athaññe āvāsikā bhikkhū āgacchanti samasamā. Uddiṭṭhaṃ suuddiṭṭhaṃ, tesaṃ santike pārisuddhi ārocetabbā. Uddesakānaṃ anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te na jānanti atthaññe āvāsikā bhikkhū anāgatāti, te dhammasaññino vinayasaññino vaggā samaggasaññino uposathaṃ karonti pātimokkhaṃ uddisanti. Tehi uddiṭṭhamatte pātimokkhe, athaññe āvāsikā bhikkhū āgacchanti thokatarā. Uddiṭṭhaṃ suuddiṭṭhaṃ, tesaṃ santike pārisuddhi ārocetabbā. Uddesakānaṃ anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te na jānanti atthaññe āvāsikā bhikkhū anāgatāti, te dhammasaññino vinayasaññino vaggā samaggasaññino uposathaṃ karonti pātimokkhaṃ uddisanti. Tehi uddiṭṭhamatte pātimokkhe, avuṭṭhitāya ",
      " parisāya, athaññe āvāsikā bhikkhū āgacchanti bahutarā. Tehi, bhikkhave, bhikkhūhi puna pātimokkhaṃ uddisitabbaṃ. Uddesakānaṃ anāpatti."
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te na jānanti atthaññe āvāsikā bhikkhū anāgatāti, te dhammasaññino vinayasaññino vaggā samaggasaññino uposathaṃ karonti pātimokkhaṃ uddisanti. Tehi uddiṭṭhamatte pātimokkhe, avuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti bahutarā. Tehi, bhikkhave, bhikkhūhi puna pātimokkhaṃ uddisitabbaṃ. Uddesakānaṃ anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā ",
      ". Te na jānanti atthaññe āvāsikā bhikkhū anāgatāti, te dhammasaññino vinayasaññino vaggā samaggasaññino uposathaṃ karonti pātimokkhaṃ uddisanti. Tehi uddiṭṭhamatte pātimokkhe, avuṭṭhitāya parisāya, athaññe āvāsikā ",
      " bhikkhū āgacchanti samasamā. Uddiṭṭhaṃ suuddiṭṭhaṃ, tesaṃ santike pārisuddhi ārocetabbā. Uddesakānaṃ anāpatti."
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā . Te na jānanti atthaññe āvāsikā bhikkhū anāgatāti, te dhammasaññino vinayasaññino vaggā samaggasaññino uposathaṃ karonti pātimokkhaṃ uddisanti. Tehi uddiṭṭhamatte pātimokkhe, avuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti samasamā. Uddiṭṭhaṃ suuddiṭṭhaṃ, tesaṃ santike pārisuddhi ārocetabbā. Uddesakānaṃ anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te na jānanti atthaññe āvāsikā bhikkhū anāgatāti, te dhammasaññino vinayasaññino vaggā samaggāsaññino uposathaṃ karonti pātimokkhaṃ uddisanti. Tehi uddiṭṭhamatte pātimokkhe, avuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti thokatarā. Uddiṭṭhaṃ suuddiṭṭhaṃ, tesaṃ santike pārisuddhi ārocetabbā. Uddesakānaṃ anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te na jānanti atthaññe āvāsikā bhikkhū anāgatāti, te dhammasaññino vinayasaññino vaggā samaggasaññino uposathaṃ karonti pātimokkhaṃ uddisanti. Tehi uddiṭṭhamatte pātimokkhe, ekaccāya vuṭṭhitāya parisāya, athaññe āvāsikā ",
      " bhikkhū āgacchanti bahutarā. Tehi, bhikkhave, bhikkhūhi puna pātimokkhaṃ uddisitabbaṃ. Uddesakānaṃ anāpatti."
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te na jānanti atthaññe āvāsikā bhikkhū anāgatāti, te dhammasaññino vinayasaññino vaggā samaggasaññino uposathaṃ karonti pātimokkhaṃ uddisanti. Tehi uddiṭṭhamatte pātimokkhe, ekaccāya vuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti bahutarā. Tehi, bhikkhave, bhikkhūhi puna pātimokkhaṃ uddisitabbaṃ. Uddesakānaṃ anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      " pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te na jānanti atthaññe āvāsikā bhikkhū anāgatāti, te dhammasaññino vinayasaññino vaggā samaggasaññino uposathaṃ karonti pātimokkhaṃ uddisanti. Tehi uddiṭṭhamatte pātimokkhe, ekaccāya vuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti samasamā. Uddiṭṭhaṃ suuddiṭṭhaṃ, tesaṃ santike pārisuddhi ārocetabbā. Uddesakānaṃ anāpatti."
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te na jānanti atthaññe āvāsikā bhikkhū anāgatāti, te dhammasaññino vinayasaññino vaggā samaggasaññino uposathaṃ karonti pātimokkhaṃ uddisanti. Tehi uddiṭṭhamatte pātimokkhe, ekaccāya vuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti samasamā. Uddiṭṭhaṃ suuddiṭṭhaṃ, tesaṃ santike pārisuddhi ārocetabbā. Uddesakānaṃ anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te na jānanti atthaññe āvāsikā bhikkhū anāgatāti, te dhammasaññino vinayasaññino vaggā samaggasaññino uposathaṃ karonti pātimokkhaṃ uddisanti. Tehi uddiṭṭhamatte pātimokkhe, ekaccāya vuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti thokatarā. Uddiṭṭhaṃ suuddiṭṭhaṃ, tesaṃ santike pārisuddhi ārocetabbā. Uddesakānaṃ anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      " pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te na jānanti atthaññe āvāsikā bhikkhū anāgatāti, te dhammasaññino vinayasaññino vaggā samaggasaññino uposathaṃ karonti pātimokkhaṃ uddisanti. Tehi uddiṭṭhamatte pātimokkhe, sabbāya vuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti bahutarā. Tehi, bhikkhave, bhikkhūhi puna pātimokkhaṃ uddisitabbaṃ. Uddesakānaṃ anāpatti."
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te na jānanti atthaññe āvāsikā bhikkhū anāgatāti, te dhammasaññino vinayasaññino vaggā samaggasaññino uposathaṃ karonti pātimokkhaṃ uddisanti. Tehi uddiṭṭhamatte pātimokkhe, sabbāya vuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti bahutarā. Tehi, bhikkhave, bhikkhūhi puna pātimokkhaṃ uddisitabbaṃ. Uddesakānaṃ anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      " pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te na jānanti atthaññe āvāsikā bhikkhū anāgatāti, te dhammasaññino vinayasaññino vaggā samaggasaññino uposathaṃ karonti pātimokkhaṃ uddisanti. Tehi uddiṭṭhamatte pātimokkhe, sabbāya vuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti samasamā. Uddiṭṭhaṃ suuddiṭṭhaṃ, tesaṃ santike pārisuddhi ārocetabbā. Uddesakānaṃ anāpatti."
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te na jānanti atthaññe āvāsikā bhikkhū anāgatāti, te dhammasaññino vinayasaññino vaggā samaggasaññino uposathaṃ karonti pātimokkhaṃ uddisanti. Tehi uddiṭṭhamatte pātimokkhe, sabbāya vuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti samasamā. Uddiṭṭhaṃ suuddiṭṭhaṃ, tesaṃ santike pārisuddhi ārocetabbā. Uddesakānaṃ anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te na jānanti atthaññe āvāsikā bhikkhū anāgatāti, te dhammasaññino vinayasaññino vaggā samaggasaññino uposathaṃ karonti pātimokkhaṃ uddisanti. Tehi uddiṭṭhamatte pātimokkhe, sabbāya vuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti thokatarā. Uddiṭṭhaṃ suuddiṭṭhaṃ, tesaṃ santike pārisuddhi ārocetabbā. Uddesakānaṃ anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Anāpattipannarasakaṃ niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "96. Vaggāvaggasaññīpannarasakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "173"
      },
      ". Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te dhammasaññino vinayasaññino vaggā vaggasaññino uposathaṃ karonti ",
      ", pātimokkhaṃ uddisanti. Tehi uddissamāne pātimokkhe, athaññe āvāsikā bhikkhū āgacchanti ",
      " bahutarā. Tehi, bhikkhave, bhikkhūhi puna pātimokkhaṃ uddisitabbaṃ. Uddesakānaṃ āpatti dukkaṭassa."
    ],
    "innerText": "173. Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te dhammasaññino vinayasaññino vaggā vaggasaññino uposathaṃ karonti , pātimokkhaṃ uddisanti. Tehi uddissamāne pātimokkhe, athaññe āvāsikā bhikkhū āgacchanti bahutarā. Tehi, bhikkhave, bhikkhūhi puna pātimokkhaṃ uddisitabbaṃ. Uddesakānaṃ āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te jānanti atthaññe āvāsikā bhikkhū anāgatāti, te dhammasaññino vinayasaññino vaggā samaggasaññino uposathaṃ karonti pātimokkhaṃ uddisanti. Tehi uddissamāne pātimokkhe, athaññe āvāsikā bhikkhū āgacchanti samasamā ",
      ". Uddiṭṭhaṃ suuddiṭṭhaṃ, avasesaṃ sotabbaṃ. Uddesakānaṃ āpatti dukkaṭassa."
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te jānanti atthaññe āvāsikā bhikkhū anāgatāti, te dhammasaññino vinayasaññino vaggā samaggasaññino uposathaṃ karonti pātimokkhaṃ uddisanti. Tehi uddissamāne pātimokkhe, athaññe āvāsikā bhikkhū āgacchanti samasamā . Uddiṭṭhaṃ suuddiṭṭhaṃ, avasesaṃ sotabbaṃ. Uddesakānaṃ āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te jānanti atthaññe āvāsikā bhikkhū anāgatāti te dhammasaññino vinayasaññino vaggā vaggasaññino uposathaṃ karonti pātimokkhaṃ uddisanti. Tehi uddissamāne pātimokkhe, athaññe āvāsikā bhikkhū āgacchanti thokatarā. Uddiṭṭhaṃ suuddiṭṭhaṃ, avasesaṃ sotabbaṃ. Uddesakānaṃ āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te dhammasaññino vinayasaññino vaggā vaggasaññino uposathaṃ karonti, pātimokkhaṃ uddisanti. Tehi uddiṭṭhamatte pātimokkhe…pe… avuṭṭhitāya ",
      " parisāya…pe… ekaccāya vuṭṭhitāya parisāya…pe… sabbāya vuṭṭhitāya ",
      " parisāya athaññe āvāsikā bhikkhū āgacchanti bahutarā…pe… samasamā…pe… thokatarā. Uddiṭṭhaṃ suuddiṭṭhaṃ, tesaṃ santike pārisuddhi ārocetabbā. Uddesakānaṃ āpatti dukkaṭassa."
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te dhammasaññino vinayasaññino vaggā vaggasaññino uposathaṃ karonti, pātimokkhaṃ uddisanti. Tehi uddiṭṭhamatte pātimokkhe…pe… avuṭṭhitāya parisāya…pe… ekaccāya vuṭṭhitāya parisāya…pe… sabbāya vuṭṭhitāya parisāya athaññe āvāsikā bhikkhū āgacchanti bahutarā…pe… samasamā…pe… thokatarā. Uddiṭṭhaṃ suuddiṭṭhaṃ, tesaṃ santike pārisuddhi ārocetabbā. Uddesakānaṃ āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vaggāvaggasaññipannarasakaṃ niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "97. Vematikapannarasakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "174"
      },
      ". Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te, kappati nu kho amhākaṃ uposatho kātuṃ na nu kho kappatīti, vematikā ",
      " uposathaṃ karonti, pātimokkhaṃ uddisanti. Tehi uddissamāne pātimokkhe, athaññe āvāsikā bhikkhū āgacchanti bahutarā. Tehi, bhikkhave, bhikkhūhi puna pātimokkhaṃ uddisitabbaṃ. Uddesakānaṃ āpatti dukkaṭassa."
    ],
    "innerText": "174. Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te, kappati nu kho amhākaṃ uposatho kātuṃ na nu kho kappatīti, vematikā uposathaṃ karonti, pātimokkhaṃ uddisanti. Tehi uddissamāne pātimokkhe, athaññe āvāsikā bhikkhū āgacchanti bahutarā. Tehi, bhikkhave, bhikkhūhi puna pātimokkhaṃ uddisitabbaṃ. Uddesakānaṃ āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      " pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti, te ‘‘kappati nu kho amhākaṃ uposatho kātuṃ, na nu kho kappatī’’ti, vematikā uposathaṃ karonti, pātimokkhaṃ uddisanti. Tehi uddissamāne pātimokkhe, athaññe āvāsikā bhikkhū āgacchanti samasamā. Uddiṭṭhaṃ suuddiṭṭhaṃ, avasesaṃ sotabbaṃ. Uddesakānaṃ āpatti dukkaṭassa."
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti, te ‘‘kappati nu kho amhākaṃ uposatho kātuṃ, na nu kho kappatī’’ti, vematikā uposathaṃ karonti, pātimokkhaṃ uddisanti. Tehi uddissamāne pātimokkhe, athaññe āvāsikā bhikkhū āgacchanti samasamā. Uddiṭṭhaṃ suuddiṭṭhaṃ, avasesaṃ sotabbaṃ. Uddesakānaṃ āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te jānanti atthaññe āvāsikā bhikkhū ",
      " anāgatāti, te kappati nu kho amhākaṃ uposatho kātuṃ, na nu kho kappatīti, vematikā uposathaṃ karonti, pātimokkhaṃ uddisanti. Tehi uddissamāne pātimokkhe athaññe āvāsikā bhikkhū āgacchanti thokatarā. Uddiṭṭhaṃ suuddiṭṭhaṃ, avasesaṃ sotabbaṃ. Uddesakānaṃ āpatti dukkaṭassa."
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te jānanti atthaññe āvāsikā bhikkhū anāgatāti, te kappati nu kho amhākaṃ uposatho kātuṃ, na nu kho kappatīti, vematikā uposathaṃ karonti, pātimokkhaṃ uddisanti. Tehi uddissamāne pātimokkhe athaññe āvāsikā bhikkhū āgacchanti thokatarā. Uddiṭṭhaṃ suuddiṭṭhaṃ, avasesaṃ sotabbaṃ. Uddesakānaṃ āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te, ‘‘kappati nu kho amhākaṃ uposatho kātuṃ na nu kho kappatī’’ti, vematikā uposathaṃ karonti, pātimokkhaṃ uddisanti. Tehi uddiṭṭhamatte pātimokkhe,…pe… avuṭṭhitāya parisāya…pe… ekaccāya vuṭṭhitāya parisāya…pe… sabbāya vuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti bahutarā…pe… samasamā…pe… thokatarā. Uddiṭṭhaṃ suuddiṭṭhaṃ, tesaṃ santike pārisuddhi ārocetabbā. Uddesakānaṃ āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vematikapannarasakaṃ niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "98. Kukkuccapakatapannarasakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "175"
      },
      ". Idha ",
      " pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘kappateva amhākaṃ ",
      " uposatho kātuṃ nāmhākaṃ na kappatī’’ti, kukkuccapakatā uposathaṃ karonti, pātimokkhaṃ uddisanti. Tehi uddissamāne pātimokkhe, athaññe āvāsikā bhikkhū āgacchanti bahutarā. Tehi, bhikkhave, bhikkhūhi puna pātimokkhaṃ uddisitabbaṃ. Uddesakānaṃ āpatti dukkaṭassa."
    ],
    "innerText": "175. Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘kappateva amhākaṃ uposatho kātuṃ nāmhākaṃ na kappatī’’ti, kukkuccapakatā uposathaṃ karonti, pātimokkhaṃ uddisanti. Tehi uddissamāne pātimokkhe, athaññe āvāsikā bhikkhū āgacchanti bahutarā. Tehi, bhikkhave, bhikkhūhi puna pātimokkhaṃ uddisitabbaṃ. Uddesakānaṃ āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘kappateva amhākaṃ uposatho kātuṃ nāmhākaṃ na kappatī’’ti, kukkuccapakatā uposathaṃ karonti, pātimokkhaṃ uddisanti. Tehi uddissamāne pātimokkhe, athaññe āvāsikā bhikkhū āgacchanti samasamā. Uddiṭṭhaṃ suuddiṭṭhaṃ, avasesaṃ sotabbaṃ. Uddesakānaṃ āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘kappateva amhākaṃ uposatho kātuṃ, nāmhākaṃ na kappatī’’ti, kukkuccapakatā uposathaṃ karonti, pātimokkhaṃ uddisanti. Tehi uddissamāne pātimokkhe, athaññe āvāsikā bhikkhū āgacchanti thokatarā. Uddiṭṭhaṃ suuddiṭṭhaṃ, avasesaṃ sotabbaṃ. Uddesakānaṃ āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave ",
      ", aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘kappateva amhākaṃ uposatho kātuṃ nāmhākaṃ na kappatī’’ti, kukkuccapakatā uposathaṃ karonti, pātimokkhaṃ uddisanti. Tehi uddiṭṭhamatte pātimokkhe,…pe… avuṭṭhitāya parisāya…pe… ekaccāya vuṭṭhitāya parisāya…pe… sabbāya vuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti bahutarā…pe… samasamā ",
      " …pe… thokatarā. Uddiṭṭhaṃ suuddiṭṭhaṃ, tesaṃ santike pārisuddhi ārocetabbā. Uddesakānaṃ āpatti dukkaṭassa."
    ],
    "innerText": "Idha pana, bhikkhave , aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘kappateva amhākaṃ uposatho kātuṃ nāmhākaṃ na kappatī’’ti, kukkuccapakatā uposathaṃ karonti, pātimokkhaṃ uddisanti. Tehi uddiṭṭhamatte pātimokkhe,…pe… avuṭṭhitāya parisāya…pe… ekaccāya vuṭṭhitāya parisāya…pe… sabbāya vuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti bahutarā…pe… samasamā …pe… thokatarā. Uddiṭṭhaṃ suuddiṭṭhaṃ, tesaṃ santike pārisuddhi ārocetabbā. Uddesakānaṃ āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Kukkuccapakatapannarasakaṃ niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "99. Bhedapurekkhārapannarasakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "176"
      },
      ". Idha ",
      " pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘nassantete, vinassantete, ko tehi attho’’ti – bhedapurekkhārā uposathaṃ karonti, pātimokkhaṃ uddisanti. Tehi uddissamāne pātimokkhe, athaññe āvāsikā bhikkhū āgacchanti bahutarā. Tehi ",
      ", bhikkhave, bhikkhūhi puna pātimokkhaṃ uddisitabbaṃ. Uddesakānaṃ āpatti thullaccayassa ",
      "."
    ],
    "innerText": "176. Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘nassantete, vinassantete, ko tehi attho’’ti – bhedapurekkhārā uposathaṃ karonti, pātimokkhaṃ uddisanti. Tehi uddissamāne pātimokkhe, athaññe āvāsikā bhikkhū āgacchanti bahutarā. Tehi , bhikkhave, bhikkhūhi puna pātimokkhaṃ uddisitabbaṃ. Uddesakānaṃ āpatti thullaccayassa ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘nassantete, vinassantete, ko tehi attho’’ti – bhedapurekkhārā uposathaṃ karonti, pātimokkhaṃ uddisanti. Tehi uddissamāne pātimokkhe, athaññe āvāsikā bhikkhū āgacchanti samasamā. Uddiṭṭhaṃ suuddiṭṭhaṃ, avasesaṃ sotabbaṃ. Uddesakānaṃ āpatti thullaccayassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘nassantete, vinassantete, ko tehi attho’’ti – bhedapurekkhārā uposathaṃ karonti, pātimokkhaṃ uddisanti. Tehi uddissamāne pātimokkhe, athaññe āvāsikā bhikkhū āgacchanti thokatarā. Uddiṭṭhaṃ suuddiṭṭhaṃ, avasesaṃ sotabbaṃ. Uddesakānaṃ āpatti thullaccayassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti ",
      ". Te ‘‘nassantete, vinassantete, ko tehi attho’’ti – bhedapurekkhārā uposathaṃ karonti, pātimokkhaṃ uddisanti. Tehi uddiṭṭhamatte pātimokkhe athaññe āvāsikā bhikkhū āgacchanti bahutarā. Tehi, bhikkhave, bhikkhūhi puna pātimokkhaṃ uddisitabbaṃ. Uddesakānaṃ āpatti thullaccayassa."
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti . Te ‘‘nassantete, vinassantete, ko tehi attho’’ti – bhedapurekkhārā uposathaṃ karonti, pātimokkhaṃ uddisanti. Tehi uddiṭṭhamatte pātimokkhe athaññe āvāsikā bhikkhū āgacchanti bahutarā. Tehi, bhikkhave, bhikkhūhi puna pātimokkhaṃ uddisitabbaṃ. Uddesakānaṃ āpatti thullaccayassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      " pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti te ‘‘nassantete, vinassantete, ko tehi attho’’ti bhedapurekkhārā uposathaṃ karonti, pātimokkhaṃ uddisanti. Tehi uddiṭṭhamatte pātimokkhe athaññe āvāsikā bhikkhū āgacchanti samasamā. Uddiṭṭhaṃ suuddiṭṭhaṃ, tesaṃ santike pārisuddhi ārocetabbā. Uddesakānaṃ āpatti thullaccayassa."
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti te ‘‘nassantete, vinassantete, ko tehi attho’’ti bhedapurekkhārā uposathaṃ karonti, pātimokkhaṃ uddisanti. Tehi uddiṭṭhamatte pātimokkhe athaññe āvāsikā bhikkhū āgacchanti samasamā. Uddiṭṭhaṃ suuddiṭṭhaṃ, tesaṃ santike pārisuddhi ārocetabbā. Uddesakānaṃ āpatti thullaccayassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘nassantete, vinassantete, ko tehi attho’’ti – bhedapurekkhārā uposathaṃ karonti, pātimokkhaṃ uddisanti. Tehi uddiṭṭhamatte pātimokkhe athaññe āvāsikā bhikkhū āgacchanti thokatarā. Uddiṭṭhaṃ suuddiṭṭhaṃ, tesaṃ santike pārisuddhi ārocetabbā. Uddesakānaṃ āpatti thullaccayassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘nassantete, vinassantete, ko tehi attho’’ti – bhedapurekkhārā uposathaṃ karonti, pātimokkhaṃ uddisanti. Tehi uddiṭṭhamatte pātimokkhe, avuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti bahutarā. Tehi, bhikkhave, bhikkhūhi puna pātimokkhaṃ uddisitabbaṃ. Uddesakānaṃ āpatti thullaccayassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘nassantete, vinassantete, ko tehi attho’’ti – bhedapurekkhārā uposathaṃ karonti, pātimokkhaṃ uddisanti. Tehi uddiṭṭhamatte pātimokkhe, avuṭṭhitāya parisāya, athaññe ",
      " āvāsikā bhikkhū āgacchanti samasamā. Uddiṭṭhaṃ suuddiṭṭhaṃ, tesaṃ santike pārisuddhi ārocetabbā. Uddesakānaṃ āpatti thullaccayassa."
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘nassantete, vinassantete, ko tehi attho’’ti – bhedapurekkhārā uposathaṃ karonti, pātimokkhaṃ uddisanti. Tehi uddiṭṭhamatte pātimokkhe, avuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti samasamā. Uddiṭṭhaṃ suuddiṭṭhaṃ, tesaṃ santike pārisuddhi ārocetabbā. Uddesakānaṃ āpatti thullaccayassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      " pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘nassantete, vinassantete, ko tehi attho’’ti – bhedapurekkhārā uposathaṃ karonti, pātimokkhaṃ uddisanti. Tehi uddiṭṭhamatte pātimokkhe, avuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti thokatarā. Uddiṭṭhaṃ suuddiṭṭhaṃ, tesaṃ santike pārisuddhi ārocetabbā. Uddesakānaṃ āpatti thullaccayassa."
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘nassantete, vinassantete, ko tehi attho’’ti – bhedapurekkhārā uposathaṃ karonti, pātimokkhaṃ uddisanti. Tehi uddiṭṭhamatte pātimokkhe, avuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti thokatarā. Uddiṭṭhaṃ suuddiṭṭhaṃ, tesaṃ santike pārisuddhi ārocetabbā. Uddesakānaṃ āpatti thullaccayassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘nassantete, vinassantete, ko tehi attho’’ti – bhedapurekkhārā uposathaṃ karonti, pātimokkhaṃ uddisanti. Tehi uddiṭṭhamatte pātimokkhe, ekaccāya vuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti bahutarā. Tehi, bhikkhave, bhikkhūhi puna pātimokkhaṃ uddisitabbaṃ. Uddesakānaṃ āpatti thullaccayassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘nassantete, vinassantete, ko tehi attho’’ti – bhedapurekkhārā uposathaṃ karonti, pātimokkhaṃ uddisanti. Tehi uddiṭṭhamatte pātimokkhe, ekaccāya vuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti samasamā. Uddiṭṭhaṃ suuddiṭṭhaṃ, tesaṃ santike pārisuddhi ārocetabbā. Uddesakānaṃ āpatti thullaccayassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘nassantete, vinassantete, ko tehi attho’’ti – bhedapurekkhārā uposathaṃ karonti, pātimokkhaṃ uddisanti. Tehi uddiṭṭhamatte pātimokkhe, ekaccāya vuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti thokatarā. Uddiṭṭhaṃ ",
      " suuddiṭṭhaṃ, tesaṃ santike pārisuddhi ārocetabbā. Uddesakānaṃ āpatti thullaccayassa."
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘nassantete, vinassantete, ko tehi attho’’ti – bhedapurekkhārā uposathaṃ karonti, pātimokkhaṃ uddisanti. Tehi uddiṭṭhamatte pātimokkhe, ekaccāya vuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti thokatarā. Uddiṭṭhaṃ suuddiṭṭhaṃ, tesaṃ santike pārisuddhi ārocetabbā. Uddesakānaṃ āpatti thullaccayassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      " pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘nassantete, vinassantete, ko tehi attho’’ti – bhedapurekkhārā uposathaṃ karonti, pātimokkhaṃ uddisanti. Tehi uddiṭṭhamatte pātimokkhe, sabbāya vuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti bahutarā. Tehi, bhikkhave, bhikkhūhi puna pātimokkhaṃ uddisitabbaṃ. Uddesakānaṃ āpatti thullaccayassa."
    ],
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘nassantete, vinassantete, ko tehi attho’’ti – bhedapurekkhārā uposathaṃ karonti, pātimokkhaṃ uddisanti. Tehi uddiṭṭhamatte pātimokkhe, sabbāya vuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti bahutarā. Tehi, bhikkhave, bhikkhūhi puna pātimokkhaṃ uddisitabbaṃ. Uddesakānaṃ āpatti thullaccayassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘nassantete, vinassantete, ko tehi attho’’ti – bhedapurekkhārā uposathaṃ karonti, pātimokkhaṃ uddisanti. Tehi uddiṭṭhamatte pātimokkhe, sabbāya vuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti samasamā. Uddiṭṭhaṃ suuddiṭṭhaṃ, tesaṃ santike pārisuddhi ārocetabbā. Uddesakānaṃ āpatti thullaccayassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te jānanti ‘‘atthaññe āvāsikā bhikkhū anāgatā’’ti. Te ‘‘nassantete, vinassantete, ko tehi attho’’ti – bhedapurekkhārā uposathaṃ karonti, pātimokkhaṃ uddisanti. Tehi uddiṭṭhamatte pātimokkhe, sabbāya vuṭṭhitāya parisāya, athaññe āvāsikā bhikkhū āgacchanti thokatarā. Uddiṭṭhaṃ suuddiṭṭhaṃ, tesaṃ santike pārisuddhi ārocetabbā. Uddesakānaṃ āpatti thullaccayassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Bhedapurekkhārapannarasakaṃ niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pañcavīsatikā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "100. Sīmokkantikapeyyālaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "177"
      },
      ". Idha ",
      " pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te na jānanti ‘‘aññe āvāsikā bhikkhū antosīmaṃ okkamantī’’ti ",
      " …pe… te na jānanti ‘‘aññe āvāsikā bhikkhū antosīmaṃ okkantā’’ti…pe… te na passanti aññe āvāsike bhikkhū antosīmaṃ okkamante ",
      " …pe… te na passanti aññe āvāsike bhikkhū antosīmaṃ okkante…pe… te na suṇanti ‘‘aññe āvāsikā bhikkhū antosīmaṃ okkamantī’’ti…pe… te na suṇanti ‘‘aññe āvāsikā bhikkhū antosīmaṃ okkantā’’ti…pe…."
    ],
    "innerText": "177. Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā āvāsikā bhikkhū sannipatanti cattāro vā atirekā vā. Te na jānanti ‘‘aññe āvāsikā bhikkhū antosīmaṃ okkamantī’’ti …pe… te na jānanti ‘‘aññe āvāsikā bhikkhū antosīmaṃ okkantā’’ti…pe… te na passanti aññe āvāsike bhikkhū antosīmaṃ okkamante …pe… te na passanti aññe āvāsike bhikkhū antosīmaṃ okkante…pe… te na suṇanti ‘‘aññe āvāsikā bhikkhū antosīmaṃ okkamantī’’ti…pe… te na suṇanti ‘‘aññe āvāsikā bhikkhū antosīmaṃ okkantā’’ti…pe…."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "Āvāsikena āvāsikā ekasatapañcasattati tikanayato, āvāsikena āgantukā, āgantukena āvāsikā, āgantukena āgantukā peyyālamukhena satta tikasatāni honti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "178"
      },
      ". Idha pana, bhikkhave, āvāsikānaṃ bhikkhūnaṃ cātuddaso hoti, āgantukānaṃ pannaraso. Sace āvāsikā bahutarā honti, āgantukehi āvāsikānaṃ anuvattitabbaṃ. Sace samasamā honti, āgantukehi āvāsikānaṃ anuvattitabbaṃ. Sace āgantukā bahutarā honti, āvāsikehi āgantukānaṃ anuvattitabbaṃ."
    ],
    "innerText": "178. Idha pana, bhikkhave, āvāsikānaṃ bhikkhūnaṃ cātuddaso hoti, āgantukānaṃ pannaraso. Sace āvāsikā bahutarā honti, āgantukehi āvāsikānaṃ anuvattitabbaṃ. Sace samasamā honti, āgantukehi āvāsikānaṃ anuvattitabbaṃ. Sace āgantukā bahutarā honti, āvāsikehi āgantukānaṃ anuvattitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, āvāsikānaṃ bhikkhūnaṃ pannaraso hoti, āgantukānaṃ cātuddaso. Sace āvāsikā bahutarā honti, āgantukehi āvāsikānaṃ anuvattitabbaṃ. Sace samasamā honti, āgantukehi āvāsikānaṃ anuvattitabbaṃ. Sace āgantukā bahutarā honti, āvāsikehi āgantukānaṃ anuvattitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, āvāsikānaṃ bhikkhūnaṃ pāṭipado hoti, āgantukānaṃ pannaraso. Sace āvāsikā bahutarā honti, āvāsikehi ",
      " āgantukānaṃ nākāmā dātabbā sāmaggī. Āgantukehi nissīmaṃ gantvā uposatho kātabbo. Sace samasamā honti, āvāsikehi āgantukānaṃ nākāmā dātabbā sāmaggī. Āgantukehi nissīmaṃ ",
      " gantvā uposatho kātabbo. Sace āgantukā bahutarā honti, āvāsikehi āgantukānaṃ sāmaggī vā dātabbā nissīmaṃ vā gantabbaṃ."
    ],
    "innerText": "Idha pana, bhikkhave, āvāsikānaṃ bhikkhūnaṃ pāṭipado hoti, āgantukānaṃ pannaraso. Sace āvāsikā bahutarā honti, āvāsikehi āgantukānaṃ nākāmā dātabbā sāmaggī. Āgantukehi nissīmaṃ gantvā uposatho kātabbo. Sace samasamā honti, āvāsikehi āgantukānaṃ nākāmā dātabbā sāmaggī. Āgantukehi nissīmaṃ gantvā uposatho kātabbo. Sace āgantukā bahutarā honti, āvāsikehi āgantukānaṃ sāmaggī vā dātabbā nissīmaṃ vā gantabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "children": [
      "Idha pana, bhikkhave, āvāsikānaṃ bhikkhūnaṃ pannaraso hoti, āgantukānaṃ "
    ],
    "innerText": "Idha pana, bhikkhave, āvāsikānaṃ bhikkhūnaṃ pannaraso hoti, āgantukānaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pāṭipado. Sace āvāsikā bahutarā honti, āgantukehi āvāsikānaṃ sāmaggī vā dātabbā nissīmaṃ ",
      " vā gantabbaṃ. Sace samasamā honti, āgantukehi āvāsikānaṃ sāmaggī vā dātabbā nissīmaṃ vā gantabbaṃ. Sace āgantukā bahutarā honti, āgantukehi āvāsikānaṃ nākāmā dātabbā sāmaggī. Āvāsikehi nissīmaṃ gantvā uposatho kātabbo."
    ],
    "innerText": "Pāṭipado. Sace āvāsikā bahutarā honti, āgantukehi āvāsikānaṃ sāmaggī vā dātabbā nissīmaṃ vā gantabbaṃ. Sace samasamā honti, āgantukehi āvāsikānaṃ sāmaggī vā dātabbā nissīmaṃ vā gantabbaṃ. Sace āgantukā bahutarā honti, āgantukehi āvāsikānaṃ nākāmā dātabbā sāmaggī. Āvāsikehi nissīmaṃ gantvā uposatho kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sīmokkantikapeyyālaṃ niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "101. Liṅgādidassanaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "179"
      },
      ". Idha pana, bhikkhave, āgantukā bhikkhū passanti āvāsikānaṃ bhikkhūnaṃ āvāsikākāraṃ, āvāsikaliṅgaṃ, āvāsikanimittaṃ, āvāsikuddesaṃ, supaññattaṃ mañcapīṭhaṃ, bhisibibbohanaṃ, pānīyaṃ paribhojanīyaṃ sūpaṭṭhitaṃ, pariveṇaṃ susammaṭṭhaṃ; passitvā vematikā honti – ‘‘atthi nu kho āvāsikā bhikkhū natthi nu kho’’ti. Te vematikā na vicinanti; avicinitvā uposathaṃ karonti. Āpatti dukkaṭassa. Te vematikā vicinanti; vicinitvā na passanti; apassitvā uposathaṃ karonti. Anāpatti. Te vematikā vicinanti; vicinitvā passanti; passitvā ekato ",
      " uposathaṃ karonti. Anāpatti. Te vematikā vicinanti; vicinitvā passanti; passitvā pāṭekkaṃ uposathaṃ karonti. Āpatti dukkaṭassa. Te vematikā vicinanti; vicinitvā passanti; passitvā – ‘‘nassantete, vinassantete, ko tehi attho’’ti – bhedapurekkhārā uposathaṃ karonti. Āpatti thullaccayassa."
    ],
    "innerText": "179. Idha pana, bhikkhave, āgantukā bhikkhū passanti āvāsikānaṃ bhikkhūnaṃ āvāsikākāraṃ, āvāsikaliṅgaṃ, āvāsikanimittaṃ, āvāsikuddesaṃ, supaññattaṃ mañcapīṭhaṃ, bhisibibbohanaṃ, pānīyaṃ paribhojanīyaṃ sūpaṭṭhitaṃ, pariveṇaṃ susammaṭṭhaṃ; passitvā vematikā honti – ‘‘atthi nu kho āvāsikā bhikkhū natthi nu kho’’ti. Te vematikā na vicinanti; avicinitvā uposathaṃ karonti. Āpatti dukkaṭassa. Te vematikā vicinanti; vicinitvā na passanti; apassitvā uposathaṃ karonti. Anāpatti. Te vematikā vicinanti; vicinitvā passanti; passitvā ekato uposathaṃ karonti. Anāpatti. Te vematikā vicinanti; vicinitvā passanti; passitvā pāṭekkaṃ uposathaṃ karonti. Āpatti dukkaṭassa. Te vematikā vicinanti; vicinitvā passanti; passitvā – ‘‘nassantete, vinassantete, ko tehi attho’’ti – bhedapurekkhārā uposathaṃ karonti. Āpatti thullaccayassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, āgantukā bhikkhū suṇanti āvāsikānaṃ bhikkhūnaṃ āvāsikākāraṃ, āvāsikaliṅgaṃ, āvāsikanimittaṃ, āvāsikuddesaṃ, caṅkamantānaṃ padasaddaṃ, sajjhāyasaddaṃ, ukkāsitasaddaṃ, khipitasaddaṃ; sutvā vematikā honti – ‘‘atthi nu kho āvāsikā bhikkhū natthi nu kho’’ti. Te vematikā na vicinanti; avicinitvā uposathaṃ karonti. Āpatti dukkaṭassa. Te vematikā vicinanti; vicinitvā na passanti; apassitvā uposathaṃ ",
      " karonti. Anāpatti. Te vematikā vicinanti; vicinitvā passanti; passitvā ekato uposathaṃ karonti. Anāpatti. Te vematikā vicinanti; vicinitvā passanti; passitvā pāṭekkaṃ uposathaṃ karonti. Āpatti dukkaṭassa. Te vematikā vicinanti; vicinitvā passanti; passitvā – ‘‘nassantete, vinassantete, ko tehi attho’’ti – bhedapurekkhārā uposathaṃ karonti. Āpatti thullaccayassa."
    ],
    "innerText": "Idha pana, bhikkhave, āgantukā bhikkhū suṇanti āvāsikānaṃ bhikkhūnaṃ āvāsikākāraṃ, āvāsikaliṅgaṃ, āvāsikanimittaṃ, āvāsikuddesaṃ, caṅkamantānaṃ padasaddaṃ, sajjhāyasaddaṃ, ukkāsitasaddaṃ, khipitasaddaṃ; sutvā vematikā honti – ‘‘atthi nu kho āvāsikā bhikkhū natthi nu kho’’ti. Te vematikā na vicinanti; avicinitvā uposathaṃ karonti. Āpatti dukkaṭassa. Te vematikā vicinanti; vicinitvā na passanti; apassitvā uposathaṃ karonti. Anāpatti. Te vematikā vicinanti; vicinitvā passanti; passitvā ekato uposathaṃ karonti. Anāpatti. Te vematikā vicinanti; vicinitvā passanti; passitvā pāṭekkaṃ uposathaṃ karonti. Āpatti dukkaṭassa. Te vematikā vicinanti; vicinitvā passanti; passitvā – ‘‘nassantete, vinassantete, ko tehi attho’’ti – bhedapurekkhārā uposathaṃ karonti. Āpatti thullaccayassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, āvāsikā bhikkhū passanti āgantukānaṃ bhikkhūnaṃ āgantukākāraṃ, āgantukaliṅgaṃ, āgantukanimittaṃ, āgantukuddesaṃ, aññātakaṃ pattaṃ, aññātakaṃ ",
      " cīvaraṃ, aññātakaṃ nisīdanaṃ, pādānaṃ dhotaṃ, udakanissekaṃ; passitvā ",
      " vematikā honti – ‘‘atthi nu kho āgantukā bhikkhū natthi nu kho’’ti. Te vematikā na vicinanti; avicinitvā uposathaṃ karonti. Āpatti dukkaṭassa. Te vematikā vicinanti; vicinitvā na passanti; apassitvā uposathaṃ karonti. Anāpatti. Te vematikā vicinanti; vicinitvā passanti; passitvā ekato uposathaṃ karonti. Anāpatti. Te vematikā vicinanti; vicinitvā passanti; passitvā pāṭekkaṃ uposathaṃ karonti. Āpatti dukkaṭassa. Te vematikā vicinanti; vicinitvā passanti; passitvā – ‘‘nassantete, vinassantete, ko tehi attho’’ti – bhedapurekkhārā uposathaṃ karonti. Āpatti thullaccayassa."
    ],
    "innerText": "Idha pana, bhikkhave, āvāsikā bhikkhū passanti āgantukānaṃ bhikkhūnaṃ āgantukākāraṃ, āgantukaliṅgaṃ, āgantukanimittaṃ, āgantukuddesaṃ, aññātakaṃ pattaṃ, aññātakaṃ cīvaraṃ, aññātakaṃ nisīdanaṃ, pādānaṃ dhotaṃ, udakanissekaṃ; passitvā vematikā honti – ‘‘atthi nu kho āgantukā bhikkhū natthi nu kho’’ti. Te vematikā na vicinanti; avicinitvā uposathaṃ karonti. Āpatti dukkaṭassa. Te vematikā vicinanti; vicinitvā na passanti; apassitvā uposathaṃ karonti. Anāpatti. Te vematikā vicinanti; vicinitvā passanti; passitvā ekato uposathaṃ karonti. Anāpatti. Te vematikā vicinanti; vicinitvā passanti; passitvā pāṭekkaṃ uposathaṃ karonti. Āpatti dukkaṭassa. Te vematikā vicinanti; vicinitvā passanti; passitvā – ‘‘nassantete, vinassantete, ko tehi attho’’ti – bhedapurekkhārā uposathaṃ karonti. Āpatti thullaccayassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, āvāsikā bhikkhū suṇanti āgantukānaṃ bhikkhūnaṃ āgantukākāraṃ, āgantukaliṅgaṃ, āgantukanimittaṃ, āgantukuddesaṃ, āgacchantānaṃ padasaddaṃ, upāhanapapphoṭanasaddaṃ, ukkāsitasaddaṃ, khipitasaddaṃ; sutvā vematikā honti – ‘‘atthi nu kho āgantukā bhikkhū natthi nu kho’’ti. Te vematikā na vicinanti; avicinitvā uposathaṃ karonti. Āpatti dukkaṭassa. Te vematikā vicinanti; vicinitvā na passanti; apassitvā uposathaṃ karonti. Anāpatti. Te vematikā vicinanti; vicinitvā passanti; passitvā ekato uposathaṃ karonti. Anāpatti. Te vematikā vicinanti; vicinitvā passanti; passitvā pāṭekkaṃ uposathaṃ karonti. Āpatti dukkaṭassa. Te vematikā vicinanti; vicinitvā passanti; passitvā – ‘‘nassantete, vinassantete ",
      ", ko tehi attho’’ti – bhedapurekkhārā uposathaṃ karonti. Āpatti thullaccayassa ",
      "."
    ],
    "innerText": "Idha pana, bhikkhave, āvāsikā bhikkhū suṇanti āgantukānaṃ bhikkhūnaṃ āgantukākāraṃ, āgantukaliṅgaṃ, āgantukanimittaṃ, āgantukuddesaṃ, āgacchantānaṃ padasaddaṃ, upāhanapapphoṭanasaddaṃ, ukkāsitasaddaṃ, khipitasaddaṃ; sutvā vematikā honti – ‘‘atthi nu kho āgantukā bhikkhū natthi nu kho’’ti. Te vematikā na vicinanti; avicinitvā uposathaṃ karonti. Āpatti dukkaṭassa. Te vematikā vicinanti; vicinitvā na passanti; apassitvā uposathaṃ karonti. Anāpatti. Te vematikā vicinanti; vicinitvā passanti; passitvā ekato uposathaṃ karonti. Anāpatti. Te vematikā vicinanti; vicinitvā passanti; passitvā pāṭekkaṃ uposathaṃ karonti. Āpatti dukkaṭassa. Te vematikā vicinanti; vicinitvā passanti; passitvā – ‘‘nassantete, vinassantete , ko tehi attho’’ti – bhedapurekkhārā uposathaṃ karonti. Āpatti thullaccayassa ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Liṅgādidassanaṃ niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "102. Nānāsaṃvāsakādīhi uposathakaraṇaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "180"
      },
      ". Idha ",
      " pana, bhikkhave, āgantukā bhikkhū passanti āvāsike bhikkhū nānāsaṃvāsake. Te samānasaṃvāsakadiṭṭhiṃ paṭilabhanti; samānasaṃvāsakadiṭṭhiṃ paṭilabhitvā na pucchanti; apucchitvā ekato uposathaṃ karonti. Anāpatti. Te pucchanti; pucchitvā nābhivitaranti; anabhivitaritvā ekato uposathaṃ karonti. Āpatti dukkaṭassa. Te pucchanti; pucchitvā nābhivitaranti; anabhivitaritvā pāṭekkaṃ uposathaṃ karonti. Anāpatti."
    ],
    "innerText": "180. Idha pana, bhikkhave, āgantukā bhikkhū passanti āvāsike bhikkhū nānāsaṃvāsake. Te samānasaṃvāsakadiṭṭhiṃ paṭilabhanti; samānasaṃvāsakadiṭṭhiṃ paṭilabhitvā na pucchanti; apucchitvā ekato uposathaṃ karonti. Anāpatti. Te pucchanti; pucchitvā nābhivitaranti; anabhivitaritvā ekato uposathaṃ karonti. Āpatti dukkaṭassa. Te pucchanti; pucchitvā nābhivitaranti; anabhivitaritvā pāṭekkaṃ uposathaṃ karonti. Anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      " pana, bhikkhave, āgantukā bhikkhū passanti āvāsike bhikkhū samānasaṃvāsake. Te nānāsaṃvāsakadiṭṭhiṃ paṭilabhanti; nānāsaṃvāsakadiṭṭhiṃ paṭilabhitvā na pucchanti; apucchitvā ekato uposathaṃ karonti. Āpatti dukkaṭassa. Te pucchanti; pucchitvā abhivitaranti; abhivitaritvā pāṭekkaṃ uposathaṃ karonti. Āpatti dukkaṭassa. Te pucchanti; pucchitvā abhivitaranti; abhivitaritvā ekato uposathaṃ karonti. Anāpatti."
    ],
    "innerText": "Idha pana, bhikkhave, āgantukā bhikkhū passanti āvāsike bhikkhū samānasaṃvāsake. Te nānāsaṃvāsakadiṭṭhiṃ paṭilabhanti; nānāsaṃvāsakadiṭṭhiṃ paṭilabhitvā na pucchanti; apucchitvā ekato uposathaṃ karonti. Āpatti dukkaṭassa. Te pucchanti; pucchitvā abhivitaranti; abhivitaritvā pāṭekkaṃ uposathaṃ karonti. Āpatti dukkaṭassa. Te pucchanti; pucchitvā abhivitaranti; abhivitaritvā ekato uposathaṃ karonti. Anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha pana, bhikkhave, āvāsikā bhikkhū passanti āgantuke bhikkhū nānāsaṃvāsake. Te samānasaṃvāsakadiṭṭhiṃ paṭilabhanti; samānasaṃvāsakadiṭṭhiṃ paṭilabhitvā na pucchanti; apucchitvā ekato uposathaṃ karonti. Anāpatti. Te pucchanti; pucchitvā nābhivitaranti; anabhivitaritvā ekato uposathaṃ karonti. Āpatti dukkaṭassa. Te pucchanti; pucchitvā nābhivitaranti ",
      "; anabhivitaritvā pāṭekkaṃ uposathaṃ karonti. Anāpatti."
    ],
    "innerText": "Idha pana, bhikkhave, āvāsikā bhikkhū passanti āgantuke bhikkhū nānāsaṃvāsake. Te samānasaṃvāsakadiṭṭhiṃ paṭilabhanti; samānasaṃvāsakadiṭṭhiṃ paṭilabhitvā na pucchanti; apucchitvā ekato uposathaṃ karonti. Anāpatti. Te pucchanti; pucchitvā nābhivitaranti; anabhivitaritvā ekato uposathaṃ karonti. Āpatti dukkaṭassa. Te pucchanti; pucchitvā nābhivitaranti ; anabhivitaritvā pāṭekkaṃ uposathaṃ karonti. Anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idha pana, bhikkhave, āvāsikā bhikkhū passanti āgantuke bhikkhū samānasaṃvāsake. Te nānāsaṃvāsakadiṭṭhiṃ paṭilabhanti; nānāsaṃvāsakadiṭṭhiṃ paṭilabhitvā na pucchanti; apucchitvā ekato uposathaṃ karonti. Āpatti dukkaṭassa. Te pucchanti; pucchitvā abhivitaranti; abhivitaritvā pāṭekkaṃ uposathaṃ karonti. Āpatti dukkaṭassa. Te pucchanti; pucchitvā abhivitaranti; abhivitaritvā ekato uposathaṃ karonti. Anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Nānāsaṃvāsakādīhi uposathakaraṇaṃ niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "103. Nagantabbavāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "181"
      },
      ". Na, bhikkhave, tadahuposathe sabhikkhukā āvāsā abhikkhuko āvāso gantabbo, aññatra saṅghena aññatra antarāyā. Na, bhikkhave ",
      ", tadahuposathe sabhikkhukā āvāsā abhikkhuko anāvāso gantabbo, aññatra saṅghena aññatra antarāyā. Na, bhikkhave, tadahuposathe sabhikkhukā āvāsā abhikkhuko āvāso vā anāvāso vā gantabbo, aññatra saṅghena aññatra antarāyā."
    ],
    "innerText": "181. Na, bhikkhave, tadahuposathe sabhikkhukā āvāsā abhikkhuko āvāso gantabbo, aññatra saṅghena aññatra antarāyā. Na, bhikkhave , tadahuposathe sabhikkhukā āvāsā abhikkhuko anāvāso gantabbo, aññatra saṅghena aññatra antarāyā. Na, bhikkhave, tadahuposathe sabhikkhukā āvāsā abhikkhuko āvāso vā anāvāso vā gantabbo, aññatra saṅghena aññatra antarāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Na ",
      ", bhikkhave, tadahuposathe sabhikkhukā anāvāsā abhikkhuko āvāso gantabbo, aññatra saṅghena aññatra antarāyā. Na, bhikkhave, tadahuposathe sabhikkhukā anāvāsā abhikkhuko anāvāso gantabbo, aññatra saṅghena aññatra antarāyā. Na, bhikkhave, tadahuposathe sabhikkhukā anāvāsā abhikkhuko āvāso vā anāvāso vā gantabbo, aññatra saṅghena aññatra antarāyā."
    ],
    "innerText": "Na , bhikkhave, tadahuposathe sabhikkhukā anāvāsā abhikkhuko āvāso gantabbo, aññatra saṅghena aññatra antarāyā. Na, bhikkhave, tadahuposathe sabhikkhukā anāvāsā abhikkhuko anāvāso gantabbo, aññatra saṅghena aññatra antarāyā. Na, bhikkhave, tadahuposathe sabhikkhukā anāvāsā abhikkhuko āvāso vā anāvāso vā gantabbo, aññatra saṅghena aññatra antarāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Na, bhikkhave, tadahuposathe sabhikkhukā āvāsā vā anāvāsā vā abhikkhuko āvāso gantabbo, aññatra saṅghena aññatra antarāyā. Na, bhikkhave ",
      ", tadahuposathe sabhikkhukā āvāsā vā anāvāsā vā abhikkhuko anāvāso gantabbo, aññatra saṅghena aññatra antarāyā. Na, bhikkhave, tadahuposathe sabhikkhukā āvāsā vā anāvāsā vā abhikkhuko āvāso vā anāvāso vā gantabbo, aññatra saṅghena aññatra antarāyā."
    ],
    "innerText": "Na, bhikkhave, tadahuposathe sabhikkhukā āvāsā vā anāvāsā vā abhikkhuko āvāso gantabbo, aññatra saṅghena aññatra antarāyā. Na, bhikkhave , tadahuposathe sabhikkhukā āvāsā vā anāvāsā vā abhikkhuko anāvāso gantabbo, aññatra saṅghena aññatra antarāyā. Na, bhikkhave, tadahuposathe sabhikkhukā āvāsā vā anāvāsā vā abhikkhuko āvāso vā anāvāso vā gantabbo, aññatra saṅghena aññatra antarāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Na, bhikkhave, tadahuposathe ",
      " sabhikkhukā āvāsā sabhikkhuko āvāso gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra saṅghena aññatra antarāyā. Na, bhikkhave, tadahuposathe sabhikkhukā āvāsā sabhikkhuko anāvāso gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra saṅghena aññatra antarāyā. Na, bhikkhave, tadahuposathe sabhikkhukā āvāsā sabhikkhuko āvāso vā anāvāso vā gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra saṅghena aññatra antarāyā."
    ],
    "innerText": "Na, bhikkhave, tadahuposathe sabhikkhukā āvāsā sabhikkhuko āvāso gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra saṅghena aññatra antarāyā. Na, bhikkhave, tadahuposathe sabhikkhukā āvāsā sabhikkhuko anāvāso gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra saṅghena aññatra antarāyā. Na, bhikkhave, tadahuposathe sabhikkhukā āvāsā sabhikkhuko āvāso vā anāvāso vā gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra saṅghena aññatra antarāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Na, bhikkhave, tadahuposathe sabhikkhukā anāvāsā sabhikkhuko āvāso gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra saṅghena aññatra antarāyā. Na, bhikkhave, tadahuposathe sabhikkhukā anāvāsā sabhikkhuko anāvāso gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra saṅghena aññatra antarāyā. Na, bhikkhave, tadahuposathe ",
      " sabhikkhukā anāvāsā sabhikkhuko āvāso vā anāvāso vā gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra saṅghena aññatra antarāyā."
    ],
    "innerText": "Na, bhikkhave, tadahuposathe sabhikkhukā anāvāsā sabhikkhuko āvāso gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra saṅghena aññatra antarāyā. Na, bhikkhave, tadahuposathe sabhikkhukā anāvāsā sabhikkhuko anāvāso gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra saṅghena aññatra antarāyā. Na, bhikkhave, tadahuposathe sabhikkhukā anāvāsā sabhikkhuko āvāso vā anāvāso vā gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra saṅghena aññatra antarāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Na, bhikkhave, tadahuposathe sabhikkhukā āvāsā vā anāvāsā vā sabhikkhuko āvāso gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra saṅghena aññatra antarāyā. Na, bhikkhave, tadahuposathe sabhikkhukā āvāsā vā anāvāsā vā sabhikkhuko anāvāso gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra saṅghena aññatra antarāyā. Na, bhikkhave, tadahuposathe ",
      " sabhikkhukā āvāsā vā anāvāsā vā sabhikkhuko āvāso vā anāvāso vā gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra saṅghena aññatra antarāyā."
    ],
    "innerText": "Na, bhikkhave, tadahuposathe sabhikkhukā āvāsā vā anāvāsā vā sabhikkhuko āvāso gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra saṅghena aññatra antarāyā. Na, bhikkhave, tadahuposathe sabhikkhukā āvāsā vā anāvāsā vā sabhikkhuko anāvāso gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra saṅghena aññatra antarāyā. Na, bhikkhave, tadahuposathe sabhikkhukā āvāsā vā anāvāsā vā sabhikkhuko āvāso vā anāvāso vā gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra saṅghena aññatra antarāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Nagantabbavāro niṭṭhito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "104. Gantabbavāro"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "182"
      },
      ". Gantabbo, bhikkhave, tadahuposathe sabhikkhukā āvāsā sabhikkhuko āvāso, yatthassu bhikkhū samānasaṃvāsakā, yaṃ jaññā – ‘‘sakkomi ajjeva gantu’’nti. Gantabbo, bhikkhave, tadahuposathe sabhikkhukā āvāsā sabhikkhuko anāvāso…pe… sabhikkhuko āvāso vā anāvāso vā, yatthassu bhikkhū samānasaṃvāsakā, yaṃ jaññā – ‘‘sakkomi ajjeva gantu’’nti."
    ],
    "innerText": "182. Gantabbo, bhikkhave, tadahuposathe sabhikkhukā āvāsā sabhikkhuko āvāso, yatthassu bhikkhū samānasaṃvāsakā, yaṃ jaññā – ‘‘sakkomi ajjeva gantu’’nti. Gantabbo, bhikkhave, tadahuposathe sabhikkhukā āvāsā sabhikkhuko anāvāso…pe… sabhikkhuko āvāso vā anāvāso vā, yatthassu bhikkhū samānasaṃvāsakā, yaṃ jaññā – ‘‘sakkomi ajjeva gantu’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Gantabbo, bhikkhave, tadahuposathe sabhikkhukā anāvāsā sabhikkhuko ",
      " āvāso…pe… sabhikkhuko anāvāso…pe… sabhikkhuko āvāso vā anāvāso vā, yatthassu bhikkhū samānasaṃvāsakā, yaṃ jaññā – ‘‘sakkomi ajjeva gantu’’nti."
    ],
    "innerText": "Gantabbo, bhikkhave, tadahuposathe sabhikkhukā anāvāsā sabhikkhuko āvāso…pe… sabhikkhuko anāvāso…pe… sabhikkhuko āvāso vā anāvāso vā, yatthassu bhikkhū samānasaṃvāsakā, yaṃ jaññā – ‘‘sakkomi ajjeva gantu’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Gantabbo, bhikkhave, tadahuposathe sabhikkhukā āvāsā vā anāvāsā vā sabhikkhuko āvāso…pe… sabhikkhuko anāvāso…pe… sabhikkhuko āvāso vā anāvāso vā, yatthassu bhikkhū samānasaṃvāsakā, yaṃ jaññā – ‘‘sakkomi ajjeva gantu’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Gantabbavāro niṭṭhito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "105. Vajjanīyapuggalasandassanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "183"
      },
      ". Na, bhikkhave, bhikkhuniyā nisinnaparisāya pātimokkhaṃ uddisitabbaṃ. Yo uddiseyya, āpatti dukkaṭassa. Na sikkhamānāya…pe… na sāmaṇerassa ",
      " …pe… na sāmaṇeriyā…pe… na sikkhāpaccakkhātakassa…pe… na antimavatthuṃ ajjhāpannakassa nisinnaparisāya pātimokkhaṃ uddisitabbaṃ. Yo uddiseyya, āpatti dukkaṭassa."
    ],
    "innerText": "183. Na, bhikkhave, bhikkhuniyā nisinnaparisāya pātimokkhaṃ uddisitabbaṃ. Yo uddiseyya, āpatti dukkaṭassa. Na sikkhamānāya…pe… na sāmaṇerassa …pe… na sāmaṇeriyā…pe… na sikkhāpaccakkhātakassa…pe… na antimavatthuṃ ajjhāpannakassa nisinnaparisāya pātimokkhaṃ uddisitabbaṃ. Yo uddiseyya, āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Na ",
      " āpattiyā adassane ukkhittakassa nisinnaparisāya pātimokkhaṃ uddisitabbaṃ. Yo uddiseyya, yathādhammo kāretabbo. Na āpattiyā appaṭikamme ukkhittakassa nisinnaparisāya…pe… na pāpikāya diṭṭhiyā appaṭinissagge ukkhittakassa nisinnaparisāya pātimokkhaṃ uddisitabbaṃ. Yo uddiseyya, yathādhammo kāretabbo."
    ],
    "innerText": "Na āpattiyā adassane ukkhittakassa nisinnaparisāya pātimokkhaṃ uddisitabbaṃ. Yo uddiseyya, yathādhammo kāretabbo. Na āpattiyā appaṭikamme ukkhittakassa nisinnaparisāya…pe… na pāpikāya diṭṭhiyā appaṭinissagge ukkhittakassa nisinnaparisāya pātimokkhaṃ uddisitabbaṃ. Yo uddiseyya, yathādhammo kāretabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Na paṇḍakassa nisinnaparisāya pātimokkhaṃ uddisitabbaṃ. Yo uddiseyya, āpatti dukkaṭassa. Na theyyasaṃvāsakassa…pe… ",
      " na titthiyapakkantakassa…pe… na tiracchānagatassa…pe… ",
      " na mātughātakassa…pe… na pitughātakassa…pe… na arahantaghātakassa…pe… na bhikkhunidūsakassa…pe… na saṅghabhedakassa…pe… na lohituppādakassa…pe… na ubhatobyañjanakassa nisinnaparisāya pātimokkhaṃ uddisitabbaṃ. Yo uddiseyya, āpatti dukkaṭassa."
    ],
    "innerText": "Na paṇḍakassa nisinnaparisāya pātimokkhaṃ uddisitabbaṃ. Yo uddiseyya, āpatti dukkaṭassa. Na theyyasaṃvāsakassa…pe… na titthiyapakkantakassa…pe… na tiracchānagatassa…pe… na mātughātakassa…pe… na pitughātakassa…pe… na arahantaghātakassa…pe… na bhikkhunidūsakassa…pe… na saṅghabhedakassa…pe… na lohituppādakassa…pe… na ubhatobyañjanakassa nisinnaparisāya pātimokkhaṃ uddisitabbaṃ. Yo uddiseyya, āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Na, bhikkhave, pārivāsikapārisuddhidānena uposatho kātabbo, aññatra avuṭṭhitāya parisāya. Na ca, bhikkhave, anuposathe uposatho kātabbo, aññatra saṅghasāmaggiyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vajjanīyapuggalasandassanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tatiyabhāṇavāro niṭṭhito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Uposathakkhandhako dutiyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "106. Tassuddānaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Titthiyā bimbisāro ca, sannipatituṃ tuṇhikā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dhammaṃ raho pātimokkhaṃ, devasikaṃ tadā sakiṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Yathāparisā samaggaṃ, sāmaggī maddakucchi ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sīmā mahatī nadiyā, anu dve khuddakāni ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Navā ",
      " rājagahe ceva, sīmā avippavāsanā;"
    ],
    "innerText": "Navā rājagahe ceva, sīmā avippavāsanā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Sammanne ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sammane (ka.)]"
      },
      " paṭhamaṃ sīmaṃ, pacchā sīmaṃ samūhane."
    ],
    "innerText": "Sammanne [sammane (ka.)] paṭhamaṃ sīmaṃ, pacchā sīmaṃ samūhane."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Asammatā ",
      " gāmasīmā, nadiyā samudde sare;"
    ],
    "innerText": "Asammatā gāmasīmā, nadiyā samudde sare;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Udakukkhepo bhindanti, tathevajjhottharanti ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Kati ",
      " kammāni uddeso, savarā asatīpi ca;"
    ],
    "innerText": "Kati kammāni uddeso, savarā asatīpi ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dhammaṃ vinayaṃ tajjenti, puna vinayatajjanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Codanā kate okāse, adhammappaṭikkosanā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Catupañcaparā āvi, sañcicca cepi vāyame."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sagahaṭṭhā anajjhiṭṭhā, codanamhi na jānati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sambahulā na jānanti, sajjukaṃ na ca gacchare."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Katimī kīvatikā dūre, ārocetuñca nassari;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Uklāpaṃ āsanaṃ dīpo, disā añño bahussuto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Sajjukaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sajjuvassaruposatho (ka.)]"
      },
      " vassuposatho, suddhikammañca ñātakā;"
    ],
    "innerText": "Sajjukaṃ [sajjuvassaruposatho (ka.)] vassuposatho, suddhikammañca ñātakā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Gaggo catutayo dveko, āpattisabhāgā sari."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sabbo saṅgho vematiko, na jānanti bahussuto;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bahū samasamā thokā, parisā avuṭṭhitāya ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Ekaccā vuṭṭhitā sabbā, jānanti ca vematikā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kappatevāti kukkuccā, jānaṃ passaṃ suṇanti ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Āvāsikena āgantu, cātupannaraso puna;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pāṭipado pannaraso, liṅgasaṃvāsakā ubho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Pārivāsānuposatho ",
      ", aññatra saṅghasāmaggiyā;"
    ],
    "innerText": "Pārivāsānuposatho , aññatra saṅghasāmaggiyā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ete vibhattā uddānā, vatthuvibhūtakāraṇāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Imasmiṃ khandhake vatthūni chaasīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Uposathakkhandhako niṭṭhito."
  }
]