[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "2. Pārivāsikakkhandhakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Pārivāsikavattaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "75"
      },
      ". Tena ",
      " samayena buddho bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena pārivāsikā bhikkhū sādiyanti pakatattānaṃ bhikkhūnaṃ abhivādanaṃ, paccuṭṭhānaṃ, añjalikammaṃ, sāmīcikammaṃ, āsanābhihāraṃ, seyyābhihāraṃ, pādodakaṃ pādapīṭhaṃ, pādakathalikaṃ, pattacīvarapaṭiggahaṇaṃ, nahāne piṭṭhiparikammaṃ. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma pārivāsikā bhikkhū sādiyissanti pakatattānaṃ bhikkhūnaṃ abhivādanaṃ, paccuṭṭhānaṃ, añjalikammaṃ, sāmīcikammaṃ, āsanābhihāraṃ, seyyābhihāraṃ, pādodakaṃ pādapīṭhaṃ, pādakathalikaṃ, pattacīvarapaṭiggahaṇaṃ, nahāne piṭṭhiparikamma’’nti! Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ."
    ],
    "innerText": "75. Tena samayena buddho bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena pārivāsikā bhikkhū sādiyanti pakatattānaṃ bhikkhūnaṃ abhivādanaṃ, paccuṭṭhānaṃ, añjalikammaṃ, sāmīcikammaṃ, āsanābhihāraṃ, seyyābhihāraṃ, pādodakaṃ pādapīṭhaṃ, pādakathalikaṃ, pattacīvarapaṭiggahaṇaṃ, nahāne piṭṭhiparikammaṃ. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma pārivāsikā bhikkhū sādiyissanti pakatattānaṃ bhikkhūnaṃ abhivādanaṃ, paccuṭṭhānaṃ, añjalikammaṃ, sāmīcikammaṃ, āsanābhihāraṃ, seyyābhihāraṃ, pādodakaṃ pādapīṭhaṃ, pādakathalikaṃ, pattacīvarapaṭiggahaṇaṃ, nahāne piṭṭhiparikamma’’nti! Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe bhikkhusaṅghaṃ sannipātāpetvā bhikkhū paṭipucchi – ‘‘saccaṃ kira, bhikkhave, pārivāsikā bhikkhū sādiyanti pakatattānaṃ bhikkhūnaṃ abhivādanaṃ, paccuṭṭhānaṃ, añjalikammaṃ, sāmīcikammaṃ, āsanābhihāraṃ, seyyābhihāraṃ, pādodakaṃ pādapīṭhaṃ, pādakathalikaṃ, pattacīvarapaṭiggahaṇaṃ, nahāne piṭṭhiparikamma’’nti? ‘‘Saccaṃ bhagavā’’ti. Vigarahi buddho bhagavā – ‘‘ananucchavikaṃ…pe… kathañhi nāma, bhikkhave, pārivāsikā bhikkhū sādiyissanti pakatattānaṃ bhikkhūnaṃ abhivādanaṃ, paccuṭṭhānaṃ, añjalikammaṃ, sāmīcikammaṃ, āsanābhihāraṃ, seyyābhihāraṃ, pādodakaṃ ",
      " pādapīṭhaṃ, pādakathalikaṃ, pattacīvarapaṭiggahaṇaṃ, nahāne piṭṭhiparikammaṃ. Netaṃ, bhikkhave, appasannānaṃ vā pasādāya…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘na, bhikkhave, pārivāsikena bhikkhunā sāditabbaṃ pakatattānaṃ bhikkhūnaṃ abhivādanaṃ, paccuṭṭhānaṃ, añjalikammaṃ ",
      ", sāmīcikammaṃ, āsanābhihāro, seyyābhihāro, pādodakaṃ pādapīṭhaṃ, pādakathalikaṃ, pattacīvarapaṭiggahaṇaṃ, nahāne piṭṭhiparikammaṃ. Yo sādiyeyya, āpatti dukkaṭassa."
    ],
    "innerText": "Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe bhikkhusaṅghaṃ sannipātāpetvā bhikkhū paṭipucchi – ‘‘saccaṃ kira, bhikkhave, pārivāsikā bhikkhū sādiyanti pakatattānaṃ bhikkhūnaṃ abhivādanaṃ, paccuṭṭhānaṃ, añjalikammaṃ, sāmīcikammaṃ, āsanābhihāraṃ, seyyābhihāraṃ, pādodakaṃ pādapīṭhaṃ, pādakathalikaṃ, pattacīvarapaṭiggahaṇaṃ, nahāne piṭṭhiparikamma’’nti? ‘‘Saccaṃ bhagavā’’ti. Vigarahi buddho bhagavā – ‘‘ananucchavikaṃ…pe… kathañhi nāma, bhikkhave, pārivāsikā bhikkhū sādiyissanti pakatattānaṃ bhikkhūnaṃ abhivādanaṃ, paccuṭṭhānaṃ, añjalikammaṃ, sāmīcikammaṃ, āsanābhihāraṃ, seyyābhihāraṃ, pādodakaṃ pādapīṭhaṃ, pādakathalikaṃ, pattacīvarapaṭiggahaṇaṃ, nahāne piṭṭhiparikammaṃ. Netaṃ, bhikkhave, appasannānaṃ vā pasādāya…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘na, bhikkhave, pārivāsikena bhikkhunā sāditabbaṃ pakatattānaṃ bhikkhūnaṃ abhivādanaṃ, paccuṭṭhānaṃ, añjalikammaṃ , sāmīcikammaṃ, āsanābhihāro, seyyābhihāro, pādodakaṃ pādapīṭhaṃ, pādakathalikaṃ, pattacīvarapaṭiggahaṇaṃ, nahāne piṭṭhiparikammaṃ. Yo sādiyeyya, āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Anujānāmi, bhikkhave, pārivāsikānaṃ bhikkhūnaṃ mithu yathāvuḍḍhaṃ abhivādanaṃ, paccuṭṭhānaṃ, añjalikammaṃ, sāmīcikammaṃ, āsanābhihāraṃ, seyyābhihāraṃ, pādodakaṃ pādapīṭhaṃ, pādakathalikaṃ, pattacīvarapaṭiggahaṇaṃ, nahāne piṭṭhiparikammaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Anujānāmi ",
      ", bhikkhave, pārivāsikānaṃ bhikkhūnaṃ pañca yathāvuḍḍhaṃ – uposathaṃ, pavāraṇaṃ, vassikasāṭikaṃ, oṇojanaṃ, bhattaṃ. Tena hi, bhikkhave, pārivāsikānaṃ bhikkhūnaṃ vattaṃ paññapessāmi yathā pārivāsikehi bhikkhūhi vattitabbaṃ ",
      "."
    ],
    "innerText": "‘‘Anujānāmi , bhikkhave, pārivāsikānaṃ bhikkhūnaṃ pañca yathāvuḍḍhaṃ – uposathaṃ, pavāraṇaṃ, vassikasāṭikaṃ, oṇojanaṃ, bhattaṃ. Tena hi, bhikkhave, pārivāsikānaṃ bhikkhūnaṃ vattaṃ paññapessāmi yathā pārivāsikehi bhikkhūhi vattitabbaṃ ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "76"
      },
      ". ‘‘Pārivāsikena, bhikkhave, bhikkhunā sammā vattitabbaṃ. Tatrāyaṃ sammāvattanā –"
    ],
    "innerText": "76. ‘‘Pārivāsikena, bhikkhave, bhikkhunā sammā vattitabbaṃ. Tatrāyaṃ sammāvattanā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Na upasampādetabbaṃ, na nissayo dātabbo, na sāmaṇero upaṭṭhāpetabbo, na bhikkhunovādakasammuti sāditabbā, sammatenapi bhikkhuniyo na ovaditabbā. Yāya āpattiyā saṅghena parivāso dinno hoti sā āpatti na āpajjitabbā, aññā vā ",
      " tādisikā, tato vā pāpiṭṭhatarā; kammaṃ na garahitabbaṃ, kammikā na garahitabbā. Na pakatattassa bhikkhuno uposatho ṭhapetabbo, na pavāraṇā ṭhapetabbā, na savacanīyaṃ kātabbaṃ, na anuvādo paṭṭhapetabbo, na okāso kāretabbo, na codetabbo, na sāretabbo, na bhikkhūhi sampayojetabbaṃ."
    ],
    "innerText": "Na upasampādetabbaṃ, na nissayo dātabbo, na sāmaṇero upaṭṭhāpetabbo, na bhikkhunovādakasammuti sāditabbā, sammatenapi bhikkhuniyo na ovaditabbā. Yāya āpattiyā saṅghena parivāso dinno hoti sā āpatti na āpajjitabbā, aññā vā tādisikā, tato vā pāpiṭṭhatarā; kammaṃ na garahitabbaṃ, kammikā na garahitabbā. Na pakatattassa bhikkhuno uposatho ṭhapetabbo, na pavāraṇā ṭhapetabbā, na savacanīyaṃ kātabbaṃ, na anuvādo paṭṭhapetabbo, na okāso kāretabbo, na codetabbo, na sāretabbo, na bhikkhūhi sampayojetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Na, bhikkhave, pārivāsikena bhikkhunā pakatattassa bhikkhuno purato gantabbaṃ, na purato nisīditabbaṃ. Yo hoti saṅghassa āsanapariyanto seyyāpariyanto vihārapariyanto so tassa padātabbo. Tena ca so sāditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Na, bhikkhave, pārivāsikena bhikkhunā pakatattena bhikkhunā puresamaṇena vā pacchāsamaṇena vā kulāni upasaṅkamitabbāni, na āraññikaṅgaṃ samādātabbaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[samāditabbaṃ (ka.)]"
      },
      ", na piṇḍapātikaṅgaṃ samādātabbaṃ, na ca tappaccayā piṇḍapāto nīharāpetabbo – mā maṃ jāniṃsūti."
    ],
    "innerText": "‘‘Na, bhikkhave, pārivāsikena bhikkhunā pakatattena bhikkhunā puresamaṇena vā pacchāsamaṇena vā kulāni upasaṅkamitabbāni, na āraññikaṅgaṃ samādātabbaṃ [samāditabbaṃ (ka.)], na piṇḍapātikaṅgaṃ samādātabbaṃ, na ca tappaccayā piṇḍapāto nīharāpetabbo – mā maṃ jāniṃsūti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Pārivāsikena ",
      ", bhikkhave, bhikkhunā āgantukena ārocetabbaṃ, āgantukassa ārocetabbaṃ, uposathe ārocetabbaṃ, pavāraṇāya ārocetabbaṃ. Sace gilāno hoti, dūtenapi ārocetabbaṃ."
    ],
    "innerText": "‘‘Pārivāsikena , bhikkhave, bhikkhunā āgantukena ārocetabbaṃ, āgantukassa ārocetabbaṃ, uposathe ārocetabbaṃ, pavāraṇāya ārocetabbaṃ. Sace gilāno hoti, dūtenapi ārocetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Na, bhikkhave, pārivāsikena bhikkhunā sabhikkhukā āvāsā abhikkhuko āvāso gantabbo, aññatra pakatattena, aññatra antarāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Na ",
      ", bhikkhave, pārivāsikena bhikkhunā sabhikkhukā āvāsā abhikkhuko anāvāso gantabbo, aññatra pakatattena, aññatra antarāyā ",
      ". Na, bhikkhave, pārivāsikena bhikkhunā sabhikkhukā āvāsā abhikkhuko āvāso vā anāvāso vā gantabbo, aññatra pakatattena, aññatra antarāyā."
    ],
    "innerText": "‘‘Na , bhikkhave, pārivāsikena bhikkhunā sabhikkhukā āvāsā abhikkhuko anāvāso gantabbo, aññatra pakatattena, aññatra antarāyā . Na, bhikkhave, pārivāsikena bhikkhunā sabhikkhukā āvāsā abhikkhuko āvāso vā anāvāso vā gantabbo, aññatra pakatattena, aññatra antarāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Na, bhikkhave, pārivāsikena bhikkhunā sabhikkhukā anāvāsā abhikkhuko āvāso gantabbo, aññatra pakatattena, aññatra antarāyā. Na, bhikkhave, pārivāsikena bhikkhunā sabhikkhukā anāvāsā abhikkhuko anāvāso gantabbo, aññatra pakatattena, aññatra antarāyā. Na, bhikkhave, pārivāsikena bhikkhunā sabhikkhukā anāvāsā abhikkhuko āvāso vā anāvāso vā gantabbo, aññatra pakatattena, aññatra antarāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Na, bhikkhave, pārivāsikena bhikkhunā sabhikkhukā āvāsā vā anāvāsā vā abhikkhuko āvāso gantabbo, aññatra pakatattena, aññatra antarāyā. Na, bhikkhave, pārivāsikena bhikkhunā sabhikkhukā āvāsā vā anāvāsā vā abhikkhuko anāvāso gantabbo, aññatra pakatattena, aññatra antarāyā. Na, bhikkhave, pārivāsikena bhikkhunā sabhikkhukā āvāsā vā anāvāsā vā abhikkhuko āvāso vā anāvāso vā gantabbo, aññatra pakatattena, aññatra antarāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Na, bhikkhave, pārivāsikena bhikkhunā sabhikkhukā āvāsā sabhikkhuko āvāso gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra pakatattena, aññatra antarāyā. Na, bhikkhave, pārivāsikena bhikkhunā sabhikkhukā āvāsā sabhikkhuko anāvāso gantabbo, yatthassu ",
      " bhikkhū nānāsaṃvāsakā, aññatra pakatattena, aññatra antarāyā. Na, bhikkhave, pārivāsikena ",
      " bhikkhunā sabhikkhukā āvāsā sabhikkhuko āvāso vā anāvāso vā gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra pakatattena, aññatra antarāyā."
    ],
    "innerText": "‘‘Na, bhikkhave, pārivāsikena bhikkhunā sabhikkhukā āvāsā sabhikkhuko āvāso gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra pakatattena, aññatra antarāyā. Na, bhikkhave, pārivāsikena bhikkhunā sabhikkhukā āvāsā sabhikkhuko anāvāso gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra pakatattena, aññatra antarāyā. Na, bhikkhave, pārivāsikena bhikkhunā sabhikkhukā āvāsā sabhikkhuko āvāso vā anāvāso vā gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra pakatattena, aññatra antarāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Na, bhikkhave, pārivāsikena bhikkhunā sabhikkhukā anāvāsā sabhikkhuko āvāso gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra ",
      " pakatattena, aññatra antarāyā. Na, bhikkhave, pārivāsikena bhikkhunā sabhikkhukā anāvāsā sabhikkhuko anāvāso gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra pakatattena, aññatra antarāyā. Na, bhikkhave, pārivāsikena bhikkhunā sabhikkhukā anāvāsā sabhikkhuko āvāso vā anāvāso vā gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra pakatattena ",
      ", aññatra antarāyā."
    ],
    "innerText": "‘‘Na, bhikkhave, pārivāsikena bhikkhunā sabhikkhukā anāvāsā sabhikkhuko āvāso gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra pakatattena, aññatra antarāyā. Na, bhikkhave, pārivāsikena bhikkhunā sabhikkhukā anāvāsā sabhikkhuko anāvāso gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra pakatattena, aññatra antarāyā. Na, bhikkhave, pārivāsikena bhikkhunā sabhikkhukā anāvāsā sabhikkhuko āvāso vā anāvāso vā gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra pakatattena , aññatra antarāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Na, bhikkhave, pārivāsikena bhikkhunā sabhikkhukā āvāsā vā anāvāsā vā sabhikkhuko āvāso gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra pakatattena, aññatra antarāyā. Na, bhikkhave, pārivāsikena bhikkhunā sabhikkhukā āvāsā vā anāvāsā vā sabhikkhuko anāvāso gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra pakatattena, aññatra antarāyā. Na, bhikkhave, pārivāsikena bhikkhunā sabhikkhukā āvāsā vā anāvāsā vā sabhikkhuko āvāso vā anāvāso vā gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra pakatattena, aññatra ",
      " antarāyā."
    ],
    "innerText": "‘‘Na, bhikkhave, pārivāsikena bhikkhunā sabhikkhukā āvāsā vā anāvāsā vā sabhikkhuko āvāso gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra pakatattena, aññatra antarāyā. Na, bhikkhave, pārivāsikena bhikkhunā sabhikkhukā āvāsā vā anāvāsā vā sabhikkhuko anāvāso gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra pakatattena, aññatra antarāyā. Na, bhikkhave, pārivāsikena bhikkhunā sabhikkhukā āvāsā vā anāvāsā vā sabhikkhuko āvāso vā anāvāso vā gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra pakatattena, aññatra antarāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "80"
      },
      ". ‘‘Gantabbo, bhikkhave, pārivāsikena bhikkhunā sabhikkhukā āvāsā sabhikkhuko āvāso, yatthassu bhikkhū samānasaṃvāsakā, yaṃ jaññā sakkomi ajjeva gantunti."
    ],
    "innerText": "80. ‘‘Gantabbo, bhikkhave, pārivāsikena bhikkhunā sabhikkhukā āvāsā sabhikkhuko āvāso, yatthassu bhikkhū samānasaṃvāsakā, yaṃ jaññā sakkomi ajjeva gantunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Gantabbo, bhikkhave, pārivāsikena bhikkhunā sabhikkhukā āvāsā sabhikkhuko anāvāso, yatthassu bhikkhū samānasaṃvāsakā, yaṃ jaññā sakkomi ajjeva gantunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Gantabbo, bhikkhave, pārivāsikena bhikkhunā sabhikkhukā āvāsā sabhikkhuko āvāso vā anāvāso vā, yatthassu bhikkhū samānasaṃvāsakā, yaṃ jaññā sakkomi ajjeva gantunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Gantabbo ",
      ", bhikkhave, pārivāsikena bhikkhunā sabhikkhukā anāvāsā sabhikkhuko āvāso, yatthassu bhikkhū samānasaṃvāsakā, yaṃ jaññā sakkomi ajjeva gantunti."
    ],
    "innerText": "‘‘Gantabbo , bhikkhave, pārivāsikena bhikkhunā sabhikkhukā anāvāsā sabhikkhuko āvāso, yatthassu bhikkhū samānasaṃvāsakā, yaṃ jaññā sakkomi ajjeva gantunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Gantabbo ",
      ", bhikkhave, pārivāsikena bhikkhunā sabhikkhukā anāvāsā sabhikkhuko anāvāso, yatthassu bhikkhū samānasaṃvāsakā, yaṃ jaññā sakkomi ajjeva gantunti."
    ],
    "innerText": "‘‘Gantabbo , bhikkhave, pārivāsikena bhikkhunā sabhikkhukā anāvāsā sabhikkhuko anāvāso, yatthassu bhikkhū samānasaṃvāsakā, yaṃ jaññā sakkomi ajjeva gantunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Gantabbo, bhikkhave, pārivāsikena bhikkhunā sabhikkhukā anāvāsā sabhikkhuko āvāso vā anāvāso vā, yatthassu bhikkhū samānasaṃvāsakā, yaṃ jaññā sakkomi ajjeva gantunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Gantabbo, bhikkhave, pārivāsikena bhikkhunā sabhikkhukā āvāsā vā anāvāsā vā sabhikkhuko āvāso, yatthassu bhikkhū samānasaṃvāsakā, yaṃ jaññā sakkomi ajjeva gantunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Gantabbo, bhikkhave, pārivāsikena bhikkhunā ",
      " sabhikkhukā āvāsā vā anāvāsā vā sabhikkhuko anāvāso, yatthassu bhikkhū samānasaṃvāsakā, yaṃ jaññā sakkomi ajjeva gantunti."
    ],
    "innerText": "‘‘Gantabbo, bhikkhave, pārivāsikena bhikkhunā sabhikkhukā āvāsā vā anāvāsā vā sabhikkhuko anāvāso, yatthassu bhikkhū samānasaṃvāsakā, yaṃ jaññā sakkomi ajjeva gantunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Gantabbo, bhikkhave, pārivāsikena bhikkhunā sabhikkhukā āvāsā vā anāvāsā vā sabhikkhuko āvāso vā anāvāso vā, yatthassu bhikkhū samānasaṃvāsakā, yaṃ jaññā sakkomi ajjeva gantunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "81"
      },
      ". ‘‘Na, bhikkhave, pārivāsikena bhikkhunā pakatattena bhikkhunā saddhiṃ ekacchanne āvāse vatthabbaṃ, na ekacchanne anāvāse vatthabbaṃ, na ekacchanne āvāse vā anāvāse vā vatthabbaṃ. Pakatattaṃ bhikkhuṃ disvā āsanā vuṭṭhātabbaṃ. Pakatatto bhikkhu āsanena nimantetabbo. Na pakatattena bhikkhunā saddhiṃ ekāsane nisīditabbaṃ, na nīce āsane nisinne ucce āsane nisīditabbaṃ, na chamāyaṃ nisinne āsane nisīditabbaṃ; na ekacaṅkame caṅkamitabbaṃ, na nīce caṅkame caṅkamante ucce caṅkame caṅkamitabbaṃ, na chamāyaṃ caṅkamante ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[caṅkamantaṃ (aṭṭhakathāyaṃ saṃvaṇṇetabbapāṭho)]"
      },
      " caṅkame caṅkamitabbaṃ."
    ],
    "innerText": "81. ‘‘Na, bhikkhave, pārivāsikena bhikkhunā pakatattena bhikkhunā saddhiṃ ekacchanne āvāse vatthabbaṃ, na ekacchanne anāvāse vatthabbaṃ, na ekacchanne āvāse vā anāvāse vā vatthabbaṃ. Pakatattaṃ bhikkhuṃ disvā āsanā vuṭṭhātabbaṃ. Pakatatto bhikkhu āsanena nimantetabbo. Na pakatattena bhikkhunā saddhiṃ ekāsane nisīditabbaṃ, na nīce āsane nisinne ucce āsane nisīditabbaṃ, na chamāyaṃ nisinne āsane nisīditabbaṃ; na ekacaṅkame caṅkamitabbaṃ, na nīce caṅkame caṅkamante ucce caṅkame caṅkamitabbaṃ, na chamāyaṃ caṅkamante [caṅkamantaṃ (aṭṭhakathāyaṃ saṃvaṇṇetabbapāṭho)] caṅkame caṅkamitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "82"
      },
      ". ‘‘Na ",
      ", bhikkhave, pārivāsikena bhikkhunā pārivāsikena vuḍḍhatarena bhikkhunā saddhiṃ…pe… mūlāyapaṭikassanārahena bhikkhunā saddhiṃ…pe… mānattārahena bhikkhunā saddhiṃ…pe… mānattacārikena bhikkhunā saddhiṃ…pe… abbhānārahena bhikkhunā saddhiṃ ekacchanne āvāse vatthabbaṃ, na ekacchanne anāvāse vatthabbaṃ, na ekacchanne ",
      " āvāse vā anāvāse vā vatthabbaṃ; na ekāsane nisīditabbaṃ ",
      ", na nīce āsane nisinne ucce āsane nisīditabbaṃ, na chamāyaṃ nisinne āsane nisīditabbaṃ; na ekacaṅkame caṅkamitabbaṃ, na nīce caṅkame caṅkamante ucce caṅkame caṅkamitabbaṃ, na chamāyaṃ caṅkamante caṅkame caṅkamitabbaṃ."
    ],
    "innerText": "82. ‘‘Na , bhikkhave, pārivāsikena bhikkhunā pārivāsikena vuḍḍhatarena bhikkhunā saddhiṃ…pe… mūlāyapaṭikassanārahena bhikkhunā saddhiṃ…pe… mānattārahena bhikkhunā saddhiṃ…pe… mānattacārikena bhikkhunā saddhiṃ…pe… abbhānārahena bhikkhunā saddhiṃ ekacchanne āvāse vatthabbaṃ, na ekacchanne anāvāse vatthabbaṃ, na ekacchanne āvāse vā anāvāse vā vatthabbaṃ; na ekāsane nisīditabbaṃ , na nīce āsane nisinne ucce āsane nisīditabbaṃ, na chamāyaṃ nisinne āsane nisīditabbaṃ; na ekacaṅkame caṅkamitabbaṃ, na nīce caṅkame caṅkamante ucce caṅkame caṅkamitabbaṃ, na chamāyaṃ caṅkamante caṅkame caṅkamitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mahāva. 393]"
      },
      " ‘‘Pārivāsikacatuttho ce, bhikkhave, parivāsaṃ dadeyya, mūlāya paṭikasseyya, mānattaṃ dadeyya, taṃvīso abbheyya, akammaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[akammaṃ taṃ (syā.)]"
      },
      ", na ca karaṇīya’’nti."
    ],
    "innerText": "[mahāva. 393] ‘‘Pārivāsikacatuttho ce, bhikkhave, parivāsaṃ dadeyya, mūlāya paṭikasseyya, mānattaṃ dadeyya, taṃvīso abbheyya, akammaṃ [akammaṃ taṃ (syā.)], na ca karaṇīya’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Catunnavutipārivāsikavattaṃ niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "83"
      },
      ". Atha kho āyasmā upāli yena bhagavā tenupasaṅkami. Upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā upāli bhagavantaṃ etadavoca – ‘‘kati nu kho, bhante, pārivāsikassa bhikkhuno ratticchedā’’ti? ‘‘Tayo kho, upāli, pārivāsikassa bhikkhuno ratticchedā ",
      ". Sahavāso, vippavāso, anārocanā – ime kho, upāli, tayo pārivāsikassa bhikkhuno ratticchedā’’ti."
    ],
    "innerText": "83. Atha kho āyasmā upāli yena bhagavā tenupasaṅkami. Upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā upāli bhagavantaṃ etadavoca – ‘‘kati nu kho, bhante, pārivāsikassa bhikkhuno ratticchedā’’ti? ‘‘Tayo kho, upāli, pārivāsikassa bhikkhuno ratticchedā . Sahavāso, vippavāso, anārocanā – ime kho, upāli, tayo pārivāsikassa bhikkhuno ratticchedā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "84"
      },
      ". Tena kho pana samayena sāvatthiyaṃ mahābhikkhusaṅgho sannipatito hoti. Na sakkonti pārivāsikā bhikkhū parivāsaṃ sodhetuṃ ",
      ". Bhagavato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[te bhikkhū bhagavato (syā., evamuparipi)]"
      },
      " etamatthaṃ ārocesuṃ. ‘‘Anujānāmi, bhikkhave, parivāsaṃ nikkhipituṃ. Evañca pana, bhikkhave, nikkhipitabbo. Tena pārivāsikena bhikkhunā ekaṃ bhikkhuṃ upasaṅkamitvā ekaṃsaṃ uttarāsaṅgaṃ karitvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā evamassa vacanīyo – ‘parivāsaṃ nikkhipāmī’ti. Nikkhitto hoti parivāso. ‘Vattaṃ nikkhipāmī’ti. Nikkhitto hoti parivāso."
    ],
    "innerText": "84. Tena kho pana samayena sāvatthiyaṃ mahābhikkhusaṅgho sannipatito hoti. Na sakkonti pārivāsikā bhikkhū parivāsaṃ sodhetuṃ . Bhagavato [te bhikkhū bhagavato (syā., evamuparipi)] etamatthaṃ ārocesuṃ. ‘‘Anujānāmi, bhikkhave, parivāsaṃ nikkhipituṃ. Evañca pana, bhikkhave, nikkhipitabbo. Tena pārivāsikena bhikkhunā ekaṃ bhikkhuṃ upasaṅkamitvā ekaṃsaṃ uttarāsaṅgaṃ karitvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā evamassa vacanīyo – ‘parivāsaṃ nikkhipāmī’ti. Nikkhitto hoti parivāso. ‘Vattaṃ nikkhipāmī’ti. Nikkhitto hoti parivāso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "85"
      },
      ". Tena kho pana samayena sāvatthiyā bhikkhū tahaṃ tahaṃ pakkamiṃsu. Sakkonti pārivāsikā bhikkhū parivāsaṃ sodhetuṃ. Bhagavato etamatthaṃ ārocesuṃ. ‘‘Anujānāmi, bhikkhave, parivāsaṃ samādiyituṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[samādātuṃ (syā. kaṃ.)]"
      },
      ". Evañca pana, bhikkhave, samādiyitabbo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[samāditabbo (sī. syā. kaṃ.)]"
      },
      ". Tena pārivāsikena bhikkhunā ekaṃ bhikkhuṃ upasaṅkamitvā ",
      " ekaṃsaṃ uttarāsaṅgaṃ karitvā ukkuṭikaṃ nisīditvā ",
      " añjaliṃ paggahetvā evamassa vacanīyo – ‘parivāsaṃ samādiyāmī’ti. Samādinno hoti parivāso. ‘Vattaṃ samādiyāmī’ti. Samādinno hoti parivāso’’."
    ],
    "innerText": "85. Tena kho pana samayena sāvatthiyā bhikkhū tahaṃ tahaṃ pakkamiṃsu. Sakkonti pārivāsikā bhikkhū parivāsaṃ sodhetuṃ. Bhagavato etamatthaṃ ārocesuṃ. ‘‘Anujānāmi, bhikkhave, parivāsaṃ samādiyituṃ [samādātuṃ (syā. kaṃ.)]. Evañca pana, bhikkhave, samādiyitabbo [samāditabbo (sī. syā. kaṃ.)]. Tena pārivāsikena bhikkhunā ekaṃ bhikkhuṃ upasaṅkamitvā ekaṃsaṃ uttarāsaṅgaṃ karitvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā evamassa vacanīyo – ‘parivāsaṃ samādiyāmī’ti. Samādinno hoti parivāso. ‘Vattaṃ samādiyāmī’ti. Samādinno hoti parivāso’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pārivāsikavattaṃ niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Mūlāyapaṭikassanārahavattaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "86"
      },
      ". Tena ",
      " kho pana samayena mūlāyapaṭikassanārahā bhikkhū sādiyanti pakatattānaṃ bhikkhūnaṃ abhivādanaṃ, paccuṭṭhānaṃ, añjalikammaṃ, sāmīcikammaṃ, āsanābhihāraṃ, seyyābhihāraṃ, pādodakaṃ pādapīṭhaṃ, pādakathalikaṃ, pattacīvarapaṭiggahaṇaṃ, nahāne piṭṭhiparikammaṃ. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma mūlāyapaṭikassanārahā bhikkhū sādiyissanti pakatattānaṃ bhikkhūnaṃ abhivādanaṃ, paccuṭṭhānaṃ…pe… nahāne piṭṭhiparikamma’’nti. Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ."
    ],
    "innerText": "86. Tena kho pana samayena mūlāyapaṭikassanārahā bhikkhū sādiyanti pakatattānaṃ bhikkhūnaṃ abhivādanaṃ, paccuṭṭhānaṃ, añjalikammaṃ, sāmīcikammaṃ, āsanābhihāraṃ, seyyābhihāraṃ, pādodakaṃ pādapīṭhaṃ, pādakathalikaṃ, pattacīvarapaṭiggahaṇaṃ, nahāne piṭṭhiparikammaṃ. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma mūlāyapaṭikassanārahā bhikkhū sādiyissanti pakatattānaṃ bhikkhūnaṃ abhivādanaṃ, paccuṭṭhānaṃ…pe… nahāne piṭṭhiparikamma’’nti. Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe bhikkhusaṅghaṃ sannipātāpetvā bhikkhū paṭipucchi – ‘‘saccaṃ kira, bhikkhave, mūlāyapaṭikassanārahā bhikkhū sādiyanti pakatattānaṃ bhikkhūnaṃ abhivādanaṃ, paccuṭṭhānaṃ…pe… nahāne piṭṭhiparikamma’’nti? ‘‘Saccaṃ bhagavā’’ti. Vigarahi buddho bhagavā – ‘‘ananucchavikaṃ…pe… kathañhi nāma, bhikkhave, mūlāyapaṭikassanārahā bhikkhū sādiyissanti pakatattānaṃ bhikkhūnaṃ abhivādanaṃ, paccuṭṭhānaṃ…pe… nahāne piṭṭhiparikammaṃ! Netaṃ bhikkhave, appasannānaṃ vā pasādāya…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘na, bhikkhave, mūlāyapaṭikassanārahena bhikkhunā sāditabbaṃ pakatattānaṃ bhikkhūnaṃ abhivādanaṃ, paccuṭṭhānaṃ, añjalikammaṃ, sāmīcikammaṃ, āsanābhihāro, seyyābhihāro, pādodakaṃ pādapīṭhaṃ, pādakathalikaṃ, pattacīvarapaṭiggahaṇaṃ, nahāne piṭṭhiparikammaṃ. Yo sādiyeyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, mūlāyapaṭikassanārahānaṃ ",
      " bhikkhūnaṃ mithu yathāvuḍḍhaṃ abhivādanaṃ, paccuṭṭhānaṃ…pe… nahāne piṭṭhiparikammaṃ. Anujānāmi, bhikkhave, mūlāyapaṭikassanārahānaṃ bhikkhūnaṃ pañca yathāvuḍḍhaṃ – uposathaṃ ",
      ", pavāraṇaṃ, vassikasāṭikaṃ, oṇojanaṃ, bhattaṃ. Tena hi, bhikkhave, mūlāyapaṭikassanārahānaṃ bhikkhūnaṃ vattaṃ paññāpessāmi yathā mūlāyapaṭikassanārahehi bhikkhūhi vattitabbaṃ."
    ],
    "innerText": "Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe bhikkhusaṅghaṃ sannipātāpetvā bhikkhū paṭipucchi – ‘‘saccaṃ kira, bhikkhave, mūlāyapaṭikassanārahā bhikkhū sādiyanti pakatattānaṃ bhikkhūnaṃ abhivādanaṃ, paccuṭṭhānaṃ…pe… nahāne piṭṭhiparikamma’’nti? ‘‘Saccaṃ bhagavā’’ti. Vigarahi buddho bhagavā – ‘‘ananucchavikaṃ…pe… kathañhi nāma, bhikkhave, mūlāyapaṭikassanārahā bhikkhū sādiyissanti pakatattānaṃ bhikkhūnaṃ abhivādanaṃ, paccuṭṭhānaṃ…pe… nahāne piṭṭhiparikammaṃ! Netaṃ bhikkhave, appasannānaṃ vā pasādāya…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘na, bhikkhave, mūlāyapaṭikassanārahena bhikkhunā sāditabbaṃ pakatattānaṃ bhikkhūnaṃ abhivādanaṃ, paccuṭṭhānaṃ, añjalikammaṃ, sāmīcikammaṃ, āsanābhihāro, seyyābhihāro, pādodakaṃ pādapīṭhaṃ, pādakathalikaṃ, pattacīvarapaṭiggahaṇaṃ, nahāne piṭṭhiparikammaṃ. Yo sādiyeyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, mūlāyapaṭikassanārahānaṃ bhikkhūnaṃ mithu yathāvuḍḍhaṃ abhivādanaṃ, paccuṭṭhānaṃ…pe… nahāne piṭṭhiparikammaṃ. Anujānāmi, bhikkhave, mūlāyapaṭikassanārahānaṃ bhikkhūnaṃ pañca yathāvuḍḍhaṃ – uposathaṃ , pavāraṇaṃ, vassikasāṭikaṃ, oṇojanaṃ, bhattaṃ. Tena hi, bhikkhave, mūlāyapaṭikassanārahānaṃ bhikkhūnaṃ vattaṃ paññāpessāmi yathā mūlāyapaṭikassanārahehi bhikkhūhi vattitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "87"
      },
      ". ‘‘Mūlāyapaṭikassanārahena ",
      ", bhikkhave, bhikkhunā sammā vattitabbaṃ. Tatrāyaṃ sammāvattanā –"
    ],
    "innerText": "87. ‘‘Mūlāyapaṭikassanārahena , bhikkhave, bhikkhunā sammā vattitabbaṃ. Tatrāyaṃ sammāvattanā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Na upasampādetabbaṃ, na nissayo dātabbo, na sāmaṇero upaṭṭhāpetabbo, na bhikkhunovādakasammuti sāditabbā, sammatenapi bhikkhuniyo na ovaditabbā. Yāya āpattiyā saṅghena mūlāya paṭikassanāraho kato hoti sā āpatti na āpajjitabbā, aññā vā tādisikā, tato vā pāpiṭṭhatarā; kammaṃ na garahitabbaṃ, kammikā na garahitabbā. Na pakatattassa bhikkhuno uposatho ṭhapetabbo, na pavāraṇā ṭhapetabbā, na savacanīyaṃ kātabbaṃ, na anuvādo paṭṭhapetabbo, na okāso kāretabbo, na codetabbo, na sāretabbo, na bhikkhūhi sampayojetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Na, bhikkhave, mūlāyapaṭikassanārahena bhikkhunā pakatattassa bhikkhuno purato gantabbaṃ, na purato nisīditabbaṃ. Yo hoti saṅghassa āsanapariyanto seyyāpariyanto vihārapariyanto so tassa padātabbo. Tena ca so sāditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Na, bhikkhave, mūlāyapaṭikassanārahena bhikkhunā pakatattena bhikkhunā puresamaṇena vā ",
      " pacchāsamaṇena vā kulāni upasaṅkamitabbāni, na āraññikaṅgaṃ samādātabbaṃ, na piṇḍapātikaṅgaṃ samādātabbaṃ, na ca tappaccayā piṇḍapāto nīharāpetabbo – mā maṃ jāniṃsūti."
    ],
    "innerText": "‘‘Na, bhikkhave, mūlāyapaṭikassanārahena bhikkhunā pakatattena bhikkhunā puresamaṇena vā pacchāsamaṇena vā kulāni upasaṅkamitabbāni, na āraññikaṅgaṃ samādātabbaṃ, na piṇḍapātikaṅgaṃ samādātabbaṃ, na ca tappaccayā piṇḍapāto nīharāpetabbo – mā maṃ jāniṃsūti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Na, bhikkhave, mūlāyapaṭikassanārahena bhikkhunā sabhikkhukā āvāsā abhikkhuko āvāso gantabbo, aññatra pakatattena, aññatra antarāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Na, bhikkhave, mūlāyapaṭikassanārahena bhikkhunā sabhikkhukā āvāsā abhikkhuko anāvāso gantabbo, aññatra pakatattena, aññatra antarāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Na ",
      ", bhikkhave, mūlāyapaṭikassanārahena bhikkhunā sabhikkhukā āvāsā abhikkhuko āvāso vā anāvāso vā gantabbo, aññatra pakatattena, aññatra antarāyā."
    ],
    "innerText": "‘‘Na , bhikkhave, mūlāyapaṭikassanārahena bhikkhunā sabhikkhukā āvāsā abhikkhuko āvāso vā anāvāso vā gantabbo, aññatra pakatattena, aññatra antarāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Na, bhikkhave, mūlāyapaṭikassanārahena bhikkhunā sabhikkhukā anāvāsā abhikkhuko āvāso ",
      " gantabbo…pe… abhikkhuko anāvāso gantabbo…pe… abhikkhuko āvāso vā anāvāso vā gantabbo, aññatra pakatattena, aññatra antarāyā."
    ],
    "innerText": "‘‘Na, bhikkhave, mūlāyapaṭikassanārahena bhikkhunā sabhikkhukā anāvāsā abhikkhuko āvāso gantabbo…pe… abhikkhuko anāvāso gantabbo…pe… abhikkhuko āvāso vā anāvāso vā gantabbo, aññatra pakatattena, aññatra antarāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Na, bhikkhave, mūlāyapaṭikassanārahena bhikkhunā sabhikkhukā āvāsā vā anāvāsā vā abhikkhuko āvāso gantabbo…pe… abhikkhuko anāvāso gantabbo…pe… abhikkhuko āvāso vā anāvāso vā gantabbo, aññatra pakatattena ",
      ", aññatra antarāyā."
    ],
    "innerText": "‘‘Na, bhikkhave, mūlāyapaṭikassanārahena bhikkhunā sabhikkhukā āvāsā vā anāvāsā vā abhikkhuko āvāso gantabbo…pe… abhikkhuko anāvāso gantabbo…pe… abhikkhuko āvāso vā anāvāso vā gantabbo, aññatra pakatattena , aññatra antarāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Na, bhikkhave, mūlāyapaṭikassanārahena bhikkhunā sabhikkhukā āvāsā sabhikkhuko āvāso gantabbo…pe… sabhikkhuko anāvāso gantabbo…pe… sabhikkhuko āvāso vā anāvāso vā gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra pakatattena, aññatra antarāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Na, bhikkhave, mūlāyapaṭikassanārahena bhikkhunā sabhikkhukā anāvāsā sabhikkhuko āvāso gantabbo…pe… sabhikkhuko anāvāso gantabbo…pe… sabhikkhuko āvāso vā anāvāso vā gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra pakatattena, aññatra antarāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Na, bhikkhave, mūlāyapaṭikassanārahena bhikkhunā sabhikkhukā āvāsā vā anāvāsā vā sabhikkhuko āvāso gantabbo…pe… sabhikkhuko anāvāso gantabbo…pe… sabhikkhuko āvāso vā anāvāso vā gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra pakatattena, aññatra antarāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Gantabbo, bhikkhave, mūlāyapaṭikassanārahena bhikkhunā sabhikkhukā āvāsā sabhikkhuko āvāso…pe… sabhikkhuko anāvāso…pe… sabhikkhuko āvāso vā anāvāso vā, yatthassu bhikkhū samānasaṃvāsakā, yaṃ jaññā sakkomi ajjeva gantunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Gantabbo ",
      ", bhikkhave ",
      ", mūlāyapaṭikassanārahena bhikkhunā sabhikkhukā anāvāsā sabhikkhuko āvāso…pe… sabhikkhuko anāvāso…pe… sabhikkhuko āvāso vā anāvāso vā, yatthassu bhikkhū samānasaṃvāsakā, yaṃ jaññā sakkomi ajjeva gantunti."
    ],
    "innerText": "‘‘Gantabbo , bhikkhave , mūlāyapaṭikassanārahena bhikkhunā sabhikkhukā anāvāsā sabhikkhuko āvāso…pe… sabhikkhuko anāvāso…pe… sabhikkhuko āvāso vā anāvāso vā, yatthassu bhikkhū samānasaṃvāsakā, yaṃ jaññā sakkomi ajjeva gantunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Gantabbo ",
      ", bhikkhave, mūlāyapaṭikassanārahena bhikkhunā sabhikkhukā āvāsā vā anāvāsā vā sabhikkhuko āvāso…pe… sabhikkhuko anāvāso…pe… sabhikkhuko āvāso vā anāvāso vā, yatthassu bhikkhū samānasaṃvāsakā, yaṃ jaññā sakkomi ajjeva gantunti."
    ],
    "innerText": "‘‘Gantabbo , bhikkhave, mūlāyapaṭikassanārahena bhikkhunā sabhikkhukā āvāsā vā anāvāsā vā sabhikkhuko āvāso…pe… sabhikkhuko anāvāso…pe… sabhikkhuko āvāso vā anāvāso vā, yatthassu bhikkhū samānasaṃvāsakā, yaṃ jaññā sakkomi ajjeva gantunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Na, bhikkhave, mūlāyapaṭikassanārahena bhikkhunā pakatattena bhikkhunā saddhiṃ ekacchanne āvāse vatthabbaṃ, na ekacchanne anāvāse vatthabbaṃ, na ekacchanne āvāse vā anāvāse vā vatthabbaṃ; pakatattaṃ bhikkhuṃ disvā āsanā vuṭṭhātabbaṃ, pakatatto bhikkhu āsanena nimantetabbo; na pakatattena bhikkhunā saddhiṃ ekāsane nisīditabbaṃ; na nīce āsane nisinne ucce āsane nisīditabbaṃ; na chamāyaṃ nisinne āsane nisīditabbaṃ; na ekacaṅkame caṅkamitabbaṃ, na nīce caṅkame caṅkamante ucce caṅkame caṅkamitabbaṃ, na chamāyaṃ caṅkamante caṅkame ",
      " caṅkamitabbaṃ."
    ],
    "innerText": "‘‘Na, bhikkhave, mūlāyapaṭikassanārahena bhikkhunā pakatattena bhikkhunā saddhiṃ ekacchanne āvāse vatthabbaṃ, na ekacchanne anāvāse vatthabbaṃ, na ekacchanne āvāse vā anāvāse vā vatthabbaṃ; pakatattaṃ bhikkhuṃ disvā āsanā vuṭṭhātabbaṃ, pakatatto bhikkhu āsanena nimantetabbo; na pakatattena bhikkhunā saddhiṃ ekāsane nisīditabbaṃ; na nīce āsane nisinne ucce āsane nisīditabbaṃ; na chamāyaṃ nisinne āsane nisīditabbaṃ; na ekacaṅkame caṅkamitabbaṃ, na nīce caṅkame caṅkamante ucce caṅkame caṅkamitabbaṃ, na chamāyaṃ caṅkamante caṅkame caṅkamitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Na, bhikkhave, mūlāyapaṭikassanārahena bhikkhunā pārivāsikena bhikkhunā saddhiṃ…pe… mūlāyapaṭikassanārahena vuḍḍhatarena bhikkhunā saddhiṃ…pe… mānattārahena bhikkhunā saddhiṃ…pe… mānattacārikena bhikkhunā ",
      " saddhiṃ…pe… abbhānārahena bhikkhunā saddhiṃ ekacchanne āvāse vatthabbaṃ, na ekacchanne anāvāse vatthabbaṃ, na ekacchanne āvāse vā anāvāse vā vatthabbaṃ; na ekāsane nisīditabbaṃ; na nīce āsane nisinne ucce āsane nisīditabbaṃ, na chamāyaṃ nisinne āsane nisīditabbaṃ; na ekacaṅkame caṅkamitabbaṃ, na nīce caṅkame caṅkamante ucce caṅkame caṅkamitabbaṃ, na chamāyaṃ caṅkamante caṅkame caṅkamitabbaṃ."
    ],
    "innerText": "‘‘Na, bhikkhave, mūlāyapaṭikassanārahena bhikkhunā pārivāsikena bhikkhunā saddhiṃ…pe… mūlāyapaṭikassanārahena vuḍḍhatarena bhikkhunā saddhiṃ…pe… mānattārahena bhikkhunā saddhiṃ…pe… mānattacārikena bhikkhunā saddhiṃ…pe… abbhānārahena bhikkhunā saddhiṃ ekacchanne āvāse vatthabbaṃ, na ekacchanne anāvāse vatthabbaṃ, na ekacchanne āvāse vā anāvāse vā vatthabbaṃ; na ekāsane nisīditabbaṃ; na nīce āsane nisinne ucce āsane nisīditabbaṃ, na chamāyaṃ nisinne āsane nisīditabbaṃ; na ekacaṅkame caṅkamitabbaṃ, na nīce caṅkame caṅkamante ucce caṅkame caṅkamitabbaṃ, na chamāyaṃ caṅkamante caṅkame caṅkamitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mahāva. 393]"
      },
      " ‘‘Mūlāyapaṭikassanārahacatuttho ce, bhikkhave, parivāsaṃ dadeyya, mūlāya paṭikasseyya, mānattaṃ dadeyya, taṃvīso abbheyya, akammaṃ, na ca karaṇīya’’nti."
    ],
    "innerText": "[mahāva. 393] ‘‘Mūlāyapaṭikassanārahacatuttho ce, bhikkhave, parivāsaṃ dadeyya, mūlāya paṭikasseyya, mānattaṃ dadeyya, taṃvīso abbheyya, akammaṃ, na ca karaṇīya’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Mūlāyapaṭikassanārahavattaṃ niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Mānattārahavattaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "88"
      },
      ". Tena ",
      " kho pana samayena mānattārahā bhikkhū sādiyanti pakatattānaṃ bhikkhūnaṃ abhivādanaṃ, paccuṭṭhānaṃ, añjalikammaṃ, sāmīcikammaṃ, āsanābhihāraṃ, seyyābhihāraṃ, pādodakaṃ pādapīṭhaṃ, pādakathalikaṃ, pattacīvarapaṭiggahaṇaṃ, nahāne piṭṭhiparikammaṃ. Ye te bhikkhū appicchā ",
      " …pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma mānattārahā bhikkhū sādiyissanti pakatattānaṃ bhikkhūnaṃ abhivādanaṃ, paccuṭṭhānaṃ, añjalikammaṃ, sāmīcikammaṃ, āsanābhihāraṃ, seyyābhihāraṃ, pādodakaṃ pādapīṭhaṃ, pādakathalikaṃ, pattacīvarapaṭiggahaṇaṃ, nahāne piṭṭhiparikamma’’nti! Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… ‘‘saccaṃ kira, bhikkhave, mānattārahā bhikkhū sādiyanti pakatattānaṃ bhikkhūnaṃ abhivādanaṃ, paccuṭṭhānaṃ…pe… nahāne piṭṭhiparikamma’’nti? ‘‘Saccaṃ bhagavā’’ti. Vigarahi buddho bhagavā – ‘‘ananucchavikaṃ…pe… kathañhi nāma, bhikkhave, mānattārahā ",
      " bhikkhū sādiyissanti pakatattānaṃ bhikkhūnaṃ abhivādanaṃ…pe… nahāne piṭṭhiparikammaṃ! Netaṃ, bhikkhave, appasannānaṃ vā pasādāya…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘na, bhikkhave, mānattārahena bhikkhunā sāditabbaṃ pakatattānaṃ bhikkhūnaṃ abhivādanaṃ, paccuṭṭhānaṃ…pe… nahāne piṭṭhiparikammaṃ. Yo sādiyeyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, mānattārahānaṃ bhikkhūnaṃ mithu yathāvuḍḍhaṃ abhivādanaṃ, paccuṭṭhānaṃ…pe… nahāne piṭṭhiparikammaṃ. Anujānāmi, bhikkhave, mānattārahānaṃ bhikkhūnaṃ pañca yathāvuḍḍhaṃ – uposathaṃ, pavāraṇaṃ, vassikasāṭikaṃ, oṇojanaṃ, bhattaṃ. Tena hi, bhikkhave, mānattārahānaṃ bhikkhūnaṃ vattaṃ paññāpessāmi yathā mānattārahehi bhikkhūhi vattitabbaṃ."
    ],
    "innerText": "88. Tena kho pana samayena mānattārahā bhikkhū sādiyanti pakatattānaṃ bhikkhūnaṃ abhivādanaṃ, paccuṭṭhānaṃ, añjalikammaṃ, sāmīcikammaṃ, āsanābhihāraṃ, seyyābhihāraṃ, pādodakaṃ pādapīṭhaṃ, pādakathalikaṃ, pattacīvarapaṭiggahaṇaṃ, nahāne piṭṭhiparikammaṃ. Ye te bhikkhū appicchā …pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma mānattārahā bhikkhū sādiyissanti pakatattānaṃ bhikkhūnaṃ abhivādanaṃ, paccuṭṭhānaṃ, añjalikammaṃ, sāmīcikammaṃ, āsanābhihāraṃ, seyyābhihāraṃ, pādodakaṃ pādapīṭhaṃ, pādakathalikaṃ, pattacīvarapaṭiggahaṇaṃ, nahāne piṭṭhiparikamma’’nti! Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… ‘‘saccaṃ kira, bhikkhave, mānattārahā bhikkhū sādiyanti pakatattānaṃ bhikkhūnaṃ abhivādanaṃ, paccuṭṭhānaṃ…pe… nahāne piṭṭhiparikamma’’nti? ‘‘Saccaṃ bhagavā’’ti. Vigarahi buddho bhagavā – ‘‘ananucchavikaṃ…pe… kathañhi nāma, bhikkhave, mānattārahā bhikkhū sādiyissanti pakatattānaṃ bhikkhūnaṃ abhivādanaṃ…pe… nahāne piṭṭhiparikammaṃ! Netaṃ, bhikkhave, appasannānaṃ vā pasādāya…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘na, bhikkhave, mānattārahena bhikkhunā sāditabbaṃ pakatattānaṃ bhikkhūnaṃ abhivādanaṃ, paccuṭṭhānaṃ…pe… nahāne piṭṭhiparikammaṃ. Yo sādiyeyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, mānattārahānaṃ bhikkhūnaṃ mithu yathāvuḍḍhaṃ abhivādanaṃ, paccuṭṭhānaṃ…pe… nahāne piṭṭhiparikammaṃ. Anujānāmi, bhikkhave, mānattārahānaṃ bhikkhūnaṃ pañca yathāvuḍḍhaṃ – uposathaṃ, pavāraṇaṃ, vassikasāṭikaṃ, oṇojanaṃ, bhattaṃ. Tena hi, bhikkhave, mānattārahānaṃ bhikkhūnaṃ vattaṃ paññāpessāmi yathā mānattārahehi bhikkhūhi vattitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "89"
      },
      ". ‘‘Mānattārahena, bhikkhave, bhikkhunā sammā vattitabbaṃ. Tatrāyaṃ sammāvattanā –"
    ],
    "innerText": "89. ‘‘Mānattārahena, bhikkhave, bhikkhunā sammā vattitabbaṃ. Tatrāyaṃ sammāvattanā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Na upasampādetabbaṃ…pe… (yathā mūlāya paṭikassanā, tathā vitthāretabbaṃ.) Na bhikkhūhi ",
      " sampayojetabbaṃ."
    ],
    "innerText": "Na upasampādetabbaṃ…pe… (yathā mūlāya paṭikassanā, tathā vitthāretabbaṃ.) Na bhikkhūhi sampayojetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Na, bhikkhave, mānattārahena bhikkhunā pakatattassa bhikkhuno purato gantabbaṃ, na purato nisīditabbaṃ. Yo hoti saṅghassa āsanapariyanto seyyāpariyanto vihārapariyanto so tassa padātabbo. Tena ca so sāditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Na ",
      ", bhikkhave, mānattārahena bhikkhunā pakatattena bhikkhunā puresamaṇena vā pacchāsamaṇena vā kulāni upasaṅkamitabbāni, na āraññikaṅgaṃ samādātabbaṃ, na piṇḍapātikaṅgaṃ samādātabbaṃ, na ca tappaccayā piṇḍapāto nīharāpetabbo – mā maṃ jāniṃsūti."
    ],
    "innerText": "‘‘Na , bhikkhave, mānattārahena bhikkhunā pakatattena bhikkhunā puresamaṇena vā pacchāsamaṇena vā kulāni upasaṅkamitabbāni, na āraññikaṅgaṃ samādātabbaṃ, na piṇḍapātikaṅgaṃ samādātabbaṃ, na ca tappaccayā piṇḍapāto nīharāpetabbo – mā maṃ jāniṃsūti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Na, bhikkhave, mānattārahena bhikkhunā sabhikkhukā āvāsā abhikkhuko āvāso gantabbo, aññatra pakatattena, aññatra antarāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Na, bhikkhave, manattārahena bhikkhunā sabhikkhukā āvāsā abhikkhuko anāvāso gantabbo, aññatra pakatattena, aññatra antarāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Na, bhikkhave, mānattārahena bhikkhunā sabhikkhukā āvāsā abhikkhuko ",
      " āvāso vā anāvāso vā gantabbo, aññatra pakatattena, aññatra antarāyā."
    ],
    "innerText": "‘‘Na, bhikkhave, mānattārahena bhikkhunā sabhikkhukā āvāsā abhikkhuko āvāso vā anāvāso vā gantabbo, aññatra pakatattena, aññatra antarāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Na, bhikkhave, mānattārahena bhikkhunā sabhikkhukā anāvāsā abhikkhuko āvāso gantabbo…pe… abhikkhuko anāvāso gantabbo…pe… abhikkhuko āvāso vā anāvāso vā gantabbo, aññatra pakatattena, aññatra antarāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Na, bhikkhave, mānattārahena bhikkhunā sabhikkhukā āvāsā vā anāvāsā vā abhikkhuko āvāso gantabbo…pe… abhikkhuko anāvāso gantabbo…pe… abhikkhuko āvāso vā anāvāso vā gantabbo, aññatra pakatattena, aññatra antarāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Na, bhikkhave, mānattārahena bhikkhunā sabhikkhukā āvāsā sabhikkhuko āvāso gantabbo…pe… sabhikkhuko anāvāso gantabbo…pe… sabhikkhuko āvāso vā anāvāso vā gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra pakatattena, aññatra antarāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Na, bhikkhave, mānattārahena bhikkhunā sabhikkhukā anāvāsā sabhikkhuko āvāso gantabbo…pe… sabhikkhuko anāvāso gantabbo ",
      " …pe… sabhikkhuko ",
      " āvāso vā anāvāso vā gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra pakatattena, aññatra antarāyā."
    ],
    "innerText": "‘‘Na, bhikkhave, mānattārahena bhikkhunā sabhikkhukā anāvāsā sabhikkhuko āvāso gantabbo…pe… sabhikkhuko anāvāso gantabbo …pe… sabhikkhuko āvāso vā anāvāso vā gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra pakatattena, aññatra antarāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Na, bhikkhave, mānattārahena bhikkhunā sabhikkhukā āvāsā vā anāvāsā vā sabhikkhuko āvāso gantabbo…pe… sabhikkhuko anāvāso gantabbo…pe… sabhikkhuko āvāso vā anāvāso vā gantabbo, yatthassu bhikkhū ",
      " nānāsaṃvāsakā, aññatra pakatattena, aññatra antarāyā."
    ],
    "innerText": "‘‘Na, bhikkhave, mānattārahena bhikkhunā sabhikkhukā āvāsā vā anāvāsā vā sabhikkhuko āvāso gantabbo…pe… sabhikkhuko anāvāso gantabbo…pe… sabhikkhuko āvāso vā anāvāso vā gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra pakatattena, aññatra antarāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Gantabbo, bhikkhave, mānattārahena bhikkhunā sabhikkhukā āvāsā sabhikkhuko āvāso…pe… sabhikkhuko anāvāso…pe… sabhikkhuko āvāso vā anāvāso vā, yatthassu bhikkhū samānasaṃvāsakā, yaṃ jaññā sakkomi ajjeva gantunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Gantabbo, bhikkhave, mānattārahena bhikkhunā sabhikkhukā anāvāsā sabhikkhuko āvāso…pe… sabhikkhuko anāvāso…pe… sabhikkhuko āvāso vā anāvāso vā, yatthassu bhikkhū samānasaṃvāsakā, yaṃ jaññā sakkomi ajjeva gantunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Gantabbo, bhikkhave, mānattārahena bhikkhunā sabhikkhukā āvāsā vā anāvāsā vā sabhikkhuko āvāso…pe… sabhikkhuko anāvāso…pe… sabhikkhuko āvāso vā anāvāso vā, yatthassu bhikkhū samānasaṃvāsakā, yaṃ jaññā sakkomi ajjeva gantunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Na, bhikkhave, mānattārahena bhikkhunā pakatattena bhikkhunā saddhiṃ ekacchanne āvāse vatthabbaṃ, na ekacchanne anāvāse vatthabbaṃ, na ekacchanne āvāse vā anāvāse vā vatthabbaṃ. Pakatattaṃ bhikkhuṃ disvā āsanā vuṭṭhātabbaṃ. Pakatatto bhikkhu āsanena nimantetabbo. Na pakatattena bhikkhunā saddhiṃ ekāsane nisīditabbaṃ, na nīce āsane nisinne ucce āsane nisīditabbaṃ, na chamāyaṃ nisinne āsane nisīditabbaṃ; na ekacaṅkame caṅkamitabbaṃ, na ",
      " nīce caṅkame caṅkamante ucce caṅkame caṅkamitabbaṃ, na chamāyaṃ caṅkamante caṅkame caṅkamitabbaṃ."
    ],
    "innerText": "‘‘Na, bhikkhave, mānattārahena bhikkhunā pakatattena bhikkhunā saddhiṃ ekacchanne āvāse vatthabbaṃ, na ekacchanne anāvāse vatthabbaṃ, na ekacchanne āvāse vā anāvāse vā vatthabbaṃ. Pakatattaṃ bhikkhuṃ disvā āsanā vuṭṭhātabbaṃ. Pakatatto bhikkhu āsanena nimantetabbo. Na pakatattena bhikkhunā saddhiṃ ekāsane nisīditabbaṃ, na nīce āsane nisinne ucce āsane nisīditabbaṃ, na chamāyaṃ nisinne āsane nisīditabbaṃ; na ekacaṅkame caṅkamitabbaṃ, na nīce caṅkame caṅkamante ucce caṅkame caṅkamitabbaṃ, na chamāyaṃ caṅkamante caṅkame caṅkamitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Na ",
      ", bhikkhave, mānattārahena bhikkhunā pārivāsikena bhikkhunā saddhiṃ…pe… mūlāyapaṭikassanārahena bhikkhunā saddhiṃ…pe… mānattārahena vuḍḍhatarena bhikkhunā saddhiṃ…pe… mānattacārikena bhikkhunā saddhiṃ…pe… abbhānārahena bhikkhunā saddhiṃ ekacchanne āvāse vatthabbaṃ, na ekacchanne anāvāse vatthabbaṃ, na ekacchanne āvāse vā anāvāse vā vatthabbaṃ; na ekāsane nisīditabbaṃ, na nīce āsane nisinne ucce āsane nisīditabbaṃ, na chamāyaṃ nisinne āsane nisīditabbaṃ; na ekacaṅkame caṅkamitabbaṃ, na nīce caṅkame caṅkamante ucce caṅkame caṅkamitabbaṃ, na chamāyaṃ caṅkamante caṅkame caṅkamitabbaṃ."
    ],
    "innerText": "‘‘Na , bhikkhave, mānattārahena bhikkhunā pārivāsikena bhikkhunā saddhiṃ…pe… mūlāyapaṭikassanārahena bhikkhunā saddhiṃ…pe… mānattārahena vuḍḍhatarena bhikkhunā saddhiṃ…pe… mānattacārikena bhikkhunā saddhiṃ…pe… abbhānārahena bhikkhunā saddhiṃ ekacchanne āvāse vatthabbaṃ, na ekacchanne anāvāse vatthabbaṃ, na ekacchanne āvāse vā anāvāse vā vatthabbaṃ; na ekāsane nisīditabbaṃ, na nīce āsane nisinne ucce āsane nisīditabbaṃ, na chamāyaṃ nisinne āsane nisīditabbaṃ; na ekacaṅkame caṅkamitabbaṃ, na nīce caṅkame caṅkamante ucce caṅkame caṅkamitabbaṃ, na chamāyaṃ caṅkamante caṅkame caṅkamitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mahāva. 393]"
      },
      " ‘‘Mānattārahacatuttho ",
      " ce, bhikkhave, parivāsaṃ dadeyya, mūlāya paṭikasseyya, mānattaṃ dadeyya, taṃvīso abbheyya, akammaṃ, na ca karaṇīya’’nti."
    ],
    "innerText": "[mahāva. 393] ‘‘Mānattārahacatuttho ce, bhikkhave, parivāsaṃ dadeyya, mūlāya paṭikasseyya, mānattaṃ dadeyya, taṃvīso abbheyya, akammaṃ, na ca karaṇīya’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Mānattārahavattaṃ niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Mānattacārikavattaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "90"
      },
      ". Tena kho pana samayena mānattacārikā bhikkhū sādiyanti pakatattānaṃ bhikkhūnaṃ abhivādanaṃ, paccuṭṭhānaṃ, añjalikammaṃ, sāmīcikammaṃ, āsanābhihāraṃ, seyyābhihāraṃ, pādodakaṃ pādapīṭhaṃ, pādakathalikaṃ, pattacīvarapaṭiggahaṇaṃ, nahāne piṭṭhiparikammaṃ. Ye te bhikkhū appicchā…pe… ",
      " te ujhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma mānattacārikā bhikkhū sādiyissanti pakatattānaṃ bhikkhūnaṃ abhivādanaṃ, paccuṭṭhānaṃ…pe… nahāne piṭṭhiparikamma’’nti! Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ."
    ],
    "innerText": "90. Tena kho pana samayena mānattacārikā bhikkhū sādiyanti pakatattānaṃ bhikkhūnaṃ abhivādanaṃ, paccuṭṭhānaṃ, añjalikammaṃ, sāmīcikammaṃ, āsanābhihāraṃ, seyyābhihāraṃ, pādodakaṃ pādapīṭhaṃ, pādakathalikaṃ, pattacīvarapaṭiggahaṇaṃ, nahāne piṭṭhiparikammaṃ. Ye te bhikkhū appicchā…pe… te ujhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma mānattacārikā bhikkhū sādiyissanti pakatattānaṃ bhikkhūnaṃ abhivādanaṃ, paccuṭṭhānaṃ…pe… nahāne piṭṭhiparikamma’’nti! Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe bhikkhusaṅghaṃ sannipātāpetvā bhikkhū paṭipucchi – ‘‘saccaṃ kira, bhikkhave, mānattacārikā bhikkhū sādiyanti pakatattānaṃ bhikkhūnaṃ abhivādanaṃ, paccuṭṭhānaṃ…pe… nahāne piṭṭhiparikamma’’nti? ‘‘Saccaṃ bhagavā’’ti. Vigarahi buddho bhagavā – ‘‘ananucchavikaṃ…pe… kathañhi nāma, bhikkhave, mānattacārikā bhikkhū sādiyissanti pakatattānaṃ bhikkhūnaṃ abhivādanaṃ…pe… nahāne piṭṭhiparikammaṃ! Netaṃ, bhikkhave, appasannānaṃ vā pasādāya…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Na ",
      ", bhikkhave, mānattacārikena bhikkhunā sāditabbaṃ pakatattānaṃ bhikkhūnaṃ abhivādanaṃ, paccuṭṭhānaṃ, añjalikammaṃ, sāmīcikammaṃ, āsanābhihāro, seyyābhihāro, pādodakaṃ pādapīṭhaṃ, pādakathalikaṃ, pattacīvarapaṭiggahaṇaṃ, nahāne piṭṭhiparikammaṃ. Yo sādiyeyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, mānattacārikānaṃ bhikkhūnaṃ mithu yathāvuḍḍhaṃ abhivādanaṃ, paccuṭṭhānaṃ…pe… nahāne piṭṭhiparikammaṃ. Anujānāmi, bhikkhave, mānattacārikānaṃ bhikkhūnaṃ pañca yathāvuḍḍhaṃ – uposathaṃ, pavāraṇaṃ, vassikasāṭikaṃ, oṇojanaṃ, bhattaṃ. Tena hi, bhikkhave, mānattacārikānaṃ bhikkhūnaṃ vattaṃ paññapessāmi yathā mānattacārikehi bhikkhūhi vattitabbaṃ."
    ],
    "innerText": "‘‘Na , bhikkhave, mānattacārikena bhikkhunā sāditabbaṃ pakatattānaṃ bhikkhūnaṃ abhivādanaṃ, paccuṭṭhānaṃ, añjalikammaṃ, sāmīcikammaṃ, āsanābhihāro, seyyābhihāro, pādodakaṃ pādapīṭhaṃ, pādakathalikaṃ, pattacīvarapaṭiggahaṇaṃ, nahāne piṭṭhiparikammaṃ. Yo sādiyeyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, mānattacārikānaṃ bhikkhūnaṃ mithu yathāvuḍḍhaṃ abhivādanaṃ, paccuṭṭhānaṃ…pe… nahāne piṭṭhiparikammaṃ. Anujānāmi, bhikkhave, mānattacārikānaṃ bhikkhūnaṃ pañca yathāvuḍḍhaṃ – uposathaṃ, pavāraṇaṃ, vassikasāṭikaṃ, oṇojanaṃ, bhattaṃ. Tena hi, bhikkhave, mānattacārikānaṃ bhikkhūnaṃ vattaṃ paññapessāmi yathā mānattacārikehi bhikkhūhi vattitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "91"
      },
      ". ‘‘Mānattacārikena ",
      ", bhikkhave, bhikkhunā sammā vattitabbaṃ. Tatrāyaṃ sammāvattanā –"
    ],
    "innerText": "91. ‘‘Mānattacārikena , bhikkhave, bhikkhunā sammā vattitabbaṃ. Tatrāyaṃ sammāvattanā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Na upasampādetabbaṃ, na nissayo dātabbo, na sāmaṇero upaṭṭhāpetabbo, na bhikkhunovādakasammuti sāditabbā, sammatenapi bhikkhuniyo na ovaditabbā. Yāya āpattiyā saṅghena mānattaṃ dinnaṃ hoti sā āpatti na āpajjitabbā, aññā vā tādisikā, tato vā pāpiṭṭhatarā; kammaṃ na garahitabbaṃ, kammikā na garahitabbā. Na pakatattassa bhikkhuno uposatho ṭhapetabbo, na pavāraṇā ṭhapetabbā, na savacanīyaṃ kātabbaṃ, na anuvādo paṭṭhapetabbo, na okāso kāretabbo, na codetabbo, na sāretabbo, na bhikkhūhi sampayojetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Na, bhikkhave, mānattacārikena bhikkhunā pakatattassa bhikkhuno purato gantabbaṃ, na purato nisīditabbaṃ. Yo hoti saṅghassa āsanapariyanto seyyāpariyanto vihārapariyanto so tassa padātabbo. Tena ca so sāditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Na, bhikkhave, mānattacārikena bhikkhunā pakatattena bhikkhunā puresamaṇena vā pacchāsamaṇena vā kulāni upasaṅkamitabbāni, na āraññikaṅgaṃ samādātabbaṃ, na piṇḍapātikaṅgaṃ samādātabbaṃ, na ca tappaccayā piṇḍapāto nīharāpetabbo – mā maṃ jāniṃsūti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Mānattacārikena, bhikkhave, bhikkhunā āgantukena ārocetabbaṃ, āgantukassa ārocetabbaṃ, uposathe ārocetabbaṃ, pavāraṇāya ārocetabbaṃ ",
      ", devasikaṃ ārocetabbaṃ. Sace gilāno hoti, dūtenapi ārocetabbaṃ."
    ],
    "innerText": "‘‘Mānattacārikena, bhikkhave, bhikkhunā āgantukena ārocetabbaṃ, āgantukassa ārocetabbaṃ, uposathe ārocetabbaṃ, pavāraṇāya ārocetabbaṃ , devasikaṃ ārocetabbaṃ. Sace gilāno hoti, dūtenapi ārocetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Na, bhikkhave, mānattacārikena bhikkhunā sabhikkhukā āvāsā abhikkhuko āvāso gantabbo, aññatra saṅghena, aññatra antarāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Na, bhikkhave, mānattacārikena bhikkhunā sabhikkhukā āvāsā abhikkhuko anāvāso gantabbo, aññatra saṅghena, aññatra antarāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Na ",
      ", bhikkhave, mānattacārikena bhikkhunā sabhikkhukā āvāsā abhikkhuko āvāso vā anāvāso vā gantabbo, aññatra saṅghena, aññatra antarāyā."
    ],
    "innerText": "‘‘Na , bhikkhave, mānattacārikena bhikkhunā sabhikkhukā āvāsā abhikkhuko āvāso vā anāvāso vā gantabbo, aññatra saṅghena, aññatra antarāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Na, bhikkhave, mānattacārikena bhikkhunā sabhikkhukā anāvāsā abhikkhuko āvāso gantabbo…pe… abhikkhuko anāvāso gantabbo…pe… abhikkhuko āvāso vā anāvāso vā gantabbo, aññatra saṅghena, aññatra antarāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Na, bhikkhave, mānattacārikena bhikkhunā sabhikkhukā āvāsā vā anāvāsā vā abhikkhuko āvāso gantabbo…pe… abhikkhuko anāvāso gantabbo…pe… abhikkhuko āvāso vā anāvāso vā gantabbo, aññatra saṅghena, aññatra antarāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Na, bhikkhave, mānattacārikena bhikkhunā sabhikkhukā āvāsā sabhikkhuko āvāso gantabbo…pe… sabhikkhuko anāvāso gantabbo…pe… sabhikkhuko āvāso vā anāvāso vā gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra saṅghena, aññatra antarāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Na bhikkhave ",
      ", mānattacārikena bhikkhunā sabhikkhukā anāvāsā sabhikkhuko āvāso gantabbo…pe… sabhikkhuko anāvāso gantabbo…pe… sabhikkhuko āvāso vā anāvāso vā gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra saṅghena, aññatra antarāyā."
    ],
    "innerText": "‘‘Na bhikkhave , mānattacārikena bhikkhunā sabhikkhukā anāvāsā sabhikkhuko āvāso gantabbo…pe… sabhikkhuko anāvāso gantabbo…pe… sabhikkhuko āvāso vā anāvāso vā gantabbo, yatthassu bhikkhū nānāsaṃvāsakā, aññatra saṅghena, aññatra antarāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Na, bhikkhave, mānattacārikena bhikkhunā sabhikkhukā āvāsā vā anāvāsā vā sabhikkhuko āvāso gantabbo…pe… sabhikkhuko anāvāso gantabbo…pe… sabhikkhuko ",
      " āvāso vā anāvāso vā gantabbo ",
      ", yatthassu bhikkhū nānāsaṃvāsakā, aññatra saṅghena, aññatra antarāyā."
    ],
    "innerText": "‘‘Na, bhikkhave, mānattacārikena bhikkhunā sabhikkhukā āvāsā vā anāvāsā vā sabhikkhuko āvāso gantabbo…pe… sabhikkhuko anāvāso gantabbo…pe… sabhikkhuko āvāso vā anāvāso vā gantabbo , yatthassu bhikkhū nānāsaṃvāsakā, aññatra saṅghena, aññatra antarāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Gantabbo, bhikkhave mānattacārikena bhikkhunā sabhikkhukā āvāsā sabhikkhuko āvāso…pe… sabhikkhuko anāvāso…pe… sabhikkhuko āvāso vā anāvāso vā, yatthassu bhikkhū samānasaṃvāsakā, yaṃ jaññā sakkomi ajjeva gantunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Gantabbo ",
      ", bhikkhave, mānattacārikena bhikkhunā sabhikkhukā anāvāsā sabhikkhuko āvāso…pe… sabhikkhuko anāvāso…pe… sabhikkhuko āvāso vā anāvāso vā, yatthassu bhikkhū samānasaṃvāsakā, yaṃ jaññā sakkomi ajjeva gantunti."
    ],
    "innerText": "‘‘Gantabbo , bhikkhave, mānattacārikena bhikkhunā sabhikkhukā anāvāsā sabhikkhuko āvāso…pe… sabhikkhuko anāvāso…pe… sabhikkhuko āvāso vā anāvāso vā, yatthassu bhikkhū samānasaṃvāsakā, yaṃ jaññā sakkomi ajjeva gantunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Gantabbo, bhikkhave, mānattacārikena bhikkhunā sabhikkhukā āvāsā vā anāvāsā vā sabhikkhuko āvāso…pe… sabhikkhuko anāvāso…pe… sabhikkhuko āvāso vā anāvāso vā, yatthassu bhikkhū samānasaṃvāsakā, yaṃ jaññā sakkomi ajjeva gantunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Na ",
      ", bhikkhave, mānattacārikena bhikkhunā pakatattena bhikkhunā saddhiṃ ekacchanne āvāse vatthabbaṃ, na ekacchanne anāvāse vatthabbaṃ, na ekacchanne āvāse vā anāvāse vā vatthabbaṃ. Pakatattaṃ bhikkhuṃ disvā āsanā vuṭṭhātabbaṃ. Pakatatto bhikkhu āsanena nimantetabbo. Na pakatattena bhikkhunā saddhiṃ ekāsane nisīditabbaṃ, na nīce āsane nisinne ucce āsane nisīditabbaṃ, na chamāyaṃ nisinne āsane nisīditabbaṃ; na ekacaṅkame caṅkamitabbaṃ, na nīce caṅkame caṅkamante ucce caṅkame caṅkamitabbaṃ, na chamāyaṃ caṅkamante caṅkame caṅkamitabbaṃ."
    ],
    "innerText": "‘‘Na , bhikkhave, mānattacārikena bhikkhunā pakatattena bhikkhunā saddhiṃ ekacchanne āvāse vatthabbaṃ, na ekacchanne anāvāse vatthabbaṃ, na ekacchanne āvāse vā anāvāse vā vatthabbaṃ. Pakatattaṃ bhikkhuṃ disvā āsanā vuṭṭhātabbaṃ. Pakatatto bhikkhu āsanena nimantetabbo. Na pakatattena bhikkhunā saddhiṃ ekāsane nisīditabbaṃ, na nīce āsane nisinne ucce āsane nisīditabbaṃ, na chamāyaṃ nisinne āsane nisīditabbaṃ; na ekacaṅkame caṅkamitabbaṃ, na nīce caṅkame caṅkamante ucce caṅkame caṅkamitabbaṃ, na chamāyaṃ caṅkamante caṅkame caṅkamitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Na, bhikkhave, mānattacārikena bhikkhunā pārivāsikena bhikkhunā saddhiṃ…pe… mūlāyapaṭikassanārahena bhikkhunā saddhiṃ…pe… mānattārahena bhikkhunā saddhiṃ…pe… mānattacārikena vuḍḍhatarena bhikkhunā saddhiṃ…pe… abbhānārahena bhikkhunā saddhiṃ ekacchanne āvāse vatthabbaṃ, na ekacchanne anāvāse vatthabbaṃ, na ekacchanne āvāse vā anāvāse vā vatthabbaṃ; na ekāsane nisīditabbaṃ, na nīce āsane nisinne ucce āsane nisīditabbaṃ, na chamāyaṃ nisinne āsane nisīditabbaṃ; na ekacaṅkame caṅkamitabbaṃ ",
      ", na nīce caṅkame caṅkamante ucce caṅkame caṅkamitabbaṃ, na chamāyaṃ caṅkamante caṅkame caṅkamitabbaṃ."
    ],
    "innerText": "‘‘Na, bhikkhave, mānattacārikena bhikkhunā pārivāsikena bhikkhunā saddhiṃ…pe… mūlāyapaṭikassanārahena bhikkhunā saddhiṃ…pe… mānattārahena bhikkhunā saddhiṃ…pe… mānattacārikena vuḍḍhatarena bhikkhunā saddhiṃ…pe… abbhānārahena bhikkhunā saddhiṃ ekacchanne āvāse vatthabbaṃ, na ekacchanne anāvāse vatthabbaṃ, na ekacchanne āvāse vā anāvāse vā vatthabbaṃ; na ekāsane nisīditabbaṃ, na nīce āsane nisinne ucce āsane nisīditabbaṃ, na chamāyaṃ nisinne āsane nisīditabbaṃ; na ekacaṅkame caṅkamitabbaṃ , na nīce caṅkame caṅkamante ucce caṅkame caṅkamitabbaṃ, na chamāyaṃ caṅkamante caṅkame caṅkamitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mahāva. 393]"
      },
      " ‘‘Mānattacārikacatuttho ce, bhikkhave, parivāsaṃ dadeyya, mūlāya ",
      " paṭikasseyya, mānattaṃ dadeyya, taṃvīso abbheyya, akammaṃ, na ca karaṇīya’’nti."
    ],
    "innerText": "[mahāva. 393] ‘‘Mānattacārikacatuttho ce, bhikkhave, parivāsaṃ dadeyya, mūlāya paṭikasseyya, mānattaṃ dadeyya, taṃvīso abbheyya, akammaṃ, na ca karaṇīya’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "92"
      },
      ". Atha kho āyasmā upāli yena bhagavā tenupasaṅkami, upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā upāli bhagavantaṃ etadavoca – ‘‘kati nu kho, bhante, mānattacārikassa bhikkhuno ratticchedā’’ti? ‘‘Cattāro kho ",
      ", upāli, mānattacārikassa bhikkhuno ratticchedā. Sahavāso, vippavāso, anārocanā, ūne gaṇe caraṇaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[caraṇanti (ka.)]"
      },
      " – ime kho, upāli, cattāro mānattacārikassa bhikkhuno ratticchedā’’ti."
    ],
    "innerText": "92. Atha kho āyasmā upāli yena bhagavā tenupasaṅkami, upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā upāli bhagavantaṃ etadavoca – ‘‘kati nu kho, bhante, mānattacārikassa bhikkhuno ratticchedā’’ti? ‘‘Cattāro kho , upāli, mānattacārikassa bhikkhuno ratticchedā. Sahavāso, vippavāso, anārocanā, ūne gaṇe caraṇaṃ [caraṇanti (ka.)] – ime kho, upāli, cattāro mānattacārikassa bhikkhuno ratticchedā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "93"
      },
      ". Tena kho pana samayena sāvatthiyaṃ mahābhikkhusaṅgho sannipatito hoti. Na sakkonti mānattacārikā bhikkhū mānattaṃ sodhetuṃ. Bhagavato etamatthaṃ ārocesuṃ. ‘‘Anujānāmi, bhikkhave, mānattaṃ nikkhipituṃ. Evañca pana, bhikkhave, nikkhipitabbaṃ. Tena mānattacārikena bhikkhunā ekaṃ bhikkhuṃ upasaṅkamitvā ekaṃsaṃ uttarāsaṅgaṃ karitvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā evamassa vacanīyo – ‘mānattaṃ nikkhipāmī’ti. Nikkhittaṃ hoti mānattaṃ. ‘Vattaṃ nikkhipāmī’ti. Nikkhittaṃ hoti mānatta’’nti."
    ],
    "innerText": "93. Tena kho pana samayena sāvatthiyaṃ mahābhikkhusaṅgho sannipatito hoti. Na sakkonti mānattacārikā bhikkhū mānattaṃ sodhetuṃ. Bhagavato etamatthaṃ ārocesuṃ. ‘‘Anujānāmi, bhikkhave, mānattaṃ nikkhipituṃ. Evañca pana, bhikkhave, nikkhipitabbaṃ. Tena mānattacārikena bhikkhunā ekaṃ bhikkhuṃ upasaṅkamitvā ekaṃsaṃ uttarāsaṅgaṃ karitvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā evamassa vacanīyo – ‘mānattaṃ nikkhipāmī’ti. Nikkhittaṃ hoti mānattaṃ. ‘Vattaṃ nikkhipāmī’ti. Nikkhittaṃ hoti mānatta’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "94"
      },
      ". Tena kho pana samayena sāvatthiyā bhikkhū tahaṃ tahaṃ pakkamiṃsu ",
      ". Sakkonti mānattacārikā bhikkhū mānattaṃ sodhetuṃ. Bhagavato etamatthaṃ ārocesuṃ. ‘‘Anujānāmi, bhikkhave, mānattaṃ samādiyituṃ. Evañca pana, bhikkhave, samādiyitabbaṃ. Tena mānattacārikena bhikkhunā ekaṃ bhikkhuṃ upasaṅkamitvā ekaṃsaṃ uttarāsaṅgaṃ karitvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā, evamassa vacanīyo – ‘mānattaṃ samādiyāmī’ti. Samādinnaṃ hoti mānattaṃ. ‘Vattaṃ samādiyāmī’ti. Samādinnaṃ hoti mānatta’’nti."
    ],
    "innerText": "94. Tena kho pana samayena sāvatthiyā bhikkhū tahaṃ tahaṃ pakkamiṃsu . Sakkonti mānattacārikā bhikkhū mānattaṃ sodhetuṃ. Bhagavato etamatthaṃ ārocesuṃ. ‘‘Anujānāmi, bhikkhave, mānattaṃ samādiyituṃ. Evañca pana, bhikkhave, samādiyitabbaṃ. Tena mānattacārikena bhikkhunā ekaṃ bhikkhuṃ upasaṅkamitvā ekaṃsaṃ uttarāsaṅgaṃ karitvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā, evamassa vacanīyo – ‘mānattaṃ samādiyāmī’ti. Samādinnaṃ hoti mānattaṃ. ‘Vattaṃ samādiyāmī’ti. Samādinnaṃ hoti mānatta’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Mānattacārikavattaṃ niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Abbhānārahavattaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "95"
      },
      ". Tena ",
      " kho pana samayena abbhānārahā bhikkhū sādiyanti pakatattānaṃ bhikkhūnaṃ abhivādanaṃ paccuṭṭhānaṃ…pe… nahāne piṭṭhiparikammaṃ. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma abbhānārahā bhikkhū sādiyissanti pakatattānaṃ bhikkhūnaṃ abhivādanaṃ paccuṭṭhānaṃ…pe… nahāne piṭṭhiparikamma’’nti! Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ."
    ],
    "innerText": "95. Tena kho pana samayena abbhānārahā bhikkhū sādiyanti pakatattānaṃ bhikkhūnaṃ abhivādanaṃ paccuṭṭhānaṃ…pe… nahāne piṭṭhiparikammaṃ. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma abbhānārahā bhikkhū sādiyissanti pakatattānaṃ bhikkhūnaṃ abhivādanaṃ paccuṭṭhānaṃ…pe… nahāne piṭṭhiparikamma’’nti! Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe bhikkhusaṅghaṃ sannipātāpetvā bhikkhū paṭipucchi – ‘‘saccaṃ kira, bhikkhave, abbhānārahā bhikkhū sādiyanti pakatattānaṃ bhikkhūnaṃ abhivādanaṃ paccuṭṭhānaṃ…pe… nahāne piṭṭhiparikammanti? ‘‘Saccaṃ bhagavā’’ti. Vigarahi buddho ",
      " bhagavā – ‘‘ananucchavikaṃ…pe… kathañhi nāma, bhikkhave, abbhānārahā bhikkhū sādiyissanti pakatattānaṃ bhikkhūnaṃ abhivādanaṃ paccuṭṭhānaṃ…pe… nahāne piṭṭhiparikammaṃ ",
      "! Netaṃ, bhikkhave, appasannānaṃ vā pasādāya…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘na, bhikkhave, abbhānārahena bhikkhunā sāditabbaṃ pakatattānaṃ bhikkhūnaṃ abhivādanaṃ paccupaṭṭhānaṃ…pe… nahāne piṭṭhiparikammaṃ. Yo sādiyeyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, abbhānārahānaṃ bhikkhūnaṃ mithu yathāvuḍḍhaṃ abhivādanaṃ paccuṭṭhānaṃ…pe… nahāne piṭṭhiparikammaṃ. Anujānāmi, bhikkhave, abbhānārahānaṃ bhikkhūnaṃ pañca yathāvuḍḍhaṃ – uposathaṃ, pavāraṇaṃ, vassikasāṭikaṃ, oṇojanaṃ, bhattaṃ. Tena hi, bhikkhave, abbhānārahānaṃ bhikkhūnaṃ vattaṃ paññāpessāmi yathā abbhānārahehi bhikkhūhi vattitabbaṃ."
    ],
    "innerText": "Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe bhikkhusaṅghaṃ sannipātāpetvā bhikkhū paṭipucchi – ‘‘saccaṃ kira, bhikkhave, abbhānārahā bhikkhū sādiyanti pakatattānaṃ bhikkhūnaṃ abhivādanaṃ paccuṭṭhānaṃ…pe… nahāne piṭṭhiparikammanti? ‘‘Saccaṃ bhagavā’’ti. Vigarahi buddho bhagavā – ‘‘ananucchavikaṃ…pe… kathañhi nāma, bhikkhave, abbhānārahā bhikkhū sādiyissanti pakatattānaṃ bhikkhūnaṃ abhivādanaṃ paccuṭṭhānaṃ…pe… nahāne piṭṭhiparikammaṃ ! Netaṃ, bhikkhave, appasannānaṃ vā pasādāya…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘na, bhikkhave, abbhānārahena bhikkhunā sāditabbaṃ pakatattānaṃ bhikkhūnaṃ abhivādanaṃ paccupaṭṭhānaṃ…pe… nahāne piṭṭhiparikammaṃ. Yo sādiyeyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, abbhānārahānaṃ bhikkhūnaṃ mithu yathāvuḍḍhaṃ abhivādanaṃ paccuṭṭhānaṃ…pe… nahāne piṭṭhiparikammaṃ. Anujānāmi, bhikkhave, abbhānārahānaṃ bhikkhūnaṃ pañca yathāvuḍḍhaṃ – uposathaṃ, pavāraṇaṃ, vassikasāṭikaṃ, oṇojanaṃ, bhattaṃ. Tena hi, bhikkhave, abbhānārahānaṃ bhikkhūnaṃ vattaṃ paññāpessāmi yathā abbhānārahehi bhikkhūhi vattitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "96"
      },
      ". ‘‘Abbhānārahena, bhikkhave, bhikkhunā sammā vattitabbaṃ. Tatrāyaṃ sammāvattanā –"
    ],
    "innerText": "96. ‘‘Abbhānārahena, bhikkhave, bhikkhunā sammā vattitabbaṃ. Tatrāyaṃ sammāvattanā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Na upasampādetabbaṃ…pe… (yathā heṭṭhā, tathā vitthāretabbaṃ,) na bhikkhūhi sampayojetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Na, bhikkhave, abbhānārahena bhikkhunā pakatattassa bhikkhuno purato gantabbaṃ, na purato nisīditabbaṃ. Yo hoti saṅghassa āsanapariyanto seyyāpariyanto vihārapariyanto so tassa padātabbo. Tena ca so sāditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Na ",
      ", bhikkhave, abbhānārahena bhikkhunā ",
      " pakatattena bhikkhunā puresamaṇena vā pacchāsamaṇena vā kulāni upasaṅkamitabbāni; na āraññikaṅgaṃ samādātabbaṃ; na piṇḍapātikaṅgaṃ samādātabbaṃ; na ca tappaccayā piṇḍapāto nīharāpetabbo – mā maṃ jāniṃsūti."
    ],
    "innerText": "‘‘Na , bhikkhave, abbhānārahena bhikkhunā pakatattena bhikkhunā puresamaṇena vā pacchāsamaṇena vā kulāni upasaṅkamitabbāni; na āraññikaṅgaṃ samādātabbaṃ; na piṇḍapātikaṅgaṃ samādātabbaṃ; na ca tappaccayā piṇḍapāto nīharāpetabbo – mā maṃ jāniṃsūti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Na, bhikkhave, abbhānārahena bhikkhunā sabhikkhukā āvāsā abhikkhuko āvāso gantabbo, aññatra pakatattena, aññatra antarāyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Na, bhikkhave, abbhānārahena bhikkhunā sabhikkhukā āvāsā abhikkhuko anāvāso gantabbo, aññatra pakatattena, aññatra antarāyā…pe…. (Yathā heṭṭhā, tathā vitthāretabbā.)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Gantabbo ",
      ", bhikkhave, abbhānārahena bhikkhunā sabhikkhukā āvāsā…pe… anāvāsā…pe… āvāsā vā anāvāsā vā sabhikkhuko ",
      " āvāso…pe… sabhikkhuko anāvāso…pe… sabhikkhuko āvāso vā anāvāso vā, yatthassu bhikkhū samānasaṃvāsakā, yaṃ jaññā sakkomi ajjeva gantunti."
    ],
    "innerText": "‘‘Gantabbo , bhikkhave, abbhānārahena bhikkhunā sabhikkhukā āvāsā…pe… anāvāsā…pe… āvāsā vā anāvāsā vā sabhikkhuko āvāso…pe… sabhikkhuko anāvāso…pe… sabhikkhuko āvāso vā anāvāso vā, yatthassu bhikkhū samānasaṃvāsakā, yaṃ jaññā sakkomi ajjeva gantunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Na, bhikkhave, abbhānārahena bhikkhunā pakatattena bhikkhunā saddhiṃ ekacchanne āvāse vatthabbaṃ, na ekacchanne anāvāse vatthabbaṃ, na ekacchanne āvāse vā anāvāse vā vatthabbaṃ; pakatattaṃ bhikkhuṃ disvā āsanā vuṭṭhātabbaṃ, pakatatto bhikkhu āsanena nimantetabbo; na pakatattena bhikkhunā saddhiṃ ekāsane nisīditabbaṃ, na nīce āsane nisinne ucce āsane nisīditabbaṃ, na chamāyaṃ nisinne āsane nisīditabbaṃ; na ekacaṅkame caṅkamitabbaṃ, na nīce caṅkame ",
      " caṅkamante ucce caṅkame caṅkamitabbaṃ, na chamāyaṃ caṅkamante caṅkame caṅkamitabbaṃ."
    ],
    "innerText": "‘‘Na, bhikkhave, abbhānārahena bhikkhunā pakatattena bhikkhunā saddhiṃ ekacchanne āvāse vatthabbaṃ, na ekacchanne anāvāse vatthabbaṃ, na ekacchanne āvāse vā anāvāse vā vatthabbaṃ; pakatattaṃ bhikkhuṃ disvā āsanā vuṭṭhātabbaṃ, pakatatto bhikkhu āsanena nimantetabbo; na pakatattena bhikkhunā saddhiṃ ekāsane nisīditabbaṃ, na nīce āsane nisinne ucce āsane nisīditabbaṃ, na chamāyaṃ nisinne āsane nisīditabbaṃ; na ekacaṅkame caṅkamitabbaṃ, na nīce caṅkame caṅkamante ucce caṅkame caṅkamitabbaṃ, na chamāyaṃ caṅkamante caṅkame caṅkamitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Na, bhikkhave, abbhānārahena bhikkhunā pārivāsikena bhikkhunā saddhiṃ…pe… mūlāyapaṭikassanārahena bhikkhunā saddhiṃ…pe… mānattārahena bhikkhunā saddhiṃ…pe… mānattacārikena bhikkhunā saddhiṃ…pe… abbhānārahena vuḍḍhatarena bhikkhunā saddhiṃ ekacchanne āvāse vatthabbaṃ, na ekacchanne anāvāse vatthabbaṃ; na ekacchanne āvāse vā anāvāse vā vatthabbaṃ; na ekāsane nisīditabbaṃ, na nīce āsane nisinne ucce āsane nisīditabbaṃ, na chamāyaṃ nisinne āsane nisīditabbaṃ; na ekacaṅkame caṅkamitabbaṃ ",
      ", na nīce caṅkame caṅkamante ucce caṅkame caṅkamitabbaṃ, na chamāyaṃ caṅkamante caṅkame caṅkamitabbaṃ."
    ],
    "innerText": "‘‘Na, bhikkhave, abbhānārahena bhikkhunā pārivāsikena bhikkhunā saddhiṃ…pe… mūlāyapaṭikassanārahena bhikkhunā saddhiṃ…pe… mānattārahena bhikkhunā saddhiṃ…pe… mānattacārikena bhikkhunā saddhiṃ…pe… abbhānārahena vuḍḍhatarena bhikkhunā saddhiṃ ekacchanne āvāse vatthabbaṃ, na ekacchanne anāvāse vatthabbaṃ; na ekacchanne āvāse vā anāvāse vā vatthabbaṃ; na ekāsane nisīditabbaṃ, na nīce āsane nisinne ucce āsane nisīditabbaṃ, na chamāyaṃ nisinne āsane nisīditabbaṃ; na ekacaṅkame caṅkamitabbaṃ , na nīce caṅkame caṅkamante ucce caṅkame caṅkamitabbaṃ, na chamāyaṃ caṅkamante caṅkame caṅkamitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mahāva. 393]"
      },
      " ‘‘Abbhānārahacatuttho ce, bhikkhave, parivāsaṃ dadeyya, mūlāya paṭikasseyya, mānattaṃ dadeyya, taṃvīso abbheyya, akammaṃ, na ca karaṇīya’’nti."
    ],
    "innerText": "[mahāva. 393] ‘‘Abbhānārahacatuttho ce, bhikkhave, parivāsaṃ dadeyya, mūlāya paṭikasseyya, mānattaṃ dadeyya, taṃvīso abbheyya, akammaṃ, na ca karaṇīya’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Abbhānārahavattaṃ niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pārivāsikakkhandhako dutiyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Imamhi khandhake vatthū pañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Pārivāsikā ",
      " sādenti, pakatattāna bhikkhunaṃ;"
    ],
    "innerText": "Pārivāsikā sādenti, pakatattāna bhikkhunaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Abhivādanaṃ paccuṭṭhānaṃ, añjaliñca sāmīciyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Āsanaṃ ",
      " seyyābhihāraṃ, pādo pīṭhaṃ kathalikaṃ;"
    ],
    "innerText": "Āsanaṃ seyyābhihāraṃ, pādo pīṭhaṃ kathalikaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pattaṃ nahāne parikammaṃ, ujjhāyanti ca pesalā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Dukkaṭaṃ sādiyantassa, mithu pañca yathāvuḍḍhaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[punāpare (ka.)]"
      },
      ";"
    ],
    "innerText": "Dukkaṭaṃ sādiyantassa, mithu pañca yathāvuḍḍhaṃ [punāpare (ka.)];"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Uposathaṃ pavāraṇaṃ, vassikoṇojabhojanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sammā ca vattanā tattha, pakatattassa gacchantaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Yo ca hoti pariyanto, pure pacchā tatheva ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[na pure pacchāsamaṇena (sī. syā.)]"
      },
      "."
    ],
    "innerText": "Yo ca hoti pariyanto, pure pacchā tatheva ca [na pure pacchāsamaṇena (sī. syā.)]."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Āraññapiṇḍanīhāro, āgantuke uposathe;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pavāraṇāya dūtena, gantabbo ca sabhikkhuko."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Ekacchanne ",
      " ca vuṭṭhānaṃ, tatheva ca nimantaye;"
    ],
    "innerText": "Ekacchanne ca vuṭṭhānaṃ, tatheva ca nimantaye;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Āsane nīce caṅkame, chamāyaṃ caṅkamena ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Vuḍḍhatarena akammaṃ, ratticchedā ca sodhanā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Nikkhipanaṃ samādānaṃ, vattaṃva pārivāsike ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ratti vā pārivāsike (ka.), ñātabbaṃ pārivāsikā (sī. syā.)]"
      },
      "."
    ],
    "innerText": "Nikkhipanaṃ samādānaṃ, vattaṃva pārivāsike [ratti vā pārivāsike (ka.), ñātabbaṃ pārivāsikā (sī. syā.)]."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Mūlāya ",
      " mānattārahā, tathā mānattacārikā;"
    ],
    "innerText": "Mūlāya mānattārahā, tathā mānattacārikā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Abbhānārahe nayo cāpi, sambhedaṃ nayato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sambhedanayato (syā.)]"
      },
      " puna."
    ],
    "innerText": "Abbhānārahe nayo cāpi, sambhedaṃ nayato [sambhedanayato (syā.)] puna."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Pārivāsikesu tayo, catu mānattacārike;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Na samenti ratticchedesu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ratticchede (itipi), ratticchedā (syā.)]"
      },
      ", mānattesu ca devasi;"
    ],
    "innerText": "Na samenti ratticchedesu [ratticchede (itipi), ratticchedā (syā.)], mānattesu ca devasi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Dve kammā sadisā sesā, tayo kammā samāsamāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[samā matāti (sī.)]"
      },
      "."
    ],
    "innerText": "Dve kammā sadisā sesā, tayo kammā samāsamāti [samā matāti (sī.)]."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pārivāsikakkhandhakaṃ niṭṭhitaṃ."
  }
]