[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "Pārājikakaṇḍo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Bhikkhunīnaṃ ",
      " hitatthāya, pātimokkhaṃ pakāsayi;"
    ],
    "innerText": "Bhikkhunīnaṃ hitatthāya, pātimokkhaṃ pakāsayi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yaṃ nātho, tassa dāneso, sampatto vaṇṇanākkamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "Sādhāraṇapārājikaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1…Pe…4. methunadhammasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "suṇātu me"
      },
      "tiādīnaṃ bhikkhupātimokkhavaṇṇanāyaṃ vuttanayeneva attho veditabbo. Kevalañhi, bhante, ayyetiādivasena tasmiñca idha ca abhilāpamattameva liṅgabhedamattañca viseso ",
      ". Yasmā ca bhikkhuniyā sikkhāpaccakkhānaṃ nāma natthi, tasmā bhikkhunīnaṃ ‘‘sikkhāsājīvasamāpannā sikkhaṃ apaccakkhāya dubbalyaṃ anāvikatvā’’ti avatvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yā pana bhikkhunī chandaso methunaṃ dhammaṃ paṭiseveyyā"
      },
      "ti vuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "chandaso"
      },
      "ti methunarāgappaṭisaṃyuttena chandena ceva ruciyā ca. Chande pana asati balakkārena padhaṃsitāya anāpatti, tasmā yā paripuṇṇūpasampadā bhikkhunī manussāmanussatiracchānajātīsu purisaubhatobyañjanakapaṇḍakānaṃ yassa kassaci sajīvassa vā nijjīvassa vā santhatassa vā asanthatassa vā akkhāyitassa vā yebhuyyena akkhāyitassa vā aṅgajātassa attano vaccamaggapassāvamaggamukhesu tīsu yatthakatthaci santhate vā asanthate vā pakativātena asaṃphuṭṭhe allokāse antamaso tilaphalamattampi padesaṃ chandaso paveseti, parena vā pavesiyamānā pavesanapaviṭṭhaṭṭhitauddharaṇesu yaṃkiñci sādiyati, ayaṃ pārājikā hoti. Sesamettha ito paresu ca sādhāraṇasikkhāpadesu vuttanayānusāreneva veditabbaṃ."
    ],
    "innerText": "Tattha suṇātu metiādīnaṃ bhikkhupātimokkhavaṇṇanāyaṃ vuttanayeneva attho veditabbo. Kevalañhi, bhante, ayyetiādivasena tasmiñca idha ca abhilāpamattameva liṅgabhedamattañca viseso . Yasmā ca bhikkhuniyā sikkhāpaccakkhānaṃ nāma natthi, tasmā bhikkhunīnaṃ ‘‘sikkhāsājīvasamāpannā sikkhaṃ apaccakkhāya dubbalyaṃ anāvikatvā’’ti avatvā yā pana bhikkhunī chandaso methunaṃ dhammaṃ paṭiseveyyāti vuttaṃ. Tattha chandasoti methunarāgappaṭisaṃyuttena chandena ceva ruciyā ca. Chande pana asati balakkārena padhaṃsitāya anāpatti, tasmā yā paripuṇṇūpasampadā bhikkhunī manussāmanussatiracchānajātīsu purisaubhatobyañjanakapaṇḍakānaṃ yassa kassaci sajīvassa vā nijjīvassa vā santhatassa vā asanthatassa vā akkhāyitassa vā yebhuyyena akkhāyitassa vā aṅgajātassa attano vaccamaggapassāvamaggamukhesu tīsu yatthakatthaci santhate vā asanthate vā pakativātena asaṃphuṭṭhe allokāse antamaso tilaphalamattampi padesaṃ chandaso paveseti, parena vā pavesiyamānā pavesanapaviṭṭhaṭṭhitauddharaṇesu yaṃkiñci sādiyati, ayaṃ pārājikā hoti. Sesamettha ito paresu ca sādhāraṇasikkhāpadesu vuttanayānusāreneva veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "Asādhāraṇapārājikaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Ubbhajāṇumaṇḍalikāsikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Asādhāraṇesu ",
      " pana catunnaṃ tāva pārājikānaṃ paṭhame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avassutā"
      },
      "ti kāyasaṃsaggarāgena tintā, kilinnāti attho. Dutiyapadepi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purisapuggalassā"
      },
      "ti kāyasaṃsaggaṃ samāpajjituṃ viññussa manussajātikassa purisasaṅkhātassa puggalassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adhakkhaka"
      },
      "nti attano akkhakānaṃ adho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ubbhajāṇumaṇḍala"
      },
      "nti jāṇumaṇḍalānaṃ upari, ettha ca ubbhakapparampi ubbhajāṇumaṇḍaleneva saṅgahitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āmasana"
      },
      "nti āmajjanaṃ phuṭṭhokāsaṃ anatikkamitvā tattheva saṅghaṭṭanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parāmasana"
      },
      "nti ito cito ca sañcaraṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gahaṇa"
      },
      "nti gahitamattaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Chupana"
      },
      "nti asaṅghaṭṭetvā phuṭṭhamattaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭipīḷana"
      },
      "nti aṅge gahetvā nippīḷanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sādiyeyyā"
      },
      "ti yā bhikkhunī attano yathāparicchinne kāye purisassa etaṃ āmasanādiṃ sādiyati, sayaṃ vā pana ",
      " tena kāyena purisassa yaṃkiñci kāyappadesaṃ sādayamānā chupati, ayaṃ ubbhajāṇumaṇḍalikā nāma pārājikāti ayamettha saṅkhepo."
    ],
    "innerText": "Asādhāraṇesu pana catunnaṃ tāva pārājikānaṃ paṭhame avassutāti kāyasaṃsaggarāgena tintā, kilinnāti attho. Dutiyapadepi eseva nayo. Purisapuggalassāti kāyasaṃsaggaṃ samāpajjituṃ viññussa manussajātikassa purisasaṅkhātassa puggalassa. Adhakkhakanti attano akkhakānaṃ adho. Ubbhajāṇumaṇḍalanti jāṇumaṇḍalānaṃ upari, ettha ca ubbhakapparampi ubbhajāṇumaṇḍaleneva saṅgahitaṃ. Āmasananti āmajjanaṃ phuṭṭhokāsaṃ anatikkamitvā tattheva saṅghaṭṭanaṃ. Parāmasananti ito cito ca sañcaraṇaṃ. Gahaṇanti gahitamattaṃ. Chupananti asaṅghaṭṭetvā phuṭṭhamattaṃ. Paṭipīḷananti aṅge gahetvā nippīḷanaṃ. Sādiyeyyāti yā bhikkhunī attano yathāparicchinne kāye purisassa etaṃ āmasanādiṃ sādiyati, sayaṃ vā pana tena kāyena purisassa yaṃkiñci kāyappadesaṃ sādayamānā chupati, ayaṃ ubbhajāṇumaṇḍalikā nāma pārājikāti ayamettha saṅkhepo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Nidānaṃ puggalaṃ vatthu’’ntiādike (kaṅkhā. aṭṭha. paṭhamapārājikavaṇṇanā) tena vitthāravinicchaye ",
      " yasmā sabbāneva asādhāraṇapaññattiyo honti, tasmā ito paṭṭhāya santiṃ anupaññattiṃ vatvā sādhāraṇapaññattīti vā asādhāraṇapaññattīti vā na vakkhāma, āṇattiyaṃ yattha āṇatti natthi, tattha kiñci avatvā yattha atthi, tattheva vakkhāma, vipattivicāraṇā vuttāyeva."
    ],
    "innerText": "‘‘Nidānaṃ puggalaṃ vatthu’’ntiādike (kaṅkhā. aṭṭha. paṭhamapārājikavaṇṇanā) tena vitthāravinicchaye yasmā sabbāneva asādhāraṇapaññattiyo honti, tasmā ito paṭṭhāya santiṃ anupaññattiṃ vatvā sādhāraṇapaññattīti vā asādhāraṇapaññattīti vā na vakkhāma, āṇattiyaṃ yattha āṇatti natthi, tattha kiñci avatvā yattha atthi, tattheva vakkhāma, vipattivicāraṇā vuttāyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Avasesaṃ pana sabbattha vattabbaṃ, tayidaṃ vuccati, idaṃ tāva sikkhāpadaṃ sāvatthiyaṃ sundarīnandaṃ ārabbha kāyasaṃsaggaṃ samāpajjanavatthusmiṃ paññattaṃ, ekatoavassute yathāparicchinnena kāyena purisassa kāyaṃ, ubhatoavassutepi kāyena kāyappaṭibaddhaṃ, yathāparicchinnakāyappaṭibaddhena vā avasesakāyena vā tassa kāyaṃ āmasantiyā thullaccayaṃ, yakkhapetapaṇḍakatiracchānagatamanussaviggahānaṃ ubhatoavassute yathāparicchinnena kāyena kāyaṃ āmasantiyāpi thullaccayaṃ, sace pana purisassa kāyasaṃsaggarāgo natthi, pārājikakkhettepi thullaccayameva. Avasese pana kāyappaṭibaddhena kāyappaṭibaddhādibhede, methunarāgagehasitapemesu ca sabbattha dukkaṭaṃ. Asañcicca, assatiyā, ajānantiyā, asādiyantiyā ",
      ", ummattikādīnañca anāpatti. Aṅgāni samuṭṭhānādīni ca bhikkhupātimokkhe kāyasaṃsagge vuttanayeneva veditabbānīti."
    ],
    "innerText": "Avasesaṃ pana sabbattha vattabbaṃ, tayidaṃ vuccati, idaṃ tāva sikkhāpadaṃ sāvatthiyaṃ sundarīnandaṃ ārabbha kāyasaṃsaggaṃ samāpajjanavatthusmiṃ paññattaṃ, ekatoavassute yathāparicchinnena kāyena purisassa kāyaṃ, ubhatoavassutepi kāyena kāyappaṭibaddhaṃ, yathāparicchinnakāyappaṭibaddhena vā avasesakāyena vā tassa kāyaṃ āmasantiyā thullaccayaṃ, yakkhapetapaṇḍakatiracchānagatamanussaviggahānaṃ ubhatoavassute yathāparicchinnena kāyena kāyaṃ āmasantiyāpi thullaccayaṃ, sace pana purisassa kāyasaṃsaggarāgo natthi, pārājikakkhettepi thullaccayameva. Avasese pana kāyappaṭibaddhena kāyappaṭibaddhādibhede, methunarāgagehasitapemesu ca sabbattha dukkaṭaṃ. Asañcicca, assatiyā, ajānantiyā, asādiyantiyā , ummattikādīnañca anāpatti. Aṅgāni samuṭṭhānādīni ca bhikkhupātimokkhe kāyasaṃsagge vuttanayeneva veditabbānīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ubbhajāṇumaṇḍalikāsikkhāpadavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Vajjappaṭicchādikāsikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dutiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gaṇassā"
      },
      "ti aññāsaṃ bhikkhunīnaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ṭhitā"
      },
      "ti saliṅge ṭhitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cutā"
      },
      "ti kālaṅkatā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nāsitā"
      },
      "ti liṅganāsanāya sayaṃ vā naṭṭhā, aññehi vā nāsitā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avassaṭā"
      },
      "ti titthāyatanaṃ saṅkantā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pubbevāhaṃ ayye aññāsi"
      },
      "nti idaṃ tassā vacanakāladassanaṃ, saliṅge ṭhitāya pana pārājikabhāvaṃ ñatvā ‘‘na dāni naṃ kassaci ārocessāmī’’ti dhure nikkhittamatteyeva ayaṃ vajjappaṭicchādikā nāma pārājikā hotīti."
    ],
    "innerText": "Dutiye gaṇassāti aññāsaṃ bhikkhunīnaṃ. Ṭhitāti saliṅge ṭhitā. Cutāti kālaṅkatā. Nāsitāti liṅganāsanāya sayaṃ vā naṭṭhā, aññehi vā nāsitā. Avassaṭāti titthāyatanaṃ saṅkantā. Pubbevāhaṃ ayye aññāsinti idaṃ tassā vacanakāladassanaṃ, saliṅge ṭhitāya pana pārājikabhāvaṃ ñatvā ‘‘na dāni naṃ kassaci ārocessāmī’’ti dhure nikkhittamatteyeva ayaṃ vajjappaṭicchādikā nāma pārājikā hotīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sāvatthiyaṃ thullanandaṃ ārabbha nevaattanāpaṭicodanā nagaṇassa ārocanavatthusmiṃ paññattaṃ, sesamettha sappāṇakavaggamhi duṭṭhullāpattippaṭicchādanasikkhāpade vuttanayeneva veditabbaṃ. Tatra hi pācittiyaṃ, idha pārājikanti ayameva viseso, sesaṃ tādisamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vajjappaṭicchādikāsikkhāpadavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Ukkhittānuvattikāsikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ukkhitta"
      },
      "nti āpattiyā adassanādīsu ukkhittaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammenā"
      },
      "ti bhūtena vatthunā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vinayenā"
      },
      "ti codetvā sāretvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Satthusāsanenā"
      },
      "ti idhāpi codetvā sāretvā karaṇameva satthusāsanaṃ nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anādara"
      },
      "nti yena saṅghena ukkhepaniyakammaṃ kataṃ, tasmiṃ vā, tattha pariyāpannagaṇe vā ekapuggale vā tasmiṃ vā kamme ādaravirahitaṃ, sammāvattanāya avattamānanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appaṭikāra"
      },
      "nti paṭikārarahitaṃ, anosāritanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akatasahāya"
      },
      "nti ekakammādike saṃvāse saha ayanabhāvena samānasaṃvāsakā bhikkhū sahāyā nāma, yassa pana so saṃvāso tehi saddhiṃ natthi na tena te sahāyā katā honti ",
      ", iti so akatasahāyo nāma, taṃ akatasahāyaṃ, samānasaṃvāsakabhāvaṃ anupagatanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tamanuvatteyyā"
      },
      "ti taṃ ukkhittakaṃ ukkhittakabhāveyeva ṭhitaṃ bhikkhuṃ yā bhikkhunī yaṃdiṭṭhiko so hoti, tāya diṭṭhiyā gahaṇabhāvena anuvatteyya. Sā bhikkhunī bhikkhunīhi saṅghabhedasikkhāpadādīsu vuttanayena visuṃ saṅghamajjhe ca vuccamānā taṃ vatthuṃ appaṭinissajjantī samanubhāsanakammapariyosāne ukkhittānuvattikā nāma pārājikā hotīti."
    ],
    "innerText": "Tatiye ukkhittanti āpattiyā adassanādīsu ukkhittaṃ. Dhammenāti bhūtena vatthunā. Vinayenāti codetvā sāretvā. Satthusāsanenāti idhāpi codetvā sāretvā karaṇameva satthusāsanaṃ nāma. Anādaranti yena saṅghena ukkhepaniyakammaṃ kataṃ, tasmiṃ vā, tattha pariyāpannagaṇe vā ekapuggale vā tasmiṃ vā kamme ādaravirahitaṃ, sammāvattanāya avattamānanti attho. Appaṭikāranti paṭikārarahitaṃ, anosāritanti attho. Akatasahāyanti ekakammādike saṃvāse saha ayanabhāvena samānasaṃvāsakā bhikkhū sahāyā nāma, yassa pana so saṃvāso tehi saddhiṃ natthi na tena te sahāyā katā honti , iti so akatasahāyo nāma, taṃ akatasahāyaṃ, samānasaṃvāsakabhāvaṃ anupagatanti attho. Tamanuvatteyyāti taṃ ukkhittakaṃ ukkhittakabhāveyeva ṭhitaṃ bhikkhuṃ yā bhikkhunī yaṃdiṭṭhiko so hoti, tāya diṭṭhiyā gahaṇabhāvena anuvatteyya. Sā bhikkhunī bhikkhunīhi saṅghabhedasikkhāpadādīsu vuttanayena visuṃ saṅghamajjhe ca vuccamānā taṃ vatthuṃ appaṭinissajjantī samanubhāsanakammapariyosāne ukkhittānuvattikā nāma pārājikā hotīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sāvatthiyaṃ thullanandaṃ ārabbha ukkhittānuvattanavatthusmiṃ paññattaṃ, ñattiyā dukkaṭaṃ, dvīhi kammavācāhi dve thullaccayā, ‘‘yassā nakkhamati, sā bhāseyyā’’ti evaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yya"
      },
      "-kārappattāya tatiyakammavācāya pārājikaṃ, adhammakamme tikadukkaṭaṃ, sesaṃ saṅghabhedasikkhāpadādīsu vuttanayeneva veditabbaṃ."
    ],
    "innerText": "Sāvatthiyaṃ thullanandaṃ ārabbha ukkhittānuvattanavatthusmiṃ paññattaṃ, ñattiyā dukkaṭaṃ, dvīhi kammavācāhi dve thullaccayā, ‘‘yassā nakkhamati, sā bhāseyyā’’ti evaṃ yya-kārappattāya tatiyakammavācāya pārājikaṃ, adhammakamme tikadukkaṭaṃ, sesaṃ saṅghabhedasikkhāpadādīsu vuttanayeneva veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ukkhittānuvattikāsikkhāpadavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Aṭṭhavatthukāsikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Catutthe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avassutā"
      },
      "ti lokassādamittasanthavavasena kāyasaṃsaggarāgena tintā. Ayameva hi attho sīhaḷamātikāṭṭhakathāyaṃ vutto, samantapāsādikāyaṃ (pāci. aṭṭha. 675) panassa vicāraṇā katā, dutiyapadepi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purisapuggalassa hatthaggahaṇaṃ vā"
      },
      "tiādīsu pana yaṃ purisapuggalena hatthe gahaṇaṃ kataṃ, taṃ ‘‘purisapuggalassa hatthaggahaṇa’’nti vuttaṃ, eseva nayo saṅghāṭikaṇṇaggahaṇepi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hatthaggahaṇa"
      },
      "nti ettha ca yassa kassaci apārājikakkhettabhūtassa aṅgassa gahaṇaṃ hatthaggahaṇaṃ, yassa kassaci nivatthassa vā pārutassa vā gahaṇaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṅghāṭikaṇṇaggahaṇaṃ. Santiṭṭheyya vā"
      },
      "tiādīsu kāyasaṃsaggasaṅkhātassa asaddhammassa paṭisevanatthāya purisassa hatthapāse santiṭṭheyya vā, tattha ṭhitā sallapeyya vā, purisena vā ",
      " ‘‘itthannāmaṃ ṭhānaṃ āgacchā’’ti ",
      " vuttā taṃ saṅketaṃ gaccheyya, tassa vā purisassa abbhāgamanaṃ sādiyeyya, yena kenaci vā paṭicchannaṃ okāsaṃ ",
      " paviseyya, purisassa hatthapāse ṭhatvā kāyaṃ upasaṃhareyyāti evamattho daṭṭhabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayampi pārājikā"
      },
      "ti yathā purimāyo, evaṃ ayampi bhikkhunī etassa kāyasaṃsaggasaṅkhātassa asaddhammassa paṭisevanatthāya etāni aṭṭha vatthūni paṭipāṭiyā vā uppaṭipāṭiyā vā pūretvā aṭṭhavatthukā nāma pārājikā hotīti."
    ],
    "innerText": "Catutthe avassutāti lokassādamittasanthavavasena kāyasaṃsaggarāgena tintā. Ayameva hi attho sīhaḷamātikāṭṭhakathāyaṃ vutto, samantapāsādikāyaṃ (pāci. aṭṭha. 675) panassa vicāraṇā katā, dutiyapadepi eseva nayo. Purisapuggalassa hatthaggahaṇaṃ vātiādīsu pana yaṃ purisapuggalena hatthe gahaṇaṃ kataṃ, taṃ ‘‘purisapuggalassa hatthaggahaṇa’’nti vuttaṃ, eseva nayo saṅghāṭikaṇṇaggahaṇepi. Hatthaggahaṇanti ettha ca yassa kassaci apārājikakkhettabhūtassa aṅgassa gahaṇaṃ hatthaggahaṇaṃ, yassa kassaci nivatthassa vā pārutassa vā gahaṇaṃ saṅghāṭikaṇṇaggahaṇaṃ. Santiṭṭheyya vātiādīsu kāyasaṃsaggasaṅkhātassa asaddhammassa paṭisevanatthāya purisassa hatthapāse santiṭṭheyya vā, tattha ṭhitā sallapeyya vā, purisena vā ‘‘itthannāmaṃ ṭhānaṃ āgacchā’’ti vuttā taṃ saṅketaṃ gaccheyya, tassa vā purisassa abbhāgamanaṃ sādiyeyya, yena kenaci vā paṭicchannaṃ okāsaṃ paviseyya, purisassa hatthapāse ṭhatvā kāyaṃ upasaṃhareyyāti evamattho daṭṭhabbo. Ayampi pārājikāti yathā purimāyo, evaṃ ayampi bhikkhunī etassa kāyasaṃsaggasaṅkhātassa asaddhammassa paṭisevanatthāya etāni aṭṭha vatthūni paṭipāṭiyā vā uppaṭipāṭiyā vā pūretvā aṭṭhavatthukā nāma pārājikā hotīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sāvatthiyaṃ chabbaggiyā bhikkhuniyo ārabbha aṭṭhamaṃ vatthuṃ paripūraṇavatthusmiṃ paññattaṃ, saṅketagamane pade pade dukkaṭaṃ, purisassa hatthapāsaṃ okkantamatte thullaccayaṃ, purisassa abbhāgamanasādayamānepi dukkaṭaṃ. Hatthapāsokkamane thullaccayaṃ, sesesu ekekasmiṃ thullaccayameva, aṭṭhame paripuṇṇe pārājikaṃ. Ekekasmiṃ pana vatthusmiṃ satakkhattumpi vītikkante tā āpattiyo desetvā muccati, apicettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gaṇanūpikā"
      },
      " āpatti veditabbā, ‘‘idāni nāpajjissāmī’’ti hi dhuranikkhepaṃ katvā desitā gaṇanūpikā, desitagaṇanaṃ upeti, pārājikassa aṅgaṃ na hoti. Tasmā yā ekaṃ āpannā dhuranikkhepaṃ katvā desetvā puna kilesavasena āpajjati, punapi deseti, evaṃ aṭṭhamaṃ paripūrentīpi pārājikā na hoti. Yā pana āpajjitvā ‘‘punapi aññaṃ vatthuṃ āpajjissāmī’’ti saussāhāva deseti, tassā sā āpatti agaṇanūpikā, desitāpi adesitā hoti, pārājikassa aṅgaṃ hoti. Asañcicca, assatiyā, ajānantiyā asādiyantiyā, ummattikādīnañca anāpatti. Kāyasaṃsaggarāgo, saussāhatā, aṭṭhamassa vatthussa pūraṇanti imānettha tīṇi aṅgāni. Samanubhāsanasamuṭṭhānaṃ, kiriyākiriyaṃ, saññāvimokkhaṃ, sacittakaṃ, lokavajjaṃ, kāyakammaṃ, vacīkammaṃ, akusalacittaṃ, dvivedananti."
    ],
    "innerText": "Sāvatthiyaṃ chabbaggiyā bhikkhuniyo ārabbha aṭṭhamaṃ vatthuṃ paripūraṇavatthusmiṃ paññattaṃ, saṅketagamane pade pade dukkaṭaṃ, purisassa hatthapāsaṃ okkantamatte thullaccayaṃ, purisassa abbhāgamanasādayamānepi dukkaṭaṃ. Hatthapāsokkamane thullaccayaṃ, sesesu ekekasmiṃ thullaccayameva, aṭṭhame paripuṇṇe pārājikaṃ. Ekekasmiṃ pana vatthusmiṃ satakkhattumpi vītikkante tā āpattiyo desetvā muccati, apicettha gaṇanūpikā āpatti veditabbā, ‘‘idāni nāpajjissāmī’’ti hi dhuranikkhepaṃ katvā desitā gaṇanūpikā, desitagaṇanaṃ upeti, pārājikassa aṅgaṃ na hoti. Tasmā yā ekaṃ āpannā dhuranikkhepaṃ katvā desetvā puna kilesavasena āpajjati, punapi deseti, evaṃ aṭṭhamaṃ paripūrentīpi pārājikā na hoti. Yā pana āpajjitvā ‘‘punapi aññaṃ vatthuṃ āpajjissāmī’’ti saussāhāva deseti, tassā sā āpatti agaṇanūpikā, desitāpi adesitā hoti, pārājikassa aṅgaṃ hoti. Asañcicca, assatiyā, ajānantiyā asādiyantiyā, ummattikādīnañca anāpatti. Kāyasaṃsaggarāgo, saussāhatā, aṭṭhamassa vatthussa pūraṇanti imānettha tīṇi aṅgāni. Samanubhāsanasamuṭṭhānaṃ, kiriyākiriyaṃ, saññāvimokkhaṃ, sacittakaṃ, lokavajjaṃ, kāyakammaṃ, vacīkammaṃ, akusalacittaṃ, dvivedananti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Aṭṭhavatthukāsikkhāpadavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uddiṭṭhā kho ayyāyo aṭṭha pārājikā dhammā"
      },
      "ti bhikkhū ārabbha paññattā sādhāraṇā cattāro, ime cattāroti evaṃ pātimokkhuddesamaggena aṭṭha pārājikā dhammā uddiṭṭhāti evamettha attho veditabbo, sesaṃ bhikkhupātimokkhavaṇṇanāyaṃ vuttanayamevāti."
    ],
    "innerText": "Uddiṭṭhā kho ayyāyo aṭṭha pārājikā dhammāti bhikkhū ārabbha paññattā sādhāraṇā cattāro, ime cattāroti evaṃ pātimokkhuddesamaggena aṭṭha pārājikā dhammā uddiṭṭhāti evamettha attho veditabbo, sesaṃ bhikkhupātimokkhavaṇṇanāyaṃ vuttanayamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Kaṅkhāvitaraṇiyā pātimokkhavaṇṇanāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Bhikkhunipātimokkhe"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pārājikavaṇṇanā niṭṭhitā."
  }
]