[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "5. Cammakhandhako"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "147. Soṇakoḷivisavatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "242"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": " . Teena"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "samayena buddho bhagavā rajagahe viharati gijjhakūṭe pabbate. Tena kho pana samayena rājā māgadho seniyo bimbisāro asītiyā gāmasahassesu issariyaādhipaccaṃ rajjaṃ करेजेट. Tena kho pana samayena campāyaṃ soṇo nāma koḷiviso "
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[koḷivīso (sī.)]"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "seṭṭhiputto sukhumālo hoti. Tassa pādatalesu lomāni jātāni honti. Atha kho rājā māgadho seniyo bimbisāro tāni asīti gāmikasahassāni sannipātāpetvā kenacideva karaṇīyena soṇassa koḷivisassa santike dūtaṃ pāhesi – āgacchatu soṇo, icchāmi soṇassa āgatanti. Atha kho soṇassa koḷivisassa mātāpitaro soṇaṃ koḷivisaṃ etadavocuṃ – ''rājā te, tāta soṇa, pāde dakkhitukāmo. Mā kho tvaṃ, tāta soṇa, yena rājā tena pāde abhippasāreyyāsi. Rañño purato pallaṅkena nisida. Nisinnassa te rājā pāde dakkhissātī''ti. Atha kho soṇaṃ koḷivisaṃ sivikāya ānesuṃ. Atha kho soṇo koḷiviso yena rājā māgadho seniyo bimbisāro tenupasaṅkami, upasaṅkamitvā rājānaṃ māgadhaṃ seniyaṃ bimbisāraṃ abhivādetvā rañño purato pallaṅkena nisīdi. Addasā"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "kho rājā māgadho seniyo bimbisāro soṇassa koḷivisassa pādatalesu lomāni jātāni. Atha kho rājā māgadho seniyo bimbisāro tāni asīti gāmikasahassāni diṭṭhadhammike at the anusāsitvā uyyojesi—''you khvattha, bhaṇe, mayā diṭṭhadhammike at the anusāsitā; gacchatha, taṃ bhagavantaṃ payirupāsatha; so no bhagavā samparāyike atthe anusāsissatī''ti."
      }
    ],
    "innerText": "242 . Teenasamayena buddho bhagavā rajagahe viharati gijjhakūṭe pabbate. Tena kho pana samayena rājā māgadho seniyo bimbisāro asītiyā gāmasahassesu issariyaādhipaccaṃ rajjaṃ करेजेट. Tena kho pana samayena campāyaṃ soṇo nāma koḷiviso [koḷivīso (sī.)]seṭṭhiputto sukhumālo hoti. Tassa pādatalesu lomāni jātāni honti. Atha kho rājā māgadho seniyo bimbisāro tāni asīti gāmikasahassāni sannipātāpetvā kenacideva karaṇīyena soṇassa koḷivisassa santike dūtaṃ pāhesi – āgacchatu soṇo, icchāmi soṇassa āgatanti. Atha kho soṇassa koḷivisassa mātāpitaro soṇaṃ koḷivisaṃ etadavocuṃ – ''rājā te, tāta soṇa, pāde dakkhitukāmo. Mā kho tvaṃ, tāta soṇa, yena rājā tena pāde abhippasāreyyāsi. Rañño purato pallaṅkena nisida. Nisinnassa te rājā pāde dakkhissātī''ti. Atha kho soṇaṃ koḷivisaṃ sivikāya ānesuṃ. Atha kho soṇo koḷiviso yena rājā māgadho seniyo bimbisāro tenupasaṅkami, upasaṅkamitvā rājānaṃ māgadhaṃ seniyaṃ bimbisāraṃ abhivādetvā rañño purato pallaṅkena nisīdi. Addasākho rājā māgadho seniyo bimbisāro soṇassa koḷivisassa pādatalesu lomāni jātāni. Atha kho rājā māgadho seniyo bimbisāro tāni asīti gāmikasahassāni diṭṭhadhammike at the anusāsitvā uyyojesi—''you khvattha, bhaṇe, mayā diṭṭhadhammike at the anusāsitā; gacchatha, taṃ bhagavantaṃ payirupāsatha; so no bhagavā samparāyike atthe anusāsissatī''ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "Atha kho tāni asīti gāmikasahassāni yena gijjhakūṭo pabbato tenupasaṅkamiṃsu. Whenever you see the divine grace, you will be blessed. Atha kho tāni asīti gāmikasahassāni yenāyasmā sāgato tenupasaṅkamiṃsu, upasaṅkamitvā āyasmantaṃ"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "sāgataṃ etadavocuṃ"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "– ''imāni, bhante, asīti gāmikasahassāni idhūpasaṅkantāni bhagavantaṃ dassanāya; sādhu mayaṃ, bhante, labheyyāma bhagavantaṃ dassanāyā''ti. ''Tena hi tumhe āyasmanto muhuttaṃ idheva tāva hotha, yāvāhaṃ bhagavantaṃ paṭivedemī''ti. Atha kho āyasmā sāgato tesaṃ asītiyā gāmikasahassānaṃ purato pekkhamānānaṃ pāṭikāya nimujjitvā bhagavato purato ummujjitvā bhagavantaṃ etadavoca – ''imāni, bhante, asīti gāmikasahassāni idhūpasaṅkantāni bhagavantaṃ dassanāya; yassa dāni, bhante, bhagavā kālaṃ maññatī''ti. ''Tena hi tvaṃ, sāgata, vihārapacchāyāyaṃ āsanaṃ paññapehī''ti. ''Evaṃ, bhante''ti kho āyasmā sāgato"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "bhagavato paṭissuṇitvā pīṭhaṃ gahetvā bhagavato purato nimujjitvā tesaṃ asītiyā gāmikasahassānaṃ purato pekkhamānānaṃ pāṭikāya ummujjitvā vihārapacchāyāyaṃ āsanaṃ paññapeti. Atha kho bhagavā vihāra nikkhamitvā vihārapacchāyāyaṃ paññatte āsane nisīdi. Atha kho tāni asīti gāmikasahassāni yena bhagavā tenupasaṅkamiṃsu, upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Atha kho tāni asīti gāmikasahassāni āyasmantaṃyeva sāgataṃ samannāharanti, no tathā bhagavantaṃ. Atha kho bhagavā tesaṃ asītiyā gāmikasahassānaṃ cetasā cetoparivitakkamaññaya āyasmantaṃ sāgataṃ āmantesi – ''tena hi tvaṃ, sāgata, bhiyyosomattāya uttarimanussadhammaṃ iddhipāṭihāriyaṃ dassehī''ti. ''Evaṃ, bhante''ti kho āyasmā sāgato bhagavato paṭissuṇitvā vehāsaṃ abbhuggantvā ākāse antalikkhe caṅkamatipi, tiṭṭhatipi, nisīdatipi, seyyampi kappeti, dhūmāyatipi."
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[dhūpāyatipi (sī.), padhūpāyatipi (syā.)]"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": " pajjalatipi, antaradhāyatipi. Atha kho āyasmā sāgato ākāse antalikkhe anekavihitaṃ uttarimanussadhammaṃ iddhipāṭihāriyaṃ dassetvā bhagavato pādesu sirasā nipatitvā bhagavantaṃ etadavoca—''satthā me, bhante, bhagavā; sāvakohamasmi. Satthā me, bhante, bhagavā; sāvakohamasmī''ti. Atha kho tāni asīti gāmikasahassāni ''acchariyaṃ vata bho! Abbhutaṃ vata bho! Sāvakopi nāma evaṃ mahiddhiko bhavissati, evaṃ mahānubhāvo, aho nūna satthā''ti bhagavantaṃyeva samannāharanti, no"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "tathā āyasmantaṃ sāgataṃ."
      }
    ],
    "innerText": "Atha kho tāni asīti gāmikasahassāni yena gijjhakūṭo pabbato tenupasaṅkamiṃsu. Whenever you see the divine grace, you will be blessed. Atha kho tāni asīti gāmikasahassāni yenāyasmā sāgato tenupasaṅkamiṃsu, upasaṅkamitvā āyasmantaṃsāgataṃ etadavocuṃ– ''imāni, bhante, asīti gāmikasahassāni idhūpasaṅkantāni bhagavantaṃ dassanāya; sādhu mayaṃ, bhante, labheyyāma bhagavantaṃ dassanāyā''ti. ''Tena hi tumhe āyasmanto muhuttaṃ idheva tāva hotha, yāvāhaṃ bhagavantaṃ paṭivedemī''ti. Atha kho āyasmā sāgato tesaṃ asītiyā gāmikasahassānaṃ purato pekkhamānānaṃ pāṭikāya nimujjitvā bhagavato purato ummujjitvā bhagavantaṃ etadavoca – ''imāni, bhante, asīti gāmikasahassāni idhūpasaṅkantāni bhagavantaṃ dassanāya; yassa dāni, bhante, bhagavā kālaṃ maññatī''ti. ''Tena hi tvaṃ, sāgata, vihārapacchāyāyaṃ āsanaṃ paññapehī''ti. ''Evaṃ, bhante''ti kho āyasmā sāgatobhagavato paṭissuṇitvā pīṭhaṃ gahetvā bhagavato purato nimujjitvā tesaṃ asītiyā gāmikasahassānaṃ purato pekkhamānānaṃ pāṭikāya ummujjitvā vihārapacchāyāyaṃ āsanaṃ paññapeti. Atha kho bhagavā vihāra nikkhamitvā vihārapacchāyāyaṃ paññatte āsane nisīdi. Atha kho tāni asīti gāmikasahassāni yena bhagavā tenupasaṅkamiṃsu, upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Atha kho tāni asīti gāmikasahassāni āyasmantaṃyeva sāgataṃ samannāharanti, no tathā bhagavantaṃ. Atha kho bhagavā tesaṃ asītiyā gāmikasahassānaṃ cetasā cetoparivitakkamaññaya āyasmantaṃ sāgataṃ āmantesi – ''tena hi tvaṃ, sāgata, bhiyyosomattāya uttarimanussadhammaṃ iddhipāṭihāriyaṃ dassehī''ti. ''Evaṃ, bhante''ti kho āyasmā sāgato bhagavato paṭissuṇitvā vehāsaṃ abbhuggantvā ākāse antalikkhe caṅkamatipi, tiṭṭhatipi, nisīdatipi, seyyampi kappeti, dhūmāyatipi.[dhūpāyatipi (sī.), padhūpāyatipi (syā.)] pajjalatipi, antaradhāyatipi. Atha kho āyasmā sāgato ākāse antalikkhe anekavihitaṃ uttarimanussadhammaṃ iddhipāṭihāriyaṃ dassetvā bhagavato pādesu sirasā nipatitvā bhagavantaṃ etadavoca—''satthā me, bhante, bhagavā; sāvakohamasmi. Satthā me, bhante, bhagavā; sāvakohamasmī''ti. Atha kho tāni asīti gāmikasahassāni ''acchariyaṃ vata bho! Abbhutaṃ vata bho! Sāvakopi nāma evaṃ mahiddhiko bhavissati, evaṃ mahānubhāvo, aho nūna satthā''ti bhagavantaṃyeva samannāharanti, notathā āyasmantaṃ sāgataṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "atha"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "kho bhagavā tesaṃ asītiyā gāmikasahassānaṃ cetasā cetoparivitakkamaññāya anupubbiṃ kathaṃ kathesi, seyyathidaṃ – dānakathaṃ sīlakathaṃ saggakathaṃ"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": ", kāmānaṃ ādīnavaṃ okāraṃ saṃkilesaṃ, nekkhamme ānisaṃsaṃ pakāsesi. Yadā te bhagavā aññāsi kallacitte, muducitte, vinīvaraṇacitte, udaggacitte, pasannacitte, atha yā buddhānaṃ sāmukkaṃsikā dhammadesanā, taṃ pakāsesi – dukkhaṃ, samudayaṃ, nirodhaṃ, maggaṃ. Seyyathāpi nāma suddhaṃ vatthaṃ apagatakāḷakaṃ sammadeva rajanaṃ paṭiggaṇheyya, evamevaṃ tesaṃ asītiyā gāmikasahassānaṃ tasmiṃyeva āsane virajaṃ"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": "vītamalaṃ dhammacakkhuṃ udapādi – ''yaṃkiñci samudayadhammaṃ, sabbaṃ taṃ nirodhadhamma''nti. Te diṭṭhadhammā pattadhammā viditadhammā pariyogāḷhadhammā tiṇṇavicikicchā vigatakathaṃkathā vesārajjappattā aparappaccayā satthusāsane bhagavantaṃ etadavocuṃ – ''abhikkantaṃ, bhante, abhikkantaṃ, bhante. Seyyathāpi, bhante, nikkujjitaṃ vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya – ''cakkhumanto rūpāni dakkhantī''ti, evamevaṃ bhagavatā anekapariyayena dhammo pakāsito. Ete mayaṃ, bhante, bhagavantaṃ saraṇaṃ gacchāma. Dhammañca, bhikkhusaṅghañca. Upāsake no bhagavā dhāretu ajjatagge pāṇupete saraṇaṃ gate''ti."
      }
    ],
    "innerText": "athakho bhagavā tesaṃ asītiyā gāmikasahassānaṃ cetasā cetoparivitakkamaññāya anupubbiṃ kathaṃ kathesi, seyyathidaṃ – dānakathaṃ sīlakathaṃ saggakathaṃ, kāmānaṃ ādīnavaṃ okāraṃ saṃkilesaṃ, nekkhamme ānisaṃsaṃ pakāsesi. Yadā te bhagavā aññāsi kallacitte, muducitte, vinīvaraṇacitte, udaggacitte, pasannacitte, atha yā buddhānaṃ sāmukkaṃsikā dhammadesanā, taṃ pakāsesi – dukkhaṃ, samudayaṃ, nirodhaṃ, maggaṃ. Seyyathāpi nāma suddhaṃ vatthaṃ apagatakāḷakaṃ sammadeva rajanaṃ paṭiggaṇheyya, evamevaṃ tesaṃ asītiyā gāmikasahassānaṃ tasmiṃyeva āsane virajaṃvītamalaṃ dhammacakkhuṃ udapādi – ''yaṃkiñci samudayadhammaṃ, sabbaṃ taṃ nirodhadhamma''nti. Te diṭṭhadhammā pattadhammā viditadhammā pariyogāḷhadhammā tiṇṇavicikicchā vigatakathaṃkathā vesārajjappattā aparappaccayā satthusāsane bhagavantaṃ etadavocuṃ – ''abhikkantaṃ, bhante, abhikkantaṃ, bhante. Seyyathāpi, bhante, nikkujjitaṃ vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya – ''cakkhumanto rūpāni dakkhantī''ti, evamevaṃ bhagavatā anekapariyayena dhammo pakāsito. Ete mayaṃ, bhante, bhagavantaṃ saraṇaṃ gacchāma. Dhammañca, bhikkhusaṅghañca. Upāsake no bhagavā dhāretu ajjatagge pāṇupete saraṇaṃ gate''ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Soṇassa pabbajjā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "243"
      },
      {
        "tagName": "font",
        "attributes": {
          "name": "style",
          "value": "vertical-align: inherit;"
        },
        "innerText": " . Atha kho soṇassa koḷivisassa etadahosi ''yathā yathā kho ahaṃ"
      },
      " bhagavatā dhammaṃ desitaṃ ājānāmi, nayidaṃ sukaraṃ agāraṃ ajjhāvasatā ekantaparipuṇṇaṃ ekantaparisuddhaṃ saṅkhalikhitaṃ brahmacariyaṃ carituṃ; yaṃnūnāhaṃ kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajeyya’’nti. Atha kho tāni asīti gāmikasahassāni bhagavato bhāsitaṃ abhinanditvā anumoditvā uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkamisuṃ. Atha kho soṇo koḷiviso acirapakkantesu tesu asītiyā gāmikasahassesu yena bhagavā tenupasaṅkami, upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho soṇo koḷiviso bhagavantaṃ etadavoca – ‘‘yathā yathāhaṃ, bhante, bhagavatā dhammaṃ desitaṃ ājānāmi, nayidaṃ sukaraṃ agāraṃ ajjhāvasatā ekantaparipuṇṇaṃ ekantaparisuddhaṃ saṅkhalikhitaṃ brahmacariyaṃ carituṃ. Icchāmahaṃ, bhante, kesamassuṃ ohāretvā ",
      " kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajituṃ. Pabbājetu maṃ, bhante, bhagavā’’ti. Alattha kho soṇo koḷiviso bhagavato santike pabbajjaṃ, alattha upasampadaṃ. Acirupasampanno ca ",
      " panāyasmā soṇo sītavane viharati. Tassa accāraddhavīriyassa caṅkamato pādā bhijjiṃsu. Caṅkamo lohitena phuṭo hoti, seyyathāpi gavāghātanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ito paraṃ yāva imassa vatthussa avasānaṃ tāva pāṭho a. ni. 6.55 ādayo]"
      },
      " Atha kho āyasmato soṇassa rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘‘ye ",
      " kho keci bhagavato sāvakā āraddhavīriyā viharanti, ahaṃ tesaṃ aññataro. Atha ca pana me nānupādāya āsavehi cittaṃ vimuccati. Saṃvijjanti kho pana me kule bhogā; sakkā bhoge ca bhuñjituṃ, puññāni ca kātuṃ. Yaṃnūnāhaṃ hīnāyāvattitvā bhoge ca bhuñjeyyaṃ, puññāni ca kareyya’’nti. Atha kho bhagavā āyasmato soṇassa cetasā cetoparivitakkamaññāya – seyyathāpi ",
      " nāma balavā puriso samiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya evameva – gijjhakūṭe pabbate antarahito sītavane pāturahosi. Atha kho bhagavā sambahulehi bhikkhūhi saddhiṃ senāsanacārikaṃ āhiṇḍanto yenāyasmato soṇassa caṅkamo tenupasaṅkami. Addasā kho bhagavā āyasmato soṇassa caṅkamaṃ lohitena phuṭaṃ, disvāna bhikkhū āmantesi – ‘‘kassa nvāyaṃ, bhikkhave, caṅkamo lohitena phuṭo, seyyathāpi gavāghātana’’nti? ‘‘Āyasmato, bhante, soṇassa accāraddhavīriyassa caṅkamato pādā bhijjiṃsu. Tassāyaṃ caṅkamo lohitena phuṭo, seyyathāpi gavāghātana’’nti."
    ],
    "innerText": "243 . Atha kho soṇassa koḷivisassa etadahosi ''yathā yathā kho ahaṃ bhagavatā dhammaṃ desitaṃ ājānāmi, nayidaṃ sukaraṃ agāraṃ ajjhāvasatā ekantaparipuṇṇaṃ ekantaparisuddhaṃ saṅkhalikhitaṃ brahmacariyaṃ carituṃ; yaṃnūnāhaṃ kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajeyya’’nti. Atha kho tāni asīti gāmikasahassāni bhagavato bhāsitaṃ abhinanditvā anumoditvā uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkamisuṃ. Atha kho soṇo koḷiviso acirapakkantesu tesu asītiyā gāmikasahassesu yena bhagavā tenupasaṅkami, upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho soṇo koḷiviso bhagavantaṃ etadavoca – ‘‘yathā yathāhaṃ, bhante, bhagavatā dhammaṃ desitaṃ ājānāmi, nayidaṃ sukaraṃ agāraṃ ajjhāvasatā ekantaparipuṇṇaṃ ekantaparisuddhaṃ saṅkhalikhitaṃ brahmacariyaṃ carituṃ. Icchāmahaṃ, bhante, kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajituṃ. Pabbājetu maṃ, bhante, bhagavā’’ti. Alattha kho soṇo koḷiviso bhagavato santike pabbajjaṃ, alattha upasampadaṃ. Acirupasampanno ca panāyasmā soṇo sītavane viharati. Tassa accāraddhavīriyassa caṅkamato pādā bhijjiṃsu. Caṅkamo lohitena phuṭo hoti, seyyathāpi gavāghātanaṃ. [ito paraṃ yāva imassa vatthussa avasānaṃ tāva pāṭho a. ni. 6.55 ādayo] Atha kho āyasmato soṇassa rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘‘ye kho keci bhagavato sāvakā āraddhavīriyā viharanti, ahaṃ tesaṃ aññataro. Atha ca pana me nānupādāya āsavehi cittaṃ vimuccati. Saṃvijjanti kho pana me kule bhogā; sakkā bhoge ca bhuñjituṃ, puññāni ca kātuṃ. Yaṃnūnāhaṃ hīnāyāvattitvā bhoge ca bhuñjeyyaṃ, puññāni ca kareyya’’nti. Atha kho bhagavā āyasmato soṇassa cetasā cetoparivitakkamaññāya – seyyathāpi nāma balavā puriso samiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya evameva – gijjhakūṭe pabbate antarahito sītavane pāturahosi. Atha kho bhagavā sambahulehi bhikkhūhi saddhiṃ senāsanacārikaṃ āhiṇḍanto yenāyasmato soṇassa caṅkamo tenupasaṅkami. Addasā kho bhagavā āyasmato soṇassa caṅkamaṃ lohitena phuṭaṃ, disvāna bhikkhū āmantesi – ‘‘kassa nvāyaṃ, bhikkhave, caṅkamo lohitena phuṭo, seyyathāpi gavāghātana’’nti? ‘‘Āyasmato, bhante, soṇassa accāraddhavīriyassa caṅkamato pādā bhijjiṃsu. Tassāyaṃ caṅkamo lohitena phuṭo, seyyathāpi gavāghātana’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho bhagavā yenāyasmato soṇassa vihāro tenupasaṅkami, upasaṅkamitvā paññatte āsane nisīdi. Āyasmāpi kho soṇo bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ soṇaṃ bhagavā etadavoca – ‘‘nanu te, soṇa, rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘ye kho keci bhagavato sāvakā āraddhavīriyā viharanti, ahaṃ ",
      " tesaṃ aññataro. Atha ca pana me nānupādāya āsavehi cittaṃ vimuccati. Saṃvijjanti kho pana me kule bhogā; sakkā bhoge ca bhuñjituṃ, puññāni ca kātuṃ. Yaṃnūnāhaṃ hīnāyāvattitvā bhoge ca bhuñjeyyaṃ, puññāni ca kareyya’’’nti? ‘‘Evaṃ, bhante’’ti ",
      ". ‘‘Taṃ kiṃ maññasi, soṇa, kusalo tvaṃ pubbe agārikabhūto vīṇāya tantissare’’ti? ‘‘Evaṃ, bhante’’ti. ‘‘Taṃ kiṃ maññasi, soṇa, yadā te vīṇāya tantiyo accāyatā honti, api nu te vīṇā tasmiṃ samaye saravatī vā hoti, kammaññā vā’’ti? ‘‘No hetaṃ, bhante’’ti. ‘‘Taṃ kiṃ maññasi, soṇa, yadā te vīṇāya tantiyo atisithilā honti, api nu te vīṇā tasmiṃ samaye saravatī vā hoti, kammaññā vā’’ti? ‘‘No hetaṃ, bhante’’ti. ‘‘Taṃ kiṃ maññasi, soṇa, yadā te vīṇāya tantiyo neva accāyatā honti nātisithilā, same guṇe patiṭṭhitā, api nu te vīṇā tasmiṃ samaye saravatī vā hoti, kammaññā vā’’ti? ‘‘Evaṃ, bhante’’ti. ‘‘Evameva kho, soṇa, accāraddhavīriyaṃ uddhaccāya saṃvattati ",
      ", atilīnavīriyaṃ kosajjāya saṃvattati. Tasmātiha tvaṃ, soṇa, vīriyasamataṃ adhiṭṭhaha, indriyānañca samataṃ paṭivijjha, tattha ca nimittaṃ gaṇhāhī’’ti. ‘‘Evaṃ, bhante’’ti kho āyasmā soṇo bhagavato paccassosi. Atha kho bhagavā āyasmantaṃ soṇaṃ iminā ovādena ovaditvā – seyyathāpi nāma balavā puriso ",
      " sammiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya evameva – sītavane āyasmato soṇassa sammukhe antarahito gijjhakūṭe pabbate pāturahosi. Atha kho āyasmā soṇo aparena samayena vīriyasamataṃ adhiṭṭhāsi, indriyānañca samataṃ paṭivijjhi, tattha ca nimittaṃ ",
      " aggahesi. Atha kho āyasmā soṇo, eko vūpakaṭṭho appamatto ātāpī pahitatto viharanto, na cirasseva – yassatthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti – tadanuttaraṃ brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihāsi. ‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti abhiññāsi. Aññataro ca panāyasmā soṇo arahataṃ ahosi."
    ],
    "innerText": "Atha kho bhagavā yenāyasmato soṇassa vihāro tenupasaṅkami, upasaṅkamitvā paññatte āsane nisīdi. Āyasmāpi kho soṇo bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ soṇaṃ bhagavā etadavoca – ‘‘nanu te, soṇa, rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘ye kho keci bhagavato sāvakā āraddhavīriyā viharanti, ahaṃ tesaṃ aññataro. Atha ca pana me nānupādāya āsavehi cittaṃ vimuccati. Saṃvijjanti kho pana me kule bhogā; sakkā bhoge ca bhuñjituṃ, puññāni ca kātuṃ. Yaṃnūnāhaṃ hīnāyāvattitvā bhoge ca bhuñjeyyaṃ, puññāni ca kareyya’’’nti? ‘‘Evaṃ, bhante’’ti . ‘‘Taṃ kiṃ maññasi, soṇa, kusalo tvaṃ pubbe agārikabhūto vīṇāya tantissare’’ti? ‘‘Evaṃ, bhante’’ti. ‘‘Taṃ kiṃ maññasi, soṇa, yadā te vīṇāya tantiyo accāyatā honti, api nu te vīṇā tasmiṃ samaye saravatī vā hoti, kammaññā vā’’ti? ‘‘No hetaṃ, bhante’’ti. ‘‘Taṃ kiṃ maññasi, soṇa, yadā te vīṇāya tantiyo atisithilā honti, api nu te vīṇā tasmiṃ samaye saravatī vā hoti, kammaññā vā’’ti? ‘‘No hetaṃ, bhante’’ti. ‘‘Taṃ kiṃ maññasi, soṇa, yadā te vīṇāya tantiyo neva accāyatā honti nātisithilā, same guṇe patiṭṭhitā, api nu te vīṇā tasmiṃ samaye saravatī vā hoti, kammaññā vā’’ti? ‘‘Evaṃ, bhante’’ti. ‘‘Evameva kho, soṇa, accāraddhavīriyaṃ uddhaccāya saṃvattati , atilīnavīriyaṃ kosajjāya saṃvattati. Tasmātiha tvaṃ, soṇa, vīriyasamataṃ adhiṭṭhaha, indriyānañca samataṃ paṭivijjha, tattha ca nimittaṃ gaṇhāhī’’ti. ‘‘Evaṃ, bhante’’ti kho āyasmā soṇo bhagavato paccassosi. Atha kho bhagavā āyasmantaṃ soṇaṃ iminā ovādena ovaditvā – seyyathāpi nāma balavā puriso sammiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya evameva – sītavane āyasmato soṇassa sammukhe antarahito gijjhakūṭe pabbate pāturahosi. Atha kho āyasmā soṇo aparena samayena vīriyasamataṃ adhiṭṭhāsi, indriyānañca samataṃ paṭivijjhi, tattha ca nimittaṃ aggahesi. Atha kho āyasmā soṇo, eko vūpakaṭṭho appamatto ātāpī pahitatto viharanto, na cirasseva – yassatthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti – tadanuttaraṃ brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihāsi. ‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti abhiññāsi. Aññataro ca panāyasmā soṇo arahataṃ ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "244"
      },
      ". Atha kho āyasmato soṇassa arahattappattassa etadahosi – ‘‘yaṃnūnāhaṃ bhagavato santike aññaṃ byākareyya’’nti. Atha kho āyasmā soṇo yena bhagavā tenupasaṅkami, upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā soṇo bhagavantaṃ etadavoca – yo so, bhante, bhikkhu arahaṃ khīṇāsavo vusitavā katakaraṇīyo ohitabhāro anuppattasadattho parikkhīṇabhavasaññojano ",
      " sammadaññā vimutto, so chaṭṭhānāni adhimutto hoti – nekkhammādhimutto hoti, pavivekādhimutto hoti, abyāpajjādhimutto hoti, upādānakkhayādhimutto hoti, taṇhakkhayādhimutto hoti ",
      ", asammohādhimutto hoti."
    ],
    "innerText": "244. Atha kho āyasmato soṇassa arahattappattassa etadahosi – ‘‘yaṃnūnāhaṃ bhagavato santike aññaṃ byākareyya’’nti. Atha kho āyasmā soṇo yena bhagavā tenupasaṅkami, upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā soṇo bhagavantaṃ etadavoca – yo so, bhante, bhikkhu arahaṃ khīṇāsavo vusitavā katakaraṇīyo ohitabhāro anuppattasadattho parikkhīṇabhavasaññojano sammadaññā vimutto, so chaṭṭhānāni adhimutto hoti – nekkhammādhimutto hoti, pavivekādhimutto hoti, abyāpajjādhimutto hoti, upādānakkhayādhimutto hoti, taṇhakkhayādhimutto hoti , asammohādhimutto hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Siyā kho pana, bhante, idhekaccassa āyasmato evamassa – ‘kevalaṃ saddhāmattakaṃ nūna ayamāyasmā nissāya nekkhammādhimutto’ti, na kho panetaṃ, bhante, evaṃ daṭṭhabbaṃ. Khīṇāsavo, bhante, bhikkhu, vusitavā, katakaraṇīyo, karaṇīyamattānaṃ asamanupassanto katassa vā paṭicayaṃ khayā rāgassa vītarāgattā nekkhammādhimutto hoti, khayā dosassa vītadosattā nekkhammādhimutto hoti, khayā mohassa vītamohattā nekkhammādhimutto hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Siyā kho pana, bhante, idhekaccassa āyasmato evamassa – ‘lābhasakkārasilokaṃ nūna ayamāyasmā nikāmayamāno ",
      " pavivekādhimutto’ti. Na kho panetaṃ, bhante, evaṃ daṭṭhabbaṃ. Khīṇāsavo, bhante, bhikkhu, vusitavā, katakaraṇīyo, karaṇīyamattānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[karaṇīyaṃ attano (aṅguttarapāḷiyaṃ)]"
      },
      " asamanupassanto katassa vā paṭicayaṃ, khayā rāgassa vītarāgattā pavivekādhimutto hoti, khayā dosassa vītadosattā pavivekādhimutto hoti, khayā mohassa vītamohattā pavivekādhimutto hoti."
    ],
    "innerText": "‘‘Siyā kho pana, bhante, idhekaccassa āyasmato evamassa – ‘lābhasakkārasilokaṃ nūna ayamāyasmā nikāmayamāno pavivekādhimutto’ti. Na kho panetaṃ, bhante, evaṃ daṭṭhabbaṃ. Khīṇāsavo, bhante, bhikkhu, vusitavā, katakaraṇīyo, karaṇīyamattānaṃ [karaṇīyaṃ attano (aṅguttarapāḷiyaṃ)] asamanupassanto katassa vā paṭicayaṃ, khayā rāgassa vītarāgattā pavivekādhimutto hoti, khayā dosassa vītadosattā pavivekādhimutto hoti, khayā mohassa vītamohattā pavivekādhimutto hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Siyā kho pana, bhante, idhekaccassa āyasmato evamassa – ‘sīlabbataparāmāsaṃ nūna ayamāyasmā sārato paccāgacchanto abyāpajjādhimutto’ti. Na kho panetaṃ, bhante, evaṃ daṭṭhabbaṃ. Khīṇāsavo, bhante, bhikkhu, vusitavā, katakaraṇīyo, karaṇīyamattānaṃ asamanupassanto ",
      " katassa vā paṭicayaṃ, khayā rāgassa vītarāgattā abyāpajjādhimutto hoti, khayā dosassa vītadosattā abyāpajjādhimutto hoti, khayā mohassa vītamohattā abyāpajjādhimutto ",
      " hoti."
    ],
    "innerText": "‘‘Siyā kho pana, bhante, idhekaccassa āyasmato evamassa – ‘sīlabbataparāmāsaṃ nūna ayamāyasmā sārato paccāgacchanto abyāpajjādhimutto’ti. Na kho panetaṃ, bhante, evaṃ daṭṭhabbaṃ. Khīṇāsavo, bhante, bhikkhu, vusitavā, katakaraṇīyo, karaṇīyamattānaṃ asamanupassanto katassa vā paṭicayaṃ, khayā rāgassa vītarāgattā abyāpajjādhimutto hoti, khayā dosassa vītadosattā abyāpajjādhimutto hoti, khayā mohassa vītamohattā abyāpajjādhimutto hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Khayā rāgassa vītarāgattā upādānakkhayādhimutto hoti, khayā dosassa vītadosattā upādānakkhayādhimutto hoti, khayā mohassa vītamohattā upādānakkhayādhimutto hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Khayā ",
      " rāgassa vītarāgattā taṇhakkhayādhimutto hoti, khayā dosassa vītadosattā taṇhakkhayādhimutto hoti, khayā mohassa vītamohattā taṇhakkhayādhimutto hoti."
    ],
    "innerText": "‘‘Khayā rāgassa vītarāgattā taṇhakkhayādhimutto hoti, khayā dosassa vītadosattā taṇhakkhayādhimutto hoti, khayā mohassa vītamohattā taṇhakkhayādhimutto hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Khayā rāgassa vītarāgattā asammohādhimutto hoti, khayā dosassa vītadosattā asammohādhimutto hoti, khayā mohassa vītamohattā asammohādhimutto hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Evaṃ sammā vimuttacittassa, bhante, bhikkhuno bhusā cepi cakkhuviññeyyā rūpā cakkhussa āpāthaṃ āgacchanti, nevassa cittaṃ pariyādiyanti. Amissīkatamevassa cittaṃ hoti, ṭhitaṃ, āneñjappattaṃ, vayañcassānupassati. Bhusā cepi sotaviññeyyā saddā…pe… ghānaviññeyyā gandhā… jivhāviññeyyā rasā… kāyaviññeyyā phoṭṭhabbā… manoviññeyyā dhammā manassa āpāthaṃ āgacchanti, nevassa cittaṃ pariyādiyanti; amissīkatamevassa cittaṃ hoti, ṭhitaṃ, āneñjappattaṃ, vayañcassānupassati. Seyyathāpi, bhante, selo pabbato acchiddo asusiro ekagghano, puratthimāya cepi disāya āgaccheyya bhusā vātavuṭṭhi, neva naṃ saṅkampeyya na sampakampeyya na sampavedheyya; pacchimāya cepi disāya āgaccheyya bhusā ",
      " vātavuṭṭhi…pe… uttarāya cepi disāya…pe… dakkhiṇāya cepi disāya āgaccheyya bhusā vātavuṭṭhi, neva naṃ saṅkampeyya na sampakampeyya na sampavedheyya, evameva kho, bhante, evaṃ sammā vimuttacittassa bhikkhuno bhusā cepi cakkhuviññeyyā rūpā cakkhussa āpāthaṃ āgacchanti, nevassa cittaṃ pariyādiyanti; amissīkatamevassa cittaṃ hoti, ṭhitaṃ, āneñjappattaṃ, vayañcassānupassati. Bhusā cepi sotaviññeyyā saddā…pe… ghānaviññeyyā gandhā… jivhāviññeyyā rasā… kāyaviññeyyā phoṭṭhabbā… manoviññeyyā dhammā manassa āpāthaṃ āgacchanti, nevassa cittaṃ pariyādiyanti; amissīkatamevassa cittaṃ hoti, ṭhitaṃ, āneñjappattaṃ, vayañcassānupassatī’’ti."
    ],
    "innerText": "‘‘Evaṃ sammā vimuttacittassa, bhante, bhikkhuno bhusā cepi cakkhuviññeyyā rūpā cakkhussa āpāthaṃ āgacchanti, nevassa cittaṃ pariyādiyanti. Amissīkatamevassa cittaṃ hoti, ṭhitaṃ, āneñjappattaṃ, vayañcassānupassati. Bhusā cepi sotaviññeyyā saddā…pe… ghānaviññeyyā gandhā… jivhāviññeyyā rasā… kāyaviññeyyā phoṭṭhabbā… manoviññeyyā dhammā manassa āpāthaṃ āgacchanti, nevassa cittaṃ pariyādiyanti; amissīkatamevassa cittaṃ hoti, ṭhitaṃ, āneñjappattaṃ, vayañcassānupassati. Seyyathāpi, bhante, selo pabbato acchiddo asusiro ekagghano, puratthimāya cepi disāya āgaccheyya bhusā vātavuṭṭhi, neva naṃ saṅkampeyya na sampakampeyya na sampavedheyya; pacchimāya cepi disāya āgaccheyya bhusā vātavuṭṭhi…pe… uttarāya cepi disāya…pe… dakkhiṇāya cepi disāya āgaccheyya bhusā vātavuṭṭhi, neva naṃ saṅkampeyya na sampakampeyya na sampavedheyya, evameva kho, bhante, evaṃ sammā vimuttacittassa bhikkhuno bhusā cepi cakkhuviññeyyā rūpā cakkhussa āpāthaṃ āgacchanti, nevassa cittaṃ pariyādiyanti; amissīkatamevassa cittaṃ hoti, ṭhitaṃ, āneñjappattaṃ, vayañcassānupassati. Bhusā cepi sotaviññeyyā saddā…pe… ghānaviññeyyā gandhā… jivhāviññeyyā rasā… kāyaviññeyyā phoṭṭhabbā… manoviññeyyā dhammā manassa āpāthaṃ āgacchanti, nevassa cittaṃ pariyādiyanti; amissīkatamevassa cittaṃ hoti, ṭhitaṃ, āneñjappattaṃ, vayañcassānupassatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Nekkhammaṃ ",
      " adhimuttassa, pavivekañca cetaso;"
    ],
    "innerText": "Nekkhammaṃ adhimuttassa, pavivekañca cetaso;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Abyāpajjādhimuttassa, upādānakkhayassa ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Taṇhakkhayādhimuttassa ",
      ", asammohañca cetaso;"
    ],
    "innerText": "Taṇhakkhayādhimuttassa , asammohañca cetaso;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Disvā āyatanuppādaṃ, sammā cittaṃ vimuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Tassa ",
      " sammāvimuttassa, santacittassa bhikkhuno;"
    ],
    "innerText": "Tassa sammāvimuttassa, santacittassa bhikkhuno;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Katassa paṭicayo natthi, karaṇīyaṃ na vijjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Selo yathā ekagghano, vātena na samīrati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Evaṃ rūpā rasā saddā, gandhā phassā ca kevalā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Iṭṭhā dhammā aniṭṭhā ca, na pavedhenti tādino;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Ṭhitaṃ ",
      " cittaṃ vippamuttaṃ, vayañcassānupassatīti."
    ],
    "innerText": "Ṭhitaṃ cittaṃ vippamuttaṃ, vayañcassānupassatīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Soṇakoḷivisavatthu niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "148. Diguṇādiupāhanapaṭikkhepo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "245"
      },
      ". Atha kho bhagavā bhikkhū āmantesi – ‘‘evaṃ kho, bhikkhave, kulaputtā aññaṃ byākaronti, attho ca vutto, attā ca anupanīto. Atha ca, panidhekacce moghapurisā hasamānakaṃ, maññe, aññaṃ byākaronti, te pacchā vighātaṃ āpajjantī’’ti. Atha kho bhagavā āyasmantaṃ soṇaṃ āmantesi – ‘‘tvaṃ khosi, soṇa, sukhumālo. Anujānāmi te, soṇa, ekapalāsikaṃ upāhana’’nti. ‘‘Ahaṃ kho, bhante, asītisakaṭavāhe hiraññaṃ ohāya agārasmā anagāriyaṃ pabbajito, sattahatthikañca anīkaṃ. Athāhaṃ bhante ekapalāsikaṃ ce upāhanaṃ pariharissāmi, tassa me bhavissanti vattāro ‘soṇo koḷiviso asītisakaṭavāhe hiraññaṃ ohāya agārasmā anagāriyaṃ pabbajito, sattahatthikañca anīkaṃ. So dānāyaṃ ekapalāsikāsu upāhanāsu satto’ti. Sace bhagavā bhikkhusaṅghassa anujānissati ahampi paribhuñjissāmi; no ce bhagavā bhikkhusaṅghassa anujānissati, ahampi na paribhuñjissāmī’’ti. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū ",
      " āmantesi – ‘‘anujānāmi, bhikkhave, ekapalāsikaṃ upāhanaṃ. Na, bhikkhave, diguṇā upāhanā dhāretabbā. Na tiguṇā upāhanā dhāretabbā. Na guṇaṅguṇūpāhanā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[gaṇaṅgaṇūpāhanā (bahūsu)]"
      },
      " dhāretabbā. Yo dhāreyya, āpatti dukkaṭassā’’ti."
    ],
    "innerText": "245. Atha kho bhagavā bhikkhū āmantesi – ‘‘evaṃ kho, bhikkhave, kulaputtā aññaṃ byākaronti, attho ca vutto, attā ca anupanīto. Atha ca, panidhekacce moghapurisā hasamānakaṃ, maññe, aññaṃ byākaronti, te pacchā vighātaṃ āpajjantī’’ti. Atha kho bhagavā āyasmantaṃ soṇaṃ āmantesi – ‘‘tvaṃ khosi, soṇa, sukhumālo. Anujānāmi te, soṇa, ekapalāsikaṃ upāhana’’nti. ‘‘Ahaṃ kho, bhante, asītisakaṭavāhe hiraññaṃ ohāya agārasmā anagāriyaṃ pabbajito, sattahatthikañca anīkaṃ. Athāhaṃ bhante ekapalāsikaṃ ce upāhanaṃ pariharissāmi, tassa me bhavissanti vattāro ‘soṇo koḷiviso asītisakaṭavāhe hiraññaṃ ohāya agārasmā anagāriyaṃ pabbajito, sattahatthikañca anīkaṃ. So dānāyaṃ ekapalāsikāsu upāhanāsu satto’ti. Sace bhagavā bhikkhusaṅghassa anujānissati ahampi paribhuñjissāmi; no ce bhagavā bhikkhusaṅghassa anujānissati, ahampi na paribhuñjissāmī’’ti. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘anujānāmi, bhikkhave, ekapalāsikaṃ upāhanaṃ. Na, bhikkhave, diguṇā upāhanā dhāretabbā. Na tiguṇā upāhanā dhāretabbā. Na guṇaṅguṇūpāhanā [gaṇaṅgaṇūpāhanā (bahūsu)] dhāretabbā. Yo dhāreyya, āpatti dukkaṭassā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Diguṇādiupāhanapaṭikkhepo niṭṭhito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "149. Sabbanīlikādipaṭikkhepo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "246"
      },
      ". Tena kho pana samayena chabbaggiyā bhikkhū sabbanīlikā upāhanāyo dhārenti…pe… sabbapītikā upāhanāyo dhārenti… sabbalohitikā upāhanāyo dhārenti… sabbamañjiṭṭhikā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sabbamañjeṭṭhikā (ka.)]"
      },
      " upāhanāyo dhārenti ",
      "… sabbakaṇhā upāhanāyo dhārenti… sabbamahāraṅgarattā upāhanāyo dhārenti… sabbamahānāmarattā upāhanāyo dhārenti. Manussā ujjhāyanti khiyyanti vipācenti, ‘‘seyyathāpi gihī kāmabhogino’’ti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, sabbanīlikā upāhanā dhāretabbā…pe… na sabbapītikā upāhanā dhāretabbā, na sabbalohitikā upāhanā dhāretabbā, na sabbamañjiṭṭhikā upāhanā dhāretabbā, na sabbakaṇhā upāhanā dhāretabbā, na sabbamahāraṅgarattā upāhanā dhāretabbā, na sabbamahānāmarattā upāhanā dhāretabbā. Yo dhāreyya, āpatti dukkaṭassāti."
    ],
    "innerText": "246. Tena kho pana samayena chabbaggiyā bhikkhū sabbanīlikā upāhanāyo dhārenti…pe… sabbapītikā upāhanāyo dhārenti… sabbalohitikā upāhanāyo dhārenti… sabbamañjiṭṭhikā [sabbamañjeṭṭhikā (ka.)] upāhanāyo dhārenti … sabbakaṇhā upāhanāyo dhārenti… sabbamahāraṅgarattā upāhanāyo dhārenti… sabbamahānāmarattā upāhanāyo dhārenti. Manussā ujjhāyanti khiyyanti vipācenti, ‘‘seyyathāpi gihī kāmabhogino’’ti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, sabbanīlikā upāhanā dhāretabbā…pe… na sabbapītikā upāhanā dhāretabbā, na sabbalohitikā upāhanā dhāretabbā, na sabbamañjiṭṭhikā upāhanā dhāretabbā, na sabbakaṇhā upāhanā dhāretabbā, na sabbamahāraṅgarattā upāhanā dhāretabbā, na sabbamahānāmarattā upāhanā dhāretabbā. Yo dhāreyya, āpatti dukkaṭassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena kho pana samayena chabbaggiyā ",
      " bhikkhū nīlakavaddhikā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vaṭṭikā (sī.)]"
      },
      " upāhanāyo dhārenti, pītakavaddhikā upāhanāyo dhārenti, lohitakavaddhikā upāhanāyo dhārenti, mañjiṭṭhikavaddhikā upāhanāyo dhārenti, kaṇhavaddhikā upāhanāyo dhārenti, mahāraṅgarattavaddhikā upāhanāyo dhārenti, mahānāmarattavaddhikā upāhanāyo dhārenti. Manussā ujjhāyanti khiyyanti vipācenti, ‘‘seyyathāpi gihī kāmabhogino’’ti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, nīlakavaddhikā upāhanā dhāretabbā…pe… na pītakavaddhikā upāhanā dhāretabbā, na lohitakavaddhikā upāhanā dhāretabbā, na mañjiṭṭhikavaddhikā upāhanā dhāretabbā, na ",
      " kaṇhavaddhikā upāhanā dhāretabbā, na mahāraṅgarattavaddhikā upāhanā dhāretabbā, na mahānāmarattavaddhikā upāhanā dhāretabbā. Yo dhāreyya, āpatti dukkaṭassāti."
    ],
    "innerText": "Tena kho pana samayena chabbaggiyā bhikkhū nīlakavaddhikā [vaṭṭikā (sī.)] upāhanāyo dhārenti, pītakavaddhikā upāhanāyo dhārenti, lohitakavaddhikā upāhanāyo dhārenti, mañjiṭṭhikavaddhikā upāhanāyo dhārenti, kaṇhavaddhikā upāhanāyo dhārenti, mahāraṅgarattavaddhikā upāhanāyo dhārenti, mahānāmarattavaddhikā upāhanāyo dhārenti. Manussā ujjhāyanti khiyyanti vipācenti, ‘‘seyyathāpi gihī kāmabhogino’’ti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, nīlakavaddhikā upāhanā dhāretabbā…pe… na pītakavaddhikā upāhanā dhāretabbā, na lohitakavaddhikā upāhanā dhāretabbā, na mañjiṭṭhikavaddhikā upāhanā dhāretabbā, na kaṇhavaddhikā upāhanā dhāretabbā, na mahāraṅgarattavaddhikā upāhanā dhāretabbā, na mahānāmarattavaddhikā upāhanā dhāretabbā. Yo dhāreyya, āpatti dukkaṭassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena kho pana samayena chabbaggiyā bhikkhū khallakabaddhā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[…bandhā (ka.)]"
      },
      " upāhanāyo dhārenti…pe… puṭabaddhā upāhanāyo dhārenti, pāliguṇṭhimā upāhanāyo dhārenti, tūlapuṇṇikā upāhanāyo dhārenti ",
      ", tittirapattikā upāhanāyo dhārenti, meṇḍavisāṇavaddhikā upāhanāyo dhārenti, ajavisāṇavaddhikā upāhanāyo dhārenti, vicchikāḷikā upāhanāyo dhārenti, morapiñcha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[morapiñja (sī. syā.)]"
      },
      " parisibbitā upāhanāyo dhārenti, citrā upāhanāyo dhārenti. Manussā ujjhāyanti khiyyanti vipācenti, ‘‘seyyathāpi gihī kāmabhogino’’ti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave ",
      ", khallakabaddhā upāhanā dhāretabbā…pe… na puṭabaddhā upāhanā dhāretabbā, na pāliguṇṭhimā upāhanā dhāretabbā, na tūlapuṇṇikā upāhanā dhāretabbā, na tittirapattikā upāhanā dhāretabbā, na meṇḍavisāṇavaddhikā upāhanā dhāretabbā, na ajavisāṇavaddhikā upāhanā dhāretabbā, na vicchikāḷikā upāhanā dhāretabbā, na morapiñchaparisibbitā upāhanā dhāretabbā, na citrā upāhanā dhāretabbā. Yo dhāreyya, āpatti dukkaṭassāti."
    ],
    "innerText": "Tena kho pana samayena chabbaggiyā bhikkhū khallakabaddhā […bandhā (ka.)] upāhanāyo dhārenti…pe… puṭabaddhā upāhanāyo dhārenti, pāliguṇṭhimā upāhanāyo dhārenti, tūlapuṇṇikā upāhanāyo dhārenti , tittirapattikā upāhanāyo dhārenti, meṇḍavisāṇavaddhikā upāhanāyo dhārenti, ajavisāṇavaddhikā upāhanāyo dhārenti, vicchikāḷikā upāhanāyo dhārenti, morapiñcha [morapiñja (sī. syā.)] parisibbitā upāhanāyo dhārenti, citrā upāhanāyo dhārenti. Manussā ujjhāyanti khiyyanti vipācenti, ‘‘seyyathāpi gihī kāmabhogino’’ti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave , khallakabaddhā upāhanā dhāretabbā…pe… na puṭabaddhā upāhanā dhāretabbā, na pāliguṇṭhimā upāhanā dhāretabbā, na tūlapuṇṇikā upāhanā dhāretabbā, na tittirapattikā upāhanā dhāretabbā, na meṇḍavisāṇavaddhikā upāhanā dhāretabbā, na ajavisāṇavaddhikā upāhanā dhāretabbā, na vicchikāḷikā upāhanā dhāretabbā, na morapiñchaparisibbitā upāhanā dhāretabbā, na citrā upāhanā dhāretabbā. Yo dhāreyya, āpatti dukkaṭassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena kho pana samayena chabbaggiyā bhikkhū sīhacammaparikkhaṭā upāhanāyo dhārenti…pe… byagghacammaparikkhaṭā upāhanāyo ",
      " dhārenti, dīpicammaparikkhaṭā upāhanāyo dhārenti, ajinacammaparikkhaṭā upāhanāyo dhārenti, uddacammaparikkhaṭā upāhanāyo dhārenti, majjāracammaparikkhaṭā upāhanāyo dhārenti, kāḷakacammaparikkhaṭā upāhanāyo dhārenti, luvakacammaparikkhaṭā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ulūkacammaparikkhaṭā (yojanā)]"
      },
      " upāhanāyo dhārenti. Manussā ujjhāyanti khiyyanti vipācenti, ‘‘seyyathāpi gihī kāmabhogino’’ti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, sīhacammaparikkhaṭā upāhanā dhāretabbā…pe… na byagghacammaparikkhaṭā upāhanā dhāretabbā, na dīpicammaparikkhaṭā upāhanā dhāretabbā, na ajinacammaparikkhaṭā upāhanā dhāretabbā, na uddacammaparikkhaṭā upāhanā dhāretabbā, na majjāracammaparikkhaṭā upāhanā dhāretabbā, na kāḷakacammaparikkhaṭā upāhanā dhāretabbā, na luvakacammaparikkhaṭā upāhanā dhāretabbā. Yo dhāreyya, āpatti dukkaṭassāti."
    ],
    "innerText": "Tena kho pana samayena chabbaggiyā bhikkhū sīhacammaparikkhaṭā upāhanāyo dhārenti…pe… byagghacammaparikkhaṭā upāhanāyo dhārenti, dīpicammaparikkhaṭā upāhanāyo dhārenti, ajinacammaparikkhaṭā upāhanāyo dhārenti, uddacammaparikkhaṭā upāhanāyo dhārenti, majjāracammaparikkhaṭā upāhanāyo dhārenti, kāḷakacammaparikkhaṭā upāhanāyo dhārenti, luvakacammaparikkhaṭā [ulūkacammaparikkhaṭā (yojanā)] upāhanāyo dhārenti. Manussā ujjhāyanti khiyyanti vipācenti, ‘‘seyyathāpi gihī kāmabhogino’’ti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, sīhacammaparikkhaṭā upāhanā dhāretabbā…pe… na byagghacammaparikkhaṭā upāhanā dhāretabbā, na dīpicammaparikkhaṭā upāhanā dhāretabbā, na ajinacammaparikkhaṭā upāhanā dhāretabbā, na uddacammaparikkhaṭā upāhanā dhāretabbā, na majjāracammaparikkhaṭā upāhanā dhāretabbā, na kāḷakacammaparikkhaṭā upāhanā dhāretabbā, na luvakacammaparikkhaṭā upāhanā dhāretabbā. Yo dhāreyya, āpatti dukkaṭassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sabbanīlikādipaṭikkhepo niṭṭhito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "150. Omukkaguṇaṅguṇūpāhanānujānanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "247"
      },
      ". Atha kho bhagavā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya rājagahaṃ piṇḍāya pāvisi, aññatarena bhikkhunā pacchāsamaṇena. Atha kho so bhikkhu khañjamāno bhagavantaṃ piṭṭhito piṭṭhito anubandhi. Addasā kho aññataro upāsako guṇaṅguṇūpāhanā ārohitvā bhagavantaṃ dūratova āgacchantaṃ; disvā upāhanā ārohitvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ ",
      " abhivādetvā yena so bhikkhu tenupasaṅkami; upasaṅkamitvā taṃ bhikkhuṃ abhivādetvā ",
      " etadavoca – ‘‘kissa, bhante, ayyo khañjatī’’ti ",
      "? ‘‘Pādā me, āvuso, phalitā’’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[phālitāti (ka.)]"
      },
      ". ‘‘Handa, bhante, upāhanāyo’’ti. ‘‘Alaṃ ",
      ", āvuso, paṭikkhittā bhagavatā guṇaṅguṇūpāhanā’’ti. ‘‘Gaṇhāhetā, bhikkhu, upāhanāyo’’ti. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘anujānāmi, bhikkhave, omukkaṃ guṇaṅguṇūpāhanaṃ. Na, bhikkhave, navā guṇaṅguṇūpāhanā dhāretabbā. Yo dhāreyya, āpatti dukkaṭassā’’ti."
    ],
    "innerText": "247. Atha kho bhagavā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya rājagahaṃ piṇḍāya pāvisi, aññatarena bhikkhunā pacchāsamaṇena. Atha kho so bhikkhu khañjamāno bhagavantaṃ piṭṭhito piṭṭhito anubandhi. Addasā kho aññataro upāsako guṇaṅguṇūpāhanā ārohitvā bhagavantaṃ dūratova āgacchantaṃ; disvā upāhanā ārohitvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā yena so bhikkhu tenupasaṅkami; upasaṅkamitvā taṃ bhikkhuṃ abhivādetvā etadavoca – ‘‘kissa, bhante, ayyo khañjatī’’ti ? ‘‘Pādā me, āvuso, phalitā’’ti [phālitāti (ka.)]. ‘‘Handa, bhante, upāhanāyo’’ti. ‘‘Alaṃ , āvuso, paṭikkhittā bhagavatā guṇaṅguṇūpāhanā’’ti. ‘‘Gaṇhāhetā, bhikkhu, upāhanāyo’’ti. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘anujānāmi, bhikkhave, omukkaṃ guṇaṅguṇūpāhanaṃ. Na, bhikkhave, navā guṇaṅguṇūpāhanā dhāretabbā. Yo dhāreyya, āpatti dukkaṭassā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Omukkaguṇaṅguṇūpāhanānujānanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "151. Ajjhārāme upāhanapaṭikkhepo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "248"
      },
      ". Tena kho pana samayena bhagavā ajjhokāse anupāhano caṅkamati. Satthā anupāhano caṅkamatīti, therāpi bhikkhū anupāhanā caṅkamanti. Chabbaggiyā bhikkhū, satthari anupāhane caṅkamamāne, theresupi bhikkhūsu anupāhanesu caṅkamamānesu, saupāhanā caṅkamanti. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma chabbaggiyā bhikkhū, satthari anupāhane caṅkamamāne, theresupi bhikkhūsu anupāhanesu caṅkamamānesu, saupāhanā caṅkamissantī’’ti. Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… ‘‘saccaṃ kira, bhikkhave, chabbaggiyā bhikkhū, satthari anupāhane caṅkamamāne, theresupi bhikkhūsu anupāhanesu caṅkamamānesu, saupāhanā caṅkamantī’’ti? ‘‘Saccaṃ, bhagavā’’ti. Vigarahi buddho bhagavā…pe… ‘‘kathañhi nāma te, bhikkhave, moghapurisā, satthari anupāhane caṅkamamāne, theresupi bhikkhūsu anupāhanesu caṅkamamānesu, saupāhanā caṅkamissanti. Ime hi nāma, bhikkhave ",
      ", gihī odātavatthavasanakā abhijīvanikassa sippassa kāraṇā ācariyesu sagāravā sappatissā sabhāgavuttikā viharissanti. Idha kho taṃ, bhikkhave, sobhetha, yaṃ tumhe evaṃ svākkhāte dhammavinaye pabbajitā samānā ācariyesu ācariyamattesu upajjhāyesu upajjhāyamattesu agāravā appatissā asabhāgavuttikā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sagāravā saggatissā sabhāgavuttikā (ka.)]"
      },
      " vihareyyātha. Netaṃ, bhikkhave, appasannānaṃ vā pasādāya…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘na, bhikkhave, ācariyesu ācariyamattesu upajjhāyesu upajjhāyamattesu anupāhanesu caṅkamamānesu saupāhanena caṅkamitabbaṃ. Yo caṅkameyya, āpatti dukkaṭassa ",
      ". Na ca, bhikkhave, ajjhārāme upāhanā dhāretabbā. Yo dhāreyya, āpatti dukkaṭassā’’ti."
    ],
    "innerText": "248. Tena kho pana samayena bhagavā ajjhokāse anupāhano caṅkamati. Satthā anupāhano caṅkamatīti, therāpi bhikkhū anupāhanā caṅkamanti. Chabbaggiyā bhikkhū, satthari anupāhane caṅkamamāne, theresupi bhikkhūsu anupāhanesu caṅkamamānesu, saupāhanā caṅkamanti. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma chabbaggiyā bhikkhū, satthari anupāhane caṅkamamāne, theresupi bhikkhūsu anupāhanesu caṅkamamānesu, saupāhanā caṅkamissantī’’ti. Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… ‘‘saccaṃ kira, bhikkhave, chabbaggiyā bhikkhū, satthari anupāhane caṅkamamāne, theresupi bhikkhūsu anupāhanesu caṅkamamānesu, saupāhanā caṅkamantī’’ti? ‘‘Saccaṃ, bhagavā’’ti. Vigarahi buddho bhagavā…pe… ‘‘kathañhi nāma te, bhikkhave, moghapurisā, satthari anupāhane caṅkamamāne, theresupi bhikkhūsu anupāhanesu caṅkamamānesu, saupāhanā caṅkamissanti. Ime hi nāma, bhikkhave , gihī odātavatthavasanakā abhijīvanikassa sippassa kāraṇā ācariyesu sagāravā sappatissā sabhāgavuttikā viharissanti. Idha kho taṃ, bhikkhave, sobhetha, yaṃ tumhe evaṃ svākkhāte dhammavinaye pabbajitā samānā ācariyesu ācariyamattesu upajjhāyesu upajjhāyamattesu agāravā appatissā asabhāgavuttikā [sagāravā saggatissā sabhāgavuttikā (ka.)] vihareyyātha. Netaṃ, bhikkhave, appasannānaṃ vā pasādāya…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘na, bhikkhave, ācariyesu ācariyamattesu upajjhāyesu upajjhāyamattesu anupāhanesu caṅkamamānesu saupāhanena caṅkamitabbaṃ. Yo caṅkameyya, āpatti dukkaṭassa . Na ca, bhikkhave, ajjhārāme upāhanā dhāretabbā. Yo dhāreyya, āpatti dukkaṭassā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "249"
      },
      ". Tena ",
      " kho pana samayena aññatarassa bhikkhuno pādakhilābādho hoti. Taṃ bhikkhū pariggahetvā uccārampi passāvampi nikkhāmenti. Addasā kho bhagavā senāsanacārikaṃ āhiṇḍanto te bhikkhū taṃ bhikkhuṃ pariggahetvā uccārampi ",
      " passāvampi nikkhāmente, disvāna yena te bhikkhū tenupasaṅkami, upasaṅkamitvā te bhikkhū etadavoca – ‘‘kiṃ imassa, bhikkhave, bhikkhuno ābādho’’ti? ‘‘Imassa, bhante, āyasmato pādakhilābādho; imaṃ mayaṃ pariggahetvā uccārampi passāvampi nikkhāmemā’’ti. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ ",
      " katvā bhikkhū āmantesi – ‘‘anujānāmi, bhikkhave, yassa pādā vā dukkhā, pādā vā phalitā, pādakhilo vā ābādho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pādakhilābādho vā (syā.)]"
      },
      " upāhanaṃ dhāretu’’nti."
    ],
    "innerText": "249. Tena kho pana samayena aññatarassa bhikkhuno pādakhilābādho hoti. Taṃ bhikkhū pariggahetvā uccārampi passāvampi nikkhāmenti. Addasā kho bhagavā senāsanacārikaṃ āhiṇḍanto te bhikkhū taṃ bhikkhuṃ pariggahetvā uccārampi passāvampi nikkhāmente, disvāna yena te bhikkhū tenupasaṅkami, upasaṅkamitvā te bhikkhū etadavoca – ‘‘kiṃ imassa, bhikkhave, bhikkhuno ābādho’’ti? ‘‘Imassa, bhante, āyasmato pādakhilābādho; imaṃ mayaṃ pariggahetvā uccārampi passāvampi nikkhāmemā’’ti. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘anujānāmi, bhikkhave, yassa pādā vā dukkhā, pādā vā phalitā, pādakhilo vā ābādho [pādakhilābādho vā (syā.)] upāhanaṃ dhāretu’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena kho pana samayena bhikkhū adhotehi pādehi mañcampi pīṭhampi abhiruhanti; cīvarampi senāsanampi dussati. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, ‘idāni mañcaṃ vā pīṭhaṃ vā abhiruhissāmī’’ti upāhanaṃ dhāretunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena kho pana samayena bhikkhū rattiyā uposathaggampi sannisajjampi gacchantā andhakāre khāṇumpi kaṇṭakampi akkamanti; pādā dukkhā honti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, ajjhārāme upāhanaṃ dhāretuṃ, ukkaṃ, padīpaṃ, kattaradaṇḍanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ajjhārāme upāhanapaṭikkhepo niṭṭhito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "152. Kaṭṭhapādukādipaṭikkhepo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "250"
      },
      ". Tena kho pana samayena chabbaggiyā bhikkhū rattiyā paccūsasamayaṃ paccuṭṭhāya kaṭṭhapādukāyo abhiruhitvā ajjhokāse caṅkamanti, uccāsaddā mahāsaddā khaṭakhaṭasaddā, anekavihitaṃ tiracchānakathaṃ kathentā, seyyathidaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[imā tiracchānakathāyo pāci. 508; dī. ni. 1.7; ma. ni. 2.223; saṃ. ni. 5.1080; a. ni. 10.69 ādayo]"
      },
      " – rājakathaṃ, corakathaṃ, mahāmattakathaṃ, senākathaṃ, bhayakathaṃ, yuddhakathaṃ, annakathaṃ, pānakathaṃ, vatthakathaṃ, sayanakathaṃ, mālākathaṃ, gandhakathaṃ, ñātikathaṃ, yānakathaṃ, gāmakathaṃ, nigamakathaṃ, nagarakathaṃ, janapadakathaṃ, itthikathaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[itthikathaṃ purisakathaṃ (ka.)]"
      },
      ", sūrakathaṃ, visikhākathaṃ, kumbhaṭṭhānakathaṃ ",
      ", pubbapetakathaṃ, nānattakathaṃ, lokakkhāyikaṃ, samuddakkhāyikaṃ, itibhavābhavakathaṃ iti vā; kīṭakampi akkamitvā mārenti, bhikkhūpi samādhimhā cāventi. Ye ",
      " te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma chabbaggiyā bhikkhū rattiyā ",
      " paccūsasamayaṃ paccuṭṭhāya kaṭṭhapādukāyo abhiruhitvā ajjhokāse caṅkamissanti, uccāsaddā mahāsaddā khaṭakhaṭasaddā anekavihitaṃ tiracchānakathaṃ kathentā, seyyathidaṃ – rājakathaṃ, corakathaṃ…pe… itibhavābhavakathaṃ iti vā, kīṭakampi akkamitvā māressanti, bhikkhūpi samādhimhā cāvessantī’’ti. Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… ‘‘saccaṃ kira, bhikkhave, chabbaggiyā bhikkhū rattiyā paccūsasamayaṃ paccuṭṭhāya kaṭṭhapādukāyo abhiruhitvā ajjhokāse caṅkamanti, uccāsaddā mahāsaddā khaṭakhaṭasaddā, anekavihitaṃ tiracchānakathaṃ kathentā, seyyathidaṃ, – rājakathaṃ, corakathaṃ…pe… itibhavābhavakathaṃ iti vā, kīṭakampi akkamitvā mārenti, bhikkhūpi samādhimhā ",
      " cāventī’’ti? ‘‘Saccaṃ, bhagavā’’ti…pe… vigarahitvā dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘na, bhikkhave, kaṭṭhapādukā dhāretabbā. Yo dhāreyya, āpatti dukkaṭassā’’ti."
    ],
    "innerText": "250. Tena kho pana samayena chabbaggiyā bhikkhū rattiyā paccūsasamayaṃ paccuṭṭhāya kaṭṭhapādukāyo abhiruhitvā ajjhokāse caṅkamanti, uccāsaddā mahāsaddā khaṭakhaṭasaddā, anekavihitaṃ tiracchānakathaṃ kathentā, seyyathidaṃ [imā tiracchānakathāyo pāci. 508; dī. ni. 1.7; ma. ni. 2.223; saṃ. ni. 5.1080; a. ni. 10.69 ādayo] – rājakathaṃ, corakathaṃ, mahāmattakathaṃ, senākathaṃ, bhayakathaṃ, yuddhakathaṃ, annakathaṃ, pānakathaṃ, vatthakathaṃ, sayanakathaṃ, mālākathaṃ, gandhakathaṃ, ñātikathaṃ, yānakathaṃ, gāmakathaṃ, nigamakathaṃ, nagarakathaṃ, janapadakathaṃ, itthikathaṃ [itthikathaṃ purisakathaṃ (ka.)], sūrakathaṃ, visikhākathaṃ, kumbhaṭṭhānakathaṃ , pubbapetakathaṃ, nānattakathaṃ, lokakkhāyikaṃ, samuddakkhāyikaṃ, itibhavābhavakathaṃ iti vā; kīṭakampi akkamitvā mārenti, bhikkhūpi samādhimhā cāventi. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma chabbaggiyā bhikkhū rattiyā paccūsasamayaṃ paccuṭṭhāya kaṭṭhapādukāyo abhiruhitvā ajjhokāse caṅkamissanti, uccāsaddā mahāsaddā khaṭakhaṭasaddā anekavihitaṃ tiracchānakathaṃ kathentā, seyyathidaṃ – rājakathaṃ, corakathaṃ…pe… itibhavābhavakathaṃ iti vā, kīṭakampi akkamitvā māressanti, bhikkhūpi samādhimhā cāvessantī’’ti. Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… ‘‘saccaṃ kira, bhikkhave, chabbaggiyā bhikkhū rattiyā paccūsasamayaṃ paccuṭṭhāya kaṭṭhapādukāyo abhiruhitvā ajjhokāse caṅkamanti, uccāsaddā mahāsaddā khaṭakhaṭasaddā, anekavihitaṃ tiracchānakathaṃ kathentā, seyyathidaṃ, – rājakathaṃ, corakathaṃ…pe… itibhavābhavakathaṃ iti vā, kīṭakampi akkamitvā mārenti, bhikkhūpi samādhimhā cāventī’’ti? ‘‘Saccaṃ, bhagavā’’ti…pe… vigarahitvā dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘na, bhikkhave, kaṭṭhapādukā dhāretabbā. Yo dhāreyya, āpatti dukkaṭassā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho bhagavā rājagahe yathābhirantaṃ viharitvā yena bārāṇasī tena cārikaṃ pakkāmi. Anupubbena cārikaṃ caramāno yena bārāṇasī tadavasari. Tatra sudaṃ bhagavā bārāṇasiyaṃ viharati isipatane migadāye. Tena kho pana samayena chabbaggiyā bhikkhū – bhagavatā kaṭṭhapādukā paṭikkhittāti – tālataruṇe chedāpetvā tālapattapādukāyo dhārenti; tāni tālataruṇāni chinnāni milāyanti. Manussā ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma samaṇā sakyaputtiyā ",
      " tālataruṇe chedāpetvā tālapattapādukāyo dhāressanti; tāni tālataruṇāni chinnāni milāyanti; ekindriyaṃ samaṇā sakyaputtiyā jīvaṃ viheṭhentī’’ti. Assosuṃ kho bhikkhū tesaṃ manussānaṃ ujjhāyantānaṃ khiyyantānaṃ vipācentānaṃ. Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… ‘‘saccaṃ kira, bhikkhave, chabbaggiyā bhikkhū tālataruṇe chedāpetvā tālapattapādukāyo dhārenti; tāni tālataruṇāni chinnāni milāyantī’’ti? Saccaṃ bhagavāti. Vigarahi buddho bhagavā…pe… kathañhi nāma te, bhikkhave, moghapurisā tālataruṇe chedāpetvā tālapattapādukāyo dhāressanti; tāni tālataruṇāni chinnāni milāyanti. Jīvasaññino hi, bhikkhave, manussā rukkhasmiṃ. Netaṃ, bhikkhave, appasannānaṃ ",
      " vā pasādāya…pe… vigarahitvā dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘na, bhikkhave, tālapattapādukā dhāretabbā. Yo dhāreyya, āpatti dukkaṭassā’’ti."
    ],
    "innerText": "Atha kho bhagavā rājagahe yathābhirantaṃ viharitvā yena bārāṇasī tena cārikaṃ pakkāmi. Anupubbena cārikaṃ caramāno yena bārāṇasī tadavasari. Tatra sudaṃ bhagavā bārāṇasiyaṃ viharati isipatane migadāye. Tena kho pana samayena chabbaggiyā bhikkhū – bhagavatā kaṭṭhapādukā paṭikkhittāti – tālataruṇe chedāpetvā tālapattapādukāyo dhārenti; tāni tālataruṇāni chinnāni milāyanti. Manussā ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma samaṇā sakyaputtiyā tālataruṇe chedāpetvā tālapattapādukāyo dhāressanti; tāni tālataruṇāni chinnāni milāyanti; ekindriyaṃ samaṇā sakyaputtiyā jīvaṃ viheṭhentī’’ti. Assosuṃ kho bhikkhū tesaṃ manussānaṃ ujjhāyantānaṃ khiyyantānaṃ vipācentānaṃ. Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… ‘‘saccaṃ kira, bhikkhave, chabbaggiyā bhikkhū tālataruṇe chedāpetvā tālapattapādukāyo dhārenti; tāni tālataruṇāni chinnāni milāyantī’’ti? Saccaṃ bhagavāti. Vigarahi buddho bhagavā…pe… kathañhi nāma te, bhikkhave, moghapurisā tālataruṇe chedāpetvā tālapattapādukāyo dhāressanti; tāni tālataruṇāni chinnāni milāyanti. Jīvasaññino hi, bhikkhave, manussā rukkhasmiṃ. Netaṃ, bhikkhave, appasannānaṃ vā pasādāya…pe… vigarahitvā dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘na, bhikkhave, tālapattapādukā dhāretabbā. Yo dhāreyya, āpatti dukkaṭassā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena ",
      " kho pana samayena chabbaggiyā bhikkhū ‘bhagavatā tālapattapādukā paṭikkhittā’ti veḷutaruṇe chedāpetvā veḷupattapādukāyo dhārenti. Tāni veḷutaruṇāni chinnāni milāyanti. Manussā ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma samaṇā sakyaputtiyā veḷutaruṇe chedāpetvā veḷupattapādukāyo dhāressanti. Tāni veḷutaruṇāni chinnāni milāyanti. Ekindriyaṃ samaṇā sakyaputtiyā jīvaṃ viheṭhentī’’ti. Assosuṃ kho bhikkhū tesaṃ manussānaṃ ujjhāyantānaṃ khiyyantānaṃ ",
      " vipācentānaṃ. Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… jīvasaññino hi, bhikkhave, manussā rukkhasmiṃ…pe… na, bhikkhave, veḷupattapādukā dhāretabbā. Yo dhāreyya, āpatti dukkaṭassāti."
    ],
    "innerText": "Tena kho pana samayena chabbaggiyā bhikkhū ‘bhagavatā tālapattapādukā paṭikkhittā’ti veḷutaruṇe chedāpetvā veḷupattapādukāyo dhārenti. Tāni veḷutaruṇāni chinnāni milāyanti. Manussā ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma samaṇā sakyaputtiyā veḷutaruṇe chedāpetvā veḷupattapādukāyo dhāressanti. Tāni veḷutaruṇāni chinnāni milāyanti. Ekindriyaṃ samaṇā sakyaputtiyā jīvaṃ viheṭhentī’’ti. Assosuṃ kho bhikkhū tesaṃ manussānaṃ ujjhāyantānaṃ khiyyantānaṃ vipācentānaṃ. Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… jīvasaññino hi, bhikkhave, manussā rukkhasmiṃ…pe… na, bhikkhave, veḷupattapādukā dhāretabbā. Yo dhāreyya, āpatti dukkaṭassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "251"
      },
      ". Atha kho bhagavā bārāṇasiyaṃ yathābhirantaṃ viharitvā yena bhaddiyaṃ tena cārikaṃ pakkāmi. Anupubbena cārikaṃ caramāno yena bhaddiyaṃ tadavasari. Tatra sudaṃ bhagavā bhaddiye viharati jātiyā vane. Tena kho ",
      " pana samayena bhaddiyā bhikkhū anekavihitaṃ pādukamaṇḍanānuyogamanuyuttā viharanti, tiṇapādukaṃ karontipi kārāpentipi, muñjapādukaṃ karontipi kārāpentipi, pabbajapādukaṃ karontipi kārāpentipi, hintālapādukaṃ karontipi kārāpentipi, kamalapādukaṃ karontipi kārāpentipi, kambalapādukaṃ karontipi kārāpentipi, riñcanti uddesaṃ paripucchaṃ adhisīlaṃ adhicittaṃ adhipaññaṃ. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma bhaddiyā bhikkhū anekavihitaṃ pādukamaṇḍanānuyogamanuyuttā viharissanti, tiṇapādukaṃ karissantipi kārāpessantipi, muñjapādukaṃ karissantipi kārāpessantipi, pabbajapādukaṃ karissantipi kārāpessantipi, hintālapādukaṃ karissantipi kārāpessantipi, kamalapādukaṃ karissantipi kārāpessantipi, kambalapādukaṃ karissantipi kārāpessantipi, riñcissanti uddesaṃ paripucchaṃ adhisīlaṃ adhicittaṃ adhipañña’’nti. Atha kho te bhikkhū bhagavato ",
      " etamatthaṃ ārocesuṃ…pe… ‘‘saccaṃ kira, bhikkhave, bhaddiyā bhikkhū anekavihitaṃ pādukamaṇḍanānuyogamanuyuttā viharanti, tiṇapādukaṃ karontipi kārāpentipi…pe… riñcanti uddesaṃ paripucchaṃ adhisīlaṃ adhicittaṃ ",
      " adhipañña’’nti? ‘‘Saccaṃ, bhagavā’’ti. Vigarahi buddho bhagavā…pe… ‘‘kathañhi nāma te, bhikkhave, moghapurisā anekavihitaṃ pādukamaṇḍanānuyogamanuyuttā viharissanti, tiṇapādukaṃ karissantipi kārāpessantipi…pe… riñcissanti uddesaṃ paripucchaṃ adhisīlaṃ adhicittaṃ adhipaññaṃ. Netaṃ, bhikkhave, appasannānaṃ vā pasādāya…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘na, bhikkhave, tiṇapādukā dhāretabbā, na muñjapādukā dhāretabbā, na pabbajapādukā dhāretabbā, na hintālapādukā dhāretabbā, na kamalapādukā dhāretabbā ",
      ", na kambalapādukā dhāretabbā, na sovaṇṇamayā pādukā dhāretabbā, na rūpiyamayā pādukā dhāretabbā, na maṇimayā pādukā dhāretabbā, na veḷuriyamayā pādukā dhāretabbā, na ",
      " phalikamayā pādukā dhāretabbā, na kaṃsamayā pādukā dhāretabbā, na kācamayā pādukā dhāretabbā, na tipumayā pādukā dhāretabbā, na sīsamayā pādukā dhāretabbā, na tambalohamayā pādukā dhāretabbā. Yo dhāreyya, āpatti dukkaṭassa. Na ca, bhikkhave, kāci saṅkamaniyā pādukā dhāretabbā. Yo dhāreyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, tisso pādukā dhuvaṭṭhāniyā asaṅkamaniyāyo – vaccapādukaṃ, passāvapādukaṃ, ācamanapāduka’’nti."
    ],
    "innerText": "251. Atha kho bhagavā bārāṇasiyaṃ yathābhirantaṃ viharitvā yena bhaddiyaṃ tena cārikaṃ pakkāmi. Anupubbena cārikaṃ caramāno yena bhaddiyaṃ tadavasari. Tatra sudaṃ bhagavā bhaddiye viharati jātiyā vane. Tena kho pana samayena bhaddiyā bhikkhū anekavihitaṃ pādukamaṇḍanānuyogamanuyuttā viharanti, tiṇapādukaṃ karontipi kārāpentipi, muñjapādukaṃ karontipi kārāpentipi, pabbajapādukaṃ karontipi kārāpentipi, hintālapādukaṃ karontipi kārāpentipi, kamalapādukaṃ karontipi kārāpentipi, kambalapādukaṃ karontipi kārāpentipi, riñcanti uddesaṃ paripucchaṃ adhisīlaṃ adhicittaṃ adhipaññaṃ. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma bhaddiyā bhikkhū anekavihitaṃ pādukamaṇḍanānuyogamanuyuttā viharissanti, tiṇapādukaṃ karissantipi kārāpessantipi, muñjapādukaṃ karissantipi kārāpessantipi, pabbajapādukaṃ karissantipi kārāpessantipi, hintālapādukaṃ karissantipi kārāpessantipi, kamalapādukaṃ karissantipi kārāpessantipi, kambalapādukaṃ karissantipi kārāpessantipi, riñcissanti uddesaṃ paripucchaṃ adhisīlaṃ adhicittaṃ adhipañña’’nti. Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… ‘‘saccaṃ kira, bhikkhave, bhaddiyā bhikkhū anekavihitaṃ pādukamaṇḍanānuyogamanuyuttā viharanti, tiṇapādukaṃ karontipi kārāpentipi…pe… riñcanti uddesaṃ paripucchaṃ adhisīlaṃ adhicittaṃ adhipañña’’nti? ‘‘Saccaṃ, bhagavā’’ti. Vigarahi buddho bhagavā…pe… ‘‘kathañhi nāma te, bhikkhave, moghapurisā anekavihitaṃ pādukamaṇḍanānuyogamanuyuttā viharissanti, tiṇapādukaṃ karissantipi kārāpessantipi…pe… riñcissanti uddesaṃ paripucchaṃ adhisīlaṃ adhicittaṃ adhipaññaṃ. Netaṃ, bhikkhave, appasannānaṃ vā pasādāya…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘na, bhikkhave, tiṇapādukā dhāretabbā, na muñjapādukā dhāretabbā, na pabbajapādukā dhāretabbā, na hintālapādukā dhāretabbā, na kamalapādukā dhāretabbā , na kambalapādukā dhāretabbā, na sovaṇṇamayā pādukā dhāretabbā, na rūpiyamayā pādukā dhāretabbā, na maṇimayā pādukā dhāretabbā, na veḷuriyamayā pādukā dhāretabbā, na phalikamayā pādukā dhāretabbā, na kaṃsamayā pādukā dhāretabbā, na kācamayā pādukā dhāretabbā, na tipumayā pādukā dhāretabbā, na sīsamayā pādukā dhāretabbā, na tambalohamayā pādukā dhāretabbā. Yo dhāreyya, āpatti dukkaṭassa. Na ca, bhikkhave, kāci saṅkamaniyā pādukā dhāretabbā. Yo dhāreyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, tisso pādukā dhuvaṭṭhāniyā asaṅkamaniyāyo – vaccapādukaṃ, passāvapādukaṃ, ācamanapāduka’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "252"
      },
      ". Atha kho bhagavā bhaddiye yathābhirantaṃ viharitvā yena sāvatthi tena cārikaṃ pakkāmi. Anupubbena cārikaṃ caramāno yena sāvatthi tadavasari. Tatra sudaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena chabbaggiyā bhikkhū ",
      " aciravatiyā nadiyā gāvīnaṃ tarantīnaṃ visāṇesupi gaṇhanti, kaṇṇesupi gaṇhanti, gīvāyapi gaṇhanti, cheppāpi gaṇhanti, piṭṭhimpi abhiruhanti, rattacittāpi aṅgajātaṃ chupanti, vacchatarimpi ogāhetvā mārenti. Manussā ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma samaṇā sakyaputtiyā gāvīnaṃ tarantīnaṃ visāṇesupi gahessanti…pe… seyyathāpi gihī kāmabhogino’’ti. Assosuṃ kho bhikkhū tesaṃ manussānaṃ ujjhāyantānaṃ khiyyantānaṃ ",
      " vipācentānaṃ. Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… saccaṃ kira, bhikkhave,…pe… saccaṃ bhagavāti…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘na, bhikkhave, gāvīnaṃ visāṇesu gahetabbaṃ, na kaṇṇesu gahetabbaṃ, na gīvāya gahetabbaṃ, na cheppāya gahetabbaṃ, na piṭṭhi abhiruhitabbā ",
      ". Yo abhiruheyya, āpatti dukkaṭassa. Na ca, bhikkhave, rattacittena aṅgajātaṃ chupitabbaṃ. Yo chupeyya, āpatti thullaccayassa. Na vacchatarī māretabbā. Yo māreyya, yathādhammo kāretabbo’’ti."
    ],
    "innerText": "252. Atha kho bhagavā bhaddiye yathābhirantaṃ viharitvā yena sāvatthi tena cārikaṃ pakkāmi. Anupubbena cārikaṃ caramāno yena sāvatthi tadavasari. Tatra sudaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena chabbaggiyā bhikkhū aciravatiyā nadiyā gāvīnaṃ tarantīnaṃ visāṇesupi gaṇhanti, kaṇṇesupi gaṇhanti, gīvāyapi gaṇhanti, cheppāpi gaṇhanti, piṭṭhimpi abhiruhanti, rattacittāpi aṅgajātaṃ chupanti, vacchatarimpi ogāhetvā mārenti. Manussā ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma samaṇā sakyaputtiyā gāvīnaṃ tarantīnaṃ visāṇesupi gahessanti…pe… seyyathāpi gihī kāmabhogino’’ti. Assosuṃ kho bhikkhū tesaṃ manussānaṃ ujjhāyantānaṃ khiyyantānaṃ vipācentānaṃ. Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… saccaṃ kira, bhikkhave,…pe… saccaṃ bhagavāti…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘na, bhikkhave, gāvīnaṃ visāṇesu gahetabbaṃ, na kaṇṇesu gahetabbaṃ, na gīvāya gahetabbaṃ, na cheppāya gahetabbaṃ, na piṭṭhi abhiruhitabbā . Yo abhiruheyya, āpatti dukkaṭassa. Na ca, bhikkhave, rattacittena aṅgajātaṃ chupitabbaṃ. Yo chupeyya, āpatti thullaccayassa. Na vacchatarī māretabbā. Yo māreyya, yathādhammo kāretabbo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Kaṭṭhapādukādipaṭikkhepo niṭṭhito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "153. Yānādipaṭikkhepo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "253"
      },
      ". Tena kho pana samayena chabbaggiyā bhikkhū yānena yāyanti, itthiyuttenapi purisantarena, purisayuttenapi itthantarena. Manussā ujjhāyanti khiyyanti vipācenti – ‘‘seyyathāpi gaṅgāmahiyāyā’’ti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, yānena yāyitabbaṃ ",
      ". Yo yāyeyya, āpatti dukkaṭassāti. Tena kho pana samayena aññataro bhikkhu kosalesu janapade sāvatthiṃ gacchanto bhagavantaṃ dassanāya antarāmagge gilāno hoti. Atha kho so bhikkhu maggā okkamma aññatarasmiṃ rukkhamūle nisīdi. Manussā taṃ bhikkhuṃ disvā etadavocuṃ – ‘‘kahaṃ, bhante, ayyo gamissatī’’ti? ‘‘Sāvatthiṃ kho ahaṃ, āvuso, gamissāmi bhagavantaṃ dassanāyā’’ti. ‘‘Ehi, bhante, gamissāmā’’ti. ‘‘Nāhaṃ, āvuso, sakkomi, gilānomhī’’ti. ‘‘Ehi, bhante, yānaṃ abhiruhā’’ti. ‘‘Alaṃ, āvuso, paṭikkhittaṃ bhagavatā yāna’’nti kukkuccāyanto yānaṃ nābhiruhi. Atha kho so bhikkhu sāvatthiṃ gantvā bhikkhūnaṃ ",
      " etamatthaṃ ārocesi. Bhikkhū bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, gilānassa yānanti. Atha kho bhikkhūnaṃ etadahosi – ‘‘itthiyuttaṃ nu kho purisayuttaṃ nu kho’’ti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi ",
      ", bhikkhave, purisayuttaṃ hatthavaṭṭakanti."
    ],
    "innerText": "253. Tena kho pana samayena chabbaggiyā bhikkhū yānena yāyanti, itthiyuttenapi purisantarena, purisayuttenapi itthantarena. Manussā ujjhāyanti khiyyanti vipācenti – ‘‘seyyathāpi gaṅgāmahiyāyā’’ti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, yānena yāyitabbaṃ . Yo yāyeyya, āpatti dukkaṭassāti. Tena kho pana samayena aññataro bhikkhu kosalesu janapade sāvatthiṃ gacchanto bhagavantaṃ dassanāya antarāmagge gilāno hoti. Atha kho so bhikkhu maggā okkamma aññatarasmiṃ rukkhamūle nisīdi. Manussā taṃ bhikkhuṃ disvā etadavocuṃ – ‘‘kahaṃ, bhante, ayyo gamissatī’’ti? ‘‘Sāvatthiṃ kho ahaṃ, āvuso, gamissāmi bhagavantaṃ dassanāyā’’ti. ‘‘Ehi, bhante, gamissāmā’’ti. ‘‘Nāhaṃ, āvuso, sakkomi, gilānomhī’’ti. ‘‘Ehi, bhante, yānaṃ abhiruhā’’ti. ‘‘Alaṃ, āvuso, paṭikkhittaṃ bhagavatā yāna’’nti kukkuccāyanto yānaṃ nābhiruhi. Atha kho so bhikkhu sāvatthiṃ gantvā bhikkhūnaṃ etamatthaṃ ārocesi. Bhikkhū bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, gilānassa yānanti. Atha kho bhikkhūnaṃ etadahosi – ‘‘itthiyuttaṃ nu kho purisayuttaṃ nu kho’’ti? Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi , bhikkhave, purisayuttaṃ hatthavaṭṭakanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena kho pana samayena aññatarassa bhikkhuno yānugghātena bāḷhataraṃ aphāsu ahosi. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, sivikaṃ pāṭaṅkinti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Yānādipaṭikkhepo niṭṭhito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "154. Uccāsayanamahāsayanapaṭikkhepo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "254"
      },
      ". Tena kho pana samayena chabbaggiyā bhikkhū uccāsayanamahāsayanāni dhārenti, seyyathidaṃ – āsandiṃ, pallaṅkaṃ, gonakaṃ, cittakaṃ, paṭikaṃ, paṭalikaṃ, tūlikaṃ, vikatikaṃ, uddhalomiṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[undalomiṃ (ka.), uddalomiṃ (ka.)]"
      },
      ", ekantalomiṃ, kaṭṭissaṃ, koseyyaṃ ",
      ", kuttakaṃ, hatthattharaṃ, assattharaṃ, rathattharaṃ, ajinapaveṇiṃ, kadalimigapavarapaccattharaṇaṃ, sauttaracchadaṃ, ubhatolohitakūpadhānanti. Manussā vihāracārikaṃ āhiṇḍantā passitvā ujjhāyanti khiyyanti vipācenti – ‘‘seyyathāpi gihī kāmabhogino’’ti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, uccāsayanamahāsayanāni dhāretabbāni, seyyathidaṃ – āsandi, pallaṅko, gonako, cittako, paṭikā, paṭalikā, tūlikā, vikatikā, uddhalomi, ekantalomi, kaṭṭissaṃ, koseyyaṃ, kuttakaṃ, hatthattharaṃ, assattharaṃ, rathattharaṃ, ajinapaveṇi, kadalimigapavarapaccattharaṇaṃ, sauttaracchadaṃ, ubhatolohitakūpadhānaṃ. Yo dhāreyya, āpatti dukkaṭassāti."
    ],
    "innerText": "254. Tena kho pana samayena chabbaggiyā bhikkhū uccāsayanamahāsayanāni dhārenti, seyyathidaṃ – āsandiṃ, pallaṅkaṃ, gonakaṃ, cittakaṃ, paṭikaṃ, paṭalikaṃ, tūlikaṃ, vikatikaṃ, uddhalomiṃ [undalomiṃ (ka.), uddalomiṃ (ka.)], ekantalomiṃ, kaṭṭissaṃ, koseyyaṃ , kuttakaṃ, hatthattharaṃ, assattharaṃ, rathattharaṃ, ajinapaveṇiṃ, kadalimigapavarapaccattharaṇaṃ, sauttaracchadaṃ, ubhatolohitakūpadhānanti. Manussā vihāracārikaṃ āhiṇḍantā passitvā ujjhāyanti khiyyanti vipācenti – ‘‘seyyathāpi gihī kāmabhogino’’ti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, uccāsayanamahāsayanāni dhāretabbāni, seyyathidaṃ – āsandi, pallaṅko, gonako, cittako, paṭikā, paṭalikā, tūlikā, vikatikā, uddhalomi, ekantalomi, kaṭṭissaṃ, koseyyaṃ, kuttakaṃ, hatthattharaṃ, assattharaṃ, rathattharaṃ, ajinapaveṇi, kadalimigapavarapaccattharaṇaṃ, sauttaracchadaṃ, ubhatolohitakūpadhānaṃ. Yo dhāreyya, āpatti dukkaṭassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Uccāsayanamahāsayanapaṭikkhepo niṭṭhito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "155. Sabbacammapaṭikkhepo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "255"
      },
      ". Tena ",
      " kho pana samayena chabbaggiyā bhikkhū – bhagavatā uccāsayanamahāsayanāni paṭikkhittānīti – mahācammāni dhārenti, sīhacammaṃ byagghacammaṃ dīpicammaṃ. Tāni mañcappamāṇenapi chinnāni honti, pīṭhappamāṇenapi chinnāni honti, antopi mañce paññattāni honti, bahipi mañce paññattāni honti, antopi pīṭhe paññattāni honti, bahipi pīṭhe paññattāni honti. Manussā vihāracārikaṃ āhiṇḍantā passitvā ujjhāyanti khiyyanti vipācenti – ‘‘seyyathāpi gihī kāmabhogino’’ti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, mahācammāni dhāretabbāni, sīhacammaṃ byagghacammaṃ dīpicammaṃ. Yo dhāreyya, āpatti dukkaṭassāti."
    ],
    "innerText": "255. Tena kho pana samayena chabbaggiyā bhikkhū – bhagavatā uccāsayanamahāsayanāni paṭikkhittānīti – mahācammāni dhārenti, sīhacammaṃ byagghacammaṃ dīpicammaṃ. Tāni mañcappamāṇenapi chinnāni honti, pīṭhappamāṇenapi chinnāni honti, antopi mañce paññattāni honti, bahipi mañce paññattāni honti, antopi pīṭhe paññattāni honti, bahipi pīṭhe paññattāni honti. Manussā vihāracārikaṃ āhiṇḍantā passitvā ujjhāyanti khiyyanti vipācenti – ‘‘seyyathāpi gihī kāmabhogino’’ti. Bhagavato etamatthaṃ ārocesuṃ. Na, bhikkhave, mahācammāni dhāretabbāni, sīhacammaṃ byagghacammaṃ dīpicammaṃ. Yo dhāreyya, āpatti dukkaṭassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena kho pana samayena chabbaggiyā bhikkhū – bhagavatā mahācammāni paṭikkhittānīti – gocammāni dhārenti. Tāni mañcappamāṇenapi chinnāni honti, pīṭhappamāṇenapi chinnāni honti, antopi mañce paññattāni honti, bahipi mañce paññattāni honti, antopi pīṭhe paññattāni honti, bahipi pīṭhe paññattāni honti. Aññataropi pāpabhikkhu aññatarassa pāpupāsakassa kulūpako hoti. Atha kho so pāpabhikkhu pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya yena tassa pāpupāsakassa nivesanaṃ tenupasaṅkami, upasaṅkamitvā paññatte āsane nisīdi. Atha kho so ",
      " pāpupāsako yena so pāpabhikkhu tenupasaṅkami, upasaṅkamitvā taṃ pāpabhikkhuṃ abhivādetvā ",
      " ekamantaṃ nisīdi. Tena kho pana samayena tassa pāpupāsakassa vacchako hoti taruṇako abhirūpo dassanīyo ",
      " pāsādiko citro, seyyathāpi dīpicchāpo. Atha kho so pāpabhikkhu taṃ vacchakaṃ sakkaccaṃ upanijjhāyati. Atha kho so pāpupāsako taṃ pāpabhikkhuṃ etadavoca – ‘‘kissa, bhante, ayyo imaṃ vacchakaṃ sakkaccaṃ upanijjhāyatī’’ti? ‘‘Attho me, āvuso, imassa vacchakassa cammenā’’ti. Atha kho so pāpupāsako taṃ vacchakaṃ vadhitvā cammaṃ vidhunitvā tassa pāpabhikkhuno pādāsi. Atha kho so pāpabhikkhu taṃ cammaṃ saṅghāṭiyā paṭicchādetvā agamāsi. Atha kho sā gāvī vacchagiddhinī taṃ pāpabhikkhuṃ piṭṭhito piṭṭhito anubandhi. Bhikkhū evamāhaṃsu – ‘‘kissa tyāyaṃ, āvuso, gāvī piṭṭhito piṭṭhito anubandhī’’ti? ‘‘Ahampi kho, āvuso, na jānāmi kena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kenaci (ka.)]"
      },
      " myāyaṃ gāvī piṭṭhito piṭṭhito anubandhī’’ti. Tena kho pana samayena tassa pāpabhikkhuno saṅghāṭi lohitena makkhitā hoti. Bhikkhū evamāhaṃsu – ‘‘ayaṃ pana te, āvuso, saṅghāṭi kiṃ katā’’ti? Atha kho so pāpabhikkhu bhikkhūnaṃ ",
      " etamatthaṃ ārocesi. ‘‘Kiṃ pana tvaṃ, āvuso, pāṇātipāte samādapesī’’ti? ‘‘Evamāvuso’’ti. Ye te bhikkhū appicchā te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma bhikkhu pāṇātipāte samādapessati, nanu bhagavatā anekapariyāyena pāṇātipāto garahito, pāṇātipātā veramaṇī pasatthā’’ti. Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ."
    ],
    "innerText": "Tena kho pana samayena chabbaggiyā bhikkhū – bhagavatā mahācammāni paṭikkhittānīti – gocammāni dhārenti. Tāni mañcappamāṇenapi chinnāni honti, pīṭhappamāṇenapi chinnāni honti, antopi mañce paññattāni honti, bahipi mañce paññattāni honti, antopi pīṭhe paññattāni honti, bahipi pīṭhe paññattāni honti. Aññataropi pāpabhikkhu aññatarassa pāpupāsakassa kulūpako hoti. Atha kho so pāpabhikkhu pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya yena tassa pāpupāsakassa nivesanaṃ tenupasaṅkami, upasaṅkamitvā paññatte āsane nisīdi. Atha kho so pāpupāsako yena so pāpabhikkhu tenupasaṅkami, upasaṅkamitvā taṃ pāpabhikkhuṃ abhivādetvā ekamantaṃ nisīdi. Tena kho pana samayena tassa pāpupāsakassa vacchako hoti taruṇako abhirūpo dassanīyo pāsādiko citro, seyyathāpi dīpicchāpo. Atha kho so pāpabhikkhu taṃ vacchakaṃ sakkaccaṃ upanijjhāyati. Atha kho so pāpupāsako taṃ pāpabhikkhuṃ etadavoca – ‘‘kissa, bhante, ayyo imaṃ vacchakaṃ sakkaccaṃ upanijjhāyatī’’ti? ‘‘Attho me, āvuso, imassa vacchakassa cammenā’’ti. Atha kho so pāpupāsako taṃ vacchakaṃ vadhitvā cammaṃ vidhunitvā tassa pāpabhikkhuno pādāsi. Atha kho so pāpabhikkhu taṃ cammaṃ saṅghāṭiyā paṭicchādetvā agamāsi. Atha kho sā gāvī vacchagiddhinī taṃ pāpabhikkhuṃ piṭṭhito piṭṭhito anubandhi. Bhikkhū evamāhaṃsu – ‘‘kissa tyāyaṃ, āvuso, gāvī piṭṭhito piṭṭhito anubandhī’’ti? ‘‘Ahampi kho, āvuso, na jānāmi kena [kenaci (ka.)] myāyaṃ gāvī piṭṭhito piṭṭhito anubandhī’’ti. Tena kho pana samayena tassa pāpabhikkhuno saṅghāṭi lohitena makkhitā hoti. Bhikkhū evamāhaṃsu – ‘‘ayaṃ pana te, āvuso, saṅghāṭi kiṃ katā’’ti? Atha kho so pāpabhikkhu bhikkhūnaṃ etamatthaṃ ārocesi. ‘‘Kiṃ pana tvaṃ, āvuso, pāṇātipāte samādapesī’’ti? ‘‘Evamāvuso’’ti. Ye te bhikkhū appicchā te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma bhikkhu pāṇātipāte samādapessati, nanu bhagavatā anekapariyāyena pāṇātipāto garahito, pāṇātipātā veramaṇī pasatthā’’ti. Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ",
      " kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe bhikkhusaṅghaṃ sannipātāpetvā taṃ pāpabhikkhuṃ paṭipucchi – ‘‘saccaṃ kira tvaṃ, bhikkhu, pāṇātipāte samādapesī’’ti? Saccaṃ bhagavāti…pe… kathañhi nāma tvaṃ, moghapurisa, pāṇātipāte samādapessasi, nanu mayā, moghapurisa, anekapariyāyena pāṇātipāto garahito, pāṇātipātā veramaṇī pasatthā. Netaṃ, moghapurisa, appasannānaṃ vā pasādāya…pe… vigarahitvā dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘na, bhikkhave, pāṇātipāte samādapetabbaṃ. Yo samādapeyya, yathādhammo kāretabbo. Na, bhikkhave, gocammaṃ dhāretabbaṃ. Yo dhāreyya, āpatti dukkaṭassa. Na ca, bhikkhave, kiñci cammaṃ dhāretabbaṃ. Yo dhāreyya, āpatti dukkaṭassā’’ti."
    ],
    "innerText": "Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe bhikkhusaṅghaṃ sannipātāpetvā taṃ pāpabhikkhuṃ paṭipucchi – ‘‘saccaṃ kira tvaṃ, bhikkhu, pāṇātipāte samādapesī’’ti? Saccaṃ bhagavāti…pe… kathañhi nāma tvaṃ, moghapurisa, pāṇātipāte samādapessasi, nanu mayā, moghapurisa, anekapariyāyena pāṇātipāto garahito, pāṇātipātā veramaṇī pasatthā. Netaṃ, moghapurisa, appasannānaṃ vā pasādāya…pe… vigarahitvā dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘na, bhikkhave, pāṇātipāte samādapetabbaṃ. Yo samādapeyya, yathādhammo kāretabbo. Na, bhikkhave, gocammaṃ dhāretabbaṃ. Yo dhāreyya, āpatti dukkaṭassa. Na ca, bhikkhave, kiñci cammaṃ dhāretabbaṃ. Yo dhāreyya, āpatti dukkaṭassā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sabbacammapaṭikkhepo niṭṭhito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "156. Gihivikatānuññātādi"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "256"
      },
      ". Tena ",
      " kho pana samayena manussānaṃ mañcampi pīṭhampi cammonaddhāni honti, cammavinaddhāni. Bhikkhū kukkuccāyantā nābhinisīdanti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, gihivikataṃ abhinisīdituṃ, na tveva abhinipajjitunti."
    ],
    "innerText": "256. Tena kho pana samayena manussānaṃ mañcampi pīṭhampi cammonaddhāni honti, cammavinaddhāni. Bhikkhū kukkuccāyantā nābhinisīdanti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, gihivikataṃ abhinisīdituṃ, na tveva abhinipajjitunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena kho pana samayena vihārā cammavaddhehi ogumphiyanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ogumbhiyanti (ka.)]"
      },
      ". Bhikkhū kukkuccāyantā nābhinisīdanti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, bandhanamattaṃ abhinisīditunti."
    ],
    "innerText": "Tena kho pana samayena vihārā cammavaddhehi ogumphiyanti [ogumbhiyanti (ka.)]. Bhikkhū kukkuccāyantā nābhinisīdanti. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, bandhanamattaṃ abhinisīditunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena kho pana samayena chabbaggiyā bhikkhū saupāhanā gāmaṃ pavisanti. Manussā ujjhāyanti khiyyanti vipācenti – ‘‘seyyathāpi gihī kāmabhogino’’ti. Bhagavato etamatthaṃ ārocesuṃ ",
      ". Na, bhikkhave, saupāhanena ",
      " gāmo pavisitabbo. Yo paviseyya, āpatti dukkaṭassāti."
    ],
    "innerText": "Tena kho pana samayena chabbaggiyā bhikkhū saupāhanā gāmaṃ pavisanti. Manussā ujjhāyanti khiyyanti vipācenti – ‘‘seyyathāpi gihī kāmabhogino’’ti. Bhagavato etamatthaṃ ārocesuṃ . Na, bhikkhave, saupāhanena gāmo pavisitabbo. Yo paviseyya, āpatti dukkaṭassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena kho pana samayena aññataro bhikkhu gilāno hoti, na sakkoti vinā upāhanena gāmaṃ pavisituṃ. Bhagavato etamatthaṃ ārocesuṃ. Anujānāmi, bhikkhave, gilānena bhikkhunā saupāhanena gāmaṃ pavisitunti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Gihivikatānuññātādi niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "157. Soṇakuṭikaṇṇavatthu"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "257"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[udā. 46 sokasuttena saṃsanditvā passitabbaṃ]"
      },
      " Tena kho pana samayena āyasmā mahākaccāno avantīsu viharati kuraraghare ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kururaghare (ka.)]"
      },
      " papatake ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[papāte (sī. syā.) pavatthe (udā. 46)]"
      },
      " pabbate. Tena kho pana samayena soṇo upāsako kuṭikaṇṇo āyasmato mahākaccānassa upaṭṭhāko hoti. Atha kho soṇo upāsako kuṭikaṇṇo yenāyasmā mahākaccāno tenupasaṅkami, upasaṅkamitvā āyasmantaṃ mahākaccānaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho soṇo upāsako kuṭikaṇṇo āyasmantaṃ mahākaccānaṃ etadavoca – ‘‘yathā yathāhaṃ, bhante, ayyena mahākaccānena dhammaṃ desitaṃ ājānāmi, nayidaṃ sukaraṃ agāraṃ ajjhāvasatā ekantaparipuṇṇaṃ ekantaparisuddhaṃ saṅkhalikhitaṃ brahmacariyaṃ carituṃ. Icchāmahaṃ, bhante, kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajituṃ ",
      ". Pabbājetu maṃ, bhante, ayyo mahākaccāno’’ti. ( ) ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[(evaṃ vutte āyasmā mahākaccāyano soṇaṃ upāsakaṃ kuṭikaṇṇaṃ etadavoca) (syā. udā. 46)]"
      },
      " ‘‘Dukkaraṃ kho, soṇa, yāvajīvaṃ ekaseyyaṃ ekabhattaṃ brahmacariyaṃ carituṃ. Iṅgha, tvaṃ, soṇa ",
      ", tattheva agārikabhūto buddhānaṃ sāsanaṃ anuyuñja, kālayuttaṃ ekaseyyaṃ ekabhattaṃ brahmacariya’’nti. Atha kho soṇassa upāsakassa kuṭikaṇṇassa yo ahosi pabbajjābhisaṅkhāro so paṭippassambhi. Dutiyampi kho soṇo upāsako kuṭikaṇṇo ",
      "…pe… tatiyampi kho soṇo upāsako kuṭikaṇṇo yenāyasmā mahākaccāno tenupasaṅkami, upasaṅkamitvā āyasmantaṃ mahākaccānaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho soṇo upāsako kuṭikaṇṇo āyasmantaṃ mahākaccānaṃ etadavoca – ‘‘yathā yathāhaṃ, bhante, ayyena mahākaccānena dhammaṃ desitaṃ ājānāmi, nayidaṃ sukaraṃ agāraṃ ajjhāvasatā ekantaparipuṇṇaṃ ekantaparisuddhaṃ saṅkhalikhitaṃ brahmacariyaṃ carituṃ. Icchāmahaṃ, bhante, kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajituṃ. Pabbājetu maṃ, bhante, ayyo mahākaccāno’’ti. Atha kho āyasmā ",
      " mahākaccāno soṇaṃ upāsakaṃ kuṭikaṇṇaṃ pabbājesi. Tena kho pana samayena avantidakkhiṇāpatho appabhikkhuko hoti. Atha kho āyasmā mahākaccāno tiṇṇaṃ vassānaṃ accayena kicchena kasirena tato tato dasavaggaṃ bhikkhusaṅghaṃ sannipātāpetvā āyasmantaṃ soṇaṃ upasampādesi."
    ],
    "innerText": "257.[udā. 46 sokasuttena saṃsanditvā passitabbaṃ] Tena kho pana samayena āyasmā mahākaccāno avantīsu viharati kuraraghare [kururaghare (ka.)] papatake [papāte (sī. syā.) pavatthe (udā. 46)] pabbate. Tena kho pana samayena soṇo upāsako kuṭikaṇṇo āyasmato mahākaccānassa upaṭṭhāko hoti. Atha kho soṇo upāsako kuṭikaṇṇo yenāyasmā mahākaccāno tenupasaṅkami, upasaṅkamitvā āyasmantaṃ mahākaccānaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho soṇo upāsako kuṭikaṇṇo āyasmantaṃ mahākaccānaṃ etadavoca – ‘‘yathā yathāhaṃ, bhante, ayyena mahākaccānena dhammaṃ desitaṃ ājānāmi, nayidaṃ sukaraṃ agāraṃ ajjhāvasatā ekantaparipuṇṇaṃ ekantaparisuddhaṃ saṅkhalikhitaṃ brahmacariyaṃ carituṃ. Icchāmahaṃ, bhante, kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajituṃ . Pabbājetu maṃ, bhante, ayyo mahākaccāno’’ti. ( ) [(evaṃ vutte āyasmā mahākaccāyano soṇaṃ upāsakaṃ kuṭikaṇṇaṃ etadavoca) (syā. udā. 46)] ‘‘Dukkaraṃ kho, soṇa, yāvajīvaṃ ekaseyyaṃ ekabhattaṃ brahmacariyaṃ carituṃ. Iṅgha, tvaṃ, soṇa , tattheva agārikabhūto buddhānaṃ sāsanaṃ anuyuñja, kālayuttaṃ ekaseyyaṃ ekabhattaṃ brahmacariya’’nti. Atha kho soṇassa upāsakassa kuṭikaṇṇassa yo ahosi pabbajjābhisaṅkhāro so paṭippassambhi. Dutiyampi kho soṇo upāsako kuṭikaṇṇo …pe… tatiyampi kho soṇo upāsako kuṭikaṇṇo yenāyasmā mahākaccāno tenupasaṅkami, upasaṅkamitvā āyasmantaṃ mahākaccānaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho soṇo upāsako kuṭikaṇṇo āyasmantaṃ mahākaccānaṃ etadavoca – ‘‘yathā yathāhaṃ, bhante, ayyena mahākaccānena dhammaṃ desitaṃ ājānāmi, nayidaṃ sukaraṃ agāraṃ ajjhāvasatā ekantaparipuṇṇaṃ ekantaparisuddhaṃ saṅkhalikhitaṃ brahmacariyaṃ carituṃ. Icchāmahaṃ, bhante, kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajituṃ. Pabbājetu maṃ, bhante, ayyo mahākaccāno’’ti. Atha kho āyasmā mahākaccāno soṇaṃ upāsakaṃ kuṭikaṇṇaṃ pabbājesi. Tena kho pana samayena avantidakkhiṇāpatho appabhikkhuko hoti. Atha kho āyasmā mahākaccāno tiṇṇaṃ vassānaṃ accayena kicchena kasirena tato tato dasavaggaṃ bhikkhusaṅghaṃ sannipātāpetvā āyasmantaṃ soṇaṃ upasampādesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Soṇakuṭikaṇṇavatthu niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "158. Mahākaccānassa pañcavaraparidassanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho āyasmato soṇassa vassaṃvuṭṭhassa rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘‘sutoyeva kho me so bhagavā ediso ca ediso cāti, na ca mayā sammukhā ",
      " diṭṭho, gaccheyyāhaṃ taṃ bhagavantaṃ dassanāya arahantaṃ sammāsambuddhaṃ, sace maṃ upajjhāyo anujāneyyā’’ti. Atha kho āyasmā soṇo sāyanhasamayaṃ paṭisallānā vuṭṭhito yenāyasmā mahākaccāno tenupasaṅkami, upasaṅkamitvā āyasmantaṃ mahākaccānaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā soṇo āyasmantaṃ mahākaccānaṃ etadavoca – ‘‘idha mayhaṃ, bhante, rahogatassa ",
      " paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘suto yeva kho me so bhagavā ediso ca ediso cāti, na ca mayā sammukhā diṭṭho, gaccheyyāhaṃ taṃ bhagavantaṃ dassanāya arahantaṃ sammāsambuddhaṃ, sace maṃ upajjhāyo anujāneyyā’ti; gaccheyyāhaṃ, bhante, taṃ bhagavantaṃ dassanāya arahantaṃ sammāsambuddhaṃ, sace maṃ upajjhāyo anujānātī’’ti. ‘‘Sādhu sādhu, soṇa. Gaccha tvaṃ, soṇa, taṃ bhagavantaṃ dassanāya arahantaṃ sammāsambuddhaṃ. Dakkhissasi tvaṃ, soṇa, taṃ bhagavantaṃ pāsādikaṃ pasādanīyaṃ santindriyaṃ santamānasaṃ uttamadamathasamathaṃ amanuppattaṃ dantaṃ guttaṃ yatindriyaṃ nāgaṃ. Tena hi tvaṃ, soṇa, mama vacanena bhagavato pāde sirasā vanda – ‘upajjhāyo me, bhante, āyasmā mahākaccāno bhagavato pāde sirasā vandatī’’’ti. Evañca vadehi – ‘‘avantidakkhiṇāpatho, bhante, appabhikkhuko, tiṇṇaṃ me vassānaṃ accayena kicchena kasirena tato tato dasavaggaṃ bhikkhusaṅghaṃ sannipātāpetvā upasampadaṃ alatthaṃ; appeva nāma bhagavā avantidakkhiṇāpathe ",
      " appatarena gaṇena upasampadaṃ anujāneyya. Avantidakkhiṇāpathe, bhante, kaṇhuttarā bhūmi kharā gokaṇṭakahatā; appeva nāma bhagavā avantidakkhiṇāpathe ",
      " guṇaṅguṇūpāhanaṃ anujāneyya. Avantidakkhiṇāpathe, bhante, nahānagarukā manussā udakasuddhikā; appeva nāma bhagavā avantidakkhiṇāpathe dhuvanahānaṃ anujāneyya. Avantidakkhiṇāpathe, bhante, cammāni attharaṇāni, eḷakacammaṃ ",
      " ajacammaṃ migacammaṃ. Seyyathāpi, bhante, majjhimesu janapadesu eragū moragū majjārū ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[majjhārū (ka.)]"
      },
      " jantū, evameva kho, bhante, avantidakkhiṇāpathe cammāni attharaṇāni, eḷakacammaṃ ajacammaṃ migacammaṃ; appeva nāma bhagavā avantidakkhiṇāpathe cammāni attharaṇāni anujāneyya, eḷakacammaṃ ajacammaṃ migacammaṃ. Etarahi, bhante, manussā nissīmagatānaṃ bhikkhūnaṃ cīvaraṃ denti – ‘imaṃ cīvaraṃ itthannāmassa demā’’’ti. Te āgantvā ārocenti – ‘itthannāmehi te, āvuso, manussehi cīvaraṃ dinna’nti te kukkuccāyantā na sādiyanti – ‘mā no nissaggiyaṃ ahosī’ti; appeva nāma bhagavā cīvare pariyāyaṃ ācikkheyyā’’ti. ‘‘Evaṃ, bhante’’ti kho āyasmā soṇo āyasmato mahākaccānassa paṭissutvā uṭṭhāyāsanā āyasmantaṃ mahākaccānaṃ abhivādetvā padakkhiṇaṃ katvā senāsanaṃ saṃsāmetvā pattacīvaramādāya ",
      " yena sāvatthi tena pakkāmi. Anupubbena yena sāvatthi jetavanaṃ anāthapiṇḍikassa ārāmo yena bhagavā tenupasaṅkami, upasaṅkamitvā bhagavantaṃ abhivādetvā ",
      " ekamantaṃ nisīdi. Atha kho bhagavā āyasmantaṃ ānandaṃ āmantesi – ‘‘imassa, ānanda, āgantukassa bhikkhuno senāsanaṃ paññāpehī’’ti. Atha kho āyasmā ānando – ‘‘yassa kho maṃ bhagavā āṇāpeti, ‘imassa, ānanda, āgantukassa bhikkhuno senāsanaṃ paññāpehī’ti, icchati bhagavā tena bhikkhunā saddhiṃ ekavihāre vatthuṃ, icchati bhagavā āyasmatā soṇena saddhiṃ ekavihāre vatthu’’nti – yasmiṃ vihāre bhagavā viharati tasmiṃ vihāre āyasmato soṇassa senāsanaṃ paññāpesi."
    ],
    "innerText": "Atha kho āyasmato soṇassa vassaṃvuṭṭhassa rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘‘sutoyeva kho me so bhagavā ediso ca ediso cāti, na ca mayā sammukhā diṭṭho, gaccheyyāhaṃ taṃ bhagavantaṃ dassanāya arahantaṃ sammāsambuddhaṃ, sace maṃ upajjhāyo anujāneyyā’’ti. Atha kho āyasmā soṇo sāyanhasamayaṃ paṭisallānā vuṭṭhito yenāyasmā mahākaccāno tenupasaṅkami, upasaṅkamitvā āyasmantaṃ mahākaccānaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā soṇo āyasmantaṃ mahākaccānaṃ etadavoca – ‘‘idha mayhaṃ, bhante, rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘suto yeva kho me so bhagavā ediso ca ediso cāti, na ca mayā sammukhā diṭṭho, gaccheyyāhaṃ taṃ bhagavantaṃ dassanāya arahantaṃ sammāsambuddhaṃ, sace maṃ upajjhāyo anujāneyyā’ti; gaccheyyāhaṃ, bhante, taṃ bhagavantaṃ dassanāya arahantaṃ sammāsambuddhaṃ, sace maṃ upajjhāyo anujānātī’’ti. ‘‘Sādhu sādhu, soṇa. Gaccha tvaṃ, soṇa, taṃ bhagavantaṃ dassanāya arahantaṃ sammāsambuddhaṃ. Dakkhissasi tvaṃ, soṇa, taṃ bhagavantaṃ pāsādikaṃ pasādanīyaṃ santindriyaṃ santamānasaṃ uttamadamathasamathaṃ amanuppattaṃ dantaṃ guttaṃ yatindriyaṃ nāgaṃ. Tena hi tvaṃ, soṇa, mama vacanena bhagavato pāde sirasā vanda – ‘upajjhāyo me, bhante, āyasmā mahākaccāno bhagavato pāde sirasā vandatī’’’ti. Evañca vadehi – ‘‘avantidakkhiṇāpatho, bhante, appabhikkhuko, tiṇṇaṃ me vassānaṃ accayena kicchena kasirena tato tato dasavaggaṃ bhikkhusaṅghaṃ sannipātāpetvā upasampadaṃ alatthaṃ; appeva nāma bhagavā avantidakkhiṇāpathe appatarena gaṇena upasampadaṃ anujāneyya. Avantidakkhiṇāpathe, bhante, kaṇhuttarā bhūmi kharā gokaṇṭakahatā; appeva nāma bhagavā avantidakkhiṇāpathe guṇaṅguṇūpāhanaṃ anujāneyya. Avantidakkhiṇāpathe, bhante, nahānagarukā manussā udakasuddhikā; appeva nāma bhagavā avantidakkhiṇāpathe dhuvanahānaṃ anujāneyya. Avantidakkhiṇāpathe, bhante, cammāni attharaṇāni, eḷakacammaṃ ajacammaṃ migacammaṃ. Seyyathāpi, bhante, majjhimesu janapadesu eragū moragū majjārū [majjhārū (ka.)] jantū, evameva kho, bhante, avantidakkhiṇāpathe cammāni attharaṇāni, eḷakacammaṃ ajacammaṃ migacammaṃ; appeva nāma bhagavā avantidakkhiṇāpathe cammāni attharaṇāni anujāneyya, eḷakacammaṃ ajacammaṃ migacammaṃ. Etarahi, bhante, manussā nissīmagatānaṃ bhikkhūnaṃ cīvaraṃ denti – ‘imaṃ cīvaraṃ itthannāmassa demā’’’ti. Te āgantvā ārocenti – ‘itthannāmehi te, āvuso, manussehi cīvaraṃ dinna’nti te kukkuccāyantā na sādiyanti – ‘mā no nissaggiyaṃ ahosī’ti; appeva nāma bhagavā cīvare pariyāyaṃ ācikkheyyā’’ti. ‘‘Evaṃ, bhante’’ti kho āyasmā soṇo āyasmato mahākaccānassa paṭissutvā uṭṭhāyāsanā āyasmantaṃ mahākaccānaṃ abhivādetvā padakkhiṇaṃ katvā senāsanaṃ saṃsāmetvā pattacīvaramādāya yena sāvatthi tena pakkāmi. Anupubbena yena sāvatthi jetavanaṃ anāthapiṇḍikassa ārāmo yena bhagavā tenupasaṅkami, upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Atha kho bhagavā āyasmantaṃ ānandaṃ āmantesi – ‘‘imassa, ānanda, āgantukassa bhikkhuno senāsanaṃ paññāpehī’’ti. Atha kho āyasmā ānando – ‘‘yassa kho maṃ bhagavā āṇāpeti, ‘imassa, ānanda, āgantukassa bhikkhuno senāsanaṃ paññāpehī’ti, icchati bhagavā tena bhikkhunā saddhiṃ ekavihāre vatthuṃ, icchati bhagavā āyasmatā soṇena saddhiṃ ekavihāre vatthu’’nti – yasmiṃ vihāre bhagavā viharati tasmiṃ vihāre āyasmato soṇassa senāsanaṃ paññāpesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "258"
      },
      ". Atha kho bhagavā bahudeva rattiṃ ajjhokāse vītināmetvā vihāraṃ pāvisi. Āyasmāpi kho soṇo bahudeva rattiṃ ajjhokāse vītināmetvā vihāraṃ pāvisi. Atha kho bhagavā rattiyā paccūsasamayaṃ paccuṭṭhāya āyasmantaṃ soṇaṃ ajjhesi – ‘‘paṭibhātu taṃ, bhikkhu, dhammo bhāsitu’’nti. ‘‘Evaṃ, bhante’’ti kho āyasmā soṇo bhagavato paṭissuṇitvā sabbāneva aṭṭhakavaggikāni sarena abhāsi. Atha kho bhagavā āyasmato soṇassa sarabhaññapariyosāne abbhānumodi – ‘‘sādhu, sādhu, bhikkhu. Suggahitāni kho te, bhikkhu, aṭṭhakavaggikāni ",
      ", sumanasikatāni sūpadhāritāni. Kalyāṇiyāpi vācāya samannāgato, vissaṭṭhāya, anelagalāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[aneḷagalāya (ka.)]"
      },
      ", atthassa viññāpaniyā. Kativassosi tvaṃ, bhikkhū’’ti? ‘‘Ekavassohaṃ, bhagavā’’ti. ‘‘Kissa pana tvaṃ, bhikkhu, evaṃ ciraṃ akāsī’’ti? ‘‘Ciraṃ diṭṭho me, bhante, kāmesu ādīnavo, api ca sambādhā ",
      " gharāvāsā bahukiccā bahukaraṇīyā’’ti. Atha kho bhagavā etamatthaṃ viditvā tāyaṃ velāyaṃ imaṃ udānaṃ udānesi –"
    ],
    "innerText": "258. Atha kho bhagavā bahudeva rattiṃ ajjhokāse vītināmetvā vihāraṃ pāvisi. Āyasmāpi kho soṇo bahudeva rattiṃ ajjhokāse vītināmetvā vihāraṃ pāvisi. Atha kho bhagavā rattiyā paccūsasamayaṃ paccuṭṭhāya āyasmantaṃ soṇaṃ ajjhesi – ‘‘paṭibhātu taṃ, bhikkhu, dhammo bhāsitu’’nti. ‘‘Evaṃ, bhante’’ti kho āyasmā soṇo bhagavato paṭissuṇitvā sabbāneva aṭṭhakavaggikāni sarena abhāsi. Atha kho bhagavā āyasmato soṇassa sarabhaññapariyosāne abbhānumodi – ‘‘sādhu, sādhu, bhikkhu. Suggahitāni kho te, bhikkhu, aṭṭhakavaggikāni , sumanasikatāni sūpadhāritāni. Kalyāṇiyāpi vācāya samannāgato, vissaṭṭhāya, anelagalāya [aneḷagalāya (ka.)], atthassa viññāpaniyā. Kativassosi tvaṃ, bhikkhū’’ti? ‘‘Ekavassohaṃ, bhagavā’’ti. ‘‘Kissa pana tvaṃ, bhikkhu, evaṃ ciraṃ akāsī’’ti? ‘‘Ciraṃ diṭṭho me, bhante, kāmesu ādīnavo, api ca sambādhā gharāvāsā bahukiccā bahukaraṇīyā’’ti. Atha kho bhagavā etamatthaṃ viditvā tāyaṃ velāyaṃ imaṃ udānaṃ udānesi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[udā. 46 udānepi]"
      },
      " ‘‘Disvā ",
      " ādīnavaṃ loke, ñatvā dhammaṃ nirūpadhiṃ;"
    ],
    "innerText": "[udā. 46 udānepi] ‘‘Disvā ādīnavaṃ loke, ñatvā dhammaṃ nirūpadhiṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ariyo na ramatī pāpe, pāpe na ramatī sucī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha kho āyasmā soṇo – paṭisammodati kho maṃ bhagavā, ayaṃ khvassa kālo yaṃ me upajjhāyo paridassīti – uṭṭhāyāsanā ekaṃsaṃ uttarāsaṅgaṃ karitvā bhagavato pādesu sirasā nipatitvā bhagavantaṃ ",
      " etadavoca – ‘‘upajjhāyo me, bhante, āyasmā mahākaccāno bhagavato pāde sirasā vandati, evañca vadeti avantidakkhiṇāpatho, bhante, appabhikkhuko. Tiṇṇaṃ me vassānaṃ accayena kicchena kasirena tato tato dasavaggaṃ bhikkhusaṅghaṃ sannipātāpetvā upasampadaṃ alatthaṃ, appeva nāma bhagavā avantidakkhiṇāpathe appatarena gaṇena upasampadaṃ anujāneyya. Avantidakkhiṇāpathe, bhante, kaṇhuttarā bhūmi kharā gokaṇṭakahatā; appeva nāma bhagavā avantidakkhiṇāpathe guṇaṅguṇūpāhanaṃ anujāneyya. Avantidakkhiṇāpathe, bhante, nahānagarukā manussā udakasuddhikā, appeva nāma bhagavā avantidakkhiṇāpathe dhuvanahānaṃ anujāneyya. Avantidakkhiṇāpathe, bhante, cammāni attharaṇāni, eḷakacammaṃ ajacammaṃ migacammaṃ. Seyyathāpi, bhante, majjhimesu janapadesu eragū moragū majjārū jantū ",
      ", evameva kho, bhante, avantidakkhiṇāpathe cammāni attharaṇāni, eḷakacammaṃ ajacammaṃ migacammaṃ; appeva nāma bhagavā avantidakkhiṇāpathe cammāni attharaṇāni anujāneyya, eḷakacammaṃ ajacammaṃ migacammaṃ. Etarahi, bhante, manussā nissīmagatānaṃ bhikkhūnaṃ cīvaraṃ denti – ‘imaṃ cīvaraṃ itthannāmassa demā’ti. Te āgantvā ārocenti – ‘itthannāmehi te, āvuso, manussehi cīvaraṃ dinna’nti. Te kukkuccāyantā na sādiyanti – ‘mā no nissaggiyaṃ ahosī’ti; appeva nāma bhagavā cīvare pariyāyaṃ ācikkheyyā’’ti."
    ],
    "innerText": "Atha kho āyasmā soṇo – paṭisammodati kho maṃ bhagavā, ayaṃ khvassa kālo yaṃ me upajjhāyo paridassīti – uṭṭhāyāsanā ekaṃsaṃ uttarāsaṅgaṃ karitvā bhagavato pādesu sirasā nipatitvā bhagavantaṃ etadavoca – ‘‘upajjhāyo me, bhante, āyasmā mahākaccāno bhagavato pāde sirasā vandati, evañca vadeti avantidakkhiṇāpatho, bhante, appabhikkhuko. Tiṇṇaṃ me vassānaṃ accayena kicchena kasirena tato tato dasavaggaṃ bhikkhusaṅghaṃ sannipātāpetvā upasampadaṃ alatthaṃ, appeva nāma bhagavā avantidakkhiṇāpathe appatarena gaṇena upasampadaṃ anujāneyya. Avantidakkhiṇāpathe, bhante, kaṇhuttarā bhūmi kharā gokaṇṭakahatā; appeva nāma bhagavā avantidakkhiṇāpathe guṇaṅguṇūpāhanaṃ anujāneyya. Avantidakkhiṇāpathe, bhante, nahānagarukā manussā udakasuddhikā, appeva nāma bhagavā avantidakkhiṇāpathe dhuvanahānaṃ anujāneyya. Avantidakkhiṇāpathe, bhante, cammāni attharaṇāni, eḷakacammaṃ ajacammaṃ migacammaṃ. Seyyathāpi, bhante, majjhimesu janapadesu eragū moragū majjārū jantū , evameva kho, bhante, avantidakkhiṇāpathe cammāni attharaṇāni, eḷakacammaṃ ajacammaṃ migacammaṃ; appeva nāma bhagavā avantidakkhiṇāpathe cammāni attharaṇāni anujāneyya, eḷakacammaṃ ajacammaṃ migacammaṃ. Etarahi, bhante, manussā nissīmagatānaṃ bhikkhūnaṃ cīvaraṃ denti – ‘imaṃ cīvaraṃ itthannāmassa demā’ti. Te āgantvā ārocenti – ‘itthannāmehi te, āvuso, manussehi cīvaraṃ dinna’nti. Te kukkuccāyantā na sādiyanti – ‘mā no nissaggiyaṃ ahosī’ti; appeva nāma bhagavā cīvare pariyāyaṃ ācikkheyyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "259"
      },
      ". Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘avantidakkhiṇāpatho, bhikkhave, appabhikkhuko. Anujānāmi, bhikkhave, sabbapaccantimesu janapadesu vinayadharapañcamena gaṇena upasampadaṃ. Tatrime paccantimā janapadā – puratthimāya disāya gajaṅgalaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[kajaṅgalaṃ (sī. syā.)]"
      },
      " nāma nigamo, tassa parena mahāsālā, tato parā paccantimā janapadā, orato majjhe; puratthimadakkhiṇāya disāya sallavatī ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[salalavatī (sī.)]"
      },
      " nāma nadī, tato parā paccantimā janapadā, orato majjhe; dakkhiṇāya disāya setakaṇṇikaṃ nāma nigamo, tato parā paccantimā janapadā, orato majjhe; pacchimāya disāya thūṇaṃ nāma brāhmaṇagāmo, tato parā paccantimā janapadā, orato majjhe; uttarāya ",
      " disāya usīraddhajo nāma pabbato, tato parā paccantimā janapadā, orato majjhe ",
      ". Anujānāmi, bhikkhave, evarūpesu paccantimesu ",
      " janapadesu vinayadharapañcamena gaṇena upasampadaṃ. Avantidakkhiṇāpathe, bhikkhave, kaṇhuttarā bhūmi kharā gokaṇṭakahatā. Anujānāmi, bhikkhave, sabbapaccantimesu janapadesu guṇaṅguṇūpāhanaṃ. Avantidakkhiṇāpathe, bhikkhave, nahānagarukā manussā udakasuddhikā. Anujānāmi, bhikkhave, sabbapaccantimesu janapadesu dhuvanahānaṃ. Avantidakkhiṇāpathe, bhikkhave, cammāni attharaṇāni, eḷakacammaṃ ajacammaṃ ",
      " migacammaṃ. Seyyathāpi, bhikkhave, majjhimesu janapadesu eragū moragū majjārū jantū, evameva kho, bhikkhave, avantidakkhiṇāpathe cammāni attharaṇāni, eḷakacammaṃ ajacammaṃ migacammaṃ. Anujānāmi, bhikkhave, sabbapaccantimesu janapadesu cammāni attharaṇāni, eḷakacammaṃ ajacammaṃ migacammaṃ. Idha pana, bhikkhave, manussā nissīmagatānaṃ bhikkhūnaṃ cīvaraṃ denti – ‘imaṃ cīvaraṃ itthannāmassa demā’ti. Anujānāmi, bhikkhave, sādituṃ, na tāva taṃ gaṇanūpagaṃ yāva na hatthaṃ gacchatī’’ti."
    ],
    "innerText": "259. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘avantidakkhiṇāpatho, bhikkhave, appabhikkhuko. Anujānāmi, bhikkhave, sabbapaccantimesu janapadesu vinayadharapañcamena gaṇena upasampadaṃ. Tatrime paccantimā janapadā – puratthimāya disāya gajaṅgalaṃ [kajaṅgalaṃ (sī. syā.)] nāma nigamo, tassa parena mahāsālā, tato parā paccantimā janapadā, orato majjhe; puratthimadakkhiṇāya disāya sallavatī [salalavatī (sī.)] nāma nadī, tato parā paccantimā janapadā, orato majjhe; dakkhiṇāya disāya setakaṇṇikaṃ nāma nigamo, tato parā paccantimā janapadā, orato majjhe; pacchimāya disāya thūṇaṃ nāma brāhmaṇagāmo, tato parā paccantimā janapadā, orato majjhe; uttarāya disāya usīraddhajo nāma pabbato, tato parā paccantimā janapadā, orato majjhe . Anujānāmi, bhikkhave, evarūpesu paccantimesu janapadesu vinayadharapañcamena gaṇena upasampadaṃ. Avantidakkhiṇāpathe, bhikkhave, kaṇhuttarā bhūmi kharā gokaṇṭakahatā. Anujānāmi, bhikkhave, sabbapaccantimesu janapadesu guṇaṅguṇūpāhanaṃ. Avantidakkhiṇāpathe, bhikkhave, nahānagarukā manussā udakasuddhikā. Anujānāmi, bhikkhave, sabbapaccantimesu janapadesu dhuvanahānaṃ. Avantidakkhiṇāpathe, bhikkhave, cammāni attharaṇāni, eḷakacammaṃ ajacammaṃ migacammaṃ. Seyyathāpi, bhikkhave, majjhimesu janapadesu eragū moragū majjārū jantū, evameva kho, bhikkhave, avantidakkhiṇāpathe cammāni attharaṇāni, eḷakacammaṃ ajacammaṃ migacammaṃ. Anujānāmi, bhikkhave, sabbapaccantimesu janapadesu cammāni attharaṇāni, eḷakacammaṃ ajacammaṃ migacammaṃ. Idha pana, bhikkhave, manussā nissīmagatānaṃ bhikkhūnaṃ cīvaraṃ denti – ‘imaṃ cīvaraṃ itthannāmassa demā’ti. Anujānāmi, bhikkhave, sādituṃ, na tāva taṃ gaṇanūpagaṃ yāva na hatthaṃ gacchatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Mahākaccānassa pañcavaraparidassanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Cammakkhandhako pañcamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "159. Tassuddānaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Rājā ca māgadho soṇo, asītisahassissaro;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sāgato gijjhakūṭasmiṃ, bahuṃ dasseti uttariṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Pabbajjāraddhabhijjiṃsu ",
      ", vīṇaṃ ekapalāsikaṃ;"
    ],
    "innerText": "Pabbajjāraddhabhijjiṃsu , vīṇaṃ ekapalāsikaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nīlā pītā lohitikā, mañjiṭṭhā kaṇhameva ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Mahāraṅgamahānāmā, vaddhikā ca paṭikkhipi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Khallakā puṭapāli ca, tūlatittirameṇḍajā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Vicchikā moracitrā ca, sīhabyagghā ca dīpikā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ajinuddā majjārī ca, kāḷaluvakaparikkhaṭā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Phalitupāhanā ",
      " khilā, dhotakhāṇukhaṭakhaṭā;"
    ],
    "innerText": "Phalitupāhanā khilā, dhotakhāṇukhaṭakhaṭā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tālaveḷutiṇaṃ ceva, muñjapabbajahintālā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Kamalakambalasovaṇṇā ",
      ", rūpikā maṇiveḷuriyā;"
    ],
    "innerText": "Kamalakambalasovaṇṇā , rūpikā maṇiveḷuriyā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Phalikā kaṃsakācā ca, tipusīsañca tambakā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Gāvī yānaṃ gilāno ca, purisāyuttasivikā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sayanāni mahācammā, gocammehi ca pāpako."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Gihīnaṃ cammavaddhehi, pavisanti gilāyano;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Mahākaccāyano soṇo, sarena aṭṭhakavaggikaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Upasampadaṃ pañcahi, guṇaṅguṇā dhuvasinā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Cammattharaṇānuññāsi, na tāva gaṇanūpagaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Adāsi me vare pañca, soṇattherassa nāyakoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Imamhi khandhake vatthūni tesaṭṭhi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Cammakkhandhako niṭṭhito."
  }
]