[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "8. Vattakkhandhakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Āgantukavattakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "356"
      },
      ". Tena ",
      " samayena buddho bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena āgantukā bhikkhū saupāhanāpi ārāmaṃ pavisanti, chattapaggahitāpi ārāmaṃ pavisanti, oguṇṭhitāpi ārāmaṃ pavisanti, sīsepi cīvaraṃ karitvā ārāmaṃ pavisanti, pānīyenapi pāde dhovanti, vuḍḍhatarepi āvāsike bhikkhū na abhivādenti, napi senāsanaṃ pucchanti. Aññataropi āgantuko bhikkhu anajjhāvuṭṭhaṃ vihāraṃ ghaṭikaṃ ugghāṭetvā kavāṭaṃ paṇāmetvā sahasā pāvisi. Tassa uparipiṭṭhito ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[uparipiṭṭhato (?)]"
      },
      " ahi khandhe papati. So bhīto vissaramakāsi. Bhikkhū upadhāvitvā taṃ bhikkhuṃ etadavocuṃ – ‘‘kissa tvaṃ, āvuso, vissaramakāsī’’ti? Atha kho so bhikkhu bhikkhūnaṃ etamatthaṃ ārocesi. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma āgantukā bhikkhū saupāhanāpi ārāmaṃ pavisissanti, chattapaggahitāpi ārāmaṃ pavisissanti, oguṇṭhitāpi ārāmaṃ pavisissanti, sīsepi cīvaraṃ karitvā ārāmaṃ pavisissanti, pānīyenapi pāde dhovissanti, vuḍḍhatarepi āvāsike bhikkhū na abhivādessanti, napi senāsanaṃ pucchissantī’’ti! Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… ‘‘saccaṃ ",
      " kira, bhikkhave, ‘‘āgantukā bhikkhū saupāhanāpi ārāmaṃ pavisanti, chattapaggahitāpi ārāmaṃ pavisanti, oguṇṭhitāpi ārāmaṃ pavisanti, sīsepi cīvaraṃ karitvā ārāmaṃ pavisanti, pānīyenipi pāde dhovanti, vuḍḍhatarepi āvāsike bhikkhū na abhivādenti, napi senāsanaṃ pucchantīti. Saccaṃ bhagavāti. Vigarahi buddho bhagavā…pe… kathañhi nāma bhikkhave āgantukā bhikkhū saupāhanāpi ārāmaṃ pavisissanti, chattapaggahitāpi ārāmaṃ pavisissanti, oguṇṭhitāpi ārāmaṃ pavisissanti, sīsepi cīvaraṃ karitvā ārāmaṃ pavisissanti, pānīyenapi pāde dhovissanti, vuḍḍhatarepi āvāsike ",
      " bhikkhū na abhivādessanti, napi senāsanaṃ pucchissanti, netaṃ bhikkhave appasannānaṃ vā pasādāya…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi –"
    ],
    "innerText": "356. Tena samayena buddho bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena āgantukā bhikkhū saupāhanāpi ārāmaṃ pavisanti, chattapaggahitāpi ārāmaṃ pavisanti, oguṇṭhitāpi ārāmaṃ pavisanti, sīsepi cīvaraṃ karitvā ārāmaṃ pavisanti, pānīyenapi pāde dhovanti, vuḍḍhatarepi āvāsike bhikkhū na abhivādenti, napi senāsanaṃ pucchanti. Aññataropi āgantuko bhikkhu anajjhāvuṭṭhaṃ vihāraṃ ghaṭikaṃ ugghāṭetvā kavāṭaṃ paṇāmetvā sahasā pāvisi. Tassa uparipiṭṭhito [uparipiṭṭhato (?)] ahi khandhe papati. So bhīto vissaramakāsi. Bhikkhū upadhāvitvā taṃ bhikkhuṃ etadavocuṃ – ‘‘kissa tvaṃ, āvuso, vissaramakāsī’’ti? Atha kho so bhikkhu bhikkhūnaṃ etamatthaṃ ārocesi. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma āgantukā bhikkhū saupāhanāpi ārāmaṃ pavisissanti, chattapaggahitāpi ārāmaṃ pavisissanti, oguṇṭhitāpi ārāmaṃ pavisissanti, sīsepi cīvaraṃ karitvā ārāmaṃ pavisissanti, pānīyenapi pāde dhovissanti, vuḍḍhatarepi āvāsike bhikkhū na abhivādessanti, napi senāsanaṃ pucchissantī’’ti! Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… ‘‘saccaṃ kira, bhikkhave, ‘‘āgantukā bhikkhū saupāhanāpi ārāmaṃ pavisanti, chattapaggahitāpi ārāmaṃ pavisanti, oguṇṭhitāpi ārāmaṃ pavisanti, sīsepi cīvaraṃ karitvā ārāmaṃ pavisanti, pānīyenipi pāde dhovanti, vuḍḍhatarepi āvāsike bhikkhū na abhivādenti, napi senāsanaṃ pucchantīti. Saccaṃ bhagavāti. Vigarahi buddho bhagavā…pe… kathañhi nāma bhikkhave āgantukā bhikkhū saupāhanāpi ārāmaṃ pavisissanti, chattapaggahitāpi ārāmaṃ pavisissanti, oguṇṭhitāpi ārāmaṃ pavisissanti, sīsepi cīvaraṃ karitvā ārāmaṃ pavisissanti, pānīyenapi pāde dhovissanti, vuḍḍhatarepi āvāsike bhikkhū na abhivādessanti, napi senāsanaṃ pucchissanti, netaṃ bhikkhave appasannānaṃ vā pasādāya…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "357"
      },
      ". ‘‘Tena ",
      " hi, bhikkhave, āgantukānaṃ bhikkhūnaṃ vattaṃ paññapessāmi yathā āgantukehi bhikkhūhi sammā vattitabbaṃ. Āgantukena, bhikkhave, bhikkhunā ‘idāni ārāmaṃ pavisissāmī’ti upāhanā omuñcitvā ",
      " nīcaṃ katvā papphoṭetvā gahetvā chattaṃ apanāmetvā sīsaṃ vivaritvā sīse cīvaraṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[vivaritvā cīvaraṃ (ka.)]"
      },
      " khandhe katvā sādhukaṃ ataramānena ārāmo pavisitabbo. Ārāmaṃ pavisantena sallakkhetabbaṃ – ‘kattha ",
      " āvāsikā bhikkhū paṭikkamantī’ti? Yattha āvāsikā bhikkhū paṭikkamanti – upaṭṭhānasālāya vā maṇḍape vā rukkhamūle vā – tattha gantvā ekamantaṃ patto nikkhipitabbo; ekamantaṃ cīvaraṃ nikkhipitabbaṃ; patirūpaṃ āsanaṃ gahetvā nisīditabbaṃ; pānīyaṃ pucchitabbaṃ, paribhojanīyaṃ pucchitabbaṃ – ‘katamaṃ pānīyaṃ, katamaṃ paribhojanīya’nti? Sace pānīyena attho hoti, pānīyaṃ gahetvā pātabbaṃ. Sace paribhojanīyena attho hoti, paribhojanīyaṃ gahetvā pādā dhovitabbā. Pāde dhovantena ekena hatthena udakaṃ āsiñcitabbaṃ, ekena hatthena pādā dhovitabbā. Teneva udakaṃ āsiñcitabbaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yena hatthena udakaṃ āsiñcitabbaṃ (syā.)]"
      },
      " na teneva hatthena pādā dhovitabbā. Upāhanapuñchanacoḷakaṃ pucchitvā upāhanā puñchitabbā. Upāhanā puñchantena paṭhamaṃ sukkhena coḷakena puñchitabbā, pacchā allena. Upāhanāpuñchanacoḷakaṃ dhovitvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pīḷetvā (syā.)]"
      },
      " ekamantaṃ vissajjetabbaṃ."
    ],
    "innerText": "357. ‘‘Tena hi, bhikkhave, āgantukānaṃ bhikkhūnaṃ vattaṃ paññapessāmi yathā āgantukehi bhikkhūhi sammā vattitabbaṃ. Āgantukena, bhikkhave, bhikkhunā ‘idāni ārāmaṃ pavisissāmī’ti upāhanā omuñcitvā nīcaṃ katvā papphoṭetvā gahetvā chattaṃ apanāmetvā sīsaṃ vivaritvā sīse cīvaraṃ [vivaritvā cīvaraṃ (ka.)] khandhe katvā sādhukaṃ ataramānena ārāmo pavisitabbo. Ārāmaṃ pavisantena sallakkhetabbaṃ – ‘kattha āvāsikā bhikkhū paṭikkamantī’ti? Yattha āvāsikā bhikkhū paṭikkamanti – upaṭṭhānasālāya vā maṇḍape vā rukkhamūle vā – tattha gantvā ekamantaṃ patto nikkhipitabbo; ekamantaṃ cīvaraṃ nikkhipitabbaṃ; patirūpaṃ āsanaṃ gahetvā nisīditabbaṃ; pānīyaṃ pucchitabbaṃ, paribhojanīyaṃ pucchitabbaṃ – ‘katamaṃ pānīyaṃ, katamaṃ paribhojanīya’nti? Sace pānīyena attho hoti, pānīyaṃ gahetvā pātabbaṃ. Sace paribhojanīyena attho hoti, paribhojanīyaṃ gahetvā pādā dhovitabbā. Pāde dhovantena ekena hatthena udakaṃ āsiñcitabbaṃ, ekena hatthena pādā dhovitabbā. Teneva udakaṃ āsiñcitabbaṃ [yena hatthena udakaṃ āsiñcitabbaṃ (syā.)] na teneva hatthena pādā dhovitabbā. Upāhanapuñchanacoḷakaṃ pucchitvā upāhanā puñchitabbā. Upāhanā puñchantena paṭhamaṃ sukkhena coḷakena puñchitabbā, pacchā allena. Upāhanāpuñchanacoḷakaṃ dhovitvā [pīḷetvā (syā.)] ekamantaṃ vissajjetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace āvāsiko bhikkhu vuḍḍho hoti, abhivādetabbo. Sace navako hoti, abhivādāpetabbo. Senāsanaṃ pucchitabbaṃ – ‘katamaṃ me senāsanaṃ pāpuṇātī’ti? Ajjhāvuṭṭhaṃ vā anajjhāvuṭṭhaṃ vā pucchitabbaṃ, gocaro pucchitabbo, agocaro pucchitabbo, sekkhasammatāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[sekhasammatāni (ka.)]"
      },
      " kulāni pucchitabbāni ",
      ", vaccaṭṭhānaṃ pucchitabbaṃ, passāvaṭṭhānaṃ pucchitabbaṃ, pānīyaṃ pucchitabbaṃ, paribhojanīyaṃ pucchitabbaṃ, kattaradaṇḍo pucchitabbo, saṅghassa katikasaṇṭhānaṃ pucchitabbaṃ – ‘kaṃ kālaṃ pavisitabbaṃ, kaṃ kālaṃ nikkhamitabba’nti? Sace vihāro anajjhāvuṭṭho hoti, kavāṭaṃ ākoṭetvā muhuttaṃ āgametvā ghaṭikaṃ ugghāṭetvā kavāṭaṃ paṇāmetvā bahi ṭhitena nilloketabbo."
    ],
    "innerText": "‘‘Sace āvāsiko bhikkhu vuḍḍho hoti, abhivādetabbo. Sace navako hoti, abhivādāpetabbo. Senāsanaṃ pucchitabbaṃ – ‘katamaṃ me senāsanaṃ pāpuṇātī’ti? Ajjhāvuṭṭhaṃ vā anajjhāvuṭṭhaṃ vā pucchitabbaṃ, gocaro pucchitabbo, agocaro pucchitabbo, sekkhasammatāni [sekhasammatāni (ka.)] kulāni pucchitabbāni , vaccaṭṭhānaṃ pucchitabbaṃ, passāvaṭṭhānaṃ pucchitabbaṃ, pānīyaṃ pucchitabbaṃ, paribhojanīyaṃ pucchitabbaṃ, kattaradaṇḍo pucchitabbo, saṅghassa katikasaṇṭhānaṃ pucchitabbaṃ – ‘kaṃ kālaṃ pavisitabbaṃ, kaṃ kālaṃ nikkhamitabba’nti? Sace vihāro anajjhāvuṭṭho hoti, kavāṭaṃ ākoṭetvā muhuttaṃ āgametvā ghaṭikaṃ ugghāṭetvā kavāṭaṃ paṇāmetvā bahi ṭhitena nilloketabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace ",
      " vihāro uklāpo hoti, mañce vā mañco āropito hoti, pīṭhe vā pīṭhaṃ āropitaṃ hoti, senāsanaṃ upari puñjīkataṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[puñjakitaṃ (ka.)]"
      },
      " hoti, sace ussahati, sodhetabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mahāva. 66-67 (thokaṃ visadisaṃ)]"
      },
      " Vihāraṃ sodhentena ",
      " paṭhamaṃ bhūmattharaṇaṃ nīharitvā ekamantaṃ nikkhipitabbaṃ; mañcapaṭipādakā nīharitvā ekamantaṃ nikkhipitabbā; bhisibibbohanaṃ nīharitvā ekamantaṃ nikkhipitabbaṃ; nisīdanapaccattharaṇaṃ nīharitvā ekamantaṃ nikkhipitabbaṃ; mañco nīcaṃ katvā sādhukaṃ appaṭighaṃsantena, asaṅghaṭṭentena kavāṭapiṭṭhaṃ, nīharitvā ekamantaṃ ",
      " nikkhipitabbo; pīṭhaṃ nīcaṃ katvā sādhukaṃ appaṭighaṃsantena, asaṅghaṭṭentena kavāṭapiṭṭhaṃ, nīharitvā ekamantaṃ nikkhipitabbaṃ; kheḷamallako nīharitvā ekamantaṃ nikkhipitabbo; apassenaphalakaṃ nīharitvā ekamantaṃ nikkhipitabbaṃ. Sace vihāre santānakaṃ hoti, ullokā paṭhamaṃ ohāretabbaṃ, ālokasandhikaṇṇabhāgā pamajjitabbā. Sace gerukaparikammakatā bhitti kaṇṇakitā hoti, coḷakaṃ temetvā pīḷetvā pamajjitabbā. Sace kāḷavaṇṇakatā bhūmi kaṇṇakitā hoti, coḷakaṃ temetvā pīḷetvā ",
      " pamajjitabbā. Sace akatā hoti bhūmi, udakena paripphositvā sammajjitabbā – mā vihāro rajena uhaññīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ūhaññīti (sī. syā.)]"
      },
      ". Saṅkāraṃ vicinitvā ekamantaṃ chaḍḍetabbaṃ."
    ],
    "innerText": "‘‘Sace vihāro uklāpo hoti, mañce vā mañco āropito hoti, pīṭhe vā pīṭhaṃ āropitaṃ hoti, senāsanaṃ upari puñjīkataṃ [puñjakitaṃ (ka.)] hoti, sace ussahati, sodhetabbo. [mahāva. 66-67 (thokaṃ visadisaṃ)] Vihāraṃ sodhentena paṭhamaṃ bhūmattharaṇaṃ nīharitvā ekamantaṃ nikkhipitabbaṃ; mañcapaṭipādakā nīharitvā ekamantaṃ nikkhipitabbā; bhisibibbohanaṃ nīharitvā ekamantaṃ nikkhipitabbaṃ; nisīdanapaccattharaṇaṃ nīharitvā ekamantaṃ nikkhipitabbaṃ; mañco nīcaṃ katvā sādhukaṃ appaṭighaṃsantena, asaṅghaṭṭentena kavāṭapiṭṭhaṃ, nīharitvā ekamantaṃ nikkhipitabbo; pīṭhaṃ nīcaṃ katvā sādhukaṃ appaṭighaṃsantena, asaṅghaṭṭentena kavāṭapiṭṭhaṃ, nīharitvā ekamantaṃ nikkhipitabbaṃ; kheḷamallako nīharitvā ekamantaṃ nikkhipitabbo; apassenaphalakaṃ nīharitvā ekamantaṃ nikkhipitabbaṃ. Sace vihāre santānakaṃ hoti, ullokā paṭhamaṃ ohāretabbaṃ, ālokasandhikaṇṇabhāgā pamajjitabbā. Sace gerukaparikammakatā bhitti kaṇṇakitā hoti, coḷakaṃ temetvā pīḷetvā pamajjitabbā. Sace kāḷavaṇṇakatā bhūmi kaṇṇakitā hoti, coḷakaṃ temetvā pīḷetvā pamajjitabbā. Sace akatā hoti bhūmi, udakena paripphositvā sammajjitabbā – mā vihāro rajena uhaññīti [ūhaññīti (sī. syā.)]. Saṅkāraṃ vicinitvā ekamantaṃ chaḍḍetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Bhūmattharaṇaṃ otāpetvā sodhetvā papphoṭetvā atiharitvā yathāṭhāne ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yathāpaññattaṃ (sī. syā.), yathābhāgaṃ (ka.)]"
      },
      " paññapetabbaṃ. Mañcapaṭipādakā otāpetvā pamajjitvā atiharitvā yathāṭhāne ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yathābhāgaṃ (syā. ka.)]"
      },
      " ṭhapetabbā. Mañco otāpetvā sodhetvā papphoṭetvā nīcaṃ katvā sādhukaṃ appaṭighaṃsantena, asaṅghaṭṭentena kavāṭapiṭṭhaṃ, atiharitvā yathāṭhāne ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yathābhāgaṃ (syā. ka.)]"
      },
      " paññapetabbo. Pīṭhaṃ otāpetvā sodhetvā papphoṭetvā nīcaṃ katvā sādhukaṃ appaṭighaṃsantena, asaṅghaṭṭentena kavāṭapiṭṭhaṃ, atiharitvā yathāṭhāne ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[yathābhāgaṃ (syā. ka.)]"
      },
      " paññapetabbaṃ. Bhisibibbohanaṃ otāpetvā sodhetvā papphoṭetvā atiharitvā yathābhāgaṃ paññapetabbaṃ. Nisīdanapaccattharaṇaṃ otāpetvā sodhetvā papphoṭetvā atiharitvā yathābhāgaṃ paññapetabbaṃ. Kheḷamallako otāpetvā pamajjitvā atiharitvā yathābhāgaṃ ṭhapetabbo. Apassenaphalakaṃ otāpetvā pamajjitvā atiharitvā yathābhāgaṃ ṭhapetabbaṃ. Pattacīvaraṃ nikkhipitabbaṃ. Pattaṃ nikkhipantena ",
      " ekena hatthena pattaṃ gahetvā ekena hatthena heṭṭhāmañcaṃ vā heṭṭhāpīṭhaṃ vā parāmasitvā ",
      " patto nikkhipitabbo. Na ca anantarahitāya bhūmiyā patto nikkhipitabbo. Cīvaraṃ nikkhipantena ekena hatthena cīvaraṃ gahetvā ekena hatthena cīvaravaṃsaṃ vā cīvararajjuṃ vā pamajjitvā pārato antaṃ orato bhogaṃ katvā cīvaraṃ nikkhipitabbaṃ."
    ],
    "innerText": "‘‘Bhūmattharaṇaṃ otāpetvā sodhetvā papphoṭetvā atiharitvā yathāṭhāne [yathāpaññattaṃ (sī. syā.), yathābhāgaṃ (ka.)] paññapetabbaṃ. Mañcapaṭipādakā otāpetvā pamajjitvā atiharitvā yathāṭhāne [yathābhāgaṃ (syā. ka.)] ṭhapetabbā. Mañco otāpetvā sodhetvā papphoṭetvā nīcaṃ katvā sādhukaṃ appaṭighaṃsantena, asaṅghaṭṭentena kavāṭapiṭṭhaṃ, atiharitvā yathāṭhāne [yathābhāgaṃ (syā. ka.)] paññapetabbo. Pīṭhaṃ otāpetvā sodhetvā papphoṭetvā nīcaṃ katvā sādhukaṃ appaṭighaṃsantena, asaṅghaṭṭentena kavāṭapiṭṭhaṃ, atiharitvā yathāṭhāne [yathābhāgaṃ (syā. ka.)] paññapetabbaṃ. Bhisibibbohanaṃ otāpetvā sodhetvā papphoṭetvā atiharitvā yathābhāgaṃ paññapetabbaṃ. Nisīdanapaccattharaṇaṃ otāpetvā sodhetvā papphoṭetvā atiharitvā yathābhāgaṃ paññapetabbaṃ. Kheḷamallako otāpetvā pamajjitvā atiharitvā yathābhāgaṃ ṭhapetabbo. Apassenaphalakaṃ otāpetvā pamajjitvā atiharitvā yathābhāgaṃ ṭhapetabbaṃ. Pattacīvaraṃ nikkhipitabbaṃ. Pattaṃ nikkhipantena ekena hatthena pattaṃ gahetvā ekena hatthena heṭṭhāmañcaṃ vā heṭṭhāpīṭhaṃ vā parāmasitvā patto nikkhipitabbo. Na ca anantarahitāya bhūmiyā patto nikkhipitabbo. Cīvaraṃ nikkhipantena ekena hatthena cīvaraṃ gahetvā ekena hatthena cīvaravaṃsaṃ vā cīvararajjuṃ vā pamajjitvā pārato antaṃ orato bhogaṃ katvā cīvaraṃ nikkhipitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace puratthimā sarajā vātā vāyanti, puratthimā vātapānā thaketabbā. Sace pacchimā sarajā vātā vāyanti, pacchimā vātapānā thaketabbā. Sace uttarā sarajā vātā vāyanti, uttarā vātapānā thaketabbā. Sace dakkhiṇā sarajā vātā vāyanti, dakkhiṇā vātapānā thaketabbā ",
      ". Sace sītakālo hoti, divā vātapānā vivaritabbā, rattiṃ thaketabbā. Sace uṇhakālo hoti, divā vātapānā thaketabbā, rattiṃ vivaritabbā."
    ],
    "innerText": "‘‘Sace puratthimā sarajā vātā vāyanti, puratthimā vātapānā thaketabbā. Sace pacchimā sarajā vātā vāyanti, pacchimā vātapānā thaketabbā. Sace uttarā sarajā vātā vāyanti, uttarā vātapānā thaketabbā. Sace dakkhiṇā sarajā vātā vāyanti, dakkhiṇā vātapānā thaketabbā . Sace sītakālo hoti, divā vātapānā vivaritabbā, rattiṃ thaketabbā. Sace uṇhakālo hoti, divā vātapānā thaketabbā, rattiṃ vivaritabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace pariveṇaṃ uklāpaṃ ",
      " hoti, pariveṇaṃ sammajjitabbaṃ. Sace koṭṭhako uklāpo hoti, koṭṭhako sammajjitabbo. Sace upaṭṭhānasālā uklāpā hoti, upaṭṭhānasālā sammajjitabbā. Sace aggisālā uklāpā hoti, aggisālā sammajjitabbā. Sace vaccakuṭi uklāpā hoti, vaccakuṭi sammajjitabbā. Sace pānīyaṃ na hoti, pānīyaṃ upaṭṭhāpetabbaṃ. Sace paribhojanīyaṃ na hoti, paribhojanīyaṃ upaṭṭhāpetabbaṃ. Sace ācamanakumbhiyā udakaṃ na hoti, ācamanakumbhiyā udakaṃ āsiñcitabbaṃ. Idaṃ kho, bhikkhave, āgantukānaṃ bhikkhūnaṃ vattaṃ yathā āgantukehi bhikkhūhi sammā vattitabba’’nti."
    ],
    "innerText": "‘‘Sace pariveṇaṃ uklāpaṃ hoti, pariveṇaṃ sammajjitabbaṃ. Sace koṭṭhako uklāpo hoti, koṭṭhako sammajjitabbo. Sace upaṭṭhānasālā uklāpā hoti, upaṭṭhānasālā sammajjitabbā. Sace aggisālā uklāpā hoti, aggisālā sammajjitabbā. Sace vaccakuṭi uklāpā hoti, vaccakuṭi sammajjitabbā. Sace pānīyaṃ na hoti, pānīyaṃ upaṭṭhāpetabbaṃ. Sace paribhojanīyaṃ na hoti, paribhojanīyaṃ upaṭṭhāpetabbaṃ. Sace ācamanakumbhiyā udakaṃ na hoti, ācamanakumbhiyā udakaṃ āsiñcitabbaṃ. Idaṃ kho, bhikkhave, āgantukānaṃ bhikkhūnaṃ vattaṃ yathā āgantukehi bhikkhūhi sammā vattitabba’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Āvāsikavattakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "358"
      },
      ". Tena ",
      " kho pana samayena āvāsikā bhikkhū āgantuke bhikkhū disvā neva āsanaṃ paññapenti, na pādodakaṃ pādapīṭhaṃ pādakathalikaṃ upanikkhipanti, na paccuggantvā pattacīvaraṃ paṭiggaṇhanti, na pānīyena pucchanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[na pānīyena pucchanti, na paribhojanīyena pucchanti (syā. kaṃ.)]"
      },
      ", na vuḍḍhatarepi āgantuke bhikkhū abhivādenti, na senāsanaṃ paññapenti. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma āvāsikā bhikkhū āgantuke bhikkhū disvā neva āsanaṃ paññapessanti, na pādodakaṃ pādapīṭhaṃ pādakathalikaṃ upanikkhipissanti, na ",
      " paccuggantvā pattacīvaraṃ paṭiggahissanti, na pānīyena pucchissanti, vuḍḍhatarepi āgantuke bhikkhū na abhivādessanti, na senāsanaṃ paññapessantī’’ti! Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… saccaṃ kiraṃ, bhikkhave…pe… saccaṃ bhagavāti…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi –"
    ],
    "innerText": "358. Tena kho pana samayena āvāsikā bhikkhū āgantuke bhikkhū disvā neva āsanaṃ paññapenti, na pādodakaṃ pādapīṭhaṃ pādakathalikaṃ upanikkhipanti, na paccuggantvā pattacīvaraṃ paṭiggaṇhanti, na pānīyena pucchanti [na pānīyena pucchanti, na paribhojanīyena pucchanti (syā. kaṃ.)], na vuḍḍhatarepi āgantuke bhikkhū abhivādenti, na senāsanaṃ paññapenti. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma āvāsikā bhikkhū āgantuke bhikkhū disvā neva āsanaṃ paññapessanti, na pādodakaṃ pādapīṭhaṃ pādakathalikaṃ upanikkhipissanti, na paccuggantvā pattacīvaraṃ paṭiggahissanti, na pānīyena pucchissanti, vuḍḍhatarepi āgantuke bhikkhū na abhivādessanti, na senāsanaṃ paññapessantī’’ti! Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… saccaṃ kiraṃ, bhikkhave…pe… saccaṃ bhagavāti…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "359"
      },
      ". ‘‘Tena hi, bhikkhave, āvāsikānaṃ bhikkhūnaṃ vattaṃ paññapessāmi yathā āvāsikehi bhikkhūhi sammā vattitabbaṃ. Āvāsikena, bhikkhave, bhikkhunā āgantukaṃ bhikkhuṃ vuḍḍhataraṃ disvā āsanaṃ paññapetabbaṃ, pādodakaṃ pādapīṭhaṃ pādakathalikaṃ upanikkhipitabbaṃ ",
      ", paccuggantvā pattacīvaraṃ paṭiggahetabbaṃ, pānīyena pucchitabbo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pānīyena pucchitabbo, paribhojanīyena pucchitabbo (syā.)]"
      },
      ". Sace ussahati, upāhanā puñchitabbā. Upāhanā puñchantena paṭhamaṃ sukkhena coḷakena puñchitabbā, pacchā allena. Upāhanāpuñchanacoḷakaṃ dhovitvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[dhovitvā pīḷetvā (syā.)]"
      },
      " ekamantaṃ vissajjetabbaṃ."
    ],
    "innerText": "359. ‘‘Tena hi, bhikkhave, āvāsikānaṃ bhikkhūnaṃ vattaṃ paññapessāmi yathā āvāsikehi bhikkhūhi sammā vattitabbaṃ. Āvāsikena, bhikkhave, bhikkhunā āgantukaṃ bhikkhuṃ vuḍḍhataraṃ disvā āsanaṃ paññapetabbaṃ, pādodakaṃ pādapīṭhaṃ pādakathalikaṃ upanikkhipitabbaṃ , paccuggantvā pattacīvaraṃ paṭiggahetabbaṃ, pānīyena pucchitabbo [pānīyena pucchitabbo, paribhojanīyena pucchitabbo (syā.)]. Sace ussahati, upāhanā puñchitabbā. Upāhanā puñchantena paṭhamaṃ sukkhena coḷakena puñchitabbā, pacchā allena. Upāhanāpuñchanacoḷakaṃ dhovitvā [dhovitvā pīḷetvā (syā.)] ekamantaṃ vissajjetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Āgantuko ",
      " bhikkhu vuḍḍhataro abhivādetabbo. Senāsanaṃ paññapetabbaṃ – ‘etaṃ te senāsanaṃ pāpuṇātī’ti. Ajjhāvuṭṭhaṃ vā anajjhāvuṭṭhaṃ vā ācikkhitabbaṃ. Gocaro ācikkhitabbo. Agocaro ācikkhitabbo. Sekkhasammatāni kulāni ācikkhitabbāni. Vaccaṭṭhānaṃ ācikkhitabbaṃ. Passāvaṭṭhānaṃ ācikkhitabbaṃ. Pānīyaṃ ācikkhitabbaṃ. Paribhojanīyaṃ ācikkhitabbaṃ. Kattaradaṇḍo ācikkhitabbo. Saṅghassa katikasaṇṭhānaṃ ācikkhitabbaṃ – ‘imaṃ kālaṃ pavisitabbaṃ, imaṃ kālaṃ nikkhamitabba’nti ",
      "."
    ],
    "innerText": "‘‘Āgantuko bhikkhu vuḍḍhataro abhivādetabbo. Senāsanaṃ paññapetabbaṃ – ‘etaṃ te senāsanaṃ pāpuṇātī’ti. Ajjhāvuṭṭhaṃ vā anajjhāvuṭṭhaṃ vā ācikkhitabbaṃ. Gocaro ācikkhitabbo. Agocaro ācikkhitabbo. Sekkhasammatāni kulāni ācikkhitabbāni. Vaccaṭṭhānaṃ ācikkhitabbaṃ. Passāvaṭṭhānaṃ ācikkhitabbaṃ. Pānīyaṃ ācikkhitabbaṃ. Paribhojanīyaṃ ācikkhitabbaṃ. Kattaradaṇḍo ācikkhitabbo. Saṅghassa katikasaṇṭhānaṃ ācikkhitabbaṃ – ‘imaṃ kālaṃ pavisitabbaṃ, imaṃ kālaṃ nikkhamitabba’nti ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace navako hoti, nisinnakeneva ācikkhitabbaṃ – ‘atra pattaṃ nikkhipāhi, atra cīvaraṃ nikkhipāhi, idaṃ āsanaṃ nisīdāhī’ti. Pānīyaṃ ācikkhitabbaṃ. Paribhojanīyaṃ ācikkhitabbaṃ. Upāhanāpuñchanacoḷakaṃ ācikkhitabbaṃ. Āgantuko bhikkhu navako abhivādāpetabbo. Senāsanaṃ ācikkhitabbaṃ – ‘etaṃ ",
      " te senāsanaṃ pāpuṇātī’ti. Ajjhāvuṭṭhaṃ vā anajjhāvuṭṭhaṃ vā ācikkhitabbaṃ. Gocaro ācikkhitabbo. Agocaro ācikkhitabbo. Sekkhasammatāni kulāni ācikkhitabbāni. Vaccaṭṭhānaṃ ācikkhitabbaṃ. Passāvaṭṭhānaṃ ācikkhitabbaṃ. Pānīyaṃ ācikkhitabbaṃ. Paribhojanīyaṃ ācikkhitabbaṃ. Kattaradaṇḍo ācikkhitabbo. Saṅghassa katikasaṇṭhānaṃ ācikkhitabbaṃ – ‘imaṃ kālaṃ pavisitabbaṃ, imaṃ kālaṃ nikkhamitabba’nti. Idaṃ kho, bhikkhave ",
      ", āvāsikānaṃ bhikkhūnaṃ vattaṃ yathā āvāsikehi bhikkhūhi sammā vattitabba’’nti."
    ],
    "innerText": "‘‘Sace navako hoti, nisinnakeneva ācikkhitabbaṃ – ‘atra pattaṃ nikkhipāhi, atra cīvaraṃ nikkhipāhi, idaṃ āsanaṃ nisīdāhī’ti. Pānīyaṃ ācikkhitabbaṃ. Paribhojanīyaṃ ācikkhitabbaṃ. Upāhanāpuñchanacoḷakaṃ ācikkhitabbaṃ. Āgantuko bhikkhu navako abhivādāpetabbo. Senāsanaṃ ācikkhitabbaṃ – ‘etaṃ te senāsanaṃ pāpuṇātī’ti. Ajjhāvuṭṭhaṃ vā anajjhāvuṭṭhaṃ vā ācikkhitabbaṃ. Gocaro ācikkhitabbo. Agocaro ācikkhitabbo. Sekkhasammatāni kulāni ācikkhitabbāni. Vaccaṭṭhānaṃ ācikkhitabbaṃ. Passāvaṭṭhānaṃ ācikkhitabbaṃ. Pānīyaṃ ācikkhitabbaṃ. Paribhojanīyaṃ ācikkhitabbaṃ. Kattaradaṇḍo ācikkhitabbo. Saṅghassa katikasaṇṭhānaṃ ācikkhitabbaṃ – ‘imaṃ kālaṃ pavisitabbaṃ, imaṃ kālaṃ nikkhamitabba’nti. Idaṃ kho, bhikkhave , āvāsikānaṃ bhikkhūnaṃ vattaṃ yathā āvāsikehi bhikkhūhi sammā vattitabba’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Gamikavattakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "360"
      },
      ". Tena kho pana samayena gamikā bhikkhū dārubhaṇḍaṃ mattikābhaṇḍaṃ appaṭisāmetvā dvāravātapānaṃ vivaritvā senāsanaṃ anāpucchā pakkamanti. Dārubhaṇḍaṃ mattikābhaṇḍaṃ nassati. Senāsanaṃ aguttaṃ hoti. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma gamikā bhikkhū dārubhaṇḍaṃ mattikābhaṇḍaṃ appaṭisāmetvā dvāravātapānaṃ vivaritvā senāsanaṃ anāpucchā pakkamissanti! Dārubhaṇḍaṃ mattikābhaṇḍaṃ nassati. Senāsanaṃ aguttaṃ hotī’’ti. Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… saccaṃ kira, bhikkhave…pe… saccaṃ bhagavāti…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi –"
    ],
    "innerText": "360. Tena kho pana samayena gamikā bhikkhū dārubhaṇḍaṃ mattikābhaṇḍaṃ appaṭisāmetvā dvāravātapānaṃ vivaritvā senāsanaṃ anāpucchā pakkamanti. Dārubhaṇḍaṃ mattikābhaṇḍaṃ nassati. Senāsanaṃ aguttaṃ hoti. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma gamikā bhikkhū dārubhaṇḍaṃ mattikābhaṇḍaṃ appaṭisāmetvā dvāravātapānaṃ vivaritvā senāsanaṃ anāpucchā pakkamissanti! Dārubhaṇḍaṃ mattikābhaṇḍaṃ nassati. Senāsanaṃ aguttaṃ hotī’’ti. Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… saccaṃ kira, bhikkhave…pe… saccaṃ bhagavāti…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "361"
      },
      ". ‘‘Tena hi, bhikkhave, gamikānaṃ bhikkhūnaṃ vattaṃ paññapessāmi yathā gamikehi ",
      " bhikkhūhi ",
      " sammā vattitabbaṃ. Gamikena, bhikkhave, bhikkhunā dārubhaṇḍaṃ mattikābhaṇḍaṃ paṭisāmetvā dvāravātapānaṃ thaketvā senāsanaṃ āpucchā pakkamitabbaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[āpucchitabbaṃ (syā.)]"
      },
      ". Sace bhikkhu na hoti, sāmaṇero āpucchitabbo. Sace sāmaṇero na hoti, ārāmiko āpucchitabbo. Sace ārāmiko na hoti, upāsako āpucchitabbo. Sace na hoti bhikkhu vā sāmaṇero vā ārāmiko vā upāsako vā, catūsu pāsāṇesu mañcaṃ paññapetvā mañce mañcaṃ āropetvā pīṭhe pīṭhaṃ āropetvā senāsanaṃ upari puñjaṃ karitvā dārubhaṇḍaṃ mattikābhaṇḍaṃ paṭisāmetvā dvāravātapānaṃ thaketvā pakkamitabbaṃ. Sace vihāro ovassati, sace ussahati, chādetabbo, ussukaṃ vā kātabbaṃ – ‘kinti nu kho vihāro chādiyethā’ti. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, yo deso anovassako hoti, tattha catūsu pāsāṇesu mañcaṃ paññapetvā mañce mañcaṃ āropetvā pīṭhe pīṭhaṃ āropetvā senāsanaṃ upari puñjaṃ karitvā dārubhaṇḍaṃ mattikābhaṇḍaṃ paṭisāmetvā dvāravātapānaṃ thaketvā pakkamitabbaṃ. Sace sabbo vihāro ovassati, sace ussahati, senāsanaṃ ",
      " gāmaṃ atiharitabbaṃ, ussukaṃ vā kātabbaṃ ",
      " – ‘kinti nu kho senāsanaṃ gāmaṃ atihariyethā’ti. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, ajjhokāse catūsu pāsāṇesu mañcaṃ paññapetvā mañce mañcaṃ āropetvā pīṭhe pīṭhaṃ āropetvā senāsanaṃ upari puñjaṃ karitvā dārubhaṇḍaṃ mattikābhaṇḍaṃ paṭisāmetvā tiṇena vā paṇṇena vā paṭicchādetvā pakkamitabbaṃ – appeva nāma aṅgānipi seseyyunti. Idaṃ kho, bhikkhave, gamikānaṃ bhikkhūnaṃ vattaṃ yathā gamikehi bhikkhūhi sammā vattitabba’’nti."
    ],
    "innerText": "361. ‘‘Tena hi, bhikkhave, gamikānaṃ bhikkhūnaṃ vattaṃ paññapessāmi yathā gamikehi bhikkhūhi sammā vattitabbaṃ. Gamikena, bhikkhave, bhikkhunā dārubhaṇḍaṃ mattikābhaṇḍaṃ paṭisāmetvā dvāravātapānaṃ thaketvā senāsanaṃ āpucchā pakkamitabbaṃ [āpucchitabbaṃ (syā.)]. Sace bhikkhu na hoti, sāmaṇero āpucchitabbo. Sace sāmaṇero na hoti, ārāmiko āpucchitabbo. Sace ārāmiko na hoti, upāsako āpucchitabbo. Sace na hoti bhikkhu vā sāmaṇero vā ārāmiko vā upāsako vā, catūsu pāsāṇesu mañcaṃ paññapetvā mañce mañcaṃ āropetvā pīṭhe pīṭhaṃ āropetvā senāsanaṃ upari puñjaṃ karitvā dārubhaṇḍaṃ mattikābhaṇḍaṃ paṭisāmetvā dvāravātapānaṃ thaketvā pakkamitabbaṃ. Sace vihāro ovassati, sace ussahati, chādetabbo, ussukaṃ vā kātabbaṃ – ‘kinti nu kho vihāro chādiyethā’ti. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, yo deso anovassako hoti, tattha catūsu pāsāṇesu mañcaṃ paññapetvā mañce mañcaṃ āropetvā pīṭhe pīṭhaṃ āropetvā senāsanaṃ upari puñjaṃ karitvā dārubhaṇḍaṃ mattikābhaṇḍaṃ paṭisāmetvā dvāravātapānaṃ thaketvā pakkamitabbaṃ. Sace sabbo vihāro ovassati, sace ussahati, senāsanaṃ gāmaṃ atiharitabbaṃ, ussukaṃ vā kātabbaṃ – ‘kinti nu kho senāsanaṃ gāmaṃ atihariyethā’ti. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, ajjhokāse catūsu pāsāṇesu mañcaṃ paññapetvā mañce mañcaṃ āropetvā pīṭhe pīṭhaṃ āropetvā senāsanaṃ upari puñjaṃ karitvā dārubhaṇḍaṃ mattikābhaṇḍaṃ paṭisāmetvā tiṇena vā paṇṇena vā paṭicchādetvā pakkamitabbaṃ – appeva nāma aṅgānipi seseyyunti. Idaṃ kho, bhikkhave, gamikānaṃ bhikkhūnaṃ vattaṃ yathā gamikehi bhikkhūhi sammā vattitabba’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Anumodanavattakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "362"
      },
      ". Tena kho pana samayena bhikkhū bhattagge na anumodanti. Manussā ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma samaṇā sakyaputtiyā bhattagge na anumodissantī’’ti! Assosuṃ kho bhikkhū tesaṃ manussānaṃ ujjhāyantānaṃ khiyyantānaṃ vipācentānaṃ. Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘anujānāmi, bhikkhave, bhattagge anumoditu’’nti. Atha kho tesaṃ bhikkhūnaṃ etadahosi – ‘‘kena nu kho bhattagge anumoditabba’’nti? Bhagavato etamatthaṃ ārocesuṃ. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘anujānāmi, bhikkhave, therena bhikkhunā bhattagge anumoditu’’nti."
    ],
    "innerText": "362. Tena kho pana samayena bhikkhū bhattagge na anumodanti. Manussā ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma samaṇā sakyaputtiyā bhattagge na anumodissantī’’ti! Assosuṃ kho bhikkhū tesaṃ manussānaṃ ujjhāyantānaṃ khiyyantānaṃ vipācentānaṃ. Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘anujānāmi, bhikkhave, bhattagge anumoditu’’nti. Atha kho tesaṃ bhikkhūnaṃ etadahosi – ‘‘kena nu kho bhattagge anumoditabba’’nti? Bhagavato etamatthaṃ ārocesuṃ. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘anujānāmi, bhikkhave, therena bhikkhunā bhattagge anumoditu’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena ",
      " kho pana samayena aññatarassa pūgassa saṅghabhattaṃ hoti ",
      ". Āyasmā sāriputto saṅghatthero hoti. Bhikkhū – ‘bhagavatā anuññātaṃ therena bhikkhunā bhattagge anumoditu’nti – āyasmantaṃ sāriputtaṃ ekakaṃ ohāya pakkamiṃsu. Atha kho āyasmā sāriputto te manusse paṭisammoditvā pacchā ekako agamāsi. Addasā kho bhagavā āyasmantaṃ sāriputtaṃ dūratova ekakaṃ āgacchantaṃ. Disvāna āyasmantaṃ sāriputtaṃ etadavoca – ‘‘kacci, sāriputta, bhattaṃ iddhaṃ ahosī’’ti? ‘‘Iddhaṃ kho, bhante, bhattaṃ ahosi; apica maṃ bhikkhū ekakaṃ ohāya pakkantā’’ti. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘anujānāmi, bhikkhave, bhattagge catūhi pañcahi therānutherehi bhikkhūhi āgametu’’nti."
    ],
    "innerText": "Tena kho pana samayena aññatarassa pūgassa saṅghabhattaṃ hoti . Āyasmā sāriputto saṅghatthero hoti. Bhikkhū – ‘bhagavatā anuññātaṃ therena bhikkhunā bhattagge anumoditu’nti – āyasmantaṃ sāriputtaṃ ekakaṃ ohāya pakkamiṃsu. Atha kho āyasmā sāriputto te manusse paṭisammoditvā pacchā ekako agamāsi. Addasā kho bhagavā āyasmantaṃ sāriputtaṃ dūratova ekakaṃ āgacchantaṃ. Disvāna āyasmantaṃ sāriputtaṃ etadavoca – ‘‘kacci, sāriputta, bhattaṃ iddhaṃ ahosī’’ti? ‘‘Iddhaṃ kho, bhante, bhattaṃ ahosi; apica maṃ bhikkhū ekakaṃ ohāya pakkantā’’ti. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘anujānāmi, bhikkhave, bhattagge catūhi pañcahi therānutherehi bhikkhūhi āgametu’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena ",
      " kho pana samayena aññataro thero bhattagge vaccito āgamesi. So vaccaṃ sandhāretuṃ asakkonto mucchito papati. Bhagavato etamatthaṃ ārocesuṃ. ‘‘Anujānāmi, bhikkhave, sati karaṇīye ānantarikaṃ bhikkhuṃ āpucchitvā gantu’’nti."
    ],
    "innerText": "Tena kho pana samayena aññataro thero bhattagge vaccito āgamesi. So vaccaṃ sandhāretuṃ asakkonto mucchito papati. Bhagavato etamatthaṃ ārocesuṃ. ‘‘Anujānāmi, bhikkhave, sati karaṇīye ānantarikaṃ bhikkhuṃ āpucchitvā gantu’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Bhattaggavattakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "363"
      },
      ". Tena kho pana samayena chabbaggiyā bhikkhū dunnivatthā duppārutā anākappasampannā ",
      " bhattaggaṃ gacchanti, vokkammapi therānaṃ bhikkhūnaṃ purato purato gacchanti, therepi bhikkhū anupakhajja nisīdanti ",
      ", navepi bhikkhū āsanena paṭibāhanti, saṅghāṭimpi ottharitvā antaraghare nisīdanti. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma chabbaggiyā bhikkhū dunnivatthā duppārutā anākappasampannā bhattaggaṃ gacchissanti, vokkammapi therānaṃ bhikkhūnaṃ purato purato gacchissanti, therepi bhikkhū anupakhajja nisīdissanti, navepi bhikkhū āsanenapi paṭibāhissanti, saṅghāṭimpi ottharitvā antaraghare nisīdissantī’’ti! Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… ‘‘saccaṃ kira, bhikkhave, chabbaggiyā bhikkhū dunnivatthā duppārutā anākappasampannā bhattaggaṃ gacchanti, vokkammapi therānaṃ bhikkhūnaṃ purato purato gacchanti, therepi bhikkhū anupakhajja nisīdanti, navepi bhikkhū āsanena paṭibāhanti, saṅghāṭimpi ottharitvā antaraghare nisīdantī’’ti? ‘‘Saccaṃ bhagavā’’ti…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi –"
    ],
    "innerText": "363. Tena kho pana samayena chabbaggiyā bhikkhū dunnivatthā duppārutā anākappasampannā bhattaggaṃ gacchanti, vokkammapi therānaṃ bhikkhūnaṃ purato purato gacchanti, therepi bhikkhū anupakhajja nisīdanti , navepi bhikkhū āsanena paṭibāhanti, saṅghāṭimpi ottharitvā antaraghare nisīdanti. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma chabbaggiyā bhikkhū dunnivatthā duppārutā anākappasampannā bhattaggaṃ gacchissanti, vokkammapi therānaṃ bhikkhūnaṃ purato purato gacchissanti, therepi bhikkhū anupakhajja nisīdissanti, navepi bhikkhū āsanenapi paṭibāhissanti, saṅghāṭimpi ottharitvā antaraghare nisīdissantī’’ti! Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… ‘‘saccaṃ kira, bhikkhave, chabbaggiyā bhikkhū dunnivatthā duppārutā anākappasampannā bhattaggaṃ gacchanti, vokkammapi therānaṃ bhikkhūnaṃ purato purato gacchanti, therepi bhikkhū anupakhajja nisīdanti, navepi bhikkhū āsanena paṭibāhanti, saṅghāṭimpi ottharitvā antaraghare nisīdantī’’ti? ‘‘Saccaṃ bhagavā’’ti…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "364"
      },
      ". ‘‘Tena ",
      " hi, bhikkhave, bhikkhūnaṃ bhattaggavattaṃ paññapessāmi yathā bhikkhūhi bhattagge sammā vattitabbaṃ. Sace ārāme kālo ārocito hoti, timaṇḍalaṃ paṭicchādentena parimaṇḍalaṃ nivāsetvā kāyabandhanaṃ bandhitvā saguṇaṃ katvā saṅghāṭiyo pārupitvā gaṇṭhikaṃ paṭimuñcitvā dhovitvā pattaṃ gahetvā sādhukaṃ ataramānena gāmo pavisitabbo."
    ],
    "innerText": "364. ‘‘Tena hi, bhikkhave, bhikkhūnaṃ bhattaggavattaṃ paññapessāmi yathā bhikkhūhi bhattagge sammā vattitabbaṃ. Sace ārāme kālo ārocito hoti, timaṇḍalaṃ paṭicchādentena parimaṇḍalaṃ nivāsetvā kāyabandhanaṃ bandhitvā saguṇaṃ katvā saṅghāṭiyo pārupitvā gaṇṭhikaṃ paṭimuñcitvā dhovitvā pattaṃ gahetvā sādhukaṃ ataramānena gāmo pavisitabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Na vokkamma therānaṃ bhikkhūnaṃ purato purato gantabbaṃ. Suppaṭicchannena antaraghare ",
      " gantabbaṃ. Susaṃvutena antaraghare gantabbaṃ. Okkhittacakkhunā antaraghare gantabbaṃ. Na ukkhittakāya antaraghare gantabbaṃ. Na ujjagghikāya antaraghare gantabbaṃ. Appasaddena antaraghare gantabbaṃ. Na kāyappacālakaṃ antaraghare gantabbaṃ ",
      ". Na bāhuppacālakaṃ antaraghare gantabbaṃ. Na sīsappacālakaṃ antaraghare gantabbaṃ. Na khambhakatena antaraghare gantabbaṃ. Na oguṇṭhitena antaraghare gantabbaṃ. Na ukkuṭikāya antaraghare gantabbaṃ."
    ],
    "innerText": "‘‘Na vokkamma therānaṃ bhikkhūnaṃ purato purato gantabbaṃ. Suppaṭicchannena antaraghare gantabbaṃ. Susaṃvutena antaraghare gantabbaṃ. Okkhittacakkhunā antaraghare gantabbaṃ. Na ukkhittakāya antaraghare gantabbaṃ. Na ujjagghikāya antaraghare gantabbaṃ. Appasaddena antaraghare gantabbaṃ. Na kāyappacālakaṃ antaraghare gantabbaṃ . Na bāhuppacālakaṃ antaraghare gantabbaṃ. Na sīsappacālakaṃ antaraghare gantabbaṃ. Na khambhakatena antaraghare gantabbaṃ. Na oguṇṭhitena antaraghare gantabbaṃ. Na ukkuṭikāya antaraghare gantabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Suppaṭicchannena antaraghare nisīditabbaṃ. Susaṃvutena antaraghare nisīditabbaṃ. Okkhittacakkhunā antaraghare nisīditabbaṃ. Na ukkhittakāya antaraghare nisīditabbaṃ na ujjagghikāya antaraghare nisīditabbaṃ, appasaddena antaraghare nisīditabba. Na kāyappacālakaṃ antaraghare nisīditabbaṃ. Na bāhuppacālakaṃ antaraghare nisīditabbaṃ. Na sīsappacālakaṃ antaraghare nisīditabbaṃ. Na khambhakatena antaraghare nisīditabbaṃ. Na oguṇṭhitena antaraghare nisīditabbaṃ. Na pallatthikāya antaraghare nisīditabbaṃ. Na there bhikkhū anupakhajja nisīditabbaṃ. Na navā bhikkhū āsanena paṭibāhitabbā. Na saṅghāṭiṃ ottharitvā antaraghare nisīditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Udake diyyamāne ubhohi hatthehi pattaṃ paṭiggahetvā udakaṃ paṭiggahetabbaṃ. Nīcaṃ katvā sādhukaṃ appaṭighaṃsantena patto dhovitabbo. Sace udakappaṭiggāhako hoti, nīcaṃ katvā udakappaṭiggahe udakaṃ āsiñcitabbaṃ – mā udakappaṭiggāhako udakena osiñci ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[osiñciyyī (ka.)]"
      },
      ", mā ",
      " sāmantā bhikkhū udakena osiñciṃsu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[osiñciyyiṃsu (ka.)]"
      },
      ", mā saṅghāṭi udakena osiñcīti. Sace udakappaṭiggāhako ",
      " na hoti, nīcaṃ katvā chamāya udakaṃ āsiñcitabbaṃ – mā sāmantā bhikkhū udakena osiñciṃsu, mā saṅghāṭi udakena osiñcīti."
    ],
    "innerText": "‘‘Udake diyyamāne ubhohi hatthehi pattaṃ paṭiggahetvā udakaṃ paṭiggahetabbaṃ. Nīcaṃ katvā sādhukaṃ appaṭighaṃsantena patto dhovitabbo. Sace udakappaṭiggāhako hoti, nīcaṃ katvā udakappaṭiggahe udakaṃ āsiñcitabbaṃ – mā udakappaṭiggāhako udakena osiñci [osiñciyyī (ka.)], mā sāmantā bhikkhū udakena osiñciṃsu [osiñciyyiṃsu (ka.)], mā saṅghāṭi udakena osiñcīti. Sace udakappaṭiggāhako na hoti, nīcaṃ katvā chamāya udakaṃ āsiñcitabbaṃ – mā sāmantā bhikkhū udakena osiñciṃsu, mā saṅghāṭi udakena osiñcīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Odane diyyamāne ubhohi hatthehi pattaṃ paṭiggahetvā odano paṭiggahetabbo, sūpassa okāso kātabbo. Sace hoti sappi vā telaṃ vā uttaribhaṅgaṃ vā, therena vattabbo – ‘sabbesaṃ ",
      " samakaṃ sampādehī’ti. Sakkaccaṃ piṇḍapāto paṭiggahetabbo. Pattasaññinā piṇḍapāto paṭiggahetabbo. Samasūpako piṇḍapāto paṭiggahetabbo. Samatittiko piṇḍapāto paṭiggahetabbo."
    ],
    "innerText": "‘‘Odane diyyamāne ubhohi hatthehi pattaṃ paṭiggahetvā odano paṭiggahetabbo, sūpassa okāso kātabbo. Sace hoti sappi vā telaṃ vā uttaribhaṅgaṃ vā, therena vattabbo – ‘sabbesaṃ samakaṃ sampādehī’ti. Sakkaccaṃ piṇḍapāto paṭiggahetabbo. Pattasaññinā piṇḍapāto paṭiggahetabbo. Samasūpako piṇḍapāto paṭiggahetabbo. Samatittiko piṇḍapāto paṭiggahetabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Na tāva therena bhuñjitabbaṃ yāva na sabbesaṃ odano sampatto hoti. Sakkaccaṃ piṇḍapāto bhuñjitabbo. Pattasaññinā piṇḍapāto bhuñjitabbo. Sapadānaṃ piṇḍapāto bhuñjitabbo. Samasūpako piṇḍapāto bhuñjitabbo ",
      ". Na thūpakato omadditvā piṇḍipāto bhuñjitabbo. Na sūpaṃ vā byañjanaṃ vā odanena paṭicchādetabbaṃ bhiyyokamyataṃ upādāya. Na sūpaṃ vā odanaṃ vā agilānena attano atthāya viññāpetvā bhuñjitabbaṃ. Na ujjhānasaññinā paresaṃ patto oloketabbo. Nātimahanto kabaḷo kātabbo. Parimaṇḍalo ālopo kātabbo. Na ",
      " anāhaṭe kabaḷe mukhadvāraṃ vivaritabbaṃ. Na bhuñjamānena sabbo hattho mukhe pakkhipitabbo. Na sakabaḷena mukhena byāharitabbaṃ. Na piṇḍukkhepakaṃ bhuñjitabbaṃ. Na kabaḷāvacchedakaṃ bhuñjitabbaṃ. Na avagaṇḍakārakaṃ bhuñjitabbaṃ. Na hatthaniddhunakaṃ bhuñjitabbaṃ. Na sitthāvakārakaṃ bhuñjitabbaṃ. Na jivhānicchārakaṃ bhuñjitabbaṃ. Na capucapukārakaṃ bhuñjitabbaṃ. Na surusurukārakaṃ bhuñjitabbaṃ. Na hatthanillehakaṃ bhuñjitabbaṃ. Na pattanillehakaṃ bhuñjitabbaṃ. Na oṭṭhanillehakaṃ bhuñjitabbaṃ."
    ],
    "innerText": "‘‘Na tāva therena bhuñjitabbaṃ yāva na sabbesaṃ odano sampatto hoti. Sakkaccaṃ piṇḍapāto bhuñjitabbo. Pattasaññinā piṇḍapāto bhuñjitabbo. Sapadānaṃ piṇḍapāto bhuñjitabbo. Samasūpako piṇḍapāto bhuñjitabbo . Na thūpakato omadditvā piṇḍipāto bhuñjitabbo. Na sūpaṃ vā byañjanaṃ vā odanena paṭicchādetabbaṃ bhiyyokamyataṃ upādāya. Na sūpaṃ vā odanaṃ vā agilānena attano atthāya viññāpetvā bhuñjitabbaṃ. Na ujjhānasaññinā paresaṃ patto oloketabbo. Nātimahanto kabaḷo kātabbo. Parimaṇḍalo ālopo kātabbo. Na anāhaṭe kabaḷe mukhadvāraṃ vivaritabbaṃ. Na bhuñjamānena sabbo hattho mukhe pakkhipitabbo. Na sakabaḷena mukhena byāharitabbaṃ. Na piṇḍukkhepakaṃ bhuñjitabbaṃ. Na kabaḷāvacchedakaṃ bhuñjitabbaṃ. Na avagaṇḍakārakaṃ bhuñjitabbaṃ. Na hatthaniddhunakaṃ bhuñjitabbaṃ. Na sitthāvakārakaṃ bhuñjitabbaṃ. Na jivhānicchārakaṃ bhuñjitabbaṃ. Na capucapukārakaṃ bhuñjitabbaṃ. Na surusurukārakaṃ bhuñjitabbaṃ. Na hatthanillehakaṃ bhuñjitabbaṃ. Na pattanillehakaṃ bhuñjitabbaṃ. Na oṭṭhanillehakaṃ bhuñjitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Na sāmisena hatthena pānīyathālako paṭiggahetabbo. Na tāva therena udakaṃ paṭiggahetabbaṃ yāva na sabbeva bhuttāvino honti. Udake diyyamāne ubhohi hatthehi pattaṃ paṭiggahetvā udakaṃ paṭiggahetabbaṃ. Nīcaṃ katvā sādhukaṃ appaṭighaṃsantena patto dhovitabbo. Sace udakappaṭiggāhako hoti, nīcaṃ katvā udakappaṭiggahe udakaṃ āsiñcitabbaṃ – mā udakappaṭiggāhako udakena osiñci, mā sāmantā bhikkhū udakena osiñciṃsu, mā saṅghāṭi udakena osiñcīti. Sace udakappaṭiggāhako na hoti, nīcaṃ katvā chamāya udakaṃ āsiñcitabbaṃ – mā sāmantā bhikkhū udakena osiñciṃsu, mā saṅghāṭi udakena osiñcīti. Na sasitthakaṃ pattadhovanaṃ antaraghare chaḍḍetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Nivattantena navakehi bhikkhūhi paṭhamataraṃ nivattitabbaṃ. Pacchā therehi ",
      " suppaṭicchannena antaraghare gantabbaṃ. Susaṃvutena antaraghare gantabbaṃ. Okkhittacakkhunā antaraghare gantabbaṃ. Na ukkhittakāya ",
      " antaraghare gantabbaṃ. Na ujjagghikāya antaraghare gantabbaṃ. Appasaddena antaraghare gantabbaṃ. Na kāyappacālakaṃ antaraghare gantabbaṃ. Na bāhuppacālakaṃ antaraghare gantabbaṃ ",
      ". Na sīsappacālakaṃ antaraghare gantabbaṃ. Na khambhakatena antaraghare gantabbaṃ. Na oguṇṭhitena antaraghare gantabbaṃ. Na ukkuṭikāya antaraghare gantabbaṃ. Idaṃ kho, bhikkhave, bhikkhūnaṃ bhattaggavattaṃ yathā bhikkhūhi bhattagge sammā vattitabba’’nti."
    ],
    "innerText": "‘‘Nivattantena navakehi bhikkhūhi paṭhamataraṃ nivattitabbaṃ. Pacchā therehi suppaṭicchannena antaraghare gantabbaṃ. Susaṃvutena antaraghare gantabbaṃ. Okkhittacakkhunā antaraghare gantabbaṃ. Na ukkhittakāya antaraghare gantabbaṃ. Na ujjagghikāya antaraghare gantabbaṃ. Appasaddena antaraghare gantabbaṃ. Na kāyappacālakaṃ antaraghare gantabbaṃ. Na bāhuppacālakaṃ antaraghare gantabbaṃ . Na sīsappacālakaṃ antaraghare gantabbaṃ. Na khambhakatena antaraghare gantabbaṃ. Na oguṇṭhitena antaraghare gantabbaṃ. Na ukkuṭikāya antaraghare gantabbaṃ. Idaṃ kho, bhikkhave, bhikkhūnaṃ bhattaggavattaṃ yathā bhikkhūhi bhattagge sammā vattitabba’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṭhamabhāṇavāro niṭṭhito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Piṇḍacārikavattakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "365"
      },
      ". Tena ",
      " kho pana samayena piṇḍacārikā bhikkhū dunnivatthā duppārutā anākappasampannā piṇḍāya caranti, asallakkhetvāpi nivesanaṃ pavisanti, asallakkhetvāpi nikkhamanti, atisahasāpi pavisanti, atisahasāpi nikkhamanti, atidūrepi tiṭṭhanti, accāsannepi tiṭṭhanti, aticirampi tiṭṭhanti, atilahumpi nivattanti. Aññataropi piṇḍacāriko bhikkhu asallakkhetvā nivesanaṃ pāvisi. So ca dvāraṃ maññamāno aññataraṃ ovarakaṃ pāvisi. Tasmimpi ovarake itthī naggā uttānā nipannā hoti. Addasā kho so bhikkhu taṃ itthiṃ naggaṃ uttānaṃ nipannaṃ. Disvāna – ‘‘nayidaṃ dvāraṃ, ovarakaṃ ida’’nti ",
      " tamhā ovarakā nikkhami. Addasā kho tassā itthiyā sāmiko taṃ itthiṃ naggaṃ uttānaṃ nipannaṃ. Disvāna – ‘‘iminā me bhikkhunā pajāpatī dūsitā’’ti taṃ bhikkhuṃ gahetvā ākoṭesi. Atha kho sā itthī tena saddena paṭibujjhitvā taṃ purisaṃ etadavoca – ‘‘kissa tvaṃ, ayya, imaṃ bhikkhuṃ ākoṭesī’’ti? ‘‘Imināsi tvaṃ bhikkhunā dūsitā’’ti? ‘‘Nāhaṃ, ayya, iminā bhikkhunā dūsitā; akārako so bhikkhū’’ti taṃ bhikkhuṃ muñcāpesi. Atha kho so bhikkhu ārāmaṃ gantvā bhikkhūnaṃ etamatthaṃ ārocesi. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma piṇḍacārikā bhikkhū dunnivatthā duppārutā anākappasampannā piṇḍāya carissanti, asallakkhetvāpi nivesanaṃ pavisissanti, asallakkhetvāpi nikkhamissanti, atisahasāpi pavisissanti, atisahasāpi nikkhamissanti, atidūrepi tiṭṭhissanti, accāsannepi tiṭṭhissanti, aticirampi tiṭṭhissanti, atilahumpi nivattissantī’’ti! Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… saccaṃ kira, bhikkhave…pe… saccaṃ bhagavāti…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi –"
    ],
    "innerText": "365. Tena kho pana samayena piṇḍacārikā bhikkhū dunnivatthā duppārutā anākappasampannā piṇḍāya caranti, asallakkhetvāpi nivesanaṃ pavisanti, asallakkhetvāpi nikkhamanti, atisahasāpi pavisanti, atisahasāpi nikkhamanti, atidūrepi tiṭṭhanti, accāsannepi tiṭṭhanti, aticirampi tiṭṭhanti, atilahumpi nivattanti. Aññataropi piṇḍacāriko bhikkhu asallakkhetvā nivesanaṃ pāvisi. So ca dvāraṃ maññamāno aññataraṃ ovarakaṃ pāvisi. Tasmimpi ovarake itthī naggā uttānā nipannā hoti. Addasā kho so bhikkhu taṃ itthiṃ naggaṃ uttānaṃ nipannaṃ. Disvāna – ‘‘nayidaṃ dvāraṃ, ovarakaṃ ida’’nti tamhā ovarakā nikkhami. Addasā kho tassā itthiyā sāmiko taṃ itthiṃ naggaṃ uttānaṃ nipannaṃ. Disvāna – ‘‘iminā me bhikkhunā pajāpatī dūsitā’’ti taṃ bhikkhuṃ gahetvā ākoṭesi. Atha kho sā itthī tena saddena paṭibujjhitvā taṃ purisaṃ etadavoca – ‘‘kissa tvaṃ, ayya, imaṃ bhikkhuṃ ākoṭesī’’ti? ‘‘Imināsi tvaṃ bhikkhunā dūsitā’’ti? ‘‘Nāhaṃ, ayya, iminā bhikkhunā dūsitā; akārako so bhikkhū’’ti taṃ bhikkhuṃ muñcāpesi. Atha kho so bhikkhu ārāmaṃ gantvā bhikkhūnaṃ etamatthaṃ ārocesi. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma piṇḍacārikā bhikkhū dunnivatthā duppārutā anākappasampannā piṇḍāya carissanti, asallakkhetvāpi nivesanaṃ pavisissanti, asallakkhetvāpi nikkhamissanti, atisahasāpi pavisissanti, atisahasāpi nikkhamissanti, atidūrepi tiṭṭhissanti, accāsannepi tiṭṭhissanti, aticirampi tiṭṭhissanti, atilahumpi nivattissantī’’ti! Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… saccaṃ kira, bhikkhave…pe… saccaṃ bhagavāti…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "366"
      },
      ". ‘‘Tena hi, bhikkhave, piṇḍacārikānaṃ bhikkhūnaṃ vattaṃ paññāpessāmi yathā piṇḍacārikehi ",
      " bhikkhūhi sammā vattitabbaṃ. Piṇḍacārikena, bhikkhave, bhikkhunā – ‘idāni gāmaṃ pavisissāmī’ti timaṇḍalaṃ paṭicchādentena parimaṇḍalaṃ nivāsetvā kāyabandhanaṃ ",
      " bandhitvā saguṇaṃ katvā saṅghāṭiyo pārupitvā gaṇṭhikaṃ paṭimuñcitvā dhovitvā pattaṃ gahetvā sādhukaṃ ataramānena gāmo pavisitabbo."
    ],
    "innerText": "366. ‘‘Tena hi, bhikkhave, piṇḍacārikānaṃ bhikkhūnaṃ vattaṃ paññāpessāmi yathā piṇḍacārikehi bhikkhūhi sammā vattitabbaṃ. Piṇḍacārikena, bhikkhave, bhikkhunā – ‘idāni gāmaṃ pavisissāmī’ti timaṇḍalaṃ paṭicchādentena parimaṇḍalaṃ nivāsetvā kāyabandhanaṃ bandhitvā saguṇaṃ katvā saṅghāṭiyo pārupitvā gaṇṭhikaṃ paṭimuñcitvā dhovitvā pattaṃ gahetvā sādhukaṃ ataramānena gāmo pavisitabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suppaṭicchannena ",
      " antaraghare gantabbaṃ ",
      ". Susaṃvutena antaraghare gantabbaṃ. Okkhittacakkhunā antaraghare gantabbaṃ. Na ukkhittakāya antaraghare gantabbaṃ. Na ujjagghikāya antaraghare gantabbaṃ. Appasaddena antaraghare gantabbaṃ. Na kāyappacālakaṃ antaraghare gantabbaṃ. Na bāhuppacālakaṃ antaraghare gantabbaṃ. Na sīsappacālakaṃ antaraghare gantabbaṃ. Na khambhakatena antaraghare gantabbaṃ. Na oguṇṭhitena antaraghare gantabbaṃ. Na ukkuṭikāya antaraghare gantabbaṃ."
    ],
    "innerText": "‘‘Suppaṭicchannena antaraghare gantabbaṃ . Susaṃvutena antaraghare gantabbaṃ. Okkhittacakkhunā antaraghare gantabbaṃ. Na ukkhittakāya antaraghare gantabbaṃ. Na ujjagghikāya antaraghare gantabbaṃ. Appasaddena antaraghare gantabbaṃ. Na kāyappacālakaṃ antaraghare gantabbaṃ. Na bāhuppacālakaṃ antaraghare gantabbaṃ. Na sīsappacālakaṃ antaraghare gantabbaṃ. Na khambhakatena antaraghare gantabbaṃ. Na oguṇṭhitena antaraghare gantabbaṃ. Na ukkuṭikāya antaraghare gantabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Nivesanaṃ pavisantena sallakkhetabbaṃ – ‘iminā pavisissāmi, iminā nikkhamissāmī’ti. Nātisahasā pavisitabbaṃ. Nātisahasā nikkhamitabbaṃ. Nātidūre ṭhātabbaṃ. Nāccāsanne ṭhātabbaṃ. Nāticiraṃ ṭhātabbaṃ. Nātilahuṃ nivattitabbaṃ. Ṭhitakena sallakkhetabbaṃ – ‘bhikkhaṃ dātukāmā vā adātukāmā vā’ti. Sace kammaṃ vā nikkhipati, āsanā vā vuṭṭhāti, kaṭacchuṃ vā parāmasati, bhājanaṃ vā parāmasati, ṭhapeti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ṭhāpeti (ka.)]"
      },
      " vā – dātukāmassāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[dātukāmiyāti (syā.), dātukāmā viyāti (sī.)]"
      },
      " ṭhātabbaṃ. Bhikkhāya diyyamānāya vāmena hatthena saṅghāṭiṃ uccāretvā dakkhiṇena hatthena pattaṃ paṇāmetvā ubhohi hatthehi pattaṃ paṭiggahetvā bhikkhā paṭiggahetabbā. Na ca bhikkhādāyikāya mukhaṃ ",
      " ulloketabbaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[oloketabbaṃ (syā.)]"
      },
      ". Sallakkhetabbaṃ – ‘sūpaṃ dātukāmā vā adātukāmā vā’ti. Sace kaṭacchuṃ vā parāmasati, bhājanaṃ vā parāmasati, ṭhapeti vā – dātukāmassāti ṭhātabbaṃ. Bhikkhāya dinnāya saṅghāṭiyā pattaṃ paṭicchādetvā sādhukaṃ ataramānena nivattitabbaṃ."
    ],
    "innerText": "‘‘Nivesanaṃ pavisantena sallakkhetabbaṃ – ‘iminā pavisissāmi, iminā nikkhamissāmī’ti. Nātisahasā pavisitabbaṃ. Nātisahasā nikkhamitabbaṃ. Nātidūre ṭhātabbaṃ. Nāccāsanne ṭhātabbaṃ. Nāticiraṃ ṭhātabbaṃ. Nātilahuṃ nivattitabbaṃ. Ṭhitakena sallakkhetabbaṃ – ‘bhikkhaṃ dātukāmā vā adātukāmā vā’ti. Sace kammaṃ vā nikkhipati, āsanā vā vuṭṭhāti, kaṭacchuṃ vā parāmasati, bhājanaṃ vā parāmasati, ṭhapeti [ṭhāpeti (ka.)] vā – dātukāmassāti [dātukāmiyāti (syā.), dātukāmā viyāti (sī.)] ṭhātabbaṃ. Bhikkhāya diyyamānāya vāmena hatthena saṅghāṭiṃ uccāretvā dakkhiṇena hatthena pattaṃ paṇāmetvā ubhohi hatthehi pattaṃ paṭiggahetvā bhikkhā paṭiggahetabbā. Na ca bhikkhādāyikāya mukhaṃ ulloketabbaṃ [oloketabbaṃ (syā.)]. Sallakkhetabbaṃ – ‘sūpaṃ dātukāmā vā adātukāmā vā’ti. Sace kaṭacchuṃ vā parāmasati, bhājanaṃ vā parāmasati, ṭhapeti vā – dātukāmassāti ṭhātabbaṃ. Bhikkhāya dinnāya saṅghāṭiyā pattaṃ paṭicchādetvā sādhukaṃ ataramānena nivattitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Suppaṭicchannena antaraghare gantabbaṃ. Susaṃvutena antaraghare gantabbaṃ. Okkhittacakkhunā antaraghare gantabbaṃ. Na ukkhittakāya antaraghare gantabbaṃ. Na ujjagghikāya antaraghare gantabbaṃ. Appasaddena antaraghare gantabbaṃ. Na kāyappacālakaṃ antaraghare gantabbaṃ. Na bāhuppacālakaṃ antaraghare gantabbaṃ. Na sīsappacālakaṃ antaraghare gantabbaṃ. Na khambhakatena antaraghare gantabbaṃ. Na oguṇṭhitena antaraghare gantabbaṃ. Na ukkuṭikāya antaraghare gantabbaṃ. Yo paṭhamaṃ gāmato piṇḍāya paṭikkamati, tena āsanaṃ paññapetabbaṃ, pādodakaṃ pādapīṭhaṃ ",
      " pādakathalikaṃ upanikkhipitabbaṃ, avakkārapāti dhovitvā upaṭṭhāpetabbā, pānīyaṃ paribhojanīyaṃ upaṭṭhāpetabbaṃ. Yo pacchā gāmato piṇḍāya paṭikkamati, sace hoti bhuttāvaseso, sace ākaṅkhati, bhuñjitabbaṃ ",
      ". No ce ākaṅkhati, appaharite vā chaḍḍetabbaṃ, appāṇake vā udake opilāpetabbaṃ. Tena āsanaṃ uddharitabbaṃ, pādodakaṃ pādapīṭhaṃ pādakathalikaṃ paṭisāmetabbaṃ, avakkārapāti dhovitvā paṭisāmetabbā, pānīyaṃ paribhojanīyaṃ paṭisāmetabbaṃ ",
      ", bhattaggaṃ sammajjitabbaṃ. Yo passati pānīyaghaṭaṃ vā paribhojanīyaghaṭaṃ vā vaccaghaṭaṃ vā rittaṃ tucchaṃ tena upaṭṭhāpetabbaṃ. Sacassa hoti avisayhaṃ, hatthavikārena dutiyaṃ āmantetvā hatthavilaṅghakena upaṭṭhāpetabbaṃ, na ca tappaccayā vācā bhinditabbā. Idaṃ kho, bhikkhave, piṇḍacārikānaṃ bhikkhūnaṃ vattaṃ yathā piṇḍacārikehi bhikkhūhi sammā vattitabba’’nti."
    ],
    "innerText": "‘‘Suppaṭicchannena antaraghare gantabbaṃ. Susaṃvutena antaraghare gantabbaṃ. Okkhittacakkhunā antaraghare gantabbaṃ. Na ukkhittakāya antaraghare gantabbaṃ. Na ujjagghikāya antaraghare gantabbaṃ. Appasaddena antaraghare gantabbaṃ. Na kāyappacālakaṃ antaraghare gantabbaṃ. Na bāhuppacālakaṃ antaraghare gantabbaṃ. Na sīsappacālakaṃ antaraghare gantabbaṃ. Na khambhakatena antaraghare gantabbaṃ. Na oguṇṭhitena antaraghare gantabbaṃ. Na ukkuṭikāya antaraghare gantabbaṃ. Yo paṭhamaṃ gāmato piṇḍāya paṭikkamati, tena āsanaṃ paññapetabbaṃ, pādodakaṃ pādapīṭhaṃ pādakathalikaṃ upanikkhipitabbaṃ, avakkārapāti dhovitvā upaṭṭhāpetabbā, pānīyaṃ paribhojanīyaṃ upaṭṭhāpetabbaṃ. Yo pacchā gāmato piṇḍāya paṭikkamati, sace hoti bhuttāvaseso, sace ākaṅkhati, bhuñjitabbaṃ . No ce ākaṅkhati, appaharite vā chaḍḍetabbaṃ, appāṇake vā udake opilāpetabbaṃ. Tena āsanaṃ uddharitabbaṃ, pādodakaṃ pādapīṭhaṃ pādakathalikaṃ paṭisāmetabbaṃ, avakkārapāti dhovitvā paṭisāmetabbā, pānīyaṃ paribhojanīyaṃ paṭisāmetabbaṃ , bhattaggaṃ sammajjitabbaṃ. Yo passati pānīyaghaṭaṃ vā paribhojanīyaghaṭaṃ vā vaccaghaṭaṃ vā rittaṃ tucchaṃ tena upaṭṭhāpetabbaṃ. Sacassa hoti avisayhaṃ, hatthavikārena dutiyaṃ āmantetvā hatthavilaṅghakena upaṭṭhāpetabbaṃ, na ca tappaccayā vācā bhinditabbā. Idaṃ kho, bhikkhave, piṇḍacārikānaṃ bhikkhūnaṃ vattaṃ yathā piṇḍacārikehi bhikkhūhi sammā vattitabba’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Āraññikavattakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "367"
      },
      ". Tena kho pana samayena sambahulā bhikkhū araññe viharanti. Te neva pānīyaṃ upaṭṭhāpenti, na paribhojanīyaṃ upaṭṭhāpenti ",
      ", na aggiṃ upaṭṭhāpenti, na araṇisahitaṃ upaṭṭhāpenti, na nakkhattapadāni jānanti, na disābhāgaṃ jānanti. Corā tattha gantvā te bhikkhū etadavocuṃ – ‘‘atthi, bhante, pānīya’’nti? ‘‘Natthāvuso’’ti. ‘‘Atthi, bhante, paribhojanīya’’nti? ‘‘Natthāvuso’’ti. ‘‘Atthi, bhante, aggī’’ti? ‘‘Natthāvuso’’ti. ‘‘Atthi, bhante, araṇisahita’’nti? ‘‘Natthāvuso’’ti. ( ) ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[(atthi bhante nakkhattapadānīti, na jānāma āvusoti, atthi bhante disābhāganti, na jānāma āvusoti.) sī. vimatiṭīkāya pana sameti]"
      },
      " ‘‘Kenajja, bhante, yutta’’nti? ‘‘Na kho mayaṃ, āvuso, jānāmā’’ti. ‘‘Katamāyaṃ, bhante, disā’’ti? ‘‘Na kho mayaṃ, āvuso, jānāmā’’ti. Atha kho te corā – ‘nevimesaṃ pānīyaṃ atthi, na paribhojanīyaṃ atthi, na aggi atthi, na araṇisahitaṃ atthi, na nakkhattapadāni jānanti, na disābhāgaṃ jānanti; corā ime, nayime bhikkhū’ti – ākoṭetvā pakkamiṃsu. Atha kho te bhikkhū bhikkhūnaṃ etamatthaṃ ārocesuṃ. Bhikkhū bhagavato etamatthaṃ ārocesuṃ. Atha ",
      " kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi –"
    ],
    "innerText": "367. Tena kho pana samayena sambahulā bhikkhū araññe viharanti. Te neva pānīyaṃ upaṭṭhāpenti, na paribhojanīyaṃ upaṭṭhāpenti , na aggiṃ upaṭṭhāpenti, na araṇisahitaṃ upaṭṭhāpenti, na nakkhattapadāni jānanti, na disābhāgaṃ jānanti. Corā tattha gantvā te bhikkhū etadavocuṃ – ‘‘atthi, bhante, pānīya’’nti? ‘‘Natthāvuso’’ti. ‘‘Atthi, bhante, paribhojanīya’’nti? ‘‘Natthāvuso’’ti. ‘‘Atthi, bhante, aggī’’ti? ‘‘Natthāvuso’’ti. ‘‘Atthi, bhante, araṇisahita’’nti? ‘‘Natthāvuso’’ti. ( ) [(atthi bhante nakkhattapadānīti, na jānāma āvusoti, atthi bhante disābhāganti, na jānāma āvusoti.) sī. vimatiṭīkāya pana sameti] ‘‘Kenajja, bhante, yutta’’nti? ‘‘Na kho mayaṃ, āvuso, jānāmā’’ti. ‘‘Katamāyaṃ, bhante, disā’’ti? ‘‘Na kho mayaṃ, āvuso, jānāmā’’ti. Atha kho te corā – ‘nevimesaṃ pānīyaṃ atthi, na paribhojanīyaṃ atthi, na aggi atthi, na araṇisahitaṃ atthi, na nakkhattapadāni jānanti, na disābhāgaṃ jānanti; corā ime, nayime bhikkhū’ti – ākoṭetvā pakkamiṃsu. Atha kho te bhikkhū bhikkhūnaṃ etamatthaṃ ārocesuṃ. Bhikkhū bhagavato etamatthaṃ ārocesuṃ. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe dhammiṃ kathaṃ katvā bhikkhū āmantesi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "368"
      },
      ". ‘‘Tena hi, bhikkhave, āraññikānaṃ bhikkhūnaṃ vattaṃ paññapessāmi yathā āraññikehi bhikkhūhi sammā vattitabbaṃ. Āraññikena, bhikkhave, bhikkhunā kālasseva uṭṭhāya pattaṃ thavikāya pakkhipitvā aṃse ālaggetvā ",
      " cīvaraṃ khandhe karitvā upāhanā ārohitvā dārubhaṇḍaṃ mattikābhaṇḍaṃ paṭisāmetvā dvāravātapānaṃ thaketvā senāsanā otaritabbaṃ ",
      " – idāni gāmaṃ pavisissāmīti. Upāhanā omuñcitvā nīcaṃ katvā papphoṭetvā thavikāya pakkhipitvā aṃse ālaggetvā timaṇḍalaṃ paṭicchādentena parimaṇḍalaṃ nivāsetvā kāyabandhanaṃ bandhitvā saguṇaṃ katvā saṅghāṭiyo pārupitvā gaṇṭhikaṃ paṭimuñcitvā dhovitvā pattaṃ gahetvā sādhukaṃ ataramānena gāmo pavisitabbo. Suppaṭicchannena antaraghare gantabbaṃ…pe… na khambhakatena antaraghare gantabbaṃ. Na oguṇṭhitena antaraghare gantabbaṃ. Na ukkuṭikāya antaraghare gantabbaṃ."
    ],
    "innerText": "368. ‘‘Tena hi, bhikkhave, āraññikānaṃ bhikkhūnaṃ vattaṃ paññapessāmi yathā āraññikehi bhikkhūhi sammā vattitabbaṃ. Āraññikena, bhikkhave, bhikkhunā kālasseva uṭṭhāya pattaṃ thavikāya pakkhipitvā aṃse ālaggetvā cīvaraṃ khandhe karitvā upāhanā ārohitvā dārubhaṇḍaṃ mattikābhaṇḍaṃ paṭisāmetvā dvāravātapānaṃ thaketvā senāsanā otaritabbaṃ – idāni gāmaṃ pavisissāmīti. Upāhanā omuñcitvā nīcaṃ katvā papphoṭetvā thavikāya pakkhipitvā aṃse ālaggetvā timaṇḍalaṃ paṭicchādentena parimaṇḍalaṃ nivāsetvā kāyabandhanaṃ bandhitvā saguṇaṃ katvā saṅghāṭiyo pārupitvā gaṇṭhikaṃ paṭimuñcitvā dhovitvā pattaṃ gahetvā sādhukaṃ ataramānena gāmo pavisitabbo. Suppaṭicchannena antaraghare gantabbaṃ…pe… na khambhakatena antaraghare gantabbaṃ. Na oguṇṭhitena antaraghare gantabbaṃ. Na ukkuṭikāya antaraghare gantabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Nivesanaṃ pavisantena sallakkhetabbaṃ – ‘iminā pavisissāmi, iminā nikkhamissāmī’ti. Nātisahasā pavisitabbaṃ. Nātisahasā nikkhamitabbaṃ. Nātidūre ṭhātabbaṃ. Nāccāsanne ṭhātabbaṃ. Nāticiraṃ ṭhātabbaṃ. Nātilahuṃ nivattitabbaṃ. Ṭhitakena sallakkhetabbaṃ – ‘bhikkhaṃ dātukāmā vā adātukāmā vā’ti. Sace kammaṃ vā nikkhipati, āsanā vā vuṭṭhāti, kaṭacchuṃ vā parāmasati, bhājanaṃ vā parāmasati, ṭhapeti vā – dātukāmassāti ṭhātabbaṃ. Bhikkhāya diyyamānāya vāmena hatthena ",
      " saṅghāṭiṃ uccāretvā dakkhiṇena hatthena pattaṃ paṇāmetvā ubhohi hatthehi pattaṃ paṭiggahetvā bhikkhā paṭiggahetabbā. Na ca bhikkhādāyikāya mukhaṃ ulloketabbaṃ. Sallakkhetabbaṃ – ‘sūpaṃ dātukāmā vā adātukāmā vā’ti. Sace kaṭacchu vā parāmasati, bhājanaṃ vā parāmasati, ṭhapeti vā – dātukāmassāti ṭhātabbaṃ. Bhikkhāya dinnāya saṅghāṭiyā pattaṃ paṭicchādetvā sādhukaṃ ataramānena nivattitabbaṃ."
    ],
    "innerText": "‘‘Nivesanaṃ pavisantena sallakkhetabbaṃ – ‘iminā pavisissāmi, iminā nikkhamissāmī’ti. Nātisahasā pavisitabbaṃ. Nātisahasā nikkhamitabbaṃ. Nātidūre ṭhātabbaṃ. Nāccāsanne ṭhātabbaṃ. Nāticiraṃ ṭhātabbaṃ. Nātilahuṃ nivattitabbaṃ. Ṭhitakena sallakkhetabbaṃ – ‘bhikkhaṃ dātukāmā vā adātukāmā vā’ti. Sace kammaṃ vā nikkhipati, āsanā vā vuṭṭhāti, kaṭacchuṃ vā parāmasati, bhājanaṃ vā parāmasati, ṭhapeti vā – dātukāmassāti ṭhātabbaṃ. Bhikkhāya diyyamānāya vāmena hatthena saṅghāṭiṃ uccāretvā dakkhiṇena hatthena pattaṃ paṇāmetvā ubhohi hatthehi pattaṃ paṭiggahetvā bhikkhā paṭiggahetabbā. Na ca bhikkhādāyikāya mukhaṃ ulloketabbaṃ. Sallakkhetabbaṃ – ‘sūpaṃ dātukāmā vā adātukāmā vā’ti. Sace kaṭacchu vā parāmasati, bhājanaṃ vā parāmasati, ṭhapeti vā – dātukāmassāti ṭhātabbaṃ. Bhikkhāya dinnāya saṅghāṭiyā pattaṃ paṭicchādetvā sādhukaṃ ataramānena nivattitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Suppaṭicchannena antaraghare gantabbaṃ…pe… na ukkuṭikāya antaraghare gantabbaṃ. Gāmato nikkhamitvā pattaṃ thavikāya pakkhipitvā aṃse ālaggetvā cīvaraṃ saṅgharitvā sīse karitvā upāhanā ārohitvā gantabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Āraññikena, bhikkhave, bhikkhunā pānīyaṃ upaṭṭhāpetabbaṃ, paribhojanīyaṃ upaṭṭhāpetabbaṃ, aggi upaṭṭhāpetabbo, araṇisahitaṃ upaṭṭhāpetabbaṃ, kattaradaṇḍo upaṭṭhāpetabbo, nakkhattapadāni uggahetabbāni – sakalāni vā ekadesāni vā, disākusalena bhavitabbaṃ. Idaṃ kho, bhikkhave, āraññikānaṃ bhikkhūnaṃ vattaṃ yathā āraññikehi bhikkhūhi sammā vattitabba’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Senāsanavattakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "369"
      },
      ". Tena ",
      " kho pana samayena sambahulā bhikkhū ajjhokāse cīvarakammaṃ ",
      " karonti. Chabbaggiyā bhikkhū paṭivāte aṅgaṇe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[paṅgaṇe (sī. syā.)]"
      },
      " senāsanaṃ papphoṭesuṃ. Bhikkhū rajena okiriṃsu. Ye te bhikkhū appicchā…pe… ",
      " te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma chabbaggiyā bhikkhū paṭivāte aṅgaṇe senāsanaṃ papphoṭessanti! Bhikkhū rajena okiriṃsū’’ti. Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… ‘‘saccaṃ kira, bhikkhave, chabbaggiyā bhikkhū paṭivāte aṅgaṇe senāsanaṃ papphoṭenti, bhikkhū rajena okiriṃsū’’ti? ‘‘Saccaṃ bhagavā’’ti…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi –"
    ],
    "innerText": "369. Tena kho pana samayena sambahulā bhikkhū ajjhokāse cīvarakammaṃ karonti. Chabbaggiyā bhikkhū paṭivāte aṅgaṇe [paṅgaṇe (sī. syā.)] senāsanaṃ papphoṭesuṃ. Bhikkhū rajena okiriṃsu. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma chabbaggiyā bhikkhū paṭivāte aṅgaṇe senāsanaṃ papphoṭessanti! Bhikkhū rajena okiriṃsū’’ti. Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… ‘‘saccaṃ kira, bhikkhave, chabbaggiyā bhikkhū paṭivāte aṅgaṇe senāsanaṃ papphoṭenti, bhikkhū rajena okiriṃsū’’ti? ‘‘Saccaṃ bhagavā’’ti…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "370"
      },
      ". ‘‘Tena hi, bhikkhave, bhikkhūnaṃ senāsanavattaṃ paññapessāmi yathā bhikkhūhi senāsane sammā vattitabbaṃ. Yasmiṃ vihāre viharati, sace so vihāro uklāpo hoti, sace ussahati, sodhetabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mahāva. 66, 67; cūḷava. 357]"
      },
      " Vihāraṃ sodhentena paṭhamaṃ pattacīvaraṃ nīharitvā ekamantaṃ nikkhipitabbaṃ; nisīdanapaccattharaṇaṃ nīharitvā ekamantaṃ nikkhipitabbaṃ; bhisibibbohanaṃ nīharitvā ekamantaṃ nikkhipitabbaṃ; mañco nīcaṃ katvā sādhukaṃ appaṭighaṃsantena, asaṅghaṭṭentena kavāṭapiṭṭhaṃ, nīharitvā ekamantaṃ nikkhipitabbo; pīṭhaṃ nīcaṃ katvā sādhukaṃ appaṭighaṃsantena, asaṅghaṭṭentena kavāṭapiṭṭhaṃ, nīharitvā ekamantaṃ nikkhipitabbaṃ; mañcapaṭipādakā nīharitvā ekamantaṃ nikkhipitabbā; kheḷamallako nīharitvā ekamantaṃ nikkhipitabbo; apassenaphalakaṃ nīharitvā ekamantaṃ nikkhipitabbaṃ; bhummattharaṇaṃ yathāpaññattaṃ sallakkhetvā nīharitvā ekamantaṃ nikkhipitabbaṃ. Sace ",
      " vihāre santānakaṃ hoti, ullokā paṭhamaṃ ohāretabbaṃ, ālokasandhikaṇṇabhāgā pamajjitabbā. Sace gerukaparikammakatā bhitti kaṇṇakitā hoti, coḷakaṃ temetvā pīḷetvā pamajjitabbā. Sace kāḷavaṇṇakatā bhūmi kaṇṇakitā hoti, coḷakaṃ temetvā pīḷetvā pamajjitabbā. Sace akatā hoti bhūmi, udakena paripphositvā pariphositvā sammajjitabbā – mā vihāro rajena uhaññīti. Saṅkāraṃ vicinitvā ekamantaṃ chaḍḍetabbaṃ."
    ],
    "innerText": "370. ‘‘Tena hi, bhikkhave, bhikkhūnaṃ senāsanavattaṃ paññapessāmi yathā bhikkhūhi senāsane sammā vattitabbaṃ. Yasmiṃ vihāre viharati, sace so vihāro uklāpo hoti, sace ussahati, sodhetabbo. [mahāva. 66, 67; cūḷava. 357] Vihāraṃ sodhentena paṭhamaṃ pattacīvaraṃ nīharitvā ekamantaṃ nikkhipitabbaṃ; nisīdanapaccattharaṇaṃ nīharitvā ekamantaṃ nikkhipitabbaṃ; bhisibibbohanaṃ nīharitvā ekamantaṃ nikkhipitabbaṃ; mañco nīcaṃ katvā sādhukaṃ appaṭighaṃsantena, asaṅghaṭṭentena kavāṭapiṭṭhaṃ, nīharitvā ekamantaṃ nikkhipitabbo; pīṭhaṃ nīcaṃ katvā sādhukaṃ appaṭighaṃsantena, asaṅghaṭṭentena kavāṭapiṭṭhaṃ, nīharitvā ekamantaṃ nikkhipitabbaṃ; mañcapaṭipādakā nīharitvā ekamantaṃ nikkhipitabbā; kheḷamallako nīharitvā ekamantaṃ nikkhipitabbo; apassenaphalakaṃ nīharitvā ekamantaṃ nikkhipitabbaṃ; bhummattharaṇaṃ yathāpaññattaṃ sallakkhetvā nīharitvā ekamantaṃ nikkhipitabbaṃ. Sace vihāre santānakaṃ hoti, ullokā paṭhamaṃ ohāretabbaṃ, ālokasandhikaṇṇabhāgā pamajjitabbā. Sace gerukaparikammakatā bhitti kaṇṇakitā hoti, coḷakaṃ temetvā pīḷetvā pamajjitabbā. Sace kāḷavaṇṇakatā bhūmi kaṇṇakitā hoti, coḷakaṃ temetvā pīḷetvā pamajjitabbā. Sace akatā hoti bhūmi, udakena paripphositvā pariphositvā sammajjitabbā – mā vihāro rajena uhaññīti. Saṅkāraṃ vicinitvā ekamantaṃ chaḍḍetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Na ",
      " bhikkhusāmantā senāsanaṃ papphoṭetabbaṃ. Na vihārasāmantā senāsanaṃ papphoṭetabbaṃ. Na pānīyasāmantā senāsanaṃ papphoṭetabbaṃ. Na paribhojanīyasāmantā senāsanaṃ papphoṭetabbaṃ. Na paṭivāte aṅgaṇe senāsanaṃ papphoṭetabbaṃ. Adhovāte senāsanaṃ papphoṭetabbaṃ."
    ],
    "innerText": "‘‘Na bhikkhusāmantā senāsanaṃ papphoṭetabbaṃ. Na vihārasāmantā senāsanaṃ papphoṭetabbaṃ. Na pānīyasāmantā senāsanaṃ papphoṭetabbaṃ. Na paribhojanīyasāmantā senāsanaṃ papphoṭetabbaṃ. Na paṭivāte aṅgaṇe senāsanaṃ papphoṭetabbaṃ. Adhovāte senāsanaṃ papphoṭetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Bhummattharaṇaṃ ",
      " ekamantaṃ otāpetvā sodhetvā papphoṭetvā atiharitvā yathāpaññattaṃ paññapetabbaṃ. Mañcapaṭipādakā ekamantaṃ otāpetvā pamajjitvā ",
      " atiharitvā yathāṭhāne ṭhapetabbā. Mañco ekamantaṃ otāpetvā sodhetvā papphoṭetvā nīcaṃ katvā sādhukaṃ appaṭighaṃsantena, asaṅghaṭṭentena kavāṭapiṭṭhaṃ, atiharitvā yathāpaññattaṃ paññapetabbo. Pīṭhaṃ ekamantaṃ otāpetvā sodhetvā papphoṭetvā nīcaṃ katvā sādhukaṃ appaṭighaṃsantena, asaṅghaṭṭentena kavāṭapiṭṭhaṃ, atiharitvā yathāpaññattaṃ paññapetabbaṃ. Bhisibibbohanaṃ ekamantaṃ otāpetvā sodhetvā papphoṭetvā ",
      " atiharitvā yathāpaññattaṃ paññapetabbaṃ. Nisīdanapaccattharaṇaṃ ekamantaṃ otāpetvā sodhetvā papphoṭetvā atiharitvā yathāpaññattaṃ paññapetabbaṃ. Kheḷamallako ekamantaṃ otāpetvā pamajjitvā atiharitvā yathāṭhāne ṭhapetabbo. Apassenaphalakaṃ ekamantaṃ otāpetvā pamajjitvā atiharitvā yathāṭhāne ṭhapetabbaṃ. Pattacīvaraṃ nikkhipitabbaṃ. Pattaṃ nikkhipantena ekena hatthena pattaṃ gahetvā ekena hatthena heṭṭhāmañcaṃ vā heṭṭhāpīṭhaṃ vā parāmasitvā patto nikkhipitabbo. Na ca anantarahitāya bhūmiyā patto nikkhipitabbo. Cīvaraṃ nikkhipantena ekena hatthena cīvaraṃ gahetvā ekena hatthena cīvaravaṃsaṃ vā cīvararajju vā pamajjitvā pārato antaṃ orato bhogaṃ katvā cīvaraṃ nikkhipitabbaṃ."
    ],
    "innerText": "‘‘Bhummattharaṇaṃ ekamantaṃ otāpetvā sodhetvā papphoṭetvā atiharitvā yathāpaññattaṃ paññapetabbaṃ. Mañcapaṭipādakā ekamantaṃ otāpetvā pamajjitvā atiharitvā yathāṭhāne ṭhapetabbā. Mañco ekamantaṃ otāpetvā sodhetvā papphoṭetvā nīcaṃ katvā sādhukaṃ appaṭighaṃsantena, asaṅghaṭṭentena kavāṭapiṭṭhaṃ, atiharitvā yathāpaññattaṃ paññapetabbo. Pīṭhaṃ ekamantaṃ otāpetvā sodhetvā papphoṭetvā nīcaṃ katvā sādhukaṃ appaṭighaṃsantena, asaṅghaṭṭentena kavāṭapiṭṭhaṃ, atiharitvā yathāpaññattaṃ paññapetabbaṃ. Bhisibibbohanaṃ ekamantaṃ otāpetvā sodhetvā papphoṭetvā atiharitvā yathāpaññattaṃ paññapetabbaṃ. Nisīdanapaccattharaṇaṃ ekamantaṃ otāpetvā sodhetvā papphoṭetvā atiharitvā yathāpaññattaṃ paññapetabbaṃ. Kheḷamallako ekamantaṃ otāpetvā pamajjitvā atiharitvā yathāṭhāne ṭhapetabbo. Apassenaphalakaṃ ekamantaṃ otāpetvā pamajjitvā atiharitvā yathāṭhāne ṭhapetabbaṃ. Pattacīvaraṃ nikkhipitabbaṃ. Pattaṃ nikkhipantena ekena hatthena pattaṃ gahetvā ekena hatthena heṭṭhāmañcaṃ vā heṭṭhāpīṭhaṃ vā parāmasitvā patto nikkhipitabbo. Na ca anantarahitāya bhūmiyā patto nikkhipitabbo. Cīvaraṃ nikkhipantena ekena hatthena cīvaraṃ gahetvā ekena hatthena cīvaravaṃsaṃ vā cīvararajju vā pamajjitvā pārato antaṃ orato bhogaṃ katvā cīvaraṃ nikkhipitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sace puratthimā sarajā vātā vāyanti, puratthimā vātapānā thaketabbā. Sace pacchimā sarajā vātā vāyanti, pacchimā vātapānā thaketabbā. Sace uttarā sarajā vātā vāyanti uttarā vātapānā thaketabbā. Sace dakkhiṇā sarajā vātā vāyanti, dakkhiṇā vātapānā thaketabbā. Sace sītakālo hoti, divā vātapānā vivaritabbā, rattiṃ thaketabbā. Sace uṇhakālo hoti, divā vātapānā thaketabbā, rattiṃ vivaritabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace ",
      " pariveṇaṃ uklāpaṃ hoti, pariveṇaṃ sammajjitabbaṃ. Sace koṭṭhako uklāpo hoti, koṭṭhako sammajjitabbo. Sace upaṭṭhānasālā ",
      " uklāpā hoti, upaṭṭhānasālā sammajjitabbā. Sace aggisālā uklāpā hoti, aggisālā sammajjitabbā. Sace vaccakuṭi uklāpā hoti, vaccakuṭi sammajjitabbā. Sace pānīyaṃ na hoti, pānīyaṃ upaṭṭhāpetabbaṃ. Sace paribhojanīyaṃ na hoti, paribhojanīyaṃ upaṭṭhāpetabbaṃ. Sace ācamanakumbhiyā udakaṃ na hoti, ācamanakumbhiyā udakaṃ āsiñcitabbaṃ."
    ],
    "innerText": "‘‘Sace pariveṇaṃ uklāpaṃ hoti, pariveṇaṃ sammajjitabbaṃ. Sace koṭṭhako uklāpo hoti, koṭṭhako sammajjitabbo. Sace upaṭṭhānasālā uklāpā hoti, upaṭṭhānasālā sammajjitabbā. Sace aggisālā uklāpā hoti, aggisālā sammajjitabbā. Sace vaccakuṭi uklāpā hoti, vaccakuṭi sammajjitabbā. Sace pānīyaṃ na hoti, pānīyaṃ upaṭṭhāpetabbaṃ. Sace paribhojanīyaṃ na hoti, paribhojanīyaṃ upaṭṭhāpetabbaṃ. Sace ācamanakumbhiyā udakaṃ na hoti, ācamanakumbhiyā udakaṃ āsiñcitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace vuḍḍhena saddhiṃ ekavihāre viharati, na vuḍḍhaṃ anāpucchā uddeso dātabbo, na paripucchā dātabbā, na sajjhāyo kātabbo, na dhammo bhāsitabbo, na padīpo kātabbo, na padīpo ",
      " vijjhāpetabbo, na vātapānā vivaritabbā, na vātapānā thaketabbā. Sace ",
      " vuḍḍhena saddhiṃ ekacaṅkame caṅkamati, yena vuḍḍho tena parivattitabbaṃ, na ca vuḍḍho saṅghāṭikaṇṇena ghaṭṭetabbo. Idaṃ kho, bhikkhave, bhikkhūnaṃ senāsanavattaṃ yathā bhikkhūhi senāsane sammā vattitabba’’nti."
    ],
    "innerText": "‘‘Sace vuḍḍhena saddhiṃ ekavihāre viharati, na vuḍḍhaṃ anāpucchā uddeso dātabbo, na paripucchā dātabbā, na sajjhāyo kātabbo, na dhammo bhāsitabbo, na padīpo kātabbo, na padīpo vijjhāpetabbo, na vātapānā vivaritabbā, na vātapānā thaketabbā. Sace vuḍḍhena saddhiṃ ekacaṅkame caṅkamati, yena vuḍḍho tena parivattitabbaṃ, na ca vuḍḍho saṅghāṭikaṇṇena ghaṭṭetabbo. Idaṃ kho, bhikkhave, bhikkhūnaṃ senāsanavattaṃ yathā bhikkhūhi senāsane sammā vattitabba’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Jantāgharavattakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "371"
      },
      ". Tena kho pana samayena chabbaggiyā bhikkhū jantāghare therehi bhikkhūhi nivāriyamānā anādariyaṃ paṭicca pahūtaṃ kaṭṭhaṃ āropetvā aggiṃ datvā dvāraṃ thaketvā dvāre nisīdanti. Bhikkhū ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[therā ca bhikkhū (syā. kaṃ.)]"
      },
      " uṇhābhitattā dvāraṃ alabhamānā mucchitā papatanti. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi ",
      " nāma chabbaggiyā bhikkhū jantāghare therehi bhikkhūhi nivāriyamānā anādariyaṃ paṭicca pahūtaṃ kaṭṭhaṃ āropetvā aggiṃ datvā dvāraṃ thaketvā dvāre nisīdissanti! Bhikkhū uṇhābhitattā dvāraṃ alabhamānā mucchitā papatantī’’ti. Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… ‘‘saccaṃ kira, bhikkhave, chabbaggiyā bhikkhū jantāghare therehi bhikkhūhi nivāriyamānā anādariyaṃ paṭicca pahūtaṃ kaṭṭhaṃ āropetvā aggiṃ datvā dvāraṃ thaketvā dvāre nisīdanti; bhikkhū uṇhābhitattā dvāraṃ alabhamānā mucchitā papatantī’’ti? ‘‘Saccaṃ bhagavā’’ti…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘na ",
      ", bhikkhave, jantāghare therena bhikkhunā nivāriyamānena anādariyaṃ paṭicca pahūtaṃ kaṭṭhaṃ āropetvā aggi dātabbo. Yo dadeyya, āpatti dukkaṭassa. Na, bhikkhave, dvāraṃ thaketvā dvāre nisīditabbaṃ. Yo nisīdeyya, āpatti dukkaṭassa."
    ],
    "innerText": "371. Tena kho pana samayena chabbaggiyā bhikkhū jantāghare therehi bhikkhūhi nivāriyamānā anādariyaṃ paṭicca pahūtaṃ kaṭṭhaṃ āropetvā aggiṃ datvā dvāraṃ thaketvā dvāre nisīdanti. Bhikkhū [therā ca bhikkhū (syā. kaṃ.)] uṇhābhitattā dvāraṃ alabhamānā mucchitā papatanti. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma chabbaggiyā bhikkhū jantāghare therehi bhikkhūhi nivāriyamānā anādariyaṃ paṭicca pahūtaṃ kaṭṭhaṃ āropetvā aggiṃ datvā dvāraṃ thaketvā dvāre nisīdissanti! Bhikkhū uṇhābhitattā dvāraṃ alabhamānā mucchitā papatantī’’ti. Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… ‘‘saccaṃ kira, bhikkhave, chabbaggiyā bhikkhū jantāghare therehi bhikkhūhi nivāriyamānā anādariyaṃ paṭicca pahūtaṃ kaṭṭhaṃ āropetvā aggiṃ datvā dvāraṃ thaketvā dvāre nisīdanti; bhikkhū uṇhābhitattā dvāraṃ alabhamānā mucchitā papatantī’’ti? ‘‘Saccaṃ bhagavā’’ti…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘na , bhikkhave, jantāghare therena bhikkhunā nivāriyamānena anādariyaṃ paṭicca pahūtaṃ kaṭṭhaṃ āropetvā aggi dātabbo. Yo dadeyya, āpatti dukkaṭassa. Na, bhikkhave, dvāraṃ thaketvā dvāre nisīditabbaṃ. Yo nisīdeyya, āpatti dukkaṭassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "372"
      },
      ". ‘‘Tena hi, bhikkhave, bhikkhūnaṃ jantāgharavattaṃ paññapessāmi yathā bhikkhūhi jantāghare sammā vattitabbaṃ. Yo paṭhamaṃ jantāgharaṃ gacchati, sace chārikā ussannā hoti, chārikā chaḍḍetabbā. Sace jantāgharaṃ uklāpaṃ hoti, jantāgharaṃ sammajjitabbaṃ. Sace paribhaṇḍaṃ uklāpaṃ hoti, paribhaṇḍaṃ sammajjitabbaṃ. Sace pariveṇaṃ uklāpaṃ hoti, pariveṇaṃ sammajjitabbaṃ. Sace koṭṭhako uklāpo hoti, koṭṭhako sammajjitabbo ",
      ". Sace jantāgharasālā uklāpā hoti, jantāgharasālā sammajjitabbā."
    ],
    "innerText": "372. ‘‘Tena hi, bhikkhave, bhikkhūnaṃ jantāgharavattaṃ paññapessāmi yathā bhikkhūhi jantāghare sammā vattitabbaṃ. Yo paṭhamaṃ jantāgharaṃ gacchati, sace chārikā ussannā hoti, chārikā chaḍḍetabbā. Sace jantāgharaṃ uklāpaṃ hoti, jantāgharaṃ sammajjitabbaṃ. Sace paribhaṇḍaṃ uklāpaṃ hoti, paribhaṇḍaṃ sammajjitabbaṃ. Sace pariveṇaṃ uklāpaṃ hoti, pariveṇaṃ sammajjitabbaṃ. Sace koṭṭhako uklāpo hoti, koṭṭhako sammajjitabbo . Sace jantāgharasālā uklāpā hoti, jantāgharasālā sammajjitabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Cuṇṇaṃ sannetabbaṃ, mattikā temetabbā, udakadoṇikāya udakaṃ āsiñcitabbaṃ. Jantāgharaṃ ",
      " pavisantena mattikāya mukhaṃ makkhetvā purato ca pacchato ca paṭicchādetvā jantāgharaṃ pavisitabbaṃ. Na there bhikkhū anupakhajja nisīditabbaṃ. Na navā bhikkhū āsanena paṭibāhitabbā. Sace ussahati, jantāghare therānaṃ bhikkhūnaṃ parikammaṃ kātabbaṃ. Jantāgharā nikkhamantena jantāgharapīṭhaṃ ādāya purato ca pacchato ca paṭicchādetvā jantāgharā nikkhamitabbaṃ. Sace ussahati, udakepi therānaṃ bhikkhūnaṃ parikammaṃ kātabbaṃ. Na therānaṃ bhikkhūnaṃ puratopi nahāyitabbaṃ, na ",
      " uparitopi nahāyitabbaṃ. Nahātena uttarantena otarantānaṃ maggo dātabbo. Yo pacchā jantāgharā nikkhamati, sace jantāgharaṃ cikkhallaṃ hoti, dhovitabbaṃ. Mattikādoṇikaṃ dhovitvā jantāgharapīṭhaṃ paṭisāmetvā aggiṃ vijjhāpetvā dvāraṃ thaketvā pakkamitabbaṃ. Idaṃ kho, bhikkhave, bhikkhūnaṃ jantāgharavattaṃ yathā bhikkhūhi jantāghare sammā vattitabba’’nti."
    ],
    "innerText": "‘‘Cuṇṇaṃ sannetabbaṃ, mattikā temetabbā, udakadoṇikāya udakaṃ āsiñcitabbaṃ. Jantāgharaṃ pavisantena mattikāya mukhaṃ makkhetvā purato ca pacchato ca paṭicchādetvā jantāgharaṃ pavisitabbaṃ. Na there bhikkhū anupakhajja nisīditabbaṃ. Na navā bhikkhū āsanena paṭibāhitabbā. Sace ussahati, jantāghare therānaṃ bhikkhūnaṃ parikammaṃ kātabbaṃ. Jantāgharā nikkhamantena jantāgharapīṭhaṃ ādāya purato ca pacchato ca paṭicchādetvā jantāgharā nikkhamitabbaṃ. Sace ussahati, udakepi therānaṃ bhikkhūnaṃ parikammaṃ kātabbaṃ. Na therānaṃ bhikkhūnaṃ puratopi nahāyitabbaṃ, na uparitopi nahāyitabbaṃ. Nahātena uttarantena otarantānaṃ maggo dātabbo. Yo pacchā jantāgharā nikkhamati, sace jantāgharaṃ cikkhallaṃ hoti, dhovitabbaṃ. Mattikādoṇikaṃ dhovitvā jantāgharapīṭhaṃ paṭisāmetvā aggiṃ vijjhāpetvā dvāraṃ thaketvā pakkamitabbaṃ. Idaṃ kho, bhikkhave, bhikkhūnaṃ jantāgharavattaṃ yathā bhikkhūhi jantāghare sammā vattitabba’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Vaccakuṭivattakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "373"
      },
      ". Tena kho pana samayena aññataro bhikkhu brāhmaṇajātiko vaccaṃ katvā na icchati ācametuṃ – ko imaṃ vasalaṃ duggandhaṃ ",
      " āmasissatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ācamissatīti (ka.)]"
      },
      ". Tassa vaccamagge kimi saṇṭhāti. Atha kho so bhikkhu bhikkhūnaṃ etamatthaṃ ārocesi. ‘‘Kiṃ pana tvaṃ, āvuso, vaccaṃ katvā na ācamesī’’ti? ‘‘Evamāvuso’’ti. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma bhikkhu vaccaṃ katvā na ācamessatī’’ti! Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… ‘‘saccaṃ kira tvaṃ, bhikkhu, vaccaṃ katvā na ācamesī’’ti? ‘‘Saccaṃ bhagavā’’ti…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘na, bhikkhave, vaccaṃ katvā sati udake nācametabbaṃ. Yo nācameyya, āpatti dukkaṭassā’’ti."
    ],
    "innerText": "373. Tena kho pana samayena aññataro bhikkhu brāhmaṇajātiko vaccaṃ katvā na icchati ācametuṃ – ko imaṃ vasalaṃ duggandhaṃ āmasissatīti [ācamissatīti (ka.)]. Tassa vaccamagge kimi saṇṭhāti. Atha kho so bhikkhu bhikkhūnaṃ etamatthaṃ ārocesi. ‘‘Kiṃ pana tvaṃ, āvuso, vaccaṃ katvā na ācamesī’’ti? ‘‘Evamāvuso’’ti. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma bhikkhu vaccaṃ katvā na ācamessatī’’ti! Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… ‘‘saccaṃ kira tvaṃ, bhikkhu, vaccaṃ katvā na ācamesī’’ti? ‘‘Saccaṃ bhagavā’’ti…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi – ‘‘na, bhikkhave, vaccaṃ katvā sati udake nācametabbaṃ. Yo nācameyya, āpatti dukkaṭassā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tena kho pana samayena bhikkhū vaccakuṭiyā yathāvuḍḍhaṃ vaccaṃ karonti. Navakā bhikkhū paṭhamataraṃ āgantvā vaccitā āgamenti. Te vaccaṃ sandhārentā mucchitā papatanti. Bhagavato etamatthaṃ ārocesuṃ…pe… saccaṃ kira bhikkhave…pe… saccaṃ bhagavāti…pe… ‘‘na, bhikkhave, vaccakuṭiyā yathāvuḍḍhaṃ vacco kātabbo. Yo kareyya, āpatti dukkaṭassa. Anujānāmi, bhikkhave, āgatapaṭipāṭiyā vaccaṃ kātu’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena kho pana samayena chabbaggiyā bhikkhū atisahasāpi vaccakuṭiṃ pavisanti, ubbhajitvāpi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ubbhujjitvāpi (sī.), ubbhujitvā (syā.)]"
      },
      " pavisanti, nitthunantāpi vaccaṃ karonti ",
      ", dantakaṭṭhaṃ khādantāpi vaccaṃ karonti, bahiddhāpi vaccadoṇikāya vaccaṃ karonti, bahiddhāpi passāvadoṇikāya passāvaṃ karonti, passāvadoṇikāyapi kheḷaṃ karonti, pharusenapi kaṭṭhena avalekhanti, avalekhanakaṭṭhampi vaccakūpamhi pātenti, atisahasāpi nikkhamanti, ubbhajitvāpi nikkhamanti, capucapukārakampi ācamenti, ācamanasarāvakepi udakaṃ sesenti. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti ",
      " – ‘‘kathañhi nāma chabbaggiyā bhikkhū atisahasāpi vaccakuṭiṃ pavisissanti, ubbhajitvāpi pavisissanti, nitthunantāpi vaccaṃ karissanti, dantakaṭṭhaṃ khādantāpi vaccaṃ karissanti, bahiddhāpi vaccadoṇikāya vaccaṃ karissanti, bahiddhāpi passāvadoṇikāya passāvaṃ karissanti, passāvadoṇikāyapi kheḷaṃ karissanti, pharusenapi kaṭṭhena avalekhissanti, avalekhanakaṭṭhampi vaccakūpamhi pātessanti, atisahasāpi nikkhamissanti, ubbhajitvāpi nikkhamissanti, capucapukārakampi ācamessanti, ācamanasarāvakepi udakaṃ sesessantī’’ti! Atha kho te bhikkhū bhagavato etamatthaṃ ",
      " ārocesuṃ…pe… saccaṃ kira, bhikkhave…pe… saccaṃ bhagavāti…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi –"
    ],
    "innerText": "Tena kho pana samayena chabbaggiyā bhikkhū atisahasāpi vaccakuṭiṃ pavisanti, ubbhajitvāpi [ubbhujjitvāpi (sī.), ubbhujitvā (syā.)] pavisanti, nitthunantāpi vaccaṃ karonti , dantakaṭṭhaṃ khādantāpi vaccaṃ karonti, bahiddhāpi vaccadoṇikāya vaccaṃ karonti, bahiddhāpi passāvadoṇikāya passāvaṃ karonti, passāvadoṇikāyapi kheḷaṃ karonti, pharusenapi kaṭṭhena avalekhanti, avalekhanakaṭṭhampi vaccakūpamhi pātenti, atisahasāpi nikkhamanti, ubbhajitvāpi nikkhamanti, capucapukārakampi ācamenti, ācamanasarāvakepi udakaṃ sesenti. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma chabbaggiyā bhikkhū atisahasāpi vaccakuṭiṃ pavisissanti, ubbhajitvāpi pavisissanti, nitthunantāpi vaccaṃ karissanti, dantakaṭṭhaṃ khādantāpi vaccaṃ karissanti, bahiddhāpi vaccadoṇikāya vaccaṃ karissanti, bahiddhāpi passāvadoṇikāya passāvaṃ karissanti, passāvadoṇikāyapi kheḷaṃ karissanti, pharusenapi kaṭṭhena avalekhissanti, avalekhanakaṭṭhampi vaccakūpamhi pātessanti, atisahasāpi nikkhamissanti, ubbhajitvāpi nikkhamissanti, capucapukārakampi ācamessanti, ācamanasarāvakepi udakaṃ sesessantī’’ti! Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… saccaṃ kira, bhikkhave…pe… saccaṃ bhagavāti…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "374"
      },
      ". ‘‘Tena hi, bhikkhave, bhikkhūnaṃ vaccakuṭivattaṃ paññapessāmi yathā bhikkhūhi vaccakuṭiyā sammā vattitabbaṃ. Yo ",
      " vaccakuṭiṃ gacchati tena bahi ṭhitena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[bahi ṭhitena (sī. ka.)]"
      },
      " ukkāsitabbaṃ. Anto nisinnenapi ukkāsitabbaṃ. Cīvaravaṃse vā cīvararajjuyā vā cīvaraṃ nikkhipitvā sādhukaṃ ataramānena vaccakuṭī pavisitabbā. Nātisahasā pavisitabbā. Na ubbhajitvā pavisitabbā. Vaccapādukāya ṭhitena ubbhajitabbaṃ. Na nitthunantena vacco kātabbo. Na dantakaṭṭhaṃ khādantena vacco kātabbo. Na bahiddhā vaccadoṇikāya vacco kātabbo. Na bahiddhā passāvadoṇikāya passāvo kātabbo. Na passāvadoṇikāya kheḷo kātabbo. Na pharusena kaṭṭhena avalekhitabbaṃ. Na avalekhanakaṭṭhaṃ vaccakūpamhi pātetabbaṃ. Vaccapādukāya ṭhitena paṭicchādetabbaṃ. Nātisahasā nikkhamitabbaṃ. Na ubbhajitvā nikkhamitabbaṃ. Ācamanapādukāya ṭhitena ubbhajitabbaṃ. Na capucapukārakaṃ ācametabbaṃ. Na ācamanasarāvake udakaṃ sesetabbaṃ. Ācamanapādukāya ṭhitena paṭicchādetabbaṃ."
    ],
    "innerText": "374. ‘‘Tena hi, bhikkhave, bhikkhūnaṃ vaccakuṭivattaṃ paññapessāmi yathā bhikkhūhi vaccakuṭiyā sammā vattitabbaṃ. Yo vaccakuṭiṃ gacchati tena bahi ṭhitena [bahi ṭhitena (sī. ka.)] ukkāsitabbaṃ. Anto nisinnenapi ukkāsitabbaṃ. Cīvaravaṃse vā cīvararajjuyā vā cīvaraṃ nikkhipitvā sādhukaṃ ataramānena vaccakuṭī pavisitabbā. Nātisahasā pavisitabbā. Na ubbhajitvā pavisitabbā. Vaccapādukāya ṭhitena ubbhajitabbaṃ. Na nitthunantena vacco kātabbo. Na dantakaṭṭhaṃ khādantena vacco kātabbo. Na bahiddhā vaccadoṇikāya vacco kātabbo. Na bahiddhā passāvadoṇikāya passāvo kātabbo. Na passāvadoṇikāya kheḷo kātabbo. Na pharusena kaṭṭhena avalekhitabbaṃ. Na avalekhanakaṭṭhaṃ vaccakūpamhi pātetabbaṃ. Vaccapādukāya ṭhitena paṭicchādetabbaṃ. Nātisahasā nikkhamitabbaṃ. Na ubbhajitvā nikkhamitabbaṃ. Ācamanapādukāya ṭhitena ubbhajitabbaṃ. Na capucapukārakaṃ ācametabbaṃ. Na ācamanasarāvake udakaṃ sesetabbaṃ. Ācamanapādukāya ṭhitena paṭicchādetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace vaccakuṭi uhatā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ūhatā (sī. syā.)]"
      },
      " hoti, dhovitabbā. Sace avalekhanapidharo pūro hoti, avalekhanakaṭṭhaṃ chaḍḍetabbaṃ. Sace vaccakuṭi uklāpā hoti, vaccakuṭi sammajjitabbā. Sace paribhaṇḍaṃ uklāpaṃ hoti, paribhaṇḍaṃ sammajjitabbaṃ. Sace pariveṇaṃ uklāpaṃ hoti, pariveṇaṃ sammajjitabbaṃ ",
      ". Sace koṭṭhako uklāpo hoti, koṭṭhako sammajjitabbo. Sace ācamanakumbhiyā udakaṃ na hoti, ācamanakumbhiyā udakaṃ āsiñcitabbaṃ ",
      ". Idaṃ kho, bhikkhave, bhikkhūnaṃ vaccakuṭivattaṃ yathā bhikkhūhi vaccakuṭiyā sammā vattitabba’’nti."
    ],
    "innerText": "‘‘Sace vaccakuṭi uhatā [ūhatā (sī. syā.)] hoti, dhovitabbā. Sace avalekhanapidharo pūro hoti, avalekhanakaṭṭhaṃ chaḍḍetabbaṃ. Sace vaccakuṭi uklāpā hoti, vaccakuṭi sammajjitabbā. Sace paribhaṇḍaṃ uklāpaṃ hoti, paribhaṇḍaṃ sammajjitabbaṃ. Sace pariveṇaṃ uklāpaṃ hoti, pariveṇaṃ sammajjitabbaṃ . Sace koṭṭhako uklāpo hoti, koṭṭhako sammajjitabbo. Sace ācamanakumbhiyā udakaṃ na hoti, ācamanakumbhiyā udakaṃ āsiñcitabbaṃ . Idaṃ kho, bhikkhave, bhikkhūnaṃ vaccakuṭivattaṃ yathā bhikkhūhi vaccakuṭiyā sammā vattitabba’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "11. Upajjhāyavattakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "375"
      },
      ". Tena kho pana samayena saddhivihārikā upajjhāyesu na sammā vattanti. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma saddhivihārikā upajjhāyesu na sammā vattissantī’’ti! Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… ‘‘saccaṃ kira, bhikkhave, saddhivihārikā upajjhāyesu na sammā vattantī’’ti? ‘‘Saccaṃ bhagavā’’ti vigarahi buddho ",
      " bhagavā…pe… ‘‘kathañhi nāma, bhikkhave, saddhivihārikā upajjhāyesu ",
      " na sammā vattissanti! Netaṃ, bhikkhave, appasannānaṃ vā pasādāya…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi –"
    ],
    "innerText": "375. Tena kho pana samayena saddhivihārikā upajjhāyesu na sammā vattanti. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma saddhivihārikā upajjhāyesu na sammā vattissantī’’ti! Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… ‘‘saccaṃ kira, bhikkhave, saddhivihārikā upajjhāyesu na sammā vattantī’’ti? ‘‘Saccaṃ bhagavā’’ti vigarahi buddho bhagavā…pe… ‘‘kathañhi nāma, bhikkhave, saddhivihārikā upajjhāyesu na sammā vattissanti! Netaṃ, bhikkhave, appasannānaṃ vā pasādāya…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "376"
      },
      ". ‘‘Tena hi, bhikkhave, saddhivihārikānaṃ upajjhāyesu vattaṃ paññapessāmi yathā saddhivihārikehi upajjhāyesu sammā vattitabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mahāva. 66]"
      },
      " Saddhivihārikena, bhikkhave, upajjhāyamhi sammā vattitabbaṃ. Tatrāyaṃ sammāvattanā –"
    ],
    "innerText": "376. ‘‘Tena hi, bhikkhave, saddhivihārikānaṃ upajjhāyesu vattaṃ paññapessāmi yathā saddhivihārikehi upajjhāyesu sammā vattitabbaṃ. [mahāva. 66] Saddhivihārikena, bhikkhave, upajjhāyamhi sammā vattitabbaṃ. Tatrāyaṃ sammāvattanā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kālasseva uṭṭhāya upāhanā omuñcitvā ekaṃsaṃ uttarāsaṅgaṃ karitvā dantakaṭṭhaṃ dātabbaṃ, mukhodakaṃ dātabbaṃ, āsanaṃ paññapetabbaṃ. Sace yāgu hoti, bhājanaṃ dhovitvā yāgu upanāmetabbā. Yāguṃ pītassa udakaṃ datvā bhājanaṃ paṭiggahetvā nīcaṃ katvā sādhukaṃ appaṭighaṃsantena dhovitvā paṭisāmetabbaṃ. Upajjhāyamhi vuṭṭhite āsanaṃ uddharitabbaṃ. Sace so deso uklāpo hoti ",
      ", so deso sammajjitabbo."
    ],
    "innerText": "‘‘Kālasseva uṭṭhāya upāhanā omuñcitvā ekaṃsaṃ uttarāsaṅgaṃ karitvā dantakaṭṭhaṃ dātabbaṃ, mukhodakaṃ dātabbaṃ, āsanaṃ paññapetabbaṃ. Sace yāgu hoti, bhājanaṃ dhovitvā yāgu upanāmetabbā. Yāguṃ pītassa udakaṃ datvā bhājanaṃ paṭiggahetvā nīcaṃ katvā sādhukaṃ appaṭighaṃsantena dhovitvā paṭisāmetabbaṃ. Upajjhāyamhi vuṭṭhite āsanaṃ uddharitabbaṃ. Sace so deso uklāpo hoti , so deso sammajjitabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace upajjhāyo gāmaṃ pavisitukāmo hoti, nivāsanaṃ dātabbaṃ, paṭinivāsanaṃ paṭiggahetabbaṃ, kāyabandhanaṃ dātabbaṃ, saguṇaṃ katvā saṅghāṭiyo dātabbā, dhovitvā patto sodako ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[saudako (ka.)]"
      },
      " dātabbo. Sace upajjhāyo pacchāsamaṇaṃ ākaṅkhati, timaṇḍalaṃ paṭicchādentena parimaṇḍalaṃ nivāsetvā kāyabandhanaṃ bandhitvā saguṇaṃ katvā saṅghāṭiyo pārupitvā gaṇṭhikaṃ paṭimuñcitvā dhovitvā pattaṃ gahetvā upajjhāyassa pacchāsamaṇena hotabbaṃ. Nātidūre gantabbaṃ, nāccāsanne gantabbaṃ ",
      ", pattapariyāpannaṃ paṭiggahetabbaṃ. Na upajjhāyassa bhaṇamānassa antarantarā kathā opātetabbā. Upajjhāyo āpattisāmantā bhaṇamāno nivāretabbo."
    ],
    "innerText": "‘‘Sace upajjhāyo gāmaṃ pavisitukāmo hoti, nivāsanaṃ dātabbaṃ, paṭinivāsanaṃ paṭiggahetabbaṃ, kāyabandhanaṃ dātabbaṃ, saguṇaṃ katvā saṅghāṭiyo dātabbā, dhovitvā patto sodako [saudako (ka.)] dātabbo. Sace upajjhāyo pacchāsamaṇaṃ ākaṅkhati, timaṇḍalaṃ paṭicchādentena parimaṇḍalaṃ nivāsetvā kāyabandhanaṃ bandhitvā saguṇaṃ katvā saṅghāṭiyo pārupitvā gaṇṭhikaṃ paṭimuñcitvā dhovitvā pattaṃ gahetvā upajjhāyassa pacchāsamaṇena hotabbaṃ. Nātidūre gantabbaṃ, nāccāsanne gantabbaṃ , pattapariyāpannaṃ paṭiggahetabbaṃ. Na upajjhāyassa bhaṇamānassa antarantarā kathā opātetabbā. Upajjhāyo āpattisāmantā bhaṇamāno nivāretabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Nivattantena paṭhamataraṃ āgantvā āsanaṃ paññapetabbaṃ, pādodakaṃ pādapīṭhaṃ pādakathalikaṃ upanikkhipitabbaṃ, paccuggantvā pattacīvaraṃ paṭiggahetabbaṃ, paṭinivāsanaṃ dātabbaṃ, nivāsanaṃ paṭiggahetabbaṃ. Sace cīvaraṃ sinnaṃ hoti, muhuttaṃ uṇhe otāpetabbaṃ, na ca uṇhe cīvaraṃ nidahitabbaṃ. Cīvaraṃ saṅgharitabbaṃ. Cīvaraṃ saṅgharantena caturaṅgulaṃ kaṇṇaṃ ussāretvā cīvaraṃ saṅgharitabbaṃ – mā majjhe bhaṅgo ahosīti. Obhoge kāyabandhanaṃ kātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace ",
      " piṇḍapāto hoti, upajjhāyo ca bhuñjitukāmo hoti, udakaṃ datvā piṇḍapāto ",
      " upanāmetabbo. Upajjhāyo pānīyena pucchitabbo. Bhuttāvissa udakaṃ datvā pattaṃ paṭiggahetvā nīcaṃ katvā sādhukaṃ appaṭighaṃsantena dhovitvā vodakaṃ katvā muhuttaṃ uṇhe otāpetabbo. Na ca uṇhe patto nidahitabbo. Pattacīvaraṃ ",
      " nikkhipitabbaṃ. Pattaṃ nikkhipantena ekena hatthena pattaṃ gahetvā ekena hatthena heṭṭhāmañcaṃ vā heṭṭhāpīṭhaṃ vā parāmasitvā patto nikkhipitabbo. Na ca anantarahitāya bhūmiyā patto nikkhipitabbo. Cīvaraṃ nikkhipantena ekena hatthena cīvaraṃ gahetvā ekena hatthena cīvaravaṃsaṃ vā cīvararajjuṃ vā pamajjitvā pārato antaṃ orato bhogaṃ katvā cīvaraṃ nikkhipitabbaṃ. Upajjhāyamhi vuṭṭhite āsanaṃ uddharitabbaṃ, pādodakaṃ pādapīṭhaṃ pādakathalikaṃ paṭisāmetabbaṃ. Sace so deso uklāpo hoti, so deso sammajjitabbo."
    ],
    "innerText": "‘‘Sace piṇḍapāto hoti, upajjhāyo ca bhuñjitukāmo hoti, udakaṃ datvā piṇḍapāto upanāmetabbo. Upajjhāyo pānīyena pucchitabbo. Bhuttāvissa udakaṃ datvā pattaṃ paṭiggahetvā nīcaṃ katvā sādhukaṃ appaṭighaṃsantena dhovitvā vodakaṃ katvā muhuttaṃ uṇhe otāpetabbo. Na ca uṇhe patto nidahitabbo. Pattacīvaraṃ nikkhipitabbaṃ. Pattaṃ nikkhipantena ekena hatthena pattaṃ gahetvā ekena hatthena heṭṭhāmañcaṃ vā heṭṭhāpīṭhaṃ vā parāmasitvā patto nikkhipitabbo. Na ca anantarahitāya bhūmiyā patto nikkhipitabbo. Cīvaraṃ nikkhipantena ekena hatthena cīvaraṃ gahetvā ekena hatthena cīvaravaṃsaṃ vā cīvararajjuṃ vā pamajjitvā pārato antaṃ orato bhogaṃ katvā cīvaraṃ nikkhipitabbaṃ. Upajjhāyamhi vuṭṭhite āsanaṃ uddharitabbaṃ, pādodakaṃ pādapīṭhaṃ pādakathalikaṃ paṭisāmetabbaṃ. Sace so deso uklāpo hoti, so deso sammajjitabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sace upajjhāyo nahāyitukāmo hoti, nahānaṃ paṭiyādetabbaṃ. Sace sītena attho hoti, sītaṃ paṭiyādetabbaṃ. Sace uṇhena attho hoti, uṇhaṃ paṭiyādetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace upajjhāyo jantāgharaṃ pavisitukāmo hoti, cuṇṇaṃ sannetabbaṃ, mattikā temetabbā, jantāgharapīṭhaṃ ādāya upajjhāyassa piṭṭhito piṭṭhito gantvā jantāgharapīṭhaṃ datvā cīvaraṃ paṭiggahetvā ekamantaṃ nikkhipitabbaṃ, cuṇṇaṃ dātabbaṃ, mattikā dātabbā. Sace ussahati, jantāgharaṃ pavisitabbaṃ. Jantāgharaṃ pavisantena mattikāya mukhaṃ makkhetvā purato ca pacchato ca paṭicchādetvā ",
      " jantāgharaṃ pavisitabbaṃ. Na there bhikkhū anupakhajja nisīditabbaṃ. Na navā bhikkhū āsanena paṭibāhitabbā. Jantāghare upajjhāyassa parikammaṃ kātabbaṃ. Jantāgharā ",
      " nikkhamantena jantāgharapīṭhaṃ ādāya purato ca pacchato ca paṭicchādetvā jantāgharā nikkhamitabbaṃ."
    ],
    "innerText": "‘‘Sace upajjhāyo jantāgharaṃ pavisitukāmo hoti, cuṇṇaṃ sannetabbaṃ, mattikā temetabbā, jantāgharapīṭhaṃ ādāya upajjhāyassa piṭṭhito piṭṭhito gantvā jantāgharapīṭhaṃ datvā cīvaraṃ paṭiggahetvā ekamantaṃ nikkhipitabbaṃ, cuṇṇaṃ dātabbaṃ, mattikā dātabbā. Sace ussahati, jantāgharaṃ pavisitabbaṃ. Jantāgharaṃ pavisantena mattikāya mukhaṃ makkhetvā purato ca pacchato ca paṭicchādetvā jantāgharaṃ pavisitabbaṃ. Na there bhikkhū anupakhajja nisīditabbaṃ. Na navā bhikkhū āsanena paṭibāhitabbā. Jantāghare upajjhāyassa parikammaṃ kātabbaṃ. Jantāgharā nikkhamantena jantāgharapīṭhaṃ ādāya purato ca pacchato ca paṭicchādetvā jantāgharā nikkhamitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Udakepi upajjhāyassa parikammaṃ kātabbaṃ. Nahātena paṭhamataraṃ uttaritvā attano gattaṃ vodakaṃ katvā nivāsetvā upajjhāyassa gattato udakaṃ pamajjitabbaṃ, nivāsanaṃ dātabbaṃ, saṅghāṭi dātabbā, jantāgharapīṭhaṃ ādāya paṭhamataraṃ āgantvā āsanaṃ paññapetabbaṃ, pādodakaṃ pādapīṭhaṃ pādakathalikaṃ upanikkhipitabbaṃ. Upajjhāyo pānīyena pucchitabbo. Sace uddisāpetukāmo hoti, uddisitabbo. Sace paripucchitukāmo hoti, paripucchitabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yasmiṃ ",
      " vihāre upajjhāyo viharati, sace so vihāro uklāpo hoti, sace ussahati, sodhetabbo. Vihāraṃ sodhentena paṭhamaṃ pattacīvaraṃ nīharitvā ekamantaṃ nikkhipitabbaṃ; nisīdanapaccattharaṇaṃ nīharitvā ekamantaṃ nikkhipitabbaṃ; bhisibibbohanaṃ nīharitvā ekamantaṃ nikkhipitabbaṃ; mañco nīcaṃ katvā sādhukaṃ appaṭighaṃsantena ",
      ", asaṅghaṭṭentena kavāṭapiṭṭhaṃ, nīharitvā ekamantaṃ nikkhipitabbo; pīṭhaṃ nīcaṃ katvā sādhukaṃ appaṭighaṃsantena, asaṅghaṭṭentena kavāṭapiṭṭhaṃ, nīharitvā ekamantaṃ nikkhipitabbaṃ; mañcapaṭipādakā nīharitvā ekamantaṃ nikkhipitabbā; kheḷamallako nīharitvā ekamantaṃ nikkhipitabbo; apassenaphalakaṃ ",
      " nīharitvā ekamantaṃ nikkhipitabbaṃ; bhūmattharaṇaṃ yathāpaññattaṃ sallakkhetvā nīharitvā ekamantaṃ nikkhipitabbaṃ. Sace vihāre santānakaṃ hoti, ullokā paṭhamaṃ ohāretabbaṃ, ālokasandhikaṇṇabhāgā pamajjitabbā. Sace gerukaparikammakatā bhitti kaṇṇakitā hoti, coḷakaṃ temetvā pīḷetvā pamajjitabbā. Sace kāḷavaṇṇakatā bhūmi kaṇṇakitā hoti, coḷakaṃ temetvā pīḷetvā pamajjitabbā. Sace akatā hoti bhūmi, udakena paripphositvā pariphositvā sammajjitabbā – mā vihāro rajena uhaññīti. Saṅkāraṃ vicinitvā ekamantaṃ chaḍḍetabbaṃ."
    ],
    "innerText": "‘‘Yasmiṃ vihāre upajjhāyo viharati, sace so vihāro uklāpo hoti, sace ussahati, sodhetabbo. Vihāraṃ sodhentena paṭhamaṃ pattacīvaraṃ nīharitvā ekamantaṃ nikkhipitabbaṃ; nisīdanapaccattharaṇaṃ nīharitvā ekamantaṃ nikkhipitabbaṃ; bhisibibbohanaṃ nīharitvā ekamantaṃ nikkhipitabbaṃ; mañco nīcaṃ katvā sādhukaṃ appaṭighaṃsantena , asaṅghaṭṭentena kavāṭapiṭṭhaṃ, nīharitvā ekamantaṃ nikkhipitabbo; pīṭhaṃ nīcaṃ katvā sādhukaṃ appaṭighaṃsantena, asaṅghaṭṭentena kavāṭapiṭṭhaṃ, nīharitvā ekamantaṃ nikkhipitabbaṃ; mañcapaṭipādakā nīharitvā ekamantaṃ nikkhipitabbā; kheḷamallako nīharitvā ekamantaṃ nikkhipitabbo; apassenaphalakaṃ nīharitvā ekamantaṃ nikkhipitabbaṃ; bhūmattharaṇaṃ yathāpaññattaṃ sallakkhetvā nīharitvā ekamantaṃ nikkhipitabbaṃ. Sace vihāre santānakaṃ hoti, ullokā paṭhamaṃ ohāretabbaṃ, ālokasandhikaṇṇabhāgā pamajjitabbā. Sace gerukaparikammakatā bhitti kaṇṇakitā hoti, coḷakaṃ temetvā pīḷetvā pamajjitabbā. Sace kāḷavaṇṇakatā bhūmi kaṇṇakitā hoti, coḷakaṃ temetvā pīḷetvā pamajjitabbā. Sace akatā hoti bhūmi, udakena paripphositvā pariphositvā sammajjitabbā – mā vihāro rajena uhaññīti. Saṅkāraṃ vicinitvā ekamantaṃ chaḍḍetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Bhūmattharaṇaṃ otāpetvā sodhetvā papphoṭetvā atiharitvā yathāpaññattaṃ paññapetabbaṃ. Mañcapaṭipādakā otāpetvā pamajjitvā atiharitvā yathāṭhāne ṭhapetabbā. Mañco otāpetvā sodhetvā papphoṭetvā nīcaṃ katvā sādhukaṃ appaṭighaṃsantena, asaṅghaṭṭentena kavāṭapiṭṭhaṃ, atiharitvā yathāpaññattaṃ paññapetabbo. Pīṭhaṃ otāpetvā sodhetvā papphoṭetvā nīcaṃ katvā sādhukaṃ appaṭighaṃsantena, asaṅghaṭṭentena kavāṭapiṭṭhaṃ, atiharitvā yathāpaññattaṃ paññapetabbaṃ. Bhisibibbohanaṃ otāpetvā sodhetvā papphoṭetvā atiharitvā yathāpaññattaṃ paññapetabbaṃ. Nisīdanapaccattharaṇaṃ ",
      " otāpetvā sodhetvā papphoṭetvā atiharitvā yathāpaññattaṃ paññapetabbaṃ. Kheḷamallako otāpetvā ",
      " pamajjitvā atiharitvā yathāṭhāne ṭhapetabbo. Apassenaphalakaṃ otāpetvā pamajjitvā atiharitvā yathāṭhāne ṭhapetabbaṃ. Pattacīvaraṃ nikkhipitabbaṃ. Pattaṃ nikkhipantena ekena hatthena pattaṃ gahetvā ekena hatthena heṭṭhāmañcaṃ vā heṭṭhāpīṭhaṃ vā parāmasitvā patto ",
      " nikkhipitabbo. Na ca anantarahitāya bhūmiyā patto nikkhipitabbo. Cīvaraṃ nikkhipantena ekena hatthena cīvaraṃ gahetvā ekena hatthena cīvaravaṃsaṃ vā cīvararajjuṃ vā pamajjitvā pārato antaṃ orato bhogaṃ katvā cīvaraṃ nikkhipitabbaṃ."
    ],
    "innerText": "‘‘Bhūmattharaṇaṃ otāpetvā sodhetvā papphoṭetvā atiharitvā yathāpaññattaṃ paññapetabbaṃ. Mañcapaṭipādakā otāpetvā pamajjitvā atiharitvā yathāṭhāne ṭhapetabbā. Mañco otāpetvā sodhetvā papphoṭetvā nīcaṃ katvā sādhukaṃ appaṭighaṃsantena, asaṅghaṭṭentena kavāṭapiṭṭhaṃ, atiharitvā yathāpaññattaṃ paññapetabbo. Pīṭhaṃ otāpetvā sodhetvā papphoṭetvā nīcaṃ katvā sādhukaṃ appaṭighaṃsantena, asaṅghaṭṭentena kavāṭapiṭṭhaṃ, atiharitvā yathāpaññattaṃ paññapetabbaṃ. Bhisibibbohanaṃ otāpetvā sodhetvā papphoṭetvā atiharitvā yathāpaññattaṃ paññapetabbaṃ. Nisīdanapaccattharaṇaṃ otāpetvā sodhetvā papphoṭetvā atiharitvā yathāpaññattaṃ paññapetabbaṃ. Kheḷamallako otāpetvā pamajjitvā atiharitvā yathāṭhāne ṭhapetabbo. Apassenaphalakaṃ otāpetvā pamajjitvā atiharitvā yathāṭhāne ṭhapetabbaṃ. Pattacīvaraṃ nikkhipitabbaṃ. Pattaṃ nikkhipantena ekena hatthena pattaṃ gahetvā ekena hatthena heṭṭhāmañcaṃ vā heṭṭhāpīṭhaṃ vā parāmasitvā patto nikkhipitabbo. Na ca anantarahitāya bhūmiyā patto nikkhipitabbo. Cīvaraṃ nikkhipantena ekena hatthena cīvaraṃ gahetvā ekena hatthena cīvaravaṃsaṃ vā cīvararajjuṃ vā pamajjitvā pārato antaṃ orato bhogaṃ katvā cīvaraṃ nikkhipitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace puratthimā sarajā vātā vāyanti, puratthimā vātapānā thaketabbā. Sace pacchimā sarajā vātā vāyanti, pacchimā vātapānā thaketabbā. Sace uttarā sarajā vātā vāyanti, uttarā vātapānā thaketabbā. Sace dakkhiṇā ",
      " sarajā vātā vāyanti, dakkhiṇā vātapānā thaketabbā. Sace sītakālo hoti, divā vātapānā vivaritabbā, rattiṃ thaketabbā. Sace uṇhakālo hoti, divā vātapānā thaketabbā, rattiṃ vivaritabbā."
    ],
    "innerText": "‘‘Sace puratthimā sarajā vātā vāyanti, puratthimā vātapānā thaketabbā. Sace pacchimā sarajā vātā vāyanti, pacchimā vātapānā thaketabbā. Sace uttarā sarajā vātā vāyanti, uttarā vātapānā thaketabbā. Sace dakkhiṇā sarajā vātā vāyanti, dakkhiṇā vātapānā thaketabbā. Sace sītakālo hoti, divā vātapānā vivaritabbā, rattiṃ thaketabbā. Sace uṇhakālo hoti, divā vātapānā thaketabbā, rattiṃ vivaritabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace pariveṇaṃ uklāpaṃ hoti, pariveṇaṃ sammajjitabbaṃ. Sace koṭṭhako uklāpo hoti, koṭṭhako sammajjitabbo. Sace upaṭṭhānasālā uklāpā hoti, upaṭṭhānasālā sammajjitabbā. Sace aggisālā uklāpā hoti, aggisālā sammajjitabbā. Sace vaccakuṭi uklāpā hoti, vaccakuṭi sammajjitabbā. Sace pānīyaṃ na hoti, pānīyaṃ upaṭṭhāpetabbaṃ. Sace paribhojanīyaṃ na hoti, paribhojanīyaṃ ",
      " upaṭṭhāpetabbaṃ. Sace ācamanakumbhiyā udakaṃ na hoti, ācamanakumbhiyā udakaṃ āsiñcitabbaṃ."
    ],
    "innerText": "‘‘Sace pariveṇaṃ uklāpaṃ hoti, pariveṇaṃ sammajjitabbaṃ. Sace koṭṭhako uklāpo hoti, koṭṭhako sammajjitabbo. Sace upaṭṭhānasālā uklāpā hoti, upaṭṭhānasālā sammajjitabbā. Sace aggisālā uklāpā hoti, aggisālā sammajjitabbā. Sace vaccakuṭi uklāpā hoti, vaccakuṭi sammajjitabbā. Sace pānīyaṃ na hoti, pānīyaṃ upaṭṭhāpetabbaṃ. Sace paribhojanīyaṃ na hoti, paribhojanīyaṃ upaṭṭhāpetabbaṃ. Sace ācamanakumbhiyā udakaṃ na hoti, ācamanakumbhiyā udakaṃ āsiñcitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace upajjhāyassa anabhirati uppannā hoti, saddhivihārikena vūpakāsetabbo, vūpakāsāpetabbo, dhammakathā vāssa kātabbā. Sace upajjhāyassa kukkuccaṃ uppannaṃ hoti, saddhivihārikena vinodetabbaṃ, vinodāpetabbaṃ, dhammakathā vāssa kātabbā. Sace upajjhāyassa diṭṭhigataṃ uppannaṃ hoti, saddhivihārikena vivecetabbaṃ, vivecāpetabbaṃ, dhammakathā vāssa kātabbā. Sace upajjhāyo garudhammaṃ ajjhāpanno hoti parivāsāraho, saddhivihārikena ussukkaṃ kātabbaṃ – kinti nu kho saṅgho upajjhāyassa parivāsaṃ dadeyyāti. Sace upajjhāyo mūlāyapaṭikassanāraho hoti, saddhivihārikena ussukkaṃ kātabbaṃ – kinti nu kho saṅgho upajjhāyaṃ mūlāya paṭikasseyyāti. Sace upajjhāyo mānattāraho hoti, saddhivihārikena ussukkaṃ kātabbaṃ – kinti nu kho saṅgho upajjhāyassa mānattaṃ dadeyyāti. Sace ",
      " upajjhāyo abbhānāraho hoti, saddhivihārikena ussukkaṃ kātabbaṃ – kinti nu kho ",
      " saṅgho upajjhāyaṃ abbheyyāti. Sace saṅgho upajjhāyassa kammaṃ kattukāmo hoti, tajjanīyaṃ vā niyassaṃ vā pabbājanīyaṃ vā paṭisāraṇīyaṃ vā ukkhepanīyaṃ vā, saddhivihārikena ussukkaṃ kātabbaṃ – kinti nu kho saṅgho upajjhāyassa kammaṃ na kareyya, lahukāya vā pariṇāmeyyāti. Kataṃ ",
      " vā panassa hoti saṅghena kammaṃ, tajjanīyaṃ vā niyassaṃ vā pabbājanīyaṃ vā paṭisāraṇīyaṃ vā ukkhepanīyaṃ vā, saddhivihārikena ussukkaṃ kātabbaṃ – kinti nu kho upajjhāyo sammā vatteyya, lomaṃ pāteyya, netthāraṃ vatteyya, saṅgho taṃ kammaṃ paṭippassambheyyāti."
    ],
    "innerText": "‘‘Sace upajjhāyassa anabhirati uppannā hoti, saddhivihārikena vūpakāsetabbo, vūpakāsāpetabbo, dhammakathā vāssa kātabbā. Sace upajjhāyassa kukkuccaṃ uppannaṃ hoti, saddhivihārikena vinodetabbaṃ, vinodāpetabbaṃ, dhammakathā vāssa kātabbā. Sace upajjhāyassa diṭṭhigataṃ uppannaṃ hoti, saddhivihārikena vivecetabbaṃ, vivecāpetabbaṃ, dhammakathā vāssa kātabbā. Sace upajjhāyo garudhammaṃ ajjhāpanno hoti parivāsāraho, saddhivihārikena ussukkaṃ kātabbaṃ – kinti nu kho saṅgho upajjhāyassa parivāsaṃ dadeyyāti. Sace upajjhāyo mūlāyapaṭikassanāraho hoti, saddhivihārikena ussukkaṃ kātabbaṃ – kinti nu kho saṅgho upajjhāyaṃ mūlāya paṭikasseyyāti. Sace upajjhāyo mānattāraho hoti, saddhivihārikena ussukkaṃ kātabbaṃ – kinti nu kho saṅgho upajjhāyassa mānattaṃ dadeyyāti. Sace upajjhāyo abbhānāraho hoti, saddhivihārikena ussukkaṃ kātabbaṃ – kinti nu kho saṅgho upajjhāyaṃ abbheyyāti. Sace saṅgho upajjhāyassa kammaṃ kattukāmo hoti, tajjanīyaṃ vā niyassaṃ vā pabbājanīyaṃ vā paṭisāraṇīyaṃ vā ukkhepanīyaṃ vā, saddhivihārikena ussukkaṃ kātabbaṃ – kinti nu kho saṅgho upajjhāyassa kammaṃ na kareyya, lahukāya vā pariṇāmeyyāti. Kataṃ vā panassa hoti saṅghena kammaṃ, tajjanīyaṃ vā niyassaṃ vā pabbājanīyaṃ vā paṭisāraṇīyaṃ vā ukkhepanīyaṃ vā, saddhivihārikena ussukkaṃ kātabbaṃ – kinti nu kho upajjhāyo sammā vatteyya, lomaṃ pāteyya, netthāraṃ vatteyya, saṅgho taṃ kammaṃ paṭippassambheyyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace upajjhāyassa cīvaraṃ dhovitabbaṃ hoti ",
      ", saddhivihārikena dhovitabbaṃ, ussukkaṃ vā kātabbaṃ – kinti nu kho upajjhāyassa cīvaraṃ dhoviyethāti. Sace upajjhāyassa cīvaraṃ kātabbaṃ hoti, saddhivihārikena kātabbaṃ, ussukkaṃ vā kātabbaṃ – kinti nu kho upajjhāyassa cīvaraṃ kariyethāti. Sace upajjhāyassa rajanā pacitabbā hoti, saddhivihārikena pacitabbā, ussukkaṃ vā kātabbaṃ – kinti nu kho upajjhāyassa rajanaṃ paciyethāti. Sace upajjhāyassa cīvaraṃ rajitabbaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[rajetabbaṃ (syā.)]"
      },
      " hoti, saddhivihārikena rajitabbaṃ, ussukkaṃ vā kātabbaṃ – kinti nu kho upajjhāyassa cīvaraṃ rajiyethāti. Cīvaraṃ rajantena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[rajentena (syā.)]"
      },
      " sādhukaṃ samparivattakaṃ samparivattakaṃ rajitabbaṃ, na ca acchinne theve pakkamitabbaṃ."
    ],
    "innerText": "‘‘Sace upajjhāyassa cīvaraṃ dhovitabbaṃ hoti , saddhivihārikena dhovitabbaṃ, ussukkaṃ vā kātabbaṃ – kinti nu kho upajjhāyassa cīvaraṃ dhoviyethāti. Sace upajjhāyassa cīvaraṃ kātabbaṃ hoti, saddhivihārikena kātabbaṃ, ussukkaṃ vā kātabbaṃ – kinti nu kho upajjhāyassa cīvaraṃ kariyethāti. Sace upajjhāyassa rajanā pacitabbā hoti, saddhivihārikena pacitabbā, ussukkaṃ vā kātabbaṃ – kinti nu kho upajjhāyassa rajanaṃ paciyethāti. Sace upajjhāyassa cīvaraṃ rajitabbaṃ [rajetabbaṃ (syā.)] hoti, saddhivihārikena rajitabbaṃ, ussukkaṃ vā kātabbaṃ – kinti nu kho upajjhāyassa cīvaraṃ rajiyethāti. Cīvaraṃ rajantena [rajentena (syā.)] sādhukaṃ samparivattakaṃ samparivattakaṃ rajitabbaṃ, na ca acchinne theve pakkamitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Na upajjhāyaṃ anāpucchā ekaccassa patto dātabbo, na ekaccassa patto paṭiggahetabbo; na ekaccassa cīvaraṃ dātabbaṃ, na ekaccassa cīvaraṃ paṭiggahetabbaṃ; na ekaccassa parikkhāro dātabbo, na ekaccassa parikkhāro paṭiggahetabbo; na ekaccassa kesā chedetabbā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[chettabbā (sī.), cheditabbā (ka.)]"
      },
      ", na ekaccena kesā ",
      " chedāpetabbā; na ekaccassa parikammaṃ kātabbaṃ, na ekaccena parikammaṃ kārāpetabbaṃ; na ekaccassa veyyāvacco ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[veyyāvaccaṃ (ka.)]"
      },
      " kātabbo, na ekaccena veyyāvacco kārāpetabbo; na ekaccassa pacchāsamaṇena hotabbaṃ, na ekacco pacchāsamaṇo ādātabbo; na ekaccassa piṇḍapāto nīharitabbo, na ekaccena piṇḍapāto nīharāpetabbo; na upajjhāyaṃ anāpucchā gāmo pavisitabbo; na susānaṃ gantabbaṃ; na disā pakkamitabbā. Sace upajjhāyo gilāno hoti, yāvajīvaṃ upaṭṭhātabbo ",
      ", vuṭṭhānamassa āgametabbaṃ. Idaṃ kho, bhikkhave, saddhivihārikānaṃ upajjhāyesu vattaṃ yathā saddhivihārikehi upajjhāyesu sammā vattitabba’’nti."
    ],
    "innerText": "‘‘Na upajjhāyaṃ anāpucchā ekaccassa patto dātabbo, na ekaccassa patto paṭiggahetabbo; na ekaccassa cīvaraṃ dātabbaṃ, na ekaccassa cīvaraṃ paṭiggahetabbaṃ; na ekaccassa parikkhāro dātabbo, na ekaccassa parikkhāro paṭiggahetabbo; na ekaccassa kesā chedetabbā [chettabbā (sī.), cheditabbā (ka.)], na ekaccena kesā chedāpetabbā; na ekaccassa parikammaṃ kātabbaṃ, na ekaccena parikammaṃ kārāpetabbaṃ; na ekaccassa veyyāvacco [veyyāvaccaṃ (ka.)] kātabbo, na ekaccena veyyāvacco kārāpetabbo; na ekaccassa pacchāsamaṇena hotabbaṃ, na ekacco pacchāsamaṇo ādātabbo; na ekaccassa piṇḍapāto nīharitabbo, na ekaccena piṇḍapāto nīharāpetabbo; na upajjhāyaṃ anāpucchā gāmo pavisitabbo; na susānaṃ gantabbaṃ; na disā pakkamitabbā. Sace upajjhāyo gilāno hoti, yāvajīvaṃ upaṭṭhātabbo , vuṭṭhānamassa āgametabbaṃ. Idaṃ kho, bhikkhave, saddhivihārikānaṃ upajjhāyesu vattaṃ yathā saddhivihārikehi upajjhāyesu sammā vattitabba’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "12. Saddhivihārikavattakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "377"
      },
      ". Tena ",
      " kho pana samayena upajjhāyā saddhivihārikesu na sammā vattanti. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma upajjhāyā saddhivihārikesu na sammā vattissantī’’ti! Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… ‘‘saccaṃ kira, bhikkhave, upajjhāyā saddhivihārikesu na sammā vattantī’’ti? ‘‘Saccaṃ bhagavā’’ti…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi –"
    ],
    "innerText": "377. Tena kho pana samayena upajjhāyā saddhivihārikesu na sammā vattanti. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma upajjhāyā saddhivihārikesu na sammā vattissantī’’ti! Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… ‘‘saccaṃ kira, bhikkhave, upajjhāyā saddhivihārikesu na sammā vattantī’’ti? ‘‘Saccaṃ bhagavā’’ti…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "378"
      },
      ". ‘‘Tena hi, bhikkhave, upajjhāyānaṃ saddhivihārikesu vattaṃ paññapessāmi yathā upajjhāyehi saddhivihārikesu sammā vattitabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mahāva. 67]"
      },
      " Upajjhāyena, bhikkhave, saddhivihārikamhi sammā vattitabbaṃ ",
      ". Tatrāyaṃ ",
      " sammāvattanā –"
    ],
    "innerText": "378. ‘‘Tena hi, bhikkhave, upajjhāyānaṃ saddhivihārikesu vattaṃ paññapessāmi yathā upajjhāyehi saddhivihārikesu sammā vattitabbaṃ. [mahāva. 67] Upajjhāyena, bhikkhave, saddhivihārikamhi sammā vattitabbaṃ . Tatrāyaṃ sammāvattanā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Upajjhāyena, bhikkhave, saddhivihāriko saṅgahetabbo anuggahetabbo uddesena paripucchāya ovādena anusāsaniyā. Sace upajjhāyassa patto hoti, saddhivihārikassa patto na hoti, upajjhāyena saddhivihārikassa patto dātabbo, ussukkaṃ vā kātabbaṃ – kinti nu kho saddhivihārikassa patto uppajjiyethāti. Sace upajjhāyassa cīvaraṃ hoti, saddhivihārikassa cīvaraṃ na hoti, upajjhāyena saddhivihārikassa cīvaraṃ dātabbaṃ, ussukkaṃ vā kātabbaṃ – kinti nu kho saddhivihārikassa cīvaraṃ uppajjiyethāti. Sace upajjhāyassa parikkhāro hoti, saddhivihārikassa parikkhāro na hoti, upajjhāyena saddhivihārikassa parikkhāro dātabbo, ussukkaṃ vā kātabbaṃ – kinti nu kho saddhivihārikassa parikkhāro uppajjiyethāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace saddhivihāriko gilāno hoti, kālasseva uṭṭhāya dantakaṭṭhaṃ dātabbaṃ, mukhodakaṃ dātabbaṃ, āsanaṃ paññapetabbaṃ. Sace yāgu hoti, bhājanaṃ dhovitvā yāgu upanāmetabbā. Yāguṃ pītassa udakaṃ ",
      " datvā bhājanaṃ paṭiggahetvā nīcaṃ katvā sādhukaṃ appaṭighaṃsantena dhovitvā paṭisāmetabbaṃ. Saddhivihārikamhi vuṭṭhite āsanaṃ uddharitabbaṃ. Sace so deso uklāpo hoti, so deso sammajjitabbo."
    ],
    "innerText": "‘‘Sace saddhivihāriko gilāno hoti, kālasseva uṭṭhāya dantakaṭṭhaṃ dātabbaṃ, mukhodakaṃ dātabbaṃ, āsanaṃ paññapetabbaṃ. Sace yāgu hoti, bhājanaṃ dhovitvā yāgu upanāmetabbā. Yāguṃ pītassa udakaṃ datvā bhājanaṃ paṭiggahetvā nīcaṃ katvā sādhukaṃ appaṭighaṃsantena dhovitvā paṭisāmetabbaṃ. Saddhivihārikamhi vuṭṭhite āsanaṃ uddharitabbaṃ. Sace so deso uklāpo hoti, so deso sammajjitabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace saddhivihāriko gāmaṃ pavisitukāmo hoti, nivāsanaṃ dātabbaṃ, paṭinivāsanaṃ paṭiggahetabbaṃ ",
      ", kāyabandhanaṃ dātabbaṃ, saguṇaṃ katvā saṅghāṭiyo dātabbā ",
      ", dhovitvā patto sodako dātabbo."
    ],
    "innerText": "‘‘Sace saddhivihāriko gāmaṃ pavisitukāmo hoti, nivāsanaṃ dātabbaṃ, paṭinivāsanaṃ paṭiggahetabbaṃ , kāyabandhanaṃ dātabbaṃ, saguṇaṃ katvā saṅghāṭiyo dātabbā , dhovitvā patto sodako dātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ettāvatā nivattissatīti āsanaṃ paññapetabbaṃ, pādodakaṃ pādapīṭhaṃ pādakathalikaṃ upanikkhipitabbaṃ, paccuggantvā pattacīvaraṃ paṭiggahetabbaṃ, paṭinivāsanaṃ dātabbaṃ, nivāsanaṃ paṭiggahetabbaṃ. Sace cīvaraṃ sinnaṃ hoti, muhuttaṃ uṇhe otāpetabbaṃ, na ca uṇhe cīvaraṃ nidahitabbaṃ. Cīvaraṃ saṅgharitabbaṃ. Cīvaraṃ saṅgharantena caturaṅgulaṃ kaṇṇaṃ ussāretvā cīvaraṃ saṅgharitabbaṃ – mā majjhe bhaṅgo ahosīti. Obhoge kāyabandhanaṃ kātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace piṇḍapāto hoti, saddhivihāriko ca bhuñjitukāmo hoti, udakaṃ datvā piṇḍapāto upanāmetabbo. Saddhivihāriko pānīyena pucchitabbo. Bhuttāvissa udakaṃ datvā pattaṃ paṭiggahetvā nīcaṃ katvā sādhukaṃ appaṭighaṃsantena dhovitvā vodakaṃ katvā muhuttaṃ uṇhe otāpetabbo, na ca uṇhe patto nidahitabbo. Pattacīvaraṃ nikkhipitabbaṃ. Pattaṃ nikkhipantena ekena hatthena pattaṃ gahetvā ekena hatthena heṭṭhāmañcaṃ ",
      " vā heṭṭhāpīṭhaṃ vā parāmasitvā patto nikkhipitabbo. Na ca anantarahitāya bhūmiyā patto nikkhipitabbo. Cīvaraṃ nikkhipantena ekena hatthena cīvaraṃ gahetvā ekena hatthena cīvaravaṃsaṃ vā cīvararajjuṃ vā pamajjitvā pārato antaṃ orato bhogaṃ katvā cīvaraṃ nikkhipitabbaṃ. Saddhivihārikamhi vuṭṭhite āsanaṃ uddharitabbaṃ, pādodakaṃ pādapīṭhaṃ pādakathalikaṃ paṭisāmetabbaṃ. Sace so deso uklāpo hoti, so deso sammajjitabbo ",
      "."
    ],
    "innerText": "‘‘Sace piṇḍapāto hoti, saddhivihāriko ca bhuñjitukāmo hoti, udakaṃ datvā piṇḍapāto upanāmetabbo. Saddhivihāriko pānīyena pucchitabbo. Bhuttāvissa udakaṃ datvā pattaṃ paṭiggahetvā nīcaṃ katvā sādhukaṃ appaṭighaṃsantena dhovitvā vodakaṃ katvā muhuttaṃ uṇhe otāpetabbo, na ca uṇhe patto nidahitabbo. Pattacīvaraṃ nikkhipitabbaṃ. Pattaṃ nikkhipantena ekena hatthena pattaṃ gahetvā ekena hatthena heṭṭhāmañcaṃ vā heṭṭhāpīṭhaṃ vā parāmasitvā patto nikkhipitabbo. Na ca anantarahitāya bhūmiyā patto nikkhipitabbo. Cīvaraṃ nikkhipantena ekena hatthena cīvaraṃ gahetvā ekena hatthena cīvaravaṃsaṃ vā cīvararajjuṃ vā pamajjitvā pārato antaṃ orato bhogaṃ katvā cīvaraṃ nikkhipitabbaṃ. Saddhivihārikamhi vuṭṭhite āsanaṃ uddharitabbaṃ, pādodakaṃ pādapīṭhaṃ pādakathalikaṃ paṭisāmetabbaṃ. Sace so deso uklāpo hoti, so deso sammajjitabbo ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sace saddhivihāriko nahāyitukāmo hoti, nahānaṃ paṭiyādetabbaṃ. Sace sītena attho hoti, sītaṃ paṭiyādetabbaṃ. Sace uṇhena attho hoti, uṇhaṃ paṭiyādetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace ",
      " saddhivihāriko jantāgharaṃ pavisitukāmo hoti, cuṇṇaṃ sannetabbaṃ, mattikā temetabbā, jantāgharapīṭhaṃ ādāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ādāya saddhivihārikassa piṭṭhito piṭṭhito (ka.)]"
      },
      " gantvā jantāgharapīṭhaṃ datvā cīvaraṃ paṭiggahetvā ekamantaṃ nikkhipitabbaṃ, cuṇṇaṃ dātabbaṃ, mattikā dātabbā. Sace ussahati jantāgharaṃ pavisitabbaṃ. Jantāgharaṃ pavisantena mattikāya mukhaṃ makkhetvā purato ca pacchato ca paṭicchādetvā jantāgharaṃ pavisitabbaṃ. Na there bhikkhū anupakhajja nisīditabbaṃ, na navā bhikkhū āsanena paṭibāhitabbā. Jantāghare saddhivihārikassa parikammaṃ kātabbaṃ. Jantāgharā nikkhamantena jantāgharapīṭhaṃ ādāya purato ca pacchato ca paṭicchādetvā jantāgharā nikkhamitabbaṃ."
    ],
    "innerText": "‘‘Sace saddhivihāriko jantāgharaṃ pavisitukāmo hoti, cuṇṇaṃ sannetabbaṃ, mattikā temetabbā, jantāgharapīṭhaṃ ādāya [ādāya saddhivihārikassa piṭṭhito piṭṭhito (ka.)] gantvā jantāgharapīṭhaṃ datvā cīvaraṃ paṭiggahetvā ekamantaṃ nikkhipitabbaṃ, cuṇṇaṃ dātabbaṃ, mattikā dātabbā. Sace ussahati jantāgharaṃ pavisitabbaṃ. Jantāgharaṃ pavisantena mattikāya mukhaṃ makkhetvā purato ca pacchato ca paṭicchādetvā jantāgharaṃ pavisitabbaṃ. Na there bhikkhū anupakhajja nisīditabbaṃ, na navā bhikkhū āsanena paṭibāhitabbā. Jantāghare saddhivihārikassa parikammaṃ kātabbaṃ. Jantāgharā nikkhamantena jantāgharapīṭhaṃ ādāya purato ca pacchato ca paṭicchādetvā jantāgharā nikkhamitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Udakepi ",
      " saddhivihārikassa parikammaṃ kātabbaṃ. Nahātena paṭhamataraṃ uttaritvā attano gattaṃ vodakaṃ katvā nivāsetvā saddhivihārikassa gattato udakaṃ pamajjitabbaṃ, nivāsanaṃ dātabbaṃ, saṅghāṭi dātabbā, jantāgharapīṭhaṃ ādāya paṭhamataraṃ āgantvā āsanaṃ paññapetabbaṃ, pādodakaṃ pādapīṭhaṃ pādakathalikaṃ upanikkhipitabbaṃ. Saddhivihāriko pānīyena pucchitabbo."
    ],
    "innerText": "‘‘Udakepi saddhivihārikassa parikammaṃ kātabbaṃ. Nahātena paṭhamataraṃ uttaritvā attano gattaṃ vodakaṃ katvā nivāsetvā saddhivihārikassa gattato udakaṃ pamajjitabbaṃ, nivāsanaṃ dātabbaṃ, saṅghāṭi dātabbā, jantāgharapīṭhaṃ ādāya paṭhamataraṃ āgantvā āsanaṃ paññapetabbaṃ, pādodakaṃ pādapīṭhaṃ pādakathalikaṃ upanikkhipitabbaṃ. Saddhivihāriko pānīyena pucchitabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yasmiṃ vihāre saddhivihāriko viharati, sace so vihāro uklāpo hoti, sace ussahati, sodhetabbo. Vihāraṃ sodhentena paṭhamaṃ pattacīvaraṃ nīharitvā ",
      " ekamantaṃ nikkhipitabbaṃ…pe… sace ācamanakumbhiyā udakaṃ na hoti, ācamanakumbhiyā udakaṃ āsiñcitabbaṃ."
    ],
    "innerText": "‘‘Yasmiṃ vihāre saddhivihāriko viharati, sace so vihāro uklāpo hoti, sace ussahati, sodhetabbo. Vihāraṃ sodhentena paṭhamaṃ pattacīvaraṃ nīharitvā ekamantaṃ nikkhipitabbaṃ…pe… sace ācamanakumbhiyā udakaṃ na hoti, ācamanakumbhiyā udakaṃ āsiñcitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace saddhivihārikassa anabhirati uppannā hoti, upajjhāyena vūpakāsetabbo, vūpakāsāpetabbo, dhammakathā vāssa kātabbā. Sace saddhivihārikassa kukkuccaṃ uppannaṃ hoti, upajjhāyena vinodetabbaṃ, vinodāpetabbaṃ, dhammakathā vāssa kātabbā. Sace saddhivihārikassa ",
      " diṭṭhigataṃ uppannaṃ hoti, upajjhāyena vivecetabbaṃ, vivecāpetabbaṃ, dhammakathā vāssa kātabbā. Sace saddhivihāriko garudhammaṃ ajjhāpanno hoti parivāsāraho, upajjhāyena ussukkaṃ kātabbaṃ – kinti nu kho saṅgho saddhivihārikassa parivāsaṃ dadeyyāti. Sace saddhivihāriko mūlāyapaṭikassanāraho hoti, upajjhāyena ussukkaṃ kātabbaṃ – kinti nu kho saṅgho saddhivihārikaṃ mūlāya paṭikasseyyāti. Sace saddhivihāriko mānattāraho hoti, upajjhāyena ussukkaṃ kātabbaṃ – kinti nu kho saṅgho ",
      " saddhivihārikassa mānattaṃ dadeyyāti. Sace saddhivihāriko abbhānāraho hoti, upajjhāyena ussukkaṃ kātabbaṃ – kinti nu kho saṅgho saddhivihārikaṃ abbheyyāti. Sace saṅgho saddhivihārikassa kammaṃ kattukāmo hoti, tajjanīyaṃ vā niyassaṃ vā pabbājanīyaṃ vā paṭisāraṇīyaṃ vā ukkhepanīyaṃ vā, upajjhāyena ussukkaṃ kātabbaṃ – kinti nu kho saṅgho saddhivihārikassa kammaṃ na kareyya, lahukāya vā pariṇāmeyyāti. Kataṃ vā panassa ",
      " hoti saṅghena kammaṃ, tajjanīyaṃ vā niyassaṃ vā pabbājanīyaṃ vā paṭisāraṇīyaṃ vā, ukkhepanīyaṃ vā, upajjhāyena ussukkaṃ kātabbaṃ – kinti nu kho saddhivihāriko sammā vatteyya lomaṃ pāteyya, netthāraṃ vatteyya, saṅgho taṃ kammaṃ paṭippassambheyyāti."
    ],
    "innerText": "‘‘Sace saddhivihārikassa anabhirati uppannā hoti, upajjhāyena vūpakāsetabbo, vūpakāsāpetabbo, dhammakathā vāssa kātabbā. Sace saddhivihārikassa kukkuccaṃ uppannaṃ hoti, upajjhāyena vinodetabbaṃ, vinodāpetabbaṃ, dhammakathā vāssa kātabbā. Sace saddhivihārikassa diṭṭhigataṃ uppannaṃ hoti, upajjhāyena vivecetabbaṃ, vivecāpetabbaṃ, dhammakathā vāssa kātabbā. Sace saddhivihāriko garudhammaṃ ajjhāpanno hoti parivāsāraho, upajjhāyena ussukkaṃ kātabbaṃ – kinti nu kho saṅgho saddhivihārikassa parivāsaṃ dadeyyāti. Sace saddhivihāriko mūlāyapaṭikassanāraho hoti, upajjhāyena ussukkaṃ kātabbaṃ – kinti nu kho saṅgho saddhivihārikaṃ mūlāya paṭikasseyyāti. Sace saddhivihāriko mānattāraho hoti, upajjhāyena ussukkaṃ kātabbaṃ – kinti nu kho saṅgho saddhivihārikassa mānattaṃ dadeyyāti. Sace saddhivihāriko abbhānāraho hoti, upajjhāyena ussukkaṃ kātabbaṃ – kinti nu kho saṅgho saddhivihārikaṃ abbheyyāti. Sace saṅgho saddhivihārikassa kammaṃ kattukāmo hoti, tajjanīyaṃ vā niyassaṃ vā pabbājanīyaṃ vā paṭisāraṇīyaṃ vā ukkhepanīyaṃ vā, upajjhāyena ussukkaṃ kātabbaṃ – kinti nu kho saṅgho saddhivihārikassa kammaṃ na kareyya, lahukāya vā pariṇāmeyyāti. Kataṃ vā panassa hoti saṅghena kammaṃ, tajjanīyaṃ vā niyassaṃ vā pabbājanīyaṃ vā paṭisāraṇīyaṃ vā, ukkhepanīyaṃ vā, upajjhāyena ussukkaṃ kātabbaṃ – kinti nu kho saddhivihāriko sammā vatteyya lomaṃ pāteyya, netthāraṃ vatteyya, saṅgho taṃ kammaṃ paṭippassambheyyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace saddhivihārikassa cīvaraṃ dhovitabbaṃ hoti, upajjhāyena ācikkhitabbaṃ – evaṃ dhoveyyāsīti, ussukkaṃ vā kātabbaṃ – kinti nu kho saddhivihārikassa cīvaraṃ dhoviyethāti. Sace ",
      " saddhivihārikassa cīvaraṃ kātabbaṃ hoti, upajjhāyena ācikkhitabbaṃ – evaṃ kareyyāsīti, ussukkaṃ vā kātabbaṃ – kinti nu kho saddhivihārikassa cīvaraṃ kariyethāti. Sace saddhivihārikassa rajanaṃ pacitabbaṃ hoti, upajjhāyena ācikkhitabbaṃ – evaṃ paceyyāsīti, ussukkaṃ vā kātabbaṃ – kinti nu kho saddhivihārikassa rajanaṃ paciyethāti. Sace saddhivihārikassa cīvaraṃ rajitabbaṃ hoti, upajjhāyena ācikkhitabbaṃ – evaṃ rajeyyāsīti, ussukkaṃ vā kātabbaṃ – kinti nu kho saddhivihārikassa cīvaraṃ rajiyethāti. Cīvaraṃ rajantena sādhukaṃ samparivattakaṃ samparivattakaṃ rajitabbaṃ, na ca acchinne theve pakkamitabbaṃ. Sace saddhivihāriko gilāno hoti, yāvajīvaṃ upaṭṭhātabbo, vuṭṭhānamassa āgametabbaṃ. Idaṃ kho, bhikkhave ",
      ", upajjhāyānaṃ saddhivihārikesu vattaṃ yathā upajjhāyehi saddhivihārikesu sammā vattitabba’’nti."
    ],
    "innerText": "‘‘Sace saddhivihārikassa cīvaraṃ dhovitabbaṃ hoti, upajjhāyena ācikkhitabbaṃ – evaṃ dhoveyyāsīti, ussukkaṃ vā kātabbaṃ – kinti nu kho saddhivihārikassa cīvaraṃ dhoviyethāti. Sace saddhivihārikassa cīvaraṃ kātabbaṃ hoti, upajjhāyena ācikkhitabbaṃ – evaṃ kareyyāsīti, ussukkaṃ vā kātabbaṃ – kinti nu kho saddhivihārikassa cīvaraṃ kariyethāti. Sace saddhivihārikassa rajanaṃ pacitabbaṃ hoti, upajjhāyena ācikkhitabbaṃ – evaṃ paceyyāsīti, ussukkaṃ vā kātabbaṃ – kinti nu kho saddhivihārikassa rajanaṃ paciyethāti. Sace saddhivihārikassa cīvaraṃ rajitabbaṃ hoti, upajjhāyena ācikkhitabbaṃ – evaṃ rajeyyāsīti, ussukkaṃ vā kātabbaṃ – kinti nu kho saddhivihārikassa cīvaraṃ rajiyethāti. Cīvaraṃ rajantena sādhukaṃ samparivattakaṃ samparivattakaṃ rajitabbaṃ, na ca acchinne theve pakkamitabbaṃ. Sace saddhivihāriko gilāno hoti, yāvajīvaṃ upaṭṭhātabbo, vuṭṭhānamassa āgametabbaṃ. Idaṃ kho, bhikkhave , upajjhāyānaṃ saddhivihārikesu vattaṃ yathā upajjhāyehi saddhivihārikesu sammā vattitabba’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dutiyabhāṇavāro niṭṭhito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "13. Ācariyavattakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "379"
      },
      ". Tena ",
      " kho pana samayena antevāsikā ācariyesu na sammā vattanti. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma antevāsikā ācariyesu na sammā vattissantī’’ti! Atha ",
      " kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… ‘‘saccaṃ kira, bhikkhave, antevāsikā ācariyesu na sammā vattantī’’ti? ‘‘Saccaṃ bhagavā’’ti…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi –"
    ],
    "innerText": "379. Tena kho pana samayena antevāsikā ācariyesu na sammā vattanti. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma antevāsikā ācariyesu na sammā vattissantī’’ti! Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ…pe… ‘‘saccaṃ kira, bhikkhave, antevāsikā ācariyesu na sammā vattantī’’ti? ‘‘Saccaṃ bhagavā’’ti…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "380"
      },
      ". ‘‘Tena hi, bhikkhave, antevāsikānaṃ ācariyesu vattaṃ paññapessāmi yathā antevāsikehi ācariyesu sammā vattitabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mahāva. 78]"
      },
      " Antevāsikena, bhikkhave, ācariyamhi sammā vattitabbaṃ. Tatrāyaṃ sammāvattanā –"
    ],
    "innerText": "380. ‘‘Tena hi, bhikkhave, antevāsikānaṃ ācariyesu vattaṃ paññapessāmi yathā antevāsikehi ācariyesu sammā vattitabbaṃ. [mahāva. 78] Antevāsikena, bhikkhave, ācariyamhi sammā vattitabbaṃ. Tatrāyaṃ sammāvattanā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kālasseva uṭṭhāya upāhanā omuñcitvā ekaṃsaṃ uttarāsaṅgaṃ karitvā dantakaṭṭhaṃ dātabbaṃ, mukhodakaṃ dātabbaṃ, āsanaṃ paññapetabbaṃ. Sace yāgu hoti, bhājanaṃ dhovitvā yāgu upanāmetabbā. Yāguṃ pītassa udakaṃ datvā bhājanaṃ paṭiggahetvā nīcaṃ katvā sādhukaṃ appaṭighaṃsantena ",
      " dhovitvā paṭisāmetabbaṃ. Ācariyamhi vuṭṭhite āsanaṃ uddharitabbaṃ. Sace so deso uklāpo hoti, so deso sammajjitabbo."
    ],
    "innerText": "‘‘Kālasseva uṭṭhāya upāhanā omuñcitvā ekaṃsaṃ uttarāsaṅgaṃ karitvā dantakaṭṭhaṃ dātabbaṃ, mukhodakaṃ dātabbaṃ, āsanaṃ paññapetabbaṃ. Sace yāgu hoti, bhājanaṃ dhovitvā yāgu upanāmetabbā. Yāguṃ pītassa udakaṃ datvā bhājanaṃ paṭiggahetvā nīcaṃ katvā sādhukaṃ appaṭighaṃsantena dhovitvā paṭisāmetabbaṃ. Ācariyamhi vuṭṭhite āsanaṃ uddharitabbaṃ. Sace so deso uklāpo hoti, so deso sammajjitabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace ācariyo gāmaṃ pavisitukāmo hoti, nivāsanaṃ dātabbaṃ, paṭinivāsanaṃ paṭiggahetabbaṃ, kāyabandhanaṃ dātabbaṃ, saguṇaṃ katvā saṅghāṭiyo dātabbā, dhovitvā patto ",
      " sodako dātabbo. Sace ācariyo pacchāsamaṇaṃ ākaṅkhati, timaṇḍalaṃ paṭicchādentena parimaṇḍalaṃ nivāsetvā kāyabandhanaṃ bandhitvā saguṇaṃ katvā saṅghāṭiyo pārupitvā gaṇṭhikaṃ paṭimuñcitvā dhovitvā pattaṃ gahetvā ācariyassa pacchāsamaṇena hotabbaṃ. Nātidūre gantabbaṃ, nāccāsanne gantabbaṃ, pattapariyāpannaṃ paṭiggahetabbaṃ. Na ācariyassa bhaṇamānassa antarantarā kathā opātetabbā. Ācariyo āpattisāmantā bhaṇamāno nivāretabbo."
    ],
    "innerText": "‘‘Sace ācariyo gāmaṃ pavisitukāmo hoti, nivāsanaṃ dātabbaṃ, paṭinivāsanaṃ paṭiggahetabbaṃ, kāyabandhanaṃ dātabbaṃ, saguṇaṃ katvā saṅghāṭiyo dātabbā, dhovitvā patto sodako dātabbo. Sace ācariyo pacchāsamaṇaṃ ākaṅkhati, timaṇḍalaṃ paṭicchādentena parimaṇḍalaṃ nivāsetvā kāyabandhanaṃ bandhitvā saguṇaṃ katvā saṅghāṭiyo pārupitvā gaṇṭhikaṃ paṭimuñcitvā dhovitvā pattaṃ gahetvā ācariyassa pacchāsamaṇena hotabbaṃ. Nātidūre gantabbaṃ, nāccāsanne gantabbaṃ, pattapariyāpannaṃ paṭiggahetabbaṃ. Na ācariyassa bhaṇamānassa antarantarā kathā opātetabbā. Ācariyo āpattisāmantā bhaṇamāno nivāretabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Nivattantena paṭhamataraṃ āgantvā āsanaṃ paññapetabbaṃ, pādodakaṃ pādapīṭhaṃ pādakathalikaṃ upanikkhipitabbaṃ, paccuggantvā pattacīvaraṃ paṭiggahetabbaṃ, paṭinivāsanaṃ dātabbaṃ, nivāsanaṃ paṭiggahetabbaṃ. Sace cīvaraṃ sinnaṃ hoti, muhuttaṃ uṇhe otāpetabbaṃ, na ca uṇhe cīvaraṃ nidahitabbaṃ. Cīvaraṃ saṅgharitabbaṃ. Cīvaraṃ saṅgharantena caturaṅgulaṃ kaṇṇaṃ ussāretvā cīvaraṃ saṅgharitabbaṃ – mā majjhe bhaṅgo ahosīti. Obhoge kāyabandhanaṃ kātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace piṇḍapāto hoti, ācariyo ca bhuñjitukāmo hoti, udakaṃ datvā piṇḍapāto upanāmetabbo. Ācariyo pānīyena pucchitabbo ",
      ". Bhuttāvissa udakaṃ datvā pattaṃ paṭiggahetvā nīcaṃ katvā sādhukaṃ appaṭighaṃsantena dhovitvā vodakaṃ katvā muhuttaṃ uṇhe otāpetabbo, na ca uṇhe patto nidahitabbo. Pattacīvaraṃ nikkhipitabbaṃ. Pattaṃ nikkhipantena ekena hatthena pattaṃ gahetvā ekena hatthena heṭṭhāmañcaṃ ",
      " vā heṭṭhāpīṭhaṃ vā parāmasitvā patto nikkhipitabbo. Na ca anantarahitāya bhūmiyā patto nikkhipitabbo. Cīvaraṃ nikkhipantena ekena hatthena cīvaraṃ gahetvā ekena hatthena cīvaravaṃsaṃ vā cīvararajjuṃ vā pamajitvā pārato antaṃ orato bhogaṃ katvā cīvaraṃ nikkhipitabbaṃ. Ācariyamhi vuṭṭhite āsanaṃ uddharitabbaṃ, pādodakaṃ pādapīṭhaṃ pādakathalikaṃ paṭisāmetabbaṃ. Sace so deso uklāpo hoti, so deso sammajjitabbo."
    ],
    "innerText": "‘‘Sace piṇḍapāto hoti, ācariyo ca bhuñjitukāmo hoti, udakaṃ datvā piṇḍapāto upanāmetabbo. Ācariyo pānīyena pucchitabbo . Bhuttāvissa udakaṃ datvā pattaṃ paṭiggahetvā nīcaṃ katvā sādhukaṃ appaṭighaṃsantena dhovitvā vodakaṃ katvā muhuttaṃ uṇhe otāpetabbo, na ca uṇhe patto nidahitabbo. Pattacīvaraṃ nikkhipitabbaṃ. Pattaṃ nikkhipantena ekena hatthena pattaṃ gahetvā ekena hatthena heṭṭhāmañcaṃ vā heṭṭhāpīṭhaṃ vā parāmasitvā patto nikkhipitabbo. Na ca anantarahitāya bhūmiyā patto nikkhipitabbo. Cīvaraṃ nikkhipantena ekena hatthena cīvaraṃ gahetvā ekena hatthena cīvaravaṃsaṃ vā cīvararajjuṃ vā pamajitvā pārato antaṃ orato bhogaṃ katvā cīvaraṃ nikkhipitabbaṃ. Ācariyamhi vuṭṭhite āsanaṃ uddharitabbaṃ, pādodakaṃ pādapīṭhaṃ pādakathalikaṃ paṭisāmetabbaṃ. Sace so deso uklāpo hoti, so deso sammajjitabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sace ācariyo nahāyitukāmo hoti, nahānaṃ paṭiyādetabbaṃ. Sace sītena attho hoti, sītaṃ paṭiyādetabbaṃ. Sace uṇhena attho hoti, uṇhaṃ paṭiyādetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace ",
      " ācariyo jantāgharaṃ pavisitukāmo hoti, cuṇṇaṃ sannetabbaṃ, mattikā temetabbā, jantāgharapīṭhaṃ ādāya ācariyassa piṭṭhito piṭṭhito gantvā jantāgharapīṭhaṃ datvā cīvaraṃ paṭiggahetvā ekamantaṃ nikkhipitabbaṃ, cuṇṇaṃ dātabbaṃ, mattikā dātabbā. Sace ussahati, jantāgharaṃ pavisitabbaṃ. Jantāgharaṃ pavisantena mattikāya mukhaṃ makkhetvā purato ca pacchato ca paṭicchādetvā jantāgharaṃ pavisitabbaṃ. Na there bhikkhū anupakhajja nisīditabbaṃ. Na navā bhikkhū āsanena paṭibāhitabbā. Jantāghare ācariyassa parikammaṃ kātabbaṃ. Jantāgharā nikkhamantena jantāgharapīṭhaṃ ādāya purato ca pacchato ca paṭicchādetvā jantāgharā nikkhamitabbaṃ."
    ],
    "innerText": "‘‘Sace ācariyo jantāgharaṃ pavisitukāmo hoti, cuṇṇaṃ sannetabbaṃ, mattikā temetabbā, jantāgharapīṭhaṃ ādāya ācariyassa piṭṭhito piṭṭhito gantvā jantāgharapīṭhaṃ datvā cīvaraṃ paṭiggahetvā ekamantaṃ nikkhipitabbaṃ, cuṇṇaṃ dātabbaṃ, mattikā dātabbā. Sace ussahati, jantāgharaṃ pavisitabbaṃ. Jantāgharaṃ pavisantena mattikāya mukhaṃ makkhetvā purato ca pacchato ca paṭicchādetvā jantāgharaṃ pavisitabbaṃ. Na there bhikkhū anupakhajja nisīditabbaṃ. Na navā bhikkhū āsanena paṭibāhitabbā. Jantāghare ācariyassa parikammaṃ kātabbaṃ. Jantāgharā nikkhamantena jantāgharapīṭhaṃ ādāya purato ca pacchato ca paṭicchādetvā jantāgharā nikkhamitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Udakepi ācariyassa parikammaṃ kātabbaṃ. Nahātena paṭhamataraṃ uttaritvā attano ",
      " gattaṃ vodakaṃ katvā nivāsetvā ācariyassa gattato udakaṃ pamajjitabbaṃ, nivāsanaṃ dātabbaṃ, saṅghāṭi dātabbā, jantāgharapīṭhaṃ ādāya paṭhamataraṃ āgantvā āsanaṃ paññapetabbaṃ, pādodakaṃ pādapīṭhaṃ pādakathalikaṃ upanikkhipitabbaṃ. Ācariyo pānīyena pucchitabbo. Sace uddisāpetukāmo hoti, uddisitabbo. Sace paripucchitukāmo hoti, paripucchitabbo."
    ],
    "innerText": "‘‘Udakepi ācariyassa parikammaṃ kātabbaṃ. Nahātena paṭhamataraṃ uttaritvā attano gattaṃ vodakaṃ katvā nivāsetvā ācariyassa gattato udakaṃ pamajjitabbaṃ, nivāsanaṃ dātabbaṃ, saṅghāṭi dātabbā, jantāgharapīṭhaṃ ādāya paṭhamataraṃ āgantvā āsanaṃ paññapetabbaṃ, pādodakaṃ pādapīṭhaṃ pādakathalikaṃ upanikkhipitabbaṃ. Ācariyo pānīyena pucchitabbo. Sace uddisāpetukāmo hoti, uddisitabbo. Sace paripucchitukāmo hoti, paripucchitabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Yasmiṃ ",
      " vihāre ācariyo viharati, sace so vihāro uklāpo hoti, sace ussahati, sodhetabbo. Vihāraṃ sodhentena paṭhamaṃ pattacīvaraṃ nīharitvā ekamantaṃ nikkhipitabbaṃ; nisīdanapaccattharaṇaṃ nīharitvā ekamantaṃ nikkhipitabbaṃ; bhisibibbohanaṃ nīharitvā ekamantaṃ nikkhipitabbaṃ; mañco nīcaṃ katvā sādhukaṃ appaṭighaṃsantena asaṅghaṭṭentena kavāṭapiṭṭhaṃ, nīharitvā ekamantaṃ nikkhipitabbo; pīṭhaṃ nīcaṃ katvā sādhukaṃ appaṭighaṃsantena, asaṅghaṭṭentena kavāṭapiṭṭhaṃ, nīharitvā ekamantaṃ nikkhipitabbaṃ; mañcapaṭipādakā nīharitvā ekamantaṃ nikkhipitabbā; kheḷamallako nīharitvā ekamantaṃ nikkhipitabbo; apassenaphalakaṃ nīharitvā ekamantaṃ nikkhipitabbaṃ; bhūmattharaṇaṃ yathāpaññattaṃ sallakkhetvā nīharitvā ekamantaṃ nikkhipitabbaṃ. Sace vihāre santānakaṃ hoti, ullokā paṭhamaṃ ohāretabbaṃ, ālokasandhikaṇṇabhāgā pamajjitabbā. Sace gerukaparikammakatā bhitti kaṇṇakitā hoti, coḷakaṃ temetvā pīḷetvā pamajjitabbā. Sace kāḷavaṇṇakatā ",
      " bhūmi kaṇṇakitā hoti, coḷakaṃ temetvā pīḷetvā pamajjitabbā. Sace akatā hoti bhūmi, udakena paripphositvā pariphositvā sammajjitabbā – mā vihāro rajena uhaññīti. Saṅkāraṃ vicinitvā ekamantaṃ chaḍḍetabbaṃ."
    ],
    "innerText": "‘‘Yasmiṃ vihāre ācariyo viharati, sace so vihāro uklāpo hoti, sace ussahati, sodhetabbo. Vihāraṃ sodhentena paṭhamaṃ pattacīvaraṃ nīharitvā ekamantaṃ nikkhipitabbaṃ; nisīdanapaccattharaṇaṃ nīharitvā ekamantaṃ nikkhipitabbaṃ; bhisibibbohanaṃ nīharitvā ekamantaṃ nikkhipitabbaṃ; mañco nīcaṃ katvā sādhukaṃ appaṭighaṃsantena asaṅghaṭṭentena kavāṭapiṭṭhaṃ, nīharitvā ekamantaṃ nikkhipitabbo; pīṭhaṃ nīcaṃ katvā sādhukaṃ appaṭighaṃsantena, asaṅghaṭṭentena kavāṭapiṭṭhaṃ, nīharitvā ekamantaṃ nikkhipitabbaṃ; mañcapaṭipādakā nīharitvā ekamantaṃ nikkhipitabbā; kheḷamallako nīharitvā ekamantaṃ nikkhipitabbo; apassenaphalakaṃ nīharitvā ekamantaṃ nikkhipitabbaṃ; bhūmattharaṇaṃ yathāpaññattaṃ sallakkhetvā nīharitvā ekamantaṃ nikkhipitabbaṃ. Sace vihāre santānakaṃ hoti, ullokā paṭhamaṃ ohāretabbaṃ, ālokasandhikaṇṇabhāgā pamajjitabbā. Sace gerukaparikammakatā bhitti kaṇṇakitā hoti, coḷakaṃ temetvā pīḷetvā pamajjitabbā. Sace kāḷavaṇṇakatā bhūmi kaṇṇakitā hoti, coḷakaṃ temetvā pīḷetvā pamajjitabbā. Sace akatā hoti bhūmi, udakena paripphositvā pariphositvā sammajjitabbā – mā vihāro rajena uhaññīti. Saṅkāraṃ vicinitvā ekamantaṃ chaḍḍetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Bhūmattharaṇaṃ ",
      " otāpetvā sodhetvā papphoṭetvā atiharitvā yathāpaññattaṃ paññapetabbaṃ. Mañcapaṭipādakā otāpetvā pamajjitvā atiharitvā yathāṭhāne ṭhapetabbā. Mañco otāpetvā sodhetvā papphoṭetvā nīcaṃ katvā sādhukaṃ appaṭighaṃsantena, asaṅghaṭṭentena kavāṭapiṭṭhaṃ, atiharitvā yathāpaññattaṃ paññapetabbo. Pīṭhaṃ otāpetvā sodhetvā papphoṭetvā nīcaṃ katvā sādhukaṃ appaṭighaṃsantena, asaṅghaṭṭentena kavāṭapiṭṭhaṃ, atiharitvā yathāpaññattaṃ paññapetabbaṃ. Bhisibibbohanaṃ otāpetvā sodhetvā papphoṭetvā atiharitvā yathāpaññattaṃ paññapetabbaṃ. Nisīdanapaccattharaṇaṃ otāpetvā sodhetvā papphoṭetvā atiharitvā yathāpaññattaṃ paññapetabbaṃ. Kheḷamallako otāpetvā pamajjitvā atiharitvā yathāṭhāne ṭhapetabbo. Apassenaphalakaṃ otāpetvā pamajjitvā atiharitvā yathāṭhāne ṭhapetabbaṃ. Pattacīvaraṃ nikkhipitabbaṃ. Pattaṃ nikkhipantena ekena hatthena pattaṃ gahetvā ekena hatthena heṭṭhāmañcaṃ vā heṭṭhāpīṭhaṃ vā parāmasitvā patto nikkhipitabbo. Na ca anantarahitāya bhūmiyā ",
      " patto nikkhipitabbo. Cīvaraṃ nikkhipantena ekena hatthena cīvaraṃ gahetvā ekena hatthena cīvaravaṃsaṃ vā cīvararajjuṃ ",
      " vā pamajjitvā pārato antaṃ orato bhogaṃ katvā cīvaraṃ nikkhipitabbaṃ."
    ],
    "innerText": "‘‘Bhūmattharaṇaṃ otāpetvā sodhetvā papphoṭetvā atiharitvā yathāpaññattaṃ paññapetabbaṃ. Mañcapaṭipādakā otāpetvā pamajjitvā atiharitvā yathāṭhāne ṭhapetabbā. Mañco otāpetvā sodhetvā papphoṭetvā nīcaṃ katvā sādhukaṃ appaṭighaṃsantena, asaṅghaṭṭentena kavāṭapiṭṭhaṃ, atiharitvā yathāpaññattaṃ paññapetabbo. Pīṭhaṃ otāpetvā sodhetvā papphoṭetvā nīcaṃ katvā sādhukaṃ appaṭighaṃsantena, asaṅghaṭṭentena kavāṭapiṭṭhaṃ, atiharitvā yathāpaññattaṃ paññapetabbaṃ. Bhisibibbohanaṃ otāpetvā sodhetvā papphoṭetvā atiharitvā yathāpaññattaṃ paññapetabbaṃ. Nisīdanapaccattharaṇaṃ otāpetvā sodhetvā papphoṭetvā atiharitvā yathāpaññattaṃ paññapetabbaṃ. Kheḷamallako otāpetvā pamajjitvā atiharitvā yathāṭhāne ṭhapetabbo. Apassenaphalakaṃ otāpetvā pamajjitvā atiharitvā yathāṭhāne ṭhapetabbaṃ. Pattacīvaraṃ nikkhipitabbaṃ. Pattaṃ nikkhipantena ekena hatthena pattaṃ gahetvā ekena hatthena heṭṭhāmañcaṃ vā heṭṭhāpīṭhaṃ vā parāmasitvā patto nikkhipitabbo. Na ca anantarahitāya bhūmiyā patto nikkhipitabbo. Cīvaraṃ nikkhipantena ekena hatthena cīvaraṃ gahetvā ekena hatthena cīvaravaṃsaṃ vā cīvararajjuṃ vā pamajjitvā pārato antaṃ orato bhogaṃ katvā cīvaraṃ nikkhipitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sace puratthimā sarajā vātā vāyanti, puratthimā vātapānā thaketabbā. Sace pacchimā sarajā vātā vāyanti, pacchimā vātapānā thaketabbā. Sace uttarā sarajā vātā vāyanti, uttarā vātapānā thaketabbā. Sace dakkhiṇā sarajā vātā vāyanti, dakkhiṇā vātapānā thaketabbā. Sace sītakālo hoti, divā vātapānā vivaritabbā, rattiṃ thaketabbā. Sace uṇhakālo hoti, divā vātapānā thaketabbā, rattiṃ vivaritabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sace pariveṇaṃ uklāpaṃ hoti, pariveṇaṃ sammajjitabbaṃ. Sace koṭṭhako uklāpo hoti, koṭṭhako sammajjitabbo. Sace upaṭṭhānasālā uklāpā hoti, upaṭṭhānasālā sammajjitabbā. Sace aggisālā uklāpā hoti, aggisālā sammajjitabbā. Sace vaccakuṭi uklāpā hoti, vaccakuṭi sammajjitabbā. Sace pānīyaṃ na hoti, pānīyaṃ upaṭṭhāpetabbaṃ. Sace paribhojanīyaṃ na hoti, paribhojanīyaṃ upaṭṭhāpetabbaṃ. Sace ācamanakumbhiyā udakaṃ na hoti, ācamanakumbhiyā udakaṃ āsiñcitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace ācariyassa anabhirati uppannā hoti, antevāsikena vūpakāsetabbā, vūpakāsāpetabbā, dhammakathā vāssa kātabbā. Sace ācariyassa kukkuccaṃ uppannaṃ hoti, antevāsikena vinodetabbaṃ, vinodāpetabbaṃ, dhammakathā vāssa kātabbā. Sace ācariyassa diṭṭhigataṃ ",
      " uppannaṃ hoti ",
      ", antevāsikena vivecetabbaṃ, vivecāpetabbaṃ, dhammakathā vāssa kātabbā. Sace ācariyo garudhammaṃ ajjhāpanno hoti, parivāsāraho, antevāsikena ussukkaṃ kātabbaṃ – kinti nu kho saṅgho ācariyassa parivāsaṃ dadeyyāti. Sace ācariyo mūlāyapaṭikassanāraho hoti, antevāsikena ussukkaṃ kātabbaṃ – kinti nu kho saṅgho ācariyaṃ mūlāya paṭikasseyyāti. Sace ācariyo mānattāraho hoti, antevāsikena ussukkaṃ kātabbaṃ – kinti nu kho saṅgho ācariyassa mānattaṃ dadeyyāti. Sace ācariyo abbhānāraho hoti, antevāsikena ussukkaṃ kātabbaṃ – kinti nu kho saṅgho ācariyaṃ abbheyyāti. Sace saṅgho ācariyassa ",
      " kammaṃ kattukāmo hoti, tajjanīyaṃ vā niyassaṃ vā pabbājanīyaṃ vā paṭisāraṇīyaṃ vā ukkhepanīyaṃ vā, antevāsikena ussukkaṃ kātabbaṃ – kinti nu kho saṅgho ācariyassa kammaṃ na kareyya, lahukāya vā pariṇāmeyyāti. Kataṃ vā panassa hoti saṅghena kammaṃ, tajjanīyaṃ vā niyassaṃ vā pabbājanīyaṃ vā paṭisāraṇīyaṃ vā ukkhepanīyaṃ vā, antevāsikena ussukkaṃ kātabbaṃ – kinti nu kho ācariyo sammā vatteyya, lomaṃ pāteyya, netthāraṃ vatteyya, saṅgho taṃ kammaṃ paṭippassambheyyāti."
    ],
    "innerText": "‘‘Sace ācariyassa anabhirati uppannā hoti, antevāsikena vūpakāsetabbā, vūpakāsāpetabbā, dhammakathā vāssa kātabbā. Sace ācariyassa kukkuccaṃ uppannaṃ hoti, antevāsikena vinodetabbaṃ, vinodāpetabbaṃ, dhammakathā vāssa kātabbā. Sace ācariyassa diṭṭhigataṃ uppannaṃ hoti , antevāsikena vivecetabbaṃ, vivecāpetabbaṃ, dhammakathā vāssa kātabbā. Sace ācariyo garudhammaṃ ajjhāpanno hoti, parivāsāraho, antevāsikena ussukkaṃ kātabbaṃ – kinti nu kho saṅgho ācariyassa parivāsaṃ dadeyyāti. Sace ācariyo mūlāyapaṭikassanāraho hoti, antevāsikena ussukkaṃ kātabbaṃ – kinti nu kho saṅgho ācariyaṃ mūlāya paṭikasseyyāti. Sace ācariyo mānattāraho hoti, antevāsikena ussukkaṃ kātabbaṃ – kinti nu kho saṅgho ācariyassa mānattaṃ dadeyyāti. Sace ācariyo abbhānāraho hoti, antevāsikena ussukkaṃ kātabbaṃ – kinti nu kho saṅgho ācariyaṃ abbheyyāti. Sace saṅgho ācariyassa kammaṃ kattukāmo hoti, tajjanīyaṃ vā niyassaṃ vā pabbājanīyaṃ vā paṭisāraṇīyaṃ vā ukkhepanīyaṃ vā, antevāsikena ussukkaṃ kātabbaṃ – kinti nu kho saṅgho ācariyassa kammaṃ na kareyya, lahukāya vā pariṇāmeyyāti. Kataṃ vā panassa hoti saṅghena kammaṃ, tajjanīyaṃ vā niyassaṃ vā pabbājanīyaṃ vā paṭisāraṇīyaṃ vā ukkhepanīyaṃ vā, antevāsikena ussukkaṃ kātabbaṃ – kinti nu kho ācariyo sammā vatteyya, lomaṃ pāteyya, netthāraṃ vatteyya, saṅgho taṃ kammaṃ paṭippassambheyyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace ācariyassa cīvaraṃ dhovitabbaṃ hoti, antevāsikena dhovitabbaṃ, ussukkaṃ vā kātabbaṃ – kinti nu kho ācariyassa cīvaraṃ dhoviyethāti. Sace ācariyassa cīvaraṃ kātabbaṃ hoti, antevāsikena kātabbaṃ, ussukkaṃ ",
      " vā kātabbaṃ – kinti nu kho ācariyassa cīvaraṃ kariyethāti. Sace ācariyassa rajanaṃ pacitabbaṃ hoti, antevāsikena pacitabbaṃ, ussukkaṃ vā kātabbaṃ – kinti nu kho ācariyassa rajanaṃ paciyethāti. Sace ācariyassa cīvaraṃ rajitabbaṃ hoti, antevāsikena rajitabbaṃ, ussukkaṃ vā kātabbaṃ – kinti nu kho ācariyassa cīvaraṃ rajiyethāti. Cīvaraṃ rajantena sādhukaṃ samparivattakaṃ samparivattakaṃ rajitabbaṃ, na ca acchinne theve pakkamitabbaṃ."
    ],
    "innerText": "‘‘Sace ācariyassa cīvaraṃ dhovitabbaṃ hoti, antevāsikena dhovitabbaṃ, ussukkaṃ vā kātabbaṃ – kinti nu kho ācariyassa cīvaraṃ dhoviyethāti. Sace ācariyassa cīvaraṃ kātabbaṃ hoti, antevāsikena kātabbaṃ, ussukkaṃ vā kātabbaṃ – kinti nu kho ācariyassa cīvaraṃ kariyethāti. Sace ācariyassa rajanaṃ pacitabbaṃ hoti, antevāsikena pacitabbaṃ, ussukkaṃ vā kātabbaṃ – kinti nu kho ācariyassa rajanaṃ paciyethāti. Sace ācariyassa cīvaraṃ rajitabbaṃ hoti, antevāsikena rajitabbaṃ, ussukkaṃ vā kātabbaṃ – kinti nu kho ācariyassa cīvaraṃ rajiyethāti. Cīvaraṃ rajantena sādhukaṃ samparivattakaṃ samparivattakaṃ rajitabbaṃ, na ca acchinne theve pakkamitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Na ācariyaṃ anāpucchā ekaccassa patto dātabbo, na ekaccassa patto paṭiggahetabbo; na ekaccassa cīvaraṃ dātabbaṃ, na ekaccassa cīvaraṃ paṭiggahetabbaṃ; na ekaccassa parikkhāro dātabbo, na ekaccassa parikkhāro paṭiggahetabbo; na ekaccassa kesā cheditabbā, na ekaccena kesā chedāpetabbā; na ekaccassa parikammaṃ kātabbaṃ, na ekaccena parikammaṃ kārāpetabbaṃ; na ekaccassa veyyāvacco kātabbo, na ekaccena veyyāvacco kārāpetabbo; na ekaccassa pacchāsamaṇena hotabbaṃ, na ekacco pacchāsamaṇo ādātabbo; na ekaccassa piṇḍapāto nīharitabbo, na ekaccena piṇḍapāto nīharāpetabbo; na ",
      " ācariyaṃ anāpucchā gāmo pavisitabbo; na susānaṃ gantabbaṃ; na disā pakkamitabbā. Sace ācariyo gilāno hoti, yāvajīvaṃ upaṭṭhātabbo ",
      ", vuṭṭhānamassa āgametabbaṃ. Idaṃ kho, bhikkhave, antevāsikānaṃ ācariyesu vattaṃ yathā ",
      " antevāsikehi ācariyesu sammā vattitabba’’nti."
    ],
    "innerText": "‘‘Na ācariyaṃ anāpucchā ekaccassa patto dātabbo, na ekaccassa patto paṭiggahetabbo; na ekaccassa cīvaraṃ dātabbaṃ, na ekaccassa cīvaraṃ paṭiggahetabbaṃ; na ekaccassa parikkhāro dātabbo, na ekaccassa parikkhāro paṭiggahetabbo; na ekaccassa kesā cheditabbā, na ekaccena kesā chedāpetabbā; na ekaccassa parikammaṃ kātabbaṃ, na ekaccena parikammaṃ kārāpetabbaṃ; na ekaccassa veyyāvacco kātabbo, na ekaccena veyyāvacco kārāpetabbo; na ekaccassa pacchāsamaṇena hotabbaṃ, na ekacco pacchāsamaṇo ādātabbo; na ekaccassa piṇḍapāto nīharitabbo, na ekaccena piṇḍapāto nīharāpetabbo; na ācariyaṃ anāpucchā gāmo pavisitabbo; na susānaṃ gantabbaṃ; na disā pakkamitabbā. Sace ācariyo gilāno hoti, yāvajīvaṃ upaṭṭhātabbo , vuṭṭhānamassa āgametabbaṃ. Idaṃ kho, bhikkhave, antevāsikānaṃ ācariyesu vattaṃ yathā antevāsikehi ācariyesu sammā vattitabba’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "14. Antevāsikavattakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "381"
      },
      ". Tena kho pana samayena ācariyā antevāsikesu na sammā vattanti. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma ācariyā antevāsikesu na sammā vattissantī’’ti! Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe bhikkhusaṅghaṃ sannipātāpetvā bhikkhū paṭipucchi – ‘‘saccaṃ kira, bhikkhave, ācariyā antevāsikesu na sammā vattantī’’ti? ‘‘Saccaṃ bhagavā’’ti…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi –"
    ],
    "innerText": "381. Tena kho pana samayena ācariyā antevāsikesu na sammā vattanti. Ye te bhikkhū appicchā…pe… te ujjhāyanti khiyyanti vipācenti – ‘‘kathañhi nāma ācariyā antevāsikesu na sammā vattissantī’’ti! Atha kho te bhikkhū bhagavato etamatthaṃ ārocesuṃ. Atha kho bhagavā etasmiṃ nidāne etasmiṃ pakaraṇe bhikkhusaṅghaṃ sannipātāpetvā bhikkhū paṭipucchi – ‘‘saccaṃ kira, bhikkhave, ācariyā antevāsikesu na sammā vattantī’’ti? ‘‘Saccaṃ bhagavā’’ti…pe… vigarahitvā…pe… dhammiṃ kathaṃ katvā bhikkhū āmantesi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "382"
      },
      ". ‘‘Tena hi, bhikkhave, ācariyānaṃ antevāsikesu vattaṃ paññapessāmi yathā ācariyehi antevāsikesu sammā vattitabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mahāva. 79]"
      },
      " Ācariyena, bhikkhave, antevāsikamhi sammā vattitabbaṃ. Tatrāyaṃ sammāvattanā –"
    ],
    "innerText": "382. ‘‘Tena hi, bhikkhave, ācariyānaṃ antevāsikesu vattaṃ paññapessāmi yathā ācariyehi antevāsikesu sammā vattitabbaṃ. [mahāva. 79] Ācariyena, bhikkhave, antevāsikamhi sammā vattitabbaṃ. Tatrāyaṃ sammāvattanā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Ācariyena, bhikkhave, antevāsiko saṅgahetabbo anuggahetabbo uddesena paripucchāya ovādena anusāsaniyā. Sace ācariyassa patto hoti, antevāsikassa patto na hoti, ācariyena antevāsikassa patto dātabbo, ussukkaṃ vā kātabbaṃ – kinti nu kho antevāsikassa patto uppajjiyethāti. Sace ācariyassa cīvaraṃ hoti, antevāsikassa cīvaraṃ na hoti, ācariyena antevāsikassa cīvaraṃ dātabbaṃ, ussukkaṃ vā kātabbaṃ – kinti nu kho antevāsikassa cīvaraṃ uppajjiyethāti. Sace ācariyassa parikkhāro hoti, antevāsikassa ",
      " parikkhāro na hoti, ācariyena antevāsikassa parikkhāro dātabbo, ussukkaṃ vā kātabbaṃ – kinti nu kho antevāsikassa parikkhāro uppajjiyethāti."
    ],
    "innerText": "‘‘Ācariyena, bhikkhave, antevāsiko saṅgahetabbo anuggahetabbo uddesena paripucchāya ovādena anusāsaniyā. Sace ācariyassa patto hoti, antevāsikassa patto na hoti, ācariyena antevāsikassa patto dātabbo, ussukkaṃ vā kātabbaṃ – kinti nu kho antevāsikassa patto uppajjiyethāti. Sace ācariyassa cīvaraṃ hoti, antevāsikassa cīvaraṃ na hoti, ācariyena antevāsikassa cīvaraṃ dātabbaṃ, ussukkaṃ vā kātabbaṃ – kinti nu kho antevāsikassa cīvaraṃ uppajjiyethāti. Sace ācariyassa parikkhāro hoti, antevāsikassa parikkhāro na hoti, ācariyena antevāsikassa parikkhāro dātabbo, ussukkaṃ vā kātabbaṃ – kinti nu kho antevāsikassa parikkhāro uppajjiyethāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace antevāsiko gilāno hoti, kālasseva uṭṭhāya dantakaṭṭhaṃ dātabbaṃ, mukhodakaṃ dātabbaṃ, āsanaṃ paññapetabbaṃ. Sace yāgu hoti ",
      ", bhājanaṃ dhovitvā yāgu upanāmetabbā. Yāguṃ pītassa udakaṃ datvā bhājanaṃ paṭiggahetvā nīcaṃ katvā sādhukaṃ appaṭighaṃsantena dhovitvā paṭisāmetabbaṃ ",
      ". Antevāsikamhi vuṭṭhite āsanaṃ uddharitabbaṃ. Sace so deso uklāpo hoti, so deso sammajjitabbo."
    ],
    "innerText": "‘‘Sace antevāsiko gilāno hoti, kālasseva uṭṭhāya dantakaṭṭhaṃ dātabbaṃ, mukhodakaṃ dātabbaṃ, āsanaṃ paññapetabbaṃ. Sace yāgu hoti , bhājanaṃ dhovitvā yāgu upanāmetabbā. Yāguṃ pītassa udakaṃ datvā bhājanaṃ paṭiggahetvā nīcaṃ katvā sādhukaṃ appaṭighaṃsantena dhovitvā paṭisāmetabbaṃ . Antevāsikamhi vuṭṭhite āsanaṃ uddharitabbaṃ. Sace so deso uklāpo hoti, so deso sammajjitabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sace antevāsiko gāmaṃ pavisitukāmo hoti, nivāsanaṃ dātabbaṃ, paṭinivāsanaṃ paṭiggahetabbaṃ, kāyabandhanaṃ dātabbaṃ, saguṇaṃ katvā saṅghāṭiyo dātabbā, dhovitvā patto sodako dātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Ettāvatā nivattissatīti āsanaṃ paññapetabbaṃ, pādodakaṃ pādapīṭhaṃ pādakathalikaṃ upanikkhipitabbaṃ, paccuggantvā pattacīvaraṃ paṭiggahetabbaṃ, paṭinivāsanaṃ dātabbaṃ, nivāsanaṃ paṭiggahetabbaṃ. Sace cīvaraṃ sinnaṃ hoti, muhuttaṃ uṇhe otāpetabbaṃ, na ca uṇhe cīvaraṃ nidahitabbaṃ. Cīvaraṃ saṅgharitabbaṃ. Cīvaraṃ saṅgharantena caturaṅgulaṃ kaṇṇaṃ ussāretvā cīvaraṃ saṅgharitabbaṃ – mā majjhe bhaṅgo ahosīti. Obhoge kāyabandhanaṃ kātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace piṇḍapāto hoti, antevāsiko ca bhuñjitukāmo hoti, udakaṃ datvā piṇḍapāto upanāmetabbo. Antevāsiko ",
      " pānīyena pucchitabbo. Bhuttāvissa udakaṃ datvā pattaṃ paṭiggahetvā nīcaṃ katvā sādhukaṃ appaṭighaṃsantena dhovitvā vodakaṃ katvā muhuttaṃ uṇhe otāpetabbo, na ca uṇhe patto nidahitabbo. Pattacīvaraṃ nikkhipitabbaṃ. Pattaṃ nikkhipantena…pe… cīvaraṃ nikkhipantena…pe… pārato antaṃ orato bhogaṃ katvā cīvaraṃ nikkhipitabbaṃ. Antevāsikamhi uṭṭhite āsanaṃ uddharitabbaṃ, pādodakaṃ pādapīṭhaṃ pādakathalikaṃ paṭisāmetabbaṃ. Sace so deso uklāpo hoti, so deso sammajjitabbo."
    ],
    "innerText": "‘‘Sace piṇḍapāto hoti, antevāsiko ca bhuñjitukāmo hoti, udakaṃ datvā piṇḍapāto upanāmetabbo. Antevāsiko pānīyena pucchitabbo. Bhuttāvissa udakaṃ datvā pattaṃ paṭiggahetvā nīcaṃ katvā sādhukaṃ appaṭighaṃsantena dhovitvā vodakaṃ katvā muhuttaṃ uṇhe otāpetabbo, na ca uṇhe patto nidahitabbo. Pattacīvaraṃ nikkhipitabbaṃ. Pattaṃ nikkhipantena…pe… cīvaraṃ nikkhipantena…pe… pārato antaṃ orato bhogaṃ katvā cīvaraṃ nikkhipitabbaṃ. Antevāsikamhi uṭṭhite āsanaṃ uddharitabbaṃ, pādodakaṃ pādapīṭhaṃ pādakathalikaṃ paṭisāmetabbaṃ. Sace so deso uklāpo hoti, so deso sammajjitabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sace antevāsiko nahāyitukāmo hoti, nahānaṃ paṭiyādetabbaṃ. Sace sītena attho hoti, sītaṃ paṭiyādetabbaṃ. Sace uṇhena attho hoti, uṇhaṃ paṭiyādetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace antevāsiko jantāgharaṃ pavisitukāmo hoti, cuṇṇaṃ sannetabbaṃ, mattikā temetabbā, jantāgharapīṭhaṃ ādāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ādāya antevāsikassa piṭṭhito piṭṭhito (ka.)]"
      },
      " gantvā jantāgharapīṭhaṃ datvā cīvaraṃ paṭiggahetvā ekamantaṃ nikkhipitabbaṃ, cuṇṇaṃ dātabbaṃ, mattikā dātabbā. Sace ussahati jantāgharaṃ pavisitabbaṃ. Jantāgharaṃ pavisantena ",
      " mattikāya mukhaṃ makkhetvā purato ca pacchato ca paṭicchādetvā jantāgharaṃ pavisitabbaṃ. Na there bhikkhū anupakhajja nisīditabbaṃ. Na navā bhikkhū āsanena paṭibāhitabbā ",
      ". Jantāghare antevāsikassa parikammaṃ kātabbaṃ. Jantāgharā nikkhamantena jantāgharapīṭhaṃ ādāya purato ca pacchato ca paṭicchādetvā jantāgharā nikkhamitabbaṃ."
    ],
    "innerText": "‘‘Sace antevāsiko jantāgharaṃ pavisitukāmo hoti, cuṇṇaṃ sannetabbaṃ, mattikā temetabbā, jantāgharapīṭhaṃ ādāya [ādāya antevāsikassa piṭṭhito piṭṭhito (ka.)] gantvā jantāgharapīṭhaṃ datvā cīvaraṃ paṭiggahetvā ekamantaṃ nikkhipitabbaṃ, cuṇṇaṃ dātabbaṃ, mattikā dātabbā. Sace ussahati jantāgharaṃ pavisitabbaṃ. Jantāgharaṃ pavisantena mattikāya mukhaṃ makkhetvā purato ca pacchato ca paṭicchādetvā jantāgharaṃ pavisitabbaṃ. Na there bhikkhū anupakhajja nisīditabbaṃ. Na navā bhikkhū āsanena paṭibāhitabbā . Jantāghare antevāsikassa parikammaṃ kātabbaṃ. Jantāgharā nikkhamantena jantāgharapīṭhaṃ ādāya purato ca pacchato ca paṭicchādetvā jantāgharā nikkhamitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Udakepi antevāsikassa ",
      " parikammaṃ kātabbaṃ. Nahātena paṭhamataraṃ uttaritvā attano gattaṃ vodakaṃ katvā nivāsetvā antevāsikassa gattato udakaṃ pamajjitabbaṃ, nivāsanaṃ dātabbaṃ, saṅghāṭi dātabbā, jantāgharapīṭhaṃ ādāya paṭhamataraṃ āgantvā āsanaṃ paññapetabbaṃ, pādodakaṃ pādapīṭhaṃ pādakathalikaṃ upanikkhipitabbaṃ, antevāsiko pānīyena pucchitabbo."
    ],
    "innerText": "‘‘Udakepi antevāsikassa parikammaṃ kātabbaṃ. Nahātena paṭhamataraṃ uttaritvā attano gattaṃ vodakaṃ katvā nivāsetvā antevāsikassa gattato udakaṃ pamajjitabbaṃ, nivāsanaṃ dātabbaṃ, saṅghāṭi dātabbā, jantāgharapīṭhaṃ ādāya paṭhamataraṃ āgantvā āsanaṃ paññapetabbaṃ, pādodakaṃ pādapīṭhaṃ pādakathalikaṃ upanikkhipitabbaṃ, antevāsiko pānīyena pucchitabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Yasmiṃ vihāre antevāsiko viharati, sace so vihāro uklāpo hoti, sace ussahati, sodhetabbo. Vihāraṃ sodhentena paṭhamaṃ pattacīvaraṃ nīharitvā ekamantaṃ nikkhipitabbaṃ…pe… ācamanakumbhiyā udakaṃ na hoti, ācamanakumbhiyā udakaṃ āsiñcitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace antevāsikassa anabhirati uppannā hoti, ācariyena vūpakāsetabbo, vūpakāsāpetabbo, dhammakathā vāssa kātabbā. Sace antevāsikassa kukkuccaṃ uppannaṃ hoti, ācariyena vinodetabbaṃ, vinodāpetabbaṃ, dhammakathā vāssa kātabbā. Sace antevāsikassa diṭṭhigataṃ uppannaṃ hoti, ācariyena vivecetabbaṃ, vivecāpetabbaṃ, dhammakathā vāssa kātabbā. Sace antevāsiko garudhammaṃ ajjhāpanno hoti, parivāsāraho, ācariyena ussukkaṃ kātabbaṃ – kinti nu kho saṅgho antevāsikassa parivāsaṃ dadeyyāti. Sace antevāsiko mūlāyapaṭikassanāraho hoti, ācariyena ussukkaṃ kātabbaṃ – kinti nu kho saṅgho antevāsikaṃ mūlāya paṭikasseyyāti. Sace antevāsiko mānattāraho hoti, ācariyena ussukkaṃ kātabbaṃ ",
      " – kinti nu kho saṅgho antevāsikassa mānattaṃ dadeyyāti. Sace antevāsiko abbhānāraho hoti, ācariyena ussukkaṃ kātabbaṃ – kinti nu kho saṅgho antevāsikaṃ abbheyyāti. Sace saṅgho antevāsikassa kammaṃ kattukāmo hoti, tajjanīyaṃ vā niyassaṃ vā pabbājanīyaṃ vā paṭisāraṇīyaṃ vā ukkhepanīyaṃ vā, ācariyena ussukkaṃ kātabbaṃ – kinti nu kho saṅgho antevāsikassa kammaṃ na kareyya ",
      ", lahukāya vā pariṇāmeyyāti. Kataṃ vā panassa hoti, saṅghena kammaṃ, tajjanīyaṃ vā niyassaṃ vā pabbājanīyaṃ vā paṭisāraṇīyaṃ vā ukkhepanīyaṃ vā, ācariyena ussukkaṃ kātabbaṃ – kinti nu kho antevāsiko sammā vatteyya, lomaṃ pāteyya, netthāraṃ vatteyya, saṅgho taṃ kammaṃ paṭippassambheyyāti."
    ],
    "innerText": "‘‘Sace antevāsikassa anabhirati uppannā hoti, ācariyena vūpakāsetabbo, vūpakāsāpetabbo, dhammakathā vāssa kātabbā. Sace antevāsikassa kukkuccaṃ uppannaṃ hoti, ācariyena vinodetabbaṃ, vinodāpetabbaṃ, dhammakathā vāssa kātabbā. Sace antevāsikassa diṭṭhigataṃ uppannaṃ hoti, ācariyena vivecetabbaṃ, vivecāpetabbaṃ, dhammakathā vāssa kātabbā. Sace antevāsiko garudhammaṃ ajjhāpanno hoti, parivāsāraho, ācariyena ussukkaṃ kātabbaṃ – kinti nu kho saṅgho antevāsikassa parivāsaṃ dadeyyāti. Sace antevāsiko mūlāyapaṭikassanāraho hoti, ācariyena ussukkaṃ kātabbaṃ – kinti nu kho saṅgho antevāsikaṃ mūlāya paṭikasseyyāti. Sace antevāsiko mānattāraho hoti, ācariyena ussukkaṃ kātabbaṃ – kinti nu kho saṅgho antevāsikassa mānattaṃ dadeyyāti. Sace antevāsiko abbhānāraho hoti, ācariyena ussukkaṃ kātabbaṃ – kinti nu kho saṅgho antevāsikaṃ abbheyyāti. Sace saṅgho antevāsikassa kammaṃ kattukāmo hoti, tajjanīyaṃ vā niyassaṃ vā pabbājanīyaṃ vā paṭisāraṇīyaṃ vā ukkhepanīyaṃ vā, ācariyena ussukkaṃ kātabbaṃ – kinti nu kho saṅgho antevāsikassa kammaṃ na kareyya , lahukāya vā pariṇāmeyyāti. Kataṃ vā panassa hoti, saṅghena kammaṃ, tajjanīyaṃ vā niyassaṃ vā pabbājanīyaṃ vā paṭisāraṇīyaṃ vā ukkhepanīyaṃ vā, ācariyena ussukkaṃ kātabbaṃ – kinti nu kho antevāsiko sammā vatteyya, lomaṃ pāteyya, netthāraṃ vatteyya, saṅgho taṃ kammaṃ paṭippassambheyyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace ",
      " antevāsikassa cīvaraṃ dhovitabbaṃ hoti, ācariyena ācikkhitabbaṃ – evaṃ dhoveyyāsīti, ussukkaṃ vā kātabbaṃ – kinti nu kho antevāsikassa cīvaraṃ dhoviyethāti. Sace antevāsikassa cīvaraṃ kātabbaṃ hoti, ācariyena ācikkhitabbaṃ – evaṃ kareyyāsīti, ussukkaṃ vā kātabbaṃ – kinti nu kho antevāsikassa cīvaraṃ kariyethāti. Sace antevāsikassa rajanaṃ pacitabbaṃ hoti, ācariyena ācikkhitabbaṃ – evaṃ paceyyāsīti, ussukkaṃ vā kātabbaṃ – kinti nu kho antevāsikassa rajanaṃ paciyethāti. Sace antevāsikassa cīvaraṃ rajitabbaṃ hoti, ācariyena ācikkhitabbaṃ – evaṃ rajeyyāsīti, ussukkaṃ vā kātabbaṃ ",
      " – kinti nu kho antevāsikassa cīvaraṃ rajiyethāti. Cīvaraṃ rajantena sādhukaṃ samparivattakaṃ samparivattakaṃ rajitabbaṃ. Na ca acchinne theve pakkamitabbaṃ. Sace antevāsiko gilāno hoti, yāvajīvaṃ upaṭṭhātabbo, vuṭṭhānamassa āgametabbaṃ. Idaṃ kho, bhikkhave, ācariyānaṃ antevāsikesu vattaṃ yathā ācariyehi antevāsikesu sammā vattitabba’’nti."
    ],
    "innerText": "‘‘Sace antevāsikassa cīvaraṃ dhovitabbaṃ hoti, ācariyena ācikkhitabbaṃ – evaṃ dhoveyyāsīti, ussukkaṃ vā kātabbaṃ – kinti nu kho antevāsikassa cīvaraṃ dhoviyethāti. Sace antevāsikassa cīvaraṃ kātabbaṃ hoti, ācariyena ācikkhitabbaṃ – evaṃ kareyyāsīti, ussukkaṃ vā kātabbaṃ – kinti nu kho antevāsikassa cīvaraṃ kariyethāti. Sace antevāsikassa rajanaṃ pacitabbaṃ hoti, ācariyena ācikkhitabbaṃ – evaṃ paceyyāsīti, ussukkaṃ vā kātabbaṃ – kinti nu kho antevāsikassa rajanaṃ paciyethāti. Sace antevāsikassa cīvaraṃ rajitabbaṃ hoti, ācariyena ācikkhitabbaṃ – evaṃ rajeyyāsīti, ussukkaṃ vā kātabbaṃ – kinti nu kho antevāsikassa cīvaraṃ rajiyethāti. Cīvaraṃ rajantena sādhukaṃ samparivattakaṃ samparivattakaṃ rajitabbaṃ. Na ca acchinne theve pakkamitabbaṃ. Sace antevāsiko gilāno hoti, yāvajīvaṃ upaṭṭhātabbo, vuṭṭhānamassa āgametabbaṃ. Idaṃ kho, bhikkhave, ācariyānaṃ antevāsikesu vattaṃ yathā ācariyehi antevāsikesu sammā vattitabba’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vattakkhandhako aṭṭhamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Imamhi khandhake vatthū ekūnavīsati, vattā cuddasa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Saupāhanā chattā ca, oguṇṭhi sīsaṃ pānīyaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nābhivāde na pucchanti, ahi ujjhanti pesalā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Omuñci chattaṃ khandhe ca, atarañca paṭikkamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pattacīvaraṃ nikkhipā, patirūpañca pucchitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Āsiñceyya dhovitena, sukkhenallenupāhanā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vuḍḍho navako puccheyya, ajjhāvuṭṭhañca gocarā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Sekkhā ",
      " vaccā pānī pari, kattaraṃ katikaṃ tato;"
    ],
    "innerText": "Sekkhā vaccā pānī pari, kattaraṃ katikaṃ tato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Kālaṃ ",
      " muhuttaṃ uklāpo, bhūmattharaṇaṃ nīhare."
    ],
    "innerText": "Kālaṃ muhuttaṃ uklāpo, bhūmattharaṇaṃ nīhare."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Paṭipādo ",
      " bhisibibbo, mañcapīṭhañca mallakaṃ;"
    ],
    "innerText": "Paṭipādo bhisibibbo, mañcapīṭhañca mallakaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Apassenullokakaṇṇā, gerukā kāḷa akatā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Saṅkārañca bhūmattharaṇaṃ, paṭipādakaṃ mañcapīṭhaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhisi nisīdanampi, mallakaṃ apassena ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Pattacīvaraṃ bhūmi ca, pārantaṃ orato bhogaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Puratthimā pacchimā ca, uttarā atha dakkhiṇā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sītuṇhe ca divārattiṃ, pariveṇañca koṭṭhako;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Upaṭṭhānaggi sālā ca, vattaṃ vaccakuṭīsu ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Pānī paribhojaniyā, kumbhi ācamanesu ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Anopamena paññattaṃ, vattaṃ āgantukehime ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[ve (ka. evamuparipi)]"
      },
      "."
    ],
    "innerText": "Anopamena paññattaṃ, vattaṃ āgantukehime [ve (ka. evamuparipi)]."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Nevāsanaṃ na udakaṃ, na paccu na ca pāniyaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nābhivāde napaññape, ujjhāyanti ca pesalā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Vuḍḍhāsanañca udakaṃ, paccuggantvā ca pāniyaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Upāhane ekamantaṃ, abhivāde ca paññape."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Vutthaṃ ",
      " gocarasekkho ca, ṭhānaṃ pāniyabhojanaṃ;"
    ],
    "innerText": "Vutthaṃ gocarasekkho ca, ṭhānaṃ pāniyabhojanaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kattaraṃ katikaṃ kālaṃ, navakassa nisinnake."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Abhivādaye ",
      " ācikkhe, yathā heṭṭhā tathā naye;"
    ],
    "innerText": "Abhivādaye ācikkhe, yathā heṭṭhā tathā naye;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Niddiṭṭhaṃ satthavāhena vattaṃ āvāsikehime."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Gamikā dārumatti ca, vivaritvā na pucchiya;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nassanti ca aguttañca, ujjhāyanti ca pesalā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Paṭisāmetvā ",
      " thaketvā, āpucchitvāva pakkame;"
    ],
    "innerText": "Paṭisāmetvā thaketvā, āpucchitvāva pakkame;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhikkhu vā sāmaṇero vā, ārāmiko upāsako."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Pāsāṇakesu ca puñjaṃ, paṭisāme thakeyya ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sace ussahati ussukkaṃ, anovasse tatheva ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Sabbo ",
      " ovassati gāmaṃ, ajjhokāse tatheva ca;"
    ],
    "innerText": "Sabbo ovassati gāmaṃ, ajjhokāse tatheva ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Appevaṅgāni seseyyuṃ, vattaṃ gamikabhikkhunā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Nānumodanti therena, ohāya catupañcahi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vaccito mucchito āsi, vattānumodanesume."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Chabbaggiyā dunnivatthā, athopi ca duppārutā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Anākappā ca vokkamma, there anupakhajjane."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Nave bhikkhū ca saṅghāṭi, ujjhāyanti ca pesalā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Timaṇḍalaṃ ",
      " nivāsetvā, kāyasaguṇagaṇṭhikā."
    ],
    "innerText": "Timaṇḍalaṃ nivāsetvā, kāyasaguṇagaṇṭhikā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Na vokkamma paṭicchannaṃ, susaṃvutokkhittacakkhu;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ukkhittojjagghikāsaddo, tayo ceva pacālanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Khambhoguṇṭhiukkuṭikā, paṭicchannaṃ susaṃvuto;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Okkhittukkhittaujjagghi, appasaddo tayo calā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Khambhoguṇṭhipallatthi ca, anupakhajja nāsane;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ottharitvāna udake, nīcaṃ katvāna siñciyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Paṭi sāmantā saṅghāṭi, odane ca paṭiggahe;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sūpaṃ uttaribhaṅgena, sabbesaṃ samatitthi ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Sakkaccaṃ ",
      " pattasaññī ca, sapadānañca sūpakaṃ;"
    ],
    "innerText": "Sakkaccaṃ pattasaññī ca, sapadānañca sūpakaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Na thūpato paṭicchāde, viññattujjhānasaññinā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Mahantamaṇḍaladvāraṃ, sabbahattho na byāhare;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ukkhepo chedanāgaṇḍa, dhunaṃ sitthāvakārakaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Jivhānicchārakañceva, capucapu surusuru;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Hatthapattoṭṭhanillehaṃ, sāmisena paṭiggahe."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Yāva ",
      " na sabbe udake, nīcaṃ katvāna siñciyaṃ;"
    ],
    "innerText": "Yāva na sabbe udake, nīcaṃ katvāna siñciyaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Paṭi sāmantā saṅghāṭi, nīcaṃ katvā chamāya ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sasitthakaṃ nivattante, suppaṭicchannamukkuṭi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dhammarājena paññattaṃ, idaṃ bhattaggavattanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Dunnivatthā ",
      " anākappā, asallekkhetvā ca sahasā;"
    ],
    "innerText": "Dunnivatthā anākappā, asallekkhetvā ca sahasā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dūre acca ciraṃ lahuṃ, tatheva piṇḍacāriko."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Paṭicchannova ",
      " gaccheyya, suṃsavutokkhittacakkhu;"
    ],
    "innerText": "Paṭicchannova gaccheyya, suṃsavutokkhittacakkhu;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ukkhittojjagghikāsaddo, tayo ceva pacālanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Khambhoguṇṭhiukkuṭikā, sallakkhetvā ca sahasā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dūre acca ciraṃ lahuṃ, āsanakaṃ kaṭacchukā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Bhājanaṃ vā ṭhapeti ca, uccāretvā paṇāmetvā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Paṭiggahe na ulloke, sūpesupi tatheva taṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Bhikkhu saṅghāṭiyā chāde, paṭicchanneva gacchiyaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Saṃvutokkhittacakkhu ca, ukkhittojjagghikāya ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Appasaddo tayo cālā, khambhoguṇṭhikaukkuṭi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Paṭhamāsanavakkāra ",
      ", pāniyaṃ paribhojanī;"
    ],
    "innerText": "Paṭhamāsanavakkāra , pāniyaṃ paribhojanī;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pacchākaṅkhati bhuñjeyya, opilāpeyya uddhare."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Paṭisāmeyya ",
      " sammajje, rittaṃ tucchaṃ upaṭṭhape;"
    ],
    "innerText": "Paṭisāmeyya sammajje, rittaṃ tucchaṃ upaṭṭhape;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Hatthavikāre bhindeyya, vattidaṃ piṇḍacārike."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Pānī pari aggiraṇi, nakkhattadisacorā ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sabbaṃ natthīti koṭṭetvā, pattaṃse cīvaraṃ tato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Idāni aṃse laggetvā, timaṇḍalaṃ parimaṇḍalaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yathā piṇḍacārivattaṃ, naye āraññakesupi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Pattaṃse cīvaraṃ sīse, ārohitvā ca pāniyaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Paribhojaniyaṃ aggi, araṇī cāpi kattaraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Nakkhattaṃ sappadesaṃ vā, disāpi kusalo bhave;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sattuttamena paññattaṃ, vattaṃ āraññakesume."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Ajjhokāse okiriṃsu, ujjhāyanti ca pesalā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sace vihāro uklāpo, paṭhamaṃ pattacīvaraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Bhisibibbohanaṃ mañcaṃ, pīṭhañca kheḷamallakaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Apassenullokakaṇṇā, gerukā kāḷa akatā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Saṅkāraṃ ",
      " bhikkhusāmantā, senāvihārapāniyaṃ;"
    ],
    "innerText": "Saṅkāraṃ bhikkhusāmantā, senāvihārapāniyaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Paribhojanasāmantā, paṭivāte ca aṅgaṇe."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Adhovāte attharaṇaṃ, paṭipādakamañco ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Pīṭhaṃ ",
      " bhisi nisīdanaṃ, mallakaṃ apassena ca."
    ],
    "innerText": "Pīṭhaṃ bhisi nisīdanaṃ, mallakaṃ apassena ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Pattacīvaraṃ ",
      " bhūmi ca, pārantaṃ orato bhogaṃ;"
    ],
    "innerText": "Pattacīvaraṃ bhūmi ca, pārantaṃ orato bhogaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Puratthimā ca pacchimā, uttarā atha dakkhiṇā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sītuṇhe ca divā rattiṃ, pariveṇañca koṭṭhako;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Upaṭṭhānaggisālā ca, vaccakuṭī ca pāniyaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Ācamanakumbhi vuḍḍhe ca, uddesapucchanā sajjhā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dhammo padīpaṃ vijjhāpe, na vivare napi thake."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Yena vuḍḍho parivatti, kaṇṇenapi na ghaṭṭaye;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Paññapesi mahāvīro, vattaṃ senāsanesu taṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Nivāriyamānā dvāraṃ, mucchitujjhanti pesalā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Chārikaṃ ",
      " chaḍḍaye jantā, paribhaṇḍaṃ tatheva ca."
    ],
    "innerText": "Chārikaṃ chaḍḍaye jantā, paribhaṇḍaṃ tatheva ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Pariveṇaṃ koṭṭhako sālā, cuṇṇamattikadoṇikā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Mukhaṃ purato na there, na nave ussahati sace."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Purato uparimaggo, cikkhallaṃ matti pīṭhakaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Vijjhāpetvā thaketvā ca, vattaṃ jantāgharesume."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Nācameti yathāvuḍḍhaṃ, paṭipāṭi ca sahasā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Ubbhaji ",
      " nitthuno kaṭṭhaṃ, vaccaṃ passāva kheḷakaṃ."
    ],
    "innerText": "Ubbhaji nitthuno kaṭṭhaṃ, vaccaṃ passāva kheḷakaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Pharusā kūpa sahasā, ubbhaji capu sesena;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bahi anto ca ukkāse, rajju ataramānañca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Sahasā ubbhaji ṭhite, nitthune kaṭṭha vaccañca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Passāva kheḷa pharusā, kūpañca vaccapāduke."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Nātisahasā ",
      " ubbhaji, pādukāya capucapu;"
    ],
    "innerText": "Nātisahasā ubbhaji, pādukāya capucapu;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Na sesaye paṭicchāde, uhatapidharena ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Vaccakuṭī ",
      " paribhaṇḍaṃ, pariveṇañca koṭṭhako;"
    ],
    "innerText": "Vaccakuṭī paribhaṇḍaṃ, pariveṇañca koṭṭhako;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ācamane ca udakaṃ, vattaṃ vaccakuṭīsume."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Upāhanā dantakaṭṭhaṃ, mukhodakañca āsanaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yāgu udakaṃ dhovitvā, uddhāruklāpa gāma ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Nivāsanā kāyabandhā, saguṇaṃ pattasodakaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pacchā timaṇḍalo ceva, parimaṇḍala bandhanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Saguṇaṃ dhovitvā pacchā, nātidūre paṭiggahe;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhaṇamānassa āpatti, paṭhamāgantvāna āsanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Udakaṃ pīṭhakathali, paccuggantvā nivāsanaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Otāpe ",
      " nidahi bhaṅgo, obhoge bhuñjitu name."
    ],
    "innerText": "Otāpe nidahi bhaṅgo, obhoge bhuñjitu name."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Pānīyaṃ udakaṃ nīcaṃ, muhuttaṃ na ca nidahe;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pattacīvaraṃ bhūmi ca, pārantaṃ orato bhogaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Uddhare paṭisāme ca, uklāpo ca nahāyituṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sītaṃ uṇhaṃ jantāgharaṃ, cuṇṇaṃ mattika piṭṭhito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Pīṭhañca cīvaraṃ cuṇṇaṃ, mattikussahati mukhaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Purato there nave ca, parikammañca nikkhame."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Purato udake nhāte, nivāsetvā upajjhāyaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nivāsanañca saṅghāṭi, pīṭhakaṃ āsanena ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Pādo ",
      " pīṭhaṃ kathaliñca, pānīyuddesapucchanā;"
    ],
    "innerText": "Pādo pīṭhaṃ kathaliñca, pānīyuddesapucchanā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Uklāpaṃ susodheyya, paṭhamaṃ pattacīvaraṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Nisīdanapaccattharaṇaṃ, bhisi bibbohanāni ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Mañco pīṭhaṃ paṭipādaṃ, mallakaṃ apassena ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Bhūma santāna āloka, gerukā kāḷa akatā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhūmattharapaṭipādā, mañco pīṭhaṃ bibbohanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Nisīdattharaṇaṃ kheḷa, apasse pattacīvaraṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Puratthimā ",
      " pacchimā ca, uttarā atha dakkhiṇā."
    ],
    "innerText": "Puratthimā pacchimā ca, uttarā atha dakkhiṇā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Sītuṇhañca ",
      " divā rattiṃ, pariveṇañca koṭṭhako;"
    ],
    "innerText": "Sītuṇhañca divā rattiṃ, pariveṇañca koṭṭhako;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Upaṭṭhānaggisālā ",
      " ca, vaccapāniyabhojanī."
    ],
    "innerText": "Upaṭṭhānaggisālā ca, vaccapāniyabhojanī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Ācamaṃ anabhirati, kukkuccaṃ diṭṭhi ca garu;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Mūlamānattaabbhānaṃ, tajjanīyaṃ niyassakaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Pabbāja paṭisāraṇī, ukkhepañca kataṃ yadi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dhove kātabbaṃ rajañca, raje samparivattakaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Pattañca cīvarañcāpi, parikkhārañca chedanaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Parikammaṃ veyyāvaccaṃ, pacchā piṇḍaṃ pavisanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Na susānaṃ disā ceva, yāvajīvaṃ upaṭṭhahe;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Saddhivihārikenetaṃ, vattupajjhāyakesume."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Ovādasāsanuddesā, pucchā pattañca cīvaraṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Parikkhāro gilāno ca, na pacchāsamaṇo bhave."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Upajjhāyesu ",
      " ye vattā, evaṃ ācariyesupi;"
    ],
    "innerText": "Upajjhāyesu ye vattā, evaṃ ācariyesupi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Saddhivihārike vattā, tatheva antevāsike."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Āgantukesu ye vattā, puna āvāsikesu ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Gamikānumodanikā, bhattagge piṇḍacārike."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Āraññakesu yaṃ vattaṃ, yañca senāsanesupi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Jantāghare vaccakuṭī, upajjhā saddhivihārike."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Ācariyesu ",
      " yaṃ vattaṃ, tatheva antevāsike;"
    ],
    "innerText": "Ācariyesu yaṃ vattaṃ, tatheva antevāsike;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ekūnavīsati vatthū, vattā cuddasa khandhake."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Vattaṃ aparipūrento, na sīlaṃ paripūrati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Asuddhasīlo duppañño, cittekaggaṃ na vindati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Vikkhittacittonekaggo, sammā dhammaṃ na passati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Apassamāno saddhammaṃ, dukkhā na parimuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Yaṃ ",
      " vattaṃ paripūrento, sīlampi paripūrati;"
    ],
    "innerText": "Yaṃ vattaṃ paripūrento, sīlampi paripūrati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Visuddhasīlo sappañño, cittekaggampi vindati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Avikkhittacitto ekaggo, sammā dhammaṃ vipassati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sampassamāno saddhammaṃ, dukkhā so parimuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Tasmā hi vattaṃ pūreyya, jinaputto vicakkhaṇo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ovādaṃ buddhaseṭṭhassa, tato nibbānamehitīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vattakkhandhakaṃ niṭṭhitaṃ."
  }
]