[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "33. Kammākammavinicchayakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "249"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammākamma"
      },
      "nti ",
      " ettha (pari. 482-484) pana kammāni cattāri – apalokanakammaṃ ñattikammaṃ ñattidutiyakammaṃ ñatticatutthakammanti. Imāni cattāri kammāni katihākārehi vipajjanti? Pañcahākārehi vipajjanti – vatthuto vā ñattito vā anussāvanato vā sīmato vā parisato vā."
    ],
    "innerText": "249.Kammākammanti ettha (pari. 482-484) pana kammāni cattāri – apalokanakammaṃ ñattikammaṃ ñattidutiyakammaṃ ñatticatutthakammanti. Imāni cattāri kammāni katihākārehi vipajjanti? Pañcahākārehi vipajjanti – vatthuto vā ñattito vā anussāvanato vā sīmato vā parisato vā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vatthuto kammāni vipajjanti"
      },
      "? Sammukhākaraṇīyaṃ kammaṃ asammukhā karoti, vatthuvipannaṃ adhammakammaṃ. Paṭipucchākaraṇīyaṃ kammaṃ apaṭipucchā karoti, vatthuvipannaṃ adhammakammaṃ. Paṭiññāya karaṇīyaṃ kammaṃ apaṭiññāya karoti, vatthuvipannaṃ adhammakammaṃ. Sativinayārahassa amūḷhavinayaṃ deti, vatthuvipannaṃ adhammakammaṃ. Amūḷhavinayārahassa tassa pāpiyasikakammaṃ karoti, vatthuvipannaṃ adhammakammaṃ. Tassa pāpiyasikakammārahassa tajjanīyakammaṃ karoti, vatthuvipannaṃ adhammakammaṃ. Tajjanīyakammārahassa niyassakammaṃ karoti, vatthuvipannaṃ adhammakammaṃ. Niyassakammārahassa pabbājanīyakammaṃ karoti, vatthuvipannaṃ adhammakammaṃ. Pabbājanīyakammārahassa paṭisāraṇīyakammaṃ karoti, vatthuvipannaṃ adhammakammaṃ. Paṭisāraṇīyakammārahassa ukkhepanīyakammaṃ karoti, vatthuvipannaṃ adhammakammaṃ. Ukkhepanīyakammārahassa parivāsaṃ deti, vatthuvipannaṃ adhammakammaṃ. Parivāsārahassa mūlāya paṭikassati, vatthuvipannaṃ adhammakammaṃ. Mūlāyapaṭikassanārahassa mānattaṃ deti, vatthuvipannaṃ adhammakammaṃ. Mānattārahaṃ abbheti, vatthuvipannaṃ adhammakammaṃ. Abbhānārahaṃ upasampādeti, vatthuvipannaṃ adhammakammaṃ. Anuposathe uposathaṃ karoti, vatthuvipannaṃ adhammakammaṃ. Apavāraṇāya pavāreti, vatthuvipannaṃ adhammakammaṃ. Paṇḍakaṃ upasampādeti, vatthuvipannaṃ adhammakammaṃ. Theyyasaṃvāsakaṃ, titthiyapakkantakaṃ, tiracchānagataṃ, mātughātakaṃ, pitughātakaṃ, arahantaghātakaṃ, bhikkhunidūsakaṃ, saṅghabhedakaṃ, lohituppādakaṃ, ubhatobyañjanakaṃ, ūnavīsativassaṃ puggalaṃ upasampādeti, vatthuvipannaṃ adhammakammaṃ. Evaṃ vatthuto kammāni vipajjanti."
    ],
    "innerText": "Kathaṃ vatthuto kammāni vipajjanti? Sammukhākaraṇīyaṃ kammaṃ asammukhā karoti, vatthuvipannaṃ adhammakammaṃ. Paṭipucchākaraṇīyaṃ kammaṃ apaṭipucchā karoti, vatthuvipannaṃ adhammakammaṃ. Paṭiññāya karaṇīyaṃ kammaṃ apaṭiññāya karoti, vatthuvipannaṃ adhammakammaṃ. Sativinayārahassa amūḷhavinayaṃ deti, vatthuvipannaṃ adhammakammaṃ. Amūḷhavinayārahassa tassa pāpiyasikakammaṃ karoti, vatthuvipannaṃ adhammakammaṃ. Tassa pāpiyasikakammārahassa tajjanīyakammaṃ karoti, vatthuvipannaṃ adhammakammaṃ. Tajjanīyakammārahassa niyassakammaṃ karoti, vatthuvipannaṃ adhammakammaṃ. Niyassakammārahassa pabbājanīyakammaṃ karoti, vatthuvipannaṃ adhammakammaṃ. Pabbājanīyakammārahassa paṭisāraṇīyakammaṃ karoti, vatthuvipannaṃ adhammakammaṃ. Paṭisāraṇīyakammārahassa ukkhepanīyakammaṃ karoti, vatthuvipannaṃ adhammakammaṃ. Ukkhepanīyakammārahassa parivāsaṃ deti, vatthuvipannaṃ adhammakammaṃ. Parivāsārahassa mūlāya paṭikassati, vatthuvipannaṃ adhammakammaṃ. Mūlāyapaṭikassanārahassa mānattaṃ deti, vatthuvipannaṃ adhammakammaṃ. Mānattārahaṃ abbheti, vatthuvipannaṃ adhammakammaṃ. Abbhānārahaṃ upasampādeti, vatthuvipannaṃ adhammakammaṃ. Anuposathe uposathaṃ karoti, vatthuvipannaṃ adhammakammaṃ. Apavāraṇāya pavāreti, vatthuvipannaṃ adhammakammaṃ. Paṇḍakaṃ upasampādeti, vatthuvipannaṃ adhammakammaṃ. Theyyasaṃvāsakaṃ, titthiyapakkantakaṃ, tiracchānagataṃ, mātughātakaṃ, pitughātakaṃ, arahantaghātakaṃ, bhikkhunidūsakaṃ, saṅghabhedakaṃ, lohituppādakaṃ, ubhatobyañjanakaṃ, ūnavīsativassaṃ puggalaṃ upasampādeti, vatthuvipannaṃ adhammakammaṃ. Evaṃ vatthuto kammāni vipajjanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ñattito kammāni vipajjanti"
      },
      "? Pañcahākārehi ñattito kammāni vipajjanti – vatthuṃ na parāmasati, saṅghaṃ na parāmasati, puggalaṃ na parāmasati, ñattiṃ na parāmasati, pacchā vā ñattiṃ ṭhapeti. Imehi pañcahākārehi ñattito kammāni vipajjanti."
    ],
    "innerText": "Kathaṃ ñattito kammāni vipajjanti? Pañcahākārehi ñattito kammāni vipajjanti – vatthuṃ na parāmasati, saṅghaṃ na parāmasati, puggalaṃ na parāmasati, ñattiṃ na parāmasati, pacchā vā ñattiṃ ṭhapeti. Imehi pañcahākārehi ñattito kammāni vipajjanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anussāvanato kammāni vipajjanti"
      },
      "? Pañcahākārehi anussāvanato kammāni vipajjanti – vatthuṃ na parāmasati, saṅghaṃ na parāmasati, puggalaṃ na parāmasati, sāvanaṃ hāpeti, akāle vā sāveti. Imehi pañcahākārehi anussāvanato kammāni vipajjanti."
    ],
    "innerText": "Kathaṃ anussāvanato kammāni vipajjanti? Pañcahākārehi anussāvanato kammāni vipajjanti – vatthuṃ na parāmasati, saṅghaṃ na parāmasati, puggalaṃ na parāmasati, sāvanaṃ hāpeti, akāle vā sāveti. Imehi pañcahākārehi anussāvanato kammāni vipajjanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sīmato kammāni vipajjanti"
      },
      "? Ekādasahi ākārehi sīmato kammāni vipajjanti – atikhuddakaṃ sīmaṃ sammannati, atimahatiṃ sīmaṃ sammannati, khaṇḍanimittaṃ sīmaṃ sammannati, chāyānimittaṃ sīmaṃ sammannati, animittaṃ sīmaṃ ",
      " sammannati, bahisīme ṭhito sīmaṃ sammannati, nadiyā sīmaṃ sammannati, samudde sīmaṃ sammannati, jātassare sīmaṃ sammannati, sīmāya sīmaṃ sambhindati, sīmāya sīmaṃ ajjhottharati. Imehi ekādasahi ākārehi sīmato kammāni vipajjanti."
    ],
    "innerText": "Kathaṃ sīmato kammāni vipajjanti? Ekādasahi ākārehi sīmato kammāni vipajjanti – atikhuddakaṃ sīmaṃ sammannati, atimahatiṃ sīmaṃ sammannati, khaṇḍanimittaṃ sīmaṃ sammannati, chāyānimittaṃ sīmaṃ sammannati, animittaṃ sīmaṃ sammannati, bahisīme ṭhito sīmaṃ sammannati, nadiyā sīmaṃ sammannati, samudde sīmaṃ sammannati, jātassare sīmaṃ sammannati, sīmāya sīmaṃ sambhindati, sīmāya sīmaṃ ajjhottharati. Imehi ekādasahi ākārehi sīmato kammāni vipajjanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "parisato kammāni vipajjanti"
      },
      "? Dvādasahi ākārehi parisato kammāni vipajjanti – catuvaggakaraṇīye kamme yāvatikā bhikkhū kammappattā te anāgatā honti, chandārahānaṃ chando anāhaṭo hoti, sammukhībhūtā paṭikkosanti, catuvaggakaraṇe kamme yāvatikā bhikkhū kammappattā, te āgatā honti, chandārahānaṃ chando anāhaṭo hoti, sammukhībhūtā paṭikkosanti, catuvaggakaraṇe kamme yāvatikā bhikkhū kammappattā, te āgatā honti, chandārahānaṃ chando āhaṭo hoti, sammukhībhūtā paṭikkosanti."
    ],
    "innerText": "Kathaṃ parisato kammāni vipajjanti? Dvādasahi ākārehi parisato kammāni vipajjanti – catuvaggakaraṇīye kamme yāvatikā bhikkhū kammappattā te anāgatā honti, chandārahānaṃ chando anāhaṭo hoti, sammukhībhūtā paṭikkosanti, catuvaggakaraṇe kamme yāvatikā bhikkhū kammappattā, te āgatā honti, chandārahānaṃ chando anāhaṭo hoti, sammukhībhūtā paṭikkosanti, catuvaggakaraṇe kamme yāvatikā bhikkhū kammappattā, te āgatā honti, chandārahānaṃ chando āhaṭo hoti, sammukhībhūtā paṭikkosanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Pañcavaggakaraṇe kamme…pe… dasavaggakaraṇe kamme…pe… vīsativaggakaraṇe kamme yāvatikā bhikkhū kammappattā, te anāgatā honti, chandārahānaṃ chando anāhaṭo hoti, sammukhībhūtā paṭikkosanti, vīsativaggakaraṇe kamme yāvatikā bhikkhū kammappattā, te āgatā honti, chandārahānaṃ chando anāhaṭo hoti, sammukhībhūtā paṭikkosanti, vīsativaggakaraṇe kamme yāvatikā bhikkhū kammappattā, te āgatā honti, chandārahānaṃ chando āhaṭo hoti, sammukhībhūtā paṭikkosanti. Imehi dvādasahi ākārehi parisato kammāni vipajjanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Catuvaggakaraṇe kamme cattāro bhikkhū pakatattā kammappattā, avasesā pakatattā chandārahā. Yassa saṅgho kammaṃ karoti, so neva kammappatto nāpi chandāraho, apica kammāraho. Pañcavaggakaraṇe kamme pañca bhikkhū pakatattā kammappattā, avasesā pakatattā chandārahā. Yassa saṅgho kammaṃ karoti, so neva kammappatto nāpi chandāraho, apica kammāraho ",
      ". Dasavaggakaraṇe kamme dasa bhikkhū pakatattā kammappattā, avasesā pakatattā chandārahā. Yassa saṅgho kammaṃ karoti, so neva kammappatto nāpi chandāraho, apica kammāraho. Vīsativaggakaraṇe kamme vīsati bhikkhū pakatattā kammappattā, avasesā ",
      " pakatattā chandārahā. Yassa saṅgho kammaṃ karoti, so neva kammappatto nāpi chandāraho, apica kammāraho."
    ],
    "innerText": "Catuvaggakaraṇe kamme cattāro bhikkhū pakatattā kammappattā, avasesā pakatattā chandārahā. Yassa saṅgho kammaṃ karoti, so neva kammappatto nāpi chandāraho, apica kammāraho. Pañcavaggakaraṇe kamme pañca bhikkhū pakatattā kammappattā, avasesā pakatattā chandārahā. Yassa saṅgho kammaṃ karoti, so neva kammappatto nāpi chandāraho, apica kammāraho . Dasavaggakaraṇe kamme dasa bhikkhū pakatattā kammappattā, avasesā pakatattā chandārahā. Yassa saṅgho kammaṃ karoti, so neva kammappatto nāpi chandāraho, apica kammāraho. Vīsativaggakaraṇe kamme vīsati bhikkhū pakatattā kammappattā, avasesā pakatattā chandārahā. Yassa saṅgho kammaṃ karoti, so neva kammappatto nāpi chandāraho, apica kammāraho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "250"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Apalokanakammaṃ"
      },
      " kati ṭhānāni gacchati? ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñattikammaṃ, ñattidutiyakammaṃ, ñatticatutthakammaṃ"
      },
      " kati ṭhānāni gacchati? Apalokanakammaṃ pañca ṭhānāni gacchati. Ñattikammaṃ nava ṭhānāni gacchati. Ñattidutiyakammaṃ satta ṭhānāni gacchati. Ñatticatutthakammaṃ satta ṭhānāni gacchati."
    ],
    "innerText": "250.Apalokanakammaṃ kati ṭhānāni gacchati? Ñattikammaṃ, ñattidutiyakammaṃ, ñatticatutthakammaṃ kati ṭhānāni gacchati? Apalokanakammaṃ pañca ṭhānāni gacchati. Ñattikammaṃ nava ṭhānāni gacchati. Ñattidutiyakammaṃ satta ṭhānāni gacchati. Ñatticatutthakammaṃ satta ṭhānāni gacchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Apalokanakammaṃ"
      },
      " katamāni pañca ṭhānāni gacchati? Osāraṇaṃ nissāraṇaṃ bhaṇḍukammaṃ brahmadaṇḍaṃ kammalakkhaṇaññeva pañcamaṃ. Apalokanakammaṃ imāni pañca ṭhānāni gacchati."
    ],
    "innerText": "Apalokanakammaṃ katamāni pañca ṭhānāni gacchati? Osāraṇaṃ nissāraṇaṃ bhaṇḍukammaṃ brahmadaṇḍaṃ kammalakkhaṇaññeva pañcamaṃ. Apalokanakammaṃ imāni pañca ṭhānāni gacchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñattikammaṃ"
      },
      " katamāni nava ṭhānāni gacchati? Osāraṇaṃ nissāraṇaṃ uposathaṃ pavāraṇaṃ sammutiṃ dānaṃ paṭiggahaṇaṃ paccukkaḍḍhanaṃ kammalakkhaṇaññeva navamaṃ. Ñattikammaṃ imāni nava ṭhānāni gacchati."
    ],
    "innerText": "Ñattikammaṃ katamāni nava ṭhānāni gacchati? Osāraṇaṃ nissāraṇaṃ uposathaṃ pavāraṇaṃ sammutiṃ dānaṃ paṭiggahaṇaṃ paccukkaḍḍhanaṃ kammalakkhaṇaññeva navamaṃ. Ñattikammaṃ imāni nava ṭhānāni gacchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñattidutiyakammaṃ"
      },
      " katamāni satta ṭhānāni gacchati? Osāraṇaṃ nissāraṇaṃ sammutiṃ dānaṃ uddharaṇaṃ desanaṃ kammalakkhaṇaññeva sattamaṃ. Ñattidutiyakammaṃ imāni satta ṭhānāni gacchati."
    ],
    "innerText": "Ñattidutiyakammaṃ katamāni satta ṭhānāni gacchati? Osāraṇaṃ nissāraṇaṃ sammutiṃ dānaṃ uddharaṇaṃ desanaṃ kammalakkhaṇaññeva sattamaṃ. Ñattidutiyakammaṃ imāni satta ṭhānāni gacchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñatticatutthakammaṃ"
      },
      " katamāni satta ṭhānāni gacchati? Osāraṇaṃ nissāraṇaṃ sammutiṃ dānaṃ niggahaṃ samanubhāsanaṃ kammalakkhaṇaññeva sattamaṃ. Ñatticatutthakammaṃ imāni satta ṭhānāni gacchati. Ayaṃ tāva pāḷinayo."
    ],
    "innerText": "Ñatticatutthakammaṃ katamāni satta ṭhānāni gacchati? Osāraṇaṃ nissāraṇaṃ sammutiṃ dānaṃ niggahaṃ samanubhāsanaṃ kammalakkhaṇaññeva sattamaṃ. Ñatticatutthakammaṃ imāni satta ṭhānāni gacchati. Ayaṃ tāva pāḷinayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "251"
      },
      ". Ayaṃ panettha ādito paṭṭhāya vinicchayakathā (pari. aṭṭha. 482) – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "apalokanakammaṃ"
      },
      " nāma sīmaṭṭhakasaṅghaṃ sodhetvā chandārahānaṃ chandaṃ āharitvā samaggassa saṅghassa anumatiyā tikkhattuṃ sāvetvā kattabbakammaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñattikammaṃ"
      },
      " nāma vuttanayeneva samaggassa saṅghassa anumatiyā ekāya ñattiyā kattabbakammaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñattidutiyakammaṃ"
      },
      " nāma vuttanayeneva samaggassa saṅghassa anumatiyā ekāya ñattiyā ekāya ca anussāvanāyāti evaṃ ñattidutiyāya anussāvanāya ",
      " kattabbakammaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñatticatutthakammaṃ"
      },
      " nāma vuttanayeneva samaggassa saṅghassa anumatiyā ekāya ñattiyā tīhi ca anussāvanāhīti evaṃ ñatticatutthāhi tīhi anussāvanāhi kattabbakammaṃ."
    ],
    "innerText": "251. Ayaṃ panettha ādito paṭṭhāya vinicchayakathā (pari. aṭṭha. 482) – apalokanakammaṃ nāma sīmaṭṭhakasaṅghaṃ sodhetvā chandārahānaṃ chandaṃ āharitvā samaggassa saṅghassa anumatiyā tikkhattuṃ sāvetvā kattabbakammaṃ. Ñattikammaṃ nāma vuttanayeneva samaggassa saṅghassa anumatiyā ekāya ñattiyā kattabbakammaṃ. Ñattidutiyakammaṃ nāma vuttanayeneva samaggassa saṅghassa anumatiyā ekāya ñattiyā ekāya ca anussāvanāyāti evaṃ ñattidutiyāya anussāvanāya kattabbakammaṃ. Ñatticatutthakammaṃ nāma vuttanayeneva samaggassa saṅghassa anumatiyā ekāya ñattiyā tīhi ca anussāvanāhīti evaṃ ñatticatutthāhi tīhi anussāvanāhi kattabbakammaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatra ",
      " apalokanakammaṃ apaloketvāva kātabbaṃ, ñattikammādivasena na kātabbaṃ. Ñattikammampi ekaṃ ñattiṃ ṭhapetvāva kātabbaṃ, apalokanakammādivasena na kātabbaṃ. Ñattidutiyakammaṃ pana apaloketvā kātabbampi akātabbampi atthi. Tattha sīmāsammuti sīmāsamūhanaṃ kathinadānaṃ kathinuddhāro kuṭivatthudesanā vihāravatthudesanāti imāni chakammāni garukāni apaloketvā kātuṃ na vaṭṭati, ñattidutiyakammavācaṃ sāvetvāva kātabbāni. Avasesā terasa sammutiyo senāsanaggāhakamatakacīvaradānādisammutiyo cāti etāni lahukakammāni, apaloketvāpi kātuṃ vaṭṭanti, ñattikammañatticatutthakammavasena pana na kātabbameva. ‘‘Ñatticatutthakammavasena kayiramānaṃ daḷhataraṃ hoti, tasmā kātabba’’nti ekacce vadanti. Evaṃ pana sati kammasaṅkaro hoti, tasmā na kātabbanti paṭikkhittameva. Sace pana akkharaparihīnaṃ vā padaparihīnaṃ vā duruttapadaṃ vā hoti, tassa sodhanatthaṃ punappunaṃ vattuṃ vaṭṭati. Idaṃ akuppakammassa daḷhīkammaṃ hoti, kuppakamme kammaṃ hutvā tiṭṭhati. Ñatticatutthakammaṃ ñattiñca tisso ca kammavācāyo sāvetvāva kātabbaṃ, apalokanakammādivasena na kātabbaṃ."
    ],
    "innerText": "Tatra apalokanakammaṃ apaloketvāva kātabbaṃ, ñattikammādivasena na kātabbaṃ. Ñattikammampi ekaṃ ñattiṃ ṭhapetvāva kātabbaṃ, apalokanakammādivasena na kātabbaṃ. Ñattidutiyakammaṃ pana apaloketvā kātabbampi akātabbampi atthi. Tattha sīmāsammuti sīmāsamūhanaṃ kathinadānaṃ kathinuddhāro kuṭivatthudesanā vihāravatthudesanāti imāni chakammāni garukāni apaloketvā kātuṃ na vaṭṭati, ñattidutiyakammavācaṃ sāvetvāva kātabbāni. Avasesā terasa sammutiyo senāsanaggāhakamatakacīvaradānādisammutiyo cāti etāni lahukakammāni, apaloketvāpi kātuṃ vaṭṭanti, ñattikammañatticatutthakammavasena pana na kātabbameva. ‘‘Ñatticatutthakammavasena kayiramānaṃ daḷhataraṃ hoti, tasmā kātabba’’nti ekacce vadanti. Evaṃ pana sati kammasaṅkaro hoti, tasmā na kātabbanti paṭikkhittameva. Sace pana akkharaparihīnaṃ vā padaparihīnaṃ vā duruttapadaṃ vā hoti, tassa sodhanatthaṃ punappunaṃ vattuṃ vaṭṭati. Idaṃ akuppakammassa daḷhīkammaṃ hoti, kuppakamme kammaṃ hutvā tiṭṭhati. Ñatticatutthakammaṃ ñattiñca tisso ca kammavācāyo sāvetvāva kātabbaṃ, apalokanakammādivasena na kātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammukhākaraṇīyaṃ kammaṃ asammukhā karoti, vatthuvipannaṃ adhammakamma"
      },
      "nti ettha pana atthi kammaṃ sammukhākaraṇīyaṃ, atthi kammaṃ asammukhākaraṇīyaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asammukhākaraṇīyaṃ"
      },
      " nāma dūtenūpasampadā, pattanikkujjanaṃ, pattukkujjanaṃ, ummattakassa bhikkhuno ummattakasammuti, sekkhānaṃ kulānaṃ sekkhasammuti, channassa bhikkhuno brahmadaṇḍo, devadattassa pakāsanīyakammaṃ, apasādanīyaṃ dassentassa bhikkhuno bhikkhunisaṅghena kātabbaṃ avandiyakammanti aṭṭhavidhaṃ hoti. Idaṃ aṭṭhavidhampi kammaṃ asammukhā kataṃ sukataṃ hoti akuppaṃ, sesāni sabbakammāni sammukhā eva kātabbāni. Saṅghasammukhatā dhammasammukhatā vinayasammukhatā puggalasammukhatāti imaṃ catubbidhaṃ sammukhāvinayaṃ upanetvāva kātabbāni. Evaṃ katāni hi sukatāni honti, evaṃ akatāni panetāni imaṃ sammukhāvinayasaṅkhātaṃ vatthuṃ vinā katattā vatthuvipannāni nāma honti. Tena vuttaṃ ‘‘sammukhākaraṇīyaṃ kammaṃ asammukhā karoti, vatthuvipannaṃ adhammakamma’’nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭipucchākaraṇīyā"
      },
      "dīsupi paṭipucchādikaraṇameva vatthu, taṃ vatthuṃ vinā katattā tesampi vatthuvipannatā veditabbā. Apica ūnavīsativassaṃ vā antimavatthuṃ ajjhāpannapubbaṃ vā ekādasasu ",
      " vā abhabbapuggalesu aññataraṃ upasampādentassapi vatthuvipannaṃ adhammakammaṃ hoti. Ayaṃ vatthuto kammavipattiyaṃ vinicchayo."
    ],
    "innerText": "Sammukhākaraṇīyaṃ kammaṃ asammukhā karoti, vatthuvipannaṃ adhammakammanti ettha pana atthi kammaṃ sammukhākaraṇīyaṃ, atthi kammaṃ asammukhākaraṇīyaṃ. Tattha asammukhākaraṇīyaṃ nāma dūtenūpasampadā, pattanikkujjanaṃ, pattukkujjanaṃ, ummattakassa bhikkhuno ummattakasammuti, sekkhānaṃ kulānaṃ sekkhasammuti, channassa bhikkhuno brahmadaṇḍo, devadattassa pakāsanīyakammaṃ, apasādanīyaṃ dassentassa bhikkhuno bhikkhunisaṅghena kātabbaṃ avandiyakammanti aṭṭhavidhaṃ hoti. Idaṃ aṭṭhavidhampi kammaṃ asammukhā kataṃ sukataṃ hoti akuppaṃ, sesāni sabbakammāni sammukhā eva kātabbāni. Saṅghasammukhatā dhammasammukhatā vinayasammukhatā puggalasammukhatāti imaṃ catubbidhaṃ sammukhāvinayaṃ upanetvāva kātabbāni. Evaṃ katāni hi sukatāni honti, evaṃ akatāni panetāni imaṃ sammukhāvinayasaṅkhātaṃ vatthuṃ vinā katattā vatthuvipannāni nāma honti. Tena vuttaṃ ‘‘sammukhākaraṇīyaṃ kammaṃ asammukhā karoti, vatthuvipannaṃ adhammakamma’’nti. Paṭipucchākaraṇīyādīsupi paṭipucchādikaraṇameva vatthu, taṃ vatthuṃ vinā katattā tesampi vatthuvipannatā veditabbā. Apica ūnavīsativassaṃ vā antimavatthuṃ ajjhāpannapubbaṃ vā ekādasasu vā abhabbapuggalesu aññataraṃ upasampādentassapi vatthuvipannaṃ adhammakammaṃ hoti. Ayaṃ vatthuto kammavipattiyaṃ vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñattito vipattiyaṃ"
      },
      " pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vatthuṃ na parāmasatī"
      },
      "ti yassa upasampadādikammaṃ karoti, taṃ na parāmasati, tassa nāmaṃ na gaṇhāti. ‘‘Suṇātu me, bhante, saṅgho, ayaṃ dhammarakkhito āyasmato buddharakkhitassa upasampadāpekkho’’ti vattabbe ‘‘suṇātu me, bhante, saṅgho, āyasmato buddharakkhitassa upasampadāpekkho’’ti vadati. Evaṃ vatthuṃ na parāmasati."
    ],
    "innerText": "Ñattito vipattiyaṃ pana vatthuṃ na parāmasatīti yassa upasampadādikammaṃ karoti, taṃ na parāmasati, tassa nāmaṃ na gaṇhāti. ‘‘Suṇātu me, bhante, saṅgho, ayaṃ dhammarakkhito āyasmato buddharakkhitassa upasampadāpekkho’’ti vattabbe ‘‘suṇātu me, bhante, saṅgho, āyasmato buddharakkhitassa upasampadāpekkho’’ti vadati. Evaṃ vatthuṃ na parāmasati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅghaṃ na parāmasatī"
      },
      "ti saṅghassa nāmaṃ na gaṇhāti. ‘‘Suṇātu me, bhante, saṅgho, ayaṃ dhammarakkhito’’ti vattabbe ‘‘suṇātu me, bhante, ayaṃ dhammarakkhito’’ti vadati. Evaṃ saṅghaṃ na parāmasati."
    ],
    "innerText": "Saṅghaṃ na parāmasatīti saṅghassa nāmaṃ na gaṇhāti. ‘‘Suṇātu me, bhante, saṅgho, ayaṃ dhammarakkhito’’ti vattabbe ‘‘suṇātu me, bhante, ayaṃ dhammarakkhito’’ti vadati. Evaṃ saṅghaṃ na parāmasati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puggalaṃ na parāmasatī"
      },
      "ti yo upasampadāpekkhassa upajjhāyo, taṃ na parāmasati, tassa nāmaṃ na gaṇhāti. ‘‘Suṇātu me, bhante, saṅgho, ayaṃ dhammarakkhito āyasmato buddharakkhitassa upasampadāpekkho’’ti vattabbe ‘‘suṇātu me, bhante, saṅgho, ayaṃ dhammarakkhito upasampadāpekkho’’ti vadati. Evaṃ puggalaṃ na parāmasati."
    ],
    "innerText": "Puggalaṃ na parāmasatīti yo upasampadāpekkhassa upajjhāyo, taṃ na parāmasati, tassa nāmaṃ na gaṇhāti. ‘‘Suṇātu me, bhante, saṅgho, ayaṃ dhammarakkhito āyasmato buddharakkhitassa upasampadāpekkho’’ti vattabbe ‘‘suṇātu me, bhante, saṅgho, ayaṃ dhammarakkhito upasampadāpekkho’’ti vadati. Evaṃ puggalaṃ na parāmasati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñattiṃ na parāmasatī"
      },
      "ti sabbena sabbaṃ ñattiṃ na parāmasati, ñattidutiyakamme ñattiṃ aṭṭhapetvā dvikkhattuṃ kammavācāya eva anussāvanakammaṃ karoti, ñatticatutthakammepi ñattiṃ aṭṭhapetvā catukkhattuṃ kammavācāya eva anussāvanakammaṃ karoti. Evaṃ ñattiṃ na parāmasati."
    ],
    "innerText": "Ñattiṃ na parāmasatīti sabbena sabbaṃ ñattiṃ na parāmasati, ñattidutiyakamme ñattiṃ aṭṭhapetvā dvikkhattuṃ kammavācāya eva anussāvanakammaṃ karoti, ñatticatutthakammepi ñattiṃ aṭṭhapetvā catukkhattuṃ kammavācāya eva anussāvanakammaṃ karoti. Evaṃ ñattiṃ na parāmasati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pacchā vā ñattiṃ ṭhapetī"
      },
      "ti paṭhamaṃ kammavācāya anussāvanakammaṃ katvā ‘‘esā ñattī’’ti vatvā ‘‘khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti vadati. Evaṃ pacchā ñattiṃ ṭhapeti. Iti imehi pañcahākārehi ñattito kammāni vipajjanti."
    ],
    "innerText": "Pacchā vā ñattiṃ ṭhapetīti paṭhamaṃ kammavācāya anussāvanakammaṃ katvā ‘‘esā ñattī’’ti vatvā ‘‘khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti vadati. Evaṃ pacchā ñattiṃ ṭhapeti. Iti imehi pañcahākārehi ñattito kammāni vipajjanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anussāvanato vipattiyaṃ"
      },
      " pana vatthuādīni tāva vuttanayeneva veditabbāni. Evaṃ pana nesaṃ aparāmasanaṃ hoti – ‘‘suṇātu me, bhante, saṅgho’’ti paṭhamānussāvanāya vā ‘‘dutiyampi etamatthaṃ vadāmi…pe… tatiyampi etamatthaṃ vadāmi. Suṇātu me, bhante, saṅgho’’ti dutiyatatiyānussāvanāsu vā ‘‘ayaṃ dhammarakkhito āyasmato buddharakkhitassa upasampadāpekkho’’ti vattabbe ‘‘suṇātu me, bhante, saṅgho, āyasmato buddharakkhitassā’’ti vadanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vatthuṃ na parāmasati"
      },
      " nāma. ‘‘Suṇātu ",
      " me, bhante, saṅgho, ayaṃ dhammarakkhito’’ti vattabbe ‘‘suṇātu me, bhante, ayaṃ dhammarakkhito’’ti vadanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṅghaṃ na parāmasati"
      },
      " nāma. ‘‘Suṇātu me, bhante, saṅgho, ayaṃ dhammarakkhito āyasmato buddharakkhitassā’’ti vattabbe ‘‘suṇātu me, bhante, saṅgho, ayaṃ dhammarakkhito upasampadāpekkho’’ti vadanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "puggalaṃ na parāmasati"
      },
      " nāma."
    ],
    "innerText": "Anussāvanato vipattiyaṃ pana vatthuādīni tāva vuttanayeneva veditabbāni. Evaṃ pana nesaṃ aparāmasanaṃ hoti – ‘‘suṇātu me, bhante, saṅgho’’ti paṭhamānussāvanāya vā ‘‘dutiyampi etamatthaṃ vadāmi…pe… tatiyampi etamatthaṃ vadāmi. Suṇātu me, bhante, saṅgho’’ti dutiyatatiyānussāvanāsu vā ‘‘ayaṃ dhammarakkhito āyasmato buddharakkhitassa upasampadāpekkho’’ti vattabbe ‘‘suṇātu me, bhante, saṅgho, āyasmato buddharakkhitassā’’ti vadanto vatthuṃ na parāmasati nāma. ‘‘Suṇātu me, bhante, saṅgho, ayaṃ dhammarakkhito’’ti vattabbe ‘‘suṇātu me, bhante, ayaṃ dhammarakkhito’’ti vadanto saṅghaṃ na parāmasati nāma. ‘‘Suṇātu me, bhante, saṅgho, ayaṃ dhammarakkhito āyasmato buddharakkhitassā’’ti vattabbe ‘‘suṇātu me, bhante, saṅgho, ayaṃ dhammarakkhito upasampadāpekkho’’ti vadanto puggalaṃ na parāmasati nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sāvanaṃ hāpetī"
      },
      "ti sabbena sabbaṃ kammavācāya anussāvanaṃ na karoti, ñattidutiyakamme dvikkhattuṃ ñattimeva ṭhapeti, ñatticatutthakamme catukkhattuṃ ñattimeva ṭhapeti. Evaṃ sāvanaṃ hāpeti. Yopi ñattidutiyakamme ekaṃ ñattiṃ ṭhapetvā ekaṃ kammavācaṃ anussāvento akkharaṃ vā chaḍḍeti, padaṃ vā duruttaṃ karoti, ayampi sāvanaṃ hāpetiyeva. Ñatticatutthakamme pana ekaṃ ñattiṃ ṭhapetvā sakimeva vā dvikkhattuṃ vā kammavācāya anussāvanaṃ karontopi akkharaṃ vā padaṃ vā chaḍḍentopi duruttaṃ karontopi anussāvanaṃ hāpetiyevāti veditabbo."
    ],
    "innerText": "Sāvanaṃ hāpetīti sabbena sabbaṃ kammavācāya anussāvanaṃ na karoti, ñattidutiyakamme dvikkhattuṃ ñattimeva ṭhapeti, ñatticatutthakamme catukkhattuṃ ñattimeva ṭhapeti. Evaṃ sāvanaṃ hāpeti. Yopi ñattidutiyakamme ekaṃ ñattiṃ ṭhapetvā ekaṃ kammavācaṃ anussāvento akkharaṃ vā chaḍḍeti, padaṃ vā duruttaṃ karoti, ayampi sāvanaṃ hāpetiyeva. Ñatticatutthakamme pana ekaṃ ñattiṃ ṭhapetvā sakimeva vā dvikkhattuṃ vā kammavācāya anussāvanaṃ karontopi akkharaṃ vā padaṃ vā chaḍḍentopi duruttaṃ karontopi anussāvanaṃ hāpetiyevāti veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "252"
      },
      ". ‘‘Duruttaṃ karotī’’ti ettha pana ayaṃ vinicchayo. Yo hi aññasmiṃ akkhare vattabbe aññaṃ vadati, ayaṃ duruttaṃ karoti nāma. Tasmā kammavācaṃ karontena bhikkhunā yvāyaṃ –"
    ],
    "innerText": "252. ‘‘Duruttaṃ karotī’’ti ettha pana ayaṃ vinicchayo. Yo hi aññasmiṃ akkhare vattabbe aññaṃ vadati, ayaṃ duruttaṃ karoti nāma. Tasmā kammavācaṃ karontena bhikkhunā yvāyaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Sithilaṃ dhanitañca dīgharassaṃ, garukaṃ lahukañca niggahitaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sambandhaṃ vavatthitaṃ vimuttaṃ, dasadhā byañjanabuddhiyā pabhedo’’ti. –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Vutto, ayaṃ suṭṭhu upalakkhetabbo. Ettha hi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sithilaṃ"
      },
      " nāma pañcasu vaggesu paṭhamatatiyaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhanitaṃ"
      },
      " nāma tesveva dutiyacatutthaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dīgha"
      },
      "nti dīghena kālena vattabbaākārādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rassa"
      },
      "nti tato upaḍḍhakālena vattabbaakārādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Garuka"
      },
      "nti dīghameva, yaṃ vā ‘‘āyasmato buddharakkhitattherassa yassa nakkhamatī’’ti evaṃ saṃyogaparaṃ katvā vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lahuka"
      },
      "nti rassameva, yaṃ vā ‘‘āyasmato buddharakkhitattherassa yassa na khamatī’’ti evaṃ asaṃyogaparaṃ katvā vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Niggahita"
      },
      "nti yaṃ karaṇāni niggahetvā avissajjetvā avivaṭena mukhena sānunāsikaṃ katvā vattabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sambandha"
      },
      "nti yaṃ parapadena sambandhitvā ‘‘tuṇhissā’’ti vā ‘‘tuṇhassā’’ti vā vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vavatthita"
      },
      "nti yaṃ parapadena asambandhaṃ katvā vicchinditvā ‘‘tuṇhī assā’’ti vā ‘‘tuṇha assā’’ti vā vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vimutta"
      },
      "nti yaṃ karaṇāni aniggahetvā vissajjetvā vivaṭena mukhena anunāsikaṃ akatvā vuccati."
    ],
    "innerText": "Vutto, ayaṃ suṭṭhu upalakkhetabbo. Ettha hi sithilaṃ nāma pañcasu vaggesu paṭhamatatiyaṃ. Dhanitaṃ nāma tesveva dutiyacatutthaṃ. Dīghanti dīghena kālena vattabbaākārādi. Rassanti tato upaḍḍhakālena vattabbaakārādi. Garukanti dīghameva, yaṃ vā ‘‘āyasmato buddharakkhitattherassa yassa nakkhamatī’’ti evaṃ saṃyogaparaṃ katvā vuccati. Lahukanti rassameva, yaṃ vā ‘‘āyasmato buddharakkhitattherassa yassa na khamatī’’ti evaṃ asaṃyogaparaṃ katvā vuccati. Niggahitanti yaṃ karaṇāni niggahetvā avissajjetvā avivaṭena mukhena sānunāsikaṃ katvā vattabbaṃ. Sambandhanti yaṃ parapadena sambandhitvā ‘‘tuṇhissā’’ti vā ‘‘tuṇhassā’’ti vā vuccati. Vavatthitanti yaṃ parapadena asambandhaṃ katvā vicchinditvā ‘‘tuṇhī assā’’ti vā ‘‘tuṇha assā’’ti vā vuccati. Vimuttanti yaṃ karaṇāni aniggahetvā vissajjetvā vivaṭena mukhena anunāsikaṃ akatvā vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      " ‘‘suṇātu me’’ti vattabbe ta-kārassa tha-kāraṃ katvā ‘‘suṇāthu me’’ti vacanaṃ sithilassa dhanitakaraṇaṃ nāma, tathā ‘‘pattakallaṃ esā ñattī’’ti vattabbe ‘‘patthakallaṃ esā ñatthī’’tiādivacanaṃ. ‘‘Bhante saṅgho’’ti vattabbe bha-kāragha-kārānaṃ ba-kāraga-kāre katvā ‘‘bante saṃgo’’ti vacanaṃ dhanitassa sithilakaraṇaṃ nāma. ‘‘Suṇātu me’’ti vivaṭena mukhena vattabbe pana ‘‘suṇaṃtu me’’ti vā ‘‘esā ñattī’’ti vattabbe ‘‘esaṃ ñattī’’ti vā avivaṭena mukhena ananunāsikaṃ katvā vacanaṃ vimuttassa niggahitavacanaṃ nāma. ‘‘Pattakalla’’nti avivaṭena mukhena anunāsikaṃ katvā vattabbe ‘‘pattakallā’’ti vivaṭena mukhena anunāsikaṃ akatvā vacanaṃ niggahitassa vimuttavacanaṃ nāma. Iti sithile kattabbe dhanitaṃ, dhanite kattabbe sithilaṃ, vimutte kattabbe niggahitaṃ, niggahite kattabbe vimuttanti imāni cattāri byañjanāni antokammavācāya kammaṃ dūsenti. Evaṃ vadanto hi aññasmiṃ akkhare vattabbe aññaṃ vadati, duruttaṃ karotīti vuccati."
    ],
    "innerText": "Tattha ‘‘suṇātu me’’ti vattabbe ta-kārassa tha-kāraṃ katvā ‘‘suṇāthu me’’ti vacanaṃ sithilassa dhanitakaraṇaṃ nāma, tathā ‘‘pattakallaṃ esā ñattī’’ti vattabbe ‘‘patthakallaṃ esā ñatthī’’tiādivacanaṃ. ‘‘Bhante saṅgho’’ti vattabbe bha-kāragha-kārānaṃ ba-kāraga-kāre katvā ‘‘bante saṃgo’’ti vacanaṃ dhanitassa sithilakaraṇaṃ nāma. ‘‘Suṇātu me’’ti vivaṭena mukhena vattabbe pana ‘‘suṇaṃtu me’’ti vā ‘‘esā ñattī’’ti vattabbe ‘‘esaṃ ñattī’’ti vā avivaṭena mukhena ananunāsikaṃ katvā vacanaṃ vimuttassa niggahitavacanaṃ nāma. ‘‘Pattakalla’’nti avivaṭena mukhena anunāsikaṃ katvā vattabbe ‘‘pattakallā’’ti vivaṭena mukhena anunāsikaṃ akatvā vacanaṃ niggahitassa vimuttavacanaṃ nāma. Iti sithile kattabbe dhanitaṃ, dhanite kattabbe sithilaṃ, vimutte kattabbe niggahitaṃ, niggahite kattabbe vimuttanti imāni cattāri byañjanāni antokammavācāya kammaṃ dūsenti. Evaṃ vadanto hi aññasmiṃ akkhare vattabbe aññaṃ vadati, duruttaṃ karotīti vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Itaresu pana dīgharassādīsu chasu byañjanesu dīghaṭṭhāne dīghameva, rassaṭṭhāne rassamevāti evaṃ yathāṭhāne taṃ tadeva akkharaṃ bhāsantena anukkamāgataṃ paveṇiṃ avināsentena kammavācā kātabbā. Sace pana evaṃ akatvā dīghe vattabbe rassaṃ, rasse vā vattabbe dīghaṃ vadati, tathā garuke vattabbe lahukaṃ, lahuke vā vattabbe garukaṃ vadati, sambandhe vā pana vattabbe vavatthitaṃ, vavatthite vā vattabbe sambandhaṃ vadati, evaṃ vuttepi kammavācā na kuppati. Imāni hi cha byañjanāni kammaṃ na kopenti. Yaṃ pana suttantikattherā ‘‘da-kāro ta-kāramāpajjati, ta-kāro da-kāramāpajjati, ca-kāro ja-kāramāpajjati, ja-kāro ca-kāramāpajjati, ya-kāro ka-kāramāpajjati, ka-kāro ya-kāramāpajjati, tasmā da-kārādīsu vattabbesu ta-kārādivacanaṃ na virujjhatī’’ti vadanti, taṃ kammavācaṃ patvā na vaṭṭati. Tasmā vinayadharena neva da-kāro ta-kāro kātabbo…pe… na ka-kāro ya-kāro. Yathāpāḷiyā niruttiṃ sodhetvā dasavidhāya byañjananiruttiyā vuttadose pariharantena kammavācā kātabbā. Itarathā hi sāvanaṃ hāpeti nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akāle vā sāvetī"
      },
      "ti sāvanāya akāle anokāse ñattiṃ aṭṭhapetvā paṭhamaṃyeva anussāvanakammaṃ katvā pacchā ñattiṃ ṭhapeti. Iti imehi pañcahākārehi anussāvanato kammāni vipajjanti."
    ],
    "innerText": "Akāle vā sāvetīti sāvanāya akāle anokāse ñattiṃ aṭṭhapetvā paṭhamaṃyeva anussāvanakammaṃ katvā pacchā ñattiṃ ṭhapeti. Iti imehi pañcahākārehi anussāvanato kammāni vipajjanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "253"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sīmato"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vipattiyaṃ"
      },
      " pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atikhuddakasīmā"
      },
      " nāma yā ekavīsati bhikkhū na gaṇhāti ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kurundiyaṃ"
      },
      " pana ‘‘yattha ekavīsati bhikkhū nisīdituṃ na sakkontī’’ti vuttaṃ. Tasmā yā evarūpā sīmā, ayaṃ sammatāpi asammatā gāmakhettasadisāva hoti, tattha kataṃ kammaṃ kuppati. Esa nayo sesasīmāsupi. Ettha pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atimahatī"
      },
      " nāma yā kesaggamattenapi tiyojanaṃ atikkamitvā sammatā hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khaṇḍanimittā"
      },
      " nāma aghaṭitanimittā vuccati. Puratthimāya disāya nimittaṃ kittetvā anukkameneva dakkhiṇāya pacchimāya uttarāya disāya kittetvā puna puratthimāya disāya pubbakittitaṃ nimittaṃ paṭikittetvā ṭhapetuṃ vaṭṭati, evaṃ akhaṇḍanimittā hoti. Sace pana anukkamena āharitvā uttarāya disāya nimittaṃ kittetvā tattheva ṭhapeti, khaṇḍanimittā hoti. Aparāpi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "khaṇḍanimittā"
      },
      " nāma yā animittupagaṃ tacasārarukkhaṃ vā khāṇukaṃ vā paṃsupuñjaṃ vā vālukapuñjaṃ vā aññataraṃ antarā ekaṃ nimittaṃ katvā sammatā hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Chāyānimittā"
      },
      " nāma yā pabbatacchāyādīnaṃ yaṃ kiñci chāyaṃ nimittaṃ katvā sammatā hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Animittā"
      },
      " nāma yā sabbena sabbaṃ nimittāni akittetvā sammatā hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bahisīme ṭhito sīmaṃ sammannati"
      },
      " nāma nimittāni kittetvā nimittānaṃ bahi ṭhito sammannati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nadiyā samudde jātassare sīmaṃ sammannatī"
      },
      "ti etesu nadīādīsu yaṃ sammannati, sā evaṃ sammatāpi ‘‘sabbā, bhikkhave, nadī asīmā, sabbo samuddo asīmo, sabbo jātassaro asīmo’’ti (mahāva. 147) vacanato asammatāva hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sīmāya sīmaṃ sambhindatī"
      },
      "ti attano sīmāya paresaṃ sīmaṃ sambhindati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sīmāya sīmaṃ ajjhottharatī"
      },
      "ti attano sīmāya paresaṃ sīmaṃ ajjhottharati. Tattha yathā sambhedo ca ajjhottharaṇañca hoti, taṃ sabbaṃ sīmākathāyaṃ vuttameva. Iti imā ekādasapi sīmā asīmā gāmakhettasadisā eva, tāsu nisīditvā kataṃ kammaṃ kuppati. Tena vuttaṃ ‘‘imehi ekādasahi ākārehi sīmato kammāni vipajjantī’’ti."
    ],
    "innerText": "253.Sīmatovipattiyaṃ pana atikhuddakasīmā nāma yā ekavīsati bhikkhū na gaṇhāti . Kurundiyaṃ pana ‘‘yattha ekavīsati bhikkhū nisīdituṃ na sakkontī’’ti vuttaṃ. Tasmā yā evarūpā sīmā, ayaṃ sammatāpi asammatā gāmakhettasadisāva hoti, tattha kataṃ kammaṃ kuppati. Esa nayo sesasīmāsupi. Ettha pana atimahatī nāma yā kesaggamattenapi tiyojanaṃ atikkamitvā sammatā hoti. Khaṇḍanimittā nāma aghaṭitanimittā vuccati. Puratthimāya disāya nimittaṃ kittetvā anukkameneva dakkhiṇāya pacchimāya uttarāya disāya kittetvā puna puratthimāya disāya pubbakittitaṃ nimittaṃ paṭikittetvā ṭhapetuṃ vaṭṭati, evaṃ akhaṇḍanimittā hoti. Sace pana anukkamena āharitvā uttarāya disāya nimittaṃ kittetvā tattheva ṭhapeti, khaṇḍanimittā hoti. Aparāpi khaṇḍanimittā nāma yā animittupagaṃ tacasārarukkhaṃ vā khāṇukaṃ vā paṃsupuñjaṃ vā vālukapuñjaṃ vā aññataraṃ antarā ekaṃ nimittaṃ katvā sammatā hoti. Chāyānimittā nāma yā pabbatacchāyādīnaṃ yaṃ kiñci chāyaṃ nimittaṃ katvā sammatā hoti. Animittā nāma yā sabbena sabbaṃ nimittāni akittetvā sammatā hoti. Bahisīme ṭhito sīmaṃ sammannati nāma nimittāni kittetvā nimittānaṃ bahi ṭhito sammannati. Nadiyā samudde jātassare sīmaṃ sammannatīti etesu nadīādīsu yaṃ sammannati, sā evaṃ sammatāpi ‘‘sabbā, bhikkhave, nadī asīmā, sabbo samuddo asīmo, sabbo jātassaro asīmo’’ti (mahāva. 147) vacanato asammatāva hoti. Sīmāya sīmaṃ sambhindatīti attano sīmāya paresaṃ sīmaṃ sambhindati. Sīmāya sīmaṃ ajjhottharatīti attano sīmāya paresaṃ sīmaṃ ajjhottharati. Tattha yathā sambhedo ca ajjhottharaṇañca hoti, taṃ sabbaṃ sīmākathāyaṃ vuttameva. Iti imā ekādasapi sīmā asīmā gāmakhettasadisā eva, tāsu nisīditvā kataṃ kammaṃ kuppati. Tena vuttaṃ ‘‘imehi ekādasahi ākārehi sīmato kammāni vipajjantī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parisato kammavipattiyaṃ"
      },
      " pana kiñci anuttānaṃ nāma natthi. Yampi tattha kammappattachandārahalakkhaṇaṃ vattabbaṃ siyā, tampi parato ‘‘cattāro bhikkhū pakatattā kammappattā’’tiādinā nayena vuttameva. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pakatattā kammappattā"
      },
      "ti catuvaggakaraṇe kamme cattāro pakatattā anukkhittā anissāritā ",
      " parisuddhasīlā cattāro bhikkhū kammappattā kammassa arahā anucchavikā sāmino. Na tehi vinā taṃ kammaṃ karīyati, na tesaṃ chando vā pārisuddhi vā eti, avasesā pana sacepi sahassamattā honti, sace samānasaṃvāsakā sabbe chandārahāva honti, chandapārisuddhiṃ datvā āgacchantu vā mā vā, kammaṃ pana tiṭṭhati. Yassa pana saṅgho parivāsādikammaṃ karoti, so neva kammappatto nāpi chandāraho, apica yasmā ",
      " taṃ puggalaṃ vatthuṃ katvā saṅgho kammaṃ karoti, tasmā kammārahoti vuccati. Sesakammesupi eseva nayo."
    ],
    "innerText": "Parisato kammavipattiyaṃ pana kiñci anuttānaṃ nāma natthi. Yampi tattha kammappattachandārahalakkhaṇaṃ vattabbaṃ siyā, tampi parato ‘‘cattāro bhikkhū pakatattā kammappattā’’tiādinā nayena vuttameva. Tattha pakatattā kammappattāti catuvaggakaraṇe kamme cattāro pakatattā anukkhittā anissāritā parisuddhasīlā cattāro bhikkhū kammappattā kammassa arahā anucchavikā sāmino. Na tehi vinā taṃ kammaṃ karīyati, na tesaṃ chando vā pārisuddhi vā eti, avasesā pana sacepi sahassamattā honti, sace samānasaṃvāsakā sabbe chandārahāva honti, chandapārisuddhiṃ datvā āgacchantu vā mā vā, kammaṃ pana tiṭṭhati. Yassa pana saṅgho parivāsādikammaṃ karoti, so neva kammappatto nāpi chandāraho, apica yasmā taṃ puggalaṃ vatthuṃ katvā saṅgho kammaṃ karoti, tasmā kammārahoti vuccati. Sesakammesupi eseva nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "254"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Apalokanakammaṃ katamāni pañca ṭhānāni gacchati, osāraṇaṃ nissāraṇaṃ bhaṇḍukammaṃ brahmadaṇḍaṃ kammalakkhaṇaññeva pañcama"
      },
      "nti ettha ‘‘osāraṇaṃ nissāraṇa’’nti padasiliṭṭhatāyetaṃ vuttaṃ, paṭhamaṃ pana nissāraṇā hoti, pacchā osāraṇā. Tattha yā sā kaṇṭakassa sāmaṇerassa daṇḍakammanāsanā, sā nissāraṇāti veditabbā. Tasmā etarahi sacepi sāmaṇero buddhassa vā dhammassa vā saṅghassa vā avaṇṇaṃ bhaṇati, akappiyaṃ ‘‘kappiya’’nti dīpeti, micchādiṭṭhiko hoti, antaggāhikāya diṭṭhiyā samannāgato, so yāvatatiyaṃ nivāretvā taṃ laddhiṃ vissajjāpetabbo. No ce vissajjeti, saṅghaṃ sannipātetvā ‘‘vissajjehī’’ti vattabbo. No ce vissajjeti, byattena bhikkhunā apalokanakammaṃ katvā nissāretabbo. Evañca pana kammaṃ kātabbaṃ –"
    ],
    "innerText": "254.Apalokanakammaṃ katamāni pañca ṭhānāni gacchati, osāraṇaṃ nissāraṇaṃ bhaṇḍukammaṃ brahmadaṇḍaṃ kammalakkhaṇaññeva pañcamanti ettha ‘‘osāraṇaṃ nissāraṇa’’nti padasiliṭṭhatāyetaṃ vuttaṃ, paṭhamaṃ pana nissāraṇā hoti, pacchā osāraṇā. Tattha yā sā kaṇṭakassa sāmaṇerassa daṇḍakammanāsanā, sā nissāraṇāti veditabbā. Tasmā etarahi sacepi sāmaṇero buddhassa vā dhammassa vā saṅghassa vā avaṇṇaṃ bhaṇati, akappiyaṃ ‘‘kappiya’’nti dīpeti, micchādiṭṭhiko hoti, antaggāhikāya diṭṭhiyā samannāgato, so yāvatatiyaṃ nivāretvā taṃ laddhiṃ vissajjāpetabbo. No ce vissajjeti, saṅghaṃ sannipātetvā ‘‘vissajjehī’’ti vattabbo. No ce vissajjeti, byattena bhikkhunā apalokanakammaṃ katvā nissāretabbo. Evañca pana kammaṃ kātabbaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Saṅghaṃ, bhante, pucchāmi ‘ayaṃ itthannāmo sāmaṇero buddhassa dhammassa saṅghassa avaṇṇavādī micchādiṭṭhiko, yaṃ aññe sāmaṇerā labhanti dirattatirattaṃ bhikkhūhi saddhiṃ sahaseyyaṃ, tassā alābhāya nissāraṇā ruccati saṅghassā’ti. Dutiyampi. Tatiyampi bhante saṅghaṃ pucchāmi ‘ayaṃ itthannāmo sāmaṇero…pe… ruccati saṅghassā’ti, cara pire vinassā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "So aparena samayena ‘‘ahaṃ, bhante, bālatāya añāṇatāya alakkhikatāya evaṃ akāsiṃ, svāhaṃ saṅghaṃ khamāpemī’’ti khamāpento yāvatatiyaṃ yācāpetvā apalokanakammeneva osāretabbo, evañca pana osāretabbo. Saṅghamajjhe byattena bhikkhunā saṅghassa anumatiyā sāvetabbaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Saṅghaṃ ",
      ", bhante, pucchāmi ‘ayaṃ itthannāmo sāmaṇero buddhassa dhammassa saṅghassa avaṇṇavādī micchādiṭṭhiko, yaṃ aññe sāmaṇerā labhanti dirattatirattaṃ bhikkhūhi saddhiṃ sahaseyyaṃ, tassā alābhāya nissārito, svāyaṃ idāni sorato nivātavutti lajjidhammaṃ okkanto hirottappe patiṭṭhito katadaṇḍakammo accayaṃ deseti, imassa sāmaṇerassa yathā pure kāyasambhogasāmaggidānaṃ ruccati saṅghassā’’’ti."
    ],
    "innerText": "‘‘Saṅghaṃ , bhante, pucchāmi ‘ayaṃ itthannāmo sāmaṇero buddhassa dhammassa saṅghassa avaṇṇavādī micchādiṭṭhiko, yaṃ aññe sāmaṇerā labhanti dirattatirattaṃ bhikkhūhi saddhiṃ sahaseyyaṃ, tassā alābhāya nissārito, svāyaṃ idāni sorato nivātavutti lajjidhammaṃ okkanto hirottappe patiṭṭhito katadaṇḍakammo accayaṃ deseti, imassa sāmaṇerassa yathā pure kāyasambhogasāmaggidānaṃ ruccati saṅghassā’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Evaṃ ",
      " tikkhattuṃ vattabbaṃ. Evaṃ apalokanakammaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "osāraṇañca nissāraṇañca"
      },
      " gacchati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhaṇḍukammaṃ"
      },
      " pabbajjāvinicchayakathāya vuttameva."
    ],
    "innerText": "Evaṃ tikkhattuṃ vattabbaṃ. Evaṃ apalokanakammaṃ osāraṇañca nissāraṇañca gacchati. Bhaṇḍukammaṃ pabbajjāvinicchayakathāya vuttameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Brahmadaṇḍo"
      },
      " pana na kevalaṃ channasseva paññatto, yo aññopi bhikkhu mukharo hoti, bhikkhū duruttavacanehi ghaṭṭento khuṃsento vambhento viharati, tassapi dātabbo, evañca pana dātabbo. Saṅghamajjhe byattena bhikkhunā saṅghassa anumatiyā sāvetabbaṃ –"
    ],
    "innerText": "Brahmadaṇḍo pana na kevalaṃ channasseva paññatto, yo aññopi bhikkhu mukharo hoti, bhikkhū duruttavacanehi ghaṭṭento khuṃsento vambhento viharati, tassapi dātabbo, evañca pana dātabbo. Saṅghamajjhe byattena bhikkhunā saṅghassa anumatiyā sāvetabbaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Bhante, itthannāmo bhikkhu mukharo, bhikkhū duruttavacanehi ghaṭṭento khuṃsento vambhento viharati, so bhikkhu yaṃ iccheyya, taṃ vadeyya, bhikkhūhi itthannāmo bhikkhu neva vattabbo, na ovaditabbo na anusāsitabbo, saṅghaṃ, bhante, pucchāmi ‘itthannāmassa bhikkhuno brahmadaṇḍassa dānaṃ ruccati saṅghassā’ti. Dutiyampi pucchāmi…pe… tatiyampi pucchāmi ‘itthannāmassa bhikkhuno brahmadaṇḍassa dānaṃ ruccati saṅghassā’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tassa aparena samayena sammā vattitvā khamāpentassa brahmadaṇḍo paṭippassambhetabbo, evañca pana paṭippassambhetabbo. Byattena bhikkhunā saṅghamajjhe sāvetabbaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Bhante, bhikkhusaṅgho asukassa bhikkhuno brahmadaṇḍaṃ adāsi, so bhikkhu sorato nivātavutti lajjidhammaṃ okkanto hirottappe patiṭṭhito paṭisaṅkhā āyatiṃ saṃvare tiṭṭhati, saṅghaṃ, bhante, pucchāmi ‘tassa bhikkhuno brahmadaṇḍassa paṭippassaddhi ruccati saṅghassā’’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Evaṃ yāvatatiyaṃ vatvā apalokanakammeneva brahmadaṇḍo paṭippassambhetabboti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammalakkhaṇaññeva"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pañcama"
      },
      "nti yaṃ taṃ bhagavatā bhikkhunikkhandhake –"
    ],
    "innerText": "Kammalakkhaṇaññevapañcamanti yaṃ taṃ bhagavatā bhikkhunikkhandhake –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Tena kho pana samayena chabbaggiyā bhikkhū bhikkhuniyo kaddamodakena osiñcanti ‘appeva nāma amhesu sārajjeyyu’nti, kāyaṃ vivaritvā bhikkhunīnaṃ dassenti, ūruṃ vivaritvā bhikkhunīnaṃ dassenti, aṅgajātaṃ vivaritvā bhikkhunīnaṃ dassenti. Bhikkhuniyo obhāsenti, bhikkhunīhi saddhiṃ sampayojenti ‘appeva nāma amhesu sārajjeyyu’’’nti (cūḷava. 411) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Imesu ",
      " vatthūsu yesaṃ bhikkhūnaṃ dukkaṭaṃ paññapetvā ‘‘anujānāmi, bhikkhave, tassa bhikkhuno daṇḍakammaṃ kātu’’nti vatvā ‘‘kiṃ nu kho daṇḍakammaṃ kātabba’’nti saṃsaye uppanne ‘‘avandiyo so, bhikkhave, bhikkhu bhikkhunisaṅghena kātabbo’’ti evaṃ avandiyakammaṃ anuññātaṃ, taṃ kammalakkhaṇaññeva pañcamaṃ, imassa apalokanakammassa ṭhānaṃ hoti. Tassa hi kammaññeva lakkhaṇaṃ, na osāraṇādīni, tasmā kammalakkhaṇanti vuccati. Tassa karaṇaṃ paṭippassaddhiyā saddhiṃ vitthārato dassayissāma. Bhikkhunupassaye sannipatitassa bhikkhunisaṅghassa anumatiyā byattāya bhikkhuniyā sāvetabbaṃ –"
    ],
    "innerText": "Imesu vatthūsu yesaṃ bhikkhūnaṃ dukkaṭaṃ paññapetvā ‘‘anujānāmi, bhikkhave, tassa bhikkhuno daṇḍakammaṃ kātu’’nti vatvā ‘‘kiṃ nu kho daṇḍakammaṃ kātabba’’nti saṃsaye uppanne ‘‘avandiyo so, bhikkhave, bhikkhu bhikkhunisaṅghena kātabbo’’ti evaṃ avandiyakammaṃ anuññātaṃ, taṃ kammalakkhaṇaññeva pañcamaṃ, imassa apalokanakammassa ṭhānaṃ hoti. Tassa hi kammaññeva lakkhaṇaṃ, na osāraṇādīni, tasmā kammalakkhaṇanti vuccati. Tassa karaṇaṃ paṭippassaddhiyā saddhiṃ vitthārato dassayissāma. Bhikkhunupassaye sannipatitassa bhikkhunisaṅghassa anumatiyā byattāya bhikkhuniyā sāvetabbaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Ayye, asuko nāma ayyo bhikkhunīnaṃ apāsādikaṃ dasseti, etassa ayyassa avandiyakaraṇaṃ ruccatī’’ti bhikkhunisaṅghaṃ pucchāmi. ‘Ayye, asuko nāma ayyo bhikkhunīnaṃ apāsādikaṃ dasseti, etassa ayyassa avandiyakaraṇaṃ ruccatī’ti dutiyampi. Tatiyampi bhikkhunisaṅghaṃ pucchāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Evaṃ tikkhattuṃ sāvetvā apalokanakammena avandiyakammaṃ kātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tato paṭṭhāya so bhikkhu bhikkhunīhi na vanditabbo. Sace avandiyamāno hirottappaṃ paccupaṭṭhapetvā sammā vattati, tena bhikkhuniyo khamāpetabbā. Khamāpentana bhikkhunupassayaṃ agantvā vihāreyeva saṅghaṃ vā gaṇaṃ vā ekaṃ bhikkhuṃ vā upasaṅkamitvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā ‘‘ahaṃ, bhante, paṭisaṅkhā āyatiṃ saṃvare tiṭṭhāmi, na puna apāsādikaṃ dassessāmi, bhikkhunisaṅgho mayhaṃ khamatū’’ti khamāpetabbaṃ. Tena saṅghena vā gaṇena vā ekaṃ bhikkhuṃ pesetvā ekabhikkhunā vā sayameva gantvā bhikkhuniyo vattabbā ‘‘ayaṃ bhikkhu paṭisaṅkhā āyatiṃ saṃvare ",
      " ṭhito, iminā accayaṃ desetvā bhikkhunisaṅgho khamāpito, bhikkhunisaṅgho imaṃ bhikkhuṃ vandiyaṃ karotū’’ti. So vandiyo kātabbo, evañca pana kātabbo. Bhikkhunupassaye sannipatitassa bhikkhunisaṅghassa anumatiyā byattāya bhikkhuniyā sāvetabbaṃ –"
    ],
    "innerText": "Tato paṭṭhāya so bhikkhu bhikkhunīhi na vanditabbo. Sace avandiyamāno hirottappaṃ paccupaṭṭhapetvā sammā vattati, tena bhikkhuniyo khamāpetabbā. Khamāpentana bhikkhunupassayaṃ agantvā vihāreyeva saṅghaṃ vā gaṇaṃ vā ekaṃ bhikkhuṃ vā upasaṅkamitvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā ‘‘ahaṃ, bhante, paṭisaṅkhā āyatiṃ saṃvare tiṭṭhāmi, na puna apāsādikaṃ dassessāmi, bhikkhunisaṅgho mayhaṃ khamatū’’ti khamāpetabbaṃ. Tena saṅghena vā gaṇena vā ekaṃ bhikkhuṃ pesetvā ekabhikkhunā vā sayameva gantvā bhikkhuniyo vattabbā ‘‘ayaṃ bhikkhu paṭisaṅkhā āyatiṃ saṃvare ṭhito, iminā accayaṃ desetvā bhikkhunisaṅgho khamāpito, bhikkhunisaṅgho imaṃ bhikkhuṃ vandiyaṃ karotū’’ti. So vandiyo kātabbo, evañca pana kātabbo. Bhikkhunupassaye sannipatitassa bhikkhunisaṅghassa anumatiyā byattāya bhikkhuniyā sāvetabbaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Ayye, asuko nāma ayyo bhikkhunīnaṃ apāsādikaṃ dassetīti bhikkhunisaṅghena avandiyo kato, so lajjidhammaṃ okkamitvā paṭisaṅkhā āyatiṃ saṃvare ṭhito, accayaṃ desetvā bhikkhunisaṅghaṃ khamāpesi, tassa ayyassa vandiyakaraṇaṃ ruccatīti bhikkhunisaṅghaṃ pucchāmī’’ti –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Tikkhattuṃ ",
      " vattabbaṃ. Evaṃ apalokanakammeneva vandiyo kātabbo."
    ],
    "innerText": "Tikkhattuṃ vattabbaṃ. Evaṃ apalokanakammeneva vandiyo kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "255"
      },
      ". Ayaṃ panettha pāḷimuttakopi kammalakkhaṇavinicchayo (pari. aṭṭha. 495-496). Idañhi kammalakkhaṇaṃ nāma bhikkhunisaṅghamūlakaṃ paññattaṃ, bhikkhusaṅghassapi panetaṃ labbhatiyeva. Yañhi bhikkhusaṅgho salākabhattauposathaggesu ca apalokanakammaṃ karoti, etampi kammalakkhaṇameva. Acchinnacīvarajiṇṇacīvaranaṭṭhacīvarānañhi saṅghaṃ sannipātetvā byattena bhikkhunā yāvatatiyaṃ sāvetvā apalokanakammaṃ katvā cīvaraṃ dātuṃ vaṭṭati. Appamattakavissajjakena pana cīvaraṃ karontassa paccayabhājanīyakathāyaṃ vuttappabhedāni sūciādīni anapaloketvāpi dātabbāni. Tesaṃ dāne soyeva issaro, tato atirekaṃ dentena apaloketvā dātabbaṃ. Tato hi atirekadāne saṅgho sāmī. Gilānabhesajjampi tattha vuttappakāraṃ sayameva dātabbaṃ, atirekaṃ icchantassa apaloketvā dātabbaṃ. Yopi ca dubbalo vā chinniriyāpatho vā pacchinnabhikkhācārapatho vā mahāgilāno, tassa mahāvāsesu tatruppādato devasikaṃ nāḷi vā upaḍḍhanāḷi vā, ekadivasaṃyeva vā pañca vā dasa vā taṇḍulanāḷiyo dentena apalokanakammaṃ katvāva dātabbā. Pesalassa bhikkhuno tatruppādato iṇapalibodhampi bahussutassa saṅghabhāranittharakassa bhikkhuno anuṭṭhāpanīyasenāsanampi saṅghakiccaṃ karontānaṃ kappiyakārakādīnaṃ bhattavetanampi apalokanakammena dātuṃ vaṭṭati."
    ],
    "innerText": "255. Ayaṃ panettha pāḷimuttakopi kammalakkhaṇavinicchayo (pari. aṭṭha. 495-496). Idañhi kammalakkhaṇaṃ nāma bhikkhunisaṅghamūlakaṃ paññattaṃ, bhikkhusaṅghassapi panetaṃ labbhatiyeva. Yañhi bhikkhusaṅgho salākabhattauposathaggesu ca apalokanakammaṃ karoti, etampi kammalakkhaṇameva. Acchinnacīvarajiṇṇacīvaranaṭṭhacīvarānañhi saṅghaṃ sannipātetvā byattena bhikkhunā yāvatatiyaṃ sāvetvā apalokanakammaṃ katvā cīvaraṃ dātuṃ vaṭṭati. Appamattakavissajjakena pana cīvaraṃ karontassa paccayabhājanīyakathāyaṃ vuttappabhedāni sūciādīni anapaloketvāpi dātabbāni. Tesaṃ dāne soyeva issaro, tato atirekaṃ dentena apaloketvā dātabbaṃ. Tato hi atirekadāne saṅgho sāmī. Gilānabhesajjampi tattha vuttappakāraṃ sayameva dātabbaṃ, atirekaṃ icchantassa apaloketvā dātabbaṃ. Yopi ca dubbalo vā chinniriyāpatho vā pacchinnabhikkhācārapatho vā mahāgilāno, tassa mahāvāsesu tatruppādato devasikaṃ nāḷi vā upaḍḍhanāḷi vā, ekadivasaṃyeva vā pañca vā dasa vā taṇḍulanāḷiyo dentena apalokanakammaṃ katvāva dātabbā. Pesalassa bhikkhuno tatruppādato iṇapalibodhampi bahussutassa saṅghabhāranittharakassa bhikkhuno anuṭṭhāpanīyasenāsanampi saṅghakiccaṃ karontānaṃ kappiyakārakādīnaṃ bhattavetanampi apalokanakammena dātuṃ vaṭṭati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Catupaccayavasena ",
      " dinnatatruppādato saṅghikaṃ āvāsaṃ jaggāpetuṃ vaṭṭati, ‘‘ayaṃ bhikkhu issaravatāya vicāretī’’ti kathāpacchindanatthaṃ pana salākaggādīsu vā antarasannipāte vā saṅghaṃ āpucchitvāva jaggāpetabbo. Cīvarapiṇḍapātatthāya odissa dinnatatruppādatopi apaloketvā āvāso jaggāpetabbo, anapaloketvāpi vaṭṭati, ‘‘sūro vatāyaṃ bhikkhu cīvarapiṇḍapātatthāya odissa dinnato āvāsaṃ jaggāpetī’’ti evaṃ uppannakathāpacchedanatthaṃ pana apalokanakammameva katvā jaggāpetabbo."
    ],
    "innerText": "Catupaccayavasena dinnatatruppādato saṅghikaṃ āvāsaṃ jaggāpetuṃ vaṭṭati, ‘‘ayaṃ bhikkhu issaravatāya vicāretī’’ti kathāpacchindanatthaṃ pana salākaggādīsu vā antarasannipāte vā saṅghaṃ āpucchitvāva jaggāpetabbo. Cīvarapiṇḍapātatthāya odissa dinnatatruppādatopi apaloketvā āvāso jaggāpetabbo, anapaloketvāpi vaṭṭati, ‘‘sūro vatāyaṃ bhikkhu cīvarapiṇḍapātatthāya odissa dinnato āvāsaṃ jaggāpetī’’ti evaṃ uppannakathāpacchedanatthaṃ pana apalokanakammameva katvā jaggāpetabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Cetiye chattaṃ vā vedikaṃ vā bodhigharaṃ vā āsanagharaṃ vā akataṃ vā karontena jiṇṇaṃ vā paṭisaṅkharontena sudhākammaṃ vā karontena manusse samādapetvā kātuṃ vaṭṭati. Sace kārako natthi, cetiyassa upanikkhepato kāretabbaṃ. Upanikkhepepi asati apalokanakammaṃ katvā tatruppādato kāretabbaṃ, saṅghikenapi apaloketvā cetiyakiccaṃ kātuṃ vaṭṭati. Cetiyassa santakena apaloketvāpi saṅghikakiccaṃ na vaṭṭati, tāvakālikaṃ pana gahetvā paṭipākatikaṃ kātuṃ vaṭṭati. Cetiye sudhākammādīni karontehi pana bhikkhācārato vā saṅghato vā yāpanamattaṃ alabhantehi cetiyasantakato yāpanamattaṃ ",
      " gahetvā paribhuñjantehi vattaṃ kātuṃ vaṭṭati, ‘‘vattaṃ karomā’’ti macchamaṃsādīhi saṅghabhattaṃ kātuṃ na vaṭṭati."
    ],
    "innerText": "Cetiye chattaṃ vā vedikaṃ vā bodhigharaṃ vā āsanagharaṃ vā akataṃ vā karontena jiṇṇaṃ vā paṭisaṅkharontena sudhākammaṃ vā karontena manusse samādapetvā kātuṃ vaṭṭati. Sace kārako natthi, cetiyassa upanikkhepato kāretabbaṃ. Upanikkhepepi asati apalokanakammaṃ katvā tatruppādato kāretabbaṃ, saṅghikenapi apaloketvā cetiyakiccaṃ kātuṃ vaṭṭati. Cetiyassa santakena apaloketvāpi saṅghikakiccaṃ na vaṭṭati, tāvakālikaṃ pana gahetvā paṭipākatikaṃ kātuṃ vaṭṭati. Cetiye sudhākammādīni karontehi pana bhikkhācārato vā saṅghato vā yāpanamattaṃ alabhantehi cetiyasantakato yāpanamattaṃ gahetvā paribhuñjantehi vattaṃ kātuṃ vaṭṭati, ‘‘vattaṃ karomā’’ti macchamaṃsādīhi saṅghabhattaṃ kātuṃ na vaṭṭati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ye vihāre ropitā phalarukkhā saṅghena pariggahitā honti, jagganakammaṃ labhanti. Yesaṃ phalāni ghaṇṭiṃ paharitvā bhājetvā paribhuñjanti, tesu apalokanakammaṃ na kātabbaṃ. Ye pana apariggahitā, tesu apalokanakammaṃ kātabbaṃ, taṃ pana salākaggayāgaggabhattaggaantarasaaāpātesupi kātuṃ vaṭṭati, uposathagge pana vaṭṭatiyeva. Tattha hi anāgatānampi chandapārisuddhi āharīyati, tasmā taṃ suvisodhitaṃ hoti. Evañca pana kātabbaṃ, byattena bhikkhunā bhikkhusaṅghassa anumatiyā sāvetabbaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Bhante, yaṃ imasmiṃ vihāre antosīmāya saṅghasantakaṃ mūlatacapattaaṅkurapupphaphalakhādanīyādi atthi, taṃ sabbaṃ āgatāgatānaṃ bhikkhūnaṃ yathāsukhaṃ paribhuñjituṃ ruccatīti saṅghaṃ pucchāmī’’ti –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Tikkhattuṃ pucchitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Catūhi ",
      " pañcahi bhikkhūhi kataṃ sukatameva. Yasmimpi vihāre dve tayo janā vasanti, tehi nisīditvā katampi saṅghena katasadisameva. Yasmiṃ pana eko bhikkhu hoti, tena bhikkhunā uposathadivase pubbakaraṇapubbakiccaṃ katvā nisinnena katampi katikavattaṃ saṅghena katasadisameva hoti. Karontena pana phalavārena kātumpi cattāro māse cha māse ekasaṃvaccharanti evaṃ paricchinditvāpi aparicchinditvāpi kātuṃ vaṭṭati. Paricchinne yathāparicchedaṃ paribhuñjitvā puna kātabbaṃ. Aparicchinne yāva rukkhā dharanti, tāva vaṭṭati. Yepi tesaṃ rukkhānaṃ bījehi aññe rukkhā ropitā honti, tesampi sā eva katikā."
    ],
    "innerText": "Catūhi pañcahi bhikkhūhi kataṃ sukatameva. Yasmimpi vihāre dve tayo janā vasanti, tehi nisīditvā katampi saṅghena katasadisameva. Yasmiṃ pana eko bhikkhu hoti, tena bhikkhunā uposathadivase pubbakaraṇapubbakiccaṃ katvā nisinnena katampi katikavattaṃ saṅghena katasadisameva hoti. Karontena pana phalavārena kātumpi cattāro māse cha māse ekasaṃvaccharanti evaṃ paricchinditvāpi aparicchinditvāpi kātuṃ vaṭṭati. Paricchinne yathāparicchedaṃ paribhuñjitvā puna kātabbaṃ. Aparicchinne yāva rukkhā dharanti, tāva vaṭṭati. Yepi tesaṃ rukkhānaṃ bījehi aññe rukkhā ropitā honti, tesampi sā eva katikā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sace pana aññasmiṃ vihāre ropitā honti, tesaṃ yattha ropitā, tasmiṃyeva vihāre saṅgho sāmī. Yepi aññato bījāni āharitvā purimavihāre pacchā ropitā, tesu aññā katikā kātabbā, katikāya katāya puggalikaṭṭhāne tiṭṭhanti, yathāsukhaṃ phalādīni paribhuñjituṃ vaṭṭanti. Sace panettha taṃ taṃ okāsaṃ parikkhipitvā pariveṇāni katvā jagganti, tesaṃ bhikkhūnaṃ puggalikaṭṭhāne tiṭṭhanti, aññe paribhuñjituṃ na labhanti. Tehi pana saṅghassa ",
      " dasamabhāgaṃ datvā paribhuñjitabbāni. Yopi majjhevihāre rukkhaṃ sākhāhi parivāretvā rakkhati, tassapi eseva nayo."
    ],
    "innerText": "Sace pana aññasmiṃ vihāre ropitā honti, tesaṃ yattha ropitā, tasmiṃyeva vihāre saṅgho sāmī. Yepi aññato bījāni āharitvā purimavihāre pacchā ropitā, tesu aññā katikā kātabbā, katikāya katāya puggalikaṭṭhāne tiṭṭhanti, yathāsukhaṃ phalādīni paribhuñjituṃ vaṭṭanti. Sace panettha taṃ taṃ okāsaṃ parikkhipitvā pariveṇāni katvā jagganti, tesaṃ bhikkhūnaṃ puggalikaṭṭhāne tiṭṭhanti, aññe paribhuñjituṃ na labhanti. Tehi pana saṅghassa dasamabhāgaṃ datvā paribhuñjitabbāni. Yopi majjhevihāre rukkhaṃ sākhāhi parivāretvā rakkhati, tassapi eseva nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Porāṇakavihāraṃ gatassa sambhāvanīyabhikkhuno ‘‘thero āgato’’ti phalāphalaṃ āharanti, sace tattha mūle sabbapariyattidharo bahussutabhikkhu vihāsi, ‘‘addhā ettha dīghā katikā katā bhavissatī’’ti nikkukkuccena paribhuñjitabbaṃ. Vihāre phalāphalaṃ piṇḍapātikānampi vaṭṭati, dhutaṅgaṃ na kopeti. Sāmaṇerā attano ācariyupajjhāyānaṃ bahūni phalāni denti, aññe bhikkhū alabhantā khiyyanti, khiyyanamattameva taṃ hoti. Sace dubbhikkhaṃ hoti, ekaṃ panasarukkhaṃ nissāya saṭṭhipi janā jīvanti, tādise kāle sabbesaṃ saṅgahakaraṇatthāya bhājetvā khāditabbaṃ. Ayaṃ sāmīci. Yāva pana katikavattaṃ na paṭippassambhati, tāva tehi khāyitaṃ sukhāyitameva. Kadā pana katikavattaṃ paṭippassambhati? Yadā samaggo saṅgho sannipatitvā ‘‘ito paṭṭhāya bhājetvā khādantū’’ti sāvebhi, ekabhikkhuke pana vihāre etena sāvitepi purimakatikā paṭippassambhatiyeva ",
      ". Sace paṭippassaddhāya katikāya sāmaṇerā neva rukkhato pātenti, na bhūmito gahetvā bhikkhūnaṃ denti, patitaphalāni pādehi paharantā vicaranti, tesaṃ dasamabhāgato paṭṭhāya yāva upaḍḍhaphalabhāgena phātikammaṃ kātabbaṃ. Addhā phātikammalobhena āharitvā dassenti, puna subhikkhe jāte kappiyakārakesu āgantvā sākhāparivārādīni katvā rukkhe rakkhantesu sāmaṇerānaṃ phātikammaṃ na kātabbaṃ, bhājetvā paribhuñjitabbaṃ."
    ],
    "innerText": "Porāṇakavihāraṃ gatassa sambhāvanīyabhikkhuno ‘‘thero āgato’’ti phalāphalaṃ āharanti, sace tattha mūle sabbapariyattidharo bahussutabhikkhu vihāsi, ‘‘addhā ettha dīghā katikā katā bhavissatī’’ti nikkukkuccena paribhuñjitabbaṃ. Vihāre phalāphalaṃ piṇḍapātikānampi vaṭṭati, dhutaṅgaṃ na kopeti. Sāmaṇerā attano ācariyupajjhāyānaṃ bahūni phalāni denti, aññe bhikkhū alabhantā khiyyanti, khiyyanamattameva taṃ hoti. Sace dubbhikkhaṃ hoti, ekaṃ panasarukkhaṃ nissāya saṭṭhipi janā jīvanti, tādise kāle sabbesaṃ saṅgahakaraṇatthāya bhājetvā khāditabbaṃ. Ayaṃ sāmīci. Yāva pana katikavattaṃ na paṭippassambhati, tāva tehi khāyitaṃ sukhāyitameva. Kadā pana katikavattaṃ paṭippassambhati? Yadā samaggo saṅgho sannipatitvā ‘‘ito paṭṭhāya bhājetvā khādantū’’ti sāvebhi, ekabhikkhuke pana vihāre etena sāvitepi purimakatikā paṭippassambhatiyeva . Sace paṭippassaddhāya katikāya sāmaṇerā neva rukkhato pātenti, na bhūmito gahetvā bhikkhūnaṃ denti, patitaphalāni pādehi paharantā vicaranti, tesaṃ dasamabhāgato paṭṭhāya yāva upaḍḍhaphalabhāgena phātikammaṃ kātabbaṃ. Addhā phātikammalobhena āharitvā dassenti, puna subhikkhe jāte kappiyakārakesu āgantvā sākhāparivārādīni katvā rukkhe rakkhantesu sāmaṇerānaṃ phātikammaṃ na kātabbaṃ, bhājetvā paribhuñjitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Vihāre phalāphalaṃ atthī’’ti sāmantagāmehi manussā gilānānaṃ vā gabbhinīnaṃ vā atthāya āgantvā ‘‘ekaṃ nāḷikeraṃ detha, ambaṃ detha, labujaṃ dethā’’ti yācanti, dātabbaṃ, na dātabbanti? Dātabbaṃ. Adīyamāne hi te domanassikā honti. Dentena pana saṅghaṃ sannipātetvā yāvatatiyaṃ sāvetvā apalokanakammaṃ katvāva dātabbaṃ, katikavattaṃ vā katvā ṭhapetabbaṃ, evañca pana kātabbaṃ. Byattena bhikkhunā saṅghassa anumatiyā sāvetabbaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Sāmantagāmehi manussā āgantvā gilānādīnaṃ atthāya phalāphalaṃ yācanti, dve nāḷikerāni dve tālaphalāni dve panasāni pañca ambāni pañca kadaliphalāni gaṇhantānaṃ anivāraṇaṃ, asukarukkhato ca asukarukkhato ca phalaṃ gaṇhantānaṃ anivāraṇaṃ ruccati bhikkhusaṅghassā’’ti –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Tikkhattuṃ vattabbaṃ. Tato paṭṭhāya gilānādīnaṃ nāmaṃ gahetvā yācantā ‘‘gaṇhathā’’ti na vattabbā ",
      ", vattaṃ pana ācikkhitabbaṃ ‘‘nāḷikerādīni iminā nāma paricchedena gaṇhantānaṃ asukarukkhato ca asukarukkhato ca phalaṃ gaṇhantānaṃ anivāraṇaṃ kata’’nti. Anuvicaritvā pana ‘‘ayaṃ madhuraphalo ambo, ito gaṇhathā’’tipi na vattabbā."
    ],
    "innerText": "Tikkhattuṃ vattabbaṃ. Tato paṭṭhāya gilānādīnaṃ nāmaṃ gahetvā yācantā ‘‘gaṇhathā’’ti na vattabbā , vattaṃ pana ācikkhitabbaṃ ‘‘nāḷikerādīni iminā nāma paricchedena gaṇhantānaṃ asukarukkhato ca asukarukkhato ca phalaṃ gaṇhantānaṃ anivāraṇaṃ kata’’nti. Anuvicaritvā pana ‘‘ayaṃ madhuraphalo ambo, ito gaṇhathā’’tipi na vattabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Phalabhājanakāle pana āgatānaṃ sammatena upaḍḍhabhāgo dātabbo, asammatena apaloketvā dātabbaṃ. Khīṇaparibbayo vā maggagamiyasatthavāho vā añño vā issaro āgantvā yācati, apaloketvāva dātabbaṃ, balakkārena gahetvā khādanto na vāretabbo. Kuddho hi so rukkhepi chindeyya, aññampi anatthaṃ kareyya. Puggalikapariveṇaṃ āgantvā gilānassa nāmena yācanto ‘‘amhehi chāyādīnaṃ atthāya ",
      " ropitaṃ, sace atthi, tumhe jānāthā’’ti vattabbo. Yadi pana phalabharitāva rukkhā honti, kaṇṭake bandhitvā phalavārena gaṇhanti, apaccāsīsantena hutvā dātabbaṃ, balakkārena gaṇhanto na vāretabbo. Pubbe vuttamevettha kāraṇaṃ."
    ],
    "innerText": "Phalabhājanakāle pana āgatānaṃ sammatena upaḍḍhabhāgo dātabbo, asammatena apaloketvā dātabbaṃ. Khīṇaparibbayo vā maggagamiyasatthavāho vā añño vā issaro āgantvā yācati, apaloketvāva dātabbaṃ, balakkārena gahetvā khādanto na vāretabbo. Kuddho hi so rukkhepi chindeyya, aññampi anatthaṃ kareyya. Puggalikapariveṇaṃ āgantvā gilānassa nāmena yācanto ‘‘amhehi chāyādīnaṃ atthāya ropitaṃ, sace atthi, tumhe jānāthā’’ti vattabbo. Yadi pana phalabharitāva rukkhā honti, kaṇṭake bandhitvā phalavārena gaṇhanti, apaccāsīsantena hutvā dātabbaṃ, balakkārena gaṇhanto na vāretabbo. Pubbe vuttamevettha kāraṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Saṅghassa phalārāmo hoti, paṭijagganaṃ na labhati. Sace taṃ koci vattasīsena jaggati, saṅghasseva hoti. Athāpi kassaci paṭibalassa bhikkhuno ‘‘imaṃ sappurisa jaggitvā dehī’’ti saṅgho bhāraṃ karoti, so ce vattasīsena jaggati, evampi saṅghasseva hoti. Phātikammaṃ paccāsīsantassa pana tatiyabhāgena vā upaḍḍhabhāgena vā phātikammaṃ kātabbaṃ. ‘‘Bhāriyaṃ kamma’’nti vatvā ettakena anicchanto pana ‘‘sabbaṃ taveva santakaṃ katvā mūlabhāgaṃ dasamabhāgamattaṃ datvā jaggāhī’’tipi vattabbo, garubhaṇḍattā pana na mūlacchejjavasena dātabbaṃ. So mūlabhāgaṃ datvā khādanto akatāvāsaṃ vā katvā katāvāsaṃ vā jaggitvā nissitakānaṃ ārāmaṃ niyyāteti, tehipi mūlabhāgo dātabbova."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yadā pana bhikkhū sayaṃ jaggituṃ pahonti, atha tesaṃ jaggituṃ na dātabbaṃ, jaggitakāle pana na vāretabbā, jagganakāleyeva vāretabbā. ‘‘Bahu tumhehi khāyitaṃ, idāni mā jaggittha, bhikkhusaṅghoyeva jaggissatī’’ti vattabbaṃ. Sace pana neva vattasīsena jagganto atthi, na phātikammena, na saṅgho jaggituṃ pahoti, eko anāpucchitvāva jaggitvā phātikammaṃ vaḍḍhetvā paccāsīsati, apalokanakammena phātikammaṃ vaḍḍhetvāva dātabbaṃ. Iti imaṃ sabbampi kammalakkhaṇameva hoti. Apalokanakammaṃ imāni pañca ṭhānāni gacchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "256"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñattikammaṭṭhānabhede"
      },
      " pana (pari. aṭṭha. 495-496) –"
    ],
    "innerText": "256.Ñattikammaṭṭhānabhede pana (pari. aṭṭha. 495-496) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Suṇātu ",
      " me, bhante, saṅgho, itthannāmo itthannāmassa āyasmato upasampadāpekkho, anusiṭṭho so mayā, yadi saṅghassa pattakallaṃ, itthannāmo āgaccheyya, ‘āgacchāhī’ti vattabbo’’ti –"
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho, itthannāmo itthannāmassa āyasmato upasampadāpekkho, anusiṭṭho so mayā, yadi saṅghassa pattakallaṃ, itthannāmo āgaccheyya, ‘āgacchāhī’ti vattabbo’’ti –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Evaṃ upasampadāpekkhassa osāraṇā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "osāraṇā"
      },
      " nāma."
    ],
    "innerText": "Evaṃ upasampadāpekkhassa osāraṇā osāraṇā nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Suṇantu ",
      " me āyasmantā, ayaṃ itthannāmo bhikkhu dhammakathiko, imassa neva suttaṃ āgacchati, no suttavibhaṅgo, so atthaṃ asallakkhetvā byañjanacchāyāya atthaṃ paṭibāhati, yadāyasmantānaṃ pattakallaṃ, itthannāmaṃ bhikkhuṃ vuṭṭhāpetvā avasesā imaṃ adhikaraṇaṃ vūpasameyyāmā’’ti –"
    ],
    "innerText": "‘‘Suṇantu me āyasmantā, ayaṃ itthannāmo bhikkhu dhammakathiko, imassa neva suttaṃ āgacchati, no suttavibhaṅgo, so atthaṃ asallakkhetvā byañjanacchāyāya atthaṃ paṭibāhati, yadāyasmantānaṃ pattakallaṃ, itthannāmaṃ bhikkhuṃ vuṭṭhāpetvā avasesā imaṃ adhikaraṇaṃ vūpasameyyāmā’’ti –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Evaṃ ubbāhikavinicchaye dhammakathikassa bhikkhuno nissāraṇā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nissāraṇā"
      },
      " nāma."
    ],
    "innerText": "Evaṃ ubbāhikavinicchaye dhammakathikassa bhikkhuno nissāraṇā nissāraṇā nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Suṇātu me, bhante, saṅgho, ajjuposatho pannaraso, yadi saṅghassa pattakallaṃ, saṅgho uposathaṃ kareyyā’’ti –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Evaṃ uposathakammavasena ṭhapitā ñatti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uposatho"
      },
      " nāma."
    ],
    "innerText": "Evaṃ uposathakammavasena ṭhapitā ñatti uposatho nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Suṇātu me, bhante, saṅgho, ajja pavāraṇā pannarasī, yadi saṅghassa pattakallaṃ, saṅgho pavāreyyā’’ti –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Evaṃ pavāraṇakammavasena ṭhapitā ñatti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pavāraṇā"
      },
      " nāma."
    ],
    "innerText": "Evaṃ pavāraṇakammavasena ṭhapitā ñatti pavāraṇā nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Suṇātu me, bhante, saṅgho, itthannāmo itthannāmassa āyasmato upasampadāpekkho, yadi saṅghassa pattakallaṃ, ahaṃ itthannāmaṃ anusāseyya’’nti, ‘‘yadi saṅghassa pattakallaṃ, itthannāmo itthannāmaṃ anusāseyyā’’ti, ‘‘yadi saṅghassa pattakallaṃ, ahaṃ itthannāmaṃ antarāyike dhamme puccheyya’’nti, ‘‘yadi saṅghassa pattakallaṃ, itthannāmo itthannāmaṃ antarāyike dhamme puccheyyā’’ti, ‘‘yadi saṅghassa pattakallaṃ, ahaṃ itthannāmaṃ vinayaṃ puccheyya’’nti, ‘‘yadi saṅghassa pattakallaṃ, itthannāmo itthannāmaṃ vinayaṃ puccheyyā’’ti, ‘‘yadi ",
      " saṅghassa pattakallaṃ, ahaṃ itthannāmena vinayaṃ puṭṭho vissajjeyya’’nti, ‘‘yadi saṅghassa pattakallaṃ, itthannāmo itthannāmena vinayaṃ puṭṭho vissajjeyyā’’ti –"
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho, itthannāmo itthannāmassa āyasmato upasampadāpekkho, yadi saṅghassa pattakallaṃ, ahaṃ itthannāmaṃ anusāseyya’’nti, ‘‘yadi saṅghassa pattakallaṃ, itthannāmo itthannāmaṃ anusāseyyā’’ti, ‘‘yadi saṅghassa pattakallaṃ, ahaṃ itthannāmaṃ antarāyike dhamme puccheyya’’nti, ‘‘yadi saṅghassa pattakallaṃ, itthannāmo itthannāmaṃ antarāyike dhamme puccheyyā’’ti, ‘‘yadi saṅghassa pattakallaṃ, ahaṃ itthannāmaṃ vinayaṃ puccheyya’’nti, ‘‘yadi saṅghassa pattakallaṃ, itthannāmo itthannāmaṃ vinayaṃ puccheyyā’’ti, ‘‘yadi saṅghassa pattakallaṃ, ahaṃ itthannāmena vinayaṃ puṭṭho vissajjeyya’’nti, ‘‘yadi saṅghassa pattakallaṃ, itthannāmo itthannāmena vinayaṃ puṭṭho vissajjeyyā’’ti –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Evaṃ attānaṃ vā paraṃ vā sammannituṃ ṭhapitā ñatti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammuti"
      },
      " nāma."
    ],
    "innerText": "Evaṃ attānaṃ vā paraṃ vā sammannituṃ ṭhapitā ñatti sammuti nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Suṇātu me, bhante, saṅgho, idaṃ cīvaraṃ itthannāmassa bhikkhuno nissaggiyaṃ saṅghassa nissaṭṭhaṃ, yadi saṅghassa pattakallaṃ, saṅgho imaṃ cīvaraṃ itthannāmassa bhikkhuno dadeyyā’’ti, ‘‘yadāyasmantānaṃ ",
      " pattakallaṃ, āyasmantā imaṃ cīvaraṃ itthannāmassa bhikkhuno dadeyyu’’nti –"
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho, idaṃ cīvaraṃ itthannāmassa bhikkhuno nissaggiyaṃ saṅghassa nissaṭṭhaṃ, yadi saṅghassa pattakallaṃ, saṅgho imaṃ cīvaraṃ itthannāmassa bhikkhuno dadeyyā’’ti, ‘‘yadāyasmantānaṃ pattakallaṃ, āyasmantā imaṃ cīvaraṃ itthannāmassa bhikkhuno dadeyyu’’nti –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Evaṃ nissaṭṭhacīvarapattādīnaṃ dānaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dānaṃ"
      },
      " nāma."
    ],
    "innerText": "Evaṃ nissaṭṭhacīvarapattādīnaṃ dānaṃ dānaṃ nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Suṇātu me, bhante, saṅgho, ayaṃ itthannāmo bhikkhu āpattiṃ sarati vivarati uttāniṃ karoti deseti, yadi saṅghassa pattakallaṃ, ahaṃ itthannāmassa bhikkhuno āpattiṃ paṭiggaṇheyya’’nti, ‘‘yadāyasmantānaṃ pattakallaṃ, ahaṃ itthannāmassa bhikkhuno āpattiṃ paṭiggaṇheyya’’nti, tena vattabbo ‘‘passasī’’ti. Āma, passāmīti. ‘‘Āyatiṃ saṃvareyyāsī’’ti –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Evaṃ āpattipaṭiggaho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭiggaho"
      },
      " nāma."
    ],
    "innerText": "Evaṃ āpattipaṭiggaho paṭiggaho nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Suṇantu me āyasmantā āvāsikā, yadāyasmantānaṃ pattakallaṃ, idāni uposathaṃ kareyyāma, pātimokkhaṃ uddiseyyāma, āgame kāḷe pavāreyyāmā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Te ce, bhikkhave, bhikkhū bhaṇḍanakārakā kalahakārakā vivādakārakā bhassakārakā saṅghe adhikaraṇakārakā taṃ kāḷaṃ anuvaseyyuṃ, āvāsikena bhikkhunā byattena paṭibalena āvāsikā bhikkhū ñāpetabbā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Suṇantu me āyasmantā āvāsikā, yadāyasmantānaṃ pattakallaṃ, idāni uposathaṃ kareyyāma, pātimokkhaṃ uddiseyyāma, āgame juṇhe pavāreyyāmā’’ti –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Evaṃ ",
      " katā pavāraṇāpaccukkaḍḍhanā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paccukkaḍḍhanā"
      },
      " nāma."
    ],
    "innerText": "Evaṃ katā pavāraṇāpaccukkaḍḍhanā paccukkaḍḍhanā nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sabbeheva ekajjhaṃ sannipatitabbaṃ, sannipatitvā byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Suṇātu me, bhante, saṅgho, amhākaṃ bhaṇḍanajātānaṃ kalahajātānaṃ vivādāpannānaṃ viharataṃ bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ, sace mayaṃ imāhi āpattīhi aññamaññaṃ kāressāma, siyāpi taṃ adhikaraṇaṃ kakkhaḷattāya vāḷattāya bhedāya saṃvatteyya, yadi saṅghassa pattakallaṃ, saṅgho ",
      " imaṃ adhikaraṇaṃ tiṇavatthārakena vūpasameyya ṭhapetvā thullavajjaṃ ṭhapetvā gihippaṭisaṃyutta’’nti –"
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho, amhākaṃ bhaṇḍanajātānaṃ kalahajātānaṃ vivādāpannānaṃ viharataṃ bahuṃ assāmaṇakaṃ ajjhāciṇṇaṃ bhāsitaparikkantaṃ, sace mayaṃ imāhi āpattīhi aññamaññaṃ kāressāma, siyāpi taṃ adhikaraṇaṃ kakkhaḷattāya vāḷattāya bhedāya saṃvatteyya, yadi saṅghassa pattakallaṃ, saṅgho imaṃ adhikaraṇaṃ tiṇavatthārakena vūpasameyya ṭhapetvā thullavajjaṃ ṭhapetvā gihippaṭisaṃyutta’’nti –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "children": [
      "Evaṃ tiṇavatthārakasamathena katvā sabbapaṭhamā sabbasaṅgāhikañatti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kammalakkhaṇaṃ"
      },
      " nāma."
    ],
    "innerText": "Evaṃ tiṇavatthārakasamathena katvā sabbapaṭhamā sabbasaṅgāhikañatti kammalakkhaṇaṃ nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tathā tato parā ekekasmiṃ pakkhe ekekaṃ katvā dve ñattiyo. Iti yathāvuttappabhedaṃ osāraṇaṃ nissāraṇaṃ…pe… kammalakkhaṇaññeva navamanti ñattikammaṃ imāni nava ṭhānāni gacchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "257"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñattidutiyakammaṭṭhānabhede"
      },
      " (pari. aṭṭha. 495-496) pana vaḍḍhassa licchavino pattanikkujjanavasena khandhake vuttā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nissāraṇā,"
      },
      " tasseva pattukkujjanavasena khandhake vuttā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "osāraṇā"
      },
      " ca veditabbā. Vuttañhetaṃ (cūḷava. 265-266) –"
    ],
    "innerText": "257.Ñattidutiyakammaṭṭhānabhede (pari. aṭṭha. 495-496) pana vaḍḍhassa licchavino pattanikkujjanavasena khandhake vuttā nissāraṇā, tasseva pattukkujjanavasena khandhake vuttā osāraṇā ca veditabbā. Vuttañhetaṃ (cūḷava. 265-266) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Aṭṭhahi, bhikkhave, aṅgehi samannāgatassa upāsakassa patto nikkujjitabbo. Bhikkhūnaṃ alābhāya parisakkati, bhikkhūnaṃ anatthāya parisakkati, bhikkhūnaṃ avāsāya parisakkati, bhikkhū akkosati paribhāsati, bhikkhū bhikkhūhi bhedeti, buddhassa avaṇṇaṃ bhāsati, dhammassa avaṇṇaṃ bhāsati, saṅghassa avaṇṇaṃ bhāsati. Anujānāmi, bhikkhave, imehi aṭṭhahi aṅgehi samannāgatassa upāsakassa pattaṃ nikkujjituṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "Evañca pana bhikkhave nikkujjitabbo. Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Suṇātu ",
      " me, bhante, saṅgho, vaḍḍho licchavī āyasmantaṃ dabbaṃ mallaputtaṃ amūlikāya sīlavipattiyā anuddhaṃseti, yadi saṅghassa pattakallaṃ, saṅgho vaḍḍhassa licchavissa pattaṃ nikkujjeyya, asambhogaṃ saṅghena kareyya, esā ñatti."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho, vaḍḍho licchavī āyasmantaṃ dabbaṃ mallaputtaṃ amūlikāya sīlavipattiyā anuddhaṃseti, yadi saṅghassa pattakallaṃ, saṅgho vaḍḍhassa licchavissa pattaṃ nikkujjeyya, asambhogaṃ saṅghena kareyya, esā ñatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Suṇātu me, bhante, saṅgho, vaḍḍho licchavī āyasmantaṃ dabbaṃ mallaputtaṃ amūlikāya sīlavipattiyā anuddhaṃseti, saṅgho vaḍḍhassa licchavissa pattaṃ nikkujjati, asambhogaṃ saṅghena karoti, yassāyasmato khamati vaḍḍhassa licchavissa pattassa nikkujjanā asambhogaṃ ",
      " saṅghena karaṇaṃ, so tuṇhassa. Yassa nakkhamati, so bhāseyya."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho, vaḍḍho licchavī āyasmantaṃ dabbaṃ mallaputtaṃ amūlikāya sīlavipattiyā anuddhaṃseti, saṅgho vaḍḍhassa licchavissa pattaṃ nikkujjati, asambhogaṃ saṅghena karoti, yassāyasmato khamati vaḍḍhassa licchavissa pattassa nikkujjanā asambhogaṃ saṅghena karaṇaṃ, so tuṇhassa. Yassa nakkhamati, so bhāseyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Nikkujjito saṅghena vaḍḍhassa licchavissa patto asambhogo saṅghena, khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "Aṭṭhahi, bhikkhave, aṅgehi samannāgatassa upāsakassa patto ukkujjitabbo. Na bhikkhūnaṃ alābhāya parisakkati, na bhikkhūnaṃ anatthāya parisakkati…pe… na saṅghassa avaṇṇaṃ bhāsati. Anujānāmi, bhikkhave, imehi aṭṭhahi aṅgehi samannāgatassa upāsakassa pattaṃ ukkujjituṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evañca pana, bhikkhave, ukkujjitabbo. Tena, bhikkhave, vaḍḍhena licchavinā saṅghaṃ upasaṅkamitvā ekaṃsaṃ uttarāsaṅgaṃ karitvā bhikkhūnaṃ pāde vanditvā ukkuṭikaṃ nisīditvā añjaliṃ paggahetvā evamassa vacanīyo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Saṅghena me, bhante, patto nikkujjito, asambhogomhi saṅghena, sohaṃ, bhante, sammā vattāmi, lomaṃ pātemi, netthāraṃ vattāmi, saṅghaṃ pattukkujjanaṃ yācāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "Dutiyampi yācitabbo. Tatiyampi yācitabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "Byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Suṇātu me, bhante, saṅgho, saṅghena vaḍḍhassa licchavissa patto nikkujjito, asambhogo ",
      " saṅghena, so sammā vattati, lomaṃ pāteti, netthāraṃ vattati, saṅghaṃ pattukkujjanaṃ yācati, yadi saṅghassa pattakallaṃ, saṅgho vaḍḍhassa licchavissa pattaṃ ukkujjeyya, sambhogaṃ saṅghena kareyya, esā ñatti."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho, saṅghena vaḍḍhassa licchavissa patto nikkujjito, asambhogo saṅghena, so sammā vattati, lomaṃ pāteti, netthāraṃ vattati, saṅghaṃ pattukkujjanaṃ yācati, yadi saṅghassa pattakallaṃ, saṅgho vaḍḍhassa licchavissa pattaṃ ukkujjeyya, sambhogaṃ saṅghena kareyya, esā ñatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Suṇātu me, bhante, saṅgho, saṅghena vaḍḍhassa licchavissa patto nikkujjito, asambhogo saṅghena, so sammā vattati, lomaṃ pāteti, netthāraṃ vattati, saṅghaṃ pattukkujjanaṃ yācati, saṅgho vaḍḍhassa licchavissa pattaṃ ukkujjati, sambhogaṃ saṅghena karoti, yassāyasmato khamati vaḍḍhassa licchavissa pattassa ukkujjanā ",
      " sambhogaṃ saṅghena karaṇaṃ, so tuṇhassa. Yassa nakkhamati, so bhāseyya."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho, saṅghena vaḍḍhassa licchavissa patto nikkujjito, asambhogo saṅghena, so sammā vattati, lomaṃ pāteti, netthāraṃ vattati, saṅghaṃ pattukkujjanaṃ yācati, saṅgho vaḍḍhassa licchavissa pattaṃ ukkujjati, sambhogaṃ saṅghena karoti, yassāyasmato khamati vaḍḍhassa licchavissa pattassa ukkujjanā sambhogaṃ saṅghena karaṇaṃ, so tuṇhassa. Yassa nakkhamati, so bhāseyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Ukkujjito saṅghena vaḍḍhassa licchavissa patto sambhogo saṅghena, khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ettha (cūḷava. aṭṭha. 265) ca aṭṭhasu aṅgesu ekakenapi aṅgena samannāgatassa pattanikkujjanakammaṃ kātuṃ vaṭṭati, antosīmāya vā nissīmaṃ gantvā nadīādīsu vā nikkujjituṃ vaṭṭatiyeva. Evaṃ nikkujjite pana patte tassa gehe koci deyyadhammo na gahetabbo, ‘‘asukassa gehe bhikkhaṃ mā gaṇhitthā’’ti aññavihāresupi pesetabbaṃ. Ukkujjanakāle pana yāvatatiyaṃ yācāpetvā hatthapāsaṃ vijahāpetvā ñattidutiyakammena ukkujjitabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sīmāsammuti, ticīvarena avippavāsasammuti, santhatasammuti, bhattuddesakasenāsanaggāhāpakabhaṇḍāgāriyacīvarapaṭiggāhakacīvarabhājakayāgubhājakakhajjabhājakaphalabhājakaappamattakavissajjakasāṭiyaggāhāpakapattaggāhāpakaārāmikapesakasāmaṇerapesakasammutīti etāsaṃ sammutīnaṃ vasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammuti"
      },
      " veditabbā. Kathinacīvaradānamatakacīvaradānavasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dānaṃ"
      },
      " veditabbaṃ. Kathinuddhāravasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uddhāro"
      },
      " veditabbo. Kuṭivatthuvihāravatthudesanāvasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "desanā"
      },
      " veditabbā. Yā pana tiṇavatthārakasamathe sabbasaṅgāhikañattiñca ekekasmiṃ pakkhe ekekañattiñcāti tisso ñattiyo ṭhapetvā puna ekekasmiṃ pakkhe ekekāti dve ñattidutiyakammavācā vuttā, tāsaṃ vasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kammalakkhaṇaṃ"
      },
      " veditabbaṃ. Iti ñattidutiyakammaṃ imāni satta ṭhānāni gacchati."
    ],
    "innerText": "Sīmāsammuti, ticīvarena avippavāsasammuti, santhatasammuti, bhattuddesakasenāsanaggāhāpakabhaṇḍāgāriyacīvarapaṭiggāhakacīvarabhājakayāgubhājakakhajjabhājakaphalabhājakaappamattakavissajjakasāṭiyaggāhāpakapattaggāhāpakaārāmikapesakasāmaṇerapesakasammutīti etāsaṃ sammutīnaṃ vasena sammuti veditabbā. Kathinacīvaradānamatakacīvaradānavasena dānaṃ veditabbaṃ. Kathinuddhāravasena uddhāro veditabbo. Kuṭivatthuvihāravatthudesanāvasena desanā veditabbā. Yā pana tiṇavatthārakasamathe sabbasaṅgāhikañattiñca ekekasmiṃ pakkhe ekekañattiñcāti tisso ñattiyo ṭhapetvā puna ekekasmiṃ pakkhe ekekāti dve ñattidutiyakammavācā vuttā, tāsaṃ vasena kammalakkhaṇaṃ veditabbaṃ. Iti ñattidutiyakammaṃ imāni satta ṭhānāni gacchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "258"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñatticatutthakammaṭṭhānabhede"
      },
      " pana tajjanīyakammādīnaṃ sattannaṃ kammānaṃ vasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nissāraṇā,"
      },
      " tesaṃyeva ca kammānaṃ paṭippassambhanavasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "osāraṇā"
      },
      " veditabbā. Bhikkhunovādakasammutivasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammuti"
      },
      " veditabbā. Parivāsadānamānattadānavasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dānaṃ"
      },
      " veditabbaṃ. Mūlāyapaṭikassanakammavasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "niggaho"
      },
      " veditabbo. Ukkhittānuvattikā, aṭṭha yāvatatiyakā, ariṭṭho, caṇḍakāḷī ca imete yāvatatiyakāti imāsaṃ ekādasannaṃ samanubhāsanānaṃ vasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samanubhāsanā"
      },
      " veditabbā. Upasampadakammaabbhānakammavasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kammalakkhaṇaṃ"
      },
      " veditabbaṃ. Iti ñatticatutthakammaṃ imāni satta ",
      " ṭhānāni gacchati. Evaṃ kammāni ca kammavipatti ca tesaṃ kammānaṃ kārakasaṅghaparicchedo ca vipattivirahitānaṃ kammānaṃ ṭhānabhedagamanañca veditabbaṃ."
    ],
    "innerText": "258.Ñatticatutthakammaṭṭhānabhede pana tajjanīyakammādīnaṃ sattannaṃ kammānaṃ vasena nissāraṇā, tesaṃyeva ca kammānaṃ paṭippassambhanavasena osāraṇā veditabbā. Bhikkhunovādakasammutivasena sammuti veditabbā. Parivāsadānamānattadānavasena dānaṃ veditabbaṃ. Mūlāyapaṭikassanakammavasena niggaho veditabbo. Ukkhittānuvattikā, aṭṭha yāvatatiyakā, ariṭṭho, caṇḍakāḷī ca imete yāvatatiyakāti imāsaṃ ekādasannaṃ samanubhāsanānaṃ vasena samanubhāsanā veditabbā. Upasampadakammaabbhānakammavasena kammalakkhaṇaṃ veditabbaṃ. Iti ñatticatutthakammaṃ imāni satta ṭhānāni gacchati. Evaṃ kammāni ca kammavipatti ca tesaṃ kammānaṃ kārakasaṅghaparicchedo ca vipattivirahitānaṃ kammānaṃ ṭhānabhedagamanañca veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti pāḷimuttakavinayavinicchayasaṅgahe"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Kammākammavinicchayakathā samattā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Pakiṇṇakakaṇḍamātikā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Gaṇabhojaṃ ",
      " paramparaṃ, nāpucchā paṃsukūlakaṃ;"
    ],
    "innerText": "Gaṇabhojaṃ paramparaṃ, nāpucchā paṃsukūlakaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Acchinnaṃ paṭibhānañca, vippakatauddisanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Tivassantaṃ dīghāsanaṃ, gilānupaṭṭhavaṇṇanaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Attapātamanavekkhaṃ, silāpavijjhalimpanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Micchādiṭṭhigopadānaṃ, dhammikārakkhuccārādi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Nhānaghaṃsaṃ paṇḍakādi, dīghakesādyādāsādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Naccādaṅgachedaniddhi, patto sabbapaṃsukūlaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Parissāvanaṃ naggo ca, pupphagandhaāsittakaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Maḷorikekabhājanaṃ, celapaṭi pādaghaṃsī;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bījanī chattanakhādi, kāyabandhanivāsanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Kājaharaṃ dantakaṭṭhaṃ, rukkhāroho chandāropo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Lokāyataṃ khipitako, lasuṇaṃ nakkamitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Avandiyo tūlabhisi, bimbohanaāsandādi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Uccāsanamahāsanaṃ, cīvaraadhammokāso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Saddhādeyyaṃ santuttaraṃ, nikkhepo satthakammādi;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Nahāpito dasabhāgo, pātheyyaṃ mahāpadeso;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ānisaṃsoti mātikā."
  }
]