[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "Aparadutiyagāthāsaṅgaṇikaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "(1) Kāyikādiāpattivaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "474"
      },
      ". ‘‘Kati ",
      " āpattiyo kāyikā’’tiādigāthānaṃ vissajjane ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cha āpattiyo kāyikā"
      },
      "ti antarapeyyāle catutthena āpattisamuṭṭhānena cha āpattiyo āpajjati, ‘‘bhikkhu methunaṃ dhammaṃ paṭisevati, āpatti pārājikassā’’tiādinā nayena vuttāpattiyo. Kāyadvāre samuṭṭhitattā hi etā kāyikāti vuccanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cha vācasikā"
      },
      "ti tasmiṃyeva antarapeyyāle pañcamena āpattisamuṭṭhānena cha āpattiyo āpajjati, ‘‘bhikkhu pāpiccho icchāpakato’’tiādinā nayena vuttāpattiyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Chādentassa tisso"
      },
      "ti vajjapaṭicchādikāya bhikkhuniyā pārājikaṃ, bhikkhussa saṅghādisesapaṭicchādane pācittiyaṃ, attano duṭṭhullāpattipaṭicchādane dukkaṭaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañca saṃsaggapaccayā"
      },
      "ti ",
      " bhikkhuniyā kāyasaṃsagge pārājikaṃ, bhikkhuno saṅghādiseso, kāyena kāyapaṭibaddhe thullaccayaṃ, nissaggiyena kāyapaṭibaddhe dukkaṭaṃ, aṅgulipatodake pācittiyanti imā kāyasaṃsaggapaccayā pañcāpattiyo."
    ],
    "innerText": "474. ‘‘Kati āpattiyo kāyikā’’tiādigāthānaṃ vissajjane cha āpattiyo kāyikāti antarapeyyāle catutthena āpattisamuṭṭhānena cha āpattiyo āpajjati, ‘‘bhikkhu methunaṃ dhammaṃ paṭisevati, āpatti pārājikassā’’tiādinā nayena vuttāpattiyo. Kāyadvāre samuṭṭhitattā hi etā kāyikāti vuccanti. Cha vācasikāti tasmiṃyeva antarapeyyāle pañcamena āpattisamuṭṭhānena cha āpattiyo āpajjati, ‘‘bhikkhu pāpiccho icchāpakato’’tiādinā nayena vuttāpattiyo. Chādentassa tissoti vajjapaṭicchādikāya bhikkhuniyā pārājikaṃ, bhikkhussa saṅghādisesapaṭicchādane pācittiyaṃ, attano duṭṭhullāpattipaṭicchādane dukkaṭaṃ. Pañca saṃsaggapaccayāti bhikkhuniyā kāyasaṃsagge pārājikaṃ, bhikkhuno saṅghādiseso, kāyena kāyapaṭibaddhe thullaccayaṃ, nissaggiyena kāyapaṭibaddhe dukkaṭaṃ, aṅgulipatodake pācittiyanti imā kāyasaṃsaggapaccayā pañcāpattiyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aruṇugge tisso"
      },
      "ti ekarattachārattasattāhadasāhamāsātikkamavasena nissaggiyaṃ pācittiyaṃ, bhikkhuniyā rattivippavāse saṅghādiseso, ‘‘paṭhamampi yāmaṃ chādeti, dutiyampi tatiyampi yāmaṃ chādeti, uddhaste aruṇe channā hoti āpatti, yo chādeti so dukkaṭaṃ desāpetabbo’’ti imā aruṇugge tisso āpattiyo āpajjati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dve yāvatatiyakā"
      },
      "ti ekādasa yāvatatiyakā nāma, paññattivasena pana dve honti bhikkhūnaṃ yāvatatiyakā bhikkhunīnaṃ yāvatatiyakāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekettha aṭṭhavatthukā"
      },
      "ti bhikkhunīnaṃyeva ekā ettha imasmiṃ sāsane aṭṭhavatthukā nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekena sabbasaṅgaho"
      },
      "ti ‘‘yassa siyā āpatti, so āvikareyyā’’ti iminā ekena nidānuddesena sabbasikkhāpadānañca sabbapātimokkhuddesānañca saṅgaho hoti."
    ],
    "innerText": "Aruṇugge tissoti ekarattachārattasattāhadasāhamāsātikkamavasena nissaggiyaṃ pācittiyaṃ, bhikkhuniyā rattivippavāse saṅghādiseso, ‘‘paṭhamampi yāmaṃ chādeti, dutiyampi tatiyampi yāmaṃ chādeti, uddhaste aruṇe channā hoti āpatti, yo chādeti so dukkaṭaṃ desāpetabbo’’ti imā aruṇugge tisso āpattiyo āpajjati. Dve yāvatatiyakāti ekādasa yāvatatiyakā nāma, paññattivasena pana dve honti bhikkhūnaṃ yāvatatiyakā bhikkhunīnaṃ yāvatatiyakāti. Ekettha aṭṭhavatthukāti bhikkhunīnaṃyeva ekā ettha imasmiṃ sāsane aṭṭhavatthukā nāma. Ekena sabbasaṅgahoti ‘‘yassa siyā āpatti, so āvikareyyā’’ti iminā ekena nidānuddesena sabbasikkhāpadānañca sabbapātimokkhuddesānañca saṅgaho hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vinayassa dve mūlānī"
      },
      "ti kāyo ceva vācā ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Garukā dve vuttā"
      },
      "ti pārājikasaṅghādisesā ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dve duṭṭhullacchādanā"
      },
      "ti vajjapaṭicchādikāya pārājikaṃ ",
      " saṅghādisesaṃ paṭicchādakassa pācittiyanti imā dve duṭṭhullacchādanāpattiyo nāma."
    ],
    "innerText": "Vinayassa dve mūlānīti kāyo ceva vācā ca. Garukā dve vuttāti pārājikasaṅghādisesā . Dve duṭṭhullacchādanāti vajjapaṭicchādikāya pārājikaṃ saṅghādisesaṃ paṭicchādakassa pācittiyanti imā dve duṭṭhullacchādanāpattiyo nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gāmantare catasso"
      },
      "ti ‘‘bhikkhu bhikkhuniyā saddhiṃ saṃvidahati, dukkaṭaṃ; aññassa gāmassa upacāraṃ okkamati, pācittiyaṃ; bhikkhuniyā gāmantaraṃ gacchantiyā parikkhitte gāme paṭhamapāde thullaccayaṃ, dutiyapāde saṅghādiseso; aparikkhittassa paṭhamapāde upacārokkamane thullaccayaṃ, dutiyapāde saṅghādiseso’’ti imā gāmantare dukkaṭapācittiyathullaccayasaṅghaādisesavasena catasso āpattiyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Catasso nadipārapaccayā"
      },
      "ti ‘‘bhikkhu bhikkhuniyā saddhiṃ saṃvidahati, dukkaṭaṃ; nāvaṃ abhiruhati, pācittiyaṃ; bhikkhuniyā nadipāraṃ gacchantiyā uttaraṇakāle paṭhamapāde thullaccayaṃ, dutiyapāde saṅghādiseso’’ti imā catasso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekamaṃse thullaccaya"
      },
      "nti manussamaṃse. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Navamaṃsesu dukkaṭa"
      },
      "nti sesaakappiyamaṃsesu."
    ],
    "innerText": "Gāmantare catassoti ‘‘bhikkhu bhikkhuniyā saddhiṃ saṃvidahati, dukkaṭaṃ; aññassa gāmassa upacāraṃ okkamati, pācittiyaṃ; bhikkhuniyā gāmantaraṃ gacchantiyā parikkhitte gāme paṭhamapāde thullaccayaṃ, dutiyapāde saṅghādiseso; aparikkhittassa paṭhamapāde upacārokkamane thullaccayaṃ, dutiyapāde saṅghādiseso’’ti imā gāmantare dukkaṭapācittiyathullaccayasaṅghaādisesavasena catasso āpattiyo. Catasso nadipārapaccayāti ‘‘bhikkhu bhikkhuniyā saddhiṃ saṃvidahati, dukkaṭaṃ; nāvaṃ abhiruhati, pācittiyaṃ; bhikkhuniyā nadipāraṃ gacchantiyā uttaraṇakāle paṭhamapāde thullaccayaṃ, dutiyapāde saṅghādiseso’’ti imā catasso. Ekamaṃse thullaccayanti manussamaṃse. Navamaṃsesu dukkaṭanti sesaakappiyamaṃsesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dve vācasikā ratti"
      },
      "nti bhikkhunī rattandhakāre appadīpe purisena saddhiṃ hatthapāse ṭhitā sallapati ",
      ", pācittiyaṃ; hatthapāsaṃ vijahitvā ṭhitā sallapati, dukkaṭaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dve vācasikā divā"
      },
      "ti bhikkhunī divā paṭicchanne okāse purisena saddhiṃ hatthapāse ṭhitā sallapati, pācittiyaṃ; hatthapāsaṃ vijahitvā sallapati, dukkaṭaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dadamānassa tisso"
      },
      "ti maraṇādhippāyo manussassa visaṃ deti, so ce tena marati, pārājikaṃ; yakkhapetānaṃ deti, te ce maranti, thullaccayaṃ; tiracchānagatassa deti, so ce marati, pācittiyaṃ; aññātikāya bhikkhuniyā cīvaradāne pācittiyanti evaṃ dadamānassa tisso āpattiyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cattāro ca paṭiggahe"
      },
      "ti hatthaggāha-veṇiggāhesu saṅghādiseso, mukhena aṅgajātaggahaṇe pārājikaṃ, aññātikāya bhikkhuniyā cīvarapaṭiggahaṇe nissaggiyaṃ pācittiyaṃ, avassutāya avassutassa hatthato khādanīyaṃ bhojanīyaṃ paṭiggaṇhantiyā thullaccayaṃ; evaṃ paṭiggahe cattāro āpattikkhandhā honti."
    ],
    "innerText": "Dve vācasikā rattinti bhikkhunī rattandhakāre appadīpe purisena saddhiṃ hatthapāse ṭhitā sallapati , pācittiyaṃ; hatthapāsaṃ vijahitvā ṭhitā sallapati, dukkaṭaṃ. Dve vācasikā divāti bhikkhunī divā paṭicchanne okāse purisena saddhiṃ hatthapāse ṭhitā sallapati, pācittiyaṃ; hatthapāsaṃ vijahitvā sallapati, dukkaṭaṃ. Dadamānassa tissoti maraṇādhippāyo manussassa visaṃ deti, so ce tena marati, pārājikaṃ; yakkhapetānaṃ deti, te ce maranti, thullaccayaṃ; tiracchānagatassa deti, so ce marati, pācittiyaṃ; aññātikāya bhikkhuniyā cīvaradāne pācittiyanti evaṃ dadamānassa tisso āpattiyo. Cattāro ca paṭiggaheti hatthaggāha-veṇiggāhesu saṅghādiseso, mukhena aṅgajātaggahaṇe pārājikaṃ, aññātikāya bhikkhuniyā cīvarapaṭiggahaṇe nissaggiyaṃ pācittiyaṃ, avassutāya avassutassa hatthato khādanīyaṃ bhojanīyaṃ paṭiggaṇhantiyā thullaccayaṃ; evaṃ paṭiggahe cattāro āpattikkhandhā honti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "(2) Desanāgāminiyādivaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "475"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañca desanāgāminiyo"
      },
      "ti lahukā pañca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cha sappaṭikammā"
      },
      "ti pārājikaṃ ṭhapetvā avasesā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekettha appaṭikammā"
      },
      "ti ekā pārājikāpatti."
    ],
    "innerText": "475.Pañca desanāgāminiyoti lahukā pañca. Cha sappaṭikammāti pārājikaṃ ṭhapetvā avasesā. Ekettha appaṭikammāti ekā pārājikāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vinayagarukā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dve vuttā"
      },
      "ti pārājikañceva saṅghādisesañca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kāyavācasikāni cā"
      },
      "ti sabbāneva sikkhāpadāni kāyavācasikāni, manodvāre paññattaṃ ",
      " ekasikkhāpadampi natthi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Eko vikāle dhaññaraso"
      },
      "ti loṇasovīrakaṃ. Ayameva hi eko dhaññaraso vikāle vaṭṭati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekā ñatticatutthena sammutī"
      },
      "ti bhikkhunovādakasammuti. Ayameva hi ekā ñatticatutthakammena sammuti anuññātā."
    ],
    "innerText": "Vinayagarukādve vuttāti pārājikañceva saṅghādisesañca. Kāyavācasikāni cāti sabbāneva sikkhāpadāni kāyavācasikāni, manodvāre paññattaṃ ekasikkhāpadampi natthi. Eko vikāle dhaññarasoti loṇasovīrakaṃ. Ayameva hi eko dhaññaraso vikāle vaṭṭati. Ekā ñatticatutthena sammutīti bhikkhunovādakasammuti. Ayameva hi ekā ñatticatutthakammena sammuti anuññātā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pārājikā kāyikā dve"
      },
      "ti bhikkhūnaṃ methunapārājikaṃ bhikkhunīnañca kāyasaṃsaggapārājikaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dve saṃvāsabhūmiyo"
      },
      "ti attanā vā attānaṃ samānasaṃvāsakaṃ karoti, samaggo vā saṅgho ukkhittaṃ osāreti. Kurundiyaṃ pana ‘‘samānasaṃvāsakabhūmi ca nānāsaṃvāsakabhūmi cā’’ti evaṃ dve saṃvāsabhūmiyo vuttā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dvinnaṃ ratticchedo"
      },
      "ti pārivāsikassa ca mānattacārikassa ca paññattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dvaṅgulā duve"
      },
      "ti dve dvaṅgulapaññattiyo, ‘‘dvaṅgulapabbaparamaṃ ādātabba’’nti ayamekā, ‘‘dvaṅgulaṃ vā dvemāsaṃ vā’’ti ayamekā."
    ],
    "innerText": "Pārājikā kāyikā dveti bhikkhūnaṃ methunapārājikaṃ bhikkhunīnañca kāyasaṃsaggapārājikaṃ. Dve saṃvāsabhūmiyoti attanā vā attānaṃ samānasaṃvāsakaṃ karoti, samaggo vā saṅgho ukkhittaṃ osāreti. Kurundiyaṃ pana ‘‘samānasaṃvāsakabhūmi ca nānāsaṃvāsakabhūmi cā’’ti evaṃ dve saṃvāsabhūmiyo vuttā. Dvinnaṃ ratticchedoti pārivāsikassa ca mānattacārikassa ca paññattā. Dvaṅgulā duveti dve dvaṅgulapaññattiyo, ‘‘dvaṅgulapabbaparamaṃ ādātabba’’nti ayamekā, ‘‘dvaṅgulaṃ vā dvemāsaṃ vā’’ti ayamekā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dve attānaṃ vadhitvānā"
      },
      "ti bhikkhunī attānaṃ vadhitvā dve āpattiyo āpajjati; vadhati rodati, āpatti pācittiyassa; vadhati na rodati, āpatti dukkaṭassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dvīhi saṅgho bhijjatī"
      },
      "ti kammena ca salākaggāhena ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dvettha"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭhamāpattikā"
      },
      "ti ettha sakalepi vinaye dve paṭhamāpattikā ubhinnaṃ paññattivasena. Itarathā pana nava bhikkhūnaṃ nava bhikkhunīnanti aṭṭhārasa honti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñattiyā karaṇā duve"
      },
      "ti dve ñattikiccāni – kammañca kammapādakā ca. Navasu ṭhānesu kammaṃ hoti, dvīsu kammapādabhāvena tiṭṭhati."
    ],
    "innerText": "Dve attānaṃ vadhitvānāti bhikkhunī attānaṃ vadhitvā dve āpattiyo āpajjati; vadhati rodati, āpatti pācittiyassa; vadhati na rodati, āpatti dukkaṭassa. Dvīhi saṅgho bhijjatīti kammena ca salākaggāhena ca. Dvetthapaṭhamāpattikāti ettha sakalepi vinaye dve paṭhamāpattikā ubhinnaṃ paññattivasena. Itarathā pana nava bhikkhūnaṃ nava bhikkhunīnanti aṭṭhārasa honti. Ñattiyā karaṇā duveti dve ñattikiccāni – kammañca kammapādakā ca. Navasu ṭhānesu kammaṃ hoti, dvīsu kammapādabhāvena tiṭṭhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāṇātipāte tisso"
      },
      "ti ‘‘anodissa opātaṃ khaṇati, sace manusso marati, pārājikaṃ; yakkhapetānaṃ maraṇe thullaccayaṃ; tiracchānagatassa maraṇe pācittiya’’nti imā tisso honti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vācā pārājikā tayo"
      },
      "ti vajjapaṭicchādikāya ukkhittānuvattikāya aṭṭhavatthukāyāti. Kurundiyaṃ pana ‘‘āṇattiyā adinnādāne, manussamaraṇe, uttarimanussadhammaullapane cā’’ti evaṃ tayo vuttā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Obhāsanā tayo"
      },
      "ti vaccamaggaṃ passāvamaggaṃ ādissa vaṇṇāvaṇṇabhāsane saṅghādiseso, vaccamaggaṃ passāvamaggaṃ ṭhapetvā adhakkhakaṃ ubbhajāṇumaṇḍalaṃ ādissa vaṇṇāvaṇṇabhaṇane thullaccayaṃ, ubbhakkhakaṃ adhojāṇumaṇḍalaṃ ādissa vaṇṇāvaṇṇabhaṇane dukkaṭaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sañcarittena vā tayo"
      },
      "ti paṭiggaṇhāti vīmaṃsati paccāharati ",
      ", āpatti saṅghādisesassa; ",
      " paṭiggaṇhāti vīmaṃsati na paccāharati, āpatti thullaccayassa; paṭiggaṇhāti na vīmaṃsati na paccāharati, āpatti dukkaṭassāti ime sañcarittena kāraṇabhūtena tayo āpattikkhandhā honti."
    ],
    "innerText": "Pāṇātipāte tissoti ‘‘anodissa opātaṃ khaṇati, sace manusso marati, pārājikaṃ; yakkhapetānaṃ maraṇe thullaccayaṃ; tiracchānagatassa maraṇe pācittiya’’nti imā tisso honti. Vācā pārājikā tayoti vajjapaṭicchādikāya ukkhittānuvattikāya aṭṭhavatthukāyāti. Kurundiyaṃ pana ‘‘āṇattiyā adinnādāne, manussamaraṇe, uttarimanussadhammaullapane cā’’ti evaṃ tayo vuttā. Obhāsanā tayoti vaccamaggaṃ passāvamaggaṃ ādissa vaṇṇāvaṇṇabhāsane saṅghādiseso, vaccamaggaṃ passāvamaggaṃ ṭhapetvā adhakkhakaṃ ubbhajāṇumaṇḍalaṃ ādissa vaṇṇāvaṇṇabhaṇane thullaccayaṃ, ubbhakkhakaṃ adhojāṇumaṇḍalaṃ ādissa vaṇṇāvaṇṇabhaṇane dukkaṭaṃ. Sañcarittena vā tayoti paṭiggaṇhāti vīmaṃsati paccāharati , āpatti saṅghādisesassa; paṭiggaṇhāti vīmaṃsati na paccāharati, āpatti thullaccayassa; paṭiggaṇhāti na vīmaṃsati na paccāharati, āpatti dukkaṭassāti ime sañcarittena kāraṇabhūtena tayo āpattikkhandhā honti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tayo puggalā na upasampādetabbā"
      },
      "ti addhānahīno aṅgahīno vatthuvipanno ca tesaṃ nānākaraṇaṃ vuttameva. Apicettha yo pattacīvarena aparipūro, paripūro ca na yācati, imepi aṅgahīneneva saṅgahitā. Mātughātakādayo ca karaṇadukkaṭakā paṇḍakaubhatobyañjanakatiracchānagatasaṅkhātena vatthuvipanneneva saṅgahitāti veditabbā. Esa nayo kurundiyaṃ vutto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tayo kammānaṃ saṅgahā"
      },
      "ti ñattikappanā, vippakatapaccattaṃ, atītakaraṇanti. Tattha ‘‘dadeyya kareyyā’’tiādibhedā ñattikappanā; ‘‘deti karotī’’tiādibhedaṃ vippakatapaccattaṃ; ‘‘dinnaṃ kata’’ntiādibhedaṃ atītakaraṇaṃ nāmāti imehi tīhi kammāni saṅgayhanti. Aparehipi tīhi kammāni saṅgayhanti – vatthunā, ñattiyā, anussāvanāyāti. Vatthusampannañhi ñattisampannaṃ anussāvanasampannañca kammaṃ nāma hoti, tena vuttaṃ ‘‘tayo kammānaṃ saṅgahā’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nāsitakā tayo"
      },
      " nāma mettiyaṃ ",
      " bhikkhuniṃ nāsetha, dūsako nāsetabbo, dasahaṅgehi samannāgato sāmaṇero nāsetabbo, kaṇṭakaṃ samaṇuddesaṃ nāsethāti evaṃ liṅgasaṃvāsadaṇḍakammanāsanāvasena tayo nāsitakā veditabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tiṇṇannaṃ ekavācikā"
      },
      "ti ‘‘anujānāmi bhikkhave dve tayo ekānussāvane kātu’’nti vacanato tiṇṇaṃ janānaṃ ekupajjhāyena nānācariyena ekānussāvanā vaṭṭati."
    ],
    "innerText": "Tayo puggalā na upasampādetabbāti addhānahīno aṅgahīno vatthuvipanno ca tesaṃ nānākaraṇaṃ vuttameva. Apicettha yo pattacīvarena aparipūro, paripūro ca na yācati, imepi aṅgahīneneva saṅgahitā. Mātughātakādayo ca karaṇadukkaṭakā paṇḍakaubhatobyañjanakatiracchānagatasaṅkhātena vatthuvipanneneva saṅgahitāti veditabbā. Esa nayo kurundiyaṃ vutto. Tayo kammānaṃ saṅgahāti ñattikappanā, vippakatapaccattaṃ, atītakaraṇanti. Tattha ‘‘dadeyya kareyyā’’tiādibhedā ñattikappanā; ‘‘deti karotī’’tiādibhedaṃ vippakatapaccattaṃ; ‘‘dinnaṃ kata’’ntiādibhedaṃ atītakaraṇaṃ nāmāti imehi tīhi kammāni saṅgayhanti. Aparehipi tīhi kammāni saṅgayhanti – vatthunā, ñattiyā, anussāvanāyāti. Vatthusampannañhi ñattisampannaṃ anussāvanasampannañca kammaṃ nāma hoti, tena vuttaṃ ‘‘tayo kammānaṃ saṅgahā’’ti. Nāsitakā tayo nāma mettiyaṃ bhikkhuniṃ nāsetha, dūsako nāsetabbo, dasahaṅgehi samannāgato sāmaṇero nāsetabbo, kaṇṭakaṃ samaṇuddesaṃ nāsethāti evaṃ liṅgasaṃvāsadaṇḍakammanāsanāvasena tayo nāsitakā veditabbā. Tiṇṇannaṃ ekavācikāti ‘‘anujānāmi bhikkhave dve tayo ekānussāvane kātu’’nti vacanato tiṇṇaṃ janānaṃ ekupajjhāyena nānācariyena ekānussāvanā vaṭṭati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adinnādāne tisso"
      },
      "ti pāde vā atirekapāde vā pārājikaṃ, atirekamāsake thullaccayaṃ, māsake vā ūnamāsake vā dukkaṭaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Catasso methunapaccayā"
      },
      "ti akkhayite pārājikaṃ, yebhuyyena khayite thullaccayaṃ, vivaṭakate mukhe dukkaṭaṃ, jatumaṭṭhake pācittiyaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Chindantassa tisso"
      },
      "ti vanappatiṃ chindantassa pārājikaṃ, bhūtagāme pācittiyaṃ, aṅgajāte thullaccayaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañca chaḍḍitapaccayā"
      },
      "ti anodissa visaṃ chaḍḍeti, sace tena manusso marati, pārājikaṃ; yakkhapetesu thullaccayaṃ; tiracchānagate pācittiyaṃ; vissaṭṭhichaḍḍane saṅghādiseso; sekhiyesu harite uccārapassāvachaḍḍane dukkaṭaṃ – imā chaḍḍitapaccayā pañcāpattiyo honti."
    ],
    "innerText": "Adinnādāne tissoti pāde vā atirekapāde vā pārājikaṃ, atirekamāsake thullaccayaṃ, māsake vā ūnamāsake vā dukkaṭaṃ. Catasso methunapaccayāti akkhayite pārājikaṃ, yebhuyyena khayite thullaccayaṃ, vivaṭakate mukhe dukkaṭaṃ, jatumaṭṭhake pācittiyaṃ. Chindantassa tissoti vanappatiṃ chindantassa pārājikaṃ, bhūtagāme pācittiyaṃ, aṅgajāte thullaccayaṃ. Pañca chaḍḍitapaccayāti anodissa visaṃ chaḍḍeti, sace tena manusso marati, pārājikaṃ; yakkhapetesu thullaccayaṃ; tiracchānagate pācittiyaṃ; vissaṭṭhichaḍḍane saṅghādiseso; sekhiyesu harite uccārapassāvachaḍḍane dukkaṭaṃ – imā chaḍḍitapaccayā pañcāpattiyo honti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pācittiyena"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dukkaṭā katā"
      },
      "ti bhikkhunovādakavaggasmiṃ dasasu sikkhāpadesu pācittiyena saddhiṃ ",
      " dukkaṭā katā evāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Caturettha navakā vuttā"
      },
      "ti paṭhamasikkhāpadamhiyeva adhammakamme dve, dhammakamme dveti evaṃ cattāro navakā vuttāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dvinnaṃ cīvarena cā"
      },
      "ti bhikkhūnaṃ santike upasampannāya cīvaraṃ dentassa pācittiyaṃ, bhikkhunīnaṃ santike upasampannāya dentassa dukkaṭanti evaṃ dvinnaṃ bhikkhunīnaṃ cīvaraṃ dentassa cīvarena kāraṇabhūtena āpatti hotīti attho."
    ],
    "innerText": "Pācittiyenadukkaṭā katāti bhikkhunovādakavaggasmiṃ dasasu sikkhāpadesu pācittiyena saddhiṃ dukkaṭā katā evāti attho. Caturettha navakā vuttāti paṭhamasikkhāpadamhiyeva adhammakamme dve, dhammakamme dveti evaṃ cattāro navakā vuttāti attho. Dvinnaṃ cīvarena cāti bhikkhūnaṃ santike upasampannāya cīvaraṃ dentassa pācittiyaṃ, bhikkhunīnaṃ santike upasampannāya dentassa dukkaṭanti evaṃ dvinnaṃ bhikkhunīnaṃ cīvaraṃ dentassa cīvarena kāraṇabhūtena āpatti hotīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭha pāṭidesanīyā"
      },
      "ti pāḷiyaṃ āgatā eva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhuñjantāmakadhaññena pācittiyena dukkaṭā katā"
      },
      "ti āmakadhaññaṃ viññāpetvā bhuñjantiyā pācittiyena saddhiṃ dukkaṭā katāyeva."
    ],
    "innerText": "Aṭṭha pāṭidesanīyāti pāḷiyaṃ āgatā eva. Bhuñjantāmakadhaññena pācittiyena dukkaṭā katāti āmakadhaññaṃ viññāpetvā bhuñjantiyā pācittiyena saddhiṃ dukkaṭā katāyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gacchantassa catasso"
      },
      "ti bhikkhuniyā vā mātugāmena vā saddhiṃ saṃvidhāya gacchantassa dukkaṭaṃ, gāmūpacārokkamane pācittiyaṃ, yā bhikkhunī ekā gāmantaraṃ gacchati, tassā gāmūpacāraṃ okkamantiyā paṭhamapāde thullaccayaṃ, dutiyapāde saṅghādisesoti gacchantassa imā catasso āpattiyo honti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ṭhitassa cāpi tattakā"
      },
      "ti ",
      " ṭhitassapi catasso evāti attho. Kathaṃ? Bhikkhunī andhakāre vā paṭicchanne vā okāse mittasanthavavasena purisassa hatthapāse tiṭṭhati, pācittiyaṃ; hatthapāsaṃ vijahitvā tiṭṭhati, dukkaṭaṃ; aruṇuggamanakāle dutiyikāya hatthapāsaṃ vijahantī tiṭṭhati, thullaccayaṃ; vijahitvā tiṭṭhati, saṅghādisesoti nisinnassa catasso āpattiyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nipannassāpi tattakā"
      },
      "ti sacepi hi sā nisīdati vā nipajjati vā, etāyeva catasso āpattiyo āpajjati."
    ],
    "innerText": "Gacchantassa catassoti bhikkhuniyā vā mātugāmena vā saddhiṃ saṃvidhāya gacchantassa dukkaṭaṃ, gāmūpacārokkamane pācittiyaṃ, yā bhikkhunī ekā gāmantaraṃ gacchati, tassā gāmūpacāraṃ okkamantiyā paṭhamapāde thullaccayaṃ, dutiyapāde saṅghādisesoti gacchantassa imā catasso āpattiyo honti. Ṭhitassa cāpi tattakāti ṭhitassapi catasso evāti attho. Kathaṃ? Bhikkhunī andhakāre vā paṭicchanne vā okāse mittasanthavavasena purisassa hatthapāse tiṭṭhati, pācittiyaṃ; hatthapāsaṃ vijahitvā tiṭṭhati, dukkaṭaṃ; aruṇuggamanakāle dutiyikāya hatthapāsaṃ vijahantī tiṭṭhati, thullaccayaṃ; vijahitvā tiṭṭhati, saṅghādisesoti nisinnassa catasso āpattiyo. Nipannassāpi tattakāti sacepi hi sā nisīdati vā nipajjati vā, etāyeva catasso āpattiyo āpajjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "(3) Pācittiyavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "476"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañca pācittiyānī"
      },
      "ti pañca bhesajjāni paṭiggahetvā nānābhājanesu vā ekabhājane vā amissetvā ṭhapitāni honti, sattāhātikkame so bhikkhu pañca pācittiyāni sabbāni nānāvatthukāni ekakkhaṇe āpajjati, ‘‘imaṃ paṭhamaṃ āpanno, imaṃ pacchā’’ti na vattabbo."
    ],
    "innerText": "476.Pañca pācittiyānīti pañca bhesajjāni paṭiggahetvā nānābhājanesu vā ekabhājane vā amissetvā ṭhapitāni honti, sattāhātikkame so bhikkhu pañca pācittiyāni sabbāni nānāvatthukāni ekakkhaṇe āpajjati, ‘‘imaṃ paṭhamaṃ āpanno, imaṃ pacchā’’ti na vattabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nava pācittiyānī"
      },
      "ti yo bhikkhu nava paṇītabhojanāni viññāpetvā tehi saddhiṃ ekato ekaṃ kabaḷaṃ omadditvā mukhe pakkhipitvā paragaḷaṃ atikkāmeti, ayaṃ nava pācittiyāni sabbāni ",
      " nānāvatthukāni ekakkhaṇe āpajjati ",
      " ‘‘imaṃ paṭhamaṃ āpanno, imaṃ pacchā’’ti na vattabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekavācāya deseyyā"
      },
      "ti ‘‘ahaṃ, bhante, pañca bhesajjāni paṭiggahetvā sattāhaṃ atikkāmetvā pañca āpattiyo āpanno, tā tumhamūle paṭidesemī’’ti evaṃ ekavācāya deseyya, desitāva honti, dvīhi tīhi vācāhi kiccaṃ nāma natthi. Dutiyavissajjanepi ‘‘ahaṃ, bhante, nava paṇītabhojanāni viññāpetvā bhuñjitvā nava āpattiyo āpanno, tā tumhamūle paṭidesemī’’ti vattabbaṃ."
    ],
    "innerText": "Nava pācittiyānīti yo bhikkhu nava paṇītabhojanāni viññāpetvā tehi saddhiṃ ekato ekaṃ kabaḷaṃ omadditvā mukhe pakkhipitvā paragaḷaṃ atikkāmeti, ayaṃ nava pācittiyāni sabbāni nānāvatthukāni ekakkhaṇe āpajjati ‘‘imaṃ paṭhamaṃ āpanno, imaṃ pacchā’’ti na vattabbo. Ekavācāya deseyyāti ‘‘ahaṃ, bhante, pañca bhesajjāni paṭiggahetvā sattāhaṃ atikkāmetvā pañca āpattiyo āpanno, tā tumhamūle paṭidesemī’’ti evaṃ ekavācāya deseyya, desitāva honti, dvīhi tīhi vācāhi kiccaṃ nāma natthi. Dutiyavissajjanepi ‘‘ahaṃ, bhante, nava paṇītabhojanāni viññāpetvā bhuñjitvā nava āpattiyo āpanno, tā tumhamūle paṭidesemī’’ti vattabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vatthuṃ kittetvā deseyyā"
      },
      "ti ‘‘ahaṃ, bhante, pañca bhesajjāni paṭiggahetvā sattāhaṃ atikkāmesiṃ, yathāvatthukaṃ taṃ tumhamūle paṭidesemī’’ti evaṃ vatthuṃ kittetvā deseyya, desitāva honti āpattiyo, āpattiyā nāmaggahaṇena kiccaṃ natthi. Dutiyavissajjanepi ‘‘ahaṃ, bhante, nava paṇītabhojanāni viññāpetvā bhutto, yathāvatthukaṃ taṃ tumhamūle paṭidesemī’’ti vattabbaṃ."
    ],
    "innerText": "Vatthuṃ kittetvā deseyyāti ‘‘ahaṃ, bhante, pañca bhesajjāni paṭiggahetvā sattāhaṃ atikkāmesiṃ, yathāvatthukaṃ taṃ tumhamūle paṭidesemī’’ti evaṃ vatthuṃ kittetvā deseyya, desitāva honti āpattiyo, āpattiyā nāmaggahaṇena kiccaṃ natthi. Dutiyavissajjanepi ‘‘ahaṃ, bhante, nava paṇītabhojanāni viññāpetvā bhutto, yathāvatthukaṃ taṃ tumhamūle paṭidesemī’’ti vattabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yāvatatiyake tisso"
      },
      "ti ukkhittānuvattikāya pārājikaṃ bhedakānuvattakānaṃ kokālikādīnaṃ saṅghādisesaṃ, pāpikāya diṭṭhiyā appaṭinissagge caṇḍakāḷikāya ca bhikkhuniyā pācittiyanti imā yāvatatiyakā tisso āpattiyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cha vohārapaccayā"
      },
      "ti payuttavācāpaccayā cha ",
      " āpattiyo āpajjatīti attho. Kathaṃ? Ājīvahetu ājīvakāraṇā pāpiccho icchāpakato asantaṃ abhūtaṃ uttarimanussadhammaṃ ullapati, āpatti pārājikassa. Ājīvahetu ājīvakāraṇā sañcarittaṃ samāpajjati, āpatti saṅghādisesassa. Ājīvahetu ājīvakāraṇā yo te vihāre vasati so arahāti vadati, āpatti thullaccayassa. Ājīvahetu ājīvakāraṇā bhikkhu paṇītabhojanāni attano atthāya viññāpetvā bhuñjati, āpatti pācittiyassa. Ājīvahetu ājīvakāraṇā bhikkhunī paṇītabhojanāni attano atthāya viññāpetvā bhuñjati, āpatti pāṭidesanīyassa. Ājīvahetu ājīvakāraṇā sūpaṃ vā odanaṃ vā agilāno attano atthāya viññāpetvā bhuñjati, āpatti dukkaṭassāti."
    ],
    "innerText": "Yāvatatiyake tissoti ukkhittānuvattikāya pārājikaṃ bhedakānuvattakānaṃ kokālikādīnaṃ saṅghādisesaṃ, pāpikāya diṭṭhiyā appaṭinissagge caṇḍakāḷikāya ca bhikkhuniyā pācittiyanti imā yāvatatiyakā tisso āpattiyo. Cha vohārapaccayāti payuttavācāpaccayā cha āpattiyo āpajjatīti attho. Kathaṃ? Ājīvahetu ājīvakāraṇā pāpiccho icchāpakato asantaṃ abhūtaṃ uttarimanussadhammaṃ ullapati, āpatti pārājikassa. Ājīvahetu ājīvakāraṇā sañcarittaṃ samāpajjati, āpatti saṅghādisesassa. Ājīvahetu ājīvakāraṇā yo te vihāre vasati so arahāti vadati, āpatti thullaccayassa. Ājīvahetu ājīvakāraṇā bhikkhu paṇītabhojanāni attano atthāya viññāpetvā bhuñjati, āpatti pācittiyassa. Ājīvahetu ājīvakāraṇā bhikkhunī paṇītabhojanāni attano atthāya viññāpetvā bhuñjati, āpatti pāṭidesanīyassa. Ājīvahetu ājīvakāraṇā sūpaṃ vā odanaṃ vā agilāno attano atthāya viññāpetvā bhuñjati, āpatti dukkaṭassāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khādantassa tisso"
      },
      "ti manussamaṃse thullaccayaṃ, avasesesu akappiyamaṃsesu dukkaṭaṃ, bhikkhuniyā lasuṇe pācittiyaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañca bhojanapaccayā"
      },
      "ti avassutā avassutassa purisassa hatthato bhojanaṃ gahetvā tattheva ",
      " manussamaṃsaṃ lasuṇaṃ attano atthāya viññāpetvā gahitapaṇītabhojanāni avasesañca akappiyamaṃsaṃ pakkhipitvā vomissakaṃ omadditvā ajjhoharamānā ",
      " saṅghādisesaṃ, thullaccayaṃ, pācittiyaṃ, pāṭidesanīyaṃ, dukkaṭanti imā pañca āpattiyo bhojanapaccayā āpajjati."
    ],
    "innerText": "Khādantassa tissoti manussamaṃse thullaccayaṃ, avasesesu akappiyamaṃsesu dukkaṭaṃ, bhikkhuniyā lasuṇe pācittiyaṃ. Pañca bhojanapaccayāti avassutā avassutassa purisassa hatthato bhojanaṃ gahetvā tattheva manussamaṃsaṃ lasuṇaṃ attano atthāya viññāpetvā gahitapaṇītabhojanāni avasesañca akappiyamaṃsaṃ pakkhipitvā vomissakaṃ omadditvā ajjhoharamānā saṅghādisesaṃ, thullaccayaṃ, pācittiyaṃ, pāṭidesanīyaṃ, dukkaṭanti imā pañca āpattiyo bhojanapaccayā āpajjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañca ṭhānānī"
      },
      "ti ‘‘ukkhittānuvattikāya bhikkhuniyā yāvatatiyaṃ samanubhāsanāya appaṭinissajjantiyā ñattiyā dukkaṭaṃ, dvīhi kammavācāhi thullaccayaṃ, kammavācāpariyosāne āpatti pārājikassa, saṅghabhedāya parakkamanādīsu saṅghādiseso, pāpikāya diṭṭhiyā appaṭinissagge pācittiya’’nti evaṃ sabbā yāvatatiyakā pañca ṭhānāni gacchanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañcannañceva āpattī"
      },
      "ti āpatti nāma pañcannaṃ sahadhammikānaṃ hoti, tattha dvinnaṃ nippariyāyena āpattiyeva, sikkhāmānasāmaṇerisāmaṇerānaṃ pana akappiyattā na vaṭṭati. Iminā pariyāyena tesaṃ āpatti na desāpetabbā, daṇḍakammaṃ pana tesaṃ kātabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañcannaṃ adhikaraṇena cā"
      },
      "ti adhikaraṇañca pañcannamevāti attho. Etesaṃyeva hi pañcannaṃ pattacīvarādīnaṃ atthāya vinicchayavohāro adhikaraṇanti vuccati, gihīnaṃ pana aḍḍakammaṃ nāma hoti."
    ],
    "innerText": "Pañca ṭhānānīti ‘‘ukkhittānuvattikāya bhikkhuniyā yāvatatiyaṃ samanubhāsanāya appaṭinissajjantiyā ñattiyā dukkaṭaṃ, dvīhi kammavācāhi thullaccayaṃ, kammavācāpariyosāne āpatti pārājikassa, saṅghabhedāya parakkamanādīsu saṅghādiseso, pāpikāya diṭṭhiyā appaṭinissagge pācittiya’’nti evaṃ sabbā yāvatatiyakā pañca ṭhānāni gacchanti. Pañcannañceva āpattīti āpatti nāma pañcannaṃ sahadhammikānaṃ hoti, tattha dvinnaṃ nippariyāyena āpattiyeva, sikkhāmānasāmaṇerisāmaṇerānaṃ pana akappiyattā na vaṭṭati. Iminā pariyāyena tesaṃ āpatti na desāpetabbā, daṇḍakammaṃ pana tesaṃ kātabbaṃ. Pañcannaṃ adhikaraṇena cāti adhikaraṇañca pañcannamevāti attho. Etesaṃyeva hi pañcannaṃ pattacīvarādīnaṃ atthāya vinicchayavohāro adhikaraṇanti vuccati, gihīnaṃ pana aḍḍakammaṃ nāma hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañcannaṃ vinicchayo hotī"
      },
      "ti pañcannaṃ sahadhammikānaṃyeva vinicchayo nāma ",
      " hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañcannaṃ vūpasamena cā"
      },
      "ti etesaṃyeva pañcannaṃ adhikaraṇaṃ vinicchitaṃ vūpasantaṃ nāma hotīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañcannañceva anāpattī"
      },
      "ti etesaṃyeva pañcannaṃ anāpatti nāma hotīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tīhi ṭhānehi sobhatī"
      },
      "ti saṅghādīhi tīhi kāraṇehi sobhati. Katavītikkamo hi puggalo sappaṭikammaṃ āpattiṃ saṅghamajjhe gaṇamajjhe puggalasantike vā paṭikaritvā abbhuṇhasīlo pākatiko hoti, tasmā tīhi ṭhānehi sobhatīti vuccati."
    ],
    "innerText": "Pañcannaṃ vinicchayo hotīti pañcannaṃ sahadhammikānaṃyeva vinicchayo nāma hoti. Pañcannaṃ vūpasamena cāti etesaṃyeva pañcannaṃ adhikaraṇaṃ vinicchitaṃ vūpasantaṃ nāma hotīti attho. Pañcannañceva anāpattīti etesaṃyeva pañcannaṃ anāpatti nāma hotīti attho. Tīhi ṭhānehi sobhatīti saṅghādīhi tīhi kāraṇehi sobhati. Katavītikkamo hi puggalo sappaṭikammaṃ āpattiṃ saṅghamajjhe gaṇamajjhe puggalasantike vā paṭikaritvā abbhuṇhasīlo pākatiko hoti, tasmā tīhi ṭhānehi sobhatīti vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dve kāyikā ratti"
      },
      "nti bhikkhunī rattandhakāre purisassa hatthapāse ṭhānanisajjasayanāni kappayamānā pācittiyaṃ, hatthapāsaṃ vijahitvā ṭhānādīni kappayamānā dukkaṭanti dve kāyadvārasambhavā āpattiyo rattiṃ āpajjati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dve kāyikā divā"
      },
      "ti eteneva upāyena divā paṭicchanne okāse dve āpattiyo āpajjati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nijjhāyantassa ekā āpattī"
      },
      "ti ‘‘na ca, bhikkhave, sārattena mātugāmassa aṅgajātaṃ upanijjhāyitabbaṃ ",
      ". Yo upanijjhāyeyya, āpatti dukkaṭassā’’ti (pārā. 266) nijjhāyantassa ayamekā āpatti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekā piṇḍapātapaccayā"
      },
      "ti ‘‘na ca, bhikkhave, bhikkhādāyikāya mukhaṃ oloketabba’’nti (cūḷava. 366) ettha dukkaṭāpatti, antamaso yāguṃ vā byañjanaṃ vā dentassa sāmaṇerassāpi hi mukhaṃ ullokayato ",
      " dukkaṭameva. Kurundiyaṃ pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ekā piṇḍapātapaccayā"
      },
      "ti bhikkhuniparipācitaṃ piṇḍapātaṃ bhuñjantassa pācittiya’’nti vuttaṃ."
    ],
    "innerText": "Dve kāyikā rattinti bhikkhunī rattandhakāre purisassa hatthapāse ṭhānanisajjasayanāni kappayamānā pācittiyaṃ, hatthapāsaṃ vijahitvā ṭhānādīni kappayamānā dukkaṭanti dve kāyadvārasambhavā āpattiyo rattiṃ āpajjati. Dve kāyikā divāti eteneva upāyena divā paṭicchanne okāse dve āpattiyo āpajjati. Nijjhāyantassa ekā āpattīti ‘‘na ca, bhikkhave, sārattena mātugāmassa aṅgajātaṃ upanijjhāyitabbaṃ . Yo upanijjhāyeyya, āpatti dukkaṭassā’’ti (pārā. 266) nijjhāyantassa ayamekā āpatti. Ekā piṇḍapātapaccayāti ‘‘na ca, bhikkhave, bhikkhādāyikāya mukhaṃ oloketabba’’nti (cūḷava. 366) ettha dukkaṭāpatti, antamaso yāguṃ vā byañjanaṃ vā dentassa sāmaṇerassāpi hi mukhaṃ ullokayato dukkaṭameva. Kurundiyaṃ pana ‘‘ekā piṇḍapātapaccayāti bhikkhuniparipācitaṃ piṇḍapātaṃ bhuñjantassa pācittiya’’nti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭhānisaṃse sampassa"
      },
      "nti kosambakakkhandhake vuttānisaṃse. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ukkhittakā tayo vuttā"
      },
      "ti āpattiyā adassane appaṭikamme pāpikāya ca diṭṭhiyā appaṭinissaggeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tecattālīsa sammāvattanā"
      },
      "ti tesaṃyeva ukkhittakānaṃ ettakesu vattesu vattanā."
    ],
    "innerText": "Aṭṭhānisaṃse sampassanti kosambakakkhandhake vuttānisaṃse. Ukkhittakā tayo vuttāti āpattiyā adassane appaṭikamme pāpikāya ca diṭṭhiyā appaṭinissaggeti. Tecattālīsa sammāvattanāti tesaṃyeva ukkhittakānaṃ ettakesu vattesu vattanā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañcaṭhāne musāvādo"
      },
      "ti pārājikasaṅghādisesathullaccayapācittiyadukkaṭasaṅkhāte pañcaṭṭhāne musāvādo gacchati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cuddasa paramanti vuccatī"
      },
      "ti dasāhaparamādinayena heṭṭhā vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dvādasa pāṭidesanīyā"
      },
      "ti bhikkhūnaṃ cattāri bhikkhunīnaṃ aṭṭha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Catunnaṃ desanāya cā"
      },
      "ti catunnaṃ accayadesanāyāti attho. Katamā pana sāti? Devadattena payojitānaṃ abhimārānaṃ accayadesanā, anuruddhattherassa upaṭṭhāyikāya accayadesanā, vaḍḍhassa licchavino accayadesanā, vāsabhagāmiyattherassa ukkhepanīyakammaṃ katvā āgatānaṃ bhikkhūnaṃ accayadesanāti ayaṃ catunnaṃ accayadesanā ",
      " nāma."
    ],
    "innerText": "Pañcaṭhāne musāvādoti pārājikasaṅghādisesathullaccayapācittiyadukkaṭasaṅkhāte pañcaṭṭhāne musāvādo gacchati. Cuddasa paramanti vuccatīti dasāhaparamādinayena heṭṭhā vuttaṃ. Dvādasa pāṭidesanīyāti bhikkhūnaṃ cattāri bhikkhunīnaṃ aṭṭha. Catunnaṃ desanāya cāti catunnaṃ accayadesanāyāti attho. Katamā pana sāti? Devadattena payojitānaṃ abhimārānaṃ accayadesanā, anuruddhattherassa upaṭṭhāyikāya accayadesanā, vaḍḍhassa licchavino accayadesanā, vāsabhagāmiyattherassa ukkhepanīyakammaṃ katvā āgatānaṃ bhikkhūnaṃ accayadesanāti ayaṃ catunnaṃ accayadesanā nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭhaṅgiko musāvādo"
      },
      "ti ‘‘pubbevassa hoti musā bhaṇissa’’nti ādiṃ katvā ‘‘vinidhāya sañña’’nti pariyosānehi (pāci. 4-5; pari. 459) aṭṭhahi aṅgehi aṭṭhaṅgiko. Uposathaṅgānipi pāṇaṃ na hanetiādinā nayena vuttāneva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭha dūteyyaṅgānī"
      },
      "ti ‘‘idha, bhikkhave, bhikkhu sotā ca hoti sāvetā cā’’tiādinā (cūḷava. 347) nayena saṅghabhedake vuttāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭha titthiyavattāni"
      },
      " mahākhandhake vuttāni."
    ],
    "innerText": "Aṭṭhaṅgiko musāvādoti ‘‘pubbevassa hoti musā bhaṇissa’’nti ādiṃ katvā ‘‘vinidhāya sañña’’nti pariyosānehi (pāci. 4-5; pari. 459) aṭṭhahi aṅgehi aṭṭhaṅgiko. Uposathaṅgānipi pāṇaṃ na hanetiādinā nayena vuttāneva. Aṭṭha dūteyyaṅgānīti ‘‘idha, bhikkhave, bhikkhu sotā ca hoti sāvetā cā’’tiādinā (cūḷava. 347) nayena saṅghabhedake vuttāni. Aṭṭha titthiyavattāni mahākhandhake vuttāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭhavācikā upasampadā"
      },
      "ti bhikkhunīnaṃ upasampadaṃ sandhāya vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭhannaṃ paccuṭṭhātabba"
      },
      "nti bhattagge aṭṭhannaṃ bhikkhunīnaṃ itarāhi paccuṭṭhāya āsanaṃ dātabbaṃ ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhikkhunovādako aṭṭhahī"
      },
      "ti aṭṭhahaṅgehi samannāgato bhikkhu bhikkhunovādako sammannitabbo."
    ],
    "innerText": "Aṭṭhavācikā upasampadāti bhikkhunīnaṃ upasampadaṃ sandhāya vuttaṃ. Aṭṭhannaṃ paccuṭṭhātabbanti bhattagge aṭṭhannaṃ bhikkhunīnaṃ itarāhi paccuṭṭhāya āsanaṃ dātabbaṃ . Bhikkhunovādako aṭṭhahīti aṭṭhahaṅgehi samannāgato bhikkhu bhikkhunovādako sammannitabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekassa chejja"
      },
      "nti gāthāya navasu janesu yo salākaṃ gāhetvā saṅghaṃ bhindati, tasseva chejjaṃ hoti, devadatto viya pārājikaṃ āpajjati. Bhedakānuvattakānaṃ catunnaṃ thullaccayaṃ kokālikādīnaṃ ",
      " viya, dhammavādīnaṃ catunnaṃ anāpatti. Imā pana āpattiyo ca anāpattiyo ca sabbesaṃ ekavatthukā saṅghabhedavatthukā eva."
    ],
    "innerText": "Ekassa chejjanti gāthāya navasu janesu yo salākaṃ gāhetvā saṅghaṃ bhindati, tasseva chejjaṃ hoti, devadatto viya pārājikaṃ āpajjati. Bhedakānuvattakānaṃ catunnaṃ thullaccayaṃ kokālikādīnaṃ viya, dhammavādīnaṃ catunnaṃ anāpatti. Imā pana āpattiyo ca anāpattiyo ca sabbesaṃ ekavatthukā saṅghabhedavatthukā eva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nava āghātavatthūnī"
      },
      "ti gāthāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "navahī"
      },
      "ti navahi bhikkhūhi saṅgho bhijjati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ñattiyā karaṇā navā"
      },
      "ti ñattiyā kātabbāni kammāni navāti attho. Sesaṃ uttānameva."
    ],
    "innerText": "Nava āghātavatthūnīti gāthāya navahīti navahi bhikkhūhi saṅgho bhijjati. Ñattiyā karaṇā navāti ñattiyā kātabbāni kammāni navāti attho. Sesaṃ uttānameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "(4) Avandanīyapuggalādivaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "477"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dasa puggalā nābhivādetabbā"
      },
      "ti senāsanakkhandhake vuttā dasa janā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Añjali sāmīcena cā"
      },
      "ti sāmīcikammena saddhiṃ añjali ca tesaṃ na kātabbo, neva pānīyāpucchanatālavaṇṭaggahaṇādi khandhakavattaṃ tesaṃ dassetabbaṃ, na añjali paggaṇhitabboti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dasannaṃ dukkaṭa"
      },
      "nti tesaṃyeva dasannaṃ evaṃ karontassa dukkaṭaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dasa cīvaradhāraṇā"
      },
      "ti dasa divasāni atirekacīvarassa dhāraṇā anuññātāti attho."
    ],
    "innerText": "477.Dasa puggalā nābhivādetabbāti senāsanakkhandhake vuttā dasa janā. Añjali sāmīcena cāti sāmīcikammena saddhiṃ añjali ca tesaṃ na kātabbo, neva pānīyāpucchanatālavaṇṭaggahaṇādi khandhakavattaṃ tesaṃ dassetabbaṃ, na añjali paggaṇhitabboti attho. Dasannaṃ dukkaṭanti tesaṃyeva dasannaṃ evaṃ karontassa dukkaṭaṃ hoti. Dasa cīvaradhāraṇāti dasa divasāni atirekacīvarassa dhāraṇā anuññātāti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañcannaṃ vassaṃvuṭṭhānaṃ, dātabbaṃ idha cīvara"
      },
      "nti pañcannaṃ sahadhammikānaṃ sammukhāva dātabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sattannaṃ sante"
      },
      "ti disāpakkantaummattakakhittacittavedanāṭṭānaṃ tiṇṇañca ukkhittakānanti imesaṃ sattannaṃ sante patirūpe gāhake parammukhāpi dātabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Soḷasannaṃ na dātabba"
      },
      "nti sesānaṃ cīvarakkhandhake vuttānaṃ paṇḍakādīnaṃ soḷasannaṃ na dātabbaṃ."
    ],
    "innerText": "Pañcannaṃ vassaṃvuṭṭhānaṃ, dātabbaṃ idha cīvaranti pañcannaṃ sahadhammikānaṃ sammukhāva dātabbaṃ. Sattannaṃ santeti disāpakkantaummattakakhittacittavedanāṭṭānaṃ tiṇṇañca ukkhittakānanti imesaṃ sattannaṃ sante patirūpe gāhake parammukhāpi dātabbaṃ. Soḷasannaṃ na dātabbanti sesānaṃ cīvarakkhandhake vuttānaṃ paṇḍakādīnaṃ soḷasannaṃ na dātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Katisataṃ rattisataṃ, āpattiyo chādayitvānā"
      },
      "ti ",
      " katisataṃ āpattiyo rattisataṃ chādayitvāna. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dasasataṃ rattisataṃ, āpattiyo chādayitvānā"
      },
      "ti dasasataṃ āpattiyo rattisataṃ chādayitvāna. Ayañhettha saṅkhepattho – yo divase sataṃ sataṃ saṅghādisesāpattiyo āpajjitvā dasa dasa divase paṭicchādeti, tena rattisataṃ āpattisahassaṃ paṭicchāditaṃ hoti, so sabbāva tā āpattiyo dasāhapaṭicchannāti ",
      " parivāsaṃ yācitvā dasa rattiyo vasitvāna mucceyya pārivāsikoti."
    ],
    "innerText": "Katisataṃ rattisataṃ, āpattiyo chādayitvānāti katisataṃ āpattiyo rattisataṃ chādayitvāna. Dasasataṃ rattisataṃ, āpattiyo chādayitvānāti dasasataṃ āpattiyo rattisataṃ chādayitvāna. Ayañhettha saṅkhepattho – yo divase sataṃ sataṃ saṅghādisesāpattiyo āpajjitvā dasa dasa divase paṭicchādeti, tena rattisataṃ āpattisahassaṃ paṭicchāditaṃ hoti, so sabbāva tā āpattiyo dasāhapaṭicchannāti parivāsaṃ yācitvā dasa rattiyo vasitvāna mucceyya pārivāsikoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dvādasa kammadosā vuttā"
      },
      "ti apalokanakammaṃ adhammenavaggaṃ, adhammenasamaggaṃ, dhammenavaggaṃ, tathā ",
      " ñattikammañattidutiyakammañatticatutthakammānipīti evaṃ ekekasmiṃ kamme tayo tayo katvā dvādasa kammadosā vuttā."
    ],
    "innerText": "Dvādasa kammadosā vuttāti apalokanakammaṃ adhammenavaggaṃ, adhammenasamaggaṃ, dhammenavaggaṃ, tathā ñattikammañattidutiyakammañatticatutthakammānipīti evaṃ ekekasmiṃ kamme tayo tayo katvā dvādasa kammadosā vuttā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Catasso kammasampattiyo"
      },
      "ti apalokanakammaṃ dhammenasamaggaṃ, tathā sesānipīti evaṃ catasso kammasampattiyo vuttā."
    ],
    "innerText": "Catasso kammasampattiyoti apalokanakammaṃ dhammenasamaggaṃ, tathā sesānipīti evaṃ catasso kammasampattiyo vuttā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cha kammānī"
      },
      "ti adhammenavaggakammaṃ, adhammenasamaggakammaṃ, dhammapatirūpakenavaggakammaṃ, dhammapatirūpakenasamaggakammaṃ, dhammenavaggakammaṃ, dhammenasamaggakammanti evaṃ cha kammāni vuttāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekettha dhammikā katā"
      },
      "ti ekaṃ dhammena samaggakammamevettha dhammikaṃ katanti attho. Dutiyagāthāvissajjanepi etadeva dhammikaṃ."
    ],
    "innerText": "Cha kammānīti adhammenavaggakammaṃ, adhammenasamaggakammaṃ, dhammapatirūpakenavaggakammaṃ, dhammapatirūpakenasamaggakammaṃ, dhammenavaggakammaṃ, dhammenasamaggakammanti evaṃ cha kammāni vuttāni. Ekettha dhammikā katāti ekaṃ dhammena samaggakammamevettha dhammikaṃ katanti attho. Dutiyagāthāvissajjanepi etadeva dhammikaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yaṃ desitā"
      },
      "ti yāni desitāni vuttāni pakāsitāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anantajinenā"
      },
      "tiādīsu pariyantaparicchedabhāvarahitattā anantaṃ vuccati nibbānaṃ, taṃ bhagavatā raññā sapattagaṇaṃ abhimadditvā rajjaṃ viya kilesagaṇaṃ abhimadditvā jitaṃ vijitaṃ adhigataṃ sampattaṃ, tasmā bhagavā ‘‘anantajino’’ti vuccati. Sveva iṭṭhāniṭṭhesu nibbikāratāya tādi, vikkhambhanatadaṅgasamucchedapaṭipassaddhinissaraṇavivekasaṅkhātaṃ vivekapañcakaṃ addasāti vivekadassī; tena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anantajinena tādinā vivekadassinā"
      },
      " yāni āpattikkhandhāni desitāni vuttāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekettha sammati vinā samathehī"
      },
      "ti ayamettha padasambandho, yāni satthārā satta āpattikkhandhāni desitāni, tattha ekāpi āpatti vinā samathehi na sammati, atha kho cha samathā cattāri adhikaraṇānīti sabbepime dhammā sammukhāvinayena sammanti, samāyogaṃ gacchanti. Ettha pana eko sammukhāvinayova vinā samathehi sammati, samathabhāvaṃ ",
      " gacchati. Na hi tassa aññena samathena vinā anipphatti nāma atthi. Tena vuttaṃ – ‘‘ekettha sammati vinā samathehī’’ti. Iminā tāva adhippāyena aṭṭhakathāsu attho vutto. Mayaṃ pana ‘‘vinā’’ti nipātassa paṭisedhanamattamatthaṃ gahetvā ‘‘ekettha sammati vinā samathehī’’ti ",
      " etesu sattasu āpattikkhandhesu eko pārājikāpattikkhandho vinā samathehi sammatīti etamatthaṃ roceyyāma. Vuttampi cetaṃ ‘‘yā sā āpatti anavasesā, sā āpatti na katamena adhikaraṇena katamamhi ṭhāne na katamena samathena sammatī’’ti."
    ],
    "innerText": "Yaṃ desitāti yāni desitāni vuttāni pakāsitāni. Anantajinenātiādīsu pariyantaparicchedabhāvarahitattā anantaṃ vuccati nibbānaṃ, taṃ bhagavatā raññā sapattagaṇaṃ abhimadditvā rajjaṃ viya kilesagaṇaṃ abhimadditvā jitaṃ vijitaṃ adhigataṃ sampattaṃ, tasmā bhagavā ‘‘anantajino’’ti vuccati. Sveva iṭṭhāniṭṭhesu nibbikāratāya tādi, vikkhambhanatadaṅgasamucchedapaṭipassaddhinissaraṇavivekasaṅkhātaṃ vivekapañcakaṃ addasāti vivekadassī; tena anantajinena tādinā vivekadassinā yāni āpattikkhandhāni desitāni vuttāni. Ekettha sammati vinā samathehīti ayamettha padasambandho, yāni satthārā satta āpattikkhandhāni desitāni, tattha ekāpi āpatti vinā samathehi na sammati, atha kho cha samathā cattāri adhikaraṇānīti sabbepime dhammā sammukhāvinayena sammanti, samāyogaṃ gacchanti. Ettha pana eko sammukhāvinayova vinā samathehi sammati, samathabhāvaṃ gacchati. Na hi tassa aññena samathena vinā anipphatti nāma atthi. Tena vuttaṃ – ‘‘ekettha sammati vinā samathehī’’ti. Iminā tāva adhippāyena aṭṭhakathāsu attho vutto. Mayaṃ pana ‘‘vinā’’ti nipātassa paṭisedhanamattamatthaṃ gahetvā ‘‘ekettha sammati vinā samathehī’’ti etesu sattasu āpattikkhandhesu eko pārājikāpattikkhandho vinā samathehi sammatīti etamatthaṃ roceyyāma. Vuttampi cetaṃ ‘‘yā sā āpatti anavasesā, sā āpatti na katamena adhikaraṇena katamamhi ṭhāne na katamena samathena sammatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Chaūnadiyaḍḍhasatā"
      },
      "ti ",
      " ‘‘idha, upāli, bhikkhu adhammaṃ dhammoti dīpeti, tasmiṃ adhammadiṭṭhi bhede adhammadiṭṭhi, tasmiṃ adhammadiṭṭhi bhede dhammadiṭṭhi, tasmiṃ adhammadiṭṭhi bhede vematiko, tasmiṃ dhammadiṭṭhi bhede adhammadiṭṭhi, tasmiṃ dhammadiṭṭhi bhede vematiko, tasmiṃ vematiko bhede adhammadiṭṭhi, tasmiṃ vematiko bhede dhammadiṭṭhi, tasmiṃ vematiko bhede vematiko’’ti evaṃ yāni aṭṭhārasannaṃ bhedakaravatthūnaṃ vasena aṭṭhārasa aṭṭhakāni saṅghabhedakakkhandhake vuttāni, tesaṃ vasena chaūnadiyaḍḍhasataṃ āpāyikā veditabbā."
    ],
    "innerText": "Chaūnadiyaḍḍhasatāti ‘‘idha, upāli, bhikkhu adhammaṃ dhammoti dīpeti, tasmiṃ adhammadiṭṭhi bhede adhammadiṭṭhi, tasmiṃ adhammadiṭṭhi bhede dhammadiṭṭhi, tasmiṃ adhammadiṭṭhi bhede vematiko, tasmiṃ dhammadiṭṭhi bhede adhammadiṭṭhi, tasmiṃ dhammadiṭṭhi bhede vematiko, tasmiṃ vematiko bhede adhammadiṭṭhi, tasmiṃ vematiko bhede dhammadiṭṭhi, tasmiṃ vematiko bhede vematiko’’ti evaṃ yāni aṭṭhārasannaṃ bhedakaravatthūnaṃ vasena aṭṭhārasa aṭṭhakāni saṅghabhedakakkhandhake vuttāni, tesaṃ vasena chaūnadiyaḍḍhasataṃ āpāyikā veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭhārasa anāpāyikā"
      },
      "ti ‘‘idha, upāli, bhikkhu adhammaṃ dhammoti dīpeti, tasmiṃ dhammadiṭṭhi bhede dhammadiṭṭhi avinidhāya diṭṭhiṃ avinidhāya khantiṃ avinidhāya ruciṃ avinidhāya bhāvaṃ anussāveti, salākaṃ gāheti ‘ayaṃ dhammo, ayaṃ vinayo, idaṃ satthusāsanaṃ, imaṃ gaṇhatha, imaṃ rocethā’ti, ayampi kho, upāli, saṅghabhedako na āpāyiko na nerayiko na kappaṭṭho na atekiccho’’ti evaṃ ekekasmiṃ vatthusmiṃ ekekaṃ katvā saṅghabhedakakkhandhakāvasāne vuttā aṭṭhārasa janā. Aṭṭhārasa aṭṭhakā chaūnadiyaḍḍhasatavissajjane vuttāyeva."
    ],
    "innerText": "Aṭṭhārasa anāpāyikāti ‘‘idha, upāli, bhikkhu adhammaṃ dhammoti dīpeti, tasmiṃ dhammadiṭṭhi bhede dhammadiṭṭhi avinidhāya diṭṭhiṃ avinidhāya khantiṃ avinidhāya ruciṃ avinidhāya bhāvaṃ anussāveti, salākaṃ gāheti ‘ayaṃ dhammo, ayaṃ vinayo, idaṃ satthusāsanaṃ, imaṃ gaṇhatha, imaṃ rocethā’ti, ayampi kho, upāli, saṅghabhedako na āpāyiko na nerayiko na kappaṭṭho na atekiccho’’ti evaṃ ekekasmiṃ vatthusmiṃ ekekaṃ katvā saṅghabhedakakkhandhakāvasāne vuttā aṭṭhārasa janā. Aṭṭhārasa aṭṭhakā chaūnadiyaḍḍhasatavissajjane vuttāyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "(5) Soḷasakammādivaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "478"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kati kammānī"
      },
      "tiādīnaṃ sabbagāthānaṃ vissajjanaṃ uttānamevāti."
    ],
    "innerText": "478.Kati kammānītiādīnaṃ sabbagāthānaṃ vissajjanaṃ uttānamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Aparadutiyagāthāsaṅgaṇikavaṇṇanā niṭṭhitā."
  }
]