[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "Upālipañcakaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Anissitavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "417"
      },
      ". Tena ",
      " samayena buddho bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho āyasmā upāli yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā upāli bhagavantaṃ etadavoca – ‘‘katihi nu kho, bhante, aṅgehi samannāgatena bhikkhunā yāvajīvaṃ nānissitena vatthabba’’nti?"
    ],
    "innerText": "417. Tena samayena buddho bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho āyasmā upāli yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā upāli bhagavantaṃ etadavoca – ‘‘katihi nu kho, bhante, aṅgehi samannāgatena bhikkhunā yāvajīvaṃ nānissitena vatthabba’’nti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Pañcahupāli, aṅgehi samannāgatena bhikkhunā yāvajīvaṃ nānissitena vatthabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pari. 325]"
      },
      " Katamehi pañcahi? Uposathaṃ na jānāti, uposathakammaṃ na jānāti, pātimokkhaṃ na jānāti, pātimokkhuddesaṃ na jānāti, ūnapañcavasso hoti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā yāvajīvaṃ nānissitena vatthabbaṃ. Pañcahupāli, aṅgehi samannāgatena bhikkhunā yāvajīvaṃ anissitena vatthabbaṃ. Katamehi pañcahi? Uposathaṃ jānāti, uposathakammaṃ jānāti, pātimokkhaṃ jānāti, pātimokkhuddesaṃ jānāti, pañcavasso vā hoti atirekapañcavasso vā – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā yāvajīvaṃ anissitena vatthabbaṃ."
    ],
    "innerText": "‘‘Pañcahupāli, aṅgehi samannāgatena bhikkhunā yāvajīvaṃ nānissitena vatthabbaṃ. [pari. 325] Katamehi pañcahi? Uposathaṃ na jānāti, uposathakammaṃ na jānāti, pātimokkhaṃ na jānāti, pātimokkhuddesaṃ na jānāti, ūnapañcavasso hoti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā yāvajīvaṃ nānissitena vatthabbaṃ. Pañcahupāli, aṅgehi samannāgatena bhikkhunā yāvajīvaṃ anissitena vatthabbaṃ. Katamehi pañcahi? Uposathaṃ jānāti, uposathakammaṃ jānāti, pātimokkhaṃ jānāti, pātimokkhuddesaṃ jānāti, pañcavasso vā hoti atirekapañcavasso vā – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā yāvajīvaṃ anissitena vatthabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatena bhikkhunā yāvajīvaṃ nānissitena vatthabbaṃ. Katamehi pañcahi? Pavāraṇaṃ na jānāti, pavāraṇākammaṃ na jānāti, pātimokkhaṃ ",
      " na jānāti, pātimokkhuddesaṃ na jānāti, ūnapañcavasso hoti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā yāvajīvaṃ nānissitena vatthabbaṃ. Pañcahupāli, aṅgehi samannāgatena bhikkhunā yāvajīvaṃ anissitena vatthabbaṃ. Katamehi pañcahi? Pavāraṇaṃ jānāti ",
      ", pavāraṇākammaṃ jānāti, pātimokkhaṃ jānāti, pātimokkhuddesaṃ jānāti, pañcavasso vā hoti atirekapañcavasso vā – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā yāvajīvaṃ anissitena vatthabbaṃ."
    ],
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatena bhikkhunā yāvajīvaṃ nānissitena vatthabbaṃ. Katamehi pañcahi? Pavāraṇaṃ na jānāti, pavāraṇākammaṃ na jānāti, pātimokkhaṃ na jānāti, pātimokkhuddesaṃ na jānāti, ūnapañcavasso hoti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā yāvajīvaṃ nānissitena vatthabbaṃ. Pañcahupāli, aṅgehi samannāgatena bhikkhunā yāvajīvaṃ anissitena vatthabbaṃ. Katamehi pañcahi? Pavāraṇaṃ jānāti , pavāraṇākammaṃ jānāti, pātimokkhaṃ jānāti, pātimokkhuddesaṃ jānāti, pañcavasso vā hoti atirekapañcavasso vā – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā yāvajīvaṃ anissitena vatthabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatena bhikkhunā yāvajīvaṃ nānissitena vatthabbaṃ. Katamehi pañcahi? Āpattānāpattiṃ na jānāti, lahukagarukaṃ ",
      " āpattiṃ na jānāti, sāvasesānavasesaṃ āpattiṃ na jānāti, duṭṭhullāduṭṭhullaṃ āpattiṃ na jānāti, ūnapañcavasso hoti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā yāvajīvaṃ nānissitena vatthabbaṃ. Pañcahupāli, aṅgehi samannāgatena bhikkhunā yāvajīvaṃ anissitena vatthabbaṃ. Katamehi pañcahi? Āpattānāpattiṃ jānāti, lahukagarukaṃ āpattiṃ jānāti, sāvasesānavasesaṃ āpattiṃ jānāti, duṭṭhullāduṭṭhullaṃ āpattiṃ jānāti, pañcavasso vā hoti atirekapañcavasso vā – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā yāvajīvaṃ anissitena vatthabbaṃ’’."
    ],
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatena bhikkhunā yāvajīvaṃ nānissitena vatthabbaṃ. Katamehi pañcahi? Āpattānāpattiṃ na jānāti, lahukagarukaṃ āpattiṃ na jānāti, sāvasesānavasesaṃ āpattiṃ na jānāti, duṭṭhullāduṭṭhullaṃ āpattiṃ na jānāti, ūnapañcavasso hoti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā yāvajīvaṃ nānissitena vatthabbaṃ. Pañcahupāli, aṅgehi samannāgatena bhikkhunā yāvajīvaṃ anissitena vatthabbaṃ. Katamehi pañcahi? Āpattānāpattiṃ jānāti, lahukagarukaṃ āpattiṃ jānāti, sāvasesānavasesaṃ āpattiṃ jānāti, duṭṭhullāduṭṭhullaṃ āpattiṃ jānāti, pañcavasso vā hoti atirekapañcavasso vā – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā yāvajīvaṃ anissitena vatthabbaṃ’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "418"
      },
      ". ‘‘Katihi ",
      " nu kho, bhante, aṅgehi samannāgatena bhikkhunā na ",
      " upasampādetabbaṃ, na nissayo dātabbo, na sāmaṇero upaṭṭhāpetabbo’’ti?"
    ],
    "innerText": "418. ‘‘Katihi nu kho, bhante, aṅgehi samannāgatena bhikkhunā na upasampādetabbaṃ, na nissayo dātabbo, na sāmaṇero upaṭṭhāpetabbo’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[mahāva. 84]"
      },
      " ‘‘Pañcahupāli, aṅgehi samannāgatena bhikkhunā na upasampādetabbaṃ, na nissayo dātabbo, na sāmaṇero upaṭṭhāpetabbo. Katamehi pañcahi? Na paṭibalo hoti antevāsiṃ vā saddhivihāriṃ vā gilānaṃ upaṭṭhātuṃ vā upaṭṭhāpetuṃ vā, anabhirataṃ vūpakāsetuṃ vā vūpakāsāpetuṃ vā, uppannaṃ kukkuccaṃ dhammato vinodetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[imasmiṃ ṭhāne sabbattha ‘‘vinodetuṃ vā vinodāpetuṃ vā’’ti pāṭho dissati, vimativinodanīṭīkāya mahāvaggavaṇṇanā oloketabbā]"
      },
      ", abhidhamme vinetuṃ, abhivinaye vinetuṃ – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā na upasampādetabbaṃ, na nissayo dātabbo, na sāmaṇero upaṭṭhāpetabbo. Pañcahupāli, aṅgehi samannāgatena bhikkhunā upasampādetabbaṃ, nissayo dātabbo, sāmaṇero upaṭṭhāpetabbo. Katamehi pañcahi? Paṭibalo hoti antevāsiṃ vā saddhivihāriṃ vā gilānaṃ upaṭṭhātuṃ vā upaṭṭhāpetuṃ vā, anabhirataṃ vūpakāsetuṃ vā vūpakāsāpetuṃ vā, uppannaṃ kukkuccaṃ dhammato vinodetuṃ, abhidhamme vinetuṃ, abhivinaye vinetuṃ – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā upasampādetabbaṃ, nissayo dātabbo, sāmaṇero upaṭṭhāpetabbo."
    ],
    "innerText": "[mahāva. 84] ‘‘Pañcahupāli, aṅgehi samannāgatena bhikkhunā na upasampādetabbaṃ, na nissayo dātabbo, na sāmaṇero upaṭṭhāpetabbo. Katamehi pañcahi? Na paṭibalo hoti antevāsiṃ vā saddhivihāriṃ vā gilānaṃ upaṭṭhātuṃ vā upaṭṭhāpetuṃ vā, anabhirataṃ vūpakāsetuṃ vā vūpakāsāpetuṃ vā, uppannaṃ kukkuccaṃ dhammato vinodetuṃ [imasmiṃ ṭhāne sabbattha ‘‘vinodetuṃ vā vinodāpetuṃ vā’’ti pāṭho dissati, vimativinodanīṭīkāya mahāvaggavaṇṇanā oloketabbā], abhidhamme vinetuṃ, abhivinaye vinetuṃ – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā na upasampādetabbaṃ, na nissayo dātabbo, na sāmaṇero upaṭṭhāpetabbo. Pañcahupāli, aṅgehi samannāgatena bhikkhunā upasampādetabbaṃ, nissayo dātabbo, sāmaṇero upaṭṭhāpetabbo. Katamehi pañcahi? Paṭibalo hoti antevāsiṃ vā saddhivihāriṃ vā gilānaṃ upaṭṭhātuṃ vā upaṭṭhāpetuṃ vā, anabhirataṃ vūpakāsetuṃ vā vūpakāsāpetuṃ vā, uppannaṃ kukkuccaṃ dhammato vinodetuṃ, abhidhamme vinetuṃ, abhivinaye vinetuṃ – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā upasampādetabbaṃ, nissayo dātabbo, sāmaṇero upaṭṭhāpetabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatena bhikkhunā na upasampādetabbaṃ, na nissayo ",
      " dātabbo, na sāmaṇero upaṭṭhāpetabbo. Katamehi pañcahi ",
      "? Na paṭibalo hoti ",
      " antevāsiṃ vā saddhivihāriṃ vā abhisamācārikāya sikkhāya sikkhāpetuṃ, ādibrahmacāriyakāya sikkhāya vinetuṃ, adhisīle vinetuṃ, adhicitte vinetuṃ, adhipaññāya vinetuṃ – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā na upasampādetabbaṃ, na nissayo dātabbo, na sāmaṇero upaṭṭhāpetabbo. Pañcahupāli, aṅgehi samannāgatena bhikkhunā upasampādetabbaṃ, nissayo dātabbo, sāmaṇero upaṭṭhāpetabbo. Katamehi pañcahi? Paṭibalo hoti antevāsiṃ vā saddhivihāriṃ vā abhisamācārikāya sikkhāya sikkhāpetuṃ, ādibrahmacāriyakāya sikkhāya vinetuṃ, adhisīle vinetuṃ, adhicitte vinetuṃ, adhipaññāya vinetuṃ – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā upasampādetabbaṃ, nissayo dātabbo, sāmaṇero upaṭṭhāpetabbo’’ti."
    ],
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatena bhikkhunā na upasampādetabbaṃ, na nissayo dātabbo, na sāmaṇero upaṭṭhāpetabbo. Katamehi pañcahi ? Na paṭibalo hoti antevāsiṃ vā saddhivihāriṃ vā abhisamācārikāya sikkhāya sikkhāpetuṃ, ādibrahmacāriyakāya sikkhāya vinetuṃ, adhisīle vinetuṃ, adhicitte vinetuṃ, adhipaññāya vinetuṃ – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā na upasampādetabbaṃ, na nissayo dātabbo, na sāmaṇero upaṭṭhāpetabbo. Pañcahupāli, aṅgehi samannāgatena bhikkhunā upasampādetabbaṃ, nissayo dātabbo, sāmaṇero upaṭṭhāpetabbo. Katamehi pañcahi? Paṭibalo hoti antevāsiṃ vā saddhivihāriṃ vā abhisamācārikāya sikkhāya sikkhāpetuṃ, ādibrahmacāriyakāya sikkhāya vinetuṃ, adhisīle vinetuṃ, adhicitte vinetuṃ, adhipaññāya vinetuṃ – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā upasampādetabbaṃ, nissayo dātabbo, sāmaṇero upaṭṭhāpetabbo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "419"
      },
      ". ‘‘Katihi nu kho, bhante, aṅgehi samannāgatassa bhikkhuno kammaṃ kātabba’’nti?"
    ],
    "innerText": "419. ‘‘Katihi nu kho, bhante, aṅgehi samannāgatassa bhikkhuno kammaṃ kātabba’’nti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Pañcahupāli, aṅgehi samannāgatassa bhikkhuno kammaṃ kātabbaṃ. Katamehi pañcahi? Alajjī ca hoti, bālo ca, apakatatto ca, micchādiṭṭhiko ca hoti, ājīvavipanno ca – imehi kho, upāli, pañcahaṅgehi samannāgatassa bhikkhuno kammaṃ kātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatassa bhikkhuno kammaṃ kātabbaṃ. Katamehi pañcahi? Adhisīle sīlavipanno hoti, ajjhācāre ācāravipanno hoti, atidiṭṭhiyā diṭṭhivipanno hoti ",
      ", micchādiṭṭhiko ca hoti, ājīvavipanno ca – imehi kho, upāli, pañcahaṅgehi samannāgatassa bhikkhuno kammaṃ kātabbaṃ."
    ],
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatassa bhikkhuno kammaṃ kātabbaṃ. Katamehi pañcahi? Adhisīle sīlavipanno hoti, ajjhācāre ācāravipanno hoti, atidiṭṭhiyā diṭṭhivipanno hoti , micchādiṭṭhiko ca hoti, ājīvavipanno ca – imehi kho, upāli, pañcahaṅgehi samannāgatassa bhikkhuno kammaṃ kātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatassa bhikkhuno kammaṃ kātabbaṃ. Katamehi pañcahi? Kāyikena davena samannāgato hoti, vācasikena davena samannāgato hoti, kāyikavācasikena davena samannāgato hoti, micchādiṭṭhiko ",
      " ca hoti, ājīvavipanno ca – imehi kho, upāli, pañcahaṅgehi samannāgatassa bhikkhuno kammaṃ kātabbaṃ."
    ],
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatassa bhikkhuno kammaṃ kātabbaṃ. Katamehi pañcahi? Kāyikena davena samannāgato hoti, vācasikena davena samannāgato hoti, kāyikavācasikena davena samannāgato hoti, micchādiṭṭhiko ca hoti, ājīvavipanno ca – imehi kho, upāli, pañcahaṅgehi samannāgatassa bhikkhuno kammaṃ kātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi ",
      ", upāli, pañcahaṅgehi samannāgatassa bhikkhuno kammaṃ kātabbaṃ. Katamehi pañcahi? Kāyikena anācārena samannāgato hoti ",
      ", vācasikena anācārena samannāgato hoti, kāyikavācasikena anācārena samannāgato hoti, micchādiṭṭhiko ca hoti, ājīvavipanno ca – imehi kho, upāli, pañcahaṅgehi samannāgatassa bhikkhuno kammaṃ kātabbaṃ."
    ],
    "innerText": "‘‘Aparehipi , upāli, pañcahaṅgehi samannāgatassa bhikkhuno kammaṃ kātabbaṃ. Katamehi pañcahi? Kāyikena anācārena samannāgato hoti , vācasikena anācārena samannāgato hoti, kāyikavācasikena anācārena samannāgato hoti, micchādiṭṭhiko ca hoti, ājīvavipanno ca – imehi kho, upāli, pañcahaṅgehi samannāgatassa bhikkhuno kammaṃ kātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatassa bhikkhuno kammaṃ kātabbaṃ. Katamehi pañcahi? Kāyikena upaghātikena samannāgato hoti, vācasikena upaghātikena samannāgato hoti, kāyikavācasikena upaghātikena samannāgato hoti, micchādiṭṭhiko ca hoti, ājīvavipanno ca – imehi kho, upāli, pañcahaṅgehi samannāgatassa bhikkhuno kammaṃ kātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatassa bhikkhuno kammaṃ kātabbaṃ. Katamehi pañcahi? Kāyikena micchājīvena samannāgato ",
      " hoti, vācasikena micchājīvena samannāgato hoti, kāyikavācasikena micchājīvena samannāgato hoti, micchādiṭṭhiko ca hoti, ājīvavipanno ca – imehi kho, upāli, pañcahaṅgehi samannāgatassa bhikkhuno kammaṃ kātabbaṃ."
    ],
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatassa bhikkhuno kammaṃ kātabbaṃ. Katamehi pañcahi? Kāyikena micchājīvena samannāgato hoti, vācasikena micchājīvena samannāgato hoti, kāyikavācasikena micchājīvena samannāgato hoti, micchādiṭṭhiko ca hoti, ājīvavipanno ca – imehi kho, upāli, pañcahaṅgehi samannāgatassa bhikkhuno kammaṃ kātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatassa bhikkhuno kammaṃ kātabbaṃ. Katamehi pañcahi? Āpattiṃ āpanno kammakato upasampādeti, nissayaṃ deti, sāmaṇeraṃ upaṭṭhāpeti, bhikkhunovādakasammutiṃ sādiyati, sammatopi bhikkhuniyo ovadati – imehi kho, upāli, pañcahaṅgehi samannāgatassa bhikkhuno kammaṃ kātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatassa bhikkhuno kammaṃ kātabbaṃ. Katamehi pañcahi? Yāya āpattiyā saṅghena kammaṃ kataṃ hoti taṃ āpattiṃ āpajjati, aññaṃ vā tādisikaṃ, tato vā pāpiṭṭhataraṃ, kammaṃ garahati, kammike garahati – imehi kho, upāli, pañcahaṅgehi samannāgatassa bhikkhuno kammaṃ kātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi ",
      ", upāli, pañcahaṅgehi samannāgatassa bhikkhuno kammaṃ kātabbaṃ. Katamehi pañcahi? Buddhassa avaṇṇaṃ bhāsati, dhammassa avaṇṇaṃ bhāsati, saṅghassa avaṇṇaṃ bhāsati, micchādiṭṭhiko ca hoti, ājīvavipanno ca – imehi kho, upāli, pañcahaṅgehi samannāgatassa bhikkhuno kammaṃ kātabba’’nti."
    ],
    "innerText": "‘‘Aparehipi , upāli, pañcahaṅgehi samannāgatassa bhikkhuno kammaṃ kātabbaṃ. Katamehi pañcahi? Buddhassa avaṇṇaṃ bhāsati, dhammassa avaṇṇaṃ bhāsati, saṅghassa avaṇṇaṃ bhāsati, micchādiṭṭhiko ca hoti, ājīvavipanno ca – imehi kho, upāli, pañcahaṅgehi samannāgatassa bhikkhuno kammaṃ kātabba’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Anissitavaggo niṭṭhito paṭhamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Uposathaṃ ",
      " pavāraṇaṃ, āpatti ca gilānakaṃ;"
    ],
    "innerText": "Uposathaṃ pavāraṇaṃ, āpatti ca gilānakaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Abhisamācāralajjī ca, adhisīle davena ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Anācāraṃ upaghāti, micchā āpattimeva ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Yāyāpattiyā buddhassa, paṭhamo vaggasaṅgahoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Nappaṭippassambhanavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "420"
      },
      ". ‘‘Katihi nu kho, bhante, aṅgehi samannāgatassa bhikkhuno kammaṃ nappaṭippassambhetabba’’nti?"
    ],
    "innerText": "420. ‘‘Katihi nu kho, bhante, aṅgehi samannāgatassa bhikkhuno kammaṃ nappaṭippassambhetabba’’nti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Pañcahupāli, aṅgehi samannāgatassa bhikkhuno kammaṃ nappaṭippassambhetabbaṃ. Katamehi pañcahi ",
      "? Āpattiṃ āpanno kammakato upasampādeti, nissayaṃ deti, sāmaṇeraṃ upaṭṭhāpeti, bhikkhunovādakasammutiṃ sādiyati, sammatopi bhikkhuniyo ovadati – imehi kho, upāli, pañcahaṅgehi samannāgatassa bhikkhuno kammaṃ nappaṭippassambhetabbaṃ."
    ],
    "innerText": "‘‘Pañcahupāli, aṅgehi samannāgatassa bhikkhuno kammaṃ nappaṭippassambhetabbaṃ. Katamehi pañcahi ? Āpattiṃ āpanno kammakato upasampādeti, nissayaṃ deti, sāmaṇeraṃ upaṭṭhāpeti, bhikkhunovādakasammutiṃ sādiyati, sammatopi bhikkhuniyo ovadati – imehi kho, upāli, pañcahaṅgehi samannāgatassa bhikkhuno kammaṃ nappaṭippassambhetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[cūḷava. 8-9, 18, 30-31, 43, 53, 62, 72]"
      },
      " ‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatassa bhikkhuno kammaṃ nappaṭippassambhetabbaṃ. Katamehi pañcahi? Yāya āpattiyā saṅghena kammaṃ kataṃ hoti taṃ āpattiṃ āpajjati, aññaṃ vā tādisikaṃ, tato vā pāpiṭṭhataraṃ, kammaṃ garahati, kammike garahati – imehi kho, upāli, pañcahaṅgehi samannāgatassa bhikkhuno kammaṃ nappaṭippassambhetabbaṃ."
    ],
    "innerText": "[cūḷava. 8-9, 18, 30-31, 43, 53, 62, 72] ‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatassa bhikkhuno kammaṃ nappaṭippassambhetabbaṃ. Katamehi pañcahi? Yāya āpattiyā saṅghena kammaṃ kataṃ hoti taṃ āpattiṃ āpajjati, aññaṃ vā tādisikaṃ, tato vā pāpiṭṭhataraṃ, kammaṃ garahati, kammike garahati – imehi kho, upāli, pañcahaṅgehi samannāgatassa bhikkhuno kammaṃ nappaṭippassambhetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatassa bhikkhuno kammaṃ nappaṭippassambhetabbaṃ. Katamehi pañcahi? Buddhassa avaṇṇaṃ bhāsati, dhammassa avaṇṇaṃ bhāsati, saṅghassa avaṇṇaṃ bhāsati, micchādiṭṭhiko ca ",
      " hoti, ājīvavipanno ",
      " ca – imehi kho, upāli, pañcahaṅgehi samannāgatassa bhikkhuno kammaṃ nappaṭippassambhetabbaṃ."
    ],
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatassa bhikkhuno kammaṃ nappaṭippassambhetabbaṃ. Katamehi pañcahi? Buddhassa avaṇṇaṃ bhāsati, dhammassa avaṇṇaṃ bhāsati, saṅghassa avaṇṇaṃ bhāsati, micchādiṭṭhiko ca hoti, ājīvavipanno ca – imehi kho, upāli, pañcahaṅgehi samannāgatassa bhikkhuno kammaṃ nappaṭippassambhetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatassa bhikkhuno kammaṃ nappaṭippassambhetabbaṃ. Katamehi pañcahi? Alajjī ca hoti, bālo ca, apakatatto ca, omaddakārako ca hoti, vattesu ",
      " sikkhāya ca na paripūrakārī – imehi kho, upāli, pañcahaṅgehi samannāgatassa bhikkhuno kammaṃ nappaṭippassambhetabba’’nti."
    ],
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatassa bhikkhuno kammaṃ nappaṭippassambhetabbaṃ. Katamehi pañcahi? Alajjī ca hoti, bālo ca, apakatatto ca, omaddakārako ca hoti, vattesu sikkhāya ca na paripūrakārī – imehi kho, upāli, pañcahaṅgehi samannāgatassa bhikkhuno kammaṃ nappaṭippassambhetabba’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "421"
      },
      ". ‘‘Saṅgāmāvacarena, bhante, bhikkhunā saṅghaṃ upasaṅkamantena kati dhamme ajjhattaṃ upaṭṭhāpetvā saṅgho upasaṅkamitabbo’’ti?"
    ],
    "innerText": "421. ‘‘Saṅgāmāvacarena, bhante, bhikkhunā saṅghaṃ upasaṅkamantena kati dhamme ajjhattaṃ upaṭṭhāpetvā saṅgho upasaṅkamitabbo’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pari. 365]"
      },
      " ‘‘Saṅgāmāvacarena, upāli, bhikkhunā saṅghaṃ upasaṅkamantena pañca dhamme ajjhattaṃ upaṭṭhāpetvā saṅgho upasaṅkamitabbo. Katame pañca? Saṅgāmāvacarena, upāli, bhikkhunā saṅghaṃ upasaṅkamantena nīcacittena saṅgho upasaṅkamitabbo, rajoharaṇasamena cittena, āsanakusalena bhavitabbaṃ nissajjakusalena, there bhikkhū anupakhajjantena, nave bhikkhū āsanena appaṭibāhantena yathāpatirūpe āsane nisīditabbaṃ, anānākathikena bhavitabbaṃ atiracchānakathikena, sāmaṃ vā dhammo bhāsitabbo, paro vā ajjhesitabbo, ariyo vā tuṇhibhāvo nātimaññitabbo, sace, upāli, saṅgho samaggakaraṇīyāni kammāni karoti tatra ce, upāli, bhikkhuno nakkhamati, api diṭṭhāvikammaṃ katvā ñāpetabbā sāmaggī. Taṃ kissahetu? Māhaṃ saṅghena nānatto assanti. Saṅgāmāvacarenupāli ",
      ", bhikkhunā saṅghaṃ upasaṅkamantena ime pañca dhamme ajjhattaṃ upaṭṭhāpetvā saṅgho upasaṅkamitabbo’’ti."
    ],
    "innerText": "[pari. 365] ‘‘Saṅgāmāvacarena, upāli, bhikkhunā saṅghaṃ upasaṅkamantena pañca dhamme ajjhattaṃ upaṭṭhāpetvā saṅgho upasaṅkamitabbo. Katame pañca? Saṅgāmāvacarena, upāli, bhikkhunā saṅghaṃ upasaṅkamantena nīcacittena saṅgho upasaṅkamitabbo, rajoharaṇasamena cittena, āsanakusalena bhavitabbaṃ nissajjakusalena, there bhikkhū anupakhajjantena, nave bhikkhū āsanena appaṭibāhantena yathāpatirūpe āsane nisīditabbaṃ, anānākathikena bhavitabbaṃ atiracchānakathikena, sāmaṃ vā dhammo bhāsitabbo, paro vā ajjhesitabbo, ariyo vā tuṇhibhāvo nātimaññitabbo, sace, upāli, saṅgho samaggakaraṇīyāni kammāni karoti tatra ce, upāli, bhikkhuno nakkhamati, api diṭṭhāvikammaṃ katvā ñāpetabbā sāmaggī. Taṃ kissahetu? Māhaṃ saṅghena nānatto assanti. Saṅgāmāvacarenupāli , bhikkhunā saṅghaṃ upasaṅkamantena ime pañca dhamme ajjhattaṃ upaṭṭhāpetvā saṅgho upasaṅkamitabbo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "422"
      },
      ". ‘‘Katihi nu kho, bhante, aṅgehi samannāgato bhikkhu saṅghe voharanto bahujanaakanto ca hoti bahujanaamanāpo ca bahujanaarucito cā’’ti?"
    ],
    "innerText": "422. ‘‘Katihi nu kho, bhante, aṅgehi samannāgato bhikkhu saṅghe voharanto bahujanaakanto ca hoti bahujanaamanāpo ca bahujanaarucito cā’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Pañcahupāli, aṅgehi samannāgato bhikkhu saṅghe voharanto bahujanaakanto ca hoti bahujanaamanāpo ca bahujanaarucito ca. Katamehi pañcahi? Ussitamantī ca hoti, nissitajappī ca, na ca bhāsānusandhikusalo ",
      " hoti, na yathādhamme yathāvinaye yathāpattiyā codetā hoti, na yathādhamme yathāvinaye yathāpattiyā kāretā hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu saṅghe voharanto bahujanaakanto ca hoti bahujanaamanāpo ca bahujanaarucito ca. Pañcahupāli, aṅgehi samannāgato bhikkhu saṅghe voharanto bahujanakanto ca hoti bahujanamanāpo ca bahujanaarucito ca. Katamehi pañcahi? Na ussitamantī ca hoti, na nissitajappī ca, bhāsānusandhikusalo ca hoti, yathādhamme yathāvinaye yathāpattiyā codetā hoti, yathādhamme yathāvinaye yathāpattiyā kāretā hoti – imehi kho, upāli, pañcahaṅgehi ",
      " samannāgato bhikkhu saṅghe voharanto bahujanakanto ca hoti bahujanamanāpo ca bahujanarucito ca."
    ],
    "innerText": "‘‘Pañcahupāli, aṅgehi samannāgato bhikkhu saṅghe voharanto bahujanaakanto ca hoti bahujanaamanāpo ca bahujanaarucito ca. Katamehi pañcahi? Ussitamantī ca hoti, nissitajappī ca, na ca bhāsānusandhikusalo hoti, na yathādhamme yathāvinaye yathāpattiyā codetā hoti, na yathādhamme yathāvinaye yathāpattiyā kāretā hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu saṅghe voharanto bahujanaakanto ca hoti bahujanaamanāpo ca bahujanaarucito ca. Pañcahupāli, aṅgehi samannāgato bhikkhu saṅghe voharanto bahujanakanto ca hoti bahujanamanāpo ca bahujanaarucito ca. Katamehi pañcahi? Na ussitamantī ca hoti, na nissitajappī ca, bhāsānusandhikusalo ca hoti, yathādhamme yathāvinaye yathāpattiyā codetā hoti, yathādhamme yathāvinaye yathāpattiyā kāretā hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu saṅghe voharanto bahujanakanto ca hoti bahujanamanāpo ca bahujanarucito ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato bhikkhu saṅghe voharanto bahujanaakanto ca hoti bahujanaamanāpo ca ",
      " bahujanaarucito ca. Katamehi pañcahi? Ussādetā ca hoti, apasādetā ca, adhammaṃ gaṇhāti, dhammaṃ paṭibāhati, samphañca bahuṃ bhāsati – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu saṅghe voharanto bahujanaakanto ca hoti bahujanaamanāpo ca bahujanaarucito ca. Pañcahupāli, aṅgehi samannāgato bhikkhu saṅghe voharanto bahujanakanto ca hoti bahujanamanāpo ca bahujanarucito ",
      " ca. Katamehi pañcahi? Na ussādetā ca hoti, na apasādetā ca, dhammaṃ gaṇhāti, adhammaṃ paṭibāhati, samphañca na bahuṃ bhāsati – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu saṅghe voharanto bahujanakanto ca hoti bahujanamanāpo ca bahujanarucito ca."
    ],
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato bhikkhu saṅghe voharanto bahujanaakanto ca hoti bahujanaamanāpo ca bahujanaarucito ca. Katamehi pañcahi? Ussādetā ca hoti, apasādetā ca, adhammaṃ gaṇhāti, dhammaṃ paṭibāhati, samphañca bahuṃ bhāsati – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu saṅghe voharanto bahujanaakanto ca hoti bahujanaamanāpo ca bahujanaarucito ca. Pañcahupāli, aṅgehi samannāgato bhikkhu saṅghe voharanto bahujanakanto ca hoti bahujanamanāpo ca bahujanarucito ca. Katamehi pañcahi? Na ussādetā ca hoti, na apasādetā ca, dhammaṃ gaṇhāti, adhammaṃ paṭibāhati, samphañca na bahuṃ bhāsati – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu saṅghe voharanto bahujanakanto ca hoti bahujanamanāpo ca bahujanarucito ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato bhikkhu saṅghe voharanto bahujanaakanto ca hoti bahujanaamanāpo ca bahujanaarucito ca. Katamehi pañcahi? Pasayhapavattā hoti, anokāsakammaṃ kāretvā pavattā hoti, na yathādhamme yathāvinaye yathāpattiyā codetā hoti, na yathādhamme yathāvinaye yathāpattiyā kāretā hoti, na yathādiṭṭhiyā byākatā hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu saṅghe voharanto bahujanaakanto ca hoti bahujanaamanāpo ",
      " ca bahujanaarucito ca. Pañcahupāli, aṅgehi samannāgato bhikkhu saṅghe voharanto bahujanakanto ca hoti bahujanamanāpo ca bahujanarucito ca. Katamehi pañcahi? Na ",
      " pasayhapavattā hoti, okāsakammaṃ kāretvā pavattā hoti, yathādhamme yathāvinaye yathāpattiyā codetā hoti, yathādhamme yathāvinaye yathāpattiyā kāretā hoti, yathādiṭṭhiyā byākatā hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu saṅghe voharanto bahujanakanto ca hoti bahujanamanāpo ca bahujanarucito cā’’ti."
    ],
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato bhikkhu saṅghe voharanto bahujanaakanto ca hoti bahujanaamanāpo ca bahujanaarucito ca. Katamehi pañcahi? Pasayhapavattā hoti, anokāsakammaṃ kāretvā pavattā hoti, na yathādhamme yathāvinaye yathāpattiyā codetā hoti, na yathādhamme yathāvinaye yathāpattiyā kāretā hoti, na yathādiṭṭhiyā byākatā hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu saṅghe voharanto bahujanaakanto ca hoti bahujanaamanāpo ca bahujanaarucito ca. Pañcahupāli, aṅgehi samannāgato bhikkhu saṅghe voharanto bahujanakanto ca hoti bahujanamanāpo ca bahujanarucito ca. Katamehi pañcahi? Na pasayhapavattā hoti, okāsakammaṃ kāretvā pavattā hoti, yathādhamme yathāvinaye yathāpattiyā codetā hoti, yathādhamme yathāvinaye yathāpattiyā kāretā hoti, yathādiṭṭhiyā byākatā hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu saṅghe voharanto bahujanakanto ca hoti bahujanamanāpo ca bahujanarucito cā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "423"
      },
      ". ‘‘Kati nu kho, bhante, ānisaṃsā vinayapariyattiyā’’ti?"
    ],
    "innerText": "423. ‘‘Kati nu kho, bhante, ānisaṃsā vinayapariyattiyā’’ti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Pañcime, upāli, ānisaṃsā vinayapariyattiyā. Katame pañca? Attano sīlakkhandho sugutto hoti surakkhito, kukkuccapakatānaṃ paṭisaraṇaṃ hoti, visārado saṅghamajjhe ",
      " voharati, paccatthike sahadhammena suniggahitaṃ niggaṇhāti, saddhammaṭṭhitiyā paṭipanno hoti – imehi kho, upāli, pañcānisaṃsā vinayapariyattiyā’’."
    ],
    "innerText": "‘‘Pañcime, upāli, ānisaṃsā vinayapariyattiyā. Katame pañca? Attano sīlakkhandho sugutto hoti surakkhito, kukkuccapakatānaṃ paṭisaraṇaṃ hoti, visārado saṅghamajjhe voharati, paccatthike sahadhammena suniggahitaṃ niggaṇhāti, saddhammaṭṭhitiyā paṭipanno hoti – imehi kho, upāli, pañcānisaṃsā vinayapariyattiyā’’."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Nappaṭippassambhanavaggo niṭṭhito dutiyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Āpanno yāyavaṇṇañca, alajjī saṅgāmena ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Ussitā ussādetā ca, pasayha pariyattiyāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṭhamayamakapaññatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Vohāravaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "424"
      },
      ". ‘‘Katihi ",
      " nu kho, bhante, aṅgehi samannāgatena bhikkhunā saṅghe na voharitabba’’nti?"
    ],
    "innerText": "424. ‘‘Katihi nu kho, bhante, aṅgehi samannāgatena bhikkhunā saṅghe na voharitabba’’nti?"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Pañcahupāli, aṅgehi samannāgatena bhikkhunā saṅghe na voharitabbaṃ. Katamehi pañcahi? Āpattiṃ na jānāti, āpattisamuṭṭhānaṃ na jānāti, āpattiyā payogaṃ na ",
      " jānāti, āpattiyā vūpasamaṃ na jānāti, āpattiyā na vinicchayakusalo hoti – imehi kho, upāli, pañcahaṅgehi ",
      " samannāgatena bhikkhunā saṅghe na voharitabbaṃ. Pañcahupāli, aṅgehi samannāgatena bhikkhunā saṅghe voharitabbaṃ. Katamehi pañcahi? Āpattiṃ jānāti, āpattisamuṭṭhānaṃ jānāti, āpattiyā payogaṃ jānāti, āpattiyā vūpasamaṃ jānāti, āpattiyā vinicchayakusalo hoti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe voharitabbaṃ."
    ],
    "innerText": "‘‘Pañcahupāli, aṅgehi samannāgatena bhikkhunā saṅghe na voharitabbaṃ. Katamehi pañcahi? Āpattiṃ na jānāti, āpattisamuṭṭhānaṃ na jānāti, āpattiyā payogaṃ na jānāti, āpattiyā vūpasamaṃ na jānāti, āpattiyā na vinicchayakusalo hoti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe na voharitabbaṃ. Pañcahupāli, aṅgehi samannāgatena bhikkhunā saṅghe voharitabbaṃ. Katamehi pañcahi? Āpattiṃ jānāti, āpattisamuṭṭhānaṃ jānāti, āpattiyā payogaṃ jānāti, āpattiyā vūpasamaṃ jānāti, āpattiyā vinicchayakusalo hoti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe voharitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe na voharitabbaṃ. Katamehi pañcahi? Adhikaraṇaṃ na jānāti, adhikaraṇasamuṭṭhānaṃ na jānāti, adhikaraṇassa payogaṃ na jānāti, adhikaraṇassa vūpasamaṃ na jānāti, adhikaraṇassa na vinicchayakusalo hoti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe na voharitabbaṃ. Pañcahupāli, aṅgehi samannāgatena bhikkhunā saṅghe voharitabbaṃ. Katamehi pañcahi? Adhikaraṇaṃ jānāti ",
      ", adhikaraṇasamuṭṭhānaṃ jānāti, adhikaraṇassa payogaṃ jānāti, adhikaraṇassa vūpasamaṃ jānāti, adhikaraṇassa vinicchayakusalo hoti – imehi kho, upāli pañcahaṅgehi samannāgatena bhikkhunā saṅghe voharitabbaṃ."
    ],
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe na voharitabbaṃ. Katamehi pañcahi? Adhikaraṇaṃ na jānāti, adhikaraṇasamuṭṭhānaṃ na jānāti, adhikaraṇassa payogaṃ na jānāti, adhikaraṇassa vūpasamaṃ na jānāti, adhikaraṇassa na vinicchayakusalo hoti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe na voharitabbaṃ. Pañcahupāli, aṅgehi samannāgatena bhikkhunā saṅghe voharitabbaṃ. Katamehi pañcahi? Adhikaraṇaṃ jānāti , adhikaraṇasamuṭṭhānaṃ jānāti, adhikaraṇassa payogaṃ jānāti, adhikaraṇassa vūpasamaṃ jānāti, adhikaraṇassa vinicchayakusalo hoti – imehi kho, upāli pañcahaṅgehi samannāgatena bhikkhunā saṅghe voharitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatena ",
      " bhikkhunā saṅghe na voharitabbaṃ. Katamehi pañcahi? Pasayhapavattā hoti, anokāsakammaṃ kāretvā pavattā hoti, na yathādhamme yathāvinaye yathāpattiyā codetā hoti, na yathādhamme yathāvinaye yathāpattiyā kāretā hoti, na yathādiṭṭhiyā byākatā hoti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe na voharitabbaṃ. Pañcahupāli, aṅgehi samannāgatena bhikkhunā saṅghe voharitabbaṃ. Katamehi pañcahi? Na pasayhapavattā hoti, okāsakammaṃ kāretvā pavattā hoti, yathādhamme yathāvinaye yathāpattiyā codetā hoti, yathādhamme yathāvinaye yathāpattiyā kāretā hoti, yathādiṭṭhiyā byākatā hoti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe voharitabbaṃ."
    ],
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe na voharitabbaṃ. Katamehi pañcahi? Pasayhapavattā hoti, anokāsakammaṃ kāretvā pavattā hoti, na yathādhamme yathāvinaye yathāpattiyā codetā hoti, na yathādhamme yathāvinaye yathāpattiyā kāretā hoti, na yathādiṭṭhiyā byākatā hoti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe na voharitabbaṃ. Pañcahupāli, aṅgehi samannāgatena bhikkhunā saṅghe voharitabbaṃ. Katamehi pañcahi? Na pasayhapavattā hoti, okāsakammaṃ kāretvā pavattā hoti, yathādhamme yathāvinaye yathāpattiyā codetā hoti, yathādhamme yathāvinaye yathāpattiyā kāretā hoti, yathādiṭṭhiyā byākatā hoti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe voharitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe na voharitabbaṃ. Katamehi pañcahi? Āpattānāpattiṃ na jānāti, lahukagarukaṃ āpattiṃ na jānāti, sāvasesānavasesaṃ āpattiṃ na jānāti, duṭṭhullāduṭṭhullaṃ ",
      " āpattiṃ na jānāti, sappaṭikammaṃ appaṭikammaṃ āpattiṃ na jānāti – imehi ",
      " kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe na voharitabbaṃ. Pañcahupāli, aṅgehi samannāgatena bhikkhunā saṅghe voharitabbaṃ. Katamehi pañcahi? Āpattānāpattiṃ jānāti, lahukagarukaṃ āpattiṃ jānāti, sāvasesānavasesaṃ āpattiṃ jānāti, duṭṭhullāduṭṭhullaṃ āpattiṃ jānāti, sappaṭikammaṃ appaṭikammaṃ āpattiṃ jānāti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe voharitabbaṃ."
    ],
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe na voharitabbaṃ. Katamehi pañcahi? Āpattānāpattiṃ na jānāti, lahukagarukaṃ āpattiṃ na jānāti, sāvasesānavasesaṃ āpattiṃ na jānāti, duṭṭhullāduṭṭhullaṃ āpattiṃ na jānāti, sappaṭikammaṃ appaṭikammaṃ āpattiṃ na jānāti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe na voharitabbaṃ. Pañcahupāli, aṅgehi samannāgatena bhikkhunā saṅghe voharitabbaṃ. Katamehi pañcahi? Āpattānāpattiṃ jānāti, lahukagarukaṃ āpattiṃ jānāti, sāvasesānavasesaṃ āpattiṃ jānāti, duṭṭhullāduṭṭhullaṃ āpattiṃ jānāti, sappaṭikammaṃ appaṭikammaṃ āpattiṃ jānāti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe voharitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe na voharitabbaṃ. Katamehi pañcahi? Kammaṃ na jānāti, kammassa karaṇaṃ na jānāti, kammassa vatthuṃ na jānāti, kammassa vattaṃ na jānāti, kammassa vūpasamaṃ na jānāti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe na voharitabbaṃ. Pañcahupāli ",
      ", aṅgehi samannāgatena bhikkhunā saṅghe voharitabbaṃ. Katamehi pañcahi? Kammaṃ jānāti, kammassa karaṇaṃ jānāti, kammassa vatthuṃ jānāti, kammassa vattaṃ jānāti, kammassa vūpasamaṃ jānāti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe voharitabbaṃ."
    ],
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe na voharitabbaṃ. Katamehi pañcahi? Kammaṃ na jānāti, kammassa karaṇaṃ na jānāti, kammassa vatthuṃ na jānāti, kammassa vattaṃ na jānāti, kammassa vūpasamaṃ na jānāti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe na voharitabbaṃ. Pañcahupāli , aṅgehi samannāgatena bhikkhunā saṅghe voharitabbaṃ. Katamehi pañcahi? Kammaṃ jānāti, kammassa karaṇaṃ jānāti, kammassa vatthuṃ jānāti, kammassa vattaṃ jānāti, kammassa vūpasamaṃ jānāti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe voharitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi ",
      ", upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe na voharitabbaṃ. Katamehi pañcahi? Vatthuṃ na jānāti, nidānaṃ na jānāti, paññattiṃ na jānāti, padapaccābhaṭṭhaṃ na jānāti, anusandhivacanapathaṃ na jānāti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe na voharitabbaṃ. Pañcahupāli, aṅgehi samannāgatena bhikkhunā saṅghe voharitabbaṃ. Katamehi pañcahi? Vatthuṃ jānāti, nidānaṃ jānāti, paññattiṃ jānāti, padapaccābhaṭṭhaṃ jānāti, anusandhivacanapathaṃ jānāti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe voharitabbaṃ."
    ],
    "innerText": "‘‘Aparehipi , upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe na voharitabbaṃ. Katamehi pañcahi? Vatthuṃ na jānāti, nidānaṃ na jānāti, paññattiṃ na jānāti, padapaccābhaṭṭhaṃ na jānāti, anusandhivacanapathaṃ na jānāti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe na voharitabbaṃ. Pañcahupāli, aṅgehi samannāgatena bhikkhunā saṅghe voharitabbaṃ. Katamehi pañcahi? Vatthuṃ jānāti, nidānaṃ jānāti, paññattiṃ jānāti, padapaccābhaṭṭhaṃ jānāti, anusandhivacanapathaṃ jānāti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe voharitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe na voharitabbaṃ ",
      ". Katamehi pañcahi? Chandāgatiṃ gacchati, dosāgatiṃ gacchati, mohāgatiṃ gacchati, bhayāgatiṃ gacchati, alajjī ca hoti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe na voharitabbaṃ. Pañcahupāli, aṅgehi samannāgatena bhikkhunā saṅghe voharitabbaṃ. Katamehi pañcahi? Na chandāgatiṃ gacchati, na dosāgatiṃ gacchati, na mohāgatiṃ ",
      " gacchati, na bhayāgatiṃ gacchati, lajjī ca hoti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe voharitabbaṃ."
    ],
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe na voharitabbaṃ . Katamehi pañcahi? Chandāgatiṃ gacchati, dosāgatiṃ gacchati, mohāgatiṃ gacchati, bhayāgatiṃ gacchati, alajjī ca hoti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe na voharitabbaṃ. Pañcahupāli, aṅgehi samannāgatena bhikkhunā saṅghe voharitabbaṃ. Katamehi pañcahi? Na chandāgatiṃ gacchati, na dosāgatiṃ gacchati, na mohāgatiṃ gacchati, na bhayāgatiṃ gacchati, lajjī ca hoti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe voharitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe na voharitabbaṃ. Katamehi pañcahi? Chandāgatiṃ gacchati, dosāgatiṃ gacchati, mohāgatiṃ gacchati, bhayāgatiṃ gacchati, akusalo ca hoti vinaye – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe na voharitabbaṃ. Pañcahupāli, aṅgehi samannāgatena bhikkhunā saṅghe voharitabbaṃ. Katamehi pañcahi? Na chandāgatiṃ gacchati, na dosāgatiṃ gacchati, na mohāgatiṃ gacchati, na bhayāgatiṃ gacchati, kusalo ca hoti vinaye – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe voharitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe na voharitabbaṃ. Katamehi pañcahi? Ñattiṃ na jānāti, ñattiyā karaṇaṃ na jānāti, ñattiyā anussāvanaṃ na jānāti, ñattiyā samathaṃ na jānāti, ñattiyā vūpasamaṃ na jānāti – imehi kho, upāli ",
      ", pañcahaṅgehi samannāgatena bhikkhunā saṅghe na voharitabbaṃ. Pañcahupāli, aṅgehi samannāgatena bhikkhunā saṅghe voharitabbaṃ. Katamehi pañcahi? Ñattiṃ jānāti, ñattiyā karaṇaṃ ",
      " jānāti, ñattiyā anussāvanaṃ jānāti, ñattiyā samathaṃ jānāti, ñattiyā vūpasamaṃ jānāti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe voharitabbaṃ."
    ],
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe na voharitabbaṃ. Katamehi pañcahi? Ñattiṃ na jānāti, ñattiyā karaṇaṃ na jānāti, ñattiyā anussāvanaṃ na jānāti, ñattiyā samathaṃ na jānāti, ñattiyā vūpasamaṃ na jānāti – imehi kho, upāli , pañcahaṅgehi samannāgatena bhikkhunā saṅghe na voharitabbaṃ. Pañcahupāli, aṅgehi samannāgatena bhikkhunā saṅghe voharitabbaṃ. Katamehi pañcahi? Ñattiṃ jānāti, ñattiyā karaṇaṃ jānāti, ñattiyā anussāvanaṃ jānāti, ñattiyā samathaṃ jānāti, ñattiyā vūpasamaṃ jānāti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe voharitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe na voharitabbaṃ. Katamehi pañcahi? Suttaṃ na jānāti, suttānulomaṃ na jānāti, vinayaṃ na jānāti, vinayānulomaṃ na jānāti, na ca ṭhānāṭhānakusalo hoti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe na voharitabbaṃ. Pañcahupāli, aṅgehi samannāgatena bhikkhunā saṅghe voharitabbaṃ. Katamehi pañcahi? Suttaṃ jānāti, suttānulomaṃ jānāti, vinayaṃ jānāti, vinayānulomaṃ jānāti, ṭhānāṭhānakusalo ca hoti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe voharitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi ",
      ", upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe na voharitabbaṃ. Katamehi pañcahi? Dhammaṃ na jānāti, dhammānulomaṃ na jānāti, vinayaṃ na jānāti, vinayānulomaṃ na jānāti, na ca pubbāparakusalo hoti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe na voharitabbaṃ. Pañcahupāli, aṅgehi samannāgatena bhikkhunā saṅghe voharitabbaṃ. Katamehi ",
      " pañcahi? Dhammaṃ jānāti, dhammānulomaṃ jānāti, vinayaṃ jānāti, vinayānulomaṃ jānāti, pubbāparakusalo ca hoti – imehi ",
      " kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe voharitabba’’nti."
    ],
    "innerText": "‘‘Aparehipi , upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe na voharitabbaṃ. Katamehi pañcahi? Dhammaṃ na jānāti, dhammānulomaṃ na jānāti, vinayaṃ na jānāti, vinayānulomaṃ na jānāti, na ca pubbāparakusalo hoti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe na voharitabbaṃ. Pañcahupāli, aṅgehi samannāgatena bhikkhunā saṅghe voharitabbaṃ. Katamehi pañcahi? Dhammaṃ jānāti, dhammānulomaṃ jānāti, vinayaṃ jānāti, vinayānulomaṃ jānāti, pubbāparakusalo ca hoti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saṅghe voharitabba’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vohāravaggo niṭṭhito tatiyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Āpatti adhikaraṇaṃ, pasayhāpatti jānanā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Kammaṃ vatthuṃ alajjī ca, akusalo ca ñattiyā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Suttaṃ na jānāti dhammaṃ, tatiyo vaggasaṅgahoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Diṭṭhāvikammavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "425"
      },
      ". ‘‘Kati nu kho, bhante, adhammikā diṭṭhāvikammā’’ti? ‘‘Pañcime, upāli, adhammikā diṭṭhāvikammā. Katame pañca? Anāpattiyā diṭṭhiṃ āvi karoti, adesanāgāminiyā ",
      " āpattiyā diṭṭhiṃ āvi karoti, desitāya āpattiyā diṭṭhiṃ āvi karoti, catūhi pañcahi diṭṭhiṃ āvi karoti, mano mānasena diṭṭhiṃ āvi karoti – ime kho, upāli, pañca adhammikā diṭṭhāvikammā."
    ],
    "innerText": "425. ‘‘Kati nu kho, bhante, adhammikā diṭṭhāvikammā’’ti? ‘‘Pañcime, upāli, adhammikā diṭṭhāvikammā. Katame pañca? Anāpattiyā diṭṭhiṃ āvi karoti, adesanāgāminiyā āpattiyā diṭṭhiṃ āvi karoti, desitāya āpattiyā diṭṭhiṃ āvi karoti, catūhi pañcahi diṭṭhiṃ āvi karoti, mano mānasena diṭṭhiṃ āvi karoti – ime kho, upāli, pañca adhammikā diṭṭhāvikammā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Pañcime, upāli, dhammikā diṭṭhāvikammā. Katame pañca? Āpattiyā diṭṭhiṃ āvi karoti, desanāgāminiyā āpattiyā diṭṭhiṃ āvi karoti, adesitāya āpattiyā diṭṭhiṃ āvi karoti, na catūhi pañcahi diṭṭhiṃ āvi karoti, na mano mānasena diṭṭhiṃ āvi karoti – ime kho, upāli, pañca dhammikā diṭṭhāvikammā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparepi ",
      ", upāli, pañca adhammikā diṭṭhāvikammā. Katame ",
      " pañca? Nānāsaṃvāsakassa santike diṭṭhiṃ āvi karoti, nānāsīmāya ṭhitassa santike diṭṭhiṃ āvi karoti, apakatattassa santike diṭṭhiṃ āvi karoti, catūhi pañcahi diṭṭhiṃ āvi karoti, mano mānasena diṭṭhiṃ āvi karoti – ime kho, upāli, pañca adhammikā diṭṭhāvikammā."
    ],
    "innerText": "‘‘Aparepi , upāli, pañca adhammikā diṭṭhāvikammā. Katame pañca? Nānāsaṃvāsakassa santike diṭṭhiṃ āvi karoti, nānāsīmāya ṭhitassa santike diṭṭhiṃ āvi karoti, apakatattassa santike diṭṭhiṃ āvi karoti, catūhi pañcahi diṭṭhiṃ āvi karoti, mano mānasena diṭṭhiṃ āvi karoti – ime kho, upāli, pañca adhammikā diṭṭhāvikammā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Pañcime, upāli, dhammikā diṭṭhāvikammā. Katame pañca? Samānasaṃvāsakassa santike diṭṭhiṃ āvi karoti, samānasīmāya ṭhitassa santike diṭṭhiṃ āvi karoti, pakatattassa santike diṭṭhiṃ āvi karoti, na catūhi pañcahi diṭṭhiṃ āvi karoti, na mano mānasena diṭṭhiṃ āvi karoti – ime kho, upāli, pañca dhammikā diṭṭhāvikammāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "426"
      },
      ". ‘‘Kati nu kho, bhante, adhammikā paṭiggahā’’ti? ‘‘Pañcime, upāli, adhammikā paṭiggahā. Katame pañca? Kāyena diyyamānaṃ kāyena appaṭiggahitaṃ, kāyena diyyamānaṃ kāyappaṭibaddhena appaṭiggahitaṃ, kāyappaṭibaddhena diyyamānaṃ kāyena appaṭiggahitaṃ, kāyappaṭibaddhena diyyamānaṃ kāyappaṭibaddhena appaṭiggahitaṃ, nissaggiyena diyyamānaṃ kāyena vā kāyappaṭibaddhena vā appaṭiggahitaṃ – ime kho, upāli, pañca adhammikā paṭiggahā."
    ],
    "innerText": "426. ‘‘Kati nu kho, bhante, adhammikā paṭiggahā’’ti? ‘‘Pañcime, upāli, adhammikā paṭiggahā. Katame pañca? Kāyena diyyamānaṃ kāyena appaṭiggahitaṃ, kāyena diyyamānaṃ kāyappaṭibaddhena appaṭiggahitaṃ, kāyappaṭibaddhena diyyamānaṃ kāyena appaṭiggahitaṃ, kāyappaṭibaddhena diyyamānaṃ kāyappaṭibaddhena appaṭiggahitaṃ, nissaggiyena diyyamānaṃ kāyena vā kāyappaṭibaddhena vā appaṭiggahitaṃ – ime kho, upāli, pañca adhammikā paṭiggahā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Pañcime, upāli, dhammikā paṭiggahā. Katame pañca? Kāyena diyyamānaṃ kāyena paṭiggahitaṃ, kāyena diyyamānaṃ kāyappaṭibaddhena paṭiggahitaṃ, kāyappaṭibaddhena diyyamānaṃ kāyena paṭiggahitaṃ, kāyappaṭibaddhena diyyamānaṃ kāyappaṭibaddhena paṭiggahitaṃ, nissaggiyena diyyamānaṃ kāyena vā kāyappaṭibaddhena vā paṭiggahitaṃ – ime ",
      " kho, upāli, pañca dhammikā paṭiggahā’’ti."
    ],
    "innerText": "‘‘Pañcime, upāli, dhammikā paṭiggahā. Katame pañca? Kāyena diyyamānaṃ kāyena paṭiggahitaṃ, kāyena diyyamānaṃ kāyappaṭibaddhena paṭiggahitaṃ, kāyappaṭibaddhena diyyamānaṃ kāyena paṭiggahitaṃ, kāyappaṭibaddhena diyyamānaṃ kāyappaṭibaddhena paṭiggahitaṃ, nissaggiyena diyyamānaṃ kāyena vā kāyappaṭibaddhena vā paṭiggahitaṃ – ime kho, upāli, pañca dhammikā paṭiggahā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "427"
      },
      ". ‘‘Kati ",
      " nu kho, bhante, anatirittā’’ti? ‘‘Pañcime, upāli, anatirittā. Katame pañca? ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pāci. 239]"
      },
      " Akappiyakataṃ hoti, appaṭiggahitakataṃ hoti anuccāritakataṃ hoti, ahatthapāse kataṃ hoti, alametaṃ sabbanti avuttaṃ hoti – ime kho, upāli, pañca anatirittā."
    ],
    "innerText": "427. ‘‘Kati nu kho, bhante, anatirittā’’ti? ‘‘Pañcime, upāli, anatirittā. Katame pañca? [pāci. 239] Akappiyakataṃ hoti, appaṭiggahitakataṃ hoti anuccāritakataṃ hoti, ahatthapāse kataṃ hoti, alametaṃ sabbanti avuttaṃ hoti – ime kho, upāli, pañca anatirittā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Pañcime, upāli, atirittā. Katame pañca? ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pāci. 239]"
      },
      " Kappiyakataṃ hoti, paṭiggahitakataṃ hoti, uccāritakataṃ hoti, hatthapāse kataṃ hoti, alametaṃ sabbanti vuttaṃ hoti – ime kho, upāli, pañca atirittā’’ti."
    ],
    "innerText": "‘‘Pañcime, upāli, atirittā. Katame pañca? [pāci. 239] Kappiyakataṃ hoti, paṭiggahitakataṃ hoti, uccāritakataṃ hoti, hatthapāse kataṃ hoti, alametaṃ sabbanti vuttaṃ hoti – ime kho, upāli, pañca atirittā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "428"
      },
      ". ‘‘Katihi ",
      " nu kho, bhante, ākārehi pavāraṇā paññāyatī’’ti? ‘‘Pañcahupāli, ākārehi pavāraṇā paññāyati. Katamehi pañcahi? ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pāci. 239]"
      },
      " Asanaṃ paññāyati, bhojanaṃ paññāyati, hatthapāse ṭhito abhiharati, paṭikkhepo paññāyati – imehi kho, upāli, pañcahākārehi pavāraṇā paññāyatī’’ti."
    ],
    "innerText": "428. ‘‘Katihi nu kho, bhante, ākārehi pavāraṇā paññāyatī’’ti? ‘‘Pañcahupāli, ākārehi pavāraṇā paññāyati. Katamehi pañcahi? [pāci. 239] Asanaṃ paññāyati, bhojanaṃ paññāyati, hatthapāse ṭhito abhiharati, paṭikkhepo paññāyati – imehi kho, upāli, pañcahākārehi pavāraṇā paññāyatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "429"
      },
      ". ‘‘Kati nu kho, bhante, adhammikā paṭiññātakaraṇā’’ti? ‘‘Pañcime, upāli, adhammikā paṭiññātakaraṇā. Katame pañca? Bhikkhu pārājikaṃ ajjhāpanno hoti, pārājikena codiyamāno saṅghādisesaṃ ajjhāpanno paṭijānāti, taṃ saṅgho saṅghādisesena kāreti, adhammikaṃ paṭiññātakaraṇaṃ ",
      ". Bhikkhu pārājikaṃ ajjhāpanno hoti, pārājikena codiyamāno pācittiyaṃ…pe… pāṭidesanīyaṃ… dukkaṭaṃ ajjhāpanno paṭijānāti, taṃ saṅgho dukkaṭena kāreti, adhammikaṃ paṭiññātakaraṇaṃ. Bhikkhu saṅghādisesaṃ…pe… pācittiyaṃ… pāṭidesanīyaṃ… dukkaṭaṃ ajjhāpanno hoti. Dukkaṭena codiyamāno pārājikaṃ ajjhāpanno paṭijānāti, taṃ saṅgho pārājikena kāreti, adhammikaṃ paṭiññātakaraṇaṃ. Bhikkhu dukkaṭaṃ ajjhāpanno hoti, dukkaṭena codiyamāno saṅghādisesaṃ…pe… pācittiyaṃ… pāṭidesanīyaṃ ajjhāpanno paṭijānāti, taṃ saṅgho pāṭidesanīyena kāreti – adhammikaṃ paṭiññātakaraṇaṃ. Ime kho, upāli, pañca adhammikā paṭiññātakaraṇā."
    ],
    "innerText": "429. ‘‘Kati nu kho, bhante, adhammikā paṭiññātakaraṇā’’ti? ‘‘Pañcime, upāli, adhammikā paṭiññātakaraṇā. Katame pañca? Bhikkhu pārājikaṃ ajjhāpanno hoti, pārājikena codiyamāno saṅghādisesaṃ ajjhāpanno paṭijānāti, taṃ saṅgho saṅghādisesena kāreti, adhammikaṃ paṭiññātakaraṇaṃ . Bhikkhu pārājikaṃ ajjhāpanno hoti, pārājikena codiyamāno pācittiyaṃ…pe… pāṭidesanīyaṃ… dukkaṭaṃ ajjhāpanno paṭijānāti, taṃ saṅgho dukkaṭena kāreti, adhammikaṃ paṭiññātakaraṇaṃ. Bhikkhu saṅghādisesaṃ…pe… pācittiyaṃ… pāṭidesanīyaṃ… dukkaṭaṃ ajjhāpanno hoti. Dukkaṭena codiyamāno pārājikaṃ ajjhāpanno paṭijānāti, taṃ saṅgho pārājikena kāreti, adhammikaṃ paṭiññātakaraṇaṃ. Bhikkhu dukkaṭaṃ ajjhāpanno hoti, dukkaṭena codiyamāno saṅghādisesaṃ…pe… pācittiyaṃ… pāṭidesanīyaṃ ajjhāpanno paṭijānāti, taṃ saṅgho pāṭidesanīyena kāreti – adhammikaṃ paṭiññātakaraṇaṃ. Ime kho, upāli, pañca adhammikā paṭiññātakaraṇā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Pañcime, upāli, dhammikā paṭiññātakaraṇā. Katame pañca? Bhikkhu pārājikaṃ ajjhāpanno hoti, pārājikena codiyamāno pārājikaṃ ajjhāpanno paṭijānāti, taṃ saṅgho pārājikena kāreti, dhammikaṃ paṭiññātakaraṇaṃ. Bhikkhu saṅghādisesaṃ…pe… pācittiyaṃ… pāṭidesanīyaṃ… dukkaṭaṃ ajjhāpanno hoti, dukkaṭena codiyamāno dukkaṭaṃ ajjhāpanno paṭijānāti ",
      ", taṃ saṅgho dukkaṭena kāreti, dhammikaṃ paṭiññātakaraṇaṃ. Ime kho, upāli, pañca dhammikā paṭiññātakaraṇā’’ti."
    ],
    "innerText": "‘‘Pañcime, upāli, dhammikā paṭiññātakaraṇā. Katame pañca? Bhikkhu pārājikaṃ ajjhāpanno hoti, pārājikena codiyamāno pārājikaṃ ajjhāpanno paṭijānāti, taṃ saṅgho pārājikena kāreti, dhammikaṃ paṭiññātakaraṇaṃ. Bhikkhu saṅghādisesaṃ…pe… pācittiyaṃ… pāṭidesanīyaṃ… dukkaṭaṃ ajjhāpanno hoti, dukkaṭena codiyamāno dukkaṭaṃ ajjhāpanno paṭijānāti , taṃ saṅgho dukkaṭena kāreti, dhammikaṃ paṭiññātakaraṇaṃ. Ime kho, upāli, pañca dhammikā paṭiññātakaraṇā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "430"
      },
      ". ‘‘Katihi ",
      " nu kho, bhante, aṅgehi samannāgatassa bhikkhuno okāsakammaṃ kārāpentassa nālaṃ okāsakammaṃ kātu’’nti? ‘‘Pañcahupāli, aṅgehi samannāgatassa bhikkhuno okāsakammaṃ kārāpentassa nālaṃ okāsakammaṃ ",
      " kātuṃ. Katamehi pañcahi? Alajjī ca hoti, bālo ca, apakatatto ca, cāvanādhippāyo vattā hoti, no vuṭṭhānādhippāyo – imehi kho, upāli, pañcahaṅgehi samannāgatassa bhikkhuno ",
      " okāsakammaṃ kārāpentassa nālaṃ okāsakammaṃ kātuṃ."
    ],
    "innerText": "430. ‘‘Katihi nu kho, bhante, aṅgehi samannāgatassa bhikkhuno okāsakammaṃ kārāpentassa nālaṃ okāsakammaṃ kātu’’nti? ‘‘Pañcahupāli, aṅgehi samannāgatassa bhikkhuno okāsakammaṃ kārāpentassa nālaṃ okāsakammaṃ kātuṃ. Katamehi pañcahi? Alajjī ca hoti, bālo ca, apakatatto ca, cāvanādhippāyo vattā hoti, no vuṭṭhānādhippāyo – imehi kho, upāli, pañcahaṅgehi samannāgatassa bhikkhuno okāsakammaṃ kārāpentassa nālaṃ okāsakammaṃ kātuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Pañcahupāli, aṅgehi samannāgatassa bhikkhuno okāsakammaṃ kārāpentassa alaṃ okāsakammaṃ kātuṃ. Katamehi pañcahi? Lajjī ca hoti, paṇḍito ca, pakatatto ca, vuṭṭhānādhippāyo vattā hoti, no cāvanādhippāyo – imehi kho, upāli, pañcahaṅgehi samannāgatassa bhikkhuno okāsakammaṃ kārāpentassa alaṃ okāsakammaṃ kātu’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "431"
      },
      ". ‘‘Katihi nu kho, bhante, aṅgehi samannāgatena bhikkhunā saddhiṃ vinayo na sākacchitabbo’’ti? ‘‘Pañcahupāli, aṅgehi samannāgatena bhikkhunā saddhiṃ vinayo na sākacchitabbo. Katamehi pañcahi? Vatthuṃ na jānāti, nidānaṃ na jānāti, paññattiṃ na jānāti, padapaccābhaṭṭhaṃ na jānāti, anusandhivacanapathaṃ na jānāti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saddhiṃ vinayo na sākacchitabbo."
    ],
    "innerText": "431. ‘‘Katihi nu kho, bhante, aṅgehi samannāgatena bhikkhunā saddhiṃ vinayo na sākacchitabbo’’ti? ‘‘Pañcahupāli, aṅgehi samannāgatena bhikkhunā saddhiṃ vinayo na sākacchitabbo. Katamehi pañcahi? Vatthuṃ na jānāti, nidānaṃ na jānāti, paññattiṃ na jānāti, padapaccābhaṭṭhaṃ na jānāti, anusandhivacanapathaṃ na jānāti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saddhiṃ vinayo na sākacchitabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Pañcahupāli, aṅgehi samannāgatena bhikkhunā saddhiṃ vinayo sākacchitabbo. Katamehi pañcahi? Vatthuṃ jānāti, nidānaṃ jānāti, paññattiṃ jānāti, padapaccābhaṭṭhaṃ jānāti, anusandhivacanapathaṃ jānāti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saddhiṃ vinayo sākacchitabbo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "432"
      },
      ". ‘‘Kati nu kho, bhante, pañhāpucchā’’ti? ‘‘Pañcimā, upāli, pañhāpucchā. Katamā pañca? Mandattā momūhattā pañhaṃ pucchati, pāpiccho icchāpakato pañhaṃ pucchati, paribhavā pañhaṃ pucchati ",
      ", aññātukāmo pañhaṃ pucchati, sace me pañhaṃ puṭṭho sammadeva byākarissati ",
      " iccetaṃ kusalaṃ no ce pañhaṃ puṭṭho sammadeva byākarissati ahamassa sammadeva byākarissāmīti pañhaṃ pucchati – imā kho, upāli, pañca pañhāpucchā’’ti."
    ],
    "innerText": "432. ‘‘Kati nu kho, bhante, pañhāpucchā’’ti? ‘‘Pañcimā, upāli, pañhāpucchā. Katamā pañca? Mandattā momūhattā pañhaṃ pucchati, pāpiccho icchāpakato pañhaṃ pucchati, paribhavā pañhaṃ pucchati , aññātukāmo pañhaṃ pucchati, sace me pañhaṃ puṭṭho sammadeva byākarissati iccetaṃ kusalaṃ no ce pañhaṃ puṭṭho sammadeva byākarissati ahamassa sammadeva byākarissāmīti pañhaṃ pucchati – imā kho, upāli, pañca pañhāpucchā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "433"
      },
      ". ‘‘Kati nu kho, bhante, aññabyākaraṇā’’ti? ‘‘Pañcime, upāli, aññabyākaraṇā. Katame pañca? Mandattā momūhattā aññaṃ byākaroti, pāpiccho icchāpakato aññaṃ byākaroti, ummādā cittakkhepā aññaṃ byākaroti ",
      ", adhimānena aññaṃ byākaroti, bhūtaṃ aññaṃ byākaroti – ime kho, upāli, pañca aññabyākaraṇā’’ti."
    ],
    "innerText": "433. ‘‘Kati nu kho, bhante, aññabyākaraṇā’’ti? ‘‘Pañcime, upāli, aññabyākaraṇā. Katame pañca? Mandattā momūhattā aññaṃ byākaroti, pāpiccho icchāpakato aññaṃ byākaroti, ummādā cittakkhepā aññaṃ byākaroti , adhimānena aññaṃ byākaroti, bhūtaṃ aññaṃ byākaroti – ime kho, upāli, pañca aññabyākaraṇā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "434"
      },
      ". ‘‘Kati nu kho, bhante, visuddhiyo’’ti? ‘‘Pañcimā, upāli, visuddhiyo. Katamā pañca? Nidānaṃ uddisitvā avasesaṃ sutena sāvetabbaṃ ayaṃ paṭhamā visuddhi, nidānaṃ uddisitvā cattāri pārājikāni uddisitvā avasesaṃ sutena sāvetabbaṃ ayaṃ dutiyā visuddhi, nidānaṃ uddisitvā cattāri pārājikāni uddisitvā terasa saṅghādisese uddisitvā avasesaṃ sutena sāvetabbaṃ ayaṃ tatiyā visuddhi, nidānaṃ uddisitvā cattāri pārājikāni uddisitvā terasa saṅghādisese uddisitvā dve aniyate uddisitvā avasesaṃ sutena sāvetabbaṃ ayaṃ catutthā visuddhi, vitthāreneva pañcamī – imā kho, upāli, pañca visuddhiyo’’ti."
    ],
    "innerText": "434. ‘‘Kati nu kho, bhante, visuddhiyo’’ti? ‘‘Pañcimā, upāli, visuddhiyo. Katamā pañca? Nidānaṃ uddisitvā avasesaṃ sutena sāvetabbaṃ ayaṃ paṭhamā visuddhi, nidānaṃ uddisitvā cattāri pārājikāni uddisitvā avasesaṃ sutena sāvetabbaṃ ayaṃ dutiyā visuddhi, nidānaṃ uddisitvā cattāri pārājikāni uddisitvā terasa saṅghādisese uddisitvā avasesaṃ sutena sāvetabbaṃ ayaṃ tatiyā visuddhi, nidānaṃ uddisitvā cattāri pārājikāni uddisitvā terasa saṅghādisese uddisitvā dve aniyate uddisitvā avasesaṃ sutena sāvetabbaṃ ayaṃ catutthā visuddhi, vitthāreneva pañcamī – imā kho, upāli, pañca visuddhiyo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "435"
      },
      ". ‘‘Kati ",
      " nu kho, bhante, bhojanā’’ti? ‘‘Pañcime, upāli, bhojanā ",
      ". Katame pañca? Odano, kummāso, sattu, maccho, maṃsaṃ – ime kho, upāli, pañca bhojanā’’ti."
    ],
    "innerText": "435. ‘‘Kati nu kho, bhante, bhojanā’’ti? ‘‘Pañcime, upāli, bhojanā . Katame pañca? Odano, kummāso, sattu, maccho, maṃsaṃ – ime kho, upāli, pañca bhojanā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Diṭṭhāvikammavaggo niṭṭhito catuttho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Diṭṭhāvikammā apare, paṭiggahānatirittā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Pavāraṇā paṭiññātaṃ, okāsaṃ sākacchena ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pañhaṃ aññabyākaraṇā, visuddhi cāpi bhojanāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5. Attādānavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "436"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[cūḷava. 399; a. ni. 10.44]"
      },
      " ‘‘Codakena, bhante, bhikkhunā paraṃ codetukāmena kati dhamme ajjhattaṃ paccavekkhitvā paro codetabbo’’ti? ‘‘Codakenupāli, bhikkhunā paraṃ codetukāmena pañca dhamme ajjhattaṃ ",
      " paccavekkhitvā paro codetabbo. Katame pañca? Codakenupāli, bhikkhunā paraṃ codetukāmena evaṃ paccavekkhitabbaṃ – parisuddhakāyasamācāro nu khomhi, parisuddhenamhi kāyasamācārena samannāgato acchiddena appaṭimaṃsena, saṃvijjati nu kho me ",
      " eso dhammo udāhu no’’ti. No ce, upāli, bhikkhu parisuddhakāyasamācāro hoti, parisuddhena kāyasamācārena samannāgato acchiddena appaṭimaṃsena, tassa bhavanti vattāro – ‘iṅgha, tāva āyasmā kāyikaṃ sikkhassū’ti itissa bhavanti vattāro."
    ],
    "innerText": "436.[cūḷava. 399; a. ni. 10.44] ‘‘Codakena, bhante, bhikkhunā paraṃ codetukāmena kati dhamme ajjhattaṃ paccavekkhitvā paro codetabbo’’ti? ‘‘Codakenupāli, bhikkhunā paraṃ codetukāmena pañca dhamme ajjhattaṃ paccavekkhitvā paro codetabbo. Katame pañca? Codakenupāli, bhikkhunā paraṃ codetukāmena evaṃ paccavekkhitabbaṃ – parisuddhakāyasamācāro nu khomhi, parisuddhenamhi kāyasamācārena samannāgato acchiddena appaṭimaṃsena, saṃvijjati nu kho me eso dhammo udāhu no’’ti. No ce, upāli, bhikkhu parisuddhakāyasamācāro hoti, parisuddhena kāyasamācārena samannāgato acchiddena appaṭimaṃsena, tassa bhavanti vattāro – ‘iṅgha, tāva āyasmā kāyikaṃ sikkhassū’ti itissa bhavanti vattāro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, upāli, codakena bhikkhunā paraṃ codetukāmena evaṃ paccavekkhitabbaṃ – ‘parisuddhavacīsamācāro nu khomhi, parisuddhenamhi vacīsamācārena ",
      " samannāgato acchiddena appaṭimaṃsena, saṃvijjati nu kho me eso dhammo udāhu no’ti. No ce, upāli, bhikkhu parisuddhavacīsamācāro hoti, parisuddhena vacīsamācārena samannāgato acchiddena appaṭimaṃsena, tassa bhavanti vattāro – ‘iṅgha, tāva āyasmā vācasikaṃ sikkhassū’ti itissa bhavanti vattāro."
    ],
    "innerText": "‘‘Puna caparaṃ, upāli, codakena bhikkhunā paraṃ codetukāmena evaṃ paccavekkhitabbaṃ – ‘parisuddhavacīsamācāro nu khomhi, parisuddhenamhi vacīsamācārena samannāgato acchiddena appaṭimaṃsena, saṃvijjati nu kho me eso dhammo udāhu no’ti. No ce, upāli, bhikkhu parisuddhavacīsamācāro hoti, parisuddhena vacīsamācārena samannāgato acchiddena appaṭimaṃsena, tassa bhavanti vattāro – ‘iṅgha, tāva āyasmā vācasikaṃ sikkhassū’ti itissa bhavanti vattāro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Puna caparaṃ, upāli, codakena bhikkhunā paraṃ codetukāmena evaṃ paccavekkhitabbaṃ – ‘mettaṃ nu kho me cittaṃ paccupaṭṭhitaṃ sabrahmacārīsu anāghātaṃ, saṃvijjati nu kho me eso dhammo udāhu no’ti. No ce, upāli, bhikkhuno mettaṃ cittaṃ paccupaṭṭhitaṃ hoti sabrahmacārīsu anāghātaṃ, tassa bhavanti vattāro – ‘iṅgha, tāva āyasmā sabrahmacārīsu mettaṃ cittaṃ upaṭṭhāpehī’ti itissa bhavanti vattāro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna caparaṃ, upāli, codakena bhikkhunā paraṃ codetukāmena evaṃ paccavekkhitabbaṃ – ‘bahussuto nu khomhi sutadharo sutasannicayo, ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpā me dhammā bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā, saṃvijjati nu kho me eso dhammo udāhu no’ti. No ce, upāli, bhikkhu bahussuto hoti sutadharo sutasannicayo, ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṃ ",
      " sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpassa dhammā na bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā, tassa bhavanti vattāro – ‘iṅgha, tāva āyasmā āgamaṃ pariyāpuṇassū’ti itissa bhavanti vattāro."
    ],
    "innerText": "‘‘Puna caparaṃ, upāli, codakena bhikkhunā paraṃ codetukāmena evaṃ paccavekkhitabbaṃ – ‘bahussuto nu khomhi sutadharo sutasannicayo, ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpā me dhammā bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā, saṃvijjati nu kho me eso dhammo udāhu no’ti. No ce, upāli, bhikkhu bahussuto hoti sutadharo sutasannicayo, ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpassa dhammā na bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā, tassa bhavanti vattāro – ‘iṅgha, tāva āyasmā āgamaṃ pariyāpuṇassū’ti itissa bhavanti vattāro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Puna ",
      " caparaṃ, upāli, codakena bhikkhunā paraṃ codetukāmena evaṃ paccavekkhitabbaṃ – ‘ubhayāni kho me pātimokkhāni vitthārena svāgatāni honti suvibhattāni suppavattīni suvinicchitāni suttaso anubyañjanaso, saṃvijjati nu kho me eso dhammo udāhu no’ti. No ce, upāli, bhikkhuno ubhayāni pātimokkhāni vitthārena svāgatāni honti suvibhattāni suppavattīni suvinicchitāni suttaso anubyañjanaso, ‘idaṃ panāvuso kattha vuttaṃ bhagavatā’ti iti puṭṭho na sampāyati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[na sampādayati (ka.), na sampādeti (syā.)]"
      },
      ", tassa bhavanti vattāro – ‘iṅgha, tāva āyasmā vinayaṃ pariyāpuṇassū’ti itissa bhavanti vattāro. Codakenupāli, bhikkhunā paraṃ codetukāmena ime pañca dhamme ajjhattaṃ paccavekkhitvā paro codetabbo’’ti."
    ],
    "innerText": "‘‘Puna caparaṃ, upāli, codakena bhikkhunā paraṃ codetukāmena evaṃ paccavekkhitabbaṃ – ‘ubhayāni kho me pātimokkhāni vitthārena svāgatāni honti suvibhattāni suppavattīni suvinicchitāni suttaso anubyañjanaso, saṃvijjati nu kho me eso dhammo udāhu no’ti. No ce, upāli, bhikkhuno ubhayāni pātimokkhāni vitthārena svāgatāni honti suvibhattāni suppavattīni suvinicchitāni suttaso anubyañjanaso, ‘idaṃ panāvuso kattha vuttaṃ bhagavatā’ti iti puṭṭho na sampāyati [na sampādayati (ka.), na sampādeti (syā.)], tassa bhavanti vattāro – ‘iṅgha, tāva āyasmā vinayaṃ pariyāpuṇassū’ti itissa bhavanti vattāro. Codakenupāli, bhikkhunā paraṃ codetukāmena ime pañca dhamme ajjhattaṃ paccavekkhitvā paro codetabbo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "437"
      },
      ". ‘‘Codakena, bhante, bhikkhunā paraṃ codetukāmena kati dhamme ajjhattaṃ upaṭṭhāpetvā paro codetabbo’’ti? ‘‘Codakenupāli, bhikkhunā paraṃ codetukāmena pañca dhamme ajjhattaṃ upaṭṭhāpetvā paro codetabbo. Katame pañca? Kālena vakkhāmi no akālena ",
      ", bhūtena vakkhāmi no abhūtena, saṇhena vakkhāmi no pharusena, atthasaṃhitena vakkhāmi no anatthasaṃhitena, mettācitto vakkhāmi no dosantaroti – codakenupāli, bhikkhunā paraṃ codetukāmena ime pañca dhamme ajjhattaṃ upaṭṭhāpetvā paro codetabbo’’ti."
    ],
    "innerText": "437. ‘‘Codakena, bhante, bhikkhunā paraṃ codetukāmena kati dhamme ajjhattaṃ upaṭṭhāpetvā paro codetabbo’’ti? ‘‘Codakenupāli, bhikkhunā paraṃ codetukāmena pañca dhamme ajjhattaṃ upaṭṭhāpetvā paro codetabbo. Katame pañca? Kālena vakkhāmi no akālena , bhūtena vakkhāmi no abhūtena, saṇhena vakkhāmi no pharusena, atthasaṃhitena vakkhāmi no anatthasaṃhitena, mettācitto vakkhāmi no dosantaroti – codakenupāli, bhikkhunā paraṃ codetukāmena ime pañca dhamme ajjhattaṃ upaṭṭhāpetvā paro codetabbo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "438"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[cūḷava. 400]"
      },
      " ‘‘Codakena, bhante, bhikkhunā paraṃ codetukāmena kati dhamme ajjhattaṃ manasi karitvā paro codetabbo’’ti? ‘‘Codakenupāli, bhikkhunā paraṃ codetukāmena pañca dhamme ajjhattaṃ manasi karitvā paro codetabbo. Katame pañca? Kāruññatā, hitesitā, anukampatā, āpattivuṭṭhānatā, vinayapurekkhāratā – codakenupāli, bhikkhunā paraṃ codetukāmena ime pañca dhamme ajjhattaṃ manasi karitvā paro codetabbo’’ti."
    ],
    "innerText": "438.[cūḷava. 400] ‘‘Codakena, bhante, bhikkhunā paraṃ codetukāmena kati dhamme ajjhattaṃ manasi karitvā paro codetabbo’’ti? ‘‘Codakenupāli, bhikkhunā paraṃ codetukāmena pañca dhamme ajjhattaṃ manasi karitvā paro codetabbo. Katame pañca? Kāruññatā, hitesitā, anukampatā, āpattivuṭṭhānatā, vinayapurekkhāratā – codakenupāli, bhikkhunā paraṃ codetukāmena ime pañca dhamme ajjhattaṃ manasi karitvā paro codetabbo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "439"
      },
      ". ‘‘Katihi nu kho, bhante, aṅgehi samannāgatassa bhikkhuno okāsakammaṃ kārāpentassa nālaṃ okāsakammaṃ kātu’’nti? ‘‘Pañcahupāli, aṅgehi samannāgatassa bhikkhuno okāsakammaṃ kārāpentassa nālaṃ okāsakammaṃ kātuṃ. Katamehi pañcahi? Aparisuddhakāyasamācāro hoti ",
      ", aparisuddhavacīsamācāro hoti, aparisuddhājīvo hoti, bālo hoti abyatto, na paṭibalo anuyuñjiyamāno anuyogaṃ dātuṃ – imehi ",
      " kho, upāli, pañcahaṅgehi samannāgatassa bhikkhuno okāsakammaṃ kārāpentassa nālaṃ okāsakammaṃ kātuṃ."
    ],
    "innerText": "439. ‘‘Katihi nu kho, bhante, aṅgehi samannāgatassa bhikkhuno okāsakammaṃ kārāpentassa nālaṃ okāsakammaṃ kātu’’nti? ‘‘Pañcahupāli, aṅgehi samannāgatassa bhikkhuno okāsakammaṃ kārāpentassa nālaṃ okāsakammaṃ kātuṃ. Katamehi pañcahi? Aparisuddhakāyasamācāro hoti , aparisuddhavacīsamācāro hoti, aparisuddhājīvo hoti, bālo hoti abyatto, na paṭibalo anuyuñjiyamāno anuyogaṃ dātuṃ – imehi kho, upāli, pañcahaṅgehi samannāgatassa bhikkhuno okāsakammaṃ kārāpentassa nālaṃ okāsakammaṃ kātuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Pañcahupāli ",
      ", aṅgehi ",
      " samannāgatassa bhikkhuno okāsakammaṃ kārāpentassa alaṃ okāsakammaṃ kātuṃ. Katamehi pañcahi? Parisuddhakāyasamācāro hoti, parisuddhavacīsamācāro hoti, parisuddhājīvo hoti, paṇḍito hoti byatto paṭibalo anuyuñjiyamāno anuyogaṃ dātuṃ – imehi kho, upāli, pañcahaṅgehi samannāgatassa bhikkhuno okāsakammaṃ kārāpentassa alaṃ okāsakammaṃ kātu’’nti."
    ],
    "innerText": "‘‘Pañcahupāli , aṅgehi samannāgatassa bhikkhuno okāsakammaṃ kārāpentassa alaṃ okāsakammaṃ kātuṃ. Katamehi pañcahi? Parisuddhakāyasamācāro hoti, parisuddhavacīsamācāro hoti, parisuddhājīvo hoti, paṇḍito hoti byatto paṭibalo anuyuñjiyamāno anuyogaṃ dātuṃ – imehi kho, upāli, pañcahaṅgehi samannāgatassa bhikkhuno okāsakammaṃ kārāpentassa alaṃ okāsakammaṃ kātu’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "440"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[cūḷava. 398]"
      },
      " ‘‘Attādānaṃ ādātukāmena, bhante, bhikkhunā katihaṅgehi samannāgataṃ attādānaṃ ādātabba’’nti? ‘‘Attādānaṃ ādātukāmenupāli, bhikkhunā pañcaṅgasamannāgataṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pañcahaṅgehi samannāgataṃ (sī. syā.)]"
      },
      " attādānaṃ ādātabbaṃ. Katame pañca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[katamehi pañcahi (syā.)]"
      },
      "? Attādānaṃ ādātukāmena, upāli, bhikkhunā evaṃ paccavekkhitabbaṃ – ‘yaṃ kho ahaṃ imaṃ attādānaṃ ādātukāmo, kālo nu kho imaṃ attādānaṃ ādātuṃ udāhu no’ti. Sace, upāli, bhikkhu paccavekkhamāno evaṃ jānāti – ‘akālo imaṃ attādānaṃ ādātuṃ no kālo’ti, na taṃ, upāli, attādānaṃ ādātabbaṃ."
    ],
    "innerText": "440.[cūḷava. 398] ‘‘Attādānaṃ ādātukāmena, bhante, bhikkhunā katihaṅgehi samannāgataṃ attādānaṃ ādātabba’’nti? ‘‘Attādānaṃ ādātukāmenupāli, bhikkhunā pañcaṅgasamannāgataṃ [pañcahaṅgehi samannāgataṃ (sī. syā.)] attādānaṃ ādātabbaṃ. Katame pañca [katamehi pañcahi (syā.)]? Attādānaṃ ādātukāmena, upāli, bhikkhunā evaṃ paccavekkhitabbaṃ – ‘yaṃ kho ahaṃ imaṃ attādānaṃ ādātukāmo, kālo nu kho imaṃ attādānaṃ ādātuṃ udāhu no’ti. Sace, upāli, bhikkhu paccavekkhamāno evaṃ jānāti – ‘akālo imaṃ attādānaṃ ādātuṃ no kālo’ti, na taṃ, upāli, attādānaṃ ādātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sace panupāli, bhikkhu paccavekkhamāno evaṃ jānāti – ‘kālo imaṃ attādānaṃ ādātuṃ no akālo’ti, tenupāli bhikkhunā uttari paccavekkhitabbaṃ – ‘yaṃ kho ahaṃ imaṃ attādānaṃ ādātukāmo bhūtaṃ nu kho idaṃ attādānaṃ udāhu no’ti. Sace, upāli, bhikkhu paccavekkhamāno evaṃ jānāti – ‘abhūtaṃ idaṃ attādānaṃ no bhūta’nti, na taṃ, upāli, attādānaṃ ādātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace panupāli bhikkhu paccavekkhamāno ",
      " evaṃ jānāti – ‘bhūtaṃ idaṃ attādānaṃ no abhūta’nti, tenupāli bhikkhunā uttari paccavekkhitabbaṃ – ‘yaṃ kho ahaṃ imaṃ attādānaṃ ādātukāmo, atthasaṃhitaṃ nu kho idaṃ attādānaṃ udāhu no’ti. Sace, upāli, bhikkhu paccavekkhamāno evaṃ jānāti ",
      " –’ anatthasaṃhitaṃ idaṃ attādānaṃ no atthasaṃhita’nti, na taṃ, upāli, attādānaṃ ādātabbaṃ."
    ],
    "innerText": "‘‘Sace panupāli bhikkhu paccavekkhamāno evaṃ jānāti – ‘bhūtaṃ idaṃ attādānaṃ no abhūta’nti, tenupāli bhikkhunā uttari paccavekkhitabbaṃ – ‘yaṃ kho ahaṃ imaṃ attādānaṃ ādātukāmo, atthasaṃhitaṃ nu kho idaṃ attādānaṃ udāhu no’ti. Sace, upāli, bhikkhu paccavekkhamāno evaṃ jānāti –’ anatthasaṃhitaṃ idaṃ attādānaṃ no atthasaṃhita’nti, na taṃ, upāli, attādānaṃ ādātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace panupāli bhikkhu paccavekkhamāno evaṃ jānāti – ‘atthasaṃhitaṃ idaṃ attādānaṃ no anatthasaṃhita’nti, tenupāli bhikkhunā uttari paccavekkhitabbaṃ – ‘imaṃ kho ahaṃ attādānaṃ ādiyamāno labhissāmi sandiṭṭhe sambhatte bhikkhū dhammato vinayato pakkhe udāhu no’ti. Sace, upāli, bhikkhu paccavekkhamāno evaṃ jānāti – ‘imaṃ kho ahaṃ attādānaṃ ādiyamāno ",
      " na labhissāmi sandiṭṭhe sambhatte bhikkhū dhammato vinayato pakkhe’ti, na taṃ, upāli, attādānaṃ ādātabbaṃ."
    ],
    "innerText": "‘‘Sace panupāli bhikkhu paccavekkhamāno evaṃ jānāti – ‘atthasaṃhitaṃ idaṃ attādānaṃ no anatthasaṃhita’nti, tenupāli bhikkhunā uttari paccavekkhitabbaṃ – ‘imaṃ kho ahaṃ attādānaṃ ādiyamāno labhissāmi sandiṭṭhe sambhatte bhikkhū dhammato vinayato pakkhe udāhu no’ti. Sace, upāli, bhikkhu paccavekkhamāno evaṃ jānāti – ‘imaṃ kho ahaṃ attādānaṃ ādiyamāno na labhissāmi sandiṭṭhe sambhatte bhikkhū dhammato vinayato pakkhe’ti, na taṃ, upāli, attādānaṃ ādātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Sace panupāli bhikkhu paccavekkhamāno evaṃ jānāti – ‘idaṃ kho ahaṃ attādānaṃ ādiyamāno labhissāmi sandiṭṭhe sambhatte bhikkhū dhammato vinayato pakkhe’ti, tenupāli bhikkhunā uttari paccavekkhitabbaṃ – ‘imaṃ kho me attādānaṃ ādiyato bhavissati saṅghassa tatonidānaṃ bhaṇḍanaṃ kalaho viggaho vivādo saṅghabhedo saṅgharāji saṅghavavatthānaṃ saṅghanānākaraṇaṃ udāhu no’ti. Sace, upāli, bhikkhu paccavekkhamāno evaṃ jānāti – ‘imaṃ kho me attādānaṃ ādiyato bhavissati saṅghassa tatonidānaṃ bhaṇḍanaṃ kalaho viggaho vivādo ",
      " saṅghabhedo saṅgharāji saṅghavavatthānaṃ saṅghanānākaraṇa’nti, na taṃ, upāli, attādānaṃ ādātabbaṃ."
    ],
    "innerText": "‘‘Sace panupāli bhikkhu paccavekkhamāno evaṃ jānāti – ‘idaṃ kho ahaṃ attādānaṃ ādiyamāno labhissāmi sandiṭṭhe sambhatte bhikkhū dhammato vinayato pakkhe’ti, tenupāli bhikkhunā uttari paccavekkhitabbaṃ – ‘imaṃ kho me attādānaṃ ādiyato bhavissati saṅghassa tatonidānaṃ bhaṇḍanaṃ kalaho viggaho vivādo saṅghabhedo saṅgharāji saṅghavavatthānaṃ saṅghanānākaraṇaṃ udāhu no’ti. Sace, upāli, bhikkhu paccavekkhamāno evaṃ jānāti – ‘imaṃ kho me attādānaṃ ādiyato bhavissati saṅghassa tatonidānaṃ bhaṇḍanaṃ kalaho viggaho vivādo saṅghabhedo saṅgharāji saṅghavavatthānaṃ saṅghanānākaraṇa’nti, na taṃ, upāli, attādānaṃ ādātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Sace panupāli bhikkhu paccavekkhamāno evaṃ jānāti – ‘imaṃ kho me attādānaṃ ādiyato na bhavissati saṅghassa tatonidānaṃ bhaṇḍanaṃ kalaho viggaho vivādo saṅghabhedo saṅgharāji saṅghavavatthānaṃ saṅghanānākaraṇa’nti, taṃ ādātabbaṃ, upāli, attādānaṃ. Evaṃ pañcaṅgasamannāgataṃ kho, upāli, attādānaṃ ādinnaṃ pacchāpi avippaṭisārakaraṃ bhavissatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "441"
      },
      ". ‘‘Katihi nu kho, bhante, aṅgehi samannāgato bhikkhu adhikaraṇajātānaṃ bhikkhūnaṃ bahūpakāro hotī’’ti? ‘‘Pañcahupāli, aṅgehi samannāgato bhikkhu adhikaraṇajātānaṃ bhikkhūnaṃ bahūpakāro hoti. Katamehi pañcahi? Sīlavā hoti, pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati ",
      " sikkhāpadesu; bahussuto hoti sutadharo sutasannicayo; ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti tathārūpassa dhammā bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā, ubhayāni kho panassa pātimokkhāni vitthārena svāgatāni honti suvibhattāni suppavattīni suvinicchitāni suttaso anubyañjanaso; vinaye kho pana ṭhito hoti asaṃhīro; paṭibalo hoti ",
      " ubho atthapaccatthike assāsetuṃ saññāpetuṃ nijjhāpetuṃ pekkhetuṃ pasādetuṃ – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu adhikaraṇajātānaṃ bhikkhūnaṃ bahūpakāro hoti."
    ],
    "innerText": "441. ‘‘Katihi nu kho, bhante, aṅgehi samannāgato bhikkhu adhikaraṇajātānaṃ bhikkhūnaṃ bahūpakāro hotī’’ti? ‘‘Pañcahupāli, aṅgehi samannāgato bhikkhu adhikaraṇajātānaṃ bhikkhūnaṃ bahūpakāro hoti. Katamehi pañcahi? Sīlavā hoti, pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu; bahussuto hoti sutadharo sutasannicayo; ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti tathārūpassa dhammā bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā, ubhayāni kho panassa pātimokkhāni vitthārena svāgatāni honti suvibhattāni suppavattīni suvinicchitāni suttaso anubyañjanaso; vinaye kho pana ṭhito hoti asaṃhīro; paṭibalo hoti ubho atthapaccatthike assāsetuṃ saññāpetuṃ nijjhāpetuṃ pekkhetuṃ pasādetuṃ – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu adhikaraṇajātānaṃ bhikkhūnaṃ bahūpakāro hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi ",
      ", upāli, pañcahaṅgehi samannāgato bhikkhu adhikaraṇajātānaṃ bhikkhūnaṃ bahūpakāro hoti. Katamehi pañcahi? Parisuddhakāyasamācāro hoti, parisuddhavacīsamācāro hoti, parisuddhājīvo hoti, paṇḍito hoti byatto, paṭibalo anuyuñjiyamāno anuyogaṃ dātuṃ – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu adhikaraṇajātānaṃ bhikkhūnaṃ bahūpakāro hoti."
    ],
    "innerText": "‘‘Aparehipi , upāli, pañcahaṅgehi samannāgato bhikkhu adhikaraṇajātānaṃ bhikkhūnaṃ bahūpakāro hoti. Katamehi pañcahi? Parisuddhakāyasamācāro hoti, parisuddhavacīsamācāro hoti, parisuddhājīvo hoti, paṇḍito hoti byatto, paṭibalo anuyuñjiyamāno anuyogaṃ dātuṃ – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu adhikaraṇajātānaṃ bhikkhūnaṃ bahūpakāro hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato bhikkhu adhikaraṇajātānaṃ bhikkhūnaṃ bahūpakāro hoti. Katamehi pañcahi? Vatthuṃ jānāti, nidānaṃ jānāti, paññattiṃ jānāti ",
      ", padapaccābhaṭṭhaṃ jānāti, anusandhivacanapathaṃ jānāti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu adhikaraṇajātānaṃ bhikkhūnaṃ bahūpakāro hotī’’ti."
    ],
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato bhikkhu adhikaraṇajātānaṃ bhikkhūnaṃ bahūpakāro hoti. Katamehi pañcahi? Vatthuṃ jānāti, nidānaṃ jānāti, paññattiṃ jānāti , padapaccābhaṭṭhaṃ jānāti, anusandhivacanapathaṃ jānāti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu adhikaraṇajātānaṃ bhikkhūnaṃ bahūpakāro hotī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "442"
      },
      ". ‘‘Katihi nu kho, bhante, aṅgehi samannāgatena bhikkhunā nānuyuñjitabba’’nti? ‘‘Pañcahupāli, aṅgehi samannāgatena bhikkhunā nānuyuñjitabbaṃ. Katamehi pañcahi? Suttaṃ na jānāti, suttānulomaṃ na jānāti, vinayaṃ na jānāti, vinayānulomaṃ na jānāti, na ca ṭhānāṭhānakusalo hoti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā nānuyuñjitabbaṃ."
    ],
    "innerText": "442. ‘‘Katihi nu kho, bhante, aṅgehi samannāgatena bhikkhunā nānuyuñjitabba’’nti? ‘‘Pañcahupāli, aṅgehi samannāgatena bhikkhunā nānuyuñjitabbaṃ. Katamehi pañcahi? Suttaṃ na jānāti, suttānulomaṃ na jānāti, vinayaṃ na jānāti, vinayānulomaṃ na jānāti, na ca ṭhānāṭhānakusalo hoti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā nānuyuñjitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Pañcahupāli, aṅgehi samannāgatena ",
      " bhikkhunā anuyuñjitabbaṃ. Katamehi pañcahi? Suttaṃ jānāti, suttānulomaṃ jānāti, vinayaṃ jānāti, vinayānulomaṃ ",
      " jānāti, ṭhānāṭhānakusalo ca hoti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā anuyuñjitabbaṃ."
    ],
    "innerText": "‘‘Pañcahupāli, aṅgehi samannāgatena bhikkhunā anuyuñjitabbaṃ. Katamehi pañcahi? Suttaṃ jānāti, suttānulomaṃ jānāti, vinayaṃ jānāti, vinayānulomaṃ jānāti, ṭhānāṭhānakusalo ca hoti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā anuyuñjitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatena bhikkhunā nānuyuñjitabbaṃ. Katamehi pañcahi? Dhammaṃ na jānāti, dhammānulomaṃ na jānāti, vinayaṃ na jānāti, vinayānulomaṃ na jānāti, na ca pubbāparakusalo hoti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā nānuyuñjitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Pañcahupāli, aṅgehi samannāgatena bhikkhunā anuyuñjitabbaṃ. Katamehi pañcahi? Dhammaṃ jānāti, dhammānulomaṃ jānāti, vinayaṃ jānāti, vinayānulomaṃ jānāti, pubbāparakusalo ",
      " ca hoti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā anuyuñjitabbaṃ."
    ],
    "innerText": "‘‘Pañcahupāli, aṅgehi samannāgatena bhikkhunā anuyuñjitabbaṃ. Katamehi pañcahi? Dhammaṃ jānāti, dhammānulomaṃ jānāti, vinayaṃ jānāti, vinayānulomaṃ jānāti, pubbāparakusalo ca hoti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā anuyuñjitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatena bhikkhunā nānuyuñjitabbaṃ. Katamehi pañcahi? Vatthuṃ na jānāti, nidānaṃ na jānāti, paññattiṃ na jānāti, padapaccābhaṭṭhaṃ na jānāti, anusandhivacanapathaṃ na jānāti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā nānuyuñjitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Pañcahupāli, aṅgehi samannāgatena bhikkhunā anuyuñjitabbaṃ. Katamehi pañcahi? Vatthuṃ jānāti, nidānaṃ jānāti, paññattiṃ jānāti, padapaccābhaṭṭhaṃ jānāti, anusandhivacanapathaṃ jānāti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā ",
      " anuyuñjitabbaṃ."
    ],
    "innerText": "‘‘Pañcahupāli, aṅgehi samannāgatena bhikkhunā anuyuñjitabbaṃ. Katamehi pañcahi? Vatthuṃ jānāti, nidānaṃ jānāti, paññattiṃ jānāti, padapaccābhaṭṭhaṃ jānāti, anusandhivacanapathaṃ jānāti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā anuyuñjitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatena bhikkhunā nānuyuñjitabbaṃ. Katamehi pañcahi? Āpattiṃ na jānāti, āpattisamuṭṭhānaṃ na jānāti, āpattiyā payogaṃ na jānāti, āpattiyā vūpasamaṃ na jānāti, āpattiyā na vinicchayakusalo hoti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā nānuyuñjitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Pañcahupāli, aṅgehi samannāgatena bhikkhunā anuyuñjitabbaṃ. Katamehi pañcahi? Āpattiṃ jānāti, āpattisamuṭṭhānaṃ jānāti, āpattiyā payogaṃ jānāti, āpattiyā vūpasamaṃ jānāti, āpattiyā vinicchayakusalo hoti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā anuyuñjitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi ",
      ", upāli, pañcahaṅgehi samannāgatena bhikkhunā nānuyuñjitabbaṃ. Katamehi pañcahi? Adhikaraṇaṃ na jānāti, adhikaraṇasamuṭṭhānaṃ na jānāti, adhikaraṇassa payogaṃ na jānāti, adhikaraṇassa vūpasamaṃ na jānāti, adhikaraṇassa na vinicchayakusalo hoti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā nānuyuñjitabbaṃ."
    ],
    "innerText": "‘‘Aparehipi , upāli, pañcahaṅgehi samannāgatena bhikkhunā nānuyuñjitabbaṃ. Katamehi pañcahi? Adhikaraṇaṃ na jānāti, adhikaraṇasamuṭṭhānaṃ na jānāti, adhikaraṇassa payogaṃ na jānāti, adhikaraṇassa vūpasamaṃ na jānāti, adhikaraṇassa na vinicchayakusalo hoti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā nānuyuñjitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Pañcahupāli, aṅgehi samannāgatena bhikkhunā anuyuñjitabbaṃ. Katamehi pañcahi? Adhikaraṇaṃ jānāti, adhikaraṇasamuṭṭhānaṃ jānāti, adhikaraṇassa payogaṃ jānāti, adhikaraṇassa ",
      " vūpasamaṃ jānāti, adhikaraṇassa vinicchayakusalo hoti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā anuyuñjitabba’’nti."
    ],
    "innerText": "‘‘Pañcahupāli, aṅgehi samannāgatena bhikkhunā anuyuñjitabbaṃ. Katamehi pañcahi? Adhikaraṇaṃ jānāti, adhikaraṇasamuṭṭhānaṃ jānāti, adhikaraṇassa payogaṃ jānāti, adhikaraṇassa vūpasamaṃ jānāti, adhikaraṇassa vinicchayakusalo hoti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā anuyuñjitabba’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Attādānavaggo niṭṭhito pañcamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Parisuddhañca ",
      " kālena, kāruññaṃ okāsena ca;"
    ],
    "innerText": "Parisuddhañca kālena, kāruññaṃ okāsena ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Attādānaṃ adhikaraṇaṃ, aparehipi vatthuñca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Suttaṃ dhammaṃ puna vatthuñca, āpatti adhikaraṇena cāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "6. Dhutaṅgavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "443"
      },
      ". ‘‘Kati ",
      " nu kho, bhante, āraññikā’’ti? ‘‘Pañcime, upāli, āraññikā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[a. ni. 5.181; pari. 325]"
      },
      ". Katame pañca? Mandattā momūhattā āraññiko hoti, pāpiccho icchāpakato āraññiko hoti, ummādā cittakkhepā āraññiko hoti, vaṇṇitaṃ buddhehi buddhasāvakehīti āraññiko hoti, api ca appicchaññeva nissāya santuṭṭhiññeva nissāya – sallekhaññeva nissāya pavivekaññeva nissāya ",
      " idamatthitaññeva nissāya āraññiko hoti – ime kho, upāli, pañca āraññikā’’ti."
    ],
    "innerText": "443. ‘‘Kati nu kho, bhante, āraññikā’’ti? ‘‘Pañcime, upāli, āraññikā [a. ni. 5.181; pari. 325]. Katame pañca? Mandattā momūhattā āraññiko hoti, pāpiccho icchāpakato āraññiko hoti, ummādā cittakkhepā āraññiko hoti, vaṇṇitaṃ buddhehi buddhasāvakehīti āraññiko hoti, api ca appicchaññeva nissāya santuṭṭhiññeva nissāya – sallekhaññeva nissāya pavivekaññeva nissāya idamatthitaññeva nissāya āraññiko hoti – ime kho, upāli, pañca āraññikā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kati nu kho, bhante, piṇḍapātikāti…pe… kati nu kho, bhante, paṃsukūlikāti…pe… kati nu kho, bhante, rukkhamūlikāti…pe… kati nu kho, bhante, sosānikāti…pe… kati nu kho, bhante, abbhokāsikāti…pe… kati ",
      " nu kho, bhante, tecīvarikāti…pe… kati nu kho, bhante, sapadānacārikāti…pe… kati nu kho, bhante, nesajjikāti…pe… kati nu kho, bhante, yathāsanthatikāti…pe… kati nu kho, bhante, ekāsanikāti…pe… kati nu kho, bhante, khalupacchābhattikāti…pe… kati ",
      " nu kho, bhante, pattapiṇḍikāti? Pañcime, upāli, pattapiṇḍikā. Katame pañca? Mandattā momūhattā pattapiṇḍiko hoti, pāpiccho icchāpakato pattapiṇḍiko hoti, ummādā cittakkhepā pattapiṇḍiko hoti, vaṇṇitaṃ buddhehi buddhasāvakehīti pattapiṇḍiko hoti, api ca appicchaññeva nissāya santuṭṭhiññeva nissāya sallekhaññeva nissāya pavivekaññeva nissāya idamatthitaññeva nissāya pattapiṇḍiko hoti – ime kho, upāli, pañca pattapiṇḍikā’’ti."
    ],
    "innerText": "‘‘Kati nu kho, bhante, piṇḍapātikāti…pe… kati nu kho, bhante, paṃsukūlikāti…pe… kati nu kho, bhante, rukkhamūlikāti…pe… kati nu kho, bhante, sosānikāti…pe… kati nu kho, bhante, abbhokāsikāti…pe… kati nu kho, bhante, tecīvarikāti…pe… kati nu kho, bhante, sapadānacārikāti…pe… kati nu kho, bhante, nesajjikāti…pe… kati nu kho, bhante, yathāsanthatikāti…pe… kati nu kho, bhante, ekāsanikāti…pe… kati nu kho, bhante, khalupacchābhattikāti…pe… kati nu kho, bhante, pattapiṇḍikāti? Pañcime, upāli, pattapiṇḍikā. Katame pañca? Mandattā momūhattā pattapiṇḍiko hoti, pāpiccho icchāpakato pattapiṇḍiko hoti, ummādā cittakkhepā pattapiṇḍiko hoti, vaṇṇitaṃ buddhehi buddhasāvakehīti pattapiṇḍiko hoti, api ca appicchaññeva nissāya santuṭṭhiññeva nissāya sallekhaññeva nissāya pavivekaññeva nissāya idamatthitaññeva nissāya pattapiṇḍiko hoti – ime kho, upāli, pañca pattapiṇḍikā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dhutaṅgavaggo niṭṭhito chaṭṭho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Āraññiko piṇḍipaṃsu, rukkhasusānapañcamaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Abbho tecīvarañceva, sapadānanesajjikā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Santhatekāsanañceva, khalupacchā pattapiṇḍikāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7. Musāvādavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "444"
      },
      ". ‘‘Kati nu kho, bhante, musāvādā’’ti? ‘‘Pañcime, upāli, musāvādā. Katame pañca? Atthi musāvādo pārājikagāmī, atthi musāvādo saṅghādisesagāmī, atthi musāvādo thullaccayagāmī, atthi musāvādo pācittiyagāmī, atthi musāvādo dukkaṭagāmī – ime kho, upāli, pañca musāvādā’’ti."
    ],
    "innerText": "444. ‘‘Kati nu kho, bhante, musāvādā’’ti? ‘‘Pañcime, upāli, musāvādā. Katame pañca? Atthi musāvādo pārājikagāmī, atthi musāvādo saṅghādisesagāmī, atthi musāvādo thullaccayagāmī, atthi musāvādo pācittiyagāmī, atthi musāvādo dukkaṭagāmī – ime kho, upāli, pañca musāvādā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "445"
      },
      ". ‘‘Katihi nu kho, bhante, aṅgehi samannāgatassa bhikkhuno saṅghamajjhe uposathaṃ vā pavāraṇaṃ vā ṭhapentassa – ‘alaṃ, bhikkhu, mā ",
      " bhaṇḍanaṃ, mā kalahaṃ, mā viggahaṃ, mā vivāda’nti ",
      " omadditvā saṅghena uposatho vā pavāraṇā vā kātabbā’’ti? ‘‘Pañcahupāli, aṅgehi samannāgatassa bhikkhuno saṅghamajjhe ",
      " uposathaṃ vā pavāraṇaṃ vā ṭhapentassa – ‘alaṃ, bhikkhu, mā bhaṇḍanaṃ, mā kalahaṃ, mā viggahaṃ, mā vivāda’nti omadditvā saṅghena uposatho vā pavāraṇā vā kātabbā. Katamehi pañcahi? Alajjī ca hoti, bālo ca, apakatatto ca, cāvanādhippāyo vattā hoti, no vuṭṭhānādhippāyo – imehi kho, upāli, pañcahaṅgehi samannāgatassa bhikkhuno saṅghamajjhe uposathaṃ vā pavāraṇaṃ vā ṭhapentassa – ‘alaṃ, bhikkhu, mā bhaṇḍanaṃ, mā kalahaṃ, mā viggahaṃ, mā vivāda’nti omadditvā saṅghena uposatho vā pavāraṇā vā kātabbā."
    ],
    "innerText": "445. ‘‘Katihi nu kho, bhante, aṅgehi samannāgatassa bhikkhuno saṅghamajjhe uposathaṃ vā pavāraṇaṃ vā ṭhapentassa – ‘alaṃ, bhikkhu, mā bhaṇḍanaṃ, mā kalahaṃ, mā viggahaṃ, mā vivāda’nti omadditvā saṅghena uposatho vā pavāraṇā vā kātabbā’’ti? ‘‘Pañcahupāli, aṅgehi samannāgatassa bhikkhuno saṅghamajjhe uposathaṃ vā pavāraṇaṃ vā ṭhapentassa – ‘alaṃ, bhikkhu, mā bhaṇḍanaṃ, mā kalahaṃ, mā viggahaṃ, mā vivāda’nti omadditvā saṅghena uposatho vā pavāraṇā vā kātabbā. Katamehi pañcahi? Alajjī ca hoti, bālo ca, apakatatto ca, cāvanādhippāyo vattā hoti, no vuṭṭhānādhippāyo – imehi kho, upāli, pañcahaṅgehi samannāgatassa bhikkhuno saṅghamajjhe uposathaṃ vā pavāraṇaṃ vā ṭhapentassa – ‘alaṃ, bhikkhu, mā bhaṇḍanaṃ, mā kalahaṃ, mā viggahaṃ, mā vivāda’nti omadditvā saṅghena uposatho vā pavāraṇā vā kātabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatassa bhikkhuno saṅghamajjhe uposathaṃ vā pavāraṇaṃ vā ṭhapentassa – ‘alaṃ, bhikkhu, mā bhaṇḍanaṃ, mā kalahaṃ, mā viggahaṃ, mā vivāda’nti omadditvā saṅghena uposatho vā pavāraṇā vā kātabbā. Katamehi pañcahi? Aparisuddhakāyasamācāro hoti, aparisuddhavacīsamācāro ",
      " hoti, aparisuddhājīvo hoti, bālo hoti abyatto, bhaṇḍanakārako hoti kalahakārako – imehi kho, upāli, pañcahaṅgehi samannāgatassa bhikkhuno saṅghamajjhe uposathaṃ vā pavāraṇaṃ vā ṭhapentassa – ‘alaṃ, bhikkhu, mā bhaṇḍanaṃ, mā kalahaṃ, mā viggahaṃ, mā vivāda’nti omadditvā saṅghena uposatho ",
      " vā pavāraṇā vā kātabbā’’ti."
    ],
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatassa bhikkhuno saṅghamajjhe uposathaṃ vā pavāraṇaṃ vā ṭhapentassa – ‘alaṃ, bhikkhu, mā bhaṇḍanaṃ, mā kalahaṃ, mā viggahaṃ, mā vivāda’nti omadditvā saṅghena uposatho vā pavāraṇā vā kātabbā. Katamehi pañcahi? Aparisuddhakāyasamācāro hoti, aparisuddhavacīsamācāro hoti, aparisuddhājīvo hoti, bālo hoti abyatto, bhaṇḍanakārako hoti kalahakārako – imehi kho, upāli, pañcahaṅgehi samannāgatassa bhikkhuno saṅghamajjhe uposathaṃ vā pavāraṇaṃ vā ṭhapentassa – ‘alaṃ, bhikkhu, mā bhaṇḍanaṃ, mā kalahaṃ, mā viggahaṃ, mā vivāda’nti omadditvā saṅghena uposatho vā pavāraṇā vā kātabbā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "446"
      },
      ". ‘‘Katihi nu kho, bhante, aṅgehi samannāgatassa bhikkhuno anuyogo na dātabbo’’ti? ‘‘Pañcahupāli, aṅgehi samannāgatassa bhikkhuno anuyogo na dātabbo. Katamehi pañcahi? Āpattānāpattiṃ na jānāti, lahukagarukaṃ āpattiṃ na jānāti, sāvasesānavasesaṃ āpattiṃ na jānāti, duṭṭhullāduṭṭhullaṃ āpattiṃ na jānāti, sappaṭikammāpaṭikammaṃ āpattiṃ na jānāti – imehi kho, upāli, pañcahaṅgehi samannāgatassa bhikkhuno anuyogo na dātabbo."
    ],
    "innerText": "446. ‘‘Katihi nu kho, bhante, aṅgehi samannāgatassa bhikkhuno anuyogo na dātabbo’’ti? ‘‘Pañcahupāli, aṅgehi samannāgatassa bhikkhuno anuyogo na dātabbo. Katamehi pañcahi? Āpattānāpattiṃ na jānāti, lahukagarukaṃ āpattiṃ na jānāti, sāvasesānavasesaṃ āpattiṃ na jānāti, duṭṭhullāduṭṭhullaṃ āpattiṃ na jānāti, sappaṭikammāpaṭikammaṃ āpattiṃ na jānāti – imehi kho, upāli, pañcahaṅgehi samannāgatassa bhikkhuno anuyogo na dātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Pañcahupāli, aṅgehi samannāgatassa bhikkhuno anuyogo dātabbo. Katamehi pañcahi? Āpattānāpattiṃ jānāti, lahukagarukaṃ āpattiṃ jānāti, sāvasesānavasesaṃ āpattiṃ jānāti, duṭṭhullāduṭṭhullaṃ āpattiṃ jānāti, sappaṭikammāpaṭikammaṃ āpattiṃ jānāti – imehi kho, upāli, pañcahaṅgehi samannāgatassa bhikkhuno anuyogo dātabbo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "447"
      },
      ". ‘‘Katihi ",
      " nu kho, bhante, ākārehi bhikkhu āpattiṃ āpajjatī’’ti? ‘‘Pañcahupāli, ākārehi bhikkhu āpattiṃ āpajjati. Katamehi pañcahi? Alajjitā, aññāṇatā, kukkuccapakatatā, akappiye kappiyasaññitā, kappiye akappiyasaññitā – imehi kho, upāli, pañcahākārehi bhikkhu āpattiṃ āpajjati."
    ],
    "innerText": "447. ‘‘Katihi nu kho, bhante, ākārehi bhikkhu āpattiṃ āpajjatī’’ti? ‘‘Pañcahupāli, ākārehi bhikkhu āpattiṃ āpajjati. Katamehi pañcahi? Alajjitā, aññāṇatā, kukkuccapakatatā, akappiye kappiyasaññitā, kappiye akappiyasaññitā – imehi kho, upāli, pañcahākārehi bhikkhu āpattiṃ āpajjati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi, upāli, pañcahākārehi bhikkhu āpattiṃ āpajjati. Katamehi pañcahi ",
      "? Adassanena, assavanena, pasuttakatā, tathāsaññī, satisammosā – imehi kho, upāli, pañcahākārehi bhikkhu āpattiṃ āpajjatī’’ti."
    ],
    "innerText": "‘‘Aparehipi, upāli, pañcahākārehi bhikkhu āpattiṃ āpajjati. Katamehi pañcahi ? Adassanena, assavanena, pasuttakatā, tathāsaññī, satisammosā – imehi kho, upāli, pañcahākārehi bhikkhu āpattiṃ āpajjatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "448"
      },
      ". ‘‘Kati nu kho, bhante, verā’’ti? ‘‘Pañcime, upāli, verā. Katame pañca? Pāṇātipāto ",
      ", adinnādānaṃ, kāmesumicchācāro, musāvādo, surāmerayamajjappamādaṭṭhānaṃ – ime kho, upāli, pañca verā’’ti."
    ],
    "innerText": "448. ‘‘Kati nu kho, bhante, verā’’ti? ‘‘Pañcime, upāli, verā. Katame pañca? Pāṇātipāto , adinnādānaṃ, kāmesumicchācāro, musāvādo, surāmerayamajjappamādaṭṭhānaṃ – ime kho, upāli, pañca verā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kati nu kho, bhante, veramaṇiyo’’ti? ‘‘Pañcimā, upāli, veramaṇiyo. Katamā pañca? Pāṇātipātā veramaṇī ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[veramaṇi (ka.)]"
      },
      ", adinnādānā veramaṇī, kāmesumicchācārā veramaṇī, musāvādā veramaṇī, surāmerayamajjappamādaṭṭhānā veramaṇī – imā kho, upāli, pañca veramaṇiyo’’ti."
    ],
    "innerText": "‘‘Kati nu kho, bhante, veramaṇiyo’’ti? ‘‘Pañcimā, upāli, veramaṇiyo. Katamā pañca? Pāṇātipātā veramaṇī [veramaṇi (ka.)], adinnādānā veramaṇī, kāmesumicchācārā veramaṇī, musāvādā veramaṇī, surāmerayamajjappamādaṭṭhānā veramaṇī – imā kho, upāli, pañca veramaṇiyo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "449"
      },
      ". ‘‘Kati nu kho, bhante, byasanānī’’ti? ‘‘Pañcimāni, upāli, byasanāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pari. 325; a. ni. 5.130]"
      },
      " Katamāni pañca? Ñātibyasanaṃ, bhogabyasanaṃ, rogabyasanaṃ, sīlabyasanaṃ, diṭṭhibyasanaṃ – imāni kho, upāli, pañca byasanānī’’ti."
    ],
    "innerText": "449. ‘‘Kati nu kho, bhante, byasanānī’’ti? ‘‘Pañcimāni, upāli, byasanāni. [pari. 325; a. ni. 5.130] Katamāni pañca? Ñātibyasanaṃ, bhogabyasanaṃ, rogabyasanaṃ, sīlabyasanaṃ, diṭṭhibyasanaṃ – imāni kho, upāli, pañca byasanānī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Kati nu kho, bhante, sampadā’’ti? ‘‘Pañcimā, upāli, sampadā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[pari. 325; a. ni. 5.130]"
      },
      " Katamā pañca? Ñātisampadā, bhogasampadā, ārogyasampadā, sīlasampadā, diṭṭhisampadā – imā kho, upāli, pañca sampadā’’ti."
    ],
    "innerText": "‘‘Kati nu kho, bhante, sampadā’’ti? ‘‘Pañcimā, upāli, sampadā. [pari. 325; a. ni. 5.130] Katamā pañca? Ñātisampadā, bhogasampadā, ārogyasampadā, sīlasampadā, diṭṭhisampadā – imā kho, upāli, pañca sampadā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Musāvādavaggo niṭṭhito sattamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Musāvādo ",
      " ca omaddi, aparehi anuyogo;"
    ],
    "innerText": "Musāvādo ca omaddi, aparehi anuyogo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Āpattiñca aparehi, verā veramaṇīpi ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Byasanaṃ sampadā ceva, sattamo vaggasaṅgahoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "8. Bhikkhunovādavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "450"
      },
      ". ‘‘Katihi ",
      " nu kho, bhante, aṅgehi samannāgatassa bhikkhuno bhikkhunisaṅgheneva kammaṃ kātabba’’nti? ‘‘Pañcahupāli, aṅgehi samannāgatassa bhikkhuno bhikkhunisaṅgheneva kammaṃ kātabbaṃ, avandiyo so bhikkhu bhikkhunisaṅghena. Katamehi pañcahi? Vivaritvā kāyaṃ bhikkhunīnaṃ dasseti, ūruṃ dasseti, aṅgajātaṃ dasseti, ubho aṃsakūṭe dasseti, obhāsati, gihī ",
      " sampayojeti – imehi kho, upāli, pañcahaṅgehi samannāgatassa bhikkhuno bhikkhunisaṅgheneva kammaṃ kātabbaṃ. Avandiyo so bhikkhu bhikkhunisaṅghena."
    ],
    "innerText": "450. ‘‘Katihi nu kho, bhante, aṅgehi samannāgatassa bhikkhuno bhikkhunisaṅgheneva kammaṃ kātabba’’nti? ‘‘Pañcahupāli, aṅgehi samannāgatassa bhikkhuno bhikkhunisaṅgheneva kammaṃ kātabbaṃ, avandiyo so bhikkhu bhikkhunisaṅghena. Katamehi pañcahi? Vivaritvā kāyaṃ bhikkhunīnaṃ dasseti, ūruṃ dasseti, aṅgajātaṃ dasseti, ubho aṃsakūṭe dasseti, obhāsati, gihī sampayojeti – imehi kho, upāli, pañcahaṅgehi samannāgatassa bhikkhuno bhikkhunisaṅgheneva kammaṃ kātabbaṃ. Avandiyo so bhikkhu bhikkhunisaṅghena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatassa bhikkhuno bhikkhunisaṅgheneva kammaṃ kātabbaṃ, avandiyo so bhikkhu bhikkhunisaṅghena. Katamehi pañcahi? Bhikkhunīnaṃ alābhāya parisakkati, bhikkhunīnaṃ anatthāya parisakkati, bhikkhunīnaṃ avāsāya parisakkati, bhikkhuniyo akkosati paribhāsati, bhikkhū bhikkhunīhi bhedeti – imehi kho, upāli, pañcahaṅgehi samannāgatassa bhikkhuno bhikkhunisaṅgheneva kammaṃ kātabbaṃ, avandiyo so bhikkhu bhikkhunisaṅghena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatassa bhikkhuno bhikkhunisaṅgheneva kammaṃ kātabbaṃ, avandiyo so ",
      " bhikkhu bhikkhunisaṅghena. Katamehi pañcahi? Bhikkhunīnaṃ alābhāya parisakkati, bhikkhunīnaṃ anatthāya parisakkati, bhikkhunīnaṃ avāsāya parisakkati, bhikkhuniyo akkosati paribhāsati, bhikkhū bhikkhunīhi sampayojeti – imehi kho, upāli, pañcahaṅgehi samannāgatassa bhikkhuno bhikkhunisaṅgheneva kammaṃ kātabbaṃ, avandiyo so bhikkhu bhikkhunisaṅghenā’’ti."
    ],
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatassa bhikkhuno bhikkhunisaṅgheneva kammaṃ kātabbaṃ, avandiyo so bhikkhu bhikkhunisaṅghena. Katamehi pañcahi? Bhikkhunīnaṃ alābhāya parisakkati, bhikkhunīnaṃ anatthāya parisakkati, bhikkhunīnaṃ avāsāya parisakkati, bhikkhuniyo akkosati paribhāsati, bhikkhū bhikkhunīhi sampayojeti – imehi kho, upāli, pañcahaṅgehi samannāgatassa bhikkhuno bhikkhunisaṅgheneva kammaṃ kātabbaṃ, avandiyo so bhikkhu bhikkhunisaṅghenā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "451"
      },
      ". ‘‘Katihi nu kho, bhante, aṅgehi samannāgatāya bhikkhuniyā kammaṃ kātabba’’nti? Pañcahupāli, aṅgehi samannāgatāya bhikkhuniyā kammaṃ kātabbaṃ. Katamehi pañcahi? Vivaritvā kāyaṃ bhikkhūnaṃ dasseti, ūruṃ dasseti, aṅgajātaṃ dasseti, ubho aṃsakūṭe dasseti, obhāsati, gihī sampayojeti – imehi kho, upāli, pañcahaṅgehi samannāgatāya bhikkhuniyā kammaṃ kātabbaṃ."
    ],
    "innerText": "451. ‘‘Katihi nu kho, bhante, aṅgehi samannāgatāya bhikkhuniyā kammaṃ kātabba’’nti? Pañcahupāli, aṅgehi samannāgatāya bhikkhuniyā kammaṃ kātabbaṃ. Katamehi pañcahi? Vivaritvā kāyaṃ bhikkhūnaṃ dasseti, ūruṃ dasseti, aṅgajātaṃ dasseti, ubho aṃsakūṭe dasseti, obhāsati, gihī sampayojeti – imehi kho, upāli, pañcahaṅgehi samannāgatāya bhikkhuniyā kammaṃ kātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi ",
      ", upāli, pañcahaṅgehi samannāgatāya bhikkhuniyā kammaṃ kātabbaṃ. Katamehi pañcahi? Bhikkhūnaṃ alābhāya parisakkati, bhikkhūnaṃ anatthāya parisakkati, bhikkhūnaṃ avāsāya parisakkati, bhikkhū akkosati paribhāsati, bhikkhuniyo bhikkhūhi bhedeti – imehi kho, upāli, pañcahaṅgehi samannāgatāya bhikkhuniyā kammaṃ kātabbaṃ."
    ],
    "innerText": "‘‘Aparehipi , upāli, pañcahaṅgehi samannāgatāya bhikkhuniyā kammaṃ kātabbaṃ. Katamehi pañcahi? Bhikkhūnaṃ alābhāya parisakkati, bhikkhūnaṃ anatthāya parisakkati, bhikkhūnaṃ avāsāya parisakkati, bhikkhū akkosati paribhāsati, bhikkhuniyo bhikkhūhi bhedeti – imehi kho, upāli, pañcahaṅgehi samannāgatāya bhikkhuniyā kammaṃ kātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatāya bhikkhuniyā kammaṃ kātabbaṃ. Katamehi pañcahi? Bhikkhūnaṃ alābhāya parisakkati, bhikkhūnaṃ anatthāya parisakkati, bhikkhūnaṃ avāsāya ",
      " parisakkati, bhikkhū akkosati ",
      " paribhāsati, bhikkhuniyo bhikkhūhi sampayojeti – imehi kho, upāli, pañcahaṅgehi ",
      " samannāgatāya bhikkhuniyā kammaṃ kātabba’’nti."
    ],
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatāya bhikkhuniyā kammaṃ kātabbaṃ. Katamehi pañcahi? Bhikkhūnaṃ alābhāya parisakkati, bhikkhūnaṃ anatthāya parisakkati, bhikkhūnaṃ avāsāya parisakkati, bhikkhū akkosati paribhāsati, bhikkhuniyo bhikkhūhi sampayojeti – imehi kho, upāli, pañcahaṅgehi samannāgatāya bhikkhuniyā kammaṃ kātabba’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "452"
      },
      ". ‘‘Katihi nu kho, bhante, aṅgehi samannāgatena bhikkhunā bhikkhunīnaṃ ovādo na ṭhapetabbo’’ti? ‘‘Pañcahupāli, aṅgehi samannāgatena bhikkhunā bhikkhunīnaṃ ovādo na ṭhapetabbo. Katamehi pañcahi? Alajjī ca hoti, bālo ca, apakatatto ca, cāvanādhippāyo vattā hoti, no vuṭṭhānādhippāyo – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā bhikkhunīnaṃ ovādo na ṭhapetabbo."
    ],
    "innerText": "452. ‘‘Katihi nu kho, bhante, aṅgehi samannāgatena bhikkhunā bhikkhunīnaṃ ovādo na ṭhapetabbo’’ti? ‘‘Pañcahupāli, aṅgehi samannāgatena bhikkhunā bhikkhunīnaṃ ovādo na ṭhapetabbo. Katamehi pañcahi? Alajjī ca hoti, bālo ca, apakatatto ca, cāvanādhippāyo vattā hoti, no vuṭṭhānādhippāyo – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā bhikkhunīnaṃ ovādo na ṭhapetabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatena bhikkhunā bhikkhunīnaṃ ovādo na ṭhapetabbo. Katamehi pañcahi? Aparisuddhakāyasamācāro hoti, aparisuddhavacīsamācāro hoti, aparisuddhājīvo hoti, bālo hoti, abyatto, na paṭibalo anuyuñjiyamāno anuyogaṃ dātuṃ – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā bhikkhunīnaṃ ovādo na ṭhapetabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatena bhikkhunā bhikkhunīnaṃ ovādo na ṭhapetabbo. Katamehi pañcahi? Kāyikena anācārena samannāgato hoti, vācasikena anācārena samannāgato hoti, kāyikavācasikena anācārena samannāgato hoti, bhikkhunīnaṃ akkosakaparibhāsako hoti, bhikkhunīhi saddhiṃ saṃsaṭṭho viharati ananulomikena saṃsaggena – imehi kho, upāli, pañcahaṅgehi samannāgatena ",
      " bhikkhunā bhikkhunīnaṃ ovādo na ṭhapetabbo."
    ],
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatena bhikkhunā bhikkhunīnaṃ ovādo na ṭhapetabbo. Katamehi pañcahi? Kāyikena anācārena samannāgato hoti, vācasikena anācārena samannāgato hoti, kāyikavācasikena anācārena samannāgato hoti, bhikkhunīnaṃ akkosakaparibhāsako hoti, bhikkhunīhi saddhiṃ saṃsaṭṭho viharati ananulomikena saṃsaggena – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā bhikkhunīnaṃ ovādo na ṭhapetabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi ",
      ", upāli, pañcahaṅgehi samannāgatena bhikkhunā bhikkhunīnaṃ ovādo na ṭhapetabbo. Katamehi pañcahi? Alajjī ca hoti, bālo ca, apakatatto ca, bhaṇḍanakārako ca hoti kalahakārako, sikkhāya ca na paripūrikārī – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā bhikkhunīnaṃ ovādo na ṭhapetabbo’’ti."
    ],
    "innerText": "‘‘Aparehipi , upāli, pañcahaṅgehi samannāgatena bhikkhunā bhikkhunīnaṃ ovādo na ṭhapetabbo. Katamehi pañcahi? Alajjī ca hoti, bālo ca, apakatatto ca, bhaṇḍanakārako ca hoti kalahakārako, sikkhāya ca na paripūrikārī – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā bhikkhunīnaṃ ovādo na ṭhapetabbo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "453"
      },
      ". ‘‘Katihi nu kho, bhante, aṅgehi samannāgatena bhikkhunā bhikkhunīnaṃ ovādo na gahetabbo’’ti? ‘‘Pañcahupāli, aṅgehi samannāgatena bhikkhunā bhikkhunīnaṃ ovādo na gahetabbo. Katamehi pañcahi? Kāyikena anācārena samannāgato hoti, vācasikena anācārena samannāgato hoti, kāyikavācasikena anācārena samannāgato hoti, bhikkhunīnaṃ akkosakaparibhāsako ",
      " hoti, bhikkhunīhi saddhiṃ saṃsaṭṭho viharati ananulomikena saṃsaggena – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā bhikkhunīnaṃ ovādo na gahetabbo."
    ],
    "innerText": "453. ‘‘Katihi nu kho, bhante, aṅgehi samannāgatena bhikkhunā bhikkhunīnaṃ ovādo na gahetabbo’’ti? ‘‘Pañcahupāli, aṅgehi samannāgatena bhikkhunā bhikkhunīnaṃ ovādo na gahetabbo. Katamehi pañcahi? Kāyikena anācārena samannāgato hoti, vācasikena anācārena samannāgato hoti, kāyikavācasikena anācārena samannāgato hoti, bhikkhunīnaṃ akkosakaparibhāsako hoti, bhikkhunīhi saddhiṃ saṃsaṭṭho viharati ananulomikena saṃsaggena – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā bhikkhunīnaṃ ovādo na gahetabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatena bhikkhunā bhikkhunīnaṃ ovādo na gahetabbo. Katamehi pañcahi? Alajjī ca hoti, bālo ca, apakatatto ca, gamiko vā hoti, gilāno vā – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā bhikkhunīnaṃ ovādo na gahetabbo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "454"
      },
      ". ‘‘Katihi ",
      " nu kho, bhante, aṅgehi samannāgatena bhikkhunā saddhiṃ na sākacchitabbo’’ti? ‘‘Pañcahupāli, aṅgehi samannāgatena bhikkhunā saddhiṃ na sākacchitabbo. Katamehi pañcahi? Na asekkhena sīlakkhandhena samannāgato hoti, na asekkhena samādhikkhandhena samannāgato hoti, na asekkhena paññākkhandhena samannāgato hoti, na asekkhena vimuttikkhandhena samannāgato hoti, na asekkhena vimuttiñāṇadassanakkhandhena samannāgato hoti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saddhiṃ na sākacchitabbo. Pañcahupāli, aṅgehi samannāgatena bhikkhunā saddhiṃ sākacchitabbo. Katamehi pañcahi? Asekkhena sīlakkhandhena samannāgato hoti, asekkhena samādhikkhandhena samannāgato hoti, asekkhena paññākkhandhena samannāgato hoti ",
      ", asekkhena vimuttikkhandhena samannāgato hoti, asekkhena vimuttiñāṇadassanakkhandhena ",
      " samannāgato hoti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saddhiṃ sākacchitabbo."
    ],
    "innerText": "454. ‘‘Katihi nu kho, bhante, aṅgehi samannāgatena bhikkhunā saddhiṃ na sākacchitabbo’’ti? ‘‘Pañcahupāli, aṅgehi samannāgatena bhikkhunā saddhiṃ na sākacchitabbo. Katamehi pañcahi? Na asekkhena sīlakkhandhena samannāgato hoti, na asekkhena samādhikkhandhena samannāgato hoti, na asekkhena paññākkhandhena samannāgato hoti, na asekkhena vimuttikkhandhena samannāgato hoti, na asekkhena vimuttiñāṇadassanakkhandhena samannāgato hoti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saddhiṃ na sākacchitabbo. Pañcahupāli, aṅgehi samannāgatena bhikkhunā saddhiṃ sākacchitabbo. Katamehi pañcahi? Asekkhena sīlakkhandhena samannāgato hoti, asekkhena samādhikkhandhena samannāgato hoti, asekkhena paññākkhandhena samannāgato hoti , asekkhena vimuttikkhandhena samannāgato hoti, asekkhena vimuttiñāṇadassanakkhandhena samannāgato hoti – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saddhiṃ sākacchitabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatena bhikkhunā saddhiṃ na sākacchitabbo. Katamehi pañcahi? Na atthapaṭisambhidāpatto hoti, na dhammapaṭisambhidāpatto hoti, na niruttipaṭisambhidāpatto hoti, na paṭibhānapaṭisambhidāpatto hoti, yathāvimuttaṃ cittaṃ na paccavekkhitā – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saddhiṃ na sākacchitabbo. Pañcahupāli ",
      ", aṅgehi samannāgatena bhikkhunā saddhiṃ sākacchitabbo. Katamehi pañcahi? Atthapaṭisambhidāpatto hoti, dhammapaṭisambhidāpatto hoti, niruttipaṭisambhidāpatto hoti, paṭibhānapaṭisambhidāpatto hoti, yathāvimuttaṃ cittaṃ paccavekkhitā – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saddhiṃ sākacchitabbo’’ti."
    ],
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgatena bhikkhunā saddhiṃ na sākacchitabbo. Katamehi pañcahi? Na atthapaṭisambhidāpatto hoti, na dhammapaṭisambhidāpatto hoti, na niruttipaṭisambhidāpatto hoti, na paṭibhānapaṭisambhidāpatto hoti, yathāvimuttaṃ cittaṃ na paccavekkhitā – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saddhiṃ na sākacchitabbo. Pañcahupāli , aṅgehi samannāgatena bhikkhunā saddhiṃ sākacchitabbo. Katamehi pañcahi? Atthapaṭisambhidāpatto hoti, dhammapaṭisambhidāpatto hoti, niruttipaṭisambhidāpatto hoti, paṭibhānapaṭisambhidāpatto hoti, yathāvimuttaṃ cittaṃ paccavekkhitā – imehi kho, upāli, pañcahaṅgehi samannāgatena bhikkhunā saddhiṃ sākacchitabbo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Bhikkhunovādavaggo niṭṭhito aṭṭhamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Bhikkhunīheva ",
      " kātabbaṃ, aparehi tathā duve;"
    ],
    "innerText": "Bhikkhunīheva kātabbaṃ, aparehi tathā duve;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Bhikkhunīnaṃ tayo kammā, na ṭhapetabbā dve dukā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Na gahetabbā dve vuttā, sākacchāsu ca dve dukāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9. Ubbāhikavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "455"
      },
      ". ‘‘Katihi nu kho, bhante, aṅgehi samannāgato bhikkhu ubbāhikāya na sammannitabbo’’ti? ‘‘Pañcahupāli, aṅgehi samannāgato bhikkhu ubbāhikāya na sammannitabbo. Katamehi pañcahi? Na atthakusalo hoti, na dhammakusalo hoti, na niruttikusalo hoti, na byañjanakusalo hoti, na pubbāparakusalo hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu ubbāhikāya na sammannitabbo. Pañcahupāli, aṅgehi samannāgato bhikkhu ubbāhikāya sammannitabbo. Katamehi pañcahi? Atthakusalo hoti, dhammakusalo hoti, niruttikusalo ",
      " hoti, byañjanakusalo hoti, pubbāparakusalo hoti ",
      " – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu ubbāhikāya sammannitabbo."
    ],
    "innerText": "455. ‘‘Katihi nu kho, bhante, aṅgehi samannāgato bhikkhu ubbāhikāya na sammannitabbo’’ti? ‘‘Pañcahupāli, aṅgehi samannāgato bhikkhu ubbāhikāya na sammannitabbo. Katamehi pañcahi? Na atthakusalo hoti, na dhammakusalo hoti, na niruttikusalo hoti, na byañjanakusalo hoti, na pubbāparakusalo hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu ubbāhikāya na sammannitabbo. Pañcahupāli, aṅgehi samannāgato bhikkhu ubbāhikāya sammannitabbo. Katamehi pañcahi? Atthakusalo hoti, dhammakusalo hoti, niruttikusalo hoti, byañjanakusalo hoti, pubbāparakusalo hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu ubbāhikāya sammannitabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato bhikkhu ubbāhikāya na sammannitabbo. Katamehi pañcahi? Kodhano hoti kodhābhibhūto, makkhī hoti makkhābhibhūto, paḷāsī hoti paḷāsābhibhūto, issukī hoti issābhibhūto, sandiṭṭhiparāmāsī hoti ādhānaggāhī duppaṭinissaggī – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu ubbāhikāya na sammannitabbo. Pañcahupāli, aṅgehi samannāgato bhikkhu ubbāhikāya sammannitabbo. Katamehi pañcahi? Na kodhano hoti na kodhābhibhūto, na makkhī hoti na makkhābhibhūto, na paḷāsī hoti na paḷāsābhibhūto, na issukī hoti na issābhibhūto, asandiṭṭhiparāmāsī hoti anādhānaggāhī suppaṭinissaggī – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu ubbāhikāya sammannitabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi ",
      ", upāli, pañcahaṅgehi samannāgato bhikkhu ubbāhikāya na sammannitabbo. Katamehi pañcahi? Kuppati, byāpajjati, patiṭṭhiyati, kopaṃ janeti, akhamo hoti apadakkhiṇaggāhī anusāsaniṃ – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu ubbāhikāya na sammannitabbo. Pañcahupāli, aṅgehi samannāgato bhikkhu ubbāhikāya sammannitabbo ",
      ". Katamehi pañcahi? Na kuppati, na byāpajjati, na patiṭṭhiyati, na kopaṃ janeti, khamo hoti padakkhiṇaggāhī anusāsaniṃ – imehi kho, upāli, pañcahaṅgehi ",
      " samannāgato bhikkhu ubbāhikāya sammannitabbo."
    ],
    "innerText": "‘‘Aparehipi , upāli, pañcahaṅgehi samannāgato bhikkhu ubbāhikāya na sammannitabbo. Katamehi pañcahi? Kuppati, byāpajjati, patiṭṭhiyati, kopaṃ janeti, akhamo hoti apadakkhiṇaggāhī anusāsaniṃ – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu ubbāhikāya na sammannitabbo. Pañcahupāli, aṅgehi samannāgato bhikkhu ubbāhikāya sammannitabbo . Katamehi pañcahi? Na kuppati, na byāpajjati, na patiṭṭhiyati, na kopaṃ janeti, khamo hoti padakkhiṇaggāhī anusāsaniṃ – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu ubbāhikāya sammannitabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato bhikkhu ubbāhikāya na sammannitabbo. Katamehi pañcahi? Pasāretā hoti no sāretā, anokāsakammaṃ kāretvā pavattā hoti, na yathādhamme yathāvinaye yathāpattiyā codetā hoti, na yathādhamme yathāvinaye yathāpattiyā kāretā hoti, na yathādiṭṭhiyā byākatā hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu ubbāhikāya na sammannitabbo. Pañcahupāli, aṅgehi samannāgato bhikkhu ubbāhikāya sammannitabbo. Katamehi pañcahi? Sāretā hoti no pasāretā, okāsakammaṃ ",
      " kāretvā pavattā hoti, yathādhammaṃ yathāvinaye yathāpattiyā codetā hoti, yathādhamme yathāvinaye yathāpattiyā kāretā hoti, yathādiṭṭhiyā byākatā hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu ubbāhikāya sammannitabbo."
    ],
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato bhikkhu ubbāhikāya na sammannitabbo. Katamehi pañcahi? Pasāretā hoti no sāretā, anokāsakammaṃ kāretvā pavattā hoti, na yathādhamme yathāvinaye yathāpattiyā codetā hoti, na yathādhamme yathāvinaye yathāpattiyā kāretā hoti, na yathādiṭṭhiyā byākatā hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu ubbāhikāya na sammannitabbo. Pañcahupāli, aṅgehi samannāgato bhikkhu ubbāhikāya sammannitabbo. Katamehi pañcahi? Sāretā hoti no pasāretā, okāsakammaṃ kāretvā pavattā hoti, yathādhammaṃ yathāvinaye yathāpattiyā codetā hoti, yathādhamme yathāvinaye yathāpattiyā kāretā hoti, yathādiṭṭhiyā byākatā hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu ubbāhikāya sammannitabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato bhikkhu ubbāhikāya na sammannitabbo. Katamehi pañcahi? Chandāgatiṃ gacchati, dosāgatiṃ gacchati, mohāgatiṃ gacchati, bhayāgatiṃ gacchati, alajjī ca hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu ubbāhikāya na sammannitabbo. Pañcahupāli, aṅgehi samannāgato bhikkhu ubbāhikāya sammannitabbo. Katamehi pañcahi? Na chandāgatiṃ gacchati, na dosāgatiṃ gacchati, na mohāgatiṃ gacchati, na bhayāgatiṃ gacchati, lajjī ",
      " ca hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu ubbāhikāya sammannitabbo."
    ],
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato bhikkhu ubbāhikāya na sammannitabbo. Katamehi pañcahi? Chandāgatiṃ gacchati, dosāgatiṃ gacchati, mohāgatiṃ gacchati, bhayāgatiṃ gacchati, alajjī ca hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu ubbāhikāya na sammannitabbo. Pañcahupāli, aṅgehi samannāgato bhikkhu ubbāhikāya sammannitabbo. Katamehi pañcahi? Na chandāgatiṃ gacchati, na dosāgatiṃ gacchati, na mohāgatiṃ gacchati, na bhayāgatiṃ gacchati, lajjī ca hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu ubbāhikāya sammannitabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato bhikkhu ubbāhikāya na sammannitabbo. Katamehi pañcahi? Chandāgatiṃ gacchati, dosāgatiṃ gacchati, mohāgatiṃ gacchati, bhayāgatiṃ gacchati, akusalo ca hoti vinaye – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu ubbāhikāya na sammannitabbo. Pañcahupāli, aṅgehi samannāgato bhikkhu ubbāhikāya sammannitabbo. Katamehi pañcahi? Na chandāgatiṃ gacchati, na dosāgatiṃ gacchati, na mohāgatiṃ gacchati, na bhayāgatiṃ gacchati, kusalo ca hoti vinaye – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu ubbāhikāya sammannitabbo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "456"
      },
      ". ‘‘Katihi ",
      " nu kho, bhante, aṅgehi samannāgato bhikkhu bālotveva saṅkhaṃ gacchatī’’ti? ‘‘Pañcahupāli, aṅgehi samannāgato bhikkhu bālotveva saṅkhaṃ gacchati. Katamehi pañcahi? Suttaṃ na jānāti, suttānulomaṃ na jānāti, vinayaṃ na jānāti, vinayānulomaṃ na jānāti, na ca ṭhānaṭhānakusalo hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu bālotveva saṅkhaṃ gacchati. Pañcahupāli, aṅgehi samannāgato bhikkhu paṇḍitotveva saṅkhaṃ gacchati. Katamehi pañcahi? Suttaṃ jānāti, suttānulomaṃ jānāti, vinayaṃ jānāti, vinayānulomaṃ ",
      " jānāti, ṭhānāṭhānakusalo ca ",
      " hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu paṇḍitotveva saṅkhaṃ gacchati."
    ],
    "innerText": "456. ‘‘Katihi nu kho, bhante, aṅgehi samannāgato bhikkhu bālotveva saṅkhaṃ gacchatī’’ti? ‘‘Pañcahupāli, aṅgehi samannāgato bhikkhu bālotveva saṅkhaṃ gacchati. Katamehi pañcahi? Suttaṃ na jānāti, suttānulomaṃ na jānāti, vinayaṃ na jānāti, vinayānulomaṃ na jānāti, na ca ṭhānaṭhānakusalo hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu bālotveva saṅkhaṃ gacchati. Pañcahupāli, aṅgehi samannāgato bhikkhu paṇḍitotveva saṅkhaṃ gacchati. Katamehi pañcahi? Suttaṃ jānāti, suttānulomaṃ jānāti, vinayaṃ jānāti, vinayānulomaṃ jānāti, ṭhānāṭhānakusalo ca hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu paṇḍitotveva saṅkhaṃ gacchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato bhikkhu bālotveva saṅkhaṃ gacchati. Katamehi pañcahi? Dhammaṃ na jānāti, dhammānulomaṃ ",
      " jānāti, vinayaṃ na jānāti, vinayānulomaṃ na jānāti, na ca pubbāparakusalo hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu bālotveva saṅkhaṃ gacchati. Pañcahupāli, aṅgehi samannāgato bhikkhu paṇḍitotveva saṅkhaṃ gacchati. Katamehi pañcahi? Dhammaṃ jānāti, dhammānulomaṃ jānāti, vinayaṃ jānāti, vinayānulomaṃ jānāti, pubbāparakusalo ca hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu paṇḍitotveva saṅkhaṃ gacchati."
    ],
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato bhikkhu bālotveva saṅkhaṃ gacchati. Katamehi pañcahi? Dhammaṃ na jānāti, dhammānulomaṃ jānāti, vinayaṃ na jānāti, vinayānulomaṃ na jānāti, na ca pubbāparakusalo hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu bālotveva saṅkhaṃ gacchati. Pañcahupāli, aṅgehi samannāgato bhikkhu paṇḍitotveva saṅkhaṃ gacchati. Katamehi pañcahi? Dhammaṃ jānāti, dhammānulomaṃ jānāti, vinayaṃ jānāti, vinayānulomaṃ jānāti, pubbāparakusalo ca hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu paṇḍitotveva saṅkhaṃ gacchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato bhikkhu bālotveva saṅkhaṃ gacchati. Katamehi pañcahi? Vatthuṃ na jānāti, nidānaṃ na jānāti, paññattiṃ na jānāti, padapaccābhaṭṭhaṃ na jānāti, anusandhivacanapathaṃ na jānāti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu bālotveva saṅkhaṃ gacchati. Pañcahupāli, aṅgehi samannāgato bhikkhu paṇḍitotveva saṅkhaṃ gacchati. Katamehi pañcahi? Vatthuṃ jānāti, nidānaṃ jānāti, paññattiṃ jānāti, padapaccābhaṭṭhaṃ jānāti, anusandhivacanapathaṃ jānāti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu paṇḍitotveva saṅkhaṃ gacchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato ",
      " bhikkhu bālotveva saṅkhaṃ gacchati. Katamehi pañcahi? Āpattiṃ na jānāti, āpattisamuṭṭhānaṃ na jānāti, āpattiyā payogaṃ na jānāti, āpattiyā vūpasamaṃ na jānāti, āpattiyā na vinicchayakusalo hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu bālotveva saṅkhaṃ gacchati. Pañcahupāli, aṅgehi samannāgato bhikkhu paṇḍitotveva saṅkhaṃ gacchati. Katamehi pañcahi? Āpattiṃ jānāti ",
      ", āpattisamuṭṭhānaṃ jānāti, āpattiyā payogaṃ jānāti, āpattiyā vūpasamaṃ jānāti, āpattiyā vinicchayakusalo hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu paṇḍitotveva saṅkhaṃ gacchati."
    ],
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato bhikkhu bālotveva saṅkhaṃ gacchati. Katamehi pañcahi? Āpattiṃ na jānāti, āpattisamuṭṭhānaṃ na jānāti, āpattiyā payogaṃ na jānāti, āpattiyā vūpasamaṃ na jānāti, āpattiyā na vinicchayakusalo hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu bālotveva saṅkhaṃ gacchati. Pañcahupāli, aṅgehi samannāgato bhikkhu paṇḍitotveva saṅkhaṃ gacchati. Katamehi pañcahi? Āpattiṃ jānāti , āpattisamuṭṭhānaṃ jānāti, āpattiyā payogaṃ jānāti, āpattiyā vūpasamaṃ jānāti, āpattiyā vinicchayakusalo hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu paṇḍitotveva saṅkhaṃ gacchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi ",
      ", upāli, pañcahaṅgehi samannāgato bhikkhu bālotveva saṅkhaṃ gacchati. Katamehi pañcahi? Adhikaraṇaṃ na jānāti, adhikaraṇasamuṭṭhānaṃ na jānāti, adhikaraṇassa payogaṃ na jānāti, adhikaraṇassa vūpasamaṃ na jānāti, adhikaraṇassa na vinicchayakusalo hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu bālotveva saṅkhaṃ gacchati. Pañcahupāli, aṅgehi samannāgato bhikkhu paṇḍitotveva saṅkhaṃ gacchati. Katamehi pañcahi? Adhikaraṇaṃ jānāti, adhikaraṇasamuṭṭhānaṃ jānāti, adhikaraṇassa payogaṃ jānāti, adhikaraṇassa vūpasamaṃ jānāti, adhikaraṇassa vinicchayakusalo hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu paṇḍitotveva saṅkhaṃ gacchatī’’ti."
    ],
    "innerText": "‘‘Aparehipi , upāli, pañcahaṅgehi samannāgato bhikkhu bālotveva saṅkhaṃ gacchati. Katamehi pañcahi? Adhikaraṇaṃ na jānāti, adhikaraṇasamuṭṭhānaṃ na jānāti, adhikaraṇassa payogaṃ na jānāti, adhikaraṇassa vūpasamaṃ na jānāti, adhikaraṇassa na vinicchayakusalo hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu bālotveva saṅkhaṃ gacchati. Pañcahupāli, aṅgehi samannāgato bhikkhu paṇḍitotveva saṅkhaṃ gacchati. Katamehi pañcahi? Adhikaraṇaṃ jānāti, adhikaraṇasamuṭṭhānaṃ jānāti, adhikaraṇassa payogaṃ jānāti, adhikaraṇassa vūpasamaṃ jānāti, adhikaraṇassa vinicchayakusalo hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu paṇḍitotveva saṅkhaṃ gacchatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ubbāhikavaggo niṭṭhito navamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Na ",
      " atthakusalo ceva, kodhano kuppatī ca yo;"
    ],
    "innerText": "Na atthakusalo ceva, kodhano kuppatī ca yo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pasāretā chandāgatiṃ, akusalo tatheva ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Suttaṃ dhammañca vatthuñca, āpatti adhikaraṇaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dve dve pakāsitā sabbe, kaṇhasukkaṃ vijānathāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "10. Adhikaraṇavūpasamavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "457"
      },
      ". ‘‘Katihi nu kho, bhante, aṅgehi samannāgato bhikkhu nālaṃ adhikaraṇaṃ vūpasametu’’nti? ‘‘Pañcahupāli, aṅgehi samannāgato bhikkhu nālaṃ adhikaraṇaṃ vūpasametuṃ. Katamehi pañcahi? Āpattiṃ ",
      " na jānāti, āpattisamuṭṭhānaṃ na jānāti, āpattiyā payogaṃ na jānāti, āpattiyā vūpasamaṃ na jānāti, āpattiyā na vinicchayakusalo hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu nālaṃ adhikaraṇaṃ vūpasametuṃ. Pañcahupāli, aṅgehi samannāgato bhikkhu alaṃ adhikaraṇaṃ vūpasametuṃ. Katamehi pañcahi? Āpattiṃ ",
      " jānāti, āpattisamuṭṭhānaṃ jānāti, āpattiyā payogaṃ jānāti, āpattiyā vūpasamaṃ jānāti, āpattiyā ",
      " vinicchayakusalo hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu alaṃ adhikaraṇaṃ vūpasametuṃ."
    ],
    "innerText": "457. ‘‘Katihi nu kho, bhante, aṅgehi samannāgato bhikkhu nālaṃ adhikaraṇaṃ vūpasametu’’nti? ‘‘Pañcahupāli, aṅgehi samannāgato bhikkhu nālaṃ adhikaraṇaṃ vūpasametuṃ. Katamehi pañcahi? Āpattiṃ na jānāti, āpattisamuṭṭhānaṃ na jānāti, āpattiyā payogaṃ na jānāti, āpattiyā vūpasamaṃ na jānāti, āpattiyā na vinicchayakusalo hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu nālaṃ adhikaraṇaṃ vūpasametuṃ. Pañcahupāli, aṅgehi samannāgato bhikkhu alaṃ adhikaraṇaṃ vūpasametuṃ. Katamehi pañcahi? Āpattiṃ jānāti, āpattisamuṭṭhānaṃ jānāti, āpattiyā payogaṃ jānāti, āpattiyā vūpasamaṃ jānāti, āpattiyā vinicchayakusalo hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu alaṃ adhikaraṇaṃ vūpasametuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato bhikkhu nālaṃ ",
      " adhikaraṇaṃ vūpasametuṃ. Katamehi pañcahi? Adhikaraṇaṃ na jānāti, adhikaraṇasamuṭṭhānaṃ na jānāti, adhikaraṇassa payogaṃ na jānāti, adhikaraṇassa vūpasamaṃ na jānāti, adhikaraṇassa na vinicchayakusalo hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu nālaṃ adhikaraṇaṃ vūpasametuṃ."
    ],
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato bhikkhu nālaṃ adhikaraṇaṃ vūpasametuṃ. Katamehi pañcahi? Adhikaraṇaṃ na jānāti, adhikaraṇasamuṭṭhānaṃ na jānāti, adhikaraṇassa payogaṃ na jānāti, adhikaraṇassa vūpasamaṃ na jānāti, adhikaraṇassa na vinicchayakusalo hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu nālaṃ adhikaraṇaṃ vūpasametuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Pañcahupāli, aṅgehi samannāgato bhikkhu alaṃ adhikaraṇaṃ vūpasametuṃ. Katamehi pañcahi? Adhikaraṇaṃ jānāti, adhikaraṇasamuṭṭhānaṃ jānāti, adhikaraṇassa payogaṃ jānāti, adhikaraṇassa vūpasamaṃ jānāti, adhikaraṇassa vinicchayakusalo hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu alaṃ adhikaraṇaṃ vūpasametuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato bhikkhu nālaṃ adhikaraṇaṃ vūpasametuṃ. Katamehi pañcahi? Chandāgatiṃ gacchati, dosāgatiṃ gacchati, mohāgatiṃ gacchati, bhayāgatiṃ gacchati, alajjī ca hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu nālaṃ adhikaraṇaṃ vūpasametuṃ. Pañcahupāli, aṅgehi samannāgato bhikkhu alaṃ adhikaraṇaṃ vūpasametuṃ. Katamehi pañcahi? Na chandāgatiṃ gacchati, na dosāgatiṃ gacchati, na mohāgatiṃ gacchati, na bhayāgatiṃ gacchati, lajjī ca hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu alaṃ adhikaraṇaṃ vūpasametuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato bhikkhu nālaṃ adhikaraṇaṃ vūpasametuṃ. Katamehi pañcahi? Chandāgatiṃ gacchati, dosāgatiṃ gacchati, mohāgatiṃ gacchati, bhayāgatiṃ gacchati ",
      ", appassuto ca hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu nālaṃ adhikaraṇaṃ vūpasametuṃ. Pañcahupāli, aṅgehi samannāgato bhikkhu alaṃ adhikaraṇaṃ vūpasametuṃ. Katamehi pañcahi? Na chandāgatiṃ gacchati, na dosāgatiṃ gacchati, na mohāgatiṃ gacchati, na bhayāgatiṃ gacchati, bahussuto ca hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu alaṃ adhikaraṇaṃ vūpasametuṃ."
    ],
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato bhikkhu nālaṃ adhikaraṇaṃ vūpasametuṃ. Katamehi pañcahi? Chandāgatiṃ gacchati, dosāgatiṃ gacchati, mohāgatiṃ gacchati, bhayāgatiṃ gacchati , appassuto ca hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu nālaṃ adhikaraṇaṃ vūpasametuṃ. Pañcahupāli, aṅgehi samannāgato bhikkhu alaṃ adhikaraṇaṃ vūpasametuṃ. Katamehi pañcahi? Na chandāgatiṃ gacchati, na dosāgatiṃ gacchati, na mohāgatiṃ gacchati, na bhayāgatiṃ gacchati, bahussuto ca hoti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu alaṃ adhikaraṇaṃ vūpasametuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi ",
      ", upāli, pañcahaṅgehi samannāgato bhikkhu nālaṃ adhikaraṇaṃ vūpasametuṃ. Katamehi pañcahi? Vatthuṃ na jānāti, nidānaṃ na jānāti, paññattiṃ na jānāti, padapaccābhaṭṭhaṃ na jānāti, anusandhivacanapathaṃ na jānāti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu nālaṃ adhikaraṇaṃ vūpasametuṃ. Pañcahupāli, aṅgehi samannāgato bhikkhu alaṃ adhikaraṇaṃ vūpasametuṃ. Katamehi pañcahi? Vatthuṃ jānāti, nidānaṃ jānāti, paññattiṃ jānāti, padapaccābhaṭṭhaṃ jānāti, anusandhivacanapathaṃ jānāti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu alaṃ adhikaraṇaṃ vūpasametuṃ."
    ],
    "innerText": "‘‘Aparehipi , upāli, pañcahaṅgehi samannāgato bhikkhu nālaṃ adhikaraṇaṃ vūpasametuṃ. Katamehi pañcahi? Vatthuṃ na jānāti, nidānaṃ na jānāti, paññattiṃ na jānāti, padapaccābhaṭṭhaṃ na jānāti, anusandhivacanapathaṃ na jānāti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu nālaṃ adhikaraṇaṃ vūpasametuṃ. Pañcahupāli, aṅgehi samannāgato bhikkhu alaṃ adhikaraṇaṃ vūpasametuṃ. Katamehi pañcahi? Vatthuṃ jānāti, nidānaṃ jānāti, paññattiṃ jānāti, padapaccābhaṭṭhaṃ jānāti, anusandhivacanapathaṃ jānāti – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu alaṃ adhikaraṇaṃ vūpasametuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato bhikkhu nālaṃ adhikaraṇaṃ vūpasametuṃ. Katamehi pañcahi? Chandāgatiṃ gacchati, dosāgatiṃ gacchati, mohāgatiṃ gacchati, bhayāgatiṃ gacchati, akusalo ca hoti vinaye – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu nālaṃ adhikaraṇaṃ vūpasametuṃ. Pañcahupāli, aṅgehi samannāgato bhikkhu alaṃ adhikaraṇaṃ vūpasametuṃ. Katamehi pañcahi? Na chandāgatiṃ gacchati, na dosāgatiṃ gacchati, na mohāgatiṃ gacchati, na bhayāgatiṃ gacchati, kusalo ca hoti vinaye – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu alaṃ adhikaraṇaṃ vūpasametuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato bhikkhu nālaṃ adhikaraṇaṃ vūpasametuṃ. Katamehi pañcahi? Chandāgatiṃ gacchati, dosāgatiṃ gacchati, mohāgatiṃ gacchati, bhayāgatiṃ gacchati, puggalagaru hoti no saṅghagaru – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu nālaṃ adhikaraṇaṃ vūpasametuṃ. Pañcahupāli ",
      ", aṅgehi samannāgato bhikkhu alaṃ adhikaraṇaṃ vūpasametuṃ ",
      ". Katamehi pañcahi? Na chandāgatiṃ gacchati, na dosāgatiṃ gacchati, na mohāgatiṃ gacchati, na bhayāgatiṃ gacchati, saṅghagaru hoti no puggalagaru – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu alaṃ adhikaraṇaṃ vūpasametuṃ."
    ],
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato bhikkhu nālaṃ adhikaraṇaṃ vūpasametuṃ. Katamehi pañcahi? Chandāgatiṃ gacchati, dosāgatiṃ gacchati, mohāgatiṃ gacchati, bhayāgatiṃ gacchati, puggalagaru hoti no saṅghagaru – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu nālaṃ adhikaraṇaṃ vūpasametuṃ. Pañcahupāli , aṅgehi samannāgato bhikkhu alaṃ adhikaraṇaṃ vūpasametuṃ . Katamehi pañcahi? Na chandāgatiṃ gacchati, na dosāgatiṃ gacchati, na mohāgatiṃ gacchati, na bhayāgatiṃ gacchati, saṅghagaru hoti no puggalagaru – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu alaṃ adhikaraṇaṃ vūpasametuṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato bhikkhu nālaṃ adhikaraṇaṃ vūpasametuṃ. Katamehi pañcahi? Chandāgatiṃ gacchati, dosāgatiṃ gacchati, mohāgatiṃ gacchati, bhayāgatiṃ gacchati, āmisagaru hoti no saddhammagaru – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu nālaṃ adhikaraṇaṃ ",
      " vūpasametuṃ. Pañcahupāli, aṅgehi samannāgato bhikkhu alaṃ adhikaraṇaṃ vūpasametuṃ. Katamehi pañcahi? Na chandāgatiṃ gacchati, na dosāgatiṃ gacchati, na ",
      " mohāgatiṃ gacchati, na bhayāgatiṃ gacchati, saddhammagaru hoti no ",
      " āmisagaru – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu alaṃ adhikaraṇaṃ vūpasametu’’nti."
    ],
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato bhikkhu nālaṃ adhikaraṇaṃ vūpasametuṃ. Katamehi pañcahi? Chandāgatiṃ gacchati, dosāgatiṃ gacchati, mohāgatiṃ gacchati, bhayāgatiṃ gacchati, āmisagaru hoti no saddhammagaru – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu nālaṃ adhikaraṇaṃ vūpasametuṃ. Pañcahupāli, aṅgehi samannāgato bhikkhu alaṃ adhikaraṇaṃ vūpasametuṃ. Katamehi pañcahi? Na chandāgatiṃ gacchati, na dosāgatiṃ gacchati, na mohāgatiṃ gacchati, na bhayāgatiṃ gacchati, saddhammagaru hoti no āmisagaru – imehi kho, upāli, pañcahaṅgehi samannāgato bhikkhu alaṃ adhikaraṇaṃ vūpasametu’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "458"
      },
      ". ‘‘Katihi nu kho, bhante, ākārehi saṅgho bhijjatī’’ti? ‘‘Pañcahupāli, ākārehi saṅgho bhijjati. Katamehi pañcahi? Kammena, uddesena, voharanto, anussāvanena, salākaggāhena – imehi kho, upāli, pañcahākārehi saṅgho bhijjatī’’ti."
    ],
    "innerText": "458. ‘‘Katihi nu kho, bhante, ākārehi saṅgho bhijjatī’’ti? ‘‘Pañcahupāli, ākārehi saṅgho bhijjati. Katamehi pañcahi? Kammena, uddesena, voharanto, anussāvanena, salākaggāhena – imehi kho, upāli, pañcahākārehi saṅgho bhijjatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Saṅgharāji saṅgharājīti, bhante, vuccati. Kittāvatā nu kho, bhante, saṅgharāji hoti no ca saṅghabhedo? Kittāvatā ca pana saṅgharāji ceva hoti saṅghabhedo cā’’ti? ‘‘Paññattetaṃ, upāli, mayā āgantukānaṃ bhikkhūnaṃ āgantukavattaṃ. Evaṃ supaññatte kho, upāli, mayā sikkhāpade āgantukā bhikkhū āgantukavatte na vattanti. Evampi kho, upāli, saṅgharāji hoti no ca saṅghabhedo. Paññattetaṃ, upāli, mayā āvāsikānaṃ bhikkhūnaṃ āvāsikavattaṃ. Evaṃ supaññatte kho, upāli, mayā sikkhāpade āvāsikā bhikkhū āvāsikavatte na vattanti. Evampi kho, upāli, saṅgharāji hoti no ca saṅghabhedo. Paññattetaṃ upāli mayā bhikkhūnaṃ bhattagge bhattaggavattaṃ – yathāvuḍḍhaṃ yathārattaṃ yathāpatirūpaṃ aggāsanaṃ aggodakaṃ aggapiṇḍaṃ. Evaṃ supaññatte kho, upāli, mayā sikkhāpade navā bhikkhū bhattagge therānaṃ bhikkhūnaṃ āsanaṃ paṭibāhanti. Evampi kho, upāli, saṅgharāji hoti no ca saṅghabhedo. Paññattetaṃ, upāli, mayā bhikkhūnaṃ senāsane ",
      " senāsanavattaṃ – yathāvuḍḍhaṃ yathārattaṃ yathāpatirūpaṃ. Evaṃ supaññatte kho, upāli, mayā sikkhāpade navā bhikkhū therānaṃ bhikkhūnaṃ senāsanaṃ paṭibāhanti. Evampi kho, upāli, saṅgharāji hoti no ca saṅghabhedo. Paññattetaṃ, upāli, mayā bhikkhūnaṃ antosīmāya ekaṃ uposathaṃ ekaṃ pavāraṇaṃ ekaṃ saṅghakammaṃ ekaṃ kammākammaṃ. Evaṃ supaññatte kho, upāli, mayā sikkhāpade tattheva antosīmāya āvenibhāvaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[āveṇibhāvaṃ (sī. syā.)]"
      },
      " karitvā gaṇaṃ bandhitvā ",
      " āveniṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[āveṇi (sī. syā.)]"
      },
      " uposathaṃ karonti āveniṃ pavāraṇaṃ ",
      " karonti āveniṃ saṅghakammaṃ karonti āveniṃ kammākammāni karonti. Evaṃ kho, upāli, saṅgharāji ceva hoti saṅghabhedo cā’’ti."
    ],
    "innerText": "‘‘Saṅgharāji saṅgharājīti, bhante, vuccati. Kittāvatā nu kho, bhante, saṅgharāji hoti no ca saṅghabhedo? Kittāvatā ca pana saṅgharāji ceva hoti saṅghabhedo cā’’ti? ‘‘Paññattetaṃ, upāli, mayā āgantukānaṃ bhikkhūnaṃ āgantukavattaṃ. Evaṃ supaññatte kho, upāli, mayā sikkhāpade āgantukā bhikkhū āgantukavatte na vattanti. Evampi kho, upāli, saṅgharāji hoti no ca saṅghabhedo. Paññattetaṃ, upāli, mayā āvāsikānaṃ bhikkhūnaṃ āvāsikavattaṃ. Evaṃ supaññatte kho, upāli, mayā sikkhāpade āvāsikā bhikkhū āvāsikavatte na vattanti. Evampi kho, upāli, saṅgharāji hoti no ca saṅghabhedo. Paññattetaṃ upāli mayā bhikkhūnaṃ bhattagge bhattaggavattaṃ – yathāvuḍḍhaṃ yathārattaṃ yathāpatirūpaṃ aggāsanaṃ aggodakaṃ aggapiṇḍaṃ. Evaṃ supaññatte kho, upāli, mayā sikkhāpade navā bhikkhū bhattagge therānaṃ bhikkhūnaṃ āsanaṃ paṭibāhanti. Evampi kho, upāli, saṅgharāji hoti no ca saṅghabhedo. Paññattetaṃ, upāli, mayā bhikkhūnaṃ senāsane senāsanavattaṃ – yathāvuḍḍhaṃ yathārattaṃ yathāpatirūpaṃ. Evaṃ supaññatte kho, upāli, mayā sikkhāpade navā bhikkhū therānaṃ bhikkhūnaṃ senāsanaṃ paṭibāhanti. Evampi kho, upāli, saṅgharāji hoti no ca saṅghabhedo. Paññattetaṃ, upāli, mayā bhikkhūnaṃ antosīmāya ekaṃ uposathaṃ ekaṃ pavāraṇaṃ ekaṃ saṅghakammaṃ ekaṃ kammākammaṃ. Evaṃ supaññatte kho, upāli, mayā sikkhāpade tattheva antosīmāya āvenibhāvaṃ [āveṇibhāvaṃ (sī. syā.)] karitvā gaṇaṃ bandhitvā āveniṃ [āveṇi (sī. syā.)] uposathaṃ karonti āveniṃ pavāraṇaṃ karonti āveniṃ saṅghakammaṃ karonti āveniṃ kammākammāni karonti. Evaṃ kho, upāli, saṅgharāji ceva hoti saṅghabhedo cā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Adhikaraṇavūpasamavaggo niṭṭhito dasamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Āpattiṃ ",
      " adhikaraṇaṃ, chandā appassutena ca;"
    ],
    "innerText": "Āpattiṃ adhikaraṇaṃ, chandā appassutena ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Vatthuñca akusalo ca, puggalo āmisena ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhijjati saṅgharāji ca, saṅghabhedo tatheva cāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "11. Saṅghabhedakavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "459"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[cūḷava. 354-355; a. ni. 10.38 ādayo]"
      },
      " ‘‘Katihi nu kho, bhante, aṅgehi samannāgato saṅghabhedako āpāyiko nerayiko kappaṭṭho atekiccho’’ti? ‘‘Pañcahupāli, aṅgehi samannāgato saṅghabhedako āpāyiko nerayiko kappaṭṭho atekiccho. Katamehi pañcahi? Idhupāli, bhikkhu adhammaṃ dhammoti dīpeti, dhammaṃ adhammoti dīpeti, avinayaṃ vinayoti dīpeti, vinayaṃ avinayoti ",
      " dīpeti, vinidhāya diṭṭhiṃ kammena – imehi kho, upāli, pañcahaṅgehi samannāgato saṅghabhedako āpāyiko nerayiko kappaṭṭho atekiccho."
    ],
    "innerText": "459.[cūḷava. 354-355; a. ni. 10.38 ādayo] ‘‘Katihi nu kho, bhante, aṅgehi samannāgato saṅghabhedako āpāyiko nerayiko kappaṭṭho atekiccho’’ti? ‘‘Pañcahupāli, aṅgehi samannāgato saṅghabhedako āpāyiko nerayiko kappaṭṭho atekiccho. Katamehi pañcahi? Idhupāli, bhikkhu adhammaṃ dhammoti dīpeti, dhammaṃ adhammoti dīpeti, avinayaṃ vinayoti dīpeti, vinayaṃ avinayoti dīpeti, vinidhāya diṭṭhiṃ kammena – imehi kho, upāli, pañcahaṅgehi samannāgato saṅghabhedako āpāyiko nerayiko kappaṭṭho atekiccho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato saṅghabhedako āpāyiko nerayiko kappaṭṭho atekiccho. Katamehi pañcahi? Idhupāli, bhikkhu adhammaṃ dhammoti dīpeti, dhammaṃ adhammoti dīpeti, avinayaṃ vinayoti dīpeti, vinayaṃ avinayoti dīpeti, vinidhāya diṭṭhiṃ uddesena – imehi kho, upāli, pañcahaṅgehi samannāgato saṅghabhedako āpāyiko nerayiko kappaṭṭho atekiccho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato saṅghabhedako āpāyiko nerayiko kappaṭṭho atekiccho. Katamehi pañcahi? Idhupāli, bhikkhu adhammaṃ dhammoti dīpeti, dhammaṃ adhammoti dīpeti, avinayaṃ ",
      " vinayoti dīpeti, vinayaṃ avinayoti dīpeti, vinidhāya diṭṭhi voharanto – imehi kho, upāli, pañcahaṅgehi samannāgato saṅghabhedako āpāyiko nerayiko kappaṭṭho atekiccho."
    ],
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato saṅghabhedako āpāyiko nerayiko kappaṭṭho atekiccho. Katamehi pañcahi? Idhupāli, bhikkhu adhammaṃ dhammoti dīpeti, dhammaṃ adhammoti dīpeti, avinayaṃ vinayoti dīpeti, vinayaṃ avinayoti dīpeti, vinidhāya diṭṭhi voharanto – imehi kho, upāli, pañcahaṅgehi samannāgato saṅghabhedako āpāyiko nerayiko kappaṭṭho atekiccho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato saṅghabhedako āpāyiko nerayiko kappaṭṭho atekiccho. Katamehi pañcahi? Idhupāli, bhikkhu adhammaṃ dhammoti dīpeti, dhammaṃ adhammoti dīpeti, avinayaṃ vinayoti dīpeti, vinayaṃ avinayoti dīpeti, vinidhāya diṭṭhiṃ ",
      " anussāvanena – imehi kho, upāli, pañcahaṅgehi samannāgato saṅghabhedako āpāyiko nerayiko kappaṭṭho atekiccho."
    ],
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato saṅghabhedako āpāyiko nerayiko kappaṭṭho atekiccho. Katamehi pañcahi? Idhupāli, bhikkhu adhammaṃ dhammoti dīpeti, dhammaṃ adhammoti dīpeti, avinayaṃ vinayoti dīpeti, vinayaṃ avinayoti dīpeti, vinidhāya diṭṭhiṃ anussāvanena – imehi kho, upāli, pañcahaṅgehi samannāgato saṅghabhedako āpāyiko nerayiko kappaṭṭho atekiccho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi, upāli ",
      ", pañcahaṅgehi samannāgato saṅghabhedako āpāyiko nerayiko kappaṭṭho atekiccho. Katamehi pañcahi? Idhupāli, bhikkhu adhammaṃ dhammoti dīpeti, dhammaṃ adhammoti dīpeti, avinayaṃ vinayoti dīpeti, vinayaṃ avinayoti dīpeti, vinidhāya diṭṭhiṃ salākaggāhena – imehi kho, upāli, pañcahaṅgehi samannāgato saṅghabhedako āpāyiko nerayiko kappaṭṭho atekiccho."
    ],
    "innerText": "‘‘Aparehipi, upāli , pañcahaṅgehi samannāgato saṅghabhedako āpāyiko nerayiko kappaṭṭho atekiccho. Katamehi pañcahi? Idhupāli, bhikkhu adhammaṃ dhammoti dīpeti, dhammaṃ adhammoti dīpeti, avinayaṃ vinayoti dīpeti, vinayaṃ avinayoti dīpeti, vinidhāya diṭṭhiṃ salākaggāhena – imehi kho, upāli, pañcahaṅgehi samannāgato saṅghabhedako āpāyiko nerayiko kappaṭṭho atekiccho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato saṅghabhedako āpāyiko nerayiko kappaṭṭho atekiccho. Katamehi pañcahi? Idhupāli, bhikkhu adhammaṃ dhammoti dīpeti, dhammaṃ adhammoti dīpeti, avinayaṃ vinayoti dīpeti, vinayaṃ avinayoti dīpeti, vinidhāya khantiṃ kammena…pe… vinidhāya khantiṃ uddesena…pe… vinidhāya khantiṃ voharanto…pe… vinidhāya khantiṃ anussāvanena…pe… vinidhāya khantiṃ salākaggāhena – imehi kho, upāli, pañcahaṅgehi samannāgato saṅghabhedako āpāyiko nerayiko kappaṭṭho atekiccho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato saṅghabhedako āpāyiko nerayiko kappaṭṭho atekiccho. Katamehi pañcahi? Idhupāli, bhikkhu adhammaṃ dhammoti dīpeti, dhammaṃ adhammoti dīpeti avinayaṃ vinayoti dīpeti, vinayaṃ avinayoti dīpeti, vinidhāya ruciṃ kammena…pe… vinidhāya ruciṃ uddesena…pe… vinidhāya ruciṃ voharanto…pe… vinidhāya ruciṃ anussāvanena…pe… vinidhāya ruciṃ salākaggāhena – imehi kho ",
      ", upāli, pañcahaṅgehi ",
      " samannāgato saṅghabhedako āpāyiko nerayiko kappaṭṭho atekiccho."
    ],
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato saṅghabhedako āpāyiko nerayiko kappaṭṭho atekiccho. Katamehi pañcahi? Idhupāli, bhikkhu adhammaṃ dhammoti dīpeti, dhammaṃ adhammoti dīpeti avinayaṃ vinayoti dīpeti, vinayaṃ avinayoti dīpeti, vinidhāya ruciṃ kammena…pe… vinidhāya ruciṃ uddesena…pe… vinidhāya ruciṃ voharanto…pe… vinidhāya ruciṃ anussāvanena…pe… vinidhāya ruciṃ salākaggāhena – imehi kho , upāli, pañcahaṅgehi samannāgato saṅghabhedako āpāyiko nerayiko kappaṭṭho atekiccho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato saṅghabhedako āpāyiko nerayiko kappaṭṭho atekiccho. Katamehi pañcahi? Idhupāli ",
      ", bhikkhu adhammaṃ dhammoti dīpeti, dhammaṃ adhammoti dīpeti, avinayaṃ vinayoti dīpeti, vinayaṃ avinayoti dīpeti, vinidhāya saññaṃ kammena…pe… vinidhāya saññaṃ uddesena…pe… vinidhāya saññaṃ voharanto…pe… vinidhāya saññaṃ anussāvanena…pe… vinidhāya saññaṃ salākaggāhena – imehi kho, upāli, pañcahaṅgehi samannāgato saṅghabhedako āpāyiko nerayiko kappaṭṭho atekiccho’’ti."
    ],
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato saṅghabhedako āpāyiko nerayiko kappaṭṭho atekiccho. Katamehi pañcahi? Idhupāli , bhikkhu adhammaṃ dhammoti dīpeti, dhammaṃ adhammoti dīpeti, avinayaṃ vinayoti dīpeti, vinayaṃ avinayoti dīpeti, vinidhāya saññaṃ kammena…pe… vinidhāya saññaṃ uddesena…pe… vinidhāya saññaṃ voharanto…pe… vinidhāya saññaṃ anussāvanena…pe… vinidhāya saññaṃ salākaggāhena – imehi kho, upāli, pañcahaṅgehi samannāgato saṅghabhedako āpāyiko nerayiko kappaṭṭho atekiccho’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Saṅghabhedakavaggo niṭṭhito ekādasamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Vinidhāya ",
      " diṭṭhiṃ kammena, uddese voharena ca;"
    ],
    "innerText": "Vinidhāya diṭṭhiṃ kammena, uddese voharena ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Anussāvane salākena, pañcete diṭṭhinissitā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Khantiṃ ruciñca saññañca, tayo te pañcadhā nayāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "12. Dutiyasaṅghabhedakavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "460"
      },
      ". ‘‘Katihi nu kho, bhante, aṅgehi samannāgato saṅghabhedako na āpāyiko na nerayiko na kappaṭṭho na atekiccho’’ti? ‘‘Pañcahupāli, aṅgehi samannāgato saṅghabhedako na āpāyiko na nerayiko na kappaṭṭho na atekiccho. Katamehi pañcahi? Idhupāli, bhikkhu adhammaṃ dhammoti dīpeti, dhammaṃ adhammoti dīpeti ",
      ", avinayaṃ vinayoti dīpeti, vinayaṃ avinayoti dīpeti, avinidhāya diṭṭhiṃ kammena – imehi kho, upāli, pañcahaṅgehi samannāgato saṅghabhedako na āpāyiko na nerayiko na kappaṭṭho na atekiccho."
    ],
    "innerText": "460. ‘‘Katihi nu kho, bhante, aṅgehi samannāgato saṅghabhedako na āpāyiko na nerayiko na kappaṭṭho na atekiccho’’ti? ‘‘Pañcahupāli, aṅgehi samannāgato saṅghabhedako na āpāyiko na nerayiko na kappaṭṭho na atekiccho. Katamehi pañcahi? Idhupāli, bhikkhu adhammaṃ dhammoti dīpeti, dhammaṃ adhammoti dīpeti , avinayaṃ vinayoti dīpeti, vinayaṃ avinayoti dīpeti, avinidhāya diṭṭhiṃ kammena – imehi kho, upāli, pañcahaṅgehi samannāgato saṅghabhedako na āpāyiko na nerayiko na kappaṭṭho na atekiccho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato saṅghabhedako na āpāyiko na nerayiko na kappaṭṭho na atekiccho. Katamehi pañcahi? Idhupāli, bhikkhu adhammaṃ dhammoti dīpeti, dhammaṃ adhammoti dīpeti, avinayaṃ ",
      " vinayoti dīpeti, vinayaṃ avinayoti dīpeti, avinidhāya diṭṭhiṃ uddesena – imehi kho, upāli, pañcahaṅgehi samannāgato saṅghabhedako na āpāyiko na nerayiko na kappaṭṭho na atekiccho."
    ],
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato saṅghabhedako na āpāyiko na nerayiko na kappaṭṭho na atekiccho. Katamehi pañcahi? Idhupāli, bhikkhu adhammaṃ dhammoti dīpeti, dhammaṃ adhammoti dīpeti, avinayaṃ vinayoti dīpeti, vinayaṃ avinayoti dīpeti, avinidhāya diṭṭhiṃ uddesena – imehi kho, upāli, pañcahaṅgehi samannāgato saṅghabhedako na āpāyiko na nerayiko na kappaṭṭho na atekiccho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato saṅghabhedako na āpāyiko na nerayiko na kappaṭṭho na atekiccho. Katamehi pañcahi? Idhupāli, bhikkhu adhammaṃ dhammoti dīpeti, dhammaṃ adhammoti dīpeti, avinayaṃ vinayoti dīpeti, vinayaṃ avinayoti dīpeti, avinidhāya diṭṭhiṃ voharanto. Imehi kho, upāli, pañcahaṅgehi samannāgato saṅghabhedako na āpāyiko na nerayiko na kappaṭṭho na atekiccho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato saṅghabhedako na āpāyiko na nerayiko na kappaṭṭho na atekiccho. Katamehi pañcahi? Idhupāli, bhikkhu adhammaṃ dhammoti dīpeti, dhammaṃ adhammoti dīpeti, avinayaṃ vinayoti dīpeti, vinayaṃ avinayoti dīpeti, avinidhāya ",
      " diṭṭhiṃ anussāvanena – imehi kho, upāli, pañcahaṅgehi samannāgato saṅghabhedako na āpāyiko na nerayiko na kappaṭṭho na atekiccho."
    ],
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato saṅghabhedako na āpāyiko na nerayiko na kappaṭṭho na atekiccho. Katamehi pañcahi? Idhupāli, bhikkhu adhammaṃ dhammoti dīpeti, dhammaṃ adhammoti dīpeti, avinayaṃ vinayoti dīpeti, vinayaṃ avinayoti dīpeti, avinidhāya diṭṭhiṃ anussāvanena – imehi kho, upāli, pañcahaṅgehi samannāgato saṅghabhedako na āpāyiko na nerayiko na kappaṭṭho na atekiccho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato saṅghabhedako na āpāyiko na nerayiko na kappaṭṭho na atekiccho. Katamehi pañcahi? Idhupāli, bhikkhu adhammaṃ dhammoti dīpeti, dhammaṃ adhammoti dīpeti, avinayaṃ vinayoti dīpeti, vinayaṃ avinayoti dīpeti, avinidhāya diṭṭhiṃ salākaggāhena – imehi kho, upāli, pañcahaṅgehi samannāgato saṅghabhedako na āpāyiko na nerayiko na kappaṭṭho na atekiccho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato saṅghabhedako na āpāyiko na nerayiko na kappaṭṭho na atekiccho. Katamehi pañcahi? Idhupāli, bhikkhu adhammaṃ dhammoti dīpeti, dhammaṃ adhammoti dīpeti, avinayaṃ vinayoti dīpeti, vinayaṃ avinayoti dīpeti, avinidhāya khantiṃ kammena…pe… avinidhāya khantiṃ uddesena…pe… avinidhāya khantiṃ voharanto…pe… avinidhāya khantiṃ anussāvanena…pe… avinidhāya khantiṃ salākaggāhena – imehi kho, upāli, pañcahaṅgehi samannāgato saṅghabhedako na āpāyiko na nerayiko na kappaṭṭho na atekiccho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi ",
      ", upāli, pañcahaṅgehi samannāgato saṅghabhedako na āpāyiko na nerayiko na kappaṭṭho na atekiccho. Katamehi pañcahi? Idhupāli, bhikkhu adhammaṃ dhammoti dīpeti, dhammaṃ adhammoti dīpeti, avinayaṃ ",
      " vinayoti dīpeti, vinayaṃ avinayoti dīpeti, avinidhāya ruciṃ kammena…pe… avinidhāya ruciṃ uddesena…pe… avinidhāya ruciṃ voharanto…pe… avinidhāya ruciṃ anussāvanena…pe… avinidhāya ruciṃ salākaggāhena – imehi kho, upāli, pañcahaṅgehi samannāgato saṅghabhedako na āpāyiko na nerayiko na kappaṭṭho na atekiccho."
    ],
    "innerText": "‘‘Aparehipi , upāli, pañcahaṅgehi samannāgato saṅghabhedako na āpāyiko na nerayiko na kappaṭṭho na atekiccho. Katamehi pañcahi? Idhupāli, bhikkhu adhammaṃ dhammoti dīpeti, dhammaṃ adhammoti dīpeti, avinayaṃ vinayoti dīpeti, vinayaṃ avinayoti dīpeti, avinidhāya ruciṃ kammena…pe… avinidhāya ruciṃ uddesena…pe… avinidhāya ruciṃ voharanto…pe… avinidhāya ruciṃ anussāvanena…pe… avinidhāya ruciṃ salākaggāhena – imehi kho, upāli, pañcahaṅgehi samannāgato saṅghabhedako na āpāyiko na nerayiko na kappaṭṭho na atekiccho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato saṅghabhedako na āpāyiko na nerayiko na kappaṭṭho na atekiccho. Katamehi pañcahi? Idhupāli, bhikkhu adhammaṃ dhammoti dīpeti, dhammaṃ adhammoti dīpeti, avinayaṃ vinayoti dīpeti, vinayaṃ avinayoti dīpeti, avinidhāya saññaṃ kammena…pe… avinidhāya saññaṃ uddesena…pe… avinidhāya saññaṃ voharanto…pe… avinidhāya saññaṃ anussāvanena…pe… avinidhāya saññaṃ salākaggāhena ",
      " – imehi kho, upāli, pañcahaṅgehi samannāgato saṅghabhedako na āpāyiko na nerayiko na kappaṭṭho na atekiccho’’ti."
    ],
    "innerText": "‘‘Aparehipi, upāli, pañcahaṅgehi samannāgato saṅghabhedako na āpāyiko na nerayiko na kappaṭṭho na atekiccho. Katamehi pañcahi? Idhupāli, bhikkhu adhammaṃ dhammoti dīpeti, dhammaṃ adhammoti dīpeti, avinayaṃ vinayoti dīpeti, vinayaṃ avinayoti dīpeti, avinidhāya saññaṃ kammena…pe… avinidhāya saññaṃ uddesena…pe… avinidhāya saññaṃ voharanto…pe… avinidhāya saññaṃ anussāvanena…pe… avinidhāya saññaṃ salākaggāhena – imehi kho, upāli, pañcahaṅgehi samannāgato saṅghabhedako na āpāyiko na nerayiko na kappaṭṭho na atekiccho’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dutiyasaṅghabhedakavaggo niṭṭhito dvādasamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Avinidhāya diṭṭhiṃ kammena, uddese voharena ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Anussāvane salākena, pañcete diṭṭhinissitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Khantiṃ ruciñca saññañca, tayo te pañcadhā nayā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Heṭṭhime kaṇhapakkhamhi, samavīsati vidhī yathā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tatheva sukkapakkhamhi, samavīsati jānathāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "13. Āvāsikavaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "461"
      },
      ". ‘‘Katihi ",
      " nu kho, bhante, aṅgehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ niraye’’ti? ‘‘Pañcahupāli, aṅgehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ niraye ",
      ". Katamehi pañcahi? Chandāgatiṃ gacchati, dosāgatiṃ ",
      " gacchati, mohāgatiṃ gacchati, bhayāgatiṃ gacchati, saṅghikaṃ puggalikaparibhogena paribhuñjati – imehi kho, upāli, pañcahaṅgehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ niraye."
    ],
    "innerText": "461. ‘‘Katihi nu kho, bhante, aṅgehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ niraye’’ti? ‘‘Pañcahupāli, aṅgehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ niraye . Katamehi pañcahi? Chandāgatiṃ gacchati, dosāgatiṃ gacchati, mohāgatiṃ gacchati, bhayāgatiṃ gacchati, saṅghikaṃ puggalikaparibhogena paribhuñjati – imehi kho, upāli, pañcahaṅgehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ niraye."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Pañcahupāli, aṅgehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ sagge. Katamehi pañcahi? Na chandāgatiṃ gacchati, na dosāgatiṃ gacchati, na mohāgatiṃ gacchati, na bhayāgatiṃ gacchati, saṅghikaṃ na puggalikaparibhogena paribhuñjati – imehi kho, upāli, pañcahaṅgehi samannāgato āvāsiko bhikkhu yathābhataṃ nikkhitto evaṃ sagge’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "462"
      },
      ". ‘‘Kati nu kho, bhante, adhammikā vinayabyākaraṇā’’ti? ‘‘Pañcime, upāli, adhammikā vinayabyākaraṇā. Katame pañca? Idhupāli, bhikkhu adhammaṃ dhammoti pariṇāmeti, dhammaṃ adhammoti pariṇāmeti, avinayaṃ vinayoti pariṇāmeti, vinayaṃ avinayoti pariṇāmeti ",
      ", apaññattaṃ paññāpeti, paññattaṃ samucchindati – ime kho, upāli, pañca adhammikā vinayabyākaraṇā. Pañcime, upāli, dhammikā vinayabyākaraṇā. Katame pañca? Idhupāli, bhikkhu adhammaṃ adhammoti pariṇāmeti, dhammaṃ dhammoti pariṇāmeti, avinayaṃ ",
      " avinayoti pariṇāmeti, vinayaṃ vinayoti pariṇāmeti, apaññattaṃ na paññapeti, paññattaṃ na samucchindati – ime kho, upāli, pañca dhammikā vinayabyākaraṇā’’ti."
    ],
    "innerText": "462. ‘‘Kati nu kho, bhante, adhammikā vinayabyākaraṇā’’ti? ‘‘Pañcime, upāli, adhammikā vinayabyākaraṇā. Katame pañca? Idhupāli, bhikkhu adhammaṃ dhammoti pariṇāmeti, dhammaṃ adhammoti pariṇāmeti, avinayaṃ vinayoti pariṇāmeti, vinayaṃ avinayoti pariṇāmeti , apaññattaṃ paññāpeti, paññattaṃ samucchindati – ime kho, upāli, pañca adhammikā vinayabyākaraṇā. Pañcime, upāli, dhammikā vinayabyākaraṇā. Katame pañca? Idhupāli, bhikkhu adhammaṃ adhammoti pariṇāmeti, dhammaṃ dhammoti pariṇāmeti, avinayaṃ avinayoti pariṇāmeti, vinayaṃ vinayoti pariṇāmeti, apaññattaṃ na paññapeti, paññattaṃ na samucchindati – ime kho, upāli, pañca dhammikā vinayabyākaraṇā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "463"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[a. ni. 5.272-285]"
      },
      " ‘‘Katihi nu kho, bhante, aṅgehi samannāgato bhattuddesako yathābhataṃ nikkhitto evaṃ niraye’’ti? ‘‘Pañcahupāli, aṅgehi samannāgato bhattuddesako yathābhataṃ nikkhitto evaṃ niraye. Katamehi pañcahi? Chandāgatiṃ gacchati, dosāgatiṃ gacchati, mohāgatiṃ gacchati, bhayāgatiṃ gacchati, uddiṭṭhānuddiṭṭhaṃ na jānāti – imehi kho, upāli, pañcahaṅgehi samannāgato bhattuddesako yathābhataṃ nikkhitto evaṃ niraye."
    ],
    "innerText": "463.[a. ni. 5.272-285] ‘‘Katihi nu kho, bhante, aṅgehi samannāgato bhattuddesako yathābhataṃ nikkhitto evaṃ niraye’’ti? ‘‘Pañcahupāli, aṅgehi samannāgato bhattuddesako yathābhataṃ nikkhitto evaṃ niraye. Katamehi pañcahi? Chandāgatiṃ gacchati, dosāgatiṃ gacchati, mohāgatiṃ gacchati, bhayāgatiṃ gacchati, uddiṭṭhānuddiṭṭhaṃ na jānāti – imehi kho, upāli, pañcahaṅgehi samannāgato bhattuddesako yathābhataṃ nikkhitto evaṃ niraye."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "note"
        },
        "innerText": "[a. ni. 5.272-285]"
      },
      " ‘‘Pañcahupāli, aṅgehi samannāgato bhattuddesako yathābhataṃ nikkhitto evaṃ sagge. Katamehi pañcahi? Na chandāgatiṃ gacchati, na dosāgatiṃ gacchati, na mohāgatiṃ gacchati, na bhayāgatiṃ gacchati, uddiṭṭhānuddiṭṭhaṃ ",
      " jānāti – imehi kho, upāli, pañcahaṅgehi samannāgato bhattuddesako yathābhataṃ nikkhitto evaṃ sagge’’ti."
    ],
    "innerText": "[a. ni. 5.272-285] ‘‘Pañcahupāli, aṅgehi samannāgato bhattuddesako yathābhataṃ nikkhitto evaṃ sagge. Katamehi pañcahi? Na chandāgatiṃ gacchati, na dosāgatiṃ gacchati, na mohāgatiṃ gacchati, na bhayāgatiṃ gacchati, uddiṭṭhānuddiṭṭhaṃ jānāti – imehi kho, upāli, pañcahaṅgehi samannāgato bhattuddesako yathābhataṃ nikkhitto evaṃ sagge’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "464"
      },
      ". ‘‘Katihi nu kho, bhante, aṅgehi samannāgato senāsanapaññāpako…pe… bhaṇḍāgāriko…pe… cīvarapaṭiggāhako…pe… cīvarabhājako…pe… yāgubhājako…pe… phalabhājako…pe… khajjabhājako…pe… appamattakavissajjako…pe… sāṭiyaggāhāpako…pe… pattaggāhāpako…pe… ārāmikapesako…pe… sāmaṇerapesako yathābhataṃ nikkhitto evaṃ niraye’’ti? ‘‘Pañcahupāli, aṅgehi samannāgato sāmaṇerapesako yathābhataṃ nikkhitto evaṃ niraye. Katamehi pañcahi? Chandāgatiṃ ",
      " gacchati, dosāgatiṃ gacchati, mohāgatiṃ gacchati, bhayāgatiṃ gacchati, pesitāpesitaṃ na jānāti – imehi kho, upāli, pañcahaṅgehi samannāgato sāmaṇerapesako yathābhataṃ nikkhitto evaṃ niraye. Pañcahupāli, aṅgehi samannāgato sāmaṇerapesako yathābhataṃ nikkhitto evaṃ sagge. Katamehi pañcahi? Na chandāgatiṃ gacchati, na dosāgatiṃ gacchati, na mohāgatiṃ gacchati, na bhayāgatiṃ gacchati, pesitāpesitaṃ jānāti – imehi kho, upāli, pañcahaṅgehi samannāgato sāmaṇerapesako yathābhataṃ nikkhitto evaṃ sagge’’ti."
    ],
    "innerText": "464. ‘‘Katihi nu kho, bhante, aṅgehi samannāgato senāsanapaññāpako…pe… bhaṇḍāgāriko…pe… cīvarapaṭiggāhako…pe… cīvarabhājako…pe… yāgubhājako…pe… phalabhājako…pe… khajjabhājako…pe… appamattakavissajjako…pe… sāṭiyaggāhāpako…pe… pattaggāhāpako…pe… ārāmikapesako…pe… sāmaṇerapesako yathābhataṃ nikkhitto evaṃ niraye’’ti? ‘‘Pañcahupāli, aṅgehi samannāgato sāmaṇerapesako yathābhataṃ nikkhitto evaṃ niraye. Katamehi pañcahi? Chandāgatiṃ gacchati, dosāgatiṃ gacchati, mohāgatiṃ gacchati, bhayāgatiṃ gacchati, pesitāpesitaṃ na jānāti – imehi kho, upāli, pañcahaṅgehi samannāgato sāmaṇerapesako yathābhataṃ nikkhitto evaṃ niraye. Pañcahupāli, aṅgehi samannāgato sāmaṇerapesako yathābhataṃ nikkhitto evaṃ sagge. Katamehi pañcahi? Na chandāgatiṃ gacchati, na dosāgatiṃ gacchati, na mohāgatiṃ gacchati, na bhayāgatiṃ gacchati, pesitāpesitaṃ jānāti – imehi kho, upāli, pañcahaṅgehi samannāgato sāmaṇerapesako yathābhataṃ nikkhitto evaṃ sagge’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Āvāsikavaggo niṭṭhito terasamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Āvāsikabyākaraṇā ",
      ", bhattusenāsanāni ca;"
    ],
    "innerText": "Āvāsikabyākaraṇā , bhattusenāsanāni ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Bhaṇḍacīvaraggāho ca, cīvarassa ca bhājako."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Yāgu phalaṃ khajjakañca, appasāṭiyagāhako;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Patto ārāmiko ceva, sāmaṇerena pesakoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "14. Kathinatthāravaggo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "465"
      },
      ". ‘‘Kati nu kho, bhante, ānisaṃsā kathinatthāre’’ti? ‘‘Pañcime, upāli, ānisaṃsā kathinatthāre. Katame pañca? Anāmantacāro, asamādānacāro, gaṇabhojanaṃ, yāvadatthacīvaraṃ, yo ca tattha cīvaruppādo ",
      " so nesaṃ bhavissati – ime kho, upāli, pañca ānisaṃsā kathinatthāre’’ti."
    ],
    "innerText": "465. ‘‘Kati nu kho, bhante, ānisaṃsā kathinatthāre’’ti? ‘‘Pañcime, upāli, ānisaṃsā kathinatthāre. Katame pañca? Anāmantacāro, asamādānacāro, gaṇabhojanaṃ, yāvadatthacīvaraṃ, yo ca tattha cīvaruppādo so nesaṃ bhavissati – ime kho, upāli, pañca ānisaṃsā kathinatthāre’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "466"
      },
      ". ‘‘Kati nu kho, bhante, ādīnavā muṭṭhassatissa asampajānassa niddaṃ ",
      " okkamato’’ti? ‘‘Pañcime, upāli, ādīnavā muṭṭhassatissa asampajānassa niddaṃ okkamato. Katame pañca? Dukkhaṃ supati, dukkhaṃ paṭibujjhati, pāpakaṃ supinaṃ passati, devatā na rakkhanti, asuci muccati – ime kho, upāli, pañca ādīnavā muṭṭhassatissa asampajānassa niddaṃ okkamato. Pañcime, upāli, ānisaṃsā upaṭṭhitassatissa sampajānassa niddaṃ okkamato. Katame pañca? Sukhaṃ supati, sukhaṃ paṭibujjhati, na pāpakaṃ supinaṃ passati, devatā rakkhanti, asuci na muccati – ime kho, upāli, pañca ānisaṃsā upaṭṭhitassatissa sampajānassa niddaṃ okkamato’’ti."
    ],
    "innerText": "466. ‘‘Kati nu kho, bhante, ādīnavā muṭṭhassatissa asampajānassa niddaṃ okkamato’’ti? ‘‘Pañcime, upāli, ādīnavā muṭṭhassatissa asampajānassa niddaṃ okkamato. Katame pañca? Dukkhaṃ supati, dukkhaṃ paṭibujjhati, pāpakaṃ supinaṃ passati, devatā na rakkhanti, asuci muccati – ime kho, upāli, pañca ādīnavā muṭṭhassatissa asampajānassa niddaṃ okkamato. Pañcime, upāli, ānisaṃsā upaṭṭhitassatissa sampajānassa niddaṃ okkamato. Katame pañca? Sukhaṃ supati, sukhaṃ paṭibujjhati, na pāpakaṃ supinaṃ passati, devatā rakkhanti, asuci na muccati – ime kho, upāli, pañca ānisaṃsā upaṭṭhitassatissa sampajānassa niddaṃ okkamato’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "467"
      },
      ". ‘‘Kati nu kho, bhante, avandiyā’’ti? ‘‘Pañcime, upāli, avandiyā. Katame pañca? Antaragharaṃ paviṭṭho avandiyo, racchagato avandiyo, otamasiko avandiyo, asamannāharanto avandiyo, sutto avandiyo – ime kho, upāli, pañca avandiyā."
    ],
    "innerText": "467. ‘‘Kati nu kho, bhante, avandiyā’’ti? ‘‘Pañcime, upāli, avandiyā. Katame pañca? Antaragharaṃ paviṭṭho avandiyo, racchagato avandiyo, otamasiko avandiyo, asamannāharanto avandiyo, sutto avandiyo – ime kho, upāli, pañca avandiyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Aparepi, upāli, pañca avandiyā. Katame pañca? Yāgupāne avandiyo, bhattagge avandiyo, ekāvatto avandiyo, aññavihito avandiyo, naggo avandiyo – ime kho, upāli, pañca avandiyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparepi ",
      ", upāli, pañca avandiyā. Katame pañca? Khādanto avandiyo, bhuñjanto avandiyo, uccāraṃ karonto avandiyo, passāvaṃ karonto avandiyo, ukkhittako avandiyo – ime kho, upāli, pañca avandiyā."
    ],
    "innerText": "‘‘Aparepi , upāli, pañca avandiyā. Katame pañca? Khādanto avandiyo, bhuñjanto avandiyo, uccāraṃ karonto avandiyo, passāvaṃ karonto avandiyo, ukkhittako avandiyo – ime kho, upāli, pañca avandiyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Aparepi, upāli, pañca avandiyā ",
      ". Katame pañca? Pure upasampannena pacchā upasampanno avandiyo, anupasampanno avandiyo, nānāsaṃvāsako vuḍḍhataro adhammavādī avandiyo, mātugāmo avandiyo, paṇḍako avandiyo – ime kho, upāli, pañca avandiyā."
    ],
    "innerText": "‘‘Aparepi, upāli, pañca avandiyā . Katame pañca? Pure upasampannena pacchā upasampanno avandiyo, anupasampanno avandiyo, nānāsaṃvāsako vuḍḍhataro adhammavādī avandiyo, mātugāmo avandiyo, paṇḍako avandiyo – ime kho, upāli, pañca avandiyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Aparepi, upāli, pañca avandiyā. Katame pañca? Pārivāsiko avandiyo, mūlāyapaṭikassanāraho avandiyo, mānattāraho avandiyo, mānattacāriko avandiyo, abbhānāraho avandiyo – ime kho, upāli, pañca avandiyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "468"
      },
      ". ‘‘Kati ",
      " nu kho, bhante, vandiyā’’ti? ‘‘Pañcime, upāli, vandiyā. Katame pañca? Pacchā upasampannena pure upasampanno vandiyo, nānāsaṃvāsako vuḍḍhataro dhammavādī vandiyo, ācariyo vandiyo, upajjhāyo vandiyo, sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya tathāgato arahaṃ sammāsambuddho vandiyo – ime kho, upāli, pañca vandiyā’’ti."
    ],
    "innerText": "468. ‘‘Kati nu kho, bhante, vandiyā’’ti? ‘‘Pañcime, upāli, vandiyā. Katame pañca? Pacchā upasampannena pure upasampanno vandiyo, nānāsaṃvāsako vuḍḍhataro dhammavādī vandiyo, ācariyo vandiyo, upajjhāyo vandiyo, sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya tathāgato arahaṃ sammāsambuddho vandiyo – ime kho, upāli, pañca vandiyā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "469"
      },
      ". ‘‘Navakatarena, bhante, bhikkhunā vuḍḍhatarassa bhikkhuno pāde vandantena kati dhamme ajjhattaṃ upaṭṭhāpetvā pādā vanditabbā’’ti? ‘‘Navakatarenupāli, bhikkhunā vuḍḍhatarassa bhikkhuno pāde vandantena pañca dhamme ajjhattaṃ upaṭṭhāpetvā pādā vanditabbā. Katame pañca? Navakatarenupāli, bhikkhunā vuḍḍhatarassa bhikkhuno pāde vandantena ekaṃsaṃ uttarāsaṅgaṃ karitvā, añjaliṃ paggahetvā ",
      ", ubhohi pāṇitalehi pādāni parisambāhantena, pemañca gāravañca upaṭṭhāpetvā pādā vanditabbā – navakatarenupāli bhikkhunā vuḍḍhatarassa bhikkhuno pāde vandantena ime pañca dhamme ajjhattaṃ upaṭṭhāpetvā pādā vanditabbā’’ti."
    ],
    "innerText": "469. ‘‘Navakatarena, bhante, bhikkhunā vuḍḍhatarassa bhikkhuno pāde vandantena kati dhamme ajjhattaṃ upaṭṭhāpetvā pādā vanditabbā’’ti? ‘‘Navakatarenupāli, bhikkhunā vuḍḍhatarassa bhikkhuno pāde vandantena pañca dhamme ajjhattaṃ upaṭṭhāpetvā pādā vanditabbā. Katame pañca? Navakatarenupāli, bhikkhunā vuḍḍhatarassa bhikkhuno pāde vandantena ekaṃsaṃ uttarāsaṅgaṃ karitvā, añjaliṃ paggahetvā , ubhohi pāṇitalehi pādāni parisambāhantena, pemañca gāravañca upaṭṭhāpetvā pādā vanditabbā – navakatarenupāli bhikkhunā vuḍḍhatarassa bhikkhuno pāde vandantena ime pañca dhamme ajjhattaṃ upaṭṭhāpetvā pādā vanditabbā’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Kathinatthāravaggo niṭṭhito cuddasamo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tassuddānaṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Kathinatthāraniddā ",
      " ca, antarā yāgukhādane;"
    ],
    "innerText": "Kathinatthāraniddā ca, antarā yāgukhādane;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pure ca pārivāsi ca, vandiyo vanditabbakanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Upālipañcakaṃ niṭṭhitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tesaṃ vaggānaṃ uddānaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Anissitena kammañca, vohārāvikammena ca;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Codanā ca dhutaṅgā ca, musā bhikkhunimeva ca."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Ubbāhikādhikaraṇaṃ, bhedakā pañcamā pure;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Āvāsikā kathinañca, cuddasā suppakāsitāti."
  }
]