[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Namo tassa bhagavato arahato sammāsambuddhassa"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "nikaya"
    },
    "innerText": "Vinayapiṭake"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "book"
    },
    "innerText": "Vimativinodanī-ṭīkā (paṭhamo bhāgo)"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subsubhead"
    },
    "innerText": "Ganthārambhakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Karuṇāpuṇṇahadayaṃ ",
      ", ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sugataṃ"
      },
      " hitadāyakaṃ;"
    ],
    "innerText": "Karuṇāpuṇṇahadayaṃ , sugataṃ hitadāyakaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "children": [
      "Natvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammañca"
      },
      " vimalaṃ, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṅghañca"
      },
      " guṇasampadaṃ."
    ],
    "innerText": "Natvā dhammañca vimalaṃ, saṅghañca guṇasampadaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Vaṇṇanā nipuṇāhesuṃ, vinayaṭṭhakathāya yā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pubbakehi katā nekā, nānānayasamākulā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "Tattha ",
      " kāci suvitthiṇṇā, dukkhogāhā ca ganthato;"
    ],
    "innerText": "Tattha kāci suvitthiṇṇā, dukkhogāhā ca ganthato;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Viraddhā atthato cāpi, saddato cāpi katthaci."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Kāci katthaci apuṇṇā, kāci sammohakārinī;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tasmā tāhi samādāya, sāraṃ saṅkheparūpato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Līnatthañca pakāsento, viraddhañca visodhayaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Upaṭṭhitanayañcāpi, tattha tattha pakāsayaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Vinaye vimatiṃ chetuṃ, bhikkhūnaṃ lahuvuttinaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Saṅkhepena likhissāmi, tassā līnatthavaṇṇanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Ganthārambhakathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vinayasaṃvaṇṇanārambhe ratanattayaṃ namassitukāmo tassa visiṭṭhaguṇayogasandassanatthaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yo kappakoṭīhipī"
      },
      "tiādimāha. Visiṭṭhaguṇayogena hi vandanārahabhāvo, vandanārahe ca katā vandanā yathādhippetamatthaṃ sādheti ",
      ". Ettha ca saṃvaṇṇanārambhe ratanattayapaṇāmakaraṇappayojanaṃ tattha tattha bahudhā papañcenti ācariyā, mayaṃ pana idhādhippetameva payojanaṃ dassayissāma. Tasmā saṃvaṇṇanārambhe ratanattayapaṇāmakaraṇaṃ yathāpaṭiññātasaṃvaṇṇanāya anantarāyena parisamāpanatthanti veditabbaṃ. Tathā hi vuttaṃ ‘‘tassānubhāvena hatantarāyo’’ti. Ratanattayapaṇāmakaraṇena hi rāgādidosavigamato paññādiguṇapāṭavato āyuādivaḍḍhanato puññātisayabhāvādito ca hoteva yathāpaṭiññātasaṃvaṇṇanāya anantarāyena parisamāpanaṃ."
    ],
    "innerText": "Vinayasaṃvaṇṇanārambhe ratanattayaṃ namassitukāmo tassa visiṭṭhaguṇayogasandassanatthaṃ yo kappakoṭīhipītiādimāha. Visiṭṭhaguṇayogena hi vandanārahabhāvo, vandanārahe ca katā vandanā yathādhippetamatthaṃ sādheti . Ettha ca saṃvaṇṇanārambhe ratanattayapaṇāmakaraṇappayojanaṃ tattha tattha bahudhā papañcenti ācariyā, mayaṃ pana idhādhippetameva payojanaṃ dassayissāma. Tasmā saṃvaṇṇanārambhe ratanattayapaṇāmakaraṇaṃ yathāpaṭiññātasaṃvaṇṇanāya anantarāyena parisamāpanatthanti veditabbaṃ. Tathā hi vuttaṃ ‘‘tassānubhāvena hatantarāyo’’ti. Ratanattayapaṇāmakaraṇena hi rāgādidosavigamato paññādiguṇapāṭavato āyuādivaḍḍhanato puññātisayabhāvādito ca hoteva yathāpaṭiññātasaṃvaṇṇanāya anantarāyena parisamāpanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha paṭhamaṃ tāva bhagavato vandanaṃ kattukāmo ‘‘yo kappakoṭīhipi…pe… tassā’’ti āha. Imissā pana vinayadesanāya karuṇāppadhānañāṇasamuṭṭhitatāya karuṇāppadhānameva thomanaṃ āraddhaṃ. Esā hi ācariyassa pakati, yadidaṃ ārambhānurūpathomanā. Karuṇāggahaṇena cettha aparimeyyappabhāvā sabbepi buddhaguṇā nayato saṅgahitāti daṭṭhabbā taṃmūlakattā sesabuddhaguṇānaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yo"
      },
      "ti imassa aniyamavacanassa nāthoti iminā sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kappakoṭīhipi appameyyaṃ kāla"
      },
      "nti ",
      " kappakoṭigaṇanāvasenapi ‘‘ettakā kappakoṭiyo’’ti pametuṃ asakkuṇeyyaṃ kālaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Api"
      },
      "-saddena pageva vassagaṇanāyāti dasseti. Appameyyaṃ kālanti ca accantasaṃyoge upayogavacanaṃ, tena kappakoṭigaṇanāvasena paricchinditumasakkuṇeyyamapi, asaṅkhyeyyavasena pana paricchinditabbato salakkhaṃ caturasaṅkhyeyyakappakālaṃ accantameva nirantaraṃ pañcamahāpaaccāgādi",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atidukkarāni karonto khedaṃ"
      },
      " kāyikaṃ parissamaṃ pattoti dasseti."
    ],
    "innerText": "Tattha paṭhamaṃ tāva bhagavato vandanaṃ kattukāmo ‘‘yo kappakoṭīhipi…pe… tassā’’ti āha. Imissā pana vinayadesanāya karuṇāppadhānañāṇasamuṭṭhitatāya karuṇāppadhānameva thomanaṃ āraddhaṃ. Esā hi ācariyassa pakati, yadidaṃ ārambhānurūpathomanā. Karuṇāggahaṇena cettha aparimeyyappabhāvā sabbepi buddhaguṇā nayato saṅgahitāti daṭṭhabbā taṃmūlakattā sesabuddhaguṇānaṃ. Tattha yoti imassa aniyamavacanassa nāthoti iminā sambandho. Kappakoṭīhipi appameyyaṃ kālanti kappakoṭigaṇanāvasenapi ‘‘ettakā kappakoṭiyo’’ti pametuṃ asakkuṇeyyaṃ kālaṃ. Api-saddena pageva vassagaṇanāyāti dasseti. Appameyyaṃ kālanti ca accantasaṃyoge upayogavacanaṃ, tena kappakoṭigaṇanāvasena paricchinditumasakkuṇeyyamapi, asaṅkhyeyyavasena pana paricchinditabbato salakkhaṃ caturasaṅkhyeyyakappakālaṃ accantameva nirantaraṃ pañcamahāpaaccāgādiatidukkarāni karonto khedaṃ kāyikaṃ parissamaṃ pattoti dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lokahitāyā"
      },
      "ti sattalokassa hitāya. Nāthatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nātho,"
      },
      " veneyyānaṃ hitasukhaṃ āsīsatīti attho. Atha vā nāthati veneyyagate kilese upatāpeti, nāthati vā yācati veneyye attano hitakaraṇe yācitvāpi niyojetīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nātho,"
      },
      " lokapaṭisaraṇo lokasāmī lokanāyakoti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahākāruṇikassā"
      },
      "ti yo karuṇāya kampitahadayattā lokahitatthaṃ atidukkarakiriyāya anekappakāraṃ tādisaṃ dukkhaṃ anubhavitvā āgato, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tassa mahākāruṇikassā"
      },
      "ti attho. Tattha kiratīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "karuṇā,"
      },
      " paradukkhaṃ vikkhipati apanetīti attho. Dukkhitesu vā kiriyati pasāriyatīti karuṇā. Atha vā kiṇātīti karuṇā, paradukkhe sati kāruṇikaṃ ",
      " hiṃsati vibādheti, vināseti vā parassa dukkhanti attho. Paradukkhe sati sādhūnaṃ kampanaṃ hadayakhedaṃ karotīti vā karuṇā. Atha vā kamiti sukhaṃ, taṃ rundhatīti karuṇā. Esā hi paradukkhāpanayanakāmatālakkhaṇā attasukhanirapekkhatāya kāruṇikānaṃ sukhaṃ rundhati vibādheti. Karuṇāya niyutto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāruṇiko,"
      },
      " mahanto kāruṇiko ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mahākāruṇiko, tassa namo"
      },
      " atthūti pāṭhaseso."
    ],
    "innerText": "Lokahitāyāti sattalokassa hitāya. Nāthatīti nātho, veneyyānaṃ hitasukhaṃ āsīsatīti attho. Atha vā nāthati veneyyagate kilese upatāpeti, nāthati vā yācati veneyye attano hitakaraṇe yācitvāpi niyojetīti nātho, lokapaṭisaraṇo lokasāmī lokanāyakoti vuttaṃ hoti. Mahākāruṇikassāti yo karuṇāya kampitahadayattā lokahitatthaṃ atidukkarakiriyāya anekappakāraṃ tādisaṃ dukkhaṃ anubhavitvā āgato, tassa mahākāruṇikassāti attho. Tattha kiratīti karuṇā, paradukkhaṃ vikkhipati apanetīti attho. Dukkhitesu vā kiriyati pasāriyatīti karuṇā. Atha vā kiṇātīti karuṇā, paradukkhe sati kāruṇikaṃ hiṃsati vibādheti, vināseti vā parassa dukkhanti attho. Paradukkhe sati sādhūnaṃ kampanaṃ hadayakhedaṃ karotīti vā karuṇā. Atha vā kamiti sukhaṃ, taṃ rundhatīti karuṇā. Esā hi paradukkhāpanayanakāmatālakkhaṇā attasukhanirapekkhatāya kāruṇikānaṃ sukhaṃ rundhati vibādheti. Karuṇāya niyutto kāruṇiko, mahanto kāruṇiko mahākāruṇiko, tassa namo atthūti pāṭhaseso."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ karuṇāmukhena saṅkhepato sakalasabbaññuguṇehi bhagavantaṃ thometvā idāni saddhammaṃ thometuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asambudha"
      },
      "ntiādimāha. Tattha buddhanisevitaṃ yaṃ asambudhaṃ jīvaloko bhavā bhavaṃ gacchati, tassa dhammavarassa namoti sambandho. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asambudha"
      },
      "nti asambujjhanto, yathāsabhāvaṃ appaṭivijjhanatoti vuttaṃ hoti. Hetuattho hettha antapaccayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ya"
      },
      "nti aniyamato sapariyattiko navalokuttaradhammo kammabhāvena niddiṭṭho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Buddhanisevita"
      },
      "nti tasseva visesanaṃ, sammāsambuddhena, paccekabuddhasāvakabuddhehipi vā gocarāsevanabhāvanāsevanāhi yathārahaṃ nisevitaṃ, ajahitanti attho. Tattha pariyattiphalanibbānāni gocarāsevanavaseneva nisevitāni, maggo pana bhāvanāsevanavasenāpi paccavekkhaṇañāṇādivasena gocarāsevanavasenāpi nisevito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhavābhava"
      },
      "nti bhavato bhavaṃ. Atha vā hīnapaṇītādivasena khuddakaṃ mahantañca bhavanti attho. Vuḍḍhatthopi hi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "a"
      },
      "-kāro dissati asekkhā dhammātiādīsu (dha. sa. tikamātikā 11) viya. Atha vā bhavoti vuḍḍhi, abhavoti hāni. Bhavoti vā sassatadiṭṭhi, abhavoti ucchedadiṭṭhi ",
      ". Vuttappakāro bhavo ca abhavo ca bhavābhavo, taṃ bhavābhavaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gacchatī"
      },
      "ti upagacchati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jīvaloko"
      },
      "ti sattaloko. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avijjādikilesajālaviddhaṃsino"
      },
      "ti dhammavisesanaṃ. Tattha na vidati dhammānaṃ yathāsabhāvaṃ na vijānātīti avijjā, aññāṇaṃ. Sā ādi yesaṃ taṇhādīnaṃ, teyeva kilissanti etehi sattāti kilesā, teyeva ca sattānaṃ vibādhanaṭṭhena jālasadisāti jālaṃ, taṃ viddhaṃseti sabbaso vināseti sīlenāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avijjādikilesajālaviddhaṃsī,"
      },
      " tassa."
    ],
    "innerText": "Evaṃ karuṇāmukhena saṅkhepato sakalasabbaññuguṇehi bhagavantaṃ thometvā idāni saddhammaṃ thometuṃ asambudhantiādimāha. Tattha buddhanisevitaṃ yaṃ asambudhaṃ jīvaloko bhavā bhavaṃ gacchati, tassa dhammavarassa namoti sambandho. Tattha asambudhanti asambujjhanto, yathāsabhāvaṃ appaṭivijjhanatoti vuttaṃ hoti. Hetuattho hettha antapaccayo. Yanti aniyamato sapariyattiko navalokuttaradhammo kammabhāvena niddiṭṭho. Buddhanisevitanti tasseva visesanaṃ, sammāsambuddhena, paccekabuddhasāvakabuddhehipi vā gocarāsevanabhāvanāsevanāhi yathārahaṃ nisevitaṃ, ajahitanti attho. Tattha pariyattiphalanibbānāni gocarāsevanavaseneva nisevitāni, maggo pana bhāvanāsevanavasenāpi paccavekkhaṇañāṇādivasena gocarāsevanavasenāpi nisevito. Bhavābhavanti bhavato bhavaṃ. Atha vā hīnapaṇītādivasena khuddakaṃ mahantañca bhavanti attho. Vuḍḍhatthopi hi a-kāro dissati asekkhā dhammātiādīsu (dha. sa. tikamātikā 11) viya. Atha vā bhavoti vuḍḍhi, abhavoti hāni. Bhavoti vā sassatadiṭṭhi, abhavoti ucchedadiṭṭhi . Vuttappakāro bhavo ca abhavo ca bhavābhavo, taṃ bhavābhavaṃ. Gacchatīti upagacchati. Jīvalokoti sattaloko. Avijjādikilesajālaviddhaṃsinoti dhammavisesanaṃ. Tattha na vidati dhammānaṃ yathāsabhāvaṃ na vijānātīti avijjā, aññāṇaṃ. Sā ādi yesaṃ taṇhādīnaṃ, teyeva kilissanti etehi sattāti kilesā, teyeva ca sattānaṃ vibādhanaṭṭhena jālasadisāti jālaṃ, taṃ viddhaṃseti sabbaso vināseti sīlenāti avijjādikilesajālaviddhaṃsī, tassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nanu cettha sapariyattiko navalokuttaradhammo adhippeto, tattha ca maggoyeva kilese viddhaṃseti, netareti ce? Vuccate – maggassāpi nibbānamāgamma ",
      " kilesaviddhaṃsanato nibbānampi kilese viddhaṃseti nāma, maggassa kilesaviddhaṃsanakiccaṃ phalena niṭṭhitanti phalampi ‘‘kilesaviddhaṃsī’’ti vuccati, pariyattidhammopi kilesaviddhaṃsanassa upanissayapaccayattā ‘‘kilesaviddhaṃsī’’ti vattuṃ arahatīti na koci doso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammavarassa tassā"
      },
      "ti pubbe aniyamitassa niyāmakavacanaṃ. Tattha yathānusiṭṭhaṃ paṭipajjamāne catūsu apāyesu saṃsāradukkhe ca apatamāne dhāretīti dhammo. Vuttappakāro dhammo eva attano uttaritarābhāvena varo pavaro anuttaroti dhammavaro, tassa dhammavarassa namo atthūti attho."
    ],
    "innerText": "Nanu cettha sapariyattiko navalokuttaradhammo adhippeto, tattha ca maggoyeva kilese viddhaṃseti, netareti ce? Vuccate – maggassāpi nibbānamāgamma kilesaviddhaṃsanato nibbānampi kilese viddhaṃseti nāma, maggassa kilesaviddhaṃsanakiccaṃ phalena niṭṭhitanti phalampi ‘‘kilesaviddhaṃsī’’ti vuccati, pariyattidhammopi kilesaviddhaṃsanassa upanissayapaccayattā ‘‘kilesaviddhaṃsī’’ti vattuṃ arahatīti na koci doso. Dhammavarassa tassāti pubbe aniyamitassa niyāmakavacanaṃ. Tattha yathānusiṭṭhaṃ paṭipajjamāne catūsu apāyesu saṃsāradukkhe ca apatamāne dhāretīti dhammo. Vuttappakāro dhammo eva attano uttaritarābhāvena varo pavaro anuttaroti dhammavaro, tassa dhammavarassa namo atthūti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ saṅkhepanayeneva sabbadhammaguṇehi saddhammaṃ thometvā idāni ariyasaṅghaṃ thometuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "guṇehī"
      },
      "tiādimāha. Tattha guṇehi yo yutto, tamariyasaṅghaṃ namāmīti sambandho. Sīlādayo guṇā cettha lokiyalokuttarā adhippetā. ‘‘Vimuttivimuttiñāṇa’’nti vattabbe ekadesasarūpekasesanayena ‘‘vimuttiñāṇa’’nti vuttaṃ, ādisaddapariyāyena pabhutisaddena vā vimuttiggahaṇaṃ veditabbaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vimuttī"
      },
      "ti phalaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vimuttiñāṇa"
      },
      "nti paccavekkhaṇañāṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pabhuti"
      },
      "-saddena chaḷabhiññācatupaṭisambhidādayo guṇā saṅgahitāti daṭṭhabbā. Kusalatthikānaṃ janānaṃ puññātisayavuḍḍhiyā khettasadisattā khettanti āha ‘‘khettaṃ janānaṃ kusalatthikāna’’nti. Khittaṃ bījaṃ mahapphalabhāvakaraṇena tāyatīti hi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "khettaṃ. Ariyasaṅgha"
      },
      "nti ettha ārakattā kilesehi, anaye na iriyanato, aye ca iriyanato, sadevakena lokena ‘‘saraṇa’’nti araṇīyato upagantabbato, upagatānañca tadatthasiddhito ariyā, aṭṭha ariyapuggalā, ariyānaṃ saṅgho samūhoti ariyasaṅgho, taṃ ariyasaṅghaṃ."
    ],
    "innerText": "Evaṃ saṅkhepanayeneva sabbadhammaguṇehi saddhammaṃ thometvā idāni ariyasaṅghaṃ thometuṃ guṇehītiādimāha. Tattha guṇehi yo yutto, tamariyasaṅghaṃ namāmīti sambandho. Sīlādayo guṇā cettha lokiyalokuttarā adhippetā. ‘‘Vimuttivimuttiñāṇa’’nti vattabbe ekadesasarūpekasesanayena ‘‘vimuttiñāṇa’’nti vuttaṃ, ādisaddapariyāyena pabhutisaddena vā vimuttiggahaṇaṃ veditabbaṃ. Tattha vimuttīti phalaṃ. Vimuttiñāṇanti paccavekkhaṇañāṇaṃ. Pabhuti-saddena chaḷabhiññācatupaṭisambhidādayo guṇā saṅgahitāti daṭṭhabbā. Kusalatthikānaṃ janānaṃ puññātisayavuḍḍhiyā khettasadisattā khettanti āha ‘‘khettaṃ janānaṃ kusalatthikāna’’nti. Khittaṃ bījaṃ mahapphalabhāvakaraṇena tāyatīti hi khettaṃ. Ariyasaṅghanti ettha ārakattā kilesehi, anaye na iriyanato, aye ca iriyanato, sadevakena lokena ‘‘saraṇa’’nti araṇīyato upagantabbato, upagatānañca tadatthasiddhito ariyā, aṭṭha ariyapuggalā, ariyānaṃ saṅgho samūhoti ariyasaṅgho, taṃ ariyasaṅghaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni ratanattayapaṇāmajanitaṃ kusalābhisandaṃ yathādhippete payojane niyojetvā attanā saṃvaṇṇiyamānassa vinayassa sakalasāsanamūlabhāvadassanamukhena saṃvaṇṇanākaraṇassāpi sāsanamūlataṃ ",
      " dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "icceva"
      },
      "miccādigāthādvayamāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puññābhisanda"
      },
      "nti puññoghaṃ, puññappavāhaṃ puññarāsinti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tassānubhāvenā"
      },
      "ti tassa yathāvuttassa puññappavāhassa ānubhāvena balena hatantarāyo vinayaṃ vaṇṇayissanti sambandho."
    ],
    "innerText": "Idāni ratanattayapaṇāmajanitaṃ kusalābhisandaṃ yathādhippete payojane niyojetvā attanā saṃvaṇṇiyamānassa vinayassa sakalasāsanamūlabhāvadassanamukhena saṃvaṇṇanākaraṇassāpi sāsanamūlataṃ dassetuṃ iccevamiccādigāthādvayamāha. Puññābhisandanti puññoghaṃ, puññappavāhaṃ puññarāsinti attho. Tassānubhāvenāti tassa yathāvuttassa puññappavāhassa ānubhāvena balena hatantarāyo vinayaṃ vaṇṇayissanti sambandho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aṭṭhitassa susaṇṭhitassa bhagavato sāsanaṃ yasmiṃ ṭhite patiṭṭhitaṃ hotīti yojetabbaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yasmi"
      },
      "nti yasmiṃ vinayapiṭake. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ṭhite"
      },
      "ti pāḷito ca atthato ca anūnaṃ hutvā lajjīpuggalesu pavattanaṭṭhena ṭhite. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sāsana"
      },
      "nti ",
      " sikkhattayasaṅgahitaṃ sāsanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭhitassā"
      },
      "ti kāmasukhallikattakilamathānuyogasaṅkhāte antadvaye aṭṭhitassa, ‘‘parinibbutassapi bhagavato’’tipi vadanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Susaṇṭhitassā"
      },
      "ti antadvayavirahitāya majjhimāya paṭipadāya suṭṭhu ṭhitassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Amissa"
      },
      "nti bhāvanapuṃsakaniddeso, nikāyantaraladdhīhi asammissaṃ katvā anākulaṃ katvā vaṇṇayissanti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nissāya pubbācariyānubhāva"
      },
      "nti pubbācariyehi saṃvaṇṇitaṃ aṭṭhakathaṃ nissāya, na attano balenāti adhippāyo."
    ],
    "innerText": "Aṭṭhitassa susaṇṭhitassa bhagavato sāsanaṃ yasmiṃ ṭhite patiṭṭhitaṃ hotīti yojetabbaṃ. Tattha yasminti yasmiṃ vinayapiṭake. Ṭhiteti pāḷito ca atthato ca anūnaṃ hutvā lajjīpuggalesu pavattanaṭṭhena ṭhite. Sāsananti sikkhattayasaṅgahitaṃ sāsanaṃ. Aṭṭhitassāti kāmasukhallikattakilamathānuyogasaṅkhāte antadvaye aṭṭhitassa, ‘‘parinibbutassapi bhagavato’’tipi vadanti. Susaṇṭhitassāti antadvayavirahitāya majjhimāya paṭipadāya suṭṭhu ṭhitassa. Amissanti bhāvanapuṃsakaniddeso, nikāyantaraladdhīhi asammissaṃ katvā anākulaṃ katvā vaṇṇayissanti vuttaṃ hoti. Nissāya pubbācariyānubhāvanti pubbācariyehi saṃvaṇṇitaṃ aṭṭhakathaṃ nissāya, na attano balenāti adhippāyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha porāṇaṭṭhakathāsu vijjamānāsu puna vinayasaṃvaṇṇanā kiṃpayojanāti? Āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāmañcā"
      },
      "tiādi. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāma"
      },
      "nti ekantena, yathicchakaṃ vā, sabbasoti vuttaṃ hoti, tassa saṃvaṇṇitoyaṃ vinayoti iminā sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pubbācariyāsabhehī"
      },
      "ti mahākassapattherādayo pubbācariyā eva akampiyaṭṭhena uttamaṭṭhena ca āsabhā, tehi pubbācariyavarehīti vuttaṃ hoti. Kīdisā pana te pubbācariyāti? Āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ñāṇambū"
      },
      "tiādi. Aggamaggañāṇasaṅkhātena ambunā salilena niddhotāni nissesato āyatiṃ anuppattidhammatāpādanena dhotāni visodhitāni rāgādīni tīṇi malāni kāmāsavādayo ca cattāro āsavā yehi te ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ñāṇambuniddhotamalāsavā,"
      },
      " tehi khīṇāsavehīti attho. Khīṇāsavabhāvepi na ete sukkhavipassakāti āha ‘‘visuddhavijjāpaṭisambhidehī’’ti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vijjā"
      },
      "ti tisso vijjā, aṭṭha vijjā vā. Paṭisambhidāppattesupi mahākassapattherādīnaṃ uccinitvā gahitatāya tesaṃ saddhammasaṃvaṇṇane sāmatthiyaṃ sātisayanti dassento āha ‘‘saddhammasaṃvaṇṇanakovidehī’’ti."
    ],
    "innerText": "Atha porāṇaṭṭhakathāsu vijjamānāsu puna vinayasaṃvaṇṇanā kiṃpayojanāti? Āha kāmañcātiādi. Tattha kāmanti ekantena, yathicchakaṃ vā, sabbasoti vuttaṃ hoti, tassa saṃvaṇṇitoyaṃ vinayoti iminā sambandho. Pubbācariyāsabhehīti mahākassapattherādayo pubbācariyā eva akampiyaṭṭhena uttamaṭṭhena ca āsabhā, tehi pubbācariyavarehīti vuttaṃ hoti. Kīdisā pana te pubbācariyāti? Āha ñāṇambūtiādi. Aggamaggañāṇasaṅkhātena ambunā salilena niddhotāni nissesato āyatiṃ anuppattidhammatāpādanena dhotāni visodhitāni rāgādīni tīṇi malāni kāmāsavādayo ca cattāro āsavā yehi te ñāṇambuniddhotamalāsavā, tehi khīṇāsavehīti attho. Khīṇāsavabhāvepi na ete sukkhavipassakāti āha ‘‘visuddhavijjāpaṭisambhidehī’’ti. Tattha vijjāti tisso vijjā, aṭṭha vijjā vā. Paṭisambhidāppattesupi mahākassapattherādīnaṃ uccinitvā gahitatāya tesaṃ saddhammasaṃvaṇṇane sāmatthiyaṃ sātisayanti dassento āha ‘‘saddhammasaṃvaṇṇanakovidehī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kilesajātaṃ, parikkhārabāhullaṃ vā sallikhati tanuṃ karotīti sallekho, appicchatādiguṇasamūho, idha pana khīṇāsavādhikārattā parikkhārabāhullassa sallikhanavaseneva attho gahetabbo. Sallekhena nibbattaṃ sallekhiyaṃ, tasmiṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sallekhiye,"
      },
      " dhutaṅgapariharaṇādisallekhapaapattiyanti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nosulabhūpamehī"
      },
      "ti sallekhapaṭipattiyā ‘‘asukasadisā’’ti natthi sulabhā upamā etesanti nosulabhūpamā, tehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahāvihārassā"
      },
      "ti iminā nikāyantaraṃ paṭikkhipati ",
      ". Vihārasīsena hettha tattha nivāsīnañceva tehi samaladdhikānañca sabbesaṃ bhikkhūnaṃ gahaṇaṃ daṭṭhabbaṃ. Tasmā tesaṃ mahāvihāravāsīnaṃ diṭṭhisīlavisuddhiyā pabhavattena saññāṇabhūtattā ",
      " dhammasaṅgāhakā mahākassapattherādayo ‘‘mahāvihārassa dhajūpamā’’ti vuttā, tehi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ayaṃ vinayo saṃvaṇṇito"
      },
      " sammā anūnaṃ katvā vaṇṇito. Kathanti āha ‘‘cittehi nayehī’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vicittehi nayehi sambuddhavaranvayehi"
      },
      " sabbaññubuddhavaraṃ anugatehi, bhagavato adhippāyānugatehi nayehīti vuttaṃ hoti."
    ],
    "innerText": "Kilesajātaṃ, parikkhārabāhullaṃ vā sallikhati tanuṃ karotīti sallekho, appicchatādiguṇasamūho, idha pana khīṇāsavādhikārattā parikkhārabāhullassa sallikhanavaseneva attho gahetabbo. Sallekhena nibbattaṃ sallekhiyaṃ, tasmiṃ sallekhiye, dhutaṅgapariharaṇādisallekhapaapattiyanti vuttaṃ hoti. Nosulabhūpamehīti sallekhapaṭipattiyā ‘‘asukasadisā’’ti natthi sulabhā upamā etesanti nosulabhūpamā, tehi. Mahāvihārassāti iminā nikāyantaraṃ paṭikkhipati . Vihārasīsena hettha tattha nivāsīnañceva tehi samaladdhikānañca sabbesaṃ bhikkhūnaṃ gahaṇaṃ daṭṭhabbaṃ. Tasmā tesaṃ mahāvihāravāsīnaṃ diṭṭhisīlavisuddhiyā pabhavattena saññāṇabhūtattā dhammasaṅgāhakā mahākassapattherādayo ‘‘mahāvihārassa dhajūpamā’’ti vuttā, tehi ayaṃ vinayo saṃvaṇṇito sammā anūnaṃ katvā vaṇṇito. Kathanti āha ‘‘cittehi nayehī’’ti. Vicittehi nayehi sambuddhavaranvayehi sabbaññubuddhavaraṃ anugatehi, bhagavato adhippāyānugatehi nayehīti vuttaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ porāṇaṭṭhakathāya anūnabhāvaṃ dassetvā idāni attano saṃvaṇṇanāya payojanavisesaṃ ajjhesakañca dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṃvaṇṇanā"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṅkhatattā"
      },
      "ti racitattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na kañci atthaṃ abhisambhuṇātī"
      },
      "ti na kañci atthaṃ sādheti."
    ],
    "innerText": "Evaṃ porāṇaṭṭhakathāya anūnabhāvaṃ dassetvā idāni attano saṃvaṇṇanāya payojanavisesaṃ ajjhesakañca dassetuṃ saṃvaṇṇanātiādimāha. Tattha saṅkhatattāti racitattā. Na kañci atthaṃ abhisambhuṇātīti na kañci atthaṃ sādheti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṃvaṇṇanaṃ tañcā"
      },
      "tiādinā attano saṃvaṇṇanāya karaṇappakāraṃ dasseti. Tattha tañca idāni vuccamānaṃ saṃvaṇṇanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samārabhanto"
      },
      " sakalāyapi mahāaṭṭhakathāya idha gahetabbato mahāaṭṭhakathaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tassā"
      },
      " idāni vuccamānāya saṃvaṇṇanāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sarīraṃ katvā"
      },
      " mahāpaccariyaṃ yo vinicchayo vutto, tatheva kurundīnāmādīsu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vissutāsu aṭṭhakathāsu yo vinicchayo"
      },
      " vutto, tatopi vinicchayato yuttamatthaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "apariccajanto"
      },
      " antogadhattheravādaṃ katvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṃvaṇṇanaṃ"
      },
      " sammā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samārabhissa"
      },
      "nti padatthasambandho veditabbo. Ettha ca attho kathīyati etāyāti aṭṭhakathā ttha-kārassa ṭṭha-kāraṃ katvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahāpaccariya"
      },
      "nti mahāpaccarīnāmikaṃ. Ettha ca paccarīti uḷumpaṃ vuccati, tasmiṃ nisīditvā katattā tameva nāmaṃ jātaṃ. ‘‘Kurundīvallivihāro nāma atthi, tattha katattā ‘kurundī’ti nāmaṃ jāta’’nti vadanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ādi"
      },
      "saddena andhakaṭṭhakathaṃ saṅkhepaṭṭhakathañca saṅgaṇhāti."
    ],
    "innerText": "Saṃvaṇṇanaṃ tañcātiādinā attano saṃvaṇṇanāya karaṇappakāraṃ dasseti. Tattha tañca idāni vuccamānaṃ saṃvaṇṇanaṃ samārabhanto sakalāyapi mahāaṭṭhakathāya idha gahetabbato mahāaṭṭhakathaṃ tassā idāni vuccamānāya saṃvaṇṇanāya sarīraṃ katvā mahāpaccariyaṃ yo vinicchayo vutto, tatheva kurundīnāmādīsu vissutāsu aṭṭhakathāsu yo vinicchayo vutto, tatopi vinicchayato yuttamatthaṃ apariccajanto antogadhattheravādaṃ katvā saṃvaṇṇanaṃ sammā samārabhissanti padatthasambandho veditabbo. Ettha ca attho kathīyati etāyāti aṭṭhakathā ttha-kārassa ṭṭha-kāraṃ katvā. Mahāpaccariyanti mahāpaccarīnāmikaṃ. Ettha ca paccarīti uḷumpaṃ vuccati, tasmiṃ nisīditvā katattā tameva nāmaṃ jātaṃ. ‘‘Kurundīvallivihāro nāma atthi, tattha katattā ‘kurundī’ti nāmaṃ jāta’’nti vadanti. Ādisaddena andhakaṭṭhakathaṃ saṅkhepaṭṭhakathañca saṅgaṇhāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yuttamattha"
      },
      "nti mahāaṭṭhakathānayena, catubbidhavinayayuttiyā vā yuttamatthaṃ. ‘‘Aṭṭhakathaṃyeva gahetvā saṃvaṇṇanaṃ karissāmī’’ti vutte aṭṭhakathāsu vuttattheravādānaṃ bāhirabhāvo siyāti tepi antokattukāmo ‘‘antogadhatheravāda’’nti āha, theravādepi antokatvāti vuttaṃ hoti."
    ],
    "innerText": "Yuttamatthanti mahāaṭṭhakathānayena, catubbidhavinayayuttiyā vā yuttamatthaṃ. ‘‘Aṭṭhakathaṃyeva gahetvā saṃvaṇṇanaṃ karissāmī’’ti vutte aṭṭhakathāsu vuttattheravādānaṃ bāhirabhāvo siyāti tepi antokattukāmo ‘‘antogadhatheravāda’’nti āha, theravādepi antokatvāti vuttaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃ me"
      },
      "ti gāthāya sotūhi paṭipajjitabbavidhiṃ dasseti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammappadīpassā"
      },
      "ti dhammo eva mohandhakāraviddhaṃsanato padīpasadisattā padīpo assāti dhammappadīpo, bhagavā, tassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Patimānayantā"
      },
      "ti pūjentā manasā garuṃ karontā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nisāmentu"
      },
      " suṇantu."
    ],
    "innerText": "Taṃ meti gāthāya sotūhi paṭipajjitabbavidhiṃ dasseti. Tattha dhammappadīpassāti dhammo eva mohandhakāraviddhaṃsanato padīpasadisattā padīpo assāti dhammappadīpo, bhagavā, tassa. Patimānayantāti pūjentā manasā garuṃ karontā nisāmentu suṇantu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Buddhenā"
      },
      "tiādinā ",
      " attano saṃvaṇṇanāya āgamanasuddhidassanamukhena pamāṇabhāvaṃ dassetvā anusikkhitabbataṃ ",
      " dasseti. Tattha yatheva buddhena yo dhammo vinayo ca vutto, so tassa buddhassa yehi puttehi mahākassapattherādīhi tatheva ñāto, tesaṃ buddhaputtānaṃ matimaccajantā sīhaḷaṭṭhakathācariyā yasmā pure aṭṭhakathā akaṃsūti sambandho veditabbo. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammo"
      },
      "ti suttābhidhamme saṅgaṇhāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vinayo"
      },
      "ti sakalaṃ vinayapiṭakaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vutto"
      },
      "ti pāḷito ca atthato ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "buddhena"
      },
      " bhagavatā vutto. Na hi bhagavatā abyākataṃ nāma tantipadaṃ atthi, tattha tattha bhagavatā pavattitapakiṇṇakadesanāyeva hi aṭṭhakathā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatheva ñāto"
      },
      "ti yatheva buddhena vutto, tatheva ekapadampi ekakkharampi avināsetvā adhippāyañca avikopetvā ñāto viditoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tesaṃ matimaccajantā"
      },
      "ti tesaṃ buddhaputtānaṃ matisaṅkhātaṃ theraparamparāya uggahetvā ābhataṃ abbocchinnaṃ pāḷivaṇṇanāvasena ceva pāḷimuttakavasena ca pavattaṃ sabbaṃ aṭṭhakathāvinicchayaṃ apariccajantā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭhakathā akaṃsū"
      },
      "ti mahāaṭṭhakathāmahāpaccariādikā sīhaḷaṭṭhakathāyo akaṃsu. ‘‘Aṭṭhakathāmakaṃsū’’tipi pāṭho, tatthāpi soyevattho."
    ],
    "innerText": "Buddhenātiādinā attano saṃvaṇṇanāya āgamanasuddhidassanamukhena pamāṇabhāvaṃ dassetvā anusikkhitabbataṃ dasseti. Tattha yatheva buddhena yo dhammo vinayo ca vutto, so tassa buddhassa yehi puttehi mahākassapattherādīhi tatheva ñāto, tesaṃ buddhaputtānaṃ matimaccajantā sīhaḷaṭṭhakathācariyā yasmā pure aṭṭhakathā akaṃsūti sambandho veditabbo. Tattha dhammoti suttābhidhamme saṅgaṇhāti. Vinayoti sakalaṃ vinayapiṭakaṃ. Vuttoti pāḷito ca atthato ca buddhena bhagavatā vutto. Na hi bhagavatā abyākataṃ nāma tantipadaṃ atthi, tattha tattha bhagavatā pavattitapakiṇṇakadesanāyeva hi aṭṭhakathā. Tatheva ñātoti yatheva buddhena vutto, tatheva ekapadampi ekakkharampi avināsetvā adhippāyañca avikopetvā ñāto viditoti attho. Tesaṃ matimaccajantāti tesaṃ buddhaputtānaṃ matisaṅkhātaṃ theraparamparāya uggahetvā ābhataṃ abbocchinnaṃ pāḷivaṇṇanāvasena ceva pāḷimuttakavasena ca pavattaṃ sabbaṃ aṭṭhakathāvinicchayaṃ apariccajantā. Aṭṭhakathā akaṃsūti mahāaṭṭhakathāmahāpaccariādikā sīhaḷaṭṭhakathāyo akaṃsu. ‘‘Aṭṭhakathāmakaṃsū’’tipi pāṭho, tatthāpi soyevattho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tasmā"
      },
      "ti yasmā tesaṃ buddhaputtānaṃ adhippāyaṃ avikopetvā pure aṭṭhakathā akaṃsu, tasmā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yaṃ aṭṭhakathāsu vuttaṃ,"
      },
      " taṃ sabbampi pamāṇanti yojanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hī"
      },
      "ti nipātamattaṃ hetuatthassa tasmāti imināyeva pakāsitattā, avadhāraṇattho vā, pamāṇamevāti. Yadi aṭṭhakathāsu vuttaṃ sabbampi pamāṇaṃ, evaṃ sati tattha pamādalekhāpi pamāṇaṃ siyāti āha ‘‘vajjayitvāna pamādalekha’’nti, aparāparaṃ likhantehi pamādena satiṃ apaccupaṭṭhapetvā aññattha likhitabbaṃ aññattha likhanādivasena pavattitā pamādalekhā nāma, sā ca samantapāsādikāyaṃ tattha tattha sayameva āvibhavissati. Puna ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yasmā"
      },
      "ti padassa sambandhadassanavasena ayaṃ atthayojanā – yasmā aṭṭhakathāsu vuttaṃ idha imasmiṃ sāsane sikkhāsu sagāravānaṃ paṇḍitānaṃ pamāṇameva, yasmā ca ayaṃ vaṇṇanāpi bhāsantarapariccāgādimattavisiṭṭhatāya atthato abhinnā, tato eva pamāṇabhūtāva hessati, tasmā anusikkhitabbāti."
    ],
    "innerText": "Tasmāti yasmā tesaṃ buddhaputtānaṃ adhippāyaṃ avikopetvā pure aṭṭhakathā akaṃsu, tasmā. Yaṃ aṭṭhakathāsu vuttaṃ, taṃ sabbampi pamāṇanti yojanā. Hīti nipātamattaṃ hetuatthassa tasmāti imināyeva pakāsitattā, avadhāraṇattho vā, pamāṇamevāti. Yadi aṭṭhakathāsu vuttaṃ sabbampi pamāṇaṃ, evaṃ sati tattha pamādalekhāpi pamāṇaṃ siyāti āha ‘‘vajjayitvāna pamādalekha’’nti, aparāparaṃ likhantehi pamādena satiṃ apaccupaṭṭhapetvā aññattha likhitabbaṃ aññattha likhanādivasena pavattitā pamādalekhā nāma, sā ca samantapāsādikāyaṃ tattha tattha sayameva āvibhavissati. Puna yasmāti padassa sambandhadassanavasena ayaṃ atthayojanā – yasmā aṭṭhakathāsu vuttaṃ idha imasmiṃ sāsane sikkhāsu sagāravānaṃ paṇḍitānaṃ pamāṇameva, yasmā ca ayaṃ vaṇṇanāpi bhāsantarapariccāgādimattavisiṭṭhatāya atthato abhinnā, tato eva pamāṇabhūtāva hessati, tasmā anusikkhitabbāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tato"
      },
      "ti tāhi aṭṭhakathāhi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhāsantarameva hitvā"
      },
      "ti sīhaḷabhāsaṃyeva apanetvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vitthāramaggañca samāsayitvā"
      },
      "ti porāṇaṭṭhakathāsu yathāṭhāne ",
      " vattabbampi padatthavinicchayādikaṃ ativitthiṇṇena vacanakkamena ceva vuttameva atthanayaṃ appamattakavisesena punappunaṃ kathanena ca tattha tattha papañcitaṃ tādisaṃ vitthāramaggaṃ pahāya sallahukena atthaviññāpakena padakkamena ceva vuttanayasadisaṃ vattabbaṃ atidisitvā ca saṅkhepanayeneva vaṇṇayissāmāti adhippāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sāratthadīpaniyaṃ"
      },
      " pana vinayaṭīkāyaṃ ‘‘porāṇaṭṭhakathāsu upari vuccamānampi ānetvā tattha tattha papañcitaṃ ñatticatutthena kammena…pe… upasampannoti bhikkhūti ettha apalokanādīnaṃ catunnampi ",
      " kammānaṃ vitthārakathā viya tādisaṃ vitthāramaggaṃ saṅkhipitvā’’ti vuttaṃ, taṃ tantikkamaṃ kañci avokkamitvāti ettheva vattuṃ yuttaṃ. Aññattha pāḷiyā vattabbaṃ aññattha kathanañhi tantikkamaṃ vokkamitvā kathanaṃ nāma. Tathā hi vuttaṃ ‘‘tatheva vaṇṇituṃ yuttarūpaṃ hutvā anukkamena āgataṃ pāḷiṃ pariccajitvā saṃvaṇṇanato sīhaḷaṭṭhakathāsu ayuttaṭṭhāne vaṇṇitaṃ yathāṭhāneyeva vaṇṇanato ca vuttaṃ ‘tantikkamaṃ kañci avokkamitvā’’’ti. Tasmā yathāvuttanayeneva attho gahetabbo. Kathaṃ pana vitthāramaggassa saṅkhipane vinicchayo na hīyatīti? Āha ‘‘vinicchayaṃ sabbamasesayitvā’’ti. Saṅkhipantopi punappunaṃ vacanādimeva saṅkhipanto, vinicchayaṃ pana aṭṭhakathāsu sabbāsupi vuttaṃ sabbampi asesayitvā, kiñcimattampi aparihāpetvāti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tantikkamaṃ kañci avokkamitvā"
      },
      "ti kañci pāḷikkamaṃ anatikkamitvā, anukkameneva pāḷiṃ vaṇṇayissāmāti attho."
    ],
    "innerText": "Tatoti tāhi aṭṭhakathāhi. Bhāsantarameva hitvāti sīhaḷabhāsaṃyeva apanetvā. Vitthāramaggañca samāsayitvāti porāṇaṭṭhakathāsu yathāṭhāne vattabbampi padatthavinicchayādikaṃ ativitthiṇṇena vacanakkamena ceva vuttameva atthanayaṃ appamattakavisesena punappunaṃ kathanena ca tattha tattha papañcitaṃ tādisaṃ vitthāramaggaṃ pahāya sallahukena atthaviññāpakena padakkamena ceva vuttanayasadisaṃ vattabbaṃ atidisitvā ca saṅkhepanayeneva vaṇṇayissāmāti adhippāyo. Sāratthadīpaniyaṃ pana vinayaṭīkāyaṃ ‘‘porāṇaṭṭhakathāsu upari vuccamānampi ānetvā tattha tattha papañcitaṃ ñatticatutthena kammena…pe… upasampannoti bhikkhūti ettha apalokanādīnaṃ catunnampi kammānaṃ vitthārakathā viya tādisaṃ vitthāramaggaṃ saṅkhipitvā’’ti vuttaṃ, taṃ tantikkamaṃ kañci avokkamitvāti ettheva vattuṃ yuttaṃ. Aññattha pāḷiyā vattabbaṃ aññattha kathanañhi tantikkamaṃ vokkamitvā kathanaṃ nāma. Tathā hi vuttaṃ ‘‘tatheva vaṇṇituṃ yuttarūpaṃ hutvā anukkamena āgataṃ pāḷiṃ pariccajitvā saṃvaṇṇanato sīhaḷaṭṭhakathāsu ayuttaṭṭhāne vaṇṇitaṃ yathāṭhāneyeva vaṇṇanato ca vuttaṃ ‘tantikkamaṃ kañci avokkamitvā’’’ti. Tasmā yathāvuttanayeneva attho gahetabbo. Kathaṃ pana vitthāramaggassa saṅkhipane vinicchayo na hīyatīti? Āha ‘‘vinicchayaṃ sabbamasesayitvā’’ti. Saṅkhipantopi punappunaṃ vacanādimeva saṅkhipanto, vinicchayaṃ pana aṭṭhakathāsu sabbāsupi vuttaṃ sabbampi asesayitvā, kiñcimattampi aparihāpetvāti vuttaṃ hoti. Tantikkamaṃ kañci avokkamitvāti kañci pāḷikkamaṃ anatikkamitvā, anukkameneva pāḷiṃ vaṇṇayissāmāti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suttantikānaṃ vacanānamattha"
      },
      "nti verañjakaṇḍādīsu āgatānaṃ jhānakathādīnaṃ suttantavacanānaṃ sīhaḷaṭṭhakathāsu ‘‘suttantikānaṃ bhāro’’ti vatvā avaṇṇitabbaṭṭhānaṃ atthaṃ taṃtaṃsuttānurūpaṃ sabbaso paridīpayissāmāti adhippāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hessatī"
      },
      "ti bhavissati, karīyissatīti vā attho. Ettha ca paṭhamasmiṃ atthavikappe ‘‘bhāsantarapariccāgādikaṃ catubbidhaṃ kiccaṃ nipphādetvā suttantikānaṃ vacanānamatthaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paridīpayantī"
      },
      " ayaṃ vaṇṇanā bhavissatī’’ti vaṇṇanāvasena samānakattukatā veditabbā. Pacchimasmiṃ atthavikappe pana ‘‘heṭṭhā vuttabhāsantarapariccāgādikaṃ katvā suttantikānaṃ vacanānamatthaṃ paridīpayantī ayaṃ vaṇṇanā amhehi karīyissatī’’ti evaṃ ācariyavasena samānakattukatā veditabbā."
    ],
    "innerText": "Suttantikānaṃ vacanānamatthanti verañjakaṇḍādīsu āgatānaṃ jhānakathādīnaṃ suttantavacanānaṃ sīhaḷaṭṭhakathāsu ‘‘suttantikānaṃ bhāro’’ti vatvā avaṇṇitabbaṭṭhānaṃ atthaṃ taṃtaṃsuttānurūpaṃ sabbaso paridīpayissāmāti adhippāyo. Hessatīti bhavissati, karīyissatīti vā attho. Ettha ca paṭhamasmiṃ atthavikappe ‘‘bhāsantarapariccāgādikaṃ catubbidhaṃ kiccaṃ nipphādetvā suttantikānaṃ vacanānamatthaṃ paridīpayantī ayaṃ vaṇṇanā bhavissatī’’ti vaṇṇanāvasena samānakattukatā veditabbā. Pacchimasmiṃ atthavikappe pana ‘‘heṭṭhā vuttabhāsantarapariccāgādikaṃ katvā suttantikānaṃ vacanānamatthaṃ paridīpayantī ayaṃ vaṇṇanā amhehi karīyissatī’’ti evaṃ ācariyavasena samānakattukatā veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ganthārambhakathāvaṇṇanānayo niṭṭhito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "Bāhiranidānakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni ",
      " saṃvaravinayapahānavinayādīsu bahūsu vinayesu attanā ‘‘taṃ vaṇṇayissaṃ vinaya’’nti evaṃ saṃvaṇṇetabbabhāvena paṭiññātaṃ vinayaṃ dassento āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tatthā"
      },
      "tiādi. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tatthā"
      },
      "ti yathāvuttāsu gāthāsu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tāva"
      },
      "-saddo paṭhamanti imasmiṃ atthe daṭṭhabbo, tena paṭhamaṃ vinayaṃ vavatthapetvā ",
      " pacchā tassa vaṇṇanaṃ karissāmāti dīpeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vavatthapetabbo"
      },
      "ti niyametabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tenetaṃ vuccatī"
      },
      "ti yasmā vavatthapetabbo, tena hetunā etaṃ vinayo nāmātiādikaṃ niyāmakavacanaṃ vuccatīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Assā"
      },
      "ti vinayassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mātikā"
      },
      "ti uddeso. So hi niddesapadānaṃ jananīṭhāne ṭhitattā mātā viyāti ‘‘mātikā’’ti vuccati."
    ],
    "innerText": "Idāni saṃvaravinayapahānavinayādīsu bahūsu vinayesu attanā ‘‘taṃ vaṇṇayissaṃ vinaya’’nti evaṃ saṃvaṇṇetabbabhāvena paṭiññātaṃ vinayaṃ dassento āha tatthātiādi. Tattha tatthāti yathāvuttāsu gāthāsu. Tāva-saddo paṭhamanti imasmiṃ atthe daṭṭhabbo, tena paṭhamaṃ vinayaṃ vavatthapetvā pacchā tassa vaṇṇanaṃ karissāmāti dīpeti. Vavatthapetabboti niyametabbo. Tenetaṃ vuccatīti yasmā vavatthapetabbo, tena hetunā etaṃ vinayo nāmātiādikaṃ niyāmakavacanaṃ vuccatīti attho. Assāti vinayassa. Mātikāti uddeso. So hi niddesapadānaṃ jananīṭhāne ṭhitattā mātā viyāti ‘‘mātikā’’ti vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni saṃvaṇṇetabbamatthaṃ mātikaṃ paṭṭhapetvā dassento āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vuttaṃ yenā"
      },
      "tiādi. Idaṃ vuttaṃ hoti – etaṃ tena samayena buddho bhagavā verañjāyaṃ viharatītiādinidānavacanapaṭimaṇḍitaṃ vinayapiṭakaṃ yena puggalena vuttaṃ, yasmiṃ kāle vuttaṃ, yasmā kāraṇā vuttaṃ, yena dhāritaṃ, yena ca ābhataṃ, yesu patiṭṭhitaṃ, etaṃ yathāvuttavidhānaṃ vatvā tato tena samayenātiādipāṭhassa atthaṃ anekappakārato dassento vinayassa atthavaṇṇanaṃ karissāmīti."
    ],
    "innerText": "Idāni saṃvaṇṇetabbamatthaṃ mātikaṃ paṭṭhapetvā dassento āha vuttaṃ yenātiādi. Idaṃ vuttaṃ hoti – etaṃ tena samayena buddho bhagavā verañjāyaṃ viharatītiādinidānavacanapaṭimaṇḍitaṃ vinayapiṭakaṃ yena puggalena vuttaṃ, yasmiṃ kāle vuttaṃ, yasmā kāraṇā vuttaṃ, yena dhāritaṃ, yena ca ābhataṃ, yesu patiṭṭhitaṃ, etaṃ yathāvuttavidhānaṃ vatvā tato tena samayenātiādipāṭhassa atthaṃ anekappakārato dassento vinayassa atthavaṇṇanaṃ karissāmīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ettha ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vuttaṃ yena yadā yasmā"
      },
      "ti idaṃ vacanaṃ tena samayena buddho bhagavātiādinidānavacanamattaṃ apekkhitvā vattukāmopi visuṃ avatvā ‘‘nidānena ādikalyāṇaṃ, idamavocāti nigamanena pariyosānakalyāṇa’’nti vacanato nidānanigamanānipi satthudesanāya anuvidhānattā tadantogadhānevāti nidānassāpi vinayapāḷiyaṃyeva antogadhattā vuttaṃ yena yadā yasmāti idampi vinayapiṭakasambandhaṃyeva katvā mātikaṃ ṭhapeti. Mātikāya hi etanti vuttaṃ vinayapiṭakaṃyeva sāmaññato sabbattha sambandhamupagacchati."
    ],
    "innerText": "Ettha ca vuttaṃ yena yadā yasmāti idaṃ vacanaṃ tena samayena buddho bhagavātiādinidānavacanamattaṃ apekkhitvā vattukāmopi visuṃ avatvā ‘‘nidānena ādikalyāṇaṃ, idamavocāti nigamanena pariyosānakalyāṇa’’nti vacanato nidānanigamanānipi satthudesanāya anuvidhānattā tadantogadhānevāti nidānassāpi vinayapāḷiyaṃyeva antogadhattā vuttaṃ yena yadā yasmāti idampi vinayapiṭakasambandhaṃyeva katvā mātikaṃ ṭhapeti. Mātikāya hi etanti vuttaṃ vinayapiṭakaṃyeva sāmaññato sabbattha sambandhamupagacchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni pana taṃ visuṃ nīharitvā dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tattha vuttaṃ yenā"
      },
      "tiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatthā"
      },
      "ti tesu mātikāpadesu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ida"
      },
      "nti tena samayenātiādinidānavacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hi"
      },
      "-saddo yasmāti attho daṭṭhabbo, yasmā buddhassa bhagavato attapaccakkhavacanaṃ na hoti, tasmāti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attapaccakkhavacanaṃ na hotī"
      },
      "ti attanā paccakkhaṃ katvā vuttavacanaṃ na hoti. Atha ",
      " vā attano paccakkhakāle dharamānakāle vuttavacanaṃ na hoti. Tadubhayenāpi bhagavato vuttavacanaṃ na hotīti attho."
    ],
    "innerText": "Idāni pana taṃ visuṃ nīharitvā dassento tattha vuttaṃ yenātiādimāha. Tatthāti tesu mātikāpadesu. Idanti tena samayenātiādinidānavacanaṃ. Hi-saddo yasmāti attho daṭṭhabbo, yasmā buddhassa bhagavato attapaccakkhavacanaṃ na hoti, tasmāti vuttaṃ hoti. Attapaccakkhavacanaṃ na hotīti attanā paccakkhaṃ katvā vuttavacanaṃ na hoti. Atha vā attano paccakkhakāle dharamānakāle vuttavacanaṃ na hoti. Tadubhayenāpi bhagavato vuttavacanaṃ na hotīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Paṭhamamahāsaṅgītikathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭhamamahāsaṅgīti nāma cesā"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ca"
      },
      "-saddo vattabbasampiṇḍanattho, upaññāsattho vā, upaññāsoti ca vākyārambho vuccati. Esā hi ganthakārānaṃ pakati, yadidaṃ kiñci vatvā puna aparaṃ vattumārabhantānaṃ ca-saddappayogo. Yathāpaccayaṃ tattha tattha desitattā vippakiṇṇānaṃ dhammavinayānaṃ ",
      " sabhāgatthavasena saṅgahetvā gāyanaṃ kathanaṃ saṅgīti, mahāvisayattā pūjanīyattā ca mahatī saṅgīti mahāsaṅgīti. Dutiyādiṃ upādāya cesā ‘‘paṭhamamahāsaṅgītī’’ti vuttā. Nidadāti desanaṃ desakālādivasena aviditaṃ viditaṃ katvā nidassetīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nidānaṃ,"
      },
      " tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kosallatthaṃ"
      },
      "."
    ],
    "innerText": "Paṭhamamahāsaṅgīti nāma cesāti ettha ca-saddo vattabbasampiṇḍanattho, upaññāsattho vā, upaññāsoti ca vākyārambho vuccati. Esā hi ganthakārānaṃ pakati, yadidaṃ kiñci vatvā puna aparaṃ vattumārabhantānaṃ ca-saddappayogo. Yathāpaccayaṃ tattha tattha desitattā vippakiṇṇānaṃ dhammavinayānaṃ sabhāgatthavasena saṅgahetvā gāyanaṃ kathanaṃ saṅgīti, mahāvisayattā pūjanīyattā ca mahatī saṅgīti mahāsaṅgīti. Dutiyādiṃ upādāya cesā ‘‘paṭhamamahāsaṅgītī’’ti vuttā. Nidadāti desanaṃ desakālādivasena aviditaṃ viditaṃ katvā nidassetīti nidānaṃ, tattha kosallatthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Veneyyānaṃ maggaphaluppattihetubhūtāva kiriyā nippariyāyena buddhakiccanti āha ‘‘dhammacakkappavattanañhi ādiṃ katvā’’ti. Tattha satipaṭṭhānādidhammo eva pavattanaṭṭhena cakkanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammacakkaṃ,"
      },
      " cakkanti vā āṇā, taṃ dhammato anapetattā dhammacakkaṃ, dhammena ñāyena cakkantipi dhammacakkaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Katabuddhakicce"
      },
      "ti niṭṭhitabuddhakicce bhagavati lokanātheti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kusinārāya"
      },
      "nti samīpatthe etaṃ bhummavacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upavattane mallānaṃ sālavane"
      },
      "ti tassa nagarassa upavattanabhūtaṃ mallarājūnaṃ sālavanuyyānaṃ dasseti. Tattha nagaraṃ pavisantā uyyānato upecca vattanti gacchanti etenāti ‘‘upavattana’’nti uyyānassa ca nagarassa ca majjhe sālavanaṃ vuccati. Kusinārāya hi dakkhiṇapacchimadisāya taṃ uyyānaṃ hoti, tato uyyānato sālavanarājivirājito maggo pācīnābhimukho gantvā nagarassa dakkhiṇadvārābhimukho uttarena nivatto, tena maggena manussā nagaraṃ pavisanti, tasmā taṃ ‘‘upavattana’’nti vuccati. Tattha kira upavattane aññamaññasaṃsaṭṭhaviṭapānaṃ sampannachāyānaṃ sālapantīnamantare bhagavato parinibbānamañco paññatto, taṃ sandhāya vuttaṃ ‘‘yamakasālānamantare’’ti. Upādīyati kammakilesehīti upādi, vipākakkhandhā kaṭattā ca rūpaṃ. Tadeva kammakilesehi sammā appahīnatāya seso, natthi ettha upādisesoti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anupādisesā,"
      },
      " nibbānadhātu, tāya. Itthambhūtalakkhaṇe ",
      " cāyaṃ karaṇaniddeso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parinibbāne"
      },
      "ti nimittatthe bhummaṃ, parinibbānahetu tasmiṃ ṭhāne sannipatitānanti attho. Saṅghassa thero jeṭṭho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṅghatthero"
      },
      ". Ettha ca saṅghasaddassa bhikkhusatasahassasaddasāpekkhattepi gamakattā therasaddena samāso yathā devadattassa garukulanti. Āyasmā mahākassapo dhammavinayasaṅgāyanatthaṃ bhikkhūnaṃ ussāhaṃ janesīti sambandho."
    ],
    "innerText": "Veneyyānaṃ maggaphaluppattihetubhūtāva kiriyā nippariyāyena buddhakiccanti āha ‘‘dhammacakkappavattanañhi ādiṃ katvā’’ti. Tattha satipaṭṭhānādidhammo eva pavattanaṭṭhena cakkanti dhammacakkaṃ, cakkanti vā āṇā, taṃ dhammato anapetattā dhammacakkaṃ, dhammena ñāyena cakkantipi dhammacakkaṃ. Katabuddhakicceti niṭṭhitabuddhakicce bhagavati lokanātheti sambandho. Kusinārāyanti samīpatthe etaṃ bhummavacanaṃ. Upavattane mallānaṃ sālavaneti tassa nagarassa upavattanabhūtaṃ mallarājūnaṃ sālavanuyyānaṃ dasseti. Tattha nagaraṃ pavisantā uyyānato upecca vattanti gacchanti etenāti ‘‘upavattana’’nti uyyānassa ca nagarassa ca majjhe sālavanaṃ vuccati. Kusinārāya hi dakkhiṇapacchimadisāya taṃ uyyānaṃ hoti, tato uyyānato sālavanarājivirājito maggo pācīnābhimukho gantvā nagarassa dakkhiṇadvārābhimukho uttarena nivatto, tena maggena manussā nagaraṃ pavisanti, tasmā taṃ ‘‘upavattana’’nti vuccati. Tattha kira upavattane aññamaññasaṃsaṭṭhaviṭapānaṃ sampannachāyānaṃ sālapantīnamantare bhagavato parinibbānamañco paññatto, taṃ sandhāya vuttaṃ ‘‘yamakasālānamantare’’ti. Upādīyati kammakilesehīti upādi, vipākakkhandhā kaṭattā ca rūpaṃ. Tadeva kammakilesehi sammā appahīnatāya seso, natthi ettha upādisesoti anupādisesā, nibbānadhātu, tāya. Itthambhūtalakkhaṇe cāyaṃ karaṇaniddeso. Parinibbāneti nimittatthe bhummaṃ, parinibbānahetu tasmiṃ ṭhāne sannipatitānanti attho. Saṅghassa thero jeṭṭho saṅghatthero. Ettha ca saṅghasaddassa bhikkhusatasahassasaddasāpekkhattepi gamakattā therasaddena samāso yathā devadattassa garukulanti. Āyasmā mahākassapo dhammavinayasaṅgāyanatthaṃ bhikkhūnaṃ ussāhaṃ janesīti sambandho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tathā ussāhaṃ jananassa kāraṇamāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sattāhaparinibbute"
      },
      "tiādi. Satta ahāni samāhaṭāni sattāhaṃ, sattāhaṃ parinibbutassa assāti sattāhaparinibbuto, sattāhaparinibbute subhaddena vuḍḍhapabbajitena vuttavacanamanussarantoti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Alaṃ, āvuso"
      },
      "tiādinā tena vuttavacanaṃ dasseti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ala"
      },
      "nti paṭikkhepavacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tena mahāsamaṇenā"
      },
      "ti nissakke karaṇavacanaṃ, tato mahāsamaṇato suṭṭhu muttā mayanti attho, upaddutā ca homa tadāti adhippāyo, homāti vā atītatthe vattamānavacanaṃ, ahumhāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ṭhānaṃ kho panetaṃ vijjatī"
      },
      "ti tiṭṭhati ettha phalaṃ tadāyattavuttitāyāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ṭhānaṃ,"
      },
      " hetu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kho"
      },
      "ti avadhāraṇe, etaṃ kāraṇaṃ vijjateva, no na vijjatīti attho. Kiṃ taṃ kāraṇanti? Āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yaṃ pāpabhikkhū"
      },
      "tiādi. Ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ya"
      },
      "nti nipātamattaṃ, kāraṇaniddeso vā, yena kāraṇena antaradhāpeyyuṃ, tadetaṃ kāraṇaṃ vijjatīti attho. Atīto atikkanto satthā ettha, etassāti vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "atītasatthukaṃ,"
      },
      " pāvacanaṃ. Padhānaṃ vacanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pāvacanaṃ,"
      },
      " dhammavinayanti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pakkhaṃ labhitvā"
      },
      "ti alajjīpakkhaṃ labhitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na cirassevā"
      },
      "ti na cireneva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yāva ca dhammavinayo tiṭṭhatī"
      },
      "ti yattakaṃ kālaṃ dhammo ca vinayo ca lajjīpuggalesu tiṭṭhati."
    ],
    "innerText": "Tathā ussāhaṃ jananassa kāraṇamāha sattāhaparinibbutetiādi. Satta ahāni samāhaṭāni sattāhaṃ, sattāhaṃ parinibbutassa assāti sattāhaparinibbuto, sattāhaparinibbute subhaddena vuḍḍhapabbajitena vuttavacanamanussarantoti sambandho. Alaṃ, āvusotiādinā tena vuttavacanaṃ dasseti. Tattha alanti paṭikkhepavacanaṃ. Tena mahāsamaṇenāti nissakke karaṇavacanaṃ, tato mahāsamaṇato suṭṭhu muttā mayanti attho, upaddutā ca homa tadāti adhippāyo, homāti vā atītatthe vattamānavacanaṃ, ahumhāti attho. Ṭhānaṃ kho panetaṃ vijjatīti tiṭṭhati ettha phalaṃ tadāyattavuttitāyāti ṭhānaṃ, hetu. Khoti avadhāraṇe, etaṃ kāraṇaṃ vijjateva, no na vijjatīti attho. Kiṃ taṃ kāraṇanti? Āha yaṃ pāpabhikkhūtiādi. Ettha yanti nipātamattaṃ, kāraṇaniddeso vā, yena kāraṇena antaradhāpeyyuṃ, tadetaṃ kāraṇaṃ vijjatīti attho. Atīto atikkanto satthā ettha, etassāti vā atītasatthukaṃ, pāvacanaṃ. Padhānaṃ vacanaṃ pāvacanaṃ, dhammavinayanti vuttaṃ hoti. Pakkhaṃ labhitvāti alajjīpakkhaṃ labhitvā. Na cirassevāti na cireneva. Yāva ca dhammavinayo tiṭṭhatīti yattakaṃ kālaṃ dhammo ca vinayo ca lajjīpuggalesu tiṭṭhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vuttañhetaṃ bhagavatā"
      },
      "ti parinibbānamañce nipannena bhagavatā vuttanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Desito paññatto"
      },
      "ti suttābhidhammapiṭakasaṅgahitassa dhammassa ceva vinayapiṭakasaṅgahitassa vinayassa ca atisajjanaṃ pabodhanaṃ desanā. Tasseva pakārato ñāpanaṃ asaṅkarato ṭhapanaṃ paññāpanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "So vo mamaccayena satthā"
      },
      "ti so dhammavinayo tumhākaṃ mamaccayena satthā mayi parinibbute satthukiccaṃ sādhessati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sāsana"
      },
      "nti pariyattipaṭipattipaṭivedhavasena tividhaṃ sāsanaṃ, nippariyāyato pana sattattiṃsa bodhipakkhiyadhammā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Addhaniya"
      },
      "nti addhānakkhamaṃ, tadeva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ciraṭṭhitikaṃ assa"
      },
      " bhaveyyāti sambandho."
    ],
    "innerText": "Vuttañhetaṃ bhagavatāti parinibbānamañce nipannena bhagavatā vuttanti attho. Desito paññattoti suttābhidhammapiṭakasaṅgahitassa dhammassa ceva vinayapiṭakasaṅgahitassa vinayassa ca atisajjanaṃ pabodhanaṃ desanā. Tasseva pakārato ñāpanaṃ asaṅkarato ṭhapanaṃ paññāpanaṃ. So vo mamaccayena satthāti so dhammavinayo tumhākaṃ mamaccayena satthā mayi parinibbute satthukiccaṃ sādhessati. Sāsananti pariyattipaṭipattipaṭivedhavasena tividhaṃ sāsanaṃ, nippariyāyato pana sattattiṃsa bodhipakkhiyadhammā. Addhaniyanti addhānakkhamaṃ, tadeva ciraṭṭhitikaṃ assa bhaveyyāti sambandho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni ",
      " sammāsambuddhena attano kataṃ anuggahavisesaṃ vibhāvento āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yañcāhaṃ bhagavatā"
      },
      "tiādi. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yañcāha"
      },
      "nti etassa anuggahitoti etena sambandho. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ya"
      },
      "nti yasmā, yena kāraṇenāti vuttaṃ hoti. Kiriyāparāmasanaṃ vā etaṃ, tena anuggahitoti ettha anuggahaṇaṃ parāmasati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhāressasī"
      },
      "tiādikaṃ bhagavatā mahākassapattherena saddhiṃ cīvaraparivattanaṃ kātukāmena vuttavacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhāressasi pana me tvaṃ kassapā"
      },
      "ti ‘‘kassapa, tvaṃ imāni paribhogajiṇṇāni paṃsukūlāni pārupituṃ sakkhissasī’’ti vadati, tañca kho na kāyabalaṃ sandhāya, paṭipattipūraṇaṃ pana sandhāya evamāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sāṇāni paṃsukūlānī"
      },
      "ti matakaḷevaraṃ paliveṭhetvā chaḍḍitāni tumbamatte kimayo papphoṭetvā gahitāni sāṇavākamayāni paṃsukūlacīvarāni. Rathikādīnaṃ yattha katthaci paṃsūnaṃ upari ṭhitattā abbhuggataṭṭhena tesu kūlamivāti paṃsukūlaṃ. Atha vā paṃsu viya kucchitabhāvaṃ ulati gacchatīti paṃsukūlanti paṃsukūlasaddassa attho daṭṭhabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nibbasanānī"
      },
      "ti niṭṭhitavasanakiccāni, paribhogajiṇṇānīti attho. Ekameva taṃ cīvaraṃ anekāvayavattā bahuvacanaṃ kataṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sādhāraṇaparibhogenā"
      },
      "ti attanā samānaparibhogena, sādhāraṇaparibhogena ca samasamaṭṭhapanena ca anuggahitoti sambandho."
    ],
    "innerText": "Idāni sammāsambuddhena attano kataṃ anuggahavisesaṃ vibhāvento āha yañcāhaṃ bhagavatātiādi. Tattha yañcāhanti etassa anuggahitoti etena sambandho. Tattha yanti yasmā, yena kāraṇenāti vuttaṃ hoti. Kiriyāparāmasanaṃ vā etaṃ, tena anuggahitoti ettha anuggahaṇaṃ parāmasati. Dhāressasītiādikaṃ bhagavatā mahākassapattherena saddhiṃ cīvaraparivattanaṃ kātukāmena vuttavacanaṃ. Dhāressasi pana me tvaṃ kassapāti ‘‘kassapa, tvaṃ imāni paribhogajiṇṇāni paṃsukūlāni pārupituṃ sakkhissasī’’ti vadati, tañca kho na kāyabalaṃ sandhāya, paṭipattipūraṇaṃ pana sandhāya evamāha. Sāṇāni paṃsukūlānīti matakaḷevaraṃ paliveṭhetvā chaḍḍitāni tumbamatte kimayo papphoṭetvā gahitāni sāṇavākamayāni paṃsukūlacīvarāni. Rathikādīnaṃ yattha katthaci paṃsūnaṃ upari ṭhitattā abbhuggataṭṭhena tesu kūlamivāti paṃsukūlaṃ. Atha vā paṃsu viya kucchitabhāvaṃ ulati gacchatīti paṃsukūlanti paṃsukūlasaddassa attho daṭṭhabbo. Nibbasanānīti niṭṭhitavasanakiccāni, paribhogajiṇṇānīti attho. Ekameva taṃ cīvaraṃ anekāvayavattā bahuvacanaṃ kataṃ. Sādhāraṇaparibhogenāti attanā samānaparibhogena, sādhāraṇaparibhogena ca samasamaṭṭhapanena ca anuggahitoti sambandho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni ",
      " navānupubbavihārachaḷabhiññāppabhede uttarimanussadhamme attanā samasamaṭṭhapanatthāya bhagavatā vuttaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kassapasaṃyutte"
      },
      " (saṃ. ni. 2.152) āgataṃ pāḷiṃ peyyālamukhena ādiggahaṇena ca saṅkhipitvā dassento āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ahaṃ, bhikkhave"
      },
      "tiādi. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yāvade ākaṅkhāmī"
      },
      "ti yāvadeva ākaṅkhāmi, yattakaṃ kālaṃ icchāmīti attho, ‘‘yāvadevā’’tipi pāṭho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Navānupubbavihārachaḷabhiññāppabhede"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "navānupubbavihāro"
      },
      " nāma anupaṭipāṭiyā samāpajjitabbabhāvato evaṃsaññitā nirodhasamāpattiyā saha aṭṭha rūpārūpasamāpattiyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Chaḷabhiññā"
      },
      " nāma āsavakkhayañāṇena saddhiṃ pañcābhiññāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attanā samasamaṭṭhapanenā"
      },
      "ti ‘‘ahaṃ yattakaṃ kālaṃ yattake samāpattivihāre abhiññāyo ca vaḷañjemi, tathā kassapopī’’ti evaṃ yathāvuttauttarimanussadhamme attanā samasamaṃ katvā ṭhapanena, idañca uttarimanussadhammasāmaññena therassa pasaṃsāmattena vuttaṃ, na ",
      " bhagavatā saddhiṃ sabbathā samatāya. Bhagavato hi guṇavisesaṃ upādāya sāvakā paccekabuddhā ca kalampi kalabhāgampi na upenti, tassa kimaññaṃ āṇaṇyaṃ bhavissati aññatra dhammavinayasaṅgāyanāti adhippāyo. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tassā"
      },
      "ti tassa anuggahassa, tassa meti vā attho gahetabbo. Potthakesu hi kesuci ‘‘tassa me’’ti pāṭho dissati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āṇaṇyaṃ"
      },
      " aṇaṇabhāvo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sakakavacaissariyānuppadānenā"
      },
      "ti ettha cīvarassa nidassanavasena kavacasseva gahaṇaṃ kataṃ, samāpattiyā nidassanavasena issariyaṃ gahitaṃ."
    ],
    "innerText": "Idāni navānupubbavihārachaḷabhiññāppabhede uttarimanussadhamme attanā samasamaṭṭhapanatthāya bhagavatā vuttaṃ kassapasaṃyutte (saṃ. ni. 2.152) āgataṃ pāḷiṃ peyyālamukhena ādiggahaṇena ca saṅkhipitvā dassento āha ahaṃ, bhikkhavetiādi. Tattha yāvade ākaṅkhāmīti yāvadeva ākaṅkhāmi, yattakaṃ kālaṃ icchāmīti attho, ‘‘yāvadevā’’tipi pāṭho. Navānupubbavihārachaḷabhiññāppabhedeti ettha navānupubbavihāro nāma anupaṭipāṭiyā samāpajjitabbabhāvato evaṃsaññitā nirodhasamāpattiyā saha aṭṭha rūpārūpasamāpattiyo. Chaḷabhiññā nāma āsavakkhayañāṇena saddhiṃ pañcābhiññāyo. Attanā samasamaṭṭhapanenāti ‘‘ahaṃ yattakaṃ kālaṃ yattake samāpattivihāre abhiññāyo ca vaḷañjemi, tathā kassapopī’’ti evaṃ yathāvuttauttarimanussadhamme attanā samasamaṃ katvā ṭhapanena, idañca uttarimanussadhammasāmaññena therassa pasaṃsāmattena vuttaṃ, na bhagavatā saddhiṃ sabbathā samatāya. Bhagavato hi guṇavisesaṃ upādāya sāvakā paccekabuddhā ca kalampi kalabhāgampi na upenti, tassa kimaññaṃ āṇaṇyaṃ bhavissati aññatra dhammavinayasaṅgāyanāti adhippāyo. Tattha tassāti tassa anuggahassa, tassa meti vā attho gahetabbo. Potthakesu hi kesuci ‘‘tassa me’’ti pāṭho dissati. Āṇaṇyaṃ aṇaṇabhāvo. Sakakavacaissariyānuppadānenāti ettha cīvarassa nidassanavasena kavacasseva gahaṇaṃ kataṃ, samāpattiyā nidassanavasena issariyaṃ gahitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni yathāvuttamatthaṃ pāḷiyā vibhāvento āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yathāhā"
      },
      "tiādi. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekamidāha"
      },
      "nti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ida"
      },
      "nti nipātamattaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekaṃ samaya"
      },
      "nti ekasmiṃ samayeti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāvāyā"
      },
      "ti pāvānagarato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Addhānamaggappaṭipanno"
      },
      "ti dīghamaggappaṭipanno. Dīghapariyāyo hettha addhānasaddo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbaṃ subhaddakaṇḍaṃ vitthārato veditabba"
      },
      "nti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pañcasatikakkhandhake"
      },
      " āgataṃ subhaddakaṇḍaṃ idha ānetvā vitthāretabbaṃ."
    ],
    "innerText": "Idāni yathāvuttamatthaṃ pāḷiyā vibhāvento āha yathāhātiādi. Tattha ekamidāhanti ettha idanti nipātamattaṃ. Ekaṃ samayanti ekasmiṃ samayeti attho. Pāvāyāti pāvānagarato. Addhānamaggappaṭipannoti dīghamaggappaṭipanno. Dīghapariyāyo hettha addhānasaddo. Sabbaṃ subhaddakaṇḍaṃ vitthārato veditabbanti pañcasatikakkhandhake āgataṃ subhaddakaṇḍaṃ idha ānetvā vitthāretabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tato para"
      },
      "nti subhaddakaṇḍato paraṃ. Sabbaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "subhaddakaṇḍaṃ"
      },
      " vitthārato veditabbanti iminā ‘‘yaṃ na icchissāma, na taṃ karissāmā’’ti etaṃ pariyantaṃ subhaddakaṇḍapāḷiṃ dassetvā idāni avasesaṃ ussāhajananappakārappavattaṃ pāḷimeva dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "handa mayaṃ āvuso"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pure adhammo dippatī"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘adhammo"
      },
      " nāma dasakusalakammapathapaṭipakkhabhūto adhammo’’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sāratthadīpaniyaṃ"
      },
      " (sārattha. ṭī. 1.paṭhamamahāsaṅgītikathāvaṇṇanā) vuttaṃ. Dhammasaṅgahaṇatthaṃ ussāhajananappasaṅgattā pana dhammavinayānaṃ asaṅgāyanahetudosagaṇo sambhavati, so eva ettha adhammo dippati tappaṭipakkho dhammo ca paṭibāhīyatīti vattabbaṃ. Api ca ‘‘adhammavādino balavanto honti dhammavādino dubbalā hontī’’ti vuccamānattā yena adhammena te subhaddavajjiputtakādayo adhammavādino, yena ca dhammena itare dhammavādinova honti. Teyeva idha ‘‘adhammo’’ ",
      " ‘‘dhammo’’ti ca vattabbā. Tasmā sīlavipattiādihetuko pāpicchatādidosagaṇo adhammo, tappaṭipakkho sīlasampadādihetuko appicchatādiguṇasamūho dhammoti ca gahetabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pure dippatī"
      },
      "ti api nāma dippati. Atha vā yāva adhammo dhammaṃ paṭibāhituṃ samattho hoti, tato puretaramevāti ",
      " attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dippatī"
      },
      "ti dippissati. Puresaddayogena hi anāgatatthe ayaṃ vattamānappayogo, yathā purā vassati devoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avinayo"
      },
      "ti pahānavinayādīnaṃ paṭipakkhabhūto avinayo."
    ],
    "innerText": "Tato paranti subhaddakaṇḍato paraṃ. Sabbaṃ subhaddakaṇḍaṃ vitthārato veditabbanti iminā ‘‘yaṃ na icchissāma, na taṃ karissāmā’’ti etaṃ pariyantaṃ subhaddakaṇḍapāḷiṃ dassetvā idāni avasesaṃ ussāhajananappakārappavattaṃ pāḷimeva dassento handa mayaṃ āvusotiādimāha. Tattha pure adhammo dippatīti ettha ‘‘adhammo nāma dasakusalakammapathapaṭipakkhabhūto adhammo’’ti sāratthadīpaniyaṃ (sārattha. ṭī. 1.paṭhamamahāsaṅgītikathāvaṇṇanā) vuttaṃ. Dhammasaṅgahaṇatthaṃ ussāhajananappasaṅgattā pana dhammavinayānaṃ asaṅgāyanahetudosagaṇo sambhavati, so eva ettha adhammo dippati tappaṭipakkho dhammo ca paṭibāhīyatīti vattabbaṃ. Api ca ‘‘adhammavādino balavanto honti dhammavādino dubbalā hontī’’ti vuccamānattā yena adhammena te subhaddavajjiputtakādayo adhammavādino, yena ca dhammena itare dhammavādinova honti. Teyeva idha ‘‘adhammo’’ ‘‘dhammo’’ti ca vattabbā. Tasmā sīlavipattiādihetuko pāpicchatādidosagaṇo adhammo, tappaṭipakkho sīlasampadādihetuko appicchatādiguṇasamūho dhammoti ca gahetabbaṃ. Pure dippatīti api nāma dippati. Atha vā yāva adhammo dhammaṃ paṭibāhituṃ samattho hoti, tato puretaramevāti attho. Dippatīti dippissati. Puresaddayogena hi anāgatatthe ayaṃ vattamānappayogo, yathā purā vassati devoti. Avinayoti pahānavinayādīnaṃ paṭipakkhabhūto avinayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tena hī"
      },
      "ti uyyojanatthe nipāto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sakalanavaṅgasatthusāsanapariyattidhare"
      },
      "ti sakalaṃ suttageyyādinavaṅgaṃ ettha, etassa vā atthīti sakalanavaṅgaṃ, satthusāsanaṃ. Atthakāmena pariyāpuṇitabbato diṭṭhadhammikādipurisatthapariyattibhāvato ca ‘‘pariyattī’’ti tīṇi piṭakāni vuccanti, taṃ sakalanavaṅgasatthusāsanasaṅkhātaṃ pariyattiṃ dhārentīti sakalanavaṅgasatthusāsanapaayattidharā, tādiseti attho. Samathabhāvanāsinehābhāvena sukkhā lūkhā asiniddhā vipassanā etesanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sukkhavipassakā"
      },
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tipiṭakasabbapariyattippabhedadhare"
      },
      "ti tiṇṇaṃ piṭakānaṃ samāhāro tipiṭakaṃ, tadeva navaṅgādivasena anekabhedabhinnaṃ sabbaṃ pariyattippabhedaṃ dhārentīti tipiṭakasabbapariyattippabhedadharā."
    ],
    "innerText": "Tena hīti uyyojanatthe nipāto. Sakalanavaṅgasatthusāsanapariyattidhareti sakalaṃ suttageyyādinavaṅgaṃ ettha, etassa vā atthīti sakalanavaṅgaṃ, satthusāsanaṃ. Atthakāmena pariyāpuṇitabbato diṭṭhadhammikādipurisatthapariyattibhāvato ca ‘‘pariyattī’’ti tīṇi piṭakāni vuccanti, taṃ sakalanavaṅgasatthusāsanasaṅkhātaṃ pariyattiṃ dhārentīti sakalanavaṅgasatthusāsanapaayattidharā, tādiseti attho. Samathabhāvanāsinehābhāvena sukkhā lūkhā asiniddhā vipassanā etesanti sukkhavipassakā. Tipiṭakasabbapariyattippabhedadhareti tiṇṇaṃ piṭakānaṃ samāhāro tipiṭakaṃ, tadeva navaṅgādivasena anekabhedabhinnaṃ sabbaṃ pariyattippabhedaṃ dhārentīti tipiṭakasabbapariyattippabhedadharā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kissa panā"
      },
      "ti kasmā pana. Sikkhatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sekkho"
      },
      ". Tamevāha ‘‘sakaraṇīyo’’ti. Uparimaggattayakiccassa apariyositattā sakiccoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Assā"
      },
      "ti anena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bahukārattā"
      },
      "ti bahupakārattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Assā"
      },
      "ti bhaveyya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ativiya vissattho"
      },
      "ti ativiya vissāsiko. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na"
      },
      "nti ānandattheraṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ovadatī"
      },
      "ti sambandho. Ānandattherassa kadāci asaññatāya navakāya saddhivihārikaparisāya janapadacārikācaraṇaṃ, tesañca saddhivihārikānaṃ ekakkhaṇe uppabbajjanañca paṭicca mahākassapatthero taṃ niggaṇhanto evamāha ‘‘na vāyaṃ kumārako mattamaññāsī’’ti. Ettha ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vā"
      },
      "-saddo padapūraṇo, ayaṃ kumāro attano pamāṇaṃ na paṭijānātīti theraṃ tajjento āha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatrā"
      },
      "ti evaṃ sati."
    ],
    "innerText": "Kissa panāti kasmā pana. Sikkhatīti sekkho. Tamevāha ‘‘sakaraṇīyo’’ti. Uparimaggattayakiccassa apariyositattā sakiccoti attho. Assāti anena. Bahukārattāti bahupakārattā. Assāti bhaveyya. Ativiya vissatthoti ativiya vissāsiko. Nanti ānandattheraṃ ovadatīti sambandho. Ānandattherassa kadāci asaññatāya navakāya saddhivihārikaparisāya janapadacārikācaraṇaṃ, tesañca saddhivihārikānaṃ ekakkhaṇe uppabbajjanañca paṭicca mahākassapatthero taṃ niggaṇhanto evamāha ‘‘na vāyaṃ kumārako mattamaññāsī’’ti. Ettha ca vā-saddo padapūraṇo, ayaṃ kumāro attano pamāṇaṃ na paṭijānātīti theraṃ tajjento āha. Tatrāti evaṃ sati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kiñcāpi sekkho"
      },
      "ti idaṃ na sekkhānaṃ agatigamanasabbhāvena vuttaṃ, asekkhānaññeva pana uccinitvā gahitattāti daṭṭhabbaṃ. Tasmā ‘‘kiñcāpi sekkho, tathāpi thero āyasmantampi ānandaṃ uccinatū’’ti evamettha sambandho veditabbo, na pana kiñcāpi sekkho, tathāpi abhabbo agatiṃ gantunti yojetabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhabbo"
      },
      "tiādi panassa sabhāvakathanaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "chandā"
      },
      "ti chandena sinehena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Agatiṃ gantu"
      },
      "nti akattabbaṃ kātuṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pariyatto"
      },
      "ti adhīto uggahito."
    ],
    "innerText": "Kiñcāpi sekkhoti idaṃ na sekkhānaṃ agatigamanasabbhāvena vuttaṃ, asekkhānaññeva pana uccinitvā gahitattāti daṭṭhabbaṃ. Tasmā ‘‘kiñcāpi sekkho, tathāpi thero āyasmantampi ānandaṃ uccinatū’’ti evamettha sambandho veditabbo, na pana kiñcāpi sekkho, tathāpi abhabbo agatiṃ gantunti yojetabbaṃ. Abhabbotiādi panassa sabhāvakathanaṃ. Tattha chandāti chandena sinehena. Agatiṃ gantunti akattabbaṃ kātuṃ. Pariyattoti adhīto uggahito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rājagahaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kho mahāgocara"
      },
      "nti ettha gāvo caranti etthāti gocaro, gunnaṃ gocaraṭṭhānaṃ. Gocaro viyāti gocaro, bhikkhācaraṇaṭṭhānaṃ. So mahanto assāti mahāgocaraṃ, rājagahaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ukkoṭeyyā"
      },
      "ti nivāreyya."
    ],
    "innerText": "Rājagahaṃkho mahāgocaranti ettha gāvo caranti etthāti gocaro, gunnaṃ gocaraṭṭhānaṃ. Gocaro viyāti gocaro, bhikkhācaraṇaṭṭhānaṃ. So mahanto assāti mahāgocaraṃ, rājagahaṃ. Ukkoṭeyyāti nivāreyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sattasu sādhukīḷanadivasesū"
      },
      "ti ettha saṃvegavatthuṃ kittetvā kittetvā sādhukaṃ eva pūjāvasena kīḷanato sādhukīḷanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upakaṭṭhā"
      },
      "ti āsannā. Vassaṃ upaneti upagacchati etthāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vassūpanāyikā"
      },
      "."
    ],
    "innerText": "Sattasu sādhukīḷanadivasesūti ettha saṃvegavatthuṃ kittetvā kittetvā sādhukaṃ eva pūjāvasena kīḷanato sādhukīḷanaṃ. Upakaṭṭhāti āsannā. Vassaṃ upaneti upagacchati etthāti vassūpanāyikā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatra suda"
      },
      "nti tassaṃ sāvatthiyaṃ, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "suda"
      },
      "nti nipātamattaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ussannadhātuka"
      },
      "nti upacitapittasemhādidhātukaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samassāsetu"
      },
      "nti santappetuṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dutiyadivase"
      },
      "ti jetavanavihāraṃ paviṭṭhadivasato dutiyadivaseti vadanti. Viriccati etenāti virecanaṃ. Osadhaparibhāvitaṃ khīrameva virecananti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "khīravirecanaṃ. Yaṃ sandhāyā"
      },
      "ti yaṃ bhesajjapānaṃ sandhāya vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhesajjamattā"
      },
      "ti appamattakaṃ bhesajjaṃ. Appattho hi ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mattā"
      },
      "-saddo mattā sukhapariccāgātiādīsu (dha. pa. 290) viya."
    ],
    "innerText": "Tatra sudanti tassaṃ sāvatthiyaṃ, sudanti nipātamattaṃ. Ussannadhātukanti upacitapittasemhādidhātukaṃ. Samassāsetunti santappetuṃ. Dutiyadivaseti jetavanavihāraṃ paviṭṭhadivasato dutiyadivaseti vadanti. Viriccati etenāti virecanaṃ. Osadhaparibhāvitaṃ khīrameva virecananti khīravirecanaṃ. Yaṃ sandhāyāti yaṃ bhesajjapānaṃ sandhāya vuttaṃ. Bhesajjamattāti appamattakaṃ bhesajjaṃ. Appattho hi ayaṃ mattā-saddo mattā sukhapariccāgātiādīsu (dha. pa. 290) viya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Khaṇḍaphullappaṭisaṅkharaṇa"
      },
      "nti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "khaṇḍa"
      },
      "nti chinnaṃ, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "phulla"
      },
      "nti bhinnaṃ, tesaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭisaṅkharaṇaṃ"
      },
      " abhinavakaraṇaṃ."
    ],
    "innerText": "Khaṇḍaphullappaṭisaṅkharaṇanti ettha khaṇḍanti chinnaṃ, phullanti bhinnaṃ, tesaṃ paṭisaṅkharaṇaṃ abhinavakaraṇaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Paricchedavasena vediyati dissatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pariveṇaṃ. Tatthā"
      },
      "ti tesu vihāresu khaṇḍaphullappaṭisaṅkharaṇanti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭhamaṃ māsa"
      },
      "nti vassānassa paṭhamaṃ māsaṃ, accantasaṃyoge cetaṃ upayogavacanaṃ. Senāsanavattānaṃ bahūnaṃ paññattattā, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "senāsanakkhandhake"
      },
      " (cūḷava. 294 ādayo) senāsanapaṭibaddhānaṃ bahūnaṃ kammānaṃ vihitattā ‘‘bhagavatā…pe… vaṇṇita’’nti vuttaṃ."
    ],
    "innerText": "Paricchedavasena vediyati dissatīti pariveṇaṃ. Tatthāti tesu vihāresu khaṇḍaphullappaṭisaṅkharaṇanti sambandho. Paṭhamaṃ māsanti vassānassa paṭhamaṃ māsaṃ, accantasaṃyoge cetaṃ upayogavacanaṃ. Senāsanavattānaṃ bahūnaṃ paññattattā, senāsanakkhandhake (cūḷava. 294 ādayo) senāsanapaṭibaddhānaṃ bahūnaṃ kammānaṃ vihitattā ‘‘bhagavatā…pe… vaṇṇita’’nti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dutiyadivase"
      },
      "ti ‘‘khaṇḍaphullappaṭisaṅkharaṇaṃ karomā’’ti cintitadivasato dutiyadivase. Vassūpanāyikadivaseyeva te evaṃ cintesuṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Siriyā niketanamivā"
      },
      "ti siriyā nivāsanaṭṭhānaṃ viya. Ekasmiṃ pānīyatitthe sannipatantā pakkhino viya sabbesaṃ janānaṃ cakkhūni maṇḍapeyeva nipatantīti vuttaṃ ‘ekanipātatitthamiva ca devamanussanayanavihaṅgāna’’nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lokarāmaṇeyyaka"
      },
      "nti loke ramaṇīyabhāvaṃ, ramaṇaṃ arahatīti vā lokarāmaṇeyyakaṃ ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Daṭṭhabbasāramaṇḍa"
      },
      "nti daṭṭhabbesu sāraṃ daṭṭhabbasāraṃ, tato vippasannanti daṭṭhabbasāramaṇḍaṃ. Atha vā daṭṭhabbo sārabhūto visiṭṭhataro maṇḍo ",
      " maṇḍanaṃ alaṅkāro etassāti daṭṭhabbasāramaṇḍo, maṇḍapo. Maṇḍaṃ sūriyarasmiṃ pāti nivāretīti maṇḍapo. Vividhāni kusumadāmāni ceva muttolambakāni ca viniggalantaṃ vamentaṃ nikkhāmentamiva cāru sobhanaṃ vitānaṃ etthāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vividhakusumadāmolambakaviniggalantacāruvitāno"
      },
      ". Nānāpupphūpahāravicittasupariniṭṭhitabhūmikammattā eva ‘‘ratanavicittamaṇikoṭṭimatalamivā’’ti vuttaṃ. Ettha ca maṇiyo koṭṭetvā katatalaṃ maṇikoṭṭimatalaṃ nāma, tamivāti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āsanāraha"
      },
      "nti nisīdanārahaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dantakhacita"
      },
      "nti dantehi khacitaṃ."
    ],
    "innerText": "Dutiyadivaseti ‘‘khaṇḍaphullappaṭisaṅkharaṇaṃ karomā’’ti cintitadivasato dutiyadivase. Vassūpanāyikadivaseyeva te evaṃ cintesuṃ. Siriyā niketanamivāti siriyā nivāsanaṭṭhānaṃ viya. Ekasmiṃ pānīyatitthe sannipatantā pakkhino viya sabbesaṃ janānaṃ cakkhūni maṇḍapeyeva nipatantīti vuttaṃ ‘ekanipātatitthamiva ca devamanussanayanavihaṅgāna’’nti. Lokarāmaṇeyyakanti loke ramaṇīyabhāvaṃ, ramaṇaṃ arahatīti vā lokarāmaṇeyyakaṃ . Daṭṭhabbasāramaṇḍanti daṭṭhabbesu sāraṃ daṭṭhabbasāraṃ, tato vippasannanti daṭṭhabbasāramaṇḍaṃ. Atha vā daṭṭhabbo sārabhūto visiṭṭhataro maṇḍo maṇḍanaṃ alaṅkāro etassāti daṭṭhabbasāramaṇḍo, maṇḍapo. Maṇḍaṃ sūriyarasmiṃ pāti nivāretīti maṇḍapo. Vividhāni kusumadāmāni ceva muttolambakāni ca viniggalantaṃ vamentaṃ nikkhāmentamiva cāru sobhanaṃ vitānaṃ etthāti vividhakusumadāmolambakaviniggalantacāruvitāno. Nānāpupphūpahāravicittasupariniṭṭhitabhūmikammattā eva ‘‘ratanavicittamaṇikoṭṭimatalamivā’’ti vuttaṃ. Ettha ca maṇiyo koṭṭetvā katatalaṃ maṇikoṭṭimatalaṃ nāma, tamivāti vuttaṃ hoti. Āsanārahanti nisīdanārahaṃ. Dantakhacitanti dantehi khacitaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āvajjesī"
      },
      "ti upanāmesi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anupādāyā"
      },
      "ti taṇhādiṭṭhivasena kañci dhammaṃ aggahetvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kathādoso"
      },
      "ti kathāya asaccaṃ nāma ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "natthi"
      },
      "."
    ],
    "innerText": "Āvajjesīti upanāmesi. Anupādāyāti taṇhādiṭṭhivasena kañci dhammaṃ aggahetvā. Kathādosoti kathāya asaccaṃ nāma natthi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathāvuḍḍha"
      },
      "nti vuḍḍhapaṭipāṭiṃ anatikkamitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Eke"
      },
      "ti majjhimabhāṇakānaṃyeva eke. Pubbe vuttampi hi sabbaṃ majjhimabhāṇakā vadantiyevāti veditabbaṃ. Dīghabhāṇakā pana ‘‘padasāva thero sannipātamāgato’’ti vadanti. Tesu keci ‘‘ākāsenā’’ti, ‘‘te sabbepi tathā tathā āgatadivasānampi atthitāya ekamekaṃ gahetvā tathā tathā vadiṃsū’’ti vadanti."
    ],
    "innerText": "Yathāvuḍḍhanti vuḍḍhapaṭipāṭiṃ anatikkamitvā. Eketi majjhimabhāṇakānaṃyeva eke. Pubbe vuttampi hi sabbaṃ majjhimabhāṇakā vadantiyevāti veditabbaṃ. Dīghabhāṇakā pana ‘‘padasāva thero sannipātamāgato’’ti vadanti. Tesu keci ‘‘ākāsenā’’ti, ‘‘te sabbepi tathā tathā āgatadivasānampi atthitāya ekamekaṃ gahetvā tathā tathā vadiṃsū’’ti vadanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kaṃ dhuraṃ katvā"
      },
      "ti kaṃ jeṭṭhakaṃ katvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bījaniṃ gahetvā"
      },
      "ti ettha bījanīgahaṇaṃ parisāya dhammakathikānaṃ hatthakukkuccavinodanamukhavikārapaṭicchādanatthaṃ dhammatāvasena āciṇṇanti veditabbaṃ. Teneva hi accantasaññatappattā buddhāpi sāvakāpi dhammakathikānaṃ dhammatādassanatthameva cittabījaniṃ gaṇhanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭhamaṃ, āvuso upāli, pārājikaṃ kattha paññatta"
      },
      "nti ettha kathaṃ saṅgītiyā pubbe paṭhamabhāvo siddhoti? Pātimokkhuddesānukkamādinā pubbe paṭhamabhāvassa siddhattā. Yebhuyyena hi tīṇi piṭakāni bhagavato dharamānakāleyeva iminā anukkamena sajjhāyitāni, teneva kamena pacchāpi saṅgītāni visesato vinayābhidhammapiṭakānīti daṭṭhabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kismiṃ vatthusmi"
      },
      "nti nimittatthe bhummaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Antarā ca, bhante, rājagahaṃ antarā ca nāḷanda"
      },
      "nti rājagahassa ca nāḷandāya ca antarā, vivare majjheti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Antarā"
      },
      "-saddena pana yuttattā ",
      " upayogavacanaṃ kataṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rājāgārake"
      },
      "ti rañño kīḷanatthāya kate agārake. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ambalaṭṭhikāya"
      },
      "nti rañño evaṃnāmakaṃ uyyānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kena saddhi"
      },
      "nti idha kasmā vuttanti? Yasmā panetaṃ na bhagavatā eva vuttaṃ, raññāpi kiñci kiñci vuttamatthi, tasmā ‘‘kamārabbhā’’ti avatvā evaṃ vuttanti daṭṭhabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vedehiputtenā"
      },
      "ti ayaṃ kosalarañño dhītāya putto, na videharañño dhītāya. Yasmā mātā panassa paṇḍitā, tasmā sā vedena ñāṇena īhati ghaṭati vāyamatīti ‘‘vedehī’’ti pākaṭanāmā jātāti veditabbā."
    ],
    "innerText": "Kaṃ dhuraṃ katvāti kaṃ jeṭṭhakaṃ katvā. Bījaniṃ gahetvāti ettha bījanīgahaṇaṃ parisāya dhammakathikānaṃ hatthakukkuccavinodanamukhavikārapaṭicchādanatthaṃ dhammatāvasena āciṇṇanti veditabbaṃ. Teneva hi accantasaññatappattā buddhāpi sāvakāpi dhammakathikānaṃ dhammatādassanatthameva cittabījaniṃ gaṇhanti. Paṭhamaṃ, āvuso upāli, pārājikaṃ kattha paññattanti ettha kathaṃ saṅgītiyā pubbe paṭhamabhāvo siddhoti? Pātimokkhuddesānukkamādinā pubbe paṭhamabhāvassa siddhattā. Yebhuyyena hi tīṇi piṭakāni bhagavato dharamānakāleyeva iminā anukkamena sajjhāyitāni, teneva kamena pacchāpi saṅgītāni visesato vinayābhidhammapiṭakānīti daṭṭhabbaṃ. Kismiṃ vatthusminti nimittatthe bhummaṃ. Antarā ca, bhante, rājagahaṃ antarā ca nāḷandanti rājagahassa ca nāḷandāya ca antarā, vivare majjheti attho. Antarā-saddena pana yuttattā upayogavacanaṃ kataṃ. Rājāgāraketi rañño kīḷanatthāya kate agārake. Ambalaṭṭhikāyanti rañño evaṃnāmakaṃ uyyānaṃ. Kena saddhinti idha kasmā vuttanti? Yasmā panetaṃ na bhagavatā eva vuttaṃ, raññāpi kiñci kiñci vuttamatthi, tasmā ‘‘kamārabbhā’’ti avatvā evaṃ vuttanti daṭṭhabbaṃ. Vedehiputtenāti ayaṃ kosalarañño dhītāya putto, na videharañño dhītāya. Yasmā mātā panassa paṇḍitā, tasmā sā vedena ñāṇena īhati ghaṭati vāyamatīti ‘‘vedehī’’ti pākaṭanāmā jātāti veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ ",
      " nimittapayojanakāladesadesakakārakakaraṇappakārehi paṭhamamahāsaṅgītiṃ dassetvā idāni tattha vavatthāpitesu dhammavinayesu nānappakārakosallatthaṃ ekavidhādibhede dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tadetaṃ sabbampī"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anuttaraṃ sammāsambodhi"
      },
      "nti ettha anāvaraṇañāṇapadaṭṭhānaṃ maggañāṇaṃ, maggañāṇapadaṭṭhānañca anāvaraṇañāṇaṃ ‘‘sammāsambodhī’’ti vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paccavekkhantena vā"
      },
      "ti udānādivasena pavattadhammaṃ sandhāyāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vimuttirasa"
      },
      "nti arahattaphalassādaṃ, vimuttisampattikaṃ vā aggaphalanipphādanato, vimuttikiccaṃ vā kilesānaṃ accantavimuttisampādanato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avasesaṃ buddhavacanaṃ dhammo"
      },
      "ti ettha yadipi dhammo eva vinayopi pariyattiyādibhāvato, tathāpi vinayasaddasannidhānena bhinnādhikaraṇabhāvena payutto dhamma-saddo vinayatantivirahitaṃ tantiṃ dīpeti, yathā puññañāṇasambhāro gobalibaddantiādi."
    ],
    "innerText": "Evaṃ nimittapayojanakāladesadesakakārakakaraṇappakārehi paṭhamamahāsaṅgītiṃ dassetvā idāni tattha vavatthāpitesu dhammavinayesu nānappakārakosallatthaṃ ekavidhādibhede dassetuṃ tadetaṃ sabbampītiādimāha. Tattha anuttaraṃ sammāsambodhinti ettha anāvaraṇañāṇapadaṭṭhānaṃ maggañāṇaṃ, maggañāṇapadaṭṭhānañca anāvaraṇañāṇaṃ ‘‘sammāsambodhī’’ti vuccati. Paccavekkhantena vāti udānādivasena pavattadhammaṃ sandhāyāha. Vimuttirasanti arahattaphalassādaṃ, vimuttisampattikaṃ vā aggaphalanipphādanato, vimuttikiccaṃ vā kilesānaṃ accantavimuttisampādanato. Avasesaṃ buddhavacanaṃ dhammoti ettha yadipi dhammo eva vinayopi pariyattiyādibhāvato, tathāpi vinayasaddasannidhānena bhinnādhikaraṇabhāvena payutto dhamma-saddo vinayatantivirahitaṃ tantiṃ dīpeti, yathā puññañāṇasambhāro gobalibaddantiādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anekajātisaṃsāra"
      },
      "nti imissā gāthāya ayaṃ saṅkhepattho – ahaṃ imassa attabhāvagehassa kārakaṃ taṇhāvaḍḍhakiṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gavesanto"
      },
      " yena ñāṇena taṃ daṭṭhuṃ sakkā, taṃ bodhiñāṇaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anibbisaṃ"
      },
      " alabhanto eva abhinīhārato pabhuti ettakaṃ kālaṃ anekajātisatasahassasaṅkhyaṃ imaṃ saṃsāravaṭṭaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sandhāvissaṃ"
      },
      " saṃsariṃ, yasmā jarābyādhimaraṇamissatāya jāti nāmesā punappunaṃ upagantuṃ dukkhā, na ca sā tasmiṃ adiṭṭhe nivattati, tasmā taṃ gavesanto sandhāvissanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Diṭṭhosī"
      },
      "ti idāni mayā sabbaññutaññāṇaṃ paṭivijjhantena diṭṭho asi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puna geha"
      },
      "nti puna imaṃ attabhāvasaṅkhātaṃ mama gehaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na kāhasī"
      },
      "ti na karissasi. Kāraṇamāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sabbā te"
      },
      "tiādi. Tava ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sabbā"
      },
      " avasesakilesaphāsukā mayā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhaggā"
      },
      ". Imassa tayā katassa attabhāvagehassa avijjāsaṅkhātaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kūṭaṃ"
      },
      " kaṇṇikamaṇḍalaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "visaṅkhataṃ"
      },
      " viddhaṃsitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Visaṅkhāraṃ"
      },
      " nibbānaṃ ārammaṇakaraṇavasena gataṃ mama ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cittaṃ"
      },
      ". Ahañca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "taṇhānaṃ khaya"
      },
      "saṅkhātaṃ arahattamaggaphalaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ajjhagā"
      },
      " pattosmīti attho. Keci pana ‘‘visaṅkhāragataṃ cittameva taṇhānaṃ khayaṃ ajjhagā’’ti evampi atthaṃ vadanti."
    ],
    "innerText": "Anekajātisaṃsāranti imissā gāthāya ayaṃ saṅkhepattho – ahaṃ imassa attabhāvagehassa kārakaṃ taṇhāvaḍḍhakiṃ gavesanto yena ñāṇena taṃ daṭṭhuṃ sakkā, taṃ bodhiñāṇaṃ anibbisaṃ alabhanto eva abhinīhārato pabhuti ettakaṃ kālaṃ anekajātisatasahassasaṅkhyaṃ imaṃ saṃsāravaṭṭaṃ sandhāvissaṃ saṃsariṃ, yasmā jarābyādhimaraṇamissatāya jāti nāmesā punappunaṃ upagantuṃ dukkhā, na ca sā tasmiṃ adiṭṭhe nivattati, tasmā taṃ gavesanto sandhāvissanti attho. Diṭṭhosīti idāni mayā sabbaññutaññāṇaṃ paṭivijjhantena diṭṭho asi. Puna gehanti puna imaṃ attabhāvasaṅkhātaṃ mama gehaṃ. Na kāhasīti na karissasi. Kāraṇamāha sabbā tetiādi. Tava sabbā avasesakilesaphāsukā mayā bhaggā. Imassa tayā katassa attabhāvagehassa avijjāsaṅkhātaṃ kūṭaṃ kaṇṇikamaṇḍalaṃ visaṅkhataṃ viddhaṃsitaṃ. Visaṅkhāraṃ nibbānaṃ ārammaṇakaraṇavasena gataṃ mama cittaṃ. Ahañca taṇhānaṃ khayasaṅkhātaṃ arahattamaggaphalaṃ ajjhagā pattosmīti attho. Keci pana ‘‘visaṅkhāragataṃ cittameva taṇhānaṃ khayaṃ ajjhagā’’ti evampi atthaṃ vadanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kecī"
      },
      "ti khandhakabhāṇakā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāṭipadadivase"
      },
      "ti idaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paccavekkhantassa uppannā"
      },
      "ti etena sambandhitabbaṃ, na ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sabbaññubhāvappattassā"
      },
      "ti etena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Somanassamayañāṇenā"
      },
      "ti somanassasampayuttañāṇena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āmantayāmī"
      },
      "ti nivedayāmi, bodhemīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Antare"
      },
      "ti antarāḷe, vemajjheti attho."
    ],
    "innerText": "Kecīti khandhakabhāṇakā. Pāṭipadadivaseti idaṃ paccavekkhantassa uppannāti etena sambandhitabbaṃ, na sabbaññubhāvappattassāti etena. Somanassamayañāṇenāti somanassasampayuttañāṇena. Āmantayāmīti nivedayāmi, bodhemīti attho. Antareti antarāḷe, vemajjheti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suttantapiṭaka"
      },
      "nti yathā kammameva kammantaṃ, evaṃ suttameva suttantanti veditabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asaṅgīta"
      },
      "nti saṅgītikkhandhaka (cūḷava. 437 ādayo) kathāvatthuppakaraṇādikaṃ. Soḷasahi vārehi ",
      " upalakkhitattā ‘‘soḷasa parivārā’’ti vuttaṃ. Tathā hi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "parivārapāḷiyaṃ"
      },
      " (pari. 1 ādayo) paṭhamaṃ pārājikaṃ kattha paññattantiādinā vuttaṃ. Paññattivāro kathāpattivāro vipattivāro saṅgahavāro samuṭṭhānavāro adhikaraṇavāro samathavāro samuccayavāroti ime aṭṭha vārā, tadanantaraṃ ‘‘methunaṃ dhammaṃ paṭisevanapaccayā pārājikaṃ kattha paññatta’’nti (pari. 188) evaṃ paccayamattavisesena puna vuttā teyeva aṭṭha vārā cāti imesaṃ soḷasannaṃ vārānaṃ vasena bhikkhuvibhaṅgassa ca bhikkhunīvibhaṅgassa ca pakāsitattā soḷasahi vārehi upalakkhito parivāro ‘‘soḷasaparivāro’’ti vuttoti veditabbo."
    ],
    "innerText": "Suttantapiṭakanti yathā kammameva kammantaṃ, evaṃ suttameva suttantanti veditabbaṃ. Asaṅgītanti saṅgītikkhandhaka (cūḷava. 437 ādayo) kathāvatthuppakaraṇādikaṃ. Soḷasahi vārehi upalakkhitattā ‘‘soḷasa parivārā’’ti vuttaṃ. Tathā hi parivārapāḷiyaṃ (pari. 1 ādayo) paṭhamaṃ pārājikaṃ kattha paññattantiādinā vuttaṃ. Paññattivāro kathāpattivāro vipattivāro saṅgahavāro samuṭṭhānavāro adhikaraṇavāro samathavāro samuccayavāroti ime aṭṭha vārā, tadanantaraṃ ‘‘methunaṃ dhammaṃ paṭisevanapaccayā pārājikaṃ kattha paññatta’’nti (pari. 188) evaṃ paccayamattavisesena puna vuttā teyeva aṭṭha vārā cāti imesaṃ soḷasannaṃ vārānaṃ vasena bhikkhuvibhaṅgassa ca bhikkhunīvibhaṅgassa ca pakāsitattā soḷasahi vārehi upalakkhito parivāro ‘‘soḷasaparivāro’’ti vuttoti veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Daḷhīkammasithilakaraṇappayojanā"
      },
      "ti idaṃ lokavajjapaṇṇattivajjesu yathākkamaṃ yojetabbaṃ. Saññamavelaṃ abhibhavitvā pavatto ācāro ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ajjhācāro,"
      },
      " vītikkamo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tenā"
      },
      "ti vividhanayattādihetunā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Eta"
      },
      "nti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vividhavisesanayattā"
      },
      "tiādigāthāvacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etassā"
      },
      "ti vinayassa."
    ],
    "innerText": "Daḷhīkammasithilakaraṇappayojanāti idaṃ lokavajjapaṇṇattivajjesu yathākkamaṃ yojetabbaṃ. Saññamavelaṃ abhibhavitvā pavatto ācāro ajjhācāro, vītikkamo. Tenāti vividhanayattādihetunā. Etanti vividhavisesanayattātiādigāthāvacanaṃ. Etassāti vinayassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Itaraṃ panā"
      },
      "ti suttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attatthaparatthādibhede"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ādi"
      },
      "-saddena diṭṭhadhammikasamparāyikatthe lokiyalokuttarādiatthe ca saṅgaṇhāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Veneyajjhāsayānulomena vuttattā"
      },
      "ti vinayaṃ viya issarabhāvato āṇāpatiṭṭhāpanavasena adesetvā veneyyānaṃ ajjhāsayānulomena caritānurūpaṃ vuttattā. Anupubbasikkhādivasena adesetvā veneyyānaṃ ",
      " kālantare abhinibbattiṃ dassento āha ‘‘sassamiva phala’’nti. Upāyasamaṅgīnaṃyeva nippajjanabhāvaṃ dassento ‘‘dhenu viya khīra’’nti āha. Na hi dhenuṃ visāṇādīsu, akāle vā avijātaṃ vā dohanto khīraṃ paṭilabhati."
    ],
    "innerText": "Itaraṃ panāti suttaṃ. Attatthaparatthādibhedeti ettha ādi-saddena diṭṭhadhammikasamparāyikatthe lokiyalokuttarādiatthe ca saṅgaṇhāti. Veneyajjhāsayānulomena vuttattāti vinayaṃ viya issarabhāvato āṇāpatiṭṭhāpanavasena adesetvā veneyyānaṃ ajjhāsayānulomena caritānurūpaṃ vuttattā. Anupubbasikkhādivasena adesetvā veneyyānaṃ kālantare abhinibbattiṃ dassento āha ‘‘sassamiva phala’’nti. Upāyasamaṅgīnaṃyeva nippajjanabhāvaṃ dassento ‘‘dhenu viya khīra’’nti āha. Na hi dhenuṃ visāṇādīsu, akāle vā avijātaṃ vā dohanto khīraṃ paṭilabhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ya"
      },
      "nti yasmā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etthā"
      },
      "ti abhidhamme. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhidhamme"
      },
      "ti supinantena sukkavissaṭṭhiyā anāpattibhāvepi akusalacetanā upalabbhatītiādinā vinayapaññattiyā saṅkaravirahite dhamme, ‘‘pubbāparavirodhābhāvato saṅkaravirahite dhamme’’tipi vadanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ārammaṇādīhī"
      },
      "ti ārammaṇasampayuttakammadvārapaṭipadādīhi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lakkhaṇīyattā"
      },
      "ti sañjānitabbattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yaṃ panettha avisiṭṭha"
      },
      "nti ettha vinayapiṭakantiādīsu tīsu saddesu yaṃ avisiṭṭhaṃ samānaṃ, taṃ piṭakasaddanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mā piṭakasampadānenā"
      },
      "ti pāḷisampadānavasena mā gaṇhitthāti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathāvuttenā"
      },
      "ti evaṃ duvidhatthenātiādinā vuttappakārena."
    ],
    "innerText": "Yanti yasmā. Etthāti abhidhamme. Abhidhammeti supinantena sukkavissaṭṭhiyā anāpattibhāvepi akusalacetanā upalabbhatītiādinā vinayapaññattiyā saṅkaravirahite dhamme, ‘‘pubbāparavirodhābhāvato saṅkaravirahite dhamme’’tipi vadanti. Ārammaṇādīhīti ārammaṇasampayuttakammadvārapaṭipadādīhi. Lakkhaṇīyattāti sañjānitabbattā. Yaṃ panettha avisiṭṭhanti ettha vinayapiṭakantiādīsu tīsu saddesu yaṃ avisiṭṭhaṃ samānaṃ, taṃ piṭakasaddanti attho. Mā piṭakasampadānenāti pāḷisampadānavasena mā gaṇhitthāti vuttaṃ hoti. Yathāvuttenāti evaṃ duvidhatthenātiādinā vuttappakārena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Desanāsāsanakathābheda"
      },
      "nti ettha desanābhedaṃ sāsanabhedaṃ kathābhedanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bheda"
      },
      "saddo paccekaṃ yojetabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bheda"
      },
      "nti ca nānattanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tesū"
      },
      "ti piṭakesu. Sikkhā ca pahānāni ca gambhīrabhāvo ",
      " ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sikkhāpahānagambhīrabhāvo,"
      },
      " tañca yathārahaṃ paridīpayeti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pariyattibheda"
      },
      "nti pariyāpuṇanabhedaṃ vibhāvayeti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yahiṃ"
      },
      " yasmiṃ vinayādike yaṃ sampattiñca vipattiñca yathā pāpuṇāti, tampi sabbaṃ vibhāvayeti sambandho. Atha vā yaṃ pariyattibhedaṃ sampattiṃ vipattiñca yahiṃ yathā pāpuṇāti, tampi sabbaṃ vibhāvayeti yojetabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paridīpanā vibhāvanā cā"
      },
      "ti heṭṭhā gāthāsu vuttassa anurūpato vuttaṃ, atthato pana ekameva."
    ],
    "innerText": "Desanāsāsanakathābhedanti ettha desanābhedaṃ sāsanabhedaṃ kathābhedanti bhedasaddo paccekaṃ yojetabbo. Bhedanti ca nānattanti attho. Tesūti piṭakesu. Sikkhā ca pahānāni ca gambhīrabhāvo ca sikkhāpahānagambhīrabhāvo, tañca yathārahaṃ paridīpayeti attho. Pariyattibhedanti pariyāpuṇanabhedaṃ vibhāvayeti sambandho. Yahiṃ yasmiṃ vinayādike yaṃ sampattiñca vipattiñca yathā pāpuṇāti, tampi sabbaṃ vibhāvayeti sambandho. Atha vā yaṃ pariyattibhedaṃ sampattiṃ vipattiñca yahiṃ yathā pāpuṇāti, tampi sabbaṃ vibhāvayeti yojetabbaṃ. Paridīpanā vibhāvanā cāti heṭṭhā gāthāsu vuttassa anurūpato vuttaṃ, atthato pana ekameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āṇārahenā"
      },
      "ti āṇaṃ paṇetuṃ arahatīti āṇāraho, bhagavā sammāsambuddhattā. So hi mahākāruṇikatāya ca aviparītato desakabhāvena pamāṇavacanattā ca āṇaṃ paṇetuṃ arahati. Vohāraparamatthānampi sambhavato āha ‘‘āṇābāhullato’’ti. Ito paresupi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭhama"
      },
      "nti vinayapiṭakaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pacurāparādhā"
      },
      " seyyasakattherādayo. Te hi dosabāhullato ‘‘pacurāparādhā’’ti vuttā ",
      ". Pacuro bahuko bahulo aparādho doso vītikkamo yesante pacurāparādhā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anekajjhāsayā"
      },
      "tiādīsu āsayova ajjhāsayo, so ca atthato diṭṭhi ñāṇañca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cariyā"
      },
      "ti rāgacariyādikā cha mūlacariyā. Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cariyā"
      },
      "ti caritaṃ, taṃ sucaritaduccaritavasena duvidhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adhimutti"
      },
      " nāma sattānaṃ pubbaparicayavasena abhiruci, sā duvidhā hīnapaṇītabhedena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathānuloma"
      },
      "nti ajjhāsayādīnaṃ anurūpaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathādhamma"
      },
      "nti dhammasabhāvānurūpaṃ."
    ],
    "innerText": "Āṇārahenāti āṇaṃ paṇetuṃ arahatīti āṇāraho, bhagavā sammāsambuddhattā. So hi mahākāruṇikatāya ca aviparītato desakabhāvena pamāṇavacanattā ca āṇaṃ paṇetuṃ arahati. Vohāraparamatthānampi sambhavato āha ‘‘āṇābāhullato’’ti. Ito paresupi eseva nayo. Paṭhamanti vinayapiṭakaṃ. Pacurāparādhā seyyasakattherādayo. Te hi dosabāhullato ‘‘pacurāparādhā’’ti vuttā . Pacuro bahuko bahulo aparādho doso vītikkamo yesante pacurāparādhā. Anekajjhāsayātiādīsu āsayova ajjhāsayo, so ca atthato diṭṭhi ñāṇañca. Cariyāti rāgacariyādikā cha mūlacariyā. Atha vā cariyāti caritaṃ, taṃ sucaritaduccaritavasena duvidhaṃ. Adhimutti nāma sattānaṃ pubbaparicayavasena abhiruci, sā duvidhā hīnapaṇītabhedena. Yathānulomanti ajjhāsayādīnaṃ anurūpaṃ. Yathādhammanti dhammasabhāvānurūpaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṃvarāsaṃvaro"
      },
      "ti ettha khuddako mahanto ca saṃvaroti attho. Vuḍḍhiattho hettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "a"
      },
      "-kāro. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Diṭṭhiviniveṭhanā"
      },
      "ti diṭṭhiyā vimocanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suttantapāḷiyaṃ"
      },
      " vivicceva kāmehītiādinā (dī. ni. 1.226; saṃ. ni. 2.152) samādhidesanābāhullato suttantapiṭake ‘‘adhicittasikkhā’’ti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vītikkamappahānaṃ kilesāna"
      },
      "nti saṃkilesadhammānaṃ, kammakilesānaṃ vā yo kāyavacīdvārehi vītikkamo, tassa pahānaṃ. Anusayavasena santānamanuvattantā kilesā pariyuṭṭhitāpi sīlabhedavasena vītikkamituṃ na labhantīti āha ‘‘vītikkamapaṭipakkhattā sīlassā’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pariyuṭṭhānappahāna"
      },
      "nti okāsadānavasena citte kusalappavattiṃ pariyādiyitvā samuppattivasena ṭhānaṃ pariyuṭṭhānaṃ, tassa pahānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anusayappahāna"
      },
      "nti ariyamaggena appahīnabhāvena santāne kāraṇalābhe uppajjanārahā thāmagatā kāmarāgādayo satta kilesā santāne anu anu sayanato anusayā nāma, tesaṃ pahānaṃ."
    ],
    "innerText": "Saṃvarāsaṃvaroti ettha khuddako mahanto ca saṃvaroti attho. Vuḍḍhiattho hettha a-kāro. Diṭṭhiviniveṭhanāti diṭṭhiyā vimocanaṃ. Suttantapāḷiyaṃ vivicceva kāmehītiādinā (dī. ni. 1.226; saṃ. ni. 2.152) samādhidesanābāhullato suttantapiṭake ‘‘adhicittasikkhā’’ti vuttaṃ. Vītikkamappahānaṃ kilesānanti saṃkilesadhammānaṃ, kammakilesānaṃ vā yo kāyavacīdvārehi vītikkamo, tassa pahānaṃ. Anusayavasena santānamanuvattantā kilesā pariyuṭṭhitāpi sīlabhedavasena vītikkamituṃ na labhantīti āha ‘‘vītikkamapaṭipakkhattā sīlassā’’ti. Pariyuṭṭhānappahānanti okāsadānavasena citte kusalappavattiṃ pariyādiyitvā samuppattivasena ṭhānaṃ pariyuṭṭhānaṃ, tassa pahānaṃ. Anusayappahānanti ariyamaggena appahīnabhāvena santāne kāraṇalābhe uppajjanārahā thāmagatā kāmarāgādayo satta kilesā santāne anu anu sayanato anusayā nāma, tesaṃ pahānaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tadaṅgappahāna"
      },
      "nti tena tena dānasīlādikusalaṅgena tassa tassa akusalaṅgassa pahānaṃ tadaṅgappahānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Duccaritasaṃkilesassa pahāna"
      },
      "nti kāyavacīduccaritameva yattha uppajjati, taṃ santānaṃ sammā ",
      " kileseti upatāpetīti saṃkileso, tassa tadaṅgavasena pahānaṃ. Samādhissa kāmacchandapaṭipakkhattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "suttantapiṭake"
      },
      " taṇhāsaṃkilesassa pahānaṃ vuttaṃ. Attādisuññasabhāvadhammappakāsanato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhidhammapiṭake"
      },
      " diṭṭhisaṃkilesassa pahānaṃ vuttaṃ."
    ],
    "innerText": "Tadaṅgappahānanti tena tena dānasīlādikusalaṅgena tassa tassa akusalaṅgassa pahānaṃ tadaṅgappahānaṃ. Duccaritasaṃkilesassa pahānanti kāyavacīduccaritameva yattha uppajjati, taṃ santānaṃ sammā kileseti upatāpetīti saṃkileso, tassa tadaṅgavasena pahānaṃ. Samādhissa kāmacchandapaṭipakkhattā suttantapiṭake taṇhāsaṃkilesassa pahānaṃ vuttaṃ. Attādisuññasabhāvadhammappakāsanato abhidhammapiṭake diṭṭhisaṃkilesassa pahānaṃ vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekamekasmiñcetthā"
      },
      "ti ettha etesu tīsu piṭakesu ekekasmiṃ piṭaketi attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammoti pāḷī"
      },
      "ti ettha dhammassa sīlādivisiṭṭhatthayogato, buddhānaṃ sabhāvaniruttibhāvato ca pakaṭṭhānaṃ ukkaṭṭhānaṃ vacanappabandhānaṃ ",
      " āḷi pantīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pāḷi,"
      },
      " pariyattidhammo. Sammutiparamatthabhedassa atthassa anurūpavācakabhāvena paramatthasaddesu ekantena bhagavatā manasā vavatthāpito nāmapaññattippabandho pāḷidhammo nāma. Desanāya dhammassa ca ko visesoti ce? Yathāvuttanayena manasā vavatthāpitadhammassa paresaṃ bodhanabhāvena atisajjanā vācāya pakāsanā ‘‘desanā’’ti veditabbā. Tenāha – ‘‘desanāti tassā manasā vavatthāpitāya pāḷiyā desanā’’ti. Tadubhayampi pana paramatthato saddo eva paramatthavinimuttāya sammutiyā abhāvā. Imameva nayaṃ gahetvā keci ācariyā ‘‘dhammo ca desanā ca paramatthato saddo evā’’ti voharanti, tepi anupavajjāyeva. Yathā ‘‘kāmāvacarapaṭisandhivipākā parittārammaṇā’’ti vuccanti, evaṃsampadamidaṃ daṭṭhabbaṃ. Na hi ‘‘kāmāvacarapaṭisandhivipākā nibbattitaparamatthavisayāyevā’’ti sakkā vattuṃ itthipurisādiākāraparivitakkapubbakānaṃ rāgādiakusalānaṃ mettādikusalānañca ārammaṇaṃ gahetvāpi samuppajjanato. Paramatthadhammamūlakattā panassa parikappassa paramatthavisayatā sakkā paññapetuṃ, evamidhāpīti daṭṭhabbaṃ. Tīsupi cetesu ete dhammatthadesanāpaṭivedhā gambhīrāti sambandho. Ettha ca piṭakāvayavānaṃ dhammādīnaṃ vuccamāno gambhīrabhāvo taṃsamudāyassa piṭakassāpi vutto yevāti daṭṭhabbo. Dukkhena ogayhanti, dukkho vā ogāho ogāhanaṃ antopavisanametesūti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dukkhogāhā. Etthā"
      },
      "ti etesu piṭakesu, niddhāraṇe cetaṃ bhummavacanaṃ."
    ],
    "innerText": "Ekamekasmiñcetthāti ettha etesu tīsu piṭakesu ekekasmiṃ piṭaketi attho. Dhammoti pāḷīti ettha dhammassa sīlādivisiṭṭhatthayogato, buddhānaṃ sabhāvaniruttibhāvato ca pakaṭṭhānaṃ ukkaṭṭhānaṃ vacanappabandhānaṃ āḷi pantīti pāḷi, pariyattidhammo. Sammutiparamatthabhedassa atthassa anurūpavācakabhāvena paramatthasaddesu ekantena bhagavatā manasā vavatthāpito nāmapaññattippabandho pāḷidhammo nāma. Desanāya dhammassa ca ko visesoti ce? Yathāvuttanayena manasā vavatthāpitadhammassa paresaṃ bodhanabhāvena atisajjanā vācāya pakāsanā ‘‘desanā’’ti veditabbā. Tenāha – ‘‘desanāti tassā manasā vavatthāpitāya pāḷiyā desanā’’ti. Tadubhayampi pana paramatthato saddo eva paramatthavinimuttāya sammutiyā abhāvā. Imameva nayaṃ gahetvā keci ācariyā ‘‘dhammo ca desanā ca paramatthato saddo evā’’ti voharanti, tepi anupavajjāyeva. Yathā ‘‘kāmāvacarapaṭisandhivipākā parittārammaṇā’’ti vuccanti, evaṃsampadamidaṃ daṭṭhabbaṃ. Na hi ‘‘kāmāvacarapaṭisandhivipākā nibbattitaparamatthavisayāyevā’’ti sakkā vattuṃ itthipurisādiākāraparivitakkapubbakānaṃ rāgādiakusalānaṃ mettādikusalānañca ārammaṇaṃ gahetvāpi samuppajjanato. Paramatthadhammamūlakattā panassa parikappassa paramatthavisayatā sakkā paññapetuṃ, evamidhāpīti daṭṭhabbaṃ. Tīsupi cetesu ete dhammatthadesanāpaṭivedhā gambhīrāti sambandho. Ettha ca piṭakāvayavānaṃ dhammādīnaṃ vuccamāno gambhīrabhāvo taṃsamudāyassa piṭakassāpi vutto yevāti daṭṭhabbo. Dukkhena ogayhanti, dukkho vā ogāho ogāhanaṃ antopavisanametesūti dukkhogāhā. Etthāti etesu piṭakesu, niddhāraṇe cetaṃ bhummavacanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Hetuno phalaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hetuphalaṃ. Dhammābhilāpo"
      },
      "ti atthabyañjanako aviparītābhilāpo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Visayato asammohato cā"
      },
      "ti lokiyalokuttarānaṃ yathākkamaṃ avabodhappakāradassanaṃ, etassa avabodhoti iminā sambandho. Lokiyo hi dhammatthādiṃ ālambitvāva pavattanato visayato avabodhoti vuccati. Lokuttaro pana nibbānārammaṇatāya taṃ anālambamānopi tabbisayamohaviddhaṃsanena dhammādīsu pavattanato asammohato avabodhoti vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atthānurūpaṃ dhammesū"
      },
      "ti kāriyānurūpaṃ kāraṇesūti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paññattipathānurūpaṃ paññattīsū"
      },
      "ti chabbidhanāmapaññattiyā patho paññattipatho, tassa anurūpaṃ paññattīsūti attho."
    ],
    "innerText": "Hetuno phalaṃ hetuphalaṃ. Dhammābhilāpoti atthabyañjanako aviparītābhilāpo. Visayato asammohato cāti lokiyalokuttarānaṃ yathākkamaṃ avabodhappakāradassanaṃ, etassa avabodhoti iminā sambandho. Lokiyo hi dhammatthādiṃ ālambitvāva pavattanato visayato avabodhoti vuccati. Lokuttaro pana nibbānārammaṇatāya taṃ anālambamānopi tabbisayamohaviddhaṃsanena dhammādīsu pavattanato asammohato avabodhoti vuccati. Atthānurūpaṃ dhammesūti kāriyānurūpaṃ kāraṇesūti attho. Paññattipathānurūpaṃ paññattīsūti chabbidhanāmapaññattiyā patho paññattipatho, tassa anurūpaṃ paññattīsūti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammajāta"
      },
      "nti ",
      " kāraṇappabhedo kāraṇameva vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atthajāta"
      },
      "nti kāriyappabhedo, kāriyameva vā. Yā cāyaṃ desanāti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yo cetthā"
      },
      "ti etāsu dhammatthadesanāsu yo paṭivedhoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etthā"
      },
      "ti etesu tīsu piṭakesu."
    ],
    "innerText": "Dhammajātanti kāraṇappabhedo kāraṇameva vā. Atthajātanti kāriyappabhedo, kāriyameva vā. Yā cāyaṃ desanāti sambandho. Yo cetthāti etāsu dhammatthadesanāsu yo paṭivedhoti attho. Etthāti etesu tīsu piṭakesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Alagaddūpamā"
      },
      "ti ettha alagaddasaddena alagaddaggahaṇaṃ vuccati vīṇāvādanaṃ vīṇātiādīsu viya, gahaṇañcettha yathā ḍaṃsati, tathā duggahaṇaṃ daṭṭhabbaṃ, itaraggahaṇe virodhābhāvā. Tasmā alagaddassa gahaṇaṃ upamā etissāti alagaddūpamā. Alagaddoti cettha āsiviso vuccati. So hi alaṃ pariyatto, jīvitaharaṇasamattho vā visasaṅkhāto gado assāti ‘‘alaṃgado’’ti vattabbe ‘‘alagaddo’’ti vuccati."
    ],
    "innerText": "Alagaddūpamāti ettha alagaddasaddena alagaddaggahaṇaṃ vuccati vīṇāvādanaṃ vīṇātiādīsu viya, gahaṇañcettha yathā ḍaṃsati, tathā duggahaṇaṃ daṭṭhabbaṃ, itaraggahaṇe virodhābhāvā. Tasmā alagaddassa gahaṇaṃ upamā etissāti alagaddūpamā. Alagaddoti cettha āsiviso vuccati. So hi alaṃ pariyatto, jīvitaharaṇasamattho vā visasaṅkhāto gado assāti ‘‘alaṃgado’’ti vattabbe ‘‘alagaddo’’ti vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vaṭṭato nissaraṇaṃ attho payojanaṃ etissāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nissaraṇatthā"
      },
      ". Bhaṇḍāgāriko viyāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhaṇḍāgāriko,"
      },
      " dhammaratanānupālako, tassa atthanirapekkhassa pariyatti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhaṇḍāgārikapariyatti. Duggahitānī"
      },
      "ti duṭṭhu gahitāni. Tenāha ‘‘upārambhādihetu pariyāpuṭā’’ti. Ettha ca upārambho nāma pariyattiṃ nissāya paravambhanaṃ. Ādi-saddena itivādappamokkhalābhasakkārādiṃ saṅgaṇhāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yaṃ sandhāyā"
      },
      "ti yaṃ pariyattiduggahaṇaṃ sandhāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vutta"
      },
      "nti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "alagaddūpamasutte"
      },
      " (ma. ni. 1.238) vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tañcassa atthaṃ nānubhontī"
      },
      "ti tañca assa dhammassa sīlaparipūraṇādisaṅkhātaṃ atthaṃ ete duggahitagāhino nānubhonti na vindanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭividdhākuppo"
      },
      "ti paṭividdhaarahattaphalo."
    ],
    "innerText": "Vaṭṭato nissaraṇaṃ attho payojanaṃ etissāti nissaraṇatthā. Bhaṇḍāgāriko viyāti bhaṇḍāgāriko, dhammaratanānupālako, tassa atthanirapekkhassa pariyatti bhaṇḍāgārikapariyatti. Duggahitānīti duṭṭhu gahitāni. Tenāha ‘‘upārambhādihetu pariyāpuṭā’’ti. Ettha ca upārambho nāma pariyattiṃ nissāya paravambhanaṃ. Ādi-saddena itivādappamokkhalābhasakkārādiṃ saṅgaṇhāti. Yaṃ sandhāyāti yaṃ pariyattiduggahaṇaṃ sandhāya. Vuttanti alagaddūpamasutte (ma. ni. 1.238) vuttaṃ. Tañcassa atthaṃ nānubhontīti tañca assa dhammassa sīlaparipūraṇādisaṅkhātaṃ atthaṃ ete duggahitagāhino nānubhonti na vindanti. Paṭividdhākuppoti paṭividdhaarahattaphalo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni tīsu piṭakesu yathārahaṃ sampattivipattiyo niddhāretvā dassento āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vinaye panā"
      },
      "tiādi. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tāsaṃyevā"
      },
      "ti avadhāraṇaṃ chaḷabhiññācatupaṭisambhidānaṃ vinaye pabhedavacanābhāvaṃ sandhāya vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Verañjakaṇḍe"
      },
      " (pārā. 12) hi tisso vijjāva vibhattā. Dutiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tāsaṃyevā"
      },
      "ti avadhāraṇaṃ catasso paṭisambhidā apekkhitvā kataṃ tissannampi vijjānaṃ chasu abhiññāsu antopaviṭṭhattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tāsañcā"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ca"
      },
      "-saddena sesānampi tattha atthibhāvaṃ dīpeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhidhammapiṭake"
      },
      " hi tisso vijjā cha abhiññā catasso paṭisambhidā ca vuttā eva. Paṭisambhidānaṃ tattheva sammā vibhattabhāvaṃ dīpetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tatthevā"
      },
      "ti avadhāraṇaṃ kataṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upādinnaphasso"
      },
      "ti maggena maggapaṭipādanaphasso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tesa"
      },
      "nti tesaṃ piṭakānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Eta"
      },
      "nti etaṃ buddhavacanaṃ."
    ],
    "innerText": "Idāni tīsu piṭakesu yathārahaṃ sampattivipattiyo niddhāretvā dassento āha vinaye panātiādi. Tattha tāsaṃyevāti avadhāraṇaṃ chaḷabhiññācatupaṭisambhidānaṃ vinaye pabhedavacanābhāvaṃ sandhāya vuttaṃ. Verañjakaṇḍe (pārā. 12) hi tisso vijjāva vibhattā. Dutiye tāsaṃyevāti avadhāraṇaṃ catasso paṭisambhidā apekkhitvā kataṃ tissannampi vijjānaṃ chasu abhiññāsu antopaviṭṭhattā. Tāsañcāti ettha ca-saddena sesānampi tattha atthibhāvaṃ dīpeti. Abhidhammapiṭake hi tisso vijjā cha abhiññā catasso paṭisambhidā ca vuttā eva. Paṭisambhidānaṃ tattheva sammā vibhattabhāvaṃ dīpetuṃ tatthevāti avadhāraṇaṃ kataṃ. Upādinnaphassoti maggena maggapaṭipādanaphasso. Tesanti tesaṃ piṭakānaṃ. Etanti etaṃ buddhavacanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Catuttiṃseva"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "suttantā"
      },
      "ti gāthāya ayamatthayojanā – yassa nikāyassa suttagaṇanato catuttiṃseva suttantā vaggasaṅgahavasena tayo vaggā yassa saṅgahassāti tivaggo saṅgaho, esa paṭhamo nikāyo idha dīghanikāyoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anulomiko"
      },
      "ti apaccanīko, atthānulomanato anvatthanāmoti ",
      " vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekanikāyampī"
      },
      "ti ekasamūhampi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ citta"
      },
      "nti evaṃ vicittaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathayida"
      },
      "nti yathā ime. Poṇikacikkhallikā khattiyā, tesaṃ nivāso ‘‘poṇikanikāyo cikkhallikanikāyo’’ti vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañcadasavaggapariggaho"
      },
      "ti pañcadasahi vaggehi pariggahito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suttantānaṃ sahassāni satta suttasatāni cā"
      },
      "ti pāṭhe suttantānaṃ sattasahassāni satta suttasatāni cāti yojetabbaṃ. Katthaci pana ‘‘satta suttasahassāni, satta suttasatāni cā’’ti pāṭho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pubbe nidassitā"
      },
      "ti suttantapiṭakaniddese nidassitā."
    ],
    "innerText": "Catuttiṃsevasuttantāti gāthāya ayamatthayojanā – yassa nikāyassa suttagaṇanato catuttiṃseva suttantā vaggasaṅgahavasena tayo vaggā yassa saṅgahassāti tivaggo saṅgaho, esa paṭhamo nikāyo idha dīghanikāyoti. Anulomikoti apaccanīko, atthānulomanato anvatthanāmoti vuttaṃ hoti. Ekanikāyampīti ekasamūhampi. Evaṃ cittanti evaṃ vicittaṃ. Yathayidanti yathā ime. Poṇikacikkhallikā khattiyā, tesaṃ nivāso ‘‘poṇikanikāyo cikkhallikanikāyo’’ti vuccati. Pañcadasavaggapariggahoti pañcadasahi vaggehi pariggahito. Suttantānaṃ sahassāni satta suttasatāni cāti pāṭhe suttantānaṃ sattasahassāni satta suttasatāni cāti yojetabbaṃ. Katthaci pana ‘‘satta suttasahassāni, satta suttasatāni cā’’ti pāṭho. Pubbe nidassitāti suttantapiṭakaniddese nidassitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Veda"
      },
      "nti ñāṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tuṭṭhi"
      },
      "nti pītiṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammakkhandhavasenā"
      },
      "ti dhammarāsivasena. Dvāsītisahassāni buddhato gaṇhinti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dve sahassāni bhikkhuto"
      },
      "ti dhammasenāpatiādīnaṃ bhikkhūnaṃ santikā tehiyeva desitāni dve sahassāni gaṇhiṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Me"
      },
      "ti mama hadaye, iti ānandatthero attānaṃ niddisati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ye dhammā"
      },
      " mama hadaye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pavattino,"
      },
      " te ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "caturāsītisahassānī"
      },
      "ti yojanā. Idañca bhagavato dharamānakāle uggahitadhammakkhandhavasena vuttaṃ, parinibbute pana bhagavati ānandattherena desitānaṃ subhasutta(daī. ni. 1.444 ādayo) gopakamoggallānasuttānaṃ (ma. ni. 3.79 ādayo), tatiyasaṅgītiyaṃ moggaliputtatissattherena kathitakathāvatthuppakaraṇassa ca vasena dhammakkhandhānaṃ caturāsītisahassatopi adhikatā veditabbā."
    ],
    "innerText": "Vedanti ñāṇaṃ. Tuṭṭhinti pītiṃ. Dhammakkhandhavasenāti dhammarāsivasena. Dvāsītisahassāni buddhato gaṇhinti sambandho. Dve sahassāni bhikkhutoti dhammasenāpatiādīnaṃ bhikkhūnaṃ santikā tehiyeva desitāni dve sahassāni gaṇhiṃ. Meti mama hadaye, iti ānandatthero attānaṃ niddisati. Ye dhammā mama hadaye pavattino, te caturāsītisahassānīti yojanā. Idañca bhagavato dharamānakāle uggahitadhammakkhandhavasena vuttaṃ, parinibbute pana bhagavati ānandattherena desitānaṃ subhasutta(daī. ni. 1.444 ādayo) gopakamoggallānasuttānaṃ (ma. ni. 3.79 ādayo), tatiyasaṅgītiyaṃ moggaliputtatissattherena kathitakathāvatthuppakaraṇassa ca vasena dhammakkhandhānaṃ caturāsītisahassatopi adhikatā veditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekānusandhikaṃ sutta"
      },
      "nti satipaṭṭhānādi (dī. ni. 2.372 ādayo; ma. ni. 1.105 ādayo). ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anekānusandhika"
      },
      "nti parinibbānasuttādi (dī. ni. 2.134 ādayo). Tañhi nānāṭhānesu nānādhammadesanānaṃ vasena pavattaṃ. Tikadukabhājanaṃ dhammasaṅgaṇiyaṃ nikkhepakaṇḍa(dha. sa. 985 ādayo) aṭṭhakathākaṇḍavasena (dha. sa. 1384 ādayo) gahetabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cittavārabhājana"
      },
      "nti idaṃ cittuppādakaṇḍavasena (dha. sa. 1 ādayo) vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atthi vatthū"
      },
      "tiādīsu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vatthu"
      },
      " nāma sudinnakaṇḍādi (pārā. 24 ādayo). ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mātikā"
      },
      "ti sikkhāpadaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Antarāpattī"
      },
      "ti sikkhāpadantaresu aññasmiṃ vatthusmiṃ paññattā āpatti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tikacchedo"
      },
      "ti tikapācittiyāditikaparicchedo ",
      ". Buddhavacanaṃ saṅgahitanti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Assā"
      },
      "ti buddhavacanassa. Saṅgītipariyosāne sādhukāraṃ dadamānā viyāti sambandho. Accharaṃ paharituṃ yuttāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "acchariyāni,"
      },
      " pupphavassacelukkhepādīni. Yā ‘‘pañcasatā’’ti ca ‘‘therikā’’ti ca pavuccati, ayaṃ paṭhamamahāsaṅgīti nāmāti sambandho."
    ],
    "innerText": "Ekānusandhikaṃ suttanti satipaṭṭhānādi (dī. ni. 2.372 ādayo; ma. ni. 1.105 ādayo). Anekānusandhikanti parinibbānasuttādi (dī. ni. 2.134 ādayo). Tañhi nānāṭhānesu nānādhammadesanānaṃ vasena pavattaṃ. Tikadukabhājanaṃ dhammasaṅgaṇiyaṃ nikkhepakaṇḍa(dha. sa. 985 ādayo) aṭṭhakathākaṇḍavasena (dha. sa. 1384 ādayo) gahetabbaṃ. Cittavārabhājananti idaṃ cittuppādakaṇḍavasena (dha. sa. 1 ādayo) vuttaṃ. Atthi vatthūtiādīsu vatthu nāma sudinnakaṇḍādi (pārā. 24 ādayo). Mātikāti sikkhāpadaṃ. Antarāpattīti sikkhāpadantaresu aññasmiṃ vatthusmiṃ paññattā āpatti. Tikacchedoti tikapācittiyāditikaparicchedo . Buddhavacanaṃ saṅgahitanti sambandho. Assāti buddhavacanassa. Saṅgītipariyosāne sādhukāraṃ dadamānā viyāti sambandho. Accharaṃ paharituṃ yuttāni acchariyāni, pupphavassacelukkhepādīni. Yā ‘‘pañcasatā’’ti ca ‘‘therikā’’ti ca pavuccati, ayaṃ paṭhamamahāsaṅgīti nāmāti sambandho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti samantapāsādikāya vinayaṭṭhakathāya vimativinodaniyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṭhamamahāsaṅgītikathāvaṇṇanānayo niṭṭhito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Dutiyasaṅgītikathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ ",
      " paṭhamamahāsaṅgītiṃ dassetvā yadatthaṃ sā idha dassitā, taṃ nigamanavasena dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "imissā"
      },
      "tiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatrāyaṃ ācariyaparamparā"
      },
      "ti tasmiṃ jambudīpe ayaṃ ācariyānaṃ paveṇī paṭipāṭi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vijitāvino"
      },
      "ti vijitasabbakilesapaṭipakkhattā vijitavanto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jambusirivhaye"
      },
      "ti jambusadiso sirimanto avhayo nāmaṃ yassa dīpassa, tasmiṃ jambudīpeti vuttaṃ hoti. Mahantena hi jamburukkhena abhilakkhitattā dīpopi ‘‘jambū’’ti vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Acchijjamānaṃ"
      },
      " avinassamānaṃ katvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vinayavaṃsa"
      },
      "ntiādīhi tīhi vinayapāḷiyeva kathitā pariyāyavacanattā tesaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pakataññuta"
      },
      "nti veyyattiyaṃ, paṭubhāvanti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhuraggāho"
      },
      "ti padhānaggāhī, sabbesaṃ pāmokkho hutvā gaṇhīti vuttaṃ hoti. Bhikkhūnaṃ samudāyo samūho ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhikkhusamudāyo"
      },
      "."
    ],
    "innerText": "Evaṃ paṭhamamahāsaṅgītiṃ dassetvā yadatthaṃ sā idha dassitā, taṃ nigamanavasena dassento imissātiādimāha. Tatrāyaṃ ācariyaparamparāti tasmiṃ jambudīpe ayaṃ ācariyānaṃ paveṇī paṭipāṭi. Vijitāvinoti vijitasabbakilesapaṭipakkhattā vijitavanto. Jambusirivhayeti jambusadiso sirimanto avhayo nāmaṃ yassa dīpassa, tasmiṃ jambudīpeti vuttaṃ hoti. Mahantena hi jamburukkhena abhilakkhitattā dīpopi ‘‘jambū’’ti vuccati. Acchijjamānaṃ avinassamānaṃ katvā. Vinayavaṃsantiādīhi tīhi vinayapāḷiyeva kathitā pariyāyavacanattā tesaṃ. Pakataññutanti veyyattiyaṃ, paṭubhāvanti vuttaṃ hoti. Dhuraggāhoti padhānaggāhī, sabbesaṃ pāmokkho hutvā gaṇhīti vuttaṃ hoti. Bhikkhūnaṃ samudāyo samūho bhikkhusamudāyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yadā"
      },
      "ti nibbāyiṃsūti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jotayitvā ca sabbadhī"
      },
      "ti tameva saddhammaṃ sabbattha pakāsayitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jutimanto"
      },
      "ti paññājutiyā yuttā, tejavanto vā, mahānubhāvāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nibbāyiṃsū"
      },
      "ti anupādisesāya nibbānadhātuyā nibbāyiṃsu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anālayā"
      },
      "ti asaṅgā."
    ],
    "innerText": "Yadāti nibbāyiṃsūti sambandho. Jotayitvā ca sabbadhīti tameva saddhammaṃ sabbattha pakāsayitvā. Jutimantoti paññājutiyā yuttā, tejavanto vā, mahānubhāvāti attho. Nibbāyiṃsūti anupādisesāya nibbānadhātuyā nibbāyiṃsu. Anālayāti asaṅgā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Athā"
      },
      "ti pacchā, yadā parinibbāyiṃsu, tato paranti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kappati siṅgīloṇakappo"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kappa"
      },
      "-saddo vikappattho, tena siṅgīloṇavikappopi kappati. Idampi pakkhantaraṃ kappatīti attho, evaṃ sabbattha. Tattha siṅgena loṇaṃ pariharitvā aloṇakapiṇḍapātena saddhiṃ bhuñjituṃ kappati ",
      ", sannidhiṃ na karotīti adhippāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kappati dvaṅgulakappo"
      },
      "ti dvaṅgulaṃ atikkantāya chāyāya vikāle bhojanaṃ bhuñjituṃ kappatīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kappati gāmantarakappo"
      },
      "ti ‘‘gāmantaraṃ gamissāmī’’ti pavāritena anatirittabhojanaṃ bhuñjituṃ kappatīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kappati āvāsakappo"
      },
      "ti ekasīmāya nānāsenāsanesu visuṃ visuṃ uposathādīni saṅghakammāni kātuṃ vaṭṭatīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kappati anumatikappo"
      },
      "ti ‘‘anāgatānaṃ āgatakāle anumatiṃ gahessāmā’’ti tesu anāgatesuyeva vaggena saṅghena kammaṃ katvā pacchā anumatiṃ gahetuṃ kappati, vaggakammaṃ na hotīti adhippāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kappati āciṇṇakappo"
      },
      "ti ācariyupajjhāyehi āciṇṇo kappatīti attho. So pana ekacco kappati dhammiko, ekacco na kappati adhammikoti veditabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kappati amathitakappo"
      },
      "ti yaṃ khīraṃ khīrabhāvaṃ vijahitaṃ dadhibhāvaṃ asampattaṃ, taṃ bhuttāvinā pavāritena anatirittaṃ bhuñjituṃ kappatīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kappati jaḷogiṃ pātu"
      },
      "nti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jaḷogī"
      },
      "ti taruṇasurā, yaṃ majjasambhāraṃ ekato kataṃ majjabhāvamasampattaṃ, taṃ pātuṃ vaṭṭatīti adhippāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jātarūparajata"
      },
      "nti ettha sarasato vikāraṃ anāpajjitvā sabbadā jātarūpameva hotīti jātaṃ rūpaṃ ",
      " etassāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jātarūpaṃ,"
      },
      " suvaṇṇaṃ. Dhavalasabhāvatāya rājatīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rajataṃ,"
      },
      " rūpiyaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Susunāgaputto"
      },
      "ti susunāgassa putto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kākaṇḍakaputto"
      },
      "ti kākaṇḍakassa brāhmaṇassa putto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vajjīsū"
      },
      "ti janapadanāmattā bahuvacanaṃ kataṃ."
    ],
    "innerText": "Athāti pacchā, yadā parinibbāyiṃsu, tato paranti attho. Kappati siṅgīloṇakappoti ettha kappa-saddo vikappattho, tena siṅgīloṇavikappopi kappati. Idampi pakkhantaraṃ kappatīti attho, evaṃ sabbattha. Tattha siṅgena loṇaṃ pariharitvā aloṇakapiṇḍapātena saddhiṃ bhuñjituṃ kappati , sannidhiṃ na karotīti adhippāyo. Kappati dvaṅgulakappoti dvaṅgulaṃ atikkantāya chāyāya vikāle bhojanaṃ bhuñjituṃ kappatīti attho. Kappati gāmantarakappoti ‘‘gāmantaraṃ gamissāmī’’ti pavāritena anatirittabhojanaṃ bhuñjituṃ kappatīti attho. Kappati āvāsakappoti ekasīmāya nānāsenāsanesu visuṃ visuṃ uposathādīni saṅghakammāni kātuṃ vaṭṭatīti attho. Kappati anumatikappoti ‘‘anāgatānaṃ āgatakāle anumatiṃ gahessāmā’’ti tesu anāgatesuyeva vaggena saṅghena kammaṃ katvā pacchā anumatiṃ gahetuṃ kappati, vaggakammaṃ na hotīti adhippāyo. Kappati āciṇṇakappoti ācariyupajjhāyehi āciṇṇo kappatīti attho. So pana ekacco kappati dhammiko, ekacco na kappati adhammikoti veditabbo. Kappati amathitakappoti yaṃ khīraṃ khīrabhāvaṃ vijahitaṃ dadhibhāvaṃ asampattaṃ, taṃ bhuttāvinā pavāritena anatirittaṃ bhuñjituṃ kappatīti attho. Kappati jaḷogiṃ pātunti ettha jaḷogīti taruṇasurā, yaṃ majjasambhāraṃ ekato kataṃ majjabhāvamasampattaṃ, taṃ pātuṃ vaṭṭatīti adhippāyo. Jātarūparajatanti ettha sarasato vikāraṃ anāpajjitvā sabbadā jātarūpameva hotīti jātaṃ rūpaṃ etassāti jātarūpaṃ, suvaṇṇaṃ. Dhavalasabhāvatāya rājatīti rajataṃ, rūpiyaṃ. Susunāgaputtoti susunāgassa putto. Kākaṇḍakaputtoti kākaṇḍakassa brāhmaṇassa putto. Vajjīsūti janapadanāmattā bahuvacanaṃ kataṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tadahuposathe"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tadahū"
      },
      "ti tasmiṃ ahani. Upavasanti etthāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uposatho,"
      },
      " upavasantīti ca sīlasamādānena vā anasanādinā vā upetā hutvā vasantīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kaṃsapāti"
      },
      "nti suvaṇṇapātiṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Māsakarūpa"
      },
      "nti māsako eva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbaṃ tāva vattabba"
      },
      "nti iminā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sattasatikakkhandhake"
      },
      " (cūḷava. 446 ādayo) āgatā sabbāpi pāḷi idha ānetvā vattabbāti dasseti. Saṅgāyitasadisameva saṅgāyiṃsūti sambandho."
    ],
    "innerText": "Tadahuposatheti ettha tadahūti tasmiṃ ahani. Upavasanti etthāti uposatho, upavasantīti ca sīlasamādānena vā anasanādinā vā upetā hutvā vasantīti attho. Kaṃsapātinti suvaṇṇapātiṃ. Māsakarūpanti māsako eva. Sabbaṃ tāva vattabbanti iminā sattasatikakkhandhake (cūḷava. 446 ādayo) āgatā sabbāpi pāḷi idha ānetvā vattabbāti dasseti. Saṅgāyitasadisameva saṅgāyiṃsūti sambandho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sā panāyaṃ saṅgītīti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tesū"
      },
      "ti tesu saṅgītikārakesu theresu. Vissutā ete saddhivihārikā ñeyyāti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sāṇasambhūto"
      },
      "ti sāṇadesavāsī sambhūtatthero. Dutiyo saṅgahoti sambandhitabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pannabhārā"
      },
      "ti patitakkhandhabhārā."
    ],
    "innerText": "Sā panāyaṃ saṅgītīti sambandho. Tesūti tesu saṅgītikārakesu theresu. Vissutā ete saddhivihārikā ñeyyāti sambandho. Sāṇasambhūtoti sāṇadesavāsī sambhūtatthero. Dutiyo saṅgahoti sambandhitabbaṃ. Pannabhārāti patitakkhandhabhārā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abbuda"
      },
      "nti ",
      " upaddavaṃ vadanti. ‘‘Bhagavato vacanaṃ thenetvā attano vacanassa dīpanato abbudanti corakamma’’nti eke. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ida"
      },
      "nti vakkhamānanidassanaṃ. Sandissamānā mukhā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammukhā. Bhāvitamagga"
      },
      "nti uppāditajjhānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sādhu sappurisā"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sādhū"
      },
      "ti āyācanatthe nipāto, taṃ yācāmīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Haṭṭhapahaṭṭho"
      },
      "ti punappunaṃ santuṭṭho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Udaggudaggo"
      },
      "ti sarīravikāruppādanapītivasena udaggudaggo, pītimā hi puggalo kāyacittānaṃ uggatattā ‘‘udaggudaggo’’ti vuccati."
    ],
    "innerText": "Abbudanti upaddavaṃ vadanti. ‘‘Bhagavato vacanaṃ thenetvā attano vacanassa dīpanato abbudanti corakamma’’nti eke. Idanti vakkhamānanidassanaṃ. Sandissamānā mukhā sammukhā. Bhāvitamagganti uppāditajjhānaṃ. Sādhu sappurisāti ettha sādhūti āyācanatthe nipāto, taṃ yācāmīti attho. Haṭṭhapahaṭṭhoti punappunaṃ santuṭṭho. Udaggudaggoti sarīravikāruppādanapītivasena udaggudaggo, pītimā hi puggalo kāyacittānaṃ uggatattā ‘‘udaggudaggo’’ti vuccati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tena kho pana samayenā"
      },
      "ti yasmiṃ samaye dutiyaṃ saṅgītiṃ akariṃsu, tasmiṃ samayeti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃ adhikaraṇaṃ na sampāpuṇiṃsū"
      },
      "ti taṃ vajjiputtakehi uppāditaṃ adhikaraṇaṃ vinicchinituṃ na sampāpuṇiṃsu nāgamiṃsu. No ahuvatthāti sambandho. Yāvatāyukaṃ ṭhatvā parinibbutāti sambandho. Kiṃ pana katvā therā parinibbutāti? Āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dutiyaṃ saṅgahaṃ katvā"
      },
      "tiādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aniccatāvasa"
      },
      "nti aniccatādhīnataṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jammi"
      },
      "nti lāmakaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Durabhisambhavaṃ"
      },
      " anabhibhavanīyaṃ atikkamituṃ asakkuṇeyyaṃ aniccataṃ evaṃ ñatvāti sambandho."
    ],
    "innerText": "Tena kho pana samayenāti yasmiṃ samaye dutiyaṃ saṅgītiṃ akariṃsu, tasmiṃ samayeti attho. Taṃ adhikaraṇaṃ na sampāpuṇiṃsūti taṃ vajjiputtakehi uppāditaṃ adhikaraṇaṃ vinicchinituṃ na sampāpuṇiṃsu nāgamiṃsu. No ahuvatthāti sambandho. Yāvatāyukaṃ ṭhatvā parinibbutāti sambandho. Kiṃ pana katvā therā parinibbutāti? Āha dutiyaṃ saṅgahaṃ katvātiādi. Aniccatāvasanti aniccatādhīnataṃ. Jamminti lāmakaṃ. Durabhisambhavaṃ anabhibhavanīyaṃ atikkamituṃ asakkuṇeyyaṃ aniccataṃ evaṃ ñatvāti sambandho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dutiyasaṅgītikathāvaṇṇanānayo niṭṭhito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Tatiyasaṅgītikathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Satta"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vassānī"
      },
      "ti accantasaṃyoge upayogavacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aticchathā"
      },
      "ti atikkamitvā icchatha, ito aññattha gantvā bhikkhaṃ pariyesathāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhattavissaggakaraṇatthāyā"
      },
      "ti bhattassa ajjhoharaṇakiccatthāya, bhuñjanatthāyāti attho. ‘‘Soḷasavasso’’ti uddeso kathanaṃ assa atthīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "soḷasavassuddesiko,"
      },
      " ‘‘soḷasavassiko’’ti attho."
    ],
    "innerText": "Sattavassānīti accantasaṃyoge upayogavacanaṃ. Aticchathāti atikkamitvā icchatha, ito aññattha gantvā bhikkhaṃ pariyesathāti attho. Bhattavissaggakaraṇatthāyāti bhattassa ajjhoharaṇakiccatthāya, bhuñjanatthāyāti attho. ‘‘Soḷasavasso’’ti uddeso kathanaṃ assa atthīti soḷasavassuddesiko, ‘‘soḷasavassiko’’ti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tīsu vedesū"
      },
      "tiādīsu iruvedayajuvedasāmavedasaṅkhātesu tīsu vedesu. Tayo eva kira vedā aṭṭhakādīhi dhammikehi isīhi lokassa saggamaggavibhāvanatthāya katā. Teneva hi te tehi vuccanti. Āthabbaṇavedo pana pacchā adhammikehi brāhmaṇehi pāṇavadhādiatthāya kato. Purimesu ca tīsu vedesu teheva dhammikasākhāyo apanetvā yāgavadhādidīpikā adhammikasākhā pakkhittāti veditabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nighaṇḍū"
      },
      "ti rukkhādīnaṃ vevacanappakāsakaṃ pariyāyanāmānurūpaṃ satthaṃ. Tañhi loke ‘‘nighaṇḍū’’ti ",
      " vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Keṭubha"
      },
      "nti kiṭati gameti kiriyādivibhāganti keṭubhaṃ, kiriyākappavikappo kavīnaṃ upakārasatthaṃ. Ettha ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kiriyākappavikappo"
      },
      "ti vacībhedādilakkhaṇā kiriyā kappīyati vikappīyati etenāti kiriyākappo, so pana vaṇṇapadabandhapadatthādivibhāgato bahuvikappoti ‘‘kiriyākappavikappo’’ti vuccati. Idañca mūlakiriyākappaganthaṃ sandhāya vuttaṃ. Saha nighaṇḍunā keṭubhena ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sanighaṇḍukeṭubhā,"
      },
      " tayo vedā, tesu sanighaṇḍukeṭubhesu. Ṭhānakaraṇādivibhāgato ca nibbacanavibhāgato ca akkharā pabhedīyanti etenāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "akkharappabhedo,"
      },
      " sikkhā ca nirutti ca. Saha akkharappabhedenāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sākkharappabhedā,"
      },
      " tesu sākkharappabhedesu. Āthabbaṇavedaṃ catutthaṃ katvā ‘‘itiha āsa itiha āsā’’ti īdisavacanapaṭisaṃyutto porāṇakathāsaṅkhāto itihāso pañcamo etesanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "itihāsapañcamā,"
      },
      " tayo vedā, tesu itihāsapañcamesu."
    ],
    "innerText": "Tīsu vedesūtiādīsu iruvedayajuvedasāmavedasaṅkhātesu tīsu vedesu. Tayo eva kira vedā aṭṭhakādīhi dhammikehi isīhi lokassa saggamaggavibhāvanatthāya katā. Teneva hi te tehi vuccanti. Āthabbaṇavedo pana pacchā adhammikehi brāhmaṇehi pāṇavadhādiatthāya kato. Purimesu ca tīsu vedesu teheva dhammikasākhāyo apanetvā yāgavadhādidīpikā adhammikasākhā pakkhittāti veditabbā. Nighaṇḍūti rukkhādīnaṃ vevacanappakāsakaṃ pariyāyanāmānurūpaṃ satthaṃ. Tañhi loke ‘‘nighaṇḍū’’ti vuccati. Keṭubhanti kiṭati gameti kiriyādivibhāganti keṭubhaṃ, kiriyākappavikappo kavīnaṃ upakārasatthaṃ. Ettha ca kiriyākappavikappoti vacībhedādilakkhaṇā kiriyā kappīyati vikappīyati etenāti kiriyākappo, so pana vaṇṇapadabandhapadatthādivibhāgato bahuvikappoti ‘‘kiriyākappavikappo’’ti vuccati. Idañca mūlakiriyākappaganthaṃ sandhāya vuttaṃ. Saha nighaṇḍunā keṭubhena ca sanighaṇḍukeṭubhā, tayo vedā, tesu sanighaṇḍukeṭubhesu. Ṭhānakaraṇādivibhāgato ca nibbacanavibhāgato ca akkharā pabhedīyanti etenāti akkharappabhedo, sikkhā ca nirutti ca. Saha akkharappabhedenāti sākkharappabhedā, tesu sākkharappabhedesu. Āthabbaṇavedaṃ catutthaṃ katvā ‘‘itiha āsa itiha āsā’’ti īdisavacanapaṭisaṃyutto porāṇakathāsaṅkhāto itihāso pañcamo etesanti itihāsapañcamā, tayo vedā, tesu itihāsapañcamesu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yassa citta"
      },
      "ntiādi pañhadvayaṃ khīṇāsavānaṃ cuticittassa uppādakkhaṇaṃ sandhāya vuttaṃ. Tattha paṭhamapañhe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uppajjatī"
      },
      "ti uppādakkhaṇasamaṅgitāya uppajjati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na nirujjhatī"
      },
      "ti nirodhakkhaṇaṃ appattatāya na nirujjhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tassa citta"
      },
      "nti tassa puggalassa taṃ cittaṃ kiṃ nirujjhissati āyatiñca nuppajjissatīti pucchā, tassā ca vibhajjabyākaraṇīyatāya evamettha vissajjanaṃ veditabbaṃ. Arahato pacchimacittassa uppādakkhaṇe tassa cittaṃ uppajjati, na nirujjhati, āyatiñca nuppajjissati, avassameva nirodhakkhaṇaṃ patvā nirujjhissati, tato appaṭisandhikattā aññaṃ nuppajjissati. Ṭhapetvā pana pacchimacittasamaṅgiṃ khīṇāsavaṃ itaresaṃ uppādakkhaṇasamaṅgicittaṃ ",
      " uppādakkhaṇasamaṅgitāya uppajjati bhaṅgaṃ appattatāya na nirujjhati, bhaṅgaṃ pana patvā nirujjhissateva, aññaṃ pana tasmiṃ vā aññasmiṃ vā attabhāve uppajjissati ceva nirujjhissati cāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yassa vā panā"
      },
      "tiādi dutiyapañhe pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nirujjhissati nuppajjissatī"
      },
      "ti yassa cittaṃ uppādakkhaṇasamaṅgitāya bhaṅgakkhaṇaṃ patvā nirujjhissati appaṭisandhikatāya nuppajjissati, tassa khīṇāsavassa taṃ cittaṃ kiṃ uppajjati na nirujjhatīti pucchā, tassā ekaṃsabyākaraṇīyatāya ‘‘āmantā’’ti vissajjanaṃ veditabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uddhaṃ vā adho vā harituṃ asakkonto"
      },
      "ti uparimapade vā heṭṭhimapadaṃ heṭṭhimapade vā uparimapadaṃ atthato samannāharituṃ ghaṭetuṃ pubbenāparaṃ yojetvā atthaṃ paricchindituṃ asakkontoti attho."
    ],
    "innerText": "Yassa cittantiādi pañhadvayaṃ khīṇāsavānaṃ cuticittassa uppādakkhaṇaṃ sandhāya vuttaṃ. Tattha paṭhamapañhe uppajjatīti uppādakkhaṇasamaṅgitāya uppajjati. Na nirujjhatīti nirodhakkhaṇaṃ appattatāya na nirujjhati. Tassa cittanti tassa puggalassa taṃ cittaṃ kiṃ nirujjhissati āyatiñca nuppajjissatīti pucchā, tassā ca vibhajjabyākaraṇīyatāya evamettha vissajjanaṃ veditabbaṃ. Arahato pacchimacittassa uppādakkhaṇe tassa cittaṃ uppajjati, na nirujjhati, āyatiñca nuppajjissati, avassameva nirodhakkhaṇaṃ patvā nirujjhissati, tato appaṭisandhikattā aññaṃ nuppajjissati. Ṭhapetvā pana pacchimacittasamaṅgiṃ khīṇāsavaṃ itaresaṃ uppādakkhaṇasamaṅgicittaṃ uppādakkhaṇasamaṅgitāya uppajjati bhaṅgaṃ appattatāya na nirujjhati, bhaṅgaṃ pana patvā nirujjhissateva, aññaṃ pana tasmiṃ vā aññasmiṃ vā attabhāve uppajjissati ceva nirujjhissati cāti. Yassa vā panātiādi dutiyapañhe pana nirujjhissati nuppajjissatīti yassa cittaṃ uppādakkhaṇasamaṅgitāya bhaṅgakkhaṇaṃ patvā nirujjhissati appaṭisandhikatāya nuppajjissati, tassa khīṇāsavassa taṃ cittaṃ kiṃ uppajjati na nirujjhatīti pucchā, tassā ekaṃsabyākaraṇīyatāya ‘‘āmantā’’ti vissajjanaṃ veditabbaṃ. Uddhaṃ vā adho vā harituṃ asakkontoti uparimapade vā heṭṭhimapadaṃ heṭṭhimapade vā uparimapadaṃ atthato samannāharituṃ ghaṭetuṃ pubbenāparaṃ yojetvā atthaṃ paricchindituṃ asakkontoti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sotāpannānaṃ ",
      " sīlesu paripūrakāritāya samādinnasīlato natthi parihānīti āha ‘‘abhabbo dāni sāsanato nivattitu’’nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vaḍḍhetvā"
      },
      "ti uparimaggatthāya kammaṭṭhānaṃ vaḍḍhetvā. Dante punanti visodhenti etenāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dantaponaṃ"
      },
      " vuccati dantakaṭṭhaṃ. Abhinavānaṃ āgantukānaṃ lajjīsabhāvaṃ khantimettādiguṇasamaṅgitañca katipāhaṃ suṭṭhu vīmaṃsitvāva hatthakammādisampaṭicchanaṃ saṅgahakaraṇañca yuttanti sāmaṇerassa ceva aññesañca bhikkhūnaṃ diṭṭhānugatiṃ āpajjantānaṃ ñāpanatthaṃ thero tassa bhabbarūpataṃ abhiññāya ñatvāpi puna sammajjanādiṃ akāsi. ‘‘Tassa cittadamanattha’’ntipi vadanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Buddhavacanaṃ paṭṭhapesī"
      },
      "ti buddhavacanaṃ uggaṇhāpetuṃ ārabhi. Sakalavinayācārapaṭipatti upasampannānameva vihitāti tappariyāpuṇanamapi tesaññeva anurūpanti āha ‘‘ṭhapetvā vinayapiṭaka’’nti. Tassa citte ṭhapitampi buddhavacanaṃ saṅgopanatthāya niyyātitabhāvaṃ dassetuṃ ‘‘hatthe patiṭṭhāpetvā’’ti vuttaṃ."
    ],
    "innerText": "Sotāpannānaṃ sīlesu paripūrakāritāya samādinnasīlato natthi parihānīti āha ‘‘abhabbo dāni sāsanato nivattitu’’nti. Vaḍḍhetvāti uparimaggatthāya kammaṭṭhānaṃ vaḍḍhetvā. Dante punanti visodhenti etenāti dantaponaṃ vuccati dantakaṭṭhaṃ. Abhinavānaṃ āgantukānaṃ lajjīsabhāvaṃ khantimettādiguṇasamaṅgitañca katipāhaṃ suṭṭhu vīmaṃsitvāva hatthakammādisampaṭicchanaṃ saṅgahakaraṇañca yuttanti sāmaṇerassa ceva aññesañca bhikkhūnaṃ diṭṭhānugatiṃ āpajjantānaṃ ñāpanatthaṃ thero tassa bhabbarūpataṃ abhiññāya ñatvāpi puna sammajjanādiṃ akāsi. ‘‘Tassa cittadamanattha’’ntipi vadanti. Buddhavacanaṃ paṭṭhapesīti buddhavacanaṃ uggaṇhāpetuṃ ārabhi. Sakalavinayācārapaṭipatti upasampannānameva vihitāti tappariyāpuṇanamapi tesaññeva anurūpanti āha ‘‘ṭhapetvā vinayapiṭaka’’nti. Tassa citte ṭhapitampi buddhavacanaṃ saṅgopanatthāya niyyātitabhāvaṃ dassetuṃ ‘‘hatthe patiṭṭhāpetvā’’ti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekarajjābhiseka"
      },
      "nti sakalajambudīpe ekādhipaccavasena kariyamānaṃ abhisekaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rājiddhiyo"
      },
      "ti rājānubhāvānugatappabhāvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yato"
      },
      "ti yato soḷasaghaṭato. Devatā eva divase divase āharantīti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Devasika"
      },
      "nti divase divase. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Agadāmalaka"
      },
      "nti appakeneva sarīrasodhanādisamatthaṃ sabbadosaharaṃ osadhāmalakaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Chaddantadahato"
      },
      "ti chaddantadahasamīpe ṭhitadevavimānato, kapparukkhato vā, tattha tādisā kapparukkhavisesā santi, tato vā āharantīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asuttamayika"
      },
      "nti suttehi abaddhaṃ dibbasumanapuppheheva kataṃ sumanapupphapaṭaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uṭṭhitassa sālino"
      },
      "ti sayaṃjātasālino, samudāyāpekkhañcettha ekavacanaṃ, sālīnanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nava vāhasahassānī"
      },
      "ti ettha catasso muṭṭhiyo eko kuḍuvo, cattāro kuḍuvā eko pattho, cattāro patthā eko āḷhako, cattāro āḷhakā ekaṃ doṇaṃ, cattāri doṇāni ekā mānikā ",
      ", catasso mānikā ekā khārī, vīsati khārikā eko vāho, tadeva ‘‘ekaṃ sakaṭa’’nti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "suttanipātaṭṭhakathādīsu"
      },
      " (su. ni. aṭṭha. 2.kokālikasuttavaṇṇanā) vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nitthusakaṇe karontī"
      },
      "ti thusakuṇḍakarahite karonti. Tena nimmitaṃ buddharūpaṃ passantoti sambandho. Puññappabhāvanibbattaggahaṇaṃ nāgarājanimmitānaṃ puññappabhāvanibbattehi sadisatāya kataṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vimalaketumālā"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ketumālā"
      },
      " nāma sīsato nikkhamitvā uparimuddhani puñjo hutvā dissamānarasmirāsīti vadanti."
    ],
    "innerText": "Ekarajjābhisekanti sakalajambudīpe ekādhipaccavasena kariyamānaṃ abhisekaṃ. Rājiddhiyoti rājānubhāvānugatappabhāvā. Yatoti yato soḷasaghaṭato. Devatā eva divase divase āharantīti sambandho. Devasikanti divase divase. Agadāmalakanti appakeneva sarīrasodhanādisamatthaṃ sabbadosaharaṃ osadhāmalakaṃ. Chaddantadahatoti chaddantadahasamīpe ṭhitadevavimānato, kapparukkhato vā, tattha tādisā kapparukkhavisesā santi, tato vā āharantīti attho. Asuttamayikanti suttehi abaddhaṃ dibbasumanapuppheheva kataṃ sumanapupphapaṭaṃ. Uṭṭhitassa sālinoti sayaṃjātasālino, samudāyāpekkhañcettha ekavacanaṃ, sālīnanti attho. Nava vāhasahassānīti ettha catasso muṭṭhiyo eko kuḍuvo, cattāro kuḍuvā eko pattho, cattāro patthā eko āḷhako, cattāro āḷhakā ekaṃ doṇaṃ, cattāri doṇāni ekā mānikā , catasso mānikā ekā khārī, vīsati khārikā eko vāho, tadeva ‘‘ekaṃ sakaṭa’’nti suttanipātaṭṭhakathādīsu (su. ni. aṭṭha. 2.kokālikasuttavaṇṇanā) vuttaṃ. Nitthusakaṇe karontīti thusakuṇḍakarahite karonti. Tena nimmitaṃ buddharūpaṃ passantoti sambandho. Puññappabhāvanibbattaggahaṇaṃ nāgarājanimmitānaṃ puññappabhāvanibbattehi sadisatāya kataṃ. Vimalaketumālāti ettha ketumālā nāma sīsato nikkhamitvā uparimuddhani puñjo hutvā dissamānarasmirāsīti vadanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bāhirakapāsaṇḍa"
      },
      "nti ",
      " bāhirakappaveditaṃ samayavādaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pariggaṇhī"
      },
      "ti vīmaṃsamāno pariggahesi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhaddapīṭhakesū"
      },
      "ti vettamayapīṭhesu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sāro"
      },
      "ti guṇasāro. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sīhapañjare"
      },
      "ti mahāvātapānasamīpe. Kilesavipphandarahitacittatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dantaṃ"
      },
      ". Niccaṃ paccupaṭṭhitasatārakkhatāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "guttaṃ. Khuraggeyevā"
      },
      "ti kesoropanāvasāne. Ativiya sobhatīti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vāṇijako ahosī"
      },
      "ti madhuvāṇijako ahosi."
    ],
    "innerText": "Bāhirakapāsaṇḍanti bāhirakappaveditaṃ samayavādaṃ. Pariggaṇhīti vīmaṃsamāno pariggahesi. Bhaddapīṭhakesūti vettamayapīṭhesu. Sāroti guṇasāro. Sīhapañjareti mahāvātapānasamīpe. Kilesavipphandarahitacittatāya dantaṃ. Niccaṃ paccupaṭṭhitasatārakkhatāya guttaṃ. Khuraggeyevāti kesoropanāvasāne. Ativiya sobhatīti sambandho. Vāṇijako ahosīti madhuvāṇijako ahosi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pubbe va sannivāsenā"
      },
      "ti pubbe vā pubbajātiyaṃ vā sahavāsenāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paccuppannahitena vā"
      },
      "ti vattamānabhave hitacaraṇena vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ"
      },
      " imehi dvīhi kāraṇehi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "taṃ"
      },
      " sinehasaṅkhātaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pemaṃ jāyate"
      },
      ". Kiṃ viyāti? Āha ‘‘uppalaṃ va yathodake’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uppalaṃ vā"
      },
      "ti rassakato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vā"
      },
      "-saddo avuttasampiṇḍanattho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathā"
      },
      "-saddo upamāyaṃ. Idaṃ vuttaṃ hoti – yathā uppalañca sesañca padumādi udake jāyamānaṃ dve kāraṇāni nissāya jāyati udakañceva kalalañca, evaṃ pemampīti (jā. aṭṭha. 2.2.174)."
    ],
    "innerText": "Pubbe va sannivāsenāti pubbe vā pubbajātiyaṃ vā sahavāsenāti attho. Paccuppannahitena vāti vattamānabhave hitacaraṇena vā. Evaṃ imehi dvīhi kāraṇehi taṃ sinehasaṅkhātaṃ pemaṃ jāyate. Kiṃ viyāti? Āha ‘‘uppalaṃ va yathodake’’ti. Uppalaṃ vāti rassakato vā-saddo avuttasampiṇḍanattho. Yathā-saddo upamāyaṃ. Idaṃ vuttaṃ hoti – yathā uppalañca sesañca padumādi udake jāyamānaṃ dve kāraṇāni nissāya jāyati udakañceva kalalañca, evaṃ pemampīti (jā. aṭṭha. 2.2.174)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhuvabhattānī"
      },
      "ti niccabhattāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vajjāvajja"
      },
      "nti khuddakaṃ mahantañca vajjaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Moggaliputtatissattherassa bhāramakāsī"
      },
      "ti therassa mahānubhāvataṃ, tadā sāsanakiccassa nāyakabhāvena saṅghapariṇāyakatañca rañño ñāpetuṃ saṅgho tassa bhāramakāsīti veditabbaṃ, na aññesaṃ ajānanatāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sāsanassa dāyādo"
      },
      "ti sāsanassa abbhantaro ñātako homi na homīti attho. Ye sāsane pabbajituṃ puttadhītaro pariccajanti, te buddhasāsane sālohitañātakā nāma honti, sakalasāsanadhāraṇe samatthānaṃ attano orasaputtānaṃ pariccattattā na paccayamattadāyakāti imamatthaṃ sandhāya thero ‘‘na kho, mahārāja, ettāvatā sāsanassa dāyādo hotī’’ti āha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kathañcarahī"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "carahī"
      },
      "ti nipāto akkhantiṃ dīpeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tissakumārassā"
      },
      "ti rañño ekamātukassa kaniṭṭhassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sakkhasī"
      },
      "ti sakkhissasi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sikkhāya patiṭṭhāpesu"
      },
      "nti pāṇātipātā veramaṇiādīsu vikālabhojanā veramaṇipariyosānāsu chasu sikkhāsu pāṇātipātā veramaṇiṃ dve ",
      " vassāni avītikkamma samādānaṃ samādiyāmītiādinā (pāci. 1079) samādānavasena sikkhāsammutidānānantaraṃ sikkhāya patiṭṭhāpesuṃ. Cha vassāni abhisekassa assāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "chavassābhiseko"
      },
      "."
    ],
    "innerText": "Dhuvabhattānīti niccabhattāni. Vajjāvajjanti khuddakaṃ mahantañca vajjaṃ. Moggaliputtatissattherassa bhāramakāsīti therassa mahānubhāvataṃ, tadā sāsanakiccassa nāyakabhāvena saṅghapariṇāyakatañca rañño ñāpetuṃ saṅgho tassa bhāramakāsīti veditabbaṃ, na aññesaṃ ajānanatāya. Sāsanassa dāyādoti sāsanassa abbhantaro ñātako homi na homīti attho. Ye sāsane pabbajituṃ puttadhītaro pariccajanti, te buddhasāsane sālohitañātakā nāma honti, sakalasāsanadhāraṇe samatthānaṃ attano orasaputtānaṃ pariccattattā na paccayamattadāyakāti imamatthaṃ sandhāya thero ‘‘na kho, mahārāja, ettāvatā sāsanassa dāyādo hotī’’ti āha. Kathañcarahīti ettha carahīti nipāto akkhantiṃ dīpeti. Tissakumārassāti rañño ekamātukassa kaniṭṭhassa. Sakkhasīti sakkhissasi. Sikkhāya patiṭṭhāpesunti pāṇātipātā veramaṇiādīsu vikālabhojanā veramaṇipariyosānāsu chasu sikkhāsu pāṇātipātā veramaṇiṃ dve vassāni avītikkamma samādānaṃ samādiyāmītiādinā (pāci. 1079) samādānavasena sikkhāsammutidānānantaraṃ sikkhāya patiṭṭhāpesuṃ. Cha vassāni abhisekassa assāti chavassābhiseko."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "theravāda"
      },
      "nti dve saṅgītiyo āruḷhā pāḷi. Sā hi mahāsaṅghikādibhinnaladdhikāhi vivecetuṃ ‘‘theravādo’’ti vuttā. Ayañhi vibhajjavādo mahākassapattherādīhi asaṅkarato rakkhito ānīto cāti ‘‘theravādo’’ti vuccati, ‘‘satheravāda’’ntipi likhanti. Tattha ‘‘aṭṭhakathāsu āgatatheravādasahitaṃ sāṭṭhakathaṃ tipiṭakasaṅgahitaṃ buddhavacana’’nti ānetvā yojetabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tejodhātuṃ samāpajjitvā"
      },
      "ti tejokasiṇārammaṇaṃ jhānaṃ samāpajjitvā."
    ],
    "innerText": "Sabbaṃtheravādanti dve saṅgītiyo āruḷhā pāḷi. Sā hi mahāsaṅghikādibhinnaladdhikāhi vivecetuṃ ‘‘theravādo’’ti vuttā. Ayañhi vibhajjavādo mahākassapattherādīhi asaṅkarato rakkhito ānīto cāti ‘‘theravādo’’ti vuccati, ‘‘satheravāda’’ntipi likhanti. Tattha ‘‘aṭṭhakathāsu āgatatheravādasahitaṃ sāṭṭhakathaṃ tipiṭakasaṅgahitaṃ buddhavacana’’nti ānetvā yojetabbaṃ. Tejodhātuṃ samāpajjitvāti tejokasiṇārammaṇaṃ jhānaṃ samāpajjitvā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabhāya"
      },
      "nti nagaramajjhe vinicchayasālāyaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Diṭṭhigatānī"
      },
      "ti diṭṭhiyova. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na kho panetaṃ sakkā imesaṃ majjhe vasantena vūpasametu"
      },
      "nti tesañhi majjhe vasanto tesuyeva antogadhattā ādeyyavacano na hoti, tasmā evaṃ cintesi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ahogaṅgapabbata"
      },
      "nti evaṃnāmakaṃ pabbataṃ. ‘‘Adhogaṅgāpabbata’’ntipi likhanti, taṃ na sundaraṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañcātapena tappentī"
      },
      "ti catūsu ṭhānesu aggiṃ jāletvā majjhe ṭhatvā sūriyamaṇḍalaṃ ullokentā sūriyātapena tappenti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ādiccaṃ anuparivattantī"
      },
      "ti udayakālato pabhuti sūriyaṃ olokayamānā yāva atthaṅgamanā sūriyābhimukhāva parivattanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vobhindissāmāti paggaṇhiṃsū"
      },
      "ti vināsessāmāti ussāhamakaṃsu."
    ],
    "innerText": "Sabhāyanti nagaramajjhe vinicchayasālāyaṃ. Diṭṭhigatānīti diṭṭhiyova. Na kho panetaṃ sakkā imesaṃ majjhe vasantena vūpasametunti tesañhi majjhe vasanto tesuyeva antogadhattā ādeyyavacano na hoti, tasmā evaṃ cintesi. Ahogaṅgapabbatanti evaṃnāmakaṃ pabbataṃ. ‘‘Adhogaṅgāpabbata’’ntipi likhanti, taṃ na sundaraṃ. Pañcātapena tappentīti catūsu ṭhānesu aggiṃ jāletvā majjhe ṭhatvā sūriyamaṇḍalaṃ ullokentā sūriyātapena tappenti. Ādiccaṃ anuparivattantīti udayakālato pabhuti sūriyaṃ olokayamānā yāva atthaṅgamanā sūriyābhimukhāva parivattanti. Vobhindissāmāti paggaṇhiṃsūti vināsessāmāti ussāhamakaṃsu."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vissaṭṭho"
      },
      "ti maraṇasaṅkārahito, nibbhayoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Migavaṃ nikkhamitvā"
      },
      "ti araññe vicaritvā migamāraṇakīḷā migavaṃ, taṃ uddissa nikkhamitvā migavadhatthaṃ nikkhamitvāti attho. Ahināgādito visesanatthaṃ ‘‘hatthināgenā’’ti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tassa passantassevā"
      },
      "ti anādare sāmivacanaṃ, tasmiṃ passanteyevāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ākāse uppatitvā"
      },
      "ti ettha ayaṃ vikubbaniddhi na hotīti gihissāpi imaṃ iddhiṃ dassesi adhiṭṭhāniddhiyā appaṭikkhittattā. Pakativaṇṇañhi vijahitvā nāgavaṇṇādidassanaṃ vikubbaniddhi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Chaṇavesa"
      },
      "nti ussavavesaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Padhānaghara"
      },
      "nti bhāvanānuyogavasena vīriyārambhassa anurūpaṃ vivittasenāsanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sopī"
      },
      "ti rañño bhāgineyyaṃ sandhāya vuttaṃ."
    ],
    "innerText": "Vissaṭṭhoti maraṇasaṅkārahito, nibbhayoti attho. Migavaṃ nikkhamitvāti araññe vicaritvā migamāraṇakīḷā migavaṃ, taṃ uddissa nikkhamitvā migavadhatthaṃ nikkhamitvāti attho. Ahināgādito visesanatthaṃ ‘‘hatthināgenā’’ti vuttaṃ. Tassa passantassevāti anādare sāmivacanaṃ, tasmiṃ passanteyevāti attho. Ākāse uppatitvāti ettha ayaṃ vikubbaniddhi na hotīti gihissāpi imaṃ iddhiṃ dassesi adhiṭṭhāniddhiyā appaṭikkhittattā. Pakativaṇṇañhi vijahitvā nāgavaṇṇādidassanaṃ vikubbaniddhi. Chaṇavesanti ussavavesaṃ. Padhānagharanti bhāvanānuyogavasena vīriyārambhassa anurūpaṃ vivittasenāsanaṃ. Sopīti rañño bhāgineyyaṃ sandhāya vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kusalādhippāyo"
      },
      "ti manāpajjhāsayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dveḷhakajāto"
      },
      "ti saṃsayamāpanno. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekekaṃ bhikkhusahassaparivāra"
      },
      "nti ettha ‘‘gaṇhitvā āgacchathā’’ti āṇākārena vuttepi therā bhikkhū sāsanahitattā gatā. Kappiyasāsanañhetaṃ, na gihīnaṃ gihikammapaṭisaṃyuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Thero nāgacchī"
      },
      "ti kiñcāpi ",
      " ‘‘rājā ",
      " pakkosatī’’ti vuttepi dhammakammatthāya āgantuṃ vaṭṭati, dvikkhattuṃ pana pesitepi ‘‘ananurūpā yācanā’’ti nāgato, ‘‘mahānubhāvo thero yathānusiṭṭhaṃ paṭipattiko pamāṇabhūto’’ti rañño ceva ubhayapakkhikānañca attani bahumānuppādanavasena uddhaṃ kattabbakammasiddhiṃ ākaṅkhanto asāruppavacanalesena nāgacchi. Ekato saṅghaṭitā nāvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nāvāsaṅghāṭaṃ"
      },
      ". Sāsanapaccatthikānaṃ bahubhāvato āha ‘‘ārakkhaṃ saṃvidhāyā’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ya"
      },
      "nti yasmā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abbāhiṃsū"
      },
      "ti ākaḍḍhiṃsu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bāhirato"
      },
      "ti uyyānassa bāhirato. Passantānaṃ atidukkarabhāvena upaṭṭhānaṃ sandhāya ‘‘padesapathavīkampanaṃ dukkara’’nti āha. Adhiṭṭhāne panettha visuṃ dukkaratā nāma natthi."
    ],
    "innerText": "Kusalādhippāyoti manāpajjhāsayo. Dveḷhakajātoti saṃsayamāpanno. Ekekaṃ bhikkhusahassaparivāranti ettha ‘‘gaṇhitvā āgacchathā’’ti āṇākārena vuttepi therā bhikkhū sāsanahitattā gatā. Kappiyasāsanañhetaṃ, na gihīnaṃ gihikammapaṭisaṃyuttaṃ. Thero nāgacchīti kiñcāpi ‘‘rājā pakkosatī’’ti vuttepi dhammakammatthāya āgantuṃ vaṭṭati, dvikkhattuṃ pana pesitepi ‘‘ananurūpā yācanā’’ti nāgato, ‘‘mahānubhāvo thero yathānusiṭṭhaṃ paṭipattiko pamāṇabhūto’’ti rañño ceva ubhayapakkhikānañca attani bahumānuppādanavasena uddhaṃ kattabbakammasiddhiṃ ākaṅkhanto asāruppavacanalesena nāgacchi. Ekato saṅghaṭitā nāvā nāvāsaṅghāṭaṃ. Sāsanapaccatthikānaṃ bahubhāvato āha ‘‘ārakkhaṃ saṃvidhāyā’’ti. Yanti yasmā. Abbāhiṃsūti ākaḍḍhiṃsu. Bāhiratoti uyyānassa bāhirato. Passantānaṃ atidukkarabhāvena upaṭṭhānaṃ sandhāya ‘‘padesapathavīkampanaṃ dukkara’’nti āha. Adhiṭṭhāne panettha visuṃ dukkaratā nāma natthi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dīpakatittiro"
      },
      "ti sākuṇikehi samajātikānaṃ gahaṇatthāya posetvā sikkhetvā pāsaṭṭhāne ṭhapanakatittiro. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na paṭicca kammaṃ phusatī"
      },
      "ti gāthāya yadi tava pāpakiriyāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mano nappadussati,"
      },
      " luddena taṃ nissāya katampi pāpakammaṃ taṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na phusati"
      },
      ". Pāpakiriyāya hi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "appossukkassa"
      },
      " nirālayassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhadrassa"
      },
      " sato tava taṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pāpaṃ na upalimpati,"
      },
      " tava cittaṃ na allīyatīti attho."
    ],
    "innerText": "Dīpakatittiroti sākuṇikehi samajātikānaṃ gahaṇatthāya posetvā sikkhetvā pāsaṭṭhāne ṭhapanakatittiro. Na paṭicca kammaṃ phusatīti gāthāya yadi tava pāpakiriyāya mano nappadussati, luddena taṃ nissāya katampi pāpakammaṃ taṃ na phusati. Pāpakiriyāya hi appossukkassa nirālayassa bhadrassa sato tava taṃ pāpaṃ na upalimpati, tava cittaṃ na allīyatīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kiṃ vadati sīlenāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kiṃvādī"
      },
      ". Atha vā ko katamo vādo kiṃvādo, so etassa atthīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kiṃvādī"
      },
      ". Attānañca lokañca sassatoti vādo etesanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sassatavādino"
      },
      ". Sattesu saṅkhāresu vā ekaccaṃ sassatanti pavatto vādo ekaccasassato, tasmiṃ niyuttā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekaccasassatikā"
      },
      ". ‘‘Anto, ananto, antānanto, nevanto nānanto’’ti evaṃ antānantaṃ ārabbha pavattā cattāro vādā antānantā, tesu niyuttā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "antānantikā"
      },
      ". Na marati na upacchijjatīti amarā, evantipi me no, tathātipi me notiādinā (dī. ni. 1.62) pavattā diṭṭhi ceva vācā ca, tassā vikkhepo etesanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "amarāvikkhepikā"
      },
      ". Atha vā amarā nāma macchajāti duggahā hoti, tassā amarāya viya vikkhepo etesanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "amarāvikkhepikā"
      },
      ". Adhicca yadicchakaṃ yaṃ kiñci kāraṇaṃ anapekkhitvā samuppanno attā ca loko cāti vāde niyuttā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "adhiccasamuppannikā"
      },
      ". Saññī attāti vādo yesante ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saññīvādā"
      },
      ". Evaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asaññīvādā nevasaññīnāsaññīvādā"
      },
      "ti etthāpi. ‘‘Kāyassa bhedā satto ucchijjatī’’ti (dī. ni. 1.85-86) evaṃ ",
      " ucchedaṃ vadantīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ucchedavādā. Diṭṭhadhammo"
      },
      "ti paccakkho yathāsakaṃ attabhāvo, tasmiṃyeva yathākāmaṃ pañcakāmaguṇaparibhogena nibbānaṃ dukkhūpasamaṃ vadantīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "diṭṭhadhammanibbānavādā"
      },
      ". Vibhajitvā vādo etassāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vibhajjavādī,"
      },
      " bhagavā. Sabbaṃ ekarūpena avatvā yathādhammaṃ vibhajitvā nijjaṭaṃ nigumbaṃ katvā yathā diṭṭhisandehādayo vigacchanti, sammutiparamatthā ",
      " ca dhammā asaṅkarā paṭibhanti, evaṃ ekantavibhajanasīloti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parappavādaṃ maddamāno"
      },
      "ti tasmiṃ kāle uppannaṃ, āyatiṃ uppajjanakañca sabbaṃ paravādaṃ kathāvatthumātikāvivaraṇamukhena nimmaddanaṃ karontoti attho."
    ],
    "innerText": "Kiṃ vadati sīlenāti kiṃvādī. Atha vā ko katamo vādo kiṃvādo, so etassa atthīti kiṃvādī. Attānañca lokañca sassatoti vādo etesanti sassatavādino. Sattesu saṅkhāresu vā ekaccaṃ sassatanti pavatto vādo ekaccasassato, tasmiṃ niyuttā ekaccasassatikā. ‘‘Anto, ananto, antānanto, nevanto nānanto’’ti evaṃ antānantaṃ ārabbha pavattā cattāro vādā antānantā, tesu niyuttā antānantikā. Na marati na upacchijjatīti amarā, evantipi me no, tathātipi me notiādinā (dī. ni. 1.62) pavattā diṭṭhi ceva vācā ca, tassā vikkhepo etesanti amarāvikkhepikā. Atha vā amarā nāma macchajāti duggahā hoti, tassā amarāya viya vikkhepo etesanti amarāvikkhepikā. Adhicca yadicchakaṃ yaṃ kiñci kāraṇaṃ anapekkhitvā samuppanno attā ca loko cāti vāde niyuttā adhiccasamuppannikā. Saññī attāti vādo yesante saññīvādā. Evaṃ asaññīvādā nevasaññīnāsaññīvādāti etthāpi. ‘‘Kāyassa bhedā satto ucchijjatī’’ti (dī. ni. 1.85-86) evaṃ ucchedaṃ vadantīti ucchedavādā. Diṭṭhadhammoti paccakkho yathāsakaṃ attabhāvo, tasmiṃyeva yathākāmaṃ pañcakāmaguṇaparibhogena nibbānaṃ dukkhūpasamaṃ vadantīti diṭṭhadhammanibbānavādā. Vibhajitvā vādo etassāti vibhajjavādī, bhagavā. Sabbaṃ ekarūpena avatvā yathādhammaṃ vibhajitvā nijjaṭaṃ nigumbaṃ katvā yathā diṭṭhisandehādayo vigacchanti, sammutiparamatthā ca dhammā asaṅkarā paṭibhanti, evaṃ ekantavibhajanasīloti vuttaṃ hoti. Parappavādaṃ maddamānoti tasmiṃ kāle uppannaṃ, āyatiṃ uppajjanakañca sabbaṃ paravādaṃ kathāvatthumātikāvivaraṇamukhena nimmaddanaṃ karontoti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tatiyasaṅgītikathāvaṇṇanānayo niṭṭhito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Ācariyaparamparakathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kenābhata"
      },
      "nti imaṃ pañhaṃ vissajjentena jambudīpe tāva yāva tatiyasaṅgīti, tāva dassetvā idāni sīhaḷadīpe ācariyaparamparaṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tatiyasaṅgahato pana uddha"
      },
      "ntiādi āraddhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Imaṃ dīpa"
      },
      "nti tambapaṇṇidīpaṃ. Tasmiṃ dīpe nisīditvā ācariyena aṭṭhakathāya katattā ‘‘imaṃ dīpa’’nti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kañci kāla"
      },
      "nti accantasaṃyoge upayogavacanaṃ, kismiñci kāleti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Porāṇā"
      },
      "ti sīhaḷadīpe sīhaḷaṭṭhakathākārakā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhaddanāmo"
      },
      "ti bhaddasālatthero. Āguṃ pāpaṃ na karontīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nāgā"
      },
      ". Vinayapiṭakaṃ vācayiṃsūti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tambapaṇṇiyā"
      },
      "ti bhummavacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nikāye pañcā"
      },
      "ti vinayābhidhammānaṃ visuṃ gahitattā tabbinimuttā pañca nikāyā gahetabbā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pakaraṇe"
      },
      "ti abhidhammapakaraṇe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vācesu"
      },
      "nti yojanā. Tīṇi piṭakāni svāgatāni assāti ‘‘tepiṭako’’ti vattabbe ‘‘tipeṭako’’ti chandānurakkhaṇatthaṃ vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tārakarājā"
      },
      "ti candimā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pupphanāmo"
      },
      "ti ettha mahāpadumatthero sumanatthero ca ñātabboti dvikkhattuṃ ‘‘pupphanāmo’’ti vuttaṃ."
    ],
    "innerText": "Kenābhatanti imaṃ pañhaṃ vissajjentena jambudīpe tāva yāva tatiyasaṅgīti, tāva dassetvā idāni sīhaḷadīpe ācariyaparamparaṃ dassetuṃ tatiyasaṅgahato pana uddhantiādi āraddhaṃ. Imaṃ dīpanti tambapaṇṇidīpaṃ. Tasmiṃ dīpe nisīditvā ācariyena aṭṭhakathāya katattā ‘‘imaṃ dīpa’’nti vuttaṃ. Kañci kālanti accantasaṃyoge upayogavacanaṃ, kismiñci kāleti attho. Porāṇāti sīhaḷadīpe sīhaḷaṭṭhakathākārakā. Bhaddanāmoti bhaddasālatthero. Āguṃ pāpaṃ na karontīti nāgā. Vinayapiṭakaṃ vācayiṃsūti sambandho. Tambapaṇṇiyāti bhummavacanaṃ. Nikāye pañcāti vinayābhidhammānaṃ visuṃ gahitattā tabbinimuttā pañca nikāyā gahetabbā. Pakaraṇeti abhidhammapakaraṇe vācesunti yojanā. Tīṇi piṭakāni svāgatāni assāti ‘‘tepiṭako’’ti vattabbe ‘‘tipeṭako’’ti chandānurakkhaṇatthaṃ vuttaṃ. Tārakarājāti candimā. Pupphanāmoti ettha mahāpadumatthero sumanatthero ca ñātabboti dvikkhattuṃ ‘‘pupphanāmo’’ti vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vanavāsi"
      },
      "nti vanavāsīraṭṭhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Karakavassa"
      },
      "nti himapātanakavassaṃ, karakadhārāsadisaṃ vā vassaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Harāpetvā"
      },
      "ti udakoghena harāpetvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Chinnabhinnapaṭadharo"
      },
      "ti satthakena chinnaṃ raṅgena bhinnaṃ paṭaṃ dhāraṇako. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhaṇḍū"
      },
      "ti muṇḍako. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Makkhaṃ asahamāno"
      },
      "ti therassa ānubhāvaṃ paṭicca attano ",
      " uppannaṃ paresaṃ guṇamakkhanalakkhaṇaṃ makkhaṃ tathā pavattaṃ kodhaṃ asahamāno. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asaniyo phalantī"
      },
      "ti gajjantā patanti. Me mama bhayabheravaṃ janetuṃ paṭibalo na assa na bhaveyyāti yojanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aññadatthū"
      },
      "ti ekaṃsena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kasmīragandhārā"
      },
      "ti kasmīragandhāraraṭṭhavāsino. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Isivātapaṭivātā"
      },
      "ti bhikkhūnaṃ cīvaracalanakāyacalanehi sañjanitavātehi parito samantato bījayamānā ahesuṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhammacakkhu"
      },
      "nti heṭṭhāmaggattaye ñāṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anamataggiya"
      },
      "nti anamataggasaṃyuttaṃ (saṃ. ni. 2.124 ādayo). ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samadhikānī"
      },
      "ti sādhikāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañca raṭṭhānī"
      },
      "ti pañca cinaraṭṭhāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vegasā"
      },
      "ti vegena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samantato rakkhaṃ ṭhapesī"
      },
      "ti tesaṃ appavesanatthāya adhiṭṭhānavasena rakkhaṃ ṭhapesi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aḍḍhuḍḍhāni sahassānī"
      },
      "ti aḍḍhena catutthāni aḍḍhuḍḍhāni, atirekapañcasatāni tīṇi sahassānīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Diyaḍḍhasahassa"
      },
      "nti ",
      " aḍḍhena dutiyaṃ diyaḍḍhaṃ, atirekapañcasatikaṃ sahassanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Niddhametvānā"
      },
      "ti palāpetvā."
    ],
    "innerText": "Vanavāsinti vanavāsīraṭṭhaṃ. Karakavassanti himapātanakavassaṃ, karakadhārāsadisaṃ vā vassaṃ. Harāpetvāti udakoghena harāpetvā. Chinnabhinnapaṭadharoti satthakena chinnaṃ raṅgena bhinnaṃ paṭaṃ dhāraṇako. Bhaṇḍūti muṇḍako. Makkhaṃ asahamānoti therassa ānubhāvaṃ paṭicca attano uppannaṃ paresaṃ guṇamakkhanalakkhaṇaṃ makkhaṃ tathā pavattaṃ kodhaṃ asahamāno. Asaniyo phalantīti gajjantā patanti. Me mama bhayabheravaṃ janetuṃ paṭibalo na assa na bhaveyyāti yojanā. Aññadatthūti ekaṃsena. Kasmīragandhārāti kasmīragandhāraraṭṭhavāsino. Isivātapaṭivātāti bhikkhūnaṃ cīvaracalanakāyacalanehi sañjanitavātehi parito samantato bījayamānā ahesuṃ. Dhammacakkhunti heṭṭhāmaggattaye ñāṇaṃ. Anamataggiyanti anamataggasaṃyuttaṃ (saṃ. ni. 2.124 ādayo). Samadhikānīti sādhikāni. Pañca raṭṭhānīti pañca cinaraṭṭhāni. Vegasāti vegena. Samantato rakkhaṃ ṭhapesīti tesaṃ appavesanatthāya adhiṭṭhānavasena rakkhaṃ ṭhapesi. Aḍḍhuḍḍhāni sahassānīti aḍḍhena catutthāni aḍḍhuḍḍhāni, atirekapañcasatāni tīṇi sahassānīti attho. Diyaḍḍhasahassanti aḍḍhena dutiyaṃ diyaḍḍhaṃ, atirekapañcasatikaṃ sahassanti attho. Niddhametvānāti palāpetvā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rājagahanagaraparivattakenā"
      },
      "ti rājagahanagaraṃ parivattetvā tato bahi taṃ padakkhiṇaṃ katvā gatamaggena, gamanena vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āropesī"
      },
      "ti paṭipādesi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paḷinā"
      },
      "ti ākāsaṃ pakkhandiṃsu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Naguttame"
      },
      "ti cetiyagirimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Purato"
      },
      "ti pācīnadisābhāge. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puraseṭṭhassā"
      },
      "ti seṭṭhassa anurādhapurassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Silakūṭamhī"
      },
      "ti evaṃnāmake pabbatakūṭe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sīhakumārassa putto"
      },
      "ti ettha ‘‘kaliṅgarājadhītu kucchismiṃ sīhassa jāto sīhakumāro’’ti vadanti. Jeṭṭhamāsassa puṇṇamiyaṃ jeṭṭhanakkhattaṃ vā mūlanakkhattaṃ vā hotīti āha ‘‘jeṭṭhamūlanakkhattaṃ nāma hotī’’ti. Migānaṃ vānato hiṃsanato bādhanato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "migavaṃ,"
      },
      " migavijjhanakīḷā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rohitamigarūpa"
      },
      "nti gokaṇṇamigavesaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rathayaṭṭhippamāṇā"
      },
      "ti rathapatodappamāṇā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekā latāyaṭṭhi nāmā"
      },
      "ti ekā rajatamayā kañcanalatāya paṭimaṇḍitattā evaṃ laddhanāmā. Pupphayaṭṭhiyaṃ nīlādīni pupphāni, sakuṇayaṭṭhiyaṃ nānappakārā migapakkhino vicittakammakatā viya khāyantīti daṭṭhabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rājakakudhabhaṇḍānī"
      },
      "ti rājārahauttamabhaṇḍāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅkha"
      },
      "nti dakkhiṇāvaṭṭaṃ abhisekasaṅkhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vaḍḍhamāna"
      },
      "nti alaṅkāracuṇṇaṃ, ‘‘nahānacuṇṇa’’nti keci. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vaṭaṃsaka"
      },
      "nti kaṇṇapiḷandhanaṃ vaṭaṃsakanti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nandiyāvaṭṭa"
      },
      "nti nandiyāvaṭṭapupphākārena maṅgalatthaṃ suvaṇṇena kataṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kañña"
      },
      "nti khattiyakumāriṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Hatthapuñchana"
      },
      "nti pītavaṇṇaṃ mahagghahatthapuñchanavatthaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aruṇavaṇṇamattika"
      },
      "nti nāgabhavanasambhavaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vatthakoṭika"
      },
      "nti vatthayugameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nāgamāhaṭa"
      },
      "nti nāgehi ",
      " āhaṭaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Amatosadha"
      },
      "nti evaṃnāmikā guḷikajāti. Amatasadisakiccattā evaṃ vuccati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhūmattharaṇasaṅkhepenā"
      },
      "ti bhūmattharaṇākārena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uppātapāṭhakā"
      },
      "ti nimittapāṭhakā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Alaṃ gacchāmā"
      },
      "ti ‘‘purassa accāsannattā sāruppaṃ na hotī’’ti paṭikkhipanto āha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aḍḍhanavamānaṃ pāṇasahassāna"
      },
      "nti (a. ni. 6.53) pañcasatādhikānaṃ aṭṭhannaṃ pāṇasahassānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appamādasutta"
      },
      "nti aṅguttaranikāye mahāappamādasuttaṃ, rājovādasuttanti vuttaṃ hoti."
    ],
    "innerText": "Rājagahanagaraparivattakenāti rājagahanagaraṃ parivattetvā tato bahi taṃ padakkhiṇaṃ katvā gatamaggena, gamanena vā. Āropesīti paṭipādesi. Paḷināti ākāsaṃ pakkhandiṃsu. Naguttameti cetiyagirimāha. Puratoti pācīnadisābhāge. Puraseṭṭhassāti seṭṭhassa anurādhapurassa. Silakūṭamhīti evaṃnāmake pabbatakūṭe. Sīhakumārassa puttoti ettha ‘‘kaliṅgarājadhītu kucchismiṃ sīhassa jāto sīhakumāro’’ti vadanti. Jeṭṭhamāsassa puṇṇamiyaṃ jeṭṭhanakkhattaṃ vā mūlanakkhattaṃ vā hotīti āha ‘‘jeṭṭhamūlanakkhattaṃ nāma hotī’’ti. Migānaṃ vānato hiṃsanato bādhanato migavaṃ, migavijjhanakīḷā. Rohitamigarūpanti gokaṇṇamigavesaṃ. Rathayaṭṭhippamāṇāti rathapatodappamāṇā. Ekā latāyaṭṭhi nāmāti ekā rajatamayā kañcanalatāya paṭimaṇḍitattā evaṃ laddhanāmā. Pupphayaṭṭhiyaṃ nīlādīni pupphāni, sakuṇayaṭṭhiyaṃ nānappakārā migapakkhino vicittakammakatā viya khāyantīti daṭṭhabbaṃ. Rājakakudhabhaṇḍānīti rājārahauttamabhaṇḍāni. Saṅkhanti dakkhiṇāvaṭṭaṃ abhisekasaṅkhaṃ. Vaḍḍhamānanti alaṅkāracuṇṇaṃ, ‘‘nahānacuṇṇa’’nti keci. Vaṭaṃsakanti kaṇṇapiḷandhanaṃ vaṭaṃsakanti vuttaṃ hoti. Nandiyāvaṭṭanti nandiyāvaṭṭapupphākārena maṅgalatthaṃ suvaṇṇena kataṃ. Kaññanti khattiyakumāriṃ. Hatthapuñchananti pītavaṇṇaṃ mahagghahatthapuñchanavatthaṃ. Aruṇavaṇṇamattikanti nāgabhavanasambhavaṃ. Vatthakoṭikanti vatthayugameva. Nāgamāhaṭanti nāgehi āhaṭaṃ. Amatosadhanti evaṃnāmikā guḷikajāti. Amatasadisakiccattā evaṃ vuccati. Bhūmattharaṇasaṅkhepenāti bhūmattharaṇākārena. Uppātapāṭhakāti nimittapāṭhakā. Alaṃ gacchāmāti ‘‘purassa accāsannattā sāruppaṃ na hotī’’ti paṭikkhipanto āha. Aḍḍhanavamānaṃ pāṇasahassānanti (a. ni. 6.53) pañcasatādhikānaṃ aṭṭhannaṃ pāṇasahassānaṃ. Appamādasuttanti aṅguttaranikāye mahāappamādasuttaṃ, rājovādasuttanti vuttaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahaccā"
      },
      "ti mahatā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upasaṅkamanto"
      },
      "ti ativiya kilantarūpo hutvā upasaṅkamīti attho. Tumhe jānanatthanti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañcapaṇṇāsāyā"
      },
      "ti ettha ‘‘catupaññāsāyāti vattabbaṃ. Evañhi sati upari vuccamānaṃ dvāsaṭṭhi arahantoti vacanaṃ sametī’’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sāratthadīpaniyaṃ"
      },
      " (sārattha. ṭī. 1.ācariyaparamparakathāvaṇṇanā) vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dasabhātikasamākula"
      },
      "nti muṭasivassa puttehi devānaṃpiyatissādīhi dasahi bhātikehi samākiṇṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ciradiṭṭho sammāsambuddho"
      },
      "ti dhātuyo sandhāyāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbatāḷāvacare"
      },
      "ti sabbāni turiyabhaṇḍāni, taṃsahacarite vā vādake. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upaṭṭhāpetvā"
      },
      "ti upahārakārāpanavasena sannipātetvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vaḍḍhamānakacchāyāyā"
      },
      "ti pacchābhattaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pokkharavassa"
      },
      "nti pokkharapatte ",
      " viya atemitukāmānaṃ upari atemetvā pavattanakavassaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahāvīro"
      },
      "ti satthuvohārena dhātu eva vuttā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pacchimadisābhimukhova hutvā apasakkanto"
      },
      "ti ettha puratthābhimukho ṭhitova piṭṭhito apasakkanena pacchimadisāya gacchanto tādisopasaṅkamanaṃ sandhāya ‘‘pacchimadisābhimukho’’ti vutto. ‘‘Mahejavatthu nāma evaṃnāmakaṃ devaṭṭhāna’’nti vadanti."
    ],
    "innerText": "Mahaccāti mahatā. Upasaṅkamantoti ativiya kilantarūpo hutvā upasaṅkamīti attho. Tumhe jānanatthanti sambandho. Pañcapaṇṇāsāyāti ettha ‘‘catupaññāsāyāti vattabbaṃ. Evañhi sati upari vuccamānaṃ dvāsaṭṭhi arahantoti vacanaṃ sametī’’ti sāratthadīpaniyaṃ (sārattha. ṭī. 1.ācariyaparamparakathāvaṇṇanā) vuttaṃ. Dasabhātikasamākulanti muṭasivassa puttehi devānaṃpiyatissādīhi dasahi bhātikehi samākiṇṇaṃ. Ciradiṭṭho sammāsambuddhoti dhātuyo sandhāyāha. Sabbatāḷāvacareti sabbāni turiyabhaṇḍāni, taṃsahacarite vā vādake. Upaṭṭhāpetvāti upahārakārāpanavasena sannipātetvā. Vaḍḍhamānakacchāyāyāti pacchābhattaṃ. Pokkharavassanti pokkharapatte viya atemitukāmānaṃ upari atemetvā pavattanakavassaṃ. Mahāvīroti satthuvohārena dhātu eva vuttā. Pacchimadisābhimukhova hutvā apasakkantoti ettha puratthābhimukho ṭhitova piṭṭhito apasakkanena pacchimadisāya gacchanto tādisopasaṅkamanaṃ sandhāya ‘‘pacchimadisābhimukho’’ti vutto. ‘‘Mahejavatthu nāma evaṃnāmakaṃ devaṭṭhāna’’nti vadanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pajjarakenā"
      },
      "ti amanussasamuṭṭhāpitena pajjarakarogena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Devo"
      },
      "ti megho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anuppavecchī"
      },
      "ti vimucci. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vivādo hotī"
      },
      "ti ettha kiriyākālamapekkhitvā vattamānappayogo daṭṭhabbo. Evaṃ īdisesu sabbattha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tadeta"
      },
      "nti ṭhānaṃ tiṭṭhatīti sambandho. ‘‘Channaṃ vaṇṇānaṃ sambandhabhūtānaṃ raṃsiyo cā’’ti ajjhāharitabbaṃ, ‘‘channaṃ vaṇṇānaṃ udakadhārā cā’’ti evampettha sambandhaṃ vadanti. Parinibbutepi bhagavati tassānubhāvena evarūpaṃ pāṭihāriyaṃ ahosi evāti dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "evaṃ acintiyā"
      },
      "tiādigāthamāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rakkhaṃ karonto"
      },
      "ti attanā upāyena palāpitānaṃ yakkhānaṃ puna appavisanatthāya parittānaṃ karonto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āvijjī"
      },
      "ti pariyāyi."
    ],
    "innerText": "Pajjarakenāti amanussasamuṭṭhāpitena pajjarakarogena. Devoti megho. Anuppavecchīti vimucci. Vivādo hotīti ettha kiriyākālamapekkhitvā vattamānappayogo daṭṭhabbo. Evaṃ īdisesu sabbattha. Tadetanti ṭhānaṃ tiṭṭhatīti sambandho. ‘‘Channaṃ vaṇṇānaṃ sambandhabhūtānaṃ raṃsiyo cā’’ti ajjhāharitabbaṃ, ‘‘channaṃ vaṇṇānaṃ udakadhārā cā’’ti evampettha sambandhaṃ vadanti. Parinibbutepi bhagavati tassānubhāvena evarūpaṃ pāṭihāriyaṃ ahosi evāti dassetuṃ evaṃ acintiyātiādigāthamāha. Rakkhaṃ karontoti attanā upāyena palāpitānaṃ yakkhānaṃ puna appavisanatthāya parittānaṃ karonto. Āvijjīti pariyāyi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rañño"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhātā"
      },
      "ti rañño kaniṭṭhabhātā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anuḷādevī"
      },
      " nāma rañño jeṭṭhabhātu jāyā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sarasaraṃsijālavissajjanakenā"
      },
      "ti siniddhatāya rasavantaṃ ojavantaṃ raṃsijālaṃ vissajjentena. Ekadivasena agamāsīti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appesī"
      },
      "ti lekhasāsanaṃ patiṭṭhāpesi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Udikkhatī"
      },
      "ti apekkhati pattheti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhāriya"
      },
      "nti garukaṃ, anatikkamanīyanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Maṃ paṭimānetī"
      },
      "ti maṃ udikkhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kammāravaṇṇa"
      },
      "nti rañño pakatisuvaṇṇakāravaṇṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tihatthavikkhambha"
      },
      "nti tihatthavitthāraṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sakalajambudīparajjenā"
      },
      "ti ettha rañño idanti rajjaṃ, sakalajambudīpato uppajjanakaāyo ceva āṇādayo ca, tena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pūjemī"
      },
      "ti attho, na sakalapathavīpāsādādivatthunā tassa sattāhaṃ demītiādinā kālaparicchedaṃ katvā dātuṃ ayuttattā. Evañhi dento tāvakālikaṃ deti nāma vatthupariccāgalakkhaṇattā dānassa, pathavādivatthupariccāgena ca puna gahaṇassa ayuttattā. Niyamitakāle pana āyādayo pariccattā evāti tato paraṃ apariccattattā gahetuṃ vaṭṭati. Tasmā vuttanayenettha ito parampi āyādidānavaseneva rajjadānaṃ veditabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pupphuḷakā hutvā"
      },
      "ti ketakīpārohaṅkurā viya udakapupphuḷakākārā hutvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gavakkhajālasadisa"
      },
      "nti bhāvanapuṃsakaṃ, vātapānesu jālākārena ṭhapitadārupaṭasadisanti attho, gavakkhena ca suttādimayajālena ca sadisanti vā attho."
    ],
    "innerText": "Raññobhātāti rañño kaniṭṭhabhātā. Anuḷādevī nāma rañño jeṭṭhabhātu jāyā. Sarasaraṃsijālavissajjanakenāti siniddhatāya rasavantaṃ ojavantaṃ raṃsijālaṃ vissajjentena. Ekadivasena agamāsīti sambandho. Appesīti lekhasāsanaṃ patiṭṭhāpesi. Udikkhatīti apekkhati pattheti. Bhāriyanti garukaṃ, anatikkamanīyanti attho. Maṃ paṭimānetīti maṃ udikkhati. Kammāravaṇṇanti rañño pakatisuvaṇṇakāravaṇṇaṃ. Tihatthavikkhambhanti tihatthavitthāraṃ. Sakalajambudīparajjenāti ettha rañño idanti rajjaṃ, sakalajambudīpato uppajjanakaāyo ceva āṇādayo ca, tena pūjemīti attho, na sakalapathavīpāsādādivatthunā tassa sattāhaṃ demītiādinā kālaparicchedaṃ katvā dātuṃ ayuttattā. Evañhi dento tāvakālikaṃ deti nāma vatthupariccāgalakkhaṇattā dānassa, pathavādivatthupariccāgena ca puna gahaṇassa ayuttattā. Niyamitakāle pana āyādayo pariccattā evāti tato paraṃ apariccattattā gahetuṃ vaṭṭati. Tasmā vuttanayenettha ito parampi āyādidānavaseneva rajjadānaṃ veditabbaṃ. Pupphuḷakā hutvāti ketakīpārohaṅkurā viya udakapupphuḷakākārā hutvā. Gavakkhajālasadisanti bhāvanapuṃsakaṃ, vātapānesu jālākārena ṭhapitadārupaṭasadisanti attho, gavakkhena ca suttādimayajālena ca sadisanti vā attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Devadundubhiyo"
      },
      "ti ettha devoti megho, tassa acchasukkhatāya ākāsamiva khāyamānassa animittagajjitaṃ devadundubhi nāma, yaṃ ‘‘ākāsadundubhī’’tipi vadanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Phaliṃsū"
      },
      "ti thaniṃsu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pabbatānaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "naccehī"
      },
      "ti pathavīkampena ito cito ca bhamantānaṃ pabbatānaṃ naccehi. Vimhayajātā yakkhā ‘‘hi’’ntisaddaṃ nicchārentīti āha ‘‘yakkhānaṃ hiṅkārehī’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sakasakapaṭibhānehī"
      },
      "ti attano attano sippakosallehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhisekaṃ datvā"
      },
      "ti anotattadahodakena abhisekaṃ datvā."
    ],
    "innerText": "Devadundubhiyoti ettha devoti megho, tassa acchasukkhatāya ākāsamiva khāyamānassa animittagajjitaṃ devadundubhi nāma, yaṃ ‘‘ākāsadundubhī’’tipi vadanti. Phaliṃsūti thaniṃsu. Pabbatānaṃnaccehīti pathavīkampena ito cito ca bhamantānaṃ pabbatānaṃ naccehi. Vimhayajātā yakkhā ‘‘hi’’ntisaddaṃ nicchārentīti āha ‘‘yakkhānaṃ hiṅkārehī’’ti. Sakasakapaṭibhānehīti attano attano sippakosallehi. Abhisekaṃ datvāti anotattadahodakena abhisekaṃ datvā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Devatākulānī"
      },
      "ti mahābodhiṃ parivāretvā ṭhitanāgayakkhādidevatākulāni datvāti sambandho. Gopakarājakammino tathā ‘‘taracchā’’ti vadanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iminā parivārenā"
      },
      "ti sahatthe karaṇavacanaṃ, iminā parivārena sahāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tāmalitti"
      },
      "nti evaṃnāmakaṃ samuddatīre paṭṭanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Idamassa tatiya"
      },
      "nti suvaṇṇakaṭāhe patiṭṭhitasākhābodhiyā rajjasampadānaṃ sandhāya vuttaṃ. Tato pana pubbe ekavāraṃ rajjasampadānaṃ acchinnāya sākhāya mahābodhiyā eva kataṃ, tena ",
      " saddhiṃ catukkhattuṃ rājā rajjena pūjesi. Rajjena pūjitadivasesu kira sakaladīpato uppannaṃ āyaṃ gahetvā mahābodhimeva pūjesi."
    ],
    "innerText": "Devatākulānīti mahābodhiṃ parivāretvā ṭhitanāgayakkhādidevatākulāni datvāti sambandho. Gopakarājakammino tathā ‘‘taracchā’’ti vadanti. Iminā parivārenāti sahatthe karaṇavacanaṃ, iminā parivārena sahāti attho. Tāmalittinti evaṃnāmakaṃ samuddatīre paṭṭanaṃ. Idamassa tatiyanti suvaṇṇakaṭāhe patiṭṭhitasākhābodhiyā rajjasampadānaṃ sandhāya vuttaṃ. Tato pana pubbe ekavāraṃ rajjasampadānaṃ acchinnāya sākhāya mahābodhiyā eva kataṃ, tena saddhiṃ catukkhattuṃ rājā rajjena pūjesi. Rajjena pūjitadivasesu kira sakaladīpato uppannaṃ āyaṃ gahetvā mahābodhimeva pūjesi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭhamapāṭipadadivase"
      },
      "ti sukkapakkhapāṭipadadivase. Tañhi kaṇhapakkhapāṭipadadivasaṃ apekkhitvā ‘‘paṭhamapāṭipadadivasa’’nti vuttaṃ, idañca tasmiṃ tambapaṇṇidīpe vohāraṃ gahetvā vuttaṃ, idha pana puṇṇamito paṭṭhāya yāva aparā puṇṇamī, tāva eko māsoti vohāro. Tasmā iminā vohārena ‘‘dutiyapāṭipadadivase’’ti vattabbaṃ siyā kaṇhapakkhapāṭipadassa idha paṭhamapāṭipadattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gacchati vatare"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "are"
      },
      "ti khede. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samantāyojana"
      },
      "nti accantasaṃyoge upayogavacanaṃ, yojanappamāṇe padese sabbatthāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Supaṇṇarūpenā"
      },
      "ti mahābodhiṃ balakkārena gahetvā nāgabhavanaṃ netukāmāni nāgarājakulāni iddhiyā gahitena garuḷarūpena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "santāseti"
      },
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃ vibhūtiṃ passitvā"
      },
      "ti devatādīhi karīyamānaṃ pūjāmahattaṃ, mahābodhiyā ca ānubhāvamahattaṃ disvā sayampi tathā pūjetukāmā theriṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yācitvā"
      },
      "ti yojanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samuddasālavatthusmi"
      },
      "nti yasmiṃ padese ṭhatvā rājā samudde āgacchantaṃ bodhiṃ therānubhāvena addasa, yattha ca pacchā samuddassa diṭṭhaṭṭhānanti pakāsetuṃ samuddasālaṃ nāma sālaṃ akaṃsu, tasmiṃ samuddasālāya vatthubhūte padese. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Therassā"
      },
      "ti mahāmahindattherassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pupphaagghiyānī"
      },
      "ti kūṭāgārasadisāni pupphacetiyāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āgato vatare"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "are"
      },
      "ti pamode. Aṭṭhahi amaccakulehi aṭṭhahi brāhmaṇakulehi cāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "soḷasahi jātisampannakulehi. Rajjaṃ vicāresī"
      },
      "ti rajjaṃ vicāretuṃ vissajjesi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rājavatthudvārakoṭṭhakaṭṭhāne"
      },
      "ti rājuyyānassa dvārakoṭṭhakaṭṭhāne. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anupubbavipassana"
      },
      "nti udayabbayādianupubbavipassanaṃ. ‘‘Saha bodhipatiṭṭhānenā’’ti karaṇavacanena vattabbe vibhattipariṇāmena ‘‘saha bodhipatiṭṭhānā’’ti nissakkavacanaṃ kataṃ. Sati hi sahasaddappayoge karaṇavacaneneva bhavitabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dassiṃsū"
      },
      "ti paññāyiṃsu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahāāsanaṭṭhāne"
      },
      "ti pubbapasse mahāsilāsanena patiṭṭhitaṭṭhāne. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pūjetvā vandī"
      },
      "ti āgāminaṃ ",
      " mahācetiyaṃ vandi. Purime pana mahāvihāraṭṭhāne pūjāmattasseva katattā anāgate saṅghassapi navakatā avanditabbatā ca pakāsitāti veditabbā. Anāgate pana metteyyādibuddhā paccekabuddhā ca buddhabhāvakkhaṇaṃ uddissa vanditabbāva sabhāvena visiṭṭhapuggalattāti gahetabbaṃ."
    ],
    "innerText": "Paṭhamapāṭipadadivaseti sukkapakkhapāṭipadadivase. Tañhi kaṇhapakkhapāṭipadadivasaṃ apekkhitvā ‘‘paṭhamapāṭipadadivasa’’nti vuttaṃ, idañca tasmiṃ tambapaṇṇidīpe vohāraṃ gahetvā vuttaṃ, idha pana puṇṇamito paṭṭhāya yāva aparā puṇṇamī, tāva eko māsoti vohāro. Tasmā iminā vohārena ‘‘dutiyapāṭipadadivase’’ti vattabbaṃ siyā kaṇhapakkhapāṭipadassa idha paṭhamapāṭipadattā. Gacchati vatareti ettha areti khede. Samantāyojananti accantasaṃyoge upayogavacanaṃ, yojanappamāṇe padese sabbatthāti attho. Supaṇṇarūpenāti mahābodhiṃ balakkārena gahetvā nāgabhavanaṃ netukāmāni nāgarājakulāni iddhiyā gahitena garuḷarūpena santāseti. Taṃ vibhūtiṃ passitvāti devatādīhi karīyamānaṃ pūjāmahattaṃ, mahābodhiyā ca ānubhāvamahattaṃ disvā sayampi tathā pūjetukāmā theriṃ yācitvāti yojanā. Samuddasālavatthusminti yasmiṃ padese ṭhatvā rājā samudde āgacchantaṃ bodhiṃ therānubhāvena addasa, yattha ca pacchā samuddassa diṭṭhaṭṭhānanti pakāsetuṃ samuddasālaṃ nāma sālaṃ akaṃsu, tasmiṃ samuddasālāya vatthubhūte padese. Therassāti mahāmahindattherassa. Pupphaagghiyānīti kūṭāgārasadisāni pupphacetiyāni. Āgato vatareti ettha areti pamode. Aṭṭhahi amaccakulehi aṭṭhahi brāhmaṇakulehi cāti soḷasahi jātisampannakulehi. Rajjaṃ vicāresīti rajjaṃ vicāretuṃ vissajjesi. Rājavatthudvārakoṭṭhakaṭṭhāneti rājuyyānassa dvārakoṭṭhakaṭṭhāne. Anupubbavipassananti udayabbayādianupubbavipassanaṃ. ‘‘Saha bodhipatiṭṭhānenā’’ti karaṇavacanena vattabbe vibhattipariṇāmena ‘‘saha bodhipatiṭṭhānā’’ti nissakkavacanaṃ kataṃ. Sati hi sahasaddappayoge karaṇavacaneneva bhavitabbaṃ. Dassiṃsūti paññāyiṃsu. Mahāāsanaṭṭhāneti pubbapasse mahāsilāsanena patiṭṭhitaṭṭhāne. Pūjetvā vandīti āgāminaṃ mahācetiyaṃ vandi. Purime pana mahāvihāraṭṭhāne pūjāmattasseva katattā anāgate saṅghassapi navakatā avanditabbatā ca pakāsitāti veditabbā. Anāgate pana metteyyādibuddhā paccekabuddhā ca buddhabhāvakkhaṇaṃ uddissa vanditabbāva sabhāvena visiṭṭhapuggalattāti gahetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahāariṭṭho"
      },
      "ti ",
      " pañcapaññāsāya bhātukehi saddhiṃ cetiyagirimhi pabbajitaṃ sandhāya vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Meghavaṇṇābhayaamaccassa pariveṇaṭṭhāne"
      },
      "ti meghavaṇṇaabhayassa rañño amaccena kattabbassa pariveṇassa vatthubhūte ṭhāne. Maṅgalanimittabhāvena ākāse samuppanno manoharasaddo ākāsassa ravo viya hotīti vuttaṃ ‘‘ākāsaṃ mahāviravaṃ ravī’’ti. Na hi ākāso nāma koci dhammo atthi, yo saddaṃ samuṭṭhāpeyya, ākāsagatautuvisesasamuṭṭhitova so saddoti gahetabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭhamakattikapavāraṇadivase…pe… vinayapiṭakaṃ pakāsesī"
      },
      "ti idaṃ vinayaṃ vācetuṃ āraddhadivasaṃ sandhāya vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anusiṭṭhikarāna"
      },
      "nti anusāsanīkarānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rājino"
      },
      "ti upayogatthe sāmivacanaṃ, devānaṃpiyatissarājānanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aññepī"
      },
      "ti mahindādīhi aṭṭhasaṭṭhimahātherehi aññepi, tesaṃ sarūpaṃ dassento āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tesaṃ therāna"
      },
      "ntiādi. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tesaṃ therānaṃ antevāsikā"
      },
      "ti mahindattherādīnaṃ aṭṭhasaṭṭhimahātherānaṃ ariṭṭhādayo antevāsikā ca mahāariṭṭhattherassa antevāsikā tissadattakāḷasumanādayo cāti yojetabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Antevāsikānaṃ antevāsikā"
      },
      "ti ubhayattha vuttaantevāsikānaṃ antevāsikaparamparā cāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pubbe vuttappakārā"
      },
      "ti mahindo iṭṭiyo uttiyotiādigāthāhi (pārā. aṭṭha. 1.tatiyasaṅgītikathā) pakāsitā ācariyaparamparā."
    ],
    "innerText": "Mahāariṭṭhoti pañcapaññāsāya bhātukehi saddhiṃ cetiyagirimhi pabbajitaṃ sandhāya vuttaṃ. Meghavaṇṇābhayaamaccassa pariveṇaṭṭhāneti meghavaṇṇaabhayassa rañño amaccena kattabbassa pariveṇassa vatthubhūte ṭhāne. Maṅgalanimittabhāvena ākāse samuppanno manoharasaddo ākāsassa ravo viya hotīti vuttaṃ ‘‘ākāsaṃ mahāviravaṃ ravī’’ti. Na hi ākāso nāma koci dhammo atthi, yo saddaṃ samuṭṭhāpeyya, ākāsagatautuvisesasamuṭṭhitova so saddoti gahetabbo. Paṭhamakattikapavāraṇadivase…pe… vinayapiṭakaṃ pakāsesīti idaṃ vinayaṃ vācetuṃ āraddhadivasaṃ sandhāya vuttaṃ. Anusiṭṭhikarānanti anusāsanīkarānaṃ. Rājinoti upayogatthe sāmivacanaṃ, devānaṃpiyatissarājānanti attho. Aññepīti mahindādīhi aṭṭhasaṭṭhimahātherehi aññepi, tesaṃ sarūpaṃ dassento āha tesaṃ therānantiādi. Tattha tesaṃ therānaṃ antevāsikāti mahindattherādīnaṃ aṭṭhasaṭṭhimahātherānaṃ ariṭṭhādayo antevāsikā ca mahāariṭṭhattherassa antevāsikā tissadattakāḷasumanādayo cāti yojetabbaṃ. Antevāsikānaṃ antevāsikāti ubhayattha vuttaantevāsikānaṃ antevāsikaparamparā cāti attho. Pubbe vuttappakārāti mahindo iṭṭiyo uttiyotiādigāthāhi (pārā. aṭṭha. 1.tatiyasaṅgītikathā) pakāsitā ācariyaparamparā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na paggharatī"
      },
      "ti na gaḷati, na pamussatīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Satigatidhitimantesū"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "satī"
      },
      "ti uggahadhāraṇe sati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gatī"
      },
      "ti saddatthavibhāgaggahaṇe ñāṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhitī"
      },
      "ti uggahapariharaṇādīsu vīriyaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kukkuccakesū"
      },
      "ti ‘‘kappati na kappatī’’ti vīmaṃsakukkuccakārīsu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mātāpituṭṭhāniyo"
      },
      "ti vatvā tamevatthaṃ samatthetuṃ āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tadāyattāhī"
      },
      "tiādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vinayapariyattiṃ nissāyā"
      },
      "ti vinayapiṭakapariyāpuṇanaṃ nissāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attano sīlakkhandho sugutto"
      },
      "ti lajjino vinayadhāraṇassa alajjiaññāṇatādīhi chahi ākārehi āpattiyā anāpajjanato attano sīlakkhandho khaṇḍādidosavirahito sugutto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "surakkhito"
      },
      " hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kukkuccapakatāna"
      },
      "nti kappiyākappiyaṃ nissāya uppannena kukkuccena pakatānaṃ upaddutānaṃ abhibhūtānaṃ yathāvinayaṃ kukkuccaṃ vinodetvā suddhante patiṭṭhāpanena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭisaraṇaṃ hoti"
      },
      ". Vigato sārado bhayametassāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "visārado"
      },
      ". ‘‘Evaṃ kathentassa doso evaṃ na doso’’ti ñatvāva kathanato nibbhayova ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṅghamajjhe voharati"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": ". Paccatthike"
      },
      "ti attapaccatthike ceva vajjiputtakādisāsanapaccatthike ca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sahadhammenā"
      },
      "ti sakāraṇena vacanena sikkhāpadaṃ dassetvā yathā te asaddhammaṃ patiṭṭhāpetuṃ na sakkonti, evaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "suniggahitaṃ"
      },
      " katvā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "niggaṇhāti. Saddhammaṭṭhitiyā"
      },
      "ti ",
      " pariyattipaṭipattipaṭivedhasaṅkhātassa tividhassāpi saddhammassa ṭhitiyā, pavattiyāti attho."
    ],
    "innerText": "Na paggharatīti na gaḷati, na pamussatīti attho. Satigatidhitimantesūti ettha satīti uggahadhāraṇe sati. Gatīti saddatthavibhāgaggahaṇe ñāṇaṃ. Dhitīti uggahapariharaṇādīsu vīriyaṃ. Kukkuccakesūti ‘‘kappati na kappatī’’ti vīmaṃsakukkuccakārīsu. Mātāpituṭṭhāniyoti vatvā tamevatthaṃ samatthetuṃ āha tadāyattāhītiādi. Vinayapariyattiṃ nissāyāti vinayapiṭakapariyāpuṇanaṃ nissāya. Attano sīlakkhandho suguttoti lajjino vinayadhāraṇassa alajjiaññāṇatādīhi chahi ākārehi āpattiyā anāpajjanato attano sīlakkhandho khaṇḍādidosavirahito sugutto surakkhito hoti. Kukkuccapakatānanti kappiyākappiyaṃ nissāya uppannena kukkuccena pakatānaṃ upaddutānaṃ abhibhūtānaṃ yathāvinayaṃ kukkuccaṃ vinodetvā suddhante patiṭṭhāpanena paṭisaraṇaṃ hoti. Vigato sārado bhayametassāti visārado. ‘‘Evaṃ kathentassa doso evaṃ na doso’’ti ñatvāva kathanato nibbhayova saṅghamajjhe voharati. Paccatthiketi attapaccatthike ceva vajjiputtakādisāsanapaccatthike ca. Sahadhammenāti sakāraṇena vacanena sikkhāpadaṃ dassetvā yathā te asaddhammaṃ patiṭṭhāpetuṃ na sakkonti, evaṃ suniggahitaṃ katvā niggaṇhāti. Saddhammaṭṭhitiyāti pariyattipaṭipattipaṭivedhasaṅkhātassa tividhassāpi saddhammassa ṭhitiyā, pavattiyāti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vinayo saṃvaratthāyā"
      },
      "tiādīsu vinayapariyāpuṇanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vinayo,"
      },
      " vinayapaññatti vā kāyavacīdvārasaṃvaratthāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avippaṭisāro"
      },
      "ti katākataṃ nissāya vippaṭisārābhāvo santāpābhāvo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāmojjaṃ"
      },
      " taruṇapīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pīti"
      },
      " nāma balavapīti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Passaddhī"
      },
      "ti kāyacittapassaddhi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yathābhūtañāṇadassana"
      },
      "nti sappaccayanāmarūpapariggaho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nibbidā"
      },
      "ti vipassanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Virāgo"
      },
      "ti ariyamaggo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vimuttī"
      },
      "ti aggaphalaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vimuttiñāṇadassana"
      },
      "nti paccavekkhaṇañāṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anupādā"
      },
      "ti kañci dhammaṃ anupādiyitvā pariccajitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parinibbānatthāyā"
      },
      "ti paccavekkhaṇañāṇe anuppanne antarā parinibbānābhāvena taṃparinibbānatthāyāti paccayattena vuttaṃ anantarādipaccayattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Etadatthā kathā"
      },
      "ti ayaṃ vinayakathā nāma etassa anupādāparinibbānassa atthāyāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mantanā"
      },
      "ti vinayamantanāyeva, bhikkhūnaṃ ‘‘evaṃ karissāma, evaṃ na karissāmā’’ti vinayapaṭibaddhamantanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upanisā"
      },
      "ti upanisīdati ettha phalanti upanisā, kāraṇaṃ. Vinayo saṃvaratthāyātiādikāraṇaparamparāpi etadatthāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sotāvadhāna"
      },
      "nti imissā paramparapaccayakathāya attānaṃ samanatthāya sotāvadhānaṃ, tampi etamatthaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yadida"
      },
      "nti nipāto. Yo ayaṃ catūhi upādānehi anupādiyitvā cittassa arahattamaggasaṅkhāto, tapphalasaṅkhāto vā vimokkho, sopi etadatthāya anupādāparinibbānatthāya. Atha vā yo ayaṃ kañci dhammaṃ anupādācittassa ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vimokkho"
      },
      " vimuccanaṃ vigamo parinibbānaṃ etadatthā kathāti evaṃ upasaṃharaṇavasena yojetumpi vaṭṭati maggaphalavimokkhassa pubbe vuttattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āyogo"
      },
      "ti uggahaṇādivasena punappunaṃ abhiyogo."
    ],
    "innerText": "Vinayo saṃvaratthāyātiādīsu vinayapariyāpuṇanaṃ vinayo, vinayapaññatti vā kāyavacīdvārasaṃvaratthāya. Avippaṭisāroti katākataṃ nissāya vippaṭisārābhāvo santāpābhāvo. Pāmojjaṃ taruṇapīti. Pīti nāma balavapīti. Passaddhīti kāyacittapassaddhi. Yathābhūtañāṇadassananti sappaccayanāmarūpapariggaho. Nibbidāti vipassanā. Virāgoti ariyamaggo. Vimuttīti aggaphalaṃ. Vimuttiñāṇadassananti paccavekkhaṇañāṇaṃ. Anupādāti kañci dhammaṃ anupādiyitvā pariccajitvā. Parinibbānatthāyāti paccavekkhaṇañāṇe anuppanne antarā parinibbānābhāvena taṃparinibbānatthāyāti paccayattena vuttaṃ anantarādipaccayattā. Etadatthā kathāti ayaṃ vinayakathā nāma etassa anupādāparinibbānassa atthāyāti attho. Mantanāti vinayamantanāyeva, bhikkhūnaṃ ‘‘evaṃ karissāma, evaṃ na karissāmā’’ti vinayapaṭibaddhamantanā. Upanisāti upanisīdati ettha phalanti upanisā, kāraṇaṃ. Vinayo saṃvaratthāyātiādikāraṇaparamparāpi etadatthāti attho. Sotāvadhānanti imissā paramparapaccayakathāya attānaṃ samanatthāya sotāvadhānaṃ, tampi etamatthaṃ. Yadidanti nipāto. Yo ayaṃ catūhi upādānehi anupādiyitvā cittassa arahattamaggasaṅkhāto, tapphalasaṅkhāto vā vimokkho, sopi etadatthāya anupādāparinibbānatthāya. Atha vā yo ayaṃ kañci dhammaṃ anupādācittassa vimokkho vimuccanaṃ vigamo parinibbānaṃ etadatthā kathāti evaṃ upasaṃharaṇavasena yojetumpi vaṭṭati maggaphalavimokkhassa pubbe vuttattā. Āyogoti uggahaṇādivasena punappunaṃ abhiyogo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ācariyaparamparakathāvaṇṇanānayo niṭṭhito."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti samantapāsādikāya vinayaṭṭhakathāya vimativinodaniyaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Bāhiranidānakathāvaṇṇanānayo niṭṭhito."
  }
]