[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "6. Macchamaṃsavinicchayakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "38"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Macchamaṃsesu"
      },
      " pana macchaggahaṇena sabbampi jalajaṃ vuttaṃ. Tattha akappiyaṃ nāma natthi. Maṃsesu pana manussahatthiassasunakhaahisīhabyagghadīpiacchataracchānaṃ vasena dasa maṃsāni akappiyāni. Tattha manussamaṃse thullaccayaṃ, sesesu dukkaṭaṃ. Iti imesaṃ manussādīnaṃ dasannaṃ maṃsampi aṭṭhipi lohitampi cammampi lomampi sabbaṃ na vaṭṭati. Vasāsu pana ekā manussavasāva na vaṭṭati. Khīrādīsu akappiyaṃ nāma natthi. Imesu pana akappiyamaṃsesu aṭṭhiādīsu vā yaṃ kiñci ñatvā vā añatvā vā khādantassa āpattiyeva. Yadā jānāti, tadā desetabbā. ‘‘Apucchitvāva khādissāmī’’ti gaṇhato paṭiggahaṇepi dukkaṭaṃ, ‘‘pucchitvā khādissāmī’’ti gaṇhato ",
      " anāpatti. Uddissakataṃ pana jānitvā khādantasseva āpatti, pacchā jānanto āpattiyā na kāretabbo (mahāva. aṭṭha. 281)."
    ],
    "innerText": "38.Macchamaṃsesu pana macchaggahaṇena sabbampi jalajaṃ vuttaṃ. Tattha akappiyaṃ nāma natthi. Maṃsesu pana manussahatthiassasunakhaahisīhabyagghadīpiacchataracchānaṃ vasena dasa maṃsāni akappiyāni. Tattha manussamaṃse thullaccayaṃ, sesesu dukkaṭaṃ. Iti imesaṃ manussādīnaṃ dasannaṃ maṃsampi aṭṭhipi lohitampi cammampi lomampi sabbaṃ na vaṭṭati. Vasāsu pana ekā manussavasāva na vaṭṭati. Khīrādīsu akappiyaṃ nāma natthi. Imesu pana akappiyamaṃsesu aṭṭhiādīsu vā yaṃ kiñci ñatvā vā añatvā vā khādantassa āpattiyeva. Yadā jānāti, tadā desetabbā. ‘‘Apucchitvāva khādissāmī’’ti gaṇhato paṭiggahaṇepi dukkaṭaṃ, ‘‘pucchitvā khādissāmī’’ti gaṇhato anāpatti. Uddissakataṃ pana jānitvā khādantasseva āpatti, pacchā jānanto āpattiyā na kāretabbo (mahāva. aṭṭha. 281)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha (pārā. aṭṭha. 2.410) ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uddissakataṃ"
      },
      " nāma bhikkhūnaṃ atthāya vadhitvā sampāditaṃ macchamaṃsaṃ. Ubhayampi hi uddissakataṃ na vaṭṭati. Tampi adiṭṭhaṃ asutaṃ aparisaṅkitaṃ vaṭṭati. Tikoṭiparisuddhañhi macchamaṃsaṃ bhagavatā anuññātaṃ adiṭṭhaṃ asutaṃ aparisaṅkitaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "adiṭṭhaṃ"
      },
      " nāma bhikkhūnaṃ atthāya migamacche vadhitvā gayhamānaṃ adiṭṭhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asutaṃ"
      },
      " nāma bhikkhūnaṃ atthāya migamacche vadhitvā gahitanti asutaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aparisaṅkitaṃ"
      },
      " pana diṭṭhaparisaṅkitaṃ sutaparisaṅkitaṃ tadubhayavinimuttaparisaṅkitañca ñatvā tabbipakkhato jānitabbaṃ. Kathaṃ? Idha bhikkhū passanti manusse jālavāgurādihatthe gāmato vā nikkhamante araññe vā vicarante. Dutiyadivase ca nesaṃ taṃ gāmaṃ piṇḍāya paviṭṭhānaṃ samacchamaṃsaṃ piṇḍapātaṃ abhiharanti. Te tena diṭṭhena parisaṅkanti ‘‘bhikkhūnaṃ nu kho atthāya kata’’nti, idaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "diṭṭhaparisaṅkitaṃ,"
      },
      " etaṃ gahetuṃ na vaṭṭati. Yaṃ evaṃ aparisaṅkitaṃ, taṃ vaṭṭati. Sace pana te manussā ‘‘kasmā, bhante, na gaṇhathā’’ti pucchitvā tamatthaṃ sutvā ‘‘nayidaṃ, bhante, bhikkhūnaṃ atthāya kataṃ, amhehi attano atthāya vā rājayuttādīnaṃ vā atthāya kata’’nti vadanti, kappati."
    ],
    "innerText": "Tattha (pārā. aṭṭha. 2.410) uddissakataṃ nāma bhikkhūnaṃ atthāya vadhitvā sampāditaṃ macchamaṃsaṃ. Ubhayampi hi uddissakataṃ na vaṭṭati. Tampi adiṭṭhaṃ asutaṃ aparisaṅkitaṃ vaṭṭati. Tikoṭiparisuddhañhi macchamaṃsaṃ bhagavatā anuññātaṃ adiṭṭhaṃ asutaṃ aparisaṅkitaṃ. Tattha adiṭṭhaṃ nāma bhikkhūnaṃ atthāya migamacche vadhitvā gayhamānaṃ adiṭṭhaṃ. Asutaṃ nāma bhikkhūnaṃ atthāya migamacche vadhitvā gahitanti asutaṃ. Aparisaṅkitaṃ pana diṭṭhaparisaṅkitaṃ sutaparisaṅkitaṃ tadubhayavinimuttaparisaṅkitañca ñatvā tabbipakkhato jānitabbaṃ. Kathaṃ? Idha bhikkhū passanti manusse jālavāgurādihatthe gāmato vā nikkhamante araññe vā vicarante. Dutiyadivase ca nesaṃ taṃ gāmaṃ piṇḍāya paviṭṭhānaṃ samacchamaṃsaṃ piṇḍapātaṃ abhiharanti. Te tena diṭṭhena parisaṅkanti ‘‘bhikkhūnaṃ nu kho atthāya kata’’nti, idaṃ diṭṭhaparisaṅkitaṃ, etaṃ gahetuṃ na vaṭṭati. Yaṃ evaṃ aparisaṅkitaṃ, taṃ vaṭṭati. Sace pana te manussā ‘‘kasmā, bhante, na gaṇhathā’’ti pucchitvā tamatthaṃ sutvā ‘‘nayidaṃ, bhante, bhikkhūnaṃ atthāya kataṃ, amhehi attano atthāya vā rājayuttādīnaṃ vā atthāya kata’’nti vadanti, kappati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Na heva kho bhikkhū passanti, apica kho suṇanti ‘‘manussā kira jālavāgurādihatthā gāmato vā nikkhamanti, araññe vā vicarantī’’ti. Dutiyadivase ca tesaṃ taṃ gāmaṃ piṇḍāya paviṭṭhānaṃ samacchamaṃsaṃ piṇḍapātaṃ abhiharanti. Te tena sutena parisaṅkanti ‘‘bhikkhūnaṃ nu ",
      " kho atthāya kata’’nti, idaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sutaparisaṅkitaṃ"
      },
      " nāma, etaṃ gahetuṃ na vaṭṭati. Yaṃ evaṃ aparisaṅkitaṃ, taṃ vaṭṭati. Sace pana te manussā ‘‘kasmā, bhante, na gaṇhathā’’ti pucchitvā tamatthaṃ sutvā ‘‘nayidaṃ, bhante, bhikkhūnaṃ atthāya kataṃ, amhehi attano atthāya vā rājayuttādīnaṃ vā atthāya kata’’nti vadanti, kappati."
    ],
    "innerText": "Na heva kho bhikkhū passanti, apica kho suṇanti ‘‘manussā kira jālavāgurādihatthā gāmato vā nikkhamanti, araññe vā vicarantī’’ti. Dutiyadivase ca tesaṃ taṃ gāmaṃ piṇḍāya paviṭṭhānaṃ samacchamaṃsaṃ piṇḍapātaṃ abhiharanti. Te tena sutena parisaṅkanti ‘‘bhikkhūnaṃ nu kho atthāya kata’’nti, idaṃ sutaparisaṅkitaṃ nāma, etaṃ gahetuṃ na vaṭṭati. Yaṃ evaṃ aparisaṅkitaṃ, taṃ vaṭṭati. Sace pana te manussā ‘‘kasmā, bhante, na gaṇhathā’’ti pucchitvā tamatthaṃ sutvā ‘‘nayidaṃ, bhante, bhikkhūnaṃ atthāya kataṃ, amhehi attano atthāya vā rājayuttādīnaṃ vā atthāya kata’’nti vadanti, kappati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Na heva kho pana bhikkhū passanti na suṇanti, apica kho tesaṃ taṃ gāmaṃ piṇḍāya paviṭṭhānaṃ pattaṃ gahetvā samacchamaṃsaṃ piṇḍapātaṃ abhisaṅkharitvā abhiharanti. Te parisaṅkanti ‘‘bhikkhūnaṃ nu kho atthāya kata’’nti, idaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tadubhayavinimuttaparisaṅkitaṃ"
      },
      " nāma, etampi gahetuṃ na vaṭṭati. Yaṃ evaṃ aparisaṅkitaṃ, taṃ vaṭṭati. Sace pana te manussā ‘‘kasmā, bhante, na gaṇhathā’’ti pucchitvā ",
      " tamatthaṃ sutvā ‘‘nayidaṃ, bhante, bhikkhūnaṃ atthāya kataṃ, amhehi attano atthāya vā rājayuttādīnaṃ vā atthāya kataṃ, pavattamaṃsaṃ vā kappiyameva labhitvā bhikkhūnaṃ atthāya sampādita’’nti vadanti, kappati. Matānaṃ petakiccatthāya maṅgalādīnaṃ vā atthāya katepi eseva nayo. Yaṃ yañhi bhikkhūnaṃyeva atthāya akataṃ, yattha ca nibbematiko hoti, taṃ sabbaṃ kappati."
    ],
    "innerText": "Na heva kho pana bhikkhū passanti na suṇanti, apica kho tesaṃ taṃ gāmaṃ piṇḍāya paviṭṭhānaṃ pattaṃ gahetvā samacchamaṃsaṃ piṇḍapātaṃ abhisaṅkharitvā abhiharanti. Te parisaṅkanti ‘‘bhikkhūnaṃ nu kho atthāya kata’’nti, idaṃ tadubhayavinimuttaparisaṅkitaṃ nāma, etampi gahetuṃ na vaṭṭati. Yaṃ evaṃ aparisaṅkitaṃ, taṃ vaṭṭati. Sace pana te manussā ‘‘kasmā, bhante, na gaṇhathā’’ti pucchitvā tamatthaṃ sutvā ‘‘nayidaṃ, bhante, bhikkhūnaṃ atthāya kataṃ, amhehi attano atthāya vā rājayuttādīnaṃ vā atthāya kataṃ, pavattamaṃsaṃ vā kappiyameva labhitvā bhikkhūnaṃ atthāya sampādita’’nti vadanti, kappati. Matānaṃ petakiccatthāya maṅgalādīnaṃ vā atthāya katepi eseva nayo. Yaṃ yañhi bhikkhūnaṃyeva atthāya akataṃ, yattha ca nibbematiko hoti, taṃ sabbaṃ kappati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "39"
      },
      ". Sace pana ekasmiṃ vihāre bhikkhūnaṃ uddissakataṃ hoti, te ca attano atthāya katabhāvaṃ na jānanti, aññe jānanti. Ye jānanti, tesaṃ na vaṭṭati, itaresaṃ pana vaṭṭati. Aññe na jānanti, teyeva jānanti, tesaṃyeva na vaṭṭati, aññesaṃ vaṭṭati. Tepi ‘‘amhākaṃ atthāya kata’’nti jānanti, aññepi ‘‘etesaṃ atthāya kata’’nti jānanti, sabbesampi na vaṭṭati. Sabbe na jānanti, sabbesampi vaṭṭati. Pañcasu hi sahadhammikesu yassa vā tassa vā atthāya uddissakataṃ sabbesaṃ na kappati."
    ],
    "innerText": "39. Sace pana ekasmiṃ vihāre bhikkhūnaṃ uddissakataṃ hoti, te ca attano atthāya katabhāvaṃ na jānanti, aññe jānanti. Ye jānanti, tesaṃ na vaṭṭati, itaresaṃ pana vaṭṭati. Aññe na jānanti, teyeva jānanti, tesaṃyeva na vaṭṭati, aññesaṃ vaṭṭati. Tepi ‘‘amhākaṃ atthāya kata’’nti jānanti, aññepi ‘‘etesaṃ atthāya kata’’nti jānanti, sabbesampi na vaṭṭati. Sabbe na jānanti, sabbesampi vaṭṭati. Pañcasu hi sahadhammikesu yassa vā tassa vā atthāya uddissakataṃ sabbesaṃ na kappati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sace pana koci ekaṃ bhikkhuṃ uddissa pāṇaṃ vadhitvā tassa pattaṃ pūretvā deti, so ca attano atthāya katabhāvaṃ jānaṃyeva gahetvā aññassa bhikkhuno deti, so taṃ tassa saddhāya paribhuñjati, kassa āpattīti? Dvinnampi anāpatti. Yañhi uddissa kataṃ, tassa abhuttatāya anāpatti, itarassa ajānanatāya. Kappiyamaṃsassa hi paṭiggahaṇe āpatti natthi, uddissakatañca ajānitvā bhuttassa pacchā ñatvā āpattidesanākiccaṃ nāma natthi. Akappiyamaṃsaṃ pana ajānitvā bhuttena pacchā ñatvāpi āpatti desetabbā. Uddissakatañhi ñatvā bhuñjatova āpatti, akappiyamaṃsaṃ ajānitvā bhuñjantassapi āpattiyeva, tasmā āpattibhīrukena rūpaṃ sallakkhentenapi pucchitvāva maṃsaṃ paṭiggahetabbaṃ. Paribhogakāle ‘‘pucchitvā ",
      " paribhuñjissāmī’’ti vā gahetvā pucchitvāva paribhuñjitabbaṃ. Kasmā? Duviññeyyattā. Acchamaṃsampi hi sūkaramaṃsasadisaṃ hoti, dīpimaṃsādīni ca migamaṃsādisadisāni, tasmā pucchitvā gahaṇameva vattanti vadanti."
    ],
    "innerText": "Sace pana koci ekaṃ bhikkhuṃ uddissa pāṇaṃ vadhitvā tassa pattaṃ pūretvā deti, so ca attano atthāya katabhāvaṃ jānaṃyeva gahetvā aññassa bhikkhuno deti, so taṃ tassa saddhāya paribhuñjati, kassa āpattīti? Dvinnampi anāpatti. Yañhi uddissa kataṃ, tassa abhuttatāya anāpatti, itarassa ajānanatāya. Kappiyamaṃsassa hi paṭiggahaṇe āpatti natthi, uddissakatañca ajānitvā bhuttassa pacchā ñatvā āpattidesanākiccaṃ nāma natthi. Akappiyamaṃsaṃ pana ajānitvā bhuttena pacchā ñatvāpi āpatti desetabbā. Uddissakatañhi ñatvā bhuñjatova āpatti, akappiyamaṃsaṃ ajānitvā bhuñjantassapi āpattiyeva, tasmā āpattibhīrukena rūpaṃ sallakkhentenapi pucchitvāva maṃsaṃ paṭiggahetabbaṃ. Paribhogakāle ‘‘pucchitvā paribhuñjissāmī’’ti vā gahetvā pucchitvāva paribhuñjitabbaṃ. Kasmā? Duviññeyyattā. Acchamaṃsampi hi sūkaramaṃsasadisaṃ hoti, dīpimaṃsādīni ca migamaṃsādisadisāni, tasmā pucchitvā gahaṇameva vattanti vadanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti pāḷimuttakavinayavinicchayasaṅgahe"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Macchamaṃsavinicchayakathā samattā."
  }
]