[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "Sekhiyakaṇḍo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Parimaṇḍalasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sekhiyesu ",
      " paṭhame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "parimaṇḍala"
      },
      "nti samantato maṇḍalaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sikkhā karaṇīyā"
      },
      "ti ‘‘evaṃ nivāsessāmī’’ti ārāmepi antaragharepi sabbattha sikkhā ",
      " kātabbā, ettha ca yasmā vattakkhandhake vuttavattānipi sikkhitabbattā sekhiyāneva honti, tasmā pārājikādīsu viya paricchedo na kato. Cārittavinayadassanatthañca ‘‘yo pana bhikkhu olambento nivāseyya, dukkaṭa’’nti evaṃ āpattināmena avatvā ‘‘sikkhā karaṇīyā’’ti evaṃ sabbasikkhāpadesu pāḷi āropitā, padabhājane (pāci. 576) pana ‘‘āpatti dukkaṭassā’’ti vuttattā sabbattha anādariyakaraṇe dukkaṭaṃ veditabbaṃ."
    ],
    "innerText": "Sekhiyesu paṭhame parimaṇḍalanti samantato maṇḍalaṃ. Sikkhā karaṇīyāti ‘‘evaṃ nivāsessāmī’’ti ārāmepi antaragharepi sabbattha sikkhā kātabbā, ettha ca yasmā vattakkhandhake vuttavattānipi sikkhitabbattā sekhiyāneva honti, tasmā pārājikādīsu viya paricchedo na kato. Cārittavinayadassanatthañca ‘‘yo pana bhikkhu olambento nivāseyya, dukkaṭa’’nti evaṃ āpattināmena avatvā ‘‘sikkhā karaṇīyā’’ti evaṃ sabbasikkhāpadesu pāḷi āropitā, padabhājane (pāci. 576) pana ‘‘āpatti dukkaṭassā’’ti vuttattā sabbattha anādariyakaraṇe dukkaṭaṃ veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "parimaṇḍala"
      },
      "nti ettha nābhimaṇḍalaṃ paṭicchādetvā jāṇumaṇḍalassa heṭṭhā jaṅghaṭṭhikato paṭṭhāya aṭṭhaṅgulamattaṃ nivāsanaṃ otāretvā nivāsentena parimaṇḍalaṃ nivatthaṃ nāma hoti, evaṃ anivāsetvā anādariyena purato vā pacchato vā olambetvā nivāsentassa dukkaṭaṃ. Na kevalañca tasseva, ye caññe ‘‘tena kho pana samayena chabbaggiyā gihinivatthaṃ nivāsenti, hatthisoṇḍakaṃ macchavālakaṃ catukkaṇṇakaṃ tālavaṇṭakaṃ satavalikaṃ nivāsenti, saṃvalliyaṃ nivāsentī’’ti khandhake (cūḷava. 280) nivāsanadosā vuttā, tathā nivāsentassapi dukkaṭameva."
    ],
    "innerText": "Idāni parimaṇḍalanti ettha nābhimaṇḍalaṃ paṭicchādetvā jāṇumaṇḍalassa heṭṭhā jaṅghaṭṭhikato paṭṭhāya aṭṭhaṅgulamattaṃ nivāsanaṃ otāretvā nivāsentena parimaṇḍalaṃ nivatthaṃ nāma hoti, evaṃ anivāsetvā anādariyena purato vā pacchato vā olambetvā nivāsentassa dukkaṭaṃ. Na kevalañca tasseva, ye caññe ‘‘tena kho pana samayena chabbaggiyā gihinivatthaṃ nivāsenti, hatthisoṇḍakaṃ macchavālakaṃ catukkaṇṇakaṃ tālavaṇṭakaṃ satavalikaṃ nivāsenti, saṃvalliyaṃ nivāsentī’’ti khandhake (cūḷava. 280) nivāsanadosā vuttā, tathā nivāsentassapi dukkaṭameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hatthisoṇḍakaṃ"
      },
      " nāma nābhimūlato hatthisoṇḍasaṇṭhānaṃ olambakaṃ katvā nivatthaṃ coḷikaitthīnaṃ nivāsanaṃ viya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Macchavālakaṃ"
      },
      " nāma ekatodasantaṃ ekato pāsantaṃ olambetvā nivatthaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Catukkaṇṇakaṃ"
      },
      " nāma upari dve, heṭṭhato dveti evaṃ cattāro kaṇṇe dassetvā nivatthaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tālavaṇṭakaṃ"
      },
      " nāma tālavaṇṭākārena sāṭakaṃ olambetvā nivatthaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Satavalikaṃ"
      },
      " nāma dīghasāṭakaṃ anekakkhattuṃ ",
      " obhujitvā ovaṭṭikaṃ karontena nivatthaṃ, vāmadakkhiṇapassesu vā nirantaraṃ valiyo dassetvā nivatthaṃ. Sace pana jāṇuto paṭṭhāya ekā vā dve vā valiyo paññāyanti, vaṭṭati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṃvalliya"
      },
      "nti ",
      " mallakammakārādīhi viya kacchaṃ bandhitvā nivatthaṃ. Evaṃ nivāsetuṃ gilānassāpi maggappaṭipannassāpi na vaṭṭati. Yampi maggaṃ gacchantā ekaṃ vā dve vā kaṇṇe ukkhipitvā antaravāsakassa upari lagganti, anto vā ekaṃ kāsāvaṃ tathā nivāsetvā bahi aparaṃ nivāsenti, sabbaṃ na vaṭṭati."
    ],
    "innerText": "Tattha hatthisoṇḍakaṃ nāma nābhimūlato hatthisoṇḍasaṇṭhānaṃ olambakaṃ katvā nivatthaṃ coḷikaitthīnaṃ nivāsanaṃ viya. Macchavālakaṃ nāma ekatodasantaṃ ekato pāsantaṃ olambetvā nivatthaṃ. Catukkaṇṇakaṃ nāma upari dve, heṭṭhato dveti evaṃ cattāro kaṇṇe dassetvā nivatthaṃ. Tālavaṇṭakaṃ nāma tālavaṇṭākārena sāṭakaṃ olambetvā nivatthaṃ. Satavalikaṃ nāma dīghasāṭakaṃ anekakkhattuṃ obhujitvā ovaṭṭikaṃ karontena nivatthaṃ, vāmadakkhiṇapassesu vā nirantaraṃ valiyo dassetvā nivatthaṃ. Sace pana jāṇuto paṭṭhāya ekā vā dve vā valiyo paññāyanti, vaṭṭati. Saṃvalliyanti mallakammakārādīhi viya kacchaṃ bandhitvā nivatthaṃ. Evaṃ nivāsetuṃ gilānassāpi maggappaṭipannassāpi na vaṭṭati. Yampi maggaṃ gacchantā ekaṃ vā dve vā kaṇṇe ukkhipitvā antaravāsakassa upari lagganti, anto vā ekaṃ kāsāvaṃ tathā nivāsetvā bahi aparaṃ nivāsenti, sabbaṃ na vaṭṭati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Gilāno pana antokāsāvassa ovaṭṭikaṃ dassetvā aparaṃ upari nivāsetuṃ labhati, agilānena dve nivāsentena saguṇaṃ katvā nivāsetabbāni. Iti imaṃ khandhake paṭikkhittañca olambakañca sabbaṃ vivajjetvā vuttalakkhaṇasampannaṃ nibbikāraṃ parimaṇḍalaṃ nivāsetabbaṃ, tathā anivāsetvā yaṃkiñci vikāraṃ karontassa dukkaṭaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Nidānaṃ puggalaṃ vatthu’’ntiādike (kaṅkhā. aṭṭha. paṭhamapārājikavaṇṇanā ) pana vinicchaye surusurukārakaṃ kosambiyaṃ paññattaṃ, sāmisena hatthena pānīyathālakasasitthakapattadhovanapaṭisaṃyuttadvayaṃ bhaggesu sambahule bhikkhū ārabbha, sesāni sabbāneva sāvatthiyaṃ chabbaggiye ārabbha olambetvā nivāsanādivatthusmiṃ paññattāni. Sūpodanaviññattiyaṃ dhammadesanādīsu ca gilānavasena ekā anupaññatti, sabbāni sādhāraṇapaññattiyo, anāṇattikāni, sabbesu dukkaṭameva, añño ",
      " āpattibhedo natthi, vipattivicāraṇā vuttāyeva, samuṭṭhānādīni sabbesaṃ avasāne dassayissāma. Anāpattimattaṃ pana aṅgañca sabbattha vattabbaṃ, tayidaṃ vuccati. Imasmiṃ tāva sikkhāpade asañcicca, assatiyā, ajānantassa, gilānassa, āpadāsu, ummattakādīnañca anāpatti."
    ],
    "innerText": "‘‘Nidānaṃ puggalaṃ vatthu’’ntiādike (kaṅkhā. aṭṭha. paṭhamapārājikavaṇṇanā ) pana vinicchaye surusurukārakaṃ kosambiyaṃ paññattaṃ, sāmisena hatthena pānīyathālakasasitthakapattadhovanapaṭisaṃyuttadvayaṃ bhaggesu sambahule bhikkhū ārabbha, sesāni sabbāneva sāvatthiyaṃ chabbaggiye ārabbha olambetvā nivāsanādivatthusmiṃ paññattāni. Sūpodanaviññattiyaṃ dhammadesanādīsu ca gilānavasena ekā anupaññatti, sabbāni sādhāraṇapaññattiyo, anāṇattikāni, sabbesu dukkaṭameva, añño āpattibhedo natthi, vipattivicāraṇā vuttāyeva, samuṭṭhānādīni sabbesaṃ avasāne dassayissāma. Anāpattimattaṃ pana aṅgañca sabbattha vattabbaṃ, tayidaṃ vuccati. Imasmiṃ tāva sikkhāpade asañcicca, assatiyā, ajānantassa, gilānassa, āpadāsu, ummattakādīnañca anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "asañciccā"
      },
      "ti ‘‘aparimaṇḍalaṃ nivāsessāmī’’ti evaṃ asañcicca, atha kho ‘‘parimaṇḍalaṃyeva nivāsessāmī’’ti virajjhitvā aparimaṇḍalaṃ nivāsentassa anāpatti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Assatiyā"
      },
      "ti aññāvihitassāpi tathā nivāsentassa anāpatti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ajānantassā"
      },
      "ti parimaṇḍalaṃ nivāsetuṃ ajānantassa anāpatti, apica nivāsanavattaṃ uggahetabbaṃ. Yo pana sukkhajaṅgho vā hoti mahāpiṇḍikamaṃso vā, tassa sāruppatthāya aṭṭhaṅgulādhikampi otāretvā nivāsetuṃ vaṭṭati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gilānassā"
      },
      "ti yassa jaṅghāya vā pāde vā vaṇo hoti, tassa ukkhipitvā vā otāretvā vā nivāsetuṃ vaṭṭati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āpadāsū"
      },
      "ti vāḷā vā corā vā anubandhanti, evarūpāsu āpadāsu anāpatti ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ummattakā"
      },
      "dayo vuttanayā eva. Anādariyaṃ, anāpattikāraṇābhāvo, aparimaṇḍalanivāsananti ",
      " imānettha tīṇi aṅgāni. Yathā cettha, evaṃ sabbattha purimāni dve tattha tattha vuttappaṭipakkhakaraṇañcāti tīṇiyeva honti, tasmā ito paraṃ tānipi avatvā anāpattimattameva vakkhāmāti."
    ],
    "innerText": "Tattha asañciccāti ‘‘aparimaṇḍalaṃ nivāsessāmī’’ti evaṃ asañcicca, atha kho ‘‘parimaṇḍalaṃyeva nivāsessāmī’’ti virajjhitvā aparimaṇḍalaṃ nivāsentassa anāpatti. Assatiyāti aññāvihitassāpi tathā nivāsentassa anāpatti. Ajānantassāti parimaṇḍalaṃ nivāsetuṃ ajānantassa anāpatti, apica nivāsanavattaṃ uggahetabbaṃ. Yo pana sukkhajaṅgho vā hoti mahāpiṇḍikamaṃso vā, tassa sāruppatthāya aṭṭhaṅgulādhikampi otāretvā nivāsetuṃ vaṭṭati. Gilānassāti yassa jaṅghāya vā pāde vā vaṇo hoti, tassa ukkhipitvā vā otāretvā vā nivāsetuṃ vaṭṭati. Āpadāsūti vāḷā vā corā vā anubandhanti, evarūpāsu āpadāsu anāpatti . Ummattakādayo vuttanayā eva. Anādariyaṃ, anāpattikāraṇābhāvo, aparimaṇḍalanivāsananti imānettha tīṇi aṅgāni. Yathā cettha, evaṃ sabbattha purimāni dve tattha tattha vuttappaṭipakkhakaraṇañcāti tīṇiyeva honti, tasmā ito paraṃ tānipi avatvā anāpattimattameva vakkhāmāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Dutiyaparimaṇḍalasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dutiye ‘‘na, bhikkhave, gihipārutaṃ pārupitabba’’nti (cūḷava. 280) evaṃ paṭikkhittaṃ gihipārutaṃ apārupitvā ubho kaṇṇe samaṃ katvā pārupanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "parimaṇḍalapārupanaṃ"
      },
      " nāma, tattha yaṃkiñci setapaṭapārutaṃ paribbājakapārutaṃ ekasāṭakapārutaṃ surāsoṇḍapārutaṃ antepurikapārutaṃ mahājeṭṭhapārutaṃ kuṭippavesakapārutaṃ brāhmaṇapārutaṃ pāḷikārakapārutanti evamādi parimaṇḍalalakkhaṇato aññathā pārutaṃ, sabbametaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gihipārutaṃ"
      },
      " nāma. Tasmā yathā setapaṭā aḍḍhapālakanigaṇṭhā pārupanti, yathā ca ekacce paribbājakā uraṃ vivaritvā dvīsu aṃsakūṭesu pāvuraṇaṃ ṭhapenti, yathā ca ekasāṭakā manussā nivatthasāṭakassa ekena antena piṭṭhiṃ pārupitvā ubho kaṇṇe ubhosu aṃsakūṭesu ṭhapenti, yathā ca surāsoṇḍādayo sāṭakena gīvaṃ parikkhipitvā ubho ante ure vā olambenti, piṭṭhiyaṃ vā khipanti, yathā ca antepurikāyo akkhitārakamattaṃ dassetvā oguṇṭhitaṃ pārupanti, yathā ca mahājeṭṭhā dīghasāṭakaṃ nivāsetvā tasseva ekenantena sakalasarīraṃ pārupanti, yathā ca kassakā khettakuṭiṃ pavisantā sāṭakaṃ paliveṭhetvā upakacchake pakkhipitvā tasseva ekenantena sarīraṃ pārupanti, yathā ca brāhmaṇā ubhinnaṃ upakacchakānaṃ antare sāṭakaṃ pavesetvā aṃsakūṭesu pakkhipanti, yathā ca pāḷikārako bhikkhu ekaṃsapārupanena pārutaṃ vāmabāhuṃ vivaritvā cīvaraṃ aṃsakūṭe āropeti, evaṃ apārupitvā ",
      " sabbepi ete, aññe ca evarūpe pārupanadose vajjetvā nibbikāraṃ parimaṇḍalaṃ pārupitabbaṃ. Tathā apārupitvā ārāme vā antaraghare vā anādarena yaṃkiñci vikāraṃ karontassa dukkaṭaṃ, anāpatti purimasadisāyeva, yathā cettha, evaṃ sabbattha. Yattha pana viseso bhavissati, tattha vakkhāmāti."
    ],
    "innerText": "Dutiye ‘‘na, bhikkhave, gihipārutaṃ pārupitabba’’nti (cūḷava. 280) evaṃ paṭikkhittaṃ gihipārutaṃ apārupitvā ubho kaṇṇe samaṃ katvā pārupanaṃ parimaṇḍalapārupanaṃ nāma, tattha yaṃkiñci setapaṭapārutaṃ paribbājakapārutaṃ ekasāṭakapārutaṃ surāsoṇḍapārutaṃ antepurikapārutaṃ mahājeṭṭhapārutaṃ kuṭippavesakapārutaṃ brāhmaṇapārutaṃ pāḷikārakapārutanti evamādi parimaṇḍalalakkhaṇato aññathā pārutaṃ, sabbametaṃ gihipārutaṃ nāma. Tasmā yathā setapaṭā aḍḍhapālakanigaṇṭhā pārupanti, yathā ca ekacce paribbājakā uraṃ vivaritvā dvīsu aṃsakūṭesu pāvuraṇaṃ ṭhapenti, yathā ca ekasāṭakā manussā nivatthasāṭakassa ekena antena piṭṭhiṃ pārupitvā ubho kaṇṇe ubhosu aṃsakūṭesu ṭhapenti, yathā ca surāsoṇḍādayo sāṭakena gīvaṃ parikkhipitvā ubho ante ure vā olambenti, piṭṭhiyaṃ vā khipanti, yathā ca antepurikāyo akkhitārakamattaṃ dassetvā oguṇṭhitaṃ pārupanti, yathā ca mahājeṭṭhā dīghasāṭakaṃ nivāsetvā tasseva ekenantena sakalasarīraṃ pārupanti, yathā ca kassakā khettakuṭiṃ pavisantā sāṭakaṃ paliveṭhetvā upakacchake pakkhipitvā tasseva ekenantena sarīraṃ pārupanti, yathā ca brāhmaṇā ubhinnaṃ upakacchakānaṃ antare sāṭakaṃ pavesetvā aṃsakūṭesu pakkhipanti, yathā ca pāḷikārako bhikkhu ekaṃsapārupanena pārutaṃ vāmabāhuṃ vivaritvā cīvaraṃ aṃsakūṭe āropeti, evaṃ apārupitvā sabbepi ete, aññe ca evarūpe pārupanadose vajjetvā nibbikāraṃ parimaṇḍalaṃ pārupitabbaṃ. Tathā apārupitvā ārāme vā antaraghare vā anādarena yaṃkiñci vikāraṃ karontassa dukkaṭaṃ, anāpatti purimasadisāyeva, yathā cettha, evaṃ sabbattha. Yattha pana viseso bhavissati, tattha vakkhāmāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3-4. Suppaṭicchannasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "suppaṭicchanno"
      },
      "ti suṭṭhu paṭicchanno, gaṇṭhikaṃ paṭimuñcitvā anuvātantena gīvaṃ paṭicchādetvā ubho kaṇṇe samaṃ katvā paṭisaṅgharitvā yāva maṇibandhaṃ paṭicchādetvā antaraghare gamissāmīti attho, tathā akatvā pana jāṇuṃ vā uraṃ vā vivaritvā gacchantassa dukkaṭaṃ."
    ],
    "innerText": "Tatiye suppaṭicchannoti suṭṭhu paṭicchanno, gaṇṭhikaṃ paṭimuñcitvā anuvātantena gīvaṃ paṭicchādetvā ubho kaṇṇe samaṃ katvā paṭisaṅgharitvā yāva maṇibandhaṃ paṭicchādetvā antaraghare gamissāmīti attho, tathā akatvā pana jāṇuṃ vā uraṃ vā vivaritvā gacchantassa dukkaṭaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Catutthe ",
      " galavāṭakato paṭṭhāya sīsaṃ, maṇibandhato paṭṭhāya hatthe, piṇḍikamaṃsato paṭṭhāya pāde vivaritvā sesaṃ chādetvā nisinno ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "suppaṭicchanno"
      },
      " nāma hoti, ettha pana vāsūpagatassa anāpatti."
    ],
    "innerText": "Catutthe galavāṭakato paṭṭhāya sīsaṃ, maṇibandhato paṭṭhāya hatthe, piṇḍikamaṃsato paṭṭhāya pāde vivaritvā sesaṃ chādetvā nisinno suppaṭicchanno nāma hoti, ettha pana vāsūpagatassa anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "5-6. Susaṃvutasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pañcame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "susaṃvuto"
      },
      "ti hatthaṃ vā pādaṃ vā akīḷāpento suvinītoti attho. Chaṭṭhepi eseva nayo."
    ],
    "innerText": "Pañcame susaṃvutoti hatthaṃ vā pādaṃ vā akīḷāpento suvinītoti attho. Chaṭṭhepi eseva nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "7-8. Okkhittacakkhusikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sattame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "okkhittacakkhū"
      },
      "ti heṭṭhā khittacakkhu hutvā purato yugamattaṃ bhūmibhāgaṃ pekkhamāno, ekasmiṃ pana ṭhāne ṭhatvā hatthiassādiparissayābhāvaṃ oloketuṃ vaṭṭati. Aṭṭhamepi eseva nayo."
    ],
    "innerText": "Sattame okkhittacakkhūti heṭṭhā khittacakkhu hutvā purato yugamattaṃ bhūmibhāgaṃ pekkhamāno, ekasmiṃ pana ṭhāne ṭhatvā hatthiassādiparissayābhāvaṃ oloketuṃ vaṭṭati. Aṭṭhamepi eseva nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "9-10. Ukkhittakasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Navame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ukkhittakāyā"
      },
      "ti ukkhepena, itthambhūtalakkhaṇe karaṇavacanaṃ, ekato vā ubhato vā ukkhittacīvaro hutvāti attho, anto indakhīlato paṭṭhāya evaṃ na gantabbaṃ."
    ],
    "innerText": "Navame ukkhittakāyāti ukkhepena, itthambhūtalakkhaṇe karaṇavacanaṃ, ekato vā ubhato vā ukkhittacīvaro hutvāti attho, anto indakhīlato paṭṭhāya evaṃ na gantabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dasame nisinnakāle dhamakaraṇaṃ nīharantenāpi cīvaraṃ anukkhipitvāva nīharitabbaṃ, vāsūpagatassa pana anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "11-12. Ujjagghikasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ekādasame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ujjagghikāyā"
      },
      "ti mahāhasitaṃ hasantoti attho. Idhāpi hi itthambhūtalakkhaṇeyeva karaṇavacanaṃ."
    ],
    "innerText": "Ekādasame ujjagghikāyāti mahāhasitaṃ hasantoti attho. Idhāpi hi itthambhūtalakkhaṇeyeva karaṇavacanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dvādasamepi eseva nayo. Ubhayattha hasanīyasmiṃ vatthusmiṃ mihitamattaṃ karontassa anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "13-14. Uccasaddasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Terasame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "appasaddo"
      },
      "ti na uccāsaddamahāsaddo hutvā. Cuddasamepi eseva nayo. Ayaṃ panettha appasaddatāparicchedo – sace dvādasahatthe gehe ādimhi saṅghatthero, majjhe dutiyatthero ",
      ", ante tatiyattheroti evaṃ nisinnesu yaṃ saṅghatthero dutiyattherena saddhiṃ manteti, dutiyatthero ca tassa saddaṃ suṇāti, kathañca vavatthapeti. Tatiyatthero pana saddameva suṇāti, kathaṃ na vavatthapeti, ettāvatā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "appasaddo"
      },
      " hoti. Sace pana tatiyatthero kathañca vavatthapeti, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mahāsaddo"
      },
      " nāma hoti."
    ],
    "innerText": "Terasame appasaddoti na uccāsaddamahāsaddo hutvā. Cuddasamepi eseva nayo. Ayaṃ panettha appasaddatāparicchedo – sace dvādasahatthe gehe ādimhi saṅghatthero, majjhe dutiyatthero , ante tatiyattheroti evaṃ nisinnesu yaṃ saṅghatthero dutiyattherena saddhiṃ manteti, dutiyatthero ca tassa saddaṃ suṇāti, kathañca vavatthapeti. Tatiyatthero pana saddameva suṇāti, kathaṃ na vavatthapeti, ettāvatā appasaddo hoti. Sace pana tatiyatthero kathañca vavatthapeti, mahāsaddo nāma hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "15…Pe…20. kāyappacālakādisikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ito paresu chasu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kāyappacālaka"
      },
      "nti kāyaṃ cāletvā cāletvā, esa nayo sabbattha. Tasmā kāyādīni paggahetvā niccalāni ujukāni ṭhapetvā gantabbañceva nisīditabbañca, nisīdanappaṭisaṃyuttesu tīsu vāsūpagatassa anāpatti."
    ],
    "innerText": "Ito paresu chasu kāyappacālakanti kāyaṃ cāletvā cāletvā, esa nayo sabbattha. Tasmā kāyādīni paggahetvā niccalāni ujukāni ṭhapetvā gantabbañceva nisīditabbañca, nisīdanappaṭisaṃyuttesu tīsu vāsūpagatassa anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "21-22. Khambhakatasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ekavīsadvāvīsesu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "khambhakato"
      },
      "ti kaṭiyaṃ hatthaṃ ṭhapetvā katakhambho."
    ],
    "innerText": "Ekavīsadvāvīsesu khambhakatoti kaṭiyaṃ hatthaṃ ṭhapetvā katakhambho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "23-24. Oguṇṭhitasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tevīsacatuvīsesu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "oguṇṭhito"
      },
      "ti sasīsaṃ pāruto."
    ],
    "innerText": "Tevīsacatuvīsesu oguṇṭhitoti sasīsaṃ pāruto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "25. Ukkuṭikasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pañcavīse ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ukkuṭikā"
      },
      " vuccati paṇhiyo ukkhipitvā aggapādeheva, aggapāde vā ukkhipitvā paṇhīhiyeva bhūmiyaṃ phusantassa gamanaṃ, karaṇavacanaṃ panettha vuttalakkhaṇameva."
    ],
    "innerText": "Pañcavīse ukkuṭikā vuccati paṇhiyo ukkhipitvā aggapādeheva, aggapāde vā ukkhipitvā paṇhīhiyeva bhūmiyaṃ phusantassa gamanaṃ, karaṇavacanaṃ panettha vuttalakkhaṇameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "26. Pallatthikasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Chabbīse ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na pallatthikāyā"
      },
      "ti hatthapallatthikāya vā dussapallatthikāya vā na nisīditabbaṃ. Anādarena nisīdantassa dukkaṭaṃ, vāsūpagatassa pana idhāpi purimesu ca dvāvīsacatuvīsesu anāpatti."
    ],
    "innerText": "Chabbīse na pallatthikāyāti hatthapallatthikāya vā dussapallatthikāya vā na nisīditabbaṃ. Anādarena nisīdantassa dukkaṭaṃ, vāsūpagatassa pana idhāpi purimesu ca dvāvīsacatuvīsesu anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Chabbīsatisāruppasikkhāpadavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "27. Sakkaccapaṭiggahaṇasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bhojanappaṭisaṃyuttesu paṭhame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sakkacca"
      },
      "nti satiṃ upaṭṭhāpetvā."
    ],
    "innerText": "Bhojanappaṭisaṃyuttesu paṭhame sakkaccanti satiṃ upaṭṭhāpetvā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "28. Pattasaññīpaṭiggahaṇasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dutiye patte saññā pattasaññā, sā assa atthīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pattasaññī,"
      },
      " attano bhājane upanibaddhasaññī hutvāti attho."
    ],
    "innerText": "Dutiye patte saññā pattasaññā, sā assa atthīti pattasaññī, attano bhājane upanibaddhasaññī hutvāti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "29. Samasūpakapaṭiggahaṇasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samasūpako"
      },
      " nāma yattha muggamāsehi vā kulatthādīhi vā kato hatthahāriyo sūpo bhattassa catutthabhāgappamāṇo hoti, tato hi adhikaṃ gaṇhantassa dukkaṭaṃ. Ṭhapetvā pana sūpaṃ avasesā sabbāpi sūpeyyabyañjanavikati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rasaraso"
      },
      " nāma hoti, tasmiṃ rasarase, ñātakānaṃ vā pavāritānaṃ vā aññassatthāya vā attano dhanena vā idha anāpatti."
    ],
    "innerText": "Tatiye samasūpako nāma yattha muggamāsehi vā kulatthādīhi vā kato hatthahāriyo sūpo bhattassa catutthabhāgappamāṇo hoti, tato hi adhikaṃ gaṇhantassa dukkaṭaṃ. Ṭhapetvā pana sūpaṃ avasesā sabbāpi sūpeyyabyañjanavikati rasaraso nāma hoti, tasmiṃ rasarase, ñātakānaṃ vā pavāritānaṃ vā aññassatthāya vā attano dhanena vā idha anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "30…Pe…32. samatittikasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Catutthe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samatittika"
      },
      "nti samapuṇṇaṃ samabharitaṃ adhiṭṭhānupagapattassa antomukhavaṭṭilekhaṃ anatikkamitvā racitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Piṇḍapāta"
      },
      "nti yaṃkiñci yāvakālikaṃ. Anadhiṭṭhānupage pana yāvakālikaṃ yāmakālikādīni ca yatthakatthaci thūpīkatānipi vaṭṭanti, yaṃ pana dvīsu pattesu gahetvā ekaṃ pūretvā vihāraṃ harati, yaṃ vā pakkhipiyamānaṃ pūvaucchukkhaṇḍaphalāphalādi heṭṭhā orohati ",
      ", takkolavaṭaṃsakādayo vā upari ṭhapetvā diyyanti, yañca paṇṇe vā thālake vā pakkhipitvā pattamatthake ṭhapitaṃ hoti, na taṃ thūpīkataṃ nāma, tasmā taṃ sabbaṃ vaṭṭati. Idha pana gilānassāpi anāpatti natthi, tasmā tenapi samatittikoyeva ",
      " gahetabbo. Sabbattha pana paṭiggahetumeva ",
      " na vaṭṭati, paṭiggahitaṃ pana suppaṭiggahitaṃ paribhuñjituṃ vaṭṭati. Pañcamachaṭṭhāni vuttanayāneva."
    ],
    "innerText": "Catutthe samatittikanti samapuṇṇaṃ samabharitaṃ adhiṭṭhānupagapattassa antomukhavaṭṭilekhaṃ anatikkamitvā racitaṃ. Piṇḍapātanti yaṃkiñci yāvakālikaṃ. Anadhiṭṭhānupage pana yāvakālikaṃ yāmakālikādīni ca yatthakatthaci thūpīkatānipi vaṭṭanti, yaṃ pana dvīsu pattesu gahetvā ekaṃ pūretvā vihāraṃ harati, yaṃ vā pakkhipiyamānaṃ pūvaucchukkhaṇḍaphalāphalādi heṭṭhā orohati , takkolavaṭaṃsakādayo vā upari ṭhapetvā diyyanti, yañca paṇṇe vā thālake vā pakkhipitvā pattamatthake ṭhapitaṃ hoti, na taṃ thūpīkataṃ nāma, tasmā taṃ sabbaṃ vaṭṭati. Idha pana gilānassāpi anāpatti natthi, tasmā tenapi samatittikoyeva gahetabbo. Sabbattha pana paṭiggahetumeva na vaṭṭati, paṭiggahitaṃ pana suppaṭiggahitaṃ paribhuñjituṃ vaṭṭati. Pañcamachaṭṭhāni vuttanayāneva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "33-34. Sapadānasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sattame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sapadāna"
      },
      "nti tattha tattha odhiṃ akatvā anupaṭipāṭiyā. Yo pana aññesaṃ vā dento, aññabhājane vā ākiranto tato tato omasati, tassa, uttaribhaṅgañca uppaṭipāṭiyā gaṇhantassāpi idha anāpatti. Aṭṭhamaṃ vuttanayameva."
    ],
    "innerText": "Sattame sapadānanti tattha tattha odhiṃ akatvā anupaṭipāṭiyā. Yo pana aññesaṃ vā dento, aññabhājane vā ākiranto tato tato omasati, tassa, uttaribhaṅgañca uppaṭipāṭiyā gaṇhantassāpi idha anāpatti. Aṭṭhamaṃ vuttanayameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "35. Thūpakatasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Navame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "thūpakato"
      },
      "ti matthakato vemajjhatoti attho. Yo pana parittake sese ekato saṅkaḍḍhitvā omadditvā bhuñjati, tassāpi anāpatti."
    ],
    "innerText": "Navame thūpakatoti matthakato vemajjhatoti attho. Yo pana parittake sese ekato saṅkaḍḍhitvā omadditvā bhuñjati, tassāpi anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "36. Odanappaṭicchādanasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dasame yassa bhattasāmikā māghātasamayādīsu byañjanaṃ paṭicchādetvā denti, yo ca na bhiyyokamyatāya paṭicchādeti, tesaṃ anāpatti, gilānassa pana anāgatattā āpattiyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "37. Sūpodanaviññattisikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Ekādasame ñātakānaṃ vā pavāritānaṃ vā aññassatthāya attano dhanenāti idaṃ anāpattiyaṃ adhikaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "38. Ujjhānasaññīsikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dvādasame ujjhāne saññā ujjhānasaññā, sā assa atthīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ujjhānasaññī"
      },
      ". Idhāpi gilāno ",
      " na muccati, ‘‘dassāmī’’ti vā, ‘‘dāpessāmī’’ti vā olokentassa pana, na ujjhānasaññissa ca anāpatti."
    ],
    "innerText": "Dvādasame ujjhāne saññā ujjhānasaññā, sā assa atthīti ujjhānasaññī. Idhāpi gilāno na muccati, ‘‘dassāmī’’ti vā, ‘‘dāpessāmī’’ti vā olokentassa pana, na ujjhānasaññissa ca anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "39. Kabaḷasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Terasame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nātimahanta"
      },
      "nti mayūraṇḍaṃ atimahantaṃ, kukkuṭaṇḍaṃ atikhuddakaṃ, tesaṃ vemajjhappamāṇaṃ. Mūlakhādanīyādibhede pana sabbakhajjake phalāphale ca anāpatti."
    ],
    "innerText": "Terasame nātimahantanti mayūraṇḍaṃ atimahantaṃ, kukkuṭaṇḍaṃ atikhuddakaṃ, tesaṃ vemajjhappamāṇaṃ. Mūlakhādanīyādibhede pana sabbakhajjake phalāphale ca anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "40. Ālopasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Cuddasame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "parimaṇḍala"
      },
      "nti adīghaṃ. Idha pana khajjakaphalāphalehi saddhiṃ uttaribhaṅgepi anāpatti."
    ],
    "innerText": "Cuddasame parimaṇḍalanti adīghaṃ. Idha pana khajjakaphalāphalehi saddhiṃ uttaribhaṅgepi anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "41-42. Anāhaṭasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pannarasame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anāhaṭe"
      },
      "ti anāharite, mukhadvāraṃ asampatteti attho. Soḷasame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sabbahattha"
      },
      "nti sakalaṃ hatthaṃ."
    ],
    "innerText": "Pannarasame anāhaṭeti anāharite, mukhadvāraṃ asampatteti attho. Soḷasame sabbahatthanti sakalaṃ hatthaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "43. Sakabaḷasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sattarasame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sakabaḷenā"
      },
      "ti ettha yattakena vacanaṃ aparipuṇṇaṃ hoti, tattake sati kathentassa āpatti. Yo pana dhammaṃ kathento hariṭakādīni mukhe pakkhipitvā katheti, yattakena vacanaṃ aparipuṇṇaṃ na hoti, tattake mukhamhi sati vaṭṭati."
    ],
    "innerText": "Sattarasame sakabaḷenāti ettha yattakena vacanaṃ aparipuṇṇaṃ hoti, tattake sati kathentassa āpatti. Yo pana dhammaṃ kathento hariṭakādīni mukhe pakkhipitvā katheti, yattakena vacanaṃ aparipuṇṇaṃ na hoti, tattake mukhamhi sati vaṭṭati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "44. Piṇḍukkhepakasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aṭṭhārasame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "piṇḍukkhepaka"
      },
      "nti piṇḍaṃ ukkhipitvā ukkhipitvā, idhāpi khajjakaphalāphalesu anāpatti."
    ],
    "innerText": "Aṭṭhārasame piṇḍukkhepakanti piṇḍaṃ ukkhipitvā ukkhipitvā, idhāpi khajjakaphalāphalesu anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "45. Kabaḷāvacchedakasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ekūnavīsatime ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kabaḷāvacchedaka"
      },
      "nti kabaḷaṃ avacchinditvā avacchinditvā, idha khajjakaphalāphalehi saddhiṃ uttaribhaṅgepi anāpatti."
    ],
    "innerText": "Ekūnavīsatime kabaḷāvacchedakanti kabaḷaṃ avacchinditvā avacchinditvā, idha khajjakaphalāphalehi saddhiṃ uttaribhaṅgepi anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "46. Avagaṇḍakārakasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vīsatime ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avagaṇḍakāraka"
      },
      "nti makkaṭo viya gaṇḍe katvā katvā, idha phalāphalamattake anāpatti."
    ],
    "innerText": "Vīsatime avagaṇḍakārakanti makkaṭo viya gaṇḍe katvā katvā, idha phalāphalamattake anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "47. Hatthaniddhunakasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ekavīsatime ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hatthaniddhunaka"
      },
      "nti hatthaṃ niddhunitvā niddhunitvā, anāpattiyaṃ panettha ‘‘kacavaraṃ chaḍḍento hatthaṃ niddhunātī’’ti (pāci. 623) idaṃ adhikaṃ."
    ],
    "innerText": "Ekavīsatime hatthaniddhunakanti hatthaṃ niddhunitvā niddhunitvā, anāpattiyaṃ panettha ‘‘kacavaraṃ chaḍḍento hatthaṃ niddhunātī’’ti (pāci. 623) idaṃ adhikaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "48. Sitthāvakārakasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dvāvīsatime ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sitthāvakāraka"
      },
      "nti sitthāni avakiritvā avakiritvā, idhāpi ‘‘kacavaraṃ chaḍḍento sitthaṃ chaḍḍayatī’’ti (pāci. 623) idaṃ anāpattiyaṃ adhikaṃ."
    ],
    "innerText": "Dvāvīsatime sitthāvakārakanti sitthāni avakiritvā avakiritvā, idhāpi ‘‘kacavaraṃ chaḍḍento sitthaṃ chaḍḍayatī’’ti (pāci. 623) idaṃ anāpattiyaṃ adhikaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "49. Jivhānicchārakasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tevīsatime ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "jivhānicchāraka"
      },
      "nti jivhaṃ nicchāretvā nicchāretvā."
    ],
    "innerText": "Tevīsatime jivhānicchārakanti jivhaṃ nicchāretvā nicchāretvā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "50-51. Capucapukārakasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Catuvīsatime ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "capucapukāraka"
      },
      "nti capu capūti evaṃ saddaṃ katvā katvā. Pañcavīsatimepi eseva nayo."
    ],
    "innerText": "Catuvīsatime capucapukārakanti capu capūti evaṃ saddaṃ katvā katvā. Pañcavīsatimepi eseva nayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "52…Pe…54. hatthanillehakādisikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Chabbīsatime ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "hatthanillehaka"
      },
      "nti hatthaṃ nillehitvā nillehitvā. Bhuñjantena ",
      " hi aṅgulimattampi nillehituṃ na vaṭṭati. Ghanayāguphāṇitapāyāsādike pana aṅgulīhi gahetvā aṅguliyo mukhe pavesetvā bhuñjituṃ vaṭṭati, sattavīsatimaaṭṭhavīsatimesupi eseva nayo. Tasmā ekaṅguliyāpi patto na nillehitabbo, ekaoṭṭhopi ca jivhāya na nillehitabbo, oṭṭhamaṃsehi eva pana gahetvā anto pavesetuṃ vaṭṭati."
    ],
    "innerText": "Chabbīsatime hatthanillehakanti hatthaṃ nillehitvā nillehitvā. Bhuñjantena hi aṅgulimattampi nillehituṃ na vaṭṭati. Ghanayāguphāṇitapāyāsādike pana aṅgulīhi gahetvā aṅguliyo mukhe pavesetvā bhuñjituṃ vaṭṭati, sattavīsatimaaṭṭhavīsatimesupi eseva nayo. Tasmā ekaṅguliyāpi patto na nillehitabbo, ekaoṭṭhopi ca jivhāya na nillehitabbo, oṭṭhamaṃsehi eva pana gahetvā anto pavesetuṃ vaṭṭati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "55. Sāmisasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ekūnatiṃsatime ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na sāmisenā"
      },
      "ti etaṃ paṭikūlavasena paṭikkhittaṃ, tasmā saṅghikampi puggalikampi gihisantakampi attano santakampi saṅkhopi sarāvakampi thālakampi na gahetabbameva, gaṇhantassa dukkaṭaṃ. Sace pana hatthassa ekadeso āmisamakkhito na hoti, tena padesena gahetuṃ vaṭṭati, idha ‘‘dhovissāmīti vā, dhovāpessāmīti vā paṭiggaṇhātī’’ti (pāci. 631) idaṃ anāpattiyaṃ adhikaṃ."
    ],
    "innerText": "Ekūnatiṃsatime na sāmisenāti etaṃ paṭikūlavasena paṭikkhittaṃ, tasmā saṅghikampi puggalikampi gihisantakampi attano santakampi saṅkhopi sarāvakampi thālakampi na gahetabbameva, gaṇhantassa dukkaṭaṃ. Sace pana hatthassa ekadeso āmisamakkhito na hoti, tena padesena gahetuṃ vaṭṭati, idha ‘‘dhovissāmīti vā, dhovāpessāmīti vā paṭiggaṇhātī’’ti (pāci. 631) idaṃ anāpattiyaṃ adhikaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "56. Sasitthakasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tiṃsatime ‘‘uddharitvā vā bhinditvā vā paṭiggahe vā nīharitvā vā chaḍḍetī’’ti idaṃ anāpattiyaṃ adhikaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uddharitvā vā"
      },
      "ti sitthāni udakato ",
      " uddharitvā, ekasmiṃ ṭhāne rāsiṃ katvā udakaṃ chaḍḍeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhinditvā vā"
      },
      "ti sitthāni bhinditvā udakagatikāni katvā chaḍḍeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭiggahe vā"
      },
      "ti paṭiggahena paṭicchantānaṃ paṭiggahe chaḍḍeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nīharitvā"
      },
      "ti bahi nīharitvā chaḍḍeti, evaṃ chaḍḍentassa anāpatti."
    ],
    "innerText": "Tiṃsatime ‘‘uddharitvā vā bhinditvā vā paṭiggahe vā nīharitvā vā chaḍḍetī’’ti idaṃ anāpattiyaṃ adhikaṃ. Tattha uddharitvā vāti sitthāni udakato uddharitvā, ekasmiṃ ṭhāne rāsiṃ katvā udakaṃ chaḍḍeti. Bhinditvā vāti sitthāni bhinditvā udakagatikāni katvā chaḍḍeti. Paṭiggahe vāti paṭiggahena paṭicchantānaṃ paṭiggahe chaḍḍeti. Nīharitvāti bahi nīharitvā chaḍḍeti, evaṃ chaḍḍentassa anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tiṃsabhojanappaṭisaṃyuttasikkhāpadavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "57. Chattapāṇisikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dhammadesanāpaṭisaṃyuttesu paṭhame yaṃkiñci chattaṃ pāṇimhi assāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "chattapāṇi"
      },
      ". So taṃ chattaṃ yatthakatthaci sarīrāvayave ṭhapetvāpi yāva hatthena na muñcati, tāvassa dhammaṃ desetuṃ na vaṭṭati. Sace panassa añño chattaṃ dhāreti, passe vā ṭhitaṃ hoti, hatthato apagatamatte chattapāṇi nāma na hoti, tassa desetuṃ vaṭṭati. Dhammaparicchedo cettha padasodhamme vuttanayeneva veditabbo."
    ],
    "innerText": "Dhammadesanāpaṭisaṃyuttesu paṭhame yaṃkiñci chattaṃ pāṇimhi assāti chattapāṇi. So taṃ chattaṃ yatthakatthaci sarīrāvayave ṭhapetvāpi yāva hatthena na muñcati, tāvassa dhammaṃ desetuṃ na vaṭṭati. Sace panassa añño chattaṃ dhāreti, passe vā ṭhitaṃ hoti, hatthato apagatamatte chattapāṇi nāma na hoti, tassa desetuṃ vaṭṭati. Dhammaparicchedo cettha padasodhamme vuttanayeneva veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "58-59. Daṇḍapāṇisikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dutiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "daṇḍo"
      },
      " nāma majjhimassa purisassa catuhatthappamāṇo, daṇḍapāṇibhāvo panassa chattapāṇimhi vuttanayeneva veditabbo. Tatiyepi eseva nayo. Asiṃ sannahitvā ṭhitopi hi satthapāṇisaṅkhyaṃ na gacchati."
    ],
    "innerText": "Dutiye daṇḍo nāma majjhimassa purisassa catuhatthappamāṇo, daṇḍapāṇibhāvo panassa chattapāṇimhi vuttanayeneva veditabbo. Tatiyepi eseva nayo. Asiṃ sannahitvā ṭhitopi hi satthapāṇisaṅkhyaṃ na gacchati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "60. Āvudhapāṇisikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Catutthe ",
      " sabbāpi dhanuvikati saddhiṃ saravikatiyā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āvudha"
      },
      "nti veditabbā, tasmā saddhiṃ vā sarena dhanuṃ gahetvā, suddhadhanuṃ vā suddhasaraṃ vā sajiyadhanuṃ vā nijjiyadhanuṃ vā gahetvā ṭhitassa vā nisinnassa vā dhammaṃ desetuṃ na vaṭṭati. Sace panassa dhanu khandhepi paṭimukkaṃ hoti, yāva na gaṇhāti, tāva vaṭṭati."
    ],
    "innerText": "Catutthe sabbāpi dhanuvikati saddhiṃ saravikatiyā āvudhanti veditabbā, tasmā saddhiṃ vā sarena dhanuṃ gahetvā, suddhadhanuṃ vā suddhasaraṃ vā sajiyadhanuṃ vā nijjiyadhanuṃ vā gahetvā ṭhitassa vā nisinnassa vā dhammaṃ desetuṃ na vaṭṭati. Sace panassa dhanu khandhepi paṭimukkaṃ hoti, yāva na gaṇhāti, tāva vaṭṭati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "61-62. Pādukasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pañcame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pādukāruḷhassā"
      },
      "ti chattadaṇḍake aṅgulantarikaṃ appavesetvā kevalaṃ akkantassa vā, pavesetvā ṭhānavasena paṭimukkassa vā. Chaṭṭhepi eseva ",
      " nayo. Idha pana yvāyaṃ paṇhikabandhaṃ omuñcitvā ṭhānavasena ‘‘omukko’’ti vuccati, tassāpi na vaṭṭati."
    ],
    "innerText": "Pañcame pādukāruḷhassāti chattadaṇḍake aṅgulantarikaṃ appavesetvā kevalaṃ akkantassa vā, pavesetvā ṭhānavasena paṭimukkassa vā. Chaṭṭhepi eseva nayo. Idha pana yvāyaṃ paṇhikabandhaṃ omuñcitvā ṭhānavasena ‘‘omukko’’ti vuccati, tassāpi na vaṭṭati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "63. Yānasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sattame ",
      " sacepi dvīhi janehi hatthasaṅghāṭena gahito, sāṭake vā ṭhapetvā vaṃsena vayhati, ayutte vā vayhādike yāne visaṅkharitvā vā ṭhapite cakkamattepi nisinno hoti, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yānagato"
      },
      "tveva saṅkhaṃ gacchati. Sace pana dvepi ekayāne nisinnā honti, vaṭṭati. Visuṃ nisinnesupi ucce yāne nisinnena nīce nisinnassa desetuṃ vaṭṭati, samappamāṇepi vaṭṭati, tathā purime nisinnena pacchime nisinnassa. Pacchime pana uccatarepi nisinnena desetuṃ na vaṭṭati."
    ],
    "innerText": "Sattame sacepi dvīhi janehi hatthasaṅghāṭena gahito, sāṭake vā ṭhapetvā vaṃsena vayhati, ayutte vā vayhādike yāne visaṅkharitvā vā ṭhapite cakkamattepi nisinno hoti, yānagatotveva saṅkhaṃ gacchati. Sace pana dvepi ekayāne nisinnā honti, vaṭṭati. Visuṃ nisinnesupi ucce yāne nisinnena nīce nisinnassa desetuṃ vaṭṭati, samappamāṇepi vaṭṭati, tathā purime nisinnena pacchime nisinnassa. Pacchime pana uccatarepi nisinnena desetuṃ na vaṭṭati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "64. Sayanasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aṭṭhame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sayanagatassā"
      },
      "ti antamaso kaṭasārakepi pakatibhūmiyampi nipannassa uccepi mañce vā pīṭhe vā bhūmippadese vā ṭhitena nisinnena vā desetuṃ na vaṭṭati. Sayanagatena pana sayanagatassa uccatare vā samappamāṇe vā nipannena desetuṃ vaṭṭati. Nipannena pana ṭhitassa vā nisinnassa vā nipannassa vā, nisinnena ca ṭhitassa vā nisinnassa vā, ṭhitena ṭhitasseva vaṭṭati."
    ],
    "innerText": "Aṭṭhame sayanagatassāti antamaso kaṭasārakepi pakatibhūmiyampi nipannassa uccepi mañce vā pīṭhe vā bhūmippadese vā ṭhitena nisinnena vā desetuṃ na vaṭṭati. Sayanagatena pana sayanagatassa uccatare vā samappamāṇe vā nipannena desetuṃ vaṭṭati. Nipannena pana ṭhitassa vā nisinnassa vā nipannassa vā, nisinnena ca ṭhitassa vā nisinnassa vā, ṭhitena ṭhitasseva vaṭṭati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "65. Pallatthikasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Navame ",
      " hatthapallatthikādīsu yāya kāyaci nisinnassa desetuṃ na vaṭṭati."
    ],
    "innerText": "Navame hatthapallatthikādīsu yāya kāyaci nisinnassa desetuṃ na vaṭṭati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "66. Veṭhitasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dasame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "veṭhitasīsassā"
      },
      "ti dussaveṭhena vā moḷiādīhi vā yathā kesanto na dissati, evaṃ veṭhitasīsassa, tenevassa anāpattiyaṃ ‘‘kesantaṃ vivarāpetvā desetī’’ti (pāci. 643) vuttaṃ."
    ],
    "innerText": "Dasame veṭhitasīsassāti dussaveṭhena vā moḷiādīhi vā yathā kesanto na dissati, evaṃ veṭhitasīsassa, tenevassa anāpattiyaṃ ‘‘kesantaṃ vivarāpetvā desetī’’ti (pāci. 643) vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "67. Oguṇṭhitasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ekādasame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "oguṇṭhitasīsassā"
      },
      "ti sasīsaṃ pārutassa, anāpattiyaṃ panettha ‘‘sīsaṃ vivarāpetvā desetī’’ti (pāci. 644) adhikaṃ."
    ],
    "innerText": "Ekādasame oguṇṭhitasīsassāti sasīsaṃ pārutassa, anāpattiyaṃ panettha ‘‘sīsaṃ vivarāpetvā desetī’’ti (pāci. 644) adhikaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "68. Chamāsikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dvādasame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "chamāyaṃ nisīditvā"
      },
      "ti bhūmiyaṃ nisīditvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āsane"
      },
      "ti antamaso vatthampi tiṇānipi santharitvā nisinnassa."
    ],
    "innerText": "Dvādasame chamāyaṃ nisīditvāti bhūmiyaṃ nisīditvā. Āsaneti antamaso vatthampi tiṇānipi santharitvā nisinnassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "69. Nīcāsanasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Terasame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ucce āsane"
      },
      "ti antamaso bhūmippadesepi unnatappadese nisinnassa."
    ],
    "innerText": "Terasame ucce āsaneti antamaso bhūmippadesepi unnatappadese nisinnassa."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "70. Ṭhitasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Cuddasame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na ṭhito nisinnassā"
      },
      "ti sace therassa upaṭṭhānaṃ gantvā ṭhitaṃ daharaṃ āsane nisinno mahāthero pañhaṃ pucchati, na kathetabbaṃ. Gāravena pana theraṃ ‘‘uṭṭhahitvā pucchā’’ti vattuṃ na sakkā, tasmā ‘‘passe ṭhitassa bhikkhuno kathessāmī’’ti kathetuṃ vaṭṭati."
    ],
    "innerText": "Cuddasame na ṭhito nisinnassāti sace therassa upaṭṭhānaṃ gantvā ṭhitaṃ daharaṃ āsane nisinno mahāthero pañhaṃ pucchati, na kathetabbaṃ. Gāravena pana theraṃ ‘‘uṭṭhahitvā pucchā’’ti vattuṃ na sakkā, tasmā ‘‘passe ṭhitassa bhikkhuno kathessāmī’’ti kathetuṃ vaṭṭati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "71. Pacchatogamanasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pannarasame ",
      " sace purato gacchanto pañhaṃ pucchati, tassa taṃ akathetvā ‘‘pacchimassa bhikkhuno kathessāmī’’ti kathetabbaṃ. Saddhiṃ uggahitadhammaṃ pana sajjhāyituṃ, samadhurena vā gacchantassa kathetuṃ vaṭṭati."
    ],
    "innerText": "Pannarasame sace purato gacchanto pañhaṃ pucchati, tassa taṃ akathetvā ‘‘pacchimassa bhikkhuno kathessāmī’’ti kathetabbaṃ. Saddhiṃ uggahitadhammaṃ pana sajjhāyituṃ, samadhurena vā gacchantassa kathetuṃ vaṭṭati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "72. Uppathenagamanasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Soḷasame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na uppathenā"
      },
      "ti ettha sace dvepi sakaṭamaggasmiṃ ekekacakkapathena vā uppathena vā samadhuraṃ gacchanti, vaṭṭati."
    ],
    "innerText": "Soḷasame na uppathenāti ettha sace dvepi sakaṭamaggasmiṃ ekekacakkapathena vā uppathena vā samadhuraṃ gacchanti, vaṭṭati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "73. Ṭhitouccārasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Sattarasame ‘‘asañciccā’’ti anāpattiyaṃ sace paṭicchannaṭṭhānaṃ gacchantassa sahasā uccāro vā passāvo vā nikkhamati, asañcicca kato nāma hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "74. Hariteuccārasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aṭṭhārasame yampi jīvamānarukkhassa mūlaṃ pathaviyaṃ dissamānaṃ gacchati, sākhā vā bhūmilaggā gacchati, sabbaṃ haritasaṅkhātameva. Khandhe nisīditvā pana appaharitaṭṭhāne ",
      " pātetuṃ vaṭṭati. Sace appaharitaṭṭhānaṃ olokentasseva sahasā nikkhamati, gilānaṭṭhāne ",
      " ṭhito hoti, ‘‘appaharite kato haritaṃ ottharatī’’ti (pāci. 652) idamettha anāpattiyaṃ adhikaṃ. Tattha sacepi appaharitaṃ alabhantena tiṇaṇḍupakaṃ vā palalaṇḍupakaṃ vā ṭhapetvā kato pacchā haritaṃ ottharati, vaṭṭatiyeva. Kheḷena cettha siṅghāṇikāpi saṅgahitā."
    ],
    "innerText": "Aṭṭhārasame yampi jīvamānarukkhassa mūlaṃ pathaviyaṃ dissamānaṃ gacchati, sākhā vā bhūmilaggā gacchati, sabbaṃ haritasaṅkhātameva. Khandhe nisīditvā pana appaharitaṭṭhāne pātetuṃ vaṭṭati. Sace appaharitaṭṭhānaṃ olokentasseva sahasā nikkhamati, gilānaṭṭhāne ṭhito hoti, ‘‘appaharite kato haritaṃ ottharatī’’ti (pāci. 652) idamettha anāpattiyaṃ adhikaṃ. Tattha sacepi appaharitaṃ alabhantena tiṇaṇḍupakaṃ vā palalaṇḍupakaṃ vā ṭhapetvā kato pacchā haritaṃ ottharati, vaṭṭatiyeva. Kheḷena cettha siṅghāṇikāpi saṅgahitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "75. Udakeuccārasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ekūnavīsatime ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na udake"
      },
      "ti etaṃ paribhogaudakameva sandhāya vuttaṃ, vaccakuṭisamuddādiudakesu pana aparibhogesu anāpatti. Deve vassante samantato udakoghe jāte ",
      " anudakaṭṭhānaṃ alabhantena udake kātuṃ vaṭṭati, idhāpi ‘‘thale kato udakaṃ ottharatī’’ti (pāci. 654) idaṃ anāpattiyaṃ adhikaṃ, sesaṃ sabbasikkhāpadesu uttānameva."
    ],
    "innerText": "Ekūnavīsatime na udaketi etaṃ paribhogaudakameva sandhāya vuttaṃ, vaccakuṭisamuddādiudakesu pana aparibhogesu anāpatti. Deve vassante samantato udakoghe jāte anudakaṭṭhānaṃ alabhantena udake kātuṃ vaṭṭati, idhāpi ‘‘thale kato udakaṃ ottharatī’’ti (pāci. 654) idaṃ anāpattiyaṃ adhikaṃ, sesaṃ sabbasikkhāpadesu uttānameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Samuṭṭhānādidīpanatthāya panettha idaṃ pakiṇṇakaṃ – ujjagghikauccāsaddappaṭisaṃyuttāni cattāri, sakabaḷena mukhena byāharaṇaṃ ekaṃ, chamānīcāsananisinnaṭhitapacchatogamanauppathagamanappaṭisaṃyuttāni pañcāti imāni dasa sikkhāpadāni samanubhāsanasamuṭṭhānāni, ekekamettha kiriyaṃ, saññāvimokkhaṃ, sacittakaṃ, lokavajjaṃ, kāyakammaṃ, vacīkammaṃ, akusalacittaṃ, dukkhavedanaṃ. Sūpodanaviññattisikkhāpadaṃ theyyasatthasamuṭṭhānaṃ, kiriyaṃ, saññāvimokkhaṃ, sacittakaṃ, lokavajjaṃ, kāyakammaṃ, vacīkammaṃ, akusalacittaṃ, dukkhavedanaṃ. Chattapāṇidaṇḍapāṇisatthapāṇiāvudhapāṇipādukāupāhanayānasayanapallatthikaveṭhitaoguṇṭhitanāmakāni ekādasa dhammadesanāsamuṭṭhānāni, kiriyākiriyāni, saññāvimokkhāni, sacittakāni, lokavajjāni, vacīkammāni, akusalacittāni, dukkhavedanāni. Sesāni tepaṇṇāsa paṭhamapārājikasamauṭṭhānādibhedānīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Ekūnavīsatidhammadesanāpaṭisaṃyuttasikkhāpadavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Kaṅkhāvitaraṇiyā pātimokkhavaṇṇanāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Sekhiyavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Adhikaraṇasamathavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Adhikaraṇasamathesu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sattā"
      },
      "ti tesaṃ gaṇanaparicchedo. Adhikaraṇāni samenti vūpasamentīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "adhikaraṇasamathā. Uddesaṃ āgacchantī"
      },
      "ti āpattādhikaraṇasaṅkhātāsu ca avasesādhikaraṇattayapaccayāsu ca āpattīsu parisuddhabhāvaṃ pucchanatthaṃ uddisitabbataṃ āgacchanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uppannuppannāna"
      },
      "nti uppannānaṃ uppannānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adhikaraṇāna"
      },
      "nti vivādādhikaraṇaṃ anuvādādhikaraṇaṃ āpattādhikaraṇaṃ kiccādhikaraṇanti imesaṃ catunnaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samathāya vūpasamāyā"
      },
      "ti samanatthañceva vūpasamanatthañca sammukhāvinayo dātabbo…pe… tiṇavatthārakoti ime satta samathā dātabbā. Tatrāyaṃ vinicchayo – adhikaraṇesu tāva ‘‘dhammo’’ti vā, ‘‘adhammo’’ti vā aṭṭhārasahi vatthūhi vivadantānaṃ bhikkhūnaṃ yo vivādo, idaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vivādādhikaraṇaṃ"
      },
      " nāma. Sīlavipattiyā vā ācāradiṭṭhiājīvavipattiyā vā anuvadantānaṃ yo anuvādo upavadanā ceva codanā ca, idaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anuvādādhikaraṇaṃ"
      },
      " nāma. Mātikāya āgatā pañca, vibhaṅge dveti sattapi ",
      " āpattikkhandhā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āpattādhikaraṇaṃ"
      },
      ", nāma. Yaṃ saṅghassa apalokanādīnaṃ catunnaṃ kammānaṃ karaṇaṃ, idaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kiccādhikaraṇaṃ"
      },
      " nāma."
    ],
    "innerText": "Adhikaraṇasamathesu sattāti tesaṃ gaṇanaparicchedo. Adhikaraṇāni samenti vūpasamentīti adhikaraṇasamathā. Uddesaṃ āgacchantīti āpattādhikaraṇasaṅkhātāsu ca avasesādhikaraṇattayapaccayāsu ca āpattīsu parisuddhabhāvaṃ pucchanatthaṃ uddisitabbataṃ āgacchanti. Uppannuppannānanti uppannānaṃ uppannānaṃ. Adhikaraṇānanti vivādādhikaraṇaṃ anuvādādhikaraṇaṃ āpattādhikaraṇaṃ kiccādhikaraṇanti imesaṃ catunnaṃ. Samathāya vūpasamāyāti samanatthañceva vūpasamanatthañca sammukhāvinayo dātabbo…pe… tiṇavatthārakoti ime satta samathā dātabbā. Tatrāyaṃ vinicchayo – adhikaraṇesu tāva ‘‘dhammo’’ti vā, ‘‘adhammo’’ti vā aṭṭhārasahi vatthūhi vivadantānaṃ bhikkhūnaṃ yo vivādo, idaṃ vivādādhikaraṇaṃ nāma. Sīlavipattiyā vā ācāradiṭṭhiājīvavipattiyā vā anuvadantānaṃ yo anuvādo upavadanā ceva codanā ca, idaṃ anuvādādhikaraṇaṃ nāma. Mātikāya āgatā pañca, vibhaṅge dveti sattapi āpattikkhandhā āpattādhikaraṇaṃ, nāma. Yaṃ saṅghassa apalokanādīnaṃ catunnaṃ kammānaṃ karaṇaṃ, idaṃ kiccādhikaraṇaṃ nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vivādādhikaraṇaṃ"
      },
      " (cūḷava. 228) dvīhi samathehi sammati sammukhāvinayena ca yebhuyyasikāya ca, sammukhāvinayeneva sammamānaṃ yasmiṃ vihāre uppannaṃ, tasmiṃyeva vā, aññattha vūpasametuṃ gacchantānaṃ antarāmagge vā, yattha gantvā saṅghassa niyyātitaṃ, tattha saṅghena vā vūpasametuṃ asakkonte tattheva ubbāhikāya sammatapuggalehi vā vinicchitaṃ sammati, evaṃ sammamāne ca pana tasmiṃ yā saṅghasammukhatā dhammasammukhatā vinayasammukhatā puggalasammukhatā ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammukhāvinayo"
      },
      " nāma. Tattha ca kārakasaṅghassa saṅghasāmaggivasena sammukhībhāvo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṅghasammukhatā,"
      },
      " sametabbassa vatthuno bhūtatā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "dhammasammukhatā,"
      },
      " yathā taṃ sametabbaṃ, tathevassa samanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vinayasammukhatā,"
      },
      " yo ca vivadati, yena ca vivadati, tesaṃ ubhinnaṃ atthapaccatthikānaṃ sammukhībhāvo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "puggalasammukhatā"
      },
      ". Ubbāhikāya vūpasamane panettha saṅghasammukhatā parihāyati, evaṃ tāva sammukhāvinayeneva sammati."
    ],
    "innerText": "Tattha vivādādhikaraṇaṃ (cūḷava. 228) dvīhi samathehi sammati sammukhāvinayena ca yebhuyyasikāya ca, sammukhāvinayeneva sammamānaṃ yasmiṃ vihāre uppannaṃ, tasmiṃyeva vā, aññattha vūpasametuṃ gacchantānaṃ antarāmagge vā, yattha gantvā saṅghassa niyyātitaṃ, tattha saṅghena vā vūpasametuṃ asakkonte tattheva ubbāhikāya sammatapuggalehi vā vinicchitaṃ sammati, evaṃ sammamāne ca pana tasmiṃ yā saṅghasammukhatā dhammasammukhatā vinayasammukhatā puggalasammukhatā ayaṃ sammukhāvinayo nāma. Tattha ca kārakasaṅghassa saṅghasāmaggivasena sammukhībhāvo saṅghasammukhatā, sametabbassa vatthuno bhūtatā dhammasammukhatā, yathā taṃ sametabbaṃ, tathevassa samanaṃ vinayasammukhatā, yo ca vivadati, yena ca vivadati, tesaṃ ubhinnaṃ atthapaccatthikānaṃ sammukhībhāvo puggalasammukhatā. Ubbāhikāya vūpasamane panettha saṅghasammukhatā parihāyati, evaṃ tāva sammukhāvinayeneva sammati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sace ",
      " panevampi na sammati, atha naṃ ubbāhikāya sammatā bhikkhū ‘‘na mayaṃ sakkoma vūpasametu’’nti saṅghasseva niyyātenti, tato saṅgho pañcaṅgasamannāgataṃ bhikkhuṃ salākaggāhāpakaṃ sammannitvā tena guḷhakavivaṭṭakasakaṇṇajappakesu tīsu salākaggāhesu aññataravasena salākaṃ gāhetvā sannipatitaparisāya dhammavādīnaṃ yebhuyyatāya yathā te dhammavādino vadanti, evaṃ vūpasantaṃ adhikaraṇaṃ sammukhāvinayena ca yebhuyyasikāya ca vūpasantaṃ hoti. Tattha sammukhāvinayo vuttanayo eva, yaṃ pana yebhuyyasikakammassa karaṇaṃ. Ayaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yebhuyyasikā"
      },
      " nāma, evaṃ vivādādhikaraṇaṃ dvīhi samathehi sammati."
    ],
    "innerText": "Sace panevampi na sammati, atha naṃ ubbāhikāya sammatā bhikkhū ‘‘na mayaṃ sakkoma vūpasametu’’nti saṅghasseva niyyātenti, tato saṅgho pañcaṅgasamannāgataṃ bhikkhuṃ salākaggāhāpakaṃ sammannitvā tena guḷhakavivaṭṭakasakaṇṇajappakesu tīsu salākaggāhesu aññataravasena salākaṃ gāhetvā sannipatitaparisāya dhammavādīnaṃ yebhuyyatāya yathā te dhammavādino vadanti, evaṃ vūpasantaṃ adhikaraṇaṃ sammukhāvinayena ca yebhuyyasikāya ca vūpasantaṃ hoti. Tattha sammukhāvinayo vuttanayo eva, yaṃ pana yebhuyyasikakammassa karaṇaṃ. Ayaṃ yebhuyyasikā nāma, evaṃ vivādādhikaraṇaṃ dvīhi samathehi sammati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anuvādādhikaraṇaṃ"
      },
      " (cūḷava. 236) catūhi samathehi sammati sammukhāvinayena ca sativinayena ca amūḷhavinayena ca tassapāpiyasikāya ca. Sammukhāvinayeneva sammamānaṃ yo ca anuvadati, yañca anuvadati, tesaṃ vacanaṃ sutvā sace kāci āpatti natthi, ubho khamāpetvā, sace atthi, ‘‘ayaṃ nāmettha āpattī’’ti evaṃ vinicchitaṃ vūpasammati, tattha sammukhāvinayalakkhaṇaṃ vuttanayameva. Yadā pana khīṇāsavassa bhikkhuno amūlikāya sīlavipattiyā anuddhaṃsitassa sativinayaṃ yācamānassa saṅgho ñatticatutthena kammena sativinayaṃ deti, tadā sammukhāvinayena ca sativinayena ca vūpasantaṃ hoti, dinne pana sativinaye puna tasmiṃ puggale kassaci anuvādo na ruhati. Yadā ummattako bhikkhu ummādavasena gate assāmaṇake ",
      " ajjhācāre ‘‘saratāyasmā evarūpiṃ āpatti’’nti bhikkhūhi codiyamāno ‘‘ummattakena me, āvuso, etaṃ kataṃ, nāhaṃ taṃ sarāmī’’ti bhaṇantopi bhikkhūhi codiyamānova puna acodanatthāya amūḷhavinayaṃ ",
      " yācati, saṅgho cassa ñatticatutthena kammena amūḷhavinayaṃ deti. Tadā sammukhāvinayena ca amūḷhavinayena ca vūpasantaṃ hoti, dinne pana amūḷhavinaye puna tasmiṃ puggale kassaci tappaccayā anuvādo na ruhati."
    ],
    "innerText": "Anuvādādhikaraṇaṃ (cūḷava. 236) catūhi samathehi sammati sammukhāvinayena ca sativinayena ca amūḷhavinayena ca tassapāpiyasikāya ca. Sammukhāvinayeneva sammamānaṃ yo ca anuvadati, yañca anuvadati, tesaṃ vacanaṃ sutvā sace kāci āpatti natthi, ubho khamāpetvā, sace atthi, ‘‘ayaṃ nāmettha āpattī’’ti evaṃ vinicchitaṃ vūpasammati, tattha sammukhāvinayalakkhaṇaṃ vuttanayameva. Yadā pana khīṇāsavassa bhikkhuno amūlikāya sīlavipattiyā anuddhaṃsitassa sativinayaṃ yācamānassa saṅgho ñatticatutthena kammena sativinayaṃ deti, tadā sammukhāvinayena ca sativinayena ca vūpasantaṃ hoti, dinne pana sativinaye puna tasmiṃ puggale kassaci anuvādo na ruhati. Yadā ummattako bhikkhu ummādavasena gate assāmaṇake ajjhācāre ‘‘saratāyasmā evarūpiṃ āpatti’’nti bhikkhūhi codiyamāno ‘‘ummattakena me, āvuso, etaṃ kataṃ, nāhaṃ taṃ sarāmī’’ti bhaṇantopi bhikkhūhi codiyamānova puna acodanatthāya amūḷhavinayaṃ yācati, saṅgho cassa ñatticatutthena kammena amūḷhavinayaṃ deti. Tadā sammukhāvinayena ca amūḷhavinayena ca vūpasantaṃ hoti, dinne pana amūḷhavinaye puna tasmiṃ puggale kassaci tappaccayā anuvādo na ruhati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yadā pana pārājikena vā pārājikasāmantena vā codiyamānassa aññenaññaṃ paṭicarato pāpussannatāya pāpiyassa puggalassa ‘‘sacāyaṃ acchinnamūlo bhavissati, sammā vattitvā osāraṇaṃ labhissati, sace chinnamūlo, sayamevassa nāsanā bhavissatī’’ti maññamāno saṅgho ñatticatutthena ",
      " kammena tassapāpiyasikaṃ kammaṃ karoti, tadā sammukhāvinayena ca tassapāpiyasikāya ca vūpasantaṃ hoti, evaṃ anuvādādhikaraṇaṃ catūhi samathehi sammati."
    ],
    "innerText": "Yadā pana pārājikena vā pārājikasāmantena vā codiyamānassa aññenaññaṃ paṭicarato pāpussannatāya pāpiyassa puggalassa ‘‘sacāyaṃ acchinnamūlo bhavissati, sammā vattitvā osāraṇaṃ labhissati, sace chinnamūlo, sayamevassa nāsanā bhavissatī’’ti maññamāno saṅgho ñatticatutthena kammena tassapāpiyasikaṃ kammaṃ karoti, tadā sammukhāvinayena ca tassapāpiyasikāya ca vūpasantaṃ hoti, evaṃ anuvādādhikaraṇaṃ catūhi samathehi sammati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āpattādhikaraṇaṃ"
      },
      " (cūḷava. 239) tīhi samathehi sammati sammukhāvinayena ca paṭiññātakaraṇena ca tiṇavatthārakena ca. Tassa sammukhāvinayeneva vūpasamo natthi, yadā pana ekassa vā bhikkhuno, nissaggiyavaṇṇanāyaṃ vuttanayena saṅghagaṇamajjhesu vā bhikkhu lahukaṃ āpattiṃ deseti, tadā āpattādhikaraṇaṃ sammukhāvinayena ca paṭiññātakaraṇena ca vūpasammati. Tattha sammukhāvinaye tāva yo ca deseti, yassa ca deseti, tesaṃ sammukhībhāvo puggalasammukhatā, sesaṃ vuttanayameva. Puggalassa ca gaṇassa ca desanākāle saṅghasammukhatā parihāyati."
    ],
    "innerText": "Āpattādhikaraṇaṃ (cūḷava. 239) tīhi samathehi sammati sammukhāvinayena ca paṭiññātakaraṇena ca tiṇavatthārakena ca. Tassa sammukhāvinayeneva vūpasamo natthi, yadā pana ekassa vā bhikkhuno, nissaggiyavaṇṇanāyaṃ vuttanayena saṅghagaṇamajjhesu vā bhikkhu lahukaṃ āpattiṃ deseti, tadā āpattādhikaraṇaṃ sammukhāvinayena ca paṭiññātakaraṇena ca vūpasammati. Tattha sammukhāvinaye tāva yo ca deseti, yassa ca deseti, tesaṃ sammukhībhāvo puggalasammukhatā, sesaṃ vuttanayameva. Puggalassa ca gaṇassa ca desanākāle saṅghasammukhatā parihāyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yā panettha ‘‘ahaṃ, bhante, itthannāmaṃ āpattiṃ āpanno’’ti ca, ‘‘passasī’’ti, ‘‘āma passāmī’’ti ca paṭiññā, tāya ‘‘āyatiṃ saṃvareyyāsī’’ti karaṇaṃ paṭiññātakaraṇaṃ nāma. Saṅghādisese parivāsādiyācanā paṭiññā, parivāsādīnaṃ dānaṃ paṭiññātakaraṇaṃ nāma. Dvepakkhajātā pana bhaṇḍanakārakā bhikkhū bahuṃ assāmaṇakaṃ ajjhācāraṃ caritvā puna lajjidhamme uppanne ‘‘sace mayaṃ imāhi āpattīhi aññamaññaṃ karissāma, siyāpi taṃ adhikaraṇaṃ kakkhaḷatthāya vāḷatthāya saṃvatteyyā’’ti aññamaññaṃ āpattiyā kārāpane dosaṃ disvā yadā tiṇavatthārakakammaṃ karonti, tadā āpattādhikaraṇaṃ sammukhāvinayena ca tiṇavatthārakena ca sammati. Tatra hi yattakā hatthapāsūpagatā ‘‘na metaṃ khamatī’’ti evaṃ diṭṭhāvikammaṃ ",
      " akatvā niddampi okkamantā honti, sabbesaṃ ṭhapetvā thullavajjañca gihippaṭisaṃyuttañca sabbāpattiyo vuṭṭhahanti, evaṃ āpattādhikaraṇaṃ tīhi samathehi sammati."
    ],
    "innerText": "Yā panettha ‘‘ahaṃ, bhante, itthannāmaṃ āpattiṃ āpanno’’ti ca, ‘‘passasī’’ti, ‘‘āma passāmī’’ti ca paṭiññā, tāya ‘‘āyatiṃ saṃvareyyāsī’’ti karaṇaṃ paṭiññātakaraṇaṃ nāma. Saṅghādisese parivāsādiyācanā paṭiññā, parivāsādīnaṃ dānaṃ paṭiññātakaraṇaṃ nāma. Dvepakkhajātā pana bhaṇḍanakārakā bhikkhū bahuṃ assāmaṇakaṃ ajjhācāraṃ caritvā puna lajjidhamme uppanne ‘‘sace mayaṃ imāhi āpattīhi aññamaññaṃ karissāma, siyāpi taṃ adhikaraṇaṃ kakkhaḷatthāya vāḷatthāya saṃvatteyyā’’ti aññamaññaṃ āpattiyā kārāpane dosaṃ disvā yadā tiṇavatthārakakammaṃ karonti, tadā āpattādhikaraṇaṃ sammukhāvinayena ca tiṇavatthārakena ca sammati. Tatra hi yattakā hatthapāsūpagatā ‘‘na metaṃ khamatī’’ti evaṃ diṭṭhāvikammaṃ akatvā niddampi okkamantā honti, sabbesaṃ ṭhapetvā thullavajjañca gihippaṭisaṃyuttañca sabbāpattiyo vuṭṭhahanti, evaṃ āpattādhikaraṇaṃ tīhi samathehi sammati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kiccādhikaraṇaṃ"
      },
      " (cūḷava. 242) ekena samathena sammati sammukhāvinayeneva. Iti imāni cattāri adhikaraṇāni yathānurūpaṃ imehi sattahi samathehi sammanti, tena vuttaṃ ‘‘uppannuppannānaṃ adhikaraṇānaṃ samathāya vūpasamāya sammukhāvinayo ",
      " dātabbo…pe… tiṇavatthārako’’ti. Ayamettha vinicchayanayo, vitthāro pana samathakkhandhake āgatoyeva, vinicchayopissa samantapāsādikāyaṃ vutto."
    ],
    "innerText": "Kiccādhikaraṇaṃ (cūḷava. 242) ekena samathena sammati sammukhāvinayeneva. Iti imāni cattāri adhikaraṇāni yathānurūpaṃ imehi sattahi samathehi sammanti, tena vuttaṃ ‘‘uppannuppannānaṃ adhikaraṇānaṃ samathāya vūpasamāya sammukhāvinayo dātabbo…pe… tiṇavatthārako’’ti. Ayamettha vinicchayanayo, vitthāro pana samathakkhandhake āgatoyeva, vinicchayopissa samantapāsādikāyaṃ vutto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatthāyasmante pucchāmi, kaccittha parisuddhā"
      },
      "ti ",
      " tesu sattasu adhikaraṇasamathesu kaccittha parisuddhā, natthi vo kiñci samathehi vūpasametabbanti pucchāmi, etena sabbāpattīhi parisuddhabhāvo pucchito hoti."
    ],
    "innerText": "Tatthāyasmante pucchāmi, kaccittha parisuddhāti tesu sattasu adhikaraṇasamathesu kaccittha parisuddhā, natthi vo kiñci samathehi vūpasametabbanti pucchāmi, etena sabbāpattīhi parisuddhabhāvo pucchito hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uddiṭṭhaṃ kho āyasmanto nidāna"
      },
      "ntiādi nigamanavacanaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ettaka"
      },
      "nti ettakaṃ sikkhāpadaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suttāgata"
      },
      "nti sutte pātimokkhe āgataṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suttapariyāpanna"
      },
      "nti tattheva antogadhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anvaddhamāsaṃ uddesaṃ āgacchatī"
      },
      "ti addhamāse addhamāse uposathavasena uddisitabbataṃ āgacchati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samaggehī"
      },
      "ti kāyasāmaggivasena samaggehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammodamānehī"
      },
      "ti cittasāmaggivasena ekajjhāsayatāya suṭṭhu modamānehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avivadamānehī"
      },
      "ti aṭṭhārasasu vivādavatthūsu aññataravasenāpi avivadamānehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sikkhitabba"
      },
      "nti taṃ taṃ sikkhāpadaṃ avītikkamantehi adhisīlasikkhā sampādetabbā. Antarantarā pana yaṃ na vuttaṃ, taṃ sabbaṃ purime purime sikkhāpade vuttattā ceva uttānatthattā cāti."
    ],
    "innerText": "Uddiṭṭhaṃ kho āyasmanto nidānantiādi nigamanavacanaṃ. Tattha ettakanti ettakaṃ sikkhāpadaṃ. Suttāgatanti sutte pātimokkhe āgataṃ. Suttapariyāpannanti tattheva antogadhaṃ. Anvaddhamāsaṃ uddesaṃ āgacchatīti addhamāse addhamāse uposathavasena uddisitabbataṃ āgacchati. Samaggehīti kāyasāmaggivasena samaggehi. Sammodamānehīti cittasāmaggivasena ekajjhāsayatāya suṭṭhu modamānehi. Avivadamānehīti aṭṭhārasasu vivādavatthūsu aññataravasenāpi avivadamānehi. Sikkhitabbanti taṃ taṃ sikkhāpadaṃ avītikkamantehi adhisīlasikkhā sampādetabbā. Antarantarā pana yaṃ na vuttaṃ, taṃ sabbaṃ purime purime sikkhāpade vuttattā ceva uttānatthattā cāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Adhikaraṇasamathavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Kaṅkhāvitaraṇiyā pātimokkhavaṇṇanāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Bhikkhupātimokkhavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Namo tassa bhagavato arahato sammasambuddhassa"
  }
]