[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "29. Kathinatthāravinicchayakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "226"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kathina"
      },
      "nti ",
      " ettha (mahāva. aṭṭha. 306) pana kathinaṃ attharituṃ ke labhanti, ke na labhanti? Gaṇanavasena tāva pacchimakoṭiyā pañca janā labhanti, uddhaṃ satasahassampi, pañcannaṃ heṭṭhā na labhanti. Vuṭṭhavassavasena purimikāya vassaṃ upagantvā paṭhamapavāraṇāya pavāritā labhanti. Chinnavassā vā pacchimikāya upagatā vā na labhanti. ‘‘Aññasmiṃ vihāre vuṭṭhavassāpi na labhantī’’ti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mahāpaccariyaṃ"
      },
      " vuttaṃ. Purimikāya upagatānaṃ pana sabbe gaṇapūrakā honti, ānisaṃsaṃ na labhanti, ānisaṃso itaresaṃyeva hoti. Sace purimikāya upagatā cattāro vā honti tayo vā dve vā eko vā, itare gaṇapūrake katvā kathinaṃ attharitabbaṃ. Atha cattāro bhikkhū upagatā, eko paripuṇṇavasso sāmaṇero, so ce pacchimikāya upasampajjati, gaṇapūrako ceva hoti ānisaṃsañca labhati. Tayo bhikkhū dve sāmaṇerā, dve bhikkhū tayo sāmaṇerā, eko bhikkhu cattāro sāmaṇerāti etthāpi eseva nayo. Sace purimikāya upagatā kathinatthārakusalā na honti, atthārakusalā khandhakabhāṇakattherā pariyesitvā ānetabbā. Kammavācaṃ sāvetvā kathinaṃ attharāpetvā dānañca bhuñjitvā gamissanti, ānisaṃso pana itaresaṃyeva hoti."
    ],
    "innerText": "226.Kathinanti ettha (mahāva. aṭṭha. 306) pana kathinaṃ attharituṃ ke labhanti, ke na labhanti? Gaṇanavasena tāva pacchimakoṭiyā pañca janā labhanti, uddhaṃ satasahassampi, pañcannaṃ heṭṭhā na labhanti. Vuṭṭhavassavasena purimikāya vassaṃ upagantvā paṭhamapavāraṇāya pavāritā labhanti. Chinnavassā vā pacchimikāya upagatā vā na labhanti. ‘‘Aññasmiṃ vihāre vuṭṭhavassāpi na labhantī’’ti mahāpaccariyaṃ vuttaṃ. Purimikāya upagatānaṃ pana sabbe gaṇapūrakā honti, ānisaṃsaṃ na labhanti, ānisaṃso itaresaṃyeva hoti. Sace purimikāya upagatā cattāro vā honti tayo vā dve vā eko vā, itare gaṇapūrake katvā kathinaṃ attharitabbaṃ. Atha cattāro bhikkhū upagatā, eko paripuṇṇavasso sāmaṇero, so ce pacchimikāya upasampajjati, gaṇapūrako ceva hoti ānisaṃsañca labhati. Tayo bhikkhū dve sāmaṇerā, dve bhikkhū tayo sāmaṇerā, eko bhikkhu cattāro sāmaṇerāti etthāpi eseva nayo. Sace purimikāya upagatā kathinatthārakusalā na honti, atthārakusalā khandhakabhāṇakattherā pariyesitvā ānetabbā. Kammavācaṃ sāvetvā kathinaṃ attharāpetvā dānañca bhuñjitvā gamissanti, ānisaṃso pana itaresaṃyeva hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathinaṃ ",
      " kena dinnaṃ vaṭṭati? Yena kenaci devena vā manussena vā pañcannaṃ vā sahadhammikānaṃ aññatarena dinnaṃ vaṭṭati. Kathinadāyakassa vattaṃ atthi, sace so taṃ ajānanto pucchati – ‘‘bhante, kathaṃ kathinaṃ dātabba’’nti, tassa evaṃ ācikkhitabbaṃ ‘‘tiṇṇaṃ cīvarānaṃ aññatarappahonakaṃ sūriyuggamanasamaye vatthaṃ ‘kathinacīvaraṃ demā’ti dātuṃ vaṭṭati. Tassa parikammatthaṃ ettakā nāma sūciyo, ettakaṃ suttaṃ, ettakaṃ rajanaṃ, parikammaṃ karontānaṃ ettakānaṃ bhikkhūnaṃ yāgubhattañca dātuṃ vaṭṭatī’’ti."
    ],
    "innerText": "Kathinaṃ kena dinnaṃ vaṭṭati? Yena kenaci devena vā manussena vā pañcannaṃ vā sahadhammikānaṃ aññatarena dinnaṃ vaṭṭati. Kathinadāyakassa vattaṃ atthi, sace so taṃ ajānanto pucchati – ‘‘bhante, kathaṃ kathinaṃ dātabba’’nti, tassa evaṃ ācikkhitabbaṃ ‘‘tiṇṇaṃ cīvarānaṃ aññatarappahonakaṃ sūriyuggamanasamaye vatthaṃ ‘kathinacīvaraṃ demā’ti dātuṃ vaṭṭati. Tassa parikammatthaṃ ettakā nāma sūciyo, ettakaṃ suttaṃ, ettakaṃ rajanaṃ, parikammaṃ karontānaṃ ettakānaṃ bhikkhūnaṃ yāgubhattañca dātuṃ vaṭṭatī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathinatthārakenapi dhammena samena uppannaṃ kathinaṃ attharantena vattaṃ jānitabbaṃ. Tantavāyagehato hi ābhatasantāneneva khalimakkhitasāṭako na vaṭṭati, malīnasāṭakopi na vaṭṭati, tasmā kathinatthārasāṭakaṃ labhitvā suṭṭhu dhovitvā sūciādīni cīvarakammūpakaraṇāni sajjetvā bahūhi bhikkhūhi saddhiṃ tadaheva sibbitvā niṭṭhitasūcikammaṃ rajitvā kappabinduṃ datvā kathinaṃ attharitabbaṃ. Sace tasmiṃ anatthateyeva aññaṃ kathinasāṭakaṃ āharati, aññāni ca ",
      " bahūni kathinānisaṃsavatthāni deti, yo ānisaṃsaṃ bahuṃ deti, tassa santakena attharitabbaṃ. Itaro tathā tathā ovaditvā saññāpetabbo."
    ],
    "innerText": "Kathinatthārakenapi dhammena samena uppannaṃ kathinaṃ attharantena vattaṃ jānitabbaṃ. Tantavāyagehato hi ābhatasantāneneva khalimakkhitasāṭako na vaṭṭati, malīnasāṭakopi na vaṭṭati, tasmā kathinatthārasāṭakaṃ labhitvā suṭṭhu dhovitvā sūciādīni cīvarakammūpakaraṇāni sajjetvā bahūhi bhikkhūhi saddhiṃ tadaheva sibbitvā niṭṭhitasūcikammaṃ rajitvā kappabinduṃ datvā kathinaṃ attharitabbaṃ. Sace tasmiṃ anatthateyeva aññaṃ kathinasāṭakaṃ āharati, aññāni ca bahūni kathinānisaṃsavatthāni deti, yo ānisaṃsaṃ bahuṃ deti, tassa santakena attharitabbaṃ. Itaro tathā tathā ovaditvā saññāpetabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kathinaṃ pana kena attharitabbaṃ? Yassa saṅgho kathinacīvaraṃ deti. Saṅghena pana kassa dātabbaṃ? Yo jiṇṇacīvaro hoti. Sace bahū jiṇṇacīvarā, vuḍḍhassa dātabbaṃ. Vuḍḍhesupi yo mahāpariso tadaheva cīvaraṃ katvā attharituṃ sakkoti, tassa dātabbaṃ. Sace vuḍḍho na sakkoti, navakataro sakkoti, tassa dātabbaṃ. Apica saṅghena mahātherassa saṅgahaṃ kātuṃ vaṭṭati, tasmā ‘‘tumhe, bhante, gaṇhatha, mayaṃ katvā dassāmā’’ti vattabbaṃ. Tīsu cīvaresu yaṃ jiṇṇaṃ hoti, tadatthāya dātabbaṃ. Pakatiyā dupaṭṭacīvarassa dupaṭṭatthāyeva dātabbaṃ. Sacepissa ekapaṭṭacīvaraṃ ghanaṃ hoti, kathinasāṭakā ca pelavā, sāruppatthāya dupaṭṭappahonakameva dātabbaṃ, ‘‘ahaṃ alabhanto ekapaṭṭaṃ pārupāmī’’ti vadantassapi dupaṭṭaṃ dātuṃ vaṭṭati. Yo pana lobhapakatiko hoti, tassa na dātabbaṃ. Tenapi ‘‘kathinaṃ attharitvā pacchā visibbitvā dve cīvarāni karissāmī’’ti na gahetabbaṃ. Yassa pana dīyati, tassa –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Suṇātu me, bhante, saṅgho, idaṃ saṅghassa kathinadussaṃ uppannaṃ, yadi saṅghassa pattakallaṃ, saṅgho imaṃ kathinadussaṃ itthannāmassa bhikkhuno dadeyya kathinaṃ attharituṃ, esā ñatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Suṇātu ",
      " me, bhante, saṅgho, idaṃ saṅghassa kathinadussaṃ uppannaṃ, saṅgho imaṃ kathinadussaṃ itthannāmassa bhikkhuno deti kathinaṃ attharituṃ, yassāyasmato khamati imassa kathinadussassa itthannāmassa bhikkhuno dānaṃ kathinaṃ attharituṃ, so tuṇhassa. Yassa nakkhamati, so bhāseyya."
    ],
    "innerText": "‘‘Suṇātu me, bhante, saṅgho, idaṃ saṅghassa kathinadussaṃ uppannaṃ, saṅgho imaṃ kathinadussaṃ itthannāmassa bhikkhuno deti kathinaṃ attharituṃ, yassāyasmato khamati imassa kathinadussassa itthannāmassa bhikkhuno dānaṃ kathinaṃ attharituṃ, so tuṇhassa. Yassa nakkhamati, so bhāseyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Dinnaṃ idaṃ saṅghena kathinadussaṃ itthannāmassa bhikkhuno kathinaṃ attharituṃ, khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti (mahāva. 307) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Evaṃ dutiyakammavācāya dātabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ dinne pana kathine sace taṃ kathinadussaṃ niṭṭhitaparikammameva hoti, iccetaṃ kusalaṃ. No ce niṭṭhitaparikammaṃ hoti, ‘‘ahaṃ thero’’ti vā ‘‘bahussuto’’ti vā ekenapi akātuṃ na labbhati ",
      ", sabbeheva sannipatitvā dhovanasibbanarajanāni niṭṭhāpetabbāni. Idañhi kathinavattaṃ nāma buddhappasatthaṃ. Atīte padumuttaropi bhagavā kathinavattaṃ akāsi. Tassa kira aggasāvako sujātatthero nāma kathinaṃ gaṇhi. Taṃ satthā aṭṭhasaṭṭhiyā bhikkhusatasahassehi saddhiṃ nisīditvā akāsi."
    ],
    "innerText": "Evaṃ dinne pana kathine sace taṃ kathinadussaṃ niṭṭhitaparikammameva hoti, iccetaṃ kusalaṃ. No ce niṭṭhitaparikammaṃ hoti, ‘‘ahaṃ thero’’ti vā ‘‘bahussuto’’ti vā ekenapi akātuṃ na labbhati , sabbeheva sannipatitvā dhovanasibbanarajanāni niṭṭhāpetabbāni. Idañhi kathinavattaṃ nāma buddhappasatthaṃ. Atīte padumuttaropi bhagavā kathinavattaṃ akāsi. Tassa kira aggasāvako sujātatthero nāma kathinaṃ gaṇhi. Taṃ satthā aṭṭhasaṭṭhiyā bhikkhusatasahassehi saddhiṃ nisīditvā akāsi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Katapariyositaṃ pana kathinaṃ gahetvā atthārakena bhikkhunā sace saṅghāṭiyā kathinaṃ attharitukāmo hoti, porāṇikā saṅghāṭi paccuddharitabbā, navā saṅghāṭi adhiṭṭhātabbā, ‘‘imāya saṅghāṭiyā kathinaṃ attharāmī’’ti vācā bhinditabbā. Sace uttarāsaṅgena kathinaṃ attharitukāmo hoti, porāṇako uttarāsaṅgo paccuddharitabbo, navo uttarāsaṅgo adhiṭṭhātabbo, ‘‘iminā uttarāsaṅgena kathinaṃ attharāmī’’ti vācā bhinditabbā. Sace antaravāsakena kathinaṃ attharitukāmo hoti, porāṇako antaravāsako paccuddharitabbo, navo antaravāsako adhiṭṭhātabbo, ‘‘iminā antaravāsakena kathinaṃ attharāmī’’ti vācā bhinditabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tena (pari. 413) kathinatthārakena bhikkhunā saṅghaṃ upasaṅkamitvā ekaṃsaṃ uttarāsaṅgaṃ karitvā añjaliṃ paggahetvā evamassa vacanīyo ‘‘atthataṃ, bhante, saṅghassa kathinaṃ, dhammiko kathinatthāro, anumodathā’’ti. Tehi anumodakehi ",
      " bhikkhūhi ekaṃsaṃ uttarāsaṅgaṃ karitvā añjaliṃ paggahetvā evamassa vacanīyo ‘‘atthataṃ, āvuso, saṅghassa kathinaṃ, dhammiko kathinatthāro, anumodāmā’’ti. Tena kathinatthārakena bhikkhunā sambahule bhikkhū upasaṅkamitvā ekaṃsaṃ uttarāsaṅgaṃ karitvā añjaliṃ paggahetvā evamassa vacanīyo ‘‘atthataṃ, bhante, saṅghassa kathinaṃ, dhammiko kathinatthāro, anumodathā’’ti. Tehi anumodakehi bhikkhūhi ekaṃsaṃ uttarāsaṅgaṃ karitvā añjaliṃ paggahetvā evamassa vacanīyo ‘‘atthataṃ, āvuso, saṅghassa kathinaṃ, dhammiko kathinatthāro, anumodāmā’’ti. Tena kathinatthārakena bhikkhunā ekaṃ bhikkhuṃ upasaṅkamitvā ekaṃsaṃ uttarāsaṅgaṃ karitvā añjaliṃ paggahetvā evamassa vacanīyo ‘‘atthataṃ, āvuso, saṅghassa kathinaṃ, dhammiko kathinatthāro, anumodāhī’’ti. Tena anumodakena bhikkhunā ekaṃsaṃ uttarāsaṅgaṃ karitvā añjaliṃ paggahetvā evamassa vacanīyo ‘‘atthataṃ, āvuso, saṅghassa kathinaṃ, dhammiko kathinatthāro, anumodāmī’’ti. Evaṃ sabbesaṃ atthataṃ hoti kathinaṃ. Vuttañhetaṃ parivāre ‘‘dvinnaṃ puggalānaṃ atthataṃ hoti kathinaṃ atthārakassa ca anumodakassa cā’’ti (pari. 403). Punapi vuttaṃ ‘‘na saṅgho kathinaṃ attharati, na gaṇo kathinaṃ attharati, puggalo kathinaṃ attharati, saṅghassa anumodanāya gaṇassa anumodanāya puggalassa attharāya saṅghassa ",
      " atthataṃ hoti kathinaṃ, gaṇassa atthataṃ hoti kathinaṃ, puggalassa atthataṃ hoti kathina’’nti (pari. 414)."
    ],
    "innerText": "Tena (pari. 413) kathinatthārakena bhikkhunā saṅghaṃ upasaṅkamitvā ekaṃsaṃ uttarāsaṅgaṃ karitvā añjaliṃ paggahetvā evamassa vacanīyo ‘‘atthataṃ, bhante, saṅghassa kathinaṃ, dhammiko kathinatthāro, anumodathā’’ti. Tehi anumodakehi bhikkhūhi ekaṃsaṃ uttarāsaṅgaṃ karitvā añjaliṃ paggahetvā evamassa vacanīyo ‘‘atthataṃ, āvuso, saṅghassa kathinaṃ, dhammiko kathinatthāro, anumodāmā’’ti. Tena kathinatthārakena bhikkhunā sambahule bhikkhū upasaṅkamitvā ekaṃsaṃ uttarāsaṅgaṃ karitvā añjaliṃ paggahetvā evamassa vacanīyo ‘‘atthataṃ, bhante, saṅghassa kathinaṃ, dhammiko kathinatthāro, anumodathā’’ti. Tehi anumodakehi bhikkhūhi ekaṃsaṃ uttarāsaṅgaṃ karitvā añjaliṃ paggahetvā evamassa vacanīyo ‘‘atthataṃ, āvuso, saṅghassa kathinaṃ, dhammiko kathinatthāro, anumodāmā’’ti. Tena kathinatthārakena bhikkhunā ekaṃ bhikkhuṃ upasaṅkamitvā ekaṃsaṃ uttarāsaṅgaṃ karitvā añjaliṃ paggahetvā evamassa vacanīyo ‘‘atthataṃ, āvuso, saṅghassa kathinaṃ, dhammiko kathinatthāro, anumodāhī’’ti. Tena anumodakena bhikkhunā ekaṃsaṃ uttarāsaṅgaṃ karitvā añjaliṃ paggahetvā evamassa vacanīyo ‘‘atthataṃ, āvuso, saṅghassa kathinaṃ, dhammiko kathinatthāro, anumodāmī’’ti. Evaṃ sabbesaṃ atthataṃ hoti kathinaṃ. Vuttañhetaṃ parivāre ‘‘dvinnaṃ puggalānaṃ atthataṃ hoti kathinaṃ atthārakassa ca anumodakassa cā’’ti (pari. 403). Punapi vuttaṃ ‘‘na saṅgho kathinaṃ attharati, na gaṇo kathinaṃ attharati, puggalo kathinaṃ attharati, saṅghassa anumodanāya gaṇassa anumodanāya puggalassa attharāya saṅghassa atthataṃ hoti kathinaṃ, gaṇassa atthataṃ hoti kathinaṃ, puggalassa atthataṃ hoti kathina’’nti (pari. 414)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ atthate pana kathine sace kathinacīvarena saddhiṃ ābhataṃ ānisaṃsaṃ dāyakā ‘‘yena amhākaṃ kathinaṃ gahitaṃ, tasseva demā’’ti denti, bhikkhusaṅgho anissaro. Atha avicāretvāva datvā gacchanti, bhikkhusaṅgho issaro. Tasmā sace kathinatthārakassa sesacīvarānipi dubbalāni honti, saṅghena apaloketvā tesampi atthāya vatthāni dātabbāni, kammavācā pana ekāyeva vaṭṭati. Avasesakathinānisaṃse balavavatthāni vassāvāsikaṭhitikāya dātabbāni, ṭhitikāya abhāve therāsanato paṭṭhāya dātabbāni, garubhaṇḍaṃ na bhājetabbaṃ. Sace pana ekasīmāya bahū vihārā honti, sabbehi bhikkhūhi sannipātāpetvā ekattha kathinaṃ attharitabbaṃ, visuṃ visuṃ attharituṃ na vaṭṭati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Atthatakathinānaṃ ",
      " vo, bhikkhave, pañca kappissanti, anāmantacāro asamādānacāro gaṇabhojanaṃ yāvadatthacīvaraṃ yo ca tattha cīvaruppādo. So nesaṃ bhavissatī’’ti (mahāva. 306) vacanato atthatakathinānaṃ bhikkhūnaṃ anāmantacārādayo pana pañcānisaṃsā labbhanti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anāmantacāro"
      },
      "ti anāmantetvā caraṇaṃ, yāva kathinaṃ na uddharīyati, tāva cārittasikkhāpadena anāpattīti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Asamādānacāro"
      },
      "ti cīvaraṃ asamādāya caraṇaṃ, cīvaravippavāsoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gaṇabhojana"
      },
      "nti gaṇabhojanasikkhāpadena anāpatti vuttā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yāvadatthacīvara"
      },
      "nti yāvatā cīvarena attho, tāvatakaṃ anadhiṭṭhitaṃ avikappitaṃ vaṭṭatīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yo ca tattha cīvaruppādo"
      },
      "ti tattha kathinatthatasīmāya matakacīvaraṃ vā hotu saṅghaṃ uddissa dinnaṃ vā saṅghikena tatruppādena ābhataṃ vā, yena kenaci ākārena yaṃ saṅghikaṃ cīvaraṃ uppajjati, taṃ tesaṃ bhavissatīti attho."
    ],
    "innerText": "‘‘Atthatakathinānaṃ vo, bhikkhave, pañca kappissanti, anāmantacāro asamādānacāro gaṇabhojanaṃ yāvadatthacīvaraṃ yo ca tattha cīvaruppādo. So nesaṃ bhavissatī’’ti (mahāva. 306) vacanato atthatakathinānaṃ bhikkhūnaṃ anāmantacārādayo pana pañcānisaṃsā labbhanti. Tattha anāmantacāroti anāmantetvā caraṇaṃ, yāva kathinaṃ na uddharīyati, tāva cārittasikkhāpadena anāpattīti vuttaṃ hoti. Asamādānacāroti cīvaraṃ asamādāya caraṇaṃ, cīvaravippavāsoti attho. Gaṇabhojananti gaṇabhojanasikkhāpadena anāpatti vuttā. Yāvadatthacīvaranti yāvatā cīvarena attho, tāvatakaṃ anadhiṭṭhitaṃ avikappitaṃ vaṭṭatīti attho. Yo ca tattha cīvaruppādoti tattha kathinatthatasīmāya matakacīvaraṃ vā hotu saṅghaṃ uddissa dinnaṃ vā saṅghikena tatruppādena ābhataṃ vā, yena kenaci ākārena yaṃ saṅghikaṃ cīvaraṃ uppajjati, taṃ tesaṃ bhavissatīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti pāḷimuttakavinayavinicchayasaṅgahe"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Kathinatthāravinicchayakathā samattā."
  }
]