[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "Pāṭidesanīyakaṇḍo"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Paṭhamapāṭidesanīyasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Pāṭidesanīyesu ",
      " paṭhame ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "antaragharaṃ paviṭṭhāyā"
      },
      "ti vacanato sace tassā antarārāmādīsu ṭhatvāpi dadamānāya hatthato sayaṃ rathiyābyūhasiṅghāṭakagharānaṃ aññatarasmiṃ ṭhitopi gaṇhāti, doso natthi. Tassā pana rathiyādīsu ṭhatvā dadamānāya, rathiyādīsu vā, antarārāmādīsu vā ṭhatvāpi yaṃkiñci āmisaṃ ajjhoharaṇatthāya gaṇhato paṭiggahaṇe dukkaṭaṃ, ajjhohāre ajjhohāre pāṭidesanīyaṃ. Tassa desetabbākāro ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gārayhaṃ āvuso"
      },
      "tiādinā nayena sikkhāpade dassitoyeva."
    ],
    "innerText": "Pāṭidesanīyesu paṭhame antaragharaṃ paviṭṭhāyāti vacanato sace tassā antarārāmādīsu ṭhatvāpi dadamānāya hatthato sayaṃ rathiyābyūhasiṅghāṭakagharānaṃ aññatarasmiṃ ṭhitopi gaṇhāti, doso natthi. Tassā pana rathiyādīsu ṭhatvā dadamānāya, rathiyādīsu vā, antarārāmādīsu vā ṭhatvāpi yaṃkiñci āmisaṃ ajjhoharaṇatthāya gaṇhato paṭiggahaṇe dukkaṭaṃ, ajjhohāre ajjhohāre pāṭidesanīyaṃ. Tassa desetabbākāro gārayhaṃ āvusotiādinā nayena sikkhāpade dassitoyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sāvatthiyaṃ aññataraṃ bhikkhuṃ ārabbha aññātikāya bhikkhuniyā antaragharaṃ paviṭṭhāya hatthato āmisaṃ paṭiggahaṇavatthusmiṃ paññattaṃ, asādhāraṇapaññatti, anāṇattikaṃ, yathā cetaṃ, tathā sesānipi, tikapāṭidesanīyaṃ, yāmakālikādīsu paṭiggahaṇepi ajjhoharaṇepi dukkaṭaṃ, ekatoupasampannāya yāvakālikepi tatheva, ñātikāya aññātikasaññivematikānampi eseva nayo. Ñātikasaññino pana, ñātikāya vā dāpentiyā, upanikkhipitvā vā dadamānāya, yā ca antarārāmabhikkhunupassayatitthiyaseyyapaṭikkamanesu ṭhatvā gāmato bahi nīharitvā, yāmakālikādīni vā ‘‘sati paccaye paribhuñjā’’ti ",
      " deti, tassa, sikkhamānasāmaṇerīnañca hatthato gahetvā paribhuñjantassa, ummattakādīnañca anāpatti. Paripuṇṇūpasampannatā, aññātikatā, antaraghare ṭhitāya hatthato sahatthā paṭiggahaṇaṃ, yāvakālikatā, ajjhoharaṇanti imānettha pañca aṅgāni. Samuṭṭhānādīni eḷakalomasadisānīti."
    ],
    "innerText": "Sāvatthiyaṃ aññataraṃ bhikkhuṃ ārabbha aññātikāya bhikkhuniyā antaragharaṃ paviṭṭhāya hatthato āmisaṃ paṭiggahaṇavatthusmiṃ paññattaṃ, asādhāraṇapaññatti, anāṇattikaṃ, yathā cetaṃ, tathā sesānipi, tikapāṭidesanīyaṃ, yāmakālikādīsu paṭiggahaṇepi ajjhoharaṇepi dukkaṭaṃ, ekatoupasampannāya yāvakālikepi tatheva, ñātikāya aññātikasaññivematikānampi eseva nayo. Ñātikasaññino pana, ñātikāya vā dāpentiyā, upanikkhipitvā vā dadamānāya, yā ca antarārāmabhikkhunupassayatitthiyaseyyapaṭikkamanesu ṭhatvā gāmato bahi nīharitvā, yāmakālikādīni vā ‘‘sati paccaye paribhuñjā’’ti deti, tassa, sikkhamānasāmaṇerīnañca hatthato gahetvā paribhuñjantassa, ummattakādīnañca anāpatti. Paripuṇṇūpasampannatā, aññātikatā, antaraghare ṭhitāya hatthato sahatthā paṭiggahaṇaṃ, yāvakālikatā, ajjhoharaṇanti imānettha pañca aṅgāni. Samuṭṭhānādīni eḷakalomasadisānīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṭhamapāṭidesanīyasikkhāpadavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Dutiyapāṭidesanīyasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Dutiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "idha sūpa"
      },
      "ntiādi vosāsanākāradassanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Apasakka tāva bhaginī"
      },
      "tiādi apasādetabbākāradassanaṃ. Tatrāyaṃ vinicchayo – ekenāpi ",
      " bhikkhunā anapasādite ajjhoharaṇatthāya āmisaṃ gaṇhantānaṃ paṭiggahaṇe dukkaṭaṃ, ajjhohāre ajjhohāre pāṭidesanīyanti."
    ],
    "innerText": "Dutiye idha sūpantiādi vosāsanākāradassanaṃ. Apasakka tāva bhaginītiādi apasādetabbākāradassanaṃ. Tatrāyaṃ vinicchayo – ekenāpi bhikkhunā anapasādite ajjhoharaṇatthāya āmisaṃ gaṇhantānaṃ paṭiggahaṇe dukkaṭaṃ, ajjhohāre ajjhohāre pāṭidesanīyanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Rājagahe chabbaggiye ārabbha bhikkhuniyā vosāsantiyā nanivāraṇavatthusmiṃ paññattaṃ, tikapāṭidesanīyaṃ, ekatoupasampannāya vosāsantiyā nanivārentassa dukkaṭaṃ, tathā anupasampannāya upasampannasaññino vematikassa ca. Anupasampannasaññino, pana yo ca attano vā bhattaṃ dāpentiyā, aññesaṃ vā bhattaṃ dentiyā, yaṃ vā na dinnaṃ, taṃ dāpentiyā, yattha vā na dinnaṃ, tattha, sabbesaṃ vā samakaṃ dāpentiyā, sikkhamānāya vā sāmaṇeriyā vā vosāsantiyā paṭiggahetvā bhuñjati, tassa, pañca bhojanāni ṭhapetvā sabbattha, ummattakādīnañca anāpatti. Paripuṇṇūpasampannatā, pañcabhojanatā, antaraghare anuññātapakārato aññathā vosāsanā, anivāraṇā, ajjhoharaṇanti imānettha pañca aṅgāni. Samuṭṭhānādīni kathinasadisānīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dutiyapāṭidesanīyasikkhāpadavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "3. Tatiyapāṭidesanīyasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatiye ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sekkhasammatānī"
      },
      "ti laddhasekkhasammutikāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pubbe animantito"
      },
      "ti gharūpacārokkamanato paṭhamataraṃ upacāraṃ anokkamanteyeva pubbe animantito. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Agilāno"
      },
      " nāma yo sakkoti piṇḍāya carituṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāṭidesanīya"
      },
      "nti gharūpacāraṃ okkamitvā āmisaṃ gaṇhantassa paṭiggahaṇe tāva dukkaṭaṃ, taṃ gahetvā yatthakatthaci bhuñjantassa ajjhohāre ajjhohāre pāṭidesanīyanti."
    ],
    "innerText": "Tatiye sekkhasammatānīti laddhasekkhasammutikāni. Pubbe animantitoti gharūpacārokkamanato paṭhamataraṃ upacāraṃ anokkamanteyeva pubbe animantito. Agilāno nāma yo sakkoti piṇḍāya carituṃ. Pāṭidesanīyanti gharūpacāraṃ okkamitvā āmisaṃ gaṇhantassa paṭiggahaṇe tāva dukkaṭaṃ, taṃ gahetvā yatthakatthaci bhuñjantassa ajjhohāre ajjhohāre pāṭidesanīyanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sāvatthiyaṃ sambahule bhikkhū ārabbha na mattaṃ jānitvā paṭiggahaṇavatthusmiṃ paññattaṃ, ‘‘pubbe ",
      " animantito, agilāno’’ti imā panettha dve anupaññattiyo, tikapāṭidesanīyaṃ, yāmakālikādīsu paṭiggahaṇepi ajjhohārepi dukkaṭaṃ, tathā asekkhasammate sekkhasammatasaññino vematikassa ca. Asekkhasammatasaññino, pana yo ca pubbe nimantito vā ",
      " gilāno vā aññassa vā tesaṃ ghare paññattaṃ bhikkhaṃ gaṇhāti, yassa ca gharato nīharitvā, āsanasālādīsu vā bhikkhuṃ adisvā paṭhamaṃyeva nīharitvā, dvāramūle vā ṭhapitaṃ denti, tassa taṃ bhuñjantassa, niccabhattake, salākabhatte, pakkhike ",
      ", uposathike, pāṭipadike, yāmakālikādiṃ ‘‘sati paccaye paribhuñjā’’ti dinnaṃ paribhuñjantassa, ummattakādīnañca anāpatti. Sekkhasammatatā, pubbe animantitatā, agilānatā, gharūpacārokkamanaṃ, ṭhapetvā niccabhattakādīni aññaṃ āmisaṃ gahetvā bhuñjananti imānettha pañca aṅgāni. Samuṭṭhānādīni eḷakalomasadisānīti."
    ],
    "innerText": "Sāvatthiyaṃ sambahule bhikkhū ārabbha na mattaṃ jānitvā paṭiggahaṇavatthusmiṃ paññattaṃ, ‘‘pubbe animantito, agilāno’’ti imā panettha dve anupaññattiyo, tikapāṭidesanīyaṃ, yāmakālikādīsu paṭiggahaṇepi ajjhohārepi dukkaṭaṃ, tathā asekkhasammate sekkhasammatasaññino vematikassa ca. Asekkhasammatasaññino, pana yo ca pubbe nimantito vā gilāno vā aññassa vā tesaṃ ghare paññattaṃ bhikkhaṃ gaṇhāti, yassa ca gharato nīharitvā, āsanasālādīsu vā bhikkhuṃ adisvā paṭhamaṃyeva nīharitvā, dvāramūle vā ṭhapitaṃ denti, tassa taṃ bhuñjantassa, niccabhattake, salākabhatte, pakkhike , uposathike, pāṭipadike, yāmakālikādiṃ ‘‘sati paccaye paribhuñjā’’ti dinnaṃ paribhuñjantassa, ummattakādīnañca anāpatti. Sekkhasammatatā, pubbe animantitatā, agilānatā, gharūpacārokkamanaṃ, ṭhapetvā niccabhattakādīni aññaṃ āmisaṃ gahetvā bhuñjananti imānettha pañca aṅgāni. Samuṭṭhānādīni eḷakalomasadisānīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Tatiyapāṭidesanīyasikkhāpadavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "4. Catutthapāṭidesanīyasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Catutthe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "yāni kho pana tāni āraññakānī"
      },
      "tiādi cīvaravippavāsasikkhāpade vuttanayeneva veditabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pubbe appaṭisaṃvidita"
      },
      "nti ettha yaṃ itthiyā vā purisena vā gahaṭṭhena vā pabbajitena vā ārāmaṃ vā ārāmūpacāraṃ vā pavisitvā ‘‘itthannāmassa, bhante, kulassa khādanīyaṃ vā bhojanīyaṃ vā āhariyissatī’’ti (pāci. 573) ārocitaṃ, taṃ pacchā yathāārocitameva vā āhariyatu, tassa parivāraṃ katvā aññaṃ vā tena saddhiṃ bahukampi, ‘‘itthannāmaṃ kulaṃ paṭisaṃviditaṃ katvā khādanīyaṃ vā bhojanīyaṃ vā gahetvā gacchatī’’ti sutvā aññāni vā kulāni tehi saddhiṃ āharantu, taṃ sabbaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṭisaṃviditaṃ"
      },
      " nāma. Yaṃ pana evaṃ anārocitaṃ anāhaṭañca, taṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "appaṭisaṃviditaṃ"
      },
      " nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Agilāno"
      },
      " nāma yo sakkoti piṇḍāya gantuṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāṭidesanīya"
      },
      "nti evarūpaṃ antamaso ārāmamajjhena gacchantehi addhikehi dinnampi ārāme vā ārāmūpacāre vā paṭiggahetvā ajjhoharantassa paṭiggahaṇe dukkaṭaṃ, ajjhohāre ajjhohāre pāṭidesanīyanti."
    ],
    "innerText": "Catutthe yāni kho pana tāni āraññakānītiādi cīvaravippavāsasikkhāpade vuttanayeneva veditabbaṃ. Pubbe appaṭisaṃviditanti ettha yaṃ itthiyā vā purisena vā gahaṭṭhena vā pabbajitena vā ārāmaṃ vā ārāmūpacāraṃ vā pavisitvā ‘‘itthannāmassa, bhante, kulassa khādanīyaṃ vā bhojanīyaṃ vā āhariyissatī’’ti (pāci. 573) ārocitaṃ, taṃ pacchā yathāārocitameva vā āhariyatu, tassa parivāraṃ katvā aññaṃ vā tena saddhiṃ bahukampi, ‘‘itthannāmaṃ kulaṃ paṭisaṃviditaṃ katvā khādanīyaṃ vā bhojanīyaṃ vā gahetvā gacchatī’’ti sutvā aññāni vā kulāni tehi saddhiṃ āharantu, taṃ sabbaṃ paṭisaṃviditaṃ nāma. Yaṃ pana evaṃ anārocitaṃ anāhaṭañca, taṃ appaṭisaṃviditaṃ nāma. Agilāno nāma yo sakkoti piṇḍāya gantuṃ. Pāṭidesanīyanti evarūpaṃ antamaso ārāmamajjhena gacchantehi addhikehi dinnampi ārāme vā ārāmūpacāre vā paṭiggahetvā ajjhoharantassa paṭiggahaṇe dukkaṭaṃ, ajjhohāre ajjhohāre pāṭidesanīyanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sakkesu sambahule bhikkhū ārabbha ārāme core paṭivasante anārocanavatthusmiṃ paññattaṃ, ‘‘agilāno’’ti ayamettha ekā anupaññatti, tikapāṭidesanīyaṃ ",
      ", yāmakālikādīsu āhāratthāya paṭiggahaṇepi ajjhohārepi dukkaṭameva, tathā paṭisaṃvidite appaṭisaṃviditasaññino ",
      " vematikassa ca, paṭisaṃviditasaññino, pana gilānassa, yo ca paṭisaṃviditaṃ katvā āhaṭaṃ vā gilānāvasesakaṃ vā bahārāme vā paṭiggahitaṃ, tatthajātakameva vā mūlaphalādiṃ, yāmakālikādīsu vā yaṃkiñci ‘‘sati paccaye paribhuñjā’’ti laddhaṃ paribhuñjantassa, ummattakādīnañca anāpatti. Yathāvuttaāraññakasenāsanatā, yāvakālikassa atatthajātakatā, agilānatā, agilānāvasesakatā, appaṭisaṃviditatā, ajjhārāme paṭiggahaṇaṃ, ajjhoharaṇanti imānettha satta aṅgāni. Samuṭṭhānādīni kathinasadisāneva, idaṃ pana kiriyākiriyanti."
    ],
    "innerText": "Sakkesu sambahule bhikkhū ārabbha ārāme core paṭivasante anārocanavatthusmiṃ paññattaṃ, ‘‘agilāno’’ti ayamettha ekā anupaññatti, tikapāṭidesanīyaṃ , yāmakālikādīsu āhāratthāya paṭiggahaṇepi ajjhohārepi dukkaṭameva, tathā paṭisaṃvidite appaṭisaṃviditasaññino vematikassa ca, paṭisaṃviditasaññino, pana gilānassa, yo ca paṭisaṃviditaṃ katvā āhaṭaṃ vā gilānāvasesakaṃ vā bahārāme vā paṭiggahitaṃ, tatthajātakameva vā mūlaphalādiṃ, yāmakālikādīsu vā yaṃkiñci ‘‘sati paccaye paribhuñjā’’ti laddhaṃ paribhuñjantassa, ummattakādīnañca anāpatti. Yathāvuttaāraññakasenāsanatā, yāvakālikassa atatthajātakatā, agilānatā, agilānāvasesakatā, appaṭisaṃviditatā, ajjhārāme paṭiggahaṇaṃ, ajjhoharaṇanti imānettha satta aṅgāni. Samuṭṭhānādīni kathinasadisāneva, idaṃ pana kiriyākiriyanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Catutthapāṭidesanīyasikkhāpadavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Kaṅkhāvitaraṇiyā pātimokkhavaṇṇanāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pāṭidesanīyavaṇṇanā niṭṭhitā."
  }
]