[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "28. Catupaccayabhājanīyavinicchayakathā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Cīvarabhājanakathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "194"
      },
      ". Evaṃ ",
      " upajjhāyādivattasaṅkhātāni cuddasa khandhakavattāni kathetvā idāni catunnaṃ paccayānaṃ bhājanaṃ kathento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘catupaccayabhājana’’"
      },
      "ntiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "catū"
      },
      "ti saṅkhyāsabbanāmapadaṃ. Paṭicca eti sītapaṭighātādikaṃ phalaṃ etasmāti paccayo, cīvarādi, paccayo ca paccayo ca paccayā, cattāro paccayā catupaccayaṃ, bhājīyate vibhājīyate bhājanaṃ. Catupaccayassa bhājanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "catupaccayabhājanaṃ"
      },
      ". Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘cīvarādīnaṃ catunnaṃ paccayānaṃ bhājana’’"
      },
      "nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tattha"
      },
      " tasmiṃ catupaccayabhājane samabhiniviṭṭhe ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cīvarabhājane tāva"
      },
      " paṭhamaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cīvarapaṭiggāhako…pe… veditabbo"
      },
      ". Kasmā? Saṅghikacīvarassa dukkarabhājanattāti sambandho. Tattha āgatāgataṃ cīvaraṃ paṭiggaṇhāti, paṭiggahaṇamattamevassa bhāroti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cīvarapaṭiggāhako"
      },
      ". Cīvarapaṭiggāhakena paṭiggahitaṃ cīvaraṃ nidahati, nidahanamattamevassa bhāroti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cīvaranidahako"
      },
      ". Bhaṇḍāgāre niyutto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhaṇḍāgāriko"
      },
      ". Cīvarādikassa bhaṇḍassa ṭhapanaṭṭhānabhūtaṃ agāraṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhaṇḍāgāraṃ"
      },
      ". Cīvaraṃ bhājeti bhāgaṃ karotīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cīvarabhājako"
      },
      ". Cīvarassa bhājanaṃ vibhāgakaraṇaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cīvarabhājanaṃ,"
      },
      " vibhajanakiriyā."
    ],
    "innerText": "194. Evaṃ upajjhāyādivattasaṅkhātāni cuddasa khandhakavattāni kathetvā idāni catunnaṃ paccayānaṃ bhājanaṃ kathento ‘‘catupaccayabhājana’’ntiādimāha. Tattha catūti saṅkhyāsabbanāmapadaṃ. Paṭicca eti sītapaṭighātādikaṃ phalaṃ etasmāti paccayo, cīvarādi, paccayo ca paccayo ca paccayā, cattāro paccayā catupaccayaṃ, bhājīyate vibhājīyate bhājanaṃ. Catupaccayassa bhājanaṃ catupaccayabhājanaṃ. Tenāha ‘‘cīvarādīnaṃ catunnaṃ paccayānaṃ bhājana’’nti. Tattha tasmiṃ catupaccayabhājane samabhiniviṭṭhe cīvarabhājane tāva paṭhamaṃ cīvarapaṭiggāhako…pe… veditabbo. Kasmā? Saṅghikacīvarassa dukkarabhājanattāti sambandho. Tattha āgatāgataṃ cīvaraṃ paṭiggaṇhāti, paṭiggahaṇamattamevassa bhāroti cīvarapaṭiggāhako. Cīvarapaṭiggāhakena paṭiggahitaṃ cīvaraṃ nidahati, nidahanamattamevassa bhāroti cīvaranidahako. Bhaṇḍāgāre niyutto bhaṇḍāgāriko. Cīvarādikassa bhaṇḍassa ṭhapanaṭṭhānabhūtaṃ agāraṃ bhaṇḍāgāraṃ. Cīvaraṃ bhājeti bhāgaṃ karotīti cīvarabhājako. Cīvarassa bhājanaṃ vibhāgakaraṇaṃ cīvarabhājanaṃ, vibhajanakiriyā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ‘‘cīvarapaṭiggāhako veditabbo’’ti vutto, so kuto labbhateti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘pañcahaṅgehi…pe… sammannitabbo’’"
      },
      "ti. Kathaṃ viññāyatīti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘anujānāmi…pe… vacanato’’"
      },
      "ti. Chandanaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "chando,"
      },
      " icchanaṃ pihananti attho. Gamanaṃ karaṇaṃ gati, kiriyā. Gāreyhā gati agati, chandena agati ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "chandāgati"
      },
      ". Sesesupi eseva nayo. Kathaṃ chandāgatiṃ gacchatīti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tattha pacchā āgatānampī’’"
      },
      "tiādi. Evamitaresupi. Pañcamaṅgaṃ pana satisampajaññayuttābhāvaṃ dasseti. Sukkapakkhepi ito paṭipakkhavasena veditabbo. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘tasmā’’"
      },
      "tiādi."
    ],
    "innerText": "Tattha ‘‘cīvarapaṭiggāhako veditabbo’’ti vutto, so kuto labbhateti āha ‘‘pañcahaṅgehi…pe… sammannitabbo’’ti. Kathaṃ viññāyatīti āha ‘‘anujānāmi…pe… vacanato’’ti. Chandanaṃ chando, icchanaṃ pihananti attho. Gamanaṃ karaṇaṃ gati, kiriyā. Gāreyhā gati agati, chandena agati chandāgati. Sesesupi eseva nayo. Kathaṃ chandāgatiṃ gacchatīti āha ‘‘tattha pacchā āgatānampī’’tiādi. Evamitaresupi. Pañcamaṅgaṃ pana satisampajaññayuttābhāvaṃ dasseti. Sukkapakkhepi ito paṭipakkhavasena veditabbo. Tenāha ‘‘tasmā’’tiādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Imāya kammavācāya vā apalokanena vā"
      },
      "ti idaṃ imassa sammutikammassa lahukakammattā vuttaṃ. Tathā hi vuttaṃ parivāraṭṭhakathāyaṃ (pari. aṭṭha. 482) ‘‘avasesā terasa sammutiyo senāsanaggāhamatakacīvaradānādisammutiyo cāti etāni lahukakammāni apaloketvāpi kātuṃ vaṭṭantī’’ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Antovihāre sabbasaṅghamajjhepi khaṇḍasīmāyampi sammannituṃ vaṭṭatī"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "antovihāre"
      },
      "ti ",
      " baddhasīmavihāraṃ sandhāya vuttaṃ. Na hi abaddhasīmavihāre apalokanādicatubbidhakammaṃ kātuṃ vaṭṭati dubbisodhanattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dhuravihāraṭṭhāne"
      },
      "ti vihāradvārassa sammukhaṭṭhāne."
    ],
    "innerText": "Imāya kammavācāya vā apalokanena vāti idaṃ imassa sammutikammassa lahukakammattā vuttaṃ. Tathā hi vuttaṃ parivāraṭṭhakathāyaṃ (pari. aṭṭha. 482) ‘‘avasesā terasa sammutiyo senāsanaggāhamatakacīvaradānādisammutiyo cāti etāni lahukakammāni apaloketvāpi kātuṃ vaṭṭantī’’ti. Antovihāre sabbasaṅghamajjhepi khaṇḍasīmāyampi sammannituṃ vaṭṭatīti ettha antovihāreti baddhasīmavihāraṃ sandhāya vuttaṃ. Na hi abaddhasīmavihāre apalokanādicatubbidhakammaṃ kātuṃ vaṭṭati dubbisodhanattā. Dhuravihāraṭṭhāneti vihāradvārassa sammukhaṭṭhāne."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "197"
      },
      ". Bhaṇḍāgārasammutiyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vihāramajjheyevā"
      },
      "ti avippavāsasīmāsaṅkhātamahāsīmā vihārassa majjheyeva sammannitabbā. Imasmiṃ pana ṭhāne imaṃ pana bhaṇḍāgāraṃ khaṇḍasīmaṃ gantvā khaṇḍasīmāyaṃ nisinnehi sammannituṃ na vaṭṭati, vihāramajjheyeva ‘‘suṇātu me, bhante, saṅgho, yadi saṅghassa pattakallaṃ, saṅgho ",
      " itthannāmaṃ vihāraṃ bhaṇḍāgāraṃ sammanneyyā’’tiādinā nayena ‘‘kammavācāya vā apalokanena vā sammannitabba’’nti vacanaṃ nissāya ñattidutiyakammaṃ upacārasīmāyaṃ kātuṃ vaṭṭatīti gahetvā kathinadānakammampi abaddhasīmābhūte vihāre upacārasīmāyaṃ karonti, ekacce ñattikammampi tatheva gahetvā abaddhasīmavihāre upacārasīmāmatteyeva uposathapavāraṇaṃ karonti, tadayuttaṃ, kāraṇaṃ panettha kathinavinicchayakathāyaṃ (vi. saṅga. aṭṭha. 226) āvi bhavissati."
    ],
    "innerText": "197. Bhaṇḍāgārasammutiyaṃ vihāramajjheyevāti avippavāsasīmāsaṅkhātamahāsīmā vihārassa majjheyeva sammannitabbā. Imasmiṃ pana ṭhāne imaṃ pana bhaṇḍāgāraṃ khaṇḍasīmaṃ gantvā khaṇḍasīmāyaṃ nisinnehi sammannituṃ na vaṭṭati, vihāramajjheyeva ‘‘suṇātu me, bhante, saṅgho, yadi saṅghassa pattakallaṃ, saṅgho itthannāmaṃ vihāraṃ bhaṇḍāgāraṃ sammanneyyā’’tiādinā nayena ‘‘kammavācāya vā apalokanena vā sammannitabba’’nti vacanaṃ nissāya ñattidutiyakammaṃ upacārasīmāyaṃ kātuṃ vaṭṭatīti gahetvā kathinadānakammampi abaddhasīmābhūte vihāre upacārasīmāyaṃ karonti, ekacce ñattikammampi tatheva gahetvā abaddhasīmavihāre upacārasīmāmatteyeva uposathapavāraṇaṃ karonti, tadayuttaṃ, kāraṇaṃ panettha kathinavinicchayakathāyaṃ (vi. saṅga. aṭṭha. 226) āvi bhavissati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "198"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tulābhūto"
      },
      "ti tulāsadiso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ida"
      },
      "nti sāmaṇerānaṃ upaḍḍhapaṭivīsadānaṃ. Imaṃ kira pāṭhaṃ amanasikarontā idāni kālacīvarampi sāmaṇerānaṃ upaḍḍhapaṭivīsaṃ denti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Phātikamma"
      },
      "nti pahonakakammaṃ, yattakena vinayāgatena sammuñjanībandhanādihatthakammena vihārassa ūnatā na hoti, tattakaṃ katvāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbesa"
      },
      "nti tatruppādavassāvāsikaṃ gaṇhantānaṃ sabbesaṃ bhikkhūnaṃ sāmaṇerānañca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhaṇḍāgāracīvarepī"
      },
      "ti akālacīvaraṃ sandhāya vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ukkuṭṭhiṃ karontī"
      },
      "ti mahāsaddaṃ karonti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Eta"
      },
      "nti ukkuṭṭhiyā katāya samabhāgadānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Virajjhitvā karontī"
      },
      "ti kattabbakālesu akatvā yathārucitakkhaṇe karonti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Samapaṭivīso dātabbo"
      },
      "ti karissāmāti yācantānaṃ paṭiññāmattenapi samako koṭṭhāso dātabbo."
    ],
    "innerText": "198.Tulābhūtoti tulāsadiso. Idanti sāmaṇerānaṃ upaḍḍhapaṭivīsadānaṃ. Imaṃ kira pāṭhaṃ amanasikarontā idāni kālacīvarampi sāmaṇerānaṃ upaḍḍhapaṭivīsaṃ denti. Phātikammanti pahonakakammaṃ, yattakena vinayāgatena sammuñjanībandhanādihatthakammena vihārassa ūnatā na hoti, tattakaṃ katvāti attho. Sabbesanti tatruppādavassāvāsikaṃ gaṇhantānaṃ sabbesaṃ bhikkhūnaṃ sāmaṇerānañca. Bhaṇḍāgāracīvarepīti akālacīvaraṃ sandhāya vuttaṃ. Ukkuṭṭhiṃ karontīti mahāsaddaṃ karonti. Etanti ukkuṭṭhiyā katāya samabhāgadānaṃ. Virajjhitvā karontīti kattabbakālesu akatvā yathārucitakkhaṇe karonti. Samapaṭivīso dātabboti karissāmāti yācantānaṃ paṭiññāmattenapi samako koṭṭhāso dātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atirekabhāgenā"
      },
      "ti dasa bhikkhū honti, sāṭakāpi daseva, tesu eko dvādasa agghati, sesā dasagghanakā. Sabbesu dasagghanakavasena kuse pātite yassa bhikkhuno dvādasagghanako kuso pātito, so ‘‘ettakena mama cīvaraṃ pahotī’’ti tena atirekabhāgena gantukāmo hoti. Ettha ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ettakena mama cīvaraṃ pahotī"
      },
      "ti dvādasagghanakena mama cīvaraṃ paripuṇṇaṃ hoti, na tato ūnenāti sabbaṃ gahetukāmoti ",
      " attho. Bhikkhū ‘‘atirekaṃ āvuso saṅghassa santaka’’nti vadanti, taṃ sutvā bhagavā ‘‘saṅghike ca gaṇasantake ca appakaṃ nāma natthi, sabbattha ",
      " saṃyamo kātabbo, gaṇhantenapi kukkuccāyitabba’’nti dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘anujānāmi, bhikkhave, anukkhepe dinne’’"
      },
      "ti āha. Tattha anukkhepo nāma yaṃ kiñci anukkhipitabbaṃ anuppadātabbaṃ kappiyabhaṇḍaṃ, yattakaṃ tassa paṭivīse adhikaṃ, tattake agghanake yasmiṃ kismiñci kappiyabhaṇḍe dinneti atthoti imamatthaṃ saṅkhepena dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sace dasa bhikkhū honti’’"
      },
      "tyādi vuttaṃ."
    ],
    "innerText": "Atirekabhāgenāti dasa bhikkhū honti, sāṭakāpi daseva, tesu eko dvādasa agghati, sesā dasagghanakā. Sabbesu dasagghanakavasena kuse pātite yassa bhikkhuno dvādasagghanako kuso pātito, so ‘‘ettakena mama cīvaraṃ pahotī’’ti tena atirekabhāgena gantukāmo hoti. Ettha ca ettakena mama cīvaraṃ pahotīti dvādasagghanakena mama cīvaraṃ paripuṇṇaṃ hoti, na tato ūnenāti sabbaṃ gahetukāmoti attho. Bhikkhū ‘‘atirekaṃ āvuso saṅghassa santaka’’nti vadanti, taṃ sutvā bhagavā ‘‘saṅghike ca gaṇasantake ca appakaṃ nāma natthi, sabbattha saṃyamo kātabbo, gaṇhantenapi kukkuccāyitabba’’nti dassetuṃ ‘‘anujānāmi, bhikkhave, anukkhepe dinne’’ti āha. Tattha anukkhepo nāma yaṃ kiñci anukkhipitabbaṃ anuppadātabbaṃ kappiyabhaṇḍaṃ, yattakaṃ tassa paṭivīse adhikaṃ, tattake agghanake yasmiṃ kismiñci kappiyabhaṇḍe dinneti atthoti imamatthaṃ saṅkhepena dassetuṃ ‘‘sace dasa bhikkhū honti’’tyādi vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vikalake tosetvā"
      },
      "ti ettha cīvaravikalakaṃ puggalavikalakanti dve vikalakā. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "cīvaravikalakaṃ"
      },
      " nāma sabbesaṃ pañca pañca vatthāni pattāni, sesānipi atthi, ekekaṃ pana na pāpuṇāti, chinditvā dātabbāni. Chindantehi ca aḍḍhamaṇḍalādīnaṃ vā upāhanathavikādīnaṃ vā pahonakāni khaṇḍāni katvā dātabbāni, heṭṭhimaparicchedena caturaṅgulavitthārampi anuvātappahonakāyāmaṃ khaṇḍaṃ katvā dātuṃ vaṭṭati. Aparibhogaṃ pana na kātabbanti evamettha cīvarassa appahonakabhāvo cīvaravikalakaṃ. Chinditvā dinne panetaṃ tositaṃ hoti. Atha kusapāto kātabbo, sacepi ekassa bhikkhuno koṭṭhāse ekaṃ vā dve vā vatthāni nappahonti, tattha aññaṃ sāmaṇakaṃ parikkhāraṃ ṭhapetvā yo tena tussati, tassa taṃ bhāgaṃ datvā pacchā kusapāto kātabbo. Idampi cīvaravikalakanti andhaṭṭhakathāyaṃ vuttaṃ."
    ],
    "innerText": "Vikalake tosetvāti ettha cīvaravikalakaṃ puggalavikalakanti dve vikalakā. Tattha cīvaravikalakaṃ nāma sabbesaṃ pañca pañca vatthāni pattāni, sesānipi atthi, ekekaṃ pana na pāpuṇāti, chinditvā dātabbāni. Chindantehi ca aḍḍhamaṇḍalādīnaṃ vā upāhanathavikādīnaṃ vā pahonakāni khaṇḍāni katvā dātabbāni, heṭṭhimaparicchedena caturaṅgulavitthārampi anuvātappahonakāyāmaṃ khaṇḍaṃ katvā dātuṃ vaṭṭati. Aparibhogaṃ pana na kātabbanti evamettha cīvarassa appahonakabhāvo cīvaravikalakaṃ. Chinditvā dinne panetaṃ tositaṃ hoti. Atha kusapāto kātabbo, sacepi ekassa bhikkhuno koṭṭhāse ekaṃ vā dve vā vatthāni nappahonti, tattha aññaṃ sāmaṇakaṃ parikkhāraṃ ṭhapetvā yo tena tussati, tassa taṃ bhāgaṃ datvā pacchā kusapāto kātabbo. Idampi cīvaravikalakanti andhaṭṭhakathāyaṃ vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puggalavikalakaṃ"
      },
      " nāma dasa dasa bhikkhū gaṇetvā vaggaṃ karontānaṃ eko vaggo na pūrati, aṭṭha vā nava vā honti, tesaṃ aṭṭha vā nava vā koṭṭhāsā ‘‘tumhe ime gahetvā visuṃ bhājethā’’ti dātabbā. Evamayaṃ puggalānaṃ appahonakabhāvo puggalavikalakaṃ nāma. Visuṃ dinne pana taṃ tositaṃ ",
      " hoti, evaṃ tosetvā kusapāto kātabboti. Atha vā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vikalake tosetvā"
      },
      "ti yo cīvaravibhāgo ūnako, taṃ aññena parikkhārena samaṃ katvā kusapāto kātabboti imamatthaṃ dasseti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sace sabbesaṃ pañca pañca vatthānī’’"
      },
      "tiādinā."
    ],
    "innerText": "Puggalavikalakaṃ nāma dasa dasa bhikkhū gaṇetvā vaggaṃ karontānaṃ eko vaggo na pūrati, aṭṭha vā nava vā honti, tesaṃ aṭṭha vā nava vā koṭṭhāsā ‘‘tumhe ime gahetvā visuṃ bhājethā’’ti dātabbā. Evamayaṃ puggalānaṃ appahonakabhāvo puggalavikalakaṃ nāma. Visuṃ dinne pana taṃ tositaṃ hoti, evaṃ tosetvā kusapāto kātabboti. Atha vā vikalake tosetvāti yo cīvaravibhāgo ūnako, taṃ aññena parikkhārena samaṃ katvā kusapāto kātabboti imamatthaṃ dasseti ‘‘sace sabbesaṃ pañca pañca vatthānī’’tiādinā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "199"
      },
      ". Ito paraṃ tesu tesu vatthūsu āgatavasena aṭṭhakathāyaṃ vuttesu vinicchayesu santesupi tesaṃ vinicchayānaṃ aṭṭhamātikāvinicchayato avimuttattā aṭṭhamātikāvinicchayesveva pakkhipitvā dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘idāni aṭṭhimā, bhikkhave’’"
      },
      "tiādimāha. Yā tā aṭṭha mātikā bhagavatā vuttā, tāsaṃ aṭṭhannaṃ mātikānaṃ vasena vinicchayo idāni veditabboti yojanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parikkhepārahaṭṭhānena paricchinnā"
      },
      "ti iminā aparikkhittassa vihārassa dhuvasannipātaṭṭhānādito paṭhamaleḍḍupātassa ",
      " anto upacārasīmāti dasseti. Idāni dutiyaleḍḍupātassa antopi upacārasīmāyevāti dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘apicā’’"
      },
      "tiādi āraddhaṃ. Dhuvasannipātaṭṭhānampi pariyantagatameva gahetabbaṃ. ‘‘Evaṃ sante tiyojane ṭhitā lābhaṃ gaṇhissantī’’tiādinā ime lābhaggahaṇādayo upacārasīmāvaseneva hoti, na avippavāsasīmāvasenāti dasseti, tena ca imāni lābhaggahaṇādīniyeva upacārasīmāyaṃ kattabbāni, na apalokanakammādīni cattāri kammāni, tāni pana avippavāsasīmādīsuyeva kattabbānīti pakāseti. Tathā hi vuttaṃ sāratthadīpaniyaṃ (sārattha. ṭī. mahāvagga 3.379) ‘‘bhikkhunīnaṃ ārāmappavesanasenāsanapucchanādi parivāsamānattārocanavassacchedanissayasenāsanaggāhādi vidhānanti idaṃ sabbaṃ imissāyeva upacārasīmāya vasena veditabba’’nti."
    ],
    "innerText": "199. Ito paraṃ tesu tesu vatthūsu āgatavasena aṭṭhakathāyaṃ vuttesu vinicchayesu santesupi tesaṃ vinicchayānaṃ aṭṭhamātikāvinicchayato avimuttattā aṭṭhamātikāvinicchayesveva pakkhipitvā dassetuṃ ‘‘idāni aṭṭhimā, bhikkhave’’tiādimāha. Yā tā aṭṭha mātikā bhagavatā vuttā, tāsaṃ aṭṭhannaṃ mātikānaṃ vasena vinicchayo idāni veditabboti yojanā. Parikkhepārahaṭṭhānena paricchinnāti iminā aparikkhittassa vihārassa dhuvasannipātaṭṭhānādito paṭhamaleḍḍupātassa anto upacārasīmāti dasseti. Idāni dutiyaleḍḍupātassa antopi upacārasīmāyevāti dassetuṃ ‘‘apicā’’tiādi āraddhaṃ. Dhuvasannipātaṭṭhānampi pariyantagatameva gahetabbaṃ. ‘‘Evaṃ sante tiyojane ṭhitā lābhaṃ gaṇhissantī’’tiādinā ime lābhaggahaṇādayo upacārasīmāvaseneva hoti, na avippavāsasīmāvasenāti dasseti, tena ca imāni lābhaggahaṇādīniyeva upacārasīmāyaṃ kattabbāni, na apalokanakammādīni cattāri kammāni, tāni pana avippavāsasīmādīsuyeva kattabbānīti pakāseti. Tathā hi vuttaṃ sāratthadīpaniyaṃ (sārattha. ṭī. mahāvagga 3.379) ‘‘bhikkhunīnaṃ ārāmappavesanasenāsanapucchanādi parivāsamānattārocanavassacchedanissayasenāsanaggāhādi vidhānanti idaṃ sabbaṃ imissāyeva upacārasīmāya vasena veditabba’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Lābhatthāya ",
      " ṭhapitā sīmā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "lābhasīmā"
      },
      ". Loke gāmasīmādayo viya lābhasīmā nāma visuṃ pasiddhā natthi, kenāyaṃ anuññātāti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘neva sammāsambuddhenā’’"
      },
      "tiādi. Etena nāyaṃ sāsanavohārasiddhā, lokavohārasiddhā evāti dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Janapadaparicchedo"
      },
      "ti idaṃ lokapasiddhasīmāsaddatthavasena vuttaṃ, paricchedabbhantarampi sabbaṃ janapadasīmāti gahetabbaṃ. Janapado eva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "janapadasīmā,"
      },
      " evaṃ raṭṭhasīmādīsupi. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘āṇāpavattiṭṭhāna’’"
      },
      "ntiādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pathavīvemajjhagatassā"
      },
      "ti yāva udakapariyantā khaṇḍasīmattā vuttaṃ. Upacārasīmādīsu pana abaddhasīmāsu heṭṭhāpathaviyaṃ sabbattha ṭhitānaṃ na pāpuṇāti, kūpādipavesārahaṭṭhāne ṭhitānaññeva pāpuṇātīti heṭṭhā sīmakathāyaṃ vuttanayeneva taṃtaṃsīmaṭṭhabhāvo veditabbo. Cakkavāḷasīmāya dinnaṃ pathavīsandhārakaudakaṭṭhānepi ṭhitānaṃ pāpuṇāti sabbattha cakkavāḷavohārattāti. Samānasaṃvāsaavippavāsasīmāsu dinnassa idaṃ nānattaṃ – ‘‘avippavāsasīmāya dammī’’ti dinnaṃ gāmaṭṭhānaṃ na pāpuṇāti. Kasmā? ‘‘Ṭhapetvā gāmañca gāmūpacārañcā’’ti (mahāva. 144) vuttattā. ‘‘Samānasaṃvāsakasīmāyadammī’’ti dinnaṃ pana gāme ṭhitānampi pāpuṇātīti."
    ],
    "innerText": "Lābhatthāya ṭhapitā sīmā lābhasīmā. Loke gāmasīmādayo viya lābhasīmā nāma visuṃ pasiddhā natthi, kenāyaṃ anuññātāti āha ‘‘neva sammāsambuddhenā’’tiādi. Etena nāyaṃ sāsanavohārasiddhā, lokavohārasiddhā evāti dasseti. Janapadaparicchedoti idaṃ lokapasiddhasīmāsaddatthavasena vuttaṃ, paricchedabbhantarampi sabbaṃ janapadasīmāti gahetabbaṃ. Janapado eva janapadasīmā, evaṃ raṭṭhasīmādīsupi. Tenāha ‘‘āṇāpavattiṭṭhāna’’ntiādi. Pathavīvemajjhagatassāti yāva udakapariyantā khaṇḍasīmattā vuttaṃ. Upacārasīmādīsu pana abaddhasīmāsu heṭṭhāpathaviyaṃ sabbattha ṭhitānaṃ na pāpuṇāti, kūpādipavesārahaṭṭhāne ṭhitānaññeva pāpuṇātīti heṭṭhā sīmakathāyaṃ vuttanayeneva taṃtaṃsīmaṭṭhabhāvo veditabbo. Cakkavāḷasīmāya dinnaṃ pathavīsandhārakaudakaṭṭhānepi ṭhitānaṃ pāpuṇāti sabbattha cakkavāḷavohārattāti. Samānasaṃvāsaavippavāsasīmāsu dinnassa idaṃ nānattaṃ – ‘‘avippavāsasīmāya dammī’’ti dinnaṃ gāmaṭṭhānaṃ na pāpuṇāti. Kasmā? ‘‘Ṭhapetvā gāmañca gāmūpacārañcā’’ti (mahāva. 144) vuttattā. ‘‘Samānasaṃvāsakasīmāyadammī’’ti dinnaṃ pana gāme ṭhitānampi pāpuṇātīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "200-1"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Buddhādhivuttho"
      },
      "ti buddhena bhagavatā adhivuttho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekasmi"
      },
      "nti ekasmiṃ vihāre. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pākavatta"
      },
      "nti nibaddhadānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vattatī"
      },
      "ti pavattati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tehi vattabba"
      },
      "nti yesaṃ sammukhe esa deti, tehi bhikkhūhi vattabbaṃ."
    ],
    "innerText": "200-1.Buddhādhivutthoti buddhena bhagavatā adhivuttho. Ekasminti ekasmiṃ vihāre. Pākavattanti nibaddhadānaṃ. Vattatīti pavattati. Tehi vattabbanti yesaṃ sammukhe esa deti, tehi bhikkhūhi vattabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "202"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dutiyabhāge pana therāsanaṃ āruḷhe"
      },
      "ti yāva saṅghanavakaṃ ekavāraṃ sabbesaṃ bhāgaṃ datvā ",
      " cīvare aparikkhīṇe puna sabbesaṃ dātuṃ dutiyabhāge therassa dinneti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pubbe vuttanayenā"
      },
      "ti ‘‘tuyheva bhikkhu tāni cīvarānī’’ti (mahāva. 363) bhagavatā ",
      " vuttanayena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṃsukūlikānampi vaṭṭatī"
      },
      "ti ‘‘tuyhaṃ demā’’ti avatvā, ‘bhikkhūnaṃ dema, therānaṃ demā’’ti vuttattā ‘‘paṃsukūlikānampi vaṭṭatī’’ti sāratthadīpaniyaṃ (sārattha. ṭī. mahāvagga 3.379) vuttaṃ. Vimativinodaniyaṃ (vi. vi. ṭī. mahāvagga 2.379) pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "paṃsukūlikānampi vaṭṭatī"
      },
      "ti ettha ‘‘tuyhaṃ demā’’ti avuttattāti kāraṇaṃ vadanti. Yadi evaṃ ‘‘saṅghassa demā’’ti vuttepi vaṭṭeyya, ‘‘bhikkhūnaṃ dema, therānaṃ dema, saṅghassa demā’’ti vacanato bhedo na dissati, vīmaṃsitabbamettha kāraṇanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pārupituṃ vaṭṭatī"
      },
      "ti paṃsukūlikānaṃ vaṭṭati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sāmikehi vicāritamevā"
      },
      "ti upāhanatthavikādīnamatthāya vicāritameva."
    ],
    "innerText": "202.Dutiyabhāge pana therāsanaṃ āruḷheti yāva saṅghanavakaṃ ekavāraṃ sabbesaṃ bhāgaṃ datvā cīvare aparikkhīṇe puna sabbesaṃ dātuṃ dutiyabhāge therassa dinneti attho. Pubbe vuttanayenāti ‘‘tuyheva bhikkhu tāni cīvarānī’’ti (mahāva. 363) bhagavatā vuttanayena. Paṃsukūlikānampi vaṭṭatīti ‘‘tuyhaṃ demā’’ti avatvā, ‘bhikkhūnaṃ dema, therānaṃ demā’’ti vuttattā ‘‘paṃsukūlikānampi vaṭṭatī’’ti sāratthadīpaniyaṃ (sārattha. ṭī. mahāvagga 3.379) vuttaṃ. Vimativinodaniyaṃ (vi. vi. ṭī. mahāvagga 2.379) pana paṃsukūlikānampi vaṭṭatīti ettha ‘‘tuyhaṃ demā’’ti avuttattāti kāraṇaṃ vadanti. Yadi evaṃ ‘‘saṅghassa demā’’ti vuttepi vaṭṭeyya, ‘‘bhikkhūnaṃ dema, therānaṃ dema, saṅghassa demā’’ti vacanato bhedo na dissati, vīmaṃsitabbamettha kāraṇanti. Pārupituṃ vaṭṭatīti paṃsukūlikānaṃ vaṭṭati. Sāmikehi vicāritamevāti upāhanatthavikādīnamatthāya vicāritameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "203"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upaḍḍhaṃ dātabba"
      },
      "nti yaṃ ubhatosaṅghassa dinnaṃ, tato upaḍḍhaṃ bhikkhūnaṃ upaḍḍhaṃ bhikkhunīnaṃ dātabbaṃ. Sacepi eko bhikkhu hoti, ekā vā bhikkhunī, antamaso anupasampannassapi upaḍḍhameva dātabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Bhikkhusaṅghassa ca bhikkhunīnañca dammī’’ti vutte pana na majjhe bhinditvā dātabba"
      },
      "nti ettha yasmā bhikkhunipakkhe saṅghassa paccekaṃ aparāmaṭṭhattā bhikkhunīnaṃ gaṇanāya bhāgo dātabboti dāyakassa adhippāyoti sijjhati, tathā dānañca bhikkhūpi gaṇetvā dinne eva yujjati. Itarathā hi ‘‘kittakaṃ bhikkhūnaṃ dātabbaṃ, kittakaṃ bhikkhunīna’’nti na viññāyati, tasmā ‘‘bhikkhusaṅghassā’’ti vuttavacanampi ‘‘bhikkhūna’’nti vuttavacanasadisamevāti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘bhikkhū ca bhikkhuniyo ca gaṇetvā dātabba’’"
      },
      "nti. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘puggalo…pe… bhikkhusaṅghaggahaṇena gahitattā’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Bhikkhusaṅghassa ca bhikkhunīnañca tuyhañcā’’ti vutte pana puggalo visuṃ na labhatī"
      },
      "ti idaṃ aṭṭhakathāpamāṇeneva gahetabbaṃ, na hettha visesakāraṇaṃ upalabbhati. Tathā hi ‘‘ubhatosaṅghassa ca tuyhañca dammī’’ti vutte sāmaññavisesavacanehi saṅgahitattā yathā puggalo visuṃ labhati, evamidhāpi ‘‘bhikkhusaṅghassa ca tuyhañcā’’ti ",
      " sāmaññavisesavacanasabbhāvato bhavitabbameva visuṃ puggalapaṭivīsenāti viññāyati, tasmā aṭṭhakathāvacanamevettha pamāṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāpuṇanaṭṭhānato ekameva labhatī"
      },
      "ti attano vassaggena pattaṭṭhānato ekameva koṭṭhāsaṃ labhati. Tattha kāraṇamāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kasmā? Bhikkhusaṅghaggahaṇena gahitattā’’"
      },
      "ti, bhikkhusaṅghaggahaṇeneva puggalassapi gahitattāti adhippāyoti sāratthadīpaniyaṃ (sārattha. ṭī. mahāvagga 3.379) vuttaṃ."
    ],
    "innerText": "203.Upaḍḍhaṃ dātabbanti yaṃ ubhatosaṅghassa dinnaṃ, tato upaḍḍhaṃ bhikkhūnaṃ upaḍḍhaṃ bhikkhunīnaṃ dātabbaṃ. Sacepi eko bhikkhu hoti, ekā vā bhikkhunī, antamaso anupasampannassapi upaḍḍhameva dātabbaṃ. ‘‘Bhikkhusaṅghassa ca bhikkhunīnañca dammī’’ti vutte pana na majjhe bhinditvā dātabbanti ettha yasmā bhikkhunipakkhe saṅghassa paccekaṃ aparāmaṭṭhattā bhikkhunīnaṃ gaṇanāya bhāgo dātabboti dāyakassa adhippāyoti sijjhati, tathā dānañca bhikkhūpi gaṇetvā dinne eva yujjati. Itarathā hi ‘‘kittakaṃ bhikkhūnaṃ dātabbaṃ, kittakaṃ bhikkhunīna’’nti na viññāyati, tasmā ‘‘bhikkhusaṅghassā’’ti vuttavacanampi ‘‘bhikkhūna’’nti vuttavacanasadisamevāti āha ‘‘bhikkhū ca bhikkhuniyo ca gaṇetvā dātabba’’nti. Tenāha ‘‘puggalo…pe… bhikkhusaṅghaggahaṇena gahitattā’’ti. ‘‘Bhikkhusaṅghassa ca bhikkhunīnañca tuyhañcā’’ti vutte pana puggalo visuṃ na labhatīti idaṃ aṭṭhakathāpamāṇeneva gahetabbaṃ, na hettha visesakāraṇaṃ upalabbhati. Tathā hi ‘‘ubhatosaṅghassa ca tuyhañca dammī’’ti vutte sāmaññavisesavacanehi saṅgahitattā yathā puggalo visuṃ labhati, evamidhāpi ‘‘bhikkhusaṅghassa ca tuyhañcā’’ti sāmaññavisesavacanasabbhāvato bhavitabbameva visuṃ puggalapaṭivīsenāti viññāyati, tasmā aṭṭhakathāvacanamevettha pamāṇaṃ. Pāpuṇanaṭṭhānato ekameva labhatīti attano vassaggena pattaṭṭhānato ekameva koṭṭhāsaṃ labhati. Tattha kāraṇamāha ‘‘kasmā? Bhikkhusaṅghaggahaṇena gahitattā’’ti, bhikkhusaṅghaggahaṇeneva puggalassapi gahitattāti adhippāyoti sāratthadīpaniyaṃ (sārattha. ṭī. mahāvagga 3.379) vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vimativinodaniyaṃ ",
      " (vi. vi. ṭī. mahāvagga 2.379) pana bhikkhusaṅghasaddena bhikkhūnaññeva gahitattā, puggalassa pana ‘‘tuyhañcā’’ti visuṃ gahitattā ca tatthassa aggahitattā daṭṭhabbā, ‘‘bhikkhūnañca bhikkhunīnañca tuyhañcā’’ti vuttaṭṭhānasadisattāti adhippāyo. Puggalappadhāno hettha saṅgha-saddo daṭṭhabbo. Keci pana ‘‘bhikkhusaṅghaggahaṇena gahitattā’’ti pāṭhaṃ likhanti, taṃ na sundaraṃ tassa visuṃ lābhaggahaṇe kāraṇavacanattā. Tathā hi ‘‘visuṃ saṅghaggahaṇena gahitattā’’ti visuṃ puggalassapi bhāgaggahaṇe kāraṇaṃ vuttaṃ. Yathā cettha puggalassa aggahaṇaṃ, evaṃ upari ‘‘bhikkhusaṅghassa ca tuyhañcā’’tiādīsupi visuṃ saṅghādisaddehi puggalassa aggahaṇaṃ daṭṭhabbaṃ. Yadi hi gahaṇaṃ siyā, saṅghatopi visumpīti bhāgadvayaṃ labheyya ubhayattha gahitattāti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pūjetabba"
      },
      "ntiādi gihikammaṃ na hotīti dassanatthaṃ vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhikkhusaṅghassa harā"
      },
      "ti idaṃ piṇḍapātaharaṇaṃ sandhāya vuttaṃ. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘bhuñjituṃ vaṭṭatī’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Bhikkhusaṅghassa harā’’ti vuttepi haritabba"
      },
      "nti īdisaṃ gihiveyyāvaccaṃ na hotīti katvā vuttaṃ."
    ],
    "innerText": "Vimativinodaniyaṃ (vi. vi. ṭī. mahāvagga 2.379) pana bhikkhusaṅghasaddena bhikkhūnaññeva gahitattā, puggalassa pana ‘‘tuyhañcā’’ti visuṃ gahitattā ca tatthassa aggahitattā daṭṭhabbā, ‘‘bhikkhūnañca bhikkhunīnañca tuyhañcā’’ti vuttaṭṭhānasadisattāti adhippāyo. Puggalappadhāno hettha saṅgha-saddo daṭṭhabbo. Keci pana ‘‘bhikkhusaṅghaggahaṇena gahitattā’’ti pāṭhaṃ likhanti, taṃ na sundaraṃ tassa visuṃ lābhaggahaṇe kāraṇavacanattā. Tathā hi ‘‘visuṃ saṅghaggahaṇena gahitattā’’ti visuṃ puggalassapi bhāgaggahaṇe kāraṇaṃ vuttaṃ. Yathā cettha puggalassa aggahaṇaṃ, evaṃ upari ‘‘bhikkhusaṅghassa ca tuyhañcā’’tiādīsupi visuṃ saṅghādisaddehi puggalassa aggahaṇaṃ daṭṭhabbaṃ. Yadi hi gahaṇaṃ siyā, saṅghatopi visumpīti bhāgadvayaṃ labheyya ubhayattha gahitattāti vuttaṃ. Pūjetabbantiādi gihikammaṃ na hotīti dassanatthaṃ vuttaṃ. Bhikkhusaṅghassa harāti idaṃ piṇḍapātaharaṇaṃ sandhāya vuttaṃ. Tenāha ‘‘bhuñjituṃ vaṭṭatī’’ti. ‘‘Bhikkhusaṅghassa harā’’ti vuttepi haritabbanti īdisaṃ gihiveyyāvaccaṃ na hotīti katvā vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "204"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Antohemante"
      },
      "ti iminā anatthate kathine vassānaṃ pacchime māse dinnaṃ purimavassaṃvutthānaññeva pāpuṇāti, tato paraṃ hemante dinnaṃ pacchimavassaṃvutthānampi vutthavassattā ",
      " pāpuṇāti, hemantato pana paraṃ piṭṭhisamaye ‘‘vassaṃvutthasaṅghassā’’ti evaṃ paricchinditvā dinnaṃ anantare vasse vā tato paresu vā yattha katthaci tasmiṃ bhikkhubhāve vutthavassānaṃ sabbesaṃ pāpuṇāti. Ye pana sabbathā avutthavassā, tesaṃ na pāpuṇātīti dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lakkhaṇaññū vadantī"
      },
      "ti vinayalakkhaṇaññuno ācariyā vadanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Lakkhaṇaññū vadantī"
      },
      "ti idaṃ sanniṭṭhānavacanaṃ, aṭṭhakathāsu anāgatattā pana evaṃ vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bahiupacārasīmāyaṃ…pe… sabbesaṃ pāpuṇātī"
      },
      "ti yattha katthaci vutthavassānaṃ sabbesaṃ pāpuṇātīti adhippāyo. Teneva mātikāṭṭhakathāyampi (kaṅkha. aṭṭha. akālacīvarasikkhāpadavaṇṇanā) ‘‘sace pana bahiupacārasīmāyaṃ ṭhito ‘vassaṃvutthasaṅghassa dammī’ti vadati, yattha katthaci vutthavassānaṃ sabbesaṃ sampattānaṃ pāpuṇātī’’ti vuttaṃ. Gaṇṭhipadesu pana ‘‘vassāvāsassa ananurūpe padese ṭhatvā vuttattā vassaṃvutthānañca avutthānañca sabbesaṃ pāpuṇātī’’ti vuttaṃ, taṃ na gahetabbaṃ. Na hi ‘‘vassaṃvutthasaṅghassa dammī’’ti vutte avutthavassānaṃ pāpuṇāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbesampī"
      },
      "ti tasmiṃ bhikkhubhāve vutthavassānaṃ sabbesampīti attho daṭṭhabbo ‘‘vassaṃvutthasaṅghassā’’ti vuttattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sammukhībhūtānaṃ sabbesampī"
      },
      "ti etthāpi eseva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evaṃ vadatī"
      },
      "ti vassaṃvutthasaṅghassa dammīti vadati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atītavassa"
      },
      "nti anantarātītavassaṃ."
    ],
    "innerText": "204.Antohemanteti iminā anatthate kathine vassānaṃ pacchime māse dinnaṃ purimavassaṃvutthānaññeva pāpuṇāti, tato paraṃ hemante dinnaṃ pacchimavassaṃvutthānampi vutthavassattā pāpuṇāti, hemantato pana paraṃ piṭṭhisamaye ‘‘vassaṃvutthasaṅghassā’’ti evaṃ paricchinditvā dinnaṃ anantare vasse vā tato paresu vā yattha katthaci tasmiṃ bhikkhubhāve vutthavassānaṃ sabbesaṃ pāpuṇāti. Ye pana sabbathā avutthavassā, tesaṃ na pāpuṇātīti dasseti. Lakkhaṇaññū vadantīti vinayalakkhaṇaññuno ācariyā vadanti. Lakkhaṇaññū vadantīti idaṃ sanniṭṭhānavacanaṃ, aṭṭhakathāsu anāgatattā pana evaṃ vuttaṃ. Bahiupacārasīmāyaṃ…pe… sabbesaṃ pāpuṇātīti yattha katthaci vutthavassānaṃ sabbesaṃ pāpuṇātīti adhippāyo. Teneva mātikāṭṭhakathāyampi (kaṅkha. aṭṭha. akālacīvarasikkhāpadavaṇṇanā) ‘‘sace pana bahiupacārasīmāyaṃ ṭhito ‘vassaṃvutthasaṅghassa dammī’ti vadati, yattha katthaci vutthavassānaṃ sabbesaṃ sampattānaṃ pāpuṇātī’’ti vuttaṃ. Gaṇṭhipadesu pana ‘‘vassāvāsassa ananurūpe padese ṭhatvā vuttattā vassaṃvutthānañca avutthānañca sabbesaṃ pāpuṇātī’’ti vuttaṃ, taṃ na gahetabbaṃ. Na hi ‘‘vassaṃvutthasaṅghassa dammī’’ti vutte avutthavassānaṃ pāpuṇāti. Sabbesampīti tasmiṃ bhikkhubhāve vutthavassānaṃ sabbesampīti attho daṭṭhabbo ‘‘vassaṃvutthasaṅghassā’’ti vuttattā. Sammukhībhūtānaṃ sabbesampīti etthāpi eseva nayo. Evaṃ vadatīti vassaṃvutthasaṅghassa dammīti vadati. Atītavassanti anantarātītavassaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "205"
      },
      ". Idāni ",
      " ‘‘ādissa detī’’ti padaṃ vibhajanto ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ādissa detīti etthā’’"
      },
      "tiādimāha. Tattha yāguyā vā…pe… bhesajje vā ādisitvā paricchinditvā dento dāyako ādissa deti nāmāti yojanā. Sesaṃ pākaṭameva."
    ],
    "innerText": "205. Idāni ‘‘ādissa detī’’ti padaṃ vibhajanto ‘‘ādissa detīti etthā’’tiādimāha. Tattha yāguyā vā…pe… bhesajje vā ādisitvā paricchinditvā dento dāyako ādissa deti nāmāti yojanā. Sesaṃ pākaṭameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "206"
      },
      ". Idāni ‘‘puggalassa detī’’ti padaṃ vibhajanto āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘puggalassa deti etthā’’"
      },
      "tiādi. Saṅghato ca gaṇato ca vinimuttassa ",
      " attano kulūpakādipuggalassa dento dāyako puggalassa deti nāma. Taṃ pana puggalikadānaṃ parammukhā vā hoti sammukhā vā. Tattha parammukhā dento ‘‘idaṃ cīvaraṃ itthannāmassa dammī’’ti nāmaṃ uddharitvā deti, sammukhā dento ca bhikkhuno pādamūle cīvaraṃ ṭhapetvā ‘‘idaṃ, bhante, tumhākaṃ dammī’’ti vatvā deti, tadubhayathāpi dento puggalassa deti nāmāti attho. Na kevalaṃ ekasseva dento puggalassa deti nāma, atha kho antevāsikādīhi saddhiṃ dentopi puggalassa deti nāmāti dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sace panā’’"
      },
      "tiādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uddesaṃ gahetuṃ āgato"
      },
      "ti tassa santike uddesaṃ aggahitapubbassapi uddesaṃ gaṇhissāmīti āgatakālato paṭṭhāya antevāsikabhāvūpagamanato vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gahetvā gacchanto"
      },
      "ti pariniṭṭhitauddeso hutvā gacchanto. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vattaṃ katvā uddesaparipucchādīni gahetvā vicarantāna"
      },
      "nti idaṃ ‘‘uddesantevāsikāna’’nti imasseva visesanaṃ. Tena uddesakāle āgantvā uddesaṃ gahetvā gantvā aññattha nivasante anibaddhacārike nivatteti."
    ],
    "innerText": "206. Idāni ‘‘puggalassa detī’’ti padaṃ vibhajanto āha ‘‘puggalassa deti etthā’’tiādi. Saṅghato ca gaṇato ca vinimuttassa attano kulūpakādipuggalassa dento dāyako puggalassa deti nāma. Taṃ pana puggalikadānaṃ parammukhā vā hoti sammukhā vā. Tattha parammukhā dento ‘‘idaṃ cīvaraṃ itthannāmassa dammī’’ti nāmaṃ uddharitvā deti, sammukhā dento ca bhikkhuno pādamūle cīvaraṃ ṭhapetvā ‘‘idaṃ, bhante, tumhākaṃ dammī’’ti vatvā deti, tadubhayathāpi dento puggalassa deti nāmāti attho. Na kevalaṃ ekasseva dento puggalassa deti nāma, atha kho antevāsikādīhi saddhiṃ dentopi puggalassa deti nāmāti dassetuṃ ‘‘sace panā’’tiādimāha. Tattha uddesaṃ gahetuṃ āgatoti tassa santike uddesaṃ aggahitapubbassapi uddesaṃ gaṇhissāmīti āgatakālato paṭṭhāya antevāsikabhāvūpagamanato vuttaṃ. Gahetvā gacchantoti pariniṭṭhitauddeso hutvā gacchanto. Vattaṃ katvā uddesaparipucchādīni gahetvā vicarantānanti idaṃ ‘‘uddesantevāsikāna’’nti imasseva visesanaṃ. Tena uddesakāle āgantvā uddesaṃ gahetvā gantvā aññattha nivasante anibaddhacārike nivatteti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ cīvarakkhandhake (mahāva. 379) āgataaṭṭhamātikāvasena cīvaravibhajanaṃ dassetvā idāni tasmiṃyeva cīvarakkhandhake majjhe āgatesu vatthūsu āgatanayaṃ nivattetvā dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sace koci bhikkhū’’"
      },
      "tiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tattha kiṃ kātabba"
      },
      "nti pucchāya ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tasseva tāni cīvarānī"
      },
      "ti vissajjanā, sesāni ñāpakādivasena vuttāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pañca māse"
      },
      "ti accantasaṃyoge upayogavacanaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vaḍḍhiṃ payojetvā ṭhapitaupanikkhepato"
      },
      "ti vassāvāsikatthāya veyyāvaccakarehi vaḍḍhiṃ payojetvā ṭhapitaupanikkhepato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatruppādato"
      },
      "ti nāḷikerārāmāditatruppādato. Aṭṭhakathāyaṃ pana ‘‘idaṃ idha vassaṃvutthasaṅghassa demāti vā vassāvāsikaṃ demāti vā vatvā ",
      " dinnaṃ taṃ anatthatakathinassapi pañca māse pāpuṇātī’’ti vuttaṃ, taṃ vassāvāsikalābhavasena uppanne labbhamānavisesaṃ dassetuṃ vuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "idhā"
      },
      "ti abhilāpamattamevetaṃ, idha-saddaṃ vinā ‘‘vassaṃvutthasaṅghassa demā’’ti vuttepi so eva nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anatthatakathinassapi pañca māse pāpuṇātī"
      },
      "ti vassāvāsikalābhavasena uppannattā anatthatakathinassapi vutthavassassa pañca māse pāpuṇāti, tato paraṃ pana uppannavassāvāsikaṃ pucchitabbaṃ ",
      " ‘‘kiṃ atītavasse idaṃ vassāvāsikaṃ, udāhu anāgatavasse’’ti. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "tato para"
      },
      "nti pañcamāsato paraṃ, gimhānassa paṭhamadivasato paṭṭhāyāti attho."
    ],
    "innerText": "Evaṃ cīvarakkhandhake (mahāva. 379) āgataaṭṭhamātikāvasena cīvaravibhajanaṃ dassetvā idāni tasmiṃyeva cīvarakkhandhake majjhe āgatesu vatthūsu āgatanayaṃ nivattetvā dassento ‘‘sace koci bhikkhū’’tiādimāha. Tattha kiṃ kātabbanti pucchāya tasseva tāni cīvarānīti vissajjanā, sesāni ñāpakādivasena vuttāni. Pañca māseti accantasaṃyoge upayogavacanaṃ. Vaḍḍhiṃ payojetvā ṭhapitaupanikkhepatoti vassāvāsikatthāya veyyāvaccakarehi vaḍḍhiṃ payojetvā ṭhapitaupanikkhepato. Tatruppādatoti nāḷikerārāmāditatruppādato. Aṭṭhakathāyaṃ pana ‘‘idaṃ idha vassaṃvutthasaṅghassa demāti vā vassāvāsikaṃ demāti vā vatvā dinnaṃ taṃ anatthatakathinassapi pañca māse pāpuṇātī’’ti vuttaṃ, taṃ vassāvāsikalābhavasena uppanne labbhamānavisesaṃ dassetuṃ vuttaṃ. Tattha idhāti abhilāpamattamevetaṃ, idha-saddaṃ vinā ‘‘vassaṃvutthasaṅghassa demā’’ti vuttepi so eva nayo. Anatthatakathinassapi pañca māse pāpuṇātīti vassāvāsikalābhavasena uppannattā anatthatakathinassapi vutthavassassa pañca māse pāpuṇāti, tato paraṃ pana uppannavassāvāsikaṃ pucchitabbaṃ ‘‘kiṃ atītavasse idaṃ vassāvāsikaṃ, udāhu anāgatavasse’’ti. Tattha tato paranti pañcamāsato paraṃ, gimhānassa paṭhamadivasato paṭṭhāyāti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ṭhitikā pana na tiṭṭhatī"
      },
      "ti ettha aṭṭhitāya ṭhitikāya puna aññasmiṃ cīvare uppanne sace eko bhikkhu āgacchati, majjhe chinditvā dvīhipi gahetabbaṃ. Ṭhitāya pana ṭhitikāya puna aññasmiṃ cīvare uppanne sace navakataro āgacchati, ṭhitikā heṭṭhā gacchati. Sace vuḍḍhataro āgacchati, ṭhitikā uddhaṃ ārohati. Atha añño natthi, puna attano pāpetvā gahetabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Duggahitānī"
      },
      "ti aggahitāni, saṅghikāneva hontīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Pātite kuse’’"
      },
      "ti ekakoṭṭhāse kusadaṇḍake pātitamatte sacepi bhikkhusahassaṃ hoti, gahitameva nāma cīvaraṃ. ‘‘Nākāmā bhāgo dātabbo’’ti aṭṭhakathāvacanaṃ (mahāva. aṭṭha. 363), tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gahitameva nāmā"
      },
      "ti ‘‘imassa idaṃ patta’’nti kiñcāpi na viditaṃ, te pana bhāgā atthato tesaṃ pattāyevāti adhippāyo."
    ],
    "innerText": "Ṭhitikā pana na tiṭṭhatīti ettha aṭṭhitāya ṭhitikāya puna aññasmiṃ cīvare uppanne sace eko bhikkhu āgacchati, majjhe chinditvā dvīhipi gahetabbaṃ. Ṭhitāya pana ṭhitikāya puna aññasmiṃ cīvare uppanne sace navakataro āgacchati, ṭhitikā heṭṭhā gacchati. Sace vuḍḍhataro āgacchati, ṭhitikā uddhaṃ ārohati. Atha añño natthi, puna attano pāpetvā gahetabbaṃ. Duggahitānīti aggahitāni, saṅghikāneva hontīti attho. ‘‘Pātite kuse’’ti ekakoṭṭhāse kusadaṇḍake pātitamatte sacepi bhikkhusahassaṃ hoti, gahitameva nāma cīvaraṃ. ‘‘Nākāmā bhāgo dātabbo’’ti aṭṭhakathāvacanaṃ (mahāva. aṭṭha. 363), tattha gahitameva nāmāti ‘‘imassa idaṃ patta’’nti kiñcāpi na viditaṃ, te pana bhāgā atthato tesaṃ pattāyevāti adhippāyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sattāhavārena aruṇameva uṭṭhāpetī"
      },
      "ti idaṃ nānāsīmavihāresu kattabbanayena ekasmimpi vihāre dvīsu senāsanesu nivutthabhāvadassanatthaṃ vuttaṃ, aruṇuṭṭhāpaneneva tattha vuttho hoti, na pana vassacchedaparihārāya. Antoupacārasīmāya ",
      " hi yattha katthaci aruṇaṃ uṭṭhāpento attanā gahitasenāsanaṃ appaviṭṭhopi vutthavasso eva hoti. Gahitasenāsane pana nivuttho nāma na hoti, tattha aruṇuṭṭhāpane sati hoti. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘purimasmiṃ bahutaraṃ nivasati nāmā’’"
      },
      "ti. Etena ca itarasmiṃ sattāhavārenapi aruṇuṭṭhāpane sati eva appataraṃ nivasati nāma hoti, nāsatīti dīpitaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ida"
      },
      "nti ekādhippāyadānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nānālābhehī"
      },
      "tiādīsu nānā visuṃ visuṃ lābho etesūti nānālābhā, dve vihārā, tehi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nānālābhehi"
      },
      ". Nānā visuṃ visuṃ pākārādīhi paricchinno upacāro etesanti nānūpacārā, tehi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nānūpacārehi"
      },
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekasīmavihārehī"
      },
      "ti ekasīmāyaṃ dvīhi vihārehīti sāratthadīpaniyaṃ (sārattha. ṭī. mahāvagga 3.364) vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nānālābhehī"
      },
      "ti visuṃ visuṃ nibaddhavassāvāsikalābhehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nānūpacārehī"
      },
      "ti nānāparikkhepanānādvārehi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekasīmavihārehī"
      },
      "ti dvinnaṃ vihārānaṃ ekena pākārena parikkhittattā ekāya upacārasīmāya antogatehi dvīhi vihārehīti vimativinodaniyaṃ (vi. vi. ṭī. mahāvagga 2.364). ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Senāsanaggāho paṭippassambhatī"
      },
      "ti paṭhamaṃ gahito paṭippassambhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatthā"
      },
      "ti yattha senāsanaggāho paṭippassambhati, tattha."
    ],
    "innerText": "Sattāhavārena aruṇameva uṭṭhāpetīti idaṃ nānāsīmavihāresu kattabbanayena ekasmimpi vihāre dvīsu senāsanesu nivutthabhāvadassanatthaṃ vuttaṃ, aruṇuṭṭhāpaneneva tattha vuttho hoti, na pana vassacchedaparihārāya. Antoupacārasīmāya hi yattha katthaci aruṇaṃ uṭṭhāpento attanā gahitasenāsanaṃ appaviṭṭhopi vutthavasso eva hoti. Gahitasenāsane pana nivuttho nāma na hoti, tattha aruṇuṭṭhāpane sati hoti. Tenāha ‘‘purimasmiṃ bahutaraṃ nivasati nāmā’’ti. Etena ca itarasmiṃ sattāhavārenapi aruṇuṭṭhāpane sati eva appataraṃ nivasati nāma hoti, nāsatīti dīpitaṃ hoti. Idanti ekādhippāyadānaṃ. Nānālābhehītiādīsu nānā visuṃ visuṃ lābho etesūti nānālābhā, dve vihārā, tehi nānālābhehi. Nānā visuṃ visuṃ pākārādīhi paricchinno upacāro etesanti nānūpacārā, tehi nānūpacārehi. Ekasīmavihārehīti ekasīmāyaṃ dvīhi vihārehīti sāratthadīpaniyaṃ (sārattha. ṭī. mahāvagga 3.364) vuttaṃ. Nānālābhehīti visuṃ visuṃ nibaddhavassāvāsikalābhehi. Nānūpacārehīti nānāparikkhepanānādvārehi. Ekasīmavihārehīti dvinnaṃ vihārānaṃ ekena pākārena parikkhittattā ekāya upacārasīmāya antogatehi dvīhi vihārehīti vimativinodaniyaṃ (vi. vi. ṭī. mahāvagga 2.364). Senāsanaggāho paṭippassambhatīti paṭhamaṃ gahito paṭippassambhati. Tatthāti yattha senāsanaggāho paṭippassambhati, tattha."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "207"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhikkhussa"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kālakate"
      },
      "ti ettha kālakata-saddo bhāvasādhanoti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kālakiriyāyā’’"
      },
      "ti. Pāḷiyaṃ gilānupaṭṭhākānaṃ cīvaradāne sāmaṇerānaṃ ticīvarādhiṭṭhānābhāvā ‘‘cīvarañca pattañcā’’tiādi sabbattha vuttaṃ."
    ],
    "innerText": "207.Bhikkhussakālakateti ettha kālakata-saddo bhāvasādhanoti āha ‘‘kālakiriyāyā’’ti. Pāḷiyaṃ gilānupaṭṭhākānaṃ cīvaradāne sāmaṇerānaṃ ticīvarādhiṭṭhānābhāvā ‘‘cīvarañca pattañcā’’tiādi sabbattha vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "208"
      },
      ". Sacepi sahassaṃ agghati, gilānupaṭṭhākānaññeva dātabbanti sambandho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Añña"
      },
      "nti ticīvarapattato aññaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Appaggha"
      },
      "nti atijiṇṇādibhāvena nihīnaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tato"
      },
      "ti avasesaparikkhārato. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabba"
      },
      "nti pattaṃ cīvarañca. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tattha tattha saṅghassevā"
      },
      "ti tasmiṃ tasmiṃ ",
      " vihāre saṅghasseva. Bhikkhuno kālakataṭṭhānaṃ sandhāya ‘‘idhā’’ti vattabbe ‘‘tatthā’’ti vuttattā vicchāvacanattā ca parikkhārassa ṭhapitaṭṭhānaṃ vuttanti viññāyati. Pāḷiyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avissajjikaṃ avebhaṅgika"
      },
      "nti āgatānāgatassa cātuddisassa saṅghasseva santakaṃ hutvā kassaci avissajjikaṃ avebhaṅgikañca bhavituṃ anujānāmīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Sante patirūpe gāhake’’"
      },
      "ti vuttattā gāhake asati adatvā bhājitepi subhājitamevāti daṭṭhabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dakkhiṇodakaṃ pamāṇa"
      },
      "nti ettha sāratthadīpaniyaṃ (sārattha. ṭī. mahāvagga 3.376) tāva ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yattha pana dakkhiṇodakaṃ pamāṇa"
      },
      "nti bhikkhū yasmiṃ raṭṭhe dakkhiṇodakapaṭiggahaṇamattenapi deyyadhammassa sāmino hontīti adhippāyo’’ti vuttaṃ. Vimativinodaniyaṃ (vi. vi. ṭī. mahāvagga 2.376) pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘dakkhiṇodakaṃ pamāṇa"
      },
      "nti ettakāni cīvarāni dassāmīti paṭhamaṃ udakaṃ pātetvā pacchā denti, taṃ yehi gahitaṃ, te bhāginova hontīti adhippāyo’’ti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Parasamudde"
      },
      "ti jambudīpe. Tambapaṇṇidīpañhi upādāyesa evaṃ vutto."
    ],
    "innerText": "208. Sacepi sahassaṃ agghati, gilānupaṭṭhākānaññeva dātabbanti sambandho. Aññanti ticīvarapattato aññaṃ. Appagghanti atijiṇṇādibhāvena nihīnaṃ. Tatoti avasesaparikkhārato. Sabbanti pattaṃ cīvarañca. Tattha tattha saṅghassevāti tasmiṃ tasmiṃ vihāre saṅghasseva. Bhikkhuno kālakataṭṭhānaṃ sandhāya ‘‘idhā’’ti vattabbe ‘‘tatthā’’ti vuttattā vicchāvacanattā ca parikkhārassa ṭhapitaṭṭhānaṃ vuttanti viññāyati. Pāḷiyaṃ avissajjikaṃ avebhaṅgikanti āgatānāgatassa cātuddisassa saṅghasseva santakaṃ hutvā kassaci avissajjikaṃ avebhaṅgikañca bhavituṃ anujānāmīti attho. ‘‘Sante patirūpe gāhake’’ti vuttattā gāhake asati adatvā bhājitepi subhājitamevāti daṭṭhabbaṃ. Dakkhiṇodakaṃ pamāṇanti ettha sāratthadīpaniyaṃ (sārattha. ṭī. mahāvagga 3.376) tāva ‘‘yattha pana dakkhiṇodakaṃ pamāṇanti bhikkhū yasmiṃ raṭṭhe dakkhiṇodakapaṭiggahaṇamattenapi deyyadhammassa sāmino hontīti adhippāyo’’ti vuttaṃ. Vimativinodaniyaṃ (vi. vi. ṭī. mahāvagga 2.376) pana ‘‘dakkhiṇodakaṃ pamāṇanti ettakāni cīvarāni dassāmīti paṭhamaṃ udakaṃ pātetvā pacchā denti, taṃ yehi gahitaṃ, te bhāginova hontīti adhippāyo’’ti vuttaṃ. Parasamuddeti jambudīpe. Tambapaṇṇidīpañhi upādāyesa evaṃ vutto."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Matakacīvaraṃ adhiṭṭhātī’’ti ettha maggaṃ gacchanto tassa kālakiriyaṃ sutvā avihāraṭṭhāne ce dvādasahatthabbhantare aññesaṃ bhikkhūnaṃ abhāvaṃ ñatvā ‘‘idaṃ cīvaraṃ mayhaṃ pāpuṇātī’’ti adhiṭṭhāti, svādhiṭṭhitaṃ. Tena kho pana samayena aññataro bhikkhu bahubhaṇḍo bahuparikkhāro kālakato hoti. Bhagavato etamatthaṃ ārocesuṃ, ‘‘bhikkhussa, bhikkhave, kālakate saṅgho sāmī pattacīvare. Apica gilānupaṭṭhākā bahupakārā, anujānāmi, bhikkhave, ticīvarañca pattañca gilānupaṭṭhākānaṃ dātuṃ. Yaṃ tattha lahubhaṇḍaṃ lahuparikkhāraṃ, taṃ sammukhībhūtena saṅghena bhājetuṃ. Yaṃ tattha garubhaṇḍaṃ garuparikkhāraṃ, taṃ āgatānāgatassa cātuddisassa ",
      " saṅghassa avissajjikaṃ avebhaṅgika’’nti (mahāva. 369) iminā pāṭhena bhagavā sabbaññū bhikkhūnaṃ āmisadāyajjaṃ vicāresi."
    ],
    "innerText": "‘‘Matakacīvaraṃ adhiṭṭhātī’’ti ettha maggaṃ gacchanto tassa kālakiriyaṃ sutvā avihāraṭṭhāne ce dvādasahatthabbhantare aññesaṃ bhikkhūnaṃ abhāvaṃ ñatvā ‘‘idaṃ cīvaraṃ mayhaṃ pāpuṇātī’’ti adhiṭṭhāti, svādhiṭṭhitaṃ. Tena kho pana samayena aññataro bhikkhu bahubhaṇḍo bahuparikkhāro kālakato hoti. Bhagavato etamatthaṃ ārocesuṃ, ‘‘bhikkhussa, bhikkhave, kālakate saṅgho sāmī pattacīvare. Apica gilānupaṭṭhākā bahupakārā, anujānāmi, bhikkhave, ticīvarañca pattañca gilānupaṭṭhākānaṃ dātuṃ. Yaṃ tattha lahubhaṇḍaṃ lahuparikkhāraṃ, taṃ sammukhībhūtena saṅghena bhājetuṃ. Yaṃ tattha garubhaṇḍaṃ garuparikkhāraṃ, taṃ āgatānāgatassa cātuddisassa saṅghassa avissajjikaṃ avebhaṅgika’’nti (mahāva. 369) iminā pāṭhena bhagavā sabbaññū bhikkhūnaṃ āmisadāyajjaṃ vicāresi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      " ticīvarapattaavasesalahubhaṇḍagarubhaṇḍavasena āmisadāyajjaṃ tividhaṃ hoti. Tesu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ticīvarapattaṃ"
      },
      " gilānupaṭṭhākassa bhāgo hoti, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "avasesalahubhaṇḍaṃ"
      },
      " sammukhībhūtasaṅghassa, pañcavīsatividha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "garubhaṇḍaṃ"
      },
      " cātuddisasaṅghassa. Iminā ito tividhabhaṇḍato aññaṃ bhikkhubhaṇḍaṃ nāma natthi, imehi tividhehi puggalehi añño dāyādo nāma natthīti dasseti. Idāni pana vinayadharā ‘‘bhikkhūnaṃ akappiyabhaṇḍaṃ gihibhūtā ñātakā labhantī’’ti vadanti, taṃ kasmāti ce? ‘‘Ye tassa dhane issarā gahaṭṭhā vā pabbajitā vā, tesaṃ dātabba’’nti aṭṭhakathāyaṃ āgatattāti. Saccaṃ āgato, so pana pāṭho vissāsaggāhavisaye āgato, na dāyajjagahaṇaṭṭhāne. ‘‘Gahaṭṭhā vā pabbajitā vā’’icceva āgato, na ‘‘ñātakā aññātakā vā’’ti, tasmā ñātakā vā hontu aññātakā vā, ye taṃ gilānaṃ upaṭṭhahanti, te gilānupaṭṭhākabhāgabhūtassa dhanassa issarā gahaṭṭhapabbajitā, antamaso mātugāmāpi. Te sandhāya ‘‘tesaṃ dātabba’’nti vuttaṃ, na pana ye gilānaṃ nupaṭṭhahanti, te sandhāya. Vuttañhi aṭṭhakathāyaṃ (mahāva. aṭṭha. 369) ‘‘gilānupaṭṭhāko nāma gihī vā hotu pabbajito vā, antamaso mātugāmopi, sabbe bhāgaṃ labhantī’’ti."
    ],
    "innerText": "Tattha ticīvarapattaavasesalahubhaṇḍagarubhaṇḍavasena āmisadāyajjaṃ tividhaṃ hoti. Tesu ticīvarapattaṃ gilānupaṭṭhākassa bhāgo hoti, avasesalahubhaṇḍaṃ sammukhībhūtasaṅghassa, pañcavīsatividha garubhaṇḍaṃ cātuddisasaṅghassa. Iminā ito tividhabhaṇḍato aññaṃ bhikkhubhaṇḍaṃ nāma natthi, imehi tividhehi puggalehi añño dāyādo nāma natthīti dasseti. Idāni pana vinayadharā ‘‘bhikkhūnaṃ akappiyabhaṇḍaṃ gihibhūtā ñātakā labhantī’’ti vadanti, taṃ kasmāti ce? ‘‘Ye tassa dhane issarā gahaṭṭhā vā pabbajitā vā, tesaṃ dātabba’’nti aṭṭhakathāyaṃ āgatattāti. Saccaṃ āgato, so pana pāṭho vissāsaggāhavisaye āgato, na dāyajjagahaṇaṭṭhāne. ‘‘Gahaṭṭhā vā pabbajitā vā’’icceva āgato, na ‘‘ñātakā aññātakā vā’’ti, tasmā ñātakā vā hontu aññātakā vā, ye taṃ gilānaṃ upaṭṭhahanti, te gilānupaṭṭhākabhāgabhūtassa dhanassa issarā gahaṭṭhapabbajitā, antamaso mātugāmāpi. Te sandhāya ‘‘tesaṃ dātabba’’nti vuttaṃ, na pana ye gilānaṃ nupaṭṭhahanti, te sandhāya. Vuttañhi aṭṭhakathāyaṃ (mahāva. aṭṭha. 369) ‘‘gilānupaṭṭhāko nāma gihī vā hotu pabbajito vā, antamaso mātugāmopi, sabbe bhāgaṃ labhantī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha vā yo bhikkhu attano jīvamānakāleyeva sabbaṃ attano parikkhāraṃ nissajjitvā kassaci ñātakassa vā aññātakassa vā gahaṭṭhassa vā pabbajitassa vā adāsi, koci ca ñātako vā aññātako vā gahaṭṭho vā pabbajito vā vissāsaṃ aggahesi, tādise sandhāya ‘‘ye tassa dhanassa issarā gahaṭṭhā vā pabbajitā vā, tesaṃ dātabba’’nti ",
      " vuttaṃ, na pana atādise ñātake. Vuttañhi aṭṭhakathāyaṃ (mahāva. aṭṭha. 369) ‘‘sace pana so jīvamānoyeva sabbaṃ attano parikkhāraṃ nissajjitvā kassaci adāsi, koci vā vissāsaṃ aggahesi, yassa dinnaṃ, yena ca gahitaṃ, tasseva hoti, tassa ruciyā eva gilānupaṭṭhākā labhantī’’ti. Evaṃ hotu, kappiyabhaṇḍe pana kathanti? Tampi ‘‘gihiñātakānaṃ dātabba’’nti pāḷiyaṃ vā aṭṭhakathāyaṃ vā ṭīkāsu vā natthi, tasmā vicāretabbametaṃ."
    ],
    "innerText": "Atha vā yo bhikkhu attano jīvamānakāleyeva sabbaṃ attano parikkhāraṃ nissajjitvā kassaci ñātakassa vā aññātakassa vā gahaṭṭhassa vā pabbajitassa vā adāsi, koci ca ñātako vā aññātako vā gahaṭṭho vā pabbajito vā vissāsaṃ aggahesi, tādise sandhāya ‘‘ye tassa dhanassa issarā gahaṭṭhā vā pabbajitā vā, tesaṃ dātabba’’nti vuttaṃ, na pana atādise ñātake. Vuttañhi aṭṭhakathāyaṃ (mahāva. aṭṭha. 369) ‘‘sace pana so jīvamānoyeva sabbaṃ attano parikkhāraṃ nissajjitvā kassaci adāsi, koci vā vissāsaṃ aggahesi, yassa dinnaṃ, yena ca gahitaṃ, tasseva hoti, tassa ruciyā eva gilānupaṭṭhākā labhantī’’ti. Evaṃ hotu, kappiyabhaṇḍe pana kathanti? Tampi ‘‘gihiñātakānaṃ dātabba’’nti pāḷiyaṃ vā aṭṭhakathāyaṃ vā ṭīkāsu vā natthi, tasmā vicāretabbametaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Cīvarabhājanakathāvaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Piṇḍapātabhājanakathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "209"
      },
      ". Idāni ",
      " piṇḍapātabhājanavinicchayaṃ kathetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘piṇḍapātabhājane panā’’"
      },
      "tiādimāha. Tattha senāsanakkhandhake senāsanabhājaneyeva paṭhamaṃ āgatepi catupaccayabhājanavinicchayattā paccayānukkamena piṇḍapātabhājanaṃ paṭhamaṃ dasseti. Piṇḍapātabhājane pana saṅghabhattādīsu ayaṃ vinicchayoti sambandho. Kathaṃ etāni saṅghabhattādīni bhagavatā anuññātānīti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘anujānāmi…pe… anuññātesū’’"
      },
      "ti. Saṅghassa atthāya ābhataṃ bhattaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṅghabhattaṃ"
      },
      " yathā ‘‘āgantukassa ābhataṃ bhattaṃ āgantukabhatta’’nti. Saṅghato uddissa uddisitvā dātabbaṃ bhattaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uddesabhattaṃ"
      },
      ". Nimantetvā dātabbaṃ bhattaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nimantanabhattaṃ"
      },
      ". Salākaṃ pātetvā gāhetabbaṃ bhattaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "salākabhattaṃ"
      },
      ". Pakkhe pakkhadivase dātabbaṃ bhattaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pakkhabhattaṃ"
      },
      ". Uposathe uposathadivase dātabbaṃ bhattaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uposathabhattaṃ"
      },
      ". Pāṭipade uposathadivasato dutiyadivase dātabbaṃ bhattaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pāṭipadabhatta"
      },
      "nti viggaho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ṭhitikā nāma natthī"
      },
      "ti saṅghattherato paṭṭhāya vassaggena gāhaṇaṃ ṭhitikā nāma."
    ],
    "innerText": "209. Idāni piṇḍapātabhājanavinicchayaṃ kathetuṃ ‘‘piṇḍapātabhājane panā’’tiādimāha. Tattha senāsanakkhandhake senāsanabhājaneyeva paṭhamaṃ āgatepi catupaccayabhājanavinicchayattā paccayānukkamena piṇḍapātabhājanaṃ paṭhamaṃ dasseti. Piṇḍapātabhājane pana saṅghabhattādīsu ayaṃ vinicchayoti sambandho. Kathaṃ etāni saṅghabhattādīni bhagavatā anuññātānīti āha ‘‘anujānāmi…pe… anuññātesū’’ti. Saṅghassa atthāya ābhataṃ bhattaṃ saṅghabhattaṃ yathā ‘‘āgantukassa ābhataṃ bhattaṃ āgantukabhatta’’nti. Saṅghato uddissa uddisitvā dātabbaṃ bhattaṃ uddesabhattaṃ. Nimantetvā dātabbaṃ bhattaṃ nimantanabhattaṃ. Salākaṃ pātetvā gāhetabbaṃ bhattaṃ salākabhattaṃ. Pakkhe pakkhadivase dātabbaṃ bhattaṃ pakkhabhattaṃ. Uposathe uposathadivase dātabbaṃ bhattaṃ uposathabhattaṃ. Pāṭipade uposathadivasato dutiyadivase dātabbaṃ bhattaṃ pāṭipadabhattanti viggaho. Ṭhitikā nāma natthīti saṅghattherato paṭṭhāya vassaggena gāhaṇaṃ ṭhitikā nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Attano"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vihāradvāre"
      },
      "ti vihārassa dvārakoṭṭhakasamīpaṃ sandhāya vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhojanasālāyā"
      },
      "ti bhattuddesaṭṭhānabhūtāya bhojanasālāyaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vassaggenā"
      },
      "ti vassakoṭṭhāsena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dinnaṃ panā"
      },
      "ti vatvā yathā so dāyako vadati, taṃ vidhiṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘saṅghato bhante’’"
      },
      "tiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Antaraghare"
      },
      "ti antogehe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Antoupacāragatāna"
      },
      "nti ettha gāmadvāravīthicatukkesu dvādasahatthabbhantaraṃ upacāro nāma."
    ],
    "innerText": "Attanovihāradvāreti vihārassa dvārakoṭṭhakasamīpaṃ sandhāya vuttaṃ. Bhojanasālāyāti bhattuddesaṭṭhānabhūtāya bhojanasālāyaṃ. Vassaggenāti vassakoṭṭhāsena. Dinnaṃ panāti vatvā yathā so dāyako vadati, taṃ vidhiṃ dassetuṃ ‘‘saṅghato bhante’’tiādimāha. Antaraghareti antogehe. Antoupacāragatānanti ettha gāmadvāravīthicatukkesu dvādasahatthabbhantaraṃ upacāro nāma."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Antaragharassa upacāre pana labbhamānavisesaṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘gharūpacāro cetthā’’"
      },
      "tiādimāha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekavaḷañja"
      },
      "nti ekena dvārena vaḷañjitabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nānānivesanesū"
      },
      "ti nānākulassa nānūpacāresu nivesanesu. Lajjī pesalo agatigamanaṃ vajjetvā medhāvī ca upaparikkhitvā uddisatīti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘pesalo lajjī medhāvī icchitabbo’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nisinnassapi niddāyantassapī"
      },
      "ti anādare sāmivacanaṃ, vuḍḍhatare niddāyante navakassa gāhitaṃ suggāhitanti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ticīvaraparivāraṃ vā"
      },
      "ti ettha ‘‘udakamattalābhī viya aññopi uddesabhattaṃ alabhitvā vatthādianekappakārakaṃ labhati ce, tasseva ta’’nti gaṇṭhipadesu vuttaṃ. Attano rucivasena yaṃ kiñci vatvā āharituṃ vissajjitattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vissaṭṭhadūto"
      },
      " nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yaṃ icchatī"
      },
      "ti ‘‘uddesabhattaṃ dethā’’tiādīni vadanto yaṃ icchati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pucchāsabhāgenā"
      },
      "ti pucchāsadisena."
    ],
    "innerText": "Antaragharassa upacāre pana labbhamānavisesaṃ dassetuṃ ‘‘gharūpacāro cetthā’’tiādimāha. Ekavaḷañjanti ekena dvārena vaḷañjitabbaṃ. Nānānivesanesūti nānākulassa nānūpacāresu nivesanesu. Lajjī pesalo agatigamanaṃ vajjetvā medhāvī ca upaparikkhitvā uddisatīti āha ‘‘pesalo lajjī medhāvī icchitabbo’’ti. Nisinnassapi niddāyantassapīti anādare sāmivacanaṃ, vuḍḍhatare niddāyante navakassa gāhitaṃ suggāhitanti attho. Ticīvaraparivāraṃ vāti ettha ‘‘udakamattalābhī viya aññopi uddesabhattaṃ alabhitvā vatthādianekappakārakaṃ labhati ce, tasseva ta’’nti gaṇṭhipadesu vuttaṃ. Attano rucivasena yaṃ kiñci vatvā āharituṃ vissajjitattā vissaṭṭhadūto nāma. Yaṃ icchatīti ‘‘uddesabhattaṃ dethā’’tiādīni vadanto yaṃ icchati. Pucchāsabhāgenāti pucchāsadisena."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Ekā"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kūṭaṭṭhitikā nāma hotī’’"
      },
      "ti vatvā tameva ṭhitikaṃ vibhāvento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘rañño vā hī’’"
      },
      "tiādimāha. Aññehi uddesabhattādīhi amissetvā visuṃyeva ṭhitikāya gahetabbattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ekacārikabhattānī’’"
      },
      "ti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Theyyāya harantī"
      },
      "ti pattahārakā haranti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gīvā hotī"
      },
      "ti āṇāpakassa gīvā hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbaṃ pattassāmikassa hotī"
      },
      "ti cīvarādikampi sabbaṃ pattassāmikasseva hoti, ‘‘mayā ",
      " bhattameva sandhāya vuttaṃ, na cīvarādi’’nti vatvā gahetuṃ vaṭṭatīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Manussānaṃ vacanaṃ kātuṃ vaṭṭatīti vuttā gacchantī"
      },
      "ti manussānaṃ vacanaṃ kātuṃ vaṭṭatīti tena bhikkhunā vuttā gacchanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akatabhāgo nāmā"
      },
      "ti āgantukabhāgo nāma, adinnapubbabhāgoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sabbo saṅgho paribhūñjatūti vutte"
      },
      "ti ettha ‘‘paṭhamameva ‘sabbasaṅghikabhattaṃ dethā’ti vatvā pacchā ‘sabbo saṅgho paribhuñjatū’ti avuttepi bhājetvā paribhuñjitabba’’nti gaṇṭhipadesu vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kiṃ āharīyatīti avatvā"
      },
      "ti ‘‘katarabhattaṃ tayā āharīyatī’’ti dāyakaṃ apucchitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pakatiṭhitikāyā"
      },
      "ti uddesabhattaṭhitikāya."
    ],
    "innerText": "‘‘Ekākūṭaṭṭhitikā nāma hotī’’ti vatvā tameva ṭhitikaṃ vibhāvento ‘‘rañño vā hī’’tiādimāha. Aññehi uddesabhattādīhi amissetvā visuṃyeva ṭhitikāya gahetabbattā ‘‘ekacārikabhattānī’’ti vuttaṃ. Theyyāya harantīti pattahārakā haranti. Gīvā hotīti āṇāpakassa gīvā hoti. Sabbaṃ pattassāmikassa hotīti cīvarādikampi sabbaṃ pattassāmikasseva hoti, ‘‘mayā bhattameva sandhāya vuttaṃ, na cīvarādi’’nti vatvā gahetuṃ vaṭṭatīti attho. Manussānaṃ vacanaṃ kātuṃ vaṭṭatīti vuttā gacchantīti manussānaṃ vacanaṃ kātuṃ vaṭṭatīti tena bhikkhunā vuttā gacchanti. Akatabhāgo nāmāti āgantukabhāgo nāma, adinnapubbabhāgoti attho. Sabbo saṅgho paribhūñjatūti vutteti ettha ‘‘paṭhamameva ‘sabbasaṅghikabhattaṃ dethā’ti vatvā pacchā ‘sabbo saṅgho paribhuñjatū’ti avuttepi bhājetvā paribhuñjitabba’’nti gaṇṭhipadesu vuttaṃ. Kiṃ āharīyatīti avatvāti ‘‘katarabhattaṃ tayā āharīyatī’’ti dāyakaṃ apucchitvā. Pakatiṭhitikāyāti uddesabhattaṭhitikāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Piṇḍapātabhājanakathāvaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Nimantanabhattakathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "210"
      },
      ". ‘‘Ettake bhikkhū saṅghato uddisitvā dethā’’tiādīni avatvā ‘‘ettakānaṃ bhikkhūnaṃ bhattaṃ dethā’’ti vatvā dinnaṃ saṅghikaṃ nimantanaṃ nāma. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Piṇḍapātikānampi vaṭṭatī"
      },
      "ti bhikkhāpariyāyena vuttattā vaṭṭati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭipāṭiyā"
      },
      "ti laddhapaṭipāṭiyā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vicchinditvā"
      },
      "ti ‘‘bhattaṃ gaṇhathā’’ti padaṃ avatvā. Tenevāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘bhattanti avadantenā’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ālopasaṅkhepenā"
      },
      "ti ekekapiṇḍavasena. Ayañca nayo nimantaneyeva, na uddesabhatte. Tassa hi ekassa pahonakappamāṇaṃyeva bhājetabbaṃ, tasmā uddesabhatte ālopaṭṭhitikā nāma natthi."
    ],
    "innerText": "210. ‘‘Ettake bhikkhū saṅghato uddisitvā dethā’’tiādīni avatvā ‘‘ettakānaṃ bhikkhūnaṃ bhattaṃ dethā’’ti vatvā dinnaṃ saṅghikaṃ nimantanaṃ nāma. Piṇḍapātikānampi vaṭṭatīti bhikkhāpariyāyena vuttattā vaṭṭati. Paṭipāṭiyāti laddhapaṭipāṭiyā. Vicchinditvāti ‘‘bhattaṃ gaṇhathā’’ti padaṃ avatvā. Tenevāha ‘‘bhattanti avadantenā’’ti. Ālopasaṅkhepenāti ekekapiṇḍavasena. Ayañca nayo nimantaneyeva, na uddesabhatte. Tassa hi ekassa pahonakappamāṇaṃyeva bhājetabbaṃ, tasmā uddesabhatte ālopaṭṭhitikā nāma natthi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āruḷhāyeva mātikaṃ. Saṅghato aṭṭha bhikkhū"
      },
      "ti ettha ye mātikaṃ āruḷhā, te aṭṭha bhikkhūti yojetabbaṃ. Uddesabhattanimantanabhattādisaṅghikabhattamātikāsu nimantanabhattamātikāya ṭhitikāvasena āruḷhe bhattuddesakena vā sayaṃ vā saṅghato uddisāpetvā gahetvā gantabbaṃ, na attanā ",
      " rucite gahetvāti adhippāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mātikaṃ āropetvā"
      },
      "ti ‘‘saṅghato gaṇhāmī’’tiādinā vuttamātikābhedaṃ dāyakassa viññāpetvāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Ekavāra"
      },
      "nti yāva tasmiṃ āvāse vasanti bhikkhū ",
      ", sabbe labhantī’’ti gaṇṭhipadesu vuttaṃ. Ayaṃ panettha adhippāyo – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ekavāra"
      },
      "nti na ekadivasaṃ sandhāya vuttaṃ, yattakā pana bhikkhū tasmiṃ āvāse vasanti, te sabbe. Ekasmiṃ divase gahitabhikkhū aññadā aggahetvā yāva ekavāraṃ sabbe bhikkhū bhojitā hontīti jānāti ce, ye jānanti, te gahetvā gantabbanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭibaddhakālato paṭṭhāyā"
      },
      "ti tattheva vāsassa nibaddhakālato paṭṭhāya."
    ],
    "innerText": "Āruḷhāyeva mātikaṃ. Saṅghato aṭṭha bhikkhūti ettha ye mātikaṃ āruḷhā, te aṭṭha bhikkhūti yojetabbaṃ. Uddesabhattanimantanabhattādisaṅghikabhattamātikāsu nimantanabhattamātikāya ṭhitikāvasena āruḷhe bhattuddesakena vā sayaṃ vā saṅghato uddisāpetvā gahetvā gantabbaṃ, na attanā rucite gahetvāti adhippāyo. Mātikaṃ āropetvāti ‘‘saṅghato gaṇhāmī’’tiādinā vuttamātikābhedaṃ dāyakassa viññāpetvāti attho. ‘‘Ekavāranti yāva tasmiṃ āvāse vasanti bhikkhū , sabbe labhantī’’ti gaṇṭhipadesu vuttaṃ. Ayaṃ panettha adhippāyo – ekavāranti na ekadivasaṃ sandhāya vuttaṃ, yattakā pana bhikkhū tasmiṃ āvāse vasanti, te sabbe. Ekasmiṃ divase gahitabhikkhū aññadā aggahetvā yāva ekavāraṃ sabbe bhikkhū bhojitā hontīti jānāti ce, ye jānanti, te gahetvā gantabbanti. Paṭibaddhakālato paṭṭhāyāti tattheva vāsassa nibaddhakālato paṭṭhāya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Nimantanabhattakathāvaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Salākabhattakathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "211"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upanibandhitvā"
      },
      "ti likhitvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gāmavasenapī"
      },
      "ti yebhuyyena samalābhagāmavasenapi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bahūni salākabhattānī"
      },
      "ti tiṃsaṃ vā cattārīsaṃ vā bhattāni. Sace hontīti ajjhāharitvā yojetabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sallakkhetvā"
      },
      "ti tāni bhattāni pamāṇavasena sallakkhetvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Niggahena datvā"
      },
      "ti dūraṃ gantuṃ anicchantassa niggahena sampaṭicchāpetvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puna vihāraṃ āgantvā"
      },
      "ti ettha vihāraṃ anāgantvā bhattaṃ gahetvā pacchā vihāre attano pāpetvā bhuñjitumpi vaṭṭati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekagehavasenā"
      },
      "ti vīthiyampi ekapasse gharapāḷiyā vasena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Uddisitvāpī"
      },
      "ti ‘‘asukakule salākabhattāni tuyhaṃ pāpuṇantī’’ti vatvā."
    ],
    "innerText": "211.Upanibandhitvāti likhitvā. Gāmavasenapīti yebhuyyena samalābhagāmavasenapi. Bahūni salākabhattānīti tiṃsaṃ vā cattārīsaṃ vā bhattāni. Sace hontīti ajjhāharitvā yojetabbaṃ. Sallakkhetvāti tāni bhattāni pamāṇavasena sallakkhetvā. Niggahena datvāti dūraṃ gantuṃ anicchantassa niggahena sampaṭicchāpetvā. Puna vihāraṃ āgantvāti ettha vihāraṃ anāgantvā bhattaṃ gahetvā pacchā vihāre attano pāpetvā bhuñjitumpi vaṭṭati. Ekagehavasenāti vīthiyampi ekapasse gharapāḷiyā vasena. Uddisitvāpīti ‘‘asukakule salākabhattāni tuyhaṃ pāpuṇantī’’ti vatvā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "212"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vāragāme"
      },
      "ti atidūrattā vārena gantabbagāme. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṭṭhito vā paṇṇāsato vā"
      },
      "ti daṇḍakammatthāya udakaghaṭaṃ sandhāya vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vihāravāro"
      },
      "ti sabbabhikkhūsu bhikkhāya ",
      " gatesu vihārarakkhaṇavāro. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nesa"
      },
      "nti vihāravārikānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Phātikammamevā"
      },
      "ti vihārarakkhaṇakiccassa pahonakapaṭipādanameva. Dūrattā niggahetvāpi vārena gahetabbo gāmo ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vāragāmo"
      },
      ". Vihāravāre niyuttā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vihāravārikā,"
      },
      " vārena vihārarakkhaṇakā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aññathatta"
      },
      "nti pasādaññathattaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Phātikammameva bhavantī"
      },
      "ti vihārarakkhaṇatthāya saṅghena dātabbā atirekalābhā honti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekasseva pāpuṇantī"
      },
      "ti divase divase ekekasseva pāpitānīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅghanavakena laddhakāle"
      },
      "ti divase divase ekekassa pāpitāni dve tīṇi ekacārikabhattāni teneva niyāmena attano pāpuṇanaṭṭhāne saṅghanavakena laddhakāle."
    ],
    "innerText": "212.Vāragāmeti atidūrattā vārena gantabbagāme. Saṭṭhito vā paṇṇāsato vāti daṇḍakammatthāya udakaghaṭaṃ sandhāya vuttaṃ. Vihāravāroti sabbabhikkhūsu bhikkhāya gatesu vihārarakkhaṇavāro. Nesanti vihāravārikānaṃ. Phātikammamevāti vihārarakkhaṇakiccassa pahonakapaṭipādanameva. Dūrattā niggahetvāpi vārena gahetabbo gāmo vāragāmo. Vihāravāre niyuttā vihāravārikā, vārena vihārarakkhaṇakā. Aññathattanti pasādaññathattaṃ. Phātikammameva bhavantīti vihārarakkhaṇatthāya saṅghena dātabbā atirekalābhā honti. Ekasseva pāpuṇantīti divase divase ekekasseva pāpitānīti attho. Saṅghanavakena laddhakāleti divase divase ekekassa pāpitāni dve tīṇi ekacārikabhattāni teneva niyāmena attano pāpuṇanaṭṭhāne saṅghanavakena laddhakāle."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yassa"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kassaci sammukhībhūtassa pāpetvā"
      },
      "ti ettha ‘‘yebhuyyena ce bhikkhū bahisīmagatā honti, sammukhībhūtassa yassa kassaci pāpetabbaṃ sabhāgattā ekena laddhaṃ sabbesaṃ hoti, tasmimpi asati attano pāpetvā dātabba’’nti gaṇṭhipadesu vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Rasasalāka"
      },
      "nti ucchurasasalākaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Salākavasena pana gāhitattā na sāditabbā"
      },
      "ti idaṃ asāruppavasena vuttaṃ, na dhutaṅgabhedavasena. ‘‘Saṅghato nirāmisasalākā…pe… vaṭṭatiyevā’’ti hi visuddhimagge (visuddhi. 1.26) vuttaṃ. Sāratthadīpaniyampi (sārattha. ṭī. cūḷavagga 3.325) – saṅghato nirāmisasalākāpi vihāre pakkabhattampi vaṭṭatiyevāti sādhāraṇaṃ katvā visuddhimagge (visuddhi. 1.26) vuttattā, ‘‘evaṃ gāhite sāditabbaṃ, evaṃ na sāditabba’’nti visesetvā avuttattā ca ‘‘bhesajjādisalākāyo cettha kiñcāpi piṇḍapātikānampi vaṭṭanti, salākavasena pana gāhitattā na sāditabbā’’ti ettha adhippāyo vīmaṃsitabbo. Yadi hi bhesajjādisalākā salākavasena gāhitā na sāditabbā siyā, ‘‘saṅghato nirāmisasalākā vaṭṭatiyevā’’ti ",
      " na vadeyya, ‘‘atirekalābho saṅghabhattaṃ uddesabhatta’’ntiādivacanato (mahāva. 128) ca ‘‘atirekalābhaṃ paṭikkhipāmī’’ti salākavasena gāhetabbaṃ bhattameva paṭikkhittaṃ, na bhesajjaṃ. Saṅghabhattādīni hi cuddasa bhattāniyeva tena na sāditabbānīti vuttāni. Khandhakabhāṇakānaṃ vā matena idha evaṃ vuttanti gahetabbanti vuttaṃ. Aggato dātabbā bhikkhā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aggabhikkhā. Aggabhikkhāmatta"
      },
      "nti ekakaṭacchubhikkhāmattaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Laddhā vā aladdhā vā svepi gaṇheyyāsī"
      },
      "ti laddhepi appamattatāya vuttaṃ. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yāvadatthaṃ labhati…pe… alabhitvā sve gaṇheyyāsīti vattabbo’’"
      },
      "ti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aggabhikkhamatta"
      },
      "nti hi ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "matta"
      },
      "-saddo bahubhāvaṃ nivatteti."
    ],
    "innerText": "Yassakassaci sammukhībhūtassa pāpetvāti ettha ‘‘yebhuyyena ce bhikkhū bahisīmagatā honti, sammukhībhūtassa yassa kassaci pāpetabbaṃ sabhāgattā ekena laddhaṃ sabbesaṃ hoti, tasmimpi asati attano pāpetvā dātabba’’nti gaṇṭhipadesu vuttaṃ. Rasasalākanti ucchurasasalākaṃ. Salākavasena pana gāhitattā na sāditabbāti idaṃ asāruppavasena vuttaṃ, na dhutaṅgabhedavasena. ‘‘Saṅghato nirāmisasalākā…pe… vaṭṭatiyevā’’ti hi visuddhimagge (visuddhi. 1.26) vuttaṃ. Sāratthadīpaniyampi (sārattha. ṭī. cūḷavagga 3.325) – saṅghato nirāmisasalākāpi vihāre pakkabhattampi vaṭṭatiyevāti sādhāraṇaṃ katvā visuddhimagge (visuddhi. 1.26) vuttattā, ‘‘evaṃ gāhite sāditabbaṃ, evaṃ na sāditabba’’nti visesetvā avuttattā ca ‘‘bhesajjādisalākāyo cettha kiñcāpi piṇḍapātikānampi vaṭṭanti, salākavasena pana gāhitattā na sāditabbā’’ti ettha adhippāyo vīmaṃsitabbo. Yadi hi bhesajjādisalākā salākavasena gāhitā na sāditabbā siyā, ‘‘saṅghato nirāmisasalākā vaṭṭatiyevā’’ti na vadeyya, ‘‘atirekalābho saṅghabhattaṃ uddesabhatta’’ntiādivacanato (mahāva. 128) ca ‘‘atirekalābhaṃ paṭikkhipāmī’’ti salākavasena gāhetabbaṃ bhattameva paṭikkhittaṃ, na bhesajjaṃ. Saṅghabhattādīni hi cuddasa bhattāniyeva tena na sāditabbānīti vuttāni. Khandhakabhāṇakānaṃ vā matena idha evaṃ vuttanti gahetabbanti vuttaṃ. Aggato dātabbā bhikkhā aggabhikkhā. Aggabhikkhāmattanti ekakaṭacchubhikkhāmattaṃ. Laddhā vā aladdhā vā svepi gaṇheyyāsīti laddhepi appamattatāya vuttaṃ. Tenāha ‘‘yāvadatthaṃ labhati…pe… alabhitvā sve gaṇheyyāsīti vattabbo’’ti. Aggabhikkhamattanti hi ettha matta-saddo bahubhāvaṃ nivatteti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Salākabhattaṃ nāma vihāreyeva uddisīyati vihārameva sandhāya dīyamānattāti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘vihāre apāpitaṃ panā’’"
      },
      "tiādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatra āsanasālāyā"
      },
      "ti tasmiṃ gāme āsanasālāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vihāraṃ ānetvā gāhetabba"
      },
      "nti tathā vatvā tasmiṃ divase dinnabhattaṃ vihārameva ānetvā ṭhitikāya gāhetabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatthā"
      },
      "ti tasmiṃ disābhāge. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṃ gahetvā"
      },
      "ti taṃ vāragāmasalākaṃ attanā gahetvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tenā"
      },
      "ti yo attano pattavāragāme salākaṃ disāgamikassa adāsi, tena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anatikkamanteyeva tasmiṃ tassa salākā gāhetabbā"
      },
      "ti yasmā upacārasīmaṭṭhasseva salākā pāpuṇāti, tasmā tasmiṃ disaṃgamike upacārasīmaṃ anatikkanteyeva tassa disaṃgamikassa pattasalākā attano pāpetvā gāhetabbā."
    ],
    "innerText": "Salākabhattaṃ nāma vihāreyeva uddisīyati vihārameva sandhāya dīyamānattāti āha ‘‘vihāre apāpitaṃ panā’’tiādi. Tatra āsanasālāyāti tasmiṃ gāme āsanasālāya. Vihāraṃ ānetvā gāhetabbanti tathā vatvā tasmiṃ divase dinnabhattaṃ vihārameva ānetvā ṭhitikāya gāhetabbaṃ. Tatthāti tasmiṃ disābhāge. Taṃ gahetvāti taṃ vāragāmasalākaṃ attanā gahetvā. Tenāti yo attano pattavāragāme salākaṃ disāgamikassa adāsi, tena. Anatikkamanteyeva tasmiṃ tassa salākā gāhetabbāti yasmā upacārasīmaṭṭhasseva salākā pāpuṇāti, tasmā tasmiṃ disaṃgamike upacārasīmaṃ anatikkanteyeva tassa disaṃgamikassa pattasalākā attano pāpetvā gāhetabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Devasikaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pāpetabbā"
      },
      "ti upacārasīmāyaṃ ṭhitassa yassa kassaci vassaggena pāpetabbā. Evaṃ etesu anāgatesu āsannavihāre bhikkhūnaṃ bhuñjituṃ vaṭṭati, itarathā saṅghikaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anāgatadivase"
      },
      "ti ettha kathaṃ tesaṃ bhikkhūnaṃ āgatānāgatabhāvo ",
      " viññāyatīti ce? Yasmā tato tato āgatā bhikkhū tasmiṃ gāme āsanasālāya sannipatanti, tasmā tesaṃ āgatānāgatabhāvo sakkā viññātuṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Amhākaṃ gocaragāme"
      },
      "ti salākabhattadāyakānaṃ gāme. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhuñjituṃ āgacchantī"
      },
      "ti ‘‘mahāthero ekakova vihāre ohīno avassaṃ sabbasalākā attano pāpetvā ṭhito’’ti maññamānā āgacchanti."
    ],
    "innerText": "Devasikaṃpāpetabbāti upacārasīmāyaṃ ṭhitassa yassa kassaci vassaggena pāpetabbā. Evaṃ etesu anāgatesu āsannavihāre bhikkhūnaṃ bhuñjituṃ vaṭṭati, itarathā saṅghikaṃ hoti. Anāgatadivaseti ettha kathaṃ tesaṃ bhikkhūnaṃ āgatānāgatabhāvo viññāyatīti ce? Yasmā tato tato āgatā bhikkhū tasmiṃ gāme āsanasālāya sannipatanti, tasmā tesaṃ āgatānāgatabhāvo sakkā viññātuṃ. Amhākaṃ gocaragāmeti salākabhattadāyakānaṃ gāme. Bhuñjituṃ āgacchantīti ‘‘mahāthero ekakova vihāre ohīno avassaṃ sabbasalākā attano pāpetvā ṭhito’’ti maññamānā āgacchanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Salākabhattakathāvaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Pakkhikabhattādikathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "213"
      },
      ". Abhilakkhitesu catūsu pakkhadivasesu dātabbaṃ bhattaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pakkhikaṃ. Abhilakkhitesū"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "abhī"
      },
      "ti upasāramattaṃ, lakkhaṇiyesuiccevattho, uposathasamādānadhammassavanapūjāsakkārādikaraṇatthaṃ lakkhitabbesu sallakkhetabbesu upalakkhetabbesūti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sve pakkhoti ajjapakkhikaṃ na gāhetabba"
      },
      "nti aṭṭhamiyā bhuñjitabbaṃ, sattamiyā bhuñjanatthāya na gāhetabbaṃ, dāyakehi niyamitadivaseneva gāhetabbanti attho. Tenāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘sace panā’’"
      },
      "tiādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sve lūkha"
      },
      "nti ajja āvāhamaṅgalādikaraṇato atipaṇītaṃ bhojanaṃ karīyati, sve tathā na bhavissati, ajjeva bhikkhū bhojessāmāti adhippāyo. Sāratthadīpaniyaṃ (sārattha. ṭī. cūḷavagga 3.325) pana aññathā vuttaṃ. Pakkhikabhattato uposathikabhattassa bhedaṃ dassento āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘uposathaṅgāni samādiyitvā’’"
      },
      "tiādi. Uposathe dātabbaṃ bhattaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "uposathikaṃ"
      },
      "."
    ],
    "innerText": "213. Abhilakkhitesu catūsu pakkhadivasesu dātabbaṃ bhattaṃ pakkhikaṃ. Abhilakkhitesūti ettha abhīti upasāramattaṃ, lakkhaṇiyesuiccevattho, uposathasamādānadhammassavanapūjāsakkārādikaraṇatthaṃ lakkhitabbesu sallakkhetabbesu upalakkhetabbesūti vuttaṃ hoti. Sve pakkhoti ajjapakkhikaṃ na gāhetabbanti aṭṭhamiyā bhuñjitabbaṃ, sattamiyā bhuñjanatthāya na gāhetabbaṃ, dāyakehi niyamitadivaseneva gāhetabbanti attho. Tenāha ‘‘sace panā’’tiādi. Sve lūkhanti ajja āvāhamaṅgalādikaraṇato atipaṇītaṃ bhojanaṃ karīyati, sve tathā na bhavissati, ajjeva bhikkhū bhojessāmāti adhippāyo. Sāratthadīpaniyaṃ (sārattha. ṭī. cūḷavagga 3.325) pana aññathā vuttaṃ. Pakkhikabhattato uposathikabhattassa bhedaṃ dassento āha ‘‘uposathaṅgāni samādiyitvā’’tiādi. Uposathe dātabbaṃ bhattaṃ uposathikaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Pakkhikabhattādikathāvaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Āgantukabhattādikathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "214"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nibandhāpita"
      },
      "nti ",
      " ‘‘asukavihāre āgantukā bhuñjantū’’ti niyamitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gamiko āgantukabhattampī"
      },
      "ti gāmantarato āgantvā avūpasantena gamikacittena vasitvā puna aññattha gacchantaṃ ",
      " sandhāya vuttaṃ, āvāsikassa pana gantukāmassa gamikabhattameva labbhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Lesaṃ oḍḍetvā’’"
      },
      "ti vuttattā lesābhāvena yāva gamanaparibandho vigacchati, tāva bhuñjituṃ vaṭṭatīti ñāpitanti daṭṭhabbaṃ."
    ],
    "innerText": "214.Nibandhāpitanti ‘‘asukavihāre āgantukā bhuñjantū’’ti niyamitaṃ. Gamiko āgantukabhattampīti gāmantarato āgantvā avūpasantena gamikacittena vasitvā puna aññattha gacchantaṃ sandhāya vuttaṃ, āvāsikassa pana gantukāmassa gamikabhattameva labbhati. ‘‘Lesaṃ oḍḍetvā’’ti vuttattā lesābhāvena yāva gamanaparibandho vigacchati, tāva bhuñjituṃ vaṭṭatīti ñāpitanti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Dhurabhattādikathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "215"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Taṇḍulādīni pesenti…pe… vaṭṭatī"
      },
      "ti abhihaṭabhikkhattā vaṭṭati."
    ],
    "innerText": "215.Taṇḍulādīni pesenti…pe… vaṭṭatīti abhihaṭabhikkhattā vaṭṭati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "216"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tathā paṭiggahitattā"
      },
      "ti bhikkhānāmena paṭiggahitattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pattaṃ pūretvā thaketvā dinna"
      },
      "nti ‘‘guḷakabhattaṃ demā’’ti dinnaṃ. Sesaṃ suviññeyyameva."
    ],
    "innerText": "216.Tathā paṭiggahitattāti bhikkhānāmena paṭiggahitattā. Pattaṃ pūretvā thaketvā dinnanti ‘‘guḷakabhattaṃ demā’’ti dinnaṃ. Sesaṃ suviññeyyameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Piṇḍapātabhājanakathāvaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Gilānapaccayabhājanakathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "217"
      },
      ". Ito paraṃ paccayānukkamena senāsanabhājanakathāya vattabbāyapi tassā mahāvisayattā, gilānapaccayabhājanīyakathāya pana appavisayattā, piṇḍapātabhājanīyakathāya anulomattā ca tadanantaraṃ taṃ dassetumāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘gilānapaccayabhājanīyaṃ panā’’"
      },
      "tiādi. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "rājarājamahāmattā"
      },
      "ti upalakkhaṇamattamevetaṃ. Brāhmaṇamahāsālagahapatimahāsālādayopi evaṃ karontiyeva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ghaṇṭiṃ paharitvā"
      },
      "tiādi heṭṭhā vuttanayattā ca pākaṭattā ",
      " ca suviññeyyameva. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upacārasīmaṃ…pe… bhājetabba"
      },
      "nti idaṃ saṅghaṃ uddissa dinnattā vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kumbhaṃ pana āvajjetvā"
      },
      "ti kumbhaṃ disāmukhaṃ katvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sace thinaṃ sappi hotī"
      },
      "ti kakkhaḷaṃ sappi hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Thokaṃ thokampi pāpetuṃ vaṭṭatī"
      },
      "ti evaṃ kate ṭhitikāpi tiṭṭhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Siṅgiveramaricādibhesajjampi avasesapattathālakādisamaṇaparikkhāropī"
      },
      "ti iminā na kevalaṃ bhesajjameva gilānapaccayo hoti, atha kho avasesaparikkhāropi gilānapaccaye antogadhoyevāti dasseti."
    ],
    "innerText": "217. Ito paraṃ paccayānukkamena senāsanabhājanakathāya vattabbāyapi tassā mahāvisayattā, gilānapaccayabhājanīyakathāya pana appavisayattā, piṇḍapātabhājanīyakathāya anulomattā ca tadanantaraṃ taṃ dassetumāha ‘‘gilānapaccayabhājanīyaṃ panā’’tiādi. Tattha rājarājamahāmattāti upalakkhaṇamattamevetaṃ. Brāhmaṇamahāsālagahapatimahāsālādayopi evaṃ karontiyeva. Ghaṇṭiṃ paharitvātiādi heṭṭhā vuttanayattā ca pākaṭattā ca suviññeyyameva. Upacārasīmaṃ…pe… bhājetabbanti idaṃ saṅghaṃ uddissa dinnattā vuttaṃ. Kumbhaṃ pana āvajjetvāti kumbhaṃ disāmukhaṃ katvā. Sace thinaṃ sappi hotīti kakkhaḷaṃ sappi hoti. Thokaṃ thokampi pāpetuṃ vaṭṭatīti evaṃ kate ṭhitikāpi tiṭṭhati. Siṅgiveramaricādibhesajjampi avasesapattathālakādisamaṇaparikkhāropīti iminā na kevalaṃ bhesajjameva gilānapaccayo hoti, atha kho avasesaparikkhāropi gilānapaccaye antogadhoyevāti dasseti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Gilānapaccayabhājanakathāvaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Senāsanaggāhakathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "218"
      },
      ". Senāsanabhājanakathāyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "senāsanaggāhe vinicchayo"
      },
      "ti senāsanabhājanamevāha. Tattha utukāle senāsanaggāho ca vassāvāse senāsanaggāho cāti kālavasena senāsanaggāho nāma duvidho hotīti yojanā. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "utukāle"
      },
      "ti hemantagimhānautukāle. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vassāvāse"
      },
      "ti vassānakāle. Bhikkhuṃ uṭṭhāpetvā senāsanaṃ dātabbaṃ, akālo nāma natthi dāyakehi ‘‘āgatānāgatassa cātuddisassa saṅghassa dammī’’ti dinnasaṅghikasenāsanattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekekaṃ pariveṇa"
      },
      "nti ekekassa bhikkhussa ekekaṃ pariveṇaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tatthā"
      },
      "ti tasmiṃ laddhapariveṇe. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Dīghasālā"
      },
      "ti caṅkamanasālā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Maṇḍalamāḷo"
      },
      "ti upaṭṭhānasālā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anudahatī"
      },
      "ti pīḷeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Adātuṃ na labhatī"
      },
      "ti iminā sañcicca adentassa paṭibāhane pavisanato dukkaṭanti dīpeti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Jambudīpe panā"
      },
      "ti ariyadese bhikkhū sandhāya vuttaṃ. Te kira tathā paññāpenti."
    ],
    "innerText": "218. Senāsanabhājanakathāyaṃ senāsanaggāhe vinicchayoti senāsanabhājanamevāha. Tattha utukāle senāsanaggāho ca vassāvāse senāsanaggāho cāti kālavasena senāsanaggāho nāma duvidho hotīti yojanā. Tattha utukāleti hemantagimhānautukāle. Vassāvāseti vassānakāle. Bhikkhuṃ uṭṭhāpetvā senāsanaṃ dātabbaṃ, akālo nāma natthi dāyakehi ‘‘āgatānāgatassa cātuddisassa saṅghassa dammī’’ti dinnasaṅghikasenāsanattā. Ekekaṃ pariveṇanti ekekassa bhikkhussa ekekaṃ pariveṇaṃ. Tatthāti tasmiṃ laddhapariveṇe. Dīghasālāti caṅkamanasālā. Maṇḍalamāḷoti upaṭṭhānasālā. Anudahatīti pīḷeti. Adātuṃ na labhatīti iminā sañcicca adentassa paṭibāhane pavisanato dukkaṭanti dīpeti. Jambudīpe panāti ariyadese bhikkhū sandhāya vuttaṃ. Te kira tathā paññāpenti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "219"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gocaragāmo ghaṭṭetabbo"
      },
      "ti vuttamevatthaṃ vibhāveti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘na tattha manussā vattabbā’’"
      },
      "tiādinā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vitakkaṃ chinditvā"
      },
      "ti ‘‘iminā nīhārena gacchantaṃ disvā nivāretvā paccaye dassantī’’ti evarūpaṃ vitakkaṃ anuppādetvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tesu ce eko"
      },
      "ti tesu manussesu eko paṇḍitapuriso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhaṇḍapaṭicchādana"
      },
      "nti paṭicchādanabhaṇḍaṃ, sarīrapaṭicchādanaṃ cīvaranti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Suddhacittattāva anavajja"
      },
      "nti idaṃ pucchitakkhaṇe kāraṇācikkhaṇaṃ sandhāya vuttaṃ na hoti asuddhacittassapi pucchitapañhavissajjane dosābhāvā. Evaṃ pana gate maṃ pucchissantīti saññāya agamanaṃ sandhāya vuttanti daṭṭhabbaṃ."
    ],
    "innerText": "219.Nagocaragāmo ghaṭṭetabboti vuttamevatthaṃ vibhāveti ‘‘na tattha manussā vattabbā’’tiādinā. Vitakkaṃ chinditvāti ‘‘iminā nīhārena gacchantaṃ disvā nivāretvā paccaye dassantī’’ti evarūpaṃ vitakkaṃ anuppādetvā. Tesu ce ekoti tesu manussesu eko paṇḍitapuriso. Bhaṇḍapaṭicchādananti paṭicchādanabhaṇḍaṃ, sarīrapaṭicchādanaṃ cīvaranti attho. Suddhacittattāva anavajjanti idaṃ pucchitakkhaṇe kāraṇācikkhaṇaṃ sandhāya vuttaṃ na hoti asuddhacittassapi pucchitapañhavissajjane dosābhāvā. Evaṃ pana gate maṃ pucchissantīti saññāya agamanaṃ sandhāya vuttanti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭijaggitabbānī"
      },
      "ti khaṇḍaphullābhisaṅkharaṇasammajjanādīhi paṭijaggitabbāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Muṇḍavedikāyā"
      },
      "ti cetiyassa hammiyavedikāya ghaṭākārassa upari caturassavedikāya. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kattha pucchitabba"
      },
      "nti pucchāya yato pakatiyā labbhati, tattha pucchitabbanti vissajjanā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kasmā pucchitabba"
      },
      "ntiādi yato pakatiyā labbhati, tatthāpi pucchanassa kāraṇasandassanatthaṃ vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭikkammā"
      },
      "ti vihārato apasakkitvā. Tamatthaṃ dassento ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘yojanadviyojanantare hotī’’"
      },
      "ti āha. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upanikkhepa"
      },
      "nti khettaṃ vā nāḷikerādiārāmaṃ vā kahāpaṇādīni vā ārāmikānaṃ niyyātetvā ‘‘ito uppannā vaḍḍhi vassāvāsikatthāya hotū’’ti dinnaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vattaṃ katvā"
      },
      "ti tasmiṃ senāsane ",
      " kattabbavattaṃ katvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Iti saddhādeyye"
      },
      "ti evaṃ heṭṭhā vuttanayena saddhāya dātabbe vassāvāsikalābhavisayeti attho."
    ],
    "innerText": "Paṭijaggitabbānīti khaṇḍaphullābhisaṅkharaṇasammajjanādīhi paṭijaggitabbāni. Muṇḍavedikāyāti cetiyassa hammiyavedikāya ghaṭākārassa upari caturassavedikāya. Kattha pucchitabbanti pucchāya yato pakatiyā labbhati, tattha pucchitabbanti vissajjanā. Kasmā pucchitabbantiādi yato pakatiyā labbhati, tatthāpi pucchanassa kāraṇasandassanatthaṃ vuttaṃ. Paṭikkammāti vihārato apasakkitvā. Tamatthaṃ dassento ‘‘yojanadviyojanantare hotī’’ti āha. Upanikkhepanti khettaṃ vā nāḷikerādiārāmaṃ vā kahāpaṇādīni vā ārāmikānaṃ niyyātetvā ‘‘ito uppannā vaḍḍhi vassāvāsikatthāya hotū’’ti dinnaṃ. Vattaṃ katvāti tasmiṃ senāsane kattabbavattaṃ katvā. Iti saddhādeyyeti evaṃ heṭṭhā vuttanayena saddhāya dātabbe vassāvāsikalābhavisayeti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vatthu panā"
      },
      "ti tatruppāde uppannarūpiyaṃ, tañca ‘‘tato catupaccayaṃ paribhuñjathā’’ti dinnakhettādito uppannattā kappiyakārakānaṃ hatthe ‘‘kappiyabhaṇḍaṃ paribhuñjathā’’ti dāyakehi dinnavatthusadisaṃ hotīti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kappiyakārakānañhī’’"
      },
      "tiādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅghasuṭṭhutāyā"
      },
      "ti saṅghassa hitāya ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Puggalavaseneva kātabba"
      },
      "nti parato vakkhamānanayena bhikkhū cīvarena kilamanti, ettakaṃ nāma taṇḍulabhāgaṃ bhikkhūnaṃ cīvaraṃ kātuṃ ruccatītiādinā puggalaparāmāsavaseneva kātabbaṃ, ‘‘saṅgho cīvarena kilamatī’’tiādinā pana saṅghaparāmāsavasena na kātabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kappiyabhaṇḍavasenā"
      },
      "ti sāmaññato vuttamevatthaṃ vibhāvetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘cīvarataṇḍulādivaseneva cā’’"
      },
      "ti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ca"
      },
      "-kāro cettha panasaddatthe vattati, na samuccayattheti daṭṭhabbaṃ. Puggalavaseneva kappiyabhaṇḍavasena ca apalokanappakāraṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘taṃ pana evaṃ kattabba’’"
      },
      "ntiādi vuttaṃ."
    ],
    "innerText": "Vatthu panāti tatruppāde uppannarūpiyaṃ, tañca ‘‘tato catupaccayaṃ paribhuñjathā’’ti dinnakhettādito uppannattā kappiyakārakānaṃ hatthe ‘‘kappiyabhaṇḍaṃ paribhuñjathā’’ti dāyakehi dinnavatthusadisaṃ hotīti āha ‘‘kappiyakārakānañhī’’tiādi. Saṅghasuṭṭhutāyāti saṅghassa hitāya . Puggalavaseneva kātabbanti parato vakkhamānanayena bhikkhū cīvarena kilamanti, ettakaṃ nāma taṇḍulabhāgaṃ bhikkhūnaṃ cīvaraṃ kātuṃ ruccatītiādinā puggalaparāmāsavaseneva kātabbaṃ, ‘‘saṅgho cīvarena kilamatī’’tiādinā pana saṅghaparāmāsavasena na kātabbaṃ. Kappiyabhaṇḍavasenāti sāmaññato vuttamevatthaṃ vibhāvetuṃ ‘‘cīvarataṇḍulādivaseneva cā’’ti vuttaṃ. Ca-kāro cettha panasaddatthe vattati, na samuccayattheti daṭṭhabbaṃ. Puggalavaseneva kappiyabhaṇḍavasena ca apalokanappakāraṃ dassetuṃ ‘‘taṃ pana evaṃ kattabba’’ntiādi vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cīvarapaccayaṃ sallakkhetvā"
      },
      "ti saddhādeyyatatruppādavasena tasmiṃ vassāvāse labbhamānacīvarasaṅkhātaṃ paccayaṃ ‘‘ettaka’’nti paricchinditvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Senāsanassā"
      },
      "ti senāsanaggāhāpaṇassa. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vutta"
      },
      "nti mahāaṭṭhakathāyaṃ vuttaṃ. Kasmā evaṃ vuttanti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘evañhī’’"
      },
      "tiādi, senāsanaggāhāpakassa attanāva attano gahaṇaṃ asāruppaṃ, tasmā ubho aññamaññaṃ gāhessantīti adhippāyo. Sammatasenāsanaggāhāpakassa āṇattiyā aññena gahitopi gāho ruhatiyevāti veditabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aṭṭhapi soḷasapi jane sammannituṃ vaṭṭatī"
      },
      "ti visuṃ visuṃ sammannituṃ vaṭṭati, udāhu ekatoti? Ekatopi vaṭṭati. Ekakammavācāya sabbepi ekato sammannituṃ vaṭṭati. Niggahakammameva hi saṅgho saṅghassa na karoti. Sammutidānaṃ pana bahūnampi ekato kātuṃ vaṭṭati. Teneva sattasatikakkhandhake ubbāhikasammutiyaṃ aṭṭhapi janā ekato sammatāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āsanaghara"
      },
      "nti paṭimāgharaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Maggo"
      },
      "ti upacārasīmabbhantaragate gāmābhimukhamagge katasālā vuccati, evaṃ pokkharaṇirukkhamūlādīsupi. Rukkhamūlādayo ",
      " channā kavāṭabaddhāva senāsanaṃ. Ito parāni suviññeyyāni."
    ],
    "innerText": "Cīvarapaccayaṃ sallakkhetvāti saddhādeyyatatruppādavasena tasmiṃ vassāvāse labbhamānacīvarasaṅkhātaṃ paccayaṃ ‘‘ettaka’’nti paricchinditvā. Senāsanassāti senāsanaggāhāpaṇassa. Vuttanti mahāaṭṭhakathāyaṃ vuttaṃ. Kasmā evaṃ vuttanti āha ‘‘evañhī’’tiādi, senāsanaggāhāpakassa attanāva attano gahaṇaṃ asāruppaṃ, tasmā ubho aññamaññaṃ gāhessantīti adhippāyo. Sammatasenāsanaggāhāpakassa āṇattiyā aññena gahitopi gāho ruhatiyevāti veditabbaṃ. Aṭṭhapi soḷasapi jane sammannituṃ vaṭṭatīti visuṃ visuṃ sammannituṃ vaṭṭati, udāhu ekatoti? Ekatopi vaṭṭati. Ekakammavācāya sabbepi ekato sammannituṃ vaṭṭati. Niggahakammameva hi saṅgho saṅghassa na karoti. Sammutidānaṃ pana bahūnampi ekato kātuṃ vaṭṭati. Teneva sattasatikakkhandhake ubbāhikasammutiyaṃ aṭṭhapi janā ekato sammatāti. Āsanagharanti paṭimāgharaṃ. Maggoti upacārasīmabbhantaragate gāmābhimukhamagge katasālā vuccati, evaṃ pokkharaṇirukkhamūlādīsupi. Rukkhamūlādayo channā kavāṭabaddhāva senāsanaṃ. Ito parāni suviññeyyāni."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "220"
      },
      ". Mahālābhapariveṇakathāyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "labhantī"
      },
      "ti tatra vāsino bhikkhū labhanti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vijaṭetvā"
      },
      "ti ekekassa pahonakappamāṇena viyojetvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āvāsesū"
      },
      "ti senāsanesu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pakkhipitvā"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pakkhipanaṃ"
      },
      " nāma tesu vasantānaṃ ito uppannavassāvāsikadānaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pavisitabba"
      },
      "nti aññehi bhikkhūhi tasmiṃ mahālābhe pariveṇe vasitvā cetiye vattaṃ katvāva lābho gahetabboti adhippāyo."
    ],
    "innerText": "220. Mahālābhapariveṇakathāyaṃ labhantīti tatra vāsino bhikkhū labhanti. Vijaṭetvāti ekekassa pahonakappamāṇena viyojetvā. Āvāsesūti senāsanesu. Pakkhipitvāti ettha pakkhipanaṃ nāma tesu vasantānaṃ ito uppannavassāvāsikadānaṃ. Pavisitabbanti aññehi bhikkhūhi tasmiṃ mahālābhe pariveṇe vasitvā cetiye vattaṃ katvāva lābho gahetabboti adhippāyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "221"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paccayaṃ vissajjetī"
      },
      "ti cīvarapaccayaṃ nādhivāseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ayampī"
      },
      "ti tena vissajjitapaccayopi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pādamūle ṭhapetvā sāṭakaṃ dentī"
      },
      "ti paccayadāyakā denti. Etena gahaṭṭhehi pādamūle ṭhapetvā dinnampi paṃsukūlikānampi vaṭṭatīti dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Atha vassāvāsikaṃ demāti vadantī"
      },
      "ti ettha ‘‘paṃsukūlikānaṃ na vaṭṭatī’’ti ajjhāharitvā yojetabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vassaṃ vutthabhikkhūna"
      },
      "nti paṃsukūlikato aññesaṃ bhikkhūnaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Upanibandhitvā gāhetabba"
      },
      "nti ‘‘imasmiṃ rukkhe vā maṇḍape vā vasitvā cetiye vattaṃ katvā gaṇhathā’’ti evaṃ upanibandhitvā gāhetabbaṃ."
    ],
    "innerText": "221.Paccayaṃ vissajjetīti cīvarapaccayaṃ nādhivāseti. Ayampīti tena vissajjitapaccayopi. Pādamūle ṭhapetvā sāṭakaṃ dentīti paccayadāyakā denti. Etena gahaṭṭhehi pādamūle ṭhapetvā dinnampi paṃsukūlikānampi vaṭṭatīti dasseti. Atha vassāvāsikaṃ demāti vadantīti ettha ‘‘paṃsukūlikānaṃ na vaṭṭatī’’ti ajjhāharitvā yojetabbaṃ. Vassaṃ vutthabhikkhūnanti paṃsukūlikato aññesaṃ bhikkhūnaṃ. Upanibandhitvā gāhetabbanti ‘‘imasmiṃ rukkhe vā maṇḍape vā vasitvā cetiye vattaṃ katvā gaṇhathā’’ti evaṃ upanibandhitvā gāhetabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pāṭipadaaruṇato"
      },
      "tiādi vassūpanāyikadivasaṃ sandhāya vuttaṃ. Antarāmuttakaṃ pana pāṭipadaṃ atikkamitvāpi gāhetuṃ vaṭṭati. ‘‘Kattha nu kho vasissāmi, kattha vasantassa phāsu bhavissati, kattha vā paccaye labhissāmī’’ti evaṃ uppannena vitakkena caratīti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vitakkacāriko"
      },
      ". Idāni yaṃ dāyakā pacchimavassaṃvutthānaṃ vassāvāsikaṃ deti, tattha paṭipajjanavidhiṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘pacchimavassūpanāyikadivase panā’’"
      },
      "tiādi āraddhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āgantuko ce bhikkhū"
      },
      "ti cīvare gāhite pacchā āgato āgantuko bhikkhu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Pattaṭṭhāne"
      },
      "ti vassaggena āgantukabhikkhuno ",
      " pattaṭṭhāne. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭhamavassūpagatā"
      },
      "ti āgantukassa āgamanato puretarameva pacchimikāya vassūpanāyikāya vassūpagatā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Laddhaṃ laddha"
      },
      "nti punappunaṃ dāyakānaṃ santikā āgatāgatasāṭakaṃ."
    ],
    "innerText": "Pāṭipadaaruṇatotiādi vassūpanāyikadivasaṃ sandhāya vuttaṃ. Antarāmuttakaṃ pana pāṭipadaṃ atikkamitvāpi gāhetuṃ vaṭṭati. ‘‘Kattha nu kho vasissāmi, kattha vasantassa phāsu bhavissati, kattha vā paccaye labhissāmī’’ti evaṃ uppannena vitakkena caratīti vitakkacāriko. Idāni yaṃ dāyakā pacchimavassaṃvutthānaṃ vassāvāsikaṃ deti, tattha paṭipajjanavidhiṃ dassetuṃ ‘‘pacchimavassūpanāyikadivase panā’’tiādi āraddhaṃ. Āgantuko ce bhikkhūti cīvare gāhite pacchā āgato āgantuko bhikkhu. Pattaṭṭhāneti vassaggena āgantukabhikkhuno pattaṭṭhāne. Paṭhamavassūpagatāti āgantukassa āgamanato puretarameva pacchimikāya vassūpanāyikāya vassūpagatā. Laddhaṃ laddhanti punappunaṃ dāyakānaṃ santikā āgatāgatasāṭakaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sādiyantāpi hi teneva vassāvāsikassa sāmino"
      },
      "ti chinnavassattā vuttaṃ. Paṭhamameva katikāya katattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘neva adātuṃ labhantī’’"
      },
      "ti vuttaṃ, dātabbaṃ vārentānaṃ gīvā hotīti adhippāyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tesameva dātabba"
      },
      "nti vassūpagatesu aladdhavassāvāsikānaṃ ekaccānameva dātabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhatiniviṭṭha"
      },
      "nti bhatiṃ katvā viya niviṭṭhaṃ pariyiṭṭhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhatiniviṭṭha"
      },
      "nti vā pānīyupaṭṭhānādibhatiṃ katvā laddhaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅghikaṃ panā"
      },
      "tiādi kesañci vādadassanaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "saṅghikaṃ pana apalokanakammaṃ katvā gāhita"
      },
      "nti tatruppādaṃ sandhāya vuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "apalokanakammaṃ katvā gāhita"
      },
      "nti ‘‘chinnavassāvāsikañca idāni uppajjanakavassāvāsikañca imesaṃ dātuṃ ruccatī’’ti anantare vuttanayena ",
      " apalokanaṃ katvā gāhitaṃ saṅghena dinnattā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vibbhantopi labhateva,"
      },
      " pageva chinnavasso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paccayavasena gāhitaṃ"
      },
      " pana temāsaṃ vasitvā gahetuṃ attanā dāyakehi ca anumatattā bhatiniviṭṭhampi chinnavassopi vibbhantopi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "na labhatī"
      },
      "ti keci ācariyā ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vadanti"
      },
      ". Idañca pacchā vuttattā pamāṇaṃ, teneva vassūpanāyikadivase evaṃ dāyakehi dinnaṃ vassāvāsikaṃ gahitabhikkhuno vassacchedaṃ akatvā vāsova heṭṭhā vihito, na pānīyupaṭṭhānādibhatikaraṇamattaṃ. Yadi hi taṃ bhatiniviṭṭhameva siyā, bhatikaraṇameva vidhātabbaṃ, tasmā vassaggena gāhitaṃ chinnavassādayo na labhantīti veditabbaṃ."
    ],
    "innerText": "Sādiyantāpi hi teneva vassāvāsikassa sāminoti chinnavassattā vuttaṃ. Paṭhamameva katikāya katattā ‘‘neva adātuṃ labhantī’’ti vuttaṃ, dātabbaṃ vārentānaṃ gīvā hotīti adhippāyo. Tesameva dātabbanti vassūpagatesu aladdhavassāvāsikānaṃ ekaccānameva dātabbaṃ. Bhatiniviṭṭhanti bhatiṃ katvā viya niviṭṭhaṃ pariyiṭṭhaṃ. Bhatiniviṭṭhanti vā pānīyupaṭṭhānādibhatiṃ katvā laddhaṃ. Saṅghikaṃ panātiādi kesañci vādadassanaṃ. Tattha saṅghikaṃ pana apalokanakammaṃ katvā gāhitanti tatruppādaṃ sandhāya vuttaṃ. Tattha apalokanakammaṃ katvā gāhitanti ‘‘chinnavassāvāsikañca idāni uppajjanakavassāvāsikañca imesaṃ dātuṃ ruccatī’’ti anantare vuttanayena apalokanaṃ katvā gāhitaṃ saṅghena dinnattā vibbhantopi labhateva, pageva chinnavasso. Paccayavasena gāhitaṃ pana temāsaṃ vasitvā gahetuṃ attanā dāyakehi ca anumatattā bhatiniviṭṭhampi chinnavassopi vibbhantopi na labhatīti keci ācariyā vadanti. Idañca pacchā vuttattā pamāṇaṃ, teneva vassūpanāyikadivase evaṃ dāyakehi dinnaṃ vassāvāsikaṃ gahitabhikkhuno vassacchedaṃ akatvā vāsova heṭṭhā vihito, na pānīyupaṭṭhānādibhatikaraṇamattaṃ. Yadi hi taṃ bhatiniviṭṭhameva siyā, bhatikaraṇameva vidhātabbaṃ, tasmā vassaggena gāhitaṃ chinnavassādayo na labhantīti veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idha, bhikkhave, vassaṃvuttho bhikkhu vibbhamati, saṅghasseva ta’’nti (mahāva. 374-375) vacanato ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘vataṭṭhāne…pe… saṅghikaṃ hotī’’"
      },
      "ti vuttaṃ ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅghikaṃ hotī"
      },
      "ti etena vutthavassānampi vassāvāsikabhāgo saṅghikato amocito tesaṃ vibbhamena saṅghiko hotīti dasseti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Manusse"
      },
      "ti dāyakamanusse. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Labhatī"
      },
      "ti ‘‘mama pattabhāvaṃ etassa dethā’’ti dāyake sampaṭicchāpenteneva saṅghikato viyojitaṃ hotīti vuttaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Varabhāgaṃ sāmaṇerassā"
      },
      "ti tassa paṭhamagāhattā, therena pubbe paṭhamabhāgassa gahitattā, idāni gayhamānassa dutiyabhāgattā ca vuttaṃ."
    ],
    "innerText": "‘‘Idha, bhikkhave, vassaṃvuttho bhikkhu vibbhamati, saṅghasseva ta’’nti (mahāva. 374-375) vacanato ‘‘vataṭṭhāne…pe… saṅghikaṃ hotī’’ti vuttaṃ . Saṅghikaṃ hotīti etena vutthavassānampi vassāvāsikabhāgo saṅghikato amocito tesaṃ vibbhamena saṅghiko hotīti dasseti. Manusseti dāyakamanusse. Labhatīti ‘‘mama pattabhāvaṃ etassa dethā’’ti dāyake sampaṭicchāpenteneva saṅghikato viyojitaṃ hotīti vuttaṃ. Varabhāgaṃ sāmaṇerassāti tassa paṭhamagāhattā, therena pubbe paṭhamabhāgassa gahitattā, idāni gayhamānassa dutiyabhāgattā ca vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "222"
      },
      ". Idāni antarāmuttasenāsanaggāhaṃ dassetuṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘ayamaparopī’’"
      },
      "tyādimāha. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "aparopī"
      },
      "ti pubbe vuttasenāsanaggāhadvayato aññopīti attho. Nanu ca ‘‘ayaṃ senāsanaggāho nāma duvidho hoti utukāle ca vassāvāse cā’’ti vutto, atha kasmā ‘‘ayamaparopī’’tyādi vuttoti codanaṃ sandhāyāha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘divasavasena hī’’"
      },
      "tiādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aparajjugatāya āsāḷhiyā"
      },
      "ti paṭhamavassūpanāyikadivasabhūtaṃ āsāḷhipuṇṇamiyā pāṭipadaṃ sandhāya vuttaṃ, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "māsagatāya āsāḷhiyā"
      },
      "ti dutiyavassūpanāyikadivasabhūtasāvaṇapuṇṇamiyā pāṭipadaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Aparajjugatāya pavāraṇā"
      },
      "ti assayujapuṇṇamiyā pāṭipadaṃ."
    ],
    "innerText": "222. Idāni antarāmuttasenāsanaggāhaṃ dassetuṃ ‘‘ayamaparopī’’tyādimāha. Tattha aparopīti pubbe vuttasenāsanaggāhadvayato aññopīti attho. Nanu ca ‘‘ayaṃ senāsanaggāho nāma duvidho hoti utukāle ca vassāvāse cā’’ti vutto, atha kasmā ‘‘ayamaparopī’’tyādi vuttoti codanaṃ sandhāyāha ‘‘divasavasena hī’’tiādi. Aparajjugatāya āsāḷhiyāti paṭhamavassūpanāyikadivasabhūtaṃ āsāḷhipuṇṇamiyā pāṭipadaṃ sandhāya vuttaṃ, māsagatāya āsāḷhiyāti dutiyavassūpanāyikadivasabhūtasāvaṇapuṇṇamiyā pāṭipadaṃ. Aparajjugatāya pavāraṇāti assayujapuṇṇamiyā pāṭipadaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "223"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Utukāle paṭibāhituṃ na labhatī"
      },
      "ti hemantagimhesu aññe sampattabhikkhū paṭibāhituṃ na labhati. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Navakamma"
      },
      "nti navakammasammuti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akata"
      },
      "nti aparisaṅkhataṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Vippakata"
      },
      "nti aniṭṭhitaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ekaṃ mañcaṭṭhānaṃ datvā"
      },
      "ti ekaṃ mañcaṭṭhānaṃ puggalikaṃ datvā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tibhāga"
      },
      "nti tatiyabhāgaṃ. Evaṃ vissajjanampi thāvarena thāvaraṃ parivattanaṭṭhāneyeva pavisati, na itarathā sabbasenāsanavissajjanato ",
      ". ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Sace saddhivihārikādīnaṃ dātukāmo hotī"
      },
      "ti sace so saṅghassa bhaṇḍaṭhapanaṭṭhānaṃ vā aññesaṃ bhikkhūnaṃ vasanaṭṭhānaṃ vā dātuṃ na icchati, attano saddhivihārikādīnaññeva dātukāmo hoti, tādisassa ",
      " ‘‘tuyhaṃ puggalikameva katvā jaggāhī’’ti na sabbaṃ dātabbanti adhippāyo. Tatthassa kattabbavidhiṃ dassento āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘kamma’’"
      },
      "ntiādi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Evañhī"
      },
      "tiādimhi cayānurūpaṃ tatiyabhāge vā upaḍḍhabhāge vā gahite taṃ bhāgaṃ dātuṃ labhatīti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yenā"
      },
      "ti tesu dvīsu tīsu bhikkhūsu yena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "So sāmī"
      },
      "ti tassā bhūmiyā vihārakaraṇe sova sāmī, taṃ paṭibāhitvā itarena na kātabbanti adhippāyo."
    ],
    "innerText": "223.Utukāle paṭibāhituṃ na labhatīti hemantagimhesu aññe sampattabhikkhū paṭibāhituṃ na labhati. Navakammanti navakammasammuti. Akatanti aparisaṅkhataṃ. Vippakatanti aniṭṭhitaṃ. Ekaṃ mañcaṭṭhānaṃ datvāti ekaṃ mañcaṭṭhānaṃ puggalikaṃ datvā. Tibhāganti tatiyabhāgaṃ. Evaṃ vissajjanampi thāvarena thāvaraṃ parivattanaṭṭhāneyeva pavisati, na itarathā sabbasenāsanavissajjanato . Sace saddhivihārikādīnaṃ dātukāmo hotīti sace so saṅghassa bhaṇḍaṭhapanaṭṭhānaṃ vā aññesaṃ bhikkhūnaṃ vasanaṭṭhānaṃ vā dātuṃ na icchati, attano saddhivihārikādīnaññeva dātukāmo hoti, tādisassa ‘‘tuyhaṃ puggalikameva katvā jaggāhī’’ti na sabbaṃ dātabbanti adhippāyo. Tatthassa kattabbavidhiṃ dassento āha ‘‘kamma’’ntiādi. Evañhītiādimhi cayānurūpaṃ tatiyabhāge vā upaḍḍhabhāge vā gahite taṃ bhāgaṃ dātuṃ labhatīti attho. Yenāti tesu dvīsu tīsu bhikkhūsu yena. So sāmīti tassā bhūmiyā vihārakaraṇe sova sāmī, taṃ paṭibāhitvā itarena na kātabbanti adhippāyo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "224"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Akataṭṭhāne"
      },
      "ti senāsanato bahi cayādīnaṃ akataṭṭhāne. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Cayaṃ vā pamukhaṃ vā"
      },
      "ti saṅghikasenāsanaṃ nissāya tato bahi bandhitvā ekaṃ senāsanaṃ vā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bahikuṭṭe"
      },
      "ti kuṭṭato bahi, attano kataṭṭhāneti attho. Sesaṃ suviññeyyameva."
    ],
    "innerText": "224.Akataṭṭhāneti senāsanato bahi cayādīnaṃ akataṭṭhāne. Cayaṃ vā pamukhaṃ vāti saṅghikasenāsanaṃ nissāya tato bahi bandhitvā ekaṃ senāsanaṃ vā. Bahikuṭṭeti kuṭṭato bahi, attano kataṭṭhāneti attho. Sesaṃ suviññeyyameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Senāsanaggāhakathāvaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "Catupaccayasādhāraṇakathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "225"
      },
      ". Catupaccayasādhāraṇakathāyaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sammatena appamattakavissajjakenā"
      },
      "ti ñattidutiyakammavācāya vā apalokanakammena vā sammatena appamattakavissajjakasammutiladdhena. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Avibhattaṃ saṅghikabhaṇḍanti pucchitabbakiccaṃ natthīti ettha avibhattaṃ saṅghikabhaṇḍa"
      },
      "nti kukkuccuppattiākāradassanaṃ, evaṃ kukkuccaṃ katvā pucchitabbakiccaṃ natthi, apucchitvāva dātabbanti adhippāyo. Kasmāti ce? Ettakassa saṅghikabhaṇḍassa vissajjanatthāyeva samaggassa saṅghassa anumatiyā katasammutikammattā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Guḷapiṇḍe…pe… dātabbo"
      },
      "ti ettha guḷapiṇḍaṃ tālapakkappamāṇanti veditabbaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Piṇḍāya paviṭṭhassapī"
      },
      "ti idaṃ upalakkhaṇamattaṃ. Aññena kāraṇena bahisīmagatassapi eseva ",
      " nayo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Odanapaṭivīso"
      },
      "ti saṅghabhattādisaṅghikaodanapaṭivīso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Antoupacārasīmāyaṃ ṭhitassā"
      },
      "ti anādare sāmivacanaṃ, antoupacārasīmāyaṃ ṭhitasseva gāhetuṃ vaṭṭati, na bahiupacārasīmaṃ pattassāti attho. Vuttañhetaṃ aṭṭhakathāyaṃ (cūḷava. aṭṭha. 325) ‘‘bahiupacārasīmāya ṭhitānaṃ gāhethāti vadanti, na gāhetabba’’nti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Antogāmaṭṭhānampī"
      },
      "ti ettha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "pi"
      },
      "-saddo avuttasampiṇḍanattho, antogāmaṭṭhānampi bahigāmaṭṭhānampi ",
      " gāhetuṃ vaṭṭatīti attho. Sambhāvanattho vā, tena antogāmaṭṭhānampi gāhetuṃ vaṭṭati, pageva bahigāmaṭṭhānanti."
    ],
    "innerText": "225. Catupaccayasādhāraṇakathāyaṃ sammatena appamattakavissajjakenāti ñattidutiyakammavācāya vā apalokanakammena vā sammatena appamattakavissajjakasammutiladdhena. Avibhattaṃ saṅghikabhaṇḍanti pucchitabbakiccaṃ natthīti ettha avibhattaṃ saṅghikabhaṇḍanti kukkuccuppattiākāradassanaṃ, evaṃ kukkuccaṃ katvā pucchitabbakiccaṃ natthi, apucchitvāva dātabbanti adhippāyo. Kasmāti ce? Ettakassa saṅghikabhaṇḍassa vissajjanatthāyeva samaggassa saṅghassa anumatiyā katasammutikammattā. Guḷapiṇḍe…pe… dātabboti ettha guḷapiṇḍaṃ tālapakkappamāṇanti veditabbaṃ. Piṇḍāya paviṭṭhassapīti idaṃ upalakkhaṇamattaṃ. Aññena kāraṇena bahisīmagatassapi eseva nayo. Odanapaṭivīsoti saṅghabhattādisaṅghikaodanapaṭivīso. Antoupacārasīmāyaṃ ṭhitassāti anādare sāmivacanaṃ, antoupacārasīmāyaṃ ṭhitasseva gāhetuṃ vaṭṭati, na bahiupacārasīmaṃ pattassāti attho. Vuttañhetaṃ aṭṭhakathāyaṃ (cūḷava. aṭṭha. 325) ‘‘bahiupacārasīmāya ṭhitānaṃ gāhethāti vadanti, na gāhetabba’’nti. Antogāmaṭṭhānampīti ettha pi-saddo avuttasampiṇḍanattho, antogāmaṭṭhānampi bahigāmaṭṭhānampi gāhetuṃ vaṭṭatīti attho. Sambhāvanattho vā, tena antogāmaṭṭhānampi gāhetuṃ vaṭṭati, pageva bahigāmaṭṭhānanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Catupaccayasādhāraṇakathāvaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti vinayasaṅgahasaṃvaṇṇanābhūte vinayālaṅkāre"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Catupaccayabhājanīyavinicchayakathālaṅkāro nāma"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Aṭṭhavīsatimo paricchedo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "title"
    },
    "innerText": "Vihāravinicchayakathāvaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Idāni catupaccayantogadhattā vihārassa catupaccayabhājanakathānantaraṃ vihāravinicchayakathā ārabhīyate. Tatridaṃ vuccati –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Ko vihāro kenaṭṭhena;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Vihāro so katividho;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Kena so kassa dātabbo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kathaṃ ko tassa issaro."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Kena so gāhito kassa;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Anuṭṭhāpaniyā kati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Katihaṅgehi yuttassa;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Dhuvavāsāya dīyate’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "ko vihāro"
      },
      "ti catūsu paccayesu senāsanasaṅkhāto catūsu senāsanesu vihārasenāsanasaṅkhāto bhikkhūnaṃ nivāsabhūto patissayaviseso. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kenaṭṭhena vihāro"
      },
      "ti viharanti etthāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vihāro,"
      },
      " iriyāpathadibbabrahmaariyasaṅkhātehi catūhi vihārehi ariyā ettha viharantītyattho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "So katividho"
      },
      "ti saṅghikavihāragaṇasantakavihārapuggalikavihāravasena tibbidho. Vuttañhetaṃ samantapāsādikāyaṃ ‘‘cātuddisaṃ saṅghaṃ uddissa bhikkhūnaṃ dinnaṃ vihāraṃ vā pariveṇaṃ vā āvāsaṃ vā mahantampi khuddakampi abhiyuñjato abhiyogo na ruhati, acchinditvā gaṇhitumpi na sakkoti. Kasmā? Sabbesaṃ dhuranikkhepābhāvato. Na hettha sabbe cātuddisā bhikkhū dhuranikkhepaṃ karontīti. Dīghabhāṇakādibhedassa pana gaṇassa, ekapuggalassa vā santakaṃ abhiyuñjitvā gaṇhanto sakkoti te dhuraṃ nikkhipāpetuṃ, tasmā tattha ārāme vuttanayeneva vinicchayo veditabbo’’ti. Iminā dāyakasantako vihāro nāma natthīti dīpeti."
    ],
    "innerText": "Tattha ko vihāroti catūsu paccayesu senāsanasaṅkhāto catūsu senāsanesu vihārasenāsanasaṅkhāto bhikkhūnaṃ nivāsabhūto patissayaviseso. Kenaṭṭhena vihāroti viharanti etthāti vihāro, iriyāpathadibbabrahmaariyasaṅkhātehi catūhi vihārehi ariyā ettha viharantītyattho. So katividhoti saṅghikavihāragaṇasantakavihārapuggalikavihāravasena tibbidho. Vuttañhetaṃ samantapāsādikāyaṃ ‘‘cātuddisaṃ saṅghaṃ uddissa bhikkhūnaṃ dinnaṃ vihāraṃ vā pariveṇaṃ vā āvāsaṃ vā mahantampi khuddakampi abhiyuñjato abhiyogo na ruhati, acchinditvā gaṇhitumpi na sakkoti. Kasmā? Sabbesaṃ dhuranikkhepābhāvato. Na hettha sabbe cātuddisā bhikkhū dhuranikkhepaṃ karontīti. Dīghabhāṇakādibhedassa pana gaṇassa, ekapuggalassa vā santakaṃ abhiyuñjitvā gaṇhanto sakkoti te dhuraṃ nikkhipāpetuṃ, tasmā tattha ārāme vuttanayeneva vinicchayo veditabbo’’ti. Iminā dāyakasantako vihāro nāma natthīti dīpeti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kena so dātabbo"
      },
      "ti khattiyena vā brāhmaṇena vā yena kenaci so vihāro dātabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kassa dātabbo"
      },
      "ti saṅghassa vā gaṇassa vā puggalassa vā dātabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kathaṃ dātabbo"
      },
      "ti yadi saṅghassa deti, ‘‘imaṃ vihāraṃ āgatānāgatassa cātuddisassa saṅghassa dammī’’ti, yadi gaṇassa, ‘‘imaṃ vihāraṃ āyasmantānaṃ dammī’’ti, yadi puggalassa, ‘‘imaṃ vihāraṃ āyasmato dammī’’ti dātabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ko tassa issaro"
      },
      "ti yadi saṅghassa deti, saṅgho tassa vihārassa issaro. Yadi gaṇassa deti, gaṇo tassa issaro. Yadi puggalassa deti, puggalo tassa issaroti. Tathā ",
      " hi vuttaṃ aṭṭhakathāyaṃ ‘‘dīghabhāṇakādikassa pana gaṇassa ekapuggalassa vā santaka’’nti."
    ],
    "innerText": "Kena so dātabboti khattiyena vā brāhmaṇena vā yena kenaci so vihāro dātabbo. Kassa dātabboti saṅghassa vā gaṇassa vā puggalassa vā dātabbo. Kathaṃ dātabboti yadi saṅghassa deti, ‘‘imaṃ vihāraṃ āgatānāgatassa cātuddisassa saṅghassa dammī’’ti, yadi gaṇassa, ‘‘imaṃ vihāraṃ āyasmantānaṃ dammī’’ti, yadi puggalassa, ‘‘imaṃ vihāraṃ āyasmato dammī’’ti dātabbo. Ko tassa issaroti yadi saṅghassa deti, saṅgho tassa vihārassa issaro. Yadi gaṇassa deti, gaṇo tassa issaro. Yadi puggalassa deti, puggalo tassa issaroti. Tathā hi vuttaṃ aṭṭhakathāyaṃ ‘‘dīghabhāṇakādikassa pana gaṇassa ekapuggalassa vā santaka’’nti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kena so gāhito"
      },
      "ti senāsanaggāhāpakena so vihāro gāhito. Vuttañhetaṃ bhagavatā ‘‘anujānāmi, bhikkhave, pañcahaṅgehi samannāgataṃ senāsanaggāhāpakaṃ sammannituṃ, yo na chandāgatiṃ gaccheyya, na dosāgatiṃ gaccheyya, na mohāgatiṃ gaccheyya, evañca, bhikkhave, sammannitabbo, paṭhamaṃ bhikkhu yācitabbo, yācitvā byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
    ],
    "innerText": "Kena so gāhitoti senāsanaggāhāpakena so vihāro gāhito. Vuttañhetaṃ bhagavatā ‘‘anujānāmi, bhikkhave, pañcahaṅgehi samannāgataṃ senāsanaggāhāpakaṃ sammannituṃ, yo na chandāgatiṃ gaccheyya, na dosāgatiṃ gaccheyya, na mohāgatiṃ gaccheyya, evañca, bhikkhave, sammannitabbo, paṭhamaṃ bhikkhu yācitabbo, yācitvā byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Suṇātu me, bhante, saṅgho, yadi saṅghassa pattakallaṃ, saṅgho itthannāmaṃ bhikkhuṃ senāsanaggāhāpakaṃ sammanneyya, esā ñatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "innerText": "‘‘Suṇātu me, bhante, saṅgho, saṅgho itthannāmaṃ bhikkhuṃ senāsanaggāhāpakaṃ sammannati. Yassāyasmato khamati itthannāmassa bhikkhuno senāsanaggāhāpakassa sammuti, so tuṇhassa. Yassa nakkhamati, so bhāseyya."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "indent"
    },
    "children": [
      "‘‘Sammato ",
      " saṅghena itthannāmo bhikkhu senāsanaggāhāpako, khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti (cūḷava. 317)."
    ],
    "innerText": "‘‘Sammato saṅghena itthannāmo bhikkhu senāsanaggāhāpako, khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmī’’ti (cūḷava. 317)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kassa so gāhito"
      },
      "ti bhikkhūnaṃ so vihāro gāhito. Vuttañhetaṃ bhagavatā ‘‘anujānāmi, bhikkhave, paṭhamaṃ bhikkhū gaṇetuṃ, bhikkhū gaṇetvā seyyā gaṇetuṃ, seyyā gaṇetvā seyyaggena gāhetu’’nti (cūḷava. 318). ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Anuṭṭhāpaniyā katī"
      },
      "ti cattāro anuṭṭhāpanīyā vuḍḍhataro gilāno bhaṇḍāgāriko saṅghato laddhasenāsanoti. Vuttañhetaṃ kaṅkhāvitaraṇiyaṃ (kaṅakhā. aṭṭha. anupakhajjasikkhāpadavaṇṇanā) ‘‘vuḍḍho hi attano vuḍḍhatāya anuṭṭhāpanīyo ",
      ", gilāno gilānatāya, saṅgho pana bhaṇḍāgārikassa vā dhammakathikavinayadharagaṇavācakācariyānaṃ vā bahūpakārataṃ guṇavisiṭṭhatañca sallakkhetvā dhuvavāsatthāya vihāraṃ sallakkhetvā sammannitvā deti, tasmā yassa saṅghena dinno, sopi anuṭṭhāpanīyo’’ti."
    ],
    "innerText": "Kassa so gāhitoti bhikkhūnaṃ so vihāro gāhito. Vuttañhetaṃ bhagavatā ‘‘anujānāmi, bhikkhave, paṭhamaṃ bhikkhū gaṇetuṃ, bhikkhū gaṇetvā seyyā gaṇetuṃ, seyyā gaṇetvā seyyaggena gāhetu’’nti (cūḷava. 318). Anuṭṭhāpaniyā katīti cattāro anuṭṭhāpanīyā vuḍḍhataro gilāno bhaṇḍāgāriko saṅghato laddhasenāsanoti. Vuttañhetaṃ kaṅkhāvitaraṇiyaṃ (kaṅakhā. aṭṭha. anupakhajjasikkhāpadavaṇṇanā) ‘‘vuḍḍho hi attano vuḍḍhatāya anuṭṭhāpanīyo , gilāno gilānatāya, saṅgho pana bhaṇḍāgārikassa vā dhammakathikavinayadharagaṇavācakācariyānaṃ vā bahūpakārataṃ guṇavisiṭṭhatañca sallakkhetvā dhuvavāsatthāya vihāraṃ sallakkhetvā sammannitvā deti, tasmā yassa saṅghena dinno, sopi anuṭṭhāpanīyo’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Katihaṅgehi yuttassa dhuvavāsāya dīyate"
      },
      "ti ukkaṭṭhaparicchedena dvīhi aṅgehi yuttassa dhuvavāsatthāya vihāro dīyate. Katamehi dvīhi? Bahūpakāratāya guṇavisiṭṭhatāya ceti. Kathaṃ viññāyatīti ce? ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Bahūpakārata"
      },
      "nti bhaṇḍāgārikatādibahuupakārabhāvaṃ, na kevalaṃ idamevāti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘guṇavisiṭṭhatañcā’"
      },
      "ti. Tena bahūpakārattepi guṇavisiṭṭhattābhāve guṇavisiṭṭhattepi bahūpakārattābhāve dātuṃ vaṭṭatīti dassetī’’ti vinayatthamañjūsāyaṃ (kaṅakhā. abhi. ṭī. anupakhajjasikkhāpadavaṇṇanā) vacanato. Omakaparicchedena ekena aṅgena yuttassapi. Katamena ekena aṅgena? Bahūpakāratāya vā guṇavisiṭṭhatāya vā. Kathaṃ viññāyatīti ce? ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Bahūpakārataṃ guṇavisiṭṭhatañca sallakkhento"
      },
      "ti bhaṇḍāgārikassa bahūpakārataṃ, dhammakathikādīnaṃ guṇavisiṭṭhatañca sallakkhento’’ti sāratthadīpaniyaṃ (sārattha. ṭī. pācittiya 3.119-121) vacanato."
    ],
    "innerText": "Katihaṅgehi yuttassa dhuvavāsāya dīyateti ukkaṭṭhaparicchedena dvīhi aṅgehi yuttassa dhuvavāsatthāya vihāro dīyate. Katamehi dvīhi? Bahūpakāratāya guṇavisiṭṭhatāya ceti. Kathaṃ viññāyatīti ce? ‘‘Bahūpakāratanti bhaṇḍāgārikatādibahuupakārabhāvaṃ, na kevalaṃ idamevāti āha ‘guṇavisiṭṭhatañcā’ti. Tena bahūpakārattepi guṇavisiṭṭhattābhāve guṇavisiṭṭhattepi bahūpakārattābhāve dātuṃ vaṭṭatīti dassetī’’ti vinayatthamañjūsāyaṃ (kaṅakhā. abhi. ṭī. anupakhajjasikkhāpadavaṇṇanā) vacanato. Omakaparicchedena ekena aṅgena yuttassapi. Katamena ekena aṅgena? Bahūpakāratāya vā guṇavisiṭṭhatāya vā. Kathaṃ viññāyatīti ce? ‘‘Bahūpakārataṃ guṇavisiṭṭhatañca sallakkhentoti bhaṇḍāgārikassa bahūpakārataṃ, dhammakathikādīnaṃ guṇavisiṭṭhatañca sallakkhento’’ti sāratthadīpaniyaṃ (sārattha. ṭī. pācittiya 3.119-121) vacanato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Senāsanaggāho pana duvidho utukāle ca vassāvāse cāti kālavasena. Atha vā tayo senāsanaggāhā purimako pacchimako antarāmuttakoti. Tesaṃ viseso heṭṭhā vuttova. ‘‘Utukāle senāsanaggāho antarāmuttako ca taṅkhaṇapaṭisallāno cāti dubbidho. Vassāvāse senāsanaggāho purimako ca pacchimako cāti dubbidhoti cattāro senāsanaggāhā’’ti ācariyā ",
      " vadanti, taṃ vacanaṃ pāḷiyampi aṭṭhakathāyampi na āgataṃ ",
      ". Pāḷiyaṃ (cūḷava. 318) pana ‘‘tayome, bhikkhave, senāsanaggāhā purimako pacchimako antarāmuttako’’icceva āgato, aṭṭhakathāyampi (cūḷava. aṭṭha. 318) ‘‘tīsu senāsanaggāhesu purimako ca pacchimako cāti ime dve gāhā thāvarā, antarāmuttake ayaṃ vinicchayo’’ti āgato."
    ],
    "innerText": "Senāsanaggāho pana duvidho utukāle ca vassāvāse cāti kālavasena. Atha vā tayo senāsanaggāhā purimako pacchimako antarāmuttakoti. Tesaṃ viseso heṭṭhā vuttova. ‘‘Utukāle senāsanaggāho antarāmuttako ca taṅkhaṇapaṭisallāno cāti dubbidho. Vassāvāse senāsanaggāho purimako ca pacchimako cāti dubbidhoti cattāro senāsanaggāhā’’ti ācariyā vadanti, taṃ vacanaṃ pāḷiyampi aṭṭhakathāyampi na āgataṃ . Pāḷiyaṃ (cūḷava. 318) pana ‘‘tayome, bhikkhave, senāsanaggāhā purimako pacchimako antarāmuttako’’icceva āgato, aṭṭhakathāyampi (cūḷava. aṭṭha. 318) ‘‘tīsu senāsanaggāhesu purimako ca pacchimako cāti ime dve gāhā thāvarā, antarāmuttake ayaṃ vinicchayo’’ti āgato."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idāni pana ekacce ācariyā ‘‘imasmiṃ kāle sabbe vihārā saṅghikāva, puggalikavihāro nāma natthi. Kasmā? Vihāradāyakānaṃ vihāradānakāle kulūpakā ‘imaṃ vihāraṃ āgatānāgatassa cātuddisassa saṅghassa demā’ti vacībhedaṃ kārāpenti, tasmā navavihārāpi saṅghikā eva. Ekaccesu vihāresu evaṃ avatvā dentesupi ‘tasmiṃ jīvante puggaliko hoti, mate saṅghikoyevā’ti vuttattā porāṇakavihārāpi saṅghikāva hontī’’ti vadanti. Tatrevaṃ vicāretabbo – vacībhedaṃ kārāpetvā dinnavihāresupi dāyakā saṅghaṃ uddissa karontā nāma appakā, ‘‘imaṃ nāma bhikkhuṃ imaṃ nāma theraṃ vasāpessāmī’’ti cintetvā puttadāramittāmaccādīhi sammantetvā patiṭṭhāpenti, patiṭṭhānakāle avadantāpi dānakāle yebhuyyena vadanti. Atha pana kulūpakā dānakāle sikkhāpetvā vadāpenti, evaṃ vadantāpi dāyakā appakā saṅghaṃ uddissa denti, bahutarā attano kulūpakameva uddissa denti. Evaṃ sante kulūpakānaṃ vacanaṃ navasu adhammikadānesu ‘‘puggalassa pariṇataṃ saṅghassa pariṇāmetī’’ti (pārā. 660; pāci. 492) vuttaṃ ekaṃ adhammikadānaṃ āpajjati. ‘‘Tasmiṃ jīvante puggaliko, mate saṅghiko’’ti ayaṃ pāṭho mūlapuggalikavisaye na āgato, mūlasaṅghikavihāraṃ jaggāpetuṃ puggalikakārāpanaṭṭhāne āgato, tasmā navavihārāpi puggalaṃ uddissa dinnā santiyeva. Porāṇakavihārāpi mūle puggalikavasena ",
      " dinnā saddhivihārikādīnaṃ puggalikavaseneva dīyamānāpi tasmiṃ jīvanteyeva vissāsavasena gayhamānāpi puggalikā hontiyeva, tasmā sabbaso puggalikavihārassa abhāvavādo vicāretabbova."
    ],
    "innerText": "Idāni pana ekacce ācariyā ‘‘imasmiṃ kāle sabbe vihārā saṅghikāva, puggalikavihāro nāma natthi. Kasmā? Vihāradāyakānaṃ vihāradānakāle kulūpakā ‘imaṃ vihāraṃ āgatānāgatassa cātuddisassa saṅghassa demā’ti vacībhedaṃ kārāpenti, tasmā navavihārāpi saṅghikā eva. Ekaccesu vihāresu evaṃ avatvā dentesupi ‘tasmiṃ jīvante puggaliko hoti, mate saṅghikoyevā’ti vuttattā porāṇakavihārāpi saṅghikāva hontī’’ti vadanti. Tatrevaṃ vicāretabbo – vacībhedaṃ kārāpetvā dinnavihāresupi dāyakā saṅghaṃ uddissa karontā nāma appakā, ‘‘imaṃ nāma bhikkhuṃ imaṃ nāma theraṃ vasāpessāmī’’ti cintetvā puttadāramittāmaccādīhi sammantetvā patiṭṭhāpenti, patiṭṭhānakāle avadantāpi dānakāle yebhuyyena vadanti. Atha pana kulūpakā dānakāle sikkhāpetvā vadāpenti, evaṃ vadantāpi dāyakā appakā saṅghaṃ uddissa denti, bahutarā attano kulūpakameva uddissa denti. Evaṃ sante kulūpakānaṃ vacanaṃ navasu adhammikadānesu ‘‘puggalassa pariṇataṃ saṅghassa pariṇāmetī’’ti (pārā. 660; pāci. 492) vuttaṃ ekaṃ adhammikadānaṃ āpajjati. ‘‘Tasmiṃ jīvante puggaliko, mate saṅghiko’’ti ayaṃ pāṭho mūlapuggalikavisaye na āgato, mūlasaṅghikavihāraṃ jaggāpetuṃ puggalikakārāpanaṭṭhāne āgato, tasmā navavihārāpi puggalaṃ uddissa dinnā santiyeva. Porāṇakavihārāpi mūle puggalikavasena dinnā saddhivihārikādīnaṃ puggalikavaseneva dīyamānāpi tasmiṃ jīvanteyeva vissāsavasena gayhamānāpi puggalikā hontiyeva, tasmā sabbaso puggalikavihārassa abhāvavādo vicāretabbova."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aññe pana ācariyā ‘‘imasmiṃ kāle saṅghikavihārā nāma na santi, sabbe puggalikāva. Kasmā? Navavihārāpi patiṭṭhāpanakāle dānakāle ca kulūpakabhikkhuṃyeva uddissa katattā puggalikāva, porāṇakavihārāpi sissānusissehi vā aññehi vā puggalehi eva pariggahitattā, na kadāci saṅghena pariggahitattā puggalikāva honti, na saṅghikā’’ti vadanti. Tatrāpyevaṃ vicāretabbaṃ – navavihārepi patiṭṭhānakālepi dānakālepi ekacce saṅghaṃ uddissa ",
      " karonti, ekacce puggalaṃ. Pubbeva puggalaṃ uddissa katepi atthakāmānaṃ paṇḍitānaṃ vacanaṃ sutvā puggalikadānato saṅghikadānameva mahapphalataranti saddahitvā saṅghike karontāpi dāyakā santi, puggalikavasena paṭiggahite porāṇakavihārepi keci bhikkhū maraṇakāle saṅghassa niyyātenti. Keci kassaci adatvā maranti, tadā so vihāro saṅghiko hoti. Savatthukamahāvihāre pana karontā rājarājamahāmattādayo ‘‘pañcavassasahassaparimāṇaṃ sāsanaṃ yāva tiṭṭhati, tāva mama vihāre vasitvā saṅgho cattāro paccaye paribhuñjatū’’ti paṇidhāya cirakālaṃ saṅghassa paccayuppādakaraṃ gāmakhettādikaṃ ‘‘amhākaṃ vihārassa demā’’ti denti, vihārassāti ca vihāre vasanakasaṅghassa uddissa denti, na kulūpakabhūtassa ekapuggalassa eva, tasmā yebhuyyena saṅghikā dissanti, pāsāṇesu akkharaṃ likhitvāpi ṭhapenti, tasmā sabbaso saṅghikavihārābhāvavādopi vicāretabbova."
    ],
    "innerText": "Aññe pana ācariyā ‘‘imasmiṃ kāle saṅghikavihārā nāma na santi, sabbe puggalikāva. Kasmā? Navavihārāpi patiṭṭhāpanakāle dānakāle ca kulūpakabhikkhuṃyeva uddissa katattā puggalikāva, porāṇakavihārāpi sissānusissehi vā aññehi vā puggalehi eva pariggahitattā, na kadāci saṅghena pariggahitattā puggalikāva honti, na saṅghikā’’ti vadanti. Tatrāpyevaṃ vicāretabbaṃ – navavihārepi patiṭṭhānakālepi dānakālepi ekacce saṅghaṃ uddissa karonti, ekacce puggalaṃ. Pubbeva puggalaṃ uddissa katepi atthakāmānaṃ paṇḍitānaṃ vacanaṃ sutvā puggalikadānato saṅghikadānameva mahapphalataranti saddahitvā saṅghike karontāpi dāyakā santi, puggalikavasena paṭiggahite porāṇakavihārepi keci bhikkhū maraṇakāle saṅghassa niyyātenti. Keci kassaci adatvā maranti, tadā so vihāro saṅghiko hoti. Savatthukamahāvihāre pana karontā rājarājamahāmattādayo ‘‘pañcavassasahassaparimāṇaṃ sāsanaṃ yāva tiṭṭhati, tāva mama vihāre vasitvā saṅgho cattāro paccaye paribhuñjatū’’ti paṇidhāya cirakālaṃ saṅghassa paccayuppādakaraṃ gāmakhettādikaṃ ‘‘amhākaṃ vihārassa demā’’ti denti, vihārassāti ca vihāre vasanakasaṅghassa uddissa denti, na kulūpakabhūtassa ekapuggalassa eva, tasmā yebhuyyena saṅghikā dissanti, pāsāṇesu akkharaṃ likhitvāpi ṭhapenti, tasmā sabbaso saṅghikavihārābhāvavādopi vicāretabbova."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Apare ",
      " pana ācariyā ‘‘imasmiṃ kāle vihāradāyakasantakāva, tasmā dāyakāyeva vicāretuṃ issarā, na saṅgho, na puggalo. Vihāradāyake asantepi tassa puttadhītunattapanattādayo yāva kulaparamparā tassa vihārassa issarāva honti. Kasmāti ce? ‘Yena vihāro kārito, so vihārasāmiko’ti (pāci. aṭṭha. 116) āgatattā ca ‘tassa vā kule yo koci āpucchitabbo’ti (pāci. aṭṭha. 116) ca vacanato vihārassāmibhūto dāyako vā tassa vaṃse uppanno vā vicāretuṃ issaro. ‘Pacchinne kulavaṃse yo tassa janapadassa sāmiko, so acchinditvā puna deti cittalapabbate bhikkhunā nīhaṭaṃ udakavāhakaṃ aḷanāgarājamahesī viya, evampi vaṭṭatī’ti aṭṭhakathāyaṃ (pārā. aṭṭha. 2.538-539) vacanato vihāradāyakassa kulavaṃse pacchinnepi tassa janapadassa issaro rājā vā rājamahāmatto vā yo koci issaro vā vihāraṃ vicāretuṃ yathājjhāsayaṃ dātuṃ vaṭṭatī’’ti vadanti, tampi aññe paṇḍitā nānujānanti."
    ],
    "innerText": "Apare pana ācariyā ‘‘imasmiṃ kāle vihāradāyakasantakāva, tasmā dāyakāyeva vicāretuṃ issarā, na saṅgho, na puggalo. Vihāradāyake asantepi tassa puttadhītunattapanattādayo yāva kulaparamparā tassa vihārassa issarāva honti. Kasmāti ce? ‘Yena vihāro kārito, so vihārasāmiko’ti (pāci. aṭṭha. 116) āgatattā ca ‘tassa vā kule yo koci āpucchitabbo’ti (pāci. aṭṭha. 116) ca vacanato vihārassāmibhūto dāyako vā tassa vaṃse uppanno vā vicāretuṃ issaro. ‘Pacchinne kulavaṃse yo tassa janapadassa sāmiko, so acchinditvā puna deti cittalapabbate bhikkhunā nīhaṭaṃ udakavāhakaṃ aḷanāgarājamahesī viya, evampi vaṭṭatī’ti aṭṭhakathāyaṃ (pārā. aṭṭha. 2.538-539) vacanato vihāradāyakassa kulavaṃse pacchinnepi tassa janapadassa issaro rājā vā rājamahāmatto vā yo koci issaro vā vihāraṃ vicāretuṃ yathājjhāsayaṃ dātuṃ vaṭṭatī’’ti vadanti, tampi aññe paṇḍitā nānujānanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ? ‘‘Yena vihāro kārito, so vihārasāmiko’’ti vacanaṃ pubbavohāravasena vuttaṃ, na idāni issaravasena yathā jetavanaṃ, pattassāmikotyādi. Yathā hi jetassa rājakumārassa vanaṃ uyyānaṃ jetavananti viggahe kate yadipi anāthapiṇḍikena kiṇitvā vihārapatiṭṭhāpanakālato paṭṭhāya rājakumāro tassa uyyānassa issaro na hoti, tathāpi anāthapiṇḍikena kiṇitakālato pubbe issarabhūtapubbattā pubbavohāravasena sabbadāpi jetavanantveva ",
      " voharīyati. Yathā ca pattassa sāmiko pattassāmikoti viggahe kate yadipi dāyakehi kiṇitvā bhikkhussa dinnakālato paṭṭhāya kammāro pattassa issaro na hoti, tathāpi dāyakena kiṇitakālato ",
      " pubbe issarabhūtapubbattā pubbavohāravasena pattassāmikotveva voharīyati, evaṃ yadipi bhikkhussa dinnakālato paṭṭhāya dāyako vihārassa issaro na hoti vatthupariccāgalakkhaṇattā dānassa, tathāpi dānakālato pubbe issarabhūtapubbattā pubbavohāravasena vihārassāmikotveva voharīyati, na mukhyato issarabhāvatoti viññāyati, tasmā saṅghassa vā gaṇassa vā puggalassa vā dinnakālato paṭṭhāya saṅghādayo paṭiggāhakā eva vicāretuṃ issarā, na dāyako."
    ],
    "innerText": "Kathaṃ? ‘‘Yena vihāro kārito, so vihārasāmiko’’ti vacanaṃ pubbavohāravasena vuttaṃ, na idāni issaravasena yathā jetavanaṃ, pattassāmikotyādi. Yathā hi jetassa rājakumārassa vanaṃ uyyānaṃ jetavananti viggahe kate yadipi anāthapiṇḍikena kiṇitvā vihārapatiṭṭhāpanakālato paṭṭhāya rājakumāro tassa uyyānassa issaro na hoti, tathāpi anāthapiṇḍikena kiṇitakālato pubbe issarabhūtapubbattā pubbavohāravasena sabbadāpi jetavanantveva voharīyati. Yathā ca pattassa sāmiko pattassāmikoti viggahe kate yadipi dāyakehi kiṇitvā bhikkhussa dinnakālato paṭṭhāya kammāro pattassa issaro na hoti, tathāpi dāyakena kiṇitakālato pubbe issarabhūtapubbattā pubbavohāravasena pattassāmikotveva voharīyati, evaṃ yadipi bhikkhussa dinnakālato paṭṭhāya dāyako vihārassa issaro na hoti vatthupariccāgalakkhaṇattā dānassa, tathāpi dānakālato pubbe issarabhūtapubbattā pubbavohāravasena vihārassāmikotveva voharīyati, na mukhyato issarabhāvatoti viññāyati, tasmā saṅghassa vā gaṇassa vā puggalassa vā dinnakālato paṭṭhāya saṅghādayo paṭiggāhakā eva vicāretuṃ issarā, na dāyako."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kathaṃ viññāyatīti ce? Santesupi anāthapiṇḍikādīsu vihāradāyakesu ‘‘anujānāmi, bhikkhave, pañcahaṅgehi samannāgataṃ bhikkhuṃ senāsanaggāhāpakaṃ sammannitu’’ntiādinā (cūḷava. 317) saṅghena sammataṃ senāsanaggāhāpakaṃ anujānitvā, ‘‘anujānāmi, bhikkhave…pe… seyyaggena gāhetu’’ntiādinā (cūḷava. 318) senāsanaggāhāpakasseva vicāretuṃ issarabhāvassa vacanato ca ‘‘dve bhikkhū saṅghikaṃ bhūmiṃ gahetvā sodhetvā saṅghikaṃ senāsanaṃ karonti, yena sā bhūmi paṭhamaṃ gahitā, so sāmī’’ti ca ‘‘ubhopi puggalikaṃ karonti, soyeva sāmī’’ti ca ‘‘yo pana saṅghikaṃ vallimattampi aggahetvā āharimena upakaraṇena saṅghikāya bhūmiyā puggalikavihāraṃ kāreti, upaḍḍhaṃ saṅghikaṃ upaḍḍhaṃ puggalika’’nti ca saṅghapuggalānaṃyeva sāmibhāvassa aṭṭhakathāyaṃ vuttattā ca viññāyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Tassa vā kule yo koci āpucchitabbo’’ti aṭṭhakathāvacanampi tesaṃ vihārassa issarabhāvadīpakaṃ na hoti, atha kho gamiko bhikkhu disaṃ gantukāmo vihāre āpucchitabbabhikkhusāmaṇeraārāmikesu ",
      " asantesu te āpucchitvā gantabbabhāvameva dīpeti. Vuttañhetaṃ aṭṭhakathāyaṃ ‘‘imaṃ pana dasavidhampi seyyaṃ saṅghike vihāre santharitvā vā santharāpetvā vā pakkamantena āpucchitvā pakkamitabbaṃ, āpucchantena ca bhikkhumhi sati bhikkhu āpucchitabbo…pe… tasmiṃ asati ārāmiko, tasmimpi asati yena vihāro kārito, so vihārassāmiko, tassa vā kule yo koci āpucchitabbo’’ti. Evaṃ ārāmikassapi āpucchitabbato olokanatthāya vattasīseneva āpucchitabbo, na tesaṃ saṅghikasenāsanassa issarabhāvatoti daṭṭhabbaṃ."
    ],
    "innerText": "‘‘Tassa vā kule yo koci āpucchitabbo’’ti aṭṭhakathāvacanampi tesaṃ vihārassa issarabhāvadīpakaṃ na hoti, atha kho gamiko bhikkhu disaṃ gantukāmo vihāre āpucchitabbabhikkhusāmaṇeraārāmikesu asantesu te āpucchitvā gantabbabhāvameva dīpeti. Vuttañhetaṃ aṭṭhakathāyaṃ ‘‘imaṃ pana dasavidhampi seyyaṃ saṅghike vihāre santharitvā vā santharāpetvā vā pakkamantena āpucchitvā pakkamitabbaṃ, āpucchantena ca bhikkhumhi sati bhikkhu āpucchitabbo…pe… tasmiṃ asati ārāmiko, tasmimpi asati yena vihāro kārito, so vihārassāmiko, tassa vā kule yo koci āpucchitabbo’’ti. Evaṃ ārāmikassapi āpucchitabbato olokanatthāya vattasīseneva āpucchitabbo, na tesaṃ saṅghikasenāsanassa issarabhāvatoti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Pacchinne ",
      " kulavaṃse’’tyādivacanañca akappiyavasena katānaṃ akappiyavohārena paṭiggahitānaṃ khettavatthutaḷākādīnaṃ akappiyattā bhikkhūhi pariccattānaṃ kappiyakaraṇatthāya rājādīhi gahetvā puna tesaṃyeva bhikkhūnaṃ dānameva dīpeti, na tesaṃ rājādīnaṃ tehi bhikkhūhi aññesaṃ saṅghagaṇapuggalacetiyānaṃ dānaṃ. Yadi dadeyyuṃ, adhammikadānaadhammikapaaggahaadhammikaparibhogā siyuṃ. Vuttañhetaṃ parivāre (pari. aṭṭha. 329) ‘‘nava adhammikāni dānāni saṅghassa pariṇataṃ aññasaṅghassa vā cetiyassa vā puggalassa vā pariṇāmeti, cetiyassa pariṇataṃ aññacetiyassa vā saṅghassa vā puggalassa vā pariṇāmeti, puggalassa pariṇataṃ aññapuggalassa vā saṅghassa vā cetiyassa vā pariṇāmetī’’ti. Aṭṭhakathāyañca (pari. aṭṭha. 329) ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘nava adhammikāni dānānī"
      },
      "ti…pe… evaṃ vuttāni. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nava paṭiggahaparibhogā"
      },
      "ti etesaṃyeva dānānaṃ paṭiggahā ca paribhogā cā’’ti vuttaṃ. Tasmā yadi rājādayo issarāti gahetvā aññassa deyyuṃ, tampi dānaṃ adhammikadānaṃ hoti, taṃ dānaṃ paṭiggahā ",
      " ca adhammikapaṭiggahā honti, taṃ dānaṃ paribhuñjantā ca adhammikaparibhogā hontīti daṭṭhabbaṃ."
    ],
    "innerText": "‘‘Pacchinne kulavaṃse’’tyādivacanañca akappiyavasena katānaṃ akappiyavohārena paṭiggahitānaṃ khettavatthutaḷākādīnaṃ akappiyattā bhikkhūhi pariccattānaṃ kappiyakaraṇatthāya rājādīhi gahetvā puna tesaṃyeva bhikkhūnaṃ dānameva dīpeti, na tesaṃ rājādīnaṃ tehi bhikkhūhi aññesaṃ saṅghagaṇapuggalacetiyānaṃ dānaṃ. Yadi dadeyyuṃ, adhammikadānaadhammikapaaggahaadhammikaparibhogā siyuṃ. Vuttañhetaṃ parivāre (pari. aṭṭha. 329) ‘‘nava adhammikāni dānāni saṅghassa pariṇataṃ aññasaṅghassa vā cetiyassa vā puggalassa vā pariṇāmeti, cetiyassa pariṇataṃ aññacetiyassa vā saṅghassa vā puggalassa vā pariṇāmeti, puggalassa pariṇataṃ aññapuggalassa vā saṅghassa vā cetiyassa vā pariṇāmetī’’ti. Aṭṭhakathāyañca (pari. aṭṭha. 329) ‘‘nava adhammikāni dānānīti…pe… evaṃ vuttāni. Nava paṭiggahaparibhogāti etesaṃyeva dānānaṃ paṭiggahā ca paribhogā cā’’ti vuttaṃ. Tasmā yadi rājādayo issarāti gahetvā aññassa deyyuṃ, tampi dānaṃ adhammikadānaṃ hoti, taṃ dānaṃ paṭiggahā ca adhammikapaṭiggahā honti, taṃ dānaṃ paribhuñjantā ca adhammikaparibhogā hontīti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Athāpi evaṃ vadeyyuṃ ‘‘vihāradānaṃ saṅghassa, aggaṃ buddhena vaṇṇitantiādīsu (cūḷava. 295, 315) ‘saṅghassā’ti ayaṃ saddo ‘dāna’nti ettha sāmisambandho na hoti, atha kho sampadānameva, ‘dāyakassā’ti pana sāmisambandho ajjhāharitabbo, tasmā sāmibhūto dāyakova issaro, na sampadānabhūto saṅgho’’ti. Te evaṃ vattabbā – ‘‘vihāradānaṃ saṅghassā’’ti idaṃ dānasamaye pavattavasena vuttaṃ, na dinnasamaye pavattavasena. Dānakāle hi dāyako attano vatthubhūtaṃ vihāraṃ saṅghassa pariccajitvā deti, tasmā tasmiṃ samaye dāyako sāmī hoti, saṅgho sampadānaṃ, dinnakāle pana saṅghova sāmī hoti vihārassa paṭiggahitattā, na dāyako pariccattattā, tasmā saṅgho vicāretuṃ issaro. Tenāha bhagavā ‘‘pariccattaṃ taṃ, bhikkhave, dāyakehī’’ti (cūḷava. 273). Idaṃ pana saddalakkhaṇagarukā saddahissantīti vuttaṃ, atthato pana cīvarādīnaṃ catunnaṃ paccayānaṃ dānakāleyeva dāyakasantakabhāvo dinnakālato paṭṭhāya paṭiggāhakasantakabhāvo sabbesaṃ pākaṭo, tasmā idampi vacanaṃ dāyakasantakabhāvasādhakaṃ na hotīti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ hotu, tathāpi ‘‘sace bhikkhūhi pariccattabhāvaṃ ñatvā sāmiko vā tassa puttadhītaro ",
      " vā añño vā koci vaṃse uppanno puna kappiyavohārena deti, vaṭṭatī’’ti aṭṭhakathāyaṃ (pārā. aṭṭha. 2.538-539) vuttattā vihārassāmikabhūtadāyakassa vā tassa puttadhītādīnaṃ vaṃse uppannānaṃ vā dātuṃ issarabhāvo siddhoyevāti. Na siddho. Kasmāti ce? Nanu vuttaṃ ‘‘bhikkhūhi pariccattabhāvaṃ ñatvā’’ti, tasmā akappiyattā bhikkhūhi pariccattameva kappiyakaraṇatthāya dāyakādīhi puna ",
      " kappiyavohārena deti, vaṭṭati. Yathā appaṭiggahitattā bhikkhūhi aparibhuttameva khādanīyabhojanīyaṃ bhikkhusantakaṃyeva āpattimocanatthaṃ dāyakādayo paṭiggahāpeti, na paribhuttaṃ, yathā ca bījagāmapariyāpannaṃyeva bhikkhusantakaṃ bījagāmabhūtagāmabhāvato parimocanatthaṃ kappiyakārakādayo kappiyaṃ karonti, na apariyāpannaṃ, evaṃ akappiyaṃ bhikkhūhi pariccattaṃyeva taḷākādikaṃ kappiyakaraṇatthaṃ dāyakādayo puna denti, na apariccattaṃ, tasmā idampi vacanaṃ kappiyakaraṇattaṃyeva sādheti, na issarattanti viññāyati."
    ],
    "innerText": "Evaṃ hotu, tathāpi ‘‘sace bhikkhūhi pariccattabhāvaṃ ñatvā sāmiko vā tassa puttadhītaro vā añño vā koci vaṃse uppanno puna kappiyavohārena deti, vaṭṭatī’’ti aṭṭhakathāyaṃ (pārā. aṭṭha. 2.538-539) vuttattā vihārassāmikabhūtadāyakassa vā tassa puttadhītādīnaṃ vaṃse uppannānaṃ vā dātuṃ issarabhāvo siddhoyevāti. Na siddho. Kasmāti ce? Nanu vuttaṃ ‘‘bhikkhūhi pariccattabhāvaṃ ñatvā’’ti, tasmā akappiyattā bhikkhūhi pariccattameva kappiyakaraṇatthāya dāyakādīhi puna kappiyavohārena deti, vaṭṭati. Yathā appaṭiggahitattā bhikkhūhi aparibhuttameva khādanīyabhojanīyaṃ bhikkhusantakaṃyeva āpattimocanatthaṃ dāyakādayo paṭiggahāpeti, na paribhuttaṃ, yathā ca bījagāmapariyāpannaṃyeva bhikkhusantakaṃ bījagāmabhūtagāmabhāvato parimocanatthaṃ kappiyakārakādayo kappiyaṃ karonti, na apariyāpannaṃ, evaṃ akappiyaṃ bhikkhūhi pariccattaṃyeva taḷākādikaṃ kappiyakaraṇatthaṃ dāyakādayo puna denti, na apariccattaṃ, tasmā idampi vacanaṃ kappiyakaraṇattaṃyeva sādheti, na issarattanti viññāyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Tathāpi evaṃ vadeyyuṃ ‘‘jātibhūmiyaṃ jātibhūmikā upāsakā āyasmantaṃ dhammikattheraṃ sattahi jātibhūmikavihārehi pabbājayiṃsūti vacanato dāyako vihārassa issaroti viññāyati. Issarattāyeva hi te theraṃ pabbājetuṃ sakkā, no anissarā’’ti, na kho panevaṃ daṭṭhabbaṃ. Kasmā? ‘‘Jātibhūmikā upāsakā’’icceva hi vuttaṃ, na ‘‘vihāradāyakā’’ti, tasmā tasmiṃ dese vasantā bahavo upāsakā āyasmantaṃ dhammikattheraṃ ayuttacārittā sakalasattavihārato pabbājayiṃsu, na attano vihāradāyakabhāvena issarattā, tasmā idampi udāharaṇaṃ na issarabhāvadīpakaṃ, atha kho aparādhānurūpakaraṇabhāvadīpakanti daṭṭhabbaṃ. Evaṃ yadā dāyako vihāraṃ patiṭṭhāpetvā deti, tassa muñcacetanaṃ patvā dinnakālato paṭṭhāya so vā tassa vaṃse uppanno vā janapadassāmikarājādayo vā issarā bhavituṃ vā vicāretuṃ vā na labhanti, paṭiggāhakabhūto saṅgho vā gaṇo vā puggalo vā soyeva issaro bhavituṃ vā vicāretuṃ vā labhatīti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha dāyakādīnaṃ issaro bhavituṃ alabhanabhāvo kathaṃ viññāyatīti ce? ‘‘Vatthupariccāgalakkhaṇattā dānassa, pathavādivatthupariccāgena ",
      " ca puna gahaṇassa ayuttattā’’ti vimativinodaniyaṃ vacanato ‘‘anujānāmi, bhikkhave, yaṃ dīyamānaṃ patati, taṃ sāmaṃ gahetvā paribhuñjituṃ, pariccattaṃ taṃ, bhikkhave, dāyakehī’’ti (cūḷava. 273) bhagavatā vuttattā ca ‘‘pariccattaṃ taṃ, bhikkhave, dāyakehīti vacanena panettha parasantakābhāvo dīpito’’ti aṭṭhakathāyaṃ ",
      " vuttattā ca viññāyati. Saṅghādīnaṃ issaro bhavituṃ labhanabhāvo kathaṃ ñātabboti ce? Saṅghiko nāma vihāro saṅghassa dinno hoti pariccatto, ‘‘puggalike puggalikasaññī aññassa puggalike āpatti dukkaṭassa, attano puggalike anāpattī’’ti pācittiyapāḷiyaṃ (pāci. 117, 127) āgamanato ca ‘‘antamaso caturaṅgulapādakaṃ gāmadārakehi paṃsvāgārakesu kīḷantehi katampi saṅghassa dinnato paṭṭhāya garubhaṇḍaṃ hotī’’ti (cūḷava. aṭṭha. 321) samantapāsādikāyaṃ vacanato ca ‘‘abhiyogepi cettha cātuddisaṃ saṅghaṃ uddissa bhikkhūnaṃ dinnaṃ vihāraṃ vā pariveṇaṃ vā āvāsaṃ vā mahantampi khuddakampi abhiyuñjato abhiyogo na ruhati, acchinditvā gaṇhitumpi na sakkoti. Kasmā? Sabbesaṃ dhuranikkhepābhāvato. Na hettha sabbe cātuddisā bhikkhū dhuranikkhepaṃ karontīti. Dīghabhāṇakādibhedassa pana gaṇassa ekapuggalassa vā santakaṃ abhiyuñjitvā gaṇhanto sakkoti te dhuraṃ nikkhipāpetu’’nti dutiyapārājikavaṇṇanāyaṃ (pārā. aṭṭha. 1.102) vacanato ca viññāyati."
    ],
    "innerText": "Tattha dāyakādīnaṃ issaro bhavituṃ alabhanabhāvo kathaṃ viññāyatīti ce? ‘‘Vatthupariccāgalakkhaṇattā dānassa, pathavādivatthupariccāgena ca puna gahaṇassa ayuttattā’’ti vimativinodaniyaṃ vacanato ‘‘anujānāmi, bhikkhave, yaṃ dīyamānaṃ patati, taṃ sāmaṃ gahetvā paribhuñjituṃ, pariccattaṃ taṃ, bhikkhave, dāyakehī’’ti (cūḷava. 273) bhagavatā vuttattā ca ‘‘pariccattaṃ taṃ, bhikkhave, dāyakehīti vacanena panettha parasantakābhāvo dīpito’’ti aṭṭhakathāyaṃ vuttattā ca viññāyati. Saṅghādīnaṃ issaro bhavituṃ labhanabhāvo kathaṃ ñātabboti ce? Saṅghiko nāma vihāro saṅghassa dinno hoti pariccatto, ‘‘puggalike puggalikasaññī aññassa puggalike āpatti dukkaṭassa, attano puggalike anāpattī’’ti pācittiyapāḷiyaṃ (pāci. 117, 127) āgamanato ca ‘‘antamaso caturaṅgulapādakaṃ gāmadārakehi paṃsvāgārakesu kīḷantehi katampi saṅghassa dinnato paṭṭhāya garubhaṇḍaṃ hotī’’ti (cūḷava. aṭṭha. 321) samantapāsādikāyaṃ vacanato ca ‘‘abhiyogepi cettha cātuddisaṃ saṅghaṃ uddissa bhikkhūnaṃ dinnaṃ vihāraṃ vā pariveṇaṃ vā āvāsaṃ vā mahantampi khuddakampi abhiyuñjato abhiyogo na ruhati, acchinditvā gaṇhitumpi na sakkoti. Kasmā? Sabbesaṃ dhuranikkhepābhāvato. Na hettha sabbe cātuddisā bhikkhū dhuranikkhepaṃ karontīti. Dīghabhāṇakādibhedassa pana gaṇassa ekapuggalassa vā santakaṃ abhiyuñjitvā gaṇhanto sakkoti te dhuraṃ nikkhipāpetu’’nti dutiyapārājikavaṇṇanāyaṃ (pārā. aṭṭha. 1.102) vacanato ca viññāyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ dāyakādīnaṃ vicāretuṃ alabhanabhāvo viññāyatīti ce? Santesupi veḷuvanavihārādidāyakesu tesaṃ vicāraṇaṃ ananujānitvā ‘‘anujānāmi, bhikkhave, pañcahaṅgehi samannāgataṃ bhikkhuṃ senāsanaggāhāpakaṃ sammannitu’’nti bhikkhusseva senāsanaggāhāpakasammutianujānato ca bhaṇḍanakārakesu ",
      " kosambakabhikkhūsu sāvatthiṃ āgatesu anāthapiṇḍikena ca visākhāya mahāupāsikāya ca ‘‘kathāhaṃ, bhante, tesu bhikkhūsu paṭipajjāmī’’ti (mahāva. 468) evaṃ jetavanavihāradāyakapubbārāmavihāradāyakabhūtesu ārocitesupi tesaṃ senāsanavicāraṇaṃ avatvā āyasmatā sāriputtattherena ‘‘kathaṃ nu kho, bhante, tesu bhikkhūsu senāsane paṭipajjitabba’’nti ārocite ‘‘tena hi, sāriputta, vivittaṃ senāsanaṃ dātabba’’nti vatvā ‘‘sace pana, bhante, vivittaṃ na hoti, kathaṃ paṭipajjitabba’’nti vutte ‘‘tena hi vivittaṃ katvāpi dātabbaṃ, na tvevāhaṃ, sāriputta, kenaci pariyāyena vuḍḍhatarassa bhikkhuno senāsanaṃ paṭibāhitabbanti vadāmi, yo paṭibāheyya, āpatti dukkaṭassā’’ti (mahāva. 473) therasseva senāsanassa vicāraṇassa anuññātattā ca viññāyati."
    ],
    "innerText": "Kathaṃ dāyakādīnaṃ vicāretuṃ alabhanabhāvo viññāyatīti ce? Santesupi veḷuvanavihārādidāyakesu tesaṃ vicāraṇaṃ ananujānitvā ‘‘anujānāmi, bhikkhave, pañcahaṅgehi samannāgataṃ bhikkhuṃ senāsanaggāhāpakaṃ sammannitu’’nti bhikkhusseva senāsanaggāhāpakasammutianujānato ca bhaṇḍanakārakesu kosambakabhikkhūsu sāvatthiṃ āgatesu anāthapiṇḍikena ca visākhāya mahāupāsikāya ca ‘‘kathāhaṃ, bhante, tesu bhikkhūsu paṭipajjāmī’’ti (mahāva. 468) evaṃ jetavanavihāradāyakapubbārāmavihāradāyakabhūtesu ārocitesupi tesaṃ senāsanavicāraṇaṃ avatvā āyasmatā sāriputtattherena ‘‘kathaṃ nu kho, bhante, tesu bhikkhūsu senāsane paṭipajjitabba’’nti ārocite ‘‘tena hi, sāriputta, vivittaṃ senāsanaṃ dātabba’’nti vatvā ‘‘sace pana, bhante, vivittaṃ na hoti, kathaṃ paṭipajjitabba’’nti vutte ‘‘tena hi vivittaṃ katvāpi dātabbaṃ, na tvevāhaṃ, sāriputta, kenaci pariyāyena vuḍḍhatarassa bhikkhuno senāsanaṃ paṭibāhitabbanti vadāmi, yo paṭibāheyya, āpatti dukkaṭassā’’ti (mahāva. 473) therasseva senāsanassa vicāraṇassa anuññātattā ca viññāyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ pana saṅghādīnaṃ senāsanaṃ vicāretuṃ labhanabhāvo viññāyatīti? ‘‘Evañca, bhikkhave, ",
      " sammannitabbo – paṭhamaṃ bhikkhu yācitabbo, yācitvā byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
    ],
    "innerText": "Kathaṃ pana saṅghādīnaṃ senāsanaṃ vicāretuṃ labhanabhāvo viññāyatīti? ‘‘Evañca, bhikkhave, sammannitabbo – paṭhamaṃ bhikkhu yācitabbo, yācitvā byattena bhikkhunā paṭibalena saṅgho ñāpetabbo –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Suṇātu me, bhante, saṅgho…pe… sammato saṅghena itthannāmo bhikkhu senāsanaggāhāpako, khamati saṅghassa, tasmā tuṇhī, evametaṃ dhārayāmīti (cūḷava. 317)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ saṅghena senāsanaggāhāpakaṃ sammannāpetvā puna tena saṅghasammatena senāsanaggāhāpakena senāsanaggāhakavidhānaṃ anujānituṃ anujānāmi, bhikkhave, paṭhamaṃ bhikkhū gaṇetuṃ, bhikkhū gaṇetvā seyyā gaṇetuṃ, seyyā gaṇetvā seyyaggena gāhetu’’nti vacanato saṅghikasenāsanassa ",
      " saṅghena vicāretuṃ labhanabhāvo viññāyati."
    ],
    "innerText": "Evaṃ saṅghena senāsanaggāhāpakaṃ sammannāpetvā puna tena saṅghasammatena senāsanaggāhāpakena senāsanaggāhakavidhānaṃ anujānituṃ anujānāmi, bhikkhave, paṭhamaṃ bhikkhū gaṇetuṃ, bhikkhū gaṇetvā seyyā gaṇetuṃ, seyyā gaṇetvā seyyaggena gāhetu’’nti vacanato saṅghikasenāsanassa saṅghena vicāretuṃ labhanabhāvo viññāyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "‘‘Dīghabhāṇakādibhedassa pana gaṇassa ekapuggalassa vā dinnavihārādiṃ acchinditvā gaṇhante dhuranikkhepasambhavā pārājika’’nti aṭṭhakathāyaṃ (pārā. aṭṭha. 1.102) āgamanato ca ‘‘attano puggalike anāpattī’’ti pāḷiyaṃ (pāci. 117) āgamanato ca ‘‘yasmiṃ pana vissāso ruhati, tassa santakaṃ attano puggalikamiva hotīti mahāpaccariādīsu vutta’’nti aṭṭhakathāyaṃ (pāci. aṭṭha. 112) vacanato ca gaṇassa dinno gaṇasantakavihāro gaṇeneva vicārīyate, no dāyakādīhi. Puggalassa dinno puggalikavihāropi paṭiggāhakapuggaleneva vicārīyate, no dāyakādīhīti viññāyati. Evaṃ vinayapāḷiyaṃ aṭṭhakathāṭīkāsu ca vihārassa saṅghikagaṇasantakapuggalikavasena tividhasseva vacanato ca tesaṃyeva saṅghagaṇapuggalānaṃ vihāravicāraṇassa anuññātattā ca dāyakasantakassa vihārassa visuṃ avuttattā ca dāyakānaṃ vihāravicāraṇassa ananuññātattā ca saṅghādayo eva vihārassa issarā honti, teyeva ca vicāretuṃ labhantīti daṭṭhabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ hotu, tesu paṭiggāhakabhūtesu saṅghagaṇapuggalesu so vihāro kassa santako hoti, kena ca vicāretabboti? Vuccate – saṅghikavihāre tāva ‘‘āgatānāgatassa cātuddisassa saṅghassa dammī’’ti dinnattā paṭiggāhakesu kālakatesupi tadañño cātuddisasaṅgho ca anāgatasaṅgho ca issaro, tassa santako, tena vicāretabbo. Gaṇasantake pana tasmiṃ gaṇe yāva ekopi atthi, tāva gaṇasantakova, tena avasiṭṭhena bhikkhunā vicāretabbo. Sabbesu kālakatesu ",
      " yadi sakalagaṇo vā taṃgaṇapariyāpannaavasiṭṭhapuggalo ",
      " vā jīvamānakāleyeva yassa kassaci dinno, yena ca vissāsaggāhavasena gahito, so issaro. Sacepi sakalagaṇo jīvamānakāleyeva aññagaṇassa vā saṅghassa vā puggalassa vā deti, te aññagaṇasaṅghapuggalā issarā honti. Puggalikavihāre pana so vihārassāmiko attano jīvamānakāleyeva saṅghassa vā gaṇassa vā puggalassa vā deti, te issarā honti. Yo vā pana tassa jīvamānasseva vissāsaggāhavasena gaṇhāti, sova issaro hotīti daṭṭhabbo."
    ],
    "innerText": "Evaṃ hotu, tesu paṭiggāhakabhūtesu saṅghagaṇapuggalesu so vihāro kassa santako hoti, kena ca vicāretabboti? Vuccate – saṅghikavihāre tāva ‘‘āgatānāgatassa cātuddisassa saṅghassa dammī’’ti dinnattā paṭiggāhakesu kālakatesupi tadañño cātuddisasaṅgho ca anāgatasaṅgho ca issaro, tassa santako, tena vicāretabbo. Gaṇasantake pana tasmiṃ gaṇe yāva ekopi atthi, tāva gaṇasantakova, tena avasiṭṭhena bhikkhunā vicāretabbo. Sabbesu kālakatesu yadi sakalagaṇo vā taṃgaṇapariyāpannaavasiṭṭhapuggalo vā jīvamānakāleyeva yassa kassaci dinno, yena ca vissāsaggāhavasena gahito, so issaro. Sacepi sakalagaṇo jīvamānakāleyeva aññagaṇassa vā saṅghassa vā puggalassa vā deti, te aññagaṇasaṅghapuggalā issarā honti. Puggalikavihāre pana so vihārassāmiko attano jīvamānakāleyeva saṅghassa vā gaṇassa vā puggalassa vā deti, te issarā honti. Yo vā pana tassa jīvamānasseva vissāsaggāhavasena gaṇhāti, sova issaro hotīti daṭṭhabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Kathaṃ viññāyatīti ce? Saṅghike vihārassa garubhaṇḍattā avissajjiyaṃ avebhaṅgikaṃ hoti, na kassaci dātabbaṃ. Gaṇasantakapuggalikesu pana tesaṃ sāmikattā dānavissāsaggāhā ruhanti, ‘‘tasmā so jīvamānoyeva sabbaṃ attano parikkhāraṃ nissajjitvā kassaci adāsi, koci vā vissāsaṃ aggahesi. Yassa dinnaṃ, yena ca gahitaṃ, tasseva hotī’’ti ca ‘‘dvinnaṃ santakaṃ hoti avibhattaṃ, ekasmiṃ kālakate itaro sāmī, bahūnampi santake eseva nayo’’ti (mahāva. aṭṭha. 369) ca aṭṭhakathāyaṃ vuttattā viññāyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ pana vissajjetvā adinnaṃ ‘‘mamaccayena asukassa hotū’’ti dānaṃ accayadānattā na ruhati. Vuttañhetaṃ aṭṭhakathāyaṃ (cūḷava. aṭṭha. 419) ‘‘sace hi pañcasu sahadhammikesu yo koci kālaṃ karonto ‘mamaccayena mayhaṃ parikkhāro upajjhāyassa hotu, ācariyassa hotu, saddhivihārikassa hotu, antevāsikassa hotu, mātu hotu, pitu hotu, aññassa vā kassaci hotū’ti vadati, tesaṃ na hoti, saṅghasseva hoti. Na hi pañcannaṃ sahadhammikānaṃ accayadānaṃ ruhati, gihīnaṃ pana ruhatī’’ti. Ettha ca ekacce pana vinayadharā ‘‘gihīnanti ",
      " padaṃ sampadānanti gahetvā bhikkhūnaṃ santakaṃ accayadānavasena gihīnaṃ dadante ruhati, pañcannaṃ pana sahadhammikānaṃ dento na ruhatī’’ti vadanti. Evaṃ sante mātāpitūnaṃ dadantopi ruheyya tesaṃ gihibhūtattā. ‘‘Atha ca pana ‘mātu hotu, pitu hotu, aññassa vā kassaci hotū’ti vadati, tesaṃ na hotī’’ti vacanato na ruhatīti viññāyati, tasmā ‘‘gihīnaṃ panā’’ti idaṃ na sampadānavacanaṃ, atha kho sāmivacanamevāti daṭṭhabbaṃ. Tena gihīnaṃ pana santakaṃ accayadānaṃ ruhatīti sambandho kātabbo."
    ],
    "innerText": "Evaṃ pana vissajjetvā adinnaṃ ‘‘mamaccayena asukassa hotū’’ti dānaṃ accayadānattā na ruhati. Vuttañhetaṃ aṭṭhakathāyaṃ (cūḷava. aṭṭha. 419) ‘‘sace hi pañcasu sahadhammikesu yo koci kālaṃ karonto ‘mamaccayena mayhaṃ parikkhāro upajjhāyassa hotu, ācariyassa hotu, saddhivihārikassa hotu, antevāsikassa hotu, mātu hotu, pitu hotu, aññassa vā kassaci hotū’ti vadati, tesaṃ na hoti, saṅghasseva hoti. Na hi pañcannaṃ sahadhammikānaṃ accayadānaṃ ruhati, gihīnaṃ pana ruhatī’’ti. Ettha ca ekacce pana vinayadharā ‘‘gihīnanti padaṃ sampadānanti gahetvā bhikkhūnaṃ santakaṃ accayadānavasena gihīnaṃ dadante ruhati, pañcannaṃ pana sahadhammikānaṃ dento na ruhatī’’ti vadanti. Evaṃ sante mātāpitūnaṃ dadantopi ruheyya tesaṃ gihibhūtattā. ‘‘Atha ca pana ‘mātu hotu, pitu hotu, aññassa vā kassaci hotū’ti vadati, tesaṃ na hotī’’ti vacanato na ruhatīti viññāyati, tasmā ‘‘gihīnaṃ panā’’ti idaṃ na sampadānavacanaṃ, atha kho sāmivacanamevāti daṭṭhabbaṃ. Tena gihīnaṃ pana santakaṃ accayadānaṃ ruhatīti sambandho kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kiñca bhiyyo – ‘‘sace hi pañcasu sahadhammikesu yo koci kālaṃ karonto mamaccayena ",
      " mayhaṃ parikkhāro’’ti ārabhitvā ‘‘na hi pañcannaṃ sahadhammikānaṃ accayadānaṃ ruhati, gihīnaṃ pana ruhatī’’ti vuttattā sāmyatthe chaṭṭhībahuvacanaṃ samatthitaṃ bhavati. Yadi evaṃ ‘‘gihīna’’nti padassa asampadānatte sati katamaṃ sampadānaṃ hotīti? ‘‘Yassa kassacī’’ti padaṃ. Vuttañhi aṭṭhakathāyaṃ (cūḷava. aṭṭha. 419) ‘‘mātu hotu, pitu hotu, aññassa vā kassaci hotū’’ti. Ayamattho ajjukavatthunā (pārā. 158) dīpetabbo. Evaṃ jīvamānakāleyeva datvā matesu vinicchayo amhehi ñāto, kassaci adatvā matesu vinicchayo kathaṃ ñātabboti? Tatthāpi saṅghike tāva heṭṭhā vuttanayena saṅghova issaro, gaṇasantake pana ekaccesu avasesā issarā, sabbesu matesu saṅghova issaro. Vuttañhi aṭṭhakathāyaṃ (mahāva. aṭṭha. 369) ‘‘sabbesu matesu saṅghikaṃ hotī’’ti. Puggalike pana vihārassa garubhaṇḍattā avissajjiyaṃ avebhaṅgikaṃ saṅghikameva hoti."
    ],
    "innerText": "Kiñca bhiyyo – ‘‘sace hi pañcasu sahadhammikesu yo koci kālaṃ karonto mamaccayena mayhaṃ parikkhāro’’ti ārabhitvā ‘‘na hi pañcannaṃ sahadhammikānaṃ accayadānaṃ ruhati, gihīnaṃ pana ruhatī’’ti vuttattā sāmyatthe chaṭṭhībahuvacanaṃ samatthitaṃ bhavati. Yadi evaṃ ‘‘gihīna’’nti padassa asampadānatte sati katamaṃ sampadānaṃ hotīti? ‘‘Yassa kassacī’’ti padaṃ. Vuttañhi aṭṭhakathāyaṃ (cūḷava. aṭṭha. 419) ‘‘mātu hotu, pitu hotu, aññassa vā kassaci hotū’’ti. Ayamattho ajjukavatthunā (pārā. 158) dīpetabbo. Evaṃ jīvamānakāleyeva datvā matesu vinicchayo amhehi ñāto, kassaci adatvā matesu vinicchayo kathaṃ ñātabboti? Tatthāpi saṅghike tāva heṭṭhā vuttanayena saṅghova issaro, gaṇasantake pana ekaccesu avasesā issarā, sabbesu matesu saṅghova issaro. Vuttañhi aṭṭhakathāyaṃ (mahāva. aṭṭha. 369) ‘‘sabbesu matesu saṅghikaṃ hotī’’ti. Puggalike pana vihārassa garubhaṇḍattā avissajjiyaṃ avebhaṅgikaṃ saṅghikameva hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ viññāyatīti ce? ‘‘Bhikkhussa, bhikkhave, kālakate saṅgho sāmī pattacīvare, apica gilānupaṭṭhākā bahūpakārā, anujānāmi ",
      ", bhikkhave, saṅghena ticīvarañca pattañca gilānupaṭṭhākānaṃ dātuṃ. Yaṃ tattha lahubhaṇḍaṃ lahuparikkhāraṃ, taṃ sammukhībhūtena saṅghena bhājetuṃ. Yaṃ tattha garubhaṇḍaṃ garuparikkhāraṃ, taṃ āgatānāgatassa cātuddisassa saṅghassa avissajjiyaṃ avebhaṅgika’’nti (mahāva. 369) tena bhagavatā jānatā passatā arahatā sammāsambuddhena vuttattā viññāyati. Evampi ‘‘garubhaṇḍaṃ garuparikkhāraṃ’’icceva bhagavatā vuttaṃ, na ‘‘vihāra’’nti, tasmā kathaṃ vihārassa garubhaṇḍabhāvoti viññāyatīti? ‘‘Vihāro vihāravatthu, idaṃ dutiyaṃ avebhaṅgika’’nti pāḷiyaṃ,"
    ],
    "innerText": "Kathaṃ viññāyatīti ce? ‘‘Bhikkhussa, bhikkhave, kālakate saṅgho sāmī pattacīvare, apica gilānupaṭṭhākā bahūpakārā, anujānāmi , bhikkhave, saṅghena ticīvarañca pattañca gilānupaṭṭhākānaṃ dātuṃ. Yaṃ tattha lahubhaṇḍaṃ lahuparikkhāraṃ, taṃ sammukhībhūtena saṅghena bhājetuṃ. Yaṃ tattha garubhaṇḍaṃ garuparikkhāraṃ, taṃ āgatānāgatassa cātuddisassa saṅghassa avissajjiyaṃ avebhaṅgika’’nti (mahāva. 369) tena bhagavatā jānatā passatā arahatā sammāsambuddhena vuttattā viññāyati. Evampi ‘‘garubhaṇḍaṃ garuparikkhāraṃ’’icceva bhagavatā vuttaṃ, na ‘‘vihāra’’nti, tasmā kathaṃ vihārassa garubhaṇḍabhāvoti viññāyatīti? ‘‘Vihāro vihāravatthu, idaṃ dutiyaṃ avebhaṅgika’’nti pāḷiyaṃ,"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Dvisaṅgahāni dve honti, tatiyaṃ catusaṅgahaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Catutthaṃ navakoṭṭhāsaṃ, pañcamaṃ aṭṭhabhedanaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Iti pañcahi rāsīhi, pañcanimmalalocano;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Pañcavīsavidhaṃ nātho, garubhaṇḍaṃ pakāsayī’’ti. (cūḷava. aṭṭha. 321) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Aṭṭhakathāyañca vuttattā viññāyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Iti ",
      " dāyako vihāraṃ katvā kulūpakabhikkhussa deti, tassa muñcacetanuppattito pubbakāle dāyako vihārassāmiko hoti, dātuṃ vā vicāretuṃ vā issaro, muñcacetanuppattito paṭṭhāya paṭiggāhakabhikkhu sāmiko hoti, paribhuñjituṃ vā aññesaṃ dātuṃ vā issaro. So puggalo attano jīvamānakkhaṇeyeva saddhivihārikādīnaṃ nissajjitvā deti, tadā te saddhivihārikādayo sāmikā honti, paribhuñjituṃ vā aññassa vā dātuṃ issarā. Yadi pana kassaci adatvāva kālaṃ karoti, tadā saṅghova tassa vihārassa sāmiko hoti, na dāyako vā puggalo vā, saṅghānumatiyā eva puggalo paribhuñjituṃ labhati, na attano issaravatāyāti daṭṭhabbo."
    ],
    "innerText": "Iti dāyako vihāraṃ katvā kulūpakabhikkhussa deti, tassa muñcacetanuppattito pubbakāle dāyako vihārassāmiko hoti, dātuṃ vā vicāretuṃ vā issaro, muñcacetanuppattito paṭṭhāya paṭiggāhakabhikkhu sāmiko hoti, paribhuñjituṃ vā aññesaṃ dātuṃ vā issaro. So puggalo attano jīvamānakkhaṇeyeva saddhivihārikādīnaṃ nissajjitvā deti, tadā te saddhivihārikādayo sāmikā honti, paribhuñjituṃ vā aññassa vā dātuṃ issarā. Yadi pana kassaci adatvāva kālaṃ karoti, tadā saṅghova tassa vihārassa sāmiko hoti, na dāyako vā puggalo vā, saṅghānumatiyā eva puggalo paribhuñjituṃ labhati, na attano issaravatāyāti daṭṭhabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Evaṃ ",
      " mūlatoyeva saṅghassa dinnattā saṅghikabhūtavihāro vā mūle gaṇapuggalānaṃ dinnattā gaṇasantakapuggalikabhūtopi tesaṃ gaṇapuggalānaṃ aññassa nissajjanavasena adatvā kālakatattā pacchā saṅghikabhāvaṃ pattavihāro vā saṅghena vicāretabbo hoti. Saṅghenapi bhagavato anumatiyā senāsanaggāhāpakaṃ sammannitvā gāhāpetabbo. Vuttañhetaṃ senāsanakkhandhake (cūḷava. 317) ‘‘atha kho bhikkhūnaṃ etadahosi ‘kena nu kho senāsanaṃ gāhetabba’nti. Bhagavato etamatthaṃ ārocesuṃ – ‘anujānāmi, bhikkhave, pañcahaṅgehi samannāgataṃ bhikkhuṃ senāsanaggāhāpakaṃ sammannitu’nti’’ādi."
    ],
    "innerText": "Evaṃ mūlatoyeva saṅghassa dinnattā saṅghikabhūtavihāro vā mūle gaṇapuggalānaṃ dinnattā gaṇasantakapuggalikabhūtopi tesaṃ gaṇapuggalānaṃ aññassa nissajjanavasena adatvā kālakatattā pacchā saṅghikabhāvaṃ pattavihāro vā saṅghena vicāretabbo hoti. Saṅghenapi bhagavato anumatiyā senāsanaggāhāpakaṃ sammannitvā gāhāpetabbo. Vuttañhetaṃ senāsanakkhandhake (cūḷava. 317) ‘‘atha kho bhikkhūnaṃ etadahosi ‘kena nu kho senāsanaṃ gāhetabba’nti. Bhagavato etamatthaṃ ārocesuṃ – ‘anujānāmi, bhikkhave, pañcahaṅgehi samannāgataṃ bhikkhuṃ senāsanaggāhāpakaṃ sammannitu’nti’’ādi."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Imasmiṃ ṭhāne ‘‘senāsanaggāho nāma vassakālavasena senāsanaggāho, utukālavasena senāsanaggāho, dhuvavāsavasena senāsanaggāhoti tividho hoti. Tesu vassakālavasena senāsanaggāho purimavassavasena senāsanaggāho, pacchimavassavasena senāsanaggāhoti duvidho. Utukālavasena senāsanaggāhopi antarāmuttakavasena senāsanaggāho, taṅkhaṇapaṭisallānavasena senāsanaggāhoti duvidho’’ti ācariyā vadanti, etaṃ pāḷiyā ca aṭṭhakathāya ca asamentaṃ viya dissati. Pāḷiyañhi (cūḷava. 318) ‘‘atha kho bhikkhūnaṃ etadahosi ‘kati nu kho senāsanaggāho’ti. Bhagavato etamatthaṃ ārocesuṃ – tayome, bhikkhave, senāsanaggāhā purimako pacchimako antarāmuttako. Aparajjugatāya āsāḷhiyā purimako gāhetabbo, māsagatāya āsāḷhiyā pacchimako gāhetabbo, aparajjugatāya pavāraṇāya āyatiṃ vassāvāsatthāya antarāmuttako gāhetabbo. Ime kho, bhikkhave, tayo senāsanaggāhā’’ti evaṃ āgato, aṭṭhakathāyampi ",
      " (cūḷava. aṭṭha. 318) ‘‘tīsu senāsanaggāhesu purimako ca pacchimako ",
      " cāti ime dve gāhā thāvarā. Antarāmuttake ayaṃ vinicchayo…pe… ayaṃ tāva antovasse vassūpanāyikādivasena pāḷiyaṃ āgatasenāsanaggāhakathā, ayaṃ pana senāsanaggāho nāma duvidho hoti utukāle ca vassāvāse cā’’ti evaṃ āgato, tasmā saṅghena sammatasenāsanaggāhāpakena vicāretabbā."
    ],
    "innerText": "Imasmiṃ ṭhāne ‘‘senāsanaggāho nāma vassakālavasena senāsanaggāho, utukālavasena senāsanaggāho, dhuvavāsavasena senāsanaggāhoti tividho hoti. Tesu vassakālavasena senāsanaggāho purimavassavasena senāsanaggāho, pacchimavassavasena senāsanaggāhoti duvidho. Utukālavasena senāsanaggāhopi antarāmuttakavasena senāsanaggāho, taṅkhaṇapaṭisallānavasena senāsanaggāhoti duvidho’’ti ācariyā vadanti, etaṃ pāḷiyā ca aṭṭhakathāya ca asamentaṃ viya dissati. Pāḷiyañhi (cūḷava. 318) ‘‘atha kho bhikkhūnaṃ etadahosi ‘kati nu kho senāsanaggāho’ti. Bhagavato etamatthaṃ ārocesuṃ – tayome, bhikkhave, senāsanaggāhā purimako pacchimako antarāmuttako. Aparajjugatāya āsāḷhiyā purimako gāhetabbo, māsagatāya āsāḷhiyā pacchimako gāhetabbo, aparajjugatāya pavāraṇāya āyatiṃ vassāvāsatthāya antarāmuttako gāhetabbo. Ime kho, bhikkhave, tayo senāsanaggāhā’’ti evaṃ āgato, aṭṭhakathāyampi (cūḷava. aṭṭha. 318) ‘‘tīsu senāsanaggāhesu purimako ca pacchimako cāti ime dve gāhā thāvarā. Antarāmuttake ayaṃ vinicchayo…pe… ayaṃ tāva antovasse vassūpanāyikādivasena pāḷiyaṃ āgatasenāsanaggāhakathā, ayaṃ pana senāsanaggāho nāma duvidho hoti utukāle ca vassāvāse cā’’ti evaṃ āgato, tasmā saṅghena sammatasenāsanaggāhāpakena vicāretabbā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Senāsanaggāho nāma utukāle senāsanaggāho, vassāvāse senāsanaggāhoti duvidho. Tattha utukālo nāma hemantautugimhautuvasena aṭṭha māsā, tasmiṃ kāle bhikkhū aniyatāvāsā honti, tasmā ye yadā āgacchanti, tesaṃ tadā bhikkhū uṭṭhāpetvā senāsanaṃ dātabbaṃ, akālo nāma natthi. Ayaṃ utukāle senāsanaggāho nāma. Vassāvāse senāsanaggāho pana ‘‘purimako pacchimako antarāmuttako’’ti pāḷiyaṃ āgatanayena tividho hoti. Antarāmuttakopi hi āyatiṃ vassāvāsatthāya gāhitattā vassāvāse senāsanaggāhameva pavisati, na utukāle senāsanaggāho. Vuttañhi bhagavatā ‘‘aparajjugatāya pavāraṇāya āyatiṃ vassāvāsatthāya antarāmuttako gāhetabbo’’ti. Taṅkhaṇapaṭisallānavasena senāsanaggāhoti ca neva pāḷiyaṃ na aṭṭhakathāyaṃ visuṃ āgato, utukāle senāsanaggāhoyeva tadaṅgasenāsanaggāhotipi taṅkhaṇapaṭisallānavasena senāsanaggāhotipi vadanti, tasmā utukālavasena senāsanaggāhopi ‘‘antarāmuttakavasena senāsanaggāho taṅkhaṇapaṭisallānavasena senāsanaggāhoti dubbidho’’ti na vattabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Athāpi ",
      " vadanti ‘‘yathāvuttesu pañcasu senāsanaggāhesu cattāro senāsanaggāhā pañcaṅgasamannāgatena senāsanaggāhāpakasammutiladdhena bhikkhunā antoupacārasīmaṭṭhena hutvā antosīmaṭṭhānaṃ bhikkhūnaṃ yathāvinayaṃ vicāretabbā honti, te pana vicāraṇā yāvajjakālā thāvarā hutvā na tiṭṭhanti, dhuvavāsavasena vicāraṇameva yāvajjakālā thāvaraṃ hutvā tiṭṭhatī’’ti, tampi tathā na sakkā vattuṃ. Kasmā? Senāsanaggāhāpakabhede ‘‘dhuvavāsavasena senāsanaggāho’’ti pāḷiyaṃ aṭṭhakathāyañca natthi. Dhuvavāsavasena vicāraṇañca sammutiladdhena senāsanaggāhāpakena vicāretabbaṃ na hoti, atha kho samaggena saṅghena apalokanakammavasena duvaṅgasamannāgatassa bhikkhussa anuṭṭhāpanīyaṃ katvā dānameva, tasmā samaggo saṅgho bahūpakāratāguṇavisiṭṭhatāsaṅkhātehi dvīhi aṅgehi samannāgataṃ bhikkhuṃ apalokanakammavasena sammannitvā ",
      " tassa phāsukaṃ āvāsaṃ dhuvavāsavasena anuṭṭhāpanīyaṃ katvā deti, taṃ yāvajjakālā thāvaraṃ hutvā tiṭṭhatīti vattabbaṃ."
    ],
    "innerText": "Athāpi vadanti ‘‘yathāvuttesu pañcasu senāsanaggāhesu cattāro senāsanaggāhā pañcaṅgasamannāgatena senāsanaggāhāpakasammutiladdhena bhikkhunā antoupacārasīmaṭṭhena hutvā antosīmaṭṭhānaṃ bhikkhūnaṃ yathāvinayaṃ vicāretabbā honti, te pana vicāraṇā yāvajjakālā thāvarā hutvā na tiṭṭhanti, dhuvavāsavasena vicāraṇameva yāvajjakālā thāvaraṃ hutvā tiṭṭhatī’’ti, tampi tathā na sakkā vattuṃ. Kasmā? Senāsanaggāhāpakabhede ‘‘dhuvavāsavasena senāsanaggāho’’ti pāḷiyaṃ aṭṭhakathāyañca natthi. Dhuvavāsavasena vicāraṇañca sammutiladdhena senāsanaggāhāpakena vicāretabbaṃ na hoti, atha kho samaggena saṅghena apalokanakammavasena duvaṅgasamannāgatassa bhikkhussa anuṭṭhāpanīyaṃ katvā dānameva, tasmā samaggo saṅgho bahūpakāratāguṇavisiṭṭhatāsaṅkhātehi dvīhi aṅgehi samannāgataṃ bhikkhuṃ apalokanakammavasena sammannitvā tassa phāsukaṃ āvāsaṃ dhuvavāsavasena anuṭṭhāpanīyaṃ katvā deti, taṃ yāvajjakālā thāvaraṃ hutvā tiṭṭhatīti vattabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Samaggo saṅghova dhuvavāsavasena deti, na senāsanaggāhāpakoti ayamattho kathaṃ ñātabboti ce? ‘‘Saṅgho pana bhaṇḍāgārikassa vā dhammakathikavinayadharādīnaṃ vā gaṇavācakaācariyassa vā bahūpakārataṃ guṇavisiṭṭhatañca sallakkhento dhuvavāsatthāya vihāraṃ sammannitvā detī’’ti (pāci. aṭṭha. 120; kaṅkhā. aṭṭha. anupakhajjasikkhāpadavaṇṇanā) ‘‘saṅgho pana bahussutassa uddesaparipucchādīhi bahūpakārassa bhāranitthārakassa phāsukaṃ āvāsaṃ anuṭṭhāpanīyaṃ katvā detī’’ti ca ‘‘saṅgho pana bhaṇḍāgārikassa vā dhammakathikavinayadharagaṇavācakācariyānaṃ vā bahūpakārataṃ guṇavisiṭṭhatañca sallakkhetvā dhuvavāsatthāya vihāraṃ sallakkhetvā sammannitvā detī’’ti ca ‘‘bahussutassa saṅghabhāranitthārakassa ",
      " bhikkhuno anuṭṭhāpanīyasenāsanampī’’ti (pari. aṭṭha. 495-496) ca ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘apalokanakammaṃ"
      },
      " nāma sīmaṭṭhakaṃ saṅghaṃ sodhetvā chandārahānaṃ chandaṃ āharitvā samaggassa saṅghassa anumatiyā tikkhattuṃ sāvetvā kattabbaṃ kamma’’nti ca aṭṭhakathāsu (pari. aṭṭha. 482) vacanato sādhukaṃ nissaṃsayena ñātabboti."
    ],
    "innerText": "Samaggo saṅghova dhuvavāsavasena deti, na senāsanaggāhāpakoti ayamattho kathaṃ ñātabboti ce? ‘‘Saṅgho pana bhaṇḍāgārikassa vā dhammakathikavinayadharādīnaṃ vā gaṇavācakaācariyassa vā bahūpakārataṃ guṇavisiṭṭhatañca sallakkhento dhuvavāsatthāya vihāraṃ sammannitvā detī’’ti (pāci. aṭṭha. 120; kaṅkhā. aṭṭha. anupakhajjasikkhāpadavaṇṇanā) ‘‘saṅgho pana bahussutassa uddesaparipucchādīhi bahūpakārassa bhāranitthārakassa phāsukaṃ āvāsaṃ anuṭṭhāpanīyaṃ katvā detī’’ti ca ‘‘saṅgho pana bhaṇḍāgārikassa vā dhammakathikavinayadharagaṇavācakācariyānaṃ vā bahūpakārataṃ guṇavisiṭṭhatañca sallakkhetvā dhuvavāsatthāya vihāraṃ sallakkhetvā sammannitvā detī’’ti ca ‘‘bahussutassa saṅghabhāranitthārakassa bhikkhuno anuṭṭhāpanīyasenāsanampī’’ti (pari. aṭṭha. 495-496) ca ‘‘apalokanakammaṃ nāma sīmaṭṭhakaṃ saṅghaṃ sodhetvā chandārahānaṃ chandaṃ āharitvā samaggassa saṅghassa anumatiyā tikkhattuṃ sāvetvā kattabbaṃ kamma’’nti ca aṭṭhakathāsu (pari. aṭṭha. 482) vacanato sādhukaṃ nissaṃsayena ñātabboti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kathaṃ pana apalokanakammena dātabbabhāvo viññāyatīti? ‘‘Bahussutassa saṅghabhāranitthārakassa bhikkhuno anuṭṭhāpanīyasenāsanampi saṅghakiccaṃ karontānaṃ kappiyakārakādīnaṃ bhattavetanampi apalokanakammena dātuṃ vaṭṭatī’’ti parivāraṭṭhakathāyaṃ (pari. aṭṭha. 495-496) kammavagge āgatattā viññāyati. Kathaṃ pana duvaṅgasamannāgatassa bhikkhunoyeva dātabbabhāvo viññāyatīti? ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Bahūpakārata"
      },
      "nti bhaṇḍāgārikatādibahauupakārabhāvaṃ. Na kevalaṃ idamevāti āha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘guṇavisiṭṭhatañcā’"
      },
      "tiādi. Tena bahūpakārattepi guṇavisiṭṭhattābhāve, guṇavisiṭṭhattepi bahūpakārattābhāve dātuṃ na vaṭṭatīti dassetī’’ti vinayatthamañjūsāyaṃ (kaṅkhā. aṭṭha. ṭī. anupakhajjasikkhāpadavaṇṇanā) vuttattā viññāyati."
    ],
    "innerText": "Kathaṃ pana apalokanakammena dātabbabhāvo viññāyatīti? ‘‘Bahussutassa saṅghabhāranitthārakassa bhikkhuno anuṭṭhāpanīyasenāsanampi saṅghakiccaṃ karontānaṃ kappiyakārakādīnaṃ bhattavetanampi apalokanakammena dātuṃ vaṭṭatī’’ti parivāraṭṭhakathāyaṃ (pari. aṭṭha. 495-496) kammavagge āgatattā viññāyati. Kathaṃ pana duvaṅgasamannāgatassa bhikkhunoyeva dātabbabhāvo viññāyatīti? ‘‘Bahūpakāratanti bhaṇḍāgārikatādibahauupakārabhāvaṃ. Na kevalaṃ idamevāti āha ‘guṇavisiṭṭhatañcā’tiādi. Tena bahūpakārattepi guṇavisiṭṭhattābhāve, guṇavisiṭṭhattepi bahūpakārattābhāve dātuṃ na vaṭṭatīti dassetī’’ti vinayatthamañjūsāyaṃ (kaṅkhā. aṭṭha. ṭī. anupakhajjasikkhāpadavaṇṇanā) vuttattā viññāyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Kasmā pana senāsanaggāhāpakena vicāretabbo senāsanaggāho yāvajjakālā na tiṭṭhatīti? Pañcaṅgasamannāgatassa senāsanaggāhāpakassa bhikkhuno dullabhattā, nānādesavāsīnaṃ nānācariyakulasambhavānaṃ bhikkhūnaṃ ekasambhogaparibhogassa dukkarattā ca imehi dvīhi kāraṇehi ",
      " na tiṭṭhati. Vuttañhetaṃ bhagavatā ‘‘anujānāmi, bhikkhave, pañcahaṅgehi samannāgataṃ bhikkhuṃ senāsanaggāhāpakaṃ sammannituṃ, yo na chandāgatiṃ gaccheyya, na dosāgatiṃ gaccheyya, na mohāgatiṃ gaccheyya, na bhayāgatiṃ gaccheyya ",
      ", gahitāgahitañca jāneyyā’’ti (cūḷava. 317). Aṭṭhakathāyampi (pāci. aṭṭha. 122) ‘‘evarūpena hi sabhāgapuggalena ekavihāre vā ekapariveṇe vā vasantena attho natthī’’ti vuttaṃ. Kasmā pana dhuvavāsatthāya dānavicāro yāvajjakālā tiṭṭhatīti? Pañcaṅgasamannāgatābhāvepi sīmaṭṭhakassa samaggassa saṅghassa anumatiyā kattabbattā. Vuttañhi ‘‘apalokanakammaṃ nāma sīmaṭṭhakaṃ saṅghaṃ sodhetvā chandārahānaṃ chandaṃ āharitvā samaggassa saṅghassa anumatiyā tikkhattuṃ sāvetvā kattabbaṃ kamma’’nti (pari. aṭṭha. 482)."
    ],
    "innerText": "Kasmā pana senāsanaggāhāpakena vicāretabbo senāsanaggāho yāvajjakālā na tiṭṭhatīti? Pañcaṅgasamannāgatassa senāsanaggāhāpakassa bhikkhuno dullabhattā, nānādesavāsīnaṃ nānācariyakulasambhavānaṃ bhikkhūnaṃ ekasambhogaparibhogassa dukkarattā ca imehi dvīhi kāraṇehi na tiṭṭhati. Vuttañhetaṃ bhagavatā ‘‘anujānāmi, bhikkhave, pañcahaṅgehi samannāgataṃ bhikkhuṃ senāsanaggāhāpakaṃ sammannituṃ, yo na chandāgatiṃ gaccheyya, na dosāgatiṃ gaccheyya, na mohāgatiṃ gaccheyya, na bhayāgatiṃ gaccheyya , gahitāgahitañca jāneyyā’’ti (cūḷava. 317). Aṭṭhakathāyampi (pāci. aṭṭha. 122) ‘‘evarūpena hi sabhāgapuggalena ekavihāre vā ekapariveṇe vā vasantena attho natthī’’ti vuttaṃ. Kasmā pana dhuvavāsatthāya dānavicāro yāvajjakālā tiṭṭhatīti? Pañcaṅgasamannāgatābhāvepi sīmaṭṭhakassa samaggassa saṅghassa anumatiyā kattabbattā. Vuttañhi ‘‘apalokanakammaṃ nāma sīmaṭṭhakaṃ saṅghaṃ sodhetvā chandārahānaṃ chandaṃ āharitvā samaggassa saṅghassa anumatiyā tikkhattuṃ sāvetvā kattabbaṃ kamma’’nti (pari. aṭṭha. 482)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Utukāle saṅghikasenāsane vasantena āgato bhikkhu na paṭibāhetabbo aññatra anuṭṭhāpanīyā. Vuttañhi bhagavatā ‘‘anujānāmi, bhikkhave, vassānaṃ temāsaṃ paṭibāhituṃ, utukālaṃ pana na paṭibāhitu’’nti (cūḷava. 318). ‘‘Aññatra anuṭṭhāpanīyā’’ti vuttaṃ, katame anuṭṭhāpanīyāti? Cattāro anuṭṭhāpanīyā vuḍḍhataro, bhaṇḍāgāriko, gilāno, saṅghato laddhasenāsano ca. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "vuḍḍhataro"
      },
      " bhikkhu tasmiṃ vihāre antosīmaṭṭhakabhikkhūsu attanā vuḍḍhatarassa aññassa abhāvā yathāvuḍḍhaṃ kenaci anuṭṭhāpanīyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhaṇḍāgāriko"
      },
      " saṅghena sammannitvā bhaṇḍāgārassa dinnatāya saṅghassa bhaṇḍaṃ rakkhanto gopento vasati, tasmā so bhaṇḍāgāriko kenaci anuṭṭhāpanīyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Gilāno"
      },
      " gelaññābhibhūto attano laddhasenāsane vasanto kenaci anuṭṭhāpanīyo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saṅghato laddhasenāsano"
      },
      " samaggena saṅghena dinnasenāsanattā kenaci anuṭṭhāpanīyo. Vuttañhi aṭṭhakathāyaṃ (mahāva. aṭṭha. 343) ‘‘cattāro hi na vuṭṭhāpetabbā vuḍḍhataro, bhaṇḍāgāriko, gilāno, saṅghato laddhasenāsanoti. Tattha vuḍḍhataro attano vuḍḍhatāya navakatarena na ",
      " vuṭṭhāpetabbo, bhaṇḍāgāriko saṅghena sammannitvā bhaṇḍāgārassa dinnatāya, gilāno attano gilānatāya, saṅgho pana bahussutassa uddesaparipucchādīhi bahūpakārassa bhāranitthārakassa phāsukaṃ āvāsaṃ anuṭṭhāpanīyaṃ katvā deti, tasmā so upakārakatāya ca saṅghato laddhatāya ca na vuṭṭhāpetabbo’’ti. Ṭhapetvā ime cattāro avasesā vuṭṭhāpanīyāva honti."
    ],
    "innerText": "Utukāle saṅghikasenāsane vasantena āgato bhikkhu na paṭibāhetabbo aññatra anuṭṭhāpanīyā. Vuttañhi bhagavatā ‘‘anujānāmi, bhikkhave, vassānaṃ temāsaṃ paṭibāhituṃ, utukālaṃ pana na paṭibāhitu’’nti (cūḷava. 318). ‘‘Aññatra anuṭṭhāpanīyā’’ti vuttaṃ, katame anuṭṭhāpanīyāti? Cattāro anuṭṭhāpanīyā vuḍḍhataro, bhaṇḍāgāriko, gilāno, saṅghato laddhasenāsano ca. Tattha vuḍḍhataro bhikkhu tasmiṃ vihāre antosīmaṭṭhakabhikkhūsu attanā vuḍḍhatarassa aññassa abhāvā yathāvuḍḍhaṃ kenaci anuṭṭhāpanīyo. Bhaṇḍāgāriko saṅghena sammannitvā bhaṇḍāgārassa dinnatāya saṅghassa bhaṇḍaṃ rakkhanto gopento vasati, tasmā so bhaṇḍāgāriko kenaci anuṭṭhāpanīyo. Gilāno gelaññābhibhūto attano laddhasenāsane vasanto kenaci anuṭṭhāpanīyo. Saṅghato laddhasenāsano samaggena saṅghena dinnasenāsanattā kenaci anuṭṭhāpanīyo. Vuttañhi aṭṭhakathāyaṃ (mahāva. aṭṭha. 343) ‘‘cattāro hi na vuṭṭhāpetabbā vuḍḍhataro, bhaṇḍāgāriko, gilāno, saṅghato laddhasenāsanoti. Tattha vuḍḍhataro attano vuḍḍhatāya navakatarena na vuṭṭhāpetabbo, bhaṇḍāgāriko saṅghena sammannitvā bhaṇḍāgārassa dinnatāya, gilāno attano gilānatāya, saṅgho pana bahussutassa uddesaparipucchādīhi bahūpakārassa bhāranitthārakassa phāsukaṃ āvāsaṃ anuṭṭhāpanīyaṃ katvā deti, tasmā so upakārakatāya ca saṅghato laddhatāya ca na vuṭṭhāpetabbo’’ti. Ṭhapetvā ime cattāro avasesā vuṭṭhāpanīyāva honti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Aparasmiṃ bhikkhumhi āgate vuṭṭhāpetvā senāsanaṃ dāpetabbaṃ. Vuttañhi aṭṭhakathāyaṃ (cūḷava. aṭṭha. 318) ‘‘utukāle tāva keci āgantukā bhikkhū purebhattaṃ āgacchanti, keci ",
      " pacchābhattaṃ paṭhamayāmaṃ vā majjhimayāmaṃ vā pacchimayāmaṃ vā, ye yadā āgacchanti, tesaṃ tadāva bhikkhū uṭṭhāpetvā senāsanaṃ dātabbaṃ, akālo nāma natthī’’ti. Etarahi pana saddhā pasannā manussā vihāraṃ katvā appekacce paṇḍitānaṃ vacanaṃ sutvā ‘‘saṅghe dinnaṃ mahapphala’’nti ñatvā cātuddisaṃ saṅghaṃ ārabbha ‘‘imaṃ vihāraṃ āgatānāgatassa cātuddisassa saṅghassa demā’’ti vatvā denti, appekacce attanā pasannaṃ bhikkhuṃ ārabbha vihāraṃ katvāpi dānakāle tena uyyojitā hutvā cātuddisaṃ saṅghaṃ ārabbha vuttanayena denti, appekacce karaṇakālepi dānakālepi attano kulūpakabhikkhumeva ārabbha pariccajanti, tathāpi dakkhiṇodakapātanakāle tena sikkhāpitā yathāvuttapāṭhaṃ vacībhedaṃ karonti, cittena pana kulūpakasseva denti, na sabbasaṅghasādhāraṇatthaṃ icchanti."
    ],
    "innerText": "Aparasmiṃ bhikkhumhi āgate vuṭṭhāpetvā senāsanaṃ dāpetabbaṃ. Vuttañhi aṭṭhakathāyaṃ (cūḷava. aṭṭha. 318) ‘‘utukāle tāva keci āgantukā bhikkhū purebhattaṃ āgacchanti, keci pacchābhattaṃ paṭhamayāmaṃ vā majjhimayāmaṃ vā pacchimayāmaṃ vā, ye yadā āgacchanti, tesaṃ tadāva bhikkhū uṭṭhāpetvā senāsanaṃ dātabbaṃ, akālo nāma natthī’’ti. Etarahi pana saddhā pasannā manussā vihāraṃ katvā appekacce paṇḍitānaṃ vacanaṃ sutvā ‘‘saṅghe dinnaṃ mahapphala’’nti ñatvā cātuddisaṃ saṅghaṃ ārabbha ‘‘imaṃ vihāraṃ āgatānāgatassa cātuddisassa saṅghassa demā’’ti vatvā denti, appekacce attanā pasannaṃ bhikkhuṃ ārabbha vihāraṃ katvāpi dānakāle tena uyyojitā hutvā cātuddisaṃ saṅghaṃ ārabbha vuttanayena denti, appekacce karaṇakālepi dānakālepi attano kulūpakabhikkhumeva ārabbha pariccajanti, tathāpi dakkhiṇodakapātanakāle tena sikkhāpitā yathāvuttapāṭhaṃ vacībhedaṃ karonti, cittena pana kulūpakasseva denti, na sabbasaṅghasādhāraṇatthaṃ icchanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Imesu tīsu dānesu paṭhamaṃ pubbakālepi dānakālepi saṅghaṃ uddissa pavattattā sabbasaṅghikaṃ hoti. Dutiyaṃ pubbakāle puggalaṃ uddissa pavattamānampi dānakāle saṅghaṃ uddissa pavattattā saṅghikameva. Tatiyaṃ pana pubbakālepi dānakālepi ",
      " kulūpakapuggalameva uddissa pavattati, na saṅghaṃ, kevalaṃ bhikkhunā vuttānusāreneva vacībhedaṃ karonti. Evaṃ sante ‘‘kiṃ ayaṃ vihāro cittavasena puggaliko hoti, vacībhedavasena saṅghiko’’ti cintāyaṃ ekacce evaṃ vadeyyuṃ –"
    ],
    "innerText": "Imesu tīsu dānesu paṭhamaṃ pubbakālepi dānakālepi saṅghaṃ uddissa pavattattā sabbasaṅghikaṃ hoti. Dutiyaṃ pubbakāle puggalaṃ uddissa pavattamānampi dānakāle saṅghaṃ uddissa pavattattā saṅghikameva. Tatiyaṃ pana pubbakālepi dānakālepi kulūpakapuggalameva uddissa pavattati, na saṅghaṃ, kevalaṃ bhikkhunā vuttānusāreneva vacībhedaṃ karonti. Evaṃ sante ‘‘kiṃ ayaṃ vihāro cittavasena puggaliko hoti, vacībhedavasena saṅghiko’’ti cintāyaṃ ekacce evaṃ vadeyyuṃ –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Manopubbaṅgamā dhammā, manoseṭṭhā manomayā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Manasā ce pasannena, bhāsati vā karoti vā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Tato naṃ sukhamanveti, chāyāva anapāyinīti. (dha. pa. 2) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Vacanato cittavasena puggaliko hotī’’ti. Aññe ‘‘yathā dāyakā vadanti, tathā paṭipajjitabbanti (cūḷava. aṭṭha. 325) vacanato vacībhedavasena saṅghiko hotī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tatrāyaṃ vicāraṇā – idaṃ dānaṃ pubbe puggalassa pariṇataṃ pacchā saṅghassa pariṇāmitaṃ, tasmā ‘‘saṅghiko’’ti vutte navasu adhammikadānesu ‘‘puggalassa pariṇataṃ saṅghassa pariṇāmetī’’ti (pārā. 660) vuttaṃ aṭṭhamaṃ adhammikadānaṃ hoti, tassa dānassa paṭiggahāpi paribhogāpi adhammikapaṭiggahā adhammikaparibhogā honti. ‘‘Puggaliko’’ti vutte tīsu dhammikadānesu ‘‘puggalassa dinnaṃ puggalasseva detī’’ti vuttaṃ tatiyadhammikadānaṃ hoti, tassa ",
      " paṭiggahāpi paribhogāpi dhammikapaṭiggahā dhammikaparibhogā honti, tasmā puggalikapakkhaṃ bhajati. Appekacce suttantikādigaṇe pasīditvā vihāraṃ kāretvā gaṇassa denti ‘‘imaṃ vihāraṃ āyasmantānaṃ dammī’’ti. Appekacce puggale pasīditvā vihāraṃ katvā puggalassa denti ‘‘imaṃ vihāraṃ āyasmato dammī’’ti. Ete pana gaṇasantakapuggalikā vihārā dānakālato paṭṭhāya paṭiggāhakasantakāva honti, na dāyakasantakā. Tesu gaṇasantako tāva ekaccesu matesu avasesānaṃ santako, tesu dharamānesuyeva ",
      " kassaci denti, tassa santako. Kassaci adatvā sabbesu matesu saṅghiko hoti. Vuttañhi aṭṭhakathāyaṃ (mahāva. aṭṭha. 369) ‘‘dvinnaṃ santakaṃ hoti avibhattaṃ, ekasmiṃ kālakate itaro sāmī, bahūnaṃ santakepi eseva nayo. Sabbesu matesu saṅghikaṃva hotī’’ti."
    ],
    "innerText": "Tatrāyaṃ vicāraṇā – idaṃ dānaṃ pubbe puggalassa pariṇataṃ pacchā saṅghassa pariṇāmitaṃ, tasmā ‘‘saṅghiko’’ti vutte navasu adhammikadānesu ‘‘puggalassa pariṇataṃ saṅghassa pariṇāmetī’’ti (pārā. 660) vuttaṃ aṭṭhamaṃ adhammikadānaṃ hoti, tassa dānassa paṭiggahāpi paribhogāpi adhammikapaṭiggahā adhammikaparibhogā honti. ‘‘Puggaliko’’ti vutte tīsu dhammikadānesu ‘‘puggalassa dinnaṃ puggalasseva detī’’ti vuttaṃ tatiyadhammikadānaṃ hoti, tassa paṭiggahāpi paribhogāpi dhammikapaṭiggahā dhammikaparibhogā honti, tasmā puggalikapakkhaṃ bhajati. Appekacce suttantikādigaṇe pasīditvā vihāraṃ kāretvā gaṇassa denti ‘‘imaṃ vihāraṃ āyasmantānaṃ dammī’’ti. Appekacce puggale pasīditvā vihāraṃ katvā puggalassa denti ‘‘imaṃ vihāraṃ āyasmato dammī’’ti. Ete pana gaṇasantakapuggalikā vihārā dānakālato paṭṭhāya paṭiggāhakasantakāva honti, na dāyakasantakā. Tesu gaṇasantako tāva ekaccesu matesu avasesānaṃ santako, tesu dharamānesuyeva kassaci denti, tassa santako. Kassaci adatvā sabbesu matesu saṅghiko hoti. Vuttañhi aṭṭhakathāyaṃ (mahāva. aṭṭha. 369) ‘‘dvinnaṃ santakaṃ hoti avibhattaṃ, ekasmiṃ kālakate itaro sāmī, bahūnaṃ santakepi eseva nayo. Sabbesu matesu saṅghikaṃva hotī’’ti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Puggalikavihāropi yadi so paṭiggāhakapuggalo attano jīvamānakāleyeva saddhivihārikādīnaṃ deti, koci vā tassa vissāsena taṃ vihāraṃ aggahesi, tassa santako hoti. Kassaci adatvā kālakate saṅghiko hoti. Vuttañhi aṭṭhakathāyaṃ ‘‘so jīvamānoyeva sabbaṃ attano parikkhāraṃ nissajjitvā kassaci adāsi, koci vā vissāsaṃ aggahesi. Yassa dinno, yena ca gahito, tasseva hotī’’ti. Pāḷiyañca (mahāva. 369) ‘‘bhikkhussa, bhikkhave, kālakate saṅgho sāmī pattacīvare, apica gilānupaṭṭhākā bahūpakārā. Anujānāmi, bhikkhave, saṅghena ticīvarañca pattañca gilānupaṭṭhākānaṃ dātuṃ, yaṃ tattha lahubhaṇḍaṃ lahuparikkhāraṃ, taṃ sammukhībhūtena saṅghena bhājetuṃ, yaṃ tattha garubhaṇḍaṃ garuparikkhāraṃ, taṃ āgatānāgatassa cātuddisassa saṅghassa avissajjiyaṃ avebhaṅgika’’nti (mahāva. 369) vuttaṃ, tasmā iminā nayena vinicchayo kātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Saṅghike pana pāḷiyaṃ āgatānaṃ ‘‘purimako pacchimako antarāmuttako cā’’ti (cūḷava. 318) vuttānaṃ tiṇṇaṃ senāsanaggāhānañca aṭṭhakathāyaṃ (cūḷava. aṭṭha. 318) āgatānaṃ ‘‘utukāle ca vassāvāse cā’’ti vuttānaṃ dvinnaṃ senāsanaggāhānañca etarahi asampajjanato anuṭṭhāpanīyapāḷiyaṃ āgatassa attano sabhāvena anuṭṭhāpanīyassa dhuvavāsatthāya saṅghena dinnatāya anuṭṭhāpanīyassa vaseneva vinicchayo hoti. Vuḍḍhataragilānā hi ",
      " attano sabhāvena anuṭṭhāpanīyā honti. Vuttañhetaṃ aṭṭhakathāyaṃ (mahāva. aṭṭha. 343) ‘‘vuḍḍhataro attano vuḍḍhatāya navakatarena na vuṭṭhāpetabbo, gilāno attano gilānatāyā’’ti. Bhaṇḍāgārikadhammakathikādayo ",
      " dhuvavāsatthāya saṅghena dinnatāya anuṭṭhāpanīyā honti. Vuttañhi ‘‘saṅgho pana bhaṇḍāgārikassa vā dhammakathikavinayadharādīnaṃ vā…pe… dhuvavāsatthāya vihāraṃ sammannitvā deti, tasmā yassa saṅghena dinno, sopi anuṭṭhāpanīyo’’ti (pāci. aṭṭha. 120; kaṅkhā. aṭṭha. anupakhajjasikkhāpadavaṇṇanā). So evaṃ veditabbo – etarahi saṅghikavihāresu saṅghattheresu yathākammaṅgatesu tasmiṃ vihāre yo bhikkhu vuḍḍhataro, sopi ‘‘ayaṃ vihāro mayā vasitabbo’’ti vadati. Yo tattha byatto paṭibalo, sopi tatheva vadati. Yena so vihāro kārito, sopi ‘‘mayā pasīditapuggalo āropetabbo’’ti vadati. Saṅghopi ‘‘mayameva issarā, tasmā amhehi icchitapuggalo āropetabbo’’ti vadati. Evaṃdvidhā vā tidhā vā catudhā vā bhinnesu mahantaṃ adhikaraṇaṃ hoti."
    ],
    "innerText": "Saṅghike pana pāḷiyaṃ āgatānaṃ ‘‘purimako pacchimako antarāmuttako cā’’ti (cūḷava. 318) vuttānaṃ tiṇṇaṃ senāsanaggāhānañca aṭṭhakathāyaṃ (cūḷava. aṭṭha. 318) āgatānaṃ ‘‘utukāle ca vassāvāse cā’’ti vuttānaṃ dvinnaṃ senāsanaggāhānañca etarahi asampajjanato anuṭṭhāpanīyapāḷiyaṃ āgatassa attano sabhāvena anuṭṭhāpanīyassa dhuvavāsatthāya saṅghena dinnatāya anuṭṭhāpanīyassa vaseneva vinicchayo hoti. Vuḍḍhataragilānā hi attano sabhāvena anuṭṭhāpanīyā honti. Vuttañhetaṃ aṭṭhakathāyaṃ (mahāva. aṭṭha. 343) ‘‘vuḍḍhataro attano vuḍḍhatāya navakatarena na vuṭṭhāpetabbo, gilāno attano gilānatāyā’’ti. Bhaṇḍāgārikadhammakathikādayo dhuvavāsatthāya saṅghena dinnatāya anuṭṭhāpanīyā honti. Vuttañhi ‘‘saṅgho pana bhaṇḍāgārikassa vā dhammakathikavinayadharādīnaṃ vā…pe… dhuvavāsatthāya vihāraṃ sammannitvā deti, tasmā yassa saṅghena dinno, sopi anuṭṭhāpanīyo’’ti (pāci. aṭṭha. 120; kaṅkhā. aṭṭha. anupakhajjasikkhāpadavaṇṇanā). So evaṃ veditabbo – etarahi saṅghikavihāresu saṅghattheresu yathākammaṅgatesu tasmiṃ vihāre yo bhikkhu vuḍḍhataro, sopi ‘‘ayaṃ vihāro mayā vasitabbo’’ti vadati. Yo tattha byatto paṭibalo, sopi tatheva vadati. Yena so vihāro kārito, sopi ‘‘mayā pasīditapuggalo āropetabbo’’ti vadati. Saṅghopi ‘‘mayameva issarā, tasmā amhehi icchitapuggalo āropetabbo’’ti vadati. Evaṃdvidhā vā tidhā vā catudhā vā bhinnesu mahantaṃ adhikaraṇaṃ hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tesu vuḍḍhataro ‘‘na tvevāhaṃ, bhikkhave, kenaci pariyāyena vuḍḍhatarassa āsanaṃ paṭibāhitabbanti vadāmi, yo paṭibāheyya, āpatti dukkaṭassā’’ti pāḷipāṭhañca (mahāva. 473; cūḷava. 316), ‘‘vuḍḍhataro attano vuḍḍhatāya navakatarena na vuṭṭhāpetabbo’’ti aṭṭhakathāvacanañca (pāci. aṭṭha. 119 ādayo; kaṅkhā. aṭṭha. anupakhajjasikkhāpadavaṇṇanā) gahetvā ‘‘ahameva ettha vuḍḍhataro, mayā vuḍḍhataro añño natthi, tasmā ahameva imasmiṃ vihāre vasitumanucchaviko’’ti saññī hoti. Byattopi ‘‘bahussutassa saṅghabhāranitthārakassa bhikkhuno anuṭṭhāpanīyasenāsanampī’’ti parivāraṭṭhakathāvacanañca (pari. aṭṭha. 495-496), ‘‘anujānāmi, bhikkhave, byattena ",
      " bhikkhunā paṭibalena dasavassena vā atirekadasavassena vā upasampādetuṃ, nissayaṃ dātu’’ntiādipāḷivacanañca (mahāva. 76, 82) gahetvā ‘‘ahameva ettha byatto paṭibalo, na mayā añño byattataro atthi, tasmā ahameva imassa vihārassa anucchaviko’’ti saññī. Vihārakārakopi ‘‘yena vihāro kārito, so vihārasāmikoti vinayapāṭho (pāci. aṭṭha. 116) atthi, mayā ca bahuṃ dhanaṃ cajitvā ayaṃ vihāro kārito, tasmā mayā pasannapuggalo āropetabbo, na añño’’ti saññī. Saṅghopi ‘‘saṅghiko nāma vihāro saṅghassa dinno hoti pariccatto’’tiādipāḷivacanañca (pāci. 116, 121, 126, 131), antamaso caturaṅgulapādakaṃ gāmadārakehi paṃsvāgārakesu kīḷantehi katampi saṅghassa dinnakālato paṭṭhāya garubhaṇḍaṃ hotī’’tiādiaṭṭhakathāvacanañca (cūḷava. aṭṭha. 321) gahetvā ‘‘ayaṃ vihāro saṅghiko ",
      " saṅghasantako, tasmā amhehi abhirucitapuggalova āropetabbo, na añño’’ti saññī."
    ],
    "innerText": "Tesu vuḍḍhataro ‘‘na tvevāhaṃ, bhikkhave, kenaci pariyāyena vuḍḍhatarassa āsanaṃ paṭibāhitabbanti vadāmi, yo paṭibāheyya, āpatti dukkaṭassā’’ti pāḷipāṭhañca (mahāva. 473; cūḷava. 316), ‘‘vuḍḍhataro attano vuḍḍhatāya navakatarena na vuṭṭhāpetabbo’’ti aṭṭhakathāvacanañca (pāci. aṭṭha. 119 ādayo; kaṅkhā. aṭṭha. anupakhajjasikkhāpadavaṇṇanā) gahetvā ‘‘ahameva ettha vuḍḍhataro, mayā vuḍḍhataro añño natthi, tasmā ahameva imasmiṃ vihāre vasitumanucchaviko’’ti saññī hoti. Byattopi ‘‘bahussutassa saṅghabhāranitthārakassa bhikkhuno anuṭṭhāpanīyasenāsanampī’’ti parivāraṭṭhakathāvacanañca (pari. aṭṭha. 495-496), ‘‘anujānāmi, bhikkhave, byattena bhikkhunā paṭibalena dasavassena vā atirekadasavassena vā upasampādetuṃ, nissayaṃ dātu’’ntiādipāḷivacanañca (mahāva. 76, 82) gahetvā ‘‘ahameva ettha byatto paṭibalo, na mayā añño byattataro atthi, tasmā ahameva imassa vihārassa anucchaviko’’ti saññī. Vihārakārakopi ‘‘yena vihāro kārito, so vihārasāmikoti vinayapāṭho (pāci. aṭṭha. 116) atthi, mayā ca bahuṃ dhanaṃ cajitvā ayaṃ vihāro kārito, tasmā mayā pasannapuggalo āropetabbo, na añño’’ti saññī. Saṅghopi ‘‘saṅghiko nāma vihāro saṅghassa dinno hoti pariccatto’’tiādipāḷivacanañca (pāci. 116, 121, 126, 131), antamaso caturaṅgulapādakaṃ gāmadārakehi paṃsvāgārakesu kīḷantehi katampi saṅghassa dinnakālato paṭṭhāya garubhaṇḍaṃ hotī’’tiādiaṭṭhakathāvacanañca (cūḷava. aṭṭha. 321) gahetvā ‘‘ayaṃ vihāro saṅghiko saṅghasantako, tasmā amhehi abhirucitapuggalova āropetabbo, na añño’’ti saññī."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tattha vuḍḍhatarassa vacanepi ‘‘na tvevāhaṃ, bhikkhave’’tyādivacanaṃ (cūḷava. 316) tesu tesu āsanasālādīsu aggāsanassa vuḍḍhatarārahattā bhattaṃ bhuñjitvā nisinnopi bhikkhu vuḍḍhatare āgate vuṭṭhāya āsanaṃ dātabbaṃ sandhāya bhagavatā vuttaṃ, na dhuvavāsaṃ sandhāya. ‘‘Vuḍḍhataro attano vuḍḍhatāya’’tyādivacanañca (pāci. aṭṭha. 120; kaṅkhā. aṭṭha. anupakhajjasikkhāpadavaṇṇanā) yathāvuḍḍhaṃ senāsane dīyamāne vuḍḍhatare āgate navakataro vuṭṭhāpetabbo, vuṭṭhāpetvā vuḍḍhatarassa senāsanaṃ dātabbaṃ, vuḍḍhataro pana navakatarena na vuṭṭhāpetabbo. Kasmā? ‘‘Attano vuḍḍhataratāyā’’ti utukāle yathāvuḍḍhaṃ senāsanadānaṃ sandhāya vuttaṃ, na dhuvavāsatthāya dānaṃ sandhāya ",
      ", tasmā idampi vacanaṃ upaparikkhitabbaṃ, na sīghaṃ anujānitabbaṃ."
    ],
    "innerText": "Tattha vuḍḍhatarassa vacanepi ‘‘na tvevāhaṃ, bhikkhave’’tyādivacanaṃ (cūḷava. 316) tesu tesu āsanasālādīsu aggāsanassa vuḍḍhatarārahattā bhattaṃ bhuñjitvā nisinnopi bhikkhu vuḍḍhatare āgate vuṭṭhāya āsanaṃ dātabbaṃ sandhāya bhagavatā vuttaṃ, na dhuvavāsaṃ sandhāya. ‘‘Vuḍḍhataro attano vuḍḍhatāya’’tyādivacanañca (pāci. aṭṭha. 120; kaṅkhā. aṭṭha. anupakhajjasikkhāpadavaṇṇanā) yathāvuḍḍhaṃ senāsane dīyamāne vuḍḍhatare āgate navakataro vuṭṭhāpetabbo, vuṭṭhāpetvā vuḍḍhatarassa senāsanaṃ dātabbaṃ, vuḍḍhataro pana navakatarena na vuṭṭhāpetabbo. Kasmā? ‘‘Attano vuḍḍhataratāyā’’ti utukāle yathāvuḍḍhaṃ senāsanadānaṃ sandhāya vuttaṃ, na dhuvavāsatthāya dānaṃ sandhāya , tasmā idampi vacanaṃ upaparikkhitabbaṃ, na sīghaṃ anujānitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Byattavacanepi ‘‘bahussutassa saṅghabhāranitthārakassa’’tyādivacanañca (pari. aṭṭha. 445-496) na bahussutamattena saṅghikavihārassa issarabhāvaṃ sandhāya vuttaṃ, atha kho tassa bhikkhussa bahūpakārataṃ guṇavisiṭṭhatañca sallakkhetvā saṅghena phāsukaṃ āvāsaṃ anuṭṭhāpanīyaṃ katvā dinne so bhikkhu kenaci tamhā vihārā anuṭṭhāpanīyo hoti, imamatthaṃ sandhāya vuttaṃ. ‘‘Anujānāmi, bhikkhave’’tyādivacanañca (mahāva. 82) nissayācariyānaṃ lakkhaṇaṃ pakāsetuṃ bhagavatā vuttaṃ, na saṅghikavihārassa issarattaṃ, tasmā idampi vacanaṃ upaparikkhitabbaṃ, na sīghaṃ anujānitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Dāyakavacanaṃ pana nānujānitabbaṃ paṭibāhitabbaṃ. Kasmā? ‘‘Yena vihāro kārito’’tyādipāṭhassa amukhyavohārattā. Yathā hi puthujjanakāle rūpādīsu sañjanassa bhūtapubbattā bhūtapubbagatiyā arahāpi ‘‘satto’’ti, evaṃ dānakālato pubbe tassa vihārassa sāmibhūtapubbattā dāyako ‘‘vihārasāmiko’’ti vuccati, na issarattā. Na hi sakale vinayapiṭake aṭṭhakathāṭīkāsu ca ‘‘vissajjetvā dinnassa vihārassa dāyako issaro’’ti vā ‘‘dāyakena vicāretabbo’’ti vā ‘‘dāyakasantakavihāro’’ti vā pāṭho atthi, ‘‘saṅghiko, gaṇasantako, puggaliko’’icceva atthi, tasmā tassa vacanaṃ nānujānitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Saṅghassa ",
      " vacanepi ‘‘saṅghiko nāma vihāro’’tyādivacanaṃ (pāci. 116, 121, 126, 131) saṅghasantakabhāvaṃ saṅghena vicāretabbabhāvaṃ dīpeti, saṅgho pana vicārento pañcaṅgasamannāgataṃ bhikkhuṃ senāsanaggāhāpakaṃ sammannitvā tena yathāvuḍḍhaṃ vicāretabbo vā hoti, samaggena saṅghena duvaṅgasamannāgatassa bhikkhuno apalokanakammena ",
      " dhuvavāsatthāya dātabbo vā. Tesu pañcaṅgasamannāgatassa bhikkhuno dullabhattā senāsanaggāhāpakasammutiyā abhāve sati duvaṅgasamannāgato bhikkhu pariyesitabbo. Evaṃ pana apariyesitvā bhaṇḍāgārikatādibahaūpakāratāyuttassa bahussutatādiguṇavisiṭṭhatāvirahassa bhikkhuno āmisagarukatādivasena saṅghena vihāro dātabbo na hoti, tasmā saṅghavacanampi upaparikkhitabbaṃ, na tāva anujānitabbaṃ."
    ],
    "innerText": "Saṅghassa vacanepi ‘‘saṅghiko nāma vihāro’’tyādivacanaṃ (pāci. 116, 121, 126, 131) saṅghasantakabhāvaṃ saṅghena vicāretabbabhāvaṃ dīpeti, saṅgho pana vicārento pañcaṅgasamannāgataṃ bhikkhuṃ senāsanaggāhāpakaṃ sammannitvā tena yathāvuḍḍhaṃ vicāretabbo vā hoti, samaggena saṅghena duvaṅgasamannāgatassa bhikkhuno apalokanakammena dhuvavāsatthāya dātabbo vā. Tesu pañcaṅgasamannāgatassa bhikkhuno dullabhattā senāsanaggāhāpakasammutiyā abhāve sati duvaṅgasamannāgato bhikkhu pariyesitabbo. Evaṃ pana apariyesitvā bhaṇḍāgārikatādibahaūpakāratāyuttassa bahussutatādiguṇavisiṭṭhatāvirahassa bhikkhuno āmisagarukatādivasena saṅghena vihāro dātabbo na hoti, tasmā saṅghavacanampi upaparikkhitabbaṃ, na tāva anujānitabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Atha tīṇipi vacanāni saṃsandetabbāni. Tattha saṅghassa issarattā saṅgho pucchitabbo ‘‘ko puggalo tumhehi abhirucito’’ti, pucchitvā ‘‘eso’’ti vutte ‘‘kasmā abhirucito’’ti pucchitvā ‘‘eso puggalo amhe cīvarādipaccayehi anuggahetā, amhākaṃ ñātisālohito, upajjhāyo, ācariyo, saddhivihāriko, antevāsiko, samānupajjhāyako, samānācariyako, piyasahāyo, lābhī, yasassī, tasmā amhehi abhirucito’’ti vutte ‘‘na ettāvatā dhuvavāsatthāya vihāro dātabbo’’ti paṭikkhipitabbo. Atha ‘‘eso puggalo sabbehi amhehi vuḍḍhataro aggāsanaṃ aggodakaṃ aggapiṇḍaṃ arahati, dhuvavāsatthāya vihāro pana tassa dātabboti aṭṭhakathācariyehi na vutto’’ti vatvā paṭikkhipitabbo. Atha ‘‘dhammakathiko, vinayadharo, gaṇavācakaācariyo’’ti vutte ‘‘eso dhuvavāsatthāya dinnavihārassa anucchaviko, etassa dātabbo’’ti anumoditabbo. Kathaṃ viññāyatīti ce? ‘‘Saṅgho pana bhaṇḍāgārikassa vā dhammakathikavinayadharādīnaṃ vā gaṇavācakaācariyassa vā bahūpakārataṃ guṇavisiṭṭhatañca sallakkhento dhuvavāsatthāya vihāraṃ sammannitvā detī’’ti vacanato viññāyati (pāci. aṭṭha. 129; kaṅkhā. aṭṭha. anupakhajjasikkhāpadavaṇṇanā)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Idha ",
      " pana sādhakapāṭhe ‘‘bhaṇḍāgārikassa vā’’ti vijjamāne kasmā sādhyavacane bhaṇḍāgāriko na vuttoti? Etarahi bhaṇḍāgārassa abhāvā. Yadi kesuci vihāresu bhaṇḍāgāraṃ sammanneyya, so bhaṇḍāgāravihāre nisinno saṅghassa pattacīvararakkhaṇādikaṃ upakāraṃ kareyya, tassa bahūpakārataṃ sallakkhento saṅgho bhaṇḍāgārikassa phāsukaṃ āvāsaṃ etarahipi dhuvavāsatthāya ",
      " dadeyya, so tassa visuṃ dhuvavāsavihāroti. Ettha sādhakapāṭhe ‘‘dhammakathikavinayadharādīnaṃ vā’’tiādisaddena bahussuto āgatāgamo dhammadharo vinayadharo mātikādharo paṇḍito byatto medhāvī lajjī kukkuccako sikkhākāmoti vuttaguṇavante saṅgaṇhāti. Athāpi ‘‘eso puggalo bahussuto uddesaparipucchādīhi bhikkhūnaṃ bahūpakāro saṅghabhāranitthārako’’ti vadati, ‘‘sādhu esopi phāsukāvāsassa araho, anuṭṭhāpanīyaṃ katvā dhuvavāsatthāya vihāro etassapi dātabbo’’ti vatvā anumoditabbo. Kathaṃ viññāyatīti ce? ‘‘Saṅgho pana bahussutassa uddesaparipucchādīhi bahūpakārassa bhāranitthārakassa phāsukaṃ āvāsaṃ anuṭṭhāpanīyaṃ katvā detī’’ti (mahāva. aṭṭha. 343) vacanato viññāyati."
    ],
    "innerText": "Idha pana sādhakapāṭhe ‘‘bhaṇḍāgārikassa vā’’ti vijjamāne kasmā sādhyavacane bhaṇḍāgāriko na vuttoti? Etarahi bhaṇḍāgārassa abhāvā. Yadi kesuci vihāresu bhaṇḍāgāraṃ sammanneyya, so bhaṇḍāgāravihāre nisinno saṅghassa pattacīvararakkhaṇādikaṃ upakāraṃ kareyya, tassa bahūpakārataṃ sallakkhento saṅgho bhaṇḍāgārikassa phāsukaṃ āvāsaṃ etarahipi dhuvavāsatthāya dadeyya, so tassa visuṃ dhuvavāsavihāroti. Ettha sādhakapāṭhe ‘‘dhammakathikavinayadharādīnaṃ vā’’tiādisaddena bahussuto āgatāgamo dhammadharo vinayadharo mātikādharo paṇḍito byatto medhāvī lajjī kukkuccako sikkhākāmoti vuttaguṇavante saṅgaṇhāti. Athāpi ‘‘eso puggalo bahussuto uddesaparipucchādīhi bhikkhūnaṃ bahūpakāro saṅghabhāranitthārako’’ti vadati, ‘‘sādhu esopi phāsukāvāsassa araho, anuṭṭhāpanīyaṃ katvā dhuvavāsatthāya vihāro etassapi dātabbo’’ti vatvā anumoditabbo. Kathaṃ viññāyatīti ce? ‘‘Saṅgho pana bahussutassa uddesaparipucchādīhi bahūpakārassa bhāranitthārakassa phāsukaṃ āvāsaṃ anuṭṭhāpanīyaṃ katvā detī’’ti (mahāva. aṭṭha. 343) vacanato viññāyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Athāpi ‘‘ayaṃ puggalo dhammakathiko vinayadharo gaṇavācakācariyo saṅghassa bahūpakāro visiṭṭhaguṇayutto’’ti vadati, ‘‘sādhu etassapi puggalassa dhuvavāsatthāya vihāraṃ sallakkhetvā sammannitvāva dātabbo’’ti vatvā anumoditabbo. Kathaṃ viññāyatīti ce? ‘‘Saṅgho pana bhaṇḍāgārikassa vā dhammakathikavinayadharādīnaṃ vā gaṇavācakācariyassa vā bahūpakārataṃ guṇavisiṭṭhatañca sallakkhetvā dhuvavāsatthāya ",
      " vihāraṃ sammannitvā detī’’ti (pāci. aṭṭha. 120; kaṅkhā. aṭṭha. anupakhajjasikkhāpadavaṇṇanā) vacanato viññāyati."
    ],
    "innerText": "Athāpi ‘‘ayaṃ puggalo dhammakathiko vinayadharo gaṇavācakācariyo saṅghassa bahūpakāro visiṭṭhaguṇayutto’’ti vadati, ‘‘sādhu etassapi puggalassa dhuvavāsatthāya vihāraṃ sallakkhetvā sammannitvāva dātabbo’’ti vatvā anumoditabbo. Kathaṃ viññāyatīti ce? ‘‘Saṅgho pana bhaṇḍāgārikassa vā dhammakathikavinayadharādīnaṃ vā gaṇavācakācariyassa vā bahūpakārataṃ guṇavisiṭṭhatañca sallakkhetvā dhuvavāsatthāya vihāraṃ sammannitvā detī’’ti (pāci. aṭṭha. 120; kaṅkhā. aṭṭha. anupakhajjasikkhāpadavaṇṇanā) vacanato viññāyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Athāpi ‘‘eso puggalo bahussuto saṅghabhāranitthārako’’ti vadati, ‘‘sādhu etassapi anuṭṭhāpanīyaṃ katvā dātabbo’’ti vatvā anumoditabbo. Kathaṃ viññāyatīti ce? ‘‘Bahussutassa saṅghabhāranitthārakassa bhikkhuno anuṭṭhāpanīyasenāsanampī’’ti parivāraṭṭhakathāyaṃ (pari. aṭṭha. 495-496) vuttattā viññāyati. Tato ‘‘evaṃ duvaṅgasampanno puggalo antosīmaṭṭho vā bahisīmaṭṭho vā’’ti pucchitvā ‘‘antosīmaṭṭho’’ti vutte ‘‘sādhu suṭṭhu tassa dātabbo’’ti sampaṭicchitabbaṃ. ‘‘Bahisīmaṭṭho’’ti vutte ‘‘na dātabbo’’ti paṭikkhipitabbaṃ. Kasmāti ce? ‘‘Na, bhikkhave, nissīme ṭhitassa senāsanaṃ gāhetabbaṃ, yo gāheyya, āpatti dukkaṭassā’’ti (cūḷava. 318) vacanatoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Atha ‘‘duvaṅgasamannāgate antosīmaṭṭhe asati ekaṅgasamannāgato antosīmaṭṭho atthī’’ti pucchitvā ‘‘atthī’’ti vutte ‘‘sādhu suṭṭhu etassa dātabbo’’ti sampaṭicchitabbaṃ. Kathaṃ viññāyatīti ce? ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘Bahūpakārataṃ guṇavisiṭṭhatañca sallakkhento"
      },
      "ti bhaṇḍāgārikassa bahūpakārataṃ dhammakathikādīnaṃ ",
      " guṇavisiṭṭhatañca sallakkhento’’ti sāratthadīpaniyaṃ (sārattha. ṭī. pācittiya 3.119-121) ekekaṅgavasena āgatattā viññāyati. ‘‘Antosīmaṭṭho ekaṅgasamannāgatopi natthi, bahisīmaṭṭhova atthī’’ti vutte ‘‘āgantvā antosīme ṭhitassa dātabbo’’ti vattabbo. Kasmāti ce? ‘‘Asampattānampi upacārasīmaṃ paviṭṭhānaṃ antevāsikādīsu gaṇhantesu dātabbamevā’’ti aṭṭhakathāyaṃ (mahāva. aṭṭha. 379) vacanato viññāyati."
    ],
    "innerText": "Atha ‘‘duvaṅgasamannāgate antosīmaṭṭhe asati ekaṅgasamannāgato antosīmaṭṭho atthī’’ti pucchitvā ‘‘atthī’’ti vutte ‘‘sādhu suṭṭhu etassa dātabbo’’ti sampaṭicchitabbaṃ. Kathaṃ viññāyatīti ce? ‘‘Bahūpakārataṃ guṇavisiṭṭhatañca sallakkhentoti bhaṇḍāgārikassa bahūpakārataṃ dhammakathikādīnaṃ guṇavisiṭṭhatañca sallakkhento’’ti sāratthadīpaniyaṃ (sārattha. ṭī. pācittiya 3.119-121) ekekaṅgavasena āgatattā viññāyati. ‘‘Antosīmaṭṭho ekaṅgasamannāgatopi natthi, bahisīmaṭṭhova atthī’’ti vutte ‘‘āgantvā antosīme ṭhitassa dātabbo’’ti vattabbo. Kasmāti ce? ‘‘Asampattānampi upacārasīmaṃ paviṭṭhānaṃ antevāsikādīsu gaṇhantesu dātabbamevā’’ti aṭṭhakathāyaṃ (mahāva. aṭṭha. 379) vacanato viññāyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sace ",
      " pana ekaṅgayuttabhāvena vā duvaṅgayuttabhāvena vā samānā dve tayo bhikkhū antosīmāyaṃ vijjamānā bhaveyyuṃ, kassa dātabboti? Vaḍḍhatarassāti. Kathaṃ viññāyatīti ce? ‘‘Na ca, bhikkhave, saṅghikaṃ yathāvuḍḍhaṃ paṭibāhitabbaṃ, yo paṭibāheyya, āpatti dukkaṭassā’’ti (cūḷava. 311) vacanatoti. Sace pana antosīmāyaṃ ekaṅgayutto vā duvaṅgayutto vā bhikkhu natthi, sabbeva āvāsikā bālā abyattā, evaṃ sati kassa dātabboti? Yo taṃ vihāraṃ āgacchati āgantuko bhikkhu, so ce lajjī hoti pesalo bahussuto sikkhākāmo, so tehi āvāsikehi bhikkhūhi aññattha agamanatthaṃ saṅgahaṃ katvā so āvāso dātabbo."
    ],
    "innerText": "Sace pana ekaṅgayuttabhāvena vā duvaṅgayuttabhāvena vā samānā dve tayo bhikkhū antosīmāyaṃ vijjamānā bhaveyyuṃ, kassa dātabboti? Vaḍḍhatarassāti. Kathaṃ viññāyatīti ce? ‘‘Na ca, bhikkhave, saṅghikaṃ yathāvuḍḍhaṃ paṭibāhitabbaṃ, yo paṭibāheyya, āpatti dukkaṭassā’’ti (cūḷava. 311) vacanatoti. Sace pana antosīmāyaṃ ekaṅgayutto vā duvaṅgayutto vā bhikkhu natthi, sabbeva āvāsikā bālā abyattā, evaṃ sati kassa dātabboti? Yo taṃ vihāraṃ āgacchati āgantuko bhikkhu, so ce lajjī hoti pesalo bahussuto sikkhākāmo, so tehi āvāsikehi bhikkhūhi aññattha agamanatthaṃ saṅgahaṃ katvā so āvāso dātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ayamattho kathaṃ jānitabboti ce? ‘‘Idha pana, bhikkhave, aññatarasmiṃ āvāse sambahulā bhikkhū viharanti bālā abyattā, te na jānanti uposathaṃ vā uposathakammaṃ vā pātimokkhaṃ vā pātimokkhuddesaṃ vā. Tattha añño bhikkhu āgacchati bahussuto āgatāgamo dhammadharo vinayadharo mātikādharo paṇḍito byatto medhāvī lajjī kukkuccako sikkhākāmo, tehi, bhikkhave, bhikkhūhi so bhikkhu saṅgahetabbo anuggahetabbo upalāpetabbo upaṭṭhāpetabbo cuṇṇena mattikāya dantakaṭṭhena mukhodakena. No ce saṅgaṇheyyuṃ anuggaṇheyyuṃ upalāpeyyuṃ upaṭṭhāpeyyuṃ cuṇṇena mattikāya dantakaṭṭhena mukhodakena, āpatti dukkaṭassā’’ti (mahāva. 163) sammāsambuddhena paññattattā, aṭṭhakathāyañca (mahāva. aṭṭha. 163) ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "‘‘saṅgahetabbo"
      },
      "ti ‘sādhu, bhante, āgatattha, idha bhikkhā sulabhā sūpabyañjanaṃ atthi, vasatha anukkaṇṭhamānā’ti evaṃ piyavacanena saṅgahetabbo, punappunaṃ tathākaraṇavasena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "anuggahetabbo,"
      },
      " ‘āma vasissāmī’ti paṭivacanadāpanena ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upalāpetabbo"
      },
      ". Atha vā catūhi paccayehi saṅgahetabbo ceva anuggahetabbo ca, piyavacanena upalāpetabbo, kaṇṇasukhaṃ ālapitabboti attho, cuṇṇādīhi ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upaṭṭhāpetabbo. Āpatti dukkaṭassā"
      },
      "ti sace sakalopi saṅgho na karoti, sabbesaṃ dukkaṭaṃ. Idha neva therā, na daharā ",
      " muccanti, sabbehi vārena upaṭṭhātabbo, attano vāre anupaṭṭhahantassa āpatti. Tena pana mahātherānaṃ pariveṇasammajjanadantakaṭṭhadānādīni na sāditabbāni. Evampi sati mahātherehi sāyaṃpātaṃ upaṭṭhānaṃ āgantabbaṃ. Tena pana tesaṃ āgamanaṃ ñatvā paṭhamataraṃ mahātherānaṃ upaṭṭhānaṃ gantabbaṃ. Sacassa saddhiṃcarā bhikkhū upaṭṭhākā atthi, ‘mayhaṃ upaṭṭhākā atthi, tumhe appossukkā viharathā’ti vattabbaṃ. Athāpissa saddhiṃ carā natthi, tasmiṃyeva pana vihāre eko vā dve vā vattasampannā vadanti ‘mayhaṃ therassa kattabbaṃ karissāma, avasesā phāsu viharantū’ti, sabbesaṃ anāpattī’’ti vuttattā. Evaṃ tādisaṃ bahisīmato antosīmamāgataṃ lajjīpesalabahussutasikkhākāmabhūtaṃ bhikkhuṃ antosīmāya dhuvanivāsatthāya phāsukaṃ āvāsaṃ anuṭṭhāpanīyaṃ katvā dātabboti viññāyati."
    ],
    "innerText": "Ayamattho kathaṃ jānitabboti ce? ‘‘Idha pana, bhikkhave, aññatarasmiṃ āvāse sambahulā bhikkhū viharanti bālā abyattā, te na jānanti uposathaṃ vā uposathakammaṃ vā pātimokkhaṃ vā pātimokkhuddesaṃ vā. Tattha añño bhikkhu āgacchati bahussuto āgatāgamo dhammadharo vinayadharo mātikādharo paṇḍito byatto medhāvī lajjī kukkuccako sikkhākāmo, tehi, bhikkhave, bhikkhūhi so bhikkhu saṅgahetabbo anuggahetabbo upalāpetabbo upaṭṭhāpetabbo cuṇṇena mattikāya dantakaṭṭhena mukhodakena. No ce saṅgaṇheyyuṃ anuggaṇheyyuṃ upalāpeyyuṃ upaṭṭhāpeyyuṃ cuṇṇena mattikāya dantakaṭṭhena mukhodakena, āpatti dukkaṭassā’’ti (mahāva. 163) sammāsambuddhena paññattattā, aṭṭhakathāyañca (mahāva. aṭṭha. 163) ‘‘saṅgahetabboti ‘sādhu, bhante, āgatattha, idha bhikkhā sulabhā sūpabyañjanaṃ atthi, vasatha anukkaṇṭhamānā’ti evaṃ piyavacanena saṅgahetabbo, punappunaṃ tathākaraṇavasena anuggahetabbo, ‘āma vasissāmī’ti paṭivacanadāpanena upalāpetabbo. Atha vā catūhi paccayehi saṅgahetabbo ceva anuggahetabbo ca, piyavacanena upalāpetabbo, kaṇṇasukhaṃ ālapitabboti attho, cuṇṇādīhi upaṭṭhāpetabbo. Āpatti dukkaṭassāti sace sakalopi saṅgho na karoti, sabbesaṃ dukkaṭaṃ. Idha neva therā, na daharā muccanti, sabbehi vārena upaṭṭhātabbo, attano vāre anupaṭṭhahantassa āpatti. Tena pana mahātherānaṃ pariveṇasammajjanadantakaṭṭhadānādīni na sāditabbāni. Evampi sati mahātherehi sāyaṃpātaṃ upaṭṭhānaṃ āgantabbaṃ. Tena pana tesaṃ āgamanaṃ ñatvā paṭhamataraṃ mahātherānaṃ upaṭṭhānaṃ gantabbaṃ. Sacassa saddhiṃcarā bhikkhū upaṭṭhākā atthi, ‘mayhaṃ upaṭṭhākā atthi, tumhe appossukkā viharathā’ti vattabbaṃ. Athāpissa saddhiṃ carā natthi, tasmiṃyeva pana vihāre eko vā dve vā vattasampannā vadanti ‘mayhaṃ therassa kattabbaṃ karissāma, avasesā phāsu viharantū’ti, sabbesaṃ anāpattī’’ti vuttattā. Evaṃ tādisaṃ bahisīmato antosīmamāgataṃ lajjīpesalabahussutasikkhākāmabhūtaṃ bhikkhuṃ antosīmāya dhuvanivāsatthāya phāsukaṃ āvāsaṃ anuṭṭhāpanīyaṃ katvā dātabboti viññāyati."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Nanu ca ‘‘na, bhikkhave, nissīme ṭhitassa senāsanaṃ gāhetabbaṃ, yo gāheyya, āpatti dukkaṭassā’’ti (cūḷava. 318) bhagavatā vuttaṃ, atha kasmā nissīmato āgatassa dhuvavāsatthāya vihāro dātabboti? Vuccate – ‘‘nissīme ṭhitassā’’ti idaṃ anādare sāmivacanaṃ, tasmā nissīme ṭhitaṃyeva senāsanaṃ na gāhetabbanti attho daṭṭhabbo, na nissīme ṭhitassa tassa bhikkhussa antosīmaṃ paviṭṭhassapi senāsanaṃ na gāhetabbanti attho, tasmā pubbe bahisīmāyaṃ ṭhitepi idāni antosīmaṃ paviṭṭhakālato paṭṭhāya catupaccayabhāgo labbhati. Vuttañhi aṭṭhakathāyaṃ ",
      " (mahāva. aṭṭha. 379) ‘‘asukavihāre kira bahuṃ cīvaraṃ uppannanti sutvā yojanantarikavihāratopi bhikkhū āgacchanti, sampattasampattānaṃ ṭhitaṭṭhānato paṭṭhāya dātabba’’nti. Antosīmaṭṭhesu pātimokkhaṃ uddisituṃ asakkontesu yattha pātimokkhuddesako atthi, so āvāso gantabbo hoti. Antovassepi pātimokkhuddesakena vinā vassaṃ vasituṃ na labhati. Yattha pātimokkhuddesako atthi, tattha gantvā vassaṃ vasitabbaṃ, tasmā bahisīmato āgatopi lajjīpesalabahussutasikkhākāmabhikkhu saṅgahetabbo hoti. Vuttañhetaṃ bhagavatā –"
    ],
    "innerText": "Nanu ca ‘‘na, bhikkhave, nissīme ṭhitassa senāsanaṃ gāhetabbaṃ, yo gāheyya, āpatti dukkaṭassā’’ti (cūḷava. 318) bhagavatā vuttaṃ, atha kasmā nissīmato āgatassa dhuvavāsatthāya vihāro dātabboti? Vuccate – ‘‘nissīme ṭhitassā’’ti idaṃ anādare sāmivacanaṃ, tasmā nissīme ṭhitaṃyeva senāsanaṃ na gāhetabbanti attho daṭṭhabbo, na nissīme ṭhitassa tassa bhikkhussa antosīmaṃ paviṭṭhassapi senāsanaṃ na gāhetabbanti attho, tasmā pubbe bahisīmāyaṃ ṭhitepi idāni antosīmaṃ paviṭṭhakālato paṭṭhāya catupaccayabhāgo labbhati. Vuttañhi aṭṭhakathāyaṃ (mahāva. aṭṭha. 379) ‘‘asukavihāre kira bahuṃ cīvaraṃ uppannanti sutvā yojanantarikavihāratopi bhikkhū āgacchanti, sampattasampattānaṃ ṭhitaṭṭhānato paṭṭhāya dātabba’’nti. Antosīmaṭṭhesu pātimokkhaṃ uddisituṃ asakkontesu yattha pātimokkhuddesako atthi, so āvāso gantabbo hoti. Antovassepi pātimokkhuddesakena vinā vassaṃ vasituṃ na labhati. Yattha pātimokkhuddesako atthi, tattha gantvā vassaṃ vasitabbaṃ, tasmā bahisīmato āgatopi lajjīpesalabahussutasikkhākāmabhikkhu saṅgahetabbo hoti. Vuttañhetaṃ bhagavatā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "‘‘Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā bhikkhū viharanti bālā abyattā, te na jānanti uposathaṃ vā uposathakammaṃ vā pātimokkhaṃ vā pātimokkhuddesaṃ vā. Tehi, bhikkhave, bhikkhūhi eko bhikkhu sāmantā āvāsā sajjukaṃ pāhetabbo ‘gacchāvuso saṃkhittena vā vitthārena vā pātimokkhaṃ pariyāpuṇitvā āgacchā’ti. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, tehi, bhikkhave, bhikkhūhi sabbeheva yattha jānanti ",
      " uposathaṃ vā uposathakammaṃ vā pātimokkhaṃ vā pātimokkhuddesaṃ vā, so āvāso gantabbo. No ce gaccheyyuṃ, āpatti dukkaṭassa. Idha pana, bhikkhave, aññatarasmiṃ āvāse sambahulā bhikkhū vassaṃ vasanti bālā abyattā, te na jānanti uposathaṃ vā uposathakammaṃ vā pātimokkhaṃ vā pātimokkhuddesaṃ vā. Tehi, bhikkhave, bhikkhūhi eko bhikkhu sāmantā āvāsā sajjukaṃ pāhetabbo ‘gacchāvuso saṃkhittena vā vitthārena vā pātimokkhaṃ pariyāpuṇitvā āgacchā’ti. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, eko bhikkhu sattāhakālikaṃ ",
      " pāhetabbo ‘gacchāvuso saṃkhittena vā vitthārena vā pātimokkhaṃ pariyāpuṇitvā āgacchā’ti. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, na, bhikkhave, tehi bhikkhūhi tasmiṃ āvāse vassaṃ vasitabbaṃ, vaseyyuṃ ce, āpatti dukkaṭassāti’’ (mahāva. 163)."
    ],
    "innerText": "‘‘Idha pana, bhikkhave, aññatarasmiṃ āvāse tadahuposathe sambahulā bhikkhū viharanti bālā abyattā, te na jānanti uposathaṃ vā uposathakammaṃ vā pātimokkhaṃ vā pātimokkhuddesaṃ vā. Tehi, bhikkhave, bhikkhūhi eko bhikkhu sāmantā āvāsā sajjukaṃ pāhetabbo ‘gacchāvuso saṃkhittena vā vitthārena vā pātimokkhaṃ pariyāpuṇitvā āgacchā’ti. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, tehi, bhikkhave, bhikkhūhi sabbeheva yattha jānanti uposathaṃ vā uposathakammaṃ vā pātimokkhaṃ vā pātimokkhuddesaṃ vā, so āvāso gantabbo. No ce gaccheyyuṃ, āpatti dukkaṭassa. Idha pana, bhikkhave, aññatarasmiṃ āvāse sambahulā bhikkhū vassaṃ vasanti bālā abyattā, te na jānanti uposathaṃ vā uposathakammaṃ vā pātimokkhaṃ vā pātimokkhuddesaṃ vā. Tehi, bhikkhave, bhikkhūhi eko bhikkhu sāmantā āvāsā sajjukaṃ pāhetabbo ‘gacchāvuso saṃkhittena vā vitthārena vā pātimokkhaṃ pariyāpuṇitvā āgacchā’ti. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, eko bhikkhu sattāhakālikaṃ pāhetabbo ‘gacchāvuso saṃkhittena vā vitthārena vā pātimokkhaṃ pariyāpuṇitvā āgacchā’ti. Evañcetaṃ labhetha, iccetaṃ kusalaṃ. No ce labhetha, na, bhikkhave, tehi bhikkhūhi tasmiṃ āvāse vassaṃ vasitabbaṃ, vaseyyuṃ ce, āpatti dukkaṭassāti’’ (mahāva. 163)."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Evaṃ bahisīmato āgatassapi saṅghassa upakāraṃ kātuṃ sakkontassa visiṭṭhaguṇayuttassa dātabbabhāvo viññāyati, tasmā ‘‘amhākaṃ gaṇo na hoti, amhākaṃ vaṃso paveṇī na hoti, amhākaṃ sandiṭṭhasambhatto na hotī’’tiādīni vatvā na paṭikkhipitabbo. Gaṇādibhāvo hi appamāṇaṃ, yathāvuttabahūpakāratādibhāvoyeva pamāṇaṃ. Sāmaggikaraṇato paṭṭhāya hi samānagaṇo hoti. Tathā hi ukkhittānuvattakānaṃ laddhinānāsaṃvāsakānampi laddhivissajjanena tividhaukkhepanīyakammakatānaṃ kammanānāsaṃvāsakānampi osāraṇaṃ katvā sāmaggikaraṇena saṃvāso bhagavatā anuññāto. Alajjiṃ pana bahussutampi saṅgahaṃ kātuṃ na vaṭṭati. So hi alajjīparisaṃ vaḍḍhāpeti, lajjīparisaṃ hāpeti. Bhaṇḍanakārakaṃ pana vihāratopi nikkaḍḍhitabbaṃ. Tathā hi ‘‘bhaṇḍanakārakakalahakārakameva sakalasaṅghārāmato nikkaḍḍhituṃ labhati. So hi pakkhaṃ labhitvā saṅghampi bhindeyya. Alajjīādayo pana attano vasanaṭṭhānatoyeva nikkaḍḍhitabbā, sakalasaṅghārāmato nikkaḍḍhituṃ na vaṭṭatī’’ti aṭṭhakathāyaṃ (pāci. aṭṭha. 128) vuttaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Vuḍḍhāpacāyanādisāmaggirasarahitaṃ visabhāgapuggalampi saṅgahaṃ kātuṃ na labhati. Vuttañhi ‘‘evarūpena hi visabhāgapuggalena ekavihāre vā ekapariveṇe vā vasantena attho natthi, tasmā sabbatthevassa nivāso vārito’’ti (pāci. aṭṭha. 122), tasmā āvāsiko vā hotu ",
      " āgantuko vā, sagaṇo vā hotu aññagaṇo ",
      " vā, bahussutasīlavantabhūto bhikkhu saṅgahetabbo. Vuttañhi bhagavatā –"
    ],
    "innerText": "Vuḍḍhāpacāyanādisāmaggirasarahitaṃ visabhāgapuggalampi saṅgahaṃ kātuṃ na labhati. Vuttañhi ‘‘evarūpena hi visabhāgapuggalena ekavihāre vā ekapariveṇe vā vasantena attho natthi, tasmā sabbatthevassa nivāso vārito’’ti (pāci. aṭṭha. 122), tasmā āvāsiko vā hotu āgantuko vā, sagaṇo vā hotu aññagaṇo vā, bahussutasīlavantabhūto bhikkhu saṅgahetabbo. Vuttañhi bhagavatā –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Bahussutaṃ dhammadharaṃ, sappaññaṃ buddhasāvakaṃ;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Nekkhaṃ jambonadasseva, ko taṃ nanditumarahati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Devāpi naṃ pasaṃsanti, brahmunāpi pasaṃsito’’ti. (a. ni. 4.6) –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "unindented"
    },
    "innerText": "Ayaṃ antosīmaṭṭhena saṅghena bahūpakāratāguṇavisiṭṭhatāsaṅkhātehi guṇehi yuttassa saṅghabhāranitthārakassa bhikkhuno phāsukaṃ āvāsaṃ anuṭṭhāpanīyaṃ katvā dāne vinicchayo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Yadā pana saṅghatthero jarādubbalatāya vā rogapīḷitatāya vā vivekajjhāsayatāya vā gaṇaṃ apariharitukāmo aññassa dātukāmo, attano accayena vā kalahavivādābhāvamicchanto saddhivihārikādīnaṃ niyyātetukāmo hoti, tadā na attano issaravatāya dātabbaṃ, ayaṃ vihāro saṅghiko, tasmā saṅghaṃ sannipātāpetvā taṃ kāraṇaṃ ācikkhitvā bahūpakāratāguṇavisiṭṭhatāyuttapuggalo vicināpetabbo. Tato saṅgho cattāri agatigamanāni anupagantvā bhagavato ajjhāsayānurūpaṃ lajjīpesalabahussutasikkhākāmabhūtaṃ puggalaṃ vicinitvā ‘‘ayaṃ bhikkhu imassa vihārassa anucchaviko’’ti āroceti. Mahātherassapi tameva ruccati, iccetaṃ kusalaṃ. No ce ruccati, attano bhārabhūtaṃ vuttappakāraaṅgaviyuttaṃ puggalaṃ dātukāmo hoti. Evaṃ sante saṅgho chandādiagatiṃ na gacchati, puggalova gacchati, tasmā saṅghasseva anumatiyā vihāro dātabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Sace pana saṅgho yaṃ kañci āmisaṃ labhitvā yathāvuttaguṇaviyuttassa bhikkhuno dātukāmo hoti, puggalo ",
      " pana bhagavato ajjhāsayānurūpaṃ vuttappakāraaṅgayuttabhūtasseva bhikkhussa dātukāmo, tadā puggalopi saṅghapariyāpannoyevāti katvā dhammakammakārakassa puggalasseva anumatiyā vihāro dātabbo, na saṅghānumatiyā. Vuttañhetaṃ aṭṭhakathāyaṃ (pārā. aṭṭha. 2.538-539) ‘‘sace saṅgho kiñci labhitvā āmisagarukatāya na nivāreti, eko bhikkhu nivāreti, sova bhikkhu issaro. Saṅghikesu hi kammesu yo dhammakammaṃ karoti, sova issaro’’ti. Vuttañhi –"
    ],
    "innerText": "Sace pana saṅgho yaṃ kañci āmisaṃ labhitvā yathāvuttaguṇaviyuttassa bhikkhuno dātukāmo hoti, puggalo pana bhagavato ajjhāsayānurūpaṃ vuttappakāraaṅgayuttabhūtasseva bhikkhussa dātukāmo, tadā puggalopi saṅghapariyāpannoyevāti katvā dhammakammakārakassa puggalasseva anumatiyā vihāro dātabbo, na saṅghānumatiyā. Vuttañhetaṃ aṭṭhakathāyaṃ (pārā. aṭṭha. 2.538-539) ‘‘sace saṅgho kiñci labhitvā āmisagarukatāya na nivāreti, eko bhikkhu nivāreti, sova bhikkhu issaro. Saṅghikesu hi kammesu yo dhammakammaṃ karoti, sova issaro’’ti. Vuttañhi –"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "children": [
      "‘‘Chandā ",
      " dosā bhayā mohā;"
    ],
    "innerText": "‘‘Chandā dosā bhayā mohā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Yo dhammaṃ ativattati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Nihīyati tassa yaso;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Kāḷapakkheva candimā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "‘‘Chandā dosā bhayā mohā;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha2"
    },
    "innerText": "Yo dhammaṃ nātivattati;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha3"
    },
    "innerText": "Āpūrati tassa yaso;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Sukkapakkheva candimā’’ti. (dī. ni. 3.246; a. ni. 4.17-18; pāri. 382, 386);"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Yadā pana theropi kiñci avatvā yathākammaṅgato, saṅghopi na kassaci vicāreti, evaṃ saṅghikavihāre abhikkhuke suññe vattamāne tasmiṃ dese yena kenaci sāsanassa vuddhimicchantena ācariyena antosīmaṭṭhakā bhikkhū evaṃ samussāhetabbā ‘‘mā tumhe āyasmanto evaṃ akattha, antosīmaṭṭhakesu bhikkhūsu bahūpakāratādiyuttaṃ puggalaṃ vicinatha, vicinitvā labhantā tassa puggalassa samaggena saṅghena dhuvavāsatthāya vihāraṃ anuṭṭhāpanīyaṃ katvā detha, no ce antosīmaṭṭhakesu bhikkhūsu alattha, atha bahisīmaṭṭhakesu bhikkhūsu vicinatha. Bahisīmaṭṭhakesu bhikkhūsu vicinitvā yathāvuttaaṅgayuttapuggale labbhamāne taṃ puggalaṃ antosīmaṃ pavesetvā ",
      " antosīmaṭṭhakassa saṅghassa anumatiyā dhuvavāsatthāya vihāraṃ sammannitvā anuṭṭhāpanīyaṃ katvā detha. Evaṃ karontā hi tumhe āyasmanto appicchakathā-santosakathā-sallekhakathā-pavivittakathāvīriyārambhakathā-sīlakathā-samādhikathā-paññākathā-vimuttikathā-vimuttiñāṇadassanakathāsaṅkhātadasakathāvatthusampannaṃ puggalaṃ upanissāya assutapubbaṃ dhammaṃ suṇissatha, sutapubbaṃ dhammaṃ pariyodāpissatha, kaṅkhaṃ vinodissatha, diṭṭhiṃ ujuṃ karissatha, cittaṃ pasādessatha. Yassa lajjino pesalassa bahussutassa sikkhākāmassa bhikkhuno bhikkhaṃ anusikkhamānā saddhāya vaḍḍhissanti, sīlena vaḍḍhissanti, sutena vaḍḍhissanti, cāgena vaḍḍhissanti, paññāya vaḍḍhissantī’’ti. Vuttañhetaṃ visuddhimagge (visuddhi. 1.14) ‘‘katamo upanissayagocaro dasakathāvatthuguṇasamannāgato kalyāṇamitto, yaṃ nissāya assutaṃ suṇāti, sutaṃ pariyodapeti, kaṅkhaṃ vitarati, diṭṭhiṃ ujuṃ karoti, cittaṃ pasādeti. Yassa vā anusikkhamāno saddhāya vaḍḍhati, sīlena vaḍḍhati, sutena vaḍḍhati ",
      ", cāgena vaḍḍhati, paññāya vaḍḍhati, ayaṃ vuccati upanissayagocaro’’ti. Evaṃ samussāhetvā dhammakathaṃ katvā antosīmaṭṭhakasaṅgheneva dhuvavāsavihāro dāpetabboti."
    ],
    "innerText": "Yadā pana theropi kiñci avatvā yathākammaṅgato, saṅghopi na kassaci vicāreti, evaṃ saṅghikavihāre abhikkhuke suññe vattamāne tasmiṃ dese yena kenaci sāsanassa vuddhimicchantena ācariyena antosīmaṭṭhakā bhikkhū evaṃ samussāhetabbā ‘‘mā tumhe āyasmanto evaṃ akattha, antosīmaṭṭhakesu bhikkhūsu bahūpakāratādiyuttaṃ puggalaṃ vicinatha, vicinitvā labhantā tassa puggalassa samaggena saṅghena dhuvavāsatthāya vihāraṃ anuṭṭhāpanīyaṃ katvā detha, no ce antosīmaṭṭhakesu bhikkhūsu alattha, atha bahisīmaṭṭhakesu bhikkhūsu vicinatha. Bahisīmaṭṭhakesu bhikkhūsu vicinitvā yathāvuttaaṅgayuttapuggale labbhamāne taṃ puggalaṃ antosīmaṃ pavesetvā antosīmaṭṭhakassa saṅghassa anumatiyā dhuvavāsatthāya vihāraṃ sammannitvā anuṭṭhāpanīyaṃ katvā detha. Evaṃ karontā hi tumhe āyasmanto appicchakathā-santosakathā-sallekhakathā-pavivittakathāvīriyārambhakathā-sīlakathā-samādhikathā-paññākathā-vimuttikathā-vimuttiñāṇadassanakathāsaṅkhātadasakathāvatthusampannaṃ puggalaṃ upanissāya assutapubbaṃ dhammaṃ suṇissatha, sutapubbaṃ dhammaṃ pariyodāpissatha, kaṅkhaṃ vinodissatha, diṭṭhiṃ ujuṃ karissatha, cittaṃ pasādessatha. Yassa lajjino pesalassa bahussutassa sikkhākāmassa bhikkhuno bhikkhaṃ anusikkhamānā saddhāya vaḍḍhissanti, sīlena vaḍḍhissanti, sutena vaḍḍhissanti, cāgena vaḍḍhissanti, paññāya vaḍḍhissantī’’ti. Vuttañhetaṃ visuddhimagge (visuddhi. 1.14) ‘‘katamo upanissayagocaro dasakathāvatthuguṇasamannāgato kalyāṇamitto, yaṃ nissāya assutaṃ suṇāti, sutaṃ pariyodapeti, kaṅkhaṃ vitarati, diṭṭhiṃ ujuṃ karoti, cittaṃ pasādeti. Yassa vā anusikkhamāno saddhāya vaḍḍhati, sīlena vaḍḍhati, sutena vaḍḍhati , cāgena vaḍḍhati, paññāya vaḍḍhati, ayaṃ vuccati upanissayagocaro’’ti. Evaṃ samussāhetvā dhammakathaṃ katvā antosīmaṭṭhakasaṅgheneva dhuvavāsavihāro dāpetabboti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gatha1"
    },
    "innerText": "Evaṃ jinasāsanassa, vaḍḍhikāmo supesalo;"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "gathalast"
    },
    "innerText": "Akāsi paññavā bhikkhu, suṭṭhu āvāsanicchayanti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Iti vinayasaṅgahasaṃvaṇṇanābhūte vinayālaṅkāre"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Vihāravinicchayakathālaṅkāro."
  }
]