[
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "chapter"
    },
    "innerText": "3. Aniyatakaṇḍaṃ"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "1. Paṭhamaaniyatasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "443"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tena"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "samayena buddho bhagavā"
      },
      "ti paṭhamaaniyatasikkhāpadaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kālayuttaṃ samullapanto"
      },
      "ti kālaṃ sallakkhetvā yadā na añño koci samīpena gacchati vā āgacchati vā tadā tadanurūpaṃ ‘‘kacci na ukkaṇṭhasi, na kilamasi, na chātāsī’’tiādikaṃ gehassitaṃ kathaṃ kathento. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Kālayuttaṃ dhammaṃ bhaṇanto"
      },
      "ti kālaṃ sallakkhetvā yadā añño koci samīpena gacchati vā āgacchati vā tadā tadanurūpaṃ ‘‘uposathaṃ kareyyāsi, salākabhattaṃ dadeyyāsī’’tiādikaṃ dhammakathaṃ kathento."
    ],
    "innerText": "443.Tenasamayena buddho bhagavāti paṭhamaaniyatasikkhāpadaṃ. Tattha kālayuttaṃ samullapantoti kālaṃ sallakkhetvā yadā na añño koci samīpena gacchati vā āgacchati vā tadā tadanurūpaṃ ‘‘kacci na ukkaṇṭhasi, na kilamasi, na chātāsī’’tiādikaṃ gehassitaṃ kathaṃ kathento. Kālayuttaṃ dhammaṃ bhaṇantoti kālaṃ sallakkhetvā yadā añño koci samīpena gacchati vā āgacchati vā tadā tadanurūpaṃ ‘‘uposathaṃ kareyyāsi, salākabhattaṃ dadeyyāsī’’tiādikaṃ dhammakathaṃ kathento."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Bahū dhītaro ca puttā ca assāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bahuputtā"
      },
      ". Tassā kira dasa puttā dasa dhītaro ahesuṃ, bahū nattāro assāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bahunattā"
      },
      ". Yatheva hi tassā evamassā puttadhītānampi vīsati vīsati dārakā ahesuṃ, iti sā vīsuttaracatusataputtanattaparivārā ahosi. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhimaṅgalasammatā"
      },
      "ti uttamamaṅgalasammatā. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yaññesū"
      },
      "ti dānappadānesu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Chaṇesū"
      },
      "ti āvāhavivāhamaṅgalādīsu antarussavesu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ussavesū"
      },
      "ti āsāḷhīpavāraṇanakkhattādīsu mahussavesu. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Paṭhamaṃ bhojentī"
      },
      "ti ‘‘imepi dārakā tayā samānāyukā nirogā hontū’’ti āyācantā paṭhamaṃyeva bhojenti, yepi saddhā honti pasannā, tepi bhikkhū bhojetvā tadanantaraṃ sabbapaṭhamaṃ taṃyeva bhojenti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nādiyī"
      },
      "ti tassā vacanaṃ na ādiyi, na gaṇhi, na vā ādaramakāsīti attho."
    ],
    "innerText": "Bahū dhītaro ca puttā ca assāti bahuputtā. Tassā kira dasa puttā dasa dhītaro ahesuṃ, bahū nattāro assāti bahunattā. Yatheva hi tassā evamassā puttadhītānampi vīsati vīsati dārakā ahesuṃ, iti sā vīsuttaracatusataputtanattaparivārā ahosi. Abhimaṅgalasammatāti uttamamaṅgalasammatā. Yaññesūti dānappadānesu. Chaṇesūti āvāhavivāhamaṅgalādīsu antarussavesu. Ussavesūti āsāḷhīpavāraṇanakkhattādīsu mahussavesu. Paṭhamaṃ bhojentīti ‘‘imepi dārakā tayā samānāyukā nirogā hontū’’ti āyācantā paṭhamaṃyeva bhojenti, yepi saddhā honti pasannā, tepi bhikkhū bhojetvā tadanantaraṃ sabbapaṭhamaṃ taṃyeva bhojenti. Nādiyīti tassā vacanaṃ na ādiyi, na gaṇhi, na vā ādaramakāsīti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "444-5"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Alaṃkammaniye"
      },
      "ti kammakkhamaṃ kammayogganti kammaniyaṃ, alaṃ pariyattaṃ kammaniyabhāvāyāti alaṃkammaniyaṃ, tasmiṃ alaṃkammaniye, yattha ajjhācāraṃ karontā sakkonti, taṃ kammaṃ ",
      " kātuṃ tādiseti attho. Tenevassa padabhājane vuttaṃ – ‘‘sakkā hoti methunaṃ dhammaṃ paṭisevitu’’nti, yattha methunaṃ dhammaṃ sakkā hoti paṭisevitunti vuttaṃ hoti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nisajjaṃ"
      },
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "kappeyyā"
      },
      "ti nisajjaṃ kareyya, nisīdeyyāti attho. Yasmā pana nisīditvāva ",
      " nipajjati, tenassa padabhājane ubhayampi vuttaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upanisinno"
      },
      "ti upagantvā nisinno. Evaṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "upanipanno"
      },
      "pi veditabbo. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Bhikkhu nisinne"
      },
      "ti bhikkhumhi nisinneti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Ubho vā nisinnā"
      },
      "ti dvepi apacchā apurimaṃ nisinnā. Ettha ca kiñcāpi pāḷiyaṃ ‘‘sotassa raho’’ti āgataṃ, cakkhussa raheneva pana paricchedo veditabbo. Sacepi hi pihitakavāṭassa gabbhassa dvāre nisinno viññū puriso hoti, neva anāpattiṃ karoti. Apihitakavāṭassa pana dvāre nisinno anāpattiṃ karoti. Na kevalañca dvāre antodvādasahatthepi okāse nisinno, sace sacakkhuko vikkhittopi niddāyantopi anāpattiṃ karoti. Samīpe ṭhitopi andho na karoti, cakkhumāpi nipajjitvā niddāyanto na karoti. Itthīnaṃ pana satampi anāpattiṃ na karotiyeva."
    ],
    "innerText": "444-5.Alaṃkammaniyeti kammakkhamaṃ kammayogganti kammaniyaṃ, alaṃ pariyattaṃ kammaniyabhāvāyāti alaṃkammaniyaṃ, tasmiṃ alaṃkammaniye, yattha ajjhācāraṃ karontā sakkonti, taṃ kammaṃ kātuṃ tādiseti attho. Tenevassa padabhājane vuttaṃ – ‘‘sakkā hoti methunaṃ dhammaṃ paṭisevitu’’nti, yattha methunaṃ dhammaṃ sakkā hoti paṭisevitunti vuttaṃ hoti. Nisajjaṃkappeyyāti nisajjaṃ kareyya, nisīdeyyāti attho. Yasmā pana nisīditvāva nipajjati, tenassa padabhājane ubhayampi vuttaṃ. Tattha upanisinnoti upagantvā nisinno. Evaṃ upanipannopi veditabbo. Bhikkhu nisinneti bhikkhumhi nisinneti attho. Ubho vā nisinnāti dvepi apacchā apurimaṃ nisinnā. Ettha ca kiñcāpi pāḷiyaṃ ‘‘sotassa raho’’ti āgataṃ, cakkhussa raheneva pana paricchedo veditabbo. Sacepi hi pihitakavāṭassa gabbhassa dvāre nisinno viññū puriso hoti, neva anāpattiṃ karoti. Apihitakavāṭassa pana dvāre nisinno anāpattiṃ karoti. Na kevalañca dvāre antodvādasahatthepi okāse nisinno, sace sacakkhuko vikkhittopi niddāyantopi anāpattiṃ karoti. Samīpe ṭhitopi andho na karoti, cakkhumāpi nipajjitvā niddāyanto na karoti. Itthīnaṃ pana satampi anāpattiṃ na karotiyeva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Saddheyyavacasā"
      },
      "ti saddhātabbavacanā. Sā pana yasmā ariyasāvikāva hoti, tenassa padabhājane ‘‘āgataphalā’’tiādi vuttaṃ. Tattha āgataṃ phalaṃ assāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "āgataphalā"
      },
      " paṭiladdhasotāpattiphalāti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Abhisametāvinī"
      },
      "ti paṭividdhacatusaccā. Viññātaṃ sikkhattayasāsanaṃ etāyāti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "viññātasāsanā. Nisajjaṃ bhikkhu paṭijānamāno"
      },
      "ti kiñcāpi evarūpā upāsikā disvā vadati, atha kho bhikkhu nisajjaṃ paṭijānamānoyeva tiṇṇaṃ dhammānaṃ aññatarena kāretabbo, na appaṭijānamānoti attho."
    ],
    "innerText": "Saddheyyavacasāti saddhātabbavacanā. Sā pana yasmā ariyasāvikāva hoti, tenassa padabhājane ‘‘āgataphalā’’tiādi vuttaṃ. Tattha āgataṃ phalaṃ assāti āgataphalā paṭiladdhasotāpattiphalāti attho. Abhisametāvinīti paṭividdhacatusaccā. Viññātaṃ sikkhattayasāsanaṃ etāyāti viññātasāsanā. Nisajjaṃ bhikkhu paṭijānamānoti kiñcāpi evarūpā upāsikā disvā vadati, atha kho bhikkhu nisajjaṃ paṭijānamānoyeva tiṇṇaṃ dhammānaṃ aññatarena kāretabbo, na appaṭijānamānoti attho."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Yena vā sā saddheyyavacasā upāsikā vadeyya tena so bhikkhu kāretabbo"
      },
      "ti nisajjādīsu ākāresu yena vā ākārena saddhiṃ methunadhammādīni āropetvā sā upāsikā vadeyya, paṭijānamānova tena so bhikkhu kāretabbo. Evarūpāyapi upāsikāya vacanamattena na kāretabboti attho. Kasmā? Yasmā diṭṭhaṃ nāma tathāpi hoti, aññathāpi hoti."
    ],
    "innerText": "Yena vā sā saddheyyavacasā upāsikā vadeyya tena so bhikkhu kāretabboti nisajjādīsu ākāresu yena vā ākārena saddhiṃ methunadhammādīni āropetvā sā upāsikā vadeyya, paṭijānamānova tena so bhikkhu kāretabbo. Evarūpāyapi upāsikāya vacanamattena na kāretabboti attho. Kasmā? Yasmā diṭṭhaṃ nāma tathāpi hoti, aññathāpi hoti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Tadatthajotanatthañca idaṃ vatthuṃ udāharanti – mallārāmavihāre ",
      " kira eko khīṇāsavatthero ekadivasaṃ upaṭṭhākakulaṃ gantvā antogehe nisīdi, upāsikāpi sayanapallaṅkaṃ nissāya ṭhitā hoti. Atheko piṇḍacāriko dvāre ṭhito disvā ‘‘thero upāsikāya saddhiṃ ekāsane nisinno’’ti saññaṃ paṭilabhitvā punappunaṃ olokesi. Theropi ‘‘ayaṃ mayi asuddhaladdhiko jāto’’ti sallakkhetvā katabhattakicco vihāraṃ gantvā attano vasanaṭṭhānaṃ pavisitvā antova nisīdi. Sopi bhikkhu ‘‘theraṃ codessāmī’’ti ",
      " āgantvā ukkāsitvā dvāraṃ vivari. Thero tassa cittaṃ ñatvā ākāse uppatitvā kūṭāgārakaṇṇikaṃ nissāya pallaṅkena nisīdi. Sopi bhikkhu ",
      " anto pavisitvā mañcañca heṭṭhāmañcañca oloketvā theraṃ apassanto uddhaṃ ullokesi, atha ākāse nisinnaṃ theraṃ disvā ‘‘bhante, evaṃ mahiddhikā nāma tumhe mātugāmena saddhiṃ ekāsane nisinnabhāvaṃ vadāpetha evā’’ti āha. Thero ‘‘antaragharasseveso āvuso doso, ahaṃ pana taṃ saddhāpetuṃ asakkonto evamakāsiṃ, rakkheyyāsi ma’’nti vatvā otarīti."
    ],
    "innerText": "Tadatthajotanatthañca idaṃ vatthuṃ udāharanti – mallārāmavihāre kira eko khīṇāsavatthero ekadivasaṃ upaṭṭhākakulaṃ gantvā antogehe nisīdi, upāsikāpi sayanapallaṅkaṃ nissāya ṭhitā hoti. Atheko piṇḍacāriko dvāre ṭhito disvā ‘‘thero upāsikāya saddhiṃ ekāsane nisinno’’ti saññaṃ paṭilabhitvā punappunaṃ olokesi. Theropi ‘‘ayaṃ mayi asuddhaladdhiko jāto’’ti sallakkhetvā katabhattakicco vihāraṃ gantvā attano vasanaṭṭhānaṃ pavisitvā antova nisīdi. Sopi bhikkhu ‘‘theraṃ codessāmī’’ti āgantvā ukkāsitvā dvāraṃ vivari. Thero tassa cittaṃ ñatvā ākāse uppatitvā kūṭāgārakaṇṇikaṃ nissāya pallaṅkena nisīdi. Sopi bhikkhu anto pavisitvā mañcañca heṭṭhāmañcañca oloketvā theraṃ apassanto uddhaṃ ullokesi, atha ākāse nisinnaṃ theraṃ disvā ‘‘bhante, evaṃ mahiddhikā nāma tumhe mātugāmena saddhiṃ ekāsane nisinnabhāvaṃ vadāpetha evā’’ti āha. Thero ‘‘antaragharasseveso āvuso doso, ahaṃ pana taṃ saddhāpetuṃ asakkonto evamakāsiṃ, rakkheyyāsi ma’’nti vatvā otarīti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "446"
      },
      ". Ito paraṃ ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "sā ce evaṃ vadeyyā"
      },
      "tiādi sabbaṃ paṭiññāya kāraṇākāradassanatthaṃ vuttaṃ, tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mātugāmassa methunaṃ dhammaṃ paṭisevanto"
      },
      "ti mātugāmassa magge methunaṃ dhammaṃ paṭisevantoti attho. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Nisajjāya kāretabbo"
      },
      "ti nisajjaṃ paṭijānitvā methunadhammapaṭisevanaṃ appaṭijānanto methunadhammapārājikāpattiyā akāretvā nisajjāmattena yaṃ āpattiṃ āpajjati tāya kāretabbo, pācittiyāpattiyā kāretabboti attho. Etena nayena sabbacatukkesu vinicchayo veditabbo."
    ],
    "innerText": "446. Ito paraṃ sā ce evaṃ vadeyyātiādi sabbaṃ paṭiññāya kāraṇākāradassanatthaṃ vuttaṃ, tattha mātugāmassa methunaṃ dhammaṃ paṭisevantoti mātugāmassa magge methunaṃ dhammaṃ paṭisevantoti attho. Nisajjāya kāretabboti nisajjaṃ paṭijānitvā methunadhammapaṭisevanaṃ appaṭijānanto methunadhammapārājikāpattiyā akāretvā nisajjāmattena yaṃ āpattiṃ āpajjati tāya kāretabbo, pācittiyāpattiyā kāretabboti attho. Etena nayena sabbacatukkesu vinicchayo veditabbo."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "451"
      },
      ". Sikkhāpadapariyosāne pana āpattānāpattiparicchedadassanatthaṃ vuttesu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gamanaṃ paṭijānātī"
      },
      "tiādīsu ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gamanaṃ paṭijānātī"
      },
      "ti ‘‘rahonisajjassādatthaṃ gatomhī’’ti evaṃ gamanaṃ paṭijānāti, ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "nisajja"
      },
      "nti nisajjassādeneva nisajjaṃ paṭijānāti. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āpatti"
      },
      "nti tīsu aññataraṃ āpattiṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Āpattiyā kāretabbo"
      },
      "ti tīsu yaṃ paṭijānāti, tāya kāretabbo. Sesamettha catukke uttānādhippāyameva. Dutiyacatukke pana ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "gamanaṃ na paṭijānātī"
      },
      "ti raho nisajjassādavasena na paṭijānāti ",
      ", ‘‘salākabhattādinā attano kammena gatomhi, sā pana mayhaṃ nisinnaṭṭhānaṃ āgatā’’ti vadati. Sesametthāpi uttānādhippāyameva."
    ],
    "innerText": "451. Sikkhāpadapariyosāne pana āpattānāpattiparicchedadassanatthaṃ vuttesu gamanaṃ paṭijānātītiādīsu gamanaṃ paṭijānātīti ‘‘rahonisajjassādatthaṃ gatomhī’’ti evaṃ gamanaṃ paṭijānāti, nisajjanti nisajjassādeneva nisajjaṃ paṭijānāti. Āpattinti tīsu aññataraṃ āpattiṃ. Āpattiyā kāretabboti tīsu yaṃ paṭijānāti, tāya kāretabbo. Sesamettha catukke uttānādhippāyameva. Dutiyacatukke pana gamanaṃ na paṭijānātīti raho nisajjassādavasena na paṭijānāti , ‘‘salākabhattādinā attano kammena gatomhi, sā pana mayhaṃ nisinnaṭṭhānaṃ āgatā’’ti vadati. Sesametthāpi uttānādhippāyameva."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Ayaṃ pana sabbattha vinicchayo – ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "raho nisajjassādo"
      },
      "ti methunadhammasannissitakileso vuccati. Yo bhikkhu tenassādena mātugāmassa santikaṃ gantukāmo akkhiṃ añjeti, dukkaṭaṃ. Nivāsanaṃ nivāseti, kāyabandhanaṃ bandhati, cīvaraṃ pārupati, sabbattha payoge payoge dukkaṭaṃ. Gacchati, padavāre padavāre dukkaṭaṃ. Gantvā nisīdati, dukkaṭameva. Mātugāme āgantvā nisinnamatte ",
      " pācittiyaṃ. Sace sā itthī kenaci karaṇīyena uṭṭhāyuṭṭhāya punappunaṃ nisīdati, nisajjāya nisajjāya pācittiyaṃ. Yaṃ sandhāya gato, sā na diṭṭhā, aññā āgantvā nisīdati, assāde uppanne pācittiyaṃ. ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Mahāpaccariyaṃ"
      },
      " pana ‘‘gamanakālato paṭṭhāya asuddhacittattā āpattiyevā’’ti vuttaṃ. Sace sambahulā āgacchanti, mātugāmagaṇanāya pācittiyāni. Sace uṭṭhāyuṭṭhāya punappunaṃ nisīdanti, nisajjāgaṇanāya pācittiyāni. Aniyametvā ",
      " diṭṭhadiṭṭhāya saddhiṃ rahassādaṃ kappessāmīti gantvā nisinnassāpi āgatāgatānaṃ vasena punappunaṃ nisajjāvasena ca vuttanayeneva āpattiyo veditabbā. Sace suddhacittena gantvā nisinnassa santikaṃ āgantvā nisinnāya itthiyā rahassādo uppajjati anāpatti."
    ],
    "innerText": "Ayaṃ pana sabbattha vinicchayo – raho nisajjassādoti methunadhammasannissitakileso vuccati. Yo bhikkhu tenassādena mātugāmassa santikaṃ gantukāmo akkhiṃ añjeti, dukkaṭaṃ. Nivāsanaṃ nivāseti, kāyabandhanaṃ bandhati, cīvaraṃ pārupati, sabbattha payoge payoge dukkaṭaṃ. Gacchati, padavāre padavāre dukkaṭaṃ. Gantvā nisīdati, dukkaṭameva. Mātugāme āgantvā nisinnamatte pācittiyaṃ. Sace sā itthī kenaci karaṇīyena uṭṭhāyuṭṭhāya punappunaṃ nisīdati, nisajjāya nisajjāya pācittiyaṃ. Yaṃ sandhāya gato, sā na diṭṭhā, aññā āgantvā nisīdati, assāde uppanne pācittiyaṃ. Mahāpaccariyaṃ pana ‘‘gamanakālato paṭṭhāya asuddhacittattā āpattiyevā’’ti vuttaṃ. Sace sambahulā āgacchanti, mātugāmagaṇanāya pācittiyāni. Sace uṭṭhāyuṭṭhāya punappunaṃ nisīdanti, nisajjāgaṇanāya pācittiyāni. Aniyametvā diṭṭhadiṭṭhāya saddhiṃ rahassādaṃ kappessāmīti gantvā nisinnassāpi āgatāgatānaṃ vasena punappunaṃ nisajjāvasena ca vuttanayeneva āpattiyo veditabbā. Sace suddhacittena gantvā nisinnassa santikaṃ āgantvā nisinnāya itthiyā rahassādo uppajjati anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "innerText": "Samuṭṭhānādīni paṭhamapārājikasadisānevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Paṭhamaaniyatasikkhāpadavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "subhead"
    },
    "innerText": "2. Dutiyaaniyatasikkhāpadavaṇṇanā"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "452"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Tena samayena buddho bhagavā"
      },
      "ti dutiyaaniyatasikkhāpadaṃ. Tattha ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "bhagavatā paṭikkhitta"
      },
      "ntiādimhi ‘‘yaṃ eko ekāya raho paṭicchanne āsane alaṃkammaniye nisajjaṃ kappeyya, taṃ nisajjaṃ kappetuṃ paṭikkhitta’’nti evaṃ sambandho veditabbo. Itarathā hi ‘‘ekassa ekāyā’’ti vattabbaṃ siyā, kasmā? ‘‘Paṭikkhitta’’nti vuttattā. Sāmiatthe vā etaṃ paccattavacanaṃ veditabbaṃ."
    ],
    "innerText": "452.Tena samayena buddho bhagavāti dutiyaaniyatasikkhāpadaṃ. Tattha bhagavatā paṭikkhittantiādimhi ‘‘yaṃ eko ekāya raho paṭicchanne āsane alaṃkammaniye nisajjaṃ kappeyya, taṃ nisajjaṃ kappetuṃ paṭikkhitta’’nti evaṃ sambandho veditabbo. Itarathā hi ‘‘ekassa ekāyā’’ti vattabbaṃ siyā, kasmā? ‘‘Paṭikkhitta’’nti vuttattā. Sāmiatthe vā etaṃ paccattavacanaṃ veditabbaṃ."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "paranum"
        },
        "innerText": "453"
      },
      ".",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "Na heva kho pana paṭicchanna"
      },
      "nti ettha pana yampi bahi parikkhittaṃ anto vivaṭaṃ pariveṇaṅgaṇādi, tampi ",
      " antogadhanti veditabbaṃ. Evarūpañhi ṭhānaṃ appaṭicchanneyeva gahitanti ",
      {
        "tagName": "span",
        "attributes": {
          "name": "class",
          "value": "bld"
        },
        "innerText": "mahāpaccariyaṃ"
      },
      " vuttaṃ. Sesaṃ paṭhamasikkhāpadanayeneva veditabbaṃ. Kevalañhi idha itthīpi purisopi yo koci viññū anandho abadhiro antodvādasahatthe okāse ṭhito vā nisinno vā vikkhittopi niddāyantopi anāpattiṃ karoti. Badhiro pana cakkhumāpi andho vā abadhiropi na karoti. Pārājikāpattiñca parihāpetvā duṭṭhullavācāpatti vuttāti ayaṃ viseso. Sesaṃ purimasadisameva. Ubhayatthāpi ummattakaādikammikānaṃ anāpatti."
    ],
    "innerText": "453.Na heva kho pana paṭicchannanti ettha pana yampi bahi parikkhittaṃ anto vivaṭaṃ pariveṇaṅgaṇādi, tampi antogadhanti veditabbaṃ. Evarūpañhi ṭhānaṃ appaṭicchanneyeva gahitanti mahāpaccariyaṃ vuttaṃ. Sesaṃ paṭhamasikkhāpadanayeneva veditabbaṃ. Kevalañhi idha itthīpi purisopi yo koci viññū anandho abadhiro antodvādasahatthe okāse ṭhito vā nisinno vā vikkhittopi niddāyantopi anāpattiṃ karoti. Badhiro pana cakkhumāpi andho vā abadhiropi na karoti. Pārājikāpattiñca parihāpetvā duṭṭhullavācāpatti vuttāti ayaṃ viseso. Sesaṃ purimasadisameva. Ubhayatthāpi ummattakaādikammikānaṃ anāpatti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "bodytext"
    },
    "children": [
      "Samuṭṭhānādīsu ",
      " idaṃsikkhāpadaṃ tisamuṭṭhānaṃ – kāyacittato, vācācittato, kāyavācācittato ca samuṭṭhāti. Kiriyaṃ, saññāvimokkhaṃ, sacittakaṃ, lokavajjaṃ, kāyakammaṃ, vacīkammaṃ, akusalacittaṃ, sukhamajjhattavedanāhi dvivedanaṃ. Sesaṃ uttānatthamevāti."
    ],
    "innerText": "Samuṭṭhānādīsu idaṃsikkhāpadaṃ tisamuṭṭhānaṃ – kāyacittato, vācācittato, kāyavācācittato ca samuṭṭhāti. Kiriyaṃ, saññāvimokkhaṃ, sacittakaṃ, lokavajjaṃ, kāyakammaṃ, vacīkammaṃ, akusalacittaṃ, sukhamajjhattavedanāhi dvivedanaṃ. Sesaṃ uttānatthamevāti."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Dutiyaaniyatasikkhāpadavaṇṇanā niṭṭhitā."
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Samantapāsādikāya vinayasaṃvaṇṇanāya"
  },
  {
    "tagName": "p",
    "attributes": {
      "name": "class",
      "value": "centered"
    },
    "innerText": "Aniyatavaṇṇanā niṭṭhitā."
  }
]